{
 "id": "337647",
 "text": "A list of American movies released in 1991. The Silence of the Lambs won the Academy Award for Best Picture. ==Highest earning films== # Terminator 2: Judgment Day # Robin Hood: Prince of Thieves # Beauty and the Beast # The Addams Family # City Slickers # Star Trek VI: The Undiscovered Country # Thelma & Louise # Fried Green Tomatoes # Hot Shots! # JFK ===A-Z=== Title Director Cast Genre Notes 29th Street George Gallo Danny Aiello, Anthony LaPaglia Comedy-drama The Addams Family Barry Sonnenfeld Anjelica Huston, Raúl Juliá, Christopher Lloyd, Christina Ricci Comedy based on characters created by Charles Addams All I Want for Christmas Robert Lieberman Harley Jane Kozak, Thora Birch Comedy An American Tail: Fievel Goes West James Stewart, John Cleese, Amy Irving (voices) Animated sequel to An American Tail And the Sea Will Tell Rachel Ward, James Brolin, Richard Crenna, Deidre Hall Drama Made for TV Another You Maurice Phillips Richard Pryor, Gene Wilder Comedy At Play in the Fields of the Lord Hector Babenco Tom Berenger, Aidan Quinn, Daryl Hannah, John Lithgow, Kathy Bates, Tom Waits Drama Based on a novel by Peter Matthiessen Backdraft Ron Howard Kurt Russell, William Baldwin, Robert De Niro, Scott Glenn, Donald Sutherland, Jennifer Jason Leigh, Rebecca De Mornay, Jason Gedrick, J.T. Walsh Drama 3 Academy Award nominations Barton Fink Joel Coen John Turturro, John Goodman, John Mahoney, Judy Davis, Michael Lerner Drama Beauty and the Beast Gary Trousdale, Kirk Wise Robby Benson, Paige O'Hara, Jerry Orbach, Angela Lansbury (voices) Animated 6 Academy Award nominations Bill & Ted's Bogus Journey Peter Hewitt Keanu Reeves, Alex Winter, Joss Ackland, Pam Grier, George Carlin Comedy sequel to Bill & Ted's Excellent Adventure Billy Bathgate Robert Benton Dustin Hoffman, Bruce Willis, Nicole Kidman, Steven Hill, Loren Dean Drama based on E. L. Doctorow novel Bingo Matthew Robbins Cindy Williams, David Rasche Family Blue Desert Bradley Battersby Courteney Cox, D. B. Sweeney Thriller Body Parts Eric Red Jeff Fahey, Kim Delaney Horror based on the novel Et mon tout est un homme by Boileau-Narcejac The Boneyard James Cummins Ed Nelson, Norman Fell Horror The Borrower John McNaughton Rae Dawn Chong Horror Boyz n the Hood John Singleton Ice Cube, Cuba Gooding, Jr., Morris Chestnut, Laurence Fishburne, Angela Bassett, Nia Long Drama 2 Oscar nominations Breathing Fire Lou Kennedy Jonathan Quan Martial arts Bride of Re-Animator Brian Yuzna Bruce Abbott Horror sequel to Re-Animator A Brief History of Time Errol Morris Documentary Brother Future Ray Capanella II Phil Lewis, Moses Gunn Sci-fi Bugsy Barry Levinson Warren Beatty, Annette Bening, Ben Kingsley, Harvey Keitel, Joe Mantegna, Elliott Gould, Wendy Phillips, Bebe Neuwirth, Bill Graham Drama, biopic 11 Academy Award nominations; based on life of Bugsy Siegel The Butcher's Wife Terry Hughes Demi Moore, Jeff Daniels Comedy Cape Fear Martin Scorsese Robert De Niro, Nick Nolte, Jessica Lange, Juliette Lewis, Robert Mitchum, Gregory Peck, Joe Don Baker, Fred Dalton Thompson, Illeana Douglas Thriller remake of 1962 movie; nominated for 2 Academy Awards Captain America Albert Pyun Matt Salinger, Ronny Cox, Ned Beatty Action based on the Marvel comic Career Opportunities Bryan Gordon Jennifer Connelly, Frank Whaley Comedy John Hughes script Children of the Night Tony Randel Ami Dolenz, Karen Black Horror Child's Play 3 Jack Bender Brad Dourif Horror Chopper Chicks in Zombietown Dan Hoskins Vicki Frederick, Billy Bob Thornton Comedy, horror Chuck Amuck: The Movie Chuck Jones Documentary City of Hope John Sayles Vincent Spano, Chris Cooper, Joe Morton, Angela Bassett Drama City Slickers Ron Underwood Billy Crystal, Daniel Stern, Bruno Kirby, Patricia Wettig, Helen Slater, Jack Palance Comedy Academy Award for Palance Class Action Michael Apted Gene Hackman, Mary Elizabeth Mastrantonio Drama Class of Nuke 'Em High II: Subhumanoid Meltdown Eric Louzil, Donald Jackson Lisa Gaye Action, Horror sequel to Class of Nuke 'Em High Closet Land Radha Bharadwaj Madeleine Stowe, Alan Rickman Drama The Commitments Alan Parker Drama, Musical Company Business Nicholas Meyer Gene Hackman, Mikhail Baryshnikov Spy Cool as Ice David Kellogg Vanilla Ice, Kristin Minter, Michael Gross, Candy Clark, Naomi Campbell Drama 7 Razzie nominations Curly Sue John Hughes Alisan Porter, James Belushi, Kelly Lynch Comedy Hughes's final movie The Dark Wind Errol Morris Lou Diamond Phillips, Fred Ward Crime Daughters of the Dust Julie Dash Drama Dead Again Kenneth Branagh Kenneth Branagh, Andy García, Emma Thompson Thriller Deceived Damian Harris Goldie Hawn, John Heard, Beatrice Straight, Jan Harvey Thriller Defending Your Life Albert Brooks Albert Brooks, Meryl Streep, Rip Torn, Lee Grant, Buck Henry Comedy Delirious Tom Mankiewicz John Candy, Mariel Hemingway, Emma Samms Comedy Do or Die Andy Sidaris Pat Morita, Erik Estrada Action preceded by Guns Doc Hollywood Michael Caton-Jones Michael J. Fox, Julie Warner, Woody Harrelson, Bridget Fonda Comedy The Doctor Randa Haines William Hurt, Christine Lahti, Mandy Patinkin, Adam Arkin Drama Dogfight Nancy Savoca River Phoenix, Lili Taylor Drama, War Don't Tell Mom the Babysitter's Dead Stephen Herek Christina Applegate, Joanna Cassidy, Keith Coogan, Josh Charles Comedy The Doors Oliver Stone Val Kilmer, Meg Ryan, Kyle MacLachlan, Kathleen Quinlan, Frank Whaley, Kevin Dillon, Josh Evans, Billy Idol Drama, biopic based on the music of Jim Morrison and The Doors Double Impact Sheldon Lettich Jean-Claude Van Damme Action Drop Dead Fred Ate de Jong Phoebe Cates, Rik Mayall Comedy, Family Dutch Peter Faiman Ed O'Neill, Ethan Embry, JoBeth Williams, Christopher McDonald Comedy Dying Young Joel Schumacher Julia Roberts, Campbell Scott Drama Edge of Honor Michael Spence Corey Feldman, Meredith Salenger Thriller Ernest Scared Stupid John R. Cherry III Jim Varney Comedy preceded by Ernest Goes to Jail Eve of Destruction Duncan Gibbins Gregory Hines, Renee Soutendijk Action F/X2 Richard Franklin Bryan Brown, Brian Dennehy, Rachel Ticotin, Joanna Gleason Suspense sequel to F/X Father of the Bride Charles Shyer Steve Martin, Diane Keaton, Kimberly Williams, Martin Short, George Newbern Comedy remake of 1950 movie Final Approach Eric Steven Stahl James Sikking, Hector Elizondo Action The Fisher King Terry Gilliam Robin Williams, Jeff Bridges, Mercedes Ruehl, Amanda Plummer Comedy-drama Academy Award for Ruehl Flight of the Intruder John Milius Danny Glover, Willem Dafoe, Brad Johnson Action For the Boys Mark Rydell Bette Midler, James Caan, George Segal, Arliss Howard, Arye Gross Drama Frankie and Johnny Garry Marshall Al Pacino, Michelle Pfeiffer, Hector Elizondo, Kate Nelligan Romance based on Terrence McNally play Freddy's Dead: The Final Nightmare Rachel Talalay Robert Englund, Lisa Zane Horror preceded by A Nightmare on Elm Street 5: The Dream Child Fried Green Tomatoes Jon Avnet Kathy Bates, Mary Stuart Masterson, Mary-Louise Parker, Jessica Tandy Comedy based on Fannie Flagg novel Grand Canyon Lawrence Kasdan Kevin Kline, Danny Glover, Alfre Woodard, Steve Martin, Mary-Louise Parker Drama Guilty by Suspicion Irwin Winkler Robert De Niro, Annette Bening, Patricia Wettig, George Wendt Drama Hangin' with the Homeboys Joseph Vasquez John Leguizamo, Mario Joyner, Doug E. Doug Comedy Hard Promises Martin Davidson Sissy Spacek, William Petersen Drama The Hard Way John Badham Michael J. Fox, James Woods, Annabella Sciorra, Stephen Lang Action comedy Harley Davidson and the Marlboro Man Simon Wincer Mickey Rourke, Don Johnson, Tom Sizemore, Tia Carrere Action He Said, She Said Ken Kwapis Kevin Bacon, Elizabeth Perkins, Nathan Lane, Sharon Stone Comedy Hear My Song Peter Chelsom Adrian Dunbar, David McCallum, Ned Beatty Comedy Hearts of Darkness: A Filmmaker's Apocalypse George Hickenlooper Eleanor Coppola (narrator) Documentary Based on the filming of Francis Coppola's Apocalypse Now The Heroes of Desert Storm Highlander II: The Quickening Russell Mulcahy Christopher Lambert, Virginia Madsen, Sean Connery, Michael Ironside Sci-Fi sequel to Highlander Highway 61 Bruce McDonald Valerie Buhagiar Drama The Hitman Aaron Norris Chuck Norris, Michael Parks Action Homicide David Mamet Joe Mantegna, William H. Macy, Ving Rhames Drama Hook Steven Spielberg Robin Williams, Dustin Hoffman, Julia Roberts, Bob Hoskins Adventure based on Peter Pan Hot Shots! Jim Abrahams Charlie Sheen, Cary Elwes, Valeria Golino, Lloyd Bridges, Jon Cryer Comedy, Spoof The Hours and Times Christopher Münch David Angus, Ian Hart Drama House Party 2 Comedy sequel to House Party Hudson Hawk Michael Lehmann Bruce Willis, Danny Aiello, Andie MacDowell, James Coburn, Sandra Bernhard, Richard E. Grant Comedy won 3 Razzie awards If Looks Could Kill (movie) William Dear Richard Grieco, Linda Hunt, Roger Rees, Gabrielle Anwar, Roger Daltrey Comedy The Indian Runner Sean Penn Viggo Mortenson, David Morse, Valeria Golino, Patricia Arquette, Charles Bronson Drama The Inner Circle Andrei Konchalovsky Tom Hulce, Lolita Davidovich, Bob Hoskins Drama JFK Oliver Stone Kevin Costner, Tommy Lee Jones, Gary Oldman, Joe Pesci, Kevin Bacon, Sissy Spacek, Donald Sutherland, Laurie Metcalf, John Candy, Ed Asner, Michael Rooker, Jack Lemmon, Walter Matthau Drama, Biopic based on the assassination of John F. Kennedy; nominated for 8 Academy Awards Johnny Suede Tom DiCillo Brad Pitt, Catherine Keener Comedy Jungle Fever Spike Lee Wesley Snipes, Annabella Sciorra, John Turturro Drama Kafka Steven Soderbergh Jeremy Irons, Alec Guinness, Theresa Russell, Ian Holm Mystery King Ralph David S. Ward John Goodman, Peter O'Toole, John Hurt Comedy A Kiss Before Dying James Dearden Matt Dillon, Sean Young, Max von Sydow, Diane Ladd, James Russo Thriller Remake of 1956 film L.A. Story Mick Jackson Steve Martin, Victoria Tennant, Marilu Henner, Sarah Jessica Parker Comedy The Last Boy Scout Tony Scott Bruce Willis, Damon Wayans Action Life Stinks Mel Brooks Mel Brooks, Lesley Ann Warren, Howard Morris, Jeffrey Tambor Comedy The Linguini Incident Richard Shepard David Bowie, Rosanna Arquette Little Man Tate Jodie Foster Jodie Foster, Dianne Wiest, Harry Connick Jr., Adam Hann-Byrd Drama Love Hurts Bud Yorkin Jeff Daniels, Judith Ivey, Cloris Leachman Drama Madonna: Truth or Dare Alek Keshishian Madonna Documentary The Man in the Moon Robert Mulligan Reese Witherspoon, Jason London, Sam Waterston, Tess Harper Drama The Marrying Man Jerry Rees Alec Baldwin, Kim Basinger Comedy McBain James Glickenhaus Christopher Walken, María Conchita Alonso, Michael Ironside Drama Meet the Applegates Michael Lehmann Ed Begley, Jr., Stockard Channing, Dabney Coleman Comedy Men of Respect William C. Reilly John Turturro, Rod Steiger, Dennis Farina, Stanley Tucci, Peter Boyle Crime drama Based on MacBeth Mississippi Masala Mira Nair Denzel Washington Drama Mobsters Michael Karbelnikoff Christian Slater, Patrick Dempsey, Richard Grieco, Costas Mandylor, Anthony Quinn, Michael Gambon, Lara Flynn Boyle, F. Murray Abraham Crime drama Mortal Thoughts Alan Rudolph Demi Moore, Glenne Headly, Harvey Keitel, Bruce Willis Suspense My Girl Howard Zieff Dan Aykroyd, Jamie Lee Curtis, Macaulay Culkin, Anna Chlumsky Comedy, Drama My Own Private Idaho Gus Van Sant Keanu Reeves, River Phoenix Avant-garde Mystery Date Jonathan Wacks Ethan Hawke, Teri Polo Teen Comedy The Naked Gun 2½: The Smell of Fear David Zucker Leslie Nielsen, Priscilla Presley, George Kennedy, O. J. Simpson, Robert Goulet Comedy preceded by The Naked Gun: From the Files of Police Squad! Naked Lunch David Cronenberg Peter Weller, Judy Davis, Roy Scheider Drama based on a book by William Burroughs Necessary Roughness Stan Dragoti Scott Bakula, Hector Elizondo, Sinbad, Robert Loggia, Kathy Ireland Comedy New Jack City Mario Van Peebles Wesley Snipes, Ice-T, Mario Van Peebles, Chris Rock, Judd Nelson Crime drama Night on Earth Jim Jarmusch Winona Ryder, Gena Rowlands, Roberto Benigni Comedy Not Without My Daughter Brian Gilbert Sally Field, Alfred Molina Drama story of Betty Mahmoody Nothing but Trouble Dan Aykroyd Chevy Chase, Demi Moore, John Candy, Dan Aykroyd Comedy 6 Razzie nominations Once Around Lasse Hallström Richard Dreyfuss, Holly Hunter, Danny Aiello Rom Com One Good Cop Heywood Gould Michael Keaton, Rene Russo, Anthony LaPaglia Crime Only the Lonely Chris Columbus John Candy, Maureen O'Hara, Ally Sheedy, James Belushi Comedy Oscar John Landis Sylvester Stallone, Ornella Muti, Peter Riegert, Vincent Spano, Marisa Tomei, Tim Curry Comedy Other People's Money Norman Jewison Danny DeVito, Gregory Peck, Penelope Ann Miller, Piper Laurie Drama, Comedy based on a play by Jerry Sterner Out for Justice John Flynn Steven Seagal, William Forsythe, Jerry Orbach Action Paradise MaryAgnes Donoghue Melanie Griffith, Don Johnson, Elijah Wood, Thora Birch Drama Paris Trout Stephen Gyllenhaal Dennis Hopper, Barbara Hershey, Ed Harris Drama The People Under the Stairs Wes Craven Everett McGill, Ving Rhames, Brandon Adams Horror Perfect Harmony Will Mackenzie The Perfect Weapon Jeff Speakman, Mako, Mariska Hargitay Action Point Break Kathryn Bigelow Patrick Swayze, Keanu Reeves, Lori Petty, Gary Busey Action Poison Todd Haynes Drama The Prince of Tides Barbra Streisand Nick Nolte, Barbra Streisand, Blythe Danner, Melinda Dillon, George Carlin Drama based on a novel by Pat Conroy Problem Child 2 Brian Levant John Ritter, Michael Oliver, Amy Yasbeck, Jack Warden, Laraine Newman, Ivyann Schwan, Gilbert Gottfried Comedy preceded by Problem Child Puppet Master II David W. Allen Elizabeth Maclellan, Collin Bernsen Horror Puppet Master III: Toulon's Revenge David DeCoteau Guy Rolfe, Sarah Douglas, Walter Gotell Horror Pure Luck Nadia Tass Martin Short, Danny Glover, Sheila Kelly Comedy A Rage in Harlem Bill Duke Forest Whitaker, Gregory Hines, Robin Givens Drama Rambling Rose Martha Coolidge Laura Dern, Diane Ladd, Robert Duvall, Lukas Haas Drama The Rapture Michael Tolkin Mimi Rogers, David Duchovny, Will Patton Drama Regarding Henry Mike Nichols Harrison Ford, Annette Bening, Donald Moffat, Bill Nunn Drama written by J.J. Abrams Return to the Blue Lagoon William A. Graham Milla Jovovich, Brian Krause Adventure sequel to The Blue Lagoon; 5 Razzie nominations Ricochet Russell Mulcahy Denzel Washington, John Lithgow, Lindsay Wagner Thriller Road to Ruin Charlotte Brandon Peter Weller, Carey Lowell Comedy Robin Hood: Prince of Thieves Kevin Reynolds Kevin Costner, Morgan Freeman, Mary Elizabeth Mastrantonio, Alan Rickman, Christian Slater Adventure remake of The Adventures of Robin Hood The Rocketeer Joe Johnston Billy Campbell, Jennifer Connelly, Timothy Dalton, Alan Arkin Action Rover Dangerfield James L. George Rodney Dangerfield, Ronnie Schell Animated Run Geoff Burrowes Patrick Dempsey, Kelly Preston Action Rush Lili Fini Zanuck Jason Patric, Jennifer Jason Leigh, Sam Elliott Drama Scenes from a Mall Paul Mazursky Woody Allen, Bette Midler Comedy Scissors Frank de Felitta Sharon Stone, Ronny Cox, Steve Railsback Thriller Scorchers David Beaird Faye Dunaway, James Earl Jones, Emily Lloyd, Jennifer Tilly Drama The Search for Signs of Intelligent Life in the Universe John Bailey Lily Tomlin Comedy Performance Sgt. Kabukiman N.Y.P.D. Shadows and Fog Woody Allen Woody Allen, John Cusack, Mia Farrow, Jodie Foster Comedy Shattered Wolfgang Petersen Tom Berenger, Greta Scacchi, Bob Hoskins, Joanne Whalley Suspense Shout Jamie Walters, Heather Graham, Linda Fiorentino, John Travolta Drama Showdown in Little Tokyo Mark L. Lester Dolph Lundgren, Brandon Lee Action The Silence of the Lambs Jonathan Demme Anthony Hopkins, Jodie Foster, Scott Glenn, Ted Levine, Frankie Faison, Anthony Heald, Kasi Lemmons, Diane Baker, Brooke Smith Thriller 5 Academy Awards; based on a novel by Thomas Harris Slacker Richard Linklater Experimental Sleeping with the Enemy Joseph Ruben Julia Roberts, Patrick Bergin, Kevin Anderson Thriller Soapdish Michael Hoffman Sally Field, Kevin Kline, Robert Downey, Jr., Elisabeth Shue, Cathy Moriarty, Whoopi Goldberg, Kathy Najimy, Carrie Fisher, Teri Hatcher Comedy Sometimes They Come Back Tom McLoughlin Tim Matheson, Brooke Adams Sci-Fi based on a story by Stephen King Star Trek VI: The Undiscovered Country Nicholas Meyer William Shatner, Leonard Nimoy, Christopher Plummer, Kim Cattrall, David Warner, Iman, Brock Peters, DeForest Kelley, Nichelle Nichols Sci-Fi preceded by Star Trek V: The Final Frontier Stepping Out Liza Minnelli, Julie Walters, Jane Krakowski, Bill Irwin, Ellen Greene, Shelley Winters, Sheila McCarthy, Andrea Martin, Carol Woods Drama, Musical based on a play by Richard Harris Stone Cold Craig Baxley Brian Bosworth, William Forsythe Action Straight Out of Brooklyn Matty Rich Larry Gilliard, Jr., Matty Rich Drama Strictly Business Kevin Hooks Tommy Davidson, Joseph C. Phillips, Anne-Marie Johnson Comedy Suburban Commando Burt Kennedy Hulk Hogan, Christopher Lloyd Sci-fi comedy The Super Rod Daniel Joe Pesci, Vincent Gardenia, Ruben Blades Comedy Switch Blake Edwards Ellen Barkin, Bruce Payne, Jimmy Smits, JoBeth Williams Comedy The Taking of Beverly Hills Sidney J. Furie Ken Wahl, Harley Jane Kozak Action Talkin' Dirty After Dark Topper Carew Martin Lawrence, Mark Curry Comedy Teenage Mutant Ninja Turtles II: The Secret of the Ooze Action comedy, Family preceded by Teenage Mutant Ninja Turtles Terminator 2: Judgment Day James Cameron Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, Edward Furlong Sci-Fi preceded by The Terminator Thelma & Louise Ridley Scott Susan Sarandon, Geena Davis, Harvey Keitel, Michael Madsen, Brad Pitt Drama 6 Oscar nominations Toy Soldiers Daniel Petrie, Jr. Sean Astin, Wil Wheaton, Louis Gossett, Jr., Denholm Elliott Thriller True Colors Herbert Ross John Cusack, James Spader, Richard Widmark Drama Widmark's final film True Identity Charles Lane Frank Langella, Lenny Henry Two Evil Eyes Dario Argento, George A. Romero Harvey Keitel, E.G. Marshall, Martin Balsam, Adrienne Barbeau Horror What About Bob? Frank Oz Bill Murray, Richard Dreyfuss, Julie Hagerty, Kathryn Erbe Comedy White Fang Randal Kleiser Ethan Hawke, Klaus Maria Brandauer Drama Whore Ken Russell Theresa Russell Drama Wild Hearts Can't Be Broken Steve Miner Gabrielle Anwar, Michael Schoeffling, Cliff Robertson Drama Year of the Gun John Frankenheimer Andrew McCarthy, Sharon Stone, Valeria Golino Thriller == Other websites == * American movies of 1991 at the Internet Movie Database Category:1991 in the United States American 1991 1991",
 "title": "List of American movies of 1991"
}