{
 "id": "337710",
 "text": "The Comparison of regions of Japan highlights differences and similarities. The regions of Japan are a fusion of historical divisions and modern administrative needs\".Japan Ministry of Foreign Affairs (MOFA), \"Regions of Japan\". Retrieved 2012-4-11. ==Geography and culture== The geography and administrative subdivisions of Japan have evolved and changed during the course of its history. Since the late-7th century, the regions of Japan have been grouped according to geographic position. In the Meiji period, the modern regional system was made by Imperial decree. Japan was divided into regions (chihō ). A regional council (chihō gyōsei kyōgisai) was headed by the governor of the most powerful prefecture in the regional grouping. The council also included regional chiefs of central government ministries. In this time, political development is marked by persistent loyalty to region and locality.Fraser, Andrew et al. (1995). Japan's early parliaments, 1890-1905: structure, issues, and trends, p. 67. ==Kansai region== The Kansai region is used as a basic framework for description and comparison. ===Kinai === Since the late-7th century, the Kinai region, also known as Go-Kinai, included the \"Five Home Provinces\" which surrounded the old capital city of Kyoto. In 645, Kinai was created as part of the Taika Reform. These lands are also called the Kansai region or Kinki. ===Table: Kansai region === Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Izumi Kinai Osaka Osaka Kansai created in 716 from Kawachi, then rejoined back in 740, later re-split in 757 Kawachi Kinai Osaka Osaka Kansai Settsu Osaka Kinai Hyōgo; Osaka Kobe; Osaka Kansai Yamashiro Kyoto Kinai Kyoto; Nara Kyoto; Nara Kansai Yamato Wakigami Kinai Nara Nara Kansai northern Nara without Yoshino ==Kantō region== The Kantō region is used as a basic framework for description and comparison. ===Tōkaidō === Since the late-7th century, the Tōkaidō region or \"Eastern Sea Circuit\" was made up of 15 provinces on the Pacific Ocean from Sendai Bay to Kinai. Fuji-san, Tokyo, Yokohama, and other important or well-known places are in this region. Tōkaidō also names a road which connects the provincial capitals of this region on the island of Honshū. ===Table: Kanto Region === Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Awa Minamibōsō Tōkaidō Chiba; Ibaraki Chiba; Mito Kantō created in 718 from Kazusa, then rejoined back in 741, later re-split in 781 Hitachi near Ishioka Tōkaidō Ibaraki Mito Kantō Iga Ueno Tōkaidō Mie Tsu Kansai created in 680 from Ise Ise Uji-Yamada Tōkaidō Mie Tsu Kansai Izu Tōkaidō Shizuoka; Tokyo Shizuoka; Tokyo Chūbu created 680 from Suruga Kai Tōkaidō Yamanashi Kōfu Chūbu Kazusa near Ichihara Tōkaidō Chiba Chiba Kantō created from Fusa in the 7th centur Mikawa Tōkaidō Aichi Nagoya Chūbu Musashi near Fuchu Tōkaidō Kanagawa; Tokyo; Saitama Yokohama; Tokyo; Saitama Kantō transferred in 771 from Tōsandō Owari near Inazawa Tōkaidō Aichi Nagoya Chūbu Sagami near Hiratsuka Tōkaidō Kanagawa Yokohama Kantō Shima Tōkaidō Mie Tsu Kansai created at the beginning of the 8th century from Ise Shimōsa Tōkaidō Chiba; Ibaraki Chiba; Mito Kantō created from Fusa in the 7th century Suruga Tōkaidō Shizuoka Shizuoka Chūbu Tōtōmi Tōkaidō Shizuoka Shizuoka Chūbu ==Tōhoku region== The Tōhoku region is used as a basic framework for description and comparison. ===Tōsandō=== Since the late-7th century, the Tōsandō region or \"Eastern Mountain Circuit\" was made up of 13 provinces. Tōsandō also names a road which connects the provincial capitals of this region on the island of Honshū. Tōsandō included Musashi Province after 711. ===Table: Tōhoku region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Hida Tōsandō Gifu capital city Chūbu notes Iwaki Tōsandō Fukushima; Miyagi Fukushima; Miyagi Tōhoku created during the Meiji Restoration in 1868 from Mutsu Iwashiro Tōsandō Fukushima Fukushima Tōhoku created during the Meiji Restoration in 1868 from Mutsu Kōzuke Maebashi Tōsandō Gunma Maebashi Kantō broke off from Kenu during the 4th century Mino near Gifu Tōsandō Gifu Gifu Chūbu notes Mutsu Tōsandō Aomori, Iwate Morioka Tōhoku created in the 7th century from Hitachi Ōmi Ōtsu Tōsandō Shiga Ōtsu Tōhoku notes Rikuchū Tōsandō Akita; Iwate; Miyagi Akita; Morioka; Sendai Tōhoku created during the Meiji Restoration in 1868 from Mutsu Rikuzen Tōsandō Iwate Morioka Tōhoku created during the Meiji Restoration in 1868 from Mutsu Shimotsuke Tōsandō Tochigi Utsunomiya Kantō created from Kenu during the 4th century Shinano Matsumoto Tōsandō Nagano Nagano Chūbu notes Suwa Tōsandō Nagano Nagano Chūbu created in 721 from Shinano, later rejoined back in 731 Uzen Tōsandō Yamagata Yamagata Tōhoku created from Dewa in 1868 Ugo Tōsandō Akita; Yamagata Akita; Yamagata Tōhoku created from Dewa during in 1868 ==Chūbu region== The Chūbu region is used as a basic framework for description and comparison. ===Hokurikudō=== Since the late-7th century, the Hokurikudō region or the \"Northern-land Circuit\" was made up of 7 provinces on the Sea of Japan. Hokurikudō also names a road which connects the provincial capitals of this region on the island of Honshū. ===Table: Chūbu region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Echigo Hokurikudō Niigata Niigata Chūbu created from Koshi in late-7th century Echizen Echizen Hokurikudō Fukui Fukui Chūbu created from Koshi in late-7th century Etchū Takaoka Hokurikudō Toyama Toyama Chūbu created from Koshi in late-7th century Kaga Hokurikudō Ishikawa Kanazawa Chūbu created in 823 from Echizen Noto Nanao Hokurikudō Ishikawa Kanazawa Chūbu created in 718 from Echizen, then part of Etchū in 741; split from Etchū in 757 Sado Hokurikudō Niigata Niigata Chūbu occupied in 743 by Echigo, later re-split in 752 Wakasa Obama Hokurikudō Fukui Fukui Chūbu ==Chūgoku region== The Chūgoku region is used as a basic framework for description and comparison. ===San'indō=== Since the late-7th century, the San'indō region or \"Mountain- shade Circuit\" was made up of 8 provinces on the Sea of Japan. San'indō also names a road which connects the provincial capitals of this region on the island of Honshū. ===San'yōdō=== Since the late-7th century, the San'yōdō region or \"Mountain-sun Circuit\" was made up of provinces on south or 'sunny' side of the mountains. San'indō also names a road which connects the 8 provincial capitals of this region on the island of Honshū. ===Table: Chūgoku region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Aki San'yōdō Hiroshima Hiroshima Chūgoku Bingo Fuchu San'yōdō Hiroshima Hiroshima Chūgoku created from Kibi in late-7th century Bitchū Soja San'yōdō Okayama Okayama Chūgoku created from Kibi in late-7th century Bizen near Okayama San'yōdō Okayama Okayama Chūgoku created from Kibi in late-7th century Harima Himeji San'yōdō Hyōgo Kobe Chūgoku Hōki near Kurayoshi San'indō Tottori Tottori Chūgoku Inaba Tottori San'indō Tottori Tottori Chūgoku Iwami Hamada San'indō Shimane Shimane Chūgoku Izumo Matsue San'indō Shimane Matsue Chūgoku Mimasaka, Tsuyama San'yōdō Okayama Okayama Chūgoku created in 713 from Bizen Nagato Shimonoseki San'yōdō Yamaguchi Yamaguchi Chūgoku Oki Saigō San'indō Shimane Shimane Chūgoku Suō Hofu San'yōdō Yamaguchi Yamaguchi Chūgoku Tajima Hidaka San'indō Hyōgo Kobe Chūgoku Tamba, Kameoka San'indō Hyōgo; Kyoto Kobe Chūgoku created from Ni in 713 Tango, Maizuru; Miyazu San'indō Kyoto Kyoto Chūgoku created from Ni in 713 ==Shikoku region== The Shikoku region is used as a basic framework for description and comparison. ===Nankaidō=== Since the late-7th century, the Nankaidō region or the \"South-sea Circuit\" made up of 6 provinces (the island of Awaji, the 4 provinces of Shikoku, and Kishiu on Honshū). Nankaidō also names a road which connects the provincial capitals of this region. ===Table: Shikoku region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Awa Nankaidō Tokushima Tokushima Shikoku Awaji Nankaidō Hyōgo Kobe Kansai Iyo Imabari Nankaidō Ehime Matsuyama Shikoku Kii Nankaidō Wakayama Wakayama Kansai Sanuki Nankaidō Kagawa Takamatsu Shikoku Tosa near Nantoku Nankaidō Kōchi Kōchi Shikoku ==Kyūshū region== The Kyūshū region is used as a basic framework for description and comparison. Since the late-7th century, the Saikaidō region or the \"West-sea Circuit\" was made up of the 9 provinces of the Kyūshū region. Saikaidō also names a road which connected the provincial capitals of this region. After 1878, the region included the Ryukyu Islands. ===Table: Kyūshū region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Buzen near Toyatsu Saikaidō Fukuoka; Ōita Fukuoka; Ōita Kyūshū created from Toyo at the end of the 7th century Bungo Saikaidō Ōita Ōita Kyūshū created from Toyo at the end of the 7th century Chikuzen near Dazifu Saikaidō Fukuoka Fukuoka Kyūshū created from Chikushi until the end of the 7th century Chikugo near Kurume Saikaidō Fukuoka Fukuoka Kyūshū created from Chikushi until the end of the 7th century Hizen near Saga Saikaidō Nagasaki; Saga Nagasaki; Saga Kyūshū created from Hi until the end of the 7th century Higo Saikaidō Kumamoto Kumamoto Kyūshū created from Hi until the end of the 7th century Hyūga near Saito Saikaidō Miyazaki Miyazaki Kyūshū Iki Iki Saikaidō Nagasaki Nagasaki Kyūshū also known as Ikishima Okinawa Shuri Saikaidō Okinawa Naha annexed in 1878-79; traditional sub-region, but some sources consider the Ryukyu Islands as a distinct region Ōsumi near Kokubu Saikaidō Kagoshima Kagoshima Kyūshū created in 702 from Hyūga Satsuma Saikaidō Kagoshima Kagoshima Kyūshū created in 702 from Hyūga Tane Saikaidō Kagoshima Kagoshima Kyūshū created in 702 from Hyūga, later occupied in 824 by Ōsumi; islands of Tanegashima and Yakushima Tsushima Tsushima Saikaidō Nagasaki Nagasaki Kyūshū also known as Tsushimajima ==Hokkaidō region== The Hokkaidō region is used as a basic framework for description and comparison. In the late 19th-century, the Hokkaidō region or \"North Sea Circuit\" was made up of the 10 provinces of Yezo. The Kurile Islands became an 11th northern province which was added in 1875. ===Table: Hokkaidō region=== Province Province capital Pre-modern regions Prefecture Prefecture capital Regions today Notes Hokkaidō, 1886- Tōhoku Hokkaidō, 1947- Sapporo Hokkaidō the far north is sub-region of Tōhoku until 20th century * Oshima, 1869-1882 ** southern Oshima Subprefecture ** southern Hiyama Subprefecture * Shiribeshi ** most of Shiribeshi Subprefecture (excluding Abuta District) ** northern Hiyama Subprefecture * Iburi, 1869-1882 ** entire Iburi Subprefecture ** Yamakoshi District, in Oshima Subprefecture ** Abuta District, in Shiribeshi Subprefecture ** Chitose and Eniwa cities, in Ishikari Subprefecture ** Shimukappu village, Kamikawa Subprefecture * Ishikari, 1869-1882 ** most of Ishikari Subprefecture (excluding Chitose and Eniwa cities) ** entire Sorachi Subprefecture ** southern Kamikawa Subprefecture (excluding Shimukappu village) * Teshio, 1869-1882 ** entire Rumoi Subprefecture ** northern Kamikawa Subprefecture * Kitami, 1869-1882 ** entire Sōya Subprefecture ** most of Abashiri Subprefecture (excluding part of Abashiri District) * Hidaka, 1869-1882 ** entire Hidaka Subprefecture * Tokachi, 1869-1882 ** entire Tokachi Subprefecture * Kushiro, 1869-1882 ** entire Kushiro Subprefecture ** part of Abashiri District, in Abashiri Subprefecture * Nemuro, 1869-1882 ** Nemuro Subprefecture * Chishima, 1869-1882 (the islands of Kunashiri and Etorofu, later included Shikotan and the Kuril Islands) ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Gokishichidō ==References== Category:Regions of Japan",
 "title": "Comparison of regions of Japan"
}