{
 "id": "337913",
 "text": "Ismail Enver (Ottoman Turkish: اسماعيل انور) (November 23, 1881; in Istanbul - August 4, 1922; Bukhara, present-day Tajikistan), was an Ottoman Turkish military officer and commander. He was known to European powers as Enver Pasha (Turkish: Enver Paşa) or Enver Bey before he became the ministry of war in January 3rd of 1914. (Ottoman Turkish: انور پاشا or انور بیگ). As an Ottoman military officer he was a member of the Committee of Union and Progress and a leader of the Young Turk Revolution. He was given the nickname \"The Hero of Liberty\" (Hürriyet Kahramanı). After The Young Turk Revolution. He was never the main leader of the Ottoman Empire However he was one of the only men of influence in the empire after 1913 Ottoman coup d'état. He reformed the army of the Ottoman Empire which made it way better than before by retiring 800 to 1300 old and clueless officers, Changing the style of the army to German since they were the strongest army in Europe by far. He initiated the formation of an alliance with Germany for interest after the war, however despite this he wasn't Pro-German by any means. He led the Battle of Sarikamish (December 22, 1914 – January 17, 1915). Turks were so close to victory however because of some CommandersMainly commanders of the X. Corp and IX. Corp not listening to Enver Pasha Turks missed an opportunity to capture Sarikamish while the city was almost empty. He was also alleged for the Armenian genocide from 1915-1917. In 1918 after the war was over, he went to Odessa in a German ship after death warrant was issued on him. He attempted multiple returns in Anatolia and got rejected. He bringed weapons and supplies to Anatolia to help the Ankara Government during the Turkish War of Independence. He also abandoned the idea after Battle of the Sakarya in 1921 was won. He attempted to go to Moscow 4 times however he failed everytime except for the fourth attempt in 1921. The point of going to moscow was to meet bolshevik leaders. He wanted to meet lenin too however he was rejected since he was not a Communist. He decided to join the Basmachis in August 1922 during the Russian Civil War and defeated Bolsheviks in most of the battles he fought in.Read the entire page in order to see the victories. He died of a machine gun fire from an Armenian soldier in Tajikistan Near Abıderya Village in Belcivan Province. == Early life == Enver was born in Constantinople (Istanbul) on 23 November 1881. Enver's father, Ahmed (c. 1860–1947), was a bridge-keeper in Monastir. His mother Ayşe Dilara was a Tatar. His uncle was Halil Pasha (later Kut). Enver had two younger brothers, Nuri and Mehmed Kamil, and two younger sisters, Hasene and Mediha. He was the brother-in-law of Lieutenant Colonel Ömer Nâzım. At age six, Enver moved with his father to Monastir, where he attended primary school. He studied at several military institutions. In 1902, he graduated from the Ottoman Military Academy as a Mektebli. Between 1903 and 1908, Enver was stationed in Ottoman Macedonia, where he helped suppress the Macedonian Struggle. He fought no less than 54 engagements, mostly against Bulgarian bands, developing a reputation as an expert counterinsurgent. During his service, he became convinced of the need for reforms in the Ottoman military. == Joining The CUP == Enver, through the assistance of his uncle, Halil Kut, became the twelfth member of the nascent Ottoman Freedom Society (OFS). The OFS later merged with the Paris-based Committee of Union and Progress (CUP) led by Ahmed Rıza. The CUP gained access to the Third Army through Enver. Upon his return to Monastir in 1906, Enver formed a CUP cell within the town and worked closely with Ottoman officer Kâzım Karabekir. Enver became the main figure in the CUP Monastir branch, and he initiated Ottoman officers like Ahmet Niyazi bey and Eyüp Sabri into the CUP organisation. In the early twentieth century some prominent Young Turk members such as Enver developed a strong interest in the ideas of Gustave Le Bon. For example, Enver saw deputies as mediocre and in reference to Le Bon he thought that as a collective mind they had the potential to become dangerous and be the same as a despotic leader. As the CUP shifted away from the ideas of members who belonged to the old core of the organisation to those of the newer membership, this change assisted individuals like Enver in gaining a larger profile in the Young Turk movement. In Ohri (modern Ohrid) an armed band (çete) called the Special Muslim Organisation (SMO) composed mostly of notables was created in 1907 to protect local Muslims and fight Internal Macedonian Revolutionary Organization (IMRO) bands. Enver along with Sabri recruited the SMO and turned it into the Ohri branch of the CUP with its band becoming the local CUP band. CUP Internal headquarters proposed that Enver go form a CUP band in the countryside. Approving the decision by the committee to assassinate his brother in law Lieutenant Colonel Ömer Nâzım, Enver under instructions from CUP headquarters traveled from Selanik (Thessaloniki) to Tikveş on 26 June 1908 to establish a band. CUP headquarters conferred upon Enver the title of \"CUP Inspector General of Internal Organisation and Executive Forces\". == Young Turk Revolution == On 3 July 1908, Niyazi, protesting the rule of Abdul Hamid II, fled with his band from Resne (modern Resen) into the mountains where he initiated the Young Turk Revolution and issued a proclamation that called for the restoration of the constitution of 1876. Following his example, Enver in Tikveş, and other officers such as Sabri in Ohri, also went into the mountains and formed guerilla bands. It is unclear whether the CUP had a fixed date for the revolution; in comments made in an interview following the event Enver stated that they planned for action in August 1908, yet events had forced them to begin the revolution at an earlier time. For the revolt to get local support Enver and Niyazi played on fears of possible foreign intervention. Enver led a band composed of volunteers and deserters. For example, he allowed a deserter who had engaged in brigandage in areas west of the river Vardar to join his band at Tikveș. Throughout the revolution, guerilla bands of both Enver and Niyazi consisted of Muslim (mostly Albanian) paramilitaries. Enver sent an ultimatum to the Inspector General on 11 July 1908 and demanded that within 48 hours Abdul Hamid II issue a decree for CUP members that had been arrested and sent to Constantinople to be freed. He warned that if the ultimatum was not complied with by the Inspector General, he would refuse to accept any responsibility for future actions. In Tikveș a handwritten appeal was distributed to locals calling for them to either stay neutral or join with him. Enver possessed strong authority among fellow Muslims in the area where he resided and could communicate with them as he spoke both Albanian and Turkish. During the revolution, Enver stayed in the homes of notables, and as a sign of respect they would kiss his hands since he had earlier saved them from an attack by an IMRO band. He stated that the CUP had no support in the countryside apart from a few large landowners with CUP membership that lived in towns, yet they retained influence in their villages and were able to mobilise the population for the cause. Whole settlements were enrolled into the CUP through councils of village elders convened by Enver in Turkish villages of the Tikveş region. As the revolution spread by the third week and more officers deserted the army to join the cause, Enver and Niyazi got like minded officials and civilian notables to send multiple petitions to the Ottoman palace. Enver wrote in his memoirs that while he still was involved in band activity in the days toward the end of the revolution he composed more detailed rules of engagement for use by paramilitary units and bands. On 23 July he proclaimed an age of liberty in front of the government mansion of Köprülü. In Salonica, he spoke from the balconies of the Grand Hôtel D'Angleterre to a crowd in the city center, where he declared that absolutism was finished, and Ottomanism would prevail. The square would be named Eleftherias Square, or the Square of Liberty thereafter. Facing a deteriorating situation in the Balkans, on 24 July Sultan Abdul Hamid II restored the constitution of 1876. == Italo-Turkish war == In 1911, Italy launched an invasion of the Ottoman vilayet of Tripolitania (Trablus-i Garb, modern Libya), starting the Italo-Turkish War. Enver immediately left berlin to join the defense of the province. In the 9th of November, Enver Bey came to tobruk, trained and encouraged senusi arabs. The same arabs would later catch an italian battalion and destroy it. By training lower-level commanders and training soldiers, Enver Bey created a resistance network that would follow the resistance for years. Teşkilat-ı Mahsusa, recruited the Arab Allies Bedouins in Cyrenaica and Tripoli to oppose the Italian conquest of Libya. Large numbers of Arab soldiers were recruited as auxiliaries and guerrilla fighters. In this asymmetric warfare, Enver Bey successfully organized the Arab tribes into the Resistance. He fought so successfully that he was promoted twice to the rank of Lieutenant Colonel. The defense of Benghazi in Cyreanica enabled Enver Bey to demonstrate his organizational skills by forming defensive units from Arab tribes. Enver Bey forbade the confiscation of Bedouin animals and ordered high prices to be paid for the materials they provided. Thus, he provided covert support to the native tribes. The Italians occupied the last months of 1911 to clear the coast and capture the country just beyond. But the interior remained unconquered, and fighting continued there in the last months of 1911 and the spring and summer of 1912. Enver Bey, leading the Turks and Arabs, waged a terrible war that exploited the strength and nerves of the Italians.. Italians just couldn't break through the defense lines no matter how many troops they bring and how hard they attack. These guerrilla tactics were successful, to the extent that Italy was forced to send more and more men into the theater to protect the coast, ultimately around 140,000 men. The guerilla tactics managed to win against italians However, they failed to dislodge the Italians too Meanwhile, for the first time in world history, it marked the beginning of a new era in twentieth-century warfare, both in terms of surveillance and aerial bombardment. Despite this, the Tripoli war became inconclusive by December. There, he assumed the overall command after successfully mobilizing 20,000 troops in a very short period of time. (It was 500-600 troops before) He was clearly the best commander in north africa of that time said by Irace Tullio. The Italians also declared him dead in derna to reduce the Turkish army's morale. In December, the Italian occupation was able to expand only 17 kilometers inland from the city of Tripoli to Ayn Zor, where the talented Turkish gang leader Enver Bey had his headquarters, but all the efforts of the Italians to capture Enver Bey were in vain. by training lower-level commanders and training soldiers, Enver Bey created a resistance network that would follow the resistance for years. The Special Organization recruited the Arab Allies Bedouins in Cyrenaica and Tripoli to oppose the Italian conquest of Libya. Large numbers of Arab soldiers were recruited as auxiliaries and guerrilla fighters. In this asymmetric warfare, Enver Bey successfully organized the Arab tribes into the Resistance. He fought so successfully that he was promoted twice to the rank of Lieutenant Colonel. The defense of Benghazi in Cyreanica enabled Enver Bey to demonstrate his organizational skills by forming defensive units from Arab tribes. Because of the outbreak of the Balkan Wars, however, Enver and other Ottoman generals in Libya were called back to Constantinople. Even after the Ottomans left, there were some commanders who refused to leave like Aziz bey who had around 800 troops with him. Even after, The Italians just could not take Tripoli under their protection and brainwash sennusi arabs. The reason for that is because of Enver Bey's weaponizing arabs and training them which is why they complained about Enver Bey to the Ottoman Empire Constrained by diplomacy, Italy's action against Turkey reflected uncertainty and improvisation. Italy failed to recognize the Ottoman Empire as a peer within Europe; The Italo-Turkish War was not a true colonial conflict in Africa, but a war between the two great powers of Europe fought in the Mediterranean. The risks and scope of the conflict were not immediately clear. Giolitti asked the Chief of General Staff, General Alberto Pollio, how many soldiers would be needed to defeat the Turks in Tripoli and Cyrenaica. Expecting only symbolic resistance from the Turkish garrison, Pollio estimated 22,000 soldiers; Giolitti nearly doubled the figure to mobilize 40,000 people. Eventually, 100,000 Italian soldiers were assigned to fight in Libya, at enormous expense. The war cost the Italian government 1.3 billion lire, almost a billion more than Giolitti had estimated, and ruined a decade of fiscal prudence. Georges Re'mond continued as follows about Enver Bey's forces on pages 167 and 168 of his work (In the Encampment of the Turks and Arabs): > \"From the very beginning, I observed an activity that was completely > different from the confused, disorganized and strange noise and commotion > that prevailed in the camp and that we were accustomed to in Arab countries. > Everything here felt like the work of a determined and organized will.\" > Elsewhere in the book, Monsieur Remond adds the following: \"In Enver Bey's > camp, everything was becoming more and more organized. Regular infantry > companies, armed in the modern style, were formed, and the Arabs were > walking and making movements with command. These were accompanied by the use > of sights, The small ammunition factory was trying to teach people to keep > quiet and not to waste ammunition. He was training. == Balkan wars == In October 1912, the First Balkan War broke out, and the Ottoman armies suffered severe defeats at the hands of the Balkan League. These military reversals weakened the government, and gave the committee the chance to seize power from Freedom and Accord. In a coup in January 1913, Enver and CUP leader Mehmed Talaat regained power for the committee and introduced a triumvirate that came to be called the \"Three Pashas\" which included Enver, Talaat, and Ahmed Cemal Pasha. Turkey then withdrew from the peace negotiations then under way in London and did not sign the Treaty of London (1913), resuming the First Balkan War. The change in government did not change the fact that the war was lost, and the Ottoman Empire gave up almost all of its Balkan territory to the Balkan League. Afterwards the Grand Vizier Mahmud Shevket Pasha was assassinated, allowing the CUP to take full control over the empire. In June 1913, however, the Second Balkan War broke out between the Balkan Allies. Enver Bey took advantage of the situation and led an army into Eastern Thrace, recovering Adrianople (Edirne) from the Bulgarians, who had concentrated their forces against the Serbs and Greeks, with the Treaty of Constantinople (1913). Enver is therefore recognised by some Turks as the \"conqueror of Edirne\". In 1914, he became Minister of War in the cabinet of Said Halim Pasha, and married HIH Princess Emine Naciye Sultan (1898–1957), the daughter of Prince Süleyman, thus entering the royal family as a damat (\"bridegroom\" to the ruling House of Osman). == World War I == Being able to communicate in German, Enver Pasha, along with Talaat and Halil Bey were architects of the Ottoman-German Alliance, and expected a victory in the war that would benefit the Ottoman Empire. Without informing the cabinet, he allowed the two German warships SMS Goeben and SMS Breslau, under the command of German admiral Wilhelm Souchon, to enter the Dardanelles to escape British pursuit; the subsequent \"donation\" of the ships to the neutral Ottomans worked powerfully in Germany's favor, despite French and Russian diplomacy to keep the Ottoman Empire out of the war. Finally on 29 October, the point of no return was reached when Admiral Souchon, now Commander-in- Chief of the Ottoman navy, took Goeben, Breslau, and a squadron of Ottoman warships into the Black Sea and bombed the Russian ports of Odessa, Sevastopol, and Theodosia. Russia declared war on Ottoman Empire on 2 November, and Britain followed suit on 5 November. Most of the Turkish cabinet members and CUP leaders were against such a rushed entry to the war, but Enver Pasha held that it was the right course of action. The Ottoman Entry into world war 1 was mandatory for them since allied powers would divide the ottomans after world war 1 was over. Russian Empire wouldn't have collapsed if Ottomans didn't join the war. And war would most likely end in 1916. As soon as the war started, 31 October 1914, Enver ordered that all men of military age report to army recruiting offices. The offices were unable to handle the vast flood of men, and long delays occurred. This had the effect of ruining the crop harvest for that year. == Battle of Sarikamish == Enver Pasha assumed command of the Ottoman forces arrayed against the Russians in the Caucasus theatre. He wanted to encircle the Russians, force them out of Ottoman territory, and take back Kars and Batumi to capture the supply lines. Kars and Batumi had been ceded after the Russo-Turkish War of 1877–78.German military adviser, Liman von Sanders, thought of him as incompetent which was false. Enver ordered an amazing battle plan attack on the Russians, placed himself in personal control of the Third Army, and was utterly defeated at the Battle of Sarikamish in December 1914 – January 1915. His strategy seemed magnificent on paper, but due to commanders of the IX,X,XI corps not listening to Enver's orders the battle has been a disaster for Ottomans. The Ottomans had a power of 76.660 men. Around 30-40 thousand Ottoman troops has died in the battle. This was one of the worst Ottoman defeat of World War I. Enver pasha returned Istanbul otherwise he would've die from harsh winter. There is a nonsense going on about Enver Pasha \"blaming\" his loss on the armenians which makes no sense at all. First of all, Enver Pasha knew who was responsible of the loss. Second, Enver's personality doesn't match him killing and blaming many people for a loss which he knew the responsible. The sources that claim he blamed the loss on armenians are totally nonsense and should be ashamed to even read them. == Defending Gallipoli == After the defeat at Sarıkamısh, Enver returned to Istanbul (Constantinople) and took command of the Turkish forces around the capital. He was the only person who was confident that the capital was safe from any Allied attacks. The British and French were planning on forcing the approaches to Constantinople in the hope of knocking the Ottomans out of the war. A large Allied fleet assembled and staged an attack on the Dardanelles on 18 March 1915. The attack (the forerunner to the failed Gallipoli campaign) was a disaster, resulting in the loss of several ships. As a result, Enver turned over command to Liman von Sanders after creating the 5th army. Enver visited the Gallipoli exactly 17 times to make sure everything was in order despite all the danger. Later, after many towns on the peninsula had been destroyed and women and children killed by the Allied bombardment, Enver Pasha won and forced the Allied powers to drawback giving them the greatest loss of middle eastern theatre. It is possible to say if Enver wasn't there, the front would've been lost and Ottomans would suffer so many losses and massacres. ==Related pages== * Young Turks * Committee of Union and Progress * Basmachi Revolt * Armenian genocide ==References== ==Other websites== * Enver's biography * * Enver's declaration at the Baku Congress of the Peoples of the East 1920 * Interview with Enver Pasha by Henry Morgenthau – American Ambassador to Constantinople (Istanbul) 1915 * Biography of Enver Pasha at Turkey in the First World War website * Personal belongings of Enver Pasha * Ismail Enver Pasha (1881–1922) Category:1881 births Category:1922 deaths Category:Government ministers Category:Military personnel of World War I Category:Turkish Muslims Category:Ottoman people Category:Turkish generals Category:Turkish politicians",
 "title": "Enver Pasha"
}