{
 "id": "33819",
 "text": "\"Aegukga\" (; say: ), meaning \"The Patriotic Song\", is the national anthem of the Republic of Korea (South Korea). It should not be confused with North Korea's anthem, which has the same name. The lyrics of the Aegukga sung today were created around 1907, a time when the country was under threat from foreign invasions, to inspire patriotism, loyalty, and a sense of independence. Over time, the lyrics were refined by various pioneers to their current form, and the melody was set to the Scottish folk song \"Auld Lang Syne.\" Ahn Ik-tae (안익태), who was active abroad, felt it was unfortunate that the Aegukga was sung to a foreign melody. In 1935, he composed the melody that we sing today. The Provisional Government of the Republic of Korea adopted this composition as the national anthem, but it was only spread overseas. In Korea, the anthem continued to be sung to the Scottish folk melody until the establishment of the government after liberation. After the establishment of the South Korean government in 1948, Ahn's composition was used at official events and included in school textbooks nationwide, becoming widely sung across the country. Subsequently, this Aegukga was widely spread abroad and became established as the de facto national anthem. ith the formalization of the Aegukga as the national anthem, it was actively promoted in the 1950s through media like the Korean News. Additionally, various guidelines and directives, such as the \"Instructions on Etiquette for Flag Hoisting and Aegukga Singing\" (1966), gradually incorporated it into national ceremonies. The instructions stated that during the salute to the national flag and the singing of the Aegukga, people should show proper respect by standing still, and all passing individuals and vehicles should stop to show respect. == Lyrics == Words of the song in Korean Words of the song using Roman letters Pronunciation of these words using the IPA Words of the song in English Donghae mulgwa Baekdusani mareugo daltorok Haneunimi bouhasa urinara manse. Mugunghwa samcheolli hwaryeo gangsan Daehan saram, daehaneuro giri bojeonhase. Namsan wie jeo sonamu cheolgabeul dureun deut Baram seori bulbyeonhameun uri gisang-ilse. Ga-eul haneul gonghwalhande nopgo gureum eopsi Balgeun dareun uri gaseum ilpyeondansimilse. I gisanggwa i mameuro chungseong-eul dahayeo Goerouna jeulgeouna nara saranghase. Until the East Sea's waves are dry, Mt. Baekdu worn away, God watch o'er our land forever, our Korea manse. Rose of Sharon, thousand miles of range and river land; Guarded by her people, ever may Korea stand. Like that Mt. Namsan armoured pine, standing on duty still, wind or frost, unchanging ever, be our resolute will. In autumn's, arching evening sky, crystal and cloudless blue; be the radiant moon our spirit, steadfast, single and true. With such a will, such a spirit, loyalty, heart and hand, Let us love, come grief, come gladness, this our beloved land. ==References== Category:Asian anthems Category:National symbols of South Korea Category:Songs in Korean Category:South Korean music",
 "title": "Aegukga"
}