{
 "id": "338230",
 "text": "The Manicouagan crater is one of the oldest known impact craters. It is in the Côte-Nord region of Québec, Canada.Earth Impact Database. University of New Brunswick It was caused by the impact of a diameter asteroid about 215.5 million years ago,Ramezani, J. et al. 2005. The Manicouagan impact melt rock: a proposed standard for intercalibration of U-Pb and 40Ar/39Ar isotopic systems. 15th V.M. Goldsmidt Conference Abstract Volume. A321 in the Upper Triassic.Furin, S. et al. 2006. High-precision U-Pb zircon age from the Triassic of Italy: implications for the Triassic time scale and the Carnian origin of calcareous nannoplankton and dinosaurs. Geology, 34, 1009-1012. Link The crater is a multiple-ring structure about across. Its inner ring is its most prominent feature. This is a diameter annular lake, the Manicouagan Reservoir, surrounding an inner island plateau. It is the earth's fifth largest confirmed impact crater. == Multiple impact event == The Manicouagan crater may have been part of a multiple impact event which also formed the Rochechouart crater in France, Saint Martin crater in Manitoba, Obolon' crater in Ukraine, and Red Wing crater in North Dakota. The five craters form a chain, indicating the breakup and subsequent impact of an asteroid or comet,Spray J.G. et al. 1998. Evidence for a late Triassic multiple impact event on Earth. Nature. 392, 171-173. Abstract like the impacts of Comet Shoemaker-Levy 9 on Jupiter in 1994. Laser argon-argon dating of the glass formed by the impacts, and stratigraphic evidence, support an age of 215 ± 25 mya. The impact places have moved far apart in the intervening 214 million years. Three of the craters—Rochechouart, Manicouagan and Saint Martin—formed a chain at latitude 22.8° N, while Obolon' and Red Wing lay on identical declination paths with Rochechouart and Saint Martin respectively. All of the craters had previously been known and studied, but their paleoalignment had never before been demonstrated. The chance that these craters could be aligned like this accidentally are nearly zero. == References == Category:Impact craters Category:Geography of Quebec",
 "title": "Manicouagan crater"
}