{
 "id": "338357",
 "text": "Tiziano Vecellio (sometimes his last name is given as Vecelli, born around 1490,No exact date is known. The accepted view today is either 1488 or 1490. Other versions include dates around 1477. Giorgione (1477-1510) was another Renaissance painter. Some people believe, Giorgione painted some of Titian's early works. in Pieve di Cadore near Belluno, died 27 August 1576 in Venice) was an Italian painter. His name in English is Titian. He was one of the leading painters of the 16th century Venetian school; he is also seen as one of the principal artists of High Renaissance painting of the 16th century. When he was alive, he was often called Da Cadore, after his place of birth. When he was active, the Republic of Venice had a Golden Age, and was well-off economically. Aged nine, Titian went to Venice. The brothers Gentile and Giovanni Bellini taught him how to paint. In 1513, he opened his own shop, and developed into a successful painter, known all over Europe. In 1533, Charles V made him a nobleman. He also obtained a job as a painter at the court of Charles V. In 1545, Pope Paul III invited him to come to Rome, in 1548 and 1550, Titian accompanied Charles V and his son, Philip II to the Diet of Augsburg. When Titian died of the Plague in the year 1576, he was an old man. He was also one of the most famous painters of Venetian history. Titian was very productive: in total, he painted 676 works. He did portraits, landscapes, as well as themes from mythology and religious works. All his works are very colorful. This special use of color influenced other painters of the same period a great deal. His works influenced painters such as Peter Paul Rubens, Antoine Watteau and Eugène Delacroix. ==Gallery== File:Titian - Portrait of a man with a quilted sleeve.jpg|A self-portrait, done around 1510. For a long time, it was attributed to Ariosto. Rembrandt also used this composition for his self-portraits. File:Titian-salome.jpg|Salome, or Judith; this also shows an idealized portrait of beauty, which Titian developed. Titian often used Venetian courtesans as models. File:Tizian 012.jpg|This painting, called Danaë with Nursemaid is one of several he did with a mythological theme, for Philip II of Spain. It shows how well he could handle colour. Even though Michelangelo thought the drawing was lacking, Titian produced several versions for other patrons. File:Tizian 085.jpg|The Rape of Europa (1562) was admired and copied by Rubens. In contrast to the clarity of Titian's early works, it is almost baroque in its blurred lines, swirling colors, and vibrant brushstrokes. ==Related pages== * List of Italian painters ==References== Category:1490s births Category:1576 deaths Category:16th-century Italian painters",
 "title": "Titian"
}