{
 "id": "338334",
 "text": "The Administrator of the Northern Territory is the person selected by the Governor-General of Australia to act as the governor of the Northern Territory of Australia. The selection of Administrator is made by the Governor-General- in-Council, that is, the Governor-General acting on the advice of the Australian government, not the advice of the Government of the Northern Territory. The Northern Territory became self-governing on 1 July 1978. Now the Governor-General-in Council accepts a recommendation from the Northern Territory Government. Unlike an Australian State Governor, the Administrator does not represent the Queen in the Territory. They represent the Governor- General who is the Queen's representative in the Commonwealth. The Administrator's role is to govern the Territory under the law which gave it self-government. The Administrator's constitutional role is almost the same as a State Governor and can be considered the Queen's indirect representative in the Territory. The office of the Deputy of the Administrator was created in 1997. The present Administrator is Sally Thomas, AM. == South Australia (1846 to 1912) == The Northern Territory was part of South Australia from 1846 to 1912. The administrator was known as the Government Resident. No. Government Resident From To 1 Sir Charles Augustus FitzRoy, KCH, KCB 21 February 1846 28 December 1846 2 The Hon. Boyle Finniss 3 March 1864 4 November 1865 3 William Bloomfield Douglas 27 April 1870 June 1873 4 George Byng Scott 6 October 1873 30 June 1876 5 Edward William Price 1 July 1876 6 March 1883 6 John Parsons 19 March 1884 14 February 1890 7 John Knight FRIBA 16 July 1890 10 January 1892 8 Charles James Dashwood 24 February 1892 31 January 1905 9 Charles Edward Herbert 1 February 1905 8 February 1910 10 The Hon. Samuel Mitchell 1 April 1910 25 March 1912 == Commonwealth of Australia (1912 to present) == The Australian government took over control of the Northern Territory in 1912. === Administrator (1912 to 1919) === No. Administrator From To 1 John Gilruth FRSE MRCVS 25 March 1912 1 August 1919 === Director (1919 to 1921) === No. Director From To 1 Henry Ernest Carey 1 August 1919 17 January 1921 === Administrator (1921 to 1927) === No. Administrator From To 1 Frederic Urquhart 17 January 1921 1 March 1927 === Government Resident (1927 to 1931) === There was an experiment having an extra Government Resident (Central Australia) in Alice Springs based at The Residency. Alice Springs was known as Stuart Town from 1888 to 1933. No. Government Resident (North_Australia) From To 1 Robert Weddell 1 March 1927 12 June 1931 No. Government Resident (Central Australia) From To 1 John Cawood 1 March 1927 11 December 1929 2 Victor Carrington MBE 11 December 1929 12 June 1931 === Administrator (1931 to present) === No. Administrator Post- Nominal From To 1 Robert Weddell 12 June 1931 29 March 1937 2 The Hon. Aubrey Abbott 29 March 1937 1 July 1946 3 Arthur Driver BEM 1 July 1946 1 July 1951 4 The Hon. Frank Wise AO 1 July 1951 1 July 1956 5 James Archer OBE 1 July 1956 1 April 1961 6 Roger Nott CBE 1 April 1961 1 October 1964 7 Roger Dean CBE 1 October 1964 4 March 1970 8 The Hon. Sir Frederick Chaney KBE AFC 4 March 1970 10 December 1973 9 John Norman Nelson 10 December 1973 1 June 1978 10 John England CMG 1 June 1978 1 January 1981 11 Commodore Eric Johnston AO OBE RAN 1 January 1981 1 July 1989 12 The Hon. James Muirhead AC QC 1 July 1989 1 March 1993 13 The Hon. Austin Asche AC QC 1 March 1993 17 February 1997 14 Dr. Neil Conn AO 17 February 1997 28 November 2000 15 John Anictomatis AO 28 November 2000 30 October 2003 16 Ted Egan AO 31 October 2003 31 October 2007 17 Tom Pauling AO QC 31 October 2007 31 October 2011 18 Sally Thomas AM 31 October 2011 Present == Deputy of the Administrator (1997 to present) == The office of the Deputy of the Administrator was established in 1997. No. Deputy of the Administrator From To 1 Minna Sitzler AM 17 February 1997 30 November 2001 2 Pat Miller AO 20 September 2002 present == References == == Other websites == * Government House, Northern Territory, Office of the Administrator – official site * Northern",
 "title": "Administrator of the Northern Territory"
}