{
 "id": "338401",
 "text": "Chloë Grace Moretz (born on February 10, 1997) is an American model and actress. Her acting career began in 2004. She has performed in many movies and television programs. These include Desperate Housewives, 30 Rock, Diary of a Wimpy Kid , Kick-Ass and Dark Shadows. Moretz got worldwide recognition for Kick-Ass as the character Mindy Macready (Hit-Girl). In 2013 Moretz played Carrie White in Carrie. She was the main character in a movie for the first time. ==Personal life== Moretz was born in Atlanta, Georgia. She lived until 2002 in Cartersville, Georgia, when she moved to New York City. Moretz has four older brothers: Trevor, Brandon, Colin, and Ethan. Her father, McCoy Moretz, was a plastic surgeon. Her mother, Teri Duke Moretz, is a nurse. She has described her family as \"very Christian\", specifically Southern Baptist. Moretz is a lesbian. She is also a Democrat. From 2014 to 2018, Moretz was in a relationship with English model and photographer Brooklyn Beckham. ==Filmography== ===Film=== Year Title Role Notes 2005 The Amityville Horror Chelsea Lutz 2005 Heart of the Beholder Molly 2005 Today You Die St. Thomas Hospital Girl 2006 Big Momma's House 2 Carrie Fuller 2006 Room 6 Melissa Norman 2006 Wicked Little Things Emma Tunny 2007 Super Sleuth Christmas Movie Darby Voice, direct-to-video 2007 Hallowed Ground Sabrina 2007 The Third Nail Hailey 2008 The Eye Alicia 2008 The Poker House Cammie 2008 Bolt Young Penny Voice 2009 Not Forgotten Toby Bishop 2009 500 Days of Summer Rachel Hansen 2009 Tigger & Pooh and a Musical Too Darby Voice, direct-to-video 2009 Jack and the Beanstalk Jillian 2010 Kick-Ass Mindy McCready / Hit-Girl 2010 Diary of a Wimpy Kid Angie Steadman 2010 Super Duper Super Sleuths Darby Voice, direct-to-video 2010 Let Me In Abby 2011 Our Deal Veronica Short film 2011 Texas Killing Fields Little Ann Sliger 2011 Hick Luli McMullen 2011 Hugo Isabelle 2011 Scary Girl Enid Krysinski Short film 2012 Dark Shadows Carolyn Stoddard 2013 Movie 43 Amanda Segment: \"Middleschool Date\" 2013 Kick-Ass 2 Mindy McCready / Hit-Girl 2013 Carrie Carrie White 2013 Girl Rising Narrator Documentary 2014 Laggies Annika 2014 Muppets Most Wanted Newspaper Delivery Girl Cameo 2014 Clouds of Sils Maria Jo-Anne Ellis 2014 If I Stay Mia Hall 2014 The Equalizer Alina / Teri 2014 The Tale of the Princess Kaguya Kaguya Houraisan Voice, English dub 2015 Dark Places Young Diondra Wertzner 2016 The 5th Wave Cassie Sullivan 2016 Neighbors 2: Sorority Rising Shelby Robek 2016 Brain on Fire Susannah Cahalan 2017 I Love You, Daddy China Topher 2017 November Criminals Phoebe \"Digger\" Zeleny 2018 The Miseducation of Cameron Post Cameron Post 2018 Suspiria Patricia Hingle 2018 Greta Frances McCullen 2019 Red Shoes and the Seven Dwarfs Snow White Voice 2019 The Addams Family Wednesday Addams Voice 2020 Shadow in the Cloud Flight Officer Maude Garrett 2021 Tom & Jerry Kayla Forrester 2021 The Addams Family 2 Wednesday Addams Voice 2021 Mother/Android Georgia Olsen 2023 Nimona Nimona Voice Key Denotes works that have not yet been released ===Television=== Year Title Role Notes 2004 The Guardian Violet 2 episodes 2005 Family Plan Young Charlie Television film 2005 My Name Is Earl Candy Stoker Episode: \"Broke Joy's Fancy Figurine\" 2006 The Emperor's New School Furi Voice, episode: \"Kuzcogarten\" 2006–07 Desperate Housewives Sherri Maltby 2 episodes 2007 The Cure Emily Pilot 2007–08 Dirty Sexy Money Kiki George 7 episodes 2007–10 My Friends Tigger & Pooh Darby Voice, main role 2011–13 30 Rock Kaylie Hooper 3 episodes 2013 American Dad! Honey Voice, episode: \"Steve & Snot's Test-Tubular Adventure\" 2015 Mickey Mouse Clubhouse Boodles Voice, episode: \"Mickey's Monster Musical\" 2022 The Peripheral Flynne Fisher Main role ===Stage=== Year Title Role Notes 2014 The Library Caitlin Gabriel The Public Theatre ===Music Videos=== Year Song Artist 2010 \"Answer to Yourself\" The Soft Pack 2011 \"Our Deal\" Best Coast 2011 \"Ouch\" Dionne Bromfield featuring Mz Bratt ===Video Games=== Year Title Voice role 2010 Kick-Ass: The Game Mindy Macready / Hit-Girl 2012 Dishonored Emily Kaldwin 2014 Kick-Ass 2: The Game Mindy Macready / Hit-Girl == Awards == ==References== ==Other websites== Category:1997 births Category:Living people Category:Actors from Atlanta Category:Actors from New York City Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:LGBT actors Category:Lesbians Category:LGBT people from Georgia (U.S. state) Category:LGBT people from New York City Category:Democrats (United States) Category:Models from New York City Category:Models from Georgia (U.S. state) Category:LGBT models",
 "title": "Chloë Grace Moretz"
}