{
 "id": "338456",
 "text": "The recognized flag of Afghanistan continues to be that of the Republic of Afghanistan, although the Taliban flag, which was used from 1997-2001 until their collapse, has reemerged under the name of Islamic Emirate of Afghanistan as of 2021. Afghanistan has had more changes of its national flag during the 20th century than any other country in the world. It has had 20 different flags since the first flag in 1747. In only 4 years (1926–1930), Afghanistan had 7 flag changes - many of these flags were used as the nation's flags for only a few months. == Historical flags == Years of Use Flag Ratio Government Notes 1747–1826 2:3 Durrani Empire Flag flown under the rule of Ahmad Shah Baba and his dynasty. 1826–1880 No official flag during this period. Emirate of Afghanistan Prior to 1880, the Barakzai dynasty did not use the flag associated with the Durranis, or an official alternative. 1880–1901 2:3 Emirate of Afghanistan Flag flown under the rule of Abdur Rahman Khan. 1901–1919 3:5 Emirate of Afghanistan State and war flag flown under the rule of Habibullah Khan. Habibullah added to his father’s flag a seal that is the precursor of the modern-day seal. 1919–1926 2:3 Emirate of Afghanistan First flag flown under the rule of Amanullah Khan. He expanded upon his father’s flag by adding rays emanating from the seal in the form of an octagram. This new style of seal was common in the Ottoman Empire. Afghanistan became a kingdom in 1926. 1926–1928 2:3 Kingdom of Afghanistan Second flag flown under the rule of Amanullah Shah. He replaced the octagram with a wreath and slightly modified the national seal. 1928 3:5 Kingdom of Afghanistan Third flag flown under the rule of Amanullah Shah. The black, red, and green tricolor, respectively representing the past (previous flags), the bloodshed for independence (Third Anglo-Afghan War), and hope for the future, was probably influenced by Khan’s visit abroad to Europe in 1927. 1928–1929 2:3 Kingdom of Afghanistan Fourth flag flown under the rule of Amanullah Shah. The new seal shows the sun rising over two snow-capped mountains, representing a new beginning for the kingdom. 1929 2:3 Kingdom of Afghanistan Flag flown under the rule of Habibullah Kalakani or Habibullah Khan, formerly known as Bacha-i-Saqao. The red, black, and white tricolor was the same flag that was used when modern-day Afghanistan was under Mongol occupation in the 13th century. 1929–1930 2:3 Kingdom of Afghanistan First flag flown under the rule of Mohammed Nadir Shah. The black, red, and green tricolor was re-established; the octogram seal borrowed from the first flag of Amanullah Shah replaced the sun and mountains seal. 1930–1973 2:3 Kingdom of Afghanistan Second flag flown under the rule of Mohammed Nadir Shah, it was also used by his son, Mohammed Zahir Shah. The black, red, and green tricolor were retained. The octagram rays were removed, and the seal enlarged. In between the mosque and the seal is the year ١٣٤٨ (1348 of the lunar Islamic calendar, or 1929 AD of the Gregorian calendar) the year Mohammed Nadir Shah’s dynasty began. 1973–1974 2:3 Republic of Afghanistan First flag flown for the Republic of Afghanistan. It is identical to the previous flag, except that the year ١٣٤٨ was removed. 1974–1978 2:3 Republic of Afghanistan Second flag flown for the Republic of Afghanistan. The same colors were used, but the meanings reinterpreted: black for the obscure past, red for blood shed for independence, and green for prosperity from agriculture. In the canton is a new seal, with an eagle with spread wings, a pulpit (minbar) on the eagle’s chest (for a mosque), wheat surrounding the eagle, and the sun’s rays above the eagle (for the new republic). 1978 2:3 Democratic Republic of Afghanistan When the leader of the republic was killed a communist government was formed. The same flag design was kept, but no seal. A similar flag was used by the Junbish-e Milli party which controlled autonomous northern Afghanistan from 1992 to 1998. 1978–1980 1:2 Democratic Republic of Afghanistan This flag used a red field with a yellow seal in the canton, a common design for communist regimes. The wreath of wheat remained, but a star was added at top (representing the five ethnic groups of the nation) and the word 'Khalq' in Arabic script (meaning people) in the center. The flag was also the flag of the People's Democratic Party of Afghanistan's Khalq faction under President Nur Muhammad Taraki until his murder in September 1979. 1980–1987 1:2 Democratic Republic of Afghanistan After the overthrow of the Khalq faction by the Parcham faction (led by Benjarat Lipnt), the flag was changed again. The overthrow occurred in December 1979. The new leadership re-established the black, red, and green tricolor, representing the past, blood shed for independence, and the Islamic faith, respectively. A new seal was designed, with a rising sun (a reference to the former name, Khorasan, meaning \"Land of the Rising Sun\"), a pulpit and the Qur'an for Islam, ribbons with the national colors, a cogwheel for industry, and a red star for communism. 1987–1992 1:2 Republic of Afghanistan Same as the previous flag, except that in the national seal, the cogwheel is moved from the top to the bottom, the red star and the book are removed, and the green field curved to resemble the horizon. 1992 1:2 Republic of Afghanistan This flag was used as a temporary flag after the fall of the pro- Soviet regime. It appeared in many variants of which one is shown here. In the upper stripe is Arabic Allahu Akbar, (“God is great”); the center stripe contains the Shahadah. 1992–1996 1:2 Islamic State of Afghanistan The black and green stripes are switched from the previous flag. Also, the Shahadah is written within a logo. This flag, for the first time since 1928, replaced the red color of nationalism and tribalism with the three colors of green, white and black, which were raised by Muslims in the past. The three colors of green white and black can be seen on several Muslim nations' flags. On the bottom part of the logo was written \"دا افغانستان اسلامی دولت\", 'The Islamic State of Afghanistan'. 1996–1997 2:3 Islamic Emirate of Afghanistan A plain white flag was flown by the Taliban. 1997–2001 2:3 Islamic Emirate of Afghanistan In 1997 the Taliban added the Shahadah on the flag. 2001–2002 1:2 Islamic State of Afghanistan The 1992 Flag was re-adopted after the Taliban regime was deposed. 2002–2004 1:2 Transitional Islamic State of Afghanistan This flag consists of three vertical stripes of the colors black, red, and green. This has been present on most flags of Afghanistan in the last twenty years. The center emblem is the classical emblem of Afghanistan with a mosque with its mihrab facing Mecca. This flag is similar to the one flown in Afghanistan during the monarchy between 1930 and 1973. The difference is the addition of the shahadah at the top of the coat-of-arms (seen in white) in the center. It now shows the year ١۲۹٨ (1298), the solar Islamic calendar equivalent of 1919 AD of the Gregorian Calendar, the year of independence from Great Britain. 2004–2021 2:3 Islamic Republic of Afghanistan Similar to the previous flag, but a different ratio. \"دا افغانستان اسلامی دولت\" The Islamic State of Afghanistan has been replaced with simply \"افغانستان\" Afghanistan. 2021–Present 2:3 Islamic Emirate of Afghanistan Flag of the Taliban, used to be the flag from 1997-2001. This flag includes a white background and with the shahadah in the middle with black text == References == Afghanistan Category:National symbols of Afghanistan Afghanistan",
 "title": "Flag of Afghanistan"
}