{
 "id": "338463",
 "text": "The \"Afghan National Anthem\" (; ) was used between 2006 and 2021. The words of the song were written by an Afghan poet named Abdul Bari Jahani, and the melody for his words were created by an German-Afghan composer named Babrak Wassa. It was de facto replaced by \"This is the Home of the Brave\" after the Taliban takeover in 2021. ==History== After the end of Taliban rule in 2001, a new national anthem was made for the \"New Afghanistan\". According to the 20th article of the new Afghan constitution, it would have the names of the many ethnic groups of Afghanistan. It said the phrase \"Allāhu Akbar\" (\"God is the greatest\") had to be in it. After a competition, \"Millī Surūd\" was made the official national anthem in May 2006. After the Taliban takeover on 15 August 2021, it was replaced by \"This is the Home of the Brave\". However, in the 2021 ICC Men's T20 World Cup between October and November, it was still played as the national anthem of Afghanistan. The flag of the internationally recognized Islamic Republic of Afghanistan was also used. The Islamic Republic anthem and flag were also used in the 2022 CAFA U-19 Futsal Championship. ===Historical use=== Similar to Romania, Afghanistan has used a bunch of other anthems in the past. A lot of times is due to the government of Afghanistan changing many times. When the country was ruled by a king, two national anthems were used: \"Royal Salute\" and \"Grand Salute\". Then right when Afghanistan was no longer ruled by a king, a new national anthem was used, but only for five years. Soon after, Afghanistan became a socialist republic and a national anthem for that was used. But that came to an end in 1992, when Afghanistan became an Islamic state, so another anthem was used. During the late 1990s, the Taliban took control over most of Afghanistan and ruled most of the country until late 2001. This was when the United States started a war (against the Taliban and al-Qaeda) right after 9/11. The Taliban were the winners in that war, so as of August 2021, Afghanistan is an Islamic Emirate to this day, and \"This is the Home of the Brave\" is now the country's national anthem. ==Lyrics== Words of the song in Pashto Words of the song using the Latin alphabet Pronunciation of these words using the IPA Words of the song in Dari Words of the song in English 'Tis the land of Afghanistan, 'Tis the pride of every Afghan. 'Tis the land of peace and the sword, 'Tis the cradle of its brave sons. 'Tis the homeland of every tribe, Of the Baloch and the Uzbeks; Of Pashtuns, and of Hazaras; Of the Turkmens and of Tajiks. Among them are Arabs, Gurjars, The Pamiris, Nuristanis; The Brahuis, the Qizilbash; Also Aimaqs and Pashais. Like the sun in the deep blue sky; Forever shall this great land shine! In the chest of Asia it lies; As the heart shall it remain! We shall follow the one God: Let's all say, \"God is the Greatest!\" Let's all say, \"God is the Greatest!\" Let's all say, \"God is the Greatest!\" ==Notes== ==References== Category:2006 works Afgh Category:National symbols of Afghanistan",
 "title": "National anthem of the Islamic Republic of Afghanistan"
}