{
 "id": "338667",
 "text": "Jennifer Shrader Lawrence (born August 15, 1990) is an American actress. She appeared in Time's list of most influential people in the world in 2013, and has won an Academy Award, a BAFTA Award, three Golden Globe Awards and two Screen Actors Guild Awards, among other accolades. Lawrence first became known for appearing on The Bill Engvall Show (2007–2009), and had her breakthrough with Winter's Bone (2010). She went on to starring roles in the X-Men film series (2011–2019) and The Hunger Games film series (2012–2015), and is the highest-grossing action heroine. She won the Academy Award and Golden Globe Award for Best Actress for her work in Silver Linings Playbook (2012), and earned an additional two Golden Globe Awards for starring in American Hustle (2013) and Joy (2015). She subsequently played roles in Passengers (2016), mother! (2017) and Red Sparrow (2018). ==Career== In 2010, Lawrence played Ree Dolly in Winter's Bone. In 2012, she played Katniss Everdeen in The Hunger Games franchise. In 2013, she won an Oscar for Best Performance by an Actress in a Leading Role. That year, she also won a Golden Globe for Best Performance by an Actress in a Motion Picture - Musical or Comedy. ==Personal life== Lawrence is of English, Scottish, Irish and German descent. As of August 2013, Lawrence was hanging out with X-Men: First Class and X-Men: Days of Future Past co-star Nicholas Hoult. The started two started hanging out in 2011 after filming X-Men: First Class, but ended their relationship in January 2013, after 2 years of hanging out togather. They reconnected 6 months later in July 2013, after filming X-Men: Days of Future Past together. ==Filmography== ===Film=== Year Title Role Notes 2008 Garden Party Tiff 2008 Agnes 2009 Mariana 2010 Winter's Bone Ree Dolly 2011 Like Crazy Sam 2011 Norah 2011 X-Men: First Class Raven Darkholme / Mystique 2012 Katniss Everdeen 2012 House at the End of the Street Elissa Cassidy 2012 Silver Linings Playbook Tiffany Maxwell 2013 The Devil You Know Young Zoe Hughes Shot in 2007 2013 Katniss Everdeen 2013 American Hustle Rosalyn Rosenfeld 2014 Serena Serena Pemberton 2014 X-Men: Days of Future Past Raven Darkholme / Mystique 2014 Katniss Everdeen 2015 Katniss Everdeen 2015 Joy Joy Mangano 2016 A Beautiful Planet Narrator 2016 X-Men: Apocalypse Raven Darkhölme / Mystique 2016 Passengers Aurora Lane 2017 Mother! Mother 2018 Red Sparrow Dominika Egorova 2019 Dark Phoenix Raven Darkhölme / Mystique ===Television=== Year Title Role Notes 2006 Monk Mascot Episode: \"Mr. Monk and the Big Game\" 2006 Company Town Caitlin Unsold TV pilot 2007 Cold Case Abby Bradford – 2007 Episode: \"A Dollar, a Dream\" 2007 Not Another High School Show Frantic Girl Unsold TV pilot 2007–2008 Medium Claire Chase / Young Allison 2 episodes 2007–2009 Lauren Pearson 31 episodes 2013 Saturday Night Live Host Episode: \"Jennifer Lawrence/The Lumineers\" ==Awards and nominations== Lawrence has been the recipient of an Academy Award, two Golden Globe Awards, two Screen Actors Guild Award, four Critic's Choice Movie Awards, a Independent Spirit Award, a Venice Film Festival Award, a Palm Springs International Film Festival Award, a Saturn Award, a Satellite Award and several other awards. She was named the Associated Press' Entertainer of the Year for 2013. ==References== ==Other websites== * * * Jennifer Lawrence Foundation * * Jennifer Lawrence at Biography.com * Jennifer Lawrence at The New York Times * Jennifer Lawrence at Rotten Tomatoes https://bollywoodlifee.com/jennifer-lawrence-biography/ Category:1990 births Category:Living people Category:American Academy Award winning actors Category:Satellite Award winners Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:Golden Globe Award winning actors Category:Actors from Louisville, Kentucky Category:Screen Actors Guild Award winners",
 "title": "Jennifer Lawrence"
}