{
 "id": "338672",
 "text": "The history of Azerbaijan goes back centuries before the USSR was formed. The population of Azerbaijan is a native to the Caucasus area, which are of turk descent. == Middle Ages and the coming of Islam == In the 7th century, Islam was introduced with the Arab conquest, which was important in the formation of a single nation and language in Azerbaijan, when the population became Muslim. A common religion for both Turkic and non-Turkic ethnic groups brought about the formation of common traditions, and the integration between the different ethnic groups living on the territory of Azerbaijan. By the middle of the 9th century, the Turkic ethnic group, the Azerbaijani people became the major ethnic group. == Russian and Soviet rule == Azerbaijan came under Russian rule after the Persian-Russian wars of 1804-1813. The country gained independence for a short period, however, towards the end of the First World War. After the collapse of the Russian Empire in 1917, Azerbaijan, together with Armenia and Georgia formed the short-lived Transcaucasian Democratic Federative Republic. When this republic ended in May 1918, Azerbaijan declared independence as the Democratic Republic of Azerbaijan on May 28, 1918, as the first modern and secular parliamentary republic in the Muslim World. However, the Red Army occupied the territory and annexed it to the newly formed Soviet Union and the Azerbaijan Soviet Socialist Republic was founded on April 28, 1920. During the Second World War and after, the Azerbaijan SSR, as a petroleum producer, was important in the energy policy of the Soviet Union. Following the politics of reforms called \"glasnost\", started by the leader of the Soviet Union Mikhail Gorbachev, riots and ethnic fighting grew in various regions of the Soviet Union, including Nagorno-Karabakh, a region of the Azerbaijan SSR. The disturbances in Azerbaijan, in response to the Soviet government's lack of response to the already tense conflict between the Azerbaijanis and Armenians, resulted in calls for independence and secession, which resulted in the massacre known as \"Black January\" in the capital Baku in January 1990. Azerbaijan eventually declared independence on October 18, 1991. The Soviet Union was ended on December 25, 1991. == Independence == When Azerbaijan became independent, the conflict with Armenia over Nagorno-Karabakh turned into the Nagorno-Karabakh War in 1991-1994. The politician Heydar Aliyev became the President of Azerbaijan in 1993 and successfully stabilized the country and a ceasefire between Azerbaijan and Armenia was signed in 1994, which paused the war. However, 20 % of Azerbaijan remained occupied by the Armenian military and the two countries were in a state of war, until November, 2020. Nevertheless, representatives of the governments of Armenia and Azerbaijan have since been holding peace talks organized by the Organization for Security and Co-operation in Europe (OSCE) \"Minsk Group\" to solve the conflict and restore the territory to Azerbaijan. When Heydar Aliyev died in 2003, his son Ilham Aliyev became the President of Azerbaijan and is continuing his father's policies today. As an important producer of petroleum and natural gas, Azerbaijan's economy is increasing very rapidly every year, and has become rich as a result. == References == ==Further reading== * Altstadt, Audrey. The Azerbaijani Turks: Power and Identity Under Russian Rule (Azerbaijan: Hoover Institution Press, 1992). * Ashurbeyli, S. \"History of Shirvanshahs\" Elm 1983, 408 (in Azeri) *Goltz, Thomas. \"Azerbaijan Diary: A Rogue Reporter`s Adventures in an Oil-Rich, War-Torn, Post-Soviet Republic\".M.E. Sharpe (1998). * Gasimov, Zaur: The Caucasus, European History Online, Mainz: Institute of European History, 2011, retrieved: November 18, 2011. * Kalankatu, Moisey (Movses). The History of Caucasian Albanians. transl by C. Dowsett. London oriental series, vol 8, 1961 (School of Oriental and African Studies, Univ of London) * At Tabari, Ibn al-Asir (trans by Z. Bunyadov), Baku, Elm, 1983? * Jamil Hasanli. At the Dawn of the Cold War: The Soviet-American Crisis Over Iranian Azerbaijan, 1941–1946, (Rowman & Littlefield; 409 pages; $75). Discusses the Soviet-backed independence movement in the region and argues that the crisis in 1945–46 was the first event to bring the Soviet Union in conflict with the United States and Britain after the alliance of World War II * Momen, M. An Introduction to Shii Islam, 1985, Yale University Press 400 p * Shaffer, B. Borders and Brethren: Iran and the Challenge of Azerbaijani Identity (Cambridge: MIT Press, 2002). * Swietochowski, Tadeusz. Russia and Azerbaijan: Borderland in Transition (New York: Columbia University Press, 1995). * Van der Leew, Ch. Azerbaijan: A Quest for Identity: A Short History (New York: St. Martin's Press, 2000). == Other websites == * Timeline starting in 1828 from BBC News * A Country Study: Azerbaijan March 1994 report from the U.S. Library of Congress * List of rulers from Rulers.org * A Short Sketch of One Century of Azerbaijani Historical Writing by Zaur Gasimov from Caucasus Analytical Digest * Afsharids from Iranica Encyclopedia",
 "title": "History of Azerbaijan"
}