{
 "id": "338702",
 "text": "Abū al-Rayḥān Muḥammad ibn Aḥmad al-Bīrūnī'Arabic spelling. (ابوریحان محمد بن احمد بیرونی). The intermediate form Abū Rayḥān al-Bīrūnī is often used in academic literature. (born 5 September 973 in Kath, Khwarezm, died in the year 13 December 1048 in Ghazni), known as Alberonius in Latin and Al-Biruni in English,Al-Biruni Commemoration Volume, (Calcutta, 1951) was a Persian * Bosworth, C. E. (1968), “The Political and Dynastic History of the Iranian World (A.D. 1000–1217)”, J.A. Boyle (ed.), Cambridge History of Iran, vol. 5: The Saljuq and Mongol Periods, Cambridge University Press: 1-202. [45]. Excerpt from page 7:\"The Iranian scholar al-BIruni says that the Khwarazmian era began when the region was first settled and cultivated, this date being placed in the early 13th-century BC) \" * Richard Frye: \"The contribution of Iranians to Islamic mathematics is overwhelming. ..The name of Abu Raihan Al- Biruni, from Khwarazm, must be mentioned since he was one of the greatest scientists in World History\"(R.N. Frye, \"The Golden age of Persia\", 2000, Phoenix Press. pg 162) * M. A. Saleem Khan, \"Al-Biruni's discovery of India: an interpretative study\", iAcademicBooks, 2001. pg 11: \"It is generally accepted that he was Persian by origin, and spoke the Khwarizmian dialect\" * -Chorasmian * Biruni (2007). Encyclopædia Britannica. Retrieved 22 April 2007; * David C. Lindberg, Science in the Middle Ages, University of Chicago Press, p. 18: ; * L. Massignon, \"Al-Biruni et la valuer internationale de la science arabe\" in Al-Biruni Commemoration Volume, (Calcutta, 1951). pp 217-219.; * Gotthard Strohmaier, \"Biruni\" in Josef W. Meri, Jere L. Bacharach, Medieval Islamic Civilization: A-K, index: Vol. 1 of Medieval Islamic Civilization: An Encyclopedia, Taylor & Francis, 2006. excerpt from page 112: \"Although his native Khwarezmian was also an Iranian language, he rejected the emerging neo- Persian literature of his time (Firdawsi), preferring Arabic instead as the only adequate medium of science.\"; * D. N. MacKenzie, Encyclopædia Iranica, \"CHORASMIA iii. The Chorasmian Language\". Excerpt: \"Chorasmian, the original Iranian language of Chorasmia, is attested at two stages of its development..The earliest examples have been left by the great Chorasmian scholar Abū Rayḥān Bīrūnī.\"; * Helaine Selin, \"Encyclopaedia of the history of science, technology, and medicine in non-western cultures \", Springer, 1997. \"Al-Biruni\", pg 157: \"his native language was the Khwarizmian dialect\"D.J. Boilot, \"Al-Biruni (Beruni), Abu'l Rayhan Muhammad b. Ahmad\", in Encyclopaedia of Islam (Leiden), New Ed., vol.1:1236-1238. Excerpt 1: \"He was born of an Iranian family in 362/973 (according to al-Ghadanfar, on 3 Dhu'l-Hididja/ 4 September — see E. Sachau, Chronology, xivxvi), in the suburb (birun) of Kath, capital of Khwarizm\". Excerpt 2:\"was one of the greatest scholars of mediaeval Islam, and certainly the most original and profound. He was equally well versed in the mathematical, astronomic, physical and natural sciences and also distinguished himself as a geographer and historian, chronologist and linguist and as an impartial observer of customs and creeds. He is known as al-Ustdadh, \"the Master\". Muslim scholar and polymath of the 11th century. Al-Biruni was one of the greatest scholars of the medieval Islamic era and was well versed in physics, mathematics, astronomy, and natural sciences. He did a lot of work as a historian, chronologist and linguist. ==Notes== ==References== Category:973 births Category:1048 deaths Category:11th-century philosophers Category:Persian mathematicians Category:Asian anthropologists Category:Ghazni Province",
 "title": "Al-Biruni"
}