{
 "id": "339322",
 "text": "Sanitary epidemiological reconnaissance is a diagnostic method in epidemiology.Beliakov VD Military Epidemiology. Textbook in Russian. Leningrad, 1976 p152. It was used in the Soviet Japanese campaign in WWII immediately behind the first tanks and mechanized vehicles of advancing Soviet army in case they encounter any contagious disease. The withdrawing enemy forces had poisoned many wells and water sources.Loza DF, Gebhardt J Fighting for the Soviet motherland in WWII. p 261, 1998 The Polish contingents serving under the UN focused their tasks among others on … sanitary-epidemiological reconnaissance … Ilnicki S POLES IN THE SERVICE OF PEACE. 1953-2003 http://skmponz.w.interia.pl/art14_eng.htm Sanitary epidemiological reconnaissance is a collection and transfer of all data available on sanitary and epidemiological situation of the area of possible action of armed forces. The aim is to clear up the specific disease origin- sources of the infection in extreme situations, including local wars and armed conflicts, the ways of the infection transfer. It should reveal the people suspected to the disease, and lead to their isolation and hospitalization. A group includes: epidemiologist, specialist in infections, bacteriologist- lab assistant), and medical orderly. The group may need a zoologist or parasitologist. After the armed forces have stopped moving the sanitary epidemiological reconnaissance turns into sanitary and epidemiological surveillance of the activity of the armed forces.Mel'nichenko P.I., Ogarkov O.I., Lizunov Yu.V. Military Hygiene and Military Epidemiology. 400 pp., ill. 2005 In 2010 at The Meeting of the States Parties to the Convention on the Prohibition of the Development, Production and Stockpiling of Bacteriological (Biological) and Toxin Weapons and Their Destruction in Geneva the sanitary epidemiological reconnaissance was suggested as means for monitoring of infections and parasitic agents and for practical implementation of the International Health Regulations (2005). The aim was to prevent and minimize the consequences of natural outbreaks of dangerous infectious diseases and the threat of use of biological weapons. The reconnaissance will be important in assessing the situation, organizing and conducting preventive activities, indicating and identifying pathogenic biological agents, suppressing infectious diseases, and providing advisory and practical assistance to local health authorities. Sanitary epidemiological reconnaissance should be performed immediately after the receiving of information about a bio-terrorism attack.N. N. Golovchenko, L.M. KorotkinANTI- EPIDEMIC MEASURES AT THE LIQUIDATION OF BIOLOGICAL TERRORIST ATTACK CONSEQUENCES http://www.bio.su/en/goe.php Dembek ZF et al. Chapter 3 Epidemiology of biowarfare and bioterrorism.2005 ==References== Category:Epidemiology Category:War",
 "title": "Sanitary epidemiological reconnaissance"
}