{
 "id": "33991",
 "text": "Clermont-Ferrand is a commune in the Puy-de-Dôme department in the Auvergne- Rhône-Alpes region in central-southern France. It is the prefecture of the department and the capital of the arrondissement of Clermont-Ferrand and the historical capital of the region of Auvergne. ==History== The modern city was born from the union of two separate towns, Clermont and Montferrand. This union has been imposed by Louis XIII in 1630 (Edict of Troyes) and was confirmed by Louis XV. While Montferrand was founded in the early twelfth century by the Counts of Auvergne on the model of fortified cities in the Southwest, Clairmont is much older, as it existed in ancient times. The earliest mention of the existence of Clairmont contained in the work of Strabo, the early first century. The city was then known Nemossos described as a \"metropolis of Arvernes.\" She later took the name of Augustonemetum then Arverni. ==Geography== To the west of Clermont-Ferrand, there is a plateau where is the Chaîne des Puys, a chain of dormant volcanoes including the Puy de Dôme. To the north of the city is the plain de Limage, a large plain in the Auvergne region in the valley of the Allier river. Clermont-Ferrand has an area of , and its average altitude is ; at the city hall, the altitude is . The distances from Clermont-Ferrand to other cities are: * Paris, the national capital - ; * Lyon, the regional capital - ; * Bordeaux - ; * Marseille - ; * Montpellier - ; * Nantes - ; * Nice - ; * Strasbourg - ; * Toulouse - . Clermont-Ferrand and its neighboring communes Clermont-Ferrand is surrounded by the communes: ===Climate=== The climate of Clermont-Ferrand is an oceanic climate, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average temperature for the year in Clermont-Ferrand, at an altitude of , is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The average amount of precipitation for the year in Clermont-Ferrand is . The month with the most precipitation on average is May with of precipitation. The month with the least precipitation on average is January with an average of . ==Population== The inhabitants of Clermont-Ferrand are known, in French, as Puydômois (women: Puydômoises). With a population of 141,365, Clermont-Ferrand has a population density of inhabitants/km2. Evolution of the population in Clermont-Ferrand Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:160000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:5000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 148759 bar:1975 from:0 till: 156763 bar:1982 from:0 till: 147224 bar:1990 from:0 till: 136181 bar:1999 from:0 till: 137140 bar:2006 from:0 till: 138992 bar:2014 from:0 till: 141365 PlotData= bar:1968 at: 148759 fontsize:S text: 148,759 shift:(-12,5) bar:1975 at: 156763 fontsize:S text: 156,763 shift:(-15,5) bar:1982 at: 147224 fontsize:S text: 147,224 shift:(-15,5) bar:1990 at: 136181 fontsize:S text: 136,181 shift:(-15,5) bar:1999 at: 137140 fontsize:S text: 137,140 shift:(-15,5) bar:2006 at: 138992 fontsize:S text: 138,992 shift:(-15,5) bar:2014 at: 141365 fontsize:S text: 141,365 shift:(-15,5) Clermont-Ferrand forms, together with other 16 communes, the urban area of Clermont-Ferrand with a population of 264,704 inhabitants (2013) and an area of . This urban area is the centre of the metropolitan area of Clermont-Ferrand, formed by 184 communes, with a population of 475,694 inhabitants (2013) and an area of . ==Administration== Clermont-Ferrand is the prefecture of the Puy-de-Dôme department since 1790. It is also the capital of the arrondissement of Clermont-Ferrand and the administrative centre () of six cantons: * Clermont-Ferrand-1, formed by part of Clermont-Ferrand, with 22,260 inhabitants (2014). * Clermont-Ferrand-2, formed by part of Clermont-Ferrand, with 23,991 inhabitants (2014). * Clermont-Ferrand-3, formed by part of Clermont-Ferrand, with 23,934 inhabitants (2014). * Clermont-Ferrand-4, formed by part of Clermont-Ferrand, with 21,592 inhabitants (2014). * Clermont- Ferrand-5, formed by part of Clermont-Ferrand, with 25,415 inhabitants (2014). * Clermont-Ferrand-6, formed by part of Clermont-Ferrand, with 24,173 inhabitants (2014). It is part of the intercommunality Clermont Auvergne Métropole. === Sister cities === Clermont-Ferrand is twinned with:http://www.clermont-ferrand.fr/-International-.html sister cities in french * Salford, England, since 1966 * Regensburg, Germany, since 1969 * Gomel, Belarus, since 1977 * Aberdeen, Scotland, since 1983 * Oviedo, Spain, since 1988 * Norman, USA, since 1994 * Bizerte, Tunisia, since 1998 * Marrakech, Morocco, since 1998 * Braga, Portugal, since 1999 * Oyem, Gabon, since 2006 * Anshan, China, since 2006 == Education == * ESC Clermont Business School ==Gallery== File:Clermont-Ferrand, vu du sommet du Puy-de-Dôme. (2).jpg|Clermont-Ferrand view from the Puy de Dôme. File:Clermont-ferrand- hotel-de-ville.jpg|Clermont-Ferrand City hall. File:Place victoire clermont- ferrand.jpg|Cathedral of Notre-Dame de l'Assomption. File:Jardin lecoq clermont-fd.jpg|Lecoq Garden. File:Inauguration statue vercingétorix 3.JPG|Statue of Vercingetorix, Place de Jaude, Clermont-Ferrand. ==Related pages== * Arrondissements of the Puy-de-Dôme department * Communes of the Puy- de-Dôme department ==References== ==Other websites== * City council website * Local tourism website Category:Former regional capitals in France",
 "title": "Clermont-Ferrand"
}