{
 "id": "340104",
 "text": "The Voting Rights Act of 1965 is a law of the United States. It made it easier for African-Americans and non-English speaking citizens to vote. In some parts of the United States, people were forced to pay a poll tax or take a literacy test before being allowed to vote. This process kept many African-Americans from voting. The Voting Rights Act made all of those practices illegal. The Voting Rights Act was made to protect the voting rights guaranteed by the Fourteenth and Fifteenth Amendments of the U.S. Constitution. It was meant to help racial minorities, especially in the southern states, have a fair chance to vote. The U.S. Department of Justice says it is the most successful civil rights law ever passed. The National Archives said it was the biggest change in how the federal and state governments handle voting since the Reconstruction time after the Civil War. The Voting Rights Act has many rules that control how elections are run. Some rules apply to the whole country and protect everyone’s right to vote. Section 2 says that state and local governments cannot make voting rules that take away or limit a person’s right to vote because of their race, skin color, or language group. Other rules ban things like literacy tests, which were once used to stop racial minorities from voting. There are also special rules that only apply to certain places. One important rule, called Section 5, said that some areas had to get permission from the U.S. attorney general or a special court before changing any voting laws. This was to make sure the changes were not unfair to minority voters. Another rule says that places with many people who speak other languages must provide bilingual ballots and election materials. Section 5 and most other special rules applied to certain areas chosen by a rule in Section 4(b), called the \"coverage formula.\" This formula was first made to cover places with serious voting discrimination in 1965. Congress updated it in 1970 and 1975. But in 2013, the U.S. Supreme Court ruled in Shelby County v. Holder that the formula was outdated and unconstitutional.Shelby County v. Holder, The Court didn’t cancel Section 5 itself, but without the formula, Section 5 could no longer be used. After that ruling, the places that had been covered by the formula started removing more people from voter lists. In 2021, the Supreme Court made another big decision in Brnovich v. Democratic National Committee. It changed how Section 2 of the Voting Rights Act is used, making it weaker. The Court said that rules that affect some groups more than others are not always illegal under Section 2. This included a rule that used to be blocked under Section 5 before the Court made it inactive. The Court also said that fears of election fraud could be used to defend these rules—even if there’s no proof that fraud happened or that the rule would prevent it. Category:1965 in the United States Category:African-American history Category:Democratic rights Category:United States federal legislation Category:1960s in law",
 "title": "Voting Rights Act of 1965"
}