{
 "id": "340141",
 "text": "I Could Go On Singing is a 1963 movie starring Judy Garland and Dirk Bogarde. It was Garland's last movie. It was not a huge box office success, but it won Garland much praise for her performance. In Bogarde's autobiographies and in the 2004 biography, it is written that Judy Garland's lines were substantially rewritten by Bogarde (with Garland's consent). == Plot == Judy Garland plays a superstar singer named Jenny Bowman. She had met a man 15–16 years before. He is now a prominent physician, played by British actor Dirk Bogarde. They had a child whom she let his father raise in England. Jenny wants to finally see him, but in the end is left to her true home, the stage. Originally titled The Lonely Stage, it was renamed I Could Go On Singing, so that audiences would know it was the first time Garland sang in a movie since A Star Is Born in 1954. == Cast == * Judy Garland as Jenny Bowman * Dirk Bogarde as David Donne * Jack Klugman as George Kogan * Gregory Phillips as Matt * Aline MacMahon as Ida * Pauline Jameson as Miss Plimpton * Jeremy Burnham as Hospital surgeon * Lorna Luft as girl on boat * Joey Luft as boy on boat == Music == All songs performed by Judy Garland. * I Am the Monarch of the Sea (Judy Garland and Boys) from H.M.S. Pinafore by Gilbert and Sullivan * Hello Bluebird, words and music by Cliff Friend * It Never Was You, Kurt Weill and Maxwell Anderson * By Myself, Arthur Schwartz and Howard Dietz * I Could Go On Singing, Harold Arlen and E.Y. Harburg == Movie reviews == \"Either you are or you aren't - a Judy Garland fan that is. And if you aren't, forget about her new movie, I Could Go On Singing, and leave the discussion to us devotees. You'll see her in close- up...in beautiful, glowing Technicolor and striking staging in a vibrant, vital performance that gets to the essence of her mystique as a superb entertainer. Miss Garland is - as always - real, the voice throbbing, the eyes aglow, the delicate features yielding to the demands of the years - the legs still long and lovely. Certainly the role of a top-rank singer beset by the loneliness and emotional hungers of her personal life is not an alien one to her...\" \\- Judith Crist, The New York Herald Tribune \"3 stars...Judy Garland is back on screen in a role that might have been custom-tailored for her particular talents. A new song, I Could Go On Singing, provides her with a little clowning, a chance to be gay, a time for wistfulness, an occasion for tears. She and Dirk Bogarde play wonderfully well together, even though the script itself insists on their being mismatched...\" \\- Dorothy Masters, The New York Daily News == Soundtrack and video/DVD releases == It was released on video in 1989, and on DVD in 2004. The soundtrack album was released at the time of the original movie release, and appeared on CD in 2002 along with the Garland album That's Entertainment! == Other websites == * The Judy Garland Online Discography \"I Could Go On Singing\" pages. * ==References== Category:1963 drama movies Category:British drama movies Category:British musical movies Category:American drama movies Category:American musical movies Category:1963 musical movies Category:Movies directed by Ronald Neame Category:MGM movies Category:Movies about entertainers Category:Movies about singers",
 "title": "I Could Go On Singing"
}