{
 "id": "340156",
 "text": "The National Liberation Front (French: Front de Libération Nationale FLN), is a nationalist, socialist political party in Algeria. It was formed on 1 November 1954, by several smaller groups, initially as a liberation movement, driven by anti-colonial ideology. It gained independence from France after the Algerian War. After independence in 1962, the FLN became the sole political party, and Algeria became a one-party state until in 1989 other parties were allowed to take part in elections. == History == The FLN was created on 1 November 1954, yet its origins can be seen as far back as World War II when the rise of anti-colonialism and Algerian nationalist rhetoric began. It was founded to reconcile factions within the Algerian nationalist movement and to remove France as a colonial presence. By 1956 nearly all Algerian nationalist organizations had joined, led by the Revolutionary Committee of Unity and Action (French: Comité Révolutionnaire d’Unité et d’Action), the FLN had established itself as Algeria's main nationalist group. === Algerian War === The Algerian War was launched in 1954, as the FLN led forces with their military division, the National Liberation Army, against French occupation. The National Liberation Army used predominantly guerrilla warfare, which characterized this period for the group. In 1962 the FLN entered talks with the French President Charles de Gaulle, concluding with the signing of the Evian Accords, which led to Algerian independence == Ideology == === War-time === The revolutionary party identified with an anti-colonial ideology that wished to gain independence from previous imperial powers. The FLN used ideology as a means to legitimize their party, they gained support from citizens who might not otherwise have supported the political goals of the party. Furthermore, the FLN had a nationalist and socialist ideology (which is also why it is considered a nationalist/socialist party) for several reasons. Oftentimes, when countries fight for independence, their movement is led by nationalists, as nationalism causes citizens to want to break free from their colonizers. The FLN's ideology not only legitimized their actions but also created a sense of solidarity and identity among Algerians. Also, the FLN created a sort of bridge between Algeria and other nations that were fighting colonialism. === Post-war === Post-war Algeria's government had a nationalistic extremist ideology. Ironically, much of the left in France supported the regime associated with this ideology. The FLN was declining in February 1989 when the country implemented a new constitution. The new constitution lead to the end of Algeria's socialism and its corresponding one- party system. == Aftermath == Algeria gained sovereignty over its political future concerning France after a referendum that was held on 8 January, 1961. Following the referenda, the French Government and the FLN had several negotiations between 7 and 18 March of the following year. The negotiations led to an ending of the armed conflict between France and FLN-led Algeria on 19 March, 1962. The ending came about after a common agreement of cooperation between the two states. == References == Category:Politics of Algeria Category:Political parties in Africa Category:1954 establishments in Africa Category:Nationalist organizations in Africa Category:National liberation movements Category:20th-century establishments in Algeria == Other websites == Category:Organisations based in Algeria Category:Socialist organisations",
 "title": "National Liberation Front (Algeria)"
}