{
 "id": "340103",
 "text": "The Civil Rights Act ()was a law passed in the United States in 1964 by President Lyndon B Johnson. The law made it illegal to discriminate against someone based on their race or gender. It also ended segregation in schools and workplaces, along with social life. It bans unfair rules for registering to vote, separates people by race in schools and public places, and stops discrimination at work. The law is still seen as one of the most important in U.S. history. At first, the government didn’t have strong powers to enforce the law, but stronger rules were added later. Congress used different parts of the U.S. Constitution to support the law—especially its power to control trade between states (Commerce Clause of Article I, Section 8), to make sure everyone is treated equally under the 14th Amendment, and to protect voting rights under the 15th Amendment. President John F. Kennedy first introduced the law in June 1963, but it faced strong opposition in the Senate. After Kennedy was killed in November 1963, President Lyndon B. Johnson took over and pushed the law forward. The House of Representatives passed it on February 10, 1964. After a long 72-day delay in the Senate, the bill finally passed there on June 19, 1964. The final vote was 290–130 in the House and 73–27 in the Senate. After a small change from the Senate was accepted, President Johnson signed the Civil Rights Act into law on July 2, 1964 at the White House. ==Background== ===Reconstruction and New Deal era=== In 1883, the U.S. Supreme Court made an important decision called the Civil Rights Cases. The Court said that Congress didn’t have the power to stop discrimination by private businesses. This decision took away much of the strength of the Civil Rights Act of 1875, which was meant to protect civil rights. During the late 1800s and early 1900s, the Supreme Court often struck down laws that tried to regulate private businesses, unless the laws were about public morals. In the 1930s, during the New Deal, the Supreme Court began to change its view. It started to allow more government control over private businesses by using the Commerce Clause. This shift helped the federal government later create civil rights laws that banned discrimination in both public and private areas. Partly influenced by advice from his group of Black advisors known as the \"Black Cabinet\" and the March on Washington Movement, President Franklin Roosevelt signed Executive Order 8802 just before the U.S. entered World War II. This was the first federal order against discrimination, and it created the Fair Employment Practices Committee to help make sure jobs were given fairly. Later, President Harry Truman, who came after Roosevelt, set up the President's Committee on Civil Rights. He also suggested the first major civil rights law of the 20th century. Truman signed Executive Orders 9980 and Executive Order 9981 to make sure there was fair hiring and to end segregation in the federal government and the military. ===Civil Rights Act of 1957=== The Civil Rights Act of 1957 was signed into law by President Dwight D. Eisenhower on September 9, 1957. It was the first major civil rights law passed by the U.S. government since the Civil Rights Act of 1875. After the Supreme Court said school segregation was illegal in 1954 (in the Brown v. Board of Education case), many Southern Democrats strongly resisted desegregation. Even white leaders who had been moderate began to take openly racist positions. To reduce pressure for bigger changes, President Eisenhower suggested a civil rights law focused on protecting the voting rights of Black Americans. Although the law did not lead to a big increase in Black voter turnout—many counties with mostly Black populations had very low or even zero Black voter registration—it still created two important things: the U.S. Commission on Civil Rights and the United States Department of Justice Civil Rights Division. However, by 1960, Black voting had only increased by about 3%, so Congress passed another law, the Civil Rights Act of 1960, to fix some of the problems left by the 1957 law.James A. Miller, \"An inside look at Eisenhower's civil rights record\" The Boston Globe at boston.com, 21 November 2007, accessed 28 October 2011 === Activism === Global media had a big influence during the Kennedy and Johnson presidencies and helped push for the 1964 Civil Rights Act to become law. Television showed the world the violent responses to civil rights protests, like the 1957 Little Rock Crisis, where people resisted the Supreme Court’s decision to end school segregation, and the 1963 attacks on peaceful protestors in Birmingham. These images brought negative attention to the U.S. and put strong pressure on the government to pass major civil rights laws. ===1963 Kennedy civil rights bill=== After winning the 1960 United States presidential election with 70% of the African American vote, President John F. Kennedy was careful about pushing civil rights laws because he had only won by a small margin, and the Democrats had only a small lead in Congress. He didn’t want to lose support from Southern politicians. The Miller Center says he planned to wait until his second term to propose a civil rights bill. However, growing racial tensions and protests in the spring of 1963—like the Birmingham campaign—made Kennedy realize he had to act sooner. On June 11, 1963, he gave a speech to the nation and introduced a civil rights bill. He asked Congress to pass a law that would give all Americans the right to be served in public places like hotels, restaurants, theaters, and stores. He also wanted better protection for the right to vote. Later that summer, labor leader Walter Reuther warned that if Congress didn’t pass the bill, the country might face another civil war. Kennedy’s bill was similar to the Civil Rights Act of 1875, which the Supreme Court had overturned in 1883. His bill aimed to ban discrimination in public spaces and let the U.S. Attorney General help fight school segregation in court. However, it left out some things that civil rights activists wanted, like protection from police violence, ending job discrimination in private businesses, and giving the Justice Department power to start lawsuits over segregation or job bias. ==Legislative history== ===House of Representatives=== On June 11, 1963, President Kennedy met with Republican leaders to talk about his civil rights bill before giving a speech on TV that night. Two days later, Senate Minority Leader Everett Dirksen (Republican) and Senate Majority Leader Mike Mansfield (Democrat) supported the bill—except for the part about giving everyone equal access to public places. Because of this, some Republican members of the House wrote a compromise version of the bill. On June 19, Kennedy officially sent his original bill to Congress, saying that it was urgent and needed action. The bill first went to the House of Representatives and was reviewed by the Judiciary Committee, led by Democrat Emanuel Celler of New York.Loevy, Robert D. (1997), The Civil Rights Act of 1964: The Passage of the Law that Ended Racial Segregation, State University of New York Press, p. 171. Golway, Terry and Krantz, Les (2010), JFK: Day by Day, Running Press, p. 284. After holding hearings, the committee made the bill stronger. They added parts that would: * Ban racial discrimination in jobs * Give better protection to Black voters * End segregation in all public facilities, not just schools * Strengthen the rules against segregation in places like lunch counters They also gave the Attorney General the power to sue to protect people whose rights were being taken away—this was known as \"Title III.\" This part had been taken out of earlier civil rights laws in 1957 Act and 1960 Act. Civil rights groups strongly supported adding it back because it could help protect peaceful protesters and Black voters from police violence and unfair treatment. ===Lobbying efforts=== A group called the Leadership Conference on Civil Rights helped organize support for the bill. This group was made up of 70 liberal and labor organizations. Two important people who worked to convince Congress to pass the bill were civil rights lawyer Joseph L. Rauh Jr. and Clarence Mitchell Jr. from the NAACP. After the March on Washington for Jobs and Freedom, leaders like Roy Wilkins, A. Philip Randolph, and Walter Reuther met with Kennedy. They asked him to support a part of the bill that would create a Fair Employment Practices Commission. This commission would stop discrimination by federal agencies, labor unions, and private companies. In late October 1963, Kennedy invited leaders from Congress to the White House to try to get enough votes to pass the bill in the House of Representatives.Reeves, Richard (1993), President Kennedy: Profile of Power, pp. 628–631 In November, the bill moved out of the Judiciary Committee and went to the Rules Committee. But the chairman of that committee, Howard W. Smith, a Democrat from Virginia who strongly supported segregation, said he planned to block the bill from moving forward. ===Johnson's appeal to Congress=== When President John F. Kennedy was killed on November 22, 1963, it changed the political situation. The new president, Lyndon B. Johnson, used his experience in Congress and his power as president to support the civil rights bill. In his first speech to Congress on November 27, 1963, Johnson said the best way to honor Kennedy’s memory was to quickly pass the civil rights bill that Kennedy had worked so hard for. Emanuel Celler, head of the Judiciary Committee, tried to move the bill out of the Rules Committee by filing a special petition. This petition needed a majority of House members to sign it in order to bring the bill to a vote. At first, it was hard to get enough signatures because some members didn’t want to break the usual rules of the House, even though they supported the bill. By the time Congress took its winter break, they still needed 50 more signatures. When Congress came back from the break, it was clear that most people in the North supported the bill, and the petition would soon have enough signatures. To avoid embarrassment, the Rules Committee chairman, Howard W. Smith, gave in and let the bill move forward. ===Passage in the Senate=== President Johnson wanted the bill to become law quickly. Normally, the bill would have gone to the Senate Judiciary Committee, which was led by Senator James O. Eastland from Mississippi. Eastland strongly opposed civil rights and likely would have blocked the bill. To get around this, Senate Majority Leader Mike Mansfield skipped the usual process. Instead of letting the committee hold up the bill, he gave it a second reading right away on February 26, 1964, which sent it straight to the full Senate for debate.On March 30, 1964, the Senate began debating the bill. A group of 18 Southern Democratic Senators and one Republican, John Tower of Texas, tried to stop the bill by launching a filibuster (a long debate to delay or block a vote). Their leader, Senator Richard Russell of Georgia, said they would fight hard against anything that brought racial equality in the South. Senator Strom Thurmond, who was a Democrat at the time, also strongly opposed the bill. He said the civil rights proposals were unconstitutional, not needed, and reminded him of the harsh laws from the Reconstruction era after the Civil War. After the Senate filibuster went on for 54 days, Senators Mansfield, Hubert Humphrey, Everett Dirksen, and Thomas Kuchel introduced a new version of the civil rights bill. This version was meant to win support from enough Republicans and liberal Democrats to end the filibuster. Although the new bill was slightly weaker than the one passed by the House—especially in terms of government control over private businesses—it was still strong enough that the House did not ask for changes. Senator Robert Byrd finally ended his part of the filibuster on the morning of June 10, 1964, after speaking for 14 hours and 13 minutes. By that time, the Senate had spent 60 working days debating the bill, including six Saturdays. The day before, Senator Humphrey, who was in charge of the bill, believed he had the 67 votes needed to stop the debate. With help from six undecided senators, the Senate voted 71 to 29 to end the filibuster. This was the first time in U.S. history the Senate had enough votes to break a filibuster on a civil rights bill. Since 1927, the Senate had only managed to end a filibuster once on any issue. One emotional moment happened during that vote when Senator Clair Engle from California was brought in by wheelchair. He was dying from brain cancer and couldn’t speak, but when his name was called, he pointed to his eye to signal his “Yes” vote. He died seven weeks later. ===Final passage=== On June 19, the Senate approved the revised version of the bill with a vote of 73 to 27. A special conference committee then agreed to use the Senate’s version. After that, both the House and the Senate passed the final bill. President Lyndon B. Johnson signed it into law on July 2, 1964. ===Vote totals=== Senate vote on the Civil Rights Act of 1964 Senate vote on the Civil Rights Act of 1964 Senate vote on the Civil Rights Act of 1964 Senate vote on the Civil Rights Act of 1964 June 19, 1964 Party Party Total votes June 19, 1964 Democratic Republican Total votes Yea 46 27 73 Nay 21 6 27 Result: Result: Result: Result: Result: {| class=\"wikitable sortable\" style=\"margin:auto;\" {| class=\"wikitable sortable\" style=\"margin:auto;\" {| class=\"wikitable sortable\" style=\"margin:auto;\" {| class=\"wikitable sortable\" style=\"margin:auto;\" {| class=\"wikitable sortable\" style=\"margin:auto;\" Senator Party State Vote R Vermont Yea R Colorado Yea D New Mexico Yea D Alaska Yea D Indiana Yea R Maryland Yea R Utah Yea D Nevada Yea R Delaware Yea D Maryland Yea D North Dakota Yea D Virginia Nay D West Virginia Nay D Nevada Yea R Kansas Yea R New Jersey Yea D Idaho Yea D Pennsylvania Yea R Kentucky Yea R New Hampshire Nay R Nebraska Yea R Illinois Yea D Connecticut Yea R Colorado Yea D Illinois Yea D Mississippi Nay D Oklahoma Yea D Louisiana Nay D California Yea D North Carolina Nay R Hawaii Yea D Arkansas Nay R Arizona Nay D Tennessee Nay D Alaska Yea D Michigan Yea D Indiana Yea D Arizona Yea R Iowa Nay D Alabama Nay D Florida Nay R Nebraska Yea D Minnesota Yea D Hawaii Yea D Washington Yea R New York Yea D South Carolina Nay R Idaho Yea D North Carolina Nay R New York Yea D Massachusetts Yea R California Yea D Ohio Yea D Louisiana Nay D Missouri Yea D Washington Yea D Montana Yea D Minnesota Yea D Arkansas Nay D Wyoming Yea D South Dakota Yea D New Hampshire Yea D Michigan Yea R New Mexico Nay D Montana Yea R Iowa Yea D Oklahoma Yea D Oregon Yea R Kentucky Yea D Utah Yea R South Dakota Yea D Maine Yea D Wisconsin Yea D Oregon Yea D Rhode Island Yea R Kansas Yea D Rhode Island Yea R Vermont Yea D Wisconsin Yea D West Virginia Yea D Connecticut Yea D Virginia Nay D Georgia Nay R Massachusetts Yea R Pennsylvania Yea R Wyoming Nay D Florida Nay R Maine Yea D Alabama Nay D Mississippi Nay D Missouri Yea D Georgia Nay D South Carolina Nay R Texas Nay D Tennessee Nay R Delaware Yea D New Jersey Yea D Texas Yea R North Dakota Yea D Ohio Yea Totals are in Yea–Nay format: * Original House version: 290–130 (69–31%) * Cloture in the Senate: 71–29 * Senate version: 73–27 * Senate version, as voted on by the House: 289–126 (70–30%) ====By party==== Original House version: * Democratic Party: 152–96 (61–39%) * Republican Party: 138–34 (80–20%) Cloture in the Senate: * Democratic Party: 44–23 (66–34%) * Republican Party: 27–6 (82–18%) Senate version: * Democratic Party: 46–21 (69–31%) * Republican Party: 27–6 (82–18%) Senate version, voted on by the House: * Democratic Party: 153–91 (63–37%) * Republican Party: 136–35 (80–20%) ====By region==== In this context, \"Southern\" only refers to members of Congress from the 11 states that were part of the Confederate States of America during the Civil War in America. \"Northern\" means members from the other 39 states, even if some of those states are in the South, like Kentucky. House of Representatives: * Northern: 281–32 (90–10%) * Southern: 8–94 (8–92%) Senate: * Northern: 72–6 (92–8%) * Southern: 1–21 (5–95%) – Ralph Yarborough from Texas was the only Southern Senator who voted \"yes\" on the bill. ====By party and region==== House of Representatives: * Southern Democrats: 8 voted yes, 83 voted no — the 8 who voted yes included 4 from Texas (Jack Brooks, Albert Thomas, J. J. Pickle, and Henry González), 2 from Tennessee (Richard Fulton and Ross Bass), Claude Pepper from Florida and Charles L. Weltner from Georgia. * Southern Republicans: 0 voted yes, 11 voted no. * Northern Democrats: 145 voted yes, 8 voted no. * Northern Republicans: 136 voted yes, 24 voted no. Also, 4 Representatives voted \"Present\" (meaning they didn’t vote yes or no), and 13 didn’t vote at all. Senate: * Southern Democrats: 1 voted yes, 20 voted no — only Ralph Yarborough of Texas supported the bill. * Southern Republicans: 0 voted yes, 1 voted no — John Tower from Texas, the only Southern Republican, voted against it. * Northern Democrats: 45 voted yes, 1 voted no — only Robert Byrd from West Virginia voted against it. * Northern Republicans: 27 voted yes, 5 voted no — those who voted no were Norris Cotton (New Hampshire), Barry Goldwater (Arizona), Bourke B. Hickenlooper (Iowa), Edwin L. Mechem (New Mexico), and Milward Simpson (Wyoming). === Aspects === ==== Women's rights ==== One part of the Civil Rights Act was about women's rights. A year earlier, in 1963, Congress passed the Equal Pay Act, which said men and women should get equal pay for the same work. When the Civil Rights Act was being debated, Congressman Howard W. Smith, a powerful Democrat from Virginia who didn’t support civil rights, added the word \"sex\" to the bill. This meant the law would also protect people from discrimination based on gender, not just race. His change passed with a vote of 168 to 133. Some people think Smith added \"sex\" to try to make the bill fail, because he didn’t support rights for Black people or women. Others think he truly supported women’s rights.Freeman, Jo. \"How 'Sex' Got Into Title VII: Persistent Opportunism as a Maker of Public Policy,\" Law and Inequality: A Journal of Theory and Practice, Vol. 9, No. 2, March 1991, pp. 163–184. online version Rosenberg, Rosalind (2008), Divided Lives: American Women in the Twentieth Century, pp. 187–188Gittinger, Ted and Fisher, Allen, LBJ Champions the Civil Rights Act of 1964, Part 2 , Prologue Magazine, The National Archives, Summer 2004, Vol. 36, No. 2 (\"Certainly Smith hoped that such a divisive issue would torpedo the civil rights bill, if not in the House, then in the Senate.\") Republicans, who had supported equal rights for women since 1944, helped pass the change. Labor unions, on the other hand, didn’t support it, and some northern Democrats opposed it. When Smith introduced the change, many in the room laughed. Smith said he was serious. He had worked with women’s rights groups for many years and had supported the Equal Rights Amendment for two decades. He worked with Representative Martha Griffiths, who also pushed hard for the change. Griffiths said the law would protect Black women but not white women unless \"sex\" was added. Lawyer Pauli Murray supported this view, and Griffiths also argued that laws \"protecting\" women from tough jobs were actually meant to keep them out. In the end, the amendment to include \"sex\" passed with support from Republicans and Southern Democrats. The full bill passed with support from Republicans and Northern Democrats.Olson, Lynne (2001), Freedom's Daughters: The Unsung Heroines of the Civil Rights Movement, p. 360Rosenberg, Rosalind (2008), Divided Lives: American Women in the Twentieth Century, p. 187 notes that Smith had been working for years with two Virginia feminists on the issue. Because the rule about sex discrimination was added quickly, there isn’t much information about what lawmakers meant by it. Later, Supreme Court Justice William Rehnquist said this made it hard to interpret exactly what \"discrimination based on sex\" means under the law.Harrison, Cynthia (1989), On Account of Sex: The Politics of Women's Issues, 1945–1968, p. 179. ==== Desegregation ==== People who were against the Civil Rights Act argued that it would lead to forced busing of students to schools in order to meet certain racial numbers. Supporters of the bill, like Emanuel Celler and Jacob Javits, said this wasn’t true. One of the main supporters, Hubert Humphrey, even added two changes to the bill to make sure busing would not be allowed. Humphrey said that forcing busing based on race would be unconstitutional. Javits also said that any government official who tried to use the bill for busing would be acting foolishly. However, two years later, the Department of Health, Education and Welfare said that schools in the South would have to bus students to meet racial balance rules. == Aftermath == === Political Effects === The Civil Rights Act caused a big split in both major political parties and led to lasting changes in who supported them. President Robert F. Kennedy knew that backing the bill might cause the Democratic Party to lose support in the South. Still, Attorney General Robert F. Kennedy and Vice President Lyndon B. Johnson pushed for the bill. Johnson told an aide that even though it was risky and they might lose Southern states, those states might not support them anyway.Kotz, Nick (2005), Judgment Days: Lyndon Baines Johnson, Martin Luther King, Jr., and the Laws that Changed America, p. 61. Senator Richard Russell, Jr. warned Johnson that supporting civil rights would cost him support in the South and possibly the election.Branch, Taylor (1998), Pillar of Fire, p. 187. But Johnson ended up winning the 1964 election in a huge landslide. Even though five Southern states voted Republican in 1964 election, the South slowly became a Republican stronghold by the 1990s. Most members of both political parties voted for the bill, but not all. Senator Barry Goldwater, the Republican candidate for president in 1964, voted against the bill. Although he was against segregation, he said, \"You can't legislate morality.\" He had supported earlier civil rights laws in 1957 and 1960, and the 24th Amendment banning the poll tax. But he thought part of the 1964 bill—Title II—took away personal freedom and states' rights. Many Democrats and Republicans from Southern states fought the bill, leading a 60-day filibuster in the Senate. Among them were Senators Albert Gore, Sr. (D-TN), J. William Fulbright (D-AR), and Robert Byrd (D-WV), who spoke for 14 hours straight to block the bill. === Continued resistance === Some white business owners argued that Congress didn’t have the right to force them to stop segregation in public places. One of them, Moreton Rolleston, owned a motel in Atlanta, Georgia. He said he shouldn’t be forced to allow Black guests, claiming, “The real question is whether Congress can take away a person’s freedom to run their business and choose their customers.” Rolleston believed the Civil Rights Act of 1964 violated the Constitution, especially the Fourteenth Amendment, Fifth Amendment and Thirteenth Amendment, by taking away his rights and property unfairly. But in the Supreme Court case Heart of Atlanta Motel v. United States (1964), the Court ruled that Congress had the power to pass the law under the Commerce Clause in the Constitution and rejected Rolleston’s arguments. Even after the law passed, many people—especially in the South—still resisted it. For example, in 1968, Black college students in Orangeburg, South Carolina, tried to integrate a bowling alley. They were violently attacked, leading to protests and what became known as the “Orangeburg massacre.” School boards also resisted integration for years. Real progress in ending segregation in schools didn’t happen until the late 1960s and early 1970s, after a court case called Green v. County School Board of New Kent County (1968). === Later impact on LGBT rights === In June 2020, the U.S. Supreme Court made a decision in three cases (Bostock v. Clayton County, Altitude Express v. Zarda, and R.G. & G.R. Harris Funeral Homes v. EEOC). The Court said that Title VII of the Civil Rights Act, which bans job discrimination based on sex, also protects people from being treated unfairly because of their sexual orientation or gender identity. After the ruling, USA Today reported that this decision could affect many other areas, like education, health care, housing, and loans, by strengthening protections against sex discrimination in those areas too. == Titles == === Title Ivoting rights === Title I This part said that voting rules must be applied the same way to everyone, no matter their race. However, it did not get rid of literacy tests, which were often used to stop Black people and poor people from voting. It also didn’t stop people from being punished, threatened, or hurt for trying to vote. The law still allowed states to set “qualifications” for voting, so people didn’t automatically have the right to vote just because they were citizens. A later law—the Voting Rights Act of 1965—fixed many of these problems and banned literacy tests. === Title IIpublic accommodations === Title II This part made it illegal to treat people differently in places like hotels, motels, restaurants, theaters, and other public places, based on their race, skin color, religion, or where they came from. It only applied to places open to the public and involved in business across state lines. It did not apply to private clubs. === Title IIIdesegregation of public facilities === Title III This part said that state and local governments could not keep people out of public places—like parks, libraries, or swimming pools—because of their race, color, religion, or national origin. === Title IVdesegregation of public education === Title IV This part supported the desegregation (ending of racial separation) of public schools. It gave the U.S. Attorney General the power to go to court to enforce this. === Title VCommission on Civil Rights === Title V This part gave more powers and new rules to the Civil Rights Commission, which was created in Civil Rights Act of 1957 to help protect people’s civil rights. === Title VInondiscrimination in federally assisted programs === Title VI This part said that programs or activities that get money from the federal government cannot discriminate based on race, color, or national origin. If they do, they can lose their federal funding. General This part of the law says it is the policy of the United States that people should not face discrimination based on race, skin color, or national origin in any program or activity that gets money from the federal government. This rule does not apply to programs that give money to other countries. * Section 601 says that no one in the U.S. can be left out of, denied help from, or treated unfairly in any program that receives federal money because of their race, color, or national origin. * Section 602 tells federal agencies (like the Department of Education or Health) to create rules to enforce this policy. If someone receiving federal money breaks these rules, the agency can stop giving them money—but only after a fair hearing. Before doing that, the agency must try to solve the problem by working with the person or organization first. * Section 603 says that if a federal agency decides to stop funding someone for breaking these rules, that decision can be reviewed by a court. Even if the law normally wouldn’t allow courts to review such a decision, this section makes sure that people affected can still take the matter to court. This title is meant to make sure that taxpayer money doesn’t go to programs that treat people unfairly because of their race or background. 2019 Executive Order On December 11, 2019, an executive order was made to fight against antisemitism (discrimination against Jewish people). It says that even though Title VI of the Civil Rights Act does not cover religion, people who face discrimination because of their race, color, or national origin are still protected under Title VI—even if they are part of a group with shared religious practices. Discrimination against Jewish people can be a violation of Title VI if it is based on race, color, or national origin. The government will work hard to stop antisemitism just like it works to stop other types of discrimination under Title VI. The order also says that agencies enforcing Title VI should think about the working definition of antisemitism made by the International Holocaust Remembrance Alliance (IHRA) in 2016. They should also look at examples of antisemitism from IHRA to help decide if discrimination has happened. 2025 Executive Order In April 2025, President Trump signed Executive Order 14281. It says the Attorney General must start actions to change or remove rules about how Title VI is applied. These changes will affect any rules that deal with “disparate-impact liability” (which means holding someone responsible for policies that hurt certain groups, even if there was no intention to discriminate).Executive Order 14281 – Restoring Equality of Opportunity and Meritocracy: * * * * === Title VIIequal employment opportunity === Title VII is part of the law that says employers cannot treat people unfairly because of their race, color, religion, sex, or national origin. It applies to employers who have 15 or more employees working for them for at least 20 weeks in a year.Parr v. Woodmen of the World Life Insurance Company, 791 F.2d 888 (11th Cir. 1986). The law also protects people from discrimination if they are connected to someone of a certain race, color, religion, sex, or national origin—like being married to someone of a different race. Other laws added later to Title VII also stop discrimination based on pregnancy, age, and disability. In very rare cases, an employer can treat someone differently if a certain trait is really needed for the job. For example, if the trait is necessary for the business to work properly, and there is no other way to do the job. This is called a \"bona fide occupational qualification\" or BFOQ, but it’s a very narrow rule and hard to prove. Just because a boss or customer prefers a worker of a certain religion does not count as a BFOQ. Title VII also lets employers or groups ignore this rule if a person is involved with the Communist Party or certain organizations that must register as Communist groups under a law from 1950. Some employers have full or partial exceptions to following Title VII rules. These include: * The federal government (some government offices must follow Title VII rules now 42 U.S.C. Section 2000e-16) * Native American tribes that the government officially recognizesFields, C. K., & Cheeseman, H. R., Contemporary Employment Law (New York: Wolters Kluwer, 2017), p. 197 * Religious groups doing work related to their religious activities, including their schools * Genuine nonprofit private membership groups The Bennett Amendment is a rule in Title VII that limits claims about pay discrimination based on sex. It says employers can pay men and women differently if allowed by the Equal Pay Act of 1963. The Equal Employment Opportunity Commission (EEOC) and some state agencies called Fair Employment Practices Agencies (FEPAs) enforce Title VII (see ). They investigate complaints, try to help settle cases, and can sue employers for workers. If a state law conflicts with the federal law, the federal law wins. All states except Arkansas and Mississippi have a FEPA (see EEOC and state FEPA directory ).U.S. Department of Labor Employment and Training Administration. (1999) \"Chapter 2: Laws and Regulations with Implications for Assessments\". People who believe they were discriminated against can also file their own lawsuit. But they must first file a complaint with the Equal Employment Opportunity Commission (EEOC) within 180 days after they find out about the discrimination, or they might lose the chance to sue. Title VII only applies to employers who have 15 or more employees working for at least 20 weeks during the current or previous year.() 2025 Executive Order In April 2025, President Trump signed Executive Order 14281. It said that within 45 days, the Attorney General and the head of the Equal Employment Opportunity Commission (EEOC) must review all ongoing cases and investigations under federal civil rights laws, including Title VII of the Civil Rights Act of 1964, that use a legal idea called \"disparate-impact liability.\" They must then take action following the rules of this order. Past Administrative Actions In 2012, the EEOC decided that it is illegal under Title VII to discriminate against someone because of their gender identity or if they are transgender. This includes discrimination based on stereotypes about gender, discomfort with a person’s transition, or because someone thinks their sex has changed.Macy v. Holder , EEOC Appeal No. 0120120821 (April 20, 2012) In 2014, the EEOC started lawsuits against companies for gender identity discrimination and was looking at more cases. , Commissioner Chai Feldblum worked to help people know that Title VII protects against discrimination based on sexual orientation or gender identity . On December 15, 2014, the U.S. Department of Justice (DOJ), led by Attorney General Eric Holder, agreed with the EEOC. The DOJ said Title VII’s ban on sex discrimination also includes discrimination based on gender identity or being transgender. The DOJ had already stopped fighting claims from transgender federal employees. In 2015, the EEOC confirmed again, with a memo, that sexual orientation is protected under Title VII. But in October 2017, Attorney General Jeff Sessions canceled Holder’s memo. Sessions said Title VII should only be understood to protect against discrimination between “men and women.” He said Title VII does not protect against discrimination based on gender identity itself. A DOJ official said the previous administration went beyond what the law allows, so they had to change the policy. However, some lawyers disagreed, saying Sessions’ memo does not reflect the actual law but what the DOJ wants the law to be. The EEOC kept its position, which caused some disagreements with the DOJ. Major Changes: Equal Employment Opportunity Act of 1972 Between 1965 and 1972, Title VII didn’t have strong ways to enforce its rules. The Equal Employment Opportunity Commission (EEOC) could only investigate complaints about discrimination but could only ask the Justice Department to take legal action. In 1972, Congress passed a new law called the Equal Employment Opportunity Act. This changed Title VII and gave the EEOC the power to start legal cases on its own. After that, the EEOC played a big role in shaping how civil rights laws were understood in court. === Title VIIIregistration and voting statistics === Title VIII required collecting information about voter registration and voting in certain areas chosen by the Commission on Civil Rights. === Title IXintervention and removal of cases === For rules about stopping sex discrimination in schools that get federal money, see a different law called the Education Amendments Act of 1972. Title IX made it easier to move civil rights cases from state courts to federal courts. This was important because civil rights activists believed they could not get fair trials in state courts. === Title XCommunity Relations Service === Title X Title X created the Community Relations Service. This group helps communities deal with disputes involving discrimination. It used to be part of the Department of Commerce but later moved to the Department of Justice. === Title XImiscellaneous === Title XI Title XI says that if someone is accused of certain types of criminal contempt related to Titles II through VII of the Act, they have the right to a jury trial. If found guilty, they can be fined up to $1,000 or jailed for up to six months. == Major amendments == === Equal Employment Opportunity Act of 1972 === Between 1965 and 1972, Title VII didn’t have strong ways to enforce its rules. The Equal Employment Opportunity Commission (EEOC) could only investigate complaints about discrimination but could only ask the Justice Department to take legal action. In 1972, Congress passed a new law called the Equal Employment Opportunity Act.Milestones In The History of Equal Employment Opportunity Commission: 1972 Accessed July 1, 2014 This changed Title VII and gave the EEOC the power to start legal cases on its own. After that, the EEOC played a big role in shaping how civil rights laws were understood in court. == United States Supreme Court cases == === Title II case law === ==== Heart of Atlanta Motel, Inc. v. United States (1964) ==== After the Civil Rights Act of 1964 was passed, the Supreme Court said the law could apply to private businesses because Congress can control business between states. This case confirmed the law was constitutional, but not all legal questions were settled. ==== Katzenbach v. McClung (1964) ==== ==== United States v. Johnson (1968) ==== ==== Newman v. Piggie Park Enterprises, Inc. (1968) ==== ==== Daniel v. Paul (1969) ==== ==== McDonnell Douglas Corp. v. Green (1973) ==== === Title VI case law === ==== Lau v. Nichols (1974) ==== The Supreme Court said San Francisco schools were breaking the law by putting students who don’t speak English into regular classes without help. ==== Regents of the Univ. of Cal. v. Bakke (1978) ==== ==== Alexander v. Sandoval (2001) ==== ==== Students for Fair Admissions v. Harvard (2023) ==== === Title VII case law === ==== Griggs v. Duke Power Co. (1971) ==== ==== Phillips v. Martin Marietta Corp. (1971) ==== In this case, the Court said a company can’t refuse to hire a woman just because she has young children unless it also treats men with children the same way. Also, a federal court canceled an Ohio law that said women couldn’t do jobs requiring lifting 25 pounds and that women had to take lunch breaks but men did not. The Supreme Court ruled that newspapers can’t print separate job ads for men and women anymore. The government also stopped labeling federal jobs as \"women only\" or \"men only.\" ==== Washington v. Davis (1976) ==== ==== TWA v. Hardison (1977) ==== This important Supreme Court case decided that employers can fire workers who refuse to work on their religious day of rest, like the biblical Sabbath. ==== Dothard v. Rawlinson (1977) ==== ==== Christiansburg Garment Co. v. Equal Employment Opportunity Commission (1978) ==== ==== Meritor Savings Bank v. Vinson (1986) ==== This case Meritor Savings Bank v. Vinson, said that sexual harassment at work counts as discrimination based on sex. ==== Price Waterhouse v. Hopkins (1989) ==== The Court ruled that employers can’t discriminate against someone because they don’t act in ways expected by gender stereotypes under Title VII. Price Waterhouse v. Hopkins, . ==== Wards Cove Packing Co. v. Atonio (1989) ==== ==== United Automobile Workers v. Johnson Controls, Inc. (1991) ==== ==== Oncale v. Sundowner Offshore Services (1998) ==== Oncale v. Sundowner Offshore Services, Inc., The Court said that sexual harassment between people of the same sex is also illegal under Title VII. ==== Burlington Northern & Santa Fe Railway Co. v. White (2006) ==== On June 22, 2006, in Burlington Northern & Santa Fe Railway Co. v. White, the Supreme Court held that: * In this case, the Court decided that when a worker was moved to a worse job and suspended without pay after complaining about sexual harassment, it was illegal retaliation. * This was important because it explained that retaliation isn’t just about things happening at work or related to employment. * Title VII protects workers from punishment like being fired, losing pay, or getting worse job conditions for complaining about discrimination or helping with a discrimination claim. * Retaliation includes any bad job decision that might stop a reasonable worker from reporting discrimination or supporting someone who does. ==== Ledbetter v. Goodyear Tire & Rubber Co. (2007) ==== ==== Ricci v. DeStefano (2009) ==== ==== University of Texas Southwestern Medical Center v. Nassar (2013) ==== ==== Equal Employment Opportunity Commission v. Abercrombie & Fitch Stores (2015) ==== ==== Green v. Brennan (2016) ==== ==== Bostock v. Clayton County (2020) and Altitude Express, Inc. v. Zarda (2020) ==== * On June 15, 2020, the Supreme Court decided that Title VII’s rule against sex discrimination also protects LGBT people from job discrimination. * Justice Neil Gorsuch explained that if a company treats a gay or transgender person worse because of their sex, it’s illegal discrimination. * This means firing or treating LGBT workers unfairly is considered sex discrimination, which Title VII does not allow. * The Bostock case was combined with the Altitude Express, Inc. v. Zarda case. These two cases were combined because different courts had different opinions before the Supreme Court made this decision. ==== R.G. & G.R. Harris Funeral Homes Inc. v. Equal Employment Opportunity Commission (2020) ==== This R.G. & G.R. Harris Funeral Homes Inc. v. Equal Employment Opportunity Commission case decided that Title VII protects people based on their gender identity, including transgender people. ==== Groff v. DeJoy (2023) ==== == Influence == === Americans with Disabilities Act of 1990 === The Americans with Disabilities Act, passed in 1990, is often called the most important law since the Civil Rights Act of 1964. The ADA was based a lot on the structure and ideas of the Civil Rights Act.For example, Title I of the ADA, which stops discrimination in jobs against people with disabilities, is like Title VII of the Civil Rights Act, which stops job discrimination based on race, sex, and other things. Also, Title III of the ADA, which stops discrimination against people with disabilities in public places, is similar to Title II of the Civil Rights Act but covers more places. The ADA helped make sure people with disabilities are treated fairly, an idea that became stronger after the Civil Rights Act of 1964. ==Related pages== * Civil Rights Movement * Employment Non- Discrimination Act * Voting Rights Act of 1965 ==References== ==Bibliography== * Branch, Taylor (1998), Pillar of Fire: America in the King Years 1963–65, New York: Simon & Schuster. * Freeman, Jo. \"How 'Sex' Got Into Title VII: Persistent Opportunism as a Maker of Public Policy\" Law and Inequality: A Journal of Theory and Practice, Vol. 9, No. 2, March 1991, pp. 163–184. online version * * Harrison, Cynthia (1988), On Account of Sex: The Politics of Women's Issues 1945–1968, Berkeley, CA: University of California Press. * Jeong, Gyung-Ho, Gary J. Miller, and Itai Sened, \"Closing the Deal: Negotiating Civil Rights Legislation\", American Political Science Review, 103 (Nov. 2009) * Loevy, Robert D. ed. (1997), The Civil Rights Act of 1964: The Passage of the Law That Ended Racial Segregation, Albany, NY: State University of New York Press. * Risen, Clay. The Bill of the Century: The Epic Battle for the Civil Rights Act (2014) online ==Further reading== * Brauer, Carl M., \"Women Activists, Southern Conservatives, and the Prohibition of Sexual Discrimination in Title VII of the 1964 Civil Rights Act\", 49 Journal of Southern History, February 1983. * Burstein, Paul (1985), Discrimination, Jobs and Politics: The Struggle for Equal Employment Opportunity in the United States since the New Deal, Chicago: University of Chicago Press. * Finley, Keith M. (2008), Delaying the Dream: Southern Senators and the Fight Against Civil Rights, 1938–1965, Baton Rouge: LSU Press. * Graham, Hugh (1990), The Civil Rights Era: Origins and Development of National Policy, 1960–1972, New York: Oxford University Press. * Gregory, Raymond F. (2014). The Civil Rights Act and the Battle to End Workplace Discrimination. Lanham, MD: Rowman and Littlefield. * Loevy, Robert D. (1990), To End All Segregation: The Politics of the Passage of The Civil Rights Act of 1964, Lanham, MD: University Press of America. * Loevy, Robert D. \"The Presidency and Domestic Policy: The Civil Rights Act of 1964,\" in David C. Kozak and Kenneth N. Ciboski, ed., The American Presidency (Chicago: Nelson Hall, 1985), pp. 411–419. online version * Mann, Robert (1996). The Walls of Jericho: Lyndon Johnson, Hubert Humphrey, Richard Russell, and the Struggle for Civil Rights. * Pedriana, Nicholas, and Stryker, Robin. \"The Strength of a Weak Agency: Enforcement of Title VII of the 1964 Civil Rights Act and the Expansion of State Capacity, 1965–1971,\" American Journal of Sociology, Nov 2004, Vol. 110 Issue 3, pp 709–760 * * Rodriguez, Daniel B. and Weingast, Barry R. \"The Positive Political Theory of Legislative History: New Perspectives on the 1964 Civil Rights Act and Its Interpretation\", University of Pennsylvania Law Review, Vol. 151. (2003) online * Rothstein, Mark A., Andria S. Knapp & Lance Liebman (1987). Employment Law: Cases and Materials. Foundation Press. * Warren, Dan R. (2008), If It Takes All Summer: Martin Luther King, the KKK, and States' Rights in St. Augustine, 1964, Tuscaloosa, AL: University of Alabama Press. * Whalen, Charles and Whalen, Barbara (1985), The Longest Debate: A Legislative History of the 1964 Civil Rights Act, Cabin John, MD: Seven Locks Press. * Woods, Randall B. (2006), LBJ: Architect of American Ambition, New York: Free Press, ch 22. * Zimmer, Michael J., Charles A. Sullivan & Richard F. Richards, Cases and Materials on Employment Discrimination, Little, Brown and Company (1982). ==Other websites== * Civil Rights Act of 1964 as amended (PDF/details) in the GPO Statute Compilations collection * Civil Rights Act of 1964 as enacted (details) in the US Statutes at Large * Narrative: The Civil Rights Act of 1964 – Provided by The Dirksen Center * Civil Rights Act of 1964 – Provided by the Civil Rights Digital Library * 110 Congressional Record (Bound) – Volume 110, Part 2 (January 30, 1964 to February 10, 1964), Congressional Record House February 10 vote roll call pp. 2804–2805 * 110 Congressional Record (Bound) – Volume 110, Part 11 (June 17, 1964 to June 26, 1964), Congressional Record Senate June 19 vote roll call p. 14511 * 110 Congressional Record (Bound) – Volume 110, Part 12 (June 29, 1964 to July 21, 1964), Congressional Record House July 2 amendment vote roll call p. 15897 Category:1964 in the United States Category:United States federal legislation Category:1960s in law",
 "title": "Civil Rights Act of 1964"
}