{
 "id": "34029",
 "text": "Movie criticism is the evaluation of a movie. People who write their opinions about movies in newspapers and magazines or talk about movies on television, the Internet or on radio shows are called movie critics. Some movie critics also write books about movies and the history of movies. ==Training== Some movie critics studied movie or movie history in a university before becoming a movie critic. Other movie critics are people who have experience making movies, for example as a movie director or screenwriter. Some movie critics studied other subjects in university that are related to movie, such as English Literature or theatre. ==Related occupations== * Movie theorists study the way stories are told in movies, and examine how movie directors, screenwriters, and cinematographers use images and sounds on the movie screen. Movie theorists usually work in universities, in movie studies or media departments. Some movie theorists, such as Francois Truffaut are also involved in other movie-related jobs, such as being a movie critic and a director. * Movie historians study the history of different aspects of movie production and distribution. * Television critics write their opinions about television shows in newspapers and magazines or talk about television shows on television or on radio shows. Some television critics also write books about television and the history of television shows. Movie critics Roger Ebert and Gene Siskel once hosted a successful movie review show called At the Movies. * Television scholars study the impact of television shows on culture. ==Awards== Roger Ebert became the first movie critic to win a Pulitzer Prize. After his win, many other critics were awarded with this honor. ==Notable movie critics== * Roger Ebert * Gene Siskel * Gene Shalit * A. O. Scott * Kenneth Turan * Steven Rea * Anthony Lane * Peter Travers * David Denby * Rex Reed * Joe Morgenstern * Joe Siegel * Andrew Sarris * Vincent Canby * Michael Phillips * Jonathan Rosenbaum * Colin Covert * Leonard Maltin * Richard Roeper * Armond White Category:Movie occupations",
 "title": "Movie criticism"
}