{
 "id": "340317",
 "text": "UniverSud Paris is a grouping of higher education institutes in France.[ PRES ] It groups 21 public universities and the national research center. These places teach nearly all subjects of sciences (fundamental, engineering, business). ==History== In 1991, the French government decided to create the \"French Poles of Research and Higher Education\". In 2007, its status changed to a public establishment for scientific cooperation (établissement public de coopération scientifique). ==Colleges and institutes== The member universities and institutes are : * Paris Institute of Technology for Life, Food and Environmental Sciences (Agro ParisTech), founded in 2007, as a result of the merger of three agronomy, forestry and food science schools with roots dating back to 1824 * National Veterinary School of Alfort, founded in 1765 * National School of Landscape (ENSP), founded in 1965 * Institut National de la Recherche Agronomique (INRA), founded in 1946 * National Research Institute of Science and Technology for Environment and Agriculture (formerly Cemagref), founded in 1981 * French agency for Food, Environmental and Occupational Health Safety (ANSES), founded in 1999 * Telecom & Management SudParis, founded in 1979 * Genoscope (French National Sequencing Center), founded in 1996 * National School of Computer Science for Industry and Business (ENSIIE), founded in 1968 * HEC Paris, founded in 1881 * École Polytechnique (X), founded in 1794 * École supérieure d'optique (IOGS), founded in 1917 * École nationale supérieure d'architecture de Versailles, founded in 1969 * SOLEIL (French particle accelerator), founded in 2006 * Institut de recherche pour le développement (IRD), founded in 1943 * Paris-Sud 11 University, founded in 1971 * Université de Versailles Saint-Quentin-en-Yvelines, founded in 1991 * University of Évry Val d'Essonne, founded in 1991 * École Normale Supérieure de Cachan, founded in 1880 * École Centrale de Paris, founded in 1829 * École supérieure d'électricité (Supélec), founded in 1894 ==References== Category:Colleges and universities in France Category:1991 establishments in France Category:Île-de-France",
 "title": "UniverSud Paris"
}