{
 "id": "340387",
 "text": ":Carlton Gardens is also the name of a small street in London, England. The Carlton Gardens is a World Heritage Site in the suburb of Carlton. It is very close to the centre of Melbourne, Victoria, Australia. The site has the Royal Exhibition Building, Melbourne Museum and Imax Cinema, tennis courts and an award winning children's playground. The site is a rectangle shape. From the Exhibition building the gardens gently slope down to the southwest and northeast. The World Heritage listing says the Royal Exhibition Buildings and Carlton Gardens are \"of historical, architectural, aesthetic, social and scientific (botanical) significance to the State of Victoria.\" The gardens are one of the best examples of a Victorian era public garden. There are large grass areas with a mix of European and Australian trees. These include deciduous trees such as English oaks, White Poplar, Plane trees, Elms, Conifers, Cedars, Turkey Oaks, Araucarias and evergreens such as Moreton Bay Figs, combined with flower beds of flowers and shrubs. Tree lined paths make formal avenues which lead to the fountains and architecture of the Exhibition buildings. There are two small lakes in the southern section of the park. The northern section contains the Museum, tennis courts, machinery and work area, managers's house, and the children's playground designed as a Victorian maze. The listing in the Victorian Heritage Register says in part: :\"The Carlton Gardens are of scientific (botanical) significance for their outstanding collection of plants, including conifers, palms, evergreen and deciduous trees, many of which have grown to an outstanding size and form. The elm avenues of Ulmus procera and Ulmus × hollandica are significant as few examples remain world wide due to Dutch elm disease. The Garden contains a rare specimen of Acmena ingens, only five other specimens are known, an uncommon Harpephyllum caffrum and the largest recorded in Victoria, Taxodium distichum, and outstanding specimens of Chamaecyparis funebris and Ficus macrophylla, south west of the Royal Exhibition Building.\" Wildlife includes possums, ducks and ducklings in spring, Tawny Frogmouths, Kookaburras, flying foxes, and other urban environment birds and bats. The gardens have three important fountains: the Exhibition Fountain, designed for the 1880 Exhibition by sculptor Joseph Hochgurtel; the French Fountain; and the Westgarth Drinking Fountain. ==History== * 1839 - Large blocks of land around Melbourne were set aside by Superintendent Charles La Trobe. Most of this land was later sold and subdivided or used for public buildings. A large number of sites were kept as public parks, including the Carlton Gardens as well as Flagstaff Gardens, Fitzroy Gardens, Treasury Gardens and Kings Domain. * Circa 1856 - The City of Melbourne took over the Carlton Gardens, and paid Edward La Trobe Bateman to make plans for the site. The path layout and other features of the design were built. * 1870s - The Victorian Government took over the Gardens and small changes were made by Clement Hodgkinson. The site was completely changed for the 1880 Melbourne International Exhibition by the architect Joseph Reed. An important local gardener, William Sangster, was paid to plan and build new gardens. * 1880 - The Exhibition Building was completed for the Melbourne International Exhibition that year. Extra spaces built to house some of the exhibition in the northern section were removed after the exhibition closed on 30 April 1881. * 1888 - The Melbourne Centennial Exhibition celebrated 100 years of European settlement in Australia. * 1891 - The curator's (manager) house was completed and lived in by John Guilfoyle. * 1901 - First Parliament of Australia opened in the Exhibition Building. The west wing of the Building becomes the site of the Victorian Parliament for the next 27 years. * 1919 - The buildings became a hospital for influenza epidemic victims * 1928 - The fence was removed leaving the bluestone footings. * During the Second World War the buildings were used by the Royal Australian Air Force. * 1948 to 1961 - some of the buildings were used as a migrant processing centre. * 2001 - Taylor Cullity Lethlean and Mary Jeavons won an award for designing and building a new children's playground. * July 2004 - The Royal Exhibition Building and Carlton Gardens, Melbourne, were added to the World Heritage List at a meeting of the World Heritage Committee held in Suzhou, China. The Exhibition Building is still used for exhibitions, including for the annual Melbourne International Flower and Garden Show. It also used for exams by the University of Melbourne in recent years. The Melbourne Exhibition and Convention Centre, opened in 1996 at Southbank, provides more modern facilities and has become Melbourn'e main space for exhibitions and conventions. ==Related pages== * List of botanical gardens ==Other websites== * World heritage listing for Carlton Gardens * Melbourne City Council - Carlton Gardens * Open Space and Recreation - Merit Carlton Gardens Playground * World Heritage, World Futures — Restoration of the Western Forecourt of the Royal Exhibition Building, Melbourne Category:Buildings and structures in Melbourne Category:Botanical gardens Category:World Heritage Sites in Australia",
 "title": "Carlton Gardens, Melbourne"
}