{
 "id": "340427",
 "text": "The Old City (, al-Balda al-Qadimah, , Hin K'aghak, , Ha'Ir Ha'Atiqah) of Jerusalem is the oldest part of the city located in Palestine (a country that can be dated back to as far as 12th BCE). It is an area that is surrounded by walls. It contains some of the most important places for three major religions. These include the Church of the Holy Sepulchre for Christians, the Temple Mount for Jews, and the Dome of the Rock and al-Aqsa Mosque for Muslims. The Old City formed the whole city of Jerusalem until 1860, when a Jewish neighborhood was built outside the Western Wall. The Old City is historically divided into four quarters, although the current quarters were introduced only in the 19th century. Today, the Old City is divided into the Muslim Quarter, the Christian Quarter, the Jewish Quarter and the Armenian Quarter. After the war in 1948, the Old City was occupied by Jordan and the Jewish people living in the city were forced to move out. During the Six Day War in 1967, Israel occupied the Old City and the rest of East Jerusalem. Today, Israel still controls the whole area, which it says is part of its national capital. In 1980, Jordan asked UNESCO to make the Old City a World Heritage Site.Advisory Body Evaluation (PDF file) It was added to the World Heritage list in 1981.Report of the 1st Extraordinary Session of the World Heritage Committee Because of the conflict over the territory, it was added to the list of sites in danger in 1982.Justification for inscription on the List of World Heritage in Danger, 1982: Report of the 6th Session of the World Heritage Committee UNESCO policy is that East Jerusalem, including the Old City, is part of the occupied Palestinian territory.UNESCO replies to allegations Jerusalem-Altstadt-18-Goldenes Tor-2010-gje.jpg Jerusalem-Altstadt-42-von Dachterrasse-Minarett der Omarmoschee-Grabeskirche-2010-gje.jpg Jerusalem- Altstadt-20-vom Oelberg-Grabeskirche-2010-gje.jpg Jerusalem-Altstadt-34-vom Erloeserkirchturm-Passanten-2010-gje.jpg Jerusalem-Via Dolorosa-02-Schild-1985-gje.jpg Jerusalem-Via dolorosa-20-Brettspieler-2010-gje.jpg Jerusalem- Damaskustor-22-Haendler-2010-gje.jpg Jerusalem-Mauerrundgang-26-2010-gje.jpg ==References== ==Other websites== * *Virtual tour of the Old City's historic sites *Virtual tour of the Muslim Quarter *Virtual tour of the Church of the Holy Sepulchre Category:Neighbourhoods of Jerusalem Category:World Heritage Sites in Asia Category:Jewish history Category:History of Islam Category:History of Palestine",
 "title": "Old City (Jerusalem)"
}