{
 "id": "340404",
 "text": "A total of 20 places in Australia have been chosen as World Heritage Sites by UNESCO,UNESCO, \"Australia\"; retrieved 2012-4-20. the United Nations Educational, Scientific and Cultural Organization. Australia agreed to take part in the World Heritage Convention on 22 August 1974.UNESCO, \"States Parties: Ratification Status\"; retrieved 2012-4-20. ==List== The World Heritage Site (WHS)WHS is an acronym. WHS stands for \"World Heritage Site\". list has developed over time. It is part of a process; and the list continues to grow. As of 2020, there are 20 WHS places in Australia. * 4 cultural sites * 12 natural sites * 4 mixed sites There are 2 sites which are on a tentative list. ===Table=== Site Image Location Criteria Area ha (acre) Year Description Australian Fossil Mammal Sites Queensland and South Australia Natural: (viii), (ix) 1992 Riversleigh and Naracoorte were chosen for having many fossils of many different species of extinct animals. They are listed among the ten richest fossil deposits in the world. The fossils from both sites show separate, important stages in the evolution of mammals on the Australian continent. Riversleigh has some of the earliest mammalian fossils from the middle Cenozoic. The deposit at Naracoorte is Australia's largest. The fossils there are from the more recent Pleistocene time, when humans first came to Australia. It contains some of the best examples of megafauna. Australian Convict Sites New South Wales, Norfolk Island, Tasmania and Western Australia Cultural: (iv), (vi) 2010 There are over 3000 sites remaining in Australia that were used as places for British convicts to be kept. They were built by the British Fleets in the early colonial period of Australia's history. Eleven of these sites were chosen as the best examples in the country. Budj Bim Cultural Landscape Victoria Cultural: (iii), (v) 2019 One of the World's oldest aquaculture systems. It was built by the Gunditjmara people to catch fish. Used over at least 6,600 years. K'gari Island Queensland Natural: (vii), (viii), (ix) 1992 K'gari Island (Formerly named Fraser Island) is the world's largest sand island. It is made up of sand that has accumulated over about 750,000 years. It has over 100 freshwater lakes, and dunes reaching up to above sea level. Mycorrhizal fungi lives in the sand. Because of this, it the only place in the world where tall rainforest grows on sand. Gondwana Rainforests of Australia Queensland and New South Wales Natural: (viii), (ix), (x) 1986 This site was chosen for being important to geology and conservation. It includes a large number of protected areas. It is the largest area of subtropical rainforest in the world. It is home to more than 200 rare or threatened plant and animal species. Great Barrier Reef (GBR) Queensland Natural: (vii), (viii), (ix), (x) 1981 The world's largest coral reef system. It is made up of over 2,900 individual reefs. It hosts a very high level of biodiversity and is considered likely to be the richest area in the world in terms of animal diversity. It is home to about 400 types of coral, and forms a critical habitat for many endangered species. Greater Blue Mountains Area New South Wales Natural: (ix), (x) 2000 An area of sandstone tablelands and gorges, and eucalypt forest. The area was chosen because it contains many of the different species of eucalyptus in Australia. It is made up of eight protected areas that are very important habitats for many endangered species. Heard and McDonald Islands Heard and McDonald Islands Natural: (viii), (ix) 1997 These two islands are the only two active volcanoes in the subantarctic. They were chosen for their value to research in glaciology and geomorphology. Most of Heard Island is covered by glaciers. The islands are very isolated. Humans have not had much impact on the ecosystem, and there are no introduced species. Kakadu National Park Northern Territory Mixed: (i), (vi), (vii), (ix), (x) 1981 Kakadu's wetlands, which cover over one third of the park, are considered very important. Several archaeological sites show evidence of people living in the area for more than 40,000 years. There are pictographs that are recognised as important examples of ancient Aboriginal rock art, dating from over 18,000 years ago. Lord Howe Island Group New South Wales Natural: (vii), (x) 1982 This island is the remains of a seven million-year-old shield volcano that has eroded away. It is what is left from eruptions that lasted for about 500,000 years. It is home to many endemic species, important breeding colonies of seabirds, and the world's southernmost coral reef. Macquarie Island Tasmania Natural: (vii), (viii) 1997 This island is the only place on earth where the mantle is exposed above sea level. It is a part of the Macquarie Ridge. It contains evidence of seafloor spreading. It was chosen for its unique value to geology. Ningaloo Reef Western Australia Natural: (vii), (x) 2011 This coral reef was chosen for its marine biodiversity. It includes over 700 species of fish and is home to many endangered sea turtles. Whale sharks come here to spawn in the largest known gathering of that species. The reef is also part of the annual migration routes of dolphins, dugongs, manta rays and humpback whales. Purnululu National Park Western Australia Natural: (vii), (viii) 2003 The Bungle Bungle Range is a Devonian plateau that has been heavily eroded into an unusual landscape of conical sandstone towers. It is one of the largest network of sandstone karst formations in the world. Parts of the park are sacred to the native Kija people. Royal Exhibition Building and Carlton Gardens Victoria Cultural: (ii) 2004 This site is in the suburb of Carlton, very close to the centre of Melbourne. The exhibition building was built to host the World's Fair in 1880. It is one of the world's last exhibition buildings from the 19th century. It combines several architectural styles. The gardens next to it are an example of Victorian era landscape design. They contain many of the plant species native to Victoria. Shark Bay Western Australia Natural: (vii), (viii), (ix), (x) 1991 Shark Bay has the largest and richest area of seagrass meadows in the world. These meadows are a very important habitat for endangered dugongs. The bay is home to about 12% of the world's population. Hamelin Pool contains the world's most diverse and abundant colony of living stromatolites, which are some of the earliest examples of life on earth. Sydney Opera House New South Wales Cultural: (i) 2007 This performing arts complex is famous for its architecture. It was opened in 1973, and is a landmark of Sydney Harbour. The design is an example of the expressionist style and has had a lasting influence on architecture. Tasmanian Wilderness Tasmania Mixed: (iii), (iv), (vi), (vii), (viii), (ix), (x) 1982 This area covering almost 20% of Tasmania. It is one of the world's last temperate wildernesses. It is very remote and difficult to access. Most of it is covered by the South West Wilderness area. Archaeologists have found evidence that aboriginal people lived in the area from at least 20,000 years ago. Uluṟu-Kata Tjuṯa National Park Northern Territory Mixed: (v), (vi), (vii), (viii) 1987 This park was chosen as an example of a landscape that is culturally sacred to Aboriginal people. The park's two massive sandstone formations, Uluṟu and Kata Tjuṯa, are spiritually important to many Aṉangu. They form part of the local tjukurpa belief system. Cave paintings found at Uluṟu date back tens of thousands of years. Wet Tropics of Queensland Queensland Natural: (vii), (viii), (ix), (x) 1988 An area of tropical rainforest spread along the Great Dividing Range. The area has a high level of biodiversity. At least 85 species live here that are not found anywhere else. It also has the highest concentration of primitive taxa in the world. It is an important area for unique and endangered marsupials. Willandra Lakes Region New South Wales Mixed: (iii), (viii) 1981 This place contains fossilised remains of sand formations. It includes good archaeological evidence of humans from 45–60,000 years ago. This includes the world's oldest cremation site, the Lake Mungo remains. === Tentative list=== The tentative list consists of sites which have been nominated. The evaluation process is not yet completed. * Great Sandy World Heritage AreaUNESCO, \"Great Sandy World Heritage Area\"; retrieved 2012-4-19. * Gondwana Rainforests (extension to existing property)UNESCO, \"The Gondwana Rainforests of Australia World Heritage Area (extension to existing property)\"; retrieved 2012-4-20. * Murujuga Cultural LandscapeUNESCO, \"Murujuga Cultural Landscape\"; retrieved 2020-8-14. * Flinders Ranges == Notes == == References == ==Other websites== * UNESCO, World Heritage Sites * List of biosphere reserves which are wholly or partially world heritage sites * Category:Australian culture Australia Category:Australia-related lists",
 "title": "List of World Heritage Sites in Australia"
}