{
 "id": "340405",
 "text": "The Dark Knight Rises is a 2012 British-American superhero movie, and a sequel to The Dark Knight and a second sequel to Batman Begins. It was the last movie in The Dark Knight Trilogy. ==Plot== Eight years after Harvey Dent's death and the defeat of the Joker, the Dent Act grants the Gotham City Police Department the ability to easily prosecute organized crime. Feeling guilty for covering up Dent's crimes, Police Commissioner James Gordon writes a resignation speech telling the truth, but decides not to reveal the truth because it was not the right time. Batman has disappeared, with Bruce Wayne becoming an outcast. Cat burglar Selina Kyle steals Bruce's fingerprints from his home, kidnaps a congressman, then disappears. Selina hands Bruce's fingerprints to Phillip Stryver, an assistant to Bruce's business rival John Daggett, in hope of having her criminal record erased. Stryver double crosses Selina, but she uses the congressman's stolen phone to alert the police of their location. Gordon and the police arrive to find the congressman, then chase the criminals into the sewers while Selina escapes. A masked man called Bane who had escaped from a hijacked CIA Plane captures Gordon. Gordon escapes, and is found by John Blake, a patrol officer who grew up as an orphan and has known Batman's true identity from their similar backgrounds. Gordon promotes Blake to detective, with Blake reporting directly to him. Wayne Enterprises is on the point of becoming bankrupt after Bruce wasted almost all of the companies money on a fusion reactor project when he learns that the core could be weaponized. Later, Bane attacks the Gotham Stock Exchange, using Bruce's fingerprints to bankrupt Wayne Enterprises. Alfred Pennyworth, concerned that Bruce has not moved on from being Batman, reveals to him that Rachel Dawes had intended to marry Dent before she died, and resigns in an attempt to dissuade him. Fearing that Daggett, Bane's employer, would gain access to the reactor, Bruce and Lucius Fox asks board member Miranda Tate to take over his company. Bane later kills Daggett. After being promised to erase her records, Selina agrees to take Batman to Bane, but instead betrays him to a trap. Bane appears and reveals that he intends to fulfill Ra's al Ghul's mission to destroy Gotham with the League of Shadows. He breaks Batman's back and takes him to a foreign, well-like prison where escape is impossible. The inmates tell Bruce the story of Ra's al Ghul's child, born in the prison and cared for by a fellow prisoner before escaping, the only prisoner to have ever done so; Bruce thinks the child is Bane. Meanwhile, Bane had kidnapped Fox, Tate, and Fredricks in order to turn on the bomb. While in the stadium, Bane triggers bombs under Gotham that causes the tunnels to collapse and traps most of the Gotham's police underground. He kills Mayor Anthony Garcia and forces an abducted physicist, Dr. Leonid Pavel, to convert the reactor core into a nuclear bomb before killing him. Bane uses the bomb to hold the city hostage and isolate Gotham from the world. Using Gordon's stolen speech, Bane reveals the cover-up of Dent's crimes and releases the prisoners of Blackgate Prison, causing a revolution. The wealthy and powerful have their property destroyed or taken, are dragged from their homes, and given show trials presided over by Dr. Jonathan Crane, where any sentence likely means death. After months of recovery and re-training, Bruce escapes from the prison; thanks to the prison doctor, and enlists Selina, Blake, Tate, Gordon, and Fox to help stop the bomb's detonation. While the police and Bane's forces fight at Gotham City Hall, Batman defeats Bane, but Tate later stabs Batman, revealing herself to be Talia, Ra's al Ghul's child, who escaped the prison thanks to her fellow prisoner, Bane. She plans to complete her father's work by activating the bomb and destroying Gotham, but Gordon blocks her signal, which makes the remote of detonation useless. Talia, then leaves to find the bomb. Bane prepares to kill Batman, but Selina kills Bane using the Batpod. Batman pursues Talia with the Bat, an aircraft created by Fox, to bring the bomb back to the reactor, where it can be stabilized. Talia's truck crashes, but she remotely destroys the reactor before dying. With no way to stop the detonation, Batman uses The Bat to haul the bomb over the bay, where it detonates. In the months after, Batman is thought to be dead but is honored a hero. With Bruce also presumed dead, Wayne Manor is left to the city to become an orphanage, and Wayne's remaining estate is left to Alfred. Fox discovers that Bruce had fixed The Bat's autopilot, and Gordon finds the Bat-Signal refixed. While visiting in Florence, Italy, Alfred saw Bruce and Selina together. Blake resigns from the police force and finds the Batcave. ==Background== The movie is based on DC Comics character Batman. It is distributed under Warner Bros.. The movie was directed by Christopher Nolan and produced by Emma Thomas. The music was scored by Hans Zimmer. The cast includes Christian Bale, Michael Caine, Gary Oldman, Joseph Gordon-Levitt, Tom Hardy, Morgan Freeman, Anne Hathaway, Marion Cotillard, Matthew Modine, Cillian Murphy, Nestor Carbonell, Ben Mendelsohn, Liam Neeson, Tom Conti, Joey King, Juno Temple, and Alon Abutbul. The locations of filming were in Pittsburgh, Pennsylvania, Newark, New Jersey, Los Angeles, California, and in New York City, New York. ==Cast and characters== * Christian Bale as Batman/Bruce Wayne, finally emerges after eight years from the events of The Dark Knight. He returns in order to save Gotham from Bane. * Michael Caine as Alfred Pennyworth, Bruce Wayne's loyal butler who had enough of Bruce being an outcast from Gotham. * Gary Oldman as Commissioner James Gordon, the police commissioner of Gotham who knows the truth about Harvey Dent, but does not want to tell the city. * Anne Hathaway as Catwoman/Selina Kyle, a new female character who helps Batman save the city and helped Batman into finding Bane. * Tom Hardy as Bane, the main villain who breaks Batmans back and occupies Gotham, seeking to complete the mission to destroy the city. He was trained by Ra's al Ghul just like Batman was in Batman Begins. He was killed when Selina Kyle shot him with the Batpod. * Marion Cotillard as Miranda Tate/Talia al Ghul, a new Wayne Enterprises boardmember and later takes control of the company. She was thought to be someone who wanted to clean the world, but turned out to be an enemy of Batman. She was the daughter of Ra's al Ghul. She was killed while her truck crashed and fell into an inner tunnel. * Joseph Gordon-Levitt as Officer Robin John Blake, a new Gotham City cop who helps both Batman and Commissioner Gordon to save Gotham. At the end he found the Batcave and might become Robin. * Morgan Freeman as Lucius Fox, the CEO of Wayne Enterprises and the one who gave Bruce Wayne all of the new gadgets and information. * Matthew Modine as Officer Peter Foley, the new detective under James Gordon's commission. He was killed during the final battle. * Cillian Murphy as Scarecrow, was the judge of the corrupt courtroom whom he sentenced all of Gotham's rich people. * Nestor Carbonell as Mayor Anthony Garcia, was the mayor of Gotham before being killed in a mass explosion in the Gotham Stadium. * Ben Mendelsohn as John Daggett, the founder of Daggett Industries who wants to take control of Wayne Enterprises, but was later killed by Bane. * Liam Neeson as Ra's al Ghul, appeared as a spirit when Bruce Wayne was trapped under the pit. * Tom Conti as Prisoner, a prison doctor who helps Bruce heal after Bane had broken his back. * Joey King as Young Talia al Ghul, the younger version of the daughter of Ra's al Ghul as she appeared in flashbacks. * Alon Abutbul as Dr. Leonid Pavel, a Russian nuclear scientist who helped Bane create a nuclear bomb to destroy Gotham, he was later killed by Bane. * Juno Temple as Jen, Selina Kyle's best friend. * William Devane as the President of the United States. * John Nolan as Fredricks, a boardmember of Wayne Enterprises. * Patrick Leahy as Boardmember, a boardmember of Wayne Enterprises. * Burn Gorman as Phillip Stryver, the vice-chairman of Daggett Industries who was later exiled from Gotham and later fell through the ice. * Chris Ellis as Priest, a priest who takes care of orphaned children from where John Blake came from. * Aidan Gillen as CIA Agent, the CIA agent who was about to transport Bane, until the plane was hijacked and was killed during the attack. * Josh Stewart as Barsad, Bane's right-hand man who helps Bane take control of Gotham, he was killed during the final battle. * Wade Williams as the Warden at Blackgate Prison. ==International release== Country Premiere 19 July 2012 19 July 2012 19 July 2012 19 July 2012 19 July 2012 19 July 2012 19 July 2012 19 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 20 July 2012 25 July 2012 25 July 2012 (French speaking region) 25 July 2012 25 July 2012 25 July 2012 25 July 2012 25 July 2012 25 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 (German speaking region) 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 26 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 27 July 2012 2 August 2012 10 August 2012 15 August 2012 16 August 2012 16 August 2012 17 August 2012 18 August 2012 18 August 2012 20 August 2012 21 August 2012 27 August 2012 29 August 2012 (Italian speaking region) 29 August 2012 ==Release== The Dark Knight Rises was released on July 20, 2012, on which same day a shooting happened in Aurora, Colorado during the movie's premiere inside an area theater. The movie is the 3rd highest-grossing movie in the world with $1,081,041,287 worldwide. The Dark Knight Rises currently ranks #7 in the list of the highest-grossing movies in history. The Dark Knight Rises came out on DVD and Blu-ray on December 4, 2012. It was one of the top movies on AFI in 2012. Regarded as one of the best superhero films and best films of 2010s ===Taglines=== * \"Rise\" * \"A Fire Will Rise\" * \"The Legend Ends\" * \"Every Hero Has a Journey. Every Journey Has an End\" * \"The Epic Conclusion to the Dark Knight Legend\" ==Awards== List of awards and nominations Award Category Recipients and nominees Result AFI Awards 2012 Movies of the Year Emma Thomas, Christopher Nolan and Charles Roven British Academy of Film and Television Arts Special Visual Effects Paul Franklin, Chris Corbould, Peter Bebb, Andrew Lockley Broadcast Film Critics Association Best Visual Effects Best Action Film Best Actor in an Action Movie Christian Bale Best Actress in an Action Movie Anne Hathaway Golden Trailer Awards Best in Show \"Chant\" Summer 2012 Blockbuster Trailer \"Chant\" Best International Poster \"UK Quad\" Best Summer 2012 Blockbuster Poster \"Teaser One Sheet – City\" Best Teaser Poster \"Teaser One Sheet City\" Grammy Awards Best Score Soundtrack For Visual Media Kids Choice Awards Favorite Female Buttkicker Anne Hathaway Los Angeles Film Critics Association Best Supporting Actress Anne Hathaway MTV Movie Awards Best Movie MTV Movie Awards Best Hero Christian Bale MTV Movie Awards Best Hero Anne Hathaway MTV Movie Awards Best Villain Marion Cotillard MTV Movie Awards Best Villain Tom Hardy MTV Movie Awards Best Fight Christian Bale & Tom Hardy MTV Movie Awards Best Shirtless Performance Christian Bale People's Choice Awards Favorite Face of Heroism Anne Hathaway Favorite Movie Favorite Action Movie Favorite Movie Franchise Phoenix Film Critics Society Best Film Editing Satellite Awards Best Visual Effects Chris Corbould, Paul Franklin Best Art Direction & Production Design Nathan Crowley, Kevin Kavanaugh, James Hambidge, Naaman Marshall Saturn Awards Best Action of Adventure Film Saturn Awards Best Director Christopher Nolan Saturn Awards Best Actor Christian Bale Saturn Awards Best Supporting Actor Joseph Gordon-Levitt Saturn Awards Best Supporting Actress Anne Hathaway Saturn Awards Best Music Hans Zimmer Screen Actors Guild Awards Outstanding Performance by a Stunt Ensemble in a Motion Picture St. Louis Gateway Film Critics Association Best Music Teen Choice AwardsFirst Wave of Teen Choice Nominations Announced | American Idol, Dancing with the Stars, Glee, Nashville, The Voice, X Factor | mjsbigblogThe Second Wave of Nominees Heats Up \"Teen Choice 2013\" Airing Sunday, August 11, Live on FOX Choice Movie: Action Teen Choice AwardsFirst Wave of Teen Choice Nominations Announced | American Idol, Dancing with the Stars, Glee, Nashville, The Voice, X Factor | mjsbigblogThe Second Wave of Nominees Heats Up \"Teen Choice 2013\" Airing Sunday, August 11, Live on FOX Choice Movie: Actor Action Christian Bale Teen Choice AwardsFirst Wave of Teen Choice Nominations Announced | American Idol, Dancing with the Stars, Glee, Nashville, The Voice, X Factor | mjsbigblogThe Second Wave of Nominees Heats Up \"Teen Choice 2013\" Airing Sunday, August 11, Live on FOX Choice Movie: Actress Action Anne Hathaway Teen Choice AwardsFirst Wave of Teen Choice Nominations Announced | American Idol, Dancing with the Stars, Glee, Nashville, The Voice, X Factor | mjsbigblogThe Second Wave of Nominees Heats Up \"Teen Choice 2013\" Airing Sunday, August 11, Live on FOX Choice Movie: Scene Stealer Joseph Gordon-Levitt Teen Choice AwardsFirst Wave of Teen Choice Nominations Announced | American Idol, Dancing with the Stars, Glee, Nashville, The Voice, X Factor | mjsbigblogThe Second Wave of Nominees Heats Up \"Teen Choice 2013\" Airing Sunday, August 11, Live on FOX Choice Movie: Best Villain Tom Hardy Young Artist Award Best Performance in a Feature Film - Supporting Young Actress Joey King ==References== ==Other websites== * * * Category:2012 thriller movies Category:2010s superhero movies Category:American thriller movies Category:British thriller movies Category:Batman movies Category:English-language movies Category:Movies based on comic book characters Category:Movies composed by Hans Zimmer Category:Movies directed by Christopher Nolan Category:IMAX movies Category:The Dark Knight Trilogy Category:Warner Bros. movies",
 "title": "The Dark Knight Rises"
}