{
 "id": "340623",
 "text": "is the UNESCO World Heritage Site in Nikkō in Tochigi Prefecture, Japan.UNESCO, \"Shrines and Temples of Nikkō\"; retrieved 2012-4-22. The site covers 103 buildings or structures and the natural area around them. Two Shinto shrines and one Buddhist temple are included in the site. ==History== The area of Nikko has been a Shinto forest since pre-historic times. It has had Buddhist temples since the 9th century. Thousands of Japanese cedars were planted in the early 17th century International Council on Monuments and Sites (ICOMOS), \"Advisory Body Evaluation\"; September 1999; retrieved 2012-4-23. The shrines and temples of Nikkō are closely related to the history of the Tokugawa Shoguns. In 1871, the Shinto areas and Buddhist areas were separated. Three sites were identified -- two Shinto shrine complexes and one Buddhist temple complex. After the \"Law on the Preservation of Shrines and Temples\" in 1897, Nikkō was protected by the Japanese government. Nikkō's shrines and temples were named a World Heritage Site in 1999. * At the , 23 structures are included in the World Heritage site. All are registered \"Important Cultural Properties\". * At the , many buildings are named as part of the World Heritage site. Some are registered \"National Treasures of Japan\" and 37 are \"Important Cultural Properties\" * At the , many buildings were mentioned in the World Heritage Site nomination process. There are 37 \"Important Cultural Properties\". One sub-temple complex made up of the Honden and Haiden of the Taiyuin Mausoleum is a registered \"National Treasure of Japan\". In 2012, the World Heritage Site covers nine National Treasures of Japan and many \"Important Cultural Properties\".City of Nikko, \"Summary of \"shrines and temples of Nikko\"; retrieved 2012-4-23. ==Gallery== Many gates and buildings at Nikkō have very detailed carvings. The use of color is based on records dating back to 1753. The very precise descriptions of the architectural structures and the decorative works are used by experts who want to preserve history at Nikkō. Image:NikkoShinkyo5593.jpg|Arched Bridge Image:Nikko_Toshogu_Outer_Torii_M3032.jpg|Tōshō-gū Outer Torii Image:20100727 Nikko Tosho-gu Three wise monkeys 5965.jpg|Three Monkeys Carving Image:Nikko_Toshogu_Shimojinko_M8479.jpg|Tōshō-gū Shimojinko Image:Nikko1.jpg|Tōshō-gū Kyozo Image:Nikko Toshogu Yomeimon M3249.jpg|View of Yomeimon Image:YomeimonCarvings.jpg|Brightly painted carvings at Yomeimon Image:NikkoKaramonCarvings5205.jpg|Close-up of carvings above Karamon Gate Image:SleepingCatNikko.jpg|Sleeping Cat ==Related pages== * List of World Heritage Sites in Japan ==References== == Other websites == Category:World Heritage Sites in Japan Category:Shinto shrines in Tochigi Prefecture Category:Buddhist temples in Japan",
 "title": "Shrines and Temples of Nikkō"
}