{
 "id": "340693",
 "text": "Rheumatoid arthritis (RA) is a serious, painful, and long lasting (chronic) disease. It causes pain, swelling and stiffness in the joints. RA was first recognized around 1800 by Dr. Augustin Jacob Landré-Beauvais.Landré-Beauvais AJ (1800). La goutte asthénique primitive (doctoral thesis). Paris. reproduced in Landré-Beauvais AJ (2001). \"The first description of rheumatoid arthritis. Unabridged text of the doctoral dissertation presented in 1800\". Joint Bone spine 68 (2): 130–43. doi:10.1016/S1297-319X(00)00247-5. PMID 11324929. The condition usually affects the hands, feet and wrists. It is an autoimmune disease. This means the immune system (which usually fights infection) attacks the cells that line the joints by mistake, making the joints swollen, stiff and painful. Women are two to three times as likely as men to get rheumatoid arthritis. Most cases of RA occur in people between the ages of 25 and 55,Lovell, Daniel J. \"Arthritis.\" World Book Advanced. World Book, 2016. Web. 22 Feb. 2016NWHRC Health Center - Rheumatoid Arthritis. June 18, 2008 pNA. with 55% being over 55. RA causing the immune system to attack the joints and the tissues around the joints in the body causes signs and symptoms. It causes different problems, like: * The capsules around the joints get swollen * The body makes too much synovial fluid (the special fluid that is supposed to cushion the joints) * Tough fibrous tissue builds up in the synovium area (which is supposed to help cushion the joints) The condition may have a big impact on life in an affected person, leading to loss of independence or their ability to do the things they enjoy. It often causes malaise and can cause mental problems like depression. These are usually treatable but can go overlooked. ==Causes== Over time, RA can damage the joints, cartilage and nearby bone. Normally, articular (having to do with the joints) cartilage covers the end of bones where they come together to form joints. This keeps the bones from rubbing against each other. If the articular cartilage has been destroyed by RA, there is nothing to stop them rubbing against each other, which is very painful. Some theories are that it has to do with hormones, environment, infectionGeorge Hajishengallis. Periodontitis: from microbial immune subversion to systemic inflammation and genes. But it is not clear what triggers this problem with the immune system. Still the risk is higher in: * women * family history of rheumatoid arthritis * smokers ==Symptoms== There may be periods where symptoms become worse, known as flare-ups or flares. The symptoms vary from person to person. They may come and go, or change over time. Symptoms may include: *swelling, stiffness, and pain around affected joints *tenderness *fever *a feeling of discomfort *tiredness *weight loss and lack of appetite Some people with RA also experience problems in other parts of the body. Rheumatoid arthritis mainly affects the joints, causing problems in any joint in the body, but mainly in small joints in the hands and feet. Often these small joints are the first to be affected. It normally affects the joints symmetrically (both sides of the body at the same time and to the same extent), but this is not always the case. RA may also cause: pain, aches or throbbing, stiffness, swelling, warmth and redness. Also, there may also be high temperature (fever), sweating, dry eyes, and chest pain if the heart and lungs are affected and also lead to nervous system problems. Often, people with RA also develop anemia, a different disease that causes a person to have not enough blood cells in the blood. Less often, a person with RA could have: *inflamed blood vessels *neck pain ==Treatment== There's no cure for rheumatoid arthritis, but early diagnosis and appropriate treatment enables many people with the condition to have periods of months or even years between flares. This can help them to lead full lives and continue regular employment. Treatment can help reduce inflammation in the joints, relieve pain, prevent or slow down joint damage, reduce disability. Some people find that special diets, alternative medicines and supplements help with their RA. The main treatment options include: * medicine. These are often divided into main 2 types: disease-modifying anti-rheumatic drugs (DMARDs) and biological treatments. * painkillers * supportive treatment, like physiotherapy, occupational therapy, podiatry * surgery to correct any joint problems that develop * self care Some medicines, such as methotrexate, leflunomide and biological treatments should not be taken by men or women trying for a baby. Treatment usually involves many different health workers. === DMARDs (Disease- modifying anti-rheumatic drugs)=== DMARD tablets are usually offered after diagnosis as part of the initial treatment. These medicines ease the symptoms of the condition and slow down its progression. DMARDs work by blocking the effects of the chemicals released when the immune system attacks joints, which could otherwise cause further damage to nearby bones, tendons, ligaments and cartilage. Names or examples: * methotrexate (usually the first medicine given for rheumatoid arthritis, often with another DMARD and a short course of steroids (corticosteroids) to relieve any pain) * leflunomide * hydroxychloroquine * sulfasalazine === Painkillers (medicines to relieve pain)=== Painkillers (NSAIDs) such as paracetamol or a combination of paracetamol and codeine (co-codamol), may be used in some cases, to relieve the pain associated with rheumatoid arthritis. These medicines do not treat the inflammation in joints, but they may be helpful in relieving pain in some people. Other painkillers (analgesics) like morphine (33g dose equivalent) and oxycontin (a brand name) are sometimes given. Medicines used to relieve pain in RA: * NSAIDs This may be a traditional NSAID, such as ibuprofen (or others like naproxen or diclofenac). The doctor may prescribe a type called a COX-2 inhibitor, such as celecoxib or etoricoxib. Aspirin is a selective COX-1 and COX-2 inhibitor. Although uncommon, taking NSAIDs can increase the risk of serious stomach problems, such as internal bleeding. This is because the medicines can break down the lining that protects the stomach against damage from stomach acids. In these cases (and most of the time in men over the age of 45 in the UK) of an increased risk of bleeding a proton pump inhibitor (PPI) is prescribed alongside the NSAID. Another type of medicine used is steroids. * Steroids Steroids are powerful medicines that can help reduce pain, stiffness and inflammation. They can be given as a tablet or an injection directly into a painful joint (intra-articularly), or an injection into a muscle (intramuscularly or IM) (to help lots of joints). They are usually used to provide short-term pain relief while waiting for other treatment. Steroids are usually only taken for a short time because long-term use can have serious side effects. === Biological treatments=== Biological treatments, such as adalimumab, etanercept and infliximab, are a newer form of treatment for rheumatoid arthritis. Biological medicines are given by injection. They work by stopping particular chemicals in your blood from activating your immune system to attack your joints. They are usually taken in combination with methotrexate or another DMARD, and are usually only used if DMARDs have not been effective on their own. Side effects from biological treatments are usually mild but include: * skin reactions at the site of the injections (pain, temperature, color) * infections * feeling sick * a high temperature * headaches Some people may also be at risk of getting more serious problems, including the reactivation of infections such as tuberculosis (TB) if they have had them in the past. ===JAK inhibitors === JAK inhibitors are a new type of medicine (available on the NHS) for adults with moderate to severe rheumatoid arthritis. They are offered to people who cannot take DMARDs or biological, or tried them but found they were not effective. This medicine is usually used in combination with methotrexate. JAK inhibitors can also be taken on their own by adults who cannot take methotrexate. === Surgery=== Sometimes, despite taking medicines, the joints may still become damaged. If this happens, there may be a need for surgery to help restore ability in the joint. Surgery may also be recommended to reduce pain or fix deformities. Surgeries include: * finger, hand, and wrist surgery * arthroscopy * joint replacement ==Diagnosis == Rheumatoid arthritis can be difficult to diagnose because many conditions cause joint stiffness and inflammation and there's no definitive test for the condition. A physical examination is usually best, and asking the patient questions. Tests for RA include: * rheumatoid factor and anti-CCP antibodies. More than half of all people with rheumatoid arthritis have high levels of rheumatoid factors in their blood when the disease starts, but about 1 in 20 people without rheumatoid arthritis also test positive. * assessment of physical ability * joint scans (X-ray, MRI) * blood tests No blood or antibodies test can definitively prove or rule out a diagnosis of rheumatoid arthritis, but several tests can show indications of the condition. The full blood count test can also be used to check for anaemia. Some of the main blood tests used include erythrocyte sedimentation rate (ESR) test, C-reactive protein (CRP) and full blood count (FBC). ==X-ray== ==Related pages== * Arthritis (and arthritide) * Joints, muscle, artery * Carpal tunnel syndrome * Mobility aid ==Help and support and further information== Healthtalk: rheumatoid arthritis Versus Arthritis: exercise and pain management National Rheumatoid Arthritis Society: living with rheumatoid arthritis ==References== Category:Inflammation Category:Diseases and disorders of joints Category:Rheumatology",
 "title": "Rheumatoid arthritis"
}