{
 "id": "340606",
 "text": "The French colonial empire (French: Empire colonial français) was land that was controlled by France from the 16th century to the late 1960s. In the 17th and the 18th centuries, France gained and then lost large territories in North America and India. Like other empires of the time, it was powered by slaves, most of whom had been captured in Africa. The Haitian Revolution, when many of those slaves in the colony of Saint-Domingue (now Haiti and the Dominican Republic) fought and defeated the French, caused major changes in the empire. Some historians believe in a first and a second French colonial empire. The \"First French Colonial Empire\" began with the French colonization of the Americas and ended in the Napoleonic Wars. The \"Second French Colonial Empire\" was mostly the French colonies in Africa. Lasting from the 16th to the 17th centuries, the First French Colonial Empire had a total area of over 10,000,000 square kilometres (3,900,000 sq mi) at its peak, in 1680. At the time, it was the second-largest empire in the world, behind the Spanish Empire. In terms of land area, the Second French Colonial Empire extended to over 13,500,000 square kilometres (5,200,000 sq mi) at its peak in 1936. It was also the second largest in the world at the time, at 10% of the world's land area, behind the British Empire. The total land area of both French colonial empire combined reached 24,000,000 square kilometres (9,300,000 sq mi). France began to establish colonies in North America, the Caribbean and India in the 17th century but lost most of them after it lost the Seven Years' War. The North American colonies were lost to Britain and Spain. Spain returned Louisiana, which had been part of New France, in 1800. However, France sold it to the United States in 1803. France rebuilt a new empire mostly after 1850, mostly in Africa but also in Indochina and in the South Pacific. It started to trade with the regions by supplying raw materials and purchasing manufactured items. Rebuilding an empire improved the reputation of France as an international power by spreading its French language and the Catholic religion. It also provided more men to fight for France in the world wars. A major goal was the \"Civilizing Mission\" (French: Mission civilisatrice). \"Civilizing\" the populations of Africa by spreading language and religion was stated as to explain why the French colonial project should be supported. France sent small numbers of settlers to its empire, with the notable exception of Algeria, where the French settlers took power but always remained a minority. == References == Category:History of France Category:1534 establishments Category:1946 disestablishments",
 "title": "French colonial empire"
}