{
 "id": "340677",
 "text": "La Massana (originally La Maçana) is one of the seven parishes of Andorra. It is in the northwest of the country. La Massana is also the name of the main town of the parish. The name Massana derives from the Latin name mattianam for a variety of apple. ==Geography== The La Massana parish is in the northwest of the country and borders with the Ordino parish to the north, with the Ordino and Encamp parishes to the east, with the Andorra la Vella and the Escaldes- Engordany parishes to the south, with France (Ariège department) and Spain to the west. The town of La Massana has an average elevation of above sea level. In the La Massana parish are the highest mountains of Andorra, including: * Coma Pedrosa (), high, the highest mountain of the country; it is in the northwest of the parish near the borders with France and Spain. * Roca Entravessada, high * Pic de Medacorba, high * Pic de Sanfonts, high The main river in the parish is the Valira del Nord (or Valira d'Ordino) river, one of the two branches that form the Valira river. There are several small lakes in the parish; the main lakes are Estanys Forcats, Estany de Les Truites and Estany Negre. ==Population== The parish had a population, in 2015, of 10,359 inhabitants, for a population density of persons/km². Evolution of the population in La Massana Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:373 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:12000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:2000 start:0 ScaleMinor = gridcolor:lightgrey increment:1000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1981 text:1981 bar:1986 text:1986 bar:1991 text:1991 bar:1996 text:1996 bar:2001 text:2001 bar:2006 text:2006 bar:2011 text:2011 bar:2015 text:2015 PlotData= color:barra width:20 align:left bar:1981 from:0 till: 2470 bar:1986 from:0 till: 3229 bar:1991 from:0 till: 4989 bar:1996 from:0 till: 5785 bar:2001 from:0 till: 6375 bar:2006 from:0 till: 8953 bar:2011 from:0 till: 9744 bar:2015 from:0 till: 10359 TextData= fontsize:S pos:(20,20) text: ==Villages== There are other villages and hamlets besides the main town of La Massana in the parish: No. Town Population (2015) Altitude (m) Notes 1 Aldosa 843 1,296 Also known as L'Aldosa de la Massana. It is on the left side of the Valira d'Ordino river close to the Ordino parish. 2 Anyós 847 1,307 It is on the left side of the Valira d'Ordino (or Valira del Nord) river and on the right side of the Anyós river, just before the confluence of the rivers. 3 Arinsal 1,620 1,467 It is on the left side of the Arinsal river. 4 Erts 473 1,340 It is at the confluence of the Pal and Arinsal rivers. 5 Escàs 162 1,343 It is on the right side of the Valira d'Ordino river. 6 La Massana 5,371 1,240 The capital of the parish. It is at the confluence of the Valira d'Ordino and Arinsal rivers. 7 Pal 260 1,551 It is along Pal river. 8 Sispony 886 1,315 ==Economy== The main economic activity is tourism and the parish is a major tourism destination. In winter, the main activities are skiing, snowboarding, and ski ski biking. The main ski resort, Vallnord, includes the Arinsal and Pal sectors. In summer, the main activities are hiking, climbing, mountain biking and canyoning. Farming is also an important economic activity in the parish; here tobacco, vegetables (mainly potatoes), and cereals are grown. ==Sites of interest== * Sant Ermengol de l'Aldosa church in Aldosa * Sant Climent de Pal church in Pal * Pont de Sant Antoni de la Grella, a bridge also called Pont de Sispony * Museu Casa Rull, a museum of Ethnology in Sispony * Vallnord, a ski/snowboard resort in the Pyrenees mountains ==Gallery== File:Esglesia Sant Climent de Pal a Pal Ordino.jpg|Sant Climent de Pal in Pal File:Pont de Sant Antoni 1.JPG|Pont de Sant Antoni de la Grella bridge File:Estanys Forcats (agost 2008) - panoramio.jpg|Estanys Forcats File:Anyós.JPG|View of Anyós, La Massana ==References== Category:Parishes of Andorra",
 "title": "La Massana"
}