{
 "id": "340870",
 "text": "Teenage pregnancy is a situation which involves female adolescents who are less than 20 years old. But sometimes preteens (people under 13) can become pregnant as well. The fact that teenagers become pregnant is related to many factors. These are related to the specific situation of the teenager and the group that she interacts with. The rates of teenage pregnancy vary from country to country and are related to differences of sexual activities, the general sex education and contraceptives being available. Teen pregnancy will sometimes involve low birth weight. Social matters also play a role: often, the teenager grew up in poverty. She also often has a lower level of general education. Pregnancy in teenagers in the developed world usually occurs outside of marriage. The lowest levels of teenage pregnancy are in Japan and South Korea. Teenage pregnancies are common among Romani people. Bulgaria and Romania have the highest teenage pregnancy rate in Europe. In the United States, teenage pregnancy is most common among Hispanic and Latino Americans. ==Problems== ===Medicalities=== Teenage pregnancies have a number of problems: * There is a higher risk that babies born from teenage mothers are born too early, or that they have a low weight at birth.The National Campaign to Prevent Teen Pregnancy. (2002). . Retrieved May 27, 2006. * The mothers may also encounter complications or difficulties at birth; they have a higher risk of anaemia than mothers aged 20–24. * A pregnancy is best followed by trained medical staff during its course. Teenage mothers are less likely to receive prenatal care, often seeking it in the third trimester, if at all. The Guttmacher Institute reports that one-third of pregnant teens receive insufficient prenatal care and that their children are more likely to suffer from health issues in childhood or be hospitalized than those born to older women.Guttmacher Institute. (1999, September). Teen Sex and Pregnancy . Retrieved May 29, 2006. * Like most other teenagers, teenage mothers may suffer from poor nutrition. This may lead to them having specific illnesses related to bad nutrition. Bad nutrition is a more marked problem of teenagers in developed countries. * Up to 70,000 teen girls in developing countries die from complications during pregnancy each year. Young mothers and their babies are also at greater risk of contracting HIV. The World Health Organization estimates that the risk of death following pregnancy is twice as high for women between 15 and 19 years than for those between the ages of 20 and 24. The maternal mortality rate can be up to five times higher for girls aged between 10 and 14 than for women of about twenty years of age. Illegal abortion also holds many risks for teenage girls in areas such as sub-Saharan Africa.Locoh, Therese. (2000). \"Early Marriage And Motherhood In Sub-Saharan Africa .\" WIN News.'.' Retrieved July 7, 2006. * Risk for complications are higher for girl 14 years or younger, because their pelvis has not yet developed fully; this may lead to probems with childbirth. Some of these problems can be dealt with using Cesarean section (C Section)This requires the services of a doctor, or a hospital, which is often unavailable. Where this is unavailable, eclampsia, obstetric fistula, infant mortality, or maternal death can result. For mothers in their late teens, age in itself is not a risk factor, and poor outcomes are associated more with socioeconomic factors rather than with biology. ===Social=== * Problems other than the age of the mother, such as poverty and social support also affect the outcome. It is important that teenage mothers can rely on the family and the state to help them cope, and educate their child. Teenage parents who can rely on family and community support, social services and child-care support are more likely to continue their education and get higher paying jobs as they progress with their education.Stepp, G. (2009).Teen Pregnancy: The Tangled Web. * Being a young mother often affects education.Teen mothers are more likely to drop out of high school. Recent studies, though, have found that many of these mothers had already dropped out of school prior to becoming pregnant. One study in 2001 found that women who gave birth during their teens completed secondary- level schooling 10–12% as often and pursued post-secondary education 14–29% as often as women who waited until age 30. == Potential Solutions == === Education === A large cause of teenage pregnancy is a lack of education about sex and pregnancy.Honig, Alice S. “Teen pregnancy.” International Journal of Adolescence and Youth, 17.4 (2012) p. 181-187. Web. 3 Nov. 2014. The first to be blamed are schools and teachers, but the real starting point should be from within the family.Teen Pregnancy: What Are the Consequences? Dir. Dale Gaydos. Prod. Stuart Muszynski. Aquarius Health Care Media, 2006. Alexander Street Evidence Based Acquisition. Web. 3 Nov. 2014. .Hobbie, Cynthia. “Teen pregnancy and teen parenting.” Journal of Pediatric Healthcare. 7.2 (1993) p. 96-97. Web. 2 Nov. 2014. Sometimes parents might think talking about sex is inappropriate or that it is automatically encouraging their children to have sex, so they avoid talking about it entirely. This leaves kids with information only from their peers, which often includes pressure to engage in sex acts to meet social standards. Parents should realize that in attempting to protect their children from the reality of human sexuality they are causing more harm than good. Open discussion about sex in a safe, nonjudgmental environment is essential to helping minors make educated decisions about sex. Pediatricians also take it upon themselves to make up for the information that has not been properly communicated to teens, and continually recognize better education as the key to helping reduce teen pregnancy.McCracken, Katherine A.; Loveless, Meredith. “Teen pregnancy: an update.” Current Opinion in Obstetrics and Gynecology, 26.5 (2014) p. 355-359. Web. 3 Nov. 2014. ==References== Category:Pregnancy and childbirth",
 "title": "Teenage pregnancy"
}