{
 "id": "34087",
 "text": "The Ukrainian language (Ukrainian: українська (мова), transliteration: ukrajinśka mova) is an Eastern Slavic language. This language is a part of the Indo-European language family. Ukrainian is the second most spoken Slavic language. It is the official language of Ukraine. There are 37 million speakers in Ukraine. Most of them are native speakers. All over the world there are more than 50 million speakers. The Ukrainian language is written with Cyrillic letters. Many words are similar to the Polish language. == Alphabet == The Ukrainian alphabet with transliteration and transcription (to English and German): Capital letter (HTML-Entity) Small letter (HTML-Entity) Academic transliteration English transcription German transcription А (&#1040;) а (&#1072;) A a A a A a Б (&#1041;) б (&#1073;) B b B b B b В (&#1042;) в (&#1074;) V v V v W w Г (&#1043;) г (&#1075;) H h H h H h Ґ (&#1168;) ґ (&#1169;) G g G g G g Д (&#1044;) д (&#1076;) D d D d D d Е (&#1045;) е (&#1077;) E e E e E e Є (&#1028;) є (&#1108;) Je je Ye ye Je je Ж (&#1046;) ж (&#1078;) Ž ž Zh zh Sch (Sh) sch (sh) З (&#1047;) з (&#1079;) Z z Z z S s И (&#1048;) и (&#1080;) Y y Y y Y y І (&#1030;) і (&#1110;) I i I i I i Ї (&#1031;) ї (&#1111;) Ji ji Yi yi Ji ji Й (&#1049;) й (&#1081;) J j 1 Y y J j К (&#1050;) к (&#1082;) K k K k (instead ks x) K k (instead ks x) Л (&#1051;) л (&#1083;) L l L l L l М (&#1052;) м (&#1084;) M m M m M m Н (&#1053;) н (&#1085;) N n N n N n О (&#1054;) о (&#1086;) O o O o O o П (&#1055;) п (&#1087;) P p P p P p Р (&#1056;) р (&#1088;) R r R r R r С (&#1057;) с (&#1089;) S s S s S s (between vowels ss) Т (&#1058;) т (&#1090;) T t T t T t У (&#1059;) у (&#1091;) U u U u U u Ф (&#1060;) ф (&#1092;) F f F f F f Х (&#1061;) х (&#1093;) Ch ch Kh, kh Ch ch Ц (&#1062;) ц (&#1094;) C c Ts ts Z z Ч (&#1063;) ч (&#1095;) Č č Ch ch Tsch tsch Ш (&#1064;) ш (&#1096;) Š š Sh sh Sch sch Щ (&#1065;) щ (&#1097;) Šč šč Shch shch Schtsch schtsch (Stsch stsch) Ь (&#1068;) ь (&#1100;) ’ (apostrophe) before vowel j 2 ’ (apostrophe) before vowel y (Soft sign) (–) bzw. j Ю (&#1070;) ю (&#1102;) Ju Ju Yu yu Ju ju Я (&#1071;) я (&#1103;) Ja ja Ya ya Ja ja ’ ’ (apostrophe)3 (–) (–) === Notes === :1only before o :2only after consonants; a capital letter does not exist; the soft sign ь is not a letter representing a sound, but modifies the sound of the preceding letter, indicating palatalisation ('softening'). :3an apostrophe (’) is used to mark de-palatalization of the preceding consonant. ==References== *",
 "title": "Ukrainian language"
}