{
 "id": "34098",
 "text": "Apocalypse Now is a 1979 American epic drama movie directed by Francis Ford Coppola. It tells a fictional story which takes place in the 1960s during the Vietnam War. It tells the story of an Army Captain who is sent on a boat deep into the Cambodian jungle to capture a Special Forces colonel who, it is suggested, has gone insane. It was partly based on Joseph Conrad's novel about a journey down the Congo River, Heart of Darkness. It is now thought to be a great movie, but in the making it ran into problems. Its key star Martin Sheen, is on the screen for almost all the movie. He had a breakdown, and a heart attack. Editing the mile plus of film took years. It was unfinished when it was shown in the Cannes Film Festival. Apocalypse Now is today considered to be one of the greatest films ever made. It was nominated for eight Academy Awards at the 52nd Academy Awards, including Best Picture, Best Director (Coppola), and Best Supporting Actor for Robert Duvall. It went on to win for Best Cinematography and Best Sound. It ranked #14 in Sight & Sounds greatest films poll in 2012, and #6 in the Director's Poll of greatest films of all time. The film as now shown on streaming channels is the Director's \"Final Cut\". This was first shown in 2019 at the Tribeca Film Festival. It runs for 3 hours, 3 minutes. == Awards and honors == Awards and Nominations received by Apocalypse Now Award Category Nominee Result 52nd Academy Awards Best Picture Francis Ford Coppola, Fred Roos, Gray Frederickson and Tom Sternberg 52nd Academy Awards Best Director Francis Ford Coppola 52nd Academy Awards Best Actor in a Supporting Role Robert Duvall 52nd Academy Awards Best Writing, Screenplay Based on Material from Another Medium John Milius and Francis Ford Coppola 52nd Academy Awards Best Sound Walter Murch, Mark Berger, Richard Beggs, and Nat Boxer 52nd Academy Awards Best Art Direction Art Direction: Dean Tavoularis and Angelo P. Graham; Set Decoration: George R. Nelson 52nd Academy Awards Best Cinematography Vittorio Storaro 52nd Academy Awards Best Film Editing Richard Marks, Walter Murch, Gerald B. Greenberg and Lisa Fruchtman 1979 Cannes Film Festival Palme d'Or Apocalypse Now 1st American Movie Awards Best Actor Martin Sheen 1st American Movie Awards Best Supporting Actor Robert Duvall 33rd British Academy Film Awards Best Film Apocalypse Now 33rd British Academy Film Awards Best Actor Martin Sheen 33rd British Academy Film Awards Best Supporting Actor Robert Duvall 33rd British Academy Film Awards Best Direction Francis Ford Coppola 33rd British Academy Film Awards Best Original Film Music Carmine Coppola and Francis Ford Coppola 33rd British Academy Film Awards Best Cinematography Vittorio Storaro 33rd British Academy Film Awards Best Editing Richard Marks, Walter Murch, Gerald B. Greenberg, and Lisa Fruchtman 33rd British Academy Film Awards Best Production Design Dean Tavoularis 33rd British Academy Film Awards Best Soundtrack Nathan Boxer, Richard Cirincione, Walter Murch 5th César Awards Best Foreign Film (Meilleur film étranger) Francis Ford Coppola David di Donatello Awards Best Foreign Director (Migliore Regista Straniero) Francis Ford Coppola 32nd Directors Guild of America Awards Outstanding Directorial Achievement in Motion Pictures Francis Ford Coppola 37th Golden Globe Awards Best Motion Picture – Drama Francis Ford Coppola, Fred Roos, Gray Frederickson, and Tom Sternberg 37th Golden Globe Awards Best Director Francis Ford Coppola 37th Golden Globe Awards Best Supporting Actor Robert Duvall 37th Golden Globe Awards Best Original Score Carmine Coppola and Francis Ford Coppola 22nd Annual Grammy Awards Best Original Score Written for a Motion Picture Carmine Coppola and Francis Ford Coppola 1979 National Society of Film Critics Awards Best Supporting Actor Frederic Forrest 32nd Writers Guild of America Awards Best Drama Written Directly for the Screen John Milius and Francis Ford Coppola ;American Film Institute lists * AFI's 100 Years...100 Movies – No. 28 * AFI's 100 Years...100 Movie Quotes: ** \"I love the smell of napalm in the morning.\" – No. 12 * AFI's 100 Years...100 Movies (10th Anniversary Edition) – No. 30 ==References== ==Other websites== * Category:1979 drama movies Category:1979 war movies Category:1970s epic movies Category:1970s American drama movies Category:American epic movies Category:American war movies Category:Cambodia Category:1970s English-language movies Category:Movies based on books Category:Jungle movies Category:Movies set in the 1960s Category:United States National Film Registry movies Category:Vietnam War movies Category:Movies directed by Francis Ford Coppola Category:Movies about assassinations Category:Movies about tigers Category:Movies set in Vietnam Category:Movies featuring a Best Supporting Actor Academy Award-winning performance Category:Movies about the United States Navy Category:Best Picture Oscar Category:Golden Globe Award winning movies",
 "title": "Apocalypse Now"
}