{
 "id": "341025",
 "text": "William Swainson, Fellow of the Linnean Society and Fellow of the Royal Society (8 October 1789 – 6 December 1855), was an English ornithologist, malacologist, entomologist and artist. == Life == Swainson was born in Dover Place, St. Mary Newington, London. He was the eldest son of John Timothy Swainson, who was also of the Linnean Society.Biographical Etymology of Marine Organism Names. L William worked at the Liverpool Customs when he was 14.\"William Swainson F.R.S, F.L.S., Naturalist and Artist: Diaries 1808-1838:Sicily, Malta, Greece, Italy and Brazil.\" G.M. Swainson, Palmerston, NZ 1989. He studied the ichthyology of western Sicily. In 1815, he returned to England because he became ill. In 1816 he went with the explorer Henry Koster to Brazil. They did not spend a long time on shore because of a revolution. However, Swainson brought to England over 20,000 insects, 1,200 species of plants, drawings of 120 species of fish, and about 760 bird skins. As with many Victorian scientists, Swainson was also a member of many societies. He was elected as a fellow to the Royal Society after his return from Brazil on 14 December 1820.Election of William Swainson as a Fellow of the Royal Society In 1823, he married his first wife Mary Parkes, and had four sons and a daughter. His wife died in 1835. Swainson re-married in 1840 to Ann Grasby, and emigrated to New Zealand in 1841. He died at Fern Grove, Lower Hutt, New Zealand, on 7 December 1855. ==Species named after William Swainson== Many birds were named after William Swainson. *John James Audubon named Swainson's Warbler Limnothlypis swainsonii *Charles Lucien Bonaparte named Swainson's Hawk Buteo swainsoni *Thomas Nuttall named Swainson's Thrush Catharus ustulatus *Swainson's Francolin Francolinus swainsonii *Swainson's Sparrow Passer swainsonii *Swainson's Antcatcher Myrmeciza longipes *Swainson's Fire- eye Pyriglena atra *Swainson's Flycatcher Myiarchus swainsoni *Swainson's Toucan Ramphastos swainsonii Image:Limnothlypis_swainsoniiEMP04CB.jpg|Swainson's Warbler Image:Buteo_swainsoni_edit.jpg|Swainson's Hawk Image:Catharus_ustulatus.jpg|Swainson's Thrush Image:Ramphastos_swainsonii_- back_-Buffalo_Zoo-8a.jpg|Swainson's Toucan == References == Category:1789 births Category:1855 deaths Category:British ornithologists Category:Fellows of the Royal Society Category:Scientists from London Category:Artists from London Category:Entomologists",
 "title": "William Swainson"
}