{
 "id": "341042",
 "text": "The Angolan Civil War was a major civil war in the African country of Angola. It started in 1975 and continued until 2002. The war began right after Angola became independent from Portugal in November 1975. The Civil War was mostly a fight for power between two former liberation movements, the People's Movement for the Liberation of Angola (MPLA) and the National Union for the Total Independence of Angola (UNITA). Other countries got involved in the war because they wanted their own ideologies to win. This made the Angolan war part of the Cold War. In 2002 the MPLA won. About 500,000 people died in the war. The war also did a lot of damage to buildings in Angola. Because of all the damage, in 2003 80% of Angolans lacked access to basic medical care, 60% lacked access to water, and 30% of Angolan children would die before the age of 5, with an overall national life expectancy of less than 40 years of age. With the civil war between 1975 and 2002 it was 27 years of fighting. == Background == In 1575, the Portuguese started to colonize parts of what is now Angola. Before, some of the land was part of the Kingdom of Kongo. == Combatants == === MPLA === The MPLA was a communist group fighting for Angolan independence. Its leader was Agostinho Neto. They were supported by the Soviet Union. === UNITA === UNITA was an anti-communist group also fighting for Angolan independence. Its leader was Jonas Savimbi. === FNLA === FNLA was another anti-communist independence group. Its leader was Holden Roberto. The US gave them money by funneling it through Zaire. == War == === 1970s === In 1975, Portugal signed the Alvor Agreement with MPLA, UNITA, and FNLA. The agreement said, that, Angola would become independent on 11 November 1975. == Aftermath == The war destroyed a lot of buildings in Angola. There are still landmines remaining killing and hurting people. ==References== Category:Civil wars involving Africa Category:1970s conflicts Category:1980s conflicts Category:1990s in Africa Category:1990s conflicts Category:2000s conflicts Category:2000s in Africa Category:1975 in Africa Category:1976 in Africa Category:1977 in Africa Category:1978 in Africa Category:1979 in Africa Category:20th century in Angola Category:Cold War Category:20th century in Namibia Category:20th century in the Democratic Republic of the Congo Category:History of the Soviet Union Category:Wars involving South Africa Category:21st century in Namibia",
 "title": "Angolan Civil War"
}