{
 "id": "341257",
 "text": "Rachel Getting Married is a 2008 American drama movie about a drug addict attending her sister's wedding. Anne Hathaway stars. This drama got limited released on 3 October, 2008. == Awards and nominations == Awards Award Category Name Results Academy Awards Best Actress Anne Hathaway Austin Film Critics Association Best Actress Anne Hathaway Broadcast Film Critics Association Awards Best Actress Anne Hathaway Broadcast Film Critics Association Awards Best Cast Acting Ensemble Chicago Film Critics Association Awards Best Actress Anne Hathaway Chicago Film Critics Association Awards Best Supporting Actor Bill Irwin Chicago Film Critics Association Awards Best Supporting Actress Rosemarie DeWitt Chicago Film Critics Association Awards Best Original Screenplay Jenny Lumet Dallas-Fort Worth Film Critics Association Awards Best Actress Anne Hathaway Detroit Film Critics Society Best Actress Anne Hathaway Detroit Film Critics Society Best Supporting Actress Rosemarie DeWitt Detroit Film Critics Society Best Ensemble Detroit Film Critics Society Best Newcomer Rosemarie DeWitt EDA Annual Achievement Awards Best Ensemble Cast EDA Annual Achievement Awards Best Woman Screenwriter Jenny Lumet Golden Globe Awards Best Actress—Drama Anne Hathaway Gotham Awards Breakthrough Actor Rosemarie DeWitt Gotham Awards Best Ensemble Cast Anne Hathaway, Rosemarie DeWitt, Bill Irwin Tunde Adebimpe, Anna Deavere Smith Anisa George, Debra Winger Houston Film Critics Society Best Actress Anne Hathaway Independent Spirit Awards Best Film Independent Spirit Awards Best Director Jonathan Demme Independent Spirit Awards Best First Screenplay Jenny Lumet Independent Spirit Awards Best Lead Female Anne Hathaway Independent Spirit Awards Best Supporting Female Rosemarie DeWitt Independent Spirit Awards Best Supporting Female Debra Winger National Board of Review Awards Best Actress Anne Hathaway New York Film Critics Circle Awards Best Screenplay Jenny Lumet Palm Springs International Film Festival Desert Palms Achievement Award for Best Actress Anne Hathaway Satellite Awards Best Supporting Actress Rosemarie DeWitt Satellite Awards Best Actress—Drama Anne Hathaway Screen Actors Guild Awards Outstanding Performance by a Female Actor in a Leading Role Anne Hathaway Southeastern Film Critics Association Best Actress Anne Hathaway St. Louis Film Critics Association Best Actress Anne Hathaway Utah Film Critics Association Best Supporting Actress Rosemarie DeWitt Utah Film Critics Association Best Screenplay Jenny Lumet Venice Film Festival Golden Lion Washington D.C. Area Film Critics Association Best Supporting Actress Rosemarie DeWitt Washington D.C. Area Film Critics Association Best Screenplay Jenny Lumet == References == == Other websites== * * * * * * Category:2008 drama movies Category:2008 romance movies Category:American drama movies Category:English-language movies Category:Movies about drugs Category:Movies directed by Jonathan Demme Category:American independent movies",
 "title": "Rachel Getting Married"
}