{
 "id": "341318",
 "text": ", also known as Shōgen, was a Japanese era name (年号, nengō, lit. year name) after Ken'ei and before Kenryaku. This period spanned the years from October 1207 through March 1211.Nussbaum, Louis-Frédéric. (2005). \"Jōgen\" in Japan encyclopedia, p. 429. The reigning emperors were and .Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 221-231; Brown, Delmer. (1979). Gukanshō, p. 340; Varley, H. Paul. (1980). Jinnō Shōtōki, pp. 220-221. ==Events of the Jōgen era== * 1208 (Jōgen 2, 6th month): Tsuchimikado went to the Kumano Sanzan Shrine.Titsingh, p. 229. * 1210 (Jōgen 4, 5th month): The emperor returned to the Kumano Shrine.Titsingh, 230. * 1210 (Jōgen 4, 6th month): Tsuchimikado accepted Hideyasu of Kazusa as part of the court. * 1210 (Jōgen 4, 8th month): The emperor visited the Kasuga Shrine. * 1210 (Jōgen 4, 9th month): A comet with a very long tail appeared in the night sky. * 1210 (Jōgen 4, 25th day of the 11th month): In the 12th year of Tsuchimikado's reign, the emperor abdicated for no particular reason; and the succession (senso) was received by his younger brother, the second son of the former-Emperor Go-Toba. Soon after, Emperor Juntoku's role as emperor was confirmed (sokui).Titsingh, p. 230; Brown, p. 341; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go- Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2012-5-22. ==Related pages == * Kamakura period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Jōgen 1st 2nd 3rd 4th 5th 1207 1208 1209 1210 1211 Preceded by: Ken'ei Era or nengō: Jōgen Succeeded by: Kenryaku Category:Japanese eras Category:1200s establishments in Japan Category:1210s disestablishments in Japan",
 "title": "Jōgen (Kamakura period)"
}