{
 "id": "341322",
 "text": "The Newport Aquarium is a public aquarium in Newport, Kentucky, United States. ==World Rivers== In the aquarium's first gallery, nine displays show freshwater fish from five continents of the world. There are hundreds of species in these exhibits, from the rainforests of Australia, the wetlands and caves of North America, tall grasses of Asia, the Amazon of South America, and the center of Africa. The tanks in World Rivers hold 9,000 gallons of freshwater. *Wenlock River: Banded Rainbow fish, Pacific Blue Eye, Black Tandan Catfish, Gudgeon *Licking River: Rainbow darter, Rosefin shiner, Redside dace, Blue sucker, Two-toned Pared Sunfish *Mississippi River: Spotted gar, Spring cavefish, Stinkpot turtle *Cavefish: Blind cavfish, Northern cavefish *Mekong River: Bumblebee goby, Harlequin Rasboras, Blue gouarmi, Siamese algae eater, Danios, Thai Wood Shrimp *Rio Negro: Heckel duscus, Corydoras catfish, Black-winged hatchetfish, Goden pencilfish, Ram cichlid, Striped Headstander, Cardinal tetra, Neon tetra, Rummy-nose tetra, Red finned Congo tetra, Striped Krib, Slender teleo, Brichard's catfish, Deep Angelfish *Lake Malawi: Mbuna Cichlid, Malawi Eyebiter, Even-spotted Synodontius, Hapliningsteni *Congo River: Congo Tetra, Red Finned Congo Tetra, Green Rope Fish, Butterfly Fish *Lake Tanganyika: Black-fin cichlid, Golden julie, Mbu pufferfish, Moore's Lamprologus, Clavas, Shelldweller, Xenotilapia *Caribbean Cove: Near the end of World Rivers is the aquarium's first tunnel. This tank is home to lookdowns, live sharksuckers, porkfish, gruntfish, and green moray eels. ==Shore Gallery== This gallery has over 500 animals in eight different exhibits. These are animals that live in the shallow areas of a water's edge. The tanks in the Shore Gallery hold 6,120 gallons of water. This includes a touch pool where visitors can touch species of the New England shoreline in a 1,200 gallon, rocky, open-topped exhibit. The Surge Zone depicts an area of Hawaii where waves crash against the rocky shore and create tide pools. *Salt Marsh: Depicts the species that live in the brackish waters of Maryland's shores: Northern Diamondback Terrapin, Marsh Fiddler Crab, Sheepshead Minnow, Marsh Killfish, Mummichog, Periwinkle, Blenny, and Atlantic Silverside. *Tidal River: Showcases a river whose flow is affected by tides in Peninsula De Paria, Venezuela: Four-eyed Fish, Endler's Livebearers, and Orange-spotted Sunfish. *Mangrove Forest: This depicts the brackish mangrove forest along the Nigerian Coast in Africa: Butterfly Mudskipper, Diamond moonfish, Striped Painchax. *River Delta: Depicts a river delta in the Ganges River, Bangladesh: Banded Archerfish, Glass Catfish, Up-side down catfish, Green Spotted Puffer. Florida Grass Bed: Depicts the tall, thick grasses of the Florida Keys: Scrawled Filefish, High Hat, Gramma Basslet, Orange Toadfish, Trumpetfish. Flooded Crater: Depicts the Hanauma Bay, which was created when the ocean broke through the side of a volcanic crater and filled the crater with water: Lagoon Triggerfish, Pennant fish, Racoon Butterfly, Loggerhead sea turtle. Surge Zone: Saddle Wrasse, Ornate wrasse, Sergeants, Sailfin Tang, Dascyilus, Hawaiian Flagtail, Squirrelfish, Arc-eyed Hawkfish. Sand Flats: Depicts a sandy flat off the Southeastern coast of the U.S.: Silver pomfrets. California Kelp Forest: This is the second tunnel of the aquarium, simulating a thick kelp forest near Anacapa Island, California ==Other websites== * Category:Aquariums Category:Buildings and structures in Kentucky",
 "title": "Newport Aquarium"
}