{
 "id": "341377",
 "text": "Diary of a Wimpy Kid is an American 2010 live-action/animated comedy movie and is based on the novel of the same name. The movie was released on March 19, 2010 (September in Australia). It was released on DVD, iTunes and Blu-ray on August 3, 2010. ==Awards and nominations== * 2011 Kids Choice Awards ** Favorite movie (nominated) lost to The Karate Kid * 32nd Young Artist Awards ** Best actor in a feature film (Zach Gordon) (nomination) lost to Jaden Smith ** Best supporting actor in a feature film (Robert Capron) (nomination) lost to Billy Unger ** Best supporting actor in a feature film (Alex Ferris) (nomination) Lost to Billy Unger. ** Best ensemble in a feature film (Zach Gordon, Robert Capron, Devon Bostick, Chloë Moretz, Laine MacNeil, Grayson Russell, Karan Brar and Alex Ferris) (Won) ** Best supporting actress (Laine MacNeil) (nomination) lost to Diandra Newlin and Stefanie Scott ==Cast== * Zachary Gordon as Greg Heffley. ** Nathaniel Marten as adult Greg. ** Dylan Bell as young Greg. ** L.J. Benet as uncredited singing voice of Greg. * Robert Capron as Rowley Jefferson, Greg's childish best friend. * Rachael Harris as Susan Heffley, Greg's mother. * Devon Bostick as Rodrick Heffley, Greg's older brother. * Chloë Grace Moretz as Angie Steadman, a seventh-grader at Greg's school who is a reporter for the school paper. She is a brand new character not found in the original books. * Steve Zahn as Frank Heffley, Greg's father. * Grayson Russell as Fregley, a weird classmate of Greg's. * Laine MacNeil as Patty Farrell, Greg's arch-enemy. ** Madison Bell as young Patty. * Karan Brar as Chirag Gupta, a friend of Greg's. * Connor and Owen Fielding as Manny Heffley, Greg's little brother. * Raugi Yu as Vice Principal Roy, the Vice Principal who appears on the intercom or TV giving news. * Jennifer Clement as Mrs. Flint, Greg's homeroom teacher. * Alex Ferris as Collin Lee, Rowley's substitute best friend during his fight with Greg. * Andrew McNee as Coach Malone, Greg's gym teacher. * Belita Moreno as Mrs. Norton, Greg's acting teacher. * Afred E. Humphreys as Mr. Jefferson, Rowley's father who dislikes Greg. * Kaye Capron as Mrs. Jefferson, Rowley's mother. * Donnie McNeil as Wade, one of the 3 teenagers who threw water at Greg and Rowley. * Nicholas Carey as Pete Hosey, the leader of the 3 teenagers who threw water at Greg and Rowley. * Samuel Patrick Chu as Carter, another one of the 3 teenagers who threw water at Greg and Rowley. * Rob LaBelle as Mr. Winsky, the leader of the Safety Patrol. * Harrison Houde as Darren Walsh, Greg's classmate who is infamous for starting the Cheese Touch. * Severin Korfer as Dieter Muller, a German exchange student who took the Cheese Touch with him back to his homeland. * Owen Best as Bryce Anderson, one of Greg's classmates who was said to have a \"cute butt\". * Karin Konoval as Mrs. Irvine, the woman who thought Rowley terrorized the kindergartners. * Adam Osei as Marty Porter, the school treasurer. * Paul Hubbard as Brock Brainigan P.I. ==References== Category:2010 comedy movies Category:American family comedy movies Category:20th Century Fox movies Category:Diary of a Wimpy Kid movies Category:Movies about children Category:Movies set in schools Category:Movies about dysfunctional families Category:2010s English-language movies",
 "title": "Diary of a Wimpy Kid (2010 movie)"
}