{
 "id": "341432",
 "text": "Turbatrix aceti (also called vinegar eels) is a species of nematode. They feed on the acidic bacteria from vinegar and other things, like fermented apples. They range from 1mm to 10mm long or larger. These nematodes go through a six- stage life cycle. The stages are: an egg, four larval stages, and reaching adulthood. They live about 10 months. ==Anatomy== The nematode's reproductive system is sexual. Female vinegar eels have ovaries and produce eggs. Their reproductive system is in the form of a tube. The females also have a short sac-like seminal receptacle that stores sperm. A fertilized egg hatches in the uterus before leaving the womb. Vinegar eels give birth to as many as 45 babies every 8-10 days. A male vinegar eels’ reproductive system is smaller than the female’s. They have testis and a vas deferens. The testes open into a wide sperm duct and then into a muscular duct which can push out the sperm. The duct empties into a cloaca. Nematodes, such as the vinegar eels, have no circulatory system. Through their body’s wall, gas and excretion waste are diffused. Oxygen from the outside environment is diffused into the body, and carbon dioxide is diffused out of the body. Vinegar eels have to live in liquids that have enough oxygen so that it can diffuse into their bodies. == Aging research == Experiments with T. aceti were done to understand the cause of ageing. DNA damage accumulates when the rate of damage occurrence is more than the rate of DNA repair. Accumulation of DNA damage leads to a decline in gene expression. There is a consistent decline in DNA repair capacity with age in the nematode. A second report measured the ability to repair DNA damage in young and old nematodes after exposure to ionizing radiation. They observed that the old nematodes were strikingly less able to carry out this type of DNA repair than young nematodes. These experiments suggest that a decline in DNA repair capability occurs with age. This is the \"DNA damage theory of aging\".Bernstein H. et al 2008. Cancer and aging as consequences of un- repaired DNA damage. In: New research on DNA damages. eds Honoka Kimura and Aoi Suzuki Nova Science, New York, Chapter 1, pp. 1-47. ISBN 978-1604565812 ==References== *Aquatic Community. \"Raising Vinegar Eels.\" AC Tropical Fish & Aquarium. Aquaticcommunity.com, 2004-06. Web. 19 Apr. 2012. *Pinckney, Rhonda DVM, PhD. \"(The Parasitology Resource UW - Madison).\" The Parasitology Rescource/ VetMed. UW School of Veterinary Medicine. Web. 19 Apr. 2012. . *Tappin, Adrian R. \"Vinegar Eels.\" Home of the Rainbowfish- Feeding. Selected for Inclusion in the National Library of Australia Digital Archive of Australian Online Publications (Jan. 1998), Dec. 2008. Web. 19 Apr. 2012. . *Wetman. \"Vinegar Eels.\" The Skeptical Aquarist.com. The Skeptical Aquarist ©, 21 Mar. 2011. Web. 19 Apr. 2012. . Category:Nematodes",
 "title": "Turbatrix aceti"
}