{
 "id": "341475",
 "text": ", formerly known as , is a broadcasting, restaurant, and observation tower in the city of Tokyo, the capital of Japan the special ward of Sumida, not far from the Sumida River. The nearest train station is Oshiage, which is on the Toei Asakusa Line, Tokyo Metro Hanzomon Line, and railway lines operated by Tobu and Keisei. The Tokyo Skytree was designed by the architects from Nikken Sekkei, a e company, the process of building the tower began in 2008 and was completed on 29 February 2012. Emperor Akihito visited the tower in advance of its official opening,\"Japanese Emperor visits Tokyo Sky Tree ahead of opening,\" Xinhua. April 26, 2012; retrieved 2012-04-26. and the opening ceremony took place on 22 May 2012.Nakata, Hiroko, \"Tokyo Sky Tree opener looms large,\" Japan Times, 21 February 2012; retrieved 2012-4-26. With a height of ,\"What 'Lost Decade'?\" New York Times. Jaunuary 7, 2012; retrieved 2012-4-26. the Tokyo Skytree is the tallest structure in Japan.Council on Tall Buildings and Urban Habitat, \"Japan Finishes World's Tallest Communications Tower,\" 1 March 2012; retrieved 2012-4-26. This height was chosen because it could be easily remembered. The figures 6 (mu), 3 (sa), 4 (shi) stand for Musashi Province, which is an old name of the region where the tower stands.Japan National Tourist Organization (JNTO), \"A new famous Tokyo spot linking information and the soul of Japan to the next generation\"; retrieved 2012-4-26. It is the third tallest structure in the world behind Merdeka 118 in Malaysia and Burj Khalifa in Dubai. It is also the tallest tower in the world, according to the Council on Tall Buildings and Urban Habitat, because there is no space in the Skytree for people to live or work in, unlike the Burj Khalifa. All of central Tokyo can be seen from special viewing platforms at and . At night, it is lit up with different coloured lights. ==References== == Other websites == *http://www.tokyo-skytree.jp/english , *Skyscrapernews article on New Tokyo Tower *http://www.rising-east.jp/webcam/ Category:Buildings and structures in Tokyo Category:Skyscrapers in Japan",
 "title": "Tokyo Skytree"
}