{
 "id": "341663",
 "text": ", also Genkō, was a after Gen'ō and before Shōchū.Nussbaum, Louis-Frédéric. (2005). \"Nengō\" in Japan Encyclopedia, pp. 704-705. This period started in February 1321Nussbaum, \"Gen'ō\" at p. 238. and ended in December 1324.Nussbaum, \"Shōchū\" at p. 877. The reigning Emperor was .Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 278-281; Varley, H. Paul. (1980). Jinnō Shōtōki. pp. 239-241. ==Events of the Genkyō era== * 1321 (Genkyō 1, 2nd month): Saionji Kinakira died. He was Minister of the Right (udaijin).Titsingh, p. 282. * 1321 (Genkyō 1, 4th month): The former-Emperor Go-Uda ordered the construction of a small chapel at Daikaku-ji where he lived in retirement. * 1321 (Genkyō 1, 5th month): The emperor visited Dikaku-ji to see this new chapel for himself. * 1321 (Genkyō 1, 6th month): died. He was the in Kyushu. * 1321 (Genkyō 1, 12th month): Hōjō Norisada was named governor of Kyoto; and Hōjō Hidetoki was named military governor of Kyūshū. * 1322 (Genkyō 2, 1st month): The emperor visited the former-Emperor Go-Uda at Daikau-ji; and he was entertained by a musical concert.Titsingh, p. 283. * 1322 (Genkyō 2, 1st month): Saionji Sanekane died at age 74. * 1322 (Genkyō 3, 3rd month): Ichijō Uchitsune lost his position as Chancellor (kampaku); and Kujō Fusazane was given this office. * 16 July 1324 (Genkyō 4, 25th day of the 6th month): Former-Emperor Go-Uda died at age 58.Titsingh, p. 284; Imperial Household Agency (Kunaichō), (後宇多天皇 (91); retrieved 2012-5-22. ==Related pages == * Kamakura period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection * Kyoto National Museum -- \"Treasures of Daikaku-ji\", including portrait of Go-Uda and the former-emperor's will Genkyō 1st 2nd 3rd 4th 1321 1322 1323 1324 Preceded by: Gen'ō Era or nengō: Genkyō Succeeded by: Shōchū Category:Japanese eras Category:1321 Category:1322 Category:1323 Category:1324 Category:1320s in Japan",
 "title": "Genkyō"
}