{
 "id": "341639",
 "text": "Jason Adam Griffith (born November 29, 1980) is an American voice actor and actor. He has worked on several animated TV series. He was the voices of Sega mascot Sonic the Hedgehog, Shadow the Hedgehog and Jet the Hawk in the Sonic the Hedgehog video game series. He was also the voice of Cilan, Ash's former traveling partner and first Gym Leader in Pokémon: Black & White. ==Filmography== ===Film=== Year Title Role Notes 1998 Edge of Seventeen Scott Uncredited 2005 Pokémon: Lucario and the Mystery of Mew Sir Aaron 2007 Am I Evil Greg 2008 Kill Kill Faster Faster Cassius Uncredited 2008 The Machine Girl Ryota Additional voices Live action dub 2008 Sonic: Night of the Werehog Sonic the Hedgehog (Sonic the Werehog) Short 2009 ManDate Chris Short 2009 Pokémon: Arceus and the Jewel of Life Marcus 2010 Animals United The Chimpanzee 'Toto' 2011 Pokémon the Movie: Black—Victini and Reshiram and White—Victini and Zekrom Cilan 2011 The Painting Additional voices 2012 Pokémon the Movie: Kyurem vs. the Sword of Justice Cilan 2012/2015 009 Re:Cyborg 009/Joe Shimamura English dubbed 2013 Pokémon: Meloetta's Moonlight Serenade Scraggy Short 2013 Pokémon the Movie: Genesect and the Legend Awakened Cilan ===Television=== Year Title Role Notes 2001-2013 Pokémon Cilan Servine Brawly Looker Additional voices 2003-2006 Sonic X Sonic the Hedgehog/Super Sonic/Dark Sonic Shadow the Hedgehog/Super Shadow Christopher Thorndyke (originally) Credited as J. Griff 2004-2009 Teenage Mutant Ninja Turtles Utrom Miyamoto Usagi Additional voices 2004 Gravitation Tatshua Uesugi 2004 F-Zero GP Legend Additional voices 2004-2007 One Piece Usopp Yassop 4Kids dub 2005-2006 Winx Club Lord Darkar 2005-2007 G.I. Joe Sigma Six Snake Eyes (flashbacks) 2005-2008 Yu-Gi-Oh! GX Atticus Rhodes Harrington Rosewood Nightshroud 2006 Pokémon Chronicles Gilbert 2006 Yu-Gi-Oh! Capsule Monsters Additional voices 2006-2009 Viva Pinata Terry Tigermisu 2006-2010 Chaotic Tom Majors Zhade Frafdo Credited as Adam Caroleson 2008 Three Delivery Additional voices 2009 Kurokami: The Animation Keita Ibuki 2009 Teenage Mutant Ninja Turtles: Turtles Forever Mirage Leonardo TV movie Credited as Adam Caroleson 2010 Slayers Revolution Additional voices 2010 Slayers Evolution-R Abel Episodes: \"TOWN SCAPE because it's a thing made by people\" \"UNCOVER, the darkness unveiled!\" 2010 Angel's Friends Sulfus 2011 Yu-Gi-Oh! 5D's Additional voices 2011-2012 Tai Chi Chasers Yanima 2011-2012 GoGoRiki Chikoriki 2011-2015 Yu-Gi-Oh! ZEXAL I & II Caswell Francis Nistro English dub 2011 Blue Bloods Suit in Red Sportscar Episode: \"Black and Blue\" 2011 Bakuman Hayato Kawaski English dub 2013 Zetman Jin Kanzaki English dub 2015 Yu-Gi-Oh! ARC-V Reed Pepper English dub ===Video games=== Year Title Role Notes 2004/2005 Teenage Mutant Ninja Turtles 2: Battle Nexus Slashuur English version 2005 One Piece: Grand Battle! Rush Usopp English version 2005 Sonic Rush Sonic the Hedgehog/Super Sonic English version 2005 Shadow the Hedgehog Shadow the Hedgehog/Super Shadow Sonic the Hedgehog English version 2006 One Piece: Grand Adventure Usopp English version 2006 One Piece: Pirates' Carnival Usopp English version 2006 Neverwinter Nights 2 Bevil English version 2006 Sonic Riders Sonic the Hedgehog/Super Sonic Jet the Hawk Shadow the Hedgehog English version Celebrating Sonic's 15th Anniversary 2006 Sonic the Hedgehog Sonic the Hedgehog/Super Sonic Shadow the Hedgehog/Super Shadow English version Celebrating Sonic's 15th Anniversary 2006 Sonic Rivals Sonic the Hedgehog Shadow the Hedgehog English version Celebrating Sonic's 15th Anniversary 2007 Sonic and the Secret Rings Sonic the Hedgehog Darkspine Sonic Shadow the Hedgehog English version Credited as Adam Caroleson 2007 Sonic Rush Adventure Sonic the Hedgehog/Super Sonic English version 2007 Sonic Rivals 2 Sonic the Hedgehog Shadow the Hedgehog English version 2007/2008 Mario & Sonic at the Beijing 2008 Olympic Games Sonic the Hedgehog Shadow the Hedgehog English version 2008 Sonic Riders: Zero Gravity Sonic the Hedgehog (Super Sonic) Jet the Hawk Shadow the Hedgehog English version Credited as Adam Caroleson 2008 Super Smash Bros. Brawl Sonic the Hedgehog/Super Sonic Shadow the Hedgehog English version Credited as Adam Caroleson 2008 SEGA Superstars Tennis Sonic the Hedgehog/Super Sonic Shadow the Hedgehog/Super Shadow English version 2008 Alone in the Dark Hammet Jack the Watchman 2008 Sonic Unleashed Sonic the Hedgehog/Super Sonic Sonic the Werehog Professor Pickle's Assistant English version 2009 Sonic and the Black Knight Sonic the Hedgehog Excalibur Sonic Shadow the Hedgehog Sir Lancelot Jet the Hawk as Sir Lamorak English version 2009 Teenage Mutant Ninja Turtles - Smash Up Foot Ninja 2009 Mario & Sonic at the Vancouver 2010 Olympic Winter Games Sonic the Hedgehog Shadow the Hedgehog Jet the Hawk English version 2010 Shira Oka: Second Chances Sakuragi Hiroshi 2010 Sonic & SEGA All-Stars Racing Sonic the Hedgehog/Super Sonic Shadow the Hedgehog/Super Shadow English version 2012 PokéPark 2: Wonders Beyond Scraggy Sawsbuck Bisharp Ferroseed English version ===Other=== * Astonishing X-Men (motion comic) - Elixir * Iron Man: Extremis (motion comic) - Iron Man/Tony Stark * Mobile Suit Gundam Unicorn - Additional voices * Freedom - Additional voices * The Dark Night Rises: The Mobile Game - Jack Crane * Casters (web series) - Cal == References == Category:1980 births Category:Actors from New York City Category:American movie actors Category:Pokémon Category:American voice actors Category:Living people",
 "title": "Jason Griffith"
}