{
 "id": "341722",
 "text": "in 1274 and in 1281 were major military events in Japanese history.Nussbaum, Louis-Frédéric. (2005). \"Genkō\" in Japan Encyclopedia, p. 238. Kublai Khan twice tried to conquer the Japanese islands; and his armies failed both times. The two failed invasion attempts are important because they were defining events in Japanese history.Web Chronology Project, \"Early Japan: 552-1281\"; retrieved 2012-4-29. The attempts show the limits of Mongol (Yuan Dynasty) ability to expand the Chinese empire.Cultural China (Shanghai News and Press Bureau), \"Mongol invasions of Japan - Major Military Invasions Undertaken by Kublai Khan\" ; retrieved 2012-4-29. ==Timeline== * November 19, 1274 (Bun'ei 11, 20th day of the 10th month): Kublai Khan sent a fleet and an army to invade Japan. Some military forces landed near Fukuoka in Kyūshū; however, a storm sank many of the ships. The major part of the invading army is drowned. The invaders retreat to Korea.Davis, Paul K. (2001). 100 decisive battles: from ancient times to the present, p. 147. During the brief fighting, the Hakozaki Shrine was burned to the ground.Turnbull, Stephen R. (2003). Genghis Khan & the Mongol Conquests 1190–1400, p. 66. This is called the or the \"Bun'ei War\".Nussbaum, \"Bun'ei no eki\" at p. 90. * 1281 (Kōan 4): There was a second Mongolian attempt to invade Japan. This is called the or the \"Kōan War\".Nussbaum, \"Kōan no Eki\" at p. 535. ==Consequences== After the destruction of the Mongol invaders, Japan's independence was guaranteed. A power struggle within Japan led to the growth of military governments and less Imperial power.Davis, p. 146. ==Related pages== * Kamikaze * Kamakura shogunate ==References== ==Other websites == * Fukuoka/Hakata Tourist Information, \"Historic spots of Genko (Mongol invasion of Japan)\" * Bowdoin, Mongol Invasions of Japan Category:Wars involving Japan Category:Wars involving China Category:Mongol Empire Category:13th century in Japan Category:1274 Category:1281",
 "title": "Mongol invasions of Japan"
}