{
 "id": "341805",
 "text": "The President of the Argentine Nation, usually known as the President of Argentina, is the head of state of Argentina. The President is also Commander- in-Chief of the armed forces. The current President is Javier Milei. He was sworn in on 10 December 2023. ==United Provinces of the Río de la Plata (1810–1831)== ===Junta presidents (1810–1811)=== Portrait Name Term of office Term of office Notes Portrait Name Start End Notes Time in office Cornelio Saavedra 25 May 1810 18 December 1810 President of the Primera Junta, at the beginning of the Argentine War of Independence. He is regarded as the first president of a national government.\"Buenos Aires, diciembre 16 de 1829.- El primer comandante de Patricios, el primer presidente de un gobierno patrio, pudo sólo quedar olvidado en su fallecimiento por las circunstancias calamitosas en que el país se hallaba. Después que ellas han terminado, sería una ingratitud negar a ciudadano tan eminente el tributo de honor rendido a su mérito, y a una vida ilustrada con tantas virtudes, que supo consagrar entera al servicio de su patria. El gobierno, para cumplir un deber tan sagrado, acuerda y decreta: Artículo 1º: En el cementerio del Norte se levantará, por cuenta del gobierno, un monumento en que se depositarán los restos del brigadier general D. Cornelio Saavedra. Artículo 2º: Se archivará en la Biblioteca Pública un manuscrito autógrafo del mismo brigadier general, con arreglo a lo que previene el decreto de 6 de octubre de 1821. Artículo 3º: Comuníquese y publíquese. Rosas – Tomás Guido\". 217 days Rosa, vol. II, p.199-306 Cornelio Saavedra 18 December 1810 26 August 1811 President of the Junta Grande. Left to serve in the Army of the North. 140 days Domingo Matheu 26 August 1811 23 September 1811 President of the Junta Grande, from Saavedra's departure to the dissolution of it. 13 days Rosa, vol. II, p. 306-319 ===Triumvirates (1811–1814)=== First Triumvirate 23 September 1811 – 8 October 1812 First Triumvirate 23 September 1811 – 8 October 1812 First Triumvirate 23 September 1811 – 8 October 1812 First Triumvirate 23 September 1811 – 8 October 1812 23 September 1811 – 23 March 1812 23 March 1812 – 8 October 1812 Feliciano Chiclana Manuel de Sarratea Juan José Paso Juan Martín de Pueyrredón Second Triumvirate 8 October 1812 – 31 January 1814 Second Triumvirate 8 October 1812 – 31 January 1814 Second Triumvirate 8 October 1812 – 31 January 1814 Second Triumvirate 8 October 1812 – 31 January 1814 8 October 1812 – 20 February 1813 20 February 1813 – 19 August 1813 19 August 1813 – 5 November 1813 5 November 1813 – 31 January 1814 Nicolás Rodríguez Peña Antonio Álvarez Jonte Gervasio Antonio de Posadas Juan José Paso José Julián Pérez Juan Larrea ===Supreme Directors (1814–1820)=== Portrait Name Term of office Term of office Term of office Notes Portrait Name Start End Time in office Notes Gervasio Antonio de Posadas 31 January 1814 9 January 1815 Chosen by the Assembly of the Year 1813. Rosa, Vol. III, p. 75-114 Carlos María de Alvear 9 January 1815 18 April 1815 Forced to resign by a mutiny. Rosa, vol. III, p. 114-129 José de San Martín Matías de Irigoyen Manuel de Sarratea 18 April 1815 20 April 1815 Third Triumvirate. Interim government until the appointment of a new Supreme Director. José Rondeau 20 April 1815 21 April 1815 Appointed successor of Alvear, could not take office because he was in command of the Army of the North Rosa, vol. III, p. 143 Ignacio Álvarez Thomas 21 April 1815 16 April 1816 Acting, for Rondeau. Convened the Congress of Tucumán, that would declare Independence. Rosa, vol. III, p. 143-160 Antonio González de Balcarce 16 April 1816 9 July 1816 Interim. Rosa, vol. III, p. 160 Juan Martín de Pueyrredón 9 July 1816 9 June 1819 First Argentine Head of State after the Argentine Declaration of Independence. Supported the Crossing of the Andes. Rosa, vol. III, p. 161-242 José Rondeau 9 June 1819 1 February 1820 Decisively defeated at the Battle of Cepeda by Federalist forces opposed to the 1819 centralist Constitution. Rosa, vol. III, p. 242-253 Juan Pedro Aguirre 1 February 1820 11 February 1820 Interim. Dissolved the National Congress and endorsed the Buenos Aires Cabildo to choose a Governor for Buenos Aires Province instead of the previous post of Governor Mayor. === Governors of Buenos Aires Province managing international relations (1820–1826) === Between 1820 and 1826, the United Provinces functioned as a loose alliance of autonomous provinces put together by pacts and treaties (see Treaty of Pilar, Treaty of Benegas, Quadrilateral Treaty), but lacking any actual central government until the 1825 Constitutional Congress. Portrait Name Term of office Term of office Notes Portrait Name Start End Notes Matías de Irigoyen 11 February 1820 18 February 1820 He had been Governor Mayor from 9 to 11 February 1820 and was promoted interim as Governor until the appointment of Manuel de Sarratea. Manuel de Sarratea 18 February 1820 6 March 1820 The political crisis that existed in the country led to his government lacked support from both Buenos Aires and the other provinces. Thus he resigned shortly afterwards. Juan Ramón Balcarce 6 March 1820 11 March 1820 Interim. Resigned. Manuel de Sarratea 11 March 1820 2 May 1820 He returned to office after the end of the brief government of Balcarce. The circumstances did not improve and ended up resigning a second time. Ildefonso Ramos Mexía 2 May 1820 20 June 1820 Ildefonso Ramos Mexía and Miguel Estanislao Soler 20 June 1820 23 June 1820 They took power simultaneously. Miguel Estanislao Soler 23 June 1820 29 June 1820 He assumed de facto, after an armed uprising, but his government lasted a few days, when the Board of Representatives appointed Manuel Dorrego. Manuel Dorrego 29 June 1820 20 September 1820 Interim. Martín Rodríguez 20 September 1820 2 April 1824 He signed the Treaty of Benegas and the Quadrilateral. Juan Gregorio de las Heras 2 April 1824 7 February 1826 He called a Constituent Congress that enacted several laws for which the Unitary Republic was proclaimed. He resigned because of that republic. === First presidential government (1826–1827) === Portrait Name Term of office Term of office Elections Political party Notes Start Name End Political party Notes Bernardino Rivadavia 8 February 1826 27 June 1827 1826 Unitarian Elected by the Constituent Assembly of 1826, before the promulgation of the 1826 constitution. Waged the Cisplatine War. Resigned as the Constitution was rejected by the provinces and the outcome of the war generated popular discontent. Vicente López y Planes 7 July 1827 18 August 1827 — Elected as interim president by the Constituent Assembly of 1826. His mandate was limited to close the Assembly and call for elections for a new governor of Buenos Aires. === Governors of Buenos Aires Province managing international relations (1827–1831) === Portrait Name Term of office Term of office Political party Notes Start Name End Political party Notes Manuel Dorrego 18 August 1827 1 December 1828 Federal Ended the Cisplatine War. Deposed and executed by Juan Lavalle. Rosa, vol. V, p.73-97 Juan Lavalle 1 December 1828 26 June 1829 Unitarian Coup d'état. Defeated in battle, resigned under siege Rosa, vol. IV, p.97-117 Juan José Viamonte 26 June 1829 6 December 1829 Federal Interim. Rosa, vol. IV, p 127-129 Juan Manuel de Rosas 6 December 1829 4 January 1831 First term. Convened the Federal Pact and waged war against the Unitarian League. Rosa, vol. IV, p. 129-171 == Argentine Confederation (1831–1861) == === Governors managing international relations (1831–1852) === Portrait Portrait Name Term of office Term of office Political party Notes Portrait Portrait Name Start End Political party Notes Juan Manuel de Rosas 4 January 1831 5 December 1832 Federal Governor of Buenos Aires Province. First term. Convened the Federal Pact and waged war against the Unitarian League. Resigned. Juan Ramón Balcarce 5 December 1832 4 November 1833 Governor of Buenos Aires Province. Ousted by the Revolution of the Restorers. Rosa. vol. IV, p. 186-196 Juan José Viamonte 4 November 1833 27 June 1834 Governor of Buenos Aires Province. Interim. Rosa, vol. IV, p. 198-204 Manuel Vicente Maza 27 June 1834 7 March 1835 Governor of Buenos Aires Province. Interim. Rosa, vol. IV, p. 206-213 Juan Manuel de Rosas 7 March 1835 3 February 1852 Governor of Buenos Aires Province with the sum of public power; it is usually considered as a coup. Second term. Waged the Argentine and Uruguayan Civil Wars, the War of the Confederation and the French and Anglo-French blockade of the Río de la Plata. Designated \"Supreme Chief of the Argentine Confederation\" in 1851. Defeated by Justo José de Urquiza at the Battle of Caseros. Resigned. Rosa, vol. IV p. 219 – vol. V p. 489 Vicente López y Planes 3 February 1852 6 April 1852 — Governor of Buenos Aires Province. Interim. From 6 April through 26 July 1852 remained as Governor of Bueros Aires Province, but without national powers. Justo José de Urquiza 6 April 1852 31 May 1852 Federal Governor of Entre Ríos Province in charge of the foreign relations of the Confederation. === Provisional Director of the Argentine Confederation (1852–1854) === Portrait Portrait Name Term of office Term of office Political party Notes Portrait Portrait Name Start End Political party Notes Justo José de Urquiza 31 May 1852 5 March 1854 Federal Simultaneously, Governor of Entre Ríos Province and of Buenos Aires Province (from 26 July 1852 to 4 September 1852). On 11 September 1852, the Province of Buenos Aires seceded from the Confederation as the State of Buenos Aires. On 1 May 1853, the current Constitution of Argentina was ratified by all the provinces, except from Buenos Aires. Mendelevich, p. 38-41 === Presidents of the Confederation (1854–1861) === Portrait Portrait Name (Birth–Death) Term of office Term of office Elections Political party Notes Vice President Portrait Portrait Name (Birth–Death) Start End Elections Political party Notes Vice President Justo José de Urquiza (1801–1870) 5 March 1854 5 March 1860 1853 Federal Indirect elections. First constitutional President of Argentina. The reincoporation of the State of Buenos Aires was negotiated after the 1859 Battle of Cepeda in the Pact of San José de Flores. Salvador María del Carril Santiago Derqui (1809–1867) 5 March 1860 5 November 1861 1860 Indirect elections. On 18 October 1860, a Constitutional reform is adopted, proclaiming the Argentine Republic. Resigned after the failure of the Pact of San José de Flores and the national government defeat to Buenos Aires Province in the Battle of Pavón. Juan Esteban Pedernera Mendelevich, p. 42-45 Juan Esteban Pedernera (1796–1886) 5 November 1861 12 December 1861 Unitarian Vice President under Derqui, assumed the presidency after his resignation. Resigned on the dissolution of the national government. == Argentine Republic (1861–present) == === Presidents (1861–present) === Portrait Name (Birth–Death) Term of office Term of office Elections Political party (Coalition) Notes Vice President Portrait Name (Birth–Death) Start End Elections Political party (Coalition) Notes Vice President Bartolomé Mitre (1821–1906) 12 December 1861 12 April 1862 — Liberal Governor of Buenos Aires Province de facto in charge of the national government after the Battle of Pavón and the resignation of Juan Esteban Pedernera. During the following months, the provinces gave Mitre different powers. rowspan=3 Bartolomé Mitre (1821–1906) 12 April 1862 2 June 1862 — Liberal Appointed himself by decree as \"Governor of Buenos Aires Province in charge of the National Executive Power\". Bartolomé Mitre (1821–1906) 2 June 1862 12 October 1862 — Liberal The National Congress appointed the Governor of Buenos Aires as the person in charge of the National Executive Power until elections were held. Bartolomé Mitre (1821–1906) 12 October 1862 12 October 1868 1862 Liberal Nacionalist Indirect elections with Mitre as the only candidate. First president of the unified country. Waged the War of the Triple Alliance. Marcos Paz (Died 2 January 1868) Acting President of Argentina from 12 June 1865 until 2 January 1868. Mendelevich, p.46-52 Bartolomé Mitre (1821–1906) 12 October 1862 12 October 1868 1862 Liberal Nacionalist Indirect elections with Mitre as the only candidate. First president of the unified country. Waged the War of the Triple Alliance. Mendelevich, p.46-52 Domingo Faustino Sarmiento (1811–1888) 12 October 1868 12 October 1874 1868 — Indirect elections. Ended the War of the Triple Alliance. Adolfo Alsina Nicolás Avellaneda (1837–1885) 12 October 1874 12 October 1880 1874 National ↓ PAN Indirect elections. Federalization of Buenos Aires City in September 1880. Mariano Acosta Julio Argentino Roca (1843–1914) 12 October 1880 12 October 1886 1880 PAN Indirect elections. First term. End of the Argentine Civil Wars. Francisco Bernabé Madero Mendelevich, p. 53-56 Miguel Ángel Juárez Celman (1844–1909) 12 October 1886 6 August 1890 1886 PAN Indirect elections. Resigned following the Revolution of the Park. Carlos Pellegrini Mendelevich, p. 57-65 Carlos Pellegrini (1846–1906) 6 August 1890 12 October 1892 1886 PAN Vice President under Juárez Celman, assumed the presidency after his resignation. Finished the presidential period 1886–1892. Luis Sáenz Peña (1822–1907) 12 October 1892 22 January 1895 1892 PAN Indirect elections. Government victory in the Revolution of 1893. Resigned. José Evaristo Uriburu Mendelevich, p. 66-72 José Evaristo Uriburu (1831–1914) 22 January 1895 12 October 1898 1892 PAN Vice President under Sáenz Peña, assumed the presidency after his resignation. Finished the presidential period 1892–1898. Julio Argentino Roca (1843–1914) 12 October 1898 12 October 1904 1898 PAN Indirect elections. Second term. Norberto Quirno Costa Mendelevich, p. 73-79 Manuel Quintana (1835–1906) 12 October 1904 12 March 1906 † 1904 PAN Indirect elections. Government victory in the Revolution of 1905. Died in office. José Figueroa Alcorta Mendelevich, p. 80-88 José Figueroa Alcorta (1860–1931) 25 January 1906 12 March 1906 1904 PAN Vice President under Quintana. Acting president during his illness. José Figueroa Alcorta (1860–1931) 12 March 1906 12 October 1910 1904 PAN Vice President under Quintana, assumed the presidency after his death. Finished the presidential period 1904–1910. Roque Sáenz Peña (1851–1914) 12 October 1910 9 August 1914 † 1910 PAN Modernist Indirect elections. Promoted the Sáenz Peña law, which allowed secret, universal and mandatory suffrage. Died in office. Victorino de la Plaza Mendelevich, p. 89-101 Victorino de la Plaza (1840–1919) 9 August 1914 12 October 1916 1910 PAN Vice President under Sáenz Peña, assumed the presidency after his death. Finished the presidential period 1910–1916. Hipólito Yrigoyen (1852–1933) 12 October 1916 12 October 1922 1916 UCR Free indirect elections. First president elected under the Sáenz Peña law. First term. Maintained neutrality during World War I. Pelagio Luna (Died 25 June 1919) Mendelevich, p. 102-112 Hipólito Yrigoyen (1852–1933) 12 October 1916 12 October 1922 1916 UCR Free indirect elections. First president elected under the Sáenz Peña law. First term. Maintained neutrality during World War I. Mendelevich, p. 102-112 Marcelo Torcuato de Alvear (1868–1942) 12 October 1922 12 October 1928 1922 UCR Free indirect elections. Elpidio González Hipólito Yrigoyen (1852–1933) 12 October 1928 6 September 1930 1928 UCR Free indirect elections. Second term, ousted from office by a coup d'état. Enrique Martínez Mendelevich, p. 113-125 Enrique Martínez (1887–1938) 5 September 1930 6 September 1930 — UCR Vice President under Yrigoyen. Acting president during his illness. Ousted from office by a coup d'état. José Félix Uriburu (1868–1932) 6 September 1930 20 February 1932 — Military First coup d'état in modern Argentine history. Beginning of the Infamous Decade. Called for elections. Enrique Santamarina (Resigned 20 October 1930) Mendelevich, p. 126-129 José Félix Uriburu (1868–1932) 6 September 1930 20 February 1932 — Military First coup d'état in modern Argentine history. Beginning of the Infamous Decade. Called for elections. Mendelevich, p. 126-129 Agustín Pedro Justo (1876–1943) 20 February 1932 20 February 1938 1931 UCR-A (Concordancia) Indirect elections held with fraud and with the UCR barred from elections. Julio Argentino Pascual Roca Mendelevich, p. 130-135 Roberto Marcelino Ortiz (1886–1942) 20 February 1938 27 June 1942 1937 UCR-A (Concordancia) Indirect elections held with fraud. Resigned for health reasons, died one month later. Ramón Castillo Mendelevich, p. 136–155 Ramón Castillo (1873–1944) 3 July 1940 27 June 1942 1937 PDN (Concordancia) Vice President under Ortiz. Acting president during his illness. Ramón Castillo (1873–1944) 27 June 1942 4 June 1943 1937 PDN (Concordancia) Vice President under Ortiz, assumed the presidency after his resignation. Deposed in a coup d'état. End of the Infamous Decade. rowspan=2 Arturo Rawson (1885–1952) 4 June 1943 7 June 1943 — Military Coup d'état. Beginning of the Revolution of '43. Ousted from office. Mendelevich, p. 145 Pedro Pablo Ramírez (1884–1962) 7 June 1943 9 March 1944 — Military Coup d'état. On 25 February 1944, Ramírez temporarily delegated powers to Edelmiro Farrell. Resigned. Sabá Sueyro (Died 15 October 1943) Pedro Pablo Ramírez (1884–1962) 7 June 1943 9 March 1944 — Military Coup d'état. On 25 February 1944, Ramírez temporarily delegated powers to Edelmiro Farrell. Resigned. Edelmiro Julián Farrell Edelmiro Julián Farrell (1887–1980) 25 February 1944 9 March 1944 — Military Vice President under Ramírez. Acting president. Edelmiro Julián Farrell (1887–1980) 9 March 1944 4 June 1946 — Military Declared war on the Axis powers. Called for elections. End of the Revolution of '43. Edelmiro Julián Farrell (1887–1980) 9 March 1944 4 June 1946 — Military Declared war on the Axis powers. Called for elections. End of the Revolution of '43. Juan Perón (8 July 1944–10 October 1945) Edelmiro Julián Farrell (1887–1980) 9 March 1944 4 June 1946 — Military Declared war on the Axis powers. Called for elections. End of the Revolution of '43. Juan Pistarini Juan Perón (1895–1974) 4 June 1946 4 June 1952 1946 Labour (UCR-JR) (Independent Party) Free indirect elections. First term. Reelection enabled by the Constitution of 1949. Hortensio Quijano (Died 3 April 1952) Mendelevich, p. 156-176 Juan Perón (1895–1974) 4 June 1946 4 June 1952 1946 Labour (UCR-JR) (Independent Party) Free indirect elections. First term. Reelection enabled by the Constitution of 1949. rowspan=2 Mendelevich, p. 156-176 Juan Perón (1895–1974) 4 June 1952 21 September 1955 1951 Peronist Free direct elections. Second term. First election to allow women's suffrage. Victory with 62.49% of votes, highest victory in Argentine elections. Ousted from office by a coup d'état. Mendelevich, p. 156-176 Juan Perón (1895–1974) 4 June 1952 21 September 1955 1951 Peronist Free direct elections. Second term. First election to allow women's suffrage. Victory with 62.49% of votes, highest victory in Argentine elections. Ousted from office by a coup d'état. Alberto Teisaire (7 May 1954–16 September 1955) Mendelevich, p. 156-176 Juan Perón (1895–1974) 4 June 1952 21 September 1955 1951 Peronist Free direct elections. Second term. First election to allow women's suffrage. Victory with 62.49% of votes, highest victory in Argentine elections. Ousted from office by a coup d'état. rowspan=2 Mendelevich, p. 156-176 Eduardo Lonardi (1896–1956) 16 September 1955 23 September 1955 — Military Coup d'état. Beginning of the Revolución Libertadora. By decree appointed himself as \"Provisional President of the Nation\"; from 19 September 1955 until 23 September 1955, the office was disputed with José Domingo Molina Gómez, the leader of the military junta. Mendelevich, p. 177-186 23 September 1955 13 November 1955 Lonardi is sworn in as president. Ousted from office. Isaac Rojas — Military Pedro Eugenio Aramburu (1903–1970) Isaac Rojas 13 November 1955 1 May 1958 — Military Coup d'état. The 1949 Constitution is repealed and the 1853 Constitution is restored. End of the Revolución Libertadora. Called for elections with Peronism barred from elections. Arturo Frondizi (1908–1995) 1 May 1958 29 March 1962 1958 UCRI Indirect elections with Peronism barred from elections. Ousted from office by a coup d'état. Alejandro Gómez (Resigned 18 November 1958) Mendelevich, p. 187-195 Arturo Frondizi (1908–1995) 1 May 1958 29 March 1962 1958 UCRI Indirect elections with Peronism barred from elections. Ousted from office by a coup d'état. rowspan=2 Mendelevich, p. 187-195 José María Guido (1910–1975) 29 March 1962 12 October 1963 — UCRI Provisional President of the Senate exercising the Executive Power, as the civil procedures to replace the deposed president were followed and Vice President Alejandro Gómez had resigned in 1958. Mendelevich, p. 193 Arturo Umberto Illia (1900–1983) 12 October 1963 28 June 1966 1963 UCRP Indirect elections with Peronism barred from elections. Ousted from office by a coup d'état. Carlos Humberto Perette Mendelevich, p. 196-214 Junta of Commanders of the Armed Forces 28 June 1966 29 June 1966 — Military rowspan=6 Juan Carlos Onganía (1914–1995) 29 June 1966 8 June 1970 — Military Coup d'état. Ousted from office. Junta of Commanders of the Armed Forces 8 June 1970 18 June 1970 — Military Roberto Marcelo Levingston (1920–2015) 18 June 1970 23 March 1971 — Military Appointed by the Military Junta. Ousted from office. Junta of Commanders of the Armed Forces 23 March 1971 26 March 1971 — Military Alejandro Agustín Lanusse (1918–1996) 26 March 1971 25 May 1973 — Military Appointed by the Military Junta. End of the Argentine Revolution. Called for elections. Peronism ban lifted. Héctor José Cámpora (1909–1980) 25 May 1973 13 July 1973 March 1973 PJ (FREJULI) Free direct elections. Because no candidate was able to get 50% of the votes needed to win, a runoff should have taken place between Cámpora and Ricardo Balbín, but Balbín decided to withdraw his candidacy, making Cámpora president. First Peronist president after the ban. Cámpora annulled the ban that remained specifically over Juan Perón, and resigned along with his vice president. Vicente Solano Lima Mendelevich, p. 215-228 Raúl Alberto Lastiri (1915–1978) 13 July 1973 12 October 1973 — PJ (FREJULI) President of the Chamber of Deputies exercising the Executive Power. Alejandro Díaz Bialet, President of the Senate and ahead of Lastiri in the succession line, was on a diplomatic mission in Africa at that time. Mendelevich, p. 223 Juan Perón (1895–1974) 12 October 1973 1 July 1974 † Sept. 1973 PJ (FREJULI) Free direct elections. Third term. Died in office. Isabel Perón Isabel Perón (born 1931) 29 June 1974 1 July 1974 Sept. 1973 PJ (FREJULI) First Lady and Vice President under Juan Perón. Acting president during his illness. Mendelevich, p. 229-235 Isabel Perón (born 1931) 1 July 1974 24 March 1976 Sept. 1973 PJ (FREJULI) Vice President of Juan Perón, assumed the presidency after his death. First female president in the Americas. From 13 September 1975 until 16 October 1975, Provisional President of the Senate Ítalo Argentino Luder exercised the Executive Power, due to the health problems of the president. She got ousted from office by a coup d'état. rowspan=9 Mendelevich, p. 229-235 Military Junta 24 March 1976 29 March 1976 — Military Jorge Rafael Videla (1925–2013) 29 March 1976 29 March 1981 — Military Coup d'état. President of the Military Junta. Longest government of a de facto ruler. Mendelevich, p. 236-241 Roberto Eduardo Viola (1924–1994) 29 March 1981 11 December 1981 — Military Appointed by Videla as President of the Military Junta. Powers and duties suspended on 21 November 1981 due to health problems. Ousted from office. Horacio Tomás Liendo (1924–2007) 21 November 1981 11 December 1981 — Military Appointed by the Military Junta. Acting president during Viola suspension. Carlos Lacoste (1929–2004) 11 December 1981 22 December 1981 — Military Appointed by the Military Junta. Interim. Leopoldo Galtieri (1926–2003) 22 December 1981 18 June 1982 — Military Appointed by the Military Junta. Waged the Falklands War. Ousted from office. Alfredo Oscar Saint Jean (1926–1987) 18 June 1982 1 July 1982 — Military Appointed by the Military Junta. Interim. Reynaldo Bignone (1928–2018) 1 July 1982 10 December 1983 — Military Appointed by the Military Junta. End of the National Reorganization Process. Called for elections. (Presidency) Raúl Alfonsín (1927–2009) 10 December 1983 8 July 1989 1983 UCR Free indirect elections. The 1989 presidential elections were anticipated. Resigned during the transition and gave power to Carlos Menem six months in advance. Víctor Hipólito Martínez Mendelevich, p. 242-245 (Presidency) Carlos Menem (1930–2021) 8 July 1989 8 July 1995 1989 PJ (FREJUPO) Free indirect elections. First term. The 1994 amendment reduced the presidential term from 6 to 4 years and allowed a single consecutive reelection. Eduardo Duhalde (Resigned 10 December 1991) Mendelevich, p. 247-252 (Presidency) Carlos Menem (1930–2021) 8 July 1989 8 July 1995 1989 PJ (FREJUPO) Free indirect elections. First term. The 1994 amendment reduced the presidential term from 6 to 4 years and allowed a single consecutive reelection. Mendelevich, p. 247-252 (Presidency) Carlos Menem (1930–2021) 8 July 1995 10 December 1999 1995 PJ (UCeDe) Free direct elections. Second term. His term was extended to 10 December 1999 according to the Tenth Temporary Provision of the Constitution of 1994. Carlos Ruckauf Mendelevich, p. 247-252 (Presidency) Fernando de la Rúa (1937–2019) 10 December 1999 21 December 2001 1999 UCR (Alianza) Free direct elections. Faced a severe economic crisis. Resigned after the December 2001 riots. Because his Vice President Carlos Álvarez had resigned in October 2000, the Congress Assembled selected a new president. Carlos Álvarez (Resigned 6 October 2000) Mendelevich, p. 253-262 (Presidency) Fernando de la Rúa (1937–2019) 10 December 1999 21 December 2001 1999 UCR (Alianza) Free direct elections. Faced a severe economic crisis. Resigned after the December 2001 riots. Because his Vice President Carlos Álvarez had resigned in October 2000, the Congress Assembled selected a new president. rowspan=5 Mendelevich, p. 253-262 Ramón Puerta (born 1951) 21 December 2001 23 December 2001 — PJ Provisional President of the Senate exercising the Executive Power. Adolfo Rodríguez Saá (born 1947) 23 December 2001 30 December 2001 — PJ Elected by the Congress for three months, with instructions to call for elections. Resigned. Mendelevich, p. 263-277 Eduardo Camaño (born 1946) 30 December 2001 2 January 2002 — PJ President of the Chamber of Deputies exercising the Executive Power. Eduardo Duhalde (born 1941) 2 January 2002 25 May 2003 — PJ Elected by the Congress, with instructions to complete De la Rúa's term. Called early elections for 27 April 2003. (Presidency) Néstor Kirchner (1950–2010) 25 May 2003 10 December 2007 2003 PJ (FPV) Free direct elections. Initially completed the remaining months of De la Rúa's term until 10 December 2003 then began his own mandate. Kirchner finished second to Carlos Menem in the first round and because no one was able to get 45% of the votes needed to win, a runoff should have taken place, but Menem decided to withdraw his candidacy, making Kirchner president. Daniel Scioli Mendelevich, p. 278-282 (Presidency) Cristina Fernández de Kirchner (born 1953) 10 December 2007 10 December 2011 2007 PJ (FPV) Free direct elections. First term. First elected female president of Argentina. Julio Cobos Mendelevich, p. 283-292 (Presidency) Cristina Fernández de Kirchner (born 1953) 10 December 2011 10 December 2015 2011 PJ (FPV) Free direct elections. Second term. By judicial ruling, her mandate ended 9 December 2015 at midnight. Amado Boudou Federico Pinedo (born 1955) 10 December 2015 10 December 2015 — PRO (Cambiemos) Provisional President of the Senate exercising the Executive Power. Acting president from 00:00 hs. until Macri's swearing in at 11:45 hs. (Presidency) Mauricio Macri (born 1959) 10 December 2015 10 December 2019 2015 PRO (Cambiemos) Free direct elections. First president elected in a ballotage, defeating Daniel Scioli. Although his mandate begun on 10 December 2015 at 00:00 hs., it was only after he swore in the Congress at 11:45 hs. that he took office as president. Gabriela Michetti (Presidency) Alberto Fernández (born 1959) 10 December 2019 10 December 2023 2019 PJ (FdT) Free direct elections. Cristina Fernández de Kirchner (Presidency) Javier Milei (born 1970) 10 December 2023 Incumbent 2023 PL (LLA) Free direct elections. First libertarian head of state in the world. Victoria Villarruel ==Living former presidents== File:Ma. Estela Martinez Cartas de Peron.jpg|Isabel Perón 1974–1976 File:Asunción Rodríguez Saá.jpg|Adolfo Rodríguez Saá 2001 File:Eduardo duhalde presidente.jpg|Eduardo Duhalde 2002–2003 File:Cristina Fernández de Kirchner 2011-12-10.jpg|Cristina Fernández de Kirchner 2007–2015 File:Macri Independencia3 (recorte).jpg|Mauricio Macri 2015–2019 File:Alberto fernandez presidente (cropped).jpg|Alberto Fernández 2019–2023 ==References== ==Notes== Category:Government of Argentina",
 "title": "President of Argentina"
}