{
 "id": "341882",
 "text": ", also known as Noboyuki Abe, was a general in the Imperial Japanese Army, Governor-General of Korea, and 36th Prime Minister of Japan from August 30, 1939 to January 16, 1940.Nussbaum, Louis-Frédéric. (2005). \"Abe Nobuyuki\" in Japan Encyclopedia, p. 3. thumb | right thumb | right ==Early life== Abe was born into an ex-samurai family in Kanazawa city, Ishikawa Prefecture. Abe attended Tokyo No.1 Middle School (Tokyo Metropolitan Hibiya High School) followed by No.4 High School. While still a student, he volunteered for military service during the First Sino-Japanese War. After the war, Abe graduated from the Imperial Japanese Army Academy. He was part of the 19th class of the Army War College. ==Military career== Abe became commander of the 3rd Field Artillery Regiment from 1918-1921. In August 1918, his regiment was sent to Siberia during Japan's Siberian Intervention, but was never in combat. Abe was appointed commander of the 4th Infantry Division on December 22, 1930.Generals.dk, \"Generals from Japan: Abe, Nobuyuki\"; retrieved 2012-4-29. He later served as instructor in the Army War College followed by chief of the Military Affairs Bureau and as Vice Minister of the Army. In 1933, Abe was promoted to full general. He was Commander-in-Chief of the Taiwan Army. In 1936, he was placed on the reserve list. thumb | right | Poster ==Politician== Abe Nobuyuki became 36th Prime Minister on August 30, 1939. Prime Minister of Japan and Cabinet (Kantei), \"Prime Ministers in History, 31st-60th (1934-1964)\"; retrieved 2011-4-29. Abe was replaced by Mitsumasa Yonai in January 1940. Abe joined the House of Peers in 1942. He was appointed the 10th (and last) Governor-General of Korea in 1944 and 1945. After World War II, Abe was arrested by the Americans under General Douglas MacArthur. He was not charged with any war crimes and he was soon released. ==Related pages== * Shōwa period ==References== ==Other websites== |- |- Category:1875 births Category:1953 deaths Category:Japanese generals Category:Former dictators Category:People from Ishikawa Prefecture Category:Prime ministers of Japan Category:Foreign ministers of Japan",
 "title": "Nobuyuki Abe"
}