{
 "id": "342043",
 "text": "\"Hollaback Girl\" is the third single off American singer Gwen Stefani's first solo studio album Love. Angel. Music. Baby. The song was released on February 8, 2005. It is a hip hop and R&B; song, with RateYourMusic describing it as dance-pop and pop rap. ==Background and writing== While writing the song, Stefani and Pharrell Williams discussed about writing a song on her intentions for pursuing a solo career. Stefani then said that the album was missing an \"attitude song\", and she remembered a negative comment that musician Courtney Love had said about her in an interview with magazine Seventeen. ::\"Being famous is just like being in high school. But I'm not interested in being the cheerleader. I'm not interested in being Gwen Stefani. She's the cheerleader, and I'm out in the smoker shed.\" Stefani then responded to Love's comment in the March 2005 issue of the NME: ::\"Y'know someone one time called me a cheerleader, negatively, and I've never been a cheerleader. So I was, like, \"OK, fuck you. You want me to be a cheerleader? Well, I will be one then. And I'll rule the whole world, just you watch me.\" On the Billboard charts, \"Hollaback Girl\" was able to peak at #1 on Hot 100, #1 on the Pop 100, #8 on the Hot R&B;/Hip-Hop Songs, #15 on the Hot Dance Club Play, and #18 on the Adult Pop Songs charts. In 2006, the song was nominated for a Grammy Award in the categories of Best Female Pop Vocal Performance and Record of the Year. ==Charts== ===Weekly charts=== Chart (2005–2006) Peak position Canada (Nielsen SoundScan) 12 Canada CHR/Pop Top 30 (Radio & Records) 1 Europe (European Hot 100 Singles) 5 Greece (IFPI Greece) 13 US Pop 100 (Billboard) 1 ===Year-end charts=== Chart (2005) Position Australia (ARIA) 21 Austria (Ö3 Austria Top 40) 39 Belgium (Ultratop 50 Flanders) 44 Belgium (Ultratop 50 Wallonia) 67 Europe (European Hot 100 Singles) 44 Germany (Official German Charts) 41 Netherlands (Dutch Top 40) 54 Netherlands (Single Top 100) 64 New Zealand (Recorded Music NZ) 19 Romania (Romanian Top 100) 52 Sweden (Sverigetopplistan) 29 Switzerland (Schweizer Hitparade) 34 UK Singles (Official Charts Company) 47 US Billboard Hot 100 2 US Hot R&B;/Hip-Hop Songs (Billboard) 55 US Pop 100 (Billboard) 2 ===Decade-end charts=== Chart (2000–09) Position US Billboard Hot 100 41 ===All-time charts=== Chart (1958–2018) Position US Billboard Hot 100 258 ==Music video== The music video for \"Hollaback Girl\" was directed by Paul Hunter and filmed in January 2005. the Van Nuys and Reseda neighborhoods of Los Angeles, California. It opens with a scene of Stefani taking a picture of her four Harajuku Girls, when a crowd of students appears. Stefani and the Harajuku Girls then drive down Sherman Way past Magnolia Science Academy to Birmingham High School in a 1961 Chevrolet Impala, accompanied by the crowd. Stefani and the group cause a commotion when they disrupt a football game by walking onto the field and when they go to a 99 Cents Only Store and throw cereal and other food products down an aisle. Throughout the video, there are intercut sequences of choreographed dancing filmed in a sound stage, intended to represent Stefani's imagination. Stefani and the Harajuku Girls are outfitted in cheerleading uniforms, accompanied by several Californian spirit groups: the Orange Crush All Stars, a cheerleading squad from Orange County; a marching band from Fountain Valley High School in Fountain Valley; a pep flag team named the Carson High School Flaggies from Carson; and a drill team from Stephen M. White Middle School in Carson. To visualize the song's bridge, the Harajuku Girls spell the word \"bananas\" with cue cards. The video ends with a close-up frame of Stefani with her arms in the air. The Chevy Impala convertible from the video includes a painting by artist J. Martin.The design includes Stefani as seen on the album cover of Love. Angel. Music. Baby. with the words \"Hollaback Girl\" in calligraphy. The car was, eventually, sold on eBay. Pharrell, one of the song's co-producers, makes a cameo appearance. The complete version of \"Hollaback Girl\" featured in the music video was released commercially through CD singles and digital downloads. Some include remixes by Diplo and former No Doubt bandmate Tony Kanal. ==References== ==Other websites== * * Category:2004 songs Category:2005 songs Category:Billboard Hot 100 number one songs Category:Gwen Stefani songs Category:Hip hop songs Category:R&B; songs Category:Dance-pop songs",
 "title": "Hollaback Girl"
}