{
 "id": "342144",
 "text": "__NOTOC__ Year 200 BC was a year of the pre-Julian Roman calendar. == Events == === By place === ==== Seleucid Empire ==== * Antiochus III's forces continue their invasion of Coele Syria and Palestine. ==== Greece ==== * Philip V of Macedon's fleet defeat the Rhodians at Lade. His forces then advance into Pergamum, plundering Pergamese territory and attacking cities in Caria. * The Acarnanians, with Macedonian support, invade Attica. * The Roman ambassador to Greece, Syria, and Egypt, Marcus Aemilius Lepidus delivers an ultimatum to Philip V warning Macedonia not to make war on any Greek state. Philip decides to reject the Roman ultimatum and the Romans declare war on Macedon, thus starting the Second Macedonian War. * The Roman consul, Publius Sulpicius Galba Maximus, asks Attalus I and his fleet to meet up with the Roman fleet off the Greek Aegean coast and they conduct a naval campaign against Philip V, harassing Macedonian possessions in and along the Aegean. ==== Roman Republic ==== * Roman forces defeat the Gauls of Cisalpine Gaul in the Battle of Cremona. * The bacchanalia are wild and mystic festivals of the Roman god Bacchus which are introduced into Rome from lower Italy by way of Etruria (approximate date). ==== Bactria ==== * Euthydemus I of the Greco- Bactrian Kingdom dies and is succeeded by his son Demetrius I of Bactria (approximate date). ==== South America ==== * The city of Tiwanaku is founded as a village near Lake Titicaca in modern Bolivia (approximate date). * The Early Horizon period in the Andes comes to an end as the Chavin culture vanishes and is succeeded by the Nazca culture (approximate date). ==== China ==== * The construction of the Wei-Yang Palace in the Han Dynasty capital (Chang'an) begins. * The Hsiung-nu appear on the western borders of China. * The Han emperor Gaozu is defeated by the Xiongnu in the Battle of Baideng. * The Great Wall of China was completed. === By topic === ==== Art ==== * Alexander the Great, head from a Hellenistic copy of a statue, possibly after a 4th century BC original by Lysippos is made. It is now kept at the Archeological Museum in Istanbul, Turkey. * Lost-wax casting is known in China and Mesopotamia (approximate date). * Roman artists begin trying to produce the illusion of thin slabs of colored marble covering the walls, which are set off by actual architectural moldings and columns, in private houses. These attempts last for 120 years. ==== Astronomy ==== * The first good measurement of the distance between Earth and the Sun is made by Eratosthenes (approximate date). By studying lunar eclipses, his result is roughly 150 000 000 km. The currently accepted value is 149 597 870 691 ± 30 metres. == In fiction == * This year is used as the fourth time world (Amazon Jungle) in the video game The Lost Vikings II. * The Tribunal in Marianne Curley's Guardians of Time Trilogy is set up near Athens. == Births == * Jia Yi, Chinese statesman and poet (d. 169 BC) == Deaths == * Euthydemus I, King of the Greco-Bactrian Kingdom from 223 BC (approximate date) Category:200s BC",
 "title": "200 BC"
}