{
 "id": "342274",
 "text": "The Yazidi (also Yezidi) are an ancient Kurdish ethnoreligious group with Iranian peoples roots. They are a separate branch of the Abrahamic religion tree. Their religion blends monotheism with Zoroastrianism and the religions of ancient Mesopotamia. Infant boy circumcision and Infant baptism are practised. The Yazidis live in the Nineveh province of northern Iraq, alongside the Christian Assyrians. In Asia, there are other Yazidi communities in Transcaucasia, Armenia, Turkey, and Syria. Still, they have been fewer since the 1990s, with most of their members emigrating to Europe, mainly Germany. == Demοraphy == Historically, Yazidis originally lived in communities in what are now Iraq, Syria, and Turkey, and there were notable populations in Armenia and Georgia. However, the events of the 20th century brought about significant demographic changes in these regions and mass migration. As a result, the actual number of Yazidis is not clear in many areas, and estimates of the size of their total population vary. === Iraq === The majority of Yazidis reside in Iraq, where they form a notable minority. Estimates of their population in the country vary widely, ranging from 70,000 to 500,000. The largest Yazidi communities are located in Shehan, northeast of Mosul, and Sinjar, near the Iraq-Syria border, 80 km west of Mosul. In Shekhan, the temple of Sheikh Adi ibn Mousafir is situated in Lalish. Throughout the 20th century, the Shekhan community vied for dominance against the more traditional Sinjar community. The demographic landscape of Iraq's Yazidis may have changed considerably since the onset of the Iraq War in 2003 and the subsequent fall of Saddam Hussein's regime. === Syria === In Syria, Yazidis are found in two main communities: one in the Jazira region and the other in Qurd-Dag. The exact number of Yazidis in Syria is uncertain. In 1963, their population was estimated at about 10,000 according to the census, but figures from the 1987 census are difficult to obtain. Currently, it is estimated that there are between 12,000 and 15,000 Yazidis in Syria, although over half are believed to have emigrated during the 1980s. Adding to the complexity of these estimates are the 50,000 Yazidi refugees who arrived from Iraq due to the 2003 war. Since 2014, more Yazidis from Iraq have sought refuge in the Autonomous Administration of North and East Syria to escape the genocide of Yazidis by ISIL. Although, in October 2019 Turkey invaded the north eastern part of Syria; several Yazidi villages have been targeted and their inhabitants fled to the region still under the control of the AANES. === Turkey === The Yazidis living in Turkey, from the time after the dissolution of the Ottoman Empire, and during and after the second half of the 20th century gradually left for European countries. Yazidis were massacred alongside Armenians, Assyrians and Pontic Greeks during the Armenian genocide in 1915 and 1916, which then led to many Yazidis fleeing, even though Turkey denies the genocide. During the genocide there was the slogan \"Those who kill 7 Armenians will go to Heaven\" and also the version \"Those who kill 7 Yazidis will go to Heaven\" were used. According to Aziz Tamoyan, over 300,000 Yazidis were killed with the Armenians, while others fled to Transcaucasia. In the 1980s, there were 60,000 Yazidis situated in Beşiri, Kurtalan, Bismil, Midyat, Idil, Cizre, Nusaybin, Viranşehir, Suruç and Bozova. By 1982 it had declined to 30,000 people and by 2009 there were fewer than 500 Yazidis left. Most of them emigrated to Europe and especially to Germany. Those who remained lived mainly in the region of Tur Abdin. Today, these places are almost empty due to exodus to Europe which was provoked by political, religious and economic difficulties. === Armenia/Georgia === Many Yazidis came to the Russian Empire (now the territory of Armenia and Georgia) under their leader Temur Agha during the 19th and early 20th centuries to escape religious persecution. They were oppressed by the Ottoman Turks and the Sunni Kurds who tried to convert them to Islam. The Yazidis were massacred alongside the Armenians during the Armenian genocide, causing many to flee to Russian-held parts of Armenia. While Yazidis ,then, were counted as Kurds in censuses for much of the Soviet period, they are currently recognized as a separate ethnic group in Armenia. According to the 2011 census, around 35,000 Yazidis live in Armenia. The number of Yazidis in Georgia peaked in the 1980s and numbered more than 30,000 people. However, since the 1990s, due to the difficult economic situation in the country, the number of Yazidis living in Georgia began to decline. Yazidi community migrated mainly to neighboring Russia, Western Europe and North America. Today there are about 8,000 Yazidis living in Georgia, they are concentrated mainly in the capital, in the city of Tbilisi and in the southern regions of Samtskhe-Javakheti and Kvemo Kartli. To sum up, this mass migration led to the existence of a large diaspora. The most important is in Germany, where the Yazidi community numbers over 40,000 people. Most are from Turkey and more recently from Iraq, living in the western German states of North Rhine- Westphalia and Lower Saxony. Since 2008, Sweden has seen a significant increase in its Yazidi immigrant community, which now reached 4,000 people in 2010. In the Netherlands, there is also a smaller Yazidi community. Other Yazidi Diaspora communities exist in Belgium, Denmark, France, France, Switzerland, the United Kingdom, the United States, Canada and Australia. The total population in all these countries is probably less than 5,000. == Religion == Their religion is Yazidism. Yazīdī mythology says that they were created quite separately from the rest of humankind, being created from Adam but not from Eve, and as such they seek to keep themselves segregated from the people among whom they live. The Yazidis believe in a single god who created the world. They believe that he placed the world under the care of seven holy beings or angels. The main angel is Melek Taus, the peacock angel. Throughout their history, the Yazidi people have been through continuous violence because of their religion in the face of severe Islamic persecution and attempts to force them to convert to Islam and \"Arabize\" them by the Ottoman Empire and later in the 20th century by Iraq. The Yazīdī religious centre and object of the annual pilgrimage is the tomb of Sheikh ʿAdī, in the town of Lālish, Iraq. Two short books, Kitāb al-jilwah (“Book of Revelation”) and Maṣḥafrash (“Black Book”), form the sacred scriptures of the Yazīdīs. Yazidis began to face accusations of devil worship from Muslims beginning in the late 16th and early 17th centuries. While the Yazidis believe in one god, a central figure in their faith is Tawusî Melek, an angel who defies God and serves as an intermediary between man and the divine. To Muslims, the Yazidi account of Tawusî Melek often sounds like the Quranic rendering of Shaytan—the devil—even though Tawusî Melek is a force for good in the Yazidi religion. == Persecution of Yazidis == In August 2014 ISIS conducted a coordinated attack on the Yazidi population of the Mount Sinjar area,Iraq. As a result, the entirety of this Yazidi population was displaced, and an estimated total of 3,100 Yazidis were killed (approximately half were executed, and the rest died whilst fleeing) and 6,800 were kidnapped and subjected to numerous abuses, including torture and forced religious conversion. ISIS permanently sought to erase the Yazidis through killing, sexual slavery, enslavement, torture, inhuman and degrading treatment. ==References==",
 "title": "Yazidis"
}