{
 "id": "342266",
 "text": "The Kingdom of the Two Sicilies () was a kingdom in southern Italy from 1816 until 1861. It was created by Ferdinand I of the Two Sicilies, after the Congress of Vienna of 1814, by uniting the Kingdom of Sicily and the Kingdom of Naples, which had been ruled by Joseph Bonaparte who conferred the title \"Prince of Naples\" to be hereditary on his children and grandchildren, during the reign of Napoleon. The ruling dynasty was a cadet branch of the House of Bourbon. The capital of the kingdom was Naples. Roman Catholicism was the state religion. The kingdom was full of corruption and poverty: mainly because of this, most of the population welcomed the Risorgimento with the unification of southern Italy to the rest of Italy in 1861. In 1861, Giuseppe Garibaldi and his men, who were known as \"red shirts\", captured Sicily. This was welcomed by the local population. Garibaldi then crossed the Strait of Messina and captured Naples. South Italy and Sicily then joined the Kingdom of Italy. ==Administrative division== The peninsula was divided into fifteen \"departments\" and the island of Sicily was divided into seven departments. The island itself had a special administrative status, with its base at Palermo. After the Two Sicilies were conquered by Garibaldi, the departments became provinces of Italy. ==Royal family== For a time the heir to the throne was given the title of \"Hereditary Prince of Naples\". But this was later changed to the Duke of Calabria after the uniting of the two kingdoms. Collectively the royal family generally lived at the Palace of Caserta. Children of the monarch were born with the style of Royal Highness as well as the title of Prince/ss of the Two Sicilies. Several males in the family were given titles such as \"Duke of Castro\", \"Count of Caserta\", \"Prince of Salerno\", a majority of which were lost due to a lack of male heirs. The present pretending monarch is Infante Carlos, Duke of Calabria, who does use the title of Duke of Calabria. . | {| class=\"wikitable sortable\" style=\"text-align:left;\" Peninsula Capital 1 Abruzzo Ultra I Teramo 2 Abruzzo Ultra II Aquila 3 Abruzzo Citra Chieti 4 Contado di Molise Campobasso 5 Terra di Lavoro Capua, from 1818 Caserta 6 Province of Naples Naples 7 Principato Ultra Avellino(*) 8 Principato Citra Salerno 9 Capitanata originally San Severo, then Foggia 10 Terra di Bari Bari 11 Terra d'Otranto Lecce 12 Basilicata Potenza 13 Calabria Citra Cosenza 14 Calabria Ultra II Catanzaro 15 Calabria Ultra I Reggio * The city of Benevento was formally included in this department, but it was occupied by the Papal States and was de facto an exclave of that country. ==References== Category:19th century in Italy Category:1816 establishments in Europe Category:1861 disestablishments Category:Former monarchies in Italy Category:House of Bourbon Category:19th-century establishments in Italy Category:1860s disestablishments in Italy",
 "title": "Kingdom of the Two Sicilies"
}