{
 "id": "342303",
 "text": "__NOTOC__ Year 336 BC was a year of the pre-Julian Roman calendar. == Events == === By place === ==== Persian Empire ==== * The young king of Persia, Arses, objects to being controlled by Bagoas and attempts to poison him. Instead, Arses and all his children are killed by Bagoas. * Bagoas then seeks to install a new monarch who will be easier to control. He chooses Codomannus, a distant relative of the royal house, who takes the name Darius III. When Darius tries to assert his independence from Bagoas' control, Bagoas attempts to poison him. The king is warned and makes Bagoas drink the poison himself. ==== Greece ==== * Following Philip II of Macedon's marriage to Eurydice, Alexander and his mother, Olympias, flee to Epirus, with Alexander later moving to Illyria. However, shortly afterward, father and son are reconciled and Alexander returns. * Macedonian troops, commanded by Parmenion, trusted lieutenant of Philip II, arrive in Asia Minor. They are driven back by Persian forces under the command of the Greek mercenary Memnon of Rhodes. * At a grand celebration of his daughter Cleopatra's marriage to Alexander I of Epirus (brother of Olympias), Philip II is assassinated at Aegae by Pausanias of Orestis, a young Macedonian noble with a bitter grievance against the young queen's uncle Attalus and against Philip for denying him justice. Pausanias is killed on the spot. * Philip II of Macedon is succeeded by his son Alexander III. One of the leading generals in Macedonia at the death of Philip II, Antipater, helps to secure the succession to the Macedonian throne for Alexander. * The Macedonian general Parmenion declares for Alexander III. He helps to murder the princes of the Lynkestis region, who are alleged to be behind Philip's murder, along with other possible rivals and members of factions opposed to Alexander. Olympias, Alexander's mother, has Philip's last wife Eurydice, her infant daughter and her influential uncle, Attalus, killed. * Alexander immediately has Amyntas IV, son of King Perdiccas III and cousin of Alexander, executed. * Alexander puts down a rebellion in Macedonia and crushes the rebellious Illyrians. He then appears at the gates of Thebes and receives the city's submission. After that he advances to the Corinthian isthmus and is elected by the assembled Greeks as their commander against Persia. * Conscription is introduced in Athens. Young men are required to perform duties which are part military and part civic. * Aeschines brings a suit against Ctesiphon for illegally proposing the award of a crown to the Athenian leader Demosthenes in recognition of his services to Athens. == Deaths == * Philip II, King of Macedonia (b. 382 BC) * Arses, King of Persia * Bagoas, Vizier of Persia * Attalus, Macedonian general (b. c. 390 BC) * Pausanias of Orestis, personal bodyguard of Philip II of Macedon * Eurydice, 5th wife of Philip II, queen of Macedonia * Amyntas IV, usurper king of Macedon Category:336 BC",
 "title": "336 BC"
}