{
 "id": "342366",
 "text": "was a after Keiun and before Reiki. This period started in January 708 and ended in September 715.Nussbaum, Louis-Frédéric. (2005). \"Wadō\" in Japan encyclopedia, p. 1024. The reigning empress was .Nussbaum, \"Gemmei Tennō,\" pp. 235-236; Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 63-65; Brown, Delmer et al. (1979). Gukanshō, p. 271; Varley, H. Paul. (1980). Jinnō Shōtōki. p. 140. ==Events of the Wadō era== * 5 May 708 (Wadō 1, 11th day of the 4th month): A sample of copper from Musashi Province was given to the empress.Titsingh, p. 63. * 708 (Wadō 1, 3rd month): is named Minister of the Right (udaijin). Iso-kami Marō is given the office of Minister of the Left (sadaijin).Titsingh, p. 64. * 709 (Wadō 2, 3rd month): There was an uprising in Mutsu Province and in Echigo Province. * 709 (Wadō 2, 5th month): An ambassador was received from the Korean kingdom of Silla. * 710 (Wadō 3): Japan's capital city was established in Nara (Heijō-kyō).Nussbaum, \"Nara\" at p. 698. * 712 (Wadō 5): The Kojiki was finished.Nussbaum, \"Kojiki\" at p. 545. * 712 (Wadō 5): Dewa Province and Mutsu are separated. * 713 (Wadō 6, 3rd month): Tamba Province was separated from Tango Province. Mimasaka Province was divided from Bizen Province. Hyūga Province was divided from Ōsumi Province. * Wadō 6, 5th month, 2nd day (713): Empress orders work to begin on official reports (fudoki} about the history and geography of the provinces.Nussbaum, \"Fudoki\" at p. 194. * 713 (Wadō 6): Road between Mino Province and Shinano Province was made wider. Also, the road was made wider the Kiso District of what is today Nagano Prefecture. * 715 (Wadō 8): Empress Gemmei abdicated in favor of her daughter.Titsingh, p. 65. ==Gallery== File:Wadokaichin coin 8th century Japan.jpg|Wadōkaichin (和同開珎), copper coin minted in Wadō era ==Related pages == * Asuka period * Nara period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Wadō 1st 2nd 3rd 4th 5th 6th 7th 8th 708 709 710 711 712 713 714 715 Preceded by: Keiun Era or nengō: Wadō Succeeded by: Reiki Category:Japanese eras Category:700s establishments in Japan Category:710s disestablishments in Japan Category:700s establishments",
 "title": "Wadō (era)"
}