{
 "id": "342509",
 "text": "The 18th century BCE was the century which lasted from 1800 BCE to 1701 BCE. ==Events== * 1800 BCE: Iron Age in India * 1800 BCE: Beginning of the Nordic Bronze Age in the period system devised by Oscar Montelius. * 1800 BCE – 1300 BCE: Troy VI flourishes. * c. 1800 BCE: Sedentary Mayan communities in Mesoamerica * c. 1800 BCE: Hyksos start to settle in the Nile Delta. The capital was at Avaris. * c. 1792 BCE – 1750 BCE: (middle chronology) – Hammurabi rules Babylonia and has to deal with Mari. * c. 1792 BCE – 1750 BCE: (middle chronology) – Stela of Hammurabi, from Susa (modern Shush, Iran) is made. It is now in Musée du Louvre, Paris. * 1787 BCE – 1784 BCE: Amorite conquests of Uruk and Isin. * 1786 BCE: Egypt: Queen Sobekneferu dies. End of Twelfth Dynasty, start of Thirteenth Dynasty, start of Fourteenth Dynasty. * 1779 BCE: Zimrilim, the King of Mari, starts to rule. * 1770 BCE: Babylon, capital of Babylonia becomes the largest city of the world, taking the lead from Thebes, capital of Egypt. * 1766 BCE: Shang conquest of Xia Dynasty. China. * 1764 BCE – 1750 BCE: Wars of Hammurabi. * 1757 BCE: Mari sacked by Hammurabi. Zimrilim's palace is destroyed. * 1757 BCE: Zimrilim, the King of Mari, dies. * 1750 BCE: Hyksos occupation of Northern Egypt. * 1750 BCE: A large volcano eruption at Mount Veniaminof, Alaska. * c. 1750 BCE: Nomadic shepherds, the Aryans, enter India from Central Asia and the Russian steppes. * c. 1750 BCE: Vedic period starts in India. * c. 1750 BCE: Investiture of Zimrilim (Zimiri-Lim, King of Mari, before the Goddess Ishtar), a wall painting on mud plaster from the Zimrilim palace at Mari (modern Tell Hariri, Iraq), Court 106, is made. It is now in Musée du Louvre, Paris. * 1749 BCE – 1712 BCE: Mesopotamian Rebellions. * Early Unetice culture, beginning of the Bronze Age in Central Europe. * Minoan civilization: phase II of the Middle period (MM II). * c. 1700 BC: The last species of mammoth became extinct on Wrangel Island. * c. 1700 BC: Indus Valley Civilization comes to an end but is continued by the Cemetery H culture * c. 1700 BC: Minoan Old Palace period ends and Minoan Second Palace (Neopalatial) period starts in Crete. * c. 1700 BC: Aegean metalworkers are producing decorative objects that may be better than Ancient Near East jewelers, whose techniques they seem to borrow. * c. 1700 BC: Lila-Ir-Tash started to rule the Elamite Empire. * c. 1700 BC: Bronze Age starts in China. * c. 1700 BC: Shang Dynasty starts in China. * 1800 BCE – 1700 BCE: Decline of the Indus Valley Civilization ==Significant persons== * Hammurabi (1792 BCE–1750 BCE), ruler of the Babylonian Empire * Tang overthrew emperor Jie, last ruler of the Xia dynasty. ==Deaths== 1750 BCE—Hammurabi (middle chronology) ==Inventions, discoveries, introductions== * c. 1700 BCE—date for the building of the Phaistos Disc. Its purpose and meaning, and even its original geographical place of manufacture is unknown. This makes it one of the most famous mysteries of archaeology. ==References==",
 "title": "18th century BC"
}