{
 "id": "342768",
 "text": "Holly Hunter (born 20 March 1958) is an American actress. She was born in Conyers, Georgia. Hunter starred in The Piano for which she won the Academy Award, BAFTA and Golden Globe Award. Hunter was also nominated for Oscars for her roles in Broadcast News, The Firm, and Thirteen. She has won two Emmy Awards. Hunter has acted in many other movies.Film reference. Holly Hunter Biography (1958–) They include Copycat, Living Out Loud, O Brother, Where Art Thou?, Home for the Holidays, The Incredibles, Thirteen, and Batman v Superman: Dawn of Justice. Hunter's most outstanding television series was for the drama series Saving Grace (TV series), for which she won the Grace Allen Award, and was nominated for seven other awards. ==Filmography== Year Title Role Director Notes 1981 The Burning Sophie Tony Maylam 1984 Swing Shift Jeannie Jonathan Demme 1984 Blood Simple Helene Trend Joel Coen Ethan Coen Voice / Uncredited 1987 Raising Arizona Edwina \"Ed\" McDunnough Joel Coen Ethan Coen 1987 End of the Line Charlotte Haney Jay Russell 1987 Broadcast News Jane Craig James L. Brooks 1989 Miss Firecracker Carnelle Scott Thomas Schlamme 1989 Animal Behavior Coral Grable Jenny Bowen & Kjehl Rasmussen 1989 Always Dorinda Durston Steven Spielberg 1991 Once Around Renata Bella Lasse Hallström 1993 Ada McGrath Jane Campion Academy Award for Best Actress 1993 Tammy Hemphill Sydney Pollack 1995 Copycat M.J. Monahan Jon Amiel 1995 Home for the Holidays Claudia Larson Jodie Foster 1996 Crash Helen Remington David Cronenberg 1997 O'Reilly Danny Boyle 1998 Living Out Loud Judith Moore Richard LaGravenese 1999 Jesus' Son Mira Alison Maclean 1999 Woman Wanted Emma Riley Kiefer Sutherland 2000 Timecode Renee Fishbine Mike Figgis 2000 O Brother, Where Art Thou? Penny Wharvey McGill Joel Coen Ethan Coen 2001 Festival in Cannes Herself Henry Jaglom 2002 Moonlight Mile Mona Camp Brad Silberling 2003 Levity Adele Easley Ed Solomon 2003 Thirteen Melanie Freeland Catherine Hardwicke Also executive producer 2004 Little Black Book Barb Campbell-Dunn Nick Hurran 2004 Helen Parr / Elastigirl Brad Bird Voice 2005 Nine Lives Sonia Rodrigo García 2005 Margaret Barnell Mark Mylod 2011 Portraits in Dramatic Time Herself David Michalek & Paul Warner 2012 Won't Back Down Evelyn Riske Daniel Barnz 2012 Jackie Jackie Antoinette Beumer 2013 Paradise Mrs. Mannerhelm Diablo Cody 2014 Manglehorn Dawn David Gordon Green 2016 Batman v Superman: Dawn of Justice Senator Finch Zack Snyder 2016 Strange Weather Darcy Baylor Katherine Dieckmann 2017 Breakable You Eleanor Weller Andrew Wagner 2017 The Big Sick Beth Gardner Michael Showalter 2017 Song to Song Miranda Terrence Malick 2018 Incredibles 2 Helen Parr / Elastigirl Brad Bird Voice == References == == Other websites == * Category:American Academy Award winning actors Category:Actors from Georgia (U.S. state) Category:American movie actors Category:American television actors Category:American television producers Category:American voice actors Category:BAFTA Award winning actors Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:1958 births Category:Living people",
 "title": "Holly Hunter"
}