{
 "id": "342877",
 "text": "David Gordon \"Slim Dusty \" Kirkpatrick AO, MBE (13 June 1927 – 19 September 2003) was an Australian country music singer-songwriter and producer. He performed for nearly 70 years. Australian poets Henry Lawson and Banjo Patterson influenced his songs. Many of his songs were about Australian bush life or trucking. Dusty was the first Australian to have a number one hit song. The song was \"Pub With No Beer\", written by Gordon Parsons. He has 37 Golden Guitar and two ARIA awards. He is in the ARIA Hall of Fame and the Country Music Roll of Renown. At the time of his death at the age of 76, Dusty was working on his 106th album for EMI Records. In 2007 he sold more than seven million recordings in Australia. ==Honours and milestones== Slim Dusty was Australia's most successful and prolific musical artist. He had more Gold and Platinum albums than any other Australian artist. Slim Dusty was also: * The first Australian to receive a Gold Record. * The first Australian to have an international record hit (Pub with No Beer). * He was made a Member of the Order of the British Empire and an Officer of the Order of Australia for services to entertainment. * The first artist broadcast from space. Astronauts played his recording of Waltzing Matilda from Space Shuttle Columbia as it passed over Australia on its maiden flight in 1981. * The winner of a 36 Golden Guitar awards from 72 nominations at the Tamworth Country Music Festival. * One of the earliest members of Australia's country music Roll of Renown. * More Gold Record and Platinum Record Awards than any other Australian artist. * In the ARIA Hall of Fame and the ARIA Special Achievement Award. * Awarded Senior Australian of the Year 1999. ==References== Category:1927 births Category:2003 deaths Category:Australian country musicians Category:Australian guitarists Category:Australian singer- songwriters Category:Members of the Order of the British Empire Category:Musicians from New South Wales Category:Order of Australia Category:Australian record producers",
 "title": "Slim Dusty"
}