{
 "id": "342888",
 "text": ", also romanized as Tempyō, was a after Jinki and before Tenpyō-kanpō. This period started in August 729 and ended in April 749.Nussbaum, Louis-Frédéric. (2005). \"Tempyō\" in Japan Encyclopedia, p. 957. The reigning emperor was .Nussbaum, \"Shōmu Tennō,\" p. 884; Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 67-73; Brown, Delmer et al. (1979). Gukanshō, pp. 272-273; Varley, H. Paul. Jinnō Shōtōki, pp. 141-143. ==Events of the Tenpyō era== * 740 (Tenpyō 12, 10th month): The forces of Fujiwara no Hirotsugu are defeated in Hizen Province on the island of Kyushu.Titsingh, p. 71. * 740 (Tenpyō 12): Japan's capital city is established in Kuni-kyō.Titsingh, p. 71; 恭仁宮跡の発掘調査 (Excavations on the Kuni Palace site, Kyoto Prefectural Board of Education) ; retrieved 2012-5-4. * 741 (Tenpyō 13): The Emperor establishes Buddhist temples in the provinces of Japan. Provincial monasteries were built.Varley, pp. 141-142. * 743 (Tenpyō 15): The Emperor orders creation of a huge statue of the Buddha (daibutsu) which will be part of Tōdai-ji, Nara.Brown, p. 273; Varley, p. 141. * 744 (Tenpyō 16): Naniwa-kyō became Japan's capital. * 745 (Tenpyō 17): The capital returns to Heijō-kyō.Titsingh, p. 72. * 749 (Tenpyō 20, 4th month): Former-Empress Genshō died.Titsingh, p. 71; Varley, p. 141; Imperial Household Agency (Kunaichō), 元正天皇 (44); retrieved 2012-5-22. * 749 (Tenpyō 20): After a 25-year reign, Emperor Shōmu abdicated and took vows as a Buddhist priest.Varley, p. 143; Shomu was the first emperor to become a Buddhist priest; and Empress Komyo was the first empress to became a Buddhist nun. Shōmu's daughter receives the succession (senso). Soon after, Empress Kōken's role as monarch was confirmed (sokui).Titsingh, p. 73; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Kunaichō, Ceremony of Accession (Sokui-no-Rei); retrieved 2012-5-22. ==Gallery== Image:Heijokyo.jpg|Ground-plan of Heijō-kyō ==Related pages== * Nara period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Tenpyō 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th 13th 14th 15th 16th 17th 18th 19th 20th 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 Tenpyō 21st 749 Preceded by: Jinki Era or nengō: Tenpyō Succeeded by: Tenpyō-kanpō Category:Japanese eras Category:720s establishments in Japan Category:8th-century disestablishments in Japan Category:740s disestablishments Category:720s establishments",
 "title": "Tenpyō"
}