{
 "id": "342885",
 "text": "Skippy the Bush Kangaroo was an Australian television series for children. It was created by John McCallum. It was made from 1966–1968. The show tells the adventures of a young boy and his intelligent pet kangaroo. It happens in the (fictional) Waratah National Park in Duffys Forest, near Sydney, New South Wales. Ninety-one 30-minute episodes were made over the three seasons of production. At the time of first screening, Australian television was still in black and white. The show was filmed in colour to get more international sales, especially in the United States and Canada. It aired there between 1969 and 1972. The Nine Network repeated the series several times after Australian television became colour in 1975. The programme was played in Mexico, Cuba, Spain, Czechoslovakia, and Iran. ==Cast== The main characters were: * Ed Devereaux as Matt Hammond, the Head Ranger of Waratah National Park * Garry Pankhurst as Sonny Hammond, Matt's younger son * Ken James as Mark Hammond, Matt's elder son * Tony Bonner as Jerry King, flight ranger (helicopter pilot) (exit #78) * Liza Goddard as Clarissa 'Clancy' Merrick (entry #9 exit #75), the teenage daughter of a ranger stationed at another section of the park. When her father is moved to a park in northern New South Wales, Matt invites Clancy to stay with the Hammond family so that her music studies are not hurt by the move north. * John Warwick as Sir Adrian Gillespie, Head of the NSW National Parks Board * Elke Neidhardt as Dr. Anna Steiner, a German doctor and playing a support role. * Morgan Brain as Sgt. Bernard Gillies. * Skippy was played by at least nine different kangaroosAs quoted on DVD 1, Making of Special extra ==References== Category:Australian television series Category:1966 television series debuts Category:1970 television series endings Category:1960s television series Category:1970s television series Category:English-language television programs",
 "title": "Skippy the Bush Kangaroo"
}