{
 "id": "342869",
 "text": "{{Infobox writer | name = Colleen McCullough | birth_date = June 1, 1937 | birth_place = Wellington, New South Wales, Australia | death_date = | death_place = Norfolk Island, Australia | occupation = Novelist, Neuroscientist | genre = Fiction, fantasy, drama | spouse = Ric Robinson }} Colleen Margaretta McCullough (; married name Robinson, previously Ion-Robinson; 1 June 193729 January 2015) was an Australian author. She was famous world-wide. ==Life== McCullough was born in 1937. Her parents were James and Laurie McCullough.Enough Rope - Transcript of McCullough interview with Andrew Denton (24 September 2007) Her mother was a New Zealander of part-Māori descent. During her childhood, her family moved many times. She read a lot.Mary Jean DeMarr, Colleen McCullough: a critical companion, Page 2 She attended Holy Cross College. McCullough earned a living as a teacher, librarian, and journalist. In her first year of medical studies at the University of Sydney she suffered dermatitis. She was told not to be a medical doctor. Instead, she switched to neuroscience and worked in Royal North Shore Hospital in Sydney. In 1963, McCullough moved to the United Kingdom for four years. At Great Ormond Street Hospital in London, she met the chairman of the neurology department at Yale University. He offered her a research associate job at Yale. McCullough spent ten years from April 1967 to 1976 researching and teaching in the Department of Neurology at the Yale Medical School in New Haven, Connecticut, United States. It was while at Yale that she wrote her first two books. Because these books were successful, McCullough stopped being a doctor.Mary Jean DeMarr, Colleen McCullough: a critical companion, Page 3 In the late 1970s, she lived in London and Connecticut, USA. She finally picked Norfolk Island in the Pacific. There she met her husband, Ric Robinson (then 33 years old). They married on 13 April 1983 (she was 46 years old). In 1984 a portrait of McCullough, painted by Wesley Walters, was a finalist in the Archibald Prize. The prize is for the \"best portrait painting preferentially of some man or woman distinguished in Art, Letters, Science or Politics\". McCullough did a lot of historical research for the novels on ancient Rome. This led to her getting a Doctor of Letters degree by Macquarie University in 1993.ABC NSW http://www.abc.net.au/nsw/stories/s376367.htm Retrieved 2009-08-15 McCullough was a member of the New York Academy of Sciences. She was a fellow of the American Association for the Advancement of Science. She now lives in Sydney. Some people did not like McCullough's 2008 novel The Independence of Miss Mary Bennett. She changed some of the characters in Jane Austen's Pride and Prejudice. McCullough died on 29 January 2015 at the age of 77 on Norfolk Island from renal failure.Colleen McCullough, author of The Thorn Birds, dies ==Writing history== ===Novels=== * Tim (1974). Made into a film in 1979 * The Thorn Birds (1977) * An Indecent Obsession (1981) * A Creed for the Third Millennium (1985) * The Ladies of Missalonghi (1987) * The Song of Troy (1998) * Morgan's Run (2000) * The Touch (2003) * Angel Puss (2004) * On, Off (2006) * The Independence of Miss Mary Bennet (2008) * \"Too Many Murders\" (2010) ===Biography=== * The Courage and the Will: The Life of Roden Cutler VC (1999) ===Masters of Rome Series=== # The First Man in Rome (1990) # The Grass Crown (1991) # Fortune's Favorites (1993) # Caesar's Women (1996) # Caesar (1997) # The October Horse (2002) # Antony and Cleopatra (2007) ===Carmine Delmonico series=== # On, Off (2006) # Too Many Murders (December 2009) # Naked Cruelty (2010) ==Screen adaptations== * Tim - made into a movie in 1979 starring Mel Gibson and Piper Laurie * The Thorn Birds - made into a TV miniseries in 1983 starring Richard Chamberlain * An Indecent Obsession - made into a movie in 1985 starring Gary Sweet * The Thorn Birds: The Missing Years - made into a TV miniseries in 1996 starring Richard Chamberlain. * Mary & Tim - a 1996 adaptation of the novel Tim ==References== *Mary Jean DeMarr: Colleen McCullough: A Critical Companion. Greenwood Publishing Group 1996, () Category:1937 births Category:2015 deaths Category:Australian novelists Category:Deaths from renal failure Category:Disease-related deaths in Australia Category:Order of Australia Category:University of Sydney alumni Category:Writers from New South Wales",
 "title": "Colleen McCullough"
}