{
 "id": "342929",
 "text": "A-League Women, known before the 2021–22 season as the W-League, is the main women's semi-professional soccer league in Australia. Started in 2008, it currently has 10 teams, nine in Australia and the other in New Zealand. Eight of the Australian teams and the New Zealand team are partners with clubs in A-League Men. The other team is based in Canberra. Because it is sponsored by Liberty Lending Group, an Australian financial services company, the League is called Liberty A-League Women. A-League Women started on 25 October 2008 as the W-League. One game per week is broadcast live nationwide on ABC1.\"Brisbane Roar v Canberra United – Saturday, 3 October at 3pm on ABC1\" As of the 2021–22 season, teams in A-League Women have a salary cap of A$450,000 for the entire squad. By comparison, the salary cap for clubs in the men's competition, A-League Men, is A$2.1 million, with each team in that league allowed to sign two \"marquee players\" whose salaries do not count against the cap. The league began with eight teams. The Central Coast Mariners had to withdraw from the 2010–11 season. This was because they did not have enough money. Western Sydney Wanderers FC joined the league for 2012–13, followed by Melbourne City FC in 2015–16 and the league's first New Zealand side, Wellington Phoenix FC, in 2021–22. Central Coast Mariners FC will return to A-League Women in 2022–23, and Western United FC will add an A-League Women side in 2022–23. ==Clubs== Current clubs Team Location Stadium Capacity Founded Joined Head coach Captain Highest finish Most recent finish Adelaide United Adelaide, South Australia ServiceFM Stadium Coopers Stadium 7,000 17,000 2008 2008 Adrian Stenta Isabel Hodgson Brisbane Roar Brisbane, Queensland Ballymore Stadium 8,000 2008 2008 Garrath McPherson Ayesha Norrie Canberra United Canberra, ACT McKellar Park 3,500 2008 2008 Njegosh Popovich Michelle Heyman Central Coast Mariners Gosford, New South Wales Central Coast Stadium 20,059 2008 2008 2023 (re-entry) Emily Husband Taren King 2nd 2nd Melbourne City Melbourne, Victoria Kingston Heath Soccer Complex AAMI Park 3,300 30,050 2015 2015 Dario Vidošić (caretaker) Rebekah Stott Melbourne Victory Melbourne, Victoria The Home of the Matildas AAMI Park 3,000 30,050 2008 2008 Jeff Hopkins Kayla Morrison Newcastle Jets Newcastle, New South Wales Wanderers Oval Adamstown Oval McDonald Jones Stadium 2,000 2,000 33,000 2008 2008 Gary van Egmond Cassidy Davis Perth Glory Perth, Western Australia Macedonia Park HBF Park 7,000 20,500 2008 2008 Alexander Epakis Natasha Rigby Sydney FC Sydney, New South Wales Netstrata Jubilee Stadium Leichhardt Oval Seymour Shaw Park Cromer Park 20,500 20,000 5,000 5,000 2008 2008 Ante Juric Natalie Tobin Wellington Phoenix Wellington, New Zealand Sky Stadium Jerry Collins Stadium 34,500 1,900 2021 2021 Paul Temple Annalie Longo Western Sydney Wanderers Sydney, New South Wales CommBank Stadium Blacktown Football Park Marconi Stadium 30,000 500 9,000 2012 2012 Robbie Hooker Amy Harrison Western United Wyndham, Victoria GMHBA Stadium 36,000 2021 2022 Mark Torcaso Jaclyn Sawicki Chloe Logarzo Future clubs Team Location Stadium Capacity Founded Joining Auckland (name TBD) Auckland, New Zealand TBD TBD TBD 2024–25 ===Performance record=== Performance and ranking of clubs based on their best regular season result in the W-League and A-League Women. The 2022–23 season is Western United's first season. Rank Club Best result 08–09 09 10–11 11–12 12–13 13–14 14 15–16 16–17 17–18 18–19 19–20 20–21 21–22 22–23 1 Sydney FC 1st (5 times) 4 1 1 3 4 2 4 3 3 2 3 3 1 1 1 2 Brisbane Roar 1st (3 times) 1 3 2 2 1 4 6 4 7 1 2 5 2 6 9 3 Canberra United 1st (3 times) 3 4 3 1 5 1 3 2 1 5 8 6 4 7 5 4 Melbourne City 1st (2 times) — — — — — — — 1 4 4 5 1 7 2 3 5 Melbourne Victory 1st 5 5 4 4 3 3 2 9 9 7 1 2 3 4 4 6 Perth Glory 1st 7 6 5 6 2 5 1 8 2 6 4 7 9 5 6 7 Newcastle Jets 2nd 2 8 6 5 7 8 5 6 5 3 7 9 8 8 10 8 Central Coast Mariners 2nd 6 2 — — — — — — — — — — — — — 9 Western United 2nd — — — — — — — — — — — — — — 2 10 Adelaide United 3rd 8 7 7 7 8 6 7 5 6 9 6 8 5 3 8 11 Western Sydney Wanderers 3rd — — — — 6 7 8 7 8 8 9 3 6 9 7 12 Wellington Phoenix 10th — — — — — — — — — — — — — 10 11 Key League premiers and qualifier for W-League/A-League Women finals Qualifier for W-League/A-League Women finals — Not part of that season's competition ==References== Category:Football leagues Category:2008 establishments in Australia Category:Sports organisations of Australia",
 "title": "A-League Women"
}