{
 "id": "342912",
 "text": "Australia is a 2008 Australian epic historical romantic drama movie. It was directed by Baz Luhrmann. It starred Nicole Kidman and Hugh Jackman. It made the second most money of any Australian movie. The first was Crocodile Dundee. The movie is set between 1939 and 1942. Events in northern Australia included the bombing of Darwin during World War II. The movie was released in both Australia and the United States on 26 November 2008. It was released to the rest of the world in late December 2008 and January and February 2009. ==Awards and nominations== Awards Awards Awards Awards Award Category Recipient(s) Outcome Satellite Awards Satellite Award for Best Art Direction and Production Design Catherine Martin Satellite Award for Best Cinematography Mandy Walker Satellite Award for Best Visual Effects Chris Godfrey Satellite Award for Best Original Screenplay Baz Luhrmann Satellite Award for Best Original Score David Hirschfelder Satellite Award for Best Original Song 'By the Boab Tree' Satellite Award for Best Editing Dody Dorn Satellite Award for Best Sound Wayne Pushley Satellite Award for Best Costume Design Catherine Martin 81st Academy Awards Academy Award for Best Costume Design Catherine Martin Film Critics Circle of Australia Best Cinematography Mandy Walker Best Supporting Actor Brandon Walters Best Film Australia Best Music Score David Hirschfelder Young Artist Award Best Performance in an International Feature Film – Leading Young Performers – Brandon Walters Critics' Choice Awards Best Young Performer Brandon Walters Chicago Film Critics Best Cinematography Mandy Walker Most Promising Performer Brandon Walters ==References== Category:2008 romantic drama movies Category:2000s war movies Category:20th Century Fox movies Category:Australian drama movies Category:Australian romance movies Category:2000s English-language movies Category:2000s epic movies Category:2000s historical movies Category:Movies set in the 1930s Category:Movies set in the 1940s Category:World War II movies Category:Movies set in Australia Category:Movies set in deserts Category:Movies directed by Baz Luhrmann",
 "title": "Australia (2008 movie)"
}