{
 "id": "343008",
 "text": "was a after Tenpyō-shōhō and before Tenpyō-jingo. This period spanned the years from August 757 through January 765.Nussbaum, Louis-Frédéric. (2005). \"Tenpyō-hōji\" in Japan Encyclopedia, p. 957. The reigning monarchs were .Nussbaum, \"Junnin Tennō,\" p. 437; Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 75-78; Brown, Delmer et al. (1979). Gukanshō, p. 275. and .Nussbaum, \"Shōtoku Tennō,\" p. 888; Titsingh, Annales des empereurs du Japon, pp. 78-81; Brown, p. 276; Varley, H. Paul. (1980). Jinnō Shōtōki. p. 145. ==Events of the Tenpyō-hōji era== * 757 (Tenpyō-hōji 1'): The new era began in the 8th month of Tenpyō-shōhō 9.Brown, p. 274. * 760 (Tenpyō-hōji 4): Newly minted coins were put into circulation - each copper coin bearing the words Mannen Ten-hō, each silver coin bearing the words Teihei Genhō, and each gold coin bearing the words Kaiki Shōhō.Appert, Georges. (1888). Ancien japon, pp. 29-30. * 26 January 765 (Tenpyō-hōji 9, 1st day of the 1st month): In the 6th year of Junnin's reign, the emperor was removed from his role as monarch; and the succession (senso) was received by former-Empress Kōken. Soon after, Empress Shōtoku's reign was confirmed by ceremonies (sokui).Brown, p. 276; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2012-5-22. ==Related pages == * Nara period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Tenpyō-hōji 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 757 758 759 760 761 762 763 764 765 Preceded by: Tenpyō-shōhō Era or nengō: Tenpyō-hōji Succeeded by: Tenpyō-jingo Category:Japanese eras Category:8th-century establishments in Japan Category:8th-century disestablishments in Japan Category:760s disestablishments Category:750s establishments",
 "title": "Tenpyō-hōji"
}