{
 "id": "343094",
 "text": "Polandball, also known as Countryballs, is a geopolitical and satirical internet meme that takes the form of a large number of online comics. In the comics, countries flags are drawn as a circle shape. The balls interact in broken English, often referred to as \"Engrish\", (except for those countries who have English as their main language) and ridicule national stereotypes and international relations. ==History== Polandball has roots in an August 2009 raid between Polish users and other drawball.com users. Drawball.com allowed Internet users to freely draw on a circular canvas, and also allows people to paint over others drawings. On the Polish flag internet, an idea was raised to draw the flag of Poland on the ball. Thousands of Poles managed to take over the drawball, turning it into a Polish flag. In the middle, the word \"POLSKA\" was written. After co-ordination from 4chan, this was then covered over by a large swastika. ===Comic origins=== The beginning of the Polandball meme is credited to Falco, a British user on German imageboard Krautchan. On September 2009, Falco created the meme using MS Paint as a way to troll Polish user Wojak. Wojak was a popular user on the same board and who typed in broken English. Afterwards, Polandball cartoons were enthusiastically drawn by Russians. ==Themes== Polandball typically represents the history, International relations, and stereotypes of countries. It concentrates on Polish megalomania and national complexes. The meme gained in popularity after the plane crash in Smolensk which killed Polish President Lech Kaczyński. Interactions between countries are written in broken English and internet slang, similar to the Lolcat meme. Some Polandball comics are based on the premise that Poland \"cannot into space\" . One of the most popular Polandball cartoons begins with the premise that Earth is going to be struck by a giant meteor. All countries with space technology leave Earth and go into orbit around the planet. At the end of the cartoon, Poland is still on earth and weeps. In this humorous way, Russians stop discussion with Poles on which country is superior. ===Other countries=== Polandball can also include comics on other countries. By convention these comics are usually still referred to as Polandball. Various countries have particular traits, such as Brazil always laughing, Israel being a cube, and Britain wearing a top-hat and monocle. ==References== Category:Internet memes",
 "title": "Polandball"
}