{
 "id": "34307",
 "text": "\"Take Me Out to the Ball Game\" is a 1908 Tin Pan Alley song. The words were written by Jack Norworth. The music was written by Albert Von Tilzer. Neither of the writers had been to a baseball game. The song has become the unofficial anthem of baseball. The chorus is traditionally sung during the seventh-inning stretch of a baseball game. Fans are generally encouraged to sing along. At some ballparks, the words \"home team\" are replaced with the team name, as is the case with the Houston Astros, San Francisco Giants, Pittsburgh Pirates, Boston Red Sox, Chicago Cubs, Chicago White Sox, Milwaukee Brewers, Philadelphia Phillies, Toronto Blue Jays, Miami Marlins, Colorado Rockies, Detroit Tigers and several other Major League Baseball teams. The first recorded version of the song was made by Edward Meeker. Meeker's recording was selected by the Library of Congress as a 2010 addition to the National Recording Registry. The Registry picks recordings once a year that are \"culturally, historically, or aesthetically significant\". ==Words== 1908 Version 1927 Version Katie Casey was baseball mad, Had the fever and had it bad. Just to root for the home town crew, Ev'ry souSou was a slang term for a coin similar in value to a penny Katie blew. On a Saturday her young beau Called to see if she'd like to go To see a show But Miss Kate said \"No, I'll tell you what you can do:\" Nelly Kelly loved baseball games, Knew the players, knew all their names. You could see her there ev'ry day, Shout \"Hurray\" When they'd play. Her boyfriend by the name of Joe Said, \"To Coney Isle, dear, let's go\", Then Nelly started to fret and pout, And to him, I heard her shout: [Chorus] Take me out to the ball game, Take me out with the crowd; Buy me some peanuts and Cracker Jack, I don't care if I never get back. Let me root, root, root for the home team, If they don't win, it's a shame. For it's one, two, three strikes, you're out, At the old ball game. Take me out to the ball game, Take me out with the crowd; Buy me some peanuts and Cracker Jack, I don't care if I never get back. Let me root, root, root for the home team, If they don't win, it's a shame. For it's one, two, three strikes, you're out, At the old ball game. Katie Casey saw all the games, Knew the players by their first names. Told the umpire he was wrong, All along, Good and strong. When the score was just two to two, Katie Casey knew what to do, Just to cheer up the boys she knew, She made the gang sing this song: Nelly Kelly was sure some fan, She would root just like any man, Told the umpire he was wrong, All along, Good and strong. When the score was just two to two, Nelly Kelly knew what to do, Just to cheer up the boys she knew, She made the gang sing this song: [repeat Chorus] ==Notes== Category:1900s songs Category:Baseball Category:1908 works",
 "title": "Take Me Out to the Ball Game"
}