{
 "id": "343141",
 "text": "Oskar Kokoschka (1 March 1886 – 22 February 1980) was an Austrian artist, poet and playwright. He is best known for his intense expressionistic portraits and landscapes. Kokoschka's first jobs were postcards and drawings for children. In his early career he did portraits of Viennese celebrities. He was in the Austrian army in World War I and was wounded. At the hospital, the doctors said he was mentally unstable. He traveled across Europe and painted the landscape. Kokoschka had an affair with Alma Mahler. She stopped the relationship. He continued to love her his entire life. One of his greatest works The Bride of the Wind (The Tempest), is a tribute to her. His poem Allos MarkarPoem 1913 Translation.Happiness is otherwise an anagram of Alma & Oskar), was about this relationship. Deemed a degenerate by the Nazis, Kokoschka left Austria in 1934 for Prague. In 1938, when the Czechs were coming for Wehrmacht, he fled to the United Kingdom. He stayed there during the war. Kokoschka became a British citizen in 1946. In 1978 he got back Austrian citizenship. He traveled to the United States in 1947. Then he moved to Switzerland. He lived there the rest of his life. He died in Montreux. ==Artworks== *1909: Lotte Franzos *1909: Martha Hirsch I *1909: Hans and Erika Tietze *1909: St. Veronica with the Sudarium *1909: Les Dents du Midi *1909: Children Playing *1910: Still Life with Lamb and Hyacinth *1910: Rudolf Blümner *1911: Hermann Schwarzwald I *1911: Egon Wellesz *1911: Crucifixion *1912: Two Nudes *1913: Landscape in the Dolomites (with Cima Tre Croci) *1913: The Tempest *1913: Carl Moll *1913: Still Life with Putto and Rabbit *1915: Knight Errant *1917: Portrait of the Artist's Mother *1917: Lovers with Cat *1917: Stockholm Harbour *1920: The Power of Music *1919: Dresden, Neustadt I *1921: Dresden, Neustadt II *1921: Two Girls *1922: Self-Portrait at the Easel *1923: Self-Portrait with Crossed Arms *1925: Amsterdam, Kloveniersburgwal I *1924: Venice, Boats on the Dogana *1925: Toledo *1926: Mandrill *1926: Deer *1929: Arab Women and Child *1932: Girl with Flowers *1934: Prague, View from the Villa Kramář *1937: Olda Palkovská *1938: Prague - Nostalgia *1940: The Crab *1941: Anschluss - Alice in Wonderland *1941: The Red Egg *1948: Self-Portrait (Fiesole) *1962: Storm Tide in Hamburg *1966: The Rejected Lover *1971: Time, Gentlemen, Please ==Writings== Kokoschka's literary works are as odd and interesting as his art. His memoir, A Sea Ringed with Visions, is as wildly psychedelic as anything written by others under the influence of actual hallucinogens. His short play \"Murderer, the Hope of Women\" is often called the first Expressionist drama. His Orpheus und Eurydike (1918) became an opera by Ernst Krenek. ===Bibliography=== *1908: Die traumenden Knaben (The Dreaming Youths) Vienna: Wiener Werkstätte (Originally published in an edition of 500 by the Wiener Werkstätte. Unsold copies numbered 1-275, were reissued in 1917 by Kurt Wolff Verlag.) *1909: Mörder, Hoffnung der Frauen (Murderer, the Hope of Women) (Play) *1913: Der Gefesslte Columbus(Columbus Bound). [Berlin]: Fritz Gurlitt, [1913] known as Der Weisse Tiertoter (The White Animal Slayer). *1919: Orpheus and Eurydike, in: Vier Dramen: Orpheus und Eurydike; Der brennende Dornbusch; Mörder, Hoffnung der Frauen; [and] Hiob. Berlin *1962: A Sea Ringed with Visions. London: Thames & Hudson (Autobiography) *1974: My Life; translated (from \"Mein Leben\") by David Britt. London: Thames & Hudson ===First productions of plays=== * 1907: Sphinx und Strohmann. Komödie für Automaten. 29 March 1909 at Cabaret Fledermaus, Vienna * 1909: Mörder, Hoffnung der Frauen * 1911: Der brennende Dornbusch * 1913: Sphinx und Strohmann, Ein Curiosum. 14 April 1917 in the Dada-Galerie, Zürich * 1917: Hiob (an enlarged version of Sphinx und Strohmann, 1907) * 1919: Orpheus und Eurydike ** 1923: new version as opera libretto; music by Ernst Krenek. 27 November 1926 at the Staatstheater, Kassel * 1936–38/1972: Comenius ==Tributes== * The Children's television show Hey Arnold! features a character named Oskar Kokoschka. He is portrayed as a deadbeat in Arnold's families boarding house. * A UK Midlands based 1980's pop group called themselves 'Oskar Kokoschka'. In 1986 they released a 12 inch EP featuring the songs 'Waiting til it all Blows Over' and 'Letting the water out'. ==References== Category:1886 births Category:1980 deaths Category:Austrian painters Category:British painters Category:Austrian poets Category:Austrian playwrights Category:British poets Category:British playwrights",
 "title": "Oskar Kokoschka"
}