{
 "id": "34328",
 "text": "The Democratic Republic of the Congo (), commonly referred to as DR Congo, Congo-Kinshasa or the DRC, is a country in central Africa. It was known as Zaïre from 1971 to 1997. It is the second largest country in Africa by area and the eleventh largest in the world. With a population of over 71 million, the Democratic Republic of the Congo is the nineteenth most populous nation in the world, the fourth most populous nation in Africa, as well as the most populous Francophone (French-speaking) country. The Democratic Republic of the Congo borders the Central African Republic and South Sudan to the north; Uganda, Rwanda, and Burundi in the east; Zambia and Angola to the south; the Republic of the Congo, the Angolan exclave of Cabinda, and the Atlantic Ocean to the west. It is separated from Tanzania by Lake Tanganyika in the east. The country has access to the ocean through a stretch of Atlantic coastline at Muanda and the roughly 9 km wide mouth of the Congo River which opens into the Gulf of Guinea. It has the second-highest total Christian population in Africa. == History == When the Belgian Congo became independent, its leaders fought each other. The Soviet Union and later the United Nations helped destroy the groups who wanted independence from the new country. The Second Congo War, beginning in 1998, devastated the country. It involved nine African nations and some twenty armed groups.See \"Rumblings of war in heart of Africa\" by Abraham McLaughlin and Duncan Woodside The Christian Science Monitor 23 June 2004 and \"World War Three\" by Chris Bowers My Direct Democracy 24 July 2006 Despite the signing of peace accords in 2003, fighting continues in the east of the country. There, the prevalence of rape and other sexual violence is described as the worst in the world. The war is the world's deadliest conflict since World War II, killing 5.4 million people since 1998. The vast majority died from conditions of malaria, diarrhea, pneumonia and malnutrition.Report on the crisis Full report at IRC mortality facts from the International Rescue Committee The Democratic Republic of the Congo was formerly, in chronological order, the Congo Free State, Belgian Congo, Congo- Léopoldville, Congo-Kinshasa, and Zaire (Zaïre in French). Though it is in the Central African United Nations subregion, the nation is also economically and regionally affiliated with Southern Africa as a member of the Southern African Development Community (SADC). ===Civil war=== The city of Goma was captured in 2025, as part of the M23 offensive (a series of attacks); The city is \"eastern DR Congo’s biggest city\"; The armed group M23 is backed by Rwanda.https://www.bangkokpost.com/world/2952321/dr-congo-csonflict-risks- broader-regional-war. Retrieved 2025-02-01 In February, the government lost control of the city of Bukavu and the town of Kavumu and its strategic military airport (map).https://www.nrk.no/nyheter/guvernor-bekrefter-at- opprorere-er-i-bukavu---regjeringsstyrkene-trakk-seg-ut-1.17284799. Retrieved 2025-02-16https://www.vg.no/nyheter/i/pPOdKR/opproerere-skal-ha-inntatt- millionbyen-bukavu-oest-i-kongo. Retrieved 2025-02-14https://www.bangkokpost.com/world/2952321/dr-congo-csonflict-risks- broader-regional-war. Retrieved 2025-02-01 Earlier (January 26), the country cut its diplomatic contact with Rwanda, because of Rwanda supporting M23. The Kivu conflict is ongoing (2025). North Kivu and South Kivu provinces are in the eastern part of the country. Some of the most active rebel groups are the Allied Democratic Forces, CODECO, and some Mai Mai militias. A UN peacekeeping force, MONUSCO, is in the country.https://news.un.org/en/story/2025/01/1159446. Retrieved 2025-02-01 FDLR are supported by the military, in their fight against M23. The group is made up of Hutus.https://www.nrk.no/urix/kongo-og-marerittet-som-aldri-tek- slutt-1.17238522. Retrieved 2025-02-01 FARDC are the Armed Forces of the Democratic Republic of the Congo. Western DR Congo clashes are a series of attacks; As late as July 2024, 42 Mobondo rebels were killed when they attacked a village; 9 government forces died.Kwamouth : les FARDC repoussent une attaque des miliciens Mobondo à Kinsele, Radio Okapi, 13 Juillet 2024Maï- Ndombe : plus de 50 morts après une attaque de la milice Mobondo à Kwamouth, Radio Okapi, 13 Juillet 2024 == Geography == The country is bordered by Angola, the South Atlantic Ocean, the Republic of Congo, the Central African Republic, South Sudan, Uganda, Rwanda, Burundi, Tanzania across Lake Tanganyika, and Zambia. The capital of the Democratic Republic of Congo is Kinshasa. World Heritage Sites in the Democratic Republic of Congo include Virunga National Park (1979), Garamba National Park (1980), Kahuzi-Biega National Park (1980), Salonga National Park (1984) and Okapi Wildlife Reserve (1996). === Provinces === The country is divided into twenty six provinces. The provinces are then divided into districts. The districts are divided into territories. ==Related pages== *DR Congo at the Olympics *List of rivers of the Democratic Republic of the Congo ==References== Congo, Democratic Republic Category:Least developed countries Category:1960 establishments in Africa Category:Swahili-speaking countries and territories",
 "title": "Democratic Republic of the Congo"
}