{
 "id": "343304",
 "text": "A constitutional republic is a governing state where the chief executive and representatives are elected, and the rules are set down in a written constitution. The head of state (president) and other representatives are elected but they do not have uncontrolled power. What their power is limited to is written in the constitution. If there is dispute about what the constitution means, this is decided by a court system that is independent from the representatives. In recent public discourse, \"constitutional republic\" is sometimes used in contrast with the term \"democracy.\" In fact, a constitutional republic is a form of representative democracy, not a direct democracy. Constitutional republics usually have a separation of powers. The separation of powers means that no single officeholder gets unlimited power. John Adams said that a constitutional republic was \"a government of laws, and not of men\".Levinson, Sanford. 1989. Constitutional faith. Princeton University Press. This is meant to be a safeguard against tyranny. No office holder can get to a position of absolute power. However, some have argued that a constitution can be written in such a way that it lets tyranny arise, and that a constitution is therefore not a fail proof safeguard against tyranny.Delattre, Edwin. 2002. Character and cops: ethics in policing, American Enterprise Institute, p. 16. Aristotle was the first to write about the idea in his works on politics. Constitutional monarchies are a special case; even though the monarch is not elected, the people still elect other governing bodies. A constitution may limit the power of the monarch. == Comparisons == Comparisons can be made. There are countries which nominally are constitutional republics, but which have become (in effect) dictatorships. There are also countries which have no written constitution, and are monarchies, but which act in a similar way to constitutional republics. ==References== ==Related pages== *constitutionalism *constitutional economics *democracy *rule of law Category:Forms of government",
 "title": "Constitutional republic"
}