{
 "id": "343409",
 "text": "The driving side of a road is the side where vehicles must drive. Each country says whether vehicles will drive on the right-hand or left-hand side of the road. This is sometimes called the rule of the road. This basic rule makes traffic move more easily. It also lowers the risk of head-on collisions. Today about 66.1% of the world's people live in countries that drive on the right- hand side; 33.9% live in countries that drive on the left-hand side. The side driven on is usually the other side from which a vehicle's steering wheel and instrument panel are located. That is, right-hand drive vehicles are normal when driving on the left-hand side of the road, and left-hand drive vehicles are used when driving on the right-hand side of the road. Most countries that drive on the left-hand side are former British colonies. Some other countries chose the left-hand side of the road. These countries include: Japan, Pakistan, India, Thailand, Nepal, Bhutan, Mozambique, Suriname, East Timor, Indonesia, Sri Lanka and more. Today, only four European countries drive on the left-hand, the United Kingdom, Ireland, Malta, and Cyprus. There are several countries with territories outside the mainland that drive on a different side from the mainland. One well-known example is that all of China drives on the right-hand except for its Special Administrative Regions Hong Kong and Macau, which drive on the left-hand. Before the creation of the automobile, people mostly rode on the left-hand side, since most people were right-handed and would whip their horses with their left hands. Warriors in battle could also use their right hand to hold and control their weapon. During the 1700s, many farmers began to pull their vehicles using teams of horses rather than just one. In 1794, France passed the first right-hand driving laws, and this law would spread with Napoleon's conquests. The territories and regions of the former Austro-Hungarian and Portuguese Empires refused to change the direction of driving at first, but most eventually chose to drive on the right-side. Only Mozambique, East Timor, and Macau (all former Portuguese colonies) still drive on the left-side. Canada, Myanmar, Gibraltar, British Indian Ocean Territory, Belize, and a few countries in West Africa like Ghana, Nigeria, Sierra Leone, and The Gambia all switched to driving on the right hand side of the road. ==References== Category:Road transport Category:Traffic",
 "title": "Left- and right-hand traffic"
}