{
 "id": "343499",
 "text": "A folk dance is a dance that has some or all of the following: *They are dances at social functions by people with little or no professional training. They are often to traditional music or music based on traditional music. *They are not made for public performance or the stage. Traditional folkdances may be later arranged and set for stage performances. *The way they are done is strongly about inherited tradition rather than making changes. Although like all folk traditions they do change over time. *New dancers often learn informally by watching others and/or getting help from others. Even though some people argue with it, folk dancing can be dancing for with no governing body or dancing for which there are no competitive or professional performances. ==Europe== Types of European folk dance include: *Polonez (Polish), *clogging, *English country dance, *Georgian folk dance *international folk dance, *Irish dance, *Maypole dance, *Morris dance, *Turkish dance, *Welsh Morris Dance, *Nordic polska dance, *Ball de bastons, *square dance, and *sword dance. Sword dances include Longsword dances and rapier dancing. Some choreographed dances such as contra dance, Scottish country dance, and modern Western square dance, are called folk dances, though this is not true in the strictest sense. Country dance overlaps with contemporary folk dance and ballroom dance. Most country dances and ballroom dances are from folk dances, with small changes over the years. ==Middle East & South Asia== ===Middle East=== * Ardah - National dance of Saudi Arabia. * M'alayah - popular Arab dancing art that is performed at weddings. It is centered in northern Oman, the northeast of the United Arab Emirates, and North Africa.https://www.elbalad.news/5635391 * Attan - The national dance of Afghanistan * Azerbaijani dances * Dabke - Levantine folk-dance * Kurdish dance * Assyrian folk dance * Yowlah - A war dance of United Arab Emirates ===South Asia=== * Bhangra a Punjabi harvest dance and music style that has become popular worldwide. * Ghoomar a traditional Bhil tribe women's folk dance of Rajasthan, India. * Ghumura Dance: War Dance from Kingdom of Kalahandi, Orissa, India * Kalbelia is one of the most sensuous dance forms of Rajasthan, performed by the kalbelia tribe. == South East Asia == * Randai * Piring dance * Saman dance * Payung dance * Gandrung * Singkil * Rodat ==Latin America== * Baile Folklorico (Mexico and Central America) ==References== Category:Dance types",
 "title": "Folk dance"
}