{
 "id": "343460",
 "text": "__NOTOC__ Year 350 BC was a year of the pre-Julian Roman calendar. == Events == === By place === ==== Persian Empire ==== * Sidon, the centre of the revolt against Persia, asks for help from its sister city of Tyre and from Egypt but gets very little. * Idrieus, the second son of Hecatomnus, succeeds to the throne of Caria on the death of Artemisia II, the widow of his elder brother Mausolus. Shortly after he becomes ruler, at the request of the Persian king, Artaxerxes III, Idrieus equips a fleet of 40 triremes and an army of 8,000 mercenary troops and despatches them against Cyprus, under the command of the Athenian general Phocion. ==== Greece ==== * Alexander I becomes king of Epirus after his brother-in-law Philip II of Macedon dethrones Alexander's cousin Arymbas. * Philip II has Abdera in Thrace sacked. ==== Roman Republic ==== * The Gauls, once more threatening Rome, are beaten by an army of Rome and its allies. ==== America ==== * The Maya civilization in Mesoamerica begins (approximate date). === By topic === ==== Science ==== * Aristotle argues for a spherical Earth using lunar eclipses and other observations. Also he discusses logical reasoning in Organon. * Plato proposes a geocentric model of the universe with the stars rotating on a fixed celestial sphere. ==== Art ==== * Praxiteles makes the Aphrodite of Knidos (approximate date). A composite of two similar Roman copies after the original marble is now kept at Musei Vaticani, Museo Pio Clementino, Gabinetto delle Maschere in Rome. * The building of the Mausoleum in Halikarnassos (modern Bodrum in Turkey) is completed (approximate date). It is the grave of the Persian satrap and Carian ruler Mausolos and is built under the direction of his wife Artemisia. The mausoleum, which is said to be one of the Seven Wonders of the Ancient World, is today partly kept at the British Museum in London. * The Corinthian capital is made in the tholos at Epidaurus. It is now kept at the Archaeological Museum in Epidaurus, Greece (approximate date). == Births == * Dicaearchus, Greek philosopher, cartographer, geographer, mathematician and polymath (d. c. 285 BC) * Cassander, king of Macedonia and founder of Antipatrid dynasty (approximate date) (d. c. 297 BC) * Shen Dao, Chinese philosopher known for his blend of Legalism and Taoism (approximate date) (d. c. 275 BC) == Deaths == * Artemisia, Queen of Caria and sister and wife of King Mausolus of Caria Category:350s BC",
 "title": "350 BC"
}