{
 "id": "343563",
 "text": "DreamWorks Animation LLC (more commonly known as DreamWorks Animation, or simply DreamWorks) is an American animation studio that is a subsidiary of Universal Studios, a division of NBCUniversal, itself a division of Comcast. It is based in Glendale, California and produces animated feature films, television programs and online virtual games. The studio has currently released a total of feature films, including the franchises Shrek, Madagascar, Kung Fu Panda and How to Train Your Dragon. Originally formed under the banner of its main DreamWorks studio in 1997 by some of Amblin Entertainment's former animation branch Amblimation alumni, it was spun off into a separate public company in 2004. DreamWorks Animation currently maintains its Glendale campus, as well as satellite studios in India and China. On August 22, 2016, NBCUniversal acquired DreamWorks Animation for $3.8 billion, making it a division of the Universal Filmed Entertainment Group. As of October 2017, its feature films have grossed $14.457 billion worldwide, with a $417.8 million average gross per film.When added to foreign grosses DreamWorks Animation Movies at the Box Office Box Office Mojo Shrek 2 (2004) is among the 50 highest-grossing films of all time, and fourteen of the films are among the 50 highest-grossing animated films, with Shrek 2 being the ninth all-time highest. Although the studio also made traditionally animated films in the past, as well as stop-motion co-production with Aardman Animations, all of their films now use computer animation. The studio has received three Academy Awards, as well as 41 Emmy and numerous Annie Awards, and multiple Golden Globe & BAFTA nominations. In recent years, the animation studio has acquired and created new divisions in an effort to diversify beyond the high-risk movie business. Films produced by DreamWorks Animation were formerly distributed worldwide by its main DreamWorks studio from 1998 to 2005, Paramount Pictures from 2006 to 2012, and 20th Century Fox from 2013 to 2017. Universal Pictures will distribute subsequent DreamWorks Animation films, starting on February 22, 2019, with the release of How to Train Your Dragon: The Hidden World. ==History== ===DreamWorks SKG era (1994–2004)=== On October 12, 1994, a trio of entertainment players, film director and producer Steven Spielberg, former Disney executive Jeffrey Katzenberg, and music executive David Geffen, founded DreamWorks SKG. To build the talent base, Spielberg brought over artists from his London-based studio, Amblimation, while Katzenberg recruited some of the top animation staff from Disney. Some of Amblimation's artists came to DreamWorks in 1995, when the studio's last feature was completed, with the rest doing so following the studio's closure in 1997. In 1995, DreamWorks signed a co-production deal with Pacific Data Images to form subsidiary PDI, LLC (PDI owned 60% of PDI, LLC, while DreamWorks SKG owned 40%). This new unit would produce computer-generated feature films, beginning with Antz in 1998. In the same year DreamWorks SKG produced The Prince of Egypt, which used both CGI technology and traditional animation techniques. In 1997, DreamWorks partnered with Aardman Animations, a British stop-motion animation studio, to co-produce and distribute Chicken Run (2000), a stop-motion film already in pre-production. Two years later they extended the deal for an additional four films. With Aardman doing stop-motion, they covered all three major styles, besides traditional and computer animation. This partnership had DreamWorks participating in the production of stop-motion films in Bristol, and also had Aardman participating in some of the CGI films made in the United States. Three years later, DreamWorks SKG created DreamWorks Animation, a new business division that would regularly produce both types of animated feature films. The same year DW acquired majority interest (90%) in PDI, and reformed it into PDI/DreamWorks, the Northern California branch of its new business division. In 2001, Shrek was released and went on to win the first Academy Award for Best Animated Feature Film. Due to the success of CGI animated films, DWA decided the same year to exit hand-drawn animation business after the next two of total four hand-drawn films. Beginning with Shrek 2 (2004), all released films, other than some co-produced with Aardman, were expected to be produced with CGI. The releases of Shrek 2 and Shark Tale also made DWA the first studio to produce two CGI animated features in a single year. ===Public corporation (2004–2012)=== The animation division was spun off into a publicly traded company named DreamWorks Animation SKG, Inc. on October 27, 2004. Katzenberg headed the new division, while Spielberg and Geffen remained on board as investors and consultants. DWA also inherited interests in PDI/DreamWorks. They made an agreement with their former parent to distribute all of their films until they deliver twelve new films, or December 12, 2010, whichever came last. On January 31, 2006, DWA entered into a distribution agreement with Paramount Pictures, which acquired DWA's former parent and distribution partner, DreamWorks SKG. The agreement granted Paramount the worldwide rights to distribute all animated films, including previously released films, until the delivery of 13 new animated feature films or December 31, 2012, whichever came last. DWA's partnership with Aardman ended after the release of Flushed Away in November 2006, having delivered three out of five films. The announcement was made before the film's release, on October 3, citing \"creative differences\". DWA retained the co-ownership of rights to all films co-produced with Aardman, with an exception being Wallace & Gromit: The Curse of the Were-Rabbit (2005), for which they only kept the worldwide distribution rights. On March 13, 2007, DreamWorks Animation announced it would release all of its films, beginning with Monsters vs. Aliens (2009), in stereoscopic 3D. Together with Intel, they co-developed a new 3D film-making technology, InTru3D. In 2008, DWA extended its production pipeline into Bangalore, India, where they established a special unit within Technicolor, named DreamWorks Dedicated Unit. The unit is owned by Technicolor, but DreamWorks hires and trains the animators, who then contribute to DreamWorks projects. DDU at first worked only on TV specials, such as Merry Madagascar (2009), Scared Shrekless (2010), and DVD projects. Eventually they started contributing to DreamWorks' feature films as well, beginning with animating part of Puss in Boots (2011). Since 2009, the studio has been a regular guest on the list of Fortune Magazine's 100 Best Companies to Work For. As the only entertainment company on the list, they ranked 47th in 2009, 6th in 2010, 10th in 2011, 14th in 2012, and 12th in 2013. Beginning in 2010, the studio had planned to release five feature films over the course of every two years, but the next year the studio revisited their plans, \"but beyond 2012, Katzenberg said the studio will play it by ear, even if that means abandoning his proclamation that DWA would try to release three pictures in a single year, every other year.\" In 2010, DWA became the first studio that released three feature-length CG-animated films in a year. The same year, the company purchased the film rights to the Trolls franchise. ===Diversification and expansion (2012–2015)=== In July 2012, DreamWorks Animation won a $155 million bid to acquire Classic Media, which has since been renamed to DreamWorks Classics. In August 2012, DreamWorks Animation formed a joint venture with Chinese investment companies to establish a Shanghai-based entertainment company, named Oriental DreamWorks, to develop and produce original Chinese films and their derivatives. According to a Los Angeles Times report, DreamWorks Animation was in talks with Sony Pictures to distribute its upcoming films, such as the 2013 releases of The Croods and Turbo. The report also mentioned a possibility where Sony would handle the United States distribution while 20th Century Fox would handle the international distribution. Renewal of the deal with Paramount was also open, but only with more favorable terms for Paramount (they even offered a one-year extension of the deal, but Katzenberg desired to get a better deal). In August 2012, DreamWorks Animation signed a five-year distribution deal with 20th Century Fox for all territories. However, the deal did not include the distribution rights of previously released films, which DWA acquired from Paramount later in 2014. Rise of the Guardians (2012) was the last DreamWorks Animation film to be distributed by Paramount Pictures, and The Croods became the first DreamWorks Animation film to be distributed by 20th Century Fox. On April 11, 2013, DreamWorks Animation announced that it has acquired the intellectual property for the Trolls franchise from the Dam Family and Dam Things. DreamWorks Animation, which has \"big plans for the franchise\", has become the exclusive worldwide licensor of the merchandise rights, except for Scandinavia, where Dam Things remains the licensor. On May 1, Katzenberg and DWA announced their intent to purchase YouTube channel AwesomenessTV, which was finalized later in the month.Lieberman, David. (May 1, 2013). DreamWorks Animation Agrees To Pay $33M+ For AwesomenessTV. Deadline.com. The next month, DWA announced a multi-year content deal to provide 300 hours of exclusive original content to the video on demand Internet streaming media provider, Netflix. Part of the intent of the deal was in part to establish a more reliable income for DWA to defray the financial risk of solely relying on the theatrical film market. The next day, DWA completed a five-year licensing agreement with Super RTL to start that September for the Classic Media library and the Netflix slate. With the Netflix and Super RTL deals in place for TV, DWA announced executive hiring for its new television group, DreamWorks Animation Television in late July. Former Nickelodeon senior executive Margie Cohn became Head of Television for the group. In September that same year, DreamWorks announced that it has acquired the TV library of London-based Chapman Entertainment with the programs to distributed through DWA's UK-based TV distribution operation. The next year, in February, DreamWorks announced the foundation of a new publishing division called DreamWorks Press, to publish books in print and digital form. In June, the rights to Felix the Cat were acquired by DreamWorks Animation from Felix the Cat Productions, owned by Don Oriolo. The same month, DreamWorksTV channel debuted on YouTube and operated by AwesomenessTV. DreamWorks Animation then purchased Paramount's distribution rights to the pre-2013 library in July, and since then, DreamWorks Animation's current distributor 20th Century Fox has assumed distribution rights to the library. The studio was reported to be acquired two separate times in the end of 2014. First, in September it was reported that the Japanese conglomerate SoftBank was in talks to acquire DreamWorks Animation for a price of $3.4 billion, but the next day, it was reported that SoftBank had withdrawn its offer. Next it was reported that Hasbro was in talks to buy DreamWorks Animation in November. The proposal reportedly calls for the combined company to take the name \"DreamWorks-Hasbro\" and for Jeffrey Katzenberg to become its chairman, but as a matter of policy, neither Hasbro nor DWA publicly comment on mergers and acquisitions. Two days later, the talks were reported to have fallen through. DreamWorks Animation announced their launch into the television broadcasting business on December 9, 2014, by creating their own channel called The DreamWorks Channel. With HBO Asia handling affiliate sales, marketing and technical services, the network will launch in several Asian countries (except China and Japan) in the second half of 2015. The channel first premiered in English on August 1, 2015, and a Thai- dubbed channel launched in September 2015. Also in December, DWA sold a 25% stake in AwesomenessTV for $81.25 million to the Hearst Corporation. On January 5, 2015, DreamWorks Animation announced that Bonnie Arnold, producer of the How to Train Your Dragon series and Mireille Soria, producer of the Madagascar series were named co-presidents of the studio's feature animation division. At the same time, it was also announced that Bill Damaschke will step down from his position as Chief Creative Officer. So far, under Arnold and Soria's current tenure they signed Jason Reitman and Edgar Wright to work on their own animation debuts. Two weeks later, PDI/DreamWorks completely shut down as part of its parent company's larger restructuring efforts. ===Universal Studios era (2016–present)=== On April 28, 2016, NBCUniversal officially announced its intent to acquire DreamWorks Animation for $3.8 billion, valuing the company at $41 per share. Jeffrey Katzenberg is to remain involved in the company as head of DreamWorks New Media, but was to cede control of the studio to Illumination Entertainment's CEO Chris Meledandri, who would oversee both. The sale was approved by board members, but subject to regulatory approval. At Guggenheim Partners' TMT Symposium, NBCUniversal CEO Steve Burke discussed how the purchase of DWA would fit into its business strategies. Burke explained that Meledandri planned to \"take a lot of the existing DreamWorks franchises and add value as we create new franchises\", and that the main goal was to \"[take] the low-single digit returns of the movie business and turn it into a different kind of business\" by creating new intellectual property that can be merchandised and adapted into theme park attractions. Burke reaffirmed a commitment to animated features, stating that Universal would be able to release as many as four animated films per-year, divided between DreamWorks and Illumination. Burke also outlined that the purchase would be beneficial to Universal's expanding presence in China (where it is building a new Universal Studios park in Beijing). DreamWorks Animation's last film with 20th Century Fox was Captain Underpants: The First Epic Movie, and DreamWorks Animation's first film with Universal Pictures will be How to Train Your Dragon 3 and also includes Everest, Trolls 2 and The Boss Baby 2. On June 21, 2016, the acquisition was approved by the U.S. Department of Justice. The purchase was closed on August 22, 2016; the company now operates as a division of the Universal Filmed Entertainment Group. Although a spokesperson stated that Meledandri would work with Universal Pictures to determine \"the most effective path forward for Illumination and DreamWorks Animation\", he did not take over DreamWorks as was previously announced, and the two studios remain separate. Bonnie Arnold and Mireille Soria retained their positions as co-presidents of DreamWorks' Feature Animation division, while Margie Cohn will lead a television animation division for the entire Universal Pictures group. DreamWorks' digital, marketing, consumer products, and gaming divisions will be absorbed into NBCUniversal. On December 21, 2016, Mireille Soria stepped down from her position as co-president of DreamWorks' Feature Animation division. In January 2017, Christopher DeFaria joined DreamWorks Animation in the newly created position of president of the DreamWorks Feature Animation Group. As president, DeFaria will oversee all aspects of DWA's feature animation business, including slate strategy, development, production; innovation and technology; and business affairs. On February 15, 2017, Universal acquired a minority stake in Amblin Partners, strengthening the relationship between Universal and Amblin, and reuniting a minority percentage of the DreamWorks Pictures label with DreamWorks Animation. On August 1, 2017, it was announced that DreamWorks Animation and Blumhouse Productions would be working on the animated film, Spooky Jack.http://deadline.com/2017/08/spooky-jack-dreamworks-animation-blumhouse- animated-scary-film-robert-ben-garant-1202140279/ The film is set to be released on September 17, 2021.http://bloody- disgusting.com/news/3460035/blumhouse-animated-film-spooky-jack-gets-distant- release-date/ ==Partnerships== DreamWorks Animation has an ongoing partnership with Hewlett-Packard, and the studio exclusively uses HP workstations and servers. In 2005, DWA partnered with HP to introduce HP Halo Telepresence Solutions, technologies that allow people in different locations to communicate in a face-to-face environment in real time. In 2005, AMD signed a three-year deal to provide processors to the studio. This relationship ended in 2008, and DreamWorks announced that they would use Intel processors for future productions. ===The DreamWorks Experience: Royal Caribbean Cruiseline=== The DreamWorks Experience is a package of character interactions and experiences, including shows: Ice shows, Aqua shows, Sailaway parties, parades, wow moments, meet and greets, and character dining, featuring from the Shrek franchise: Shrek, Princess Fiona, Puss in Boots, Kitty Softpaws. The Kung Fu Panda Franchise: Po the Panda, Tigress the Tiger. The Madagascar franchise: Alex the Lion, Gloria the Hippo, King Julien the Ringtail Lemur, Mort the goodman Lemur, The Penguins: Skipper, Kowalski, Rico, Private. How to Train your Dragon franchise: Toothless, Meatlug, Stoick, Gobber, and other DreamWorks Animation characters. The DreamWorks Experience was announced for Royal Caribbean cruise ships, including ships of the Freedom Class : Freedom and Liberty, Voyager Class : Voyager and Mariner, Oasis Class: Oasis, Allure, Harmony, and Quantum Class: Quantum, Anthem, Ovation, in June 2010. ===The DreamWorks Experience: Gaylord Hotels (2011–2015)=== In April 2011, the DreamWorks Experience was announced for resorts owned by Gaylord Entertainment in Nashville, Orlando, Dallas, and Washington, D.C. for a four-year contract ending January 1, 2015. After Gaylord was bought out by Marriott, Marriott owners did not renew the contract. == Filmography == === Franchises === Title Films Short films TV Seasons Release dates The Prince of Egypt 2 0 0 1998–2000 Shrek / Puss in Boots 6 8 6 2001–present Spirit 2 2 13 2002–2023 Madagascar 4 4 17 2005–present Kung Fu Panda 5 5 8 2008–present Monsters vs. Aliens 1 3 1 2009–2014 How to Train Your Dragon 4 6 22 2010–present Megamind 2 1 1 2010–present The Croods 2 3 10 2013–present Turbo 1 0 3 2013–2016 Rocky and Bullwinkle / Mr. Peabody & Sherman 1 1 5 2014–2019 Home 1 1 4 2015–2018 Trolls 4 5 15 2016–present Tales of Arcadia 1 0 6 2016–2021 The Boss Baby 3 2 6 2017–present Captain Underpants 2 0 4 2017–present Abominable 1 1 2 2019–present The Bad Guys 2 2 0 2022–present The Wild Robot 2 0 0 2024–present === Highest-grossing films === Highest-grossing films in North America Rank Title Year Box office gross 1 Shrek 2 2004 $441,226,807 2 Shrek the Third 2007 $322,719,944 3 Shrek 2001 $267,851,831 4 Shrek Forever After 2010 $238,736,787 5 How to Train Your Dragon $217,581,231 6 Madagascar 3: Europe's Most Wanted 2012 $216,391,482 7 Kung Fu Panda 2008 $215,434,591 8 Monsters vs. Aliens 2009 $198,351,526 9 Madagascar 2005 $193,595,521 10 Kung Fu Panda 4 2024 $193,590,620 11 The Croods 2013 $187,168,425 12 Puss in Boots: The Last Wish 2022 $186,090,535 13 Madagascar: Escape 2 Africa 2008 $180,010,950 14 Home 2015 $177,397,510 15 How to Train Your Dragon 2 2014 $177,002,924 16 The Boss Baby 2017 $175,003,033 17 Kung Fu Panda 2 2011 $165,249,063 18 Shark Tale 2004 $160,861,908 19 How to Train Your Dragon: The Hidden World 2019 $160,799,505 20 Over the Hedge 2006 $155,019,340 21 Trolls 2016 $153,856,089 22 Puss in Boots 2011 $149,260,504 23 Megamind 2010 $148,415,853 24 Kung Fu Panda 3 2016 $143,528,619 25 The Wild Robot 2024 $143,182,115 Highest-grossing films worldwide Rank Title Year Box office gross 1 Shrek 2 2004 $928,974,162 2 Shrek the Third 2007 $808,308,862 3 Shrek Forever After 2010 $752,600,867 4 Madagascar 3: Europe's Most Wanted 2012 $746,921,274 5 Kung Fu Panda 2 2011 $665,692,281 6 Kung Fu Panda 2008 $631,744,560 7 How to Train Your Dragon 2 2014 $621,537,519 8 Madagascar: Escape 2 Africa 2008 $603,900,354 9 The Croods 2013 $587,204,668 10 Puss in Boots 2011 $554,987,477 11 Kung Fu Panda 4 2024 $547,689,492 12 Madagascar 2005 $542,063,846 13 The Boss Baby 2017 $527,965,936 14 How to Train Your Dragon: The Hidden World 2019 $521,799,505 15 Kung Fu Panda 3 2016 $521,170,825 16 How to Train Your Dragon 2010 $494,878,759 17 Puss in Boots: The Last Wish 2022 $481,757,663 18 Shrek 2001 $484,596,038 19 Home 2015 $386,041,607 20 Monsters vs. Aliens 2009 $381,509,870 21 Shark Tale 2004 $374,583,879 22 Penguins of Madagascar 2014 $373,515,621 23 Trolls 2016 $347,013,487 24 Over the Hedge 2006 $339,795,890 25 The Wild Robot 2024 $324,291,115 ==Related pages== * DICE Los Angeles * List of DreamWorks Animation programs * Illumination Entertainment * Universal Animation Studios * Amblimation * Pixar * Walt Disney Animation Studios ==References== ==Other websites== * * * Category:1994 establishments in California Category:American animation studios Category:NBCUniversal",
 "title": "DreamWorks Animation"
}