{
 "id": "343530",
 "text": "The 2012 FIFA U-17 Women's World Cup women's football tournament is the third such tournament. It will be held in Azerbaijan from 22 September to 13 October, following a decision by the Executive Committee on 19 March 2010. France won the title after defeating Korea DPR 1–1 (7–6 after pen.). ==Mascot== The official mascot of this World Cup is The Top Top Girl. This means ball in Azerbaijani. It is a young girl with the national flag painted on her cheeks. The body is blue, red, green and white like the host's national team. Her brown hair in a ponytail is meant to look like a buta. This is a curving decorative motif widely used in Azerbaijani art. ==Qualified teams== Confederation Qualifying Tournament Qualifiers AFC (Asia) 2011 AFC U-16 Women's Championship CAF (Africa) 2012 African U-17 Women's World Cup Qualifying Tournament CONCACAF (North, Central America and Caribbean) 2012 CONCACAF Women's U-17 Championship CONMEBOL (South America) 2012 South American Under 17 Women's Championship OFC (Oceania) 2012 OFC Women's Under 17 Qualifying Tournament UEFA (Europe) 2012 UEFA Women's Under-17 Championship Host nation Host nation :1.Teams that made their debut. ==Venues== All four venues were first to be only in Baku.All U17 World Cup matches to be held in Baku There will also be matches in Lankaran. Tofik Bakhramov Stadium is the stadium where the final stages will be held. ==Results== RSSSF ===Group stage=== ====Group A==== Team Pld W D L GF GA GD Pts align=left 3 2 1 0 15 1 +14 7 align=left 3 2 1 0 3 1 +2 7 align=left 3 1 0 2 4 4 0 3 align=left 3 0 0 3 0 16 -16 0 ====Group B==== Team Pld W D L GF GA GD Pts align=left 3 1 2 0 13 2 +11 5 align=left 3 1 2 0 11 3 +8 5 align=left 3 1 2 0 7 1 +6 5 align=left 3 0 0 3 2 27 -25 0 ====Group C==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 17 0 +17 9 align=left 3 2 0 1 5 8 -3 6 align=left 3 1 0 2 1 10 -9 3 align=left 3 0 0 3 3 8 -5 0 ====Group D==== Team Pld W D L GF GA GD Pts align=left 3 2 1 0 8 4 +4 7 align=left 3 2 0 1 8 2 +6 6 align=left 3 1 1 1 5 3 +2 4 align=left 3 0 0 3 2 14 -12 0 ===Knockout stage=== {{Round8-with third |4 October – Baku (8KM)||0 (3)||0 (5) |5 October – Baku (8KM)||0||1 |4 October – Baku (8KM)||2||1 |5 October – Baku (8KM)||2||1 |9 October – Baku (8KM)||2||0 |9 October – Baku (8KM)||2||1 |13 October – Baku (Tofik)||1 (7)||1 (6) |13 October – Baku (Tofik)||1||0 |widescore=yes}} ==Awards== The following awards were given for the tournament: Golden Ball Silver Ball Bronze Ball Griedge Mbock Bathy Ri Hyang-Sim Yui Hasegawa Golden Shoe Silver Shoe Bronze Shoe Ri Un-Sim Chinwendu Ihezuo Halimatu Ayinde FIFA Fair Play Award Golden Glove Romane Bruneau ==References== ==Related pages== *FIFA.com U-17 Women's World Cup 2012 website Category:FIFA U-17 Women's World Cup Category:2012 in association football Category:21st century in Azerbaijan Category:Football in Azerbaijan Category:September 2012 events Category:October 2012 events",
 "title": "2012 FIFA U-17 Women's World Cup"
}