{
 "id": "343509",
 "text": "The term Eastern world means very broadly the various cultures or social structures and philosophical systems of Eastern Asia or geographically the Eastern Culture. This includes the Indian subcontinent (which is Bangladesh, Bhutan, India, Myanmar, Pakistan, Sri Lanka, the Maldives, Nepal and sometimes Afghanistan), the Far East (which is China, Taiwan, Vietnam, Cambodia, Thailand, Philippines, Malaysia, Mongolia, Indonesia, Japan, North Korea, South Korea), Eastern Europe/Eurasia (Russia, Belarus, Ukraine, Georgia, Kazakhstan, Azerbaijan and Turkey). The Middle East/Near East and Central Asia are, as their names imply, often considered 'east' in terms of Europe ==Introduction== The division between \"East\" and \"West\" is from European cultural history. There is a difference between European Christendom and the alien cultures beyond it to the East. With the European colonization of the Americas the East/West distinction became global. The idea of an Eastern, \"Indian\" (Indies) or \"Oriental\" sphere was made stronger by ideas of racial as well as religious and cultural differences. Such differences were shown by Westerners in the scholarly tradition known as Orientalism and Indology. People from the East are known by certain regions in the West as \"Oriental\". During the Cold War, the term \"Eastern world\" was sometimes used to mean the Eastern Bloc, which was the Soviet Union, China and their communist allies. The term \"Western world\" often meant the United States and its NATO allies such as the United Kingdom. The idea is often another term for the Far East—a region that bears considerable cultural and religious sameness. Eastern philosophy, art, literature, and other traditions, are often found throughout the region in places of high importance, such as popular culture, architecture and traditional literature. The spread of Buddhism and Hindu Yoga is partly responsible for this. ==Eastern culture== Eastern culture has created many themes and traditions. Some important ones are: *Eastern religion, Eastern philosophy **Far Eastern religions ***Confucianism — the belief that human beings are teachable, improvable and perfectible through personal and communal endeavour especially including self-cultivation and self-creation. ***Eastern Buddhism ***Shinto ***Daoism **Indian religions ***Dharmic religions ****Buddhism — path of liberation attained through insight into the ultimate nature of reality ****Hinduism — an umbrella term for religious sects native to India ****Jainism ****Sikhism — A religion that developed in the warring plains of Punjab in an atmosphere of ideological clash between Islam and Hinduism. Its followers keep spiritual as well as martial qualities. ***Ethnic religions (Folk religions) ****Donyi Poloism — originated from Arunachal Pradesh ****Bathouism — originated from Assam ****Sanamahism — An eastern religion developed in Manipur (politically inside India) but the ideologies and cultural heritage closer to the Sinosphere. **The Middle East, today largely the same as the Islamic world ***Christianity — like other Abrahamic religions like Judaism and Islam, originates in the Middle East, where it is now a small minority religion. ***Islam — the majority of the world Muslim population have always lived in Asia, due to Islam spreading and becoming the main religion of these areas. ***Judaism — although not as much of a presence as it once was, Judaism still exists in Asia (see Mizrahi Jews). ***Zoroastrianism, the monotheistic state religion of Sassanid Persia *Oriental medicine **Ayurveda **Chinese medicine **Kampo **Traditional Tibetan medicine **Traditional Korean Medicine == References == * Category:Country classifications Category:Political geography Category:Cultural geography",
 "title": "Eastern world"
}