{
 "id": "343672",
 "text": "Jeremy John Irons (born 19 September 1948) is an English actor and activist. The movies in which he has starred include The Lion King (1994), Die Hard with a Vengeance (1995), Lolita (1997), and Batman v Superman: Dawn of Justice (2016). Irons trained as an actor at the Bristol Old Vic Theatre School. He played John the Baptist and Judas in Godspell for a total of 1,128 performances.Stanley Green's Encyclopaedia of the Musical, Cassell (1976) In 2005, Irons won both an Emmy award and a Golden Globe award for his supporting role in the television mini-series, Elizabeth I. ==Filmography== Year Title Role Notes 1980 Nijinsky Mikhail Fokine 1981 Charles Henry Smithson/ Mike Nominated — BAFTA Award for Best Actor in a Leading Role 1981 Brideshead Revisited Charles Ryder 1982 Moonlighting Nowak 1983 Betrayal Jerry 1984 Harold 1984 Swann in Love Charles Swann 1986 Father Gabriel Nominated — Golden Globe Award for Best Actor - Motion Picture Drama 1988 Guy Jones 1987 My Fair Lady Henry Higgins 1988 Dead Ringers Beverly Mantle/ Elliot Mantle 1989 Australia Edouard Pierson 1989 Danny, the Champion of the World William Smith 1990 Reversal of Fortune Claus von Bülow 1991 Prisoner 1991 Kafka Kafka 1992 H.G. Wells 1992 Waterland Tom Crick 1992 Damage Dr. Stephen Fleming 1993 M. Butterfly René Gallimard 1993 Esteban Trueba 1994 Spaceship Earth Narrator 1994 Scar (voice) 1995 Die Hard with a Vengeance Simon Gruber 1996 Stealing Beauty Alex Nominated – Satellite Award for Best Supporting Actor – Motion Picture 1997 Chinese Box John 1997 Lolita Humbert Humbert 1998 Aramis 1999 Islands of Adventure: Poseidon's Fury: Escape from the Lost City Poseidon voice actor 2000 Dungeons & Dragons Profion 2000 Longitude Rupert Gould Television series (4 episodes) 2001 Jack Elgin 2001 Beckett on Film – Ohio Impromptu Reader/ Listener 2002 Callas Forever Larry Kelly 2002 Last Call F. Scott Fitzgerald 2002 Über-Morlock 2003 And Now... Ladies and Gentlemen Valentin Valentin 2003 Kingdom of David: The Saga of the Israelites Voice 2003 Broadway: The Golden Age, by the Legends Who Were There Himself 2004 Mathilde Pukovnik Unprofora 2004 Antonio 2004 Being Julia Michael Gosselyn Nominated – Satellite Award for Best Supporting Actor – Motion Picture 2005 Gallipoli Gallipoli 2005 Kingdom of Heaven Tiberias 2005 Casanova Pucci 2006 Inland Empire Kingsley Stewart 2006 Eragon Brom 2006 Elizabeth I Robert Dudley, 1st Earl of Leicester 2008 Havelock Vetinari Television miniseries 2008 Appaloosa Randall Bragg 2009 Alonso Avellaneda 2009 Georgia O'Keeffe Alfred Stieglitz 2011 Margin Call John Tuld 2011 Rodrigo Borgia 2013 Beautiful Creatures Macon Ravenwood 2016 Batman v Superman: Dawn of Justice Alfred Pennyworth 2017 Justice League Alfred Pennyworth Post-Production ==References== ==Other websites== * Category:1948 births Category:Living people Category:Annie Award winners Category:Best Actor Academy Award winners Category:Emmy Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:People from the Isle of Wight Category:Screen Actors Guild Award winners Category:Tony Award winning actors",
 "title": "Jeremy Irons"
}