{
 "id": "343660",
 "text": "was a after Jōhei and before Tenryaku. This period spanned the years from May 938Nussbaum, Louis-Frédéric. (2005). \"Jōhei\" in Japan Encyclopedia, p. 429. through April 947.Nussbaum, \"Tenryaku\" at p. 961. The reigning emperors were and .Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 134-155; Brown, Delmer et al. (1979). Gukanshō, p. 294-295; Varley, H. Paul. (1980). Jinnō Shōtōki, p. 181-183. ==Events of the Tengyō era== * 6 April 938 (Tengyō 1, 4th day of the 3rd month): Ten pairs of roosters were matched-up in cockfights before the emperor.Titsingh, p. 136. * 938 (Tengyō 1, 4th month): Many small earthquakes were felt in Heian-kyo from the 10th through the 29th days of this month. * 939 (Tengyō 1, 1st month): Fujiwara no Tadahira celebrated his 60th birthday. * 939 (Tengyō 2, 5th month): Fujiwara no Tsunesuke died. * 939 (Tengyō 2, 12th month): Taira no Masakado led a armed revolt which is known as Nussbaum, \"Jōhei Tengyō no Ran\" at p. 429. * 941 (Tengyō 4, 7th month) : Fujiwara no Sumitomo died * 941 (Tengyō 4, 11th month): Tadahira was made kampaku.Titsingh, p. 138. * 944 (Tengyō 7, 11th month): Fujiwara no Saneyori, the eldest son of Tadahira, was named Minister of the Right (udaijin). * 945 (Tengyō 8, 11th month): The Fujiwara no Nakahira died at age 71. He had held the office of Minister of the Left (sadaijin). * 16 May 946 (Tengyō 9, 13th day of the 4th month): In the 16th year of the reign of Suzaku, the emperor abdicated; and the succession (senso) was received by his younger brother, Nariakira-shinnō.Brown, p. 295; Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2012-5-22. * 31 May 946 (Tengyō 9, 28th day of the 4th month): Emperor Murakami's role as monarch was confirmed by ceremonies (the sokui).Titsingh, p. 139. ==Related pages== * Heian period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Tengyō 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 938 939 940 941 942 943 944 945 946 947 Preceded by: Jōhei Era or nengō: Tengyō Succeeded by: Tenryaku Category:Japanese eras Category:930s establishments Category:10th- century establishments in Japan Category:10th-century disestablishments in Japan",
 "title": "Tengyō"
}