{
 "id": "343701",
 "text": "The Nakhchivan Autonomous Republic (, ) is a landlocked exclave of the Republic of Azerbaijan. The region covers Official portal of Nakhchivan Autonomous Republic :Nakhchivan Autonomous Republic with a population of 459,600 bordering Armenia (border ) to the east and north, Iran (border ) to the south and west, and Turkey (border ) to the northwest. ==Name== \"Nakhchivan\" is believed to have Persian origins, with \"Nakhjavan\" meaning \"place of descent\" or \"landing.\" The name could be associated with geographical features or historical events in the region. ==History== Nakhchivan has a rich history dating back to ancient times. It was part of various empires, including the Persian and Ottoman. In the 20th century, it became an autonomous republic within the Soviet Union. Today, it's an integral part of Azerbaijan, maintaining its unique cultural and historical significance. ==Districts== Nakhchivan has eight administrative divisions. Seven of these are districts, while the capital city is separate. Map ref. Administrative division Capital Type Area (km²) Population (1 August 2011 estimate)Official portal of Nakhchivan Autonomous Republic :Cities and regions Notes 1 Babek (Babək) Babek Rayon 749,81 66,2 Formerly known as Nakhchivan; renamed after Babak Khorramdin in 1991 2 Julfa (Culfa) Julfa Rayon 1012,75 43,000 Also spelled Jugha or Dzhulfa. 3 Kangarli (Kəngərli) Givraq Rayon 711,86 28,900 Split from Babek in March 2004 4 Nakhchivan City (Naxçıvan Şəhər) Municipality 191,82 85,700 Split from Nakhchivan (Babek) in 1991 5 Ordubad Ordubad Rayon 994,88 46,500 Split from Julfa during Sovietization 6 Sadarak (Sədərək) Heydarabad Rayon 153,49 14,500 Split from Sharur in 1990; de jure includes the Karki exclave in Armenia, which is de facto under Armenian control 7 Shakhbuz (Şahbuz) Shahbuz Rayon 838,04 23,400 Split from Nakhchivan (Babek) during Sovietization Territory roughly corresponds to the Čahuk (Չահւք) district of the historic Syunik region within the Kingdom of ArmeniaHewsen. Armenia: A Historical Atlas, p. 123. 8 Sharur (Şərur) Sharur Rayon 847,35 106,600 Formerly known as Bash-Norashen during its incorporation into the Soviet Union and Ilyich (after Vladimir Ilyich Lenin) from the post- Sovietization period to 1990 Total 5,500 414,900 ==Famous people from Nakhchivan== ===Political leaders=== * Heydar Aliyev, former President of Azerbaijan (1993–2003) and father of the current President of Azerbaijan, Ilham Aliyev (2003–present). * Abulfaz Elchibey, former President of Azerbaijan (1992–1993) * Rasul Guliyev, former speaker of the National Assembly of Azerbaijan (1993–1996) and opposition leader * Christapor Mikaelian, founding member of the Armenian Revolutionary Federation * Stepan Sapah-Gulian, leader of the Armenian Social Democrat Hunchakian Party (19th-20th century) * Jafar Kuli Khan Nakhchivanski, the founder of the short- lived Republic of Aras * Ibrahim Abilov, first and only ambassador of Azerbaijan SSR to Turkey * Garegin Nzhdeh, famous Armenian revolutionary, military leader and political thinker ===Religious leaders=== * Alexander Jughaetsi (Alexander I of Jugha), Catholicos of All Armenians (1706–1714) * Hakob Jughaetsi (Jacob IV of Jugha), Armenian Catholicos (1655–1680) * Azaria I Jughaetsi, Armenian Catholicos of the Holy See of Cilicia (1584–1601) ===Military leaders=== * Abdurahman Fatalibeyli, Soviet army major who defected to the German forces during World War II * Ehsan Khan Nakhchivanski, Russian military general * Huseyn Khan Nakhchivanski, Russian cavalry general and the only Muslim to serve as General-Adjutant of the Russian Tsar * Ismail Khan Nakhchivanski, Russian military general * Kelbali Khan Nakhchivanski, Russian military general * Jamshid Khan Nakhchivanski, Soviet and Azerbaijani military general ===Writers and poets=== * M.S. Gulubekov, writer * Huseyn Javid, poet * Jalil Mammadguluzadeh, writer and satirist * Ekmouladdin Nakhchivani, medieval literary figure * Hindushah Nakhchivani, medieval literary figure * Abdurrakhman en-Neshevi, medieval literary figure * Mammed Said Ordubadi, writer * Heyran Khanum, late medieval poet * Elşen Hudiyev, contemporary poet and writer * Mammad Araz, poet ===Others=== * Vladimir Makogonov, chess International Master and Grandmaster * Ajami Nakhchivani, architect and founder of the Nakhchivan school of architecture * Gaik Ovakimian, Soviet Armenian spy * Ibrahim Safi, Turkish artist * Rza Tahmasib, Azerbaijani film director ==Related pages== *Administrative divisions of Azerbaijan *Economic regions of Azerbaijan *Nakhchivan (city) ==References== Category:Caucasus",
 "title": "Nakhchivan Autonomous Republic"
}