{
 "id": "3440",
 "text": "Kenya is a country in East Africa, about halfway down the continent, near the horn of Africa. It is about the size of France, and almost as large as the U.S. state of Texas. Its capital city is Nairobi, which is the 14th largest city in Africa (after Accra, Ghana). Kenya is bordered by the Indian Ocean and the Jubaland part of Somalia to its east. To the north, it borders Ethiopia; to the northwest, it borders South Sudan; to the south, Tanzania; and to the west, Uganda and Lake Victoria. Seaside cities include Mombasa and Malindi (on the Indian Ocean), Nyeri, Nanyuki, Naivasha, and Thika (in the Kenyan Highlands), and Kisumu (on Lake Victoria). The first humans may have lived near Kenya's lakes along the Great Rift Valley, which cuts Kenya from north to south. == People == Kenya is home to many different indigenous peoples with their own cultures, languages, and histories. Like in the Congo, Kenyans are divided into many tribes that often fight. However, Kenya's government is trying to get the people to cooperate and has encouraged them to run businesses and factories together. === Languages === English and Swahili are Kenya's official languages. However, there are at least 44 living languages in Kenya, plus one extinct language that is not spoken any more. Because of colonialism, Kenyan students are required to learn English, and it is used in schools and universities. == Geography & climate == Kenya's coast is tropical and gets very hot. Inland, it is drier and cooler where the mountains rise up. The highest mountain in the country is Mt. Kenya, which is tall. Mount Kilimanjaro crosses over the south border, with Tanzania, but its highest part is in Tanzania. == Land and animals == Kenya is a country of grassland. Three- fourths of the country is covered with plains. They are low in altitude along the coast, but get higher further inland, making a large plateau. The area east of Lake Turkana is the only true desert, but the rest can be very desert- like. Kenya's soil is generally not rich, but it is productive land, especially in the highlands. This is a very dry grassland with poor soil. Kenya has very few mineral resources, but the most common is soda ash. === Savannas === Savannas usually get between 4 and 16 inches (100 to 400 mm) of rain in a year. They are called savannas because of the type of plants that live there and how they get their rain. Savannas have a wet season and a dry season. It can rain hard for long periods of time during the wet season, then not rain at all in the dry season. Savannas that have more rain often have many trees spaced out across their plains. To help them live through the long dry seasons without rain, these trees have deep roots, or they store water like desert plants do. Even drier savannas will have only grass, and that too only in a few clumps. The dry land is very bad for crops, but it is a wonderful place for all kinds of wild animals to gather and range. === Animals === Kenya has many special wildlife parks, where animals are kept and protected from poachers. People visit from all over the world to go on photo safaris in the parks. Animals like the rhinoceros, giraffe, wildebeest, elephant, cheetah, antelope, and lion all live on the savanna grasslands. The area's wild herbivores move as they eat, and they never stay in one spot because there is not enough grass for all of them. Many people raise cattle on the savanna. These animals are kept in one place and often eat up all the grass there. == History == The first humans may have lived near lakes along the Great Rift Valley in what is now Kenya. === Colonization === Kenya was colonized by the British Empire, who began taking land from indigenous peoples to build ranches. They also discriminated against Kenyans in their own land. Kenyans who opposed British colonization formed a group called the Kenya Land and Freedom Army, or Mau Mau. The group fought a war against Britain for independence. The British committed war crimes to stop the Mau Mau, but on December 12, 1963 they agreed to give Kenya independence. === Independence === For many years after independence, a single party, the Kenya African National Union (KANU), ruled the country. General elections were held every 5 years. However, only members of the ruling party, KANU, were allowed to be candidates for political office. The party used the police to harass and torture socialists and communists in Kenya, and worked closely with Britain and the United States to keep them out of politics. === Today === William Ruto is currently the president of Kenya, with Rigathi Gachagua as his Deputy. The two leaders have had political conflicts after Kenyatta agreed to a peace treaty often called a 'handshake' with Kenya's opposition leader, Raila Odinga. This occurred after the 2017 General Elections on whom should succeed Kenya's presidency in 2022. The president supported Odinga. == Education == === Primary school & high school === All Kenyans of school-going age are required to attend primary school. However, school fees and required uniforms often keep students away from school. The Kenyan school system consists of 8 years of primary school (Standard 1 through 8), 4 years of high school (Form 1 through 4) and 4 years of university. However, in 2018 there were plans to change the system to 2 years of pre-school, 6 years of primary school, 3 years of junior high school, 3 years in senior high school, and 3 years in university (2-6-6-3). === Exams & university === At the end of primary school, all students sit for a standardized exam called Kenya Certificate of Primary Education (KCPE). Students' grades on this exam determine which high school they will attend. In Form 4 (the last year in high school), students sit for another exam called the Kenya Certificate of Secondary Education (KCSE). The highest-achieving students are granted admission into the 5 national universities (Nairobi, Jomo Kenyatta University of Agriculture and Technology, Kenyatta University, Egerton University and Moi University). Tertiary colleges, like Globovillee college, also feed the diploma graduates to universities. == Government == Since Kenya became independent in 1963, it usually had a one-party government. In 1991, a section of the constitution was discarded, which automatically made it a multi-party state. Kenya is a member of the British Commonwealth. It is a developing country and is rapidly becoming modernized. ===Counties=== In 2012, Kenya was divided into 47 counties. Each county is led by a governor. These counties are further subdivided into 350 constituencies. Each of these is represented in the National Assembly by Members of Parliament. In the past, Kenya was divided into provinces instead of counties. ==Related pages== *Kenya at the Olympics *Kenya national football team *List of rivers of Kenya == References == ==Other websites== *Kenya Photo Gallery category:education_by_country Category:1963 establishments in Africa Category:Commonwealth member states Category:English-speaking countries Category:Swahili-speaking countries and territories",
 "title": "Kenya"
}