{
 "id": "344224",
 "text": "The Hawaiian–Emperor seamount chain is the Hawaiian Islands and the Emperor Seamounts: together they form a vast underwater mountain region of islands, seamounts, atolls, shallows, banks and reefs. The line goes southeast to northwest beneath the northern Pacific Ocean; and many of the underwater mountains are guyots.Frankel, Henry R. (2012). \"The Continental Drift Controversy: Introduction of Seafloor Spreading,\" p. 292; Clague D.A. & G.B. Dalrymple. 1987. \"The Hawaiian-Emperor volcanic chain, Part I. Geologic evolution,\" In R.W. Decker, T.L. Wright & P.H. Stauffer, eds. Volcanism in Hawaii, U.S. Geological Survey Professional Paper 1350, pp. 5-54; retrieved 2012-6-9. The seamount chain, with over 80 identified undersea volcanoes, stretches over from the Aleutian Trench in the far northwest Pacific to the Loʻihi seamount, the youngest volcano in the chain, which lies about southeast of the Island of Hawaiʻi. The oldest age for the Emperor Seamounts is 81 million years, and comes from Detroit Seamount. However, Meiji Guyot, located to the north of Detroit Seamount, is likely somewhat older. In 1963, geologist John Tuzo Wilson explained that the Hawaiian-Emperor seamount chain was created by a hotspot of volcanic activity that stood as the Pacific tectonic plate moved over it. This left a trail of volcanic islands and seamounts. A \"bend\" or \"V\" in the chain marks a shift in the movement of the Pacific plate some 47 million years ago, from a northward to a more northwesterly direction. The bend shows how a tectonic plate can shift direction suddenly. A look at the USGS map on the origin of the Hawaiian Islands clearly shows this \"spearpoint\". Recent research shows that the hotspot itself may have moved with time. Some evidence comes from analysis of the orientation of the ancient magnetic field preserved by magnetite in ancient lava flows sampled at four seamounts. == Hawaiian Islands and Seamounts == Name Last Eruption Date Type Age Notes Kamaʻehuakanaloa Seamount (formerly Lōʻihi) 1996 seamount 400000 years the youngest of the Hawaiian volcanoes. last eruption occurred in 1996 which formed a crater known as \"Pele's pit\". will eventually breach the surface and become the newest Hawaiian island. Kīlauea 2021-now shield volcano 300000-600000 years ago the youngest Hawaiian volcano above sea level. has been in almost continuous eruption from 1983-2018 and since 2021 Mauna Loa 2022-Now Shield volcano 700000-1 million years currently the largest subaerial volcano on earth Hualālai 1800-1801 shield volcano > 300000 Mauna Kea 4460 Years Ago (YA) shield volcano ~1 million years Considered to be the largest mountain in the world from base to summit kohala 120000 YA shield volcano 120000-1 million years oldest existing part of the big island mahukona 470000 YA seamount 273000-341000 years haleakala between 1480 and 1600 shield volcano ~ 2 million oldest active volcano in the Hawaiian emperor seamounts west maui less than 320000 years ago mountain range 1.32±0.04 million makes up the entire west quarter of maui Kaho'olawe 1 MYA volcanic island > 1.03±0.18 million smallest of the 8 main Hawaiian Islands. most of the volcano has long disappeared beneath the waves Lānaʻi 1.2 MYA volcanic island 1.28±0.04 million years smallest currently accessible inhabited island east molokai 1.3 MYA mountain range 1.76±0.04 million about 1.5 million years ago, the northern face of the volcano suffered a huge collapse, causing a large tsunami. only the southern half remains above the sea today penguin bank 1.76 MYA seamount 2.2 million years was once a large part of the prehistoric island of Maui Nui. Now lies in relatively shallow waters capped with coral Ko'olau range 32000 YA possibly dormant mountain range 2.7 million years partially destroyed remains of a shield volcano which suffered a large collapse before the Molokai event Wai'anae range 2.5 MYA mountain range 2.5-3.9 million years remains of an eroded shield volcano. last erupted around 2.5 million years ago Ka'ena ridge 3 mya seamount/ mountain range 3.5-4.9 million years submerged remnants of a shield volcano that has long since disappeared beneath the waves Ka'ula over 2 MYA volcanic island 3.8-4.2 million years tiny, crescent shaped island. uninhabited Ni'ihau 2 MYA volcanic island 4.89±0.11 smallest inhabited island in the Hawaiian archipelago. Kaua'i 1.41 MYA volcanic island 4.9-5.3 million years the oldest of the main Hawaiian islands ==North-western Hawaiian islands== Name Type Age Notes Nihoa volcanic island 6.9-7.5 million years small rocky island which once held a small population of inhabitants about 1000 years ago. youngest North-Western Hawaiian island above sea level Necker island volcanic island 9.9-10.7 million years small island with traces of civilisation French Frigate shoals Atoll 12 million years largest and youngest atoll in the Hawaiian emperor seamount chain gardner pinnacles Rock Formations 12.3±1.0 million 2 small rock formations surrounded by a large reef Raita Bank guyot 12.3 to 19.9 million years youngest named guyot in the chain Maro reef Atoll 12.3 to 19.9 million largest coral reef in the chain Laysan Atoll and island 12.3 to 19.9 million Lisianski Island atoll 19.9 to 20.6 million A small island surrounded by a huge coral reef nearly the size of Oahu. named after a Russian navy captain who ran aground on this island Pearl and Hermes Atoll atoll and islands 20.6±2.7 million a bunch of small sandy islands with a lagoon and coral reef ladd seamount Guyot 20.6 to 27.7 million Midway Atoll Atoll 27.7±0.6 million the site of a key battle in the 2nd world war Nero seamount Guyot 27.7 to 38.7 million Kure atoll atoll 27.7 to 38.7 million oldest surviving Atoll in the chain ==Emperor seamounts table== Name Type Coordinates Age Notes Hancock Seamount Colahan Seamount ref group=\"n\">The error estimate is given for 2 standard deviations (95% of data contained within this range). --> Abbott Seamount Daikakuji SeamountGeographic.org, \"Daikakuji Seamount\"; retrieved 2012-6-9. Also the name of a Buddhist temple in Kyoto, Daikaku-ji Kammu GuyotGeographic.org, \"Kammu Guyot\"; retrieved 2012-6-9. Named after Emperor Kammu, former ruler of Japan Yūryaku GuyotGeographic.org, \"Yuryaku Guyot\"; retrieved 2012-6-9. Named after Emperor Yūryaku, former ruler of Japan Kimmei SeamountGeographic.org, \"Kimmei Seamount\"; retrieved 2012-6-9. Named after Emperor Kimmei, former ruler of Japan Kōkō GuyotGeographic.org, \"Kōkō Guyot\"; retrieved 2012-6-9. Named after Emperor Kōkō, former ruler of Japan Ōjin GuyotGeographic.org, \"Ōjin Guyot\"; retrieved 2012-6-9. Named after Emperor Ōjin, former ruler of Japan Jingū GuyotGeographic.org, \"Jingū Guyot\"; retrieved 2012-6-9. Named after Empress Jingū, former ruler of Japan Nintoku GuyotGeographic.org, \"Nintoku Guyot\"; retrieved 2012-6-9. Named after Emperor Nintoku, former ruler of Japan Yōmei SeamountGeographic.org, \"Yomei Seamount\"; retrieved 2012-6-9. Named after Emperor Yōmei, former ruler of Japan Suiko GuyotGeographic.org, \"Suiko Guyot\"; retrieved 2012-6-9. Named after Empress Suiko, former ruler of Japan Detroit GuyotGeographic.org, \"Detroit Tablemount\"; retrieved 2012-6-9. Well-documented seamount, second-oldest Meiji GuyotGeographic.org, \"Meiji Guyot\"; retrieved 2012-6-9. Named after Emperor Meiji, former ruler of Japan; oldest known seamount in the chain == Related pages == * List of volcanos * Active volcano * Dormant volcano ==References== Category:Seamounts Category:Geography of Hawaii Category:Pacific Ocean",
 "title": "Hawaiian–Emperor seamount chain"
}