{
 "id": "344473",
 "text": "was a after a late 7th century interruption in the sequence of nengō after Shuchō and before Keiun. This period started in March 701 and ended in May 704.Nussbaum, Louis-Frédéric. (2005). \"Taihō\" in Japan Encyclopedia, p. 924. The reigning emperor was .Nussbaum, \"Mommu Tennō,\" p. 655; Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 60-63; Brown, Delmer. (1979). Gukanshō, pp. 270-271; Varley, H. Paul. (1980). Jinnō Shōtōki. pp. 137-140. ==History== The system of nengō mirrored the Chinese system of eras (nianhao).Nussbaum, \"Taika\" at p. 924. The use of nengō marked a new phase in the history of the Imperial court. It became an example of growth in political power.Bialock, David T. (2007). Eccentric Spaces, Hidden Histories: Narrative, Ritual, and Royal Authority from the Chronicles of Japan to the Tale of the Heike, pp. 56-57. Taihō was adopted to mark the discovery of gold in Tsushima.Bender, Ross. (2009). \"The Suppresion of the Tachibana Naramaro Conspiracy,\" Japanese Journal of Religious Studies 37/2:225; compare mirrored full-text ; retrieved 2012-10-23. ===Timeline=== The system of Japanese era names was not the same as Imperial reign dates. ==Events of the Taihō era== * 701 (Taihō 1): Plans for mission to the Tang court was approved.Fogel, Joshua A. (2009). Articulating the Sinosphere: Sino-Japanese Relations in Space and Time, pp. 102-107; publisher's blurb; * 702 (Taihō 2): The or Taihōryō reorganized Japan's government.Nussbaum, \"Taihō ritsuryō\" at p. 924. It completed the Taika Reforms.Asakawa, Kan'ichi. (1903). The Early Institutional Life of Japan, p. 13; Nussbaum, \"Taika no kaishin\" at p. 924. * 701 (Taihō 2): A mission to the Tang court was led by . The diplomats travelled by ship. This was called the \"embassy of Taihō\" because it was begun during this era.Ponsonby-Fane, Richard. (1962). Sovereign and Subject, p. 244. ==Related pages== * Asuka period ==References== ==Other websites == * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Taihō 1st 2nd 3rd 4th Gregorian 701 702 703 704 Preceded by: ---- Era or nengō: Taihō Succeeded by: Keiun Preceded by: Jitō period 686697 Imperial reign: Mommu period 697707 Succeeded by: ---- Category:Japanese eras Category:700s establishments Category:700s establishments in Japan Category:700s disestablishments Category:8th-century disestablishments in Japan",
 "title": "Taihō (era)"
}