{
 "id": "344592",
 "text": "The following sortable table lists land surface elevation extremes by country. ==Table== Land surface elevation extremes by country Country or region Highest point Maximum elevation Lowest point Minimum elevation Elevation span Noshaq Amu Darya Korab Adriatic Sea Mount Tahat Chott Melrhir Lata Mountain on Ta‘ū South Pacific Ocean Coma Pedrosa Gran Valira Mount Moco South Atlantic Ocean Crocus Hill Caribbean Sea Mount Vinson Deep Lake, Vestfold Hills Mount Obama on Antigua Caribbean Sea AconcaguaThe summit of Aconcagua is the highest point outside of Asia.The summit of Aconcagua is the second-most prominent point on Earth. Laguna del CarbónLaguna del Carbón is the lowest point in both the Western Hemisphere and the Southern Hemisphere. Mount Aragats Debed Mount Jamanota Caribbean Sea Ashmore and Cartier Islands unnamed location Indian Ocean Mount KosciuszkoThe summit of Mawson Peak on Heard Island is the highest point on a dependent territory of Australia. Lake Eyre Grossglockner Lake Neusiedl Mount Bazardüzü Caspian Sea Mount Alvernia on Cat Island North Atlantic Ocean Mountain of Smoke Persian Gulf Saka Haphong Bay of Bengal Mount Hillaby North Atlantic Ocean Dzyarzhynskaya Hara Neman Signal de Botrange Multiple, west of Veurne Doyle's Delight Caribbean Sea Mont Sokbaro Bight of Benin Town Hill North Atlantic Ocean Gangkhar Puensum Drangme Chhu Sajama Paraguay River Maglić Adriatic Sea Otse Hill confluence of Limpopo River and Shashe River Olavtoppen South Atlantic Ocean Pico da Neblina Atlantic Ocean unnamed location on Diego Garcia Indian Ocean Bukit Pagon South China Sea Musala Black Sea Mount Tenakourou Black Volta Mount Heha Lake Tanganyika Phnom Aural Gulf of Thailand Mount Cameroon Bight of Bonny Mount LoganThe summit of Mount Logan is the sixth-most prominent point on Earth. North Atlantic Ocean Arctic Ocean North Pacific Ocean Pico do Fogo North Atlantic Ocean The Bluff on Cayman Brac Caribbean Sea Mont Ngaoui Ubangi River Emi Koussi Bodélé Depression Ojos del SaladoOjos del Salado is the highest volcano on Earth.The summit of Rapa Nui (Easter Island) is the twelfth-most topographically isolated point on Earth. South Pacific Ocean China, People's Republic ofChina has the broadest range of surface elevations of any country with a span of . Mount EverestThe summit of Mount Everest is the highest point on Earth. Ayding LakeAydingkol is the third-lowest depression on Earth. Murray Hill Indian Ocean Clipperton Island Rocher Clipperton on Clipperton Island North Pacific Ocean unnamed location Indian Ocean Pico Cristóbal ColónIt has yet to be determined whether Pico Cristóbal Colón or Pico Simón Bolívar is the highest point of the Sierra Nevada de Santa Marta mountain range.The higher summit of either Pico Cristóbal Colón or Pico Simón Bolívar is the fifth-most prominent point on Earth. Pico Simón Bolívar North Pacific Ocean Caribbean Sea Mount Karthala on Grande Comore Indian Ocean Margherita Peak South Atlantic Ocean Mont Nabeba South Atlantic Ocean Te Manga on Rarotonga South Pacific Ocean Coral Sea Islands unnamed location on Cato Island South Pacific Ocean Cerro Chirripó North Pacific Ocean Caribbean Sea Mont Nimba Gulf of Guinea Dinara Adriatic Sea Pico Turquino Caribbean Sea Christoffelberg Caribbean Sea Mount Olympus Mediterranean Sea Sněžka Elbe Møllehøj Lammefjord Mousa Ali Lake AssalLake Asal is the second- lowest depression on Earth. Morne Diablotins Caribbean Sea Pico DuarteThe summit of Pico Duarte on Hispaniola is the highest point in the Caribbean. Lago EnriquilloThe shore of Lago Enriquillo on Hispaniola is the lowest point on any ocean island. on Hispaniola ChimborazoThe summit of Chimborazo is the farthest point from the center of the Earth. Pacific Ocean Mount Catherine Qattara Depression Cerro El Pital North Pacific Ocean Pico Basile on Bioko North Atlantic Ocean Emba Soira Lake Kulul Suur Munamägi Baltic Sea Ras Dejen Danakil Depression Mount Usborne on East Falkland South Atlantic Ocean Slættaratindur on Eysturoy North Atlantic Ocean Tomanivi on Viti Levu South Pacific Ocean Halti Baltic Sea Mont BlancThe summit of Mont Blanc (Monte Bianco) is the highest point in Western Europe. Étang de Lavalduc Bellevue de l'Inini North Atlantic Ocean Mont OrohenaThe summit of Mont Orohena on Tahiti is the seventh-most topographically isolated point on Earth. South Pacific Ocean Mont Ross on Kerguelen Islands Indian Ocean Mont Bengoué Atlantic Ocean Red Rock North Atlantic Ocean Shkhara Black Sea Zugspitze Neuendorf- Sachsenbande Mount Afadjato Gulf of Guinea Rock of Gibraltar Strait of Gibraltar Mount Olympus Mediterranean Sea Gunnbjørn FjeldThe summit of Gunnbjørn Fjeld on Greenland is the highest point in the Arctic.The summit of Gunnbjørn Fjeld on Greenland is the ninth-most topographically isolated point on Earth. on Greenland Arctic Ocean North Atlantic Ocean Mount Saint Catherine Caribbean Sea La Grande Soufrière on Basse-Terre Island Caribbean Sea Mount LamlamThe summit of Mount Lamlam on Guam is 11,377 meters (37,326 ft) above the Challenger Deep. on Guam North Pacific Ocean Volcán TajumulcoThe summit of Volcán Tajumulco is the highest point in Central America. North Pacific Ocean Caribbean Sea Le Moulin English Channel Mont Nimba North Atlantic Ocean unnamed location in the northeast corner of the country North Atlantic Ocean Mount Roraima Presumed altitude. Mount Roraima is a large, roughly flat tabletop plateau (a tepui) where the borders of Guyana, Venezuela and Brazil meet. Its highest elevation is at 2,810 m or 9,219 ft, but that point is fully inside Venezuelan territory. The highest point in the Brazilian part of the mountain was determined by a 2005 Brazilian Army survey to be at the international border tripoint and measured by GPS to be at 2,734 m or 8,970 ft. The exact highest point on the Guyanese side of the mountain is not known and may be the border tripoint as well, but it is certainly close to that altitude value anyway. It should also be noted that Venezuela claims that region of Guyana as Guayana Esequiba and therefore does not recognize Mount Roraima as containing Guyana's highest point. North Atlantic Ocean Pic la Selle Caribbean Sea Heard Island and McDonald Islands Mawson Peak Indian Ocean Cerro Las Minas Caribbean Sea North Pacific Ocean Tai Mo Shan South China Sea Kékes Tisza Hvannadalshnúkur North Atlantic Ocean KangchenjungaKangchenjunga is the third-highest mountain peak on Earth.India claims all of Kashmir and Jammu. If recognized, this would make the summit of K2 the highest point in India. Kuttanad Puncak JayaThe summit of Puncak Jaya on New Guinea is the highest point on any ocean island.The summit of Puncak Jaya on New Guinea is the fifth-most topographically isolated and the ninth-most topographically prominent point on Earth. Indian Ocean South Pacific Ocean Damavand Caspian Sea Cheekha Dar Persian Gulf Carrauntoohil North Slob on Ireland Snaefell Irish Sea Mount Meron (Mount Hermon if the Golan Heights are included)Only the southern slopes, not the summit of Mount Hermon, extend into Israeli-annexed territory (Golan Heights). A peak in this area rises to 2236m or 7336 ft. Israel has annexed and administers the Golan Heights territory, but this is not recognized by Syria, which controlled the peak before the 1967 war Dead SeaThe shore of the Dead Sea is the lowest point on the surface of the Earth, the water table drops about 1 m per year, level -428 m refers to year 2014. Monte Bianco Jolanda di Savoia Blue Mountain Peak Caribbean Sea Mount Fuji on Honshu Hachiro-gata on Honshu Les Platons English Channel Jabal Umm ad Dami Dead Sea Khan Tengri Karagiye Depression Mount Kenya Indian Ocean unnamed location on Banaba Pacific Ocean Paektu-san Sea of Japan Yellow Sea Halla-san on Jejudo Sea of Japan Yellow Sea Kosovo Đeravica White Drin Mutla Ridge Persian Gulf Jengish Chokusu Kara Darya Phou Bia Mekong Gaiziņkalns Baltic Sea Qurnat as Sawda' Mediterranean Sea Thabana NtlenyanaThe summit of Thabana Ntlenyana is the eleventh-most topographically isolated point on Earth. confluence of Orange River and Makhaleng River Mount Wuteve North Atlantic Ocean Bikku Bitti Sabkhat Ghuzayyil Grauspitz Rhine Aukštojas Hill Nemunas Delta Kneiff Moselle River Coloane Alto on Gau Ou Saan South China Sea Golem Korab Vardar Maromokotro on Madagascar Indian Ocean Mount Mulanje Shire River Gunung Kinabalu on Borneo South China Sea Indian Ocean Maldives has an average surface elevation of just . Mount Villingili on Villingili Indian Ocean Hombori Tondo Senegal River Ta'Dmejrek on Malta Island Mediterranean Sea unnamed location on Likiep North Pacific Ocean Mount Pelée Caribbean Sea Kediet ej Jill Sebkha de Ndrhamcha Piton de la Petite Rivière Noire Indian Ocean Benara on Mahoré Mozambique Channel Volcán Citlaltépetl (Pico de Orizaba)The summit of Volcán Citlaltépetl (Pico de Orizaba) is the seventh-most prominent point on Earth. Laguna Salada Nanlaud on Pohnpei North Pacific Ocean Bălănești Hill Dniester along Chemin des Révoires on Mont Agel Mediterranean Sea Khüiten Peak Hoh Nuur Zla Kolata Adriatic Sea Chances Peak Caribbean Sea Both Morocco and the Sahrawi Arab Democratic Republic claim all of Western Sahara. Jbel Toubkal Sebkha Tah Monte Binga Mozambique Channel Hkakabo Razi Indian Ocean Königstein South Atlantic Ocean Command Ridge South Pacific Ocean Navassa Island unnamed location Caribbean Sea Mount Everest Kanchan Kalan Mount SceneryThe summit of the Vaalserberg at 322.7 m (1059 ft) is the highest point in the European Netherlands. on Saba Vergeten Plek, in the Zuidplaspolder near Waddinxveen Mont Panié Coral Sea Aoraki/Mount CookThe summit of Aoraki/Mount Cook on the South Island is the tenth-most topographically isolated point on Earth. in the South Island unnamed location near Momona, Taieri Plains, Otago Mogotón North Pacific Ocean Caribbean Sea Mont Idoukal-n-Taghès Niger River Chappal Waddi unnamed location on Lagos Island unnamed location near Mutalau on Niue South Pacific Ocean Mount Bates South Pacific Ocean Mount Agrihan on Agrihan North Pacific Ocean Galdhøpiggen Norwegian Sea Jabal Shams Arabian Sea K2K2 is the second-highest mountain peak on Earth.The area around K2 is claimed by Pakistan, India, and China, although it is currently occupied by Pakistan. Arabian Sea Mount Ngerchelchuus on Babeldaob North Pacific Ocean Mount Nabi Yunis Dead Sea Volcán Barú North Pacific Ocean Caribbean Sea Mount Wilhelm South Pacific Ocean Cerro Peró Paraguay River HuascaránThe summit of Huascarán is the highest point in the Tropics. Bayóvar Depression Mount Apo on Mindanao Philippine Sea South China Sea Pawala Valley Ridge South Pacific Ocean Northwestern peak of Rysy Żuławy Wiślane Montanha do Pico on Pico IslandThe summit of Torre is the highest point in continental Portugal. North Atlantic Ocean Cerro de Punta Caribbean Sea Qurayn Abu al Bawl Persian Gulf Piton des Neiges Indian Ocean Moldoveanu Black Sea Mount ElbrusThe summit of Mount Elbrus is the highest point in Europe.The summit of Mount Elbrus is the tenth-most prominent point on Earth. Caspian SeaThe shore of the Caspian Sea is the lowest point in Europe. Mount Karisimbi Ruzizi River unnamed location Sebjet Tah Morne du Vitet Caribbean Sea Queen Mary's Peak on Tristan da Cunha South Atlantic Ocean Mount Liamuiga on Saint Kitts Caribbean Sea Mount Gimie Caribbean Sea Pic Paradis on Saint Martin Caribbean Sea Morne de la Grande Montagne on Miquelon North Atlantic Ocean La Soufrière Caribbean Sea Mauga Silisili on Savai'i South Pacific Ocean Monte Titano Ausa River Pico de São Tomé on São Tomé Island Gulf of Guinea Jabal Sawda Persian Gulf Red Sea unnamed feature 2.7 km southeast of Nepen Diakha North Atlantic Ocean Iron Gate Morne Seychellois on Mahé Indian Ocean Mount Bintumani North Atlantic Ocean Bukit Timah Hill Singapore Strait 200 m SW from Flagstaff Peak (summit is wholly in Saint Martin.) Caribbean Sea Gerlachovský štít Bodrog Triglav Adriatic Sea Mount Popomanaseu on Guadalcanal South Pacific Ocean Shimbiris Indian Ocean Mafadi South Atlantic Ocean Indian Ocean Mount PagetMount Paget on South Georgia is the highest mountain peak in the South Atlantic Ocean. South Atlantic Ocean Kinyeti White Nile TeideTeide on Tenerife is the highest mountain peak in the Atlantic Ocean. on TenerifeThe summit of Mulhacén is the highest point in continental Spain. North Atlantic Ocean Mediterranean Sea Spratly IslandsThe Spratly Islands are claimed by China, Taiwan, Vietnam, Malaysia and the Philippines. unnamed location on Southwest Cay South China Sea Pidurutalagala on Sri Lanka Indian Ocean Deriba Caldera Red Sea Juliana Top North Atlantic Ocean Haakon VII Toppen Norwegian Sea Emlembe Maputo River Kebnekaise Kristianstad Dufourspitze (Monte Rosa) Lake Maggiore Jabal el-Sheikh Northeast shores of the Sea of Galilee in the Golan Heights (from Syrian point of view; See Israeli-occupied territories) The sovereignty of the Republic of China, which controls Taiwan, is disputed. Yu Shan South China Sea Ismoil Somoni Peak Syr Darya KilimanjaroThe summit of Mount Kilimanjaro is the highest point in Africa.The summit of Mount Kilimanjaro is the fourth-most prominent point on Earth. Indian Ocean Doi Inthanon Gulf of Thailand Andaman Sea Mount Ramelau on Timor Timor Sea Mont Agou Bight of Benin unnamed location South Pacific Ocean unnamed location on Kao South Pacific Ocean El Cerro del Aripo on Trinidad Caribbean Sea Jebel ech Chambi Shatt al Gharsah Mount Ararat Mediterranean Sea Black Sea Aýrybaba Vpadina AkchanayaSarygamysh Koli (, ) is a salt lake on the border between Turkmenistan and Uzbekistan which dries into salt ponds and can eventually leave a salt flat with an elevation as low as in Turkmenistan. At present, the water level of the main lake in Turkmenistan is about with a higher lake in Uzbekistan at . Blue Hills on Providenciales North Atlantic Ocean unnamed location South Pacific Ocean Margherita Peak Albert Nile Hoverla Kuyalnik Estuary Jabal Al Jais Persian Gulf Gulf of Oman Ben Nevis The Fens DenaliThe summit of Denali is the highest point in North America.The summit of Denali is the third-most prominent point on Earth.Mauna Kea on Hawaii is the highest mountain peak in the North Pacific Ocean.The summit of Mauna Kea on Hawaii is the eighth-most topographically isolated point on Earth. Badwater BasinThe Badwater Basin in Death Valley is the lowest point in North America. unnamed hill on Sand Island Pacific Ocean Cerro Catedral South Atlantic Ocean Khazret Sultan Sariqarnish Kuli Mount Tabwemasana on Espiritu Santo South Pacific Ocean Vatican Hill Saint Peter's Square Pico Bolívar Lagunillas Municipality, Zulia Fan Si Pan South China Sea Gulf of Thailand Mount Sage on Tortola Caribbean Sea Crown Mountain on Saint Thomas Caribbean Sea Mont Puke on Futuna South Pacific Ocean Jabal an Nabi Shu'ayb Arabian Sea Mafinga Central Zambezi Mount Nyangani confluence of Runde River and Save River Earth Mount Everest Dead Sea ==References== * CIA World Factbook 2006 (items marked * have been amended, see for supporting documentation). * World Tops and Bottoms, by Grant Hutchison, 1996, TACit Press, * Data supplied by the Shuttle Radar Topography Mission. Category:Lists of countries",
 "title": "List of elevation extremes by country"
}