{
 "id": "344586",
 "text": "Necrotizing fasciitis also known as the \"flesh-eating disease\", is a rare and life-threatening infection that can happen if a wound gets infected. It needs to be treated in hospital away. The problem is treated very quickly under antibiotics. In more severe cases the area affected may need major surgery or amputation. Many people with the condition may also have other issues, such as diabetes. The condition is caused by bacteria. == Symptoms == Signs and symptoms of necrotising fasciitis can develop quickly within hours or over a few days. ===At first there may be:=== * intense pain or loss of feeling near to a cut or wound. The pain may seem much worse than what would usually be expected from a cut or wound * swelling of the skin around the affected area * flu-like symptoms, such as a high temperature, headache and tiredness === Later symptoms can include: === * being sick (vomiting) and diarrhoea * confusion * black, purple or grey blotches and blisters on the skin. These may be less obvious on black or brown skin Necrotising fasciitis is very rare. The symptoms are similar to more common skin infections like cellulitis. == Causes == Necrotising fasciitis is an infection that can happen after getting a wound. It causes damage to the deep layers of the skin. The infection may get into the body through: *cuts and scratches *burns and scalds *insect bites *surgery *injecting drugs People with diabetes or a weakened immune system may be more at risk of developing necrotising fasciitis. == Treatments== It must be treated in hospital as soon as possible. Treatment will usually include: *antibiotics *surgery to remove tissue in the affected area Even after successful treatment, there may be long-term changes in the bodies appearance and how it can move or be used at the affected part of the body. Sometimes amputation of affected limbs is needed. There may be a need for further surgery and physiotherapy to help with recovery. ==Related pages== * cellulitis * gangrene * necrosis == References == * Category:Skin problems Category:Diseases caused by bacteria",
 "title": "Necrotizing fasciitis"
}