{
 "id": "344668",
 "text": "Oviraptorosaurs are a group of feathered maniraptoran dinosaurs from the Cretaceous period of what are now Asia and North America. They have short, beaked, parrot-like skulls, with or without bony head crests. They ranged in size from Caudipteryx, which was the size of a turkey, to the 8 meter long, 1.4 ton Gigantoraptor.Xu X. et al 2007. A gigantic bird-like dinosaur from the Late Cretaceous of China. Nature, 447: 844-847. The most complete oviraptorosaur specimens have been found in Asia. The North American oviraptorosaur record is sparse.Varricchio, D.J. 2001. Late Cretaceous oviraptorosaur (Theropoda) dinosaurs from Montana. pp. 42–57 in D.H. Tanke and K. Carpenter (eds) Mesozoic vertebrate life. Indiana University Press, Indianapolis, Indiana. The group (and all maniraptoran dinosaurs) is close to the ancestry of birds. Oviraptorosaurs might be primitive flightless birds. Osmólska, Halszka, Currie, Philip J., Brasbold, Rinchen 2004. In The Dinosauria Weishampel, Dodson, Osmólska. Chapter 8 Oviraptorosauria. University of California Press. On the other hand, they might just be close relatives of the birds. The earliest and most basal (\"primitive\") known oviraptorosaurs are Protarchaeopteryx robusta and Incisivosaurus gauthieri, both from the lower Yixian Formation of China, dating to about 125 million years ago in the Lower Cretaceous. Some fragmentary species, such as Calamospondylus oweni and Thecocoelurus daviesi, may have been even earlier members of the Oviraptorosauria. A tiny neck vertebra from England shares some features in common with oviraptorosaurs. It may represent an earlier occurrence of this group, at about 140 million years ago.Naish D. and Sweetman S.C. 2011. A tiny maniraptoran dinosaur in the Lower Cretaceous Hastings Group: evidence from a new vertebrate-bearing locality in south-east England. Cretaceous Research, 32: 464-471. == Typical genera == *Avimimus *Caudipteryx *Caenagnathasia *Gigantoraptor *Microvenator *Oviraptor *Protarchaeopteryx == References == ==Other websites== Category:Cretaceous dinosaurs",
 "title": "Oviraptorosaur"
}