{
 "id": "34462",
 "text": "Dwarf planet is the name used to classify some objects in the solar system. This definition was made on August 24, 2006 by the International Astronomical Union (IAU), and can be described as; a dwarf planet is a body orbiting the Sun that is big enough to round itself by its own gravity, but has not cleared its orbital path of other rival bodies. At the same meeting the IAU also defined the term planet for the first time. Some astronomers think that the term \"dwarf planet\" is too confusing and needs to be changed. The number of dwarf planets is unknown, the reason is because of how many are in hydrostatic equilibrium. They will be up to 300 in the Kuiper belt, but 13,000 beyond it. The consensus among astronomers consider nine dwarf planets. In order of present distance from the Sun, they are: Ceres, Pluto, Orcus, Haumea, Makemake, Quaoar, Sedna, Gonggong, and Eris. The dwarf planets, unlike the terrestrial and giant planets (Gas giants and ice giants), are in more than one region of the solar system. Ceres is in the asteroid belt. The high orbital eccentricity of Pluto puts it mostly outside Neptune's orbit, but partly inside. The others are in the trans-Neptune region. NASA's Dawn and New Horizons missions reached Ceres and Pluto, respectively, in 2015. Dawn had already orbited and observed Vesta in 2011. There are many other dwarf planets in the Solar System. Most of them are also KBOs. The biggest debate was of Pluto, which was considered the 9th planet, and of Eris, informally known as Xena, or 2003 UB313 by its codename. ==Discovery== * Ceres was found by Giuseppe Piazzi on January 1, 1801. Classified as a dwarf planet on September 13, 2006. * Pluto was found by Clyde W. Tombaugh on February 18, 1930. Reclassified as a dwarf planet on August 24, 2006 * Orcus was found by a team led by Mike Brown in February 18, 2004. * Haumea was found by a team led by Mike Brown on December 28, 2004. Accepted as a dwarf planet on September 17, 2008. * Makemake was found by a team led by Mike Brown on March 31, 2005. Accepted as a dwarf planet on July 11, 2008. * Quaoar was found by a team led by Mike Brown on February 7, 2002. Accepted as a dwarf planet in December 8, 2023. * Sedna was found by a team led by Mike Brown in October 28, 2003. * Gonggong was found by a team led by Mike Brown on July 7, 2007. * Eris was found by Mike Brown and his science team on January 5, 2005. Accepted as a dwarf planet on September 13, 2006. == References == == Other websites == * Dwarf planet Citizendium Category:Solar System",
 "title": "Dwarf planet"
}