{
 "id": "344699",
 "text": "The Croatian Liberation Movement (, HOP) is a minor far-right political party in Croatia. HOP was formed by Croatians in exile. Ustaše was movement with nationalistic ideas. It also had fascist tendencies. After the Second World War, there were some fights concerning the leadership of Ustaše. In 1956, Ante Pavelić formed the Croatian Liberation Movement in Buenos Aires. The goal of HOP was to control the original Ustaše organization. Because of its roots, HOP is widely seen as a successor of the Ustaše. In the early 1990s, the state of Yugoslavia disintegrated, and the parts it was made of became independent republics. In 1991, HOP moved to Zagreb; and the organization was registered as a political party. In 1997, HOP came into public limelight for paying a requiem mass for the Ustaše leader Pavelić in the Church of Saint Dominic in Split.Religious Separation and Political Intolerance in Bosnia-Herzegovina by Mitja Velikonja; Publisher: Texas A&M; University Press, Feb 5, 2003 page 273 ==Mission== One of the goals of the Croatian Liberation Movement is to re- establish the state of Croatia with the borders it had during the Second World War. At that time, the state also included Bosnia and Herzegovina. ==History== Croatian Liberation Movement was founded by Ante Pavelić in Buenos Aires in 1956. In 1957, after some people tried to kill Pavelić, he and his family moved to Spain. Pavelić died on 28 December 1959, at the German hospital in Madrid. After Pavelić's death, his son-in-law Srečko Pšeničnik took over HOP. In 1960, he moved its operations from Buenos Aires to Toronto, Canada. Another part of the HOP was established in Australia in 1963. The leaders of this group were Srećko Rover (from 1963 to 1967) and Stjepan Hefer (from 1967 to 1973). Many of this group's members were also members of the Australian Liberal Party. Some of them were said to have gone on military training exercises with the Australian Army Reserve, using the army's base at Wodonga in Victoria.Documents on the 1973 ‘raid’ at A.S.I.O., the Australian Security Intelligence Organisation; I. Notes of Meeting at A.S.I.O. Regional Directorate, Canberra, Australian Capital Territory March 15, 1973The Wiener Library bulletin, Volumes 17-19;Wiener Library page 18 Several members of the opposition Labor Party, including Justin O'Byrne, said that the HOP were using their status in the Liberal Party to hide many of these activities. When the Labour Party became the government in 1972, the Attorney-General gave the Australian Security Intelligence Organisation (ASIO) permission to spy on Srećko Rover and a few of the group's other members. This was because they thought they might be recruiting insurgents for an overseas war. When Yugoslavia was dissolved in the early 1990s, this organization moved to Zagreb, Croatia, where it was officially registered as a political party in 1991. ==References== ==Further reading== * Memorandum from the Croat Liberation Movement to All Governments, Leading Statesmen and Publicist of the World Regarding the Struggle of Croatia for Independence, Croatian Liberation Movement (Buenos Aires), 1971 Category:Political parties in Croatia Category:1956 establishments in South America Category:20th-century establishments in Argentina",
 "title": "Croatian Liberation Movement"
}