{
 "id": "344673",
 "text": "was a . It was the first nengō and the Hakuchi was the second. This period started in August 645 and ended in February 650.Nussbaum, Louis-Frédéric. (2005). \"Taika\" in Japan Encyclopedia, p. 924. During this time, the emperor was .Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 47-49; Brown, Delmer et al. (1979). Gukanshō, p. 266-267; Varley, H. Paul. (1980). Jinnō Shōtōki. p. 132-33. ==History== The system of nengō mirrored the Chinese system of eras (nianhao). The use of nengō marked a new phase in the history of the Imperial court. It became an example of growth in political power.Bialock, David T. (2007). Eccentric Spaces, Hidden Histories: Narrative, Ritual, and Royal Authority from the Chronicles of Japan to the Tale of the Heike, pp. 56-57; excerpt at p. 57, \"Whether the era name of Taika and Hakuchi are viewed as evidence of an actual precedent set by Kōtoku or as the work of chroniclers belonging to a later reign around the time of Nihon Shoki 's editing, the practice of assigning era names inaugurated a new phase in the consolidation of the court's expanding political power.\" ===Timeline=== The system of Japanese era names was not the same as Imperial reign dates. ==Events of the Taika era== * 645 (Taika 1): Empress Kōgyoku abdicated; and her brother received the succession (senso). Soon after, Emperor Kōtoku's new role as monarch was confirmed by ceremonies (sokui).Varley, H. Paul. (1980). Jinnō Shōtōki, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei). Retrieved 2012-5-22. * 645 (Taika 1): Kōtoku introduces reforms of government called .Nussbaum, \"Taika no kaishin\" at p. 924. The ideas and goals of this were written. For example, Kōtoku divided Japan into eight provinces. Government officials who were ranked in a hierarchy.Titsingh, 48. * 645 (Taika 1): The capital of Japan is moved from Asuka to Naniwa in Settsu Province. The name of Kōtoku's palace was Toyosaki-no-Miya.Brown, p. 266; Osaka City website: Osaka, history * 646 (Taika 2, 1st day of the 1st month): Kōtoku established a regular calendar for the court, with major audiences scheduled only on certain days. The emperor also ordered the creation of storehouses of goods and arsenals to serve the needs of a national army or militia. The rules of etiquette and customs of the court were established.Titsingh, p. 49; Brown, p. 266. * 649 (Taika 5): A new system of government which was composed of eight ministries and 100 bureaus (hasshō hyakkan).Titsingh, 49; Varley, p. 133; * 650 (Taika 6): The daimyo of Nagato Province brought a white pheasant to the court as a gift for the emperor. This white pheasant was then construed as a good omen. The emperor caused the nengō to be changed to Hakuchi (meaning \"white pheasant\").Titsingh, 49. ==Related pages== * Asuka period ==References== ==Other websites== * National Diet Library, \"The Japanese Calendar\" -- historical overview plus illustrative images from library's collection Taika 1st 2nd 3rd 4th 5th 6th Gregorian 645 646 647 648 649 650 Preceded by: ---- Era or nengō: Taika Succeeded by: Hakuchi Preceded by: Kōgyoku period 642645 Imperial reign: Kōtoku period 645654 Succeeded by: ---- Category:Japanese eras Category:7th-century establishments in Japan Category:7th-century disestablishments in Japan Category:640s establishments Category:650s disestablishments",
 "title": "Taika (era)"
}