{
 "id": "344857",
 "text": "The current coat of arms of Bahrain is a coat of arms that was originally designed in 1932 by Charles Belgrave, the British adviser to the then-Shaikh of Bahrain. The design has undergone slight modifications since then, namely in 1971 in 2002 when mantling and the indentations of the chief were modified respectively, but the influence of the original design is still clearly visible in the modern blazon. The arms act as a governmental and national symbol in addition to being the personal arms of the king; only the king, however, may display the royal crown ensigning the coat of arms. ==History== The General Maritime Treaty of 1820 gave Bahrain protected status (not as a protectorate of the United Kingdom). In 1932, the advisor to the Ruler, Charles Belgrave, designed a coat of arms for the Ruler, Isa ibn Ali Al Khalifa. The original heraldic achievement was red with a white chief dancetée of three ensigned by an heraldic ancient crown of eight points, with five being visible in renditions.De Vries, Hubert. \"Bahrain.\" 28 September 2007. Web. 19 February 2011. After the United Kingdom withdrew from Bahrain in 1971, red mantling with a white lining was added to the coat of arms as a symbol of the island nation's newly acquired independent sovereignty. The mantling is displayed around the shield without a helm or torse, in a manner unusual to traditional heraldic practice. The Princely coat of arms still displayed the Crown when used as the personal arms of Emir, though the Crown was modified to have smaller points displayed between the space of each point. The arms displayed with the mantling sans Crown became the arms of dominion for Bahrain. The heraldic device has been most recently altered in 2002, when the emirate was declared a kingdom by Hamad ibn Isa Al Khalifa. The shield remains red, but the white chief dancetée now includes five indentations to represent the five pillars of the Muslim faith, rather than the three as was originally assumed in 1932. The design on the shield is nearly identical to the design of the national flag, the only difference being that the whole of the design is rotated so that the chief of the shield appears as the hoist of the flag. The current coat of arms of Bahrain was made in 1932 by Charles Belgrave. == Related pages == *Flag of Bahrain ==References== Bahrain Category:National symbols of Bahrain",
 "title": "Coat of arms of Bahrain"
}