{
 "id": "344867",
 "text": "A constitutional monarchy is a form of monarchy. In a constitutional monarchy, a king or queen is the official head of state. However, their powers are limited by a constitution and they usually do not have much real power, as the legislative branch is the primary governing body. A constitutional monarchy is different than an absolute monarchy because in absolute monarchies, the monarch is able to rule with full power, and is able to change the laws freely. == Creation == Constitutional monarchy first emerged in England. At first, the British monarchy was absolute. However, the nobility under King John felt that the king had abused his power, and forced him to sign a document called Magna Carta. This document limited the powers of the king and made him somewhat responsible for the wellbeing of his subjects. The document, however was more focused on maintaining the ability of the nobles to have a say in what the king did. Contemporary constitutional monarchies include the United Kingdom and Commonwealth realms, Belgium, Bhutan, Bahrain, Cambodia, Denmark, Japan, Jordan, Kuwait, Liechtenstein, Lesotho, Luxembourg, Malaysia, Monaco, Morocco, the Netherlands, Norway, Spain, Eswatini, Sweden, and Thailand. ==List of current reigning monarchies== The following is a list of reigning monarchies. Except where noted, monarch selection is hereditary as directed by the state's constitution. State Last constitution established Type of monarchy Monarch selection 1981 Kingdom Hereditary succession. 1993 Co- Principality Selection of Bishop of La Seu d'Urgell and election of French President 1901 Constitutional Monarchy and Parliamentary Democracy. Hereditary succession. 1973 Kingdom Hereditary succession. 1966 Kingdom Hereditary succession. 2002 Kingdom Hereditary succession 1831 Kingdom; popular monarchyBelgium is the only existing popular monarchy — a system in which the monarch's title is linked to the people rather than a state. The title of Belgian kings is not King of Belgium, but instead King of the Belgians. Another unique feature of the Belgian system is that the new monarch does not automatically assume the throne at the death or abdication of his predecessor; he only becomes monarch upon taking a constitutional oath. Hereditary succession 1929 Elective absolute monarchy The Pope is elected by the cardinals of the Catholic Church 1981 Kingdom Hereditary succession. 2007 Kingdom Hereditary succession. 1993 Elective monarchy; Kingdom Chosen by throne council 1867 (last updated 1982) Constitutional Monarchy and Federal Parliamentary Democracy. Hereditary succession. 1953 Kingdom Hereditary succession 2009 Parliamentary Democracy and Constitutional Monarchy. Hereditary succession. 1974 Kingdom Hereditary succession. 1962 Kingdom Hereditary succession. 1946 Empire Hereditary succession 1952 Kingdom 1971 Kingdom; mixture of Constitutional and Absolute monarchy 1962 Emirate Hereditary succession, with directed approval of the House of Al-Sabah and majority of National Assembly 1993 Kingdom Hereditary succession directed approval of College of Chiefs 1862 Principality 1868 Grand duchy 1957 Elective monarchy; Federal monarchy Selected from nine hereditary Sultans of the Malay states 1911 Kingdom 1666 Kingdom 1815 Kingdom 1814 Kingdom 1907 Constitutional Monarchy and Parliamentary Democracy. Hereditary succession. 1975 Kingdom Hereditary succession. 1983 Kingdom Hereditary succession. 1979 Kingdom Hereditary succession. 1979 Kingdom Hereditary succession. 1978 Kingdom Hereditary succession. 1978 Kingdom (Swaziland) 1968 Kingdom; Mixture of absolute and constitutional monarchy Hereditary succession 1974 Kingdom Switched from semi-constitutional monarchy to constitutional monarchy 2007 Kingdom 1970 Kingdom 1978 Kingdom Hereditary succession. 1971 Federal Union of Emirates Elective monarchy President elected by the seven absolute monarchs of the Federal Supreme Council 1688 Constitutional Monarchy and Parliamentary Democracy. Hereditary succession. ==References== Category:Monarchy",
 "title": "Constitutional monarchy"
}