{
 "id": "344934",
 "text": "==Events and trends== * 609 BC—The Babylonians defeat the Assyrian army of Ashur-uballit II and gain Harran. Ashur-uballit, the last Assyrian king, disappears from history. * 609 BC—King Josiah of Judah dies in the Battle of Megiddo against Pharaoh Necho II of Egypt, who is on his way north to aid the Assyrian state of Ashur-uballit II. Jehoahaz succeeds his father Josiah as King of Judah. He is quickly deposed by Necho, who puts Jehoahaz's brother Jehoiakim in his place. * 607 BC—Death of Zhou Kuang Wang, King of the Zhou Dynasty of China. * 606 BC—Zhou Ding Wang becomes King of the Zhou Dynasty. * 605 BC—Battle of Carchemish: Crown Prince Nebuchadnezzar II of Babylon defeats the army of Necho II of Egypt, securing the Babylonian conquest of Assyria. The Babylonians pursue through Syria and Palestine. * 605 BC—Nebuchadnezzar II succeeds his father Nabopolassar as King of Babylon. * 601 BC—Foundation of Perinthus by settlers from Samos. * 600 BC— Foundation of Marseille by Focei winners in a naval clash on Carthaginians; It was the beginning of Greek-punic Wars. * 600 BC—Radiocarbon dating for first circular inhabitation enclosure at Emain Macha. * 600 BC—Creation of Armenia. * 600 BC—Foundation of Capua. * 600 BC—Foundation of Milan by Celts (approximate date). * 600 BC—Smyrna sacked and destroyed. * 600 BC—Nebuchadnezzar builds the Hanging Gardens of Babylon. * c. 600 BC—Orientalizing period of vases ends in Ancient Greece. * c. 600 BC—Archaic period of sculpture starts in Ancient Greece. * c. 600 BC—Pitcher (container) (olpe), from Corinth, is made. It is now at The British Museum, London. * c. 600 BC—Kouros is made. It is now at The Metropolitan Museum of Art, New York City. * c. 600 BC–580 BC—Temple of Artemis, Korkyra (Corfu) is built. * c. 600 BC—Pompeii is founded. * c. 600 BC—Zarathustra's religion becomes popular in Persia. * c. 600 BC—Beginning of the construction of the largest Mound at Cahokia, near East St. Louis, Illinois. Construction continues until AD 200. * c. 600 BC—The Etruscans take the settlement of Rome, making it into a prosperous trading centre. * c. 600 BC—Athens had severe economic problems. * c. 600 BC—Doric order and Ionic order are well developed. * c. 600 BC - 500 BC - Calendrical system appears in areas with strong Olmec influence in Mesoamerica. ==Significant people== *605 BC—Death of Nabopolassar, first ruler of the Neo-Babylonian Empire. *c. 600 BC—Birth of King Cambyses I of Anshan, head of the Achaemenid dynasty. *c. 600 BC—Thales, Greek philosopher.",
 "title": "600s BC (decade)"
}