{
 "id": "344920",
 "text": "The 22nd century BC is a century which was from the year 2200 BC to 2101 BC. ==Events== *4.2 kiloyear event – the land became very dry, an event that probably lasted the entire 22nd century BC and caused the end of several Old World civilizations. *2217 BC – 2193 BC: Nomadic invasions of Akkad. *2200 BC: Sixth dynasty of Egypt ended. *c. 2190 BC: Caused by a severe drought, Old Kingdom finished in Ancient Egypt. Start of First Intermediate Period. 7th–10th Dynasties. *c. 2184 BC: Pharaoh Pepi II Neferkare dies (other date is 2289 BC?). *c. 2181 BC: Old Kingdom ends in Ancient Egypt (other date is 2190 BC). *c. 2181 BC: First Intermediate Period starts in Ancient Egypt (other date is 2190 BC). *2181 BC: Egypt: Pharaoh Nitocris died. End of Sixth Dynasty, start of Seventh Dynasty. Pharaoh Neferkara I started to reign. *2180 BC: Old Kingdom ends in Ancient Egypt. First Intermediate Period of Egypt starts. *c. 2180 BC: Akkadian Empire fell under attack by the Guti (Mesopotamia), a mountain people from the northeast. *2173 BC: Egypt: End of Seventh Dynasty, start of Eighth Dynasty. *2160 BC: Egypt: Pharaoh Neferirkara died. End of Eighth Dynasty, start of Ninth Dynasty. Pharaoh Neferkare started to reign. *c. 2160 BC: Beginning of Middle Minoan period in Crete. *c. 2150–2030 BC: Gilgamesh epic was written. *c. 2150 BC: Lagash. *c. 2144 BC: Gudea, the ruler (ensi) of the city of Lagash, started to reign. *2138 BC: Babylon: A solar eclipse on 9 May and a lunar eclipse on 24 May occurred and are believed to be the double eclipse that took place 23 years after the ascension of king Shulgi of Babylon by those holding to the long chronology. *2130 BC: Egypt: End of Ninth Dynasty, start of Tenth Dynasty. Ninth Dynasty wars in Egypt started. *c. 2125 BC – 2055 BC: \"Model of a house and garden, from Thebes\". Eleventh dynasty of Egypt. It is now in the Metropolitan Museum of Art, New York City. *2124 BC: Gudea, the ruler (ensi) of the city of Lagash, died. *c. 2120 BC: Votive statue of Gudea from Lagash (Iraq) was made. It is now in the Musée du Louvre. *2119 BC – 2113 BC: (middle chronology), Utu-hengal, first king of the third dynasty of Ur. *2116 BC – 2110 BC: Uruk–Gutian war. *2112 BC – 2095 BC: Sumerian campaigns of Ur-Nammu. *2104 BC – 2103 BC: Date of the Biblical flood according to the Hebrew Calendar. ==Significant persons== * Gudea * Ur-Nammu",
 "title": "22nd century BC"
}