{
 "id": "344986",
 "text": "== Events and trends == * 546 BC—Croesus, Lydian king, is defeated by Cyrus of Persia near the River Halys. * 546 BC—Cyrus of Persia completes his conquest of Lydia, and makes Pasargadae his capital. * 546 BC—Cyrus makes a garrison in Sardis. He adds the Greek cities of Ionia in Asia Minor into Persian Empire. He gains the important ports that look out to the Mediterranean world. * 546 BC—Pisistratus takes power in Athens from the aristocratic party. * 546 BC—The architect Eupalinos of Megara built aqueducts that supply water to Athens. * 546 BC—The peace conference between the kingdoms in China. A treaty between Jin, Chu and some other kingdoms was signed. * 546 BC—A coup d'état in Qi kingdom. * 544 BC—People of Teos move to Abdera, Thrace to escape Persia. * 544 BC—King Jing becomes King of the Zhou Dynasty of China. * 543 BC—North Indian Prince Vijaya invades Ceylon. He makes a Sri Lankan dynasty. * 543 BC—Pisistratus, tyrant of Athens, purifies the island of Delos (approximate date). * 543 BC—Guided by the Chinese statesman Zi Chan, the State of Zheng starts a formal code of law. * 540 BC—Cyrus attacks Babylonia. * 540 BC—Greek city of Elea of southern Italy founded (approximate date). * 540 BC—Persians conquer Lycian city of Xanthos now in southern Turkey (approximate date). * c. 540 BC—Amasis Painter makes Dionysos with maenads, black-figure decoration on an amphora. It is now at Bibliothèque Nationale de France, Paris. * c. 540 BC—Exekias makes The Suicide of Ajax, black-figure decoration on a amphora. It is now at Chateau-Musee, Boulogne-sur-Mer, France. ==Significant people== * 549 BC—Birth of Darius I * 547 BC—Death of Croesus * 546 BC—Death of Anaximander, Greek philosopher (approximate date) * 545 BC—Death of Zhou ling wang, King of the Zhou Dynasty of China * 544 BC—Birth of Sun Tzu * 543 BC—Death of Gautama Buddha (traditional in Thailand and elsewhere—basis of the Thai solar calendar) * 543 BC—Death of Thales, Greek philosopher * 540 BC—Amyntas I becomes king of Macedonia (approximate date) * Amasis Painter, Greek painter * Exekias, Greek painter",
 "title": "540s BC"
}