{
 "id": "345238",
 "text": "The Al Khalifa family is the ruling royal family of Bahrain. The Al Khalifa are Sunni Islam. They belong to the Anizah tribe that came from Najd to Kuwait in the early 18th century. They are also from the Utub tribe. The current head of the family is Hamad bin Isa Al Khalifa. He became the Emir of Bahrain in 1999 and made himself King of Bahrain in 2002. As of 2010, about half of the cabinet ministers of Bahrain are from the Al Khalifa royal family.Bahrain Shia demand cabinet change, 5 March 2010 The country's Prime Minister, Khalifah bin Salman al-Khalifah, is also from the Al Khalifa family and is the uncle of the current King. ==List of monarchs of Bahrain of the Al Khalifa family== Name Years as ruler Title Ahmed bin Muhammad bin Khalifa 1783–1796 Hakim Abdullah bin Ahmad Al-Khalifa, ruling jointly with Salman bin Ahmad Al-Khalifa Khalifah bin Sulman Al-Khalifa 1796–1843 1796–1825 1825–1834 Hakim Hakim Hakim Muhammad bin Khalifah Al-Khalifa 1834–1842 1849–1868 1869-1869 Hakim Ali bin Khalifah Al-Khalifa 1868–1869 Hakim Muhammad bin Abdullah Al-Khalifa 1869-1869 Hakim Isa bin Ali Al-Khalifa 1869–1932 Hakim Hamad bin Isa Al-Khalifa 1932–1942 Hakim Salman bin Hamad Al-Khalifa 1942–1961 Hakim Isa bin Salman Al-Khalifa 1961–1971 1971–1999 Hakim Amir Hamad bin Isa Al Khalifa 1999–2002 2002 - Amir King ==In public office== Public offices in Bahrain that Al Khalifa family members have: Office Name Prime Minister Khalifa ibn Salman Al Khalifa (Uncle of King Hamad) Minister of Foreign Affairs Khalid ibn Ahmad Al Khalifah Minister of Defence Khalifa bin Ahmed Al Khalifa Minister of Interior Rashid bin Abdullah Al Khalifa Minister of Information Fawaz bin Mohammed Al Khalifa Minister of Finance Ahmed bin Mohammed Al Khalifa Minister of Justice & Islamic Affairs Khalid bin Ali Al Khalifa Minister of Culture Mai bint Mohammed Al Khalifa Minister of Transport (also Deputy Prime Minister) Ali bin Khalifa Al Khalifa Minister of the Royal Court Khalid bin Ahmed Al Khalifa Minister of the Royal Court for Followup Affairs Ahmed bin Ateyatalla Al Khalifa Minister of Royal Court Affairs Ali bin Isa Al Khalifa Deputy Prime Minister for Ministerial Committees Muhammad ibn Mubarak ibn Hamad Al Khalifah Deputy Prime Minister Khalid bin Abdullah Al Khalifa Minister of State for Defence Affairs Mohammed bin Abdullah Al Khalifa Supreme Commander of Armed Forces Hamad bin Isa Al Khalifa (King) Deputy Supreme Commander of Armed Forces Salman bin Hamad bin Isa Al Khalifa (Crown Prince) Chief of Staff of Bahrain Defence Force Khalifa bin Ahmad Al Khalifa Advisor to Prime Minister for Security Affairs Abdulaziz bin Ateyatallah Al Khalifa Chairman of the Supreme Judicial Council Hamad bin Isa Al Khalifa (King) Chief Justice of Bahrain (President of the Court of Cassation) Khalifa bin Rashid Al Khalifa Commander of the National Guard Mohammed bin Isa Al Khalifa (brother of King Hamad) National Guard Staff Director Mohammed bin Abdulaziz Al Khalifa Commander of the Royal Bahraini Air Force Hamad bin Abdullah Al Khalifa Director of the National Security Agency Khalifa bin Abdullah Al Khalifa Chief of the Information Affairs Authority Fawaz bin Mohammed Al Khalifa (2010-present) Ambassador to London Khalifa bin Ali bin Rashid Al Khalifa Commander of the Royal Guard Shaikh Nasser bin Hamad Al Khalifa (son of King Hamad) Chairman of the Supreme Council for Islamic Affairs Abdullah bin Khalid Al Khalifa Chairman of the Supreme Council for Youth and Sport Shaikh Nasser bin Hamad Al Khalifa (son of King Hamad) First Deputy Chairman of the Supreme Council for Youth and Sport Khalid bin Hamad Al Khalifa (son of King Hamad) Secretary General of the Supreme Council for Youth and Sport Salman bin Ebrahim Al Khalifa President of the Bahrain Olympic Committee Shaikh Nasser bin Hamad Al Khalifa (son of King Hamad) Secretary General of the Bahrain Olympic Committee Ahmed bin Hamad Al Khalifa (son of King Hamad) CEO of the Bahrain Olympic Committee Khalid bin Abdullah Al Khalifa President of the Bahrain Royal Equestrian and Endurance Federation Khalid bin Hamad Al Khalifa (son of King Hamad) ==Other notable members== * Salman bin Hamad bin Isa Al Khalifa, crown prince and chief of the Bahrain Defence Force. * Khalifa bin Salman Al Khalifa, prime minister of Bahrain (11 November 2020 -Present ), * Shaikh Rashid bin Khalifa Al Khalifa, prominent Bahraini artist and patron of the arts. * Mohammed bin Salman Al Khalifa, brother of Isa bin Salman Al Khalifa (Hakim, 1961–1971; Emir, 1971–1999) and Khalifa bin Salman Al Khalifa (prime minister since 1971). * Mai Al Khalifa, culture minister. ==References== Category:Bahrain Category:Royal dynasties",
 "title": "House of Khalifa"
}