{
 "id": "345382",
 "text": "The 39th G8 summit took place in Northern Ireland on 17th and 18th June 2013. The meeting was at the Lough Erne Golf Resort in Enniskillen, Northern Ireland In the Queen's speech at the state opening of Parliament in 2012, Elizabeth II said that \"my government will use this opportunity to promote international security and prosperity.\" \"Queen's speech 2012,\" Guardian (UK). 9 May 2012; retrieved 2012-5-20. ==History== The gathering of the Group of Eight (G8) will be the 39th meeting in a series which began in 1976.US Dept. of State, About the G8; retrieved 2012-5-20. Previous G8 summits have been hosted by the United Kingdom at London (1977, 1984, 1991) and Birmingham (1998) in England. The 2005 summit was in Scotland at Gleneagles.G20/G8 France 2011, What is G8? (\"Previous summits\" section) ; retrieved 2012-5-21 The G8 and the summit are part of a consultation process. The G8 is not an international organization.G20-G8 France 2011, What is G8? (\"Language\" section) ; retrieved 2012-5-21. It is an informal group.US Dept. of State, G8 Frequently Asked Questions (\"How does the G8 work?\" section); retrieved 2012-5-21. ==Participants== The participants will be the \"core members\" of the group:Rieffel, Lex. \"Regional Voices in Global Governance: Looking to 2010 (Part IV),\" Brookings. March 27, 2009; retrieved 2012-5-20. Core G8 members Host nation and leader are indicated in bold text. Member Member Represented by Title Canada Stephen Harper Prime Minister France François Hollande President Germany Angela Merkel Chancellor Italy Enrico Letta Prime Minister Japan Shinzo Abe Prime Minister Russia Vladimir Putin President United Kingdom David Cameron Prime Minister United States Barack Obama President European Commission Jose Manuel Barroso President European Council Herman Van Rompuy President ===Invited leaders=== A number of national leaders are traditionally invited to attend the summit. They are asked to participate in some, but not all, G8 summit activities. ==Schedule and agenda== The summit meetings are intended as a way to resolve differences among the G8 members.Reinalda, Bob and Bertjan Verbeek. (1998). Autonomous Policy Making by International Organizations, p. 205. Traditionally, the host country sets the agenda.UPI, \"Italy Knocked for Alleged poor G8 Planning\", July 7, 2009; retrieved 2012-5-20. As host, Prime Minister Cameron is expected to try to change the G8. He has criticised costs and questioned the value of G8 meetings.Wintour, Patrick. \"David Cameron plans to downgrade G8 summit,\" Guardian (UK). 28 June 2010; retrieved 2012-5-20. Discussions at the 39th G8 summit will include some issues which remain unresolved from previous summits.Traynot, Ian et al. \"G8 at Camp David: what the world wants to achieve,\" Guardian (UK). 17 May 2012; WhiteHouse.gov, \"Wrapping Up the G8 Summit at Camp David\" ;retrieved 2012-5-20. The G8 discussions will be about a range of topics, including * Food securityElliott, Larry. \"Make Poverty History 2 to launch in 2013,\" Guardian (UK). 22 April 2012; retrieved 2012-5-20. * Nutrition * Sexual violence in armed conflict ==Protesters and demonstrations== Because of the nature of the summit, protest groups and other activists usually attend. The planning for the summit includes how to deal with these groups.Balde, Lisa and Phil Rogers. \"Adbusters Wants 50,000 G8/NATO Protesters in Chicago,\" NBCChicago (US), 27 January 2012; retrieved 2012-5-20. Britain's leading aid groups and charities are planning a \"propaganda offensive\" which hopes to affect the food-dominated agenda for the G8. ==Related pages== * List of G8 summits == References == ==Other websites== * University of Toronto: G8 Information Centre * Parliament.uk, Graphic shows G8 in context 39 Category:2013 in the United Kingdom Category:History of Northern Ireland",
 "title": "39th G8 summit"
}