{
 "id": "345318",
 "text": "Master of Business Administration (often shortened to MBA) is a postgraduate academic degree. People who study for an MBA already have a degree in another field of study and study management. Very often, a master's degree is required, but sometimes bachelor's degree-holders with work experience are also accepted. Unlike other areas of study, MBA courses are often targeted at people who work, and can be done in a part-time fashion, including distance learning. MBA programs usually take two years, full-time. The main target group for MBAs are engineers, lawyers, doctors of medicine, and other with a background form the humanities. The idea of the MBA is to give those people qualifications in management positions. The MBA is a terminal degree and a professional degree. == History == The Master of Business Administration (MBA) is a graduate-level degree that focuses on business management and leadership. The history of the MBA can be traced back to the early 20th century, reflecting the evolving needs of the business world. The first MBA program was established in 1908 at Harvard University. The Harvard Graduate School of Business Administration introduced the degree to provide systematic training in business management, responding to the growing complexity of running large- scale enterprises during the industrial revolution. In 1950s - 1960s, After World War II economic boom increased the demand for well-trained managers. MBA programs became more standardized, with a focus on core disciplines such as finance, marketing, and organizational behavior. The degree began to spread internationally, with institutions in Europe and other parts of the world adopting the MBA model. The 21st century has seen further innovation in MBA education, with the introduction of Online MBA programs, executive MBAs for experienced professionals, and a greater emphasis on leadership, ethics, and social responsibility. Business schools worldwide have integrated global perspectives, responding to the interconnected nature of the modern economy. == Programs == MBA programs are of following types: Full-Time MBA: Typically spans two academic years (18 months of term time), starting in late August or early September and ending in May or June, with a summer break between years. Students, who usually have prior work experience, attend weekday classes. The program requires 60 credits (600 class hours). Accelerated MBA: Condensed into one year with a heavier course load and shorter breaks. It's more intense than the traditional two-year program and generally costs less. Part-Time MBA: Designed for working professionals, classes are held on weekday evenings or weekends, extending the program duration to three years or more. Evening MBA: Similar to full-time programs but scheduled for weekday evenings or weekends over two years, catering to working professionals, commonly offered in India. Modular MBA: Part-time with a lock-step curriculum, featuring class blocks lasting one to three weeks. Executive MBA (EMBA): Tailored for managers and executives, these part-time programs allow students to work full-time while earning their MBA in two years or less. EMBA students typically have over ten years of work experience. Full-time executive MBAs, mainly in India, cater to professionals with five or more years of experience. Distance Learning MBA: Classes are held off-campus through various formats like mail, email, video, or online platforms. Blended Learning MBA: Combines distance learning with in- person instruction, targeting working professionals. Dual Degree MBA: Combines an MBA with another graduate degree (e.g., MS, JD), allowing students to save time and costs by counting core courses from one program as electives in the other. Mini-MBA: Focuses on fundamental business skills in less than 100 hours of non-credit courses, often now offered for credit to be applicable towards a full MBA degree later. == Eligibility == MBA programs typically base their admission decisions on a combination of factors, including undergraduate GPA and academic transcripts, entrance exam scores (such as the GMAT, MAT, CAT or GRE), and a résumé highlighting significant work experience. Applicants are also evaluated through essays, letters of recommendation, group discussions, and personal interviews. Additionally, schools often consider extracurricular activities, community service, volunteer work, and how applicants can contribute to the school's diversity and overall student body. == Careers == An MBA prepares individuals for a variety of careers. According to a survey by the Graduate Management Admissions Council, 64% of 2012 MBA graduates used their degree to change careers. Common roles for MBA graduates include: * Business Analyst or Strategist * Business Development Manager * Market Research Analyst * Investment Banker * Entrepreneur/Founder * Financial Analyst * Management Consultant * Marketing Manager * Portfolio Manager * Healthcare Manager * Project Manager * Product Manager * Operations Manager == References == Category:Academic degrees",
 "title": "Master of Business Administration"
}