{
 "id": "345471",
 "text": "The prime minister of Bangladesh (), officially prime minister of the Government of the People's Republic of Bangladesh () is the chief executive of the government of Bangladesh. The prime minister and the cabinet are collectively accountable for their policies and actions to the Parliament, to their political party and ultimately to the electorate. The prime minister is ceremonially appointed by the president of Bangladesh. The position was taken over by the military during years of 1975–78, 1982–86 and 1990–91 due to imposed martial law. In each of these periods, the national government leadership was in control of the military with the executive authority of the president and the prime minister. During the period between 1996 and 2008, The chief adviser of the caretaker government of the People's Republic of Bangladesh exercised authority as per the constitution as the Head of government for 90 days during transition between one elected government to another. The chief adviser headed an Advisory Committee comprising ten Advisers. With powers roughly equivalent to those of the prime minister of an elected governments, his executive power was constrained with certain constitutional limitations. The system was scrapped in 2011 by 15th amendment of constitution to allow political government to conduct any General Election in future. The latest prime minister was Muhammad Yunus, appointed on 8 August 2024 by president Mohammed Shahabuddin. The longest serving prime minister in the country's history is Sheikh Hasina, who served from 6 January 2009 until her resignation on 5 August 2024. ==List of prime ministers== # Name (Birth–Death) (Title) Portrait Entered office Left office Political party Tajuddin Ahmad (1925–1975) Prime Minister 11 April 1971 12 January 1972 Bangladesh Awami League Mujibur Rahman (1920–1975) Prime Minister 12 January 1972 25 January 1975 Bangladesh Awami League Muhammad Mansur Ali (1919–1975) Prime Minister 25 January 1975 15 August 1975 Bangladesh Awami League Khondaker Mostaq Ahmad 1975 1975 Abu Sadat Mohammad Sayem 1975 1976 Ziaur Rahman 1976 1978 Mashiur Rahman (1924–1979) Senior Minister 29 June 1978 12 March 1979 Bangladesh Nationalist Party Shah Azizur Rahman (1925–1988) Prime Minister 15 April 1979 24 March 1982 Bangladesh Nationalist Party Hussain Muhammad Ershad 1982 1984 Ataur Rahman Khan (1907–1991) Prime Minister 30 March 1984 9 July 1986 Jatiya Party Mizanur Rahman Chowdhury (1928–2006) Prime Minister 9 July 1986 27 March 1988 Jatiya Party Moudud Ahmed (1940–2021) Prime Minister 27 March 1988 12 August 1989 Jatiya Party Kazi Zafar Ahmed (1939–) Prime Minister 12 August 1989 6 December 1990 Jatiya Party Shahabuddin Ahmed 6 December 1990 20 March 1991 Khaleda Zia (1944–) Prime Minister 20 March 1991 30 March 1996 Bangladesh Nationalist Party Muhammad Habibur Rahman (1930–2014) Chief Adviser 30 March 1996 23 June 1996 Independent Hasina Wazed (1947–) Prime Minister 23 June 1996 15 July 2001 Bangladesh Awami League Latifur Rahman (1936–2017) Chief Adviser 15 July 2001 10 October 2001 Independent Khaleda Zia (1944–) Prime Minister 10 October 2001 29 October 2006 Bangladesh Nationalist Party Iajuddin Ahmed (1931–2012) President and Chief Adviser 29 October 2006 11 January 2007 Independent Fazlul Haque (1938–) Acting Chief Adviser 11 January 2007 12 January 2007 Independent Fakhruddin Ahmed (1940–) Chief Adviser 12 January 2007 6 January 2009 Independent Sheikh Hasina (1947–) Prime Minister 6 January 2009 5 August 2024 Bangladesh Awami League Muhammad Yunus (1940–) Chief Adviser 8 August 2024 Incumbent Independent ==References== Category:Politics of Bangladesh Banglad",
 "title": "Prime Minister of Bangladesh"
}