{
 "id": "345748",
 "text": "The Bangladesh national cricket team () is the national cricket team for Bangladesh. The rules are set by the Bangladesh Cricket Board (BCB). Bangladesh is a full member of the International Cricket Council (ICC) with Test and One Day International (ODI) status. It played its first Test match in 2000 against India in Dhaka. Bangladesh was the tenth Test cricket playing nation. Bangladesh's first time in international cricket came in the 1979 ICC Trophy in England. They left the tournament with 2 wins and 2 defeats. Seven years later, on 31 March 1986, Bangladesh played in its first ODI match against Pakistan in the 1986 Asia Cup. Bangladesh won the 1997 ICC Trophy in Malaysia. By winning the tournament, Bangladesh qualified for the 1999 Cricket World Cup for the first time. In 1997, Bangladesh became a regular ICC member with the right to play ODIs. It got the status of a Test playing country on 26 June 2000. Bangladesh has the record for most losses in a row in Tests (21 between 1999 and 2002) and ODIs (23 between 2001 and 2004). As of April 2012, Bangladesh has played 73 Tests, winning only 3. Its first victory was against Zimbabwe. The other two were against a West Indian team crippled by a players' strike. Of the 63 matches it has lost, 35 were by an innings. The team has been more successful in ODIs, having won 72 of its 262 matches. They have also played 18 Twenty20 Internationals, winning four. ==Tournament history== World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record Year Round Position GP W L T NR 1975 Not eligible Not eligible Not eligible Not eligible Not eligible Not eligible Not eligible 1979 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1983 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1987 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1992 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1996 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1999 Round 1 9/12 5 2 3 0 0 2003 Round 1 13/14 6 0 5 0 1 2007 Second Round 7/16 9 3 6 0 0 2011 Round 1 9/14 6 3 3 0 0 2015 Qualified – – – – – – 2019 Round 1 – – – – – – Total 26 8 17 0 1 World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record Year Round Position GP W L T NR 2007 Second Round 8/12 5 1 4 0 0 2009 Round 1 9/12 2 0 2 0 0 2010 Round 1 9/12 2 0 2 0 0 2012 Round 1 9/12 2 0 2 0 0 2014 Qualified - - - - - - Total 11 1 10 0 0 Asia Cup record Asia Cup record Asia Cup record Asia Cup record Asia Cup record Asia Cup record Asia Cup record Asia Cup record Year Round Position GP W L T NR 1984 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1986 First Round 3/3 2 0 2 0 0 1988 First Round 4/4 3 0 3 0 0 1990-91 First Round 3/3 2 0 2 0 0 1995 First Round 4/4 3 0 3 0 0 1997 First Round 4/4 3 0 3 0 0 2000 First Round 4/4 3 0 3 0 0 2004 Second Round 4/6 5 1 4 0 0 2008 Second Round 4/6 5 1 4 0 0 2010 First Round 4/4 3 0 3 0 0 2012 Runner Up 2/4 4 2 2 0 0 Total 33 4 29 0 0 Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Year Round Position GP W L T NR 1998 Not eligible Not eligible Not eligible Not eligible Not eligible Not eligible Not eligible 2000 Round 1 10/11 1 0 1 0 0 2002 Round 1 11/12 2 0 2 0 0 2004 Round 1 11/12 2 0 2 0 0 2006 Round 1 9/10 3 1 2 0 0 2021 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Total - - - - - - - Multisport Events Multisport Events Multisport Events Multisport Events Multisport Events Multisport Events Multisport Events Multisport Events Multisport Events Year Round Position GP W L T NR 1998 Commonwealth Games Round 1 14/16 3 0 3 0 0 2010 Asian Games Champions 1/9 3 3 0 0 0 ;Asian Test Championship *2001/02: First Round ;Asia Cup *1984: Did not participate *1986: First Round *1988: First Round *1990/91: First Round *1995: First Round *1997: First Round *2000: First Round *2004: Second Round *2008: Second Round (Super Fours) *2010: First Round *2012: Finals ;ACC Trophy *1996: Winners *1998: Winners *2000 onwards: Not eligible – Now an ICC full member ;Austral-Asia Cup *1986: Did not participate *1990: First Round *1994: Did not participate ==References== Men Category:Test cricket teams Category:2000 establishments in Asia Category:20th-century establishments in Bangladesh Category:National sports teams of Bangladesh Category:Men's national cricket teams == Post-Tournament Summary == In late 2023 and early 2024, the Bangladesh national cricket team underwent several changes following a disappointing campaign in the 2023 ICC Cricket World Cup, where they managed only two wins in nine matches and finished near the bottom of the table. The underperformance led to changes in team management, and Najmul Hossain Shanto was appointed as the new ODI captain in early 2024. The team showed signs of recovery by defeating Sri Lanka 2–1 in a T20I series held in Dhaka in March 2024. Young talents like Towhid Hridoy and Tanzim Hasan Sakib began to emerge as key contributors in the limited-overs format. The Bangladesh Cricket Board (BCB) also announced a renewed focus on youth development and domestic cricket restructuring to improve performance in upcoming ICC events. *Sources: [ESPNcricinfo](https://www.espncricinfo.com), [The Daily Star](https://www.thedailystar.net), [ICC Cricket](https://www.icc- cricket.com)*",
 "title": "Bangladesh men's national cricket team"
}