{
 "id": "345753",
 "text": "The 2011 ICC Cricket World Cup was the tenth Cricket World Cup. It was played in India, Sri Lanka, and Bangladesh. It was Bangladesh's first time co-hosting a World Cup. All matches in the World Cup were given One Day International status. All matches played had over 50 overs. Fourteen national cricket teams were in the tournament, including ten full members and four associate members. The World Cup was between 19 February and 2 April 2011. The first match played on 19 February 2011 was with co-hosts India and Bangladesh at the Sher-e- Bangla National Stadium in Dhaka. India won the tournament defeating Sri Lanka by 6 wickets in the final. India was the first nation to win the Cricket World Cup final on home soil.India beat Sri Lanka to win ICC World Cup 2011 Times of India. Retrieved 20 November 2011 India's Yuvraj Singh was made the man of the tournament.Yuvraj Singh named man of the tournament Times of India. Retrieved 21 November 2011 ==List of qualified teams== The following 14 teams qualified for the final tournament. Group A Group A Group B Group B Rank Team Rank Team Full Members Full Members Full Members Full Members 1 2 (co-host) 3 4 5 6 7 (co-host) 8 9 10 (co-host) Associate Members Associate Members Associate Members Associate Members 11 12 13 14 ==Opening ceremony== The Opening Ceremony was in Bangladesh. The place for the opening ceremony was Bangabandhu National Stadium in Dhaka. The event took place on 17 February 2011, 2 days before the first match of the World Cup. ==Venues== All the Indian stadiums for the 2011 World Cup were set.India unveil eight World Cup venues. Retrieved on 17 October 2009. The venues of Bangladesh and Sri Lanka were picked in late October 2009. Two new stadiums in Sri Lanka were built for the 2011 World Cup. They are located in Kandy and Hambantota.Venues of 2011 World Cup by ICC Retrieved on 10 March 2010. India India India India India Kolkata Chennai Delhi Nagpur Ahmedabad Eden Gardens M. A. Chidambaram Stadium Feroz Shah Kotla Ground Vidarbha Cricket Association Stadium Sardar Patel Stadium Capacity: 66,349 Capacity: 37,220 Capacity: 40,715 Capacity: 45,000 Capacity: 54,000 Mumbai Mohali Bangalore Wankhede Stadium Punjab Cricket Association Stadium M. Chinnaswamy Stadium Capacity: 32,000 Capacity: 42,000 Capacity: 36,430 Sri Lanka Sri Lanka Sri Lanka Bangladesh Bangladesh Colombo Kandy Hambantota Chittagong Dhaka R. Premadasa Stadium Pallekele International Cricket Stadium Mahinda Rajapaksa International Stadium Zohur Ahmed Chowdhury Stadium Sher-e-Bangla National Cricket Stadium Capacity: 35,000 Capacity: 35,000 Capacity: 35,000 Capacity: 20,000 Capacity: 26,000 ==Umpires== The Umpire selection panel selected 18 umpires and a reserve umpire, Enamul Haque (Bangladesh). There were 5 from Australia, 6 from Asia, 3 from England, 2 from New Zealand and 1 each from South Africa and West Indies. ;Australia * Simon Taufel * Steve Davis * Rod Tucker * Daryl Harper * Bruce Oxenford ;New Zealand * Billy Bowden * Tony Hill ;South Africa * Marais Erasmus ;Pakistan * Aleem Dar * Asad Rauf ;India * Shavir Tarapore * Amiesh Saheba ;England * Ian Gould * Richard Kettleborough * Nigel Llong ;Sri Lanka * Asoka de Silva * Kumar Dharmasena ;West Indies * Billy Doctrove == 2011 World Cup Final == The 2011 World Cup final was played between India and Sri Lanka making it the first ever World Cup Final featuring two Asian teams. The highlight of the 2011 World Cup Final was Indian Captain Mahendra Singh Dhoni's innings that took India over the line making him one of the most respected Captains in cricket history. ==References== Category:2011 in sports Category:Cricket World Cup Category:Cricket in Bangladesh Category:2011 in Asia Category:2010s in Indian sport Category:2010s in Sri Lanka Category:2010s in Bangladesh Category:April 2011 events Category:March 2011 events",
 "title": "2011 Cricket World Cup"
}