{
 "id": "345960",
 "text": "Tramar Lacel Dillard (born September 16, 1979) Flo Rida | Music Biography, Streaming Radio and Discography. AllMusic. better known by his stage name Flo Rida is an American rapper, singer, and songwriter. Some of his hit singles are \"Low\", \"Club Can't Handle Me\", \"Good Feeling\", \"Wild Ones\", and \"Whistle\". His debut album \"Mail on Sunday\" came out in 2008. He has released three more full studio albums since. He is known for pairing up with Taio Cruz, David Guetta, Sia, and T-Pain. He also made famous songs with Alexandra Burke and Olly Murs. In 2021, he represented San Marino in the Eurovision Song Contest 2021 alongside Senhit. Dillard is a Democrat and attended the 2012 Democratic National Convention in support of President Barack Obama's re-election. ==Discography== Studio albums * Mail on Sunday (2008) * R.O.O.T.S. (2009) * Only One Flo (Part 1) (2010) * Wild Ones (2012) ==Awards and nominations== Year Type Award Result 2008 American Music Awards Breakthrough Performer Favorite Male Hip-Hop Artist BET Awards Best New ArtistBest New Artist . BET Awards 2008. Best Collaboration (\"Low\" with T-Pain)Best Collaboration BET Awards. 2008 BET Hip Hop Awards Ringtone of the Year (\"Low\" with T-Pain)Ringtone of the Year Retrieved August 24, 2010. Rookie of the YearRookie of the Year . BET Hip Hop Awards 2008. Retrieved August 24, 2010. Best Hip-Hop Collabo (\"Low\" with T-Pain)Best Hip Hop Collabo BET Awards 2008. Retrieved August 24, 2010. MuchMusic Video Awards Best International Video (\"Low\" with T-Pain)Best International Video – Artist . MuchMusic Video Awards 2008. Retrieved August 24, 2010. People's Choice Favorite International Video (\"Low\" with T-Pain) MTV Video Music Awards Best Hip-Hop Video (\"Low\" with T-Pain) Best Male Video (\"Low\" with T-Pain)Best Male Video, Best Hip Hop Video. MTV Video Music Awards 2008. Ozone Awards Breakthrough Artist Club Banger of the Year (\"Low\" with T-Pain) Teen Choice Awards Choice Breakout Artist Choice Rap Artist Choice Hook-Up (\"Low\" with T-Pain) 2009 ARIA Music Awards Breakthrough Artist Single (\"Running Back\" with Jessica Mauboy)2009 ARIA Awards details announced Retrieved August 20, 2010 Highest Selling Single (\"Running Back\" with Jessica Mauboy) APRA Awards Urban Work of the Year (\"Running Back\" with Jessica Mauboy)APRA Award winners announced Retrieved August 24, 2010. Grammy Awards Best Rap/Sung Collaboration (\"Low\" with T-Pain) MTV Australia Awards Best Video (\"Low\" with T-Pain) Best Collaboration (\"Running Back\" with Jessica Mauboy) MTV Video Music Awards Best Hip-Hop Video (\"Right Round\") NT Indigenous Music Awards Single Release of the Year (\"Running Back\" with Jessica Mauboy) People's Choice Awards Favorite Hip-Hop Song (\"Low\" with T-Pain)People's Choice Awards Nominations 2009 Retrieved November 10, 2008 Teen Choice Awards Best Hip-Hop Rap Track (\"Right Round\") 2010 APRA Awards Urban Work of the Year (\"Running Back\" with Jessica Mauboy) Grammy Awards Best Rap Album (R.O.O.T.S.) Album of the Year (The Fame as a featured artist) Latin Billboard Music Awards Crossover Artist Of The Year Crossover Artist of the Year, Solo People's Choice Awards Hip-Hop Artist of the Year 2012 Premios 40 Principales Mejor Artista Internacional en Lengua No Española Mejor Álbum Internacional en Lengua No Española Teen Choice Awards Single by Male Artist (\"Good Feeling\") R&B;/Hip-Hop Artist R&B;/Hip-Hop Song (\"Wild Ones\" with Sia) Music Star Male Billboard Music Award Top Rap Song (\"Good Feeling\") International Dance Music Award Best R & B/Urban Dance Track (\"Good Feeling\") Best Rap/Hip Hop Dance Track (\"Good Feeling\") MTV Europe Music Awards Best Male Best World Stage Performance American Music Awards Favorite Pop/Rock Male Artist 2013 Peoples Choice Awards Favorite Hip-Hop Artist Grammy Awards Best Rap/Sung Collaboration (\"Wild Ones with Sia\") NRJ Music Awards International Male Artist of the Year International Dance Music Awards Best Rap/Hip-Hop Dance Track (\"Wild Ones\") Billboard Latin Music Awards Crossover Artist of the Year 2013 Billboard Music Awards Top 100 Artist Top Male Artist Top Digital Songs Artist Top Rap Artist Top Rap Song (\"Wild Ones\") Top Rap Song (\"Whistle\") ==References== ==Other websites== Category:Living people Category:1979 births Category:African-American rappers Category:American dance musicians Category:American hip hop singers Category:American pop singers Category:Atlantic Records artists Category:Rappers from Florida Category:Democrats (United States) Category:People's Choice Award winners Category:Actors from Miami Category:American songwriters Category:Eurovision Song Contest entrants Category:Musicians from Miami Category:Pseudonyms Category:Singers from Miami Category:Twin people from the United States Category:American pop rappers",
 "title": "Flo Rida"
}