{
 "id": "346073",
 "text": "Harry Potter and the Goblet of Fire is a 2005 fantasy movie directed by Mike Newell. It is based on J. K. Rowling's 2000 novel of the same name. It is the sequel to Harry Potter and the Prisoner of Azkaban (2004) and the fourth movie in the Harry Potter movie series. It stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. The movie is the first of the series to receive a PG-13. It was the highest- grossing movie of 2005 and the sixth-highest-grossing movie in the Harry Potter series. The movie was nominated for the Academy Award for Best Art Direction, and won the BAFTA Award for Best Production Design. == Plot == Harry Potter, Ron Weasley, Hermione Granger and the rest of Ron's family attend a Quidditch game. The game is attacked by a group of terrorist wizards named Death Eaters. The Death Eaters were the followers of Lord Voldemort before he died. At Hogwarts school, Professor Dumbledore announces that the school will host the Triwizard Tournament, a game where three magical schools compete in several challenges. The contestant from each school is chosen by the Goblet of Fire. From the Bulgarian magic school, Viktor Krum is chosen. From the French magic school, Fleur Delacour is selected. However, everyone is shocked when the Goblet of Fire selects two contestants for Hogwarts: Cedric Diggory and Harry. For the first task, the contestants must each retrieve a golden egg from a dragon. For the second task, the contestants must each rescue somebody from the Black Lake, where they are attacked by evil mermaids. In both tasks, Harry is given help by a new teacher named Professor Moody. After the task, Harry finds the dead body of Barty Crouch, an official of the Ministry of Magic (magical government). Harry and Dumbledore look into the past and find out that Barty Crouch's son (Barty Crouch Junior) is a Death Eater. For the third task, the contestants must find the trophy, which has been hidden by Professor Moody inside a maze. Both Harry and Cedric find the trophy, but it teleports them to a graveyard. In the graveyard, Voldemort is revived by his loyal servant, Peter Pettigrew. Voldemort also kills Cedric Diggory. Voldemort tries to kill Harry but the ghosts of people that Voldemort has killed arrive to distract him so that Harry can teleport back to Hogwarts. \"Professor Moody\" drags Harry into his office. It is revealed that the real Professor Moody has been locked up and is being impersonated by Barty Crouch Junior. Dumbledore announces the death of Cedric and the return of Voldemort but the Ministry of Magic denies that Voldemort has returned. ==Other websites== * * * Category:2005 fantasy movies Category:British fantasy movies Category:2000s American fantasy movies Harry Potter 4 Category:Warner Bros. movies Category:Movies based on books Category:Movies directed by Mike Newell Category:Movies composed by John Williams",
 "title": "Harry Potter and the Goblet of Fire (movie)"
}