{
 "id": "34607",
 "text": "A pulmonary embolism is a clot of material (an emboli) that blocks blood from getting to the lungs. An emboli is a blood clot that starts somewhere else in the body and travels somewhere else, usually after becoming attached. This type of emobli goes to the lungs (respiratory system). However, it can also be caused by clumped cancer cells, fat, or bone. Rarely, while giving birth, a woman can get a clot of amniotic fluid. == Symptoms == Symptoms of a pulmonary embolism start suddenly, as soon as the clot starts blocking blood flow to the lungs. Blood is supposed to pick up oxygen in the lungs and then carry that oxygen to the rest of the body, and pick up carbon dioxide to breathe out. If blood cannot get through to the lungs it cannot pick up oxygen, or deliver it to the body. Every part of the body needs blood and oxygen to survive. Often, the first sign of a pulmonary embolism is syncope (fainting), because the brain is not getting enough blood and oxygen. Massive PE causes troponin T and I levels to rise from causing right ventricular heart strain. Other symptoms include: * Chest pain that feels like a knife sticking into the chest. The pain is often worse when the person breathes in. * Trouble breathing * Hemoptysis (blood in the the chest space or airways, and may cause coughing up blood) * Low oxygen saturation (because the body is not getting enough oxygen) === Saddle embolus === The worst kind of pulmonary embolism is caused by a saddle embolus. This kind of embolus blocks the pulmonary artery, which carries blood from the right side of the heart to the lungs. This makes it impossible for any blood to get through to the lungs. Since no blood can get out to the rest of the body, the person's blood pressure drops and they can go into shock. A saddle embolus is a very serious medical emergency. Many people with this type of embolus die. == Risk factors == There are many risk factors that make it more likely for a person to get a pulmonary embolism. For example: * Smoking * A type of abnormal heart rhythm called atrial fibrillation (\"A-fib\") * Recent surgery (after surgery, the bodies blood clotting system works harder than usual, to help heal the body. If clots travel to the lungs, they can cause a pulmonary embolism) * Being paralyzed, bedridden, or not able to move around very much * Sitting in one place for a long time, like on a long airplane flight (this makes the blood pool in the legs; if a blood clot forms in the leg, it can travel through the blood vessels to the lungs) * Recent fracture of one of the long bones in the leg (because having a broken leg makes it harder to move around; also, clots of fat from the bone marrow can escape from the broken bone and travel to the lungs) * High levels of estrogen because of pregnancy or some birth control pills * Having had a deep vein thrombosis (DVT) - a blood clot in a large vein - before * Certain kinds of cancer (some kinds can cause extra blood clotting) * Being overweight or obese == Treatment == There are a few treatments for pulmonary embolism. The choice of which treatments to use depends on how serious the pulmonary embolism is. Treatments include: * Oxygen. Oxygen can be given through a special mask to make it easier for the person's body to get the oxygen it needs. * Anticoagulants. These are medicines commonly called \"blood thinners.\" Doctors may give a few blood thinners together. For example, they may give heparin because it works right away. They may also give warfarin (Coumadin), which takes a few days to start working, but which the patient can keep taking at home. * Thrombolytics. These are medicines often called \"clot busters\" or \"clot dissolvers.\" They can quickly dissolve (break up) a clot. However, they are usually given only if a pulmonary embolism is life- threatening, because they can cause bleeding. * Removing the clot. Sometimes a doctor will thread a catheter (a flexible tube) up through a vein and into the lung. Once the doctor finds the clot, the catheter can be used to pull the clot out, or to give medicine to dissolve the clot. In very bad cases, surgery may be needed to remove a clot. ==References== Category:Pulmonology",
 "title": "Pulmonary embolism"
}