{
 "id": "34618",
 "text": "Stegosaurus (meaning \"roof-lizard\") was a type of plant-eating dinosaur which lived in what is now western North America. Stegosaurus lived in the Upper Jurassic period around 155 to 145 million years ago. It is one of the most easily recognized dinosaurs, with its distinctive double row of kite-shaped plates on its back, and the long spikes on its tail. The armor was necessary as it lived with such meat-eaters as Allosaurus and Ceratosaurus. ==Discovery and species== Stegosaurus was originally named by Othniel Charles Marsh in 1877, from fossils found near Morrison, Colorado. These first bones became the first species of Stegosaur named: Stegosaurus armatus. Several different Stegosaurus species have been found. * Stegosaurus armatus: This was the first type of Stegosaurus to be found. Over thirty different skeletons have been discovered by scientists. This type had four tail spikes and small plates. At 9 meters (30 ft), it was the longest species of Stegosaurus. * Stegosaurus stenops: Named by Marsh in 1887, it was discovered near Cañon City, Colorado, in 1886. This is the best known species of Stegosaurus, mainly because its fossils make at least one complete skeleton. It had large, broad plates and four tail spikes. S. stenops is known from at least 50 partial skeletons of both adults and juveniles, one complete skull and four partial skulls. It was shorter than S. armatus, at 7 m (23 ft). * Stegosaurus longispinus: This type of Stegosaur is known from one incomplete skeleton. S. longispinus had a set of very long tail spines. Like S. stenops, it grew to 7 m (23 ft) in length. * S. ungulatus: Named by Marsh in 1879 from remains recovered at Como Bluff, Wyoming, it is only known from a few backbones and armor plates. It is probably the same as S. armatus. * S. sulcatus: This is another partial skeleton. It is probably the same as S. armatus. * S. duplex: This animal is probably the same as S. armatus. It was also named by Marsh in 1887,. Its fossils were found in 1879 by Edward Ashley at Como Bluff, Wyoming. * ?S. seeleyanus: Probably the same as S. armatus. * ?S. (Diracodon) laticeps: Named by Marsh in 1881 from some jawbone fragments. ==Paleobiology== Stegosaurus was the largest stegosaur, reaching up to 12 m (39.4 ft) in length and weighing up to 5,000 kg (5.5 short tons). However, 7 to 9 m was a more usual length. ===Skull=== The skull of Stegosaurus was long and narrow. Because of its short front legs, its head was close to the ground, probably no higher than 1 m (3.3 ft). It ate low-growing plants because of this. It had no front teeth, but it did have a horn-covered beak. Stegosaurian chewing teeth were small and triangular and did little grinding as they lacked wear surfaces. Unlike most dinosaurs, it did not have a lacuna (hole) in its skull between the nose and eye. ===Nervous system=== It has often been said that the Stegosaurus brain was the size of a walnut. Actually, it had a brain several times the size of a walnut. The bundle of nerves near the base of the tail that controlled reflexes in the back of the body was larger than the brain and is sometimes said to be a \"second brain\". These issues are discussed in Dinosaur brains and intelligence. ===Posture=== Stegosaurus had very short forelimbs in relation to its hind legs. The back legs each had three short toes, while the front legs had five toes. All four limbs were supported by pads behind the toes. ==Classification== Stegosaurus was a member of the Thyreophora, or armored dinosaurs, a family of dinosaurs which includes the ankylosaurs. ==Popular culture== Stegosaurus has been declared the State Dinosaur of Colorado. It has also appeared in many movies and TV shows. ==Footnotes== == Other websites == * Dinopedia * Stegosaurus \"roofed lizard\" , by T. Mike Keesey at The Dinosauricon. Category:Stegosaurs Category:Jurassic dinosaurs",
 "title": "Stegosaurus"
}