{
 "id": "3461",
 "text": "Albania ( ; ), officially called the Republic of Albania is an independent country located in Southeast Europe, more specifically it is located in the Balkans. The capital is Tirana, and other important cities are Durrës, Elbasan and Vlora. Over 3 million people live in the area of that Albanians call their home. The majority of Albanians are Muslim with 55%, 23% Eastern Orthodox and 15% Roman Catholics. Albania is next to Montenegro, Serbia, North Macedonia, Kosovo and Greece. It has a coast on the Adriatic Sea in the west, and a coast on the Ionian Sea in the southwest. The official language is Albanian(Gjuha Shqipe). The national anthem is Hymni i Flamurit. ==History== Albania was the southern part of Illyria during the Roman Empire. In the Middle Ages the Albanians were ruled by many foreign countries, including the Byzantine and Venetian Empires and during the 16th century resistance to the Ottoman Empire's rule was led by the Albanian national hero Skanderberg but his real name was Gjergj Kastrioti. After four centuries of Turkish domination, finally in the 20th century an independent Albania was created. In 1939 Albania was conquered by fascist Italy and was part of the Kingdom of Italy until 1943. After World War II Albania became independent again, under communist rule. It was ruled by Enver Hoxha, who died in 1985. Ramiz Alia took over and also later became president when, in 1992, Albania returned to democracy, and it now has friendly relations with the European Union, which it has applied to join. ==Divisions== Albania is divided into 12 counties. These counties include 36 districts and 373 municipalities County Capital Districts Municipalities Cities Villages 1 Berat Berat Berat Kuçovë Skrapar 10 2 8 2 1 2 122 18 105 2 Dibër Peshkopi Bulqizë Dibër Mat 7 14 10 1 1 2 63 141 76 3 Durrës Durrës Durrës Krujë 6 4 4 2 62 44 4 Elbasan Elbasan Elbasan Gramsh Librazhd Peqin 20 9 9 5 3 1 2 1 177 95 75 49 5 Fier Fier Fier Lushnjë Mallakastër 14 14 8 3 2 1 117 121 40 6 Gjirokastër Gjirokastër Gjirokastër Përmet Tepelenë 11 7 8 2 2 2 96 98 77 7 Korçë Korçë Devoll Kolonjë Korçë Pogradec 4 6 14 7 1 2 2 1 44 76 153 72 8 Kukës Kukës Has Kukës Tropojë 3 14 7 1 1 1 30 89 68 9 Lezhë Lezhë Kurbin Lezhë Mirditë 2 9 5 2 1 2 26 62 80 10 Shkodër Shkodër Malësi e Madhe Pukë Shkodër 5 8 15 1 2 2 56 75 141 11 Tirana Tirana Kavajë Tirana 8 16 2 3 66 167 12 Vlorë Vlorë Delvinë Sarandë Vlorë 3 7 9 1 2 4 38 62 99 ==Cities == This is a list of the largest cities in Albania. Rank City 2001 CensusAlbania: largest cities and towns and statistics of their population World Gazetteer.2009-12-01 2011 census 1 Tirana 352,581 421,286 2 Durrës 113,465 115,550 3 Vlorë 85,180 79,948 4 Elbasan 95,554 79,810 5 Shkodër 85,798 74,876 6 Fier 56,297 57,198 7 Korçë 58,911 51,683 8 Berat 45,572 36,467 9 Lushnjë 38,336 31,424 10 Kavajë 28,149 20,312 ==Armed forces== The Albanian Armed Forces were first formed after independence in 1912. Albania reduced the number of active troops from 65,000 in 1988 to 14,500 in 2009. In 2010 forced conscription was abolished. ==Geography== Albania has a total area of 28,748 square kilometers. Albania's coastline length is . It goes along the Adriatic and Ionian Seas. On the coast there are mild, wet winters and warm, sunny, and rather dry summers. 70% of the country is mountains. The highest mountain is Korab. Albania is bordered by Greece, the Republic of North Macedonia, Montenegro and Kosovo. A short stretch of sea separates Albania from the far southeast of Italy. ==Flora and fauna== Although a small country, Albania has a lot of variety in plants and animals. The total number of plants is over 3250 species. There are over 350 bird species, 330 freshwater and marine fish and 80 mammal species. The Double-headed eagle is the national symbol of Albania. ==Related pages== * Albania at the Olympics * Albania national football team * List of rivers of Albania ==References== == Other websites == * National Tourism Organization Albania's official website for travel & tourism information. Category:European Union candidate states Category:Members of the Organisation of Islamic Cooperation",
 "title": "Albania"
}