{
 "id": "346445",
 "text": "The Australian cricket team is the national cricket team of Australia. It is the joint oldest team in Test cricket. They were in the first Test match in 1877. The team also plays One Day International cricket and Twenty20 International. They were in the first ODI, against England in the 1970–71 season. They were in the first Twenty20 International, against New Zealand in the 2004–05 season. They won both games. The Australian team has played 859 Test matches, winning 408, losing 231, drawing 218 and tying two. Australia ranked the number-one team overall in Test cricket in terms of overall wins, win-loss ratio and wins percentage. Australia is ranked fourth in the ICC Test Championship behind England, South Africa and India. They led the Test rankings for a record time of 74 months from 2003 to 2009. Australia has played 982 ODI matches, winning 596, losing 343, tying nine and with 34 ending in no-result. They have led the ICC ODI Championship since it started for all but 48 days in 2007. Australia made a record six World Cup final appearances (1975, 1987, 1996, 1999, 2003 and 2007). They have won the World Cup a record four times in total; 1987 Cricket World Cup, 1999 Cricket World Cup, 2003 Cricket World Cup and 2007 Cricket World Cup. Australia is the first team to be in 4 consecutive World Cup finals (1996, 1999, 2003 and 2007). The team was undefeated in 34 consecutive World Cup matches until 19 March at the 2011 Cricket World Cup. There Pakistan beat them by 4 wickets. Australia won the ICC Champions Trophy twice – in 2006 and in 2009 – making them the first and the only team to become back to back winners in the Champions Trophy tournaments. The team has also played 177 Twenty20 Internationals. ==Tournament history== World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record World Cup record Year Round Position GP W L T NR 1975 Second Place 2/8 5 3 2 0 0 1979 Round 1 6/8 3 1 2 0 0 1983 Round 1 6/8 6 2 4 0 0 1987 Champions 1/8 8 7 1 0 0 1992 Round 1 5/9 8 4 4 0 0 1996 Second Place 2/12 7 5 2 0 0 1999 Champions 1/12 10 7 2 1 0 2003 Champions 1/14 11 11 0 0 0 2007 Champions 1/16 11 11 0 0 0 2011 Quarter finalist 5/14 7 4 2 - 1 2015 Qualified – – – – – – 2019 Qualified – – – – – – Total Automatic Qualification at all times 4/10 76 55 19 1 0 World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record World Twenty20 record Year Round Position GP W L T NR 2007 Semi Final 3/12 6 3 3 0 0 2009 Round 1 11/12 2 0 2 0 0 2010 Second Place 2/12 7 6 1 0 0 Total Automatic qualification at all times 0/3 15 9 6 0 0 Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Champions Trophy record Year Round Position GP W L T NR 1998 Qtr Final 6/9 1 0 1 0 0 2000 Qtr Final 5/11 1 0 1 0 0 2002 Semi Final 4/12 3 2 1 0 0 2004 Semi Final 3/12 3 2 1 0 0 2006 Champions 1/12 5 4 1 0 0 2009 Champions 1/8 5 4 0 0 1 Total 6 appearances 2/6 18 12 5 0 1 ==References== Cricket Category:1877 establishments in Australia Men Category:Test cricket teams Category:Men's national cricket teams",
 "title": "Australia men's national cricket team"
}