{
 "id": "346420",
 "text": "Sistema Brasileiro de Televisão, or simply SBT is a Brazilian television network launched by Silvio Santos on 1981. ==History== ===Before the SBT=== Rede Tupi, the channel 4 in São Paulo, began operations in 1950. In 1962 (when he began his first TV program), Silvio Santos produced his own programs on Tupi, TV Paulista and on Rede Globo beginning in 1965. Soon enough, he started plans to have his own television channel. His production company, Estudios Silvio Santos Cinema e Televisao, was successful on Tupi, Globo and (since 1972) on Record (where he then owned half of the company's stock). In 1976, with help from humorist and friend Manuel de Nóbrega (who had a show on Rede Globo and was part of Baú da Felicidade), Santos obtained a license for his own station: Rio de Janeiro's channel 11, known as \"TV Studios\" or \"TVS\". Soon after its launch, its flagship program (Programa Silvio Santos on Sundays) plus the late night Silvio Santos Diferente on weekdays began to be broadcast (Santos left Globo the same year). Other programs soon began, as the network gained support from city residents who sought an alternative to Globo, Tupi, Bandeirantes and TV Rio (the city's network, related to TV Record along with TVS). The new channel debuted on 14 May 1976, with a logo of a gold circle with the number 11 slanted in gold, which featured in the first Scanimate idents and promos for the channel - making it a pioneer station in the country when it came to computer animation. While during its early years the network studios were based in Rio, all program production for TVS transferred to São Paulo in 1978–79. When Rede Tupi went out of business in 1980, Santos obtained three stations from the network: the São Paulo's channel 4, the Porto Alegre's channel 5 and the Belém's channel 5. The SBT was created, launching on 19 August 1981, but using the TVS name until 1990 for some of its stations. Until the formation of the SBT, the Silvio Santos Group also had a station named TVS in Nova Friburgo, serving viewers in the northern and western parts of the state, this was also its first branch station, having opened in 1979. In 1978, Minas Gerais' TV Alterosa became one of the SBT's broadcast-affiliate networks, the first affiliate station for the channel. Some later affiliates were adopted from Rede Tupi after its closure on 18 July 1980, by order of Brazilian Minister of Communications Haroldo de Matos, who the following year would order SBT to begin transmissions. When Tupi closed, Programa Silvio Santos moved to Record but continued simulcasting Sundays on the TVS Channels 11 and 3, as well as on yet another SS Group station - Channel 9, purchased from TV Continental. Santos began the network's expansion efforts, convincing stations to become the SBT and Record affiliates. The official launch of the network on 19 August 1981, also marked the debut of its first presentation package using its famous circle logo (similar to the one used till today by the American Broadcasting Company) and dual branding (the SBT being the official name of the network while TVS being the station branding in its three founding stations), and it was the only network launch to be held in Brasilia and broadcast directly from the federal capital city. The first idents were similar to ABC's Still the One idents of 1979, used by the Nine Network in Australia in 1980. The Matos decision also gave the network the Sumare studios of Tupi for drama production. By the time of the 1981 launch the SBT had 18 affiliate channels nationwide. ===1980s=== During the 1980s, the SBT established itself, contracting popular hosts and airing a mix of its own and Televisa programming (especially Mexican telenovelas and comedy shows such as El Chavo del Ocho and El Chapulín Colorado). It climbed to second place in the Brazilian ratings (except in Rio de Janeiro, where Rede Manchete occupied that position). Moreover, it hosted the Brazilian version of Bozo for kids plus even let ex-Tupi program presenters bring their shows over to the fledgling network. The SBT, together with Record (under the SBT/Record pool) broadcast the 1984 Summer Olympics in Los Angeles, two years before its 1986 FIFA World Cup coverage. 1985 would see the SBT score a historic victory with the broadcast of the Australian miniseries The Thorn Birds, and TVS Channel 4 São Paulo became SBT Channel 4 São Paulo, thus becoming a truly national network with the introduction of satellite broadcasts. In March 1986, the network premiered its new talk show, Hebe, with Hebe Camargo as host; the show was formerly on Rede Tupi and Rede Bandeirantes. It became one of the network's longest-running programs, running for over 24 years; the final show was at the end of 2010, when Camargo ended her contract. She had a spin-off show, Hebe por Elas (Hebe for All), during the early 1990s. The death of Flavio Cavacante, one of the network's pioneer presenters, just days after his 22 May episode of his own program shocked the nation so much that on the day of his funeral the network started transmissions only in the afternoon in his honor. In 1987, Santos pursued a better-quality program lineup, while trying to attract a larger audience and better advertisers. During that year (in response to the high popularity of Rede Globo's Xou da Xuxa on weekdays), SBT began increasing its child-oriented programming with programs such as Oradukapeta, Show Maravilha and the Do Re Mi series. Nearly all SBT kids' programs had female presenters (different from the format of Xou da Xuxa), because Oradukapeta was hosted by Sergio Mallandro (also a Show de Calorous judge). The network also launched its slogan \"Quem procura, acha aqui\", modeled on NBC's three-year \"Be There\" campaign project from 1983 to 1985. The slogan lasted for three seasons, with a new promo each year. The theme used each year corresponded to NBC's theme for its project: * 1983–1987: NBC's \"Be There\", with SBT's first installment of \"Quem Procura Acha Aqui\" * 1984–1988: NBC's first installment of \"Let's All Be There\", with SBT's second \"Quem Procura Acha Aqui\" * 1985–1989: NBC's second installment of \"Let's All Be There\", with SBT's third and final \"Quem Procura Acha Aqui\" Even all program adverts were also modeled on the NBC ones, with the 1989-90 edition seeing the program talents saying the day the program will be aired followed by the phrase No SBT (On SBT) with the program time being shown, this style was carried on to 1990. 1987 also was the year that the network began to change its corporate branding from TVS to the SBT, and the 2nd year of its \"QPAA\" campaign resulted in the logo being relaunched, now with slanted colors on the circle (similar to ABC's 1987-88 logo and its \"Something's Happening on ABC\" campaign). Humorist Jô Soares was brought in from TV Globo in 1988, introducing a late-night talk program to Brazilian TV with his 11:30 PM show entitled Jô Soares Onze e Meia. Also signed was Boris Casoy, who became the first news anchor in Brazil with his TJ Brasil newscast (which succeeded Noticentro, the network's first newscast with Antonio Casale) and ex-Balão Mágico member Simony. In 1988, Santos prevented host \"Gugu\" Liberato from signing with Globo after Liberato hosted the SBT's big weekend hit Viva a Noite since 1986. This was widely seen as indicative that Gugu would be Santos' successor on Sunday afternoons, reinforced by the extended timeslot of Gugu's future program Domingo Legal. As a result, Programa Sílvio Santos adopted the dual-presenter format, with Gugu hosting segments such as the Brazilian version of Double Dare, called Passa ou Repassa (known for its \"Torta na Cara\" segment) and Cidade contra Cidade. ===1990s=== The TVS brand was merged into the SBT brand in 1990; the name change was seen in a new campaign ad modeled on NBC's \"Come Home to NBC\" campaign of 1986–87, which premiered early that year, and in August on TV station identifications celebrating SBT's ninth year of broadcasts (that year, Silvio Santos sold Record as a national network) and it also broadcast the 1990 FIFA World Cup. 1991 saw the beginning of its newscast Aqui Agora and Serginho Groisman's Programa Livre variety show, just a few of the many successes for the year even as the network's São Paulo studios suffered damages due to massive floods that hit the city. In 1992, the SBT and Rede Globo (together with Manchete, Band, and SporTV) jointly broadcast the 1992 Summer Olympics and the 1996 Summer Olympics (together with Manchete, Record, Band, SporTV, and ESPN) nationwide, with a grand advertising campaign for the Brazil national team. Despite problems and even the transfer of talents to other stations (such as the then resurgent Rede Record), the 90s proved to be a boom for the network, beginning its second decade with 74 affiliates, bigger when it signed on. The SBT invested in its own telenovelas and remakes of successful ones from foreign networks (most notably Chiquititas), variety programs, news and current affairs, and broadcast rights for sporting events (including the Copa Mercosur, Copa do Brasil and Champ Car). It signed host Carlos \"Ratinho\" Massa in 1998, obtained more Mexican productions and launched game shows (such as Show do Milhão) in 1999. By the end of the decade the SBT held second place in the Brazilian ratings, after Globo, strengthed by a brand new and technologically advanced television complex, the CDT da Anhanguera, inaugurated in 1996, just in time for its 15th anniversary. ====Ad campaigns==== ;American and Australian imports The 1990s were the SBT's most fruitful decade for American-style ad campaigns: * 1987–1990: NBC's second installment of \"Come Home to NBC\", with \"Vem Que é Bom\" with the graphics of 1988's \"Come Home to the Best, Only on NBC\" * 1986–1991: NBC's first year of \"Come Home\", with \"10 anos com você\" (the 10th-anniversary slogan) * 1990–1991 and 1993–94: CBS's second year of \"Get Ready for CBS\" with \"Se liga no SBT\". On 20 January 1991, the Australian Network Ten launched \"That's Entertainment\" to coincide with a logo change, using in-house music and similar graphics * 1989–1992 and 1995: ABC's first year of \"America's Watching ABC\" became \"Fique ligado no SBT\". In 1992 Ten launched \"This Is It\" with its promo based on the music from \"America's Watching\", in a different key with different instrumentation and vocals. ;Domestic campaigns * In 1992, the one-minute spot \"Aqui Tem\" was launched for network-wide use. The promo featured an in-house soundtrack (with similarities to NBC's \"Come Home to the Best, Only on NBC\" campaign of 1988–89) and graphic elements from NBC's 1991 campaign, \"The Place to Be\". * In August 1996 the SBT launched a new logo (replacing its multicoloured stripes with solid colours) and relaunched \"QPAA\" with a new slogan, \"Tudo Pra Você\", for its 15th anniversary. * In 1997, the SBT made its new graphics based on ABC's 1996 campaign, Watched by More People. * In 1998, the network released \"A cara do Brasil\", with new graphics and soundtrack. * In 1999 the network produced \"Na nossa frente, so você\", with new graphics and music. The 64-second promo was used on-air for the first time in 2000; the slogan was used until 2004 with two songs composed for this. The 1st campaign spot (1999-2000) mirrored the Nine Network's 1997 promo spots but with an original soundtrack. ===2000s=== The SBT began the decade investing in movies, broadcasting a package of Disney (now affiliated with TV Globo) and Time Warner productions (the latter promoted in a one-hour network block). In 2001, the controversial reality show Casa dos Artistas, accused by many of being a copy of Endemol's Big Brother, marked the first time SBT led the Sunday-night ratings, aside from its Domingo Legal program becoming no.1 in the Sunday afternoon ratings. Since 2003, with the ratings advances of Record and Rede Bandeirantes, the SBT's ratings have declined. Two events that year marked the beginning of its problems: * Early in the year Silvio Santos gave an interview with the TV-gossip magazine Contigo!, in which he stated that he was ill and had sold the SBT. Later, he claimed that this was intended as a joke. * The \"Gugu-PCC scandal\": On September 7 Domingo Legal aired an interview with alleged members of the criminal group PCC, threatening the deputy mayor of São Paulo and the hosts of police reality programs on the competing TV Record and RedeTV! networks. Later, it was discovered that this was a hoax; the program was suspended for a week, its audience never recovered and Gugu Liberato (its host, once seen as Santos' successor) never regained his credibility. Since then the SBT has aired the successful Rebelde and shows with child host Maisa Silva, who became popular; however, programs could change without previous announcement (even hosts were sometimes out of the loop), confusing the audience. In 2006 SBT celebrated its 25th anniversary in a deepening crisis. The SBT is the second-largest network in the country, vying for leadership with Rede Record. The CDT da Anhanguera is the second-largest television- production center in Brazil, behind Projac (owned by Rede Globo). Over 5,000 employees work around the clock at the SBT's 110 TV stations. In 2008 the network lost second place in the ratings to Record, but tied for second place the following year. In 2009 Liberato moved to Record after more than 20 years with the SBT; at the same time, the SBT signed presenters Roberto Justus and Eliana from Record. It also appeared on SKY Brasil, the last of the five major Brazilian networks to do so. Recent programs include What's Your Talent, a local combination of Britain's Got Talent and Show de Calouros (created and hosted by Silvio Santos during the 1970s); a Brazilian version of 1 vs. 100; an annual telethon, which raised R$19 million in 2009; Kyle XY; the reality show Solitary; Smallville, Grey's Anatomy and De Frente with Gabi, a talk show featuring journalist Marilia Gabriela. TV Alagoas left the network in September 2009 and to broadcast religious programs, and SBT executive director William Stoliar sued to ensure the network's availability there. It returned to the SBT on June 1, 2010, due to viewer pressure and late rent payments by religious programs. In February 2014 the Communist Party of Brazil sends to the Federal Government a questioning, for which he cut around 75 million dollars in advertising the broadcaster, because of criticism that the journalist Rachel Sheherazade makes against the Government. ===2020s=== While the network at large suffered from the effects of the COVID pandemic in the country, it found a renewed calling in sports. One after the other, the network pursued new sporting investments when it snagged the broadcasting rights for the Campeonato Carioca 2020 grand final, followed by a renewed commitment to the Copa Liberatores for the 2020–22 period. In 2021, left and right came contracts after contracts for sports broadcasts with SBT getting the nod as broadcaster to the 2021 Copa America, and a number of arena football and futsal events - a first in network history as SBT marked its 40th anniversary. Buoyed by the sporting successes against the competition the network revived its sports newscasts: Arena SBT, which originally premiered in 2014, returned in 2020, followed by the launch the following year of SBT Sports. == References == Category:Brazilian television networks",
 "title": "Sistema Brasileiro de Televisão"
}