{
 "id": "346479",
 "text": "This is a list of movies that were released in the United States in 2012. == Highest-grossing movies == The top ten films released in 2012 by worldwide gross are as follows: Highest-grossing films of 2012 Rank Title Studio Worldwide gross 1 The Avengers Marvel Studios / Disney $1,511,757,910 2 Skyfall MGM / Columbia $1,108,561,013 3 The Dark Knight Rises Warner Bros. / Legendary $1,084,439,099 4 The Hobbit: An Unexpected Journey Warner Bros. / MGM / New Line $1,017,003,568 5 Ice Age: Continental Drift Fox / Blue Sky $877,244,782 6 The Twilight Saga: Breaking Dawn – Part 2 Lionsgate / Summit Entertainment $829,224,737 7 The Amazing Spider-Man Columbia / Marvel Entertainment $752,216,557 8 Madagascar 3: Europe's Most Wanted DreamWorks $742,110,251 9 The Hunger Games Lionsgate $691,247,768 10 Men in Black 3 Columbia $624,026,776 == Events == *1st AACTA International Awards *18th Screen Actors Guild Awards *32nd Golden Raspberry Awards *38th People's Choice Awards *38th Saturn Awards *62nd Berlin International Film Festival *65th British Academy Film Awards *69th Golden Globe Awards *69th Venice International Film Festival *84th Academy Awards *2012 Cannes Film Festival *2012 MTV Movie Awards *2012 Sundance Film Festival *2012 Toronto International Film Festival ==2012 movies== ===January – March=== ₪ - Movies that became a wide-release after their debut W - Wide release in the United States of America L - Limited release in the United States of America R - Re-release in the United States of America Opening Title Studio Cast and crew Genre Medium Ref. J A N U A R Y 6 W The Devil Inside Paramount Pictures / Insurge Pictures William Brent Bell (director/screenplay); Matthew Peterman (screenplay); Fernanda Andrade, Isabella Rossi, Simon Quarterman, Evan Helmuth, Ionut Grama, Suzan Crowley, Bonnie Morgan, Brian Johnson, Preston James Hillier, D.T. Carney Horror Live action 13 W Contraband Universal Pictures Baltasar Kormakur (director); Aaron Guzikowski (screenplay); Mark Wahlberg, Kate Beckinsale, Ben Foster, Giovanni Ribisi, Caleb Landry Jones, Lukas Haas, Diego Luna, J.K. Simmons Action, Crime Live action Joyful Noise Warner Bros. Todd Graff (director/screenplay); Queen Latifah, Dolly Parton, Keke Palmer, Jeremy Jordan, Courtney B. Vance, Kris Kristofferson Comedy, Musical Live action R Beauty and the Beast 3D Walt Disney Pictures / Walt Disney Animation Studios Gary Trousdale, Kirk Wise (directors); Linda Woolverton (screenplay); Paige O'Hara, Robby Benson, Richard White, Jerry Orbach, David Ogden Stiers, Angela Lansbury, Bradley Pierce, Rex Everhart, Jesse Corti, Hal Smith, Jo Anne Worley Family, Fantasy, Musical, Romance Animation L We Need to Talk About Kevin Oscilloscope Laboratories Lynne Ramsay (director/screenplay); Rory Kinnear (screenplay); Tilda Swinton, John C. Reilly, Ezra Miller Psychological thriller Live-action 20 W Haywire Relativity Media Steven Soderbergh (director); Lem Dobbs (screenplay); Gina Carano, Ewan McGregor, Antonio Banderas, Channing Tatum, Michael Fassbender, Bill Paxton, Michael Douglas, Michael Angarano Action Live action Red Tails 20th Century Fox / Lucasfilm Anthony Hemingway (director); John Ridley (screenplay); Cuba Gooding Jr., Terrance Howard, Bryan Cranston, Nate Parker, David Oyelowo, Tristan Wilds, Cliff Smith, Kevin Phillips, Rick Otto, Lee Tergesen, Andre Royo, Ne-Yo, Elijah Kelley, Marcus T. Paulk, Leslie Odom Jr., Michael B. Jordan, Jazmine Sullivan, Edwina Finley, Daniela Ruah, Stacie Davis, Gerald McRaney Action, War Live action Underworld: Awakening Screen Gems Mans Marlind, Bjorn Stein (directors); Len Wiseman, John Hlavin, Allison Burnett, J. Michael Straczynski (screenplay); Kate Beckinsale, India Eisley, Michael Ealy, Stephen Rea, Theo James, Charles Dance Action, Horror Live action L Coriolanus The Weinstein Company Ralph Fiennes (director); John Logan (screenplay); Ralph Fiennes, Gerard Butler, Vanessa Redgrave, Brian Cox, Jessica Chastain, James Nesbitt Thriller Live action Miss Bala Canana Films / 20th Century Fox Gerardo Naranjo (director/screenplay); Mauricio Katz (screenplay); Stephanie Sigman, Irene Azuela, Miguel Couturier, Gabriel Heads, Noe Hernandez, James Russo, Jose Yenque Action, Drama Live action 27 W The Grey Open Road Films Joe Carnahan (director/screenplay); Ian MacKenzie Jeffers (screenplay); Liam Neeson, Frank Grillo, Dermot Mulroney, Dallas Roberts, Joe Anderson, James Badge Dale, Nonso Anozie Action Live action Man on a Ledge Summit Entertainment Asger Leth (director); Pablo Fenjves, Erich Hoeber, Jon Hoeber (screenplay); Sam Worthington, Elizabeth Banks, Jamie Bell, Anthony Mackie, Ed Harris, Edward Burns, Titus Welliver, Génesis Rodríguez, Kyra Sedgwick Crime Live action One for the Money Lionsgate Julie Anne Robinson (director); Karen Ray, Stacy Sherman, Liz Brixius (screenplay); Katherine Heigl, Jason O'Mara, Daniel Sunjata, John Leguizamo, Debbie Reynolds, Debra Monk Action, Comedy Live action F E B R U A R Y 3 W Big Miracle Universal Pictures Ken Kwapis (director); Jack Amiel, Michael Begler (screenplay); John Krasinski, Drew Barrymore, Kristen Bell, Tim Blake Nelson, Dermot Mulroney, Ted Danson Drama, Adventure, Family Live action Chronicle 20th Century Fox Josh Trank (director/screenplay); Max Landis (screenplay); Dane DeHaan, Michael B. Jordan, Alex Russell, Michael Kelly Action, Sci-Fi Live action The Woman in Black CBS Films James Watkins (director); Jane Goldman (screenplay); Daniel Radcliffe, Ciarán Hinds, Janet McTeer, Liz White, Alisa Khazanova, Tim McMullan, Roger Allam, Daniel Cerqueira, Shaun Dooley, Mary Stockley, Cathy Sara, David Burke, Victor McGuire, Lucy May Barker Horror Live action L W.E. The Weinstein Company Madonna (director/screenplay); Alex Keshishian (screenplay); Abbie Cornish, Oscar Isaac, James D'Arcy, Andrea Riseborough, Natalie Dormer, Richard Coyle, James Fox, Laurence Fox Drama, Romance Live action 10 W Journey 2: The Mysterious Island Warner Bros. / New Line Cinema Brad Peyton (director); Mark Gunn, Brian Gunn (screenplay); Dwayne Johnson, Michael Caine, Josh Hutcherson, Vanessa Hudgens, Luis Guzman, Kristen Davis Adventure, Family Live action Safe House Universal Pictures Daniel Espinosa (director); David Guggenheim (screenplay); Denzel Washington, Ryan Reynolds, Sam Shepard, Robert Patrick, Liam Cunningham, Brendon Gleeson, Vera Farmiga, Fares Fares, Nora Arnezeder, Joel Kinnaman, Rubén Blades Action, Crime, Mystery Live action The Vow Screen Gems Michael Sucsy (director); Abby Kohn, Marc Silverstein, Jason Katims (screenplay); Rachel McAdams, Channing Tatum, Scott Speedman, Jessica Lange, Sam Neill Drama Live action R Star Wars Episode I: The Phantom Menace 3D 20th Century Fox / Lucasfilm George Lucas (director/screenplay); Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, Ahmed Best, Pernilla August, Ian McDiarmid, Anthony Daniels, Kenny Baker, Frank Oz, Ray Park Action, Adventure, Sci-Fi Live action L In Darkness Sony Pictures Classics Agnieszka Holland (director); David F. Shamoon (screenplay); Robert Wieckiewicz, Benno Furmann, Maria Schrader, Herbert Knaup War Live action Rampart Millennium Entertainment Oren Moverman (director); James Ellroy (screenplay); Woody Harrelson, Ben Foster, Robin Wright, Sigourney Weaver, Steve Buscemi, Anne Heche, Cynthia Nixon, Ice Cube, Brie Larson, Ned Beatty Crime Live action 17 W Ghost Rider: Spirit of Vengeance Columbia Pictures / Marvel Knights Mark Neveldine, Brian Taylor (directors); Scott Dimple, Seth Hoffman, David Goyer (screenplay); Nicolas Cage, Idris Elba, Fergus Riordan, Ciarán Hinds, Violante Placido, Johnny Whitworth Action, Adventure Live action The Secret World of Arrietty Walt Disney Pictures / Studio Ghibli Gary Rydstrom (director); Karey Kirkpatrick (screenplay); Will Arnett, Amy Poehler, Carol Burnett, Bridgit Mendler, David Henrie, Moises Arias Adventure Animation This Means War 20th Century Fox McG (director); Timothy Dowling, Simon Kinberg (screenplay); Tom Hardy, Chris Pine, Reese Witherspoon, Chelsea Handler, Til Schweiger, Abigail Spencer Action, Adventure, Comedy Live action 24 W Act of Valor Relativity Media \"Mouse\" McCoy, Scott Waugh (directors); Kurt Johnstad (screenplay); Active Duty Navy SEALs, Roselyn Sánchez, Alex Veadov, Jason Cottle, Nester Serrano Action Live action Gone Summit Entertainment Heitor Dhalia (director); Allison Burnett (screenplay); Amanda Seyfried, Jennifer Carpenter, Sebastian Stan, Wes Bentley, Michael Pare Thriller Live action Good Deeds Lionsgate Tyler Perry (director/screenplay); Tyler Perry, Thandie Newton, Rebecca Romijn, Brian J. White, Jamie Kennedy, Eddie Cibrian, Jordenn Thompson, Beverly Johnson, Phylicia Rashad, Gabrielle Union Romance, Dramedy Live action Wanderlust Universal Pictures David Wain (director/screenplay); Ken Marino (screenplay); Paul Rudd, Jennifer Aniston, Malin Akerman, Justin Theroux, Ken Marino, Lauren Ambrose, Joe Lo Truglio, Kerri Kenney-Silver, Kathryn Hahn, Alan Alda Comedy Live action M A R C H 2 W Dr. Seuss' The Lorax Universal Pictures / Illumination Entertainment Chris Renaud, Kyle Balda (directors) Cinco Paul, Ken Daurio (screenplay); Danny DeVito, Zac Efron, Taylor Swift, Ed Helms, Rob Riggle, Betty White, Jenny Slate Comedy, Musical, Adventure Animation Project X Warner Bros. Nima Nourizadeh (director); Matt Drake, Michael Bacall (screenplay); Miles Teller, Oliver Cooper, Jonathan Daniel Brown, Kirby Bliss Blanton, Thomas Mann, Alexis Knapp Comedy Live action L Being Flynn Focus Features Paul Weitz (director/screenplay); Robert De Niro, Paul Dano, Olivia Thirlby, Lili Taylor, Wes Studi, Julianne Moore Drama Live action 9 W A Thousand Words Paramount Pictures / DreamWorks Pictures Brian Robbins (director); Steven Koren (screenplay); Eddie Murphy, Kerry Washington, Cliff Curtis, Clark Duke, Allison Janney, Ruby Dee, John Witherspoon Comedy Live action John Carter Walt Disney Pictures Andrew Stanton (director/screenplay); Mark Andrews, Michael Chabon (screenplay); Taylor Kitsch, Lynn Collins, Samantha Morton, Mark Strong, Willem Dafoe, Ciarán Hinds, Thomas Haden Church, Dominic West, James Purefoy, Daryl Sabara, Polly Walker, Bryan Cranston Fantasy, Sci-Fi, Action, Adventure Live action Silent House Open Road Films Chris Kentis (director); Laura Lau (director/screenplay); Elizabeth Olsen, Adam Trese, Eric Sheffer Stevens, Julia Taylor Ross, Haley Murphy, Adam Barnett Horror, Thriller Live action L Friends with Kids ₪ Lionsgate / Roadside Attractions Jennifer Westfeldt (director/screenplay); Adam Scott, Jennifer Westfeldt, Jon Hamm, Kristen Wiig, Maya Rudolph, Chris O'Dowd, Megan Fox, Edward Burns Comedy, Romance Live action Salmon Fishing in the Yemen CBS Films / Lionsgate Lasse Hallström (director); Simon Beaufoy (screenplay); Ewan McGregor, Emily Blunt, Kristin Scott Thomas, Amr Waked Drama, Romance Live action 16 W 21 Jump Street Columbia Pictures / MGM Phil Lord, Chris Miller (directors/screenplay); Michael Bacall (screenplay); Jonah Hill, Channing Tatum, Ice Cube, Brie Larson, Rob Riggle, DeRay Davis, Dave Franco, Jake Johnson, Johnny Simmons, Johnny Pemberton, Dakota Johnson, Ellie Kemper, Johnny Depp Action, Comedy Live action L Casa de Mi Padre Pantelion Films / Lionsgate Matt Piedmont (director); Andrew Steele (screenplay); Will Ferrell, Gael García Bernal, Diego Luna, Nick Offerman, Génesis Rodríguez, Efren Ramirez, Adrian Martinez, Pedro Armendáriz Jr. Action, Comedy Live action Detachment Tribeca Film Tony Kaye (director); Carl Lund (screenplay); Adrien Brody, Marcia Gay Harden, Christina Hendricks, Betty Kaye, Sami Gayle, Bryan Cranston, William Petersen, Tim Blake Nelson, Lucy Liu, Blythe Danner, James Caan, Isiah Whitlock Jr., Renee Felice Smith Drama Live action Jeff, Who Lives at Home Paramount Vantage Mark Duplass, Jay Duplass (directors/screenplay); Jason Segel, Ed Helms, Judy Greer, Susan Sarandon, Evan Ross Dramedy Live action Natural Selection Cinema Guild Robbie Pickering (director/screenplay); Rachael Harris, Matt O'Leary, Jon Gries, John Diehl Comedy Live action 23 W The Hunger Games Lionsgate Gary Ross (director/screenplay); Suzanne Collins, Billy Ray (screenplay); Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Wes Bentley, Elizabeth Banks, Amandla Stenberg, Stanley Tucci, Woody Harrelson, Lenny Kravitz, Toby Jones, Donald Sutherland, Alexander Ludwig, Isabelle Fuhrman Action, Adventure, Sci- Fi Live action L The Deep Blue Sea Music Box Films Terence Davies (director/screenplay); Rachel Weisz, Tom Hiddleston, Simon Russell Beale, Ann Mitchell, Harry Hadden-Paton, Sarah Kants, Jolyon Coy Drama, Romance Live action The Raid: Redemption ₪ Sony Pictures Classics Gareth Evans (director/screenplay); Iko Uwais, Doni Alamsyah, Joe Taslim, Yayan Ruhian, Ray Sahetapy foreign action Live action 30 W Mirror Mirror Relativity Media Tarsem Singh (director); Jason Keller, Melisa Wallack (screenplay); Lily Collins, Julia Roberts, Armie Hammer, Nathan Lane, Robert Emms, Mare Winningham, Michael Lerner, Mark Povinelli, Jordan Prentice, Danny Woodburn, Sebastian Saraceno, Ronald Lee Clark, Martin Klebba, Joey Gnoffo, Sean Bean Comedy, Fantasy, Adventure Live action Wrath of the Titans Warner Bros. Jonathan Liebesman (director); Dan Mazeau, David Leslie Johnson (screenplay); Sam Worthington, Liam Neeson, Ralph Fiennes, Edgar Ramirez, Rosamund Pike, Danny Huston, Bill Nighy, Toby Kebbell Action, Adventure, Fantasy Live action L Bully The Weinstein Company Lee Hirsch (director) Cynthia Lowen Lee Hirsch (producer) Documentary Live action ===April – June=== ₪ - Films that achieved wide-release status after initial release Opening Title Studio Cast and crew Genre Medium Ref. A P R I L 4 R Titanic 3D Paramount Pictures / 20th Century Fox James Cameron (director/screenplay); Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Francis Fisher, Gloria Stuart, Bill Paxton, Bernard Hill, David Warner, Victor Garber, Jonathan Hyde, Eric Braeden, Bernard Fox, Suzy Amis Adventure, Drama Live action 6 W American Reunion Universal Pictures Jon Hurwitz, Hayden Schlossberg (directors/screenplay); Alyson Hannigan, Seann William Scott, Tara Reid, Jason Biggs, Eugene Levy, Thomas Ian Nicholas, Chris Klein, Mena Suvari, Jennifer Coolidge, Natasha Lyonne, Eddie Kaye Thomas, Shannon Elizabeth Comedy Live action L Damsels in Distress Sony Pictures Classics Whit Stillman (director/screenplay); Greta Gerwig, Adam Brody, Analeigh Tipton, Megalyn Echikunwoke, Carrie MacLemore, Hugo Becker, Billy Magnussen, Ryan Metcalf, Jermaine Crawford, Aubrey Plaza Dramedy Live action 13 W The Cabin in the Woods Lionsgate Drew Goddard (director/screenplay); Joss Whedon (screenplay); Richard Jenkins, Bradley Whitford, Jesse Williams, Chris Hemsworth, Kristen Connolly, Anna Hutchison, Fran Kranz Horror Live action Lockout Open Road Films / FilmDistrict James Mather, Stephen St.Leger (director/screenplay); Guy Pearce, Maggie Grace, Peter Stormare, Lennie James, Vincent Regan, Tim Plester, Anne-Solenne Hatte, Yan Dron, Patrick Cauderlier, Milorad Kapor, Bojan Peric, Mark Tankersley Action, Sci-Fi, Thriller Live action The Three Stooges 20th Century Fox Bobby Farrelly, Peter Farrelly (directors/screenplay); Mike Cerrone (screenplay); Chris Diamantopoulos, Will Sasso, Sean Hayes, Jane Lynch, Larry David, Stephen Collins, Sofía Vergara, Jennifer Hudson Comedy Live action 20 W Chimpanzee Disneynature Alastair Fothergill, Mark Linfield (directors); Tim Allen (narrator) Nature documentary Live action The Lucky One Warner Bros. Scott Hicks (director); Will Fetters (screenplay); Zac Efron, Taylor Schilling, Jay R. Ferguson, Riley Thomas Stewart, Adam Lefevre, Blythe Danner Drama, Romance Live action Think Like a Man Screen Gems Tim Story (director); Keith Merryman, David A. Newman (screenplay); Kevin Hart, Michael Ealy, Taraji P. Henson, Jerry Ferrara, Meagan Good, Regina Hall, Terrence J, Jenifer Lewis, Romany Malco, Gary Owen, Gabrielle Union Comedy, Romance Live action 27 W The Five-Year Engagement Universal Pictures Nicholas Stoller (director/screenplay); Jason Segel (screenplay); Jason Segel, Emily Blunt, Chris Pratt, Alison Brie, Rhys Ifans Comedy Live action The Pirates! Band of Misfits Columbia Pictures / Aardman Animations / Sony Pictures Animation Peter Lord, Jeff Newitt (directors); Gideon Defoe (screenplay); Hugh Grant, Salma Hayek, Jeremy Piven, Imelda Staunton, David Tennant Family Animation The Raven Relativity Media James McTeigue (director); Ben Livingston, Hannah Shakespeare (screenplay); John Cusack, Alice Eve, Luke Evans, Brendan Gleeson, Oliver Jackson-Cohen Thriller Live action Safe Lionsgate Boaz Yakin (director/screenplay); Jason Statham, Catherine Chan, Chris Sarandon, Anson Mount, Robert John Burke Action Live action L Bernie Millennium Entertainment Richard Linklater (director/screenplay); Skip Hollandsworth (screenplay); Jack Black, Shirley MacLaine, Matthew McConaughey, Rip Torn Comedy, Drama Live action M A Y 4 W The Avengers Marvel Studios / Walt Disney Pictures Joss Whedon (director/screenplay); Robert Downey, Jr., Chris Evans, Chris Hemsworth, Mark Ruffalo, Jeremy Renner, Scarlett Johansson, Tom Hiddleston, Samuel L. Jackson, Stellan Skarsgård, Cobie Smulders, Clark Gregg Action, Adventure Live action L A Little Bit of Heaven Millennium Entertainment Nicole Kassell (director); Gren Wells (screenplay); Kate Hudson, Gael Garcia Bernal, Peter Dinklage, Kathy Bates, Steve Weber, Whoopi Goldberg Comedy, Drama, Romance Live action The Best Exotic Marigold Hotel Fox Searchlight Pictures John Madden (director); Ol Parker (screenplay); Judi Dench, Bill Nighy, Dev Patel, Tom Wilkinson, Maggie Smith, Penelope Wilton, Ronald Pickup, Celia Imrie Comedy, Drama Live action 11 W Dark Shadows Warner Bros. Tim Burton (director); Seth Grahame-Smith (screenplay); Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley, Bella Heathcote, Chloe Grace Moretz, Jonny Lee Miller, Gulliver McGrath Gothic Comedy Live action L Girl in Progress Pantelion Films Patricia Riggen (director/screenplay); Eva Mendes, Matthew Modine, Cierra Ramirez, Patricia Arquette, Eugenio Derbez Comedy/Drama Live action Under African Skies A&E; IndieFilms Joe Berlinger (director); Paul Simon, Quincy Jones, Harry Belafonte, Paul McCartney, David Byrne, Peter Gabriel Documentary Live action 16 W The Dictator Paramount Pictures Larry Charles (director); Sacha Baron Cohen, Alec Berg, Jeff Schaffer, David Mandel (screenplay); Sacha Baron Cohen, Ben Kingsley, Anna Faris, Megan Fox, John C. Reilly, J.B. Smoove Comedy Live action 18 W Battleship Universal Pictures Peter Berg (director); Jon Hoeber, Erich Hoeber (screenplay); Alexander Skarsgård, Taylor Kitsch, Brooklyn Decker, Rihanna, Liam Neeson, Asano Tadanobu Action, Adventure Live action What to Expect When You're Expecting Lionsgate Kirk Jones (director); Heather Hach, Shauna Cross (screenplay); Cameron Diaz, Jennifer Lopez, Brooklyn Decker, Elizabeth Banks, Anna Kendrick, Chace Crawford, Matthew Morrison, Dennis Quaid, Chris Rock, Rodrigo Santoro, Ben Falcone, Joe Manganiello, Thomas Lennon Comedy, Romance Live action 24 W Chernobyl Diaries Warner Bros. Bradley Parker (director); Oren Peli, Carey Van Dyke, Steve Van Dyke (screenplay); Jonathan Sadowski, Devin Kelley, Jesse McCartney, Olivia Taylor Dudley, Nathan Phillips, Ingrid Bolso Berdal, Dmitri Diatchenko Horror, Thriller Live action 25 W Men in Black 3 Columbia Pictures Barry Sonnenfeld (director); Etan Cohen, David Koepp, Jeff Nathanson, Michael Soccio (screenplay); Will Smith, Tommy Lee Jones, Josh Brolin, Jemaine Clement, Emma Thompson, Alice Eve, Michael Stuhlbarg, Nicole Scherzinger, David Rasche Action, Comedy, Sci-Fi Live action L The Intouchables Gaumont Film Company Olivier Nakache, Éric Toledano (director/screenplay); François Cluzet, Omar Sy, Anne Le Ny, Audrey Fleurot, Clotilde Mollet, Alba Gaia Bellugi, Cyril Mendy, Christian Ameri Comedy, Drama, Romance Live action Moonrise Kingdom Focus Features Wes Anderson (director/screenplay); Roman Coppola (screenplay); Jared Gilman, Kara Hayward, Bruce Willis, Edward Norton, Bill Murray, Frances McDormand, Jason Schwartzman, Tilda Swinton Comedy, Romance Live action J U N E 1 W Snow White & the Huntsman Universal Pictures Rupert Sanders (director); Evan Daugherty, Evan Spiliotopoulos, Hossein Amini, John Lee Hancock, Jez Butterworth (screenplay); Kristen Stewart, Charlize Theron, Sam Claflin, Chris Hemsworth, Ian McShane, Bob Hoskins, Eddie Izzard, Toby Jones, Eddie Marsan, Stephen Graham, Ray Winstone, Lily Cole, Sam Spruell, Liberty Ross, Noah Huntley, Nick Frost Action, Adventure, Fantasy Live action L Piranha 3DD Dimension Films John Gulager (director); Patrick Melton, Marcus Dunstan (screenplay); Danielle Panabaker, Matt Bush, Chris Zylka, David Koechner, Meagan Tandy, Paul James Jordan, Jean-Luc Bilodeau, Hector Jimenez, Adrian Martinez, Clu Gulager, Gary Busey, Katrina Bowden, Christopher Lloyd, Ving Rhames, Paul Scheer, David Hasselhoff Comedy, Horror, Thriller Live action 8 W Madagascar 3: Europe's Most Wanted Paramount Pictures / DreamWorks Animation Eric Darnell, Tom McGrath, Conrad Vernon (directors); Eric Darnell, Noah Baumbach (screenplay); Ben Stiller, Chris Rock, David Schwimmer, Jada Pinkett Smith, Frances McDormand, Sacha Baron Cohen, Cedric the Entertainer, Andy Richter, Bryan Cranston, Jessica Chastain, Martin Short, Paz Vega Comedy, Family Animation Prometheus 20th Century Fox Ridley Scott (director/screenplay); Damon Lindelof, John Spaihts (screenplay); Noomi Rapace, Michael Fassbender, Guy Pearce, Charlize Theron, Idris Elba, Logan Marshall-Green Sci-Fi Live action L Safety Not Guaranteed FilmDistrict Colin Trevorrow (director/screenplay); Derek Connolly (screenplay); Aubrey Plaza, Mark Duplass, Jake Johnson, Kristen Bell, Jenica Bergere, Jeff Garlin, Karan Soni, Lynn Shelton, Mary Lynn Rajskub Comedy Live action Peace, Love, & Misunderstanding IFC Films Bruce Beresford (director); Christina Mengert & Joe Muszynski (screenplay); Jane Fonda, Catherine Keener, Elizabeth Olsen, Jeffrey Dean Morgan, Chace Crawford, Nat Wolff, Kyle MacLachlan, Rosanna Arquette Dramedy Live action 15 W Rock of Ages Warner Bros. / New Line Cinema Adam Shankman (director); Justin Theroux, Allan Loeb, Chris D'Arienzo (screenplay); Tom Cruise, Julianne Hough, Diego Boneta, Alec Baldwin, Russell Brand, Paul Giamatti, Catherine Zeta-Jones, Mary J. Blige, Malin Akerman Rock Musical Live action That's My Boy Columbia Pictures Sean Anders (director); David H. Caspe (screenplay); Adam Sandler, Andy Samberg, Leighton Meester, Eva Amurri, Susan Sarandon, James Caan, Milo Ventimiglia, Will Forte, Colin Quinn, Todd Bridges, Vanilla Ice, Ian Ziering Comedy Live action 22 W Abraham Lincoln: Vampire Hunter 20th Century Fox Timur Bekmambetov (director); Seth Grahame-Smith (screenplay); Benjamin Walker, Dominic Cooper, Anthony Mackie, Mary Elizabeth Winstead, Alan Tudyk, Jimmi Simpson, Robin McLeavy, Rufus Sewell Action, Horror, Supernatural Thriller Live action Brave Walt Disney Pictures / Pixar Animation Studios Mark Andrews, Brenda Chapman, Steve Purcell (directors); Mark Andrews, Steve Purcell, Brenda Chapman, Irene Mecchi (screenplay); Kelly Macdonald, Julie Walters, Billy Connolly, Emma Thompson, Kevin McKidd, Craig Ferguson, Robbie Coltrane, John Ratzenberger Adventure, Comedy Animation Seeking a Friend for the End of the World Focus Features Lorene Scafaria (director/screenplay); Steve Carell, Keira Knightley, Connie Britton, Adam Brody, Rob Corddry, Gillian Jacobs, Derek Luke, Melanie Lynskey, T.J. Miller, Mark Moses, Patton Oswalt, William Petersen Comedy Live action L To Rome with Love Sony Pictures Classics Woody Allen (director/screenplay); Woody Allen, Alec Baldwin, Roberto Benigni, Penelope Cruz, Jesse Eisenberg, Greta Gerwig, Ellen Page Comedy, Romance Live action 29 W Madea's Witness Protection Lionsgate Tyler Perry (director/screenplay); Tyler Perry, Eugene Levy, Doris Roberts, Tom Arnold, Denise Richards, Danielle Campbell, Devan Leos, Romeo Miller, John Amos, Marla Gibbs Comedy Live action Magic Mike Warner Bros. Steven Soderbergh (director); Reid Carolin (screenplay); Channing Tatum, Alex Pettyfer, Matthew McConaughey, Matt Bomer, Riley Keough, Cody Horn, Joe Manganiello, Olivia Munn, Adam Rodriguez, Kevin Nash, Gabriel Iglesias Comedy Live action People Like Us Touchstone Pictures / DreamWorks Pictures Alex Kurtzman (director/screenplay); Roberto Orci, Jody Lambert (screenplay); Chris Pine, Elizabeth Banks, Michelle Pfeiffer, Olivia Wilde, Mark Duplass, Jon Favreau, Michael Hall D'Addario, Philip Baker Hall Drama Live action Ted Universal Pictures Seth MacFarlane (director/screenplay); Alec Sulkin, Wellesley Wild (screenplay); Mark Wahlberg, Mila Kunis, Seth MacFarlane, Giovanni Ribisi, Joel McHale, Patrick Warburton, Jessica Stroup, Laura Vandervoort Comedy Live action / Animation ===July – September=== ‡ Films that achieved wide-release status after initial release Opening Title Studio Cast and crew Genre Medium Ref. J U L Y 3 The Amazing Spider-Man Columbia Pictures / Marvel Studios Marc Webb (director); James Vanderbilt (screenplay); Andrew Garfield, Emma Stone, Rhys Ifans, Martin Sheen, Sally Field, Denis Leary, Irrfan Khan, Campbell Scott Action, Adventure Live action 5 Katy Perry: Part of Me 3D Paramount Pictures / Insurge Pictures / MTV Films Dan Cutforth, Jane Lipsetz (directors); Katy Perry Documentary, Music Live action 6 Savages Universal Pictures Oliver Stone (director/screenplay); Don Winslow, Shane Salerno (screenplay); Taylor Kitsch, Aaron Johnson, Blake Lively, Salma Hayek, Benicio del Toro, John Travolta, Uma Thurman, Emile Hirsch, Demian Bichir Crime, Thriller Live action 13 Ice Age: Continental Drift 20th Century Fox / Blue Sky Studios Steve Martino, Mike Thurmeier (directors); Ray Romano, John Leguizamo, Denis Leary, Queen Latifah, Seann William Scott, Josh Peck, J.B. Smoove, Jennifer Lopez, Wanda Sykes, Peter Dinklage, Aziz Ansari, Keke Palmer, Drake, Heather Morris, Joy Behar, Nicki Minaj, Josh Gad, Alan Tudyk, Nick Frost, Kunal Nayyar, Alain Chabat Adventure, Comedy, Family Animation Red Lights Millennium Entertainment Rodrigo Cortes (director/screenplay); Cillian Murphy, Robert De Niro, Sigourney Weaver, Elizabeth Olsen, Toby Jones Thriller Live action 20 The Dark Knight Rises Warner Bros. Christopher Nolan (director/screenplay); Emma Thomas (producer); Jonathan Nolan (screenplay); Christian Bale, Michael Caine, Tom Hardy, Anne Hathaway, Joseph Gordon-Levitt, Marion Cotillard, Gary Oldman, Morgan Freeman, Matthew Modine, Cillian Murphy, Nestor Carbonell, Liam Neeson, Alon Abutbul Action, Thriller Live action 27 Step Up Revolution Summit Entertainment Scott Speer (director); Jenny Mayer (screenplay); Kathryn McCormick, Ryan Guzman, Misha Gabriel, Peter Gallagher Musical Live action The Watch 20th Century Fox Akiva Schaffer (director); Jared Stern, Seth Rogen, Evan Goldberg (screenplay); Ben Stiller, Vince Vaughn, Rosemarie DeWitt, Jonah Hill, Richard Ayoade, Will Forte, Billy Crudup Comedy, Sci-Fi Live action A U G U S T 3 Diary of a Wimpy Kid: Dog Days 20th Century Fox David Bowers (director); Zachary Gordon, Robert Capron, Rachael Harris, Devon Bostick, Steve Zahn Comedy, Family Live action The Bourne Legacy Universal Pictures Tony Gilroy (director/screenplay); Dan Gilroy (screenplay); Jeremy Renner, Rachel Weisz, Edward Norton, Oscar Isaac, Joan Allen, Albert Finney, Stacy Keach, Scott Glenn Action, Thriller Live action Total Recall Columbia Pictures Len Wiseman (director); Kurt Wimmer, Mark Bomback (screenplay); Colin Farrell, Jessica Biel, Bryan Cranston, Kate Beckinsale, Bill Nighy, John Cho Action, Sci-Fi Live action 10 2 Days in New York Magnolia Pictures Julie Delpy (director/screenplay); Alexia Landeau, Alexandre Nahon (screenplay); Julie Delpy, Chris Rock, Albert Delpy, Alexia Landeau, Alex Nahon Comedy, Romance Live action The Campaign Warner Bros. Jay Roach (director); Chris Henchy, Shawn Harwell (screenplay); Will Ferrell, Zach Galifianakis, Jason Sudeikis, Katherine LaNasa, Dylan McDermott, John Lithgow, Dan Aykroyd, Brian Cox Comedy Live action Hope Springs Columbia Pictures David Frankel (director); Vanessa Taylor (screenplay); Meryl Streep, Tommy Lee Jones, Steve Carell Comedy Live action 15 The Odd Life of Timothy Green Walt Disney Pictures Peter Hedges (director/screenplay); Jennifer Garner, Joel Edgerton, C.J. Adams, Ron Livingston, Dianne Wiest, Odeya Rush, Rosemarie DeWitt, Lin-Manuel Miranda, M. Emmet Walsh, Lois Smith, Common Dramedy Live action 17 The Expendables 2 Lionsgate Simon West (director), Sylvester Stallone (screenplay); Sylvester Stallone, Jason Statham, Jet Li, Dolph Lundgren, Randy Couture, Terry Crews, Bruce Willis, Arnold Schwarzenegger, Chuck Norris, Jean-Claude Van Damme, Liam Hemsworth Action Live action ParaNorman Focus Features Chris Butler (director/screenplay); Sam Fell (director); Casey Affleck, Tempestt Bledsoe, John Goodman, Bernard Hill, Anna Kendrick, Leslie Mann, Christopher Mintz- Plasse, Jodelle Ferland, Elaine Stritch, Kodi Smit-McPhee, Alex Borstein Comedy, Thriller, Adventure Animation Sparkle TriStar Pictures Salim Akil (director); Mara Brock Akil (screenplay); Jordin Sparks, Whitney Houston, Derek Luke, Mike Epps, Carmen Ejogo, Tika Sumpter, Omari Hardwick, Cee Lo Green Drama, Musical Live action 24 The Apparition Warner Bros. Todd Lincoln (director/screenplay); Carl Ellsworth (screenplay); Ashley Greene, Sebastian Stan, Tom Felton, Julianna Guill, Luke Pasqualino, Suzanne Ford Horror, Supernatural Thriller Live action Hit and Run Open Road Films Dax Shepard (director/screenplay); David Palmer (director); Kristen Bell, Bradley Cooper, Tom Arnold, Beau Bridges, Kristin Chenoweth, David Koechner, Michael Rosenbaum, Joy Bryant, Ryan Hansen Action, Comedy, Romance Live action Premium Rush Columbia Pictures David Koepp (director/screenplay); John Kamps (screenplay); Joseph Gordon-Levitt, Michael Shannon, Dania Ramirez, Jamie Chung Action Live action 31 For A Good Time, Call... Focus Features Jamie Travis (director); Katie Anne Naylon, Lauren Anne Miller (screenplay); Ari Graynor, Seth Rogen, Lauren Anne Miller, Justin Long, Mark Webber, James Wolk Comedy Live action Lawless The Weinstein Company John Hillcoat (director); Nick Cave (screenplay); Shia LaBeouf, Tom Hardy, Jason Clarke, Guy Pearce, Gary Oldman, Mia Wasikowska, Jessica Chastain, Dane DeHaan Drama Live action The Possession Lionsgate Ole Bornedal (director); Juliet Snowden, Stiles White (screenplay); Jeffrey Dean Morgan, Kyra Sedgwick Horror Live action The Tall Man Image Entertainment Pascal Laugier (director/screenplay); Jessica Biel, Jodelle Ferland, Stephen McHattie, William B. Davis, Samantha Ferris Suspense thriller Live action S E P T E M B E R 7 The Cold Light of Day Summit Entertainment Mabrouk El Mechri (director); John Petro, Scott Wiper (screenplay); Henry Cavill, Bruce Willis, Sigourney Weaver, Veronica Echegui Action Live action Gangster Squad Warner Bros. Ruben Fleischer (director); Will Beall (screenplay); Ryan Gosling, Emma Stone, Sean Penn, Josh Brolin, Robert Patrick, Michael Pena, Giovanni Ribisi, Anthony Mackie, Nick Nolte Drama Live action 14 Finding Nemo 3D Walt Disney Pictures / Pixar Animation Studios Andrew Stanton, Lee Unkrich (directors); Andrew Stanton, Bob Peterson, David Reynolds (screenplay); Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, Brad Garrett, Allison Janney, Austin Pendleton, Vicki Lewis, Stephen Root, Geoffrey Rush, Elizabeth Perkins, Barry Humphries, Eric Bana Family Animation The Perks of Being a Wallflower Summit Entertainment Stephen Chbosky (director/screenplay); Emma Watson, Logan Lerman, Mae Whitman, Nina Dobrev, Johnny Simmons, Dylan McDermott Drama Live action Resident Evil: Retribution Screen Gems Paul W. S. Anderson (director/screenplay); Milla Jovovich, Sienna Guillory, Colin Salmon, Boris Kodjoe, Michelle Rodriguez, Shawn Roberts, Johann Urb, Kevin Durand, Li Bingbing Action, Adventure, Fantasy, Sci-Fi Live action 21 Dredd Lionsgate Pete Travis (director); Alex Garland (screenplay); Karl Urban, Olivia Thirlby, Lena Headey Action, Adventure, Sci-Fi Live action House at the End of the Street Relativity Media Mark Tonderai (director); David Loucka (screenplay); Jennifer Lawrence, Elizabeth Shue, Max Thieriot, Gil Bellows Horror, Thriller Live action Killing Them Softly The Weinstein Company Andrew Dominik (director/screenplay); Brad Pitt, James Gandolfini, Sam Rockwell, Richard Jenkins, Ray Liotta, Vincent Curatola, Bella Heathcote, Scoot McNairy, Ben Mendelsohn, Linara Washington Crime, Comedy Live action The Words CBS Films Brian Klugman, Lee Sternthal (directors/screenplay); Bradley Cooper, Jeremy Irons, Zoe Saldana, Dennis Quaid, Olivia Wilde, Ben Barnes, John Hannah, Nora Arnezeder, J.K. Simmons Drama, Thriller Live action 28 End of Watch Open Road Films David Ayer (director/screenplay); Jake Gyllenhaal, Michael Pena, Anna Kendrick, Frank Grillo, America Ferrera Crime Live-action Hotel Transylvania Columbia Pictures / Sony Pictures Animation Genndy Tartakovsky (director); Don Rhymer (screenplay); Adam Sandler, Selena Gomez, Andy Samberg, David Koechner, Kevin James, Fran Drescher, David Spade, Steve Buscemi, Molly Shannon, Cee Lo Green Comedy, Family Animation Looper (film) TriStar Pictures / FilmDistrict Rian Johnson (director/screenplay); Joseph Gordon-Levitt, Bruce Willis, Emily Blunt, Paul Dano, Noah Segan, Jeff Daniels, Piper Perabo Action, Thriller Live action Trouble with the Curve Warner Bros. Robert Lorenz (director); Randy Brown (screenplay); Clint Eastwood, Amy Adams, Matthew Lillard, Justin Timberlake, John Goodman Drama, Sports Live action Won't Back Down 20th Century Fox Daniel Barnz (director/screenplay); Brin Hill (screenplay); Viola Davis, Maggie Gyllenhaal, Holly Hunter, Ving Rhames, Rosie Perez Drama Live action ===October – December=== ‡ Films that achieved wide-release status after initial release Opening Title Studio Cast and crew Genre Medium Ref. O C T O B E R 5 Butter The Weinstein Company Jim Field Smith (director); Jason Micallef (screenplay); Jennifer Garner, Hugh Jackman, Alicia Silverstone, Ty Burrell, Yara Shahidi, Ashley Greene, Olivia Wilde Comedy Live action Frankenweenie Walt Disney Pictures Tim Burton (director); John August (screenplay); Winona Ryder, Martin Landau, Martin Short, Catherine O'Hara, Charlie Tahan, Atticus Shaffer, Robert Capron, Conchata Ferrell Comedy, Horror Animation Pitch Perfect Universal Pictures Jason Moore (director); Kay Cannon (screenplay); Anna Kendrick, Rebel Wilson, Adam DeVine, Alexis Knapp, Brittany Snow Comedy Live action Sinister Summit Entertainment Scott Derrickson (director/screenplay); C. Robert Cargill AKA Carlyle from Spill.com (screenplay); Ethan Hawke, Vincent D'Onofrio, James Ransone, Fred Dalton Thompson, Nicholas King, Clare Foley, Victoria Leigh, Juliet Rylance, Michael Hall D'Addario Crime, Horror Live action Taken 2 20th Century Fox Olivier Megaton (director); Luc Besson, Robert Mark Kamen (screenplay); Liam Neeson, Famke Janssen, Maggie Grace, Rade Sherbedgia, Luke Grimes Action Live action 12 Argo Warner Bros. Ben Affleck (director); Chris Terrio (screenplay); Ben Affleck, Alan Arkin, Bryan Cranston, John Goodman, Kerry Bishe, Kyle Chandler, Rory Cochrane, Christopher Denham, Tate Donovan, Clea DuVall, Victor Garber, Zeljko Ivanek, Richard Kind, Scoot McNairy, Chris Messina, Michael Parks, Taylor Schilling Political, Thriller Live action Gambit CBS Films Michael Hoffman (director); Joel Coen, Ethan Coen (screenplay); Colin Firth, Cameron Diaz, Alan Rickman, Sir Tom Courtenay, Stanley Tucci, Cloris Leachman Comedy, Crime Live action Here Comes the Boom Columbia Pictures Frank Coraci (director); Allan Loeb, Kevin James (screenplay); Kevin James, Salma Hayek, Henry Winkler, Charice Action, Comedy Live action The Master The Weinstein Company Paul Thomas Anderson (director/screenplay); Philip Seymour Hoffman, Joaquin Phoenix, Jesse Plemons, David Warshofsky, Amy Adams, Rami Malek Drama Live action 19 The Big Wedding Lionsgate Justin Zackham (director/screenplay); Amanda Seyfried, Robert De Niro, Katherine Heigl, Robin Williams, Topher Grace, Susan Sarandon, Ben Barnes, Diane Keaton Comedy, Romance Live action Paranormal Activity 4 Paramount Pictures Zack Estrin (screenplay) Supernatural Horror Live action Untitled David Chase Film Paramount Vantage David Chase (director/screenplay); Brad Garrett, James Gandolfini, Bella Heathcote, Christopher MacDonald, Molly Price, Lisa Lampanelli, John Magaro, Jack Huston, Will Brill Drama, Musical Live action 26 Alex Cross Summit Entertainment Rob Cohen (director); James Patterson, Kerry Williamson, Marc Moss (screenplay); Tyler Perry, Matthew Fox, Rachel Nichols, Edward Burns, Jean Reno Crime Live action Fun Size Paramount Pictures / MTV Films Josh Schwartz (director); Max Werner (screenplay); Victoria Justice, Thomas Mann, Thomas McDonell, Thomas Middleditch, Chelsea Handler Comedy Live action Of Men and Mavericks 20th Century Fox Curtis Hanson (director); Gerard Butler, Leven Rambin, Jonny Weston, Elisabeth Shue, Abigail Spencer, Taylor Handley Biography, Drama, Sports Live action Silent Hill: Revelation 3D Open Road Films Michael J. Bassett (director/screenplay); Adelaide Clemens, Kit Harington, Radha Mitchell, Sean Bean, Deborah Kara Unger, Carrie-Anne Moss, Malcolm McDowell Horror Live Action N O V E M B E R 2 21 and Over Relativity Media Jon Lucas, Scott Moore (director/screenplay); Miles Teller, Justin Chon, Skylar Astin, Sarah Wright, Francois Chau, Jonathan Keltz, Daniel Booko, Dustin Ybarra Comedy Live action Flight Paramount Pictures / Lionsgate Robert Zemeckis (director); John Gatins (screenplay); Denzel Washington, Kelly Reilly, Don Cheadle, Bruce Greenwood, Brian Geraghty, John Goodman, Tamara Tunie Drama Live action Seven Psychopaths CBS Films Martin McDonagh (director/screenplay); Colin Farrell, Woody Harrelson, Olga Kurylenko, Sam Rockwell, Christopher Walken, Tom Waits Dark comedy Live action Wreck-It Ralph Walt Disney Pictures / Walt Disney Animation Studios Rich Moore (director); John C. Reilly, Sarah Silverman, Jack McBrayer, Jane Lynch Comedy Animation 9 Skyfall Columbia Pictures / MGM Sam Mendes (director); Neal Purvis, Robert Wade, John Logan (screenplay); Daniel Craig, Judi Dench, Ralph Fiennes, Naomie Harris, Javier Bardem, Bérénice Marlohe, Albert Finney, Ben Whishaw, Helen McCrory, Ola Rapace, Tonia Sotiropoulou Action, Adventure Live action 16 The Twilight Saga: Breaking Dawn – Part 2 Summit Entertainment Bill Condon (director); Melissa Rosenberg (screenplay); Kristen Stewart, Robert Pattinson, Taylor Lautner, Peter Facinelli, Ashley Greene, Kellan Lutz, Jackson Rathbone, Elizabeth Reaser, Nikki Reed, Billy Burke, Rami Malek, Maggie Grace, Mackenzie Foy, Tracey Higgins, Judi Shekoni, Omar Metwally, Andrea Gabriel, Angela Sarafyan, Marlane Barnes, Lisa Howard, Patrick Brennan, Noel Fisher, Guri Weinberg, Lee Pace, Toni Trucks, Bill Tangradi, Erik Odom, Valorie Curry, Joe Anderson, Olga Fonda, Janelle Froehlich, Masami Kosaka, Sebastio Lemos, Amadou Ly, Ty Olsson, Wendell Pierce, Carolina Virguez Romance, Thriller, Drama Live action 21 Life of Pi 20th Century Fox Ang Lee (director); David Magee (screenplay); Tobey Maguire, Suraj Sharma, Irrfan Khan, Adil Hussain, Gérard Depardieu Drama Live action Red Dawn Open Road Films / FilmDistrict Dan Bradley (director); Carl Ellsworth, Jeremy Passmore, Vincent Newman, Tony Gilroy (screenplay); Chris Hemsworth, Josh Peck, Josh Hutcherson, Adrianne Palicki, Isabel Lucas, Connor Cruise, Jeffrey Dean Morgan Action, Drama, War Live action Rise of the Guardians Paramount Pictures / DreamWorks Animation Peter Ramsey, William Joyce (directors); David Lindsay- Abaire (screenplay); Chris Pine, Isla Fisher, Hugh Jackman, Alec Baldwin, Jude Law, Dakota Goyo Action, Adventure, Family Animation The Silver Linings Playbook The Weinstein Company David O. Russell (director/screenplay); Bradley Cooper, Jennifer Lawrence, Robert De Niro, Julia Stiles, Chris Tucker, Jacki Weaver, Shea Whigham Comedy Live action D E C E M B E R 7 Hyde Park on Hudson Focus Features Roger Mitchell (director); Richard Nelson (screenplay); Bill Murray, Laura Linney, Olivia Williams, Samuel West, Olivia Colman, Elizabeth Wilson, Elizabeth Marvel, Eleanor Bron Biography, Crime Live action 14 Les Misérables Universal Pictures Tom Hooper (director); William Nicholson, Alain Boublil, Claude-Michel Schonberg (screenplay); Hugh Jackman, Russell Crowe, Anne Hathaway, Eddie Redmayne, Amanda Seyfried, Helena Bonham Carter, Sacha Baron Cohen, Aaron Tveit, Samantha Barks Drama, Epic Musical Live action The Hobbit: An Unexpected Journey Warner Bros. / New Line Cinema / MGM Peter Jackson (director/screenplay); Fran Walsh, Philippa Boyens, Guillermo del Toro (screenplay); Martin Freeman, Ian McKellen, Richard Armitage, Graham McTavish, Ken Stott, Aidan Turner, Dean O'Gorman, Mark Hadlow, Jed Brophy, Adam Brown, John Callen, Peter Hambleton, William Kircher, James Nesbitt, Stephen Hunter, Benedict Cumberbatch, Andy Serkis, Hugo Weaving, Barry Humphries, Mikael Persbrandt, Lee Pace, Stephen Fry, Luke Evans, Cate Blanchett, Christopher Lee, Sylvester McCoy, Elijah Wood, Ian Holm, Orlando Bloom, Evangeline Lilly, Ryan Gage, Mike Mizrahi, Jeffrey Thomas, Conan Stevens, Bret McKenzie, Billy Connolly Adventure, Fantasy Live action 19 Untitled Kathryn Bigelow Osama bin Laden Film Columbia Pictures Kathryn Bigelow (director); Mark Boal (screenplay); Joel Edgerton, Jessica Chastain, Édgar Ramírez, Mark Strong, Kyle Chandler, Nash Edgerton, Jennifer Ehle, Harold Perrineau Action Live action 21 Cirque du Soleil Worlds Away Paramount Pictures / Insurge Pictures / The Weinstein Company Andrew Adamson (director/screenplay) Adventure, Family Live action One Shot Paramount Pictures / Warner Bros. Christopher McQuarrie (director/screenplay); Josh Olson (screenplay); Tom Cruise, Rosamund Pike, David Oyelowo, Richard Jenkins, Alexia Fast, Robert Duvall, Jai Courtney, Werner Herzog Action Live action This Is 40 Universal Pictures Judd Apatow (director/screenplay); Leslie Mann, Paul Rudd, Megan Fox, Albert Brooks, John Lithgow, Iris Apatow, Maude Apatow, Melissa McCarthy, Robert Smigel, Charlene Yi Comedy Live action 25 Django Unchained Columbia Pictures / The Weinstein Company Quentin Tarantino (director/screenplay); Leonardo DiCaprio, Jamie Foxx, Christoph Waltz, Samuel L. Jackson, Dennis Christopher, Gerald McRaney, Laura Cayouette, M.C. Gainey, Don Johnson, Kerry Washington, Anthony LaPaglia, RZA, Tom Wopat, James Remar, James Russo, Todd Allen Action, Western Live action The Guilt Trip Paramount Pictures / 20th Century Fox Anne Fletcher (director); Dan Fogelman (screenplay); Barbra Streisand, Seth Rogen, Adam Scott, Colin Hanks Comedy Live action Parental Guidance 20th Century Fox Andy Fickman (director); Joe Syracuse, Lisa Addario, Lowell Ganz, Babaloo Mandel (screenplay); Billy Crystal, Bette Midler, Marisa Tomei, Bailee Madison Comedy Live action Playing the Field Open Road Films / FilmDistrict Gabriele Muccino (director); Robbie Fox (screenplay); Gerard Butler, Uma Thurman, Jessica Biel, Dennis Quaid, Noah Lomax, James Tupper Drama, Sports Live action The Great Gatsby Warner Bros. Baz Luhrmann (director/screenplay); Craig Pearce (screenplay); Leonardo DiCaprio, Tobey Maguire, Joel Edgerton, Carey Mulligan, Isla Fisher, Jason Clarke, Elizabeth Debicki, Amitabh Bachchan, Callan McAuliffe Drama Live action ==Notable deaths== Month Date Name Age Nationality Profession Notable films January 1 Bob Anderson 89 English Stuntman, Swordmaster Star Wars • The Lord of the Rings: The Fellowship of the Ring • Pirates of the Caribbean: The Curse of the Black Pearl • The Princess Bride • Barry Lyndon • Highlander • Die Another Day • First Knight • The Mask of Zorro • The Phantom 2 Silvana Gallardo 58 American Actress Windwalker • Death Wish II • Solar Crisis • Out of the Dark 3 Joaquín Martínez 81 Mexican-American Actor Jeremiah Johnson • Ulzana's Raid • Revenge • The House of the Spirits • Die Another Day • The Odd Couple II • House of Cards • Who'll Stop the Rain • He Is My Brother 4 Harry Fowler 85 English Actor Went the Day Well? • Hue and Cry • Fire Maidens from Outer Space • I Was Monty's Double • The Nanny • Chicago Joe and the Showgirl 5 Frederica Sagor Maas 111 American Screenwriter The Plastic Age • Dance Madness • The Waning Sex • Rolled Stockings • Red Hair • The Way of All Flesh 9 Mae Laborde 102 American Actress Pineapple Express • The Heartbreak Kid 10 Lila Kaye 82 English Actress An American Werewolf in London • Nuns on the Run • Julia Jekyll and Harriet Hyde 11 Richard Bruno 87 American Costume Designer Goodfellas • The Karate Kid • Raging Bull • Chinatown • The Color of Money • Under Siege • Eraser • The Untouchables • Species II 11 David Whitaker 80 English Composer Hammerhead • Run Wild, Run Free • Dr. Jekyll and Sister Hyde • Vampira • Dominique • The Sword and the Sorcerer • Shadow Run 13 Morgan Jones 83 American Actor Not of This Earth • Apache Woman • Forbidden Planet • Fear Strikes Out • Bells Are Ringing 20 Marion Mathie 73 English Actress Dracula Has Risen from the Grave • Lolita • An Honourable Murder 21 Eiko Ishioka 73 Japanese Costume Designer Bram Stoker's Dracula • Immortals • The Cell • Mirror Mirror • The Fall 24 James Farentino 82 American Actor Bulletproof • The Final Countdown • Ensign Pulver • The Last Producer • Banning 26 Ian Abercrombie 77 English Actor Army of Darkness • Rango • Young Frankenstein • Wild Wild West • MouseHunt • Star Wars: The Clone Wars • Addams Family Values 26 Dimitra Arliss 79 American Actress The Sting • The Other Side of Midnight • A Perfect Couple • Xanadu • Firefox • It's My Party • Bless the Child 30 Frederick Treves 86 English Actor Defence of the Realm • Sweeney 2 • The Elephant Man • Nighthawks • Sunshine February 3 Ben Gazzara 81 American Actor The Big Lebowski • Road House • 13 • The Killing of a Chinese Bookie • Summer of Sam • The Thomas Crown Affair • Opening Night • Voyage of the Damned • Dogville 5 Sam Coppola 79 American Actor Serpico • Saturday Night Fever • Fatal Attraction • Jacob's Ladder 5 Bill Hinzman 75 American Actor, Director Night of the Living Dead • River of Darkness • The Majorettes • Legion of the Night • Santa Claws • Evil Ambitions • Flesheater 6 Peter Breck 82 American Actor Shock Corridor • Benji • The Sword and the Sorcerer • Thunder Road 8 Laurie Main 89 Australian Actor The Strongest Man in the World • Herbie Goes to Monte Carlo • Freaky Friday • Winnie the Pooh and a Day for Eeyore • The Great Mouse Detective • Robin Hood: Men in Tights • The Phantom of the Opera 8 Phil Bruns 80 American Actor Flashdance • My Favorite Year • The Great Waldo Pepper • Ed • Inferno • A Thousand Clowns • Return of the Living Dead Part II • The Stunt Man • Nickelodeon • Corvette Summer • Love Bites 11 Whitney Houston 48 American Actress, Singer, Producer The Bodyguard • Waiting to Exhale • The Preacher's Wife • The Princess Diaries • The Princess Diaries 2: Royal Engagement • Sparkle 12 David Kelly 82 Irish Actor Charlie and the Chocolate Factory • Stardust • Waking Ned • Agent Cody Banks 2: Destination London • Laws of Attraction • The Italian Job 16 Dick Anthony Williams 77 American Actor Dog Day Afternoon • Edward Scissorhands • The Jerk • Summer Rental • The Deep 18 Ric Waite 78 American Cinematographer Red Dawn • Footloose • 48 Hrs. • Adventures in Babysitting • Cobra 20 Sullivan Walker 68 Trinidadian Actor The Firm • Crocodile Dundee • Get Rich or Die Tryin' • The Exterminator 23 Bruce Surtees 74 American Cinematographer Dirty Harry • Beverly Hills Cop • Risky Business • Lenny • Corrina, Corrina • Escape from Alcatraz • Pale Rider • Firefox • License to Drive 29 Davy Jones 66 English Actor, Singer The Brady Bunch Movie • Head • Treasure Island March 2 Leonardo Cimino 94 American Actor Dune • Moonstruck • Waterworld • Cradle Will Rock • The Freshman • Before the Devil Knows You're Dead • Hudson Hawk • The Seventh Sign 3 Ralph McQuarrie 82 American Designer, Illustrator Star Wars • Raiders of the Lost Ark • E.T. the Extra-Terrestrial • Jurassic Park • Cocoon 5 Robert B. Sherman 86 American Composer Summer Magic • Mary Poppins • The Happiest Millionaire • The Jungle Book • The Aristocats • Bedknobs and Broomsticks • The Many Adventures of Winnie the Pooh • Chitty Chitty Bang Bang • Snoopy, Come Home • Charlotte's Web • Little Nemo: Adventures in Slumberland • The Sword in the Stone • The Parent Trap • Tom Sawyer • The Slipper and the Rose • The Magic of Lassie 10 Jean Giraud 73 French Designer, Illustrator Alien • Tron • Masters of the Universe • The Fifth Element • Willow 27 Warren Stevens 92 American Actor Forbidden Planet • The Barefoot Contessa • Madigan • Hot Spell • The Frogmen 28 Neil Travis 73 American Film Editor Dances with Wolves • Patriot Games • Outbreak • Terminator 3: Rise of the Machines • Cocktail • Stepmom • Cujo 29 Luke Askew 80 American Actor Easy Rider • Cool Hand Luke • The Green Berets • The Great Northfield Minnesota Raid • Wanda Nevada • Frailty April 10 Grant Tilly 74 Australian Actor Race for the Yankee Zephyr • Nate and Hayes • Brilliant Lies 14 William Finley 71 American Actor The Black Dahlia • Sisters • Double Negative • Phantom of the Paradise 14 Jonathan Frid 87 Canadian Actor House of Dark Shadows • Seizure 14 Martin Poll 89 American Producer The Lion in Winter • Nighthawks • Love and Death • The Possession of Joel Delaney • The Appointment 19 Levon Helm 71 American Singer, Actor Coal Miner's Daughter • The Right Stuff • Shooter • Fire Down Below • In the Electric Mist 28 Patricia Medina 92 English Actress Mr. Arkadin • Abbott and Costello in the Foreign Legion • Plunder of the Sun • Botany Bay • Phantom of the Rue Morgue • Sangaree • Latitude Zero 29 Joel Goldsmith 54 American Composer Star Trek: First Contact • Shiloh • Laserblast • The Man with Two Brains • Kull the Conqueror • Moon 44 30 George Murdock 81 American Actor The X-Files • The American President • Orange County • Star Trek V: The Final Frontier • Earthquake • Looney Tunes: Back in Action • Any Which Way You Can May 2 Charlotte Mitchell 85 English Actress The Romantic Age • The Happiest Days of Your Life • Laughter in Paradise • The Man in the White Suit • Lady Godiva Rides Again • Curtain Up • The Story of Gilbert and Sullivan • Street Corner • Lost • Village of the Damned • Dentist in the Chair • Nearly a Nasty Accident • Dentist on the Job • Blood on Satan's Claw • Jim the World's Greatest • The French Lieutenant's Woman 6 James Isaac 51 American Director Jason X • Skinwalkers • Pig Hunt • The Horror Show 6 George Lindsey 83 American Actor Ensign Pulver • Snowball Express • Charley and the Angel • Robin Hood • The Aristocats • Treasure of Matecumbe • The Rescuers • Cannonball Run II • Take This Job and Shove It 8 Maurice Sendak 83 American Writer, Illustrator Where the Wild Things Are • Where the Wild Things Are • The Little Bear Movie • Tell Them Anything You Want: A Portrait of Maurice Sendak • Higglety Pigglety Pop! or There Must Be More to Life 14 Louise Latimer 96 American Actress There's Always Tomorrow • Murder on a Bridle Path • Bunker Bean • The Plot Thickens • California Straight Ahead! • Wings Over Honolulu 18 Richard Rabago 68 Japanese-American Actor The Sand Pebbles • Big Trouble in Little China • The Bad News Bears Go to Japan 22 Janet Carroll 71 American Actress Risky Business • Enough • Forces of Nature • Family Business • Born to Be Wild 28 Matthew Yuricich 89 American Special Effects Artist Field of Dreams • Die Hard • Close Encounters of the Third Kind • Ghostbusters • Dances with Wolves • Fright Night • Logan's Run • 1941 • Vibes • Harley Davidson and the Marlboro Man 31 Christopher Challis 91 English Cinematographer Chitty Chitty Bang Bang • Mary, Queen of Scots • Top Secret! • Two for the Road • A Shot in the Dark June 2 Richard Dawson 79 American Actor The Running Man • King Rat • Treasure Island • The Devil's Brigade 2 Kathryn Joosten 72 American Actress The Package • Best Men • Cheaper by the Dozen 2 • Wedding Crashers • Bedtime Stories • Alvin and the Chipmunks: The Squeakquel • Hostage 4 Stan Jolley 86 American Art Director, Production Designer Witness • Superman • Taps • Caddyshack • The Grass Harp 7 J. Michael Riva 63 American Production Designer Lethal Weapon • A Few Good Men • Iron Man • The Color Purple • The Goonies • Django Unchained • Charlie's Angels 8 Frank Cady 96 American Actor Rear Window • When Worlds Collide • Ace in the Hole 11 Ann Rutherford 94 American Actress Gone with the Wind • A Christmas Carol • Pride and Prejudice • The Secret Life of Walter Mitty 14 Yvette Wilson 48 American Actress Friday • Don't Be a Menace to South Central While Drinking Your Juice in the Hood • Blankman 17 Susan Tyrrell 67 American Actress Cry-Baby • The Chipmunk Adventure • Fat City • Big Top Pee-wee • Forbidden Zone • I Never Promised You a Rose Garden • Fire and Ice 19 Richard Lynch 72 American Actor Halloween • Invasion U.S.A. • Little Nikita • The Sword and the Sorcerer • The Seven-Ups • Deathsport • Werewolf • Scarecrow 26 Nora Ephron 71 American Director, Screenwriter, Producer Sleepless in Seattle • When Harry Met Sally... • You've Got Mail • Silkwood • Bewitched • Julie & Julia • Michael • Lucky Numbers • Hanging Up • Mixed Nuts 27 Don Grady 68 American Actor Ma Barker's Killer Brood • Cash McCall July 2 Ben Davidson 72 American Actor Conan the Barbarian • Necessary Roughness • The Black Six 3 Andy Griffith 86 American Actor A Face in the Crowd • Onionhead • Angel in My Pocket • The Second Time Around • Daddy and Them • Waitress • No Time for Sergeants • Spy Hard 4 Eric Sykes 89 English Actor Harry Potter and the Goblet of Fire • The Others • Son of Rambow • Those Magnificent Men in Their Flying Machines • Monte Carlo or Bust 8 Ernest Borgnine 95 American Actor Marty • From Here to Eternity • The Dirty Dozen • Ice Station Zebra • The Poseidon Adventure • The Neptune Factor • Law and Disorder • The Flight of the Phoenix • Escape from New York • Small Soldiers • The Black Hole • RED • The Wild Bunch • The Devil's Rain • BASEketball • McHale's Navy • Strange Wilderness 13 Sage Stallone 36 American Actor, Director, Producer Rocky V • Daylight • Chaos • Moscow Zero • Promises Written in Water 13 Ginny Tyler 86 American Actress, Singer Son of Flubber • The Sword in the Stone • Mary Poppins • Winnie the Pooh and the Honey Tree 13 Richard D. Zanuck 77 American Producer Jaws • Driving Miss Daisy • Cocoon • Road to Perdition • Big Fish • The Sugarland Express • Sweeney Todd: The Demon Barber of Fleet Street • Deep Impact • Rules of Engagement • Charlie and the Chocolate Factory • Dark Shadows • Yes Man • Reign of Fire • Alice in Wonderland • Planet of the Apes • True Crime • The Verdict • Mulholland Falls • Clash of the Titans 14 Avis Hope Eckelberry 56 American Film Editor The Flintstones • Romy and Michele's High School Reunion • Cobb • There Goes My Baby • Forget Paris • Mr. Saturday Night • The Last Boy Scout 15 Celeste Holm 95 American Actress All About Eve • Tom Sawyer • Gentleman's Agreement • Come to the Stable • High Society 17 Morgan Paull 67 American Actor Blade Runner • Patton • Norma Rae • The Apple Dumpling Gang Rides Again • Fade to Black • The Swarm • Uncle Sam 19 Tom Davis 59 American Actor Coneheads • Evolution • Blues Brothers 2000 • Trading Places 20 Simon Ward 70 English Actor Zulu Dawn • The Three Musketeers • Hitler: The Last Ten Days • if.... • I Start Counting • Quest for Love • Frankenstein Must Be Destroyed • Young Winston • Aces High • Deadly Strangers • Holocaust 2000 • Dominique • The Monster Club • Double X: The Name of the Game • Emily Brontë's Wuthering Heights 21 Angharad Rees 63 English Actress Hands of the Ripper • To Catch a Spy • Under Milk Wood • The Love Ban • Moments 22 Fern Persons 101 American Actress Risky Business • Class • Hoosiers • Prelude to a Kiss • Grandview, U.S.A. • On the Right Track 22 Frank Pierson 87 American Director, Screenwriter A Star Is Born • King of the Gypsies • Cat Ballou • The Happening • Cool Hand Luke • The Anderson Tapes • Dog Day Afternoon • In Country • Presumed Innocent 24 Chad Everett 76 American Actor Mulholland Drive • Psycho • Airplane II: The Sequel • The Firechasers • First to Fight • The Singing Nun • Made in Paris • Johnny Tiger 24 Sherman Hemsley 74 American Actor Love at First Bite • Mr. Nanny • Club Fed • Stewardess School • Home of Angels • Sprung • Jane Austen's Mafia! • Senseless • Screwed 26 Lupe Ontiveros 69 American Actress The Goonies • Selena • As Good as It Gets • Our Family Wedding • Cheech & Chong's Next Movie • Universal Soldier • This Christmas 26 Mary Tamm 62 English Actress The Odessa File • The Likely Lads • Doghouse • Tales That Witness Madness 27 Norman Alden 87 American Actor Back to the Future • Ed Wood • Patch Adams • The Sword in the Stone • Good Times • They Live • K-PAX • Transformers: The Movie • Semi-Tough 27 R. G. Armstrong 95 American Actor El Dorado • Predator • Dick Tracy • Reds • Stay Hungry • The Great Northfield Minnesota Raid • Children of the Corn • Heaven Can Wait 27 Geoffrey Hughes 68 English Actor The Bofors Gun • Till Death Us Do Part • The Virgin Soldiers • Smashing Time • Adolf Hitler: My Part in His Downfall • Carry On at Your Convenience 27 Tony Martin 98 American Actor, Singer Follow the Fleet • Murder on a Bridle Path • The Poor Little Rich Girl • Pigskin Parade • The Holy Terror • You Can't Have Everything • Ali Baba Goes to Town • Kentucky Moonshine • Up the River • Ziegfeld Girl 29 John P. Finnegan 86 American Actor JFK • The Natural • Mars Attacks! • Last Action Hero • An American Tail • Vegas Vacation • Nickelodeon • Gloria • Big Man on Campus 30 Jonathan Hardy 71 New Zealand Actor, Director Backstage • Moulin Rouge! • Mad Max • The Devil's Playground • Mr. Reliable • My Letter to George 31 Gore Vidal 86 American Actor Bob Roberts • Gattaca • With Honors • Caligula August 6 Marvin Hamlisch 68 American Composer The Way We Were • Sophie's Choice • Three Men and a Baby • Bananas • The Informant! • The Spy Who Loved Me • Save the Tiger • The Mirror Has Two Faces • D.A.R.Y.L. 9 Al Freeman, Jr. 78 American Actor Finian's Rainbow • Malcolm X • Down in the Delta • Castle Keep • The Detective Black Like Me • Sniper's Ridge • This Rebel Breed • The Troublemaker • Once Upon a Time...When We Were Colored 9 Mel Stuart 83 American Director, Producer Four Days in November • If It's Tuesday, This Must Be Belgium • I Love My Wife • Willy Wonka & the Chocolate Factory • One Is a Lonely Number • Wattstax • The White Lions • Mean Dog Blues 10 Irving Fein 101 American Producer 18 Again! • Oh, God! You Devil • Just You and Me, Kid 10 Carlo Rambaldi 86 Italian Special Effects Artist E.T. the Extra-Terrestrial • A Lizard in a Woman's Skin • King Kong • Possession • Cameron's Closet • Alien 11 Bill Rafferty 68 American Actor Above the Rim • Mad City 13 Joan Roberts 94 American Actress The Model and the Marriage Broker • Lovely to Look At 14 Ron Palillo 63 American Actor Skatetown, U.S.A. • Surf II • Friday the 13th Part VI: Jason Lives • Snake Eater • Snake Eater II: The Drug Buster • Wind • Dickie Roberts: Former Child Star 14 Phyllis Thaxter 92 American Actress Superman • Thirty Seconds Over Tokyo • Bewitched • Week-End at the Waldorf • Tenth Avenue Angel • The Sea of Grass • Living in a Big Way • Blood on the Moon • Act of Violence • No Man of Her Own • The Breaking Point • Jim Thorpe – All-American • Fort Worth • Springfield Rifle • Women's Prison • The World of Henry Orient 15 Biff Elliot 89 American Actor I, the Jury • House of Bamboo • Between Heaven and Hell • The True Story of Jesse James • The Enemy Below • Pork Chop Hill • PT 109 • Blood Bath • The Navy vs. the Night Monsters • Day of the Wolves • The Hard Ride • Kotch • Save the Tiger • That's Life! 16 William Windom 88 American Actor To Kill a Mockingbird • For Love or Money • Hour of the Gun • The Detective • The Gypsy Moths • Brewster McCloud • The Mephisto Waltz • Fools' Parade • Now You See Him, Now You Don't • The Man • Planes, Trains and Automobiles • Miracle on 34th Street • The Americanization of Emily • She's Having a Baby • Grandview, U.S.A. • Last Plane Out • True Crime • Escape from the Planet of the Apes • Uncle Buck • Sommersby 19 Tony Scott 68 English Director, Producer Top Gun • Unstoppable • Crimson Tide • Prometheus • Beverly Hills Cop II • Man on Fire • The Last Boy Scout • The Taking of Pelham 123 • True Romance • Enemy of the State • Spy Game • Déjà Vu • The A-Team • RKO 281 • In Her Shoes 20 Phyllis Diller 95 American Actress The Sunshine Boys • A Bug's Life • Splendor in the Grass • The Fat Spy • Eight on the Lam • The Private Navy of Sgt. O'Farrell • Boy, Did I Get a Wrong Number! • Mad Monster Party • The Adding Machine • The Nutcracker Prince • Happily Ever After 23 Jerry Nelson 78 American Puppeteer, Actor The Muppet Movie • Sesame Street presents Follow That Bird • The Great Muppet Caper • The Dark Crystal • The Muppets Take Manhattan • Winners Take All • RoboCop 2 • The Muppet Christmas Carol • Muppet Treasure Island • Muppets from Space • The Adventures of Elmo in Grouchland • The Muppets 24 Steven Franken 80 American Actor Angels & Demons • The Trumpet of the Swan • Agent Red • Nurse Betty • The Omega Code • The Party • Follow Me, Boys! • Wild Wild Winter • The Time Travelers • The Americanization of Emily • Cop Hater • Stage Struck 25 Neil Armstrong 82 American Actor Quantum Quest: A Cassini Space Odyssey • Fly Me to the Moon 31 Max Bygraves 89 English Actor, Singer Tom Brown's Schooldays • Charley Moon • A Cry from the Streets • Bobbikins • Spare the Rod 31 Joe Lewis 68 American Actor, Stuntman Bloodmoon • Force: Five • Jaguar Lives! • Circle of Iron • The Wrecking Crew • The Green Berets September 1 Hal David 91 American Songwriter Lost Horizon • What's New Pussycat? • Butch Cassidy and the Sundance Kid • Casino Royale • Two Gals and a Guy • On Her Majesty's Secret Service 3 Michael Clarke Duncan 54 American Actor The Green Mile • Sin City • Armageddon • Talladega Nights: The Ballad of Ricky Bobby • Kung Fu Panda • School for Scoundrels • The Whole Nine Yards • Daredevil • The Island • Planet of the Apes • A Night at the Roxbury • Green Lantern • Bulworth • The Scorpion King • See Spot Run • Cats & Dogs • The Last Mimzy • Welcome Home Roscoe Jenkins • Brother Bear • Street Fighter: The Legend of Chun-Li • Racing Stripes • The Underground Comedy Movie 6 Jake Eberts 71 Canadian Producer The Way Back • Oceans • Two Brothers • Open Range • The Legend of Bagger Vance • Grey Owl • The Wind in the Willows • Super Mario Bros. • A River Runs Through It •City of Joy • Dances with Wolves • The Adventures of Baron Munchausen 6 Frank Godwin 95 English Producer Woman in a Dressing Gown • Operation Bullshine • Sammy's Super T-Shirt • No Trees in the Street • Don't Bother to Knock • Demons of the Mind 7 Louise LaPlanche 93 American Actress The Hunchback of Notre Dame • Strike Up the Band • Holiday Inn • Road to Morocco • Dutch • Memories of Me • Practically Yours • Frenchman's Creek • And the Angels Sing • Lady in the Dark • Riding High • Lady of Burlesque • Star Spangled Rhythm • Young and Willing 8 Leigh Hamilton 62 New Zealand-American Actress Hocus Pocus • Forced Vengeance • Gas Food Lodging • A Man, a Woman, and a Bank • Paramedics 10 Vondell Darr 93 American Actress The City That Never Sleeps • The Pony Express • On Trial • That Certain Age • Andy Hardy Gets Spring Fever • Scouts to the Rescue • Strike Up the Band • Little Nellie Kelly • The Chocolate Soldier 10 Lance LeGault 75 American Actor Home on the Range • Mortal Kombat: Annihilation • Iron Eagle • Stripes • Coma • The Kentucky Fried Movie • Catch My Soul • The Young Runaways • The Swinger • Roustabout • Viva Las Vegas • Kissin' Cousins • Girls! Girls! Girls! 10 Stanley Long 78 English Director, Screenwriter, Producer The Wife Swappers • Adventures of a Taxi Driver • Adventures of a Private Eye • Adventures of a Plumber's Mate • Eskimo Nell • The Sorcerers • Groupie Girl 10 John Moffatt 89 English Actor The Silent Enemy • A Night to Remember • Tom Jones • Julius Caesar • Lady Caroline Lamb • Murder on the Orient Express • Galileo • Britannia Hospital • Prick Up Your Ears • Loser Takes All 12 Jon Finlayson 74 Australian Actor Lonely Hearts • Evil Angels • My First Wife • Mad Dog Morgan • The Great Macarthy • Alvin Purple Rides Again 13 Edgar Metcalfe 78 English Actor Evil Angels • Percy's Progress • Plugg 14 Stephen Dunham 48 American Actor The Mummy • Paranormal Activity 4 • Savages • Get Smart • Monster-in-Law • Catch Me If You Can • Anger Management • Traffic • Nothing Sacred • The Last Samurai 14 Winston Rekert 63 Canadian Actor Agnes of God • The Blue Man • Heartaches • Toby McTeague 16 John Ingle 84 American Actor Hostage • Senseless • Batman & Robin • Death Becomes Her • Repossessed • RoboCop 2 • Heathers • Amazon Women on the Moon • True Stories 16 Roman Kroitor 85 Canadian Director, Producer In the Labyrinth • City of Gold • Lonely Boy • Nobody Waved Good-bye • Stones at the Max • CyberWorld 21 Michael Rye 94 American Actor Hugo the Hippo • Hands of a Stranger • Two Lost Worlds • Rivers of Fire and Ice 25 Andy Williams 84 American Actor, Singer I'd Rather Be Rich • Something in the Wind • Kansas City Kitty • Janie 26 Johnny Lewis 28 American Actor Lovely Molly • The Runaways • Alien vs. Predator: Requiem • Felon • One Missed Call • Raise Your Voice • Pretty Persuasion • Underclassman 27 Herbert Lom 95 Czech-English Actor The Pink Panther Films • The Pope Must Die • King Solomon's Mines • The Dead Zone • Dorian Gray • Count Dracula • Mysterious Island • A Shot in the Dark • The Phantom of the Opera • Spartacus • El Cid • The Ladykillers • Hopscoth • The Dark Tower Secret Mission • The Young Mr Pitt • Hotel Reserve • The Seventh Veil • Night Boat to Dublin 28 Michael O'Hare 60 American Actor Last Exit to Brooklyn • C.H.U.D. • The Pursuit of D. B. Cooper • The Promise • The Ambulance 30 Turhan Bey 90 Austrian-American Actor Shadows on the Stairs • The Mummy's Tomb • The Falcon Takes Over • Arabian Nights • The Mad Ghoul • Background to Danger • The Gay Falcon • The Climax • Dragon Seed • Ali Baba and the Forty Thieves • Crazy House • Captive Wild Woman • Out of the Blue • Parole, Inc. • The Amazing Mr. X • Night in Paradise • Healer • Possessed by the Night October 2 Marjorie Lane 100 American Actress, Singer Born to Dance • Broadway Melody of 1936 • Rosalie • Broadway Melody of 1938 7 Larry Block 69 American Actor Shamus • Slap Shot • Heaven Can Wait • Hardcore • First Family • After Hours • Cocktail • Betsy's Wedding • My Blue Heaven • Big Night • Isn't She Great • Bait • Don't Say a Word 7 Hank Moonjean 82 American Producer Dangerous Liaisons • Stealing Home • Stroker Ace • Sharky's Machine • Paternity • The Incredible Shrinking Woman • Smokey and the Bandit II • Hooper • The Great Gatsby • Child's Play • The Singing Nun • WUSA • Move • The Secret Life of an American Wife • Welcome to Hard Times • Spinout 8 Ken Sansom 85 American Actor The Tigger Movie • Piglet's Big Movie • Pooh's Heffalump Movie • The Chipmunk Adventure • Starchaser: The Legend of Orin • Herbie Rides Again • The Sting • The Long Goodbye • Funny Lady • Airport 1975 • Shinbone Alley 9 Harris Savides 55 American Cinematographer Gerry • Elephant • Last Days • The Bling Ring • Zodiac • Whatever Works • American Gangster • Somewhere • Greenberg • Margot at the Wedding • Heaven's Prisoners • Finding Forrester • Milk • Restless • The Game • Birth 10 Alex Karras 77 American Actor Blazing Saddles • Porky's • Buffalo '66 • Against All Odds • FM • Victor Victoria • When Time Ran Out • Nobody's Perfekt • Paper Lion 10 Robert Litz 62 American Screenwriter House of Cards • Rappin 10 Leo O'Brien 41 American Actor The Last Dragon • Rappin' • New Jack City 12 Norm Grabowski 79 American Actor The Cannonball Run • Hooper • The Towering Inferno • Herbie Rides Again • Blackbeard's Ghost • The Happiest Millionaire • The Gnome-Mobile • Out of Sight • The Monkey's Uncle • Girl Happy • Roustabout • The Wheeler Dealers • The Misadventures of Merlin Jones • Son of Flubber • The Chapman Report • The Honeymoon Machine • College Confidential • Girls Town • The Beat Generation • The Naked and the Dead 13 Gary Collins 74 American Actor Hangar 18 • Airport • Angel in My Pocket • The Pigeon That Took Rome • Killer Fish • Beautiful 14 John Clive 79 English Actor A Clockwork Orange • Yellow Submarine • The Italian Job • The Pink Panther Strikes Again • Smashing Time • Rosie Dixon – Night Nurse • Carry On Abroad • The Magnet • Carry On Dick • That's Carry On! 18 Sylvia Kristel 60 Dutch Actress Private Lessons • Private School • Lady Chatterley's Lover • The Arrogant • Red Heat • The Nude Bomb • The Concorde ... Airport '79 • The Fifth Musketeer 20 Joe Melia 77 English Actor Sweeney! • Oh! What a Lovely War • Modesty Blaise • Too Many Crooks • The Intelligence Men • Antony and Cleopatra • Follow a Star • Privates on Parade • The Wildcats of St Trinian's • The Odd Job 22 Carolyn Conwell 82 American Actress Torn Curtain • The Boston Strangler • Cheech & Chong's Next Movie • The Magnificent Seven Ride • Adam at Six A.M. 22 Russell Means 72 American Actor Natural Born Killers • Pocahontas • The Last of the Mohicans • Thomas and the Magic Railroad • Pathfinder • Wagons East! • The Last Shot 24 Peggy Ahern 95 American Actress Our Gang • Excuse Me • The Call of the Wild 26 Mac Ahlberg 81 Swedish Cinematographer Beverly Hills Cop III • The Brady Bunch Movie • A Very Brady Sequel • Good Burger • Oscar • House • The Seduction • Zone Troopers • My Boyfriend's Back • Innocent Blood • The Horror Show • DeepStar Six • The Graduates of Malibu High 26 Natina Reed 32 American Actress, Singer Bring It On • Honey 27 Robert W. Castle 81 American Actor Philadelphia • Rachel Getting Married • The Manchurian Candidate Lost Souls • Beloved • Cop Land • Sleepers • The Funeral • Big Night • The Addiction • The Truth About Charlie 28 Bob Brunner 78 American Screenwriter The Other Sister • Exit to Eden 30 Leonard Termo 77 American Actor Fight Club • Ali • Godzilla • Gettysburg • Gods and Generals • Ruby • Gone Fishin' • Mojave Moon • Lost Highway • Ed Wood • Year of the Dragon • Johnny Dangerously • Turk 182 • Nowhere to Run • Mobsters • Bloodhounds of Broadway • The Pope of Greenwich Village • The Cotton Club • Homeboy • A Prayer for the Dying • Heart Like a Wheel • Barfly 31 Brian Cobby 83 English Actor Evita • The Tell-Tale Heart • The Breaking Point • Paris by Night 31 Teri Shields 79 American Actress, Producer Endless Love • Wanda Nevada • Backstreet Dreams • Sahara November 5 Olympe Bradna 93 French- American Actress Souls at Sea • The Night of Nights • College Holiday • High, Wide, and Handsome • Stolen Heaven 5 Margaret Nichols 82 American Animator Charlotte's Web • Who Framed Roger Rabbit • The Little Mermaid • The Transformers: The Movie • My Little Pony: The Movie • Oliver & Company • The Rescuers Down Under • The Black Cauldron • Heidi's Song • Shinbone Alley 6 Clive Dunn 92 English Actor, Singer Dad's Army • The Magic Christian • The Fiendish Plot of Dr. Fu Manchu • The Bliss of Mrs. Blossom • Boys Will Be Boys • Good Morning, Boys • A Yank at Oxford • Boys in Brown • The Fast Lady • The Mouse on the Moon • Crooks and Coronets 7 Richard Robbins 71 American Composer Howards End • The Remains of the Day • The White Countess • Le Divorce • The Golden Bowl • Jefferson in Paris • Slaves of New York • My Little Girl • Maurice • A Room with a View • Heat and Dust • The Girl 8 Lucille Bliss 96 American Actress Cinderella • Alice in Wonderland • One Hundred and One Dalmatians • The Secret of NIMH • Assassination • Miracle Mile • Robots 8 Roger Hammond 76 English Actor The King's Speech • National Lampoon's Van Wilder: The Rise of Taj • Keeping Mum • Around the World in 80 Days • A Good Woman • Richard III • Persuasion • The Madness of King George • Morons from Outer Space • Royal Flash • A Touch of Love 9 Bobbi Jordan 75 American Actress Mame • A Guide for the Married Man • Fast Forward 9 Pat Renella 83 American Actor X-15 • Beverly Hills Brats • A Piece of the Action • Bullitt • In Like Flint • A Gathering of Eagles • The Silencers • Dayton's Devils • Riot on Sunset Strip • Moonchild • Run for the Roses 17 Bonnie Lynn Fields 68 American Actress Bye Bye Birdie • Angel in My Pocket • Funny Girl • The Comic • Sweet Charity • Kissin' Cousins • The Five Pennies 21 Dann Cahn 89 American Film Editor The Octagon • Beyond the Valley of the Dolls • Salsa • Pittsburgh • Heaven with a Gun • Forever, Darling • Tough Enough 21 Deborah Raffin 59 American Actress Death Wish 3 • Touched by Love • The Sentinel • The Dove • 40 Carats • Once Is Not Enough • God Told Me To • Dance of the Dwarfs 22 Mel Shaw 97 American Animator, Screenwriter The Lion King • Beauty and the Beast • Bambi • The Rescuers • The Great Mouse Detective • The Fox and the Hound • The Black Cauldron 23 Larry Hagman 81 American Actor, Director Primary Colors • Nixon • JFK• Superman • The Eagle Has Landed • Fail-Safe • S.O.B. • Ensign Pulver • The Big Bus • Mother, Jugs & Speed • Harry and Tonto • Stardust • In Harm's Way • The Group • Checkered Flag or Crash • The Hired Hand • Beware! The Blob 23 John Kemeny 87 Hungarian-Canadian Producer Iron Eagle II • Atlantic City • The Apprenticeship of Duddy Kravitz • The Gate • The Wraith • The Boy in Blue • The Bay Boy • White Line Fever • Quest for Fire • Ice Castles • The Best Damn Fiddler from Calabogie to Kaladar • Don't Let the Angels Fall 25 Dinah Sheridan 92 English Actress Genevieve • The Railway Children • Calling Paul Temple • Appointment in London • Get Cracking • For You Alone • The Huggetts Abroad • Where No Vultures Fly • The Sound Barrier • The Mirror Crack'd • The Story of Gilbert and Sullivan 26 Martin Richards 80 American Producer Chicago • Fort Apache, The Bronx • The Boys from Brazil • Some of My Best Friends Are... 27 Bob Kellett 84 English Director, Producer, Screenwriter Are You Being Served? • F/X2 • Haunted • Don't Just Lie There, Say Something! • Up the Front • San Ferry Ann • A Home of Your Own • Just like a Woman • Futtocks End • Up the Chastity Belt • Up Pompeii All I Want Is You... and You... and You... • Spanish Fly • Girl Stroke Boy • The Alf Garnett Saga 28 Don Rhymer 51 American Screenwriter Rio • Surf's Up • Big Momma's House • Big Momma's House 2 • The Santa Clause 2 • Agent Cody Banks 2: Destination London • The Honeymooners • Big Mommas: Like Father, Like Son • Deck the Halls • Carpool 29 Susan Luckey 74 American Actress The Music Man • Carousel • Deep in My Heart • Teenage Rebel 29 Benjamin Tatar 82 American Actor The Wind and the Lion • Battle of the Bulge • The Cemetery Club • Two Evil Eyes • Land Raiders • Crack in the World • The Long Duel • Bang Bang Kid • The Christmas Kid • The Thin Red Line December 3 Eileen Moran 60 American Visual Effects The Lord of the Rings • Rise of the Planet of the Apes • The Adventures of Tintin • King Kong • X-Men: The Last Stand • Fight Club • Bridge to Terabithia • Eragon • I, Robot • Jumper • Frequency • The Water Horse • 30 Days of Night • Lake Placid • EDtv 7 Jeni Le Gon 96 American Actress Bones • Bright Road • Easter Parade • Stormy Weather • I Walked with a Zombie • Arabian Nights • Fools for Scandal • I Shot Jesse James • Sundown • Ali Baba Goes to Town 7 Rusty Mills 49 American Animator An American Tail • Happily Ever After • Pinocchio and the Emperor of the Night 8 Hal Schaefer 87 American Composer, Actor The Money Trap • There's No Business Like Show Business • Gentlemen Prefer Blondes • A Star Is Born • With a Song in My Heart • The Secret Fury • The Amsterdam Kill 10 Ed Grady 89 American Actor The Notebook • Lolita • A Simple Twist of Fate • Children of the Corn II: The Final Sacrifice • Consenting Adults • Wild Hearts Can't Be Broken • D.A.R.Y.L. • Not Without My Daughter • The Handmaid's Tale • From the Hip • Chattahoochee • New Best Friend • Wolfman 10 Patricia Kennedy 96 Australian Actress The Getting of Wisdom • My Brilliant Career • Country Life • Road to Nhill • The Office Picnic 11 Ravi Shankar 92 Indian-American Composer Gandhi • Charly • Raga • Chappaqua 12 Don Medford 95 American Director The Hunting Party • The Organization • To Trap a Spy 13 Jack Hanlon 96 American Actor Our Gang • The General • The Easiest Way • The Shakedown 14 Kenneth Kendall 88 Indian-English Actor 2001: A Space Odyssey • They Came from Beyond Space • The Reckless Moment • The Brain 16 Axel Anderson 83 German-Puerto Rican Actor Assassins • Bananas • Battle of the Bulge • The Reaping • The Delta Factor • Finger on the Trigger • An American Romance 18 Danny Steinmann 70 American Director, Screenwriter Friday the 13th: A New Beginning • Savage Streets • The Unseen 21 Daphne Oxenford 93 English Actress That'll Be the Day • Frankenstein Must Be Destroyed • Sweet William 22 Cliff Osmond 75 American Actor The Fortune Cookie • Kiss Me, Stupid • Irma la Douce • Invasion of the Bee Girls • The Front Page • The Apple Dumpling Gang Rides Again • The Mouse and His Child • In Search of a Golden Sky • The Great Brain 24 Richard Rodney Bennett 76 English Composer Nicholas and Alexandra • Murder on the Orient Express • Billion Dollar Brain • Far from the Madding Crowd • Four Weddings and a Funeral • Yanks • The Return of the Soldier • The Brink's Job • Enchanted April • Equus • The Witches • The Nanny • Secret Ceremony • Lady Caroline Lamb • Face in the Night • The Accuser 24 Charles Durning 89 American Actor The Sting • Dog Day Afternoon • The Muppet Movie • Scarface • Dick Tracy • Spy Hard • O Brother, Where Art Thou? • Tootsie • To Be or Not to Be • When a Stranger Calls • The Best Little Whorehouse in Texas • Sisters • The Hindenburg • The Front Page • Two of a Kind • Meatballs III: Summer Job • Solarbabies • Tough Guys • Breakheart Pass • Cop • Twilight's Last Gleaming • The Fury • The Greek Tycoon • Starting Over • North Dallas Forty • The Final Countdown • True Confessions • The Choirboys • Mass Appeal • The Music of Chance • V.I. Warshawski • The Hudsucker Proxy • Dirty Deeds • Good Dick • State and Main 24 Lee Hartman 82 American Animator, Actor Sleeping Beauty • Night of the Living Dead • There's Always Vanilla • Paul Bunyan 24 Jack Klugman 90 American Actor 12 Angry Men • Days of Wine and Roses • I Could Go On Singing • Where Were You When the Lights Went Out? • The Detective • Goodbye, Columbus • Two-Minute Warning • Dear God • When Do We Eat? • The Split • Cry Terror! • The Yellow Canary • Time Table 26 Gerry Anderson 83 English Director, Producer, Screenwriter Crossroads to Crime • Thunderbirds Are Go • Thunderbird 6 • Doppelgänger 27 Harry Carey, Jr. 91 American Actor Gremlins • Back to the Future Part III • The Exorcist III • Tombstone • Crossroads • Mask • The Searchers • The Long Riders • Take a Hard Ride • Something Big • Big Jake • Breaking In • The Whales of August • Death of a Gunfighter • The Undefeated • The Devil's Brigade • Billy the Kid vs. Dracula • The Rare Breed • 3 Godfathers • Bandolero! • Nickelodeon • Sunchaser • Cherry 2000 • Dirty Dingus Magee • One More Time • Cyborg 2087 • The Ballad of Josie 28 Jon Finch 71 English Actor Kingdom of Heaven • The Vampire Lovers • The Horror of Frankenstein • Sunday Bloody Sunday • The Final Programme • Death on the Nile • Breaking Glass • Frenzy • Lady Caroline Lamb • Peter and Paul • Darklands • Macbeth • Giro City 30 Mike Hopkins 53 New Zealand Sound Editor Transformers • The Lord of the Rings • King Kong • Public Enemies • Kung Fu Panda • Dreamgirls • The Ring Two • Superman • Blade Runner • Octopussy • Romeo and Juliet • The Last Emperor • The Last Grenade • Valkyrie • Return to Oz • The Bounty • Mr. Wrong • The Frighteners • Whore • Heavenly Creatures • Braindead • War Party • Time Bandits • A Countess from Hong Kong 30 Gloria Pall 85 American Actress Abbott and Costello Go to Mars • 20,000 Leagues Under the Sea • Jailhouse Rock • The French Line • The Night of the Hunter • All Ashore • Ada • Elmer Gantry • Ma and Pa Kettle on Vacation • The Brothers Karamazov • This Could Be the Night • The Crimson Kimono • Hot Shots • The Garment Jungle == References == * Category:Lists of movies",
 "title": "2012 in movies"
}