{
 "id": "3465",
 "text": "Liechtenstein (officially the Principality of Liechtenstein) is a country in Western Europe. It is the sixth smallest country in the worldPopulation by sex, rate of population increase, surface area and density and, with Uzbekistan, one of only two doubly landlocked countries. This means that it is bordered only by landlocked countries. Liechtenstein is located between Austria and Switzerland. The official language in Liechtenstein is German. The capital of Liechtenstein is Vaduz, a very small town of 5,000 people. Liechtenstein is famous for its many private banks. Liechtenstein is known as a principality. This means that the monarch has the title of Prince. == History == The territory that is now Liechtenstein was once split into two different states, the County of Vaduz and the Lordship of Schellenberg, which were both part of the Holy Roman Empire. The Liechtenstein family wanted more power within the Holy Roman Empire. In the 17th century, the Holy Roman Emperor made Karl Liechtenstein a Prince. Karl's descendant, Hans Adam I purchased the lands of the County of Vaduz and the Lordship of Schellenberg and united them into one principality named Liechtenstein. In 1806, the Holy Roman Empire was broken up by Napoleon. With the fall of the Empire, Liechtenstein became a free independent country. Liechtenstein remained neutral during World War I and World War II. Hitler did have plans to invade Liechtenstein alongside Switzerland in the planned Operation Tannenbaum but never did. In 1969, NASA gave Liechtenstein moon rocks and a national flag that had been on the moon to thank them for their support from a Liechtenstein company during the Apollo 11 mission. == Geography == Liechtenstein is located in the European Alps and is bordered to the east by the Austrian state of Vorarlberg, to the south by the canton of Grisons (Switzerland) and to the west by the canton of St. Gallen (Switzerland). The Rhine forms the entire western border of Liechtenstein. Measured south to north the country is about 24 km (15 mi) long. Its highest point, the Grauspitz, is 2,599 m (8,527 ft). Despite its Alpine location, prevailing southerly winds make the climate comparatively mild. In winter, the mountain slopes are well suited to winter sports. == Politics == Liechtenstein is a constitutional monarchy, meaning that the head of state is a monarch (with the title Prince Regnant) but has limited political powers. The Prince can veto legislations, call for a referendum, create new bills and dissolve parliament. The legislature is the landtag (or diet). There are 25 elected members. The members of government are usually all members of the biggest political party. ==Related pages== *Liechtenstein at the Olympics *Liechtenstein national football team *List of rivers of Liechtenstein ==References== Category:Current monarchies Category:German-speaking countries Category:1866 establishments in Europe",
 "title": "Liechtenstein"
}