{
 "id": "3466",
 "text": "Portugal is a country in Southern Europe on the Iberian Peninsula. It is the westernmost country of Europe and part of the Mediterranean area. It is bordered by the Atlantic Ocean to the west and south and by Spain to the north and east. Its capital city is Lisbon. It has been a member of the European Union since 1986. Portugal was under a dictatorship between 1926 and 1974 called Estado Novo. This dictatorship was ended by a peaceful revolution called the Carnation Revolution. The Portuguese economy has been very good since then although it was hit hard by the recession of 2007-2008. It once had an empire called the Portuguese Empire, and was a powerful maritime nation from the 1500s to the 1800s, being the tenth-largest empire, with a maximum land area of 10.4 million km² which included Brazil, Angola, Mozambique, Guinea-Bissau, East Timore, São Tomé and Príncipe, and Portuguese Ceylon (Sri Lanka), as well as Macau in China (until 2002). Portugal is a popular holiday destination but is sometimes overlooked in favour of larger countries like France, Spain and Italy. The Algarve region in the south and the capital Lisbon are the most popular destinations. The country has a national football team. Portugal won the Eurovision Song Contest in 2017, and hosted the contest the following year. ==Geography== Three groups of islands in the Atlantic Ocean are also part of Portugal: the Azores (Açores), Madeira and the Savage Isles (Ilhas Selvagens). The Savage Isles are a small group of uninhabited islands, administered by Madeira. Portugal claims that Olivença is also part of its territory, but it is controlled by Spain. == History == === Kingdom of Portugal === Portugal became a kingdom in 1139 but was not officially recognized until 1143. It has had links with England since the 1100s by a treaty. The border with Spain has been almost the same since the 13th century. Fishing and trading with other countries were important here. Portugal was important in world exploration for two reasons. Firstly, Prince Henry the Navigator of Portugal was very interested in exploration. Secondly, inventions in navigation led to a greater knowledge of geography. This exploration of the world began the Portuguese Empire. The country was a world power during the 15th and 16th centuries. It tried to colonize Canada in the 16th century. However, it lost a lot of money soon after this. Portugal and Spain were in the Iberian Union from 1580 to 1640. The 1755 Lisbon earthquake devastated the capital and weakened the aristocracy. The country was occupied during the Peninsular War during the early 1800s. It lost its largest colony, Brazil, in 1822. === Portuguese Republic === In 1910, the Kingdom of Portugal ended and the nation became a republic. Eight years after Portugal's involvement in World War I, a military group took control of the country from the Portuguese First Republic in the 28 May coup d’état. This began a time of rule by authoritarian governments called Ditadura Nacíonal that later became known as Estado Novo. During World War II Portugal remained neutral but friendly to Britain and Spain. In 1974, a peaceful left-wing army coup, called the Carnation Revolution took place that overthrew the military dictatorship and ended the Portuguese Colonial War. Political prisoners and opponents of António de Oliveira Salazar were freed. The coup was an important part of Portugal’s transition to democracy and changed the way the country was run. In 1975, Portugal allowed its colonies in Africa to become independent: Mozambique, Angola, Guinea-Bissau, Cape Verde and São Tomé and Príncipe. East Timor in Asia declared itself independent from Portugal on 28 November 1975, and was invaded and occupied by Indonesian forces nine days later. Another Asian colony, Macau, became part of China. Portugal joined the European Union in 1986. The main language of Portugal is Portuguese. Some famous Portuguese people are D. Afonso Henriques, Henry the Navigator, Bartolomeu Dias, Vasco da Gama, Pedro Álvares Cabral, Ferdinand Magellan, Luís de Camões, Fernando Pessoa, Amália Rodrigues, Álvaro Siza Vieira, and Eduardo Souto de Moura. Luís de Camões wrote the national poem of Portugal. It is called Os Lusíadas and was written in 1572. ==Notes== ==Related pages== * List of rivers of Portugal * Portugal at the Olympics * Portugal national football team ==References== ==Other websites== * Category:Portuguese-speaking countries Category:European Union member states Category:1974 establishments in Europe",
 "title": "Portugal"
}