{
 "id": "34679",
 "text": "Chiang Kai-shek was a Chinese nationalist politician and military leader who was President of the Republic of China, born in Xikou on October 31, 1887. His father was a merchant who died when Chiang was eight years old. Chiang became an officer in the army of the Manchu empire, but supported the Chinese Xinhai Revolution of 1911 that converted China into a republic. He led the Republic of China from 1930 to 1949 on mainland China until he was overthrown by Mao Zedong in the Chinese Civil War. He fled to Taiwan where he ruled from 1950 until his death in 1975, although his government was still officially called the Republic of China. == Biography == Chiang Kai-Shek was born on October 31, 1887, in Zhejiang province, China. He received a military education at the Baoding Military Academy and later studied in Japan at the Tokyo Shinbu Gakko. These formative years laid the groundwork for his future role as a military and political leader. Chiang's exposure to different ideologies and military strategies influenced his approach during pivotal moments in Chinese history. After his father died, Chiang joined the army. At first, he went to Baoding in northern China to study military science. Later, he went to Japan to learn more about the military. In 1918, he joined the Nationalist Party of Sun Yat- sen. Sun Yat-sen helped Jiang Kai-Shek make a military academic school called Huangpu Military School. In 1926 and 1927 he led the Northern Expedition to conquer local warlords and unify China. After Sun Yat-sen died, he pushed out the Communists in 1927. In 1928, he made a new government in Nanjing, and became head of the state. He focused on fighting the Communists and the Empire of Japan. In 1937, Japan began to invade China, and Chiang was in charge of the Nationalist Chinese Army, until the war ended in 1945. Chiang ruled China until 1949, when Mao Zedong, who led the Communist Party of China, attacked Chiang and his officials, and they were forced to flee to Taiwan. Chiang established the Republic of China on the Island of Taiwan in 1949. He governed Taiwan until his death in 1975, leaving a complex legacy of authoritarian rule and anti-communism. == References == == Other websites == * Chiang Kai-shek, Citizendium Category:1887 births Category:1975 deaths Category:Anti-communists Category:Chinese generals Category:Methodists Category:Presidents of the Republic of China Category:Former dictators Category:Prime ministers Category:Taiwanese military people Category:Time People of the Year Category:World War II political leaders Category:Politicians from Zhejiang Category:20th-century Chinese military people",
 "title": "Chiang Kai-shek"
}