{
 "id": "346784",
 "text": "Suicidal Tendencies is a hardcore punk band, which started in 1981 in Venice, California. Since their start, they had a lot of members come and go. Their lead singer Mike Muir is their only permanent member. They are credited by many as one of \"the fathers of crossover thrash\". Today, Suicidal Tendencies have released nine studio albums, one EP, four split albums, five compilation albums, and two long-form videos. They have not released an album of original material since 2000's Free Your Soul and Save My Mind. But they released a small number of new songs that had not been released before on the split/compilation albums Friends & Family, Vol. 2 (2001), Year of the Cycos (2008), No Mercy Fool!/The Suicidal Family (2010) and The Mad Mad Muir Musical Tour (2011). Suicidal Tendencies became well known when they released their self-titled debut album in 1983. It spawned the single \"Institutionalized\", which was one of the first hardcore punk videos to get substantial airplay on MTV. Suicidal Tendencies had not released their second album until 1987, with Join the Army. It was the album that got the attention of Epic Records, who signed Suicidal Tendencies in 1988, the same year they released their third album How Will I Laugh Tomorrow When I Can't Even Smile Today. People began to recognize Suicidal Tendencies more when they released the albums Controlled by Hatred/Feel Like Shit...Déjà Vu and Lights...Camera...Revolution!, which were both certified Gold by the RIAA. The band made two more albums, The Art of Rebellion and Suicidal for Life, and then broke up in 1995 while serving ties with from Sony and Epic. However, Suicidal Tendencies reformed in 1997 and have continued recording and performing ever since. After over a decade of work and many lineup changes, the band is planning to release first album with all-new material in 12 years in 2012. ==Discography== They made ten studio albums, one EP, four split albums, five compilation albums, and two long-form videos. ===Studio albums=== * Suicidal Tendencies (1983) * Join the Army (1987) * How Will I Laugh Tomorrow When I Can't Even Smile Today (1988) * Lights...Camera...Revolution! (1990) * The Art of Rebellion (1992) * Suicidal for Life (1994) * Freedumb (1999) * Free Your Soul and Save My Mind (2000) * 13 (2013) * World Gone Mad (2016) ===EPs=== * Six the Hard Way (1998) ===Split albums=== * Welcome to Venice (1985) * Friends & Family, Vol. 1 (1997) * Friends & Family, Vol. 2 (2001) * Year of the Cycos (2008) ===Compilation albums=== * Controlled by Hatred/Feel Like Shit...Déjà Vu (1989) * Still Cyco After All These Years (1993) * Prime Cuts (1997) * Playlist: The Very Best of Suicidal Tendencies (2010) * No Mercy Fool!/The Suicidal Family (2010) ===Videos and DVDs=== * Lights...Camera...Suicidal (1990) * Live at the Olympic Auditorium (2010) ==References== Category:1980s American music groups Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American heavy metal bands Category:American punk bands Category:Thrash metal bands Category:Musical groups from Los Angeles",
 "title": "Suicidal Tendencies"
}