{
 "id": "346933",
 "text": "\"My Heart Will Go On\" is a hit song by Canadian singer Celine Dion, used in the 1997 movie Titanic. Its music was composed by James Horner, while the lyrics were written by Will Jennings. The song won the Academy Award for Best Original Song. The song reached number one in over 10 countries. It became Dion's signature song, and helped her become a popular singer. It was the best-selling single of 1998, and one of the best-selling singles worldwide. ==Track listing== European CD single #\"My Heart Will Go On\" – 4:40 #\"Because You Loved Me\" – 4:33 European CD single #2 #\"My Heart Will Go On\" – 4:40 #\"My Heart Will Go On\" (Tony Moran mix) – 4:21 French CD single #\"The Reason\" – 5:01 #\"My Heart Will Go On\" – 4:40 French CD single #2 #\"My Heart Will Go On\" – 4:40 #\"Southampton\" – 4:02 French CD single #3 #\"My Heart Will Go On\" – 4:40 #\"My Heart Will Go On\" (Tony Moran mix) – 4:21 Japanese CD single #\"My Heart Will Go On\" – 4:40 #\"Beauty and the Beast\" – 4:04 UK cassette single #\"My Heart Will Go On\" – 4:40 #\"I Love You\" – 5:30 US CD single #\"My Heart Will Go On\" – 4:40 #\"Rose\" (instrumental) – 2:52 Australian/Brazilian/European/UK/Korean CD maxi single #\"My Heart Will Go On\" – 4:40 #\"Because You Loved Me\" – 4:33 #\"When I Fall in Love\" – 4:19 #\"Beauty and the Beast\" – 4:04 Australian CD maxi single #2 #\"My Heart Will Go On\" (Tony Moran mix) – 4:21 #\"My Heart Will Go On\" (Richie Jones mix) – 4:15 #\"My Heart Will Go On\" (Soul Solution) – 4:18 #\"Misled\" (The Serious mix) – 4:59 #\"Love Can Move Mountains\" (Underground vocal mix) – 7:10 Brazilian CD maxi single #2 #\"My Heart Will Go On\" (Cuca's radio edit) – 4:22 #\"My Heart Will Go On\" (Tony Moran's anthem edit) – 4:21 #\"My Heart Will Go On\" (Richie Jones unsinkable edit) – 4:15 #\"My Heart Will Go On\" (Tony Moran's anthem vocal) – 9:41 European CD maxi single #2 / UK 12\" single #\"My Heart Will Go On\" – 4:40 #\"My Heart Will Go On\" (Tony Moran mix) – 4:21 #\"My Heart Will Go On\" (Richie Jones mix) – 4:15 #\"My Heart Will Go On\" (Soul Solution) – 4:18 Japanese/Korean CD maxi single #\"My Heart Will Go On\" (Tony Moran mix) – 4:21 #\"My Heart Will Go On\" (Richie Jones mix) – 4:15 #\"My Heart Will Go On\" (Soul Solution) – 4:18 #\"My Heart Will Go On\" (Richie Jones unsinkable club mix) – 10:04 #\"My Heart Will Go On\" (Matt & Vito's unsinkable epic mix) – 9:53 UK CD maxi single #2 #\"My Heart Will Go On\" (soundtrack version) – 5:11 #\"Have a Heart\" – 4:12 #\"Nothing Broken But My Heart\" – 5:55 #\"Where Does My Heart Beat Now\" – 4:32 ==Charts and certifications== ===Weekly charts=== Chart (1997-1998) Peak position Australian Singles ChartAustralian Singles Chart 1 Austrian Singles ChartAustrian Singles Chart 1 Belgian Flanders Singles ChartBelgian Flanders Singles Chart 1 Belgian Wallonia Singles ChartBelgian Wallonia Singles Chart 1 Canadian BDS Airplay ChartCanadian BDS Airplay Chart 1 Canadian BDS Adult Contemporary Chart 1 Canadian RPM Top SinglesTop Singles - Volume 66, No. 23, March 02 1998 . Retrieved May 16, 2010. 1 Canadian RPM Adult ContemporaryAdult Contemporary - Volume 66, No. 18, January 26 1998 . Retrieved May 16, 2010. 1 Danish Singles ChartDanish Singles Chart 1 Dutch Singles ChartDutch Singles Chart 1 European Singles Chart 1 Finnish Singles ChartFinnish Singles Chart 1 French Singles ChartFrench Singles Chart 1 German Singles Chart 1 Greek Singles Chart 1 Irish Singles ChartIrish Singles Chart 1 Italian Singles Chart 1 Japanese Singles Chart 34 New Zealand Singles Chart 34 Norwegian Singles ChartNorwegian Singles Chart 1 Spanish Singles ChartSpanish Singles Chart 1 Swedish Singles ChartSwedish Singles Chart 1 Swiss Singles ChartSwiss Singles Chart 1 UK Singles ChartUK Singles Chart 1 US Billboard Hot 100[ Billboard Hot 100] 1 US Billboard Hot Adult Contemporary TracksHot Adult Contemporary Tracks 1 US Billboard Hot Adult Top 40 Tracks[ Hot Adult Top 40 Tracks] 3 US Billboard Hot Latin TracksHot Latin Tracks 1 US Billboard Latin Tropical Airplay[ Latin Tropical Airplay] 2 US Billboard Rhythmic Top 40[ Rhythmic Top 40] 3 US Billboard Top 40 MainstreamTop 40 Mainstream 1 ===End of year charts=== Chart (1998) Position Australia ARIA Singles Chart 1 Austrian Singles Chart 1 Belgian Singles Chart (Flanders) 1 Belgian Singles Chart (Wallonia) 1 Dutch Top 40 1 French Singles Chart (SNEP) 1 Swedish Singles Chart 1 Swiss Singles Chart 1 US Billboard Hot 100 13 ==References== Category:1997 songs Category:Best Original Song Academy Award-winning songs Category:Billboard Hot 100 number one songs Category:Celine Dion songs",
 "title": "My Heart Will Go On"
}