{
 "id": "347036",
 "text": "Irgun Zvai Leumi, commonly known as the Irgun (), was a Zionist paramilitary group in Mandatory Palestine between 1931 and 1948. ==History== ===Founding=== The Irgun was a Jewish insurgent group founded in 1931. * * * * * It was a rival to the Haganah, serving as an arm of the Revisionist Party. ===Activities=== The Irgun was labelled a terrorist organization in the 1940s due to its anticolonial insurgency against the British authorities. Not only was it involved in attacks on British military bases, but also it was important in organizing the escape of Jewish exiles from European countries, especially Nazi Germany, to Mandatory Palestine following the British publication of the British White Paper on Palestine (1939) to limit Jewish immigration. Many Irgun members were executed by the British authorities for their active resistance. Particularly, the Irgun is noted for its bravery. Irgun members once captured the Acre prison, a fortress built in the Middle Ages reportedly unconquerable by even Napoleon. The Irgun also captured much of Jaffa (Yafo) ‒ located in present-day northwestern Israel ‒ in the final days of British rule. ====King David Hotel bombing==== Irgun is well-known for the bombing of Jerusalem's King David Hotel in 1946. ==Legacy== Irgun is deemed an early version of Ḥerut which was an Israeli political party. Irgun is also an early version of today's Likud political party in Israel.Eisenstadt, S.N. (1985). The Transformation of Israeli Society, pp. 173–174. Due to Irgun's subscription to Revisionist Zionism, which is alleged to be maximalistOf or denoting an extreme opinion. Oxford Languages. by Western academic leftists who shape historiography, * * * * * * the Irgun is tainted with the stigma of terrorism in Western collective memory. ==Related pages== * Judaism * Antisemitism * The Holocaust * History of Jews * Anti- imperialism ==References== Category:Zionism Category:World War II Category:Jewish people Category:Jewish history Category:1931 establishments Category:History of Palestine Category:20th century in Asia Category:Arab–Israeli conflict Category:20th century in Israel Category:1948 disestablishments Category:National liberation movements Category:Nationalist organizations in Palestine",
 "title": "Irgun"
}