{
 "id": "347170",
 "text": ", also known as JSLJSL is an English acronym. JSL stands for \"Japanese Sign Language\". or NS,NS is a romaji acronym. NS stands for \"Nihon Shuwa\". is the main sign language in Japan. ==History== In 1878, the first school for the deaf was established in Kyoto. In 1900, the was founded. In 1948, Deaf children were required to attend school.Monaghan, Leila Frances. (2003). Many Ways to be Deaf: International Variation in Deaf Communities, p. 211. In the late-20th century, Japanese sign language began to be recognized.Nakamura, Karen. (2006). Deaf in Japan: Signing and the Politics of Identity, p. 9, citing Kimura, Harumi and Yasuhiro Ichida. 1995. \"Roubunka Sengen\" (An Explanation of Deaf Culture), Gendai Shisou, Vol. 23, No. 3, pp. 354-399. The Japanese Federation of the Deaf is for those Japanese whose primary language is JSL.Nakamura, Karen. \"Resistance and Co‐optation: the Japanese Federation of the Deaf and its Relations with State Power,\" Social Science Japan Journal (SSJJ) (2002) Vol. 5, No. 1, pp. 17-35. JSL has a friend in the Imperial family. Kiko, Princess Akishino has studied JSL and is a trained sign language interpreter.Imperial Household Agency. Their Imperial Highnesses Prince and Princess Akishino She also signs in informal Deaf gatherings. \"Princess Kiko chats with Deaf soccer players in sign language after film show,\" Deaf Japan News. September 7, 2010. In 2006, the Japanese government amended the \"Supporting Independence of People with Disabilities Act.\" The new language in the law encourages local governments to increase the number and use of JSL interpreters.Saruhashi, Junko and Yuko Takeshita. \"Ten Linguistic Issues in Japan: The Impact of Globalization,\" Organization for Economic Co-operation and Development ==Elements of Japanese Sign Language (JSL)== As in other sign languages, JSL (usually called simply 手話 shuwa, \"hand talk\") consists of words, or signs, and the grammar with which they are put together. ===Examples of JSL signs=== File:JSLbaiku.gif|A noun: \"bicycle\" File:JSLdesu001.gif|A verb: \"to be\" File:JSLcyuu.gif|A Chinese character: File:JSLdesuka001.gif|A grammatical particle: interrogative sentence ending ==References== ==Further reading== * Monaghan, Leila Frances. (2003). Many Ways to be Deaf: International Variation in Deaf Communities. Washington, D.C.: Gallaudet University Press. ; OCLC 248814292 * Nakamura, Karen. (2006). Deaf in Japan: Signing and the Politics of Identity. Ithaca: Cornell University Press. ; ; OCLC 238810838 ==Other websites== * Japanese Association of Sign Linguistics (JASL) *手話教室 (online JSL lessons and dictionary, in Japanese) *Online JSL dictionaries * Kyoto Prefectural Education Center Website with explanations in English Category:Japanese language Category:Sign languages",
 "title": "Japanese Sign Language"
}