{
 "id": "347159",
 "text": "CrazySexyCool is the second studio album by American girl group TLC. It was released on November 15, 1994 by LaFace Records. The album reached number three on the US Billboard 200, number two on the Top R&B;/Hip-Hop Albums and number four on the UK Albums Chart. The album became TLC's best-selling album, it was known as their \"breakthrough album\". Rolling Stone magazine ranked the album number 377 of the \"500 greatest albums of all time\" list. The album was certified 1x Diamond in the United States. TLC became the first and only girl group to have a diamond-certified album. The album features more of a R&B; and soul sound than hip hop sound due the fact that Left Eye wasn't able to record much of her own raps for the album due to being in rehab for setting her then- boyfriend's house on fire. == Release and reception == The album sold 127,000 copies on the first day of release. According to Nielsen SoundScan, the album has sold 7,200,000 copies in the United States. It was certified 1x Diamond, which means 10,000,000 copies of the album were shipped to the United States. The album was also certified 11x Platinum (11,000,000 copies shipped) by the RIAA. ==Track listing== # \"Intro-Lude\" (featuring Phife Dawg) – 1:01 (Jermaine Dupri) # \"Creep\" – 4:28 (Dallas Austin) # \"Kick Your Game\" – 4:14 (Dupri, Lopes, Seal) # \"Diggin' on You\" – 4:14 (Babyface) # \"Case of the Fake People\" – 4:04 (Dallas Austin) # \"Crazy Sexy Cool - Interlude\" – 1:42 (Combs, Thompson, Watkins) # \"Red Light Special\" – 5:04 (Babyface) # \"Waterfalls\" – 4:39 (Lopes, Ethridge, Organized Noize) # \"Intermission-Lude\" – 0:43 (Dupri) # \"Let's Do It Again\" – 4:16 (Babyface, Jon John) # \"If I Was Your Girlfriend\" (Prince) – 4:36 # \"Sexy - Interlude\" (featuring Puff Daddy) – 1:34 (Combs, Thomas) # \"Take Our Time\" – 4:33 (Hennings, Killings) # \"Can I Get a Witness - Interlude\" (featuring Busta Rhymes) – 2:57 (Combs, Rhymes, Thomas) # \"Switch\" – 3:30 (Dupri, Lopes, Seal) # \"Sumthin' Wicked This Way Comes\" (featuring Dré of OutKast) – 4:23 (Benjamin, Lopes, Ethridge, Organized Noize) == References == Category:1994 albums Category:TLC (group) albums Category:Hip hop soul albums Category:New jack swing albums Category:R&B; albums",
 "title": "CrazySexyCool"
}