{
 "id": "347373",
 "text": "Olga Tañón (born April 13, 1967) is a two-time Grammy Award and three-time Latin Grammy-winning Merengue and Latin Pop artist. Tañón has earned 5 Latin Grammy Awards and 28 Premios Lo Nuestro awards during her career. == Biography == Tañón is the youngest of four children born to José Tañón and Carmen Gloria Ortíz in the Santurce district of San Juan, Puerto Rico. She was raised in Levittown, a suburb of San Juan, in the municipality of Toa Baja, Puerto Rico, where she received her primary and secondary education. In 1992, Tañón signed a contract with the WEA Latina record label to record a solo album. Her first recorded album was titled \"Sola\" (Alone). Among the songs in the album were, \"Me Cambio por Ella\" (I Change Places With Her), and \"Quiero estar contigo\" (I Want To Be With You). In 1993, she recorded her second album for WEA Latina, \"Mujer de Fuego\" (Woman of Fire). Tañón also debuted as a composer with the song, \"Presencié tu Amor\" (I Witnessed Your Love).[3] That year, Tañón received three Lo Nuestro Awards nominations in the Tropical/Salsa field: Album of the Year (Sola), Female Artist and New Artist.[4] In 1994, Tañón earned her first double platinum record and in 1995, she earned 3 more platinum records with her album, \"Siente el Amor\" (Feel the Love). This album also included another of her compositions, \"Unicornio\" (Unicorn), which was written to the rhythm of Salsa and also included the unforgettable Merengue song, \"Es Mentiroso\" (He's a Liar). Tañón had gained fame and recognition throughout Latin America. Tañón recorded a Tex-Mex CD with Mexican singer Marco Antonio Solís, \"Nuevos Senderos\". She was now being heard internationally, and with that recording she became the first Puerto Rican musician to be certified by the RIAA to sell over half a million records. The lead single, the ballad \"Basta Ya!\" topped the U.S. Billboard Top Latin Tracks for several weeks and became Tañón's first #1.[3] For the album Tañón earned 3 Lo Nuestro Awards nominations for Pop Album of the Year, Pop Song of the Year and Pop Singer of the Year.[5] In 1997 Tañón debuted as an actress in the Puerto Rican version of the popular production of \"Jesus Christ Superstar\", produced by Rafo Muñiz. She played the part of Mary Magdalene. This version had a tropical feel to it and included some of Tañón's songs. In 1998, Tañón married Juan González a Puerto Rican major-league baseball star. They had a daughter, Gabriella Marie, but divorced in 1999.[3] In 2000 Tañón, now known as the \"Woman of Fire\" or \"Mujer de Fuego\" by her fans, recorded her first concert, titled, \"Olga Viva...Viva Olga\" in the House of Blues in Orlando, Florida. This production was named by the National Foundation of Popular Culture as one of the year's top 20 productions. The record went platinum and Tañón earned her first Grammy Award. In August 2000, Tañón sold out 12 shows in the Antonio Paoli Hall at the Luis A. Ferre Center of the Fine Arts in San Juan. Later that month she debuted in the Bass Performance Hall in Fort Worth, Texas. Her performances received rave reviews in the Fort Worth Star Telegram and the Dallas Morning News. At the end of 2000, Tañón presented her musical spectacular at Panama's Anayansi Theater and toured the southeastern United States with Mexican singer Alejandro Fernández.[3] In 2001 Tañón recorded a CD titled, \"Yo por Ti\" (Me for You), which won both American and Latin Grammys. The first single, Como Olvidar, topped the U.S. Billboard Top Latin Tracks. The CD became a best-seller in Puerto Rico, Latin America, and among the Hispanic population in the United States. In 2002 Tañón toured many countries, including Venezuela, Panama and the United States. That year she became the first merengue artist to successfully score a chart topper in the Middle East when her partnership with Egyptian music singer Hakim yielded the highly successful Arabian hit, Ah Ya Albi. In 2003, Tañón toured Europe and made a total of ten recordings for WEA Latina. In 2003 she released Sobrevivir and won her fourth Grammy. She also married Billy Denizard, with whom she had two sons, Indiana Noa and Ian Nahir.[3] As part of an international tour called \"Evolution Tour 2008\", Tañón traveled to Italy where she made a presentation at the Festival Latinoamericano on July 5, 2008.[6] In 2005, Tañón released her hit album, \"Una Nueva Mujer\", which won Best Contemporary Tropical Album at the 2006 Latin Grammys. In support of Latin American immigrants in the U.S., in 2006 Tañón recorded, \"Nuestro Himno\" in collaboration with Pitbull, Carlos Ponce, and Wyclef Jean. On May 2, 2010, Tañón first performed in Iquitos a concert where presented her classic songs. The concert was part of her tour, which started in Peru.[7][8] On February 22, 2007 Tañón won 3 awards at the 19th edition of Premio Lo Nuestro.[9] During the 2006 show, she won in the categories: \"Album of the Year\", \"Female Artist\" and \"Song of the Year\". She holds the record as the artist who has won the most \"Premio Lo Nuestro Awards\", with a total of 29. In June 2009, Tañón released a new hit single called \"Amor Entre Tres\" which is the theme song for the new soap opera in Venezuela called \"La Vida Entera.\" That month, WEA Latina released \"25 Exitos de Fuego Vol. 1 & Vol. 2.\" Each CD has a set of greatest hits through her entire career of merengue and Latin pop. In September 2009 participated, next to Juanes and other internationally acclaimed artists, in \"Concierto por la Paz\" at Plaza de la Revolucion in La Habana, Cuba.[3] In 2011 the first of three Tañon albums was released on the Mia Musa Label: \"Ni Una Lagrima más’\". In 2013 \"Una Mujer\" was released, and in 2017 \"Olga Tañon y Punto\". ==Discography== ;Studio Albums *1992: Sola *1993: Mujer de Fuego *1994: Siente el Amor... *1996: Nuevos Senderos *1997: Llévame Contigo *1998: Te Acordarás de Mí *2001: Yo por Ti *2002: Sobrevivir *2005: Una Nueva Mujer *2006: Soy Como Tú *2007: Exitos en 2 Tiempos *2011: Ni Una Lagrima Más ;EPs *2009: 4/13 ;Compilations *1995: Éxitos y Más *2003: Puro Fuego *2005: Como Olvidar: Lo Mejor de Olga *2006: 100% Merengue *2006: 25 Exitos de Fuego / Vol. 1 *2006: 25 Exitos de Fuego / Vol. 2 ;Live albums *1999: Olga Viva, Viva Olga (Live) *2008: Fuego En Vivo / Vol.1 \"Solo Exitos\" (Live) *2008: Fuego En Vivo / Vol.2 \"Solo Exitos\" (Live) ;DVDs *2002: Olga Viva, Viva Olga *2005: Como Olvidar: Lo Mejor de Olga (CD+DVD) *2005: Exitos en Video *2009: 4/13 (CD+DVD) ;Concerts *2010: Incomparable Tour Category:1967 births Category:Living people Category:Latin singers Category:Grammy Award winners Category:Singers from San Juan, Puerto Rico Category:Latin Grammy Award winners Category:Puerto Rican composers",
 "title": "Olga Tañón"
}