{
 "id": "347414",
 "text": "The Grand Duchy of Lithuania was a European state from the 12thT. Baranauskas. Lietuvos valstybės ištakos. Vilnius, 2000 –13th century until 1569. In 1569 it became a part of the Polish–Lithuanian Commonwealth until 1791. It was started by the Lithuanians.Rowell S.C. Lithuania Ascending: A pagan empire within east-central Europe, 1295-1345. Cambridge, 1994. p.289-290Ch. Allmand, The New Cambridge Medieval History. Cambridge, 1998, p. 731.Encyclopædia Britannica. Grand Duchy of Lithuania The duchy grew to include large parts of the former Kievan Rus' and other Slavic lands. It covered the land of present-day Belarus, Latvia, Lithuania and parts of Estonia, Moldova, Poland, Russia and Ukraine. At its biggest in the 15th century, it was the largest state in Europe.R. Bideleux. A History of Eastern Europe: Crisis and Change. Routledge, 1998. p. 122 There was great diversity in languages, religion, and cultural heritage. Bringing together of the Lithuanian lands began in the late 12th century. Mindaugas, the first ruler of the Grand Duchy, was crowned as Catholic King of Lithuania in 1253. The pagan state was targeted in the religious crusade by the Teutonic Knights and the Livonian Order. When Gediminas began to rule, he allowed people to have different religions.Rowell, Lithuania Ascending, p.289. This grew under his son Algirdas.Z. Kiaupa. \"Algirdas ir LDK rytų politika.\" Gimtoji istorija 2: Nuo 7 iki 12 klasės (Lietuvos istorijos vadovėlis). CD. (2003). Elektroninės leidybos namai: Vilnius. In 1386 Jogaila changed the religion to Catholicism. He also made a dynastic union between the Grand Duchy of Lithuania and the Kingdom of Poland.N. Davies. Europe: A History. Oxford, 1996, p. 392. Vytautas the Great grew the land of the Grand Duchy. He also led the defeat of the Teutonic Knights in the Battle of Grunwald in 1410. After Vytautas's death, Lithuania's relationship with the Kingdom of Poland was not good.J. Kiaupienė. Gediminaičiai ir Jogailaičiai prie Vytauto palikimo. Gimtoji istorija 2: Nuo 7 iki 12 klasės (Lietuvos istorijos vadovėlis). CD. (2003) Elektroninės leidybos namai: Vilnius. The Union of Lublin of 1569 created a new state, the Polish–Lithuanian Commonwealth. In this federation, the Grand Duchy of Lithuania had a separate government, laws, army, and treasury. D. Stone. The Polish-Lithuanian state: 1386-1795. University of Washington Press, 2001, p. 63. They were invaded by Russia in 1792. The land was divided out among the Russian Empire, Prussia and Austria in 1795. ==References== Lithuania, Grand Duchy Lithuania, Grand Duchy Category:Polish–Lithuanian Commonwealth",
 "title": "Grand Duchy of Lithuania"
}