{
 "id": "347438",
 "text": "The 1939 Soviet invasion of Poland was a Soviet military operation that started without a formal declaration of war on 17 September, 1939. It was during the early stages of World War II. After Nazi Germany had invaded Poland from the west on September 1. The Soviet Union invaded from the east and ended on 6 October 1939. Germany and the Soviet Union divided the whole of the Second Polish Republic.Gross pp. 17–18 In early 1939, the Soviet Union asked the United Kingdom, France, Poland, and Romania to make an alliance against Nazi Germany. The Soviet Union wanted Poland and Romania to let Soviet troops go through their territory,Watson p. 713 but Poland and Romania refused. The Soviet Union made a secret deal with Nazi Germany on 23 August. They planned to divide Northern and Eastern Europe into German and Soviet lands.Watson p. 695–722 One week later, German forces invaded Poland from the north, south, and west. Polish forces then withdrew to the southeast to wait for French and British support. The Soviet Red Army invaded the eastern Polish region of Kresy on 17 September.Kitchen p. 74Davies (1996) p. 440 The Soviet government used the excuse that it was acting to protect the Ukrainians and Belarusians, who lived in the eastern part of Poland.Degras pp. 37–45 The Soviet government took pver the area. In November 1939, it made the 13.5 million formerly-Polish citizens become Soviet citizens. The Soviets sent hundreds of thousands of people from the region to Siberia and other remote parts of the Soviet Union. Soviet forces stayed in eastern Poland until the summer of 1941, when the German Army invaded Operation Barbarossa. The area was under Nazi occupation until the Red Army reconquered it in the summer of 1944. An agreement at the Yalta Conference let the Soviet Union keep almost all of what it had occupied in the Second Polish Republic. The People's Republic of Poland got the southern half of East Prussia and lands east of the Oder-Neisse Line.Wettig p. 47 The Soviet Union put those areas into the Ukrainian Soviet Socialist Republic and the Byelorussian Soviet Socialist Republic. ==References== Category:1939 in Europe Category:1930s in Poland Category:20th century in Belarus Category:Invasions of World War II Category:1930s in the Soviet Union",
 "title": "Soviet invasion of Poland"
}