{
 "id": "347418",
 "text": "Kievan Rus' (also known as Kyivan Rus) was a medieval state in Europe. ==Overview== The Kievan Rus lasted from the late 9th to the mid 13th century. It broke apart under the Mongol invasion of 1237–1240. At its peak, it stretched from the Baltic Sea in the north to the Black Sea in the south, and from the upper Vistula in the west to the middle Volga in the east. ==Name== The state was called \"land of Rus'\" in broader sense. In the core sense, this term described the territory of Dnieper Ukraine, which served as the heartland of the state.Motsia, Oleksandr (2009). «Руська» термінологія в Київському та Галицько-Волинському літописних зводах [\"Ruthenian\" question in Kyiv and Halych-Volyn annalistic codes] (PDF). Arkheolohiia (1). doi:10.6084/M9.FIGSHARE.1492467.V1. ISSN 0235-3490. Archived (PDF) from the original on 2 February 2014. Retrieved 25 January 2023. Назаренко А. В. Глава I // Древняя Русь на международных путях: Междисциплинарные очерки культурных, торговых, политических связей IX—XII вв. — М.: Языки русской культуры, 2001. — c. 42—45, 49—50. — . The name \"Kievan Rus' \" was used in the 19th century to mean the time when the center was in Kyiv. ==History== The early part of the state is sometimes known as the \"Rus Khaganate\". The history of Rus' proper begins in 882. This is when prince Oleg seized Kyiv and became the first prince of Kyiv. This was after Varangians (Vikings), who were presumably led by Askold and Dir, became Kyiv's first Norse rulers and freed this slavic city from the Khazars' tribute. ===Peak=== The state reached its peak of power in the mid 11th century. Its lands went south to the Black Sea, east to the Volga, and west to the Kingdom of Poland and to the Duchy of Lithuania.; see also and Volodymyr the Great (980–1015) and his son Yaroslav I the Wise (1019–1054) ruled in the \"Golden Age\" of Kyiv. ===Breakup=== With the end of the Viking age, the state lost power in the late 11th and during the 12th century. The broke apart into various rival regional powers. ==Legacy== The modern East Slavic states of Ukraine, Belarus and Russia all claim to have got their identity from the early medieval state. ==Related pages== * Cossacks * Eastern Europe * Tsardom of Russia * Eastern Orthodox Church ==References== Category:Former countries in Europe Category:History of Belarus Category:History of Russia Category:History of Ukraine Category:880s establishments",
 "title": "Kievan Rus'"
}