{
 "id": "347444",
 "text": "The Linear Pottery culture was an important culture in the Neolithic (later Stone Age) of Europe. It existed between 5500–4500 BC. It is abbreviated as LBK and is also known as the Linear Band Ware, Linear Ware, Linear Ceramics or Incised Ware culture. Most evidence about LBK comes from Central Europe. LBK artifacts are important evidence about early farming in Europe. LBK was named after pottery that consists of simple cups, bowls, vases, and jugs without handles. They were used as kitchen dishes, or for carrying food and drink. The pots had line patterns on them. ==Farming== The LBK people lived over a period of 1000 years, long before the Bronze Age. They farmed crops like wheat, lentils, and peas. They also kept cows and dogs, and sometimes hunted other animals like deer in the forests around them. ==Food and health== Archaeological findings show that LBK people didn't grow as tall as the people who came before them or modern people. They probably didn't get enough energy (like carbohydrates) in their diet. Disease may have also played a part; it spread more easily in villages than it did before the Neolithic, when people were still moving about a lot and not seeing many other people. People in the LBK culture probably died quite young, in their twenties or thirties. Many children died before they grew up. If a person was very sick and in a lot of pain, the LBK people might have had access to opium to take away the pain. They probably knew how to help some illnesses by using wild herbs as medicine. ==Religion== The LBK people probably worshipped a mother goddess, who represented the fertility of the land they farmed. ==Tools== Because they lived before the Bronze or Iron Ages, the LBK people had no metal tools. Everything they had was made from stone, wood, plants (like flax, which could be made into clothing), or things that animals could provide (like leather or fur). The LBK people had sickles for cutting grass. These tools have a handle at one end and a half-moon-shaped blade on the other. Instead of using metal blades, LBK people used wood with sharp stone points glued on. ==Housing== The LBK people lived in rectangular longhouses made of wood, mud, and straw. They may have let their animals stay inside their homes. Archaeologists often find several clusters of about 6 of these longhouses in the same area. The people in nearby clusters of houses probably knew each other and shared or traded their goods. ==War== Some LBK settlements have palisades, or long walls around them, to defend against attackers. Also, some skeletons of LBK people look like they died from battle injuries, while others look like they may have even been eaten by cannibals. This shows that there was a lot of war between nearby groups. Important sites include Nitra in Slovakia; Bylany in the Czech Republic; Langweiler and Zwenkau in Germany; Brunn am Gebirge in Austria; Elsloo, Sittard, Köln-Lindenthal, Aldenhoven, Flomborn and Rixheim on the Rhine; Lautereck and Hienheim on the upper Danube; Rössen and Sonderhausen on the middle Elbe. The Excavations at Oslonki in Poland had a large fortified settlement. There were nearly 30 longhouses and over 80 graves there. This makes it one of the richest settlements which archaeologists have found in central Europe. Category:Archaeology Category:Stone Age Category:History of Europe",
 "title": "Linear Pottery culture"
}