{
 "id": "347696",
 "text": "Stanisław Moniuszko (May 5, 1819 in Ubiel, near Minsk – June 4, 1872 in Warsaw, Congress Poland) was a Polish composer, conductor and teacher. He is generally called the father of Polish national opera. ==Biography== ===Youth=== Moniuszko was born in Ubiel (Minsk district in modern Belarus) to a Polish-Armenian noble family of landowners. He showed an early ability in music, and began private piano lessons with August FreyerCulture.pl |Stanisław Moniuszko in 1827. Moniuszko began to formally study composition in Berlin with Karl Friedrich Rungenhagen, who also taught him in choral conducting. While in Berlin, he had an unexpected early success when he set three songs to the words of the Polish national poet, Adam Mickiewicz.EditionSilvertrust.com |Stanisław Moniuszko After three years in Berlin, he returned to Poland in 1840 to marry Aleksandra Müller. He got a job as an organist in Vilnius and also worked as a private piano tutor. The Moniuszkos had ten children. Around 1840, he began to compose strongly, writing his first operas and several other stage works, as well as sacred music and secular cantatas.Karadar.com |Stanisław Moniuszko During his lifetime Moniuszko traveled many times to St. Petersburg where his concerts were very well received. He was the mentor of César Cui. === Maturity === In 1848 in Vilnius, he staged and conducted the first performance of his opera Halka. After the triumph of his new four-act version of Halka at Warsaw on 1 January 1858, he toured France. It was soon later staged in Prague, Moscow and St. Petersburg, where it met with great success.Polish Art Center |Stanisław Moniuszko and His Operas On 1 August 1858 he was made conductor of the Polish Opera in the Grand Theatre in Warsaw. In 1864, Moniuszko started lecturing at the Music Institute in Warsaw, where he also directed a choir. His disciples included, among others, Zygmunt Noskowski and Henryk Jarecki. Stanisław Moniuszko died on 4 June 1872 in Warsaw of a sudden heart attack. He was buried in Powązki Cemetery. == Works == ===Stage works=== ==== Operettas ==== Work Form Composed Libretto Première Biuraliści (The Bureaucrats) operetta in one act c. 1835 I F Skarbeck unperformed Nocleg w Apeninach (A Night in the Apennines) operetta in one act c. 1837-9 A Fredro Vilnius, 1839 Cudowna woda (The Miraculous Water) operetta in two acts, lost except overture 1840-1 Ideał, czyli Nowe Precjoza (Perfection, or The New Preciosa) operetta in two acts c. 1841 O Milewski Vilnius, 1840 Karmaniol, czyli Francuzi lubią żartować (Carmagnole, or The French Like Joking) operetta c. 1840-1 O Milewski (after Théaulon de Torges and E Jaime) unperformed Nowy Don Kichot, czyl Sto szaleństw (The New Don Quixote, or 100 Follies) operetta in three acts 1841 A Fredro (after M de Cervantes) Lwów 1849 Warsaw, 1923 Żółta szlafmyca (The Yellow Nightcap) operetta c. 1841 F Zablocki lost Loteria (The Lottery) operetta in one act c. 1842-3 O Milewski Minsk, 1843 Cyganie (The Gypsies) (revised as Jawnuta 1860) operetta c. 1852 F D Kniaźnin Vilnius, 20 May 1852 Beata operetta in one act c. 1870-1 Jan Chęciński Warsaw, 2 February 1872 Pobór rekrutów (Conscription) operetta 1842 Vintsent Dunin-Martsinkyevich lost ==== Operas ==== Work Form Composed Libretto Première Halka (Helen) opera in two acts, later enlarged to four acts c. 1847-8 & 1857 Włodzimierz Wolski (after Kazimierz Władysław Wójcicki) Vilnius, 1 January 1848 Sielanka (Idyll) opera in two acts c. 1848? Vintsent Dunin-Martsinkyevich lost Betty comic opera in two acts c. 1852 F Schober (after Scribe and Melesville) Vilnius, 20 May 1852 Flis (The Raftsman) opera in one act c. 1858 S Boguslawski Warsaw, 24 September 1858 Rokiczana (The King of Peasants) incomplete c. 1859 J Korzeniowski unperformed Hrabina (The Countess) opera in three acts c. 1869 Włodzimierz Wolski Warsaw, 7 February 1860 Jawnuta opera in two acts c. 1860 Warsaw 5 June 1860 Verbum nobile opera in one act c. 1860 Jan Chęciński Warsaw, 1 January 1861 Straszny Dwór (The Haunted Manor) opera in four acts c. 1861-4 Jan Chęciński (after Kazimierz Władysław Wójcicki) Warsaw, 28 September 1865 Paria opera in three acts with prologue c. 1859-69 Jan Chęciński (after a play by Delavigne) Warsaw, 11 December 1869 Trea incomplete c. 1872 J Jasiński after a Femish legend unperformed Nowy dziedzic (The New Landlord) incomplete undated unperformed Sen wieszcza (The Seer's Dream) incomplete undated Władysław Syrokomla after J B Rosier and A de Leuven unperformed Walka muzyków (The Musicians' Struggle) incomplete undated Vintsent Dunin-Martsinkyevich lost ==== Ballet ==== *Monte Christo, after Alexandre Dumas (1866) *Na kwaterunku (On the Bilet) (1868) *Figle szatana (Satan's Tricks aka Devil's Frolics) (1870) *Merry Wives of Windsor (c. 1849), ballet music composed for the opera of Otto Nicolai ==== Theatre ==== *Kasper Hauser (1843), melodrama by Anicet, Bourgeois and d'Ennery. First performance: Minsk, November 18, 1843 *Sabaudka (Savoyardess or the Mother's Blessing) melodrama in 5 acts by d'Ennery and Lemoine. First performance: Vilnius, May 6, 1845 *Hamlet. Shakespeare's tragedy. First performance: Warsaw, March 24, 1871 *Zbojcy (Die Rauber). Schiller's tragedy. First performance: Warsaw 1870 and 1871 *Hans Mathis, drama (1872). Finished by Adam Munchheimer *Karpaccy gorale, drama by J. Korzeniowski === Vocal=== ==== Cantatas ==== Work Form Composed Text Première Milda cantata for solo voices, mixed choir and orchestra 1848 J.I. Kraszewski, after Witolorauda Vilnius, 18 December 1848 Nijoła (Wundyny cantata for solo voices, mixed choir and orchestra after 1848 partly from Witolorauda Vilnius, 8 March 1852 Florian Szary (The Grey) ballad from unfinished opera Rokiczana for baritone solo, choir and orchestra 1858-9 J. Korzeniowski Warsaw, 16 December 1860 Widma (The Ghosts) cantata for solo voices, mixed choir and orchestra before 1859 Adam Mickiewicz, after Dziady (The Forefathers) Warsaw, 1865 Sonety krymskie (Crimean Sonnets) cantata (8 sonnets) for solo voices, mixed choir and orchestra 1867 Adam Mickiewicz Warsaw, 16 February 1868 Pani Twardowska ballad for solo voices, choir and orchestra 1869 Adam Mickiewicz Warsaw, December, 1869 Kurmine cantata unfinished ==== Sacred ==== Work Form Composed Text Première Litanie ostrobramskie (Litanies of Ostra Brama) no.1 solo voices, mixed choir, organ and orchestra 1843 Latin Mass in A minor soprano, alto and organ 1848 A.E. Odyniec Litanie ostrobramskie (Litanies of Ostra Brama) no.2 solo voices, mixed choir, organ and orchestra 1849 Latin Funeral mass in D minor 4-part mixed choir and organ 1850 F. Felinski Litanie ostrobramskie (Litanies of Ostra Brama) no.3 solo voices, mixed choir, organ and orchestra 1854 Latin Litanie ostrobramskie (Litanies of Ostra Brama) no.4 solo voices, mixed choir, organ and orchestra 1855 Latin Mass in E minor 2 sopranos, alto and organ 1855 A.E. Odyniec (Polish), Achilles Bonoldi (Latin) Mass in E-flat major solo voices, mixed choir, organ and string quintet 1865 Latin Mass in B-flat major \"Piotrowinska\" (Piotrowin Mass) solo voices, mixed choir and organ 1872 Warsaw, 19 May 1872 Oto drzewo krzyza (Ecce lignum crucis) motet for baritone solo, mixed choir and organ 1872 Latin or Polish translation by M. Kotarbinski Warsaw, 29 March 1872 Modlitwa Panska \"Ojcze nasz\" (The Lord's Prayer \"Our Father\") 4-part mixed choir and orchestra or organ Warsaw, 17 June 1859 Psalm \"Ne memineris\" solo voices, mixed choir, organ and string quintet Latin Psalm \"Vide humilitatem meam\" mixed choir, sting quintet and organ Polish Requiem aeternum 11 solo voices, mixed choir and orchestra ==== Songs ==== More than 300, listing the most popular: *Chochlik (The Imp). Text by A.E. Odyniec *Czaty (The Ambush), ballad. Text by A. Mickiewicz. Also in a version with orchestra *Czarny krzyżyk (The Little Black Cross). Text by Bruno Bielawski. *Dziad i baba (The Old Man and The Old Woman). Text by J.I. Kraszewski *Dziadek i babka (Grandpa and Grandma). Text by P. Jankowski *Entuzjasta (The Enthusiast). Text by J. Prusinowski *Kozak (Cossack). Also known as Tam na gorze jawor stoi *Kum i kuma (Chums). Text by J. Czeczot *Łzy (Tears). Text by A.E. Odyniec *Maciek. Text by T. Lenartowicz *Magda karczmarka (Magda, the Innkeeper). Also known as W pustej karczmie Magda siedzi, ballad. Text by E. Sztyrmer *Nad Nidą (On Nida River). Text by Włodzimierz Wolski *Panicz i dziewczyna (The Young Master and The Girl). Also known as W gaiku zielonym. Text by A.E. Odyniec *Pieśń wieczorna (The Song at Dusk). Also known as Po nocnej rosie. Text by W. Syrokomla *Piosnka żołnierza (Soldier's Song). Also known as Już matka zasnęła. Text by J. Korzeniowski *Polna różyczka (The Little, Field Rose). Text by J. Grajnert *Powrót taty (Father's Return). Text by A. Mickiewicz *Prząśniczka (The Spinner). Text by J. Czeczot. Also in a version with orchestra *Rozmowa (Conversation). Also known as Kochanko moja, na co nam rozmowa. Text by A. Mickiewicz *Rybka (The Fish). Text by A. Mickiewicz *Świerszcz (The Cricket). Text by J.N. Kaminski *Świtezianka (The Nymph of Lake Switez). Text by A. Mickiewicz *Tren X (Lament No. X). Also known as Urszulo moja wdzieczna. Text by J. Kochanowski *Trzech Budrysów (Three Budryses). Text by A. Mickiewicz. Also in a version with orchestra *Trzy śpiewy: Niepewnosc, Pieszczotka, Sen (Three Chants: Uncertainty, Cuddlesome One, Dream). Text by A. Mickiewicz. German translation Blankensee *Wilija (Christmas Eve). Text by A. Mickiewicz *Znaszli ten kraj (Do You Know Such Land). Text by A. Mickiewicz, after J. W. Goethe === Instrumental === ==== Chamber ==== *String quartet no.1 in D minor (1839) *String quartet no.2 in F major (before 1840) ==== Organ ==== *Organ compositions on the themes of church songs, among others Vespers and Song of Ostra Brama. Published: Warsaw, 1862. ==== Piano ==== *Fraszki (Trifles). Two books. Published: Vilnius, 1843 *Nocturne in A-flat major. Published: Vilnius, 1846 *Mazurka in D major. Published: Vilnius, before 1846 *Six Polonaises. Published: Vilnius, 1846 *Polka in C major. Published: Warsaw, 1851 *Polka, \"Daniel\". Published: Warsaw, 1852 *Polka, \"Gabirela\". Published: Warsaw, 1855 *\"Spring\" Polka. Published: Warsaw, 1860 *Vilanelle in B flat major. Published: Warsaw, 1851 *Three Waltzes. Published: Warsaw, 1852 *\"Wedding\" Mazurka. Published: Warsaw, 1872 *Kolysanka (Cradle Song) in D major. Published: Warsaw, 19 March 1872 *Piano transcriptions of opera fragments and of works by other composers, among others Six Polonaises of Michal Oginski. Published: Warsaw, before 1858 *Original compositions and transcriptions for piano duet ==== Symphonic ==== *Bajka (Fairytale), fantastic overture (1848). Two versions. First performed: Vilnius, 1 May 1848 *Kain, overture (1856). First performance: St. Petersburg, March 1856 *War Overture. First performance: Vilnius, 19 March 1857 *Polonez koncertowy (concert polonaise) in A major, for large orchestra (1866) *Polonez obywatelski, civic polonaise in F major (after 1863) == Recordings == Due to the current obscurity of Moniuszko outside Poland, this list more or less represents a complete discography. === Opera === *Halka: Andrzej Hiolski, Barbara Zagorzanka, Jerzy Ostapiuk, Ryszarda Racewicz, Wieslaw Ochman. Robert Satanowski cond., Polish National Opera Orchestra & Chorus. 2 CDs, DDD, CPO Records, Live (recorded 1987?), 18 January 1995 *Halka (highlights): Andrzej Hiolski, Edmund Kossowski, Barbara Nieman, Halina Slonicka, Bohdan Paprocki. Zdizislaw Gorzynski cond., Polish National Opera Orchestra & Chorus. CD, Polskie Nagrania Muza, 6 April 1994 (originally 1992) *Halka: Harmonia Mundi/Chant du Monde? *Halka: Tatiana Zacharczuk, Władimir Kuzmienko, Zbigniew Macias, Katarzyna Suska, Piotr Nowacki. Antoni Wicherek cond., Soloists, Choir, Ballet and Orchestra of The Great Theatre National Opera in Warsaw. DVD, 2h10m, ZPR Records, 1999 *Halka: Tatiana Borodina, Oleh Lykhach, Aleksandra Buczek, Mariusz Godlewski, Radosław Żukowski, Zbigniew Kryczka, Jacek Ryś, Rafał Majzner, Andrzej Kalinin, Rafał Majzner, Janusz Zawadzki. Ewa Michnik cond., Wroclaw Opera Orchestra, Chorus & Ballet. DVD, 2h16m, subtitles in Polish, English, German. DUX Recording Producers/Metronome, 19 March 2007. Cat. no DVD : DUX 9538, Barcode: 5902547095387 *Hrabina: Halina Slonicka, Agnieszka Kossakowska, Edmund Kossowski, Kazimierz Pustelak, Bogna Sokorska. Mieczysław Mierzejewski cond., Orchestra & Choir Teatru Wielkiego w Warszawie. CD, Polskie Nagrania Muza, 2004 *The Haunted Manor: Adam Kruszewski, Iwona Hossa, Jacek Parol, Anna Lubanska, Krzysztof Szmyt, Dariusz Stachura, Piotr Nowacki, Stefania Toczyska, Zbigniew Macias, Romuald Tesarowicz, Agnieszka Zwierko. Jacek Kasprzyk cond., Wielki Theatre Orchestra. 2 CDs, DDD, EMI Classics, Studio, 13 July 2004 *The Haunted Manor: Bozena Betley-Sieradzka, Wiera Baniewicz, Zdzislaw Nikodem, Wieslaw Ochman, Andrzej Hiolski, Leonard Mroz, Andrzej Saciuk, et al. Jan Krentz cond., Orchestra & Choir of the PRiTV, Kraków. 4 CDs, Polskie Nagrania Muza, 1 January 2003. SX 0253 *The Haunted Manor: Andrzej Hiolski, Bernard Ładysz, Bogdan Paprocki, Halina Słonicka, Zdzisław Nikodem. Witold Rowicki cond., Orchestra & Choir Teatru Wielkiego w Warszawie. Polskie Nagrania Muza, 1992. PNCD093 *The Haunted Manor: Bogdan Paprocki, Edmund Kossowski, Antonina Kawecka, Marian Woźniczko, Barbara Kostrzewska, Felicja Kurowiak, Radzisław Peter, Zygmunt Mariański, Henryk Łukaszek, et al. Walerian Bierdajew cond., Poznań Opera. Early 1950s *Verbum Nobile: Andrzej Kizewetter, Krystyna Pakulska, Marian Kondella, Jan Czekay, Edward Kmiciewicz. Robert Satanowski, cond., Orchestra & Choir Państwowej Opery. CD, AAD, 1h5m, Polskie Nagrania Muza, 1993. PNCD 247 === Vocal === *Canons: Krzysztof Szmyt, Pawel Skaluba, Piotr Kusiewicz, Ryszard Minkiewicz. CD, DDD, DUX Recording Producers, 27 March 2001 *Litanies of Ostra Brama: Czeslaw Galka, Anna Lubanska, Iwona Hossa, Adam Zdunikowski. Henryk Wojnarowski cond., Warsaw Philharmonic Chamber Orchestra. CD, CD Accord, 5 September 2006 *Religious Songs: Andrzej Hiolski, Jaroslaw Malanowicz, Joanna Kozlowska, Piotr Kusiewicz. CD, DDD, CD Accord, 26 June 2001 *Religious Works: Marian Sawa, Witold Pilewski, Anna Malewicz, Krystyna Szoslek-Radkowa, Krystyna Szostek-Radkowa, et al. Edmund Kajdasz cond., Warsaw Chamber Orchestra. CD, ADD, Olympia, 4 October 1993 *Śpiewnik domowy I: Bożena Betley, Alina Bolechowska, Maria Fołtyn, Jadwiga Romańska, Hanna Rumowska-Machnikowska, Halina Szymulska. CD, Polskie Nagrania Muza, 1996. PNCD348 *Śpiewnik domowy II: Andrzej Hiolski, Bernard Ładysz, Wiesław Ochman, Maciej Witkiewicz. CD, Polskie Nagrania Muza, 1996. PNCD349 === Instrumental === *Opera Overtures: Grzegorz Fitelberg; Jan Krenz; Witold Rowicki cond., Polish Radio Orchestra & Chorus Katowice; Warsaw National Philharmonic Orchestra. CD, ADD, Olympia, 4 October 1993 *Overtures: Robert Satanowski cond., Filharmonia Pomorska Bydgoszcz. CD, DDD, CPO Records, 25 January 1995 *Overtures & Dances: Roland Bader cond., Kraków Philharmonic Orchestra. CD, DDD, Koch Schwann, 21 January 1997 *String Quartets (w/ Ignacy Feliks Dobrzyński): Camerata Quartet. CD, DDD, DUX Recording Producers, 29 May 2007 *Новае неба Станіслава Манюшкі: Classic Avantgarde ensemble (Belarus). CD, 2008. *Mazur from Act IV Straszny Dwór with Warsaw Philharmonic Orchestra under the direction of Witold Rowicki, 1967, Orchestral CDs, CD12/2011 == References == Category:Polish conductors Category:Deaths from myocardial infarction Category:Polish composers Category:Romantic composers Category:1819 births Category:1872 deaths",
 "title": "Stanisław Moniuszko"
}