{
 "id": "347766",
 "text": "This is a list of World Heritage Sites in Switzerland with cultural and natural heritage in Switzerland that are in UNESCO's World Heritage List.Switzerland. UNESCO World Heritage Centre. Retrieved on 6 April 2012. Currently, eleven properties are on the World Heritage List. Eight of these are cultural properties and three are natural properties. The first three were added to the list in 1983 and the latest in 2011. == Sites == Site Image Location Criteria Area ha (acre) Year Description Benedictine Convent of St John at Müstair SwitzerlandMüstair, Cultural:SwiMus (iii) 1983 The Convent of Müstair is a Christian monastery from the Carolingian period. It has Switzerland's greatest series of figurative murals, painted c. 800 AD, along with other Romanesque art and designs. / Le Locle, Watchmaking Town Planning Switzerland, Cultural:SwiNeu (iv) 2009 The site has two towns close to one another in a remote environment in the Swiss Jura mountains. Due to poor agricultural land, the watchmaking industry developed in the towns in the 19th century. After several devastating fires the towns were rebuilt to support this single industry. The town of La Chaux-de-Fonds was described by Karl Marx as a “huge factory-town” in Das Kapital where he analyzed the division of labour in the watchmaking industry of the Jura. Convent of St Gall SwitzerlandSt. Gallen, Cultural:SwiStGal (ii), (iv) 1983 The Carolingian Convent of St Gall was one of the most important in Europe. It was in operation from the 8th century to its secularization in 1805. Its library is one of the richest and oldest in the world and has a number of precious manuscripts such as the Plan of Saint Gall. Parts of the building were rebuilt in the Baroque style. Lavaux, Vineyard Terraces Switzerland, Cultural:SwiVau (iii), (iv), (v) 2007 The Lavaux Vineyard Terraces go for about along the south-facing northern shores of Lake Geneva from Chillon Castle to the eastern outskirts of Lausanne in the Vaud region. The current terraces can be traced back to the 11th century, when Benedictine and Cistercian monasteries controlled the area. Monte San Giorgio SwitzerlandTicino, * * Natural:SwiCanTic (viii) 2010 The pyramid-shaped, wooded mountain of Monte San Giorgio beside Lake Lugano is regarded as the best fossil record of marine life from the Triassic Period (245–230 million years ago). The sequence records life in a tropical lagoon environment, sheltered and partially separated from the open sea by an offshore reef. Diverse marine life flourished within this lagoon, including reptiles, fish, bivalves, ammonites, echinoderms and crustaceans. Because the lagoon was near land, the remains also include land-based fossils of reptiles, insects and plants, resulting in an extremely rich source of fossils. Old City of Berne SwitzerlandBern, Cultural:SwiCanBer (iii) 1983 Founded in the 12th century on a hill site surrounded by the Aare River, Bern developed along the peninsula. Following a devastating fire, the entire town was rebuilt in a unified style. The early wooden buildings were replaced with sandstone, followed by arcades in the 15th century arcades and fountains in the 16th century. The medieval town was rebuilt in the 18th century, but retained its earlier character. Prehistoric pile dwellings around the Alps Austria*, *, *, *, *, * Cultural:Swi (iv), (v) 2011 Has 111 small individual sites with the remains of prehistoric pile-dwelling (or stilt house) settlements in and around the Alps built from around 5000 to 500 B.C. on the edges of lakes, rivers or wetlands. While only some of the sites have been excavated, they contain a wealth of information on life and trade in agrarian Neolithic and Bronze Age cultures in Alpine Europe. Fifty-six of the sites are in Switzerland. Rhaetian Railway in the Albula / Bernina Landscapes SwitzerlandGraubünden and Tirano, * * Cultural:SwiGra (ii) (iv) 2008 The Rhaetian Railway in the Albula / Bernina Landscapes, brings together two historic railway lines that cross the Swiss Alps through those two passes. The railways provided a rapid and easy route into many formerly isolated alpine settlements. Building the railroads required overcoming a number of technical challenges with bridges and tunnels. Swiss Alps Jungfrau- Aletsch Switzerland, Natural:SwiBer2 (vii), (viii), (ix) 2007 The site includes several of the highest mountains in the Central Alps along with the largest glacier in Eurasia. The landscape gives information on the succession of plants after the retreat of a glacier and allows study of the retreat of glaciers resulting from climate change. The impressive landscape has also played an important role in European art, literature, mountaineering and tourism. Swiss Tectonic Arena Sardona Switzerland, Natural:SwiCanGla (viii) 2008 The Swiss Tectonic Arena Sardona in the north-eastern part of the country covers a mountainous area with seven peaks that rise above . The area has an exceptional example of mountain building through continental collision and displays a clear example of tectonic thrust, i.e. the process where older, deeper rocks are carried onto younger, shallower rocks. The site has been a key site for the geological sciences since the 18th century. Three Castles of Bellinzona SwitzerlandBellinzona, Cultural:SwiCanTic (iv) 2000 The Bellinzona site has a group of fortifications grouped around the castle of Castelgrande, which stands on a rocky peak looking out over the entire Ticino valley. Running from the castle, a series of fortified walls protect the ancient town and block the passage through the valley. A second castle (Montebello) forms an integral part of the fortifications, while a third but separate castle (Sasso Corbaro) was built on an isolated rocky promontory south-east of the other fortifications. ==References== * Category:Switzerland-related lists Switzerland",
 "title": "List of World Heritage Sites in Switzerland"
}