{
 "id": "347776",
 "text": "The List of World Heritage Sites in Russia is a group of places chosen by UNESCO, the United Nations Educational, Scientific and Cultural Organization. ==History== UNESCO was created for the \"conservation and protection of the world’s inheritance of books, works of art and monuments of history and science\". The constitution of UNESCO was ratified in 1946 by 26 countries.UNESCO, \"Constitution\"; retrieved 2012-7-18. Russia agreed to take part in the World Heritage Convention in 1988.UNESCO, \"States Parties: Ratification Status\"; retrieved 2012-7-18. ==List== The World Heritage Site (WHS)WHS is an acronym. WHS stands for \"World Heritage Site\". list has developed over time. It is part of a process; and the list continues to grow. There are 24 WHS places in the Russian Federation.UNESCO, \"Russian Federation\"; retrieved 2012-7-18. Name Image Federal subject Date UNESCO data Description Ref(s) Natural Central Sikhote-Alin Primorsky Krai -- The Sikhote-Alin mountain range has one the richest and most unusual temperate forests of the world. The site goes from the peaks of Sikhote-Alin to the Sea of Japan. It is important for the survival of many endangered species such as the Amur tiger. Curonian Spit Kaliningrad Oblast -- Human habitation of this long sand dune peninsula, 98 km long and 0.4–4 km wide, dates back to prehistoric times. Through this period it has been threatened by the natural forces of wind and waves. Its survival to the present day has been made possible only as a result of human efforts to stop the erosion of the Spit. Golden Mountains of Altai Altai Republic -- The Altai mountains in southern Siberia form the major mountain range in the western Siberia. The total area covers 1,611,457 ha. The site is also an important habitat for endangered animal species such as the snow leopard. Lake Baikal Irkutsk Oblast and Republic of Buryatia -- In south-east Siberia, the 3.15-million-ha Lake Baikal is the oldest (25 million years) and deepest (1,700 m) lake in the world. It has 20% of the world's total unfrozen freshwater reserve. Known as the 'Galapagos of Russia', its age and isolation have made one of the world's richest and most unusual freshwater faunas. Natural System of Wrangel Island Reserve Chukotka Autonomous Okrug -- Well above the Arctic Circle, the site includes the mountainous Wrangel Island (7,608 km2), Herald Island (11 km2) and surrounding waters. The island has the world’s largest population of Pacific walrus and the highest density of ancestral polar bear dens. It is a major feeding ground for the grey whale and the northernmost nesting ground for 100 migratory bird species, many endangered. Currently, 417 species and subspecies of vascular plants have been identified on the island, double that of any other Arctic tundra territory of comparable size and more than any other Arctic island. Putorana Plateau Krasnoyarsk Krai -- This site covers the same area as the Putoransky State Nature Reserve. It is in the central part of the Putorana Plateau in northern Central Siberia. It is about 100 km north of the Arctic Circle. Uvs Nuur Basin Tuva Republic -- The Uvs Nuur Basin (1,068,853 ha), is the northernmost of the enclosed basins of Central Asia. It takes its name from Uvs Nuur Lake, a large, shallow and very saline lake, important for migrating birds, waterfowl and seabirds. Virgin Komi Forests Komi Republic -- The Virgin Komi Forests cover 3.28 million ha of tundra and mountain tundra in the Urals. The large area of conifers, aspens, birches, peat bogs, rivers and natural lakes has been monitored and studied for over 50 years. It provides valuable evidence of the natural processes affecting biodiversity in the taiga. Volcanoes of Kamchatka Kamchatka Krai -- This is one of the most outstanding volcanic regions in the world. There are many active volcanos, a variety of types, and a wide range of related features. The sites has great species diversity, including the world's largest known variety of salmonoid fish and exceptional amounts of sea otter, brown bear and Stellar's sea eagle. Western Caucasus Krasnodar Krai and Republic of Adygea -- The Western Caucasus is one of the few large mountain areas of Europe that has not had large human impact. Cultural Cultural Cultural Cultural Cultural Cultural Cultural Architectural Ensemble of the Trinity Sergius Lavra Sergiev Posad, Moscow Oblast 14th century on This is a fine example of a working Orthodox monastery, with military features that are typical of the 15th to the 18th century, the period during which it developed. The main church of the Lavra, the Cathedral of the Assumption (echoing the Kremlin Cathedral of the same name), has the tomb of Boris Godunov. Among the treasures of the Lavra is the famous icon, The Trinity, by Andrei Rublev. Church of the Ascension Kolomenskoye, Moscow 16th century The Church of the Ascension was built in 1532 on the imperial estate of Kolomenskoye, near Moscow. It was made to celebrate the birth of the prince who was to become Tsar Ivan IV ('the Terrible'). It was one of the earliest examples of a traditional wooden tent-roofed church on a stone and brick substructure. It had a great influence on the development of Russian ecclesiastical architecture. Citadel, Ancient City and Fortress Buildings of Derbent Derbent, Republic of Dagestan 6th century on The Citadel, Ancient City and Fortress Buildings of Derbent were part of the northern lines of the Sasanian Persian Empire, which went east and west of the Caspian Sea. The fortification was built in stone. It had two parallel walls that formed a barrier from the seashore up to the mountain. The town of Derbent was built between these two walls, and has retained part of its medieval fabric. The site continued to be of great strategic importance until the 19th century. Ensemble of the Ferapontov Monastery Vologda Oblast 14th century on The Ferapontov Monastery, in the Vologda region in northern Russia, is very well-preserved. It is a complete example of a Russian Orthodox monastic complex of the 15th-17th centuries. Ensemble of the Novodevichy Convent Moscow, Moscow Oblast 16th century on The Novodevichy Convent, in south-western Moscow, built in the 16th and 17th centuries in the so-called Moscow Baroque style, was part of a chain of monastic ensembles that were added into the defence system of the city. The convent was directly associated with the political, cultural and religious history of Russia. It was closely linked to the Moscow Kremlin. It was used by women of the Tsar’s family and the aristocracy. Members of the Tsar’s family and entourage were also buried in its cemetery. The convent provides an example of the highest accomplishments of Russian architecture with rich interiors and an important collection of paintings and artefacts. Historic and Architectural Complex of the Kazan Kremlin Kazan, Republic of Tatarstan 16th-19th century Built on an ancient site, the Kazan Kremlin dates from the Muslim period of the Golden Horde and the Kazan Khanate. It was conquered by Ivan the Terrible in 1552 and became the Christian See of the Volga Land. The only surviving Tatar fortress in Russia and an important place of pilgrimage, the Kazan Kremlin has an outstanding group of historic buildings dating from the 16th to 19th centuries. Historic Centre of St. Petersburg and Related Groups of Monuments Saint Petersburg, Leningrad Oblast 18th-19th century The 'Venice of the North', with its numerous canals and more than 400 bridges, is the result of a vast urban project begun in 1703 under Peter the Great. Later known as Leningrad (in the former USSR), the city is closely associated with the October Revolution. Historic Centre of the City of Yaroslavl Yaroslavl, Yaroslavl Oblast 16th century on The historic city of Yaroslavl developed into a major commercial centre from the 11th century. It is known for its many 17th-century churches. It is an outstanding example of the urban planning reform Empress Catherine the Great ordered for the whole of Russia in 1763. While keeping some of its significant historic structures, the town was renovated in the neoclassical style. It has also kept elements from the 16th century in the Spassky Monastery, one of the oldest in the Upper Volga region. Historic Monuments of Novgorod and Surroundings Novgorod Oblast 11th-17th century Novgorod was Russia's first capital in the 9th century. Kizhi Pogost Karelia, Republic of Karelia 18th-19th century The pogost of Kizhi (i.e. the Kizhi enclosure) is on one of the many islands in Lake Onega, in Karelia. Two 18th-century wooden churches, and an octagonal clock tower, also in wood and built in 1862, can be seen there. Moscow Kremlin and Red Square Moscow, Moscow Oblast 13th-20th century The Kremlin (built between the 14th and 17th centuries by outstanding Russian and foreign architects) was the home of the Great Prince and also a religious centre. At the foot of its ramparts, on Red Square, St Basil's Basilica is one of the most beautiful Russian Orthodox monuments. Cultural and Historic Ensemble of the Solovetsky Islands Solovetsky Islands, Arkhangelsk Oblast 15th century The Solovetsky archipelago has six islands in the western part of the White Sea, covering 300 km2. People have lived there since the 5th century B.C. Important traces of a human presence from as far back as the 5th millennium B.C. can be found there. Struve Geodetic Arc Gogland, Leningrad Oblast 19th century The Struve Arc is a chain of survey triangulations going from Hammerfest in Norway to the Black Sea, through 10 countries and over 2,820 km. These made the first accurate measuring of a long segment of a meridian. White Monuments of Vladimir and Suzdal Vladimir Oblast 12th-13th century These two artistic centres in central Russia hold an important place in the country's architectural history. There are a number of magnificent 12th- and 13th-century public and religious buildings, above all the masterpieces of the Collegiate Church of St Demetrios and the Cathedral of the Assumption of the Virgin. *1:(shared with Lithuania) *2:(shared with Belarus, Estonia, Finland, Latvia, Lithuania, Republic of Moldova, Norway, Sweden, Ukraine) *3:(shared with Mongolia) ===Tentative list=== The Tentative List consists of sites which have been nominated. The evaluation process is not yet completed. * Historical and Cultural Jeyrakh-Assa Reservation * The architectural and historical complex \"Shelter of count N.P. Cheremetev\" * The Valamo archipelago * The National Park of Vodlozerof * The Bolgar historical- architectural complex * The ensemble of former city building of Sviyazhsk * Centre historique d'Irkoutsk * Cathedral of Christ the Saviour * Rostov Kremlin * Railway Bridge Over Yenissey River * Historic Center of the Yenisseisk * Church of Prince Dimitri \"On Blood\" * Great Pskov * Petroglyphs of Sikachi-Alyan * Daurian Steppes (Daursky State Biosphere Reserve) * The Commander Islands (Comandorsky State Nature Reserve) * Magadansky State Nature Reserve * Krasnoyarsk Stolby * The Great Vasyugan Mire * Ensemble of the Astrakhan Kremlin * The Ilmensky mountains * The archeological site of Tanais * Russian Kremlins * Bikin River Valley (Extension of the \"Central Sikhote- Alin\") * Architectural and Park Ensemble \"Tsar's Country Estate Izmaylovo\" * Bashkir Ural ==Related pages== *World Heritage Committee *UNESCO World Heritage Site *Table of World Heritage Sites by country *List of World Heritage Sites in Asia *List of World Heritage Sites in Europe ==References== ==Other websites== * List of biosphere reserves which are wholly or partially world heritage sites Category:World Heritage Sites in Russia Category:Russia- related lists Russia",
 "title": "List of World Heritage Sites in Russia"
}