{
 "id": "347764",
 "text": "This is a list of World Heritage Sites in the Netherlands with properties of cultural and natural heritage in the Netherlands that are on UNESCO's World Heritage List.Netherlands. UNESCO World Heritage Centre. Retrieved on 2012-01-21. Currently, nine properties in the Netherlands and Curaçao are on the World Heritage List. Eight of these are cultural properties and one is a natural property. The first was added to the list in 1995 and the latest in 2010. Seven properties are in the Netherlands, one is in Curaçao, and one is in both the Netherlands and Germany. The Wadden Sea is in the Netherlands, Germany, and Denmark, but only the Dutch and German parts are on the World Heritage List. ==Properties on the World Heritage List== Id Image Name Location Type (criteria) Year Description 739 Schokland and Surroundings Noordoostpolder, Flevoland Schokland and Surroundings. UNESCO World Heritage Centre. Retrieved on 2012-01-22. Cultural (iii, v) 1995 Schokland symbolizes the struggle of the people of the Netherlands against the sea. It was an inhabited peninsula since pre-historic times, it became an island in the 15th century, until it was completely encroached by the Zuiderzee in 1859. In the 1940s the Noordoostpolder was created and consequently Schokland was reclaimed. 759 Defence Line of Amsterdam North Holland and Utrecht Defence Line of Amsterdam. UNESCO World Heritage Centre. Retrieved on 2012-01-22. Cultural (ii, iv, v) 1996 The defence line around the Dutch capital Amsterdam was built between 1883 and 1920. It is the only fortification that is based on the principle of controlling the waters around a city. It contains of a network of 45 armed forts and can temporarily flood polders extending 135 kilometers around Amsterdam. 818 Mill Network at Kinderdijk-Elshout Alblasserdam and Nieuw-Lekkerland, South Holland Cultural (i, ii, iv) 1997 819 Historic Area of Willemstad, Inner City and Harbour, Curaçao Willemstad, CuraçaoCuraçao is a constitute country of the Kingdom of the Netherlands in the Caribbean. Cultural (ii, iv, v) 1997 867 Ir.D.F. Woudagemaal (D.F. Wouda Steam Pumping Station) Lemmer, Lemsterland, Friesland Cultural (i, ii, iv) 1998 899 Droogmakerij de Beemster (Beemster Polder) Beemster, North Holland Cultural (i, ii, iv) 1999 965 Rietveld Schröderhuis (Rietveld Schröder House) Utrecht, Utrecht Cultural (i, ii) 2000 1314 The Wadden Sea Friesland, Groningen, and North Holland Natural (viii, ix, x) 2009 1349 Seventeenth- century canal ring area of Amsterdam inside the Singelgracht Amsterdam, North Holland Cultural (i, ii, iv) 2010 1441 Van Nelle Factory Rotterdam, South Holland Cultural (vii, viii, ix, x) 2014 ==Notes== ==References== * Netherlands Category:Netherlands-related lists",
 "title": "List of World Heritage Sites in the Netherlands"
}