{
 "id": "347743",
 "text": "Białowieża Forest known as Belovezhskaya Pushcha \"Belovezhskaya Pushcha / Białowieża Forest\" at the UNESCO official webpage in Belarus and in Poland is an ancient woodland. It is on the border between Poland and Belarus. It is north of Brest (Belarus) and southeast of Białystok (Poland). It is one of the last and largest remaining parts of the large primeval forest that once went across the European Plain. This UNESCO World Heritage Site and Biosphere Reserve are in parts of the Brest Voblast and Hrodna Voblast in Belarus. On the Polish side they are near the town of Białowieża in the Podlaskie Voivodeship. Białowieża means the White Tower in Polish. The border between the two countries runs through the forest. There is a border crossing for hikers and cyclists. The forest is home to 800 wisent, the continent's heaviest land animals. == Belarusian section == On the Belarusian side the Biosphere Reserve is . The National Park and World Heritage Site are . The Belavezhskaya Pushcha headquarters at Kamieniuki, Belarus has a laboratory and a zoo. The zoo has wisent, konik (a semi-wild horse), wild boar, moose, and other animals. There is also a small museum, restaurant, snack bar and hotel. Because of the lack of facilities and having few tourists in the country, few foreign tourists visit the Belarusian Pushcha each year. == Polish section == On the Polish side, part of the Białowieża Forest is protected as the Białowieża National Park (Białowieski Park Narodowy). It has a general area of about . There is also the Białowieża Glade (Polana Białowieska). This has several buildings first owned by the tsars of Russia. The tsars were the last private owners of the forest (from 1888 to 1917) when the whole forest was in the Russian Empire. A hotel, restaurant and parking areas are there. Guided tours into the strictly controlled areas of the park can be arranged on foot or by horse-drawn carriage. About 200,000 tourists visit the Polish part of the forest each year. Activities are: bird watching with local ornithologist, watching bisons in their natural environment, and sledge and carriage rides with a bonfire. The popular village of Białowieża is in the forest. == Named oaks == The forest has a number of large, ancient pedunculate oaks (Quercus robur), some of which are individually named. Trunk circumferences are measured at breast height, above the ground. * Great Mamamuszi. Circumference (2005), height . One of the thickest oaks in the forest, with a beautiful column-like trunk. The tree's name stems from Molière's The Bourgeois Gentleman. Since 1989 the tree's circumference grew by . Of all the oaks in Belovezhskaya Pushcha with a circumference above , it is in the best condition. * The King of Nieznanowo. Circumference , height . This tree has one of the most columnar trunks among the oaks in Belovezhskaya Pushcha, interestingly set in the ground. The first branches arise at the height of 18 m. It has been gradually dying since 1998. As of 2005, only two small branches still have leaves. Since the mid-1960s its trunk circumference has grown by about . * Emperor of the South. Circumference , height . The tree shows no clear signs of dying. * Emperor of the North. Circumference , height . The tree has a very regular trunk and shows no clear signs of dying. * Southern Cross. Circumference , height . At the base of the trunk it has a considerable lesion in the bark on the eastern side. From the mid-1960s its circumference has grown by . The name is from the shape of its crown, whose main branches look like a cross. * The Guardian of Zwierzyniec. Circumference , height . This is one of the thickest oaks in the forest. The tree is largely bent down westwards, which most probably has contributed to the large circumference of the trunk at its base. All the branches are live, indicating that the tree is in good condition. * Barrel Oak. Circumference , height over . This tree is named for its barrel-shaped trunk, and is the oak which reaches the greatest trunk circumference among the Białowieża oaks. The tree is dead and largely has no bark, and is around 450 years old. * Dominator Oak. Circumference , height over . One of the thickest oaks of the Belovezhskaya Pushcha, the tree has been dead since 1992 and its trunk is now largely has no bark. For many years it dominated the Puszcza Belovezhskaya Pushcha as far as size is concerned. Its age is about 450 years. * The Jagiełło Oak. Circumference (when growing) , height . It blew down in 1974, but is probably the most famous of the trees in the forest. It is said that King Władysław II Jagiełło rested beneath it before the Battle of Grunwald in 1410. Although in fact the tree is believed to have been only 450 years old when it blew down. * Tsar Oak (Polish) (Polish: Dąb Car) of Poland. Circumference , height . The tree's volume has been estimated at . It died in 1984, and for over 20 years it has been standing dead on the edge of the valley of Leśna Prawa river. Today the trunk is totally missing bark and some of the branches have broken off and lie at the base of the trunk. * Tsar Oak (Belarusian) (Cyrillic: Царь-Дуб) of Belarus. Oldest Belarusian oak, standing 46m tall, having a diameter larger than 2m, and being over 800 years of age. It stands 2 km from Staroje Romatowo. It has been a national monument since 1963. \"Царь -дуб\" (accessed 4 May 2009) == Logging == Polish environmentalists say that logging is threatening the flora and fauna in the forest, including species of rare birds. Poland's state forestry board is saying that it is being done for protection and for ecological reasons. == References == == Other websites == Category:National parks in Europe Category:Biosphere reserves Category:Forests of Europe Category:World Heritage Sites in Poland Category:Geography of Belarus Category:Podlaskie Voivodeship",
 "title": "Białowieża Forest"
}