{
 "id": "347757",
 "text": "This is a list of World Heritage Sites in France that are in UNESCO's World Heritage List.France. UNESCO World Heritage Centre. Retrieved on 2011-07-21. Currently, thirty-seven properties in France are on the World Heritage List. Thirty-three of these are cultural properties, three are natural properties, and one is mixed. The first was added to the list in 1979 and the latest in 2011. ==Properties on the World Heritage List== # Site Image Region Era Description Type Year listed Exten- sion Ref. 1 Abbey Church of Saint-Savin- sur-Gartempe Nouvelle-Aquitaine 9th century cultural 1983 2007 2 Cistercian Abbey of Fontenay Bourgogne-Franche-Comté 12th century cultural 1981 2007 3 Arles, Roman and Romanesque Monuments Provence-Alpes-Côte d'Azur du -Ier century au 4th century and 12th century cultural 1981 - 4 Vézelay, Church and Hill Bourgogne-Franche-Comté 12th century cultural 1979 2007 5 Belfries of Belgium and France Hauts-de-France 13th century-20th century transboundary property, shared with Belgium ; Extension of the former Belfries of Flanders and Wallonia cultural 1999 2005 6 Bordeaux, Port of the Moon Nouvelle- Aquitaine cultural 2007 - 7 Canal du Midi Occitanie 17th century cultural 1996 - 8 Amiens Cathedral Hauts-de-France 13th century cultural 1981 - 9 Bourges Cathedral Centre-Val de Loire 13th century cultural 1992 - 10 Chartres Cathedral Centre-Val de Loire 13th century cultural 1979 - 11 Cathedral of Notre-Dame, Abbey of Saint-Remi, & Palace of Tau, Reims Grand Est 13th century - 16th century cultural 1991 - 12 The Causses and Cévennes Occitanie cultural 2011 - 13 Historical center of Avignon : Papal Palace & Avignon Bridge Provence-Alpes-Côte d'Azur 12th century - 16th century Palais des papes, Episcopal Ensemble and Pont Saint-Bénezet cultural 1995 - 14 Routes of Santiago de Compostela in France Diverse sites (right-of-way and route) cultural 1998 - 15 Episcopal City of Albi Occitanie cultural 2010 - 16 Royal Saltworks of Arc-et-Senans Bourgogne-Franche-Comté 18th century cultural 1982 2009 17 Fortifications of Vauban Diverse 17th century cultural 2008 - 18 Jurisdiction of Saint-Émilion Nouvelle-Aquitaine cultural 1999 - 19 Le Havre, the City rebuilt by Auguste Perret Normandy 20th century Built from 1945 - 1964 by the Atelier de Reconstruction du Havre d'Auguste Perret cultural 2005 - 20 Mont Saint Michel and its Bay Normandy cultural 1979 2007 21 Palace and Park of Fontainebleau Île-de-France cultural 1981 - 22 Palace and Park of Versailles Île-de-France cultural 1979 2007 23 Paris, Banks of the Seine Île-de-France cultural 1991 - 24 Place Stanislas, Place de la Carrière, and Place d'Alliance in Nancy Grand Est 18th century cultural 1983 - 25 Pont du Gard, Roman Aqueduct Occitanie Ier century cultural 1985 2007 26 Provins, Town of Medieval Fairs Île-de-France cultural 2001 - 27 Historic Old Town center of Lyon Auvergne-Rhône-Alpes cultural 1998 - 28 Prehistoric Pile dwellings around the Alps transboundary property, shared with Austria, Germany, Italy, Slovenia, Switzerland cultural 2011 - 29 Prehistoric Sites and Decorated Caves of the Vézère Valley Nouvelle-Aquitaine cultural 1979 - 30 Strasbourg – Grande Île Grand Est cultural 1988 - 31 Roman Theatre and its Surroundings and the \"Triumphal Arch\" of Orange Provence-Alpes-Côte d'Azur cultural 1981 2007 32 The Loire Valley between Sully-sur-Loire and Chalonnes- sur-Loire Centre-Val de Loire, Pays de la Loire cultural 2000 - 33 Cité de Carcassonne – historic Fortified City of Carcassonne Occitanie cultural 1997 - 34 Gulf of Porto: Calanche of Piana, Gulf of Girolata, Scandola Reserve, Corsica Corse N/A natural 1983 - 35 Lagoons of New Caledonia Nouvelle- Calédonie N/A Diversity of ecosystems in New Caledonia Barrier Reef natural 2008 - 36 The Pitons, Cirques and Remparts of Réunion La Réunion N/A natural 2010 - 37 Pyrénées: Mont Perdu Occitanie N/A transboundary property, shared with Spain mixed 1997 1999 ==References== * Category:France-related lists France",
 "title": "List of World Heritage Sites in France"
}