{
 "id": "347774",
 "text": "The List of World Heritage Sites in Romania is a group of places chosen by UNESCO, the United Nations Educational, Scientific and Cultural Organization. ==History== UNESCO was created for the \"conservation and protection of the world’s inheritance of books, works of art and monuments of history and science\". The constitution of UNESCO was ratified in 1946 by 26 countries.UNESCO, \"Constitution\"; retrieved 2012-7-18. Romania agreed to take part in the World Heritage Convention in 1990.UNESCO, \"States Parties: Ratification Status\"; retrieved 2012-7-18. ==List== The World Heritage Site (WHS)WHS is an acronym. WHS stands for \"World Heritage Site\". list has developed over time. It is part of a process; and the list continues to grow. There are seven WHS places in Romania.UNESCO, \"Romania\"; retrieved 2012-7-18. ===Cultural=== Name/Location Region/County Description Ref nr Year added Churches of Moldavia Moldavia Masterpieces inspired by Byzantine art 598 1993 1 Arbore Suceava County \"The Decollation of Saint John the Baptist\" Church of Arbore village. 1993 2 Mănăstirea Humorului Suceava County The Assumption of the Virgin and of Saint George's Church of the old Humor Monastery. 1993 3 Moldoviţa Suceava County The Church of the Annunciation of Moldoviţa Monastery. 1993 4 Pătrăuţi Suceava County Sacred Cross' Church of Pătrăuţi. 1993 5 Probota Suceava County Saint Nicolas' Church of Probota Monastery. 1993 6 Suceava Suceava County Saint George's Church of Suceava. 1993 7 Voroneţ Suceava County Saint George's Church of the former Voroneţ Monastery. 1993 8 Suceviţa Suceava County Church of the Resurrection of Suceviţa Monastery. 2010 Dacian Fortresses of the Orăştie Mountains Transylvania An unusual fusion of military and religious architectural techniques and concepts 906 1999 1 Sarmizegetusa Regia Hunedoara County The capital of Dacia. 1999 2 Costești - Cetățuie Hunedoara County Dacian Fortress. 1999 3 Costeşti-Blidaru Hunedoara County The strongest of the Dacian Fortresses. 1999 4 Piatra Roşie Hunedoara County Dacian Fortress. 1999 5 Băniţa Hunedoara County Dacian Fortress. 1999 6 Căpâlna Alba County Dacian Fortress. 1999 Historic Centre of Sighişoara Transylvania/Mureş County A fine example of a small, fortified medieval town 902 1999 Monastery of Horezu Oltenia/Vâlcea County A masterpiece of the Brâncovenesc style 597 1993 Villages with Fortified Churches in Transylvania Transylvania A picture of the cultural landscape of southern Transylvania 596 bis 1993 1 Biertan Sibiu County The site of Biertan with the fortified church and a part of the town. 1993 2 Câlnic, Alba Alba County Village of Câlnic. 1999 3 Dârjiu Harghita County Village of Dârjiu. 1999 4 Prejmer Braşov County Village of Prejmer. 1999 5 Saschiz Mureş County Village of Saschiz. 1999 6 Valea Viilor Sibiu County Village of Valea Viilor. 1999 7 Viscri Braşov County Village of Viscri. 1999 Wooden Churches of Maramureş Maramureş Outstanding examples of a range of architectural solutions from different periods and areas 904 1999 1 Bârsana Maramureş County The Church of the Presentation of the Virgin at the Temple in Bârsana. 1999 2 Budeşti Maramureş County The Church of Saint Nicholas in Budeşti. 1999 3 Deseşti Maramureş County The Church of the Holy Paraskeva in Deseşti. 1999 4 Ieud Maramureş County The Church of the Nativity of the Virgin in Ieud Deal. 1999 5 Plopiş/Siseşti Commune Maramureş County The Church of the Holy Archangels in Plopiş. 1999 6 Poienile Izei Maramureş County The Church of the Holy Parasceve in Poienile Izei. 1999 7 Rogoz/Târgu Lăpuş Maramureş County The Church of the Holy Archangels in Rogoz. 1999 8 Şurdeşti/Siseşti Commune Maramureş County The Church of the Holy Archangels in Şurdeşti. 1999 ===Natural=== Name/Location Region/County Description Ref nr Year added Danube Delta Dobruja/Tulcea County Danube Delta Biosphere Reserve 588 1991 ===Tentative list=== The Tentative List consists of sites which have been nominated. The evaluation process is not yet completed. * Le Monastère de Neamt * Eglises byzantines et post- byzantines de Curtea de Arges * L'ensemble monumental de Tirgu Jiu * L'ensemble rupestre de Basarabi * L'église des Trois Hiérarques de Iassy * Les \"coules\" de Petite Valachie * L'église de Densus * Le noyau historique de la ville d'Alba Julia * Massif du Retezat * Pietrosul Rodnei (sommet de montagne) * Sinpetru (site paléontologique) * Codrul secular Slatiora (forêt séculaire) * The Historic Centre of Sibiu and its Ensemble of Squares * The old villages of Hollókő and Rimetea and their surroundings ==Related pages== *World Heritage Committee *UNESCO World Heritage Site *Table of World Heritage Sites by country *List of World Heritage Sites in Europe ==References== ==Other websites== * List of biosphere reserves which are wholly or partially world heritage sites Category:Romania *Romania Romania Category:Romania-related lists",
 "title": "List of World Heritage Sites in Romania"
}