{
 "id": "347822",
 "text": "The List of World Heritage Sites in Ukraine is a group of places chosen by UNESCO, the United Nations Educational, Scientific and Cultural Organization, located in Ukraine. ==History== UNESCO was created for the \"conservation and protection of the world’s inheritance of books, works of art and monuments of history and science\". The constitution of UNESCO was ratified in 1946 by 26 countries.UNESCO, \"Constitution\"; retrieved 2012-7-18. Ukraine agreed to take part in the World Heritage Convention in 1988.UNESCO, \"States Parties: Ratification Status\"; retrieved 2012-7-18. ==List== The World Heritage Site (WHS)WHS is an acronym. WHS stands for \"World Heritage Site\". list has developed over time. It is part of a process; and the list continues to grow. There are five WHS places in Ukraine.UNESCO, \"Ukraine\"; retrieved 2012-7-18. ==Cultural== No. Image Name Location Time of creation Time listed Ranking UNESCO Categories 1 Saint-Sophia Cathedral and Related Monastic Buildings Kyiv 11th century 1990 527 i, ii, iii, iv Kyiv Pechersk Lavra Kyiv 1051 1990 527 i, ii, iii, iv 2 Lviv - the Ensemble of the Historic Centre Lviv 1256 1998 865 ii, v 3 Residence of Bukovinian and Dalmatian Metropolitans Chernivtsi 1864—1882 2011 1330 ii, iii, iv 4 Struve Geodetic Arc Khmelnytsky and Odesa Oblasts 1816—1855 2005 1187 ii, iii, vi ==Natural== No. Image Name Location Time of creation Time listed Ranking UNESCO Categories 1 Primeval Beech Forests of the Carpathians and the Ancient Beech Forests of Germany (Carpathian Biosphere Sanctuary, Uzhok National Nature Park) Zakarpattia Region — 2007 1133 ix ;Notes This UNESCO World Heritage Site includes two biosphere reserves: Carpathian Biosphere Sanctuary and the southern half of East Carpathian Biosphere Reserve (Poloniny National Park and Uzhok National Park) as well some protected Presov areas in the eastern Slovakia. ===Tentative list=== The Tentative List consists of sites which have been nominated. The evaluation process is not yet completed. * Historic Centre of Tchernigov, 9th -13th centuries * Cultural Landscape of Canyon in Kamenets- Podilsk * Tarass Shevtchenko Tomb and State Historical and Natural Museum * National Steppe Biosphere Reserve \"Askaniya Nowa\" * Dendrological Park \"Sofijivka\" * Bagçesaray Palace of the Crimean Khans * Archaeological Site \"Stone Tomb\" * Mykolayiv Astronomical Observatory * Complex of the Sudak Fortress Monuments of the 6th - 16th c. * Astronomical Observatories of Ukraine * Historic Center of the Port City of Odesa * Kyiv: Saint Sophia Cathedral with Related Monastic Buildings, St. Cyril's and St. Andrew's Churches, Kyiv-Pechersk Lavra (extension of Kyiv: Saint-Sophia Cathedral and Related Monastic Buildings, Kyiv-Pechersk Lavra) * Wooden Tserkvas (Churches) of Carpathian Region in Ukraine and Poland * Trading Posts and Fortifications on Genoese Trade Routes. From the Mediterranean to the Black Sea * The ancient city of Tauric Chersonese and its chora (5th century BC — 14th century AD) ==Related pages== *World Heritage Committee *UNESCO World Heritage Site *Table of World Heritage Sites by country *List of World Heritage Sites in Europe ==References== ==Other websites== * List of biosphere reserves which are wholly or partially world heritage sites *Ukraine Ukraine Category:Ukraine- related lists",
 "title": "List of World Heritage Sites in Ukraine"
}