{
 "id": "347925",
 "text": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) has listed 35 World Heritage Sites in eight countries commonly called Northern Europe. These countries are Iceland, Norway, Sweden, Finland, Denmark, Estonia, Latvia and Lithuania. Greenland is not included in this list even though it is linked with Denmark. It is included in the List of World Heritage Sites in the Americas. The United Kingdom and Ireland are included in Western Europe even though they are sometimes listed in Northern Europe. ==Legend== :Site; named after the World Heritage Committee's official designation :Location; at city, regional, or provincial level and geocoordinates :Criteria; as defined by the World Heritage Committee :Area; in hectares and acres. If available, the size of the buffer zone has been noted as well. A value of zero implies that no data has been published by UNESCO :Year; during which the site was added to the World Heritage List :Description; brief information about the site, including reasons for qualifying as an endangered site, if applicable ==Sites== Site Image Location Criteria Area ha (acre) Year Description Refs Agricultural Landscape of Southern Öland Cultural: (iv), (v) 2000 Birka and Hovgården Cultural: {iii}, (iv) 1993 Bronze Age Burial Site of Sammallahdenmäki Cultural: (iii), (iv) 1999 Bryggen Cultural: {iii} 1979 Church Village of Gammelstad, Luleå Cultural: (ii), (iv), (v) 1996 Curonian Spit Cultural: (v) 2000 Engelsberg Ironworks Cultural: (iv) 1993 Fortress of Suomenlinna Cultural: (iv) 1991 Hanseatic Town of Visby Cultural: (iv), (v) 1995 High Coast / Kvarken Archipelago Natural: (viii) 2000 Historic Centre of Riga Cultural: (i), (ii) ; buffer zone 1997 Historic Centre (Old Town) of Tallinn Cultural: (ii), (iv) ; buffer zone 1997Minor modification of boundaries in 2008. Jelling Mounds, Runic Stones and Church Cultural: (iii) 1994 Kernavė Archaeological Site (Cultural Reserve of Kernavė) Cultural: (iii), (iv) ; buffer zone 2004 Kronborg Castle Cultural: (iv) 2000 Laponian Area Mixed: (iii), (v), (vii), (viii), (ix) 1996 Mining Area of the Great Copper Mountain in Falun Cultural: (ii), (iii), (v) ; buffer zone 2001 Naval Port of Karlskrona Cultural: (ii), (iv) 1998 Old Rauma Cultural: (iv), (v) ; buffer zone 1991Addition of the buffer zone in 2009 which had been established on a national level in 2003. Petäjävesi Old Church alt= Cultural: (iv) 1994 Rock Art of Alta Cultural: {iii} 1985 Rock Carvings in Tanum Cultural: (i), (iii), (iv) 1994 Cultural: (iii), (iv), {v} 1980Extended in 2010 to include the circumference and name change from Røros Mining Town to the present name. Roskilde Cathedral Cultural: (ii), (iv) ; buffer zone 1995 Royal Domain of Drottningholm Cultural: (iv) 1991 Skogskyrkogården Cultural: (ii), (iv) 1994 Struve Geodetic Arc Cultural: (ii), (iii), (vi) 2005 Surtsey Natural: (ix) ; buffer zone 2008 Cultural: (iii), (vi) 2004 Urnes Stave Church Cultural: (i), (ii), {iii} 1979 Varberg Radio Station Cultural: (ii), (iv) ; buffer zone 2004 Vegaøyan — The Vega Archipelago Cultural: (v) ; buffer zone 2004 Verla Groundwood and Board Mill Cultural: (iv) ; buffer zone 1996 Vilnius Historic Centre Cultural: (ii), (iv) 1994 West Norwegian Fjords — Geirangerfjord and Nærøyfjord Natural: (vii), (viii) 2005 ==Notes== ==References== *Northern *Northern Europe Category:Europe-related lists",
 "title": "List of World Heritage Sites in Northern Europe"
}