{
 "id": "347916",
 "text": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage. As of 2010, Spain has 42 total sites on the list. This is second only to Italy. The Pyrénées – Mont Perdu World Heritage Site is shared with France. The Prehistoric Rock-Art Sites in the Côa Valley and Siega Verde site is shared with Portugal. ==List of sites== The table lists information about each World Heritage Site: :Name: as listed by the World Heritage Committee :Location: city or province of site :Community: one of the 17 autonomous communities of Spain :Period: time period of significance, typically of construction :UNESCO data: the site's reference number; the year the site was added on the World Heritage List; the criteria it was listed under: criteria i through vi are cultural, while vii through x are natural; (the column sorts by year added to the list) :Description: brief description of the site Name Image Location Community Period UNESCO data Description Ref(s) Cave of Altamira and Paleolithic Cave Art of Northern Spain Santillana del Mar Cantabria The Cave of Altamira has cave painting from the Upper Paleolithic, 35,000 to 11,000 BC. Old Town of Segovia and its Aqueduct Segovia Castile and León A Roman aqueduct, the medieval Alcázar palace, and the cathedral. Monuments of Oviedo and the Kingdom of the Asturias Oviedo Asturias The Kingdom of Asturias was the only Christian region of Spain in the 9th century. It developed its own style of Pre-Romanesque art and architecture. Historic Centre of Córdoba Córdoba Andalusia The Great Mosque of Córdoba is a 7th-century mosque converted to a Roman Catholic cathedral in the 13th century. During Moorish rule, Córdoba looked like Constantinople and Baghdad. Alhambra, Generalife and Albayzín Granada Andalusia Moorish influence in southern Spain. The Alhambra and the palace Generalife were built by the Emirate of Granada. Burgos Cathedral Burgos Castile and León The Gothic-style cathedral was built between the 13th and 16th centuries. It is the burial place of Spanish national hero, El Cid. Monastery and Site of the Escorial San Lorenzo de El Escorial Madrid El Escorial was a residence of the royal family. Works of Antoni Gaudí Barcelona Catalonia The architecture of Antoni Gaudí is part of the Modernist style. Santiago de Compostela (Old Town) Santiago de Compostela Galicia The Cathedral of Santiago de Compostela is the reputed burial-place of the apostle James. The town was destroyed by Moors in the 10th century and later rebuilt. Old Town of Ávila with its Extra-Muros Churches Castile and León The defensive wall surrounding the original town was built in the 11th century. Mudéjar Architecture of Aragon Aragon The churches in Teruel are a blending of traditional Islamic and contemporary European styles. Historic City of Toledo Toledo Castile-La Mancha Toledo was founded by the Romans and was the capital of the Visigoths. It was important in Muslim Spain and during the Reconquista. Garajonay National Park La Gomera Canary Islands The park is 70% covered by laurel forest. This has disappeared from mainland Europe. Old City of Salamanca Salamanca Castile and León The University of Salamanca, founded in 1218, is the oldest in Spain. The city was conquered by the Carthaginians in the 3rd century, and later ruled by the Romans and Moors. Cathedral, Alcázar and Archivo de Indias in Seville Seville Andalusia The Alcázar was built during the Almohad dynasty that ruled southern Spain until the Reconquista. Old Town of Cáceres Cáceres Extremadura The old town combines Roman, Islamic, Northern Gothic, and Italian Renaissance architecture, with more than 30 Islamic towers. Ibiza, Biodiversity and Culture Ibiza Balearic Islands The coast of Ibiza has a sea grass only found in the Mediterranean. The island also has many Phoenician ruins. Poblet Monastery Vimbodí Catalonia The monastery was founded by the Cistercians in 1151 and is one of the largest in Spain. Renaissance Monumental Ensembles of Úbeda and Baeza Andalusia Among the first examples of the Renaissance style in Spain. Archaeological Ensemble of Mérida Mérida Extremadura Mérida was founded in 25 BC by the Romans as Emerita Augusta. Royal Monastery of Santa María de Guadalupe Guadalupe Extremadura The monastery is home of Our Lady of Guadalupe, a shrine to Mary. Route of Santiago de Compostela — The Route, or the Way of St. James, is a pilgrimage from the French-Spanish border to the Cathedral of Santiago de Compostela. Doñana National Park Andalusia The park has the delta region where the Guadalquivir River reaches the Atlantic Ocean. It is one of the largest heronries in the Mediterranean with 500,000+ water fowl during the winter. Pyrénées – Mont Perdu — Aragon (shared with France) The site has the Pyrenees mountain chain along the French-Spanish border. Historic Walled Town of Cuenca Cuenca Castile-La Mancha The Moors built the fortified city in the early 8th century. La Lonja de la Seda de Valencia Valencia Valencia La Lonja de la Seda means Silk Exchange in English. Las Médulas Ponferrada Castile and León The Romans made a gold mine and worked the site for two centuries. Palau de la Música Catalana and Hospital de Sant Pau, Barcelona Barcelona Catalonia Both buildings were built in the early 20th century in the modernist Art Nouveau style. San Millán Yuso and Suso Monasteries San Millán de la Cogolla La Rioja The original Suso monastery was founded in the mid-6th century. It has the first written examples of the Spanish and Basque languages. Prehistoric Rock-Art Sites in the Côa Valley and Siega Verde — Castile and León (shared with Portugal) The Upper Palaeolithic rock art in the Côa Valley of Portugal, and the Siega Verde in Spain. Rock Art of the Mediterranean Basin on the Iberian Peninsula — The site includes 750 examples of rock art with images of geometric shapes and scenes of men hunting animals. Archaeological Ensemble of Tárraco Tarragona Catalonia The prominent Roman city of Tárraco is at the site of modern-day Tarragona. University and Historic Precinct of Alcalá de Henares Alcalá de Henares Madrid The University of Alcalá, 1499, is the first planned university city. It was a model for others. The city is the birthplace of Miguel de Cervantes. San Cristóbal de La Laguna San Cristóbal de La Laguna Canary Islands The city was Spain's first non-fortified colonial town. Many buildings date to the 16th century. Palmeral of Elche Elche Valencia The grove of date palm trees was laid out with irrigation systems by the Moors in the 10th century. Roman Walls of Lugo Lugo Galicia The Roman walls of Lucus are the best examples in Western Europe. Catalan Romanesque Churches of the Vall de Boí Vall de Boí Catalonia The small valley at the edge of the Pyrenees has churches in Romanesque style, unique for their tall, square bell towers. Archaeological Site of Atapuerca Atapuerca Castile and León The caves in the Atapuerca Mountains have fossil remains of the earliest human beings discovered in Europe dating from nearly one million years ago. Aranjuez Cultural Landscape Aranjuez Madrid The area was the exclusive property of the royal family until the 19th century. Vizcaya Bridge Portugalete Basque Country The bridge, built in 1893, is the world's first transporter bridge. Teide National Park Tenerife Canary Islands The park contains Mount Teide, a volcano and the highest elevation in Spain. Tower of Hercules A Coruña Galicia The Romans built this lighthouse on a rock at the entrance to the harbour. It is the only fully preserved and functioning Roman lighthouse. ===Sites by autonomous community=== This is the list of Heritage sites by autonomous community. Community Exclusive sites Shared sites Castile and León 6 2 Andalusia 5 2 Catalonia 5 1 Galicia 4 1 Canary Islands 3 Extremadura 3 Madrid 3 Castile-La Mancha 2 2 Valencia 2 1 Aragon 1 2 La Rioja 1 1 Asturias 1 Basque Country 1 Balearic Islands 2 Cantabria 1 Murcia 1 Navarre 1 ==References== * Spain Category:Spain-related lists",
 "title": "List of World Heritage Sites in Spain"
}