{
 "id": "348026",
 "text": "The Strait of Malacca is a marine strait. It links the Andaman Sea and the Java Sea, and separates Malaya and Sumatra. It is about 800 km long. Most parts are between and wide. At its narrowest point, it is only wide. At its shallowest point it is about deep. The strait has been historically important, linking India to Southeast Asia and China, and has been an important hub for religion, primarily Christianity, Hinduism, and Islam. Here is a quote from the passage, \"An important trading and knowledge centre from the seventh into the thirteenth century was the Buddhist maritime and trading empire ­Srivijaya, which encompassed parts of the island of Sumatra and the Malayan peninsula as well as the western part of the island of Java. At that time Srivijaya controlled commercial shipping through the Strait of Malacca. The state disintegrated in wars from the end of the thirteenth century, and two important power centres emerged: first Malacca in the fifteenth century, and later Aceh (in northern Sumatra) and Johor (in present-day Malaysia) at the beginning of the sixteenth century. Whereas Aceh was primarily an important Muslim centre of commerce, Johor grew in importance because of the tin mines located in its hinterland and the valuable pepper that was cultivated. The seaport town of Malacca was used mainly by Muslim merchants as a major transshipment port on the route between India and China. In 1511 it was conquered by the Portuguese, not least to weaken the Muslim dominance of shipping in the re­gion. But despite the conquest, the Muslim merchants remained influential in the region, for ultimately they brought fresh impetus to Aceh which remained Muslim-dominated. The seaport of Malacca then deve­loped into an important centre for European mariners. Various European nations attempted to bring Malacca under their own control by means of blockades and attacks. For instance, the Dutch initially blockaded the seaport of Malacca in 1640 with the aim of cutting off the town’s cargo flows and weakening the influence of the Portuguese. In 1641 they finally captured the town and expanded their territorial power from there. In the following years they took over other seaports in the region, including Aceh, and sporadically diminished the influence of Muslim merchants.\" == References == Category:Straits of Asia Category:Southeast Asia Category:Bodies of water of Malaysia Category:Bodies of water of Indonesia Category:Geography of Singapore",
 "title": "Strait of Malacca"
}