{
 "id": "34819",
 "text": "Molise is one of the twenty regions of Italy, in Southern Italy on the Adriatic Sea. The capital is the city of Campobasso. Molise previously formed, with the Abruzzo region, the old region of Abruzzi e Molise. Molise was separated from that region in 1963, making Molise the youngest region in Italy. == Geography == The region is located in South Italy bordered by Abruzzo to the north, Lazio to the west, Campania to the south, Apulia to the southeast and the Adriatic Sea to the east. Molise, with a total area of , is the second smallest region after Valle d'Aosta. The main rivers in the region are: * Fortore, long. * Trigno, long. * Biferno, long; it is the main river of those that flow only in the Molise region. * Volturno, ; it is the main river in South Italy by its length and its discharge. The highest mountain in the region is La Meta (its eastern summit) (), in the Isernia province, with an altitude of . == Provinces == Molise is divided into two provinces: Province Abbreviation Capital Area (km²) Population (1 January 2017) Density (inh./km²) Comuni Campobasso CB Campobasso 2,925.41 224,644 84 Isernia IS Isernia 1,535.24 85,805 52 Total 4,460.65 310,449 136 ===Largest municipalities=== The 10 comuni of the region with more people living in it are: No. Comuni Province Population (2017) Area(km2) Density (inh./km2) 1 Campobasso CB 49,320 56.11 2 Termoli CB 33,660 55.64 3 Isernia IS 21,805 69.15 4 Venafro IS 11,203 46.45 5 Bojano CB 8,093 52.63 6 Campomarino CB 8,002 76.68 7 Larino CB 6,730 88.77 8 Montenero di Bisaccia CB 6,637 93.32 9 Guglionesi CB 5,296 100.95 10 Riccia CB 5,180 70.04 ==Gallery== File:Campobasso panorama.jpg|Overview of Campobasso. Duomo di isernia, esterno 01.jpg|Cathedral of Isernia. File:Agnone Molise Italy.jpg|Overview of the town of Agnone (IS). File:Campobasso castello.jpg|Monforte castle, Campobasso. File:Matese.jpg|Matese mountain chain. ==References== ==Other websites== * Official Site",
 "title": "Molise"
}