{
 "id": "348184",
 "text": "Tineidae (or clothes moth) is a family of moths. They are known as fungus moths or tineid moths. There are more than 3,000 species in over 300 genera. Most of the tineid moths are small or medium-sized. They have wings. They are common in the Palaearctic. Others found elsewhere were introduced Tineids eat living plants, fungi, lichens, and detritus. The best-known members of the family are the clothes moths. They eat stored fabrics. The most widespread species are the common clothes moth (Tineola bisselliella), the case-bearing clothes moth (Tinea pellionella) and the carpet moth (Trichophaga tapetzella). The brown-dotted clothes moths (Niditinea fuscella) feeds on feathers in a bird's nest. The genus Ceratophaga, feeds on dead animals such as mammals and the shells of dead tortoises. == Books == *Dugdale, J.S., 1988. Lepidoptera - annotated catalogue and keys of family-group taxa. Fauna of New Zealand, 14: 1-262. *Gaedike, R. 1983. Zur Kenntnis der paläarktischen Tineiden Die Gattung Infurcitinea Spuler, 1910 (Lepidoptera). Entomologische Abhandlungen, Staatliches Museum für Tierkunde, Dresden, 46: 121-150. *Gaedike, R. 1985. Beitrag zur Kenntnis der paläarktischen Tineiden: Gattung Obesoceras Petersen, 1957 (Lepidoptera). Entomologische Abhandlungen, Staatliches Museum für Tierkunde, Dresden, 48: 167-181. *Hinton, H.E. 1956. The larvae of the species of Tineidae of economic importance. Bulletin of Entomological Research, 47: 251-346. *Leraut, P., 1985. Mise a jour de la liste des Tineides de la faune de France. Entomologica Gallica, 1(4): 319-325. *Petersen, G. 1957-8. Die Genitalien der paläarktischen Tineiden. Beiträge zur Entomologie, 7: 55-176, 338-380, 557-595; 8: 111-118, 398-430. *Robinson, G.S. 1979. Clothes-moths of the Tinea pellionella complex: a revision of the world's species (Lepidoptera: Tineidae). Bulletin of the British Museum (Natural History) (Entomology), 38: 57-128, figs 1-103. *Zagulajev A K. 1988 English translation (original 1975). Clothes Moths (Tineidae) (English translation of Nastoyaschie Moli (Tineidae)).Akademiya Nauk SSSr, Zoologicheskii Institut, New series No. 108 ==References== * * Global Taxonomic Database of Tineidae * Common Clothes Moth * A Caterpillar that Eats Tortoise Shells * Tineid of Korea * Fauna Europaea Category:Moths",
 "title": "Tineidae"
}