{
 "id": "348234",
 "text": "Anna Muzychuk; (born 28 February 1990 in Lviv, Ukraine) is the second-rated woman chess player in the world. She earned the title of Woman Grandmaster in 2004, and the title of Grandmaster in 2012. In 2004 she became a member of the Slovenian chess federation, where she was the strongest female chess player. Her younger sister Mariya is an International master. Muzychuk has played on first board for the Slovenian team from 2004 to 2014. Since 2014 she represents the Ukrainian chess federation. In 36th Chess Olympiad, she defeated, among others, the former Women's World Chess Champion grandmaster Antoaneta Stefanova. In the 37th Chess Olympiad she helped the Slovenian women's team, seeded 17th, to finished tenth. In 2017, Muzychuk she refused to go to the World Rapid and Blitz Championships in Saudi Arabia. She said on Facebook: > In a few days I am going to lose two World Champion titles – one by one. > Just because I decided not to go to Saudi Arabia. Not to play by someone's > rules, not to wear abaya, not to be accompanied getting outside, and > altogether not to feel myself a secondary creature. Exactly one year ago I > won these two titles and was about the happiest person in the chess world > but this time I feel really bad. I am ready to stand for my principles and > skip the event, where in five days I was expected to earn more than I do in > a dozen of events combined. All that is annoying, but the most upsetting > thing is that almost nobody really cares. That is a really bitter feeling, > still not the one to change my opinion and my principles. The same goes for > my sister Mariya – and I am really happy that we share this point of view. == References == == Other websites == * Chessbase.com: An interview with Anna Muzychuk * Interview with Anna Muzychuk * Chessgames.com: The chess games of Anna Muzychuk * World champion in 2005 (girls U16) - photo Category:1990 births Category:Living people Category:Chess grandmasters Category:Slovenian sportspeople Category:Ukrainian chess players Category:People from Lviv",
 "title": "Anna Muzychuk"
}