{
 "id": "348209",
 "text": "Sean Justin Penn (born August 17, 1960) is an American actor, screenwriter, movie director, producer and activist. Penn won an Academy Award and Golden Globe Award for Mystic River and an Academy Award for Milk (movie). Penn was married to Madonna from 1985 until they divorced in 1989. He and Robin Wright had a daughter in 1991 and a son in 1993. The couple married in 1996 and divorced in 2010. As of February 24, 2022, Penn was in Ukraine doing (or filming) a documentary movie about the ongoing 2022 Russian invasion of Ukraine.https://www.vg.no/rampelys/film/i/9KVqpM/sean-penn-forlot-ukraina-til- fots. VG.no. Retrieved 2 March 2022 Penn went to press briefings in Kyiv, met with the president and other officials and spoke to journalists and military personnel about the Russian invasion;Sean Penn filming documentary on the ground in Ukraine, Marine Corps Times (24 February 2022) By March 2, he had left the country. ==Early life== Penn was born in Los Angeles, California, the middle son of actor Leo Penn (1921-1998) and actress Eileen Ryan (born 1928). His brothers are musician Michael Penn (born 1958) and actor Chris Penn (1965-2006). ==Filmography== Penn has starred in many movies, including: Taps, Fast Times at Ridgemont High, Colors, Casualties of War, We're No Angels, Carlito's Way, Dead Man Walking, U Turn, The Game, The Thin Red Line, Being John Malkovich, The Weight of Water, I Am Sam, Mystic River, 21 Grams, The Assassination of Richard Nixon, The Interpreter, All the King's Men, Persepolis, Milk, Fair Game, The Tree of Life and This Must Be the Place. ==References== == Other websites == * Category:American Academy Award winning actors Category:Actors from Santa Monica, California Category:American activists Category:American movie actors Category:American stage actors Category:American television actors Category:Golden Globe Award winning actors Category:Madonna Category:Movie directors from Los Angeles County, California Category:Movie producers from Los Angeles County, California Category:Screen Actors Guild Award winners Category:Screenwriters from California Category:1960 births Category:Living people",
 "title": "Sean Penn"
}