{
 "id": "348215",
 "text": "{{Infobox writer | name = Dashiell Hammett | image = | caption = Dashiell Hammett | birth_name = Samuel Dashiell Hammett | birth_date = | birth_place = Saint Mary's County, Maryland, United States | death_date = | death_place = New York City, United States | occupation = Novelist | nationality = American | period = 1929-1951 | genre = Hardboiled crime fiction, detective fiction }} Samuel Dashiell Hammett (May 27, 1894 - January 10, 1961) was an American author of crime fiction, a screenplay writer, and political activist. Some of the characters he created are Sam Spade (The Maltese Falcon), Nick and Nora Charles (The Thin Man), and the Continental Op (Red Harvest and The Dain Curse). In addition to the large influence his novels and stories had on film, Hammett \"is now widely regarded as one of the finest mystery writers of all time\". Time magazine included Hammett's 1929 novel Red Harvest on a list of the 100 best English-language novels published between 1923 and 2005. ==Early life== Hammett was born on a farm in St. Mary's County, in Maryland. His parents were Richard Thomas Hammett and Anne Bond Dashiell. Hammett was baptized a Catholic.Gores, Joe in Emery, Vince, editor, Dashiell Hammett: Lost Stories. San Francisco: Vince Emery Productions, 2005, p. 197. He grew up in Philadelphia and Baltimore. \"Sam,\" as he was known before he began writing, left school when he was 13 years old. He had several jobs before working for the Pinkerton National Detective Agency. He served as an operative for the Pinkertons from 1915 to February 1922. He took time off to serve in World War I. He did not like the agency's role in union strike- breaking.Thomas Heise, \"'Going blood-simple like the natives': Contagious Urban Spaces and Modern Power in Dashiell Hammett's Red Harvest\", Modern Fiction Studies 51, no. 3 (Fall 2005): 506. Hammett enlisted in the United States Army in 1918. He became ill with the Spanish flu and later got tuberculosis. He spent most of his time in the Army as a patient in Cushman Hospital, Tacoma, Washington. While there he met a nurse, Josephine Dolan, whom he later married. ==Marriage and family== Hammett and Dolan were married, and they had two daughters, Mary Jane (born 15 October 1921) and Josephine (born in 1926).Layman, Richard with Rivett, Julie M. (2001). \"Review\" of Selected Letters of Dashiell Hammett 1921-1960, Retrieved on 2009-06-02 Because of Hammett's tuberculosis, Josephine and the children could not live with him full time. Josephine rented a home in San Francisco, where Hammett would visit on weekends. The marriage soon ended. He continued to financially support his wife and daughters with the income he made from his writing.Gores in Emery, editor, p. 240 and 336. ==Career== Hammett used his experiences as a Pinkerton operative. Hammett said: \"All my characters were based on people I've known personally, or known about.\"Chandler, Nightmare Town, p. iii, , , https://books.google.com/books?id=xAEPAQAAMAAJ Hammett wrote most of his detective fiction during the time he was living in San Francisco (the 1920s). Specific streets and locations in San Francisco are frequently mentioned in his stories. ==Later years== From 1929 to 1930 Dashiell was romantically involved with Nell Martin, an author of short stories and several novels. He dedicated The Glass Key to her, and in turn, she dedicated her novel Lovers Should Marry to Hammett. In 1931, Hammett started a 30-year affair with playwright Lillian Hellman. This relationship was shown in the film Julia. Hammett was played by Jason Robards and Hellman by Jane Fonda. He wrote his final novel in 1934. He spent the rest of his life to left-wing activism. He was a strong anti-fascist through the 1930s. In 1937 he joined the American Communist Party. In early 1942, after the attack on Pearl Harbor, Hammett again enlisted in the United States Army. He was a disabled veteran of World War I, and a victim of tuberculosis, but he was allowed to join. He served in the Aleutian Islands. He edited an Army newspaper. He also got emphysema. . After the war, Hammett returned to political activism. He was elected President of the Civil Rights Congress (CRC) on June 5, 1946. During the 1950s he was investigated by Congress. This was part of Senator Joseph McCarthy's attempt to identify Communists. He refused to share information and was blacklisted. ==Death== A lifetime's heavy drinking of alcohol and cigarettes made Hammett's tuberculosis worse. As the years of the 1950s went on, Hammett became \"a hermit\". Hammett no longer could live alone, so the last four years of his life he spent with Hellman. On January 10, 1961, Hammett died in New York City's Lenox Hill Hospital, of lung cancer. He had been diagnosed just two months before. As a veteran of two World Wars, he was buried at Arlington National Cemetery. ==Works== ===Novels=== All the novels except The Thin Man were originally in three, four, or five parts in various magazines.Checklist of Dashiell Hammett Fiction Checklist of Dashiell Hammett Fiction * Red Harvest (published on February 1, 1929) * The Dain Curse (July 19, 1929) * The Maltese Falcon (February 14, 1930) * The Glass Key (April 24, 1931) * The Thin Man (January 8, 1934) ===Short fiction=== * \"The Gatewood Caper\", 1923 * \"Nightmare Town\", 1924 * \"The Tenth Clew\", 1924 * \"The House in Turk Street\", 1924 * \"The Girl with the Silver Eyes\", 1924 * \"Dead Yellow Women,\" 1925 * \"The Gutting of Couffignal\", 1925 * \"The Scorched Face\", 1925 * \"Corkscrew\", 1925 * \"The Whosis Kid\", 1925 * \"The Main Death,\" 1927 * \"The Big Knockover\", 1927 * \"$106,000 Blood Money\", 1927 * \"This King Business\", 1928 * \"Fly Paper\", 1929 * \"The Farewell Murder\", 1930 * \"A Man Called Spade\", 1932 * \"Too Many Have Lived\", 1932 * \"They Can Only Hang You Once\", 1932 ===Collected short fiction=== * $106,000 Blood Money (Bestseller Mystery, 1943) A paperback digest that collects two connected Op stories, The Big Knockover and $106,000 Blood Money. * Blood Money (Tower, 1943) The hardcover edition of the Bestseller Mystery title. * The Adventures of Sam Spade (Bestseller Mystery, 1944). Paperback digest that collects the three Spade stories and four others. This and the following eight digest collections were compiled and edited by Fred Dannay (one-half of Ellery Queen) with Hammett's permission. All of these were reprinted as dell map-back paperbacks. * The Continental Op (Bestseller Mystery, 1945) Paperback digest that collects four Op stories. * The Adventures of Sam Spade (Tower, 1945). The hardcover edition of the digest of the same title—this was the last time the digests were reprinted in hardcover. * The Return of the Continental Op (The Jonathan Press, 1945; Paperback digest that collects five further Op stories). * Hammett Homicides (Bestseller Mysteries, 1946). Paperback digest that collects six stories, including four that feature the Op. * Dead Yellow Women (The Jonathan Press, 1947). Paperback digest that collects six stories, including four that feature the Op. * Nightmare Town (American Mercury, 1948). Paperback digest that collects four stories, two of which feature the Op. * The Creeping Siamese (American Mercury, 1950). Paperback digest that collects six stories, three of which feature the Op. * Woman in the Dark (The Jonathan Press, 1951). Paperback digest that collects six stories, including three that feature the Op, and the three-part novelette Woman in the Dark. * A Man Named Thin (Mercury Mystery, 1962). The last paperback digest, collects eight stories, including one Op story. * The Big Knockover (Random House, 1966; an important collection, edited by Lillian Hellman, that helped revive Hammett's literary reputation; includes the unfinished novel Tulip). * The Continental Op (Random House, 1974; edited by Steven Marcus). * Woman in the Dark (Knopf, 1988; hardcover edition that collects the three parts of the title novelette; introduction by Robert B. Parker). * Nightmare Town (Knopf, 1999; hardcover collection, contents different from the digest title of the same name). * Lost Stories (Vince Emery Productions, 2005; collects 21 stories that have not been collected previously in hardcover or, in several cases, ever. Emery provides several long commentaries on Hammett's career that provide context for the stories; introduction by Joe Gores). ===Uncollected stories=== * The Diamond Wager (Detective Fiction Weekly, October 19, 1929). * On the Way (Harper's Bazaar, March 1932). ===Other publications=== * Creeps by Night; Chills and Thrills (John Day, 1931; Anthology edited by Hammett) * Secret Agent X-9 Book 1 (David McKay, 1934; collection of the comic strip written by Hammett and illustrated by Alex Raymond) * Secret Agent X-9 Book 2 (David McKay, 1934; a second collection of the comic strip). * The Battle of the Aleutians (Field Force Headquarters, Adak, Alaska, 1944; text written by Hammett, with illustrations by Robert Colodny). * Watch on the Rhine (screenplay of Hellman's play, in Best Film Plays 1943-44, Crown, 1945; also includes the screenplay for Casablanca). ==References== Category:1894 births Category:1961 deaths Category:American communists Category:American novelists Category:Deaths from lung cancer Category:Writers from Maryland Category:Burials at Arlington National Cemetery",
 "title": "Dashiell Hammett"
}