{
 "id": "348276",
 "text": "Bletchley Park is an estate in Milton Keynes, Buckinghamshire, England. It was the site of the United Kingdom's main codebreaking team during World War II. Now, Bletchley Park is home to the National Codes Centre and The National Museum of Computing. The Government Code and Cypher School (GC&CS;) and Station X, a secret radio interception station, was also at Bletchley Park. The information gained by workers at Bletchley Park was very important for the Allied war effort. In 1939, in Warsaw, the Polish military showed French and British intelligence agents their cryptanalysis of the Enigma. They promised each delegation a Polish-built Enigma. Having an actual Enigma machine, and knowing how to use it, was a much-needed start for the British work at Bletchley Park. Dilly Knox and Alan Turing were later joined by many other codebreakers and engineering staff. The high-level intelligence produced at Bletchley Park codenamed Ultra, gave crucial help to the Allied war effort. It was vital during the Battle of the Atlantic, when the German U-boat submarine fleet sank merchant shipping in an attempt to starve Britain of supplies. Winston Churchill was later to say: > The Battle of the Atlantic was the dominating factor all through the war. > Never for one moment could we forget that everything happening elsewhere, on > land, at sea, or in the air depended ultimately on its outcome. Sir Harry Hinsley (a Bletchley veteran and the official historian of British Intelligence during the Second World War) said that Ultra shortened the war by two to four years. The outcome of the war would have been uncertain without it. Transcript of a lecture given on Tuesday 19 October 1993 at Cambridge University. ==Location== One of the reasons for choosing Bletchley Park for this task was its location. By train, it is about north-west of London, from Oxford and about from Cambridge all-important university cities. Bletchley railway station is close-by, on the junction of the West Coast Main Line and the Oxford–Cambridge Varsity Line. Apart from the railway lines, Bletchley Park was not near any other likely bombing target. == References == Category:Cryptography Category:World War II Category:Museums in England Category:1938 establishments in the United Kingdom Category:1930s establishments in England Category:Buildings and structures in Buckinghamshire",
 "title": "Bletchley Park"
}