{
 "id": "348427",
 "text": "The Bering Sea is a marginal sea of the Pacific Ocean. It has a deep water basin, which then rises through a narrow slope into the shallower water above the continental shelves. The Bering Sea is separated from the Gulf of Alaska by the Alaska Peninsula. It covers over two million square kilometers, bordered on the east and northeast by Alaska, on the west by Russia's Siberia and Kamchatka Peninsula, on the south by the Alaska Peninsula and the Aleutian Islands and on the far north by the Bering Strait. The Strait connects the Bering Sea to the Arctic Ocean's Chukchi Sea. Bristol Bay is the part of the Bering Sea which separates the Alaska Peninsula from mainland Alaska. The Bering Sea is named for Vitus Bering, a Danish navigator in Russian service, who in 1728 was the first European to systematically explore it. The Bering Sea ecosystem includes resources belonging to the United States and Russia, as well as international waters in the middle of the sea. ==History== Most scientists believe that during the most recent ice age, sea level was low enough to let humans and other animals move on foot from Asia to North America across what is now the Bering Strait. This is commonly called the \"Bering land bridge\" and is believed by some—though not all— to be the first point of entry of humans into the Americas. ==Islands== Islands of the Bering Sea include: * Pribilof Islands * Komandorski Islands, including Bering Island * St. Lawrence Island * Diomede Islands * King Island * St. Matthew Island * Karaginsky Island * Nunivak Island * Sledge Island * Hagemeister Island ==Regions== Regions of the Bering Sea include: * Bering Strait * Bristol Bay * Gulf of Anadyr * Norton Sound The Bering Sea has 16 submarine canyons including the largest submarine canyon in the world, Zhemchug Canyon. ==Biodiversity== The Bering Sea is home to some of the world's most interesting wildlife. This sea supports many endangered whale species including bowhead whale, blue whale, fin whale, sei whale, humpback whale, sperm whale and the rarest in the world, the North Pacific right whale. Other marine mammals include walrus, Steller sea lion, northern fur seal, beluga, orca and polar bear. The Bering Sea is very important to the seabirds of the world. Over 30 species of seabirds and about 20 million individuals breed in the Bering Sea region. Seabird species include tufted puffins, the endangered short-tailed albatross, spectacled eider, and red-legged kittiwakes. Two Bering Sea species, the Steller's sea cow and spectacled cormorant, are extinct because of overexploitation by man. In addition, a small subspecies of Canada goose, the Bering Canada goose is extinct due to overhunting and the introduction of rats to their breeding islands. The Bering Sea supports many species of fish. At least 419 species of fish have been reported from the Bering Sea. Some species of fish support large and valuable commercial fisheries. Commercial fish species include six species of Pacific salmon; also Alaska pollock, red king crab, Pacific cod, Pacific halibut, yellowfin sole, Pacific ocean perch and sablefish. ==References== ==Other websites== Category:Seas of the Pacific Ocean Category:Geography of Alaska Category:Seas of Russia Category:Arctic",
 "title": "Bering Sea"
}