{
 "id": "348573",
 "text": "Robert William Hoskins (26 October 1942 – 29 April 2014) was a British actor. He was born in Bury St Edmunds, Suffolk and raised in Finsbury Park, London. Hoskins' movies include: The Long Good Friday, Mona Lisa and Who Framed Roger Rabbit. He won a BAFTA Award and a Golden Globe Award for his role as George in Mona Lisa. He was also awarded a doctorate degree (degree in acting) at the graduation ceremony of Royal Central School of Speech and Drama in London, England. On 8 August 2012, Hoskins said he had retired, having being diagnosed with Parkinson's disease in late 2011.Bob Hoskins to retire after Parkinson's diagnosis He died of pneumonia on the morning of 29 April 2014 in London. ==Filmography== Year Title Role Notes 1972 Up the Front Recruiting sergeant 1973 The National Health Foster 1975 Royal Flash Police Constable Inserts Big Mac 1979 Zulu Dawn CSM Williams 1980 The Long Good Friday Harold Shand Evening Standard British Film Award for Best Actor Nominated – BAFTA Award for Best Actor in a Leading Role 1982 Pink Floyd The Wall Band manager 1983 The Honorary Consul Colonel Perez Nominated – BAFTA Award for Best Actor in a Supporting Role 1984 Lassiter Inspector John Becker The Cotton Club Owney Madden 1985 The Woman Who Married Clark Gable George The Dunera Boys Morrie Mendellsohn The Black Cauldron Horned King's Guards Voice Brazil Spoor 1986 Sweet Liberty Stanley Gould Mona Lisa George BAFTA Award for Best Actor in a Leading Role Cannes Film Festival: Best Actor (tied with Michel Blanc in Ménage) Boston Society of Film Critics Award for Best Actor Golden Globe Award for Best Actor – Motion Picture Drama Kansas City Film Critics Circle Award for Best Actor London Film Critics Circle Award for Actor of the Year (tied with William Hurt in Kiss of the Spider Woman) Los Angeles Film Critics Association Award for Best Actor National Society of Film Critics Award for Best Actor New York Film Critics Circle Award for Best Actor Valladolid International Film Festival: Best Actor Nominated – Academy Award for Best Actor 1987 A Prayer for the Dying Father Michael Da Costa The Lonely Passion of Judith Hearne James Madden Evening Standard British Film Award for Best Actor 1988 Who Framed Roger Rabbit Eddie Valiant Evening Standard British Film Award for Best Actor Nominated – Golden Globe Award for Best Actor – Motion Picture Musical or Comedy Nominated – Saturn Award for Best Actor The Raggedy Rawney Darky Also director 1990 Heart Condition Jack Moony Mermaids Lou Landsky 1991 The Favour, the Watch and the Very Big Fish Louis Aubinard Shattered Gus Klein Hook Smee The Inner Circle Lavrentiy Beria 1992 Passed Away Johnny Scanlan Blue Ice Sam Garcia 1993 Super Mario Bros. Mario Mario The Big Freeze Sidney 1995 Nixon J. Edgar Hoover Nominated – Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Balto Boris Voice 1996 Rainbow Frank Bailey Also director The Secret Agent Verloc Michael Vartan Malt 1997 Twenty Four Seven Alan Darcy European Film Award for Best Actor Spice World Ginger Spice's disguise Cameo 1998 Cousin Bette Cesar Crevel 1999 Parting Shots Gerd Layton Captain Jack Jack Armistead Felicia's Journey Hilditch Genie Award for Best Performance by an Actor in a Leading Role A Room for Romeo Brass Steven Laws The White River Kid Brother Edgar 2000 American Virgin Joey 2001 Enemy at the Gates Nikita Khrushchev Last Orders Ray \"Raysie\" Johnson National Board of Review Award for Best Acting by an Ensemble Nominated – European Film Award for Best Actor (shared with ensemble cast) 2002 Where Eskimos Live Sharkey Maid in Manhattan Lionel Bloch 2003 The Sleeping Dictionary Henry DVD Exclusive Award for Best Supporting Actor in a DVD Premiere Movie Den of Lions Darius Paskevic 2004 Vanity Fair Sir Pitt Crawley Beyond the Sea Charlie Maffia 2005 Unleashed Bart Son of the Mask Odin Nominated – Golden Raspberry Award for Worst Supporting Actor Mrs Henderson Presents Vivian Van Damm National Board of Review Award for Best Acting by an Ensemble Nominated – British Independent Film Award for Best Actor Nominated – Golden Globe Award for Best Supporting Actor – Motion Picture Nominated – St. Louis Gateway Film Critics Association Award for Best Supporting Actor Stay Dr. Leon Patterson 2006 Paris, je t'aime Bob Leander Segment: \"Pigalle\" The Wind in the Willows Badger Garfield: A Tail of Two Kitties Winston Voice Hollywoodland Eddie Mannix 2007 Sparkle Vince Outlaw Walter Lewis Ruby Blue Jack Oxford International Film Festival - Best Actor Go Go Tales The Baron 2008 Doomsday Bill Nelson 2009 A Christmas Carol Mr. Fezziwig / Old Joe Motion capture; voice 2010 Made in Dagenham Albert Nominated – British Independent Film Award for Best Supporting Actor 2011 Will Davey 2012 Outside Bet Percy \"Smudge\" Smith 2012 Snow White and the Huntsman Muir == References == == Other websites == * Category:1942 births Category:2014 deaths Category:Actors from London Category:Actors from Suffolk Category:People from Finsbury Park Category:BAFTA Award winning actors Category:Deaths from pneumonia Category:English movie actors Category:English movie directors Category:English movie producers Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:People with Parkinson's disease Category:People with dyslexia",
 "title": "Bob Hoskins"
}