{
 "id": "348732",
 "text": "Songs in A Minor is the debut studio album by American singer and songwriter Alicia Keys. It was released on June 5, 2001 by J Records. Alicia Keys was signed with Colombia Records after she graduated high school. She recorded an album in 1998. Colombia Records did not like the album and did not release it. The contract with Colombia Records ended. This was because of a dispute with the label. Alicia Keys then signed a contract with Clive Davis. Keys is a classically-trained pianist. She used her pianist talents to produce and arrange her music. The album was named Songs in A Minor. However, only one song \"Jane Doe\" is in the key of A minor. When the album was released, it was given positive reviews from music critics. Most of the reviews praised Keys mix of old school jazz and contemporary R&B; and soul music. Keys was compared to artists such as Aretha Franklin, Stevie Wonder, Billie Holiday, Prince and Lauryn Hill. The album was given a lot awards. These include five Grammy Awards. Songs in A Minor debuted at number one on the Billboard 200 chart. It sold 236,000 copies the first week. It has sold 6.2 million copies in the United States and 12,000,000 copies worldwide. Rolling Stone magazine named Songs in A Minor the second best album of 2001. However, they list it at number 95 on its list of the best albums of the 2000s decade. ==Track listing== ===Notes=== * signifies an additional producer * signifies a main producer and remixer * signifies a remix producer * signifies a co-producer * signifies an additional producer and remixer ==Songs in A Minor: 20th Anniversary Edition== The 20th Anniversary Edition was released on June 4, 2021 to celebrate the 20-year anniversary of the release of Songs in A Minor. The album includes four bonus tracks including the previously unreleased \"Foolish Heart\" and \"Crazy (Mi Corazon)\". ===Track listing=== ==Charts and certifications== ===Chart positions=== Chart (2001/2002) Peak position Australian Albums Chart 3 Austrian Albums Chart 4 Belgian Albums Chart (Flanders) 8 Belgian Albums Chart (Wallonia) 10 Canadian Albums Chart 2 Dutch Albums Chart 1 Danish Albums Chart 4 European Top 100 Albums 5 Finnish Albums Chart 8 French Albums Chart 12 German Albums Chart 2 Greek International Albums Chart 5 Hungarian Albums Chart 18 Italian Albums Chart 4 Irish Albums Chart 5 Japanese Albums Chart 44 Norwegian Albums Chart 12 Polish Albums Chart 9 Swedish Albums Chart 10 Swiss Albums Chart 3 U.K Albums Chart 6 Billboard 200 1 Billboard R&B;/HipHop Albums 1 Chart positions for Songs in A Minor – 10th Anniversary Edition Chart (2011) Peak position Dutch Albums Chart 69 French Albums Chart 124 ===Year-end charts=== Chart (2001) Position Austrian Albums Chart 35 Belgian Albums Chart (Flanders) 98 Dutch Albums Chart 18 French Albums Chart 98 New Zealand Albums Chart Note: The reader must select \"2001\" → \"Albums\". 47 Swedish Albums Chart 32 Swiss Albums Chart 19 U.K Albums Chart 38 U.S. Billboard 200 13 U.S. R&B;/Hip-Hop Albums 3 Worldwide 7 Chart (2002) Position Australian Albums Chart 14 Australian Urban Albums 3 Austrian Albums Chart 44 Belgian Albums Chart (Flanders) 38 Belgian Albums Chart (Wallonia) 21 Dutch Albums Chart 21 French Albums Chart 45 New Zealand Albums Chart Note: The reader must select \"2002\" → \"Albums\". 28 Swedish Albums Chart 85 Swiss Albums Chart 28 U.K Albums Chart 31 U.S Billboard Hot 200 23 U.S R&B;/Hip-Hop Albums 12 Chart (2003) Position Australian Urban Albums 18 U.K Albums Chart 153 ===Decade-end charts=== Chart (2000–09) Position Dutch Albums Chart 72 U.S. Billboard 200 32 U.S. R&B;/Hip- Hop Albums 12 ===Certifications=== Region Certification Australia 2× platinum Austria Gold Belgium Gold Canada 5× platinum Denmark Platinum Europe 3× platinum France Platinum Germany Platinum Italy Platinum Netherlands 2× platinum New Zealand Note: The reader must select \"Chart #1299 – Sunday March 10, 2002\". Platinum Norway Gold Poland Gold Sweden Platinum Switzerland 2× platinum United Kingdom 3× platinum United States 6× platinum ===Chart procession and succession=== ==Release history== Country Date Label United States June 5, 2001 J Records Canada June 26, 2001 Sony Music United Kingdom July 23, 2001 J Records Germany September 3, 2001 Australia Japan February 27, 2002 BMG France October 29, 2002 J Records 10th Anniversary Edition Worldwide June 28, 2011 J Records == References == == Books == * * * == Other websites == * Songs in A Minor at Discogs Category:2001 albums Category:Alicia Keys Category:Neo soul albums",
 "title": "Songs in A Minor"
}