{
 "id": "348722",
 "text": ":For the Roman politician, see Mark Antony. Marco Antonio Muñiz (born September 16, 1968), is an American singer-songwriter, actor, and producer. He is better known by his stage name Marc Anthony. Anthony is the top selling tropical salsa artist of all time. He has won two Grammy Awards and three Latin Grammy awards. He has also sold over 12 million copies worldwide. He is known for his Latin salsa songs and ballads. Anthony has won many awards. He won the 2009 Congressional Hispanic Caucus Institute (CHCI) Chair's Award. and its CHCI Chair's Lifetime Achievement Award.Music Icon Marc Anthony to Receive 2009 CHCI Chair's Lifetime Achievement Award – Congressional Hispanic Caucus Institute . Chci.org (September 16, 2009). Retrieved 2011-10-01. Marc Anthony holds the record for having the most number one singles on the Billboard Tropical Songs chart. Marc Anthony is also one of the owners of the Miami Dolphins NFL team. Anthony worked with ex-wife Jennifer Lopez and director- choreographer Jamie King in late 2011 on a Latino talent series created by Simon Fuller, called Q'Viva! The Chosen. It follows Lopez and Anthony as they travel across 21 countries to find new talent. He is a philanthropist. He has won awards for his charitable work. He raises funds for orphanages in Latin America and for brain cancer. ==Personal life== In 1994, Anthony's ex- girlfriend Debbie, a NYC police officer, gave birth to their daughter Ariana. Marc married former Miss Universe Dayanara Torres on May 9, 2000. They have two sons. The marriage ended in October 2003. Anthony married Nuyorican actress and singer Jennifer Lopez on June 5, 2004. This was less than a week after his divorce. They had twins in 2006.EXCLUSIVE: Jennifer Lopez & Marc Anthony Welcome Twins!– Jennifer Lopez and Marc Anthony. People.com (February 22, 2008). Retrieved 2011-10-01. Anthony filed for divorce on April 9, 2012. On January 28, 2023, Anthony married Miss Universe Paraguay Nadia Ferreira. He was raised Roman Catholic. Anthony is a Democrat and attended the 2012 Democratic National Convention in support of President Obama's re-election. == Discography == *When the Night is Over (with Little Louie Vega) (1991) *Otra Nota (1993) *Todo a Su Tiempo (1995) *Contra la Corriente (1997) *Marc Anthony (1999) *Libre (2001) *Mended (2002) *Amar Sin Mentiras (2004) *Valió la Pena (2004) *El Cantante (2007) *Iconos (2010) *3.0 (2013) *Opus (2019) *Pa'llá Voy (2022) ==Filmography== Year Movie Role Notes 1988 East Side Story Flaco Singer 1993 Carlito's Way Cameo Appearance Sings \"Parece Mentira\" 1994 Natural Causes Marine Guard 1995 Hackers Agent Kee 1996 Big Night Cristiano 1996 The Substitute Juan Lucas 1999 Bringing Out The Dead Noel 2001 In the Time of the Butterflies Lio 2004 Man on Fire Samuel Ramos 2007 El Cantante Héctor Lavoe 2010–2011 HawthoRNe (TV series) Officer Nick Renata\"Hawthorne\" A Mother Knows (TV episode 2010) – IMDb Guest: \"A Mother Knows\", \"Picture Perfect\" Main Season 3 2011 Lopez Tonight (Talk Show) Himself Guest 2011 The Tonight Show (Talk Show) Himself Guest == References == == Other websites == *Official Website *Marc Anthony at Billboard.com * Category:1968 births Category:Singers from New York City Category:Democrats (United States) Category:American Grammy Award winners Category:Living people Category:Latin singers Category:Jennifer Lopez Category:Latin Grammy Award winners",
 "title": "Marc Anthony"
}