{
 "id": "348946",
 "text": "Margaret Sanger (September 14, 1883 – September 6, 1966) was a famous birth control rights activist. She established the American Birth Control League in 1921. This eventually became what we now know as Planned Parenthood in 1946. She helped finance biologist Gregory Pincus's creation of the birth control pill. Mrs. Sanger has been credited as the first person to use the term “birth control”. Birth control is used to describe contraception, or ways of preventing unwanted pregnancy. She paved the way for contraception to become a widely accepted social practice at a time when spreading information about birth control was prohibited by law. She studied to become a nurse at Claverack College in the early 1900s. At this time a woman’s place was seen as in the home raising children. She defied this idea and chose to pursue one of the only career paths available to her. Her career in medicine exposed her to many women who went to desperate lengths to end their pregnancies. For many of these women, this was the cause of their deaths. Mrs. Sanger saw this misery and decided to dedicate her life to freeing women from what she viewed as a life of sexual enslavement. Her passion drew her to start the very first abortion clinic in the United States in 1916. This clinic was raided and closed by the police after a few weeks. However, the clinic had already served over 450 clients. Thanks to her activism, the Comstock laws were changed in 1936. These laws had previously made sharing information about many topics, including contraception, illegal. This change allowed for more freedom of information surrounding birth control. She also pushed the American Medical Association to legitimize birth control as a valid medical practice in 1937. She was known for using public protest and strong visuals to draw attention to her cause. In addition to demonstrations she relied heavily on her magazine, Woman Rebel, to spread the word about her fight. As a rebel, feminist, and socialist, she spent the vast majority of her professional life fighting for what she saw as a basic human right: family planning. == References == Category:1879 births Category:1966 deaths Category:American activists Category:American feminists Category:American nurses Category:Educators from New York (state) Category:Industrial Workers of the World Category:Contraception",
 "title": "Margaret Sanger"
}