{
 "id": "34906",
 "text": "2013 (MMXIII) was a common year starting on Tuesday in the Gregorian calendar, the 2013th year of the Common Era (CE) and Anno Domini (AD) designations, . 2013 was the first year since 1987 to have four different digits. == Events == === January === * January 1 – Marseille, France and Košice, Slovakia become European Capital of Culture. * January 1 - The Republic of Ireland starts its six-month Presidency of the Council of the European Union. * January 1 - A crush after a New Year celebration in Abidjan, Ivory Coast, kills over 60 people. * Early January - Bushfires affect parts of New South Wales, Victoria and Tasmania, as the most widespread fires there since 2009. * January 10 - Bombings in Quetta and the northern Swat Valley, Pakistan, kill a total of 130. * January 11 - President of France Francois Hollande sends troops to Mali, after a request from Mali for foreign aid during the Northern Mali conflict. * January 16 - Islamist extremists take a group of international workers hostage in an attack on a gas facility in eastern Algeria. An Algerian attempt at rescuing the workers results in at least 39 deaths. * January 19 - The European Union introduces the new EU-wide driving licence. * January 19 - An attempted murder occurs against Bulgarian politician Ahmed Dogan, who survives, after security guards stop the gunman. * January 20 – At noon, Barack Obama starts his second term as President of the United States. The public swearing-in was on January 21, as the 20th was a Sunday. * January 26 - 37 people are killed in rioting in Port Said, Egypt, after guilty verdicts for football fans involved in violence at the end of a league game almost a year earlier. * January 27 - At least 232 people are killed in a fire at a night club in Santa Maria, Rio Grande do Sul, Brazil. * January 28 - Queen Beatrix of the Netherlands announces that she will leave the throne on April 30, when Willem-Alexander, Prince of Orange will become King. She is the third Dutch monarch in a row to leave the throne. * January 29 - James Lee Dykes takes a five-year old hostage and kills one bus driver in Alabama. * January 30 - President Barack Obama says he will try to pass an immigration reform that will stop deportation and will give citizenship to 11 million immigrants in the United States. The reform might go into law at the end of the year. === February === * February 1 - A suicide bomber in Turkey blows up the United States Embassy in Ankara. One guard is killed. * February 1 - Hillary Clinton's term as United States Secretary of State ends and nominee John Kerry was sworn in. * February 4 - Human remains found under a car park in Leicester, England, are announced to have been those of King Richard III of England. * February 4 - The hostage crisis in Alabama ended after James Lee Dykes is shot dead. The five-year-old boy survived. * February 7 - Winter Storm Nemo hits the northwestern part of the United States and parts of Canada. The snow reached about 30 inches and was the largest snow storm in some states. The storm ended on February 10. * February 9 - A massive earthquake of 6.9 hits border cities between Colombia and Ecuador. No one is killed. * February 10 - Final of the 2013 Africa Cup of Nations football competition in South Africa, which is won 1-0 by the Nigeria national football team over the Burkina Faso national football team. This is Nigeria's third African title, after 1980 and 1994. * February 11 - Pope Benedict XVI announces that he would resign from being the Pope because of ill health and age. He leaves as pope on February 28. He is the first pope to resign since 1415. * February 12 - North Korea announces that it has carried out an underground nuclear test, at a depth of around a kilometer, despite criticism from many countries around the world. * February 15 - An meteor hits in Chelyabinsk, Russia. 1,200 people are injured due to shattered glass. The meteor was about 49 feet long. * February 15 - Asteroid 2012 DA14, with an estimated diameter of 50 meters, flies to within 27,700 kilometers of Earth. * February 16 - A bomb attack in Quetta, Pakistan, kills over 80 people. * February 21 - Over 50 people are killed in a bombing in Damascus, Syria. * February 24/25 - Parliamentary election in Italy. * February 25 - Park Geunhye officially becomes the first female President of South Korea. * February 28 - Pope Benedict XVI officially resigns as Pope, as the first Pope to resign in almost 600 years. === March === * March 4 - Presidential election in Kenya: Uhuru Kenyatta is declared the winner after a few days. * March 8 - Milos Zeman becomes President of the Czech Republic. * March 8 - Funeral of Hugo Chávez in Caracas. * March 10/11 - In a referendum in the Falkland Islands, almost all voters chooses to remain a UK territory, with only three people voting against. * March 13 - Cardinal Jorge Mario Bergoglio of Argentina is elected Pope. He is the first non-European Pope since 741, and the first Latin American Pope. He chooses to be known as Pope Francis. * March 15 - Xi Jinping officially takes over as President of the People's Republic of China, with Li Keqiang as Premier, completing a transition of power in the Communist Party. * March 19 - Inauguration of Pope Francis. * March 19 - 50 people are killed in a series of bomb attacks in Baghdad, considered to coincide with the 10th anniversary of the start of the Iraq War. * March 23 - Pope Francis meets Pope Benedict XVI at Castel Gandolfo in Italy. The last time two living popes met was almost 600 years ago. * March 24 - In the Central African Republic, President Francois Bozize is overthrown after he flees to the neighboring Democratic Republic of the Congo on the onset of rebels capturing the nation's capital city, Bangui. * March 25 - The European Union agree to €10 billion bailout for Cyprus. The bailout loan will be equally split between the European Financial Stabilisation Mechanism, the European Financial Stability Facility, and the International Monetary Fund. The deal precipitates a banking crisis in the island nation. * March 27 - Canada becomes the first country to withdraw from the United Nations Convention to Combat Desertification. === April === * April 2 - The United Nations General Assembly adopts the Arms Trade Treaty to regulate the international trade of conventional weapons. * April 3 - Floods kill over 50 people in La Plata and Buenos Aires, Argentina. * April 9 - Inauguration of Uhuru Kenyatta as President of Kenya. * April 9 - A shooting in a village south of Belgrade, Serbia, kills 13 people. * April 13 - The art museum Rijksmuseum in Amsterdam re-opens after 10 years of restoration work. * April 14 - Presidential election in Venezuela: Nicolas Maduro narrowly defeats Opposition candidate Henrique Capriles. * April 15 - 2013 Boston Marathon bombings: About three hours after the winners crossed the line in the Boston Marathon, two loud explosions occur near Copley Square just before the photo bridge that marks the finish line. 3 people are killed and over 170 are injured. A few days later suspect Tamerlan Tsarnaev is killed in a shoot-out with police after killing an officer. His brother Dzhokhar Tsarnaev is later arrested. * April 16 - A magnitude 7.8 earthquake occurs, centred in southeast Iran, near the border with Pakistan. Casualties and damage are reported on both sides of the border. * April 17 - New Zealand legalizes same-sex marriage. * April 17 - The funeral of Margaret Thatcher takes place in London, attended by both current and former political figures from around the world. * April 17 - West Fertilizer Plant explosion: A fertilizer plant in West, Texas explodes, killing several people and injuring over 100. * April 19 - Jiroemon Kimura becomes the first man in history verified to reach 116 years of age. * April 20 - A magnitude 6.6 earthquake strike's China's Sichuan province, with hundreds of people killed. * April 20 - Giorgio Napolitano is elected to a second term as President of Italy, the first time an Italian President will serve a second term in office. * April 23 - The Parliament of France supports the legalizing of same-sex marriage in the country. * April 24 - A clothing factory in Dhaka, Bangladesh, collapses, killing over 1,100 people in one of the worst-ever industrial accidents. * April 26 - A fire at a psychiatric hospital near Moscow, Russia, kills 38 people. * April 28 - Enrico Letta becomes Prime Minister of Italy. At the same time, two police officers are injured in a shooting outside his office in central Rome. * April 29 - NBA player Jason Collins announces that he is openly gay, the first active sportsman in the US to do so. * April 30 - Accession of Willem-Alexander of the Netherlands, the first King of the Netherlands since 1890, after Beatrix of the Netherlands officially abdicated the throne after 33 years as Queen. === May === * May 6 - 2013 Cleveland, Ohio, missing trio: Between nine and eleven years after going missing, Amanda Berry, Gina DeJesus and Michelle Knight are freed from being held captive in Cleveland, Ohio. 52-year-old Ariel Castro is arrested and charged. * May 8 - In football, Alex Ferguson announces his intent to resign as manager of Manchester United after May 19. With over 26 years in charge, he is one of the game's longest-serving managers. David Moyes is selected to replace him. * May 10 - Solar eclipse in the South Pacific, visible in Australia. * May 11 - Nawaz Sharif is elected Prime Minister of Pakistan. * May 15 - In a study published in Nature, Oregon Health & Science University researchers describe the first creation of human embryonic stem cells by cloning. * May 18 - Eurovision Song Contest 2013 in Malmo, Sweden: Emmelie de Forest of Denmark wins with the song \"Only Teardrops\". * May 20 - Bomb attacks across Iraq kill a total of 70 people. * May 20 - The 2013 Moore tornado kills 24 people and injures 377 people in Moore, Oklahoma. * May 21 - French far-right historian and writer Dominique Venner commits suicide by gunshot inside Notre Dame Cathedral, Paris. * May 23 - Sigmundur David Gunnlaugsson becomes Prime Minister of Iceland, succeeding Johanna Sigurdardottir. * May 29 - The first same-sex marriage in France takes place. * May 31 - Start of several days of anti-government protests in Istanbul, Turkey. * May 31 - A tornado in central Oklahoma kills 9 people and is the widest ever measured. * The 2013 Stockholm riots erupt in Stockholm, Sweden. === June === * early June - After heavy rain in May, widespread flooding occurs in Central Europe, affecting parts of Germany, Austria, Switzerland, the Czech Republic, Slovakia, Hungary and Poland. 19 people in total are known to have died, most of them in the Czech Republic. * June 5 - Nawaz Sharif becomes Prime Minister of Pakistan. * June 8 - Former President of South Africa Nelson Mandela is re-hospitalized for a lung infection in Pretoria. * June 9 - In an interview with The Guardian newspaper, Edward Snowden says that he leaked information about surveillance carried out by the National Security Agency. * June 9 - US President Barack Obama meets for talks with Chinese leader Xi Jinping. * June 9 - Rafael Nadal sets a record in singles tennis when he wins the French Open title for the 8th time. This is a record for any Grand Slam tournament. * June 12 - The government of Greece takes the national broadcaster off air. * June 14 - Hassan Rouhani is elected President of Iran. * June 14 onwards - Major flooding occurs in the northern Indian states of Uttarakhand, Uttar Pradesh, Himachal Pradesh and Haryana, killing at least 1,000 people and leaving many people missing. Parts of Nepal and western Tibet also experience heavy rainfall. * June 15 to June 30 - The 2013 FIFA Confederations Cup is held in Brazil, while there are major protests against corruption in the country. * June 19 - A haze spreads across Southeast Asia, mainly affecting Singapore, Indonesia and Malaysia, causing major fog and disruption. Illegal forest fires on Sumatra are blamed. * June 23 - Edward Snowden leaves Hong Kong for Moscow. * June 23 - Nelson Mandela's health is said to be in a \"critical\" state. * June 25 - Emir of Qatar, Hamad bin Khalifa Al Thani, hands power to his son, Tamim bin Hamad Al Thani. * June 27 - Kevin Rudd becomes Prime Minister of Australia for a second time, after Julia Gillard loses a vote of confidence within the Australian Labor Party. === July === * July 1 - Croatia becomes the 28th member country of the European Union. * July 1 - Lithuania starts its six-month Presidency of the Council of the European Union. * July 3 - During mass protests across the country, Egyptian President Mohamed Morsi is deposed in a coup d'état. * July 3 - King Albert II of Belgium announces that he will leave the throne on July 21. * July 6 - A 73-car unmanned freight train carrying crude oil crashes into the centre of the town of Lac-Megantic, southern Quebec, Canada, and explodes, killing at least 24 people. * from July 6 - Floods affect parts of Sichuan and Yunnan provinces in south-central China, killing at least 58 people and leaving 175 missing. * July 11 - The government of Luxembourg, led by Jean-Claude Juncker, is brought down by a scandal over its state security agency. New elections are set for October. * July 12 - A train crash occurs at a station in Bretigny-sur-Orge, south of Paris, France, killing six people. * July 15 - Scientists report the discovery of another moon around the planet Neptune. The moon is called S/2004 N 1. * July 16 - At a school in Bihar state, northern India, 23 children die after eating school meals poisoned with insecticide. * July 18 - Detroit, Michigan, files for Chapter 9 bankruptcy. * July 21 - Albert II of Belgium leaves the throne after almost 20 years as king. His son becomes King Philippe of Belgium, and is the 7th King of the Belgians. * July 21 - Chris Froome wins the 100th Tour de France. * July 22 - Two earthquakes in Gansu province, People's Republic of China, kill at least 89 people. * July 22 - Catherine, Duchess of Cambridge gives birth to a baby boy, Prince George of Cambridge. He is third in line to become King of the United Kingdom and Commonwealth realms. * July 24 - A train with 218 passengers on board crashes in Santiago de Compostela, Galicia, northwest Spain, killing at least 79 people and injuring at least 130. It was travelling from Madrid to Ferrol on the Galician coast. * July 25 - Tunisian opposition politician Mohamed Brahmi is shot dead, causing widespread protests. * July 26 - 2013 Cleveland, Ohio, missing trio: Ariel Castro pleads guilty to all charges, and is sentenced to life in prison on August 1. * July 28 - A coach crash near Avellino, close to Naples, Italy, kills 39 people. * July 29 - United States Secretary of State John Kerry hosts a peace conference between Palestine and Israel in Washington, D.C. to make peace between the two nations. It was the first peace conference between Palestine and Israel in over three years. * July 31 - An election is held in Zimbabwe, with President Robert Mugabe claiming victory, though there are reports of irregularities. === August === * August 1 - A court in Italy confirms the prison sentence against Silvio Berlusconi on charges of tax fraud. * August 1 - Edward Snowden is given temporary asylum in Russia. * August 3 - Hassan Rouhani becomes President of Iran. * August 4 - American embassies in the Middle East and in parts of North Africa are closed due to a threat from Al-Qaeda. These embassies will be closed throughout the month of August. * August 5 - The first laboratory-grown beef burger is eaten in London. * August 10 - Dozens of people are killed in a series of bomb attacks in Baghdad. * August 14 - Egypt declares a national state of emergency as hundreds of pro-Mohamed Morsi demonstrators are killed by security forces. * August 14 - Carmelo Flores Laura of Bolivia might become the world's oldest living person in history if his documents prove that he is in fact 123 years old, after his baptism certificate is released. It is hard to prove as birth certificates did not exist in Bolivia until 1940. * August 15 - A new species of mammal is found in northwestern South America. Scientists name the new species Olinguito. * August 15 - Horacio Cartes becomes President of Paraguay. * August 21 - A suspected chemical gas attack occurs in Syria. * August 26 - UN weapons inspectors start taking samples at the scene of a suspected chemical gas attack on Syria. * August 28 - The 50th anniversary of Martin Luther King, Jr.'s speech \"I Have A Dream\" is celebrated across the United States. A ceremony is held at the Lincoln Memorial in Washington, D.C.. Barack Obama, Bill Clinton, and Jimmy Carter attend the celebration. * August 29 - The majority of MPs in the British House of Commons votes against military action in Syria. === September === * September 1 - Former South African President Nelson Mandela is released after a three-month stay. * September 3 - Ariel Castro, the man responsible for 2013 Cleveland, Ohio, missing trio commits suicide in his prison cell in Cleveland, Ohio. * September 4 - The United States Congress approves for a forced military strike on Syria to remove President Bashar al-Assad from power. * September 6 - NASA's unmanned LADEE space probe is launched to the Moon. * September 7 - Parliamentary election in Australia: The coalition led by the Liberal Party of Australia, under Tony Abbott, defeats the Australian Labor Party under Kevin Rudd. * September 7 - Tokyo is announced as the city which will host the 2020 Summer Olympics, beating competition from Istanbul and Madrid. * September 8 - Mamnoon Hussain becomes President of Pakistan. * September 9 - Parliamentary election in Norway: The Centre-Right Venstre Party wins the most seats in parliament. * September 10 - Thomas Bach is elected to replace Jacques Rogge as the head of the International Olympic Committee. * September 12 - Colorado is hit by major flooding. * September 15 - Mexico is struck by Hurricane Ingrid on the east coast, and Hurricane Manuel on the west coast, causing massive flooding, and killing at least 67 people. * September 16 - A lone gunman armed with a shotgun, Aaron Alexis, killed twelve people and injured fourteen others in a mass shooting at Washington Navy Yard in Washington, D.C. The attack occurred around 8:20 a.m. in Building 197. Alexis was subsequently killed by police. * September 18 - Tony Abbott becomes the 28th Prime Minister of Australia. * September 21 - At least 62 people are killed in a terrorist attack and siege on the Westgate Shopping Mall in Nairobi, Kenya. Al-Shabaab claims responsibility. * September 22 - A bomb attack on a church in Peshawar kills at least 70 people. * September 22 - Elections are held for the German Bundestag. Angela Merkel's CDU/CSU coalition comes close to an overall majority, while the FDP is voted out of the Bundestag. * September 24 - A magnitude 7.7 earthquake in southern Pakistan kills over 400 people. * September 29 - An election to the Austrian parliament is held. The coalition led by Chancellor Werner Faymann narrowly wins. === October === * October 1 - The United States Government temporarily shuts down over failure to agree on a budget. * October 3 - A boat travelling from North Africa, carrying migrants from the East African countries of Eritrea and Somalia, catches fire off the coast of Italy's Mediterranean Sea island of Lampedusa, killing over 360 people. * October 3 - The Gambia withdraws from the Commonwealth. * October 8 - Francois Englert of Belgium and Peter Higgs of the United Kingdom win the Nobel Prize in Physics for their work on finding the Higgs boson particle. * October 10 - Delegates from some 140 countries and territories signed Minamata Treaty, a UNEP treaty designed to protect human health and the environment from emissions and releases of mercury and mercury compounds. * October 11 - The Organisation for the Prohibition of Chemical Weapons wins the Nobel Peace Prize. * October 11 - A boat travelling from North Africa, carrying migrants, gets into difficulty off Lampedusa, killing over 30 people, in the second such incident there in the space of a week. * mid-October - Bush fires affect large parts of New South Wales, Australia. * October 16 - Erna Solberg becomes Prime Minister of Norway, succeeding Jens Stoltenberg. * October 16 - The United States Government reopens after the shutdown. * October 20 - An election is held in Luxembourg. * October 27 - Sebastian Vettel wins the Formula One world championship, becoming the youngest driver to achieve this four times in-a- row. * October 28 - The St Jude Storm, also referred to as \"Christian\", \"Carmen\" and \"Simone\", hits the southern UK, northern France, the Low Countries, Germany, Denmark and southern Sweden, killing at least 15 people and disrupting transport services. Denmark records its highest-ever wind speed during the storm. * October 29 - A new underground rail link is opened across the Bosphorus in Istanbul. === November === * November 3 – Hybrid (total/annular) solar eclipse. * November 5 - Bill de Blasio wins the 2013 New York City mayoral election in a landslide. He becomes the first New York City Democratic mayor in over two decades. He is expected to succeed Michael Bloomberg as mayor on January 1, 2014. * November 8 - Typhoon Haiyan strikes the Philippines with some of the strongest typhoon winds recorded, destroying many towns and cities, and killing thousands of people. * November 10 - Spanish motorcycle racer Marc Marquez becomes the youngest Moto GP world champion, at age 20. * November 12 - One World Trade Center is announced as having become the tallest building in the United States. * November 12 - Three Studies with Lucian Freud, a series of paintings by Francis Bacon, becomes the most expensive work of art sold at auction, selling for 142.4 million US Dollars. * November 16 - Sachin Tendulkar, one of the greatest cricketers of all time, retires from playing after his last test match. * November 21 - A supermarket collapse in Riga, Latvia, kills over 50 people. * November 22 - 50th anniversary of the Assassination of John F. Kennedy is honored across the United States and parts of Ireland. * November 24 - Iran agrees to limit their nuclear development program in exchange for sanctions relief. * November 28 - Three unpublished books by J. D. Salinger is leaked online to the public. * November 29 - A helicopter crash into the Clutha pub in Glasgow, Scotland, kills 10 people. === December === * Throughout December - Anti-government protests in Thailand and Ukraine. * December 1 - A train crash in New York City's The Bronx area, on the banks of the Hudson River, kills 4 people and injures over 60. * December 4 - Xavier Bettel becomes Prime Minister of Luxembourg, ending Jean-Claude Juncker's almost-19-year period in office. * December 6 - The groups for the 2014 FIFA World Cup are drawn. * December 7 - Ninth Ministerial Conference of the World Trade Organization delegates sign the Bali Package agreement aimed at loosening global trade barriers. * December 10 - A public memorial service is held for Nelson Mandela in a football stadium in Johannesburg where he had made his last public appearance. * December 14 - Chinese spacecraft Chang'e 3, carrying the Yutu rover, becomes the first spacecraft to \"soft\"-land on the Moon since 1976 and the third ever robotic rover to do so. * December 15 - The funeral of Nelson Mandela takes place. * December 15 - Michelle Bachelet is elected President of Chile. She previously held this position from 2006 to 2010. * December 23 - Heavy winds and rain cause destruction across Northern Europe. Meanwhile, snowstorms cut electricity from millions of homes in the Northeastern US and southeastern Canada. * December 29 - A bomb attack on a train station in Volgograd, southern Russia, kills at least 16 people. A similar attack on a bus in the same city kills at least 15 people a day later. * December 29 - Formula One racing champion Michael Schumacher is severely injured in a skiing accident in the French Alps. * December 31 – Australia's last analogue Television signal was turned off. == Nobel Prizes == * Chemistry - Martin Karplus, Michael Levitt, and Arieh Warshel * Economics - Eugene Fama, Lars Peter Hansen and Robert J. Shiller * Literature - Alice Munro * Peace - Organisation for the Prohibition of Chemical Weapons * Physics - François Englert and Peter Higgs * Physiology or Medicine - James Rothman, Randy Schekman, and Thomas C. Südhof == Major religious holidays == * January 6 - Epiphany or Twelfth Night, important in some countries' Christmas celebrations. * January 7 – Christmas – Eastern Orthodox Churches * February 1 – Imbolc, a Cross-quarter day (Celebrated on February 2 in some places). * February 2 - Candlemas (Western Christianity) * February 10 - Chinese New Year - Year of the Snake * February 12 - Shrove Tuesday (Western Christianity) * February 13 - Ash Wednesday (Western Christianity), start of Lent * March 20 – March Equinox, also known as Ostara. * March 24 - Palm Sunday (Western Christianity) * March 28 - Maundy Thursday (Western Christianity) * March 29 - Good Friday (Western Christianity) * March 31 – Easter (Western Christianity) * April 1 - Easter Monday (Western Christianity) * May 1 – Beltane, a Cross-quarter day. * May 5 – Easter (Eastern Christianity) * May 9 - Feast of the Ascension (Western Christianity) * May 19 - Pentecost (Western Christianity) * May 30 - Corpus Christi (Western Christianity) * June 21 – June solstice, also known as Midsummer or Litha, in the Northern Hemisphere. * July 9 - Beginning of Ramadan, a month of fasting in the Islamic calendar. * August 1 – Lammas, a Cross-quarter day. * August 7 - Eid-al-Fitr, end of Ramadan * August 15 - Assumption of Mary (Roman Catholicism) * September 4 - Rosh Hashanah, new year festival in Judaism. * September 14 - Yom Kippur (Judaism) * September 16 - Onam (Hinduism), celebrated in Kerala. * September 22 – September Equinox, also known as Mabon. * November 1 – Samhain, a Cross-quarter day and Neopagan new year. * November 1 - All Saints Day (Roman Catholicism) * November 2 - All Souls Day (Roman Catholicism) * November 3 - Divali (Hinduism) * November 27 - Hanukkah (Judaism) * December 1 - First Sunday of Advent (Western Christianity) * December 21 – December solstice, also known as Yule in the Northern Hemisphere. * December 24 - Christmas Eve (Western Christianity) * December 25 – Christmas (Western Christianity) * December 26 - Boxing Day/Saint Stephen's Day/Second Day of Christmas (Western Christianity) == In fiction and popular culture == === Comic books === * X-Men: The X-Men try to overthrow the dystopian rule of the robot Sentinels in the Days of Future Past storyline (1980). * In the comic book Legion of Super-Heroes (Number 6, July 2005, DC Comics), Cosmic Boy avers that the Bar Code on the cover of comic books is \"destined to become outlawed in the Design Aesthetic Wars of 2013.\" === Computer and video games === * Shattered Union (2005): The District of Columbia is destroyed this year by a low-yield nuclear weapon. * Ghost Recon: Advanced Warfighter (2006) * Gyakuten Saiban 3 (2007), Flashbacks to this year occur. === Movies === * Escape From LA (1996) * The Postman (1997) * A Scanner Darkly (2006) === Television === * In the BBC mockumentary Time Trumpet, British retail chain, Tesco launches an invasion of Denmark on January 21 of this year. * The last few minutes of the Season 4 finale and Season 5 of Desperate Housewives is set in this year. * BBC Drama Spooks: Code 9 is set in this year. * The anime version of Death Note ends in this year. === Mathematical interest === * The date will comprise four distinct digits, for the first time since 1987. * The date will comprise of four consecutive digits, for the first time since 1980. == Births == * July 22 - Prince George of Cambridge, 3rd in-line to the British throne == Deaths == == References == Category:2013",
 "title": "2013"
}