{
 "id": "349006",
 "text": "The human microbiome (or human microbiota) is the collection of microorganisms which live on us. They live on the skin, in the saliva and mouth, in the eyes, and in the gut and the rest of the gastrointestinal tract. They include bacteria, archaea, fungi and single-celled eukaryotes ('protozoa').Mundasad, Smitha 2012. Human Microbiome Project reveals largest microbial map. BBC News: Health Everyone carries around far more of these microbes than the number of human cells in the body. The human body has about 100 trillion cells, and carries about ten times as many microorganisms in the intestines alone. The microbiome is \"the ecological community of commensal, symbiotic, and pathogenic microorganisms that literally share our body space\".Lederberg J. & McCray A.T. 2001. ’Ome Sweet ’Omics — a genealogical treasury of words. Scientist. The NIH HMP Working Group. 2009. The NIH Human Microbiome Project. Genome Res. 19(12): 2317–2323. The term was popularized by Joshua Lederberg. He thought the microorganisms living in the human body in health and disease were important. Many scientific articles distinguish \"microbiome\" and \"microbiota\" to describe either the collective genomes of the microorganisms that live in an environmental niche or the microorganisms themselves, respectively.Backhed F. et al 2005. Host-bacterial mutualism in the human intestine. Science 307, 1915. Turnbaugh P.J. et al 2007. The Human Microbiome Project. Nature. 449:804-810. Ley R.E; Peterson D.A. & Gordon J.I. 2006. Ecological and evolutionary forces shaping microbial diversity in the human intestine. Cell. 124: 837-848. However, by the original definitions these terms are largely synonymous. Some of these organisms are useful for humans. However, most have no known effect. They are just symbionts: they live with us. Those which are expected to be present are members of the normal flora. Under normal circumstances they do not cause disease, but may even help our health. Studies in 2009 asked whether our health is damaged if we reduce this biota.Bugs inside: what happens when the microbes that keep us healthy disappear?, Katherine Harmon, Scientific American, December 2009, accessed 27 December 2009 This is certainly the case with gut flora. Although \"flora\" refers to plants rather than bacteria, the term 'gut flora' is widely used and familiar to biologists. 'Biota' refers to the total collection of organisms in an ecosystem. The term 'microbiota' is best for bacteria and other microorganisms, but no doubt 'flora' will often be used. The microbes being discussed are generally non-pathogenic (do not cause disease unless they grow abnormally); they exist in harmony and symbiotically with their hosts. Researchers have learned that much of the population of microbes found in the human body are not bacteria but a very old class of single-celled organisms called archaea. They include methanogens which produce methane and may cause flatulence. == Related pages == *Enterotype == References == Category:Prokaryotes Category:Microbiology Category:Humans Category:Health",
 "title": "Human microbiome"
}