{
 "id": "349136",
 "text": "This is a list of the UNESCO World Heritage Sites in Arab countries.World Heritage Centre - World Heritage List Some of these countries are geographically in Asia and some in Africa. ==List== The list below has an image of the site or part of the site; the name; the location; the nominating state party; the criteria met by the site, including if it is a cultural, natural or mixed; the area in hectares and acres; the year the site was added; and a description of the site. Image Site Location Criteria Area (ha) Area (acre) Year Description Al Qal'a of Beni Hammad AlgeriaM'Sila Province, Cultural:AlgAlq (iii) 1980 The ruins of the first capital of the Hammadid emirs. It was formed in 1007 and ended in 1152. Djémila AlgeriaSétif Province, Cultural:AlgDje (iii)(iv) 1982 An interesting example of a Roman town in a mountain location. Kasbah of Algiers AlgeriaAlgiers Province, Cultural:AlgKas (ii)(v) 1982 The Kasbah is a unique kind of medina, or Islamic city. It stands in one of the finest coastal sites on the Mediterranean, overlooking the islands where a Carthaginian trading-post was formed in the 4th century BC. M'zab Valley AlgeriaGhardaïa Province, Cultural:AlgMzb (ii)(iii)(v) 1982 A traditional human habitat, formed in the 10th century by the Ibadites. It is around their five ksour (fortified cities). Tassili n'Ajjer AlgeriaIllizi Province and Tamanrasset Province, Mixed:AlgTas (i)(iii)(vii)(viii) 1982 This site has one of the most important groupings of prehistoric cave art in the world. More than 15,000 drawings and engravings record the climatic changes, the animal migrations and the evolution of human life on the edge of the Sahara from 6000 BC to the first centuries of the present era. — Timgad AlgeriaBatna Province, Cultural:AlgTim (ii)(iii)(iv) 1982 Timgad is on the northern slopes of the Aurès mountains. It was formed as a military colony by the Emperor Trajan in AD 100. — Tipaza AlgeriaTipaza Province, Cultural:AlgTip (iii)(iv) 1982 Tipasa was an ancient Punic trading-post conquered by Rome. It has a unique group of Phoenician, Roman, palaeochristian and Byzantine ruins alongside indigenous monuments such as the Kbor er Roumia, the great royal mausoleum of Mauritania. Qal'at al-Bahrain – Ancient Harbour and Capital of Dilmun BahrainNorthern Governorate, Cultural:BahQal (ii)(iii)(iv) 2005 This was the capital of the Dilmun, one of the most important ancient civilizations of the region. It has the richest remains of this civilization. Abu Mena EgyptAlexandria Governorate, Cultural:EgyAbu (iv) 1979 The church, baptistry, basilicas, public buildings, streets, monasteries, houses and workshops in this early Christian holy city were built over the tomb of the martyr Menas of Alexandria, who died in A.D. 296. Ancient Thebes with its Necropolis EgyptLuxor Governorate, Cultural:EgyAnc (i)(iii)(vi) 1979 Thebes, the city of the god Amon, was the capital of Egypt during the period of the Middle and New Kingdoms. Historic Cairo EgyptCairo Governorate, Cultural:EgyHis (i)(v)(vi) 1979 One of the world's oldest Islamic cities, with its famous mosques, madrasas, hammams and fountains. Founded in the 10th century, it became the new centre of the Islamic world, reaching its golden age in the 14th century. Memphis and its Necropolis – the Pyramid Fields from Giza to Dahshur EgyGiza Governorate, Cultural:EgyMem (i)(iii)(vi) 1979 The capital of the Old Kingdom of Egypt has some extraordinary funerary monuments, including rock tombs, ornate mastabas, temples and pyramids. In ancient times, the site was one of the Seven Wonders of the World. Nubian Monuments from Abu Simbel to Philae EgyAswan Governorate, Cultural:EgyNub (i)(iii)(vi) 1979 This outstanding archaeological area has such magnificent monuments as the Temples of Ramses II at Abu Simbel and the Sanctuary of Isis at Philae. They were saved from the rising waters of the Nile thanks to the International Campaign launched by UNESCO, in 1960 to 1980. Saint Catherine Area EgySouth Sinai Governorate, Cultural:EgySai (i)(iii)(iv)(vi) 2002 The Orthodox Monastery of St Catherine stands at the foot of Mount Horeb. This is where, the Old Testament records, Moses received the Tablets of the Law. The mountain is known and revered by Muslims as Jebel Musa. The entire area is sacred to three world religions: Christianity, Islam, and Judaism. Wadi Al-Hitan (Whale Valley) EgyFaiyum Governorate, Natural:EgyWad (viii) 2005 Located in a desert, the site has fossil remains of the now extinct Archaeoceti, a suborder of whales. This shows the evolution of the whales from a land-based to an aquatic mammal. — Ashur (Qal'at Sherqat) IrqSalah ad Din Governorate, Cultural:IrqAss (iii)(iv) 2003 The ancient city of Ashur is on the Tigris River in northern Mesopotamia. The city dates back to the 3rd millennium BC. From the 14th to the 9th centuries BC it was the first capital of the Assyrian Empire. The city was destroyed by the Babylonians, but revived during the Parthian period in the 1st and 2nd centuries AD. Hatra IrqNinawa Governorate, Cultural:IrqHat (ii)(iii)(iv)(vi) 1985 Hatra was a large fortified city under the influence of the Parthian Empire and capital of the first Arab Kingdom. It withstood invasions by the Romans in A.D. 116 and 198 thanks to its high, thick walls reinforced by towers. Samarra Archaeological City IrqSalah ad Din Governorate, Cultural:IrqSam (ii)(iii)(iv) 1985 Samarra Archaeological City is the site of a powerful Islamic capital city. It ruled over the provinces of the Abbasid Empire from Tunisia to Central Asia for a century. The 9th-century Great Mosque and its spiral minaret are among the numerous remarkable architectural monuments of the site, 80% of which remain to be excavated. The Old City of Jerusalem and its Walls† PalJerusalem, Cultural:JerOld (ii)(iii)(vi) -- -- 1985 As a holy city for Judaism, Christianity and Islam, Jerusalem has always been of great symbolic importance. It is recognized by all three religions as the site of Abraham's sacrifice. Hebron/Al-Khalil Old Town† PalHebron Governate Cultural: (ii)(iv)(vi) 20.6 2017 Palestine: Land of Olives and Vines – Cultural Landscape of Southern Jerusalem, Battir† PalBethlehem Governate Cultural: (iv)(v) 349 2014 Saint Hilarion Monastery/Tell Umm Amer† PalDeir al-Balah Governate Cultural: (ii)(iii)(vi) 1.33 2024 Ancient Jericho/Tell es-Sultan PalJericho Governate Cultural (iii)(iv) 5.93 2023 Birthplace of Jesus: Church of the Nativity and the Pilgrimage Route, Bethlehem PalBethlehem Governate Cultural: (iv)(vi) 2.98 2012 Petra JorMa'an Governorate, Cultural:JorPet (i)(iii)(iv) -- -- 1985 Lived in since prehistoric times, between the Red Sea and the Dead Sea, this city was an important crossroads between Arabia, Egypt and Syria-Phoenicia. Petra is half-built, half-carved into the rock, and is surrounded by mountains. Qasr Amra JorZarqa Governorate, Cultural:JorQas (i)(iii)(iv) -- -- 1985 Built in the early 8th century, this exceptionally well-preserved desert castle was both a fortress with a garrison and a residence of the Umayyad caliphs. Um er-Rasas (Kastrom Mefa'a) JorMadaba Governorate, Cultural:JorUme (i)(iv)(vi) 2005 Most of this archaeological site, which started as a Roman military camp and grew to become a town from the 5th century, has not been excavated. It has remains from the Roman, Byzantine and Early Muslim periods (end of 3rd to 9th centuries AD) and a fortified Roman military camp. Wadi Rum Protected Area JorAqaba Governorate, Mixed:JorWad (iii)(v)(vii) 2005 The 74,000-hectare property is in southern Jordan, near the border with Saudi Arabia. It has a varied desert landscape, as well as 25,000 rock carvings with 20,000 inscriptions trace the evolution of human thought and the early development of the alphabet. Anjar LbnBeqaa Governorate, Cultural:LbnAnj (iii)(iv) -- -- 1984 The city of Anjar was founded by Caliph Walid I at the beginning of the 8th century. The ruins reveal a very regular layout, like the palace-cities of ancient times, and are a unique testimony to city planning under the Umayyads. Baalbek LbnBeqaa Governorate, Cultural:LbnBal (i)(iv) -- -- 1984 Baalbek, where a triad of deities was worshipped, was known as Heliopolis during the Hellenistic period. It kept its religious function during Roman times, when the sanctuary of the Heliopolitan Jupiter had thousands of pilgrims. Byblos LbnMount Lebanon Governorate, Cultural:LbnByb (iii)(iv)(vi) -- -- 1984 Lived in since Neolithic times, it has been closely linked to the legends and history of the Mediterranean region for thousands of years. Ouadi Qadisha (the Holy Valley) and the Forest of the Cedars of God (Horsh Arz el-Rab) LbnNorth Lebanon Governorate, Cultural:LbnOua (iii)(iv) -- -- 1998 The Qadisha valley is one of the most important early Christian monastic settlements in the world. Nearby are the remains of the great forest of cedars of Lebanon, highly prized in antiquity for the construction of great religious buildings. Tyre LbnSouth Lebanon Governorate, Cultural:LbnTyr (iii)(vi) 1984 Tyre ruled the seas and founded colonies such as Cadiz and Carthage, but its historical role declined at the end of the Crusades. There are important archaeological remains, mainly from Roman times. Archaeological Site of Cyrene LibJabal al Akhdar, Cultural:LibArc (ii)(iii)(vi) -- -- 1982 A colony of the Greeks of Thera, Cyrene was one of the main cities in the Hellenic world. It was Romanized and remained a great capital until the earthquake of 365. A thousand years of history is written into its ruins, which have been famous since the 18th century. Archaeological Site of Leptis Magna LibKhoms, Cultural:LibArc (i)(ii)(iii) -- -- 1982 Leptis Magna was made larger by Septimius Severus, who was born there and later became emperor. It was one of the most beautiful cities of the Roman Empire, with its imposing public monuments, harbour, market-place, storehouses, shops and residential districts. Archaeological Site of Sabratha LibZawiya District, Cultural:LibArc (iii) -- -- 1982 A Phoenician trading-post that served as an outlet for the products of the African hinterland, Sabratha was part of the short-lived Numidian Kingdom of Massinissa before being Romanized. It was rebuilt in the 2nd and 3rd centuries A.D. Old Town of Ghadamès LibNalut District, Cultural:LibGha (v) -- -- 1986 Ghadamès, known as 'the pearl of the desert', stands in an oasis. It is one of the oldest pre-Saharan cities and an outstanding example of a traditional settlement. Amphitheatre of El Jem TunMahdia Governorate, Cultural:TunEld (iv)(vi) 1979 The Amphitheatre of El Jem, built during the 3rd century, is North Africa's largest coliseum with a capacity of 35,000 spectators. Rock-Art Sites of Tadrart Acacus LibFezzan, Cultural:LibRoc (iii) -- -- 1985 The rocky massif has thousands of cave paintings in very different styles, dating from 12,000 BCE to 100 CE. Ancient Ksour of Ouadane, Chinguetti, Tichitt and Oualata MauritaniaOuadane, Chinguetti, Tichitt, and Oualata, Cultural:MauAnc (iii)(iv)(v) -- -- 1996 Founded in the 11th and 12th centuries to serve the caravans crossing the Sahara, these trading and religious centres became focal points of Islamic culture. They have managed to keep an urban fabric that grew between the 12th and 16th centuries. Banc d'Arguin National Park MauritaniaNouadhibou and Azefal, Natural:MauBan (ix)(x) 1989 The park has sand dunes, coastal swamps, small islands, and shallow bodies of water, all bordering the coast of the Atlantic Ocean. Birds are often found to migrate in the area, along with various species of sea turtles and dolphins, whose presence fishermen often use to attract fish. Archaeological Site of Volubilis MorMeknès-Tafilalet, Cultural:MorArc (ii)(iii)(iv)(vi) 1997 The important Roman outpost of Volubilis was formed in the 3rd century BCE to become the capital of Mauritania. It had many buildings, the remains of which have mostly survived to this day. Historic City of Meknes MorMeknès-Tafilalet, Cultural:MorHis (iv) -- -- 1996 The former capital was formed in the 11th century and turned into an impressive city in Spanish-Moorish style during the 17th and 18th centuries. Ksar of Ait-Ben-Haddou MorSouss-Massa-Draâ, Cultural:MorKsa (iv)(v) 1987 The ksar is a group of earthen building surrounded by high walls, a traditional pre-Saharan habitat. Medina of Essaouira (formerly Mogador) MorMarrakesh-Tensift-El Haouz, Cultural:MorEss (ii)(iv) 2001 The fortified seaport built during the late 18th century has a mix of North African and European architecture. It has been a major trading hub between Sahara and Europe. Medina of Fez MorFez, Cultural:MorMedinaofFez (ii)(v) 1981 The former capital was formed in the 9th century and has the world's oldest university. The main monuments date from the 13th and 14th centuries. Medina of Marrakesh MorMarrakesh-Tensift-El Haouz, Cultural:MorMedinaofMarra (i)(ii)(iv)(v) 1985 The town was formed in the 1070s and remained a political, economic and cultural center for a long time. Monuments from that period include the Koutoubia Mosque, the kasbah and the battlements. The city also has newer architectural jewels, including palaces. Medina of Tétouan (formerly known as Titawin) MorTangier-Tetouan, Cultural:MorMedinaofTet (ii)(iv)(v) 1997 Morocco's most complete medina served as the main point of contact between Morocco and Andalusia during the 8th century. After the reconquista, the town was rebuilt by Andalusian refugees. Portuguese City of Mazagan (El Jadida) MorDoukkala-Abda, Cultural:MorPor (ii)(iv) 2004 The fortification was built in Renaissance military design in the early 16th century, and taken over by Morocco in 1769. Surviving Portuguese buildings include the cistern and a Gothic church. — Aflaj Irrigation Systems of Oman OmnSharqiyah and Batinah Regions, Cultural:OmnAfl (v) 2006 The property includes five aflaj irrigation systems and is representative of some 3,000 such systems still in use in Oman. The origins of this system of irrigation may date back to AD 500, but archaeological evidence suggests that irrigation systems existed in this extremely arid area as early as 2500 BC. — Archaeological Sites of Bat, Al-Khutm and Al-Ayn OmnAd Dhahirah Region, Cultural:OmnArc (iii)(iv) -- -- 1988 The protohistoric site of Bat is near a palm grove in the interior of the Sultanate of Oman. Together with the neighbouring sites, it forms the most complete collection of settlements and necropolises from the 3rd millennium B.C. in the world. — Bahla Fort OmnAd Dakhiliyah Region, Cultural:OmnBah (iv) -- -- 1987 The oasis of Bahla owes its prosperity to the Banu Nebhan, the dominant tribe in the area from the 12th to the end of the 15th century. The ruins of the large fort, with its walls and towers of unbaked brick and its stone foundations, is a remarkable example of this type of fortification. — Land of Frankincense OmnDhofar Governorate, Cultural:OmnArc (iii)(iv) 2000 The frankincense trees of Wadi Dawkah show the trade in frankincense that was strong in this region for many centuries. It was one of the most important trading activities of the ancient and medieval world. Al- Hijr Archaeological Site (Madâin Sâlih) SauAl Madinah Province, Cultural:SauAlh (ii)(iii) 2008 Formerly known as Hegra it is the largest conserved site of the civilization of the Nabataeans south of Petra in Jordan. It has well-preserved monumental tombs with decorated facades dating from the 1st century BC to the 1st century AD. At-Turaif District in ad-Dir'iyah SauRiyadh Province, Cultural:SauAtt (ii)(iii) 2008 Diriyah was the first capital of the Saudi Dynasty, in the heart of the Arabian Peninsula, north-west of Riyadh. It includes the remains of many palaces and an urban ensemble built on the edge of the ad-Dir’iyah oasis. Archaeological Sites of the Island of Meroe SdnRiver Nile State, Cultural:SdnArc (ii)(iii)(iv)(v) 2011 The site, a semi-desert landscape between the Nile and Atbara rivers, was the heartland of the Kingdom of Kush, a major power from the 8th century B.C. to the 4th century A.D. Gebel Barkal and the Sites of the Napatan Region SdnNorthern State, Cultural:SdnGeb (i)(ii)(iii)(iv)(vi) 2003 The five sites in the Nile Valley have temples that are a testimony to the Napatan (900–270 BCE) and Meroitic (270 BCE – 350 CE) cultures. Ancient City of Aleppo SyrAleppo Governorate, Cultural:SyrAnc (iii)(iv) 1986 At the crossroads of several trade routes from the 2nd millennium B.C., Aleppo was ruled by the Hittites, Assyrians, Arabs, Mongols, Mamelukes and Ottomans. Ancient City of Bosra SyrDaraa Governorate, Cultural:SyrAnc (i)(iii)(vi) -- -- 1980 Bosra, once the capital of the Roman province of Arabia, was an important stopover on the ancient caravan route to Mecca. A magnificent 2nd-century Roman theatre, early Christian ruins and several mosques are found within its great walls. Ancient City of Damascus SyrDamascus Governorate, Cultural:SyrAnc (i)(ii)(iii)(iv)(vi) 1979 Formed in the 3rd millennium B.C., Damascus is one of the oldest cities in the Middle East. In the Middle Ages, it was the centre of a flourishing craft industry, specializing in swords and lace. Ancient Villages of Northern Syria Syr Cultural:SyrAnc (iii)(iv)(v) 2011 Some 40 villages grouped in eight parks in north-western Syria provide remarkable testimony to rural life in late Antiquity and during the Byzantine period. Crac des Chevaliers and Qal’at Salah El-Din SyrHoms and Latakia Governorates, Cultural:SyrCra (ii)(iv) 2006 These two castles show the most significant examples of the exchange of influences and documenting the evolution of fortified architecture in the Near East during the time of the Crusades (11th - 13th centuries). Site of Palmyra SyrHoms Governorate, Cultural:SyrAnc (i)(ii)(iv) 1980 An oasis in the Syrian desert, north-east of Damascus, Palmyra has the monumental ruins of a great city that was one of the most important cultural centres of the ancient world. Archaeological Site of Carthage TunTunis Governorate, Cultural:TunArc (ii)(iii)(vi) -- -- 1979 Formed in the 9th century BCE, Carthage was made into a trading empire spanning the Mediterranean. The city was destroyed in 146 BCE in the Punic Wars at the hands of the Romans, but was later rebuilt by these. Dougga / Thugga TunBeBéja Governorate, Cultural:TunDou (ii)(iii) 1997 The site has the ruins of Dougga, a former capital of a Libyan–Punic state, which flourished under Ancient Rome and the Byzantine Empire, but declined in the Islamic period. Ichkeul National Park TunBiBizerte Governorate, Natural:TunIch (x) 1980 Ichkeul Lake and the surrounding wetlands is a major stopover for hundreds of thousands of migrating bird, including ducks, geese, storks and pink flamingos. Ichkeul is the last remaining lake in a chain that once went across North Africa. Kairouan TunKairouan Governorate, Cultural:TunKai (i)(ii)(iii)(v)(vi) 1988 The city was formed in 670 and flourished as a capital in the 9th century. Its heritage includes the Mosque of Uqba and the Mosque of the Three Gates. Medina of Sousse TunSousse Governorate, Cultural:TunMedinaofSou (iii)(iv)(v) 1988 The city was an important commercial and military port during the 9th century and a typical example of a town dating from the first centuries of Islam. Medina of Tunis TunTunis Governorate, Cultural:TunMedinaofTun (ii)(iii)(v) 1979 The medina has 700 monuments, including palaces, mosques, mausoleums, madrasah and fourtains, testifying to Tunis golden age from the 12th to the 16th century. Punic Town of Kerkuane and its Necropolis TunNabeul Governorate, Cultural:TunPun (iii) -- -- 1985 The city was abandoned in 250 BCE during the First Punic War, and remains the only example of a Phoenicio–Punic settlement. Historic Town of Zabid YemAl Hudaydah Governorate, Cultural:YemHis (iii) -- -- 1993 Zabid was the capital of Yemen from the 13th to the 15th century. The city played an important role in the Arab and Muslim world for many centuries because of its Islamic university. Old City of Sana'a YemSana Governorate, Cultural:YemOld (iv)(v)(vi) -- -- 1986 Sana’a has been lived in for more than 2,500 years. In the 7th and 8th centuries the city became a major centre for Islam. This religious and political heritage can be seen in the 103 mosques, 14 hammams and over 6,000 houses, all built before the 11th century. Old Walled City of Shibam YemHadhramaut Governorate, Cultural:YemOld (iii)(iv)(v) -- -- 1982 The 16th-century city of Shibam is one of the oldest and best examples of urban planning. Socotra Archipelago YemHadhramaut Governorate, Natural:YemSoc (x) 2008 Socotra Archipelago, in the northwest Indian Ocean near the Gulf of Aden, is 250 km long and has four islands and two rocky islets. The site is of universal importance because of its biodiversity with rich and distinct flora and fauna. ==References== *Arab States Category:Asia-related lists Category:Africa-related lists Category:Europe-related lists",
 "title": "List of World Heritage Sites in the Arab States"
}