{
 "id": "349158",
 "text": "Dormant volcanos are the volcanos that are quiet but might erupt again in the future.The plural of volcano can be either volcanos or volcanoes. Both are equally correct, and it is not a matter of British vs US spelling. Oxford English Dictionary. Spelling in any particular Simple page tries to be consistent. If a volcano that has been silent for years erupts again or shows activity, it is called a \"dormant volcano\". Vesuvius of Italy is a prime example. After many years of dormancy, it re-emerged in 1931. Then it is dormant again. For example, Krakatoa in Indonesia, Aconcagua in Argentina, and Mount Fuji in Japan are dormant volcanoes. ==Difficult to classify== It is difficult to distinguish active and inactive volcanos. For example, some scientists have described Mount Fuji as dormant or inactive.Ball, Jessica. \"Voices: Dead or alive ... or neither? Why a dormant volcano is not a dead one,\" Earth Magazine (American Geosciences Institute). September 8, 2010; retrieved 2012-6-14. That volcano has been dormant since its last eruption in 1707,Titsingh, Isaac. (1834). Annales des empereurs du japon, p. 416; Shizuoka University, 宝永四年（1707）噴火 ; retrieved 2012-6-14. but is also classified as active.Britannica Online, \"Mount Fuji\"; retrieved 2012-6-14. The Geological Survey of Japan lists Mount Fuji as among the active volcanoes on the island of Honshu.Geological Survey of Japan, \"Active Volcanoes in Japan\" ==Mis- labelled as dormant or extinct== Some volcanoes may remain dormant for a long time; and an eruption is a surprise. Before 79 AD, Vesuvius was considered dormant. Before 1991, the Pinatubo volcano in the Philippines was labelled as dormant. Before 1995, the Soufriere Hills volcano on the island of Montserrat was dormant. \"'Ladies and gentlemen, on your left you will see an erupting volcano': The stunning sight Caribbean holidaymakers saw from plane,\" Daily Mail (UK). 1 April 2010; retrieved 2012-6-14. Before 1980, Mt. St. Helens in the United States was dormant. ==Select list== There are many examples of volcanoes which are considered dormant. * Mauna Kea in Hawaii,University of Hawaii, Institute of Astronomy, \"About Mauna Kea Observatories\"; retrieved 2012-6-14. the United States * Mount Edziza in CanadaBritish Columbia Parks, \"Mount Edziza Provincial Park\"; retrieved 2012-6-15. * Mount Kilimanjaro in Tanzania * Western Victorian Volcanic Plains in AustraliaUniversity of Western Australia, \"Volcanoes & Earthquakes in SE Australia,\" 2 December 2004; retrieved 2012-6-14. * Trou aux Cerf in Mauritius *Mount Hood in Oregon, the United States *Lake Toba in Indonesia ==Related pages== * List of volcanoes * List of active volcanoes * List of extinct volcanoes ==References== Category:Volcanoes",
 "title": "Dormant volcano"
}