{
 "id": "349262",
 "text": "Jason Kent Bateman (born January 14, 1969) is an American actor, director and producer. He is known for his role on the television series Arrested Development. His older sister is Justine of Family Ties fame. Jason recently received his star on the Hollywood Walk of Fame on July 26, 2017. ==Filmography== ===Movies=== Year Film Role Notes 1987 Teen Wolf Too Todd Howard 1991 Necessary Roughness Jarvis Edison 1992 Breaking the Rules Phil Stepler 1999 Love Stinks Jesse Travis 2001 Sol Goode Spider 2002 The Sweetest Thing Roger Donahue One Way Out John Farrow Direct-to-video 2003 Duplex Alex Rose 2004 Starsky and Hutch Kevin Dodgeball: A True Underdog Story Pepper Brooks 2006 The Break-Up Riggleman 2007 The Ex Chip Sanders Arthur and the Invisibles Darkos Voice only Smokin' Aces Rupert 'Rip' Reed The Kingdom Adam Leavitt Juno Mark Loring Mr. Magorium's Wonder Emporium Henry Weston, the Mutant 2008 The Promotion Retreat Leader Forgetting Sarah Marshall Animal Instincts Detective Hancock Ray Embrey 2009 State of Play Dominic Foy The Invention of Lying Doctor Up in the Air Craig Gregory Extract Joel Couples Retreat Jason 2010 The Switch Wally Mars 2011 Paul Agent Lorenzo Zoil Horrible Bosses Nick Hendricks The Change-Up Dave 2012 The Longest Week TBC Hit and Run Officer Keith Yert Mansome Himself Documentary film Disconnect Rich Boyd 2013 Identity Thief Sandy Bigelow Patterson Bad Words Guy Trilby Also director 2014 Pump Narrator The Longest Week Conrad Valmont This Is Where I Leave You Judd Altman Horrible Bosses 2 Nick Hendricks 2015 A LEGO Brickumentary Narrator Appears as a LEGO character The Gift Simon The Family Fang Buster Fang Also director 2016 Zootopia Nick Wilde Voice role 2018 Game Night Max ===Television=== Year Title Role Notes 1979–1980 Little House on the Prairie James Cooper Ingalls 21 episodes 1980–1982 Silver Spoons Derek 23 episodes 1981 Just a Little More Love Television film 1984 The Fantastic World of D.C. Collins Addison Cromwell Television film Knight Rider Doug Wainwright Single episode 1984–1989 The Hogan Family David Hogan 110 episodes 1984–1985 It's Your Move Matthew Burton Eighteen episodes 1985 Robert Kennedy & His Times Joe Kennedy III Television miniseries Right to Kill? Television film 1986 Mr. Belvedere Sean Single episode Can You Feel Me Dancing? Larry Nichols Television film St. Elsewhere Tim Moynihan Single episode The Thanksgiving Promise Steve Tilby Television film 1987 Bates Motel Tony Scotti Television film 1988 Moving Target Toby Kellogg Television film Crossing the Mob Philly Television film 1992 A Taste for Killing Blaine Stockard III Television film 1994 Black Sheep Jonathan Kelley Television film Confessions: Two Faces of Evil Bill Motorshed Television film This Can't Be Love Grant Television film 1995 Hart to Hart: Secrets of the Hart Stuart Morris Television film Burke's Law Jason Ripley Single episode Simon Carl 1996 Ned & Stacey Bobby Van Lowe Single episode 1997 Chicago Sons Harry Kulchak Star of the series George & Leo Ted Stoody Three episodes 2000 Rude Awakening Ryan Single episode 2001 Some of My Best Friends Warren Fairbanks Eight episodes 2003 The Twilight Zone Scott Crane Single episode 2003–2006 Arrested Development Michael Bluth 53 episodes 2005 King of the Hill Dr. Leslie Single episode Justice League Unlimited Hermes Single episode The Fairly OddParents Tommy Single episode 2006 Scrubs Mr. Sutton Single episode The Jake Effect Jake Galvin Seven episodes 2009 Sit Down, Shut Up Larry Littlejunk Thirteen episodes 2012 Yo Gabba Gabba! Bateman, The Bad Spy Super Spies ==Awards and nominations== Year Award Category Nominated Work Result 1983 Young Artist Award Best Young Actor in a New Television Series Silver Spoons 1984 Best Young Actor in a Comedy Series 1985 Best Young Actor in a Television Comedy Series It's Your Move 1988 Best Young Male Superstar in Television Valerie 2004 Television Critics Association Awards Individual Achievement in Comedy Arrested Development TV Land Awards – 2005 Emmy Awards Outstanding Lead Actor in a Comedy Series Golden Globes Best Performance by an Actor in a Television Series – Musical or Comedy People's Choice Awards Favorite Male Television Star Satellite Awards Outstanding Actor in a Series, Comedy or Musical Best Actor in a Series, Comedy or Musical (Golden Satellite Award) Screen Actors Guild Awards Outstanding Performance by a Male Actor in a Comedy Series Outstanding Performance by an Ensemble in a Comedy Series Television Critics Association Awards Individual Achievement in Comedy 2006 Screen Actors Guild Awards Outstanding Performance by an Ensemble in a Comedy Series ==References== ==Other websites== * * Category:1966 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from New York (state) Category:People from Rye, New York",
 "title": "Jason Bateman"
}