{
 "id": "349201",
 "text": "Active volcanoes are volcanoes which are erupting, or have erupted in modern times.The plural of volcano can be either volcanos or volcanoes. Both are equally correct, and it is not a matter of British vs US spelling. Oxford English Dictionary. Spelling on any particular Simple page tries to be consistent. Many volcanoes have erupted dozens of times in the past few thousand years, but are not erupting at this moment. Some scientists consider a volcano active if it has erupted in the Holocene period (historic times).\"Volcanoes\". U.S. Department of the Interior, U.S. Geological Survey. Most volcanoes live many thousands of years and erupt many times. However, most do not erupt even once in a human lifespan. Signs of unrest such as unusual earthquake activity or significant new gas emissions indicate that a volcano is active. An example of an active volcano is Mount St. Helens in the United States (US).Ball, Jessica. \"Voices: Dead or alive ... or neither? Why a dormant volcano is not a dead one,\" Earth Magazine (American Geosciences Institute). September 8, 2010. Retrieved 2012-6-14. There are more than 1,500 volcanoes that could be active today.\"Sensing Remote Volcanoes\". NASA Earth Observatory. An estimated 500 million people live near active volcanoes.\"Volcanoes \". Reuters. December 12, 2009. Planet Venus has more volcanoes than Earth. Some may be active. == Select list == There are active volcanoes in every part of the world. There are about 1,500 active volcanoes, many in the region of the Pacific Ocean.\"Volcanoes \". European Space Agency. The Pacific \"Ring of Fire\" is an arc around the Pacific Ocean where there are 400+ volcanoes.Rosenberg, Matt. \"Pacific Ring of Fire,\" About.com. Retrieved 2012-6-15. === Other regions === Other regions of active volcanoes include the Mediterranean Sea, the Atlantic Ocean and other places. * Barren Island in the Andaman and Nicobar Islands of IndiaGlobal Volcanism Program, Smithsonian Institution. * Erta Ale in Ethiopia * Fuego in Guatemala * Heard Island and McDonald Islands in AntarcticaUNESCO, \"Heard and McDonald Islands\"; Australian government, \"Heard Island and McDonald Islands, Landforms\". Retrieved 2012-6-15. * Kilauea, Hawaii * Lakagigar in IcelandUSGS, \"Deadliest Volcanic Eruptions Since 1500 A.D.\". Retrieved 2012-6-15. * Cumbre Vieja in La Palma (Canary IslandsMcGuire, Bill. \"In the shadow of the volcano,\" The Guardian,October 15, 2003. Retrieved 2012-6-15.) * Loihi, Hawaii * Mount Erebus in AntarcticaGVP, \"Erebus\" . Retrieved 2012-6-15. * Mount Etna in Italy * Soufrière Hills on the Caribbean island of Montserrat\"'Ladies and gentlemen, on your left you will see an erupting volcano': The stunning sight Caribbean holidaymakers saw from plane,\" Daily Mail (UK). April 1, 2010. Retrieved 2012-6-14. * Stromboli in Italy * Teide in Spain (Canary Islands) * Vesuvius in Italy * Hunga Tonga–Hunga Haʻapai in Tonga == Related pages == * List of volcanoes * Dormant volcano * List of extinct volcanoes * Geyser == References == Active",
 "title": "List of active volcanoes"
}