{
 "id": "349315",
 "text": "This is a list of the winners and nominees of the BAFTA Award for Best Animated Film. The British Academy of Film and Television Arts (BAFTA), is a British organisation that hosts annual awards shows for film, television, children's film and television, and interactive media. ==Winners and nominees== Film Director(s) Producer(s) Country 2006 (60th) Happy Feet George Miller Warren Coleman Judy Morris Bill Miller George Miller Doug Mitchell USA Cars John Lasseter Joe Ranft Darla K. Anderson USA Flushed Away David Bowers Sam Fell Dick Clement Ian La Frenais Simon Nye UK 2007 (61st) Ratatouille Brad Bird Jan Pinkava Brad Lewis John Lasseter Andrew Stanton Galyn Susman USA Shrek the Third Chris Miller Raman Hui Aron Warner Andrew Adamson Denise Nolan Cascino USA The Simpsons Movie David Silverman James L. Brooks Matt Groening Al Jean Mike Scully Richard Sakai USA 2008 (62nd) WALL-E Andrew Stanton Jim Morris Lindsey Collins John Lasseter USA Persepolis Marjane Satrapi Vincent Paronnaud Marc-Antoine Robert France Waltz with Bashir (Vals Im Bashir) Ari Folman Ari Folman Serge Lalou Gerhard Meixner Yael Nahlieli Roman Paul Israel 2009 (63rd) Up Pete Docter Bob Peterson Jonas Rivera John Lasseter Andrew Stanton USA Coraline Henry Selick Claire Jennings USA Fantastic Mr. Fox Wes Anderson Wes Anderson Scott Rudin Allison Abbate Steven M. Rales UK/USA 2010 (64th) Toy Story 3 Lee Unkrich Darla K. Anderson John Lasseter Nicole Paradis Grindle USA Despicable Me Pierre Coffin Chris Renaud John Cohen Janet Healy Chris Meledandri USA How to Train Your Dragon Chris Sanders Dean DeBlois Bonnie Arnold Doug Davison Roy Lee Michael Connolly Tim Johnson USA 2011 (65th) Rango Gore Verbinski John B. Carls Graham King Gore Verbinski USA The Adventures of Tintin: The Secret of the Unicorn Steven Spielberg Peter Jackson Kathleen Kennedy Steven Spielberg USA Arthur Christmas Sarah Smith Steve Pegram Chris Juen USA Category:BAFTA Awards",
 "title": "BAFTA Award for Best Animated Film"
}