{
 "id": "349621",
 "text": "The , also referred to as the \"Imperial family\", is made up of the extended family of the reigning Emperor of Japan. ==History== In 1947, membership in the Imperial family was limited to the male line descendants of the Emperor Taishō, excluding females who marry outside the Imperial family. Eleven branches of the Imperial House were removed in 1947. Article 5 of the defines who is an official member of , including * the * the * the * the Shinnō and ō are translated as \"prince\" or \"princes\". and .Shinnōhi, naishinnō, ōhi and joō are translated as \"princess\" or \"princesses\". * the * the and * the . ==List of current members== There are 16 members of the Imperial Family.Imperial Household Agency Genealogy * The Emperor, the eldest son of Emperor Akihito and Empress Michiko, was born at the Tsugo Palace in Tokyo on 23 February 1960. He became heir apparent upon his father's ascension to the throne and succeeded him as emperor on 1 May 2019. Naruhito was married on 10 June 1993 to Masako Owada. * The Empress was born on 9 December 1963, the daughter of Hisashi Owada, a former vice minister of foreign affairs and former permanent representative of Japan to the United Nations. The Emperor and Empress have one daughter: ** The Princess Toshi (born 1 December 2001) The Emperor Emeritus was born at the Imperial Palace in Tokyo on 23 December 1933, the elder son and sixth child of the Shōwa Emperor and Empress Kōjun. He was married on 10 April 1959 to Michiko Shōda. Emperor Akihito succeeded his father as emperor on 7 January 1989. The Empress Emerita, formerly Michiko Shōda, was born in Tokyo on 24 October 1934, the eldest daughter of Hidesaburo Shōda, president and honorary chairman of Nisshin Flour Milling Inc.. * The Crown Prince Akishino, the Emperor's second son, was born on 11 November 1965. His childhood title was Prince Aya. He received the title Prince Akishino and started a new branch of the imperial family upon his marriage to Kiko Kawashima on 29 June 1990. * The Crown Princess Akishino was born on 11 September 1966, the daughter of Tatsuhiko Kawashima, professor of economics at Gakushuin University. Prince and Princess Akishino have two daughters and a son: ** Princess Kako of Akishino (born 29 December 1994) ** Prince Hisahito of Akishino (born 6 September 2006) The Prince Hitachi was born on 28 November 1935, the second son and seventh child of the Emperor Shôwa and Empress Kojun. His childhood title was Prince Yoshi. By getting the title Prince Hitachi, he started a new branch of the imperial family on 1 October 1964, the day after his wedding. The Princess Hitachi was born on 19 July 1940, the daughter of former Count Yoshitaka Tsugaru. Prince and Princess Hitachi have no children. * Princess Tomohito of Mikasa is the widow of Prince Tomohito of Mikasa (born 5 January 1946, died 6 June 2012), the eldest son of the Prince and Princess Mikasa and a first cousin of Emperor Akihito. The princess was born on 9 April 1955, the daughter of Takakichi Asō, chairman of Asō Cement Co. and his wife, Kazuko, a daughter of former prime minister Yoshida Shigeru. Has two daughters with the late Prince Tomohito of Mikasa: ** Princess Akiko of Mikasa (born 20 December 1981) ** Princess Yōko of Mikasa (born 25 October 1983) * The Princess Takamado is the widow of The Prince Takamado (born 29 December 1954, died 21 November 2002), the third son of the Prince and the Princess Mikasa and a first cousin of Emperor Akihito. The princess was born 10 July 1953, the daughter of Shigejiro Tottori. She married the prince on 6 December 1981. Originally known as Prince Norihito of Mikasa, he received the title Prince Takamado and started a new branch of the imperial family on 1 December 1981. Princess Takamado has three daughters: ** Princess Tsuguko of Takamado (born 6 March 1986) === Cadet branches === * Akishino-no-miya * Hitachi-no-miya * Mikasa-no-miya * Takamado-no-miya == Living former members == The living former imperial princesses are: * Atsuko Ikeda, born 7 March 1931, fourth daughter of Emperor Shōwa and elder sister of Emperor Akihito. * Takako Shimazu, born 2 March 1939, fifth daughter and youngest child of Emperor Shōwa and younger sister of Emperor Akihito. * Yasuko Konoe, born 26 April 1944, elder daughter and eldest child of Prince and Princess Mikasa. * Masako Sen, born 23 October 1951, younger daughter and fourth child of Prince and Princess Mikasa. * Sayako Kuroda, born 18 April 1969, third child and only daughter of Emperor Akihito and Empress Michiko. * Noriko Senge, born 22 July 1988, second daughter of Prince and Princess Takamado. * Ayako Moriya, born 15 September 1990, third daughter of Prince and Princess Takamado. * Mako Komuro, born 23 October 1991, elder daughter and first child of Prince and Princess Akishino. == Succession == Article 2 of the Constitution of Japan provides that \"the Imperial Throne shall be dynastic and succeeded to in accordance with the Imperial Household Law passed by the Diet.\" The Imperial Household Law allows only males in the Japanese order of succession. == Related pages == * Emperor of Japan == References == == Other websites == * Imperial Household Agency website * JapanZone, The Imperial Family",
 "title": "Imperial House of Japan"
}