{
 "id": "349917",
 "text": "Alan Morton Dershowitz (born September 1, 1938) is an American lawyer, professor, and political commentator who is Jewish. He has spent most of his career at Harvard Law School, where he became the youngest full professor of law in its history in 1967, at the age of 28. He has held the Felix Frankfurter professorship there since 1993. He was born in Brooklyn. Dershowitz is known for his role in several important legal cases and as a commentator on the Arab–Israeli conflict. As a criminal lawyer, he has won 13 of the 15 murder and attempted murder cases he has handled, and has represented many celebrity clients, such as Mike Tyson, Patty Hearst, Jeffrey Epstein and Jim Bakker.For his having won 13 out of 15, see Pollak, Joe. \"Dershowitz wins 13th murder case\" , Harvard Law Record, January 22, 2009. His most famous cases include his role in 1984 in overturning the conviction of Claus von Bülow for the attempted murder of his wife, Sunny, and as the appellate adviser for the defense in the trial of O.J. Simpson in 1995.\"Alan Dershowitz\", The Huffington Post, accessed November 20, 2010. In 2020, he was hired by President Donald Trump to defend him during his impeachment trial. He is a political liberal, and has written several books on politics and law, including Reversal of Fortune: Inside the von Bülow Case (1985), the basis of the 1990 film; Chutzpah (1991); Reasonable Doubts: The Criminal Justice System and the O.J. Simpson Case (1996); The Case for Israel (2003); Rights From Wrongs: A Secular Theory of the Origins of Rights (2004)\"Alan M. Dershowitz: Bibliography\", Harvard Law School, accessed November 20, 2010. and The Case for Peace (2005). He is also a writer (guest columnist/blogger) for The Huffington Post. ==References== Category:1938 births Category:Living people Category:Lawyers from New York City Category:American political commentators Category:Jewish American academics Category:Jewish American writers Category:Jewish lawyers Category:HuffPost writers and columnists Category:Writers from Brooklyn Category:Yale University alumni Category:Zionists Category:Educators from New York City",
 "title": "Alan Dershowitz"
}