{
 "id": "350194",
 "text": "Moral hazard is a term used in economics. Nobel laureate Paul Krugman explains moral hazard as \"any situation in which one person makes the decision about how much risk to take, while someone else bears the cost if things go badly.\"Krugman, Paul (2009). The Return of Depression Economics and the Crisis of 2008, p. 63. In other words, a \"moral hazard\" is a situation where the possible costs of a risky action are not borne by the one taking the risk. :Example: A person buys insurance against automobile theft. After buying the protection against this kind of loss, the same person may be less cautious about locking his or her car. If so, this is a kind of moral hazard. The expected consequences of vehicle theft are now partly the responsibility of the insurance company. Will the person show the same degree of care in locking the car regardless of whether there is insurance or insurance policy? \"Moral hazard\" is a kind of reverse incentive (perverse incentive). Hülsmann, Jörg Guido \"The Political Economy of Moral Hazard,\" Mises Daily, April 19, 2008; excerpt, \"A central occupation of economists is to analyze the nature, causes, and effects of incentives — the circumstances that are held to motivate human action. Economists agree on the positive role that 'good' incentives play to increase production. They also agree that 'perverse' incentives have an opposite impact. One of these perverse incentives is called moral hazard ....\"; retrieved 2012-6-22. ==History== The term \"moral hazard\" was first used in the 17th century. The \"moral\" in \"moral hazard\" was understood to mean \"subjective\". It was not used in a way that has anything to do with ethics. In the 1960s, economists used the term to describe inefficiencies that occur because of information asymmetry. In economics, \"moral hazard\" as a special kind of market failure.\"What's so Moral about the Moral Hazard?\" Public Affairs Quarterly, Vol. 23, No 1; retrieved 2012-6-22. ==Related pages== * Conflict of interest * Feedback * Game theory * Unintended consequences ==References== ==Other websites== * PBS.org, Frontline: \"Inside the Meltdown\" Category:Market failure Category:Insurance",
 "title": "Moral hazard"
}