{
 "id": "350136",
 "text": "Samosa is a popular snack originally from Central Asia. It further travelled, with the help of Muslim merchants of trade routes to the Indian subcontinent. It is famous in the subcontinent as well as Southeast Asia, Central Asia, Southwest Asia, the Arabian Peninsula, the Mediterranean, the Horn of Africa, North Africa, as well as South Africa. It is generally prepared in the shape of a triangle, however, the shape and sizes tend to vary from region to region. It can be either baked or fried and has an outer hard crust made of plain flour. It usually has a filling of potatoes and spices. It is usually eaten with a spicy sauce called chutney. ==Etymology== The English word samosa derives from Hindi/Urdu word '',traceable to the Middle Persian word () or Sagosha means (triangle), and has the meaning of the \"triangular pastry\". ==History== The South Asian samosa has a Central Asian and/or Middle Eastern origin. ==Regional varieties== === India === The samosa is prepared with an all-purpose flour (locally known as maida) and stuffed with a filling, often a mixture of diced and cooked or mashed boiled potato (preferably diced), onions, green peas, lentils, ginger, spices and green chili.Samosas generally are deep-fried to a golden brown in vegetable oil. They are served hot and consumed with ketchup or chutney (mint, coriander, or tamarind), or are served in chaat, traditionally accompanied by yogurt, chutney, chopped onions, coriander, and chaat masala. Shingaras may be eaten as a tea time snack. They can also be prepared in a sweet form. Bengali shingaras tend to be triangular, filled with potato, peas, onions, diced almonds, or other vegetables, and are more heavily fried and crunchier than either shingaras or their Indian samosa cousins. Fulkopir shingara (shingara filled with cauliflower mixture) is a popular variation. Samosa is also an appetiser in Iran and Pakistan. It is commonly available in canteens, sweet shops and is also prepared at home. Samosa can be vegetarian or non-vegetarian. ==Origins== It is believed to have originated from the Central and West Asia. The word samosa originates from the Persian word sanbosag or Sagoshag means small triangle . Language Name Marathi Samosa Urdu Sambusak Assamese Singara Odia Singada Bengali Singra Turkish samsa böreği Russian Самса́ [samsa] Persian سمبوسه [Samosa]Sagosha ==References== Category:Snack foods Category:Middle Eastern foods Category:Indian food Category:Pakistani food Category:Bangladeshi food Category:Indonesian food Category:Burmese food Category:Somali food Category:Maldivian food Category:Malaysian food Category:Singaporean food Category:Nepalese food Category:Portuguese food Category:Persian food Category:South African food Category:Eritrean food Category:Ethiopian food Category:Kenyan food Category:Djiboutian food Category:Tajik food Category:Barbadian food Category:Fijian food Category:Israeli food",
 "title": "Samosa"
}