{
 "id": "350289",
 "text": "An evolutionary grade is a group of species at the same level of organisation.Futuyma D.J. 1986. Evolutionary biology. 2nd ed, Sinauer. p288Futuyma D.J. 2005. Evolution. Sinauer. p84 and figure 4.17 It refers to a group of animals or plants which are very similar, but which are not a clade. They have a similar morphological or physiological complexity, and they are often adapted to the same way of life. The term was coined by Julian Huxley, to contrast with clade, which is a strictly phylogenetic unit.Huxley J.S. 1958. Evolutionary processes and taxonomy with special reference to grades. Uppsala Univ. Arsskr. (1958) 2139Huxley J. 1959. Clades and grades. In Cain A.J. (ed) Function and taxonomic importance. Systematics Association, London. The use of 'grade' as a term in biology was strongly supported by Ernst Mayr,Mayr, Ernst 1982. The growth of biological thought. Harvard. p614 who also pointed out that the term had been used for some time before cladism.Bather F.A. 1927. Biological classification: past and present. Proc. Geol. Soc. 83, 62104 == Background == An evolutionary grade is a group of species united by similarities. These similarities led to their being given a name. But now to be a clade, the whole group from the first known member to the present day must be included. The most commonly cited example is that of reptiles. In the early 19th century, tetrapods were put in the four familiar classes of amphibians, reptiles, birds and mammals.Latreille P.A. 1804. Nouveau dictionnaire à histoire naturelle, xxiv. In this system, reptiles are defined by traits such as laying cleidoic eggs, having skin covered in scales or scutes, and having a 'cold-blooded' metabolism. However, we now know that amphibia gave rise to early egg-laying amniotes. These gave rise to sauropsids (the ancestors of reptiles and birds) and synapsids (the ancestors of mammals. 'Reptile' is just a common term for those sauropsids which survived to the present day, minus the birds. As an everyday word, everyone understands it. But as a modern scientific term, it is no longer good, and is less used. Paraphyletic and polyphyletic taxa often represent evolutionary grades. In some cases paraphyletic taxa are united simply by not being part of any other groups, and give rise to so-called wastebasket taxa. == Examples == * Bryophytes were long considered a natural group, defined as those land plants which lacked vascular systems. Molecular evidence shows that the bryophytes are not monophyletic since mosses, liverworts and hornworts are in fact separate lineages, with mosses closest to vascular plants. However, the three clades have a similar degree of complexity, and the \"bryophyte grade\" is a useful benchmark when analysing early plants it gives information about the status of fossils which cannot always be classified into living groups.e.g. * Fish represent a grade, as they have given rise to the land vertebrates. In fact, the three traditional classes of fish (Agnatha, Chondrichthyes and Osteichthyes) all represent evolutionary grades.Romer A.S. & T.S. Parsons. 1985. The Vertebrate Body. 5th ed. Saunders, Philadelphia. Obviously, everyone will go on using the word fish; this just makes the point that they are not a monophyletic clade. * Dinosaurs plus birds are a proper monophyletic group. Otherwise they are not. * Labyrinthodonts are an evolutionary grade, and the group is no longer a term in taxonomy. * Synapsids cannot be a clade unless the mammals are included. * Nautiloids. Cladistically speaking, nautiloids are a paraphyletic group with shared primitive features not found in derived cephalopods. In other words, they are an evolutionary grade which is thought to have given rise to both ammonoids and coleoids.Teichert C. 1988. Main features of cephalopod evolution. In The Mollusca vol 12, Paleontology and neontology of Cephalopods. eds M.R. Clarke & E.R. Trueman. Academic Press, Harcourt Brace Jovanovich. == References == Category:Taxonomy Category:Evolutionary biology",
 "title": "Evolutionary grade"
}