{
 "id": "350442",
 "text": "Around the 13th and early 14th century, many Dutch cities became important. They played a major role in the political and economical affairs of their fiefs.\"Low Countries, 1000–1400 A.D.\", in Heilbrunn Timeline of Art History. New York: The Metropolitan Museum of Art, 2000 The Flemish cities gained powers over their county. When Louis II, Count of Flanders, died without a male heir, these cities (Bruges, Ypres and Ghent) arranged a marriage between his daughter and the Duke of Burgundy. By doing this, they set in motion events that led to the Burgundian and, in 1478, the Habsburg Netherlands. ==Under Burgundy== *In 1384, Philip the Bold got the county of Flanders, Artois, and the Free County by marrying Margaret III, Countess of Flanders, a marriage supported by the Flemish cities. *In 1429, Philip the Good (the grandson of Philip the Bold) buys the County of Namur from John III, Marquis of Namur. *In 1430, Philip of Brabant died childless, leaving his nephew Philip the Good as his heir in Brabant, Lothier, and Limburg. *In 1432, the Hook and Cod wars ended in victory for the Hollandic cities. Philip the Good was offered to become count of Holland, Zeeland and Hainaut. *In 1443, Philip conquers the Duchy of Luxembourg *In 1456, Philip's illegitimate son, David, was elected Bishop of Utrecht. This led to the First and Second Utrecht Civil War. *In 1456, he also had his nephew Louis of Bourbon become Prince-Bishop of Liège, leading to the Liège Wars. *In 1473, Philip's son, Charles the Bold buys the Duchy of Guelders from Duke Arnold. However the house of Burgundy lost this title at Charles's death in 1477. *In 1477, Charles the Bold died fighting an alliance led by the King of France. France added the Duchy of Burgundy. His daughter was called Mary of Burgundy. ==Under Habsburg== *In 1478, Mary married Maximilian I of Habsburg, Holy Roman Emperor, beginning the period of the Habsburg Netherlands. *In 1506, the grandson of Maximilian and Mary, Emperor Charles V inherited his family's Dutch lands. He is also the Holy Roman Emperor and King of Spain. *In 1521, Charles V conquered Tournai and the Tournaisis, until then under French influence. *In 1524, Charles conquered Friesland, whih was renamed Lordship of Frisia, during the Guelderian Wars. *In 1528, Charles freed the Bishopric of Utrecht and its lands in Overijssel, and added them as Lordship of Utrecht and Lordship of Overijssel, during the Guelderian Wars. *In 1536 Charles conquered the Lordship of Groningen and County of Drenthe, during the Guelderian Wars. *In 1543, Charles reclaimed and conquered the Duchy of Guelders and the County of Zutphen (in personal union), during the Guelderian Wars. *In 1549, Charles V issued a Pragmatic sanction; creating the Seventeen Provinces. Politically the Burgundian and Habsburg periods were very important to the Dutch. This is because the various Dutch fiefs were now united politically into one single group.Chapter 3, Forming Political Unity, paragraph 3; The Age of Habsburg (1477–1588). The period ended in great turmoil. There was the rise of Protestantism, the policies of the Habsburg Empire, and other factors resulted in the Dutch Revolt and the Eighty Years' War. ==References== Category:Habsburg Dynasty Category:History of Belgium Category:History of the Netherlands",
 "title": "Timeline of Burgundian and Habsburg acquisitions in the Low Countries"
}