{
 "id": "35065",
 "text": "Vicenza is a comune and city in the Veneto region, in Northeast Italy. Vicenza is the capital of the province of the same name. The city is about west of Venice, the capital of the region, and east of Milan. Vicenza is a cosmopolitan city, with a rich history and culture, and many museums, art galleries, piazzas, villas, churches and elegant Renaissance palazzi. With the \"Palladian Villas of the Veneto\" in the surrounding area, and his renowned Teatro Olimpico (Olympic Theater), Vicenza has been listed as an UNESCO World Heritage Site since 1994. The city is also known as the \"City of Palladio\" after Andrea Palladio, an architect that designed and built several important buildings in Vicenza and other cities. ==Geography== Vicenza is at the confluence of the Bacchiglione river with its tributary Retrone.The comune of Vicenza has an area of to the north of the Berici Hills. Its average altitude is . The southern part of the city is flat with an elevation of above sea level. The historical centre is among the meanders of the Bacchiglione river and of its tributaries with an elevation of above sea level. To the south there is also an area with hills belonging to the Berici Hills with a top elevation of above sea level Vicenza borders with the following comuniː Altavilla Vicentina, Arcugnano, Bolzano Vicentino, Caldogno, Costabissara, Creazzo, Dueville, Longare, Monteviale, Monticello Conte Otto, Quinto Vicentino and Torri di Quartesolo. ===Frazioni=== The following frazioni (hamlets) are part of Vicenza: Anconetta, Bertesina, Bertesinella, Bugano, Campedello, Casale, Debba, Longara, Maddalene, Ospedaletto, Polegge, San Pietro Intrigogna, Santa Croce Bigolina, Tormeno. === Climate === The climate of Vicenza is an oceanic climate with template summers, Cfb (Marine West Coast Climate) in the Köppen climate classification. The average temperature for the year in Vicenza is . The warmest month, on average, is July with an average temperature of . The coolest month on average is January, with an average temperature of . The average amount of precipitation for the year in Vicenza is . The month with the most precipitation on average is November with of precipitation. The month with the least precipitation on average is July with an average of . ==Population== , there are 112,953 persons living in the comune, for a population density of inhabitants/km². Evolution of the population in Vicenza Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:488 height:363 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:120000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1961 text:1961 bar:1971 text:1971 bar:1981 text:1981 bar:1991 text:1991 bar:2001 text:2001 bar:2011 text:2011 bar:2016 text:2016 PlotData= color:barra width:30 align:left bar:1961 from:0 till: 98019 bar:1971 from:0 till: 116620 bar:1981 from:0 till: 114598 bar:1991 from:0 till: 107454 bar:2001 from:0 till: 107223 bar:2011 from:0 till: 111500 bar:2016 from:0 till: 112953 PlotData= bar:1961 at: 98019 fontsize:S text: 98,019 shift:(-13,5) bar:1971 at: 116620 fontsize:S text: 116,620 shift:(-18,5) bar:1981 at: 114598 fontsize:S text: 114,598 shift:(-18,5) bar:1991 at: 107454 fontsize:S text: 107,454 shift:(-18,5) bar:2001 at: 107223 fontsize:S text: 107,223 shift:(-18,5) bar:2011 at: 111500 fontsize:S text: 111,500 shift:(-18,5) bar:2016 at: 112953 fontsize:S text: 112,953 shift:(-18,5) ==Twinned towns== Vicenza is twinned with: * Pforzheim, Germany * Annecy, France ==Gallery== Palazzo_Thiene_Bonin_Longare_Vicenza_centro_storico.jpg|Palazzo Thiene by Palladio. Vicenza - Torre di Piazza Castello.jpg|Piazza dei Signori and Palazzo dei Trecento. Larotonda2009.JPG|Villa La Rotonda. Basilica Palladiana (Vicenza) - facade on Piazza dei signori.jpg|The «Basílica Palladiana». Cathedral (Vicenza) - Sud esposizione.jpg|Cathedral of Vicenza ==References== ==Other websites== * Vicenza official website * Consorzio di Promozione Turistica Vicenza è Category:Capital cities in Italy",
 "title": "Vicenza"
}