{
 "id": "350690",
 "text": "Sean Young (born November 20, 1959) is an American actress. She had many roles in 1980s movies. Young was born in Louisville, Kentucky. ==Filmography== Year Film Role Notes 1980 Jane Austen in Manhattan Ariadne Charlton 1981 Stripes Louise Cooper 1982 Blade Runner Rachael 1982 Young Doctors in Love Dr. Stephanie Brody 1984 Dune Chani 1985 Baby: Secret of the Lost Legend Susan Matthews-Loomis 1986 Under the Biltmore Clock Myra Harper 1987 No Way Out Susan Atwell 1987 Wall Street Kate Gekko 1988 The Boost Linda Brown 1989 Cousins Tish Kozinski 1990 Fire Birds Billie Lee Guthrie 1991 A Kiss Before Dying Dorothy/Ellen Carlsson 1992 Forever Mary Miles Minter 1992 Love Crimes Dana Greenway 1992 Once Upon a Crime Phoebe 1992 Blue Ice Stacy Mansdorf 1992 Hold Me, Thrill Me, Kiss Me Twinkle 1993 Even Cowgirls Get the Blues Marie Barth 1993 Fatal Instinct Lola Cain 1994 Bolt Patty Deerheart Direct-to-video 1994 Ace Ventura: Pet Detective Lt. Lois Einhorn / Ray Finkle 1994 Model by Day Mercedes 1995 Mirage Jennifer Gale 1995 Dr. Jekyll and Ms. Hyde Helen Hyde 1996 The Proprietor Virginia Kelly 1997 Exception to the Rule Angela Bayer 1997 The Invader Annie Neilsen 1997 Men Stella James 1997 The Dog of Flanders Sister Alois English version 1998 Out of Control Lena 1999 Motel Blue Lana Hawking 2000 Poor White Trash Linda Bronco 2000 The Amati Girls Christine 2001 Sugar & Spice Mrs. Hill 2001 Mockingbird Don't Sing Dr. Judy Bingham 2001 Night Class Claire Sherwood 2002 Aftermath Rachel Anderson 2002 The House Next Door Monica 2002 Threat of Exposure Dr. Daryl Sheleigh 2004 A Killer Within Rebecca \"Becky\" Terrill 2004 Until the Night Cosma 2004 Samantha 2005 Ghosts Never Sleep Rebecca 2005 Headspace Mother 2006 The Drop Ivy 2006 The Garden Miss Grace Chapman 2006 Living the Dream Brenda 2008 The Man Who Came Back Kate 2008 Parasomnia Madeline Volpe 2008 Haunted Echoes Laura Direct-to-video 2008 Harvest Moon Meg 2012 Attack of the 50 Foot Cheerleader Brenda Stratford 2012 The Black Dove Bonnie Williams 2013 Jug Face Loriss 2013 Send No Flowers Toni 2013 Gingerclown Nelly the Spiderwoman Voice 2014 My Trip Back to the Dark Side Herself 2014 My Man Is a Loser Therapist 2015 Bone Tomahawk Mrs. Porter 2015 Darling Madame 2015 Lost Cat Corona Roxie 2016 Confidence Game Sylvie 2017 Blade Runner 2049 Rachael and Rachael Clone Likeness only Acting coach to substitute actress ==References== Category:American movie actors Category:Actors from Louisville, Kentucky Category:1959 births Category:Living people",
 "title": "Sean Young"
}