{
 "id": "350606",
 "text": "The road to hell is paved with good intentions is an idiom or proverb.Brown, Marshall. (1905). Wit and humor of well-known quotations, p. 121; excerpt, \"The road to hell is paved with good intentions\" ... [and it] \"is the only place of which we ever heard that is. Generally paving is done with the intention of cheating the city.\"--Boston Post. It is about the difference between what someone intends to do and the outcome of their actions. In other words, the consequences of one's actions can be awful and tragic instead of the good intentions that lead one to do them.White, William. (1897). Notes and queries, Vol. 95, p. 499. This can be the result of poor planning. ==History== In the mid-12th century, Bernard of Clairvaux wrote, \"L'enfer est plein de bonnes volontés et désirs\" (hell is full of good wishes and desires). Amer, Christine. (1997). The American Heritage dictionary of idioms, p. 542. The sentence has been repeated many times in other languages and contexts. In 1775, Samuel Johnson commented on \"the unhappy failure of pious resolves\" when he is reported saying, \"Sir, hell is paved with good intentions.\"Pell, Robert Conger. (1857). Milledulcia: a thousand pleasant things selected from \"Notes and queries\", pp. 89-90; excerpt, \"The last editor, Croker, adds :—Johnson's phrase has become so proverbial, that it may seem rather late to ask what it means—why 'paved'? \" ==Select examples== : This list is not finished; you can help Wikipedia by adding to it. * 1631: George Herbert wrote in Jacula Prudentum, \"Hell is full of good meanings and wishings.\" * 1825: Walter Scott wrote in a letter to Miss Joauna Baillie, \"I well intended to have written from Ireland, but alas! as some stern old divine says, \" Hell is paved with good intentions\" ... and so all my epistolary good intentions are gone to Macadamise, I suppose, \"the burning marle\" of the infernul regions.\" * 1857: George John Whyte-Melville wrote in The Interpreter, \"... if hell be paved with good intentions, it might be roofed with lost opportunities.\"Whyte- Melville, George John. (1857). The Interpreter: a Tale of the War, Vol. 1, p. 100. * 1942: C. S. Lewis explained in The Screwtape Letters, \"The safest road to hell is the gradual one – the gentle slope, soft underfoot, without sudden turnings, without milestones, without signposts.”Lewis , C. S. (1942). \"Letter #12, The Danger of the Slippery Slope to Nothingness,\" The Screwtape Letters, p. 61. * Friedrich Hölderlin, \"What has always made the state a hell on earth has been precisely that man has tried to make it heaven.\"F. A. Hayek (1944). The Road to Serfdom, p. 24. ==Related pages== * Unintended consequences ==References== Category:Idioms de:Liste geflügelter Worte/D#Der Weg zur Hölle ist mit guten Vorsätzen gepflastert",
 "title": "The road to hell is paved with good intentions"
}