{
 "id": "350665",
 "text": "A chemical database is a database specifically designed to store chemical information. This information is about chemical and crystal structures, spectra, reactions and syntheses, and thermophysical data. ==Chemical structures == Chemical structures are usually shown using lines (that indicate chemical bonds between atoms) and drawn on paper.Arthur Winter, Organic Chemistry I For Dummies (Hoboken, NJ: Wiley, 2005), p. 49 Computer search algorithm and storage cannot use this method. Small molecules or ligands, are usually represented using lists of atoms and their connections. Large molecules like protein are shown using their building blocks, amino acids and the order of these. Large chemical databases for structures allow users to store and search for millions of molecules. Therefore, they take up terabytes of memory. == Literature == Chemical literature connect structures or properties of chemicals to academic papers or patents related to them. Examples of this type are STN, Scifinder, and Reaxys. == Crystallography == Crystallography databases store x-ray crystal structure data. Common examples include Protein Data Bank, Cambridge Structural Database, and COD+ Database . == NMR spectra == NMR spectroscopy databases provide information to relate structure and NMR data. They have information on FTIR and mass spectrometry which help in characterization. == Reactions == Most chemical databases store information on stable molecules. In some databases, information about reaction intermediates and temporarily created products are also stored. Reaction databases contain information about products, educts, and reaction mechanisms.Chemoinformatics: A Textbook, eds. Johann Gasteiger; Thomas Engel (Weinheim: Wiley-VCH; Chichester: John Wiley, 2003), p. 263 == Thermophysical == Thermophysical data are information about * phase equilibria such as vapor–liquid equilibrium, solubility of gases in liquids, liquids in solids (SLE), heats of mixing, vaporization, and fusion. * caloric data like heat capacity, heat of formation and combustion, * transport properties like viscosity and thermal conductivity == References == Category:Computational chemistry Category:Cheminformatics Category:Databases",
 "title": "Chemical database"
}