{
 "id": "350777",
 "text": "Walking with Dinosaurs is a 1999 nature documentary series produced by the BBC. It shows how reptiles called dinosaurs lived. The first episode, \"New Blood\", follows all three creatures: a Coelophysis, a Postosuchus and a male cynodont. The next, \"Time of the Titans\", shows a Diplodocus growing up and trying to avoid predators such as allosaurs and Ornitholestes. The third, \"A Cruel Sea\", follows both a Eustrepospondylus and a male Liopleurodon. The fourth, \"King of the Skies\", follows a male Ornithocheirus migrating to Spain. The fifth, \"Spirits of the Frozen Forest\", follows a clan of Leaellynasaura trying to avoid a hungry Polar Allosaur. The last one, \"Last of the Dino Dynasty\", follows a female Tyrannosaurus rex, who has already to mated and needs to take care of her babies in a world that is about to end as the Kt extinction nears by day in an already struggling volcanic world. There is also a 2013 film with the same name, a sequel called \"Walking with Beasts\" and a prequel called \"Walking with Monsters\". == Plot == This series shows dinosaurs from various parts of the world inhabiting our own planet. == Episodes == === Original === Episode list Plot Time period Formation New Blood Millions of years ago, during the Middle Triassic, a female Coelophysis, one of the earliest dinosaurs, hunts down a group of Placerias, looking for weak members to prey on. Nearby, in a stream, a male cynodont, a type of therapsid, resides in a burrow with his family. Meanwhile, a female Postosuchus attacks the Placerias herd and wounds one member of the herd. Middle Triassic Arizona Time of the Titans The episode focuses on the life of a female Diplodocus, beginning at the moment when her mother lays a group of eggs in a nearby forest. As the babies inside begin to hatch and grow in a matter of years, they have to watch for predators, such as small coelurosaurs like Ornitholestes and Stokesosaurus, and giant predators such as Allosaurus, Marshosaurus and Ceratosaurus. Late Jurassic Morrison Formation Cruel Sea It's the middle Jurassic, in present day Oxfordshire. A predatory Eustrepospondylus is dragged down under a sea by a Liopleurodon male. Dozens of creatures thrive in the oceans, such as Opthalmosaurus, the Cretaceous shark Hybodus, and the plesiosaur Cryptoclidus. Middle Jurassic Oxfordshire Giant of the Skies The episode begins with a dead Ornithocheirus. This species was once thought to be a Tropeognathus. Early Cretaceous Europe Spirits of the Ice Forest In prehistoric Australia, dozens of years ago, a family of Leallynasaura emerge during spring, and have to compete with dangerous challenges. Early Cretaceous Australia Death of a Dynasty This last episode focuses on a female Tyrannosaurus rex. The prehistoric world of dinosaurs is violently about to end, and soon after that, at the end of the episode, all the dinosaurs become extinct. End of the Cretaceous Hell Creek Category:BBC Television programmes Category:1999 British television series debuts Category:Documentary television series",
 "title": "Walking with Dinosaurs"
}