{
 "id": "351047",
 "text": "Pig in a poke is an English idiom which means a kind of deceptive trick. It is a blind bargain. The phrase is about something which is offered for sale in a manner which hides its true value. The idiom means a purchase which turns out not to be what the seller claimed it was. ==History== The term \"pig in a poke\" was first used in the Middle Ages. At this time, it was common to sell meat or small animals in cloth bags or sacks called a \"poke\". Sometimes people simply bought the \"poke\" without looking inside; and sometimes people who thought they were buying pork or a small pig were surprised to find they had been sold something else. The idiom pig in a poke is about what happens when someone does not look to see what is being bought or sold. ==Meaning== The idiom \"pig in a poke\" is used to describe something which is purchased without the buyer being aware of its true nature or value. The phrase can also be applied to accepting an idea or plan without a full understanding of it. In other words, it is about starting a course of action without knowing the relevant facts. Many other European languages have a version of this phrase, but many are translated as a warning not to buy a cat in a bag.A related English expression is \"let the cat out of the bag\". \\- Language Phrase Translation Bulgarian to buy a cat in a bag Catalan to give/to take cat instead of hare Chinese sell dog meat as mutton Croatian to buy a cat in a sack Czech to buy a hare in a sack Danish to buy the cat in the sack Dutch to buy a cat in the sack Estonian to buy a piglet in a sack French to buy a cat in a bag Finnish to buy a pig in a sack German to buy the cat in the sack Greek to buy a pig in a sack Hebrew cat in a sack Hungarian cat in a sack Icelandic to buy the cat in the sack Indonesian cat in a sack Irish buying a pig in a bag Italian buying a cat in a sack Latvian to buy a cat in a sack Lithuanian to buy a cat in a sack Luxembourgish to buy the cat in a sack Macedonian to buy the cat in the sack Norwegian to buy the cat in the sack Polish to buy a cat in a sack Portuguese to buy a cat instead of a hare Romanian to buy the cat in the bag Russian to buy a cat in a sack Spanish to give a cat instead of a hare Spanish there is a cat shut inside Serbian to buy a cat in a sack Slovak to buy a cat in a sack Slovene to buy a cat in a sack Swedish to buy the pig in the sack Egyptian بيشتري سمك في مياة to buy fish in the water ==References== Category:Idioms Category:Deception",
 "title": "Pig in a poke"
}