{
 "id": "351178",
 "text": "State Bank of India (SBI) is an Indian multinational public sector bank and financial services statutory body headquartered in Mumbai, Maharashtra. SBI is the 43rd largest bank in the world and ranked 221st in the Fortune Global 500 list of the world's biggest corporations of 2020, being the only Indian bank on the list. It is a public sector bank and the largest bank in India with a 23% market share by assets and a 25% share of the total loan and deposits market. It is also the fifth largest employer in India with nearly 250,000 employees. The bank descends from the Bank of Calcutta, founded in 1806 via the Imperial Bank of India, making it the oldest commercial bank in the Indian Subcontinent. The Bank of Madras merged into the other two presidency banks in British India, the Bank of Calcutta and the Bank of Bombay, to form the Imperial Bank of India, which in turn became the State Bank of India in 1955. The Government of India took control of the Imperial Bank of India in 1955, with Reserve Bank of India (India's central bank) taking a 60% stake, renaming it State Bank of India. ==History== The State Bank of India was established on July 1, 1955.Pathak, Bharati V. (2011). The Indian Financial System: Markets, Institutions and Services, p. 420. == Symbol and slogan == The symbol of the State Bank of India is a circle with a small man at the center of the circle.The SBI symbol is not a keyhole. The circle is a symbol of perfection and the common man is at the centre of the bank's business. The bank is known by several slogans, including * \"Pure banking nothing else\"Inter Publicity Pvt. Ltd. (Interpub), \"SBI--Pure banking nothing else Campaign\" ; retrieved 2012-6-29. * \"With you--all the way\"State Bank of India (SBI), \"Press Release --FY 09 Results\"; retrieved 2012-6-29. * \"Banker to every Indian\"Interpub, \"SBI--The banker to every Indian Campaign\" ; retrieved 2012-6-29. ==Associate banks== SBI has five associate banks. * State Bank of Bikaner & Jaipur * State Bank of Hyderabad * State Bank of Mysore * State Bank of Patiala * State Bank of Travancore ==References== ==Other websites== *State Bank of India website * The State Bank of India Act, 1955 (23 of 1955) Category:Banks of India Category:Economy of India Category:1955 establishments in Asia Category:1950s establishments in India",
 "title": "State Bank of India"
}