{
 "id": "351284",
 "text": "John Dryden (9 August 1631 – 1 May 1700) was an English poet laureate and playwright. He was the oldest of fourteen children born to Erasmus Dryden and wife Mary Pickering. As a boy Dryden lived in the nearby village of Titchmarsh, Northamptonshire. In 1644 he was sent to Westminster School.Hopkins, David, John Dryden, ed. by Isobel Armstrong, (Tavistock: Northcote House Publishers, 2004), 22 In the late twentieth century a house at Westminster was founded in his name. In 1650 Dryden went up to Trinity College, Cambridge. After graduating, he went to London. Dryden got work with the Secretary of State, John Thurloe. On 1 December 1663 Dryden married the royalist sister of Sir Robert Howard—Lady Elizabeth. They had three sons. His first play, The Wild Gallant was in 1663. It was not successful. But from 1668 on he was contracted to make three plays a year for the King's Company. In 1693 Dryden famously said about English language that \"We have yet no prosody, not so much tolerable dictionary, or a grammar, so that our language is in a manner barbarous.\" Following the century's ill formed ideas like latinising English, Dryden considered English as inferior and before expressing anything English in his works he transcribed them first into Latin. He promoted the need of a regulatory body in English like the French Academy, this idea has been carried on by others after his death like by Daniel Fefoe, John Adams and other organized bodies into the 21st century. This arresting in change was deplored in each ages. == Books about Dryden == ;Editions * The Works of John Dryden, 20 vols., ed. H. T. Swedenberg Jr. et al., (Berkeley and Los Angeles: University of California Press, 1956–2002) * John Dryden The Major Works, ed. by Keith Walker, (Oxford: Oxford University Press, 1987) * The Works of John Dryden, ed. by David Marriott, (Hertfordshire: Wordsworth Editions, 1995) * John Dryden Selected Poems, ed by David Hopkins, (London: Everyman Paperbacks, 1998) ;Biography * Winn, James Anderson. John Dryden and His World, (New Haven: Yale University Press, 1987) ;Modern criticism * Eliot, T. S., ‘John Dryden’, in Selected Essays, (London: Faber and Faber, 1932) * Hopkins, David, John Dryden, ed. by Isobel Armstrong, (Tavistock: Northcote House Publishers, 2004) * Oden, Richard, L. Dryden and Shadwell, The Literary Controversy and 'Mac Flecknoe (1668–1679), (Scholars' Facsmilies and Reprints, Inc., Delmar, New York, 1977) ==References== Category:1631 births Category:1700 deaths Category:People buried in Westminster Abbey Category:British poets laureate",
 "title": "John Dryden"
}