{
 "id": "351298",
 "text": "Anne Neville (11 June 1456 16 March 1485) was Princess of Wales as the wife of Edward of Westminster and was the queen of Richard III of England. She had only one son, Edward. She was the daughter of Richard Neville, 16th Earl of Warwick. ==Marriage== Anne was formally betrothed to Queen Margaret of Anjou's son, Edward of Westminster, at the Chateau d'Amboise in France. They were married in Angers Cathedral probably on 13 December 1470. Because of the death of Prince Edward at the Battle of Tewkesbury on 4 May 1471, she was taken prisoner, along with Margaret. She was taken first to Coventry and then to the house of George Plantagenet, Duke of Clarence, in London. The Duke of Clarence was the brother of Richard, Duke of Gloucester, and was married to Anne's sister Isabella. The Duke of Clarence wanted to keep all of the Nevilles' money and would not let her leave. Richard rescued Anne. They were married the next year. The wedding of Anne Neville and Richard (later Richard III of England) took place on 12 July 1472 at Westminster Abbey. They lived in Middleham Castle, Yorkshire. Upon her marriage, she was became Duchess of Gloucester. They had only one child, Edward, who was born at Middleham around 1473. ==Later years== On 9 April 1483, Edward IV of England died. Richard was named Lord Protector for his 12-year-old nephew, Edward V. On 25 June 1483, Edward was said to be illegitimate. Richard then took the throne as King Richard III. Anne was crowned on 6 July 1483. Her son was made Prince of Wales. Edward died suddenly on 9 April 1484, at Sheriff Hutton, Yorkshire, while his parents were absent. He was 10 years old. After the death of his son and heir, rumours said with little evidence that Richard planned to divorce Anne and marry his niece, Elizabeth of York. After the death of her son, Anne began to raise Richard's nephew, Edward, Earl of Warwick, the nine-year-old son of George of Clarence. Richard made the boy his heir. After Anne died, Richard quickly named another nephew, John de la Pole, Earl of Lincoln, as his heir. Anne died on 16 March 1485 of tuberculosis, at Westminster. Category:People buried in Westminster Abbey Category:Kings and Queens consort of England Category:1456 births Category:1485 deaths",
 "title": "Anne Neville"
}