{
 "id": "351512",
 "text": "Tyson Cleotis Chandler (born October 2, 1982) is an American former professional basketball player and player development coach for the Dallas Mavericks of the National Basketball Association (NBA). Chandler was the second overall pick of the 2001 NBA Draft by the Los Angeles Clippers. He was immediately traded to the Chicago Bulls. He has also played for the New Orleans Hornets, Charlotte Bobcats, Dallas Mavericks, New York Knicks, Phoenix Suns, Los Angeles Lakers, and Houston Rockets. As starting center for Dallas, he helped win the franchise's first NBA championship in 2011 and won NBA Defensive Player of the Year with the Knicks in 2012. He was also a member of the United States men's national basketball team's gold medal runs in the 2010 FIBA Basketball World Cup and 2012 Summer Olympics. ==Career transactions== * June 27, 2001: Drafted 2nd overall by Los Angeles Clippers in 2001 NBA Draft. * June 27, 2001: Traded by L.A. Clippers along with Brian Skinner to the Chicago Bulls for Elton Brand. * July 14, 2006: Traded by Chicago to the New Orleans Hornets for P.J. Brown and J.R. Smith. * February 17, 2009: Traded by New Orleans to the Oklahoma City Thunder for Chris Wilcox, Joe Smith and the rights to DeVon Hardin. * February 18, 2009: The Oklahoma City Thunder stopped the trade for Tyson Chandler, because he failed to pass a physical. * July 28, 2009: The New Orleans Hornets traded Tyson Chandler to the Charlotte Bobcats in exchange for Emeka Okafor. * July 13, 2010: Traded by Charlotte along with Alexis Ajinça to the Dallas Mavericks for Matt Carroll, Erick Dampier and Eduardo Nájera. * December 9, 2011: Acquired by the New York Knicks in a three team trade ==References== Notes ==Other websites== * Category:1982 births Category:Living people Category:Chicago Bulls players Category:New Orleans Hornets players Category:Charlotte Bobcats players Category:Dallas Mavericks players Category:New York Knicks players Category:Phoenix Suns players Category:Los Angeles Lakers players Category:Houston Rockets players Category:National Basketball Association high school draftees",
 "title": "Tyson Chandler"
}