{
 "id": "351793",
 "text": "An online educational or e-learning service is a website which teaches and helps students improve in certain subjects such as Maths, English and Science. These are normally used by schools to let students learn from home and complete online homework. Website owners who own good online educational services may charge schools to use these websites, however, many websites such as Bitesize, run by the BBC, are open to the public. == History == The term “e-learning\" was coined by Elliot Masie at his TechLearn Conference in 1999; this was the first instance that the term was used in a professional context (Gutierrez, 2014). However, the use of computers and other digital tools predates this by around three decades. In the mid-1960s, psychology professors at Stanford tried using computers and teleprinters to teach arithmetic and spelling to elementary school students (Suppes,1971). The term \"e-learning\" was used in the courtyard at the first Java (JavaOne) Conference, held in San Francisco. The term was coined by Richard Stallman (https://en.wikipedia.org/wiki/Richard_Stallman) the Grandfather of open source, Tim O'Reilly (https://en.wikipedia.org/wiki/Tim_O%27Reilly), the owner of O'Reilly books, and in discussion with John Gray (co-founder EEDO Knowledgware - sold to IBM in August 2012 for 1.3 Billion), who was working with three friends on an online learning platform and attending the conference. Tim O'Reilly was talking about offering \"books on subscription\", and used the term \"e-Commerce\". Richard Stallman who was sitting next to John leaning back in a courtyard type lawn chair, raised his head and voice briefly and said, \"I guess that means John and his team are working on E-Learning then.\" Likewise, in 1960, e-learning began to take root in the University of Illinois. The university had created an Intranet for its students, allowing them to access course materials and listen to recorded lectures through a system of linked computer terminals (Argawal & Pandey, 2013). By the mid-1980s, many college libraries had followed suit, allowing students to access course content from library terminals. == Types of E-learning == There are ten different types of e-learning. # Computer-Managed Learning (CML): In CML, instructors use computers to deliver learning objectives and assess student performance. These systems can generate tests, analyze results, and adjust learning processes according to individual student preferences. Additionally, CML is used for storing and retrieving teaching aids and tools. # Computer-Assisted Instruction (CAI): CAI combines computers with traditional teaching methods, offering activities such as drill-and-practice, tutorials, and simulations. It promotes interactivity, allowing students to actively participate in the learning process and develop skills. # Synchronous Online Learning: In synchronous online learning, groups of students engage in real- time activities facilitated by online chat and video conferencing. This fosters immediate interaction between students and instructors, eliminating social isolation and enhancing teacher-student relationships. # Asynchronous Online Learning: Asynchronous e-learning allows students to study independently at their own pace and schedule, without real-time communication. It offers flexibility and uses technologies like email, blogs, discussion forums, and multimedia resources. # Fixed eLearning: Fixed e-learning provides static content determined by instructors, without customization for individual learners. It lacks flexibility and adaptation to students' needs or preferences, making it less ideal for personalized learning environments. # Adaptive eLearning: Adaptive e-learning customizes learning materials to fit the needs of each learner, considering factors like performance, abilities, and goals. It employs advanced technologies, including artificial intelligence, to personalize the learning experience and improve knowledge management. # Linear eLearning: Linear e-learning follows a one-way communication model, where information is transmitted from sender to receiver without feedback. Examples include traditional media like television, radio, and newspapers. # Interactive eLearning: Interactive e-learning enables two- way communication between instructors and learners, allowing for feedback and modification of teaching methods. It facilitates engagement and participation through features like instant messaging and discussion boards. # Individual eLearning: In individual e-learning, learners study independently to meet learning objectives on their own. Evaluation methods may include automated assessment or peer grading, commonly used in massive open online courses (MOOCs). # Collaborative eLearning: Collaborative e-learning involves group- based learning, where students interact, learn from each other, and leverage collective strengths and weaknesses. It emphasizes knowledge development in a social setting, fostering collaboration and teamwork. == Methods of E-learning == Some of the methods to deliver e-learning are: # Computer-Based Training (CBT) and Web-Based Training (WBT): CBT uses CDs or DVDs for learners to access content on their own systems, while WBT utilizes the internet with learning management systems. Both methods are self-paced without direct instructor interaction, suitable for adults learning new skills. # Blended eLearning: This approach combines face-to-face teaching with technology like collaboration software, enhancing learning beyond the classroom and offering flexibility in scheduling. # Mobile eLearning: Utilizing handheld devices, mobile eLearning provides access to learning materials and resources. While it increases accessibility, factors like device limitations and connectivity need to be considered. # Social eLearning: Integrating social learning principles, this method encourages interaction among learners through social media, discussion forums, and group activities, facilitating learning through observation and collaboration. # Game-Based eLearning: Using computer games to deliver, support, and enhance teaching, game-based eLearning is designed around specific learning objectives, providing immersive and interactive learning experiences to engage learners in achieving their goals. # Scenario- Based eLearning: When you use real-life narratives and situations to teach knowledge lessons, it is known as Scenario-Based eLearning. This art has become popular to increase engagement in learning. It serves the purpose of eLearning services very well by hooking learners through storytelling. For example, learning through a narrative of a medical emergency situation. It will allow learners to understand the requirements to tackle the situation with analytical thinking. == Related pages == *Distance education *Learning == References == Citations Category:Educational websites",
 "title": "E-learning"
}