{
 "id": "351783",
 "text": "Oodgeroo Noonuccal ( ; born Kathleen Jean Mary Ruska, formerly Kath Walker; 3 November 1920 – 16 September 1993) was an Australian poet, political activist, artist and teacher. She was best known for her poetry, and was the first Aboriginal Australian to publish a book of verse.\"Oodgeroo Noonuccal.\" Encyclopedia of World Biography Supplement, Vol. 27. Gale, 2007 Oodgeroo Noonuccal is a traditional Quandamooka name that she adopted for herself in 1988 (Oodgeroo refers to the paperbark tree, and Noonuccal is the name of her tribe). Oodgeroo campaigned strongly for Aboriginal rights. She was one of the main people behind the campaign for the changes to the Australian constitution in 1967. These changes gave Aboriginal people full citizenship. She also campaigned for Prime Minister Robert Menzies and his successor Harold Holt.Darling, Elaine (1998) They spoke out pretty good: politics and gender in the Brisbane Aboriginal Rights Movement 1958–1962 St Kilda: Janoan Media Exchange, p. 189. She wrote many books, beginning with We Are Going (1964), the first book to be published by an Aboriginal woman. This first book of poetry was very successful, and Oodgeroo became one of Australia's best- selling poets. Her writing contained strong political messages.Rooney, Brigid, Literary activists: writer-intellectuals and Australian public life, (St Lucia, Qld. : University of Queensland Press, 2009, pp. 68–9 Oodgeroo described her own style as \"sloganistic\".Kath Walker, \"Aboriginal Literature\" Identity 2.3 (1975) pp. 39–40 She wanted to show how proud she was of being an Aboriginal. She wanted her writing to make people support equality and Aboriginal rights. Oodgeroo won several literary awards, including the Mary Gilmore Medal (1970), the Jessie Litchfield Award (1975), and the Fellowship of Australian Writers' Award. In 1972 she opened an educational centre in her hometown of Moongalba, on North Stradbroke Island. The centre taught children about nature and Aboriginal culture. Oodgeroo was made a member of the Order of the British Empire in 1970. She returned it in 1987 to protest the Australian bicentenary celebrations and to make a political statement about social inequality in Australia. == Notes == == References == * * == Other websites == * \"Oodgeroo Noonuccal Kath Walker 1920–1993\", online exhibition by the University of Queensland * Biographical entry at the National Foundation for Australian Women * Listen to a recording of Oodgeroo Noonuccal reading her poem 'We Are Going' on Australian Screen Online Category:1920 births Category:1993 deaths Category:Indigenous Australian activists Category:Australian poets Category:Indigenous Australian people Category:Indigenous Australian politics Category:Members of the Order of the British Empire Category:Writers from Queensland",
 "title": "Oodgeroo Noonuccal"
}