{
 "id": "351733",
 "text": "{{Infobox writer | name = Amélie Nothomb | image = Amélie Nothomb 14 mars 2009.jpg | imagesize = 220px | pseudonym = | birth_name = Fabienne Nothomb | birth_date = | birth_place = Etterbeek | death_date = | death_place = | occupation = Writer | nationality = Belgian | notableworks = Stupeur et tremblements }} Amélie Nothomb (born Fabienne-Claire on 9 July 1966) is a Belgian writer who writes in French. Amélie Nothomb was born in Etterbeek, Belgium to Belgian diplomats. She lived in Japan, then in China, New York, Bangladesh, Burma, Coventry and Laos. Nothomb's first novel, Hygiène de l'assassin, was published in 1992. Since then, she has published about one novel per year, including Les Catilinaires (1995), Fear and Trembling (1999) and Métaphysique des tubes (2000, published in English as The Character of Rain). She has been awarded many prizes, including the 1999 Grand Prix du roman de l'Académie française, the Prix René-Fallet, and the 1993 Prix Alain-Fournier. == Books == Published (in French) Type Original title English title English publication details 1992 novel Hygiene and the Assassin Europa Editions, hardback, 2010 1993 novel Loving Sabotage W. W. Norton & Co, hardback, 2000, Faber and Faber, paperback, 2003, 1993 tale (Longue Vue) 1994 play Human Rites Oberon Books, paperback, 2005, 1995 novel The Stranger Next Door Holt (Henry) & Co, hardback, 1996, 1996 novel Péplum 1996 14 pages short story (Stock) 1996 short story (La Revue Générale) 1997 novel Attentat 1998 novel Mercure 1999 novel Fear and Trembling Faber and Faber, paperback, 2002, 1999 39 pages short story () 2000 novel The Character of Rain Faber and Faber, paperback, 2003, 2000 3 tales (La Pierre d'Alun) 2001 novel The Enemy's Cosmetique 2001 2 pages short story 2001 64 pages short story (Elle) 2002 novel The Book of Proper Names Faber and Faber, paperback, 2004, 2003 novel Antichrista Faber and Faber, paperback, 2004, 2004 46 pages short story (Elle) 2004 novel The Life of Hunger Faber and Faber, hardback, 2006 2005 novel Sulphuric Acid Faber and Faber, hardback, 2007 2006 novel Journal d'Hirondelle 2007 novel Tokyo Fiancée Europa Editions, hardback, 2008 2007 short story in 9 episodes 2008 novel The Prince's Act Éditions Albin Michel 2009 novel The Winter Journey Éditions Albin Michel 2010 novel Life Form Europa Editions, hardback 2011 novel Éditions Albin Michel 2012 novel Review at world literature today.org Éditions Albin Michel 2013 novel Éditions Albin Michel 2014 novel Pétronille Europa Editions, paperback, 2015 2015 novel Le Crime du comte Neville Éditions Albin Michel 2016 novel Riquet à la houppe Éditions Albin Michel 2017 novel Frappe-toi le cœur Strike your Heart Éditions Albin Michel, Europa Editions 2018 novel Les prénoms épicènes Éditions Albin Michel Unless otherwise stated, all works were originally published in French by Éditions Albin Michel. ==References== Category:1967 births Category:Living people Category:Belgian autobiographers Category:Belgian novelists Category:People from Brussels-Capital Region",
 "title": "Amélie Nothomb"
}