{
 "id": "351949",
 "text": "Brothers Jean-Pierre Dardenne (born 21 April 1951 in Liège, Belgium) and Luc Dardenne (born 10 March 1954 in Liège, Belgium) are a Belgian movie making duo. They write, produce and direct their movies together. The Dardennes began making narrative and documentary movies in the late 1970s. They first came to international attention in the mid-1990s with La Promesse (The Promise). They won their first major international movie prize when Rosetta won the Palme d'Or at the 1999 Cannes Film Festival. All their movies since have played at the Cannes main competition and won one of the major prizes. They have won more awards than any other movie makers in the history of the Cannes Film Festival. http://www.filmcomment.com/article/radical-kindness Film Comment, March/April 2012 In 2005, they won the Palme d'Or a second time for their movie L’Enfant (The Child). This put them in an elite group of only 7 with the likes of Francis Ford Coppola. Jean-Pierre is the jury president for the Cinéfoundation and Short Films sections of the 2012 Cannes Film Festival. ==Filmography== * Chant du rossignol (1978) * Lorsque le bateau de Léon M. descendit la Meuse pour la première fois (1979) * Pour que la guerre s'achève, les murs devaient s'écrouter (1980) * R... ne répond plus (1981) * Leçons d'une université volante (1982) * Regarde Jonathan/Jean Louvet, son oeuvre (1983) * Il court... il court le monde (1987) * Falsch (1987) * Je pense à vous (I Think of You) (1992) * La promesse (The Promise) (1996) * Rosetta (1999) won the Palme d'Or at the 1999 Cannes Film Festival * Le fils (The Son) (2002) * L’Enfant (The Child) (2005) won the Palme d'Or at the 2005 Cannes Film Festival * Dans l'Obscurité (Darkness) (2007) * Le silence de Lorna (Lorna's Silence) (2008) * The Kid with a Bike (Le Gamin au vélo) (2011) ==Awards== * 1999 Palme d'Or * 2005 Palme d'Or * 2005 Grand-Cross of the Order of the Crown (Belgium)Archives from \"Le Soir\" newspaper * 2008 Film Award Cologne within the Cologne Conference * 2011 Grand Prix (Cannes Film Festival) ==References== ==Other websites== * * Category:1951 births Category:1954 births Category:Living people Category:Belgian movie directors Category:Belgian movie producers Category:People from Liège (province) Category:Belgian screenwriters",
 "title": "Dardenne brothers"
}