{
 "id": "35255",
 "text": "The Aosta Valley or Valle d'Aosta (Val d'Aosta or Val d'Aoste) is a mountainous region in the northwest of Italy. In the English language it is usually called the Aosta Valley. The region has two official name: Regione Autonoma Valle d'Aosta (in Italian) and Région Autonome Vallée d'Aoste (in French). The capital is Aosta. The valley goes up towards Mont Blanc. It is the route out of Italy to the North-West. It was used by Roman armies, and the proof is in the archaeological artefacts found in Aosta. The town has been both French and Italian over the past few centuries, and the street names in Aosta are in both languages. It is the smallest region in Italy, with an area of , and a population of about 126,883. It is the only Italian region which has no provinces. The regional government has taken all the administrative functions of a province.http://www.camera.it/_dati/leg13/lavori/bollet/200007/0718/pdf/06.pdf The region is divided into 74 comuni. ==Limits== Its frontier to the north is with Switzerland (Canton Valais), to the west with France (region Auvergne- Rhône-Alpes), to the south and east with the Italian region of Piedmont. ==Geography== The Valle d'Aosta is a small valley, the valley of the Dora Baltea river, with some smaller side valleys. It is in the middle of the Alps, surrounded by four of the tallest mountains throughout Italy and Europe: # Mont Blanc; height: (), the highest mountain in the Alps. # Matterhorn (German), Monte Cervino (Italian) or Mont Cervin (French); height: () # Monte Rosa; height: (), the second highest mountain in the Alps. # Gran Paradiso; height: (). In the Aosta Valley, a region with many mountains and close to the borders with other countries, the mountain passes are very important. Even though now there some tunnels, the passes are important. They add a historical and geographical perspective which is important to tourism and tradition. The main mountain passes between the Aosta Valley and other valleys are: * The Little St Bernard Pass (French: Col du Petit Saint-Bernard; Italian: Colle del Piccolo San Bernardo), between Savoie, France and the Valle d'Aosta; * The Great St Bernard Pass (French: Col du Grand Saint-Bernard; Italian: Colle del Gran San Bernardo), between Valais, Switzerland and the Valle d'Aosta;. The southern part of the territory is occupied by the Gran Paradiso National Park, created in 1922 to protect plants and animals in danger of extinction. The valleys were made by glaciers moving at a time when the entire region was covered by them. Currently, glaciers occupy only the highest peaks. The Dora Baltea () river flows along the whole Valle d'Aosta, from the northwest to the southeast; it is long and is a tributary of the Po river. === Mountain communities === The 74 comuni - with the exception of Aosta - of the Valle d'Aosta are organized in mountain communities (, ). There are eight mountain communities: Mountain Community Capital Comuni Evançon Verrès 9 Grand Combin Gignod 11 Grand Paradis Villeneuve 13 Mont Emilius Quart 10 Mont Rose Pont- Saint-Martin 9 Monte Cervino Châtillon 12 Valdigne Mont Blanc La Salle 5 Walser - Alta Valle del Lys Issime 4 ===Comuni with higher populations=== The 10 comuni of the Valle d'Aosta with the higher populations (January 2017) are: No. City Population (2017) Area (km2) Density (inh./km2) Altitude (m) 1 Aosta 34,361 21.39 583 2 Sarre 4,887 28.28 625 3 Châtillon 4,753 39.68 549 4 Saint-Vincent 4,620 20.57 575 5 Quart 4,061 62.05 535 6 Pont-Saint- Martin 3,833 6.92 345 7 Saint-Christophe 3,441 14.74 619 8 Gressan 3,398 25.30 626 9 Saint-Pierre 3,191 26.18 676 10 Nus 2,979 57.36 529 ==People== A person from the Valle d'Aosta is called a Valdotian (, ). ===Population=== The total population of Valle d'Aosta on 1 January 2017 was 126,883, of which 61,976 were male and 64,907 were female. Evolution of the population in the Aosta Valley Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:130000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:10000 start:0 ScaleMinor = gridcolor:lightgrey increment:5000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1961 text:1961 bar:1971 text:1971 bar:1981 text:1981 bar:1991 text:1991 bar:2001 text:2001 bar:2011 text:2011 bar:2017 text:2017 PlotData= color:barra width:30 align:left bar:1961 from:0 till: 100959 bar:1971 from:0 till: 109150 bar:1981 from:0 till: 112353 bar:1991 from:0 till: 115938 bar:2001 from:0 till: 119548 bar:2011 from:0 till: 126806 bar:2017 from:0 till: 126883 PlotData= bar:1961 at: 100959 fontsize:S text: 100,959 shift:(-12,5) bar:1971 at: 109150 fontsize:S text: 109,150 shift:(-18,5) bar:1981 at: 112353 fontsize:S text: 112,353 shift:(-18,5) bar:1991 at: 115938 fontsize:S text: 115,938 shift:(-18,10) bar:2001 at: 119548 fontsize:S text: 119,548 shift:(-18,5) bar:2011 at: 126806 fontsize:S text: 126,806 shift:(-18,8) bar:2017 at: 126883 fontsize:S text: 126,883 shift:(-18,5) ===Languages=== Italian and French are the region's official languages and are used for the regional government's acts and laws, though Italian is much more widely spoken in everyday life. Of the population of the valley 96% speaks Italian as either a first or second language. Of the population 70% speaks French as either first or second language. School education is given equally in both Italian and French. The regional language is a dialect of Franco- Provençal called Valdôtain (locally, patois). It is spoken as native tongue and as second language by about 58% of the population, according to a poll taken by the Fondation Émile Chanoux in 2002. The residents of the villages of Gressoney-Saint-Jean, Gressoney-La-Trinité and Issime, in the Lys Valley, speak two dialects of Walser German origin called Titsch and Töitschu respectively. ==Gallery== File:Aosta.jpg|View of the city of Aosta File:Casa Valdostana Cretaz Valtournenche.JPG|House in Cretaz, Valtournenche, Aosta Valley. File:Tunnel du mont-blanc coté italien.jpg|Mont Blanc Tunnel entrance. File:11CastelloDiSaintPierre.jpg|The Saint-Pierre castle. File:Arco Augusto Aosta.jpg|Arch of Augustus, Aosta ==References== ==Other websites== * * Website of the Aosta Valley Regional Authority * Image Vallée - Aosta Valley's landscape photo gallery * Weather forecast and map of the Aosta Valley * Société de la Flore Valdôtaine * Patois en Vallée d'Aoste",
 "title": "Aosta Valley"
}