{
 "id": "352623",
 "text": "Okan Yalabık (born 13 December 1978 in Bigadiç, Balıkesir) is a Turkish actor. Yalabık attended İstanbul University State Conservatory, Department of Performing Arts. There he was educated by professionals, one of which was Yıldız Kenter. He started his professional career in television serials in 2000. In 2011 he was granted the best actor award for Muhteşem Yüzyıl. In 2011 he also received the best co-starring actor award for his role in Hunting Season. ==Filmography== Year Film/TV Serie/Theatre Role Notes ? Sırça Kümes Theatre Bayrak Theatre Nükte Theatre Martı Theatre 2000 Yılan Hikayesi Commissar Tayfun TV Serie, 2nd season 2001 Yılan Hikayesi Commissar Tayfun TV Serie, 3rd season Aşkım Aşkım Tarkancan TV Mini Serie 2002 Yıldızların Altında Engin TV Serie Zeybek Ateşi Kerem TV Serie Gülüm Serhat Movie 2003 Serseri Ömer Yelkenci TV Serie Çaylak Evren TV Serie Başyapıt The Compositor Short Film Inishmore'lu Yüzbaşı Theatre 2004 Avrupa Yakası Necdet Aygün TV Serie, 1st season Büyü Cemil Movie 2005 Sensiz Olmuyor Can TV Serie Çapkın Özgür TV Serie Sen Ne Dilersen Stavro Movie Kumarbazın Seçimi Carl Theatre 2006 Hatırla Sevgili Necdet TV Serie, 1st season Arka Sokaklar Özgür TV Series, 5th season Kumarbazın Seçimi Carl Theatre Kabuslar Evi: Hayal-i Cihan Burak/Cihan Movie İlk Aşk Rasim Movie 2007 Hatırla Sevgili Necdet TV Serie, 2nd season Kumarbazın Seçimi Carl Theatre 39 Basamak Theatre Donkey Xote Turkish Voice 2008 Hatırla Sevgili Necdet TV Serie, 3rd season Kumarbazın Seçimi Carl Theatre 39 Basamak Theatre Kung Fu Panda Po Turkish Voice Gnomes and Trolls: The Secret Chamber Turkish Voice 2009 Bu Kalp Seni Unutur Mu? Kerim TV Serie, 1st season Güz Sancısı Stavro Movie 2010 Bu Kalp Seni Unutur Mu? Kerim TV Serie, 2nd season Umut Yolcuları Erhan Gül TV Serie, 12th episode PesPese Kaan Movie Av Mevsimi Çömez Hasan Movie 2011 Bir İlkbahar Masalı Melih Movie Muhteşem Yüzyıl Pargalı Hasodabaşı İbrahim Pasha TV Serie, 1st season 2012 Muhteşem Yüzyıl Pargalı Hasodabaşı İbrahim Pasha TV Serie, 2nd season ==References== ==Other websites== * * Okan Yalabık at the SinemaTurk.com Category:1978 births Category:Living people Category:Turkish movie actors Category:Turkish television actors Category:Turkish stage actors",
 "title": "Okan Yalabık"
}