{
 "id": "352876",
 "text": "The 2000 UEFA European Football Championship, or Euro 2000, was the 11th UEFA European Football Championship. The championship is held every four years and organized by UEFA. UEFA is association football's governing body in Europe. The finals of Euro 2000 were co-hosted (the first time this happened) by Belgium and the Netherlands, between 10 June and 2 July 2000. Spain and Austria also bid to host the event.Dietrich Schulze-Marmeling: Die Geschichte der Fußball-Europameisterschaft, Verlag Die Werkstatt, The final tournament had 16 nations. Except for Belgium and the Netherlands, the finalists had to go through a qualifying round to reach the final stage. France won the tournament. They defeated Italy 2–1 in the final, by a golden goal. The finals were in the King Baudouin Stadium. ==Qualified teams== The following 16 teams were in the tournament: Country Qualified as Date of qualification Previous appearances in tournament1, 2 00Co-hosts 3 (1972, 1980, 1984) 01Co-hosts 5 (1976, 1980, 1988, 1992, 1996) 02Group 1 winner 4 (1968, 1980, 1988, 1996) 03Group 2 winner 0 (debut) 04Group 3 winner 7 (1972,4 1976,4 1980,4 1984,4 1988,4 1992, 1996) 05Group 4 winner 4 (1960, 1984, 1992, 1996) 06Group 5 winner 1 (1992) 07Group 6 winner 5 (1964, 1980, 1984, 1988, 1996) 08Group 7 winner 1 (1996) 10Group 8 winner 4 (1960, 1968, 1976, 1984, 19925) 11Group 9 winner 4 (1960,3 1976,3 1980,3 1996) 12Best runner-up 2 (1984, 1996) 13Play- offs 5 (1964, 1984, 1988, 1992, 1996) 14Play-offs 5 (1968, 1980, 1988, 1992, 1996) 15Play-offs 0 (debut) 16Play-offs 1 (1996) : 1 Bold indicates champion for that year : 2 Italic indicates host for that year : 3 as Czechoslovakia : 4 as West Germany : 5 Did not qualify but replaced Yugoslavia, who were under sanctions by the UN Security Council Resolution 757 and banned from appearing. Denmark were group 4 runners-up. === Final rankings === Pos Team Pld W D L GF GA GD Pts 1 6 5 0 1 13 7 +6 15 2 6 4 1 1 9 4 +5 13 Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals Eliminated in the Semi-finals 3 5 4 1 0 13 3 +10 13 4 5 4 0 1 10 4 +6 12 Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter- finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals Eliminated in the Quarter-finals 5 4 2 0 2 7 7 0 6 6 4 1 3 0 3 4 -1 4 7 4 2 0 2 4 6 -2 4 8 4 1 1 2 8 13 –5 4 Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage Eliminated in the Group stage 9 3 1 1 1 3 3 0 4 10 3 1 1 1 1 1 0 4 11 3 1 1 1 5 6 –1 4 12 3 1 1 1 2 5 –3 4 13 3 0 2 1 4 5 –1 2 14 3 0 1 2 2 4 –2 1 15 3 0 1 2 1 5 –4 1 16 3 0 0 3 0 8 –8 0 * Rankings are based on performance, not team skill. Also, these rankings are unofficial and are not based on head-to-head record. ===Goalscorers=== ;5 goals * Patrick Kluivert * Savo Milošević ;4 goals * Nuno Gomes ;3 goals * Thierry Henry * Sérgio Conceição * Zlatko Zahovič ;2 goals * Vladimír Šmicer * Alan Shearer * Youri Djorkaeff * David Trézéguet * Sylvain Wiltord * Zinedine Zidane * Filippo Inzaghi * Francesco Totti * Frank de Boer * Marc Overmars * Boudewijn Zenden * Gaizka Mendieta * Alfonso Pérez * Hakan Şükür ;1 goal * Bart Goor * Émile Mpenza * Karel Poborský * Steve McManaman * Michael Owen * Paul Scholes * Laurent Blanc * Christophe Dugarry * Mehmet Scholl * Antonio Conte * Alessandro Del Piero * Marco Delvecchio * Luigi Di Biagio * Stefano Fiore * Ronald de Boer * Steffen Iversen * Costinha * Luís Figo * João Pinto * Cristian Chivu * Ionel Ganea * Viorel Moldovan * Dorinel Munteanu * Miran Pavlin * Joseba Etxeberria * Pedro Munitis * Raúl * Henrik Larsson * Johan Mjällby * Okan Buruk * Ljubinko Drulović * Dejan Govedarica * Slobodan Komljenović ;Own goal * Dejan Govedarica (playing against the Netherlands) ==Awards== ;UEFA Team of the Tournament Goalkeepers Defenders Midfielders Forwards Fabien Barthez Francesco Toldo Laurent Blanc Marcel Desailly Lilian Thuram Fabio Cannavaro Paolo Maldini Alessandro Nesta Frank de Boer Patrick Vieira Zinedine Zidane Demetrio Albertini Edgar Davids Rui Costa Luís Figo Josep Guardiola Thierry Henry Francesco Totti Patrick Kluivert Nuno Gomes Savo Milošević Raúl ;Golden Boot * Patrick Kluivert * Savo Milošević (5 goals) UEFA Player of the Tournament * Zinedine Zidane ==Mascot== The mascot for the tournament was Benelucky. The name is a pun on Benelux. He is a lion-devil with hair colour a combination of the flag colours of both host nations. The lion is the national football emblem of the Netherlands and a devil is for Belgium, the team being nicknamed \"the Red Devils\". ==References== Category:Football in Belgium Category:Football in the Netherlands Category:2000s in Dutch sport Category:2000s in Belgium",
 "title": "UEFA Euro 2000"
}