{
 "id": "35309",
 "text": "El Al (; ) is the national airline of Israel. It is the country's flag carrier airline. It also flies to Africa, Asia, Europe and North America. El Al serves 48 destinations. It has only one hub: Ben Gurion International Airport in Tel Aviv. ==History== In 1948, after a conference in Geneva, the first President of Israel had to return to Israel with a government aircraft. However, this was not possible. So a C-54 was converted into a civil aircraft and repainted with the El Al logo in order to bring back the President to Israel. El Al became the official Israeli airline in 1948. The first international flight took place in 1949. It flew from Tel Aviv to Paris. == Accidents and incidents == Over its history, El Al has been involved in the following incidents and accidents, involving both the aircraft actually operated by the airline and its outstations abroad. Most of these incidents are related to Palestinian terrorism, particularly in the period between 1968 and 1990, and so incidents are separated by terrorist and non-terrorist incidents. Despite these attacks, EL Al has not lost a passenger on any passenger flight since 1955. === Terrorist attacks and incidents === *On 23 July 1968, El Al Flight 426, operated by a Boeing 707-458C en route from London to Tel Aviv via Rome, registered 4X-ATA, was hijacked by three members of the Popular Front for the Liberation of Palestine (PFLP) shortly after take-off from Rome-Fiumicino airport and forcibly diverted to Algiers. The hijacking ended after 40 days and is considered to be the only successful hijacking involving an El Al jet. *On 18 February 1969, El Al Flight 432, operated Boeing 720-058B, registered 4X-ABB, was attacked at Zurich Airport by members of the PFLP while taxiing for takeoff en route from Amsterdam to Tel Aviv, via a Zurich intermediate stop. Seven people were wounded including the copilot who later died from his wounds. In a firefight involving security personnel aboard the aircraft, one hijacker was killed, while the others were arrested. The hijackers were later put on trial in Winterthur, Switzerland but were released following the Dawson's Field hijackings one year later. *On 6 September 1970, El Al Flight 219 from Tel Aviv to New York, with a stopover in Amsterdam, operated by a Boeing 707-458C registered 4X-ATB, was the target of an attempted hijacking by Leila Khaled and Patrick Argüello, members of the Sandinistas working in concert with the PLFB after taking off from Amsterdam. The hijacking was meant to be one of the Dawson's Field hijackings, but it was thwarted by the pilots, cabin crew and the on-board air marshals. The aircraft diverted to Heathrow Airport, where Argüello and Khaled were turned over to British authorities; Argüello, who was shot earlier, died en route to a hospital. *On 16 August 1972, a bomb exploded in the luggage compartment of El Al Flight 444 shortly after takeoff from Rome. The plane returned to Rome safely and no casualties were recorded. The bomb had been hidden in the luggage of two British nationals who had the bombs placed there by Arab acquaintances. *On 13 January 1975, several men, including Carlos the Jackal, made an unsuccessful attempt to destroy an El Al airliner parked at Paris Orly Airport. The men tried again on January 17, also without success. *On 27 December 1985, after several failed attempts to attack El Al aircraft, guerrillas of the Fatah Revolutionary Council attacked El Al and TWA ticket counters at Rome-Fiumicino and Vienna-Schwechat airports, killing 18 people. *A terrorist attack was foiled on 18 April 1986 in what became known as the Hindawi Affair. A pregnant Irishwoman named Anne-Marie Murphy was about to board an El Al flight at London's Heathrow airport when her bag was found to contain three pounds of plastic explosives. These had been planted by her fiancé Nezar Hindawi, who was booked on a different flight. Hindawi was jailed for 45 years, the longest sentence (short of a life sentence) ever delivered by a British court. There was evidence that Syrian officials were involved and as a result, Britain cut off diplomatic relations with Syria. *On 4 July 2002, Hesham Mohamed Hadayet shot six Israeli passengers at El Al's ticket counter at Los Angeles International Airport before he was shot and killed by an El Al security guard. Two of the victims died. Although not linked to any terrorist group, Hadayet, an Egyptian, espoused anti-Israeli views and was opposed to US policy in the Middle East. The US Federal Bureau of Investigation classified the shooting as a terrorist act, one of the few on US soil since the September 11, 2001 attacks. *On 17 November 2002, El Al Flight 581, a flight operated by a Boeing 767-258(ER) from Tel Aviv to Istanbul, registered 4X-EBS, was the scene of an attempted hijacking by Tawfiq Fukra, a twenty-three-year-old Israeli Arab reportedly armed with a pocket knife. Fukra attempted to break into the cockpit in order to fly the aircraft back to Israel and crash it into a building. He was apprehended by on-board security personnel. == References == Category:Airlines of the Middle East Category:Transport in Israel Category:1948 establishments in Israel Category:Companies of Israel",
 "title": "El Al"
}