{
 "id": "353104",
 "text": "Dean Cain (born Dean George Tanaka; July 31, 1966) is an American actor. He is known for his role as Clark Kent/Superman in the popular American television series Lois & Clark: The New Adventures of Superman. ==Personal life== Dean has a son named Christopher Dean Cain (b. June 11, 2000). The mother is former Playboy Playmate Samantha Torres.Michelle Tauber. Cain, Able People Magazine, 2003. His son is named after Cain's father, movie director Christopher Cain. He was previously engaged to country singer Mindy McCready in the late 1990s. ==Filmography== Year Film Role Notes 1976 Elmer Dean Russell 1979 Charlie and the Talking Buzzard Joe 1984 The Stone Boy Eugene Hillerman 1989 Christine Cromwell: Things That Go Bump in the Night TV 1990 Write to Kill Parking Valet 1990 Going Under Guy in Bar 1992 Grapevine Brian TV 1992 Miracle Beach Volleyball Player #1 1992 Beverly Hills, 90210 Rick TV 1993 Touchdown: Football Goes to the Movies Himself - Host 1993–1997 Lois & Clark: The New Adventures of Superman Clark Kent/Superman TV Series 1995 Off Camera with Dean Cain Himself - Host TV Series / Host / Also Produced and Directed 1996 Cutty Whitman Clark Kent TV / Uncredited 1997 Rag and Bone Tony Moran TV / Also produced 1997 Eating Las Vegas Frank 1997 Best Men Sergeant Buzz Thomas 1998 Dogboys Julian Taylor TV 1998 Futuresport Tremaine 'Tre' Ramzey TV 1999–2003 Ripley's Believe It or Not! Himself - Host TV Series / Host / Also produced 2000 The Broken Hearts Club: A Romantic Comedy Cole 2000 No Alibi Bob Valenz 2000 Flight of Fancy Clay Bennett 2000 Militia Ethan Carter 2000 For the Cause (a.k.a. Final Encounter) Gen. Murran 2000 The Runaway Sheriff Frank Richards TV 2001 Just Shoot Me! Chris Williams TV 2001 Phase IV Simon Tate 2001 Firetrap Jack/Max Hooper Also produced 2001 Rat Race Shawn Kent 2001 A Christmas Adventure From a Book Called Wisely's Tales Donner Voice 2002 Grandia Xtreme Evann Video game; Voice 2002 Gentle Ben Jack Wedloe TV 2002 New Alcatraz (Boa) Dr. Robert Trenton 2002 Dark Descent Will Murdack 2002 The Glow Matt Lawrence TV 2002 Christmas Rush Lt. Cornelius Morgan TV 2002 Frasier Rick TV 2003 Dragon Fighter Capt. David Carver Also produced 2003 Gentle Ben 2: Danger on the Mountain Jack Wedloe TV 2003 Out of Time Chris Harrison 2003–2004 The Division Insp. Jack Ellis TV series 2004 Grandpa's Place Special Appearance Short 2004 Post Impact Sargent/Captain Tom Parker 2004 I Do (But I Don't) Nick Corina TV 2004 Clubhouse Conrad Dean TV Series 2004 Lost Jeremy Stanton 2004 The Perfect Husband: The Laci Peterson Story Scott Peterson TV 2005 Truth Peter 2005 Bailey's Billion$ Theodore Maxwell 2005 Mayday Cmdr. James Slan TV 2005 Wrinkles 2005 Law & Order: Special Victims Unit Dr. Mike Jergens TV 2005 Las Vegas Casey Manning TV 2006 10.5: Apocalypse Brad TV 2006 Max Havoc: Ring of Fire Roger Tarso 2006 Dead And Deader Lt. Bobby Quinn TV 2006 September Dawn Joseph Smith 2006 A Christmas Wedding Tucker TV 2007 Urban Decay Stan 2007 Hidden Camera Dan Kovacs TV 2007 Crossroads: A Story of Forgiveness Bruce Murakami TV 2007 Final Approach Jack Bender TV 2007 Smallville Dr. Curtis Knox TV 2007 CSI: Miami Roger Partney TV 2008 Making Mr. Right Eddie TV 2008 Ace of Hearts Daniel Harding 2008 $5 a Day Rick Carlson 2009 Aussie and Ted's Great Adventure Michael Brooks 2009 The Gambler, the Girl and the Gunslinger Shea McCall TV 2009 Maneater Harry 2009 The Dog Who Saved Christmas Ted Stein TV 2009 The Three Gifts Jack Green TV (Hallmark) 2010 The Way Home Randy Simpkins 2010 Frost Giant JC TV 2010 Circle of Pain Wyatt 2010 Abandoned Kevin Peterson 2010 Hole in One Repo Man 2010 Kill Katie Malone Robert 2010 Pure Country 2: The Gift Director 2010 A Nanny for Christmas Danny Donner 2010 The Dog Who Saved Christmas Vacation Ted Stein TV Sequel 2010 Subject: I Love You James Trapp 2010 Bed & Breakfast Jake 2011 5 Days of War Chris Bailot 2011 A Mile in His Shoes Arthur 'Murph' Murphy 2011 At the Top of the Pyramid Jefferson Parker 2011 Home Run Showdown Rico Deluca 2011 Dirty Little Trick Michael 2011 The Fallen Cole 2011 Latin Quarter Appolinaire 2011 Vacation Bryce 2011 The Sandy Creek Girls Jared 2011 The Dog Who Saved Halloween Ted Stein TV Sequel 2011 Burn Notice Ryan Pewterbaugh 2012 Criminal Minds Curtis Banks Don't Trust the B---- in Apartment 23 Himself ==References== ==Other websites== * * Category:1966 births Category:Living people Category:Actors from Michigan Category:American movie actors Category:American television actors Category:Superman",
 "title": "Dean Cain"
}