{
 "id": "353213",
 "text": "Bharatanatyam,In Tamil, Bha means expression, Ra means music, Ta means rhythm and natyam means dance. is an Indian classical dance.Indian Mirror, \"Bharatanatyam\"; retrieved 2012-7-15. Both male and female dancers perform this dance.Bharatanatyam History | Online Bharatanatyam The classical Indian story-dance can be used to express a complex range of emotions which respond to the actions of the male heroes.Shah, Surabhi et al. \"Stories from the Ramayana: The Epic Tradition,\" Harvard Art Museums, November 10, 2010; retrieved 2012-7-15. This classical Indian dance attracts interest and study in India and other parts of the world, including China Europe and North America. ==History== Bharatanatyam comes from the state of Tamil Nadu.bharata-natya - Britannica Online Encyclopedia The dance’s origins are recorded in Tamil literary texts of the sixth century BC. It was revived in the late 18th century and again in the early 20th century.\"Colour Contacts, The Dance Form\" Museum of London; retrieved 2012-7-15. == Etymology & History == (The etymology in #1 below for \"Bharata\" is spurious. It only makes sense with the English spelling/pronunciation of \"Bha\", \"Ra\", and \"Ta\", which would be \"Bhā-rā-tā. The actual pronunciation is Bhə-rə-tə which does not make for a good story). The name was invented in the twentieth century by the great dancer Rukmini Devi and others. It is supposed to indicate that this style was the original style described in a book on Natya by the sage Bharata, i.e. \"Bharata's Dance\". The text describes poses but in the absence of illustration, the exact poses had to be re-imagined -- the quality of this re-imagination is a tribute to the intellectual and aesthetic abilities of Rukmini Devi and her teachers, but there is no other link between Bharatanatyam now and the dances described in ancient Tamil texts. The re-imagined dance form was largely based on Sadir-attam, the dances performed by temple devavdasis, whose status had fallen over many centuries and under British non-comprehension of its cultural roots. Sadir-attam itself was the name given to the dance during its eighteenth century revival under the sponsorship of Raja Serfoji of Tanjore. The knowledge of the ancient dance was maintained by the caste of devadasis, but as an oral and terpsichorean tradition, without writing. As such, documentation of the historic relationship between those dances and contemporary Bharatanatyam is scant. ==Related pages== *Indira Rajan *Kathak ==References== ==Other websites== * Indo-American Arts Council * Johns Hopkins, Bharatanatyam and Mohiniyattam – Classical Dances of South India Category:Dance in India Category:Tamil culture",
 "title": "Bharata Natyam"
}