{
 "id": "353360",
 "text": "\"Burn\" is a song by American singer Usher. It was released from his album Confessions (2004). It was written by Usher and Jermaine Dupri, Bryan-Michael Cox. It was produced by Dupri and Cox. The song talks about a breakup in a relationship. Many music critics believed that it was Usher's \"personal struggles\". The song won the 2005 Kids Choice Award for Favorite Song. \"Burn\" was supposed to be the album's lead single. However, because many critics liked the song \"Yeah!\", it was released second. It was released in July 2004 as the second single. It reached a lot of music charts worldwide. It reached number one on the Billboard Hot 100 chart. At the time, \"Yeah!\" was still at number one. \"Burn\" replaced it. It stayed on the chart for eight weeks. \"Burn\" was certified platinum in Australia and gold in New Zealand and the United States. The song was given positive reviews. It won several awards. In 2009, it was named the 21st most successful song of the 2000s. It was included on the Billboard Hot 100 Songs of the Decade. ==Charts== ===Weekly charts=== Chart (2004–2005) Peak position scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" Canada CHR/Pop Top 30 (Radio & Records) 3 scope=\"row\" Europe (Eurochart Hot 100) 2 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" Romania (Romanian Top 100) 12 scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" ===Year-end charts=== Chart (2004) Position Australia (ARIA) 31 Belgium (Ultratop 50 Flanders) 95 Germany (Official German Charts) 80 Netherlands (Dutch Top 40) 84 Netherlands (Single Top 100) 83 New Zealand (Recorded Music NZ) 7 Switzerland (Schweizer Hitparade) 63 UK Singles (Official Charts Company) 27 US Billboard Hot 100 2 US Hot R&B;/Hip-Hop Songs (Billboard) 3 Chart (2005) Position Romania (Romanian Top 100) 92 ===Decade-end charts=== Chart (2000–09) Position US Billboard Hot 100 21 ===All-time charts=== Chart (1958–2018) Position US Billboard Hot 100 147 == References == Category:2003 songs Category:Usher songs",
 "title": "Burn (song)"
}