{
 "id": "353496",
 "text": "\"We Found Love\" is a song by Barbadian singer Rihanna. It was released from her album Talk That Talk (2011). It features Scottish DJ Calvin Harris. Harris also released the song on his album 18 Months (2012). The song was released as the lead single from Talk That Talk. It was released on September 22, 2011. \"We Found Love\" is a electro house song. It has several musical instruments. These include synthesizers, alarm bells, and a keyboard. The song is about a couple. They found love in a place where it is impossible to find love. The song was given mixed reviews from music critics. Many critics liked Rihanna's voice on the song and its instruments. Others did not like the lyrics and Harris' production. \"We Found Love\" was a hit single. It reached number one on the US Hot 100 chart for eight weeks in 2011 and for two weeks in 2012. This was more than her 2007 single \"Umbrella\". \"We Found Love\" became Rihanna's eleventh song to reach number one on the Hot 100 chart. She was then placed third for most number-one singles by a female singer. The song reached number one in 20 countries including Ireland, New Zealand, Switzerland and the United Kingdom. It got to the top five positions in Australia, the Netherlands and Spain. However, it reached the top ten in 29 countries worldwide. The music video for the song was directed by Melina Matsoukas. The video shows Rihanna as a drug abuser who searches for things that gets her excited in a relationship. Because of this, the relationship is no longer a positive one. This is because the woman is now a drug addict, and violence can be found between herself and her boyfriend. The video has received over 779 million views as of March 2018. It was given mixed reviews. Some critics believed the video supported violent sex. It was also believed that the actor chosen for the role of the boyfriend looked similar to Rihanna's ex-boyfriend, R&B; singer Chris Brown. Brown had assaulted Rihanna two years before the song was released. There have been remixes and cover versions of the song since its release. ==Charts== ===Weekly charts=== Chart (2011–12) Peak position Australia (ARIA) 2 Austria (Ö3 Austria Top 40) 2 Belgium (Ultratop 50 Flanders) 3 Belgium (Ultratop 40 Wallonia) 2 Brazil (Billboard Hot 100) 1 Canada (Canadian Hot 100) 1 Colombia (National-Report) 4 scope=\"row\" Denmark (Tracklisten) 1 Finland (Finland's Official List) 1 France (SNEP) 1 Germany (Media Control Charts) 1 scope=\"row\" Ireland (IRMA) 1 Israel Airplay (Media Forest) 1 Italy (FIMI) 3 Japan (Japan Hot 100) 6 Mexico Top 20 General (Monitor Latino) 8 Mexico Top 20 Inglés (Monitor Latino) 1 Mexico (Billboard Mexican Airplay) 1 Netherlands (Dutch Top 40) 3 New Zealand (RIANZ) 1 Norway (VG-lista) 1 Poland (Polish Music Charts) 1 Russia (EMI) 1 Scotland (Official Charts Company) 1 scope=\"row\" South Africa (Mediaguide) 1 South Korea (Gaon Chart) 2 Spain (PROMUSICAE) 2 Sweden (Sverigetopplistan) 1 Switzerland (Schweizer Hitparade) 1 UK Dance (Official Charts Company) 1 UK Singles (Official Charts Company) 1 UK Official Streaming Chart Top 100 20 US Billboard Hot 100 1 US Adult Contemporary (Billboard) 14 US Adult Pop Songs (Billboard) 5 US Hot Dance Club Songs (Billboard) 1 US Hot R&B;/Hip-Hop Songs (Billboard) 54 US Pop Songs (Billboard) 1 Venezuela Pop/Rock Songs (Record Report) 1 ===Year-end charts=== Chart (2011) Position Australia (ARIA) 12 Austria (Ö3 Austria Top 40) 30 Belgium (Ultratop 50 Flanders) 24 Belgium (Ultratop 40 Wallonia) 39 Canada (Canadian Hot 100) 43 Denmark (Tracklisten) 8 France (SNEP)http://proxy.siteo.com.s3.amazonaws.com/www.disqueenfrance.com/file/4bis100singlesfusionnesnep.pdf 13 Germany (Media Control Charts) 13 Greece (IFPI) 96 Hungary (Rádiós Top 40) 87 Ireland (IRMA) 3 Italy (FIMI) 20 Japan (Japan Hot 100) 95 Netherlands (Mega Single Top 100) 18 New Zealand (RIANZ) 9 Romanian (Romanian Top 100) 80 Spain (PROMUSICAE) 25 Sweden (Sverigetopplistan) 10 Switzerland (Schweizer Hitparade) 13 UK Singles (Official Charts Company) 5 US Billboard Hot 100 69 US Digital Songs 48 Chart (2012) Position Canada (Canadian Hot 100) 6 US Billboard Hot 100 8 ===Certifications=== Country Provider Certification Australia ARIA 5× Platinum Belgium IFPI Gold Denmark IFPI 2× Platinum Germany BVMI Gold Italy FIMI Multi-Platinum New Zealand RIANZ 3× Platinum Switzerland IFPI 2× Platinum United Kingdom BPI Platinum United States RIAA 9× Platinum ==Radio and release history== Country Date Format Label United Kingdom September 22, 2011 Radio premiere Mercury Records Australia Digital download Def Jam Recordings Belgium Canada Denmark France Italy Mexico New Zealand Norway Netherlands Spain Sweden Switzerland United States Brazil September 23, 2011 Universal Music United States October 4, 2011 Urban radio Def Jam Recordings Ireland October 5, 2011 Digital download Mercury Records United Kingdom Universal Music United States October 11, 2011 Mainstream and rhythmic radio Def Jam Recordings Germany October 21, 2011 CD single Universal Music Australia November 8, 2011 Digital Remix Single Def Jam Recordings ==Related pages== *List of Hot 100 number-one singles of 2012 (U.S.) == References == Category:2011 songs Category:Calvin Harris songs Category:House songs Category:Eurodance songs Category:R&B; songs Category:Rihanna songs",
 "title": "We Found Love"
}