{
 "id": "353494",
 "text": "\"Sexy and I Know It\" is a song by American duo LMFAO. It was released from the album Sorry for Party Rocking (2011). It was released as the third single on September 16, 2011. It was written by Stefan Kendal Gordy, GoonRock, Erin Beck, George M. Robertson and Kenneth Oliver. It was produced by Party Rock. The song reached number one on the US Hot 100 chart. It stood at number one for two weeks. The song became the group's second number one song. They became the second group to do this. The first was OutKast with \"Hey Ya!\" (2003) and \"The Way You Move\" (2004). \"Sexy and I Know It\" reached number one in Australia, Canada and New Zealand. The song was featured in the fifth season of Gossip Girl. The song was covered in Glee. ==Track listing== *;CD single #\"Sexy and I Know It\" (Album Version) – 3:19 #\"Sexy and I Know It\" (Mord Fustang) – 5:21 *;Digital download #\"Sexy and I Know It\" (Audiobot Remix) – 5:55 #\"Sexy and I Know It\" (Mord Fustang) – 5:19 #\"Sexy and I Know It\" (Tomba and Borgore Remix) – 3:41 #\"Sexy and I Know It\" (LA Riots Remix) – 5:40 #\"Sexy and I Know It\" (DallasK Remix) – 5:40 #\"Sexy and I Know It\" (Fuego's Moombahton Remix) – 3:51 #\"Sexy and I Know It\" (MADEin82 Remix) – 6:01 ==Charts== ===Weekly charts=== Chart (2011–12) Peak position Australia Dance (ARIA) 1 Brazil (Billboard Brasil Hot 100) 43 Brazil Hot Pop Songs 18 Colombia (National-Report) 4 Europe (Euro Digital Songs) 3 Luxembourg (Billboard) 2 Netherlands (Mega Dance Top 30) 1 Mexico (Billboard Mexican Airplay) 3 Mexico Top 20 General (Monitor Latino) 18 Portugal (Billboard) 7 Romania (Romanian Top 100) 71 Russia (2M) 4 South Korea International Singles (Gaon) 32 Ukraine (FDR Music Charts) 11 ===Year-end charts=== Chart (2011) Position Australia (ARIA) 6 Australia Dance (ARIA) 1 Austria (Ö3 Austria Top 40) 61 Belgium (Ultratop Flanders) 56 Belgium Dance (Ultratop Flanders) 1 Belgium (Ultratop Wallonia) 100 Belgium Dance (Ultratop Wallonia) 45 Canada (Canadian Hot 100) 30 Denmark (Tracklisten) 38 France (SNEP) 42 Germany (Official German Charts) 72 Hungary (Dance Top 40) 37 Netherlands (Dutch Top 40) 43 Netherlands (Single Top 100) 40 New Zealand (Recorded Music NZ) 11 Polish Dance Singles Chart 43 Russia Airplay (Tophit) 188 Sweden (Sverigetopplistan) 23 Switzerland (Schweizer Hitparade) 63 UK Singles (Official Charts Company) 31 US Billboard Hot 100 57 US Dance/Electronic Digital Songs (Billboard) 1 Chart (2012) Position Australia (ARIA) 37 Australia Dance (ARIA) 6 Austria (Ö3 Austria Top 40) 51 Belgium (Ultratop Flanders) 45 Belgium Dance (Ultratop Flanders) 63 Belgium (Ultratop Wallonia) 19 Belgium Dance (Ultratop Wallonia) 37 Canada (Canadian Hot 100) 7 France (SNEP) 28 Germany (Official German Charts) 84 Hungary (Dance Top 40) 1 Netherlands (Single Top 100) 38 New Zealand (Recorded Music NZ) 46 Poland (ZPAV) 19 Russia Airplay (Tophit) 17 Spain (PROMUSICAE) 21 Sweden (Sverigetopplistan) 37 Switzerland (Schweizer Hitparade) 32 Ukraine Airplay (Tophit) 154 UK Singles (Official Charts Company) 30 US Billboard Hot 100 13 US Dance/Mix Show Airplay (Billboard) 14 US Latin Pop Songs (Billboard) 28 US Hot Latin Songs (Billboard) 39 US Mainstream Top 40 (Billboard) 25 US Rhythmic (Billboard) 27 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 24 US Billboard Hot 100 37 ===All-time charts=== Chart (1958-2018) Position US Billboard Hot 100 143 ==Release history== Country Date Format Label United States September 27, 2011 Digital download Interscope Records Germany October 21, 2011 CD single Universal Music ==Related pages== *List of Hot 100 number-one singles of 2012 (U.S.) == References == Category:2011 songs Category:Narcissism in fiction",
 "title": "Sexy and I Know It"
}