{
 "id": "353519",
 "text": "Daydream is the fifth album by American singer and songwriter Mariah Carey. It was released on October 3, 1995 by Columbia Records. Musically, Daydream features Carey's signature R&B; and pop ballads, along with some uptempo dance songs along with the inclusion of hip hop; a genre, that Carey would include throughout her career. ==Track listing== ==Charts and certifications== ===Charts=== Chart Peak position Argentine Albums Chart 7 Australian Albums Chart 1 Austrian Albums Chart 5 Belgian Flanders Albums Chart 6 Belgian Wallonia Albums Chart 3 Canadian Albums Chart 2 Danish Albums Chart 2 Dutch Albums Chart 1 European Albums Chart 2 Finnish Albums Chart 12 French Albums Chart 2 German Albums Chart 1 Hungarian Albums Chart 13 Irish Albums Chart 6 Italian Albums Chart 6 Japanese Albums Chart 1 New Zealand Albums Chart 1 Norwegian Albums Chart 3 Portuguese Albums Chart 1 Spanish Albums Chart 5 Swedish Albums Chart 6 Swiss Albums Chart 1 UK Albums Chart 1 U.S. Billboard 200 1 U.S. Billboard R&B;/Hip- Hop Albums 1 ===End of year charts=== End of year chart (1995) Position Australian Albums Chart 9 Belgian Albums Chart (Flanders) 40 Belgian Albums Chart (Wallonia) 38 Canadian Albums Chart 84 French Albums Chart 17 End of year chart (1996) Position Australian Albums Chart 9 Canadian Albums Chart 12 French Albums Chart 20 U.S. Billboard 200 2 ===End of decade charts=== Chart (1990–1999) Position U.S. Billboard 200 18 ===Certifications=== Country (Provider) Certification (sales thresholds) Australia (ARIA) 5× Platinum Austria (IFPI) Gold Canada (CRIA) 7× Platinum Europe (IFPI) 3× Platinum France (SNEP) 2× Platinum Germany (IFPI) Platinum Japan (RIAJ) Million Netherlands (NVPI) Platinum New Zealand (RIANZ) 5× Platinum Norway (IFPI) Platinum Poland (ZPAV) Gold Spain (PROMUSICAE) 2× Platinum Switzerland (IFPI) Gold United Kingdom (BPI) 2× Platinum United States (RIAA) Diamond ===Singles=== Year Single Peak chart positions Certifications (sales thresholds) US US R&B; US AC US Dance AUS AUT CAN FRA GER IRE ITA JAP NL NZ SPA SWE SWI UK 1995 \"Fantasy\" 1 1 8 1 1 13 1 5 12 10 9 18 10 1 — 13 10 4 * US: 2× Platinum * AUS: Platinum * FRA: Silver * NZ: Platinum * UK: Silver \"One Sweet Day\" (with Boyz II Men) 1 2 1 — 2 25 1 5 25 4 — 87 2 1 — 7 12 6 * US: 2× Platinum * AUS: Platinum * FRA: Silver * NZ: Platinum * UK: Silver \"Open Arms\" — — — — 27 — — 29 65 7 — — 15 8 — 54 30 4 1996 \"Always Be My Baby\" 1 1 2 6 17 1 — — 76 10 — 79 27 5 — 38 — 3 * US: Platinum * AUS: Gold * NZ: Gold \"Forever\" — — 2 — — — 11 — — — — — 47 40 — — — — \"Underneath the Stars\" — 69 — — — — — — — — — — — — — — — — \"—\" denotes a title that did not chart or was not released in that territory. == References == Category:Mariah Carey albums Category:1995 albums Category:Pop albums Category:Dance albums Category:R&B; albums Category:Columbia Records albums",
 "title": "Daydream (album)"
}