{
 "id": "353516",
 "text": "Merry Christmas is the fourth studio album and first Christmas album by American R&B; singer-songwriter Mariah Carey. It was released on October 28, 1994. Merry Christmas has sold over 5.5 million copies in the United States alone. The Recording Industry Association of America certified the album 5× Platinum. ==Track listing== ==Charts and certifications== ===Charts=== Chart Peak position Australian Albums Chart 2 Austrian Albums Chart 4 Belgian Albums Chart 5 Canadian Albums Chart 21 Danish Albums Chart 4 Dutch Albums Chart 4 European Albums Chart 9 German Albums Chart 15 Greek Albums Chart 37 Hungarian Albums Chart 15 Italian Albums Chart 3 Japanese Albums Chart 1 New Zealand Albums Chart 10 Norwegian Albums Chart 11 Portuguese Albums Chart 9 Spanish Albums Chart 26 Swedish Albums Chart 4 Swiss Albums Chart 4 UK Albums Chart 32 U.S. Billboard 200 3 U.S. Billboard R&B;/Hip-Hop Albums 4 US Holiday Albums (Billboard) 1 ====All-time charts==== Chart Position US Holiday Albums (Billboard) 3 ===Certifications=== Country (Provider) Certifications Australia (ARIA) 4× Platinum Austria (IFPI) Gold Canada (CRIA) Platinum Europe (IFPI) Platinum Germany (IFPI) Gold Italy (FIMI) Gold Japan (RIAJ) 5× Platinum (1 Million) Netherlands (NVPI) Platinum New Zealand (RIANZ) 2× Platinum Norway (IFPI) Platinum Switzerland (IFPI) Gold United Kingdom (BPI) Gold United States (RIAA) 5× Platinum ===Singles=== Year Single Peak chart positions Certifications (sales thresholds) US US R&B; US AC US Dance AUS AUT CAN FRA GER IRE ITA JAP NL NZ SPA SWE SWI UK 1994 \"All I Want for Christmas Is You\" 1 — 6 — 1 11 1 — 14 3 1 2 2 4 4 7 18 1 * AUS: Platinum * ITA: Platinum * JP: Million * UK: Gold * US: 2× Platinum \"Joy to the World\" — — — 17 33 — — — — — — — — — — — — — — \"O Holy Night\" — — — — — — — — — — — — — — — — — — — \"—\" denotes releases that did not chart or was not released. ==References== Category:Mariah Carey albums Category:1994 albums Category:Christmas albums Category:Gospel albums Category:R&B; albums Category:Columbia Records albums",
 "title": "Merry Christmas (album)"
}