{
 "id": "353640",
 "text": "The Collection 1982–1988 is a 2CD greatest hits album by Canadian singer Celine Dion. ==Track listing== # Title Writers Length Disc one 1\\. \"Ne partez pas sans moi\" N. Martinetti, A. Sereftug 3:07 2\\. \"D'amour ou d'amitié\" E. Marnay, R. Vincent, J.P. Lang 4:05 3\\. \"Visa pour les beaux jours\" E. Marnay, C. Loigerot, T. Geoffroy 3:28 4\\. \"Les oiseaux du bonheur\" E. Marnay, A. Popp 3:28 5\\. \"Tellement j'ai d'amour pour toi\" E. Marnay, H. Giraud 3:01 6\\. \"La religieuse\" D. Barbelivien 3:32 7\\. \"C'est pour toi\" E. Marnay, F. Orenn 4:07 8\\. \"Avec toi\" E. Marnay, C. Loigerot, T. Geoffroy 3:18 9\\. \"Mon rêve de toujours\" E. Marnay, J. P. Goussaud 4:23 10\\. \"Du soleil au cœur\" A. Popp, J.C. Massoulier 2:46 11\\. \"À quatre pas d'ici\" E. Marnay, A. Hill, P. Sinfield 4:00 12\\. \"Un amour pour moi\" E. Marnay, C. Loigerot, T. Geoffroy 3:23 13\\. \"Billy\" E. Marnay, P. Lemaitre 3:09 14\\. \"Comment t'aimer\" E. Marnay, R. Musumarra 4:00 Disc two 1\\. \"Mon ami m'a quittée\" E. Marnay, C. Loigerot, T. Geoffroy 3:05 2\\. \"La dodo la do\" E. Marnay, C. Gaubert 3:06 3\\. \"Hymne à l'amitié\" E. Marnay, D.B. Bembo, M. Giacomelli, S. Bardot 4:01 4\\. \"Je ne veux pas\" E. Marnay, R. Musumarra 4:06 5\\. \"C'est pour vivre\" E. Marnay, A. Popp 4:04 6\\. \"En amour\" E. Marnay, C. Loigerot, T. Geoffroy 3:20 7\\. \"Ne me plaignez pas\" E. Marnay, S. Thompson 3:05 8\\. \"Les chemins de ma maison\" E. Marnay, A. Bernard, P. Lemaitre 4:16 9\\. \"Hello mister Sam\" E. Marnay, C. Loigerot, T. Geoffroy 4:17 10\\. \"Trois heures vingt\" E. Marnay, P. Greedus, B. Blue 3:41 11\\. \"Trop jeune à dix-sept ans\" E. Marnay, D.B. Bembo, M. Giacomelli, S. Bardot 4:54 12\\. \"Paul et Virginie\" E. Marnay, C. Loigerot, T. Geoffroy 3:23 13\\. \"La voix du bon Dieu\" E. Marnay, S. Dumont 3:22 14\\. \"Benjamin\" E. Marnay, P. Papadiamandis 4:38 ==Chart performance== Country Peak position Number of weeks Sales Denmark 11 3 n/a Belgium Wallonie 20 12 n/a Belgium Wallonie Mid- price 26 3 n/a Sweden 27 3 n/a Netherlands 37 6 n/a United States - - 9,900 ==References== Category:1997 albums Category:Celine Dion albums",
 "title": "The Collection 1982-1988"
}