{
 "id": "353855",
 "text": "Cope's gray treefrog, Cope's chameleon tree frog, the western common tree frog, southern gray tree frog, or central Texas tree frog (Dryophytes chrysoselis) is a species of tree frogs. They live in the United States. Scientists think Cope's grey tree frog evolved after the last major ice age. Cope's grey tree frog can live in temperatures as low as -8 °C.Adaptations of Frogs to Survive Freezing Females can lay up to 10–40 eggs. The eggs hatch in four days. When the eggs hatch, they are called tadpoles. Tadpoles become small frogs in 45–65 days. The species name chrysoscelis is from the Greek word chrysos, which means \"gold.\" The Greek word scelis means \"leg.\" This frog is gray or green in color with bright orange spots on its legs. This frog stays in the trees. Its color helps it blend in with the gray or brown tree bark. Human beings only see this frog on the ground when it is time for the frogs to mate and lay eggs. This frog lives in Ontario, North Dakota, South Dakota, Nebraska, Minnesota, Wisconsin, Missouri, Kansas, Texas, Pennsylvania, Illinois, and Maryland south to Florida. == References == == Books == * *Bernard S. Martof et al. (1980). Amphibians and Reptiles of the Carolinas and Virginia. Chapel Hill: University of North Carolina Press. . *Sargent (1969). A suggestion regarding hindwing diversity among moths of the genus Catocala OF (Noctuidae). Journal of the Lepidopterists' Society 23: 261-264. (Available here .) *Thomas F. Tyning (1990). A Guide to Amphibians and Reptiles. Boston: Little, Brown and Company. . == Other websites == *Amphibiaweb — accessed 1 June 2006 *Animal Diversity Web: Hyla versicolor & Hyla chrysoscelis *Atlanta's Backyard Herps — accessed 8 May 2006 *Univ. Maine Wetland Connections — accessed 11 May 2006 *Frogs and Toads of Ohio — accessed 11 May 2006 *Exploratorium: Amazing Adaptable Frog — accessed 11 May 2006 *IUCN — Global Amphibian Assessment, accessed 1 June 2006 *NatureServe — conservation status, accessed 1 June 2006 Category:Frogs of North America",
 "title": "Cope's gray treefrog"
}