{
 "id": "353842",
 "text": "Mark Catesby (24 March 1682/83 - 23 December 1749) was an English naturalist. Between 1729 and 1747 Catesby published his book Natural History of Carolina, Florida and the Bahama Islands. The book was the first publication to describe flora and fauna of North America. The book described 220 birds, reptiles, amphibians, fish, insects, mammals and plants. Catesby studied natural history in London. Catesby collected seeds in Virginia from 1714 to 1719. ==Gallery of Catesby's images== File:Schweinsfisch.jpg|Lachnolaimus maximus, 1725 File:Anguinis viridis Catesby 1743.jpg|Anguinis viridis, 1743 File:Catesby HoodedMerganser.jpg|Lophodytes cucullatus, 1748 File:Catesby PicvsVentreRubro.jpg|Ventro Rubro, Melanerpes carolinus, 1749 File:Turdus minimus Catesby.jpg|Turdus minimus (now Catharus minimus) and dahoon holly (Ilex cassine), 1754 File:Rana Aquatica The Water Frog Mark Catesby 1754.jpeg|Rana Aquatica, The Water-Frog, 1754 File:Cancer Chelis Rubris Mark Catesby.jpeg|Cance Chelis Rubis, The red-claw Crab; Titanokeratophyton &c.; , 1754 File:Melanerpes erythrocephalus Catesby.jpg|Melanerpes erythrocephalus, 1754 File:Coccothraustes rubra Catesby.jpg|Coccothraustes rubra (probably Cardinalis cardinalis) and Nux Juglans alba Virginiensis, 1754 File:Catesby HeronSalamander.jpg|Ardea herodias, 1771 ==Books== *Jackson, Christine E., (1985) Bird Etchings: the illustrators and their books, 1655-1855. Ithaca: Cornell University Press *Walters, Michael (2003) A Concise History of Ornithology. London: Christopher Helm *Wiatt, Alex L. (1992) The Descendants of Stephen Field of King and Queen County, Virginia, 1721, Fredericksburg VA: BookCrafters Myers, Amy R. W. & Pritchard, M. B. (1998) \"Empire's nature. Mark Catesby's New World vision,\" Chapel Hill & London: University of North Carolina Press ==Other websites== *Catesby Commemoration Trust ===Works=== *Mark Catesby (1731). The Natural History of Carolina, Florida and (v1). Online scanned edition from Rare Book Room. *Mark Catesby (1743). The Natural History of Carolina, Florida and (v2). Online scanned edition from Rare Book Room. *Mark Catesby, The Natural History of Carolina, Florida and the Bahamas Electronic edition: high quality images and user-friendly text from the American Studies Programs at the University of Virginia * View works by Mark Catesby online at the Biodiversity Heritage Library. Category:1683 births Category:1749 deaths Category:English botanists Category:Fellows of the Royal Society Category:English naturalists",
 "title": "Mark Catesby"
}