{
 "id": "354103",
 "text": "William Shakespeare ( 23 April 1564 – 23 April 1616) was an English dramatist, poet, and theatre actor. He wrote 40 known plays (with about half of them considered comedies) and two long poems in his lifetime. He lived in Stratford-upon-Avon, in Warwickshire, England. His plays are still performed today. He is often quoted in modern writing. Shakespeare wrote his works between approximately 1592 and 1613. His plays are among the best known in English literature and are studied in schools around the world. Along with writing, Shakespeare also acted in The Chamberlain's Men acting company, starting in 1594. Shakespeare wrote plays of different kinds, or genres. There are histories, tragedies and comedies. His four major tragedies are Hamlet, Othello, Macbeth and King Lear. There is a popular myth that Shakespeare was the first person to write a tragicomedy. Tragicomedies were being written well before Shakespeare's birth and baptism. Shakespeare's plays are written in poetic language. Many of the plays are set in strange, distant places and times. The stories are often exciting, romantic and happy (in the comedies), or very sad (in the tragedies). These stories make people want to know what will happen to the characters. The plays talk about things that are still important today, like love, sadness, hope, pride, hatred, jealousy, and foolishness. Shakespeare added new words and phrases to the English language. He created over 1,700 English words. He also made some words more popular. == Life == Shakespeare was born in Stratford-upon-Avon in 1564. Though the exact date is unknown, historians accept 23 April 1564 as Shakespeare's birthday. He was probably the third of eight children. Shakespeare was probably educated at the King's New School in Stratford. Latin was popular in grammar schools during the Elizabethan era, so Shakespeare learned Latin very intensively.Baldwin, T.W. (1944). William Shakspere's Small Latine & Lesse Greek.1. Urbana, Ill: When Shakespeare was 18, he married Anne Hathaway, a 26-year-old woman. Their wedding was rushed because Anne was already pregnant. They had three children: Susanna (who married John Hall); Hamnet (who died at the age of 11 from unknown causes); and Judith (who married Thomas Quiney). By 1592, Shakespeare had become an actor and was becoming well known as a writer of plays. At the time of his death in 1616, only some of Shakespeare’s plays had been published in single editions. His plays were collected and published in 1623, seven years after he died. There is proof that people in Shakespeare's time thought highly of him. After his death, even his rival Ben Jonson said:Jonson, Ben 1996. \"To the memory of my beloued, The AVTHOR MR. WILLIAM SHAKESPEARE: AND what he hath left vs\", in Shakespeare, William; Hinman, Charlton (ed.); Blayney, The First Folio of Shakespeare. 2nd ed, New York: W. W. Norton & Company, :\"Triumph, my Britain, thou hast one to show, :To whom all scenes of Europe homage owe. :He was not of an age, but for all time!\" Shakespeare was involved in the building of the Globe Theatre in 1599. (It burned down a few years later.). His plays are still performed at a new Globe Theatre, built in 1997 near the original. ==Marriage and sexuality == Although Shakespeare was married to a woman and fathered three children, people have questioned his sexuality. Some people, such as Peter Holland of the Shakespeare Institute at Birmingham University, have pointed out that Shakespeare directed some of his sonnets towards young men. They say this is evidence that he may have been bisexual. == Who wrote \"Shakespeare\"? == About 150 years after his death, some scholars suggested that Shakespeare did not actually write all of the works that are called his. They had various reasons for saying this. For example, the person who wrote \"Shakespeare’s works\" knew a lot about other countries (especially Italy and France), but there is not enough evidence to suggest that Shakespeare ever left England. Some scholars think he might have traveled to Scotland, because of his great and vast knowledge of Scotland in Macbeth, where the play was set in. Several other writers of \"Shakespeare\" have been suggested, such as Francis Bacon, Christopher Marlowe, and Edward de Vere, 17th Earl of Oxford. However, most scholars believe that William Shakespeare did write the works that bear his name. == List of Shakespeare's plays == === Shakespeare's tragedies === * Romeo and Juliet * Macbeth * King Lear * Hamlet * Othello * Titus Andronicus * Julius Caesar * Antony and Cleopatra * Coriolanus * Troilus and Cressida * Timon of Athens === Shakespeare's comedies === * The Comedy of Errors * All's Well That Ends Well * As You Like It * A Midsummer Night's Dream * Much Ado About Nothing * Measure for Measure * The Tempest * Taming of the Shrew * Twelfth Night or What You Will * The Merchant of Venice * The Merry Wives of Windsor * Love's Labour's Lost * The Two Gentlemen of Verona * Pericles Prince of Tyre * Cymbeline * The Winter's Tale === Shakespeare's histories === * King John (play) * Richard II * Richard III * Henry IV, part 1 * Henry IV, part 2 * Henry V * Henry VI, part 1 * Henry VI, part 2 * Henry VI, part 3 * Henry VIII *Julius Caesar === Other plays === * Love's Labour's Won * Cardenio ===Shakespeare's tragicomedies=== * Twelfth Night * The Merchant of Venice * As You Like It * A Midsummer Night's Dream * == References == ==More reading== * == Other websites == * Shakespeare Open Literature * Open Source Shakespeare * Modern English Shakespeare Resources: Facts, Plays, Sonnets * Shakespeare - SparkNotes Category:1564 births Category:1616 deaths Category:English playwrights Category:English poets Category:Writers from Warwickshire Category:People from Stratford-upon-Avon",
 "title": "William Shakespeare"
}