{
 "id": "354126",
 "text": "Antisocial personality disorder (ASPD) is a personality disorder. A person with ASPD fails to behave the way society says people should behave. People with this disorder often don’t care about society’s rules or the rights of other people. People with Antisocial Personality Disorder are sometimes nicknamed sociopaths or psychopaths but those words aren’t really used in science. The ASPD pattern begins in childhood or adolescence and continues into adulthood.Antisocial personality disorder – Diagnostic and Statistical Manual of Mental Disorders Fourth edition Text Revision (DSM-IV-TR) American Psychiatric Association (2000) pp. 645–650 People with ASPD have no conscience or sense of morality, although the large majority know right from wrong. People with ASPD often commit crimes. They can also be impulsive, aggressive, reckless, and destructive.Schacter, Daniel L., Daniel T. Gilbert, and Daniel M. Wegner. Psychology. Worth Publishers, 2010. Print. About three percent of men and one percent of women have ASPD. == History == In 1801, Philippe Pinel wrote that some of his patients had “Madness without Delirium” meaning that they seemed normal most of the time and could tell what was or wasn’t real but they still did things which were violent and dangerous to both themselves and other people without learning from their mistakes or feeling remorse. In 1835, the British psychiatrist James Cowles Prichard renamed it “Moral Insanity” meaning that the person was actually sane but didn’t have a Conscience. In the 1890s, a German psychiatrist named Julius Ludwig August Koch changed its name from “Moral Insanity”. to “Psychopathic degeneration” which he said was one of many different kinds of Psychopathy. In 1909, the American psychiatrist Karl Birnbaum said that there were some Psychopaths who were not born Psychopaths but became Psychopaths because of how they were raised and he said they should be called \"Sociopaths\". In 1928, the American psychologist George E. Partridge started to study Psychopaths to figure out what they all had in common and what made them the way they were. In 1930, Partridge said that the one thing that all Psychopaths had in common was that they didn’t understand or follow society’s rules about how to treat other people. So Partridge said that instead of being called “psychopaths” they should be called “sociopaths”. He said that instead of being called “Psychopathic degeneration”, it should be called “Sociopathy”. In 1941 , the American psychiatrist Hervey M. Cleckley wrote a book called The Mask of Sanity. In it, he used the word Psychopathy to mean “Madness without Delirium”, “sociopathy” and “moral insanity”. Cleckley says that a psychopath is a person who can’t feel normal emotions but pretends that he can to trick everyone into believing that he can. Cleckley says that a psychopath usually seems like a normal person because psychopaths don’t have any Psychosis but that actually they make really bad decisions all the time which are often dangerous to other people and to themselves. In 1952, the Diagnostic and Statistical Manual of Mental Disorders was published and it called psychopathy “sociopathic mental disturbance”. It said sociopaths were people who were “always in trouble” had no loyalty to anyone and could come up with any excuse for any bad thing that they did. It also said that all psychopaths were sociopaths but not all sociopaths were psychopaths. In 1968, the second version of the DSM renamed it “antisocial personality” and said that it meant people who only cared about themselves, did a lot of things society says people shouldn’t do and never feel guilt. And who always say it’s someone else’s fault when bad things happen to them. In the 1970s, a Canadian psychologist named Robert D. Hare wanted an easy way to figure out if a person were a psychopath. So based on Cleckley’s book, Hare made a list of the things someone has to do before you can call them a psychopath. Hare called it The Psychopathy Checklist . Hare said that there were people who did a lot of the things that psychopaths did but only because of how they were raised and not because of anything physical or genetic and said those people were called sociopaths but not psychopaths. == DSM III == In 1980, the new version of the DSM used the name “Antisocial Personality Disorder”. == DSM IV == In 1994, the new DSM called the DSM IV said that Antisocial personality disorder was also called “Psychopathy, sociopathy or dyssocial personality disorder”. ==DSM-V criteria== According to the latest version of the Diagnostic and Statistical Manual of Mental Disorders (the DSM-V), a person has ASPD if they fit the following requirements: A common pattern of disregard for and violation of the rights of others, since age 15 years, as indicated by three (or more) of the following: ## Failure to conform to social norms concerning lawful behaviors, such as performing acts that are grounds for arrest. ## Deceitfulness, repeated lying, use of aliases, or conning others for pleasure or personal profit. ## Impulsivity or failure to plan. ## Irritability and aggressiveness, often with physical fights or assaults. ## Reckless disregard for the safety of self or others. ## Consistent irresponsibility, failure to sustain consistent work behavior, or honor monetary obligations. ## Lack of remorse, being indifferent to or rationalizing having hurt, mistreated, or stolen from another person. ## The individual is at least age 18 years. ## Evidence of conduct disorder typically with onset before age 15 years. ## The occurrence of antisocial behavior is not exclusively during schizophrenia or bipolar disorder.American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders (5th ed.). Washington, DC: Author. ==References==",
 "title": "Antisocial personality disorder"
}