{
 "id": "35437",
 "text": "Ubuntu is a free operating system that uses the Linux kernel. It is named after the word \"ubuntu\", which is a Zulu word meaning \"humanity to others\". It is pronounced \"oo-boon-too\". Ubuntu is one of the most popular Linux distributions. It is based on the Debian Linux computer operating system. The goal with Ubuntu is to make it easy to use. Ubuntu can be used on all types of personal computers (and even devices such as robots) including in Windows 10. Ubuntu is downloaded as a DVD's ISO image, which is free to download from the Ubuntu website. It can be installed or tested by running the DVD. A new release of Ubuntu is released every six months. The long-term support releases are one type of these, and they are released every two years. Due to their longer periods of update support, most users prefer to install those releases. The latest long-term support release is Ubuntu 24.04 (\"Noble Numbat\"), which is supported until 2029. Started in 2004, Ubuntu has been developed by Canonical Ltd., a company owned by a rich South African man named Mark Shuttleworth. == Packages and software support == Ubuntu splits all software into four different categories to show differences in licensing and the amount of support available. They are: free software non-free software supported Main Restricted unsupported Universe Multiverse Free software here includes only software that meets the Ubuntu licensing requirements, which almost are the same as the Debian Free Software Guidelines. There is one difference for the Main category, however it has firmware and fonts which cannot be changed, but are included if Ubuntu will not work right. Non-free software is usually unsupported (Multiverse), but some exceptions (Restricted) are given for very important non-free software. Supported non-free software include device drivers that are needed to run Ubuntu on current hardware. The level of support in the Restricted category is less than that of Main, since the developers may not be able to get to the source code. It is wanted that Main and Restricted should contain all the software needed for a general-use Linux system. Besides the official repositories is Ubuntu Backports, which is an officially known project to backport newer software from later releases of Ubuntu. The repository is not comprehensive (meaning that it has parts missing from it); it is mostly made up of user-requested packages, which are accepted if they meet quality guidelines. == Releases == Two new releases of Ubuntu are released each year, normally in April and October. The number of the Ubuntu release is 'X.YY', with 'X' being the year of release (minus 2000) and 'Y' being the month of release. For example, Ubuntu 4.10 was released in October (the tenth month of the year), 2004. The name of the release (for example, Breezy Badger) is an adjective (a describing word) followed by the name of an animal. Version Release date Name More information 4.10 20 October 2004 Warty Warthog First release 5.04 8 April 2005 Hoary Hedgehog First \"Kubuntu\" created 5.10 13 October 2005 Breezy Badger First \"Edubuntu\" 6.06 1 June 2006 Dapper Drake LTS-release, First \"Xubuntu\" created 6.06.1 August 2006 Dapper Drake Point One LTS-release, 1st update 6.06.2 January 2008 Dapper Drake Point Two LTS-release, 2nd update 6.10 26 October 2006 Edgy Eft experimental version 7.04 19 April 2007 Feisty Fawn 7.10 18 October 2007 Gutsy Gibbon First \"Gobuntu\" created 8.04 24 April 2008 Hardy Heron LTS-release 8.04.1 June 2008 Hardy Heron Point One LTS-release, 1st update 8.10 27 October 2008 Intrepid Ibex 9.04 23 April 2009 Jaunty Jackalope 9.10 29 October 2009 Karmic Koala 10.04 29 April 2010 Lucid Lynx LTS-release, first \"Lubuntu\" created 10.10 10 October 2010 Maverick Meerkat 11.04 28 April 2011 Natty Narwhal 11.10 13 October 2011 Oneiric Ocelot 12.04 26 April 2012 Precise Pangolin LTS-release 12.10 18 October 2012 Quantal Quetzel 13.04 25 April 2013 Raring Ringtail 13.10 17 October 2013\"Ubuntu 13.10 (Saucy Salamander) released\" Saucy Salamander Server release 14.04 17 April 2014 Trusty Tahr LTS-release 14.10 20 October 2014 Utopic Unicorn 15.04 23 April 2015 Vivid Vervet 15.10 22 October 2015 Wily Werewolf 16.04 21 April 2016\"Ubuntu 16.04 LTS (Xenial Xerus) released\" Xenial Xerus LTS-release 16.10 13 October 2016 Yakkety Yak 17.04 13 April 2017 Zesty Zapus 17.10 19 October 2017 Artful Aardvark 18.04 26 April 2018 Bionic Beaver LTS-release 18.10 18 October 2018 Cosmic Cuttlefish 19.04 18 April 2019 Disco Dingo 19.10 17 October 2019 Eoan Ermine 20.04 23 April 2020 Focal Fossa LTS-release 20.10 22 October 2020 Groovy Gorilla 21.04 22 April 2021 Hirsute Hippo 21.10 14 October 2021 Impish Indri 22.04 21 April 2022 Jammy Jellyfish LTS-release 22.10 20 October 2022 Kinetic Kudu 23.04 20 April 2023 Lunar Lobster 23.10 12 October 2023 Mantic Minotaur 24.04 25 April 2024 Noble Numbat LTS-release 24.10 10 October 2024 Oracular Oriole 25.04 17 April 2025 Plucky Puffin LTS indicates Long Term Support. Very old processors (i.e. 32-bit Intel i386) have been supported up to Ubuntu 18.04, but users \"will not be allowed to upgrade to Ubuntu 18.10 as dropping support for that architecture is being evaluated\". == Package == Ubuntu's official software package repositoryArchLinux.org, \"Official repositories,\" excerpt, \"A software repository is a storage location from which software packages may be retrieved and installed on a computer\"; retrieved 2012-06-07. includes, for example, UNetbootin.Unbuntu, Package unetbootin; retrieved 2012-06-07. == Variants == Ubuntu is available in many different variants, e.g. because there are several options for which desktop environment to use. The official sister distributions which are fully supported by Canonical are: * Ubuntu Kylin, an official derivative aimed at the Chinese market * Kubuntu, a desktop distribution using KDE rather than GNOME * Ubuntu Server Edition, which is mainly used on servers to provide services. This version only comes with a command line interface, but a graphical user interface can be installed. * Xubuntu, a \"lightweight\" distribution based on the Xfce desktop environment instead of GNOME, designed to run better on low-specification computers * Lubuntu, a desktop using the LXQT desktop environment * Ubuntu Budgie, a desktop using the Budgie desktop environment * Ubuntu MATE, a desktop using the MATE desktop environment * Ubuntu Studio, a multimedia-creation form of Ubuntu * Edubuntu, a distribution designed for classrooms * Ubuntu Cinnamon, a desktop using the Cinnamon desktop environment * Ubuntu Unity, a desktop using the Unity desktop environment == Related pages == * GNU/Linux * Debian * GNOME * List of Linux distributions * Intel == References == == Other websites == * * Kubuntu – Ubuntu with KDE * Edubuntu – Ubuntu for children to learn with * Xubuntu – Ubuntu with Xfce * Ubuntu Guide (unofficial) – help manual, tips, FAQ, and software guide * * Run Ubuntu online Category:Debian-based Linux distributions Category:Linux distributions",
 "title": "Ubuntu"
}