{
 "id": "35433",
 "text": "A biological weapon is a weapon that delivers toxins or pathogens (like bacteria or viruses), with the goal of making people sick or killing them. Biological weapons are also called bio-weapons. Their use in war is called biological warfare. ==Parts of a biological weapon== A biological weapon usually has two parts. The first is the biological agent (also called a bio- agent, biological threat agent, or biological warfare agent). This is the pathogen that is meant to make people sick. The second is the delivery system - how the biological agent is going to get to and expose the people it is supposed to infect. Some bio-agents can be \"weaponized\" - changed to make them more dangerous. For example, sometimes scientists can change a pathogen's genes so the pathogen is deadlier, and so it will not be killed by usual antidotes or treatments. Some bio-agents can be changed so they are easier to store, spread, or use as weapons. As of 2016, there are more than 1,200 different kinds of bio-agents that could be made into weapons. ==Examples of biological agents== Examples of some biological agents and toxins are listed below. Experts have said that these pathogens could be used as biological weapons. A few already have been used, including anthrax, bubonic plague, smallpox, and ricin. ===Bacterial agents=== Pathogen Disease Comments Bacillus anthraces Anthrax Was weaponized by the U.S., Soviet Union, and Iraqp. 26 Brucella species Brucellosis Brucella suis was the first bio-agent weaponized by the U.S., in 1954; Brucella species easily survive in aerosol form Yersinia pestis Bubonic or pneumonic plague Killed 60% of Europe's population in the 1300s. Pneumonic plague is fatal if antibiotics are not given within 1 day after symptoms startp. 55 Weaponized by U.S. and Soviet Union during the Cold War Vibrio cholerae Cholera Could be spread by contaminating water supplies Shigella dysenteriae; Some species of Escherichia coli Dysentery Could be spread by contaminating food suppliesp. 212 Coxiella burnetii Q fever Number of bacteria needed to infect a person is one - the lowest known to manp. 67 Can live on surfaces for 60 days, in aerosols, and in many temperatures Weaponized by U.S. between 1942 and 1969 Francisella tularensis Tularemia Very contagious; bacteria are very easy to get because they occur in nature; Weaponized by U.S. between 1942 and 1969 Rickettsia prowazekii Typhus High mortality rate if untreated; can be spread by aerosolp. 169 Staphylococcus aureus Many Could be spread by contaminating food supplies or by aerosol Some strains (like MRSA) are resistant to antibiotics ===Viral agents=== Pathogen Disease Comments Alphaviruses Many Can cause many forms of viral encephalitis; very low dose needed for infection. Easily spread by aerosol.p. 96 Filoviridae and Arenaviridae viruses Many Cause viral hemorrhagic fevers, like Ebola virus and Lassa fever Can be spread by aerosol; very high mortality ratesp. 107 Variola major Smallpox Very contagious, easily spread through air, mortality rate 20-40% Eradicated in 1970s, but laboratories still have samples ===Biological toxins=== Toxin Toxin Comes From: Toxin Causes: Comments Botulinum Clostridium botulinum Botulism One of the deadliest toxins known to exist; Weaponized by U.S. between 1942 and 1969p. 122 Ricin Castor oil plant Ricin poisoning Can be made at home; very toxic by any route of exposure ==Examples of delivery systems== In the past, countries have designed many different delivery systems for exposing people to biological agents. These systems have included: * Bombs, missiles, hand grenades, and rockets, with the biological agent inside * Tanks that could spray bio-agents from airplanes, cars, trucks, and boats * Aerosol sprayers * Brushes to contaminate surfaces with bio-agents * Ways of contaminating food and clothing ==Examples of biological weapons== A biological agent by itself is not enough to make a biological weapon. Neither is a delivery system by itself. A biological weapon has to have both: the bio- agent that is meant to make people sick, and a system to deliver that agent. Here are a few examples of biological weapons that have been used throughout history. Year Bio-Agent Delivery System Used By 1346 Yersinia pests (plague) Corpses of bubonic plague victims Tartar army to attack Crimea 1763 Variola major (smallpox) Blankets from smallpox victims British soldiers to attack Native Americans 1940s Yersinia pests (plague) Plague-infected ticks dropped from airplanes Japan to attack China during World War IIp. 56 1941 Vibrio cholerae (cholera) Contaminated food & water Japan to attack China 2001 Bacillus anthraces (anthrax) Mailed letters Terrorists to attack U.S. politicians and news stations 2013 Ricin Mailed letters Terrorists to attack U.S. President Obama and a U.S. Senator ==Related pages== * Biological warfare * 1925 Geneva Protocol * 2001 anthrax attacks * Terrorism ** Bioterrorism * Weapon of mass destruction == Other websites == * Biological weapon -Citizendium ==References== Category:Biology Category:Terrorism Category:Weapons",
 "title": "Biological weapon"
}