{
 "id": "35434",
 "text": "{{Infobox Writer | name = Harper Lee | image = HarperLee 2007Nov05.jpg | caption = Harper Lee about to receive the Presidential Medal of Freedom at the White House on November 5, 2007. | birth_date = | birth_place = Monroeville, Alabama, U.S. | death_date = | death_place = Monroeville, Alabama, U.S. | occupation = Novelist | nationality = American | subject = Literature | movement = Southern Gothic | signature = Harper Lee signature.svg }} Harper Lee (April 28, 1926 – February 19, 2016) was an American writer. She was born in Monroeville, Alabama. She was most famous for writing To Kill a Mockingbird. That book was published in 1959. Civil rights issues in Alabama influenced her writing. Harper Lee's interests apart from writing were watching politicians and cats, travelling and being alone. Throughout her life, Lee had said that she would never publish another novel. However, in 2015, Lee announced Go Set a Watchman, a sequel to To Kill A Mockingbird. Lee died on February 19, 2016, in a retirement facility in Monroeville, Alabama from complications of a stroke at the age of 89. == Childhood == In 1926, Harper Lee was born in the Monroeville, Alabama. She was the youngest child out of three children. Her father was a law expert and part of the Alabama State lawmaking body. Her mother had trouble with mental illness. The class before first grade, she made a friend named Truman Capote who also later become a fiction writer, short-story writer, and wrote plays. So when they were young, she used to act the scene again that was part of the well known book Rover Boys with her friend Truman. == Education == Harper Lee went to the Monroe County High School in Monroeville. She used to take part in many activities at school, and was part of Glee Club and literary honorary \"society\". She went to the all-female Huntingdon College in Montgomery following her sister who became a law expert. Later, Lee changed the school to the University of Alabama and started to learn about the law. But she wasn’t really interested in the things that she was learning. Though she was really interested in her studies and her writings. Lee wrote amusing, and funny school magazines that came out regularly, Rammer Jammer and became its editor. \"For one year,\" she went to Oxford University as a student who studies outside his or her home country. But still, Lee didn’t like the law. Her father was giving money for her education, but Lee thought that she needed to be self-supporting. So she dropped out of the University and moved to New York to do what she loved. == Career == Her interest in a book inspired Lee to write many long stories. Lee wrote many to write few longer stories, Lee moved to New York to chase after a career as a writer. Hohoff, the editor of To Kill a Mockingbird convinced Lee to write a new novel from the point of view of Scout as a child. Two years later, it became \"To Kill a Mockingbird\". Harper Lee works impressed many companies. She went to many schools and her interest in literature got her to write many novels. Her novels became popular. Harper Lee also worked with Truman Capote as he inspired her to become an author. == Death == Harper Lee had a stroke in 2007 and died in 2016 at the age of 89, just seven months after the release of Go Set a Watchman, the controversial sequel To Kill a Mockingbird. She died peacefully while sleeping. Lee's oldest nephew and family spokesperson, said in a statement on Friday: \"This is a sad day for our family. She has touched people known her as a devoted friend and family member.\" Lee signed her will eight days before her death. Her funeral was on February 20th. It was held at First United Methodist Church in Monroeville. == Awards == 1961 Pulitzer Prize Brotherhood Award of the National Conference of Christians and Jews Alabama Library Association Award 1962 Bestsellers Paperback of the Year Award 1966 Member, National Council on the Arts 1999 Best Novel of the Century, Library Journal 2002 Alabama Humanities Award 2005 ATTY Award, Spector Gadon & Rosen Foundation Los Angeles Public Library Literary Award 2006 Honorary degree, University of Notre Dame 2007 American Academy of Arts and Letters Presidential Medal of Freedom ==References== ==Other websites== Category:1926 births Category:2016 deaths Category:Deaths from stroke Category:American novelists Category:Writers from Alabama Category:To Kill a Mockingbird",
 "title": "Harper Lee"
}