{
 "id": "354652",
 "text": "Arthur Christopher Orme Plummer (December 13, 1929 – February 5, 2021) was a Canadian actor. His career began in 1946. He first acted on Broadway in 1954. His stage roles as Cyrano de Bergerac in Cyrano (1974) and John Barrymore in Barrymore (1997) won him Tony Awards. After being on stage, he acted in his first movie Stage Struck (1958). He had his very first main role that same year in Wind Across the Everglades. He became well known for playing Captain Georg von Trapp in the musical movie The Sound of Music (1965). Plummer played many historical people in movies, including Commodus in The Fall of the Roman Empire (1964), Arthur Wellesley, 1st Duke of Wellington in Waterloo (1970), Rudyard Kipling in The Man Who Would Be King (1975), Mike Wallace in The Insider (1999), Leo Tolstoy in The Last Station (2009), Kaiser Wilhelm II in The Exception (2016), and J. Paul Getty in All the Money in the World (2017). Plummer narrated the animated series Madeline. He voiced Charles Muntz in the Disney Pixar movie Up (2009). His final roles before his death were as Harlan Thrombey in Knives Out (2019), Frank Pitsenbarger in The Last Full Measure (2020) and Howard Lawson in the television drama Departure (2019–2021). Plummer won many awards for his work. He won an Academy Award, two Primetime Emmy Awards, two Tony Awards, a Golden Globe Award, a Screen Actors Guild Award, and a British Academy Film Award. He was one of the few actors and only Canadian to have won the Triple Crown of Acting. He won the Academy Award for Best Supporting Actor for Beginners (2010). At the time, at age 82 he was the oldest person to win an acting Oscar. He was nominated again for an Academy Award for All the Money in the World. This made him the oldest person to be nominated for an acting Oscar at age 88. ==Early life== Plummer was born on December 13, 1929, in Toronto, Ontario. He was the only child of John Orme Plummer and Isabella Mary Abbott. His great-grandfather was Canadian Prime Minister Sir John Abbott. Plummer's parents divorced not long after he was born. He was raised by his mother in the Abbott family home in Senneville, Quebec. He spoke English and French very well. At an early age, he loved acting. He went to High School of Montreal. He wanted to become an actor after watching Laurence Olivier's movie Henry V (1944). In 1946, the Montreal Gazettes theatre critic Herbert Whittaker liked Plummer's role as Mr Darcy in a Montreal High School play of Pride and Prejudice. Whittaker was also a stage director and he hired Plummer at age 18 to play Oedipus in Jean Cocteau's La Machine Infernale. Plummer learned acting as an apprentice with the Montreal Repertory Theatre. Plummer never went to college or university, something he wished he did. Later in life, McGill University gave an honorary degree to Plummer. ==Career== ===Stage=== ====Early roles==== Plummer started professionally acting in 1948 with Ottawa's Stage Society. In 1952, he was in many stage works with the Bermudiana Theatre in Bermuda. While working there, he was hired by an American producer. Edward Everett Horton hired Plummer to play Gerard in the 1953 play of André Roussin's Nina. Plummer had his first Broadway role in January 1953 in The Starcross Story, however the play shutdown on opening night. His next Broadway role, Home is the Hero, lasted from September to October 1954. Plummer was Tyrone Power's understudy. After acting in Night of the Auk, Plummer was in Elia Kazan's Broadway play J.B.. He played Jason in Robinson Jeffers' version of Medea in Paris in 1955. Also in 1955, he played Mark Antony in Julius Caesar. He also played Ferdinand in The Tempest at the American Shakespeare Festival. Plummer began acting at the Stratford Shakespeare Festival in 1956. He played the main character in Henry V. He played the main role in Hamlet and Sir Andrew Aguecheek in Twelfth Night in 1957. The next year, he played Leontes in The Winter's Tale, Bardolph in Henry IV, Part 1, and Benedick in Much Ado About Nothing. In April 1961, he played Benedick in Much Ado About Nothing with the Royal Shakespeare Company at the Shakespeare Memorial Theatre in Stratford-upon-Avon, England. He later played the main character of Richard III a month later. He played King Henry II in Jean Anouilh's Becket. For his role, Plummer won the Evening Standard Award for Best Actor. At the Stratford Festival, he played Philip the Bastard in King John and Mercutio in Romeo and Juliet. In 1962, he played the main roles in both Cyrano de Bergerac and Macbeth. He returned in 1967 to play Mark Antony in Antony and Cleopatra. Plummer played the main role in a 1963 play of Bertolt Brecht's The Resistible Rise of Arturo Ui. He was also in Peter Shaffer's The Royal Hunt of the Sun, playing Francisco Pizarro. Many critics liked Plummer's roles as Ui and Pizarro.Caldwell Titcomb (1965). \"The Royal Hunt of the Sun.\" The Harvard Crimson. November 9, 1965. Retrieved August 12, 2019. ====Royal National Theatre and Broadway roles==== From June 1971 to January 1972, he worked for the Royal National Theatre. He acted in Jean Giraudoux's Amphitryon 38 directed by Laurence Olivier; Georg Büchner's Danton's Death; Adrian Mitchell's Tyger; Luigi Pirandello's The Rules of the Game; and Eugene O'Neill's Long Day's Journey into Night at the New Theatre in London. From May to June 1973, he was on Broadway. He played the main character in Cyrano. It was a musical version of Edmond Rostand's 1897 play Cyrano de Bergerac. Plummer won a Tony Award and a Drama Desk Award for that role. Later that year, he played Anton Chekhov in Neil Simon's The Good Doctor. He played Quentin in Arthur Miller's 1974 version of After the Fall. Plummer was in Lovers and Madmen at the Opera House at the Kennedy Center in Washington, D.C. in 1973. He also appeared in Love and Master Will at the same place in 1975. In 1982, he was in the Broadway play of the Shakespearean tragedy Othello, playing Iago. His role as the main villain had good reviews from critics, such as The New York Times. For his role, he got a Tony Award for Best Actor in a Play nomination losing to Roger Rees. In 1988, he played the main role in Broadway's Macbeth. He also had good reviews for his role as the main character. He also worked with Jason Robards in the 1994 version of Harold Pinter's No Man's Land. For his role in No Man's Land, Plummer was nominated for a Tony Award. One of Plummer's popular stage role was playing John Barrymore in the 1997 Broadway play of William Luce's Barrymore. He had many good reviews from critics. Vincent Canby of The New York Times called Plummer a great actor. His role as Barrymore, Plummer won his second Tony Award and a Drama Desk Award. ====Later stage career==== In 2002, he appeared in King Lear, directed by Jonathan Miller. The play had very good reviews. He was nominated for a Tony Award and a Drama Desk Award for his role in King Lear. He also got a Tony Award nomination for playing Henry Drummond in the 2007 version of Inherit the Wind. He played Julius Caesar in George Bernard Shaw's Caesar and Cleopatra. The play was recorded and shown in Canadian movie theaters on January 31, 2009. In 2009 and 2010, Plummer was in two Stratford Festival plays of Shaw's Caesar and Cleopatra and William Shakespeare's The Tempest. Plummer returned to the Stratford Festival in the summer of 2010 in The Tempest where he played Prospero. In 2014, Plummer was in a stage play A Word or Two in Los Angeles. ===Movies=== Plummer's movie career began in 1958 when Sidney Lumet hired him to play a young writer in Stage Struck. That same year, Plummer played the main character in Nicholas Ray's movie Wind Across the Everglades. Plummer did not appear in any other movie for six years after 1958. He returned to acting to play Roman emperor Commodus in Anthony Mann's The Fall of the Roman Empire (1964). ====The Sound of Music and success==== Plummer became well known for his role as Captain Von Trapp in Robert Wise's musical movie The Sound of Music (1965). Plummer, however, said the movie was \"awful\" because it was very sentimental. The movie made more money than any other movie since Gone with the Wind. Plummer hated being on the movie, but liked working with Julie Andrews. During his career, he tried not to talk about the movie. He did not show up at the 40th Anniversary cast reunion. He did talk about the movie for the 2005 DVD release. He appeared for the 45th anniversary with the full cast on The Oprah Winfrey Show on October 28, 2010. In one interview he said that he had great memories of making the movie. He was in Inside Daisy Clover (1965). Plummer then played World War II agent Eddie Chapman in Triple Cross (1966). He had a role as Field Marshal Erwin Rommel in The Night of the Generals (1967). Plummer was hired to replace Rex Harrison for the movie version of Doctor Dolittle (1967). However, Harrison later came back for the movie. Plummer was paid $87,500 for signing the contract even though he would no longer be in the movie. Plummer had the main role in Oedipus the King (1968) and The High Commissioner (1968). He was later in Battle of Britain (1969) and Lock Up Your Daughters (1969). That same year, he played Inca Emperor Atahualpa in The Royal Hunt of the Sun. Plummer played the Duke of Wellington in Waterloo (1970) with Rod Steiger as Napoleon Bonaparte. He played Rudyard Kipling in The Man Who Would Be King (1975). He was also in the comedy The Return of the Pink Panther (1975), with Peter Sellers and The Silent Partner (1978). He was in Aces High (1976), Starcrash (1978), and International Velvet (1978). He played Sherlock Holmes in Murder by Decree (1979). Plummer was in the romantic drama Somewhere in Time (1980), the drama Eyewitness (1981), and the comedy Dragnet (1987). Plummer also did some voice work. He voiced Henri the pigeon in An American Tail (1986) and the Grand Duke of Owls in Rock-a-Doodle (1991). In 1987, Plummer did the english narration for Frédéric Back’s animated movie The Man Who Planted Trees, which won the Academy Award for Best Animated Short Film in 1988. Plummer was in Star Trek VI: The Undiscovered Country (1991). He was also in Spike Lee's drama biographical movie Malcolm X (1992), Mike Nichols' horror drama Wolf (1994), Taylor Hackford's psychological drama Dolores Claiborne (1995), and Terry Gilliam's science fiction drama 12 Monkeys (1995). One of Plummer's most well known roles was as journalist Mike Wallace in Michael Mann's The Insider (1999). Plummer later played Dr. Rosen in Ron Howard's Academy Award-winning movie A Beautiful Mind (2001). He played Uncle Ralph in the 2002 movie version of Charles Dickens novel Nicholas Nickleby. He also played the philosopher Aristotle in Alexander (2004). Plummer was wanted for the role of Gandalf for The Lord of the Rings movie series. He did not want the role. In 2004, Plummer played John Adams Gates in the Disney adventure movie National Treasure. In 2005, he appeared in Stephen Gaghan's drama Syriana, the romantic comedy Must Love Dogs, and Terrence Malick's drama The New World. Plummer did not like working with Malick on The New World. He called Malick \"boring\" and told him to get a writer instead of Malick doing everything. He played Arthur Case in another Spike Lee's movie called Inside Man (2006). That same year, he was in the romantic drama The Lake House (2006). In 2009, Plummer voiced the main villain Charles Muntz in Pixar's animated movie Up. Muntz character design was inspired by Plummer. That same year he also had a voice role in 9 playing 1. ====Beginners and final years==== In January 2010, Plummer got his first Academy Award nomination for his role as author Leo Tolstoy in The Last Station (2009). In an interview about his Academy Award nomination, Plummer said: \"Well, I said it's about time! I mean, I'm 80 years old, for God's sake. Have mercy\". He lost the Academy Award to Christoph Waltz. Plummer had a role in David Fincher's The Girl with the Dragon Tattoo, playing businessman Henrik Vanger. Plummer got his second nomination for the Academy Award for Best Supporting Actor for his role as Hal in Mike Mills' independent comedy drama movie Beginners (2011). In the role, Plummer played a dying 80-year old who recently came out as gay to his son. He won the Academy Award for his role in Beginners at age 82. At the time, this made Plummer the oldest actor to win an Academy Award. In 2021, Anthony Hopkins won an Academy Award at age 83, beating Plummer's record. His Academy Award also made Plummer one of the few actors and only Canadian to win the Triple Crown of Acting. In 2014, he appeared with Shirley MacLaine in the comedy-drama Elsa & Fred. In 2015, he was in Remember as a Holocaust survivor with dementia. Plummer played Ebenezer Scrooge in The Man Who Invented Christmas (2017). In November 2017, Plummer was hired to replace Kevin Spacey as J. Paul Getty in All the Money in the World. He was director Ridley Scott's first choice for the role, but TriStar Pictures wanted a more well known actor for the role. Plummer was hired because Spacey had been accused of sexual harassment and sexual assault. All scenes that had Spacey were filmed again with Plummer. This happened a few weeks before the movie's release. For his role, Plummer earned Golden Globe, BAFTA, and Academy Award nominations for Best Supporting Actor. Plummer, at age 88, became the oldest actor to be nominated for an Academy Award. Plummer had a role in Rian Johnson's mystery thriller movie Knives Out (2019) as rich mystery writer Harlan Thrombey. Plummer also played Frank Pitsenbarger in the war drama The Last Full Measure (2020), in his final movie role. In 2021 before his death, Plummer was hired to play the main character for a movie version of Shakespeare's King Lear. ===Television=== Plummer had his first television role in 1953 for the Canadian Broadcasting Corporation version of Othello. He was also in a 1953 Studio One episode \"The Gathering Night\". In the 1950s, he appeared in The Alcoa Hour, General Electric Theater, Kraft Television Theatre, and Omnibus. In 1956, he was in an episode of CBS's Appointment with Adventure. He was in the live television drama Little Moon of Alban. He got his first Emmy Award nomination for this role. He played Torvald Helmer in a 1959 television movie version of Henrik Ibsen's A Doll's House. Plummer had a role in the television version of Philip Barry's The Philadelphia Story (1959). In 1964, his role as Hamlet in the BBC's Hamlet at Elsinore got him his second Emmy nomination. He played Herod Antipas in the television miniseries Jesus of Nazareth (1977). Plummer played Herbert Kappler in the television movie The Scarlet and the Black. He had a role in the television series The Thorn Birds. From 1993 to 1995, he narrated the animated television series Madeline and won an Emmy Award for his voice work. He also narrated the animated television series The World of David the Gnome. In 2000, Plummer played Sir David Maxwell Fyfe in the Emmy Award-winning show Nuremberg (2000). That same year, he was in American Tragedy as F. Lee Bailey. He was in Miracle Planet, and a documentary by Ric Burns about Eugene O'Neill. He got an Emmy Award nomination for his role in the television movie version of the play On Golden Pond. Plummer voiced Arngeir, speaker for the Greybeards, in the video game The Elder Scrolls V: Skyrim. At the age of 89, he appeared in a main role in Departure. It was a Canadian-British television series. Plummer returned for season 2, but worked from home because of the COVID-19 pandemic. He finished filming for the second season before his death. ==Personal life and death== Plummer married Tammy Grimes in 1956. Their marriage lasted four years. They had a daughter together, actress Amanda Plummer. Plummer was married to journalist Patricia Lewis from 1962, until their divorce in 1967. He later married actress Elaine Taylor in 1970. They lived together in Weston, Connecticut. He used to live in Darien, Connecticut before moving to Weston. Plummer had no children by his second or third marriages. In 1968, Plummer was honored as a Companion of the Order of Canada. His memoir, In Spite of Myself, was published in November 2008. Plummer supported the Theatre Museum Canada and donated money to keep the museum open. Plummer died at his home in Weston, Connecticut on February 5, 2021 at the age of 91. He died two and a half weeks after a fall where he hit his head. Plummer's wife Elaine said that he had died \"peacefully\" when she was at his side. Prime Minister of Canada Justin Trudeau said that there is \"no doubt [that] his work will continue to inspire and entertain us all for years to come\". He called Plummer an \"iconic actor\". The Sound of Music actress Julie Andrews said that \"The world has lost a [great] actor today and I have lost a [good] friend\". Ana de Armas, Jamie Lee Curtis, Katherine Langford, Rian Johnson, Chris Evans, Don Johnson, William Shatner, Anne Hathaway, Elijah Wood, Vera Farmiga, Ed Asner, Ridley Scott, Spike Lee, Simon Pegg, Kate Beckinsale, Antonio Banderas, Leonard Maltin, Daniel Dae Kim, George Takei, Russell Crowe, Bruce Greenwood and Joseph Gordon-Levitt also reacted to his death. A postage stamp honoring Plummer was released by Canada Post on October 13, 2021. ==Awards== Year Award Title Results 2010 Academy Awards The Last Station 2012 Academy Awards Beginners 2018 Academy Awards All the Money in the World 1959 Tony Awards J.B. 1974 Tony Awards Cyrano 1982 Tony Awards Othello 1994 Tony Awards No Man's Land 1997 Tony Awards Barrymore 2004 Tony Awards King Lear 2007 Tony Awards Inherit the Wind 1959 Primetime Emmy Awards Little Moon of Alban 1966 Primetime Emmy Awards Hamlet at Elsinore 1977 Primetime Emmy Awards Arthur Hailey's the Moneychangers 1983 Primetime Emmy Awards The Thorn Birds 1994 Primetime Emmy Awards Madeline 2004 Primetime Emmy Awards Our Fathers 2011 Primetime Emmy Awards Moguls & Movie Stars: A History of Hollywood 1986 Grammy Award E.T.A. Hoffmann/Tchaikovsky: The Nutcracker ==Honors== Ribbon Description Year Notes Companion of the Order of Canada (C.C.) 1970 For his works to the performing arts at home and abroad Queen Elizabeth II Silver Jubilee Medal for Canada 1977 This medal has been awarded to all people being awarded with a Companionship within the Order of Canada 125th Anniversary of the Confederation of Canada Medal 1993 This medal has been awarded to all people being awarded with a Companionship within the Order of Canada Queen Elizabeth II Golden Jubilee Medal for Canada 2002 This medal has been awarded to all people being awarded with a Companionship within the Order of Canada Queen Elizabeth II Diamond Jubilee Medal for Canada 2012 This medal has been awarded to all people being awarded with a Companionship within the Order of Canada ==Bibliography== * ==References== ==Other websites== * * * * * Christopher Plummer at the Canadian Film Encyclopedia * Christopher Plummer website Category:1929 births Category:2021 deaths Category:Academy Award winning actors Category:Satellite Award winners Category:Actors from Toronto Category:BAFTA Award winning actors Category:Canadian movie actors Category:Canadian stage actors Category:Canadian radio actors Category:Canadian television actors Category:Canadian voice actors Category:Drama Desk Award winners Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Tony Award winning actors Category:Accidental deaths from falls in the United States Category:Deaths from head injury",
 "title": "Christopher Plummer"
}