{
 "id": "355073",
 "text": "Bolitoglossa is a genus of salamanders. They are also called tropical climbing salamanders and web-footed salamanders. They are part of the Plethodontidae family. They live in Central America and South America. They are terrestrial amphibians. ==Species== 117 species are currently assigned to this genus. {|style=\"text-align:left; border:1px solid #999999; \" Binomial Name and Author Common Name B. adspersa Peters, 1863 Peter's Climbing Salamander B. alberchi García-París, Parra-Olea, Brame & Wake, 2002 Alberch's Salamander B. altamazonica Cope, 1874 Nauta Salamander B. alvaradoi Taylor, 1954 Alvarado's Salamander B. anthracina Brame, Savage, Wake & Hanken, 2001 Coal-black Salamander B. biseriata Tanner, 1962 Two-lined Climbing Salamander B. borburata Trapido, 1942 Carabobo Climbing Salamander B. bramei Wake, Savage & Hanken, 2007 Brame's Climbing Salamander B. capitana Brame & Wake, 1963 Orphan Salamander B. carri McCranie & Wilson, 1993 Cloud Forest Salamander B. cataguana Townsend, Butler, Wilson & Austin, 2009 B. celaque McCranie & Wilson, 1993 Celaque Climbing Salamander B. centenorum Campbell et al., 2010 B. cerroensis Taylor, 1952 Millville Climbing Salamander B. chica Brame & Wake, 1963 Hotel Zaracay Salamander B. colonnea Dunn, 1924 La Loma Salamander B. compacta Wake, Brame & Duellman, 1973 Cerro Pando Salamander B. conanti McCranie & Wilson, 1993 Conant's Salamander B. copia Wake, Hanken & Ibáñez, 2005 El Cope Giant Salamander B. cuchumatana Stuart, 1943 Oak Forest Salamander B. cuna Wake, Brame, & Duellman, 1973 Camp Sasardi Salamander B. daryorum Campbell et al., 2010 B. decora McCranie & Wilson, 1997 Monte Escondido Salamander B. diaphora McCranie & Wilson, 1995 El Cusuco Salamander B. digitigrada Wake, Brame & Thomas, 1982 Rio Santa Rosa Salamander B. diminuta Robinson, 1976 Quebrada Valverde Salamander B. dofleini Werner, 1903 Doflein's Salamander B. dunni Schmidt, 1933 Dunn's Climbing Salamander B. engelhardti Schmidt, 1936 Engelhardt's Climbing Salamander B. epimela Wake & Brame, 1963 Tapanti Climbing Salamander B. equatoriana Brame & Wake, 1972 Ecuadorian Climbing Salamander B. eremia Campbell et al., 2010 B. flavimembris Schmidt, 1936 Yellow-legged Climbing Salamander B. flaviventris Schmidt, 1936 Yellow-belly Climbing Salamander B. franklini Schmidt, 1936 Franklin's Climbing Salamander B. gomezi Wake, Savage & Hanken, 2007 Gómez's Web-footed Salamander B. gracilis Bolaños, Robinson & Wake, 1987 Rio Quiri Salamander B. guaramacalensis Schargel, García-Pérez & Smith, 2002 Guaramacal Salamander B. hartwegi Wake & Brame, 1969 Hartweg's Climbing Salamander B. heiroreias Greenbaum, 2004 Holy-Mountain Salamander B. helmrichi Schmidt, 1836 Coban Climbing Salamander B. hermosa Papenfuss, Wake & Adler, 1984 Guerreran Climbing Salamander B. hiemalis Lynch, 2001 Winter Climbing Salamander B. huehuetenanguensis Campbell et al., 2010 B. hypacra Brame & Wake, 1962 Paramo Frontino Salamander B. indio Wake, et al., 2008 B. insularis Wake, et al., 2008 B. jacksoni Elias, 1984 Jackson's Climbing Salamander B. kaqchikelorum Campbell et al., 2010 B. la Campbell et al., 2010 B. lignicolor Peters, 1873 Camron Climbing Salamander B. lincolni Stuart, 1943 Lincoln's Climbing Salamander B. longissima McCranie & Cruz, 1996 Longest Climbing Salamander B. lozanoi Acosta-Galvis & Restrepo, 2001 Lozano's Salamander B. macrinii Lafrentz, 1930 Oaxacan Climbing Salamander B. magnifica Hanken, Wake & Savage, 2005 Magnificent Web-footed Salamander B. marmorea Tanner & Brame, 1961 Crater Salamander B. medemi Brame & Wake, 1972 Finca Chibigui Salamander == Other websites == * . 2008. Amphibian Species of the World: an Online Reference. Version 5.2 (15 July, 2008). Bolitoglossa. Electronic Database accessible at http://research.amnh.org/herpetology/amphibia/index.php. American Museum of Natural History, New York, USA. (Accessed: July 29, 2008). * [web application]. 2008. Berkeley, California: Bolitoglossa. AmphibiaWeb, available at http://amphibiaweb.org/. (Accessed: July 29, 2008). * Tree of Life: Bolitoglossa Category:Salamanders",
 "title": "Bolitoglossa"
}