{
 "id": "355322",
 "text": "Frontiers of the Roman Empire is a World Heritage Site. The site includes three walls in different parts of Europe. They were part of the frontiers of the Roman Empire. *Hadrian's Wall *Antonine Wall *Limes Germanicus == Limes == Limes (plural: 'Limites') is the Latin name of walls at the border of the Roman empire. There were many such fortifications.Livius.org, Limes ; retrieved 2012-4-25. The Latin word has a number of meanings, but the most common one is border.Ellenblum, Roni. (2006). Crusader castles and modern histories, p. 122; excerpt, \"...it is the modern traveller and scholar who attributes to the limes all the meanings of a boundary line. The Roman sources themselves are mute concerning the existence of border lines, and it was modern scholarship which assumed that the Romans were capable of realizing in practice what they could not define verbally.\" The term limes was used by Roman writers to describe paths, walls, boundary stones, rivers marking a boundary, but its meaning was not the same as the modern boundary. Some notable examples of Roman limites are: * Limes Arabicus the frontier of the Roman province of Arabia Petraea facing the desertLivius.org, Mobene (Qasr Bshir); retrieved 2012-4-25. * Limites Britannicus Hadrian's Wall; Antonine WallUNESCO, \"Frontiers of the Roman Empire\"; retrieved 2012-4-25. * Limes Germanicus Upper Germanic & Rhaetian Limes * Limes Saxoniae a medieval limes in Holstein * Limes Tripolitanus the frontier in modern Libya facing the SaharaLivius.org, Limes Tripolitanus ; retrieved 2012-4-25. ==Gallery== Image:Limes01.jpg|Reconstructed Limes Image:Ostkastell Welzheim.jpg|A fortification on the Limes Image:Holzwachturm am rätischen Limes (Rekonstruktion) - Wp12 77.jpg|Reconstructed wooden watchtower Image:Limes in Britain, 122.gif|Hadrian's Wall ==References == ==Other websites== * * * Verein Deutsche Limes-Straße * Römische Militärbauten und -anlagen * Frontiers of the Roman Empire : UNESCO Official Website Category:World Heritage Sites in Europe Category:Walls Category:Roman buildings and structures",
 "title": "Frontiers of the Roman Empire"
}