{
 "id": "355323",
 "text": "Christopher Francis Ocean (born Christopher Edwin Breaux; October 28, 1987) known professionally as Frank Ocean, is an American singer, songwriter, and rapper. He was born in Long Beach, California and moved to New Orleans, Louisiana when he was five. Ocean made an early career as a ghostwriter for artists such as, Brandy, Justin Bieber, Beyonce, and John Legend. In 2010, he became a member of Odd Future. His first mixtape, Nostalgia, Ultra, was released in 2011. In 2012, BBC said that Ocean finished second place in its Sound of 2012 poll. Ocean appeared at Coachella. He was scheduled for Lollapalooza at the end of his 2012 summer tour.Frank Ocean’s Summer Tour Sold Out BET. July 11, 2012. His first studio album, channel ORANGE, was a digital download only on iTunes for one week. Then it was a full release on July 17, 2012. It was nominated for six Grammy Awards. Ocean won the 2013 Brit Award for International Male Solo Artist. In August 2016, Ocean released his second studio album, Blonde. == Personal life == Ocean was one of the first major hip-hop/R&B; artists to say that he had a same-sex relationship.Frank Ocean effect: What happens when a hip hop artist confesses same sex love? CNN. July 11, 2012. == Discography == === Albums === * Channel Orange (2012) * Endless (2016) * Blonde (2016) ===Awards and nominations=== Year Organization Award Result 2012 BBC Sound of 2012 Second 2012 Grammy Award International Album of the Year Nominated ==Notes== ==References== Category:1987 births Category:Living people Category:African-American singers Category:American R&B; singers Category:Brit Award winners Category:LGBT African-Americans Category:LGBT people from California Category:LGBT people from Louisiana Category:LGBT singers Category:LGBT songwriters Category:Singers from New Orleans Category:Musicians from New Orleans Category:Musicians from Long Beach, California Category:Singers from Long Beach, California Category:American bloggers",
 "title": "Frank Ocean"
}