{
 "id": "355532",
 "text": "Henry Franklin Winkler OBE (born October 30, 1945) is an American movie, television, stage, voice actor, director, producer, and writer. Winkler won two Golden Globe Awards, in 1976 and in 1977, for his role as Fonzie or The Fonz in Happy Days. Winkler is Jewish and has dyslexia. ==Biography== ===Early life=== Winkler was born on October 30, 1945 in New York City, New York.Henry Winkler Biography (1945-) His parents were Ilse Anna Maria (née Hadra), and Harry Irving Winkler, a lumber company executive. Winkler's Jewish parents emigrated from Germany to the United States in 1939, before the beginning of World War II.www.emmytvlegends.org Winkler attended the McBurney School. He received his bachelor's degree from Emerson College in 1967. He earned his Master of Fine Arts degree from the Yale School of Drama in 1970. In 1978 Emerson College and Austin College gave Winkler an honorary doctorate of humane letters. ==Career== ===Happy Days=== Winkler is best known for his role as Fonzie (also called The Fonz) on the 1970 American sitcom Happy Days. Fonzie was a leather-clad greaser and an auto mechanic. The character started as a minor character, but became more important before the show's end. ===Obama election=== In October 2008, Winkler appeared in a video with Ron Howard, again playing their roles of Fonzie and Richie Cunningham, trying to make people vote for Barack Obama. The video was called \"Ron Howard's Call to Action\". It also featured the late Andy Griffith. ===Since 2010=== As of June 2010, Winkler has appeared on the USA show Royal Pains. On June 19, 2010, Winkler appeared on ITV World Cup Live show. Winkler represented the United States in the World Cup Wall Chart. As of the summer/fall 2010 season, Winkler has joined the cast in the Adult Swim web series Children's Hospital playing a hospital administrator. In late September 2010, Winkler voiced Professor Nathaniel Zib in the Lego Factory mini-series Rise of the Rookies. On May 31, 2011, Winkler's book, I've Never Met an Idiot on the River. It shows Winkler's love of flying and fishing. In 2011, Winkler guest-starred as Ambush Bug in the series finale of Batman: The Brave and the Bold. In the 2013 Broadway season, Winkler, Cheyenne Jackson, Alicia Silverstone, and Ari Graynor are set to star in the David West Read play The Performers opening Nov 14, 2012 at The Longacre Theatre. Winkler appeared in the movie Here Comes the Boom (released October 12, 2012), as the music teacher at Wilkinson High School. ===Honors=== In September 2011, Winkler was made an honorary Officer of the Order of the British Empire (OBE) \"for services to children with special educational needs and dyslexia in the UK.\" ==Personal life== Winkler has been married to Stacey Weitzman since May 5, 1978. They have two children; Zoe Emily (b. 1980) and Max Daniel (b. 1983). Winkler also has a stepson from Weitzman's last marriage to Howard Weitzman. ==Some of the movies he was in== * Crazy Joe (1974) * The Lords of Flatbush (1974) * The Bob Newhart Show (TV Series) (Season 2/Episode 19 \"Clink Shrink\") (1974) * Happy Days (TV series) (1974–1982) * Katherine, also known as The Radical (1975) * Heroes (1977) * The One and Only (1978) * An American Christmas Carol (TV movie) (1979) * Night Shift (1982) * Memories of Me (directing) (1988) * MacGyver (1991) * Cop and a Half (directing) (1993) * Scream (1996) (Principal Himbry) (uncredited) * Detention: The Siege at Johnson High (1997) * Dad's Week Off (1997) * Dead Man's Gun (TV series) (1997-1999, exec. prod.) * Ground Control (1998) * The Waterboy, as Coach Kline (1998) * P.U.N.K.S. (1999) * Dill Scallion (1999) * Little Nicky (2000) * Down to You (2000) * Law and Order SVU (2002) * Holes (2003) * Arrested Development (TV series) (2003–2006) * King of the Hill (2004) * Berkeley (2005) * Malcolm in the Middle (2005) * The Kid & I (2005) * Out of practice (TV series) (2005–2006) * Duck Dodgers (2006) * Unbeatable Harold (2006) * Click (2006) * I Could Never Be Your Woman (2007) * A Plumm Summer (2007) * NUMB3RS (2008–2009) * You Don't Mess with the Zohan (2008) * Merry Christmas, Drake & Josh (2008) * The Most Wonderful Time of the Year (2008) * Sit Down, Shut Up (2009) (TV series) * Group Sex (2010) * Royal Pains (TV, 2010–2012) * Kick Buttowski: Suburban Daredevil (2010-2012) * Childrens Hospital (TV, 2010) * LEGO Hero Factory (TV, 2010-2011) * Running Mates (2011) (Plays Bob Weatherbee) * Batman: The Brave and the Bold (TV, 2011) * The Penguins of Madagascar (2011) * Here Comes the Boom (2012) * Scoob! (2020) ==References== ==Other websites== * * Category:1945 births Category:Living people Category:Actors from Manhattan Category:American children's writers Category:American movie actors Category:American stage actors Category:American television actors Category:American television directors Category:American television producers Category:American voice actors Category:Comedians from New York City Category:Jewish American actors Category:Jewish American comedians Category:Jewish American writers Category:Jewish businesspeople Category:Golden Globe Award winning actors Category:Movie directors from New York City Category:Movie producers from New York City Category:Television personalities from New York City Category:Writers from Manhattan Category:Yale University alumni Category:People with dyslexia",
 "title": "Henry Winkler"
}