{
 "id": "355666",
 "text": "Ed, Edd n Eddy is an animated television series created by Danny Antonucci for Cartoon Network. It was produced by the studio a.k.a. Cartoon. The show is about three boys called \"the Eds\" who live in a cul-de-sac. They also create scams (tricks) in their neighborhood. These tricks could be items that the other kids might want to buy. They do this so the other kids will give them money to buy jawbreakers. Most of the times, their plans end in a bad way. Before Cartoon Network started writing the show, Antonucci tried to sell it to Nickelodeon. However, the channel wanted to control what he does with the show. Antonucci did not agree to that and went with the former. Four specials, and two books were made. The characters of the show were also in many comic books and video games. The series ended with the TV movie Ed, Edd n Eddy's Big Picture Show on November 8, 2009. The show got mostly good reviews and many awards and nominations. Kids and adults from 31 million households in 30 different countries watched the show. The show became Cartoon Network's longest-airing original show until it was surpassed by The Amazing World of Gumball on March 2022. ==Characters== *Edward \"Ed-Single-D\" Horace *Eddward \"Edd-Double-D\" Marion - A boy with an orange t-shirt, purple cargo pants, red socks and black shoes. His outfit completes with a cap. *Edward Skipper - The leader of the Eds *Jonny 2x4 *Plank *Kevin *Nazz Van Fartanschmeer *Sarah - Ed's younger sister *Jimmy *Rolf *Lee Kanker - The oldest and leader of the Kanker Sisters *Marie Kanker *May Kanker == International Versions == === Danish Dubbing år: ukendt === * Ed – Peter Secher Schmidt * Edd (Dobbel-D) – Vibeke Dueholm * Eddy – Søren Ulrichs * Flemming – Mille Hoffmeyer Lehfeldt * Johnny – Mathias Klenske * Karsten – Mikkel Christiansen * Søs – Mille Hoffmeyer Lehfeldt * Regner – Mathias Klenske * Sarah – Annevig Schelde Ebbe * Maja Klank – Annevig Schelde Ebbe * Marie Klank – Mille Hoffmeyer Lehfeldt * Lis Klank – Vibeke Dueholm ==Other websites== * * Category:Cartoon Network series Category:1999 American television series debuts Category:1999 Canadian television series debuts Category:2000s Canadian television series endings Category:American children's television series Category:Canadian children's television series Category:English-language television programs Category:Ed, Edd n Eddy",
 "title": "Ed, Edd n Eddy"
}