{
 "id": "355648",
 "text": "Bufonidae is a family of true toads. The family has 35 genus groups in it. The Bufonidae toads live almost everywhere, on every continent except Australia and Antarctica. They live in rain forest. They lay their eggs in strings. Mostly, the eggs and become tadpoles. However, in the genus Nectophrynoides, the eggs hatch into small frogs instead. True toads do not have any teeth. Their skin has bumps called warts. They have a pair of parotoid glands on the backs of their heads. These glands has alkaloid poison. They get this type of poison from stress. They have also other toxins such as Bufotoxin. Male toads has a Bidder's organ. The organ will become an active ovary if conditions are right. They will then become a female. ==Taxonomy== Bufonidae has about 500 species in its 37 genuses. Genus Latin Name and Author Common Name Species Adenomus Altiphrynoides Ethiopian Toads Amietophrynus Andinophryne Andes Toads Ansonia Stream Toads Atelopus Stubfoot Toads Bufo Toads Bufoides Mawblang Toads Capensibufo Cape Toads Churamiti Crepidophryne Cerro Utyum Toads Dendrophryniscus Tree Toads Didynamipus Four-digit Toads Duttaphrynus Epidalea Natterjack Toads Frostius Frost's Toads Ingerophrynus Laurentophryne Parkers Tree Toads Leptophryne Indonesia Tree Toads Melanophryniscus South American Redbelly Toads Mertensophryne Snouted Frogs Metaphryniscus Nectophryne African Tree Toads Nectophrynoides African Live-bearing Toads Nimbaphrynoides Nimba Toads Oreophrynella Bush Toads Osornophryne Plump Toads Parapelophryne Pedostibes Asian Tree Toads Pelophryne Flathead Toads Pseudepidalea Pseudobufo False Toads Rhinella Beaked Toads Schismaderma African Split-skin Toads Truebella Werneria Smalltongue Toads Wolterstorffina Wolterstorff Toads ==References== == Books == * * Stebbins, Robert. Western Reptiles & Amphibians (3rd ed.). Houghton Mifflin Co., 2003. * Halliday, Tim R., and Kraig Adler (editors). The New Encyclopedia of Reptiles & Amphibians. Facts on File, New York, 2002. ==Other websites== *Amphibian and Reptiles of Peninsular Malaysia - Family Bufonidae *FED.us *Bufonidae recordings from the British Library Sound Archive *Tolweb.org *Bufonidae.com Category:Toads",
 "title": "Bufonidae"
}