{
 "id": "355744",
 "text": "The Government of the United Kingdom, formally referred to as His Majesty's Government, is the central government of the United Kingdom of Great Britain and Northern Ireland. It is also commonly referred to as simply the British Government or the UK Government.Her Majesty's Government Parliament of the United Kingdom, 28 June 2010Overview of the UK system of government : Directgov – Government, citizens and rights . Direct.gov.uk. Retrieved on 2010-10-19. ==Leader== The Government is led by the Prime Minister, who chooses the other Ministers. The Prime Minister and the other most powerful Ministers belong to a group known as the Cabinet, who are the most important decision makers in the Government. These ministers are all members of Parliament (MPs). Laws are made by MPs voting in Parliament, which is called 'legislative authority'. These laws make what is called primary legislation. The Prime Minister now is Keir Starmer, the present leader of the Labour Party. Rishi Sunak, the former Prime Minister, succeeded Liz Truss as the Conservative Party leader. In the 2024 United Kingdom general election, the Labour Party won with a landslide majority. The Conservative Party lost 244 seats, giving them their lowest number of seats (121) in the party's history. ==Election== The government is chosen by the people indirectly. The people of the United Kingdom vote in a general election, appointing representatives to the Parliament, at least once every five years.General elections – UK Parliament. Parliament.uk (2010-05-06). Retrieved on 2010-10-19. The monarch must select as Prime Minister the person who is likely to have the support of Parliament. By convention, that is normally the leader of the party that has the most MPs in the House of Commons.House of Commons – Justice Committee – Written Evidence. Publications.parliament.uk. Retrieved on 2010-10-19. The Prime Minister leads the government and exercises executive power on behalf of the monarch, in accordance with the laws set by Parliament, including appointing Ministers to the executive branches of government. Under the British constitution, laws are made or unmade by Parliament. The policy and administration of the laws is done by the direction of the Prime Minister and the Cabinet. This is called executive authority.The monarchy : Directgov – Government, citizens and rights . Direct.gov.uk. Retrieved on 2010-10-19. The monarch is obliged to follow the advice of the government and has not refused to do so since the 17th century. The Cabinet members advise the monarch as part of a group called Privy Council. They also use their power directly as leaders of the Government departments. The British kind of government is sometimes called parliamentary government.Jones, Clyve 2012. A short history of Parliament: England, Great Britain, the United Kingdom, Ireland and Scotland, p. 1; excerpt, \"It is a commonly held misconception that the Westminster parliament is the 'mother of all parliaments' ... but the original phrase in 1865 was 'England is the mother or all parliaments'\". ==Local governments== There are separate governments in Wales, Scotland and Northern Ireland, each responsible to their own local parliament. These parliaments have certain limits decided by the main parliament in Westminster.However, there is no separate English Parliament. == References ==",
 "title": "Government of the United Kingdom"
}