{
 "id": "355705",
 "text": "Daphne Zuniga (born October 28, 1962) is an American actress. She is best known for playing Jo Reynolds in the television series Melrose Place and as Victoria Davis on The CW teen drama One Tree Hill. Zuniga supports Equality Now. Equality Now works to make legal changes in countries to better lives of females. Also, she is working to restore the river in Los Angeles. She is a member of the board of directors for a group working to restore the river area. ==Filmography== Year Title Role Notes 1982 Debbie 1983 Quarterback Princess Kim Maida Television film 1984 The Initiation Kelly Fairchild/Terry Fairchild 1985 Vision Quest Margie Epstein Alison Bradbury Stone Pillow Carrie Lang Television film 1986 Modern Girls Margo 1987 Spaceballs Princess Vespa 1988 Last Rites Angela 1989 Beth Logan Staying Together Beverly Young Gross Anatomy Laurie Rorbach 1992 Mad at the Moon Young Mrs. Miller Prey of the Chameleon Patricia / Elizabeth Burrows 1993 Eight Hundred Leagues Down the Amazon Minha 1994 Charlie's Ghost Story Ronda Cityscrapes: Los Angeles Chantal 1995 Degree of Guilt Teresa 'Terri' Peralta Television film 1996 Pandora's Clock Dr. Roni Sanders Television film 1997 Loss of Faith Claire Hainey Television film Naked in the Cold Sun Rini Stand-ins Shirley 2000 Artificial Lies Karen Wettering Enemies of Laughter Judy 2003 Ghost Dog: A Detective Tail Amanda Morton Television film 2005 Secret Lives Jill Thompson 2006 A-List Tina Deborah Matthews Television film Christmas Do-Over Jill Television film 2008 Mail Order Bride Diana McQueen 2010 Seducing Charlie Barker Stella Claudia Television film On Strike for Christmas Joy Robertson Television film 2012 Changing Hearts Christina Riley 2013 Gone Missing Rene A Remarkable Life Tracy Signed, Sealed, Delivered Andrea Shmeckle Television film 2014 Monkey in the Middle Olive 2015 Summer Forever Sophie Occupy Alice Cindy Lowe Short 2016 Who's Driving Doug Alison Beyond Paradise Elana Search Engines Kate Those Left Behind Shelly When Duty Calls Carol Lawton My Husband is Missing Ann Bradshaw Television film 2017 The Wrong Babysitter Susan Television film Heartbeats Michelle Andrews 2018 Witness Unprotected Sam 2018 A Christmas Arrangement Blair Covington 2018 Abigail Falls Anne 2019 Gates Of Paradise Nurse Broadfield ==References== ==Other websites== *Official Daphne Zuniga website * Category:American television actors Category:American movie actors Category:Actors from Berkeley, California Category:1962 births Category:Living people",
 "title": "Daphne Zuniga"
}