{
 "id": "35588",
 "text": "The flag of Germany (German: Bundesflagge) was adopted in its present form in 1919. It was readopted with the new constitution of 1949. It has three colours and is made of three equal horizontal bands coloured black (top), red, and gold (bottom). The Dienstflagge or service flag is the version of the flag for government use. It has the national coat of arms in the centre. Ships of the German Navy use this flag with a triangle cut out of the end as an ensign.Basic Law for the Federal Republic of Germany (23 May 1949). German version and English version (December 2000) (PDF). See Article 22. Retrieved on 24 February 2008. Some states use the national flag with the state coat of arms as a state flag, the black stands for determination, red for bravery and yellow for valour. == History == The modern Black-Red-Gold tricolour of German was first seen in the 1840s used ‘officially’ for the first time by the short lived German Empire between 1848 and 1849, It was readopted by the Weimar Republic in 1919 and then again in 1949 after the collapse of the Nazi Regime and the Occupation of Germany ended. It was used as is in the Federal German Republic, aka West Germany, and in East Germany a laurel of Wheat with a hammer and compass inside was placed over the tricolour. After reunion of Germany in 1990 the blank tricolour was used only and the eastern design was abandoned. Other types of German flags are flown in modern Germany by political groups, some far rightist and Neo-Fascists of Germany sometimes wave the Imperial German flag as the Swastika is banned. Although there is a small portion of people who fly it for a monarchist cause as well. Occasionally leftist Germans political groups fly the old Eastern German flag as well. == North German Confederation and German Empire == The German Empire and North German Confederation used a flag that was a tricolour of black white and red, dubbed the Reichsflagge. First designed in 1867 the flag was based partially on the earlier flag of Prussia ==Nazi Germany== Under the Nazi government between 1933 and 1935 Germany used the Black, white and red Tricolour, resurrected from the flag of the German Empire. In 1935 Germany adopted a different flag with a swastika on it, used between 1935 and 45. The red represented the ideals of the Nazi Movement while the white symbolised national ideals and thought. Based on the NDSAP party badge which contained a red circle with German text with a swastika in the middle. It is not legal to put up this flag in Germany now. There was an early prototype idea of the German flag which contained a cog around the white circle representing trade unions and the German people. The idea was never made official, just used as a symbol of the German Labour Front == Occupied Germany == After the fall of the Nazis Germany was divided in four occupation zones, none having a flag, the commonly used merchant flag of Germany was used as a semi official flag being so recognisable. Dubbed the ‘C-Pennant’ It is a 5 striped flag, Blue stripes at the top and bottom, red in the middle and white between. == East and West Germany == After the unification for the British, French, and American occupation zones of Germany into the Federal German Republic they adapted the former Weimar flag for their republic, The east used a modified version with communist and socialist symbolisms included. ==References== Germany Category:Flags of Germany Category:Tricolour flags",
 "title": "Flag of Germany"
}