{
 "id": "35596",
 "text": "Fermo () is a comune and city in the Marche region, in central Italy. Fermo is the capital of the province of Fermo. Fermo is on a hill only a few miles from the coast of the Adriatic Sea. It is region with a high population density near seaports like Porto San Giorgio and Porto Sant'Elpidio. ==Geography== Fermo is on a hill, the Sabulo, high, at about from the Adriatic Sea. It has an area of and its altitude is . The comune borders with the following comuniː Altidona, Lapedona and Monterubbiano to the south; Ponzano di Fermo to the southwest; Grottazzolina, Magliano di Tenna and Rapagnano to the west; Torre San Patrizio to the northwest; Monte Urano, Sant'Elpidio a Mare and Porto Sant'Elpidio to the north. To the east is Porto San Giorgio and the Adriatic Sea. The comune has two small exclavesː the largest (Gabbiano) has an area of and is surrounded by Mogliano (province of Macerata), Francavilla d'Ete, Massa Fermana and Montegiorgio; and the smallest (Boara) has an area of and is surrounded by Montegiorgio, Magliano di Tenna, Grottazzolina and Belmonte Piceno. ===Frazioni=== The following frazioni (hamlets) are part of Fermoː Camera, Campiglione, Cantagallo, Casabianca, Capodarco, Cartiera di Tenna, Concerie, Contrada Boara, Ete Palazzina, Faleriense, Gabbiano, Girola, Lido di Fermo, Madonnetta d'Ete, Marina Palmense, Moie, Molini Tenna, Montesecco, Montone, Parete, Pompeiana, Ponte Ete Vivo, Sacri Cuori, Salette, Salvano, San Biagio, San Girolamo, San Lorenzo, San Marco, San Michele, Lido San Tommaso, Torre di Palme and Villa San Claudio. ==Population== There are 37,396 persons living in the comune in 2017, for a population density of inhabitants/km². Evolution of the population Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:40000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:4000 start:0 ScaleMinor = gridcolor:lightgrey increment:2000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1961 text:1961 bar:1971 text:1971 bar:1981 text:1981 bar:1991 text:1991 bar:2001 text:2001 bar:2011 text:2011 bar:2017 text:2017 PlotData= color:barra width:30 align:left bar:1961 from:0 till: 30545 bar:1971 from:0 till: 34067 bar:1981 from:0 till: 35119 bar:1991 from:0 till: 35111 bar:2001 from:0 till: 35502 bar:2011 from:0 till: 37016 bar:2017 from:0 till: 37396 PlotData= bar:1961 at: 30545 fontsize:S text: 30,545 shift:(-13,3) bar:1971 at: 34067 fontsize:S text: 34,067 shift:(-16,5) bar:1981 at: 35119 fontsize:S text: 35,119 shift:(-16,5) bar:1991 at: 35111 fontsize:S text: 35,111 shift:(-16,5) bar:2001 at: 35502 fontsize:S text: 35,502 shift:(-16,8) bar:2011 at: 37016 fontsize:S text: 37,016 shift:(-16,5) bar:2017 at: 37396 fontsize:S text: 37,396 shift:(-16,5) The people from this comune are known, in Italian, as fermani. ==Twinned towns== Fermo is twinned with: * Berat, Albania * Bahía Blanca, Argentina * Ansbach, Germany * León, Mexico ==References== ==Other websites== * * Fermo official website Category:Cities in Marche Category:Capital cities in Italy Category:Settlements in Fermo",
 "title": "Fermo"
}