{
 "id": "356296",
 "text": "Yvette Marie Stevens (better known as Chaka Khan and born March 23, 1953 near Chicago) is a ten time Grammy Award winning American singer and songwriter. She first became famous in the 1970s as the main singer for the funk group Rufus. Khan went solo around 1978, and her hit songs include I Feel for You, I'm Every Woman, Sweet Thing and Through the Fire. She also got several nominations for American Music Awards. On May 19, 2011, Khan was given the 2,440th Hollywood Walk of Fame star plaque on a section of Hollywood Boulevard in Los Angeles. ==Personal life== Khan has been married twice and is the mother of two children, daughter Indira Milini and son Damien Holland. Khan's first marriage was to Hassan Khan, in 1970, when she was 17. They divorced a short time later. Milini's birth was the result of a relationship between Khan and Rahsaan Morris. Khan married her second husband, Richard Holland, in 1976. The marriage reportedly caused a rift between Khan and several members of Rufus. Khan dated a Chicago-area schoolteacher in the mid-1980s in the middle of her solo stardom. Following their separation, Khan moved to Europe. She first lived in London, later living in Germany. In the past, Khan struggled with drug abuse and alcoholism. Her drug use, which at times included cocaine and heroin, ended sometime in the early 1990s. Khan would have an on-again, off-again struggle with alcoholism. In 2005 she said she was sober. In 2006, her son Damien Holland was accused of murder after 17-year-old Christopher Bailey was shot to death. Khan testified on her son's behalf defending her son's innocence. Holland said the shooting was an accident and was found not guilty. Though she sang at both the 2000 Democratic and Republican conventions, Khan says that she is more of a \"Democratic-minded person\". In December 2011, Khan won permanent custody of her granddaughter, Daija Jade Holland. Khan said the mother was unable to raise her due to her drug addiction. It was reported that Khan's son was also addicted to drugs. ==Awards== ===Grammy Awards=== To date, Chaka Khan has won 10 Grammy Awards, including two as a member of Rufus. She has received 22 Grammy Award nominations, including three as a member of Rufus. Year Nominated work Award category Result 1975 \"Tell Me Something Good\" (as Rufus) Best R&B; Vocal Performance By A Duo, Group Or Chorus 1978 Ask Rufus (as Rufus) Best R&B; Vocal Performance By A Duo, Group Or Chorus 1979 \"I'm Every Woman\" Best R&B; Vocal Performance, Female 1982 What Cha' Gonna Do For Me Best R&B; Vocal Performance, Female 1983 Echoes Of An Era Best Jazz Vocal Performance, Female 1984 Chaka Khan Best R&B; Vocal Performance, Female \"Ain't Nobody\" (as Rufus) Best R&B; Performance By A Duo Or Group With Vocal \"Be Bop Medley\" (with Arif Mardin) Best Vocal Arrangement For Two Or More Voices 1985 \"I Feel For You\" Best R&B; Vocal Performance, Female 1986 I Feel For You Best R&B; Vocal Performance, Female 1987 Destiny Best R&B; Vocal Performance, Female 1991 \"I'll Be Good To You\" (with Ray Charles) Best R&B; Performance By A Duo Or Group With Vocal 1993 The Woman I Am Best R&B; Vocal Performance, Female 1996 \"Love Me Still\" (with Bruce Hornsby) Best Song Written Specifically For A Motion Picture Or Television 1997 \"Missing You\" (with Brandy, Tamia & Gladys Knight) Best Pop Collaboration With Vocals \"Never Miss The Water\" (with Meshell Ndegeocello) Best R&B; Performance By A Duo Or Group With Vocal \"Stomp\" (with Luke Cresswell, Fiona Wilkes, Carl Smith, Fraser Morrison, Everett Bradley, Mr. X, Melle Mel, Coolio, Yo-Yo, Charlie Wilson, Shaquille O'Neal & Luniz) 1998 \"Summertime\" Best Female R&B; Vocal Performance 2003 \"What's Going On\" (with The Funk Brothers) Best Traditional R&B; Vocal Performance 2007 \"Everyday (Family Reunion)\" (with Gerald Levert, Yolanda Adams & Carl Thomas) Best R&B; Performance by a Duo or Group With Vocals 2008 \"Disrespectful\" (with Mary J. Blige) Best R&B; Performance by a Duo or Group With Vocals Funk This Best R&B; Album ===Soul Train Awards=== * 1998 Lena Horne Award (Career Achievement) (Recipient) * 2009 Legends Award (Career Achievement) (Recipient) ===United Negro College Fund Award=== * 2011 UNCF: Award of Excellence (Recipient) ===American Music Award nominations=== To date, she has had four American Music Award nominations. * Favorite Female Artist - Soul/Rhythm & Blues (Nominee only. Award recipient was Tina Turner) * Favorite Female Video Artist - Soul/Rhythm & Blues (Nominee only. Award recipient was Tina Turner) * Favorite Female Artist - Soul/Rhythm & Blues (Nominee only. Award recipient was Stephanie Mills) * Favorite Female Artist - Soul/Rhythm & Blues (Nominee only. Award recipient was Diana Ross) References:Chaka Khan @ The Envelope Awards Database ==Discography== *Chaka (1978) *Naughty (1980) *What Cha' Gonna Do for Me (1981) * Chaka Khan (1982) *I Feel for You (1984) *Destiny (1986) *CK (1988) *The Woman I Am (1992) *Come 2 My House (1998) *ClassiKhan (2004) *Funk This (2007) ==References== Category:1953 births Category:Living people Category:Singers from Chicago Category:American R&B; singers Category:American funk singers Category:American soul singers Category:American hip hop singers Category:American dance musicians Category:American disco singers Category:American jazz singers Category:American gospel singers Category:American singer-songwriters Category:Warner Bros. Records artists",
 "title": "Chaka Khan"
}