{
 "id": "356234",
 "text": "Joseph \"Joey\" Lawrence (born Joseph Lawrence Mignogna Jr., April 20, 1976 in Philadelphia) is an American actor and R&B; singer. He is best known for his character roles in the television series Gimme a Break, Blossom and Melissa & Joey. Other television series include the hit show Brotherly Love. He has also acted in several movies. He has two younger brothers, Matthew and Andrew, who are also actors. He attended the University of Southern California. Lawrence's first acting role was in a Cracker Jack commercial. At the age of five, he appeared on The Tonight Show Starring Johnny Carson. He sang the song \"Give My Regards to Broadway\". == Personal life == Lawrence married Michelle Vella in 2002. The couple divorced in 2005. He met his second wife, Chandie Yawn- Nelson, while on vacation in Disney World when the two were teenagers. They married there 13 years later, in July 2005. The couple have two daughters, Charleston (born 2006) and Liberty Grace (born March 2010). In July 2020, Lawrence would file for divorce from Yawn-Nelson. On May 1, 2022, Lawrence would marry Samantha Cope, who was his co-star on the set of a Lifetime movie. They would have a daughter Dylan Rose together. On August 13, 2024, Cope filed for divorce from Lawrence. == Filmography == Year Title Role Notes 1982 Scamps Sparky TV short 1982 Diff'rent Strokes Joey Episode: \"Big Brother\" 1982 Silver Spoons Joey Thompson Episode: \"The Best Christmas Ever\" 1983 Little Shots Pete TV movie 1983 Wait Till Your Mother Gets Home! Chris Peters TV movie 1983–1987 Gimme a Break! Joey Donovan 77 episodes 1984 Young People's Specials Billy Episode: \"Umbrella Jack\" 1985 Summer Rental Bobby Chester 1985 ABC Afterschool Specials Mattie Episode: \"Don't Touch\" 1988 Pulse David Rockland 1988 Oliver & Company Oliver (voice) 1990–1995 Blossom Joey Russo 114 episodes 1991 Chains of Gold Tommy 1993 Olsen Twins Mother's Day Special Singer TV movie 1993 Almost Home Jeff Thornton Episode \"Girls and Boy\" 1993 Empty Nest Wade Episode: \"Aunt Verne Knows Best\" 1994 Radioland Murders Frankie Marshall 1995 Carly's Brother Episode: \"Whipping Post\" 1995 Something Wilder J.J. Travis Episode \"Bergman of Alcatraz\" 1995 Chad (voice) 1995 Prince for a Day Ralph Bitondo / Ricky Prince TV movie 1995–1997 Brotherly Love Joe Roman 40 episodes 1996 Brothers of the Frontier Ethan Frye TV movie 1999 Touched by an Angel Jesse Episode: \"Fool for Love\" 1999 Tequila Body Shots Johnny Orpheus 1999 Horse Sense Michael Woods TV movie 1999 Recess Franklin Dudikoff (voice) Episode: \"The Dude\" 2000 Urban Legends Final Cut Graham Manning 2000 Desperate But Not Serious Darby 2001 Do You Wanna Know a Secret? Hank Ford 2001 Jumping Ship Michael Woods TV movie 2002 Romantic Comedy 101 Mark Gibson TV movie 2002 Dex Finley (voice) Episode: \"Eye of the Storm\" 2002 Trois 2: Pandora's Box Detective Anderson 2002–2003 American Dreams Michael Brooks 11 episodes 2003–2004 Run of the House Kurt Franklin 19 episodes 2004 Love Rules! Michael Warner TV movie 2005 Bow Matt TV movie 2005 Confessions of a Sociopathic Social Climber Ferguson TV movie 2005–2006 Half & Half Brett Mahoney 9 episodes 2006 Android Apocalypse DeeCee TV movie 2006 Rest Stop Officer Michael Deacon Video 2007 CSI: NY Clay Dobson 3 episodes 2007 Dirk Brock (voice) Episode \"The Emperor's New School Musical\" 2008 Killer Pad Joey Lawrence 2008 Together Again for the First Time Carey Krzyznyk Video 2009 My Fake Fiance Vince TV movie 2010 Sinatra Club Louie Pipes 2010–present Melissa & Joey Joe Longo 30 episodes 2011 Havana Heat Agent Sean Franklin Pre- production 2012 Hit List Lyle Completed ==Studio albums== *Joey Lawrence (1993) #74 US Album ChartsBillboard.com Chart History Joey Lawrence album *Soulmates (1997) == References == == Other websites == * Official Website * * Category:1976 births Category:Living people Category:Actors from Philadelphia Category:American child actors Category:American R&B; singers Category:American television actors Category:Singers from Philadelphia",
 "title": "Joey Lawrence"
}