{
 "id": "356228",
 "text": "Melanie Thandiwe Newton (; born 6 November 1972) is a British actress.Graydon, Nicola; \"Thandie Newton on becoming Condoleezza Rice\" The Times (London), 7 September 2008Carty, Ciaran; \"When Thandie met Condi\" Tribune.ie, 21 September 2008 She has performed in numerous British and American movies, including The Pursuit of Happyness and Mission: Impossible II. She was born in London to a black Zimbabwean mother and white British father. She grew up in Africa, London and Penzance. ==Personal life== Newton says that director John Duigan made her have a relationship with him. She was sixteen years old and he was 39. The relationship lasted 6 years. She married English writer/director/producer Ol Parker in 1998. The couple have two daughters: Ripley, born in 2000, and Nico, born in 2004. Her daughters are named after the character Ellen Ripley in the Alien movies and the singer Nico. Newton has suffered from bulimia.Jessen, Monique; \"Thandie Newton Reveals Battle with Bulimia\" People.com, Sunday 5 August 2007 Newton is a Buddhist. ==Filmography== Year Title Role Notes 1991 Flirting Thandiwe Adjewa 1991 Pirate Prince Becky Newton Television film 1993 Rachael Stevens 1994 Loaded Zita 1994 Interview with the Vampire: The Vampire Chronicles Yvette 1995 Jefferson in Paris Sally Hemings 1995 The Journey of August King Annalees 1996 Hilary Rule 1997 Gridlock'd Barbara \"Cookie\" Cook 1997 In Your Dreams Clare Television film 1998 Besieged Shandurai Nominated – Black Reel Award for Best Actress 1998 Beloved Beloved Nominated – NAACP Image Award for Outstanding Supporting Actress in a Motion Picture Nominated – Satellite Award for Best Supporting Actress - Motion Picture 2000 Mission: Impossible II Nyah Nordoff-Hall Nominated – Blockbuster Entertainment Award for Favorite Female - Newcomer Nominated – Empire Award for Best British Actress Nominated – NAACP Image Award for Outstanding Supporting Actress in a Motion Picture Nominated – Razzie Award for Worst Supporting Actress 2000 It Was an Accident Noreen Hurlock 2002 Regina Lambert Nominated – Black Reel Award for Best Actress Nominated – NAACP Image Award for Outstanding Actress in a Motion Picture 2003 Shade Tiffany 2004 Dame Vaako 2004 Crash Christine BAFTA Award for Best Actress in a Supporting Role Black Reel Award for Best Ensemble Broadcast Film Critics Association Award for Best Cast Empire Award for Best Actress Hollywood Film Festival Award for Ensemble of the Year London Film Critics Circle Award for British Supporting Actress of the Year Phoenix Film Critics Society Award for Best Cast Satellite Award for Best Cast – Motion Picture Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Washington D.C. Area Film Critics Association Award for Best Ensemble Cast Nominated – BET Award for Best Actress Nominated – Black Movie Award for Outstanding Performance by an Actress in a Supporting Role Nominated – Black Reel Award for Best Supporting Actress Nominated – Gotham Award for Best Ensemble Cast Nominated – NAACP Image Award for Outstanding Supporting Actress in a Motion Picture 2006 The Mona Lisa Short film 2006 American Dad! Makeva \"Camp Refoogee\" 2006 Linda Nominated – NAACP Image Award for Outstanding Supporting Actress in a Motion Picture 2007 Norbit Kate Thomas 2007 Run Fatboy Run Libby 2008 RocknRolla Stella 2008 How to Lose Friends & Alienate People Herself 2008 W. Condoleezza Rice 2003–2009 ER Makemba \"Kem\" Likasu 2009 2012 Laura Wilson 2010 Huge 2010 Vanishing on 7th Street Rosemary 2010 For Colored Girls Tangie Black Reel Award for Best Ensemble Nominated – Black Reel Award for Best Actress 2011 Retreat Kate 2012 Good Deeds Lindsey Wakefield completed ==References== ==Other websites== * Category:1972 births Category:Living people Category:Actors from London Category:Black British actors Category:Buddhists Category:English movie actors Category:English television actors Category:Entertainers from Cornwall",
 "title": "Thandie Newton"
}