{
 "id": "356217",
 "text": "A county-equivalent in the United States is a type of area that is not inside any county. The county-equivalents are defined by the federal government. They are used for administrative and statistical reasons. As of 2012, there were 3,143 counties and county-equivalents in the United States and the District of Columbia. ==Types of county-equivalents== There are three types of county- equivalents. ===First type=== The first type of county-equivalent is an area of a state which is similar to a county. Examples of this type are that Louisiana has parishes instead of counties, while Alaska has boroughs instead of counties: the city of Anchorage is considered a borough under state law. In Connecticut, the state and federal government use councils of governments, instead of counties, starting in 2024. ===Second type=== The second type of county-equivalent is a city that is not inside any county. Examples of this type: * In Virginia, cities are not legally part of the counties that they are in, so they are considered county-equivalents. * Three other cities in the United States are not legally part of any county: Baltimore, Maryland; Carson City, Nevada; and St. Louis, Missouri. These three cities are also county-equivalents. *Washington, D.C. is a county-equivalent. *Prior to 1997, the Census Bureau had recognized the portion of Yellowstone National Park within Montana as separate from any county, despite the fact that the State of Montana had recognized this land as being within adjacent counties since 1978. This area is no longer considered a county equivalent. ===Third type=== The third type of county-equivalent is an area that doesn't have any county-level government and the United States Census Bureau decides to treat it as a county-equivalent. Example of this type: *Alaska has boroughs, but the boroughs do not cover the whole state. The area not covered by boroughs is called the Unorganized Borough. In 1970, the Unorganized Borough was divided into areas for statistical reasons. Each of those areas is considered a county-equivalent. ==Related pages== * Consolidated city-county ==References== ==Other websites== *County or Statistically Equivalent Entity at the United States Census Bureau website *",
 "title": "County-equivalent"
}