{
 "id": "356274",
 "text": "The Indigo Girls are an American folk and rock music duo. Their names are Amy Ray and Emily Saliers. They met during elementary school. They began performing together while in high school near Atlanta, Georgia. They began performing with the name Indigo Girls close to 1986. They have had many hit songs. They got a Grammy Award in 1990. ==Solo projects== In 1990, Ray founded Daemon Records. The company has signed Magnapop, Ellen James Society, Kristen Hall, Rose Polenzani, Girlyman, Athens Boys Choir, and James Hall among others. Ray has put out five solo albums. They are called Stag, Prom, Live from Knoxville, Didn't It Feel Kinder and \"Amy Ray: Live MVP\". She has toured with both The Butchies and her band The Volunteers. Saliers is also planning a solo album. She is co-owner of Watershed Restaurant in Decatur, Georgia. Saliers was an initial investor in the Flying Biscuit Cafe in Atlanta, Georgia. In 2005, Saliers and her father, Don Saliers, a theology professor at Candler School of Theology at Emory University, released the book A Song to Sing, a Life to Live: Reflections on Music as Spiritual Practice. They promoted the release of the book together including several days of speaking and performing together at the Washington National Cathedral College in Washington D.C. ==Personal lives== Both Ray and Saliers have long identified themselves as lesbians. They have never been a couple. Because of their work for LGBT rights they are seen as icons of the movement. ==Studio albums== *Indigo Girls (EP, 1987) *Strange Fire (1987, independent 11-song version, re- released 1989 in major-label 10-song version) US #159 *Indigo Girls (1989) US #22 *Nomads Indians Saints (1990) US #43 *Rites of Passage (1992) US #21 *Swamp Ophelia (1994) U.S #9, UK #66 *Shaming of the Sun (1997) US #7 *Come on Now Social (1999) US #34 *Become You (2002) US #30 *All That We Let In (2004) US #35 *Despite Our Differences (2006) US #44 *Poseidon and the Bitter Bug (2009) US #29 *Holly Happy Days (2010) *Beauty Queen Sister (2011) #35 ==References== ==Other websites== *Indigo Girls official site Category:1985 establishments in the United States Category:1980s American music groups Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:Folk music groups Category:American rock bands Category:American Grammy Award winners Category:LGBT musical groups Category:LGBT-themed musical groups Category:Musical groups from Atlanta Category:1980s establishments in Georgia (U.S. state)",
 "title": "Indigo Girls"
}