{
 "id": "356319",
 "text": "Cornus canadensis is a herbaceous member of the Cornaceae (dogwood) family. It has various common names, such as the Bunchberry dogwood, Canadian Bunchberry, Quatre-temps, or Crackerberry. It is a widespread plant of the northern hemisphere. It grows about 20-30 cm tall and bears tiny flowers a few millimetres across. They form an inflorescence at the center of four white, petal-like bracts 3-4 cm diameter. Each flower has highly elastic petals that flip backward, releasing springy filaments that are cocked underneath the petals. The filaments snap upward flinging pollen out in less than half a millisecond. The pollen experiences a force two to three thousand times the force of gravity.A record-breaking pollen catapult at Academia.edu The Bunchberry has one of the fastest plant actions found so far. It needs a camera capable of shooting 10,000 frames per second to catch the action. :\"One of the fastest actions in the plant world is the explosive opening of flowers on the bunchberry dogwood, which happens in just under 0.5 milliseconds. As the flowers burst open, the petals quickly separate and flip back, exposing the stamens. During the first 0.3 milliseconds, researchers have calculated the stamens are exposed to a force 800 times greater than astronauts experience during blast-off. The mechanism, it is understood, allows pollen to be thrown upwards in order for it to be transported by the wind\".BBC News & Environment: Picture Gallery In other words, it is a mechanism for cross- pollination by air. The fruits are edible with a mild flavour somewhat like apples. The large seeds within are somewhat hard and crunchy. Birds are the main dispersal agents of the seeds, consuming the fruit during their fall migration. In Alaska, bunchberry is an important forage plant for mule deer, black-tailed deer and moose, which consume it throughout the growing season.Hanley, Thomas A. et al 1987. Forest stand-age related differences in apparent nutritional quality of forage for deer in southeastern Alaska. In Provenza F.D.; Flinders J.T. & McArthur E.D. eds. Proceedings of the symposium on plant-herbivore interactions. Ogden UT: U.S. Department of Agriculture, Forest Service, Intermountain Research Station: 9-17 Where bunchberry, a forest species, and Cornus suecica, a bog species, grow near each other in their overlapping ranges in Alaska, Labrador, and Greenland, they can Hybrid ize by cross-pollination, producing plants with intermediate characteristics.Neiland, Bonita J. 1971. The forest-bog complex of southeast Alaska. Vegetatio. 22: 1-64. == References == Category:Asterids Category:Rapid plant movement",
 "title": "Cornus canadensis"
}