{
 "id": "356365",
 "text": "Richard Stephen Dreyfuss (born October 29, 1947) is an American actor. ==Early life== Dreyfuss was born on October 29, 1947 in Brooklyn, New York to Norman Dreyfuss, a lawyer, and to Geraldine Dreyfuss, a peace activist.Film Reference.com biography Dreyfuss was raised Bayside, Queens, New York. Dreyfuss and his family first moved to Europe, because his father disliked New York City. Later they moved to Los Angeles, California when he was just 9 years old. He was educated at Beverly Hills High School. ==Career== His career began during the late 1960s. He has appeared in movies such as American Graffiti, Inserts, Jaws, Close Encounters of the Third Kind, The Goodbye Girl, Whose Life Is It Anyway?, Moon over Parador, Always, What About Bob?, Poseidon, Mr. Holland's Opus, and James and the Giant Peach. ===Awards=== Dreyfuss won an Academy Award for Best Actor in 1977 for his role in The Goodbye Girl and was nominated for another Academy Award for Best Actor in 1995 for his role in Mr. Holland's Opus. He has won a Golden Globe Award, BAFTA Award, and in 2002 he was nominated for a Screen Actors Guild Award. ==Personal life== Dreyfuss was married to Jeramie Rain from 1983 until they divorced in 1995; they had three children. In 1999, he married Janelle Lacey; they divorced in 2005. He married Svetlana Erokin in 2006. They currently live in Carlsbad, California and in Encinitas, California. ===Health=== Dreyfuss suffers from bipolar disorder. In 2006, he appeared in Stephen Fry's documentary Stephen Fry: The Secret Life of the Manic Depressive, which documented Stephen Fry's life with the disease.Owen, Jonathan (September 17, 2006). \"Stephen Fry: My battle with mental illness\". The Independent.Stephen Fry: The Secret Life of the Manic Depressive . BBC. ==References== ==Other websites== * * Category:1947 births Category:Living people Category:American Academy Award winning actors Category:Actors from Los Angeles Category:Actors from New York City Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:BAFTA Award winning actors Category:Golden Globe Award winning actors Category:Jewish American actors Category:People with bipolar disorder",
 "title": "Richard Dreyfuss"
}