{
 "id": "356379",
 "text": "George Robert Newhart (September 5, 1929 - July 18, 2024) was an American actor and stand up comedian. He performed on many television sitcoms. One of them was his self-titled sitcom The Bob Newhart Show and other one Newhart. He also appeared in the Christmas comedy movie Elf. In 2011, Newhart made a cameo in the movie Horrible Bosses, and in 2013 he guest starred in an episode of The Big Bang Theory, for which he won his very first acting Emmy Award on September 15, 2013. Newhart was born in Oak Park, Illinois on September 5, 1929. He was raised in Chicago, Illinois. Newhart studied at Loyola University at Chicago. He served in the United States Army before his acting career began. Newhart married Virginia \"Ginnie\" Quinn in 1963. She died in 2023. They had four children. Newhart died on July 18, 2024 at his home in Los Angeles, California at the age of 94. ==Movies== Year Title Role Notes 1962 Hell Is for Heroes Pfc. James E. Driscoll A World War II drama with a comedic monologue by Newhart 1968 Hot Millions Willard C. Gnatpole 1970 On A Clear Day You Can See Forever Dr. Mason Hume Catch-22 Maj. Major Major 1971 Cold Turkey Merwin Wren 1977 The Rescuers Bernard voice 1980 Little Miss Marker Regret First Family President Manfred Link 1990 The Rescuers Down Under Bernard voice 1991 The Entertainers Todd Wilson 1997 In & Out Tom Halliwell 1998 Rudolph the Red- Nosed Reindeer: The Movie Leonard the Polar Bear voice 2003 Legally Blonde 2: Red, White & Blonde Sid Post Elf Papa Elf 2004 The Librarian: Quest for the Spear Judson 2006 The Librarian: Return to King Solomon's Mines 2008 The Librarian: Curse of the Judas Chalice 2011 Horrible Bosses Lou Sherman cameo ==References== ==Other websites== * * *Bob Newhart profile from American Masters *Archive of American Television Interview with Bob Newhart May 29, 2001 on Google Video *Bob:The Last Interview *Bob Newhart four-part interview with Horace J. Digby on A3Radio Category:Golden Globe Award winning actors Category:American Grammy Award winners Category:Emmy Award winning actors Category:American television actors Category:1929 births Category:2024 deaths Category:Mark Twain Prize recipients Category:Comedians from Chicago Category:American voice actors Category:American movie actors Category:American radio actors Category:American stand-up comedians Category:Actors from Chicago Category:Actors from Oak Park, Illinois",
 "title": "Bob Newhart"
}