{
 "id": "356458",
 "text": "Old World vultures belong to the family Accipitridae. This family also includes eagles, buzzards, kites, and hawks. Old World vultures are not closely related to New World vultures and condors. They do not share that group's good sense of smell. Both Old World and New World vultures are scavenging birds. They feed mostly from carcasses of dead animals. Old World vultures find carcasses only by sight. Many vultures have a bald head, with no feathers or short down feathers. Because of how a vulture eats, their head is spattered with blood and other fluids. They are able to keep clean by not having long feathers on their head. There are two groups of Old World vultures. The first group has the Egyptian vulture, bearded vulture, and palm- nut vulture. Some scientists put this group into a separate subfamily called \"Gypaetinae\", which means \"eagle-vultures\". It is related to the group of bazas, honey-buzzards and cuckoo-hawks, which are much smaller birds. The second group has all the other species. It is related to the booted eagles, which is a group of eagles that have feathers on their legs down to their toes. The palm-nut vulture is unusual, because it feeds mainly on the fruit of the oil palm. == Species == === Subfamily Gypaetinae === Genus Gypaetus * Lammergeier or bearded vulture, Gypaetus barbatus Genus Neophron * Egyptian vulture, Neophron percnopterus Genus Gypohierax * Palm-nut vulture, Gypohierax angolensis === Subfamily Aegypiinae === Genus Aegypius * Cinereous vulture, Aegypius monachus Genus Gyps * Griffon vulture, Gyps fulvus * White-rumped vulture, Gyps bengalensis * Rüppell's vulture, Gyps rueppelli * Indian vulture, Gyps indicus * Slender-billed vulture, Gyps tenuirostris * Himalayan vulture, Gyps himalayensis * White-backed vulture, Gyps africanus * Cape vulture, Gyps coprotheres Genus Necrosyrtes * Hooded vulture, Necrosyrtes monachus Genus Sarcogyps * Red-headed vulture, Sarcogyps calvus Genus Torgos * Lappet-faced vulture, Torgos tracheliotus Genus Trigonoceps * White-headed vulture, Trigonoceps occipitalis Category:Vultures",
 "title": "Old World vulture"
}