{
 "id": "356431",
 "text": "Spinal muscular atrophy (SMA) is a serious genetic disease which causes nerves and muscles to stop working. This causes the baby to lose its ability to eat, walk, and also breathe. Adults who develop the disease have Type 4 SMA, also called adult onset spinal muscular atropy. It gradually lose the ability to move their bodies. The muscle weakness is known to worsen as the patient ages. The typical onset is for SMA is 30 years. Spinal muscular atrophy affects 1 in 10,000 people per year. It is the most common genetic disease causing deaths of babies. One medicine helps in SMA, called Spinraza, is the only treatment. Spinal muscular atrophy is inherited from parents who might or might not have the disease themselves but both of whom have a recessive fault (mutation) in their genes that predisposes to the disease. Around one in 25 to one in 50 persons, depending on the country, carries a faulty gene of SMA. == Types == === Type 0 === It can already be observed before birth. It is the most rare and most severe form of the condition. Infants who have it tend to move less in the womb. As a result, they are often born with joint deformities or contractures. They have very weak muscle tone (hypotonia) at birth. Their respiratory muscles are also very weak. Most of them do not survive past infancy due to respiratory failure. Some also develop congenital heart defects. === Type I === Also known as Werdnig-Hoffmann disease is the most common form of all. Its severe form can be seen at birth or within the first few months. Children affected cannot control their head movements. Others may struggle sitting down without any assistance. Others may have difficulty swallowing, which often lead to difficulty feeding. Some may also develop breathing problems because of the weakness of their respiratory muscles. Due to respiratory failure, most patients who suffer from this type of condition do not survive past early childhood. === Type II === It is also called Dubowitz disease. It is identified by muscle weakness that develops in children between ages 6 and 12 months. They usually cannot sit without support. Apart from difficulty sitting, they usually cannot stand nor walk without help. Other signs include involuntary trembling (tremors) in their fingers, develop scoliosis, and respiratory muscle weakness that can be life- threatening. Many individuals with this type of condition often can only live up to their twenties or thirties. === Type III === Another name is Kugelberg- Welander disease. It causes muscle weakness in mid-childhood. While many can stand and walk earlier on without much help, as the condition progresses over time, walking and climbing stairs tend to become increasingly difficult for them. Most individuals suffering from this condition tend to require wheelchair assistance later in their lives. Unlike other types, they usually have normal life span. === Type IV === It is rare and usually manifests in early adulthood. Patients often experience mild to moderate muscle weakness, tremors, and very mild breathing problems. == References == == Other websites == Category:Genetic disorders",
 "title": "Spinal muscular atrophy"
}