{
 "id": "356553",
 "text": "Sportsmanship is traditional value in sports and competition. It means playing clean and handling both victory and defeat with grace, style, and dignity.Kidshealth.org, \"Sportsmanship\"; retrieved 2012-8-3. Sportsmanship is generally understood to include * playing fair * following the rules of the game * respecting the judgment of referees and officials * treating opponents with respect The ideal of sportsmanship argues that \"it doesn't matter whether you win or lose, but how you play the game\".Kendrick, Carleton, \"Teaching Good Sportsmanship,\" FamilyEducation.com; retrieved 2012-8-3. Sportsmanship can be different depending on the game itself or the culture of the group. For example, in the sport of cricket, a player will sometimes acknowledge that he is out by walking off the field, even though the umpires (game officials) had thought that he was not out. In another example, a tennis player who sees a ball go in but is called out by the linesperson could concede the point or suggest the opponent make a challenge, as was the case with professional tennis player Jack Sock on at least two occasions. ==Olympic Games== In the context of the Olympic Games, athletes are expected to do their best.Oktavinanda, Pramudya A. \"The Olympic Scandal: Sportsmanship Issue or Poor Strategy?\" Jakarta Globe (Indonesia). August 3, 2012; retrieved 2012-8-3. Otherwise, they would go against the Olympic motto of \"Faster, Higher, Stronger\".Zhu Yuan. \"Sportsmanship more important,\" China Daily (PRC). 3 August 2012; retrieved 2012-8-3. ===Select examples of good sportsmanship === * Eugenio Monti in the bobsleigh at the 1964 Winter Olympics at InnsbruckSportsReference.com (SR/Olympics), \"Eugenio Moni\" ; retrieved 2012-8-3. * Lawrence Lemieux in sailing at the 1988 Summer Olympics at Seoul \"Lemieux's sportsmanship still recognized,\" Edmonton Journal (Canada). March 13, 2008; retrieved 2012-8-3. * Shin Lam in fencing at the 2012 Summer Olympics at London Fencing's Shin Lam offered 'consolation prize' following display of sportsmanship,\" Independent (UK). 31 July 2012; retrieved 2012-8-3. ===Select examples of bad sportsmanship=== In the London Olympics, some athletes attempted to lose their badminton matches,Cole, Cam. \"Expelled Olympic badminton players win gold for lack of subtlety,\" National Post (Canada). August 1, 2012; retrieved 2012-8-3. including * Tian Qing, Zhao Yunlei, Wang Xiaoli and Yu Yang of ChinaLeicester, John. \"Sportsmanship smashed just like a shuttlecock,\" Peoria Journal Star (US). August 1, 2012; excerpt, \"Between the Olympic ideal and the Olympic reality is a trap that eight badminton players fell into at London 2012. They didn’t cheat. Instead, they tried to win — by deliberately trying to lose\"; retrieved 2012-8-3. * Jung Kyung-eun, Kim Ha-na, Ha Jung-eun and Kim Min-jung of South Korea * Greysia Polii and Meilana Jauhari of Indonesiaз ==Related pages== * Pierre de Coubertin medal * Sportsperson * Unsportsmanlike conduct ==References== Category:Sports",
 "title": "Sportsmanship"
}