{
 "id": "356560",
 "text": "The Pierre de Coubertin medal is awarded by the International Olympic Committee and recognizes those who demonstrate the spirit of sportsmanship in the Olympic Games. The medal is not the same award as the Pierre de Coubertin World Trophy, which is awarded by the International Fair Play Committee. ==Recipients== Recipient Country Accomplishment(s) Date Place Juan Antonio Samaranch Seventh President of the International Olympic Committee 1997 — Leon Štukelj — 12 November 1999 (awarded posthumously) — Raymond Gafner — 1999 — Rainier III, Prince of Monaco — 2000 — João Havelange — 2000 — Gianni Agnelli — 2000 — Alain Danet — 2000 — Kurt Furgler — 2000 — Henry Kissinger — 2000 — Yoshiaki Tsutsumi — 2000 — Emil Zátopek 1952 Summer Olympics 6 December 2000 (awarded posthumously) Helsinki, Finland Kéba Mbaye — 2001 — Rodolphe Leising — 2001 — Wolf Lyberg — 2001 — Spencer Eccles 2002 Winter Olympics February 2002 Salt Lake City, Utah, United States Artur Takac — 2002 — Conrado Durantez — 2002 — Hilda Múdra — 2002 — Carlos Luña Longo — 2002 — Walburga Grimm — 2003 — Cecilia Tait — 2003 — Marino Ercolani Casadei — 2003 — Julio Ernesto Cassanello — 2003 — Vanderlei de Lima 2004 Summer Olympics 29 August 2004 Athens, Greece Erwin Niedermann — 2004 — Heiner Heinze — 2004 — Martin Franken In recognition of his contribution to the promotion of the Olympic Movement and services to the IOC 16 November 2006 Lausanne, Switzerland Elena Novikova- Belova 2007 XI International Scientific Congress 17 May 2007 Minsk, Belarus Shaul Ladany \"Unusual outstanding sports achievements during a span covering over four decades\" 17 May 2007 Minsk, Belarus Manfred Bergman For services rendered to the International Olympic Committee and the Olympic cause December, 2008 Lausanne, Switzerland Boyan Radev — 15 September 2009 — Eric Monnin Olympic education specialist 2012 — Bob Nadin Ice hockey referee 2012 — Richard Garneau 2014 Winter Olympics 6 February 2014 (awarded posthumously) Sochi, Russia Michael Hwang \"Exceptional services to the Olympic movement\" 13 October 2014 Singapore, Singapore Eduard von Falz- Fein \"[L]ong service to the Olympic movement\" 17 February 2017 Vaduz, Liechtenstein Lü Junjie Zisha artist 16 January 2018 Lausanne, Switzerland Han Meilin Chinese artist most recognized today for his creation of the Fuwa dolls for the 2008 Summer Olympics in Beijing. 24 April 2018 Lausanne, Switzerland ==Related pages== * Olympic Cup * Olympic Order ==References== Category:Olympic Games Category:1997 establishments Category:Sports trophies and awards",
 "title": "Pierre de Coubertin medal"
}