{
 "id": "356501",
 "text": "In biology, a type is a specimen, or example, of a specific living thing or taxon, which is a group of specific living things. For example, if a scientist catches one frog that is not any species of frog that scientists already know, then that frog is the type of a new species of frog. That species will have a new scientific name. In older English writings from before 1900, plant scientists used the word type for groups of living things instead of specimens. A taxon is a group of living things with a scientific name. Taxons can be small or large. A species is a taxon. A genus is a taxon. A kingdom is a taxon. Taxons are based on published papers with lots of information in them and on type material. Scientists show the type material to other scientists so they can study it. They usually do this by putting the material in museums' research collections. ==Type specimen== The International Code of Zoological Nomenclature (ICZN) and the International Code of Nomenclature for algae, fungi, and plants (ICN) make rules for type specimens. In these rules, the scientific name of every taxon is almost always based on just one specimen. Types are usually specimens that are kept in a museum or herbarium research collection. These types are usually whole organisms in a preservative, for example alcohol. Sometimes they are just pictures of the organisms. Describing species and appointing type specimens is part of scientific nomenclature and alpha taxonomy. Depending on the naming code for the organism, a type can be a specimen, a culture, a drawn picture, or (for bacteria) a description. For example, in the research collection of the Natural History Museum in London, there is a bird specimen numbered 1886.6.24.20. This is the specimen for the spotted harrier, Circus assimilis. This specimen is the holotype for that species; the name Circus assimilis is, by definition, the species of that particular specimen. Scientists do not need to make sure that the specimen they use as a type is a \"typical\" individual in that taxon. The type can be a different color from other members of its taxon. It can be deformed or different. The use of the term type is complicated because botany and zoology use it differently. In the PhyloCode, type-based definitions are replaced by phylogenetic definitions. ==Type locality== The type locality is the place where the scientists found the type specimen. ==Older words== In some older books about taxonomy, writers use the word \"type\" differently. Some use it to mean \"taxon.\" ==Related pages== *Type species ==Other websites== * ICZN Code: International Code of Zoological Nomenclature, the official website * Fishbase Glossary section (archived) * A compendium of terms (archived) * Zoological Type Nomenclature (Evenhuis) (PDF) ==References== Category:Biology Category:Taxonomy",
 "title": "Type (biology)"
}