{
 "id": "356603",
 "text": "\"Call Me Maybe\" is a song by Canadian singer-songwriter Carly Rae Jepsen. It is the first song on her EP Curiosity (2012). It is the third song on her second album Kiss (2012). The song was written by Jepsen and Tavish Crowe as a folk song, but its genre (style of music) was changed to pop after the production by Josh Ramsay. It was released as the first single from the EP on 20 September 2011, through 604 Records. Jepsen was later signed to Schoolboy Records and the song was released in the United States. Call Me Maybe is about love at first sight. \"Call Me Maybe\" reached number one on the charts in Australia, Canada, Czech Republic, Denmark, Finland, France, Hungary, Ireland, Luxembourg, New Zealand, Poland, Slovakia, Switzerland, the United Kingdom and the United States. It reached the top three in Austria, Belgium (Flanders & Wallonia), Germany, Israel, Japan, Netherlands, Norway, and Sweden. \"Call Me Maybe\" made Carly Rae Jepsen the fifth Canadian artist to reach number one on the Canadian Hot 100 since 2007. In the United States, \"Call Me Maybe\" is the first number one by a female Canadian artist on the Billboard Hot 100 chart since \"Girlfriend\" by Avril Lavigne in 2007. \"Call Me Maybe\"'s music video was directed by Ben Knechtel. In the video, Carly Rae Jepsen wants the attention of an attractive boy. At the end of the video, the boy is revealed to be attracted to a male band member. To promote the song, Carly Rae Jepsen sang it on The Ellen DeGeneres Show. This was Carly Rae Jepsen's first time on US television. Jepsen also sang the song at the 2012 Billboard Music Awards. \"Call Me Maybe\" has been covered by many singers including Kelly Clarkson, Fun, Big Time Rush, Lil Wayne and Cody Simpson. \"Call Me Maybe\" has been parodied by Cookie Monster and some of the news staff of National Public Radio. \"Call Me Maybe\" was covered on \"The New Rachel\", the first episode of the fourth season of Glee. \"Call Me Maybe\" was nominated for two Grammy Awards in 2013: Song of the Year and Best Pop Solo Performance. On 11 December 2012, \"Call Me Maybe\" was chosen as Song of the Year for 2012 by MTV. In 2012, Billboard magazine ranked the song #2 in the Hot 100 Songs, Digital Songs, and Canadian Hot 100 charts. On all three charts it was behind \"Somebody That I Used to Know\", a song by Gotye featuring Kimbra. \"Call Me Maybe\" sold over 12 million copies in 2012, so it was the best-selling song in the world that year. It was the best-selling single on the iTunes Store in 2012. \"Call Me Maybe\" had sold over 18 million copies by July 2015. It is the best selling song of the 21st century by a female artist. \"Call Me Maybe\" was the best- selling digital single of 2012. It is the seventh best-selling digital single ever. ==Background== \"Call Me Maybe\" was written by Carly Rae Jepsen and Tavish Crowe as a folk song when they were on tour. Jepsen said that writing the song was easy, and that she wasn't \"over-thinking it. We brought in Josh, and he helped us kind of pop-ify it.\" \"Call Me Maybe\" was recorded at the Umbrella Studios in Richmond, British Columbia, Canada. \"Call Me Maybe\" was first released in just Canada on 20 September 2011. In December 2011, singers Justin Bieber and Selena Gomez heard the song on the radio. They shared the song through Twitter. This brought attention to Carly Rae Jepsen and \"Call Me Maybe\". Jepsen was signed by Scooter Braun to his record label, Schoolboy Records. Interscope Records helped to release \"Call Me Maybe\" around the world. ==Charts== ===Weekly charts=== Chart (2011–2022) Peak position Brazil (Billboard Brasil Hot 100) 26 Brazil Hot Pop Songs 7 Lebanon (Lebanese Top 20) 4 Luxembourg (Luxembourg Digital Songs) 1 Mexico Airplay Chart (Billboard) 4 Romania (Airplay 100) Note: User may scroll down the 'Podcasturi' menu to play or download the respective podcast. 12 Slovenia (SloTop50) 32 South Korea (Gaon) 18 South Korea International (Gaon) 1 Venezuela Pop Rock General (Record Report) 1 ===Year-end charts=== Chart (2012) Position Australia (ARIA) 1 Austria (Ö3 Austria Top 40) 6 Belgium (Ultratop 50 Flanders) 6 Belgium (Ultratop 50 Wallonia) 5 Canada (Canadian Hot 100) 2 Denmark (Tracklisten) 6 France (SNEP) 3 Germany (Media Control Charts) 6 Hungary (Rádiós Top 40) 4 Ireland (IRMA) 5 Israel (Media Forest) 8 Italy (FIMI) 7 Japan (Japan Hot 100) 9 Netherlands (Dutch Top 40) 1 Netherlands (Single Top 100) 6 New Zealand (RIANZ) 1 Poland (ZPAV) 8 South Korea International (Gaon) 9 Spain (PROMUSICAE) 16 Sweden (Sverigetopplistan) 8 Switzerland (Schweizer Hitparade) 5 UK Singles (Official Charts Company) 2 US Billboard Hot 100 2 US Adult Contemporary (Billboard) 14 US Adult Top 40 (Billboard) 8 US Dance/Mix Show Airplay (Billboard) 25 US Mainstream Top 40 (Billboard) 4 Chart (2013) Position Canada (Canadian Hot 100) 91 France (SNEP) 73 Japan (Japan Hot 100) 18 South Korea (Gaon) 48 South Korea (Gaon International Chart) 1 UK Singles (Official Charts Company) 160 US Adult Contemporary (Billboard) 26 Chart (2014) Position Japan Hot Overseas (Billboard Japan) 9 South Korea (Gaon International Chart) 32 Chart (2016) Position Japan (Japan Hot 100) 99 Japan Hot Overseas (Billboard Japan) 9 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 22 UK Singles (Official Charts Company) 61 US Billboard Hot 100 13 ===All-time charts=== Chart Position US Billboard Hot 100 47 UK Singles (Official Charts Company) 60 == References == Category:Music memes Category:Pop songs Category:2011 songs",
 "title": "Call Me Maybe"
}