{
 "id": "356754",
 "text": "Henry William Dalgliesh Cavill (born May 5, 1983) is an English movie, voice, and television actor. He is known for playing Superman in the DC Extended Universe, beginning in Man of Steel (2013). ==Early life== Cavill was born on 5 May 1983. He was the fourth of five boys in a Roman Catholic family in Saint Helier, Jersey, in the Channel Islands.[2] His Jersey-born mother, Marianne Dalgliesh, is of Scottish, English and Irish heritage and worked as a secretary in a bank.[3] His father, Colin Cavill, was born in Chester, England and is a former stockbroker.[3][4] He was educated at St Michael's Preparatory School in Saint Saviour, Jersey, before attending Stowe School in Stowe, Buckinghamshire.[5] == Career == Cavill has appeared in the movies The Count of Monte Cristo, Stardust, and Immortals. He also played the role of Charles Brandon, 1st Duke of Suffolk, on the Showtime series The Tudors, from 2007 until 2010. He played Superman in Zach Snyder's 2013 movie Man of Steel,\"The Brit invasion: Actor Henry Cavill joins Christian Bale and Andrew Garfield to play an American superhero\". Daily Mail. Retrieved 27 June 2012 Batman v Superman: Dawn of Justice, Justice League and Zack Snyder's Justice League. ==Filmography and television== * Laguna (2001) * The Count of Monte Cristo (2002) * The Inspector Lynley Mysteries (2002) * Goodbye, Mr. Chips (2002) * Midsomer Murders (2003) * I Capture the Castle (2003) * Hellraiser: Hellworld (2005) * Tristan and Islode (2006) * Red Riding Hood (2007) * Stardust (2007) * The Tudors (2007 - 2010) * Blood Creek (2009) * Whatever Works (2009) * Immortals (2011) * The Cold Light of Day (2012) * Man of Steel (2013) * Batman v Superman: Dawn of Justice (2016) * Justice League (2017) * Zack Snyder's Justice League (2021) * Mission: Impossible – Fallout (2021) * Enola Holmes (2020) * Enola Holmes 2 (2022) ==References== ==Other websites== * * Category:1983 births Category:English movie actors Category:English television actors Category:English voice actors Category:English models Category:Living people Category:Jersey people",
 "title": "Henry Cavill"
}