{
 "id": "356768",
 "text": "The Tour of Flanders is a Flanders Classics road cycling race. It is held in Belgium every spring. It is a week before the Paris–Roubaix road race. The Tour of Flanders is part of the UCI World Tour. It is one of the monuments of the European professional calendar. It is the most important cycling race in Flanders. Its nickname is Vlaanderens mooiste which is Dutch for \"Flanders' finest\". When the race began in 1913 the starting city was Ghent with the end of the race in Mariakerke. It has changed twelve times since then. In 2012 the race starts in Bruges and ends in Oudenaarde. The race has a number of short, sharp hills. The race gives prizes to the first cyclist to go up 17 of these hills. These hills make the race very challenging. > \"Looking back, you get a bit nostalgic, but from a competitive point of > view, Flanders was one of the most horrible races to ride but one of the > greatest races to win.\" - Sean Kelly Procycling, UK, undated cutting == Victories per country == # Country Victories 1\\. 69 2\\. 12 3\\. 11 4\\. 4 5\\. 3 6\\. 2 6\\. 2 7\\. 1 7\\. 1 7\\. 1 7\\. 1 ==Records== * The fastest Tour of Flanders was in 2001. It was won by Italian Gianluca Bortolami: 43.6 km/h. * Five men share the record for victories, with three each: Italian Fiorenzo Magni and four Belgians: Achiel Buysse, won three times in the 1940s, Eric Leman, won at the beginning of the 1970s, Johan Museeuw won the race in 1993, 1995 and 1998, Tom Boonen won in 2005, 2006 and 2012.Ronde van Vlaanderen - Flanders by numbers, 9 May 2007, uk.eurosport.yahoo.com * The nation with most victories is Belgium (68). * Only six riders have won two years in a row. * The oldest winner was Andrei Tchmil in 2000 at 37 years 2 months and 11 days. ==References== ==Other websites== * * The Spring Classics: Cycling's Greatest One-Day Races Category:1913 establishments in Europe Category:Sport in Belgium Category:Flanders Category:1910s establishments in Belgium Category:Cycle races",
 "title": "Tour of Flanders"
}