{
 "id": "356707",
 "text": "Dominican Spanish is Spanish as it is spoken in the Dominican Republic and by the Dominican diaspora. == Roots of the language == Dominican Spanish is based on Canarian and Andalucian dialects from south Spain but with some influences from West African languages. The indigenous Arawak language left very little influence on the language; the only influence they left were some words, mainly for foods and names. === African influence === Examples of African- based syntax: * Dominican Spanish: \"Como tu ta?\", Spanish: \"¿Cómo estás tú?\" * Dominican Spanish: \"Como tu te llama?\", Spanish: \"¿Cuál es su nombre?\" or \"¿Cómo se llama usted?\" * Dominican Spanish : \"P'onde ta?\" or \"Onde ta\", Spanish: \"¿Por dónde está eso?\" or \"¿Por dónde estás?\" Words such as \"mangu\" (mashed plantains), \"kamboumbo\" (basket for clothes), \"guineo\" or \"guinea\" (banana), and many more. Note, most of these African words are either Igbo or Kikongo origins. The most dominant African languages that has had the most influence in the formation of the Dominican Spanish is the Igbo, Yoruba, Kongo, Twi, Fon, Ewe, Mandinga, Hausa, Wolof etc. With the syntax being based off the Yoruba language and Mande languages, the phonetics heavily influenced by the Kikongo, and the pronouciations of certain words containing some elements of the Mandingas and the Igbos. Most schollars, just as all of the West Indies have said that the Kikongo language influenced greatly the formation of the Dominican Spanish . === Vocabulary === These are some examples of Dominican Spanish. <> some of these words or expressions/idioms are of African origin. * Chalina: corbata; Tie * Terina: vasija para lavarse las manos; handwashing vessel * Boto: sin filo; blunt * Mayimbe: el rey; king * Mata: yerba, árbol, planta de cualquier tipo; grass, tree, plant of any kind * Pela: golpes, paliza; hitting, beating * Mai: madre; mother * Pai: Padre; Father * Soga: Cualquier tipo de cuerda; Any type of rope * Abarrotar: llenar, atestar; fill, cram * Bandazo: tumbo; lie * Chuma: Populazo, gentuza; Populazo, riffraff * Desamarrar: desatar; loosen * Embicar: beber a pico de botella; drinking from the bottle * Garete: (al garete) sin control, sin orden; (to hell) without control, without a warrant * Singar: realizar el acto sexual; having sexual intercourse * Zafar: soltar; release or give up * Bembe: labios; lips * Cateyano: Castellano, Espanol; Castilian, Spanish * Kalunga: Dios; God * Matatan: el macho, el veradero hombre; the man * Kikonde: Esconde, to hide == Related languages == Palenquero is a Spanish-African based Creole with Portuguese influences that is spoken in the Caribbean coast of Colombia. The Eastern Cuban Spanish dialect is remarkably identical to the Dominican Spanish . Many Cubans consider the east part of Cuba as another Dominican Republic due to similar culture. ==References== Category:Spanish language Category:Spanish dialects Category:Dominican Republic",
 "title": "Dominican Spanish"
}