{
 "id": "356868",
 "text": "Donald Henry Pleasence OBE (October 5, 1919 - February 2, 1995) was an English actor. Pleasence was born in Worksop, Nottinghamshire, England. He was raised in Lincolnshire, England. During his career, Pleasence was nominated for four Tony Awards. He won a BAFTA TV Award for Best Actor in 1959. In his whole career, Pleasence appeared in over 200 movies. He made his first movie The Dybbuk in 1952. It was a television movie. He acted in several movies, such as You Only Live Twice, where he played James Bond villain Ernst Stavro Blofeld, and The Great Escape. Pleasence is known for his role as Dr. Samuel Loomis in John Carpenter's Halloween. Since then, he appeared in five out of the six movies of the Halloween movie series. Pleasence did not appear in Halloween III: Season of the Witch because it was a different story from the last two movies. Pleasence died at the age of 75 in Saint-Paul-de-Vence, France, from complications of heart failure. It was following a heart valve replacement surgery. ==Early life== Pleasence was born Donald Henry Pleasence in Worksop, Nottinghamshire, England on October 5, 1919. His parents were Alice and Thomas Pleasence. Pleasence was raised as a Methodist. He was raised in Lincolnshire, England. Pleasence studied at the Ecclesfield School in Yorkshire, England. During World War II, Pleasence was sent to serve in the Royal Air Force. He served with 166 Squadron, RAF Bomber Command. His war plane was shot down in August 1944, during a raid on Agenville. He was placed in the German prisoner- of-war camp. Pleasence was released before the war's end in 1945. ==Career== In 1939, Pleasence started working on stage as an assistant stage manager. His first acting job was as Hareton in the stage version of Wuthering Heights. He worked in theatres in Birmingham and Bristol. Later, Pleasence moved to London. There he appeared as Valentine in Twelfth Night in 1942. Pleasence's first television work was in I Want to Be A Doctor in 1946. In 1954, he played Syme in a BBC adaptation of George Orwell's novel Nineteen Eighty-Four. The adaptation was by Nigel Kneale. Pleasence played Prince John in several episodes of the ITV series The Adventures of Robin Hood. Pleasence made his big-screen debut with the 1954 movie The Beachcomber. Some early roles include Parsons in 1984 (his second Orwell movie). He also appeared in minor roles such as in Barnacle Bill and in The Wind Cannot Read. In Tony Richardson's movie, Look Back in Anger, he plays a market inspector. During the early 1960s, Pleasence recorded several children's-story records. They were released in the United States as Tale Spinners For Children by United Artists. The stories included Don Quixote and the Brave Little Tailor. Pleasence did the voice-over for the British Public Information Film, The Spirit of Dark and Lonely Water in 1973. He was the author of the 1977 children's book Scouse the Mouse. In his later years, he appeared as Lucas Deranian in Walt Disney's Escape to Witch Mountain, Dr. Loomis in Halloween, Dr. Kobras in The Pumaman and the President in Escape from New York. He reprised his Dr. Loomis role in Halloween II, Halloween 4: The Return of Michael Myers, Halloween 5: The Revenge of Michael Myers and Halloween: The Curse of Michael Myers. Pleasence's acting career ended when he died in 1995. ==Awards== Pleasence was nominated four times for the Tony Award. He was nominated for Best Performance By a Leading Actor in a Broadway Play. He was nominated in 1962 for Harold Pinter's The Caretaker, in 1965 for Jean Anouilh's Poor Bitos, in 1969 for Robert Shaw's The Man in the Glass Booth, and in 1972 for Simon Gray's Wise Child. ==Personal life== Pleasence was married four times. He married Miriam Raymond in 1941. They divorced in 1958. He married Josephine Crombie in 1959. They divorced in 1970. He married Meira Shore in 1970. They divorced in 1988. He was last married to Linda J. Kentwood in 1988. Their marriage lasted until Pleasance died in 1995. Pleasence had five daughters. He and Raymond had two daughters, Angela and Jean Pleasence. He and Crombie had two daughters, Polly Jo and Lucy. He and Shore had one daughter, Miranda. ==Death== Pleasence died from heart failure after heart surgery in Saint-Paul-de-Vence, France on February 2, 1995, aged 75. His remains were later cremated. His last full movie, Halloween: The Curse of Michael Myers was dedicated in his memory. ==Movies== Year Movie Role Notes 1952 The Dybbuk Second Batlon TV movie 1952-1959 BBC Sunday-Night Theatre Corporal TV series, episode Arrow to the Heart (I) (1952) 1952-1959 BBC Sunday-Night Theatre Chamberlain Episode Such Men are Dangerous (1954) 1952-1959 BBC Sunday-Night Theatre Syme Episode Nineteen Eighty-Four (1954) 1952-1959 BBC Sunday-Night Theatre Foreign Minister Episode The Moment of Truth (1955) 1952-1959 BBC Sunday-Night Theatre Doctor Episode The Millionairess (1959) 1954 The Beachcomber Tromp 1954 Montserrat Juan Alvarez TV movie 1954 The Face of Love Alex TV movie 1954 Orders Are Orders Corporal Martin credited as Donald Plesance 1955 Value for Money Limpy 1956 1984 R. Parsons 1956 The Black Tent Ali 1956-1958 The Adventures of Robin Hood Prince John (4 episodes) TV series, episodes The Prisoner (1956), Isabella (1956), Ambush (1957), Marian's Prize (1958) 1956-1958 The Adventures of Robin Hood Bailiff Baldwin (1 episode) Episode A Village Wooing (1956) 1956-1959 ITV Television Playhouse William TV series, episode Ever Since Paradise (1956) 1956-1959 ITV Television Playhouse Albert Episode Chance Meeting (1956) 1956-1959 ITV Television Playhouse Captain Browne Episode Fate and Mister Browne (1958) 1956-1959 ITV Television Playhouse Leonard Browne Episode Mr. Browne Comes Home (1959) 1956-1959 ITV Television Playhouse Robert Robertson Episode The Silk Purse (1959) 1957 The Man in the Sky Crabtree Titled Decision Against Time in the United States 1957 Assignment Foreign Legion Commandant TV series, episode The Coward 1957 Manuela Evans 1957 Barnacle Bill Cashier Titled All at Sea in the United States 1958 I Spy Mr. Frute TV movie 1958 A Tale of Two Cities John Barsad 1958 Heart of a Child Spiel 1958 The Wind Cannot Read' Doctor 1958 The Man Inside Organ-grinder 1958 The Two-Headed Spy General Hardt 1959 The Scarf Detective Inspector Harry Yates TV series, six episodes 1959 Look Back in Anger Hurst 1959 William Tell The Spider TV series, episode The Spider 1959 The Traitor Grantley Caypor TV movie 1959 Killers of Kilimanjaro Captain 1959 The Battle of the Sexes Irwin Hoffman 1960 The Shakedown Jessel Brown 1960 Hell Is a City Gus Hawkins 1960 The Four Just Men Paul Koster TV series, episode The Survivor 1960 Interpol Calling Karl Haussman TV series, episode The Absent Assassin 1962 The Inspector Sergeant Wolters 1963 The Great Escape Flight Lieutenant Colin Blythe RAF, \"The Forger\" 1965 The Hallelujah Trail Oracle Jones 1966 Fantastic Voyage Dr. Michaels 1966 Cul-de-sac George 1967 You Only Live Twice Ernst Stavro Blofeld 1968 The Other People Clive Film never released 1970 Soldier Blue Isaac Q. Cumber 1971 THX 1138 SEN 5241 1971 Wake in Fright Doc Tydon 1972 Death Line Inspector Calhoun 1972 Henry VIII and His Six Wives Thomas Cromwell 1972 The Jerusalem File Major Samuels 1973 Columbo Adrian Carsini \"Any Old Port in a Storm\" 1974 Watch Out, We're Mad The Doctor 1974 From Beyond The Grave Jim Underwood (segment 2 \"An Act of Kindness\")- 1976 The Eagle Has Landed Himmler 1976 The Passover Plot Pontius Pilate 1977 Telefon Nikolai Dalchimsky 1978 Halloween Dr. Loomis 1978 Sgt. Pepper's Lonely Hearts Club Band B.D. Hoffler/B.D. Brockhurst 1980 The Pumaman Dr. Kobras 1981 Halloween II Dr. Loomis 1981 Race for the Yankee Zephyr Gilbert \"Gibbie\" Carson 1982 Escape from New York Mr. President 1982 Alone in the Dark Dr. Leo Bain 1982 The Barchester Chronicles Reverend Septimus Harding TV series 1983 Warrior of the Lost World Prossor 1984 A Breed Apart J.P. Whittier 1985 Phenomena John McGregor 1987 Django 2 Gunn 1987 Prince of Darkness Priest 1988 Hanna's War Captain Thomas Rosza 1988 Halloween 4: The Return of Michael Myers Dr. Loomis 1989 Halloween 5: The Revenge of Michael Myers Dr. Loomis 1989 Ten Little Indians Judge Lawrence Wargrave 1993 The Thief and the Cobbler Phido the Vulture (voice) 1993 The Hour of the Pig Pincheon 1995 Halloween: The Curse of Michael Myers Dr. Loomis 1996 Fatal frames: Fotogrammi mortali Professor Robinson ==References== ==Other websites== * * *Donald Pleasence at screenonline *Donald Pleasence-bio at (re)Search my Trash *The Man with the Hypnotic Eye A Tribute to Donald Pleasence *Photograph of a theatrical production in prisoner of war camp featuring Donald Pleasence Category:1919 births Category:1995 deaths Category:Actors from Nottinghamshire Category:Actors who played Bond villains Category:Deaths from heart failure Category:Deaths from surgical complications Category:English movie actors Category:English radio actors Category:English stage actors Category:English television actors Category:English voice actors Category:Halloween (franchise)",
 "title": "Donald Pleasence"
}