{
 "id": "356943",
 "text": "Fes or Fez is the second largest city of Morocco. About 1 million people lived there in 2010. It is the capital of the Fès-Boulemane region. The city has been called the \"Mecca of the West\" and the \"Athens of Africa\". Fez is the former capital. It is one of the country's four \"imperial cities\". The others are Rabat, Marrakech and Meknes. \"Fas el Bali\", one part of the city, is a UNESCO World Heritage Site. Fes has a football team, MAS Fez. They play in the Botola the highest tier of the Moroccan football system. They play their home matches at the 45,000 seat Complexe Sportif de Fès stadium. == Main sights == Fez is becoming an increasingly popular tourist destination. Many non- Moroccans are now restoring traditional houses (riads and dars) as second homes in the Fez medina. The most important monuments in the city are: * Bou Inania Madrasa * Al-Attarine Madrasa * University of Al-Karaouine * Zaouia Moulay Idriss II * Dar al-Magana * Aben Danan Synagogue File:Fès et sa médina.jpg|Fez medina. File:Fes Bab Bou Jeloud 2011.jpg|Bab Bou Jeloud, \"The Blue Gate\" of Fez. File:Bou Inania Madrasa 2011.jpg|The Bou Inania Madrasa built by the Marinid sultan Abu Inan Faris in 1351. == Notable residents == * Muhammad XII of Granada, last Moorish king of Al-Andalus. * Jamal Fakir, French international rugby league player. * Madame Guinaudeau, French cookery and travel writer.Author of 'Traditional Moroccan Cooking, Recipes from Fez'. (Serif, London, 2003). == International relations == === Twin towns — Sister cities === Fez is twinned with: * Montpellier, France, since 1961 * Strasbourg, France, since 1961 * Florence, Italy, since 1961 * Kairouan, Tunisia, since 1965 * Saint Louis, Senegal, since 1979 * Córdoba, Andalusia, Spain, since 1982 * İzmir, Turkey, since 1995 * Bobo Dioulasso, Burkina Faso, since 2003 * Suwon, South Korea, since 2003 * Coimbra, Portugal * Lahore, Pakistan * Puebla, Mexico === Partnerships === * Kraków in Poland (since 1985) ==References== Category:Cities in Morocco Category:780s establishments Category:Establishments in Morocco Category:8th-century establishments in Africa Category:World Heritage Sites in Morocco",
 "title": "Fez, Morocco"
}