{
 "id": "357057",
 "text": "Richard Schiff (born May 27, 1955) is an American actor and television director and producer. He is an Emmy Award winning actor. ==Early life== Schiff was born on May 27, 1955 in Bethesda, MarylandRichard Schiff Biography (1955-) to Charlotte Schiff and to Edward Schiff. He was educated at City College of New York. ==Career== Schiff's career started in 1983. He has appeared in more than 100 movies. He played Professor Emil Hamilton in the 2013 movie Man of Steel. Schiff is mostly known for his role Toby Ziegler on The West Wing. He also starred in The Lost World: Jurassic Park and in Skinner. ==Personal life== Schiff has been married to Sheila Kelley since 1996. They have 2 children, Gus and Ruby. Schiff is a Democrat who endorsed John Kerry, Barack Obama, Joe Biden and Bernie Sanders during their runs for President of the United States. His step-father is civil rights activist, lawyer and speechwriter for Martin Luther King, Jr. Clarence B. Jones. ==Filmography== Year Title Role Notes 1992 Malcolm X JFK Reporter 1992 The Bodyguard Skip Thomas 1992 Hoffa Government Attorney 1994 The Hudsucker Proxy Mailroom Screamer 1994 Speed Train Driver 1994 Major League II Commercial Director 1995 Tank Girl Trooper in Trench 1995 Rough Magic Marvin Wiggins 1995 Se7en Mark Swarr 1996 City Hall Larry Schwartz 1996 The Arrival Calvin 1996 The Trigger Effect Gun Shop Clerk 1996 Michael Italian Waiter 1997 Touch Jerry 1997 Volcano Haskins 1997 The Lost World: Jurassic Park Eddie Carr 1998 Dr. Dolittle Gene Reiss 1998 Living Out Loud Phil 1998 Deep Impact Don Beiderman 1999 Forces of Nature Joe 1999 Crazy in Alabama Norman 2000 Gun Shy Elliot 2000 Whatever It Takes P.E. Teacher 2001 I Am Sam Mr Turner 2001 What's the Worst That Could Happen? Walter Greenbaum 2002 People I Know Elliot Sharansky 2004 Ray Jerry Wexler 2004 With It Virgil LaRocca Short film 2006 Civic Duty Tom Hilary 2007 Waiting John Short film 2007 Martian Child Mr Lefkowitz 2009 Imagine That Carl Simons 2009 Solitary Man Steve Heller 2009 Another Harvest Moon Jeffery 2010 The Infidel Lenny Goldberg 2010 Made in Dagenham Robert Tooley 2011 Johnny English Reborn Titus Fisher 2012 Knife Fight Dimitris Vargas 2013 Decoding Annie Parker Mr Allen 2013 The Frozen Ground Roy Hazelwood 2013 Man of Steel Emil Hamilton 2014 Kill the Messenger Richard Zuckerman/Walter Pincus 2014 The Gambler Jeweler 2014 Before I Disappear Bruce Warham 2015 The Automatic Hate Ronald Green 2015 Entourage Himself 2015 Take Me to the River Don 2016 American Fable Jonathan 2017 The Men (Alien Code) Miles Driskoll 2017 Shock and Awe The Usual 2017 Geostorm Senator Thomas Cross 2019 Clemency Marty Lumetta ==References== ==Other websites== *Richard Schiff homepage * Category:1955 births Category:Actors from New York City Category:Actors from Maryland Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American television directors Category:American television producers Category:Emmy Award winning actors Category:People from Bethesda, Maryland",
 "title": "Richard Schiff"
}