{
 "id": "357178",
 "text": "David Stephen Caruso (born January 7, 1956) is an American movie and television actor, who is especially known by his acting in NYPD Blue. He also performed in the 1995 movies Kiss of Death and Jade. From 2002 to 2012, he starred on the TV series CSI: Miami in the role of Lieutenant Horatio Caine. ==Early life and career== Caruso's parents were Italian-Irish. His mother Joan, was a librarian. His father, Charles Caruso, was an editor. His father left the family when he was two years old. He went to Our Lady Queen of Martyrs Catholic School in Forest Hills and afterward to Archbishop Molloy High School. He graduated in 1974. He worked as an usher in cinemas. His role models were Humphrey Bogart, James Cagney and Edward G. Robinson. His first film appearance was in the film Getting Wasted in the role of Danny. Afterwards, he was in supporting roles like First Blood, An Officer and a Gentleman, Blue City, Thief of Hearts, China Girl and Twins. His first main role was on the TV series NYPD Blue as Detective John Kelly in 1993. He received a Golden Globe Award for this role. ==Personal life== Caruso was married three times and has three children. His first wife was Cheri Maugans. He was married from 1979 to 1984 with her. He married the American actress Rachel Ticotin in 1984. They got a daughter Greta, who was born on June 1, 1984. They separated in 1991. His third wife was Magaret Buckley. They were married from 1996 to 2004. He has two more children with his former ex- girlfriend Liza Marquez. His son Marquez Antonio was born on September 15, 2005 and his daughter Paloma was born on October 16, 2007. ==Television and movie roles== Year Movie/Program Role Notes 1980 Getting Wasted Danny Without Warning Tom 1982 An Officer and a Gentleman Topper Daniels First Blood Deputy Mitch 1981–1983 Hill Street Blues Tommy Mann 1983 T.J. Hooker Jennings 1984 Thief of Hearts Buddy Calamara The First Olympics: Athens, 1896 James Connolly 1986 Blue City Joey Rayford 1987 China Girl Mercury 1988 Twins Al Greco 1990 King of New York Dennis Gilley Rainbow Drive Larry Hammond 1991 Hudson Hawk Kit Kat Mission of the Shark: The Saga of the U.S.S. Indianapolis Wilkes 1993 Mad Dog and Glory Mike 1993–1994 NYPD Blue Detective John Kelly Golden Globe Award for Best Actor in a Drama Series Nominated — Primetime Emmy Award for Outstanding Lead Actor in a Drama Series 1995 Kiss of Death Jimmy Kilmartin Jade David Corelli 1997 Michael Hayes Michael Hayes 1998 Body Count Hobbs 2000 Proof of Life Dino Nominated — Blockbuster Entertainment Awards 2001 Session 9 Phil Black Point John Hawkins 2002–2012 CSI: Miami Lieutenant Horatio Caine 2005 CSI: NY Lieutenant Horatio Caine 2009 CSI: Crime Scene Investigation 2010–2011 Rehab ==References== ==Other websites== * Category:Actors from New York (state) Category:American movie actors Category:American voice actors Category:American television actors Category:1956 births Category:Living people Category:Golden Globe Award winning actors",
 "title": "David Caruso"
}