{
 "id": "357173",
 "text": "Heather Marie TomOwens, Devin. \"In the Middle.\" http://www.soapoperadigest.com/content/middle-0 (born November 4, 1975 in Illinois) is an American actress who acts primarily in soap operas. She represented Victoria Newman in the CBS soap The Young and the Restless. She also acted in other soap operas. In August 2011, Tom said she was engaged to her partner of 15 years, James Achor. On September 17, 2011, the pair married. On May 19, 2012, it was said that the couple was expecting their first child together. Tom later said she was due around October and was expecting a boy. Her sister, Nicholle Tom, is also an actress. Heather Tom was born in Hinsdale, Illinois. ==Filmography== Film Film Film Film Year Movie Role Notes 1990 She'll Take Romance Caroline 1995 Deadly Whispers Kathy Acton 2004 Delusion Veronica Farrow 2005 Beyond the Ladies Room Door Jody 2006 The Rival Jennifer 2006 When We're Old and Love Means Nothing Sarah 2006 Undone Unknown 2007 City Teacher Marsha 2010 Stiffs Lauren 2010 Suicide Dolls Lexi 2010 The Putt Putt Syndrome Vicki Television Television Television Television Year Title Role Notes 1989 Who's The Boss Heather Harper One episode 1991–97 1997–2003 The Young and the Restless Victoria Newman Role from: February 1991 to April 1997 Role from: October 1997 to December 17, 2003 2003–06 One Life to Live Kelly Cramer Role from: December 11, 2003 to December 14, 2006 2004 SVU Dr. Solwey's Assistant One episode 2007 Monk Linda Riggs One episode 2007 The Wedding Bells Laurie Hill Two episodes 2007 The Bold and the Beautiful Katie Logan Spencer Role: August 30, 2007 to present 2008 Ugly Betty Holly One episode 2011 Criminal Minds Shannon's Mother One episode- \"From Childhood's Hour\" == Awards (Won) == ===Daytime Emmy Awards=== * (2012) Daytime Emmy Outstanding Lead Actress in a Drama Series for The Bold and the Beautiful * (2011) Daytime Emmy Outstanding Supporting Actress in a Drama Series for The Bold and the Beautiful * (1999) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless * (1993) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless ===Soap Opera Digest Awards=== *(1997) Soap Opera Digest Award Outstanding Younger Lead Actress for The Young and the Restless == Award (Nominated) == ===Daytime Emmy Awards=== *(2008) Daytime Emmy Outstanding Supporting Actress in a Drama Series for The Bold and the Beautiful *(2007) Daytime Emmy Outstanding Supporting Actress in a Drama Series for One Life to Live *(2005) Daytime Emmy Outstanding Supporting Actress in a Drama Series for One Life to Live *(2004) Daytime Emmy Outstanding Supporting Actress in a Drama Series for The Young and the Restless *(2000) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless *(1998) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless *(1997) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless *(1996) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless *(1995) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless *(1994) Daytime Emmy Outstanding Younger Actress in a Drama Series for The Young and the Restless == References == Category:People from Hinsdale, Illinois Category:American movie actors Category:American television actors Category:Actors from Illinois Category:1975 births Category:Living people",
 "title": "Heather Tom"
}