{
 "id": "357359",
 "text": "The Curiosity rover is a robotic car-sized Mars rover. It is exploring Gale Crater, which is near the equator of Mars. The rover uses nuclear power and is part of NASA's Mars Science Laboratory (MSL). The MSL mission has four main scientific goals: study Martian climate and geology, search for water, and find out whether Mars could have ever supported life. Curiosity carries the most advanced scientific equipment ever used on the surface of Mars. Curiosity is the fourth NASA surface rover sent to Mars in 16 years. Curiosity is also the heaviest robotic wheeled vehicle (at 900 kg) to have ever landed on Mars (The Soviet Union's Lunokhod 2 lunar rover (1800) used to be the largest with 840 kg). Curiosity was launched from Cape Canaveral on November 26, 2011 at 10:02 EST. It successfully landed on Aeolis Palus in Gale Crater on Mars on August 6, 2012, 05:21:27 UTC. In December 2012, Curiosity two-year mission was extended indefinitely. \"Curiosity's mission extended indefinitely\". 3 News NZ. December 6, 2012. Archived from the original on April 6, 2013. Retrieved December 5, 2012. On August 7, 2017, NASA celebrated the fifth anniversary of the Curiosity rover landing and related exploratory accomplishments on the planet Mars. The rover is still operational, and as of , Curiosity has been on Mars for sols ( total days) since landing on August 6, 2012. Curiosity design served as the basis for the Mars 2020 rover that was landed on Mars in 18 February 2021. == Goals == The main scientific goals of the MSL mission is to search whether Mars could ever have supported life or water and to study the climate and geology of Mars. The Curiosity rover has six main scientific objectives: # Search for minerals found on the crater surface and near-surface geological materials. # Detect signs of life # Study the many processes that have formed and changed rocks and soils. # Study the atmosphere of Mars # Observe the movement and cycles of water and carbon dioxide. # Investigate the surface radiation, including cosmic radiation, and radiation of protons and neutrons. == Landing site == The rover's landing was planned for a small region of Aeolis Palus within Gale crater. Gale crater is an about 2 billion- years-old impact crater on Mars. It was filled with sediments by water and wind. Later, wind erosion removed all sediments, leaving a 5.5 km (3.4 mile) high mountain (Mount Sharp). The crater is 154 km (94 mi) wide. The crater was chosen because it may allow for the study of two billion years of Martian history. The landing site is also near an alluvial fan. The alluvial fan is believed to be the result of a flow of ground water. == Coverage and popular culture == NASA collected more than 1.2 million names from people who sent their names from 2009 to 2011. Their names are on a microchip which is located on the deck of Curiosity. Live videos showing the first footage from the surface of Mars was available at NASA TV. It was shown live during the night of August 5, 2012. The NASA website became unavailable because of the large number of people visiting it. A 13-minute NASA video of the landing, on YouTube, also became unavailable for several hours. A robotic DMCA notice was sent from Scripps Local News who prevented access. Around 1,000 people gathered in New York City's Times Square, to watch NASA's live broadcast of Curiositys landing. ==Geology== The Curiosity rover has three scoops which can dig up the soil on Mars so it can be studied. These scoops are kept clean by using Martian sand as an abrasive cleaner. Soil samples are studied inside Curiosity using a chemistry and mineralogy instrument called CheMin. CheMin uses X-ray diffraction to discover what minerals are in the soil samples. This information is then sent back to Earth. == References == == Other websites == * Curiosity Rover - Home Page - NASA/JPL * MSL - NASA News Briefings - *LIVE* Daily At 1pm/edt/usa (NASA-TV) * MSL - NASA News Briefings - *REPLAY* Anytime (NASA-YouTube) * MSL - NASA Image Gallery * MSL - \"Curiosity Has Landed\" (08/06/2012) - NASA/JPL - Video (02:24) * MSL - \"Curiosity Descent\" (08/06/2012) - NASA/JPL - Video (01:03) * MSL - Landing (\"7 Minutes of Terror\") - NASA/JPL - Video (05:08) * MSL - Landing (EDL/EntryDescentLanding) - Animated Video (02:00) * MSL - Landing Site - Gale Crater - Animated/Narrated Video (02:37) * MSL - Landing Site - Gale Crater - Google Mars (zoomable map) * Curiosity Rover - Virtual Tour - NASA/JPL Category:Mars Category:NASA spacecraft Category:2011 Category:2012 in technology Category:Planetary rovers Category:Spacecrafts launched in 2010s",
 "title": "Curiosity rover"
}