{
 "id": "35735",
 "text": "Sergei Vasilievich Rachmaninoff (; pronounced rahk-MAH-nin-off) was a famous Russian composer and pianist. He was born on April 1, 1873 (N.S.) and passed away from a melanoma on March 28, 1943. Because the Russian language uses an alternative alphabet, his name is sometimes spelled in different ways in English (“Sergei” or “Sergey”, and “Rachmaninoff”, “Rachmaninov”, “Rakhmaninov” or “Rakhmaninoff”). \"Sergei Rachmaninoff\" is the way he spelled his own name when he resided in the United States. Rachmaninoff is widely considered to be one of the greatest pianists of the 20th century. He could play extremely difficult compositions and had very large hands, enabling him to play chords with notably large stretches. It has been said that he could play a 13th. Rachmaninoff was also a very tall man for the time in which he lived, standing at approximately . Rachmaninoff is considered to be a superb composer, writing very well in the Romantic style, even though he lived most of his adult life in the 1900s (whereas the Romantic style period is usually said to have ended around 1910). His music is characterized by vivid, lyrical melodies that are highly memorable. His piano compositions are among the most difficult to play on the keyboard. ==Life== Rachmaninoff was born in Semyonovo, near Novgorod in the north-west of Russia. Members of his family were said to be important people who had been in the service of the tsars of Russia. Rachmaninoff’s parents played the piano. They arranged for him to take piano lessons in Saint Petersburg and then Moscow. While he was still a student, Rachmaninoff wrote a short opera called Aleko. He also wrote some piano pieces including a Prelude in C sharp minor, characterised by loud, heavy chords. This specific piece later became extremely famous and is still very popular today. Interestingly, it was said that Rachmaninoff used to feel “fed up” with people asking him to play the piece. Not all of his music was well-liked at first. The critics thought that his First Symphony was of poor quality. This may have been because the orchestra played it so badly that some of Rachmaninoff's friends thought the conductor was drunk, yet the reaction from the general public contributed to Rachmaninoff composing a lot less for a while afterwards. After some years of feeling depressed, he wrote his Second Piano Concerto. The general reception to this piece was positive and it became very well-liked. It is now one of his most popular compositions. Rachmaninoff later became happier. He was permitted to marry a woman named Natalia Satina after years of engagement, during which the Russian Orthodox Church did not want them to be married. The political conditions within Russia at this time were tense, so Rachmaninoff lived in Germany and Italy for a period of time. After the Russian Revolution of 1917, he decided to leave his country of birth and never returned. Rachmaninoff had been very successful with his Third Piano Concerto in the United States, so he went to embark upon living in the United States in 1918. Russia had since become the Soviet Union, and for many years Rachmaninoff’s music was not accepted nor allowed to be performed there. This worried him a lot whilst he was in the United States and he often felt homesick. Rachmaninoff did not write very much music during the rest of his life residing in the United States. However, one piece that did become very popular was Rhapsody on a Theme of Paganini, which he wrote in Switzerland in 1934. Sadly, in March 1943, Rachmaninoff passed away as a result of a melanoma in Beverly Hills, California. == Music == Rachmaninoff’s piano music is mostly difficult to play. He wrote many short pieces called preludes, and some studies which are considered to be very hard. As well as the Rhapsody on a Theme of Paganini he wrote four piano concertos. The Second and Third are very popular today, as is his Second Symphony. The second concerto reaches the lowest C on the piano, making it one of the lowest pieces of music (this is lower than a bass, which goes down to D). He wrote some very beautiful choral music which includes a piece for choir and orchestra called The Bells and a very long, religious work called the All-Night Vigil (sometimes called the Vespers). He wrote some chamber music including a cello sonata. There are several excellent recordings of Rachmaninoff playing his own music. Most of these are available now on CD reissues. == Other websites == * Sergei Rachmaninoff Site ==References== Category:20th-century composers Category:Cancer deaths in Los Angeles County, California Category:Deaths from melanoma Category:Romantic composers Category:Russian composers Category:Russian pianists Category:1873 births Category:1943 deaths",
 "title": "Sergei Rachmaninoff"
}