{
 "id": "357340",
 "text": "is a Japanese football player. She played for the Japan national team. She used her name Yuki Ogimi (大儀見 優季) from 2012 to 2016. Her brother Genki Nagasato and sister Asano Nagasato are former footballers. ==Biography== Nagasato was born in Atsugi on July 15, 1987. In 2001, she was promoted to Nippon TV Beleza from the youth team. In the 2002 season, she debuted in Nadeshiko League. She became one of the division's top scorers in 2006 season. She also won the league championship 6 times (2001, 2002, 2005, 2006, 2007 and 2008). In 2010, Nagasato moved to Turbine Potsdam in Germany, where she won the Bundesliga's leading goal-scorer award. She also won the UEFA Champions League with that team. In 2013, she transferred to the English FA WSL club Chelsea. She joined Wolfsburg in early 2015 to play in a stronger league for the 2015 World Cup. In August 2015, Nagasato joined Frankfurt. On May 24, 2017 it was announced that she had signed with the Chicago Red Stars of the National Women's Soccer League (NWSL), she appeared in only 6 games in 2017 due to injury. In 2018 she was named Player of the Week for week 10. In October 2018, Nagasato signed with Brisbane Roar on loan for the 2018–19 season. On September 10, 2020, Nagasato made history by becoming the first woman to play for Hayabusa Eleven, a men's team in the Kanagawa Prefecture League; she joined on loan until prior to the beginning of the 2021 NWSL season. On October 26, 2020, newly-formed club Racing Louisville FC announced Nagasato as one of their first signings for the 2021 season. In April 2004, Nagasato was selected the Japan national team for Football at the 2004 Summer Olympics – Women's tournament qualification. At this competition, on April 22, she debuted against Thailand. She was also part of Japan's 2008 Summer Olympic team and 2007 World Cup. Nagasato was part of the Japan squad that won the 2011 World Cup. She played as a substitute in the final against the United States. The game went to penalties and Nagasato had her penalty saved by Hope Solo, but Japan still emerged victorious. Since 2016, she wore the number 10 shirt for Japan, after Homare Sawa retired at 2016 Summer Olympics qualifying. After the tournament, new Japan's manager Asako Takakura gave the number 10 to Mizuho Sakaguchi and Nagasato wore the number 9.Japan Football Association ==Personal life== Nagasato married in July 2011On July 27, 2011 at Official site and changed her registered name from \"Nagasato\" to \"Ogimi\" before the 2012 Summer Olympics. Upon her divorce in 2016, she re-assumed her maiden name. ==Statistics== Club Season League Cup League Cup Continental Total Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Nippon TV Beleza 2001 0 0 - - 2002 2 0 - - 2003 0 0 2 0 - - 2 0 2004 13 3 - - 2 0 2005 21 18 5 6 - - 26 24 2006 16 18 3 2 - - 19 20 2007 18 14 4 1 2 3 - 24 18 2008 20 9 3 2 - - 23 11 2009 20 7 4 5 - - 24 12 Total 110 69 2 3 - Turbine Potsdam 2009–10 10 6 1 0 - 5 2 16 8 2010–11 21 10 5 6 1 3 8 9 35 28 2011–12 9 8 2 2 2 5 13 15 Total 40 24 8 8 1 3 15 16 64 51 Career total 150 93 3 6 15 16 Japan Football AssociationList of match in 2010, 2011, 2012, 2013, 2014, 2015, 2016 at Japan Football Association Japan national team Year Apps Goals 2004 1 0 2005 9 6 2006 13 9 2007 12 4 2008 17 9 2009 3 0 2010 3 1 2011 17 3 2012 16 9 2013 12 6 2014 9 5 2015 13 3 2016 7 3 Total 132 58 ==References== ==Other websites== * *Japan Football Association Category:1987 births Category:Living people Category:Footballers from Kanagawa Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Nippon TV Tokyo Verdy Beleza players Category:Footballers at the 2008 Summer Olympics Category:Footballers at the 2012 Summer Olympics Category:2007 FIFA Women's World Cup players Category:2011 FIFA Women's World Cup players Category:2015 FIFA Women's World Cup players Category:2006 AFC Women's Asian Cup players Category:2008 AFC Women's Asian Cup players Category:2010 AFC Women's Asian Cup players Category:2014 AFC Women's Asian Cup players Category:Footballers at the 2006 Asian Games Category:Olympic medalists in football Category:Olympic silver medalists for Japan Category:Medalists at the 2012 Summer Olympics Category:FIFA Women's World Cup-winning players Category:AFC Women's Asian Cup-winning players Category:Asian Games medalists in football Category:Asian Games silver medalists for Japan Category:Medalists at the 2006 Asian Games",
 "title": "Yuki Nagasato"
}