{
 "id": "357499",
 "text": "is a Japanese football player. She plays for the Japan national team. ==Biography== Iwabuchi began her international career in 2008 when she was selected for the Japan U-17 national team at the age of 15, and participated in the 2008 U-17 World Cup in New Zealand. The team was defeated in the quarterfinals but she was named the tournament's MVP (adidas Golden Ball).Perfect tens strike gold , FIFA.com A French team coach hailed her as a \"future star of women's football.\"Japan's Mana from heaven , FIFA.com Iwabuchi was also awarded the \"Asian Young Footballer of the Year\" by the Asian Football Confederation in 2008. She joined the Japan national team for the EAFF Championship, held in early 2010, and debuted in the game against China. She scored her first goal against the Chinese Taipei in the same competition. In 2011, she played at the 2011 World Cup and Japan won the competition. She played as a substitute in the final against United States. She also played 2012 Summer Olympics and 2015 World Cup. Japan got second place at both tournaments. In 2018, at 2018 Asian Cup, she played in all matches and scored 2 goals. Japan won the championship and she was selected for the MVP award.AFC ==Statistics== Club Season League Cup League Cup Total Apps Goals Apps Goals Apps Goals Apps Goals Nippon TV Beleza 2007 1 0 - 5 3 6 3 2008 7 3 4 2 - 11 5 2009 17 5 3 3 - 20 8 2010 18 8 1 0 5 2 24 10 2011 13 9 3 1 - 16 10 Career Total 56 25 17 10 10 5 83 40 List of match in 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020 at Japan Football Association Japan national team Year Apps Goals 2010 3 2 2011 8 0 2012 4 0 2013 5 0 2014 5 1 2015 5 1 2016 7 4 2017 6 3 2018 18 9 2019 8 7 2020 3 2 Total 72 29 ==References== ==Other websites== * *Japan Football Association Category:1993 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Nippon TV Tokyo Verdy Beleza players Category:INAC Kobe Leonessa players Category:Footballers at the 2012 Summer Olympics Category:2011 FIFA Women's World Cup players Category:2015 FIFA Women's World Cup players Category:2019 FIFA Women's World Cup players Category:2018 AFC Women's Asian Cup players Category:Footballers at the 2018 Asian Games Category:Olympic medalists in football Category:Olympic silver medalists for Japan Category:Medalists at the 2012 Summer Olympics Category:FIFA Women's World Cup-winning players Category:AFC Women's Asian Cup-winning players Category:Asian Games medalists in football Category:Asian Games gold medalists for Japan Category:Medalists at the 2018 Asian Games",
 "title": "Mana Iwabuchi"
}