{
 "id": "357491",
 "text": "is a Japanese football player. She played for the Japan national team. ==Biography== Ando was born in Utsunomiya on 9 July 1982. In 2002, when she was a University of Tsukuba student, she left university club and joined Saitama Reinas FC (later Urawa Reds). In 2002 season, she scored 10 goals and she was selected Young Player awards. She became top scorer and she was selected MVP awards in 2004 and 2009. She was also selected Best Eleven 6 times. From 2010, she played for German Bundesliga club Duisburg, Frankfurt and Essen. At Frankfurt, she won UEFA Champions League in 2014–15 season. In June 2017, she returned to Japan and joined Urawa Reds. In June 1999, when Ando was 16 years old, she was selected for the Japan national team for the 1999 World Cup. At this competition, on 26 June, she debuted against Norway. She played in the World Cup four times and in the Summer Olympics three times. She was a member of the team that defeated the United States in a penalty shootout in the final to win the 2011 World Cup; Ando started the final. She was also part of the Japanese team which won the silver medal at the 2012 Summer Olympics and second place at the 2015 World Cup. At the 2015 World Cup, in the first match against Switzerland, she got a penalty kick, but she fractured her left ankle at that moment. This match was her last as part of the Japan national team. She played 126 games and scored 19 goals for Japan by 2015. ==Statistics== Japan Football AssociationList of match in 2010, 2011, 2012, 2013, 2014, 2015 at Japan Football Association Japan national team Year Apps Goals 1999 1 0 2000 5 0 2001 0 0 2002 5 0 2003 1 2 2004 6 1 2005 9 1 2006 16 3 2007 9 0 2008 16 3 2009 3 1 2010 8 6 2011 18 0 2012 13 0 2013 5 1 2014 4 0 2015 7 1 Total 126 19 ==References== ==Other websites== * *Japan Football Association Category:1982 births Category:Living people Category:Footballers from Tochigi Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Urawa Red Diamonds Ladies players Category:Footballers at the 2004 Summer Olympics Category:Footballers at the 2008 Summer Olympics Category:Footballers at the 2012 Summer Olympics Category:1999 FIFA Women's World Cup players Category:2007 FIFA Women's World Cup players Category:2011 FIFA Women's World Cup players Category:2015 FIFA Women's World Cup players Category:2006 AFC Women's Asian Cup players Category:2008 AFC Women's Asian Cup players Category:2010 AFC Women's Asian Cup players Category:Footballers at the 2006 Asian Games Category:Olympic medalists in football Category:Olympic silver medalists for Japan Category:Medalists at the 2012 Summer Olympics Category:FIFA Women's World Cup-winning players Category:Asian Games medalists in football Category:Asian Games silver medalists for Japan Category:Medalists at the 2006 Asian Games",
 "title": "Kozue Ando"
}