{
 "id": "357592",
 "text": "The eyelash viper (Bothriechis schlegelii) is a venomous pit viper found in Central and South America. Small and living in trees, the snakes has a lot of color variations. Note the superciliary scales above the eyes. It is the most common of the green palm-pitvipers (genus Bothriechis).Lewis, Robert Alan 1998. Lewis' Dictionary of Toxicology. CRC Press, p187. ISBN 978-1-56670-223-2 == Description == The eyelash viper is a small species of snake, and rarely ever grows longer than the length of . Females are larger than males. It gets the name \"eyelash viper\" because it has a small group of scales over its eyes which make it look like the snake has eyelashes. The eyelash viper comes in many colors like green, yellow, red, brown or even pink. == Behavior == Like other snakes of the genus Bothriechis, this species is arboreal, meaning it lives in trees. The eyelash viper is nocturnal. It is not known to be aggressive, but if annoyed or disturbed it doesn't hesitate to strike. The viper is viviparous, meaning it gives live birth. It gives birth to around 10 to 12 young at a time. When they are born, young vipers are inches long. === Feeding === Eyelash vipers capture their prey by ambushing. They feed on small rodents, small birds, frogs, and lizards. == Common names == The eyelash viper is also known as the 'eyelash mountain viper\", the \"horned palm viper\", Schlegel's viper\", and the \"eyelash palm-pit viper\". It is also known as the \"bocaracá\" in Costa Rica and other Central and South American countries. == Where they live == The eyelash viper is found in southern Mexico, southeastward to the Atlantic lowlands, through Central America to northern South America in Colombia and Venezuela. It is also found in parts of Costa Rica, Panama, Ecuador, and Peru. === Habitat=== The viper likes to live in humid, tropical areas not far from water. ==References== Category:Vipers Category:Snakes of North America Category:Reptiles of South America",
 "title": "Eyelash viper"
}