{
 "id": "357642",
 "text": "Zachary Edward \"Zack\" Snyder (born March 1, 1966Zack Snyder Biography at Tribute.ca) is an American director, screenwriter, and producer, best known for action/science fiction movies. ==Career== After making his career debut with the 2004 remake Dawn of the Dead, he gained wide recognition with the 2007 box office hit 300, adapted from writer-artist Frank Miller's Dark Horse Comics miniseries of 300, and later went on to direct the 2009 superhero film Watchmen, an adaptation of the Watchmen a comic book of the same name. He is the co-founder of Cruel and Unusual Films, a production company he established in 2004, alongside his wife Deborah Snyder and producing partner Wesley Coller. His first family film was the 2010 animated family adventure film Legend of the Guardians: The Owls of Ga'Hoole, based on the first three books of the series by Kathryn Lasky. He directed Sucker Punch. In recent years, he directed Man of Steel, Batman v Superman: Dawn of Justice and Justice League. After Joss Whedon replaced him in Justice League, fans petitioned Warner Bros. to release Snyder's version of the movie. In May 2020, his version, titled Zack Snyder's Justice League, will be released in 2021. ==Personal life== Snyder was born on March 1, 1966 in Green Bay, Wisconsin. He has been married to Deborah Snyder since 2004. In March 2017, Snyder's daughter committed suicide, forcing Snyder to drop out from the Justice League production. ==Movies== Year Film Director Producer Writer Distributor(s) 2004 Dawn of the Dead Universal Pictures 2007 300 Warner Bros. Pictures 2009 Watchmen Warner Bros. Pictures and Paramount Pictures 2010 Legend of the Guardians: The Owls of Ga'Hoole Warner Bros. Pictures 2011 Sucker Punch Warner Bros. Pictures 2013 Man of Steel Warner Bros. Pictures 2013 Army of the Dead Universal Pictures and Warner Bros. Pictures 2014 300: Rise of an Empire TBC 2016 Batman v Superman: Dawn of Justice Warner Bros. Pictures 2017 Wonder Woman Warner Bros. Pictures 2017 Justice League Warner Bros. Pictures 2021 Zack Snyder's Justice League Warner Bros. Pictures and HBO Max ===Music videos=== * \"Tomorrow\" performed by Morrissey (1992) * \"World Class Fad\" performed by Paul Westerberg (1993) * \"I Know\" performed by Dionne Farris (1994) * \"Walk This World\" performed by Heather Nova (1995) * \"Desolation Row\" performed by My Chemical Romance (2009) ==References== ==Other websites== * Category:1966 births Category:Living people Category:American movie actors Category:Movie directors from Wisconsin Category:Screenwriters from Wisconsin Category:Actors from Wisconsin Category:Movie producers from Wisconsin Category:Saturn Award winners Category:People from Green Bay, Wisconsin",
 "title": "Zack Snyder"
}