{
 "id": "35789",
 "text": "SUSE is a main version of a Linux distribution, produced in Germany and owned by Attachmate Group. SUSE is also a founding member of the Desktop Linux Consortium. Starting from version \"10.2 Alpha 3\" its official name is openSUSE. The current mascot of SUSE is a chameleon called \"Geeko\". ==History== The SUSE Linux distribution was originally a German translation of Slackware Linux. The Slackware distribution was founded by Peter MacDonald, and was the first distribution to contain X and TCP/IP. S.u.S.E was founded in 1992 as a UNIX speaking group, which among other things regularly released software packages that included SLS and Slackware, and printed UNIX/Linux manuals. In 1994 the group released the first CD version of SLS/Slackware, under the name \"S.u.S.E Linux 1.0.\" Then in 1996, SuSE Linux gained many aspects from Red Hat Linux. The name \"SUSE Linux\" came in September 2003. On 4 November 2003, Novell announced it would buy SuSE. They planned to release the administration program YaST2 under the GPL license and add a community project, openSUSE. The openSUSE desktop environment can be GNOME or KDE. Most parts of the program were \"open\"--not completely, but more than before. The version \"10.0\" was the first version that had public beta testing. The philosophy changed from before. There were multiple versions of the \"10.0\" Linux distribution for download. They are \"OSS\" (completely open source), with all programs \"free\" and without proprietary softwares, and \"eval\" (has both open source and proprietary applications). ==Versions== Main Versions 1.0 - April 1994 1.0.9 - July 1994 11/94 - November 1994 4/95 - April 1995 8/95 - August 1995 11/95 - November 1995 4.2 - May 1996 4.3 - September 1996 4.4 - May 1997 4.4.1 - February 1997 5.0 - June 1997 5.1 - November 1997 5.2 - 23 March 1998 5.3 - 10 September 1998 6.0 - 21 December 1998 6.1 - 7 April 1999 6.2 - 12 August 1999 6.3 - 25 November 1999 6.4 - 27 March 2000 7.0 - 27 September 2000 7.1 - 24 January 2001 7.2 - 15 June 2001 7.3 - 13 October 2001 8.0 - 22 April 2002 8.1 - 30 September 2002 8.2 - 7 April 2003 9.0 - 15 October 2003 9.1 - 23 April 2004 9.2 - 25 October 2004 9.3 - 16 April 2005 10.0 - 6 October 2005 10.1 - 11 May 2006 10.2 - 7 December 2006 10.3 - 4 October 2007 ==Official website== * SUSE Category:Linux distributions",
 "title": "SuSE Linux"
}