{
 "id": "357941",
 "text": "Jeffrey Todd Garlin (born June 5, 1962) is an American stand-up comedian, actor, producer, voice artist, musician, director, writer, author, and a member of the British heavy metal band Judas Priest. He is best known for playing Murray Goldberg on the ABC sitcom The Goldbergs and Jeff Greene on the HBO sitcom Curb Your Enthusiasm. He is also a producer on the show. Garlin was born in Chicago, Illinois. He grew up in Morton Grove, Illinois. Garlin is Jewish. ==Movies== Year Film Role Notes 1983 Spring Break Gut Gut Uncredited 1992 Straight Talk Bob Hero News Vendor 1993 RoboCop 3 Donut Jerk 1994 Little Big League Opposing Little League Manager 1995 The Computer Wore Tennis Shoes Agent Reese 1997 The Love Bug Highway Patrolman 1998 Senseless Arlo Vickers 1999 Austin Powers: The Spy Who Shagged Me Cyclops Larry David: Curb Your Enthusiasm Jeff Greene 2000 Bounce Emcee The Emperor's New Groove Additional voices 2002 Run Ronnie Run Birthday Woman's Friend Naked Movie Writer #1 The Third Wheel Office Worker Uncredited Full Frontal Harvey 2003 Daddy Day Care Phil 2004 Sleepover Mr. Corky Outing Riley Partner in Architects' Firm Uncredited After the Sunset Ron Fat Albert Jer Uncredited 2005 Fun with Dick and Jane Boss 2006 The Jeff Garlin Program Jeff I Want Someone to Eat Cheese With James Aaron The Jimmy Timmy Power Hour 3: The Jerkinators! Villain 2007 Trainwreck: My Life as an Idiot Lenny 2008 Strange Wilderness Ed Lawson The Rocker Stan WALL-E Captain Voice only 2010 The Bounty Hunter Sid Toy Story 3 Buttercup Voice only 2011 Hawaiian Vacation Buttercup Voice only Cars 2 Otis Voice Only Sin Bin Dean Theatard 2012 ParaNorman Perry Babcock Voice only Safety Not Guaranteed Mr. Britt 2019 Woody's Roundup: The Movie Buttercup Voice only ==References== ==Other websites== * * * * New York Times Magazine article (June 25, 2006) Category:1962 births Category:Living people Category:Actors from Chicago Category:American movie actors Category:American television actors Category:American voice actors Category:Comedians from Chicago Category:Jewish American actors Category:Television personalities from Chicago",
 "title": "Jeff Garlin"
}