{
 "id": "357938",
 "text": "Kurt Kasznar (born Kurt Servischer; August 12, 1913 - August 6, 1979) was a stage, movie and television actor. His movies include: Waiting for Godot, The Sound of Music and Barefoot in the Park. Kasznar was born in Vienna, Austria- Hungary. He married American heiress Cornelia Woolley. This was after her 1939 divorce from her second husband.Winchell, Walter, Walter Winchell On Broadway, syndicated column, Palm Beach Daily News, March 21, 1939. \"Transcontinental Romance Nears Altar in Los Angeles,\" Los Angeles Times, June 27, 1939 She died at home unexpectedly in June 1948, at age 48. At the time, Kasznar was performing in John Houseman's Broadway production of Joy to the World.Mrs. Kurt S. Kasznar (obituary), The New York Times, June 21, 1948 Kasznar met his second wife, actress Leora Dana, when they worked together in the Broadway production of The Happy Time (1950). That marriage ended in divorce. Kasznar died August 6, 1979, in Santa Monica, California. This was 10 months after being diagnosed with cancer. He had no known survivors. ==Movies== *Talk About a Stranger (1952) *The Happy Time (1952) *Lili (1953) *Ride, Vaquero! (1953) *Kiss Me Kate (1953) *All the Brothers Were Valiant (1953) *Give a Girl a Break (1953) *Valley of the Kings (1954) *The Last Time I Saw Paris (1954) *My Sister Eileen (1955) *Anything Goes (1956) *A Farewell to Arms (1957) *Legend of the Lost (1957) *Arms and the Man (1958) *The Journey (1959) *For the First Time (1959) *55 Days at Peking (1963) *Casino Royale (1967) *The Perils of Pauline (1967) *The Ambushers (1967) ==References== ==Other websites== * * * Kurt Kasznar biography at the Irwin Allen News Network website Category:1913 births Category:1979 deaths Category:American movie actors Category:American stage actors Category:American television actors Category:Naturalized citizens of the United States Category:Cancer deaths in Los Angeles County, California Category:Actors from Vienna",
 "title": "Kurt Kasznar"
}