{
 "id": "357928",
 "text": "Theodore Anthony \"Ted\" Nugent (born December 13, 1948) is an American musician, singer and songwriter. He was born in Detroit, Michigan. He moved to Palatine, Illinois during his teens. He has had many hit records as a member of different music groups. He has also had hit songs as a solo musician. Nugent started playing music as the guitarist for The Amboy Dukes in 1963. After the band ended, he started making music by himself. His first three albums, Ted Nugent (1975), Free-for-All (1976) and Cat Scratch Fever (1977), were very successful. They were certified platinum by the RIAA. His most popular songs are \"Stranglehold\" and \"Cat Scratch Fever\". In the 1980s and 1990s he was a member of Damn Yankees, a supergroup. Nugent is also known for talking about his conservative opinions about politics. He is a supporter of gun rights, and a member of the National Rifle Association. In 2012, the Secret Service investigated Nugent because of things he said about President Barack Obama.Rolling Stone, August 24, 2007, Elizabeth Goodman, Ted Nugent Threatens to Kill Barack Obama and Hillary Clinton During Vicious Onstage Rant , Retrieved April 8, 2018, \"....Renegade right-winger Ted Nugent recently went on a vicious onstage rant in which he threatened the lives of Democratic presidential candidates Barack Obama and Hillary Clinton....\"Alessia Grunberger, April 7, 2018, CNN, Ted Nugent likens Democrats, media, academics to 'rabid coyotes', Retrieved April 8, 2018, \"...\"So come to that realization,\" he continued. \"There are rabid coyotes running around, you don't wait till you see one to go get your gun, keep your gun handy. And every time you see one, shoot one.\"...\" == References == Category:American rock singers Category:American rock guitarists Category:American singer-songwriters Category:Musicians from Detroit Category:Musicians from Illinois Category:Singers from Detroit Category:Singers from Illinois Category:1948 births Category:Living people",
 "title": "Ted Nugent"
}