{
 "id": "357975",
 "text": "is a Japanese football player. She played for the Japan national team. ==Biography== Kinga was born in Yokohama on May 2, 1984. After graduating from Shonan Gakuin High School, she joined Nippon TV Beleza in 2003. She was playing as attacking midfielder and right-winger. In 2003 season, she was selected Best Young Player awards. From 2007, she was converted to right- sideback. The club won Nadeshiko League championship 5 times. In 2011, she moved to INAC Kobe Leonessa with international player Homare Sawa, Shinobu Ohno and Chiaki Minamiyama for due to financial strain at the club. At INAC Kobe Leonessa, the club won Nadeshiko League championship for 3 years in a row (2011–2013). She was selected Best Eleven for 6 years in a row (2007–2012). In 2014, she moved to Arsenal. She re-signed with INAC Kobe Leonessa in early 2015. From 2016, she played for Canberra United, Melbourne City and Orca Kamogawa FC. In 2021, she signed with new club, Sanfrecce Hiroshima Regina.Sanfrecce Hiroshima In August 2002, Kinga was selected by the Japan U-20 national team for the 2002 FIFA U-19 Women's World Championship. On March 29, 2005, she debuted for the Japan national team against Australia. She was playing as attacking midfielder and right-winger. From 2007, she was converted to right-back by manager Hiroshi Ohashi and she became a regular player. Japan won the 2011 World Cup in which Kinga played in the final, came second in the 2015 World Cup and gained a silver medal in the 2012 Summer Olympics. She played 100 games and scored 5 goals for Japan until 2016. ==Statistics== Club Season League Cup League Cup Total Apps Goals Apps Goals Apps Goals Apps Goals Nippon TV Beleza 2003 20 6 4 4 - 24 10 2004 14 7 4 1 - 18 8 2005 18 6 5 2 - 23 8 2006 14 2 3 3 - 17 5 2007 21 3 4 0 2 1 27 4 2008 20 0 4 1 - 24 1 2009 21 3 4 0 - 25 3 2010 18 3 1 0 6 1 25 4 Total 146 30 29 11 8 2 183 43 INAC Kobe Leonessa 2011 16 1 4 0 - 20 1 Total 16 1 4 0 - 20 1 Career total 162 31 33 11 8 2 203 44 Japan Football AssociationList of match in 2010, 2011, 2012, 2013, 2014, 2015, 2016 at Japan Football Association Japan national team Year Apps Goals 2005 1 0 2006 2 0 2007 16 0 2008 18 1 2009 3 1 2010 15 2 2011 17 0 2012 15 1 2013 1 0 2014 4 0 2015 5 0 2016 3 0 Total 100 5 ==References== ==Other websites== * *Japan Football Association Category:1984 births Category:Living people Category:Footballers from Kanagawa Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Nippon TV Tokyo Verdy Beleza players Category:INAC Kobe Leonessa players Category:Footballers at the 2008 Summer Olympics Category:Footballers at the 2012 Summer Olympics Category:2007 FIFA Women's World Cup players Category:2011 FIFA Women's World Cup players Category:2015 FIFA Women's World Cup players Category:2008 AFC Women's Asian Cup players Category:2010 AFC Women's Asian Cup players Category:Footballers at the 2010 Asian Games Category:Olympic medalists in football Category:Olympic silver medalists for Japan Category:Medalists at the 2012 Summer Olympics Category:FIFA Women's World Cup-winning players Category:Asian Games medalists in football Category:Asian Games gold medalists for Japan Category:Medalists at the 2010 Asian Games Category:Sportspeople from Yokohama",
 "title": "Yukari Kinga"
}