{
 "id": "358002",
 "text": "John Elroy Sanford (much better known as Redd Foxx (December 9, 1922 - October 11, 1991) was a television program actor and stand up comedian who also starred in movies. He was born in St. Louis. He acted in numerous television sitcoms. Redd Foxx is one of the best-known comedians and actors of the late twentieth century. He was often vulgar, raunchy, and politically incorrect, but to millions of Americans, he was also the funniest person on television. His standup routines were huge hits, influencing scores of comedians to follow. His crass performances drew the ire of critics long before the likes of Eddie Murphy and Chris Rock, but the role that made his a household name was that of Fred Sanford on the show Sanford and Son. The TV show was a huge hit at a time when there were few black stars on television. Foxx's comedic talent was showcased early in life as he worked the nightclubs around St. Louis as a teenager. He left home at sixteen and got into trouble with the law on numerous occasions, especially after he joined a New York street gang. It was during this time that he befriended another up-and-coming black man who would later become known as Malcolm X. He worked every nightclub he could find as he developed his style during the early 1940s. Part of the reputation he developed in the clubs was that of a foul mouth, which was a big draw for some crowds but limited his appeal to larger audiences. He worked the so-called “chitlin’ circuit,” where black clubs became the training grounds for larger venues that he would later sell out. He came up with a new stage name in the clubs, combining his nickname “Red” with the last name of the baseball star Jimmie Foxx. During the 1950s and 1960s, Sanford drew larger audiences to his shows and sold a large number of comedy albums. His audience was still largely African American men, but times were changing and his comedy was beginning to reach people from all walks of life. He landed a movie role in the film Cotton Comes to Harlem in 1970, which was the springboard he needed to finally become a household name. Soon after his first movie role, television producer Norman Lear approached Sanford about starring in his own show. The show was based on a popular British comedy, but in America it took the name of Sanford and Son. The show was set in the Watts neighborhood of Los Angeles and gave many white Americans their first real look inside the lives of black families. He played Fred Sanford, the lovable junk dealer who was always bickering with his son. The show was a hit across racial lines, lasting 5 years and leading to more roles and more stardom. Sanford went on to star in a number of other TV shows, including The Redd Foxx Comedy Hour and The Redd Foxx Show. He used his immense popularity to garner even more movie roles for himself. In the late 1980s, he starred with Eddie Murphy in the critically acclaimed Harlem Nights, and worked the Las Vegas comedy circuit. His life came to a sudden end doing what he loved to do. He was shooting a new sitcom, The Royal Family, when he died from a heart attack in 1991. Sanford's body of work continues to entertain a new generation of fans even today while continuing to rack up accolades. During his life, he became one of the small number of performers to have the lead role in a television show on each of the big three networks, Sanford and Son on NBC, The Royal Family on CBS, and The Redd Foxx Comedy Hour on ABC. His character, Fred Sanford on Sanford and Son, was ranked No. 42 in TV Guide's list of the “50 Greatest TV Dads of All Time.” Foxx died in Los Angeles at age 68 from a heart attack. Category:Actors from St. Louis, Missouri Category:American television actors Category:Comedians from St. Louis, Missouri Category:Deaths from myocardial infarction Category:1922 births Category:1991 deaths",
 "title": "Redd Foxx"
}