{
 "id": "358146",
 "text": "Shelley Winters (Shirley Schrift August 18, 1920 – January 14, 2006) was an American movie actress who appeared in many blockbuster movies such as Place in the Sun, The Big Knife, Lolita, The Night of the Hunter, Alfie, and The Poseidon Adventure. Her career spanned over 50 years until her death in 2006. Winters won Academy Awards for her acting in The Diary of Anne Frank and A Patch of Blue. ==Early life== Winters was born on August 18, 1920 in St. Louis, Missouri to Rose (née Winter) and to Jonas Schrift. She was raised in Brooklyn, New York City. She was educated at The New School. ==Career== Winters' career began in 1943 in the movie There's Something About a Soldier and since then she appeared in over 100 movies, such as; Escape in the Fog, New Orleans, The Greatest Story Ever Told, Flap, Black Journal, Fanny Hill, Jury Duty, and her final movie A-List. ===Awards and nominations=== Year Award Film 1951 Best Actress in a Leading Role, nominated A Place in the Sun 1959 Academy Award for Best Supporting Actress, won The Diary of Anne Frank 1965 Best Actress in a Supporting Role, won A Patch of Blue 1972 Best Actress in a Supporting Role, nominated The Poseidon Adventure Winters has a star on the Hollywood Walk of Fame, and was inducted into the St. Louis Walk of Fame in 1992. ==Personal life== Winters was married to Paul Meyer from 1937 until they divorced in 1948. Later she married Vittorio Gassman from 1949 until they divorced in 1954. Thirdly she married Anthony Franciosa from 1957 until they divorced in 1960. Lastly she married Gerry DeFord from 2006 until her death in 2006. Winters only had one child with Grassman. ===Death=== Winters died on January 14, 2006 in at a hospital in Beverly Hills, California home from heart failure, she was 85 years old. Five days later, her ex-husband Anthony Franciosa died from a stroke. ==References== ==Other websites== * * * Category:1920 births Category:2006 deaths Category:American Academy Award winning actors Category:Actors from St. Louis, Missouri Category:American movie actors Category:American stage actors Category:American television actors Category:Deaths from heart failure Category:Emmy Award winning actors",
 "title": "Shelley Winters"
}