{
 "id": "358167",
 "text": "John Michael Turturro (born February 28, 1957) is an American movie and television, voice actor, writer and director known for his roles in the movies; Do the Right Thing (1989), Miller's Crossing (1990), Barton Fink (1991), Quiz Show (1994), The Big Lebowski (1998), O Brother, Where Art Thou? (2000) and the Transformers movie series. He has appeared in over sixty films, and has worked mostly with the Coen brothers, Adam Sandler and Spike Lee. Turturro also starred in Disney/Pixar Cars 2. He played Carmine Falcone in the 2022 movie The Batman. Turturro was born in Brooklyn, New York on February 28, 1957. Turturro is currently married to Katherine Borowitz since 1985, they have two children. ==Filmography== Year Title Role Notes 1980 Raging Bull Man at table Uncredited 1984 Exterminator 2 Guy #1 1984 Ted from Pinky's 1985 Desperately Seeking Susan Ray 1985 To Live and Die in L.A. Carl Cody 1986 Hannah and Her Sisters Writer 1986 Julian 1986 Gung Ho Willie 1986 Off Beat Neil Pepper 1987 Five Corners Heinz Zabantino Nominated—Independent Spirit Award for Best Supporting Male 1987 Pisciotta 1989 Do the Right Thing Pino 1990 Catchfire Pinella 1990 State of Grace Nick 1990 Mo' Better Blues Moe Flatbush 1990 Miller's Crossing Bernie Bernbaum Nominated—National Society of Film Critics Award for Best Supporting Actor Nominated—New York Film Critics Circle Award for Best Supporting Actor 1991 Men of Respect Mike Battaglia 1991 Jungle Fever Paulie Carbone 1991 Barton Fink Barton Fink 1992 Mac Niccolò Vitelli Also director and writer Caméra d'Or Nominated—Independent Spirit Award for Best Director Nominated—Independent Spirit Award for Best First Feature 1992 Brain Donors Roland T. Flakfizer 1993 Being Human Lucinnius 1993 Fearless Bill Pearlman 1994 Quiz Show Herb Stempel 1994 Disco Bean 1995 Search and Destroy Ron 1995 Unstrung Heroes Sidney Lidz 1995 Clockers Det. Larry Mazilla 1996 Girl 6 Murray 1996 Box of Moonlight Al Fountain Nominated—Independent Spirit Award for Best Lead Male 1996 Grace of My Heart Joel Milner 1997 Lesser Prophets (aka The Last Bet) Leon 1997 Primo Levi 1998 Illuminata Tuccio Also director, writer and producer Nominated—Palme d'Or 1998 Rounders Joey Knish 1998 He Got Game Billy Sunday 1998 O.K. Garage Jonny 1998 Jesus Quintana 1998 Animals with the Tollkeeper Tuxedo Man 1999 Summer of Sam Harvey the Dog Voice 1999 Cradle Will Rock Aldo Silvana 2000 O Brother, Where Art Thou? Pete Nominated—MTV Movie Award for On- Screen Team 2000 Dante Dominio 2000 Company Man Crocker Johnson 2000 Two Thousand and None Benjamin Kasparian 2000 Alexander Luzhin 2001 Monkeybone Monkeybone Voice 2001 Thirteen Conversations About One Thing Walker Florida Film Critics Circle Award for Best Cast 2002 Collateral Damage Armstrong 2002 Mr. Deeds Emilio Lopez 2003 Fear X Harry 2003 Anger Management Chuck 2003 Opopomoz John Voice 2004 Secret Passage Paolo Zane 2004 Secret Window John Shooter Nominated—Saturn Award for Best Supporting Actor 2004 She Hate Me Don Angelo Bonasera 2004 2BPerfectlyHonest Sal / Roberto 2005 Romance and Cigarettes Male dancer and singer Also director, writer and producer Nominated—Golden Lion 2005 The Moon and the Son: An Imagined Conversation Son Voice Short film 2006 Ray Brocco 2006 A Few Days in September William Pound 2007 Transformers Agent Seymour Simmons 2007 Margot at the Wedding Jim Nominated—Gotham Independent Film Award for Best Ensemble Cast 2007 Slipstream Harvey Brickman 2007 Joulutarina Iisakki English dub 2008 What Just Happened Dick Bell 2008 You Don't Mess With The Zohan Fatoush 'The Phantom' Hakbarah 2008 Miracle at St. Anna Detective Antonio 'Tony' Ricci Nominated—Black Reel Award for Best Ensemble 2009 Camonetti 2009 Transformers: Revenge of the Fallen Seymour Simmons 2009 Rehearsal for a Sicilian Tragedy Himself Documentary Also writer and executive producer 2010 Passione Himself/Narrator Documentary Also director and co-write 2010 The Rat King 2011 Cars 2 Francesco Bernoulli Voice 2011 Transformers: Dark of the Moon Seymour Simmons 2011 Somewhere Tonight Leroy 2013 Fading Gigolo Fioravante Also director and writer 2013 Gods Behaving Badly Hades 2014 God's Pocket Arthur 'Bird' Capezio 2014 Exodus: Gods and Kings Seti I 2014 Rio, I Love You Homem Segment \"Quando não há Mais Amor\" Also director and writer 2015 Mia madre Barry Huggins 2015 Partly Cloudy with Sunny Spells Lombelli 2015 The Ridiculous 6 Abner Doubleday 2016 Hands of Stone Frankie Carbo 2016 The Night Of John Stone 2017 Landline Alan Jacobs 2017 Hair John Turturro Short film; also director and writer 2017 Transformers: The Last Knight Seymour Simmons 2018 Gloria Bell Arnold 2019 The True Adventures of Wolfboy Mr. Silk 2019 The Jesus Rolls Jesus Quintana Also director and writer ==Other websites== * * Category:1957 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from New York City",
 "title": "John Turturro"
}