{
 "id": "358102",
 "text": "is a Japanese football player. She played for the Japan national team. ==Biography== Ariyoshi was born in Saga on November 1, 1987. In 2008, when she was at Nippon Sport Science University, she debuted in the Nadeshiko League for TEPCO Mareeze. After graduating, she joined Nippon TV Beleza (later Nippon TV Tokyo Verdy Beleza) in 2010. She played 175 matches for the club. She was selected for the Best Eleven four years in a row, from 2013 to 2016). In 2021, she moved to Omiya Ardija Ventus with teammate Mizuho Sakaguchi.Omiya Ardija In February 2012, Ariyoshi was selected the Japan national team for 2012 Algarve Cup. At this competition, on February 29, she debuted against Norway. In 2014, she played at 2014 Asian Cup and 2014 Asian Games. Japan won the championship at Asian Cup and the 2nd place at Asian Games. In 2015, played at 2015 World Cup and Japan won the 2nd place. She played 6 matches and scored a goal. She was named candidates for the Golden Ball at the tournament. She was also a member for 2018 Asian Cup and Japan won their second consecutive title. She played 65 games and scored 1 goals for Japan until 2019. ==Statistics== List of match in 2012, 2013, 2014, 2015, 2016, 2018, 2019 at Japan Football Association Japan national team Year Apps Goals 2012 5 0 2013 8 0 2014 17 0 2015 12 1 2016 7 0 2017 0 0 2018 14 0 2019 2 0 Total 65 1 ==References== ==Other websites== * *Japan Football Association Category:1987 births Category:Living people Category:Footballers from Saga Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:TEPCO Mareeze players Category:Nippon TV Tokyo Verdy Beleza players Category:2015 FIFA Women's World Cup players Category:2014 AFC Women's Asian Cup players Category:2018 AFC Women's Asian Cup players Category:Footballers at the 2014 Asian Games Category:Footballers at the 2018 Asian Games Category:AFC Women's Asian Cup-winning players Category:Asian Games medalists in football Category:Asian Games gold medalists for Japan Category:Asian Games silver medalists for Japan Category:Medalists at the 2014 Asian Games Category:Medalists at the 2018 Asian Games",
 "title": "Saori Ariyoshi"
}