{
 "id": "358128",
 "text": "Harrison Ford (March 16, 1884 - December 2, 1957) was an American stage and movie actor. He was a leading Broadway theatre performer and a star of the silent film era. Ford was born in Kansas City, Missouri on March 16, 1884. Ford died on December 2, 1957 after being run-over by a car in the early 1950s. He was not related to the living actor with the same name. He was married to actress to Beatrice Prentice from 1909 until his death in 1957. Ford died in Woodland Hills, Los Angeles, California after being run over by a car on December 2, 1957, aged 73. ==Movies == Year Title Role Notes 1915 Excuse Me Lt. Harry Mallory 1916 Anton the Terrible David Burkin Alternative title: The Austrian Spy 1917 The Crystal Gazer Dick Alden 1917 Molly Entangled Barney Malone 1918 Good Night, Paul Paul Boudeaux 1918 A Lady's Name Noel Corcoran 1919 You Never Saw Such a Girl Eric Burgess 1919 Hawthorne of the U.S.A. Rodney Blake 1920 Food for Scandal Watt Dinwiile 1920 Her Beloved Villain Martinot 1921 Wedding Bells Reginald Carter 1921 Love's Redemption Clifford Standish 1922 Foolish Wives Rude Soldier/Armless Soldier Uncredited 1922 Smilin' Through Kenneth Wayne/Jeremiah Wayne 1922 Her Gilded Cage Lawrence Pell 1923 Vanity Fair George Osborne 1923 Maytime Richard Wayne 1924 The Average Woman Jimmy Munroe 1924 Janice Meredith Charles Fownes 1925 Proud Flesh Don Jaime 1925 Lovers in Quarantine Anthony Blunt 1925 That Royle Girl Fred Ketlar 1926 The Song and Dance Man Joseph Murdock 1926 Hell's 400 John North 1926 The Nervous Wreck Henry Williams 1927 Night Bride Stanley Warrington 1927 The Girl in the Pullman Dr. Donald A. Burton 1928 Let 'Er Go Gallegher Henry Clay Callahan 1928 The Rush Hour Dan Morley 1929 The Flattering Word 1929 Her Husband's Women 1932 Love in High Gear Donald Ransome ==Other websites== * * * * Category:1884 births Category:1957 deaths Category:Actors from Kansas City, Missouri Category:American radio actors Category:American silent movie actors Category:American stage actors Category:Road accident deaths in California",
 "title": "Harrison Ford (silent movie actor)"
}