{
 "id": "358110",
 "text": "is a former Japanese football player. She played for the Japan national team. ==Biography== Yamane was born in Hiroshima on December 20, 1990. After graduating from JFA Academy Fukushima, she joined TEPCO Mareeze based in Fukushima Prefecture club in 2009. However, the club was disbanded for Fukushima nuclear disaster in 2011. She moved to JEF United Chiba in 2012.She played 92 matches in Nadeshiko League. She left the club in July 2017.JEF United Chiba In August, she joined Spanish Primera División club Real Betis.JEF United Chiba She played for the club in 2 seasons. In August 2019, she returned to JEF United Chiba.JEF United Chiba She retired end of 2020 season.JEF United Chiba In November 2008, Yamane was selected the Japan U-20 national team for 2008 U-20 World Cup. On January 15, 2010, she debuted for the Japan national team against Chile. In July, she was selected Japan U-20 team for 2010 U-20 World Cup. In 2014, she was a member for 2014 Asian Cup and 2014 Asian Games. Japan won the championship at Asian Cup and the 2nd place at Asian Games. In 2015, she also played at 2015 World Cup and Japan won the 2nd place. She played 26 games for Japan until 2019. ==Statistics== List of match in 2010, 2013, 2014, 2015, 2016, 2017, 2019 at Japan Football Association Japan national team Year Apps Goals 2010 1 0 2011 0 0 2012 0 0 2013 3 0 2014 9 0 2015 5 0 2016 3 0 2017 2 0 2018 0 0 2019 3 0 Total 26 0 ==References== ==Other websites== * *Japan Football Association Category:1990 births Category:Living people Category:Footballers from Hiroshima Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:TEPCO Mareeze players Category:JEF United Chiba Ladies players Category:2015 FIFA Women's World Cup players Category:2014 AFC Women's Asian Cup players Category:Footballers at the 2014 Asian Games Category:AFC Women's Asian Cup-winning players Category:Asian Games medalists in football Category:Asian Games silver medalists for Japan Category:Medalists at the 2014 Asian Games",
 "title": "Erina Yamane"
}