{
 "id": "358282",
 "text": "is a former Japanese football player and manager. He managed for Japan women's national team. ==Biography== After graduating from Meiji University, Sasaki joined NTT Kanto. He was a midfielder. He contributed to the club's promotion to Japan Soccer League Division 2 in 1987. He retired in 1991. Sasaki served as the head coach of Japan Football League side Omiya Ardija in 1998, then took various other positions at Omiya, including the youth team head-coach and the head of development. In 2006, Sasaki became the assistant coach of Japan women's national team, as well as the head coach of its U-20 team. In 2008, he was promoted to the head coach of the national team, succeeding Hiroshi Ohashi. Under Sasaki's reign, Japan won the EAFF Women's Football Championship in 2008 and again in 2010. He also led the Japan Women to a fourth-place finish at the 2008 Summer Olympics in Beijing. Sasaki was the manager of the Japan when they won the 2011 World Cup. FIFAFIFA is an acronym. FIFA stands for Fédération Internationale de Football Association, which is the commonly used French name of the International Federation of Association Football. named Sasaki 2011 \"Coach of the Year\". He also coached the national team to a second-place finish at the 2015 World Cup. He was also coach of the women's team which won a silver medal in the 2012 Summer Olympics at London.Baxter, Kevin. \"Japanese soccer team gets upgrade ...,\" Los Angeles Times. August 11, 2012; retrieved 2012-8-17. Sasaki announced his retirement from coaching in 2012,Westlake, Adam. \"Nadeshiko Japan coach Sasaki to step down after London Olympics,\" Japan Daily Press. August 9, 2012; retrieved 2012-8-17. but was persuaded to stay on as national team coach. In 2019, he was selected Japan Football Hall of Fame.Japan Football Association ==Honours== * FIFA World Coach of the Year, 2011Meiji University, \"Norio Sasaki, coach of Nadeshiko Japan and a graduate of Meiji University, receives the FIFA Women’s Football Coach of the Year prize, the first-ever such feat for an Asian national,\" January 11, 2012; retrieved 2012-8-17. == Related pages== * Sports in Japan * Japan at the Olympics * Football at the 2012 Summer Olympics – Women's tournament ==References== ==Other websites== * *Japan Football Hall of Fame at Japan Football Association * なでしこジャパン（日本女子代表チーム）新監督に佐々木 則夫氏が就任 (\"Norio Sasaki appointed new coach of women's national team\") at Japan Football Association Category:1958 births Category:Living people Category:Footballers from Yamagata Prefecture Category:Japanese football managers Category:Japan Soccer League players Category:Omiya Ardija players Category:Japan women's national football team managers",
 "title": "Norio Sasaki"
}