{
 "id": "35836",
 "text": "Phil of the Future is an American comedy children's television series. It was produced by 2121 Productions (a part of Brookwell McNamara Entertainment). It was first shown on June 18, 2004 on the Disney Channel, and ended on August 19, 2006 as part of the Disney Channel Games. Stars of the show include Ricky Ullman (Phil Diffy), Amy Bruckner (Pim Diffy), and Alyson Michalka (Keely Teslow). The last episode was shown in the United States on August 19, 2006. == Cast == * Ricky Ullman as Philip \"Phil\" Diffy * Amy Bruckner as Pim Diffy * Craig Anton as Lloyd Diffy * Lise Simms as Barbara Diffy * Alyson Michalka as Keely Teslow * J.P. Manoux as Curtis and as Vice Principal Hackett * Kay Panabaker as Debbie Berwick * Rory Thost as Bradley Benjamin Farmer == Episodes == === Season 1 === # Your Cheatin' Heart # Unification Day # Meet the Curtis # Phillin' In # Tanner # Raging Bull # My Way # Daddy Dearest # Pheremonally Yours # Future Tutor # Future Jock # You Say Toe-Mato # Doggie Daycare # We'll Fix it in Editing # Halloween # Age Before Beauty # Neander Phil # Double Trouble # Milkin' It # Corner Pocket # Team Diffy === Season 2 === 22. Versa Day 23. Virtu-Day 24. The Giggle 25. Dinner Time 26. Tia, Via, or Me... Uhh 27. Ge Ready to Go-Go 28. Phil Without a Future 29. Time Release Capsule 30. Mummy's Boy 31. Maybe-Sitting 32. Good Phil Hunting 33. Pim-Cipal 34. Phil of the Garage 35. It's a Wonder-Phil Life 36. Christmas Break 37. Stuck in the Meddle with You 38. Broadcast Blues 39. Happy Nirday 40. Ill of the Future 41. Where's the Wizard? 42. Not-So-Great Great Great Grandpa 43. Back to the Future (Not the Movie) == Gadgets Used in the TV Series == * Wizard - Can perform multiple functions (Usually spelled Wizrd) * New Ager - Can make people older and younger * DNA Scrambler - Manipulates the DNA of the person it is used on * Insta Morph - Changes what people look like so other people think they are someone else(as seen in Not-So Great-Great-Grandpa) * Skyak - A futuristic flying vehicle, which is like a jet-ski * Penny Missile - Springing clip * The Giggle - A futuristic version of the internet * Replicator Gadget - Replicates (or 'clones') the subject * Holographic Tracking Sensor - Can be used to track a subject * Omnimatic Grapthifiers - Works as a laser operated gripping device, used for climbing * Virtu-Goggles - Strap-on goggles that lets people view and experience a virtual-reality world * Laser Squash - A futuristic game like handball * Spray Food Cans - Spray cans that make any kind of food * I Want Straight Hair - Makes frizzy, messy hair instantly neat * Dress Me Hoop - Used to automatically dress a person when he or she goes through it * Invisi-spray - Used to make someone invisible (cannot be seen) == Other websites == * Save Phil of The Future * Brookwell McNamara Entertainment Category:Television series by Disney Category:2004 American television series debuts Category:English-language television programs",
 "title": "Phil of the Future"
}