{
 "id": "358307",
 "text": "Naughty Dog is a video game company founded by Andy Gavin and Jason Rubin in 1986. It is part of Sony since 2001. They produced more successful games, including Rings of Power for Sega Genesis and Way Of The Warrior for 3DO. Rings of Power was created with a low budget. Universal Studios signed a deal with the duo to a three-title deal and fund the expansion of the company. Mark Cerny, who had produced Sonic the Hedgehog 2 for Sega, convinced Naughty Dog to focus on new resources on creating a character-based platform game in 3D. Crash Bandicoot was developed and became the first 3D video game by Naughty Dog. for the PlayStation on September 9, 1996. Naughty Dog would develop three Crash Bandicoot sequels over the next several years. In January 2001, it was announced Sony would acquire Naughty Dog. After developing the fourth Crash Bandicoot game (Crash Team Racing), the company began working on Jak and Daxter for PlayStation 2. In 2004, Naughty Dog's studio president and co- founder, Jason Rubin left the company to work on a new game named Iron and the Maiden. ==List of games== As Jam Software Game Title Year Released Platform Notes Math Jam 1985 Apple II Ski Crazed 1986 Apple II Dream Zone 1988 Apple IIGS As Naughty Dog Game Title Year Released Platform GameRankings Metacritic Notes Keef the Thief 1989 Apple IIGS N/A N/A First game developed by Naughty Dog Rings of Power 1991 Mega Drive 40.00% N/A Published by Electronic Arts Way of the Warrior 1994 3DO N/A N/A 1994 3DO Developers Award: Winner for Best Animation Crash Bandicoot 1996 PlayStation 80.40% N/A Was the first non- Japanese game to receive a \"Gold Prize\" in Japan Crash Bandicoot 2: Cortex Strikes Back 1997 PlayStation 88.54% N/A One of the best-selling PSone video games of all time Crash Bandicoot 3: Warped 1998 PlayStation 89.07% 91/100 Was the first non-Japanese title to receive a \"Platinum Prize\" in Japan Crash Team Racing 1999 PlayStation 91.78% 88/100 Latest Crash Bandicoot game developed by Naughty Dog Jak and Daxter: The Precursor Legacy 2001 PlayStation 2 90.22% 90/100 First game released after being acquired by Sony Jak II 2003 PlayStation 2 87.90% 87/100 Won IGN Editor's Choice 2003 Jak 3 2004 PlayStation 2 85.42% 84/100 The Top 25 PS2 Games of All Time Jak X: Combat Racing 2005 PlayStation 2 76.96% 76/100 Latest Jak and Daxter game developed by Naughty Dog Uncharted: Drake's Fortune 2007 PlayStation 3 89.70% 88/100 Won IGN's Best Action Game and Best PS3 game Uncharted 2: Among Thieves 2009 PlayStation 3 96.46% 96/100 Won multiple Game of the Year Awards Uncharted 3: Drake's Deception 2011 PlayStation 3 92.19% 92/100 Won Video Game Awards 2011 Best Graphics and Best PS3 game Jak and Daxter Collection 2012 PlayStation 3 81.56% 82/100 Collaborated development with Mass Media Inc. The Last of Us 2013 PlayStation 3 95.04% 95/100 Uncharted 4: A Thief's End 2016 PlayStation 4 92.71% 93/100 Uncharted: The Lost Legacy 2017 PlayStation 4 85.46% 84/100 The Last of Us Part II 2020 PlayStation 4 N/A 93/100 == References == == Other websites == * Category:Video game companies of the United States Category:Companies based in Santa Monica, California Category:1984 establishments in California",
 "title": "Naughty Dog"
}