{
 "id": "358459",
 "text": "Amietophrynus is a large genus of true toads. They live in Africa. At first Amietophrynus species were included in the genus Bufo. They have been split because they are considered different enough. ==Species== Binomial Name and Author Common Name(s) Amietophrynus asmarae Asmara Toad Amietophrynus blanfordii Blanford's Toad Amietophrynus brauni Braun's Toad, Dead-leaf Toad Amietophrynus buchneri Buchner's Toad Amietophrynus camerunensis Oban Toad Amietophrynus chudeaui Bata Marsh Toad Amietophrynus cristiglans Tingi Hills Toad Amietophrynus danielae Ivory Coast Toad Amietophrynus djohongensis Amietophrynus fuliginatus Shaba Province Toad, Sooty Toad Amietophrynus funereus Angola Toad, Somber Toad Amietophrynus garmani Garman's Toad, Olive Toad, Northern Mottled Toad Amietophrynus gracilipes French Congo Toad Amietophrynus gutturalis Lobatsi Toad, Guttural Toad, Square-marked Toad Amietophrynus kassasii Damietta Toad Amietophrynus kerinyagae Keith's Toad Amietophrynus kisoloensis Kisolo Toad Amietophrynus langanoensis Lake Langano Toad Amietophrynus latifrons High Tropical Forest Toad Amietophrynus lemairii Pweto Toad, Lemaire's Toad, Yellow Swamp Toad Amietophrynus maculatus Hallowell's Toad, Flat-backed Toad, Striped Toad Amietophrynus pantherinus Panther Toad, Southern Panther Toad Amietophrynus pardalis Gleniffer Toad, Leopard Toad, August Toad, Snoring Toad Amietophrynus perreti Perret's Toad Amietophrynus poweri Kimberley Toad, Power's Toad Amietophrynus rangeri Kei Road Toad, Ranger's Toad, Raucous Toad Amietophrynus reesi Merera Toad Amietophrynus regularis Square-marked Toad, African Toad Amietophrynus steindachneri Steindachner’s Toad Amietophrynus superciliaris Zaire Toad, Cameroon Toad Amietophrynus taiensis Amietophrynus togoensis Togo Toad Amietophrynus tuberosus Fernando Po Toad Amietophrynus turkanae Lake Turkana Toad Amietophrynus urunguensis Urungu Toad Amietophrynus villiersi Villier's Toad Amietophrynus vittatus Banded Toad, Degen's Toad Amietophrynus xeros Subsaharan Toad, Waza Toad, Savannah Toad ==References== * Frost, D.R., Grant, T., Faivovich, J., Bain, R.H., Haas, A., Haddad, C.F.B., de Sá, R.O., Channing, A., Wilkinson, M., Donnellan, S.C., Raxworthy, C.J., Campbell, J.A., Blotto, B.L., Moler, P., Drewes, R.C., Nussbaum, R.A., Lynch, J.D., Green, D.M. & Wheeler, W.C. 2006, \"The Amphibian Tree of Life\", Bulletin of the American Museum of Natural History no. 297: 1-370. [15 Mar 2006] * Category:Toads Category:Frogs of Africa",
 "title": "Amietophrynus"
}