{
 "id": "35853",
 "text": "In math, the imaginary unit (written as \"i\" or \"j\") is a mathematical constant that only exists outside of the real numbers and is used in algebra. When we multiply the imaginary unit by a real number, we call the result an imaginary number. Though imaginary numbers can be used to solve a lot of mathematical problems, they cannot be represented by an amount of real life objects. ==History== Imaginary units were invented to answer the polynomial equation x^2 + 1 = 0, which normally has no solution (see below). The term \"imaginary\" comes from by René Descartes and was meant to be insulting as, like zero and negative numbers at other times in history, imaginary numbers were thought to be useless as they are not natural. It wasn't until later centuries that the work of mathematicians like Leonhard Euler, Augustin-Louis Cauchy and Carl Friedrich Gauss would prove that imaginary numbers were very important for some areas of algebra. ==Definition== A common rule for multiplying and dividing numbers is that if the signs are different then the result is negative (e.g. 4 \\times -3 = -12), but if both numbers have the same sign then the result will be positive (e.g. 5 \\times 6 = 30 and -10 \\times -10 = 100). However, this leads to problems with square root numbers of negatives, as two negative numbers will always make a positive number: :2 \\times 2 = 2^{2} = 4 :so \\sqrt{4} = 2 :but \\sqrt{-4} eq -2 :as -2 \\times -2 = (-2)^{2} = 4 To fill in this value gap the imaginary unit was made, which is defined as i = \\sqrt{-1} and i \\times i = i^2 = -1. Using imaginary numbers we can solve our last example: :2i \\times 2i = 4i^{2} = -4 :-2i \\times -2i = 4i^{2} = -4 :\\sqrt{4} = 2 and \\sqrt{-4} = 2i == Square root of i == Although the imaginary unit comes from solving a quadratic equation (an equation where the unknown appears squared), we could ask whether we need to create new number values like the imaginary unit to solve equations where higher powers of x like x^3 and x^4 appear. For example, the equation x^4+1=0 has a fourth power of the unknown variable x. Do we need new units like i to solve this equation? We could also ask a similar question: we needed to create a new number to find the square root of -1, and we called this new number i. Do we need to create a new number to find the square root(s) of i? It turns out the answer to both these questions is no. For the second question, the square roots of i can be written in terms of a real part and an imaginary part. Specifically, the square roots of i can be written as: \\pm \\sqrt{i} = \\pm \\frac{\\sqrt{2}}{2} (1 + i) . We can check that these are really the square roots of i by squaring them and seeing if we get i: : \\left( \\pm \\frac{\\sqrt{2}}{2} (1 + i) \\right)^2 \\ = \\left( \\pm \\frac{\\sqrt{2}}{2} \\right)^2 (1 + i)^2 \\ = (\\pm 1)^2 \\frac{2}{4} (1 + i)(1 + i) \\ = 1 \\times \\frac{1}{2} (1 + 2i + i^2) \\quad \\quad (i^2 = -1) \\ = \\frac{1}{2} (2i) \\ = i \\ We can also notice that (\\pm \\sqrt{i})^4 = (i)^2 = -1, so \\pm\\sqrt{i} solves the equation x^4+1=0, partially answering our first question-- for the equation x^4+1=0, the solutions are still complex numbers (the result of adding a real number and an imaginary number). There are two more solutions for this particular equation, x=\\pm \\frac{\\sqrt{2}}{2} (1 - i), and they are also complex numbers. No new numbers like the imaginary unit are needed to solve the equation. In general, every equation where the unknown appears with whole number powers can be solved by complex numbers, so once we know about the imaginary unit, we can solve any equation of this form. This result is so important that it is called the fundamental theorem of algebra. == Powers of i == The powers of i or i follow a regular and predictable pattern: :i^{-4} = 1 :i^{-3} = i :i^{-2} = -1 :i^{-1} = -i :i^0 = 1 :i^1 = i :i^2 = -1 :i^3 = -i :i^4 = 1 :i^5 = i :i^6 = -1 :i^7 = -i As shown, each time we multiply by another i the values are 1, i, -1, -i and then repeat. ==Related pages== * Complex number * Euler's Identity * Imaginary number * Mathematical constant * Real number == References == Category:Mathematical constants Category:Complex analysis",
 "title": "Imaginary unit"
}