{
 "id": "358606",
 "text": "thumb|90px|Coat of arms Amazonas is one of the 23 states into which Venezuela is divided. Amazonas State covers a total surface area of 176,899 km² and, in 2007, had a population of 142,200.Vila, Marco Aurelio. 1964: Aspectos Geograficos del Territorio Federal Amazonas. Corporación Venezolana de Fomento. Caracas. 192p.González Niño, Edgardo. 1984: Historia del Territorio Federal Amazonas. Ediciones de la Presidencia de la República. Caracas. 174p. The state capital is Puerto Ayacucho. Amazonas has Venezuela's highest proportion of indigenous peoples of Venezuela.Van Cott (2003), \"Andean Indigenous Movements and Constitutional Transformation: Venezuela in Comparative Perspective\", Latin American Perspectives 30(1), p52 == Municipalities and Municipal Seats == Municipality Capital km² Pop Map Alto Orinoco Municipality La Esmeralda 49.217 km² 14.222 hab. (2008) Atabapo Municipality San Fernando de Atabapo 25.062 km² 12.797 hab. (2007) Atures Municipality Puerto Ayacucho 7.302 km² 91.386 hab (2007) Autana Municipality Isla Ratón 12.291 km² 8.181 hab (2007) Manapiare Municipality San Juan de Manapiare 32.042 km² 9.658 hab (2007) Maroa Municipality Maroa 13.082 km² 8.181 hab (2005) Río Negro Municipality San Carlos de Río Negro 37.903 km² 9.658 hab (2007) ==Geography== ===Rivers === In this state comes the main river of Venezuela, the Orinoco, in the mount delgado Chalbaud.León A, Rafael de. y Rodríguez Díaz, Alberto J. (1976): El Orinoco aprovechado y recorrido. Corporación Venezolana de Guayana y Ministerio de Obras Públicas. Caracas. 216p. Other rivers in the state are: Ventuari river, Yatití, Parú, Asita, Manapiare, Marieta, Guapachí, Ocamo, Putaco, Padamo, Cuntinamo, Botamo, Matacuní, Ugueto, Mavaca, Manaviche, Cunucunuma, Guanane, Yagua, Guaviare, Sipapo, Cataniapo Atabapo, Uesete, Siapa, Ararí, Manipitare, Casiquiare, Pamoni, Pasiba, Pasimoni, Negro and Guainía.Zinck, Alfred. 1986. Venezuelan Rivers. Cuadernos Lagoven Lagoven, S.A. Caracas. 64p. Gines, H. 1992: Los grandes ríos suramericanos. Ediciones Corpoven. Caracas. 44p. Hernández Caballero, Serafín (Editor). (1998): Gran Enciclopedia de Venezuela. Editorial Globe, C.A. Caracas. 10 volúmenes. ===National parks=== The State of Amazonas has many natural sites of great interest. * Parima Tapirapeco National Park * Serranía La Neblina National Park * Yapacana National Park * National Park Duida Marahuaca ===Natural monuments=== * Piedra del Cocuy. * Cerro Autana. * Piedra de la Tortuga. * Piedra Pintada. ==Fauna== The rich fauna of the region is represented by numerous specimens of mammals, reptiles, fish and birds. * Mammals: puma, jaguar, tapir, monkey, anteater, & fox. * Reptiles: Orinoco crocodile, baba, turtle, tortoise, snakes, anaconda, tragavenado, cuaima, & mapanare. * Fish: Sapoara, shaker or electric eel, bay, caribbean, piranha, catfish, and guabina. * Birds: eagle, harpy eagle, hawk, macaw, katana, carpenter, helmeted, & toucan. ==References== ==Other websites== * Governor's page",
 "title": "Amazonas (Venezuela)"
}