{
 "id": "358627",
 "text": "Rhinella (Beaked Toads or Rio Viejo Toads) is a subgenus of Bufo. Some people call it its own genus. It has 71 species of true toads. They live in Central and South America. ==Species== Note: Species below are shown as species of Rhinella. They are treated as species of Bufo by many authors. Binomial Name and Author Common Name Rhinella abei Rhinella achalensis Cordoba Toad Rhinella achavali Rhinella acrolopha Cerro Mali Beaked Toad Rhinella acutirostris Rhinella alatus Rhinella amabilis Rhinella amboroensis Cochabamba Toad Rhinella arborescandens Mendoza Pass Toad Rhinella arenarum Common Toad; Argentine Toad Rhinella arequipensis Rio Chili Toad Rhinella arunco Arunco; Concepcion Toad Rhinella atacamensis Vallenar Toad; Atacama Toad Rhinella beebei Rivero's Toad Rhinella bergi Rhinella castaneoticus Para Toad Rhinella ceratophrys Horned Toad Rhinella chavin Rhinella chrysophorus Rio Viejo Toad Rhinella cristinae Rhinella crucifer Striped Toad Rhinella dapsilis Bom Jardim Toad Rhinella diptychus Cope's Toad Rhinella dorbignyi Dorbigny's Toad Rhinella fernandezae Bella Vista Toad Rhinella festae Valle Santiago Beaked Toad Rhinella fissipes Carabaya Toad Rhinella gallardoi Gallardo's Toad Rhinella gnustae Rio Grande Toad Rhinella granulosus Common Lesser Toad Rhinella henseli Rhinella hoogmoedi Rhinella ictericus Yellow Cururu Toad Rhinella inca Inca Toad Rhinella iserni Rio Perene Toad Rhinella jimi Rhinella justinianoi El Chape Toad Rhinella limensis Peru Coast Toad Rhinella lindae Murri Beaked Toad Rhinella macrorhina Santa Rita Beaked Toad Rhinella manu Rhinella margaritifer South American Common Toad Rhinella marina Cane Toad Rhinella multiverrucosus Rhinella nesiotes Laguna Toad Rhinella nicefori Colombian Beaked Toad Rhinella ocellatus Ocellated Toad Rhinella ornatus Rhinella poeppigii Gray Toad Rhinella pombali Rhinella proboscideus Beaked Toad Rhinella pygmaeus Rio Parahyba Toad Rhinella quechua Incachaca Toad Rhinella roqueanus Rhinella rostrata Mesopotamia Beaked Toad Rhinella rubescens Rhinella rubropunctatus Rusty Toad Rhinella ruizi Rhinella rumbolli Salta Toad Rhinella schneideri Cururu Toad; Schneider's Toad Rhinella scitulus Rhinella sclerocephalus Rhinella spinulosus Warty Toad; Huanuco Toad Rhinella stanlaii Rhinella sternosignatus Falcon Toad Rhinella tacana Rhinella tenrec Antioquia Beaked Toad Rhinella truebae Trueb's Beaked Toad Rhinella vellardi Alto Maranon Toad Rhinella veraguensis Veragua Toad Rhinella veredas ==References== * . 2007. A new species of arboreal Rhinella (Anura: Bufonidae) from a cloud forest of southeastern Peru. Herpetologica. 63 (2): 203-212. * (2004) The history of a Nearctic colonization: Molecular phylogenetics and biogeography of the Nearctic toads (Bufo). Evolution 58: 2517–2535. * (2006). \"The Amphibian Tree of Life\". Bulletin of the American Museum of Natural History 297: 1–371. ==Other websites== * . 2007. Amphibian Species of the World: an Online Reference. Version 5.1 (10 October, 2007). Rhinella. Electronic Database accessible at http://research.amnh.org/herpetology/amphibia/index.php. American Museum of Natural History, New York, USA. (Accessed: May 07, 2008). Category:Toads Category:Frogs of North America Category:Frogs of South America",
 "title": "Rhinella"
}