{
 "id": "358707",
 "text": "Zara Anne Elizabeth Tindall (née Phillips; born 15 May 1981) is a British equestrian and the second-eldest grandchild of Queen Elizabeth II and Prince Philip, Duke of Edinburgh. Tindall is the second child, and only daughter, of Anne, Princess Royal and her first husband, Mark Phillips. She is married to Mike Tindall, who used to be a rugby player for England. She is better known by her maiden (old name before marriage) name. In the line of succession, she is called \"Mrs Michael Tindall\". She was given an Member of the Order of the British Empire (MBE) honour in the 2007 New Year's Honours List, by her grandmother for her services to equestrianism. In 2012, she carried an Olympic flame at a racecourse in Cheltenham. She won a silver medal at London 2012. ==Early life== Tindall was born at St Mary's Hospital in London. She is the eldest granddaughter of Elizabeth II and Prince Philip, Duke of Edinburgh. When she was born, she was sixth in line to the throne. She is now 18th in line. She has an older brother, Peter Phillips (born 15 November 1977). She has two half-sisters, Felicity Tonkin (born in 1985 after her father had an affair) and Stephanie Phillips, born 2 October 1997, from her father's second marriage. The children of the Princess Royal do not hold a title. It is thought their mother did not want them to have one. ==Marriage and family== On 21 December 2010, Buckingham Palace said she was engaged to Mike Tindall MBE. She got a diamond and platinum engagement ring from Tindall. They married in 2011. Her first daughter and child, Mia Grace Tindall, was born on 17 January 2014 at Gloucestershire Royal Hospital in Gloucestershire. Her second daughter and child, Lena Elizabeth Tindall was born on 18 June 2018 in Stroud Maternity Hospital at Stroud. A son, Lucas Philip Tindall, was born March 24, 2021 at Gatcombe Park in Gloucestershire. ==References== ==Other websites== * * Category:1981 births Category:Alumni of the University of Exeter Category:English equestrians Category:Event riders Category:Living people Category:Olympic silver medalists for Great Britain Category:Royalty from London Category:Sportspeople from London Category:Olympic equestrians for Great Britain",
 "title": "Zara Tindall"
}