{
 "id": "358704",
 "text": "Gagan Narang (born 6 May 1983) is an Indian sportsman. His is best known as an shooter (marksman) who competed in three Summer Olympic Games.Sports Reference.com (SR/Olympics), Gagan Narang ; retrieved 2012-8-20. ==Early life== He was born in Chennai on 6 May 1983 and his ancestors belonged to Samalkha in Panipat district in Haryana. Gagan was born in Madras in Tamil Nadu. He was raised in Hyderabad. ==International competitions== Gagan Narang is a gold medalist in the Afro Asian games, 2003 in Hyderabad on October 26, 2003 in Men's 10m air rifle competition. a rediff.com article about Afro-Asian Games He also won gold medals in the Commonwealth Games in 2006\"Who is Gagan Narang,\" Hindustan Times (India). October 5, 2010; retrieved 2012-8-20. and 2010. \"Gagan Narang set to get Khel Ratna, Arjuna for Zaheer,\" Times of India. July 20, 2011; retrieved 2012-8-20. Gagan Narang won the bronze medalLondon2012.com, Gagan Narang ; retrieved 2012-8-15. in the 10m air rifle event at the 2012 London Olympics ==ISSF World Medal Tally== No. Event Championship Year Place Medal 1 10 metre air rifle ISSF World Shooting Championships 2010 Munich 3 50m Rifle 3 Positions ISSF World Cup 2009 Changwon 4 10m air rifle ISSF World Cup 2009 Changwon 5 10 metre air rifle ISSF World Cup Final 2008 Bangkok 6 10m air rifle ISSF World Cup 2008 Beijing 7 10m air rifle ISSF World Cup 2006 Guangzhou ==World record== Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Current world records held in men's 10 metre air rifle Men Men ==Related pages== * Sports in India * India at the Olympics == References == Category:1983 births Category:Living people Category:2012 Summer Olympics Category:Olympic bronze medalists for India Category:Commonwealth Games medallists Category:Indian sport shooters Category:Sportspeople from Chennai Category:Sportspeople from Hyderabad, India",
 "title": "Gagan Narang"
}