{
 "id": "358776",
 "text": "Rhinatrematidae is the family of neotropical tailed caecilians or beaked caecilians. They are found in the equatorial countries of South America. They are usually said to be the most primitive of the caecilian families. They have many features other groups do not. For example, they still have a tail, and the mouth is not to the back on the underside of the head. They lay their eggs in small holes in the soil. The larvae have external gills. They live in seepages until they change into adults. The adults live in moist soil and leaf litter. ==Taxonomy== There are nine species in two genera. Family Rhinatrematidae * Genus Epicrionops - Beaked Caecilians ** Epicrionops bicolor - Two-coloured Caecilian (Peru, Ecuador, Venezuela, and Colombia). ** Epicrionops columbianus - El Tambo Caecilian (Colombia). ** Epicrionops lativittatus - Eastern Peru Caecilian (Peru). ** Epicrionops marmoratus - Marbled Caecilian (Ecuador). ** Epicrionops niger - Black Caecilian (Guyana, Venezuela, and possibly Brazil). ** Epicrionops parkeri - Parker's Caecilian (Colombia). ** Epicrionops peruvianus - Marcapata Valley Caecilian (Peru). ** Epicrionops petersi - Peters' Caecilian (Ecuador, Peru, and possibly Brazil and Colombia). * Genus Rhinatrema ** Rhinatrema bivittatum - Two-lined Caecilian (Brazil, French Guiana, Guyana, and Suriname). ** Rhinatrema shiv - Shiv’s Rhinatrema (Guyana).Gower et al. (2010) \"A new species of Rhinatrema Duméril & Bibron (Amphibia: Gymnophiona:Rhinatrematidae) from Guyana\" ==References== * Nussbaum, Ronald A. and Mark Wilkinson (1989). \"On the Classification and Phylogeny of Caecilians.\" Herpetological Monographs, (3), 1-42 * * * * Frost, Darrel R. 2004. Amphibian Species of the World: an Online Reference. Version 3.0 (22 August, 2004). Electronic Database accessible at http://research.amnh.org/herpetology/amphibia/index.php. American Museum of Natural History, New York, USA * AmphibiaWeb: Information on amphibian biology and conservation. [web application]. 2004. Berkeley, California: AmphibiaWeb. Available: http://amphibiaweb.org/. Retrieved 26 August 2004 Category:Caecilians",
 "title": "Rhinatrematidae"
}