{
 "id": "358990",
 "text": "is a city in Fukui Prefecture, Japan. ==History== In the pre-modern period, Obama was the main port and capital of Wakasa Province. In the Edo period, Obama was the capital of the Obama Domain. In 1871, the Obama Domain become Obama prefecture after the abolition of domains and establishment of prefectures. Later, the merger was repeated and in 1951 the present city of Obama was established.小浜市議会史 ==Geography== ===Surrounding municipalities=== * Fukui Prefecture ** Ōi ** Wakasa * Shiga Prefecture ** Takashima ==Climate== Obama has a humid subtropical climate with warm, wet summers and cold winters with heavy snowfall. The average annual temperature in Obama is 14.9 °C. The average annual rainfall is 2005 mm with September as the wettest month.The temperatures are highest on average in August, at around 27.4 °C, and lowest in January, at around 3.8 °C. ==Population== From Japanese census data,Obama population statistics 1995 2000 2005 2010 2015 2020 33,496 33,295 32,182 31,340 29,670 28,991 == Specialities == Traditional Crafts * Wakasa-nuri (Wakasa Lacquer Ware) Wakasa Lacquer uses a \"polishing\" technique that involves coating on many layers of lacquer. Wakasa Lacquer made over several months’ time by coating the finest lacquer some ten-odd times, applying a pattern with shells, eggshells, and gold leafs, and polishing it with stones and charcoal. * Wakasa-menouzaiku (Wakasa Agate Work) Wakasa agate work is the root of precious stone work of Japan. Wakasa agate works carved through unique technique is the greatest of precious stone arts. Wakasa agate work is made by applying heat to the rough stone to make it red, and deciding the shape of carving taking into consideration the scratches on the natural stone and long- lasting polishing work. Foods * Heshiko Since Obama is facing the sea of Japan, it has a lot of fish. Heshiko is a traditional dish that uses a salted blue-skin fish, and it can be preserved for a long time. * Yopparaisaba Yopparaisaba uses mackerel that was raised on sake lees. https://www1.city.obama.fukui.jp/obm/yopparaisaba/ == Omizuokuri == Omizuokuri is an event that is held on every March second by Jinguji-Temple. In this event, they put purified water in the depth of Unose.Ten days after this event, an event called Omizutori is held in Nigatsu-do Hall in Nara Prefecture, and the water comes from Jinguji-Temple is drew up on Nigatsu-do Hall. ==References== ==Other websites== * Official website Category:Cities in Fukui Prefecture",
 "title": "Obama, Fukui"
}