{
 "id": "359056",
 "text": "Dax Randall Shepard (born January 2, 1975) is an American actor, writer and director. He is also known for his role as Tom Marshall in Without a Paddle. ==Personal life== Shepard started dating actress Kristen Bell in 2007. Their daughter, Lincoln Bell Shepard, was born on March 28, 2013. Dax and Bell married on October 17, 2013. Their second daughter, Delta Bell Shepard, was born on December 19, 2014. == Filmography == === Film === Year Title Role Notes 1996 Scream Thomas \"Tom\" Scott 1997 Scream 2 1998 Hairshirt Guy Vomiting at Party Credited as Dax Sheppard 2003 Cheaper by the Dozen Camera Crew Member 2004 Without a Paddle Tom Marshall 2005 Sledge: The Untold Story SFX Coordinator 2005 Zathura: A Space Adventure Walter the Astronaut 2006 Employee of the Month Vince Downey 2006 Idiocracy Frito Pendejo 2006 Let's Go to Prison John Lyshitski 2007 The Comebacks Sheriff 2007 Smother Noah Cooper 2008 Baby Mama Carl 2008 Confessions of an Action Star Bucky 2009 Old Dogs Gary Uncredited Cameo 2010 When in Rome Gale 2010 The Freebie Darren 2010 Brother's Justice Himself Also writer, director, stunt coordinator 2012 Hit and Run Charlie Bronson/Yul Perrkins Also writer, director, editor 2014 Veronica Mars Overconfident Club Boy Cameo 2014 This Is Where I Leave You Wade Beaufort 2014 The Judge C.P. Kennedy 2015 Motorcycle vs. Car Drift Battle 4 White Fang Short film 2017 CHiPS Jon Baker Also writer, director and producer 2017 El Camino Christmas Deputy Billy Calhoun 2020 Scooby Co-director, co-writer === Television === Year Title Role Notes 2003–2012 Punk'd Himself 56 episodes Dr. Iskarr 1 episode 2004–2008 King of the Hill Zack (voice) 2 episodes Asa (voice) 1 episode 2005 My Name Is Earl Dirk 1 episode 2005, 2016 Robot Chicken Various voices 4 episodes 2007 The Naked Trucker and T-Bones Show Joe Sands 1 episode 2007 Halfway Home Ben 1 episode 2009 The Goode Family Steve (voice) 1 episode 2010–2015 Parenthood Crosby Braverman Main role, 90 episodes director, 1 episode 2011 Good Vibes Jag Knullerbrod (voice) 1 episode Smilin' Mike (voice) 1 episode 2012–2013 A.N.T. Farm Derby 10 episodes 2013 Hollywood Game Night Himself 1 episode 2014–2015 About A Boy Crosby Braverman 2 episodes director, 1 episode 2014–2015 Web Therapy Abel Jans 3 episodes 2015 It's Always Sunny in Philadelphia Jojo 1 episode 2015 Parks and Recreation Hank Muntak 1 episode 2015 Comedy Bang! Bang! Himself 1 episode 2017 SuperMansion Titanium Dax (voice) 2 episodes 2017 Wet Hot American Summer: Ten Years Later Mikey 2 episodes 2017 Ghosted SAM 1 episode 2018 The Good Place Chet 1 episode ==References== ==Other websites== * Category:1975 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Comedians from Michigan Category:Actors from Detroit Category:American movie editors Category:American movie producers Category:Movie directors from Michigan Category:Screenwriters from Michigan",
 "title": "Dax Shepard"
}