{
 "id": "359357",
 "text": "The Tukeit Hill Frog (Allophryne ruthveni) is one of the two described species in the genus Allophryne. The other one is Allophryne resplendens. It is the only member of the subfamily Allophryninae, a clade recently placed under the family CentrolenidaeFrost, Darrel R.; Grant, Taran; Faivovich, Julián; Bain, Raoul H.; Haas, Alexander; Haddad, Celio F. B.; De Sa, Rafael O.; Channing, A.; Wilkinson, Mark; Donnellan, Stephen C.; Raxworthy, Christopher J.; Campbell, Jonathan A.; Blotto, Boris L.; Moler, Paul; Drewes, Robert C.; Nussbaum, Ronald A.; Lynch, John D.; Green, David M. & Wheeler, Ward C. (2006): The Amphibian Tree of Life]. Bulletin of the American Museum of Natural History 297: 1-370. PDF fulltext These frogs live in Guyana, Venezuela, Surinam, Brazil and Bolivia. The holotype was discovered at Tukeit Hill, below Kaieteur Falls, Guyana. This is the reason for the common English name. == Description == The Tukeit Hill Frog is a small frog. It can have different colors. They are either black, with stripes and spots which can be golden or dull yellow, or a dull yellow or golden stomach surface, with black strips and spots. It has a flat body, and small flat head. The toe pads are large, wider than the fingers. == Behaviour == The Tukeit Hill Frog spends some time low in the trees, 1–3 metres, and some of the time on the ground. This frog lives in sparse forest, avoiding cleared land. ==References== * Austin, J. D.; Lougheed, S. C.; Tanner, K; Chek, A. A.; Bogart, J. P. & Boag, P. T. (2002): A molecular perspective on the evolutionary affinities of an enigmatic neotropical frog, Allophryne ruthveni. Zool. J. Linn. Soc. 134(3): 335–346. PDF fulltext * Cannatella, David (1996): The Tree of Life Web Project: Allophryne ruthveni . Version of 1 January 1996; retrieved 2007-JAN-06. * Cogger, H. G.; Zweifel, R. G. & Kirschner, D. (2004): Encyclopedia of Reptiles & Amphibians (2nd edition). Fog City Press. * Frost, Darrel R.; Grant, Taran; Faivovich, Julián; Bain, Raoul H.; Haas, Alexander; Haddad, Celio F. B.; De Sa, Rafael O.; Channing, A.; Wilkinson, Mark; Donnellan, Stephen C.; Raxworthy, Christopher J.; Campbell, Jonathan A.; Blotto, Boris L.; Moler, Paul; Drewes, Robert C.; Nussbaum, Ronald A.; Lynch, John D.; Green, David M. & Wheeler, Ward C. (2006): The Amphibian Tree of Life]. Bulletin of the American Museum of Natural History 297: 1-370. PDF fulltext * InfoNatura (2005): Allophryne ruthveni Version 4.1, 28 June 2005. Retrieved 2007-JAN-06. * Database entry includes a range map and a brief justification of why this species is of least concern Category:Frogs of South America",
 "title": "Tukeit Hill frog"
}