{
 "id": "35941",
 "text": "Countdown is a British game show on Channel 4. It began on 2 November 1982 as the first programme to air on Channel 4. It is currently presented by Colin Murray and Rachel Riley with etymologist Susie Dent in Dictionary Corner alongside a celebrity guest. It was hosted by Richard Whiteley until his death in 2005, then by Des Lynam from 2005 to 2006 and then by Des O'Connor from 2007 to 2008. Both O'Connor and Carol Vorderman, the show's co-host who has been on the programme since it began, left the show in December 2008. From 2009, Jeff Stelling and Rachel Riley replaced O'Connor and Vorderman respectively. It has been hosted by Nick Hewer from 2012 to 2021, on 28 June 2021, Anne Robinson became the host but she presented her final show on 13 July 2022 with Colin Murray taking over the next day. The show was 30 minutes long, but since 2001, it is 45 minutes long. With nearly 8,000 episodes, it is one of the longest-running game shows in the world, along with the original French version Des chiffres et des lettres which has been running on French television continuously since 1972. ==Origin== Countdown originated from the format of the French game show Des chiffres et des lettres (Numbers and Letters), created by Armand Jammot. After watching the programme, Belgian record executive Marcel Stellman brought the format to Britain on the belief it could be popular overseas and proposed his concept for the British version to several networks. The concept was purchased in the early 1980s by Yorkshire Television which commissioned a series of eight shows under the title Calendar Countdown, aimed at being a spin-off of their regional news programme Calendar with the programme's host Richard Whiteley deemed the natural choice for the concept. The spin-off was aired only in the Yorkshire area,Countdown: Spreading the Word (Granada Media, 2001) p. 9–15. with Whiteley earning the nickname of \"Twice Nightly Whiteley\" because of his daily appearances on both programmes.BBC.co.uk obituary for Richard Whiteley—Retrieved 24 June 2006. He was assisted by Cathy Hytner and Denise McFarland-Cruickshanks who handled the letters and numbers rounds respectively.Countdown: Spreading the Word (Granada Media, 2001) p. 17–18. By 1982, after an additional pilot episode was made with a refined format, an episode that was never broadcast -Countdown: Spreading the Word (Granada Media, 2001) p. 20. the show was bought up by Channel 4, a new British television channel set to launch in November 1982, based on the refined concept. While Whiteley and Hytner from the original cast were retained, the programme was renamed Countdown, with the format was expanded to include additional members in the hosting team, including letters and number experts. An additional spin-off to the programme for young contestants was proposed at the same time, dubbed Junior Countdown, the concept would be similar in format, but with it hosted by Gyles Brandreth and Ted Moult, but while a pilot was created, the proposal was abandoned after it was found to be highly flawed. Instead, the production staff opted to allow contestants of differing ages, young and old, to participate on Countdown. The show with its first episode was the first to be broadcast when the channel launched on 2 November 1982,IMDB.com on Countdown trivia—Retrieved 20 June 2006. with Whiteley opening the programme with the line: —Richard Whiteley introducing the first Channel 4 episode of Countdown.UK Game Shows on Countdown's first episode—Retrieved 26 June 2006. ==Whiteley tenure== Alongside the original cast from Calendar Countdown, the new format of the show led to production staff seeking out further hostesses through advertisements in national newspapers for young women to become a member of the programme's cast, with notable conditions about their involvement, in particular, those recruited for calculations found it made clear that as an applicant, their appearance would be less important than their skill as a mathematician.], on the advertisement to which Vorderman responded. Retrieved 6 July 2006. Amongst those recruited, Beverley Isherwood was hired to work alongside Hytner in handling the selection of number and letter tiles respectively, while Linda Barrett and Carol Vorderman were recruited for checking over calculations by contestants in the numbers round. In addition, a lexicographer was also required to form part of the format's \"Dictionary Corner\" segment of the show, in order to verify words given by contestants in the letters round (see Letters round rules), along with pointing out any longer or otherwise interesting words available, such a role was aided by the show's producers, with no assistance from any computer programme and the role accompanied by a celebrity guest for a set period on the programme, contributing words and providing entertainment through anecdotes, puzzles, poems and stories.Countdown: Spreading The Word, (Granada Media, 2001), p. 119–131. Amongst these who have appeared on the programme are Nigel Rees, Jo Brand, Martin Jarvis, Richard Digance, Geoffrey Durham, Ken Bruce, Magnus Magnusson, Pam Ayres, Paul Zenon, Jenny Eclair, Al Murray, John Sergeant and Gyles Brandreth. Over time, the additional hostesses on the programme were dropped by production staff but retained Vorderman and assigned her primarily to handle the selection of letter and number tiles, as well as verifying contestant calculations. Thus her role was expanded to that of a co-presenter alongside Whiteley in 1989.Independent.co.uk on viewer dissatisfaction with Vorderman's expanded role—Retrieved 20 June 2006. The programme frequently rotated between various lexicographers, including Richard Samson and Alison Heard, for each series, until in 2003 the role was permanently given to Susie Dent, after her debut on Countdown in 1992.The Countdown Page on lexicographers. On 26 June 2005, Whiteley died after a failed heart operation. At the time, he had been slowly recovering from pneumonia earlier that year. This had prevented him from recording further episodes. His death impacted the show, at the time on its 53rd series, causing the episode due to air on 27 June to be postponed by Channel 4 by one day as a mark of respect, while the remaining episodes he had managed to complete were aired after his death, beginning with a tearful tribute from Vorderman with the episode aired on 28 June. After the series' conclusion, Countdown was placed into hiatus after 1 July, the series Grand Final, to determine how to proceed. ==Post-Whiteley== In October 2005, Channel 4 announced that Des Lynam would take over as the main presenter, having previously participated in the celebrity edition (Celebrity Countdown) in April 1998.BBC NEWS | Entertainment | Des Lynam to take over Countdown, BBC News, on Des Lynam as the new presenter of Countdown. Retrieved 20 June 2006. His first show aired on 31 October 2005 and between January and April 2006, additional episodes aired on Saturdays. Lynam's tenure ran until December 2006, whereupon his demanding filming schedule forced him to resign from the programme.BBC NEWS | Entertainment | Des Lynam quits TV Countdown quiz, BBC News, on Lynam leaving the programme. Retrieved 30 September 2006. His departure was due to the travel requirements that his 2007 schedule required of him, despite an effort by Channel 4 to deal with this by changing the filming location from Leeds to a site closer to his residence in Worthing, West Sussex, viewers reacted angrily to the idea, while Lynam decided it would cause considerable disruption for many of the programme's camera crew. In January 2007, Des O'Connor took over as the main presenter.BBC NEWS | Entertainment | O'Connor to be new Countdown host, BBC News, on Des O'Connor succeeding Des Lynam as host. Retrieved 13 November 2006. During his tenure as host, Dent went on maternity leave over the Winter of 2007–08 and Alison Heard temporarily replaced her on the programme until 6 February 2008. By July 2008, both O'Connor and Vorderman had announced that they would be leaving by the end of that year, after the end of the 59th series. While O'Connor decided to leave in order to concentrate on other projects, Vorderman left after her offer to take a 33% salary decrease was rejected and production staff asked her to take a 90% pay cut, her agent stated that staff had told him that the show had survived without Whiteley and could \"easily survive without you\". Some media reports suggested that the new presenter would be either Rory Bremner, the early favourite, or Alexander Armstrong, but both ruled themselves out of the job. At the same time there was speculation that several prominent women, including Anthea Turner, Ulrika Jonsson and Myleene Klass, were strong candidates to take over Vorderman's job, but Channel 4 revealed that the role was to be assigned to a previously unknown male or female arithmetician with \"charm and charisma\", like what they did 26 years earlier when the show launched. O’Connor and Vorderman’s final episode aired on 12 December 2008. In November 2008, Jeff Stelling was confirmed as the new host, while Oxford maths graduate Rachel Riley was confirmed as Vorderman's replacement. Their first episode aired on 12 January 2009. Stelling remained with the programme until his last episode aired on 16 December 2011 when his football commitments with Sky Sports forced him to reluctantly leave Countdown. Prior to his departure, The Apprentice star Nick Hewer was announced as his replacement and he took over as the main presenter when his first episode aired on 9 January 2012. In 2020, during the ongoing COVID-19 pandemic, it was announced that Colin Murray, a frequent Dictionary Corner guest, would fill in for Hewer while he spent a period of time in isolation due to the UK's second lockdown. On 7 December 2020, Hewer announced that he would be stepping down as the host of Countdown at the end of series 83 in June 2021. Hewer said it had been \"privilege and a pleasure to take the helm of Countdown\". It was then announced on 15 February 2021 that Anne Robinson would take over from Hewer at the start of series 84. Hewer's final show aired on 25 June 2021. Anne Robinson became the new host of Countdown on 28 June 2021, while on 10 September, Sir Trevor McDonald presented a special \"Black To Front\" episode featuring an all-black cast and black contestants with whoever winning that show would continue their run into the next episode. On 13 December, Rachel Riley took maternity leave and was temporarily replaced with Dr Anne-Marie Imafidon until 14 March 2022 when Riley returned the following day. On 2 May 2022, it was announced that Anne Robinson would be stepping down from Countdown with immediate effect and hosted her last episode on 13 July, early in series 86, a day later, Colin Murray returned to present the show. However, in August, Murray was unwell with COVID-19 and was temporarily replaced with 2 presenters, firstly with Les Dennis, best known for presenting Family Fortunes, between 4 and 15 August, then with comedian and Dictionary Corner regular Jenny Eclair, between 16 and 19 August, Murray returned on 22 August. In November 2022, Countdown celebrated 40 years on the air and throughout the month, 4 guest presenters appeared in place of Colin Murray while the first week of shows had archive clips in place of Teatime Teasers, children's TV presenter Floella Benjamin hosted the first week from 31 October to 4 November, followed by musician and clergyman Richard Coles from 7 to 11 November, then newsreader Sir Trevor McDonald, who had previously hosted the \"Black To Front\" episode the previous year from 14 to 18 November, and lastly, fellow newsreader Moira Stuart hosted from 21 to 25 November, Murray returned on 28 November. == Intro == The Countdown intro has changed over time since it began in 1982. For the 1981 pilot, it was a round span with pink words 'Calendar Countdown'. The first intro after the beginning of Countdown in 1982 was a black background with the words Countdown in yellow. After this, it was blue until the late 80s/early 90s, COUNT DOWN with the background having letters and numbers (until the mid 90s), then a yellow triangle with Countdown in Red. From 1999, the clock appeared for the first time in the Countdown intro, the background was into a mash of pink and orange, and COUNTDOWN in white under the clock. This continued until 2001 when the current clock and letters 'Countdown' were introduced, until 2003, there were montages of the show in front of the tangerine set. And then in 2003, montages changed to those on the new pink and white striped set. After Whiteley died in 2005, the Lynam and O'Connor series had letters spitting out of the clock in the same colour form, eventually merging into 'Countdown'. With the introduction of Stelling in 2009, the background changed to blue and the letters continued to spit out of the clock. Merging into Countdown. In 2012, the background once again changed to dark blue and the intro would start with a globe of letters and numbers breaking, and then later merging into Countdown, just as it did since the early 2000s. ==Character== Countdown quickly established cult status within British televisionScotsman.com on Countdown establishing cult status – an image which it maintains today,BBC.co.uk Richard Whiteley obituary on the show's audience and cult status. Retrieved 24 June 2006. despite the loss of key presenters. The programme's audience comprises mainly students, homemakers and pensioners, owing to the \"teatime\" broadcast slot and inclusive appeal of its format and presentation. Countdown has been one of Channel 4's most-watched programmes for over twenty years, but has never won a major television award.Spreading the Word (Granada Media, 2001), p. 74. When Des Lynam became the new presenter after Whiteley's death in 2005, the show regularly drew an average 1.7 million viewers every day; this was around half a million more than in the last few years of Richard Whiteley presenting.DailyRecord.co.uk. The Series 54 final, on 26 May 2006, attracted 2.5 million viewers.UKGameshows.com on Series 54 final viewing figures—Retrieved 10 July 2006. 3–4 million viewers had watched the show daily in its previous 16:15 slot. The drop in viewing figures following the scheduling change, coupled with the show's perceived educational benefits, even caused Labour Member of Parliament (MP) Jonathan Shaw to table a motion in the UK Parliament, requesting that the show be returned to its later time. Minor scheduling changes have subsequently seen the show move from 15:15 to 15:30, 15:45, 15:25 and 15:10. As of 2018, it is broadcast at 14:10. On each episode, the prize for defeating the reigning champion is a teapot that is styled to resemble the 30-second time clock used in each round. Introduced in December 1998, the pot is custom-made and can only be obtained by winning a game on the programme.Nebagram.co.uk on the prizes—page Retrieved 24 June 2006. Defeated contestants receive an assortment of Countdown-themed merchandise as a parting gift. At first, the prize for the series winner was a leather-bound copy of the twenty-volume Oxford English Dictionary, worth over £4,000. Since 2011, the prize consists of ordinary hardback twenty-one-volume dictionaries, a laptop computer and a lifetime subscription to Oxford Online (replaced by a MacBook pro laptop by series 68). David Acton, winner of Series 31, opted for a CD-ROM version of the dictionaries, not wanting to accept leather-bound books owing to his strict veganism, and he donated the monetary difference to charity.Countdown: Spreading the Word (Granada Media, 2001) p. 147. Since Series 54 in 2006, the series champion also receives the Richard Whiteley Memorial Trophy, in memory of the show's original presenter. Though the style and colour scheme of the set have changed many times (and the show itself moved to Manchester, after more than 25 years in Leeds), the clock has always provided the centrepiece and, like the clock music composed by Alan Hawkshaw, is an enduring and well-recognised feature of Countdown. Executive producer John Meade once commissioned Hawkshaw to revise the music for extra intensity to introduce at the start of series 31 in January 1996; after hundreds of complaints from viewers, the old tune was reinstated after just 12 shows.Countdown: Spreading the Word (Granada Media, 2001) p. 33. The original clock featured until September 2013, when it was replaced. ==Celebrations== The first episode of Countdown was repeated on 1 October 2007 on More4 and also on 2 November 2007 on Channel 4; this was as part of Channel 4 at 25, a season of programmes to celebrate its 25th birthday. On 2 November 2007, Countdown celebrated its twenty-fifth anniversary and aired a special 'birthday episode'. The two players were 2006 winner Conor Travers and 2002 winner Chris Wills. However, for the rounds, VIP guests selected the letters and numbers.Episode 4473 – Countdown Guests included Gordon Brown, Amir Khan and Richard Attenborough. A statement from the French TV network France Télévisions was read out on air by Vorderman to commend Channel 4 on its success of Countdown. On 26 March 2010, Queen Elizabeth II congratulated Countdown for amassing 5,000 episodes. On 5 September 2014, the programme received a Guinness World Record at the end of its 6,000th show for the longest-running television programme of its kind during the course of its 71st series. ==Format== Countdown has occupied a tea-time broadcast slot since its inception, originally in a 30-minute format. Since 2001, an episode lasts around 45 minutes including advertising breaks. During the normal series, the winner of each game returns for the next day's show. A player who wins eight games is declared an \"octochamp\" and retires from the programme. At the end of the series, the eight best players (ranked first by number of wins, then by total score if required to break a tie) are invited back to compete in the series finals. They are seeded in a knockout tournament, with the first seed playing the eighth seed, the second playing the seventh, and so on. The winner of this knockout, which culminates in the Grand Final, becomes the series champion. Each series lasts around six months, with about 125 episodes.Countdown: Spreading The Word (Granada Media, 2001) p. 87. Approximately every four series, a Champion of Champions tournament takes place. For this, sixteen of the best players to have appeared since the previous Championship are invited back for another knockout tournament. The producer, former contestant Damian Eadie, decides which players to include, but typically the tournament includes the series winners and other noteworthy contestants.The Countdown Page Julian Fell's Countdown \"experience\"—Retrieved 24 June 2006. Series 33 was designated a \"Supreme Championship\", in which 56 of the best contestants from all the previous series returned for another knockout tournament. Series 10 champion Harvey Freeman was declared Supreme Champion after beating Allan Saldanha in the final.Countdown: Spreading The Word (Granada Media, 2001), p. 220. There are also occasional special episodes, in which past contestants return for themed matches. For example, David Acton and Kenneth Michie returned for a rematch of their Series 31 final, while brothers and former contestants Sanjay and Sandeep Mazumder played off against each other on 20 December 2004.The Countdown Page list of special episodes and their themes—Retrieved 20 June 2006. Since the change to 45-minute episodes, the game has been split into three sections, separated by advertising breaks. The first section contains two letters rounds and a numbers round, the second has two letters rounds and a numbers round followed by the anecdote from the Dictionary Corner guest and then a further two letters rounds and a numbers round, while the last section has two letters rounds, Susie Dent's \"Origins of Words\" item, two further letters rounds, a numbers round and a final \"Conundrum\" puzzle. With the exception of the Conundrum, the contestants swap control after every round so that each of them has control for five letters rounds and two numbers rounds. At the end of the first two sections, Each presenter poses a Teatime Teaser for the viewers, giving a set of short words and a cryptic clue to a single word that can be anagrammed from them. The solution is revealed at the start of the next section. (Example: Given the words HAD SAIL and the clue \"Flowers seen 7 times a week,\" the solution would be DAHLIAS, given the words GON GOLD and the clue \"A greyhound at full stretch, perhaps,\" the solution would be LONGDOG, given the words NUDE LUMP and the clue \"It helps you get into the swing of things,\" the solution would be PENDULUM, given the words WOECALLS and the clue \"This is something for you to chew over,\" the solution would be COLESLAW, given the words ICYHINGE and the clue \"It's the condition of good clean fun,\" the solution would be HYGIENIC, and given the words SAD MOODY and the clue \"We'll all be sad and moody when this arrives,\" the solution would be DOOMSDAY.) When the Teatime Teaser was first introduced, the anagrams were seven letters long; they were later extended to eight, then to nine in late 2016 before returning to 8 in 2020. == References == == Other websites == * Category:1982 television series debuts Category:1980s British television series Category:1990s British television series Category:2000s British television series Category:2010s British television series Category:British television game shows Category:Channel 4 television programmes Category:English-language television programs",
 "title": "Countdown (game show)"
}