{
 "id": "359493",
 "text": "Myobatrachidae is a family of frogs found in Australia and New Guinea. Members of this family vary greatly in size. There are species less than long. This family also has the second-largest frog in Australia, the Giant Barred Frog at in length. The entire family either live in land or water. None of them live in trees. These frogs do not have the adhesive toe disc cups found in the tree frogs. The family is broken up into three sub-families: Limnodynastinae, Myobatrachinae and Rheobatrachinae. This separation is based mainly on their egg-laying habits. Those of the sub-family Limnodynastinae lay foam nests. The female makes foam with a chemical on her skin. The foam may float on top of water, or be on land. The sub-family Rheobatrachinae has the two species of gastric-brooding frog, and the rest are in the sub-family Myobatrachinae. ==Taxonomy== Subfamilia Species Common name Binomial name LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 1 Tusked Frog Adelotus LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 6 Giant Burrowing Frogs Heleioporus LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 4 Cannibal Frogs Lechriodus LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 11 Australian Swamp Frogs Limnodynastes LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 10 Stubby Frogs Neobatrachus LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 4 Australian Spadefoot Toads Notaden LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 2 Burrowing Frogs Opisthodon LimnodynastinaeConsidered a family - Limnodynastidae by some authors. 6 Baw Baw Frogs Philoria MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Australian Dumpy Frogs Arenophryne MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Pouched Frogs Assa MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 15 Australian Froglets Crinia MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 7 Ground Froglets Geocrinia MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Nicholls' Toadlets Metacrinia MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 8 Barred Frogs Mixophyes MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Turtle Frogs Myobatrachus MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Haswell's Frogs Paracrinia MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 13 Crowned Toadlet Pseudophryne MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 1 Sunset Frog Spicospina MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 6 Australian Torrent Frogs Taudactylus MyobatrachinaeConsidered a family - Myobatrachidae by some authors. 25 Australian Toadlets Uperoleia RheobatrachinaeCombined with the Myobatrachidae by some authors. 2 Gastric Brooding Frogs Rheobatrachus ==References== * Category:Frogs of Australia Category:Frogs of Oceania",
 "title": "Myobatrachidae"
}