{
 "id": "359826",
 "text": "A papal name is a special name (regnal name) which is chosen by the pope when he is elected.MSNBC.com, \"What’s in a pope’s name?\" April 19, 2005; retrieved 2012-8-28. ==History== In the early church, popes were known by their ordinary names, such as Pope Adeodatus, Pope Formosus and Pope Hyginus. The practice of choosing a papal name started in the sixth century. At birth, Pope John II was named after the Roman god Mercury. When he was elected pope, he chose to be called by a Christian name. Papal names became customary in the 10th century. In 996, the first German pope was chosen; and he changed his name from Bruno to Gregory. He is known as Pope Gregory V. Every pope since the 16th century is known by a different name than the one he was given at birth. \"List of Popes,\" Catholic Encyclopedia (2009); retrieved 2013-3-16. ==Frequency of names== The papal names have included John (23 times), Gregory (16), Clement (14), Innocent (14), Leo (14) and Pius (12). \"How Pope gets named,\" Sydney Morning Herald (Australia). April 4, 2005; retrieved 2012-8-28. The first papal name to be repeated was Pope Sixtus. There have been four others. As with kings and emperors, a Roman numeral is added if the Pope chooses a name that another pope has used before \\-- for example, Pope John Paul II decided to be known by the same name as the pope who came before him. Name # Popes Notes 1\\. John 21 I II III IV V VI VII VIII IX X XI XII XIII XIV XV XVI XVII XVIII XIX XX XXI XXII XXIII * John XVI = antipope * There was no John XX 2\\. Gregory 16 I II III IV V VI VII VIII IX X XI XII XIII XIV XV XVI 3\\. Benedict 15 I II III IV V VI VII VIII IX X XI XII XIII XIV XV XVI * Benedict X = antipope 4\\. Clement 14 I II III IV V VI VII VIII IX X XI XII XIII XIV 5\\. Leo 14 I II III IV V VI VII VIII IX X XI XII XIII XIV 6\\. Innocent 13 I II III IV V VI VII VIII IX X XI XII XIII 7\\. Pius 12 I II III IV V VI VII VIII IX X XI XII 8\\. Stephen 9 I II III IV V VI VII VIII IX Pope Stephen II died in 752 after election but before being consecrated. The next pope took the same name in 752; and he is known as either Stephen II or III. 9\\. Boniface 8 I II III IV V VI VII VIII IX * Boniface VII = antipope. 10\\. Urban 8 I II III IV V VI VII VIII 11\\. Alexander 7 I II III IV V VI VII VIII * Alexander V = antipope 12\\. Adrian 6 I II III IV V VI 13\\. Paul 6 I II III IV V VI 14\\. Celestine 5 I II III IV V 15\\. Nicholas 5 I II III IV V 16\\. Sixtus 5 I II III IV V 17\\. Anastasius 4 I II III IV 18\\. Eugene 4 I II III IV 19\\. Honorius 4 I II III IV 20\\. Sergius 4 I II III IV 21\\. Callixtus 3 I II III 22\\. Felix 3 I II III IV V * Felix II and Felix V = antipope 23\\. Julius 3 I II III 24\\. Lucius 3 I II III 25\\. Martin 3 I II III IV V *There was no Martin II or Martin III 26\\. Sylvester 3 I II III 27\\. Victor 3 I II III 28\\. Adeodatus 2 I II 29\\. Agapetus 2 I II 30\\. Damasus 2 I II 31\\. Gelasius 2 I II 32\\. John Paul 2 I II 33\\. Marcellus 2 I II 34\\. Marinus 2 I II * Marinus I is not \"Martin[us] II\" * Marinus II is not \"Martin[us] III\" 35\\. Paschal 2 I II 36\\. Pelagius 2 I II 37\\. Theodore 2 I II 38\\. Agatho 1 39\\. Anacletus 1 40\\. Anicetus 1 41\\. Anterus 1 42\\. Caius 1 43\\. Conon 1 44\\. Constantine 1 45\\. Cornelius 1 46\\. Dionysius 1 47\\. Donus 1 48\\. Eleuterus 1 49\\. Eusebius 1 50\\. Eutychian 1 51\\. Evaristus 1 52\\. Fabian 1 53\\. Formosus 1 54\\. Francis 1 55\\. Hilarius 1 56\\. Hormisdas 1 57\\. Hyginus 1 58\\. Lando 1 59\\. Liberius 1 60\\. Linus 1 61\\. Marcellinus 1 62\\. Mark 1 63\\. Miltiades 1 64\\. Peter 1 65\\. Pontian 1 66\\. Romanus 1 67\\. Sabinian 1 68\\. Severinus 1 69\\. Silverius 1 70\\. Simplicius 1 71\\. Siricius 1 72\\. Sisinnius 1 73\\. Soter 1 74\\. Symmachus 1 75\\. Telesphorus 1 76\\. Valentine 1 77\\. Vigilius 1 78\\. Vitalian 1 79\\. Zachary 1 80\\. Zephyrinus 1 81\\. Zosimus 1 ==Related pages== * Habemus Papam == References == ==Other websites== * Pope tells why he chose the name of \"Benedict XVI\"",
 "title": "Papal name"
}