{
 "id": "360231",
 "text": "Kenny Everett (25 December 1944 – 4 April 1995) was a British comedian, radio DJ and television entertainer. Born Maurice James Christopher Cole, Everett is best known for his career as a radio DJ and for The Kenny Everett Video Show. ==Personal life== Everett married singer Lee 'Lady Lee' Middleton (Billy Fury's former girlfriend) in 1966. By 1979 they had separated. In the mid-1980s, he publicly acknowledged his homosexuality. Everett was told in 1989 that he had HIV. He went public with his illness in 1993. He died from an AIDS-related illness in London on 4 April 1995, aged 50. ==Shows presented== The following is a list of the main shows Everett presented. ===Radio=== * Kenny & Cash Show Radio London – 1964–1965 * Kenny Everett Show Radio Luxembourg – 1966 * Midday Spin BBC Radio 1 – 1967 * Everett is Here BBC Radio 1 Saturdays 10am–12midday – 1968–1970 * Kenny Everett Show BBC Local Radio – 1971 * Kenny Everett Show BBC Radio 1 Sundays 1–3pm – 1972 * Breakfast Show Capital Radio – 1973–1974 * Kenny Everett Show Capital Radio – 1974–1980 * Kenny Everett Show Radio Victory – 1975–1976 * Captain Kremmen Radio Victory – 1976 * Kenny Everett Show BBC Radio 2 Saturdays 11am–1pm – 1981–1983 * Kenny Everett Show Capital Radio Saturdays 11am–1pm – 1984–1988 * Weekday afternoons Capital Gold 1–4pm – 1988–1991 * Weekday mid-mornings Capital Gold 9am–12midday – 1991–1994 ===Television=== * Nice Time Granada Television – 1968 * The Kenny Everett Explosion LWT – 1970 * The Kenny Everett Video Show Thames Television – 1978–1980 * The Kenny Everett Video Cassette Thames Television – 1981 * The Kenny Everett Television Show BBC One – 1981–1988 * Brainstorm BBC – 1988 * Gibberish BBC – 1992 ==Tributes & portrayals== On 18 November 2007, ITV1 broadcast a tribute show to Everett called Licence To Laugh. Friends and colleagues said what it was like to know and work with the man they affectionately called \"Cuddly Ken\". Additionally, current celebrities such as Chris Moyles and Chris Tarrant talked about their love for the outrageous entertainer. They shared the ways in which Everett had influenced them and their work. It also had archive footage. In March 2010 the BBC said it was making a 90-minute TV biopic called Number One in Heaven. It was to be written by Tim Whitnall and focus on Everett's unhappiness at secondary school.Kenny Everett to return to TV as BBC announces plans for biopic 15 March 2010. Retrieved 15 March 2010. In April 2012 the BBC said it was working on a 90-minute TV biopic called The Best Possible Taste. This would focus on the performer's relationship with his ex-wife, singer Lee Middleton.Kenny Everett biopic for BBC Four 03 April 2012. Retrieved 03 April 2012. ==References== ==Other websites== * Category:1944 births Category:1995 deaths Category:British radio personalities Category:British television writers Category:Comedians from Lancashire Category:Deaths from AIDS Category:English LGBT people Category:Gay men Category:LGBT broadcasters Category:LGBT comedians Category:Infectious disease deaths in England Category:Writers from Lancashire",
 "title": "Kenny Everett"
}