{
 "id": "360228",
 "text": "Blackadder II is the second series of the BBC sitcom Blackadder. It was written by Richard Curtis and Ben Elton. It aired from 9 January to 20 February 1986. The series is set in England during the reign of Queen Elizabeth I (1558-1603). The main character, Edmund, Lord Blackadder is a Tudor courtier trying to win the favour of the Queen while avoiding the fate of many of her suitors. The series had several from the format of The Black Adder. These changes were: Ben Elton replaced Rowan Atkinson as the second writer, it was made in studio sets, rather than on location, the introduction of the more familiar Machiavellian \"Blackadder\" character and a less intelligent Baldrick.Lewisohn, Mark, Blackadder II at the former BBC Guide to Comedy, Retrieved 17 March 2007 ==Cast== The size of the main cast was smaller compared to the previous series. A fixed number of characters appeared in every episode. * Rowan Atkinson as Lord Edmund Blackadder * Tim McInnerny as Lord Percy Percy, Heir to the Duchy of Northumberland * Tony Robinson as Baldrick * Miranda Richardson as Queen Elizabeth I of England * Stephen Fry as Lord Melchett, the Lord Chamberlain * Patsy Byrne as Nursie The series also had at least one significant cameo role per episode. There were notable appearances from Rik Mayall, playing Lord Flashheart in \"Bells\", two figures famous for their roles in science fiction series - Tom Baker and Simon Jones - in \"Potato\", Miriam Margolyes, as the puritanical Lady Whiteadder, and Hugh Laurie appearing twice, first as the drunken Simon Partridge in \"Beer\" and in the final episode as the evil Prince Ludwig. Laurie was later given a larger role as George in the next two series. ==References== ==Other websites== * Blackadder II at the former BBC Guide to Comedy (archive) Category:1986 television series debuts Category:1986 television series endings Category:1980s British sitcoms Category:BBC television sitcoms Category:Fiction set in the past Category:Television series set in London Category:English-language television programs Category:1980s British television series debuts",
 "title": "Blackadder II"
}