{
 "id": "360288",
 "text": "Hyperland is a 50-minute long documentary movie about hypertext and surrounding technologies. It was written by Douglas Adams and produced and directed by Max Whitby.Ted Nelson: Possiplex. 2010, page 272f. It ran on BBC Two in 1990. It stars Douglas Adams as a computer user and Tom Baker as a personification of a software agent. In the show Adams has a dream where he is browsing through various media. While Adams is browsing, many people and projects related to the general theme of hypertext and multimedia are presented: * Vannevar Bush and his Memex concept * Ted Nelson explains hypertext and Project Xanadu. * Hans Peter Brøndmo talks about the idea of animated icons. * Robert Winter talks about an interactive version of Beethoven's 9th Symphony. * An idea from Kurt Vonnegut's book Palm Sunday is presented: stories and narrative structures have shapes that can be represented mathematically as graphs. * Robert Abel shows his multimedia version of Picasso's Guernica. * Apple Multimedia Lab employees Steve Gano, Kristee Kreitman, Kristina Hooper, Michael Naimark and Fabrice Florin talk about a multimedia version of Life Story, a BBC TV movie dramatisation of the 1953 discovery of the structure of DNA. * Amanda Goodenough presents Inigo Gets Out, an interactive story for children using Hypercard. * Brad deGraf and Michael Wahrman talk about their digital puppet Mike Normal. * A NASA Ames Research Center scientist presents a prototype Virtual Reality helmet called Cyberiad. * Marc Canter makes a cameo (non-)appearance as an animated icon that is not \"clicked\" by Adams; the audience never gets to see his interview. The dream (and the documentary) ends with a vision of how information might be accessed in 2005. Hyperland does describe a number of features of the modern web. This is especially noteworthy because it predates the public release of the first Web browser by about a year. == References == == Other websites == * Douglas Adams Homepage about Hyperland * An excerpt from the documentary featuring Ted Nelson * Category:BBC Television programmes",
 "title": "Hyperland"
}