{
 "id": "360395",
 "text": "Performance by an Actress in a Supporting Role is one of the Academy Awards of Merit. It is presented each year by the Academy of Motion Picture Arts and Sciences (AMPAS). It is to recognize an actress with an outstanding performance in a movie. Since the beginning, the award has commonly been called the Oscar for Best Supporting Actress. Actresses are nominated for this award by Academy members who are actors and actresses themselves. Winners are selected by the academy membership as a whole. ==Winners and nominees== Winners are listed first in bold, followed by the other nominees. ===1930s=== Year Actress Film Role(s) 1936 (9th) 1936 (9th) Gale Sondergaard Anthony Adverse Faith Paleologus 1936 (9th) Beulah Bondi The Gorgeous Hussy Rachel Jackson 1936 (9th) Alice Brady My Man Godfrey Angelica Bullock 1936 (9th) Bonita Granville These Three Mary Tilford 1936 (9th) Maria Ouspenskaya Dodsworth Baroness Von Obersdorf 1937 (10th) 1937 (10th) Alice Brady In Old Chicago Molly O'Leary 1937 (10th) Andrea Leeds Stage Door Kay Hamilton 1937 (10th) Anne Shirley Stella Dallas Laurel \"Lollie\" Dallas 1937 (10th) Claire Trevor Dead End Francey 1937 (10th) May Whitty Night Must Fall Mrs. Bramson 1938 (11th) 1938 (11th) Fay Bainter Jezebel Aunt Belle Massey 1938 (11th) Beulah Bondi Of Human Hearts Mary Wilkins 1938 (11th) Billie Burke Merrily We Live Emily Kilbourne 1938 (11th) Spring Byington You Can't Take It with You Penny Sycamore 1938 (11th) Miliza Korjus The Great Waltz Carla Donner 1939 (12th) 1939 (12th) Hattie McDaniel Gone with the Wind Mammy 1939 (12th) Olivia de Havilland Gone with the Wind Melanie Hamilton 1939 (12th) Geraldine Fitzgerald Wuthering Heights Isabella Linton 1939 (12th) Edna May Oliver Drums Along the Mohawk Sarah McKlennar 1939 (12th) Maria Ouspenskaya Love Affair Grandmother Janou ===1940s=== Year Actress Film Role(s) 1940 (13th) 1940 (13th) Jane Darwell The Grapes of Wrath Ma Joad 1940 (13th) Judith Anderson Rebecca Mrs. Danvers 1940 (13th) Ruth Hussey The Philadelphia Story Elizabeth Imbrie 1940 (13th) Barbara O'Neil All This and Heaven Too Duchesse de Praslin 1940 (13th) Marjorie Rambeau Primrose Path Mamie Adams 1941 (14th) 1941 (14th) Mary Astor The Great Lie Sandra Kovak 1941 (14th) Sara Allgood How Green Was My Valley Beth Morgan 1941 (14th) Patricia Collinge The Little Foxes Birdie Hubbard 1941 (14th) Teresa Wright The Little Foxes Alexandra Giddens 1941 (14th) Margaret Wycherly Sergeant York Mother York 1942 (15th) 1942 (15th) Teresa Wright Mrs. Miniver Carol Beldon 1942 (15th) Gladys Cooper Now, Voyager Mrs. Vale 1942 (15th) Agnes Moorehead The Magnificent Ambersons Fanny Minafer 1942 (15th) Susan Peters Random Harvest Kitty Chilcet 1942 (15th) May Whitty Mrs. Miniver Lady Beldon 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. Katina Paxinou For Whom the Bell Tolls Pilar 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. Gladys Cooper The Song of Bernadette Sister Marie Therese Vauzous 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. Paulette Goddard So Proudly We Hail! Lt. Joan O'Doul 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. Anne Revere The Song of Bernadette Louise Soubirous 1943 (16th)Beginning with the 1943 awards, winners in the supporting acting categories were awarded Oscar statuettes similar to those awarded to winners in all other categories, including the leading acting categories. Prior to this, however, winners in the supporting acting categories were awarded plaques. Lucile Watson Watch on the Rhine Fanny Farrelly 1944 (17th) 1944 (17th) Ethel Barrymore None but the Lonely Heart Ma Mott 1944 (17th) Jennifer Jones Since You Went Away Jane Deborah Hilton 1944 (17th) Angela Lansbury Gaslight Nancy Oliver 1944 (17th) Aline MacMahon Dragon Seed Ling Tan's Wife 1944 (17th) Agnes Moorehead Mrs. Parkington Baroness Aspasia Conti 1945 (18th) 1945 (18th) Anne Revere National Velvet Araminty Brown 1945 (18th) Eve Arden Mildred Pierce Ida Corwin 1945 (18th) Ann Blyth Mildred Pierce Veda Pierce Forrester 1945 (18th) Angela Lansbury The Picture of Dorian Gray Sibyl Vane 1945 (18th) Joan Lorring The Corn is Green Bessie Watty 1946 (19th) 1946 (19th) Anne Baxter The Razor's Edge Sophie MacDonald 1946 (19th) Ethel Barrymore The Spiral Staircase Mrs. Warren 1946 (19th) Lillian Gish Duel in the Sun Laura Belle McCanles 1946 (19th) Flora Robson Saratoga Trunk Angelique Buiton 1946 (19th) Gale Sondergaard Anna and the King of Siam Lady Thiang 1947 (20th) 1947 (20th) Celeste Holm Gentleman's Agreement Anne Dettrey 1947 (20th) Ethel Barrymore The Paradine Case Lady Sophie Horfield 1947 (20th) Gloria Grahame Crossfire Ginny Tremaine 1947 (20th) Marjorie Main The Egg and I Ma Kettle 1947 (20th) Anne Revere Gentleman's Agreement Mrs. Green 1948 (21st) 1948 (21st) Claire Trevor Key Largo Gaye Dawn 1948 (21st) Barbara Bel Geddes I Remember Mama Katrin Hanson 1948 (21st) Ellen Corby I Remember Mama Aunt Trina 1948 (21st) Agnes Moorehead Johnny Belinda Aggie McDonald 1948 (21st) Jean Simmons Hamlet Ophelia 1949 (22nd) 1949 (22nd) Mercedes McCambridge All the King's Men Sadie Burke 1949 (22nd) Ethel Barrymore Pinky Miss Em 1949 (22nd) Celeste Holm Come to the Stable Sister Scholastica 1949 (22nd) Elsa Lanchester Come to the Stable Amelia Potts 1949 (22nd) Ethel Waters Pinky Dicey Johnson ===1950s=== Year Actress Film Role(s) 1950 (23rd) 1950 (23rd) Josephine Hull Harvey Veta Louise Simmons 1950 (23rd) Hope Emerson Caged Evelyn Harper 1950 (23rd) Celeste Holm All About Eve Karen Richards 1950 (23rd) Nancy Olson Sunset Boulevard Betty Schaefer 1950 (23rd) Thelma Ritter All About Eve Birdie Kumen 1951 (24th) 1951 (24th) Kim Hunter A Streetcar Named Desire Stella Kowalski 1951 (24th) Joan Blondell The Blue Veil Annie Rawlins 1951 (24th) Mildred Dunnock Death of a Salesman Linda Loman 1951 (24th) Lee Grant Detective Story Shoplifter 1951 (24th) Thelma Ritter The Mating Season Ellen McNulty 1952 (25th) 1952 (25th) Gloria Grahame The Bad and the Beautiful Rosemary Bartlow 1952 (25th) Jean Hagen Singin' in the Rain Lina Lamont 1952 (25th) Colette Marchand Moulin Rouge Marie Charlet 1952 (25th) Terry Moore Come Back, Little Sheba Marie Buckholder 1952 (25th) Thelma Ritter With a Song in My Heart Clancy 1953 (26th) 1953 (26th) Donna Reed From Here to Eternity Alma 'Lorene' Burke 1953 (26th) Grace Kelly Mogambo Linda Nordley 1953 (26th) Geraldine Page Hondo Angie Lowe 1953 (26th) Marjorie Rambeau Torch Song Mrs. Stewart 1953 (26th) Thelma Ritter Pickup on South Street Moe 1954 (27th) 1954 (27th) Eva Marie Saint On the Waterfront Edie Doyle 1954 (27th) Nina Foch Executive Suite Erica Martin 1954 (27th) Katy Jurado Broken Lance Señora Devereaux 1954 (27th) Jan Sterling The High and the Mighty Sally McKee 1954 (27th) Claire Trevor The High and the Mighty May Holst 1955 (28th) 1955 (28th) Jo Van Fleet East of Eden Kate 1955 (28th) Betsy Blair Marty Clara Snyder 1955 (28th) Peggy Lee Pete Kelly's Blues Rose Hopkins 1955 (28th) Marisa Pavan The Rose Tattoo Rosa Delle Rose 1955 (28th) Natalie Wood Rebel Without a Cause Judy 1956 (29th) 1956 (29th) Dorothy Malone Written on the Wind Marylee Hadley 1956 (29th) Mildred Dunnock Baby Doll Rose Comfort 1956 (29th) Eileen Heckart The Bad Seed Hortense Daigle 1956 (29th) Mercedes McCambridge Giant Luz Benedict 1956 (29th) Patty McCormack The Bad Seed Rhoda Penmark 1957 (30th) 1957 (30th) Miyoshi Umeki Sayonara Katsumi 1957 (30th) Carolyn Jones The Bachelor Party The Existentialist 1957 (30th) Elsa Lanchester Witness for the Prosecution Miss Plimsoll 1957 (30th) Hope Lange Peyton Place Selena Cross 1957 (30th) Diane Varsi Peyton Place Allison MacKenzie 1958 (31st) 1958 (31st) Wendy Hiller Separate Tables Pat Cooper 1958 (31st) Peggy Cass Auntie Mame Agnes Gooch 1958 (31st) Martha Hyer Some Came Running Gwen French 1958 (31st) Maureen Stapleton Lonelyhearts Fay Doyle 1958 (31st) Cara Williams The Defiant Ones Billy's mother 1959 (32nd) 1959 (32nd) Shelley Winters The Diary of Anne Frank Petronella Van Daan 1959 (32nd) Hermione Baddeley Room at the Top Elspeth 1959 (32nd) Susan Kohner Imitation of Life Sarah Jane Johnson (age 18) 1959 (32nd) Juanita Moore Imitation of Life Annie Johnson 1959 (32nd) Thelma Ritter Pillow Talk Alma ===1960s=== Year Actress Film Role(s) 1960 (33rd) 1960 (33rd) Shirley Jones Elmer Gantry Lulu Baines 1960 (33rd) Glynis Johns The Sundowners Mrs. Firth 1960 (33rd) Shirley Knight The Dark at the Top of the Stairs Reenie Flood 1960 (33rd) Janet Leigh Psycho Marion Crane 1960 (33rd) Mary Ure Sons and Lovers Clara Dawes 1961 (34th) 1961 (34th) Rita Moreno West Side Story Anita 1961 (34th) Fay Bainter The Children's Hour Amelia Tilford 1961 (34th) Judy Garland Judgment at Nuremberg Irene Hoffman Wallner 1961 (34th) Lotte Lenya The Roman Spring of Mrs. Stone Contessa Magda Terribili- Gonzales 1961 (34th) Una Merkel Summer and Smoke Mrs. Winemiller 1962 (35th) 1962 (35th) Patty Duke The Miracle Worker Helen Keller 1962 (35th) Mary Badham To Kill a Mockingbird Scout Finch 1962 (35th) Shirley Knight Sweet Bird of Youth Heavenly Finley 1962 (35th) Angela Lansbury The Manchurian Candidate Eleanor Iselin 1962 (35th) Thelma Ritter Birdman of Alcatraz Elizabeth Stroud 1963 (36th) 1963 (36th) Margaret Rutherford The V.I.P.s The Duchess of Brighton 1963 (36th) Diane Cilento Tom Jones Molly Seagrim 1963 (36th) Edith Evans Tom Jones Miss Western 1963 (36th) Joyce Redman Tom Jones Mrs. Waters (Jenny Jones) 1963 (36th) Lilia Skala Lilies of the Field Mother Maria Marthe 1964 (37th) 1964 (37th) Lila Kedrova Zorba the Greek Madame Hortense 1964 (37th) Gladys Cooper My Fair Lady Mrs. Higgins 1964 (37th) Edith Evans The Chalk Garden Mrs. St. Maugham 1964 (37th) Grayson Hall The Night of the Iguana Judith Fellowes 1964 (37th) Agnes Moorehead Hush… Hush, Sweet Charlotte Velma Cruther 1965 (38th) 1965 (38th) Shelley Winters A Patch of Blue Rose-Ann D'Arcy 1965 (38th) Ruth Gordon Inside Daisy Clover The Dealer – Mrs. Clover 1965 (38th) Joyce Redman Othello Emilia 1965 (38th) Maggie Smith Othello Desdemona 1965 (38th) Peggy Wood The Sound of Music Mother Abbess 1966 (39th) 1966 (39th) Sandy Dennis Who's Afraid of Virginia Woolf? Honey 1966 (39th) Wendy Hiller A Man for All Seasons Alice More 1966 (39th) Jocelyne LaGarde Hawaii Queen Malama 1966 (39th) Vivien Merchant Alfie Lily 1966 (39th) Geraldine Page You're a Big Boy Now Margery Chanticleer 1967 (40th) 1967 (40th) Estelle Parsons Bonnie and Clyde Blanche Barrow 1967 (40th) Carol Channing Thoroughly Modern Millie Muzzy Van Hossmere 1967 (40th) Mildred Natwick Barefoot in the Park Ethel Banks 1967 (40th) Beah Richards Guess Who's Coming to Dinner Mrs. Prentice 1967 (40th) Katharine Ross The Graduate Elaine Robinson 1968 (41st) 1968 (41st) Ruth Gordon Rosemary's Baby Minnie Castevet 1968 (41st) Lynn Carlin Faces Maria Forst 1968 (41st) Sondra Locke The Heart Is a Lonely Hunter Mick Kelly 1968 (41st) Kay Medford Funny Girl Rose Brice 1968 (41st) Estelle Parsons Rachel, Rachel Calla Mackie 1969 (42nd) 1969 (42nd) Goldie Hawn Cactus Flower Toni Simmons 1969 (42nd) Catherine Burns Last Summer Rhoda 1969 (42nd) Dyan Cannon Bob & Carol & Ted & Alice Alice Henderson 1969 (42nd) Sylvia Miles Midnight Cowboy Cass 1969 (42nd) Susannah York They Shoot Horses, Don't They? Alice LeBlanc ===1970s=== Year Actress Film Role(s) 1970 (43rd) 1970 (43rd) Helen Hayes Airport Ada Quonsett 1970 (43rd) Karen Black Five Easy Pieces Rayette Dipesto 1970 (43rd) Lee Grant The Landlord Joyce Enders 1970 (43rd) Sally Kellerman MASH Maj. Margaret 'Hot Lips' Houlihan 1970 (43rd) Maureen Stapleton Airport Inez Guerrero 1971 (44th) 1971 (44th) Cloris Leachman The Last Picture Show Ruth Popper 1971 (44th) Ann-Margret Carnal Knowledge Bobbie 1971 (44th) Ellen Burstyn The Last Picture Show Lois Farrow 1971 (44th) Barbara Harris Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me? Allison Densmore 1971 (44th) Margaret Leighton The Go-Between Mrs. Maudsley 1972 (45th) 1972 (45th) Eileen Heckart Butterflies Are Free Mrs. Baker 1972 (45th) Jeannie Berlin The Heartbreak Kid Lila Kolodny 1972 (45th) Geraldine Page Pete 'n' Tillie Gertrude 1972 (45th) Susan Tyrrell Fat City Oma 1972 (45th) Shelley Winters The Poseidon Adventure Belle Rosen 1973 (46th) 1973 (46th) Tatum O'Neal Paper Moon Addie Loggins 1973 (46th) Linda Blair The Exorcist Regan MacNeil 1973 (46th) Candy Clark American Graffiti Debbie Dunham 1973 (46th) Madeline Kahn Paper Moon Trixie Delight 1973 (46th) Sylvia Sidney Summer Wishes, Winter Dreams Mrs. Pritchett 1974 (47th) 1974 (47th) Ingrid Bergman Murder on the Orient Express Greta Ohlsson 1974 (47th) Valentina Cortese Day for Night Severine 1974 (47th) Madeline Kahn Blazing Saddles Lili Von Shtupp 1974 (47th) Diane Ladd Alice Doesn't Live Here Anymore Flo Castleberry 1974 (47th) Talia Shire The Godfather Part II Connie Corleone 1975 (48th) 1975 (48th) Lee Grant Shampoo Felicia Karpf 1975 (48th) Ronee Blakley Nashville Barbara Jean 1975 (48th) Sylvia Miles Farewell, My Lovely Jessie Halstead Florian 1975 (48th) Lily Tomlin Nashville Linnea Reese 1975 (48th) Brenda Vaccaro Jacqueline Susann's Once Is Not Enough Linda Riggs 1976 (49th) 1976 (49th) Beatrice Straight Network Louise Schumacher 1976 (49th) Jane Alexander All the President's Men Judy Hoback 1976 (49th) Jodie Foster Taxi Driver Iris Steensma 1976 (49th) Lee Grant Voyage of the Damned Lillian Rosen 1976 (49th) Piper Laurie Carrie Margaret White 1977 (50th) 1977 (50th) Vanessa Redgrave Julia Julia 1977 (50th) Leslie Browne The Turning Point Emilia Rodgers 1977 (50th) Quinn Cummings The Goodbye Girl Lucy McFadden 1977 (50th) Melinda Dillon Close Encounters of the Third Kind Gillian Guiler 1977 (50th) Tuesday Weld Looking for Mr. Goodbar Katherine Dunn 1978 (51st) 1978 (51st) Maggie Smith California Suite Diana Barrie 1978 (51st) Dyan Cannon Heaven Can Wait Julia Farnsworth 1978 (51st) Penelope Milford Coming Home Vi Munson 1978 (51st) Maureen Stapleton Interiors Pearl 1978 (51st) Meryl Streep The Deer Hunter Linda 1979 (52nd) 1979 (52nd) Meryl Streep Kramer vs. Kramer Joanna Kramer 1979 (52nd) Jane Alexander Kramer vs. Kramer Margaret Phelps 1979 (52nd) Barbara Barrie Breaking Away Evelyn Stoller 1979 (52nd) Candice Bergen Starting Over Jessica Potter 1979 (52nd) Mariel Hemingway Manhattan Tracy ===1980s=== Year Actress Film Role(s) 1980 (53rd) 1980 (53rd) Mary Steenburgen Melvin and Howard Lynda Dummar 1980 (53rd) Eileen Brennan Private Benjamin Captain Doreen Lewis 1980 (53rd) Eva Le Gallienne Resurrection Grandma Pearl 1980 (53rd) Cathy Moriarty Raging Bull Vickie Thailer LaMotta 1980 (53rd) Diana Scarwid Inside Moves Louise 1981 (54th) 1981 (54th) Maureen Stapleton Reds Emma Goldman 1981 (54th) Melinda Dillon Absence of Malice Teresa Perrone 1981 (54th) Jane Fonda On Golden Pond Chelsea Thayer Wayne 1981 (54th) Joan Hackett Only When I Laugh Toby Landau 1981 (54th) Elizabeth McGovern Ragtime Evelyn Nesbit 1982 (55th) 1982 (55th) Jessica Lange Tootsie Julie Nichols 1982 (55th) Glenn Close The World According to Garp Jenny Fields 1982 (55th) Teri Garr Tootsie Sandy Lester 1982 (55th) Kim Stanley Frances Lillian Farmer 1982 (55th) Lesley Ann Warren Victor Victoria Norma Cassady 1983 (56th) 1983 (56th) Linda Hunt The Year of Living Dangerously Billy Kwan 1983 (56th) Cher Silkwood Dolly Pelliker 1983 (56th) Glenn Close The Big Chill Sarah Cooper 1983 (56th) Amy Irving Yentl Hadass 1983 (56th) Alfre Woodard Cross Creek Geechee 1984 (57th) 1984 (57th) Peggy Ashcroft A Passage to India Mrs. Moore 1984 (57th) Glenn Close The Natural Iris Gaines 1984 (57th) Lindsay Crouse Places in the Heart Margaret Lomax 1984 (57th) Christine Lahti Swing Shift Hazel Zanussi 1984 (57th) Geraldine Page The Pope of Greenwich Village Mrs. Ritter 1985 (58th) 1985 (58th) Anjelica Huston Prizzi's Honor Maerose Prizzi 1985 (58th) Margaret Avery The Color Purple Shug Avery 1985 (58th) Amy Madigan Twice in a Lifetime Sunny Sobel 1985 (58th) Meg Tilly Agnes of God Sister Agnes 1985 (58th) Oprah Winfrey The Color Purple Sofia Johnson 1986 (59th) 1986 (59th) Dianne Wiest Hannah and Her Sisters Holly 1986 (59th) Tess Harper Crimes of the Heart Chick Boyle 1986 (59th) Piper Laurie Children of a Lesser God Mrs. Norman 1986 (59th) Mary Elizabeth Mastrantonio The Color of Money Carmen 1986 (59th) Maggie Smith A Room with a View Charlotte Bartlett 1987 (60th) 1987 (60th) Olympia Dukakis Moonstruck Rose Castorini 1987 (60th) Norma Aleandro Gaby: A True Story Florencia 1987 (60th) Anne Archer Fatal Attraction Beth Gallagher 1987 (60th) Anne Ramsey Throw Momma from the Train Mrs. Lift 1987 (60th) Ann Sothern The Whales of August Tisha Doughty 1988 (61st) 1988 (61st) Geena Davis The Accidental Tourist Muriel Pritchett 1988 (61st) Joan Cusack Working Girl Cyn 1988 (61st) Frances McDormand Mississippi Burning Mrs. Pell 1988 (61st) Michelle Pfeiffer Dangerous Liaisons Madame Marie de Tourvel 1988 (61st) Sigourney Weaver Working Girl Katharine Parker 1989 (62nd) 1989 (62nd) Brenda Fricker My Left Foot Mrs. Brown 1989 (62nd) Anjelica Huston Enemies, a Love Story Tamara Broder 1989 (62nd) Lena Olin Enemies, a Love Story Masha 1989 (62nd) Julia Roberts Steel Magnolias Shelby Eatenton Latcherie 1989 (62nd) Dianne Wiest Parenthood Helen Buckman ===1990s=== Year Actress Film Role(s) 1990 (63rd) 1990 (63rd) Whoopi Goldberg Ghost Oda Mae Brown 1990 (63rd) Annette Bening The Grifters Myra Langtry 1990 (63rd) Lorraine Bracco Goodfellas Karen Hill 1990 (63rd) Diane Ladd Wild at Heart Marietta Fortune 1990 (63rd) Mary McDonnell Dances with Wolves Stands With A Fist 1991 (64th) 1991 (64th) Mercedes Ruehl The Fisher King Anne Napolitano 1991 (64th) Diane Ladd Rambling Rose Mother 1991 (64th) Juliette Lewis Cape Fear Danielle Bowden 1991 (64th) Kate Nelligan The Prince of Tides Lila Wingo Newbury 1991 (64th) Jessica Tandy Fried Green Tomatoes Ninny Threadgoode 1992 (65th) 1992 (65th) Marisa Tomei My Cousin Vinny Mona Lisa Vito 1992 (65th) Judy Davis Husbands and Wives Sally 1992 (65th) Joan Plowright Enchanted April Mrs. Fisher 1992 (65th) Vanessa Redgrave Howards End Ruth Wilcox 1992 (65th) Miranda Richardson Damage Ingrid Fleming 1993 (66th) 1993 (66th) Anna Paquin The Piano Flora McGrath 1993 (66th) Holly Hunter The Firm Tammy Hemphill 1993 (66th) Rosie Perez Fearless Carla Rodrigo 1993 (66th) Winona Ryder The Age of Innocence May Welland 1993 (66th) Emma Thompson In the Name of the Father Gareth Peirce 1994 (67th) 1994 (67th) Dianne Wiest Bullets Over Broadway Helen Sinclair 1994 (67th) Rosemary Harris Tom & Viv Rose Haigh-Wood 1994 (67th) Helen Mirren The Madness of King George Queen Charlotte 1994 (67th) Uma Thurman Pulp Fiction Mia Wallace 1994 (67th) Jennifer Tilly Bullets Over Broadway Olive Neal 1995 (68th) 1995 (68th) Mira Sorvino Mighty Aphrodite Linda Ash 1995 (68th) Joan Allen Nixon Pat Nixon 1995 (68th) Kathleen Quinlan Apollo 13 Marilyn Lovell 1995 (68th) Mare Winningham Georgia Georgia Flood 1995 (68th) Kate Winslet Sense and Sensibility Marianne Dashwood 1996 (69th) 1996 (69th) Juliette Binoche The English Patient Hana 1996 (69th) Joan Allen The Crucible Elizabeth Proctor 1996 (69th) Lauren Bacall The Mirror Has Two Faces Hannah Morgan 1996 (69th) Barbara Hershey The Portrait of a Lady Madame Serena Merle 1996 (69th) Marianne Jean-Baptiste Secrets & Lies Hortense Cumberbatch 1997 (70th) 1997 (70th) Kim Basinger L.A. Confidential Lynn Bracken 1997 (70th) Joan Cusack In & Out Emily Montgomery 1997 (70th) Minnie Driver Good Will Hunting Skylar 1997 (70th) Julianne Moore Boogie Nights Amber Waves 1997 (70th) Gloria Stuart Titanic Rose Calvert 1998 (71st) 1998 (71st) Judi Dench Shakespeare in Love Queen Elizabeth I 1998 (71st) Kathy Bates Primary Colors Libby Holden 1998 (71st) Brenda Blethyn Little Voice Mari Hoff 1998 (71st) Rachel Griffiths Hilary and Jackie Hilary du Pré 1998 (71st) Lynn Redgrave Gods and Monsters Hanna 1999 (72nd) 1999 (72nd) Angelina Jolie Girl, Interrupted Lisa Rowe 1999 (72nd) Toni Collette The Sixth Sense Lynn Sear 1999 (72nd) Catherine Keener Being John Malkovich Maxine Lund 1999 (72nd) Samantha Morton Sweet and Lowdown Hattie 1999 (72nd) Chloë Sevigny Boys Don't Cry Lana Tisdel ===2000s=== Year Actress Film Role(s) 2000 (73rd) 2000 (73rd) Marcia Gay Harden Pollock Lee Krasner 2000 (73rd) Judi Dench Chocolat Armande Voizin 2000 (73rd) Kate Hudson Almost Famous Penny Lane 2000 (73rd) Frances McDormand Almost Famous Elaine Miller 2000 (73rd) Julie Walters Billy Elliot Georgia Wilkinson 2001 (74th) 2001 (74th) Jennifer Connelly A Beautiful Mind Alicia Nash 2001 (74th) Helen Mirren Gosford Park Jane Wilson 2001 (74th) Maggie Smith Gosford Park Constance Trentham 2001 (74th) Marisa Tomei In the Bedroom Natalie Strout 2001 (74th) Kate Winslet Iris Young Iris Murdoch 2002 (75th) 2002 (75th) Catherine Zeta-Jones Chicago Velma Kelly 2002 (75th) Kathy Bates About Schmidt Roberta Hertzel 2002 (75th) Julianne Moore The Hours Laura Brown 2002 (75th) Queen Latifah Chicago Matron Mama Morton 2002 (75th) Meryl Streep Adaptation. Susan Orlean 2003 (76th) 2003 (76th) Renée Zellweger Cold Mountain Ruby Thewes 2003 (76th) Shohreh Aghdashloo House of Sand and Fog Nadereh Behrani 2003 (76th) Patricia Clarkson Pieces of April Joy Burns 2003 (76th) Marcia Gay Harden Mystic River Celeste Boyle 2003 (76th) Holly Hunter Thirteen Melanie Freeland 2004 (77th) 2004 (77th) Cate Blanchett The Aviator Katharine Hepburn 2004 (77th) Laura Linney Kinsey Clara McMillen 2004 (77th) Virginia Madsen Sideways Maya Randall 2004 (77th) Sophie Okonedo Hotel Rwanda Tatiana Rusesabagina 2004 (77th) Natalie Portman Closer Alice Ayres 2005 (78th) 2005 (78th) Rachel Weisz The Constant Gardener Tessa Quayle 2005 (78th) Amy Adams Junebug Ashley Johnsten 2005 (78th) Catherine Keener Capote Nelle Harper Lee 2005 (78th) Frances McDormand North Country Glory Dodge 2005 (78th) Michelle Williams Brokeback Mountain Alma Beers Del Mar 2006 (79th) 2006 (79th) Jennifer Hudson Dreamgirls Effie White 2006 (79th) Adriana Barraza Babel Amelia 2006 (79th) Cate Blanchett Notes on a Scandal Sheba Hart 2006 (79th) Abigail Breslin Little Miss Sunshine Olive Hoover 2006 (79th) Rinko Kikuchi Babel Chieko Wataya 2007 (80th) 2007 (80th) Tilda Swinton Michael Clayton Karen Crowder 2007 (80th) Cate Blanchett I'm Not There Jude Quinn 2007 (80th) Ruby Dee American Gangster Mama Lucas 2007 (80th) Saoirse Ronan Atonement Briony Tallis 2007 (80th) Amy Ryan Gone Baby Gone Helene McCready 2008 (81st) 2008 (81st) Penélope Cruz Vicky Cristina Barcelona María Elena 2008 (81st) Amy Adams Doubt Sister James 2008 (81st) Viola Davis Doubt Mrs. Miller 2008 (81st) Taraji P. Henson The Curious Case of Benjamin Button Queenie 2008 (81st) Marisa Tomei The Wrestler Cassidy/Pam 2009 (82nd) 2009 (82nd) Mo'Nique Precious: Based on the Novel \"Push\" by Sapphire Mary Lee Johnston 2009 (82nd) Penélope Cruz Nine Carla Albanese 2009 (82nd) Vera Farmiga Up in the Air Alex Goran 2009 (82nd) Maggie Gyllenhaal Crazy Heart Jean Craddock 2009 (82nd) Anna Kendrick Up in the Air Natalie Keener ===2010s=== Year Actress Film Role(s) 2010 (83rd) 2010 (83rd) Melissa Leo The Fighter Alice Ward 2010 (83rd) Amy Adams The Fighter Charlene Fleming 2010 (83rd) Helena Bonham Carter The King's Speech Queen Elizabeth 2010 (83rd) Hailee Steinfeld True Grit Mattie Ross 2010 (83rd) Jacki Weaver Animal Kingdom Janine \"Smurf\" Cody 2011 (84th) 2011 (84th) Octavia Spencer The Help Minny Jackson 2011 (84th) Bérénice Bejo The Artist Peppy Miller 2011 (84th) Jessica Chastain The Help Celia Foote 2011 (84th) Melissa McCarthy Bridesmaids Megan 2011 (84th) Janet McTeer Albert Nobbs Hubert Page 2012 (84th) 2012 (84th) Anne Hathaway Les Misérables Fantine 2012 (84th) Amy Adams The Master Peggy 2012 (84th) Sally Field Lincoln Mary 2012 (84th) Jacki Weaver Silver Linings Playbook Dolores 2012 (84th) Helen Hunt The Sessions Cheryl ==Related pages== * BAFTA Award for Best Actress in a Supporting Role == References == ==Other websites== * Oscars.org (official Academy site) Supporting Actress",
 "title": "Academy Award for Best Supporting Actress"
}