{
 "id": "360379",
 "text": "The Satellite Award for Best Costume Design is one of the Satellite Awards. It is given each year by the International Press Academy. == Winners and nominees == === 1990s === Year Winners and nominees Designer(s) 1996 Evita Penny Rose Hamlet Alex Byrne Moll Flanders Consolata Boyle The Portrait of a Lady Janet Patterson Ridicule Christian Gasc 1997 Titanic Deborah L. Scott Amistad Ruth E. Carter Beaumarchais the Scoundrel (Beaumarchais, l'insolent) Sylvie De Segonzac Mrs. Brown Deidre Clancy The Wings of the Dove Sandy Powell 1998 Elizabeth Alexandra Byrne Beloved Colleen Atwood Ever After Jenny Beavan Pleasantville Judianna Makovsky Shakespeare in Love Sandy Powell 1999 Sleepy Hollow Colleen Atwood Anna and the King Jenny Beavan The Emperor and the Assassin (Jing ke ci qin wang) Mo Xiaomin An Ideal Husband Caroline Harris The Red Violin (Le violon rouge) Renee April Titus Milena Canonero === 2000s === Year Winners and nominees Designer(s) 2000 How the Grinch Stole Christmas Rita Ryack Crouching Tiger, Hidden Dragon (Wo hu cang long) Tim Yip Gladiator Janty Yates The House of Mirth Monica Howe The Patriot Deborah Scott 2001 Moulin Rouge! Catherine Martin and Angus Strathie The Affair of the Necklace Milena Canonero From Hell Kym Barrett The Lord of the Rings: The Fellowship of the Ring Ngila Dickson and Richard Taylor Planet of the Apes Colleen Atwood 2002 Frida Julie Weiss Austin Powers in Goldmember Deena Appel Gangs of New York Sandy Powell Road to Perdition Albert Wolsky Star Wars Episode II: Attack of the Clones Trisha Biggar 2003 The Last Samurai Ngila Dickson The Company Susan Kaufmann The Lord of the Rings: The Return of the King Ngila Dickson and Richard Taylor Master and Commander: The Far Side of the World Wendy Stites Pirates of the Caribbean: The Curse of the Black Pearl Penny Rose Seabiscuit Judianna Makovsky 2004 Vanity Fair Beatrix Aruna Pasztor The Aviator Sandy Powell De-Lovely Janty Yates The Phantom of the Opera Alexandra Byrne House of Flying Daggers (Shi mian mai fu) Emi Wada Sky Captain and the World of Tomorrow Stella McCartney 2005 Pride & Prejudice Jacqueline Durran Harry Potter and the Goblet of Fire Jany Temime Kingdom of Heaven Janty Yates Memoirs of a Geisha Colleen Atwood Modigliani Pam Downe The White Countess John Bright 2006 The Devil Wears Prada Patricia Field The Black Dahlia Jenny Beavan Curse of the Golden Flower (Man cheng jin dai huang jin jia) Yee Chung- Man Dreamgirls Sharen Davis Marie Antoinette Milena Canonero 2007 Elizabeth: The Golden Age Alexandra Byrne Amazing Grace Jenny Beavan Atonement Jacqueline Durran Goya's Ghosts Yvonne Blake Hairspray Rita Ryack The Passionate Life of Edith Piaf (La môme) Marit Allen 2008 The Duchess Michael O'Connor Australia Catherine Martin Brideshead Revisited Eimer Ni Mhaoldomhnaigh City of Ember Ruth Myers The Curious Case of Benjamin Button Jacqueline West Sex and the City Patricia Field 2009 The Imaginarium of Doctor Parnassus Monique Prudhomme Chéri Consolata Boyle Nine Colleen Atwood Red Cliff (Chi bi) Tim Yip The Young Victoria Sandy Powell ===2010s=== Year Winners and nominees Designer(s) 2011 Water for Elephants Jacqueline West Anonymous Lisy Christl The Artist Mark Bridges Faust Lidiya Kryukova Jane Eyre Michael O'Connor Mysteries of Lisbon Isabel Branco == Other websites == * International Press Academy website Category:Movie awards",
 "title": "Satellite Award for Best Costume Design"
}