{
 "id": "360391",
 "text": "Performance by an Actor in a Leading Role is one of the Academy Awards of Merit. It is presented each year by the Academy of Motion Picture Arts and Sciences (AMPAS). It is to recognize an actor with an outstanding performance in a movie. Before 1976, this award was called the Academy Award of Merit for Performance by an Actor. Since the beginning the award has commonly been called the Oscar for Best Actor. Actors are nominated for this award by Academy members who are actors and actresses themselves. The winner is selected by the Academy membership as a whole. ==Winners and nominees== Winners are listed first in bold, followed by the other nominees. ===1920s=== Year Actor Movie Role 1927/28 (1st) 1927/28 (1st) Emil Jannings The Last Command Grand Duke Sergius Alexander 1927/28 (1st) Emil Jannings The Way of All Flesh August Schilling 1927/28 (1st) Richard Barthelmess The Noose Nickie Elkins 1927/28 (1st) Richard Barthelmess The Patent Leather Kid Patent Leather Kid 1928/29 (2nd) 1928/29 (2nd) Warner Baxter In Old Arizona The Cisco Kid 1928/29 (2nd) George Bancroft Thunderbolt Thunderbolt Jim Lang 1928/29 (2nd) Chester Morris Alibi Chick Williams (No. 1065) 1928/29 (2nd) Paul Muni The Valiant James Dyke 1928/29 (2nd) Lewis Stone The Patriot Count Pahlen ===1930s=== Year Actor Movie Role 1929/30 (3rd) 1929/30 (3rd) George Arliss Disraeli Benjamin Disraeli 1929/30 (3rd) George Arliss The Green Goddess The Raja of Rukh 1929/30 (3rd) Wallace Beery The Big House 'Machine Gun' Butch Schmidt 1929/30 (3rd) Maurice Chevalier The Big Pond Pierre Mirande 1929/30 (3rd) Maurice Chevalier The Love Parade Count Alfred Renard 1929/30 (3rd) Ronald Colman Bulldog Drummond Capt. Hugh 'Bulldog' Drummond 1929/30 (3rd) Ronald Colman Condemned Michel 1929/30 (3rd) Lawrence Tibbett The Rogue Song Yegor 1930/31 (4th) 1930/31 (4th) Lionel Barrymore A Free Soul Stephen Ashe 1930/31 (4th) Adolphe Menjou The Front Page Walter Burns 1930/31 (4th) Jackie Cooper Skippy Skippy Skinner 1930/31 (4th) Richard Dix Cimarron Yancey Cravat 1930/31 (4th) Fredric March The Royal Family of Broadway Tony Cavendish 1931/32 (5th) 1931/32 (5th) Wallace Beery (tie) The Champ Andy \"Champ\" Purcell 1931/32 (5th) Fredric March (tie) Dr. Jekyll and Mr. Hyde Dr. Henry L. Jekyll / Mr. Hyde 1931/32 (5th) Alfred Lunt The Guardsman The Actor 1932/33 (6th) 1932/33 (6th) Charles Laughton The Private Life of Henry VIII King Henry VIII of England 1932/33 (6th) Leslie Howard Berkeley Square Peter Standish 1932/33 (6th) Paul Muni I Am a Fugitive from a Chain Gang James Allen 1934 (7th) 1934 (7th) Clark Gable It Happened One Night Peter Warne 1934 (7th) Frank Morgan The Affairs of Cellini Alessandro - Duke of Florence 1934 (7th) William Powell The Thin Man Nick Charles 1935 (8th) 1935 (8th) Victor McLaglen The Informer Gypo Nolan 1935 (8th) Clark Gable Mutiny on the Bounty Fletcher Christian 1935 (8th) Charles Laughton Mutiny on the Bounty William Bligh 1935 (8th) Franchot Tone Mutiny on the Bounty Roger Byam 1936 (9th) 1936 (9th) Paul Muni The Story of Louis Pasteur Louis Pasteur 1936 (9th) Gary Cooper Mr. Deeds Goes to Town Longfellow Deeds 1936 (9th) Walter Huston Dodsworth Sam Dodsworth 1936 (9th) William Powell My Man Godfrey Godfrey Park 1936 (9th) Spencer Tracy San Francisco Father Tim Mullin 1937 (10th) 1937 (10th) Spencer Tracy Captains Courageous Manuel 1937 (10th) Charles Boyer Conquest Emperor Napoleon Bonaparte 1937 (10th) Fredric March A Star Is Born Norman Maine 1937 (10th) Robert Montgomery Night Must Fall Danny 1937 (10th) Paul Muni The Life of Emile Zola Émile Zola 1938 (11th) 1938 (11th) Spencer Tracy Boys Town Father Flanagan 1938 (11th) Charles Boyer Algiers Pepe le Moko 1938 (11th) James Cagney Angels with Dirty Faces Rocky Sullivan 1938 (11th) Robert Donat The Citadel Dr. Andrew Manson 1938 (11th) Leslie Howard Pygmalion Professor Henry Higgins 1939 (12th) 1939 (12th) Robert Donat Goodbye, Mr. Chips Charles Edward Chipping 1939 (12th) Clark Gable Gone with the Wind Rhett Butler 1939 (12th) Laurence Olivier Wuthering Heights Heathcliff 1939 (12th) Mickey Rooney Babes in Arms Mickey Moran 1939 (12th) James Stewart Mr. Smith Goes to Washington Jefferson Smith ===1940s=== Year Actor Movie Role(s) 1940 (13th) 1940 (13th) James Stewart The Philadelphia Story Macaulay Connor 1940 (13th) Charlie Chaplin The Great Dictator Adenoid Hynkel (Dictator of Tomania) A Jewish Barber 1940 (13th) Henry Fonda The Grapes of Wrath Tom Joad 1940 (13th) Raymond Massey Abe Lincoln in Illinois Abraham Lincoln 1940 (13th) Laurence Olivier Rebecca 'Maxim' de Winter 1941 (14th) 1941 (14th) Gary Cooper Sergeant York Alvin C. York 1941 (14th) Cary Grant Penny Serenade Roger Adams 1941 (14th) Walter Huston The Devil and Daniel Webster Mr. Scratch 1941 (14th) Robert Montgomery Here Comes Mr. Jordan Joe Pendleton 1941 (14th) Orson Welles Citizen Kane Charles Foster Kane 1942 (15th) 1942 (15th) James Cagney Yankee Doodle Dandy George M. Cohan 1942 (15th) Ronald Colman Random Harvest Charles Rainier 1942 (15th) Gary Cooper The Pride of the Yankees Lou Gehrig 1942 (15th) Walter Pidgeon Mrs. Miniver Clem Miniver 1942 (15th) Monty Woolley The Pied Piper Howard 1943 (16th) 1943 (16th) Paul Lukas Watch on the Rhine Kurt Muller 1943 (16th) Humphrey Bogart Casablanca Rick Blaine 1943 (16th) Gary Cooper For Whom the Bell Tolls Robert Jordan 1943 (16th) Walter Pidgeon Madame Curie Pierre Curie 1943 (16th) Mickey Rooney The Human Comedy Homer Macauley 1944 (17th) 1944 (17th) Bing Crosby Going My Way Father Chuck O'Malley 1944 (17th) Charles Boyer Gaslight Gregory Anton 1944 (17th) Barry Fitzgerald Going My Way Father Fitzgibbon 1944 (17th) Cary Grant None but the Lonely Heart Ernie Mott 1944 (17th) Alexander Knox Wilson Woodrow Wilson 1945 (18th) 1945 (18th) Ray Milland The Lost Weekend Don Birnam 1945 (18th) Bing Crosby The Bells of St. Mary's Father Chuck O'Malley 1945 (18th) Gene Kelly Anchors Aweigh Joseph Brady 1945 (18th) Gregory Peck The Keys of the Kingdom Father Francis 1945 (18th) Cornel Wilde A Song to Remember Frédéric Chopin 1946 (19th) 1946 (19th) Fredric March The Best Years of Our Lives Al Stephenson 1946 (19th) Laurence Olivier Henry V King Henry V of England 1946 (19th) Larry Parks The Jolson Story Al Jolson 1946 (19th) Gregory Peck The Yearling Ezra 'Penny' Baxter 1946 (19th) James Stewart It's a Wonderful Life George Bailey 1947 (20th) 1947 (20th) Ronald Colman A Double Life Anthony John 1947 (20th) John Garfield Body and Soul Charlie Davis 1947 (20th) Gregory Peck Gentleman's Agreement Philip Schuyler Green 1947 (20th) William Powell Life with Father Clarence Day, Sr. 1947 (20th) Michael Redgrave Mourning Becomes Electra Orin Mannon 1948 (21st) 1948 (21st) Laurence Olivier Hamlet Hamlet, Prince of Denmark 1948 (21st) Lew Ayres Johnny Belinda Dr. Robert Richardson 1948 (21st) Montgomery Clift The Search Ralph 'Steve' Stevenson 1948 (21st) Dan Dailey When My Baby Smiles at Me 'Skid' Johnson 1948 (21st) Clifton Webb Sitting Pretty Lynn Belvedere 1949 (22nd) 1949 (22nd) Broderick Crawford All the King's Men Willie Stark 1949 (22nd) Kirk Douglas Champion Michael 'Midge' Kelly 1949 (22nd) Gregory Peck Twelve O'Clock High General Savage 1949 (22nd) Richard Todd The Hasty Heart Cpl. Lachlan 'Lachie' MacLachlan 1949 (22nd) John Wayne Sands of Iwo Jima Sgt. John M. Stryker ===1950s=== Year Actor Movie Role(s) 1950 (23rd) 1950 (23rd) José Ferrer Cyrano de Bergerac Cyrano de Bergerac 1950 (23rd) Louis Calhern The Magnificent Yankee Oliver Wendell Holmes 1950 (23rd) William Holden Sunset Boulevard Joe Gillis 1950 (23rd) James Stewart Harvey Elwood P. Dowd 1950 (23rd) Spencer Tracy Father of the Bride Stanley T. Banks 1951 (24th) 1951 (24th) Humphrey Bogart The African Queen Charlie Allnut 1951 (24th) Marlon Brando A Streetcar Named Desire Stanley Kowalski 1951 (24th) Montgomery Clift A Place in the Sun George Eastman 1951 (24th) Arthur Kennedy Bright Victory Larry Nevins 1951 (24th) Fredric March Death of a Salesman Willy Loman 1952 (25th) 1952 (25th) Gary Cooper High Noon Marshal Will Kane 1952 (25th) Marlon Brando Viva Zapata! Emiliano Zapata 1952 (25th) Kirk Douglas The Bad and the Beautiful Jonathan Shields 1952 (25th) José Ferrer Moulin Rouge Henri de Toulouse-Lautrec The Comte de Toulouse-Lautrec 1952 (25th) Alec Guinness The Lavender Hill Mob Henry Holland 1953 (26th) 1953 (26th) William Holden Stalag 17 Sgt. J.J. Sefton 1953 (26th) Marlon Brando Julius Caesar Mark Antony 1953 (26th) Richard Burton The Robe Marcellus Gallio 1953 (26th) Montgomery Clift From Here to Eternity Pvt. Robert E. Lee 'Prew' Prewitt 1953 (26th) Burt Lancaster From Here to Eternity 1st Sgt. Milton Warden 1954 (27th) 1954 (27th) Marlon Brando On the Waterfront Terry Malloy 1954 (27th) Humphrey Bogart The Caine Mutiny Lt. Cmdr. Philip Francis Queeg 1954 (27th) Bing Crosby The Country Girl Frank Elgin 1954 (27th) James Mason A Star Is Born Norman Maine 1954 (27th) Dan O'Herlihy Adventures of Robinson Crusoe Robinson Crusoe 1955 (28th) 1955 (28th) Ernest Borgnine Marty Marty Piletti 1955 (28th) James Cagney Love Me or Leave Me Martin Snyder 1955 (28th) James Dean(posthumous nomination) East of Eden Cal Trask 1955 (28th) Frank Sinatra The Man with the Golden Arm Frankie Machine 1955 (28th) Spencer Tracy Bad Day at Black Rock John J. Macreedy 1956 (29th) 1956 (29th) Yul Brynner The King and I King Mongkut of Siam 1956 (29th) James Dean(posthumous nomination) Giant Jett Rink 1956 (29th) Kirk Douglas Lust for Life Vincent van Gogh 1956 (29th) Rock Hudson Giant Jordan \"Bick\" Benedict Jr. 1956 (29th) Laurence Olivier Richard III King Richard III of England 1957 (30th) 1957 (30th) Alec Guinness The Bridge on the River Kwai Colonel Nicholson 1957 (30th) Marlon Brando Sayonara Maj. Lloyd 'Ace' Gruver — USAF 1957 (30th) Anthony Franciosa A Hatful of Rain Polo Pope 1957 (30th) Charles Laughton Witness for the Prosecution Sir Wilfrid Robarts 1957 (30th) Anthony Quinn Wild Is the Wind Gino 1958 (31st) 1958 (31st) David Niven Separate Tables Major Angus Pollock 1958 (31st) Tony Curtis The Defiant Ones John 'Joker' Jackson 1958 (31st) Paul Newman Cat on a Hot Tin Roof Brick Pollitt 1958 (31st) Sidney Poitier The Defiant Ones Noah Cullen 1958 (31st) Spencer Tracy The Old Man and the Sea The Old Man 1959 (32nd) 1959 (32nd) Charlton Heston Ben-Hur Judah Ben-Hur 1959 (32nd) Laurence Harvey Room at the Top Joe Lampton 1959 (32nd) Jack Lemmon Some Like It Hot Jerry 1959 (32nd) Paul Muni The Last Angry Man Dr. Sam Abelman 1959 (32nd) James Stewart Anatomy of a Murder Paul Biegler ===1960s=== Year Actor Movie Role(s) 1960 (33rd) 1960 (33rd) Burt Lancaster Elmer Gantry Elmer Gantry 1960 (33rd) Trevor Howard Sons and Lovers Walter Morel 1960 (33rd) Jack Lemmon The Apartment C. C. 'Bud' Baxter 1960 (33rd) Laurence Olivier The Entertainer Archie Rice 1960 (33rd) Spencer Tracy Inherit the Wind Henry Drummond 1961 (34th) 1961 (34th) Maximilian Schell Judgment at Nuremberg Hans Rolfe 1961 (34th) Charles Boyer Fanny Cesar 1961 (34th) Paul Newman The Hustler Eddie Felson 1961 (34th) Spencer Tracy Judgment at Nuremberg Chief Judge Dan Haywood 1961 (34th) Stuart Whitman The Mark Jim Fuller 1962 (35th) 1962 (35th) Gregory Peck To Kill a Mockingbird Atticus Finch 1962 (35th) Burt Lancaster Birdman of Alcatraz Robert Stroud 1962 (35th) Jack Lemmon Days of Wine and Roses Joe Clay 1962 (35th) Marcello Mastroianni Divorce, Italian Style Ferdinando Cefalù 1962 (35th) Peter O'Toole Lawrence of Arabia T. E. Lawrence 1963 (36th) 1963 (36th) Sidney Poitier Lilies of the Field Homer Smith 1963 (36th) Albert Finney Tom Jones Tom Jones 1963 (36th) Richard Harris This Sporting Life Frank Machin 1963 (36th) Rex Harrison Cleopatra Julius Caesar 1963 (36th) Paul Newman Hud Hud Bannon 1964 (37th) 1964 (37th) Rex Harrison My Fair Lady Professor Henry Higgins 1964 (37th) Richard Burton Becket Thomas Becket 1964 (37th) Peter O'Toole Becket King Henry II of England 1964 (37th) Anthony Quinn Zorba the Greek Alexis Zorba 1964 (37th) Peter Sellers Dr. Strangelove Group Captain Lionel Mandrake President Merkin Muffley Dr. Strangelove 1965 (38th) 1965 (38th) Lee Marvin Cat Ballou Kid Shelleen Tim Strawn 1965 (38th) Richard Burton The Spy Who Came in from the Cold Alec Leamas 1965 (38th) Laurence Olivier Othello Othello 1965 (38th) Rod Steiger The Pawnbroker Sol Nazerman 1965 (38th) Oskar Werner Ship of Fools Willie Schumann 1966 (39th) 1966 (39th) Paul Scofield A Man for All Seasons Sir Thomas More 1966 (39th) Alan Arkin The Russians Are Coming, the Russians Are Coming Lt. Rozanov 1966 (39th) Richard Burton Who's Afraid of Virginia Woolf? George 1966 (39th) Michael Caine Alfie Alfie Elkins 1966 (39th) Steve McQueen The Sand Pebbles Jake Holman 1967 (40th) 1967 (40th) Rod Steiger In the Heat of the Night Police Chief Bill Gillespie 1967 (40th) Warren Beatty Bonnie and Clyde Clyde Barrow 1967 (40th) Dustin Hoffman The Graduate Benjamin Braddock 1967 (40th) Paul Newman Cool Hand Luke Luke Jackson 1967 (40th) Spencer Tracy(posthumous nomination) Guess Who's Coming to Dinner Matt Drayton 1968 (41st) 1968 (41st) Cliff Robertson Charly Charly Gordon 1968 (41st) Alan Arkin The Heart Is a Lonely Hunter John Singer 1968 (41st) Alan Bates The Fixer Yakov Bok 1968 (41st) Ron Moody Oliver! Fagin 1968 (41st) Peter O'Toole The Lion in Winter King Henry II of England 1969 (42nd) 1969 (42nd) John Wayne True Grit Rooster Cogburn 1969 (42nd) Richard Burton Anne of the Thousand Days King Henry VIII of England 1969 (42nd) Dustin Hoffman Midnight Cowboy Enrico Salvatore 'Ratso' Rizzo 1969 (42nd) Peter O'Toole Goodbye, Mr. Chips Arthur Chipping 1969 (42nd) Jon Voight Midnight Cowboy Joe Buck ===1970s=== Year Actor Movie Role 1970 (43rd) 1970 (43rd) George C. Scott (declined) Patton Gen. George S. Patton Jr. 1970 (43rd) Melvyn Douglas I Never Sang for My Father Tom Garrison 1970 (43rd) James Earl Jones The Great White Hope Jack Jefferson 1970 (43rd) Jack Nicholson Five Easy Pieces Robert Eroica Dupea 1970 (43rd) Ryan O'Neal Love Story Oliver Barrett IV 1971 (44th) 1971 (44th) Gene Hackman The French Connection Jimmy \"Popeye\" Doyle 1971 (44th) Peter Finch Sunday Bloody Sunday Doctor Daniel Hirsh 1971 (44th) Walter Matthau Kotch Joseph P. Kotcher 1971 (44th) George C. Scott The Hospital Doctor Herbert Bock 1971 (44th) Chaim Topol Fiddler on the Roof Tevye 1972 (45th) 1972 (45th) Marlon Brando (declined) The Godfather Vito Corleone 1972 (45th) Michael Caine Sleuth Milo Tindle 1972 (45th) Laurence Olivier Sleuth Andrew Wyke 1972 (45th) Peter O'Toole The Ruling Class Jack Gurney, 14th Earl of Gurney 1972 (45th) Paul Winfield Sounder Nathan Lee Morgan 1973 (46th) 1973 (46th) Jack Lemmon Save the Tiger Harry Stoner 1973 (46th) Marlon Brando Last Tango in Paris Paul 1973 (46th) Jack Nicholson The Last Detail Billy Buddusky 1973 (46th) Al Pacino Serpico Frank Serpico 1973 (46th) Robert Redford The Sting Johnny Hooker 1974 (47th) 1974 (47th) Art Carney Harry and Tonto Harry Coombes 1974 (47th) Albert Finney Murder on the Orient Express Hercule Poirot 1974 (47th) Dustin Hoffman Lenny Lenny Bruce 1974 (47th) Jack Nicholson Chinatown Jake 'J.J.' Gittes 1974 (47th) Al Pacino The Godfather Part II Michael Corleone 1975 (48th) 1975 (48th) Jack Nicholson One Flew Over the Cuckoo's Nest Randle Patrick McMurphy 1975 (48th) Walter Matthau The Sunshine Boys Willy Clark 1975 (48th) Al Pacino Dog Day Afternoon Sonny Wortzik 1975 (48th) Maximilian Schell The Man in the Glass Booth Arthur Goldman 1975 (48th) James Whitmore Give 'em Hell, Harry! Harry S. Truman 1976 (49th) 1976 (49th) Peter Finch (posthumous win) Network Howard Beale 1976 (49th) Robert De Niro Taxi Driver Travis Bickle 1976 (49th) Giancarlo Giannini Seven Beauties Pasqualino Frafuso 1976 (49th) William Holden Network Max Schumacher 1976 (49th) Sylvester Stallone Rocky Rocky Balboa 1977 (50th) 1977 (50th) Richard Dreyfuss The Goodbye Girl Elliot Garfield 1977 (50th) Woody Allen Annie Hall Alvy Singer 1977 (50th) Richard Burton Equus Martin Dysart 1977 (50th) Marcello Mastroianni A Special Day Gabriele 1977 (50th) John Travolta Saturday Night Fever Tony Manero 1978 (51st) 1978 (51st) Jon Voight Coming Home Luke Martin 1978 (51st) Warren Beatty Heaven Can Wait Joe Pendleton 1978 (51st) Gary Busey The Buddy Holly Story Buddy Holly 1978 (51st) Robert De Niro The Deer Hunter Michael Vronsky 1978 (51st) Laurence Olivier The Boys from Brazil Ezra Lieberman 1979 (52nd) 1979 (52nd) Dustin Hoffman Kramer vs. Kramer Ted Kramer 1979 (52nd) Jack Lemmon The China Syndrome Jack Godell 1979 (52nd) Al Pacino ...And Justice for All Arthur Kirkland 1979 (52nd) Roy Scheider All That Jazz Joe Gideon 1979 (52nd) Peter Sellers Being There Chance ===1980s=== Year Actor Movie Role 1980 (53rd) 1980 (53rd) Robert De Niro Raging Bull Jake LaMotta 1980 (53rd) Robert Duvall The Great Santini Lieutenant Colonel Bull Meechum 1980 (53rd) John Hurt The Elephant Man John Merrick 1980 (53rd) Jack Lemmon Tribute Scottie Templeton 1980 (53rd) Peter O'Toole The Stunt Man Eli Cross 1981 (54th) 1981 (54th) Henry Fonda On Golden Pond Norman Thayer 1981 (54th) Warren Beatty Reds John Reed 1981 (54th) Burt Lancaster Atlantic City Lou Pascal 1981 (54th) Dudley Moore Arthur Arthur Bach 1981 (54th) Paul Newman Absence of Malice Michael Colin Gallagher 1982 (55th) 1982 (55th) Ben Kingsley Gandhi Mohandas Karamchand Gandhi 1982 (55th) Dustin Hoffman Tootsie Michael Dorsey / Dorothy Michaels 1982 (55th) Jack Lemmon Missing Ed Horman 1982 (55th) Paul Newman The Verdict Frank Galvin 1982 (55th) Peter O'Toole My Favorite Year Alan Swann 1983 (56th) 1983 (56th) Robert Duvall Tender Mercies Mac Sledge 1983 (56th) Michael Caine Educating Rita Dr. Frank Bryant 1983 (56th) Tom Conti Reuben, Reuben Gowan McGland 1983 (56th) Tom Courtenay The Dresser Norman 1983 (56th) Albert Finney The Dresser Sir 1984 (57th) 1984 (57th) F. Murray Abraham Amadeus Antonio Salieri 1984 (57th) Jeff Bridges Starman Starman 1984 (57th) Albert Finney Under the Volcano Geoffrey Firmin 1984 (57th) Tom Hulce Amadeus Wolfgang Amadeus Mozart 1984 (57th) Sam Waterston The Killing Fields Sydney Schanberg 1985 (58th) 1985 (58th) William Hurt Kiss of the Spider Woman Luis Molina 1985 (58th) Harrison Ford Witness Detective Captain John Book 1985 (58th) James Garner Murphy's Romance Murphy Jones 1985 (58th) Jack Nicholson Prizzi's Honor Charley Partanna 1985 (58th) Jon Voight Runaway Train Oscar 'Manny' Manheim 1986 (59th) 1986 (59th) Paul Newman The Color of Money Fast Eddie Felson 1986 (59th) Dexter Gordon Round Midnight Dale Turner 1986 (59th) Bob Hoskins Mona Lisa George 1986 (59th) William Hurt Children of a Lesser God James Leeds 1986 (59th) James Woods Salvador Richard Boyle 1987 (60th) 1987 (60th) Michael Douglas Wall Street Gordon Gekko 1987 (60th) William Hurt Broadcast News Tom Grunick 1987 (60th) Marcello Mastroianni Dark Eyes Romano 1987 (60th) Jack Nicholson Ironweed Francis Phelan 1987 (60th) Robin Williams Good Morning, Vietnam Adrian Cronauer 1988 (61st) 1988 (61st) Dustin Hoffman Rain Man Raymond Babbitt 1988 (61st) Gene Hackman Mississippi Burning Agent Rupert Anderson 1988 (61st) Tom Hanks Big Josh Baskin 1988 (61st) Edward James Olmos Stand and Deliver Jaime Escalante 1988 (61st) Max von Sydow Pelle the Conqueror Lassefar 1989 (62nd) 1989 (62nd) Daniel Day-Lewis My Left Foot Christy Brown 1989 (62nd) Kenneth Branagh Henry V King Henry V of England 1989 (62nd) Tom Cruise Born on the Fourth of July Ron Kovic 1989 (62nd) Morgan Freeman Driving Miss Daisy Hoke Colburn 1989 (62nd) Robin Williams Dead Poets Society John Keating ===1990s=== Year Actor Movie Role 1990 (63rd) 1990 (63rd) Jeremy Irons Reversal of Fortune Claus von Bülow 1990 (63rd) Kevin Costner Dances with Wolves Lieutenant John J. Dunbar 1990 (63rd) Robert De Niro Awakenings Leonard Lowe 1990 (63rd) Gérard Depardieu Cyrano de Bergerac Cyrano de Bergerac 1990 (63rd) Richard Harris The Field 'Bull' McCabe 1991 (64th) 1991 (64th) Anthony Hopkins The Silence of the Lambs Hannibal Lecter 1991 (64th) Warren Beatty Bugsy Bugsy Siegel 1991 (64th) Robert De Niro Cape Fear Max Cady 1991 (64th) Nick Nolte The Prince of Tides Tom Wingo 1991 (64th) Robin Williams The Fisher King Parry 1992 (65th) 1992 (65th) Al Pacino Scent of a Woman Lieutenant Colonel Frank Slade 1992 (65th) Robert Downey, Jr. Chaplin Charlie Chaplin 1992 (65th) Clint Eastwood Unforgiven William Munny 1992 (65th) Stephen Rea The Crying Game Fergus 1992 (65th) Denzel Washington Malcolm X Malcolm X 1993 (66th) 1993 (66th) Tom Hanks Philadelphia Andrew Beckett 1993 (66th) Daniel Day-Lewis In the Name of the Father Gerry Conlon 1993 (66th) Laurence Fishburne What's Love Got to Do with It Ike Turner 1993 (66th) Anthony Hopkins The Remains of the Day James Stevens 1993 (66th) Liam Neeson Schindler's List Oskar Schindler 1994 (67th) 1994 (67th) Tom Hanks Forrest Gump Forrest Gump 1994 (67th) Morgan Freeman The Shawshank Redemption Ellis Boyd \"Red\" Redding 1994 (67th) Nigel Hawthorne The Madness of King George King George III of the United Kingdom 1994 (67th) Paul Newman Nobody's Fool Donald \"Sully\" Sullivan 1994 (67th) John Travolta Pulp Fiction Vincent Vega 1995 (68th) 1995 (68th) Nicolas Cage Leaving Las Vegas Ben Sanderson 1995 (68th) Richard Dreyfuss Mr. Holland's Opus Glenn Holland 1995 (68th) Anthony Hopkins Nixon Richard Nixon 1995 (68th) Sean Penn Dead Man Walking Matthew Poncelet 1995 (68th) Massimo Troisi (posthumous nomination) Il Postino Mario Ruoppolo 1996 (69th) 1996 (69th) Geoffrey Rush Shine David Helfgott 1996 (69th) Tom Cruise Jerry Maguire Jerry Maguire 1996 (69th) Ralph Fiennes The English Patient Count Laszlo de Almásy 1996 (69th) Woody Harrelson The People vs. Larry Flynt Larry Flynt 1996 (69th) Billy Bob Thornton Sling Blade Karl Childers 1997 (70th) 1997 (70th) Jack Nicholson As Good as It Gets Melvin Udall 1997 (70th) Matt Damon Good Will Hunting Will Hunting 1997 (70th) Robert Duvall The Apostle Euliss 'Sonny' Dewey — The Apostle E.F. 1997 (70th) Peter Fonda Ulee's Gold Ulee Jackson 1997 (70th) Dustin Hoffman Wag the Dog Stanley Motss 1998 (71st) 1998 (71st) Roberto Benigni Life Is Beautiful Guido Orefice 1998 (71st) Tom Hanks Saving Private Ryan Captain John Miller 1998 (71st) Ian McKellen Gods and Monsters James Whale 1998 (71st) Nick Nolte Affliction Wade Whitehouse 1998 (71st) Edward Norton American History X Derek Vinyard 1999 (72nd) 1999 (72nd) Kevin Spacey American Beauty Lester Burnham 1999 (72nd) Russell Crowe The Insider Jeffrey Wigand 1999 (72nd) Richard Farnsworth The Straight Story Alvin Straight 1999 (72nd) Sean Penn Sweet and Lowdown Emmet Ray 1999 (72nd) Denzel Washington The Hurricane Rubin 'Hurricane' Carter ===2000s=== Year Actor Movie Role(s) 2000 (73rd) 2000 (73rd) Russell Crowe Gladiator Maximus Decimus Meridius 2000 (73rd) Javier Bardem Before Night Falls Reinaldo Arenas 2000 (73rd) Tom Hanks Cast Away Chuck Noland 2000 (73rd) Ed Harris Pollock Jackson Pollock 2000 (73rd) Geoffrey Rush Quills The Marquis de Sade 2001 (74th) 2001 (74th) Denzel Washington Training Day Alonzo Harris 2001 (74th) Russell Crowe A Beautiful Mind John Nash 2001 (74th) Sean Penn I Am Sam Sam Dawson 2001 (74th) Will Smith Ali Muhammad Ali 2001 (74th) Tom Wilkinson In the Bedroom Dr. Matt Fowler 2002 (75th) 2002 (75th) Adrien Brody The Pianist Władysław Szpilman 2002 (75th) Nicolas Cage Adaptation. Charlie Kaufman Donald Kaufman 2002 (75th) Michael Caine The Quiet American Thomas Fowler 2002 (75th) Daniel Day-Lewis Gangs of New York William \"Bill the Butcher\" Cutting 2002 (75th) Jack Nicholson About Schmidt Warren R. Schmidt 2003 (76th) 2003 (76th) Sean Penn Mystic River Jimmy Markum 2003 (76th) Johnny Depp Pirates of the Caribbean: The Curse of the Black Pearl Captain Jack Sparrow 2003 (76th) Ben Kingsley House of Sand and Fog Massoud Amir Behrani 2003 (76th) Jude Law Cold Mountain Inman 2003 (76th) Bill Murray Lost in Translation Bob Harris 2004 (77th) 2004 (77th) Jamie Foxx Ray Ray Charles 2004 (77th) Don Cheadle Hotel Rwanda Paul Rusesabagina 2004 (77th) Johnny Depp Finding Neverland Sir J.M. Barrie 2004 (77th) Leonardo DiCaprio The Aviator Howard Hughes 2004 (77th) Clint Eastwood Million Dollar Baby Frankie Dunn 2005 (78th) 2005 (78th) Philip Seymour Hoffman Capote Truman Capote 2005 (78th) Terrence Howard Hustle & Flow Djay 2005 (78th) Heath Ledger Brokeback Mountain Ennis Del Mar 2005 (78th) Joaquin Phoenix Walk the Line Johnny Cash 2005 (78th) David Strathairn Good Night, and Good Luck Edward R. Murrow 2006 (79th) 2006 (79th) Forest Whitaker The Last King of Scotland Idi Amin 2006 (79th) Leonardo DiCaprio Blood Diamond Danny Archer 2006 (79th) Ryan Gosling Half Nelson Dan Dunne 2006 (79th) Peter O'Toole Venus Maurice 2006 (79th) Will Smith The Pursuit of Happyness Chris Gardner 2007 (80th) 2007 (80th) Daniel Day-Lewis There Will Be Blood Daniel Plainview 2007 (80th) George Clooney Michael Clayton Michael Clayton 2007 (80th) Johnny Depp Sweeney Todd: The Demon Barber of Fleet Street Sweeney Todd 2007 (80th) Tommy Lee Jones In the Valley of Elah Hank Deerfield 2007 (80th) Viggo Mortensen Eastern Promises Nikolai Luzhin 2008 (81st) 2008 (81st) Sean Penn Milk Harvey Milk 2008 (81st) Richard Jenkins The Visitor Walter Vale 2008 (81st) Frank Langella Frost/Nixon Richard Nixon 2008 (81st) Brad Pitt The Curious Case of Benjamin Button Benjamin Button 2008 (81st) Mickey Rourke The Wrestler Randy \"The Ram\" Robinson 2009 (82nd) 2009 (82nd) Jeff Bridges Crazy Heart Ottis 'Bad' Blake 2009 (82nd) George Clooney Up in the Air Ryan Bingham 2009 (82nd) Colin Firth A Single Man George Falconer 2009 (82nd) Morgan Freeman Invictus Nelson Mandela 2009 (82nd) Jeremy Renner The Hurt Locker SFC William James ===2010s=== Year Actor Movie Role 2010 (83rd) 2010 (83rd) Colin Firth The King's Speech King George VI 2010 (83rd) Javier Bardem Biutiful Uxbal 2010 (83rd) Jeff Bridges True Grit Rooster Cogburn 2010 (83rd) Jesse Eisenberg The Social Network Mark Zuckerberg 2010 (83rd) James Franco 127 Hours Aron Ralston 2011 (84th) 2011 (84th) Jean Dujardin The Artist George Valentin 2011 (84th) Demián Bichir A Better Life Carlos Galindo 2011 (84th) George Clooney The Descendants Matt King 2011 (84th) Gary Oldman Tinker Tailor Soldier Spy George Smiley 2011 (84th) Brad Pitt Moneyball Billy Beane 2012 (85th) 2012 (85th) Daniel Day-Lewis Lincoln Abraham Lincoln 2012 (85th) Bradley Cooper Silver Linings Playbook Pat 2012 (85th) Hugh Jackman Les Misérables Jean Valjean 2012 (85th) Joaquin Phoenix The Master Freddie Quell 2012 (85th) Denzel Washington Flight William „Whip“ Whitaker 2013 (86th) 2013 (86th) Matthew McConaughey Dallas Buyers Club Ron Woodroof 2013 (86th) Christian Bale American Hustle Irving Rosenfeld 2013 (86th) Bruce Dern Nebraska Woodrow \"Woody\" T. Grant 2013 (86th) Leonardo DiCaprio The Wolf of Wall Street Jordan Belfort 2013 (86th) Chiwetel Ejiofor 12 Years a Slave Solomon Northup 2014 (87th) 2014 (87th) Eddie Redmayne The Theory of Everything Stephen Hawking 2014 (87th) Steve Carell Foxcatcher John du Point 2014 (87th) Bradley Cooper American Sniper Chris Kyle 2014 (87th) Benedict Cumberbatch The Imitation Game Alan Turing 2014 (87th) Michael Keaton Birdman Riggan Thomson 2015 (88th) 2015 (88th) Leonardo DiCaprio The Revenant Hugh Glass 2015 (88th) Bryan Cranston Trumbo Dalton Trumbo 2015 (88th) Matt Damon The Martian Mark Watney 2015 (88th) Michael Fassbender Steve Jobs Steve Jobs 2015 (88th) Eddie Redmayne The Danish Girl Lili Elbe 2016 (89th) 2016 (89th) Casey Affleck Manchester by the Sea Lee Chandler 2016 (89th) Andrew Garfield Hacksaw Ridge Desmond Doss 2016 (89th) Ryan Gosling La La Land Sebastian Wilber 2016 (89th) Viggo Mortensen Captain Fantastic Ben Cash 2016 (89th) Denzel Washington Fences Troy Maxson 2017 (90th) 2017 (90th) Gary Oldman Darkest Hour Winston Churchill 2017 (90th) Timothée Chalamet Call Me by Your Name Elio Perlman 2017 (90th) Daniel Day-Lewis Phantom Thread Reynolds Woodcock 2017 (90th) Daniel Kaluuya Get Out Chris Washington 2017 (90th) Denzel Washington Roman J. Israel, Esq. Roman J. Israel 2018 (91st) 2018 (91st) Rami Malek Bohemian Rhapsody Freddie Mercury 2018 (91st) Christian Bale Vice Dick Cheney 2018 (91st) Bradley Cooper A Star Is Born Jackson Maine 2018 (91st) Willem Dafoe At Eternity's Gate Vincent Van Gogh 2018 (91st) Viggo Mortensen Green Book Tony \"Lip\" Vallelonga 2019 (92nd) 2019 (92nd) Joaquin Phoenix Joker Arthur Fleck / Joker 2019 (92nd) Antonio Banderas Pain and Glory Salvador Mallo 2019 (92nd) Leonardo DiCaprio Once Upon a Time in Hollywood Rick Dalton 2019 (92nd) Adam Driver Marriage Story Charlie Barber 2019 (92nd) Jonathan Pryce The Two Popes Cardinal Jorge Mario Bergoglio ===2020s=== Year Actor Movie Role 2020 (93rd) 2020 (93rd) Anthony Hopkins The Father Anthony 2020 (93rd) Riz Ahmed Sound of Metal Ruben Stone 2020 (93rd) Chadwick Boseman (posthumous nomination) Ma Rainey's Black Bottom Levee Green 2020 (93rd) Gary Oldman Mank Herman J. Mankiewicz 2020 (93rd) Steven Yeun Minari Jacob Yi 2021 (94th) 2021 (94th) Will Smith King Richard Richard Williams 2021 (94th) Javier Bardem Being the Ricardos Desi Arnaz 2021 (94th) Benedict Cumberbatch The Power of the Dog Phil Burbank 2021 (94th) Andrew Garfield Tick, Tick... Boom! Jonathan Larson 2021 (94th) Denzel Washington The Tragedy of Macbeth Lord Macbeth 2022 (95th) 2022 (95th) Brendan Fraser Charlie The Whale 2022 (95th) Austin Butler Elvis Presley Elvis 2022 (95th) Colin Farrell Pádraic Súilleabháin The Banshees of Inisherin 2022 (95th) Paul Mescal Calum Paterson Aftersun 2022 (95th) Bill Nighy Rodney Williams Living 2023 (96th) Bradley Cooper Leonard Bernstein Maestro 2023 (96th) Colman Domingo Bayard Rustin Rustin 2023 (96th) Paul Giamatti Paul Hunham The Holdovers 2023 (96th) Cillian Murphy J. Robert Oppenheimer Oppenheimer 2023 (96th) Jeffrey Wright Thelonious \"Monk\" Ellison American Fiction 2023 (96th) ==Related pages== *BAFTA Award for Best Actor in a Leading Role ==Other websites== * Oscars.org (official Academy site) Actor",
 "title": "Academy Award for Best Actor"
}