{
 "id": "360377",
 "text": "The Academy Award for Best Costume Design is one of the Academy Awards of Merit. It is given each year by the Academy of Motion Picture Arts and Sciences (AMPAS) for achievement in movie costume design. It was first given for movies made in 1948. This was when separate awards were given for black- and-white and color movies. Since the merger of the two categories in 1967, the academy has not given out the award to contemporary movies very often. ==Winners and nominees== ===1940s=== Year Category Winner Nominees Ref 1948 Black and white Hamlet – Roger K. Furse * B.F.'s Daughter - Irene Lentz Color Joan of Arc – Dorothy Jeakins and Barbara Karinska * The Emperor Waltz - Edith Head and Gile Steele 1949 Black and white The Heiress – Edith Head and Gile Steele * Prince of Foxes - Vittorio Nino Novarese Color Adventures of Don Juan – Marjorie Best, Leah Rhodes and William Travilla * Mother Is a Freshman - Kay Nelson === 1950s === Year Category Winner Nominees Ref 1950 Black and white All About Eve – Edith Head, Charles LeMaire * Born Yesterday - Jean Louis * The Magnificent Yankee - Walter Plunkett Color Samson and Delilah – Edith Head, Charles LeMaire, Dorothy Jeakins, Elois Jenssen, Gile Steele, Gwen Wakeling * The Black Rose - Michael Whittaker * That Forsyte Woman - Walter Plunkett, Arlington Valles 1951 Black and white A Place in the Sun – Edith Head * Kind Lady - Walter Plunkett, Gile Steele (posthumous nomination) * The Model and the Marriage Broker - Charles LeMaire, Renie Conley * The Mudlark - Edward Stevenson, Margaret Furse * A Streetcar Named Desire - Lucinda Ballard Color An American in Paris – Orry-Kelly, Walter Plunkett, Irene Sharaff * David and Bathsheba - Charles LeMaire, Edward Stevenson * The Great Caruso - Helen Rose, Gile Steele (posthumous nomination) * Quo Vadis? - Herschel McCoy * The Tales of Hoffmann - Hein Heckroth 1952 Black and white The Bad and the Beautiful – Helen Rose * Affair in Trinidad - Jean Louis * Carrie - Edith Head * My Cousin Rachel - Charles LeMaire, Dorothy Jeakins * Sudden Fear - Sheila O'Brien Color Moulin Rouge – Marcel Vertès * The Greatest Show on Earth - Edith Head, Dorothy Jeakins, Miles White * Hans Christian Andersen - Antoni Clavé, Mary Wills, Barbara Karinska * The Merry Widow - Helen Rose, Gile Steele (posthumous nomination) 1953 Black and white Roman Holiday – Edith Head * The Actress - Walter Plunkett * Dream Wife - Helen Rose, Herschel McCoy * From Here to Eternity - Jean Louis * The President's Lady - Charles LeMaire, Renie Conley Color The Robe – Charles LeMaire, Emile Santiago * The Band Wagon - Mary Ann Nyberg * Call Me Madam - Irene Sharaff * How to Marry a Millionaire - Charles LeMaire, William Travilla * Young Bess - Walter Plunkett 1954 Black and white Sabrina – Edith Head * The Earrings of Madame de... - Georges Annenkov, Rosine Delamare * Executive Suite - Helen Rose * Indiscretion of an American Wife - Christian Dior * It Should Happen To You - Jean Louis Color Gate of Hell – Sanzo Wada * Brigadoon - Irene Sharaff * Désirée - Charles LeMaire, Rene Hubert * A Star Is Born - Jean Louis, Mary Ann Nyberg, Irene Sharaff * There's No Business Like Show Business - Charles LeMaire, William Travilla, Miles White 1955 Black and white I'll Cry Tomorrow – Helen Rose * The Pickwick Papers - Beatrice Dawson * Queen Bee - Jean Louis * The Rose Tattoo - Edith Head * Ugetsu - Tadaoto Kainosho Color Love Is a Many-Splendored Thing – Charles LeMaire * Guys and Dolls - Irene Sharaff * Interrupted Melody - Helen Rose * To Catch a Thief - Edith Head * The Virgin Queen - Charles LeMaire, Mary Wills 1956 Black and white The Solid Gold Cadillac – Jean Louis * Seven Samurai - Kohei Ezaki * The Power and the Prize - Helen Rose * The Proud and Profane - Edith Head * Teenage Rebel - Charles LeMaire, Mary Wills Color The King and I – Irene Sharaff * Around the World in 80 Days - Miles White * Giant - Moss Mabry, Marjorie Best * The Ten Commandments - Edith Head, Ralph Jester, John Jensen, Dorothy Jeakins, Arnold Friberg * War and Peace - Marie de Matteis From 1957 onwards, the award merged into one category. Year Winner Nominees Ref 1957 Les Girls – Orry-Kelly * An Affair to Remember - Charles LeMaire * Funny Face - Edith Head, Hubert de Givenchy * Pal Joey - Jean Louis * Raintree County - Walter Plunkett 1958 Gigi – Cecil Beaton * Bell, Book and Candle - Jean Louis * The Buccaneer - Ralph Jester, Edith Head, John Jensen * A Certain Smile - Charles LeMaire, Mary Wills * Some Came Running - Walter Plunkett For 1959 the Award was again divided into two awards. Year Category Winner Nominees Ref 1959 Black and white Some Like It Hot – Orry-Kelly * Career - Edith Head * The Diary of Anne Frank - Charles LeMaire, Mary Wills * The Gazebo - Helen Rose * The Young Philadelphians - Howard Shoup Color Ben-Hur – Elizabeth Haffenden * The Best of Everything - Adele Palmer * The Big Fisherman - Renie Conley * The Five Pennies - Edith Head * Porgy and Bess - Irene Sharaff ===1960s=== Year Category Winner Nominees Ref 1960 Black and white The Facts of Life – Edith Head and Edward Stevenson * Never on Sunday - Danny Vachlioti * The Rise and Fall of Legs Diamond - Howard Shoup * Seven Thieves - Bill Thomas * The Virgin Spring - Marik Vos Color Spartacus – Arlington Valles * Can-Can - Irene Sharaff * Midnight Lace - Irene Lentz * Pepe - Edith Head * Sunrise at Campobello - Marjorie Best 1961 Black and white La Dolce Vita – Piero Gherardi * The Children's Hour - Dorothy Jeakins * Claudell Inglish - Howard Shoup * Judgment at Nuremberg - Jean Louis * Yojimbo - Yoshirō Muraki Color West Side Story – Irene Sharaff * Babes in Toyland - Bill Thomas * Back Street - Jean Louis * Flower Drum Song - Irene Sharaff * Pocketful of Miracles - Edith Head and Walter Plunkett 1962 Black and white What Ever Happened to Baby Jane? – Norma Koch * Days of Wine and Roses - Don Feld * The Man Who Shot Liberty Valance - Edith Head * The Miracle Worker - Ruth Morley * Phaedra - Denny Vachlioti Color The Wonderful World of the Brothers Grimm – Mary Wills * Bon Voyage! - Bill Thomas * Gypsy - Orry-Kelly * The Music Man - Dorothy Jeakins * My Geisha - Edith Head 1963 Black and white 8½ – Piero Gherardi * Love with the Proper Stranger - Edith Head * The Stripper - William Travilla * Toys in the Attic - Bill Thomas * Wives and Lovers - Edith Head Color Cleopatra – Renie Conley, Vittorio Nino Novarese and Irene Sharaff * The Cardinal - Donald Brooks * How the West Was Won - Walter Plunkett * The Leopard - Piero Tosi * A New Kind of Love - Edith Head 1964 Black and white The Night of the Iguana – Dorothy Jeakins * A House Is Not a Home - Edith Head * Hush… Hush, Sweet Charlotte - Norma Koch * Kisses for My President - Howard Shoup * The Visit - René Hubert Color My Fair Lady – Cecil Beaton * Becket - Margaret Furse * Mary Poppins - Tony Walton * The Unsinkable Molly Brown - Morton Haack * What a Way to Go! - Edith Head, Moss Mabry 1965 Black and white Darling – Julie Harris * Morituri - Moss Mabry * A Rage to Live - Howard Shoup * Ship of Fools - Jean Louis and Bill Thomas * The Slender Thread - Edith Head Color Doctor Zhivago – Phyllis Dalton * The Agony and the Ecstasy - Vittorio Nino Novarese * The Greatest Story Ever Told - Marjorie Best and Vittorio Nino Novarese * Inside Daisy Clover - Edith Head and Bill Thomas * The Sound of Music - Dorothy Jeakins 1966 Black and white Who's Afraid of Virginia Woolf? – Irene Sharaff * The Gospel According to St. Matthew - Danilo Donati * Mandragola - Danilo Donati * Mister Buddwing - Helen Rose * Morgan! - Jocelyn Rickards Color A Man for All Seasons – Elizabeth Haffenden * Gambit - Jean Louis * Hawaii - Dorothy Jeakins * Juliet of the Spirits (Giulietta degli spiriti) - Piero Gherardi * The Oscar - Edith Head From 1967 the category was merged permanently. Year Winner Nominees Ref 1967 Camelot – John Truscott * Bonnie and Clyde - Theadora Van Runkle * The Happiest Millionaire - Bill Thomas * The Taming of the Shrew - Danilo Donati and Irene Sharaff * Thoroughly Modern Millie - Jean Louis 1968 Romeo and Juliet – Danilo Donati * The Lion in Winter - Margaret Furse * Oliver! - Phyllis Dalton * Planet of the Apes - Morton Haack * Star! - Donald Brooks 1969 Anne of the Thousand Days – Margaret Furse * Hello, Dolly! - Irene Sharaff * Gaily, Gaily - Ray Aghayan * Sweet Charity - Edith Head * They Shoot Horses, Don't They? - Don Feld ===1970s=== Year Winner Nominees Ref 1970 Cromwell – Vittorio Nino Novarese * Airport - Edith Head * Darling Lili - Jack Bear and Donald Brooks * The Hawaiians - Bill Thomas * Scrooge - Margaret Furse 1971 Nicholas and Alexandra – Yvonne Blake and Antonio Castillo * Bedknobs and Broomsticks - Bill Thomas * Death in Venice - Piero Tosi * Mary, Queen of Scots - Margaret Furse * What's the Matter with Helen? - Morton Haack 1972 Travels with My Aunt – Anthony Powell * The Godfather - Anna Hill Johnstone * Lady Sings the Blues - Ray Aghayan, Norma Koch and Bob Mackie * The Poseidon Adventure - Paul Zastupnevich * Young Winston - Anthony Mendleson 1973 The Sting – Edith Head * Cries and Whispers - Marik Vos * Ludwig - Piero Tosi * Tom Sawyer - Don Feld * The Way We Were - Dorothy Jeakins and Moss Mabry 1974 The Great Gatsby – Theoni V. Aldredge * Chinatown - Anthea Sylbert * Daisy Miller - John Furness * The Godfather Part II - Theadora Van Runkle * Murder on the Orient Express - Tony Walton 1975 Barry Lyndon – Milena Canonero and Ulla-Britt Soderlund * The Four Musketeers - Yvonne Blake and Ron Talsky * Funny Lady - Ray Aghayan and Bob Mackie * The Magic Flute - Karin Erskine and Henny Noremark * The Man Who Would Be King - Edith Head 1976 Fellini's Casanova – Danilo Donati * Bound for Glory - William Ware Theiss * The Incredible Sarah - Anthony Mendleson * The Passover Plot - Mary Wills * The Seven-Per-Cent Solution - Alan Barrett 1977 Star Wars – John Mollo * Airport '77 - Edith Head and Burton Miller * Julia - Anthea Sylbert * A Little Night Music - Florence Klotz * The Other Side of Midnight - Irene Sharaff 1978 Death on the Nile – Anthony Powell * Caravans - Renie Conley * Days of Heaven - Patricia Norris * The Swarm - Paul Zastupnevich * The Wiz - Tony Walton 1979 All That Jazz – Albert Wolsky * Agatha - Shirley Ann Russell * The Bird Cage (La cage aux folles) - Ambra Danon and Piero Tosi * Butch and Sundance: The Early Days - William Ware Theiss * The Europeans - Judy Moorcroft ===1980s=== Year Winner Nominees Ref 1980 Tess – Anthony Powell * The Elephant Man - Patricia Norris * My Brilliant Career - Anna Senior * Somewhere in Time - Jean-Pierre Dorleac * When Time Ran Out - Paul Zastupnevich 1981 Chariots of Fire – Milena Canonero * The French Lieutenant's Woman - Tom Rand * Pennies from Heaven - Bob Mackie * Ragtime - Anna Hill Johnstone * Reds - Shirley Ann Russell 1982 Gandhi – Bhanu Athaiya and John Mollo * Sophie's Choice - Albert Wolsky * La Traviata - Piero Tosi * Tron - Elois Jenssen and Rosanna Norton * Victor Victoria - Patricia Norris 1983 Fanny and Alexander – Marik Vos * Cross Creek - Joe I. Tompkins * Heart Like a Wheel - William Ware Theiss * The Return of Martin Guerre - Anne-Marie Marchand * Zelig - Santo Loquasto 1984 Amadeus – Theodor Pistek * 2010 - Patricia Norris * The Bostonians - Jenny Beavan and John Bright * A Passage to India - Judy Moorcroft * Places in the Heart - Ann Roth 1985 Ran – Emi Wada * The Color Purple - Aggie Guerard Rodgers * The Journey of Natty Gann - Albert Wolsky * Out of Africa - Milena Canonero * Prizzi's Honor - Donfeld 1986 A Room with a View – Jenny Beavan and John Bright * The Mission - Enrico Sabbatini * Otello - Anna Anni and Maurizio Millenotti * Peggy Sue Got Married - Theadora Van Runkle * Pirates - Anthony Powell 1987 The Last Emperor – James Acheson * The Dead - Dorothy Jeakins * Empire of the Sun - Bob Ringwood * Maurice - Jenny Beavan and John Bright * The Untouchables - Marilyn Vance-Straker 1988 Dangerous Liaisons – James Acheson * Coming to America - Deborah Nadoolman * A Handful of Dust - Jane Robinson * Sunset - Patricia Norris * Tucker: The Man and His Dream - Milena Canonero 1989 Henry V – Phyllis Dalton * The Adventures of Baron Munchausen - Gabriella Pescucci * Driving Miss Daisy - Elizabeth McBride * Harlem Nights - Joe I. Tompkins * Valmont - Theodor Pištěk ===1990s=== Year Winner Nominees Ref 1990 Cyrano de Bergerac – Franca Squarciapino * Avalon - Gloria Gresham * Dances with Wolves - Elsa Zamparelli * Dick Tracy - Milena Canonero * Hamlet - Maurizio Millenotti 1991 Bugsy – Albert Wolsky * The Addams Family - Ruth Myers * Barton Fink - Richard Hornung * Hook - Anthony Powell * Madame Bovary - Corinne Jorry 1992 Bram Stoker's Dracula – Eiko Ishioka * Enchanted April - Sheena Napier * Howards End - Jenny Beavan and John Bright * Malcolm X - Ruth Carter * Toys - Albert Wolsky 1993 The Age of Innocence – Gabriella Pescucci * Orlando - Sandy Powell * The Piano - Janet Patterson * The Remains of the Day - Jenny Beavan and John Bright * Schindler's List - Anna B. Sheppard 1994 The Adventures of Priscilla, Queen of the Desert – Tim Chappel and Lizzy Gardiner * Bullets Over Broadway - Jeffrey Kurland * Little Women - Colleen Atwood * Maverick - April Ferry * Queen Margot (La reine Margot) - Moidele Bickel 1995 Restoration – James Acheson * Braveheart - Charles Knode * Richard III - Shuna Harwood * Sense and Sensibility - Jenny Beavan and John Bright * 12 Monkeys - Julie Weiss 1996 The English Patient – Ann Roth * Angels & Insects - Paul Brown * Emma - Ruth Myers * Hamlet - Alexandra Byrne * The Portrait of a Lady - Janet Patterson 1997 Titanic – Deborah Lynn Scott * Amistad - Ruth E. Carter * Kundun - Dante Ferretti * Oscar and Lucinda - Janet Patterson * The Wings of the Dove - Sandy Powell 1998 Shakespeare in Love – Sandy Powell * Beloved - Colleen Atwood * Elizabeth - Alexandra Byrne * Pleasantville - Judianna Makovsky * Velvet Goldmine - Sandy Powell 1999 Topsy-Turvy – Lindy Hemming * Anna and the King - Jenny Beavan * Sleepy Hollow - Colleen Atwood * The Talented Mr. Ripley - Gary Jones and Ann Roth * Titus - Milena Canonero ===2000s=== Year Winner Nominees Ref 2000 Gladiator – Janty Yates * 102 Dalmatians - Anthony Powell * Crouching Tiger, Hidden Dragon - Tim Yip * How the Grinch Stole Christmas - Rita Ryack * Quills - Jacqueline West 2001 Moulin Rouge! – Catherine Martin and Angus Strathie * The Affair of the Necklace - Milena Canonero * Gosford Park - Jenny Beavan * Harry Potter and the Philosopher's Stone - Judianna Makovsky * The Lord of the Rings: The Fellowship of the Ring - Ngila Dickson and Richard Taylor 2002 Chicago – Colleen Atwood * Frida - Julie Weiss * Gangs of New York - Sandy Powell * The Hours - Ann Roth * The Pianist - Anna B. Sheppard 2003 The Lord of the Rings: The Return of the King – Ngila Dickson and Richard Taylor * Girl with a Pearl Earring - Dien van Straalen * The Last Samurai - Ngila Dickson * Master and Commander: The Far Side of the World - Wendy Stites * Seabiscuit - Judianna Makovsky 2004 The Aviator – Sandy Powell * Finding Neverland - Alexandra Byrne * Lemony Snicket's A Series of Unfortunate Events - Colleen Atwood * Ray - Sharen Davis * Troy - Bob Ringwood 2005 Memoirs of a Geisha – Colleen Atwood * Charlie and the Chocolate Factory - Gabriella Pescucci * Mrs Henderson Presents - Sandy Powell * Pride & Prejudice - Jacqueline Durran * Walk the Line - Arianne Phillips 2006 Marie Antoinette – Milena Canonero * Curse of the Golden Flower (Man cheng jin dai huang jin jia) - Chung Man Yee * The Devil Wears Prada - Patricia Field * Dreamgirls - Sharen Davis * The Queen - Consolata Boyle 2007 Elizabeth: The Golden Age – Alexandra Byrne * Across the Universe - Albert Wolsky * Atonement - Jacqueline Durran * La Vie en Rose (posthumous nomination) - Marit Allen * Sweeney Todd: The Demon Barber of Fleet Street - Colleen Atwood 2008 The Duchess – Michael O'Connor * Australia - Catherine Martin * The Curious Case of Benjamin Button - Jacqueline West * Milk - Danny Glicker * Revolutionary Road - Albert Wolsky 2009 The Young Victoria – Sandy Powell * Bright Star - Janet Patterson * Coco Before Chanel - Catherine Leterrier * The Imaginarium of Doctor Parnassus - Monique Prudhomme * Nine - Colleen Atwood ===2010s=== Year Winner Nominees Ref 2010 Alice in Wonderland – Colleen Atwood * I Am Love – Antonella Cannarozzi * The King's Speech – Jenny Beavan * The Tempest – Sandy Powell * True Grit – Mary Zophres 2011 The Artist \\- Mark Bridges * Anonymous – Lisy Christl * Hugo – Sandy Powell * Jane Eyre – Michael O'Connor * W.E. – Arianne Phillips 2012 Anna Karenina – Jacqueline Durran * Les Misérables – Paco Delgado * Lincoln – Joanna Johnston * Mirror Mirror (posthumous nomination) – Eiko Ishioka * Snow White and the Huntsman – Colleen Atwood 2013 The Great Gatsby – Catherine Martin * 12 Years a Slave – Patricia Norris * American Hustle – Michael Wilkinson * The Grandmaster – William Chang Suk Ping * The Invisible Woman– Michael O'Connor 2014 The Grand Budapest Hotel – Milena Canonero * Inherent Vice – Mark Bridges * Into the Woods – Colleen Atwood * Maleficent – Anna B. SheppardJane Clive was initially announced as a nominee for Maleficent, but was later removed from the nomination. *Mr. Turner – Jacqueline Durran 2015 Mad Max: Fury Road – Jenny Beavan * Carol – Sandy Powell * Cinderella – Sandy Powell * The Danish Girl – Paco Delgado * The Revenant – Jacqueline West 2016 Fantastic Beasts and Where to Find Them – Colleen Atwood * Allied – Joanna Johnston * Florence Foster Jenkins – Consolata Boyle * Jackie – Madeline Fontaine * La La Land – Mary Zophres 2017 Phantom Thread – Mark Bridges * Beauty and the Beast – Jacqueline Durran * Darkest Hour – Jacqueline Durran * The Shape of Water – Luis Sequeira * Victoria & Abdul – Consolata Boyle 2018 Black Panther – Ruth E. Carter * The Ballad of Buster Scruggs – Mary Zophres * The Favourite – Sandy Powell * Mary Poppins Returns – Sandy Powell * Mary Queen of Scots – Alexandra Byrne 2019 Little Women – Jacqueline Durran * The Irishman – Sandy Powell and Christopher Peterson * Jojo Rabbit – Mayes C. Rubeo * Joker – Mark Bridges * Once Upon a Time in Hollywood – Arianne Phillips ===2020s=== Year Winner Nominees Ref 2020 Ma Rainey's Black Bottom – Ann Roth * Emma. – Alexandra Byrne * Mank – Trish Summerville * Mulan – Bina Daigeler * Pinocchio – Massimo Cantini Parrini 2021 Cruella – Jenny Beavan * Cyrano – Massimo Cantini Parrini and Jacqueline Durran * Dune – Jacqueline West and Bob Morgan * Nightmare Alley – Luis Sequeira * West Side Story – Paul Tazewell 2022 Black Panther: Wakanda Forever – Ruth E. Carter * Babylon – Mary Zophres * Elvis – Catherine Martin * Everything Everywhere All at Once – Shirley Kurata * Mrs. Harris Goes to Paris – Jenny Beavan 2023 Poor things \\- Holly Waddington * Barbie - Jacqueline Durran * Killers of the Flower Moon - Jacqueline West * Napoleon - Janty Yates and Dave Crossman * Oppenheimer - Ellen Mirojnick 2024 Wicked \\- Paul Tazewell * A Complete Unknown - Arianne Phillips * Conclave - Lisy Christl * Gladiator II - Janty Yates and Dave Crossman * Nosferatu - Linda Muir ==Related pages== * BAFTA Award for Best Costume Design ==Notes== ==References== ==Other websites== * Academy of Motion Picture Arts and Sciences official site Costume Design",
 "title": "Academy Award for Best Costume Design"
}