{
 "id": "36042",
 "text": "Shrews are small mammals which look rather like mice. They were classified in the old Insectivora, but that is no longer used. Now they are classified in the family Soricidae, suborder Soricomorpha. True shrews are not to be confused with West Indies shrews, treeshrews, otter shrews, or elephant shrews, which belong to different families or orders. Although its external appearance is generally that of a long-nosed mouse, a shrew is not a rodent, as mice are. In fact it is related to moles. Shrews have sharp, spike-like teeth, not the familiar gnawing front incisor teeth of rodents. Shrews are distributed almost worldwide. Of the major tropical and temperate land masses, only New Guinea, Australia, and New Zealand do not have any native shrews. In South America, shrews are relatively recent immigrants and are present only in the northern Andes. In terms of species diversity, the shrew family is the fourth most successful mammal family. == Taxonomy == The old order Insectivora was not a natural (monophyletic) group. New terms are used to classify its former groups. That explains the little-known terms in the taxobox. == Characteristics == All shrews are small, most no larger than a mouse. The largest is the Asian house shrew (Suncus murinus), which is about 15 cm long and weighs around 100 grams.Louch C.D.; Ghosh A.K. & Pal B.C. 1966. Seasonal changes in weight and reproductive activity of Suncus murinus in West Bengal, India. Journal of Mammalogy 47 (1): 73–78. Several are very small: the Etruscan shrew (Suncus etruscus), is about 3.5 cm and 2 grams. It is the smallest living terrestrial mammal and the smallest type of shrew. In general, shrews live in and on the ground. They search for seeds, insects, nuts, and worms. Some climb trees, some live underground, some live under snow, and some hunt in water. They have small eyes, and generally poor vision, but have excellent senses of hearing and smell. They are very active animals, with big appetites. Shrews have an unusually high metabolic rate.William J. & Platt W.J. 1974. Metabolic rates of Short-tailed shrews. Physiological Zoology. 47: 2, 75–90. JStore Shrews usually eat 80–90% of their own body weight in food daily. They do not hibernate, but can enter torpor. Shrews can lose between 30% and 50% of their body weight in winter, shrinking the size of bones, skull and internal organs. Unlike rodents, which have gnawing incisors that grow continually, the teeth of shrews wear down throughout life, and they lose their milk teeth before birth. Therefore, they have only one set of teeth for their lifetime. Apart from the first pair of incisors, which are long and sharp, and the chewing molars at the back of the mouth, the teeth of shrews are small and peg-like, and may be reduced in number. The dental formula of shrews is: upper=3.1.1-3.3; lower=1-2.0-1.1.3. === Fiercely territorial === Shrews are fiercely territorial. They drive off rivals, and come together only to mate. Many species dig burrows to store food and hide from predators, but this is not universal. Some of them echolocate by squeaking, some are venomous, some have teeth strengthened by iron on the tips, they make ultrasonic squeaks, and two genera echolocate by clicks. They eat plenty and often. They are very active animals, with voracious appetites. Shrews have unusually high metabolic rates, above that expected in small mammals. For this reason, they need to eat almost constantly. Probably the aquatic nymphs of insects (for example, mosquito larvae) are on the menu even though many of these are themselves hungry eaters. == References == Category:Soricomorphs",
 "title": "Shrew"
}