{
 "id": "360525",
 "text": "Carl Adolf \"Max\" von Sydow (10 April 1929 – 8 March 2020) was a Swedish-born French actor. He was nominated for an Academy Award in 2012 for his role as The Renter in Extremely Loud and Incredibly Close (2011). He also portrayed Ernst Stavro Blofeld in Never Say Never Again (1983). His career started in 1949. His other best known roles were Father Lankester Merrin in The Exorcist (1971) and as Emperor Ming the Merciless in Flash Gordon (1980). He was born in Lund, Skåne, Sweden on 10 April 1929.Max von Sydow Biography He was educated at Cathedral School and at the Royal Dramatic Theatre. He was married to Kerstin Olin from 1951 until they divorced in 1979, they had two children. He is currently married to Catherine Brelet since 1997, they have 2 children. He currently lives in Los Angeles, California. Von Sydow was one of the favourite actors of the Swedish movie director Ingmar Bergman. He appeared in twelve Bergman films, most notably as the knight in The Seventh Seal. This film is typical of the existentialist films of the mid-20th century. The knight plays a game of chess with death against the background crisis of the 13th century, with the Black Death and famine ongoing. He acted in over 100 movies. His height and manner lent itself to authority figures, and \"evil villain\" roles. Von Sydow's second marriage to a French lady led to his becoming a French citizen and giving up his Swedish nationality. His family were originally of German/Polish extraction. Von Sydow died on 8 March 2020 in Provence, France at the age of 90.Max Von Sydow: Actor dies aged 90 ==References== ==Other websites== * * * Category:1929 births Category:2020 deaths Category:Actors who played Bond villains Category:French movie actors Category:French stage actors Category:French television actors Category:French voice actors Category:Swedish movie actors Category:Swedish stage actors Category:Swedish television actors Category:Swedish voice actors",
 "title": "Max von Sydow"
}