{
 "id": "360516",
 "text": "Bonnie Lynne Hunt (born September 22, 1961) is an American comedian, actress, writer, director, television producer, and daytime television hosts. She starred in The Bonnie Hunt Show in late 2000s. ==Early life== Hunt was born in Chicago, Illinois. She is the daughter of Alice E. (née Jatczak), a homemaker, and Robert Edward Hunt, an electrician. Her mother is of Polish ancestry and her father was of Irish and Belgian ancestry. She was raised in a large Catholic family, and has three older brothers, Patrick, Kevin, and Tom, two older sisters, Cathy and Carol, and one younger sister, Mary. Hunt was educated in Catholic schools and attended St. Ferdinand Grammar School and Notre Dame High School for Girls in Chicago. ==Personal life== Hunt married investment banker John Murphy in 1988. However, during her June 6, 2006, appearance on the Late Show with David Letterman, she mentioned that she was single again. Hunt's hometown is Chicago and she is a lifelong Chicago Cubs fan, having not missed an Opening Day at Wrigley Field since 1977. She is a supporter of the Multiple Myeloma Research Foundation, of which she is an honorary board member. ==Filmography== ===Movies=== Year Title Role Notes 1988 Rain Man Sally Dibbs 1992 Beethoven Alice Newton 1993 Dave White House Tour Guide 1993 Beethoven's 2nd Alice Newton 1994 Only You Kate Corvatch 1995 Now and Then Mrs. DeWitt 1995 Jumanji Sarah Whittle/Madam Serena Saturn Award for Best Supporting Actress 1996 Getting Away with Murder Dr. Gail Holland 1996 Jerry Maguire Laurel Boyd 1998 Rosie Voice 1998 Kissing a Fool Linda Streicher 1999 I Hate County Rosie Voice 1999 Random Hearts Wendy Judd 1999 Jan Edgecomb Nominated – Blockbuster Entertainment Award for Favorite Supporting Actress – Drama 2000 Return to Me Megan Dayton Also director and writer 2001 Monsters, Inc. Ms. Flint Voice 2002 Stolen Summer Margaret O'Malley Limited release 2003 Cheaper by the Dozen Kate Baker 2005 Cheaper by the Dozen 2 Kate Baker 2005 Loggerheads Grace 2006 I Want Someone to Eat Cheese With Stella Lewis 2006 Cars Sally Carrera Voice 2010 Toy Story 3 Dolly Voice 2011 Hawaiian Vacation Dolly Voice; animated short 2011 Cars 2 Sally Carrera Voice 2013 Monsters University Karen Graves Voice 2019 Woody's Roundup: The Movie Dolly Voice ===Television=== Year Title Role Notes 1984 American Playhouse Foxtrot Dancer Episode: \"Under the Biltmore Clock\" 1990 Grand Carol Anne Smithson Main role 1991–92 Davis Rules Gwen Davis Main role; 18 episodes 1993 The Building Bonnie Kennedy Lead role; also creator, writer, executive producer 1995–96 Bonnie Bonnie Kelly Also writer, producer Viewers for Quality Television Founder's Award (1996) 2002–04 Life with Bonnie Bonnie Molloy Also creator, executive producer, director Nominated: TCA Award for Outstanding Achievement in Comedy (2003), Golden Globe Award for Best Actress – Television Series Musical or Comedy (2003/04), Satellite Award for Best Actress – Television Series Musical or Comedy (2003/04), Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series (2004) 2006 Let Go Director (movie) 2008–10 Herself/Host Also executive producer, writer Nominated – Daytime Emmy Award for Outstanding Talk Show Host (2010) 2010 The Life & Times of Tim Gabe's Mom (voice) Episode: \"Nagging Blonde/Tim and the Elephant\" 2013 Sofia the First Aunt Tilly (voice) Episode: \"Great Aunt- Venture\" 2013 Call Me Crazy: A Five Film Director (movie); \"Eddie\" segment ===Video games=== Year Title Role Notes 2006 Cars Sally Carrera Voice ==References== ==Other websites== * Category:1961 births Category:Living people Category:Actors from Chicago Category:American movie actors Category:Screenwriters from Illinois Category:American stage actors Category:American television actors Category:American television directors Category:American television producers Category:American television writers Category:American voice actors Category:Television personalities from Chicago Category:Comedians from Chicago Category:Saturn Award winners",
 "title": "Bonnie Hunt"
}