{
 "id": "360569",
 "text": "Joseon (; also Chosŏn, Choson, Chosun, Cho-sen), was a Korean state started by Taejo Yi Seong-gye. It began after the end of the Goryeo Dynasty at what is today the city of Kaesong. It ended with the assassination of Empress Myeongseong. Joseon was the last dynasty of Korean history and the longest Confucian dynasty. Today, some Koreans use the word \"Joseon\" to mean something bad because they think of the Joseon Dynasty as something that failed. Young Koreans use the expression \"Hell Joseon\" to talk about how hard it is to find a good job in South Korea today. == History == === Major events === ==== The creation of HangulIt is sometimes written as 'Hangul' based on English, but it is also correct to write 'Hangeul' according to the Romanization system. ==== Hangul is the language of Korea that is still used today. Hangul was created by King Sejong the Great in 1443 and officially put into effect nationwide in 1446. It was created based on the shape of the human vocal apparatus when pronouncing it. The creation of Hangul had many good influences, including the creation of culture. ==== Japanese Invasion (Imjin War) ==== The Japanese Invasion was a war between Joseon and Japan from 1592 to 1598 (7 years). Toyotomi Hideyoshi of Japan invaded Joseon after unifying his country. Then king, Seonjo, fled to the north. But as the Joseon's army, including Yi Sun- sin, fought hard, Japan retreated for a while. Japan invaded again in 1597,This war is called 'Jeong Yoo Jae-ran(Korean : 정유재란). and the war ended when Toyotomi Hideyoshi died. During the war, many cultural assets of Joseon were destroyed and taken away. ==== Qing invasion ==== The Qing invasion was a war fought between the Joseon Dynasty and the Qing Dynasty from 1636 to 1637. Joseon fought to protect the country, but Joseon was eventually defeated by the Qing Dynasty. Injo surrendered to the Qing Dynasty. At this time, many Qing soldiers kidnapped Joseon women to make concubine or sell them. Including this, a lot of social damage had occurred to Joseon because of this invasion. == Notes == == References == Category:1890s disestablishments in Asia Category:States and territories disestablished in the 19th century Category:1392 establishments Category:14th-century establishments in Asia Category:Former countries in Asia",
 "title": "Joseon"
}