{
 "id": "360523",
 "text": "The 1st Academy Awards ceremony was presented by the Academy of Motion Picture Arts and Sciences (AMPAS). It was to honor the best movies of 1927 and 1928. It took place on May 16, 1929 in Los Angeles, California. AMPAS president Douglas Fairbanks hosted the show. Tickets cost five dollars, 270 people attended the event and the ceremony lasted fifteen minutes. Awards were made by Louis B. Mayer. It is the only Academy Awards ceremony not to be broadcast either on radio or television. During the ceremony, the AMPAS gave Academy Awards (now commonly called Oscars) in twelve categories. Winners were announced three months before the live event. Some nominations were announced without reference to a specific movie. Examples were Ralph Hammeras and Nugent Slaughter, who received nominations in the now defunct category of Engineering Effects. Reader must select \"1927/28\" in the \"Award Year(s):\" drop-down menu and press \"Search\". Unlike later ceremonies, an actor or director could be awarded for multiple works in a year. Emil Jannings, for example, was given the Best Actor award for his work in both The Way of All Flesh and The Last Command. Moreover, Charlie Chaplin and Warner Brothers each received an Honorary Award. ==Nominees and winners== Winners are listed first. Nominees and winners of the 1st Academy Awards Outstanding Picture, Production Unique and Artistic Production *Lucien Hubbard for Paramount Pictures – Wings **Howard Hughes for Paramount Pictures – The Racket **William Fox for Fox Film Corporation – Seventh Heaven *William Fox for Fox Film Corporation – Sunrise: A Song of Two Humans **Merian C. Cooper and Ernest B. Schoedsack for Paramount Pictures – Chang: A Drama of the Wilderness **Irving Thalberg for MGM – The Crowd Best Director, Comedy Picture Best Director, Dramatic Picture *Lewis Milestone – Two Arabian Knights **Ted Wilde – Speedy *Frank Borzage – Seventh Heaven ** Herbert Brenon – Sorrell and Son ** King Vidor – The Crowd Best Actor in a Leading Role Best Actress in a Leading Role *Emil Jannings – The Last Command and The Way of All Flesh **Richard Barthelmess – The Noose and The Patent Leather Kid *Janet Gaynor – Seventh Heaven, Street Angel and Sunrise: A Song of Two Humans **Louise Dresser – A Ship Comes In **Gloria Swanson – Sadie Thompson Best Writing, Original Story Best Writing, Adapted Story *Underworld – Ben Hecht **The Last Command – Lajos Bíró *Seventh Heaven – Benjamin Glazer **Glorious Betsy – Anthony Coldeway **The Jazz Singer – Alfred A. Cohn Best Cinematography Best Art Direction *Sunrise: A Song of Two Humans – Charles Rosher and Karl Struss **The Devil Dancer – George Barnes **The Magic Flame – George Barnes **Sadie Thompson – George Barnes *The Dove and Tempest – William Cameron Menzies **Seventh Heaven – Harry Oliver **Sunrise: A Song of Two Humans – Rochus Gliese Best Engineering Effects Best Writing, Title Writing *Wings – Roy Pomeroy **(No specific film) – Ralph Hammeras **(No specific film) – Nugent Slaughter *(No specific film) – Joseph Farnham **(No specific film) – George Marion, Jr. **The Private Life of Helen of Troy – Gerald Duffy ===Honorary Award=== *Charlie Chaplin **\"For versatility and genius in acting, writing, directing and producing The Circus\". *Warner Brothers Production **\"For producing The Jazz Singer, the pioneer outstanding talking picture, which has revolutionized the industry\". ===Multiple nominations and winners=== The following movies received multiple nominations. *Five: Seventh Heaven *Four: Sunrise: A Song of Two Humans *Two: The Crowd, Sadie Thompson and Wings The following movies received multiple awards. *Three: Seventh Heaven and Sunrise: A Song of Two Humans *Two: Wings ==References== Category:Academy Awards",
 "title": "1st Academy Awards"
}