{
 "id": "360774",
 "text": "The Vietnamese alphabet (chữ Quốc ngữ in Vietnamese) is a version of the Latin alphabet that is used to write the Vietnamese language. All letters of the ISO Basic Latin Alphabet are except for F, J, W, and Z, which are found only in loanwords. However, the alphabet has been changed heavily to show Vietnamese pronunciation accurately . Some letters and digraphs make very different sounds from what most users of the Latin alphabet expect likes D, R, and GI. One letter has been added, Đ, to show it is a completely different sound from D. Vowel markers are added to distinguish different vowel sounds like A, Â, and Ǎ. Tone markers are also added since Vietnamese is a tone language, such as Á, Ả, Ã, Ạ, and À. Some vowels have both a vowel marker and a tone marker. For example, the vowel Ǎ can be written as Ắ, Ẳ, Ẵ, Ặ, and Ằ. Sometimes, even non-speakers of Vietnamese can tell something is written in Vietnamese simply based on how many markings a word can have. == History == Unlike many other Asian languages, which are written mainly by using an Asian-made writing system, Vietnamese is written mainly by using the Latin alphabet, which came from Europe. Before the Vietnamese people used the Latin alphabet, they used a writing system that was based on the Chinese character system and called chữ nôm. Chinese loanwords were written the same as they were in Chinese, but thousands of more characters were invented write native Vietnamese words. The amount of time ito learn the system caused the literacy rate in Vietnam to be low when this system was used. In the 17th century, Portuguese Catholic missionaries created a writing system based on their own Latin alphabet to translate Vietnamese and to make it easier to learn for Europeans. When Vietnam first became a French colony, the Latin Vietnamese alphabet and chữ nôm were used alongside each other. Today, however, only the Latin Vietnamese alphabet is officially used in Vietnam, and very few Vietnamese can read chữ nôm. ==Letters== ===Vietnamese characters=== Here is the total set of characters for the lowercase letters: The little ₫ is just the dong currency sign, but most people write VND. b o ô ơ a â ă ê e u ư i y r l c d ó ồ ớ á ấ ắ ề é ụ ứ í ý n h s đ ò ộ ờ à ầ ằ ế è ú ừ ì ỳ m t x g õ ổ ở ã ẫ ẵ ễ ẽ ũ ữ ĩ ỷ v k p ỏ ỗ ợ ả ẩ ẳ ể ẻ ủ ử ỉ ỹ ₫ q ọ ố ỡ ạ ậ ặ ệ ẹ ù ự ị ỵ This makes the alphabet have at least 89 letters. This letter is a word: ở; it means at (or where, place). ====The Latin alphabet==== The main letters from the Latin alphabet: a, b, c, d, e, g, h, i, k, l, m, n, o, p, q, r, s, t, u, v, x, y, qu ====The first set of changed letters==== ô, ơ, â, ă, ê, ư, d This changed set of characters makes new alphabet letters for use in Vietnamese that are an extension to the set of Latin characters already used. English does no extend the alphabet butuses the same written characters again and again to denote different sounds:: ape, angry, all, art, aorta, and apple. In Vietnamese, sounds are divided with their own changes of letters. * 'đ' makes the same sound as the English d. * 'd' in the Vietnamese alphabet is y (in Southern and Central Vietnam), 'd' is z (in Northern Vietnam). * 'a, â, ă' are just different ah letters. * 'u, ư' are different oo letters - never an uh/ah sound. * 'e, ê' are just eh and ey but may sound different to English e. * 'o, ô, ơ' are just awe, oh, and ur but may sound different to English o. Note: i and y are essentially the same vowel and may be exchanged in some situations ====The school alphabet==== The alphabet is taught in Vietnam's schools has these letters: a, b, c, d, e, g, h, i, k, l, m, n, o, p, q, r, s, t, u, v, x, y - ô, ơ, â, ă, ê, ư, đ Vietnamese schools teach the alphabet with those 29 letters. The total number of possible letters is much higher if diacritical marks are added. F, J, W, and Z are not used in native Vietnamese words. Only loanwords, which are borrowed from other languages. use them. ====Making the vowel sounds==== These are the tone rules for vowels with different sounds like music in which only the correct sound can come from the instrument. The instrument does not matter as long as the sound follows the rules. Mark Empty - Ngang or Bằng A a, Ă ă, Â â, E e, Ê ê, I i, O o, Ô ô, Ơ ơ, U u, Ư ư, Y y Unmarked vowels are pronounced with a level voice, in the middle of the speaking range. Lifting - Sắc Á á, Ắ ắ, Ấ ấ, É é, Ế ế, Í í, Ó ó, Ố ố, Ớ ớ, Ú ú, Ứ ứ, Ý ý The lifting mark tells the speaker to start normal and lift. Falling - Huyền À à, Ằ ằ, Ầ ầ, È è, Ề ề, Ì ì, Ò ò, Ồ ồ, Ờ ờ, Ù ù, Ừ ừ, Ỳ ỳ The falling mark tells the speaker to start normal and drop the sound. Turning - Hỏi Ả ả, Ẳ ẳ, Ẩ ẩ, Ẻ ẻ, Ể ể, Ỉ ỉ, Ỏ ỏ, Ổ ổ, Ở ở, Ủ ủ, Ử ử, Ỷ ỷ The turning mark tells the speaker to start low, then drop, and finally lift. Breaking - Ngã Ã ã, Ẵ ẵ, Ẫ ẫ, Ẽ ẽ, Ễ ễ, Ĩ ĩ, Õ õ, Ỗ ỗ, Ỡ ỡ, Ũ ũ, Ữ ữ, Ỹ ỹ A breaking mark tells the speaker to start, stop, drop, and then start again and lift. Sunk - Nặng Ạ ạ, Ặ ặ, Ậ ậ, Ẹ ẹ, Ệ ệ, Ị ị, Ọ ọ, Ộ ộ, Ợ ợ, Ụ ụ, Ự ự, Ỵ ỵ The sunk mark tells the speaker start low and get a quick, sunk stop. Note that in the spoken language, musical pitch or lilt is not the sound quality that changes the most. Different voices have different musical pitches. What the speaker changes is the intensity and the time that is given to the sound parts for each letter (or word). If a speaker uses strong pitch changes, thet are probably for pronunciation. ==Treatment== ===Sounds similar to letters=== The alphabet used to be arranged from 'a to z' by foreign dictionaries when it included two letter sounds. The letters are like two letter sounds in English: 'ch' in mechanic, or Christmas are good examples. In Vietnamese, the 'j' (jeh) sound has a similar sound that is written as 'tr'(jeh). Letters like 'tr' used to be between the other alphabet letters in the order of dictionaries. Another sound is 'ph', which is very famous since it is used in 'phở', the most famous Vietnamese soup in the world. It is an 'f' sound, just like in English - 'phone'. In addition to the normal alphabet consonants, there are nine possible double letters and one triple letter. * CH * GI * GH * KH * NG * NGH * NH * PH * TH * TR (preserved as \"T + R\" by some speakers in southern Vietnam). ===Order=== a ă â b e ê g i k o ô ơ p t u ư v y á ắ ấ c é ế gi í kh ó ố ớ ph th ú ứ x ý à ằ ầ d è ề h ì l ò ồ ờ q tr ù ừ ỳ ả ẳ ẩ đ ẻ ể ỉ m ỏ ổ ở r ủ ử ỷ ã ẵ ẫ ẽ ễ ĩ n õ ỗ ỡ s ũ ữ ỹ ạ ặ ậ ẹ ệ ị nh ọ ộ ợ ụ ự ỵ ===Syllables=== Because the language is influenced by East Asian languages (Japanese, Chinese, etc.), Vietnamese words can be moved around. The reversal of syllable-words moves them to another position in the dictionary. Also, syllable-words can be before others like the articles in English. It is best to use a computer query to find them. ===The alphabet in daily life=== Young leaneers of Vietnamese will spend much time with this alphabet. Correction is very common. The need for correction is used in many comedies about uneducated people. Comedies about foreigners are also becoming very common. The reason for all the attention is how quickly meanings change. To say \"I have a sore head, somewhere\" (\"đầu của tôi là đau đâu!\" in Vietnamese) is nearly impossible for foreign learners on their first day. A learner will hear only 'dow, dow dow' or 'dough, dough, dough' or 'dow, dough, dough', which does not help when they listen. The same problem can be stated in English: 'four forks for foreigners' foreheads forthwith!' Each word in Vietnamese can be identical to another word except for the changes in sound, tone, or letters. The sound is also identical to the ears of English-speakers, which allow for other expressions of sound changes. See: Vietnam Eyes lesson on YouTube ===Foreign characters/letters=== ====From English==== In Vietnam, J, R, W, and Z are now in used many places on billboards, posters, T-shirts, etc.. However, in working for Vietnamese authority or association, their use should be limited until it declares them as acceptable letters.http://www.khoavanhoc- ngonngu.edu.vn/home/index.php?option=com_content&view;=article&id;=1383%3Avit- ten-rieng-nc-ngoai-th-nao&catid;=71%3Angon-ng-hc&Itemid;=107⟨=en However, other alphabets that are used in English might not be accepted. For example: the Greek alphabet is very useful for English-speakers. but in Vietnam it can lack meaning and it would be a decoration for the general population. Educated people will know more letters from the Greek alphabet. ====From Chinese==== Vietnamese used to be written in Chinese characters. A variety for Vietnamese is used in traditional culture. Many Chinese speakers find Vietnamese easy to grasp. The combination of two words is very common to Chinese: phat am, Hong Kong/Xiong Gong etc. . ===Combined characters=== Diphthongs are the next most important step to understanding the use of Vietnamese letters. The combination of toned vowels as dipthongs and triphthongs makes Vietnamese sound very fast. Some phrases can be spoken clearly without consonants being very clear. It is very difficult for English-speakers to follow the combinations of sounds, especially the vowels. === Northern and southern accents === There are many differences between the northern and yjr southern dialects of Vietnamese. Hanoi is the standard for northern dialects, and Saigon is the standard for southern dialects. Here are some differences in pronunciation: * As mentioned earlier, northern Vietnamese pronounce the letter D like the English \"Z\", and southern Vietnamese pronounce it like the English \"Y\". For example, Diem would sound like \"ziem\" in northern accents but like \"yem\" in southern accents. * Northern Vietnamese pronounce the letters GI like the English \"Z\", and southern Vietnamese pronounce it like the English \"Y\". For example, Giap would sound like \"zap\" in northern accents but like \"yap\" in southern accents. * Northern Vietnamese pronounce the letter R like the English \"Z\", and southern Vietnamese pronounce it like the English \"R\". For example, Rang would sound like \"zang\" in northern accents, but like \"rang\" in southern accents. * Northern Vietnamese pronounce the letter V like the English \"V\", and southern Vietnamese pronounce it like the English \"Y\". For example, Viet would sound like \"viet\" in northern accents, but like \"yet\" in southern accents. * Northern Vietnamese pronounce the letter S like the English \"S\", and southern Vietnamese pronounce it like the English \"SH\". For example, Saigon would sound like \"saigon\" in northern accents but like \"shaigon\" in southern accents. ==In computers== Language code ISO 639-1 vi ISO 639-2 vie SIL VIE The Vietnamese keyboard is always virtual (in software), and there are a few in use. Nobody can buy a computer keyboard for Vietnamese, even in Vietnam. The common QWERTY keyboard is used in Vietnam. Software programs for Vietnamese characters are very common. ===On a webpage=== A webpage is usually set to include the UTF-8 standard when using the Vietnamese alphabet. If the design of the characters is strange, a designer of a webpage sets the font to plain \"Arial\". Some special fonts have been made for Vietnamese alphabets. ====Javascript codes==== ===Open source=== Some software is free to use. An open-source software program for the Vietnamese keyboard has already been made. ==References== Category:Vietnam Category:Alphabets Category:Austro-Asiatic languages",
 "title": "Vietnamese alphabet"
}