{
 "id": "361158",
 "text": "Shenyang or Mukden is the capital and largest city of Liaoning Province in northeast China. Shenyang was first used by the Manchu people as their capital in the 17th century. Today it is the biggest city in the Northeast. Shenyang is the transport and commercial hub of China's northeast-particularly with Japan, Russia, and Korea. Shenyang is the railway hub of northeast China. Eight railways connect Shenyang with Beijing, Dalian, Changchun, Harbin and Fushun. The city’s name means \"the city to the north of Shen River\". It comes from the Hun River on the city’s south side, which used to be called the Shen River. People started living here 7,200 years ago. ==Major companies== Many major industrial companies have their headquarters in Shenyang. Brilliance Auto is a major Chinese automobile manufacturer. Most of its production plants are also in Shenyang. Shenyang Aircraft Corporation makes airplanes for civilian use as well as for the PLAAF. Neusoft Group is the biggest software company in China. Shenyang Machine Tool Group is the largest machine tool manufacturer in China. Tyco International, General Motors, and Michelin Shenyang Tire Corporation, are expanding their operations in Shenyang due to a deep pool of skilled technical labor; good transportation; low land-use fees; and solid local support. ==Sports== Shenyang is famous for its football tradition. The local football team is the Liaoning F.C., in the Chinese Super League. Another Chinese Super League team, Shenyang Jinde moved to Changsha in 2007. Shenyang Olympic Sports Centre Stadium was a venue for the football preliminary of 2008 Summer Olympics. Shenyang Sport University is a famous professional sports university in China. The university is the training base for winter sports in China and has many Olympic champions. ==Colleges and universities== * Northeastern University (东北大学/東北大學) * China Medical University (中国医科大学/中國醫科大學) * Shenyang Agricultural University (沈阳农业大学/沈阳农业大学) * Shenyang Pharmaceutical University (沈阳药科大学/瀋陽藥科大學) * Shenyang Aerospace University (沈阳航空航天大学/瀋陽航空航天大學) * Shenyang Jianzhu (Architectural) University (沈阳建筑大学/瀋陽建築大學) * Shenyang University of Chemical Technology * Shenyang Institute of Chemical Technology (沈阳化工大学/瀋陽化工學院) * Shenyang Medical College (沈阳医学院) * Shenyang Normal University (沈阳师范大学/瀋陽師範大學) * Liaoning University (辽宁大学/遼寧大學) * Shenyang Ligong University (沈阳理工大学/瀋陽理工大學) * Shenyang University (沈阳大学/瀋陽大學) * Shenyang University of Technology (沈阳工业大学/瀋陽工業大學) * Shenyang Sport University (沈阳体育学院/瀋陽體育學院) * Shenyang Institute of Engineering (沈阳工程学院/瀋陽工程學院) * Liaoning University of Traditional Chinese Medicine (辽宁中医药大学/遼寧中醫藥大學) ==Twin towns and sister cities== Shenyang is twinned with: *Sapporo, Japan (1980) *Kawasaki, Japan (1981) *Turin, Italy (1985) *Chicago, United States (1985) *Irkutsk, Russia (1992) *Quezon City, Philippines (1993) *Ramat Gan, Israel (1993) *Monterrey, Mexico (1993) *Seongnam, South Korea (1998) *Yaoundé, Cameroon (1998) *Katowice, Poland (2007) *Thessaloniki, Greece *Gumi, South Korea *Leverkusen, Germany *Düsseldorf, Germany ==References== ==Other websites== *How to (say or) pronounce, Shenyang. Wikimedia.org Category:Cities in China Category:Provincial capitals in China Category:Liaoning",
 "title": "Shenyang"
}