{
 "id": "361103",
 "text": "The Space Needle is a tower in Seattle, Washington. It is at the Seattle Center. The Space Needle was built for the 1962 World's Fair. During this time, almost 20,000 people used the elevators every day. Over 2.3 million visitors came to the World Fair overall. The Space Needle is high and wide. It weighs 9,550 tons. When it was completed it was the tallest building to the west of the Mississippi River. [*ref failed*] It is built not to fall in wind up to and earthquakes of up to 9.1 magnitude. This gives protection against an earthquake as powerful as the 1700 Cascadia earthquake. The tower also has 25 lightning rods on its roof to protect it against lightning. The tower is topped with an American flag. The Space Needle has a deck at , where people can look down and look at the view around them. It also has a gift shop with a rotating SkyCity restaurant at . From the top of the Needle, the Downtown Seattle skyline, the Olympic and Cascade Mountains, Mount Rainier, Mount Baker, Elliott Bay and islands around it can be seen. Photographs of the Seattle skyline often show the Space Needle. Visitors can reach the top of the Space Needle by using elevators. These elevators travel at . The trip to the top takes 41 seconds. Some tourists wait in hour-long lines so that they can go to the top of the tower. On windy days, the elevators are slowed down to a . The Space Needle was made a historic landmark on April 19, 1999, by the city's Landmarks Preservation Board. ==Gallery== File:Early photo of seattle space needle.jpg|The Space Needle in the 1960s. File:Space-needle- cc-2.0.jpg|Space Needle from Downtown Seattle. File:SpaceNeedle GiftShop.PNG|The gift shop in the Space Needle. File:Seattle from kerry park.jpg|Space Needle from Kerry Park, Queen Anne Hill, Seattle. File:Seattlecenterspaceneedle.jpg|View from the bottom exof the Needle. File:Seattle skyline night.jpg|The Space Needle at night. File:Y Space-Needle- at-Night.jpg|Space Needle at night. This is how it looks from Kerry Park. File:Seattle Space Needle Victor Grigas.jpg|The Space Needle and the elevator during the day. File:SpaceNeedleTopAtNight.jpg|The bottom of the Space Needle at night. Space Needle, Seattle, Washington, Estados Unidos, 2017-09-02, DD 38-40 HDR.jpg|Night view == Related pages == * CN Tower == References == == Other websites == * Official website Category:Buildings and structures in Seattle Category:1961 establishments in the United States Category:1960s establishments in Washington (state)",
 "title": "Space Needle"
}