{
 "id": "361135",
 "text": "True owls (typical owls) are owls of the family Strigidae. They are one of the two families of owls, with 189 living species in 25 genera. The other family is the barn owls. True owls are found on every continent except Antarctica. The division of owls into these two groups is quite ancient. The relationships of the owls in general are still unresolved.Sibley, Charles Gald & Monroe, Burt L. Jr. 1990. Distribution and taxonomy of the birds of the world: a study in molecular evolution. Yale University Press, New Haven, CT. Johnsgard, Paul A. 2002. North American Owls: biology and natural history. 2nd ed. Smithsonian Institution Press, Washington DC. ==Morphology== Typical owls vary greatly in size. The smallest is the elf owl. Its weight is a hundred times less than the largest, the Eurasian eagle owl and Blakiston's fish owl. Most owls have very similar bodies.Marks J.S; Cannings R.J. & Mikkola H. 1999. Family Strigidae (Typical owls). In del Hoyo J; Elliot A. & Sargatal J. (eds) 1999. Handbook of the Birds of the World. Volume 5: Barn-Owls to Hummingbirds. Lynx Edicions. They have large heads, short tails, and round facial circles around the eyes. Most live in trees (with a few exceptions like the burrowing owl) and get their food on the wing. The wings are large, broad, rounded and long. Like other birds of prey many owls have females that are larger than males.Earhart, Caroline M. and Johnson, Ned K. 1970. Size dimorphism and food habits of North American owls. Condor 72 (3): 251-264 They are nocturnal. Because of this the plumage is not much different between males and females. The feathers are soft and the base of each is downy. This give them silent flight. Hearing in owls is highly sensitive. The ears are asymmetrical which lets the owl localise a sound. Owls have massive eyes relative to their body size. ==References== * Feduccia, J. Alan 1970. Some birds of prey from the Upper Pliocene of Kansas. Auk 87(4): 795-797. PDF fulltext * Olson, Storrs L. 1985: The fossil record of birds. In Farner D.S.; King J.R. & Parkes, Kenneth C. (eds): Avian Biology 8: 79-238. Academic Press, New York. * Sánchez Marco, Antonio (2004): Avian zoogeographical patterns during the Quaternary in the Mediterranean region and paleoclimatic interpretation. Ardeola 51(1): 91-132. PDF fulltext ==Other websites== *ITIS - Strigidae Taxonomy *Typical owl videos on the Internet Bird Collection *Strigidae sounds from the Neotropics on xeno-canto.org *The Owl Pages about owls - photos, calls, books, art, mythology and more. Category:Strigiformes",
 "title": "True owl"
}