{
 "id": "361283",
 "text": "Walt Disney Animation Studios is an American animation studio headquartered in Burbank, California. It was started on October 16, 1923 under the name, Disney Brothers Cartoon Studio. In 1929, it was renamed Walt Disney Productions. On February 2, 1986, after Disney had moved into making mostly live-action movies, it was re-established as Walt Disney Feature Animation, taking on its current name in 2007. It has been known for making animated feature movies in association with Walt Disney Pictures. == Locations == Walt Disney Animation Studios is headquartered in the Sorcerer's Hat building which was completed in 1995. It is in Burbank, California close to Walt Disney Studios. The Walt Disney Studios where its original animated studio was located. Satellite studios were around the world in locations like Paris, France, Tokyo, Japan and even at Disney's Hollywood Studios, one of the four theme parks in Walt Disney World, Florida. They were all closed down by 2004 and December 24, 2022 because the 2D movies which the satellite studios made were unsuccessful what ==Characters== Mickey Mouse, Minnie Mouse, Pluto, Goofy, Donald Duck, Daisy Duck and other Disney animated characters. == Filmography == This list includes the movies made by Walt Disney Animation Studios; originally Walt Disney Productions (1937–1985) and Walt Disney Feature Animation (1986–2007). === Released movies === Movie U.S. release date Directed by Written by Based on/Inspired by Produced by Composed by as Walt Disney Productions Snow White and the Seven Dwarfs Dorothy Ann Blank, Richard Creedon, Merrill De Maris, Otto Englander, Earl Hurd, Dick Rickard, Ted Sears & Webb Smith \"Snow White\" by Brothers Grimm Walt Disney Frank Churchill, Paul Smith & Leigh Harline Pinocchio Aurelius Battaglia, Billy Cottrell, Otto Englander, Erdman Penner, Joseph Sabo, Ted Sears & Webb Smith The Adventures of Pinocchio by Carlo Collodi Leigh Harline & Paul Smith Fantasia See credits Joe Grant & Dick Huemer \"The Sorcerer's Apprentice\" by Johann Wolfgang von Goethe inter alia Walt Disney & Ben Sharpsteen Leopold Stokowski Dumbo Supervising Director: Ben Sharpsteen * * * Sequence Directors: Samuel Armstrong, Norman Ferguson Wilfred Jackson Jack Kinney Bill Roberts Dumbo, the Flying Elephant by Helen Aberson and Harold Pearl Walt Disney Frank Churchill and Oliver Wallace Bambi Supervising Director: David Hand * * * Sequence Directors: James Algar Samuel Armstrong Graham Heid Bill Roberts Paul Satterfield Norman Wright Chuck Couch, Carl Fallberg, Larry Morey, Mel Shaw, Vernon Stallings & Ralph Wright Bambi, a Life in the Woods by Felix Salten Frank Churchill and Edward H. Plumb Saludos Amigos Norm Ferguson Wilfred Jackson Jack Kinney Hamilton Luske Bill Roberts Homer Brightman, Joe Grant, Dick Huemer, Harold Reeves, Roy Williams & Ralph Wright original Paul Smith and Edward H. Plumb The Three Caballeros Supervising Director: Norm Ferguson * * * Sequence Directors: Clyde Geronimi Jack Kinney Bill Roberts Harold Young James Bodrero, Homer Brightman, Del Connell, Billy Cottrell, Bill Peet, Elmer Plummer, Ted Sears, Ernest Terrazas, Roy Williams & Ralph Wright Edward H. Plumb, Paul Smith and Charles Wolcott Make Mine Music Clyde Geronimi Jack Kinney Hamilton Luske Joshua Meador Robert Cormack James Bodrero, Homer Brightman, Erwin Graham, Eric Gurney, T. Hee, Sylvia Holland, Dick Huemer, Dick Kelsey, Dick Kinney, Jesse Marsh, Tom Oreb, Cap Palmer, Erdman Penner, Dick Shaw, John Walbridge & Roy Williams \"Casey at the Bat\" by Ernest Thayer & Peter and the Wolf by Sergei Prokofiev inter alia Eliot Daniel, Ken Darby, Charles Wolcott, Oliver Wallace and Edward H. Plumb Fun and Fancy Free Jack Kinney Hamilton Luske William Morgan Bill Roberts Homer Brightman, Eldon Dedini, Lance Nolley, Tom Oreb, Harry Reeves & Ted Sears \"Little Bear Bongo\" by Sinclair Lewis & \"Jack and the Beanstalk\" by Benjamin Tabart Oliver Wallace, Paul Smith, Eliot Daniel and Charles Wolcott Melody Time Clyde Geronimi Wilfred Jackson Jack Kinney Hamilton Luske Ken Anderson, Homer Brightman, Billy Cottrell, Winston Hibler, Jesse Marsh, Bob Moore, Erdman Penner, Harry Reeves, Joe Rinaldi, Ted Sears, Art Scott & John Walbridge The life of Johnny Appleseed, Little Toot by Hardie Gramatky, \"Trees\" by Joyce Kilmer & Pecos Bill Eliot Daniel, Paul Smith and Ken Darby The Adventures of Ichabod and Mr. Toad James Algar Clyde Geronimi Jack Kinney Homer Brightman, Winston Hibler, Erdman Penner, Harry Reeves, Joe Rinaldi & Ted Sears The Wind in the Willows by Kenneth Grahame \"The Legend of Sleepy Hollow\" by Washington Irving Oliver Wallace Cinderella Clyde Geronimi Wilfred Jackson Hamilton Luske Ken Anderson, Homer Brightman, Winston Hibler, Bill Peet, Erdman Penner, Harry Reeves, Joe Rinaldi & Ted Sears \"Cinderella\" by Charles Perrault Alice in Wonderland Milt Banta, Del Connell, Billy Cottrell, Joe Grant, Winston Hibler, Dick Huemer, Dick Kelsey, Tom Oreb, Bill Peet, Erdman Penner, Joe Rinaldi, Ted Sears & John Walbridge Alice's Adventures in Wonderland & Through the Looking-Glass by Lewis Carroll Peter Pan Milt Banta, Billy Cottrell, Winston Hibler, Bill Peet, Erdman Penner, Joe Rinaldi, Ted Sears & Ralph Wright Peter Pan by J. M. Barrie Lady and the Tramp Don DaGradi Erdman Penner Joe Rinaldi Ralph Wright Happy Dan, the Cynical Dog & Lady and the Tramp: The Story of Two Dogs by Ward Greene Sleeping Beauty Supervising Director: Clyde Geronimi * * * Sequence Directors: Les Clark Eric Larson Wolfgang Reitherman Erdman Penner, Joe Rinaldi, Winston Hibler, Bill Peet, Ted Sears, Ralph Wright & Milt Banta \"Sleeping Beauty\" by Charles Perrault, \"Little Briar Rose\" by Brothers Grimm & The Sleeping Beauty by Pyotr Ilyich Tchaikovsky George Bruns One Hundred and One Dalmatians Clyde Geronimi Hamilton Luske Wolfgang Reitherman Bill Peet The Hundred and One Dalmatians by Dodie Smith The Sword in the Stone Wolfgang Reitherman The Sword in the Stone by T. H. White The Jungle Book Ken Anderson, Larry Clemmons, Vance Gerry & Ralph Wright the Mowgli stories from The Jungle Book by Rudyard Kipling The Aristocats Ken Anderson, Larry Clemmons, Eric Cleworth, Vance Gerry, Julius Svendsen, Frank Thomas & Ralph Wright original Winston Hibler & Reitherman Robin Hood Ken Anderson, Larry Clemmons, Eric Cleworth, Vance Gerry, Dave Michener, Julius Svendsen & Frank Thomas The legend of Robin Hood Reitherman The Many Adventures of Winnie the Pooh John Lounsbery Wolfgang Reitherman Ken Anderson, X Atencio, Ted Berman, Larry Clemmons, Eric Cleworth, Vance Gerry, Winston Hibler, Julius Svendsen & Ralph Wright Winnie- the-Pooh book series by A. A. Milne Walt Disney & Reitherman Buddy Baker The Rescuers John Lounsbery Wolfgang Reitherman Art Stevens Ken Anderson, Ted Berman, Larry Clemmons, Vance Gerry, Fred Lucky, Burny Mattinson, David Michener, Dick Sebast & Frank Thomas The Rescuers book series by Margery Sharp Reitherman and Ron W. Miller Artie Butler The Fox and the Hound Ted Berman Richard Rich Art Stevens Berman, Larry Clemmons, Vance Gerry, Steve Hulett, Earl Kress, Burny Mattinson, David Michener & Peter Young The Fox and the Hound by Daniel P. Mannix Ron W. Miller, Wolfgang Reitherman & Stevens Buddy Baker The Black Cauldron Ted Berman Richard Rich Berman, Vance Gerry, Joe Hale, David Jonas, Roy Morita, Rich, Art Stevens, Al Wilson & Peter Young The Chronicles of Prydain book series by Lloyd Alexander Joe Hale & Ron W. Miller Elmer Bernstein as Walt Disney Feature Animation The Great Mouse Detective Ron Clements Burny Mattinson David Michener John Musker Clements, Vance Gerry, Steve Hulett, Mattinson, Michener, Bruce M. Morris, Musker, Matthew O'Callaghan, Melvin Shaw & Peter Young Basil of Baker Street book series by Eve Titus Mattinson Henry Mancini Oliver & Company George Scribner Jim Cox, Timothy J. Disney & James Mangold Oliver Twist by Charles Dickens Kathleen Gavin (uncredited) J. A. C. Redford The Little Mermaid John Musker Ron Clements \"The Little Mermaid\" by Hans Christian Andersen Howard Ashman & Musker Alan Menken The Rescuers Down Under Hendel Butoy Mike Gabriel Jim Cox, Karey Kirkpatrick, Byron Sampson & Joe Ranft The Rescuers book series by Margery Sharp Thomas Schumacher Bruce Broughton Beauty and the Beast Gary Trousdale Kirk Wise Linda Woolverton \"Beauty and the Beast\" by Jeanne-Marie Leprince de Beaumont Don Hahn Alan Menken Aladdin John Musker Ron Clements Clements, Musker, Ted Elliott & Terry Rossio \"Aladdin and the Magic Lamp\" from One Thousand and One Nights Musker & Clements The Lion King Roger Allers Rob Minkoff Irene Mecchi, Jonathan Roberts & Linda Woolverton original Don Hahn Hans Zimmer Pocahontas Mike Gabriel Eric Goldberg Carl Binder, Susannah Grant & Philip LaZebnik The lives of Pocahontas and John Smith James Pentecost Alan Menken The Hunchback of Notre Dame Gary Trousdale Kirk Wise Screenplay: Tab Murphy, Irene Mecchi, Bob Tzudiker, Noni White & Jonathan Roberts Story: Murphy Notre Dame de Paris by Victor Hugo Don Hahn Hans Zimmer Hercules John Musker Ron Clements Irene Mecchi & Donald McEnery and Shirley Pierce The Greek myth of Heracles Alice Dewey * * * Co-executive producer: Don Hahn Mulan Barry Cook Tony Bancroft Screenplay: Rita Hsiao, Chris Sanders, Philip LaZebnik, Raymond Singer & Eugenia Bostwick-Singer Story: Robert D. San Souci Ballad of Mulan by Guo Maoqian Pam Coats Jerry Goldsmith Tarzan Kevin Lima Chris Buck Tab Murphy, Bob Tzudiker & Noni White Tarzan of the Apes by Edgar Rice Burroughs Bonnie Arnold Mark Mancina Fantasia 2000 Don Hahn Eric Goldberg Francis Glebas Hendel Butoy James Algar Pixote Hunt The Brizzi Brothers Screenplay: David Reynolds, Don Dougherty, Hahn, Goldberg, Irene Mecchi and The Brizzi Brothers Story: Carl Fallberg, Dougherty, Goldberg, James Capobianco, James Fujii, Kirk Hanson, Pat Ventura, Perce Pearce, Rob Gibbs, Ron Meurin, Stevie Wermers, Terry Naughton, Todd Kurosawa and The Brizzi Brothers \"The Steadfast Tin Soldier\" by Hans Christian Andersen and \"Noah's Ark\" Donald W. Ernst and Roy E. Disney James Levine Dinosaur Eric Leighton Ralph Zondag Screenplay: John Hanson, Robert Nelson Jacobs and Walon Green Story: Hanson, Zondag, Jacobs, Thom Enriquez and Green original Pam Marsden James Newton Howard The Emperor's New Groove Mark Dindal Screenplay: David Reynolds Story: Chris Williams & Dindal original Randy Fullmer John Debney Atlantis: The Lost Empire Gary Trousdale Kirk Wise Screenplay: Tab Murphy Story: Wise, Trousdale, Joss Whedon, Bryce, Jackie Zabel & Murphy The legend of Atlantis Don Hahn James Newton Howard Lilo & Stitch Chris Sanders Dean DeBlois original Clark Spencer Alan Silvestri Treasure Planet John Musker Ron Clements Screenplay: Clements, Musker & Rob Edwards Story: Clements, Musker, Ted Elliott & Terry Rossio Treasure Island by Robert Louis Stevenson Roy Conli, Musker & Clements James Newton Howard Brother Bear Aaron Blaise Robert Walker Tab Murphy, Lorne Cameron, David Hoselton, Steve Bencich & Ron J. Friedman original Chuck Williams Mark Mancina Home on the Range Will Finn John Sanford Screenplay: Finn & Sanford Story: Finn, Sanford, Michael LaBash, Sam Levine, Mark Kennedy & Robert Lence Alice Dewey Goldstone Alan Menken Chicken Little Mark Dindal Screenplay: Steve Bencich, Ron J. Friedman & Ron Anderson Story: Dindal & Mark Kennedy \"Henny Penny\" Randy Fullmer John Debney as Walt Disney Animation Studios Meet the Robinsons Stephen J. Anderson Jon A. Bernstein, Michelle Spritz, Don Hall, Nathan Greno, Aurian Redson, Joe Mateo & Anderson A Day with Wilbur Robinson by William Joyce Dorothy McKim Danny Elfman Bolt Chris Williams Byron Howard Dan Fogelman & Williams original Clark Spencer John Powell The Princess and the Frog John Musker Ron Clements Screenplay: Clements, Musker & Rob Edwards Story: Clements, Musker, Greg Erb, & Jason Oremland The Frog Princess by E. D. Baker & \"The Frog Prince\" by Brothers Grimm Peter Del Vecho Randy Newman Tangled Nathan Greno Byron Howard Dan Fogelman \"Rapunzel\" by Brothers Grimm Roy Conli Alan Menken Winnie the Pooh Stephen J. Anderson Don Hall Anderson, Clio Chiang, Don Dougherty, Hall, Kendelle Hoyer, Brian Kesinger, Nicole Mitchell & Jeremy Spears Peter Del Vecho & Clark Spencer Henry Jackman Wreck-It Ralph Rich Moore Screenplay: Phil Johnston & Jennifer Lee Story: Moore, Johnston & Jim Reardon original Clark Spencer Frozen Chris Buck Jennifer Lee Screenplay: Lee Story: Buck, Lee & Shane Morris original Peter Del Vecho Christophe Beck Big Hero 6 Don Hall Chris Williams Robert L. Baird, Dan Gerson & Jordan Roberts Big Hero 6 by Man of Action Roy Conli Henry Jackman Zootopia Byron Howard Rich Moore * * * Co-director: Jared Bush Screenplay: Bush & Phil Johnston Story: Howard, Moore, Bush, Jim Reardon, Josie Trinidad, Johnston & Jennifer Lee original Clark Spencer Michael Giacchino Moana John Musker Ron Clements * * * Co-directors: Chris Williams Don Hall Screenplay: Jared Bush Story: Clements, Musker, Williams, Hall, Pamela Ribon, Aaron & Jordan Kandell original Osnat Shurer Mark Mancina Ralph Breaks the Internet Rich Moore Phil Johnston Screenplay: Johnston & Pamela Ribon Story: Moore, Johnston, Jim Reardon, Ribon & Josie Trinidad rowspan=\"2\" Clark Spencer Henry Jackman Frozen II Chris Buck Jennifer Lee Screenplay: Lee Story: Buck, Lee, Marc E. Smith, Kristen Anderson-Lopez & Robert Lopez Peter Del Vecho Christophe Beck Raya and the Last Dragon Don Hall Carlos López Estrada * * * Co-directors: Paul Briggs John Ripa Screenplay: Qui Nguyen & Adele Lim Story: Briggs, Hall, Lim, López Estrada, Kiel Murray, Nguyen, Ripa & Dean Wellins original Osnat Shurer & Peter Del Vecho James Newton Howard Encanto Jared Bush Byron Howard * * * Co-director: Charise Castro Smith Screenplay: Smith & Bush Story: Bush, Howard, Smith, Jason Hand, Nancy Kruse & Lin-Manuel Miranda original Yvett Merino & Clark Spencer Germaine Franco Strange World Don Hall * * * Co-director: Qui Nguyen Nguyen Roy Conli Henry Jackman Wish Chris Buck Fawn Veerasunthorn Screenplay: Jennifer Lee & Allison Moore Story: Lee, Buck, Veerasunthorn & Moore Peter Del Vecho & Juan Pablo Reyes David Metzger === Upcoming films === Film Release date Directed by Written by Based on/Inspired by Produced by Composed by Moana 2 David G. Derrick Jr. rowspan=\"2\" Osnat Shurer Mark Mancina Zootopia 2 Jared Bush * * * Co-director: Josie Trinidad Jared Bush Brad Simonsen == Achievements == The animation studio is noted for creating a number of now-standard innovations in the animation industry, including: * The multiplane camera (for Snow White, but first used in the Academy-award winning short \"The Old Mill\") * The realistic animation of special effects and human characters (for Snow White) * Advanced composition processes to combine live-action and animated elements using color film (for The Three Caballeros) * The use of xerography in animation to transfer drawings to cels as opposed to ink-tracing (developed for 101 Dalmatians, but first tested in a few scenes in Sleeping Beauty and first fully used in the Academy-award nominated short Goliath II) * The use of all-digital methods for painting, compositing, and recording animated features using the CAPS (Computer Animation Production System) Among its significant achievements are: * The first animated feature in Technicolor (Snow White and the Seven Dwarfs) * The first major motion picture in stereophonic sound (Fantasia), otherwise known as Fantasound. * The first animated feature in CinemaScope (Lady and the Tramp) * The first large format animated movie (the 70 mm Sleeping Beauty) * The first Disney animated feature to use computer- generated imagery (The Black Cauldron) * The first Disney animated feature making heavy use of CGI computer animation (Oliver & Company) * The first Disney animated feature to use digital coloring (The Little Mermaid, which introduced Disney's CAPS process) * The first feature movie to be shot using a 100% digital process (The Rescuers Down Under, CAPS) * The first animated feature to be nominated for the Academy Award for Best Picture, and the only nominee for Best Picture to be traditionally-animated (Beauty and the Beast) * The first Disney animated feature to gross $200 million, and the highest- grossing movie of 1992 (Aladdin) * The highest grossing traditionally-animated (or hand-drawn) movie of all time (The Lion King) * The largest movie premiere with over 100,000 viewers (Pocahontas) * The most expensive animated movie ever made costing $260 million (Tangled) * The highest number of original characters ever created for an animated movie (188 characters) (Wreck-It Ralph) ===Documentary movies about Disney animation=== *A Trip Through the Walt Disney Studios (1937, short) *The Reluctant Dragon (1941, a staged \"mockumentary\") *Frank and Ollie (1995) *Dream On Silly Dreamer (2005) *Waking Sleeping Beauty (2010) == Related pages == * The Walt Disney Company * Disney's Nine Old Men * Pixar * Blue Sky Studios * 20th Century Animation * Disney Television Animation == References == ;Notes Category:American animation studios Category:American entertainment companies Category:Companies based in Burbank, California Category:Disney companies Category:1923 establishments in California",
 "title": "Walt Disney Animation Studios"
}