{
 "id": "361274",
 "text": "Blue Sky Studios was an American CGI-animation studio. It is owned by Pixar locating in Greenwich, Connecticut. In addition to their feature-length animated movies, Blue Sky has worked on many high-profile movies, primarily in combining live-action with computer-generated animation. ==Filmography== ===Feature films=== Released films No. Title Release date Budget Gross RT Notes 1 Ice Age $59,000,000 $383,257,136 77% First Blue Sky 2002 Logo 2 Robots $75,000,000 $260,718,330 64% First Blue Sky in IMAX. 3 Ice Age 2: The Meltdown $80,000,000 $655,388,158 57% 4 Dr. Seuss's Horton Hears A Who! $85,000,000 $297,138,014 79% 5 Ice Age 3: Dawn Of The Dinosaurs $90,000,000 $886,686,817 46% First Blue Sky in 3D. 6 Rio $90,000,000 $484,635,760 72% Second Blue Sky in 3D. First Blue Sky’s Musical. 7 Ice Age 4: Continental Drift $95,000,000 $828,736,444 38% Third Blue Sky in 3D. 8 Epic $93,000,000 $268,426,634 65% Fourth Blue Sky in 3D. 9 Rio 2 $103,000,000 $100,346,459 46% Fifth Blue Sky in 3D. Latest Blue Sky’s Musical. 10 The Peanuts Movie $99,000,000 $246,000,000 87% Sixth Blue Sky in 3D. 11 Ice Age 5: Collision Course $105,000,000 $408,000,000 18% Seventh Blue Sky in 3D. Latest Blue Sky in IMAX. 12 Ferdinand $111,000,000 $296,000,000 72% Eighth Blue Sky in 3D. 13 Spies In Disguise $100,000,000 $171,000,000 76% Latest Blue Sky in 3D. 14 Ice Age 6: Adventures Of Buck Wild: The Ice Age 6: Adventures Of Buck Wild January 28, 2022 15 Nimona June 30, 2023 16 Ice Age 7: The Extinction Event Random Random ? First Spotlight Animtion Studios in 3D 17 Rio 3 April 9, 2027 ===Television specials and series=== *Ice Age: A Mammoth Christmas (2011) *Ice Age: The Great Egg- Scapede (2016) *Ice Age: Scrat Tales (2022; TV Series) Short films # Bunny (1998) # Gone Nutty (2002) # Aunt Fanny's Tour of Booty (2005) # No Time for Nuts (2006) # Surviving Sid (2008) # Scrat's Continental Crack-Up (2010) # Scrat's Continental Crack-Up: Part 2 (2011) # Umbrellacorn (2013) # Cosmic Scrat-tastrophe (2015) # Scrat: Spaced Out (2016) == Associated productions == No. Title Release date Produced by 14 Ice Age 6: Adventures Of Buck Wild: The Ice Age 6: Adventures Of Buck Wild January 28, 2022 Walt Disney Pictures, 20th Century Studios, Blue Sky Studios 15 Nimona June 30, 2023 Netflix, 20th Century Studios, Blue Sky Studios 16 Ice Age 7: The Extinction Event December 18, 2026 20th Century Studios, Blue Sky Studios 17 Rio 3 April 9, 2027 20th Century Studios, Blue Sky Studios 18 Ice Age 8: Adventures Of The Soto September 7, 2029 20th Century Studios, Blue Sky Studios 19 Rio 4 April 11, 2031 20th Century Fox Studios, Blue Sky Studios 20 Ice Age 9: A New Day July 9, 2032 20th Century Fox Studios, Blue Sky Studios 21 Foster June 10, 2033 20th Century Fox Studios, Blue Sky Studios 22 Epic II April 7, 2034 20th Century Fox Studios, Blue Sky Studios 23 Robots 2 March 9, 2035 20th Century Fox Studios, Blue Sky Studios 24 Ice Age 10: The Multiverse Of Glaciers July 18, 2036 20th Century Fox Studios, Blue Sky Studios 25 Nimona 2 January 16, 2037 20th Century Fox Studios, Blue Sky Studios 26 The Peanuts Movie 2 December 21, 2039 20th Century Fox Studios, Blue Sky Studios 27 Ice Age 11: Evacuated World November 8, 2042 20th Century Fox Studios, Blue Sky Studios 28 Spies In Disguise II December 25, 2043 20th Century Fox Studios, Blue Sky Studios 29 Ice Age 12: The Wrath Of Captain Nak October 12, 2046 20th Century Fox Studios, Blue Sky Studios 30 Rio 5 April 14, 2047 20th Century Fox Studios, Blue Sky Studios 31 Ice Age 13: The Return Of Polo July 7, 2049 20th Century Fox Studios, Blue Sky Studios 32 Rio 6 April 7, 2051 20th Century Fox Studios, Blue Sky Studios 33 Ice Age 14: The Revenge Of The Red July 12, 2052 20th Century Fox Studios, Blue Sky Studios 34 May 23, 2053 20th Century Fox Studios, Blue Sky Studios 35 Robots 3 April 10, 2054 20th Century Fox Studios, Blue Sky Studios 36 Nimona 3 November 5, 2055 20th Century Fox Studios, Blue Sky Studios 37 Ice Age 15: Sub-Zero Heroes Unite! July 21, 2056 20th Century Fox Studios, Blue Sky Studios 38 December 14, 2057 20th Century Fox Studios, Blue Sky Studios 39 December 24, 2059 20th Century Fox Studios, Blue Sky Studios ==Franchises== Title Years Films Shorts Ice Age 2002–present 7 7 2005–present Rio 2011–present 3 0 2013–present 2015–present 2017–present 2019–present 2023–present ==2019–2021: Disney acquisition and closure== Ownership of Blue Sky Studios was assumed by The Walt Disney Company as part of their 2019 acquisition of 21st Century Fox, which concluded on March 20, 2019. On March 21, Disney announced that Blue Sky Studios and its parent company 20th Century Fox Animation (now 20th Century Animation) would be integrated as units within the Walt Disney Studios with co-presidents Andrea Miloro and Robert Baird continuing to lead the studio, while reporting to Walt Disney Studios chairman Alan Horn. In July 2019, Miloro announced that she would be stepping down from her role as co-president, thus leaving Baird as sole president. In August 2019, former Walt Disney Animation Studios head Andrew Millstein was named as co-president of Blue Sky Studios alongside Baird, while Pixar Animation Studios president Jim Morris would also be taking a supervising role. On February 9, 2021, Disney announced that it was closing Blue Sky Studios in April 2021. The company explained that in light of the ongoing COVID-19 pandemic's continued economic impact on all of its businesses, it was no longer sustainable for them to run a third feature animation studio. In addition, production on a film adaptation of the webcomic Nimona, originally scheduled to be released on January 14, 2022, was cancelled as a result of its closure. The studio's film library and intellectual properties are retained by Disney. Although Disney did not give an exact date as to when the studio would be closing down initially, former animator Rick Fournier confirmed on April 10 it was their last day of operation, three days after co-founder Chris Wedge released a farewell letter on social media. Blue Sky Studios' website redirects to Disney.com. ==References== Category:American animation studios Category:Greenwich, Connecticut Category:Companies based in Connecticut Category:1987 establishments in the United States Category:Disney companies Category:21st Century Fox Category:2021 disestablishments in the United States",
 "title": "Blue Sky Studios"
}