{
 "id": "361484",
 "text": "A photographic memory, or eidetic memory,The word eidetic comes from the Greek word εἶδος eidos, \"seen\". is the ability to remember images or objects in great detail after seeing them for only a short time. The existence of this ability is disputed. The claims made differ somewhat, but stress the recall of visual information. Examples of the information include: pages from books, magazines, and license plate numbers. It is claimed that those with a photographic memory tend to have higher IQs than those without it.\"Eidetic image\", Encyclopaedia BritannicaHaber R.N. 1979. Twenty years of haunting eidetic imagery: where's the ghost? Behavioral and Brain Sciences. 2 (4) 583- 594. A common misconception with photographic memory is that those with it do not use mnemonics. This is actually not the case, sometimes, those with photographic memory still use mnemonics as a form of quick and accurate remembering of things, instead of having to pull it up in their memory over and over again. It's like defining a function in a code instead of having to write it out over and over again. This way, remembering is more efficient and easier to make connections with the given information, but some people with it might not use them if they have a \"stronger\" form of photographic memory or different learning style/goal with the given information. The ability is said to occur in the early childhood of a small number of children (between 2 percent and 10 percent) and generally is not found in adults. == Skeptics == Some do not believe this skill exists. The American cognitive scientist Marvin Minsky, in his book The Society of Mind (1988), thought that reports of photographic memory were an “unfounded myth”. Adriaan de Groot studied the ability of chess grandmasters to memorize the positions of chess pieces on a chess board.de Groot A. 1946. Het denken van den schaker. Amsterdam: Noord- Hollandsche Uitgevers Maatschappij; and 1965. Thought and choice in chess. The Hague: Mouton. At first, people thought they had photographic memory because they could memorize far more information than nonexperts. However, when shown arrangements of pieces that could never occur in a game, their recall was no better than nonexperts. This suggests that they only have an ability to remember certain types of information, rather than photographic memory. Around 1970, Charles Stromeyer studied his future wife, Elizabeth. He claimed that she could recall poetry written in a foreign language which she did not understand. She could remember the poetry years after she had first seen the poem. She also could, apparently, recall random dot patterns so as to combine two patterns into a stereoscopic image.Thomas N.J.T. 2010. Other quasi- perceptual phenomena. In The Stanford Encyclopedia of Philosophy. She is the only person who is known to have passed such a test. The methods used in the testing procedures were not clear.Blakemore C; Braddick O. & Gregory R.L. 1970. Detailed texture of eidetic images: a discussion. Nature. 226, 1267–1268. Additionally, the tests have never been repeated (Elizabeth has consistently refused to repeat them).Foer, Joshua 2006. Kaavya Syndrome: The accused Harvard plagiarist doesn't have a photographic memory. No one does. Slate. This raised further concerns, and increased skepticism about whether photographic memories were real. All in all, the existence of this ability or possessing of it by someone purely depends on the context, and because the learning style is so difficult to comprehend, its existence is questioned. With that being said, there are different \"types\" of photographic memory in different people, but all of them follow the same pattern, so all the types are generally categorized as one. It is also possible to naturally possess an exceptional memory, but mistake it for photographic memory. == References == Category:Memory Category:Experiments",
 "title": "Photographic memory"
}