{
 "id": "361564",
 "text": "The , also known as the , are a chain of Japanese islands in a line between Kyushu and Taiwan.Nussbaum, Louis-Frédéric. (2005). \"Ryūkyū Islands\" in Japan Encyclopedia, p. 801. == History == In the islands, the dates from the middle 14th century.Klaproth, Julius. (1832). San kokf tsou ran to sets, ou Aperçu général des trois royaumes, p. 175 n1. It entered into a tributary relationship with Imperial China.Kerr, George. (2000). Okinawa: The History of an Island People, p. 63. In the early 17th century, the kingdom entered into a tributary relationship with Japan after the Satsuma Domain invaded.Klaproth, pp. 177.Smits, Gregory. (1999). Visions of Ryūkyū: Identity and Ideology in Early-Modern Thought and Politics, p. 28. In 1765, the islands were described by Hayashi Shihei in Sangoku Tsūran Zusetsu.Klaproth, pp. 169-180. === Timeline === * 1314: Kingdoms of Nanzan, Chūzan, and Hokuzan are founded * 1429: Ryūkyū Kingdom is founded * 1609: Ryūkyū Kingdom is invaded by the Satsuma Domain, causing its vassal status to Japan and its loss of the Amami Islands * 1872: creation of the Ryūkyū Domain, 1872-1879Matsumura, Wendy. (2007). Becoming Okinawan: Japanese Capitalism and Changing Representations of Okinawa, p. 38; excerpt, \"March 27, 1879 marks the birth of Okinawa Prefecture and the death of the short-lived Ryukyu domain, which itself came into being on September 14, 1872, replacing the Ryukyu kingdom.\" * 1879: creation of Okinawa Prefecture * 1945: Battle of Okinawa * 1972: United States gives the Ryūkyū Islands back to Japan == Geography == The islands are at the eastern edge of the East China Sea and the western edge of the Pacific Ocean. The Islands are separated into two geographical regions: the Northern Ryūkyū Islands, centered on Amami Island, and the Southern Ryūkyū Islands, centered on Okinawa Island. Sometimes the Southern Ryūkyū Islands are further divided into the Okinawa Islands and the Sakishima Islands. The largest of the islands is Okinawa Island.Nussbaum, \"Okinawa-ken\" at pp. 746-747. == Culture == Karate was invented by the local people (mainly from Okinawa). The Japanese phrase \"Karate-do\" means \"way of the empty hand\"). The Ryukyuan languages have become rare. == Related pages == * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan * Ryukyuan languages ==References== Category:Archipelagos Category:Regions of Japan",
 "title": "Ryūkyū Islands"
}