{
 "id": "36181",
 "text": "Condom (), also called Condom-en-Armagnac or Condom-sur-Baïse, is a commune in southwestern France in the department of Gers, Occitanie region, of which it is a subprefecture. ==Name of the city== The name Condom comes from the Gaulish (an ancient Celtic language spoken in parts of Europe) words condate- ó-magos which means \"market of the confluence\". Condatómagos later became Condatóm and then Conddóm. The spelling Condom first came from Latin in the 10th century as or . The name of the town has nothing to do with the condom, which in French is called . There used to be a museum of condoms in Condom, but it closed in 2005. ==History== After the colonization of the area by the Romans, the Abbey of Saint Pierre was built in 1011. During the Hundred Years' War, the city was taken twice by the English. The Saint Pierre Cathedral was begun in 1507. ===Way of St. James=== Condom is a town on the Via Podiensis (the Le Puy Route), one of the three major French pilgrimage routes of the Way of St. James. This particular route begins in Le Puy and ends in Santiago de Compostela in northwest Spain. Pilgrims came to Condom from Miradoux and continue on to Larressingle. ==Geography== Condom is a commune found along the Baïse river, between Armagnac and Agenais. Condom is the main town of the Condomès or Ténarèze region. The commune has an area of and its average altitude is ; at the city hall, the altitude is . Condom and its neighboring communes Condom is surrounded by the communes: * Gers department: Gazaupouy, Castelnau-sur-l'Auvignon, Caussens, Béraut, Maignaut-Tauzia, Cassaigne, Larressingle and Larroque-sur-l'Osse, * Lot-et-Garonne department: Lannes et Moncrabeau. ===Climate=== The climate of Condom, in the Köppen climate classification, is Cfb - Oceanic climate with template summers. ==Population== The inhabitants of Condom are known, in French, as Condomois (women: Condomoises). With a population of 6,835 (2014), Condom has a population density of inhabitants/km2. Evolution of the population in Condom Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:8000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:2000 start:0 ScaleMinor = gridcolor:lightgrey increment:1000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 7326 bar:1975 from:0 till: 7853 bar:1982 from:0 till: 7634 bar:1990 from:0 till: 7717 bar:1999 from:0 till: 7251 bar:2006 from:0 till: 7158 bar:2014 from:0 till: 6835 PlotData= bar:1968 at: 7326 fontsize:S text: 7,326 shift:(-12,5) bar:1975 at: 7853 fontsize:S text: 7,853 shift:(-15,5) bar:1982 at: 7634 fontsize:S text: 7,634 shift:(-15,5) bar:1990 at: 7717 fontsize:S text: 7,717 shift:(-15,5) bar:1999 at: 7251 fontsize:S text: 7,251 shift:(-15,5) bar:2006 at: 7158 fontsize:S text: 7,158 shift:(-15,5) bar:2014 at: 6835 fontsize:S text: 6,835 shift:(-15,5) ==Economy== The commune of Condom depends mainly of the agriculture, the tourism and the trade. Important agricultural products are Armagnac (an alcoholic beverage like a brandy), Floc de Gascogne (a regional apéritif) and foie gras. ==Places of interest== Some of places of interest are: * Cathédrale Saint-Pierre de Condom (Saint Peter's Cathedral) * The cloister of the Cathedral. * Saint-Jacques church * Musée de l'Armagnac, a museum of the Armagnac drink. ==Gallery== File:Gers Condom Cathedral of Saint-Pierre outside 01.jpg|Cathedral of Saint Pierre in Condom File:Cloître de Condom.jpg|Cloister of the cathedral, Condom File:Condom Gers le port.jpg|Port of Condom on the Baïse river File:Condom.jpg|Cathedral of Saint Pierre in Condom ==Sister cities== Condom is twinned with: * Grünberg, Hesse, Germany * Toro, Castile and León, Spain ==Related pages== * Arrondissement of Condom * Communes of the Gers department ==References== ==Other websites== * City Council website * Office de Tourisme - Condom/La Ténarèze Category:Subprefectures in France Category:Communes in Gers",
 "title": "Condom, Gers"
}