{
 "id": "361818",
 "text": "James Gillespie Blaine (January 31, 1830 – January 27, 1893) was an American Republican politician. He was a United States Representative. He was the Speaker of the United States House of Representatives. He was a U.S. Senator from Maine. He was the Secretary of State twice. He was also nominated to be President. ==Early life== Blaine was born on January 31, 1830 in West Brownsville, Pennsylvania. He was the third child of Ephraim Lyon Blaine and his wife Maria Gillespie Blaine. He was educated at Washington College and later met his wife Harriet Stanwood. They married in 1850 and they had seven children. ==Career== Blaine was a Republican. He was Speaker of the House of Representatives from 1869 until 1875. He was chosen by the 18th United States President Ulysses S. Grant. Blaine would later served as the Senator from Maine from 1876 through 1881. Secondly he served as the Member of the U.S. House of Representatives from Maine's 3rd district from 1863 until 1876. Then as the 28th and 31st United States Secretary of State from 1881 through 1881 and then again in 1889 through 1892. On July 2, 1881, Blaine and President James A. Garfield were walking in the Baltimore and Potomac Railroad station in Washington, D.C. when Charles J. Guiteau shot Garfield in the back. Blaine resigned as Secretary of State several months later. The Republicans nominated Blaine for President in 1884 but Grover Cleveland won the election. ==Death== Blaine died just 4 days short from his 63rd birthday on January 27, 1893 in his Washington, D.C. home from a heart attack, aged 62. He was later buried at Oak Hill Cemetery in Washington, D.C. and was later re-buried in Blaine Memorial Park, Augusta, Maine, in 1920. Blaine was hypochondriac.James Gillespie Blaine at Encyclopedia.com ==References== ==Other websites== * \"James G. Blaine, Presidential Contender\" from C-SPAN's The Contenders * * * * * Category:1830 births Category:1893 deaths Category:American Calvinists Category:Congregationalists Category:Deaths from myocardial infarction Category:Politicians from Pennsylvania Category:Speakers of the United States House of Representatives Category:United States representatives from Maine Category:United States Secretaries of State Category:United States senators from Maine Category:Republican Party (United States) politicians Category:19th-century American politicians",
 "title": "James G. Blaine"
}