{
 "id": "362061",
 "text": "Vincent Edward \"Vin\" Scully (November 29, 1927 - August 2, 2022) was a broadcaster with the Los Angeles Dodgers.Sandomir, Richard. \"Daffy Days of Brooklyn Return for Vin Scully\" His 67 seasons with the Dodgers (1950 – 2016) were the longest of any broadcaster with a single team in professional sports history. At the age of 25, Scully became the youngest man to broadcast a World Series game. He broadcast the 1953 World Series. ==Early life== Scully was born in New York City. He studied at Fordham University. He began his career in 1949. In 1957, he married Joan Crawford. She died in 1972 from an accidental overdose. In late 1973, he married Sandra Hunt. Hunt already had two children from another marriage. Scully and Hunt had two children together. ==Career== From 1975 to 1982, Scully announced the televised National Football League games for CBS Sports. Scully also added to the network's tennis and PGA Tour golf coverage in the late 1970s and early 1980s. He was NBC television's lead baseball broadcaster from 1983 to 1989. The first biography of Scully's life, Pull Up a Chair: The Vin Scully Story, written by Curt Smith, was published in 2009. In 2012, Scully was announcing Dodgers' home games as well as road games in California, Arizona, and Colorado. In September 2016, Scully retired from his broadcasting career. ==Later life== In 2016, Scully was honored with the Presidential Medal of Freedom by President Barack Obama at the White House.Scully receives Presidential Medal of Freedom In 2017, Scully did not approve of football players kneeling before the national anthem and said he would never watch an NFL game again. On August 2, 2022, Scully died at his home in Hidden Hills, California. He was 94 years old. ==Awards and honors== Scully received the Ford Frick Award from the National Baseball Hall of Fame in 1982. He was honored with a Life Achievement Emmy Award for sportscasting and induction into the National Radio Hall of Fame in 1995. The National Sportscasters and Sportswriters Association named Scully as National Sportscaster of the Year three times (1965, 1978, 1982) and California Sportscaster of the Year 29 times. He was inducted into its Hall of Fame in 1991. He was the 1992 Hall of Fame inductee of the American Sportscasters Association (ASA), and was named both Sportscaster of the Century by the ASA (2000) and top sportscaster of all-time on its Top 50 list (2009).\"Chris Schenkel named 25th greatest sportscaster of all-time.\" Article at www.pba.com, January 15, 2009. Scully was inducted into the NAB Broadcasting Hall of Fame in 2009. Scully has a star on the Hollywood Walk of Fame at 6675 Hollywood Blvd. Since 2001, the press box at Dodger Stadium has been named for Scully. A street near the team's former Dodgertown spring training facility in Vero Beach, Florida is named \"Vin Scully Way\". ==Memorable calls== Scully was at some of Baseball’s most famous moments. He made the calls that have since become part of the game's lore: *The 1955 World Series, the Brooklyn Dodgers’ only World Series Championship *Don Larsen's perfect game in the 1956 World Series between the New York Yankees and Brooklyn Dodgers on October 8, 1956 *Sandy Koufax’s perfect game on September 9, 1965 *Hank Aaron’s 715th home run on April 8, 1974 *Rick Monday's rescue of the American flag from a pair of protesters attempting to burn it on April 25, 1976 *Bill Buckner’s muffed ground ball in the 1986 World Series between the New York Mets and Boston Red Sox on October 25, 1986 *Cincinnati Red Tom Browning's perfect game against the Dodgers on September 16, 1988 *Kirk Gibson’s dramatic home run in Game 1 of the World Series between the Dodgers and the Oakland Athletics on October 15, 1988 *Fernando Valenzuela's no-hitter on June 29, 1990 *Montreal Expo Dennis Martínez's perfect game against the Dodgers on June 28, 1991 *The Dodgers' four consecutive home runs against the San Diego Padres on September 18, 2006 ==References== ==Other websites== * Vin Scully Dodgers Bio * Vin Scully Ford C. Frick Award biography at the National Baseball Hall of Fame * Salon.com tribute * DailyBulletin.com – Q&A; with Vin Scully * Fang's Bites: Videos of the Week – Best Baseball Announcers: Vin Scully * Vin Scully Quotes Category:1927 births Category:2022 deaths Category:National Football League broadcasters Category:American Roman Catholics Category:College basketball broadcasters Category:College football broadcasters Category:Major League Baseball broadcasters Category:Emmy Award winners Category:National Radio Hall of Fame inductees Category:People from the Bronx",
 "title": "Vin Scully"
}