{
 "id": "362098",
 "text": "William Richard Werstine (better known as Billy West)1970 Roslindale High School Year Book (born April 16, 1952) is an American voice actor, musician, singer and songwriter. He is known for his voice roles as Professor Hubert Farnsworth, and Dr. John Zoidberg in Futurama and D in Alphablocks. He was born in Detroit, Michigan and raised in Boston, Massachusetts. West is divorced from his wife Violet Werstine (known as Violet West). ==Selected filmography== ===Film and television=== Year Title Role Notes 1988 The New Adventures of Beany and Cecil Cecil Voice role Animated series 1991–1994 Doug Doug Funnie (1991–1994) Porkchop Roger Klotz (1991–1994) Voice role Animated series 1991–1996 The Ren & Stimpy Show Stimpson J. \"Stimpy\" Cat Ren Höek (1993–1996) Mr. Horse (1993–1996) Voice role Animated series 1994 The Shnookums and Meat Funny Cartoon Show France Bug Voice role Animated series 1996 Earthworm Jim Additional voices Voice role Animated series 1996–2003 Dexter's Laboratory Additional voices Voice role Animated series 1996 Joe's Apartment Ralph Roach Voice role Live action film 1996 Space Jam Bugs Bunny Elmer Fudd Voice role Live action/animated film 1997 The Wacky World of Tex Avery Tex Avery Freddie the Fly Sagebrush Sid Voice role Animated series 1997 Cow and Chicken Additional voices Voice role Animated series 1997–2000 I Am Weasel Additional voices Voice role Animated series 1997 Project G.e.e.K.e.R. GeeKeR Voice role Animated series 1997 The Weird Al Show Show announcer Harvey the Wonder Hamster Voice role Television series 1997 Extreme Ghostbusters Slimer Mayor McShane Voice role Animated series 1997 Space Goofs Additional voices Voice role Animated series 1997 King of the Hill Mr. Holloway Voice role Animated series Episode: \"The Company Man\" 1998 Scooby-Doo on Zombie Island Norville \"Shaggy\" Rogers Voice role Direct-to-video Animated film 1998–1999 Mad Jack the Pirate Snuk Jon LeFeet additional voices Voice role Animated series 1998–1999 The Secret Files of the Spy Dogs Voice role Animated series 1998–2000 Histeria! Chit Chatterson Bugs Bunny Elmer Fudd Additional characters Voice role Animated series 1998–2000 Voltron: The Third Dimension Pidge Voice role Animated show 1998–2005 The Powerpuff Girls Additional characters Voice role Animated series 1998–2005 CatDog Rancid Rabbit Mr Sunshine Randolph Grant Voice role Animated series 1999 Queer Duck Bi-Polar Bear Other characters Voice role Animated series 1999 Detention Emmitt Roswell Additional characters Voice role Animated series 1999 Olive, the Other Reindeer Mr. Eskimo Voice role Animated television film 1999 Rayman: The Animated Series Rayman Voice role Animated series 1999 Dilbert Marketing Guy Additional voices Voice role Animated series 1999–2002 The New Woody Woodpecker Show Woody Woodpecker Wally Walrus Smedley Doug Knutts Additional characters Voice role Animated series 1999–2013 Futurama Philip J. Fry Professor Farnsworth Dr. Zoidberg Zapp Brannigan Richard Nixon Additional characters Voice role Animated series 2000 Baby Felix Felix the Cat Additional characters Voice role Animated series 2000 Poochini's Yard Poochini Walter White Mr. Garvey Lockjaw Additional characters Voice role Animated series 2001 Horrible Histories Stitch Narrator various Voice role Animated series 2001 The Oblongs George Klimer Anita Bidet Additional characters Voice role Animated series 2001 Totally Spies! Lester Crawley Voice role Animated series 2001 Jimmy Neutron: Boy Genius Various characters Voice role Animated film 2001 Tom and Jerry: The Magic Ring Freddie Voice role Direct-to-video Animated film 2002 Jackie Chan Adventures Monkey King Voice role Animated series Episode: \"Monkey a Go-Go\" 2002 Crank Yankers Confucious Moo Shu Voice role 2002 Ozzy & Drix Muscle Cell Voice role Animated series Episode: \"Reflex\" 2002–2007 The Adventures of Jimmy Neutron: Boy Genius Sam Additional voices Voice role Animated series 2003 Looney Tunes: Back in Action Elmer Fudd Peter Lorre Voice role Live action/animated film 2003 Duck Dodgers Mother Fudd Voice role Animated series 2003–2009 My Life as a Teenage Robot Principal Razinski Additional characters Voice role Animated series 2004 Justice League Unlimited Skeets Voice role Animated series Episode: \"The Greatest Story Never Told\" 2004 Comic Book: The Movie Leo Matuzik Live action role Direct-to-video 2004 Garfield: The Movie Dog Voice role 2004 Popeye's Voyage: The Quest for Pappy Popeye Pappy Voice role Direct-to-video Computer-animated film 2004, 2006 Codename: Kids Next Door Numbuh 13 Voice role Animated series Episode: \"Operation M.A.C.A.R.R.O.N.I.\" Episode: \"Operation I.T.\" 2004–2006 Hi Hi Puffy AmiYumi Additional characters Voice role Animated series 2004–2009 Foster's Home for Imaginary Friends Additional characters Voice role Animated series 2005 Tom and Jerry: Blast Off to Mars Major Biff Buzzard King Thingg Gardener#2 Voice role Direct-to-video Animated film 2005 Board Member Cab Driver Voice role Animated television film 2005 Tom and Jerry: The Fast and the Furry Biff Buzzard President of Hollywood Squirty Voice role Direct-to-video Animated film 2005 Camp Lazlo Additional characters Voice role Animated series 2005 The Buzz on Maggie Additional characters Voice role Animated series 2005 The Life and Times of Juniper Lee Additional characters Voice role Animated series 2005–2007 Loonatics Unleashed Electro J. Fudd Sagittarius Stomper Voice role Animated series 2006 Curious George Manager Voice role Animated film 2006–2007 Drawn Together Stimpy Popeye Mall Security Guard Denzel Washington The Lion in The Puddle Voice role Animated series 2006 Queer Duck: The Movie Bi-Polar Bear Voice role Direct-to-video Animated film 2006 Zombie College Skully Graham Voice role Web series 2006 Bah, Humduck! A Looney Tunes Christmas Bugs Bunny Elmer Fudd Voice role Direct-to-video Animated film 2006–2007 Squirrel Boy Kyle Finster Voice role Animated series 2007 Chowder Additional characters Voice role Animated series 2007 El Tigre: The Adventures of Manny Rivera Additional characters Voice role Animated series 2007 TMNT Anchorman Jersey Devil Various characters Voice role Animated film 2007 Futurama: Bender's Big Score Philip J. Fry Professor Farnsworth Dr. Zoidberg Zapp Brannigan Richard Nixon Additional characters Voice role Direct-to-video Animated film 2007–2009 Rick & Steve: The Happiest Gay Couple in All the World Dr. Hunk Anderson Pooper George W. Bush Franz Nerdlinger Log Cabin Tom Various characters Voice role Animated series 2008 The Marvelous Misadventures of Flapjack Additional characters Voice role Animated series 2008 The Mighty B! Additional characters Voice role Animated series 2008 Random! Cartoons Finster #1 Pilot #1 Johnny Space Guy Space Thug Moobeard Voice role Animated series 2008 Futurama: The Beast with a Billion Backs Philip J. Fry Professor Farnsworth Dr. Zoidberg Zapp Brannigan Richard Nixon Additional characters Voice role Direct-to-video Animated film 2008 Futurama: Bender's Game Philip J. Fry Professor Farnsworth Dr. Zoidberg Additional characters Voice role Direct-to-video Animated film 2009 Futurama: Into the Wild Green Yonder Philip J. Fry Professor Farnsworth Dr. Zoidberg Zapp Brannigan Leo Wong Richard Nixon Additional characters Voice role Direct-to-video Animated film 2009–2012 Jungle Junction Ellyvan Voice role Animated series 2010 Tom and Jerry Meet Sherlock Holmes Tom Direct-to-video Animated film 2010 Kick Buttowski: Suburban Daredevil Additional characters Voice role Animated series 2010 T.U.F.F. Puppy Additional characters Voice role Animated series 2010 Scooby-Doo! Mystery Incorporated Gunther Gator Voice role Animated series 2010 Glenn Martin, DDS Mr. Vernon Voice role Animated series Episode: \"Camp\" 2011 Mongo Wrestling Alliance Various Voice role Animated series 2011 Eric Kaplan's Sketch World Additional voices Voice role Web series 2011 Tom and Jerry and the Wizard of Oz Tom (uncredited) Voice role Direct-to-video Animated film 2011–2014 The Looney Tunes Show Elmer Fudd Voice role Animated series 2012 The High Fructose Adventures of Annoying Orange Cranberry Voice role Animated series 2013 Ultimate Spider-Man Rocket Raccoon Voice role Animated series 2013 I Know That Voice Himself Documentary 2014 The Simpsons Philip J. Fry Professor Farnsworth Dr. Zoidberg Voice role Animated series Episode: \"Simpsorama\" 2014 Mixels Lunk, Gobba, Balk Voice role Animated series 2014 Adventure Time Goose, Dr. Erik Adamkinson, Mayor Voice role Animated series Episode: \"Everything's Jake\" 2014 Turbo FAST Fleagor, Mosquito, Adolfo, Waterbug Voice role Animated series 2014 TripTank Sextus Scribonus Voice role Animated series Episode: \"Ahhh, Serenity\" 2014–present The 7D Bashful Voice role Animated series 2015 The SpongeBob Movie: Sponge Out of Water Seagull Voice role Animated film 2015 Pixels Additional video game characters Voice role Live-action film 2018 Return of Ed Edd n Eddy (2018/2020 TV Series) Eddy Voice role Animated series 2022–present Regular Show “Adult Party Cartoon” Muscle Man, Low Five Ghost Voice role Animated series ==References== ==Other websites== * * Category:1952 births Category:Living people Category:Actors from Boston Category:Actors from Detroit Category:American guitarists Category:American movie actors Category:American singer-songwriters Category:American television actors Category:American video game actors Category:American voice actors Category:Comedians from Detroit Category:People on the autism spectrum",
 "title": "Billy West"
}