{
 "id": "362188",
 "text": "Christopher Robert \"Chris\" Evans (born June 13, 1981) is an American television, voice, and movie actor. He is known for his roles as Johnny Storm/Human Torch in Fantastic Four and Fantastic Four: Rise of the Silver Surfer and as Captain America in the Marvel Cinematic Universe (2011-2019). Evans was born in Sudbury, Massachusetts on June 13, 1980. On September 9, 2023, Evans married actress Alba Baptista. ==Filmography== ===Movies=== Year Title Role Note 2000 The Newcomers Judd 2001 Not Another Teen Movie Jake Wyler 2003 Ben Harris Short movie 2004 The Perfect Score Kyle Curtis 2004 Cellular Ryan Hewitt 2005 Fierce People Bryce Langley 2005 Fantastic Four Johnny Storm / Human Torch 2005 London Syd 2007 TMNT Casey Jones Voice only 2007 Sunshine Robert Mace 2007 Fantastic Four: Rise of the Silver Surfer Johnny Storm / Human Torch 2007 The Nanny Diaries Hayden \"Harvard Hottie\" 2007 Battle for Terra Stewart Stanton Voice only 2008 Street Kings Detective Paul Diskant 2009 Push Nick Gant 2009 The Loss of a Teardrop Diamond Jimmy Dobyne 2010 The Losers Jake Jensen 2010 Scott Pilgrim vs. the World Lucas Lee 2011 Puncture Michael David \"Mike\" Weiss 2011 Captain America: The First Avenger Steve Rogers / Captain America 2011 What's Your Number? Colin Shea 2012 The Avengers Steve Rogers / Captain America 2013 The Iceman Robert \"Mr. Freezy\" Pronge 2013 Snowpiercer Curtis Everett 2013 Thor: The Dark World Steve Rogers / Captain America Uncredited cameo 2014 Captain America: The Winter Soldier Steve Rogers / Captain America 2014 Playing It Cool Narrator 2014 Before We Go Nick Vaughan Director and producer; completed 2015 Avengers: Age of Ultron Steve Rogers / Captain America Post-production 2018 Avengers: Infinity War Steve Rogers ===Television=== Year Title Role Notes 2000 Opposite Sex Cary Baston Lead Role 2000 The Fugitive Zack Lardner Episode: \"Guilt\" 2001 Boston Public Neil Mavromates Episode: \"Chapter Nine\" 2002 Eastwick Adam TV pilot 2003 Skin Brian Episode: \"Pilot\" 2008 Robot Chicken Various voices Episode: \"Monstourage\" 2009 Attack of the Show! Himself Episode: \"1.906\" 2015 Marvel's Agent Carter Steve Rogers / Captain America via archival footage from Captain America: The First Avenger ===Video Games=== Year Title Role Notes 2005 Fantastic Four Johnny Storm / The Human Torch Voice only 2011 Captain America: Super Soldier Steve Rogers / Captain America Voice only ==References== ==Other websites== * Category:1980 births Category:Living people Category:Actors from Massachusetts Category:American LGBT rights activists Category:American movie actors Category:American television actors Category:American video game actors Category:American voice actors",
 "title": "Chris Evans"
}