{
 "id": "362249",
 "text": "The Great Oxygenation Event (GOE)also called the Oxygen Catastrophe, Oxygen Crisis, or Oxygen Revolution. was the creation of free oxygen in our atmosphere. It was caused by cyanobacteria doing photosynthesis. It took a very long time, from three billion years ago to about one billion years ago. Zimmer, Carl (3 October 2013). Earth's oxygen: a mystery easy to take for granted. New York Times. Retrieved 3 October 2013. Photosynthesis was making oxygen both before and after the GOE. Before the GOE, organic matter and dissolved iron chemically captured any free oxygen. Earth has much iron, and iron has higher solubility than its oxides, so the oceans had much dissolved iron. It became iron oxide and made huge deposits of banded iron rock from the Archaean and Proterozoic eras. When not enough iron remained to capture more oxygen, free oxygen accumulated in the atmosphere. This was the GOE.Canfield, Donald 2014. Oxygen: a four billion year history. Princeton: Princeton University Press. ISBN 978-0-691-14502-0 Oxygen was toxic to most of the Earth's anaerobic inhabitants at the time. As cyanobacteria produced oxygen, and built their stromatolites, they changed the environment for other protists. Since the other protists had no way to deal with oxygen, most became extinct. Another consequence was the effect of free oxygen on atmospheric methane, a greenhouse gas. Their reaction removed the methane, and caused the Huronian glaciation. This was perhaps the longest snowball Earth episode ever. Free oxygen has been an important part of the atmosphere ever since.Frei R. et al 2009. Fluctuations in Precambrian atmospheric oxygenation recorded by chromium isotopes. Nature 461 (7261): 250–253.Lyons, Timothy W. & Reinhard, Christopher T. 2009. Early Earth: Oxygen for heavy-metal fans. Nature 461, 179181. == Timing == The evidence is that free oxygen was first produced by photosynthetic organisms (prokaryotic, later eukaryotic) which emitted oxygen as a waste product. These organisms lived long before the GOE,Dutkiewicz A. et al 2006. Biomarkers from Huronian oil-bearing fluid inclusions: an uncontaminated record of life before the Great Oxidation Event. Geology 34 (6): 437. perhaps 3500 million years ago (mya). The oxygen they made would have quickly been removed from the atmosphere by the 'mass rusting' which led to the deposition of banded-iron formations. Oxygen only began to continue in the atmosphere in small quantities shortly (~50 million years) before the start of the GOE.Anbar A. et al 2007. A whiff of oxygen before the great oxidation event?. Science 317 (5846): 1903–1906. Without a draw-down, oxygen would come to the atmosphere and stay there very quickly. At today's rates of photosynthesis (which are much greater than those in the land-plant-free Precambrian), modern atmospheric O2 levels could be produced in around 2,000 years.Dole M. 1965. The natural history of oxygen. The Journal of General Physiology 49 (1): 5.Kump, Lee R. 2008. The rise of atmospheric oxygen. Nature 451 17 January 2008 Timeline: #3,500 mya Archaean eon: production of oxygen by cyanobacteria starts in stromatolites. #Oxygen causes deposit of iron as iron oxides in banded iron formations. #c. 2,400 mya Palaeoproterozoic era: free oxygen escapes into atmosphere, mostly absorbed on the land. #c. 850 mya Neoproterozoic era: oxygen starts to accumulate in the atmosphere. Continues to increase during the Palaeozoic era, peaking in the Carboniferous period. #Present levels. == References == Category:Sedimentary rocks Category:Proterozoic Category:Atmosphere Category:Protista Category:Oxygen",
 "title": "Great Oxygenation Event"
}