{
 "id": "362380",
 "text": "Cristoforo Ivanovich (1628-1689; ; Montenegrin: \"Krsto Ivanovic\") was a Montenegrin \"Marinist\" poet from the Albania veneta of the Republic of Venice. He is the author of the first \"History of Theater\". He wrote in Italian -as in all his works- a critical chronology of opera drama done in Venice.Ivanovich's History and Criticism p.399 ==Life== Ivanovich was born in Budua (now Montenegro) in 1628. He died in Venice in 1688. He was from an old Dalmatian family with roots in the original Dalmatian neolatin people of southern Illyria. From the time he was young, he showed love for poetry. He started composing when he was a teenager. At age 25 he moved to Italy, where he built a successful career as a scientist, wrote poetry, and became a highly esteemed writer of opera libretti. He then went to Verona in 1655, where he was a member of the \"Accademia Filarmonica\" and the \"Accademia dei Temperati\". In 1657, he moved to Venice. He stayed there until his death in 1688. From 1663 he wrote celebrative writings, linked to the operatic market, that were presented in the theaters of Venice, Vienna and Piacenza. In his last years he wrote his most known work: Le memorie teatrali di Venezia.Biography (in French) ==Works== His main opera works, all in Italian, were the opera librettos: * L'amor guerriero *La Circe *Coriolano *La costanza trionfante *Lisimaco *L'africano trionfo di Pompeo *La felicità regnante *the internationally famous Minerva al tavolinoVideo about Krsto Ivanovic (in Montenegrin) In 1681 he wrote what is considered by critics his most famous work, Le memorie teatrali di Venezia, where he wanted to preserve the chronological history of theater and drama in Venice.Le memorie teatrali di Venezia ==Notes== ==Bibliography== * Cavallini, I. Questioni di poetica del melodramma del Seicento nelle lettere di Cristoforo Ivanovich, in \"Giovanni Legrenzi e la Cappella ducale di San Marco\", p. 185-99 (Venezia, 1990) * Milosevic, M. Il contributo di Cristoforo Ivanovich nell’evoluzione del melodramma seicentesco, in \"Il libro nel bacino adriatico (secc. XVI-XVIII)\", p. 111-24 (Venezia, 1989) * Rosand, Hellen. Opera in Seventeenth-Century Venice: The Creation of a Genre. Centennial Books. Publisher University of California Press, 2007 * Velimirovic, M. Cristoforo Ivanovich from Budva: the First Historian of the Venetian Opera (1967) * Walker, T. Gli errori di “Minerva al tavolino”: osservazioni sulla cronologia delle prime opere veneziane, in \"Venezia e il melodramma nel Seicento\", p. 7-20 (Venezia, 1972) ==Related pages== * Montenegro * Albania veneta * Dalmatian Italians ==Other websites== * Cristoforo Ivanovich biography (in French) Category:1620s births Category:1689 deaths Category:Italian poets Category:Montenegrin writers Category:People from Venice",
 "title": "Cristoforo Ivanovich"
}