{
 "id": "362435",
 "text": "Jack Angel (October 24, 1930 - October 18, 2021) was an American actor, voice artist, and comedian. He was known for his many voice roles in children's shows and movies. He provided \"Rocky Gibraltar\" in the Toy Story and Toy Story 2 and Chunk in Toy Story 3. ==Career== He provided additional voices for Scooby-Doo and Scrappy-Doo, The Dukes, Snorks, Dino-Riders, The Smurfs, Asterix and the Big Fight, The Little Mermaid, DuckTales the Movie: Treasure of the Lost Lamp, Land of Enchantment, Super Dave: Daredevil for Hire, Aladdin, The Hunchback of Notre Dame, Hercules, Mulan, The Iron Giant, Monsters, Inc., Lilo & Stitch, Treasure Planet, Avatar: The Last Airbender, Gothic 3, Horton Hears a Who, Cars Toons: Mater's Tall Tales, The Darkness II, The Lorax, Monsters University and Despicable Me 2. ==Early life== Angel was born and raised in Modesto, California on October 24, 1930. ==Personal life== Angel has been married twice. He was first married to Barbara Angel and they divorced in 1980.Angel, Jack 1930- | Encyclopedia.com In 1984 he married his second wife, talent agent and agency owner Arlene Thornton. The couple has three children. They lived in Studio City, California and Malibu, California. Angel died at his Malibu home on October 18, 2021 at the age of 90. ==Filmography== ===Animated films=== Year Title Role Notes 1986 The Transformers: The Movie Ramjet, Astrotrain 1986 Voltron: Fleet of Doom King Zarkon, Cmdr. Cossack Television Special 1987 G.I. Joe: The Movie Wetsuit Direct-to-video 1989 The Little Mermaid Additional voices 1990 DuckTales the Movie: Treasure of the Lost Lamp Additional voices 1990 The Rescuers Down Under Additional voices 1990 Land of Enchantment Additional voices 1991 Beauty and the Beast Additional voices 1991 An American Tail: Fievel Goes West Additional voices 1992 Porco Rosso Additional voices 2005 English Dub 1992 Aladdin Additional voices 1995 Toy Story Rocky Gibraltar 1995 Balto Nikki 1996 The Hunchback of Notre Dame Additional voices 1997 Hercules Additional voices 1998 A Bug's Life Thud 1998 The Prince of Egypt Egyptian 1999 Tarzan Additional voices 1999 The Iron Giant Additional voices 1999 Toy Story 2 Rocky Gibraltar 2001 The Trumpet of the Swan Justice of the Geese 2001 Spirited Away Radish Spirit 2002 English Dub 2001 Atlantis: The Lost Empire Truck Driver 2001 Monsters, Inc. Additional voices 2002 Lilo & Stitch Additional voices 2002 Treasure Planet Additional voices 2003 Finding Nemo Mr. Johansson 2006 Cars Additional voices 2006 Ice Age: The Meltdown Additional voices 2008 Horton Hears a Who! Additional voices 2008 Immigrants Longshoreman English Dub 2010 Toy Story 3 Chunk 2012 The Lorax Additional voices 2013 Monsters University Additional voices 2013 Despicable Me 2 Additional voices ===Animated series=== Year Title Role Notes 1977 The All-New Super Friends Hour Hawkman, Dr Lau 5 Episodes 1978 Challenge of the Super Friends The Flash, Hawkman, Samurai 16 Episodes 1979 Scooby-Doo and Scrappy-Doo Jerry Sloan Ep. \"The Scarab Lives!\" 1980 Super Friends The Flash, Hawkman, Samurai 1981–1982 Spider-Man (1981) Doctor Donald Blake, Moe, Man Mountain Marko 2 Episodes 1983 Super Friends:The Lost Episodes The Flash, Hawkman, Samurai 8 Episodes 1983 The New Scooby and Scrappy-Doo Show Jerry, Clown Ep. \"The Crazy Carnival Caper\" 1982–1989 The Smurfs Additional voices 1984 Pole Position Dr. Zachary Darrett 13 Episodes 1984 Super Friends: The Legendary Super Powers Show Samurai 2 Episodes 1984–1985 Voltron: Defender of the Universe King Zarkon, Hazar, Commander Cossack Yurak, Space Marshal Graham, others 122 Episodes 1985 The Super Powers Team: Galactic Guardians The Flash, Samurai and Hawkman 4 Episodes 1985–1987 The Transformers Ramjet, Smokescreen, Omega Supreme Astrotrain, Ultra Magnus, Cyclonus (following the death of Roger C. Carmel) Basso Profundo, Katsu Don, Sir Wulf and Professor Terranova 1986 G.I. Joe: A Real American Hero Wet Suit 16 Episodes 1987 The Real Ghostbusters Captain Jack Higgins Ep. \"Sea Fright\" 1987 Ducktales Quackerbill, Various Spies Eps. \"Merit-Time Adventure\" and \"Double-O-Duck\" 1988 Jem Emmet Benton (Jerrica & Kimber's Father) Ep. \"Out of the Past\" 1988 Superman General Hawkins Ep. \"Cybron Strikes\" 1988–1991 Teenage Mutant Ninja Turtles (1987 TV series) REX-1, LEX Eps. \"New York's Shiniest\" and \"Leonardo, the Renaissance Turtle\" 1989 Ring Raiders Make 1989 Dink, the Little Dinosaur Hubble Ep. \"Old Timers\" 1990–1991 Peter Pan and the Pirates Robert Mullins, Eucrates Cookson, King Kyros, Olook 1990 Tiny Toon Adventures Additional voices Ep. \"The Looney Beginning\" 1990–1991 Talespin Usher, The High Marshal Barney O'Turret and Detective Thursday 4 Episodes 1991–1992 Darkwing Duck The Liquidator and Monoculo Macawber 8 Episodes 1992 Raw Toonage Cro-Magnum Pi Episode: \"Cro-Magnum Pi\" 1993 Sonic the Hedgehog The SWATbots Ep. \"Super Special Sonic Search and Smash Squad\" Uncredited 1993 Wild West C.O.W.-Boys of Moo Mesa Additional voices Ep. \"Circus Daze\" 1993–1994 Bonkers Max Cody, Scribble, Flanigan 4 Episodes 1996 Casper Count Dracula Ep. \"Paranormal Press/Another Spooky and Poil Moment/Deadstock\" 1996 Quack Pack Old Fisherman Eps. \"Pride Goeth Before the Fall Guy\" and \"Koi Story\" 1996 Mortal Kombat: Defenders of the Realm Oniro, Computer Ep. \"Old Friends Never Die\" 1996 The Mask: The Animated Series Judge, M.P. Ep. \"The Green Marine\" 1997 Spider-Man (1994) Nick Fury 5 Episodes 2000 Hey Arnold! Superintendent Chaplin Ep. \"Principal Simmons\" 2001 Harvey Birdman, Attorney at Law General, Drunk Man Ep. \"Very Personal Injury\" 2003 The Wild Thornberrys MacTavish Ep. \"Sir Nigel: Part 2\" 2005 Grim & Evil Master Control Ep. \"House of No Tomorrow\" 2005 Avatar: The Last Airbender Pirate Captain Eps. \"The Waterbending Scroll\" and \"The Waterbending Master\" 2006 Ben 10 Technorg Ep. \"Grudge Match\" 2007 My Life as a Teenage Robot Weathered One, Man, Thug #2 Ep. \"Weapons of Mass Distraction\" 2007 El Tigre: The Adventures of Manny Rivera Comrade Chaos Ep. \"Old Money\" 2008 ChalkZone Old Man Year Before That, Old Man Year Before Year Before That Ep. \"The Day ChalkZone Stood Still\" 2009–2010 Mater's Tall Tales Additional voices 3 Episodes 2015 Clarence Howard Ep. \"Spooky Boo\" * Mork & Mindy: The Animated Series - Additional voices * The Dukes — Additional voices * Snorks — Additional voices * Saber Rider and the Star Sheriffs — Additional voices (English dub) * Denver, the Last Dinosaur — Prof. Chin * Dino-Riders — Additional voices * Blondie and Dagwood — Mr. Beasley and Herb Woodley * Kid 'n Play – Additional voices * The Wizard of Oz (TV series) – Additional voices * Space Cats — Additional voices * Where's Waldo? – Additional voices * ProStars – Additional voices * The Legend of Prince Valiant — Additional voices * Super Dave: Daredevil for Hire - Additional voices * The New Adventures of Captain Planet — Additional voices * The Fantastic Voyages of Sinbad the Sailor — Additional voices * All-New Dennis the Menace — Additional voices * Sonic Underground — Gondar ===Video games=== Year Title Role Notes 1995 Star Wars: Dark Forces Rom Mohc 1995 Full Throttle Bolus, Factory Door Guard 1995 The Dark Eye 1996 Shattered Steel 1997 Outlaws Henry' George Bowers, Spitn Jack Sanchez, Cowboy 2 1998 Grim Fandango Bruno Martinez, Chepito, Large Hitman, Seaman Naranja 1999 A Bug's Life Thud 1999 Crusaders of Might and Magic Additional voices 2001 Throne of Darkness Zanshin the Dark Shogun 2002 Ratchet & Clank Abner Buckwash 2004 EverQuest II Tunarian Human Alliance, Stalker Pulsarian, Eldin The Glademaster, Rulinthus the Treant Cannix Silverflame, Barwyn Sympronian Generic Male Barbarian, Generic Male Dwarf Merchant Generic Male Human Merchant, Generic Male Kerran Merchant 2004 World of Warcraft 2005 Shadow of Rome Vibius Pansa Caetronianus 2005 Killer7 Narrator English Dub 2005 Call of Duty 2 2006 Auto Assault 2006 Dreamfall: The Longest Journey Wonkers the Watilla 2006 Titan Quest Additional voices 2006 Gothic 3 Additional voices English Dub 2007 Supreme Commander Hex5, QAI 2007 Pirates of the Caribbean: At World's End Ammand the Corsair 2007 Supreme Commander: Forged Alliance QAI 2009 Aion 2009 Watchmen: The End is Nigh Underboss, Warden 2009 Wolfenstein General Zetta 2010 Supreme Commander 2 2010 Prison Break: The Conspiracy Additional voices 2010 Toy Story 3: The Video Game Chunk 2011 Voltron: Defender of the Universe King Zarkon Archive footage 2012 The Darkness II Additional voices 2012 Resident Evil: Operation Raccoon City Spec Ops Command 2012 Call of Duty: Black Ops II Survivor #3 2013 The Smurfs 2 Papa Smurf 2014 Grim Fandango: Remastered Bruno Martinez, Chepito, Large Hitman and Seaman Naranja Remastered 2016 Final Fantasy XV Cid Sophiar 2018 World of Warcraft: Battle for Azeroth Lashk ===Live action films — Voice=== * Deal of the Century — Announcer * Funny Lady — Radio Announcer * The World's Greatest Lover — Voice on Record * Trenchcoat — Head Kidnapper * Joey (film) — Fletcher the Dummy * Beetlejuice — Voice of The Preacher * Hook — Pirates (ADR) * Mom and Dad Save the World — Additional voices (uncredited) * The Fifth Element — Alien Commander * Vendetta — Old Gaspare (ADR) * A.I. Artificial Intelligence — Teddy * Looney Tunes: Back in Action — The Crusher * Noah — Rock (ADR) (uncredited) ===Live action=== * The Young and the Restless — Judge Martin J. Kline * King B: A Life in Movies — Jack Cole * Deterrence — Secretary of Defence * Crime and Punishment in Suburbia — Russ * Scrubs - PA System Announcer * Crime Story - Series Narrator ===Other=== * The Legend of Paul Bunyan (short) — Narrator * The Six Million Dollar Man — Voice of Tower Operator * Metric Meets the Inchworm (short) – * CBS Library — Mister Spitznagle (\"The Incredible Book Escape\") * The Tonight Show with Johnny Carson — Promo Announcer * Silver Spoons — Chess Player * Amazing Stories — Dog School Security Guard (\"The Family Dog\") * Harry and the Hendersons — TV Wrestler * I Am My Resume (short) — Stan Angeles * Crime Story — Narrator * Scrubs — PA System Announcer (\"My Waste of Time\") * Brad and Gary (short) — Gary * The Don of the Flies (short) — Narrator, Stooley, Harry and Moon (He also produced the short) * The Smurfs: A Christmas Carol — Papa Smurf * The Smurfs: The Legend of Smurfy Hollow — Papa Smurf * Recruited (short) — Principal * TUGS — Captain Starr, only in test US dub ==References== ==Other websites== * * Voice Chasers - Jack Angel Category:1930 births Category:2021 deaths Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American radio actors Category:American video game actors Category:Actors from Stanislaus County, California Category:People from Modesto, California",
 "title": "Jack Angel"
}