{
 "id": "362823",
 "text": "Peter Pan & Wendy, otherwise known as simply Peter Pan, is a 1953 American- British animated movie. It was produced by Walt Disney. It is the 14th movie in the Walt Disney Animated Classics series. It is based on the play Peter Pan, or The Boy Who Wouldn't Grow Up by J. M. Barrie. Started production in 1940 and finished in September 1952, It was first released on February 5, 1953 by RKO Pictures. Peter Pan is the last Disney animated movie released through RKO. Walt Disney then made his own distribution company, Buena Vista Distribution. The movie was entered into the 1953 Cannes Film Festival. A sequel called Return to Never Land was released in 2002. A series of direct- to-DVD movies about Tinker Bell began in 2008. ==Cast and characters== * Bobby Driscoll as Peter Pan * Kathryn Beaumont as Wendy Darling * Hans Conried as Captain Hook * Daws Butler as George Darling * Bill Thompson as Mr. Smee and Gentleman Starkey * Ed Wynn, George O'Hanlon, Pat Harrington, Jr. and Stan Freberg as Turk Damien Salt, Black Murphy, Mullins, Bill Jukes, Ship Wibbles, Mr. Tattoo and Skylights * Heather Angel as Mary Darling * Paul Collins as John Darling * Tommy Luske as Michael Darling * Candy Candido as Great Big Little Panther * Corinne Orr as Tiger Lily * Tom Conway as the Narrator * The Lost Boys: ** Robert Ellis as Cubby ** Jeffrey Silver as Nibs ** Jonny McGovern as the Twins ** Stuffy Singer as Slightly ** Tootles, a silent Lost Boy. Because of that, Tootles remains unvoiced. ** Tony Butala provided nearly all their singing voices. * June Foray, Connie Hilton, Margaret Kerry, Karen Kester and Lucille Bliss as the Mermaids * Julie Bennett as Squaw Piccaninny * The Mellomen (Thurl Ravenscroft, Bill Lee, Bob Stevens and Max Smith) as the Piccaninny Tribe * The Disney Studio Chorus as the Pirate Crew Additionally, Roland Dupree and Don Barclay provided additional voices, as well as both the live-action models for Peter Pan and Mr. Smee respectively. ==References== ==Other websites== * * (Dead link) * * Category:1953 movies Category:Disney animated movies Category:1950s English-language movies Category:Pirate movies Category:Movies about children Category:Movies about crocodiles Category:Movies based on plays Category:Movies composed by Oliver Wallace Category:Peter Pan movies Category:Movies set in London Category:Movies directed by Clyde Geronimi Category:Movies directed by Hamilton Luske Category:Movies directed by Wilfred Jackson Category:Movies about fairies and sprites",
 "title": "Peter Pan (1953 movie)"
}