{
 "id": "362873",
 "text": "Udit Narayan Jha (Hindi: उदित नारायण झा) (born 1 December 1955) is an Indian playback singer.Udit Narayan | Discography & Songs | Discogs Udit Narayan is famous for singing in Hindi, where his songs have been featured mainly in Bollywood movies of Hindi language. He has sung more than 25000 songs in 36 languagesUdit Narayan Jha | dhakatopi.com languages including Nepali, Maithili and Bhojpuri.His debut in Bollywood was in year 1980 from movie Unees-Bees. He has won 5 National Film Awards (of which 4 as a singer, for 2 songs in 2001, 1 each in 2002 and 2004 along with 1 as a producer in 2005) and 5 Filmfare Awards with 20 nominations and many other awards. He finally made his mark in 1988 movie Qayamat Se Qayamat Tak starring Aamir Khan and Juhi Chawla, his song Papa Kehte Hai was his notable performance which earned him his first Filmfare Award in the 1980s and he established himself in Bollywood Playback Singing. He is the only male singer in the history of the Filmfare Awards to have won in over three decades (the 1980s, 1990s and 2000s) After the success of the movie Qayamat Se Qayamat Tak in 1988 which turned out to be All Time Blockbuster movie in Bollywood with more than 8 million sales of the sound track being one of the highest selling albums in the 1980s. The soundtrack was a breakthrough for the careers of Anand-Milind, as well as T-Series, one of India's leading record labels. after which he was one of the favourites of music directors. His originality of voice was appreciated by all of the music lovers across the globe. Since his childhood he had idols such as Lata Mangeshkar, Asha Bhosle, Mohammed Rafi, Kishore Kumar whom he'd listen on his radio. In the 1990s he sung for thousands of songs including Hindi and Nepali languages. Recognising his contribution, his majesty King of Nepal, Birendra Bir Bikram Shah Dev awarded him with the Prabal Gorkha Dakshin Bahu in 2001 after which for his contribution to Indian cinema and music he was awarded the Padma Shri in 2009, and in 2016 he was awarded the Padma Bhushan by the Government of India, an honour that has been awarded to only a handful of singers, in recognition of his achievements in various film industries across India. He was also awarded Chitragupta Cineyatra Samman 2015 for Bhojpuri Cinema. As many as 21 of his tracks feature in BBC's \"Top 40 Bollywood Soundtracks of all time\". == Early life == Udit Narayan was born in 1955 to Nepali father Hare Krishna jha and Indian mother Bhuwaneshwari jha In early 2025, veteran Indian playback singer Udit Narayan faced significant backlash after videos surfaced online showing him kissing female fans during live performances. One widely circulated clip captured Narayan performing the song \"Tip Tip Barsa Pani\" from the 1994 film Mohra, during which several female fans approached him for selfies. While some fans kissed him on the cheek, Narayan was seen reciprocating by kissing one fan on the lips . The incident sparked widespread criticism on social media, with many users labeling his behavior as inappropriate and dubbing him a \"serial kisser,\" a term previously associated with actor Emraan Hashmi . In response to the controversy, Narayan defended his actions, describing them as expressions of affection between him and his fans. He stated, \"There is a deep pure and unbreakable bond between my fans and I. What you saw in the so-called scandalous video was a manifestation of the love between my fans and I\" . Despite his defense, the videos led to debates about consent and appropriate behavior during public performances. The controversy highlighted the evolving discussions around celebrity conduct and fan interactions in the digital age. == References == == Other websites == * Category:Living people Category:1955 births Category:Nepalese movie actors Category:Indian singers Category:Nepalese singers Category:People from Bihar Category:Bollywood playback singers",
 "title": "Udit Narayan"
}