{
 "id": "362919",
 "text": "The Iowa House of Representatives is the lower house of the Iowa General Assembly, Iowa's legislature. There are 100 people in the House, one for each of 100 districts in Iowa. Each district has about 29,750 people in it. The House of Representatives meets at the Iowa State Captiol in Des Moines. Unlike the Iowa Senate, House members - called \"representatives\" - have terms of two years. The whole House is eleced in even-numbered years. There are no term limits for the House. ==Leadership== The Speaker of the House is the leader of the House and serves as its chair. The Speaker also handles legislation and puts representatives on committees. The Speaker is chosen by the majority party and then elected by the entire House. Other House leaders, such as the majority and minority leaders, are elected by their party's members. ===Leaders=== Position Name Party District Speaker of the House Kraig Paulsen Republican 35 Majority Leader Linda Upmeyer Republican 12 Minority Leader Kevin M. McCarthy Democrat 67 ==Current composition== Affiliation Party (Shading indicates majority caucus) Party (Shading indicates majority caucus) Total Affiliation Total Affiliation Republican Democratic Total Vacant End of previous legislature 57 43 100 0 Begin 2017 59 41 100 0 End 2018 58 41 100 0 Begin 2019 54 46 100 0 April 23, 2019Republican Andy McKean (District 58) switched parties. 53 47 100 0 Latest voting share ===Past members=== * William S. Beardsley Governor of Iowa from 1949 to 1954 * William W. Belknap, U.S. Army major general and U.S. Secretary of War from 1869 until impeached in 1876. * Terry Branstad, Governor of Iowa from 1983 to 1999, 2011 to present * Robert D. Fulton, Governor of Iowa for 16 days in 1969 * Chuck Grassley, U.S. Senator, 1981 to present * Frank Merriam, Governor of California from 1934 to 1939 * William M. Stone, Civil War prisoner of war and Governor of Iowa from 1864 to 1868. * James Wilson, U.S. Secretary of Agriculture from 1897 to 1913. ==Related pages== *Iowa Senate ==References== ==Other websites== *Iowa Legislature official government website * *State House of Iowa at Project Vote Smart *Iowa House Democrats *Iowa House Republicans Category:Government of Iowa Category:State lower houses in the United States",
 "title": "Iowa House of Representatives"
}