{
 "id": "362981",
 "text": "Lady and the Tramp is a 1955 American animated movie. It was produced by Walt Disney. Lady and the Tramp was released to theaters on June 22, 1955, by Buena Vista Film Distribution. It is the 15th animated movie in the Walt Disney Animated Classics series. Lady and the Tramp was the first Disney animated movie to be presented in widescreen. It was the first animated movie filmed in the CinemaScope widescreen movie process. It was nominated for Best Animated Movie at the BAFTA Awards.BAFTA Awards Lady and the Tramp was the first Disney animated movie to be released under Disney's own distribution company Buena Vista Film Distribution. The story is set in 1909. It is about a female American Cocker Spaniel named Lady. She lives with a refined, upper-middle- class family. The story is also about a male stray mutt called the Tramp. A direct-to-video sequel, Lady and the Tramp II: Scamp's Adventure, was released in 2000. A live-action remake was released on Disney+ on November 12, 2019. In June 2011, TIME named it one of \"The 25 All-TIME Best Animated Films\". It has gotten some criticism for the portrayal of the Siamese cats, who are thought to be racist stereotypes of Asian people. In 2023, the Library of Congress included Lady and the Tramp as 1 of the Disney animated movies in part of the United States National Film Registry. == Cast == * Barbara Luddy as Lady * Larry Roberts as The Tramp * Bill Thompson as Jock, Joe, Bulldog, Dachsie, Policeman * Bill Baucom as Trusty * George Givot as Tony * Peggy Lee as Darling, Si, Am, Peg * Verna Felton as Aunt Sarah * Stan Freberg as the beaver * Alan Reed as Boris * Thurl Ravenscroft as Al the alligator * Dallas McKennon as Toughy, Pedro, Professor, Hyena * Lee Millar as Jim Dear, Dogcatcher * The Mellomen (Thurl Ravenscroft, Bill Lee, Max Smith, Bob Hamlin and Bob Stevens) as Dog Chorus == References == == Other websites == * * * * Lady and the Tramp at Disney's Archives Category:Lady and the Tramp Category:1955 romance movies Category:1955 comedy movies Category:1950s romantic comedy movies Category:Disney animated movies Category:American romantic comedy movies Category:American animated romance movies Category:Movies about dogs Category:Movies composed by Oliver Wallace Category:Movies set in the 1900s Category:Movies set in the 1910s Category:Movies set in the United States Category:Movies directed by Clyde Geronimi Category:Movies directed by Hamilton Luske Category:Movies directed by Wilfred Jackson Category:1950s English-language movies Category:United States National Film Registry movies",
 "title": "Lady and the Tramp"
}