{
 "id": "363096",
 "text": "Delroy George Arthur Lindo (18 November 1952 as Norman Flemming) is an English actor. He has performed in many movies and stage acts. He starred in the movies Malcolm X and Crooklyn. He was born in London. ==Filmography== Year Title Role Notes 1976 Find the Lady Sam 1979 More American Graffiti Army Sergeant 1990 The Blood of Heroes Mbulu Mountains of the Moon Mabruki Bright Angel Harley 1991 The Hard Way Captain Brix, NYPD 1992 Malcolm X West Indian Archie Nominated—NAACP Image Award for Outstanding Supporting Actor in a Motion Picture Nominated—National Society of Film Critics Award for Best Supporting Actor 1993 Blood In Blood Out Bonafide Mr. Jones Howard 1994 L'exil du roi Behanzin Behanzin Award of Festival International du Film Francophone de Namur for Best Actor Crooklyn Woody Carmichael 1995 Clockers Rodney Little Nominated—Chicago Film Critics Association Award for Best Supporting Actor Nominated—National Society of Film Critics Award for Best Supporting Actor Congo Captain Wanta Uncredited Get Shorty Bo Catlett Nominated—National Society of Film Critics Award for Best Supporting Actor Nominated—Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 1996 Ransom Agent Lonnie Hawkins Nominated—NAACP Image Award for Outstanding Supporting Actor in a Motion Picture Broken Arrow Colonel Max Wilkins Feeling Minnesota Red 1997 A Life Less Ordinary Jackson The Devil's Advocate Phillipe Moyez Uncredited 1999 Pros & Cons Kyle The Cider House Rules Arthur Rose Nominated—Las Vegas Film Critics Society Award for Best Supporting Actor Nominated—Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2000 The Book of Stars Professor Gone in 60 Seconds Det. Roland Castlebeck Romeo Must Die Isaak O'Day 2001 The One MVA Agent Harry Roedecker Heist Bobby \"Bob\" Blane The Last Castle Gen. Wheeler 2003 The Core Dr. Ed 'Braz' Brazzleton Wondrous Oblivion Dennis Samuel 2005 Domino Claremont Williams Sahara Carl 2007 This Christmas Joseph 'Joe' Black 2009 Up Beta Voice 2011 The Big Bang Skeres 2015 Cymbeline Belarius Do You Believe? Malachi Point Break Instructor Hall 2017 Battlecreek Arthur 2018 Malicious Dr. Clark TBA Da 5 Bloods Post-production Category:Actors from London Category:1952 births Category:Living people",
 "title": "Delroy Lindo"
}