{
 "id": "363075",
 "text": "Charley Frank Pride (March 18, 1934December 12, 2020) was an American country music singer, recording artist, baseball player, and businessman. Along with Stoney Edwards and O.B. McClinton, Pride was and remains one of the most notable black country singers of the 1960s and 1970s. ==Early life== Charley Pride was born on March 18, 1938 in Sledge, Mississippi to a family of sharecroppers. A mistake on his birth certificate reads his first name as \"Charl.\" Growing up, Pride dreamed of becoming a baseball pitcher and learned to play the guitar at the age of 14. Pride got his start in baseball in The American Negro League for many teams, including the Mississippi Red Sox, the Birmingham Black Barons, the New York Mets and the Boise Yankees. (The C team for the New York Yankees). It was during this time Pride met and married his wife, Rozene. ==Music career and rise to fame== Pride was known to sing at baseball games. He was encouraged to pursue a career in music and caught the eye of record producer Chet Atkins who signed Pride a record deal in 1965. Following that year, Pride released and recorded his debut song \"The Snakes Crawl out at Night\" which played on the radio but didn't chart. It wasn't until 1969 when he released the record \"From Me to You\" that he became more well known. In 1971 Pride was at the top of the Billboard charts with the song \"Kiss an Angel Good Mornin.\" Pride also played concerts internationally in Northern Ireland in 1975. In 1981, Pride sang for Ronald Reagan at his Inauguration. The same year he released the album \"There's A Little Bit of Hank in Me, where he does his own versions of songs which were first done by Hank Williams. In 1994, Pride published his autobiography. ==Personal life== Pride and his wife Rozene lived in Dallas, Texas. In 2010, Pride became an investor for the Texas Rangers and was regularly seen at their games. Pride had two sons and a daughter. One of his sons played in a band. Pride died in Dallas on December 12, 2020, of problems related to COVID-19. He was 86 years old. ==Related pages== *List of country musicians from Mississippi ==References== Category:1938 births Category:Musicians from Mississippi Category:American country singers Category:2020 deaths Category:American country guitarists Category:American baseball players Category:Singers from Mississippi Category:Sportspeople from Mississippi Category:Businesspeople from Mississippi Category:Singers from Dallas Category:Musicians from Dallas Category:Businesspeople from Dallas Category:Sportspeople from Dallas Category:Deaths from the COVID-19 pandemic in Dallas",
 "title": "Charley Pride"
}