{
 "id": "36318",
 "text": "Reggio di Calabria (, ;\"Reggio di Calabria\" (US) and ) is a city in southern Italy, capital of the Metropolitan City of Reggio Calabria, and the twenty- first most populous city in Italy after Modena. Reggio was the capital of Magna Graecia. It was the first city to take the name of Italy, founder of the ononymous name, formerly populated by Italics. It is the third economic centre of mainland Southern Italy, the city proper has a population of more than 200,000 inhabitants spread over , while the fast-growing urban area numbers 260,000 inhabitants. About 560,000 people live in the metropolitan area, recognised in 2015 by Italian Republic as a metropolitan city and is the 100th most populated city in the EU. ==Geography== Reggio is located on the \"toe\" of the Italian Peninsula and is separated from the island of Sicily by the Strait of Messina. It is situated on the slopes of the Aspromonte, a long, craggy mountain range that runs up through the centre of the region. As a major functional pole in the region, it has strong historical, cultural and economic ties with the city of Messina, which lies across the strait in Sicily, forming a metro city of less than 1 million people. ==History== Reggio is the oldest city in the region, and during ancient times, it was an important and flourishing colony of Magna Graecia. Reggio has a modern urban system, set up after the catastrophic earthquake of 1908, which destroyed most of the city. The region has been subject to earthquakes. ==Economy== It is a major economic centre for regional services and transport on the southern shores of the Mediterranean. Reggio, with Naples and Taranto, is home to one of the most important archaeological museums, the prestigious National Archaeological Museum of Magna Græcia, dedicated to Ancient Greece (which houses the Bronzes of Riace, rare example of Greek bronze sculpture, which became one of the symbols of the city). Reggio is the seat, since 1907, of the Archeological Superintendence of Bruttium and Lucania. The city centre, consisting primarily of Liberty buildings, has a linear development along the coast with parallel streets, and the promenade is dotted with rare magnolias and exotic palms. Reggio has commonly used popular nicknames: The \"city of Bronzes\", after the Bronzes of Riace that are testimonials of its Greek origins; the \"city of bergamot\", which is exclusively cultivated in the region; and the \"city of Fatamorgana\", an optical phenomenon visible in Italy only from the Reggio seaside. ==References==",
 "title": "Reggio Calabria"
}