{
 "id": "363163",
 "text": "Badlands are a type of dry terrain which is extremely difficult to move across.Jackson, Julia A. (ed) 1997. \"Badlands\" in Glossary of geology 4th ed. Alexandria, Viriginia: American Geological Institute. ISBN 0922152349 It happens when softer rock is eroded by wind and water, leaving harder rock sticking up. Canyons, ravines, gullies and other such geological forms are common in badlands. They are very difficult to cross by foot, or even on horse, and impossible by car. Dry badlands may have spectacular colour displays that range from dark black/blue coal strata to bright clays and sandstone. ==Features== The term 'badlands' is apt: badlands have steep slopes, loose dry soil, slick clay, and deep sand, all of which act against travel and other uses. They form in dry regions with infrequent but intense rain-showers, little vegetation, and soft sediments which get massive erosion. Some of the most famous fossil beds are found in badlands, where erosion rapidly exposes the sedimentary layers and the scant cover of vegetation makes surveying and fossil hunting relatively easy. Coal seams get exposed in some badlands, so some coal mining districts have developed in badlands areas. An example of this is the Drumheller district of the Red Deer River in Alberta, where the Atlas Coal Mine historical site shows the last of 139 mines which operated in the badlands. ==Locations== Some of the best-known badland formations can be found in North America. In the U.S., the Alleghenies have parts which are true badlands. There it is possible to move in one compass direction, but not at 90o to that direction. Makoshika State Park in Montana, Theodore Roosevelt National Park in North Dakota and Badlands National Park in South Dakota together form a series of extensive badland formations.Currie P.J; Koppelhus E.B. eds (2005). Dinosaur Provincial Park : a spectacular ancient ecosystem revealed. Bloomington: Indiana University Press. ISBN 9780253345950 Dinosaur National Monument in Colorado and Utah are also badlands settings. The Big Muddy Badlands in Saskatchewan, Canada, gained notoriety as a hideout for outlaws. There is a large badland area in Alberta, Canada, particularly in the valley of the Red Deer River (where Dinosaur Provincial Park is) and in Drumheller, Alberta where the Royal Tyrrell Museum of Palaeontology is. A well-known badlands formation in New Zealand is the Putangirua Pinnacles – formed by the erosion of the conglomerate of an old river delta. It is at the head of a small valley near the southern tip of the North Island. == References ==",
 "title": "Badlands"
}