{
 "id": "363214",
 "text": "The Sword in the Stone is a 1963 American animated fantasy comedy movie based on T. H. White's novel of the same name and produced by Disney. It was released on December 25, 1963. It was the last movie released before Walt Disney died three years later. The novel was first published in 1938 as a single one. It was republished in 1958 as one of the four books in The Once and Future King. == Cast and characters == * Rickie Sorensen, Richard Reitherman and Robert Reitherman as Arthur/Wart, the long-lost son of Uther Pendragon and the future King Arthur. He is Disney's adaptation of legendary British leader King Arthur. * Karl Swenson as Merlin, the legendary wizard educating Wart. * Martha Wentworth as Madam Mim, a black witch and Merlin's rival. * Junius Matthews as Archimedes, Merlin's pet owl. He also educates Wart. * Sebastian Cabot as Sir Ector, the ruler of King Uther Pendragon's castle. * Norman Alden as Sir Kay, the older foster brother of Wart. * Alan Napier as Sir Pellinore, a friend of Sir Ector. He announces the tournament in which Arthur is revealed as king. * Thurl Ravenscroft as Black Bart, also known as the Black Knight, one of the first to recognize the sword that Arthur pulled from the stone. (uncredited) * James MacDonald as The Wolf, an unnamed wolf attempting to kill Wart. (also uncredited) * Ginny Tyler as The Little Girl Squirrel, a young female squirrel whom Wart meets in the same form. She saves him from the Wolf. Tyler only provided vocal effects for her, but no dialogue. == Awards == The movie was nominated for the Academy Award for Best Score—Adaptation or Treatment, but lost to Irma La Douce. == References == == Other websites == * * * (Dead link) * * * Category:1960s animated movies Category:American fantasy-comedy movies Category:Arthurian movies Category:Disney animated movies Category:Movies about wizards Category:Movies based on books Category:Movies composed by George Bruns Category:Movies directed by Wolfgang Reitherman Category:1960s English-language movies Category:1963 fantasy movies Category:1963 comedy movies Category:Movies set in the 15th century Category:Movies about orphans Category:American musical fantasy movies Category:Movies about birds Category:1963 musical movies Category:Movies set in London Category:Movies about old age Category:Movies about witchcraft",
 "title": "The Sword in the Stone (1963 movie)"
}