{
 "id": "363216",
 "text": "The Jungle Book is a 1967 American animated movie. It was produced by Walt Disney Productions. It was released on October 18, 1967. It is the 19th animated movie in the Walt Disney Animated Classics series. It was inspired by the stories about Mowgli from the book of the same name by Rudyard Kipling. It was directed by Wolfgang Reitherman. It was the last to be produced by Walt Disney, who died during its production. The Jungle Book was the final Disney animated movie to be released under the Hays Code. The early versions of both the screenplay and the soundtrack followed Kipling's work more closely. There was a dramatic, dark, and sinister tone which Disney did not want in his family movie. The first writer Bill Peet and composer Terry Gilkyson were replaced. The movie made over $73 million in the United States in its first release. After inflation, it’s the sixth highest grossing animated movie in the world. This movie has a sequel called The Jungle Book 2. == Story == After a panther named Bagheera finds a human orphan baby, he convinces his friends the wolves to raise the boy. They name him Mowgli. Mowgli wears a loincloth. When the wolves are afraid that a tiger named Shere Khan wants to kill Mowgli, Bagheera tries to take Mowgli to the village where the humans live. When Mowgli finds out, he climbs a tree and grabs onto it so Bagheera grabs onto Mowgli's loincloth with his mouth and tries to pull Mowgli off by giving him a wedgie. Mowgli then meets an elephant calf (meaning a young elephant) whose father Colonel Hathi is in the army and sings about being elephants in the military. Hathi and his wife Winifred let Bagheera have Mowgli back. Bagheera tries to convince Mowgli that he should leave the jungle but Mowgli refuses so Bagheera leaves. Then Bagheera thinks that Mowgli is in danger after Mowgli meets a sloth bear named Baloo who teaches Mowgli to roar. Baloo tells Bagheera that Mowgli will be fine with him. So Baloo sings a song called \"The Bare Necessities\" to Mowgli about how the only things that are important are the things you really need. Then monkeys kidnap Mowgli and bring him to their leader King Louie, an orangutan. Baloo goes to Bagheera to ask him for his help to rescue Mowgli. King Louie gives Mowgli a wedgie to keep him from escaping. But then King Louie gives Mowgli bananas to eat and sings a song about how he wants Mowgli to give him The Red Flower so that he can become human. Baloo and Bagheera rescue Mowgli. When Mowgli falls asleep, Baloo and Bagheera argue since Bagheera says if Mowgli stays in the jungle, then Shere Khan will kill him because of how much he hates humans. So when Mowgli wakes up, Baloo tells Mowgli that he has to leave the jungle but Mowgli gets angry and leaves Baloo. A python named Kaa sings a song to Mowgli called \"Trust in Me\" about how he's the only one Mowgli can trust and Kaa uses the song to hypnotize Mowgli and tries to eat him but then Shere Khan comes and Mowgli escapes. Mowgli meets four vultures who sing about friendship but then Shere- Khan comes and tries to kill him though Baloo and Bagheera and the vultures come to Mowgli to protect him. Mowgli figures out how to use fire to fight Shere Khan and burn him and Shere Khan runs away but Baloo is injured and looks like he's dead. Bagheera gives a eulogy for Baloo but it turns out Baloo is alive. Mowgli sees a human girl singing while holding a bucket of water so Mowgli falls in love with her and leaves the Jungle to live in the same village that she lives in. ==Cast == * Bruce Reitherman as Mowgli, a 10-year- old orphaned boy, commonly called \"man-cub\" by the other characters. * Phil Harris as Baloo, a sloth bear who leads a carefree life and believes in letting the good things in life come by themselves. * Sebastian Cabot as Bagheera, a serious black panther who is determined to take Mowgli back to the village and disapproves of Baloo's carefree approach to life. * Louis Prima as King Louie, an orangutan who wants to be a human, and wants Mowgli to teach him how to make fire. * George Sanders as Shere Khan, an intelligent and sophisticated yet merciless Bengal tiger who hates all humans for fear of their guns and fire and wants to kill Mowgli. * Sterling Holloway as Kaa, an Indian python who wants Mowgli as prey, but comically fails each time he attempts to eat him. * J. Pat O'Malley as Colonel Hathi the Indian elephant/Buzzie the Vulture * Verna Felton as Winifred, Colonel Hathi's wife. * Clint Howard as Junior, Colonel Hathi's son. * Chad Stuart as Flaps the Vulture * Lord Tim Hudson as Dizzie the Vulture * John Abbott as Akela the Indian Wolf * Ben Wright as Rama the Father Wolf * Darleen Carr as Shanti * Leo De Lyon as Flunkey the Langur* * Hal Smith as The Slob Elephant* * Ralph Wright as The Gloomy Elephant* * Digby Wolfe as Ziggy the Vulture* * Bill Skiles and Pete Henderson as Monkeys* * James MacDonald as Shere Khan/Bagheera roaring* Asterisks mark actors that were the \"Additional Voices\", but were uncredited. ==Awards== The song \"The Bare Necessities\" was nominated for Best Song at the 40th Academy Awards. It lost to \"Talk to the Animals\" from Doctor Dolittle.Oscars Database http://awardsdatabase.oscars.org/ampas_awards/DisplayMain.jsp?curTime=1215147249619 Academy of Motion Picture Arts and Sciences president Gregory Peck wanted this movie to be nominated for Best Picture, but he was unsuccessful.http://www.empireonline.com/features/50-disney- films/default.asp?film=19 ==References== ==Other websites== * * (dead link) * * Category:1967 movies Category:1967 comedy movies Category:1967 musical movies Category:American buddy comedy movies Category:American family movies Category:American musical comedy movies Category:Disney animated movies Category:Movies about royalty Category:Movies about elephants Category:Movies about snakes Category:Movies about tigers Category:Movies about bears Category:Movies about birds Category:Movies about apes Category:Jungle movies Category:Movies set in India Category:Movies composed by George Bruns Category:Movies directed by Wolfgang Reitherman Category:Movies about orphans Category:Movies about friendship Category:1960s English-language movies Category:Movies based on books",
 "title": "The Jungle Book (1967 movie)"
}