{
 "id": "363242",
 "text": "Raja Hindustani () is a 1996 Bollywood movie directed by Dharmesh Darshan. The movie has Aamir Khan and Karisma Kapoor playing the main roles. The music were done by Nadeem-Shravan. The movie won six Filmfare awards and also many other several awards that year. == Cast == * Aamir Khan as Raja Hindustani * Karisma Kapoor as Aarti Sehgal * Rajwinder Deol as Raju * Suresh Oberoi as Mr. Sehgal (Aarti's father) * Johnny Lever as Balvant Singh * Navneet Nishan as Kamal Singh / Kammo * Veeru Krishnan as Gulab Singh * Kunal Khemu as Rajnikant (as Master Kunal Khemu) * Pramod Moutho as Swaraj (Shalu's brother) * Mohnish Behl as Jai (as Mohnish Behl) * Tiku Talsania as Chacha (Raja's uncle) * Farida Jalal as Chachi (Raja's aunt) * Archana Puran Singh as Shalini Sehgal / Shalu (Aarti's stepmother) * Kalpana Iyer as Guest appearance in the song \"Pardesi Pardesi\" * Pratibha Sinha as Guest appearance in the song \"Pardesi Pardesi\" ==Soundtrack== The music was composed by Nadeem-Shravan. Plannet Bollywood ranks the movie soundtracks at 56 in its all time top 100 Greatest Bollywood soundtracks. The music album was also the most sold album of 1996. ===Tracklist=== Track # Title Singer(s) Length 1 \"Perdesi Perdesi (I)\" Udit Narayan, Alka Yagnik, Sapna Awasthi 07:31 2 \"Aaye Ho Meri Zindagi Mein (Male)\" Udit Narayan 06:02 3 \"Aaye Ho Meri Zindagi Mein (Female)\" Alka Yagnik 06:02 4 \"Kitna Pyaara Tujhe Rab Ne\" Udit Narayan, Alka Yagnik 06:20 5 \"Perdesi Perdesi (II)\" Kumar Sanu, Alka Yagnik 08:19 6 \"Poocho Zara Poocho\" Kumar Sanu, Alka Yagnik 06:12 7 \"Tere Ishq Mein Nachenge\" Kumar Sanu, Alisha Chinai, Sapna Mukherjee 08:14 8 \"Perdesi Perdesi (Sad)\" Suresh Wadkar, Bela Sulakhe 02:40 == Awards == === 1997 Filmfare Awards === ;Won * Filmfare Best Actor Award -- Aamir Khan * Filmfare Best Actress Award -- Karisma Kapoor * Filmfare Best Movie Award -- Dharmesh Darshan * Filmfare Best Music Director Award -- Nadeem-Shravan * Filmfare Best Male Playback Award -- Udit Narayan for \"Pardesi Pardesi\" === Star Screen Awards === ;Won * Star Screen Award for Best Film * Star Screen Award for Best Director - Dharmesh Darshan * Star Screen Award for Best Actor - Aamir Khan * Star Screen Award for Best Comedian - Johnny Lever * Star Screen Award for Best Music Director- Nadeem Shravan * Star Screen Award for Best Male Playback - Udit Narayan for \"Aaye Ho Meri Zindagi Mein\" * Star Screen Award for Best Screenplay - Robin Bhatt ==References== == Other websites == * Category:1990s Indian movies Category:1996 movies",
 "title": "Raja Hindustani"
}