{
 "id": "363353",
 "text": "The \"lesbian kiss episode\" is a type of the media portrayal of lesbianism in television media. It was made in the 1990s. The first time was in 1991 with a kiss on the American L.A. Law series. It was in the episode \"He's a Crowd\" between C.J. Lamb and Abby Perkins. David E. Kelley wrote the episode. He used the same idea in at least two of his other shows. Later television series included an episode in which a seemingly heterosexual female character has a kiss with a possibly lesbian or bisexual character. Most times, the potential of a relationship between the women does not survive past the episode. The lesbian or suspected lesbian never appears again. ==Series== Series which have had lesbian kiss episodes include: Program Title U.S. air date Kissers L. A. Law \"He's a Crowd\" February 7, 1991 Abby Perkins(Michele Greene) and C. J. Lamb (Amanda Donohoe). Picket Fences \"Sugar & Spice\" April 29, 1993 Kimberly Brock (Holly Marie Combs) and Lisa Fenn (Alexondra Lee). After talks between producer David E. Kelley and CBS, the scene was reshot in lower light. Roseanne \"Don't Ask, Don't Tell\" March 1, 1994 Roseanne Conner (Roseanne Barr) and Sharon (Mariel Hemingway). Full contact not shown. Sharon makes a cameo appearance in \"December Bride\", showing the wedding of two men. Lifestories: Families in Crisis \"More Than Friends: The Coming Out of Heidi Leiter\" March 7, 1994 Heidi Leiter (Sabrina Lloyd) and Missy (Kate Anthony). Based on the true story of Heidi Leiter, who attended her senior prom in Virginia with her girlfriend.Capsuto, p. 335 Neither character appeared again in this anthology series. Star Trek: Deep Space Nine \"Rejoined\" October 30, 1995 Jadzia Dax (Terry Farrell) and Lenara Kahn (Susanna Thompson). Lenara Kahn never reappears on the series. As joined Trills, a previous male host of Dax and female host of Kahn had been husband and wife 90 years earlier. Trill culture considers such rejoinings to be taboo; however, no remarks are made about Jadzia's and Lenara's genders. Relativity \"The Day the Earth Moved\" January 11, 1997 Rhonda (Lisa Edelstein) and Suzanne (Kristin Dattilo). Dattilo's character was only in one episode. The series was cancelled four episodes later. Sex and the City \"Bay of Married Pigs\" \"Boy, Girl, Boy, Girl...\" June 21, 1998 June 25, 2000 Miranda Hobbes and Syd (Joanna Adler). Miranda kisses Syd to prove that she, Miranda, is not a lesbian, and Syd never re-appears. Carrie Bradshaw and Dawn (Alanis Morissette). Dawn never reappears on the series. Ally McBeal \"Happy Trails\" \"Buried Pleasures\" November 9, 1998 November 1, 1999 Ally McBeal (Calista Flockhart) and Georgia Thomas (Courtney Thorne-Smith). Ally McBeal and Ling Woo (Lucy Liu). These episodes are unusual in that all of the women involved are series regulars. Party of Five \"I'll Show You Mine\" May 5, 1999 Julia Salinger (Neve Campbell) and Perry Marks (Olivia d'Abo). Perry was in one more episode. Talk to Me \"About Being Gay\" April 11, 2000 Janey (Kyra Sedgwick) and Teresa (Paulina Porizkova). Janey flirts with Teresa, who turns out to be an actual lesbian, on a dare from her friends. Janey decides she is not a lesbian after the kiss. Teresa was a one episode character. Friends \"The One with Rachel's Big Kiss\" April 26, 2001 Rachel Green (Jennifer Aniston) and Melissa Warburton (Winona Ryder); Rachel Green and Phoebe Buffay (Lisa Kudrow). Melissa never reappears on the series. Phoebe kisses Rachel to see what all the fuss Melissa made was about. Once and Again \"The Gay-Straight Alliance\" March 11, 2002 Jessie Sammler (Evan Rachel Wood) and Katie Singer (Mischa Barton). Katie was in three additional episodes of the series. The two remain in a relationship, but secretly, until the end of the series. Firefly \"War Stories\" December 6, 2002 Inara Serra (Morena Baccarin) and The Councilor (Katherine Kendall). The Councilor is a client of Inara's and she does not reappear in the series. Fastlane \"Strap On\" January 17, 2003 Billie Chambers (Tiffani Thiessen) and Sara Matthews (Jaime Pressley). Sara never reappears on the series. The Joe Schmo Show Episode 7 October 7, 2003 Ashleigh (Melissa Yvonne Lewis) and Molly (Angela Dodson). In this reality television parody, Ashleigh and Molly kiss at the behest of a \"network executive\" who says that the kiss is a ploy for ratings. One Tree Hill \"I Will Dare\" \"The Heart Brings You Back\" October 19, 2004 January 25, 2005 Peyton Sawyer (Hilarie Burton) and Anna Taggaro (Daniella Alonso). Anna was in four additional episodes of the series. Peyton Sawyer and Brooke Davis (Sophia Bush). Peyton and Brooke are both regular characters. The O.C. \"The Lonely Hearts Club\" February 10, 2005 Marissa Cooper (Mischa Barton) and Alex Kelly (Olivia Wilde). Alex leaves the series four episodes later. American Dad! \"Not Particularly Desperate Housewives\" December 8, 2005 Linda Memari and Francine Smith. Linda is a closeted lesbian who kisses Francine to save her from being killed by the Ladybugs. Linda is genuinely attracted to Francine; however, Francine thinks the kiss was fake. Linda is in other episodes; however, Linda's sexual interest in Francine is not discussed. Crossing Jordan \"Mysterious Ways\" April 23, 2006 Jordan Cavanaugh (Jill Hennessy) and Detective Tallulah \"Lu\" Simmons (Leslie Bibb). Episode hints at the possible bisexuality of lead character Jordan. Bibb was a recurring cast member. How I Met Your Mother \"Best Prom Ever\" \"The Broath\" May 1, 2006 March 19, 2012 Lily Aldrin (Alyson Hannigan) and Robin Scherbatsky (Cobie Smulders). Robin kisses Lily to give Lily the \"lesbian experience\" she never had. Both are series regulars. Robin Scherbatsky and Lily Aldrin kiss to seal an oath promising not to interfere with Barney's life. Barney and his girlfriend, Quinn, reveal moments later that the lesbian kiss was intended to humiliate the pair and teach a lesson about judgment. Las Vegas \"Fleeting Cheating Meeting\" January 12, 2007 Samantha Marquez (Vanessa Marcil) and Mary McConnell (Nikki Cox). Samantha and Mary, both series regulars, were portrayed as heterosexual although dialogue in several episodes shows Samantha's possible bisexuality. Dirt \"Ita Missa Est\" March 27, 2007 Lucy Spiller (Courteney Cox) and Tina Harrod (Jennifer Aniston). The episode hints at a former intimate relationship between the two. Tina never reappears on the series. Kyle XY \"Free to Be You and Me\" July 23, 2007 Lori Trager (April Matson) and Hillary (Chelan Simmons). Hillary was a recurring character. Being Erica \"Everything She Wants\" March 4, 2009 Erica (Erin Karpluk) and Cassidy (Anna Silk). In a flashback, Erica relives a brief infatuation with her lesbian college friend Cassidy, which is short-lived when Erica tells Cassidy she is straight. Cassidy appears in two later episodes. Desperate Housewives \"The Story of Lucie and Jessie\" March 15, 2009 Susan and her boss, Jessie; Susan and Gabrielle. Susan (Teri Hatcher) and Gabrielle (Eva Longoria) were series regulars; Jessie (Swoosie Kurtz) was a guest star. Greek \"Dearly Beloved\" \"Divine Secrets and the ZBZ Sisterhood\" May 4, 2009 May 18, 2009 Rebecca Logan (Dilshad Vadsaria) and Robyn Wylie (Anna Osceola). Rebecca and Robyn; Rebecca and Casey Cartwright. The kiss in \"Dearly Beloved\" opened a three-episode story arc in which Rebecca questions her sexuality. The arc ended in episode \"Divine Secrets\" with Rebecca deciding that she was not a LUG and her response to the kiss was because it was a new and unusual experience. Robyn did not reappear. The Cleveland Show \"Pilot\" September 27, 2009 Lois Griffin (Alex Borstein) and Bonnie Swanson (Jennifer Tilly). The two kiss at the behest of lead character Cleveland as something of a going-away present. Heroes \"Hysterical Blindness\" October 12, 2009 Claire Bennet (Hayden Panettiere) and Gretchen Berg (Madeline Zima). Gretchen kisses Claire and confesses to having a crush. Panettiere, who has acknowledged \"experimenting\" with female friends as a teenager, persuaded the creators to include the storyline. Zima's character was a recurring role. Heroes had previously planned a lesbian cheerleader character in 2007 but the actress took another job after just one episode and the part was not re-cast. FlashForward \"Gimme Some Truth\" October 22, 2009 Janis Hawk (Christine Woods) and Maya (Navi Rawat). Janis is a closeted FBI agent and Maya is a chef. Maya did not reappear on the series. Gossip Girl \"They Shoot Humphreys, Don't They?\" November 9, 2009 Vanessa Abrams (Jessica Szohr) and Olivia Burke (Hilary Duff). The two kiss as part of a threesome with Dan Humphrey (Penn Badgley). Duff's character was a recurring role. 90210 \"Rats and Heroes\" March 9, 2010 Gia (Rumer Willis) and Adrianna (Jessica Lowndes) kiss after bonding at an Alcoholics Anonymous meeting. Willis' character was a recurring role. Community \"Early 21st Century Romanticism\" February 10, 2011 Britta (Gillian Jacobs) and Page (Brit Marling). Britta and Page become friends and later kiss, each under the mistaken impression that the other is a lesbian. Page has not reappeared to date. Pan Am \"Diplomatic Relations\" January 15, 2012 Maggie (Christina Ricci) and Amanda (Ashley Greene). Amanda comforts a sad Maggie by wiping Maggie's tears, then telling her her opinion on men, and kissing. Greene's character was recurring. The Simpsons \"Lisa Goes Gaga\" May 20, 2012 Marge Simpson (Julie Kavner) and Lady Gaga. Alphas \"When Push Comes to Shove\" August 13, 2012 Nina Theroux (Laura Mennell) and Rachel Pirzad (Azita Ghanizada). Nina, a telepath with the ability to \"push\" others into doing what she asks them, forced Rachel to kiss her against Rachel's will. Both characters are series regulars. ==References== * Capsuto, Steven (2000). Alternate Channels: The Uncensored Story of Gay and Lesbian Images on Radio and Television. Ballantine Books. . Category:LGBT television programs",
 "title": "Lesbian kiss episode"
}