{
 "id": "363529",
 "text": "Madhuri Dixit Nene professionally known as Madhuri Dixit (born 15 May 1967) is an Indian actress who appear in Bollywood movies. Dixit has won five Filmfare Awards, four for Best Actress and one for Best Supporting Actress. She holds the record for the highest number of Best Actress nominations (13) at Filmfare. In 2008, she was awarded the Padma Shri, India's fourth-highest civilian award by the Government of India. ==Career== She made her Bollywood debut with the movie Abudh in 1984. Her first breakthrough performance came in 1988, with the movie Tezaab. The movie also established her career in the industry. Since then she has appeared in movies like Dil, Beta, Khalnayak, Raja, Dil To Pagal Hai, Hum Tumhare Hain Sanam, Devdas, Aaja Nachle. She took a break after Devdas to raise her children and made a comeback with Aaja Nachle in 2007. == Personal life == She is married to Dr. Shriram Madhav and they have two children. ==Awards== ===Honors and recognitions=== *1997: Kalabhinetri Award by the Government of Andhra Pradesh *2001: National Citizen's Award *2007: Bollywood's Best Actress Ever *2008: Padma Shri, India's fourth highest civilian award, by Government of India *2008: Honored at IFFLA (Indian Film Festival of Los Angeles) ===Awards=== *1990: Filmfare Best Actress Award for Dil *1992: Filmfare Best Actress Award for Beta *1994: Filmfare Best Actress Award for Hum Aapke Hain Kaun *1994: Star Screen Best Actress Award for Hum Aapke Hain Kaun *1995: Star Screen Award Best Actress for Raja *1997: Filmfare Best Actress Award for Dil To Pagal Hai *1997: Star Screen Award Best Actress for Mrityudand *1998: Zee Cine Award for Best Actor - Female for Dil To Pagal Hai *2000: IIFA Best Actress Award for Pukar *2002: Filmfare Best Actress Award for- Devdas *2002: Star Screen Best Supporting Actress Award for Devdas *2002: Zee Cine Award for Best Actor in a Supporting Role - Female for Lajja ==Filmography== Year Film Role Notes 1984 Abodh Gauri 1985 Awara Baap Barkha 1986 Swati Anandi 1986 Manav Hatya 1987 Mohre Maya 1987 Hifazat Janki 1987 Uttar Dakshin Chanda 1988 Khatron Ke Khiladi Kavita 1988 Dayavan Neela Velhu 1988 Tezaab Mohini Nominated—Filmfare Award for Best Actress 1989 Vardi Jaya 1989 Ram Lakhan Radha 1989 Prem Pratigyaa Laxmi Nominated—Filmfare Best Actress Award 1989 Ilaaka Vidya 1989 Mujrim Sonia 1989 Tridev Divya Mathur 1989 Kanoon Apna Apna Bharathi 1989 Parinda Paro 1989 Paap Ka Ant 1989 Satyavadi Raja Harishchandra Special appearance in a song Gujarati film 1990 Maha-Sangram Jhumri 1990 Kishen Kanhaiya Anju 1990 Izzatdaar Mohini 1990 Dil Madhu Mehra Filmfare Best Actress Award 1990 Deewana Mujh Sa Nahin Anita 1990 Jeevan Ek Sangharsh Madhu Sen 1990 Sailaab Dr. Sushma Malhotra 1990 Jamai Raja Rekha 1990 Thanedaar Chanda 1991 Pyar Ka Devta Devi 1991 Khilaaf Sweta 1991 100 Days Devi 1991 Pratikar Madhu 1991 Saajan Pooja Nominated—Filmfare Best Actress Award 1991 Prahaar Shirley 1992 Beta Saraswati Filmfare Best Actress Award 1992 Zindagi Ek Jua Juhi 1992 Prem Deewane Shivangi Mehra 1992 Khel Seema/Dr.Jadi Buti 1992 Sangeet Nirmala Devi & Sangeeta 1993 Dharavi Dreamgirl 1993 Sahibaan Sahibaan 1993 Khalnayak Ganga (Gangotri Devi) Nominated—Filmfare Best Actress Award 1993 Phool Guddi 1993 Dil Tera Aashiq Sonia Khanna/Savitri Devi 1993 Aasoo Bane Angaarey 1994 Anjaam Shivani Chopra Nominated—Filmfare Best Actress Award 1994 Hum Aapke Hain Koun..! Nisha Choudhury Filmfare Best Actress Award 1995 Raja Madhu Garewal Nominated—Filmfare Best Actress Award 1995 Yaraana Lalita/Shikha Nominated—Filmfare Best Actress Award 1995 Paappi Devataa Reshma 1996 Prem Granth Kajri 1996 Raj Kumar Rajkumari Vishaka 1997 Koyla Gauri 1997 Mahaanta Jenny Pinto 1997 Mrityudand Ketki 1997 Mohabbat Shweta Sharma 1997 Dil To Pagal Hai Pooja Filmfare Best Actress Award 1998 Bade Miyan Chhote Miyan Herself (Special appearance) 1998 Wajood Apoorva Choudhury 1999 Aarzoo Pooja 2000 Pukar Anjali Nominated—Filmfare Best Actress Award 2000 Gaja Gamini Gaja Gamini/Sangita/Shakuntala/Monika/Mona Lisa 2001 Yeh Raaste Hain Pyaar Ke Neha 2001 Lajja Janki Nominated—Filmfare Award for Best Supporting Actress 2002 Hum Tumhare Hain Sanam Radha 2002 Devdas Chandramukhi Filmfare Award for Best Supporting Actress 2007 Aaja Nachle Diya Nominated—Filmfare Best Actress Award 2013 Gulab Gang 2013 Dedh Ishqiya ==References== ==Other websites== * * * * Category:Living people Category:Indian actors Category:1967 births Category:Marathi people",
 "title": "Madhuri Dixit"
}