{
 "id": "363635",
 "text": "In the Herero and Namaqua Genocide (1904-1907), soldiers of the German Empire killed and displaced tens of thousands of Herero and Nama people during the scramble for Africa. This happened in what is today called Namibia. At the time, the area was part of a colony called German South West Africa. The Herero and Nama were ethnic groups that were indigenous to this area. Historians think this was the first genocide of the 20th century.Olusoga, David and Erichsen, Casper W (2010). The Kaiser's Holocaust. Germany's Forgotten Genocide and the Colonial Roots of Nazism. Faber and Faber. Mahmood Mamdani, When Victims Become Killers: Colonialism, Nativism, and the Genocide in Rwanda, Princeton University Press, Princeton, 2001, p. 12 It is also an example of an ethnic cleansing. == The genocide == On January 12, 1904, the Herero people, led by Samuel Maharero, rebelled against German colonial rule. They were defeated that August by German general Lothar von Trotha at the Battle of Waterberg. German soldiers drove the Herero into the desert of Omaheke, and did not allow them to return home. The Herero were now refugees. Most of them died in the desert from thirst (dehydration). Similar things happened to the Nama people when they rebelled against the Germans in October 1904. == Deaths == Between 24,000 and 100,000 Herero died in the genocide; so did 10,000 Nama.Colonial Genocide and Reparations Claims in the 21st Century: The Socio-Legal Context of Claims under International Law by the Herero against Germany for Genocide in Namibia, 1904-1908 (PSI Reports) by Jeremy Sarkin-HughesEmpire, Colony, Genocide: Conquest, Occupation and Subaltern Resistance in World History (War and Genocide) (War and Genocide) (War and Genocide) A. Dirk Moses -page 296(From Conquest to Genocide: Colonial Rule in German Southwest Africa and German East Africa. 296, (29). Dominik J. Schaller)The Imperialist Imagination: German Colonialism and Its Legacy (Social History, Popular Culture, and Politics in Germany) by Sara L. Friedrichsmeyer, Sara Lennox, and Susanne M. Zantop page 87 University of Michigan Press 1999Walter Nuhn: Sturm über Südwest. Der Hereroaufstand von 1904. Bernhard & Graefe-Verlag, Koblenz 1989. .Marie-Aude Baronian, Stephan Besser, Yolande Jansen, \"Diaspora and memory: figures of displacement in contemporary literature, arts and politics\", pg. 33 Rodopi, 2007, Many people died from starvation and thirst because people who fled the violence were not allowed to go back to their homes in the Namib Desert. Some sources claim that the German colonial army regularly poisoned desert wells.Samuel Totten, William S. Parsons, Israel W. Charny, \"Century of genocide: critical essays and eyewitness accounts\" pg. 51, Routledge, 2004,Dan Kroll, \"Securing our water supply: protecting a vulnerable resource\", PennWell Corp/University of Michigan Press, pg. 22 == After the genocide == According to the United Nations' 1985 Whitaker Report, this was an attempt to kill all Herero and Nama people: one of the first genocides in the 20th century. In 2004 the German government admitted that the Herero and Namaqua genocide happened, and they apologized. However, they did not give any compensation to the victims' relatives. == Related pages == * Genocide * Ethnic cleansing * German Empire * Colonialism * Imperialism ==References== Category:20th-century rebellions Category:Genocides in Africa Category:Rebellions in Africa Category:20th century in Namibia Category:1900s in Africa Category:20th century in Germany",
 "title": "Herero and Namaqua genocide"
}