{
 "id": "363870",
 "text": "Noah Webster, Jr. (October 16, 1758 - May 28, 1843), was the author of a famous American dictionary, a pioneer of spelling, and a political writer and editor. In the 1790s he was the editor of a Federalist Party newspaper. His \"Blue-backed Speller\" books taught five generations of American children how to spell and read.Ellis, Joseph 1979. After the Revolution: profiles of early American culture. p175 He made enough money from it to write his dictionary, first published in 1828 as An American Dictionary of the English Language. == Copyright == Webster worried that his Grammatical Institute might be pirated. He had to seek copyright protection from each state. At last, on May 31, 1790, President George Washington signed the United States’ first general copyright act into law. Later, Webster lobbied for an extended copyright law. He wrote “By this bill the term of copy-right is secured for 28 years, with the right of renewal … for 14 years more. If this should become law, I shall be much benefited.” The new federal copyright law was passed and remained in effect until 1909. == Webster's books == === The Blue-backed Speller === *1783 as the first part of the Grammatical Institute of the English language. *1786 as The American Spelling Book, containing the rudiments of the English language, for the use of schools in the United States. *1829 as The Elementary Spelling Book. 385 'editions' (mostly reprints) in his lifetime; by 1837 15 million copies sold; by 1890 60 million copies sold. === The Dictionary === *1806 A first attempt was published as A Compendious Dictionary of the English Language. *1828 The first edition of his famous An American Dictionary of the English Language; second edition in 1840 in two volumes. The first edition sold only 2,500 copies. === Other publications === *1785. Sketches of American policy. *1790. A collection of essays and fugitive writings on moral, historical, politics and literary subjects. *1789. Dissertations. *1793. The effects of slavery on morals and industry. In two volumes. *1799. A brief history of epidemic and pestilential diseases. *1800. A Grammatical Institute of the English Language. In three parts, part II is the grammar. *1802. Letters to a young gentleman concerning his education. *1802. Miscellaneous papers on political and commercial subjects. *1832. History of the United States. *1833. A dictionary for primary schools. *1834. Value of the Bible and Excellence of the Christian Religion *1839. Observations on language, and on the errors of class-books. == Further reading == *Baron, Dennis E. 1982. Grammar and good taste: reforming the American Language. New Haven: Yale University Press. *Dillard J.L. 1992. A history of American English. New York: Longman 1992. *Fodde Melis, Luisanna 2005. Noah Webster and the first American dictionary. Rosen, New York. *Simpson, David. 1986. The politics of American English, 17761850. Oxford University Press. * Unger, Harlow Giles 1998. Noah Webster: the life and times of an American patriot. *Webster, Noah. 1989 The autobiographies of Noah Webster. Edited by Richard M. Rollins. Columbia, SC: University of South Carolina Press. === Webster on the web === * Webster, Noah. The American spelling book: containing the rudiments of the English language for the use of schools in the United States by Noah Webster 1836 edition online, the famous 'Blue-backed Speller' * Webster, Noah. An American dictionary of the English language 1848 edition online * Webster, Noah. A grammatical institute of the English language 1800 edition online * Webster, Noah. Miscellaneous papers on political and commercial subjects 1802 edition online mostly about banks * Webster, Noah. A collection of essays and fugitiv writings: on moral, historical, political and literary subjects 1790 edition online 414 pages == References == Category:Writers from Connecticut Category:1758 births Category:1843 deaths Category:People from West Hartford, Connecticut",
 "title": "Noah Webster"
}