{
 "id": "363936",
 "text": "Hotel Transylvania is a 2012 American computer-animated Halloween comedy movie. It was produced by Columbia Pictures and Sony Pictures Animation. The movie stars Adam Sandler as the voice of Dracula and Selena Gomez as Mavis, Dracula's daughter. ==Plot== Dracula (voiced by Adam Sandler) is the owner and creator of Hotel Transylvania, a five-star resort where the world's monsters can be safe from humans. Dracula invites some of the most famous monsters, such as Frankenstein (Kevin James) and his wife Eunice (Fran Drescher), Murray the mummy (Cee Lo Green), Wayne and Wanda Werewolf (Steve Buscemi and Molly Shannon), Griffin the Invisible Man (David Spade), Bigfoot, The Blob, and other monsters to celebrate the 118th birthday of his daughter Mavis (voiced by Selena Gomez). When Hotel Transylvania is unexpectedly visited by a human traveler named Jonathan (voiced by Andy Samberg), Dracula must protect Mavis and stop her from falling in love with him before it is too late. ==Voice cast== * Adam Sandler as Dracula, the Hotel Transylvania owner, Mavis' over- protective father, and the main character. * Selena Gomez as Mavis, Dracula's 118-year-old \"teenage\" daughter. She is independent and wants to explore the world, but hates it when her dad treats her like a kid. Later, Mavis falls in love with Jonathan. * Andy Samberg as Jonathan/Johnnystein, a 21-year-old regular guy who falls in love with Mavis upon stumbling into Hotel Transylvania. * Kevin James as Frank/Frankenstein * Fran Drescher as Eunice, Frankenstein's wife * Steve Buscemi as Wayne, a werewolf * Molly Shannon as Wanda, a werewolf and Wayne's pregnant wife * Cee Lo Green as Murray, an obese mummy * David Spade as Griffin the Invisible Man * Jon Lovitz as Quasimodo, the former Hunchback of Notre-Dame who now works as a gourmet chef. He is always accompanied by his pet rat Esmeralda. * Chris Parnell as Fly * Brian George as Suit of Armor, a living suit of armor that works as Dracula's messenger. * Brian Stack as Pilot * Jackie Sandler as Martha, Dracula's wife and Mavis' mother. * Sadie Sandler as Young Mavis / Winnie * Rob Riggle as Skeleton Husband * Paul Brittain as Zombie * Robert Smigel as Fake Dracula / Marty * Jonny Solomon as Gremlin Man and the Blob * Craig Kellman as Guy in Crowd * Brian McCann as Hairy Monster * James Williams as Foreman The Shrunken Heads were voiced by Luenell and Jim Wise. Hydra Heads were voiced by Paul Brittain, Craig Kellman, Brian McCann, Jonny Solomon, and Jim Wise. ==References== ==Other websites== * * * * * Category:2012 movies Category:2012 animated movies Category:2012 3D movies Category:American animated movies Category:American comedy movies Category:English-language movies Category:Frankenstein movies Category:Halloween movies Category:Hotel Transylvania Category:Movies directed by Genndy Tartakovsky Category:Werewolves in movies",
 "title": "Hotel Transylvania"
}