{
 "id": "364053",
 "text": "The Kazan International Festival of Muslim Cinema (KIFMC) was created in 2005. It takes place at the beginning of September in the town of Kazan, Russia. It is an annual forum of cinematographers, and a place of regular meetings and an exchange of experience, of further cooperation, between moviemakers of Russia, Muslim countries and the entire world. Not only Muslims can take part, but also representatives of other faiths creating movies, popularizing universal spiritually-moral and cultural traditions. In the first, it was supposed to be a mobile festival between Muslim regions in Russia and other states of the Muslim world. The city of Kazan was chosen because it is the biggest Islamic city in the northern hemisphere. Nevertheless, after the phenomenal success and wide popularity in the whole world, and especially in the countries of the Islamic world, President of the Republic Tatarstan insisted that KIFMC should be the Culture Brand of the capital of the Republic \"Kazan\" which became the permanent residence for the festival, and City name has been added to the name of the festival. ==Organization== The founders of Kazan International Festival of Muslim Cinema (KIFMC) are: *Ministry of Culture Affairs of the Republic of Tatarstan *The Russian Mufties Council *Administration of Kazan city The festival is held under the support and the supervision of: *President of the Republic of Tatarstan *The Ministry of culture of the Russian federation ==Festival program== The program of the Festival will include: *Main Competition ** Full-length feature movie ** Short-length feature movie ** Full-length documentary movie ** Short-length documentary movie ** Animation movie *Non-competition screening **Feature movie **Documentary movie *Movies of the Muslim countries, winners of the international movie festivals **Feature movie **Documentary movie ==Documentation== Entry applications for the Kazan International Festival of Muslim Cinema should reach the General Management of Festival not later than June 30, 2013. * movie in DVD sent to the selection committee must be delivered before July 15, 2013 mentioning \"No commercial value and for cultural purpose only\". * Each country has the right to participate with more than one movie. The entry form must be accompanied by the following documentation: **The list of subtitles in English; **Synopsis, press and promotional materials Stills from the movies and trailers. **Materials for the festival catalogue, including a detailed biography and filmography of the director and the principal actors, a director's photo as well as slides from the movie. Only movies produced after January 1, 2011 will be accepted for the Competition programs, preference in Competition programs is given to the world and International premieres. Not less than: * 12 full- length feature movies, * 15 Short-length feature movies, * 10 full-length documentary movies, * 15 Short-length documentary movies, * 12 animation movies, Will participate in the Main Competition of the Kazan International Festival of Muslim Cinema. * The Selection Committee of the Festival finishes its work on August 1, 2013. * Confirming the participation in the Kazan International Festival of Muslim Cinema, should arrive before August, 10, 2013. * Prints of the movies accepted for the Competition programs of the Festival should be in possession of the General Management of the Kazan International Festival of Muslim Cinema before August 10, 2013. All conditions and mentioned dates are obligatory otherwise the Management of the 8th Kazan International Festival of Muslim Cinema, has the right to exclude the movie from the Festival program. ==Other websites== * The 8th Kazan International Festival of Muslim Cinema * Kazan International Festival of Muslim Cinema (KIFMC) Category:Movie festivals Category:Islamic culture Category:Russian movies Category:Kazan",
 "title": "Kazan International Festival of Muslim Cinema"
}