{
 "id": "364260",
 "text": "Richard Alan \"Dick\" Enberg (January 9, 1935 – December 21, 2017) was an American sportscaster. He was the voice of the San Diego Padres. He also announced or hosted the Tournament of Roses Parade for many years, sometimes with the help of family members. Enberg was born in Mount Clemens, Michigan. He began his career calling games for UCLA Bruins basketball, Los Angeles Rams football and California Angels baseball. In the 1970s, Enberg hosted the television game show Sports Challenge. He co-produced the Emmy Award-winning sports-history series The Way It Was for PBS. He broadcast for many sports and events for NBC, including the National Football League, Major League Baseball, the National Basketball Association, the U.S. Open golf championship, college football, college basketball, the Wimbledon and French Open tennis tournaments, heavyweight boxing, Breeders' Cup and other horse racing events, and the Olympic Games. He died in San Diego California from cardiac arrest ==Honors== Enberg received many awards and honors in his lifetime. These include 13 Sports Emmy Awards (as well as a Lifetime Achievement Emmy), nine National Sportscaster of the Year awards from the National Sportscasters and Sportswriters Association (and is in that organization's Hall of Fame), five Sportscaster of the Year awards from the American Sportscasters Association, the Pete Rozelle Award from the Pro Football Hall of Fame, the Curt Gowdy Award from the Basketball Hall of Fame, and a star on the Hollywood Walk of Fame. Enberg is the only sportscaster so far to win Emmys in three categories (broadcasting, writing, and producing). In 1973, he was the first U.S. sportscaster to visit the People's Republic of China. ==References== Category:1935 births Category:2017 deaths Category:Tennis broadcasters Category:Olympic Games broadcasters Category:Golf broadcasters Category:Major League Baseball broadcasters Category:College football broadcasters Category:College basketball broadcasters Category:National Football League broadcasters",
 "title": "Dick Enberg"
}