{
 "id": "364299",
 "text": "Dr. Ramón E. López (born 1959) is an American scientist and writer. He is a Space Physicist. He has also been a large part of a hands-on science program in the elementary and middle grades of the Montgomery County Public School System (MCPS) in Maryland. ==Life== López was born in Illinois. His parents are from Puerto Rico. His father was a United States Army officer and surgeon. His mother an elementary school teacher. When he was a child, his father gave him a telescope as a birthday present.for his 10th birthday The Apollo 11 moon landing on July 20, 1969 caused him to be very interested in Space Physics. When he was in sixth grade, his father retired from the military and his family moved to Freeport, Illinois. In Fereport, his father started his own medical office. Lopez went to Pearl City High School. There his science teacher taught him to do a small amount of computer programming. ==Education== López began studying at the University of Illinois in 1976. He earned a B.S. in Physics in 1980. As a student, he worked in the Physics Department. He helped with demonstrations and shows. He also wrote articles for the school's newspaper. He won a National Science Foundation minority graduate fellowship and money for school. He used the money to study at Rice University in Houston, Texas. In 1984, he earned his Master's and in 1986 a Ph.D. ==Work== López worked as a scientist for the Applied Research Corporation from 1985 to 1992. He later worked at the University of Maryland, the American Physical Society, the Florida Institute of Technology and the University of Texas at both El Paso and Arlington. He worked very closely with Montgomery County Public Schools (MCPS) in Maryland to help create a hands-on science program in elementary and middle grades. Lopez's main area of research deals with magnetospheric physics and space weather. He studied the magnetic properties of the sun and solar wind and how they affect weather on the earth. López is currently a Professor in the Department of Physics at the University of Texas at Arlington. == Writer== In addition to his science publications, Lopez co- wrote the book Storms from the Sun: The Emerging Science of Space Weather;. He wrote the book with Michael J. Carlowicz. It was published in 2002.Storms from the Sun: The Emerging Science of Space Weather; ==Science publications== Lopez has worked on many published works. These include the following: *Predicting Magnetopause Crossings at Geosynchronous Orbit During the Halloween Storms, Space Weather, 5, S01005, ; 2007; López, R. E., S. Hernandez, M. Wiltberger, C.-L. Huang, E. L. Kepko, H. Spence, C. C. Goodrich, and J. G. Lyon. *Using Space Physics in Undergraduate Electromagnetism Courses; 2007; López, R. E. *Active Learning for Advanced Students: The Center for Integrated Space Weather Modeling Graduate Summer School; 2007; López, R. E. and N. A. Gross; . *Field-Aligned Currents in the Polar Cap During Saturation of the Polar Cap Potential, J. Atmos. Sol. Terr. Phys.; López, R. E., S. Hernandez, K. Hallman, R. Valenzuela, J. Seiler, P. Anderson, and M. Hairston (2007). *An Explanation for the Saturation of the Transpolar Potential, submitted to J. Geophys; Hernandez, S., R. E. López, M. Wiltberger and J. G. Lyon (2007). ==References== Category:1959 births Category:Living people Category:American physicists Category:Writers from Illinois Category:Scientists from Illinois",
 "title": "Ramón E. López"
}