{
 "id": "364438",
 "text": "Chespirito (born Roberto Gómez Bolaños, February 21, 1929 - November 28, 2014) was a Mexican writer, actor, director, comedian, humorist, songwriter and poet. He was known for writing, directing, and starring in the Chespirito (1968-1995), El Chavo del Ocho (1971-1980), and El Chapulín Colorado (1972-1981) television series. The character of El Chavo is one of the most iconic in the history of Latin American television. El Chavo del Ocho is still popular. It has been watched every day by 91 million people per episode. ==Early life== Chespirito was born on February 21, 1929 in Mexico City, Mexico. His parents were Francisco Gómez Linares and Elsa Bolaños Cacho Aguilar. His brother Horacio was also an actor. Mexican President Gustavo Díaz Ordaz Bolaños was his cousin once removed. ==Early career== Before becoming an actor, Chespirito was a small-time boxer. He wanted to be a engineer, so he studied at National Autonomous University of Mexico. Chespirito also wrote some plays before he started acting. His stage name, \"Chespirito\", was given to him by a producer during Chespirito's first years as a writer. The nickname means \"Little Shakespeare\". ==Personal life== Chespirito's first wife was Graciela Fernandez. They married in 1968. They had six children. They divorced in 1989. In 2004, Chespirito married his co-star and long-time partner, actress Florinda Meza. Chespirito was a member of the National Action Party (PAN). ===Death=== On November 28, 2014, Chespirito died from heart failure as a complication of Parkinson's disease at the age of 85, in Cancún, Quintana Roo. His funeral was held at the Estadio Azteca in Mexico City on November 30, 2014. He is buried at Panteón Francés, in Mexico City. ==References== ==Bibliography== * ==Other websites== * *Official website Category:1929 births Category:2014 deaths Category:Mexican movie actors Category:Mexican television actors Category:Mexican voice actors Category:Mexican stage actors Category:Mexican writers Category:Mexican poets Category:Mexican screenwriters Category:Mexican movie directors Category:Mexican comedians Category:Stage names Category:Mexican television directors Category:Actors from Mexico City Category:Mexican people of Spanish descent",
 "title": "Chespirito"
}