{
 "id": "364724",
 "text": "is a widely used Japanese cultural concept.DeMente, Boye. (2003). Japan's Cultural Code Words: 233 Key Terms that Explain the Attitudes and Behavior of the Japanese, pp. 73-76. The term means \"enduring the seemingly unbearable with patience and dignity\".Smithsonian, \"The Art of Gaman\", \"Arts and Crafts from the Japanese American Internment Camps, 1942-1946\" ; retrieved 2012-10-4. The idea is often translated as \"perseverance\" or \"patience\". Gaman implies a kind of hard work which is defined by Japanese culture. Gaman is a passive term. It focuses on no complaints in the process of working with others. It contrasts with an active process.Haghirian, Parissa. \"Mastering The Basics,\" American Chamber of Commerce in Japan (ACCJ), 15 February 2011; excerpt, \"Where ganbaru is an active process and requires people work together. The meaning of the term gaman is passive. It focuses more on enduring and not complaining.\" ==History== The term Gaman first appeared in Japan as a teaching of Zen Buddhism.West, Mark I. (2009). The Japanification of Children's Popular Culture: from Godzilla to Miyazaki, p. 4. After the 2011 Tōhoku earthquake and tsunami, gaman was one of the most commonly heard expressions \"U.S. donations not rushing to Japan,\" 11Alive News (US). March 17, 2011; excerpt, \"Devin Stewart, a senior director at the Japan Society in New York City, said, \"Suffering and persevering is a type of virtue in Japan ... the ability to persevere and remain calm under difficult situations. Among the most commonly heard expressions there, are gaman, to persevere or tough it out; gambaru, to do your best, to be strong; and shoganai (shikata ga nai), it cannot be helped, which expresses a sense of fatalism ....\" ==Analysis== Gaman is a subject in writings about the Japanese-Americans and others held in United States' internment camps during World War II.Japanese National American Museum, \"The Art of Gaman: Enduring the Seemingly Unbearable with Patience and Dignity,\" March 2010; retrieved 18 March 2011; \"Art by Japanese-American Detainees During World War Two Shows Their Struggle and Humanity,\" VOA News (US). May 18, 2010; retrieved 18 March 2011 In internment camps, gaman meant a kind of strength in the face of difficulty or suffering.Niiya, Brian. (1993). Japanese American History: An A-to-Z Reference from 1868 to the Present, p. 143., citing Betty Furuta, (1981). \"Ethnic Identities of Japanese-American Families: Implications for Counseling,\" in Understanding the Family: Stress and Change in American Family Life (Cathleen Gerry and Winnifred Humphreys, eds.), pp. 200-231, 212. The term is used in writings about those who lived were harmed by the 2011 Tōhoku earthquake and tsunami in northern Japan.Köhler, Nicholas and Nancy Macdonald with Jason Kirby. \"Why the world is wrong to count Japan out,\" Maclean's (Canada). March 25, 2011; Mateo, Ibarra C. \"Japanese show power of patience, stoic discipline amid triple crises,\" Philippine Daily Inquirer, 27 March 2011; excerpt, \"Fueled by gaman ..., the workers did not abandon their posts even if it seemed suicidal to go on. They showed another Japanese trait: putting first their country, community and group over their individual concerns.\" Gaman is the subject of academic studies.Johnson, Frank A. (1995) Dependency and Japanese Socialization, p. 181; Burns, Catherine. (2004). Sexual violence and the law in Japan, p. 51; Kolb, Patricia J. (2007). Social Work Practice With Ethnically and Racially Diverse Nursing Home Residents and Their Families, p. 146. The word gaman is the origin of the corollary concept of ganbaru.Hanabusa, George. (2003). Second Chances Gospel, p. 40. ==Related pages== * Gambaru * Shikata ga nai ==References== ==Other websites== * \"The Art of Gaman: Arts and Crafts from the Japanese American Internment Camps, 1942-1946\" at Smithsonian Institution Category:Japanese culture",
 "title": "Gaman (term)"
}