{
 "id": "364937",
 "text": ", also known as or \"Battleship Island\",Kawamoto, Yasuhiko. \"Deserted 'Battleship Isle' may become heritage ghost ship,\" The Japan Times, February 17, 2009. Retrieved 2012-10-5. is a 1.2-km2 Japanese island.Nussbaum, Louis- Frédéric. (2005). \"Hashima\" in Japan Encyclopedia, p. 294. It is one of 505 uninhabited islands in Nagasaki Prefecture on the island of Kyushu.Frater, Jamie. (2009). The Ultimate Book of Top Ten Lists: A Mind-Boggling Collection of Fun, p. 697. The island is on a tentative list of UNESCO World Heritage Sites.UNESCO, \"The Modern Industrial Heritage Sites in Kyûshû and Yamaguchi\". Retrieved 2012-10-5. ==History== Hashima is a former coal mining site.Bureau of Mines, Dept. of Agriculture and Commerce of Japan. (1909) Mining in Japan, past and present, p. 126. People lived on the island from 1887 until 1974.Burke-Gaffney, Brian. \"Hashima: The Ghost Island,\" Crossroads: A Journal of Nagasaki History and Culture (Summer 1996), Vol. 4, pp. 33–52. Retrieved 2012-10-5. In 1890, Mitsubishi bought the inhabited island to mine coal from undersea tunnels. The company built Japan's first large concrete building. It was nine stories. This Hashima Island is also known as \"The Prison island\" or \"The island of the Hell\", because many teenagers from South Korea forced to work at mines in Hashima Island. When those miners arrived there without knowing that they won't be able to see their homes again, majority of them were 13 years old to 15 years old. They had work under in such a terrible conditions: wearing only under wear to go in the mine also, they never got paid for their work and for their meals, they had to eat the left overs from making bean oil. Only two out of over a hundred of the young workers survived. They said \"I could here my friend yelling that they are hungry all the time.\" and \"I want to eat a bowl of rice grown in my country with a bowl of warm soup\". These survivors described Hashima Island as \"a prison that I am forced to stay without frames\" Also, Japan has rapidly said that the young miners volunteered to come so it is not considered as \"forced to work\". However, the two survivors does not agree with that. Behind the this island of Hashima there is sad truth. Since 2005, the island has been part of the city of Nagasaki. ==Geography== Hashima island is near the mouth of Nagasaki harbour. It is about 19 miles from the center of the city. ==In popular culture== The island is one of the locations in the 2012 James Bond film Skyfall.MI6-hq.com, \"Another 'Skyfall' location recreated at Pinewood,\" 12 April 2012; Techbuzz.com, \"James Bond Upcoming Movie “Skyfall”. Retrieved 2012-10-6. ==Related pages== * List of uninhabited regions * List of World Heritage Sites in Japan ==References== ==Other websites== * \"The way to world heritage Gunkanjima * \"Geisterstadt im Ozean\" at Der Spiegel * \"Hashima--forgotten island of tragedy\" at Korea Times * Photo images at Gunkanjima.com * \"Abandoned towns of the world\" at Telegraph.co.uk Category:Islands of Japan Category:Uninhabited regions",
 "title": "Hashima"
}