{
 "id": "365165",
 "text": "Gloria Swanson (Gloria Josephine Mae, March 27, 1899 - April 4, 1983) was an American movie, television, stage, voice, radio, silent movie actress, singer and movie producer. She played Norma Desmond in Sunset Boulevard. She won a Golden Globe Award in 1951 and a Saturn Award in 1975. She was known for having an affair with Joseph P. Kennedy, Sr.. Swanson was born in Chicago, Illinois. She studied at Hawthorne Scholastic Academy. She was married six times, having a relationship with Wallace Beery (1916-1919), Herbert K. Somborn (1919-1922), Henri de la Falaise (1925-1930), Michael Farmer (1931-1934), William Davey (1945-1946) and William Dufty (1976-1983). Swanson had three children. She died of heart failure. She was buried at the Episcopal Church of the Heavenly Rest in New York City. == Early life == Swanson was born in a small house in Chicago in 1899. She was raised in the Lutheran faith. Her father was Joseph Theodore Swanson (né Svensson). He was a Swedish American soldier. Her mother was Adelaide (née Klanowski). She had German, French, and Polish ancestry. Her family moved often because her father was in the US Army. For some of her childhood, she lived in Key West, Florida. There, she went to a Catholic convent school. She also lived in Puerto Rico. Here, she saw her first movies. ==Career== Her family moved to Chicago again when Swanson became adolescent. Gloria was soon hired by Essanay Studios as an extra. Movies were still new. Extras were usually very important. Her first role was a walk-on with Gerda Holmes. For this, she was paid $3.25. The studio soon gave her a job for $13.25 () per week. Swanson left school to work at the studio. In 1915, she co-starred in Sweedie Goes to College. Her future first husband, Wallace Beery also acted in this movie. In 1916, Swanson and her mother wet to California for her parts in Mack Sennett's Keystone Studios comedy shorts. At the studio, Swanson became popular with audiences. She was in many movies with Bobby Vernon. They were both in the The Danger Girl (1916), The Sultan's Wife (1917), and Teddy at the Throttle (1917). The director, Clarence G. Badger was by Swanson. He recommended her to the director Jack Conway. With Conway, Swanson played in Her Decision and You Can't Believe Everything in 1918. Her pay was soon increased to $15 a week. == Movies == Key Is a lost movie. ===Shorts=== Short subject Title Year Role Notes Studio/Distributor The Song of the Soul 1914 Unconfirmed The Misjudged Mr. Hartley 1915 Maid At the End of a Perfect Day 1915 Hands Bouquet to Holmes Uncredited, actual release date of January 26, 2015 The Ambition of the Baron 1915 Bit part Essanay Film starring Francis X. Bushman His New Job 1915 Stenographer Essanay Film Written and directed by Charlie Chaplin The Fable of Elvira and Farina and the Meal Ticket 1915 Farina, Elvira's Daughter Credited as Gloria Mae Essanay Film Sweedie Goes to College 1915 College Girl Wallace Beery played Sweedie in a series of shorts Essanay Film The Romance of an American Duchess 1915 Minor Role Uncredited Essanay Film The Broken Pledge 1915 Gloria Essanay Film A Dash of Courage 1916 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger Hearts and Sparks 1916 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger A Social Cub 1916 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger The Danger Girl 1916 Reggie's madcap sister Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger Haystacks and Steeples 1916 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger The Nick of Time Baby 1916 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger Teddy at the Throttle 1917 Gloria Dawn, His Sweetheart Uncredited with Bobby Vernon Keystone/Triangle directed by Clarence G. Badger Baseball Madness 1917 Victor Film/Universal Dangers of a Bride 1917 Keystone/Triangle directed by Clarence G. Badger Whose Baby? 1917 Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger The Sultan's Wife 1917 Gloria Keystone/Triangle with Bobby Vernon directed by Clarence G. Badger The Pullman Bride 1917 The Girl Paramount-Mack Sennett directed by Clarence G. Badger A Trip to Paramountown 1922 Herself Paramount ===Features=== Feature film credits of Gloria Swanson Title Year Role Notes Studio/Distributor Society for Sale 1918 Phylis Clyne Triangle Film Corporation Her Decision 1918 Phyllis Dunbar Triangle Film Corporation directed by Jack Conway You Can't Believe Everything 1918 Patricia Reynolds Triangle Film Corporation directed by Jack Conway Station Content 1918 Kitty Manning Triangle Film Corporation directed by Arthur Hoyt One reel survives Everywoman's Husband 1918 Edith Emerson Triangle Film Corporation directed by Gilbert P. Hamilton Shifting Sands 1918 Marcia Grey Triangle Film Corporation directed by Albert Parker The Secret Code 1918 Sally Carter Rand Triangle Film Corporation directed by Albert Parker Wife or Country 1918 Sylvia Hamilton Triangle Film Corporation directed by E. Mason Hopper Don't Change Your Husband 1919 Leila Porter Famous Players–Lasky/Paramount directed by Cecil B. DeMille For Better, for Worse 1919 Sylvia Norcross Famous Players–Lasky/Paramount directed by Cecil B. DeMille Male and Female 1919 Lady Mary Lasenby Famous Players–Lasky/Paramount directed by Cecil B. DeMille Why Change Your Wife? 1920 Beth Gordon Famous Players–Lasky/Paramount directed by Cecil B. DeMille Something to Think About 1920 Ruth Anderson Famous Players–Lasky/Paramount directed by Cecil B. DeMille The Affairs of Anatol 1921 Vivian Spencer – Anatol's Wife Famous Players–Lasky/Paramount directed by Cecil B. DeMille The Great Moment 1921 Nada Pelham/Nadine Pelham Famous Players–Lasky/Paramount directed by Sam Wood Under the Lash 1921 Deborah Krillet Famous Players–Lasky/Paramount directed by Sam Wood Don't Tell Everything 1921 Marian Westover Famous Players–Lasky/Paramount directed by Sam Wood Her Husband's Trademark 1922 Lois Miller Famous Players–Lasky/Paramount directed by Sam Wood Her Gilded Cage 1922 Suzanne Ornoff Famous Players–Lasky/Paramount directed by Sam Wood Beyond the Rocks 1922 Theodora Fitzgerald Famous Players–Lasky/Paramount directed by Sam Wood The Impossible Mrs. Bellew 1922 Betty Bellew Famous Players–Lasky/Paramount directed by Sam Wood My American Wife 1922 Natalie Chester Famous Players–Lasky/Paramount directed by Sam Wood Prodigal Daughters 1923 Swifty Forbes Famous Players–Lasky/Paramount directed by Sam Wood Bluebeard's 8th Wife 1923 Mona deBriac Famous Players–Lasky/Paramount directed by Sam Wood Hollywood 1923 Cameo role Famous Players–Lasky/Paramount Zaza 1923 Zaza Famous Players–Lasky/Paramount directed by Allan Dwan The Humming Bird 1924 Toinette Famous Players–Lasky/Paramount directed by Sidney Olcott A Society Scandal 1924 Marjorie Colbert Famous Players–Lasky/Paramount directed by Allan Dwan Manhandled 1924 Tessie McGuire Famous Players–Lasky/Paramount directed by Allan Dwan Her Love Story 1924 Princess Marie Famous Players–Lasky/Paramount directed by Allan Dwan Wages of Virtue 1924 Carmelita Famous Players–Lasky/Paramount directed by Allan Dwan Madame Sans-Gêne 1925 Madame Sans-Gêne Famous Players–Lasky/Paramount directed by Léonce Perret The Coast of Folly 1925 Joyce Gathway/Nadine Gathway Famous Players–Lasky/Paramount directed by Allan Dwan Stage Struck 1925 Jennie Hagen Famous Players–Lasky/Paramount directed by Allan Dwan The Untamed Lady 1926 St. Clair Van Tassel Famous Players–Lasky/Paramount directed by Frank Tuttle Fine Manners 1926 Orchid Murphy Famous Players–Lasky/Paramount directed by Richard Rosson The Love of Sunya 1927 Sunya Ashling Swanson Producing Corporation/United Artists directed by Albert Parker Sadie Thompson 1928 Sadie Thompson Gloria Swanson Productions/United Artists directed by Raoul Walsh Queen Kelly 1928 Kitty Kelly/Queen Kelly Joseph P. Kennedy/United Artists directed by Erich von Stroheim The Trespasser 1929 Marion Donnell Gloria Productions/United Artists directed by Edmund Goulding Released in two versions, one silent, and the other with sound What a Widow! 1930 Tamarind Brook Gloria Productions/United Artists directed by Allan Dwan Indiscreet 1931 Geraldine \"Gerry\" Trent Feature Productions, Inc. A DeSylva, Brown & Henderson Production directed by Leo McCarey Tonight or Never 1931 Nella Vago Feature Productions, Inc./United Artists directed by Mervyn LeRoy Perfect Understanding 1933 Judy Rogers Gloria Swanson British Productions, Ltd./United Artists directed by Cyril Gardner Music in the Air 1934 Frieda Hotzfelt Erich Pommer Productions/Fox Film directed by Joe May Father Takes a Wife 1941 Leslie Collier Osborne Marcus Lee/RKO Radio Pictures, Inc. directed by William Dorfman Sunset Boulevard 1950 Norma Desmond Charles Brackett/Paramount directed by Billy Wilder 3 for Bedroom \"C\" 1952 Ann Haven/costume designer Brenco Pictures Corporation/Warner Bros. directed by Milton H. Bren Nero's Weekend (aka Nero's Mistress) 1956 Agrippina Les Films Marceau and Titanus/Manhattan Films International directed by Steno Airport 1975 1974 Herself Universal Pictures directed by Jack Smight ===Television=== Television Title Year Role Notes The Gloria Swanson Hour 1948 Hostess Variety show The Peter Lind Hayes Show 1950 Herself Episode #1.1 sitcom show Hollywood Opening Night 1953 Episode: \"The Pattern\" Crown Theatre with Gloria Swanson 1954–1955 Hostess 25 episodes The Steve Allen Show 1957 Norma Desmond Episode #3.8 Straightaway 1961 Lorraine Carrington Episode: \"A Toast to Yesterday\" Dr. Kildare 1963 Julia Colton Episode: \"The Good Luck Charm\" Burke's Law 1963–1964 Various roles 2 episodes Kraft Suspense Theatre 1964 Mrs. Charlotte Heaton Segment: \"Who Is Jennifer?\" The Alfred Hitchcock Hour 1964 Mrs. Daniels Episode: \"Behind the Locked Door\" My Three Sons 1965 Margaret McSterling Episode: \"The Fountain of Youth\" Ben Casey 1965 Victoria Hoffman Episode: \"Minus That Rusty Old Hacksaw\" The Beverly Hillbillies 1966 Herself Episode: \"The Gloria Swanson Story\" The Eternal Tramp Special 1972 Narrator aka Chaplinesque, My Life and Hard Times The Carol Burnett Show 1973 Herself Episode #7.3 Killer Bees 1974 Madame Maria von Bohlen Television movie The Great Debate 1974 Herself Canadian interview show with James Bawden Hollywood 1980 Herself Television documentary == Awards and nominations == Awards and nominations of Gloria Swanson Year Award Result Category Film or series 1929 Academy Award rowspan=3 Best Actress Sadie Thompson 1931 Academy Award The Trespasser Best Actress 1951 Academy Award Sunset Boulevard Best Actress 1951 Golden Globe Award Best Actress – Motion Picture Drama 1964 Best TV Star – Female Burke's Law 1951 Italian National Syndicate of Film Journalists Best Actress – Foreign Film (Migliore Attrice Straniera) Sunset Boulevard 1951 Jussi Award Best Foreign Actress 1950 National Board of Review of Motion Pictures rowspan=2 Best Actress 1980 National Board of Review of Motion Pictures Career Achievement Award 1975 Saturn Award Special Award == References == === Sources === === Citations === * * * * * * * * * * * * * * * * * * * * * == Further reading == * * * * * == Other websites == === General === * * * * Gloria Swanson at the Women Film Pioneers Project * Glorious Gloria Swanson – Tribute site * Gloria Swanson's papers at the Harry Ransom Center at the University of Texas at Austin * Gloria Swanson photographs and bibliography === Interviews === * Gloria Swanson, video of The Mike Wallace Interview, April 28, 1957 * , August 3, 1970 Category:1899 births Category:1983 deaths Category:Deaths from heart failure Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American radio actors Category:American silent movie actors Category:Singers from Chicago Category:Actors from Chicago Category:Movie producers from Chicago Category:Golden Globe Award winning actors Category:Saturn Award winners",
 "title": "Gloria Swanson"
}