{
 "id": "365195",
 "text": "John Muir (21 April 1838 - 24 December 1914) was an influential Scottish-born American naturalist, author, environmental philosopher, glaciologist, writer, and early advocate of preservation of wilderness in the United States. His letters, essays, and books of his adventures in nature, especially in the Sierra Nevada mountains of California, have been read by millions of people. Among his many notable journeys throughout the wilderness, Muir traveled from the Upper Mississippi Basin to the Gulf of Mexico and kept a journal of his travels called 'A Thousand-Mile Walk'. Muir felt that the national parks and forests needed to be preserved and some resources which should be off-limits to industrial use.John Muir. (n.d.). In Encyclopedia Britannica. His activism helped to preserve the Yosemite Valley, Sequoia National Park and many other wilderness areas throughout the United States. He founded the Sierra Club, now one of the most important conservation organizations in the United States. In 1867, when he was 29, Muir was temporarily blinded in an accident in an Indianapolis sawmill, when his right cornea was pierced by a stray file.Ten Cool Things About John Muir at Tree Hugger.com In 1903, John Muir and the former U.S president Theodore Roosevelt went on a three-night camping trip. This trip later shaped the way president’s thoughts and perceptions towards nature, and in turn, result in policies that were put in place in favour of the preservation of nature. One of such is the Yosemite Recession Bill in 1906, which put Mariposa Grove of Giant Sequoias under federal protection and by extension, part of Yosemite National Park. A total of five national parks, fifty-five national bird sanctuaries and wildlife refuges, 150 national forests were signed into existence throughout Theodore Roosevelt’s presidency, indicative of how John’s passion for nature rubbing off on the former president. One of the most well-known hiking trails in the U.S., the John Muir Trail, was named in his honor. Other places named in his honor are Muir Woods National Monument, Muir Beach, John Muir College, Mount Muir, Camp Muir and Muir Glacier. For his outstanding accomplishments in preserving America's environment, he is known to many as the \"Father of the National Parks\" and \"son of the wilderness\". ==References== ==Other websites== * John Muir Exhibit by the Sierra Club; includes a detailed chronology. * John Muir Global Network * John Muir National Historic Site from National Park Service * Friends of John Muir's Birthplace (formerly Dunbar's John Muir Association) Scotland * John Muir's Birthplace, John Muir Birthplace Trust Scotland * John Muir Trust Scotland * Canadian Friends of John Muir (CFJM) website * John Muir Project Protecting Federal Public Forest Lands * Access Adventure Founded by Muir's grandson Category:1838 births Category:1914 deaths Category:Scottish writers Category:Naturalized citizens of the United States Category:American environmentalists Category:American botanists Category:American geologists Category:American naturalists Category:Engineers from California Category:Writers from California Category:People from East Lothian",
 "title": "John Muir"
}