{
 "id": "365132",
 "text": "America's Next Top Model, Cycle 19, called College Edition, is the nineteenth installment of America's Next Top Model. The first broadcast was on August 24, 2012. It is the first cycle that featured social media voting, challenge and judges score, and comeback series. The international destination for this cycle is Kingston, Jamaica. It also is the first cycle that featured an eliminated girl comeback the competition. Laura James from Cambridge won the competition. ==Episodes== Episode 1 casting episode Episode 2 *Best: Leila Goldkuhl *Worst: Destiny Strudwick & Jessie Rabideau *Eliminated: Jessie Rabideau Episode 3 *Quit: Maria Tucker *Best: Victoria Henley *Worst: Darian Ellis & Yvonne Powless *Eliminated: Darian Ellis Episode 4 *Best: Laura James *Worst: Destiny Strudwick & Yvonne Powless *Eliminated: Destiny Strudwick Episode 5 *Best: Nastasia Scott *Worst: Brittany Brown & Leila Goldkuhl *Eliminated: Leila Goldkuhl Episode 6 *Best: Laura James *Worst: Yvonne Powless & Victoria Henley *Eliminated: Yvonne Powless Episode 7 *Best: Nastasia Scott *Worst: Allyssa Vuelma & Laura James *Eliminated: Allyssa Vuelma Episode 8 *Best: Laura James *Worst: Victoria Henley & Brittany Brown *Eliminated: Brittany Brown Episode 9 *Returned: Leila Goldkuhl *Best: Nastasia Scott *Worst: Kiara Belen & Victoria Henley *Eliminated: Victoria Henley Episode 10 *Best: Leila Goldkuhl *Worst: Laura James & Kristin Kagay *Eliminated: Kristin Kagay Episode 11 *Best: Kiara Belen *Worst: Nastasia Scott & Laura James *Eliminated: Nastasia Scott Episode 12 *Final Three: Leila Goldkuhl, Kiara Belen & Laura James *Eliminated: Leila Goldkuhl & Kiara Belen *Winner: Laura James ==Contestants== Ages stated are at the time of the contest. Contestant Age Hometown School Outcome Jessie Rabideau 23 Speedway, Indiana University of Southern California 13th Maria Tucker 22 Las Cruces, New Mexico Harvard University 12th (Quit) Darian Ellis 22 Baton Rouge, Louisiana Louisiana State University 11th Destiny Strudwick 18 Ashtabula, Ohio Aveda Institute of Columbus 10th Yvonne Powless 20 Austin, Texas University of Texas at Austin 9th Allyssa Vuelma Fort Lauderdale, Florida Florida State University 8th Brittany Brown 21 Cambridge, New York Chandler-Gilbert Community College 7th Victoria Henley 18 Colquitt, Georgia Liberty University 6th Kristin Kagay 19 Jacksonville, Florida Florida State College at Jacksonville 5th Nastasia Scott 19 East Stroudsburg, Pennsylvania East Stroudsburg University 4th Leila Goldkuhl 20 Framingham, Massachusetts University of Rhode Island Eliminated in Episode 5 Returned in Episode 9 3rd Kiara Belen 22 Las Vegas, Nevada University of California, Irvine Runner- up Laura James 18 Gilbert, Arizona Paul Smiths College Winner ==The Comeback Series== The eliminated girls would have a chance to get back in the competition. It will be revealed on the ninth episode that one of them would be coming back. Leila Goldkuhl re-entered the competition. ==Summaries== ===Call-out order=== Tyra's Call-Out Order Order Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Order 1 2 3 4 5 6 7 8 9 10 11 12 1 Kristin Leila Victoria Laura Nastasia Laura Nastasia Laura Nastasia Leila Kiara Laura 2 Nastasia Nastasia Brittany Leila Laura Brittany Brittany Kristin Laura Kiara Leila Kiara 3 Laura Brittany Allyssa Brittany Kristin Allyssa Kristin Kiara Leila Nastasia Laura Leila 4 Allyssa Laura Leila Allyssa Kiara Kristin Victoria Nastasia Kristin Laura Nastasia 5 Destiny Kristin Laura Kiara Victoria Kiara Kiara Victoria Kiara Kristin 6 Kiara Kiara Nastasia Nastasia Yvonne Nastasia Laura Brittany Victoria 7 Leila Yvonne Kristin Victoria Allyssa Victoria Allyssa 8 Darian Allyssa Destiny Kristin Brittany Yvonne 9 Maria Victoria Kiara Yvonne Leila 10 Jessie Darian Yvonne Destiny 11 Brittany Maria Darian 12 Yvonne Destiny 13 Victoria Jessie : The contestant was eliminated : The contestant won the competition : The contestant was originally eliminated but returned after a fan voting * In episode 1, the pool of 30 girls was reduced to 13 who moved on to the main competition. However, this first call-out does not reflect their performance that first week. * In episode 3, Maria refused to participate in the photo shoot and quit the competition. She was therefore not present at panel. * In episode 9, Leila returned the competition. ===Photo shoot guide=== * Episode 1 photo shoot: Posing in bikinis (casting) * Episode 2 photo shoot: Taxidermy mounted head beauty shots * Episode 3 photo shoot: Black and white nude in a garden with Rob Evans * Episode 4 photo shoot: Apocalyptic zombies * Episode 5 photo shoot: Cheerleaders in the air * Episode 6 photo shoot: Steampunk fashion with an owl on a train * Episode 7 photo shoot: Gross and sticky situations in a motel * Episode 8 photo shoot: Prison mugshot * Episode 9 photo shoot: Love triangle while River rafting * Episode 10 photo shoot: Waterfall Warriors * Episode 11 photo shoot: Dream Come True fragrance in the beach * Episode 12 photo shoot: Nine West Campaign; Nylon Magazine ==Other websites== * Top Model ANTM at Pop Tower * ANTM Judges and Models on Wet Paint * Models at CW ==References== Category:America's Next Top Model",
 "title": "America's Next Top Model, Cycle 19"
}