{
 "id": "365358",
 "text": "The Little Mermaid is a 1989 American animated musical fantasy comedy movie produced by Walt Disney Feature Animation. The 28th movie made by the company, it is based on the fairy tale of the same name by Hans Christian Andersen. There is a message that said: \"Didn't you all learn from The Land Before Time? The movie was released into movie theaters on November 17, 1989, by Buena Vista Pictures, and re-released on November 17, 1997. Disney said that there would be a 3D re-release on September 13, 2011. This was cancelled on January 14, 2013 because the other Disney 3D re-releases were not as successful as Disney had hoped they would be. In January 1990, The Little Mermaid had three Academy Award nominations. The movie won two of the awards. They were for Best Song (\"Under the Sea\") and Best Score. The movie also earned four Golden Globe nominations. It won the awards for Best Song (\"Under the Sea\") and Best Score. The movie has a TV show, a sequel, and a prequel, which was the last direct- to-video sequel, because John Lasseter, a person who directed most Pixar movies, was nominated Disney's new chief creative officer. Lasseter also canceled all home video sequels that were in development (e.g.: The Aristocats II). A live-action adaption of the film was released on May 26, 2023. The Little Mermaid was the first Disney animated movie to be released on home video 1 year after it's theatrical release. == The story == The movie is about a mermaid princess named Ariel. She and her best friend, a fish named Flounder, explore the ocean looking for human things. They talk to a seagull named Scuttle who explains each thing that they find (but not accurately). Ariel does not like living in the sea and wants to live on land, where people are. One day she sees a ship of people and meets a prince named Eric. She saves his life from drowning. When Ariel's father, King Triton, finds out that she saved a human man from drowning, he destroys all the things she has kept in her grotto. After that, two eels named Flotsam and Jetsam tell her about a seawitch named Ursula. They tell her that Ursula can make her dreams come true. She follows them to Ursula's lair where she has magic potions. She uses her magic to turn Ariel into a human for exactly three days, in exchange for her voice. In order to stay human, she has to kiss Prince Eric, or else she will turn back into a mermaid and belong to Ursula. Eric shows her his palace and helps her adapt. On the second day, Sebastian the crab gathers the other sea animals together and they sing \"Kiss the Girl\", hoping to make Eric kiss Ariel. The plan almost works, but Flotsam and Jetsam cause the boat to sink. Ursula decides that enough is enough and uses Ariel's voice to turn herself into a beautiful girl named Vanessa. She casts a hypnotic spell on Eric to make him forget about Ariel. The next day, everyone finds out that Eric is getting married, and Ariel is very sad. Scuttle finds out that the girl Eric is marrying is Ursula in disguise. He tells Ariel and manages to create disruption, delaying the wedding. The seashell Ursula is wearing breaks and Ariel's voice comes back. She tries to kiss Eric, but the sun sets and she turns back into a mermaid. Ursula offers to let Ariel go if Triton takes her place. He accepts it and turns into a plant. With help from Sebastian and Flounder, Prince Eric and Ariel defeat Ursula. Ursula dies and all the plants she had turn back into mermaids. Finally King Triton gives Ariel her wish and she is allowed to marry Prince Eric. ==Cast== * Rene Auberjonois as Chef Louis, Eric's mad chef who attempts to cook Sebastian, but fails. * Christopher Daniel Barnes as Prince Eric, a human prince who is saved by Ariel and is determined to find and marry her. * Jodi Benson as Princess Ariel, the main protagonist of the movie, who is the 16-year-old mermaid princess of Atlantica who is fascinated with humans, especially Prince Eric; and as Vanessa, Ursula's human alter-ego and disguise. * Pat Carroll as Ursula, a sea witch who takes Ariel's voice in exchange for human legs, and is determined to ruin her attempts to get Eric to love her. * Paddi Edwards as Flotsam and Jetsam, Ursula's symbiotic and insidious pet green moray eels. * Buddy Hackett as Scuttle, a seagull who shares Ariel's fascination with humans and teaches her about \"human stuff.\" * Jason Marin as Flounder, Ariel's yellow tropical fish best friend. * Kenneth Mars as King Triton, Ariel's father and the ruler of Atlantica who is prejudiced towards humans. * Edie McClurg as Carlotta, Eric's maid. * Kimmy Robertson as Andrina, Arista, Adella, and Alana, four of Ariel's sisters (uncredited). * Will Ryan as Harold, a seahorse and Triton's herald. * Caroline Vasicek as Aquata and Attina, two more of Ariel's sisters (also uncredited). * Frank Welker as Max the Sheepdog. * Ben Wright as Sir Grimsby, Eric's loyal steward. Wright had played characters in previous Disney films like Roger Radcliffe in One Hundred and One Dalmatians and Rama in The Jungle Book. While this is his last film role, he died four months before the movie's release. * Samuel E. Wright as Sebastian, a red Trinidadian crab who serves as King Triton's advisor and court composer. He speaks Jamaican with an Jamaican accent. * Hamilton Camp as the Seadog * Debbie Shapiro Gravitte, Susan Boyd, Allan Davies, Donny Gerrard, Mitch Gordon, Linda Harmon, Walter S. Harrah, Phil Ingram, Luana Jackman, Edie Lehmann, Melissa MacKay, Guy Maeda, Gene J. Merlino, Gene Morford, Marilyn Powell, Gloria G. Prosper, Sally Stevens, Robert Tebow, Rob Trow, Jackie Ward and Bobbi White as Chorus * Bob Weil, Steve Bulen, Gail Farrell, Willie Greene Jr. and Bill Kanady as five Men * Ed Gilbert as the Male Merman * Charlie Adler as the Priest * Jack Angel, Philip Clarke and Patrick Pinney as three Sailors * Nancy Cartwright, Jennifer Darling and Mickie T. McGowan as three Female Mermaids * Anne Lockhart as the Washer Woman Additional voices were provided by Stephen J. Anderson, Tony Anselmo, Robert Bergen, Rodger Bumpass, Cam Clarke, Tim Curry, Baron Davis, Debi Derryberry, Bill Farmer, Jess Harnell, James Earl Jones, Oliver M. Johnston, Phil LaMarr, Sherry Lynn, Danny Mann, Lynn Dolin Mann, Arne B. Markussen, Mona Marshall, Laraine Newman, Kathleen O'Connor, Devika Parikh, Denise Pickering, Phil Proctor, Jan Rabson, Michael Redman, Steve Susskind, Brian Tochi, Joseph Turano, Jim Ward and Robert S. Zwirn. ==References== == References == == Other websites == * Category:1989 movies Category:1989 animated movies Category:1980s family movies Category:1989 romance movies Category:1980s musical movies Category:1989 comedy movies Category:Movies based on fairy tales Category:American family movies Category:American romance movies Category:American musical comedy movies Category:Movies about princesses Category:Movies about witchcraft Category:Movies set underwater Category:Movies set in palaces Category:1980s English-language movies Category:Movies that won the Best Original Song Academy Award Category:Movies composed by Alan Menken Category:Movies composed by Michael Kamen Category:The Little Mermaid (Disney) Category:United States National Film Registry movies",
 "title": "The Little Mermaid (1989 movie)"
}