{
 "id": "365331",
 "text": "Isla Fisher (; born 3 February 1976) is an Australian actress, and writer who has been in many movies and television shows. She was born in Muscat, Oman to Scottish parents. She moved to Perth, Western Australia when she was six. She starred in the movie Wedding Crashers. Isla Fisher became engaged to Sacha Baron Cohen in 2004. The couple married in 2010. They have two daughters and a son. == Filmography == ===Television=== Year Title Role Notes 1993 Bay Cove Vanessa Walker Series 1993 Paradise Beach Robyn Devereaux Barsby 2 episodes 1994 - 1997 Home and Away Shannon Reed 345 episodes 1999 Oliver Twist Bet Miniseries 2000 Sunburn Woman Episode: \"2.1\" 2000 Hearts and Bones Australian Barmaid Episode: \"I Need a Love Song\" 2001 Attila Cerca Miniseries 2002 BeastMaster Demon Manaka Episode: \"The Trial\" 2002 Random Acts of Intimacy Woman in Club Short 2004 Pilot Season Butterfly Episode: \"1.6\" 2010 Neighbors from Hell 3 episodes; voice 2011 Bored to Death Rose 2 episodes 2013 Arrested Development Rebel Alley Season 4; 9 episodes 2015 Sofia the First Button (voice) Episode: \"The Littlest Princess\" ===Film=== Year Title Role Notes 1997 Bum Magnet Emma Short film 1998 Furnished Room Jennie 2000 Out of Depth Australian Girl #1 2001 Swimming Pool Kim 2002 Dog Days Bianca 2002 Scooby-Doo Mary Jane 2003 The Wannabes Kirsty 2003 Dallas 362 Redhead 2003 Criminal Ways Kirsty 2004 I Heart Huckabees Heather 2005 Wedding Crashers Gloria Cleary 2005 London Rebecca 2006 Wedding Daze Katie 2007 The Lookout Luvlee 2007 Hot Rod Denise 2008 Definitely, Maybe April 2008 Horton Hears a Who! Dr. Mary Lou Larue Voice role 2009 Confessions of a Shopaholic Rebecca Bloomwood 2010 Burke and Hare Ginny Hawkins 2011 Rango Beans Voice role 2012 Bachelorette Katie 2012 Rise of the Guardians Tooth Fairy Voice role 2013 The Great Gatsby Myrtle Wilson 2013 Now You See Me Henley Reeves 2013 Life of Crime Melanie Ralston 2015 Visions Eveleigh 2015 Klovn Forever Herself Cameo 2016 Grimsby Jodie Figgs 2016 Nocturnal Animals Laura Hastings 2016 Keeping Up with the Joneses Karen Gaffney 2017 Strong Island Herself Documentary 2018 Tag Post-production The Beach Bum Moondog's Wife Filming ==Awards and nominations== Year Association Category Work Result 2006 MTV Movie Awards Best Breakthrough Performance Wedding Crashers 2006 Teen Choice Awards Choice Breakout (Female) 2006 Teen Choice Awards Choice Hissy Fit 2008 Elle Women in Hollywood Awards Icon Award 2009 Teen Choice Awards Choice Movie Actress: Comedy Confessions of a Shopaholic 2011 Alliance of Women Film Journalists Best Animated Female Rango 2013 AACTA Awards Best Supporting Actress The Great Gatsby 2014 Screen Actors Guild Outstanding Performance by an Ensemble in a Comedy Series Arrested Development 2016 AACTA Awards Trailblazer Award ==References== == Other websites == * Category:1976 births Category:Living people Category:Actors from Perth, Western Australia Category:Australian movie actors Category:Australian television actors",
 "title": "Isla Fisher"
}