{
 "id": "365486",
 "text": "Robert Francis Kennedy Jr. (born January 17, 1954) is an American politician, radio host, activist, and attorney in environmental law. Kennedy Jr. has been the 26th and current United States Secretary of Health and Human Services since 2025 during the second Donald Trump administration. He hosted the radio program Ring of Fire. He is also a vaccine hesitancy activist, and as a result, he has frequently promoted information regarding them. Kennedy Jr. was an Independent candidate for President of the United States in the 2024 presidential election. He ran for the Democratic nomination against President Joe Biden before becoming an Independent. He ended his campaign in August 2024 to support former President Donald Trump's campaign. In November 2024, President-elect Trump nominated Kennedy Jr. to serve as the United States Secretary of Health and Human Services. He was confirmed by the U.S. Senate in February 2025. ==Early life== Kennedy was born on January 17, 1954 in Washington, D.C., and raised in Massachusetts and Virginia. He was the third of eleven children to Ethel Skakel Kennedy and Robert F. Kennedy.Robert F. Kennedy Jr., The Huffington Post. He is the nephew of John F. Kennedy and Ted Kennedy. Kennedy studied at Harvard University, University of Virginia School of Law, and at Pace University School of Law. ==Legal career== Kennedy Jr. began his career as an assistant district attorney in Manhattan. In the mid-1980s, he joined two nonprofits focused on environmental protection. His work at Riverkeeper created a long-term environmental legal standards. Kennedy won legal battles against large corporate polluters. Kennedy Jr. became a professor of environmental law at Pace University School of Law in 1986. In 1987, Kennedy founded Pace's Environmental Litigation Clinic. He was a supervising attorney and co-director there until 2018. He founded the nonprofit environmental group Waterkeeper Alliance in 1999, serving as the president of its board until 2020. ==Environmental activism== In 2013, Kennedy helped the Chipewyan First Nation in fighting to protect their land from tar sands production. In February 2013, while protesting the Keystone XL Pipeline Kennedy, along with his son, Conor, was arrested for blocking a thoroughfare in front of the White House during a protest.Spear, Stefanie (February 13, 2013). \"Robert F. Kennedy, Jr., Bill McKibben, Michael Brune, Among Others Will Risk Arrest Today at White House to Stop Tar Sands, Keystone XL Pipeline\". EcoWatch. ==Anti-vaccination activism== Since 2005, Kennedy has supported anti-vaccine misinformation.Multiple sources: * * * * and public- health conspiracy theories,Multiple sources: * * * * * * including the false claim that vaccines cause autism. Kennedy has said that he supports medical freedom and does not believe the government should be involved with public health matters. He has been criticized by medical experts for his views. Since the COVID-19 pandemic, he has been a figure in COVID-19 vaccine misinformation in the United States. Many of his false health claims have been against Anthony Fauci, Bill Gates, and Joe Biden. Kennedy Jr. has written books including The Real Anthony Fauci (2021) and A Letter to Liberals (2022). ==2024 presidential campaign== In April 2023, Kennedy announced his plans to run for President of the United States, challenging President Joe Biden for the Democratic nomination in the 2024 election. In October 2023, he withdrew from the Democratic nomination to run as an Independent. In August 2024, Kennedy Jr. suspended his campaign and endorsed former President Donald Trump. ==U.S. Secretary of Health and Human Services (2025–present)== ===Nomination and confirmation hearings=== On November 14, 2024, President-elect Trump nominated Kennedy Jr. to be his Secretary of Health and Human Services for his second administration. In December 2024, more than 75 Nobel Laureates urged the U.S. Senate to vote against Kennedy Jr.'s nomination, saying he would \"put the public's health in jeopardy\". In January 2025, the Senate Committee on Finance and the Senate Health, Education, Labor, and Pensions Committee (HELP) held hearings on Kennedy's nomination. Senator Bernie Sanders, the ranking member of the HELP committee, was very critical of Kennedy during the committee hearing. On February 4, 2025, the Senate Committee on Finance voted 14–13 to forward Kennedy's nomination to a full Senate vote. Of the two committees Kennedy spoke before, only the Senate Finance was to vote on his nomination. On February 13, 2025, Kennedy was confirmed by the U.S. Senate as the United States secretary of health and human services by a vote of 52 to 48, with former Senate Republican Conference leader Mitch McConnell being the only Republican to vote against him. ===Tenure=== Kennedy Jr. was sworn into office on February 13, 2025 at the White House by Supreme Court Associate Justice Neil Gorsuch. He is the first independent or third-party presidential candidate to become a cabinet member after running for president outside of the two major parties. The next morning, agencies including the CDC and NIH were informed that about 5,200 newly hired federal health workers were to be fired that day. ==Personal life== Kennedy was married to Emily Ruth Black from 1982 until they divorced in 1994. He was married to Mary Richardson from 1994 until her death in 2012. In 2014, he married actress Cheryl Hines. He has six children. Kennedy is a Roman Catholic. Kennedy began having short-and-long- term memory loss in 2010. In 2012, he said that his neurological issues were because of \"a worm that got into my brain and ate a portion of it and then died\". He also said that he had mercury poisoning from eating a lot of tuna fish. In July 2024, Vanity Fair reported that in the late 1990s, when he was in his 40s, Kennedy sexually harassed Eliza Cooney, a 23-year-old part-time babysitter for his children. Kennedy Jr. called this story \"garbage\" and untrue. ==References== ==Other websites== * Pace Law School Profile * The Waterkeepers feature documentary (2000) * * Robert F. Kennedy Jr. on Politifact Category:1954 births Category:Living people Category:Kennedy family Category:Robert F. Kennedy Category:2024 United States presidential candidates Category:American radio personalities Category:American political activists Category:Writers from Washington, D.C. Category:American bloggers Category:Politicians from Washington, D.C. Category:Politicians from Los Angeles Category:Writers from Los Angeles Category:Democratic Party (United States) politicians Category:Independent politicians in the United States Category:Libertarian Party (United States) politicians Category:Politicians from Massachusetts Category:Writers from Massachusetts Category:Lawyers from Massachusetts Category:Lawyers from Los Angeles Category:Lawyers from Washington, D.C. Category:United States Secretaries of Health and Human Services",
 "title": "Robert F. Kennedy Jr."
}