{
 "id": "365493",
 "text": "This is a list of U.S. state insects. Forty-one of the fifty United States have selected state insects. State State insect Binomial nomenclature Image Year Alabama Monarch Butterfly Danaus plexippus 1989 Alaska Four-Spotted Skimmer Dragonfly Libellula quadrimaculata Arizona Two-Tailed Swallowtail (State Butterfly) Papilio multicaudata Arkansas European honey bee (State Insect) Apis mellifera 1973 Arkansas - State symbols and emblems Arkansas Diana Fritillary Butterfly (State Butterfly) Speyeria diana 2007 California California Dogface Butterfly Zerene eurydice 1972 Colorado Colorado Hairstreak Butterfly Hypaurotis crysalus Connecticut European mantis Mantis religiosa Delaware 7-spotted ladybug (State Bug) Coccinella septempunctata 1974 Delaware Code Title 29 ยง 309 Delaware Eastern Tiger Swallowtail (State Butterfly) Papilio glaucus 1999 Delaware Code Title 29 ยง 315 Georgia European honey bee (State Insect) Apis mellifera 1975State Symbols of Georgia, Georgia General Assembly Georgia Eastern Tiger Swallowtail (State Butterfly) Papilio glaucus 1988State Butterfly , Office of Secretary of State of Georgia website. Florida Zebra Longwing (State Butterfly) Heliconius charitonius 1996 Hawaii Kamehameha butterfly Vanessa tameamea 2009 Idaho Monarch Butterfly Danaus plexippus 1992 Illinois Monarch Butterfly Danaus plexippus 1975 Kansas European honey bee Apis mellifera Kentucky Viceroy Butterfly Limenitis archippus Louisiana European honey bee Apis mellifera Maine European honey bee Apis mellifera Maryland Baltimore Checkerspot Butterfly Euphydryas phaeton 1973 Massachusetts 7-spotted ladybug Coccinella septempunctata Minnesota Monarch Butterfly Danaus plexippus 2000 Mississippi European honey bee (State Insect) Apis mellifera 1980State Symbols , p. 4. Office of the Secretary of State of Mississippi. Retrieved 2008-03-29 Mississippi Spicebush Swallowtail (State Butterfly) Papilio troilus 1991 Missouri European honey bee Apis mellifera Montana Mourning Cloak Butterfly Nymphalis antiopa Nebraska European honey bee Apis mellifera New Hampshire 7-spotted ladybug (State Insect) Coccinella septempunctata 1977 State Animal, the New Hampshire Almanac, New Hampshire State Library. Retrieved 2008-03-29. New Hampshire Karner Blue Butterfly (State Butterfly) Lycaeides melissa (subspecies samuelis) 1992 New Jersey European honey bee Apis mellifera New Mexico Tarantula hawk wasp (State Insect) Pepsis formosa 1989Welcome to the New Mexico State Capitol (brochure), New Mexico Legislature. Retrieved 2008-03-29. New Mexico Sandia Hairstreak Butterfly (State Butterfly) Callophrys mcfarlandi 2003House Bill 13, 46th Legislature of the State of New Mexico . Retrieved 2008-03-29. New York 9-spotted ladybug Coccinella novemnotata 1989\"Symbols of New York State\" , New York State Department of Environmental Conservation. Retrieved 2008-03-30 North Carolina European honey bee (State Insect) Apis mellifera 1973 North Carolina Eastern Tiger Swallowtail (State Butterfly) Papilio glaucus 2012 State butterfly: Eastern tiger swallowtail (NCpedia) Ohio 7-spotted ladybug Coccinella septempunctata Oklahoma European honey bee (State Insect) Apis mellifera 1992Oklahoma Almanac , State Emblems (pp. 37-40) Oklahoma Black Swallowtail Butterfly (State Butterfly) Papilio polyxenes 1996 Oregon Oregon Swallowtail Butterfly Papilio oregonius Pennsylvania Pennsylvania firefly (State Insect) Photuris pennsylvanica 1974 South Carolina Carolina mantis (State Insect) Stagmomantis carolina 1988 South Carolina Eastern Tiger Swallowtail (State Butterfly) Papilio glaucus 1994The State Butterfly , South Carolina Legislature Online. Retrieved 2008-03-29 South Dakota European honey bee Apis mellifera Tennessee Common eastern firefly (State Insect) Photinus pyralis 1975State Symbols , Tennessee Department of State. Retrieved 2008-03-29 Tennessee 7-spotted ladybug (State Insect) Coccinella septempunctata 1975 Tennessee European honey bee (State Agricultural Insect) Apis mellifera 1990 Tennessee Zebra Swallowtail Butterfly (State Butterfly) Eurytides marcellus 1995 Texas Monarch Butterfly Danaus plexippus 1995 Utah European honey bee Apis mellifera 1983Utah State Insect - Honey Bee from pioneer.utah.gov \"Pioneer: Utah's Online Library\" page. Retrieved on 2008-09-08 Vermont European honey bee (State Insect) Apis mellifera 1978 Vermont Monarch Butterfly (State Butterfly) Danaus plexippus 1987 Virginia Tiger Swallowtail Butterfly Papilio glaucus Washington Green Darner Dragonfly Anax junius 1997 West Virginia European honey bee (State Insect) Apis mellifera 2002 Page 21 (547). West Virginia Monarch Butterfly (State Butterfly) Danaus plexippus 1995 Wisconsin European honey bee Apis mellifera 1977 == References == Category:Insects Insects Category:Lists of animals of the United States",
 "title": "List of U.S. state insects"
}