{
 "id": "365502",
 "text": "This is a list of official U.S. state tartans: State Tartan Date Use Pattern Alabama 2001Scottish Tartans Authority record number 3033 Alabama State Tartanhttp://www.tartanregister.gov.uk/imageCreation.aspx?ref=35&width;=750&height;=750 Y6 N24 O24 G32 K18 W16 R44 Alaska 2001 Retrieved on 2011-01-30 Alaska Flag Tartan Arizona 1995Clans/Genealogy Retrieved on 2007-11-20 Arizona State Tartan Arkansas 2001 Arkansas Traveler Tartan Y2 G36 R10 Y18 G12 B16 G8 B10 G18 Arkansas 2001 Natural State Tartan G8 Bk12 G12 R24 G48 W4 G12 Retrieved on 2007-09-27 California 2001History and Culture - State Symbols Retrieved on 2007-11-20 California State Tartan Colorado March 3, 1997Colorado State Archives Symbols & Emblems Retrieved on 2007-11-20 Colorado State Tartan [Y/6] R4 MB26 K32 G4 W4 Lv4 W4 [G/44] Connecticut CT Tartan 1995CT.gov: The State Tartan Retrieved on 2010-12-26 State Tartan B10 GY2 W1 GY5 G8 Y1 G2 R1 G8 GY8 B10 Florida Georgia 1997 Georgia State Tartan G72 B4 G4 B4 G6 B24 A20 R40 Hawaii 2008State Of Hawaii - Legislative Archive - HCR81 Retrieved on 2010-11-04 Hawaii State Tartan A8 R4 Y4 A48 E16 GN40 Y4 R6Scottish Tartan Authority - ITI# 5163 Retrieved on 2010-11-04 Iowa 2004 Retrieved on 2008-03-10 Iowa State Tartan and Iowa State Dress Tartan Kentucky Commonwealth of Kentucky Tartan Louisiana Maine Maine Official State Tartan Massachusetts Bay State Tartan 2002 Retrieved on 2010-11-12 M.G.L. Ch. 2, ยง52 Michigan 2008 2008 Senate Bill 1208 BG18* W2 BG8 W2 T8 DG2 T4 DG24 DR4 DG4* Minnesota Minnesota Tartan Nevada New Hampshire 1995 State Tartan of New Hampshire G56 Bk2 G2 Bk12 W2 Bk12 P2 Bk2 P8 R6 P28 Retrieved on 2007-09-26 Retrieved on 2007-09-26 New Mexico New Mexico State Tartan R4 G24 B4 G16 B36 Y8 R4 Y4 North Carolina 1991 Retrieved on 2007-09-27 Retrieved on 2007-09-27 Carolina Tartan R64 A28 K32 Y6 K6 W8 K8 R4 G56 R26 K8 R8 W4 Ohio 2009 128th General Assembly - Senate Resolution 32 1983 Scottish Tartans World Register Ohio State Tartan Oklahoma Rhode Island July 20, 2000 The Official Rhode Island Tartan South Carolina 2002 Carolina Tartan Retrieved on 2007-09-27 R64 A28 K32 Y6 K6 W8 K8 R4 G56 R26 K8 R8 W4 Retrieved on 2007-09-27 Texas 1989 Texas Bluebonnet Tartan G4 R2 B16 W2 R2 W2 LB16 W2 LB16 W2 Y1 Utah 1996Utah State Symbols - Centennial Tartan from pioneer.utah.gov \"Pioneer - Utah's Online Library\" page. Retrieved on 2008-09-08 Utah Centennial Tartan W2 B6 R6 B4 R6 G18 R6 W4 Virginia Virginia Quadricentennial Tartan Washington 1988 Washington state tartan West Virginia 2008 Official Tartan of the State of West Virginia GO8 G8 B16 G16 A12 SCR54 W2 K6 SCR54 G16 SCR16 B16 G8 GO8Scottish Tartan Authority - ITI# 7631 Retrieved on 2010-11-18 Wisconsin 2008 Wisconsin TartanWisconsin Statutes - Chapter 1 Retrieved on 2010-07-27 B22 R6 B4 N6 K24 HG40 Y4 K24 B22 RY6Scottish Tartan Authority - ITI#5882 Retrieved on 2010-11-18 ==References== Tartans",
 "title": "List of U.S. state tartans"
}