{
 "id": "365509",
 "text": "This is a list of U.S. state trees. State State tree Binomial nomenclature Image Year Alabama Longleaf Pine Pinus palustris 1949 clarified 1997 Alaska Sitka Spruce Picea sitchensis Arizona Blue Palo Verde Parkinsonia florida 1954 Arkansas Pine Pinus California Coast Redwood and Giant Sequoia Sequoia sempervirens and Sequoiadendron giganteum Colorado Colorado Blue Spruce Picea pungens Connecticut White Oak See also: Charter Quercus alba 1947 District of Columbia Scarlet Oak Quercus coccinea Delaware American Holly Ilex opaca Florida Sabal Palm Sabal palmetto Georgia Southern Live Oak Quercus virginiana Guam Ipil Intsia bijuga Hawaii Candlenut Tree Aleurites moluccana Idaho Western White Pine Pinus monticola Illinois White Oak Quercus alba Indiana Tulip Tree Liriodendron tulipifera 1931 Ind. Code §1-2-7-1 (1931) Iowa Bur Oak Quercus macrocarpa Kansas Eastern Cottonwood Populus deltoides Kentucky Tulip-tree Liriodendron tulipifera http://www.lrc.ky.gov/krs/002%2D00/095.pdf KRS002.095 Louisiana Bald Cypress Taxodium distichum Maine Eastern White Pine Pinus strobus 1945 Maryland White Oak See also: Wye Oak Quercus alba Massachusetts American Elm Ulmus americana 1941 Michigan Eastern White Pine Pinus strobus 1955 Minnesota Red Pine Pinus resinosa Mississippi Southern Magnolia Magnolia grandiflora Missouri Flowering Dogwood Cornus florida Montana Ponderosa Pine Pinus ponderosa Nebraska Eastern Cottonwood Populus deltoides Nevada Single-leaf Pinyon and Bristlecone pine Pinus monophylla and Pinus longaeva New Hampshire American White Birch Betula papyrifera 1947 New Jersey Northern Red Oak Quercus rubra New Mexico Piñon Pine Pinus edulis 1949 New York Sugar Maple Acer saccharum North Carolina Pine Pinus 1963 North Dakota American Elm Ulmus americana 2007 Northern Marianas Flame Tree Delonix regia Ohio Ohio Buckeye Aesculus glabra Oklahoma Eastern Redbud Cercis canadensis Oregon Douglas-fir Pseudotsuga menziesii Pennsylvania Eastern Hemlock Tsuga canadensis Puerto Rico Silk-cotton Tree Ceiba pentandra Rhode Island Red Maple Acer rubrum 1964 South Carolina Sabal Palm Sabal palmetto 1939 South Dakota Black Hills Spruce Picea glauca var. densata 1947 Tennessee Tulip-tree Liriodendron tulipifera Texas Pecan Carya illinoinensis 1919 Utah Blue Spruce Picea pungens 1933Utah State Tree - Blue Spruce from pioneer.utah.gov \"Pioneer - Utah's Online Library\" page. Retrieved on 2008-09-08 Vermont Sugar Maple Acer saccharum 1949 Virginia Flowering dogwood Cornus florida Washington Western Hemlock Tsuga heterophylla West Virginia Sugar Maple Acer saccharum Wisconsin Sugar Maple Acer saccharum 1949 Wyoming Plains Cottonwood Populus deltoides subsp. monilifera ==References== Trees Category:Trees Category:Lists of plants",
 "title": "List of U.S. state trees"
}