{
 "id": "365740",
 "text": "Craig Theodore Nelson (born April 4, 1944) is an American actor, who is known for his roles as Hayden Fox in Coach and as Mr. Incredible in The Incredibles. He has won an Emmy Award. ==Life== Nelson was born on April 4, 1944 in Spokane, Washington.Craig T. Nelson Biography (1944-) He studied at the University of Arizona and at Central Washington University. He was married to Robin Nelson until they divorced in 1978. He is now married to Doria Cook since 1987. ==Filmography== ===Film=== Year Title Role Notes 1971 The Return of Count Yorga Sgt. O'Connor 1973 Scream Blacula Scream Sarge 1974 Flesh Gordon The Monster (voice) Uncredited 1979 ...And Justice for All Frank Bowers 1980 Stir Crazy Deputy Ward Wilson 1980 The Formula Geologist #2 1980 Where the Buffalo Roam Cop on Stand 1980 Private Benjamin Capt. William Woodbridge 1982 Poltergeist Steven Freeling 1983 Man, Woman and Child Bernie Ackerman 1983 Silkwood Winston 1983 All the Right Moves Nickerson 1983 The Osterman Weekend Bernard Osterman 1984 The Killing Fields Major Reeves 1986 Poltergeist II: The Other Side Steven Freeling 1987 Rachel River Marlyn Huutula 1988 Action Jackson Peter Dellaplane 1988 Me and Him Peter Aramis 1989 Born on the Fourth of July Marine Officer 1989 Red Riding Hood Sir Godfrey / Percival 1989 Turner & Hooch Chief Howard Hyde 1989 Troop Beverly Hills Fred Nefler 1996 Ghosts of Mississippi Ed Peters 1996 I'm Not Rappaport The Cowboy 1997 The Devil's Advocate Alexander Cullen 1997 Wag the Dog Senator John Neal Uncredited 2000 The Skulls Litten Mandrake 2001 All Over Again Cole Twain 2004 The Incredibles Bob Parr / Mr. Incredible (voice) 2005 The Family Stone Kelly Stone 2007 Blades of Glory Coach 2009 The Proposal Joe Paxton 2010 The Company Men James Salinger 2011 Soul Surfer Dr. Robinsky 2015 Get Hard Martin Barrow 2016 Gold Kenny Wells 2018 Book Club Bruce 2018 Incredibles 2 Bob Parr / Mr. Incredible (voice) ===Television=== Year Title Role Notes 1973 The Mary Tyler Moore Show Charlie Episode: \"Mary Richards and the Incredible Plant Lady\" 1980 The White Shadow Father Phil Episode: \"A Christmas Story\" 1982 Chicago Story Kenneth A. Dutton 13 episodes 1984–1985 Call to Glory Col. Raynor Sarnac 23 episodes 1989–1997 Coach Coach Hayden Fox 198 episodes Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series Nominated—Golden Globe Award for Best Actor – Television Series Musical or Comedy (1992–95) Nominated—Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series (1990–91) Nominated—Viewers for Quality Television Award for Best Actor in a Quality Comedy Series 1992 Rugrats Frank The SWAT Officer Episode: \"Garage Sale\" 1999 To Serve and Protect Tom Carr 2 episodes 2000–2004 The District Chief Jack Mannion 89 episodes Nominated—Prism Award for Best Actor in a Drama Series Nominated—Satellite Award for Best Actor – Television Series Drama 2007 My Name Is Earl Warden Jerry Hazelwood 4 episodes 2008–2009 CSI: NY Robert Dunbrook 3 episodes 2009 Monk Judge Ethan Rickover 2 episodes 2010–2015 Parenthood Zeek Braverman 91 episodes Prism Award for Best Actor in a Drama Series Nominated—Critics' Choice Television Award for Best Supporting Actor in a Drama Series 2013 Hawaii Five-0 Tyler Cain Episode: \"He welo 'oihana\" 2015 Grace and Frankie Guy 5 episodes 2016 Coach Hayden Fox Upcoming series ===Theatre=== Year Title Role Notes 1983–1984 Friends Harold (Okie) Peterson 1998 Ah, Wilderness! Nat Miller ===Video games=== Year Title Role Notes 2004 The Incredibles Bob Parr/Mr. Incredible (voice) 2012 Kinect Rush: A Disney- Pixar Adventure Bob Parr/Mr. Incredible (voice) 2013 Disney Infinity Bob Parr/Mr. Incredible (voice) ==References== ==Other websites== * * Category:1944 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Emmy Award winning actors Category:Actors from Spokane, Washington",
 "title": "Craig T. Nelson"
}