{
 "id": "3658",
 "text": "Alberta is a province in western Canada. It is bounded by the provinces of British Columbia on the west, Saskatchewan on the east, the US state of Montana on the south and the Northwest Territories to the North. Alberta is the fourth largest Canadian province with an area of .There are also two larger parts of Canada called Nunavut and Northwest Territories. However, Nunavut and Northwest Territories are territories, not provinces. Alberta has around 4,960,097 people living there, making it the fourth most populous province in Canada. The capital of Alberta is Edmonton lying near the middle of Alberta. The city of Calgary, Alberta’s other major centre is located about 300 kilometres to the south of Edmonton. ==History == Canada became a country in 1867. It was much smaller than it is now, and did not include the parts of the country to the west. From 1670 to 1870, parts of Alberta were included in \"Rupert's Land\", land owned by the Hudson’s Bay Company in support of its trading monopoly over a vast area of Canada and parts of the United States. Northern part of Alberta was part of the what was then called \"Northwestern Territories\". Alberta was made a province of Canada in 1905, at the same time as Saskatchewan. The Aboriginal peoples of Canada are referred to as First Nations or by the Name of their Nation. Mixed (European/Aboriginal) People are called Metis. ==Weather == Alberta is very cold in the winter and has a lot of snow during the very cold season. There is a dry part of Alberta in the south. == Work in Alberta == Alberta has a huge amount of oil (in the Athabasca Oil Sands) and natural gas. There are also a lot of farms in Alberta. Farmers grow several different types of crops Farmers mainly grow wheat. There are also a lot of cows on Alberta farms, and Alberta beef is exported. ==References== == Other websites == * Government of Alberta website * * Provincial Archives of Alberta website * Travel Alberta * Alberta Encyclopedia * CBC Digital Archives—Striking Oil in Alberta * CBC Digital Archives—Electing Dynasties: Alberta Campaigns 1935 to 2001 * CBC Digital Archives—Alberta @ 100 Category:1905 establishments in North America Category:1900s establishments in Canada",
 "title": "Alberta"
}