{
 "id": "365954",
 "text": "Robin Hood is a 1973 American animated musical adventure comedy movie. It was produced by Walt Disney Productions. It was first released in the United States on November 8, 1973. It is the 21st Disney animated movie. It is based on the legend of Robin Hood, but uses anthropomorphic animals instead of people. The story follows the adventures of Robin Hood, Little John and the inhabitants of Nottingham as they fight against the excessive taxation of Prince John, and Robin Hood wins the hand of Maid Marian. == Plot == The movie is narrated by the rooster Alan-a-Dale. He explains that Robin Hood and Little John live in Sherwood Forest, stealing from the rich and giving to the poor townsfolk of Nottingham. The Sheriff of Nottingham and his posse often try to catch them but fail every time. Meanwhile, Prince John and his assistant Sir Hiss, arrive in Nottingham. Sir Hiss hypnotized Prince John's brother King Richard to go off on the Crusades, allowing Prince John to take the throne. Unfortunately, the prince is greedy and immature, even sucking his thumb whenever his mother is mentioned. Robin and Little John rob Prince John by disguising themselves as fortune tellers. This results in the prince putting a bounty on their heads and making the Sheriff his personal tax collector. The Sheriff taxes Friar Tuck and a family of rabbits. Robin gives back some money to the rabbits, giving his hat and archery kit to the young rabbit Skippy for his birthday. Skippy and his friends test out the archery kit, but Skippy fires an arrow into the grounds of Maid Marian's castle. The children sneak inside, meeting Maid Marian and her attendant Lady Kluck. Maid Marian reveals she and Robin were childhood sweethearts but they have not seen one another for years. Friar Tuck visits Robin and Little John, explaining that Prince John is hosting an archery tournament, and the winner will get a kiss from Maid Marian. Robin agrees to participate in the tournament disguised as a stork while Little John disguises himself as the Duke of Chutney to get near Prince John. Sir Hiss discovers Robin's identity but is trapped in a barrel of ale by Friar Tuck and Alan-a-Dale. Robin wins the tournament, but Prince John exposes him and has him arrested for execution despite Maid Marian's pleas. Little John threatens Prince John leading to a fight between Robin, Little John, Maid Marian, Lady Kluck and Prince John's soldiers. In the forest, Robin and Maid Marian fall in love again as the townsfolk mock Prince John, describing him as the \"Phony King of England\". Angering by the insult, Prince John triples the taxes, imprisoning most of the townsfolk who cannot pay their taxes. The Sheriff visits Friar Tuck's church to steal from the poor box, angering Friar Tuck who is arrested too. Prince John plans to hang Friar Tuck to lure in Robin and kill him. Robin and Little John sneak in, with Little John managing to free all of the prisoners while Robin steals Prince John's taxes, but Sir Hiss awakens to find Robin fleeing. The Sheriff corners Robin after he is forced to return to rescue a straggler, setting fire to Prince John's castle and causing Robin to leap from a tower into the moat below. Little John and Skippy watch as the moat is pelted with arrows and Robin seems to be shot and drowned, but he emerges unharmed after using a reed as a breathing tube. Prince John is saddened and driven into a blind rage when Sir Hiss points out his mother's castle is on fire. Later, King Richard returns to England, placing his brother and his cohorts under arrest. He allows Robin and Maid Marian to be married and leave Nottingham with Little John and Skippy in tow. == Cast == * Brian Bedford as Robin Hood (a fox) * Monica Evans as Maid Marian (a vixen) * Phil Harris as Little John (a bear) * Roger Miller as Alan- a-Dale (a rooster) * Andy Devine as Friar Tuck (a badger) * Peter Ustinov as Prince John and King Richard (lions) * Terry-Thomas as Sir Hiss (a snake) * Carole Shelley as Lady Kluck (a chicken) * Pat Buttram as The Sheriff of Nottingham (a wolf) * George Lindsey and Ken Curtis as Trigger and Nutsy, respectively (vultures) * John Fiedler and Barbara Luddy as Friar Tuck's Sexton and his wife, respectively (church mice) * Billy Whitaker, Dana Laurita and Dori Whitaker as Skippy, Sis, and Tagalong, respectively (rabbits) * Richie Sanders as Toby (a turtle) * Barbara Luddy as Mother Rabbit * Candy Candido as the Captain of the Guard (a crocodile) * J. Pat O'Malley as Otto (a dog) == Release == The movie premiered at the Radio City Music Hall on November 8, 1973. The movie was re-released on March 26, 1982. It was released to videocassette on December 3, 1984, becoming the first installment of the Walt Disney Classics home video line. Disney thought the idea of releasing any of its animated classics (known as the \"untouchables\") might threaten future theatrical release money. However, Robin Hood was viewed as the first choice because it was not held in such high regard as some of the other titles, and was less likely to get another theatrical release as its 1982 reissue proved to be disappointing. It was later re-released in 1991 (as part of the Walt Disney Classics line) and 1994 (as part of the Walt Disney Masterpiece Collection line). In January 2000, Walt Disney Home Video launched the Gold Classic Collection, with Robin Hood re-released on VHS and DVD on July 4, 2000. The DVD had the movie in its 1.33:1 aspect ratio, and was accompanied with special features including a trivia game and the cartoon short \"Ye Olden Days\". The remastered \"Most Wanted Edition\" DVD (\"Special Edition\" in the UK) was released in 2006. It featured a deleted scene/alternate ending, as well as a 16:9 matted transfer to represent its original theatrical screen ratio. On August 6, 2013, the movie was released as the 40th Anniversary Edition on a Blu-ray/DVD/Digital Copy combo pack. == References == == Other websites == * * * * (Dead link) * Category:1973 comedy movies Category:1973 musical movies Category:1970s animated movies Category:American buddy comedy movies Category:American musical comedy movies Category:American animated romance movies Category:Disney animated movies Category:Movies set in England Category:Movies set in forests Category:Movies set in castles Category:Movies composed by George Bruns Category:Movies directed by Wolfgang Reitherman Category:Adventure comedy movies Category:1970s American adventure movies Category:Movies about royalty Category:1970s English-language movies Category:Robin Hood",
 "title": "Robin Hood (1973 movie)"
}