{
 "id": "365957",
 "text": "The Amazing World of Gumball is a cartoon comedy series. It was created by Ben Bocquelet for the Cartoon Network. Since its debut on May 3, 2011, more than all 240 episodes (in total) of the series have been broadcast. The series ended on . Cartoon Network renewed the series for a sixth season. On September 6, 2016, series creator Ben Bocquelet announced that he would be departing production of Gumball upon completing the sixth season, but production will continue without him. However, on October 7, 2018, he retweeted a tweet with an article saying that the sixth season is the final season. A follow up article clarifyed that there could still be more seasons. In November 2018, it was revealed that Ben Bocquelet had finished the show and that the production of the series was completed.https://twitter.com/benbocquelet/status/1064250926142287872 Later in November 2019, a six-episode miniseries titled “Darwin's Yearbook” was announced. ==Series overview== ==Episodes== ===Season 1 (2011-12)=== The Amazing World of Gumball season 1 episodes No. in series No. in season Title Written by Storyboarded by Original air date Prod. code ===Season 2 (2013-14)=== The Amazing World of Gumball season 2 episodes |- ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=5% | No. in series ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=5% | No. in season ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=8% | Title ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=40% | Written by ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=25% | Storyboarded by ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=10% | Original air date ! style=\"background: #EDCC26; color: black;\" width=5% | Production code ! scope=\"col\" style=\"background: #EDCC26; color: black;\" width=10% | U.S. viewers (in millions) |- No. in series No. in season Title Written by Storyboarded by Original air date Production code U.S. viewers (in millions) ===Season 3 (2014-15)=== ===Season 4 (2015-16)=== The Amazing World of Gumball season 4 episodes |- ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=5% | No. in series ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=5% | No. in season ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=11% | Title ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=43% | Written by ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=16% | Storyboarded by ! scope=\"col\" style=\"background: #CD6EFF; color: black;\" width=10% | Original air date ! style=\"background: #CD6EFF; color: black;\" width=5% | Production code No. in series No. in season Title Written by Storyboarded by Original air date Production code ===Season 5 (2016-17)=== The Amazing World of Gumball season 5 episodes No. in series No. in season Title Written by Storyboarded by Original air date Production code ===Season 6 (2018-19)=== The Amazing World of Gumball season 6 episodes No. in series No. in season Title Written by Storyboarded by Original air date Production code ==Darwin's Yearbook (2019)== A six-episode special called Darwin's Yearbook aired on Cartoon Network in December 2019. The miniseries features Darwin attempting to complete Elmore Junior High's yearbook by examining who he thinks should fill up the best spot. The miniseries is essentially a collection of clip show episodes. No. in series Title Original air date Production code ==Notes== ==References== Amazing World of Gumball, The Category:Cartoon Network-related lists",
 "title": "List of The Amazing World of Gumball episodes"
}