{
 "id": "366241",
 "text": "Mycobacterium is a genus of bacteria, with about 190 species.The genus includes pathogens known to cause serious diseases in mammals, including tuberculosis (Mycobacterium tuberculosis) and leprosy (Mycobacterium leprae). Mycobacteria are immobile and are rod-shaped. They are mostly found in water, soil, and dust. The colony colour ranges from white to orange to pink (Iivanainen, 1999). Most mycobacteria need oxygen to survive (aerobic organisms), although some species require very little amounts of oxygen, less than what is present in the air, are called (microaerophilic bacteria) (Falkinham, 1996). == Categorization == Mycobacteria can be categorized into three groups: 1.Mycobacterium tuberculosis complex – causative pathogen of tuberculosis 2.Non-tuberculosis mycobacteria (NTM) 3.Mycobacterium leprae – causative pathogen of leprosy == Characterstics == The Greek prefix myco means \"fungus\". When they are cultured on the surface of liquids, mycobacteria growth is similar to that of moulds, a kind of fungus.James H. Kerr and Terry L. Barrett, \"Atypical mycobacterial diseases\", Military Dermatology Textbook, p. 401. Mycobacteria have an external membrane, contain no layer that lies outside the bacteria (capsules). The special characteristic about all Mycobacterium species is having a thicker cell wall than many other bacteria, which is to maintain the shape of the plasma membrane. The cell wall is waxy and rich in specific types of fats (lipids), called mycolic acids or mycolates. Mycobacterium tuberculosis can occupy different environments. However, they grow so slowly that their duplication time exceeds 18 hours. Surprisingly, mycobacterium leprae have the longest doubling time of all bacteria. In comparison, bacteria E. coli only takes as short as 20 minutes to double. == Clinical Manifestation == Mycobacteria can colonize their hosts without the hosts showing any adverse signs. Many people around the world have infections of M. tuberculosis without showing any signs of it. Mycobacterial infections are difficult to treat. The organisms are tough due to their cell wall.which is neither truly Gram negative nor positive In addition, they are naturally resistant to a number of antibiotics that disrupt cell-wall building, such as penicillin. With their unique cell wall, they can survive long exposure to acids, alkalis, detergents, oxidative bursts, lysis by complement, and many antibiotics. Mycobacterial infections are complex diseases and are more common in individuals with weakened immune systems, for example people undergoing treatment for cancer or that are HIV positive. One third of the planet’s population currently carries the M. tuberculosis bacteria. However, only 25 per cent will develop disease. They can cause tuberculosis, nontuberculous mycobacteria (NTM) pulmonary infections, other localized NTM or disseminated infections, leprosy, and chronic ulcers (Buruli ulcer). Most mycobacteria are susceptible to the antibiotics clarithromycin and rifamycin, but antibiotic-resistant strains have emerged. == References == 6\\. Antonini, J. (2014) \"Sarcoidosis\", Reference Module in Biomedical Sciences. Available at: 7\\. Rice, L. and Jung, M. (2018) \"Neutrophilic Leukocytosis, Neutropenia, Monocytosis, and Monocytopenia\", Hematology, pp. 675–681. Available at: Category:Bacteria",
 "title": "Mycobacterium"
}