{
 "id": "366243",
 "text": "Thutmose II (sometimes Thutmosis, or Tuthmosis II, which means Born of Thoth) was the fourth Pharaoh of the Eighteenth dynasty of Egypt. He built some small monuments and began two small military campaigns but did little else during his rule and was probably strongly influenced by his wife, Hatshepsut. He ruled from 1493 BC to 1479 BC. Thutmose II's body was found in the Deir el- Bahri Cache above the Mortuary Temple of Hatshepsut with many other pharaohs. It can be viewed today in the Egyptian Museum in Cairo. ==Family== Thutmose II was the son of Thutmose I and a minor wife, Mutnofret. He may married his fully royal half-sister, Hatshepsut, in order to secure his kingship. His armies stopped rebellions in Nubia and the Levant and defeated a group of nomadic Bedouins. But these campaigns were led by the king's Generals, and not by Thutmose II himself. This is often seen as evidence that Thutmose II was still a child at his when he became king. Thutmose II fathered Neferure with Hatshepsut, and a male heir, the famous Thutmose III, by a lesser wife named Iset before his death. Some archaeologists believe that Hatshepsut was the real power behind the throne during Thutmose II’s rule. Domestic and foreign policies were similar and she claimed that her father wanted them to rule together. She is pictured in several scenes from a Karnak gateway dating to Thutmose II's reign, both together with her husband and alone.Betsy Bryan \"The 18th Dynasty before the Amarna Period\" in The Oxford History of Ancient Egypt, Oxford University Press, 2000, p.236 She later had herself crowned Pharaoh several years into the rule of her husband's young successor Thutmose III. \"The queen's agents actually replaced the boy king's name in a few places with her own cartouches\" on the gateway.Betsy Bryan, p.236 The ancient historian Manetho wrote that Thutmose II ruled for 13 years. This figure is highly disputed among scholars. Some modern historians believe he ruled for only three years.J. Von Beckerath, Chronologie des Pharaonischen Ägypten, MÄS 46 (Philip von Zabern, Mainz: 1997), p.201 ==Achievements== Most pharaohs are remembered because of the number of monuments and buildings they created. However Hatsehput had his name removed replaced with her own. Thutmose III had Thutmose II's name added to all kinds of monuments.Grimal, Nicolas. A History of Ancient Egypt. pp. 216. Librairie Arthéme Fayard, 1988 This makes it hard for people studying Thutmose II to know what he really created. There are several surviving buildings built for the king at Semna, Kumma, and Elephantine. His biggest monument was a limestone gateway at Karnak that was once at the front of the Fourth Pylon's forecourt. But this monument was not completed in Thutmose II's reign but in the reign of his son Thutmose III. This suggests that Thutmose II did not rule for very long.Betsy Bryan, pp.235-236 The gateway was later pulled down and its building blocks used for the foundation of the Third Pylon by Amenhotep III. When Thutmose II became king, there was a rebellion by the Kush. The Egyptians retreated into the fort built by Thutmose I.Steindorff, George; and Seele, Keith. When Egypt Ruled the East. p.35. University of Chicago, 1942Breasted, James Henry. Ancient Records of Egypt, Vol. II p. 49. University of Chicago Press, Chicago, 1906 Thutmose II was too young for battle, but he sent an army into Nubia. The rebellion was easily crushed with the help of his father's military generals.Breasted, James Henry. Ancient Records of Egypt, Vol. II p. 50. University of Chicago Press, Chicago, 1906 Thutmose also seems to have fought against the Shasu Bedouin in the Sinai.Gardiner, Alan. Egypt of the Pharaohs. p. 180 Oxford University Press, 1964 This was a minor raid, but the army went as far as Upper Retenu, or Syria.Breasted, James Henry. Ancient Records of Egypt, Vol. II p. 51. University of Chicago Press, Chicago, 1906 This quite possibly indicates that the raid against the Shasu was only fought on the way to Syria. ==Mummy== Thutmose II's mummy was discovered in the Deir el-Bahri cache, in 1881. He was in a tomb with other 18th and 19th kings including Ahmose I, Amenhotep I, Thutmose I, Thutmose III, Ramesses I, Seti I, Ramesses II, and Ramesses IX. The mummy was unwrapped by Gaston Maspero on July 1, 1886. The face and shape of the head was very similar to the mummy of Thutmose I, his likely father. The body of Thutmose II been badly damaged by ancient tomb robbers. His left arm was broken off at the shoulder-joint, the forearm separated at the elbow joint, and his right arm chopped off below the elbow. His abdomen and much of his chest looked as if it had been hacked with an axe. His right leg had been cut from his body.Smith, G Elliot. The Royal Mummies, p.28-29. Duckworth, 2000 (reprint). All of these injuries had taken place after his death. The body also showed signs that Thutmose II did not have an easy life: :He had scarcely reached the age of thirty when he fell a victim to a disease of which the process of embalming could not remove the traces. The skin is scabrous in patches, and covered with scars, while the upper part of the skull is bald; the body is thin and somewhat shrunken, and appears to have lacked vigour and muscular power.Maspero, Gaston. History Of Egypt, Chaldaea, Syria, Babylonia, and Assyria, Volume 4 (of 12), Project Gutenberg EBook, Release Date: December 16, 2005. EBook #17324. http://www.gutenberg.org/dirs/1/7/3/2/17324/17324-h/v4c.htm ==Tomb== In 2025, Egyptian archaeological officials said that the original tomb for Thutmose had been found. It is \"in the mount of Thebes area, west of Luxor and the renowned Valley of the Kings.\"https://www.cbsnews.com/news/egypt-discovery-king- thutmose-ii-ancient-royal-tomb/ British and Egyptian archaeologists had be digging the tomb for two years. However, it was not first realized that it was of the pharaoh. Only in 2025 was it discovered that it was his tomb. It is the first royal burial chamber to be discovered in Egypt since 1922, when King Tutankhamun's burial chamber was opened. ==References== Category:2nd- millennium BC pharaohs Category:1479 BC deaths Category:15th-century BC people",
 "title": "Thutmose II"
}