{
 "id": "366347",
 "text": "David Wayne Spade (born July 22, 1964) is an American stand-up comedian, actor, writer, and television personality, known for his roles as Dennis Finch in Just Shoot Me!, Marcus Higgins in Grown Ups, and Russell Dunbar in Rules of Engagement. He is also known as the voice of Kuzco in The Emperor's New Groove and Kronk's New Groove. Spade was born on August 22, 1964 in Birmingham, Michigan. Spade moved to Scottsdale, Arizona at age four. He studied at Arizona State University. Spade has a daughter named Harper. The mother is Jillian Grace, a Playboy Playmate. ==Movies== Year Title Role Notes 1987 Police Academy 4: Citizens on Patrol Kyle 1992 Light Sleeper Theological Cokehead Indiana Jones Captain Samuel Fuller 1993 Coneheads Eli Turnbull 1994 Reality Bites The \"Wienerschnitzel\" Manager Uncredited 1994 PCU Rand McPherson 1995 Tommy Boy Richard Hayden MTV Movie Award for Best On-Screen Duo 1996 Black Sheep Steven \"Steve\" Dodds 1996 A Very Brady Sequel Sergio 1997 8 Heads in a Duffel Bag Ernest \"Ernie\" Lipscomb Scream 2 Hugh Daniels 1998 Senseless Scott Thorpe 1998 The Rugrats Movie Ranger Franklin (voice) 1999 Lost & Found Dylan Ramsey Also writer 2000 Loser Video Store Clerk Uncredited cameo 2000 The Emperor's New Groove Emperor Kuzco (voice) Nominated – Kid's Choice Award 2001 Joe Dirt Joseph \"Joe\" Dirt Also writer 2003 Dickie Roberts: Former Child Star Dickie Roberts Also writer 2005 Robots Rodney Copperbottom (voice) 2005 Racing Stripes Scuzz (voice) 2005 Lil' Pimp Principal Nixon (voice) 2005 Kronk's New Groove Emperor Kuzco (voice) 2006 Grandma's Boy Guyblow 2006 The Benchwarmers Richie Goodman Nominated – Teen Choice Award for Best Choice Chemistry 2007 I Now Pronounce You Chuck and Larry Transvestite Groupie Cameo 2007 The Simpsons Movie Himself (voice) 2010 Grown Ups Marcus Higgins 2011 Jack & Jill Monica Razzie Award for Worst Supporting Actress 2012 Hotel Transylvania Griffin the Invisible Man (voice) 2013 Jungle Master Boss Cain (voice) 2013 Snowflake, the White Gorilla Jenga (voice) English dub 2013 Grown Ups 2 Marcus Higgins 2015 Space Breakout Xanor (voice) 2015 Joe Dirt 2: Beautiful Loser Joseph \"Joe\" Dirt Also writer and producer 2015 I Am Chris Farley Himself Documentary 2015 Hotel Transylvania 2 Griffin the Invisible Man (voice) 2015 The Ridiculous 6 General Custer 2016 The Do-Over Charlie McMillian 2017 Mad Families Johnny Jon-John Also writer 2017 Sandy Wexler Himself 2018 Hotel Transylvania 3 Griffin the Invisible Man (voice) 2018 Father of the Year Wayne ==References== ==Other websites== * * Category:1964 births Category:Living people Category:American voice actors Category:American screenwriters Category:American radio personalities Category:American radio actors Category:American movie actors Category:American television actors Category:American television personalities Category:American stage actors Category:People from Scottsdale, Arizona Category:Actors from Arizona Category:Actors from Michigan Category:Comedians from Arizona Category:Comedians from Michigan",
 "title": "David Spade"
}