{
 "id": "366416",
 "text": "is a city in Iwate Prefecture, Japan. It was founded on February 11, 1941. The city is along the coast where the flows into the Pacific Ocean. It is connected to Morioka by an east-west train line and highway and the coastal highway also goes through the town. The city has a port but much of the shipping traffic is taken by larger cities along the coast. On June 6, 2005, the old Miyako absorbed the town of Tarō and village of Niisato from Shimohei District to form the new city of Miyako, more than doubling the old city's size. As of 2008, the new city had an estimated population of 57,874 and a density of 83.1 persons per km². The total area is 696.82 km². On January 1, 2010, the city absorbed another Shimohei District village, Kawai. ==Climate== ==2011 tsunami== On March 11, 2011, the city was devastated by a tsunami caused by the 2011 Tōhoku earthquake.Kyodo News, \"Deaths, people missing set to top 1,600: Edano\", The Japan Times, 13 March 2011. At least 401 lives were lost.NOAA Data Only about 30–60 boats survived from the town's 960 ship fishing fleet.Agence France-Presse/Jiji Press, \"Fishermen who lost livelihoods determined to return to cruel sea\", The Japan Times, 4 April 2011, p. 2.Fukada, Takahiro, \"Iwate fisheries continue struggle to recover\", The Japan Times, 21 September 2011, p. 3. A study by the University of Tokyo's Earthquake Research Institute found that the waters had reached at least above sea level. This was almost as high the record of the 1896 Meiji-Sanriku earthquake tsunami.Iwate saw wave test 38 meters, The Japan Times (Kyodo News), 4 April 2011 Some of the most well known scenes of the 2011 Japanese tsunami, broadcast worldwide, were shot in Miyako. It shows a dark black wave cresting and overflowing a floodwall and tossing cars, followed by a fishing boat capsizing as it hit the floodwall and then crushed as it was forced under a bridge. ==References== ==Other websites== * Miyako official website * BBC video of the tsunami flooding up the mouth of the river at Shinkawacho Category:Cities in Iwate Prefecture",
 "title": "Miyako, Iwate"
}