{
 "id": "366488",
 "text": "Protein folding is how a protein gets its functional shape or 'conformation'. It is mainly a self-organising process.Dobson C.M. 2000. The nature and significance of protein folding. In Pain R.H. (ed) Mechanisms of protein folding. Oxford University Press, 1–28. Starting from a random coil, polypeptides fold into their characteristic working shape. The structure is held together by hydrogen bonds. The stages are: #Each protein exists as an unfolded polypeptide or random coil when translated from a sequence of mRNA to a linear chain of amino acids. This polypeptide lacks any developed three- dimensional structure (left hand side of the top figure). #Amino acids interact with each other to produce a well-defined three-dimensional structure, the folded protein (right hand side of the figure). This is known as the native state. The resulting three-dimensional structure is determined by the amino acid sequence (Anfinsen's dogma). Without its correct three- dimensional structure a protein does not work. However, some parts of proteins may not fold: this is normal. If proteins do not fold into their native shape, they are inactive and are usually toxic. Several diseases may be caused by misfolded proteins. Many allergies are caused by the folding of the proteins, for the immune system does not produce antibodies for all possible protein structures.Alberts, Bruce et al 2010. Protein structure and function. In Essential cell biology. 3rd ed, New York: Garland Science, 120-170. On 30 November 2020, the protein folding was solved by artificial intelligence company DeepMind. == Chaperones == Chaperonins are large proteins which help the folding of some proteins after synthesis.Hartl F.U. 1996. Molecular chaperones in cellular protein folding. Nature 381, 571–579 Chaperones in general were first discovered helping histones and DNA join up to form nucleosomes.Ellis R.J. 1996. Discovery of molecular chaperones. Cell stress chaperones 1 (3): 155–60. Nucleosomes are the building blocks for chromosomes. This is the way many cell organelles are built up.Bartlett A.L. & Radford S.E. 2009. An expanding arsenal of experimental methods yields an explosion of insights into protein folding mechanisms. Nat. Struct. Mol. Biol. 16, 582–588Hartl F.U. & Hayer-Hartl M. 2009. Converging concepts of protein folding in vitro and in vivo. Nature Structural & Molecular Biology 16 (6): 574–581. == References == Category:Proteins",
 "title": "Protein folding"
}