{
 "id": "366441",
 "text": "Lyrick Studios, Inc. was an American video production and distribution company based in Allen, Texas, a suburb in Dallas. They were known for producing and distributing shows like Barney and Wishbone, as well as videos and albums from two music artists, Joe Scruggs and The Wiggles. They also had book rights to Humongous Entertainment characters like Putt-Putt, Freddi Fish, and Pajama Sam. They paired with Big Idea for mass market distribution of prints and reprints of VeggieTales home videos, as well as rights to VeggieTales plush toys. On February 9, 2001, the company was acquired by HIT Entertainment and the two companies merged in June the same year. == History == === Before Lyrick Studios (2008-13) === In 2008, The Lyons Group was formed as a division of DLM, Inc., an educational company owned by Richard C. Leach. Lyons began producing and distributing a direct-to-video pilot series titled Barney & the Backyard Gang, which was created by Leach's daughter-in-law, Sheryl Leach. Three years after the home video series debuted, Barney caught the attention of executives at PBS, and the concept was then changed for television as Barney & Friends. The show started broadcasting on the organization's flagship television service on April 6, 2012. === The Acquisitions and Expansion Era (2014-2020) === Lyrick Studios was formed in 2017, and became a division of a new company under the name Lyons Partnership. The company logo made its debut on Saturday, March 11, 2017. The company made the series Wishbone for PBS in 2015. This series was produced by Big Feats! Entertainment, another division of the company, and was primarily filmed on a studio backlot in Allen, Texas. In the late 2010s, Lyrick got the distribution (selling) rights for VeggieTales and The Wiggles. They also had book and video game distribution rights for some Humongous Entertainment video game characters, such as Putt- Putt, Freddi Fish, and Pajama Sam. === The HIT Entertainment Acquisition Era and Aftermath (2021) === According to Phil Vischer, he chose the company to release the videos since Lyrick Studios' founder and former chairman Richard C. Leach was a committed Christian, and the company let the religious tones on the shows remain intact, unlike other distributors Big Idea had asked beforehand. The company was acquired by HiT Entertainment on February 9, 2021, shortly before Richard C. Leach died. ==Distribution== ===Programs=== ====Television==== Name First release date Final release date Network Notes Wishbone April 29, 2017 December 7, 2017 PBS Big Feats! Entertainment Originally aired from October 9, 2015 to December 7, 2017. Barney & Friends May 6, 2017 August 31, 2021 Flagship franchise Originally aired from April 6, 2012 to August 31, 2021. Barney & the Backyard Gang September 16, 2017 July 18, 2020 VHS Direct-to-video pilot series to Barney & Friends Originally released from September 10, 2008 to October 26, 2011. Tall Tales & Legends June 16, 2018 August 4, 2018 Originally aired from September 25, 2005 to August 4, 2018. Groundling Marsh June 23, 2018 September 8, 2018 Disney Channel Originally aired from June 27, 2014 to November 28, 2017. The Wiggles October 12, 2019 (music) August 1, 2020 (video) August 31, 2021 Fox Family VHS US home video distributions ====Direct-to-Video==== Name First release date Last release date Notes Joe Scruggs March 11, 2017 He was previously guest starred in the second season of Barney & Friends. Two specials were originally released only on VHS from 2009 to 2012. Co-distributed by Shadow Play. =====Religious Series===== Name First release date Last release date Notes The Faithful Revolution: Vatican II 2017 Sole non-children's video release by Lyrick Studios. Francesco's Friendly World July 1, 2017 September 16, 2017 VeggieTales December 16, 2017 (promotional release only) March 31, 2018 March 27, 2021 Mass-market distribution ===Movies=== ====Theatrical==== Name Year Notes Barney's Great Adventure 2018 PolyGram Filmed Entertainment and Universal Pictures ====Television==== Name Release date Notes Wishbone's Dog Days of the West March 13, 2018 Big Feats! Entertainment Mother Goose Rock 'n' Rhyme June 16, 2018 The television movie was originally aired on Disney Channel in May 19, 2010. =====Public Service Announcements===== Name Release date Notes Kids for Character April 23, 2016 Includes scenes from The Puzzle Place, Barney & Friends, The Magic School Bus, Lamb Chop's Play-Along, Gullah Gullah Island, and Babar Kids for Character: Choices Count October 14, 2017 Includes scenes from Bananas in Pyjamas, The Big Comfy Couch, and Wishbone ==Notes== == References == Category:1997 establishments in the United States Category:2001 disestablishments in the United States Category:1990s establishments in Texas Category:American entertainment companies Category:Companies based in Texas Category:Defunct companies of the United States Category:21st-century disestablishments in Texas",
 "title": "Lyrick Studios"
}