{
 "id": "366549",
 "text": "All Smiles Dental Centers is a company that manages dental offices in Texas. Its headquarters are in Farmers Branch, Texas.\"CORPORATE INTEGRITY AGREEMENT BETWEEN THE OFFICE OF INSPECTOR GENERAL OF THE DEPARTMENT OF HEALTH AND HUMAN SERVICES AND ALL SMILES DENTAL CENTER, INC. \" () p. 23. Retrieved on September 22, 2012. \"All Smiles: Michael S. J. Lozich, Esq. Chief Compliance Officer All Smiles Dental Centers 4901 LBJ Freeway, Suite 300 Dallas, Texas 75244\"\"Sheet No. 23.\" (Zoning Map) (Archive) City of Farmers Branch. Retrieved on September 23, 2012. In September 2012 All Smiles had 20 clinics in Texas.\"Locations .\" (). All Smiles Dental Centers. Retrieved on September 23, 2012. The people who go to the clinics are mostly poor Hispanic children.\"College of Dental Medicine Opportunities for Dental Professionals .\" () Georgia Health Sciences University. Retrieved on September 30, 2012. Dr. Richard Malouf started All Smiles in 2002.Harris, Byron. \"All Smiles Dental Center files for bankruptcy following investigation .\" WFAA-TV. May 4, 2012. Retrieved on September 22, 2012.\"Company Overview of All Smiles Dental Center, Inc.\" Businessweek. Retrieved on September 23, 2012. The address is listed as \"9090 Skillman Street Suite 200C Dallas, TX 75243 United States\" but the address in the corporate integrity agreement is the real corporate address After the U.S. Supreme Court told the State of Texas that it did not give enough money to give dental care to poor children, five years before 2012 the State of Texas began spending $1.4 million more money on dental care for poor children.Jacobson, Sherry. \"All Smiles Dental Centers turning away young Medicaid patients, closing clinics.\" The Dallas Morning News. July 26, 2012. Retrieved on September 22, 2012. All Smiles began a braces program and began spending a lot of money, given by the Texas government, on braces for children. The Medicaid program only allowed braces if the braces helped a major problem like cleft lip and palate, or if it helps a problem caused by an illness, like Down syndrome or muscular dystrophy.Koppel, Nathan. \"Texas Drills Down on Medicaid Dental Fraud.\" The New York Times. Updated August 19, 2012. Retrieved on September 23, 2012. \"Medicaid, a federal-state program that insures lower-income people, typically covers only severe orthodontic conditions, such as children born with a cleft palate or those with dental problems resulting from Down syndrome or muscular dystrophy.\" Malouf and his wife, Leanne, had a lot of rich things, like a mansion,Nicholson, Eric. \"Richard Malouf, the Dentist Accused of Millions in Medicaid Fraud, is Building a Private Water Park .\" () Dallas Observer. Friday July 13, 2012. Retrieved on September 23, 2012. two fancy cars, and two company jets. In 2012 the State of Texas began trying to find out if All Smiles lied and took too much government money. The federal government accused All Smiles of cheating in the dental program, and so All Smiles promised to be honest in a contract written with the federal government. In July 2012 the company closed many braces offices and told patients that they could no longer go to All Smiles for braces. ==Related pages== * Small Smiles Dental Centers * ReachOut Healthcare America ==Sources== ==Other websites== * All Smiles Dental Centers Category:2002 establishments in the United States Category:Companies based in Texas Category:2000s establishments in Texas Category:Dentistry companies of the United States",
 "title": "All Smiles Dental Centers"
}