{
 "id": "366668",
 "text": "The Black Cauldron is a 1985 American animated dark fantasy movie produced by Walt Disney Productions. It is based on the first two books in The Chronicles of Prydain by Lloyd Alexander, a series of five novels which in turn is based on Welsh mythology. The Black Cauldron was the first Disney animated movie to be rated PG. It was the first Disney animated movie released under the Walt Disney Pictures name. The Black Cauldron was the last Disney animated movie produced by Walt Disney Productions. Following the Disney split, Walt Disney Productions was succeeded by Walt Disney Feature Animation. The movie is directed by Ted Berman and Richard Rich. They directed the previous Disney animated movie The Fox and the Hound. == Reception == It was not very popular when it was first released. Now it has become a cult movie. It cost $25 million to make. It earned only $21 million at the North American box office. It is said to be one of the worst box-office failures from Walt Disney Animation Studios. == Story == In the land of Prydain, an old enchanter named Dallben thinks that the Horned King wants his pig, Hen Wen, who has oracular powers, to locate the Black Cauldron, which has evil powers. He tells Taran, a farm boy, to take Hen Wen to safety but the pig is captured by dragons. Taran follows them to the Horned King's castle and meets a dog-gibbon hybrid creature named Gurgi, who wants to be his friend. Taran helps Hen Wen escape but is captured and thrown into the dungeon. He meets Princess Eilonwy and she frees him. Along with a third prisoner, the elderly Fflewddur Fflam, they escape and are found by Gurgi. Following Hen Wen's trail, the group stumbles into the underground kingdom of the Fair Folk, who have Hen Wen under their protection. They learn the cauldron is held by three witches. The witches give them the cauldron and take the magic sword. The witches reveal the cauldron can only be destroyed when someone willingly climbs into it, which will kill them. Taran, Eilonwy and Fflewddur are captured by the Horned King's minions. The Horned King uses the cauldron to raise an army of skeleton warriors. Gurgi jumps into the Cauldron. This kills Gurgi but also kills the undead warriors. The Cauldron's magical powers kill the Horned King. The three witches come to take back the Black Cauldron and they bring Gurgi back to life. == Cast == * Grant Bardsley as Taran * Susan Sheridan as Princess Eilonwy * Nigel Hawthorne as Fflewddur Fflam * John Byner as Gurgi/Doli * John Hurt as the Horned King * Freddie Jones as Dallben * Arthur Malet as King Eidilleg * Eda Reiss Merin as Orddu * Adele Malis-Morey as Orwen * Billie Hayes as Orgoch * Phil Fondacaro as Creeper * John Huston as the Narrator * Brandon Call as Fairy #1 * Gregory Levinson as Fairy #2 * Lindsay Rich as Fairy #3 ==References== Category:1985 fantasy movies Category:1980s animated movies Category:Disney animated movies Category:Movies about witchcraft Category:Movies set in castles Category:American coming-of-age movies Category:Cult movies Category:1980s English-language movies Category:Movies about princesses Category:Movies about old age Category:Movies about pigs Category:Movies set in Wales Category:Movies about fairies and sprites Category:1980s monster movies Category:American monster movies Category:1980s coming-of-age movies Category:Movies about friendship",
 "title": "The Black Cauldron (movie)"
}