{
 "id": "366690",
 "text": "The 2012 Green Bay Packers season was the Green Bay Packers' 92nd season in the National Football League, the 94th overall and the seventh under head coach Mike McCarthy. ==Offseason== ===2012 NFL Draft=== Round Pick Overall Player Position College 1 28 28 Nick Perry Linebacker USC 2 19 51 Jerel Worthy Defensive end Michigan State 30 62 Casey Hayward Cornerback Vanderbilt 4 37 132 Mike Daniels Defensive tackle Iowa 38 133 Jerron McMillian Safety Maine 5 28 163 Terrell Manning Linebacker North Carolina State 7 34 241 Andrew Datko Offensive Tackle Florida State 36 243 B. J. Coleman Quarterback Tennessee- Chattanooga Notes: The Packers acquired the No. 224 selection in a trade that sent guard Caleb Schlauderaff to the New York Jets. The Packers have received the maximum number of compensatory selections available to teams through the NFL's compensatory draft program. Two addition picks in both the 4th and 7th rounds. The Packers traded the No. 54 and No. 123 picks to receive No. 51 from the Philadelphia Eagles. The Packers traded the No. 90 and No. 163 picks to receive No. 62 for the New England Patriots . ===Free agents=== Position Player Free agency tag Date signed 2012 team QB Matt Flynn UFA March 18, Seattle Seahawks RB Ryan Grant UFA September 25 Washington Redskins TE Jermichael Finley UFA February 22, Green Bay Packers C Scott Wells UFA March 16, St. Louis Rams NT Howard Green UFA OLB Erik Walden UFA April 23, Green Bay Packers CB Jarrett Bush UFA March 20, Green Bay Packers CB Pat Lee UFA March 21, Oakland Raiders RFA: Restricted free agent, UFA: Unrestricted free agent, ERFA: Exclusive rights free agent, FT: Franchise Tag ===Additions=== *On January 1 the Packers signed QB Nick Hill. *On March 23 the Packers signed former Indianapolis Colts C Jeff Saturday. *On March 23 the Packers signed former Indianapolis Colts DE Daniel Muir. *On March 30 the Packers signed former Seattle Seahawks DE Anthony Hargrove. *On May 23 the Packers signed former Miami Dolphins DE Philip Merling. *On August 12 the Packers signed former Cincinnati Bengals RB Cedric Benson. *On September 3 the Packers signed WR Diondre Borel, TE Brandon Bostick, QB B. J. Coleman, T Andrew Datko, DE Lawrence Guy, G/T Chris Scott, RB Marc Tyler and G Greg Van Roten signed to practice squad. ===Departures=== *On April 23 the Packers released T Chad Clifton after a failed physical. *On April 25 the Packers released S Nick Collins after agreeing to part ways after his neck injury sustained in 2011. *On May 23 the Packers released QB Nick Hill. *On July 25 the Packers released S Charlie Peprah. *On August 24 the Packers released WR Andrew Brewer, DE Anthony Hargrove, S Micah Pellerin, T Herb Taylor and CB Dion Turner. *On August 26 the Packers released FB Jon Hoese and DE Jarius Wynn. *On August 31 the Packers released S Anthony Levine, CB Otis Merrill, WR Dale Moss, DT Daniel Muir, RB Marc Tyler, G Greg Van Roten, G/T Reggie Wells, T Shea Allard, WR Diondre Borel, TE Brandon Bostick, QB B. J. Coleman, FB Nic Cooper, T Andrew Datko, C/G Tommie Draheim, C/G Sampson Genus, WR Curenski Gilleylen, WR Tori Gurley and DE Lawrence Guy as part of the cutdown to the 53 man regular season roster. ===Coaching changes=== *On January 21, Packers offensive coordinator Joe Philbin was named the new head coach of the Miami Dolphins.Philbin Hired to Lead Dolphins Packersnews.com *On February 2, Packers quarterbacks coach Tom Clements was promoted to the team's offensive coordinator position.\"QB coach Tom Clements named new Packers offensive coordinator,\" from Green Bay Press-Gazette, 2/3/2012 ==Regular Season== ===Regular Season Transactions=== ===Starters on Offense=== POS Name GS Name GS Name GS QB Aaron Rodgers 4 RB Cedric Benson 4 FB John Kuhn 4 WR Greg Jennings 3 James Jones 1 WR Jordy Nelson 4 TE Jermichael Finley 4 LT Marshall Newhouse 4 LG T. J. Lang 4 C Jeff Saturday 4 RG Josh Sitton 4 RT Bryan Bulaga 4 ===Starters on Defense and Special Teams=== POS Name GS Name GS Name GS Name GS LDE Ryan Pickett 4 NT B. J. Raji 4 RDE C. J. Wilson 3 Jerel Worthy 1 LOLB Nick Perry 4 MLB A. J. Hawk 4 MLB D. J. Smith 4 ROLB Clay Matthews 4 RCB Tramon Williams 4 LCB Sam Shields 3 Jarrett Bush 1 SS Charles Woodson 4 FS Morgan Burnett 4 K Mason Crosby 4 P Tim Masthay 4 ==Schedule== ===Preseason=== Week Date Opponent Result Record Game site NFL.com recap 1 August 9 at San Diego Chargers L 13–21 0–1 Qualcomm Stadium Recap 2 August 16 Cleveland Browns L 10–35 0–2 Lambeau Field Recap 3 August 23 at Cincinnati Bengals W 27–13 1–2 Paul Brown Stadium Recap 4 August 30 Kansas City Chiefs W 24–3 2–2 Lambeau Field Recap ===Regular season=== Week Date Opponent Result Record Game site NFL.com recap 1 September 9 San Francisco 49ers L 22–30 0–1 Lambeau Field Recap 2 Chicago Bears W 23–10 1–1 Lambeau Field Recap 3 at Seattle Seahawks L 12–14 1–2 CenturyLink Field Recap 4 September 30 New Orleans Saints W 28–27 2–2 Lambeau Field Recap 5 October 7 at Indianapolis Colts L 27–30 2–3 Lucas Oil Stadium Recap 6 October 14 at Houston Texans W 42–24 3–3 Reliant Stadium Recap 7 October 21 at St. Louis Rams W 30–20 4–3 Edward Jones Dome Recap 8 October 28 Jacksonville Jaguars W 24–15 5–3 Lambeau Field Recap 9 November 4 Arizona Cardinals W 31–17 6–3 Lambeau Field Recap 10 Bye 11 November 18 at Detroit Lions W 24–20 7–3 Ford Field Recap 12 November 25 at New York Giants L 10–38 7–4 MetLife Stadium Recap 13 December 2 Minnesota Vikings W 23–14 8–4 Lambeau Field Recap 14 December 9 Detroit Lions W 27–20 9–4 Lambeau Field Recap 15 December 16 at Chicago Bears W 21–13 10–4 Soldier Field Recap 16 December 23 Tennessee Titans W 55–7 11–4 Lambeau Field Recap 17 December 30 at Minnesota Vikings L 34–37 11–5 Mall of America Field Recap :Note: Intra-division opponents are in bold text. ===Postseason=== Playoff round Date Opponent Result Record Game site NFL.com recap Wild Card Minnesota Vikings (6) W 24–10 1–0 Lambeau Field Recap Divisional at San Francisco 49ers (2) L 31–45 1–1 Candlestick Park Recap ==Statistics== ===Regular season statistical leaders=== Player(s) Value Passing Yards Aaron Rodgers 4,295 Yards Passing Touchdowns Aaron Rodgers 39 TDs Rushing Yards Alex Green 464 Yards Rushing Touchdowns Aaron Rodgers, DuJuan Harris and Ryan Grant 2 TDs Receptions Randall Cobb 80 Receptions Receiving Yards Randall Cobb 954 Yards Receiving Touchdowns James Jones 14 TDs Points Mason Crosby 103 Points Kickoff Return Yards Randall Cobb 964 Yards Punt Return Yards Randall Cobb 292 Yards Tackles A. J. Hawk and Morgan Burnett 116 Tackles Sacks Clay Matthews 13 Sacks Interceptions Casey Hayward 6 INTs statistical values are correct through Week 17. ===Best game performances=== Player(s) Value Opponent Passing Yards Aaron Rodgers 365 Yards @ Minnesota Vikings Passing Touchdowns Aaron Rodgers 6 TDs @ Houston Texans Rushing Yards Cedric Benson 84 Yards New Orleans Saints Rushing Touchdowns Ryan Grant 2 TDs Tennessee Titans Receiving Yards Jordy Nelson 122 Yards @ St. Louis Rams Receiving Touchdowns Jordy Nelson and James Jones 3 TDs @ Houston Texans and @ Chicago Bears Points Jordy Nelson and James Jones 18 Points @ Houston Texans and @ Chicago Bears Tackles Morgan Burnett 14 Tackles New Orleans Saints Sacks Clay Matthews 3.5 Sacks Chicago Bears Interceptions Tramon Williams, Casey Hayward and Morgan Burnett 2 INTs Chicago Bears, @ Houston Texans and Minnesota Vikings statistical values are correct through Week 17. ===Statistical league rankings=== *Total Offense (YPG): 13th *Passing (YPG): 10th *Rushing (YPG): 20th *Points (PPG): 7th *Total Defense (YPG): 10th *Passing (YPG):12th *Rushing (YPG): 14th *Points (PPG): 7th Stats correct through December 24, 2012 ==Notes and references== ==Other websites== *Green Bay Packers official website Category:National Football League seasons Category:2012 in sports Category:2012 in the United States Category:2010s in Wisconsin",
 "title": "2012 Green Bay Packers season"
}