{
 "id": "366659",
 "text": "The Many Adventures of Winnie the Pooh is a 1977 animated movie produced and released by Walt Disney Productions. It was released on March 11, 1977. Unlike Disney's other animated anthology movies which have originally created material, this movie is made from three previously released animated short movies based upon the Winnie-the-Pooh books by A. A. Milne: Winnie the Pooh and the Honey Tree (1966), Winnie the Pooh and the Blustery Day (1968), and Winnie the Pooh and Tigger Too (1974). This is also the last movie in the Disney canon that Walt Disney was personally involved with, because one of the shorts (Winnie the Pooh and the Honey Tree) was released during his lifetime, and he was involved in the production of Blustery Day. The fourth and final short movie based on the original books, Winnie the Pooh and a Day for Eeyore, was released in 1983. It is included as a bonus feature on the VHS and DVD releases of the movie. The Many Adventures of Winnie the Pooh was 1 of 2 Disney animated anthology movies released under the rating system, along with Fantasia 2000. The characters from the movie became very popular. There have been sequels, television programs, clothing, books and toys based on the characters. The movie is different from the three individual shorts by having newly created material to link the stories together. It also has an ending to close the stories. The ending is based on the final chapter of The House at Pooh Corner. It was always Walt Disney's intention to make a movie, but he decided to make shorts instead — after production had begun — to familiarize US audiences with the characters. All three shorts as well as future movies boast classic songs by the Sherman Brothers including \"Winnie the Pooh\" and \"The Wonderful Thing About Tiggers\". The movie also inspired an attraction of the same name at Disneyland, Walt Disney World and Hong Kong Disneyland. A much more elaborate attraction, also based on the movie, opened in Tokyo Disneyland as \"Pooh's Hunny Hunt\". == Plot == The movie contains the following segments: * Winnie the Pooh and the Honey Tree * Winnie the Pooh and the Blustery Day * Winnie the Pooh and Tigger Too ==Voice cast== * Winnie-the- Pooh, voiced by Sterling Holloway * Piglet, voiced by John Fiedler * Eeyore, voiced by Ralph Wright * Tigger, voiced by Paul Winchell * Kanga, voiced by Barbara Luddy * Roo, voiced by Clint Howard, later Dori Whitaker * Rabbit, voiced by Junius Matthews * Owl, voiced by Hal Smith * Gopher, voiced by Howard Morris * Christopher Robin, voiced by Bruce Reitherman (the son of director Wolfgang Reitherman), later Jon Walmsley and Timothy Turner * Narrated by Sebastian Cabot ==Production== For the character Piglet, hand gestures and other movements were used by the animators to make expressions, because he (and Pooh) had the look of dolls or stuffed animals with relatively simple button eyes. The scene where Rabbit deals with Pooh's being part of the \"decor of his home\" was not in the original book, but was reportedly made by Disney when he first read the book. ==Reception== Movie critic Leonard Maltin called the original Pooh featurettes \"gems\". He also noted that the artwork resembles the book illustrations, and that the particular length of these short movies meant that the moviemakers didn't have to \"compress or protract their script.\" The movie has a 91% \"fresh\" rating from critics on Rotten Tomatoes. Ruth Hill Viguers, however, when writing in A Critical History of Children’s Literature during the 1960s, mentioned Disney's Winnie the Pooh along with several other Disney adaptations as having “destroyed the integrity of the original books”. The American Film Institute nominated The Many Adventures of Winnie the Pooh for its Top 10 Animated Films list. ==History== In 1977, Bruce Reitherman the original US voice actor remains role fact, because Christopher Robin is British with a British accent who was re-dubbed by Jon Walmsley in the segment of Winnie the Pooh and the Honey Tree. ==Home video== The Many Adventures of Winnie the Pooh was first released on VHS, Betamax, CED videorecord, and laserdisc in the early 1980s. In 1996, it was re-released on VHS as part of the Masterpiece Collection. It included video footage of the making which was shown before the movie starts. It was released on DVD for the first time in 2002 to commemorate its 25th anniversary, with digitally restored picture and sound. The separate shorts had also been released on their own on VHS in the 1990s. The 25th anniversary edition DVD includes, among other bonus features, \"The Many Adventures of Winnie the Pooh: The Story Behind the Masterpiece\", which documents the history of the books and their initial movie adaptations. It also features interviews with animators Ollie Johnston, Frank Thomas, and Burny Mattinson, as well as the Sherman brothers, Paul Winchell, and others. Digital Media FX reviewer Shannon Muir said that the audio and video quality of the movie on this DVD was very high. The \"Friendship Edition\" DVD was re-released on June 19, 2007. All of the special features from the previous \"25th Anniversary Edition\" DVD were recycled; the only new addition being an episode of Playhouse Disney's computer-animated series The Book of Pooh. The DVD re-release coincides with the 30th anniversary of the release of the movie. The Blu-Ray version was released for the first time in August 2013.Sausage Party insert ==Songs== * \"Winnie the Pooh\" * \"Up, Down and Touch the Ground\" * \"Rumbly in My Tumbly\" * \"Little Black Rain Cloud\" * \"Mind Over Matter\" * \"A Rather Blustery Day\" * \"The Wonderful Thing About Tiggers\" * \"Heffalumps and Woozles\" * \"When the Rain Rain Rain Came Down\" * \"Hip Hip Pooh-Ray!\" ==References== ==Other websites== * (Dead link) * * Category:1977 movies Category:American buddy comedy movies Category:American family movies Category:American musical comedy movies Category:1970s American musical movies Category:1977 comedy movies Category:1970s family movies Category:1970s animated movies Category:Disney animated movies Category:Movies about bears Category:Movies based on books Category:Movies directed by Wolfgang Reitherman Category:Winnie the Pooh Category:Movies about children Category:Movies about birds Category:Movies about rabbits and hares Category:Movies about tigers Category:Movies about pigs Category:Movies set in forests Category:1970s English-language movies Category:American fantasy-comedy movies Category:1970s fantasy movies",
 "title": "The Many Adventures of Winnie the Pooh"
}