{
 "id": "366676",
 "text": "Fantasia 2000 is a 2000 American animated movie. It was produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is a sequel to Fantasia (1940). Like the original movie, it has animated segments set to pieces of classical music. The Sorcerer's Apprentice is the only segment that is in both movies. In fact, Fantasia 2000 was Disney's last animated anthology movie to date. The soundtrack was performed by the Chicago Symphony Orchestra with conductor James Levine. A group of celebrities introduce each segment in live-action scenes. The celebrities include Steve Martin, Itzhak Perlman, Jermaine Jackson, Bette Midler, James Earl Jones, Penn & Teller, James Levine, Jeff Goldblum and Mary Steenburgen. Fantasia 2000 was shown at Carnegie Hall on December 17, 1999. It was part of a five-city concert tour, with performances in London, Paris, Tokyo and Pasadena, California. An exclusive release in IMAX theatres followed from January 1 to April 30, 2000. It became Disney's first animated feature-length movie in the IMAX format and the first animated movie in the format overall. Fantasia 2000 was opened in the United States on June 16, 2000. It has earned $90.8 million in gross revenue worldwide. Fantasia 2000 was 1 of 2 Disney animated anthology movies released under the rating system, along with The Many Adventures of Winnie the Pooh. Fantasia 2000 was the first Disney animated movie to be released on home video in the same year as it's theatrical release. ==Rhapsody in Blue== Rhapsody in Blue is the first Fantasia segment with music from the American composer George Gershwin. It originated in 1995, when director and animator Eric Goldberg approached Al Hirschfeld about the idea of an animated short set to Gershwin's composition in the style of Hirschfeld's illustrations. Hirschfeld agreed to serve as artistic consultant and allowed the animators to use and adapt his previous works for the segment. Goldberg's wife Susan was art director. Duke is named after jazz artist Duke Ellington. The bottom of his toothpaste tube reads \"NINA\", an Easter egg referencing Hirschfeld's daughter Nina. Rachel was designed after the Goldbergs' daughter and John is based on animation historian and author John Culhane and Hirschfeld's caricature of Alexander Woollcott. Goldberg took Hirschfeld's original illustration of Gershwin and animated it to make him play the piano. Featured in the crowd emerging from the hotel are depictions of Brooks Atkinson and Hirschfeld, along with his wife Dolly Haas. The segment was completed five months ahead of schedule from December 18, 1998 to May 8, 1999. The animators from the production hiatus of Kingdom of the Sun were reassigned to work on the segment. Despite this, the sequence was so chromatically complex that the rendering process using the CAPS system delayed work on Tarzan. == References == == Other websites == * Category:2000 movies Category:2000 animated movies Category:2000 musical movies Category:2000s sequel movies Category:American family movies Category:American musical fantasy movies Category:American sequel movies Category:Disney animated movies Category:Movies about whales Category:Movies set in New York City Category:Movies about children Category:Movies about birds Category:Movies about mice Category:2000 fantasy movies Category:IMAX movies Category:Movies set in the 1930s",
 "title": "Fantasia 2000"
}