{
 "id": "366681",
 "text": "The Emperor's New Groove is a 2000 American animated family movie. It was made by Walt Disney Animation Studios released on December 15, 2000, and is the 40th motion picture produced by Disney. The title refers to the fairy tale The Emperor's New Clothes by Hans Christian Andersen, but has little in common with the fairy tale. The movie received an Academy Award nomination for Best Song for \"My Funny Friend and Me\" performed by Sting. It lost against \"Things Have Changed\" by Bob Dylan from Wonder Boys. A direct-to-video sequel, Kronk's New Groove, was released in December 2005. There was also an animated television series, The Emperor's New School, in January 2006. ==Plot== Kuzco is a selfish, bratty South American emperor who is selfish and rude to other people. He summons Pacha, the leader of a local village, and tells him he intends to build a holiday resort called for himself, destroying the village. Meanwhile, Yzma plans to take over the throne. She and her henchman Kronk, organize a dinner for Kuzco, where they plan to poison him, but Kronk gives Kuzco the wrong poison, transforming him into a llama. Yzma orders Kronk to dispose of Kuzco. He loses Kuzco, who ends up in Pacha's village. Kuzco orders Pacha to return him to the palace. Pacha agrees, but only if he builds his resort somewhere else. Kuzco refuses and decides to travel back to the palace on his own, but ends up lost in the jungle before he is rescued by Pacha. Yzma takes control of the empire, but when she learns Kuzco has survived, she and Kronk search for him. Kuzco seemingly agrees with Pacha's demands and they begin to journey back to the palace. Kuzco and Pacha arrive at a roadside diner. Yzma and Kronk have followed them there. Pacha tries to warn Kuzco that Yzma is planning to kill him. Kuzco thinks Pacha is lying and reveals that when he becomes human again, he will continue with his plan to make Pacha's village a resort. Kuzco overhears Yzma planning to kill him due to his selfishness, he leaves the diner on his own and consigns himself to live out his life as a normal llama, before reuniting with Pacha. When the two return to his house to pick up supplies, they discover Yzma and Kronk have arrived, searching for them. Pacha's family distract Yzma and Kronk, giving Pacha and Kuzco time to get back to the palace. The two go to Yzma's lab to find a potion that can turn Kuzco back into a human. Yzma and Kronk arrive. The palace guards attack Kuzco but are turned into different animals. Kuzco and Pacha find the potion that will turn him back into a human. They fight Yzma on the palace roof. Yzma is turned into a cat by one of her own potions. Kuzco is transformed back into a human. Kuzco decides to build his resort somewhere else. ==Voice cast== * David Spade as Emperor Kuzco, the entitled, pampered, and arrogant 18-year-old emperor of the Inca Empire who has no patience for the needs of others and has a lack of compassion. * John Goodman as Pacha, a brave, loving, and respected village leader. * Eartha Kitt as Yzma, Kuzco's elderly and untrustworthy advisor who seeks Kuzco's throne for herself. * Patrick Warburton as Kronk, Yzma's hapless but slow-witted muscular henchman. * Wendie Malick as Chicha, Pacha's supportive, pregnant wife. * Kellyann Kelso and Eli Russell Linnetz as Chaca and Tipo respectively, Pacha and Chicha's two young, mischievous children. * Bob Bergen as Bucky the Squirrel, Kronk's companion, who hates Yzma, and has an unpleasant encounter with Kuzco; and as Fly stuck in a web. * Tom Jones as the Theme Song Guy, Kuzco's personal theme song conductor. * Patti Deutsch as Mata, a waitress at Mudka's Meat Hut. * John Fiedler as Rudy, a well-meaning old man who is first thrown out a window by Kuzco's guards, then later befriends him. * Joe Whyte as the Royal Recordkeeper. * Jack Angel, Danny Mann, Rodger Bumpass, Paul Eiding, and Patrick Pinney as Male Villagers/Additional Voices. * Sherry Lynn, Jennifer Darling, and Mickie McGowan as Female Villagers/Additional Voices. * Jess Harnell as the Guard who throws Rudy out the window and Additional Voices. * Rodger Bumpass as one of the Guards who got turned into a cow. * Steve Susskind as an Irate Chef, a former chef at Mudka's Meat Hut who quits due to Kuzco and Kronk. * Miriam Flynn as the Piñata Lady. * Jim Cummings and Kath Soucie as Birthday Singers. * Andre Stojka and Robert Clotworthy as Topo and Ipi, two of Pacha's villagers. ==Production== According to the 2002 documentary The Sweatbox, The Emperor's New Groove started production in late 1994 by Roger Allers as Kingdom of the Sun, a more traditional Disney animated movie. By 1997 with the releases of both Pocahontas and The Hunchback of Notre Dame and their financial failures, the executives wanted something more comedic and less formulaic. ==Annie Awards== Annie Awards are an award each year for animated movies. Result Award Winner/Nominee Recipient(s) Animated Theatrical Feature Individual Achievement in Directing Mark Dindal (Director) Individual Achievement in Writing Mark Dindal (Story) Chris Williams (Story) David Reynolds (Screenplay) Individual Achievement in Storyboarding Stephen J. Anderson (Story Supervisor) Individual Achievement in Storyboarding Don Hall (Story Artist) Individual Achievement in Production Design Colin Stimpson (Art Director) Individual Achievement in Character Animation Dale Baer (Supervising Animator—Yzma) Individual Achievement in Voice Acting - Female Eartha Kitt (\"Yzma\") Individual Achievement in Voice Acting - Male Patrick Warburton (\"Kronk\") Individual Achievement in Music Sting (Music/Lyrics) David Hartley (Music) ==References== Category:2000 movies Category:2000 animated movies Category:American family movies Category:Buddy movies Category:English-language movies Category:Movies composed by John Debney Category:Movies set in Peru Category:Self-reflexive movies Category:The Emperor's New Groove",
 "title": "The Emperor's New Groove"
}