{
 "id": "366737",
 "text": "Ernst Frederick I, Duke of Saxe-Hildburghausen (Gotha, 21 August 1681 - Hildburghausen, 9 March 1724), was a duke of Saxe-Hildburghausen. He was the oldest son of Ernst, Duke of Saxe-Hildburghausen and Countess Sophie Henriette of Waldeck. When he was younger, he served in the Netherlands army. He was wounded in the Spanish Succession War at Höchstädt. In 1715, after the death of his father, he left the Army and governed the duchy of Saxe-Hildburghausen. Like many German princes, He wanted his duchy to have the splendor of the court of the King Louis XIV of France. This caused him to be ruined financially. Because he always needed money, he raised taxes and sold towns. He sold the county of Cuylenburg which was the dowry of his wife. The county was sold in 1720. He did not sell it to pay any money he owed to others. It was sold so that a garden and a channel could be built in his palace. In 1723 the Schalkau was sold to the duchy of Saxe-Meiningen. At the time, Schalkau had city privileges, and the right to hold a market. What was sold was an administrative division, much like a county, only smaller, which included Schalkau. The sale without the agreement of his wife was illegal. This led to a war with Saxe-Meiningen. At the end of the war, all of the county was ruined. Because of his very bad taxes, in 1717 an open revolt took place in the duchy. ==Family== Ernst Frederick married Countess Sophia Albertine of Erbach-Erbach in Erbach on 4 February 1704. They had fourteen children: # Ernst Ludwig Hollandinus (b. Hildburghausen, 24 November 1704 – d. Hildburghausen, 26 November 1704) # Sophie Amalie Elisabeth (b. Hildburghausen, 5 October 1705 – d. Hildburghausen, 28 February 1708) # Ernst Ludwig (b. Hildburghausen, 6 February 1707 – d. Hildburghausen, 17 April 1707) # Ernst Frederick II, Duke of Saxe-Hildburghausen (b. Hildburghausen, 17 December 1707 – d. Hildburghausen, 13 August 1745) # Frederick August (b. Hildburghausen, 8 May 1709 – d. Hildburghausen, 1710) # Ludwig Frederick (b. Hildburghausen, 11 September 1710 – d. Nimwegen, 10 June 1759), married on 4 May 1749 to Christine Luise von Holstein-Plön. This marriage was childless. # Stillborn son (Hildburghausen, 2 August 1711) # Stillborn son (Hildburghausen, 24 August 1712) # Elisabeth Albertine (b. Hildburghausen, 3 August 1713 – d. Neustrelitz, 29 June 1761), married on 5 May 1735 to Karl Ludwig Frederick of Mecklenburg-Strelitz, Herr of Mirow. # Emanuel Frederick Karl (b. Hildburghausen, 26 March 1715 – d. Hildburghausen, 29 June 1718) # Elisabeth Sophie (b. Hildburghausen, 13 September 1717 – d. Hildburghausen, 14 October 1717) # Stillborn son (Hildburghausen, 17 March 1719) # Georg Frederick Wilhelm (b. Hildburghausen, 15 July 1720 – d. Hildburghausen, 10 April 1721) # Stillborn son (Hildburghausen, 15 December 1721) Category:1681 births Category:1724 deaths Category:House of Wettin Category:German dukes and duchesses",
 "title": "Ernest Frederick I, Duke of Saxe-Hildburghausen"
}