{
 "id": "366889",
 "text": "Thomas Robert Cech (born December 8, 1947 in Chicago) is an American chemist who shared the 1989 Nobel Prize in Chemistry with Sidney Altman. They discovered that RNA was a catalyst. Cech discovered that RNA could itself cut strands of RNA, which showed that life could have started as RNA.The Nobel Prize in Chemistry 1989: Illustrated Presentation == Career == Cech also studied telomeres, and his lab discovered an enzyme, TERT (telomerase reverse transcriptase), which helps to restore telomeres after they are shortened during cell division.Telomeres, telomerase, and other noncoding RNAs , Howard Hughes Medical Institute, July 13, 2010 As president of Howard Hughes Medical Institute, he promoted science education, and he teaches an undergraduate chemistry course at the University of Colorado. He was elected a foreign member of the Academia Europaea in 1999. ==Research== Cech's main research area is transcription in the nucleus of cells. He studies how the genetic code of DNA is transcribed into RNA. In the 1970s, Cech discovered that an unprocessed RNA molecule could splice itself. In 1982, Cech became the first to show that RNA molecules are not restricted to being passive carriers of genetic information they can have catalytic functions and can take part in cellular reactions. RNA-processing reactions and protein synthesis on ribosomes are catalysed by RNA. RNA enzymes are known as ribozymes and are now used for gene technology. They also cut and destroy invading viral RNAs. ==References== ==Other websites== * Tom Cech iBioMagazine talk: \"Discovering Ribozymes\" * Chemical and Engineering News * The Nobel Prize in Chemistry 1989: Sidney Altman, Thomas R. Cech * The Nobel Prize in Chemistry 1989: Illustrated Presentation * Nobel autobiography Category:1947 births Category:Living people Category:Academics from Maryland Category:American molecular biologists Category:American Nobel Prize winners Category:Scientists from Chicago Category:Academics from Colorado Category:Members of Academia Europaea",
 "title": "Thomas Cech"
}