{
 "id": "366903",
 "text": "WorldCat is a very big online catalog, a list of books and things like books in tens of thousands of libraries in many countries. WorldCat was built by OCLC, which is an organization of libraries. WorldCat is maintained by the group of libraries in OCLC.OCLC, \"Vision, the world's libraries connected\"; retrieved 2012-10-19. ==History== In the 1970s, OCLC grew from a regional computer system for 54 Ohio colleges into an international network.OCLC, \"History of OCLC; retrieved 2012-10-19. In 1979, the first Canadian and the first international library joined OCLC. ===Timeline=== On August 26, 1971, the OCLC Online Union Catalog, now called WorldCat, went online.OCLC, \"Brief history of OCLC activities with national libraries outside the U.S.\"; retrieved 2012-10-19. * 1975 – Library and Archives Canada begins adding records * 1978 – Koninklijke Bibliotheek (National Library of the Netherlands) begins to participate * 1985 – British Library begins adding UKMARC records * 1987 – National Library of Scotland begins adding * 1987 – National Library of Wales begins contributing * 1987 – National Central Library, Taiwan begins adding * 1991 – Six staff members from the National Library of China help OCLC to add a computerized catalog of Chinese books * 1991 – National Library of Turkey becomes an OCLC member * 1992 – The National Library of Australia begins contributing * 1992 – National and University Library of Iceland begins adding * 1995 – National Library of the Czech Republic begins contributing * 1997 – National Library of New Zealand begins contributing * 1998 – National Library of Ireland begins adding * 1999 – National Diet Library of Japan begins adding records for Western-language materials * 1999 – National Library of Lithuania begins contributing * 1999 – National Library of South Africa begins adding * 2002 – Singapore National Union Catalog is added * 2003 – Deutsche Nationalbibliothek (German National Library), the Library of Congress and OCLC agree to develop a Virtual International Authority File * 2003 – Chilean Directorate of Libraries, Archives, and Museums (DIBAM) of the National Library begin contributing * 2004 – Bibliothèque nationale de France begins contributing * 2005 – National Library of Finland begins adding * 2005 – Iraqi National Library and Archive begins adding * 2006 – Deutsche Nationalbibliothek adds 4 million new records * 2006 – Dutch Union Catalog is added * 2007 – National Library of Mexico begins adding * 2007 – Swiss National Library adds * 2007 – Kungliga biblioteket (National Library of Sweden) adds * 2008 – National Library Service, Barbados adds * 2008 – National Library of Israel adds * 2008 – National Library of Spain adds * 2008 – Royal Library of Denmark and Danish Bibliographic Centre add * 2009 – National and University Library of Slovenia begins adding * 2010 – National Library of Serbia begins adding * 2012 – National Library of Norway begins adding == References == == More reading == * == Other websites == * WorldCat website * WorldCat Identities * What is OCLC? Category:1971 establishments Category:American websites",
 "title": "WorldCat"
}