{
 "id": "366942",
 "text": "Blake Ellender Lively (née Brown; born August 25, 1987) is an American actress and model who is known for her television role as Serena van der Woodsen on Gossip Girl. She is also known for her roles in Accepted, The Sisterhood of the Traveling Pants, The Private Lives of Pippa Lee, The Town, Green Lantern, The Age of Adaline, Savages and Deadpool & Wolverine ==Filmography== ===Movie=== Year Title Role Notes 1998 Sandman Trixie / Tooth Fairy 2005 Bridget Vreeland 2006 Accepted Monica Moreland 2006 Simon Says Jenny 2007 Elvis and Anabelle Anabelle Leigh 2008 Bridget Vreeland 2009 New York, I Love You Gabrielle DiMarco 2009 Young Pippa Lee 2010 Kristina \"Kris\" Coughlin 2011 Green Lantern Carol Ferris 2011 Hick Glenda 2012 Savages Ophelia \"O\" Sage 2015 Adaline Bowman 2016 Nancy Adams 2016 Café Society Veronica Hayes 2017 All I See Is You Gina 2018 Emily Nelson 2020 Stephanie Patrick 2024 IF Octopuss (voice) Deadpool & Wolverine Lady Deadpool (voice) Cameo It Ends with Us Lily Bloom Also executive producer 2025 Another Simple Favor Emily Nelson ===Television=== Year Title Role Notes 2007–2012 Gossip Girl Serena van der Woodsen Main role 2009 Saturday Night Live Herself (host) Episode: \"Blake Lively/Rihanna\" 2018 When You Wish Upon a Pickle: A Sesame Street Special Delivery person Television special ===Music videos=== Year Title Role Artist Notes 2010 \"I Just Had Sex\" Unsatisfied Girlfriend The Lonely Island featuring Akon 2014 \"Part II (On the Run)\" Herself Jay-Z featuring Beyoncé 2021 \"I Bet You Think About Me\" Taylor Swift featuring Chris Stapleton Co-writer, producer, and director == Personal life == Blake Ellender Brown was born on August 25, 1987 in Tarzana, California. She studied at Beverly Hills High School. She married Ryan Reynolds in September 2012 and shares four children with him. ==References== ==Other websites== * * * Category:1987 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from Los Angeles",
 "title": "Blake Lively"
}