{
 "id": "36705",
 "text": "An artificial or constructed language (sometimes called a conlang) is a language that has been made by a person or small group, instead of being formed naturally as part of a culture. Some constructed languages are designed for use in human communication (like the common Esperanto). Others are created for use in fiction, linguistic experiments, secret codes, or simply because the maker likes to play language games. Constructed languages can be split into a priori languages, which are made from scratch, and a posteriori languages, which borrow words and grammar from existing languages. Constructed languages can also be split into groups by purpose. These groups are: * Engineered languages (engelangs), which are split into philosophical languages and logical languages (loglangs) - designed for experiments in logic or philosophy * Auxiliary languages (auxlangs) - designed to be a lingua franca (common language between people with different native languages) for international communication (also called International Auxiliary Language, (IAL)) * Artistic languages (artlangs) - designed to look or sound pretty, to make a fictional world more believable, or just for fun. Some constructed languages also have constructed scripts to write them. == Some examples of constructed languages == *Atlantean *Basic English * Brithenig * Dothraki * Dutton's Speedwords * Esperantido * Esperanto * Folkspraak * Glosa * Ido * Interlingua * Interlingue (in the past: Occidental) * Interslavic * Klingon * Láadan * Latino moderne * Lingwa de planeta * Lojban * Middle-earth languages (Quenya, Sindarin) * Na'vi language * Newspeak * Talossan * Toki Pona * Volapük * Wenedyk == Other websites == * ENIONI Site dedicated to some constructed languages, mainly Esperanto, Idiom Neutral, Ido, Occidental/Interlingue, Novial, and Interlingua. It contains the magazines Posta Mundi, Vok Neutral, and IE Munde. * The Language Construction Kit * LingoJam - a tool for creating conlang translators Category:Language-related lists",
 "title": "Constructed language"
}