{
 "id": "367013",
 "text": "Jada Koren Pinkett Smith (born September 18, 1971) is an American movie, television, voice actress, movie produer and director, singer-songwriter, writers, and businesswoman. She is known for her roles as Carla Purty in The Nutty Professor and as Gloria the Hippo in Madagascar, Madagascar: Escape 2 Africa, and in Madagascar 3: Europe's Most Wanted. Jada was also entangled with August Alsina in 2016. She won an Image Award in 2010. Smith was born on September 18, 1971 in Baltimore, Maryland. She studied at the Baltimore School for the Arts and at North Carolina School for the Arts. Smith was married to Will Smith since 1997. They have three children. ==Filmography== Year Title Role Notes 1993 Menace II Society Ronnie 1994 The Inkwell Lauren Kelly Jason's Lyric Lyric A Low Down Dirty Shame Peaches 1995 Demon Knight Jeryline 1996 The Nutty Professor Carla Purty If These Walls Could Talk Patti Made-for- television movie Set It Off Lida \"Stony\" Newsom 1997 Scream 2 Maureen Evans Cameo Credited as \"Jada Pinkett\" 1998 Woo Woo Blossoms and Veils Raven Short film Return to Paradise M.J. Major Welcome to Hollywood Jada Pinkett Smith Cameo 1999 Princess Mononoke Toki Voice English dub 2000 Bamboozled Sloan Hopkins 2001 Kingdom Come Charisse Slocumb Ali Sonji Roi 2003 Maniac Magee Amanda Beale Made-for-television movie The Matrix Reloaded Niobe The Matrix Revolutions 2004 Collateral Annie Farrell 2005 Madagascar Gloria Voice A Christmas Caper Uncredited voice 2007 Reign Over Me Janeane Johnson 2008 The Women Alex Fisher The Human Contract Rita Debuted at Cannes Film Festival in May 2008 Written and directed by Pinkett Smith Madagascar: Escape 2 Africa Gloria Voice 2009 Merry Madagascar 2012 Men in Black 3 Party Guest Uncredited Madagascar 3: Europe's Most Wanted Gloria Voice 2013 Madly Madagascar 2014 Penguins of Madagascar Voice cameo 2015 Magic Mike XXL Rome 2016 Bad Moms Stacy 2017 Girls Trip Lisa Cooper 2019 Angel Has Fallen FBI Agent Helen Thompson 2021 The Matrix Resurrections Trinity Television Year Title Role Notes 1990 True Colors Beverly Episode: 'Life with Fathers\" Credited as \"Jada Pinkett\" 1990 Moe's World Natalie Television movie 1991 21 Jump Street Nicole Episode: \"Homegirls\" Credited as \"Jada Pinkett\" 1991 Doogie Howser, M.D. Trish Andrews Episode: \"Air Doogie\" Credited as \"Jada Pinkett\" 1991–1993 A Different World Lena James 46 episodes 2009–2011 Hawthorne Christina Hawthorne Lead role 2014–17 Gotham Fish Mooney Series regular (season 1) Special guest star (seasons 2-3) 2017 Carpool Karaoke: The Series Herself Episode: \"Queen Latifah & Jada Pinkett Smith\" 2018-present Red Table Talk Herself Host and executive producer Video games Year Title Role Notes 2003 Enter the Matrix Niobe Live-action cutscenes and voice ==References== ==Other websites== * * * * Category:1971 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American movie directors Category:American movie producers Category:American singer-songwriters Category:Actors from Baltimore Category:Singers from Baltimore Category:Writers from Baltimore",
 "title": "Jada Pinkett Smith"
}