{
 "id": "367082",
 "text": "\"Maamme\" (, meaning \"Our Land\") is the national anthem of Finland. The words of the song are based on the first chapter of the Swedish epic poem called The Tales of Ensign Stål, which was written by a priest named Johan Ludvig Runeberg, who was the national poet of Finland at the time. These words were later translated into the Finnish language. The melody of this song was composed by German-born musician Fredrich Pacius around the same time.The Finnish national anthem. This Is Finland. The national anthem of Finland is de facto; in other words, the Finnish national anthem is not official, because the Constitution has yet to mention a national anthem. This melody of the song is also the same one used in the national anthem of neighbouring Estonia. ==Lyrics== The original text to the song has eleven verses, but nowadays, only the first and last verses (highlighted in bold) are part of the national anthem. However, three verses – the first in Finnish and in Swedish, and the last in Finnish – can be sung if among the singers are Swedes and Finns together. Words of the song in Finnish Words of the song in Swedish Words of the song in English Vänrikki Stoolin tarinat (1919). Runeberg, Johan Ludvig. Translated by Paavo Cajander (1889). Vårt land — Finlands nationalsång. Nykarlebyvyer.nu. Our land, our land, our Fatherland! Ring out, dear word, oh sound! 𝄆 No rising hill, or mountain grand, No sloping dale, no northern strand, There is, more loved, to be found, Than this — our fathers’ ground. 𝄇 Our land is poor, and so shall be To him who gold will crave. The strangers proudly pass, but we Shall ever love this land, we see, In moor, and fell, and isle and wave, A golden land, so brave. We love our rippling brooks, so bright, Our gushing streams, so strong, The whisper of dark woods, at night, Our starry skies, our summer light, All, all that we, in sight and song, Have felt and lived among. Here fought our fathers, without fear, With sword, and plough, and thought. And here, in clouded times, and clear, With fortune in their front or rear, Their Finnish hearts have beat, and wrought And borne what bear they ought. Who tells, of all the fights, the tale, In which this folk withstood, When war did rage from dale to dale, When frost set in, with hunger’s wail? Who measured all their pouring blood, And all their patience good? And it was here their blood was shed, For us, here, on this shore; And it was here their joys were bred, Here, that their sighs were heaved and fled, That people’s who our burdens bore Before us, long before. Here it is sweet and good, we wot, All, too, is giv’n us here; However fate may cast our lot, A land, a fatherland, we’ve got. Will there a thing on earth appear More worthy, to hold dear? And here’s, and here’s this fatherland, Here every eye it sees; And we can stretch a pointing hand, To show, with joy, its sea and strand, And say, “Behold this country, this, Our Fatherland it is.” And if we once were made to rise To gold clouds, from below, And if we moved in starry skies, Where no one weeps, where no one sighs, To this poor lonely country, though, Our longing hearts would go. Oh land, the thousand lakes’ own land, Of faith, and lay, and glee, Where life’s main sea gave us a strand, Our fore-time’s land, our future’s land, Shy of thy poorness, never be, Be calm, be glad, be free! Thy blossom, hidden now from sight, Shall burst its bud ere long. Lo! from our love, shall rise aright, Thy sun, thy hope, thy joy, thy light, And higher, once, more full and strong, Shall ring Our Country’s song.Finland - National Anthem. Csridentity.com. ==References== Category:1840s songs Category:European anthems Category:National symbols of Finland",
 "title": "Maamme"
}