{
 "id": "367018",
 "text": "Addison Mitchell \"Mitch\" McConnell, Jr. (born February 20, 1942) is the senior United States Senator from Kentucky. He is a member of the Republican Party. He was the Minority Leader of the Senate. He is the longest-serving U.S. Senator in Kentucky history. McConnell holds conservative positions, despite regarding as a moderate Republican early in his career. ==Early life== Mitch McConnell was born to Julia (née Shockley) and Addison Mitchell McConnell at Helen Keller Memorial Hospital in Sheffield, Alabama on February 20, 1942. He grew up in segregated Athens, Alabama. They moved to southern Louisville, Kentucky and McConnell attended the duPont Manual High School. In 1964, he graduated with honors from the University of Louisville with a B.A. in political science. He graduated in 1967 from the University of Kentucky College of Law. ==Career== In 1984, McConnell ran for the United States Senate against two-term Democratic incumbent Walter \"Dee\" Huddleston. The election race wasn't decided until the last polls returned came in, and McConnell won by a thin margin—only 5,200 votes out of more than 1.8 million votes cast, just over 0.4%. McConnell was the only Republican Senate challenger to win that year, despite Ronald Reagan's landslide victory in the presidential election. Part of McConnell's success came from a series of television campaign spots called \"Where's Dee\", which featured a group of bloodhounds trying to find Huddleston, implying that Huddleston's attendance record in the Senate was less than stellar. It is likely that he was helped by Ronald Reagan's 21-point win in Kentucky that year. His campaign bumper stickers and television ads asked voters to \"Switch to Mitch\". McConnell has repeatedly been found to have the lowest home state approval rating of any sitting senator. In February 2025, McConnell announced that he would not run for re- election in 2026. ==Personal life== McConnell is a member of the Baptist Church. His first wife was Sherrill Redmon,John E. Kleber, Kentucky Bicentennial Commission, Thomas Dionsius Clark, and Lowell H. Harrison, \"The Kentucky Encyclopedia\", University Press of Kentucky, 1992, page 592, accessdate 2010-07-30 from whom he was later divorced; they have three daughters. His second wife, whom he married in 1993, is Elaine Chao, the Secretary of Transportation under Donald Trump and the former Secretary of Labor under George W. Bush (the first Asian American woman to serve in the Cabinet). Senator McConnell's personal fortune was between $9,839,049 to $44,587,000 in 2010 and he was ranked as the 10th wealthiest member of the U.S. Senate. In October 2024, the first autobiographical book, \"The Price of Power: How Mitch McConnell Mastered the Senate, Changed America, and Lost His Party\", about Mitch McConnell, will be released in the United States. ==References== ==Other websites== * Senator Mitch McConnell official U.S. Senate site * Mitch McConnell For U.S. Senate official campaign site Category:1942 births Category:Living people Category:Republican Party (United States) politicians Category:United States senators from Kentucky Category:Lawyers from Alabama Category:Minority leaders of the United States Senate Category:Majority leaders of the United States Senate Category:Politicians from Alabama Category:Politicians from Louisville, Kentucky Category:People from Tuscumbia, Alabama Category:People from Sheffield, Alabama Category:Lawyers from Kentucky Category:21st-century American politicians",
 "title": "Mitch McConnell"
}