{
 "id": "367087",
 "text": "The Chief Justice of Pakistan heads the Supreme Court of Pakistan. These are the names of the Chief Justices of the Supreme Court of Pakistan (known as the Federal Court until 1960). ==List== Number Name Period of office Length of term (years, days) Bar Appointed by 1 Sir Mian Abdul Rashid Lahore High Court Government of India Act 1935 2 Muhammad Munir Lahore High Court Malik Ghulam Muhammad 3 Muhammad Shahabuddin Madras High Court Ayub Khan 4 A.R. Cornelius Lahore High Court Ayub Khan 5 S.A. Rahman Lahore High Court Ayub Khan 6 Fazal Akbar East Pakistan High Court Ayub Khan 7 Hamoodur Rahman Calcutta High Court Ayub Khan 8 Yaqub Ali Lahore High Court Fazal Ilahi Chaudhry 9 S. Anwarul Haq Lahore High Court Fazal Ilahi Chaudhry 10 Mohammad Haleem Sindh High Court Zia-ul-Haq 11 Afzal Zullah Lahore High Court Ghulam Ishaq Khan 12 Nasim Hasan Shah Lahore High Court Ghulam Ishaq Khan Saad Saud Jan Lahore High Court Farooq Leghari 13 Sajjad Ali Shah Sindh High Court Farooq Leghari 14 Ajmal Mian Sindh High Court Wasim Sajjad 15 Saeeduzzaman Siddiqui Sindh High Court Rafiq Tarar 16 Irshad Hasan Khan Lahore High Court Rafiq Tarar 17 Bashir Jehangiri Peshawar High Court Pervez Musharraf 18 Sheikh Riaz Ahmad Lahore High Court Pervez Musharraf 19 Nazim Hussain Siddiqui Sindh High Court Pervez Musharraf 20 Iftikhar Muhammad Chaudhry (1st) Balochistan High Court Pervez Musharraf Javaid Iqbal Balochistan High Court Pervez Musharraf Rana Bhagwandas Sindh High Court Pervez Musharraf 20 Iftikhar Muhammad Chaudhry (2nd) Balochistan High Court Pervez Musharraf 21 A. H. Dogar Sindh High Court Pervez Musharraf 20 Iftikhar Muhammad Chaudhry (3rd) Balochistan High Court Asif Ali Zardari 20 Tassaduq Hussain Jillani Lahore High Court Mamnoon Hussain 22 Nasir-ul-Mulk Peshawar High Court Mamnoon Hussain 23 Jawwad S. Khawaja Lahore High Court Mamnoon Hussain 24 Anwar Zaheer Jamali Sindh High Court Mamnoon Hussain 25 Mian Saqib Nisar Lahore High Court Mamnoon Hussain 26 Asif Saeed Khan Khosa Lahore High Court Arif Alvi 27 Gulzar Ahmed Sindh High Court <!-- Arif Alvi<ref> 28 Umar Ata Bandial Lahore High Court Supreme Court of Pakistan 29 Qazi Faez Isa Balochistan High Court Supreme Court of Pakistan 30 Ijazul Ahsan Lahore High Court Supreme Court of Pakistan 31 Syed Mansoor Ali Shah Lahore High Court Supreme Court of Pakistan 32 Munib Akhtar Sindh High Court Supreme Court of Pakistan 33 Yahya Afridi Peshawar High Court Supreme Court of Pakistan * A Acting * ± Recess appointment, later rejected by the Supreme Judicial Council. All decisions voided due to illegality of appointment. * † Died in office ==References==",
 "title": "Chief Justice of Pakistan"
}