{
 "id": "367138",
 "text": "The Gheba tribe are a tribe from the Punjab, mostly located in the North- western portion of Rawalpindi Tehsil and Fateh Jang Tehsil of Attock District of Pakistan. They are generally classified as Mughals. == Origins == The origins of the Ghebas is subject to some dispute or controversy for quite some time;See Griffin and Massey, Chiefs and Families of Note in the Punjab Lahore, 1899, along with detailed appendices of pedigree tables according to most scholars, historians and early British Indian administrators of their native areas, the Ghebas, like their close kin the Jodhra tribe and Alpial, are of Hindu origins, probably Rajputs.Griffin and Massey Most of them settled in North-western portion of Rawalpindi Tehsil and Fateh Jang Tehsil. They were at one time spread out over a broader area, in both Punjab and Khyber Pakhtunkhwa areas of what is now Pakistan but over time, their main population came to live in Attock and Rawalpindi districts of northern Punjab. They were most probably descended from one Raja Dayanand, a Chauhan Rajput, through Rai Shankar, whose offspring 'Rai Gheba' converted to Islam and was given the title of 'Gheba Khan'.CH Hall and RT Burney, The Earliest History and Pedigrees of the Gheba and Jodhra Chiefs of Attock Monograph, Government of India Press, Calcutta, 1867 They have been Muslims since then and sizeable landowners in the districts they live in.Hall and Burney There is another view, often believed by most of the Gheba families, that they are not really Rajputs or Jatts but are Barlas Mughals,\"Gazetteer of the Attock District, 1930, Part 1\" (Punjab district gazetteers) Author Punjab (Pakistan) Edition 2, reprint Publisher Sang-e-Meel Publications, 1932 Original from the University of Michigan Digitized Aug 29, 2008 Length 326 pages Subjects Histoy == Villages == Whatever their origins, the Ghebas continue to be among the biggest landowners of northern Punjab, in present-day Pakistan. Popular villages of Gheba Sardars in Fateh jang are , Tajabara,Majia,jeendhar, Asthaal, Malal, Dhurnal, Dhari-Rai-Ditt and Shehr Rai-Sadullah-Khan ,khunda and Dehdar. several other villages that Ghebas own as landlord ,the arians are living in those villages as a tenents. The biggest and most important village of Ghebas Sardars in Attock area is Kot Fateh Khan, which is part of the Jagir estate of the Sardar of Kot.Attock Gazetteer 1907 page 94 == Occupations == Most of the Ghebas are landowners and engaged in agricultural activities.\"Gazetteer of the Attock District, 1907\", Author Punjab (Pakistan) Edition 2, reprint Publisher Sang-e-Meel Publications. Original from the University of Michigan Subjects Histoy == Related pages == * * * == References == Category:Punjabi people Category:Ethnic groups in Pakistan Category:Tribes of Pakistan",
 "title": "Gheba tribe"
}