{
 "id": "367244",
 "text": "Sardar Aurangzeb Khan (1899-1965) was a politician from Dera Ismail Khan district of NWFP, British India. He belonged to Gandapur Pashtun tribe and belonged to a landowning family. Sardar Aurangzeb Khan was born in 1899 at Tehsil Kulachi Dera Ismail Khan. His father, Mohammad Ayaz Khan, was a leading landlord in the famous Pushtoon clan Gandapur.https://storyofpakistan.com/sardar-aurangzeb-khan/ ==Early education== He got his early education at Mission High School Dera Ismail Khan and later went to Peshawar for his graduation. He secured his LLB degree from Aligarh College where he was the president of Muslim Students Union. ==Political Career== He was a gifted orator and as Provincial Muslim League leader, he played a prominent role in the reorganization of the Muslim League in NWFP that was first launched in 1912 by Ghazi Ali Abbas Bukhari but did not take firm roots among the people. However, due to his tireless struggle, the League turned out to be the popular political party in the Pushtoon majority province. Khan joined the All India Muslim League party in 1937 and in the same year was appointed to the NWFP Legislative Assembly. In 1940, he was one of the provincial delegates to the Lahore session of the League and was a member of the Working Committee set up there to draft what was to become the 'Lahore Resolution'. Sardar Aurangzeb Khan was also one of those leaders who seconded the resolution that was passed on 23 March 1940. He was elected to the NWFP provincial assembly in 1937. Between 1943-45 he also briefly remained provincial Chief Minister before being removed. In 1939, while Dr. Khan Sahib resigned from his ministry along with other Congress Governments, for some time there was no popular government in the province. However, on 25 May 1943, Sardar Aurangzeb Khan was able to form a ministry with the help of George Cunningham and Jinnah, with Sardar Abdur Rab Nishtar as his Finance Minister. Nishtar was in an anti-British movement named \"Akhrar\" but he was convinced by Sikandar Mirza and then he joined the Muslim League. He campaigned door-to- door to convey message of the League and worked hard during NWFP referendum. After the independence of Pakistan in 1947, he served for some time as the new country's ambassador to Burma from 1949 to 1953. ==References== Category:1899 births Category:1965 deaths Category:Muslim League Category:Politicians from Khyber Pakhtunkhwa Category:People of British India Category:Ambassadors Category:Dera Ismail Khan District Category:Asian diplomats",
 "title": "Aurangzeb Khan"
}