{
 "id": "367255",
 "text": "The savant syndrome is a rare condition in which people with neurodevelopmental disorders, notably autism spectrum disorders, and/or brain injuries, demonstrate profound and prodigious capacities and/or abilities far in excess of what would be considered normal. In spite of the name syndrome, it is not recognized as a mental disorder, or as a part of mental disorder. In simple terms these are very gifted individuals with fewer than 50 alive today. ==Characteristics== These individuals in some cases may not be able to tie their shoes, however they may memorize an entire book in days. ===Notable savants=== The following are well-known people with savant syndrome, noted for their talent in their identified fields: * Wesley Willis, American musician, savant levels of visual recall. * Kim Peek, mnemonist, speed reader and calculator, although not autisticWeber B (26 December 2009). \"Kim Peek, inspiration for 'Rain Man,' dies at 58\". The New York Times. Retrieved 24 January 2010. * Mark Boerebach, Australian internet Disk jockey, subject of the documentary Rainman goes to Rockwiz * Alonzo Clemons, American clay sculptor * Tony DeBlois, blind American musician * Leslie Lemke, blind American musician * Jonathan Lerman, American artistJonathan Lerman: * * * Thristan Mendoza, Filipino marimba prodigy * Gottfried Mind, Swiss artist known as the \"Raphael of Cats\" * Derek Paravicini, blind British musicianDerek Paravicini: * * * Anthony Torrone, American Christian writer * Gilles Tréhin, artist, author * James Henry Pullen, gifted British carpenterJames Henry Pullen: *Ward, O. Conor. \"The Childhood and the Life of James Henry Pullen, the Victorian Idiot Savant (1832–1916)\", Abstract of article cited at adc.bmjjournals.com Retrieved on 14 June 2006. * * Matt Savage, American autistic jazz prodigy\"Matt Savage: The Prodigy\", People magazine June 17, 2002 * Henriett Seth F., Hungarian autistic savant, poet, writer, and artist * Stephen Wiltshire, British architectural artist * Richard Wawro, British artist * George and Charles Finn, calendar calculator twinsHorwitz, et al., 1965Sacks, Oliver, 1985 * Florence 'Flo' and Katherine 'Kay' Lyman, calendar calculator twins. Featured in a documentary produced by TV network TLC entitled Twin Savants: Flo & Kay * Jason D. Padgett, American mathematical artistFederal Way Man Has Amazing Mathematical Drawing Ability, Following Brain Injury: – KCPQ . Q13fox.com (2010-08-26). Retrieved on 2011-12-18. * Daniel Tammet, British author. * Rex Lewis-Clack, blind American pianist. * Blind Tom Wiggins, blind African American pianist. * Orlando Serrell, sudden savant, calendrical calculation, mnemonist, featured on English version of Expedition ins Gehirn. ==References== ==Other websites== * The Wisconsin Medical Society lists 29 savant profiles . Category:Syndromes Category:Giftedness",
 "title": "Savant syndrome"
}