{
 "id": "367298",
 "text": "Aaron Hunt (born 4 September 1986, in Goslar, Germany) is a German football player. He plays as midfielder for Werder Bremen since 2004. == Club career == Hunt started playing football at the age of 7 and played for two local clubs in the Harz area during his childhood. In 2002 he joined the youth team of Werder Bremen. Two years late he debuted in the Bundesliga as a substitute against Hannover 96.Werder mit glanzlosem Pflichtsieg (in German). Kicker. Retrieved 22 October 2012 He shot his first goal against Borussia Mönchengladbach on 12th February 2005, when he also debuted in the first squad.Werders zweite Sturm-Garde kam, sah und traf (in German). Kicker. Retrieved 22 October 2012 On 28 November 2007 he shot in first goal in the Champions League against Real Madrid. Before that game he has been injured for 7 months. Bremen won that match 3-2.Traumduo Rosenberg & Sanogo (in German). Kicker. Retrieved 22 October 2012 In the 2008/09 season he won the DFB-Pokal with Werder, after winning 1-0 in the final against Bayer Leverkusen.Werder Bremen gewinnt den DFB-Pokal 2009 (in German). FAZ. Retrieved 22 October 2012 His team was also in the final match of the UEFA CUP, but lost against Shakhtar Donetsk 1-2 in the extra time.S Donetsk 2-1 W Bremen. BBC. Retrieved 22 October 2012 In 2010 he renewed his contract until 2014.Aaron Hunt verlängert bei Werder Bremen (in German). SportBild. Retrieved 22 October 2012 In 2012 he was made vice captain of his team by his coach Thomas Schaaf.Aaron Hunt ist Vize-Kapitän (in German). Radio Bremen. Retrieved 22 October 2012 He is the most loyal player in the squad of Werder Bremen.Aaron Hunt bei Werder Bremen: Dienstältester Spieler (in German). Süddeutsche Zeitung. Retrieved 22 October 2012 == International career == His mother is from England, so he would have been allowed to play for the national team of England. He played for Germany at the Under-16, Under-17 and Under-21 level, so he refused English offers and decided to play for Germany.Aaron Hunt tells England: thanks but no thanks, I'll play for Germany. The Guardian. Retrieved 22 October 2012Aaron Hunt turns down plea to play for England and pledges his future to Germany. Daily Mail. Retrieved 22 October 2012 In November 2009 he debuted against the Côte d'Ivoire for the a-squad in a friendly.Podolski rettet das Remis (in German). Kicker. Retrieved 22 October 2012 This game was the memorial game for the goalkeeper Robert Enke, who committed suicide.Deutschland - Elfenbeinküste Ein Lob für Kießling (in German). Süddeutsche Zeitung. Retrieved 22 October 2012 He also made a secound match against Denmark in August 2010.Match report (in German). Yahoo. Retrieved 22 October 2012 In 2013 has was nominated by national coach Joachim Löw for two matches.Löw holt Kruse und Müller - Beck kann nicht mehr (in German). Kicker. Retrieved 5 June 2013 In the match against Ecuador has was brought on in minute 59.Löws zweiter Anzug passt (in German). Kicker. Retrieved 6 June 2013 == Club career statistics == |- |2004/05||rowspan=\"9\"|Werder Bremen||rowspan=\"9\"|Bundesliga||10||1||2||0||1||0||13||1 |- |2005/06||7||0||3||2||6||0||16||2 |- |2006/07||28||9||1||0||12||0||41||9 |- |2007/08||14||1||1||0||5||1||20||2 |- |2008/09||18||2||2||0||8||0||28||2 |- |2009/10||32||9||6||1||10||1||48||11 |- |2010/11||29||3||2||0||7||0||38||3 |- |2011/12||18||3||1||0|| || ||19||3 |- |2012/13||28||11||1||0|| || ||29||11 184||39||20||3||49||2||253||44 184||39||20||3||49||2||253||44 == International career statistics == |- |2009||1||0 |- |2010||1||0 |- |2013||1||0 |- !Total||3||0 |} == Honours == * DFB-Ligapokal: 2006Ligapokal 2006 - Finale (in German). Rheinische Post. Retrieved 22 October 2012 * DFB-Pokal: 2009 == Private life == Hunt is married to Semra Polatgil, who also played football for TV Jahn Delmenhorst.Hunt feiert Traumhochzeit (in German). Syker Kreiszeitung. Retrieved 22 October 2012 == References == == Other websites == * Profile at werder.de * Profile at fussballdaten.de * Profile at transfermarkt.de Category:1986 births Category:Living people Category:German footballers Category:Sportspeople from Lower Saxony Category:Werder Bremen players",
 "title": "Aaron Hunt"
}