{
 "id": "367366",
 "text": "The Rhind papyrus in the British Museum is the best example of Egyptian mathematics. It is named after Alexander Henry Rhind, a Scottish antiquarian. He bought the papyrus in 1858 in Luxor, Egypt. It was found during illegal excavations in or near the Ramesseum. It was written about 1650 BC. The papyrus has work and writing on arithmetic, algebra, geometry, trigonometry, and fractions. It, and the Moscow Mathematical Papyrus, are the main sources of knowledge about mathematics in Ancient Egypt. The Rhind papyrus dates to about 1550 BC. The museum bought both the Rhind papyrus and the Egyptian Mathematical Leather Roll from Rhind.Clagett, Marshall 1999. Ancient Egyptian science: a source book. vol 3, Ancient Egyptian mathematics. Memoirs of the American Philosophical Society. The Rhind papyrus is larger than the Moscow mathematical papyrus, but the Moscow papyrus is older.Spalinger, Anthony 1990. The Rhind Mathematical Papyrus as a Historical Document. Studien zur Altägyptischen Kultur. 17 The Rhind papyrus dates to the Second Intermediate Period of Egypt. It was copied by the scribe Ahmose from a now-lost text from the reign of Amenemhat III (12th dynasty). Written in the hieratic script, this Egyptian manuscript is made up of parts that are each 33 cm tall. In total it is over long. It was transliterated and the mathematics was translated in the late 19th century. The mathematical translation is still incomplete in some respects. The document is dated to year 33 of the Hyksos king Apophis and also contains a separate later Year 11 on its verso likely from his successor, Khamudi.cf. Thomas Schneider's paper 'The relative chronology of the Middle Kingdom and the Hyksos Period (Dyns. 12-17)' in Erik Hornung, Rolf Krauss & David Warburton (eds), Ancient Egyptian Chronology. Handbook of Oriental Studies, Brill: 2006, p.194-195 In the opening paragraphs of the papyrus, Ahmose presents the papyrus as giving \"Accurate reckoning for inquiring into things, and the knowledge of all things, mysteries... all secrets\". He continues with: > This book was copied in regnal year 33, month 4 of Akhet, under the majesty > of the King of Upper and Lower Egypt, Awserre, given life, from an ancient > copy made in the time of the King of Upper and Lower Egypt Nimaatre (?). The > scribe Ahmose writes this copy. Several books and articles about the Rhind Mathematical Papyrus have been published, and a handful of these stand out. The Rhind Papyrus was published in 1923 by Peet and contains a discussion of the text that followed Griffith's Book I, II and III outline Peet, Thomas Eric 1923. The Rhind Mathematical Papyrus, British Museum 10057 and 10058. London: The University Press of Liverpool and Hodder & Stoughton. Chase published a compendium in 1927/29 which included photographs of the text.Chace, Arnold Buffum. 1927-1929. The Rhind Mathematical Papyrus: free translation and commentary with selected photographs, translations, transliterations and literal translations. Classics in Mathematics Education 8. 2 vols. Oberlin: Mathematical Association of America. (Reprinted Reston: National Council of Teachers of Mathematics, 1979). A more recent overview of the Rhind Papyrus was published in 1987 by Robins and Shute.Robins, R. Gay, and Charles C. D. Shute. 1987. The Rhind Mathematical Papyrus: An Ancient Egyptian Text. London: British Museum Publications Limited. ==Other websites== *Allen, Don. April 2001. The Ahmes Papyrus and Summary of Egyptian Mathematics . * *British Museum webpage on the Papyrus. *O'Connor and Robertson, 2000. Mathematics in Egyptian Papyri. *Truman State University, Math and Computer Science Division. Mathematics and the Liberal Arts: The Rhind/Ahmes Papyrus. * *Williams, Scott W. Mathematicians of the African Diaspora, containing a page on Egyptian Mathematics Papyri. *BBC audio file A History of the World in 100 Objects. (15 mins) ==References== Category:Mathematics literature Category:2nd millennium BC in Egypt Category:2nd millennium BC works Category:Luxor Governorate Category:Ancient Egyptian literature",
 "title": "Rhind Mathematical Papyrus"
}