{
 "id": "367788",
 "text": "The Jadoon, also known as Gadoon or Jadun (; Hindko: جدون) is a Pashtun tribe primarily residing in the Hazara and Kohistan regions as well as in the Swabi district of the Khyber Pakhtunkhwa province of Pakistan. This tribe also live in Nangarhar and Kunar in Afghanistan. ==History== The Jadoon tribe traces its origins to Afghanistan, specifically to the Ghurghusht branch of the Pashtun tribes. According to tribal traditions, the Jadoons are descendants of Ghurghusht, one of the four sons of Qais Abdur Rashid, the legendary ancestor of the Pashtuns. The tribe migrated from their original homeland in Afghanistan to the plains of the present-day Swabi and Mardan areas and eventually settled in the Hazara region around the 16th or 17th century. The Jadoons were traditionally a warlike and agricultural people, and they also had a warrior tradition, as was common among Pashtun tribes. Over time, the tribe integrated with the local populations in Hazara and developed a distinct identity tied to both their Pashtun roots and the unique characteristics of the region. ==Arrival in Hazara== The Jadoons migrated from the Swabi-Mardan region towards the Hazara hills in response to various pressures, including conflicts and competition with neighboring tribes. In Hazara, they fought against local tribes like dilazak karlal awans, etc., and settled primarily in what are now the districts of Abbottabad and Haripur. The fertile lands and hilly terrain of Hazara provided the Jadoons with a suitable environment for agriculture, which became their primary livelihood. Over time, the Jadoons established themselves as one of the significant tribes of Hazara. They were known for their strong sense of independence and maintained tribal structures of governance, with tribal elders playing a central role in decision-making. ==Jadoons during Sikh rule== The Jadoon tribe, living primarily in the Hazara region, was one of the tribes that resisted Sikh rule. Like other Pashtun and Hindko-speaking tribes in the area, the Jadoons valued their independence and were unwilling to accept the dominance of the Sikh rulers. They, along with other tribes such as the Tanaolis, Karlals, and Swatis, engaged in several uprisings and skirmishes against the Sikh forces. The mountainous terrain of Hazara made it difficult for the Sikhs to maintain complete control over the region, and many of the local tribes, including the Jadoons, took advantage of this to conduct guerrilla-style resistance. The Sikh governors in Hazara, such as Hari Singh Nalwa (one of Maharaja Ranjit Singh's most trusted generals), had to deal with frequent rebellions and unrest in the region. Hari Singh Nalwa was appointed as the governor of Hazara in 1822 and is credited with building several forts in the area, including one in Haripur, to maintain order and control over the rebellious tribes. == Impacts of Sikhs== The Sikh policies of heavy taxation, forced conscription, and punitive expeditions against tribes that resisted their rule caused hardship for the Jadoon tribe, as well as other tribes in the region. While some tribal leaders sought to negotiate with the Sikhs to protect their people, others continued to resist, leading to cycles of conflict and retaliation. Despite Sikh attempts to subdue the region, the Jadoons and other tribes managed to maintain a degree of autonomy by retreating into the hills and launching periodic attacks against Sikh forces. The resistance of the Jadoon tribe, along with other tribes in Hazara, persisted throughout the Sikh period, though the Sikhs managed to maintain nominal control over the region until the fall of the Sikh Empire in 1849. == References == Category:Ethnic groups in Pakistan Category:Tribes of Pakistan Category:Ethnic groups in Khyber Pakhtunkhwa Category:Abbottabad District",
 "title": "Jadoon"
}