{
 "id": "367867",
 "text": "David Hyde Pierce (born April 3, 1959) is an American actor, comedian and writer. He is known for his role as Dr. Niles Crane in Frasier. He won four Emmy Awards for his role as Dr. Niles Crane and also won two Screen Actors Guild Award, a TCA Award, and a Tony Award. Pierce was born on April 3, 1959 in Saratoga Springs, New York. He studied at Yale University. Pierce is openly gay. He has been married to Brian Hargrove since 2008. == Filmography == Year Title Role Notes 1988 The Appointments of Dennis Jennings Businessman Short film 1988 Bright Lights, Big City Bartender at Fashion Show 1988 Crossing Delancey Mark 1988 Rocket Gibraltar Monsieur Henri 1989 Vampire's Kiss Theater Guy 1990 Across Five Aprils Union Soldier 1991 Little Man Tate Garth Emmerick 1991 The Fisher King Lou Rosen 1993 Sleepless in Seattle Dennis Reed 1993 Addams Family Values Delivery Room Doctor 1994 Wolf Roy 1995 Ripple Peter Short film 1995 Nixon John Dean Nominated—Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 1998 A Bug's Life Slim Voice 1999 I Hate County Slim Voice 1999 The Mating Habits of the Earthbound Human Narrator Voice 2000 Isn't She Great Michael Hastings 2000 Chain of Fools Mr. Kerner 2000 The Tangerine Bear Bird Voice 2001 Wet Hot American Summer Henry Newman 2001 Happy Birthday Barney Short film 2001 Osmosis Jones Drix Voice 2001 Laud Weiner Laud Weiner Short film 2002 Full Frontal Carl 2002 Treasure Planet Doctor Doppler Voice 2003 Down with Love Peter MacMannus 2004 Hellboy Abe Sapien Voice Uncredited 2008 Forever Plaid: The Movie Narrator Voice 2009 Stingray Sam Narrator Voice 2010 The Perfect Host Warwick Wilson ==References== ==Other websites== * * Category:1959 births Category:Living people Category:Actors from New York (state) Category:American movie actors Category:American radio actors Category:American stage actors Category:American television actors Category:American voice actors Category:Comedians from New York (state) Category:Emmy Award winning actors Category:Gay men Category:LGBT actors Category:LGBT comedians Category:LGBT people from New York (state) Category:American LGBT writers Category:Screen Actors Guild Award winners Category:Tony Award winning actors Category:Writers from New York (state)",
 "title": "David Hyde Pierce"
}