{
 "id": "368079",
 "text": ", also known as , is a Japanese Shinto shrine in the city of Usa in Ōita Prefecture on the island of Kyushu.Nussbaum, Louis-Frédéric. (2005). \"Usa Hachiman-gū\" in Japan Encyclopedia, p. 1017. ==History== The shrine was founded in the Wadō era (708-714).Ponsonby-Fane, Richard. (1962). Studies in Shinto and Shrines, p. 195. A Buddhist temple called Miroku-ji was built next to it in 779, making it what is believed to be the first shrine-temple (jingū- ji) ever.Shively, Donald H. (1993). Cambridge History of Japan, Vol. 2, pp. 524–530. The shrine-temple complex, called , lasted until 1868. Usa first appears in the chronicles of Imperial history during the reign of Empress Shōtoku.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 78-81; Brown, Delmer M. (1993). The Cambridge History of Japan, p. 411 n144 citing Ross Bender, \"The Hachiman Cult and the Dōkyō Incident\" in Monumenta Nipponica. 24 (Summer 1979): 124. Usa jingū was designated as the chief Shinto shrine (ichinomiya) for the old Buzen Province. It serves today as one of the ichinomiya of Oita and Fukuoka Prefectures. \"Nationwide List of Ichinomiya,\" p. 3. ; retrieved 2011-08-09 From 1871 through 1946, Usa was officially listed among the first rank of government supported shrines.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, pp. 124-126; other similarly honored Hachiman shrines were Iwashimizu Hachiman-gu of Yawata in Kyoto Prefecture and Hakozaki-gū of Fukuoka in Fukuoka Prefecture ===Branch shrines=== Usa is today the center of over 40,000 branch Hachiman shrines.Ministry of Land, Infrastructure and Transport (MLIT), Usa Jinju Shrine In Shinto belief, the many Hachiman shrines have extended the reach of the kami at Usa.Hardacre, Helen. (1989). Shinto and the State, 1868-1988, p. 12. ==References== ==Other websites== * Shrine image, 180° panorama Category:Kanpei-taisha Category:Hachiman shrines Category:Chokusaisha Category:Shinto shrines in Ōita Prefecture",
 "title": "Usa Jingū"
}