{
 "id": "368033",
 "text": "Anaerobic respiration is a form of respiration which does not use oxygen. Elements other than oxygen are used for electron transport. Common replacements for oxygen are nitrates, iron, manganese, sulfates, sulfur, fumaric acid and carbon dioxide. Escherichia coli uses nitrates and fumaric acid for respiration. For the electron transport chain to work, there must be a final electron acceptor at the end of the chain.electron acceptor = a chemical entity that accepts electrons transferred to it from another compound. USGS Electron acceptor. This allows electrons to pass through the chain. In aerobic organisms, this final electron acceptor is oxygen. Molecular oxygen is a highly oxidizing agent and so it is an excellent acceptor. In anaerobes, other less-oxidizing substances such as sulphate (SO42−), nitrate (NO3−), sulphur (S) are used. These terminal electron acceptors have smaller reduction potentials than O2, so less energy is released per oxidized molecule.reduction potential = a measure of how easily a chemical species accepts electrons and so is reduced. Anaerobic respiration is therefore less efficient than aerobic respiration except, of course, when oxygen is scarce or not apparent. If there is no oxygen present, glycolysis is still able to happen. Pyruvic acid is still produced, but instead of proceeding to the Krebs cycle, lactic acid is formed making small amounts of ATP. An example of this is when exercising: if the body is not able to get enough oxygen to the muscles, they will make lactic acid. This is what makes the muscles sore. If oxygen is not used at all, the process is called fermentation. Examples of organisms using fermentation are lactic acid bacteria, and yeast. Yeast is a fungi, not bacteria. The equation for anaerobic respiration in yeast and bacteria: * Glucose -> Carbon dioxide + ethanol The equation for anaerobic respiration in animals is: *glucose -> lactic acid (C6H12O6 -> 2C3H6O3) After producing lactic acid more oxygen then in normal respiration is required to break it down (oxygen debt). == References == Category:Cellular respiration",
 "title": "Anaerobic respiration"
}