{
 "id": "368173",
 "text": "Home on the Range is a 2004 American animated western musical comedy movie. It was released by Walt Disney Pictures on April 2, 2004. It is the 44th movie in the Walt Disney Animated Classics series named after the popular country song of the same name. The movie follows a trio of dairy cows attempting to save the farm from an infamous cattle rustler. == Cast == * Roseanne Barr as Maggie, a hereford show cow and the newest animal on Little Patch of Heaven farm. Chris Buck served as the supervising animator for Maggie. * Judi Dench as Mrs. Calloway, a Holstein cow and the leader of the animals on the farm, and the only cow with a British accent. Duncan Marjoribanks served as the supervising animator for Mrs. Calloway. * Jennifer Tilly as Grace, an optimistic and innocent-minded jersey cow. Mark Henn served as the supervising animator for Grace. * Cuba Gooding Jr. as Buck, a Thoroughbred horse and Rico's biggest fan that dreams of being a hero. Michael Surrey served as the supervising animator for Buck. * Randy Quaid as Alameda Slim, a cattle rustler wanted by law. Dale Baer served as the supervising animator for Slim. * Charles Dennis as Rico, a famous bounty hunter and Buck's idol who secretly uses his job effectively to cover up Slim's trail. Russ Edmonds served as the supervising animator for Rico. * Charles Haid as Lucky Jack, a clumsy jackrabbit with a wooden leg that he says brings good luck. Shawn Keller served as the lead animator for Lucky Jack. * Carole Cook as Pearl Gesner, a farmer who is the owner of Patch of Heaven. Bruce W. Smith served as the supervising animator for Pearl. * Joe Flaherty as Jeb, a goat living in Patch of Heaven who collects a bunch of cans that he is protective of. Sandro Cleuzo served as the supervising animator of Jeb. * Steve Buscemi as Wesley, a black market businessman and former clown college student who negotiates with Slim. Mark Henn served as the supervising animator for Wesley. * Sam J. Levine as the Willie Brothers, Slim's three dimwitted nephews and henchmen. Russ Edmonds served as the supervising animator for the Willies. * Richard Riehle as Sam Brown, the town's sheriff and Buck's owner. Sandro Cleuzo served as the supervising animator of the Sheriff. * Lance LeGault as Junior, Alameda Slim's pet buffalo who serves as Slim's mode of transportation. Dale Baer served as the supervising animator for Junior. * G.W. Bailey as Rusty, Sam's basset hound and Buck's best friend. Mark Henn served as the supervising animator for Rusty. * Estelle Harris as Audrey, a chicken living in Patch of Heaven. * Charlie Dell as Ollie, a pig living in Patch of Heaven. * Bobby Block, Keaton Savage, and Ross Simanteris as The Piggies, Ollie's children. * Marshall Efron as Larry, a duck living in Patch of Heaven. * Mark Walton as Barry and Bob, two Texas longhorns that become smitten with Maggie, Mrs. Calloway, and Grace. * Governor Ann Richards as Annie, a saloon owner whose saloon the cows mistake for Sam's office. * Dennis Weaver as Abner Dixon, Maggie's former owner. * Patrick Warburton as Patrick, a horse who takes Rico to Slim's lair. == References == Category:2004 animated movies Category:2004 musical movies Category:American musical movies Category:American family movies Category:Disney animated movies Category:Movies set on farms Category:2000s buddy comedy movies Category:Movies composed by Alan Menken Category:Movies about pigs Category:Movies about birds Category:Movies about rabbits and hares Category:Movies about horses Category:2000s Western (genre) movies Category:American Western (genre) movies Category:American buddy comedy movies",
 "title": "Home on the Range (2004 movie)"
}