{
 "id": "368152",
 "text": "Claudio Castagnoli (born December 27, 1980), is a Swiss professional wrestler. He currently wrestles for All Elite Wrestling (AEW). He is also known for his time in WWE. He wrestled there using the ring name Antonio Cesaro and Cesaro. He previously wrestled for many different independent promotions. These include Chikara, Pro Wrestling Guerrilla, Ring of Honor and Pro Wrestling Noah. While in Ring of Honor, he was a two-time ROH World Champion and a two- time ROH World Tag Team Champion with his tag team partner Chris Hero. Their tag team name was the Kings of Wrestling. They were champions for 364 days. That is the longest time anyone has been tag champions in the company's history. He was also a member of the team Swiss Money Holding, with Ares. In tag team competition, he won the Chikara Campeonatos de Parejas twice, the JCW Tag Team Championship once, and the CZW World Tag Team Championship twice. In WWE, he was a one-time WWE United States Champion, five-time WWE Raw Tag Team Champion, two-time WWE SmackDown Tag Team Champion and the winner of the André the Giant Memorial Trophy battle royal at WrestleMania XXX. ==Championships and accomplishments== *All Elite Wrestling ** AEW World Trios Championship (one time) – with Pac, and Wheeler Yuta *Chikara **Chikara Campeonatos de Parejas (two times) (with Chris Hero (one) and Ares (one)) **King of Trios (2010) (with Ares and Tursas) **Tag World Grand Prix (2005) (with Arik Cannon) **Tag World Grand Prix (2006) (with Chris Hero) **Torneo Cibernético (2007) *Cleveland All-Pro Wrestling **CAPW Unified Heavyweight Championship (one time) *Combat Zone Wrestling **CZW World Tag Team Championship (two times) (with Chris Hero) **Last Team Standing (2006) (with Chris Hero) *German Stampede Wrestling **GSW Tag Team Championship (two times) (with Ares) *Juggalo Championship Wrestling **JCW Tag Team Championship (one time) (with Chris Hero) *International Pro Wrestling: United Kingdom **IPW: UK Tag Team Championship (one time) (with Ares) *Independent Wrestling Association: Switzerland **IWA Switzerland World Heavyweight Championship (one time) *Pro Wrestling Guerrilla **PWG World Championship (one time) *Pro Wrestling Illustrated **He was ranked #18 of the top 500 singles wrestlers by PWI in the PWI 500 in 2013. *Ring of Honor **ROH World Championship (two times) **ROH World Tag Team Championship (two times) (with Chris Hero) **Race to the Top (2007) **Tag Wars (2010) (with Chris Hero) *Swiss Wrestling Federation **SWF Powerhouse Championship (two times) **SWF Tag Team Championship (one time) (with Ares) *Westside Xtreme Wrestling **wXw World Heavyweight Championship (two time) **wXw World Tag Team Championship (three times) (with Ares) *WWE **WWE United States Championship (one time) **WWE (Raw) Tag Team Championship (5 times) (with Tyson Kidd (1) and Sheamus (4)) **WWE SmackDown Tag Team Championship (2 times) (with Sheamus (1) and Shinsuke Nakamura (1)) **André the Giant Memorial Trophy *Wrestling Observer Newsletter **Most Underrated (2013) **Tag Team of the Year (2010) (with Chris Hero) == References == ==Other websites== * * Category:1980 births Category:Living people Category:All Elite Wrestling people Category:Former WWE wrestlers Category:Sportspeople from the canton of Lucerne Category:People from Lucerne Category:Professional wrestlers Category:Swiss wrestlers",
 "title": "Claudio Castagnoli"
}