{
 "id": "368522",
 "text": "Bedknobs and Broomsticks is a 1971 musical movie produced by Walt Disney Productions. It combines live action and animation. It was released in North America on December 13, 1971. It is based on the books The Magic Bed Knob; or, How to Become a Witch in Ten Easy Lessons and Bonfires and Broomsticks by English children's author Mary Norton. The movie is often compared to Mary Poppins. It is also partly set in the streets of London. It shares some of the cast from Mary Poppins, a similar crew, the same songwriters and director.'Bedknobs and Broomsticks: Cast & Crew' movies.msn.com'Bedknobs & Broomsticks' Turner Classic Movies Database The movie was made at Walt Disney Studios. The castle scenes were shot on location at Corfe Castle, Dorset, England, UK.IMDB Bedknobs and Broomsticks. December 2011 ==Cast== * Angela Lansbury as Miss Eglantine Price, an apprentice witch. * David Tomlinson as Emelius Browne, Miss Price's former teacher and headmaster of Correspondence College of Witchcraft. * Roddy McDowall as Mr. Rowan Jelk, the local vicar * Sam Jaffe as Bookman, an antiquarian book merchant * John Ericson as Colonel Heller, leader of German invasion force. * Bruce Forsyth as Swinburne, Bookman's assistant The Children: * Cindy O'Callaghan as Carrie * Roy Snart as Paul * Ian Weighill as Charlie * Tessie O'Shea as Mrs. Jessica Hobday * Arthur Gould-Porter as Captain Bill Ainsley Greer * Ben Wrigley as Portobello Road workman * Reginald Owen as Major General Sir Brian Teagler, leader of the Home Guard. This is Owen's last film before his death the next year. * Cyril Delevanti as Elderly farmer * Rick Traeger and Manfred Lating as German sergeants The voices of: * Robert Holt as Codfish * Lennie Weinrib as Secretary Bird and Lion * Dal McKennon as Bear ==Awards== *Best Visual Effects (won) (Alan Maley, Eustace Lycett, and Danny Lee) *Nominations *Best Art Direction (John B. Mansbridge, Peter Ellenshaw, Emile Kuri and Hal Gausman) *Best Costume Design *Best Scoring Adaptation and Original Song Score *Best Original Song for \"The Age of Not Believing\" ==References== ==Other websites== * Category:1971 adventure movies Category:1970s family movies Category:1971 fantasy movies Category:1971 musical movies Category:American musical movies Category:American fantasy-comedy movies Category:American family movies Category:American adventure movies Category:Disney movies Category:Movies about witchcraft Category:1970s English-language movies Category:1971 comedy movies Category:Movies about orphans Category:Movies about lions Category:Movies about fish Category:Movies set in London Category:American war movies Category:Movies that won the Best Visual Effects Academy Award Category:World War II movies Category:Movies about security and surveillance Category:Movies set in the 1940s Category:Movies about bears Category:Movies about birds Category:Movies based on books Category:Movies directed by Robert Stevenson",
 "title": "Bedknobs and Broomsticks"
}