{
 "id": "368519",
 "text": "Mary Poppins is a 1964 American musical movie starring Julie Andrews and Dick Van Dyke. It was produced by Walt Disney. It was based on the story of destiny Mary Poppins and the Mary Poppins book series by P. L. Travers. It was shot at Walt Disney Studios in Burbank, California. Julie Andrews won the Academy Award for Best Actress for her performance as Mary Poppins. The movie also won Oscars for Best Movie Editing, Original Music Score, Best Song for \"Chim Chim Cher-ee\" and Best Visual Effects. The movie received a total of 13 nominations. ==Plot== The movie is about a family named Banks that live in London of 1910. The family members are George Banks - a serious man that works in the bank, Winifred Banks - a Women's rights activist, and their children Jane and Michael. George Banks is busy in his bank work while Winifred is busy in her Women's rights activities and both of them almost never dedicate time for their children but instead keep them with different nannies. When one of the nannies named Katie quits the job, Mr. Banks begins to search for a different nanny. At night, the children write their father a letter that describes the kind of nanny they want, but he then rips the letter and throws it into the fire and writes for himself the kind of nanny that he wants, someone that is serious and arranged. Many nannies come to the house in order to be chosen as the nanny but the strong wind blows them all away. At the same time the children who are looking from the window see a woman flying into their house, named Mary Poppins and she is the kind of nanny the children really wanted. With her magic and love she takes care of the children and takes them to special adventures. In the beginning Mr. Banks does not like the way she takes care of the children but later in the movie she manages (is able to do something, especially something difficult) to connect between him and the children and makes the Banks family all happy again. ==Awards== Mary Poppins is the most Oscar-winning and Oscar-nominated Disney movie in history. ;Awards: * Best Actress in a Leading Role -- Julie Andrews * Best Original Song for \"Chim Chim Cher-ee\"-- Richard M. Sherman and Robert B. Sherman * Best Substantially Original Score—Richard M. Sherman and Robert B. Sherman * Best Film Editing -- Cotton Warburton * Best Visual Effects -- Peter Ellenshaw, Eustace Lycett and Hamilton Luske ;Nominations: * Best Art Direction (Color) -- Carroll Clark, William H. Tuntke, Emile Kuri and Hal Gausman * Best Cinematography (Color) * Best Costume Design (Color) * Best Director -- Robert Stevenson * Best Scoring of Music-adaptation or treatment -- Irwin Kostal * Best Picture * Best Sound -- Robert O. Cook * Best Adapted Screenplay ==References== ==Other websites== * * * * * * * * Mary Poppins DVD Review on Kidzworld.com * Empire - The Worst British Accents Ever - Number 11 - Dick Van Dyke singing in Mary Poppins (1964) (requires Flash) * Mary Poppins and the Blessed Virgin Mary Category:1960s family movies Category:1964 musical movies Category:American family movies Category:American musical fantasy movies Category:Disney movies Category:1960s English-language movies Category:Movies about nannies Category:Movies about children Category:Movies about dysfunctional families Category:Movies about businesspeople Category:Movies set in London Category:Movies set in the 1910s Category:Movies that won the Best Original Song Academy Award Category:Movies directed by Robert Stevenson",
 "title": "Mary Poppins (movie)"
}