{
 "id": "368535",
 "text": "Pete's Dragon is a 1977 live-action/animated musical movie from Walt Disney Productions. It is a live-action movie but its title character, a dragon named Elliott, is animated. The story is about a young orphan named Pete who goes to the town of Passamaquoddy, a small fishing community in Northeastern Maine. His only friend is a dragon named Elliott. Elliott is also his protector and can make himself invisible. == Cast == * Helen Reddy as Nora, the kind daughter of the local lighthouse keeper. * Jim Dale as Dr. Terminus, a scheming quack and showman. * Mickey Rooney as Lampie, the local lighthouse keeper and Nora's father. * Red Buttons as Hoagy, the assistant of Dr. Terminus. * Shelley Winters as Lena Gogan, the matriarch of the Gogans. * Sean Marshall as Pete, an orphan escaping the cruel Gogans. * Jane Kean as Miss Taylor, the strict, no-nonsense, and abusive teacher. * Jim Backus as the Mayor of Passamaquoddy. * Charles Tyner as Merle Gogan, the patriarch of the Gogans. * Gary Morgan as Grover Gogan, Merle and Lena's older sadistic son. * Jeff Conaway as Willie Gogan, Merle and Lena's younger sadistic son. * Cal Bartlett as Paul, a sailor who disappeared at sea and Nora's fiancé. * Walter Barnes as the Captain of the ship Paul returns home on. * Charlie Callas as the vocal effects for Elliott, a dragon who befriends Pete. ==Awards and honors== ;Academy Awards Pete's Dragon was nominated for two Academy Awards: * Academy Award for Best Original Song - Al Kasha and Joel Hirschhorn for \"Candle on the Water\" * Academy Award for Original Song Score - Al Kasha, Joel Hirschhorn and Irwin Kostal ;Academy of Science Fiction, Fantasy & Horror Films Awards The movie was nominated for four Saturn Awards: * Saturn Award for Best Fantasy Film * Saturn Award for Best Supporting Actor - Red Buttons * Saturn Award for Best Costume * Saturn Award for Best Special Effects ;Golden Globes The Hollywood Foreign Press Association nominated Pete's Dragon for one Golden Globe Award: * Golden Globe Award for Best Original Score - Al Kasha and Joel Hirschhorn ==References== ==Other websites== * Category:1970s family movies Category:1977 fantasy movies Category:American children's adventure movies Category:Movies about adoption Category:1970s American musical movies Category:Disney movies Category:Movies about dragons Category:Movies set in Maine Category:Movies directed by Don Chaffey Category:1970s English-language movies Category:Movies about orphans Category:American musical fantasy movies Category:American fantasy-comedy movies Category:Movies about old age Category:American family comedy movies Category:American buddy comedy movies Category:1977 comedy movies Category:Movies set in the 1900s Category:Adventure comedy movies Category:1970s American adventure movies",
 "title": "Pete's Dragon (1977 movie)"
}