{
 "id": "368665",
 "text": "The Surgeon General of the United States is in charge of the Public Health Service Commissioned Corps (PHSCC). They are the main spokesperson about things dealing with public health in the federal government. The Surgeon General's office and staff are known as the Office of the Surgeon General (OSG). ==Selection and current office-holder == The Surgeon General is chosen by the U.S. President and confirmed by the Senate. The Surgeon General serves for a four-year period of time. The Surgeon General is either the highest ranking or second highest ranking uniformed officer of the PHSCC. This depends on if the current Assistant Secretary for Health is a PHSCC commissioned officer or not. The position has the grade of a three-star vice admiral .Public Health, Commissioned Corps Uniforms and Ranks . == List of surgeons general of the United States == Portrait Name Term of office Term of office Term of office Appointed by Portrait Name Took office Left office Time in office Appointed by 1 John M. Woodworth March 29, 1871 March 14, 1879 Ulysses S. Grant 2 Commodore John B. Hamilton April 3, 1879 June 1, 1891 Rutherford B. Hayes 3 Commodore Walter Wyman June 1, 1891 November 21, 1911 Benjamin Harrison 4 Commodore Rupert Blue January 13, 1912 March 3, 1920 William Howard Taft 5 Rear Admiral Hugh S. Cumming March 3, 1920 January 31, 1936 Woodrow Wilson 6 Rear Admiral Thomas Parran Jr. April 6, 1936 April 6, 1948 Franklin D. Roosevelt 7 Rear Admiral Leonard A. Scheele April 6, 1948 August 8, 1956 Harry S. Truman 8 Rear Admiral Leroy E. Burney (1906–1998) August 8, 1956 January 29, 1961 Dwight D. Eisenhower 9 Luther Terry March 2, 1961 October 1, 1965 John F. Kennedy 10 William H. Stewart October 1, 1965 August 1, 1969 Lyndon B. Johnson – Rear Admiral Richard A. Prindle August 1, 1969 December 18, 1969 Richard Nixon 11 Jesse L. Steinfeld December 18, 1969 January 30, 1973 Richard Nixon – Rear Admiral S. Paul Ehrlich Jr. January 31, 1973 July 13, 1977 Richard Nixon 12 Vice Admiral Julius B. Richmond July 13, 1977 January 20, 1981 Jimmy Carter – Rear Admiral John C. Greene January 21, 1981 May 14, 1981 Ronald Reagan – Edward Brandt Jr. May 14, 1981 January 21, 1982 Ronald Reagan 13 Vice Admiral C. Everett Koop January 21, 1982 October 1, 1989 Ronald Reagan – Admiral James O. Mason October 1, 1989 March 9, 1990 George H. W. Bush 14 Vice Admiral Antonia Novello March 9, 1990 June 30, 1993 George H. W. Bush – Rear Admiral Robert A. Whitney July 1, 1993 September 8, 1993 Bill Clinton 15 Vice Admiral Joycelyn Elders September 8, 1993 December 31, 1994 Bill Clinton – Rear Admiral Audrey F. Manley January 1, 1995 July 1, 1997 Bill Clinton – Rear Admiral J. Jarrett Clinton July 2, 1997 February 12, 1998 Bill Clinton 16 Admiral David Satcher February 13, 1998 February 12, 2002 Bill Clinton – Rear Admiral Kenneth P. Moritsugu February 13, 2002 August 4, 2002 George W. Bush 17 Vice Admiral Richard Carmona August 5, 2002 July 31, 2006 George W. Bush – Rear Admiral Kenneth P. Moritsugu August 1, 2006 September 30, 2007 George W. Bush – Rear Admiral Steven K. Galson October 1, 2007 October 1, 2009 George W. Bush – Rear Admiral Donald L. Weaver October 1, 2009 November 3, 2009 Barack Obama 18 Vice Admiral Regina Benjamin November 3, 2009 July 16, 2013 Barack Obama – Rear Admiral Boris Lushniak July 17, 2013 December 18, 2014 Barack Obama 19 Vice Admiral Vivek Murthy April 22, 2015 April 21, 2017 Barack Obama – Rear Admiral Sylvia Trent-Adams April 21, 2017 September 5, 2017 Donald Trump 20 Vice Admiral Jerome Adams September 5, 2017 January 20, 2021 – Rear Admiral Susan Orsega January 20, 2021 March 24, 2021 62 days Joe Biden 21 Vice Admiral Vivek Murthy March 25, 2021 January 20, 2025 – Rear Admiral Denise Hinton January 20, 2025 Incumbent Donald Trump Nominee Casey Means TBD Awaiting confirmation ==Notes== ==References==",
 "title": "Surgeon General of the United States"
}