{
 "id": "368710",
 "text": "Talokar is the name of a village in the Haripur District of Hazara, Khyber Pakhtunkhwa (formerly North-West Frontier Province) in Pakistan.Map of Talokar and Dheri Retrieved 1 Nov 2012 It is situated at Latitude 33.9852778 degrees; and Longitude 72.9419444 degrees. It is quite closely situated to Haripur town (approx 2 km) the local area headquarters. ==History== It was originally founded during the 12th or 13th century AD by the Talokar khoker Awan tribe. Since then, it has remained the principal seat of a Jagir estate during the British Raj, of a famous aristocratic family which also produced Khan Sahib Abdul Majid Khan Tarin, OBE,Whos Who in India 1932 edition, Entry No 64 Jemadar Abdul Latif Khan Tarin IDSM, and others. ==Population and economy== The approximate population of the main Talokar village at the time of the last major national census was about 4800-5000.Government of Pakistan, National Census Report 2000-2001 and it is primarily an agrarian area. It is well known for its fine vegetables, wheat and maize crops and orchards of loquats, oranges and other fruits. Although the majority of the residents are engaged in farming activities, a fairly large number are also in government and military service and some few working in local industries or working abroad as immigrant labour. ==Ethnic groups== The main tribes and ethnic groups include Gurjars, Maliars, Pathans, Syeds, Awans and some others. The principal families and landowners are still mostly Tarin/Tareen Pathans (Pashtuns). In terms of religious practices, the population is overwhelmingly Muslim, mostly of the Sunni Islamic persuasion. The main language spoken here are Hindko, Northern Punjabi language (Chhachi dialect) and some Pashto. ==Education== The general level of literacy/education is quite high by Pakistani standards, with schooling for both boys and girls available until high school level and an average literacy rate of 74%.National Census Report 2000-2001 For further education, most students go to colleges in Haripur town or nearby Abbottabad and some even as far as Peshawar, Islamabad and Rawalpindi. ==Popular pastimes== Among popular pastimes here are sports such as Cricket, Football (soccer), Field hockey and Volleyball. Many people also engage in hunting, horse riding and the traditional martial art of Gatka. Traditional Gatka Display at Talokar, retrieved 1 Nov 2012 ==References== Category:Villages in Khyber Pakhtunkhwa Category:Haripur District",
 "title": "Talokar"
}