{
 "id": "368950",
 "text": "The is a Japanese government honor established in 1875 by Emperor Meiji. The Order was the first national decoration awarded by the Japanese Government, It was created on April 10, 1875 by decree of the Council of State. The modern version of this honor has been given to non-Japanese recipients beginning in 1981. The awarding of the Order is administered by the Decoration Bureau of Office of the Prime Minister. It is awarded in the name of the Emperor. == Classes == The Order was awarded in nine classes until 2003. Since then, it has been awarded in seven classes. ==Selected recipients== :These lists are not finished; you can help Wikipedia by adding to them. ===1st Class, Order of the Rising Sun with Paulownia Flowers, Grand Cordon=== * Konrad Adenauer (1876–1967)Honor conferred 1963 -- Konrad Adenauer Stiftung : Biographie, Orden und Ehrenzeichen ; Kyokujitsu-sho, Orden der Aufgehenden Sonne, 1. Klasse, Großkreuz (22 März 1960); Kyokujitsu Tokwa Daiju-sho (Orden der Aufgehenden Sonne mit Paulownia-Blüten ((2 Dezember 1963). * Douglas MacArthur (1880–1964)Department of the Army, Headquarters: General Orders, No. 13. April 6, 1964. === 1st Class, Grand Cordon === * Edmund Barton, 1905Rutledge, Martha. (1979). \"Barton, Sir Edmund (1849 - 1920),\" Australian Dictionary of Biography, Volume 7, pp 194–200; Scaramouche. \"Sir Edmund Barton\" * Sepp Blatter, 2009FIFA: Honors, Sepp Blatter . * Malcolm Fraser, 2006 * Daniel Inouye (1924-2012)Honor awarded 2000 -- Awards ; Cillizza, Chris. \"Hawaii Sen. Daniel Inouye dies at age 88,\" Washington Post. December 17, 2012; retrieved 2012-12-17. * Wangari Maathai, 2009Embassy of the Republic of Kenya in Japan: Wangari Maathai , 2009. * John McEwen 1973 * Robert Menzies (1894–1978)Honor awarded 1973 -- National Archives of Australia * Goh Chok Tong, 2011S Ramesh. \"Goh Chok Tong to receive award from Japanese emperor \". channelnewsasia.com. Retrieved 24 October 2011. * Gough Whitlam, 2006 === 2nd Class, Gold and Silver Star === * Momofuku Ando (1910–2007), 2002NNDB: Order of the Rising Sun * Donald Keene, 1993Keene Center of Japanese Culture, About Donald Keene ; retrieved 2012-11-02. === 3rd Class, Gold Rays with Neck Ribbon === *Clint Eastwood, 2009\"Japan honors Clint Eastwood in spring decorations,\" Japan Today. April 29, 2008. * Ian Nish, 1991Kenrick, Vivienne. \"Personality Profile: Ian Nish,\" Japan Times. September 18, 2004. *Raaj Sah, 2017 === 4th Class, Gold Rays with Rosette === * Martha Argerich, 2005 * George Takei, 2004 * H. Paul Varley, 1966Honor awarded 1996 -- Columbia University, Department of East Asian Languages and Cultures, Faculty Profiles === 5th Class, Gold and Silver Rays === * Yoshizawa, Akira (1911–2005)Honor awarded 1983 -- \"Origami artist of stunning originality who became an ambassador for Japanese culture and his art\" . The Times (London). March 30, 2005; Lister, David. \"Obituary: Akira Yoshizawa; Japanese craftsman who singlehandedly revived the art of origami,\" The Guardian (Manchester). April 8, 2005. === 6th Class, Silver Rays === * Henry Hajimu Fujii (1886–1976)Honor awarded on 1971 -- Henshall, Mary. \"Pioneer Portraits: Henry and Fumiko Fujii,\" Idaho Yesterdays, Spring, 1975, pp. 20–27; Washington State University Libraries: \"Furthering friendship between Japan and the United States, April 1971\" * Tsuyako Coveney (2017) 2017 Autumn Conferment of the Order of the Rising Sun, Silver Rays on Mrs. Tsuyako Sogawa Coveney, Consulate-General of Japan in Perth: === 7th Class, Green Paulownia Leaves Medal === In 2003, this grade of the Order was abolished. === 8th Class, White Paulownia Leaves Medal === In 2003, this grade of the Order was abolished. === Class unknown === * Aung San (1915–1947) == References == ==Further reading== * Peterson, James W., Barry C. Weaver and Michael A. Quigley. (2001). Orders and Medals of Japan and Associated States. San Ramon, California: Orders and Medals Society of America. ==Other websites== * Japan, Cabinet Office: Decorations and Medals ** Decoration Bureau: Order of the Paulownia Flowers ** Decoration Bureau: Order of the Rising Sun * Japan Mint: Production Process Category:1875 establishments in Asia Category:1870s establishments in Japan",
 "title": "Order of the Rising Sun"
}