{
 "id": "368979",
 "text": "James Scott \"Jim\" Brady (August 29, 1940 - August 4, 2014) was an American journalist, politician, and activist. He was an assistant to the President and White House Press Secretary under U.S. President Ronald Reagan. ==Early life== Brady was born in Centralia, Illinois on August 29, 1940 to Harold J. Brady and to Dorothy (née Davidson). He studied at the University of Illinois at Urbana-Champaign. ==Career== Brady became Ronald Reagan's White House Press Secretary in 1981. ===Near death=== Brady was nearly killed a few weeks after becoming Press Secretary. On March 30, 1981 John Hinckley tried to assassinate President Reagan with a gun. Brady was shot in the head and became disabled. ===Gun control=== After Brady's near death, he and his wife, Sarah, became a supporter of gun control. He was also an activist for gun control. Together with his wife, Sarah, who was Chair of the Brady Campaign to Prevent Gun Violence (formerly known as Handgun Control, Inc.), co-founded by N.T. Pete Shields, Brady quickly fought for handgun control and assault weapon restrictions. The Brady Handgun Violence Prevention Act, also known simply as \"the Brady Bill\", was named in his honor. ===James S. Brady Press Briefing Room=== In 2000, the Press Briefing Room at the White House was renamed after Brady as the James S. Brady Press Briefing Room. ==Personal life== Brady married Sue Beh in 1961. That marriage ended in divorce in 1968. Brady married Sarah, in 1973; the couple had two children, Scott and Melissa. ===Death=== Brady died on August 4, 2014 in Alexandria, Virginia, aged 73.Former White House Press Secretary James Brady Dead at 73 His death has been said to be a homicide caused by the gunshot wound he received in 1981, about 33 years before. ==References== ==Other websites== * Category:1940 births Category:2014 deaths Category:American murder victims Category:American activists Category:American crime victims Category:Politicians from Illinois Category:Journalists from Illinois Category:White House Press Secretaries",
 "title": "James Brady"
}