{
 "id": "369036",
 "text": "South Hampton Roads is a region of the U.S. state of Virginia. It in the most southeastern part of the state. The area is part of the Virginia Beach- Chesapeake-Norfolk, VA-NC MSA (Metropolitan Statistical Area). About 1.7 million people live there. Hampton Roads is the common name for the metropolitan area around the body of water of the same name. The land area of Hampton Roads is divided into two regions. These are South Hampton Roads on the south side and the Virginia Peninsula on the north side. People who live there commonly call South Hampton Roads \"the Southside\". As of the 2020 Census, the Hampton Roads MSA is the ninth largest metropolitan area by size in the southeastern United States. It is the second-largest between Washington, D.C. and Atlanta, Georgia. The decision to call the region \"Hampton Roads\" was a political one. The area was called \"Tidewater\" for many years by the people who lived there. The local baseball team was called the Tidewater Tides for years. It is now called the Norfolk Tides. When they first came to Tidewater, they used the popular name to draw more fans. ==U.S. military installations== South Hampton Roads is home to many United States military bases. ===City of Portsmouth=== Norfolk Naval Shipyard and Naval Medical Center, Portsmouth are in Portsmouth. They are two very important and historic bases. The shipyard was created as the Gosport Shipyard on November 1, 1767. It had the county's first dry dock. The name was changed after the American Civil War. Although it is in Portsmouth, the name Norfolk was chosen because there was another U.S. Navy shipyard at Portsmouth, New Hampshire. There are also many smaller bases in Portsmouth. ===City of Norfolk=== Norfolk is the home of Naval Station Norfolk. It is the main base for United States Navy's Atlantic Fleet. The base was created in 1917. It is the largest naval facility in the world. ===City of Virginia Beach=== Virginia Beach is home to the Navy's Naval Air Station Oceana (NAS Oceana) and Naval Amphibious Base Little Creek (NAB Little Creek). NAS Oceana is the largest employer in Virginia Beach. Both bases there, like the Norfolk Navy Base, are said to be the largest of their kinds in the world. Also in Virginia Beach is NAVSEA Dam Neck and the home of Joint Expeditionary Base East ===City of Chesapeake=== St. Julien's Creek Annex is a U.S. Navy base in Chesapeake. It is on the Elizabeth River. It began in 1849. It is currently part of the Norfolk Navy Base. Chesapeake is also home to U.S. Naval Auxiliary Landing Field Fentress. It is used to help support training for NAS Oceana. ==Local government== From Colonial times through the first 150 years of the United States, South Hampton Roads was almost always changing. Local governments changed mainly because of growth in population. Counties were divided and towns were created as the population grew. Some towns grew to become cities. in 1871, changes were made to the state constitution. One of these changes made all cities in Virginia independent cities of the counties they had been a part of. In the second half of the 20th century, many city-county-town local government joined together in South Hampton Roads and on the Virginia Peninsula. Many small towns and cities joined together to create a small number of larger cities. Nowhere else in Virginia have rural areas and more dense cities been combined in this way. The changes caused the area to have Virginia's cities with the largest land areas and the most farming. ===Current cities, counties and towns=== The South Hampton Roads region has five independent cities, two counties, and five incorporated towns. ===Independent cities=== *Chesapeake (formerly Norfolk County) *Norfolk *Portsmouth *Suffolk *Virginia Beach (formerly Princess Anne County) ===Counties=== *Surry County *Isle of Wight County ===Incorporated towns=== ;Surry County *Town of Claremont *Town of Dendron *Town of Surry (also county seat) ;Isle of Wight County *Town of Smithfield *Town of Windsor ===Former subdivisions=== Other settlements in South Hampton Roads no longer exist. No less than 2 shires, 6 counties, 1 town, and 2 entire cities no longer exist in the South Hampton Roads area. The following is a listing of these 11 extinct shire, counties, towns, and cities, with the approximate dates they existed: *Elizabeth River Shire (1634–1636) *Warrosquyoake Shire (1634–1637) *New Norfolk County (1636–1637) *Upper Norfolk County (1637–1646) *Lower Norfolk County (1637–1691) *Nansemond County (1646-1972) *Norfolk County (1691–1963) *Princess Anne County (1691–1963) *Town of Berkley (unknown-1906) *South Norfolk (1919–1963) *City of Nansemond (1972–1974) Category:Geography of Virginia",
 "title": "South Hampton Roads"
}