{
 "id": "369228",
 "text": "Piglet's Big Movie is a 2003 American animated movie. It was released by Walt Disney Pictures on April 22, 2003. It is based on the characters in the Winnie-the-Pooh books written by A. A. Milne. In the movie, Piglet is ashamed of being small. He wanders off into the Hundred Acre Woods, leading his friends to form a search party to find him. ==Cast== * John Fiedler as Piglet * Jim Cummings as Pooh and Tigger * Andre Stojka as Owl * Kath Soucie as Kanga * Nikita Hopkins as Roo * Peter Cullen as Eeyore * Ken Sansom as Rabbit * Tom Wheatley as Christopher Robin ==Crew== * Directed by: Francis Glebas * Produced by: Michelle Pappalardo-Robinson * Unit director: Masaki Sugiyama * Screenplay by: Brian Hohlfeld * Adapted from and inspired by the works of: A. A. Milne * Original score composed and conducted by: Carl Johnson * With the voice talents of: See the Cast paragraph above. * Voice casting and dialogue director: Jamie Thomason * Art director: Fred Warter * Supervising film editor: Ivan Bilancio * Technical directors: Charlie Luce and Darren Clark * Associate producers: Ferrell Barron and Yukari Kiso * Animation director: Takeshi Atomura * Storyboard: Andrew Austin, Keith Baxter, Ben Gluck, Susan Nichols and Robert Sledge * Additional storyboard: Carin-Anne Greco, Douglas Murphy, Dave Prince, Debra Pugh, Carolyn Gair and Kenny Thompkins * Additional screenplay material by: Ted Henning ===Design and visual development=== * Character design: Robert Sledge and Greg T. Guler * Additional character design: Kenny Thompkins * Character design clean-up: Willy Harber and Kimie Calvert * Lead key location design: James Schlenker * Key location design: Arlan Jewell, Wallace Williamson and Colette Van Mierlo * Prop design: Marty Warner * Key background stylists: Fred Warter and Paro Hozumi * Key color styllist: David A. Rodriguez ===Layout=== * Layout director: Kazuyoshi Takeuchi * Layout animators: Shinichi Suzuki and Shigeru Yamamoto ===Character animation=== * Lead animators: Hiroshi Kawamata, Kiyomi Miyakawa, Jyunpei Tatenaka, Kenichi Tsuchiya, Hisashi Wada and Yuji Watanabe * Assistant directors: Fumio Maezono and Yumiko Suzuki * Key animators: Chie Arai, Rie Arai, Yoshiharu Ashino, Genta Chiba, Nozomi Fujii, Atsuhiko Hara, Takahiro Ikezoe, Isamitsu Kashima, Hideaki Kurakawa, Don MacKinnon, Masayo Matsumoto, Kazuhiro Murase, Hiroko Minowa, Yufuki Morimoto, Tomokatsu Nagasaku, Hirofumi Nakata, Takayo Nishimura, Sachio Nishiyama, Emi Noguchi, Masaru Ohshiro, Scott Petersen, Masatomo Saito, Kazuko Shibata, Takeo Shuto, Emil Simeonov, Kouichi Suenaga, Kaori Takeuchi, Yasuyo Torii, Yoshihiro Tsuji, Kouji Ukai, Sachiko Wakabayashi, Andreas Wessell-Therhorn, Alexander Williams and Theresa Wiseman ===Effects animation=== * Supervising effects animation director: Madoka Yasuet * Effects clean-up artist: Masahisa Koyata ===CGI animation=== * CGI effects artists: Kiyoteru Ogawa, Hiroyuki Hatada, Gina Di Bari, Hock-Lian Law and Eric Rosenthal * CGI effects assistants: Tetsuya Hasebe and Mayumi Hiramatsu ===Backgrounds=== Studio Fuga * Background supervisor: Hiroshi Ohno * Background artists: Kaori Anmi, Yuri Hamaya, Emi Kitahara, Chie Ohkubo, Kumiko Ohno and Yasuyuki Yuzawa * Background line artists: Sagako Itakura, Toshiharu Mizutani and Kazuo Nagai ===Inbetween animation=== * Inbetween artists: Mio Ahata, Ayako Fuji, Miho Fujita, Tsuyoshi Fukuyama, Shouko Hagiwara, Chiharu Haraguchi, Kyoko Haseyama, Kazuyo Higashi, Chiemi Hironaka, Shunsuke Hirota, Kiyoteru Hosoda, Makoto Iino, Kazuko Ike, Hikari Ishiguro, Tsutomu Kaneko, Chiharu Katawaki, Yasuyuki Kitazawa, Fumie Konno, Madoka Koutou, Ai Kuwabara, Tetsuya Maehana, Gastone Marzio, Izumi Masui, Hiroaki Mieda, Shizuko Minami, Mami Morikawa, Hideo Nakamura, Masami Nakanishi, Youhei Nakano, Mai Nakazato, Tsuyoshi Nihei, Daisuke Niinuma, Maki Nishi, Masatsugu Nishida, Yumiko Ohasa, Setsuko Ohashi, Hiromi Ohta, Kumiko Ohta, Maiko Okada, Shinobu Saeki, Eri Sahara, Hitomi Sasaki, Yuko Sasaki, Ritsuko Shiina, Fumihito Shiotsuka, Chiaki Suda, Yuji Suzuki, Harumi Takagi, Moyo Takahashi, Daisuke Takashima, Masaki Tamakoshi, Ritsuko Tanaka, Yusuke Tanaka, Hideaki Tanemura, Masahiko Taniguchi, Keiko Tanino, Takao Tsuji, Takenori Uchida, Tugumi Ueno, Yukari Umebayashi, Kenichi Watanabe and Morihiko Yano * Inbetween checkers: Takahiro Takashima and Etsuko Tamakoshi ===Clean-up animation=== * Character leads: Kazuho Ando, Reiko Mano and Kiwako Sakano * Clean-up artists: Seigo Kitazawa, Masako Morimitsu, Jyunichi Mineta, Weihrauch Alexandra, Kaori Fujii, Akiko Fujimoto, Yoshitake Iwakami, Yukari Kaku, Mitsuko Kanaoka, Yukie Kaneko, Hiroki Kawazoe, Shizuka Kikuta, Terumichi Maguchi, Kiyoko Makita, Akiko Matsuo, Tomoko Miyata, Rie Nakagome, Kazumi Nakata, Sumie Nishido, Minori Noguchi, Yuko Ohara, Yukio Ohmori, Mayumi Ohmura, Kumiko Ohtani, Masako Sakano, Kyouko Sato, Tsutomu Shibutani, Keisuke Shimohira, Takahito Sugawara, Kaori Suzuki, Makiko Suzuki, Tsuyoshi Takahashi, Kumiko Tanihira, Maki Tano, Akiko Teshima, Jinko Tsuji, Hisako Yaji, Muneyuki Yamashita, Yukari Yamaura, Kazumi Yokoyama and Terumi Yoshida Additional animation provided by Gullwing Co. Ltd. ===Digital production=== * Digital producer: Doug Little * Lead compositor: Tohru Kobayashi * Assistant lead compositor: Kazuya Kozutsumi * Compositors: Ryoko Seino, Youhei Seino, Michael Tyau and Yutaka Nishino * Color stylist: Mami Sakamaki * Assistant color stylist: Keiichi Funada * Lead painters: Shiho Kosuga and Misako Motoyanagi * Digital ink & paint: Hitomi Suzue, Natsumi Kasahara, Aya Matsubayashi, Satoko Muramatsu and Takako Nakajyo * Background scan & adjustments: Yoko Ohyama, Gaku Inoue and Sawako Narumiya * Digital production managers: Yasunori Hayama and Alaina Yohe * Digital systems manager: Kotaro Beppu * Principal software engineer: David Adler * Systems administrator: Itaru Naruumi * Additional digital ink & paint provided by T2 Studio: Yukiko Kakita, Fumio Kawamata, Shihomi Miyachi, Kumi Nanjyo, Michiko Saito and Akiko Shimizu ===Production=== * Production supervisor: Sheila Kelly * Production coordinators: Marilyn Munro and Kristin Kakuchi-Rawnsley * Production associates: Dennis Adams, Andres Alvares and Allison Roth * Production assistants: Takaaki Matsudaira, Makoto Neishi, Kazutaka Nagasawa, Satomi Takahashi, Kohei Nagasawa and Yoko Saito * Artwork coordinator: Maki Kaneda * Slugging director: Terry Lennon * Sheet timers: Terry Lennon, Mircea Mantta and Joanna Romersa * Continuity checkers: Barbara Donatelli and Lynn Singer * Background key color correction: Ernest Pava * Storyboard revisions: Todd Kurosawa, Kevin Pawlak, Leonardo Pinero and Jerry Verschoor * Storyboard clean-up: Peter Paul Bautista and Willy Harber * Senior production accountants: Jim Cotton and Christopher Gandara * Casting manager: David H. Wright III * Talent coordinators: Steven Neibert and Dan Soulsby * Translators: Tokiko Kawai, Kikuyo Takahashi, Kiyoko Takemura and Shinya Mitsuta ===Editorial and post production=== * Assistant film editor: Christine Lojko Haslett * Additional storyreel editors: Nancy Frazen, Tony Mizgalski and Ellen Orson * Additional production editor: Takahiko Narita * Additional assistant editors: Barbara Gerety, Karen Hathaway, Brian Master and Susan Odjakjian * Post production supervisor: Craig Sawczuk * Post production coordinator: Ken Poteat * Track reading: Skip Craig * Title design: Brian King * Titles: Buena Vista Imaging * Digital ink & paint software: Toon Boom Technologies * Digital film services: Walt Disney Feature Animation Camera Department * Color timing: Chris De La Guardia * Negative cutting: Mary Beth Smith * Produced and distributed on: Eastman Film * Prints by: Technicolor ===Sound=== * Supervising sound editor: Donald J. Malouf * Supervising dialogue/ADR editor: Thomas G. Whiting * Sound effects editor: Todd Toon * Dialogue editor: G. W. Brown * First assistant sound editor: Mark A. Tracy * Foley artists: Dan O'Connell and John Cucci * Foley mixer: James Ashwill * Foley recorded at: One Step Up * Re-recording mixers: Terry O'Bright, C.A.S. and Keith Rogers, C.A.S. * Original dialogue recording: Carlos Sotolongo * Original dialogue engineer: David Guerrero * ADR engineers: Doc Kane and Carlos Sotolongo * Recordist: Erik Flockoi * ADR recordist: Jeanette Browning * Post production sound services: Buena Vista Sound ===Music=== Winnie the Pooh * Music and lyrics by: Richard M. Sherman and Robert B. Sherman * Performed by: Carly Simon with Ben Taylor * Arranged by: Carly Simon with Michael Kosarin * Conducted by: Michael Kosarin * Vocal recording and mix by: Frank Wolf The Wonderful Thing About Tiggers * Music and lyrics by: Richard M. Sherman and Robert B. Sherman If I Wasn't So Small (The Piglet Song) * Music and lyrics by: Carly Simon * Performed by: Carly Simon * Produced by: Rob Mathes and Carly Simon * Arranged by: Carly Simon * Additional vocal recording and mix by: Frank Filipetti Mother's Intuition * Music and lyrics by: Carly Simon * Performed by: Carly Simon * Produced by: Rob Mathes and Carly Simon * Arranged by: Carly Simon * Additional vocal recording and mix by: Frank Filipetti Sing Ho For The Life Of A Bear (Expotition March) * Music and lyrics by: Carly Simon * Adapted from \"Winnie the Pooh\" by: A. A. Milne * Performed by: Carly Simon with Jim Cummings as Winnie the Pooh and Tigger, Ken Sansom as Rabbit, Kath Soucie as Kanga and Christopher Robin, Nikita Hopkins as Roo, Peter Cullen as Eeyore and John Fiedler as Piglet * Arranged and conducted by: Carl Johnson The More It Snows (Tiddely-Pom) * Music by: Carly Simon * Lyrics adapted from \"The House at Pooh Corner\" by: A. A. Milne * Arranged and conducted by: Carl Johnson * Performed by: Jim Cummings as Winnie the Pooh and John Fiedler as Piglet With A Few Good Friends * Music by: Carly Simon * Lyrics by: Carly Simon and Brian Hohlfield * Performed by: Carly Simon with Ben Taylor and Sally Taylor * Produced by: Rob Mathes and Carly Simon * Arranged by: Carly Simon * Additional vocal recording and mix by: Frank Filipetti With A Few Good Friends (Reprise) * Music by: Carly Simon * Lyrics by: Carly Simon and Brian Hohlfield * Arranged and conducted by: Carl Johnson * Performed by: Jim Cummings as Winnie the Pooh, John Fiedler as Piglet, Kath Soucie as Christopher Robin and Peter Cullen as Eeyore The More I Look Inside * Music and lyrics by: Carly Simon * Performed by: Carly Simon * Produced by: Rob Mathes and Carly Simon * Additional vocal recording and mix by: Frank Filipetti * Medley arranged by: Doug Besterman and Michael Skloff Comforting To Know * Music and lyrics by: Carly Simon * Performed by: Carly Simon with Ben Taylor * Guest vocal performance by: Renee Fleming * Produced by: Rob Mathes and Carly Simon * Orchestral arrangement by: Rob Mathes * Additional vocal recording and mix by: Frank Filipetti Renee Fleming appears courtesy of Decca Records/Universal Music Group * Supervising music editor: Dominick Certo * Assistant music editors: Tommy Holmes and Christine Cholvin * Score orchestrations by: Cameron Patrick, J. Eric Schmidt and Gary K. Thomas * Score recorded and mixed by: John Richards * Song orchestrations by: Rob Mathes, Carl Johnson, Cameron Patrick and Danny Troob * Additional song production by: Jimmy Parr * Score recorded and mixed at: Sony Studios (NY), Right Track Studios (NY), Parr Audio (MV), Eastwood Scoring Stage at Warner Bros. and Todd AO Studios * Music contractors: Reggie Wilson (LA) and Jill Dell'Abate (NY) * Score recorded at: Eastwood Scoring Stage at Warner Bros. and Todd AO Studios * Music preparation by: Booker White (LA) and T. D. Ellis (CT) With A Few Good Friends (End Title Sequence) * Directed by: Cath Berclaz * Director of photography: Don Davis * Edited by: Declan Whitebloom * Produced by: Glen Lajeski Dolby in selected theatres Sound mix by SDDS - Sony Dynamic Digital Sound in selected theatres and Digital DTS Sound in selected theatres Motion Picture Association of America - Approved No. 39467 This picture made under the jurisdiction of IATSE, affiliated with A.F.L.-C.I.O.-C.L.C. Soundtrack available on: Walt Disney Records Copyright (c) 2003 Disney Enterprises, Inc. All rights reserved. This motion picture was made by Walt Disney Pictures and Television for the purposes of copyright law in the United Kingdom. Produced by DisneyToon Studios (Burbank, Sydney, Tokyo) Distributed by Buena Vista Pictures Distribution ==Other websites== * * Category:2003 animated movies Category:Disney animated movies Category:Sequel movies Category:Movies about pigs Category:Movies about bears Category:Movies about tigers Category:Movies about rabbits and hares Category:Movies about birds Category:Movies about insects Category:Movies about animals",
 "title": "Piglet's Big Movie"
}