{
 "id": "369336",
 "text": "ʿAbd al-Qādir Gīlānī, (, formally Abū Muḥammad ʿAbd al-Qādir ibn ʾAbī Sālih al-Gīlānī al-Ḥasanī (, (, (, (), known as for short was a Hanbali Sunni Muslim preacher, orator, ascetic, mystic, sayyid, faqīh, and theologian. He was known for being the eponymous founder of the Qadiriyya tariqa (Sufi order) of Sufism. == Early life == Born 29 Sha'ban 470 AH (around 1077) in the town of Na'if, district of Gilan-e Gharb, Gilan, IranW. Braune, Abd al-Kadir al- Djilani, The Encyclopaedia of Islam, Vol. I, ed. H.A.R Gibb, J.H.Kramers, E. Levi-Provencal, J. Schacht, (Brill, 1986), 69;\".. all authorities are unanimous in stating that he was a Persian from Nayf (Nif) in Djilan, south of the Caspian Sea.\"There is uncertainty as to the year of his birth; some sources say 1077, others 1078،He was born in Jilan Iraq, a historic village near Mada'in, 40 kilometers south of Baghdad, as evidenced by historical and academic studies adopted by the Kailan family in Baghdad . and died Monday, February 14, 1166 (11 Rabi' al-Thani 561 AH), in Baghdad,The works of Shaykh Umar Eli of Somalia of al-Tariqat al-Qadiriyyah. (1077–1166 CE), was a Persian Hanbali SunniJohn Renard, The A to Z of Sufism. p 142. jurist and sufi based in Baghdad. The Qadiriyya tariqa is named after him. And say that he was born in Gilan Iraq, a historic village near the cities (Al-Mada'in) of 40 kilometers south of Baghdad, as evidenced by historical studies academic and adopted by the Gilan Family in Baghdad.Book: Geography of the Baz Al-Ashhab, Achieving the Birthplace of Sheikh Abdul Qadir Al-Kilani, Dr. Jamal Al-Din Faleh Al-Kilani,(MA in Islamic History from Baghdad University in 2001) Al- Jalis Library, Beirut, 2012, p. 14 == Name's origin == The name Muhiyudin describes him as a \"reviver of religion\".Mihr-e-munīr: biography of Hadrat Syed Pīr Meher Alī Shāh pg 21, Muhammad Fādil Khān, Faid Ahmad. Sajjadah Nashinan of Golra Sharif, Islamabad (1998). Gilan (Arabic al-Jilani) refers to his place of birth, Gilan.Encyclopaedia of religion and ethics: volume 1. (A – Art). Part 1. (A – Algonquins) pg 10. Hastings, James and Selbie, John A. Adamant Media corporation. (2001), \"and he was probably of Persian origin.\"The Sufi orders in Islam, 2nd edition, pg 32. Triingham, J. Spencer and Voll, John O. Oxford University Press US, (1998), \"The Hanafi Qadirriya is also included since 'Abd al-Qadir, of Persian origin was contemporary of the other two.\" However, Gilani also carried the epithet Baghdadi.Cultural and religious heritage of India: Islam pg 321. Sharma, Suresh K. (2004)Indo-iranica pg 7. The Iran Society, Calcutta, India. (1985). referring to his residence and burial in Baghdad. === Paternal heritage === Gilani's father was from Sharif's Al-Hassani lineage.Historical and political who's who of Afghanistan. p 177. Adamec, Ludwig W. (1975) He was respected as a sheikh by the people of his day, and was known as Jangi Dost \"who loves God\", thus \"Jangidost\" was his sobriquet. == Education == Gilani spent his early life in Gilan, the town of his birth. In 1095, at the age of eighteen years, he went to Baghdad. There, he pursued the study of Hanbali law under Abu Saeed Mubarak Makhzoomi and ibn Aqil. He was given lessons on Hadith by Abu Muhammad Ja'far al-Sarraj. His Sufi spiritual instructor was Abu'l-Khair Hammad ibn Muslim al-Dabbas. (A detailed description of his various teachers and subjects are included below). After completing his education, Gilani left Baghdad. He spent twenty-five years as a reclusive wanderer in the desert regions of Iraq. === Education in Baghdad === At the age of 18, Gilani went to Baghdad to study the Hanbali school of fiqh. Subject Shaykh (Teacher) Fiqh (Islamic Jurisprudence) Ibn Aqil Fiqh (Islamic Jurisprudence) Abu Al Hasan Muhammad ibn Qazi Abu Yala Fiqh (Islamic Jurisprudence) Abu Al Khatab Mahfuz Hanbali Fiqh (Islamic Jurisprudence) Muhammad ibn Al Husnayn Fiqh (Islamic Jurisprudence) Abu Saeed Mubarak Makhrami Tasawwuf (Sufism) Abu Saeed Mubarak Makhrami Abu'l-Khair Hammad ibn Muslim al-Dabbas Abu Zakariya ibn Yahya ibn Ali Al Tabrezi Hadith Abu Bakr ibn Muzaffar Hadith Muhammad Ibn Al Hasan Baqalai Abu Sayeed Muhammad ibn Abdul Kareem Hadith Abu Al Ghanaem Muhammad Ibn Muhammad Ali Ibn Maymoon Al Farsi Hadith Abu Bakr Ahmad Ibn Al Muzaffar Hadith Abu Jafer Ibn Ahmad Ibn Al Hussain Al Qari Hadith Abu Al Qasim Ali Ibn Muhammad Ibn Banaan Al Karkhi Hadith Abu Talib Abdul Qadri Ibn Muhammad Yusuf Hadith Abdul Rahman Ibn Ahmad Abu Al Barkat Hibtaallah Ibn Al Mubarak Hadith Abu Al Nasr Ibn Il Mukhtar Hadith Abu Nasr Muhammad Hadith Abu Ghalib Ahmad Hadith Abu Abdullah Aulad Ali Al Bana Hadith Abu Al Hasan Al Mubarak Ibn Al Teyvari Hadith Abu Mansur Abdurahman Al Taqrar Akbar, pg.11 Al Haqq, Abd. and Ghunyat al-talibeen (Wealth for Seekers) pg. 12 Urdu version == Later life == In 1127, Gilani returned to Baghdad and began to preach to the public. He joined the teaching staff of the school belonging to his own teacher, al-Mazkhzoomi, and was popular with students. In the morning he taught hadith and tafsir, and in the afternoon he held discourse on the science of the heart and the virtues of the Quran. He was said to have been a convincing preacher and converted numerous Jews and Christians. His strength came in the reconciling of the mystical nature of Sufism and strict nature of the Quran. == Death and burial == Gilani died in the evening of Tuesday, February 21, 1166 (11th Rabi' al-thani 561 AH) at the age of ninety one years according to the Islamic calendar. His body was entombed in a shrine within his madrasa in Babul-Sheikh, Rusafa on the east bank of the Tigris in Baghdad, Iraq.Al-Ghunya li-talibi tariq al-haqq wa al- din (Sufficient provision for seekers of the path of truth and religion), parts one and two in Arabic, Al-Qadir, Abd and Al-Gilani. Dar Al-Hurya, Baghdad, Iraq, (1988).Al-Ghunya li-talibi tariq al-haqq wa al-din (Sufficient provision for seekers of the path of truth and religion) with introduction by Al-Kilani, Majid Irsan. Al-Kilani, Majid, al-Tariqat, 'Ursan, and al- Qadiriyah, Nash'at During the reign of the Safavid Shah Ismail I, Gilani's shrine was destroyed.A.A. Duri, Baghdad, The Encyclopaedia of Islam, Vol. I, 903. However, in 1535, the Ottoman Sultan Suleiman the Magnificent had a turba (dome) built over the shrine, which exists to this day.W. Braune, Abd al-Kadir al-Djilani, The Encyclopaedia of Islam, Vol. I, 70. == Birthday & Death Anniversary celebration == 1 Ramadan is celebrated as the birthday of Abdul Qadir Gilani while the death anniversary is on 11 Rabi us Thani though some scholars and traditions say 29 Shaban and 17 Rabi us Sani as birth and death day respectively. The later is called in the Subcontinent as Giyarwee Shareef or Honoured Day of 11th. == Books == * Kitab Sirr al-Asrar wa Mazhar al-Anwar (The Book of the Secret of Secrets and the Manifestation of Light) ==Related pages== * Jilala * Moinuddin Chishti == Bibliography == * * Fifteen letters, khamsata ashara maktūban / Shaikh Abd Al-Qādir Al-Jīlānī. Translated from Persian to Arabic by Alī usāmu ́D-Dīn Al-Muttaqī. Translated from Arabic into English by Muhtar Holland. * Kamsata ašara maktūban. First edition. ʿAlāʾ al- Dīn, ʿAlī B., ʿAbd al-Malik al- Muttaqī al-Hindī (about 1480–1567) and Muhtar Holland (1935–). Al-Baz publications, Hollywood, Florida. (1997) . * Jalā Al- Khawātir: a collection of forty-five discourses of Shaikh Abd Al-Qādir Al- Jīlānī, the removal of cares. Chapter 23, pg 308. Jalā al-Khawātir, Holland, Muhtar (1935–) (translator). Al-Baz publications, Fort Lauderdale, Florida. (1997) . * * * Al-Ghunya li-talibi tariq al-haqq wa al-din, (Sufficient provision for seekers of the path of truth and religion), Parts one and two in Arabic. Al-Qadir, Abd, Al-Gaylani. Dar Al-Hurya, Baghdad, Iraq, (1988). * Al- Ghunya li-talibi tariq al-haqq wa al-din, (Sufficient provision for seekers of the path of truth and religion.) in Arabic. Introduced by Al-Kilani, Majid Irsan. Dar Al-Khair, Damascus, Bairut, (2005). * * Geography of the Baz Ahhab second reading in the biography of Sheikh Abdul Qadir Jilani, and the birthplace of his birth according to the methodology of scientific research (MA in Islamic History from Baghdad University in 2001) of Iraqi researcher Jamal al-Din Faleh Kilani, review and submission of the historian Emad Abdulsalam Rauf،Publishe Dar Baz Publishing, United States of America, 2016, translated by Sayed Wahid Al-Qadri Aref. == Notes == == References == ==Other websites== * GOGHRAFI ALBAZ ALASHB, at archive.org. * Revelations of the Unseen Translation of Futuh al-Ghaib, at archive.org. * Sufficient Provision For Seekers Of The Path Of Truth Translation of parts of Al-Ghunya Li Talibi Tariq Al-Haqq, at archive.org. * Openings from the Lord Translation of excerpts from Al-Fath Al-Rabbani, at archive.org. * Utterances Translation of Malfuzat, at archive.org. Category:1077 births Category:1165 deaths Category:Asian Sufis Category:Iranian Islamic religious leaders Category:Iranian writers",
 "title": "Abdul Qadir Gilani"
}