{
 "id": "369587",
 "text": "Claude Dubar (born 11 December 1945) is an academic French sociologist. == Biography == After his teaching experience at Beirut, Lebanon in 1974, he became professor at the Lille University of Science and Technology in 1977.Le concept d'identité autour des travaux de Claude Dubar His thesis focuses on vocational training in FranceClaude DUBAR LA SOCIALISATION : CONSTRUCTION DES IDENTITÉS SOCIALES ET PROFESSIONNELLES. In 1988, he joined the Centre d'études et de recherches sur les qualifications (Centre for Studies and Research on Qualifications) in Paris, researching relations between the sociology of education and work, and especially the sociology of professional identities. Since 1993 till ???, he has been a sociology teacher at the Université de Versailles Saint-Quentin-en-Yvelines.Claude Dubar In 2012, he is Emeritus Professor (retired, with an honorific position given by Université). == Further reading == * Faire de la sociologie, un parcours d'enquêtes (Doing sociology, a survey path), 2006. * Sociologie des professions (Sociology of professions), 2005. * Analyser les entretiens biographiques (Analyze the biographical interviews), with Didier Demazière, 2004. () * La Socialisation, construction des identités sociales et professionnelles (Socialization, construction of social and professional identities), 2002, Armand Colin. ()La Socialisation : construction des identités sociales et professionnelles Claude Dubar * La Crise des identités (Crisis of Identity), 2001. (), 2010, PUF. ()Claude Dubar La crise des identités L'interprétation d'une mutation Paris. PUF, 2000. * La Promotion sociale en France (Social Promotion in France), with Charles Gadea, 1999. * Genèse et dynamique des groupes professionnels (Genesis and dynamic professional groups), with Yvette Lucas, 1994. * La Formation professionnelle continue (Continuing Professional Education), thesis, 1984. ==References== Category:1945 births Category:French sociologists Category:Versailles Saint- Quentin-en-Yvelines University faculty Category:Living people",
 "title": "Claude Dubar"
}