{
 "id": "36995",
 "text": "A celebrity is a person who is well known and gets lots of public attention, or attention from other people. A person whom the public knows such as a person in government might be well known but not a celebrity unless something else makes them interesting to other people. Usually, a person becomes a celebrity from entertainment such as someone who is in movies, someone who sings or raps songs, or someone who plays a sport. Some celebrities are not famous because of something they have done. They are famous most often because of which family they are a member of and/or how they are talked about by the media. These people are often called \"famous for being famous\". ==How one becomes a celebrity== People who act in movies and television actors, people who sing/rap are usually celebrities. High-ranking politicians, people who tell people the news, television show hosts, people who go to outer space, major-league athletes, comedians and people who sing songs are also sometimes celebrities. Sometimes people such as Mother Teresa have achieved fame because they help people who were in need and are saintly. === Music === Music is one of the most common ways that someone will be famous. Many musicians, Ssingers, songwriters and rappers become celebrities because their music and songs are listened to by a large amount of people. Another common way that artists will become famous is through winning or participating in competitions such as The X Factor (One Direction and Little Mix) and the Eurovision Song Contest (ABBA and Céline Dion). In addition, many bands become famous. Some famous bands include Take That and the Spice Girls Sometimes, when bands split up, many of its members decide to continue singing as solo artists. For example, Robbie Williams, Gary Barlow and Harry Styles all had very successful solo careers. It isn't just artists in the music industry who become famous. Some music managers an producers such as Simon Cowell are also famous. === Acting === Many actors who appear in popular films and film series tend to become very popular. For example, Daniel Radcliffe, Emma Watson (Harry Potter), Jennifer Lawrence (The Hunger Games), Johnny Depp (Pirates of the Caribbean),Robert Downey Jr (Marvel Cinematic Universe). Also, actors who have recurring roles in television series become well-known due to appearing on TV for a long period of time. Sofía Vergara, Jenna Ortega and Millie Bobby Brown are all known for their TV show work. Some actors aren't just known for their work on screen, but also for working in theatre, such as Benedict Cumberbatch. Many actors also pursue careers in singing, such as Ariana Grande and Miley Cyrus. === Sport === Because sports are among the most watched events in the world, many people who participate or are very skilled manage to gather a lot of fans. Football is one of the most popular sports so many footballers such as Cristiano Ronaldo, Lionel Messi and Kylian Mbappé are very famous, even among those who do not watch sports. === Television personality === A \"television personality\" is a person who is well known for being on television. These people are often hosts or guests on television programs such as talk shows or discussion programs. These people can be experts on a subject, comedians adding a comedic point of view to the subject or anyone else the producers of the program think would make the program better or more entertaining for the audience. These people often have some level of celebrity status because of their main profession but some are just famous because they were on television. In addition, a \"media personality\" is a person who may have appeared in film, television, entertainment and is talked about a lot by the media. The Kardashian family became famous for the show Keeping Up with the Kardashians. === Other types of celebrities === High-ranking politicians are also very famous, especially if they are leaders of very influential territories. Examples of politicians who could be considered celebrities are Donald Trump, Joe Biden and Sylvester Stallone. Also, many comedians are well- liked because of their ability to make people laugh. In more recent years, people on social media who are very popular have become celebrities, such as Charli D'Amelio. People who are famous because of social media are often called \"influencers\". Some celebrities became famous from creating a successful company examples of this include Mark Zuckerberg and Jeff Bezos. === Social media === A lot people of people become famous now due to social media. Cardi B, Troye Sivan, Justin Bieber, Halsey, Soulja Boy, The Weeknd and Doja Cat started their fame from the internet.Celebrities Who Got Started Going Viral Online Influencers are becoming celebrities. Streamer Kai Cenat has millions of followers on social media.The dubious power of celebrity influencers ==Celebrity families== Individuals can achieve celebrity, but there are also many celebrity families, such as various royal families (often interest in these will be highest when scandal is involved, as with the House of Windsor) and artistic 'dynasties' e.g. the Barrymore, Cassidy (David and Shaun Cassidy), the Rockefellers, the Osmonds, Osbournes, the Kardashians (Kim Kardashian), Jackson, the Trump (Donald Trump, Fred Trump) and Baldwin families. Celebrity families can also include political families such as the Kennedys, the Roosevelts, and the Reagans. ==Celebrity dislikes== Because celebrities have fame similar to that of royalty or gods in the past, some people are curious about their private lives and dislike celebrities for their rewards. Many think that celebrities do not work as hard as non-celebrities and that celebrities do not deserve to be treated specially. Since their failures are made public celebrities can be seen as having lower moral values than most people. Not all celebrities exhibit bad behavior and sometimes they do things that are good and help people. A recent phenomenon has occurred wherein intricate marketing plans are developed in order to lure adolescents into purchasing celebrity-related goods. Some have argued that the idea of celebrity is self-reinforcing and becoming empty: some celebrities are not famous for their actions, but simply famous for their fame and money. For example, Paris Hilton would not be a public figure without her money, but her family's importance has created and helps her be well known and a celebrity. People call people like Hilton \"famous for being famous\". Some believe she is doing it on purpose, but in many ways, people like Hilton and other 21st century celebrities are just doing what other celebrities did before. Celebrities don't have a private life due to being in celebrity gossip magazines and celebrity gossip websites like TMZ. Celebrities are usually followed by the paparazzi in Los Angeles, California every day. Some celebrities take drugs and have mental breakdowns because of this. Some celebrities attract stalkers who may want to kill them, get to know them personally, marry them or have sex with them. Some fans develop Celebrity Worship Syndrome, which causes them to be so obsessed with a celebrity, they are unable to stop having fantasies about them.A New Age of Celebrity Worship ==References==",
 "title": "Celebrity"
}