{
 "id": "37000",
 "text": "Epinephrine, also known as adrenaline,Aronson, Jeffrey K. \"'Where name and image meet'—the argument for 'adrenaline',\" British Medical Journal (BMJ). 19 February 2000, Vol. 320, Issue 2733, pp. 506-509; retrieved 2012-11-15. is a hormone and a medication. The names \"adrenaline\" and \"epinephrine\" come from the Latin words ad-+renes and the Greek words epi-+nephros. Both mean \"into or onto the kidney\" (adrenaline is made in the adrenal glands, which sit on top of the kidneys). In medical jargon, epinephrine is shortened to just \"epi\" (pronounced eh-pee). ==History== The hormone was first isolated and purified in 1901 by Japanese chemist Jokichi Takamine. It was patented in the United States with the name \"adrenaline.\" == Effects in the body == Epinephrine is one of two chemical messengers that control the sympathetic nervous system and cause the \"fight or flight\" response. Epinephrine makes the \"fight or flight\" response kick in, and causes changes in every part of the body. For example, it: * Makes the heart beat faster * Increases blood pressure * Causes vasoconstriction (it makes the blood vessels narrower, which sends extra blood to the most important organs in the body, like the heart, lungs, and brain) * Causes bronchodilation (it makes the bronchi, the tubes that bring air to the lungs, get wider, so more air can get into the lungs) === Adverse effects === Because epinephrine causes so many changes in the body, it can cause changes that make a person feel bad. Sometimes, it can cause changes that could be dangerous. These are called adverse effects. They include: * Tachycardia (a fast heart rate) or heart palpitations (feeling the heart pounding inside the chest), because epinephrine makes the heart beat harder and faster * Hypertension (high blood pressure), because epinephrine raises blood pressure * Cardiac arrhythmia (where the heart beats in a way that is not normal) * Anxiety or panic attack * Tremor * Acute pulmonary edema (fluid in the lungs) == Medical uses == Epinephrine is used to treat a few different medical problems. === Cardiac arrest === Epinephrine can restart a person's heart when they are in cardiac arrest (their heart has stopped beating). It can make the heart start pumping blood to the rest of the body again. === Anaphylaxis === Epinephrine is the best medicine to treat anaphylaxis, which is a very bad allergic reaction. During anaphylaxis, the bronchi (which bring air to the lungs) get narrower and narrower until the person cannot breathe. Epinephrine makes the bronchi get wider so air can get into the lungs and the person can breathe again. It also treats some of the other symptoms of anaphylaxis. People with allergies can get a doctor's prescription for an epinephrine \"auto-injector.\" Anyone can learn to use an auto-injector. If a person starts having anaphylaxis, they just press the auto-injector to the outside of their thigh, and the device will automatically inject the right dose of epinephrine into the person's thigh. === Asthma === Epinephrine can be given for asthma attacks, if regular asthma medications like albuterol do not work.Soar, Perkins, et al (2010) European Resuscitation Council Guidelines for Resuscitation 2010 Section 8. Cardiac arrest in special circumstances: Electrolyte abnormalities, poisoning, drowning, accidental hypothermia, hyperthermia, asthma, anaphylaxis, cardiac surgery, trauma, pregnancy, electrocution. Resuscitation. Oct. pp.1400–1433Fisher, Brown, Cooke (Eds) (2006) Joint Royal Colleges Ambulance Liaison Committee. UK Ambulance Clinical Practice Guidelines. The epinephrine will relax the muscles around the lungs and widen the bronchi, making it easier to breathe. === Croup === Croup is a disease that mostly happens in children, and is caused by a virus. It can cause swelling in the throat, which can make it hard to breathe. Epinephrine can help bring this swelling down, which makes it easier for the child to breathe. Epinephrine works best for croup if it is breathed in, so it is made into a special mist that can be inhaled. ==Related pages== * Hormone * Sympathetic nervous system * Cardiac arrest * Anaphylaxis * Asthma * Croup ==References== ==Other websites== * The Effect of epinephrine on liver cells. (animation) Category:Hormones Category:Organonitrogen compounds Category:Bronchodilators",
 "title": "Epinephrine"
}