{
 "id": "370296",
 "text": "Jeffrey Paul Mass (June 29, 1940 – March 30, 2001) was an American academic, historian, author and Japanologist. He was Yamato Ichihashi Professor of Japanese History at Stanford University.Sanford, John. \"Jeffrey Mass, a leading authority on Japanese medieval history, dead at 60,\" Stanford News Service. April 9, 2001; retrieved 2012-11-9. ==Early life== Mass was born in New York City in 1940. He earned a BA degree in history from Hamilton College in 1961. He received his PhD. in history from Yale University in 1971.Hamilton College, \"Hamilton College Honorary Degree Presented in memoriam to Jeffrey P. Mass ’62\" ; retrieved 2012-11-9. ==Career== Mass joined the Stanford University faculty in 1973. He became a full professor in 1981. ==Selected works== In an overview of writings by and about Mass, OCLC/WorldCat lists roughly 30+ works in 110+ publications in 3 languages and 5,000+ library holdings. WorldCat Identities: Mass, Jeffrey P.; retrieved 2012-11-9. :This list is not finished; you can help Wikipedia by adding to it. * Warrior government in early medieval Japan: a study of the Kamakura Bakufu, shugo and jitō, 1974 * The Kamakura bakufu: a study in documents, 1976 * The development of Kamakura rule, 1180-1250: a history with documents, 1979 * Court and Bakufu in Japan: essays in Kamakura history, 1982 * The Bakufu in Japanese history, 1985 * Lordship and inheritance in Early Medieval Japan: a study of the Kamakura Soryō system, 1989 * Antiquity and anachronism in Japanese history, 1992 * The origins of Japan's medieval world: courtiers, clerics, warriors, and peasants in the fourteenth century, 1997 * Yoritomo and the founding of the first Bakufu: the origins of dual government in Japan, 1999 ==References== ==Other websites== * Mass, Jeffrey P., 1940-2001 at Virtual International Authority File (VIAF) * Jeffrey P. Mass, 1940-2001 at MeijiGakuin.ac.jp Category:1940 births Category:2001 deaths Category:American historians Category:American Japanologists",
 "title": "Jeffrey Mass"
}