{
 "id": "370323",
 "text": "Musa Ibrahim () is a Bangladeshi mountaineer and a journalist. He reached the summit around 5:05am BST on May 23, 2010. He put up the flag of Bangladesh on the summit at around 5:16am BST. From then, Bangladesh became the 67th country to have one of its citizens reach the top of Mount Everest. Musa Ibrahim is the General Secretary of North Alpine Club Bangladesh, a Bangladeshi mountaineering club. He also serves as Senior Correspondent at Channel 24. He also served as the sub-editor of The Daily Star. He founded \"Everest Academy\" on 2011 to get more young people to participate in mountaineering and adventure activities. Musa reached the top of Mount Kilimanjaro on 13 September 2011, with his team member Niaz Morshed Patwary. == Education == Musa Ibrahim attained his Bachelor of Education(B.Ed) degree on Science Education and Master of Education(M.Ed) degree on Educational Evaluation and Research from 'Institute of Education and Research (IER), University of Dhaka. He also attained a degree on Disaster Management from BRAC University. Musa Ibrahim was a student of Thakurgaon Sugar Mills High School during 1983 to 1994. == Family == Musa Ibrahim is the second child of his parents. His father's name is Ansar Ali and mother's name is Bilkis Begum. His elder sister is Noor Ayesha, UN employee and younger brother is Shoeb Harun, studying in Sydney, Australia. He got married in January 2007 to Ummey Sharaban Tahura, Assistant Judge. Their only son is Wasi Ibrahim Raiid. ==Mountaineering timeline== *September 13, 2011: Mount Kilimanjaro (5,885 m/19,308 ft) Summit *May 23, 2010: Everest(8848m/29,029 ft) Summit *June 14, 2009: Annapurna IV (7525m/24682 ft) Summit *December 1, 2008: Langsisa Ri (6310m/20700 ft) Summit *May, 2007: Chullu West(6419m/21054 ft)Ascent up to 18500 ft *May, 2006: Frey Peak(5831m/19125 ft) Summit *September, 2005: Advanced Mountaineering Training(5335m/17500 ft) Finished training successfully *May, 2005: Mera Peak(6654m/21825 ft) Ascent up to 18500 ft *May 10–23, 2004: EBC Trail(5335m/17500 ft) Trekked successfully *April, 2004: Basic Mountaineering Training(4878m/16000 ft) Finished training successfully *April 8–16, 2002: Annapurna Trail(3800m/12464 ft) Ascent Muktinath *September 2000: Keocradong Hill(967m/3172 ft) Trekked to the top successfully ==References== * thedailystar.net ==Other websites== *Musa's official website *http://jugantor.info/enews/issue/2010/05/25/news0454.php *http://www.prothom- alo.com/detail/date/2010-05-25/news/65859 *http://www.bdnews24.com/details.php?cid=2&id;=162247&hb;=top Category:1979 births Category:Living people Category:Bangladeshi journalists Category:Mountain climbers",
 "title": "Musa Ibrahim"
}