{
 "id": "370450",
 "text": "The Supermarine Spitfire is a British single-seat fighter aircraft. It was used by the Royal Air Force and many other Allied countries throughout the Second World War, gaining its respect when defending the English Channel from the Luftwaffe in Operation Sea Lion and the Battle of Britain. The Spitfire was designed by R. J. Mitchell as a short-range, high-performance interceptor aircraft. There were more Spitfires made than any other British aircraft and it was the only British fighter that was being made throughout the war. The Supermarine Spitfire was no doubt one of the very best British warplanes, and a large roleplayer of WWII. It had great speed, agility and weaponry. Over time, the Spitfire evolved into an even better aircraft. This is all a pilot could ask for. It had very few flaws, the main being that the engine would usually stall when entering a dive or when experiencing negative pressure/G-Forces due to its float carburetor engine. The Spitfire's elliptical wing had a thin cross-section. This allowed a higher top speed than other fighters of the time, including the Hawker Hurricane. The elliptic shaped wing gives the aircraft a very low amount of induced drag. Speed was seen as essential to carry out the mission of home defence against enemy bombers. The original airframe was designed to be powered by a Rolls-Royce Merlin engine producing 1,030 hp (768 kW). Because of its higher performance, Spitfire units had a higher victory-to-loss ratio than units flying Hurricanes. The Spitfires were originally built at the Supermarine factory in Southampton, to be closer to the fighting front. Later, heavy bombing struck Southampton and the production moved to the Castle Bromwich factory in Birmingham where Spitfires would be produced for the Britain for the rest of the war. A memorial has been built in honour of the workers by Tim Tolkien. It is called Sentinel. ==Specifications (Spitfire MK VB)== Data from Spitfire: The History[184] and Jane's Fighting Aircraft of World War II[185] ===General characteristics=== *Crew: One pilot *Length: 29 ft 11 in (8.87 m) *Wingspan: 36 ft 10 in (11.23 m) *Height: 11 ft 5 in (3.86 m) *Wing area: 242.1 ft2 (22.48 m2) *Airfoil: NACA 2213 (root) NACA 2209.4 (tip) *Empty weight: 5,065 lb (2,297 kg) *Loaded weight: 6,622 lb (3,000 kg) *Max. takeoff weight: 6,700 lb (3,039 kg) *powerplant: 1 × Rolls-Royce Merlin 45[nb 16] supercharged V12 engine, 1,470 hp (1,096 kW) at 9,250 ft (2,819 m) ===Performance=== *Maximum speed: 370 mph (322 kn, 595 km/h) *Combat radius: 410 nmi (470 mi (756 km)) *Ferry range: 991 nmi (1,135 mi (1,827 km)) *Service ceiling: 36,500 ft (11,125 m) *Rate of climb: 2,600 ft/min (13.2 m/s) *Wing loading: 27.35 lb/ft2 (133.5 kg/m2) *Power/mass: 0.22 hp/lb (0.36 kW/kg) ===Armament=== *Guns: **A wing *** 8 × .303 in Browning Mk II* machine guns (350 rounds per gun) ** B wing *** 2 × 20 mm Hispano Mk II (60 rounds per gun) *** 4 × .303 in Browning Mk II* machine guns (350 rounds per gun) ** C wing *** 4 × 20 mm Hispano Mk II cannon (120 rounds per gun) ** C wing (Alt.) *** 2 × 20 mm Hispano Mk II (120 rounds per gun) *** 4 × .303 in Browning Mk II* machine guns (350 rounds per gun) ** E wing *** 2 × 20 mm Hispano Mk II cannon (120 rounds per gun) *** 2 × .50 in M2 Browning machine guns (250 rounds per gun) == References == Category:World War II British aircraft Category:Royal Air Force aircraft",
 "title": "Supermarine Spitfire"
}