{
 "id": "370510",
 "text": "Bahá-ud-dín Shah an-Naqshband Muhammad al-Uwaysi al-Bukhárí () (1318–1389) was the founder of what would become one of the largest Sufi Sunni orders, the Naqshbandi. == Biography == Bahá-ud-dín was born on 18 March 1318 CE (14 Muharram, 718 AH) in the village of Qasr-i-Hinduvan (later renamed Qasr-i Arifan) near Bukhara, in what is now Uzbekistan and it was there that he died in 1389. === Lineage === Bahá-ud-dín was a Sayyid, a descendant of the Islamic prophet Muhammad through Imam Hasan al-Askari. Harvard professor Annemarie Schimmel held the opinion of Bahauddin Naqshband being a descendant of Imam Hasan al Askari.Schimmel in Pain and Grace, p. 32, quote: \"Khwaja Mir Dard´s paternal family came from Bukhara; they led their pedigree back to Bahauddin Naqshband, after whom the Naqshbandi order is named, and who was a descendant in the 13th generation of the 11th Shi´a Imam al-Hasan al-Askari\" One registered lineage of him is the following:Tazkare Khanwade Hazrat Ishaan, p. 62 f., by Yaseen Qasvari, published by \"Idarat Talimate Naqshbandiyya\" # Muhammad # Ali ibn Abi Talib and Fatima Al Zahra # Imam Hussain # Imam Ali Zayn al-Abidin # Imam Muhammad al Baqir # Imam Ja'far al-Sâdiq # Imam Musa al- Kazim # Imam Ali al Reza # Imam Muhammad al Taqi # Imam Ali al Hadi # Imam Hasan al-Askari # Mir Sayyid Ali Akbar # Sayyid Mir Muhammad Mahmud Fakhriddin # Amir Sayyid Mir Muhyuddin # Amir Sayyid Mir Khalwati # Amir Sayyid Mir Naqi Naqib # Sayyid Mir Ilaq # Sayyid Mir Mahmud # Sayyid Burhan Qilich # Sayyid Mir Shaaban # Sayyid Mir Qasim # Sayyid Mir Zayn ul Abedin # Sayyid Mir Abdullah # Sayyid Mir Burhanuddin Qilich # Amir Sayyid Mir Jalalludin Muhammad Bukhari # Amir Sayyid Mir Muhammad Bukhari # Bahauddin Naqshband == Naqshbandi Golden Chain == He came into early contact with the Khwajagan (lit: the Masters), and was adopted as spiritual progeny by one of them, Baba Muhammad Sammasi, while still an infant. Sammasi was his first guide on the path, and more important was his relationship with Sammasi's principal khalifa (successor), Amir Kulal, the last link in the silsila, or chain of teachers, before Baha-ud-Din: # Muhammad # Sayyidna Abu Bakkar Siddique # Salman the Persian # Qasim ibn Muhammad ibn Abu Bakkar # Ja'far al-Sadiq # Bayazid Bistami # Abu al-Hassan al-Kharaqani # Abu Ali Farmadi # Abu Yaqub Yusuf al- Hamadani # Abdul Khaliq al-Gajadwani # Arif ar-Riwagri # Mahmood Anjir- Faghnawi # Azizan Ali Ramitani # Mohammad Baba As-Samasi # Sayyid Amir Kulal # Imam at-Tariqah Muhammad Baha'uddin Shah Naqshband As a youth, Naqshbandi was recognized as an exceptional Islamic scholar before he turned 20. He traveled to Mecca for the Islamic pilgrimage Hajj at least three times. He became a respected scholar in Central Asia and received many guests and pupils to Bukhara from other parts of Central Asia. == Death == Bahá-ud-dín was buried in his native village, Qasr-i Arifan, in 1389. In 1544, Khan Abd al-Aziz built over his grave a tomb and surrounding buildings. The Memorial complex is located 16 kilometers from Bukhara and is today a place of pilgrimage. == References == == Further reading == * The Rules or Secrets of the Naqshbandi Order by Omar Ali-Shah (1992) * The Masters of Wisdom by John G. Bennett (1995) * The Naqshbandi Sufi Way, (History and Guidebook of the Saints of the Golden Chain). by Shaykh Muhammad Hisham Kabbani. Kazi Publications, USA (1995) * Classical Islam and the Naqshbandi Sufi Tradition, Shaykh Muhammad Hisham Kabbani, Islamic Supreme Council of America (June 2004), . == Other websites == * The official website of Shaykh Zulfiqar Ahmad Naqshbandi the patron of Naqshbandi-Mujaddidi Order in East and West. * The official website of the Naqshbandi-Haqqani Sufi Order of America * Naqshbandia Owaisiah * Ghazwat ul-Hind * The official website of the Naqshbandiyya-Mujaddidiyya Order of the USA and Europe Category:1318 births Category:1389 deaths Category:Asian Sufis",
 "title": "Baha-ud-din Naqshband"
}