{
 "id": "370540",
 "text": "The Khalistan Movement is a Sikh secessionist movement for the creation of an independent Sikh state, Khālistān (\"Land of the Khalsa\") by seceding Punjab state from India. The geographical area of Khalistan has not been well defined, with several proposed maps from different groups that mainly include Punjab, Chandigarh, and punjabi speaking parts of the neighboring states of India. The Khalistan movement reached its peak in India in the 1980s and 1990s. After 1990s, the Khalistan insurgency petered out, and the movement failed to reach its objectives due to multiple reasons including a heavy police crackdown on separatists, factional infighting, and disillusionment from the Sikh population. The 1980s and 1990s' are often called dark days in Punjab due to widespread violence from both the Punjab Police and the pro- Khalistan militants, as the Police took a heavy-handed approach in dealing with the armed insurgency, while the militants were also involved in large- scale murders. In October 1983, following the murder of several Hindu bus passengers by the Sikh militants, an \"Emergency rule\" was imposed in Punjab, which continued for a decade.Sisson, Mary. 2011. \"Sikh Terrorism.\" pp. 544–545 in The Sage Encyclopedia of Terrorism (2nd ed.), edited by G. Martin. Thousand Oaks, CA: Sage Publications. . . In June 1984, Operation Blue Star, an Indian military operation was ordered by Prime Minister Indira Gandhi, to remove pro- Khalistan militant religious leader Jarnail Singh Bhindranwale and his armed followers from the Golden Temple in Amritsar, Punjab. On 31 October 1984, Indira Gandhi was assassinated in New Delhi by her two Sikh security guards in retaliation for Operation Blue Star. The assassination triggered the 1984 anti-Sikh riots in New Delhi, in which large number of Sikhs were killed.Guidry, John A., Michael D. Kennedy, and Mayer N. Zald, eds. 2000. Globalizations and Social Movements: Culture, Power, and the Transnational Public Sphere. Ann Arbor: University of Michigan Press. . p. 319. In June 1985, Air India Flight 182, which was operating from Montréal, Canada was bombed in route to London over the Atlantic Ocean, as a result of explosives planted by pro-Khalistan Sikh militants; and all on-board passengers were killed. Further, in August 1995, Chief Minister of Punjab, Beant Singh was killed in a suicide bombing, for which the pro-Khalistan group Babbar Khalsa claimed responsibility. While the pro-Khalistan militants enjoyed some support among Punjab's Sikh community in the earlier period, this support gradually disappeared.Mahmood, Cynthia. 5 May 1997. \"Fax to Ted Albers.\" Orono, Maine: Resource Information Center. With a weakening economy, dwindling support, and increasing operations from the Indian security forces, the militancy in Punjab effectively ended by the mid 1990s.Documentation, Information and Research Branch. 17 February 1997. \"India: Information from four specialists on the Punjab, Response to Information Request #IND26376.EX.\" Ottawa: Immigration and Refugee Board of Canada. ==References== Category:Sikhism",
 "title": "Khalistan Movement"
}