{
 "id": "370896",
 "text": "Djimon Gaston Hounsou (born April 24, 1964) is a Beninese-American actor and model. As an actor, Hounsou has been nominated for two Academy Awards.Djimon Hounsou: The Push Interview Kam Williams. KamWilliams.com. 2009-01-30 In 1987, he became a model and started a career in Paris. He moved to the United States in 1990.Djimon Hounsou Biography In the Marvel Cinematic Universe he plays the role of Korath the Pursuer in Guardians of the Galaxy (2014) and in Captain Marvel (2019). Also, in the DC Extended Universe, he played the role of the Fisherman King in Aquaman (2018), and the wizard Shazam in Shazam! (2019). ==Filmography== List of movie and television credits Year Title Role Notes 1990 Beverly Hills, 90210 Doorman 1990 Without You I’m Nothing Ex-boyfriend 1992 Unlawful Entry Prisoner on bench 1994 Stargate Horus Guard 1997 The Small Hours 1997 Amistad Cinque NAACP Image Award for Outstanding Actor in a Motion Picture Nominated - Golden Globe Award for Best Actor – Motion Picture Drama Nominated - Satellite Award for Best Actor – Motion Picture Drama 1997 Ill Gotten Gains Fyah 1998 Deep Rising Vivo 1999 ER Mobalage Ikabo 6 episodes 2000 Gladiator Juba Nominated - Blockbuster Entertainment Award for Favourite Supporting Actor Nominated - Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2000 The Middle Passage Narrator (documentary) (narrator in US version) 2001 Soul Food Victor Onuka 1 episode 2001 The Tag Marshall 2002 Le Boulet/Dead Weight Detective Youssouf 2002 The Four Feathers Abou Fatma 2002 In America Mateo Black Reel Award for Best Supporting Actor Independent Spirit Award for Best Supporting Male San Diego Film Critics Society Award for Best Supporting Actor Satellite Award for Best Supporting Actor – Motion Picture Nominated - Academy Award for Best Supporting Actor Nominated - NAACP Image Award for Outstanding Supporting Actor in a Motion Picture Nominated - Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2003 Biker Boyz Motherland 2003 Lara Croft Tomb Raider: The Cradle of Life Kosa 2004 Alias Kazari Bomani (season 3, Mr Bomani) 3 episodes 2004 Blueberry Woodhead 2005 Constantine Midnite 2005 Beauty Shop Joe 2005 The Island Albert Laurent 2006 Blood Diamond Solomon Vandy Black Reel Award for Best Supporting Actor Las Vegas Film Critics Society Award for Best Supporting Actor NAACP Image Award for Outstanding Supporting Actor in a Motion Picture National Board of Review Award for Best Supporting Actor St. Louis Gateway Film Critics Association Award for Best Supporting Actor Washington D.C. Area Film Critics Association Award for Best Supporting Actor Nominated - Academy Award for Best Supporting Actor Nominated - Broadcast Film Critics Association Award for Best Supporting Actor Nominated - Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role 2006 Eragon Ajihad 2008 Never Back Down Jean Roqua 2009 Push Henry Carver 2010 The Tempest Caliban 2011 Elephant White Curtie Church 2011 Forces spéciales Kovax ==References== ==Other websites== * Category:1964 births Category:Living people Category:African-American actors Category:Beninese people Category:American movie actors Category:American television actors Category:French television actors Category:French movie actors",
 "title": "Djimon Hounsou"
}