{
 "id": "37094",
 "text": "The Battle of the Somme took place in The Great War (World War I). The battle began on 1 July 1916, and ended on 18 November 1916. The battle was named after the French River Somme where it was fought. On the first day the British Army had 57,470 casualties, of whom 19,240 were killed. The French Army had 1,590 casualties and the German Army lost 10,000–12,000 men. The Allies planned to attack together, but the French were busy with the Battle of Verdun, so the main attackers were British. The cost of the battle, and the small gains, have been a source of grief and controversy in Britain. In German and French writing, the first day of the Battle of the Somme has been little more than a footnote to the mass losses of 1914–1915 and the Battle of Verdun. During the battle of the Somme more than 1.5 million people either died, were wounded or went missing. This battle was the worst battle in WWI, especially from the point of view of Britain. For five days the British fired shells at the German trenches to destroy them. At 7:30 am on 1 July the British generals ordered the British soldiers out of their trenches and to advance towards the German trenches. The German trenches were unusually deep, and the German soldiers were able to take the machine guns down during the bombardment, and bring them up afterwards. Whole books have been written about this disaster,Middlebrook M. 1971. The first day on the Somme. London: Penguin Books. Farrar-Hockley A. 1970. The Somme. London: Batsford. Gliddon G. 1987. When the barrage lifts: a topographical history and commentary on the Battle of the Somme 1916. Norwich: Gliddon Books. but it is still not clear why it happened. It is very clear, though, that the artillery barrage failed in its objective. Where enough German machine-gunners survived, supported by their artillery, the British attack failed, with many casualties. The effectiveness of the defensive weapons decided the result. In such an environment, a soldier with a bayonet was obsolete and infantry formations useless.Prior R. & Wilson T. 2005. The Somme. Yale University Press, p116. == Weapons == === Poison Gas === The Germans used poisonous gases as weapons at first. (This is now called chemical warfare.) Germany first used chlorine gas. Death from chlorine gas was very painful, causing the victim to suffocate after suffering from burning pains in their chest. However, because of its green color and strong smell, chlorine gas was easy for the enemy to detect. It also blew back on the Germans when they used it. To protect themselves, they began to wear dampened material over their mouths and noses. Soldiers dampened this material with urine because it made these masks work more effectively. The British soldiers were given cotton pads and respirators. The Germans began to mix chlorine gas with a different gas, called phosgene. Phosgene gas is colorless, more deadly than chlorine, and smells like moldy hay. A person does not get sick as soon as they inhale phosgene gas; it does not take effect until 24 hours later. Then the person’s lungs fill with fluid, which can cause them to drown. ===Rifles (guns)=== The soldiers in the trenches used their big dongs. Most soldiers used the bolt-action rifle, which could fire 15 rounds per minute and could kill a person as far as 1.4 kilometers away. This rifle was invented in the United States by a Scottish man called James Paris Lee. The bolt-action rifle had a metal box where the cartridges were put on top of a spring. As the bolt opened, the spring forced the cartridges up against a stop and the bolt pushed the top cartridge into the chamber as it closed. After the rifle was fired, the opening of the bolt ejected the empty cartridge case and the return stroke loaded a fresh round. The cases held 3, 5, or 29 cartridges each. ===Machine guns=== Both sides also used machine guns. These were so large that four men were needed to operate each one. They had to be put on a flat surface. They had the power of one rifle. Larger field guns needed up to 12 men to operate them. They fired shells which exploded when they hit. The machine guns were a major force for the Germans, who used them to their full effect as the British forces simply walked over no man's land straight into the open gunfire. The British did not have access to many machine guns, which made their task even more difficult. The Germans were in a higher position than the British, which gave them the upper hand. ===Tanks=== The first tank was called 'Little Willie', and it had a crew of three men. The maximum speed that it could travel was three mph and it was not able to cross the trenches. The first tank battle, Flers-Courcelette named after the two villages that were the objectives for the attack, started on 15 September 1916. Out of the 49 tanks that should have been there only 36 arrived. This was the first time that tanks had been used in World War I, but because they were only armed lightly and the mechanics of them often went wrong they did not make a great impact. However, casualties were low in the tank crews. ===Mines=== Mines (devices planted underground which explode when something gets close) were used to hurt and surprise the enemy. Anti-infantry land mines have been in use since the invention of gunpowder and were used in the defense of breaches of fortresses in the 18th and 19th century (the British assault on the breach at Badajoz suffered many casualties from mines). However, these were activated remotely by a defender lighting a very fast-burning fuse at the appropriate moment. The British used 11 mines on the first morning of the Battle of Somme to startle and damage the German front line. The holes left by the mines were used by the Germans for machine guns afterward. The soldiers that set the land mines were called sappers. ==Trenches== There was a lot of disease in the trenches. The toilets in the trenches were mainly buckets and holes. This made it easy for diseases to spread quickly. For example, many soldiers got dysentery, which causes bloody diarrhoea. The diarrhoea is severe and can make a person so dehydrated that they die. The water supply in the trenches was not very good. Soldiers collected rain water from the holes made by enemy shells. They added chloride of lime to purify this dirty water. However, the soldiers did not like the taste of the chloride of lime (which tasted a bit like modern swimming pool water). The soldiers in the trenches suffered from lice. One man described them as \"pale fawn in colour, and they left blotchy red bite marks all over the body.” Another soldier said: > \"The things lay in the seams of trousers, in the deep furrows of long thick > woolly pants, and seemed impregnable in their deep entrenchment. A lighted > candle applied where they were thickest made them pop like Chinese crackers. > After a session of this, my face would be covered with small blood spots > from extra big fellows which had popped too vigorously.\" Lice caused severe itching and also carried a disease called trench fever (pyrrexhia). The first symptoms were shooting pains in the legs. This was followed by a very high fever. This disease did not kill the soldiers, but it did stop them from fighting. It was very common. From 1915 to 1918, between one-fifth and one-third of all British troops who got sick had trench fever; about one-fifth of ill German and Austrian troops had the disease. Another common problem was trench foot. This was another infection, caused by standing in wet conditions for a long time and not being able to dry out shoes and socks. Trench foot caused soldiers’ feet to go numb, then turn red or blue. It can cause gangrene, which sometimes requires the foot to be amputated. Brigadier-General Frank Percy Crozier argued that “The fight against the condition known as trench-feet had been incessant [never-ending] and an uphill game.\" The only way to get rid of trench foot was to dry the feet and change into dry socks several times a day. This was not possible in the trenches. Mines and shells injured tens of thousands of soldiers on both sides. In many cases, soldiers were so badly injured that doctors had to amputate parts of their bodies. Because there were so many corpses in the trenches, rats were a serious problem. The rats carried disease and ate the corpses of dead soldiers. They ate the eyes first, then burrowed into the corpse and ate the insides. One soldier, Harry Patch, claimed the rats in the trenches were as big as cats. Another said: “The rats were huge. They were so big they would eat a wounded man if he couldn't defend himself!\" The area between the two sides was called No Man’s Land. It was very dangerous because there was lots of barbed wire and shell-holes. Also, no man’s land was usually a sea of mud. The soldiers that “went over the top” (left the trenches to attack the enemy) were easy targets for machine gunners. On both the German and Allied sides, about 600,000 soldiers died in the battle. ==The Prince of Wales== The Prince of Wales served on the Somme as a Staff Officer. He was genuinely disappointed not to be involved in the fighting. However, his service influenced the rest of his life as Prince of Wales and Edward VIII. ==Today== Today, there are cemeteries, war memorials and museums on the battle site. When farmers living near the battle site plow their fields, they often find remnants of barbed wire, bullets, shrapnel, and unexploded bombs. This is called \"iron harvesting.\" == References == Category:1916 in France Somme Somme Somme Somme Somme Somme Somme Somme Somme Category:Somme Category:Pas-de-Calais",
 "title": "Battle of the Somme"
}