{
 "id": "371288",
 "text": "The Lady Garden Park (originally Ladies' Garden) is a public park in Abbottabad town, Pakistan. ==History== The park was established soon after the foundation of Abbotabad town itself (January 1853) by Major James Abbott.Hazara District Gazeteer 1883-84 Published Lahore:Government of the Punjab, 1884 As distinct from the Company Bagh (East India Company Park) which was also founded down in the main bazaar for the recreation of \"natives\", the Ladies Garden was exclusively for the use of European or White ladies and families. It was laid out over a whole block of the urban military cantonment area, opposite to St Luke's Church, Abbottabad. A number of trees and flowers imported from England and other places were also planted here.Hazara Gazeteer 1883-84 While the British Raj in India lasted, this park retained its exclusive character, but after the Independence of Pakistan in 1947, it was opened to all the general public. ==Present status== The park is a very popular recreational place for the citizens of Abbottabad. Apart from the general, open area with lawns and walks etc., a section has also been segregated for women and children, with swings, slides, see-saws and so on. A small snack-bar and benches are also placed in a pleasant location, under some fine old trees. A special feature of the park is the copy of the farewell poem written by Major Abbott, the town's founder, which has been carved on a big stone slab beneath a majestic cedar tree.Hazara District Report 1993 Section on Abbottabad, p.68 Many tourists come to see and read this and get themselves photographed here (See Link Below for Abbott Poem Text). ==In literature== The park has some literary connections, or has been mentioned in some literary works, most notably: * The Urdu poem \"Abar\" (Rain-cloud) by the national poet of Pakistan, Allama Muhammad Iqbal was written during a visit to this park in the town during the British period, in the early 20th century (probably in 1904).See Prof. B.A Souz, Iqbal aur Abbottabad (Urdu monograph: Iqbal and Abbottabad), 2003 * The park is mentioned in passing for its beautiful old trees in a poem by Pakistani poet and writer, Omer Tarin in the collection A Sad Piper, 1st edition, Islamabad, 1994.See Open Library Catalog for Tarin's works http://openlibrary.org/authors/OL101176A Retrieved 16 Nov 2012 ==References== ==Other websites== * Text of Abbottabad Poem at English Wikipedia, by Major James Abbott; Retrieved 17 November 2012 Category:Abbottabad Category:Parks in Pakistan",
 "title": "Lady Garden Park"
}