{
 "id": "371319",
 "text": "America's Next Top Model, Cycle 15 is the fifteenth cycle of America's Next Top Model. It premiered on September 8, 2010. The episode titles for this cycle were based on the guest judges. The international destinations for this cycle are Venice, Milan, Verona and Como. The winner was 19-year-old Ann Ward from Dallas, Texas. ==Contestants== (ages stated are at time of contest) Contestant Age Hometown Rank Anamaria Mirdita 19 Queens, New York 14th Terra White 24 Arlington, Texas 13th Sara Blackamore 21 Menifee, California 12th Rhianna Atwood 20 San Diego, California 11th Alexia \"Lexie\" Tomchek 18 Geneva, Illinois 10th Kacey Leggett 20 Palmdale, California 9th Kendal Brown 23 Northport, Alabama 8th Esther Petrack 18 Boston, Massachusetts 7th Lyzbeth \"Liz\" Williams 21 Arlington, Texas 6th Christin \"Chris\" White 20 Arlington, Texas 5th Kayla Ferrel 19 Rockford, Illinois 3rd/4th Jane Randall 19 Baltimore, Maryland 3rd/4th Chelsey Hersley 23 Boise, Idaho Runner-Up Ann Ward 19 Dallas, Texas Winner Chelsey's age during on the recap episode, when she turned 23. ===Call-out order=== Tyra's call-out order Order Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Episodes Order 1 2 3 4 5 6 7 8 9 10 11 13 1 Anamaria Ann Ann Ann Ann Ann Liz Chris Kayla Kayla Ann Ann 2 Kendal Kayla Kayla Kacey Chris Jane Kayla Jane Jane Chelsey Chelsey Chelsey 3 Rhianna Chelsey Chelsey Esther Chelsey Kendal Ann Chelsey Chelsey Ann Jane 4 Chris Kendal Chris Chris Kayla Esther Chelsey Kayla Ann Jane Kayla 5 Jane Lexie Rhianna Kendal Liz Chris Chris Liz Chris Chris 6 Chelsey Liz Liz Lexie Esther Chelsey Jane Ann Liz 7 Liz Jane Jane Kayla Kacey Liz Esther Esther 8 Sara Esther Kacey Jane Kendal Kayla Kendal 9 Lexie Chris Kendal Chelsey Jane _Kacey_ 10 Esther Rhianna Esther Liz Lexie 11 Kacey Kacey Lexie Rhianna 12 Kayla Sara Sara 13 Ann Terra Terra 14 Terra Anamaria The contestant was eliminated outside from judging panel The contestant won the reward challenge The contestant won the reward challenge but was eliminated The contestant was eliminated *In episode 1, the pool of 21 girls was reduced to 14 who moved on to the main competition. However, this first call-out does not reflect their performance that first week. *In episode 3, Terra was eliminated after makeovers, and was therefore not present at panel for judging. *Episode 12 was the recap episode. ===Photo shoot guide=== * Episode 1 photo shoot: Paired up wearing Cynthia Rowley designs (casting) * Episode 2 photo shoot: Teen bullying * Episode 3 photo shoot: Fallen angels * Episode 4 photo shoot: Underwater beauty shots * Episode 5 photo shoot: Lucha Va Voom * Episode 6 photo shoot: Walking down Rodeo Drive * Episode 7 photo shoot: Portraying iconic fashion designers * Episode 8 commercial: H2T water on roller skates * Episode 9 photo shoot: Gondola group shoot with a cassanova * Episode 10 photo shoot: Marble statues coming to life * Episode 11 motion editorial: Modelli folli (\"model madness\") * Episode 13 photo shoot and commercial: CoverGirl Lash Blast Fusion print ad and commercial & beauty In Vogue spread ==References== Category:America's Next Top Model",
 "title": "America's Next Top Model, Cycle 15"
}