{
 "id": "371521",
 "text": "Mia Wasikowska (born 14 October 1989) is an Australian movie, television, and voice actress who is mostly known for her role as Alice in Tim Burton's Alice in Wonderland. She is also known for her television role as Sophie in In Treatment. == Early life == Wasikowska was born and raised in Canberra, Australia. She has an older sister named Jess, and a younger brother named Kai. Her mother, Marzena Wasikowska, is a photographer from Poland while her father, John Reid, is an Australian painter-and-collagist. As a child, she frequently accompanied her parents on their gallery rounds in Europe, and in her spare time, she continues to enjoy photography. She studied ballet as a child and turned to acting when she was 15. == Career == After some television and movie works in Australia, Wasikowska moved to Los Angeles to be in the cable drama In Treatment.Biography Her portrayal of a suicidal teen earned critical praise and led to more work in American movies, including Defiance and Amelia. In Tim Burton's Alice, Wasikowska co-starred with Johnny Depp, Anne Hathaway, Helena Bonham Carter and carried a blockbuster movie, appearing in almost every scene. She won an AFI International Award, a Teen Choice Award and nominated an Empire Award for her performance. In 2009, it was announced that Wasikowska was cast in the Lisa Cholodenko-directed indie comedy film The Kids Are All Right alongside Annette Bening, Julianne Moore, Josh Hutcherson and Mark Ruffalo. Film received positive reviews from critics, and Wasikowska received Hollywood Film Festival Breakthrough Actress Award for her role. From March to May 2010, Wasikowska filmed Cary Fukunaga's adaptation of Jane Eyre, in which she starred as the title character opposite Michael Fassbender as Mr. Rochester. In 2011, Wasikowska shot the small supporting role of Shia LaBeouf's character's love interest in John Hillcoat's Lawless. Then she filmed the lead in Park Chan-wook's English-language debut movie, Stoker, alongside Nicole Kidman and Matthew Goode. In 2014, she starred in David Cronenberg movie titled Maps to the Stars with Julianne Moore, John Cusack, Robert Pattinson, Olivia Williams, and Sarah Gadon which premiered in competition for the Palme d'Or at the 2014 Cannes Film Festival. In November 2013, it was announced that Wasikowska was cast in Alice Through the Looking Glass, the 2016 sequel to Alice in Wonderland. == Personal life == Wasikowska lives in Bronte, New South Wales. In 2013, she began dating her The Double co- star Jesse Eisenberg. The two split in 2015. == Filmography == ===Film=== Year Film Role Notes 2006 Suburban Mayhem Lilya Nominated – AFI Award for Young Actor's Award 2007 Rogue Sherry 2008 I Love Sarah Jane Sarah Jane Short film 2008 Defiance Chaya 2009 That Evening Sun Pamela Choat Nominated – Independent Spirit Award for Best Supporting Female 2009 Amelia Elinor Smith 2010 Alice in Wonderland Alice Won – AFI International Award for Best Actress Won – Teen Choice Award for Choice Movie: Fight Nominated – Teen Choice Award for Choice Movie Actress: Sci-Fi/Fantasy Nominated – Teen Choice Award for Choice Movie: Breakout Female Nominated – Empire Award for Best Newcomer 2010 The Kids Are All Right Joni Nominated – AFI International Award for Best Actress Won – Hollywood Film Festival Award for Hollywood Breakthrough Award - Actress of the Year Nominated – Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2011 Jane Eyre Jane Eyre Nominated – British Independent Film Award for Best Actress Nominated – AACTA International Award for Best Actress 2011 Restless Annabel CottonEntertainment Weekly - Mia Wasikowska cast in Gus Van Sant's 'Restless' 2011 Albert Nobbs Helen Dawes Won – EDA Award for Most Egregious Age Difference Between the Leading Man and the Love Interest (shared with Glenn Close) 2012 Lawless Bertha Minnix 2013 Stoker India Stoker Nominated – Fangoria Chainsaw Award for Best Actress Nominated – Empire Award for Best Supporting Actress Nominated – Saturn Award for Best Actress Nominated – CinEuphoria Award for Best Actress - International Competition Nominated – Fright Meter Award for Best Actress Nominated – Jupiter Award for Best International Actress 2013 Only Lovers Left Alive Ava Nominated – Fangoria Chainsaw Award for Best Supporting Actress Nominated – INOCA Award for Best Supporting Actress 2013 Tracks Robyn Davidson Nominated – AACTA Award for Best Actress Nominated – Gotham Award for Best Actress Nominated – SDFCS Award for Best Actress Nominated – DFCC Award for Best Actress 2013 The Double Hannah Nominated – British Independent Film Award for Best Supporting Actress 2014 Maps to the Stars Agatha Weiss Nominated – Canadian Screen Award for Best Supporting Actress Madame Bovary Emma Bovary 2015 Crimson Peak Edith Cushing Nominated – Fangoria Chainsaw Award for Best Actress Nominated – Saturn Award for Best Actress 2016 Alice Through the Looking Glass Alice ===Television=== Year Title Role Notes 2004-05 All Saints Lily Watson 2 episodes 2008 In Treatment Sophie 9 episodes Nominated – AFI International Award for Best Actress ==References== ==Other websites== * * Category:1989 births Category:Living people Category:Australian movie actors Category:Australian television actors Category:Australian voice actors Category:People from Canberra",
 "title": "Mia Wasikowska"
}