{
 "id": "371607",
 "text": "Rita Sahatçiu Ora (born 26 November 1990) is a British singer-songwriter and actress. == Career == === Acting === In 2004, Ora appeared in the British movie Spivs. Ora played Mia Grey in the 2015 movie Fifty Shades of Grey.http://news.sky.com/story/1177134/fifty-shades-of-grey-role-for-singer- rita-ora In 2019, she will appeared in the movie Pokémon: Detective Pikachu. === Music === In 2009, she auditioned for Eurovision: Your Country Needs You on BBC One to be the British contestant for the 2009 Eurovision Song Contest. She later quit the competition. The same year, Ora made a cameo on Jay-Z's video for \"Young Forever\" and \"Over\" by Drake. Ora caught the attention of Jay-Z and he signed her to Roc Nation, for which she was featured in a commercial for Roc Nation + Skullcandy Aviator Headphones. Her first album Ora was released in August 2012 and entered the charts at number one in the UK and number two in Ireland. Four singles have been released which appear on the album. \"Hot Right Now\" featured Rita Ora's vocals and entered at number one in the UK in March 2012. Rita was the lead artist on \"R.I.P\" and \"How We Do (Party)\", which also entered the UK charts at number one. Her single \"I Will Never Let You Down\" also reached number one in 2014. So far in the UK she became the first artist to appear on four top 10 singles in 2012. === Television === In 2012, Rita Ora was a guest judge on The X Factor. She returned to the show in 2016 as a permanent judge for that year's season. She has also been one of the four celebrity panellists on the UK version of Masked Singer. She was also a coach on The Voice. Ora was also an interval act in the first semi-final of the Eurovision Song Contest 2023. == Personal life == Rita Ora was born in 1990 in Pristina, Kosovo to Albanian parents and moved to London in the same year. In 2012, Ora dated Rob Kardashian. From 2013 to 2014, Ora dated Calvin Harris. The artist is currently married to Taika Waititi. == Discography == ;Albums *Ora (2012) *Phoenix (2018) *You & I (2023) ;Singles: As featured artist *Hot Right Now (2012) *Black Widow (2014) As main artist *R.I.P. (2012) *How We Do (Party) (2012) *Shine Ya Light (2012) *Radioactive (2013) *I Will Never Let You Down (2014) *Poison (2015) *Body on Me (2015) *Champagne Lights (2020) *Seaside (2021) *Follow Me (2021) ==References== Category:1990 births Category:Living people Category:English singer- songwriters Category:Singers from London Category:English R&B; singers Category:English pop singers Category:English dance musicians Category:Atlantic Records artists Category:People from Pristina Category:Models from Kosovo",
 "title": "Rita Ora"
}