{
 "id": "371644",
 "text": "Gregory Jennings, Jr. (born September 21, 1983 in Kalamazoo, Michigan) is a wide receiver. He plays for the Green Bay Packers of the NFL. He played college football at Western Michigan University. He was drafted in the second round of the 2006 NFL Draft. ==High School Career== Jennings played three sports in high school, football, basketball, and track. He played many football positions, including wide receiver, running back, linebacker and defensive back.Greg Jennings Profile at Greg Jennings official website (retrieved December 7, 2010). ==College career== Greg Jennings decided to go to Western Michigan University. He finished his career there with 238 receptions for 3539 yards and 39 touchdowns. In his second year, he broke an ankle bone, and had to miss eight games.Green Bay Packers bio for Greg Jennings (accessed December 7, 2010). He graduated from the college in 2010. ==NFL career== Jennings declared for the NFL Draft in 2006. He was chosen by the Packers with the 52nd pick in the 2006 NFL Draft. In his fourth game, Jennings caught Brett Favre's 400th touchdown pass. He was voted Rookie of the Week that week. Jennings finished the season with 45 catches for 632 yards and 3 touchdowns. His next season was better, with twelve touchdowns and 932 yards. After his first thousand yard season in 2009, Jennings got a 26.35 million dollar contract.Sources: Jennings close to extension ESPN, June 23, 2009 In 2010 and 2011, Jennings made the Pro Bowl. He also played in the Super Bowl in 2010, where he had two touchdowns in a Packers victory. He had to miss most of the 2011 and 2012 seasons with injuries. ===Career statistics=== Season Team GS Rec Yds Avg Long TDs 2006 Green Bay Packers 14 45 632 14.0 75 3 2007 Green Bay Packers 13 53 920 17.4 82 12 2008 Green Bay Packers 16 80 1,292 16.2 63 9 2009 Green Bay Packers 16 68 1,113 16.4 83 4 2010 Green Bay Packers 16 76 1,265 16.6 86 12 2011 Green Bay Packers 13 67 949 14.2 79 9 Total 88 389 6,171 15.9 86 49 ==References== Category:Green Bay Packers players Category:1983 births Category:Living people Category:Sportspeople from Michigan Category:People from Kalamazoo, Michigan",
 "title": "Greg Jennings"
}