{
 "id": "371787",
 "text": "The Magomayev Azerbaijan State Philharmonic Hall (Azeri: Maqomayev adına Azərbaycan Dövlət Filarmoniyası) is the main concert hall for classical music and folk music in the capital of Azerbaijan, Baku. ==History== The Azerbaijan State Philharmonic Hall was built between the years 1910–1912 at the request of the city elite and is designed in the Italian Renaissance (outside) and German Rococo (inside) architectural styles. Its design was influenced by the architectural style of the buildings of the Monte-Carlo Casino, particularly the Opéra de Monte-Carlo. The Principal City of the Province by Manaf Suleymanov. The Past Days. 1990. The building was originally organized as a club for the wealthy of Baku, who attended it for banquets and entertainment. During the Russian Civil War it was a place for public rallies. In 1936, the club was officially reorganized into a residence for the philharmonic society aimed at promoting Azerbaijani classical and folk music. On 11 August 1937 after the building was renovated, it was named after the Azerbaijani composer Muslim Magomayev.The Magomayev Azerbaijan State Philharmonic Hall . Official Website. In 1995, the hall was closed down for more than 8 years for another renovation. It was not until November 2002 that the restoration works finally started due to President Heydar Aliyev's special decree. The opening of the fully renovated building happened on 27 January 2004. ==Building== The main building has two halls: The Summer Hall with 1100 seats and the Winter Hall with 610 seats, which are joined by a single stage. The Azerbaijan State Philharmonic Hall is home to 7 performing groups: * The Azerbaijan State Symphony Orchestra * The Azerbaijan State Choir Capella * The Azerbaijan State Chamber Orchestra * The Azerbaijan State Piano Trio * The Azerbaijan State String Quartet * The Azerbaijan State Folk Song and Dance Ensemble * The Azerbaijan State Orchestra of Folk Instruments ==Related pages== * Concert hall * Concert ==References== ==Other websites== * Azerbaijan State Academic Opera and Ballet Theater Official Website * The Ali and Nino Walking Tour: Philharmonic Hall by Betty Blair and Fuad Akhundov. Azerbaijan International Magazine. #12.2. Summer 2004 Category:Concert halls Category:Buildings and structures in Baku Category:Entertainment venues in Azerbaijan Category:1912 establishments Category:1910s establishments in Azerbaijan",
 "title": "Azerbaijan State Philharmonic Hall"
}