{
 "id": "371784",
 "text": "Jean-Charles Darmon is a French literary critic born in 1961. == Biography == Graduate in 1982 from the École Normale Supérieure, he first teaches at Amherst College (USA). Teacher of French literature at the Université de Versailles Saint-Quentin-en-Yvelines,Jean-Charles Darmon Honorary Member of the Institut Universitaire de France (2001-2006), he was head of the École Normale SupérieureLa lettre de l’École normale supérieure, no 92, mars 2007. from 2005 to 2009. Specialized in connections between literature, philosophy and ethics in the classical age, he is the author of books on libertarianism scholar and Epicureanism, the forms of the fable or satire, from an interdisciplinary perspective.Jean-Charles DARMON Pierre Ronzeaud, Revue d’Histoire littéraire de la France, 2002/1, vol. 102, p. 158–159. == Further reading== * (Epicurean philosophy and literature in seventeenth-century France. Studies on Gassendi, Cyrano, La Fontaine, Saint-Evremond), Paris, PUF, « Perspectives littéraires », 1998. * Cyrano de Bergerac, Lettres satiriques et amoureuses, précédées de Lettres diverses (édition) (Cyrano de Bergerac, satirical and love letters, preceded by various letters (edit)), Paris, Desjonquères, « Dix-septième siècle », 1999. * La Fontaine, Fables (édition) (La Fontaine, Fables (edit)), Paris, LGF, 2002. * Philosophies de la Fable. La Fontaine et la crise du lyrisme (Philosophies of Fable. La Fountaine and the crisis of lyricism), Paris, PUF, « Écritures », 2003. * Le Songe libertin. Cyrano de Bergerac d’un monde à l’autre (The Dream libertine. Cyrano de Bergerac from one world to another), Paris, Klincksieck, « Bibliothèque française et romane », 2004. * L’athée, la politique et la mort. Essai suivi d’une édition critique de La Mort d’Agrippine de Cyrano de Bergerac (The atheist, politics and death. Test followed by a critical edition of The Death of Agrippina from Cyrano de Bergerac), Fougères, Encre Marine, « La Bibliothèque hédoniste », 2005. * Histoire de la France littéraire, tome 2. Classicismes xviie – xviiie siècle (Literary history of France, Volume 2. Classicisms seventeenth - eighteenth century), Paris, PUF, « Quadrige », 2006. * Le moraliste, la politique et l’histoire. De La Rochefoucauld à Derrida (The moralist, politics and history. From De La Rochefoucauld to Derrida), Desjonquères, « L’Esprit des lettres », 2007. * Variations épicuriennes : une philosophie et ses marges, entre science, morale et politique. Études sur Montaigne, Gassendi, Cyrano de Bergerac, Bernier, Saint-Evremond (Epicurean variations: a philosophy and margins between science, ethics and politics. Studies of Montaigne, Gassendi, Cyrano de Bergerac, Bernier, Saint-Evremond), Paris, Honoré Champion, « Lumière classique », 2008. * Pensée morale et genres littéraires (Moral thought and literary genres), with Philippe Desan, Paris, PUF, 2009. * Philosophie du divertissement. Le jardin imparfait des Modernes (Philosophy entertainment. Modern garden imperfect), Paris, Desjonquères, « Le bon sens », 2009. * « Philosophies de la Fable. Poésie et pensée dans l’œuvre de La Fontaine » (\"Philosophies of Fable. Poetry and thought in the work of La Fontaine \"), Paris, Éditions Hermann, coll. « Savoir Lettres », 2011. ==References== Category:1961 births Category:Versailles Saint-Quentin-en- Yvelines University faculty Category:French literary critics Category:Living people",
 "title": "Jean-Charles Darmon"
}