{
 "id": "371986",
 "text": "This is a list of many of the different language editions of Wikipedia; as of , Wikipedia articles have been created in editions, with currently active and closed. For their number of articles, see the main list. == Wikipedia edition codes == Each Wikipedia has a code, which is used as a subdomain below wikipedia.org. Interlanguage links are sorted by that code. The codes represent the language codes defined by ISO 639-1 and ISO 639-3, and the decision of which language code to use is usually determined by the Internet Engineering Task Force language tag policy. One code is not a language code ('be-x-old') but refers to a specific orthography. Some deviations include: WP code WP edition name ISO 639 code for this language Notes sq Albanian 'sq' is the ISO code for the Albanian macrolanguage, which includes four individual languages. als Alemannic 'gsw' for Swiss German, Alemannic German, and Alsatian; 'gct' for Colonia Tovar dialect; 'swg' for Swabian German, and 'wae' for Walser German 'als' is actually the ISO code for Tosk Albanian. roa-rup Aromanian rup 'roa' is the ISO code for Romance (Other). map-bms Banyumasan 'map' is the ISO code for Austronesian (Other). nds-nl Dutch Low Saxon The Low Saxon dialects in the Netherlands have their own ISO codes. In ISO, nds is 'Low Saxon', restricted to Germany in Ethnologue. bh Bihari ISO collective code 'bih' is a macrolanguage which includes Bhojpuri (bho), Maithili (mai), Magahi (mag) and nine others. Bihari Wikipedia excludes Maithili (mai) and Fiji Hindi (hif) which exist as independent Wikipedias. zh-yue Cantonese yue zh-classical Classical Chinese lzh ms Malay ISO collective code 'ms' is a macrolanguage that includes more than 30 individual languages and dialects. However, the wiki excludes Indonesian because Indonesian Wikipedia (id) exists independently. mni Manipuri zh-min-nan Min Nan nan no Norwegian Bokmål nb, nob ISO uses no for Norwegian in general. (Norwegian Nynorsk is at 'nn' in both ISO and Wikipedia.) ksh Ripuarian none ISO ksh is for the Kölsch language, the most prominent dialect of the Ripuarian language group. The other variants (e.g. the Aachen dialect) do not have ISO codes. bat-smg Samogitian sgs 'bat' is the ISO code for Baltic (Other). simple Simple English none roa-tara Tarantino none 'roa' is the ISO code for Romance (Other). fiu-vro Võro vro cbk-zam Zamboanga Chavacano none ISO cbk is for the Chavacano language. The individual variants do not have ISO codes. == Wikipedia editions == === Active editions === The table below lists the active language editions of Wikipedia roughly sorted by the number of articles (excluding redirects and non-article pages). === Inactive editions === The table below lists the inactive language editions of Wikipedia. === Special editions === The table below lists the special editions of Wikipedia. The Nostalgia Wikipedia is an archive of the English Wikipedia's initial display. == Bot-created articles == Internet bots have created most of the articles on the following Wikipedias: * Cebuano Wikipedia * Dutch Wikipedia * Swedish Wikipedia * Waray Wikipedia == See also == * * * * == Notes == == References == == Other websites == * Wikipedia:List of Wikipedias * Wikipedia portal * * * * *",
 "title": "List of Wikipedias"
}