{
 "id": "37230",
 "text": "The Students for a Democratic Society (SDS) was a student activist movement in the United States in the 1960s (1960 to 1969). A new SDS group was also begun in 2006. ==History 1960-1969== SDS held its first meeting in 1960 at Ann Arbor, Michigan. They had their first convention in 1962, and criticized the political system of the United States for not bringing international peace or fixing problems in society at home. It also called for non-violent civil disobedience so that student youth could bring forth a \"participatory democracy.\" In the school year 1962-1963, the President of SDS was Tom Hayden, who later became famous. There were nine chapters around the country with at most, about 1000 members. The national office (NO) in New York City had only a few desks, some broken chairs, a couple of filing cabinets, and a few typewriters. On October 1, 1964, the University of California, Berkeley exploded into the free speech movement. Led by a Friends of SNCC student activist named Mario Savio, more than three thousand students surrounded a police car where a student, arrested for setting up a card table against a ban by the university, was being taken away. The sit-down stopped the police car from moving for 36 hours. The demonstrations, meetings and strikes all but shut the university down. Hundreds of students were arrested. SDS leaders watched and learned from this lesson. In February 1965, US President Lyndon Johnson made the war in Vietnam much bigger by bombing North Vietnam and putting ground troops right into fighting against the Viet Cong in the South. The draft became a very real issue in the lives of students in America. Campus chapters of SDS all over the country started to lead small, local demonstrations against the war and the NO became the main group that organized the March against the war in Washington DC on April 17. The first teach-in against the war was held in the University of Michigan. Soon hundreds more, all over the country, were held. The demonstration in Washington, DC attracted about 25,000 anti-war protesters and SDS became the leading student group against the war on most U.S. campuses. The 1965 summer convention was held at Kewadin, Northern Michigan. and the National Office, moved from Manhattan to Chicago at about the same time. This brought more changes. > \"For the first time at an SDS meeting people smoked marijuana; Pancho Villa > mustaches... blue workshirts, denim jackets, and boots were worn by both men > and women. These were people generally raised outside of the East, many from > the Midwest and SouthwestSale, Kirkpatrick. SDS: Ten Years Towards a > Revolution. New York: Vintage Books, 1974. Mass market paperback, 752 pages, > (this ISBN sometimes leads to another book). It is available online The Winter and Spring of 1967 saw more militancy of the protests at many campuses. Harassment by the authorities was also on the rise. The hippie movement really began to take hold. The 1967 convention spoke on the draft and resisting within the Army itself, and made a call for immediate withdrawal from Vietnam. Also, a women's liberation vote was passed for the first time. That Fall saw more anti-war actions. The school year started with a large demonstration against the University of Wisconsin in Madison, Wisconsin on October 17 for letting Dow recruiters on campus. Peaceful at first, the demonstrations turned to a sit-in that was violently broken up by the Madison police and riot squad, causing many injuries and arrests. A rally and a student strike then closed the university for several days. Demonstrations against the draft led by members of the Resistance, the War Resisters League, and SDS added fuel to the fire of resistance. After regular civil rights tactics of peaceful pickets, the Oakland California Stop the Draft Week ended in mass hit and run fights with the police. The huge (100,000 people) October 21 March on the Pentagon saw hundreds arrested and hurt. Night-time raids on draft offices began to spread. In the spring of 1968, National SDS activists led an effort on the campuses called \"Ten Days of Resistance\" and local chapters held rallies, marches, sit-ins and teach-ins, ending in a one-day strike on April 26. About a million students stayed away from classes that day, the largest ever student strike in the history of the United States. It was mostly ignored by the New York City-based national media, which was more focused on the student shutdown of Columbia University in NYC, led by an inter-racial alliance of Columbia SDS chapter activists and Student Afro Society activists. Because of the Columbia Student Revolt, \"SDS\" became a household name in the United States for a few years; and membership in SDS chapters around the United States grew greatly during the 1968-69 school year. In the summer of 1969, the ninth SDS national convention was held at the Chicago Coliseum with some 2000 people attending. Many groups of the movement were there, even Communists, and set up their tables all around the edges of the hall, together with undercover spies, creating an air of excitement. Each of the delegates was given a paper saying \"You don't need a Weatherman to know which way the wind blows\" (a lyric from a Bob Dylan song, \"Subterranean Homesick Blues\"). This was written by a group who later became called the Weathermen and were involved in more violent protests. They took over by voting out another large group, the convention quickly fell apart, and so did SDS. == 2006: The New SDS == Beginning January 2006, there is a movement to start a new SDS. A small group of old SDS members joined with a Connecticut high school student to call for a new SDS fighting for civil rights and against war. Several chapters at various colleges were later started. On Martin Luther King Day of 2006, these chapters called for the first national convention since 1969 to be held in the summer of 2006 . Lately SDS has been in actions against war. The Pace University chapter of SDS protested against a speech by Bill Clinton held at the campus, causing the university to hand over two students to the United States Secret Service. When the school was going to kick these two students out of school, Pace SDS began a movement in March 2006 protesting the university's actions. On March 19 2006, SDS marched in New York City against the war in Iraq. Seventeen people were arrested at the Times Square Recruitment Center, including several SDS members. Beginning in March and continuing into April and May, SDS chapters across the country participated in the Immigrant Rights Movement. On April 29 2006 SDS was in the march for Peace, Justice and Democracy in Manhattan, NY. As of July 2006, there are 150 SDS chapters around the country and over 1000 members. The newly formed SDS held its first national convention from August 4 to August 7, 2006 at the University of Chicago. == Further reading == * Students for a Democratic Society (S.D.S.), Records, 1965-74. May 4 Collection—Box 107. Kent State University Libraries and Media Services. Department of Special Collections and Archives. Online guide retrieved April 12, 2005. * Students for a Democratic Society Period : 1962-1970. Period : 1962-1970. Total Size : 0.5 m. International Institute of Social History. Online guide retrieved April 12, 2005 . ===Articles=== * Alper, Mark. The Legacy of S.D.S. and Its Relevance to Today's Activists . Electronic Worker. Direct Action Tendency, Socialist Party USA. Retrieved April 12, 2005. * Bookchin, Murray. Anarchy and Organization: A Letter To The Left. Reprinted from New Left Notes. January 15, 1969. Retrieved April 12, 2005. \"The essay originally was written in reply to an attack by Huey Newton on anarchist forms of organization.\" ==== \"New SDS\" ==== * Knight, Alexander. The Rebirth of Students for a Democratic Society (SDS). Monthly Review: MRZine. August 9, 2006. === Books and references=== * Adelson, Alan. SDS. New York, Charles Scribener's Sons, 1972. () * Heath, G. Louis, ed. Vandals in the Bomb Factory: The History and Literature of the Students for a Democratic Society. Metuchin, N.J.: Scarecrow Press, 1976. * Halstead, Fred. Out Now!: A Participant's Account of the Movement in the United States Against the Vietnam War. 759 pages. Hardcover edition. Publisher: Anchor Foundation; Reprint edition. June 1, 1978. . * Klatch, Rebecca E.. A Generation Divided: The New Left, the New Right, and the 1960s. Berkeley : University of California Press, 1999. === SDS Publications === * Davidson, Carl. Toward a Student Syndicalist Movement or University Reform Revisited. Chicago: Students for a Democratic Society. ca. 1967. Mimeographed. 7 p. * Gilbert, David and David Loud. U. S. Imperialism. Chicago: Students for a Democratic Society, 1968. Wraps. 33 p. * Haber, Al and Dick Flacks. Peace, Power and the University: Prepared for Students for a Democratic Society and the Peace Research and Education Project.Ann Arbor: Peace Research and Education Project, 1963. Mimeographed. 12 p.. * James, Mike. Getting Ready for the Firing Line: Join Community Union. Chicago: Students for a Democratic Society, March 1968. Stapled softcover. 8p. Photos by Nancy Hollander, Tom Malear of the Chicago Film Coop, Todd Gitlin & Les Jordan, SCEF. Reprinted from \"The Activist,\" Spring 1967. Introduction for this pamphlet by Mike James. * Lemisch, Jessie. Towards a Democratic History. Ann Arbor & Chicago: Radical Education Project/Students for a Democratic Society, (1967). Radical Education Project Occasional Paper. 8 p. * Lynd, Staughton. The New Radicals and \"Participatory Democracy\". Chicago: Students for a Democratic Society, 1965. 10 p. * Oglesby, Carl. The Speech Given by Carl Oglesby, President, Students for a Democratic Society, at the Nov. 27, 1965 March on Washington to End the War in Vietnam. Chicago: Students for a Democratic Society, ca. 1965. 8 1/2 x 11 in. Mimeographed. 8 p. * Olinick, Michael. The Campus Press. Distributed by Students for a Democratic Society for the Liberal Study Group, National Student Association, 1962. 13 p. * Oppenheimer, Martin. Alienation or Participation: The Sociology of Participatory Democracy. n.p.: Students of a Democratic Society (S.D.S.), 1966. 7 pages. 1st edition. Stapled booklet. * Students For A Democratic Society [S.D.S.]. Fight Racism! Boston: Students for a Democratic Society, n.d. [1969]. 28pp. 1st edition. Stapled softcover. * Students for a Democratic Society. New Left Notes. Chicago. [?] Vol. 1 # 1 1965 [?] - Vol. 4 # 31 October 2, 1969. * Students for a Democratic Society [Progressive Labor]. SDS New Left Notes, Vol. 5, No. 15, July 6, 1970 - [?]. Boston, 1970. === U.S. Government Publications === * U.S. House of Representatives. Investigation of Students for a Democratic Society, Part 2 (Kent State University): Hearings Before the Committee on Internal Security, House of Representatives; 91st Congress, 2nd Session, June 24 and 25, 1969. Washington: U.S. Government Printing Office, 1969. * U.S. House of Representatives. Investigation of Students for a Democratic Society, Part 3-A (George Washington University); Hearings Before the Committee on Internal Security, House of Representatives; 91st Congress, 2nd Session, July 22, 1969. Washington: U.S. Government Printing Office, 1969. * U.S. House of Representatives. Student Views Toward U.S. Policy in Southeast Asia; Hearings Before an Ad Hoc Committee of Members of the House of Representatives; 91st Congress, 2nd Session, July 22, 1969. Washington: U.S. Government Printng Office, 1969. * U.S. president. Commission on Campus Unrest. Report. This publication is often referred to as the Scranton Report, issued in 1970. == Other websites == * SDS Historical Documents and other links * \"Shut It Down!\" Includes Port Huron Statement, \"SDS: The Last Hurrah\" (an account of Chicago 1969 written by an undercover federal agent), and the Revolutionary Youth Movement mission statement. * University of Washington Libraries Digital Collections - Vietnam Era Ephemera This collection contains leaflets and newspapers that were distributed on the University of Washington campus during the decades of the 1960s and 1970s. They reflect the social environment and political activities of the youth movement in Seattle during that period. ===\"New SDS\"=== * National SDS home page * \"The Organizer\" - National SDS Blog * National SDS Web Forum * List of SDS Chapters (US) * Pace SDS home page * University of Central Florida SDS home page * University of Arizona Tucson SDS home page Category:1960s in the United States Category:American culture Category:1960 establishments in the United States Category:Student organizations Category:Political movements Category:Political organizations based in the United States",
 "title": "Students for a Democratic Society"
}