{
 "id": "372829",
 "text": "is a Japanese language term used in countries in North America and South America to name the children born to Japanese people who immigrated. The emigrants or immigrants who were born in Japan are called Issei; and their children born in the new country are called Nisei (second generation). The grandchildren of Issei are called Sansei (third generation).The generation names come from the numbers \"one, two, three\" in the Japanese language. The first three Japanese numbers are \"ichi, ni, san. The fourth number is \"yon\". The character and uniqueness of the Nisei is recognized in its social history.Numrich, Paul David. (2008). North American Buddhists in Social Context, p. 110. ==History== The earliest organized group of Japanese emigrants settled in Mexico in 1897.Ministry of Foreign Affairs (MOFA), Japan- Mexico Foreign Relations; retrieved 2012-11-25. Imigration to Brazil began in 1908. Today, the community which grew from the Nisei children has become the largest Japanese emigrant population outside of Japan, including approximately 1.5 million Brazilians.MOFA, \"Japan-Brazil Relations\"; retrieved 2012-11-25. Other communities of Nisei grew up in the United States,Sakata, Yasuo. (1992). Fading Footsteps of the Issei, p. 1. Canada,McLellan, Janet. (1999). Many Petals of the Lotus: Five Asian Buddhist Communities in Toronto, p. 36. and Peru.\"Fujimori Secures Japanese Haven,\" BBCNews, 12 December 2000; retrieved 2012-11-25. The use of the term Nisei was modeled after an Issei pattern or template. In the 1930s, the term Issei came into common use. The word replaced the term \"immigrant\" (ijusha). This change in usage mirrored an evolution in the way the Issei looked at themselves. The label Issei also included the idea of belonging to the new country. == Cultural profile == The term Nikkei (日系) was created by sociologists in the late 20th century. The Nikkei include all of the world's Japanese immigrants and their descendants.Japanese American National Museum, \"What is Nikkei?\" ; retrieved 2012-11-25. The Issei were born in Japan, and their cultural perspective was primarily Japanese; but they were in America by choice.Smithsonian, \"The Art of Gaman: Arts and Crafts from the Japanese American Internment Camps, 1942 - 1946\", Yoshitsuchi Ikemoto ; excerpt, \"... one of hundreds of Issei (first-generation) 'bachelor' laborers who were unable to send for their wives or a picture bride because the U.S. government cut off all immigration from Japan in 1924\"; retrieved 2012-11-25. Their Nisei sons and daughters grew up with a national and cultural point-of- view that was different from their parents. Although the Issei kept an emotional connection with Japan, they created homes in a country far from Japan.Yenne, Bill. (2007). Rising Sons: The Japanese American GIs Who Fought for the United States in World War II, p. xv. The Nisei had never known a country other than the one into which they were born. Generation Cohort description Issei (一世) The generation of people born in Japan who immigrated to another country.\"Issei\" Densho Encyclopedia; retrieved 2012-11-25. Nisei (二世) The generation of people born in North America, Latin America, Australia, Hawaii, or any country outside of Japan either to at least one Issei parent. Sansei (三世) The generation of people born to at least one Nisei parent. Yonsei (四世) The generation of people born to at least one Sansei parent Gosei (五世) The generation of people born to at least one Yonsei parentIkezoe-Halevi, Jean. \"Voices of Chicago: Day of Remembrance 2006,\" Discover Nikkei (US). October 31, 2006; retrieved 2012-11-25. The Issei, Nisei and Sansei generations reflect distinctly different attitudes to authority, gender, non- Japanese involvement, and religious practice, and other matters.McLellan, p. 59. == Select list of notable Nisei == :This list is not finished; you can help Wikipedia by adding to it. * Alberto Fujimori (1938- ), Peruvian politician, 1990-2000DiscoverNikkei: Fujimori bio ; retrieved 2011-05-17 * Luiz Gushiken(1950- ), Brazilian politician and activistFerreira, Lenilson. \"Son of conservative Japanese a star in Brazil's new leftist administration,\" Japan Times. December 24, 2002; retrieved 2012-12-3. * Barney Hajiro (1916–2011), US Medal of Honor recipient in World War IIGomez-Granger, Julissa. (2008). Medal of Honor Recipients: 1979-2008, \"Hajiro, Barney F.,\" p. 8-9 [PDF 12-13 of 44]; retrieved 2012-11-25. * Mikio Hasemoto (1916–1943), US Medal of Honor recipient in World War IIGomez-Granger, CRS RL30011, p. 9 [PDF 13 of 44]; retrieved 2012-11-25. * Joe Hayashi (1920–1945), US Medal of Honor recipient in World War IIGomez-Granger, \"Hayashi, Joe,\" pp. 9-10 [PDF 13 of 44]; retrieved 2012-11-25. * Shizuya Hayashi (1917–2008), US Medal of Honor recipient in World War IIGomez-Granger, \"Hayashi, Shizuya,\" p. 10 [PDF 14 of 44]; retrieved 2012-11-25. * William Hohri (1927–2010), American political activistJapanese American National Museum (JANM): William Honri bio ; Martin, Douglas. \"William Hohri Dies at 83; Sought Money for Internees,\" New York Times (US). November 24, 2010;retrieved 2011-05-17 * Daniel Inouye (1924-2012), US Medal of Honor recipient World War II and US Senator from HawaiiGomez-Granger, \"Inouye, Daniel K.\" pp. 10-11 [PDF 14-15 of 44]; HomeofHeroes.com, \"Inouye, Daniel K.\"; Cillizza, Chris. \"Hawaii Sen. Daniel Inouye dies at age 88,\" Washington Post. December 17, 2012; retrieved 2012-12-17. * Carlos Kasuga, Mexican businessmanHokama, Ricardo G. \"Carlos Kasuga: 'Everything That You Do, Do It well',\" DiscoverNikkei. 23 April 2009; retrieved 2012-11-25. * Yeiki Kobashigawa (1920–2005), US Medal of Honor recipient in World War IIGomez-Granger, \"Kobashigawa, Yeiki,\" p. 12 [PDF 16 of 44]; retrieved 2012-11-26. * Yuri Kochiyama (1921 - ), American civil rights activistDiscoverNikkei: Kochiyama bio * Ford Konno (1933 - ), US Olympic athlete (1952, 1956), swimmer * Tommy Kono (1930 - ), US Olympic athlete (1952, 1956, 1960), weightlifter * Robert Kuroda (1922–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Kuroda, Robert T.,\" pp. 12-13 [PDF 16-17 of 44]; retrieved 2012-11-26. * Ben Kuroki (1917–2015), US Army Air Force airmanYenne, Bill. (2007). Rising Sons: The Japanese American GIs Who Fought for the United States in World War II, pp. 1376-141; Kuroki is the only Japanese-American known to have participated in air combat missions in the Pacific during WWII * Mike Masaoka (1915–1991), American leader of the Japanese American Citizens League (JACL)University of Utah, Mike M. Masaoka Photograph Collection, bio * Spark Matsunaga (1916–1990), US Senator from HawaiiDiscoverNikkei: Matsunaga bio ; retrieved 2011-05-17 * Hiroshi Miyamura (1925 - ), US Medal of Honor recipient in Korean WarUS Army Center of Military History, \"Medal of Honor Recipients, Korean War\" ; retrieved 2012-12-13. * Norman Mineta (1931 - ), US Congressman from California and US Secretary of TransportationDiscoverNikkei: Mineta bio ; retrieved 2011-05-17 * Wataru Misaka (1923 - ), American basketball player, 1st non-Caucasian to play in the NBA in 1947 * Pat Morita (1932–2005), American actor * Kaoru Moto (1917–1992), US Medal of Honor recipient in World War IIGomez-Granger, \"Moto, Kaoru,\" p. 13 [PDF 17 of 44]; retrieved 2012-11-26. * Sadao Munemori (1922–1945), US Medal of Honor recipient in World War IITamashiro, Ben H. \"The Congressional Medal of Honor: Sadao Munemori,\" The Hawaii Herald, March 15, 1985; retrieved 2012-11-26. * Kiyoshi Muranaga (1922–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Muranga, Kiyoshi,\" pp. 13-14 [PDF 17-18 of 44]; retrieved 2012-11-26. * Mirai Nagasu (1993 - ), American Figure Skating champion in 2008 * Masato Nakae (1917–1998), US Medal of Honor recipient in World War IIGomez-Granger, \"Masato, Nakae,\" p. 14 [PDF 18 of 44]; retrieved 2012-11-26. * Shinyei Nakamine (1920–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Nakamine, Shinyei,\" pp. 14-15 [PDF 18-19 of 44]; retrieved 2012-11-26. * William Nakamura (1922–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Nakamura, William K.,\" p. 15 [PDF 19 of 44]; retrieved 2012-11-26. * George Nakashima (1905–1990), American furniture designer and cabinetmakerSaxon, Wolfgang. \"George Nakashima Is Dead at 85; Designer and Master Woodworker,\" New York Times (US). June 18, 1990 * Joe Nishimoto (1920–1944), US Medal of Honor recipient in World War IIGomez- Granger, \"Nishimoto, Joe M.,\" pp. 15-16 [PDF 19-20 of 44]; retrieved 2012-11-26. * Allan Ohata (1918–1977), US Medal of Honor recipient in World War IIGomez-Granger, \"Ohata, Alan M.,\" p. 16 [PDF 20 of 44]; retrieved 2012-11-26. * Apolo Anton Ohno (1982 - ) American Olympic athlete (2002, 2006, 2010), speed skater * James Okubo (1920–1967), US Medal of Honor recipient in World War IIGomez-Granger, \"Okubo, James K.,\" pp. 16-17 [PDF 20-21 of 44]; retrieved 2012-11-26. * Yukio Okutsu (1921–2003), US Medal of Honor recipient in World War IIGomez-Granger, \"Okutsu, Yukio,\" p. 17 [PDF 21 of 44]; retrieved 2012-11-26. * Frank Ono (1923–1980), US Medal of Honor recipient in World War IIGomez-Granger, \"Ono, Frank H.,\" pp. 17-18 [PDF 21-22 of 44]; retrieved 2012-11-26. * Kazuo Otani (1918–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Otani, Kazuo,\" p. 18 [PDF 22 of 44]; retrieved 2012-11-26. * George Sakato (1921 - ), US Medal of Honor recipient in World War IIGomez-Granger, \"Sakato, George T.,\" p. 19 [PDF 23 of 44]; retrieved 2012-11-26. * James Shigeta (1933 - ), American actor * Shinkichi Tajiri (1923–2009), American sculptor * Ted Tanouye (1919–1944), US Medal of Honor recipient in World War IIGomez-Granger, \"Tanouye, Ted T.,\" pp. 20-21 [PDF 24-25 of 44]; retrieved 2012-11-26. * Yoshinobu Oyakawa, American Olympic athlete (1952), swimmer * George Takei (1937 - ), American actorGeorge Takei Biography (1937-) * Minoru Yamasaki (1912–1986), American architect ==Related pages== * Japanese American Internment * Manzanar ==References== ==Other websites== * Japanese American National Museum * Japanese American Historical Society * Densho: The Japanese American Legacy Project * Discover Nikkei Category:Japanese diaspora",
 "title": "Nisei"
}