{
 "id": "372820",
 "text": "is a Japanese language term used in countries in North America and South America to name the Japanese people who immigrated. The emigrants or immigrants who were born in Japan are called Issei; and their children born in the new country are called Nisei (second generation). The grandchildren of Issei are called Sansei (third generation).The generation names come from the numbers \"one, two, three\" in the Japanese language. The first three Japanese numbers are \"ichi, ni, san. The fourth number is \"yon\". The character and uniqueness of the Issei is recognized in its social history.Numrich, Paul David. (2008). North American Buddhists in Social Context, p. 110. ==History== The earliest organized group of Japanese emigrants settled in Mexico in 1897.Ministry of Foreign Affairs (MOFA), Japan-Mexico Foreign Relations; retrieved 2012-11-25. Imigration to Brazil began in 1908. Today, the community established by the Issei has become the largest Japanese emigrant population outside of Japan, including approximately 1.5 million Brazilians.MOFA, \"Japan- Brazil Relations\"; retrieved 2012-11-25. Other Issei established themselves in the United States,Sakata, Yasuo. (1992). Fading Footsteps of the Issei, p. 1. Canada,McLellan, Janet. (1999). Many Petals of the Lotus: Five Asian Buddhist Communities in Toronto, p. 36. and Peru.\"Fujimori Secures Japanese Haven,\" BBCNews, 12 December 2000; retrieved 2012-11-25. In the 1930s, the term Issei came into common use. The word replaced the term \"immigrant\" (ijusha). This change in usage mirrored an evolution in the way the Issei looked at themselves. The label Issei also included the idea of belonging to the new country. Other terns like Nisei were modeled after this Issei pattern or template. == Cultural profile == The term Nikkei (日系) was created by sociologists in the late 20th century. The Nikkei include all of the world's Japanese immigrants and their descendants.Japanese American National Museum, \"What is Nikkei?\" ; retrieved 2012-11-25. The Issei were born in Japan, and their cultural perspective was primarily Japanese; but they were in America by choice.Smithsonian, \"The Art of Gaman: Arts and Crafts from the Japanese American Internment Camps, 1942 - 1946\", Yoshitsuchi Ikemoto ; excerpt, \"... one of hundreds of Issei (first-generation) 'bachelor' laborers who were unable to send for their wives or a picture bride because the U.S. government cut off all immigration from Japan in 1924\"; retrieved 2012-11-25. Their children, grandchildren, great-grandchildren and great-great-grandchildren grew up with a national and cultural point-of-view that was different from their parents. Although the Issei kept an emotional connection with Japan, they created homes in a country far from Japan.Yenne, Bill. (2007). Rising Sons: The Japanese American GIs Who Fought for the United States in World War II, p. xv. Generation Cohort description Issei (一世) The generation of people born in Japan who immigrated to another country.\"Issei\" Densho Encyclopedia; retrieved 2012-11-25. Nisei (二世) The generation of people born in North America, Latin America, Australia, Hawaii, or any country outside of Japan either to at least one Issei parent. Sansei (三世) The generation of people born to at least one Nisei parent. Yonsei (四世) The generation of people born to at least one Sansei parent Gosei (五世) The generation of people born to at least one Yonsei parentIkezoe-Halevi, Jean. \"Voices of Chicago: Day of Remembrance 2006,\" Discover Nikkei (US). October 31, 2006; retrieved 2012-11-25. The Issei, Nisei and Sansei generations reflect distinctly different attitudes to authority, gender, non-Japanese involvement, and religious practice, and other matters.McLellan, p. 59. == Select list of notable Issei == :This list is not finished; you can help Wikipedia by adding to it. * Kan'ichi Asakawa (1873-1948), academic, author, peace advocate, historian and librarianDiscoverNikkei: Asakawa bio; retrieved 2012-11-25. * Makoto Hagiwara ( -1925), made the fortune cookie popularLee, Jennifer 8. \"Solving a Riddle Wrapped in a Mystery Inside a Cookie,\" The New York Times (US). January 16, 2008; retrieved 2012-11-25. * Mazie Hirono (1947- ), 1st US Senator born in Japan\"Hirono Becomes First U.S. Senator Born in Japan,\" Wall Street Journal, 6 November 2012; retrieved 2012-11-25. * Fujitaro Kubota (1879-1973), American Seattle gardener and philanthropistKubota Garden, \"A Short History\" ; retrieved 2012-11-25. * Isamu Noguchi (1904–1988), American sculptor and landscape architectBrenson, Michael. \"Isamu Noguchi, the Sculptor, Dies at 84\", New York Times (US). December 31, 1988; retrieved 2012-11-26. * Yoko Ono Lennon (1933- ) artist and musician.Robinson, Greg. \"Resettlement in New York,\" Densho Encyclopedia; retrieved 2012-11-25. * George Masa (1881–1933), activist in creation of Great Smoky Mountains National ParkThe National Parks (PBS), \"Horace Kephart (1862–1931) and George Masa (1881–1933)\"; retrieved 2012-11-25. * Yoichiro Nambu (1921 - ), American Nobel Prize winner (2008), PhysicistPollard, Niklas. \"Two Japanese, American win 2008 physics Nobel,\" Reuters (UK). 7 October 2008; retrieved 2012-11-25. * Jokichi Takamine (1854 - 1922), chemist who isolated adrenalinePulvers, Roger. \"Jokichi Takamine: a man with fire in his belly whatever the odds,\" Japan Times, June 28, 2009; retrieved 2012-11-25. ==Related pages== * Japanese American Internment ==References== ==Other websites== * Japanese American National Museum * Japanese American Historical Society * Densho: The Japanese American Legacy Project * Discover Nikkei Category:Japanese diaspora",
 "title": "Issei"
}