{
 "id": "373004",
 "text": "Bipolar I disorder (BP-I; pronounced as \"type one bipolar disorder\") is a mental disorder that affects people's moods. The main part of bipolar I disorder is a manic episode. During a manic episode, someone's mood is extremely elevated and they may be more reckless, dangerous, or impulsive. This usually lasts around one week. Most people with bipolar I disorder will also have depressive episodes where they lose motivation for activities they used to like and may feel empty or hopeless. A depressive episode can last around two weeks. Sometimes, people with bipolar I disorder are hospitalized because of mania. They may also have psychosis and struggle to know what is real or not. Medication is used to help people with bipolar I disorder. It usually has a bad prognosis, meaning the chance for the disorder to get less severe is low. == Diagnosis == In order to be diagnosed with bipolar I disorder, someone has to have a manic episode. During a manic episode, someone is extremely energized and their mood is very elevated. People going through mania usually have more self-esteem, are more talkative, are easily distracted, and may be more focused on completing goals. They may feel as if there are no consequences to their actions and may be more confident and reckless. For example, they may spend a lot of money, invest in businesses, drink a lot of alcohol, or be more sexually active. They may sleep less and be energized even if they didn't sleep much. A manic episode lasts around seven days. Sometimes, they are so serious that someone is hospitalized so they do not hurt themselves or others. Sometimes, mania can cause someone to have psychosis, meaning they may have delusions and cannot tell what is real or not. Sometimes, someone may have a manic episode due to drugs or medication. They will not be diagnosed with bipolar I disorder because mania in bipolar I disorder is natural. Many people with bipolar I disorder also have major depressive episodes. During a depressive episode, someone may lose motivation for things that they used to like doing. They may feel hopeless or empty. However, in order to get diagnosed with bipolar I disorder, someone just has to have a manic episode. People do not need a depressive episode to be diagnosed. Depressive episodes last for around two weeks. Bipolar I disorder is one of three different bipolar disorders. The others are bipolar II disorder and cyclothymia. People with bipolar II disorder and cyclothymia have hypomania, which is a less severe type of mania. Only people with bipolar I disorder have full mania. Many people with bipolar I disorder have comorbidities. This means they have other mental disorders. Up to 40% of people with bipolar I disorder also have post-traumatic stress disorder. Anxiety disorders and substance (drug or alcohol) use disorders are also common. === DSM-5 and ICD-10 === The DSM-5 (Diagnostic and Statistical Manual of Mental Disorders, 5th Edition) and ICD-10 (International Classification of Diseases Version 10) are two books that doctors use to diagnosed conditions. These books have different subtypes for bipolar I disorder. This is because the way bipolar I disorder affects people can be different. Some people may have hypomania and mania. Others may have psychosis. == Treatment == Mood stabilizers, a type of medication that can help regulate someone's mood, is the main treatment for bipolar I disorder. Lithium is the main medication, but people who take lithium often need to be monitored. Other medication includes anticonvulsants like valproate, which are similar to mood stabilizers. Some people may take atypical antipsychotics like quetiapine, which are used to treat many different mental disorders. Antidepressants are used to treat depression, but are usually not used for people with bipolar I disorder. This is because 20–40% of people with bipolar I disorder have a manic episode because of antidepressants. Mood stabilizers like lithium usually do not do this, but the risk is still there. Some people may get help through therapy. This can include psychoeducation, cognitive behavioral therapy, and peer support. This may prevent people from doing risky things when they have mania. == Prognosis == The prognosis (how well the symptoms of a disorder change over time) for bipolar I disorder is usually bad. This is because a lot of people with bipolar I disorder struggle with drug or alcohol abuse, depression, and psychosis. About 63% of mania related to bipolar I disorder leads to hospitalization. If someone with bipolar I disorder does not get treatment, their depressive and manic episodes may be more common and severe. Generally, people with bipolar disorder die about ten years earlier than the general population. However, if someone gets good treatment, they can live a healthy life. == Prevalence == Men and women are equally diagnosed with bipolar I disorder. Most people have their first manic episode in their early-20s. About 0.53% of adults have bipolar disorder. == References == Category:Mental illnesses Category:Bipolar disorder",
 "title": "Bipolar I disorder"
}