{
 "id": "37302",
 "text": "Francis Ford Coppola (born April 7, 1939) is an American director and movie producer. He directed the Godfather trilogy and the Vietnam War epic Apocalypse Now. He is part of the group called the New Hollywood. This group includes Martin Scorsese, Terrence Malick, Robert Altman, Woody Allen, William Friedkin, Philip Kaufman, and George Lucas. In the 1970s they made movies in a different way. Coppola was born in Detroit. At age two, he moved to Woodside, Queens, New York City. Many of his relatives are famous. Actor Nicolas Cage is his nephew. Actress Talia Shire is his sister. Sofia Coppola is his daughter. Roman Coppola is his son. His first child Gian-Carlo Coppola died in 1986. Coppola was married to Eleanor Jessie Neil from 1963 until her death in 2024. == Filmography == Movie Year Title Contribution Notes 1962 Tonight for Sure Director/Writer First film 1962 Director/Writer 1963 Dementia 13 Director/Writer First feature film 1963 Director/Producer 1966 You're a Big Boy Now Director/Writer Nominated — Palme d'Or Nominated — Golden Globe Award for Best Motion Picture – Musical or Comedy Nominated — Writers Guild of America Award for Best American Screenplay - Comedy 1968 Finian's Rainbow Director Nominated — Golden Globe Award for Best Motion Picture – Musical or Comedy 1969 Director/Writer Golden Shell at San Sebastián International Film Festival 1970 Patton Writer Academy Award for Best Writing (Original Screenplay) 1971 THX 1138 Executive Producer 1972 Director/Writer Academy Award for Best Picture Academy Award for Best Writing (Adapted Screenplay) David di Donatello for Best Foreign Film Directors Guild of America Award for Outstanding Achievement in Feature Film Golden Globe Award for Best Motion Picture – Drama Golden Globe Award for Best Director Golden Globe Award for Best Screenplay Golden Screen at Golden Screen Awards, Germany Kansas City Film Critics Circle Award for Best Director Writers Guild of America Award for Best Drama Adapted from Another Medium Nominated — Academy Award for Best Director Nominated — Best Audio Commentary at DVD Exclusive Awards 1973 American Graffiti Producer Kansas City Film Critics Circle Award for Best Film Nominated — Academy Award for Best Picture Golden Globe Award for Best Motion Picture – Musical or Comedy 1974 Director/Producer/Writer Palme d'Or Prize of the Ecumenical Jury- Special Mention Kansas City Film Critics Circle Award for Best Director National Board of Review Award for Best Director Nominated — Academy Award for Best Original Screenplay Nominated — BAFTA Award for Best Direction Nominated — BAFTA Award for Best Screenplay Nominated — Video Premiere Award at DVD Exclusive Awards Nominated — Directors Guild of America Award for Outstanding Achievement in Feature Film Nominated — Best Motion Picture Screenplay Nominated — Golden Globe Award for Best Motion Picture Nominated — Golden Globe Award for Best Director Nominated — Golden Globe Award for Best Screenplay Nominated — Writers Guild of America Award for Best Drama Written Directly for the Screen Nominated — Academy Award for Best Picture 1974 Director/Producer/Writer Academy Award for Best Picture Academy Award for Best Director Academy Award for Best Writing (Adapted Screenplay) Directors Guild of America Award for Outstanding Directorial Achievement in Feature Film Kansas City Film Critics Circle Award for Best Director National Society of Film Critics Award for Best Director Writers Guild of America Award for Best Drama Adapted from Another Medium Nominated — Golden Globe Award for Best Motion Picture – Drama Nominated — Golden Globe Award for Best Director Nominated — Golden Globe Award for Best Screenplay 1979 Apocalypse Now Director/Producer/Writer/Music Palme d'Or FIPRESCI Prize Golden Globe Award for Best Director BAFTA Award for Best Direction David di Donatello for Best Foreign Film Golden Screen at Golden Screen Awards, Germany London Film Critics Circle Award for Best Film Nominated — Academy Award for Best Picture Nominated — Academy Award for Best Director Nominated — Academy Award for Best Adapted Screenplay Nominated — BAFTA Award for Best Film Nominated — Best Foreign Language Film at Cinema Brazil Grand Prize (2002) Nominated — César Award for Best Foreign Film Nominated — Directors Guild of America Award for Outstanding Achievement in Feature Film Nominated — Golden Globe Award for Best Motion Picture Nominated — Grammy Award for Best Album of Original Score Written for a Motion Picture or Television Special Nominated — Writers Guild of America Award for Best Drama Written Directly for the Screen 1979 The Black Stallion Executive Producer 1980 Kagemusha Executive Producer David di Donatello for Best Producer 1982 One from the Heart Director/Writer 1983 Director Nominated — Golden Prize at the Moscow International Film Festival Nominated — Best Family Feature Motion Picture at the Young Artist Awards 1983 Koyaanisqatsi Executive Producer 1983 Rumble Fish Director/Producer/Writer FIPRESCI Prize at San Sebastián International Film Festival OCIC Award at the San Sebastián International Film Festival 1984 Director/Writer Nominated — Golden Globe Award for Best Director Nominated — Golden Globe Award for Best Motion Picture Nominated — Japan Academy Prize for Outstanding Foreign Language Film 1986 Peggy Sue Got Married Director Nominated — Golden Globe Award for Best Motion Picture – Musical or Comedy Nominated — Saturn Award for Best Science Fiction Film 1987 Gardens of Stone Director/Producer Nominated — Golden Prize at the Moscow International Film Festival Nominated — Political Film Society Award for Peace 1988 Tucker: The Man and His Dream Director 1989 New York Stories Co-director/Co-writer 1990 Director/Producer/Writer Best Foreign Film (Mejor Película Extranjera) at Fotogramas de Plata Nominated — Academy Award for Best Picture Nominated — Academy Award for Best Director Nominated — Directors Guild of America Award for Outstanding Achievement in Feature Film Nominated — Golden Globe Award for Best Motion Picture Nominated — Golden Globe Award for Best Director Nominated — Golden Globe Award for Best Screenplay 1992 Dracula Director/Producer/Writer Saturn Award for Best Direction Saturn Award for Best Horror Film Best Foreign Film (Mejor Película Extranjera) at Fotogramas de Plata Nominated — Hugo Award for Best Dramatic Presentation 1993 Producer 1993 The Secret Garden Executive Producer Los Angeles Film Critics Association Award for Best Music Nominated — BAFTA Award for Best Actress in a Supporting Role (Maggie Smith) 1994 Frankenstein Producer Nominated — Saturn Award for Best Horror Film 1995 Kidnapped Executive Producer 1996 Jack Director/Producer Nominated — Best Family Feature - Musical or Comedy at Young Artist Awards 1997 Director/Writer Nominated — USC Scripter Award Nominated — Political Film Society Award for Democracy 1999 Producer 1999 Sleepy Hollow Producer 2001 CQ Producer 2001 Jeepers Creepers Producer 2003 Jeepers Creepers 2 Producer 2006 Marie Antoinette Producer 2007 Youth Without Youth Director/Producer/Writer 2009 Tetro Director/Producer/Writer 2010 Somewhere Producer 2011 On the Road Executive Producer 2011 Twixt Director/Producer/Writer ==References== ==Other websites== * * Category:1939 births Category:Living people Category:Academy Award winning directors Category:American television directors Category:American television producers Category:American television writers Category:BAFTA Award winners Category:Movie directors from Michigan Category:Movie producers from Michigan Category:Movie directors from New York City Category:Movie producers from New York City Category:Screenwriters from Michigan Category:Screenwriters from New York City Category:Writers from Detroit Category:Writers from Queens",
 "title": "Francis Ford Coppola"
}