{
 "id": "373315",
 "text": "Massimo Firpo (Turin, 1946) is an Italian historian. ==Academic career== Firpo teaches early modern history at the University of Turin and at the Scuola Normale Superiore of Pisa. He is a member of the Accademia Nazionale dei Lincei. He studied at the University of Turin (where he was a pupil of Franco Venturi, and where he obtained his laurea in 1969 with a thesis about Pietro Bizzarri esule Italiano del Cinquecento, published in 1971). Subsequently he has been Accademia dei Lincei fellow at the Scuola Normale Superiore di Pisa. He has taught early modern history at the Faculty of Political Sciences of the University of Cagliari. Ha has been fellow or visiting professor at the Newberry Library, Chicago, at the Cornell University, Ithaca and at the University of Oxford (where in 2006 he was Isaiah Berlin visiting professor).For all these informations see notice on Who's Who Sutter's International Red Series ; and also Massimo Firpo's webpage on the site of the Scuola Normale Superiore ==Research activity== He started his researches studying the heretical movements of the 16th century and focusing on the Italian heretical diaspora in Eastern Europe, radical movements such as Antitrinitarianism and Socinianism and the relations between this cultural tradition, the deism and the origins of Enlightenment thought.See especially his books Antitrinitari nell'Europa orientale del ‘500. Nuovi testi di Szymon Budny, Niccolò Paruta e Iacopo Paleologo, La Nuova Italia, Firenze, 1977, and Il problema della tolleranza religiosa nell'età moderna. Dalla Riforma protestante a Locke, Loescher, Torino, 1978. Subsequently his studies have dealt with the Italian religious crisis of the 16th century, focusing especially on Juan de Valdés, Reginald Pole, Giovanni Morone and the Spirituali movements and on the role played by the Roman Inquisition in these decades.See especially his works: Inquisizione romana e Controriforma. Studi sul cardinal Giovanni Morone e il suo processo d'eresia, Il Mulino, Bologna, 1992; Riforma protestante ed eresie nell'Italia del Cinquecento. Un profilo storico, Roma-Bari, Laterza, 1993; Edition of Juan de Valdés, Alfabeto cristiano, Domande e risposte, Della predestinazione, Catechismo per i fanciulli, Einaudi, Torino, 1994;Dal sacco di Roma all'Inquisizione. Studi su Juan de Valdés e la Riforma italiana, Edizioni dell'Orso, Alessandria, 1998; Inquisizione romana e Controriforma. Studi sul cardinal Giovanni Morone (1509-1580) e il suo processo d'eresia, Nuova edizione rivista ed ampliata, Brescia, Morcelliana, 2005; Vittore Soranzo vescovo ed eretico. Riforma della Chiesa e Inquisizione nell'Italia del Cinquecento, Roma-Bari, Laterza, 2006. He has published the critical edition of the most important inquisitorial trials of the Italian 16th century (Giovanni Morone, Pietro Carnesecchi, Vittore Soranzo).See M. Firpo, D. Marcatto, Il processo inquisitoriale del cardinal Giovanni Morone. Edizione critica (with Dario Marcatto), voll. 6, Istituto storico italiano per l'età moderna e contemporanea, Roma, 1981-1995; M. Firpo, D. Marcatto, I processi inquisitoriali di Pietro Carnesecchi (1557-1567). Edizione critica (with Dario Marcatto), voll. 2, Archivio Segreto Vaticano, Città del Vaticano, 1998-2000; M. Firpo, S. Pagano, I processi inquisitoriali di Vittore Soranzo (1550-1558). Edizione critica (in collaborazione con Sergio Pagano), tt. 2, Archivio Segreto Vaticano, Città del Vaticano, 2004. He has also published many studies of art history (especially about Pontormo, Lorenzo Lotto and Battista Franco and the relations between their works and the new religious ideas).See his books Gli affreschi di Pontormo a San Lorenzo. Eresia, politica e cultura nella Firenze di Cosimo I, Einaudi, Torino, 1997; Artisti, gioiellieri, eretici. Il mondo di Lorenzo Lotto tra Riforma e Controriforma, Roma-Bari, Laterza 2001; Battista Franco «pittore viniziano» nella cultura artistica e nella vita religiosa del '500 (with Fabrizio Biferali), Pisa, Edizioni della Scuola Normale Superiore, 2007; Navicula Petri. L'arte dei papi nel '500 (with Fabrizio Biferali), Roma-Bari, Laterza, 2009 ==Family== His father, Luigi Firpo (1915-1989), was a prominent Italian historian, professor of history of political thought at the Faculties of Law and Political Sciences at the University of Turin, and a member of the Italian Republican Party. ==Selected bibliography== ===Books=== * Pietro Bizzarri esule italiano del Cinquecento, Giappichelli, Torino, 1971, pp. 331\\. * Antitrinitari nell'Europa orientale del ‘500. Nuovi testi di Szymon Budny, Niccolò Paruta e Iacopo Paleologo, La Nuova Italia, Firenze, 1977, pp. XIX-414. * Il problema della tolleranza religiosa nell'età moderna. Dalla Riforma protestante a Locke, Loescher, Torino, 1978, pp. 302\\. * Il processo inquisitoriale del cardinal Giovanni Morone. Edizione critica (with Dario Marcatto), voll. 6, Istituto storico italiano per l'età moderna e contemporanea, Roma, 1981-1995, pp. 423, 1180, 462, 617, 724, 459. * Inquisizione romana e Controriforma. Studi sul cardinal Giovanni Morone e il suo processo d'eresia, Il Mulino, Bologna, 1992, pp. 399 * Nel labirinto del mondo. Lorenzo Davidico tra santi, eretici, inquisitori, Olschki, Firenze, 1992, pp. XVIII-259. * Riforma protestante ed eresie nell'Italia del Cinquecento. Un profilo storico, Roma-Bari, Laterza, 1993, pp. 206\\. * Edition of Juan de Valdés, Alfabeto cristiano, Domande e risposte, Della predestinazione, Catechismo per i fanciulli, Einaudi, Torino, 1994, pp. CCII-218. * Gli affreschi di Pontormo a San Lorenzo. Eresia, politica e cultura nella Firenze di Cosimo I, Einaudi, Torino, 1997, pp. XXIII-446. * Dal sacco di Roma all'Inquisizione. Studi su Juan de Valdés e la Riforma italiana, Edizioni dell'Orso, Alessandria, 1998, pp. 232\\. * I processi inquisitoriali di Pietro Carnesecchi (1557-1567). Edizione critica (with Dario Marcatto), voll. 2, Archivio Segreto Vaticano, Città del Vaticano, 1998-2000, pp. CXIX, 577; CLXXIX, 1453. * Artisti, gioiellieri, eretici. Il mondo di Lorenzo Lotto tra Riforma e Controriforma, Roma-Bari, Laterza 2001, pp. 376\\. * Disputar di cose pertinente alla fede. Studi sulla vita religiosa del Cinquecento italiano, Milano, Unicopli, 2003, pp. 236 * I processi inquisitoriali di Vittore Soranzo (1550-1558). Edizione critica (in collaborazione con Sergio Pagano), tt. 2, Archivio Segreto Vaticano, Città del Vaticano, 2004, pp. XCVII, 1061. * Inquisizione romana e Controriforma. Studi sul cardinal Giovanni Morone (1509-1580) e il suo processo d'eresia, Nuova edizione rivista ed ampliata, Brescia, Morcelliana, 2005, pp. 624\\. * Vittore Soranzo vescovo ed eretico. Riforma della Chiesa e Inquisizione nell'Italia del Cinquecento, Roma-Bari, Laterza, 2006, pp. XII-540. * Battista Franco «pittore viniziano» nella cultura artistica e nella vita religiosa del '500 (with Fabrizio Biferali), Pisa, Edizioni della Scuola Normale Superiore, 2007, pp. 465\\. * Edition of Marcantonio Flaminio, Meditationi et orationi formate sopra l’epistola di san Paolo ai romani, Torino, Aragno, 2007, pp. 87\\. * Navicula Petri. L'arte dei papi nel '500 (with Fabrizio Biferali), Roma-Bari, Laterza, 2009, pp. 418\\. * Il processo inquisitoriale del cardinal Giovanni Morone. Nuova edizione critica, Vol. I, Il processo d’accusa (with Dario Marcatto, Luca Addante and Guido Mongini), Libreria Editrice Vaticana, Roma 2011, pp. CXXV, 1379. ===Directed works=== * Direction of Atlante Enciclopedico Touring, voll. IV-V (Atlante storico), Touring Club italiano, Milano, 1989-1990; II ed. UTET, Torino, 1991. * Co-Direction (with Nicola Tranfaglia) of La Storia. I grandi problemi dal Medioevo all'Età Contemporanea, voll. 10, UTET, Torino, 1986-1988; II ed. Garzanti, Milano, 1993-1995. * Co-Direction (with Pier Giorgio Zunino) of La storia e le sue immagini. L’Italia dall’Unità a oggi, voll. 3, Milano, Garzanti, 2002-2003. ===Main articles=== * Pierre Bayle, gli eretici italiani del Cinquecento e la tradizione sociniana, «Rivista storica italiana», LXXXV, 1973, pp. 612–66. * Sui movimenti ereticali in Italia e in Polonia nei secoli XVI-XVII, «Rivista storica italiana», LXXXVI, 1974, pp. 344–71. * Alcuni documenti sulla conversione al cattolicesimo dell’eretico lucchese Simone Simoni, «Annali della Scuola normale superiore di Pisa», classe di lettere e filosofia, serie III, vol. IV, 4, 1974, pp. 1479–1502. * List Jakuba Paleologa do cesarza Rudolfa II (1577), «Odrodzenie i Reformacja w Polsce», XXI, 1976, pp. 165–82. * Recenti studi sul socinianesimo nel Sei e Settecento, «Rivista storica italiana», LXXXIX, 1977, pp. 106–52. * John Toland e il deismo inglese, «Rivista storica italiana», XC, 1978, pp. 327–80. * John Locke e il socinianesimo, «Rivista storica italiana», XCII, 1980, pp. 35–124. * Sulla legazione di pace di Reginald Pole (1553-1556), «Rivista storica italiana», XCIII, 1981, pp. 821–37. * Galileo tra inquisitori e microstorici (with Vincenzo Ferrone), «Rivista storica italiana», XCVII, 1985, pp. 177–238; pubblished in English in «The Journal of Modern History», LVIII, 1986, pp. 485–524. * Il cardinale, in L’uomo del Rinascimento, a cura di Eugenio Garin, Roma-Bari, Laterza, 1988, pp. 73–131 (French translation: Paris, Seuil, 1990; Spanish translation: Madrid, Alianza Editorial, 1990; Japanese translation: Iwanami Shoten, 1990; trad. olandese: Amsterdam, Uitgeversmaatschappij Agon BV, 1991; trad. inglese: Chicago-London, Chicago University Press, 1991). * The Italian Reformation, in A Companion to the Reformation World, ed. by Ronnie Po-chia Hsia, London, Blackwell, 2004, pp. 169–84. * Lorenzo Lotto and the Reformation in Venice, in Heresy, Culture, and Religion in Early Modern Italy. Contexts and Contestations, ed. by Ronald K. Delph, Michelle M. Fontaine, John J. Martin, Kirksville (Mo), Truman State University Press, 2006, pp. 21–36 * Da inquisitori a pontefici. Il Sant’Ufficio romano e la svolta del 1552, «Rivista storica italiana», CXXII, 2010, pp. 911–50. ==Related pages== *John Locke *Nontrinitarianism *Socinianism *Deism *Protestant Reformation == Other websites == *Massimo Firpo's webpage on the site of the Scuola Normale Superiore * Massimo Firpo's webpage on the site of University of Turin *Notice about Massimo Firpo on Who's Who Sutter's International Red Series *Massimo Firpo's works on Worldcat ==Notes== Category:Italian historians Category:1946 births Category:Living people",
 "title": "Massimo Firpo"
}