{
 "id": "373453",
 "text": "The Four Freedoms Award is an annual award. It is presented to people and organisations who have \"demonstrated\" the principles of the Four Freedoms of US-president Franklin Delano Roosevelt. President Roosevelt described his Four Freedoms during the State of the Union speech of 6 January 1941. In his speech he said that if democracy is to survive and flourish, people everywhere in the world are entitled to four human rights: freedom of speech and expression, freedom of worship, freedom from want and freedom from fear. The awards have been given since 1982, alternately in the United States and the Netherlands. In odd years the awards are given to Americans by the Franklin and Eleanor Roosevelt Institute in Hyde Park, New York. In some years special awards have been given. In even years the award ceremony is held in Middelburg and honours non-Americans. The choice for Middelburg was motivated by the suspected descendance of the family Roosevelt from the village of Oud-Vossemeer in the province of Zeeland. == Four Freedoms Speech == The speech delivered by President Roosevelt incorporated the following > In the future days, which we seek to make secure, we look forward to a world > founded upon four essential human freedoms. #The first is freedom of speech > and expression — everywhere in the world. #The second is freedom of every > person to worship God in his own way — everywhere in the world. #The third > is freedom from want —which, translated into world terms, means economic > understandings which will secure to every nation a healthy peacetime life > for its inhabitants— everywhere in the world. #The fourth is freedom from > fear —which, translated into world terms, means a world-wide reduction of > armaments to such a point and in such a thorough fashion that no nation will > be in a position to commit an act of physical aggression against any > neighbor— anywhere in the world. That is no vision of a distant millennium. > It is a definite basis for a kind of world attainable in our own time and > generation. That kind of world is the very antithesis of the so-called new > order of tyranny which the dictators seek to create with the crash of a > bomb.—Franklin D. Roosevelt, excerpted from the State of the Union Address > to the Congress, January 6, 1941 == Laureates== ===Freedom Medal=== Year Middelburg Year Hyde Park 1982 H.R.H. Princess Juliana of the Netherlands 1983 W. Averell Harriman 1984 Harold Macmillan 1985 Claude Pepper 1986 Alessandro Pertini 1987 Thomas P. O'Neill, Jr 1988 Helmut Schmidt 1989 William J. Brennan, Jr. 1990 Václav Havel and Jacques Delors 1991 Thurgood Marshall 1992 Javier Pérez de Cuéllar 1993 Cyrus Vance 1994 Dalai Lama 1995 President Jimmy Carter 1996 Juan Carlos of Spain 1997 Katharine Meyer Graham 1998 Mary Robinson 1999 Edward M. Kennedy 2000 Martti Ahtisaari 2001 W.W. II veterans as represented by * Richard Winters (U.S. Army) * Robert Eugene Bush (U.S. Navy) * William T. Ketcham (U.S. Marine Corps) * Lee A. Archer, Jr. (U.S. Air Force) * Ellen Buckley (U.S. Army Nurse Corps) 2002 Nelson Mandela 2003 George J. Mitchell 2004 Kofi Annan 2005 Bill Clinton 2006 Mohamed ElBaradei 2007 Carl Levin and Richard Lugar 2008 Richard von Weizsäcker 2009 Hillary Rodham Clinton 2010 European Court of Human Rights 2011 Russ Feingold 2012 Luiz Inácio Lula da Silva 2013 Wendell Berry ===Freedom of Speech=== Year Middelburg Year Hyde Park 1982 Max van der Stoel 1983 Joseph L. Rauh, Jr. 1984 Amnesty International 1985 Dr. Kenneth B. Clark 1986 El País 1987 Herbert Block 1988 Ellen Johnson Sirleaf 1989 Walter Cronkite 1990 No Award 1991 James Reston 1992 Mstislav Rostropovich 1993 Arthur Miller 1994 Marion Dönhoff 1995 Mary McGrory 1996 John Hume 1997 Sidney R. Yates 1998 CNN 1999 John Lewis 2000 Bronisław Geremek 2001 The New York Times and the Ochs/Sulzberger Family 2002 Radio Free Europe/Radio Liberty 2003 Studs Terkel 2004 Lennart Meri 2005 Tom Brokaw 2006 Carlos Fuentes 2007 Bill Moyers 2008 Lakhdar Brahimi 2009 Anthony Romero 2010 Novaya Gazeta 2011 Michael J. Copps 2012 Al Jazeera 2013 ... ===Freedom of Worship=== Year Middelburg Year Hyde Park 1982 Willem A. Visser 't Hooft 1983 Coretta Scott King 1984 Werner Leich and Christiann F. Beyers Naudé 1985 Elie Wiesel 1986 Bernardus Alfrink 1987 Leon Sullivan 1988 Teddy Kollek 1989 Raphael Lemkin (posthumously) and Hyman Bookbinder 1990 László Tőkés 1991 Paul Moore, Jr. 1992 Terry Waite 1993 Theodore M. Hesburgh, CSC 1994 Gerhart M Riegner 1995 Andrew Young 1996 Lord Runcie 1997 William H. Gray 1998 Desmond Tutu 1999 Corinne C. Boggs 2000 Cicely Saunders 2001 Johnnie Carr 2002 Nasr Abu Zayd 2003 Robert F. Drinan 2004 Sari Nusseibeh 2005 Cornel West 2006 Taizé Community 2007 Peter J. Gomes 2008 Karen Armstrong 2009 Eboo Patel 2010 Asma Jahangir 2011 Rev. Barry W. Lynn 2012 Patriarch Bartholomew I of Constantinople 2013 ... ===Freedom from Want=== Year Middelburg Year Hyde Park 1982 H. Johannes Witteveen 1983 Robert S. McNamara 1984 Liv Ullmann 1985 Dr. John Kenneth Galbraith 1986 F. Bradford Morse 1987 Mary Lasker 1988 Dr. Halfdan T. Mahler 1989 Dr. Dorothy I. Height 1990 Emile van Lennep 1991 Paul Newman and Joanne Woodward 1992 Jan Tinbergen 1993 Eunice Kennedy Shriver and Sargent Shriver 1994 Sadako Ogata 1995 Lane Kirkland 1996 Médecins Sans Frontières 1997 Mark O. Hatfield 1998 Stéphane Hessel 1999 George S. McGovern 2000 M. S. Swaminathan 2001 March of Dimes 2002 Gro Harlem Brundtland 2003 Dolores Huerta 2004 Marguerite Barankitse 2005 Marsha J. Evans 2006 Muhammad Yunus, Grameen Bank 2007 Barbara Ehrenreich 2008 Jan Egeland 2009 Vicki Escarra 2010 Maurice Strong 2011 Jacqueline Novogratz 2012 Ela Bhatt 2013 ... ===Freedom from Fear=== Year Middelburg Year Hyde Park 1982 J. Herman van Roijen 1983 Jacob K. Javits 1984 Brian Urquhart 1985 Dr. Isidor Rabi 1986 Olof Palme (posthumously) 1987 Dr. George Kennan 1988 Dr. Armand Hammer 1989 J. William Fulbright 1990 Simon Wiesenthal 1991 Mike Mansfield 1992 Lord Carrington 1993 George Ball 1994 Zdravko Grebo 1995 Elliot Richardson 1996 Shimon Peres 1997 Daniel K. Inouye 1998 Craig Kielburger 1999 Robert O. Muller 2000 Louise Arbour 2001 W.W. II veterans as represented by * Richard Winters (U.S. Army) * Robert E. Bush (U.S. Navy) * William T. Ketcham (U.S. Marine Corps) * Lee A. Archer, Jr. (U.S. Air Force) * Ellen Buckley (U.S. Army Nurse Corps) 2002 Ernesto Zedillo 2003 Robert C. Byrd 2004 Max Kohnstamm 2005 Lee H. Hamilton and Thomas Kean 2006 Aung San Suu Kyi 2007 Brent Scowcroft 2008 Willemijn Verloop - War Child 2009 Pasquale J. D'Amuro 2010 Gareth Evans 2011 Bryan A. Stevenson 2012 Hussain al-Shahristani 2013 ... ===Special presentations=== 1984 Simone Veil (Centenial Award) 2002 William vanden Heuvel 2005 BBC World Service 1990 Mikhail Gorbachev 2003 Arthur Schlesinger Jr. 2005 Mary Soames 1995 Jonas Salk 2004 Anton Rupert 2006 Mike Wallace 1995 Ruud Lubbers 2004 Bob Dole 2008 Forrest Church == References == *Roosevelt Institute, List of laureates * . NOS (2008) *Oosthoek, A.L. (2010) Roosevelt in Middelburg: the four freedoms awards 1982-2008, *American Rethoric, Four Freedoms Speech of Roosevelt ==Other websites== * Roosevelt Institute, Hyde Park, New York * Roosevelt Stichting, Middelburg, Netherlands Category:American awards Category:Dutch culture Category:Human rights Category:New York (state) Category:Zeeland Category:1982 establishments in the United States Category:1980s establishments in the Netherlands",
 "title": "Four Freedoms Award"
}