{
 "id": "373444",
 "text": "Shizuya Hayashi (November 28, 1917-March 12, 2008) was a United States Army soldier.Nakaso, Dan. \"WWII hero Shizuya Hayashi, 90: 100th Battalion private recognized in 2000 with Medal of Honor,\" The Honolulu Advertiser. March 15, 2008; retrieved 2012-12-7. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (G-L)\" ; retrieved 2012-12-7. ==Early life== Hayashi was born in Waiakea, Hawaii. He was the son of immigrants who were born in Japan. He was a Nisei, which means that he was a second generation Japanese-American.Bramlett, David A. \"Go For Broke Monument, Fifth Anniversary Tribute,\" June 5, 2004; retrieved 2012-12-7. ==Soldier== Nine months before the Japanese attack on Pearl Harbor, Hayashi joined the US Army in March 1941.U.S. National Archives and Records Administration (NARA), WWII Army Enlistment Record #30100871 Hayashi, Shizuya; retrieved 2012-12-7. He was given the nickname \"Cesar\" because his sergeant could not pronounce his name.Kakesako, Greg K. \"Pearl City vet earned WWII Medal of Honor,\" Honolulu Star Bulletin. March 14, 2008; retrieved 2012-12-7. Hayashi volunteered to be part of the all-Nisei 100th Infantry Battalion.Go for Broke National Education Center, \"Medal of Honor Recipient Private Shizuya Hayashi\" ; retrieved 2012-12-7. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; Vachon, Duane A. \"Postponed Honor - Private Shizuya Hayashi, U.S. Army, (1917-2008),\" Hawaii Reporter. May 16, 2011; retrieved 2012-12-7. For his actions in November 1943, Hayashi was awarded the Army's second-highest decoration, the Distinguished Service Cross (DSC). In the 1990s, there was a review of service records of Asian Americans who received the DSC during World War II. Hayashi's award was upgraded to the Medal of Honor. In a ceremony at the White House on June 21, 2000, he was presented with his medal by President Bill Clinton. Twenty-one other Asian Americans also received the medal during the ceremony, but only seven of them were still alive. \"21 Asian American World War II Vets to Get Medal of Honor\" at University of Hawaii Digital History ; retrieved 2012-12-7. ==Medal of Honor citation== Hayashi's Medal of Honor recognized his conduct in frontline fighting in central Italy in 1943. Without help from others, he silenced a machine gun nest and an anti-aircraft gun.CMH, \"Asian Pacific American Medal of Honor recipients\" ; retrieved 2012-12-28. The words of Hayashi's citation explain: > Private Shizuya Hayashi distinguished himself by extraordinary heroism in > action on 29 November 1943, near Cerasuolo, Italy. During a flank assault on > high ground held by the enemy, Private Hayashi rose alone in the face of > grenade, rifle, and machine gun fire. Firing his automatic rifle from the > hip, he charged and overtook an enemy machine gun position, killing seven > men in the nest and two more as they fled. After his platoon advanced 200 > yards from this point, an enemy antiaircraft gun opened fire on the men. > Private Hayashi returned fire at the hostile position, killing nine of the > enemy, taking four prisoners, and forcing the remainder of the force to > withdraw from the hill. Private Hayashi’s extraordinary heroism and devotion > to duty are in keeping with the highest traditions of military service and > reflect great credit on him, his unit, and the United States Army.Gomez- > Granger, Julissa. (2008). Medal of Honor Recipients: 1979-2008, \"Hayashi, > Shizuya,\" p. 10 [PDF 14 of 44]; retrieved 2012-12-7. ==Related pages== * List of Medal of Honor recipients for World War II * List of Asian American Medal of Honor recipients == References == ==Other websites== * \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov * Category:1917 births Category:2008 deaths Category:Military people from Hawaii Category:United States Army Medal of Honor recipients Category:American people of World War II",
 "title": "Shizuya Hayashi"
}