{
 "id": "373507",
 "text": "Harold Lee Washington (April 15, 1922 - November 25, 1987) was an American lawyer and politician. He became the first African-American Mayor of Chicago, serving from 1983 until his death in 1987. Before, he was a member of the United States House of Representatives, representing Illinois's 1st congressional district. He was also a member of the Illinois State Senate and Illinois House of Representatives. Washington was born on April 15, 1922 in Chicago, Illinois. He studied at Roosevelt College and at Northwestern University School of Law. He was married to Nancy Dorothy Finch from 1942 until they divorced in 1950. Then he was engaged to Mary Ella Smith until his death in 1987. During his first term as mayor, Washington led the city through the \"council wars\" which were intense political disagreements between city hall and the city council. Despite this, Washington enjoyed positive approval among the city's residents. Washington died suddenly on November 25, 1987 in Chicago City Hall from a heart attack, aged 65. A 1993 survey of historians, political scientists and urban experts conducted by the University of Illinois at Chicago ranked Washington as the nineteenth-best American big-city mayor to have served between the years 1820 and 1993. The Harold Washington Library and Harold Washington College are named after him. ==References== ==Other websites== *\"The Legacy of Chicago's Harold Washington\", Cheryl Corley, All Things Considered, November 23, 2007. Accessed November 23, 2007. *Harold Washington on the Legacy of Richard J. Daley * A Latino Resource * Category:1922 births Category:1987 deaths Category:Burials at Oak Woods Cemetery Category:African-American lawyers Category:African-American military personnel Category:African-American politicians Category:American military personnel of World War II Category:Deaths from myocardial infarction Category:Mayors of Chicago Category:Democratic Party (United States) politicians Category:United States representatives from Illinois Category:Members of the Illinois General Assembly Category:Lawyers from Chicago",
 "title": "Harold Washington"
}