{
 "id": "373797",
 "text": "Sadao Munemori (born August 17, 1922-April 5, 1945) was a United States Army soldier.Tamashiro, Ben H. \"The Congressional Medal of Honor: Sadao Munemori,\" The Hawaii Herald, March 15, 1985; retrieved 2012-12-7. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (M-S)\" ; retrieved 2012-12-7. == Early life == Munemori was born in Los Angeles, California to Japanese immigrant parents. He is a Nisei, which means that he is a second generation Japanese-American.Niiya, Brian. (1993). \"Munemori, Sadao,\" Japanese American History: An A-To-Z Reference from 1868 to the Present, p. 241. During World War II, Munemori's parents and siblings were interned at the Manzanar concentration camp. ==Soldier== Two months after the Japanese attack on Pearl Harbor, he joined the US Army.U.S. National Archives and Records Administration (NARA), WWII Army Enlistment Record #30102563 (Munemori, Sadao S.); retrieved 2012-12-7. Munemori volunteered to be part of the all-Nisei 100th Infantry Battalion.Go for Broke National Education Center, \"Medal of Honor Recipient Private First Class Sadao S. Munemori\" ; retrieved 2012-12-7. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; retrieved 2012-12-7. For his actions in April 1945, he was the only Japanese American to be awarded the Medal of Honor during or immediately after World War II.\"Sadao S. Munemori\" at MiltaryTimes.com; as context, compare \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov ; retrieved 20121-12-24. ==Medal of Honor citation== Munemori’s Medal of Honor recognized his conduct in frontline fighting in northern Italy in 1945. Without help from others, he attacked two machine guns before smothering a grenade blast with his body. The words of Munemori's citation explain: > He fought with great gallantry and intrepidity near Seravezza, Italy. When > his unit was pinned down by grazing fire from the enemy's strong mountain > defense and command of the squad devolved on him with the wounding of its > regular leader, he made frontal, one-man attacks through direct fire and > knocked out two machine guns with grenades. Withdrawing under murderous fire > and showers of grenades from other enemy emplacements, he had nearly reached > a shell crater occupied by two of his men when an unexploded grenade bounced > on his helmet and rolled toward his helpless comrades. He arose into the > withering fire, dived for the missile and smothered its blast with his body. > By his swift, supremely heroic action Pfc. Munemori saved two of his men at > the cost of his own life and did much to clear the path for his company's > victorious advance. ==Namesake== Sadao Munemori is the namesake of a part of the California highway system, a ship, a building and an American Legion post. * Sadao S. Munemori Memorial Interchange between I-105 and I-405 highways in Los AngelesAoyagi-stom, Caroline. \"A Hometown Honor for Sadao Munemori?\" Pacific Citizen. April 18, 2008; \"California 1993-94 Senate Concurrent Resolution 41,\" September 9, 1994; retrieved 2012-12-7. * USNS Private Sadao S. Munemori (T-AP-190), a troop shipNaval Historical Center, Dictionary Of American Naval Fighting Ships, \"Private Sadao S. Munemori\" ; retrieved 2012-12-7. * Sadao S. Munemori Hall at the US Army Reserve Center in West Los Angeles\"Army Facility Memorializes WW II Hero,\" Los Angeles Times. June 13, 1993; retrieved 2012-12-7. * Sadao Munemori American Legion Post 321 in Los Angeles ==Related pages== * List of Medal of Honor recipients for World War II * List of Asian American Medal of Honor recipients * Posthumous recognition == References == ==Other websites == * * Image of Munemori Memorial Interchange in LA * Image of statue of Munemori at Pietrasanto Italy Category:1922 births Category:1945 deaths Category:People from Los Angeles Category:United States Army Medal of Honor recipients Category:American people of World War II Category:Military people from California",
 "title": "Sadao Munemori"
}