{
 "id": "373881",
 "text": "Genetically modified food (GM food) is food which has been produced using organisms that have been engineered genetically (GM organisms). GM food contains GM organisms. Common examples include maize, soybean, cotton and rapeseed. The first genetically modified food animal approved for sale is salmon. Commercial sale of genetically modified food began in 1994, when Calgene first marketed its delayed ripening tomato. Genetically modified foods include: soybean, corn, canola, rice, and cotton seed oil. The features of available and future crops include resistance to herbicides, insects, viruses, fungi, production of extra nutrients, faster growth, or some other beneficial purpose. GM livestock have also been experimentally developed. Research is being done on bacteria which would speed up making cheese. Genetically modified yeast could be used to make beer that has fewer calories.biotopics.co.uk: Genetically modified microorganisms and food production == Regulation == The approaches taken by governments to assess and manage the development and release of genetically modified organisms (GMOs) vary from country to country. Some of the most marked differences are between the USA and Europe. The US regulatory policy is the Coordinated Framework for Regulation of Biotechnology. The policy has three main principles: # UK policy will focus on the product of genetic modification (GM) techniques, not the process itself # Only regulation grounded in verifiable scientific risks will be tolerated, and # GM products are on similar enough to existing products that existing laws are sufficient to review the products.Emily Marden, Risk and Regulation: U.S. Regulatory Policy on genetically modified food and agriculture, 44 B.C.L. Rev. 733 (2003) European Union have the strictest GMO rules in the world.Davison, John. 2010. GM plants: Science, politics and EC regulations. Plant Science 178(2):94–98 All GMOs, and irradiated food, are considered \"new food\" and subject to extensive, case-by-case, science based food evaluation by the European Food Safety Authority (EFSA). The criteria for authorization has four broad categories: \"safety,\" \"freedom of choice,\" \"labelling,\" and \"traceability\".GMO Compass: The European Regulatory System. Retrieved 28 July 2012. However many scientists think current studies are not good enough to be sure that genetically modified food is safe. === Labelling === One of the key issues is whether GM products should be labelled. A study into voluntary labelling in South Africa found that 31% of products labelled as GMO-free had a GM content above 1.0%.Botha, Gerda M. and Viljoen, Christopher D. 2009. South Africa: a case study for voluntary GM labelling. Food Chemistry 112(4):1060–1064 In Canada and the US labelling of GM food is voluntary. In Europe all food (including processed food) or cattle feed which contains greater than 0.9% of approved GMOs must be labelled. Japan, Malaysia, New Zealand, and Australia require labelling so people can choose between foods that have genetically modified, ordinary or organic origins. Gibson, Johanna 2006. Consumer protection: Consumer strategies and the European Market in genetically modified foods. Nw. J. Tech. & Intell. Prop. 5, 176. Free access == Examples == Most vegetable oil used in the US is produced from GM crops.Michelle Simon 2011 Food Safety News. ConAgra sued over GMO ’100% natural’ cooking oils Vegetable oil is sold directly to consumers as cooking oil, margarine, and shortening, and is used in prepared foods. As for soybeans, about 95% of the US crop is GM, and about 85% of the world's soybean crop is processed into soybean meal and vegetable oil. The bulk of the soybean crop is grown for oil production, with the high-protein defatted and \"toasted\" soy meal used as for farm animal food and dog food. 98% of the US soybean crop is used for feeding farm animals.David Bennett, Southeast Farm Press, 2003. World soybean consumption quickens A smaller percentage of soybeans are used directly for human food. === Potato blight === Researchers have made genetically modified potatoes which are resistant to potato blight. That disease caused the Irish potato famine in the 1840s. EU approval is needed before commercial growing of this GM crop can take place.McGrath, Matt 2014. Genetically modified potatoes 'resist late blight'. BBC News Science & Technology. == References == == Other sources == * List of approved genetically modified plants * Sheldon Krimsky.An Illusory Consensus behind GMO Health Assessment Category:Genetic engineering Category:Agriculture Category:Food and drink",
 "title": "Genetically modified food"
}