{
 "id": "373931",
 "text": "Signs and symptoms are two words that doctors use to describe how a medical problem causes changes in a person's body. == Signs == A sign is a change in the body that can be heard, seen, felt, or smelled by a doctor. A sign may also be shown on medical tests like X-rays or urine blood tests. For example: * A doctor can hear changes in breathing sounds when he listens to a person's lungs with a stethoscope. These changes can be a sign of different breathing problems. *A doctor can see that a person has a bruise or swelling. These are signs of an injury to the body. *A doctor can feel that a bone seems crooked or broken. This may be a sign of a bone fracture. *A doctor can smell that a person's breath smells like fruit. This can be a sign of very high blood sugar. *A doctor can see on an X-ray that a bone is broken. This is a sign of a bone fracture. == Symptoms == A symptom is a change in the body that cannot be seen, heard, felt, or smelled by a doctor. It also cannot be shown on medical tests. A symptom is something that only the person having the symptom can see, hear, feel, or smell. For example: * Before a migraine headache, a person may see flashing lights that are not really there. Nobody but that person can see the lights, and they will not show up on any medical tests. This is called an aura, and it is a symptom of a migraine * Sometimes, people will hear a ringing sound, like a phone ringing, in their ears. This can be a symptom of ear problems or hearing problems * Pain is a common symptom. A doctor cannot see, hear, or feel pain, or see it on tests. Only the person having the pain can feel it If a person is having pain, like a headache or a stomach ache, there is no way for the doctor to know unless the person tells the doctor. * Sometimes, before a person has a seizure, they may smell something that is not really there. Nobody but that person can smell it. This can be a symptom of an aura, warning that a seizure is going to happen == Signs and symptoms often happen together == Often, medical problems cause both signs and symptoms. For example: This Medical Problem... Can Cause These Signs... And Can Cause These Symptoms Flu * Cough (can be heard) * Vomiting (can be seen) * Fever (can be shown on a thermometer) * Pain all over the body * Nausea * Feeling very tired Low blood sugar * Cold sweating (can be felt) * Pale skin (can be seen) * Low blood sugar on a blood sugar test * Headache * Feeling dizzy * Feeling very tired Asthma attack * Wheezing when the lungs are listened to with a stethoscope (can be heard) * Feeling tightness in the chest * Having chest pain ==References==",
 "title": "Signs and symptoms"
}