{
 "id": "373981",
 "text": "Besse Berry Cooper (August 26, 1896 – December 4, 2012) was an American woman who was, the oldest living person in the United States since Eunice Sanborn's death on January 31, 2011 and also believed to be the world's oldest living person. However, Brazilian woman Maria Gomes Valentim was on May 18, 2011 confirmed to be older, which made her the oldest living person from Frenchwoman Eugénie Blanchard's death on November 4, 2010 and Cooper the oldest living person from her death on June 21, 2011, just 18 days before her 115th birthday. == Personal life == Besse Cooper was born as Besse Berry Brown in Sullivan County in Tennessee on August 26, 1896. She was the third of eight children of Richard Brown and Angeline Berry. She graduated from East Tennessee State Normal School (now East Tennessee State University) in 1916. While a college student, she joined the so-called first wave of feminism in the United States, becoming a suffragette, joining the struggle for women's right to vote. The dedication of suffragettes like Besse, after some four decades of struggle by a fierce women's movement, resulted in the United States finally recognizing women as having the same right to vote as men, awarding them equal voting rights in all states. Besse's home state of Tennessee would prove the state which tipped the balance, being the 36th state needed to ratify and thus approve the Nineteenth Amendment be added to the U.S. Constitution in August 1920. She worked as a school teacher until the time of America's entrance to World War I in 1917, when she moved to Georgia. She taught in the Walton County town of Between until 1929, being the principal teacher in a one-room schoolhouse. She was married to Luther Cooper from 1924 until his death in 1963 with whom she had four children. She also had eleven grandchildren, thirteen great-grandchildren and two great-great- grandchildren. In her final years, Cooper lived in a nursing home in Monroe, Georgia.World's oldest woman Besse Cooper dies at 116 in Georgia nursing home In August 2012, a bridge in Between was named the \"Besse Brown Cooper Bridge\" in her honour. == Longevity records == * November 8, 2006 – Cooper, aged 110 years, 74 days, entered the Gerontology Research Group's list for Guinness World Records.Table C - World's Oldest Person (WOP) Titleholders Since 1955 Gerontology Research Group * January 19, 2009 – Beatrice Farve died. Cooper, aged 112 years, 146 days, became the oldest living person in the U.S. state of Georgia. * June 21, 2011 – Maria Gomes Valentim died. Cooper, aged 114 years, 299 days, became the world's oldest living person. * August 9, 2011 – Cooper, aged 114 years, 348 days, became the longest-lived person born in 1896, surpassing Maria Gomes Valentim. * December 2, 2011 – Chiyono Hasegawa died. Cooper, aged 115 years, 98 days, became the last verified surviving person born in 1896. * August 26, 2012 – Cooper became the 8th verified person in history to reach age 116, and the first to do so since Elizabeth Bolden, who celebrated her 116th birthday on August 15, 2006. She is also one of the 3 people to have lost the title of the oldest person but later regained it, the other two being Jeanne Calment and Elizabeth Bolden. == Death == Cooper died of respiratory failure on December 4, 2012 at age 116 years, 100 days, and was succeeded as the oldest living person by Italian-born Americanwoman Dina Manfredini, who died just 13 days later. With Cooper's death, Gertrude Weaver become the oldest living person born in the United States. == Related pages == * List of American supercentenarians == References == Category:1896 births Category:2012 deaths Category:American supercentenarians Category:American feminists Category:People from Tennessee",
 "title": "Besse Cooper"
}