{
 "id": "374076",
 "text": "A gondola lift is a type of public transport. It consists of cabins fixed to a cable that travels between two stations. The cable is moved around by motors at the stations and is lifted from the ground by towers. A gondola lift is similar to a cable car, and sometimes it is called like that. However, unlike a cable car a gondola lift contains many cabins that go around at the same time. Usually the cabins slow down at the stations to allow passengers to get in or out. Gondola lifts are mainly used in skiing resorts to transport tourists up and down the mountains. == List of incidents == The National Ski Areas Association reports 0.138 deaths per 100 million miles transported compared to 1.23 for cars. * October 22, 1979: One person was killed and 17 other injured when two gondolas fell from the \"Swiss Sky Ride\" at the Texas State Fair. Winds gusting to caused three cars to collide and two fell on midway games below the cable. * January 29, 1983: The Singapore Cable Car disaster, which saw seven people killed when two cabins plunged into the sea after the cableway was hit by a Panamanian-registered oil rig being towed. * September 5, 2005: Nine people died and ten were injured when a concrete block was accidentally dropped by a construction helicopter in Sölden, Austria. Hundreds had to be evacuated from the lift. * July 13, 2006: Five people, including a three-year-old girl, were injured after two cable cars collided and one crashed to the ground. The accident took place at the Nevis Range, near Fort William in northwest Scotland. There were no fatalities and the gondola was deemed safe for operation shortly after the accident. * 2006: Two gondolas collide During a trial run of the Ngong Ping 360, leaving 200 volunteers stranded high above Hong Kong for several hours. * February 18, 2007: A gondola car derailed from the cable at Ski Apache in New Mexico and rolled backwards hitting another car. Eight people were involved in the crash but only two suffered minor injuries. * March 2, 2008: A man fell out of a gondola in Chamonix and died, perhaps after he and one of his friends leaned on and broke the plexiglass window. * December 16, 2008: Ten people were injured (none seriously), and others left stranded after a tower supporting the Excalibur gondola lift on Blackcomb mountain collapsed, at the Whistler Blackcomb ski resort in Whistler, Canada. * January 31, 2011: A ten-year-old boy fell from a gondola in Hafjell, Norway. He suffered minor injuries. * Cologne Cable Car closed in July 2017 due to an accident. * August 2019: Someone cut the cable of the Sea to Sky Gondola in Squamish, British Columbia. No one was hurt but the gondola’s cars were destroyed when they crashed to the ground. The tourist attraction was closed for repairs. == Related pages == *Cable car *Chairlift ==References== Category:Vehicles Category:Ski lifts",
 "title": "Gondola lift"
}