{
 "id": "37435",
 "text": "== The most important events == * February 22 – Native American Quadequine shows popcorn to English colonists. * March 22 – Massachusetts Bay Colony makes having cards, dice and gaming tables against the law. * June 6 – Swedish warships leave Stockholm to go to Germany. * June 26 – July 6 – Swedish troops controlled by Gustavus Adolphus go to Pomerania, Germany to help Protestants. * July 6 – Success the last ship of the Winthrop Fleet, returns safely at Salem harbor, MBC. * September 17 – The city of Boston, Massachusetts is first started. * September 24 – The first ship of de Sauce's emigrants arrive at Southampton Hundred on the James River. * November 10-November 11 – Day of Dupes – Marie de Medicis' tries to stop Richelieu but it does not work. * Johann Heinrich Alsted's Encyclopaedia is published (printed as a book people can buy). * The first story of the Childes Tomb is published. * Many people from Great Britain go to live in Paramaribo, Suriname for the first time. * Puritan pamphleteer Dr. Alexander Leighton publishes \"Zion's Plea Against Prelacy: An Appeal to Parliament.\" The book was against Anglican bishops, in London. He was sentenced by Archbishop William Laud's High Commission Court to being whipped in public, branding and having his ears cut off. == Births == * January 11 – John Rogers the American President of Harvard (died 1684) * February 19 – Shivaji the person who started the Maratha Empire (died 1680) * April 28 – Charles Cotton the English poet (died 1687) * May 29 – King Charles II of England, Scotland and Ireland (died 1685) * August 1 – Thomas Clifford, 1st Baron Clifford of Chudleigh the English statesman (died 1673) * October 14 – Sophia of Hanover the heir (next person to become queeen) of Great Britain (died 1714) * October – John Tillotson the Archbishop of Canterbury (died 1694) * November 24 – Etienne Baluze a French scholar (died 1718) * November 27 – Archduke Sigismund Francis of Austria the regent of Tyrol and Further Austria (died 1665) == Deaths == *January 26 – Henry Briggs the English mathematician (born 1556) *February 12 – Fynes Moryson the English traveler and writer (born 1566) *February 26 – William Brade the English composer (born 1560) *April 29 – Agrippa d'Aubigné the French poet and soldier (born 1552) *July 16 – Charles Emmanuel I, Duke of Savoy (born 1562) *September 17 – Thomas Lake the English statesman (born 1567) *September 18 – Melchior Klesl the Austrian cardinal and statesman (born 1552) *September 20 – Claudio Saracini the Italian composer (born 1586) *September 25 – Ambrosio Spinola, marqués de los Balbases the Spanish general (born 1569) *November 15 – Johannes Kepler the German astronomer (born 1571) *November 19 – Johann Schein the German composer (born 1586)",
 "title": "1630"
}