{
 "id": "37430",
 "text": "The Tragedy of Julius Caesar is a play by William Shakespeare. It is about the assassination of Julius Caesar in 44 BC. Shakespeare based his play on stories in Plutarch's Life of Brutus and Life of Caesar. The play was probably written in 1599. It was first published in 1623 in the First Folio, a collection of all of Shakespeare's plays. The play was probably one of Shakespeare's first plays to be performed at the Globe Theatre.Evans, G. Blakemore: \"The Riverside Shakespeare\", page 1100, Houghton Mifflin Company, 1974. The theatre had just been built. A Swiss traveller saw a tragedy about Julius Caesar at a London theatre on 21 September 1599. This was probably Shakespeare's play. The play has been made into movies three times. In a 1950 movie, Charlton Heston played Mark Antony. In a 1953 movie, James Mason played Brutus and Marlon Brando played Antony. In a 1970 movie, Jason Robards played Brutus, Charlton Heston played Antony again, and John Gielgud played Caesar. == References == == Other websites == *Text of Julius Caesar, fully edited by John Cox, as well as original-spelling text, facsimiles of the 1623 Folio text, and other resources, at the Internet Shakespeare Editions *Julius Caesar Navigator Includes Shakespeare's text with notes, line numbers, and a search function. *No Fear Shakespeare Includes the play line by line with interpretation. *All Julius Caesar Provides a summary of the play, background on Shakespeare and Julius Caesar, including historical background on Julius Caesar, and a character analysis of Caesar. * Julius Caesar – searchable, indexed e-text *Julius Caesar – from Project Gutenberg *Julius Caesar – by The Tech *Julius Caesar – Searchable and scene-indexed version. *Julius Caesar in modern English *Lesson plans for Julius Caesar at Web English Teacher *Quicksilver Radio Theater adaptation of \"Julius Caesar\", which may be heard online, at PRX.org (Public Radio Exchange). * Julius Caesar study guide, themes, quotes, analysis, multimedia, & teaching guide Category:Plays by William Shakespeare Category:1590s plays",
 "title": "Julius Caesar (play)"
}