{
 "id": "37438",
 "text": "Paul Biya (born Paul Barthélemy Biya'a bi Mvondo; 13 February 1933) is a Cameroonian politician who is the second president of Cameroon since 1982. Biya was born in the village of Mvomeka'a in Cameroon. At that time, the country was called French Cameroon. He studied in France, at the Sorbonne and the Institut d'études politiques de Paris, both in Paris. He graduated in 1961 with a bachelor's degree in public law and a diploma in international relations. After graduating, Biya returned to Cameroon and worked in the government. In 1975, the President Ahmadou Ahidjo gave the job of Prime Minister to Biya. When President Ahidjo resigned on November 6, 1982, Biya became president of the country. Shortly afterwards, Ahidjo and Biya began feuding, and Ahidjo was forced to leave Cameroon. Biya was elected as the President of Cameroon in 1984, 1988, 1992, 1997 and 2004, but other parties only have been allowed to enter the elections since 1992. The results many of these election results have been called fraudulent (achieved through unfair or illegal ways). Many international organizations, including Amnesty International, have criticized Biya's government for restricting the freedom of the people of Cameroon. These issues include control of the media (newspapers and radio and television stations) and violations of human rights. Biya's supporters point to the country's stability and high literacy rate. Biya is currently the longest-ruling non-royal leader in the world and the oldest ruler in Sub-Saharan Africa after Robert Mugabe stepped down during the 2017 Zimbabwean coup d'état.The fall of Robert Mugabe sends an ominous signal to Africa’s dictators, Washington Post, 2017-11-22 ==References== ==Other websites== * bbc.com's country profile on Cameroon * Paul Biya's Biography (from the 2004 election) * Amnesty International press release from 17/25/97 Category:1933 births Category:Living people Category:Presidents of Cameroon Category:Prime ministers of Cameroon Category:Current national leaders Category:Dictators Category:Alumni of the Institut d'études politiques de Paris",
 "title": "Paul Biya"
}