{
 "id": "37458",
 "text": "The 1260s is a decade. It started on 1 January 1260 and ended on 31 December 1269. It is distinct from the decade known as the 127th decade which began on January 1, 1261 and ended on December 31, 1270. Kublai Khan became the supreme leader (a title for their leader) of the Mongol Empire and moved his capital to Beijing. He was at war with the southern Chinese Song Dynasty. The Mongol Empire lost some of its battles. The first time it lost a battle with Kublai Khan as the leader was in Palestine when fighting the Mamluks of Egypt. The Empire also lost in the Caucasus. The Mamluks were led by their new sultan Baibars. The Mamluks were soon were more in control in the Middle East because they took control of a number of crusader states and also stopped the Mongol attacks from happening as much. The Empire of Nicaea took control of Constantinople and also the Latin Empire so it again became the Byzantine Empire. In Europe there was problems in politics. Arguments about who was the owner of what land let to many wars in the continent. In England there was the Second Barons' War. This was a civil war between the aristocracy who did not like how the King named Henry III behaved. This was because the King wanted absolute monarchy. King Otakar II of Bohemia became the most important prince in Europe. He got more land by fighting wars and also when his family died some of their land became his. Iceland and Greenland knew of and recognised the overlordship of Norway but when the Norse invaded Scotland the Scottish were able to stop them and they made peace. In Spain the Reconquista was still happening and several important cities were captured again from the Moors. The way the pope was elected was made better. The parliaments of Ireland and England met for the first time. Several important cultural achievements were made in the decade. Roger Bacon published important scientific work named Opus Majus. Also, Thomas Aquinas published Summa contra Gentiles. Important pices of architecture and sculptures were made in cathedrals in Europe. These include the Cathedral of Chartres and Nicola Pisano's pulpits for the Duomo di Siena and Pisa's Baptistery. In religion, the Sukhothai kingdom in Thailand adopted Buddhism as its official religion. In Europe anti-Semitism became worse because several authorities made laws which said that Jewish people must wear yellow badges so people knew who they were. Many Jewish people were killed in England and the Talmud was attacked and censored by the Catholic Church. == War and politics == === Europe === ==== War and peace ==== ===== North and West Europe ===== * 1260 – The Baltic Samogatians and Curonians won the Battle of Durbe against the Teutonic Knights. * 1263 – October – King Alexander III of Scotland won the Battle of Largs against the Viking armada (group of ships to fight a war) that was sent by King Haakon IV of Norway. * 1263 – The chieftains of the eastern part of Iceland become the last to people to say that they that is was their duty to be loyal to the Norwegian king. This made the Icelandic Commonwealth stop and also stopped the Icelandic civil war. * 1266 – The war between Scotland and Norway ended because King Alexander III of Scotland and King Magnus VI of Norway agreed to the Treaty of Perth. ===== Central and South Europe ===== * 1260 – September 4 – The armed forces of King Manfred of Sicily with the Ghibellines won a battle agains the Guelphs at Monte Aperto. * 1260 – War started in the Valais (which is now in Switzerland) as the Bishopry of Sion defends against an invasion by the County of Savoy. * 1263 – Genoa takes the city of Chania on Crete from the Venetians. * 1264 – The Thuringian War of Succession stops. * 1266 – February 26 – In the Battle of Benevento an army led by Charles (Count of Anjou) won a battle against an armed force from Germany and Sicily whose leader was King Manfred of Sicily. Manfred is killed in the battle and Pope Clement IV makes Charles king of Sicily and Naples. ===== Iberian Peninsula (the land that is mostly Spain and Portugal) ===== * 1263 – King James I of Aragon wins a battle against the Moors and takes back control of Crevillente during the Reconquista. * 1264 – In Spain, King James I of Aragon takes back control the cities of Orihuela and Elx in Alicante from the Moors. This ends more than 500 years of Islamic rule. * 1265 – King Alfonso X of Castile takes control the city of Alicante, Spain from the Moors during the Reconquista. * 1267 – King Afonso III of Portugal and King Alfonso X of Castile sign a treaty to agree that the Guadiana River is the southern border between Portugal and Spain. This is the same as the border now. ===== Southeast Europe ===== * 1260 – King Otakar II of Bohemia takes control of Styria after winning the Battle of Kressenbrunn. King Bela IV of Hungary was in control. * 1261 – Bela IV of Hungary stops the Tatars coming to fight to take control of Hungry. * 1268 – King Stephen V of Hungary starts a war with Bulgaria. ===== England: The Second Barons' War ===== * 1261 – King Henry III of England gets a papal bull which lets him leave the Provisions of Oxford. This is part of the reason for civil war happening between the monarch and the aristocracy of England. * 1264 – Before May – Second Barons' War is an English civil war and it begins in this year. * 1264 – May 12 to May 14 – The Battle of Lewes is fought between Simon de Montfort, 6th Earl of Leicester and King Henry III of England in Sussex. At the end of the battle de Montfort's forces capture both King Henry and his brother (who is the future King Edward I) This made de Montfort the \"uncrowned king of England\" because he was now in control of England but people did not make him a real King. * 1265 – January 20 – In Westminster the first English parliament holds its first meeting in the Palace of Westminster. The Palace of Westminster is now known as the Houses of Parliament. * 1265 – Before August – Future King Edward I escapes from be held hostage by Simon de Montfort. * 1265 – August 4 – The Battle of Evesham is fought in Worcestershire. The army of Edward won against the rebellious barons. the rebellious barons were led by Simon de Montfort. The army killed de Montford and several of the people that helped him. Sometimes the event is though of as the death of chivalry in England. * 1266 – October – The war gets better because persons that supported Simon de Montfort offer to make peace with the king. This is named the Dictum of Kenilworth. * 1267 – The Second Barons' War stops. The rebels and King Henry III of England agree to peace as was asked for in the Dictum of Kenilworth. ==== Political places ==== * 1260 – The Duchy of Saxony is divided into Saxony-Lauenberg and Saxony-Wittenberg. This is the end of the first Saxon state. * 1261 – The persons of Greenland accept the overlordship of the King of Norway. * 1262 – Strasbourg becomes an Imperial Free City of the Holy Roman Empire. * 1262 – The Icelandic Commonwealth enters into a treaty joining them with Norway and accept the Norwegian King Haakon IV as the person in control. * 1264 – The state of Hesse becomes independent from Thuringia. It is then free state of the Holy Roman Empire. * 1265 – The Isle of Man is controlled by Scotland for ten years. * 1267 – Emperor Baldwin II of Constantinople gives the Principality of Achaea to King Charles I of Sicily as a gift in the Treaty of Viterbo. He hopes his gift will make Charles help him return the Latin Empire to how it was before. * 1268 – The county of Wernigerode becomes a vassal state of the margrave of Brandenburg. == Births == * 1264 – Pope Clement V (d. 1314) * 1265 – May 14 – Dante Alighieri an Italian poet (d. 1321) == Deaths == * 1263 – November 14 – Alexander Nevsky the Grand Prince of Novgorod and Vladimir * 1264 – October 2 – Pope Urban IV * 1265 – February 8 – Hulagu Khan the Mongol khan (b. 1217) * 1265 – August 4 – Simon de Montfort, 6th Earl of Leicester * 1266 – Berke the khan of the Golden Horde of the Mongol Empire * 1266 – Birger Jarl the Swedish regent and person who started Stockholm * 1268 – October 29 – Conradin the duke of Swabia and King of Jerusalem and Sicily (b. 1252)",
 "title": "1260s"
}