{
 "id": "374827",
 "text": "The 1988 United States presidential election happened on November 8, 1988. George H. W. Bush, the Republican candidate and Vice President of the United States, won the election. He defeated the Democratic candidate, Governor Michael Dukakis of Massachusetts. This presidential election was the first since 1948, as well as the most recent one to date, in which a political party won a third presidential election in a row. This also remains the most recent in which a candidate won over 400 electoral votes. Since the 1988 election, no candidate has managed to equal or surpass Bush's number of electoral votes won or popular vote percentage. Bush ran an aggressive campaign taking advantage of a good economy, a stable international stage, and President Ronald Reagan's popularity. Meanwhile, Dukakis's campaign suffered from several miscues, including failure to defend from Bush's attacks. This allowed Bush to win with a substantial margin of the popular vote; while winning the Electoral College by a landslide. Bush won the election by 426 electoral votes. Governor of Massachusetts Michael Dukakis got 111 electoral votes. Lloyd Bentsen got 1 electoral vote by a West Virginia faithless elector. ==Candidates== ===Democratic Party=== Democratic candidates: *Michael Dukakis, governor of Massachusetts *Jesse Jackson, reverend and civil rights leader from South Carolina *Al Gore, U.S. senator from Tennessee *Dick Gephardt, U.S. representative from Missouri *Paul Simon, U.S. senator from Illinois *Gary Hart, former U.S. senator from Colorado *Bruce Babbitt, former governor of Arizona *Joe Biden, U.S. senator from Delaware *Lyndon LaRouche, activist from Virginia *David Duke, activist from Louisiana *James Traficant, U.S. representative from Ohio *Douglas Applegate, U.S. representative from Ohio *Andy Martin, perennial candidate from Connecticut ====Candidates Gallery==== File:Dukakis1988rally cropped.jpg|Governor Michael Dukakis of Massachusetts File:JesseJackson.png|Reverend Jesse Jackson of South Carolina File:Sengore.jpg|Senator Al Gore of Tennessee File:Dick Gephardt.jpg|Representative Dick Gephardt of Missouri |Senator Paul Simon of Illinois File:GaryHart.jpg|Former Senator Gary Hart of Colorado File:Bruce_babbitt.jpg|Former Governor Bruce Babbitt of Arizona File:Joebiden2.png|Senator Joe Biden of Delaware File:Lyndon LaRouche.jpg|Lyndon LaRouche of Virginia |David Duke of Louisiana File:James Traficant 99th Congress 1985.jpg|Representative Jim Traficant of Ohio File:AndyMartin.jpg|Andy Martin of Connecticut ===Republican Party=== Republican candidates: *George H. W. Bush, Vice President of the United States from Texas *Bob Dole, U.S. senator from Kansas *Pat Robertson, televangelist from Virginia *Jack Kemp, U.S. representative from New York *Pete du Pont, Governor of Delaware *Alexander Haig, former Secretary of State from Pennsylvania *Ben Fernandez, former Special Ambassador to Paraguay from California *Paul Laxalt, former Senator from Nevada *Donald Rumsfeld, former Secretary of Defense from Illinois *Harold E. Stassen, former Governor of Minnesota *Isabell Masters, perennial candidate from Kansas ====Candidates Gallery==== File:1988 Bush.jpg| Vice President George H. W. Bush of Texas File:Bob Dole, photo portrait, head and shoulders, facing front, February 9, 1982.jpg|Senator Bob Dole of Kansas File:Pat Robertson speaks about the national deficit (cropped).jpg|Televangelist Pat Robertson of Virginia File:Jack Kemp official portrait.jpg|Representative Jack Kemp of New York File:petedupont.jpg|Governor Pete du Pont of Delaware File:Secretary of State Alexander Haig.jpg|Former Secretary of State Alexander Haig of Virginia File:Paul Laxalt (colorized).jpg|Former Senator Paul Laxalt of Nevada File:Donald Rumsfeld Defenselink.jpg|Former Secretary of Defense Donald Rumsfeld of Illinois File:Harold Stassen.jpg|Former Governor Harold E. Stassen of Minnesota ==References== Category:1988 in the United States Category:1988 elections 1988",
 "title": "1988 United States presidential election"
}