{
 "id": "374992",
 "text": "The 1968 United States presidential election happened on November 5, 1968. Richard Nixon, the Republican candidate and former vice president of the United States, won the election. He defeated the incumbent vice president, Hubert Humphrey, the Incumbent Vice President and a Democrat, and George Wallace, the Governor of Alabama, who ran as a member of the American Independent Party Incumbent United States President Lyndon B. Johnson was able to run, but decided against it. On March 31, 1968, Johnson withdrew his nomination and he said, \"I shall not seek, and I will not accept, the nomination of my party for another term as your President\". The incumbent Attorney General Robert F. Kennedy, brother of former United States President John F. Kennedy was a serious presidential candidate before his assassination on June 5, 1968 by Sirhan Sirhan in Los Angeles after winning the California and South Dakota primaries for the Democratic nomination for President of the United States. Richard Nixon won the election by 301 electoral votes. Hubert Humphrey got 191 electoral votes. George Wallace received 46 electoral votes and a faithless elector in North Carolina voted Wallace and running mate Curtis LeMay. Humphrey did not win the south because he was very liberal and favored civil rights. The only southern state he won was Texas (which he won narrowly). ==Candidates== ===Democratic Party=== *Democratic candidates: **Hubert Humphrey, U.S. vice president from Minnesota **Robert F. Kennedy, U.S. senator from New York, brother of former President John F. Kennedy, and former Attorney General (assassinated) **Eugene McCarthy, U.S. senator from Minnesota **George McGovern, U.S. senator from South Dakota ====Candidates gallery==== Image:Hubert Humphrey crop.jpg|Vice President Hubert Humphrey of Minnesota Image:Robert F Kennedy crop.jpg|Senator Robert F. Kennedy of New York Image:EugeneMcCarthy.jpg|Senator Eugene McCarthy of Minnesota Image:GeorgeStanleyMcGovern.png|Senator George McGovern of South Dakota of Texas ===Republican Party=== *Republican candidates: **Richard Nixon, former Vice President and 1960 presidential nominee from New York ** Nelson Rockefeller, Governor of New York and candidate for the 1960 and 1964 nominations ** Ronald Reagan, Governor of California ** George Romney, Governor of Michigan and candidate 1964 nomination:: Romney was also the father of Gov. Mitt Romney, who ran for president in 2012 ** Harold Stassen, former Governor of Minnesota and candidate for the 1948, 1952 and 1964 nominations ====Candidates gallery==== File:RichardNixon.png|Former Vice President Richard Nixon of New York File:Ronald Reagan 1969.jpg|Governor Ronald Reagan of California File:NelsonRockefeller.png|Governor Nelson Rockefeller of New York File:George W. Romney official portrait.jpg|Governor George Romney of Michigan File:Harold Stassen.jpg|Former Governor Harold Stassen of Minnesota == References == ==Other websites== * 1968 Presidential General Election Results 1968 Category:Ronald Reagan Category:Richard Nixon Category:1968 in the United States",
 "title": "1968 United States presidential election"
}