{
 "id": "375110",
 "text": "Ipse dixit is a Latin phrase that means \"He, himself, said it\". In logic, ipse dixit is known as the bare assertion fallacy.\"Bare assertion fallacy\" at Findthedata.org; retrieved 2012-12-10. One form of the fallacy may be summarized as follows: :* Fact 1: X claims statement A. :* Fact 2: X claims that X is not lying. :* Conclusion: Therefore, A is true or false or whatever X claims it is. ==History== In the De natura deorum (On the Nature of the Gods), the Roman writer Cicero (106–43 BC) made the word ipse dixit as an error in law.Poliziano, Angelo. (2010). Angelo Poliziano's Lamia: Text, Translation, and Introductory Studies, p. 26; excerpt, \"In Cicero's De natura deorum, as well as in other sources, the phrase “Ipse dixit” pointed to the notion that Pythagoras's disciples would use that short phrase as justification for adopting a position: if the master had said it, it was enough for them and there was no need to argue further.\" Cicero was describing the students of Pythagoras.Benthem, Jeremy. (1838). Works of Jeremy Bentham, Vol. 1, Part 2, p. 467; excerpt, \"Ipse dixit is an expression that took its rise from the ... the disciples of Pythagoras\" Jeremy Bentham changed the term ipse-dixit into the word ipse-dixitism.Benthem, Jeremy. (1834). Deontology; or, The science of morality, Vol. 1, p. 323; excerpt, \"ipsedixitism ... comes down to us from an antique and high authority, —-it is the principle recognised (so Cicero informs us) by the disciples of Pythagoras. Ipse (he, the master, Pythagoras), ipse dixit, -—he has said it; the master has said that it is so; therefore, say the disciples of the illustrious sage, therefore so it is.\" He created this term to apply to political arguments.Benthem, Jeremy. (1838). Works of Jeremy Bentham, p. 192; excerpt, \"... it is not a mere ipse dixit that will warrant us to give credit for utility to institutions, in which not the least trace of utility is discernible.\" ==Examples== > \"When I use a word,\" Humpty Dumpty said, in rather a scornful tone, \"it > means just what I choose it to mean—neither more nor less.\" > \"The question is,\" said Alice, \"whether you can make words mean so many > different things.\" > \"The question is,\" said Humpty Dumpty, \"which is to be master~~ > ~~that's all.\"Caroll, Lewis. (2000). The Annotated Alice: Alice's Adventures > in Wonderland & Through the Looking Glass, p. 213. ==Issues== A bare assertion denies that an issue is debatable. In other words, that is just the way it is.Sebranek, Patrick et al. (2011). Write 1, p. 173. In Alice in Wonderland, the problem of ipse dixit is explained by example.Filan, Patrick J. \"Opinions Must Be Based On Facts: Unlike Humpty Dumpty, witnesses can't make unproven assertion,\" Connecticut Law Journal, Vol. 37, No. 46 (November 14, 2011) citing Through the Looking Glass; retrieved 2012-12-11. The most basic way to distort an issue is to deny that it exists.VanderMey, Randall et al. (2011). Comp, p. 183. Ipse dixit is used to identify and describe a dogmatic statement which the speaker expects the listener to accept as valid.Whitney, William Dwight. (1906). \"Ipse dixit,\" The Century dictionary and cyclopedia, pp. 379-380. Ipse dixit is a sort of arbitrary dogmatism.Westbrook, Robert B. \"John Dewey and American Democracy,\" p. 359. The only proof we have of the fact is that this person said it.\"Ipse dixit at Law.com; retrieved 2012-12-10. The theory of ipse dixit involves that an unproven statement that the speaker claims is true because it was uttered by \"an authority\" on the subject. The opinion may carry some weight based solely on the authority or standing of the person said it.\"Ipse dixit\" at Nolo.com; retrieved 2012-12-10. ==Applications== ===United States=== Ipse dixit is made specific in American law. For example, in a 1997 case, the US Supreme Court recognized the problem of \"opinion evidence which is connected to existing data only by the ipse dixit of an expert\".Filan, citing General Electric Co. v. Joiner, 522 U.S. 136, 137; 118 S.Ct. 512; 139 L.Ed.2d 508 (1997). ==Related pages== * Truthiness * False dilemma * Intensity of preference ==References== Category:Logical fallacies Category:Latin words and phrases",
 "title": "Ipse dixit"
}