{
 "id": "375234",
 "text": "Mega, whose letters stand for Red Televisiva Megavisión, is a Chilean television network. == Programs == Program Actors/TV presenters Meganoticias Matinal (2019-present) Meganoticias Actualiza (2019-present) Meganoticias Prime (2019-present) Mucho gusto (2001-present) === Previous programs === Program Actors/TV presenters Eres mi tesoro (TV shows, 2015-present) María José Bello and Álvaro Morales Papá a la Deriva (Telenovela 2015-present) Gonzalo Valenzuela, María Gracia Omegna and Ignacio Achurra Morandé con compañía (2001-present) Kike Morandé The Switch (TV shows, 2015) Karla Constant Bicitantes (TV shows, 2015-present) Luis Andaur Más vale tarde (Late show, 2013-present) Álvaro Escobar Ahora Noticias Matinal (2013-2019) Catalina Edwards (2013-2019) and José Luis Reppening (2013-present) Ahora Noticias Mediodía (2013-2019) Catalina Edwards (2013-2019) and José Luis Reppening (2013-present) Ahora Noticias Central (2013-2019) Soledad Onetto (2013-2019) Aqui en vivo Rafael Cavada Destilando Amor (Telenovela from Televisa, 2007) Angélica Rivera and Eduardo Yáñez A Todo o Nada (2013-present) Francisco Kaminski Trepadores (Reality show, 2013) Pablo Mackenna La Tempestad (Telenovela from Televisa, 2013) William Levy, Jimena Navarrete and Iván Sánchez Secreto a voces (SaV) (TV shows, 2011-2014) Mario Velasco and Pamela Díaz Lie to me (TV series from Fox) Pasión de primera Sábado por la noche Francisco Kaminski Los Tuins (TV shows, 2013) Fernando Godoy, Ernesto Belloni and Catalina Olcay Meganoticias Matinal (2002-2013) Macarena Puigrredón (2011-2013) and Francisco Eguiluz (2012-2013) Meganoticias Tarde (1990-2013) Maritxu Sangroniz (2011-2013) Meganoticias Central (1990-2013) Catalina Edwards (2006-2007, 2011-2013) and José Luis Reppening (2006-2008, 2011-2013) El Cartel de los Sapos (TV series from Caracol Televisión) A viva voz (TV show, 2013) Macarena Venegas and Dr. Claudio Aldunate Amores verdaderos (Telenovela from Televisa, 2012-2013) Érika Buenfil, Eduardo Yáñez, Eiza González and Sebastián Rulli Por ella soy Eva (Telenovela from Televisa, 2012) Jaime Camil, Lucero, Marcelo Córdoba, Mariana Seoane, Jesús Ochoa and Paty Navidad En pauta (2012-2013) Soledad Onetto Pablo Escobar, el patrón del mal (TV series from Caracol Televisión) BKN (TV series from Mega, 2003-2012) Casado con hijos (Sitcom from Mega, 2006-2008) Fernando Larraín, Javiera Contador, Dayana Amigo, Fernando Godoy, Carmen Gloria Bresky and Marcial Tagle. Desfachatados Javiera Contador, Fernando Godoy, Kurt Cabrera and Pablo Zamora Xtreme Dance Fernando Godoy and Javiera Suárez Violetta (Series from Disney Channel) Coliseo romano José Miguel Viñuela (2011-2012) and Álvaro Salas (2012-present) Amor Bravío (Telenovela from Televisa) DR TV Dr. Claudio Aldunate Yo soy Luis Jara Papá otra vez Marcial Tagle and Sandra O'Ryan Mandiola y compañía La que no podía amar (Televisa) Ana Brenda Contreras, Jorge Salinas and José Ron Abismo de Pasión (Televisa) Angelique Boyer, David Zepeda, Mark Tacher, Sabine Moussier, Alejandro Camacho, Blanca Guerra and Livia Brito Maldita Lorene Prieto Décibel 110 ¿Quién quiere casarse con mi hijo? Vivi Kreutzberger La Reina del Sur (Series from Telemundo/Antena 3 2011) Kate del Castillo Veredicto Macarena Venegas Salas de Juego Álvaro Salas and Mariana Derderián La Liga ==Other websites== *Official site Mega Category:1990 establishments in Chile",
 "title": "Mega (Chile)"
}