{
 "id": "37520",
 "text": "Western Australia is one of the eight states and territories of Australia. It is the largest state in Australia, with about 33% of the land area of the mainland. It has a population of nearly three million people. Over 90% live in the south-west. Its capital city is Perth. WA is the second-largest country sub-division in the world, only exceeded by the Russian Sakha Republic. Western Australia federated with the other British colonies in Australia in 1901. Today, Western Australia's economy is mainly mining, oil and gas, services and construction. The state produces 46% of Australia's exports.Curran, Enda 2012. Western Australia Plans Sovereign Wealth Fund. The Wall Street Journal. Western Australia is the largest iron ore producer in the world.US Geological Survey. Minerals.usgs.gov. 2014. Retrieved 11 June 2016. Basically, the mountains in W.A. are made of iron ore which precipitated out of the ocean over three billion years ago when oxygen entered the atmosphere in large amounts. == Geography == Most of Western Australia (WA) is made of very ancient rocks from the Proterozoic era. These rocks include a great deal of iron ore, which is exported to Japan and elsewhere. Other metals such as nickel, copper, lithium and gold are also found in the area. The area was connected to India and Africa in the Neoproterozoic era, and stayed connected until the break-up of Gondwana about 150 to 50 million years ago (mya). Unfortunately, the soils have low amounts of phosphorus and nitrogen, and so are not very fertile. == History == === Before 1900 === In 1827, a captain in the British Navy, James Stirling, sailed up the Swan River and liked what he saw. He told the British government, and in 1829, Britain sent settlers to Western Australia. On June 18, 1829, the new Governor James Stirling claimed all the land of Australia that was not already included in New South Wales as the new colony of Western Australia. In 1868, Britain stopped sending convicts. === Federation === Until 1901, Australia did not exist it was six separate colonies governed by Britain. This worked well when everybody was British and there were only a few people. But now there were thousands of people and many of them had never been to Britain, an eight-month journey away by sea. They decided to join to form one new country, the Commonwealth of Australia. This was called Federation, and happened in 1901. Western Australia did not want to join, because the other colonies were thousands of kilometres away. They joined when the other colonies promised to build a railway to Perth. === Succession referendum === In 1933, the Western Australian people did not want to be part of Australia any more. The main reason was that Western Australia had to give money to the rest of Australia to pay for national services like the army and education, but they were not seeing the benefits. As well, the Great Depression had happened and many people were homeless and poor all over the world, including Western Australia. The government decided to hold a referendum and ask the people whether they wanted to start their own country, and 68% said yes. However, the rest of Australia and the British Parliament stopped it. === Modern history === After that, things got back to normal. The Great Depression ended and the Second World War began, and many Western Australians went off to fight. Some of them had to stay here, because in 1942, the Japanese bombed the town of Broome in the far north. When the war ended, a lot of people from Europe who had lost their homes in the war came to Western Australia, as land was still very cheap. In the 1960s, iron ore was found in the north of the state, which could be made into steel. This discovery made Western Australia very rich, and iron ore still brings in a lot of money. Perth grew from being a small town to being a big city in just 30 years. By 1985 it had over a million people and is still getting bigger today. Due to the mining boom in the state, there has been an influx of people from the Eastern states to take advantage of the higher wages in industry. == Related pages == * Australia * Pilbara * Shark Bay == References == == Other websites == * Postcode Tool - Western Australia",
 "title": "Western Australia"
}