{
 "id": "375379",
 "text": "College Scholastic Ability Test, known as Su-Neung, is a national standardized university entrance test in South Korea. The test is held on second Thursday of November of every year. The Korea Institute for Curriculum and Evaluation (KICE) conducts and supervises the test. A person who wants to go to university must take the test. Its result is accepted by most of universities in Korea. It is a typical criterion to judge whether the person is allowed to go to a university. ==Sections of the test== The test has five sections - Korean language, Math, English language, Social Studies/Sciences/Vocational Education and Foreign language/Chinese Character. The applicants can choose the number of the domain which they would take, after considering of applicant's ability, aptitude, demand of the university which they apply to. The Korean and English section are common to all applicants. However, if the applicant decides to take Math, Society/Science/Vocation test and Foreign language/Chinese Character, he or she must choose the subtype of the test. For Math section, there are two subtypes to choose - \"A\" or \"B\". The type \"A\" consists of two parts - Math 1, Basic Calculus and Statistics. Type \"B\" consists of four parts - Math 1, Math 2, Geometry and Vector, Integral calculus and Statistics. For Social Studies/Sciences/Vocational Education section, applicants have to choose one category from the three and each has several subtypes. *In Social Studies section, applicants have to choose at most two subjects from ten subjects (Ethics & Thought, Ethics for Daily Life, Korean History, World History, East Asian History, Korean Geography, World Geography, Law and Politics, Economics, Society and Culture). *In Sciences section, it is necessary to choose at most two subjects from eight subjects (Physics Ⅰ, Chemistry Ⅰ, Biology Ⅰ, Earth Science Ⅰ, Physics Ⅱ, Chemistry Ⅱ, Biology Ⅱ, Earth Science Ⅱ). *In Vocational Education section, it is allowed to choose one subject from ten subjects (Understanding of Agriculture, Techniques in Basic Agriculture, Introduction to Industry, Basic Drafting, Commercial Economy, Principles of Accounting, General Oceanography, Fishery and Shipping Information Processing, Human Development, General Computers). Finally, the applicants who take the Foreign language/Chinese Character test have to decide one subject out of nine (German I, French I, Spanish I, Chinese I, Japanese I, Russian I, Arabic I, Basic Vietnamese, Chinese Characters and Classics). ==Timetable== The first test, Korean, starts at 8:40 A.M. The last test, Foreign language/Chinese Character test, ends at 5:00 P.M.. For disabled people, there is some extra time. Blind people are given 1.5 time prolonged time than normal applicants in every section, weak-eyed applicants and applicants who suffer from cerebral palsy are given 20 extra minutes in every sections. Period Test Subject Time 1st Korean 08:40 ~ 10: 00 (80 minutes) 2nd Math 10:30 ~ 12:10 (100 minutes) 3rd English 13:10 ~ 14:20 (70 minutes) 4th Korean History 14:50 ~ 15:20 5th Social Studies/Sciences/Vocational Education section 1 15:30 ~ 16:00 (30 mintues each) Social Studies/Sciences/Vocational Education section 2 16:02 ~ 16:32 (including paper changing time) 6th Foreign language/Chinese Character 17:00 ~ 17:30 (30 minutes) Category:Examinations Category:Education in South Korea",
 "title": "College Scholastic Ability Test"
}