{
 "id": "375374",
 "text": "Independence Square or Maidan Nezalezhnosti is the national public square of Ukraine. The square is located in Kyiv, the capital of Ukraine. Most of the buildings in the square were ruined in World War II. Today the square is a center of public performances and political activity. The Kilometer Zero of Ukraine is located in the square. It is located between Khreshchatyk, Borys Hrinchenko, Sofiyivska, Mala Zhytomyrska, Mykhailivska, Kostyolna streets, Heroes of the Heavenly Hundred Street, Architect Gorodetsky Street, and Taras Shevchenko Lane. == History == Until the end of the 10th century, this place, like the whole present Khreshchatyk, was called Perevisysche and was a swamp. Where Sofiyska Street now begins, there was the Lyadska Gate, which led to the Upper Town. In the 18th century, stone fortress walls and the so-called Pechersk Gate were built on the territory of the Maidan, which existed until 1833. In the late XVIII — early XIX century was a wasteland — the so-called Goat Swamp. Defensive ramparts approached it, the edge of which was filled with a dam and a water mill. In the 1730s, the first wooden houses appeared here, and in the 1850s — stone houses. In 1869 the place was named Khreshchatyk Square. Until 1871 there was a market on the square, circus performances and festivities took place. In 1851, the first large brick building was erected on the square — the building of the Noble Assembly (architect Oleksandr Beretti; now the building of the Federation of Trade Unions of Ukraine). In 1876, after the construction of the City Duma according to the project of the architect Alexander Shile (destroyed in September 1941 by Soviet radio-controlled mines), the square was renamed the Duma. === 20th century === 1912 — The Ginzburg Skyscraper, the first skyscraper in Ukraine, is built near the square. September 1913 — a monument to Peter Stolypin was in front of the City Duma building (destroyed on March 16 (29), 1917). February 1919 — the Soviet commandant's office of the city, headed by Mykola Shchors, worked in building 2. March 1919 — the area was named Soviet. 1922 — A monument to Karl Marx is erected on the square (sculptor Joseph Tchaikov; dismantled in the 1930s). 1935 — Soviet Square was renamed Kalinin Square (in honor of the 60th anniversary of Mikhail Kalinin), in 1944 this name was confirmed. In 1941–1943, during the Nazi occupation, the Maidan was named Duma and Maidan on September 19. 1961 — 16—story hotel \"Moscow\" was opened (in 2001 it was renamed to hotel \"Ukraine\"). On December 17, 1976, the Kalinin Square metro station was opened (since October 17, 1977, the October Revolution Square, and since August 26, 1991, the Independence Square). 1977 — a monument to the Great October Socialist Revolution (dismantled in 1991) was erected on the square. After the reconstruction, it was named the October Revolution Square, in honor of the October Revolution of 1917, the name of Kalinin Square was given to the current St. Michael's Square). In 1989, the columns of the portal of the Kyiv Main Post Office collapsed, killing 11 people. In 1990, a student hunger strike took place in the square, which later became known as the Granite Revolution. === 21st century === August 1991 — the square received its modern name in honor of the proclamation of Ukraine as state independence. It should be noted that the name Independence Square has been used in everyday life since 1990, this name was recorded during the Granite Revolution in October 1990. 2001 — the square was reconstructed (a number of monuments were erected, in particular, the Independence Monument, the Globus underground store was opened, and a large fountain, the so-called Roulette, was liquidated). In the winter of 2000—2001, protest actions \"Ukraine without Kuchma\" took place on the Maidan. 2004 — the square became the center of the Orange Revolution. 2010 — there were protests against the Tax Code. 2013 — November 21, the 9th anniversary of the Orange Revolution, Euromaidan began — a mass protest against the suspension of the state's course of association with the European Union. These events later escalated into the Revolution of Dignity, which sparked a wave of demonstrations and protests against the Yanukovych regime, the largest since Ukraine's independence. On February 18—20, 2014, a violent confrontation took place on the Maidan, as a result of which there were significant casualties among the protesters, the Maidan was severely damaged; in addition, on the night of February 19, the House of Trade Unions of Ukraine was burned down. The Euromaidan tent camp was dismantled only on August 9. == Other websites == * Майдан Незалежності in Wiki—Encyclopedia Kiev == References == Category:Monuments and memorials Category:Buildings and structures in Kyiv",
 "title": "Maidan Nezalezhnosti"
}