{
 "id": "375315",
 "text": "There are four fundamental forces, sometimes called fundamental interactions. The forces are called fundamental because there is no simpler way for physicists to understand what the forces do or how they do it (their action). They are called interactions because the action of one object on another is matched by a reaction from the other. We feel the effects of gravity and electromagnetism all the time. * The gravitational force is described by Einstein's general theory of relativity and is understood to be due to the curvature of spacetime by the mass of matter. * The electromagnetic force is due to electric charge. Charge causes electric force and movement of charge causes magnetic force. The strong and weak interactions are forces at the smallest distances and explain nuclear interactions. *The strong force binds protons and neutrons together and also keeps the nuclei of atoms together. *The weak force causes beta decay. A complete description of the forces requires advanced physics. The Standard Model explains three of these forces (electromagnetism, the weak force, and the strong force). Most physicists think that these become a single force under very high temperatures. This idea is known as the grand unification theory.Franklin, Allan; Fischbach, Ephraim 2016. The rise and fall of the fifth force: discovery, pursuit, and justification in modern physics. 2nd ed, Springer. ISBN 978-3319284125 ==From the future to the past== In the future, new forces may explain dark energy and dark matter. We may also get a Theory of everything that explains the four known fundamental forces. Even if we first unify the three forces of the Standard Model, we may continue to think of those forces as fundamental. This is what happened when theoretical physicists unified electromagnetism and the weak interaction with electroweak theory. *Once nuclear force was explained by color charge, it was seen not to be fundamental. *Nuclear force was a theory to explain how photons could stay close together in the nucleus when their like electric charge would make them move apart, if not overcome by a stronger force. == References == Category:Force",
 "title": "Fundamental force"
}