{
 "id": "37557",
 "text": "Archie Comics is a comic book company in the United States. Its most famous and popular title is \"Archie\". This comic book is about a teenage boy named Archie Andrews and his friends: Betty Cooper, Veronica Lodge, Reggie Mantle, Sabrina Spellman, and Jughead Jones. Every character in this comic book is fictional, and they were created by Bob Montana. All characters were based on people he knew in Haverhill, Massachusetts. Other popular titles by Archie Comics include \"Sabrina the Teenage Witch\", \"Sonic the Hedgehog\", and Josie and the Pussycats. Archie's first appearance was in Pep Comics #22 on December 22, 1941. The first edition was drawn by Montana and written by Vic Bloom. Archie lives in a small town named \"Riverdale\", in a state that is not known. However, in the early years of the Archie comics, Riverdale was in Massachusetts. This is known because a character Mr. Lodge was a senator for that state, but this is no longer part of the story. ==Characters== ===The Archie Gang: Main characters=== *Archibald \"Archie\" Andrews, main character, a typical teenage boy with a great interest in dating, who sometimes can be clumsy. *Elizabeth \"Betty\" Cooper, the girl-next-door, very sweet. *Veronica \"Ronnie/Ron\" Lodge, the rich, sometimes nice and sometimes snobbish girl. *Forsythe Pendleton \"Jughead\" Jones III, - Archie's best friend. Jughead is sarcastic, obsessed with food, lazy, and apathetic towards girls. *Reginald \"Reggie\" Mantle, a conceited practical joker. He occasionally dates Veronica and sometimes, although very rarely, goes on dates with Betty. He is also obsessed with another girl, Midge, which usually gets him in trouble with Moose, who beats up Reggie. ===Parents (of the main characters)=== Of all the parents, Veronica's father and Archie's parents appear most often. * Mr. Hiram Lodge, Veronica's rich father often hates meeting Archie because Archie is clumsy and causes him trouble. * Mr. Frederick \"Fred\" Andrews, Archie's father is pear-shaped, old-fashioned, and balding. * Mrs. Mary Andrews, Archie's typical all-American suburban mother. ===The Faculty=== * Mr. Waldo Weatherbee, the school principal, popularly referred to as 'The Bee'. He is often a victim of Archie's clumsiness, and he often punishes Archie by keeping him after school. * Miss Geraldine Grundy, a teacher at Riverdale High who is usually shown as an English teacher. She also teaches every subject except gym or chemistry. Most students consider her a \"nice\" or \"good\" teacher. She is old with white hair. * Miss Bernice Beazley, the grouchy school cafeteria cook. No one likes her food except Jughead. She is not well liked by the students. Category:Comics publishing companies Category:American comic books",
 "title": "Archie Comics"
}