{
 "id": "375656",
 "text": "The Heroes of Olympus is a series of five adventure and fantasy novels written by Rick Riordan, an American author. It follows the Percy Jackson & the Olympians series and is followed by The Trials of Apollo series and the Daughter of the Deep. The stories are based around Greek and Roman mythology, it describes the efforts of seven demigod heroes to prevent the earth goddess Gaea from waking up with their ship called Argo ll. The first book in the series was released on October 12, 2012 and the last one was released on October 7, 2014. The series begins with The Lost Hero, and ends with The Blood of Olympus. Some characters from the Percy Jackson & the Olympians series return, including Percy Jackson, Annabeth Chase, Clarisse, Chiron, Camp Half- Blood campers, and several others. There are also some new characters. Some are Leo Valdez, son of Hephaestus, Jason Grace, son of Jupiter (Zeus as a Roman) and Piper McLean daughter of Aphrodite and movie star Tristan McLean who is kidnapped in The Lost Hero. Riordan based some of his series on The Golden Fleece and The Heroes Who Lived Before Achilles by Padraic Colum. == Books in the series == # The Lost Hero # The Son of Neptune # The Mark of Athena # The House of Hades # The Blood of Olympus In addition to these books, Rick Riordan has also written a supplementary book named The Demigod Diaries which was released on August 14, 2012. == Main Characters == *Percy Jackson: A seventeen-year-old Greek demigod and a son of Poseidon. *Annabeth Chase: A seventeen-year-old Greek demigod and a daughter of Athena. *Piper McLean: A fifteen-year-old Greek demigod and a daughter of Aphrodite. She has the power to charmspeak, which means she can talk people into doing things but it does not always work. *Leo Valdez: A fifteen-year-old Greek demigod and a son of Hephaestus. He has the power to manipulate and produce fire. *Jason Grace: A sixteen-year-old Roman demigod and a son of Jupiter. It is revealed in The Lost Hero that he is the brother of Thalia Grace, a Greek demigod. *Frank Zhang: A-sixteen-year-old Roman demigod and a son of Mars. He is also related to Poseidon on his mother's side. He has the ability to change his form. *Hazel Levesque: A thirteen-year-old Roman demigod and a daughter of Pluto. She has the ability to manipulate precious metals and stones. *Gleeson Hedge: A satyr from Camp Half-Blood who is tasked to accompany the seven demigods on their quest. == References == Category:2010s books",
 "title": "The Heroes of Olympus"
}