{
 "id": "375607",
 "text": "William Kenzo Nakamura (January 21, 1922-July 4, 1944) was a United States Army soldier. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (M-S)\" ; retrieved 2012-12-7. == Early life == Nakamura was born in Seattle to Japanese immigrant parents.Hicks, Erin. \"Our Back Pages: Final Honors,\" Columns (University of Washington Alumni Magazine). June 2004; retrieved 2012-12-7. He is a Nisei, which means that he is a second generation Japanese-American. His family was interned in Minidoka in Idaho during World War II.Hicks, \"Our Back Pages\"; U.S. National Archives and Records Administration (NARA), Japanese-American Internee Data File, 1942-1946 #15457D (Nakamura, William) ; retrieved 2012-12-7. ==Soldier== Nakamura joined the US Army in July 1943.NARA, WWII Army Enlistment Record #39918272 (Nakamura, William K.); retrieved 2012-12-7. Nakamura volunteered to be part of the all- Nisei 442nd Regimental Combat Team.Go for Broke National Education Center, \"Medal of Honor Recipient Private First Class Willaim K. Nakamura\" ; retrieved 2012-12-7. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; retrieved 2012-12-7. For his actions in July 1944, Nakamura was awarded the Army's second-highest decoration, the Distinguished Service Cross (DSC). In the 1990s, there was a review of service records of Asian Americans who received the DSC during World War II. Nakamura's award was upgraded to the Medal of Honor. In a ceremony at the White House on June 21, 2000, his family was presented with his medal by President Bill Clinton. Twenty-one other Asian Americans also received the medal during the ceremony, but only seven of them were still alive. \"21 Asian American World War II Vets to Get Medal of Honor\" at University of Hawaii Digital History ; retrieved 2012-12-27. ==Medal of Honor citation== Nakamura's Medal of Honor recognized his conduct in frontline fighting in central Italy in 1944. He silenced a machine gun nest and he stayed behind to provide covering fire as his unit withdrew.CMH, \"Asian Pacific American Medal of Honor recipients\" ; retrieved 2012-12-28. The words of Nakamura's citation explain: > Private First Class William K. Nakamura distinguished himself by > extraordinary heroism in action on 4 July 1944, near Castellina, Italy. > During a fierce firefight, Private First Class Nakamura's platoon became > pinned down by enemy machine gun fire from a concealed position. On his own > initiative, Private First Class Nakamura crawled 20 yards toward the hostile > nest with fire from the enemy machine gun barely missing him. Reaching a > point 15 yards from the position, he quickly raised himself to a kneeling > position and threw four hand grenades, killing or wounding at least three of > the enemy soldiers. The enemy weapon silenced, Private First Class Nakamura > crawled back to his platoon, which was able to continue its advance as a > result of his courageous action. Later, his company was ordered to withdraw > from the crest of a hill so that a mortar barrage could be placed on the > ridge. On his own initiative, Private First Class Nakamura remained in > position to cover his comrades' withdrawal. While moving toward the safety > of a wooded draw, his platoon became pinned down by deadly machine gun fire. > Crawling to a point from which he could fire on the enemy position, Private > First Class Nakamura quickly and accurately fired his weapon to pin down the > enemy machine gunners. His platoon was then able to withdraw to safety > without further casualties. Private First Class Nakamura was killed during > this heroic stand. Private First Class Nakamura's extraordinary heroism and > devotion to duty are in keeping with the highest traditions of military > service and reflect great credit on him, his unit, and the United States > Army.Gomez-Granger, Julissa. (2008). Medal of Honor Recipients: 1979-2008, > \"Nakamura, William K.,\" p. 15 [PDF 19 of 44]; retrieved 2012-12-7. ==Nakesake== Nakamura is the namesake of the William Kenzo Nakamura United States Courthouse in Seattle. ==Related pages== * List of Medal of Honor recipients for World War II * List of Asian American Medal of Honor recipients * Posthumous recognition == References == ==Other websites== * \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov * Category:1922 births Category:1944 deaths Category:People from Seattle Category:United States Army Medal of Honor recipients Category:American people of World War II Category:Military people from Washington (state)",
 "title": "William Nakamura"
}