{
 "id": "375687",
 "text": "Play is a word used in psychology and ethology to describe voluntary activities associated with recreational pleasure and enjoyment,Garvey C. 1990. Play. Cambridge, MA: Harvard University Press. and with early learning in mammals. Although everyone understands what the word means, it is extremely difficult to define.Reber, Aurthur S. & Emily S. 2001. The Penguin dictionary of psychology. 3rd ed, Penguin Books, p543. Play is usually connected with children and their juvenile-level activities, but it can also be a useful adult activity, and occurs among other higher-functioning animals as well. Many of the most prominent researchers in the field of psychology (including William James, Sigmund Freud, Carl Jung, Jean Piaget and Lev Vygotsky) have viewed play as endemic to the human species. Play may be frivolous; but it may be serious. A player can be intently focused on his or her objective (in the zone), particularly when play is structured and goal-oriented, as in a game. Accordingly, play can range from relaxed, free-spirited and spontaneous through frivolous to planned or even compulsive.Huizinga J. 1955. Homo Ludens; a study of the play-element in culture. Boston, Beacon Press == Function of play == There have been two major reviews of research into animal play, and both have said it is extremely difficult to define.Fagan, Robert 1981. Animal play behavior. Oxford University Press. Burghardt, Gordon M. 2005. The genesis of animal play: testing the limits. MIT Press. Play is almost universal in very young mammals, and also in some groups of birds such as parrots and ravens. Therefore, it must have a function, but what is that function? It is definitely not immediate survival. In fact, the young animals of many species may risk their lives playing.preface Yet, since it survives in so many species, it must have survival value. That, as Fagan says, is a paradox. :\"The problem of defining play is one of the greatest challenges facing neurology, behavioral biology, psychology, education and the social sciences generally\". Burghardt.preface The main idea is that play is basically useful, and so it can be explained by the normal process of evolution by natural selection. This was proposed by Karl Groos over a century ago,Groos, Karl 1898. The play of animals (transl. E.L. Baldwin). New York: Appleton. and it is still the majority explanation. == Identifying play == Researchers know the difficulty of deciding when a behaviour is play, and when it is not. Konrad Lorenz developed a criterion. To be called \"play\", the behaviour should be really distinct from the response in the normal situation. Thus, play-fighting of young pups is quite different from serious dog-fights, not just a lesser degree of the same thing. :\"The main difference is... the maintenance of all social inhibitions in play, even in the most boisterous and passionate types of play. Above all, the inhibition against genuine biting is maintained, whereas in serious fights, even in the slightest disputes, this inhibition is at once lifted\".Lonrenz, Konrad 1970. Studies in animal and human behaviour. vol 1, Methusen, London, p164. == Children's play == Play can take the form of improvisation or pretend, performance, mimicry, games, sports. Play can be structured, with goals and rules; when this is the case, the play is a \"game\". Other play is unstructured, without rules. The gurus of children's games were Iona and Peter Opie, who collected them in England in the post-World War II period.Opie, Iona and Peter 1959. The lore and language of schoolchildren. Oxford University Press.Opie, Iona and Peter 1969. Children's games in street and playground. Oxford University PressAvery, Gillian and Julia Briggs (eds) 1989. Children and their books: a celebration of the work of Iona and Peter Opie. Oxford University Press.Particularly in infancy and toddlerhood, caregivers can provide scaffolded play, a concept developed by Jerome Bruner, without imposing explicit rules. This form of guided play is crucial for developing emotional self-regulationYogman, M., Garner, A., Hutchinson, J., Hirsh-Pasek, K., & Golinkoff, R. M. (2018). The power of play: A pediatric role in enhancing development in young children. *Pediatrics*, 142(3), e20182058. [doi:10.1542/peds.2018-2058](https://doi.org/10.1542/peds.2018-2058) especially when supported by age-appropriate guidance. Techniques like baby talk and joint attention help guide the interaction, enhancing the child’s engagement and focus. However, as children grow, particularly after age five, research suggests that excessive guidance may limit their independent exploration and hinder learning outcomes.Lazonder, A. W., & Harmsen, R. (2016). Meta-analysis of inquiry-based learning: Effects of guidance. *Educational Research Review*, 19, 17-32. [doi:10.1016/j.edurev.2016.03.002](https://doi.org/10.1016/j.edurev.2016.03.002) Often sports with specific rules will take place within designated play spaces, such as sports fields. Other play spaces may be playgrounds with equipment and structures to promote active and social play. Some play spaces may be indoors, as with museums, or family entertainment centres. The National Institute for Play describes seven play types: # Attunement play, which makes a connection, such as between newborn and mother. # Body play, in which an infant explores the ways in which his or her body works and interacts with the world. Examples: making funny sounds or discovering what happens in a fall. # Object play, such as playing with toys, banging pots and pans, handling physical things in ways that use curiosity. # Social play, play which involves others in activities. Examples: tumbling, making faces, and making connections with other children. # Imaginative play (also called \"pretend\" or \"fantasy\"). The child invents scenarios from their imagination. They act in their dream world, for example, as a kind of princess or pirate play.Piaget J. 1962. Play, dreams and imitation (Vol. 24). New York: Norton # Storytelling play (or narrative), the play of learning and language that develops intellect. They may play a parent reading aloud to a child, or a child retelling the story in his or her own words. # Creative play. This means play with imagination to create a higher mental state. For example, an adult might experiment to find a new way to use a musical instrument; or, as Einstein was known to do, a person might wonder about things which are not yet known and play with unproven ideas as a bridge to discover new knowledge. Piaget had a general framework for play: # games of mastery: e.g. building, copying, designing # games with rules: e.g. marbles, war games, hide-and-seek games # games of make-believe and fantasy Separate from self-initiated play, play therapy is used as a clinical application of play aimed at treating children who suffer from trauma, emotional issues and other problems.Auerbach, Stevanne 2004. Dr. Toy's smart play smart toys: how to raise a child with a high PQ (play quotient). == References == Category:Human behavior Category:Ethology",
 "title": "Play (activity)"
}