{
 "id": "375879",
 "text": "Adlai Ewing Stevenson II (February 5, 1900 – July 14, 1965) was an American politician. He ran against Dwight D. Eisenhower in the 1952 and 1956 elections, but he lost both times. He was the grandson of Vice President Adlai E. Stevenson. He was also the 31st Governor of Illinois from 1949 to 1953. He became United States Ambassador to the United Nations from 1961 until his death in 1965. ==Early life== Stevenson was born in Los Angeles, California to Lewis Stevenson and Helen Davis Stevenson. His maternal great-grandfather Jesse W. Fell was a close friend and campaign manager for Abraham Lincoln. His oldest son Adlai Stevenson III became a United States Senator from Illinois from 1970 until 1981. He grew up in Bloomington, Illinois. He studied at Bloomington High School until his junior year. After that he went at University High School in Normal, Illinois. Then he studied at Princeton University and Northwestern University Law School. ==Political career== He ran for president six times, in 1940, 1944, 1948, 1952, 1956, and 1960, losing the Democrat primaries to Franklin D. Roosevelt, Harry S. Truman and John F. Kennedy. He also lost the 1952 and 1956 elections to Republican Dwight D. Eisenhower. Stevenson was Governor of Illinois from January 10, 1949-January 12, 1953. As governor, Stevenson presided over the introdution of a wide range of progressive social reforms.Illinois major party platforms: 1900-1964, by Nowlan, James Dunlap, 1966, P.341-343 ==Personal life== He married Ellen Borden in 1928 and divorced in 1949. Stevenson is a second cousin, once removed of actor McLean Stevenson. His son is former Illinois Senator Adlai Stevenson III. ==After the 1952 and 1956 elections== In 1953, he was elected a Fellow of the American Academy of Arts and Sciences. In 1957 he went back to law practice. He was employed part-time by Encyclopædia Britannica. ==1960 election== Stevenson tried to run for the nomination in the 1960 election. He lost to Senator John F. Kennedy. Stevenson refused to give the nomination address to John F. Kennedy. After Kennedy won the nomination, Stevenson campaigned for him. ==United States Ambassador to the United Nations== 5th United States Ambassador to the United Nations In office 1961-1965 President John F. Kennedy Lyndon B. Johnson Secretary-General Dag Hammarskjöld U Thant Predecessor James J. Wadsworth Successor Arthur Goldberg He was appointed Ambassador to the United Nations in 1961. Stevenson's most well- known moments happened during the Cuban Missile Crisis when he gave a presentation at an emergency session of the Security Council on October 25, 1962. ==Death and funeral== Stevenson suffered a heart attack on the afternoon and died later on July 14, 1965 in London of heart failure. The funeral in Bloomington, Illinois Unitarian Church was attended by President Lyndon B. Johnson and Vice President Hubert Humphrey and Supreme Court Chief Justice Earl Warren. ==References== ==Other websites== * Adlai Stevenson at Spartacus Educational Category:1900 births Category:1965 deaths Category:Deaths from myocardial infarction Category:1960 United States presidential candidates Category:United States Ambassadors to the United Nations Category:Politicians from Illinois Category:Politicians from California Category:Democratic Party (United States) politicians Category:Governors of Illinois Category:American Christians Category:People from Bloomington, Illinois Category:People from Normal, Illinois",
 "title": "Adlai Stevenson II"
}