{
 "id": "375891",
 "text": "Mara Elizabeth Wilson (born-July 24, 1987 in Los Angeles, California) is an American actress and playwright. She was born in Los Angeles. She currently acts on stages and has participated in voices in series and the web. She is best known for her acting in movies as a child. Her best known movies include: Mrs. Doubtfire (1993), Matilda (1996) and Lily Stone in Thomas and the Magic Railroad (2000). She came out as bisexual in June 2016.Mara Wilson comes out as bisexual ==Filmography== === Screen roles === Film Year Title Role Notes 1993 Mrs. Doubtfire Natalie \"Nattie\" Hillard 1994 Miracle on 34th Street Susan Walker 1994 A Time to Heal Barbara Barton TV film 1996 Matilda Matilda Wormwood 1997 A Simple Wish Anabel Greening 1999 Balloon Farm Willow Johnson TV film 2000 Thomas and the Magic Railroad Lily Stone Television Year Title Role Notes 1993 Melrose Place Nicole \"Nikki\" Petrova Recurring, 5 episodes 1996 Pearl Samantha Stein Episode: \"The Tutor\" 1999 Batman Beyond Tamara (voice) Episode: \"Mind Games\" 2016 Broad City Waitress Episode: \"Burning Bridges\" 2016 BoJack Horseman Jill Pill (voice) Recurring, 4 episodes, Season 3 2018–19 Big Hero 6: The Series Liv Amara/Diane \"Di\" Amara (voice) Recurring Web series Year Title Role Notes 2012 Nostalgia Critic Herself Episode: \"A Simple Wish\" 2012 Nostalgia Chick Herself Episode: \"Matilda\", also writer 2012 Demo Reel Donnie DuPre's wife (voice) Episode: \"Lost in Translation (Bromance Version)\" 2012 Shut Up and Talk Herself Episode: \"Guest: Mara Wilson\" 2012 Missed Connection Bitty Episode: \"Bad Dates\" 2013 Welcome to Night Vale Faceless Old Woman (voice) 10 episodes 2014 Keith and The Girl Herself Episode: \"2002: Boobs\" 2014 Nostalgia Chick Herself Episode: \"Nostalgic Foods of Yore\" 2014 Amy Poehler's Smart Girls Herself Episode: \"The In Too Steep Tea Party\" 2014 Maven of the Eventide Herself Pumpktoberfest Vlogs, Episodes 5 & 12 2014 I Don't Even Own a Television Herself Episode: \"016 — Covert Conception (w/ Mara Wilson)\" 2015 Keith and The Girl Herself Episode: \"2147: Gang Dick\" 2015 Gilmore Guys Herself Episode 4.21 2015 That's the Show with Danny Herself Episode: \"117: The One with Mara Wilson\" 2015, 2017 I Don't Even Own a Television Herself Episodes: \"026: Treacherous Love (w/ Mara Wilson)\", \"081: I'm With the Band (w/ Mara Wilson)\" 2016 Mouth Time with Reductress Ruth Hrorgen Mouth Time LIVE! With Mara Wilson 2019 Passenger List N/A Writer of \"Cyberspace\" (episode 5) 2020 Helluva Boss Mrs. Mayberry Episode: \"Murder Family\" 2020 Our Popcorn Movie Dystopia - Some More News: The Movie Matilda Cody Web movie 2020 The George Lucas Talk Show Herself May the AR Be LI$$ You Arli$$ marathon fundraiser; The George Lucas Holiday Special 2021 You Are Good Herself Episode: Hocus Pocus with Mara Wilson 2022 Ollie & Scoops Claudia Grimson / The Creepy Girl (voice) 2 episodes (#9 \"Vinnie Video\" and #10 \"A Night at Claudia's\") === Stage roles === *A Midsummer Night's Dream (2004) * Cinderella (2005) * Weren't You That Girl? (2009) * What Are You Afraid Of? (2014) ==References== Category:1987 births Category:Living people Category:Actors from Burbank, California Category:American child actors Category:American movie actors Category:American stage actors Category:American television actors Category:Bisexual people Category:Jewish American actors Category:LGBT actors Category:LGBT people from California Category:LGBT playwrights Category:Writers from Los Angeles County, California Category:American bloggers",
 "title": "Mara Wilson"
}