{
 "id": "375999",
 "text": "Bill Henry \"Willie\" Apiata VC (born 28 June 1972- ) is a New Zealand soldier. He is best known for receiving the Victoria Cross because of his actions in the war in Afghanistan.Imperial War Museum, \"Facts and figures about the Victoria Cross and George Cross\"; retrieved 2012-12-16. ==Early life== Apiata was born in Mangakino, New Zealand. \"Willie Apiata - humble Kiwi hero\" at NewZealand.com; retrieved 2012-12-16. He is Maori \"Who is Willie Apiata?\" at TangataWhenua.com ; retrieved 2012-12-17. ==Soldier== Apiata was a soldier in the New Zealand Special Air Service (NZSAS). For his actions in July 2004, Apiata became the first New Zealand soldier to be awarded the Victoria Cross since World War II. He is the 22nd New Zealander to receive the honour since 1856.Shanks, Katee. \"Apiata to have homecoming ceremony,\" New Zealand Herald. July 21, 2007; retrieved 2012-12-16. He is the first to be conferred with the Victoria Cross for New Zealand which was established in 1999. \"Willie Apiata receives his VC,\" New Zealand Herald. July 26, 2007; retrieved 2012-12-16. He became one of the very few living holders of the Victoria Cross.\"27th Reunion of Victoria Cross and George Cross holders\" at VictoriaCross.org; Hardman, Robert. \"The heroes given a front-row seat at the royal party,\" Daily Mail (UK). May 30, 2012: excerpt, \"... all 28 living holders of the Victoria Cross or the George Cross ....\"; retrieved 2012-12-16. ==Victoria Cross citation== Apiata's Victoria Cross recognized his conduct in frontline fighting in Afghanistan. \"Read the official citation for Corporal Apiata's VC,\" New Zealand Herald. July 2, 2007; retrieved 2012-12-16. In a 2004 firefight, a grenade explosion blew Apiata off the bonnet of his vehicle. At the same time, two other soldiers were wounded by shrapnel. Apiata carried the more seriously wounded solder to safety. Then he rejoined the fighting. The words of Apiata's citation explain: > In total disregard of his own safety, Lance Corporal Apiata stood up and > lifted his comrade bodily. He then carried him across the seventy metres of > broken, rocky and fire swept ground, fully exposed in the glare of battle to > heavy enemy fire and into the face of returning fire from the main Troop > position. That neither he nor his colleague were hit is scarcely possible. > Having delivered his wounded companion to relative shelter with the > remainder of the patrol, Lance Corporal Apiata re-armed himself and rejoined > the fight in counter-attack. ==References== ==Other websites== * \"Who is Willie Apiata?\" at NZArmy Category:1972 births Category:Living people Category:New Zealand MÄori people Category:Victoria Cross winners",
 "title": "Bill Apiata"
}