{
 "id": "375979",
 "text": "Breaking Bad is an American television series set in Albuquerque, New Mexico. It started in January 2008. The show was broadcast across Canada and the United States on cable channel AMC. It has won 10 Emmy Awards. Breaking Bad ended in September 2013. Bryan Cranston plays the main role, Walter White. There are five seasons and 62 episodes. It is about a chemistry teacher who is told he has lung cancer and starts making the illegal drug methamphetamine to pay for his family's needs after he dies. Breaking Bad was made by Vince Gilligan. It is considered one of the greatest television series of all time. The idea came to Vince Gilligan when he wanted the hero to become a villain. ==Main characters== *Walter White - A chemistry teacher who makes methamphetamine. *Skyler White - The wife of Walter. Before he was diagnosed, Skyler was pregnant with his second child. *Jesse Pinkman - A drug dealer. He used to be a student of Walter and is his partner in cooking meth. *Hank Schrader - Skyler's brother-in-law who works for the Drug Enforcement Administration (DEA). *Marie Schrader - Skyler's sister. She is married to Hank. She has kleptomania. *Walter White Jr. - Walter and Skyler's son. He has cerebral palsy. *Gustavo \"Gus\" Fring - A drug lord. *Saul Goodman - A lawyer who represents Walt and Jesse. *Mike Ehrmantraut - An ex cop who works for Gus. ==Sources== *https://www.fernsehserien.tv/breaking-bad.shtml Category:2008 American television series debuts Category:2013 American television series endings Category:2000s American drama television series Category:2000s crime television series Category:2010s American crime television series Category:2010s American drama television series Category:Albuquerque, New Mexico Category:American crime drama television series Category:Cancer in fiction Category:Emmy Award winning programs Category:Golden Globe Award winning programs Category:New Mexico in fiction Category:Saturn Award winners Category:Screen Actors Guild Award winners Category:Television series about families Category:Works about drugs Category:English-language television programs",
 "title": "Breaking Bad"
}