{
 "id": "376001",
 "text": "Jean-Claude Camille François Van Varenberg (; ; born 18 October 1960), known professionally as Jean-Claude Van Damme (; ), is a Belgian martial artist, actor, and filmmaker. Nicknamed \"The Muscles from Brussels\", he is widely regarded as an icon of action and martial arts cinema. Van Damme's films have grossed over $1 billion worldwide, making him one of the most successful action stars of all time. ==Early life== Born and raised in Brussels, his father enrolled him in a Shotokan karate school at the age of ten, which led Van Damme to earn his black belt in karate at the age of eighteen, and the rank of 2nd-dan black belt.https://screenrant.com/jean-claude-van-damme- fighting-martial-arts- style/#:~:text=Jean%2DClaude%20Van%20Damme%20has,the%20time%20he%20was%2018.Karate black belt https://www.cheatsheet.com/entertainment/jean-claude-van-damme- earned-film-role-knocking-martial-artist.html/ He competed in several karate and kickboxing competitions, and was a member of the Belgium Karate Team when it won the European Karate Championship on 26 December 1979.\"Standardized Tournaments And Ratings System Historic Kickboxing Ring Records\" . The Star System. 8 March 1980. Retrieved 3 April 2012. At the age of 16, he took up ballet, which he studied for five years. He started lifting weights to improve his physique, which eventually led to a Mr. Belgium bodybuilding title in 1978. In 1979, he opened a gym called \"California Gym\" in Brussels. ==Acting career== With the desire of becoming an actor, he moved to the United States in 1982, where he worked on several films, until he got his break as the lead in the martial arts film Bloodsport (1988). The film introduced his trademark splits and spinning 360˚ heel kick to an American audience.https://www.coachweb.com/exercises/celebrity-workouts/2116/jean- claude-van-damme-expendables-2-interview Van Damme became a popular action film star and followed up with commercially successful films such as Cyborg (1989), Kickboxer (1989), Lionheart (1990), Death Warrant (1990), Double Impact (1991), Universal Soldier (1992), Nowhere to Run (1993), Hard Target (1993), Timecop (1994), Street Fighter (1994), Sudden Death (1995), The Quest (1996), which marked his directorial debut, and Maximum Risk (1996). At the height of his career, he was one of the biggest action movie stars in the world, and one of the most successful martial arts actors of the 1980s and 1990s, alongside Steven Seagal.https://www.thethings.com/jean-claude-van- damme-affair-with-kylie-minogue/https://movieweb.com/jcvd-vs-seagal-better- career/ Van Damme was also considered a sex symbol.https://www.huffpost.com/entry/jean-claude-van-damme- get_b_141745/amphttps://brightside.me/articles/former-sex-symbol-jean-claude- van-damme-has-posted-a-topless-pic-of-him-at-62-that-is-nothing-but- hot-815507/ During the late 1990s and early 2000s, his popularity declined. He mostly appeared in limited theatrical releases or direct-to-video films. During this time, he starred in Replicant (2001), for which he was nominated for a Video Premiere Award for Best Actor. The film is considered the best outing from within Van Damme's direct-to-video career.https://readfilm.co/2018/02/16/obscure-movie-villains-torch- replicant/amp/ He returned to prominence with the critically acclaimed crime drama JCVD (2008). After JCVD, he began mixing things up, starring in comedies, and voicing kids animations, all the while keeping the action going.https://www.hollywoodreporter.com/movies/movie-features/jean-claude-van- damme-interview-darkness-of-man-1235253293/amp/ His big return to the action genre was in The Expendables 2 (2012), in which he starred as the villain, opposite Sylvester Stallone. From thereon Van Damme continued starring in action films and doing extensive voice work. == Public image and influence == Van Damme is widely regarded as an icon of action and martial arts cinema. At the height of his career, he was one of the biggest action movie stars in the world, and one of the most successful martial arts actors of the 1980s and 1990s, alongside Steven Seagal.https://www.thethings.com/jean-claude-van- damme-affair-with-kylie-minogue/https://movieweb.com/jcvd-vs-seagal-better- career/ Van Damme's influence has been compared to the Bruceploitation explosion of the 1970s. Van Damme achieved sex symbol status through publicity venues in the late 1980s and early 1990s. Unlike his major rivals in action film, such as Arnold Schwarzenegger, Sylvester Stallone, Steven Seagal, and Bruce Willis, Van Damme was nominated by the National Enquirer as number one on their \"Top Ten Sexiest Men in the World\" list, being the only action film star listed. Many martial artists, athletes, and filmmakers have cited Van Damme as an influence, such as Alain Moussi, Scott Adkins, Dave Callaham, Adam Brody, Jay Cutler, Lyoto Machida,https://en.clinch.news/amp/5-Fighters-Who- Have-Declared-Their-Admiration-for-Jean-Claude-Van-Damme-t202501030002.html Michael Page, https://kungfukingdom.com/interview-with-michael-venom-page/ Anderson Silva, https://en.clinch.news/amp/5-Fighters-Who-Have-Declared-Their- Admiration-for-Jean-Claude-Van-Damme-t202501030002.html Georges St-Pierre, Cain Velasquez,https://www.ufc.com/news/velasquez-and-gsp-take-silver-screen- kickboxer-vengeancehttps://uproxx.com/sports/cain-velasquez-kickboxer- vengeance-ufc-return-brock-lesnar-drug-test/ Nick Diaz, Nate Diaz,https://www.esquire.com/sports/q-and-a/a45472/nate-diaz-interview-ufc- conor-mcgregor/ Conor McGregor,https://en.clinch.news/amp/5-Fighters-Who-Have- Declared-Their-Admiration-for-Jean-Claude-Van-Damme-t202501030002.html Jiří Procházka,https://www.mmamania.com/2025/1/26/24352411/jiri-prochazka-did-a- five-day-fever-binge-of-martial-arts-movies-for-ufc-311-inspiration Mirko Cro Cop, James P. Bennett, Rico Verhoeven, Tom Duquesnoy, John Albert, Charles Rosa, Murad Ramazanov, Halil Amir, Andrei Stoica, Giorgio Petrosyan, Alfie Davis, Enkh-Orgil Baatarkhuu, and Angela Chang. ==Personal life== Among his acting heroes growing up were Charles Bronson, Bruce Lee, James Dean, Montgomery Clift, Steve McQueen, Jean-Paul Belmondo, and Sylvester Stallone.https://www.undertheradarmag.com/interviews/jean- claude_van_damme_and_the_creators_of_jean- claude_van_johnsonhttps://www.theguardian.com/film/2012/aug/10/van-damme- expendables-2 Van Damme stands at a height of 5 ft 9 in. His weight is 185 lb (84 kg). He was married to Maria Rodriguez from 1980 until they divorced in 1984. Then he was married to Cynthia Derderian from 1985 until they divorced in 1986. Then he was married to Darcy LaPier from 1994 until they divorced in 1997. Then he was married to Gladys Portugues from 1987 until they divorced in 1992; they remarried in 1999. He has three children. In 2022, he was living in Hong Kong. Van Damme has been diagnosed with bipolar disorder.'I tried to play the system' == Film == Year Title Role Notes 1979 Woman Between Wolf and Dog Movie Goer / Man in Garden Uncredited extra Archived at Ghostarchive and the Wayback Machine: 1984 Breakin Spectator in First Dance Sequence Uncredited extra 1984 Missing in Action Soldier Uncredited extra; also stunt 1984 Monaco Forever Gay Karate Man Short film; cameo 1986 No Retreat, No Surrender Ivan \"The Russian\" Kraschinsky 1988 Bloodsport Frank Dux Also uncredited editor 1987 Predator Uncredited body double only 1988 Black Eagle Andrei 1989 Cyborg Gibson Rickenbacker Also uncredited editor 1989 Kickboxer Kurt Sloane Also story, fight director and fight choreographer 1990 Lionheart Lyon \"Lionheart\" Gaultier Also writer/story and fight choreographer 1990 Death Warrant Detective Louis Burke 1991 Double Impact Alex Wagner / Chad Wagner Dual role; also writer/story, producer and fight choreographer 1992 Universal Soldier Private Luc Deveraux / GR44 1993 Nowhere to Run Sam Gillen 1993 Last Action Hero Himself Cameo 1993 Hard Target Chance Boudreaux 1994 Timecop Agent Max Walker / Agent Max Walker Dual role 1994 Street Fighter Colonel William F. Guile 1995 Sudden Death Chief Darren Francis Thomas McCord 1995 The Quest Christopher Dubois Also director and story 1996 Maximum Risk Detective Alain Moreau / Mikhail Suverov Dual role 1997 Double Team Agent Jack Paul Quinn 1998 Knock Off Marcus Ray 1999 Legionnaire Alain Lefèvre Direct-to-video; also story and producer 1999 Universal Soldier: The Return Private Luc Deveraux Also producer 1999 Inferno Eddie Lomax Limited release; also producer 2001 Replicant Edward \"The Torch\" Garrotte / The Replicant Direct-to-video; dual role 2001 The Order Rudy Cafmeyer / Charles Le Vaillant Direct-to-video; dual role; also writer 2002 Derailed Agent Jacques Kristoff Direct-to-video 2003 In Hell Kyle LeBlanc Direct-to-video 2004 Narco Jean's Ghost by Lenny 2004 Wake of Death Ben Archer Direct-to-video 2005 Second in Command Commander Samuel \"Sam\" Keenan Direct-to-video 2006 The Hard Corps Philippe Sauvage Direct-to- video; also uncredited fight choreographer 2006 The Exam Charles 2006 Until Death Detective Anthony Stowe Direct-to-video 2007 The Shepherd: Border Patrol Detective Jack Robideaux Direct-to-video 2008 JCVD Himself Limited release; also executive producer 2009 Universal Soldier: Regeneration Private Luc Deveraux Limited release 2011 Kung Fu Panda 2 Master Croc Voice role 2011 Assassination Games Vincent Brazil Limited release; also executive producer 2011 Beur sur la ville Colonel Merot Cameo 2011 Rzhevsky versus Napoleon Himself Cameo 2011 Dragon Eyes Jean-Louis Tiano Limited release 2012 The Expendables 2 Jean Vilain 2012 Universal Soldier: Day of Reckoning Private Luc Deveraux Limited release 2012 Six Bullets Samson Gaul Direct-to-video; also executive producer 2012 U.F.O. George Limited release 2013 Welcome to the Jungle Storm Rothschild Limited release 2013 Enemies Closer Xander Limited release 2013 Swelter Stillman Direct-to-video 2015 Pound of Flesh Agent Deacon Lyle Limited release; also executive producer 2015 Jian Bing Man Himself Cameo 2016 Kung Fu Panda 3 Master Croc Voice role 2016 Kickboxer: Vengeance Master Durand Limited release 2017 Kill 'Em All Philip Direct-to-video 2018 Kickboxer: Retaliation Master Durand Limited release; also executive producer 2018 Black Water Agent Scott Wheeler Limited release; also executive producer 2018 The Bouncer Lukas Limited release 2019 We Die Young Daniel Limited release; also executive producer 2021 The Last Mercenary Agent Richard Brumère / The Mist 2021 Haters Le fan de Thomas 2022 Minions: The Rise of Gru Jean Clawed Voice role 2024 Darkness of Man Agent Russell Hatch Streaming releases; also story and executive producer 2024 Kill 'Em All 2 Philip Streaming releases; also executive producer 2025 The Gardener Leo TBA Frenchy Frenchy Also writer, director, producer and editor; completed == Music video == Year Title Role Performer Notes 1992 \"Body Count's in the House\" Himself Body Count Uncredited cameo 1994 \"Time Won't Let Me\" Himself The Smithereens == Video game == Year Title Voice role Notes 1995 Street Fighter: The Movie Colonel William F. Guile Live action full-motion video ==References== ==Other websites== * * Category:1960 births Category:Living people Category:Actors from Brussels Category:Belgian movie actors Category:Belgian movie directors Category:Belgian stage actors Category:Belgian television actors Category:Belgian voice actors Category:People from Brussels-Capital Region Category:Martial artists Category:People with bipolar disorder",
 "title": "Jean-Claude Van Damme"
}