{
 "id": "376009",
 "text": "Hans \"Dolph\" Lundgren (born on November 3, 1957) is a Swedish-American actor, martial artists, and director who is known for his roles in Universal Soldier, Universal Soldier: Day of Reckoning, Rocky IV, The Expendables, The Expendables 2 and in The Expendables 3. He is notable for playing the Soviet boxer Ivan Drago in Rocky IV. Lundgren played King Nereus in the DC Comics- Warner Bros. movie Aquaman (2018). Lundgren was born on November 3, 1957 in Spånga, Stockholm, Sweden. He studied at Washington State University and at Clemson University. Lundgren was married to Annette Qviberg from 1994 until they separated in 2011. They have 2 daughters. Lundgren lives in Los Angeles, California. In May 2023, Lundgren revealed that he had been diagnosed with lung cancer in 2015. == Film == Year Title Role Notes 1985 A View to a Kill Venz Cameo 1985 Rocky IV Captain Ivan Drago 1987 Masters of the Universe He- Man 1987 Maximum Potential Himself Direct-to-video; also writer 1988 Red Scorpion Lieutenant Nikolai Petrovitch Rachenko 1988 R.P.G. II Lifeguard Short film; cameo 1989 The Punisher Francis \"Frank\" Castle / The Punisher Direct-to- video 1990 I Come in Peace Detective Jack Caine 1991 Cover Up Mike Anderson Direct-to-video 1991 Showdown in Little Tokyo Sergeant Chris Kenner 1992 Universal Soldier Sergeant Andrew Scott / GR13 1993 Joshua Tree Wellman Anthony Santee Direct-to-video 1994 Sunny Side Up Himself Cameo 1994 Pentathlon Eric Brogar Direct-to-video; also executive producer 1994 Men of War Nick Gunar Direct-to-video 1995 Johnny Mnemonic Karl \"The Street Preacher\" Honig 1995 The Shooter U.S. Marshal Michael Dane Direct-to-video 1996 Silent Trigger Waxman \"Shooter\" Direct-to-video 1997 The Peacekeeper Major Frank Cross Direct-to-video 1998 The Minion Lukas Sadorov Direct-to-video 1998 Sweepers Christian Erickson Direct-to-video 1999 Bridge of Dragons Warchild Direct-to-video 1999 Storm Catcher Major Jack Holloway Direct-to-video 2000 Jill Rips Matt Sorenson Direct-to-video 2000 The Last Warrior Captain Nick Preston Direct-to-video 2000 Agent Red Captain Matt Hendricks Direct-to-video 2001 Hidden Agenda Agent Jason Price Direct-to-video 2003 Detention Sam Decker Direct-to-video 2004 Direct Action Sergeant Frank Gannon Direct-to-video 2004 Fat Slags Randy Cameo 2004 Retrograde Captain John Foster Direct-to-video 2004 The Defender Lance Rockford Direct-to-video; also director 2005 The Mechanik Nikolai \"Nick\" Cherenko Direct-to-video; also story and director 2006 The Inquiry Brixos 2007 Diamond Dogs Xander Ronson Direct-to-video; also uncredited director and executive producer 2007 Missionary Man Ryder Limited release; also writer and director 2009 Direct Contact Mike Riggins Direct-to- video 2009 Command Performance Joe Reynolds Direct-to-video; also writer and director 2009 Universal Soldier: Regeneration Sergeant Andrew Scott Limited release 2010 Icarus Edward \"Eddie\" Genn / Icarus Limited release; also director 2010 The Expendables Gunner Jensen 2011 In the Name of the King 2: Two Worlds Granger Direct-to-video 2012 Small Apartments Dr. Sage Mennox Limited release 2012 Stash House Andy Spector Limited release; also executive producer 2012 One in the Chamber Aleksey \"The Wolf\" Andreev Direct-to-video 2012 The Expendables 2 Gunner Jensen 2012 Universal Soldier: Day of Reckoning Sergeant Andrew Scott Limited release 2012 The Package \"The German\" Limited release 2013 Legendary Harker Direct-to-video 2013 Battle of the Damned Major Max Gatling Limited release; also executive producer 2013 Ambushed Agent Evan Maxwell Direct-to-video; also producer 2013 Blood of Redemption Axel \"The Swede\" Direct-to-video 2014 Puncture Wounds Hollis Direct-to-video; also producer 2014 The Expendables 3 Gunner Jensen 2014 Skin Trade Detective Nick Cassidy Limited release; also writer/story and producer 2015 War Pigs Captain Hans Picault Limited release 2015 The Good, the Bad, and the Dead Agent Bob Rooker Direct-to-video 2015 Shark Lake Clint Gray Limited release; also producer 2015 Riot Agent William Direct-to-video 2015 Malchishnik Natasha's Husband Cameo 2016 Hail, Caesar! Submarine Commander Uncredited еxtra 2016 Kindergarten Cop 2 Agent Zack Reed Direct-to-video; also executive producer 2016 Don't Kill It Jebediah Woodley Limited release; also executive producer 2016 Female Fight Club Sam Holt Limited release 2016 Welcome to Willits Officer Derek Hutchinson Limited release 2017 Larceny Jack Direct-to-video 2017 Altitude Matthew Sharpe Limited release 2017 Dead Trigger Captain Kyle Walker Limited release 2018 Black Water Marco Limited release 2018 Creed II Captain Ivan Drago 2018 Aquaman King Nereus 2019 The Tracker Aiden Hakansson Limited release 2019 Acceleration Vladik Zorich Limited release 2019 Hard Night Falling Michael Anderson Direct-to-video; also producer 2021 Pups Alone Victor Limited release 2021 Seal Team Dolph Voice role 2021 Castle Falls Richard Ericson Limited release; also director and producer 2022 Minions: The Rise of Gru Svengeance Voice role 2022 Section Eight Captain Tom Mason Limited release; also executive producer 2022 Operation Seawolf Captain Hans Kessler Limited release 2022 Come Out Fighting Major Chase Anderson Direct-to-video 2023 The Best Man Anders Limited release 2023 Expend4bles Gunner Jensen 2023 Showdown at the Grand Claude Luc Hallyday Limited release 2023 Aquaman and the Lost Kingdom King Nereus 2024 Wanted Man Detective Travis Johansen Limited release; аlso writer, director and producer 2025 Mutant Year Zero Voice role; in production 2025 Hellfire Wiley Completed 2025 Exit Protocol Charles Managold Completed TBA Holiguards TBA Post-production TBA Dolph: Fights Worth Fighting Himself Documentary film; also executive producer; post-production TBA A Man Will Rise Uncompleted == Television == Year Title Role Notes 1998 Blackjack U.S. Marshal Jack Devlin Television pilot for an unproduced TV series 2010 Chuck Marco Episode: \"Chuck Versus the Anniversary\" 2013–2014 SAF3 Captain John Eriksson 12 episodes 2015 Workaholics Himself Episode: \"Blood Drive\" 2015 Sanjay and Craig Himself Episode: \"Huggle Day\"; voice role 2016–2017 Arrow Konstantin Kovar 6 episodes 2017 Tour de Pharmacy Gustav Ditters Television film; cameo 2017 Sharknado 5: Global Swarming Mature Gil Shepard Television film; cameo 2018 Broken Sidewalk Herb Episode: \"Pilot\" 2019 It's Always Sunny in Philadelphia John Thundergun Episode: \"Thunder Gun 4: Maximum Cool\"; cameo TBA The Witcher Rats Brehen Post-production == Theatre == Year Title Role Venue Notes 1994 Another Octopus 1994 Watching Fire 1995 Force Majeure Death-Row Prisoner == Commercial == Year Title Role Notes 2024 Supercell's Squad Busters: Squad Up! Barbarian #2 Cameo == Music videos == Year Title Role Performer Notes 1992 \"Body Count's in the House\" Himself Body Count Uncredited cameo 2006 \"Kosmosa\" Submarine Captain Irson Kudikova 2017 \"Believer\" Boxer Imagine Dragons == Soundtrack appearances == Year Title Song Notes 1988 Red Scorpion \"State Anthem of the Soviet Union\" 2009 Command Performance \"Breakdown\", \"Girl\" 2010 Melodifestivalen 2010 \"A Little Less Conversation\", \"Eye of the Tiger\" 2 episodes 2010 Gylne tider \"Let It Be\" Episode: \"Episode #4.3\" == Video game == Year Title Voice role Notes 2012 The Expendables 2 Videogame Gunner Jensen ==Awards and honors== Nominated work Year Award Results Rocky IV 1985 Marshall Trophy for Best Actor ===Special awards=== Ceremony Year Award Results Málaga International Week of Fantastic Cinema 2007 Fantastic Lantern ==References== ==Other websites== *Twitter *Facebook *Dolph Lundgren official page *MySpace * Category:1957 births Category:Living people Category:Swedish movie actors Category:Swedish television actors Category:Swedish stage actors Category:Swedish voice actors Category:Swedish movie directors Category:Martial artists Category:Sportspeople from Stockholm Category:Actors from Stockholm",
 "title": "Dolph Lundgren"
}