{
 "id": "376273",
 "text": "Ettore Ewen (born March 1, 1986 in Tampa, Florida) better known by his ring names Big E (formerly Big E Langston), is an American professional wrestler, powerlifter and former American football player currently signed to WWE. He was a part of The New Day, but is inactive because of a broken neck since March 2022. He played college football at the University of Iowa. He is also a National Powerlifting Champion and has set multiple national and state records in the raw division. In WWE, Big E is a former one-time WWE Champion, one-time NXT Champion, two-time Intercontinental Champion, eight-time tag team champion, and the winner of the 2021 men's Money in the Bank ladder match ==Career== In 2009, Ewen signed a developmental contract with World Wrestling Entertainment (WWE). He made his debut for their developmental territory Florida Championship Wrestling (FCW) on December 17, under the ring name Big E Langston. In August 2012, FCW became NXT. On December 6, 2012 (aired as the January 9, 2013 episode of NXT), he defeated Seth Rollins to win the NXT Championship. He lost it to Bo Dallas on May 13 (aired June 12). On the December 17, 2012 episode of Raw, he made his WWE main roster debut when he attacked John Cena after AJ Lee ordered him to. He then teamed with Dolph Ziggler and AJ Lee but started a feud with Ziggler after he ended his relationship with AJ on Raw. He had several matches with Ziggler and eventually lost a mixed tag team match with AJ against Ziggler and Kaitlyn at SummerSlam which ended their feud. On the October 18 episode of SmackDown, he turned face after his match with CM Punk when he helped Punk fending off an attack by Ryback and Curtis Axel. Langston defeated Curtis Axel on the November 18, 2013 edition of Raw titled Raw Country to win the WWE Intercontinental Championship and his first championship on WWE's main roster. In February 2014, his ring name was made shorter to Big E. On May 4, at Extreme Rules, Big E lost the title to Bad News Barrett. In November, Big E, Kofi Kingston and Xavier Woods created the stable The New Day. At Extreme Rules on April 26, 2015, Big E and Kingston defeated Tyson Kidd and Cesaro to win the WWE Tag Team Championships for the first time together. On June 14 at Money in the Bank, they lost the titles against The Prime Time Players (Darren Young and Titus O'Neil), but won it back at SummerSlam on August 23 in a fatal four-way tag team match, also including the Lucha Dragons (Kalisto and Sin Cara) and Los Matadores (Diego and Fernando). During their record-breaking reign, they were drafted to Raw in the 2016 WWE Draft, and the championship was renamed the WWE Raw Tag Team Championship. At Roadblock: End of the Line on December 18, 2016, they lost the titles to Cesaro and Sheamus. This ended their reign at 483 days, which so far is the longest of that title and the third longest of any tag team championship in WWE. On February 20, 2017, The New Day were announced as the hosts of WrestleMania 33. On April 11, 2017, they moved to the SmackDown brand as part of the Superstar Shake-up. As part of the brand, they became six-time SmackDown Tag Team Champions. Big E became a singles competitor again in 2020, when Kingston and Woods were drafted to Raw brand as part of the 2020 Draft, while Big E stayed on SmackDown. On SmackDown's holiday episode on December 22 (aired on December 25), Big E defeated Sami Zayn in a lumberjack match to win his second Intercontinental Championship. At Night 2 of WrestleMania 37 on April 11, 2021, Big E lost the title to Apollo Crews in a Nigerian Drum Fight. On June 25 , Big E defeated Crews to qualify for the men's Money in the Bank ladder match. At Money in the Bank on July 18, he became the first African American to win that kind of match. On September 13, Big E announced on Twitter that he was cashing in his Money in the Bank contract for a WWE Championship match on that night's Raw. After champion Bobby Lashley kept his title against Randy Orton, Big E directly cashed in his contract and pinned Lashley to win his first WWE Championship. On October 1 at the 2021 WWE Draft, Big E was drafted to Raw. At WWE Day 1 on January 1, he lost the title to Brock Lesnar in a fatal five-way match, also including Bobby Lashley, Kevin Owens, and Seth \"Freakin\" Rollins. Later that month, Big E was moved back to SmackDown and reunited with The New Day. In a match on the March 11 episode of SmackDown, his neck was broken after an overhead belly-to-belly suplex by Ridge Holland. Big E has not wrestled since then. On the December 2, 2024 episode of Raw, during the 10-year anniversary celebration of The New Day, he reunited with Kingston and Woods and announced that he would return as their manager. However, Kingston and Woods kicked him out of the stable and turned heel. == Championships and accomplishments == * Florida Championship Wrestling ** FCW Florida Tag Team Championship (1 time) – with Calvin Raines * Pro Wrestling Illustrated ** Tag Team of the Year (2015, 2016) ** Ranked No. 13 of the top 500 singles wrestlers in the PWI 500 in 2021 ** Ranked No. 8 of the top 50 tag teams in the PWI Tag Team 50 in 2020 * Wrestling Observer Newsletter ** Best Gimmick (2015) **Shad Gaspard/Jon Huber Memorial Award (2020) * WWE ** WWE Championship (1 time) ** NXT Championship (1 time) ** WWE Intercontinental Championship (2 times) ** WWE (Raw) Tag Team Championship (2 times) – with Kofi Kingston and Xavier Woods ** WWE SmackDown Tag Team Championship (6 times) – with Kofi Kingston and Xavier Woods ** WWE SmackDown Tag Team Championship Tournament (2018) **Men's Money in the Bank (2021) ** Thirty- third Triple Crown Champion ** WWE Year-End Award (1 time) *** Men's Tag Team of the Year (2019) – with Kofi Kingston and Xavier Woods ** Slammy Award (1 time) *** Ring Gear of the Year (2020) – with Kofi Kingston and Xavier Woods == Notes == ==References== ==Other websites== * Category:1986 births Category:Living people Category:African-American players of American football Category:African-American wrestlers Category:American professional wrestlers Category:Sportspeople from Tampa, Florida Category:WWE wrestlers",
 "title": "Big E Langston"
}