{
 "id": "376352",
 "text": "Arctiidae is a large family of moths with around 11,000 species found all over the world. It included 6,000 neotropical species.Scoble, MJ. (1995) The Lepidoptera: Form, Function and Diversity. Second ed. Oxford University Press. This family includes the groups commonly known as tiger moths (or tigers). Tiger moths usually have bright colours, footmen (which are usually much drabber), lichen moths and wasp moths. Many species have 'hairy' caterpillars which are popularly known as woolly bears or woolly worms. The scientific name refers to this (Gk. αρκτος = a bear). Caterpillars may also go by the name 'tussock moths' (more usually this refers to Lymantriidae, however). ==Notable species== * Banded tussock moth, Halysidota tesselaris * banded woolly bear or Isabella tiger moth, Pyrrharctia isabella * Buff ermine, Spilarctia lutea * Cinnabar moth, Tyria jacobaeae * common footman, Manulea lurideola * dogbane tiger moth or delicate cycnia, Cycnia tenera * fall webworm, Hyphantria cunea * garden tiger moth, Arctia caja * giant leopard moth, Hypercompe scribonia * hickory tussock moth, Lophocampa caryae * Jersey tiger moth, Euplagia quadripunctaria * milkweed tussock moth, Euchaetes egle * scarlet tiger pygmy moth, Callimorpha dominula * Maltese ruby tiger moth, Phragmatobia fuliginosa ssp. melitensis ==Related links== * List of arctiid genera ==Notes and references== ===Other references=== * Bates DL, Fenton MB (1990) Aposematism or startle? Predators learn their responses to the defenses of prey. Can J Zool 68:49–52 * Dunning DC, Krüger M (1995) Aposematic sounds in African moths. Biotropica 27:227–231 * Dunning DC, Acharya L, Merriman CB, Ferro LD (1992) Interactions between bats and arctiid moths. Can J Zool 70:2218–2223 * Fullard JH, Fenton MB, Simmons JA (1979) Jamming bat echolocation: the clicks of arctiid moths. Can J Zool 57:647–649 * Science Fridays: Moths Can Escape Bats By Jamming Sonar ===Main species catalogs=== * Dubatolov VV (2010) Tiger-moths of Eurasia (Lepidoptera, Arctiidae) (Nyctemerini by Rob de Vos & Vladimir V. Dubatolov). Neue Entomologische Nachrichten 65:1-106 * Edwards ED (1996) Arctiidae. Monographs on Australian Lepidoptera 4:278-286,368-370 * Ferguson DC, Opler PA (2006) Checklist of the Arctiidae (Lepidoptera: Insecta) of the continental United States and Canada. Zootaxa 1299:1-33 * Goodger DT, Watson A (1995) The Afrotropical Tiger-Moths. An illustrated catalogue, with generic diagnosis and species distribution, of the Afrotropical Arctiinae (Lepidoptera: Arctiidae). Apollo Books Aps.: Denmark, 55 pp. * Watson A (1971) An illustrated Catalog of the Neotropic Arctiinae type in the United States National Museum (Lepidoptera: Arctiidae) Part 1. Smithsonian Contributions to Zoology 50:1-361 * Watson A, Goodger DT (1986) Catalogue of the Neotropical Tiger-moths. Occasional Papers on Systematic Entomology 1:1-71 ===Phylogenetic analyses=== * Da Costa MA, Weller SJ (2005) Phylogeny and classification of Callimorphini (Lepidoptera: Arctiidae: Arctiinae). Zootaxa 1025:1-94 * Dubatolov VV (2006) Cladogenesis of tiger-moths of the subfamily Arctiinae: development of a cladogenetic model of the tribe Callimorphini (Lepidoptera, Arctiidae) by the SYNAP method. Euroasian Entomological Journal 5(2):95-104 (in Russian). * Dubatolov VV (2008) Construction of the phylogenetic model for the genera of the tribe Arctiini (Lepidoptera, Arctiidae) with the SYNAP method. Entomological Review 88(7):833-837. Translated from: Entomologicheskoe Obozrenie 87(3):653-658 * Dubatolov VV (2009) Development of a phylogenetic model for the tribe Micrarctiini (Lepidoptera, Arctiidae) by the SYNAP method. Entomological Review 89(3):306-313. Translated from: Zoologicheskii Zhurnal. 88(4):438-445 * Jacobson NL, Weller SJ (2002) A cladistic study of the Arctiidae (Lepidoptera) by using characters of immatures and adults. Thomas Say publications in entomology. Entomological Society of America | Lanham, Maryland, 98 pp. ===Distribution analyses=== * Dubatolov VV (2008) Analysis of Insect Distribution in the Northern Hemisphere by the Example of the Subfamily Arctiinae (Lepidoptera, Artctiidae). Contemporary Problems of Ecology 1(2):183-193, 194-203. ==Further reading== * William Conner (ed.). (2009). Tiger moths and woolly bears : behavior, ecology, and evolution of the Arctiidae. Oxford University Press: New York. ==Other websites== * Family Arctiidae at Lepidoptera.pro * Belize Arctiidae Digital colour \"plates\" * Jamaica Actiidae Digital colour \"plates\" * Digital images of Neotropical Arctiidae and Geometridae * SZM Digital images *on the UF / IFAS Featured Creatures Web site ** Empyreuma affinis, spotted oleander caterpillar ** Estigmene acrea, saltmarsh caterpillar **Lycomorpha pholus, black and yellow lichen moth ** Lymire edwardsii, Edwards wasp moth ** Syntomeida epilais, oleander caterpillar ** Utetheisa ornatrix, bella moth * Beattyville Wolly Worm Festival 2012 Site",
 "title": "Arctiidae"
}