{
 "id": "376468",
 "text": "Mirza Nasir al-Din Muhammad Humayun (6 March 1508 - 27 January 1556) was the second Mughal Emperor. He ruled Afghanistan, Pakistan, and parts of northern India from 1530 to 1540. He was the son of the previous emperor, Babur. His son was Akbar, one of the most famous emperors in Mughal history. == Military campaigns == In 1532, Humayun and Sher Shah Suri clashed on the battlefield. Humayun won the battle and captured Chunar. In 1534, Humayun defeated Bahadur Shah and captured Gujrat. Sher Shah meanwhile regrouped and defeated Humayun, at Chausa in 1539. In 1555, Humayun returned to India and defeated the succesor of Sher Shah, Islam Shah and regained India. _War with Bahadur Shah_ In 1531, Bahadur Shah Zafar overran Malwa and the next year he turned to Mewar. Humayun marched against Bahadur Shah and easily defeated his forces. Bahadur Shah fled to Ahmedabad and from there to Kathisawar. == Death == In 1557, Humayun had a fatal fall from the stairs of his private observatory (some sources say his library). He was carrying books when his feet got caught in his robe and he tripped and fractured his head. He had bent down upon hearing the Azaan (the Muslim call to prayer). All medical aid proved useless, and Humayun died. He is known as \"the luckless one\". Humayun was the son of Babur, the founder of the Mughal dynasty. He was more of an adventurer than a ruler, and during his first reign he feuded with his step-brothers and lost most of the Mughal Empire's territories to the Sur Empire. In 1539, he was defeated by the Afghan soldier Sher Shah Suri at the Battle of Chausa, and again in 1540 at Kannauj. As a result, Humayun was forced to leave India for Afghanistan and Iran. He regained the throne in 1555 and ruled until his death in 1556, when the Mughal Empire covered almost one million square kilometers. During his second reign, he defeated the Afghans at Douhrua, drove out Sultan Mahmood Lodhi from Jaunpur, and defeated Bahadur Shah of Gujarat. Humayun is known for his contributions to Mughal architecture, including the introduction of high arches and double domes. His tomb is located in Delhi, and can be reached by air, train, or road. Category:Mughal emperors Category:1508 births Category:1556 deaths Category:16th century in India",
 "title": "Humayun"
}