{
 "id": "37649",
 "text": "Exxon Mobil or ExxonMobil () is the world's biggest oil and gas company. It was created when Exxon and Mobil, both companies formed after the John D. Rockefeller's original Standard Oil company split apart, joined together in a merger to become one company. ExxonMobil has been involved in global warming controversies, as have other Big Oil corporations such as Royal Dutch Shell == Board of directors == , the current ExxonMobil board members are: * Michael J. Angelakis, chair and chief executive officer of Atairos Group Inc. * Susan Avery, president emerita of Woods Hole Oceanographic Institution * Angela Braly, former president and CEO of WellPoint (now Anthem) * Ursula Burns, former chair and CEO of Xerox * Gregory J. Goff, former executive vice chair, Marathon Petroleum * Kaisa H. Hietala, board professional * Joseph L. Hooley, former chair, president and CEO of State Street * Steven A. Kandarian, chair, president and CEO of MetLife * Alexander A. Karsner, senior strategist at X Development * Jeffrey W. Ubben, Founder, Portfolio Manager, and Managing Partner, Inclusive Capital Partners, L.P. * Darren W. Woods, chair of the board and CEO, ExxonMobil Corporation Hooley is presently the lead independent director, having succeeded former Merck CEO Kenneth Frazier upon his retirement in May 2022. Three of the directors nominated at the last Annual General Meeting were nominated after a proxy battle against hedge fund Engine No.1 and were nominated against the suggestion of the board. ==Books== * Form 10-K 2018: * Form 10-K 2022: * Form 10-K 2023: * Bender, Rob, and Tammy Cannoy-Bender. An Unauthorized Guide to: Mobil Collectibles – Chasing the Red Horse. Atglen, Pennsylvania: Schiffer Publishing Co., 1999. * Exxon Corp. Century of Discovery: An Exxon Album. 1982. * Gibb, George S., and Evelyn H. Knowlton. The Resurgent Years, 1911–1927: History of Standard Oil Co. (New Jersey). New York: Harper & Brothers Publishers, 1956. * Hidy, Ralph W., and Muriel E. Hidy. Pioneering in Big Business, 1882–1911: History of Standard Oil Co. (New Jersey). New York: Harper & Brothers Publishers, 1955. * Larson, Henrietta M., and Kenneth Wiggins Porter. History of Humble Oil & Refining Co.: A Study in Industrial Growth. New York: Harper & Brothers Publishers, 1959. * Larson, Henrietta M., Evelyn H. Knowlton, and Charles S. Popple. New Horizons, 1927–1950: History of Standard Oil Co. (New Jersey). New York: Harper & Row, 1971. * McIntyre, J. Sam. The Esso Collectibles Handbook: Memorabilia from Standard Oil of New Jersey. Atglen, Pennsylvania: Schiffer Publishing Co., 1998. * Sampson, Anthony. The Seven Sisters: The 100-year Battle for the World's Oil Supply. New York: Bantom Books, 1991. * Standard Oil Co. (New Jersey). Ships of the Esso Fleet in World War II. 1946. * Tarbell, Ida M. All in a Day's Work: An Autobiography.. New York: The MacMillan Co., 1939. * Tarbell, Ida M., and David Mark Chalmers. The History of the Standard Oil Co.. New York: Harper & Row, 1966. * Wall, Bennett H. Growth in a Changing Environment: A History of Standard Oil Co. (New Jersey) 1950–1972 and Exxon Corp. (1972–1975). New York: McGraw-Hill Book Co., 1988. * Yergin, Daniel. The Prize: The Epic Quest for Oil, Money, and Power. New York: Simon & Schuster, 1991. ==References== == Other websites == * Exxon's anti- global-warming propaganda expenditures Category:Companies based in Texas Category:1999 establishments in the United States Category:American fuel companies",
 "title": "ExxonMobil"
}