{
 "id": "376678",
 "text": "Sylvie Testud (born January 17, 1971) is a French actress, writer and director. She started acting in films in 1991. She has since won two César Awards for her performances. ==Biography== She grew up in the La Croix-Rousse quarter of Lyon, France. Her mother immigrated from Italy in the 1960s and married a Frenchman. He left the family when Sylvie was just two years old. In 1985, when Testud was 14, she started taking acting classes in Lyon with the actor and director Christian Taponard. In 1989, she moved to Paris and studied for three years at the Conservatoire (CNSAD). In the early and mid 1990s, she began to have small roles in films. She acted in L'Histoire du garcon qui voulait qu'on l'embrasse (directed by Philippe Harel) and Love, etc. (directed by Marion Vernoux). In 1997 she had an important role in Caroline Link's Jenseits der Stille. This film was a great success in Germany. She had to learn German, sign language, and the clarinet for this film. In 1998, she played Béa in Thomas Vincent's Karnaval. This was her first important role in a French film. In 2000, she performed in Chantal Akerman's La Captive. In 2001 she won the César Award for Most Promising Actress for her role in Les Blessures assassines (English title: Murderous Maids). In 2003, she wrote the book Il n'y a pas beaucoup d'etoiles ce soir about her life as an actress.\"Il n'y a pas beaucoup d'etoiles ce soir - Sylvie Testud.\" Mortigi Tempo. Blogspot. 2 October 2006. Web. 20 December 2012. One of her most important performances was in the film Stupeur et tremblements in 2003. She was awarded a César Award for Best Actress and a Prix Lumière award for best actress for her performance in this film. In 2007, she acted in La Vie en Rose. This film won two Academy Awards. She became Chevalier (Knight) of the Ordre national du Mérite in March 2009. She has two children. Her son, Ruben, was born on 15 February 2005. Her daughter, Esther, was born in January, 2011. ==Selected filmography== Year Title Role Director 1995 Those Were the Days Sylvie Didier Haudepin 1996 Beyond Silence Lara Caroline Link 1998 Karnaval Béa Thomas Vincent 1998 The Misadventures of Margaret the young nun Brian Skeet 1999 Annaluise & Anton Laurence Caroline Link 2000 La Captive Ariane Chantal Akerman 2000 Drug Scenes (episode \"Lucie\") Lucie Guillaume Nicloux (episode) 2000 Sade Renée de Sade Benoît Jacquot 2000 Murderous Maids Christine Papin Jean-Pierre Denis 2001 I'm Going Home Ariel Manoel de Oliveira 2002 Everyman's Feast Sophie Fritz Lehner 2002 A Loving Father Virginia Jacob Berger 2003 Fear and Trembling Amélie Alain Corneau 2003 Sole Sisters Tina Pierre Jolivet 2004 Words in Blue Clara Alain Corneau 2006 La Vie en rose Mômone Olivier Dahan 2007 La France Camille Serge Bozon 2008 Sagan Françoise Sagan Diane Kurys 2009 Lucky Luke Calamity Jane James Huth 2009 Vengeance Irène Thompson Johnnie To 2009 Lourdes Christine Jessica Hausner 2010 The Round Up Bella Zygler Roselyne Bosch 2010 Mumu Ms. Mulard Joël Séria 2011 L'Ordre et la Morale Chantal Legorjus Mathieu Kassovitz 2012 The Scapegoat Bela Charles Sturridge ==References== ==Other websites== * *Sylvie Testud at Actricesdefrance.org *CSOJ - Alain Badiou Sylvie Testud appears on an episode of the French television program Ce Soir (En direct, channel 3) featuring militant philosopher Alain Badiou. The topic of this episode is \"Faut-il réinventer l'amour?\" (Should we reinvent love?). Ms. Testud appears 46:18 minutes into the program and talks with Badiou and the program host for about 24 minutes (no commercials, this show is in French). Category:1971 births Category:Living people Category:French actors Category:Writers from Lyon",
 "title": "Sylvie Testud"
}