{
 "id": "376723",
 "text": "Anointing of the Sick is a sacrament (a sacred ceremony) in Roman Catholicism and other Christian denominations. It is given to people who are \"in danger due to sickness or old age\". A person does not have to be dying to receive the Anointing of the Sick. It can be done for anyone with a medical problem which they could die from. Anointing of the Sick is also called Unction. In the past, it was called Extreme Unction. (\"Anointing\" and \"Unction\" are both words for putting oil on a person. Oil is an important part of the ceremony.) ==Beginnings== All four Gospels in the Bible say that Jesus healed many people. Catholics believe that even after his death, Jesus is still able to heal people through the power of the sacraments. The main part of the Bible that talks about anointing of the sick is : \"Are any among you sick? They should call for the elders of the Church and have them pray over them, anointing them with oil in the name of the Lord. And their prayer offered in faith will heal the sick, and the Lord will make them well. And if they have committed sins, these will be forgiven.\" , and also talk about the anointing of the sick. ==The sacrament== The Anointing of the Sick sacrament is done by a priest. The priest brings oil, which he has blessed. Usually, the oil is olive oil or another pure plant oil. The priest rubs the blessed oil on the patient's forehead, and sometimes other parts of the body. While he does this, he says special prayers that are meant for the Anointing of the Sick sacrament. Catholics believe the Anointing of the Sick sacrament can: * Give comfort to the sick person (make them feel better) * Give the sick person the courage and strength they will need to go through the pain or suffering of their illness * Make the soul stronger * Make the body stronger (sometimes) * Help the person get ready to live with Christ forever after death * Forgive the person's sins, if the person is too sick to make a confession (tell the priest about the sins he has done in his life, ask for forgiveness, and say prayers to show he is sorry) Several other Christian churches have similar rituals. ==Last rites== The Anointing of the Sick is one of the three sacraments that make up the last rites. In Catholicism, last rites are a set of sacraments that are given to people who are dying. The steps in the last rites are: # Penance: The dying person repents their sins (says they are sorry for the sins they have done), and asks God to forgive them. # The Anointing of the Sick # Viaticum: This is one final Holy Communion. The dying person is given a small piece of bread, or even a tiny crumb if they cannot eat. A priest has blessed this bread. Catholics believe this special blessing turns the bread into the body of Christ. == Related pages == *Catechism of the Catholic Church *Charismatic *Lourdes ==References== Category:Roman Catholicism Category:Sacraments",
 "title": "Anointing of the sick"
}