{
 "id": "37672",
 "text": "The , called the Sega Genesis, in North America is a 16-bit video game console made by Sega. It is Sega's third video game console. Sega released it as the Mega Drive in Japan in 1988. In 1989, they released it in North America as the Genesis. In Japan, the Mega Drive sold poorly against its two main competitors, Nintendo's Super Famicom and NEC's PC Engine. However, it sold well in North America, Brazil, and Europe. Some of the reasons it sold well is because it had many arcade game ports, Sega's Sonic the Hedgehog series, several popular sports franchises, and an aggressive youth marketing that made the system seem like the cool console for teens. Controversy about violent games such as Night Trap and Mortal Kombat led Sega creating the Videogame Rating Council. It was a predecessor to the Entertainment Software Rating Board (ESRB). 30.75 million first-party Mega Drive/Genesis consoles were sold around the world. By the mid-2010s, third-party Mega Drive/Genesis rereleases were still being sold by AtGames in North America and Europe. Many games have been rereleased in compilations or on online services such as Virtual Console, Xbox Live Arcade, PlayStation Network, and Steam. The Genesis was succeeded in 1994 by the Sega Saturn. ==History== ===Development=== In the early 1980s, Sega Enterprises, Inc. was one of the top five arcade game manufacturers in the United States. At this time, Sega was a subsidiary of Gulf & Western. Its company revenues was higher than $200 million between July 1981 and June 1982. In 1982, the arcade business slowed, and it hurt Sega. It led to Gulf & Western selling its North American arcade manufacturing organization. They also licensed rights for its arcade games to Bally Manufacturing. The company kept Sega's North American R&D; operation, as well as its Japanese subsidiary, Sega Enterprises, Ltd. With its arcade business hurting, Sega Enterprises, Ltd. president Hayao Nakayama said that the company should to move into the home console market in Japan. The industry was very new at that time. Nakayama got permission to move into the home console industry. This led to the release of Sega's first home video game system, the SG-1000, in July 1983. It had sold 160,000 units in Japan. Sega did not expect it to sell that well. However, sales at stores were dominated by Nintendo's Famicom which had been released the same day. Sega believed that the Famicom sold about 10 times better than the SG-1000. The SG-1000 was replaced by the Sega Mark III within two years. Gulf & Western started getting of its non-core businesses after the death of company creator Charles Bluhdorn. Nakayama and former Sega CEO David Rosen decided to do a management buyout of the Japanese subsidiary in 1984. They would do this with financial support from CSK Corporation, a famous Japanese software company. Nakayama then became CEO of Sega Enterprises, Ltd. In 1986, Sega redesigned the Mark III for release in North America. They called it the Sega Master System. They released it in Europe in 1987. Although the Master System sold well in Europe and Brazil, it did not sell well in Japan or North America. By the mid-to-late 1980s, Japan and North America were dominated by Nintendo. With Sega doing poorly in the home console market, Sega's console R&D; team, led by Masami Ishikawa and supervised by Hideki Sato, started working on a successor to the Master System. They did this almost immediately after the Master System was released. ==Legacy== The Genesis is often considered one of the best video game consoles. In 2009, IGN said it was the fifth best video game console. They said it was good because of sports games and it had a better home version of Mortal Kombat. They praised \"what some consider to be the greatest controller ever created: the six button\". In 2007, GameTrailers said the Genesis was the sixth best console of all time in their list of top ten consoles that \"left their mark on the history of gaming\". They said it was good because it had great games and a good controller. They also wrote about the \"glory days\" of Sonic the Hedgehog. In 2008, GamingExcellence said it was sixth of the 10 best consoles. They said \"one can truly see the Genesis for the gaming milestone it was.\" GameDaily said it was ninth of ten for its memorable games. == Content Notes == ==Notes== == References == Category:Sega video game consoles",
 "title": "Sega Genesis"
}