{
 "id": "376882",
 "text": "Lev Vygotsky , born Лев Симхович Выгодский (Lev Simkhovich Vygodsky) ( – 11 June 1934) was a Russian psychologist. He worked on child development, play and language. He also developed a holistic theory of human cultural and biosocial development.Daniels H. (ed) 1996. An introduction to Vygotsky. London: Routledge.Kozulin A. 1990. Vygotsky's psychology: a biography of ideas. Cambridge, MA: Harvard University Press. Vygotsky's early death to tuberculosis left many manuscripts. Sorting them out has taken many years.The Collected Works of L.S. Vygotsky, 1987. overview ==Thought and Language== Perhaps Vygotsky's most important work was the inter-relationship of language development and thought.Vygotsky L. [1962] 2012. Thought and language. MIT Press. This establishes the connection between speech and the development of mental concepts and cognitive awareness. Vygotsky described inner speech as being qualitatively different from normal (external) speech. Although Vygotsky believed inner speech developed from external speech by a gradual process, with younger children only really able to \"think out loud\". :\"Vygotsky's view is that language has two functions: external communication with one's fellow human beings and, equally important, the internal manipulation of one's inner thoughts\".Greene, Judith 1975. Thinking and language. London: Methuen, p68. Language starts as a tool external to the child used for social interaction. The child guides its behavior by using a kind of self-talk or \"thinking out loud\". Initially, self-talk is very much a tool of social interaction and this tapers to negligible levels when the child is alone.But see Nelson, Kathleen (ed) 1989. Narratives from the crib. Harvard University Press. Gradually, self-talk is used more as a tool for self-directed and self-regulating behavior. Because it gets internalized, self-talk is no longer present when the child starts school.Though nowadays children start at kindergarten quite early, and so it should be possible to observe self-talk there. Self-talk \"develops along a rising not a declining, curve; it goes through an evolution, not an involution. In the end, it becomes inner speech\".p57 ===Speaking=== Speaking has thus developed along two lines, the line of social communication and the line of inner speech, by which the child mediates and regulates their activity through their thoughts. This is not to say that thinking cannot take place without language, but rather it is mediated by language, and so develops to a much higher level of sophistication. Just as the birthday cake as a sign provides much deeper meaning than its physical properties allow, inner speech as a sign provides much deeper meaning than the lower psychological functions would otherwise allow. ===Inner speech=== Inner speech is not comparable in form to external speech. External speech is the process of turning thought into words. Inner speech is the opposite; it is the conversion of speech into inward thought. Inner speech, for example, contains predicates only. Subjects are superfluous. Words are also used much more economically. One word in inner speech would take many words to express it in external speech. == Works == *Vygotsky L. 1962. Thought and language. MIT Press. ISBN 0-262-72001-9. Revised and expanded edition 2012. ISBN 978-0-262-51771-3 *Vygotsky L. 1962. Psychology of art. MIT Press. *Vygotsky L. 1978. Mind in society: the development of higher psychological processes. Cambridge & London: Harvard University Press. ISBN 0-674-57629-2 ==Related pages== *List of scientists from Europe == References == Category:Russian psychologists Category:1896 births Category:1934 deaths Category:Moscow State University alumni",
 "title": "Lev Vygotsky"
}