{
 "id": "376900",
 "text": "The Second Battle of Fort Fisher was a joint assault by Union Army and naval forces. It was against the Confederate Fort Fisher. The fort was located outside Wilmington, North Carolina. The battle was near the end of the American Civil War. The battle was sometimes referred to as the \"Gibraltar of the South\". The fort was the last major coastal stronghold of the Confederacy. Fort Fisher had tremendous strategic value during the war. ==Medal of Honor== The Medal of Honor was created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipient must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal, it is commonly presented after the recipient has been killed (posthumously). Top - Notes - References __NOTOC__ ==Recipients== Image Name Service Rank Date of action Unit Notes Army January 15, 1865 Company K, 142nd New York Infantry ”Voluntarily advanced with the head of the column and cut down the palisading” Navy Cabin Boy 24 December 1864 to 22 January 1865 Carried out his duties while under the fire of the enemy Navy Boatswain's Mate December 24–25, 1864 and January 13–15, 1865 ”[Was] commended for highly meritorious conduct” during an all day battle between his ship and Fort Fisher Navy January 15, 1865 ”Landing on the beach with the assaulting party from his ship, he advanced to the top of the sand hill and partly through the breach in the palisades despite enemy fire which killed and wounded many officers and men. When more than two-thirds of the men became seized with panic and retreated on the run, he remained with the party until dark, when it came safely away, bringing its wounded, its arms, and its colors.” Navy 15 January 1865 ”Landing on the beach with the assaulting party from his ship, S/man Bass advanced to the top of the sand hill and partly through the breach in the palisades despite enemy fire which killed and wounded many officers and men. When more than two-thirds of the men became seized with panic and retreated on the run, he remained with the party until dark, when it came safely away, bringing its wounded, its arms, and its colors” Navy Ordinary Seaman 15 January 1865 Was one of six men who entered the fort in an assault and accompanied his party in carrying dispatches at the height of the battle Navy 24 December 1864, to 22 January 1865 Marine Corps Sergeant 24 and December 25, 1864, and 13 to January 15, 1865 Navy Boatswain's Mate 24 December 1864 to 22 January 1865 Navy Quartermaster 13 to 15 January 1865 Although severely wounded he continued to perform his duties throughout the action Navy 15 January 1865 Navy Boatswain's Mate 24 and 25 December 1864; and 13 to 15 January 1865 Army 15 January 1865 Company G, 142d New York Infantry \"[V]oluntarily advanced with the head of the column and cut down the palisading\" Navy 15 January 1865 Army Brigadier General 15 January 1865 U.S. Volunteers Was the first to pass through the stockade and although being wounded 4 times led each assault on the traverses of the fort Navy 24 and 25 December 1864; and 13, 14, and 15 January 1865 Navy Quartermaster 24 and 25 December 1864; and 13, 14, and 15 January 1865 Navy Signal Quartermaster 24 and 25 December 1864; and 13, 14, and 15 January 1865 Navy Signal Quartermaster 13 to 15 January 1865 Army 15 January 1865 Company B, 169th New York Infantry \"Volunteered to carry the brigade flag after the bearer was wounded\" Marine Corps Orderly Sergeant 13 to 15 January 1865 Navy Captain of the Forecastle 15 January 1865 While working for one of the generals on shore he carried dispatches during the battle and was one of 6 who entered the fort in the assault Navy Quarter Gunner 24 and 25 December 1864; and 13, 14, and 15 January 1865 Navy 15 January 1865 Navy Quartermaster 13 to 15 January 1865 Navy 24 and 25 December 1864; and 13 to 15 January 1865 Navy Captain of the Hold 15 January 1865 Navy Quartermaster 24 and 25 December 1864; and 13, 14, and 15 January 1865 Army 15 January 1865 Company I, 142d New York Infantry \"Voluntarily advanced with the head of the column and cut down the palisading\" Navy Quarter Gunner 24 and 25 December 1864_ and 13,14 and 15 January 1865 Navy 15 January 1865 Army 16 January 1865 Company K, 142d New York Infantry Voluntarily advanced with the head of the column and cut down the palisading Army 15 January 1865 97th Pennsylvania Infantry \"Gallantly led the charge over a traverse and planted the colors of one of his regiments thereon, was severely wounded\" Navy Captain of the Main Top 24 and 25 December 1864; and 13 to 15 January 1865 Navy 15 January 1865 While working for one of the generals on shore he carried dispatches during the battle and was one of 6 who entered the fort in the assault Marine Corps 15 January 1865 Navy 15 January 1865 Navy 15 January 1865 Navy 15 January 1865 Marine Corps 15 January 1865 Navy Chief Quartermaster 13 to 15 January 1865 Navy Quartermaster 13 January 1865 Navy 15 January 1865 While working for one of the generals on shore he carried dispatches during the battle and was one of 6 who entered the fort in the assault Navy 15 January 1865 While working for one of the generals on shore he carried dispatches during the battle and was one of 6 who entered the fort in the assault Marine Corps 15 January 1865 Marine Corps 15 January 1865 Navy Chief Boatswain's Mate 15 January 1865 \"Despite severe enemy fire which halted an attempt by his assaulting party to enter the stockade, Tripp boldly charged through the gap in the stockade although the center of the line, being totally unprotected, fell back along the open beach and left too few in the ranks to attempt an offensive operation.\" Army First Lieutenant 15 January 1865 Company F, 97th Pennsylvania Infantry \"Gallant and meritorious conduct, where, as first lieutenant, he commanded the regiment.\" Navy 15 January 1865 Navy 24 and 25 December 1864; and 13,14, and 15 January 1865 Navy 15 January 1865 Navy 15 January 1865 Navy 24 and 25 December 1864; and 13, 14 and 15 January 1865 ==Notes== ==References== * ** ** Second Battle of Fort Fisher Category:Lists of the American Civil War",
 "title": "List of Medal of Honor recipients for the Second Battle of Fort Fisher"
}