{
 "id": "376928",
 "text": "World War II was a global military conflict. It is also called Second World War. It was the joining of what started off as two separate conflicts. The first began in Asia as the Second Sino-Japanese War. The other began in Europe in 1939 with the German invasion of Poland.Official military histories in Commonwealth nations refer to the conflict as the Second World War. United States' official histories refer to the conflict as World War II. English translations of the official histories of other nations tend to resolve into English as Second World War also. This global conflict split the majority of the world's nations into two opposing military alliances. On one side was the Allies. On the other was the Axis powers. It involved the mobilization of over 100 million military personnel. This made it the most widespread war in history. It placed the participants in a state of \"total war\". The distinction between civil and military resources were eliminated. This resulted in the complete activation of a nation's economic, industrial, and scientific capabilities for the purposes of the war effort. Over 60 million people, the majority of them civilians, were killed, making it the deadliest conflict in human history.Dunnigan, James; Albert Nofi. Dirty Little Secrets of World War II: Military Information No One Told You About the Greatest, Most Terrible War in History, William Morrow & Company, 1994. The financial cost of the war is estimated at about a trillion 1944 U.S. dollars worldwide,Mayer, E. (2000) \"World War II\" course lecture notes on Emayzine.com (Victorville, California: Victor Valley College)Coleman, P. (1999) \"Cost of the War,\" World War II Resource Guide (Gardena, California: The American War Library) making it the most costly war in capital as well as lives. The Allies won. The result was the United States and Soviet Union emerged as the world's two leading superpowers. During this conflict 464 United States military personnel received the Medal of Honor, 266 of them posthumously. Seventeen of these were Japanese-Americans fighting in both Europe and the Pacific. Additionally, the only recipient for the United States Coast Guard received the Medal for his actions during this war. The Medal of Honor was created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipient must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal, it is commonly presented posthumously. ==A== Image Name Service Rank Place of action Date of action Notes Army near St. Die, France For single-handedly destroying enemy machine gun emplacements to re-establish supply lines to U.S. Army companies Marine Corps Saipan, Marianas Islands Sacrificed his life to rescue wounded men under heavy enemy fire. After returning several times for more wounded was killed by an enemy sniper. Army Okinawa Risked his life to save several of his fellow soldiers and repel an enemy attack single-handedly. Marine Corps Roi Island, Kwajalein Atoll, Marshall Islands Sacrificed his life by smothering a grenade with his body to save fellow Marines. Army near Cisterna di Littoria, Italy Near Cisterna di Littoria, Italy, he charged 200 yards over flat, coverless terrain to destroy an enemy machinegun nest during the second day of the offensive which broke through the German cordon of steel around the Anzio beachhead. Navy Makassar, Celebes, Netherlands East Indies During the early part of his imprisonment at Makassar in April 1942, he saw a Japanese guard brutally beating a fellow prisoner of war and successfully intervened, at great risk to his own life. For his conspicuous act of valor, Antrim later received the Medal of Honor. Army Villa Verde Trail, Luzon, Philippine Islands Remained in his fox hole for 4 hours bearing the brunt of each enemy assault and maintaining fire until each charge was repulsed. Marine Corps Henderson Field, Guadalcanal, Solomon Islands – After reorganizing his unit and repelling an enemy attack. Continued to fight for hours after being severely wounded and dying from his wounds. Army Air Forces over Ploiesti, Romania (Operation Tidal Wave) For conspicuous gallantry and intrepidity above and beyond the call of duty in action with the enemy on August 1, 1943. On this date he led his command, the 93d Heavy Bombardment Group, on a daring low-level attack against enemy oil refineries and installations at Ploesti, Rumania. Army Saipan, Mariana Islands – Repeatedly risked his life in multiple battles over a period of several days. Refused to leave the battle after being severely wounded. At his request, his comrades left him propped against a tree and gave him a pistol, which had eight bullets remaining. When American forces retook the position, they found the pistol, now empty, and eight dead Japanese soldiers around Baker's body. Army near Viareggio, Italy – Demonstrated outstanding courage and leadership in destroying enemy installations, personnel and equipment during his company's attack against a strongly entrenched enemy in mountainous terrain Army near Carano, Italy For conspicuous gallantry and intrepidity at the risk of life above and beyond the call of duty on 23 May 1944, near Carano, Italy Army near St. Laurent-sur-Mer, France Joined the United States Army in Albany, New York, he was a member of, 18th Infantry, 1st Infantry Division. Barrett was one of four Medal of Honor recipients on D-Day, June 6, 1944. Marine Corps Lunga area, Guadalcanal, Solomon Islands – On the night of October 24–25, 1942 his unit engaged the Japanese in the Lunga area when their position came under attack by a regiment of approximately 3,000 soldiers. The Japanese forces began a frontal attack using machine guns, grenades and mortars against the American heavy machine guns. Basilone commanded two sections of machine guns that fought for the next 48 hours until only Basilone and two other men were still able to continue fighting. Basilone moved an extra gun into position and maintained continual fire against the incoming Japanese forces. He repaired another machine-gun and personally manned it, holding the defensive line until replacements arrived. With the continuous fighting, ammunition became critically low and supply lines were cut off. Basilone fought through hostile lines and returned with urgently needed ammunition for his gunners. He was killed on Iwo Jima on February 19, 1945. He was the first Enlisted Marine to receive The Medal of Honor, Purple Heart, and The Navy Cross. Marine Corps South Pacific area – For extraordinary heroism and conspicuous courage as Squadron Commander of Marine Fighting Squadron TWO TWELVE in the South Pacific Area during the period May 10 to November 14, 1942. Marine Corps Peleliu Island, Palau Group During combat at Peleliu, he covered an exploding Japanese hand grenade in order to protect his comrades, and died of his wounds three days later. Bausell was the only enlisted Marine from the Nation's capital, Washington, D.C. to be awarded the Medal of Honor for actions during World War II. Army Hamelin, Germany By his intrepidity, great fighting skill, and supreme devotion to his responsibility for the well- being of his platoon, 1st Lt. Beaudoin single-handedly accomplished a mission that enabled a messenger to secure help which saved the stricken unit and made possible the decisive defeat of the German forces. Army Mittelwihr, France By his intrepidity and bold, aggressive leadership, T/Sgt. Bell enabled his 8-man squad to drive back approximately 150 of the enemy, killing at least 87 and capturing 42. Personally, he killed more than 20 and captured 33 prisoners. Army near La Lande, France He had sparked and led the assault company in an attack which overwhelmed the enemy, destroying a roadblock, taking a town, seizing intact 3 bridges over the Maravenne River, and capturing commanding terrain which dominated the area. Army Leyte, Philippine Islands severely wounded while leading an assault against a strongly defended Japanese position on the island of Leyte. After being evacuated to an aid station, he conveyed valuable information regarding the disposition of the Japanese emplacement to his superiors. Army Heckhuscheid, Germany The fearless initiative, stalwart combat ability, and outstanding gallantry of Cpl. Bennett eliminated the enemy fire which was decimating his company's ranks and made it possible for the Americans to sweep all resistance from the town. Navy , Pearl Harbor While mortally wounded, he remained in command of his ship. For conspicuous devotion to duty, extraordinary courage, and complete disregard of his own life, he was awarded the Medal of Honor. Marine Corps Iwo Jima, Volcano Islands He landed on Iwo Jima on D-Day, February 19, 1945, and was killed in action on March 3, 1945, during the action which earned him the Medal of Honor. Army Hatten, France – In Hatten, France, he manned a machine gun in defense of a command post being attacked by a numerically superior German force. When evacuation became necessary, he voluntarily stayed behind to cover the withdrawal. The next morning he moved to another command post, and again defended it against a continued assault by strong German forces and voluntarily covered the withdrawal of friendly forces when the post was abandoned. For these actions, he was awarded the Medal of Honor one year later, on January 10, 1946. Army near Arloncourt, Belgium Near Arloncourt, Belgium, he used hand grenades and his carbine to single-handedly destroy two German machine gun positions before working his way through a honey-combed series of enemy foxholes—killing and capturing German soldiers as he went. For these actions, he was awarded the Medal of Honor by President Harry Truman seven months later, on August 30, 1945. Army near Bagac, Bataan Province, Philippine Islands After the action near Bagac in the Bataan Province, Bianchi was among the troops captured by the Japanese at the fall of Bataan,on April 9, 1942. He was part of the Bataan \"Death March,\" and was imprisoned in several Japanese prisoner of war camps, enduring horrible conditions. He was known for his compassion and efforts to better the lot of his fellow prisoners by bartering with their captors for extra food and medicine. On January 9, 1945, while imprisoned in an unmarked Japanese prison ship, Bianchi was killed instantly when an American plane, unaware that the ship contained American prisoners, dropped a 1,000-pound bomb in the cargo hold. Army near Soy, Belgium – When presenting the medal to Biddle, Truman whispered \"People don't believe me when I tell them that I'd rather have one of these than be President.\" Biddle was decorated with 17 other soldiers that served in the Eastern Theater of Operations. Navy Watertender First Class USS Fletcher, off Corregidor Island, Philippines While assisting minesweeping operations prior to landings on Manila Bay's Corregidor Island, Fletcher was hit by an enemy shell penetrated the No. 1 gun magazine, igniting several powder cases. Bigelow picked up a pair of fire extinguishers and rushed below in a resolute attempt to quell the raging flames. Refusing to waste the precious time required to don rescue-breathing apparatus, Bigelow plunged through the blinding smoke billowing out of the magazine hatch and dropped into the blazing compartment. Despite the acrid, burning powder smoke which seared his lungs, he succeeded in quickly extinguishing the fires and in cooling the cases and bulkheads, thereby preventing further damage to the ship. However Bigelow was badly injured and succumbed to his injuries the following day. Army near Altavilla, Italy Near Altavilla, Italy, he single- handedly attacked and destroyed two German machine gun emplacements and a mortar position. Army near Firenzuola, Italy Near Firenzuola, Italy, he led three soldiers in an attack on enemy positions which resulted in the capture of nineteen prisoners and the silencing of five machine gun nests. Army Petit- Coo, Belgium While his comrade provided covering fire from across the street, Bolden tossed grenades through a window, rushed to the door, and began firing. Wounded by the greatly superior number of German soldiers inside, he retreated from the house. Realizing that the Germans would not surrender, he returned to the house despite his serious wounds and killed the remaining soldiers. For these actions, he was awarded the Medal of Honor eight months later, on August 30, 1945. Army Mark River, Holland Army Air Forces over Borneo and Leyte – Fighter pilot with 40 kills. Top AAF score. Marine Corps Tarawa, Gilbert Islands – Army near Fondouk, Tunisia Marine Corps Tarawa, Gilbert Islands Army near Afua, New Guinea For smothering the blast of a grenade with his body. Marine Corps Central Solomons area – Fighter pilot with 26 victories. Army near Scherpenseel, Germany Army North of Mignano, Italy Played football for the Detroit Lions, later Lieutenant Governor of Arkansas. Army near Dagami, Leyte, Philippine Islands Army Crucifix Hill, Aachen, Germany Navy Philippine waters – Army Nuremberg, Germany Also known as Francis X. Burke. Army Buna, New Guinea For smothering the blast of a grenade with his body. Army near Dorrmoschel, Germany Army near Wurselen, Germany Marine Corps Mount Yaetake on Okinawa, Ryukyu Islands Navy Hospital Apprentice First Class Okinawa Jima, Ryukyu Islands Hospital Corpsman serving with Marines. Army Normandy, France , , and Was severely wounded on three occasions. Continued leading his men until June 23 when he was killed. He was 21 years of age. Marine Corps Iwo Jima, Volcano Islands Navy Naval Battle of Guadalcanal, Savo Island – Army Culis, Bataan Province, Philippine Islands Marine Corps Sand Island, Midway Islands Army near Plougastel, Brittany, France Mortally wounded while single-handedly attacking an enemy pillbox Army Rimling, France – Army near Guignola, Italy – Army Air Forces over the South China Sea Army near Speyer, Germany Marine Corps Guadalcanal, Solomon Islands Army Air Forces Germany Marine Corps Iwo Jima, Volcano Islands – Army Air Forces near Wewak, New Guinea Army Oliveto, Italy Army near Bruyeres, France Army Driniumor River, New Guinea – Army near Valmontone, Italy – Army South Manila, Luzon, Philippine Islands Army near Kalborn, Luxembourg and near Sevenig, Germany and Army near Untergriesheim, Germany Marine Corps Iwo Jima, Volcano Islands Namesake of . Army near Carentan, France For leading a charge across a field swept by German machineguns and artillery. Army Cape Cavalaire, southern France Army near Lumboy, Luzon, Philippine Islands Army East of Belmont sur Buttant, France – Marine Corps Okinawa Shima, Ryukyu Islands – Army near Krinkelter Wald, Belgium Army Hen Hill, Okinawa, Ryukyu Islands Army near Favoratta, Sicily Army Haguenau, France Army Air Forces near Port Lyautey, French Morocco Army near Altavilla, Italy Army near Lobenbacherhof, Germany Navy USS Sculpin, off Truk Island Stayed aboard a sinking submarine to prevent military secrets he possessed from falling into enemy hands. Army Malmedy, Belgium Rescued several men and women while destroying a building with enemy soldiers. Army Oberhoffen, France Army near Kalterherberg, Germany Army Nuremberg, Germany Marine Corps Engebi Island, Eniwetok Atoll, Marshall Islands – Navy off French West Africa For leading a boarding party that successfully captured U-505. Army near Artena, Italy Army Guadalcanal Island Navy USS Walke, Lingayen Gulf, Luzon, Philippine Islands Marine Corps Okinawa, Ryukya Islands – Navy USS Harder, near Philippine Islands – Marine Corps off Kolombangara Island, Solomons group Army near Vaubadon, France Army Merderet River at la Fiere, France Army Oberhoffen, France – Army near Cisterna, Italy Army Mintal, Mindanao, Philippine Islands – Army Kirchain, Germany Army Air Forces over Japan For leading the Doolittle Raid over the Japanese mainland. Army near Urasoe Mura, Okinawa, Ryukyu Islands – The first conscientious objector to receive a Medal of Honor, for saving many lives while acting as a medic. Army Bougainville, Solomon Islands Army near Kayserberg, France Marine Corps Iwo Jima, Volcano Islands – Army near Ponte Rotto, Italy Marine Corps Namur Island, Kwajalein Atoll, Marshall Islands – Marine Corps Solomon Islands – Army near Goville, France – Marine Corps Wake Island – Army near Anamo, New Guinea Marine Corps Island of Saipan, Marianas Army Air Forces Koriyama, Japan Army Noemfoor Island, Dutch New Guinea Navy USS Johnston, off Samar Army near Kerling, France Marine Corps Okinawa Shima, Ryukyu Islands Army Air Forces over Merseburg, Germany Army Rechicourt, France Navy Chief Aviation Ordnanceman Naval Air Station, Kaneohe Bay, Oahu, Hawaii Army near Grammont, France – Navy Pearl Harbor, Hawaii Marine Corps Midway Atoll – Navy , along east coast of China – Marine Corps over Guadalcanal – and For shooting down 26 aircraft as leader of the Flying Circus. Later became a Governor of South Dakota. Marine Corps Okinawa Shima, Ryukyu Islands Army Mount Austen, Guadalcanal, Solomon Islands Army near Carano, Italy Army near Sommocolonia, Italy Army Leyte, Philippine Islands Army Holzheim, Belgium Navy Pearl Harbor, Territory of Hawaii For heroism aboard the USS Arizona. Marine Corps Solomon Islands area – For service in the Solomon Islands as the leader of a Marine fighter squadron. Army Villa Crocetta, Italy For his leadership and courage in directing an assault against an entrenched force that had repulsed two previous attacks. Army near Bastogne, Belgium While under fire from a German machine gun and tank, counterattacked the German force and forced them to retreat with grenade and small arms fire. Army near Grosshau, Germany Army near Montereau, France Medic, for braving enemy fire to tow a boat of wounded to safety. Navy Japanese home islands near Kobe, Japan For braving hazardous conditions on the USS Franklin when it was hit by enemy fire to save sailors trapped inside the vessel's hull. Army Siegfried Line near Berg, Germany Army near Isola Bella, Italy Navy USS Growler, southwest Pacific – Marine Corps Okinawa Shima, Ryukyu Chain Army Villa Verde Trail, Luzon, Philippine Islands Navy Bismarck Sea Later Lieutenant Governor of Arkansas Army Air Forces Saarbrücken, Germany Army Manila, Luzon, Philippine Islands For using his body to shield a wounded officer from hostile fire. Marine Corps Iwo Jima, Volcano Islands Army near Montelimar, France Army near Buna, New Guinea Marine Corps Bougainville Island, Solomon Islands Archipelago Fell on a grenade that landed in his foxhole, saving the man with him Army near Bruyeres and Biffontaine, eastern France , , and Army near Anzio, Italy Army Mount Austen, Guadalcanal, Solomon Islands Navy Coral Sea – Army Brest, Brittany, France Navy Pharmacist's Mate Second Class Okinawa Shima, Ryukyu Chain Corpsman serving with Marines Army Air Forces near Port Lyautey, French Morocco Navy Boatswain's Mate Second Class West Loch, Pearl Harbor Marine Corps Okinawa Shima, Ryukyu Chain Marine Corps Bougainville Island and New Britain Island and Army near Casaglia, Italy Army near Maglamin, Mindanao, Philippine Islands Marine Corps Iwo Jima, Volcano Islands Army Vagney, France Army near Cerasuolo, Italy Army Drabenderhohe, Germany Marine Corps Okinawa Shima in the Ryukyu Chain Army near Chambois, France Marine Corps Tarawa, Gilbert Islands – Army near Carano, Italy Army near Tendola, Italy and Army near Cerasuolo, Italy Army near Lembeck, Germany – Army near Assenois, Belgium Army Luchem, Germany Army near Mertzwiller, France Navy as commanding officer aboard a landing craft, USS LCI (G) 449, Iwo Jima Navy Chief Boatswain Pearl Harbor, Hawaii Army Wurselen, Germany Army Air Forces over Oschersleben, Germany only fighter pilot in the European Theater of Operations in World War II to be awarded the Medal of Honor Army near Carano, Italy Army Air Forces Ploesti Raid, Romania Navy Seaman First Class aboard a landing ship, USS LST 473, off Lae, New Guinea Army near San Terenzo, Italy Later became a U.S. Senator representing Hawaii. Served as President pro tempore of the United States Senate and was third in line to the Presidency of the United States; highest ranking Asian-American politician in U.S. history. Army Flamierge, Belgium Marine Corps Island of Peleliu, Palau group Marine Corps Iwo Jima, Volcano Islands Army near Lippoldsberg, Germany Army Air Forces Ploesti Raid, Romania Army near Valmontone, Italy Army Air Forces Ploesti Raid, Romania Army near Limon, Leyte, Philippine Islands Army near Scarperia, Italy – Army near Padiglione, Italy – Navy Pearl Harbor, Hawaii Marine Corps Iwo Jima, Volcano Islands Army near La Forge, France Army Air Forces Ploesti Raid, Romania Army Air Forces near Wewak, New Guinea Army Mt. Altuzzo, Italy Army near Bennwihr, France – Army Kesternich, Germany – Army Leyte, Philippine Islands Army near Altavilla, Italy Army Fort du Roule, Cherbourg, France Army Alemert, Germany Navy Boatswain's Mate First Class USS San Francisco, Solomon Islands – Army near Galiano, Luzon, Philippine Islands Army near Ponte Rotto, Italy Navy Pearl Harbor, Hawaii Army near Rocherath, Belgium Army near Palenberg, Germany Army Air Forces Ploesti Raid, Romania Marine Corps Okinawa Shima, Ryukyu Chain Army near Gagliano, Sicily Army near Cisterna di Littoria, Italy Army near LoiKang, Burma Army Air Forces northern Po Valley, Italy – Army near Lanuvio, Italy Marine Corps Peleliu, Palau Islands Army Balete Pass, Luzon, Philippine Islands Army near Bruyeres, France Marine Corps Iwo Jima, Volcano Islands Army Air Forces over Europe Army Pangasinan Province, Luzon, Philippine Islands Army Montreval, France Marine Corps Iwo Jima, Volcano Islands Army Kommerscheidt, Germany – Navy Hospital Apprentice First Class Okinawa Shima, Ryukyu Chain Army Air Forces L'Isle Adam railroad bridge over the Seine, France Army near Hamich, Germany Army near Mignano, Italy Army near Pompey, France Army near Afua, New Guinea Army near Salerno, Italy Army near Krinkelt, Belgium Marine Corps Iwo Jima, Volcano Islands Youngest recipient since the Civil War (turned 17 just 5 days before Iwo Jima D-Day) Marine Corps Iwo Jima, Volcano Islands Had earlier played football for the New York Giants. Army Hurtgen Forest near Schevenhütte, Germany Army General Bataan Peninsula, Philippine Islands With his father, Arthur MacArthur, Jr., became first father and son pair to both receive the Medal of Honor. Army near Woelfling, France Immigrant from Canada. Army near Castel d'Aiano, Italy Army Best, Holland Marine Corps Iwo Jima, Volcano Islands Army Attu, Aleutians Marine Corps Asan- Adelup Beachhead, Guam, Marianas Islands Army Air Forces over Germany Army Air Forces over Vegesack, Germany Army near Besançon, France Army legusuku-Yama, Ie Shima, Ryukyu Islands – Defended his machine gun position for 3 days against Japanese attacks, even when wounded, thus maintaining the American lines. Refusing to withdraw when his machine gun was disabled, he used hand grenades to fight to his death. Army Cordillera Mountains, Luzon, Philippine Islands Army near San Angelo, Italy Navy Commander First and second battles of the Philippine Sea Top Navy flying ace. 34 kills. Navy Commander Battle off Savo Island – Marine Corps Saipan, Marianas Islands For saving the lives of his tank crewmen. Army Corregidor, Philippine Islands – Marine Corps Iwo Jima, Volcano Islands Navy Lieutenant off Okinawa – Army near Lupao, Luzon, Philippine Islands Army near Krinkelt, Belgium Army near Mulheim, Germany Army Los Negros Islands, Admiralty Group Army near Schevenhütte, Germany Army Air Forces Major over Luzon, Philippine Islands – The second leading air ace in World War II before being killed in action in January 1945. McGuire Air Force Base is named for him. Army Tayabas Province, Luzon, Philippine Islands Marine Corps Okinawa, Ryukyu Chain Army near Brest, France Army Leyte, Philippine Islands Army near Ozato, Okinawa Army near Sars la Bruyere, Belgium – Held off German troops overnight, even when his machine gun nest was captured. Army near Lohe, Germany Army near Radden, France Army Air Forces Saarbrücken, Germany Army Air Forces over Germany Army near Neiderzerf, Germany Army from Woippy, France to Kerprich Hemmersdorf, Germany – Army near Cisterna di Littoria, Italy Army near Hurtgen, Germany Army near MedjezelBab, Tunisia Army near Colleville-sur-Mer, Normandy, France Army near, Padiglione, Italy Army Pawig, Leyte, Philippine Islands Army Air Forces over Germany Army Kakazu Ridge, Okinawa, Ryukyu Islands Army near Castellina, Italy Army near Capoocan, Leyte, Philippine Islands Army near Ishimmi, Okinawa, Ryukyu Islands – Army near Seravezza, Italy For taking out two machine-gun emplacements and jumping onto a grenade to save 2 soldiers. Coast Guard Signalman First Class off Point Cruz, Guadalcanal Only member of the Coast Guard to receive the Medal of Honor. Army near Suvereto, Italy Army near Holtzwihr, France Highest number of decorations for US combatant. Army Siegfried Line at Saarlautern, Germany Army near Kaysersberg, France Army near Pisa, Italy Army near La Torreto, Italy Army near Castellina, Italy Army Djebel Dardys, Northwest of Sedjenane, Tunisia Army Birgel, Germany Army near Cognon, Leyte, Philippine Islands Marine Corps Peleliu Island, Palau Group Army near Cisterna, Italy For single- handedly destroying three machine gun emplacements. Army near Abucay, Bataan, Philippine Islands Army near La Houssiere, France Army Saipan, Marianas Islands – Navy Commander near Kobe, Japan Chaplain aboard aircraft carrier . Army near Fort du Roule, France Navy Lieutenant off Papua New Guinea O'Hare International Airport in Chicago was named in his memory. Army near Cerasuolo, Italy – Navy Commander Philippine Islands – For submarine operations against two Japanese convoys. Army Foret Domaniale de Champ, near Biffontaine, France – and Army on Mount Belvedere, Italy Army crossing of the Volturno River, Italy Army near Cisterna di Littoria, Italy – Army near Castellina, Italy Army near Tettingen, Germany For single-handedly destroying two bunkers while being seriously wounded. Currently the oldest living Medal of Honor recipient. Army near Pieve Di S. Luce, Italy Marine Corps Cape Torokina, Bougainville, Solomon Islands Marine Corps Tinian Island, Marianas Islands Private Ozbourn saved the lives of four fellow Marines by jumping on the top of a live hand grenade. Marine Corps Battle of Guadalcanal, Solomon Islands Navy Ensign aboard a landing ship, USS LST 375, off Sicily – Army Binalonan, Luzon, Philippine Islands – Army Air Forces near Rabaul, New Britain – Army near Biesheim, France Army Bardenberg, Germany Army Grandcampe, France Army Fort William McKinley, Luzon, Philippine Islands Army near Fluren, Germany Army near Eisern, Germany Navy Chief Watertender , Battle of the Coral Sea Army Horseshoe Hill, New Georgia, Solomon Islands Navy Gunner Pearl Harbor, Territory of Hawaii Marine Corps Battle of Peleliu, Palau Islands Marine Corps Iwo Jima, Volcano Islands Navy Pharmacist's Mate First Class Iwo Jima – Army near Colleville-sur-Mer, France Marine Corps Peleliu Island, Palau group – Marine Corps Namur Island, Kwajalein Atoll, Marshall Islands Navy Lieutenant over the Coral Sea and adjacent waters – Army northwest of Cassino, Italy Navy Lieutenant Wasile Bay, Halmahera Island Army near Les Coates, Brittany, France Army Air Forces Ploesti Raid, Romania Navy Commander , south of Taiwan Sunk enemy ships in gallant action. Army Hurtgen Forest near Schevenhütte, Germany Army Mt. Vassillio, Sicily Sent mortars into enemy position in the line of fire so that his comrades can get across the hill. Shot down after the mortars were finally used up. Army Paco Railroad Station, Manila, Philippine Islands Navy Chief Radioman , Pearl Harbor Died on the USS California. Navy Lieutenant USS Yorktown, Battle of the Coral Sea Army near Cassino, Italy – Army toward Guebling, France – Marine Corps Peleliu, Palau Islands Army near Untergriesheim, Germany Army Paco Railroad Station, Manila, Philippine Islands Army Mt. Battaglia, Italy – Navy USS Houston – Commanded USS Houston during early days of war. Led during Battle of Java Sea. Killed in action while attempting to lead Houston and HMAS Perth to safety in Sunda Strait. Army Brigadier General Utah Beach, Normandy invasion With his father, Theodore Roosevelt, became second father and son pair to both receive the Medal of Honor. Died of a heart attack before he could receive the award. Navy Machinist Pearl Harbor, Territory of Hawaii Army near St. Jacques, France Marine Corps Peleliu Island, Palau group Army Munoz, Luzon, Philippine Islands For destroying 8 pillboxes, a trench and a tank while under fire. Marine Corps Iwo Jima, Volcano Islands – Army Okinawa, Ryukyu Islands Army Valhey, France Army Hill 617, near Biffontaine, France Army Saipan, Marianas Islands Army Air Forces over Buka area, Solomon Islands Army near Thionville, France Army near Stolberg, Germany Army near Cisterna di Littoria, Italy – Navy Commander Savo Island – Took command of USS San Francisco after captain had been killed, fought ship and led her to safety. Marine Corps Okinawa Shima, Ryukyu Islands Navy Rear Admiral off Savo Island – and – Navy Machinist's Mate First Class Pearl Harbor, Hawaii Army Lieutenant near Munda Air Strip, New Georgia, Solomon Islands For single-handedly defeating a Japanese patrol. Army near Mount Damiano, Italy Army Frenzenberg Castle, Weisweiler, Germany Army Villa Verde Trail, Luzon, Philippine Islands Army Air Forces Major over Luzon, Philippine Islands 7 victories in one action Army near Tillet, Belgium Marine Corps Colonel Betio Island, Tarawa Atoll, Gilbert Islands – Wrote battle plan for Tarawa assault, directed assault from trench on Betio beach as first waves came ashore.Twenty-second Commandant of the United States Marine Corps (January 1, 1960 – December 31, 1963) Marine Corps Iwo Jima, Volcano Islands Army near St. Pravel, France Army near San Jose Hacienda, Negros, Philippine Islands Marine Corps Asan-Adelup beachhead, Guam, Marianas Islands – Army near Oliveto, Italy Army near Lanuvio, Italy Marine Corps Major Solomon Islands area – Army Air Forces over Brest, France AKA- Snuffy Smith. On his first mission as a B-17 gunner Sgt. Smith helped save the lives of six of his wounded comrades, put out a fire, and drove off waves of German fighters. Army near Rocherath, Belgium Marine Corps Namur Island, Kwajalein Atoll Marshall Islands – Army Mount Porchia, Italy Army Achain, France Army near Padiglione, Italy – Marine Corps Iwo Jima, Volcano Islands First Medal of Honor of Iwo Jima Navy Lieutenant Commander harbor of Quelpart Island, off the coast of Korea For torpedoing three enemy ships while captain of USS Triante. Army near Wesel, Germany Marine Corps Solomon Islands area For downing eight Japanese Vals off the coast of Guadacanal Army near Molino A Ventoabbto, Italy Army Zebra Hill, Okinawa, Ryukyu Islands Army near Climbach, France Marine Corps Koromokina River, Bougainville Islands, Solomon Islands Army Zambales Mountains, Luzon, Philippine Islands Marine Corps Island of Makin – Army near Haaren, Germany Army near Grufflingen, Belgium Army Dagami, Leyte, Philippine Islands Marine Corps Saipan, Marianas Islands Navy Chief Watertender , Pearl Harbor, Hawaii Army Saulx de Vesoul, France Army near Oosterhout, Holland Army near Nieder-Wurzbach, Germany Army Air Forces over Europe Army Dahl, Luxembourg Army Philippsbourg, France – Army Renouf, France – For bravery as a company commander during combat operations. Army near Rosenkrantz, France Army near Finschafen, New Guinea Navy Pearl Harbor, Hawaii Commanding officer of the USS Arizona. Navy Lieutenant Commander Greenwich Island, battle of the Solomon Islands Army Air Forces over Wimereaux, France Died in unrelated air crash before receiving his Medal. Marine Corps Major General Battle of Guadalcanal, Solomon Islands – Later became the 18th Commandant of the Marine Corps. Army Manila, Luzon, Philippine Islands Army Villa Verde Trail, Luzon, Philippine Islands Army near Limon, Leyte, Philippine Islands Alone, faced six enemy tanks on a road, destroying five and halting the enemy attack. Army Air Forces over Bremen, Germany Navy Pharmacist's Mate Second Class Iwo Jima, Volcano Islands group Army Leyte, Philippine Islands Deliberately exposed himself to fire from Japanese pillboxes and led men on the beachhead. Was killed in assault on last pillbox. Army Lieutenant General Philippine Islands – Army Air Forces Brigadier General Rabaul, New Britain For Conspicuous Leadership above and beyond the call of Duty Army near Prümzurlay, Germany Marine Corps Solomon Islands area and Marine Corps Iwo Jima, Volcano Islands Navy Seaman First Class Pearl Harbor, Hawaii Army near Sigolsheim, France Army near Dom Butgenbach, Belgium – Army at sea near New Guinea Marine Corps Iwo Jima, Volcano Islands – Army near Tremensucli, Italy – Army near Agrigento, Sicily Army St. Hippolyte, France Army Birken, Germany Army Sigolsheim, France Army near Grimesnil, France Army near, Chaumont, Belgium Army Monte Frassino, Italy Army Colonel Fedala, North Africa Army Siegfried Line in Germany Army Air Forces Major near Rabaul, New Britain Army near Eisern, Germany Marine Corps Iwo Jima, Volcano Islands Navy Pharmacist's Mate Third Class Iwo Jima, Volcano Islands Navy Pharmacist's Mate First Class Iwo Jima, Volcano Islands Army near Bezange la Petite, France Marine Corps Fonte Hill, Guam – Later Became Commandant of the Marine Corps Marine Corps Tinian Island, Marianas Group Army Magliano, Italy Marine Corps Battle of Finegayen, Guam, Marianas Army near Tabio, Luzon, Philippine Islands Navy Commander USS Vestal, Pearl Harbor, Territory of Hawaii Moved his ship, the , away from the battleship , and subsequently beached it upon determining that such action was required to save his ship. Army New Georgia, Solomon Islands After being pinned by enemy fire for a long time, he single-handedly attacked and destroyed an enemy machine-gun pillbox, although he died of his injuries right afterwards. His actions helped the rest of the unit return to base without taking anymore casualties. Army Air Forces over Buka area, Solomon Islands Volunteered as pilot of a bomber on an important photographic mapping mission covering the formidably defended area in the vicinity of Buka, Solomon Islands Army Noroy le Bourg, France In lead of a tank killed 18 enemy soldiers and captured 92 N.B. A in the citation indicates that the award was given posthumously. ==Notes== : ==References== * * * * * * * World War II",
 "title": "List of Medal of Honor recipients for World War II"
}