{
 "id": "377016",
 "text": "Yukio Okutsu (November 3, 1921 - August 24, 2003) was a United States Army soldier.Goldstein, Richard. \"Yukio Okutsu, 81, Soldier Who Led Attack on Germans,\" New York Times. September 14, 2003; retrieved 2012-12-7. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (M-S)\" ; retrieved 2012-12-7. == Early life == Okutsu was born in Koloa, Hawaii to Japanese immigrant parents. He was a Nisei, which means that he was a second generation Japanese-American. ==Soldier== Okutsu joined the US Army in March 1943.National Archives and Records Administration (NARA), WWII Army Enlistment Record #30103687 (Okutsu, Yukio); retrieved 2012-12-7. Okutsu volunteered to be part of the all-Nisei 442nd Regimental Combat Team. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; retrieved 2012-12-7.For his actions in April 1945, Okutsu was awarded the Army's second-highest decoration, the Distinguished Service Cross (DSC). In the 1990s, there was a review of service records of Asian Americans who received the DSC during World War II. Okutsu's award was upgraded to the Medal of Honor. In a ceremony at the White House on June 21, 2000, he was presented with his medal by President Bill Clinton. Twenty-one other Asian Americans also received the medal during the ceremony, but only seven of them were still alive.\"21 Asian American World War II Vets to Get Medal of Honor\" at University of Hawaii Digital History ; retrieved 2012-12-27. ==Medal of Honor citation== Okutsu's Medal of Honor recognized his conduct in frontline fighting in northern Italy in 1945. Without the help of others, he silenced three machine gun nests.CMH, \"Asian Pacific American Medal of Honor recipients\" ; retrieved 2012-12-28. The words of Okutsu's citation explain: > Technical Sergeant Yukio Okutsu distinguished himself by extraordinary > heroism in action on 7 April 1945, on Mount Belvedere, Italy. While his > platoon was halted by the crossfire of three machine guns, Technical > Sergeant Okutsu boldly crawled to within 30 yards of the nearest enemy > emplacement through heavy fire. He destroyed the position with two > accurately placed hand grenades, killing three machine gunners. Crawling and > dashing from cover to cover, he threw another grenade, silencing a second > machine gun, wounding two enemy soldiers, and forcing two others to > surrender. Seeing a third machine gun, which blocked his platoon's advance, > he moved forward through heavy small arms fire and was stunned momentarily > by rifle fire, which glanced off his helmet. Recovering, he bravely charged > several enemy riflemen with his submachine gun, forcing them to withdraw > from their positions. Then, rushing the machine gun nest, he captured the > weapon and its entire crew of four. By these single-handed actions he > enabled his platoon to resume its assault on a vital objective. The > courageous performance of Technical Sergeant Okutsu against formidable odds > was an inspiration to all. Technical Sergeant Okutsu's extraordinary heroism > and devotion to duty are in keeping with the highest traditions of military > service and reflect great credit on him, his unit, and the United States > Army.Gomez-Granger, Julissa. (2008). Medal of Honor Recipients: 1979-2008, > \"Okutsu, Yukio,\" p. 17 [PDF 21 of 44]; retrieved 2012-12-7. ==Namesake== Okutsu is the namesake of the Yukio Okutsu Veterans Home at Hilo. It is the first veterans home operated by the state government in Hawaii.Dayton, Kevin. \"First veterans home run by state of Hawaii opens,\" Hawaii Advertiser. November 13, 2007; retrieved 2012-12-7. ==Related pages== *List of Medal of Honor recipients for World War II *List of Asian American Medal of Honor recipients == References == ==Other websites== * \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov * Category:1921 births Category:2003 deaths Category:Military people from Hawaii Category:United States Army Medal of Honor recipients Category:American people of World War II",
 "title": "Yukio Okutsu"
}