{
 "id": "377020",
 "text": "The Boxer Movement or Boxer Rebellion was a Chinese uprising from November 1899 to September 7, 1901. It was against foreign influence in areas such as trade, politics, religion and technology that occurred in China during the final years of the Manchu rule (Qing Dynasty). The members of the Chinese Society of Righteous and Harmonious Fists were simply called boxers by the Westerners. This was due to the martial arts and calisthenics they practiced. It began as an anti-foreign, anti-imperialist, peasant-based movement that attacked foreigners who were building railroads and violating Feng shui. Christians who they felt were responsible for foreign domination of China were also targeted. In June 1900, the Boxers invaded Beijing and killed 230 non- Chinese. Before it ended, tens of thousands of Chinese Christians, Catholic and Protestants were killed. Most of them in the Shandong and Shanxi provinces. The government of Empress Dowager Cixi gave her support to the boxers. This caused foreign diplomats, civilians, soldiers and even some Chinese Christians to retreat. They went to the legation quarter. They held out against the boxers for 55 days. A multinational coalition rushed 20,000 troops to their rescue. The Chinese government was forced to compensate the victims and make many additional concessions. Subsequent reforms implemented after the crisis of 1900 laid the foundation for the end of the Qing Dynasty. It establishment of the modern Chinese Republic. The Medal of Honor was created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipients must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal it is commonly presented after the recipient has been killed (posthumously). During the Boxer rebellion, 59 American servicemen received the Medal of Honor for their actions. Four of these were for Army personnel, twenty-two went to navy sailors and the remaining thirty-three went to marines. Harry Fisher was the first Marine to receive the medal posthumously and the only posthumous recipient for this conflict. ==Recipients== Image Name Service Rank Place of action Date of action Notes Marine Corps \"[For] distinguishing himself by meritorious conduct\" Marine Corps \"[For] distinguishing himself by meritorious conduct\" Navy China and – \"[For] distinguishing himself by meritorious conduct\" Marine Corps Tianjin, China \"[A]ssisted in destroying buildings occupied by the enemy\" Marine Corps Beijing, China – \"[A]ssisted in the erection of barricades\" Army Tianjin, China \"While under fire rescued two of his men from drowning\" Marine Corps Tianjin, China \"[A]ssisted in destroying buildings occupied by hostile forces\" Marine Corps Tianjin, China For distinguishing himself by his conduct during the advance on Tientsin Marine Corps Beijing, China – For distinguishing himself by his conduct in the presence of the enemy Navy China and – For distinguishing himself by his conduct in the presence of the enemy. Navy China and – For distinguishing himself by his conduct in the presence of the enemy. Marine Corps \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China For distinguishing himself by meritorious conduct. Later awarded a second Medal of Honor for action in Haiti in 1915. Marine Corps Beijing, China – True name: Franklin J. Phillips (enlisted under alias); previously served in the U.S. Army. First US Marine to receive Medal of Honor posthumously. Marine Corps \"[For] distinguishing himself by meritorious conduct\" Marine Corps \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy China and – \"[For] distinguishing himself by meritorious conduct\" Navy China and – \"[D]istinguished himself by meritorious conduct\" Navy China and – \"[D]istinguished himself by meritorious conduct Marine Corps Tianjin, China He crossed the river in a small boat while under heavy enemy fire and assisted in destroying buildings occupied by the enemy Navy China and – \"[D]istinguished himself by meritorious conduct\" Marine Corps Beijing, China – \"[A]assisted in the erection of barricades\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Marine Corps Tianjin, China \"[For] distinguishing himself by meritorious conduct\" Navy China and – \"[D]istinguished himself by meritorious conduct\" Army Tianjin, China Carried a message and guided reinforcements across a wide and fireswept space, during which he was wounded three times Marine Corps Tianjin, China \"[For] distinguishing himself by meritorious conduct\" Navy Tianjin, China Crossed the river in a small boat and assisted in destroying buildings occupied by the enemy Navy China and – Later awarded a second Medal of Honor for action in Mexico in 1915. Navy Beijing, China \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China – Assisted in the erection of barricades under a heavy fire from the enemy Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China – \"[D]istinguished himself by meritorious conduct\" Served under the name of Henry W. Davis. Marine Corps China and – \"[D]istinguished himself by meritorious conduct\" Navy Beijing, China – \"[D]istinguished himself by meritorious conduct\" Marine Corps China and – For distinguishing himself by meritorious conduct in the presence of the enemy Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy Beijing, China and – For his actions during the China Relief Expedition Navy China and – \"[D]istinguished himself by meritorious conduct\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy China and – Along with six others repulsed an attack by 300 Chinese Imperialist soldiers and Boxer militants with a bayonet charge Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy China and – In the presence of the enemy he distinguished himself by meritorlous conduct Navy China and – In the presence of the enemy he distinguished himself by meritorious conduct Navy Beijing, China Volunteered to carry messages under fire Marine Corps China and – In the presence of the enemy he distinguished himself by meritorious conduct Marine Corps Tianjin, China Although under heavy fire from the enemy he assisted in carrying a wounded officer from the field of battle Navy China and – \"[D]distinguished himself by meritorious conduct\" Army Beijing, China Gallant and daring conduct in the presence of the men of his regiment and was the first to scale the wall of the city. Navy China and – \"[D]istinguished himself by meritorious conduct\" Marine Corps Beijing, China – \"[A]ssisted in the erection of barricades\" Army Tianjin, China \"Although previously wounded while carrying a wounded comrade to a place of safety, rejoined his command, which partly occupied an exposed position upon a dike, remaining there after his command had been withdrawn, singly keeping up the fire, and obliviously presenting himself as a conspicuous target until he was literally shot off his position by the enemy.\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Navy China and – Distinguished himself by meritorious conduct while serving with the relief expedition Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" Marine Corps Beijing, China – \"[For] distinguishing himself by meritorious conduct\" ==References== ;General * ;Specific ==Further reading== * Boxer Rebellion",
 "title": "List of Medal of Honor recipients for the Boxer Rebellion"
}