{
 "id": "377060",
 "text": "Zero Dark Thirty is a 2012 American thriller movie about the hunt for Osama bin Laden. It was directed by Kathryn Bigelow. The film stars Jessica Chastain, Chris Pratt and James Gandolfini. The main character Maya at the Central Intelligence Agency is fictional. However, the story is based on real events. Zero Dark Thiry was a critical success. It is considered one of the best movies of 2012. There was controversy on how the film showed torture.Greenwald, Glenn (December 14, 2012). \"Zero Dark Thirty: CIA hagiography, pernicious propaganda\". The Guardian. London. Archived from the original on December 15, 2013. == Plot == Maya Harris works at the CIA to find Osama bin Laden. A suspected terrorist, Ammar says the courier of Osama bin Laden may be Abu Ahmed al-Kuwaiti. Later another suspect denies knowing Abu Ahmed. A Jordanian doctor tricks CIA agents into trusting them. He blows himself up and kills the agents. Another suspect tells Maya he buried Abu Ahmed. Maya believes that the death of Abu was the death of his brother Habeeb. May tells Dan from the CIA headquarters about this. The two track the phone of Ibrahim Sayeed. He went under the name Abu Ahmed al-Kuwaiti. The car of Sayeed arrives at a compound in Abbottabad, Pakistan. Shooters attack Maya. The CIA calls her job off because they think she is exposed. In the US, Officials discuss whether to attack the compound. 160th Special Operations Aviation Regiment attack the compound and kill Osama bin Laden on May 2, 2011. == Cast == * Jessica Chastain as Maya Harris, a CIA intelligence analyst * Jason Clarke as Dan Fuller, a CIA intelligence officer * Jennifer Ehle as Jessica Karley, a senior CIA analyst * Mark Strong as George Panetta, a senior CIA supervisor * Kyle Chandler as Joseph Bradley, Islamabad CIA Station Chief * James Gandolfini as CIA Director * Harold Perrineau as Jack Fuller, a CIA analyst * Mark Duplass as Steve Bradley, a CIA analyst * Fredric Lehne as Fred \"The Wolf\" Guerrero, a CIA section chief * John Barrowman as Jeremy Karley, a CIA executive * Jessie Collins as Debbie Stone, a CIA analyst * Édgar Ramírez as Larry Handley, a CIA SAD/SOG operative * Fares Fares as Hakim, a CIA SAD/SOG operative * Scott Adkins as John Simmons, a CIA SAD/SOG operative * Jeremy Strong as Thomas, a CIA analyst == Reception == The film got very positive reviews. It has a 91% rating on Rotten Tomatoes. Critics said the movie was gripping and suspenseful.They also praised that the film showed how life is. The film was considered authentic.Denby, David (December 24, 2012). \"Dead Reckoning\". The New Yorker. Archived from the original on December 19, 2012. Zero Dark Thirty made many Critics' top tens list.\"2012 Film Critic Top Ten Lists\". Metacritic. Archived from the original on June 29, 2018. Retrieved July 27, 2022. The film was also controversial. Some criticized the movie for seeming to support torture. Some said it was a pro-Obama movie. Others said the movie wrongly got classified material. == References ==",
 "title": "Zero Dark Thirty"
}