{
 "id": "377013",
 "text": "The United States occupation of the Mexican port of Veracruz lasted for six months. It occurred in the midst of poor diplomatic relations between Mexico and the United States. It also related to the ongoing Mexican Revolution. In response to the Tampico Affair President Woodrow Wilson ordered the U.S. Navy to prepare for the occupation of the port of Veracruz. While waiting for authorization of Congress to carry out such action, Wilson was alerted to a German delivery of weapons. They were for Victoriano Huerta due to arrive to the port on April 21. Because of this Wilson issued an immediate order to seize the port's customs office. They were also ordered to confiscate the weaponry. The Medal of Honor was created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipient must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal it is commonly presented after the recipient has been killed (posthumously). Secretary of the Navy Josephus Daniels ordered that 56 Medals of Honor be presented to participants in the occupation of Veracruz. This was the most for any single action before or since. In total 63 Medals of Honor were received for actions during the occupation. One went to the Army. Nine webt to members of the United States Marine Corps. Fifty three went to Navy personnel. ==Recipients== :Note: Notes in quotations are derived or are copied from the official Medal of Honor citation Image Name Service Rank Place of action Date of action Notes Navy Veracruz, Mexico Showed extraordinary heroism in battle, during the engagement of Veracruz, April 22, 1914, in command of the Second Seaman Regiment Navy Veracruz, Mexico - Led his men in both days' fighting at the head of his company Navy aboard the , Veracruz, Mexico For “extraordinary heroism in the line of his profession”. Later killed in the line of duty as a police officer Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914”; was eminent and conspicuous in command of his battalion; was in the fighting of both days, and exhibited courage and his skill in leading his men through action. His cool judgment and courage and his skill in handling his men in encountering and overcoming the machine gun and rifle fire down Cinco de Mayo and parallel streets accounts for the small percentage of the losses of Marines under his command. Navy aboard the , Veracruz, Mexico For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico April 1914 For meritorious service under fire as leader of the ammunition party and special details Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Marine Corps Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914”. Later received a second Medal of Honor for actions in Haiti in 1915. Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Marine Corps Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914”. He exhibited courage and skill in leading his men through the action and in the final occupation of the city. Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy aboard the , Veracruz, Mexico On board the USS Florida, for extraordinary heroism in the line of his profession during the seizure of Veracruz, Mexico, April 21, 1914. Navy aboard the , Veracruz, Mexico For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico - For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico For meritorious service under fire on the occasion of landing of the naval forces at Veracruz, Mexico, on April 21, 1914 Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914”; was in both days fighting at the head of his company, and was eminent and conspicuous in his conduct, leading his men with skill and courage. Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico - Directed the landing at Veracruz, Mexico Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico ”For extraordinary heroism in battle, engagement of Veracruz, April 22, 1914” Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Army Aqua Prieta, Mexico Brother of Antoine A. M. Gaujot, also a Medal of Honor recipient. One of five pairs of brothers to have both received the Medal of Honor. Navy aboard the , Veracruz, Mexico - For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914” Navy aboard the , Veracruz, Mexico For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914” Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico - First name erroneously given as \"Henry\" on citation Navy Veracruz, Mexico For distinguished conduct in battle, engagement of Veracruz, April 22, 1914. During the second day's fighting the service performed by him was eminent and conspicuous. He was conspicuous for skilful and efficient handling of the artillery and machine-guns of the Arkansas battalion, for which he was specially commended in reports. Navy aboard the , Veracruz, Mexico On board the USS Florida Jarrett displayed extraordinary heroism in the line of his profession during the seizure of Veracruz, Mexico, April 21, 1914. Navy Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914” Navy Veracruz, Mexico For carrying a wounded man while under heavy fire. Navy Veracruz, Mexico For extraordinary heroism in battle, engagement of Veracruz, April 22, 1914. Lt. Lannon assisted a wounded man under heavy fire, and after returning to his battalion was himself desperately wounded. Navy Veracruz, Mexico - For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914; Ens. Lowry was in both days' fighting at the head of his company, and was eminent and conspicuous in his conduct, leading his men with skill and courage. Navy Veracruz, Mexico For heroism in leading 3 attacks along Veracruz sea front, drawing Mexican fire and enabling cruisers to save our men on shore, April 22, 1914. Though wounded, he gallantly remained at his post. Second award – previously awarded a Medal of Honor for action in the Boxer Rebellion. Navy Veracruz, Mexico - ”For extraordinary heroism in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico For distinguished conduct in battle engagement of Veracruz, April 22, 1914. Lt. McNair was eminent and conspicuous in command of his battalion. He exhibited courage and skill in leading his men through the action and in the final occupation of the city. Navy , harbor of Veracruz, Mexico - For his leadership of the USS Chester in a daring and dangerous night landing in 1914 at Veracruz, Veracruz, Mexico Marine Corps Veracruz, Mexico - For distinguished conduct in battle engagements of Veracruz 21 - 22 April 1914 Navy Veracruz, Mexico For “extraordinary heroism in the line of his profession” Navy aboard the , Veracruz, Mexico - For “extraordinary heroism in the line of his profession” Marine Corps Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico - For his bravery in battle in Veracruz Mexico Navy aboard the , Veracruz, Mexico - For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico For meritorious service under fire Navy aboard the , Veracruz, Mexico For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914” Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy Veracruz, Mexico ”For distinguished conduct in battle, engagement of Veracruz, April 22, 1914” Navy Veracruz, Mexico - ”For distinguished conduct in battle, engagements of Veracruz, 21 - 22 April 1914” Navy aboard the , Veracruz, Mexico - For “extraordinary heroism in the line of his profession” Navy Veracruz, Mexico - For his skillful and courageous leadership of the USS Florida's landing force and his exhibition of \"eminent and conspicuous\" conduct. Navy Veracruz, Mexico For “extraordinary heroism in the line of his profession” ==Notes== ==References== : * Veracruz Category:People from Veracruz",
 "title": "List of Medal of Honor recipients (Veracruz)"
}