{
 "id": "377065",
 "text": "This is a list of Native Americans presented the nation's highest military decoration -- the Medal of Honor. The Medal of Honor is bestowed \"for conspicuous gallantry and intrepidity at the risk of life, above and beyond the call of duty, in actual combat against an armed enemy force.\" The medal is presented by the President of the United States on behalf of the Congress. Of the 3,469 Medals of Honor presented as of 2012 only 28 have been given to Native Americans. The Medal of Honor created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipient must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal it is commonly presented after the recipient was killed (posthumously). ==List of recipients== Name Tribe/Nation Service Rank Conflict Place of action Date of action Notes Co-Rux-Te-Chod-Ish Pawnee Army Indian Wars Republican River, Kansas \"Ran out from the command in pursuit of a dismounted Indian; was shot down and badly wounded by a bullet from his own command\" Chiquito White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Jim White Mountain Apache Army Indian Wars For his \"conduct during campaigns and engagements with Apaches\" Machol Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Nannasaddie White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Nantaje White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Blanquet Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Elsatsoosu Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Kelsay White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Kosoha White Mountain Apache Army Indian Wars Arizona Territory For his \"conduct during campaigns and engagements with Apaches\" Black Seminole Army Indian Wars Canyon Blanco tributary of the Red River, Texas – \"Rendered invaluable service to Col. R. S. Mackenzie, 4th U.S. Cavalry, during this engagement\" Black Seminole Army Indian Wars Pecos River, Texas With three others, charged a numerically superior force Black Seminole Army Indian Wars Pecos River, Texas With three others, charged a numerically superior force Black Seminole Army Indian Wars Pecos River, Texas With three others, charged a numerically superior force Rowdy Apache Army Indian Wars Arizona Territory Marine Corps World War II Central Solomons area, Pacific Ocean – Led his squadron in a series of missions against superior numbers Muscogee Army World War II Oliveto, Italy Although injured, killed two snipers and attacked two machine gun nests Cherokee Army World War II Single-handedly attacked two German positions and took dozens of prisoners Choctaw Army World War II Single-handedly destroyed two machine gun nests, took prisoners, and disabled a tank Army World War II Single-handedly attacked three German positions although wounded Cherokee/Muscogee Navy World War II Although wounded, continued to command his crippled ship until its sinking Army World War II Paco Railroad Station, Manila, Philippines With another soldier, attacked a Japanese-held railroad station Ho-Chunk Army Korean War Maintained an exposed position, continued to fight after being wounded Chickasaw Army Korean War Led his men against a series of emplacements, continued to lead after being wounded Choctaw Army Korean War – Single-handedly attacked two positions although wounded, killed while attacking a third Sioux Army Korean War Single-handedly attacked three machine gun nests Cherokee Army Korean War Smothered the blast of a grenade with his body ==References== * * * Category:Lists of Medal of Honor recipients *Medal of Honor recipients",
 "title": "List of Native American Medal of Honor recipients"
}