{
 "id": "377086",
 "text": "Fracking, or hydraulic fracturing, is forcing fractures in a rock layer, by fluid that is put under pressure. Although it can happen naturally, it is now used as a method to force oil and natural gas from shale.Charlez, Philippe A. 1997. Rock mechanics: petroleum applications. Paris: Editions Technip, p. 239Trembath A. 2012. US Government role in shale gas fracking history: an overview and response to our critics. Some hydraulic fractures form naturally: certain dykes are examples. This lets gas and petroleum from source rocks get to reservoir rocks. The first use of hydraulic fracturing to extract substances from rock was in 1947. The modern fracturing technique, called 'horizontal slickwater fracturing', was first used in 1998. It made the extraction of shale gas economically practical, and cheaper for other kinds of rock. The energy from the injection of a highly pressurized fluid creates new channels in the rock. This increases the extraction rates and recovery of hydrocarbons, which are used for fuel. In 2010 it was estimated that 60% of all new oil and gas wells worldwide were being hydraulically fractured.Montgomery, Carl T. & Smith, Michael B. 2010. Hydraulic fracturing. History of an enduring technology (PDF). JPT Online (Society of Petroleum Engineers): 26–41. Retrieved 13 May 2012. As of the year 2012, 2.5 million hydraulic fracturing actions have been done on oil and gas wells worldwide, more than one million of them in the United States.King, George E. 2012. Hydraulic fracturing 101, Society of Petroleum Engineers Paper 152596. == Advantages and disadvantages == The supporters of hydraulic fracturing point to the economic benefits from the vast amounts of previously out-of-reach hydrocarbons.Golden rules for a golden age of energy. International Energy Agency. Opponents of fracking point to potentially harmful environmental effects. These include contamination of ground water, risks to air quality, the migration of gases and hydraulic fracturing chemicals to the surface, surface contamination from spills and flowback, and the health effects of these.Brown, Valerie J. 2007. Industry issues: putting the heat on gas. Environmental Health Perspectives. 115 (2): A76. For these reasons hydraulic fracturing has come under examination. Some countries are suspending or banning it.France to keep fracking ban to protect environment, Sarkozy says. BloombergBusiness. In 2013, some of those countries, including the United Kingdom,Bakewell, Sally 2012. U.K. Government lifts ban on shale gas fracking. Bloomberg News. Retrieved 26 March 2013. lifted their bans. Now they have regulations instead of outright prohibition. Fracking can greatly increase the UK gas reserves.Moylan J. 2013. UK has huge shale gas resources, energy firm says. BBC News Business. == References == Category:Fuel Category:Geothermal energy Category:Environmental issues",
 "title": "Fracking"
}