{
 "id": "377030",
 "text": "James Wilson Vincent Savile OBE, KCSG (31 October 1926 29 October 2011) was a British predatory sex offender and paedophile who throughout his life gained fame and celebrity status in Britain as a DJ and television presenter. He was the initial host of Top of the Pops and the host of Jim'll Fix It. In 2012, a year after his death, he was accused of many counts of child sexual abuse and rape, which he committed from 1963 to 2009, and which many BBC employers are thought to have had awareness of for decades and covered up, which kept his sex abuse unknown to the public. This ultimately caused a scandal at the BBC following the allegations in which Savile was posthumously exposed for his crimes, with the police ultimately concluding that he had been a predatory sex offender. He is thought to have been one of Britain's most prolific sex offenders of the 20th century. ==Early life== Savile was born in Leeds the youngest of seven children. His siblings were Mary, Marjory, Vincent, John, Joan and Cristina. His parents were Vincent Joseph Marie Savile and Agnes Monica Kelly. He died in Leeds of natural causes. He was a devout Roman Catholic. He presented Jim'll Fix It and Top of the Pops. Savile was also a professional wrestler and cyclist when he was young and during World War II he was conscripted to work as a Bevin Boy in the coal mines. ==Career== Savile started being a DJ at Radio Luxembourg in 1958. He stopped working for them in 1967. In 1968 he joined BBC Radio 1. On New Year's Day 1964 he presented the first edition of the BBC music chart television programme Top of the Pops. In 1971 he was made an Officer of the Order of the British Empire. ==Honors== Savile was also an honorary life member of the British Gypsy Council and the first non-gypsy to be an honorary life member. In 1990, he was made a Knight Bachelor for his charity work. ===Death=== On the night of 29 October 2011, Savile was found dead in his home at the age of 84, just 2 days before his 85th birthday. Police said there were no suspicious circumstances to his death. A year later his crimes were revealed by victims. He had been in hospital with pneumonia, and his death was not suspicious. Due to his sex abuse remaining unknown to the public at the time of his death, many tributes were paid to him, a large funeral took place for him and he was initially praised in obituaries written in the immediate aftermath of his death. ===Characteristics=== Savile had expensive tastes. He was known to own several cars including Bentley, Rolls-Royce and Mercedes-Benz, and smoked expensive Cuban cigars. He was a heavy smoker. Savile was close friends with Edward Heath. Most of his sexual abuse was against young girls.Greer, Chris, and Eugene McLaughlin. \"The Sir Jimmy Savile scandal: Child sexual abuse and institutional denial at the BBC.\" Crime, media, culture 9.3 (2013): 243-263. ==Sex offences and crimes== In 1963, a boy told police that Savile had raped him. Since he died in 2011, 589 people have made complaints about Savile to the police. 31 said that they were raped by Savile. 16 said they were under 16 when Savile raped them. Police called Savile \"Britain's worst paedophile\". In March 2013 Her Majesty's Inspectorate of Constabulary reported that 214 of the complaints that had been made against Savile after his death would have been criminal offences. It was also revealed that Savile also committed some child sex offences in his silver Rolls-Royce Corniche. On 3 October 2012, a television programme called Exposure: The Other Side of Jimmy Savile was shown on ITV. In it several women said that Savile sexually abused them when they were teenagers. Exposure Update: The Jimmy Savile Investigation, was shown on ITV on 21 November 2012. An investigation codenamed Operation Yewtree was launched and several arrests were made. People arrested included Gary Glitter, Rolf Harris, Dave Lee Travis, William Roache, Wilfred De'ath, Max Clifford, Stuart Hall, and Paul Gambaccini. Savile was the subject of an episode of Louis Theroux's When Louis Met! where Theroux asked him if he is a paedophile in 2001 and Savile laughed off the question and told him that those were just claims. In June 2014, MP Jeremy Hunt apologised to Savile's victims after it was revealed that Savile had also abused dead bodies while at Broadmoor Psychiatric Hospital and he was a regular visitor and stalker. == References == == Other websites == * Category:1926 births Category:2011 deaths Category:BBC radio presenters Category:BBC television presenters Category:British cyclists Category:British DJs Category:British rapists Category:British sex offenders Category:Child sexual abusers Category:English professional wrestlers Category:English Roman Catholics Category:Members of the Order of the British Empire Category:People from Leeds Category:Television personalities from Yorkshire",
 "title": "Jimmy Savile"
}