{
 "id": "377192",
 "text": ":For other uses, see Gosei. is a Japanese language term used in countries in North America and South America to name the children born to Japanese people who immigrated. The emigrants or immigrants who were born in Japan are called Issei; and their children born in the new country are called Nisei (second generation). The grandchildren of Issei are called Sansei (third generation); and their great-grandchildren are called Yonsei. The children of the Yonsei are the great-great-grandchilderen of Issei ancestors; and these children are called Gosei.In Japanese counting, \"one, two, three, four, five\" is \"ichi, ni, san, yon, go\" In other words, the children of at least one Yonsei parent are called GoseiNomura, Gail M. (1998). \"Japanese American Women\" in The Reader's Companion to U.S. Women's History (Mankiller, Barbara Smith, ed.), pp. 288-290; Masterson, Daniel et al. (2004). The Japanese in Latin America, p. 291. The character and uniqueness of the Gosei is recognized in its social history.Numrich, Paul David. (2008). North American Buddhists in Social Context, p. 110. The Gosei are the subject of on-going academic research in the United States and in Japan.国立大学法人 東京学芸大学 (Tokyo Gakugei University), \"Socioeconomic Status, Acculturation, Discrimination, and Health of Japanese Americans: Generational Differences\" by Takashi Asakura et al., 2004; Japan Society for the Promotion of Science Grant# 12490011; retrieved 2012-12-25. ==History== The earliest organized group of Japanese emigrants settled in Mexico in 1897.Ministry of Foreign Affairs (MOFA), Japan-Mexico Foreign Relations; retrieved 2012-11-25. Imigration to Brazil began in 1908. Today, the community which grew from the immigrant children, grandchildren, great- grandchildren and great-great-grandchildren has become the largest Japanese emigrant population outside of Japan, including approximately 1.5 million Brazilians.MOFA, \"Japan-Brazil Relations\"; retrieved 2012-11-25. Other communities of Yonsei grew up in the United States,Sakata, Yasuo. (1992). Fading Footsteps of the Issei, p. 1. Canada,McLellan, Janet. (1999). Many Petals of the Lotus: Five Asian Buddhist Communities in Toronto, p. 36. and Peru.\"Fujimori Secures Japanese Haven,\" BBCNews, 12 December 2000; retrieved 2012-11-25. The use of the term Gosei was modeled after an Issei pattern or template. In the 1930s, the term Issei came into common use. The word replaced the term \"immigrant\" (ijusha). This change in usage mirrored an evolution in the way the Issei looked at themselves. The label Issei also included the idea of belonging to the new country. == Cultural profile == The term Nikkei (日系) was created by sociologists in the late 20th century. The Nikkei include all of the world's Japanese immigrants and their descendants.Japanese American National Museum, \"What is Nikkei?\" ; retrieved 2012-11-25. The Issei were born in Japan, and their cultural perspective was primarily Japanese; but they were in another country by choice.Smithsonian, \"The Art of Gaman: Arts and Crafts from the Japanese American Internment Camps, 1942 - 1946\", Yoshitsuchi Ikemoto ; excerpt, \"... one of hundreds of Issei (first-generation) 'bachelor' laborers who were unable to send for their wives or a picture bride because the U.S. government cut off all immigration from Japan in 1924\"; retrieved 2012-11-25. Their Gosei great-great-grandsons and great-great-granddaughters grew up with a national and cultural point-of-view that was different from their parents. Although the Issei kept an emotional connection with Japan, they created homes in a country far from Japan.Yenne, Bill. (2007). Rising Sons: The Japanese American GIs Who Fought for the United States in World War II, p. xv. The Gosei had never known a country other than the one into which they were born. Generation Cohort description Issei (一世) The generation of people born in Japan who immigrated to another country.\"Issei\" Densho Encyclopedia; retrieved 2012-11-25. Nisei (二世) The generation of people born in North America, Latin America, Australia, Hawaii, or any country outside of Japan either to at least one Issei parent. Sansei (三世) The generation of people born to at least one Nisei parent. Yonsei (四世) The generation of people born to at least one Sansei parent Gosei (五世) The generation of people born to at least one Yonsei parentIkezoe-Halevi, Jean. \"Voices of Chicago: Day of Remembrance 2006,\" Discover Nikkei (US). October 31, 2006; retrieved 2012-11-25. The Issei, Nisei, Sansei, Yonsei and Gosei generations reflect distinctly different attitudes to authority, gender, religious practice, and other matters.McLellan, p. 59. Differences among these national Gosei developed because of the histories of their Japanese emigrant ancestors.Ichioka, Yuji et al. (2006). Before internment: essays in prewar Japanese American history, p. 295. ===Gosei in Brazil === Japanese-Brazilian (Nipo-brasileiro) Gosei are a small part of an ethnic minority in Brazil.Doi, Elza Takeo. \"Japonês,\" Enciclopédia das Línguas no Brasil; retrieved 2011-05-17 In 1990, 0.8% of the Nipo-Brasileiros community were Gosei.De Carvalho, Daniela. (2002). Migrants and Identity in Japan and Brazil: the Nikkeijin, p. 27, citing Centro de Estudo Nipo-Brazileiros statistics ===Gosei in Canada === Japanese-Canadian Gosei are typical for any ethnic group.Fisher, Nancy L. (1996). Cultural and Ethnic Diversity: a Guide for Genetics Professionals, p. 101. ===Gosei in Peru === Japanese-Peruvian (Nipo-peruano) Gosei make up less than 1.0% of the Nikkei population in 2000.Adachi, Nobuko. (2006). Japanese Diasporas: Unsung Pasts, Conflicting Presents, and Uncertain Futures, p. 145. ===Gosei in the US === The lives of the Japanese-Americans of earlier generations contrasts with the Gosei because they have English- speaking grandparents.Ogawa, Dennis M. (1978). Jan ken po: the World of Hawaii's Japanese Americans, p. 48. According to a 2011 columnist in The Rafu Shimpo of Los Angeles, \"Younger Japanese Americans are more culturally American than Japanese\" and \"other than some vestigial cultural affiliations, a Yonsei or Gosei is simply another American.\"Johnson, George Toshio. \"Into the Next Stage: Japanese American Newspapers: Over and Out?\" Rafu Shimpo (US). February 17, 2011; retrieved 2011-12-25. ==References== ==Other websites== * Japanese American National Museum * Japanese American Historical Society * Densho: The Japanese American Legacy Project * Discover Nikkei Category:Japanese diaspora",
 "title": "Gosei (fifth-generation Nikkei)"
}