{
 "id": "3772",
 "text": "{{infobox country | conventional_long_name = Islamic Republic of Iran | native_name = | image_flag = Flag of Iran (official).svg | image_coat = Emblem of Iran.svg | symbol_type = Emblem | national_motto = | national_anthem = | image_map = Iran (orthographic projection).svg | capital = Tehran | coordinates = | largest_city = Tehran | official_languages = Persian | regional_languages = Iran, is a country in Western Asia. It is part of the Middle East region. It shares borders with Afghanistan, Armenia, Azerbaijan, Iraq, Pakistan, Turkey, and Turkmenistan. ==Overview== Tehran is the capital and largest city of Iran. Iran is the eighteenth largest country in the world. It has more than 84.9 million people. Iran has been a member of the United Nations since 1945. It is a member of the Organization of the Petroleum Exporting Countries (OPEC). It is an Islamic republic. Iran is a powerful country in the region. It has a lot of natural gas and oil, which is important for its economy. It's also a significant place because it's where Shia Islam is most important. The country's economy is big, and it's a member of many important groups like the United Nations. Iran has a long history and a rich culture. That's why it has many special places that are recognized by the United Nations. It's also famous for its cultural traditions, like music and dance. In 2019, many people visited Iran, making it one of the fastest-growing tourist destinations in the world. ==History== In the past, Iran was called \"Persia\" by people outside of the country. The people that lived there called the country \"Iran\". The official name was Persia, The name Persia was used when dealing with other countries and in government papers. In 1935, Reza Shāh Pahlavi was Shah of Iran. He officially asked foreigners to call the country \"Iran\". This was done to show that Iran belongs to all the non-Persian Iranians as well as to Persian Iranians. The name Iran means land of the Aryans. It is used in the ancient book of the Zoroastrians, the Avesta. In the 19th and early 20th century, the name Aryan was used by Europeans to mean all Indo-Europeans. The \"Aryan Race\" was a term that Hitler used to describe his \"Superior\" or \"perfect\" race, but it first meant Iranians.Norton, 2002 \"Aryan\" means \"noble\" in Iranian languages. ===Persian Empire=== Around 500 BC, the area that is now Iran was the center of the Achaemenid Empire. The Greek city states fought against the Persian armies led by Darius the Great and Xerxes. Then Alexander the Great took the country by fighting the Achaemenid dynasty of Persia. He ruled until he died,then the Greek Seleucids ruled until they were defeated by the Parthian Empire which later fought the Roman Empire. * * * After the Parthians, the Sassanian dynasty (224 – 651) took over. Other people took Persia by conquest, like the Arabs (7th century), Turks (10th century) and Mongols (13th century). However, Iran has always had a different and distinct native Iranian culture which has continued to survive. After the Muslim Arabs conquered the Iranians, Persian women were enslaved as domestic servants while Persian men were forced to build and farm and engage in hard labour. The Arab Abbasid Harun caliph had Persian concubines like Marajil al-Badghisiyya whom the later Abbasid caliph Al-Ma'mun descended from in the maternal line. ===After World War II=== The Central Intelligence Agency (CIA) worked in Iran to create 1953 riots which led to the removal of Prime Minister Mosaddegh. The United States and the United Kingdom then made the Shah Mohammad Reza Pahlavi the most powerful person in Iran, again. The Shah left Iran in 1979 in the face of a revolt. The Iranian government was changed to an Islamic Republic by Islamic Revolution. Soon afterwards, the Iranian Students Movement (Tahkim Vahdat), with the backing of the new government, took over the U.S. Embassy in Tehran. They held most of the diplomats hostage for 444 days. Relations between the two countries have not been good since. For example, the United States claims that Iran supports terrorist groups against Israel. Iran does not see Israel as a country. Iran, along with many Arab League countries, believes that Israel does not have the right to co-exist. However, Iran has collaborated with the United Nations at times. These deals have been about energy or about fighting terrorism. Iran fought the Iran–Iraq War in the 1990s-1980s. Many foreign countries supported Iraqi people’s regime. Now, the West and United Nations is trying to prevent Iran from becoming nuclear technology country, even though Iran is a member of the Nuclear Non-Proliferation Treaty. The International Atomic Energy Agency (IAEA)’s has reported many times that there is no evidence that Iran is developing nuclear weapons. However, it also says that it can not say for sure that Iran is not doing so in secret. A December 2007 CIA report on nuclear activity in Iran said that Iran's secret program to get nuclear weapons technology was stopped in 2003. It said that Iran will probably not be able to build a nuclear weapon soon. The Joint Comprehensive Plan of Action is a political strategy to deal with this issue. ==Economy== Iran has the natural resource of oil. It is a member of OPEC. Oil is one of its main exports. Rice, handicrafts, carpets and crocus are important local products. Iran is the world's largest exporter and producer of caviar. Iran is also one of the world's biggest exporters of pistachio nuts. Iran has factories that produce industrial products. Iran is also involved in the field of biomedical sciences. Rial is the money used in Iran. ==Religions== About 90% of Iranian people are Muslim. The state religion is Shia Islam. It has been the state religion since the Safavid dynasty in the 16th century. This is the religion of about 75% of Iranians. They belong to the Twelver branch. About 9% of Iranians Muslim belong to the Sunni branch of Islam. The 9% of Iranians who are not Muslim are Bahá'ís, Mandeans, Zoroastrians, Christians and Jews. It is thought that there are between 300,000 and 310,000 Persian (Iranian) Jews. ==Regions and provinces== * Ardabil * Kohgiluyeh and Boyer-Ahmad * Hamadan * Kerrmanshah * Chaharmahal and Bakhtiari * Tehran * Alborz * Markazi * Zanjan * Golestan * Gilan * Mazandaran * Razavi Khorasan * South Khorasan * North Khorasan *Fars * Khuzestan *Isfahan *Yazd * Kerman * Hormozgan * Bushehr * Ilam * Lorestan * West Azerbaijan * East Azerbaijan * Kurdistan * Sistan and Baluchistan ==Related pages== * West Asia * Ancient Armenia ===Further reading=== * Akbarzadeh, P. (2003) \"Iran or Persia? Farsi or Persian? Which Ones Should be Called ?!\" . Payvand News of Iran. * Norton, K. (2002) \"ARYAN\" . Rhetoric of Race Dictionary Project. College of New Jersey. ==References== Category:Current dictatorships Category:1979 establishments in Asia Category:Members of the Organisation of Islamic Cooperation",
 "title": "Iran"
}