{
 "id": "377235",
 "text": "Loie (or Loïe) Fuller (January 15, 1862 - January 1, 1928) was a pioneer of modern dance.Who's Who on the Stage: Volume 1 1910, pg.102 edited by Walter Browne, Frederick Arnold Austin She had no dance training, but got experience acting on the stage. A chance experiment with an over-long skirt gave her ideas which she eventually developed into a dance.Craine, Debra & Mackrell, Judith. 2000. The Oxford dictionary of dance. Oxford University Press, p194. ==Career== Fuller was born Marie Louise Fuller in the Chicago suburb of Fullersburg (now Hinsdale, Illinois). She began her theatrical career as a professional child actress and later choreographed and performed dances in burlesque (as a skirt dancer), vaudeville, and circus shows. Fuller developed her own natural movement and improvisation techniques. Fuller combined her choreography with silk costumes seen by multi-coloured lighting of her own design.Richard Nelson Current and Marcia Ewing Current, Loie Fuller: goddess of light, Northeastern Univ Press, May 1997, .Giovanni Lista, Loïe Fuller, danseuse de la Belle Epoque, Hermann (Paris 2006), (in French). Although Fuller became famous in America through works such as Serpentine Dance (1891), she felt that she was not taken seriously by the public. Her warm reception in Paris during a European tour persuaded Fuller to stay in France. A regular performer at the Folies Bergère with works such as Fire Dance, Fuller became the embodiment of the Art Nouveau movement. An 1896 film of the Serpentine Dance gives a hint of what her performance was like (the unknown dancer in the film is not Fuller). In connecting free dance, billowing skirts and materials, color and lighting effects, Fuller was in sympathy with several other dancers of that period. All performed in Paris, on the Moulin Rouge or Folies Bergère stage, or both. These stages, as was usual in music hall generally, offered a series of separate acts rather than one continuous work. == Patents == Fuller held patents related to stage lighting. They including chemical compounds for creating color gel and the use of chemical salts for lluminescent lighting, and garments (stage costumes US Patent 518347).Marie louise fuller - US 518347, Patents. She tried to create a patent of her Serpentine Dance to stop imitators from using her choreography or claiming to be her. Fuller gave a written description of her dance to the United States Copyright Office;\"Copyright -- 'Dramatic Composition' -- Stage Dance (Fuller v. Bemis) Albany Law Journal, Aug. 27, 1892, p. 165-66. however, a US Circuit Court judge denied Fuller's request for an injunction. The Serpentine Dance told no story and was therefore not eligible for copyright protection.Kraut, Anthea. 2015. \"White womanhood and early campaigns for choreographic copyright\" in Choreographing Copyright: Race, Gender, and Intellectual Property Rights in American Dance. Oxford University Press. At that time dance was only protected if it qualified as \"dramatic\" and Fuller's dance was too abstract for this qualification. The precedent set by Fuller's case remained in place from 1892 until 1976, when Federal Copyright Law extended protection to choreographic works. ==Written works== Fuller's autobiographical memoire \"Quinze ans de ma vie\" was written in French and published by in 1908 with an introduction by Anatole France. She drafted her memoires again in English a few years later, which were published under the title \"Fifteen Years of a Dancer's Life\" by Herbert Jenkins (London) in 1913. The New York Public Library Jerome Robbins Dance Collection holds the nearly complete manuscript to the English edition and materials related to the French edition.The New York Public Library, Register of the Loie Fuller Papers, 1892-1913, scope and content note. == References == Category:Actors from Illinois Category:American dancers Category:Burials at Père Lachaise Cemetery Category:Deaths from pneumonia Category:1862 births Category:1928 deaths Category:Vaudeville performers",
 "title": "Loie Fuller"
}