{
 "id": "377382",
 "text": "Kazuo Otani (June 2, 1918 – July 15, 1944) was a United States Army was a United States Army soldier. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (M-S)\" ; retrieved 2012-12-27. == Early life == Otani was born in California. His parents were immigrants from Japan. He was a Nisei, which means that he was a second generation Japanese-American.Dunford, Bruce. \"Nisei War Heroes Receive Long-Delayed Recognition,\" Los Angelese Times. June 18, 2000; retrieved 2012-12-27. Otani's family was interned at the Gila River War Relocation Center in ArizonaJapanese American Veterans Association (JAVA), \"Gila River Relocation Center, Arizona\"; U.S. National Archives and Records Administration (NARA), Japanese-American Internee Data File, 1942-1946 #301236 (Otani, Kazuo) ; retrieved 2012-12-7.retrieved 2012-12-27. ==Soldier== Otani joined the US Army in 1943.JAVA, \"Gila River Relocation Center, Arizona\"; retrieved 2012-12-7.retrieved 2012-12-27. He volunteered to be part of the all-Nisei 442nd Regimental Combat Team.Go for Broke National Education Center, \"Medal of Honor Staff Sergeant Kazuo Otani\" ; retrieved 2012-12-27. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; retrieved 2012-12-27. For his actions in July 1944, Otani was awarded the Army's second-highest decoration, the Distinguished Service Cross (DSC). \"21 Asian American World War II Vets to Get Medal of Honor\" at University of Hawaii Digital History ; retrieved 2012-12-26. Otani, aged 26 at his death, was buried in Veterans Liberty Cemetery, Fresno, California. In the 1990s, there was a review of service records of Asian Americans who received the DSC during World War II. Otani's award was upgraded to the Medal of Honor. In a ceremony at the White House on June 21, 2000, his family was presented with his medal by President Bill Clinton. Twenty-one other Asian Americans also received the medal during the ceremony, but only seven of them were still alive. ==Medal of Honor citation== Otani's Medal of Honor recognized his conduct in frontline fighting in northern Italy in 1944. He drew fire towards himself so that his platoon could reach cover. He was killed while rescuing a wounded man.CMH, \"Asian Pacific American Medal of Honor recipients\" ; retrieved 2012-12-28. The words of Otani's citation explain: > Staff Sergeant Kazuo Otani distinguished himself by extraordinary heroism in > action on 15 July 1944, near Pieve Di S. Luce, Italy. Advancing to attack a > hill objective, Staff Sergeant Otani's platoon became pinned down in a wheat > field by concentrated fire from enemy machine gun and sniper positions. > Realizing the danger confronting his platoon, Staff Sergeant Otani left his > cover and shot and killed a sniper who was firing with deadly effect upon > the platoon. Followed by a steady stream of machine gun bullets, Staff > Sergeant Otani then dashed across the open wheat field toward the foot of a > cliff, and directed his men to crawl to the cover of the cliff. When the > movement of the platoon drew heavy enemy fire, he dashed along the cliff > toward the left flank, exposing himself to enemy fire. By attracting the > attention of the enemy, he enabled the men closest to the cliff to reach > cover. Organizing these men to guard against possible enemy counterattack, > Staff Sergeant Otani again made his way across the open field, shouting > instructions to the stranded men while continuing to draw enemy fire. > Reaching the rear of the platoon position, he took partial cover in a > shallow ditch and directed covering fire for the men who had begun to move > forward. At this point, one of his men became seriously wounded. Ordering > his men to remain under cover, Staff Sergeant Otani crawled to the wounded > soldier who was lying on open ground in full view of the enemy. Dragging the > wounded soldier to a shallow ditch, Staff Sergeant Otani proceeded to render > first aid treatment, but was mortally wounded by machine gun fire. Staff > Sergeant Otani's extraordinary heroism and devotion to duty are in keeping > with the highest traditions of military service and reflect great credit on > him, his unit, and the United States Army.Gomez-Granger, Julissa. (2008). > Medal of Honor Recipients: 1979-2008, \"Otani, Kazuo,\" p. 18 [PDF 22 of 44]; > retrieved 2012-12-27. ==Related pages== * List of Medal of Honor recipients for World War II * List of Asian American Medal of Honor recipients * Posthumous recognition == References == ==Other websites== * \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov * Awards ... (C0 153, Hq 5th Army, 23 Sept 44); Kazuo Otani (39089432), Staff Sergeant * Category:1918 births Category:1944 deaths Category:Military people from California Category:United States Army Medal of Honor recipients Category:American people of World War II",
 "title": "Kazuo Otani"
}