{
 "id": "377304",
 "text": "The Dark Knight Series is a set of three Christopher Nolan Batman movies. It includes Batman Begins (2005), The Dark Knight (2008), and The Dark Knight Rises (2012).. . Christian Bale, Michael Caine, Gary Oldman, Morgan Freeman, and Cillian Murphy appeared in all three movies. ==Background== All cast and crew members worked on all three movies, except for music composer James Newton Howard who did not work on The Dark Knight Rises. Composer Hans Zimmer worked together with Howard on the first two films and made the soundtrack for the last movie by himself. Katie Holmes played Rachel Dawes in Batman Begins, but was replaced by Maggie Gyllenhaal in The Dark Knight. Liam Neeson appeared as Ra's al Ghul in Batman Begins and in The Dark Knight Rises. Heath Ledger received an Academy Award for Best Supporting Actor for his role as The Joker in The Dark Knight. Ledger died before the movie was released and the award was given posthumously. Each of the three movies was a success in the box office; The Dark Knight was the number one grossing movie in 2008. The Dark Knight Rises is the third highest grossing movie of 2012. Batman Begins is the ninth highest grossing movie in 2005. Batman Begins earned $372,710,015 worldwide. The Dark Knight earned $1,023,045,358. The Dark Knight Rises earned $1,081,041,287, passing the receipts of The Dark Knight. In both Batman Begins and in The Dark Knight, Gotham City was shot in Chicago, Illinois. In The Dark Knight Rises, Gotham City was shot in Pittsburgh, Pennsylvania, New York City, New York, and Los Angeles, California. ==Cast== *Christian Bale as Batman *Michael Caine as Alfred Pennyworth *Gary Oldman as Commissioner Gordon *Morgan Freeman as Lucius Fox *Katie Holmes (Batman Begins) and Maggie Gyllenhaal (The Dark Knight) as Rachel Dawes *Liam Neeson as Ra's al Ghul *Heath Ledger as Joker *Tom Hardy as Bane *Anne Hathaway as Catwoman *Marion Cotillard as Talia al Ghul *Aaron Eckhart as Harvey Dent/Two-Face *Cillian Murphy as Dr. Jonathan Crane / The Scarecrow *Joseph Gordon-Levitt as Robin John Blake *Colin McFarlane as Gillian B. Loeb *Néstor Carbonell as Mayor Anthony Garcia *Tom Wilkinson as Carmine Falcone *Eric Roberts as Sal Maroni *Ben Mendelsohn as John Daggett *Matthew Modine as Peter Foley ==Reception== ===Box office performance=== Film Release Date Budget Box Office Gross All Time Ranking References Domestic Foreign Worldwide Domestic Worldwide Batman Begins June 15, 2005 $150 million $206,852,432 $374,218,673 195 326 The Dark Knight July 18, 2008 $185 million $535,234,033 $1,004,934,033 12 43 The Dark Knight Rises July 20, 2012 $250 million $448,139,099 $636,800,000 $1,084,939,099 19 29 Total $585 million $1,188,341,317 $1,275,374,899 $2,463,716,216 ===Critical response=== Film Rotten Tomatoes Metacritic CinemaScore Batman Begins 84% (279 reviews) 70 (41 critics) A The Dark Knight 94% (334 reviews) 84 (39 critics) A The Dark Knight Rises 87% (359 reviews) 78 (45 critics) A ==References== ==Other website== * Batman franchise overview at Box Office Mojo * * Behind Batman: Public Domain Analysis of the Film Franchise Category:Movies directed by Christopher Nolan Category:Batman movies Category:Series of movies Category:Movies based on comic book characters",
 "title": "The Dark Knight Trilogy"
}