{
 "id": "377485",
 "text": "George Taro Sakato (February 19, 1921 - December 2, 2015) was a United States Army soldier. He received the Medal of Honor because of his actions in World War II.US Army Center of Military History (CMH), \"Medal of Honor Recipients, World War II (M-S)\" ; retrieved 2012-12-28. == Early life == Sakato was born in Colton, California.\"George Sakato,\" American Valor (PBS/WETA), 2003; retrieved 2012-12-28. His parents were immigrants from Japan. He was a Nisei, which means that he was a second generation Japanese-American.Dunford, Bruce. \"Nisei War Heroes Receive Long-Delayed Recognition,\" Los Angelese Times. June 18, 2000; retrieved 2012-12-28. He graduated from Redlands High School in Redlands, California.Juedes, Joy. \"Redlands resident to receive Congressional Gold Medal,\" The San Bernardino Sun (San Bernardino, California). November 11, 2010; retrieved 2012-12-28. The Sakato family moved to Arizona during World War II to avoid internment. ==Soldier== Sakato joined the US Army in March 1944.National Archives and Records Administration (NARA), WWII Army Enlistment Record #39923340 (Sakato, George T.); retrieved 2012-12-28. He volunteered to be part of the all-Nisei 442nd Regimental Combat Team.Go for Broke National Education Center, \"Medal of Honor Private George T. Sakato\" ; retrieved 2012-12-28. This army unit was mostly made up of Japanese Americans from Hawaii and the mainland. \"100th Battalion, 442nd Infantry\" at Global Security.org; retrieved 2012-12-27. For his actions in October 1944, Sakato was awarded the Army's second-highest decoration, the Distinguished Service Cross (DSC). In the 1990s, there was a review of service records of Asian Americans who received the DSC during World War II. Sakato's award was upgraded to the Medal of Honor. In a ceremony at the White House on June 21, 2000, he was presented with his medal by President Bill Clinton. Twenty-one other Asian Americans also received the medal during the ceremony, but only seven of them were still alive. \"21 Asian American World War II Vets to Get Medal of Honor\" at University of Hawaii Digital History ; retrieved 2012-12-28. ==Medal of Honor citation== Sakato's Medal of Honor recognized his conduct in frontline fighting in northern France in 1944. He charged an enemy stronghold. Then he took command of his platoon and led it in defense of the position.CMH, \"Asian Pacific American Medal of Honor recipients\" ; retrieved 2012-12-28. The words of Sakato's citation explain: > Private George T. Sakato distinguished himself by extraordinary heroism in > action on 29 October 1944, on hill 617 in the vicinity of Biffontaine, > France. After his platoon had virtually destroyed two enemy defense lines, > during which he personally killed five enemy soldiers and captured four, his > unit was pinned down by heavy enemy fire. Disregarding the enemy fire, > Private Sakato made a one-man rush that encouraged his platoon to charge and > destroy the enemy strongpoint. While his platoon was reorganizing, he proved > to be the inspiration of his squad in halting a counter-attack on the left > flank during which his squad leader was killed. Taking charge of the squad, > he continued his relentless tactics, using an enemy rifle and P-38 pistol to > stop an organized enemy attack. During this entire action, he killed 12 and > wounded two, personally captured four and assisted his platoon in taking 34 > prisoners. By continuously ignoring enemy fire, and by his gallant courage > and fighting spirit, he turned impending defeat into victory and helped his > platoon complete its mission. Private Sakato's extraordinary heroism and > devotion to duty are in keeping with the highest traditions of military > service and reflect great credit on him, his unit, and the United States > Army.Gomez-Granger, Julissa. (2008). Medal of Honor Recipients: 1979-2008, > \"Sakato, George T.,\" p. 19 [PDF 23 of 44]; retrieved 2012-11-26. ==Death== Sakato died in Denver, Colorado on December 2, 2015 at the age of 94. ==Related pages== * List of Medal of Honor recipients for World War II * List of Asian American Medal of Honor recipients * List of living Medal of Honor recipients == References == ==Other websites== * \"Army Secretary Lionizes 22 World War II Heroes\" at Defense.gov Category:1921 births Category:2015 deaths Category:Military people from California Category:United States Army Medal of Honor recipients Category:American people of World War II",
 "title": "George Sakato"
}