{
 "id": "377506",
 "text": "The 2013 Formula One season was the 64th season of the Formula One World Championship. Eleven teams and twenty-two drivers competed in nineteen Grands Prix. The season started in Australia on 17 March and ended in Brazil on 24 November. The 2013 season was the final year for the 2.4 litre V8 engine setup. Sebastian Vettel was the defending World Drivers' Champion. He was Champion again in 2013. ==Signed teams and drivers== At the 2012 Malaysian Grand Prix, Bernie Ecclestone said that the \"majority\" of teams in the 2012 season agreed to compete in 2013. On 30 November 2012, the FIA published a provisional entry list for the 2013 season. Team Constructor Chassis Engine Tyre Race drivers Rounds Infiniti Red Bull Racing Red Bull–Renault RB9 Renault RS27-2013 1 Sebastian Vettel 1–15 rowspan=\"2\" Infiniti Red Bull Racing Red Bull–Renault RB9 Renault RS27-2013 2 Mark Webber 1–15 Scuderia Ferrari Ferrari F138 Ferrari Type 056 3 Fernando Alonso 1–15 rowspan=\"2\" Scuderia Ferrari Ferrari F138 Ferrari Type 056 4 Michael Schumacher 1–15 Vodafone McLaren Mercedes McLaren–Mercedes MP4-28 Mercedes FO 108Z 5 Jenson Button 1–15 rowspan=\"2\" Vodafone McLaren Mercedes McLaren–Mercedes MP4-28 Mercedes FO 108Z 6 Sergio Pérez 1–15 Lotus F1 Team Lotus–Renault E21 Renault RS27-2013 7 Kimi Räikkönen 1–15 rowspan=\"2\" 8 Lotus–Renault E21 Renault RS27-2013 Romain Grosjean 1–15 Mercedes AMG Petronas F1 Team Mercedes F1 W04 Mercedes FO 108Z 9 Nico Rosberg 1–15 rowspan=\"2\" Mercedes AMG Petronas F1 Team Mercedes F1 W04 Mercedes FO 108Z 10 Lewis Hamilton 1–15 Sauber F1 Team Sauber–Ferrari C32 Ferrari Type 056 11 Nico Hülkenberg 1–15 rowspan=\"2\" Sauber F1 Team Sauber–Ferrari C32 Ferrari Type 056 12 Felipe Massa 1–15 Sahara Force India F1 Team Force India–Mercedes VJM06 Mercedes FO 108Z 14 Paul di Resta 1–15 James Calado Sahara Force India F1 Team Force India–Mercedes VJM06 Mercedes FO 108Z 15 Adrian Sutil 1–15 Williams F1 Team Williams–Renault FW35 Renault RS27-2013 16 Pastor Maldonado 1–15 rowspan=\"2\" 17 Williams–Renault FW35 Renault RS27-2013 Valtteri Bottas 1–15 Scuderia Toro Rosso Toro Rosso–Ferrari STR8 Ferrari Type 056 18 Jean-Éric Vergne 1–15 rowspan=\"2\" 19 Toro Rosso–Ferrari STR8 Ferrari Type 056 Daniel Ricciardo 1–15 Caterham F1 Team Caterham–Renault CT03 Renault RS27-2013 20 Charles Pic 1–15 Ma Qinghua Heikki Kovalainen Alexander Rossi Caterham F1 Team Caterham–Renault CT03 Renault RS27-2013 21 Giedo van der Garde 1–15 Marussia F1 Team Marussia–Cosworth MR02 Cosworth CA2013 22 Jules Bianchi 1–15 Rodolfo González Marussia F1 Team Marussia–Cosworth MR02 Cosworth CA2013 23 Max Chilton 1–15 ===Team changes=== In November 2012, the owners of HRT F1 placed the team for sale. The team needed to find a buyer by 30 November to remain in the sport. HRT failed to find a buyer and the team was not included in the 2013 entry list. ===Driver changes=== In September 2012, seven-time World Champion Michael Schumacher said that he was retiring from the sport for a second time. World Champion Lewis Hamilton agreed to take Schumacher's place. The move ended his fourteen- year career with McLaren. Driver Sergio Pérez left Sauber to join McLaren. Nico Hülkenberg filled the vacant seat at Sauber. Hülkenberg was joined by Esteban Gutiérrez, who was Sauber's testing and reserve driver in and . Charles Pic moved from Marussia to Caterham. Max Chilton took his place at Marussia. ==Calendar== The following nineteen races appeared on the 2013 race schedule. The number of races on the Formula One calendar is dictated by the Concorde Agreement. The calendar was originally meant to host twenty races. This would add the new Grand Prix of Jersey. The race in New Jersey was delayed to 2014. Round Race title Grand Prix Circuit Date 1 Australian Grand Prix Australian GP Albert Park, Melbourne 17 March 2 Petronas Malaysian Grand Prix Malaysian GP Sepang International Circuit, Kuala Lumpur 24 March 3 UBS Chinese Grand Prix Chinese GP Shanghai International Circuit, Shanghai 14 April 4 Gulf Air Bahrain Grand Prix Bahrain GP Bahrain International Circuit, Sakhir 21 April 5 Gran Premio de España Spanish GP Circuit de Catalunya, Barcelona 12 May 6 Grand Prix de Monaco Monaco GP Circuit de Monaco, Monte Carlo 26 May 7 Grand Prix du Canada Canadian GP Circuit Gilles Villeneuve, Montreal 9 June 8 British Grand Prix British GP Silverstone Circuit, Silverstone 30 June 9 Großer Preis von Deutschland German GP Nürburgring, Nürburg 7 July 10 Magyar Nagydíj Hungarian GP Hungaroring, Budapest 28 July 11 Shell Belgian Grand Prix Belgian GP Circuit de Spa-Francorchamps, Francorchamps 25 August 12 Gran Premio d'Italia Italian GP Autodromo Nazionale Monza, Monza 8 September 13 Singapore Grand Prix Singapore GP Marina Bay Street Circuit, Marina Bay, Singapore 22 September 14 Korean Grand Prix Korean GP Korea International Circuit, Yeongam 6 October 15 Japanese Grand Prix Japanese GP Suzuka Circuit, Suzuka 13 October 16 Airtel Indian Grand Prix Indian GP Buddh International Circuit, Greater Noida 27 October 17 Etihad Airways Abu Dhabi Grand Prix Abu Dhabi GP Yas Marina Circuit, Abu Dhabi 3 November 18 United States Grand Prix United States GP Circuit of the Americas, Austin 17 November 19 Grande Prêmio do Brasil Brazilian GP Autódromo José Carlos Pace, São Paulo 24 November Sources: ===Calendar changes=== * The European Grand Prix was discontinued starting in 2013. * Nürburgring hosted the German Grand Prix in 2013. ==Results and standings== ===Grands Prix=== Grand Prix Pole position Fastest lap Winning driver Winning constructor 1 Australian Grand Prix Sebastian Vettel Kimi Räikkönen Kimi Räikkönen Lotus- Renault Report 2 Malaysian Grand Prix Sebastian Vettel Sergio Pérez Sebastian Vettel Red Bull-Renault Report 3 Chinese Grand Prix Lewis Hamilton Sebastian Vettel Fernando Alonso Ferrari Report 4 Bahrain Grand Prix Nico Rosberg Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 5 Spanish Grand Prix Nico Rosberg Esteban Gutiérrez Fernando Alonso Ferrari Report 6 Monaco Grand Prix Nico Rosberg Sebastian Vettel Nico Rosberg Mercedes Report 7 Canadian Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault Report 8 British Grand Prix Lewis Hamilton Mark Webber Nico Rosberg Mercedes Report 9 German Grand Prix Lewis Hamilton Fernando Alonso Sebastian Vettel Red Bull-Renault Report 10 Hungarian Grand Prix Lewis Hamilton Mark Webber Lewis Hamilton Mercedes Report 11 Belgian Grand Prix Lewis Hamilton Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 12 Italian Grand Prix Sebastian Vettel Lewis Hamilton Sebastian Vettel Red Bull-Renault Report 13 Singapore Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 14 Korean Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 15 Japanese Grand Prix Mark Webber Mark Webber Sebastian Vettel Red Bull-Renault Report 16 Indian Grand Prix Sebastian Vettel Kimi Räikkönen Sebastian Vettel Red Bull-Renault Report 17 Abu Dhabi Grand Prix Mark Webber Fernando Alonso Sebastian Vettel Red Bull-Renault Report 18 United States Grand Prix Sebastian Vettel Sebastian Vettel Sebastian Vettel Red Bull-Renault Report 19 Brazilian Grand Prix Sebastian Vettel Mark Webber Sebastian Vettel Red Bull-Renault Report ===Drivers' standings=== Points are awarded to the top ten classified finishers using the following structure: Position 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th Points 25 18 15 12 10 8 6 4 2 1 {| class=\"wikitable\" style=\"font-size:85%; text- align:center;\" Driver Grands Prix Points AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA 1 Sebastian Vettel 3 1 4 1 4 2 1 Ret 1 3 1 1 1 1 1 1 1 1 1 397 2 Fernando Alonso 2 Ret 1 8 1 7 2 3 4 5 2 2 2 6 4 11 5 5 3 242 3 Mark Webber 6 2 Ret 7 5 3 4 2 7 4 5 3 15† Ret 2 Ret 2 3 2 199 4 Lewis Hamilton 5 3 3 5 12 4 3 4 5 1 3 9 5 5 Ret 6 7 4 9 189 5 Kimi Räikkönen 1 7 2 2 2 10 9 5 2 2 Ret 11 3 2 5 7 Ret 183 6 Nico Rosberg Ret 4 Ret 9 6 1 5 1 9 19† 4 6 4 7 8 2 3 9 5 171 7 Romain Grosjean 10 6 9 3 Ret Ret 13 19† 3 6 8 8 Ret 3 3 3 4 2 Ret 132 8 Felipe Massa 4 5 6 15 3 Ret 8 6 Ret 8 7 4 6 9 10 4 8 12 7 112 9 Jenson Button 9 17† 5 10 8 6 12 13 6 7 6 10 7 8 9 14 12 10 4 73 10 Nico Hülkenberg DNS 8 10 12 15 11 Ret 10 10 11 13 5 9 4 6 19† 14 6 8 51 11 Sergio Pérez 11 9 11 6 9 16† 11 20† 8 9 11 12 8 10 15 5 9 7 6 49 12 Paul di Resta 8 Ret 8 4 7 9 7 9 11 18† Ret Ret 20† Ret 11 8 6 15 11 48 13 Adrian Sutil 7 Ret Ret 13 13 5 10 7 13 Ret 9 16† 10 20† 14 9 10 Ret 13 29 14 Daniel Ricciardo Ret 18† 7 16 10 Ret 15 8 12 13 10 7 Ret 19† 13 10 16 11 10 20 15 Jean-Éric Vergne 12 10 12 Ret Ret 8 6 Ret Ret 12 12 Ret 14 18† 12 13 17 16 15 13 16 Esteban Gutiérrez 13 12 Ret 18 11 13 20† 14 14 Ret 14 13 12 11 7 15 13 13 12 6 17 Valtteri Bottas 14 11 13 14 16 12 14 12 16 Ret 15 15 13 12 17 16 15 8 Ret 4 18 Pastor Maldonado Ret Ret 14 11 14 Ret 16 11 15 10 17 14 11 13 16 12 11 17 16 1 19 Jules Bianchi 15 13 15 19 18 Ret 17 16 Ret 16 18 19 18 16 Ret 18 20 18 17 0 20 Charles Pic 16 14 16 17 17 Ret 18 15 17 15 Ret 17 19 14 18 Ret 19 20 Ret 0 21 Heikki Kovalainen 14 14 0 22 Giedo van der Garde 18 15 18 21 Ret 15 Ret 18 18 14 16 18 16 15 Ret Ret 18 19 18 0 23 Max Chilton 17 16 17 20 19 14 19 17 19 17 19 20 17 17 19 17 21 21 19 0 Driver AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA Points Grands Prix Notes: *† — Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. ===Constructors' standings=== {| class=\"wikitable\" style=\"font-size:85%; text-align:center;\" Constructor Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Grands Prix Points Constructor AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA Points 1 Red Bull-Renault 1 3 1 4 1 4 2 1 Ret 1 3 1 1 1 1 1 1 1 1 1 596 1 Red Bull-Renault 2 6 2 Ret 7 5 3 4 2 7 4 5 3 15† Ret 2 Ret 2 3 2 596 2 Mercedes 9 Ret 4 Ret 9 6 1 5 1 9 19† 4 6 4 7 8 2 3 9 5 360 2 Mercedes 10 5 3 3 5 12 4 3 4 5 1 3 9 5 5 Ret 6 7 4 9 360 3 Ferrari 3 2 Ret 1 8 1 7 2 3 4 5 2 2 2 6 4 11 5 5 3 354 3 Ferrari 4 4 5 6 15 3 Ret 8 6 Ret 8 7 4 6 9 10 4 8 12 7 354 4 Lotus- Renault 7 1 7 2 2 2 10 9 5 2 2 Ret 11 3 2 5 7 Ret 14 14 315 4 Lotus-Renault 8 10 6 9 3 Ret Ret 13 19† 3 6 8 8 Ret 3 3 3 4 2 Ret 315 5 McLaren-Mercedes 5 9 17† 5 10 8 6 12 13 6 7 6 10 7 8 9 14 12 10 4 122 5 McLaren-Mercedes 6 11 9 11 6 9 16† 11 20† 8 9 11 12 8 10 15 5 9 7 6 122 6 Force India-Mercedes 14 8 Ret 8 4 7 9 7 9 11 18† Ret Ret 20† Ret 11 8 6 15 11 77 6 Force India-Mercedes 15 7 Ret Ret 13 13 5 10 7 13 Ret 9 16† 10 20† 14 9 10 Ret 13 77 7 Sauber-Ferrari 11 DNS 8 10 12 15 11 Ret 10 10 11 13 5 9 4 6 19† 14 6 8 57 7 Sauber-Ferrari 12 13 12 Ret 18 11 13 20† 14 14 Ret 14 13 12 11 7 15 13 13 12 57 8 Toro Rosso- Ferrari 18 12 10 12 Ret Ret 8 6 Ret Ret 12 12 Ret 14 18† 12 13 17 16 15 33 8 Toro Rosso-Ferrari 19 Ret 18† 7 16 10 Ret 15 8 12 13 10 7 Ret 19† 13 10 16 11 10 33 9 Williams-Renault 16 Ret Ret 14 11 14 Ret 16 11 15 10 17 14 11 13 16 12 11 17 16 5 9 Williams-Renault 17 14 11 13 14 16 12 14 12 16 Ret 15 15 13 12 17 16 15 8 Ret 5 10 Marussia-Cosworth 22 15 13 15 19 18 Ret 17 16 Ret 16 18 19 18 16 Ret 18 20 18 17 0 10 Marussia-Cosworth 23 17 16 17 20 19 14 19 17 19 17 19 20 17 17 19 17 21 21 19 11 Caterham-Renault 20 16 14 16 17 17 Ret 18 15 17 15 Ret 17 19 14 18 Ret 19 20 Ret 0 11 Caterham-Renault 21 18 15 18 21 Ret 15 Ret 18 18 14 16 18 16 15 Ret Ret 18 19 18 0 Constructor AUS MAL CHN BHR ESP MON CAN GBR GER HUN BEL ITA SIN KOR JPN IND ABU USA BRA Points Constructor Grands Prix Points Notes: *† — Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. == References == Category:Formula One seasons Category:2013 in sports",
 "title": "2013 Formula One World Championship"
}