{
 "id": "377578",
 "text": "Carl Stumpf (21 April 1848 - 25 December 1936) was a German philosopher and psychologist. He is known for his impact on phenomenology, one of the most important philosophical trends of the twentieth century. He had an important influence on Edmund Husserl, the founder of modern phenomenology, as well as Max Wertheimer, Wolfgang Köhler and Kurt Koffka, co-founders of Gestalt psychology. Stumpf was also one of the pioneers of musicology and ethnomusicology. He held positions in the philosophy departments at the Universities of Göttingen, Würzburg, Prague, Munich and Halle, before obtaining a chair (professorship) at the University of Berlin.Stanford Encyclopedia of Philosophy. ==Phenomenology== Stumpf began his Tonpsychologie (Tone psychology) in 1875, perhaps his greatest contribution to psychology. He distinguished between phenomena and mental functions, suggesting that phenomena such as tones, colours, and images are either sensory or imaginary. Stumpf termed the study of such phenomena as phenomenology. He did a wide range of studies of the sounds of different instruments, melody, tonal fusion, and the consonance and dissonance of tones. ==Sensational phenomena== In 1903 and 1904, Stumpf was involved in two public episodes about sensational phenomena. First, an engineer from Prague claimed to have invented a machine that could change photographs of sound waves into sound. Stumpf, after attending a demonstration, wrote an article challenging it, and it was never heard about again. However, the case of Clever Hans, an apparently brilliant horse owned by Herr von Osten, was even more sensational.Boring E.G. 1950. A history of experimental psychology. New York: Appleton Century Croft. p362371 Carl Stumpf. The research done under his guidance disproved the idea that the animal understood language. It turned out that the horse was following subtle clues given unconsciously by its owner. == Major works == *1885. Tonpsychologie *1911. Die Anfänge der Musik *1928. Gefühl und Gefühlsempfindung *1939-1940. Erkenntnislehre. 2 volumes, Leipzig: J.A. Barth. *1997. Carl Stumpf – Schriften zur Psychologie. H. & L. Sprung (eds) Frankfurt am Main: P. Lang. == Other sources == *1911. Pfungst O. Clever Hans (the horse of Mr. von Osten): a contribution to experimental, animal, and human psychology. New York: Henry Holt. *1982. Spiegelberg H. The phenomenological movement. 3rd ed, The Hague: Nijhoff. *1995. Ash M.G. 1995, Gestalt psychology in German culture 1890–1967. Cambridge: Camb. U. Press. *2006. Carl Stumpf – Renaissance de la philosophie. D. Fisette (ed), Paris: Vrin. *2009. Carl Stumpf. Gestalt Theory. vol. 30, #2. == References == Category:1848 births Category:1936 deaths Category:German philosophers Category:German psychologists Category:Musicologists",
 "title": "Carl Stumpf"
}