{
 "id": "377693",
 "text": "Alpine skiing is a winter sport. In this sport people try to go down hills which have snow on them with skis. The person who goes down fastest is the winner. There are many different types of races that can be done. This sport started around 1850 in Norway. Today, many people can try it because there are many ski resorts around the world to do this. For the best athletes there are many important competitions: the FIS Alpine Ski World Cup is the most known of them. Alpine skiing is played in the Olympics. Alpine skiing is also sometimes called downhill skiing. However, under this last name there are many more types of skiing, for example freestyle. == Types of races == There are four types of races in alpine skiing. In all of them, there is a start and finish line and some gates on the slope between these lines. Athletes must go between the gates, otherwise they are disqualified. *Downhill: this is the fastest race. It is also the most dangerous one. The gates are very few and the course is very long. It can have jumps and very fast turns. Every skier goes down one time only. *Super-G: this is a bit slower than downhill. There are a few more turns, but there is still some distance between them. The course can include fast turns and jumps again, and is still quite long. Every skier still goes down once only. *Giant slalom: this is much slower than downhill. There are many turns, though they are still quite wide. Every skier goes down twice in the same day. The times are then added, and the fastest total time wins. *Slalom: this is the slowest type of competition. The course is also usually very short. However, there are very many turns. The turns are very close to each other, so the skier needs to get a very quick rhythm to go through all of them. The technique here is the most important thing rather than just speed. There is also a combined event. This has one downhill race and two slalom races. The races are usually shorter than the normal ones. The event takes place on one day only. The times are added and the athlete who has the fastest total time is the winner. == References == Category:Skiing Category:Winter Olympic sports",
 "title": "Alpine skiing"
}