{
 "id": "377670",
 "text": "The Medal of Honor was created during the American Civil War. It is the highest military decoration presented by the United States government to a member of its armed forces. The recipient must have distinguished themselves at the risk of their own life above and beyond the call of duty in action against an enemy of the United States. Due to the nature of this medal it is commonly presented after the recipient has been killed (posthumously). Forty- four men of Hispanic heritage have been presented the Medal of Honor. Two were presented to members of the United States Navy. Thirteen to members of the United States Marine Corps. Twenty-nine to members of the United States Army. Twenty-five Medals of Honor were presented posthumously. The first recipient was Corporal Joseph H. De Castro of the Union Army for his actions at Gettysburg, Pennsylvania on July 3, 1863. He earned his in the American Civil War. The most recent recipient is Sergeant First Class Leroy Petry for his actions in Afghanistan. Corporal De Castro was a member of the Massachusetts Infantry. This militia was not part of the \"regular\" army. Private David Bennes Barkley was a member of the regular army during World War I and has been recognized as the Army's first Hispanic Medal of Honor recipient.Medal of Honor recipient of Hispanic Heritage , Hispanic America USA, Retrieved December 31, 2012 In 1864, Seaman John Ortega became the first Hispanic member of the U.S. Navy to receive the Medal of Honor and in 1900, Private France Silva became the first person of Hispanic descent in the U.S. Marine Corps to receive the medal.Local hero no longer forgotten, RetrievedDecember 31, 2012 Ten recipients were born outside the United States mainland. One each in Chile and Spain. Four in Mexico and four in Puerto Rico. Seaman Philip Bazaar from Chile received the medal in January 1865 and Seaman John Ortega from Spain in December 1865. The first native Mexican recipient was Staff Sergeant Marcario Garcia and the first Puerto Rican was PFC Fernando Luis Garcia.Puerto Rican Medal of Honor recipients , Oakland Tribune, Retrieved December 31, 2012 1st Lt. Rudolph B. Davila, of Hispanic-Filipino descent, was the only person of Filipino ancestry to receive the medal for his actions in the war in Europe during World War II. Private Joe P. Martinez was the first Hispanic-American recipient to be awarded the Medal of Honor posthumously for combat heroism on American soil during the same conflict.22 Asian Americans Inducted into Hall of Heroes, El Boricua, Retrieved December 31, 2012 1st Lt. Baldomero Lopez, is the only Hispanic graduate of the United States Naval Academy recipient of the Medal of Honor.1st Lieutenant Baldomero Lopez, USMC , Association of Naval Services Officers, Retrieved December 31, 2012 Captain Humbert Roque Versace was the first recipient of the Medal of Honor to be given to an Army POW for his actions during captivity in Southeast Asia during the Vietnam War.Mishalov, Neil; Versace MoH Citation excerpts from:The Washington Post, July 8, 2002; By Steve Vogel, The Washington Times; July 4, 2002; By Ellen Sorokin; The Washington Post; May 27, 2001; Stars and Stripes; January 18, 2001; By Dave Eberhart, Stars and Stripes Veterans Affairs Editor, Stars and Stripes; July 18, 2000; By Dave Eberhart, Stars and Stripes Veterans Affairs Editor and Stars and Stripes; Oct 7, 2000; By Mike Faber, Stars and Stripes Contributing Writer, Retrieved December 31, 2012 ==Terminology== Hispanic is an ethnic term employed to categorize any citizen or resident of the United States. They can be of any racial background, of any country, and of any religion, who has at least one ancestor from the people of Spain. They can also be of non-Hispanic origin but has an ancestor from Mexico, Puerto Rico, Cuba, Central or South America, or other Hispanic origin. The three largest Hispanic groups in the United States are the Mexican-Americans, Puerto Ricans and Cubans.Hispanic Population of the United States: Current Population - Survey Definition and Background, United States Census Bureau, November 2, 2000, Retrieved December 31, 2012 ==American Civil War== Three Hispanic Americans earned the Medal of Honor during the American Civil War. Two were sailors of the Union Navy and one was a soldier of the 19th Massachusetts Infantry. Image Name Rank Branch Unit Place of action Date of action Notes/Reference Navy Massachusetts, Assault on Fort Fisher \"As one of a boat crew detailed to one of the generals on shore, O.S. Bazaar bravely entered the fort in the assault and accompanied his party in carrying dispatches at the height of the battle. He was 1 of 6 men who entered the fort in the assault from the fleet\" Army Company I, 19th Massachusetts Infantry Gettysburg, Pennsylvania Attacked a confederate flag bearer from the 19th Virginia Infantry regiment and captured their flag. Navy Was a member of a landing party who made several raids in August and September 1864 which resulted in the capture of many confederate prisoners and the taking or destruction of substantial quantities of ordnance, ammunition, and supplies. A number of buildings, bridges, and salt works were also destroyed during the expedition ==Boxer rebellion== During the Boxer rebellion only one Hispanic American received the Medal of Honor and that was France Silva who earned it for \"distinguishing himself for meritorious conduct\". Image Name Rank Branch Unit Place of action Date of action Notes/Reference Marine Corps Peking, China – For distinguishing himself by meritorlous conduct ==World War I== Image Name Rank Branch Unit Place of action Date of action Notes/Reference Army Company A, 356th Infantry, 89th Division Near Pouilly, France Volunteered to swim a river to gather information on an enemy force. When he was swimming back across the river he got cramps and drowned. ==World War II== Image Name Branch Rank Unit Place of action Date of action Notes/Reference Staff Sergeant Army 30th Infantry, 3d Infantry Division St. Die, France \"[P]ersonally killed 9 Germans, eliminated 3 enemy machineguns, vanquished a specialized force which was armed with automatic weapons and grenade launchers, cleared the woods of hostile elements, and reopened the severed supply lines to the assault companies of his battalion.\" Staff Sergeant Army Company H, 7th Infantry Artena, Italy Risked his life to defeat an attacking force of enemy soldiers. Staff Sergeant Army Company B, 22d Infantry, 4th Infantry Division Near Grosshau, Germany \"While an acting squad leader, he single-handedly assaulted two enemy machine gun emplacements\" Private First Class Marine Corps 4th Battalion, 15th Marines 6th Marine Division Ryūkyū Chain, Okinawa Sacrificed his life to smother a grenade with his body Private First Class Army Company A, 127th Infantry, 32 Infantry Division Villa Verde Trail, Luzon, Philippine Islands Was killed in action in the Philippines while digging out fellow soldiers who had been buried in a bomb explosion Private First Class Army Company E, 142d Infantry, 36th Infantry Division Near Mertzwiller, France Injured in action while charging an enemy stronghold resulting in the capture of eight enemy soldiers Sergeant Army 2d Infantry Division Near Krinkelt, Belgium Single-handedly repulsed a German infantry attack, killing at least 100 enemy troops Private Army Company K, 32d Infantry, 7th Infantry Division Attu, Aleutians Killed in action while participating in the defeat of enemy forces in a snow covered mountain. Private First Class Army Company A 511th Parachute Infantry, 11th Airborne Division Fort William McKinley, Luzon, Philippine Islands Killed 18 enemy soldiers and that they were in so his company could advance Private Army Company B, 148th Infantry, 37th Division Paco Railroad Station, Manila, Philippine Islands With another soldier, who was killed in the action, killed more than 82 Japanese, completely disorganized their defense, and allowed for the enemy to be defeatede Private First Class Army 165th Infantry, 27th Infantry Division Okinawa Risked his life to eliminate an enemy pillbox and kill the 12 enemy soldiers who were occupying it Private First Class Army Company B, 7th Infantry, 3d Infantry Division Rosenkrantz, France Staff Sergeant Army Company F, 127th Infantry, 32d Infantry Division Villa Verde Trail, Luzon, Philippine Islands ==Korean War== Image Name Rank Branch Unit Place of action Date of action Notes/Reference Private First Class Marine Corps Company I 3rd Battalion, 5th Marines 1st Marine Division Korea Private First Class Marine Corps Company E 2nd Battalion, 1st Marines 1st Marine Division Kajon-ni, Korea Staff Sergeant Marine Corps Company F 2nd Battalion, 7th Marines 1st Marine Division Songuch-on, Korea Corporal Army Company G, 187th Airborne Regimental Combat Team Near Wontong-ni, Korea First Lieutenant Marine Corps Company A 1st Battalion, 5th Marines 1st Marine Division Inchon Landing, Korea Corporal Army Company A, 27th Infantry Regiment, 25th Infantry Division Satacri, Korea Private First Class Marine Corps Company G 3rd Battalion, 5th Marines 1st Marine Division Battle of Seoul Private First Class Army Company F, 17th Infantry Regiment, 7th Infantry Division Near Munye-ri, Korea ==Vietnam War== Image Name Rank Branch Unit Place of action Date of action Notes/Reference Specialist Four Army Company D, 1st Battalion, 12th Cavalry, 1st Cavalry Division Phuoc Long Province Master Sergeant Army Detachment B-56, 5th Special Forces Loc Ninh, Vietnam Lance Corporal Marine Corps Company E 2nd Battalion, 1st Marines Da Nang Private First Class Marine Corps 1st Battalion, 7th Marines Quang Nam Province Specialist Four Army Company C, 1st Battalion, 5th Infantry (Mechanized) 25th Infantry Division Hau Nghia Province Sergeant Marine Corps Company A 1st Battalion, 1st Marines Hue City Lance Corporal Marine Corps Company K 3rd Battalion, 7th Marines 1st Marine Division Quang Nam Province Lance Corporal Marine Corps III Marine Amphibious Force Quang Ngai Province Private First Class Army Company A, 2nd Battalion, 502d Infantry, 173d Airborne Brigade Dak To Specialist Four Army Reconnaissance Platoon, Headquarters Company, 1st Battalion (Airborne), 503rd Infantry,173d Airborne Brigade Republic of Vietnam Sergeant First Class Army Advisory Team 162, United States Military Assistance Command Northeast of Katum, Republic of Vietnam Captain Army Headquarters and Headquarters Company, 1st Battalion, 28th Infantry, 1st Infantry Division Tay Ninh Province Specialist Four Army Company B, 5th Battalion, 7th Cavalry, 1st Cavalry Division (airmobile) Quang Tri Province Sergeant First Class Army Company C, 2d Battalion, 8th Infantry, 4th Infantry Division Republic of Vietnam Captain Marine Corps Company G 2nd Battalion, 4th Marines 9th Marine Amphibious Brigade Dai Do – Captain Army Detachment A-23, 5th Special Forces Group An Xuyen Province – First Sergeant Army Company A, 4th Battalion, 9th Infantry, 25th Infantry Division Near Phu Hoa Dong ==War in Afghanistan== Image Name Rank Branch Unit Place of action Date of action Notes/Reference Army 75th Ranger Regiment Afghanistan An enemy threw a grenade at their position which landed 10 meters from them; it detonated, knocked them to the ground, wounded Higgins, and Robinson was further wounded. Shortly thereafter the three were joined by SSG James Roberts and SPC Christopher Gathercole. Another grenade was thrown by an enemy which landed a few feet from Higgins and Robinson. Petry, knowing the risk to his life, moved toward the grenade, picked it up, and attempted to throw it in the direction of the enemy. ==By military branch== Awards by branch of service Military branch Posthumously In person Number of awards Army 14 15 29 Marines 11 2 13 Navy 0 2 2 Total 25 19 44 Note: The information in \"Awards by branch of service Table\" is based on the sourced information on the \"List of Recipients Table\". ==References== : ==Other websites== *Hispanic Medal of Honor Society Listing of Hispanics who received the Medal of Honor and those who are listed as nominees. * * * * Eugene A. Obregon Congressional Medal of Honor Memorial Foundation , dedicated to financing and constructing a monument to honor the Congressional Medal of Honor recipients of Latino descent. * * *. (Original air date: September 20, 2005) * Category:Lists of Medal of Honor recipients",
 "title": "List of Hispanic Medal of Honor recipients"
}