{
 "id": "377793",
 "text": "Jennifer Alice Clack FRS (née Agnew; 3 November 1947 – 26 March 2020) was an English palaeontologist. She was curator at the Cambridge University Museum of Zoology, and Professor of Vertebrate Palaeontology at Cambridge University. Her career was devoted to studying the early evolution of tetrapods. Lobe- finned fish in the Devonian evolved into tetrapods in a series of transitional fossils. Clack adopted the term \"fishapod\" to describe these animals. They then colonized the freshwater swamps of the Carboniferous period. == Life == Clack attended Bolton School, one of the oldest schools in Lancashire. She received a BSc in Zoology from the University of Newcastle upon Tyne in 1970. and a PhD in 1984. She also held a Graduate Certificate in Museum Studies from the University of Leicester and an M.A. and D.Sc. from the University of Cambridge. In 2006, Clack was awarded a personal chair by the University of Cambridge, taking the title Professor of Vertebrate Palaeontology. In 2008 she was awarded the Daniel Giraud Elliot Medal from the U.S. National Academy of Sciences. She was elected a Fellow of the Royal Society in 2009. The fairly complete fossil of Acanthostega she discovered in Greenland in 1987 is a transitional, water-bound primitive tetrapod. In April 2012 she was featured in an episode of the BBC television series Beautiful Minds, a set of documentaries about scientists who have made important discoveries.BBC Four: Beautiful minds: Professor Jennifer Clack Clack died on 26 March 2020 at the age of 72. == Books and articles == *2000. The origin of tetrapods. In Amphibian biology, vol 4. Heatwole H. and Carroll R.L. (eds) Surrey Beatty pp. 973–1029. and (with Carroll R.L.) Early Carboniferous tetrapods. pp. 1030–1043 *2002. An early tetrapod from 'Romer's Gap'. Nature 418, 72–76 *2005. Fossil vertebrates: Palaeozoic non-amniote tetrapods. Encyclopaedia of Geology. Elsevier, Oxford 2: 468-497 *2005. Getting a leg up on land. Scientific American. *2012. Gaining ground: the origin and early evolution of tetrapods. 2nd ed, Bloominton, Indiana: Indiana University Press. , () == References == == Other websites == *Jenny Clack on the Cambridge University website *Home page - Jennifer \"Jenny\" Clack *Profile on PBS website *Interview on PBS website Category:1947 births Category:2020 deaths Category:English palaeontologists Category:Fellows of the Royal Society",
 "title": "Jenny Clack"
}