{
 "id": "377835",
 "text": "==Predicted and scheduled events== * January 1 – Books, movies, and other works published in 1949 will enter the public domain in the United States. * May 5 - 100th anniversary of the Yosemite Sam. * June 15 - 100th anniversary of the ABC News. * August 12 - A solar eclipse will occur from northern California to Florida. * October 24 - 100th anniversary of the United Nations * November 22 - 50th anniversary of the Toy Story. ===Date unknown=== * Futurist Ray Kurzweil predicts a technological singularity for 2045, i.e. a runaway cycle of self-improvement by intelligent machines, resulting in explosive technological development. * Based on Ray Kurzweil's ideas, Time magazine predicts humans will be immortal by this year.\"2045: The year man becomes immortal , published on 10 February 2011. * Demographic projections \"foresee the population of Egypt overtaking that of Russia by 2045,\" according to Niall Ferguson.\"The Year the World Really Changed,\" Newsweek, November 16, 2009 * Two of Japan's largest cities - Tokyo and Osaka - will be connected by a direct high-speed maglev route. * The United Kingdom is set to overtake Germany as Europe's leading economy.\"The N-11: More Than an Acronym\" - Goldman Sachs study of N11 nations, Global Economics Paper No: 153, March 28, 2007. ==In fiction== * In the novel 2045: A Story of Our Future, Peter Seidel portrays what the world could be like in 2045, if current trends in environmental destruction, population growth, and economic inequality continue. * Beginning of Corporation War in Ace Combat 3: Electrosphere * In South Africa white minority rule comes to an end as most of the whites are massacred in an uprising, in John Wyndham's The Outward Urge. * The American Dad character Klaus has a body again and a grandson. * The events portrayed in the movie Critters 4 take place in 2045. * Time in History where Command & Conquer: Tiberium Wars, the 3rd Tiberium War takes place. * In Macross 7, The main events of the series take place in this year. * Doomsday in Angels & Airwaves movie L)VE (LOVE) ==References== Category:2045",
 "title": "2045"
}