{
 "id": "378059",
 "text": "The 442nd Regimental Combat Team () of the United States Army was a regimental size fighting unit. It was composed almost entirely of American soldiers of Japanese descent. These men volunteered to fight in World War II even though their families were subject to internment. The 442nd, beginning in 1944, fought primarily in Europe during World War II. The 442nd was a self- sufficient force. It fought with uncommon distinction in Italy, southern France, and Germany. The 442nd is considered to be the most decorated infantry regiment in the history of the United States Army. The 442nd was awarded eight Presidential Unit Citations and twenty-one of its members were awarded the Medal of Honor for World War II. The 442nd Regimental Combat Team motto was, \"Go for Broke\". ==References== == References == * * * * * * * * * * * * * * * ==Other websites== ===Official sites=== * 22 Asian Americans Inducted into Hall of Heroes (pentagon.mil) * The \"Go for Broke\" Regiment Lives Duty, Honor, Country (defenselink.mil) ===Resources=== * Asian-Nation: 442nd RCT Rescue of the Lost Battalion * Go For Broke National Education Center * The 442nd Regimental Combat Team * 100th Battalion, 442nd Infantry * Hawaii Star Bulletin article on Hawaii Statehood passage * \"U.S. Samurais in Bruyeres\" by Pierre Moulin * The Story of the 442nd Combat Team compiled by members of the 442nd Combat Team, Mitsuye Yamada papers, Special Collections and Archives, The UC Irvine Libraries, via Calisphere. * \"From a Quiet American, a Story of War and Remembrance\". The New York Times. 16 August 2008. * Medal of Honor recipient George Joe Sakato on Veterans Chronicles produced by the * Japanese American Veterans Collection , Archives & Manuscripts Department, University of Hawaii at Manoa Library ===Media=== * 442-Live with Honor, Die with Dignity: Documentary Film 2010 * Valor with Honor: documentary film on the Japanese American 442nd Regimental Combat Team * ONLY THE BRAVE Official Movie Site * The Official Website for upcoming movie LITTLE IRON MEN about the 442nd's rescue of the Lost Battalion * A Path to Lunch Liberation Day and the Liberation of America, the 442nd in Lunigiana and Versilia. ===Organizations=== * Americans of Japanese Ancestry World War II Memorial Alliance * WWII Japanese American Veterans' Registry * 442nd Regimental Combat Team Historical Society * 442nd World War II Reenactors * Go For Broke National Education Center Category:Congressional Gold Medal recipients",
 "title": "442nd Infantry Regiment (United States)"
}