{
 "id": "37815",
 "text": "Charlize Theron (born 7 August 1975) is a South African-born American actress. She won an Academy Award for her role in the movie Monster. She was nominated for her role in the movie North Country. Theron can speak three languages, her first being Afrikaans. == Early life == Theron was born in Benoni near Johannesburg. Her ancestry is German and Dutch. She attended a boarding school at the age of thirteen. At the age of fifteen, she saw her alcoholic father being killed by her mother as an act of self - defence. No charges were pressed against her mother. == Career == At the age of sixteen, she won a local modelling competition and went to Milan, Italy for a one year contract. After her modelling contract was over, she moved to New York, United States, and became a ballet dancer. She injured her knee at the age of eighteen, ending her career of being a ballet dancer. She did star in a few movies, but only really became noticed when she portrayed the life of serial killer, Aileen Wuornos, in the movie Monster. She won an Oscar for her role in this movie. After this, she got a lot of attention from the perfume label, Dior, and appeared in some of their advertisements. She also does a lot of community work, including for PETA, for their anti - fur ads. She also works with animal rights activists and supports same-sex marriage. She has become one of Hollywood’s most acclaimed actresses. Theron became an American citizen in 2007. ==Filmography== ===Film=== Year Title Role Director(s) Notes 1995 Children of the Corn III: Urban Harvest Eli's follower Uncredited Direct-to-video release 1996 2 Days in the Valley 1996 That Thing You Do! 1997 Trial and Error 1997 1998 Celebrity Supermodel 1998 Mighty Joe Young 1999 1999 2000 Reindeer Games 2000 2000 Men of Honor 2000 2001 Sweet November 2001 15 Minutes 2001 2002 Trapped 2002 Waking Up in Reno 2003 2003 Monster Also producer 2004 Head in the Clouds 2005 North Country 2005 Æon Flux She also appeared in the video game based on the film 2006 East of Havana - Emilia Menocal Producer Documentary 2007 In the Valley of Elah 2007 Battle in Seattle Ella 2008 Sleepwalking Also producer 2008 Hancock 2008 Sylvia Also executive producer 2009 Wife 2009 Astro Boy Narrator Voice only 2011 Young Adult 2012 Snow White and the Huntsman 2012 Prometheus 2014 Anna 2015 Dark Places Also producer 2015 Mad Max: Fury Road 2016 2016 2016 Kubo and the Two Strings Monkey Sariatu Voice only 2016 Brain on Fire - Producer 2017 Also producer 2017 Cipher 2018 Tully Marlo Also producer 2018 Gringo 2019 Long Shot Also producer 2019 Murder Mystery - Executive producer 2019 The Addams Family Voice only Also executive producer 2019 Bombshell Also producer 2020 Fast & Furious 9 Cipher Post-production TBA Andromache of Scythia Post-production Also producer Key Denotes films that have not yet been released ==References== == Other websites == * Official website * * * * Theron brushes up on Hill of Tara * Food Bank For New York City public service announcement Category:Afrikaner people Category:Academy Award winning actors Category:Animal rights activists Category:Golden Globe Award winning actors Category:LGBT rights activists Category:American movie actors Category:American movie producers Category:Naturalized citizens of the United States Category:Screen Actors Guild Award winners Category:South African actors Category:American television actors Category:American voice actors Category:White South African people Category:1975 births Category:Living people Category:South African models",
 "title": "Charlize Theron"
}