{
 "id": "378192",
 "text": "Cao Dai (also Caodaism or Caodaiism) is a new religious movement founded in Vietnam. It mixes ideas from other religions. Cao Đài is a syncretic, monotheistic religion officially established in the city of Tây Ninh, southern Vietnam in 1926. The religion combines Buddhism, Christianity, Taoism, Confucianism. The full name of the religion is Đại Đạo Tam Kỳ Phổ Độ (great religion of the third period of revelation and salvation). Cao Dai uses ethical precepts from Confucianism, occult practices from Taoism, theories of Karma and Rebirth from Buddhism, and a hierarchical organization (including a Pope) from Christianity. Caodaiists (believers of Cao Dai) believe that the first disciples of the religion, Ngô Văn Chiêu, Cao Quỳnh Cư, Phạm Công Tắc and Cao Hoài Sang spoke to God and God spoke to them. God told them to establish a new religion that would commence the third era of religious amnesty. Because of this, Caodaiist credit God for founding their religion. The ultimate goal of a Caodaist is to rejoin with God the Father in Heaven and to break away from the cycle of rebirth and death. Women can only wear white dresses as they have to be pure, whereas men can wear colored clothing once they reach higher levels in the religion. == History == Cao Dai was established in the Vietnamese city of Tây Ninh in 1926. Cao Dai was granted legal recognition in 1997. Cao Dai was found by Ngô Văn Chiêu, Cao Quỳnh Cư, Phạm Công Tắc, and Cao Hoài. Caodaist believe God spoke to these people to establish a new religion. == Teachings and beliefs == === Name of God === The name for God in Cao Dai is Cao Đài the Ancient Sage and Great Bodhisattva Mahasattva. Caodaiist believe God chose this title because it represents the Three Teachings: Saint, Sage, and Buddha. === Creation beliefs === Cao Dai teaches that before God existed, there was Tao. Tao is the unchanging, nameless, formless, immortal source. Then the Big Bang occurred, and out of the Big Bang, God miraculously blessed us with his birth and was poured onto us from the universe (emanationism). The Universe could not be formed so Yin Yang were created by the Almighty himself. As Adam took one of his ribs to create Eve, God took control of yang and a part of himself, thereby creating the Goddess to assemble with yin. Now that the Union was completed, the Universe was formed. The Goddess, Holy Mother, is referred by Caodaiist as Mother Buddha. Cao Dai teaches that there are 36 levels of Heaven, and 72 planets having intelligent life. The first planet is closest to Heaven while number 72 is closest to Hell. Earth is number 68. == The three teachings == The three teachings of Cao Dai are: * Buddha * Sage * Saint * Tomiwa Note: The top is believed to be the hardest to achieve while the bottom is believed to be the easiest to achieve. The three teachings represent levels of spiritual attainment. In Cao Dai's teaching being a Buddha is the hardest to achieve. Cao Dai teaches that humans can develop into other beings. Humans can develop into: Thần (angel), Thánh (saint), Tiên (sage), and Phật (buddha). According to Cao Dai, everyone can turn into one of these beings. Angels, Saints, and Sages have extremely long lives in the realms of Heavens, but Buddhas are the only ones free from the cycle of birth and death. == The three periods of revelation and salvation== === First period === #The teachings of the Buddhas - Dīpankara Buddha #The teachings of sages #The teachings of saints - Phục Hy ( Fu Xi ) === Second period === #The teachings of the Buddhas - Shakyamuni Buddha (Gautama Buddha ) #The teachings of sages - Laozi #The teachings of saints - Confucius and Jesus Christ. === Third period === According to Cao Dai teachings, God is at helm, he will not take human form as in the two past periods. Instead he sends his teachings through sacred seance ceremonies. The three anchors (the three teachings) are: #The teachings of the Buddhas - Guan Yin #The teachings of sages - Lý Bạch #The teachings of saints - Guan Yu == Holy people == There are many Holy people from other religions. Some people from history are also venerated including: Buddha, Lao Tzu, Confucius, Guan Yin, Jesus, Sun Yat-sen, Victor Hugo, and many more. == Holy scriptures == These are the main scriptures of Cao Dai. * Kinh Thiên Đạo Và Thế Đạo (Prayers of the Heavenly and the Earthly Way) This is used for Daily life and Prayers for Worship. * Pháp Chánh Truyền (The Religious Constitution of Caodaiism) This is used for information on the elections of officials, their powers, and ritual dress. * Tân Luật (The New Canonical Codes) This is used for laws regulating religious, secular, monastic life. * Thánh Ngôn Hiệp Tuyển (Compilation of Divine Messages) * Hộ Pháp Phạm Công Tắc The Sermons of His Holiness Other branches of Cao Dai have additional scriptures. == Organizational structure == Cao Dai has an organizational structure similar to Catholicism. Cao Dai's hierarchy includes a Pope, cardinals, bishops, priest, etc. Cao Dai teaches equality between men and women, but women are not allowed to be Legislative Cardinal and Pope, the two highest positions in Cao Dai. The religion and church claims that God ordered this because Yang represents Male while Yin represents Female. Yin cannot dominate Yang or else Chaos will happen. == Branches == In total there are about 6 officially recognized branches of Cao Dai. There are several others. The largest branch is based in Tây Ninh Province, where the religion was founded in 1926 and where the seat of Cao Đài authority is located. Some sects broke away from the Tây Ninh Holy See. The sects that broke away are Chiếu Minh, Bến Tre, and Đà Nẵng. Ngô Văn Chiêu founded Chiếu Minh. He left because he refused his appointment as Cao Dai's first Pope. == Demographics == Cao Dai is the third largest religion in Vietnam after Buddhism and Roman Catholicism. Estimates of followers in Vietnam is about 2-6 million, or around 2%. Estimates of followers in other countries is about 30,000. ==References== *Hoskins, Janet Alison. 2015. The Divine Eye and the Diaspora: Vietnamese Syncretism Becomes Transpacific Caodaism. Honolulu: University of Hawaii Press. . Category:East Asian religions Category:New religious movements Category:Religion in Vietnam Category:Organizations based in Vietnam",
 "title": "Cao Dai"
}