{
 "id": "378196",
 "text": "2050 (MML) will be a common year starting on Saturday of the Gregorian calendar, the 2050th year of the Common Era (CE) and Anno Domini (AD) designations, the 50th year of the 3rd millennium, the 50th year of the 21st century, and the 1st year of the 2050s decade. == Predicted and scheduled events == === January === *January 1 – Books, movies, and other works published in 1954 will enter the public domain in the United States. === Unknown dates === *The 2050 Winter Olympics will be held. * In July 2008, the G8 agreed to halve global greenhouse gas emissions by 2050. * In November 2006, Achim Steiner, executive director of the United Nations Environment Program, “warned of a global collapse of all species being fished, if fishing continues at its current pace.” * In October 2007, artificial intelligence researcher David Levy predicted that by 2050, human-robot marriages, human- robot sex, and human-robot pornography will become common. * According to a 2002 study by World Wildlife Fund, planet Earth will not have sufficient resources to sustain human life by this year. *Due to climate change, fish body size will decline by nearly a quarter. * In March 2006, Professor Gerry Gilmore predicted that ground-based astronomy would become impossible by this year because of pollution from aircraft exhaust trails and climate change. * By 2050, the price of PEM fuel cell is as low as 100 Euros per kilowatt-hour compared to the present value of 8000 Euros per kilowatt-hour. This is because most cars work on fuel cell technology and Hydrogen gas. * In 2002, it was predicted that the number of people suffering from Alzheimer's disease in the United States would triple by 2050 to 16 million. This was higher than the earlier projection of 14 million in 1990. In June 2007, a study by American researchers concluded that the global prevalence of Alzheimer's disease will quadruple by 2050 from its 2006 figure to over 100 million. However, this does not take into account the possibility that medical science will eventually advance to the point where society will figure out how to stop and reverse the effects of Alzheimer's. * Arnulf Jaeger-Walden of the European commission's Institute for Energy believes that solar power from North Africa can provide 100 GW to the entire continent of Europe. * Goldman Sachs predicts that by 2050, the ten largest economies in the world will be China, the United States, India, Brazil, Russia, Japan, Mexico, Indonesia, the United Kingdom, and France, in that order. * Expected completion of a space elevator. *Wales aims to recycle 100% of its waste. == World population == * In November 2001, the United Nations Population Fund reported that the world population is projected to be 9.3 billion in 2050 from 6.1 billion then with most of the increase in developing countries even as the population of industrialized countries will \"remain stable\". This figure was revised to 9.1 billion in 2005 and 9.2 billion in 2007. In 2008, the United States Census Bureau projected a world population of 9.5 billion. * Another study done by the European Commission, community research said that the world population is expected to grow at a decreasing rate to 8.9 billion in 2050 and after 2030, the population in several countries including China and various European nations will decrease. Stabilization in the population will happen in the second half of the century.ftp://ftp.cordis.europa.eu/pub/fp7/energy/docs/weto-h2_en.pdf *In the rich industrialized countries, with the exception of the United States where immigrants enjoy a rise in population, generation replacement is no longer assured. *It is calculated there will be 601,000 centenarians (people at least a hundred years old - born before 1950) in the USA by 2050.National Geographic, November 2011. *\"The population continues to grow but at a slower pace\", summarizes the demographer Thomas Buettner, author of UN report on \"World population projections (1950-2050)\", presented Thursday, February 24, 2005. According to this study, 9.075 billion people will inhabit Earth in 2050, against 7 billion today. *This increase amounts to adding to the current world population combined populations of and , stresses the population division of the United Nations. *The general trend is, however, a slowdown in population growth compared to gains of twenty to fifty years, this tends to confirm a gradual stabilization of the overall population. *By 2050, India will overtake People's Republic of China to top the list of the most populous countries, and these two countries represent about 50% of world population (as against 37% today). *Not surprisingly, population growth will be highest in poor countries already struggling to provide food security for its people. \"Births planning and fertility decline explain this difference\", stresses the UN report. * The United Nations predicts that 2 out of every 9 people in the world will be 60 years or older. World life expectancy at birth is also expected to exceed 76 years. == In fiction == === Literature === * Nineteen Eighty-Four by George Orwell (1948): The language Newspeak will become the official language of Oceania. * Life in 2050 by Ulrich Eberl: The book illustrates what life may be like during this year. * Short story \"The Weed of Time\" by Norman Spinrad: The first manned mission to Tau Ceti returns to Earth on September 8, bearing with it the timesense-expanding plant tempis ceti. === Television === * Immortal Grand Prix (2005): The second season takes place during the middle of this year. * The start of events in the UK situation comedy Come Back Mrs. Noah. * Children's television series Silversun starts on its 90-year journey to a livable planet 45 light years from Earth. === Film === * Love Story 2050 (2008, Hindi) * Sunshine-The spaceship Icarus I heads on a journey to re-ignite the dying sun, only to fail. === Computer and video games === * Shadowrun (1993) * Maelstrom (2007) * Dropship: United Peace Force (2002) * In Civilization V the game ends automatically if nobody wins by 2050. == References == * U.S. Census Bureau: Population Prediction (by country) * Guardian article on Spains shrinking coastline ==Other websites== * Imagining the tech world in 2050 at CNET Category:2050",
 "title": "2050"
}