{
 "id": "378247",
 "text": "The Division of Barton is a Federal Electoral Division for the Australian House of Representatives in the state of New South Wales. It was created in 1922 and is named for Sir Edmund Barton, the first Prime Minister of Australia. It includes the inner suburbs of Arncliffe, Banksia, Bardwell Valley, Beverley Park, Bexley, Bexley North, Brighton-Le-Sands, Carss Park, Dolls Point, Kogarah, Kogarah Bay, Kyeemagh, Monterey, Ramsgate, Ramsgate Beach, Rockdale, Sandringham, Sans Souci, Turrella and Wolli Creek and parts of Beverly Hills, Carlton, Earlwood and Kingsgrove. ==Members== Member Party Term Frederick McDonald Labor 1922–1925 Thomas Ley Nationalist 1925–1928 James Tully Labor 1928–1931 Albert Lane United Australia 1931–1940 H. V. Evatt Labor 1940–1958 Leonard Reynolds Labor 1958–1966 William Arthur Liberal 1966–1969 Leonard Reynolds Labor 1969–1975 James Bradfield Liberal 1975–1983 Gary Punch Labor 1983–1996 Robert McClelland Labor 1996-2013 Nickolas Varvaris Liberal 2013–2016 Linda Burney Labor 2016 - present Dr H. V. Evatt was the Leader of the ALP 1951–60. Evatt nearly lost the seat in 1951 and 1955, and in 1958 he moved to the safe seat of Hunter. The first member for Barton was Labor's Frederick McDonald. He disappeared after his 1925 defeat by Nationalist Thomas Ley. It is now believed that Ley had him murdered.Lateline History Challenge: Minister for Murder, Australian Broadcasting Corporation, 2004. Ley was later found to be insane and died in Broadmoor Asylum in Britain. Robert McClelland, was Australia's Attorney-General. Linda Burney is the first Indigenous Australian woman elected to the Australian parliament.Australia Votes | Federal Election 2016 (Australian Broadcasting Corporation): Barton - Australia Votes | Federal Election 2016 (Australian Broadcasting Corporation), accessdate: July 20, 2016 ==Election results== ==References== *Division of Barton - Australian Electoral Commission ==Other websites== * Nickolas Varvaris' website Barton Category:1922 establishments in Australia",
 "title": "Division of Barton"
}