{
 "id": "378415",
 "text": "The Barak Valley (Bengali: বরাক উপত্যকা) (also South Assam) is located in the southern region of the Indian state of Assam. The main city of the valley is Silchar. The region is named after the Barak river. The Barak valley mainly consists of three administrative districts of Assam State - namely Cachar, Karimganj, and Hailakandi. Among these three districts, Cachar and Hailakandi belonged to the erstwhile Cachar district in British-India, whereas Karimganj belonged to the Sylhet district . Karimganj was separated from Sylhet after the 1947 referendum; with the rest of Sylhet falling under East Pakistan and Karimganj under India. Bengali and Meitei (Manipuri) are the two official languages of Barak Valley districts of Assam. == Etymology == The name \"Barak\" has derived from the Dimasa words 'Bra' & 'Kro'. Bra means bifurcation and Kro upper portion/stream. The river Barak is bifurcated near Haritikar in the Karimganj district in to Surma River and Kushiyara River. The upstream of this bifurcated river was called Brakro by the local Dimasa people. Over the years, Brakro got converted in to Barak. == Demography == Barak valley had a population of 4,377,612 as per as 2021 census. Hinduism have gone-down from 50% in 2011 to 47% in 2021 due to low fertility rate and large scale immigration of the community from the Valley to others parts of the region in search of jobs and livelihood. The number of Hindu immigrants from Bangladesh into Barak Valley has varied estimates from year 1971-2014. According to the Assam government, (1.3-1.5) lakhs such people residing in the Barak Valley are eligible for citizenship if the Citizenship (Amendment) Act, 2019 becomes a law. Islam is the fastest growing religion in Barak valley, As per as 2011 census, Muslims were 48.1% in the valley and in 2021 census it have gone up to 51% due to high fertility rate and lower immigration of the community to others regions/parts of the country. Christian missionaries have active in Barak region since from the time of independence. As a result of Christian missionaries, Christianity is rapidly growing among the tribals and poor section of Muslim and Hindu society of the valley since from the past 2 decades. In 2011, Barak valley had 57.9 thousand christians but in the year of 2021, it have grown to almost 74.4 thousands approximately due to high rate of conversion from various church denomination missionaries from the valley.The activities of Welsh Presbyterian Mission in Barak Valley Barak valley population by religious diversity (2021) Religion Population Percentage Hindu () 2,057,477 47 Muslim () 2,232,582 51 Christian () 74,419 1.7 Others 13,132 0.3 ==References== Category:Assam Category:Valleys Category:Geography of India",
 "title": "Barak Valley"
}