{
 "id": "37854",
 "text": "The Sahrawi Arab Democratic Republic is a self-declared state with a government in exile claiming all of Western Sahara. However, the government only has control over about 20% of the territory. It is recognized by around 80 countries. It is controlled by the Polisario Front consisting mostly of Sahrawis. Its president is Brahim Ghali and its prime minister is Bucharaya Hammudi Beyun. The Polisario Front says the capital is Aauin. However, Aauin is controlled by Morocco. The Polisario declared sovereignty on Western Sahara in 1976. The Polisario currently claims to control about 20% of the territory. Poliario calls the territories under its control \"Liberated Territories\" or part of the Free Zone. Morocco controls and administers the rest of the disputed territory. It calls these lands its Southern Provinces. The SADR government considers the Moroccan-held territory occupied territory. Morocco considers the much smaller SADR held territory to be a buffer zone. The \"free zone\" is referred to as 'west of the Verge. The southern Provinces are referred to as 'east of the Verge' by the UN. == History == The Western Sahara was a Spanish colony from 1884 to 1976. In the early seventies, Spain made its intentions to withdraw from the region clear. Morocco, Mauritania and the liberation front Polisario wanted to succeed the Spanish authority. Spain planned on holding a vote in 1975 so the population of the territory could determine who will gain authority. Morocco opposed this idea and requested the UN to inform about the legal status of the area. The International Court of Justice declared its statement in 1975 favouring the idea of self- determination. As a response to this statement, King Hassan II of Morocco launched \"The Green March\". Hundreds of thousands of Moroccan civilians marched into Western Sahara to address its claim to the territory. Spain is able to stop the march, but under the pressure of Morocco and due to fear of getting engaged in a foreign conflict while having domestic problems decided to hand over the area to Moroccan and Mauritania. It agreed on a partition of the territory with Morocco gaining the northern two-thirds of the country and Mauritania the southern third. Morocco bases its claims on the territory on history It sees Western Sahara as part of the Moroccan nation. The presence of phosphor and fishing grounds in Western Sahara may have also been a motive.Migdalovitz, C. (2008). Western Sahara: Status of Settlement Efforts. The Polisario Front came to existence in the early seventies as a guerilla movement opposing the Spanish colonial control. The Front is mostly made up of Sahrawis - the indigenous nomadic people of Western Sahara. The movement had its base in Mauritania until the partition of Western Sahara. Polisario's military opposed the overtake of Morocco and Mauritania of Western Sahara. After the partition Polisario moved to Algeria It established its headquarters in Tindouf. It kept on opposing Morocco and Mauritania with the military aid of Algeria. In 1976 they proclaimed independence of the SADR and the government in exile. Algeria's support of Polisario and the SADR is a way to oppose Morocco. They compete for regional power since both countries gained independence. Their support of Polisario could give them access to the Atlantic Ocean if Polisario gained control over the Western Sahara.Migdalovitz, C. (2008). Western Sahara: Status of Settlement Efforts. In 1976 Mauritania signed a peace treaty with Polisario. It retreated from Western Sahara in 1979. Morocco annexed those parts. In 1981 it started the construction of a berm that separates the parts controlled by Polisario from the part controlled by Morocco. In 1991 the UN called for a cease-fire. It proposed that a referendum should be held with the creation of the United Nations Mission for the Organization of a Referendum in Western Sahara (MINURSO). The population should decide whether they wanted independence or integration in Morocco. The referendum kept on being postponed. When Muhammad VI replaced King Hassan II in 1999, Morocco did not agree anymore to holding the referendum. The UN then proposed what is known as the 'Baker plan'. Autonomy would be granted with Morocco still controlling foreign relations, national security, and defence for five years after which a referendum would be held for independence, autonomy or incorporation in Morocco. Algeria and Polisario accepted the plan but Morocco rejected it. They state that it only saw autonomy as an option and that independence was not possible. So far, no agreements have been reached. The SADR was incorporated into the African Union in 1984. It gained recognition in many African states. Morocco left the Union but rejoined in 2017 == Politics == The Sahrawi parliament or Sahrawi National Council is the legislative body of the SADR. It is unicameral. It consists of 53 members and has Hamma Salama as president. It was created in 1976 by the Polisario Front and they are the only party elected. Every three years new members are elected at elections held either in the 'free zones' or in the refugee camps in Algeria where most of the Sahrawi population lives. Delegates in the refugee camps, representatives of Polisario and several civil organizations chose the candidates for the parliament. The first two constitutions were promulgated in 1976 with the proclamation of the republic. When SADR joined the African Union in 1982 it was required to organize itself better politically. There were constitutional reforms. In 1991 a new constitution was promulgated. The constitution is very similar to that of Algeria. The parliament is the main operating body instead of the president. == References == Category:Unrecognized countries Category:Dependent territories Category:Western Sahara",
 "title": "Sahrawi Arab Democratic Republic"
}