{
 "id": "378692",
 "text": "Thomas Jerome Hudner, Jr. (August 31, 1924 - November 13, 2017) was a retired officer of the United States Navy. He is also a former naval aviator. He rose to the rank of captain. He received the Medal of Honor for his actions trying to save the life of his wingman, Ensign Jesse L. Brown. It was during the Battle of Chosin Reservoir in the Korean War. ==Biography== He was born in Fall River, Massachusetts. He was a student at Phillips Academy and the United States Naval Academy. At first he was not interested in aviation, but later he learned to fly and joined Fighter Squadron 32. He flew a F4U Corsair at the start of the Korean War. Arriving near Korea in October 1950, he flew support missions from the . On 4 December 1950 Hudner and Brown were among a group of pilots on patrol near the Chosin Reservoir. Brown's Corsair was shot by Chinese troops and crashed. In an attempt to save Brown from his burning aircraft, Hudner intentionally crash-landed his own aircraft on a snowy mountain in freezing temperatures to help Brown. In spite of these efforts, Brown died of his injuries and Hudner was forced to leave, having also been injured in the landing. Later, Hudner served aboard several U.S. Navy ships and with a number of aviation units, including a short time as Executive Officer of the during the Vietnam War, before retiring in 1973. After retiring, he worked for veterans organizations in the United States. He lived in Concord, Massachusetts. The guided missile destroyer is named for him. Hudner died at his home in Concord, Massachusetts on November 13, 2017 at the age of 93. ==Medal of Honor citation== Hudner was one of 11 men awarded the Medal of Honor during the Battle of Chosin Reservoir. He was the first of seven U.S. Navy servicemen, and the only Naval aviator, to be awarded the Medal of Honor in the Korean War. ==Related pages== * List of Korean War Medal of Honor recipients * List of living Medal of Honor recipients ==References== ==Sources== : * * * * * * * * * * * * Online sources * * * * * * ==Other websites== * * Historic footage of Thomas Hudner receiving Medal of Honor from President Harry Truman. Category:1924 births Category:2017 deaths Category:American aviators Category:American military personnel of the Korean War Category:American military personnel of the Vietnam War Category:Military people from Massachusetts Category:United States Navy Medal of Honor recipients",
 "title": "Thomas J. Hudner Jr."
}