{
 "id": "37885",
 "text": "Sonic the Hedgehog is a Japanese platform video game series and media franchise created by Sega and featuring their mascot, Sonic. It is a series of fast platform games. Sonic is the main character. He is a bright blue hedgehog with supersonic speed. Usually, Sonic must stop the villain, Doctor Eggman's, plans for taking over the world. Sonic is often helped by his friends like Tails, Amy Rose, and Knuckles. The first Sonic the Hedgehog game was released in 1991. It was created by Sega's Sonic Team division after Sega wanted a new mascot character. This was because they wanted to replace Alex Kidd, and they wanted to compete with Nintendo's mascot, Mario. Its success made many sequels, and it helped Sega become one of the biggest video game companies during the 16-bit era of the early 1990s. The first major 3D Sonic game, Sonic Adventure, was released in 1998 for the Dreamcast. The first 3D Game is technically Sonic 3D Blast released on November 5, 1996 on the Game Gear. The series made over by 2014. As of 2018, the series has sold 800million copies. This includes free-to-play mobile game downloads. ==Reception and legacy== ===Sales=== Year Game Platform(s) Sales 1991 Sonic the Hedgehog Mega Drive / Genesis 15 million 1992 Sonic the Hedgehog 2 6 million 1993 Sonic Spinball and Sonic the Hedgehog CD 1 million in US 1994 Sonic the Hedgehog 3 and Sonic & Knuckles 4 million (Sonic 3: 1.02 million in US Sonic & Knuckles: 1.24 million in US) 1995 Knuckles' Chaotix Sega 32X 1998 Sonic Adventure Dreamcast 2.5 million 2001 Sonic Adventure 2 / Battle GameCube 1.7322 million Sonic Advance Game Boy Advance 1.515 million 2003 Sonic Mega Collection GameCube 1.453 million Sonic Heroes PlayStation 2/Xbox/GameCube 3.41 million Sonic Mega Collection Plus PlayStation 2/Xbox 2.19 million 2005 Shadow the Hedgehog PlayStation 2/GameCube/Xbox 2.06 million 2006 Sonic the Hedgehog Mobile 8 million in US & EU Sonic the Hedgehog (2006) Xbox 360, PlayStation 3 870,000 2008 Sonic Unleashed PlayStation 2, Wii, Xbox 360, PlayStation 3 2.45 million 2010 Sonic & Sega All-Stars Racing PlayStation 3, Xbox 360, Wii, Nintendo DS, Microsoft Windows 1.07 million Sonic Colors Wii, Nintendo DS 2.18 million 2011 Sonic & Sega All-Stars Racing iOS 16.7millionThe Sonic franchise sold approximately 80 million units as of June 2011: See Additionally, Mario & Sonic at the London 2012 Olympic Games sold 3.28 million copies, Sonic Generations sold 1.85 million units by March 2012, Sonic & All- Stars Racing Transformed sold 1.36 million units by the end of March 2013, Sonic Lost World sold 710,000 units by March 2014, and Sonic Boom: Rise of Lyric/Sonic Boom: Shattered Crystal sold 620,000 units by March 2015. See ; ; ; and Sonic Generations PlayStation 3, Xbox 360, Microsoft Windows, Nintendo 3DS 1.85 million 2012 Sonic & All-Stars Racing Transformed PlayStation 3, Xbox 360, Wii U, Nintendo 3DS 1.36 million Sonic Jump iOS 8.8million 2013 Sonic Lost World Wii U, Nintendo 3DS 710,000 2014 Sonic Boom: Rise of Lyric and Shattered Crystal 620,000 2016 Sonic Boom: Fire & Ice Nintendo 3DS 2018 Sonic Mania Nintendo Switch, PlayStation 4, Xbox One, Windows 1million 2022 Sonic Frontiers Nintendo Switch, PlayStation 4, PlayStation 5, Windows, Xbox One, Xbox Series X/S Mario & Sonic series 22.78million 2007 Mario & Sonic at the Olympic Games Wii, Nintendo DS 11.31 million 2009 Mario & Sonic at the Olympic Winter Games 6.53 million 2011 Mario & Sonic at the London 2012 Olympic Games Wii, Nintendo 3DS 3.28 million 2013 Mario & Sonic at the Sochi 2014 Olympic Winter Games Wii U 65,377 in Japan 2016 Mario & Sonic at the Rio 2016 Olympic Games Nintendo 3DS, Wii U 430,033 in Japan Series total 123.32 million ==Note== ==References== Category:Fantasy video games Category:Platform games Category:Sonic the Hedgehog games Category:Video game series",
 "title": "Sonic the Hedgehog"
}