{
 "id": "37888",
 "text": "The Silence of the Lambs is a 1991 American crime horror thriller movie. It was directed by Jonathan Demme. It stars Jodie Foster and Anthony Hopkins. It is based on the novel by Thomas Harris. The movie is about psychopathic psychiatrist and cannibal Dr. Hannibal Lecter and FBI agent Clarice Starling. The movie was released in 1991. ==Background== In the movie, Clarice Starling, a young FBI worker, is sent to see the Dr. Lecter in prison to ask his advice on catching a serial killer called Buffalo Bill. Buffalo Bill has been kidnapping women and killing them. When the movie was being made, the FBI helped with the making of the movie. They used the movie to try to have more women join the FBI. ==Awards== Jonathan Demme won an Academy Award for Best Director. Jodie Foster and Anthony Hopkins both won Academy Awards. The movie also won Oscars for Best Adapted Screenplay and Best Picture. It became the third and most recent movie (the other two being 1934's It Happened One Night and 1975's One Flew Over the Cuckoo's Nest) to win Academy Awards in all the major five categories: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. It is also the only horror movie to have won the Oscar for Best Picture. Hopkins' performance as Lecter is one of the shortest lead acting Oscar-winning performances ever. Hopkins is only on screen for seventeen minutes in the movie. ==Related pages== *The Top 100 Crime Novels of All Time ==References== == Other websites == *The Hannibal Lecter Studiolo * *Criterion Collection essay by Amy Taubin Category:1991 crime thriller movies Category:1991 horror movies Category:1990s serial killer movies Category:American crime thriller movies Category:American horror thriller movies Category:American serial killer movies Category:Antisocial personality disorder in fiction Category:BAFTA Award winning movies Category:Best Picture Oscar Category:1990s English-language movies Category:FBI in fiction Category:Golden Globe Award winning movies Category:Hannibal Lecter movies Category:Movies about cannibalism Category:Movies about abduction Category:Movies based on books Category:Movies directed by Jonathan Demme Category:United States National Film Registry movies Category:Movies featuring a Best Actress Academy Award-winning performance",
 "title": "The Silence of the Lambs"
}