{
 "id": "378862",
 "text": "Hailee Steinfeld (born December 11, 1996) is an American actress and singer. She was nominated for an Academy Award for Best Supporting Actress on the 2010 remake movie True Grit. ==Biography== Hailee Steinfeld was born in Tarzana, Los Angeles. Her mother is Cheri (née Domasin), an interior designer. Her father is Peter Steinfeld, a personal fitness trainer.Garza, Oscar (February 25, 2011). \"Hailee Steinfeld’s True Colors\" . L.A. Forward. Retrieved March 5, 2011. Her father is Jewish and her mother is of African American, Filipino, Irish, Scottish and German descent. Her maternal grandfather, Ricardo Domasin is of African American and Filipino descent. Her older brother, Griffin, is a stock car driver. Steinfeld calls him her best friend on some of her Tweets.https://www.facebook.com/haileesteinfeldhttps://twitter.com/#!/HaileeSteinfeld She was raised in Agoura Hills and in Thousand Oaks, California. She attended Ascension Lutheran School, Conejo Elementary, and Colina Middle School. She has been home-schooled since 2008, because of bullying. Hailee Steinfeld started acting when she was ten years old, appearing in various short films, like the role of Talia Alden in \"She's a Fox.\" She also had several appearances in TV shows and commercials. At the age of thirteen, she was chosen to play Mattie Ross in the Coen brothers' western movie \"True Grit,\" which was released in December 2010. Her performance was praised by critics, with Richard Corliss from Time magazine calling it one of the top 10 film performances of 2010. He noted that Steinfeld delivered her lines naturally, portrayed the character convincingly, and won the hearts of the audience. Roger Ebert, the Los Angeles Times, and Rolling Stone also gave positive reviews of her performance. This role earned Hailee Steinfeld an Oscar nomination for Best Supporting Actress in 2011. Just five months after \"True Grit\" was released, she was chosen as the new face of the Italian designer brand Miu Miu. ==Filmography== Key Denotes productions that have not yet been released ===Movie=== Year Title Role Notes 2008 Heather: A Fairytale Heather Short movie 2009 She's a Fox Talia Alden 2010 Without Wings Allison Grand Cru Sophie True Grit Mattie Ross 2013 Hateship, Loveship Sabitha Begin Again Violet Mulligan The Magic Bracelet Angela Short movie Romeo & Juliet Juliet Capulet Ender's Game Petra Arkanian 2014 3 Days to Kill Zooey Renner The Homesman Tabitha Hutchinson The Keeping Room Louise When Marnie Was There Anna Sasaki Voice; English dub 2015 Ten Thousand Saints Eliza Urbanski Pitch Perfect 2 Emily Junk Taylor Swift: The 1989 World Tour Live Herself Concert movie Barely Lethal Megan Walsh 2016 Term Life Cate Barrow The Edge of Seventeen Nadine Franklin 2017 Pitch Perfect 3 Emily Junk 2018 Bumblebee Charlie Watson Spider-Man: Into the Spider-Verse Gwen Stacy / Spider-Woman Voice 2019 Between Two Ferns: The Movie Herself Charlie's Angels Angel Recruit Cameo 2023 Spider-Man: Across the Spider-Verse Gwen Stacy / Spider- Woman Voice The Marvels Kate Bishop / Hawkeye Cameo 2025 Sinners Mary 2027 Spider-Man: Beyond the Spider-Verse Gwen Stacy / Spider-Woman Voice; in production ===Television=== Year Title Role Notes 2007 Back to You Little Girl Episode: \"Gracie's Bully\" 2009 BrainSurge Herself Season 1, Episode 24 2010 Summer Camp Shayna Matson Television movie Sons of Tucson Bethany Springs Episode: \"Chicken Pox\" 2015–2018 The Voice Herself / Advisor Guest (seasons 8, 15); advisor (season 14) 2018 2018 MTV Europe Music Awards Host / Performer Television special 2019–2021 Dickinson Emily Dickinson Main role, 30 episodes; also executive producer 2020 Sesame Street Herself Guest (season 51) 2021–2024 Arcane Vi (Violet) Voice, main role; 16 episodes 2021 Hawkeye Kate Bishop / Hawkeye Main role, miniseries; 6 episodes 2022 Marvel Studios: Assembled Herself Episode: \"The Making of Hawkeye \" 2024 What If...? Kate Bishop / Hawkeye Voice; Episode: \"What If... 1872?\" 2025 Marvel Zombies Kate Bishop / Hawkeye Voice; miniseries ===Music videos=== Year Title Artist Role 2015 Bad Blood Taylor Swift The Trinity ==Awards and nominations== Award Year Category Work Result Ref. Academy Awards Best Supporting Actress True Grit Alliance of Women Film Journalists Best Actress in Supporting Role True Grit Best Breakthrough Performance True Grit Austin Film Critics Association Best Supporting Actress True Grit Awards Circuit Community Best Actress in a Supporting Role True Grit British Academy Film Awards Best Actress in a Leading Role True Grit Central Ohio Film Critics Association Best Supporting Actress True Grit Breakthrough Film Artist (acting) True Grit Best Actress The Edge of Seventeen Chicago Film Critics Association Best Supporting Actress True Grit Most Promising Performer True Grit Critics' Choice Movie Awards Best Supporting Actress True Grit Best Young Actor/Actress True Grit The Edge of Seventeen Best Actress in a Comedy Dallas–Fort Worth Film Critics Association Best Supporting Actress True Grit Dublin Film Critics' Circle Best Actress True Grit Breakthrough Artist - International True Grit Golden Globe Awards Best Actress in a Comedy/Musical The Edge of Seventeen Houston Film Critics Society Best Actress in a Supporting Role True Grit Indiana Film Journalists Association Best Supporting Actress True Grit Best Actress The Edge of Seventeen Iowa Film Critics Association Best Supporting Actress True Grit Kansas City Film Critics Circle True Grit Las Vegas Film Critics Society Best Supporting Actress True Grit Youth in Film True Grit The Edge of Seventeen London Film Critics Circle Actress of the Year True Grit Online Film Critics Society Best Supporting Actress True Grit Online Film and Television Association Best Actress True Grit Best Youth Performance True Grit Best Breakout Performance: Female True Grit Phoenix Film Critics Society Best Actress in a Supporting Role True Grit Best Female Youth Performance True Grit Breakout Performance - On Screen True Grit Screen Actors Guild Awards Best Supporting Female Actor True Grit Southeastern Film Critics Association Best Supporting Actress True Grit St. Louis Gateway Film Critics Association Best Supporting Actress True Grit Toronto Film Critics Association Best Supporting Actress True Grit Utah Film Critics Association Best Actress in a Leading Role True Grit Vancouver Film Critics Circle Best Supporting Actress True Grit Washington D.C. Area Film Critics Association Best Supporting Actress True Grit Best Youth Performance The Edge of Seventeen Women Film Critics Circle Best Young Actress ==References== Category:1996 births Category:Living people Category:Actors from Los Angeles Category:African-American actors Category:Jewish American actors",
 "title": "Hailee Steinfeld"
}