{
 "id": "378953",
 "text": "{{Infobox writer | name = Richard Blanco | image = Richard Blanco MJN.jpg | image_size = | alt = | caption = | birth_name = Ricardo Blanco | birth_date = | birth_place = Madrid, Spain | death_date = | death_place = | occupation = | citizenship = American | alma_mater = Florida International University | notableworks = \"One Today\" The Prince of Los Cocuyos: A Miami Childhood How to Love a Country For All of Us, One Today: An Inaugural Poet's Journey Until We Could Film Looking for the Gulf Motel Directions to the Beach of the Dead City of a Hundred Fires Nowhere but Here Boston Strong: The Poem }} Richard Blanco (born February 15, 1968) is an American poet, public speaker, author, playwright, and civil engineer. He is the fifth poet to read at a United States presidential inauguration, having read the poem \"One Today\" for Barack Obama's second inauguration. He is the first immigrant, the first Latino, the first openly gay person and at the time the youngest person to be the U.S. inaugural poet. In 2023, Blanco was awarded the National Humanities Medal by President Joe Biden from the National Endowment for the Humanities. ==Life== He was born in Madrid, Spain on February 15, 1968. His family had just left Cuba. Then the family went to New York. After that, they moved to Miami, Florida. He grew up there. Blanco graduated from Florida International University in Civil Engineering in 1991. Then he got a Masters in Fine Arts in Creative Writing in 1997. After 1999, he traveled and lived in Guatemala and Brazil. He taught at Georgetown University, American University, and Central Connecticut State University. Later, he returned to Miami and lived there. Now he lives in Maine. In January 2013 he read his poem \"One Today\" at the second inauguration (swearing-in ceremony) of America's President Barack Obama. His work has appeared in some magazines. These include The Nation, Ploughshares, Indiana Review, Michigan Quarterly Review, TriQuarterly Review, New England Review, and Americas Review. ==Awards== * 1997 Agnes Lynch Starrett Prize for City of a Hundred Fires * Florida Artist Fellowship * 2006 PEN Open Book Award (formerly known as Beyond Margins Award) for Directions to the Beach of the Dead * 1988 Agnes Lynch Starrett Poetry Prize * John Ciardi Fellowship from the Bread Loaf Writers Conference * Residency Fellowship from the Virginia Center for the Creative Arts ==Works== * * \"Somewhere to Paris\", Poetry Foundation * * *How to Love a Country. Beacon Press. 2019. ISBN 978-080702591-8 * ===Anthologies=== * * * == Related pages == *List of poets from North America ==References== ==Other websites== * \"Richard Blanco\", TRES Review, Jack Anders Summer 2004 * Biography * Readings by the poet Category:American poets Category:Living people Category:1968 births",
 "title": "Richard Blanco"
}