{
 "id": "379136",
 "text": "James McGill Buchanan, Jr. (October 3, 1919 - January 9, 2013) was an American economist and educator. He is known for his public choice theory. His theories helped scientists figure out political science. Buchanan won the Nobel Prize in Economics in 1968 for his theory. ==Early life== Buchanan was born on October 3, 1919 in Murfreesboro, Tennessee. His ancestry includes Scottish and Irish. He was raised in Chicago, Illinois and in Murfreesboro, Tennessee. Buchanan studied at University of Chicago, at the University of Tennessee, and at the State Teachers College, Murfreesboro. ==Ideas== Buchanan is the founder of a new Virginia school of political economy. Buchanan is largely responsible for the rebirth of political economy in the second half of 20th century.Boettke, P.J. (1998). James M. Buchanan and the rebirth of political economy, in (S. Pressman and R. Holt, eds.), Against the Grain: Dissent in Economics, pp. 21–39, Aldershot, UK: Edward Elgar Publishing, 1998 The term \"constitutional economics\" was used by James M. Buchanan as a name for a new academic sub-discipline. Buchanan’s work in 1986 brought him the Nobel Prize in Economic Sciences for his \"development of the contractual and constitutional bases for the theory of economic and political decision- making.\" Buchanan rejects \"any organic conception of the state\" as superior in wisdom, to the citizens of this state.\" This philosophical position forms the basis of constitutional economics. Buchanan believes that every constitution is created for at least several generations of citizens. It must be able to balance interests of the state, society, and each individual.Buchanan, J., Logical Foundations of Constitutional Liberty, Vol. 1, Indianapolis, 1999, p. 372. In 2001 Buchanan received an honorary doctoral degree from Universidad Francisco Marroquín, in Guatemala City, Guatemala, for his contribution to economics. The New York Times commented that the Nobel Prize-winning economist who championed public choice theory influenced a \"generation of conservative thinking about deficits, taxes, and the size of government\". ==Personal life and death== He was married to Ann Bakke from 1945 until his death in 2013. They had no children. Buchanan died on January 9, 2013, in Blacksburg, Virginia. He was 93 and he died from natural causes. ==References== ==Related pages== *Constitutional economics *Economics *Political economy *Nobel Prize in Economics ==Other websites== *Biography at GMU *YouTube Reflections on the Life and Work of James Buchanan *Biography of James M. Buchanan at the Concise Encyclopedia of Economics *'The Hobbes Problem: From Machiavelli to Buchanan' by Deirdre McCloskey. Category:1919 births Category:2013 deaths Category:American economists Category:Educators from Chicago Category:Nobel Prize in Economics winners Category:Academics from Virginia Category:People from Blacksburg, Virginia Category:People from Murfreesboro, Tennessee",
 "title": "James M. Buchanan"
}