{
 "id": "379267",
 "text": "Windows 3.0 is the third major release of Microsoft Windows, and was released on May 20, 1990. It is a graphical environment (a program that runs on top of an operating system), instead of an operating system by itself. It became the first successful version of Windows in the market. Windows 3.0 was the first version to be widely seen as a rival to Apple's Macintosh and Commodore's Amiga on the graphical user interface (GUI) front. It was followed by Windows 3.1. Windows 3.0 was created in 1989, when David Weise and Murray Sargent independently decided to develop a protected mode Windows as an experiment. They compiled a prototype and showed it to Microsoft executives, who approved it as an official project. == Updates == === Windows 3.0a === On December 31, 1990, Microsoft released Windows 3.0a. This version contained an improved ability to move pieces of data greater than 64KB (the original release could only manipulate one segment of RAM at a time). It also improved stability by reducing Unrecoverable Application Errors (UAEs) associated with networking, printing, and low-memory conditions. This version appears as \"Windows 3.00a\" in Help/About Windows system dialogs. === Windows 3.0 with Multimedia Extensions === Based on Windows 3.0a, and originally called 3.0b, Windows 3.0 with Multimedia Extensions 1.0 was released in October 31, 1991 to support sound cards, as well as CD-ROM drives, which were then becoming more available. This edition was released to Original Equipment Manufacturers (OEMs), mainly CD-ROM drive and sound card manufacturers, and some PCs came preloaded with it. This edition added basic multimedia support for audio input and output, along with new applications: Media Player, CD audio player, more advanced Help format, screen savers, and a new clock. These new features were integrated into Windows 3.1x. Microsoft developed the Windows Sound System sound card specification to support these extensions. The new features were not accessible in Windows 3.0 Real Mode. The MME API was the first universal and standardized Windows audio API. Wave sound events played in Windows (up to Windows XP) and MIDI I/O use MME. The devices listed in the Multimedia/Sounds and Audio control panel applet represent the MME API of the sound card driver. MME does not have channel mixing, so only one audio stream can be rendered at a time. MME supports sharing the audio device for playback between multiple applications starting with Windows 2000, up to two channels of recording, 16-bit audio bit depth and sampling rates of up to 44.1 kHz with all the audio being mixed and sampled to 44.1 kHz. == References == Category:Microsoft operating systems",
 "title": "Windows 3.0"
}