{
 "id": "379381",
 "text": "The Riddler (Edward Nigma, later Edward Nygma or Edward Nashton) is a fictional Batman character and supervillain who appears in American comic books published by DC Comics. He leaves Batman all of his best riddles and puzzles to help Batman know where he will strike next or what he will do. He wears a green suit with a big purple question mark on it and also a cane with a question mark on it. He sometimes wear a hat also with a question mark. == Early comic book history == Riddler first appeared in \"Detective Comics\" #140 in October 1948 which ended with him appearing to drown. The Riddler’s second appearance was in “Detective Comics” # 142 in December 1948 in which he wanted revenge against Batman and Batman’s sidekick Robin. Then in May 1965, Julius Schwartz published a comic book called “Batman” Volume 1 # 171, the third ever appearance of The Riddler in which his evil plan involves tricking Batman and Robin into thinking he had stopped being evil and become good. The Riddler became used as an antagonist in the Batman comic books much more often are the 1966 Batman television show starring Adam West came out and had The Riddler as a major villain. == In other media == The Riddler has been used in a lot of things based on the comics, including TV shows, movies, toys and video games. He was played by Frank Gorshin and John Astin in the 1960s Batman show and by John Glover in Batman: The Animated Series. He was also voiced by Robert Englund in The Batman. He was played by Jim Carrey in Batman Forever. Conan O'Brien voices him in the 2017 movie The Lego Batman Movie. Corey Michael Smith played The Riddler in the prequel television show Gotham giving him an origin story. Paul Dano plays the character for the 2022 movie The Batman. ==Notes== ==Other websites== * * Edward Nygma's Puzzle Web Site : puzzles, games and stories featuring the animated series Riddler. Category:Batman characters Category:DC Comics supervillains Category:Fictional characters introduced in the 1940s Category:Fictional mass murderers",
 "title": "Riddler"
}