{
 "id": "379328",
 "text": "Liliane Gloria \"Leelee\" Sobieski (born on June 10, 1983 near New York City) is an American actress who has acted in many movies and on television. Her notable motion pictures include Deep Impact (1998) and Public Enemies; she also acted in the 1999 TV movie Joan of Arc. Sobieski was born in 1983, although some sources represent 1982 as her birth date. == Acting career == Sobieski was first noticed by a talent scout in the cafeteria of a New York City private school. That encounter led to her audition for the role of Claudia in Interview with the Vampire (1994), a role which ultimately went to Kirsten Dunst. Sobieski portrayed the character of Anna Yates in the 1994 TV movie Reunion starring Marlo Thomas. Next, she played a lead role in A Horse for Danny, a 1995 made-for-television film. In 1997, she snagged her first role in a studio film playing the daughter of Martin Short's character in the Tim Allen comedy Jungle 2 Jungle. In 1999, Sobieski appeared in Stanley Kubrick's Eyes Wide Shut. Recalling acting alongside Tom Cruise, Sobieski stated he was \"very kind and considerate with me,\" and says her most vivid recollection of Stanley Kubrick was that he \"genuinely seemed to hold something magic\". ==Filmography== Year Title Role Notes 1995 Danny Bara 1997 Jungle 2 Jungle Karen 1998 Deep Impact Sarah Hotchner 1998 Charlotte Anne \"Channe\" Willis Nominated—Chicago Film Critics Association Award for Most Promising Newcomer Nominated—Young Artist Award for Best Leading Young Actress – Feature Film 1999 Never Been Kissed Aldys Martin 1999 Eyes Wide Shut Milich's daughter 2000 Here on Earth Samantha \"Sam\" Cavanaugh Nominated—Teen Choice Award for Choice Breakout Performance 2001 My First Mister Jennifer 2001 Joy Ride Venna Wilcox 2001 Ruby Baker 2002 Sarah Silver 2002 Max Liselore von Peltz 2006 Lying Sarah 2006 Heavens Fall Victoria Price 2006 In a Dark Place Anna Veigh 2006 Sister Honey 2006 Lolita 2007 Walk All Over Me Alberta 2007 In the Name of the King: A Dungeon Siege Tale Muriella Nominated—Golden Raspberry Award for Worst Supporting Actress 2007 88 Minutes Lauren Douglas 2009 Finding Bliss Jody Balaban 2009 Night Train Chloe 2009 Public Enemies Polly Hamilton 2010 Acts of Violence Olivia Flyn 2012 Branded Abby Gibbons 2016 Stalker filmed in 2010 Category:1983 births Category:Living people Category:American movie actors Category:Actors from New York City",
 "title": "Leelee Sobieski"
}