{
 "id": "379386",
 "text": "Carmine \"The Roman\" Falcone is a fictional Batman character who is the head of the Gotham Mafia. He appears in American comic books published by DC Comics. He is sometimes called Don Falcone. He has a son, Alberto Falcone who is known as the Holiday Killer. He also has a daughter Sofia Falcone who helps him. In some cases, Two-Face flipped his coin and killed Falcone. His body was robbed many times before being frozen by Mr. Freeze. His business was taken over by Sal Maroni. ==Background== Carmine Falcone first appeared in the four-part story Batman: Year One written by Frank Miller and David Mazzucchelli in 1987. In the comics, Falcone is a powerful Mafia boss nicknamed \"The Roman\". He was the leader of Gotham City's organized crime. The character is based on Marlon Brando's role as Don Vito Corleone from the 1972 movie The Godfather. The Falcone family was inspired by that of the Corleone family. In The Long Halloween, gangster Vincent Falcone brings his badly wounded son, Carmine, to Thomas Wayne. He begs Wayne, one of the city's best doctors, to perform surgery at Wayne Manor. A young Bruce Wayne watches his father save Falcone's life. Years later at Thomas and Martha Wayne's funeral, Carmine Falcone, now part of his father's crime family, tells Bruce that he can always ask a favor of him should he need it. In the comics he has two children, Sofia and Alberto who either work for him or are serial killers. In some comics, Falcone is the biological father of Selina Kyle. == In other media == He has appeared in movies, television series, and video games. He was played by Tom Wilkinson in the 2005 Christopher Nolan movie Batman Begins. Falcone was played by John Turturro in the 2022 Matt Reeves movie The Batman. Turturro did not return as Falcone in The Batman spin-off miniseries The Penguin because he did not like violence towards women shown in the show. He was replaced by Mark Strong. ==References== Category:Batman characters Category:DC Comics characters",
 "title": "Carmine Falcone"
}