{
 "id": "379469",
 "text": "Donald McKinley Glover Jr. (born September 25, 1983) is an American actor, rapper, singer, songwriter, comedian, musician and record producer. He is best known for portraying the character Troy Barnes on the comedy television series Community. He was originally a writer for the comedy series 30 Rock. Aside from acting, Glover is also a rapper where he performs under the stage name Childish Gambino. He said that he got his stage name from the Wu-Tang Clan name generator. == Career == From 2006 to 2009 Glover wrote for 30 Rock. In 2008 he and his co-writers were presented with the Writers Guild of America Award for Best Comedy Series for his work on the third season. In June 2008, he released the independent mixtape Sick Boi. In September 2009, he released his second mixtape Poindexter. In July 2010, Glover received the Rising Comedy Star award at the Just for Laughs festival and was featured in Gap's 2010 holiday advertising campaign. He released a couple albums and mixtapes by himself before he released his first album Camp for Glassnote Records on November 15, 2011. In 2015 he played a scientist who brings dead people back to life with disastrous consequences in The Lazarus Effect. In May 2018, he released a single titled \"This Is America\" while performing as both host and musical guest on Saturday Night Live. The song debuted at number one, becoming both Glover's first number one and top ten single in the United States. In 2019, he starred as Simba in the live action remake of The Lion King. On March 15, 2020, Glover streamed his surprise fourth album on his website Donald Glover Presents. === Television === Television Year Title Role Notes 2005 Late Night with Conan O'Brien Criminal 1 episode 2006–2008, 2012 30 Rock Homosexual Kid Producer Young P.A. Young Tracy Jordan Writer Cameo (3 episodes) Guest star (1 episode) 2007 Bronx World Travelers Scoopy Brown Short film Human Giant College Webcam Guy 1 episode 2009–present Troy and Abed in the Morning! Troy Barnes 2009–present Community Troy Barnes 2010 Comedy Central Presents Himself Stand-up special 2011 Woodie Awards Host Regular Show Alpha- Dawg 1 episode Weirdo Himself Stand-up special 2012 Hip Hop Squares Childish Gambino 1 episode 2013 Girls Sandy Adventure Time Marshall Lee Guest voice == Personal life == Glover began dating Michelle White and they had three sons Legend Glover, Drake Glover and Donald Glover III. ==Discography== * Sick Boi (2008) * Poindexter (2009) * Culdesac (2010) * Camp (2011) * Because the Internet (2013) * STN MTN / Kauai (2014) ==References== == Other websites == * Official website * Category:Actors from Georgia (U.S. state) Category:Actors from Los Angeles Category:African-American comedians Category:American movie actors Category:American movie producers Category:Rappers from California Category:American stand-up comedians Category:American television actors Category:1983 births Category:Living people Category:Comedians from Los Angeles",
 "title": "Donald Glover"
}