{
 "id": "379493",
 "text": "Jirōemon Kimura (木村 次郎右衛門, Kimura Jirōemon; 19 April 1897 – 12 June 2013)Jiroemon Kimura, Oldest Man in Recorded History, Dies at Age 116 at Bloomberg.com was a Japanese supercentenarian recognized by the Guinness World Records as the oldest man in history. == Biography == Kinjirō Miyake (三宅 金治郎, Miyake Kinjirō) was born on 19 April 1897 in the fishing village of Kamiukawa (present Kyōtango), as the third of six living children to farmers Morizo and Fusa Miyake. Except for his oldest sister, who died 6 weeks before the age of 5 years in 1892, and his oldest brother, who died just 31 months old in 1894, longevity was common in his family; in late-1980s his second-oldest sister died at age 96, his second-oldest brother at age 91 and his second-youngest brother at age 85, in 1993 his younger sister died at age 93, and his youngest brother as well as last living sibling Tetsuo died in 2007 98 years old. After he finished school at the age of 14, he worked for local post offices for over 45 years until he retired in 1962 at the age of 65, and thereafter worked until age 90 as a farmer along with his eldest son, who died at age 76 in September 1998, less than 4 weeks after his youngest son, who died at age 54. In the 1920s, he also worked as a government communications worker in Korea, which was at the time a colony of Japan. After returning from Korea, Miyake married his 6 years, 9 months younger neighbour Yae Kimura, who died at age 75 in 1979, and changed his name to Jirōemon Kimura upon the marriage (since his wife's family lacked a male heir) and had, except their second child, a son who died in 1927 just 20 days before the age of 2 years, 7 children (of whom 5 were still living at the time of his death). He lived in Kyōtango, Kyoto Prefecture, Japan with his eldest son's widow and grandson's widow. == Longevity == Kimura, who became the oldest living Japanese man after Tomoji Tanabe's death on 19 June 2009, two months after celebrating his 112th birthday and being the 7th Japanese man to do so, became the oldest living man in the world as well as the oldest man to receive the title as the oldest living man after American man Walter Breuning's death on 15 April 2011, just four days before celebrating his 114th birthday and becoming the second Japanese man and the 7th man in the world to do so. Later that year, on 26 October, Kimura became the oldest Japanese man ever and the 5th oldest ever in the world after breaking the record of Yukichi Chuganji. On 2 December 2011, upon the death of 115-year-old Chiyono Hasegawa, Kimura became the oldest living person in Japan and the third oldest living person in the world behind American woman Besse Cooper and Dina Manfredini, both of whom died in December 2012, whereafter Kimura also became the oldest living person in the world, and also the oldest man ever after breaking Danish-born American man Christian Mortensen's record, and later on 19 April 2013, his 116th birthday, the first and only verified man as well as only the 8th verified person to become at least 116 years old. After 113-year-old James Sisnett's death on 23 May, Kimura became the last living man in the world born in the 19th century, after already being the last living Japanese man since 111-year-old Tanekichi Onishi from Hokkaido, who was just a week older than Sisnett, died on 11 September 2011, and even the last living person born in 1897 since Japanese woman Koto Okubo, who was the oldest living woman, died at age 115 years, 19 days on 12 January 2013. According to Kimura himself, the sun above him was the secret to his long life, but also that he trained eating until he was only 80 % full, drank alcohol only in moderation and never smoked. == Death == From 11 May 2013, Kimura was hospitalized for pneumonia and later blood-sugar problems and recovered temporarily, but his health continued to decline as his blood-sugar level, urine production and response declined, though until 2.08am the night of 12 June when Kimura died of natural causes aged 116 years, 54 days.World's oldest ever man dies aged 116 CNews.com He was succeeded as the oldest living person by Japanese woman Misao Okawa, who already was the oldest living woman since Koto Okubo's death, and as the oldest living man by Spanish-born American man Salustiano Sanchez, who was over 4 years younger. Kimura was survived by his two daughters and three sons, 13 of 14 grandchildren, 25 great-grandchildren and 15 great-great-grandchildren. == References == == Related pages == * Shigechiyo Izumi * Kane Tanaka, the oldest Japanese person ever Category:1897 births Category:2013 deaths Category:Japanese supercentenarians Category:World record holders Category:People from Kyoto Prefecture",
 "title": "Jiroemon Kimura"
}