{
 "id": "379518",
 "text": "Barbara Gordon is a fictional superheroine appearing in American comic books published by DC Comics. Barbara Gordon was created by Julius Schwartz, Gardner Fox and Carmine Infantino after a concept by William Dozier, first appearing in Detective Comics #359 (1967). John Ostrander reinvented her as Oracle in Suicide Squad #23 (1989), although this new identity wouldn't be fully revealed until Suicide Squad #38 (1990). == Fictional character biography == She is a vigilante super-hero operating as a member of the Batman Family, and (depending on which continuity) the daughter or niece of Gotham City's Police commissioner James Gordon. Beginning her career as Batgirl working alongside Batman and the first Robin, she is an extremely intelligent detective and martial artist who maintains a civilian identity as a librarian. Following the events of The Killing Joke where the Joker paralyzed her from the waist down with a gunshot, she began using the name Oracle to help Batman and other heroes using a massive world-wide communications and espionage network. There are several others who take up her mantle as Batgirl during this time, including Cassandra Cain and Stephanie Brown whom she mentors, but she is eventually able to walk again and returns to her position. She is a founding member of the Birds of Prey, but has also been involved with the Justice League, the Suicide Squad and the Seven Soldiers of Victory. == In other media == As both Batgirl and Oracle, Barbara Gordon has been featured in various adaptations related to the Batman franchise, including television, film, animation, video games, and other merchandise. Aside from Craig, the character has been portrayed by Dina Meyer, Alicia Silverstone (as Barbara Wilson), and Jeté Laurence, and has been voiced by Melissa Gilbert, Tara Strong, Danielle Judovits, Alyson Stoner, Mae Whitman, Kimberly Brooks and Briana Cuoco among others. Barbara Gordon appeared in the third season of the HBO Max series Titans as the new commissioner of Gotham City portrayed by Savannah Welch. The character was slated for a solo film set in the DCEU, starring Leslie Grace in the title role and intended to be released on Max but was canceled in August 2022. In 2011, Barbara Gordon ranked 17th in IGN's \"Top 100 Comic Book Heroes\". Category:DC Comics superheroes",
 "title": "Barbara Gordon"
}