{
 "id": "379522",
 "text": "Richard John \"Dick\" Grayson Wayne is a comic book superhero created by Bob Kane and Bill Finger for DC Comics. As a supporting character to Batman, Dick was first introduced as Batman's crime-fighting partner Robin. As he transitioned into adulthood, Dick decided to take on the persona of Nightwing. Grayson has served as a leader for various teams, including the Teen Titans and the Outsiders. His leadership is marked by his ability to inspire and strategize effectively. == Fictional character biography == When his circus acrobat family was brutally murdered, Dick Grayson was taken in by billionaire and bat-friendly super hero Bruce Wayne. Bruce shared his secret life as Batman with the young boy and eventually molded him into Robin—the Dark Knight's partner in Gotham. == Abilities == Richard Grayson was a acrobatic prodigy who was part of the \"Flying Graysons\" act, who were well known for conducting acrobatic acts without a net. As a result of his skill, he garnered success for Haly's Circus. As a result of his status as an agent of Spyral and being taught by Helena Bertinelli, Richard is proficient in the art of Espionage. Dick is an expert marksman and is highly skilled in the use of firearms. Being trained by the Dark Knight himself in various fields, Richard Grayson is shown to have a naturally high level of intelligence, though not as high as Batman's own. Richard Grayson was taught in various fields by Batman and as a result, is a capable tactician. In addition to that, he is skilled in reading the body motions of others, using this skill to aid in defeating multiple armed opponents and anticipate an opponent's next move. Taught by Alfred Pennyworth in acting, Richard Grayson is proficient in the art of disguise. He was able to pose as Joker in Arkham Asylum and occasionally poses as Batman whenever Bruce Wayne and Batman needed to be sighted at the same time. Like Batman, Grayson has honed his detective skills. He is adept at solving crimes and analyzing situations quickly. == In other media == Dick Grayson has appeared as Robin in several other media adaptations: the 1943 serial played by Douglas Croft, the 1949 serial played by Johnny Duncan, the 1966–1968 live action Batman television series and its motion picture portrayed by Burt Ward, and played by Chris O'Donnell in the 1995 movie Batman Forever and its 1997 sequel, Batman & Robin. Dick Grayson appeared in the Titans television series for the DC Universe streaming service and HBO Max played by Brenton Thwaites. Loren Lester voiced the character Robin in Batman: The Animated Series and later as Nightwing's first screen adaptation in The New Batman Adventures, Jesse McCartney voices Grayson as both Robin and Nightwing in Young Justice: The Animated Series, Sean Maher voices Nightwing in the DC Animated Movie Universe, and Michael Cera voices an overly cheerful Grayson as Robin in The Lego Batman Movie. In May 2011, IGN ranked Dick Grayson No. 11 on their list of the \"Top 100 Super Heroes of All Time\". In 2013, ComicsAlliance ranked Grayson as Nightwing as No. 1 on its list of the \"50 Sexiest Male Characters in Comics\". Category:Batman characters Category:Fictional characters introduced in 1940 Category:Animated characters Category:Fictional orphans Category:Justice League Category:Superhero movie characters",
 "title": "Dick Grayson"
}