{
 "id": "37960",
 "text": "Emily Dickinson (December 10, 1830 - May 15, 1886) was an American poet. She is known as \"one of America’s greatest and most original poets of all time.\" She is famous for writing almost 1,800 poems. Only a few of them were printed while she was living. Because she wrote in a different way, other people changed parts of her poems before the world could read them. She was born in Amherst, Massachusetts, lived her whole life there, and died there after a long illness. People describe her poems as lyrical and original. She grew a garden of herbs and wild flowers for their healing abilities and often talked about them in her poems. Emily Dickinson's poetry has had a big effect on the poetry of other writers. Her complete poems were printed only after she died. The first people to print those poems often changed them to fit the poetry style of that time. The first printing of her complete poems in the way she wrote them was in 1955 in The Poems of Emily Dickinson, edited by Thomas Johnson. That work contained 1,775 poems. Another collection by R. W. Franklin in 1998 contained 1,789 poems. Her poems are now very easy to find in libraries and bookstores. == Early to Middle life == Her teachers saw her writing talent. She did well in Latin and science. But she did not win any writing awards during her lifetime. Some readers didn't like her work because of her unusual use of words, punctuation, and poetic form. In her late twenties, she chose to stay with her family most of the time. Her father, Edward Dickinson, was a lawyer, a member of the Whig Party, a Massachusetts state lawmaker (1838-39, 1842-43), and a United States Representative from 1853 to 1855. Emily's parents loved their children but often did not show their emotions. Her family had a good amount of money and had many friends. She had a brother named Austin and a sister named Lavinia. She had a normal life when she was a child. When she became an adult, she spent more and more time alone to do her thinking and writing. Later on, she became known for often—but not always—wearing white clothing. She wrote most of her poems (over 1,100 of them) between 1855 and 1865. During this time she would copy many of these poems onto good paper and sew them together in little booklets, called fascicles. She didn't show these to anyone. Emily Dickinson never married. She had strong connections with several men as friends, confidants, and mentors. She also enjoyed a close connection with her friend and sister-in-law, Susan Gilbert Dickinson. == Later life == Over most of her writing life, the idea of death was very strong in Dickinson's poetry. She thought about it a lot. When she was a young adult, the disease of tuberculosis was very common in Amherst and very deadly. In the last five years before her own death, many of her close friends died. The death of her young nephew Gib happened just before she herself fell very ill, but not with tuberculosis. She was sick with some health problems, both physical and mental. Maybe she had depression and anxiety disorders. When she was almost 35, she began to suffer from pain in her eyes and sensitivity to light. She went to Boston for a doctor's help with that. In Boston she stayed with her cousins, but she never went far away again after she returned to Amherst. Dickinson was sick for about two and a half years before she died. She did not leave her bed for seven months before she died at the age of 56. She seems to have died from a stroke. But the exact causes of her long illness are not clear. She was buried in West Cemetery, in Amherst, Massachusetts. ==Dickinson in popular culture== In 1976, The Belle of Amherst, a one-woman play based on Dickinson's life, played on Broadway. Julie Harris played the part not only of Emily but of all other characters, as well. In 2016 English director Terence Davies wrote and directed A Quiet Passion. Cynthia Nixon played Dickinson in this biographical movie. From 2019 to 2021 Hailee Steinfeld played the part of Emily Dickinson in the three seasons of the television comedy Dickinson. == Related pages == *List of poets from the United States == References == Category:1830 births Category:1886 deaths Category:19th-century American poets Category:Deaths from nephritis Category:Disease-related deaths in the United States Category:Writers from Massachusetts Category:19th-century American novelists",
 "title": "Emily Dickinson"
}