{
 "id": "379662",
 "text": "Les Colocs (The Roommates) were a Canadian rock band. It was formed in Montreal, Quebec in 1990. \"Les Colocs\" had played different kinds of music and live performances. == History == ===1990 to 1992=== In October 1990, André \"Dédé\" Fortin and Louis Léger were in the band “Cha Cha and the Chain Gang”. They left that band and began \"Les Colocs\" in Montreal. They gave their first show at the Tallulah Darling for the International Festival of Rock. One of the band's members, Marc Déry, left Les Colocs to create his own band, the Zébulon. Les Colocs put an advertisement in the newspaper looking for a new band member, and Serge Robert answered the ad. He became the band's bass player. After a few shows, Les Colocs' guitarist, Louis Léger, left. Mike Sawatzky took his place. The name \"Les Colocs\" was made official in 1992 at the “Festival international d'été de Québec\". Les Colocs was the opening act, with André Fortin, Mike Sawatsky, Jimmy Bourgoing, Patrick Esposito di Napoli, and Serge Robert performing. In 1992, the band signed their first contract with the record label BMG Music Canada. ===1993 to 1995=== In 1993, the band's first album, Les Colocs, was released. It sold over 150,000 copies. In October 1993, Les Colocs won four Félix awards. Two of these awards were for being group of the year and revelation (new surprise) of the year. In 1994, the band's harmonica player, Patrick Esposito di Napoli, died of AIDS. In 1995, Les Colocs made their second album. Dédé Fortin decided on a special release date because he is a strong separatist- he believes that Quebec should be separate and independent from Canada. He decided to release the second album on October 30th, 1995, which was the date of the second referendum on Quebec sovereignty. Some time later, Dédé decided to fire Serge Robert from the band. A year later, Les Colocs hired André Vanderbiest. ===1996 to 2000=== In May 1998, Les Colocs made the third and last album that would come out during Dédé Fortin's life. It was called Dehors Novembre. The album is dedicated to Patrick Esposito Di Napoli, who had died 4 years before. In this album, like the others, the lyrics are dark, and some people say that they show the singer's feelings of culpability and despair. The album sold over 100,000 copies throughout Quebec. In November 1998, Les Colocs won the Félix award for rock album of the year. On May 8, 2000, André “Dédé” Fortin killed himself. This ended the group. == Members == * André Fortin (founder and member between 1990 and 2000): author-composer, singer, rhythmic guitarist, drummer, percussionist, tap dancer. * Serge Robert (member between 1990 and 1995): occasional singer, bassist, double bassist. * Patrick Esposito Di Napoli (member between 1990 and 1994): occasional singer, harmonica player. * Jimmy Bourgoing (member between 1990 and 1998): occasional singer, drummer, percussionist. * Mike Sawatzky (member between 1991 and 2000): author-composer and occasional singer, solo guitarist, harmonica player, saxophonist. * André Vanderbiest (member between 1996 and 2000): author-composer and occasional singer, bassist, double bassist. == Additional musicians == * Louis Léger (between 1990 and 1991): guitarist * Mara Tremblay (in concert): violinist * Joel Zifkin (1993): violinist * Guy Bélanger (1995): harmonica player invited for “Atrocetomique” * Benoît Gagné (member in 1995): trombonist * Benoît Piché (member in 1995): trumpeter * El Hadji Fall Diouf and Pape Abdou Karim Diouf (members between 1998 and 1999): singers, percussionists * Justin Allard and Michel Dufour (members between 1998 and 1999): drummers * Jean-Denis Levasseur (member between 1998 and 1999): clarinettist, saxophonist * Charles Imbeau (member between 1998 and 1999): trumpeter, percussionist * Jean-François Lapierre (in concert in 1998): clarinettist, saxophonist, violonist, guitarist, percussionist == Discography == * Les Colocs (1993) * Atrocetomique (1995) * Dehors novembre (1998) * Les années 1992-1995 (2000) * Suite 2116 (2001) * Les Colocs live (2003) * Il me parle de bonheur (2009) == Other websites == * Colocs official website (in French) Category:1990 establishments in Canada Category:1990s Canadian music groups Category:2000 disestablishments in North America Category:2000s disestablishments in Canada Category:Canadian rock bands Category:Musical groups established in 1990 Category:Musical groups disestablished in 2000",
 "title": "Les Colocs"
}