{
 "id": "379659",
 "text": "The ELTon Award is given by the British Council for English language teaching innovation. ==2003 winners== *Tim Kelly and Hilary Nesi — University of Warwick *Fiona Joseph and Peter Travis — Flo-Joe ==2004 winners== *Richard Cauldwell — speechinaction (CD-ROM) *Macmillan Education Dictionaries Team — Macmillan Education, range of products (book, CD-ROM and online editions) *Scott Thornbury, Oxford University Press — Natural Grammar ==2005 winners== *Vanessa Reilly, Oxford University Press — Three in a tree (book and multimedia package) *Simon Mellor-Clark and Yvonne Baker de Altamirano, Macmillan Education — Campaign 1 coursebooks *Sophie Ioannou-Georgiou and Pavlos Pavlou, Oxford University Press — Assessing Young Learners ==2006 winners== *Corony Edwards and Jane Willis, University of Birmingham and Aston University — Teachers Exploring Tasks *Carol Read, Ana Soberon, Maria Toth and Elisenda Papiol, Macmillan Education — Bugs (multimedia course) *Stuart Rubenstein, Greta Grinfeld, Sally McCrae, Emma Fisher, Camden College of English— \"English Language Cultural Experience\" ==2007 winners== *Alison Sharpe, Professor Ronald Carter and Professor Michael McCarthy, Cambridge University Press — The Cambridge Grammar of English (CD-ROM and book) *David Warr, Language Garden — Language Gardening (CD-ROM) *Nicky Hockly and Gavin Dudeney, The Consultants-E, ICT in the Classroom (online course) ==2010 winners== *Russell Stanard — www.teachertrainingvideos.com *Mary Slattery, Catherine Kneafsey, Lucy Allen, Julia Bell — Teaching with Bear: Using puppets in the language classroom with young learners, Oxford University Press *Scott Thornbury, Luke Meddings, Lindsay Clandfield, Mike Burghall — Teaching Unplugged, Delta Publishing *James Thomas, Martina Pavlickova and Martina Sindelarova Skupenova — Global Issues in the ELT Classroom, Spolecnost pro Fair Trade *Stuart Wiffin and Helen Gibbon — Award For Innovative Writing ==2011 winners== *Neil Edgeller, Senjuti Masud, Sharif Sadique — Rinku's World, BBC Learning English *Ben Glynne, Dan Humm Soriano, David Wilkins — Communication Station, United International College *Rob Carter, Alice Castle, Abeer Hassan, Sean Keegan, Karim Kouchouk, Abigail Wincott — BBCe!, BBC Learning English *Marcos Benevides, Adam Gray — Fiction in Action: Whodunit, ABAX ELT *Simona Petrescu — Macmillan Education Award For Innovative Writing *Brian Abbs and Ingrid Freebairn — Lifetime Achievement Award ==2012 winners== *Kate Khoury, Sarah Raybould and Louise Salim — Sensing Humour in English *Nik Peachey — Bell Blended Learning for ELT, Bell *Macmillan Education— Sounds: The Pronunciation App, Macmillan Education *Kyle Mawer, Graham Stanley — Digital Play: Computer games and language aims, Delta Publishing *L2 — Wordready Academic English, L2 *Colour Trick — The Colour of Words, Colour Trick S.l. *Alan Maley — Lifetime Achievement Award ==2013 winners== *Mary Glasgow Scholastic — Mary Glasgow *Y.L.Teresa Ting — CLIL - Biology Towards IGCSE *Herbert Puchta and Günter Gerngross — Hooray! Let’s play! Helbling Languages *Kieran Donaghy — \"Film English\" *Richard Cauldwell — Cool Speech: Hot Listening, Cool Pronunciation, Speech in Action/Firsty Group *English in Action — English in Action, Bangladesh *Brita Haycraft — Lifetime Achievement Award ==2014 winners== *Excellence in Course Innovation - Dyslexia for Teachers of English as a Foreign Language (Dystefl) by Dystefl Project *Innovation in Learner Resources - Academic Skills Series by Collins *Innovation in Teacher Resources - The Disabled Access Friendly campaign by Katie Quartano and Paul Shaw *Digital Innovation - Doctors Speak Up: Communication and Language Skills for International Medical Graduates by R. Woodward-Kron, C. Bow, C. Fraser, J. Pill, E. Flynn *Local Innovation - P.A.L.S Scheme, (Promoting Acceptance of Language Students) - Country Cousins Ltd *The Macmillan Education Award for New Talent in Writing -Compass (Upper Intermediate) by Elizabeth (Lizzie) Pinard * British Council The Lifetime Achievement Award - Michael Swan ==2015 winners== *Excellence in Course Innovation - Oxford Discover by Oxford University Press *Innovation in Learner Resources - Oxford Learner’s Dictionary of Academic English by Oxford University Press, with Paragon Software GmbH (app) *Innovation in Teacher Resources - \"Life Skills\" by Macmillan Education *Digital Innovation - Little Bridge by Little Bridge *Local Innovation -Talk English by Manchester Adult Education Service, Manchester City Council with The Department for Communities and Local Government (UK) *The Macmillan Education Award for New Talent in Writing - EAP Shakespeare Dr Chris Lima *The British Council Lifetime Achievement Award - Henry Widdowson ==2016 winners== *Excellence in Course Innovation - Keynote by National Geographic Learning with Cengage Learning *Innovation in Learner Resources - Literacy for Active Citizenship by Learning Unlimited LTD *Innovation in Teacher Resources - Digital Video – A Manual for Language Teachers by PeacheyPublications.com *Digital Innovation - Movies: Enjoy Language by Archimedes Inspiration, a.s. *Local Innovation - Teaching English in Africa by East African Educational Publishers Ltd. *The Macmillan Education Award for New Talent in Writing - \"Academic English for the 21st Century Learner\" by Aylin Graves *The British Council Lifetime Achievement Award - \"Catherine Walter\" == Other websites == * Official site of the British Council * British Council innovation awards Category:British awards",
 "title": "ELTon Award"
}