{
 "id": "379667",
 "text": "Mariloup Wolfe (born 3 January 1978) is a Canadian actress from Montreal, Quebec. She became famous through her role as \"Marianne\" in the popular TV series Ramdam. ==Biography== Mariloup Wolfe studied arts and communications at College Andre-Grasset. She got a college degree in this subject. After that, she went to the McGill University for one year and did a minor degree in cultural studies. She finished her bachelor's degree at Concordia University in cinematographic productions and made a specialization in this matter at the same university. All those studies were made in Montréal.http://www.agencemva.com/fiche.php?id=wolfe&t;=realisateurs Mariloup Woolf Wolfe performed in the television series Ramdam for many years. She played \"Marianne\", a charming teenager in an ordinary family. Her role in this youth series won her many awards. In particular, she won a Metrostar in the category for young comedy series, two Artis awards in 2007 and 2008 and a Gemeaux prize for the best interpretation of a major role in a youth series. She also acted in an animated television series Fais ça court, which was about the creator of a short film. ==Personal life== Wolfe is the mother of two young boys: Manoe (born in May 2010) and Miro (born December 2011). Her ex- husband and father of their children is Guillaume Lemay Thivierge. Just like her, he is a comedian and met her in the Ramdam series in which they both acted.http://www.mariloupwolfe.com/archives/520 Article Wolfe represented the Yoopa magazine, a reference for parents, for one year. She signed an editorial in each publication.http://www.lapresse.ca/le-soleil/arts-et- spectacles/television-et-radio/201002/26/01-4255453-tva-lance-yoopa-une- chaine-pour-les-deux-a-six-ans.php TVA lance Yoopa, une chaîne pour les deux à six ans. She is the owner of an Energy Cardio center at Blainville and she participated at “Rallie des gazelles” with Jessica Barker.http://espace.canoe.ca/rallyeaicha/blog/view/4564 Bio de Mariloup Woolf Recently, she was an invited stylist for “Thyme Maternity”.http://fr.canoe.ca/artdevivre/mode- beaute/article1/2012/08/08/20079476-qmi.html Mariloup Woolf invente des looks de femmes enceintes ==References== ==Other websites== * Official website Category:1978 births Category:Living people Category:Canadian television actors Category:Actors from Quebec",
 "title": "Mariloup Wolfe"
}