{
 "id": "379640",
 "text": "Moral equivalence is a term used in political arguments or debate. It is an informal fallacy. The phrase describes a kind of indirect proof, but the reasoning is flawed because it distorts issues. It draws comparisons between different things to make a point that one is just as bad as the other or just as good as the other. The user of the term imagines a kind of independent position above or beyond the two contenders.Sowell, Thomas. (2001). The Quest for Cosmic Justice, p. 137. The moral equivalence theory allows someone using the term to appear both objective and detached at the same time.Hollander, Paul. (1998). The Survival of the Adversary Culture: Social Criticism and Political Escapism in American Society, p. 76. The general form of the context for the use of the trope is * The actions of A are morally equivalent to the actions of B, therefore A is just as good or bad as B, regardless of what the actual actions are. * Doing X is morally equivalent to doing Y, therefore someone doing X is just as good or bad someone doing Y, regardless of what X and Y actually are. The concept of moral equivalence is not a term of philosophy; rather, it is only a logical fallacy used in arguments.Blanchard, Brand. (1980). The Philosophy of Brand Blanshard, Vol. 1, p. 85; excerpt, \"We often discussed ethics, but seldom morals ... He was a master in ethical theory, but did not conceive himself as specially qualified to pass opinions on politics or social issues.\" ==History== It is usually used to suggest a moral or ethical hierarchy for two sides in a conflict -- that one is better or worse than the other. The term originates from a 1906 speech The Moral Equivalent of War by William James.William James. (1910). \"The Moral Equivalent of War\"; retrieved 2013-1-13. The term's popular use was expanded by Jeane Kirkpatrick, who was US ambassador to the United Nations when Ronald Reagan was President of the United States. In 1986, Kirkpatrick published \"The Myth of Moral Equivalence\" which responded to the argument that there was \"no moral difference\" between the Soviet Union and democratic states.Kirkpatrick, Jeane. \"The Myth of Moral Equivalence,\" Imprimis. January 1986, Vol. 15, No. 1; retrieved 2013-1-13. ==Related pages== * False analogy * Apples and oranges * Morality * Ethics ==References== Category:Logical fallacies Category:Ethics",
 "title": "Moral equivalence"
}