{
 "id": "379902",
 "text": "The National Aboriginal & Torres Strait Islander Art Award (NATSIAA) is a competition, exhibition and award held each year for visual arts in Australia. It is one of the most important art awards in Australia. It was first created in 1984 by the Museum and Art Gallery of the Northern Territory. Telstra has sponsored the event since 1992, so it is often known as the Telstra Award. The competition is open to all adult Aboriginal and Torres Strait Islander artists. It features artists from all over Australia. Its goal is to show the best indigenous art in the country. The works can be in any media, including paintings (on bark, canvas and paper), prints, sculpture, textiles, weaving, ceramics, glass, photography, digital media and video. The first prize of AU$40,000 is awarded to the work considered the best in the show. Smaller prizes of AU$4,000 each are awarded in four categories. ==List of winners== No. Year Artist(s) Name of work Medium References 29th 2012 Timothy Cook Kulama 28th 2011 Dickie Minyintiri Kanyalakutjina (Euro tracks) synthetic polymer paint on canvas 27th 2010 Jimmy Donegan Papa Tjukurpa, Pukara Synthetic polymer paint on canvas 26th 2009 Danie Mellor From Rite to Ritual Mixed media on paper 25th 2008 Makinti Napanangka no title synthetic polymer paint on linen 24th 2007 Dennis Nona Ubirikubiri cast bronze 23rd 2006 Ngoia Napaltjarri Pollard Swamps west of Nyirripi synthetic polymer paint on Belgian linen 22nd 2005 Blackstone Tjanpi Weavers Tjanpi Grass Toyota desert grass, jute string and mixed media 21st 2004 Gulumbu Yunupingu Garak, The Universe natural pigments on wood (three hollow logs) 20th 2003 Richard Bell Scientia E Metaphysica (Bell’s Theorem) synthetic polymer paint on canvas 19th 2002 Gawirrin Gumana Birrkuda ringgitj (Wild honey design) natural pigments on wood 18th 2001 Dorothy Napangardi Salt on Mina Mina synthetic polymer paint on linen 17th 2000 Kenny Williams Tjampitjinpa Snake Tjukurrpa synthetic polymer paint on linen 16th 1999 Long Tom Tjapanangka Ulampuwarru (Haasts Bluff Mountain) synthetic polymer paint on linen West, p. 114. 15th 1998 Jody Broun \"White Fellas Come Talk About the Land\" synthetic polymer paint on canvas Birnberg & Kreczmanski, pp. 213–214. 14th 1997 Yanggarriny Wunungmurra Gangan natural pigments on bark 13th 1996 Kathleen Petyarre Storm in Atnangker country II synthetic polymer paint on linen Birnberg & Kreczmanski. 12th 1995 Pantjiti Mary McLean Ngura walkumunu (Being in a good camp) synthetic polymer paint on canvas 11th 1994 Daisy Andrews Lumpu lumpu (wet time) landscape synthetic polymer paint on paper 10th 1993 Paddy Fordham Wainburranga Eagle Hawk and Crow natural pigments on paper 9th 1992 Les Midikuria Borlong the rainbow serpent natural pigments on bark 8th 1991 Mick Namarari Tjapaltjarri Bandicoot Dreaming synthetic polymer paint on canvas 7th 1990 Mutitjpuy Mununggurr The Djang’kawu at Balana natural pigments on bark 6th 1989 Pansy Napangardi Yipala bush bananas synthetic polymer paint on canvas 5th 1988 Pauleen Woods Nakamarra Yarla, Yam Dreaming synthetic polymer paint on canvas 4th 1987 Djardi Ashley Wodalpa Blue tongue lizard natural pigments on bark 3rd 1986 Frank Jakamarra Nelson Living together, working together synthetic polymer paint on canvas 2nd 1985 Djawida Nadjongorle Uta Uta Tjangala Kaye Haywood. Nawurra Tjanangkamurramurra Untitled natural pigments on bark synthetic polymer paint on canvas batik on silk 1st 1984 Michael Nelson Tjakamarra Three ceremonies synthetic polymer paint on canvas ==References== ==Bibliography== * * ==Other websites== *Exhibition information at the Museum and Art Gallery of the Northern Territory Category:Indigenous Australian culture Category:Art awards Category:1984 establishments in Australia",
 "title": "National Aboriginal & Torres Strait Islander Art Award"
}