{
 "id": "38008",
 "text": "The Fields Medal is a prize given to mathematicians who are not over 40 years of age. It is given at each International Congress of the International Mathematical Union. This is a meeting that takes place every four years. The Canadian mathematician John Charles Fields was the first to propose this medal and it was first awarded in 1936. It has been regularly awarded since 1950. Its purpose is to support younger mathematicians who made major contributions. The Fields Medal is viewed, at least in the media, as the top honor a mathematician can receive. It comes with a monetary award. In 2006 the award was C$15,000 (US$13,400 or €10,550). The Abel Prize has similar prestige, and more money. == Conditions of the award == The Fields Medal is often described as the \"Nobel Prize of mathematics\". But there are several differences. First, it is awarded not only to recognize the valuable contributions of a mathematician but also to encourage him or her to continue their works. The Fields Medals have generally been awarded for a mathematician's whole work. Another difference is that the Fields Medal is awarded every four years. The recipients cannot be over the age of 40. == Fields Medalists == * 2022: Hugo Duminil-Copin (France), June Huh (US), James Maynard (UK), Maryna Viazovska (Ukraine) * 2018: Caucher Birkar (UK-Iran), Alessio Figalli (Italy), Peter Scholze (Germany), Akshay Venkatesh (Australia) * 2014: Artur Avila (Brazil), Manjul Bhargava (U.S.), Martin Hairer (UK), Maryam Mirzakhani (U.S.) * 2010: Elon Lindenstrauss (Israel), Ngô Bảo Châu (Vietnam/France), Stanislav Smirnov (Russia), Cédric Villani (France) * 2006: Andrei Okounkov (Russia), Grigori Perelman (Russia) (declined award), Terence Tao (Australia), Wendelin Werner (France) * 2002: Laurent Lafforgue (France), Vladimir Voevodsky (Russia) * 1998: Richard Ewen Borcherds (UK), William Timothy Gowers (UK), Maxim Kontsevich (Russia), Curtis T. McMullen (U.S.) * 1994: Efim Isakovich Zelmanov (Russia), Pierre-Louis Lions (France), Jean Bourgain (Belgium), Jean- Christophe Yoccoz (France) * 1990: Vladimir Drinfeld (USSR), Vaughan Frederick Randal Jones (New Zealand), Shigefumi Mori (Japan), Edward Witten (U.S.) * 1986: Simon Donaldson (UK), Gerd Faltings (West Germany), Michael Freedman (U.S.) * 1982: Alain Connes (France), William Thurston (U.S.), Shing-Tung Yau (China) * 1978: Pierre Deligne (Belgium), Charles Fefferman (U.S.), Grigory Margulis (USSR), Daniel Quillen (U.S.) * 1974: Enrico Bombieri (Italy), David Mumford (U.S.) * 1970: Alan Baker (UK), Heisuke Hironaka (Japan), Sergei Petrovich Novikov (USSR), John Griggs Thompson (U.S.) * 1966: Michael Atiyah (UK), Paul Joseph Cohen (U.S.), Alexander Grothendieck (France), Stephen Smale (U.S.) * 1962: Lars Hörmander (Sweden), John Milnor (U.S.) * 1958: Klaus Roth (UK), René Thom (France) * 1954: Kunihiko Kodaira (Japan), Jean-Pierre Serre (France) * 1950: Laurent Schwartz (France), Atle Selberg (Norway) * 1936: Lars Ahlfors (Finland), Jesse Douglas (U.S.) == Footnotes == == Other websites == * Official site Category:Mathematics Category:Science awards",
 "title": "Fields Medal"
}