{
 "id": "380068",
 "text": "Body Count are an American heavy metal band from Los Angeles, California. The band was formed in 1990 by rapper Ice-T and some of his friends. They released their self-titled debut album, Body Count, on March 31, 1992. The album featured the controversial song \"Cop Killer\". Band member Beatmaster V died in died of leukemia in 1996, Mooseman was killed in a drive-by shooting in 2001 and D-Roc the Executioner died in 2004 from lymphoma. ==Cop Killer controversy== Their debut album featured the controversial song \"Cop Killer\" which received negative reactions from political figures like then-President George H.W. Bush, then-Vice President Dan Quayle and Tipper Gore, co-founder of Parents Music Resource Center. Ice-T decided to re-release the album with the song \"Cop Killer\" on it saying \"I didn't want my band to get pigeon-holed as that's the only reason that record sold. It just got outta hand and I was just tired of hearing it. I said, 'fuck it,' I mean they're saying we did it for money, and we didn't. I'd gave the record away, ya know, let's move on, let's get back to real issues, not a record but the cops that are out there killing people.\" == Band members == ;Current *Ice-T – vocals (1990—present) *Ernie C – lead guitar (1990—present) *O.T. – drums (1997—present) *Vincent Price – bass (2001—present) *Bendrix – rhythm guitar (2004—present) ;Former *Beatmaster V – drums (1990—1996) *Mooseman – bass (1990—2001) *D-Roc the Executioner – rhythm guitar (1990—2004) *Griz – bass (2001) == Discography == ===Studio albums=== *Body Count (1992) *Born Dead (1994) *Violent Demise: The Last Days (1997) *Murder 4 Hire (2006) *Manslaughter (June 9, 2014) ==References== == Other websites == *Official website Category:1990 establishments in the United States Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:Musical groups from Los Angeles Category:Speed metal bands Category:Thrash metal bands",
 "title": "Body Count (band)"
}