{
 "id": "380111",
 "text": "The University of Sydney is a public university in Sydney, Australia. The main campus is in the suburbs of Camperdown and Darlington. Founded in 1850, it is the oldest university in Australia and Oceania. In 2011, it had 32,393 undergraduate and 16,627 graduate students. The University of Sydney is organised into sixteen faculties and schools. They offer bachelor's degrees, master's degrees and doctoral degrees. The univsersity often ranks amongst the best universities in Australia and Oceania. In 2012, it was ranked 39th in the world; 3rd in Australia, behind Australian National University (24th) and the University of Melbourne (36th) in the 2012 QS World University Rankings. == Location == The main campus is in the top 10 of the world's most beautiful universities. This is according to the British Daily Telegraph and the American Huffington Post. This ranking is among other campuses, such as Oxford's and Cambridge's. The campus spreads across the inner-city suburbs of Camperdown and Darlington. First, it was in what is now Sydney Grammar School. Then, in 1855 the government granted land in Grose Farm to the university. This is three kilometres from the city. Now, this land has the main Camperdown campus on it. The main campus is the home base of the large Sydney Medical School. This school has many affiliated teaching hospitals across the state. The main campus is the focus of the university's student life. The student-run University of Sydney Union has three buildings. These are the Wentworth, Manning and Holme Buildings. These buildings house a large proportion of the university's catering outlets. These buildings also provide space for recreational rooms, bars and function centres. One of the most significant activities organised by the Union is Welcome Week. This is a three-day festival at the start of the academic year. Welcome Week centres on stalls set up by clubs and societies on the Front Lawns. The main campus is also home to a variety of statues, artworks, and monuments. These include the Gilgamesh Statue and the Confucius Statue. The NSW state government has reduced transport links to the campus. It also reduced transport links to the closest Redfern railway station. But, there is still access to buses on the neighbouring Parramatta Road and City Road. This is to prioritise the growth of other Sydney universities. == History == In 1854, the architect Edmund Blacket designed the first buildings. Then, in 1858, people finished building the Great Hall. In 1859, people finished building the Main Building. Finally, in 1862, people completed the Quadrangle and Great Tower buildings. In the mid-20th century, the university expanded in enrollment. This led the university to buy more land. The 2002 conservation plan of the university stated many campus features are significant. This includes Victoria Park. Since 2007, the university has used space in the former Eveleigh railway yards. They are to the south of Darlington. It has used this space for examination purposes. In 2015, The NSW Department of Planning and Environment endorsed a plan. This was the University of Sydney's $1.4 billion Campus Improvement Plan. It involved many new important structures and renovations. In 2018, the government agreed to put sites on the state heritage register. These include the University of Sydney and some surrounding areas. This created a conservation area. This area contains the Camperdown campus and the nearby Victoria Park. The beginning of 2021 saw the closure of the Cumberland campus. Then, some health disciplines returned to the Camperdown campus. They did this in the state-of-the-art, purpose-built Susan Wakil Health Building. ==References== ==Other websites== * University of Sydney website Category:Colleges and universities in Australia Category:1850 establishments Category:1850s establishments in Australia",
 "title": "University of Sydney"
}