{
 "id": "380563",
 "text": "Mia Sara (born 19 June 1967, Brooklyn, New York) is an American actress. She appears mostly in movies. She was in Timecop (1994), Ferris Bueller's Day Off (1986) and Legend (1985). She received a Saturn Award for Best Supporting Actress. ==Early life== She was born Mia Sarapochiello in Brooklyn Heights, New York, of Italian-American descent. She is the daughter of Diana, a stylist and photographer, and Jerome Sarapochiello, a photographer and artist. == Filmography == === Film === Year Title Role Notes 1985 Legend Princess Lily 1986 Ferris Bueller's Day Off Sloane Peterson 1988 Apprentice to Murder Alice Spangler 1988 Shadows in the Storm Melanie 1990 Any Man's Death Gerlind 1991 Elise Shipp 1991 By the Sword Erin Clavelli 1992 Leah 1994 Caroline at Midnight Victoria Dillon 1994 Timecop Melissa Walker 1995 Gina Sands 1995 Cynthia 1995 Black Day Blue Night Hallie Schrag 1996 Cassie Osborne 1999 Dazzle Miss Martinet 2000 Little Insects Princess Dayzie (voice) 2001 Molly Connor 2002 Turn of Faith Annmarie De Carlo 2003 Hoodlum & Son Ellen Heaven 2012 Dorothy and the Witches of Oz Princess Langwidere 2013 Pretty Pretty Narciss Short ===Television=== Year Title Role Notes 1987 Queenie Queenie Kelly / Dawn Avalon TV miniseries 1988 Alfred Hitchcock Presents Sara Fletcher \"Twisted Sisters\" 1989 Big Time Fran TV film 1989 Till We Meet Again Delphine de Lancel TV miniseries 1990 Daughter of Darkness Katherine Thatcher TV film 1992 Call of the Wild Jessie Gosselin TV film 1993 Blindsided Chandler Strange TV film 1993 Time Trax Elyssa Channing-Knox / Annie Knox \"A Stranger in Time\", \"To Kill a Billionaire\" 1995 Bullet to Beijing Natasha TV film 1995-96 Chicago Hope Annie Rueman \"Informed Consent\", \"Women on the Verge\" 1996 Strangers Ginny \"Stone Heart\" 1996 Midnight at Saint Petersburg Natasha TV film 1996 Undertow Willie Yates TV film 1997 20,000 Leagues Under the Sea Mara TV miniseries 1998 Hard Time Myler TV film 2001 Jack and the Beanstalk: The Real Story Ondine \"1.1\", \"1.2\" 2002 Lost in Oz Loriellidere Unsold TV pilot 2002-03 Birds of Prey Dr. Harleen Quinzel/Harley Quinn Main role 2005 CSI: NY Cala Winger \"Jamalot\" 2006 Nightmares & Dreamscapes: From the Stories of Stephen King Beautiful Passenger \"Battleground\" 2007 Tinseltown Lena TV series 2011 Princess Langwidere TV miniseries ==References== ==Other websites== * Category:Actors from New York City Category:American movie actors Category:American television actors Category:American voice actors Category:1967 births Category:Living people",
 "title": "Mia Sara"
}