{
 "id": "381486",
 "text": "The Humboldt-University of Berlin () is Berlin's first public university. It was founded by Wilhelm von Humboldt. He was the German Minister of Education at the time.'CENTENARY OF BERLIN UNIVERSITY', The Journal of Education, Vol. 72, No. 15 (1801) (OCTOBER 27, 1910), p. 399 Von Humboldt organized Germany's system of education which is still used today. The first building was donated by Frederick William III of Prussia. The University opened its doors in 1810 as the University of Berlin. == History == At the time of its founding in 1810, there was pressure to make the new university both practical and industrial. Von Humboldt wanted it to be a center for the pursuit of truth in learning. In the end, he won out. The University was set up under his principles. In 1828 it was formally renamed the Frederick-William University. The university was named in honor of the reigning monarch, Frederick William III of Prussia.Reports of the Department of the Interior, 1911, Vol. 1 (Washington DC: Government Printing Office, 1912), p. 594 The university offered the traditional faculties of law, medicine, theology, and philosophy. Emperor William made several establishments at the University. One of these was the professorship of \"American History\". It is now called the \"Theodore Roosevelt professorship\". It required the position be filled by an American professor who must lecture in German. In an interview with then president Butler of Columbia University, a second professorship in Berlin was established with a lectures in English taught by a German professor. From 1933 to 1945, under Nazism, the university lost many of its Jewish scholars and students. Some were killed. On May 10, 1933 many university books were burned. Before World War II Humboldt was still the major university in Berlin.Witnessing the Disaster, eds Michael Bernard-Donals; Richard Glejzer (Madison: University of Wisconsin Press, 2003), p. 177 After the war the university was greatly weakened. It reopened in January 1946. It was in the Soviet sector of Berlin. Many students and faculty wanted to continue their education free of communist government control. With the help of the US Army and donations from the United States government, the Free University of Berlin was established in 1948 in West Berlin. In 1949 the university was given its present name, Humboldt-University of Berlin (), to honor the brothers Alexander and Wilhelm von Humboldt. The university underwent a number of changes by the government of East Berlin in the 1950s. But it regained its importance as a major center of learning.International Dictionary of University Histories, eds. Mary Devine; Carol Summerfield (Chicago; London: Fitzroy Dearborn Pub., 1998), p. 200 == The university today == The university got its start reflecting the principles of the great educational reformer Wilhelm von Humboldt. It pioneered many new academic disciplines. In spite of its problems in the 20th century, the university has returned to its founding principles. There are 260 degree courses offered. The university has an academic staff of about 2,170 and 35,000 students. it is currently ranked 80th among the world's universities. It has been informally called \"Berlin University\" throughout its history. Also, informally, the \"University of Linden\" () after its location. == References == == Other websites == * Humboldt-Universität zu Berlin Home page (in German) Category:1949 establishments in Germany Category:Colleges and universities in Berlin Category:Education in Berlin",
 "title": "Humboldt-University of Berlin"
}