{
 "id": "381526",
 "text": "A carboxylic acid is any molecule that has a COOH group. This group contains a carbonyl (C=O double bond) together with an hydroxyl group (OH) on the same carbon atom. Because it is easy to remove the proton with even a weak base, these compounds are called acids. An example of a carboxylic acid is acetic acid, which is also known as vinegar. Carboxylic acids are found a lot in food. Many types of fat molecules are actually carboxylic acids. For example, chocolate and coconuts have these acids. They are also used a lot in soaps and detergents. The smaller carboxylic acids dissolve in water. The bigger ones dissolve only in organic solvents. ==List== This section lists the first few carboxylic acids. Straight-chain, saturated carboxylic acids Carbon atoms Common name IUPAC name Chemical formula Common location or use 0 Oxygen ? OO Air 1 Carbonic acid Carbonic acid OHCOOH Blood and tissues (bicarbonate buffer system) 1 Formic acid Methanoic acid HCOOH Insect stings 2 Acetic acid Ethanoic acid CH3COOH Vinegar 3 Propionic acid Propanoic acid CH3CH2COOH Preservative for stored grains, body odour 4 Butyric acid Butanoic acid CH3(CH2)2COOH Butter 5 Valeric acid Pentanoic acid CH3(CH2)3COOH Valerian 6 Caproic acid Hexanoic acid CH3(CH2)4COOH Goat fat 7 Enanthic acid Heptanoic acid CH3(CH2)5COOH 8 Caprylic acid Octanoic acid CH3(CH2)6COOH Coconuts 9 Pelargonic acid Nonanoic acid CH3(CH2)7COOH Pelargonium 10 Capric acid Decanoic acid CH3(CH2)8COOH Coconut and Palm kernel oil 11 Undecylic acid Undecanoic acid CH3(CH2)9COOH 12 Lauric acid Dodecanoic acid CH3(CH2)10COOH Coconut oil and hand wash soaps 13 Tridecylic acid Tridecanoic acid CH3(CH2)11COOH 14 Myristic acid Tetradecanoic acid CH3(CH2)12COOH Nutmeg 15 Pentadecylic acid Pentadecanoic acid CH3(CH2)13COOH 16 Palmitic acid Hexadecanoic acid CH3(CH2)14COOH Palm oil 17 Margaric acid Heptadecanoic acid CH3(CH2)15COOH 18 Stearic acid Octadecanoic acid CH3(CH2)16COOH Chocolate, waxes, soaps, and oils 19 Nonadecylic acid Nonadecanoic acid CH3(CH2)17COOH Fats, vegetable oils, pheromone 20 Arachidic acid Icosanoic acid CH3(CH2)18COOH Peanut oil Category:Functional groups Category:Carboxylic acids",
 "title": "Carboxylic acid"
}