{
 "id": "382041",
 "text": "TaleSpin is an American animated television show. It is based on characters from Disney's The Jungle Book movie. Instead of being wild animals from the jungle, the characters in TaleSpin wear clothes, live in a town, and have jobs. The series was originally shown from May 5, 1990 to August 8, 1991. It had a total of 65 episodes. ==Main Characters== *Baloo *Kit Cloudkicker *Rebecca Cunningham *Molly Cunningham *Wildcat (mechanic) *King Louie *Shere Khan *Don Karnage and his pirates *Colonel Spigot ==Home video releases== ===VHS=== ====Video Chile: ADV Garantía Original Video==== Eleven VHS cassettes containing 21 episodes of the series were released in Argentinina/Chile. VHS Name Episode Titles Release Date TaleSpin (Volume 1): Baloo Skies \"Stormy Weather\" \"For a Fuel Dollars More\" April 17, 1992 TaleSpin (Volume 2): Dare-Devil Bears \"Mommy for a Day\" \"The Idol Rich\" April 17, 1992 TaleSpin (Volume 3): Fearless Flyers \"From Here to Machinery\" \"The Balooest of the Bluebloods\" September 12, 1992 TaleSpin (Volume 4): Hot Shot Heroes \"Jumping the Guns\" \"Mach One for the Gipper\" September 12, 1992 TaleSpin (Volume 5): Imagine That \"Flight of the Snow Duck\" \"Flight School Confidental\" September 12, 1992 TaleSpin (Volume 6): Treasure Trap \"Polly Wants to a Treasure\" \"The Bigger They Are, the Louder They Oink\" April 2, 1993 TaleSpin (Volume 7): True Baloo \"The Time Bandit\" \"Louie's Last Stand\" April 2, 1993 TaleSpin (Volume 8): Jackpots & Crackpots \"Her Chance to Dream\" \"A Touch of Glass\" September 18, 1993 TaleSpin (Volume 9): That's Showbiz! \"I Only Have Ice for You\" \"It Came from Beneath the Sea Duck\" September 18, 1993 TaleSpin (Volume 10): Wise Up! \"Molly Coddled\" \"The Sound and the Furry\" September 18, 1993 TaleSpin (Volume 11): Search of the Lost City \"For Whom the Bell Klangs\" (Parts 1&2) September 18, 1993 ===DVD=== ====Video Chile: ADV Garantía Original Video==== The sets from Germany and the United Kingdom have also been released in Argentinina/Chile. The First Collection came out on September 15, 2012. The Second Collection was released on April 12, 2013. The Third Collection was released on September 14, 2013. DVD Name Ep# Release Date TaleSpin First Collection (Volumes 1-3) 1-27 September 15, 2012 TaleSpin Second Collection (Volumes 4-6) 28-54 April 12, 2013 TaleSpin Third Collection 55-65 September 14, 2013 == Other websites == * * * * TaleSpin Source , Information about TaleSpin, including a section with answers from the creators of the series. Category:1990 American television series debuts Category:Television series by Disney Category:Animated television series Category:First run syndicated television programs Category:English-language television programs",
 "title": "TaleSpin"
}