{
 "id": "382063",
 "text": "The Fox and The Hound: The Series is an animated Disney television series. It is based on The Fox and The Hound as it is focused on the youth of Tod and copper before the events of the The Fox and The Hound 2. The series was first shown from October 5, 2003 to January 10, 2006 before it's reruns to the Disney Channel. The show was broadcast on Fox Family Channel, but was taken off off the schedule in 2004. Reruns aired on Disney Junior from 2012 to 2013. The series also aired on Toon Disney and in the United Kingdom. ==Main Characters== * Baloo (voiced by Pamela Adlon): A friendly and free-spirited sloth bear. * Bagheera (voiced by Elizabeth Daily in Season 1, Dee Bradley Baker in Season 2): He is a sensible panther. Bagheera is known as \"Baggy\" or \"Bags\". He is the youngest in the group. * Louie (voiced by Jason Marsden in Season 1, Cree Summer in Season 2): Baloo's best friend, an orangutan. * Shere Khan (voiced by Jason Marsden): A proud, arrogant Bengal tiger. He is often called \"Khannie\" by Baloo and Louie. * Kaa (voiced by Jim Cummings): A young python who wants to hypnotize other animals, but his skills at hypnosis are not very good. * Hathi: An elephant who tyies to keep the group in order. He is often called \"Little Peanut\" by Baloo. * Cecil and Arthur (voiced by Michael McKean and David Lander) - Two vultures who are always hoping for one of the cubs to die so that they can eat them. They are never seen as a real threat. * Mahra (voiced by Tress MacNeille) - A baboon that lives in the wasteland. She and her sons have often antagonized the Jungle Cubs when they enter the wasteland. ** Ned (voiced by Charlie Adler) - One of Mahra's sons. ** Jed (voiced by Jim Cummings) - One of Mahra's sons. ** Fred (voiced by Jim Cummings) - One of Mahra's sons. ==International home video releases== ===Episodes=== ====Hobo Collection (United Arab Emirates)==== Special episodes were aired as two part episodes, and were also added to video cassette. VHS Name Episode Titles VHS release dates The Jungle Book's Jungle Cubs (Volume 1): Born to be Wild \"A Night in the Wasteland: Tod wants to spend the night at a nearby wasteland far beneath the fair, but is unaware it belongs to two scaling thieves, called the red dogs. October 3, 2003 The Jungle Book's Jungle Cubs (Volume 2): Once Upon a Vine Copper meet his match: copper encounters a bloodhound and begins spending time with her, causing jealousy to Todd. Treasure in the middle log: Todd and copper tried to find treasure they believe is in the middle of widow tweeds home. May 22, 1998 Rereleased: September 13, 2003 The Jungle Book's Jungle Cubs (Volume 3): Monkey Business Bloodhound just gotta have fun: copper encourages the band that can have fun by having a cricket contest, but that causes trouble to the crickets. Monkey business: some monkeys escape from a circus train and befriend Todd, who is nervous being around animals he doesn’t know. The great granny rose: granny roses, jealous, and wants to perform a magic trick of her own after discovering that bigger staff can brave everything in the forest. == Other websites == * * Category:1996 television series debuts Category:Television series by Disney Category:Animated television series Category:1998 television series endings",
 "title": "Jungle Cubs"
}