{
 "id": "382059",
 "text": "The Lion King's Timon and Pumbaa is an animated Disney television series. It is based off The Lion King movie. The series was shown from September 16, 1995 to 1999. It had a total of 86 episodes. ==Main Characters== * Timon and Pumbaa are the basic characters of the series. They go on wacky, high, jinx and adventures, surrounding across their home or in a city. * Simba is their friend. he’s shown to make a few cameo appearances and even appeared in sub episodes, helping to bold in public recognize what is right or wrong, and is even protected from a line named Claudius, which he is sent to battle in a gladiator battle. * Zazu is a horrid bill who appears in some episodes. He is noted to get into the same troubles as the pump, and his neighbor is Mr. Tiki bird, who annoys him constantly. * Shenzi, Banzai and Ed are the hyenas that try to look for food. They are going to get into some trouble, such as falling into traps or being foiled by tooted Puba. * Rafiki is a wise bear drill which helps to mold and Pumbaa along with Simba. * Quint is enemy. He is known to be jealous and always always wanting to get all the fame. Sometimes he could get into trouble by his father, who is strict on him and verbally punishes him, but it’s nice and soft on pub button and even offers them grubs. He is the old human that and papa ever interact. * Speedy the Snail is a small snail that always complains about being late. To help him find his home after finding him on a cargo ship. * Boss Beaver is the local beaver on his beaver tribe. He is known to lead them into work audit opposite name of a Kuna Matata, where papa is interested in doing the job, but not to mold. Sometimes, what he chipped the tooth, he could complete about it, but always gets helped by his leader, as win, a dimwitted beaver. * Erwin is the bottle of the baby bird. She hates it with mold in public eat her worms and always has to collect more often to feed her baby. She also has some eggs that only hatch in the spring or summer and she does not want her to get hurt, it is also known on hitting to pop up with her broom. * Toucan Dan is a toucan that leads Zazoo on multiple quest. He appears at some episodes. It has his first major role, where Zazu accidentally hurts his feelings, but makes it up to him. * Smolder the Bear is a parody of smoky the Smoky the bear. He’s low for who to get a educational show that teaches kids right or wrong things, and both Poppa have to dress up as the kids. * The Three Natives are as a gorilla that plays with Timon and Pumbaa. Would they try to leave, they are not to be frustrated and even throw violent tantrums. Timon has to call them down to stop them throwing tantrums. ==Home Video releases== ===VHS releases=== ====Video Chile: ADV Garantía Original Video==== Five VHS cassettes contaning 35 episodes of the series were released on the Argentinina in Chilean. VHS Name Episode Titles Release Date Timon & Pumbaa (Volume 1): Around the World with Timon & Pumbaa \"Boara Boara\" \"Yukon Con\" \"Saskatchewan Catch\" \"Stand by Me\" (music video episode) \"Brazil Nuts\" \"Truth or Zaire\" \"Never Everglades\" September 20, 1996 Rereleased: November 29, 2003 Timon & Pumbaa (Volume 2): Dining Out with Timon & Pumbaa \"French Fried\" \"Russia Hour\" \"Swiss Missed\" \"To Kilimanjaro Bird\" \"Don't Break the China\" \"Rocky Mountain Lie\" \"Yummy, Yummy, Yummy\" (music video episode) August 12, 1997 Rereleased: November 29, 2003 Timon & Pumbaa (Volume 3): On Holiday with Timon & Pumbaa \"Kenya, Be My Friend\" \"South Sea Sick\" \"Uganda be an Elephant\" \"The Pain in Spain\" \"How to Beat the High Costa Rica\" \"You Ghana Join the Club\" \"The Lion Sleeps Tonight\" (music video episode) Timon & Pumbaa (Volume 4): Happy Birthday with Timon & Pumbaa \"Be More Pacific\" \"Amazon Quiver\" \"Going Uruguay\" \"Timon's Time Togo\" \"Doubt of Africa\" \"Madagascar About You\" \"Alone Together\" (music video episode) February 20, 1998 Rereleased: November 29, 2003 Timon & Pumbaa (Volume 5): ABC with Timon & Pumbaa \"Mozam-Beaked\" \"Mojave Desserted\" \"Ocean Commotion\" \"Frantic Atlantic\" \"Okay, Bayou?\" \"Paraguay Parade\" \"Beethoven's Whiff\" (music video episode) ===DVD releases=== ====Video Chile: ADV Garantía Original Video==== Five DVDs containing 35 episodes of the series were released on the Argentinina in Chilean. DVD Name Episode Titles Release Date Around the World with Timon & Pumbaa \"Boara Boara\" \"Yukon Con\" \"Saskatchewan Catch\" \"Stand by Me\" (music video episode) \"Brazil Nuts\" \"Truth or Zaire\" \"Never Everglades\" November 29, 2003 Dining Out with Timon & Pumbaa \"French Fried\" \"Russia Hour\" \"Swiss Missed\" \"To Kilimanjaro Bird\" \"Don't Break the China\" \"Rocky Mountain Lie\" \"Yummy, Yummy, Yummy\" (music video episode) On Holiday with Timon & Pumbaa \"Kenya, Be My Friend?\" \"South Sea Sick\" \"Uganda be an Elephant\" \"The Pain in Spain\" \"How to Beat the High Costa Rica\" \"You Ghana Join the Club\" \"The Lion Sleeps Tonight\" (music video episode) Happy Birthday with Timon & Pumbaa \"Be More Pacific\" \"Amazon Quiver\" \"Going Uruguay\" \"Timon's Time Togo\" \"Doubt of Africa\" \"Madagascar About You\" \"Alone Together\" (music video episode) ABC with Timon & Pumbaa \"Mozam-Beaked\" \"Mojave Desserted\" \"Ocean Commotion\" \"Frantic Atlantic\" \"Okay, Bayou?\" \"Paraguay Parade\" \"Beethoven's Whiff\" (music video episode) ==Awards and nominations== Daytime Emmy Awards *1996 – Outstanding Performer in an Animated Program – Nathan Lane For playing \"Timon\". (Won) *1997 – Outstanding Sound Mixing – Special Class – Deb Adair, Jim Hodson, Melissa Ellis, Michael Beiriger, Dan Hiland, Joseph D. Citarella, Allen L. Stone, and Michael Jiron (Won) *1997 – Outstanding Individual in Animation – Kexx Singleton for (\"Beethoven's Whiff\") (Won) == Other websites == * * * Category:1995 television series debuts Category:Television series by Disney Category:1990s animated television series Category:First run syndicated television programs Category:The Lion King Category:1999 television series endings Category:English-language television programs",
 "title": "The Lion King's Timon and Pumbaa"
}