{
 "id": "38213",
 "text": "A domestic sheep (Ovis aries) is a domesticated mammal related to wild sheep and goats. Sheep are owned and looked after by a sheep farmer. Female sheep are called ewes. Male sheep are called rams. Young sheep are called lambs.Ensminger M.E. & R.O. Parker 1986. Sheep and goat science. 5th ed, Interstate Illinois. . They are kept for their wool and their meat. The wool of sheep, after cleaning and treating, is used to make woolen clothes. The meat of young sheep is called lamb, and the meat from adult sheep is called mutton. Both are economically important products which have been used since prehistoric times.Simmons, Paula & Carol Ekarius 2001. Storey's guide to raising sheep. Storey, North Adams, MA. . Sheep are domesticated animals which have been bred by man. There are breeds which specialize in wool or meat. The plural of \"sheep\" is just \"sheep\". == Flocks == A group of sheep is called a flock. Sheep follow each other in basically the same way all the time, so there are special names for the different roles sheep play in a flock. The sheep that is farthest away from the others is called the outlier, a word that is also used in statistics. This sheep is willing to go out farther away from the safety of the flock to graze but takes a chance that a predator like a wolf will attack it first, because it is alone. Another sheep, the bellwether, which never goes first but always follows an outlier, is the one that signals to the others that it is safe to go that way. When it moves, the others will also move. Tendency to be outliers or to be bellwethers, or stick in the middle of the flock, seems to stay with a sheep its whole life. There might be genes that make them repeat this role behavior. == Notable sheep == Probably the most famous sheep was Dolly the Sheep. She was named after Dolly Parton and was the first large mammal clone. She did not live as long as a regular sheep, because clones have health problems. This is only known because of Dolly. == Fat-tailed sheep == These sheep are so named because they can store large amounts of fat in the tail and the region of the rump. They are kept mainly because they make more milk than other types of sheep; but their wool is rough and long and is mostly used for making carpets. Fat-tailed sheep are found mainly in the very dry parts of Africa, the Middle East, and Asia, and they represent about 25 percent of the sheep in the world. The major breeds are the Awassi, Bakhtiari, Karakul, Ghashghai, and Kermani. == Figurative meaning == People may be called \"sheep\" if they follow a leader without thinking or people can be called \"Sheepish\" if they are showing or feeling embarrassment from shame or a lack of self-confidence. This is what is called a figurative meaning: it's a figure of speech. == Homosexuality in rams == Domesticated sheep are one species known to show exclusive homosexuality, like we see in humans. The biologist Charles Roselli has found that 6 to 8% of rams (male sheep) only show interest in other rams over a long period of time, instead of ewes. He has cut open the brains of homosexual rams and found that a region of the brain in the hypothalamus called the SDN was the same size of the SDN in a ewe (female sheep). The size of this brain region appears to determine whether a ram likes female or male and is determined by sex hormones while it was growing during its mothers pregnancy. == References == Category:Caprids Sheep",
 "title": "Domestic sheep"
}