{
 "id": "382277",
 "text": "== Events == * Chinese astronomers see a supernova being created in the Crab Nebula http://www.nasa.gov/multimedia/imagegallery/image_feature_567.html * February - Battle of Mortemer: The Normans defeat a French army as it is caught stealing. King Henry I of France removes his main army from Normandy as a result. * April 30 - Rosdalla, Kilbeggan Ireland: Earliest known European tornado. * July 4 - The SN 1054 supernova is seen by the Chinese, Arab and possibly Native Americans near the star ζ Tauri. For 23 days it remains bright enough to be seen in daylight. Whats left of it form the Crab Nebula (NGC 1952).Journal of Astronomy, part 9, chapter 56 of Sung History (Sung Shih) first printing, 1340. facsimile on the frontispiece of Misner, Thorne, Wheeler Gravitation, 1973. * July 16 - Cardinal Humbertus, a representative of Pope Leo IX, and Michael Cerularius, Patriarch of Constantinople, decree each other excommunication. Most historians look to this act as the final step in the initiation of the Great Schism between the Roman Catholic and Orthodox Christian Churches. In 1965, those excommunications are cancelled by Pope Paul VI and Patriarch Athenagoras when they meet in the Second Vatican Council. However, to this day each church claims to be the One Holy Catholic and Apostolic Church and each denies the other's right to that name. (See East- West Schism) * July 27 - Siward, Earl of Northumbria invades Scotland to support Malcolm Canmore against Macbeth, who took the Scottish throne from Malcolm's father, King Duncan. Macbeth is defeated at Dunsinane. * Lý Nhật Tôn, third king of the Lý Dynasty, begins to rule in Vietnam and changes the country's official name to Đại Việt. * East-West Schism in the Christian church, where the churches got separated and became the Catholic and the Orthodox christian churches. == Deaths == * February 20 - Yaroslav the Wise, prince of Kievan Rus * April 19 - Pope Leo IX (b. 1002) * September 24 - Hermannus Contractus == References ==",
 "title": "1054"
}