{
 "id": "382344",
 "text": "== Events == === By place === ==== Europe ==== * February 14 - Pope Benedict VIII recognizes and crowns Henry of Bavaria (who has ruled since 1003) as King of Germany. * April 23 - Battle of Clontarf: Gaelic Irish forces under Brian Boru defeat several allied Viking forces in Ireland, ending their power there but losing Brian in the battle. * July - Battle of Salonica fought in Greece between First Bulgarian Empire and Byzantine Empire. * July 29 - Battle of Kleidion: Basil II defeats the Bulgarian army. His later blinding of 15,000 prisoners reportedly causes Tsar Samuil of Bulgaria to die of shock. This earns Basil II the name 'Boulgaroktonos' (Bulgar-slayer). * Following the death of Sweyn I, Ethelred II returns to England and reclaims the English crown. * Cnut the Great returns to Denmark. * Holmgang (a type of duel) is declared illegal in Norway. ==== Asia ==== * In Kashmir, Abhinavagupta, the teacher of the poet Ksemendra, circulates his Greater commentary on the Pratyabhijna Darshana. ==== Africa ==== * Hammad ibn Buluggin recognises the Abbasid Caliphate, beginning the split of the Hammadids from the Zirids. === By topic === ==== Religion ==== * The Nicene-Constantinopolitan Symbol of the Faith is used for the first time during the Roman Mass after Henry II, the newly crowned Holy Roman Emperor, asks the Pope to add it together with the filioque clause. Prior to this date, the Creed was not used at all during the liturgy. * In England, Archbishop Wulfstan preaches his Latin homily, \"Wulf's Address to the English\". == Births == * Abū 'Ubayd 'Abd Allāh al-Bakrī, (d. 1094) * Princess Constance of France, daughter of Robert II the Pious == Deaths == * February 3 - Sweyn I Haraldsson Forkbeard, king of Denmark * April 23 - Brian Boru, high king of Ireland * June 25 - Athelstan Aetheling, eldest son of Ethelred the Unready * October 6 - Tsar Samuil of Bulgaria * Sigurd the Stout, Viking earl in Orkney * King Raja Raja Chola I, of the Chola Empire of southern India and great temple builder of the Chola dynasty == References ==",
 "title": "1014"
}