{
 "id": "382387",
 "text": "An explanation is an attempt to answer the question \"why\". Asked of a person, it is a question about motive: \"why did you do this?\". Asked of a natural event, it is a question about natural causes (causation). In science, an explanation is the link between an event which is a cause, and a second event, which is an effect. The phrase \"cause and effect\" refers to this. The relationship between the two events is known as causality. The philosopher Mario Bunge said, \"We do not rest content with finding facts but wish to know why they should occur rather than not\".Bunge, Mario 1967. Scientific research II: the search for truth. Berlin: Springer-Verlag. Chapter 9: Explanation. As a general rule, explanations move from what we know to what we do not know. This is important because it explains why different kinds of people may need different explanations. \"A child, a lay person and an expert may need different explanations of the same thing, since what is already familiar to them will differ\".Lacey A.R. 1970. A dictionary of philosophy. London: Routledge & Kegan Paul, p64. The asking of questions depends on language, and is peculiar to humans. It starts very soon after a child learns how to speak. A kind of game which young children play with adults is the 'why game'. Every parent gets the experience of their child asking a never-ending stream of why questions, until at last the adult says \"Well, it just is!\" There can be plenty of argument about whether or not an explanation is appropriate, and if so, whether it is correct. If one asks why the sun gives out heat and light, to say \"because it is daytime\" is not appropriate, even if it might indeed be daytime. The real answer was not known until the 20th century.Nuclear fusion in the Sun turns hydrogen into helium, resulting in the production of energy in the form of radiation. Before then peoples like the ancient Egyptians thought it was caused by a god (Aten). == Types == Different kinds of why questions need different kinds of explanations. including: === General explanations === These add something to human knowledge. * explanations which are based on a principle or theory.Achinstein, Peter 1971. Law and explanation: an essay in the philosophy of science. Oxford University Press, chapter IV Explanation, p61. ::\"It is often said that a key difference between historians and political scientists is that historians tend to construct narrative-based explanations while political scientists ... tend to construct theory-based explanations\".Elman, Colin. 2001. Bridges and boundaries: historians, political scientists, and the study of international relations. p71 === Personal explanations === A personal question like \"Why did you do that?\" clearly asks for an explanation. What that explanation might be depends on context: it all depends on circumstance.Keil, Frank C. and Wilson, Robert Andrew. 2000. Explanation and cognition. p6 This type of question about motives only applies to the people concerned. * explanations which relate to goals or purposes. ::Why are you doing that? Explanation: Because I'm going to build a boat. Many kinds of explanations are made up of more than one type. An explanation can be valid or invalid or a combination of both. Some explanations may appear reasonable, but turn out to be misleading or wrong.Blakesley, David and Hoogeveen, Jeffrey L. 2007. The Thomson Handbook. Blackwell, Oxford, p209. == Related pages== * Argument == References == Category:Causality Category:Philosophy Category:Communication",
 "title": "Explanation"
}