{
 "id": "38263",
 "text": "Ballroom dance is the name for a number of dances done in ballrooms. It usually means pairs (mostly a man and woman) dancing on the same floor as other pairs. The most important difference in style is between the modern or standard dances and the Latin dances. The modern dances are the waltz, quickstep, foxtrot, tango and Viennese waltz. The Latin dances are the cha- cha-cha, samba, rumba, paso doble, and jive.Though not a latin dance, jive is included because its dance style is similar to the others However, there are also sequence dances, where dancers move together in a pre-set pattern. All these dances can be danced socially, more or less any way people want to. As competition dances, they are organised under the rule of the World Dance Council.A rival organisation is the International Dance Sport Federation (ISDF). These competitions are danced in the International style; the techniques were developed by English dancers in the 20th century. All major international competitions are conducted under detailed regulations. There are other systems of dance regulated by national bodies. American style is one; Scottish dancing is another; Greek classical dance is another. Although the most famous dancers were Fred Astaire and Ginger Rogers, they did not dance in ballrooms. Their career together was entirely on film. Astaire danced also on the stage, and on television. The most famous American pair of ballroom dancers was Vernon and Irene Castle, who were national figures until Vernon's death in 1918. Later, Arthur Murray's chain of dance schools taught many Americans to dance. The most famous English ballroom dancer was probably Victor Silvester, who was a professional dancer and a very successful bandleader. == International style == There are ten international style ballroom dances, five standard (or modern) and five Latin: * Standard: Waltz, Quickstep, Tango, Foxtrot, Viennese waltz * Latin: Cha-cha-cha, Rumba, Samba, Jive, Paso doble Most of these are dances that started in other places, but were developed in their modern form by English dancers and dance teachers.Richardson P.J.S. 1948. The history of English ballroom dancing (1900–1945). Jenkins, London.Franks A.H. 1963. Social dance: a short history. Routledge & Kegan Paul, London. Most people do these dances for fun. When people compete against each other, the women wear formal dresses (gowns) for standard competition and short skirts for Latin. Men wear formal evening wear ('white tie and tails') for standard and informal shirts for Latin. Some people earn medals to show how they are improving. They dance in front of a judge to earn a medal at the Bronze, Silver, or Gold levels. Ballroom dance teaching and medal awards is done by Dance Teacher organisations, such as the Imperial Society of Teachers of Dancing (ISTD) or the International Dance Teachers Association (IDTA). These organisations also do ballet, stage dancing (or 'theatre dance' or 'jazz dance') and several other types of dance. Their qualifications and exams are held world-wide, even though they are English in origin. Street dance, as the name suggests, does not need a ballroom. Nevertheless, it is being taught in ballrooms, as are some other kinds of non- traditional dance. There are also some line dances, in which people dance as a group instead of with a partner. Some line dances are done to Mambo, Waltz, Paso Doble, and Samba. Some people dance in couples, but also as a group, with everyone doing the same steps. This is called formation dancing. === Competitions === thumb|right|220px|Benedetto Feruggia and Claudia Köhler, 2010 People compete at many levels, but the basic division is between amateurs and professionals. Then, amongst amateurs, there are age grades (British regulations):UK Dancesport * Juveniles, up to 12. Standard juvenile clothing is worn. * Juniors, up to 16. * Youth, up to 21. * Adult Amateur, 16 and over. * Seniors, 35+. * Over 45s. In the US, competitions may be divided according to dancing ability: Newcomer, Pre-Bronze, Bronze, Silver, Gold, Pre- Championship, and Championship. The best-known competition is the Blackpool Dance Festival, England. This has been going annually since 1920 (except for war years), and its events, like most English events, are open to the world. === American style === American style ballroom dancing is sometimes called Social style. It includes smooth and rhythm dances: * Smooth: Waltz, Tango, Foxtrot, Viennese Waltz * Rhythm: Cha Cha, Mambo, Rumba, Bolero, East Coast Swing == Movies and television shows == === Movies === * Strictly Ballroom * Shall We Dance? * Dance With Me * Dirty Dancing with Patrick Swayze and Jennifer Grey * movies with Fred Astaire and Ginger Rogers (such as Flying Down to Rio, The Gay Divorcee, Top Hat and Carefree) === Television === * Ballroom Bootcamp (US) * So You Think You Can Dance (US, UK, Belgium, Netherlands) * Dancing with the Stars (United States, Netherlands) * Strictly Come Dancing (UK) == Other ballroom dances == === Swing === * West Coast Swing * Lindy Hop * Balboa === Latin === * Salsa * Merengue * Cumbia === Other === * Argentine Tango * Polka ==Related pages== * Ball (dance) == References ==",
 "title": "Ballroom dance"
}