{
 "id": "382739",
 "text": "Long hair is a hairstyle that is mostly worn by girls and women. Boys and men may sometimes wear hair to shoulder length. Longer than that is rare for men of most cultures. Extremely long hair (usually waist length or longer) is normally only found in females. The reason is that the female hormonal system affects the growth of their hair, just as the male hormonal system supports facial hair growth. This is also the reason young females can have longer hair than older women. Hair length is measured (in centimeters or inches) from the line of the scalp on the forehead up over the highest point of the skull to the end of the hair. This method is not suitable for measuring hair length for people with a fringe. In cosmetology, hair lengths are usually described by the part of the body where the longest hair ends: chin level, shoulder length, mid-back level, waist length, hip-length, classic length (extends to almost upper thigh-length, where the legs meet the buttocks), thigh-length, knee- length and ankle/floor length hair. Hair usually takes about 2–2½ years to reach shoulder length.Hemat R.A.S. 2007. Andropathy. Urotext, p. 375 It usually takes about 4–5 years to grow to the waist (which is about 60-80 cm for most women) if left to grow. == Records == The maximum hair length that is possible to reach is about 15 cm for infants (below the age of 1), about 60 cm for children (below the age of 13), and generally 100 cm for adults. Some individuals can reach excessive lengths. Lengths greater than 150 cm are frequently observed in long hair contests. Xie Qiuping had the longest documented hair in the world, measuring 5.627 m (18 ft 5.54 in) in May 2004.Guinness World Records: Longest hair The maximum hair length depends on the length of the period of hair growth for the individual. Waist-length hair or longer is only possible to reach for women with long periods of hair growth. Hair can grow continuously for between 2 and 7 years. == Significance == Head hair is maintained by natural selection after other body hair had been greatly reduced. The hair has at least two functions: #to protect the scalp against weather (sun in the tropics, heat loss in the temperate zone) #to signal sexual attractiveness, as a secondary sex characteristic. A fine head of hair improves the chance of getting a mate and so producing children.Watson, James 2005. Darwin: the indelible stamp; the evolution of an idea. Philadelphia: Running Press, 1042. By seven to nine months, infants can tell the sexes apart based on hair length, voice pitch and faces. === Cultures of men with longer hair === Many Native American men wore long hair before the arrival of western influences on their culture. The long-term preference of females of the tribe for longer male hair would have effect by long-haired males contributing more children than short-haired males. == Related pages == *Hair style *Secondary sexual characteristics == References == Category:Hairstyles",
 "title": "Long hair"
}