{
 "id": "38284",
 "text": "Mary (born Mary Elizabeth Donaldson; 5 February 1972) is the Queen of Denmark since 2024 as the wife of King Frederik X. == Early life == Mary Elizabeth Donaldson was born in Queen Alexandria Hospital for Women in Hobart, Tasmania. She is the youngest daughter of John Dalgleish Donaldson, a professor of applied mathematics, and Henrietta Clark Donaldson. Her parents were Scots. She has two sisters and one brother. She graduated from University of Tasmania in 1994 with a bachelor's degree in Commerce and Law. On May 14, 2004, Mary and Crown Prince Frederik of Denmark were married in Copenhagen Cathedral. They have four children: Prince Christian, Princess Isabella, Prince Vincent, and Princess Josephine. The Crown Prince Couple live both in Frederik VIII’s Palace at Amalienborg and in the Chancellery House at Fredensborg Palace. == Titles and styles == * 5 February 1972 - 14 May 2004: Miss Mary Elizabeth Donaldson * 14 May 2004 - 29 April 2008: Her Royal Highness The Crown Princess of Denmark * 29 April 2008 - 14 January 2024: Her Royal Highness The Crown Princess of Denmark, Countess of Monpezat * 14 January 2024 - present Her Majesty The Queen of Denmark, Countess of Monpezat == Military Ranks == === Denmark === * Officer Cadet in the Home Guard (2008) * Sergeant in the Hone Guard (2009) * Lieutenant in the Home Guard (20 February 2009) * First Lieutenant in the Home Guard (18 September 2015) * Captain in the Home Guard (31 March 2019) * Major in the Home Guard (4 May 2023) == National Honors == * Denmark: Dame of the Order of the Elephant (9 May 2004) (R.E.) == Medals and Decorations == * Denmark: Dame of the Royal Family Decoration of Queen Margrethe II * Denmark: Recipient of the Home Guard Medal of Merit * Denmark: Recipient of the 75th Birthday Medal of Prince Henrik * Denmark: Recipient of the 350th Anniversary Medal of the Royal Danish Life Guards * Denmark: Recipient of the 70th Birthday Medal of Queen Margarethe II * Denmark: Recipient of the Ruby Jubilee Medal of Queen Margrethe II * Denmark: Recipient of the 75th Birthday Medal of Queen Margrethe II * Denmark: Recipient of the Golden Anniversary Medal of Queen Margrethe II and Prince Henrik * Denmark: Recipient of the Prince Henrik's Commemorative Medal * Denmark: Recipient of the 80th Birthday Medal of Queen Margrethe II * Denmark: Recipient of the Golden Jubilee Medal of Queen Margrethe II == Foreign Honors == * Belgium: Grand Cross of the Order of the Crown * Brazil: Grand Cross of the Order of the Southern Cross of Brazil * Bulgaria: First Class of the Order of the Balkan Mountains * Finland: Grand Cross of the Order of the White Rose of Finland * France: Grand Cross of the National Order of Merit * Greece: Grand Cross of the Order of Beneficence * Iceland: Grand Cross of the Order of the Falcon * Mexico: Grand Cross of the Order of the Aztec Eagle * Netherlands: ** Knight Grand Cross of the Order of the Netherlands Lion ** Recipient of the King Willem-Alexander Inauguration Medal * Norway: Grand Cross of the Order of St. Olav * Spain: Dame Grand Cross of the Order of Isabella the Catholic * Sweden: ** Knight of the Order of the Seraphim ** Commander Grand Cross of the Royal Order of the Polar Star ** Recipient of the 70th Birthday Medal of King Carl XVI Gustaf ** Recipient of the Golden Jubilee Badge Medal of King Carl XVI Gustaf ==Other websites== * Category:1972 births Category:Living people Category:Danish princes and princesses Category:People from Hobart Category:Dames Grand Cross of the Order of the Lion of the Netherlands",
 "title": "Queen Mary of Denmark"
}