{
 "id": "382951",
 "text": "New Super Mario Bros. U is a 2012 platform video game for the Wii U game console. It is a sequel to the 2009 game New Super Mario Bros. Wii on the Wii, which is a follow-up to the 2006 Nintendo DS game New Super Mario Bros., and the fourth game in the New Super Mario Bros. series. It was developed by Nintendo EAD Group No. 4 and published by Nintendo. It was released on November 18, 2012 in North America, on November 30, 2012 in Europe, and on December 8, 2012 in Japan. It is a follow-up to the Nintendo 3DS game New Super Mario Bros. 2 (released three months before), which is a sequel to the 2006 game and a follow-up to the 2009 game. Up to five players can play at a time. The game can be played with either the Wii Remote or the Wii U GamePad. The Wii U GamePad allows for handheld Play, where the game can be played on the controller without the use of a television screen. For the Year of Luigi, which celebrates the 30th anniversary of Luigi's first appearance in the Mario series, Nintendo released downloadable content called New Super Luigi U which was also released on the Wii U. Players play as Luigi in harder versions of the game's levels. It was released in mid-2013. It was also released as a game and not a download. A port of NSMBU, titled New Super Mario Bros. U Deluxe, was released for the Nintendo Switch on January 11, 2019. ==Plot== Mario/Luigi and his friends are at Princess Peach's castle with Peach when Bowser attacks the castle. The attack sends them flying far away from the castle. They must go through eight worlds to rescue Peach and her castle. ==New Super Luigi U== New Super Luigi U (stylised as New Super Luigi ~~Bros.~~ U) is a 2.5D side- scrolling platform video game. It was released as a downloadable DLC to this game and later a stand-alone game. == References == ==Other websites== * *New Super Mario Bros. U at MarioWiki *New Super Luigi U at MarioWiki *New Super Mario Bros. Mii at MarioWiki Category:2012 video games Category:2019 video games Category:Mario platform games Category:Cooperative video games Category:Multiplayer and single-player video games Category:Nintendo Entertainment Planning & Development games Category:Nintendo Network games Category:Nintendo Switch games Category:Pack-in video games Category:Side- scrolling platform games Category:Video game sequels Category:Video games developed in Japan Category:Wii U games",
 "title": "New Super Mario Bros. U"
}