{
 "id": "38314",
 "text": "An apartment (US English) or flat (British English) is a place to live that is only part of a larger building. Usually it is a group of rooms on one floor of a building in a city, where land is too expensive for people to have separate houses. An apartment that is separately owned is called a condominium or \"condo\". A lesser known ownership structure for apartments is housing cooperatives. A rental apartment has an owner called a landlord who charges money (\"rent money\" or \"rent\") from the people who live there (\"tenants\"). An apartment building or block of flats may have a few or many apartments. Each apartment is a separate room or set of rooms for people to live in. Sometimes an apartment will only be one small room, and tenants will have to share other rooms like the bathroom and kitchen. Other times, tenants will only share an entrance hallway with different doors leading to each apartment. This shared area is often cared for by a janitor or caretaker. An apartment complex or housing estate is a group of apartment buildings. In an apartment complex, all of the apartment buildings are usually made in a similar way. In many apartments, the tenants only pay the landlord for renting the apartment, and they have to pay other people to provide utilities like electricity and heat. In some apartments, especially the ones in apartment complexes, the tenants will have to pay more to rent the apartment, but in return the landlord will give them things like utilities, laundry rooms (where people wash their clothing), exercise rooms, and parking spaces for bicycles, motorcycles, and cars. An apartment complex may also provide recreational facilities such as a swimming pool, mini golf course, movie theater, bowling alley and others Apartment buildings are more common in cities than houses, because there is less room in a city to fit buildings. Building a house for one family in a dense city would cost an enormous amount of money compared to building a house outside of a city. ==Kinds of apartments== In a studio apartment, there is a single large room instead of separate rooms for the living room, bedroom, and other areas. Usually the bathroom is a separate room. Apartments can be classed according to how many bedrooms and bathrooms they have (e.g. one bedroom apartment, two bedroom apartment one bed one bath apartment, etc.). Apartments can also be named by the type of building they are in (like high- rise apartments, etc.) A garden apartment building is usually no more than three stories high and grouped around a courtyard. Sometimes a garden apartment has its own building entrance. Communal apartments are single-room units in countries that practice or practiced Marxist-Leninism. In these apartments, all the units on a floor share a bathroom and kitchen Loft apartments are units converted from a warehouse or factory. In the United Kingdom, a bedsit is a one-room apartment that does not have its own bathroom or kitchen. The North American equivalent is the single room occupancy. Because of the lack of private kitchens and bathrooms, bedsits and single room occupancies are not self contained dwelling units. A duplex apartment is on two floor levels Triplex apartments have three levels. Penthouses are luxurious apartments on the top floors of the building. Category:Accommodations",
 "title": "Apartment"
}