{
 "id": "383105",
 "text": "Edward Irving \"Ed\" Koch (December 12, 1924 - February 1, 2014) was an American lawyer, politician, movie critic, and television personality. He was the 105th mayor of New York City from January 1, 1978 through December 31, 1989. He was also part of the House of Representatives. He was a judge for the television judge show The People's Court. ==Early life== Koch was born on December 12, 1924 in The Bronx, New York to Yetta (née Silpe) and Louis Koch. They were a Polish-Jewish family from New Jersey. He was raised in both The Bronx and in Newark, New Jersey. Koch studied at the City College of New York and at New York University School of Law. ==Career== Throughout his career, Koch signed many bills including one that allowed gays and lesbians to marry in New York City. Another well-known act he did in New York was that he helped try to find a cure for AIDS. He had many preventions and awareness programs. He was a Democrat. He ran for Governor of New York, but lost the election. His career began to slowly come to an end after Koch suffered a stroke in 1987. When he was a representative, he supported the Civil Right Act during the 1960s. ==Personal life== Koch never married and had no children. Many thought Koch was gay30th Anniversary Issue / Larry Kramer: Queer Conscience because of the pro-LGBT policies he supported and because he never married. This made Koch angry and told everyone he was not.Koch, Edward. \"Ed Koch: Hizzoner\",New York, April 6, 1998 (published online March 30, 1998). Retrieved May 9, 2009. ==Death== Koch went to the hospital on January 19, 2014 and left on January 26. He went back to the hospital on January 31, 2014 because he had chest pains and liquid in his lungs. The next day on the morning of February 1, 2014, Koch died in Manhattan, New York from heart failure, aged 88. ===Burial=== He was buried at Trinity Cemetery and Mausoleum in Manhattan, New York on February 4, 2014. Many people went to his funeral including former United States President Bill Clinton. His marker are written in the last words of Daniel Pearl. He has a Star of David somewhere in his grave. The epitaph of his grave says: \"He was fiercely proud of his Jewish faith. He fiercely defended the City of New York, and he fiercely loved its people. Above all, he loved his country, the United States of America, in whose armed forces he served in World War II\". ==Quotes== A practiced public speaker since his days stumping for Adlai Stevenson, Koch was well known for his quips and one liners. A few include: (On the occasion of his primary loss to David Dinkins) \"The people have spoken...and they must be punished.\" \"I'm the sort of person who will never get ulcers. Why? Because I say exactly what I think. I'm the sort of person who might give other people ulcers.\" \"If you agree with me on nine out of 12 issues, vote for me. If you agree with me on 12 out of 12 issues, see a psychiatrist.\" ==References== ==Other websites== * Ed Koch on Twitter * * * Voices on Antisemitism Interview with Edward Koch from the U.S. Holocaust Memorial Museum * Edward I. Koch's page on NewsMax.com * Podcasts of Ed Koch commentaries at Bloomberg.com * Edward I. Koch Collection of La Guardia and Wagner Archives – Koch's mayoral records as well as personal papers and photographs * Former Mayor of New York Passes Away at 88 Category:1924 births Category:2013 deaths Category:American activists Category:Lawyers from Newark, New Jersey Category:American movie critics Category:American television personalities Category:Deaths from heart failure Category:Jewish activists Category:Jewish American politicians Category:Jewish lawyers Category:Mayors of New York City Category:Politicians from Newark, New Jersey Category:Politicians from New York City Category:United States representatives from New York (state) Category:Democratic Party (United States) politicians Category:Writers from Newark, New Jersey Category:Writers from New York City Category:Lawyers from New York City",
 "title": "Ed Koch"
}