{
 "id": "38320",
 "text": "Gilmore Girls is an American television series. It is about a single mother Lorelai Victoria Gilmore (Lauren Graham) and her teenage daughter Lorelai “Rory” Leigh Gilmore (Alexis Bledel). They live together in a fictional small town called Stars Hollow, Connecticut. The show aired on television from October 5, 2000 until May 15, 2007. Gilmore Girls was created by Amy Sherman- Palladino. She also acted as the executive producer during the first six series with her husband Daniel Palladino. The show first aired on The WB network and moved to the CW network when the WB merged with UPN. Gilmore Girls episodes are an hour long. It has very witty storylines that explored family, generational divides, love, and friendship. It has the makings of a comedy because of the fast-paced dialogue, the wild references and sense of humour that was in the program. Gilmore Girls is set in Stars Hollow, a fictional town where everyone knew each other and many strange types of people walked the streets. ==Characters== Character Actor Lorelai Gilmore Lauren Graham Rory Gilmore Alexis Bledel Luke Danes Scott Patterson Emily Gilmore Kelly Bishop Richard Gilmore Edward Herrmann Sookie St. James Melissa McCarthy Lane Kim Keiko Agena Mrs. Kim Emily Kuroda Paris Geller Liza Weil Jess Mariano Milo Ventimiglia Kirk Gleason Sean Gunn Logan Huntzberger Matt Czuchry Dean Forester Jared Padalecki Michel Gerard Yanic Truesdale Jackson Belleville Jackson Douglas Taylor Doose Michael Winters Babette Dell Sally Struthers Tristan DuGrey Chad Michael Murray Jason Stiles Chris Eigeman == Other websites == * Official Site * * Episode reviews and comments from TelevisionWithoutPity.com Category:2000 American television series debuts Category:2007 American television series endings Category:2000s American television series Category:American drama television series Category:American teen drama television series Category:Movies set in Connecticut Category:Television series about families Category:Television series set in Connecticut Category:WB network shows Category:English-language television programs Category:The WB original programming",
 "title": "Gilmore Girls"
}