{
 "id": "383240",
 "text": "The Boeing 737 Classic is a family of Boeing 737s. The Boeing 737 Classic series is made up of the Boeing 737-300, -400 and -500. These planes were not called the 737 Classics until the Boeing 737 Next Generation family was made. Before the 737 Next Generation family, the 737 Classics were called the 'new generation'.Shaw, 1999, pg. 7. The 737 Classics were made from 1984 to 2000. 1,988 aircraft were made. You can identify a 737 classic by the smaller windows on top of the main windshield ==Development and design== After the Boeing 737-200 Advanced was made, Boeing wanted to make the 737 carry more passengers and fly further. Boeing began designing the 737 Classics in 1979. In 1980, information about the 737 Classic series was given at the Farnborough Airshow.Endres, 2001, p.126. The 737 Classics had CFM56 turbofan engines. These engines were a very big improvement. They burned less fuel and made less noise. However, when the 737 is on the ground, the bottom of the plane is quite close to the ground. This meant that if the engines were not changed, they would be too close to the ground. Boeing and CFMI solved this by putting the engine in front of the wing, instead of below it. They also moved some parts of the engine to the side of the engine, instead of the bottom. These changes mean that the front of the 737 engines are not circles.Endres, 2001, p.128. The wing had many changes made to it. The tip of the wing was made longer by . The flaps were also changed. The cockpit was made more modern and the passenger cabin had improvements made. The improvements were similar to improvements made to the Boeing 757. ==Types of 737 Classic== ===737-300=== The prototype of the 737-300 was finished on January 17, 1984. It made its first flight on 24 February 1984.Shaw, 1999, pg.10. The plane became allowed to fly on November 14, 1984. USAir got the first 737-300 on 28 November.Endres, 2001, p.129. The plane was very popular. Boeing got 252 orders for it in 1985. It got over 1000 in total.Shaw, 1999, pg.7 The 737-300 series was made until 1999. The last plane was delivered to Air New Zealand on 17 December 1999. In December 2008, Southwest Airlines asked Boeing to fit the 737-300 with new technology to make it more similar to the 737-700. ===737-400=== The 737-400 was made to fill the gap in between the 737-300 and the 757-200. Its main rivals were the Airbus A320 and McDonnell Douglas MD-80. It was 10 ft (3.45 m) longer than the 737-300. It could carry 168 passengers. It had a bumper on the tail so that it would not touch the ground while it was taking off.Shaw, 1999, pg. 13. The prototype was finished on January 26, 1988. It flew for the first time on 19 February 1988. The 737-400 went into service on September 15, 1988. The first airline to use it was Piedmont Airlines. The 737-400F was a type of 737-400 designed to carry cargo. It was not made by Boeing, though. Airlines turned 737-400s into cargo aircraft by themselves. Alaska Airlines was the first to change one of their 737-400s to a 737-400F. It could carry 10 pallets. Alaska Airlines also changed five more 737-400s to carry half passengers and half cargo. These 737-400 aircraft are now being used. The 737-400 has been replaced by the 737-800. ===737-500=== The 737-500 was supposed to be a replacement for the 737-200. It was only made because customers wanted it. The -500 is 1 ft 7 in (47 cm) longer than the 737-200. It can carry up to 132 passengers. Both modern and older cockpits could be installed on the 737-500.Shaw, 1999, pg 14. Using the CFM56-3 engine burned a lot less fuel than the engines used on the 737-200s. The first airline to order the 737-500 was Southwest Airlines.Shaw, 1999, pg 40. The -500 flew for the first time on 30 June 1989. A prototype had to fly for 375 hours so that the 737-500 could be allowed to fly. On February 28, 1990, Southwest got the first plane. The 737-500 has been replaced with the 737-600. ==Users of the 737 Classic== ===Civilian=== Boeing stopped making the 737 Classic in 2000. 1,651 Boeing 737 Classic aircraft are in service. This includes 879 -300s, 419 -400s, and 353 -500s.\"World Airliner Census\". Flight International, pp. 26–49. August 24–30, 2010. This information is correct as of July 2010. ===Military=== Many countries use the 737 Classic as a military plane. Some of these are: * Brazil, Chile, Colombia, India (Indian Air Force), Indonesia, Kuwait, Mexico, Niger, Peru, Philippines (Philippine Air Force), South Korea, Republic of China on Taiwan (ROC's Air Force One), Thailand (Royal Thai Air Force), United Arab Emirates, and Venezuela. ===Deliveries=== Type Total 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 737-300 1113 29 52 65 37 52 54 54 57 69 67 89 141 137 120 83 7 737-400 486 2 9 33 33 21 13 32 68 82 56 63 57 17 737-500 389 4 31 34 18 24 35 30 79 90 44 Total 1988 2 42 116 132 76 89 121 152 218 215 174 146 158 137 120 83 7 * Source: == Accidents == The Boeing 737 Classic has had 26 hull-loss accidents. There has been 1,040 deaths as of January 2010. On February 1, 1991, a US Air 737-300 under flight 1493 was landing at LAX when it collided with a SkyWest Fairchild Swearingen Metroliner. The SkyWest flight was told to taxi through a runway that the US Air flight was landing on. Upon landing the US Air flight crashed into the SkyWest flight. Everyone on board the SkyWest flight died. In total 35 people died and 66 people survived with 23 people obtaining injuries. On 14 August 2005, Helios Airways Flight 522 suffered a fuel exhaustion and a loss of pressurization and crew incapacitation, due to hypoxia. The airplane suddenly crashed in hills near Grammatiko, Greece. There are no survivors among 121 people (115 passengers and 6 crew members) on board. == Features == Measurement 737-300shaw, 1999, p 20. 737-400 737-500 Cockpit crew Two Two Two Number of passengers 149 (1-class, dense) 140 (1-class, typical) 128 (2-class, typical) 168 (1-class, dense) 159 (1-class, typical) 146 (2-class, typical) 132 (1-class, dense) 122 (1-class, typical) 108 (2-class, typical) Length 33.4 m (109 ft 7 in) 36.5 m (119 ft 6 in) 31.1 m (101 ft 8 in) How high the plane can fly 37,000 ft 37,000 ft 37,000 ft Speed while cruising (Mach) 0.74 0.74 0.74 Top speed (Mach) 0.82 0.82 0.82 How far the plane can travel when full 4,204 km (2,270 NM) 4,204 km (2,270 NM) 4,444 km (2,402 NM) Engine type (x2) CFM56-3B-1 CFM56-3B-2 CFM56-3B-1 Sources: Boeing == Related pages == == References == ;Notes ;References * Endres, Günter. The Illustrated Directory of Modern Commercial Aircraft. Osceola, Wisconsin: MBI Publishing Company, 2001. . * Sharpe, Michael and Shaw, Robbie. Boeing 737-100 and 200. Osceola, Wisconsin: MBI Publishing Company, 2001. . * Shaw, Robbie. Boeing 737-300 to 800]. Osceola, Wisconsin: MBI Publishing Company, 1999. . * Shaw, Robbie. Boeing Jetliners. London, England: Osprey, 1995. . ==Other websites== * 737 page on Boeing.com 737 Classic",
 "title": "Boeing 737 Classic"
}