{
 "id": "383628",
 "text": "The PlayStation 4 (also known by the abbreviated name PS4) is the fourth home video game console produced by Sony Computer Entertainment and is not compatible with the PlayStation 3. It was officially announced at a press conference on February 20, 2013 and launched on November 15, 2013. The PlayStation 4 was discontinued in Japan on 5 January 2021. Sony focused on \"social\" aspects as a major feature of the console. Although the PS4 has improved social functionality, the features are optional and can be disabled. Users can create or join community groups based on personal interest. Gamers can watch live gameplay of games which their friends are playing. Online friends can join a play session via streaming.Isabelle Tomatis. PS4's Share Play feature in action , blog.eu.playstation.com, October 24, 2014.W ==History== ===Presentation=== Sony invited press to a New York City event on 20 February 2013. The company announced the event on Thursday 31 January, inviting us to \"see the future\". ===Add-ons=== In 2016, Sony unveiled the PlayStation VR, a virtual reality headset add-on for the PlayStation 4. The PlayStation VR is not included in the pack. It comes with a Mono Headset. The PlayStation VR also has a PlayStation Camera. ==Models== There are three different models of the PS4: *PS4 (2013, first model): 1.84 TFLOPS, 8 GB GDDR5 RAM, 256 MB DDR3 RAM, 2 x USB 3.0, 500 GB storage, 399 €. *PS4 Slim (2016, replaced PS4): Same technical specifications, smaller housing, more quiet and more energy efficient in operation, 500 GB or 1 TB storage, 249 € (500 GB model), 299 € (1 TB model). *PS4 Pro (2016, more powerful model): 4.198 TFLOPS, 8 GB GDDR5 RAM, 1 GB DDR3 RAM, more powerful GPU, higher clocked CPU, 3 x USB 3.1, 1 TB storage, 399 €. ==Related pages== *PlayStation *PlayStation 2 *PlayStation 3 *PlayStation 5 *Sony *PlayStation Portable also known as PSP. *PlayStation Vita ==References== Category:Sony Category:PlayStation (brand) Category:Sony consoles",
 "title": "PlayStation 4"
}