{
 "id": "383780",
 "text": "Edwin John \"Eddie\" Fisher (August 10, 1928 - September 22, 2010) was an American singer, actor, writer, musician, and entertainer. Fisher had made hundreds of recording albums. Fisher was born on August 10, 1928 in Philadelphia, Pennsylvania to a Russian-Jewish family. He studied at Thomas Junior High School, South Philadelphia High School, and at Simon Gratz High School. It was during high school many people discovered that Fisher had a talent for singing. Fisher was married to Debbie Reynolds from 1955 until they divorced in 1959. They had two children; including actress Carrie Fisher. Then he was married to Elizabeth Taylor from 1959 until they divorced in 1964. Then he was married to Connie Stevens from 1967 until they divorced in 1969. They had two children. Then he was married to Terry Richard from 1975 until they divorced in 1976. Then he was last married to Betty Lin from 1993 until her death in 2001. Fisher died on September 22, 2010 in Berkeley, California after going into surgery, aged 82. Fisher broke his hip thirteen days before. He had hearing and seeing problems. His remains were cremated and were later buried. He was buried at Cypress Lawn Memorial Park next to his wife Betty Lin. ==References== ==Other websites== * * *Thinking Of You: Eddie Fisher on The Interlude Era site *New York Times Obituary *Eddie Fisher: Life and Times – slideshow by Life magazine Category:1928 births Category:2010 deaths Category:Actors from Philadelphia Category:American movie actors Category:American radio actors Category:American radio personalities Category:American stage actors Category:American television actors Category:American television personalities Category:American voice actors Category:Deaths from surgical complications Category:Jewish American actors Category:Jewish American musicians Category:Jewish American writers Category:Musicians from Philadelphia Category:Singers from Philadelphia Category:Writers from Philadelphia",
 "title": "Eddie Fisher"
}