{
 "id": "38411",
 "text": "Subtropical Storm Nicole was the fourteenth named storm and first subtropical cyclone to form during the 2004 Atlantic hurricane season. It was the first subtropical storm to be given a name from the standard hurricane naming list and be considered a subtropical cyclone in real-time. The storm never made landfall as a subtropical cyclone, though its remnants affected Anticosti Island, just off of the provinces of Prince Edward Island and Quebec. ==Storm history== Nicole began with an upper tropospheric trough and a decaying frontal system over the southwestern North Atlantic in early October. By October 8, a broad area of surface low pressure formed about 400 miles (640 km) southeast of Bermuda. The system soon began to produce gale-force winds, affecting Bermuda on October 9. Early the next day, the National Hurricane Center said that the low-pressure system had sufficient tropical characteristics to be classified as a subtropical storm, and was given the name Nicole. Steadily tracking over cooler waters toward the northwest, Nicole lost all of its tropical characteristics and was declared fully extratropical on October 11, 345 miles (555 km) south-southeast of Halifax, Nova Scotia. The Canadian Hurricane Centre continued to issue advisories on what was then called Post-tropical Storm Nicole, which had now merged with a stronger mid- latitude cyclone. This weather system produced heavy rainfall across the Maritimes near Anticosti Island on October 14. ==Impact== No damage or fatalities were reported, for that Nicole never made landfall or directly affected any land areas. It brought light rain to Bermuda and briefly threatened it before heading northeast. Its remnants combined with a stronger cyclone affecting Anticosti Island in Canada; however, no significant damage was caused in the area. == Records == Since 2002, subtropical storms have been given names from the same naming sequence as tropical storms. As such, Nicole was the first named subtropical storm to get a name under this rule. Many subtropical cyclones between 1975 and 2001 with a sufficiently tropical nature were either considered fully tropical storms or numbered. Initially, however, the phonetic alphabet was used to name subtropical cyclones. ==Related pages== *Subtropical cyclone *List of Atlantic hurricane seasons ==References== == Other websites == For official forecasts, see the NHC's public advisory archive on Subtropical Storm Nicole. * NHC 2004 Tropical Cyclone Archive *U.S. Rainfall from Tropical Cyclones in 2004 * NOAA hurricane season outlook * William Gray's 2004 preseason forecast * Tropical cyclone images and movies - Northern hemisphere 2004, from the United Kingdom Met Office * Effects of the Third-Quarter Hurricanes on Income Measures * Gary Padgett May 2004 Summary - Hispaniola Low * The Hurricane Hut - Detailed Information on All the Storms of 2004 * Nicole's Tropical Cyclone Report Category:Subtropical cyclones Category:Hurricanes in Bermuda Category:2004 Atlantic hurricane season Category:2004 in Canada Category:2000s in Bermuda Category:2004 in the United States",
 "title": "Subtropical Storm Nicole (2004)"
}