{
 "id": "384331",
 "text": "Mehmet Cengiz Öz (born June 11, 1960), also known as Dr. Oz, is an American doctor, politician, writer, educator, and television personality who has been the 17th and current Administrator of the Centers for Medicare and Medicaid Services since 2025. He has a television show, The Dr. Oz Show. He helps people with health and weight. He won two Emmy Awards, in 2010 and in 2011. He also has Turkish citizenship. A Republican, Oz unsuccessfully ran for the United States Senate in 2022. In November 2024, he was picked by President- elect Donald Trump to run the Centers for Medicare & Medicaid Services. He was confirmed by the U.S. Senate in April 2025. ==Television career== In 2003, Oprah Winfrey was the first guest on the Discovery Channel series Second Opinion with Dr. Oz, and he was a regular guest on The Oprah Winfrey Show. In 2009, The Dr. Oz Show first aired. It ran for 13 seasons. Oz was a supporter of pseudoscience and often showed false medical claims. ==Political career== ===U.S. Senate campaign=== In November 2021, Oz announced that he was running in the 2022 U.S. Senate election in Pennsylvania as a Republican. He won the nomination in June 2022, becoming the first Muslim to be nominated by either major party for U.S. Senate. He was defeated in the general election by John Fetterman. ===Centers for Medicare & Medicaid=== On November 19, 2024, Oz was picked by President-elect Donald Trump to run the Centers for Medicare & Medicaid Services. On April 3, the U.S. Senate voted 53–45 to confirm Oz as CMS administrator. ==Personal life== Öz was born on June 11, 1960 in Cleveland, Ohio to a Turkish family. He studied at Tower Hill School, at Harvard University, at Wharton School of the University of Pennsylvania, and at University of Pennsylvania School of Medicine. Oz served in the Turkish Army during the 1980s for 60 days of mandatory training. Öz married his wife Lisa Lemole in 1985. They have four children. He now lives in Bryn Athyn, Pennsylvania. ==Notes== ==References== ==Other websites== * * Dr. Oz Show * Columbia University Department of Surgery profile Category:Living people Category:1960 births Category:American television personalities Category:Educators from Wilmington, Delaware Category:Writers from Wilmington, Delaware Category:Politicians from Wilmington, Delaware Category:Writers from Cleveland Category:Politicians from Cleveland Category:Writers from Pennsylvania Category:Politicians from Pennsylvania Category:Republican Party (United States) politicians Category:Emmy Award winners Category:Educators from Pennsylvania Category:Educators from Cleveland",
 "title": "Mehmet Oz"
}