{
 "id": "384421",
 "text": "Tracy Chapman (born March 30, 1964) is an American singer-songwriter. She was born in Cleveland, Ohio. She has won four Grammy Awards. Her most famous songs are \"Fast Car\" and \"Give Me One Reason.\" These songs went to the top of music charts in Canada. They also went high on the Billboard charts (United States). She has released 8 albums. Chapman is a feminist. She has never said what her sexuality is, but she dated Alice Walker in the mid 1990s. == Career == Chapman went to Tufts University. When she was a student there, she played music in public. In 1985, Chapman played music at a Linda Tillery concert. Another student from Tufts heard her playing music at the concert. The student's father was Charles Koppelman, a music producer. Koppelman thought that Chapman made good music. After Chapman graduated from the university, Koppelman helped her join Elektra Records. She released her first album in 1988. It was named Tracy Chapman. Many critics liked the album, and it was very popular. She started playing more music at concerts. On June 11, 1988, she performed at a concert for Nelson Mandela's 70th birthday. Stevie Wonder was at the concert, but he did not play any music. This was because he had problems with his music equipment. Wonder was not able to play any music when it was time for him to. Because of this, Chapman played during Wonder's time. She played the song \"Fast Car\", and it became very popular. Her album sold many copies, and she won three Grammy Awards for it. \"Fast Car\" went on the Billboard Hot 100, an American music chart. Two other songs from the album, \"Talkin' 'bout a Revolution\" and \"Baby Can I Hold You\", also went on the chart. Chapman made a second album. This album was named Crossroads. It was released in 1989. It did not sell as many copies as her first album did. However, it was certified platinum by the RIAA. After Crossroads, she made more albums. In 1992, she released Matters of the Heart. Her fourth album was named New Beginning. It was released in 1995. It was more successful than her second and third albums. Over 5 million copies of it were sold in the United States. The album had a song named \"Give Me One Reason\" on it. This song won a Grammy Award for Best Rock Song. The song was number three on the Billboard Hot 100. Chapman did not make any music for four years. In 2000, she released her fifth album. It was named Telling Stories. Her sixth album was released in 2002. It was named Let it Rain. Both of these albums were certified gold. On November 2015, she released an album named Greatest Hits. This was a greatest hits album. In 2018, Chapman sued Nicki Minaj for copyright infringement. Chapman said that Minaj sampled her song \"Baby Can I Hold You\" without Chapman saying that she could. Chapman also said she told Minaj she could not sample the song many different times. The lawsuit said that Minaj did copyright infringement because she used \"Baby Can I Hold You\" in her song, \"Sorry\". She also sold copies of \"Sorry\". In September 2020, a judge said that Minaj using the sample in the song was fair use. However, the judge also said that the lawsuit should go to court because Minaj sold copies of the song with the sample in it. In January 2021, Minaj paid Chapman $450,000. This ended the lawsuit. == Studio albums == * Tracy Chapman (1988) * Crossroads (1989) * Matters of the Heart (1992) * New Beginning (1995) * Telling Stories (2000) * Let It Rain (2002) * Where You Live (2005) * Our Bright Future (2008) == References == == Other websites == * Official website * Category:African- American musicians Category:American feminists Category:American guitarists Category:American singer-songwriters Category:Brit Award winners Category:American Grammy Award winners Category:Singers from Cleveland Category:1964 births Category:Living people",
 "title": "Tracy Chapman"
}