{
 "id": "384500",
 "text": "The classification of brachiopods is being discussed at present.Carlson S.J 2001. Ghosts of the past, present, and future in Brachiopod systematics. Journal of Paleontology 75 (6): 1109–1118. The following is an overview of the different schemes which are proposed. The \"traditional\" classification was defined in 1869.ITIS: Integrated Taxonomic Information System. Retrieved 16 Nov 2009 Two further approaches were established in the 1990s:Ax P. 2003. Multicellular animals: order in nature system made by man. Springer. *In the \"traditional\" classification, the Articulata have toothed hinges between the valves, while the hinges of the Inarticulata are held together only by muscles.87–93Ruppert E.E; Fox R.S. & Barnes R.D 2004. Invertebrate zoology, 821–829, \"Brachiopoda\". 7th ed. Brooks/Cole. *A classification devised in the 1990s, based on the materials of which the shells are based, united the Craniida and the \"articulate\" brachiopods in the Calciata, which have calcite shells. The Lingulida and Discinida, combined in the Lingulata, have shells made of chitin and calcium phosphate. *A three-part scheme, also from the 1990s, places the Craniida in a separate group of its own, the Craniformea. The Lingulida and Discinida are grouped as Linguliformea, and the Rhynchonellida and Terebratulida as Rhynchonelliformea.Milsom C. & Rigby S. 2009. Brachiopods. Fossils at a Glance, Wiley, 37. Williams A; Carlson C.H.C. & Brunton S.J. (eds) 2000. Outline of suprafamilial classification and authorship. In Brachiopoda. Geological Society of America and The University of Kansas. == Principles == Underlying the discussion are some basic principles:Halanych K.M 2004. The new view of animal phylogeny. Annual Review of Ecology, Evolution, and Systematics 35: 229–256. #Traditional phylogeny (and hence taxonomy) was based on: ##overall body architecture, the idea of a body 'plan'. ##the idea that evolution went from simple to complex. ##certain basal features of embryology. #Phyla (et cetera) are man-made concepts which are meant to mirror our understanding of the reality we see. However, we now know that morphological characters (traits) are more changeable than was previously thought. #Molecular data are more objective, and can be decided with more certainty than data on morphology. Much more is now known about molecular sequences than is known about the evolution of morphology. Thus, evidence from molecular sequencing is used to develop classifications which better reflect evolution. Three high-level classifications of brachiopods. \"Traditional\" classification. Inarticulata Articulata \"Calciata\" approach. Lingulata Calciata Three-part approach. Linguliformea Craniformea Rhynchonelliformea Orders Lingulida. Discinida. Craniida. Terebratulida. Rhynchonellida. Hinge No teeth Teeth and sockets Anus On front of body, at end of U-shaped gut None Pedicle Contains coelom (~cavity) with muscles running through No pedicle No coelom, muscles where joins body Long, burrows Short, attached to hard surfaces None, cemented to surface Short, attached to hard surfaces. Periostracum (surface layer of shell) Glycoprotein and chitin Chitin Proteins Primary (middle) mineralized layer of shell Glycosaminoglycans and apatite (calcium phosphate) Calcite (a form of calcium carbonate) Inner mineralized layer of shell Collagen and other proteins, chitinophosphate and apatite (calcium phosphate) Calcite Proteins and calcite Chaetae (stiff hairs) around opening of shells Yes. No. Yes. Coelom fully divided Yes. No. Yes. About 330 living species are recognized, grouped into over 100 genera. The great majority of modern brachiopods are rhynchonelliforms (Articulata, but excluding Craniida).Cohen B.L 2006. Brachiopoda. In Encyclopedia of life sciences. Wiley Online Library (abstract). == References == Classification Category:Taxonomy",
 "title": "Brachiopod classification"
}