{
 "id": "384598",
 "text": "John Edgar Hoover (January 1, 1895 - May 2, 1972) was an American government official. He was the first Director of the Federal Bureau of Investigation (FBI) of the United States. He was chosen as director of the Bureau of Investigation because he helped start it. He was the director until his death in 1972 at age 77. According to President Harry S Truman, Hoover transformed the FBI into his private secret police force. Truman stated that \"we want no Gestapo or secret police. FBI is tending in that direction. They are dabbling in sex-life scandals and plain blackmail. J. Edgar Hoover would give his right eye to take over, and all congressmen and senators are afraid of him\".Anthony Summers, \"The secret life of J Edgar Hoover, The Guardian, Sunday January 1 2012 Hoover had the largest collection of pornography in history.Revealed: J Edgar's secret porn stash Some adult movies included photos of Joan Crawford, Frank Sinatra, Warren Beatty, and Tony Curtis. Hoover was born on January 1, 1895 in Washington, D.C. He studied at George Washington University. Many say Hoover was homosexual but he never admitted it.'Gay' Probe of LBJ Aide by Washington Associated Press at NY Post newspaper February 20, 2009 It is unknown if Hoover and his second-in-command Clyde Tolson were ever in a relationship. Hoover died on May 2, 1972 in Washington, D.C. from heart failure, aged 77. ==Early Life== J. Edgar Hoover was born on New Year's Day in Washington, DC. His parents were Dickerson Naylor Hoover (1856-1921) and Anna \"Annie\" () Hoover. Dickerson Hoover's family was English and German. Annie Hoover's family was Swiss. J. Edgar Hoover was the youngest of four children. He never had a birth certificate until he was 43, even though Washington, D.C. required them.Hoover had 7 Children His childhood home was near Seward Square. The house no longer exists because a United Methodist church was built there. However, there is a stained glass window in the church that honors him. ==References== ==Other websites== * StraightDope.com – 'The Straight Dope: Was J. Edgar Hoover a crossdresser?' * FBI file on J. Edgar Hoover * J. Edgar Hoover Appointment and Phone Logs * Time.com – 'The Truth about Hoover', December 22, 1975 * Wall Street Journal – 'Hoover's Institution', Laurence H. Silberman, July 20, 2005 * Assassination Records Review Board – Final Report: 1998 * Zpub.com – 'J. Edgar Hoover Biography' * J. Edgar Hoover's Watching You – slideshow by Life magazine * Category:1895 births Category:1972 deaths Category:Deaths from heart failure Category:Directors of the Federal Bureau of Investigation Category:Politicians from Washington, D.C. Category:Anti-communists",
 "title": "J. Edgar Hoover"
}