{
 "id": "385019",
 "text": "The Speaker of the Lok Sabha is the presiding officer of the lower house of the Parliament of India, known as the Lok Sabha. The role of the Speaker is the same as in other countries which use the Westminster system of government. The speaker is elected in the very first meeting of the Lok Sabha after the general elections. He or she is chosen from the members of Lok Sabha. The speaker serves for a term of five years. The current speaker is Om Birla. He is the Member of parliament from Rajasthan. ==List of Speakers== No. Name Portrait Term Term Term Term Party Party No. Name Portrait From To Length Lok Sabha Party Party 1 Ganesh Vasudev Mavalankar Ahmedabad 15 May 1952 27 February 1956 1st Indian National Congress 2 M. A. Ayyangar Chittoor 8 March 1956 10 May 1957 1st Indian National Congress 2 M. A. Ayyangar Chittoor 11 May 1957 16 April 1962 2nd Indian National Congress 3 Hukam Singh Patiala 17 April 1962 16 March 1967 3rd Indian National Congress 4 Neelam Sanjiva Reddy Hindupur 17 March 1967 19 July 1969 4th Indian National Congress 5 Gurdial Singh Dhillon Tarn Taran — 8 August 1969 19 March 1971 4th Indian National Congress 5 Gurdial Singh Dhillon Tarn Taran — 22 March 1971 1 December 1975 5th Indian National Congress 6 Bali Ram Bhagat Arrah 15 January 1976 25 March 1977 5th Indian National Congress (4) Neelam Sanjiva Reddy Nandyal 26 March 1977 13 July 1977 6th Janata Party 7 K. S. Hegde Bangalore South 21 July 1977 21 January 1980 6th Janata Party 8 Balram Jakhar Ferozepur 22 January 1980 27 October 1984 7th Indian National Congress 8 Balram Jakhar Sikar 16 January 1985 18 December 1989 8th Indian National Congress 9 Rabi Ray Kendrapara 19 December 1989 9 July 1991 9th Janata Dal 10 Shivraj Patil Latur 10 July 1991 22 May 1996 10th Indian National Congress 11 P. A. Sangma Tura 23 May 1996 23 March 1998 11th Indian National Congress 12 G. M. C. Balayogi Amalapuram 24 March 1998 19 October 1999 12th Telugu Desam Party 12 G. M. C. Balayogi Amalapuram 22 October 1999 3 March 2002 13th Telugu Desam Party 13 Manohar Joshi Mumbai North Central 10 May 2002 2 June 2004 13th Shiv Sena 14 Somnath Chatterjee Bolpur 4 June 2004 31 May 2009 14th Communist Party of India (Marxist) 15 Meira Kumar Sasaram 4 June 2009 4 June 2014 15th Indian National Congress 16 Sumitra Mahajan Indore 6 June 2014 16 June 2019 16th Bharatiya Janata Party 17 Om Birla Kota 19 June 2019 Incumbent 17th ==References== *",
 "title": "Speaker of the Lok Sabha"
}