{
 "id": "38556",
 "text": "Brother Bear is a 2003 traditionally-animated musical fantasy comedy-drama movie produced by Walt Disney Feature Animation and released by Walt Disney Pictures on November 21, 2003. It is about a prehistoric human named Kenai who turns into a bear and discovers brotherhood. The 43rd animated feature in the Disney animated features canon, it was originally titled Bears, and was the third and final Disney animated movie produced mainly by the Feature Animation studio at Disney-MGM Studios in Orlando, Florida, that studio was shut down in March 2004, not long after the release of this movie in favor of computer animated features.https://www.imdb.com/title/tt0328880/news Brother Bear (2003) - News The movie received an Academy Award nomination for Best Animated Feature, but lost to Finding Nemo. A sequel, Brother Bear 2, was released directly-to-DVD on August 29, 2006. As a result, Brother Bear was the final Disney animated movie to have a direct-to-video sequel. ==Plot== In prehistoric Alaska, the local Native Alaskans believe in the Great Spirits, who create life and are said to appear in the form of an aurora. Three human brothers, Kenai, the youngest; Denahi, the middle and Sitka, the elder; return to the tribe to receive totems, necklaces that take the shape of prehistoric creatures, with each animal being representative of something the brothers must achieve to prove themselves as men. Unlike Sitka, who receives the Haast's eagle of guidance, and Denahi, the dire wolf of wisdom, Kenai receives the cave bear of love, to which he objects, believing them to be thieves; he makes his point a fact when a female cave bear steals their basket of fish. Kenai and his brothers pursue her; when the fight culminates on top of a glacier, Sitka sacrifices himself to save his brothers, by dislodging the glacier, but the creature survives. Kenai takes it upon himself to slay her, blaming it for his brother's death. After fighting and slaying the bear, Sitka's spirit appears in the form of a bald eagle, and the Spirits transform Kenai into a cave bear. Denahi arrives and, thinking that the cave bear also killed Kenai, vows to avenge his brother by killing her. Kenai falls down some rapids and is healed by Tanana, the tribal shaman; while she does not speak the bears' language, but advises him to travel to the mountain where Sitka's spirit will turn him back into a human being, but only if he atones for his crime; vanishing without explanation. Kenai discovers he can now communicate with animals, meeting two moose called Rutt and Tuke. He ends up getting caught in a hunter's trap, but is freed by Koda, a sassy cave bear cub. The two strike a deal; in exchange for leading Koda to an annual salmon run, he will take Kenai to the mountain. The two form a brother-like relationship, and Koda reveals his mother is missing. The two are pursued by Denahi, who is out to avenge Kenai; unbeknownst to him, his brother is the bear he is hunting. Upon reaching the salmon run, where several bears congregate, including the leader Tug. Kenai accepts his new surroundings and is comfortable living amongst the bears. During a discussion, Koda tells a story about his mother getting involved in a fight with human hunters; this reminds Kenai of his brothers' fight with the bear, and he realizes, to his horror, that he killed Koda's mother. Horrified by his actions, Kenai runs away in guilt, but Koda follows him. Upset, he confesses to Koda that he killed his mother, and the bear cub runs off in grief; an apologetic Kenai then travels to the mountain on his own. Meanwhile. Rutt and Tuke have a fight, but reconcile with each other in front of Koda, prompting him to forgive Kenai. On the mountain, Kenai is attacked by Denahi, but Koda steals his spear. Out of love for the bear cub, Kenai sacrifices himself, and Sitka's spirit transforms him back into a human, much to the surprise of Koda and Denahi. Upon realizing that the cub needs him due to his own mistakes, Kenai asks to be transformed back into a bear, with Denahi's support. Sitka complies, and transforms his brother back to his bear form, and Koda is briefly reunited with his mother's spirit, before she and Sitka depart to the spirit realm. In the end, Kenai lives with the other bears and gains his title as a man through living as a bear. ==Reception== The reaction from movie reviewers was mixed to negative with many panning the movie as copying older Disney movies like The Lion King and the 20th Century Fox movie Ice Age (although Brother Bear began production before Ice Age did), while others defended the movie as a different and reasonable variation of the theme. The popular American movie critics Roger Ebert and Richard Roeper have given positive reviews of the movie. However, Brother Bear holds a rating of 38% in Rotten Tomatoes, which says that \"Brother Bear is gentle and pleasant if unremarkable Disney fare, with so-so animation and generic plotting\".http://www.animated-news.com/2003/brother- bear-two-thumbs-up/ Animated News » Brother Bear Two Thumbs Up! ==Voice cast== * Joaquin Phoenix as Kenai, the youngest of three brothers who gets turned into a bear, to teach him to see through their eyes * Jeremy Suarez as Koda, a wisecracking grizzly bear cub, who helps Kenai on his journey to where the Lights Touch the Earth * Jason Raize as Denahi, the middle brother ** Harold Gould as Old Denahi (English) ** Angayuqaq Oscar Kawagley as Old Denahi (Inuktitut) * Rick Moranis as Rutt, a comic Canadian moose * Dave Thomas as Tuke, another comic Canadian moose * D.B. Sweeney as Sitka, the oldest brother * Joan Copeland as Tanana, the shaman-woman of Kenai's tribe * Michael Clarke Duncan as Tug, a wise old cave bear * Paul Christie and Daniel Mastrogiorgio as two rams * Estelle Harris as Mabel, old lady bear * Greg Proops as a male lover bear * Pauley Perrette as a female lover bear * Darko Cesar as foreign bear * Bumper Robinson as two chipmunks * Frank Welker as Animals' vocal effects (uncredited) * Hope Levy as a valley girl bear Additional voices were provided by Caitlin Rose Anderson, Maxi Anderson, Bob Bergen, Jeffery L. Bergman, Rodger Bumpass, Carmen Carter, Cathy Cavadini, Randel Crenshaw, Cam Clarke, Jennifer Darling, Debi Derryberry, Cedric the Entertainer, Bill Farmer, Trey Finney, Dave Foley, Pat Fraley, Jess Harnell, B. Wyatt Johnson, Ben Johnson, Bethany Johnson, Luke Johnson, Amy Keys, Phil LaMarr, Hope Levy, Rick Logan, Sherry Lynn, Danny Mann, Arnold McCuller, Terence McGovern, Mickie McGowan, Tim Mertens, Laraine Newman, Rob Paulsen, Pat Pinney, Brian Posehn, Josef Powell, Phil Proctor, Pam Seagall, Roger C. Smith, Susan Stevens-Logan, Tara Strong, Cree Summer, Steve Susskind, Maddie Taylor, Alan Tudyk, Lamont Van Hook, Julia Waters, Oren Waters, Willie Wheaton, Fred White, Joe Whyte, Maxine W. Waters, Ariel Winter, Terry Wood, James Woods and Terry Young. ==Crew== Crew Position Directed by Aaron Blaise Robert Walker Produced by Chuck Williams Written by Tab Murphy Lorne Cameron David Hoselton Steve Bencich Ron J. Friedman Songs by Phil Collins Original Score by Mark Mancina Phil Collins Associate Producer Igor Khait Art Director Robh Ruppel Film Editor Tim Mertens Artistic Supervisors Steve Anderson (Story supervisor) Jeff Dickson (Layout supervisor) Barry R. Kooser (Background supervisor) Phillip S. Boyd & Chrisine Lawrence-Finney (Clean-up supervisor) Garrett Wren (Effects supervisor) Supervising Animators Byron Howard (Kenai- Bear) Alex Kuperschmidt (Koda) Ruben A. Aquino (Denahi) James Young Jackson (Kenai-Human) Tony Stanley (Rutt) Broose Johnson (Tuke) Anthony Wayne Michaels (Sitka) Tom Gately (Tanana) Rune Brandt Bennicke (Tug & Koda's Mom) Background Stylist Character Design Artistic Coordinator Production Manager Xiangyuan Jie Rune Brandt Bennicke Kirk Bodyfelt Bruce Anderson ==Songs== Song Performed by Available on the soundtrack disc? Heard in the film? Great Spirits Tina Turner Yes Yes Transformation Phil Collins Yes No Transformation Bulgarian Women's Choir Yes Yes On My Way Phil Collins Yes Yes (except Koda sings the first few lyrics and the last lyric) On My Way (this version contains Koda singing the first few lyrics and the last lyric) Jeremy Suarez Phil Collins No Yes Welcome Phil Collins Yes No Welcome Phil Collins The Blind Boys of Alabama Yes Yes No Way Out (theme from Brother Bear) Phil Collins Yes Yes Look Through My Eyes Phil Collins Yes Yes (also on bonus material) Score by Mark Mancina/Phil Collins == Release Dates == Country Premiere VHS release date DVD release date Blu-ray release date November 1, 2003 March 30, 2004 March 30, 2004 March 12, 2013 October 12, 2021 December 5, 2003 May 10, 2004 May 10, 2004 September 29, 2014 December 26, 2003 June 30, 2004 June 30, 2004 September 21, 2016 April 16, 2004 September 10, 2004 September 10, 2004 November 15, 2013 August 23, 2024 ==Deleted songs== * \"The Fishing Song\" - This was intended for the salmon run sequence, but was replaced by \"Welcome\". * \"This Can't Be My Destiny\" This was song by Phil Collins. But unfortunately it never made it to the movie. The song was however mention in the special feature by Phil Collins. This song was never released. ==Sequel== Brother Bear 2 was released August 29, 2006. ==References== ==Other websites== * Official site * * Bear at the Big Cartoon DataBase (Dead link) * Category:2003 animated movies Category:2003 musical movies Category:Disney animated movies Category:2000s English-language movies Category:American family comedy movies Category:American musical movies Category:Movies about bears Category:Movies about brothers Category:Movies about Native Americans Category:Movies set in prehistory Category:2000s American drama movies Category:2003 comedy-drama movies Category:American comedy-drama movies Category:American fantasy-comedy movies Category:2000s fantasy-comedy movies",
 "title": "Brother Bear"
}