{
 "id": "385591",
 "text": "Stranglation is death by compressing the neck until the supply of oxygen is cut off. The process is called strangling. The brain needs a constant supply of oxygen. Strangling leads first to unconsciousness, then to death.Ernoehazy, William Jr; Hanging injuries and strangulation. www.emedicine.com. URL last accessed March 3, 2006. Fatal strangling may occurs in accidents, and other causes of violence. Strangling does not have to be fatal; limited or interrupted strangling is practised in erotic asphyxiation, in the so-called \"choking game\". Choking yourself during masturbarion (the so-called choke wank) is dangerous because it is easy to lose control or consciousness doing it alone, and someone (usually a parent or carer, or significant other) needs to find them within minutes before permanent damage is done. They would also need medical training and to call emergency services. Strangling is a technique in many combat sports and self-defence systems. It is a method of winning a judo bout. Usually the opponent submits; if not, he is \"strangled out\", that is, the hold is continued until he passes out and is then immediately released. Shime-waza, the judo term for this technique, has scored 97 times in World Judo events. No fatalities have resulted from it.Koiwai, Karl. How safe is choking in Judo?. judoinfo.com. URL last accessed March 3, 2006. There have been some deaths of suspects in police custody, where officers have used a \"choke hold\". Investigation suggested that this was because the officers' training had been inadequate. Strangling can be divided into three general types according to the mechanism used:Strack, Gael; McClane, George. How to improve investigation and prosecution of strangulation cases. www.polaroid.com. URL last accessed March 3, 2006. * Hanging—Suspension from a cord wound around the neck * Ligature strangulation—Strangulation without suspension using some form of cord-like object called a garrotte * Manual strangulation—Strangulation using the fingers or other extremity == References == Category:Violence Category:Deaths by strangulation Category:Judo",
 "title": "Strangulation"
}