{
 "id": "385809",
 "text": "Julieta Venegas Percevault (born November 24, 1970 in Long Beach, California), is a Mexican singer, songwriter, instrumentalist and producer. She sings pop- rock in the Spanish language. She speaks English, Portuguese, and Spanish. She plays several instruments such as acoustic guitar, accordion, and keyboard. She has won five Latin Grammys and one Grammy Award. She has composed music for theater and performed in soundtracks for two movies. ==Biography== Venegas began playing instruments at the age of 10 when her parents first sent her to piano lessons. Music became her passion. At the start of her career, she collaborated with a few bands in Tijuana, and then later in Mexico City Her first solo album, Aquí, was released in 1998 collaborating with Gustavo Santaolalla. She recorded, toured and played live. In 2000, she recorded her second album, Bueninvento, where she experimented with the electric guitar, and collaborated with producers and musicians including Gustavo Santaolalla, Meme de Real, Quique Rangel, Toy Hernandez and Joe Chiccarelli. In 2003, she released her third album, Sí, which was recorded and produced in Buenos Aires and Madrid with guest musicians Cachorro López and Coti Sorokin. In 2006, her fourth album, Limón y Sal, debuted with the help of producer Cachorro López. In 2007, she collaborated with Miranda! to record the song \"Perfecta,\" which became a chart-topping single in 2008 in Latin America. Also that year, she was featured in MTV Unplugged which led to a DVD and CD. The single \"El Presente\" was drawn from that production. The album Otra Cosa was released in March 2010.Julieta Venegas – Otra Cosa CD Album. Cduniverse.com (2010-03-16). Retrieved on 2011-11-16. On August 13, 2010 Julieta gave birth to a baby girl named Simona in Mexico City. ==Discography== *1997: Aquí (+ 300,000) *2000: Bueninvento (+ 500,000) *2003: Sí (+ 2,000,000) *2006: Limón y Sal (+ 4,000,000) *2008: MTV Unplugged (+ 1,200,000) *2010: Otra Cosa (+ 1,100,000) *2013: Los Momentos ==Awards== *Latin Grammy Awards of 2004: **Best Rock Solo Vocal Album (Sí). *MTV Video Music Awards Latin America 2004: **Best Solo Artist **Best Artist (Mexico) **Artist of the Year *Premios Oye! 2004: **Best Song of The Year (Andar Conmigo) **Album of The Year (Sí) **Rock In Spanish *MTV Video Music Awards Latin America 2006: **Best Solo Artist *Latin Grammy Awards of 2006: **Best Alternative Music Album (Limón y Sal). *Latin Grammy Awards of 2007: **Best Latin Pop Album (Limón y Sal). *MTV Video Music Awards Latin America 2007: **Best Pop Artist *Latin Grammy Awards of 2008: **Best Alternative Album (MTV Unplugged) **Best Music Video Long Form (MTV Unplugged) *Latin Grammy Awards of 2010: **Best Short Form Music Video (Bien o Mal) ==References== Category:1970 births Category:Living people Category:Latin singers Category:Mexican singers Category:Singers from Long Beach, California Category:Mexican Grammy Award winners Category:Latin Grammy Award winners",
 "title": "Julieta Venegas"
}