{
 "id": "385896",
 "text": "Jonathan Paul Katz (born December 1, 1946) is an American stand-up comedian, actor, and writer. He is known for his role as Dr. Katz in Dr. Katz, Professional Therapist. Katz won an Emmy Award for \"Outstanding Voice-Over Performance\" in 1995. ==Early life and education== Katz was born in New York City to a Jewish-Hungarian immigrant family.Epstein, Lawrence J. The Haunted Smile: The Story of Jewish Comedians in America - Publisher: PublicAffairs - Date: Aug 2008 He was educated at Goddard College. ==Career== Katz is a close friend of playwright David Mamet, with whom he attended Goddard College. Katz co-wrote \"House of Games]\" with Mamet and had small roles in the Mamet- directed films \"Things Change,\" \"Homicide,\" \"The Spanish Prisoner,\" and \"State and Main\". Originally a musician and songwriter, Katz fronted a rhythm and blues group called \"Katz and Jammers\" before serving as the musical director for Robin Williams' 1979 standup tour. In 1998, he released Brandon Project, a blues album. ==Health== In 1996, Katz was diagnosed with multiple sclerosis. The initial symptoms began that year: \"I was working on a TV show called \"Ink\" with Ted Danson, and after every episode we would take a curtain call and I noticed that I needed a head-start.\" Hiding his condition became too much of a burden for Katz and he eventually disclosed it. He began speaking publicly as part of a tour sponsored by a manufacturer of medications used to treat MS. > \"People have been pretty supportive; nobody ever had me in mind for an > action film because of the kind of work I do -- mostly in the world of > animation, which is not a big issue because as a person, I can't run that > fast; as a cartoon character, I can fly -- literally.\" Katz, who now gets around with the help of a motorized scooter and performs onstage with the aid of a cane, says he doesn't regret his decision: \"One of the reasons I disclosed my condition is because it is much easier to live with MS than to pretend you don't have it. If I could convince everyone of that, my job here is done.\" ==Personal life== Katz is married to Suzan Katz. They have two children. ==References== ==Other websites== * Explosion Bus starring Jonathan Katz *WKATZ, home of Hey We're Back *Jonathan Katz's Official Website * Category:1946 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:American television personalities Category:Comedians from New York City Category:Writers from New York City Category:Actors from New York City Category:Emmy Award winning actors Category:People with multiple sclerosis",
 "title": "Jonathan Katz"
}