{
 "id": "386171",
 "text": "Boris Leonidovich Pasternak Бори́с Леони́дович Пастерна́к (30 May 1960) was a Russian poet, novelist, and literary translator. His parents were Jewish Ukrainians. In his native Russia, Pasternak's anthology My Sister, Life, is one of the most influential collections ever published in the Russian language. Furthermore, Pasternak's translations of plays by Goethe, Schiller and Shakespeare are deeply popular with Russian audiences. Outside Russia, Pasternak is best known as the author of Doctor Zhivago, a novel which takes place between the Russian Revolution of 1905 and the Second World War. Due to its independent minded stance on the socialist state, Doctor Zhivago was refused publication in the USSR. The typescript of Doctor Zhivago was smuggled out of the country to Milan and published in 1957.During Soviet times, copies of banned publications were spread through the Soviet Union by multiple typescript copies. The practice was called samisdat, a key method of dissidents in the Soviet Union. Pasternak was awarded the Nobel Prize in Literature the following year, an event which humiliated and enraged the Communist Party of the Soviet Union. In the midst of a massive campaign against him by the CPSU and the Union of Soviet Writers, Pasternak reluctantly agreed to decline the prize. In his letter to the Nobel Committee, Pasternak stated the reaction of the Soviet State was the only reason for his decision. He is still listed as the winner for that year. By the time of his death from lung cancer in 1960, the campaign against Pasternak had damaged the international credibility of the U.S.S.R. He is still a major figure in Russian literature. Furthermore, the samizdat methods were later continued, expanded, and refined by Aleksandr Solzhenitsyn and other Soviet dissidents. ==Books by Pasternak== ===Poetry collections=== *Twin in the Clouds (1914) *Over the Barriers (1916) *Themes and Variations (1917) *My Sister, Life (1922) *On Early Trains (1944) *Selected Poems (1946) *Poems (1954) *When the Weather Clears (1959) *In The Interlude: Poems 1945–1960 (1962) ===Books of prose=== *Safe Conduct (1931) *Second Birth (1932) *The Last Summer (1934) *Childhood (1941) *Selected Writings (1949) *Collected Works (1945) *Goethe's Faust (1952) *Essay in Autobiography (1956) *Doctor Zhivago (1957) == Further reading == *Boris Pasternak 1957. Doctor Zhivago. Pantheon Books *Boris Pasternak 1959. I Remember: sketches for an autobiography. Pantheon Books. *Boris Pasternak 1967. Sister, my life: Summer 1917. transl. C. Flayderman. Washington Square Press. *Boris Pasternak 1976. My sister, life and other poems. Harcourt, Brace & Jovanovich. ISBN 0-15-163964-7 *Olga Ivinskaya 1978. A captive of time; my years with Pasternak. Doubleday. ==Related pages== *List of Russian language poets *List of Russian novelists == References == Category:1890 births Category:1960 deaths Category:Deaths from lung cancer Category:Disease-related deaths in the Soviet Union Category:Jewish Nobel Prize winners Category:Jewish writers Category:Russian Jews Category:Russian Nobel Prize winners Category:Russian novelists Category:Russian poets Category:Soviet Jews Category:Soviet writers Category:Russian translators Category:Writers from Moscow",
 "title": "Boris Pasternak"
}