{
 "id": "386291",
 "text": "Krushchev's Secret Speech was the speech in which Nikita Krushchev denounced Joseph Stalin after the latter's death. The speech was a spoken report to the Twentieth Party Congress of the Communist Party of the Soviet Union on 25 February 1956. Its title was On the Cult of Personality and Its Consequences.Khrushchev, Nikita S. The Secret Speech: On the Cult of Personality , Fordham University Modern History Sourcebook. Accessed September 12, 2007. The report was known as the \"Secret Speech\" because it was delivered at a closed session of Communist Party delegates, with guests and members of the press excluded. Although the text of the Khrushchev report leaked almost immediately, the official Russian text was published only in 1989 during the glasnost campaign of Soviet leader Mikhail Gorbachev. The speech was based on an investigation of the repressions of the delegates of the 1934 XVII Congress of the Communist Party of the Soviet Union. They were victims of the Stalinist purges of the 1930s.Getty, J. Arch. 1985. Origins of the Great Purges: the Soviet Communist Party reconsidered, 1933-1938. New York: Cambridge University Press, 217. Estimates of Stalin's role in history were quite changed by the speech. Many in the West who had been Communist Party member, or at least sympathetic fellow-travellers, resigned their memberships and no longer defended the reputation of Stalin. Russian writers like Solzhenitsyn found they were treated with more sympathy. The speech was a significant turning- point in history. The speech caused such shock to the audience that, according to some reports, some of those present suffered heart attacks, and others later committed suicide.From Our Own Correspondent, BBC Radio 4, 22 January 2009. Many Soviet citizens were confused by De-Stalinization. They had been fed on praise of the \"genius\" of Stalin. This was especially obvious in the Georgian SSR, Stalin's homeland, where rioting ended with the Soviet Red Army crackdown on 9 March 1956.Suny, Ronald Grigor 1994. The making of the Georgian nation. Bloomington: Indiana University Press, 303–305. == References == Category:1956 in Europe Category:1950s in the Soviet Union Category:Speeches Category:Joseph Stalin",
 "title": "Khrushchev's Secret Speech"
}