{
 "id": "386385",
 "text": "The Decline and Fall of the Roman Empire is the short title of an important book by the 18th century English historian Edward Gibbon.The full title is The History of the Decline and Fall of the Roman Empire The book traces the Roman Empire and Western civilization as a whole from the late first century AD to the fall of the Eastern Empire, also called the Byzantine Empire. Published in six volumes, from volume I in 1776 to volumes IV, V, VI in 1788–89. The work covers the history of the Roman Empire, Europe, and the Catholic Church from 98 to 1590 AD and discusses the decline of the Roman Empire in the East and its fall in the West. Because of its relative objectivity and heavy use of primary sources, its methodology became a model for later historians, which led to Gibbon being called the first \"modern historian of ancient Rome\". == Thesis == Gibbon gave an explanation for why the Roman Empire fell. According to Gibbon, the Roman Empire succumbed to barbarian invasions because its citizens gradually lost their \"civic virtue\".J.G.A. Pocock 1976. Between Machiavelli and Hume: Gibbon as civic humanist and philosophical historian. Daedalus 105 3, 153–169 They had become weak by using barbarian mercenaries to defend their empire, but they became so numerous that took over the empire. Gibbon believed that the Romans became unwilling to live the tougher, \"manly\" military lifestyle. In addition, Gibbon argued that Christianity created a belief that a better life existed after death, which fostered an indifference to the present among Roman citizens and reduced their desire to sacrifice for the empire. He also believed its pacifism tended to hamper the traditional Roman martial spirit. Finally, like other Enlightenment thinkers, Gibbon held in contempt the Middle Ages as a priest-ridden, superstitious, \"dark age\". It was not until his own age of reason and rational thought, he believed, that human history could resume its progress. Gibbon sees the Praetorian Guard as the main catalyst of the empire's initial decay and eventual collapse, a seed that had been planted by Augustus at the start of the empire. Gibbon cites repeated examples of the Praetorian Guard abusing its power with calamitous results, including numerous instances of imperial assassination and demands for increased pay. == Views on Christianity == In Volume I, especially Chapters XV and XVI, Gibbon challenged Church history. He estimated far smaller numbers of Christian martyrs than had been previously thought. The Church's version of its early history had rarely been questioned before. For Gibbon, however, the Church writings were secondary sources. He shunned them in favour of primary sources from the period he was writing about. That is one reason that Gibbon is referred to as the \"first modern historian\". Gibbon's main theory was that Christianity was a prime factor in the empire's decline and fall. :\"The introduction, or at least the abuse, of Christianity, had some influence on the decline and fall of the Roman empire. The clergy successfully preached the doctrines of patience and pusillanimity; the active virtues of society were discouraged; and the last remains of military spirit were buried in the cloister\".General observations on the fall of the Roman Empire in the West. Christian Classics Ethereal Library, Calvin College Computer Science. On religion more generally, he wrote: :\"The various modes of worship which prevailed in the Roman world were all considered by the people as equally true; by the philosophers as equally false; and by the magistrate as equally useful\". (volume 1, chapter 1) Later historians have mostly not agreed with Gibbon. Today, historians tend to analyze economic and military factors in the decline of Rome.MacMullen, Ramsay 1988. Corruption and the decline of Rome. New Haven: Yale Univ. Press.Burns, Thomas S. 1995. Barbarians within the gates of Rome: a study of Roman military policy and the barbarians, ca. 375–425 AD. Bloomington: Indiana Univ. Press. ==Editions== Gibbon continued to revise and change his work even after its publication. The complexities of the problem are addressed in Womersley's introduction and appendices to his complete edition. * In-print complete editions ** Hugh Trevor-Roper (ed) 6 volumes (New York: Everyman's Library, 1993–1994). ISBN 0-679-42308-7 (vols. 1–3); ISBN 0-679-43593-X (vols. 4–6) ** David Womersley (ed) 3 volumes. hardback-(London: Allen Lane, 1994); paperback-(New York: Penguin Books, 2005;1994). Includes the original index, and the Vindication (1779) which Gibbon wrote in response to attacks on his caustic portrayal of Christianity. The 2005 print includes minor revisions and a new chronology. ISBN 0-7139-9124-0 (3360 p.); ISBN 0-14-043393-7 (v.1, 1232 p.); ISBN 0-14-043394-5 (v.2, 1024 p.); ISBN 0-14-043395-3 (v.3, 1360 p.) * In-print abridgements ** David Womersley (ed) 1 volume (New York: Penguin Books, 2000). Includes all footnotes and eleven of the original seventy-one chapters. ISBN 0-14-043764-9, 848 p. ** Hans- Friedrich Mueller (ed) one volume abridgment (New York: Random House, 2003). Includes excerpts from all seventy-one chapters. It eliminates footnotes, geographic surveys, details of battle formations, long narratives of military campaigns, ethnographies and genealogies, but keeps the narrative from start to finish. ISBN 0-375-75811-9, (trade paper, 1312 p.); ISBN 0-345-47884-3 (mass market paper, 1536 p.) == References == Category:History books Category:Roman Empire Category:1770s books Category:1780s books",
 "title": "The Decline and Fall of the Roman Empire"
}