{
 "id": "386764",
 "text": "The Sher-e-Bangla National Cricket Stadium (SBNS)' in Bangladesh is sometimes called the Mirpur Stadium. It is in the Mirpur district of Dhaka. It can hold 26.000 people at a time. It was built in 2006.Football stadiums of the world – Stadiums in Bangladesh It was named after Sher-e-Bangla A. K. Fazlul Huq \"The tiger of Bangla\".Welcome cricket.butjazz.com – BlueHost.com The stadium has hosted Bangladesh's first class, test, ODI, twenty20 and women's cricket matches. It also hosted international matches like 2011 World Cup, Asia Cup etc. ==Facilities== The ground is a state of the art stadium. It is considered one of the best grounds in the subcontinent. Its most striking and interesting part is its modern drainage. The ground was originally built for football and athletics. For this reason it was built in rectangular shape. But when it was shifted for cricket it was fixed to oval for cricket. The ground was fitted with floodlights on 2009. it is able to host Day/night cricket matches. ==First test and ODI== he ground hosted its first Test match on 25 May 2007. It was a test match between Bangladesh and India. It hosted it's first ODI on December 8, 2006. The match was played by Bangladesh and Zimbabwe. ==BPL== ==2011 Cricket World Cup== The stadium hosted 4 group matches and 2 quarter finals during the 2011 Cricket World Cup. ===Group matches=== \\---- \\---- \\---- \\---- ===Quarter-finals=== \\---- ===Quarter-finals=== \\---- ==Asia Cup, 2012== Bangladesh hosted the 12th edition of the Asia Cup. Sher-e-Bangla National Stadium hosted those matches. ===Group matches=== \\---- \\---- \\---- \\---- \\---- \\---- ===Final=== ==Gallery== File:Sher-e-Bangla Cricket Stadium 002.jpg|Workers working on a light in the ground File:Zimbabwean Players Take The Drinks Break.jpg|Zimbabwean players take the Drinks Break File:Sher-e- Bangla Cricket Stadium 005.jpg|Aerial View File:Sher-e-Bangla Cricket Stadium 006.jpg|Aerial View File:Sher-e-Bangla Cricket Stadium - Grand Stand.png| Grand Stand File:Sher e Bangla National Stadium Media End.png|Media Centre End, Night View File:Sher-e-Bangla Cricket Stadium 004.jpg|Aerial view of the ground File:Ispahani End, Sher-e-Bangla Cricket Stadium.jpg|Ispahani End of the Stadium, Before Chairs were fitted in all parts of gallery File:Bangladesh Team Returning to Dressing Room.jpg| Bangladesh team returning to the dressing room at the Stadium File:Bangladesh Players Celebrate Fall of Wicket.jpg|Players celebrate after taking a wicket File:Sher-e-Bangla Cricket Stadium 003.jpg|Workers working on floodlights. File:Sher-e-Bangla Cricket Stadium 001.jpg|Floodlights File:Mirpurstadium201.jpg|In the middle of a match ==References== ==Other websites== * Upcoming Matches at Mirpur Stadium – List of Fixtures to be played at Sher e Bangla National Stadium. * A BanglaCricket Exclusive: The Mirpur Stadium – an article on the recent reconstruction of the ground. Category:Buildings and structures in Dhaka Category:Cricket in Bangladesh Category:2006 establishments in Asia Category:21st-century establishments in Bangladesh Category:Cricket grounds",
 "title": "Sher-e-Bangla National Cricket Stadium"
}