{
 "id": "386898",
 "text": "In quantum mechanics, it's very hard to understand what the math actually means in real life. However, there are many ideas about how to understand quantum mechanics. There are no facts to prove any interpretation over the others, but there are some that are more accepted than others. == Background material == The main ideas of quantum mechanics are the assumptions of Schrödinger and Heisenberg. The Schrödinger equation is a partial differential equation that describes the wavefunction of an object. The equation is given by i\\hbar \\frac{\\partial \\Psi}{\\partial t}=\\frac{-h}{2m} abla^2 \\Psi + V(x)\\Psi (x) This equation means that a particle, such as an electron, is not just a point-like particle, but also a type of wave. Another fundamental of quantum mechanics is the Heisenberg uncertainty principle. This theory is the idea that it's impossible to know both where something is and its momentum at the same time. The mathematical formulation of this is given by \\Delta x\\Delta p>\\frac{\\hbar}{2} This can further be generalized by stating that \\Delta X_1\\Delta X_2>\\frac{[X_1, X_2]}{2i} Where [X_1, X_2] is the operator of X_1 and X_2. This law also gives rise to an uncertainty between energy and time, which can be expressed in the same way as the relation between momentum and position. == Probability waves == Another important fact of quantum mechanics is that the electron behaves in a very unusual way. At first, no one really knew what the wave function meant physically. Max Born, a theoretical physicist, explained that the wave function is a probability wave. In other words, wherever the wave is denser, that is where the particle is most likely found, but it won't necessarily be found there. The way to find the probability (P_{[a,b]}) of the position of the particle in the region a is given by \\int_a^b \\\\! |\\Psi (x, t)|^2 dx=P_{[a,b]} For example, if P_{[a,b]} is equal to 0.5, then there is a 50% chance of finding the particle within that region. This means that the location of a particle is probabilistic; one can never say that the particle will definitely be found at a certain point in space, but rather, one can only give the probability of finding the particle within that region. == Copenhagen interpretation == The most well-accepted interpretation of quantum mechanics is the idea called Copenhagen interpretation. This interpretation builds upon the probability-wave notion, but brings in a radical new idea called the superposition principle. The best way to explain this principle is by showing it mathematically. If the functions \\Psi_1, \\Psi_2, \\Psi_3, ... \\Psi_n are solutions of the Schrödinger equation, then the superposition of those wave functions is also a solution, i.e. \\Theta = c_1\\Psi_1 + c_2\\Psi_2 + c_3\\Psi_3 + ... c_n\\Psi_n Where \\theta is the superposition of the various wave functions. This idea implies that a particle occupies every possible wave function it can. This implies that a particle occupies more than one position at the same time. When an observer comes and actually measures the position of the particle, something called the wave function collapse occurs. So when someone observes the particle, the following happens: \\Theta→\\Psi_n This means that when there is no observation or observer, then a particle occupies many positions at the same time; when an observation takes place, the wave function collapses and the particle exists only in one position. == Many-worlds interpretation == The many-worlds interpretation says that rather than the wave function collapsing, each possibility actually happens, but in different universes. This means that the universes branch off for each possibility. Also it says that you can live forever according to quantum suicide. == Quantum determinism == The interpretation, presented by Albert Einstein, states that the outcome of some random event is predetermined. So, rather than a particle existing as a probability wave, this interpretation says that the particle exists only in one position, but we just perceive it to be a probability. This idea is much less popular. == Which one is right? == So, of the three main interpretations of quantum mechanics, which one is correct? Physicists seem to think that the Copenhagen interpretation is the most likely, but no one is for sure. == References == Category:Quantum mechanics",
 "title": "Interpretations of quantum mechanics"
}