{
 "id": "386929",
 "text": "Jason Rocco Anthony Spezza (born June 13, 1983 in Mississauga, Ontario) is a Canadian former professional ice hockey centre. He played a total of 19 seasons in the National Hockey League (NHL). He played for the Ottawa Senators, Dallas Stars and Toronto Maple Leafs. He began his hockey career with the Brampton Battalion of the Ontario Hockey League (NHL). He also played for the Mississauga Ice Dogs for 2 seasons, the Windsor Spitfires for 2 seasons and the Belleville Bulls for 1 season. He entered the draft in 2001 and he was drafted with the 2nd overall by the Ottawa Senators in the 2001 NHL Entry Draft. He was assigned to the Grand Rapids Griffins, the farm team of the Senators. He was called up to the Senators and made his NHL debut in the 2002-03 NHL season. He played 33 games with the Senators and played most of the season with Ottawa's new affiliate, Binghamton Senators. He was called up and played two seasons with the Senators and was sent down to the Binghamton Senators to play a season. After that he joined the Ottawa's main roster full- time. Spezza was on the cover of 2007 video game, NHL 2K8. He married his girlfriend Jennifer on July 25, 2009. They have two daughters Sophia Donna Spezza (born June 8, 2010) and Nicola Patricia Spezza (born April 1, 2012). On July 1, 2014, after Spezza had requested a trade, the Senators traded him along with Ludwig Karlsson to the Dallas Stars in exchange for Alex Chiasson, Alex Guptill, Nicolas Paul and a 2015 second-round pick to Ottawa. On May 29, 2022, Spezza announced that he was retiring from playing professional ice hockey. After he retired, he became an assistant to Leafs general manager Kyle Dubas. On May 19, 2023, Spezza stepped down when Dubas was fired. ==References== == Other websites == * Category:1983 births Category:Living people Category:Binghamton Senators players Category:Canadian ice hockey centres Category:Dallas Stars players Category:Grand Rapids Griffins players Category:Ice hockey people from Ontario Category:Ottawa Senators players Category:Ontario Hockey League players Category:Toronto Maple Leafs players Category:Sportspeople from Mississauga",
 "title": "Jason Spezza"
}