{
 "id": "387239",
 "text": "The French Air Force (, literally Army of the Air) is the air force of France. It was formed in 1909 as the Service Aéronautique de l'Armée, part of the French Army, and finally independent in 1934 in its current form. In 2013 it has an important fleethttp://www.defense.gouv.fr/air/technologies/aeronefs of aircraft. == Gallery == === French air force bases === In France the air force bases are called Bases Aériennes or BA and have a number, like Base Aérienne 117 in Paris. Image:Ba117.jpg|Paris air force base and his exposed Mirage III. Image:Base aérienne 273 Romorantin-Lanthenay.jpg|BA-273 at Romorantin. === Former aircraft of the French Air Force === Image:Dewoitine510.jpg|Interwar period fighter plane Dewoitine D.510 of the French Air Force. Image:ThunderboltP47.jpg|World War II fighter plane Republic P-47 Image:Bloch MB 131 San Diego Air %26 Space Museum 3.jpg|Bloch MB-131, reconnaissance and bomber of World War II Image:Bloch mb-162.jpg|World War II French bomber Bloch MB-162. Image:A-26C loaned to France in Indochina.jpg|Former French Air Force bomber Douglas A-26 Invader used in Indochina war. Image:Mureaux113.jpg|Former French Air Force reconnaissance aircraft ANF-Les Mureaux 113. Image:Breguet 941 à Dugny.JPG|French Air Force transport plane Bréguet 941. Image:French Air Force Airbus A319CJ Deak.jpg|Former VIP transport plane A319CJ Image:Dassault Mirrage IIIE Elvington.JPG|French Air Force fighter aircraft Mirage IIIE. Image:French Air Force Caravelle Gilliand.jpg|French Air Force former transport plane Caravelle. Image:Mirage 5F Ardennes.jpg|Former fighter aircraft Dassault Mirage 5 of the French Air Force. Image:Mirage IV DN-ST-87-02585.JPEG|Nuclear bomber Dassault Mirage IV of the French Air Force. Image:Douglas DC-8 Sarigue.JPG|spy plane DC-8 Sarigue. Image:French Jaguar A of EC 1-7 Provence in flight over the Adriatic Sea, 8 April 2003 (DF-SD-05-05511).jpg|Anglo- French attack plane Sepecat Jaguar. === Active aircraft of the French Air Force === Image:French Air Force Airbus A310-300 Watt.jpg|Transport plane Airbus A310. Image:Break2 M2000D.JPG|attack variant of the Mirage 2000, the Mirage 2000D seen here at the \"break\". Image:Lockheed C-130H Armée de l'Air Le Bourget.JPG|Transport plane Lockheed C-130H-30. Image:French Alpha Jet, 1988.JPEG|Alpha Jet of Patrouille de France, the famous aerobatic team. Image:Rafale au Bourget en 2011.JPG|Dassault Rafale C in Paris Air Show 2011. Image:Visite sarko janv 09 saint lo 18.JPG|Transport helicopter Eurocopter AS-332 Super Puma. Image:French Air Force Socata TB-30 Epsilon.jpg|Training aircraft SOCATA TB-30 Epsilon. Image:Transall C-160 (side) - AirExpo Muret 2007 0279 2007-05-12.jpg|Franco-German transport plane Transall C.160. Image:Emb 21 Xingu.JPG|Training and light transport plane, built in Brazil, the Xingu. Image:Falcon900 Clermont-Ferrand airport.jpg|VIP transport plane, used by French Prime Minister, the Dassault Falcon 900. Image:E-3F Sentry (French Air Force) Bastille day 4298.jpg|Electronic warfare plane, the Boeing E-3F. Image:French Air Force CASA CN-235 in Sydney.jpg|Transport plane Casa CN-235M. == References == == Other websites == * The official French Air Force website * The Facebook official fanpage of the French Air Force",
 "title": "French Air Force"
}