{
 "id": "387220",
 "text": "The Dassault Rafale is a fighter aircraft made by French airplane company Dassault Aviation. The prototype first flew in 1986 but was introduced in 2001 by the Marine Nationale. Rafale was introduced in Armée de l'Air in 2006. == Specifications == Using the traditional delta wing of Dassault aircraft, the Rafale is a twin-engine fighter built in composite material and metal. Near the nose it has small \"canard\" wings used to stabilize the aircraft during certain phases of flight, especially at low altitude. The cockpit can be single or tandem seat, depending on aircraft type. It has an internal 30 mm calibre autocannon. Rafale has 13 or 14 hardpoints for external weapons : * Magic, Meteor, and Mica air-to-air missiles. * AS-30L, Apache, and Storm Shadow surface-to-air missiles. * ASMP nuclear missile. * Exocet anti-ship missile. * A2SM and Paveway guided bombs. Maximum offensive load of the Rafale is 21 000 pounds (9 500 kg). The Rafale avionics consists of an RBE2 electronic scanning radar, the OSF passive visual system and SPECTRA electronic warfare. Under wings Rafale may take one or two pods of aerial reconnaissance. It uses the communication Link 16 like as the majority of NATO combat aircraft. == Variants == * Rafale A : Designation assigned to the first prototype, that flown in 1986. * Rafale B : Designation assigned to the tandem seat version. * Rafale C : Designation assigned to the single seat version. * Rafale M : designation assigned to the navalized single seat version. == Users == In 2013 operational users of Rafale were:http://www.escadrilles.org/reportages/rafale-armee-de-l-air/ * ** Armée de l'Air. *** Escadron de Bombardement 1/91 Gascogne, also known like EB-1/91. *** Escadron de Chasse et d’expérimentation 5/330 Côte d’Argent, also known like EC-5/330. *** Escadron de Chasse 1/7 Provence, also known like EC-1/7. *** Escadron de Chasse 2/30 Normandie-Niemen, also known like EC-2/30. *** Escadron de Chasse 3/30 Lorraine, also known like EC-3/30. *** Escadron de Transformation Rafale 2/92 Aquitaine, also know like ETR-2/92. ** Marine Nationale. *** Flottille 11F. *** Flottille 12F. Early 2013 in France negotiating the sale of aircraft with Brazil, India, and UAE. == International military commitments == === Afghanistan === In the afghan war Armée de l'Air and Marine Nationale used there Rafale like bombers and reconnaissance planes. The main weapon of these aircraft was then laser guided bomb. French navy Rafale flown from French aircraft carrier Charles de Gaulle,http://www.netmarine.net/bat/porteavi/cdg/index.htm named like famous general and political man. Last French Rafale mission in Afghanistan was in december 2011.http://www.actudefense.com/rafales-air-quittent-afghanistan- kandahar/ === Libya === In the war of 2011 French Rafale and Mirage 2000 bombed the armed forces of Colonel Gaddafi. Some comes from aircraft carrier Charles de Gaulle but French air forces aircraft were from Solenzara air force base in Corsica. In this kind aerial refuelling were an obligation. Like in Afghanistan French pilots fired laser guided bombs, but also laser guided missiles.http://www.meretmarine.com/fr/content/libye-les-rafale-tirent-des- missiles-de-croisiere-scalp === Mali === In january 2013 France launch in Mali the opération Serval whose objective is to fight the Islamist terrorists who occupy the north. Air and land French forces are on alert, and immediately the first French fighter jets launched night bombing. Some are Rafale, but also Mirage 2000D.http://blog.avionslegendaires.net/2013/01/defense-la-france- sengage-au-mali/ Once French troops involved, including the Légion Étrangère and Special forces, Rafale and Mirage 2000 were used for close air support. French fighter jets operating from internation airport of N'Djamenahttp://www.air-cosmos.com/defense/mali-les-rafale-en-renfort.html in Chad. == References == Category:French military aircraft Rafale",
 "title": "Dassault Rafale"
}