{
 "id": "387441",
 "text": "Michel Aflaq (, , 9 January 1910 – 23 June 1989) was a Syrian philosopher, sociologist and Arab nationalist. He is considered to be the principal founder of Ba'athism. Aflaq was born in Damascus to an Orthodox Christian family.Salem-Babikian, N. (1980). Michel ’Aflaq: A Biographic Outline. Arab Studies Quarterly, 2(2), 162. http://www.jstor.org/stable/41857538 His father was a grain merchant.SSalem-Babikian, N. (1980). Michel ’Aflaq: A Biographic Outline. Arab Studies Quarterly, 2(2), 162. http://www.jstor.org/stable/41857538 He attended an Orthodox secondary school and later graduated from a French missionary school in 1928.Weiss, M. (2020). Genealogies of Ba’thism: Michel Aflaq Between Personalism and Arabic Nationalism. Modern Intellectual History, 17(4), 1196. https://doi.org/10.1017/S1479244319000088 After graduation, Aflaq moved to Paris to study history at the Sorbonne University, where he graduated in 1932.Salem-Babikian, N. (1980). Michel ’Aflaq: A Biographic Outline. Arab Studies Quarterly, 2(2), 164. http://www.jstor.org/stable/41857538 While in France, he read European literature, which influenced his writing and political thinking.Salem-Babikian, N. (1980). Michel ’Aflaq: A Biographic Outline. Arab Studies Quarterly, 2(2), 167. http://www.jstor.org/stable/41857538 It was also during this time that he met his friend and future political partner, Salah al-Din al-Bitar.David, R. (2014). The Ba’th and the Creation of Modern Syria (RLE Syria) (Vol. 00001). Routledge. 16. When Aflaq returned to Syria in 1932, the country was under French mandate. He began working as a secondary school history teacher.Salem- Babikian, N. (1980). Michel ’Aflaq: A Biographic Outline. Arab Studies Quarterly, 2(2), 164. http://www.jstor.org/stable/41857538 During his time as a teacher, Aflaq started discussing his political ideas with his students and organized a politically oriented literary club.Weiss, M. (2020). Genealogies of Ba’thism: Michel Aflaq Between Personalism and Arabic Nationalism. Modern Intellectual History, 17(4), 1197. https://doi.org/10.1017/S1479244319000088 This literary club that he ran with Bitar expanded and eventually formed the basis for what would later on become the Ba'ath party.Weiss, M. (2020). Genealogies of Ba’thism: Michel Aflaq Between Personalism and Arabic Nationalism. Modern Intellectual History, 17(4), 1197. https://doi.org/10.1017/S1479244319000088 After ideological struggles within the Ba'ath Party, Aflaq, together with Bitar, was forced to flee Syria. Aflaq traveled to several countries and eventually died in Paris in 1989. He was buried in Baghdad the same year.WWeiss, M. (2020). Genealogies of Ba’thism: Michel Aflaq Between Personalism and Arabic Nationalism. Modern Intellectual History, 17(4), 1198. https://doi.org/10.1017/S1479244319000088 == Political Career == When Aflaq returned to Syria in 1932, he started gathering a group of students interested in the main contemporary political issues, marking the birth of the Ba'ath movement. Officially, the political party was to be found in 1947, formalizing Aflaq's ideology. In 1948, the \"al-Baath\" newspaper was founded, which was used to criticise the 1948 Arab-Israeli war, resulting in the incarceration of Aflaq. In 1954, the Ba'th merged with the Arab Socialist Party, which did not reflect any ideological shift. In the second half of the 1950's the Ba'ath party began its approach to Gamal 'Abd Al Nasser's ideology. This led to the formation of the United Arab Republic between Syria and Egypt in 1958. This was to represent the peak of Aflaq's popularity but also the start of its decline. After a military coup in Syria in 1963, Baathist officers, who were directly supported by Aflaq, took over administration officially ending the United Arab Republic. In 1966, Ba'athist officers under the leadership of Hafez al-Assad staged a coup again, which led to Aflaq fleeing to Beirut. Following the coup the Baath party divided in two: Iraqi and Syrian. In 1968, Iraqi Baathists led by Saddam Hussein and Hasan al-Bakr elected Aflaq as the party's general secretary at the congress held in Beirut. Following this election, he moved to Baghdad. Aflaq ultimately became a symbol for the regime of Saddam Hussein. In 1970, after the party failed to support the Palestine Liberation Organization Aflaq moved to Beirut. Aflaq ultimately returned to Baghdad before the start of the Lebanese civil war and continued as the party's general secretary. == Ideology == Aflaq's ideology can be divided into three different topics: Nationalism, Unity and Socialism. Aflaq's view on nationalism was the process of emancipation of the Arab land from colonialist influences and the creation of a single Arab socialist nation, taking inspiration from what are considered the positive values of Islam. In the Ba'th ideology, unity is one of the main goals as it includes different problematics such as Colonialism and the liberation of Palestine under one Arab Nation. Aflaq insisted that Socialism was needed to pursue the party's goals. Aflaq did not see Socialism just as an economic system, but a combination of values designed to achieve dignity through social participation. His socialism is not based on class struggle but just as a means to meet the demands of the Arab society. == References == Category:1910 births Category:1989 deaths Category:Eastern Orthodox Christians Category:Nationalists Category:People from Damascus Category:Philosophers Category:Sociologists Category:Syrian Christians Category:Syrian politicians",
 "title": "Michel Aflaq"
}