{
 "id": "387588",
 "text": "Inverted Coaster (sometimes known as Inverts by Coaster enthusiasts) is a roller coaster designed by Bolliger and Mabillard and was first conceived in 1992. Unlike the other coaster which above the track, This coaster sits you by the bottom of the track, making a flying sensation. == Development == The inverted coaster was coined by the Swiss roller coaster designers Bolliger & Mabillard (B&M;) In 1991/92. The first installation of the Inverts came at Six Flags Great America in 1992. Batman: The Ride opened to much fanfare and was \"cloned\" many times at other parks. The inverted coaster quickly became an favorite with custom designs installed nearly every year. The tallest and fastest inverted coaster is Wicked Twister at Cedar Point at 215 feet (66 m) tall and reaching speeds up to 72 miles per hour. Although, it was not built by B&M.; The longest inverted coaster is Banshee at Kings Island which travels along 4,124 feet of track. Other roller coaster manufacturers followed in the footsteps of Bolliger & Mabillard and began working on their own inverted coaster designs, including Vekoma, Intamin (Which was the builders of Wicker Twister in 2002) and other smaller companies. Intamin has few designs classified as inverted coasters, although they do install inverted coaster trains on some of their launched designs. Vekoma In recent years, Vekoma has become the first manufacturer to install a family-friendly inverted roller coaster. The inversions usually include vertical loops, zero gravity rolls, Immelmann loops, cobra rolls, and corkscrews. == Installations == 189 inverted roller coasters have been installed at various theme parks, some of which have been relocated. The following list is not exhaustive and only shows the most notable installations. Name Park Opened Manufacturer Status Batman: The Ride Six Flags Great America 1992 Bolliger & Mabillard Operating Batman: The Ride Six Flags Great Adventure 1993 Bolliger & Mabillard Operating Flight Deck California's Great America 1993 Bolliger & Mabillard Operating Batman: The Ride Six Flags Magic Mountain 1994 Bolliger & Mabillard Operating Raptor Cedar Point 1994 Bolliger & Mabillard Operating Nemesis Alton Towers 1994 Bolliger & Mabillard Operating El Condor Walibi Holland 1994 Vekoma Operating Diavlo Himeji Central Park 1994 Bolliger & Mabillard Operating Batman: The Ride Six Flags St. Louis 1995 Bolliger & Mabillard Operating T3 Kentucky Kingdom 1995 Vekoma Operating Eurostar German Traveling Fairs 1995 Intamin/Giovanola Operating Flight Deck Canada's Wonderland 1995 Vekoma Operating Hurricane Rusutsu Resort 1995 Vekoma Operating Lethal Weapon - The Ride Warner Bros. Movie World 1995 Vekoma Operating Fly - The Great Nor'easter Morey's Piers 1995 Vekoma Operating F2 Fright Flight Nasu Highland Park 1995 Vekoma Operating Mind Eraser Six Flags America 1995 Vekoma Operating Montu Busch Gardens Tampa Bay 1996 Bolliger & Mabillard Operating Batman: The Ride Six Flags Over Georgia 1997 Bolliger & Mabillard Operating The Great White SeaWorld San Antonio 1997 Bolliger & Mabillard Operating Mind Eraser Darien Lake 1997 Vekoma Operating Mind Eraser Six Flags New England 1997 Vekoma Operating Mind Eraser Elitch Gardens 1997 Vekoma Operating Mayan Adventure Formosa Aboriginal Culture Village 1997 Vekoma Operating Alpengeist Busch Gardens Williamsburg 1997 Bolliger & Mabillard Operating Jaguar Isla Magica 1997 Vekoma Operating Nio Mitsui Greenland 1997 Vekoma Operating Great Bear Hersheypark 1998 Bolliger & Mabillard Operating Linear Gale LaQua 1998 Intamin Operating Volcano, The Blast Coaster Kings Dominion 1998 Intamin Closed 2018 Blue Tornado Gardaland 1998 Vekoma Operating Cape Cobras Ratanga Junction 1998 Vekoma Operating Kong Formerly The Hangman Six Flags Discovery Kingdom Opryland 1998 1995 Vekoma Operating Closed 1997 Tornado Parque de Atracciones de Madrid 1999 Intamin Operating Batman: The Ride Six Flags Over Texas 1999 Bolliger & Mabillard Operating Dragon Challenge Islands of Adventure 1999 Bolliger & Mabillard Closed 2017 Roller Coaster Dream Park 1999 Vekoma Operating Afterburn Carowinds 1999 Bolliger & Mabillard Operating Limit Heide Park 1999 Vekoma Operating Anaconda Gold Reef City 1999 Giovanola Operating Twisted Typhoon Wild Adventures 1999 Vekoma Operating Vampire Walibi Belgium 1999 Vekoma Operating Invertigo Kings Island 1999 Vekoma Operating Queen Bee Center Norte 1999 Pinfari Closed 2007 Desafio Parque de la Costa 1999 Vekoma Operating Tornado Parque de Atracciones de Madrid 1999 Intamin Operating Katun Mirabilandia 2000 Bolliger & Mabillard Operating Batman: The Ride Six Flags Mexico 2000 Vekoma Operating Mirage Rosso Zoosafari Fasanolandia 2000 Fabbri Group Operating Kumba Superland 2001 Vekoma Operating MP Xpress Movie Park Germany 2001 Vekoma Operating Talon Dorney Park & Wildwater Kingdom 2001 Bolliger & Mabillard Operating Tornado Särkänniemi 2001 Intamin Operating Great Fluffy Sky Adventure Fuji-Q Highland 2001 Hoei Sangyo Co., Ltd. Operating Flying Ace Aerial Chase Kings Island 2001 Vekoma Operating Silver Streak Canada's Wonderland 2001 Vekoma Operating Screaming Condor Leofoo Village Theme Park 2001 Intamin Operating Vertical Velocity Six Flags Great America 2001 Intamin Operating Batman la Fuga Parque Warner Madrid 2002 Bolliger & Mabillard Operating Stunt Fall Parque Warner Madrid 2002 Vekoma Operating Wicked Twister Cedar Point 2002 Intamin Operating Le Vampire La Ronde 2002 Bolliger & Mabillard Operating V2: Vertical Velocity Six Flags Discovery Kingdom 2002 Intamin Operating Snow Mountain Flying Dragon Happy Valley, Shenzhen 2002 Vekoma Operating Sky Rocket Dreamworld 2002 Vekoma Operating Jubilee Odyssey Fantasy Island 2002 Vekoma Operating Queen Bee Botton's Pleasure Beach 2002 Pinfari Operating Nemesis Inferno Thorpe Park 2003 Bolliger & Mabillard Operating Swamp Thing Wild Adventures 2003 Vekoma Operating Flying Ace Aerial Chase Carowinds 2003 Vekoma Operating == Gallery == File:Raptor (Vertical Loop).jpg|Raptor at Cedar Point in 1994 File:Nemesis (Alton Towers) 02.jpg|Nemesis At Alton Towers. Also in 1994 File:Nemesis Inferno.jpg|Nemesis Inferno at Thorpe Park in Surrey, England File:Screaming Condor Leofoo Village Theme Park.jpg|Screaming Condor spiral drop File:Batman The Ride (Six Flags Over Georgia) 02.jpg|Batman The Ride in 1997 File:Traumatizer.jpg|Traumatizer at Southport Pleasureland in Southport, Merseyside, England == References == Category:Roller coasters",
 "title": "Inverted roller coaster"
}