{
 "id": "387705",
 "text": ", formerly , is the wife of Japan's Emperor Emeritus Akihito.Nussbaum, Louis- Frédéric. (2005). \"Michiko\" in Japan Encyclopedia, p. 627. ==Early life== Michiko Shōda was born at University of Tokyo Hospital in Tokyo. She is the eldest daughter of Hidesaburo Shōda and Fumiko Soejima, president and later honorary chairman of Nisshin Flour Milling Company. In 1957, she earned a BA degree at the University of the Sacred Heart, Tokyo.Hoover, Willian D. (2011). Historical Dictionary of Postwar Japan, p. 16. ==Marriage== Shōda married Crown Prince Akihito in 1959. When she married, she became Crown Princess Michiko. She became Empress Michiko in 1989 when her husband became Emperor. Empress Michiko is the mother of two sons and a daughter. == Titles and Styles == 20 October 1934-10 April 1959: Miss Michiko Shoda 10 April 1959-7 January 1989: Her Imperial Highness The Crown Princess or Her Imperial Highness The Crown Princess Michiko 7 January 1989-30 April 2019: Her Majesty The Empress of Japan 1 May 2019-present Her Majesty The Empress Emerita == Family == Name Birth Marriage Children Naruhito, Emperor of Japan 23 February 1960 9 June 1993 Masako Owada Princess Toshi Fumihito, Prince Akishino 30 November 1965 29 June 1990 Kiko Kawashima Princess Mako of Akishino Princess Kako of Akishino Prince Hisahito of Akishino Sayako, Princess Nori 18 April 1969 15 November 2005 Yoshiki Kuroda ==Health== In August 2019, it was revealed that she was diagnosed with early-stage breast cancer in July 2019. Empress Michiko had cancer surgery in September of the year. ==Related pages== * Japanese empresses *Emperor of Japan *Imperial Household Agency ==References== ==Other websites== *Their Majesties the Emperor and Empress at Kunaicho.go.jp * \"Empress Michiko turns 77, and is feeling her age\" at Asahi.com Category:Japanese imperial family Category:1934 births Category:Living people Category:People from Tokyo Category:Empresses consort Category:Crown Princes and Princesses of Japan Category:Recipients of the Decoration for Services to the Republic of Austria Category:Dames Grand Cross of the Order of the Lion of the Netherlands",
 "title": "Empress Michiko"
}