{
 "id": "387764",
 "text": "John Hermansader (1915–2005) was an American painter, graphic designer, and jazz fan. He is remembered for his iconic designs of Blue Note record covers. ==Early years and education== John Bancroft Hermansader was born on November 1, 1915 near Reading, Pennsylvania. In the 1930s, he studied at the Memphis Academy of Art in Tennessee and the New Bauhaus in Chicago, Illinois. In New York City he studied with Robert Motherwell at the New School of Social Research.Obituary, Pilot, Redding Conn., July 14, 2005, p. 32AWho Was Who in American Art , 1999 edition, p. 1540 ==Jazz, Blue Note Records, Fine Art== In 1939, he and his wife Rosemary were founders of the Hot Club of Newark, New Jersey, a significant group of jazz enthusiasts. John became the first president.Black Beauty, White Heat, A Pictorial History of Classic Jazz, 1920 -1950, by Frank Diggs and Harris Lewine, introduction by Paul Bacon, p. 8 In 1951, when Blue Note Records began issuing 10 inch records, Hermansader was one of their first designers, along with Paul Bacon and Gil Melle.Blue Note, The Album Cover Art, edited by Graham Marsh, Felix Cromey, and Glynn Collingham, p. 6 Looking back at this era, Michael Cuscuna of Mosaic Records said, “ What John Hermansader and Paul Bacon really did was evoke the feeling of the music. They used everything from Bauhaus designs to things that were really otherworldly.” Angelynn Grant adds, “When people think of Blue Note covers they think of Frank Wolff”s photography and Reid Miles design. But John Hermansader laid the groundwork that got them going along that path.”“The Art of Jazz”, Robert Miller, The News-Times, July 16, 2005, Vol. 122, No. 97, Danbury, Conn Richard Cook, who wrote Blue Note Records: The Biography states, “Hermansader in particular balanced the twin issues of photography and type in a way that would mirror the concerns of the Blue Note of the years ahead.”Blue Note Records, The Biography, Richard Cook, pp.87–88 “John Hermansader was passionate about oil painting, “beautiful lyrical abstractions, full of color and movement.”5 He was an abstract expressionist painter who drew inspiration for his work from listening to jazz.”?Obituary, Pilot, Redding Conn., July 14, 2005, p. 32A His exhibitions included and the Gallery of Contemporary Art at Sunken Meadow, Long Island, 1951–58, Panoras Gallery 1956, Art USA 1958. His work is in the collection of Wake Forest (IL) College, and the Schwenkfelder Art Museum, PA, as well as private collections. ==Notable album covers== *The Amazing Bud Powell, vol. 1 & 2: Blue Note 12” LP *Jazz Messengers: At the Café Bohemia, vol.1 & 2 Blue Note, 12” LP *Miles Davis, vol. 1 & 2: Blue Note, 12” LP *Horace Silver Quintet: Blue Note, 10” LP *Jay Jay Johnson, vol. 1 & 2: Blue Note, 12” LP ==References== ==Other resources== *Jazz Album Covers – The Rare and the Beautiful, Manek Daver *Jazz Graffico – Disaño y Fotografía en el Disco de Jazz 1940–1968, Ivam Centre Julio González *http://www.birkajazz.com/archive/bluenote/10inch.htm Category:American painters Category:1915 births Category:2005 deaths",
 "title": "John Hermansader"
}