{
 "id": "387923",
 "text": "The (, French Acrobatic Patrol), also called the Patrouille de France or PAF, is the aerobatics demonstration team of the French Air Force. They fly Franco- German Alpha Jet training airplanes. The PAF's aircraft are painted in three colours: blue, white, and red. These are the same colors as on the flag of France. == History == The Patrouille de France was created in 1947. The name first appeared in print for a 1953 aerial show in French Algeria. At this time, the PAF flew American fighter jets, specifically F-84Gs. Later, the team flew Mystère IVs. In 1964, the Air Force did not have enough money in its budget to continue the Patrouille de France, and disbanded it. But the Minister of Defence decided to bring the team back in 1965 because he liked it. They then flew French training aircraft, Fouga CM-170 Magister. They kept flying Fouga CM-170 Magisters until 1980. Since then, the PAF have flown on an Alpha Jets. == Team == Patrouille de France uses eight aircraft that all fly at the same time. A ninth reserve plane always stays on the ground, ready to take off. The call sign of pilots is Athos like the character from the famous book The Three Musketeers. If all pilots have an important role, both the essential leader and his second, called Charognard (which is the French word for \"scavenger\") who present all the display. A transport plane is always with the PAF for support. It is a twin-engine plane: Transall C.160 or Casa CN-235M. == Demonstrations == Because they are seen as ambassadors of France, the PAF go on display all over the world. Patrouille de France often performs in military parade performed to celebrate Bastille Day. They fly over the Champs-Élysées on the morning of July 14. The aircraft unleash a plume of smoke lights. PAF often fly at the Paris Air Show, which is held at Le Bourget airport. == Other websites == * Official website. * Patrouille de France on the official website of the French Air Force. Category:1947 establishments in Europe Category:French Air Force Category:1940s establishments in France",
 "title": "Patrouille de France"
}