{
 "id": "388157",
 "text": "Hans Holbein the Younger (c. 1497 – between 7 October and 29 November 1543) was a German-Swiss artist, painter and printmaker. He is best known for the portraits he painted. He is called \"the Younger\" to distinguish him from his father, Hans Holbein the Elder. Hans Holbein the Younger was the better painter.Alastair Armstrong, \" Henry VIII: Authority, Nation and Religion 1509–1540\" ==Biography== He was an artist born in Augsburg, he later moved to Basel with his family and eventually he traveled to England in 1526 in find work there. He was a great portrait painter.Zwingenberger, 9. He also painted some religious paintings. He was a very talented painter who had his own style of painting. He was made to the King's Painter in England. He worked for King Henry VIII. He also worked in England for several famous people, Thomas More, Anne Boleyn and Thomas Cromwell, and painted many portraits of the English royal family and nobles. These paintings show us today the English court life in the time of Henry VIII of England. He was loved and appreciated by his time.Wilson, 213; Buck, 50, 112. Apelles was a legendary artist of antiquity, whose imitation of nature was thought peerless. Holbein is considered one of the greatest artists in the art history.Wilson, 281. His portrait of Erasmus and Thomas More are now very famous.Waterhouse, 17. File:Hans Holbein, the Younger, Around 1497-1543 - Portrait of Henry VIII of England - Google Art Project.jpg|Portrait of Henry VIII of England File:Hans Holbein d. J. 032b.jpg|Jane Seymour, the wife of Henry VIII File:Portrait Anne of Cleves by Hans Holbein the Younger (Louvre).jpg|Anne of Cleves, the wife of Henry VIII File:Anne Boleyn by Hans Holbein the Younger.jpg |Anne Boleyn, the wife of Henry VIII File:Hans Holbein the Younger - Derich Born (1510?-49) - Google Art Project.jpg|Derich Born (1510?-49) File:Hans the Younger Holbein - A Lady with a Squirrel and a Starling (Anne Lovell?) - Google Art Project.jpg|A Lady with a Squirrel (Anne Lovell?) File:Holbein-erasmus.jpg|Erasmus File:Hans Holbein d. J. - Portrait of Lady Mary Guildford - WGA11522.jpg|Portrait of Lady Mary Guildford ==References== ==Other websites== Category:1490s births Category:1543 deaths Category:Swiss painters Category:German painters Category:People from Augsburg Category:16th-century artists",
 "title": "Hans Holbein the Younger"
}