{
 "id": "388167",
 "text": "Coriaria is a genus of plants. It is the only genus currently known in the Coriariaceae family. About 15-20 species are currently known. ==Description== Most of the species are shrubs but some are subshrubs (small shrubs) or small trees. Leaves are simple, opposite or whorled, with 3 to 9 major veins coming from the base. The fruits look like berries but they are small nuts (achenes) protected by enlarged and colored petals. Fruits cannot be eaten because their seeds are poisonous; in some species, mainly those from New Zealand, the petals that protect the true fruits can be eaten. Several species of this genus can fix nitrogen from the air because they have bacteria of genus Frankia in their roots. ==Name== The name of the genus Coriaria was given by Linnaeus in 1753 in Species Plantarum (Vol. 2, page 1037). The type species is Coriaria myrtifolia L. Coriaria comes from the Latin word corium, meaning \"leather\" because these plants have a substance named tannin which is used to make leather from skins. The several New Zealand species are known by the Māori name of \"tutu\". ==Where it grows== The genus has a very interesting geographic distribution. It is found in 5 regions: #Western Mediterranean (Portugal, Spain, Balearic Islands, France, Italy near France, Morocco, Algeria) #Southern and eastern Asia (Pakistan to central China) #Islands of eastern Asia (Japan, Taiwan, Philippines) #Pacific islands (New Guinea, Samoa, Fiji, Vanuatu, New Zealand). New Zealand is the place where there are more different species of Coriaria. #America (Mexico to Peru and other group in Chile and western Argentine). ==Uses== Some species of Coriaria are used to produce leather from skins of different animals (cattle, horses). In New Zealand, the Maori people make a juice with the \"fruits\" (actually the petals) of \"tutu\". In Chile, the nuts are used to make poison for rats and mice. Because they produce many bright, colored fruits, some species of Coriaria are used as ornamental plants. ==Species== In the genus Coriaria (y en la familia Coriariaceae) there are about 17 species. # Coriaria angustissima Hook.f. - New Zealand's South Island # Coriaria arborea Linds. - Chatham and Kermadec islands (New Zealand) #* Coriaria arborea var. arborea - Chatham Island (New Zealand) #* Coriaria arborea var. kermadecensis W.R.B.Oliv. - Kermadec Island (New Zealand) # Coriaria duthiei D.K.Singh & Pusalkar - Pakistan to West Himalaya # Coriaria japonica A.Gray - Taiwan, North and Central Japan #* Coriaria japonica subsp. intermedia (Matsum.) T.C.Huang - Taiwan #* Coriaria japonica subsp. japonica - North and Central Japan # Coriaria kingiana Colenso - New Zealand's North Island # Coriaria kweichovensis - Southern and Central China # Coriaria lurida Kirk - New Zealand # Coriaria myrtifolia L. - Western Mediterranean to Italy # Coriaria nepalensis Wall. - Pakistan to Southern and Central China # Coriaria plumosa W.R.B.Oliv. - New Zealand # Coriaria pottsiana W.R.B.Oliv. - New Zealand's North Island # Coriaria pteridoides W.R.B.Oliv. - New Zealand's North Island # Coriaria ruscifolia L. - New Guinea to South Pacific, Mexico to Southwestern Argentina #* Coriaria ruscifolia subsp. microphylla (Poir.) J.E.Skog - New Guinea to New Zealand, Mexico to Peru #* Coriaria ruscifolia subsp. ruscifolia - New Zealand to South Pacific, central & south Chile to southwestern Argentina # Coriaria × sarlurida Cockayne & Allan (Hybrid Formula: C. lurida × C. sarmentosa) - New Zealand # Coriaria × sarmangusta Allan (Hybrid Formula: C. angustissima × C. sarmentosa) - New Zealand # Coriaria terminalis Hemsl. - Central & eastern Himalaya to China (Sichuan) #* Coriaria terminalis var. terminalis - Sikkim to China (Sichuan) #* Coriaria terminalis var. xanthocarpa Rehder & E.H.Wilson in C.S.Sargent - Central & eastern Himalaya to southern Tibet ==References== Category:Shrubs Category:Cucurbitales",
 "title": "Coriaria"
}