{
 "id": "388277",
 "text": "The list of airports in Saudi Arabia includes many locations. \"List of all airports in Saudi Arabia\" at Airport-authority.com; retrieved 2013-3-7. The airline hub airports in Saudi Arabia are King Khalid International Airport in Riyadh and King Fahd International Airport in DammamZuhur, Sherifa. (2011). Saudi Arabia, p. 157. Jeddah is Saudi Arabia's busiest airport, used heavily during the Hajj season. ==Airports== City served Province (emirate) ICAO IATA Airport name International airports Dammam Eastern OEDF DMM King Fahd International Airport Jeddah Makkah (Mecca) OEJN JED King Abdulaziz International Airport Riyadh Riyadh OERK RUH King Khalid International Airport Medina (Madinah) Al Madinah OEMA MED Prince Mohammad Bin Abdulaziz International Airport Regional airports Abha 'Asir OEAB AHB Abha Regional Airport Buraidah Al-Qassim OEGS ELQ Prince Nayef Bin Abdulaziz Regional Airport Jizan (Gizan) Jizan OEGN GIZ Jizan Regional Airport Ha'il Ha'il OEHL HAS Ha'il Regional Airport Tabuk Tabuk OETB TUU Tabuk Regional Airport Ta'if Makkah (Mecca) OETF TIF Ta'if Regional Airport Yanbu Al Madinah OEYN YNB Yanbu Airport Domestic airports Al Bahah (Al-Baha) Al Bahah OEBA ABT Al-Baha Domestic Airport Al-Hofuf, Al-Ahsa Eastern OEAH HOF Al-Ahsa Domestic Airport Al-Jawf Al Jawf OESK AJF Al-Jawf Domestic Airport Al Wajh Tabuk OEWJ EJH Al Wajh Domestic Airport Arar Northern Borders OERR RAE Arar Domestic Airport Bisha 'Asir OEBH BHH Bisha Domestic Airport Dawadmi OEDW DWD Dawadmi Domestic Airport Gurayat (Qurayyat) Al Jawf OEGT URY Gurayat Domestic Airport Hafar Al- Batin (KKMC) Eastern OEKK HBT Hafar Al-Batin Domestic Airport Najran Najran OENG EAM Najran Domestic Airport Qaisumah, Hafar Al-Batin Eastern OEPA AQI Qaisumah Domestic Airport Rafha OERF RAH Rafha Domestic Airport Sharurah Najran OESH SHW Sharurah Domestic Airport Turaif OETR TUI Turaif Domestic Airport Wadi al-Dawasir OEWD WAE Wadi al-Dawasir Domestic Airport Aramco airports Abqaiq Eastern OEBQ Abqaiq Airport Abu Ali, Jubail Eastern OEAA Abu Ali Airport Haradh Eastern OEHR Haradh Airport Jubail Eastern OEJB Jubail Airport Khafji Eastern OE45 Khafji Airport Ras Al-Mishab Eastern OERM Ras Al- Mishab Airport Ras Tanura Eastern OERT Ras Tanura Airport Shaybah Eastern OESB Shaybah Airport Tanajib Eastern OETN Tanajib Airport ==References== == Other websites == * Code for Trade and Transport Locations ... UNLOCODE (SA) * Saudi Arabia Airports",
 "title": "List of airports in Saudi Arabia"
}