{
 "id": "388308",
 "text": "Fond du Lac is a city in Fond du Lac County, Wisconsin, United States. The name is French for bottom (or foot) of the lake. It was named this because of its location at the bottom (south end) of Lake Winnebago. As of the 2020 census, 44,678 people lived there. ==History== Native American tribes lived or gathered in the area long before Europeans got there. These tribes included the Winnebagos , Potawatomi, Kickapoo, and Mascoutin. It is not known who was the first white man to explore the southern end of Lake Winnebago. It is thought to be Claude-Jean Allouez. The first school in Fond du Lac was built in 1843. The first railroad came to Fond du Lac in 1852. Logging and milling were main industries in the late 1880s. ==Geography== The city has a total area of . Of this, is land and is water. == Notable residents == * William Aldrich, U.S. Representative from Illinois * Ed Aspatore, NFL player * Bob Blewett, MLB player * Edward S. Bragg, Union Army general, U.S. Representative, U.S. Ambassador * Edward L. Doheny, American oil tycoon * Charles A. Eldredge, U.S. Representative * Jeanna Giese, first person known to have been successfully treated for rabies without receiving a vaccine. * King Camp Gillette, inventor of the safety razor and founder of The Gillette Company. * Bert Husting, MLB player * Paul O. Husting, U.S. Senator * Edward H. Jenison, U.S. Representative from Illinois * Colin Kaepernick, NFL quarterback for the San Francisco 49ers * Scott McCallum, former Governor of Wisconsin * Hugh J. McGrath, Medal of Honor recipient * Charles Henry Morgan, U.S. Representative from Missouri * William K. Van Pelt, U.S. Representative * Owen A. Wells, U.S. Representative * Charles T. Zimmerman, Distinguished Service Cross recipient ==References== ==Other websites== * City of Fond du Lac * Fond du Lac Area Convention and Visitors Bureau * Early Fond du Lac County People and Places Category:Cities in Wisconsin Category:Fond du Lac County, Wisconsin Category:County seats in Wisconsin",
 "title": "Fond du Lac, Wisconsin"
}