{
 "id": "388487",
 "text": "Richland Center is a city in Richland County, Wisconsin, United States. It is the county seat of Richland County. As of the 2020 census, 5,114 people lived there. ==History== Richland Center was founded in 1851 by Ira Sherwin Hazeltine. Haseltine offered to give land to the county if Richland Center was voted the county seat.Butterfield, C. W. (1884). History of Crawford and Richland Counties, Wisconsin. Springfield, Illinois: Union Publishing Company. pp. 1150-1151. In 1852, the Wisconsin Legislature named Richland Center as the seat for Richland County.\"An Act to Declare the County Seat of Richland County,\" Wisconsin Statutes 1852, c. 37. The Richland County courthouse was built in 1889. In 1876, a railroad branch opened to connect Richland Center with the Chicago, Milwaukee & St. Paul Railroad at Lone Rock, Wisconsin. This gave an outlet for the town's commerce. On October 8, 1882, the town's railway depot was destroyed when a fire lit two kegs of gunpowder inside it. This caused an explosion that tore the roof from the building.Butterfield (1884). p. 1164 Another depot was built in 1909. Today, it is a visitor center for the community.\"Richland Center Visitor Center .\" Richland Chamber & Development Alliance. Retrieved 2011-11-03. Frank Lloyd Wright was born at Richland Center in 1867. ==Geography== The city has a total area of . Of this, is land and is water. ==Notable people== * Svetlana Alliluyeva, only daughter of Joseph Stalin * Lynda Barry, cartoonist * Bradie Ewing, NFL Football player * Joshua L. Johns, U.S. Representative * Gilbert L. Laws, U.S. Representative * Vernon Wallace Thomson, Governor of Wisconsin * Frank Lloyd Wright, architect * Raymond Leo Burke, cardinal ==References== ==Other websites== * City of Richland Center * Richland Center Chamber of Commerce * University of Wisconsin - Richland * Brewer Public Library * Richland Electric Cooperative Category:Cities in Wisconsin Category:Richland County, Wisconsin Category:County seats in Wisconsin Category:1851 establishments in the United States Category:1850s establishments in Wisconsin",
 "title": "Richland Center, Wisconsin"
}