{
 "id": "388527",
 "text": "The Rugrats Movie is a 1998 American animated comedy film based on the Nickelodeon animated television series Rugrats. It was directed by Igor Kovalyov and Norton Virgien and was written by David N. Weiss & J. David Stem. It is about Tommy, the main character, getting a new baby brother named Dil. Tommy is jealous because Dil gets the most attention. Tommy and friends try to return Dil to the hospital in their toy Reptar wagon and manage to get lost in the forest. The Rugrats Movie was released in the United States on November 20, 1998. The film received generally positive reviews from critics, though some criticized its darker tone compared to the television series. The film was a box office success, opening at #1 and grossing a total of $141 million worldwide. It became the first non-Disney animated film to gross over $100 million in the United States. The film was followed by two sequels: Rugrats in Paris: The Movie in 2000 and Rugrats Go Wild in 2003, which is a crossover with The Wild Thornberrys. ==Cast== ===Main=== * E. G. Daily as Tommy Pickles * Tara Strong as Dil Pickles * Christine Cavanaugh as Chuckie Finster * Kath Soucie as Phil, Lil, and Betty DeVille * Cheryl Chase as Angelica Pickles * Jack Riley as Stu Pickles * Melanie Chartoff as Didi Pickles and Grandma Minka * Michael Bell as Drew Pickles, Chas Finster and Grandpa Boris * Tress MacNeille as Charlotte Pickles * Philip Proctor as Howard DeVille, Igor * Joe Alaskey as Grandpa Lou Pickles ===Guest=== * David Spade as Franklin * Whoopi Goldberg as Margaret * Tim Curry as Rex Pester * Hattie Winston as Dr. Lucy Carmichael * Andrea Martin as Aunt Miriam * Cree Summer as Susie Carmichael * Tony Jay as Dr. Lipschitz * Busta Rhymes as Reptar Wagon * Roger Clinton Jr. as Air Crewman * Margaret Cho as Lt. Klavin * Edie McClurg as Nurse * Charlie Adler as United Express Driver * Gregg Berger as Circus TV Announcer * Abraham Benrubi as Serge ===Baby singers=== * Lenny Kravitz * Iggy Pop * Lisa Loeb * Gordon Gano * B-Real * Patti Smith * Jakob Dylan * Phife Dawg * Beck * Lou Rawls * Dawn Robinson * Laurie Anderson * Fred Schneider, Kate Pierson and Cindy Wilson of The B-52's without member Keith Strickland ==Media== ===Home media=== The Rugrats Movie was released on VHS and DVD on March 30, 1999, by Paramount Home Video. The film was also released on Laserdisc on the same day by Pioneer Entertainment. On March 15, 2011, the film was re-released in a three-disc trilogy DVD set alongside its sequels, in honor of Rugrats' 20th anniversary. ===Soundtrack=== The Rugrats Movie: Music from the Motion Picture was released by Interscope Records on November 3, 1998. The enhanced soundtrack contains thirteen tracks, bonus CD-ROM demos, and commercials. Longtime Rugrats composer Mark Mothersbaugh composed the film's musical score. A new track by English rock musician David Bowie, \"(Safe in This) Sky Life\", was written for the film's soundtrack but was ultimately removed. The track was re-recorded as a B-side for Bowie's 2002 single \"Everyone Says 'Hi'\", under the title \"Safe\".\"The Complete David Bowie\" by Nicholas Pegg, (p.151) ===Track listing=== ==Reception== ===Box office=== The film was released on November 20, 1998, and made $27.3 million in its opening weekend, from 2,782 theaters, averaging about $9,821 per venue and ranking number one that weekend, beating Enemy of the State. It would be overtaken by A Bug's Life during its second weekend. The film closed April 4, 1999 in total, The Rugrats Movie made $140.9 million; $100.5 million from the domestic market and $40.4 million from its foreign release. ===Critical reception=== On Rotten Tomatoes, The Rugrats Movie holds an approval rating of based on reviews, with an average rating of . The website's critics consensus reads: \"Charming characters; loads of fun for kids and adults.\" Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale. ==References== ==Other websites== * * * * Category:Paramount Pictures movies Category:Rugrats Category:Nickelodeon animated movies Category:Nickelodeon Movies movies Category:Paramount Pictures animated movies Category:Traditionally animated movies Category:Traditional animation Category:American children's adventure movies Category:1998 movies Category:American family comedy movies Category:Family movies Category:American animated movies Category:1990s family movies",
 "title": "The Rugrats Movie"
}