{
 "id": "388583",
 "text": "Chinua Achebe (born Albert Chinụalụmọgụ Achebe, 16 November 1930 – 22 March 2013) was a NigerianEzenwa-Ohaeto, p. 6. novelist, poet, professor, and critic. He was best known for writing the novel Things Fall Apart which was first printed in 1958.Franklin, Ruth. \"After Empire: Chinua Achebe and the Great African Novel\". The New Yorker, 26 May 2008. Retrieved on 7 December 2010.Ogbaa, p. xv. It is the most widely read book in modern African literature. Achebe went to Nigeria's first university, University College. Achebe wrote his first short story, \"In a Village Church,\" at university. == Life == Achebe was an Igbo man. The Igbo are one of the biggest tribes in Nigeria. His parents were Christians. They gave him the English name Albert. His full Igbo name is \"Chinualumogu,\" which means \"may God fight on my behalf.\" === University === Achebe went to University College in Ibadan to study medicine on a scholarship, but then decided to study English, history, and theology after reading a book written by a white man that made Nigerians and Africans look bad. He wanted to tell the world stories that did not make Africans look bad. Because he switched his field of study, he lost his scholarship. === Writing style === Achebe's writing style is based on how the Igbo tell stories orally (by word of mouth). The Igbo did not write down their stories before Europeans came to Africa. His stories use a lot of folk tales, songs, and proverbs. The characters in his book also make long speeches. === Use of the English language === Many other African writers criticized Achebe for writing in English instead of in an African language. They said that by using the colonizer's language, he was spreading neo-colonial ideas that were preventing progress in Africa. Achebe said that writing in English let everyone in Nigeria read in one language. Before colonization, the different tribes spoke different languages. He also said that writing in English allowed for people in other countries read his stories. However, he says that there are many African concepts and words that cannot be fully expressed in English. Achebe wrote in English but used it in ways that reflected an African style. == Themes == His themes were about the African culture and how harmonious they are === Culture and colonialism === In his writing, Achebe talks about African culture and the effects of European colonization on African societies. === Masculinity and Femininity === Achebe's stories also talk about gender roles. == Influence == Achebe has influenced many other modern African writers. He got a lot of awards for his stories. Even to this day, people still talk about him and the stories he wrote. ==References== Category:1930 births Category:2013 deaths Category:Nigerian writers Category:Recipients of the Nigerian National Order of Merit Award Category:People from Anambra State",
 "title": "Chinua Achebe"
}