{
 "id": "3886",
 "text": "Poetry is written, spoken or sung language that is used in stronger or more original ways than prose is used. Poetry uses the meanings of words as prose does; but it also uses the sounds of words as if they were music, especially rhymes, other repeating sounds, and rhythms (beats or meters).\"poetry\". Oxford Dictionary of Literary Terms (4 ed.), OUP 2015. Online access via Wikipedia Library 2 January 2023. Poetry arranges words and groups of words to make repetitions and parallelisms. Poetry uses figures of speech, ellipses and delayed identification to suggest that there is more meaning in the language. Some people believe that poetry began when language began. They think it is probably \"as old as history and older, present wherever religion is present.\" The English words \"poetry,\" \"poet,\" and \"poem\" first appeared in English in the 14th century. They come from the Latin word poeta, which itself probably comes from poiein, a Greek word that means \"to make.\"\"poetry\". Oxford Dictionary of Literary Terms (4 ed.), OUP 2015. Online access via Wikipedia Library 2 January 2023. There are three major kinds of poetry: lyric, narrative, and dramatic.\"poetry\". Oxford Dictionary of Literary Terms (4 ed.), OUP 2015. Online access via Wikipedia Library 2 January 2023. * Lyric poetry tends to be brief and is often about emotions. * Narrative poetry tells a story with a plot. * Dramatic poetry can be performed as a play. A poem can be as short as a few words or as long as a book. A one-line poem is called a monostich. A poem that is as long as a book is an epic. Poems are often printed on the page as lines and groups of lines called stanzas. There are many different \"poetic forms\" or ways to shape a poem on the printed page or in the ear of the person who hears it. Some forms are: the sonnet, haiku, the ballad, the stev, the prose poem, the ode, free verse, blank verse, limerick, and nursery rhymes. == Related pages == * Acrostic * Anthology * Sonnet * Poet * Free verse * Digital Poetry ==References==",
 "title": "Poetry"
}