{
 "id": "38860",
 "text": "David Keith Lynch (January 20, 1946 – January 15, 2025) was an American movie director, screenwriter and actor. ==Career== Lynch's movies include Eraserhead, Blue Velvet, The Elephant Man and Mulholland Drive. He was also responsible for a television series called Twin Peaks, his overall most famous work. Eraserhead, his first movie, is still his most famous theatrical movie. It was recently deemed socially important by the United States Library of Congress. He has done much work with Jack Nance, who has appeared in many of his movies. He has said that all his movies will be done using digital video from now on. He is also famous for his early short movies. The Alphabet and The Grandmother are two of his best known. The Alphabet is about fear of education. The Grandmother is about a lonely boy who grows a grandmother like a plant from a seed. Over his career, Lynch has received three Academy Award nominations for Best Director and a nomination for best screenplay. Lynch has twice won France's César Award for Best Foreign Film, as well as the Palme d'Or at the Cannes Film Festival. He also won a Golden Lion award for lifetime achievement at the Venice Film Festival. ==Death== In August 2024, Lynch said he was suffering from emphysema. In November 2024, Lynch told People that he quit smoking in 2022, following his emphysema diagnosis. Lynch died on January 15, 2025 at his daughter’s home in Los Angeles, California from cardiac arrest caused by chronic obstructive pulmonary disease and emphysema at the age of 78. ==Discography== === Albums === * BlueBob (with John Neff, 2001) * The Air is on Fire: Soundscape (2007) * Polish Night Music (with Marek Żebrowski, 2008) * Danger Mouse and Sparklehorse: Dark Night of the Soul (2010; Lynch is featured on two songs.) * This Train (with Chrysta Bell, 2011) * Crazy Clown Time (2011) === Singles === * \"Ghost of Love\" (2007) * \"Good Day Today\" / \"I Know\" (2010) ==Filmography== ===Features=== Year Movie Oscars Oscars BAFTA BAFTA Golden Globe Golden Globe Cannes Film Festival Cannes Film Festival Year Movie Nominations Wins Nominations Wins Nominations Wins Nominations Wins 1977 Eraserhead 1980 The Elephant Man 8 7 3 4 1984 Dune 1 1986 Blue Velvet 1 2 1990 Wild at Heart 1 1 1 Palme d'Or Palme d'Or 1992 Twin Peaks: Fire Walk with Me 1997 Lost Highway 1999 The Straight Story 1 2 Palme d'Or 2001 Mulholland Drive 1 2 1 4 Palme d'Or Best Director 2006 Inland Empire 2006 Maharishi ===Short movies=== Year Movie DVD availability Blu-ray availability 1966 Six Men Getting Sick The Short Films of David Lynch Eraserhead Blu-ray 1967 Absurd Encounter with Fear The Lime Green Set 1967 Fictitious Anacin Commercial The Lime Green Set 1968 The Alphabet The Short Films of David Lynch Eraserhead Blu-ray 1970 The Grandmother The Short Films of David Lynch Wild at Heart Blu- ray 1974 The Amputee The Short Films of David Lynch Eraserhead Blu-ray 1988 The Cowboy and the Frenchman The Short Films of David Lynch 1990 Industrial Symphony No. 1 The Lime Green Set 1995 Premonition Following An Evil Deed The Short Films of David Lynch Wild at Heart Blu-ray 2002 Darkened Room Dynamic 1 Lost Highway Blu-ray 2002 Dumbland Wild at Heart Blu-ray 2006 Ballerina Extra on Inland Empire DVD 2007 Absurda 2007 Boat Dynamic 1 Lost Highway Blu-ray 2007 Bug Crawls Dynamic 1 Lost Highway Blu-ray 2007 Industrial Soundscape Dynamic 1 2007 Lamp Dynamic 1 2007 Out Yonder Neighbor Boy Dynamic 1 2007 Intervalometer Experiments Dynamic 1 2008 Scissors The Lime Green Set 2010 Lady Blue Shanghai 2011 The 3 Rs Viennale's website ===Television series=== Year Series Episodes 1990–1991 Twin Peaks 30 1992 On the Air 7 1993 Hotel Room 3 2012 Louie 2 ===Online series=== Year Series Episodes Available on DVD 2002 Rabbits 8 The Lime Green Set DVD 2002 Dumbland 8 The Lime Green Set DVD Out Yonder The Lime Green Set DVD 2009 Interview Project ===Music videos=== Year Song Musician 1990 \"Wicked Game\" (movie version) Chris Isaak 1995 \"Longing\" X Japan 1999 \"Thank You Judge\" David Lynch 2009 \"Shot in the Back of the Head\" Moby 2010 \"I Touch A Red Button Man\" Interpol 2011 \"Crazy Clown Time\" David Lynch ==Awards and nominations== Academy Awards: * 1980: Best Director and Best Adapted Screenplay (The Elephant Man, nominated) * 1987: Best Director (Blue Velvet, nominated) * 2002: Best Director (Mulholland Dr., nominated) BAFTA Awards: * 1981: Best Direction (The Elephant Man, nominated) * 1981: Best Screenplay (The Elephant Man, nominated) Cannes Film Festival: * 1990: Golden Palm (Wild at Heart, won) * 1992: Golden Palm (Twin Peaks: Fire Walk with Me, nominated) * 1999: Golden Palm (The Straight Story, nominated) * 2001: Best Director (Mulholland Dr., won Tied with Joel Coen for The Man Who Wasn't There) * 2001: Golden Palm (Mulholland Dr., nominated) DGA Award: * 1981: Outstanding Directorial Achievement in Motion Pictures (The Elephant Man, nominated) Emmy Awards: * 1990: Outstanding Achievement in Main Title Theme Music (Twin Peaks, nominated) * 1990: Outstanding Achievement in Music and Lyrics (Twin Peaks for the song \"Into the Night\", nominated) * 1990: Outstanding Directing in a Drama Series (Twin Peaks for the pilot episode, nominated) * 1990: Outstanding Writing in a Drama Series (Twin Peaks for the pilot episode, nominated) * 1990: Outstanding Drama Series (Twin Peaks) Golden Globes: * 1980: Best Director (The Elephant Man, nominated) * 1987: Best Screenplay (Blue Velvet, nominated) * 2002: Best Director (Mulholland Dr., nominated) * 2002: Best Screenplay (Mulholland Dr., nominated) Independent Spirit Awards: * 1987: Best Director (Blue Velvet, nominated) * 1987: Best Screenplay (Blue Velvet, nominated) * 2000: Best Director (The Straight Story, nominated) * 2007: Special Distinction Award (Shared with Laura Dern for their collaborative work, won) Saturn Awards: * 1993: Best Writing (Twin Peaks: Fire Walk with Me, nominated) * 1993: Life Career Award (won) * 2002: Best Director (Mulholland Dr., nominated) Venice Film Festival: * 2006: Future Film Festival Digital Award (Inland Empire won) * 2006: Career Golden Lion (won) WGA Award: * 1981: Best Drama Adapted from Another Medium (The Elephant Man, nominated) * 1987: Best Original Screenplay (Blue Velvet, nominated) ==References== Category:1946 births Category:2025 deaths Category:Actors from Montana Category:American movie actors Category:American movie directors Category:American movie producers Category:American screenwriters Category:American television actors Category:American television directors Category:American television producers Category:American television writers Category:People from Missoula, Montana Category:Writers from Montana Category:Deaths from emphysema Category:Deaths from cardiac arrest Category:Deaths from COPD",
 "title": "David Lynch"
}