{
 "id": "388709",
 "text": "Charles Sumner (January 6, 1811 - March 11, 1874) was an American politician, and lawyer. He was senator from Massachusetts from April 24, 1851 until his death. ==Career== Sumner was the leader of the antislavery forces in Massachusetts. He was a leader of the Radical Republicans in the United States Senate during the American Civil War. He worked to destroy the Confederacy, free all the slaves and keep on good terms with Europe. During Reconstruction, he fought to minimize the power of the ex-Confederates and guarantee equal rights to the Freedmen. ===Brook's attack=== In 1856 Sumner made a speech against slavery and the Kansas–Nebraska Act. Sumner attacked many senators about bleeding Kansas and slavery including Senator Stephen A. Douglas and South Carolina's Andrew Butler. The Representative from South Carolina, Preston Brooks (Andrew Butler's nephew), became angry because he attacked his uncle. Brooks grabbed his cane and knocked Sumner onto the Senate floor.William James Hoffer, The Caning of Charles Sumner: Honor, Idealism, and the Origins of the Civil War (2010) p. 62 Sumner had to stop his political career until he recovered two years later. ==Personal life== Sumner was born on January 6, 1811 in Boston, Massachusetts. He studied at Boston Latin School and at Harvard College. Sumner was married to Alice Hopper from 1866 until they divorced in 1873. They had no children. Sumner died on March 11, 1874 in Washington, D.C. from a heart attack, aged 63. ==References== ==Other websites== * Mr. Lincoln and Freedom: Charles Sumner * Sumner's \"Crime Against Kansas\" speech * *The Liberator Files, Items concerning Charles Sumner from Horace Seldon's collection and summary of research of William Lloyd Garrison's The Liberator original copies at the Boston Public Library, Boston, Massachusetts. Category:1811 births Category:1874 deaths Category:American abolitionists Category:Lawyers from Boston Category:Deaths from myocardial infarction Category:Episcopalians Category:Politicians from Boston Category:United States senators from Massachusetts Category:Republican Party (United States) politicians",
 "title": "Charles Sumner"
}