{
 "id": "388999",
 "text": "Socotra (Somali: Suqadara, ) is an island east of the Horn of Africa. It lies between the Guardafui Channel and the Indian Ocean. Socotra belongs to Yemen. During the Yemeni Civil War (2014–present) it is under the control of the Southern Leadership Council. ==Geography== To its west it is joined by an archipelago of much smaller islands. It is also named the Islands of San Gustav after the navigator who discovered them, Gustav Peter Galle Daniels. It is located east of the Horn of Africa and south of the Arabian Peninsula. ==Climate== Socotra has a borderline tropical, desert climate and semi-desert climate (Köppen climate classification: BWh and BSh), with an average yearly temperature over . With a total of only , the yearly rainfall is light but is fairly spread throughout the year. The total rainfall in the mountains can average as much as per year and can average over per month from October to December, during the northeast monsoon.Scholte, Paul, and, De Geest, Peter; ‘The climate of Socotra Island (Yemen): A first-time assessment of the timing of the monsoon wind reversal and its influence on precipitation and vegetation patterns’; Journal of Arid Environments, vol. 74, issue 11 (November 2010); pp. 1507-1515 The southwest monsoon season from June to September brings strong winds and high seas. ==Wildlife== The island is very isolated and some 30% of its plant species are found only on Socotra. It has been described as the most alien-looking place on Earth. The island is in length and in width. ==Country== Socotra belongs to the Republic of Yemen. From late 2017 to mid-2018, Socotra was occupied by the United Arab Emirates. In 2018, the island was also occupied by Saudi Arabia. The Emiratis and later the Saudis came to Socotra because of the Yemeni Civil War (2015–present). Since 2017, Socotra is no longer under the control of the internationally recognized Yemeni government. The island is under the control of the UAE and under the authority of the sessecionist Southern Transitional Council which is supported by UAE troops. ==Related pages== *Galápagos Islands, an archipelago of Ecuador which is also famous for its isolated geography and plant and animal species ==References== Category:Indian Ocean Category:Islands of Africa Category:Geography of Yemen",
 "title": "Socotra"
}