{
 "id": "389159",
 "text": "Cyclothymia (, ), also known as cyclothymic disorder, psychothymia, bipolar type III, affective personality disorder, and cyclothymic personality disorder, is a mental disorder that affects people's moods. People with cyclothymia have waves of depression and elevated mood (hypomania). Cyclothymia is a type of bipolar disorder, but it is different from bipolar type I and II because the depression and hypomania that people with cyclothymia have are not as severe as major depression or mania. The cause of cyclothymia is not known. People are more likely to have cyclothymia if they have family that has bipolar disorder. Treatment for cyclothymia includes therapy and medication. == Symptoms == People with cyclothymia have waves of depression and hypomania. During a depressive phase, people will lose motivation for social activities and hobbies that they used to enjoy. They may feel empty, apathetic, or hopeless. They may also be more irritable or complain more. During a hypomanic phase, people may be more social, energetic, and competitive. They may find it hard to sleep, have more self-esteem, be more distracted easily, and have many different thoughts at once. During a hypomanic phase, people may be more reckless and impulsive. This can include taking dangerous risks or spending a lot of money. It is also common for people who are in a hypomanic phase to be more sexually active or aroused. People with cyclothymia will only have a normal mood for less than two months. Cyclothymia can cause insomnia. However, it can also cause people to feel tired most of the time and sleep for a long time frequently. It can also cause headaches, weakness, and weight loss. People with cyclothymia may also have suicidal thoughts or hurt themselves. Cyclothymia is a type of bipolar disorder, but it is different than bipolar type I and II. Both types have major depressive episodes, while cyclothymic depression is not as severe. People with bipolar type I have manic episodes, which is more severe than hypomania. Cyclothymia is generally seen as a mild version of bipolar.Commentary on Hecker and his work: New translation of Hecker's 1898 paper: == Causes == The cause of cyclothymia is not known. People are more likely to have cyclothymia if they have a family member who has bipolar disorder I or II or major depressive disorder. == Diagnosis == The DSM-5 (Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition) is used to diagnose mental disorders in the United States. The DSM-5 has five criteria that a person needs to have to be diagnosed with cyclothymia. These criteria are: # Periods of elevated mood and depressive symptoms for at least half the time during the last two years for adults and one year for children and teenagers. # Periods of stable moods last only two months at most. # Symptoms create significant problems in one or more areas of life. # Symptoms do not meet the criteria for bipolar disorder, major depression, or another mental disorder. # Symptoms are not caused by substance use or a medical condition. == Treatment == Therapy, such as cognitive behavioral therapy, can be effective for people with cyclothymia. Medications like mood stabilizers and antidepressants are also used. It is generally recommended that people with cyclothymia try mood stabilizers before antidepressants. This is because antidepressants can cause depressive and hypomanic phases to be more frequent and common. == Prevalence == The frequency of cyclothymia is not fully known. This is because people who have it may think they just have mood swings or believe their symptoms are not severe enough to find treatment. The diagnosis criteria in the DSM-5 has been criticized because some people with cyclothymia do not meet the criteria. Sometimes, people get diagnosed with other mental disorders, such as borderline personality disorder. instead of cyclothymia because the disorders have similar symptoms.Kaplan & Sadock's Comprehensive Textbook of Psychiatry (2017), 13.1 Mood Disorders: Historical Introduction and Conceptual Overview => Dysthymia and Cyclothymia. \"It is not always easy to demarcate full-blown syndromal episodes of depression and mania from their subthreshold counterparts commonly observed during the interepisodic periods. The subthreshold conditions appear to be fertile terrain for interpersonal conflicts and postaffective pathological character developments that may ravage the lives of patients and their families. In North America and some Western European countries many such patients end up being labeled with borderline personality disorder, which, unfortunately, often tends to obscure the affective origin of the presenting psychopathology.\" Some studies show that cyclothymia affects 0.4–2.5% of people, while other studies put this number at 5–8%. Males and females are affected the same. However, women usually get treatment more often than men. == History == German psychiatrist Karl Ludwig Kalhbaum identified what would be known as cyclothymia in 1883. He and his student Ewald Hecker named it cyclothymia. The name comes from the from the Greek words (from , , \"circle\") and (, \"mood or emotion\"). The DSM originally listed cyclothymia as a personality disorder and it was called cyclothymic personality disorder. When the DSM-III came out in 1980, the disorder was listed as a mood disorder instead. Cyclothymia has also been described as a personality trait and neurodevelepmental disorder. == References == Category:Bipolar disorder Category:Mental illnesses",
 "title": "Cyclothymia"
}