{
 "id": "389338",
 "text": "Reynaldo Benito Antonio Bignone (January 21, 1928 - March 7, 2018) was an Argentine general. He was the dictatorial President of Argentina from July 1, 1982 to December 10, 1983. In 2010, he was sentenced to 25 years in prison for his role in the kidnappings, torture, and murders of the Dirty War.New York Times: 25 Years for Leader of Argentine Dictatorship Along with Omar Graffigna, he was one of the last two surviving members of the military dictatorship Juntas. Bignone was born on January 21, 1928 in Morón, Buenos Aires, Argentina. He studied at the National War College. He was never married and had no children. On April 20, 2010, Bignone was sentenced to 25 years in prison for his involvement in the kidnapping, torture and murder of 56 people, including guerrilla fighters, Condenan a 25 años de cárcel a Reynaldo Bignone, el último dictador argentino. ELMUNDO. 22/04/10. at the extermination center in the Campo de Mayo military complex.WaPoNPR On April 14, 2011, Reynaldo Bignone was sentenced to life in prison. On December 29, 2011, Bignone received a further 15-year prison sentence for crimes against humanity. That was for setting up a secret torture center inside a hospital during the 1976 military coup. On July 5, 2012, Bignone was sentenced to 15 years in prison. That was for his participation in a scheme to steal babies from parents detained by the military regime. According to the court decision, Bignone was an accomplice \"in the crimes of theft, retention and hiding of minors, as well as replacing their identities.\" Bignone died on March 7, 2018 at the military hospital in Buenos Aires from congestive heart failure caused by septic shock after suffering a broken hip at the age of 90. ==References== Category:1928 births Category:2018 deaths Category:Argentine generals Category:Kidnappers Category:Argentine murderers Category:Politicians from Buenos Aires Category:Presidents of Argentina Category:Prisoners sentenced to life imprisonment",
 "title": "Reynaldo Bignone"
}