{
 "id": "389366",
 "text": "Alajuela is a province of Costa Rica. It is in the north-central part of the country, bordering Nicaragua. The provincial capital is the city of Alajuela. ==Location== The Alajuela province borders the provinces of Heredia to the east, San José to the south, Puntarenas to the southwest and Guanacaste to the west. Nicaragua is to the north of the province. ==Geography== Alajuela is the third largest province of Costa Rica, after the Puntarenas and Guanacaste provinces, with an area of . The province is in the western part of the Central Valley and is crossed by the Cordillera Central (\"Central mountain range) and the volcanic Cordillera de Guanacaste (\"Guanacaste mountain range). In the northern part, along the border with Nicaragua, are the plains of the San Carlos and Frío rivers. Two of the most active Costa Rican volcanoes are in this province: the Poás, high, and the Arenal, high. ==Demographics== The people of the province are known as Alajuelenses, both men and women. The Alajuela province had a population, in 2011, of 848,146, for a population density of inhabitants/km2. The canton of Alajuela, with 254,886 inhabitants, is the canton with more inhabitants. Evolution of the population in Alajuela Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:373 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:900000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:100000 start:0 ScaleMinor = gridcolor:lightgrey increment:50000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1950 text:1950 bar:1963 text:1963 bar:1973 text:1973 bar:1984 text:1984 bar:2000 text:2000 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1950 from:0 till: 148850 bar:1963 from:0 till: 240672 bar:1973 from:0 till: 326032 bar:1984 from:0 till: 427962 bar:2000 from:0 till: 716286 bar:2011 from:0 till: 848146 PlotData= bar:1950 at: 148850 fontsize:S text: 148,850 shift:(-12,5) bar:1963 at: 240672 fontsize:S text: 240,672 shift:(-18,5) bar:1973 at: 326032 fontsize:S text: 326,032 shift:(-18,5) bar:1984 at: 427962 fontsize:S text: 427,962 shift:(-18,5) bar:2000 at: 716286 fontsize:S text: 716,286 shift:(-18,5) bar:2011 at: 848146 fontsize:S text: 848,146 shift:(-18,5) ==Administrative divisions== The Alajuela province is divided in 15 cantons, which are divided into 113 Districts. No. Canton Capital Districts Population (2011) Area (km²) Density (Inh./km²) 1 Alajuela Alajuela 14 2 San Ramón San Ramón de los Palmares 13 3 Grecia Grecia 8 4 San Mateo San Mateo de Alajuela 4 5 Atenas Atenas 8 6 Naranjo Naranjo de Alajuela 8 7 Palmares Palmares de Alajuela 7 8 Poás San Pedro de Poás 5 9 Orotina Orotina 5 10 San Carlos Ciudad Quesada 13 11 Zarcero Zarcero 7 12 Valverde Vega Sarchí 5 13 Upala Upala 8 14 Los Chiles Los Chiles 4 15 Guatuso San Rafael de Guatuso 4 ==Economy== The main economic activity in the province is farming. In the southern part of the province, tropical ornamentals, coffee, tubers, and Leaf vegetables are the major crops. Toward the north and northeast, rice, corn, pineapple, bananas, and sugarcane are important crops. There is also an important cattle raising industry in the province, mainly in the San Carlos canton. Alajuela has attracted many export- orientated manufacturing companies, especially within the free trade zones around the municipality of Alajuela. ==Gallery== File:World's Largest Oxcart Sarchi Costa Rica.JPG|World's Largest Oxcart, Sarchí, Valverde Vega. File:Volcan Arenal, La Fortuna CR 001.jpg|Cattle ranching under the Arenal Volcano File:Arenal at night.jpg|The Arenal Volcano in La Fortuna, San Carlos, is active. Night volcanic eruptions can be seen. File:Poas crater.jpg|Poás Volcano Crater, Poás Volcano National Park ==References==",
 "title": "Alajuela Province"
}