{
 "id": "389410",
 "text": "Limón is a province of Costa Rica. It is in the eastern part of the country along the Caribbean Sea. The provincial capital is the city of Puerto Limón. ==Location== The Limón province borders the provinces of Heredia, Cartago and San José to the west, and Puntarenas province to the southwest. Nicaragua is to the north of the province, Panama to the south and the Caribbean Sea to the east. ==Geography== Limón is the fourth largest province of Costa Rica, after the Puntarenas, Guanacaste and Alajuela provinces, with an area of . It has of the area of Costa Rica. Most of territory of the province is flat land of low altitude but in the southwest is the Cordillera de Talamanca (\"Talamaca mountain range\") with the highest mountain of the country, the Cerro Chirripó, with an altitude of above sea level. The main river of the province is the Reventazón, the second longest river of the country after the Térraba; it is long. ==Weather== Unlike the rest of Costa Rica, Limón has no dry-wet seasons. It rains all the year. The driest months are in September and October. The Köppen climate classification type for the climate at Puerto Limón is a \"Tropical Rainforest Climate\" and of the subtype \"Af\". The average amount of precipitation for the year in Puerto Limón is . The month with the most precipitation on average is July with of precipitation. The month with the least precipitation on average is September with an average of . The average temperature for the year in Puerto Limón is . The warmest month, on average, is May with an average temperature of . The coolest month on average is January, with an average temperature of ==Demographics== The people of the province are known as Limonenses, both men and women. The Limón province had a population, in 2011, of 386,862, of the population of the country. Its population density was inhabitants/km2. The canton of Pococí, with 125,962 inhabitants, is the canton with more inhabitants. Evolution of the population in Limón Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:373 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:450000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:50000 start:0 ScaleMinor = gridcolor:lightgrey increment:25000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1950 text:1950 bar:1963 text:1963 bar:1973 text:1973 bar:1984 text:1984 bar:2000 text:2000 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1950 from:0 till: 41360 bar:1963 from:0 till: 68385 bar:1973 from:0 till: 115143 bar:1984 from:0 till: 168076 bar:2000 from:0 till: 339295 bar:2011 from:0 till: 386862 PlotData= bar:1950 at: 41360 fontsize:S text: 41,360 shift:(-12,5) bar:1963 at: 68385 fontsize:S text: 68,385 shift:(-18,5) bar:1973 at: 115143 fontsize:S text: 115,143 shift:(-18,5) bar:1984 at: 168076 fontsize:S text: 168,076 shift:(-18,5) bar:2000 at: 339295 fontsize:S text: 339,295 shift:(-18,5) bar:2011 at: 386862 fontsize:S text: 386,862 shift:(-18,5) ==Administrative divisions== The Limón province is divided in 6 cantons, which are divided into 29 Districts. No. Canton Capital Districts Population (2011) Area (km²) Density (Inh./km²) 1 Limón Puerto Limón 4 2 Pococí Guápiles 7 3 Siquirres Siquirres 6 4 Talamanca Bribri 4 5 Matina Matina 3 6 Guácimo Guácimo 5 ==Economy== The main economic activity in the province is farming, with plantations of banana, pineapple, cacao, pejibaye and other tropical crops. In the province is the port of Moín, the most important in the country. ==Gallery== File:Puerto Limon.JPG|Puerto Limón File:Limón - Catedral.jpg|Cathedral of Limón File:Chirripó Grande Costa Rica hogar de Sibú.jpg|The Cerro Chirripó |Monument to the Development of the Limón Province ==References==",
 "title": "Limón Province"
}