{
 "id": "389606",
 "text": "Sinéad Marie Bernadette O'Connor (8 December 1966 - 26 July 2023) was an Irish singer-songwriter. She was perhaps most famous for performing the 1990 Prince song \"Nothing Compares 2 U\" which was nominated for three Grammy Awards. ==Career== In 1991, she refused her Grammy Award for Best Alternative Album. On 11 June 1992 she met Craig Fraser at a bar in Tintagel, Cornwall. They were an item until September 1992 when Fraser's alcohol abuse stripped away their relationship. On 3 October 1992, O'Connor appeared on Saturday Night Live as a musical guest. She sang an a cappella version of Bob Marley's \"War\". She meant it as a protest against sexual abuse of children in the Catholic Church. She then showed a photo of Pope John Paul II to the camera while singing the word \"evil\", after which she ripped the photo into pieces and threw the pieces towards the camera. This happened nine years before John Paul II said that there was sexual abuse within the Church. She was an Independent Catholic priest, rejecting the authority of Rome. She was openly bisexual, and had four children, each by a different father. All her four marriages ended in divorce. She was diagnosed with bipolar disorder in 2005. She released nine studio albums. Her last album, How About I Be Me (And You Be You)? was released in 2012. She released the second single from it, \"4th and Vine\" in February 2013. In October 2018, O'Connor she had converted to Islam, calling it \"the natural conclusion of any intelligent theologian's journey.\" She changed her name to Shuhada' Sadaqat. ==Death== O'Connor died on 26 July 2023 at her home in Herne Hill, London at the age of 56.Sinéad O’Connor, acclaimed Dublin singer, dies aged 56 The cause of death was chronic obstructive pulmonary disease and bronchial asthma. ==Discography== ;Studio albums * The Lion and the Cobra (1987) * I Do Not Want What I Haven't Got (1990) * Am I Not Your Girl! (1992) * Universal Mother (1994) * Faith and Courage (2000) * Sean-Nos Nua (2002) * Throw Down Your Arms (2005) * Theology (2007) * How About I Be Me (And You Be You) (2012) * I'm Not Bossy, I'm the Boss (2014) == References == Category:1966 births Category:2023 deaths Category:Bisexual people Category:Christians Category:Irish LGBT people Category:Irish rock musicians Category:Irish singer-songwriters Category:LGBT musicians Category:People with bipolar disorder Category:Singers from Dublin Category:Muslims Category:People excommunicated by the Catholic Church Category:Deaths from COPD Category:Deaths from asthma",
 "title": "Sinéad O'Connor"
}