{
 "id": "389991",
 "text": "Joss Stone (born Jocelyn Eve Stoker on 11 April 1987) is a British soul singer-songwriter and actress. She was born in Dover and spent her teenage years in Ashill, Mid Devon. She still lives in Mid Devon. Stone became famous in late 2003 with her album The Soul Sessions. It was nominated for the Mercury Prize. Stone's first single \"Fell in Love with a Boy\" was released in 2004. It reached number 18 in the UK Singles Chart. \"You Had Me\" was released as the first single from Stone's second album. It is Stone's most successful single. She sang on the 2004 number one Christmas single \"Do They Know It's Christmas?\" as part of Band Aid 20. Her second album Mind Body & Soul went straight to number one in the UK Albums Chart. Stone sung on \"Anniversary\" on Lemar's 2006 album The Truth About Love. Stone's third album Introducing Joss Stone was released in 2007. It was produced by Raphael Saadiq. Stone won Best R&B; Performance by a Duo or Group with Vocals for her cover of \"Family Affair\" with John Legend and Van Hunt. In 2009 Stone's fourth album Colour Me Free! was released. Stone sang on the song \"Who's Your Daddy\" on Ringo Starr's 2010 album Y Not. In 2011 LP1 was released. In 2012 The Soul Sessions Vol.2 was released by Stone'd Records. ==Discography== *The Soul Sessions (2003) *Mind Body & Soul (2004) *Introducing Joss Stone (2007) *Colour Me Free! (2009) *LP1 (2011) *The Best of Joss Stone 2003–2009 (2011) *The Soul Sessions Vol. 2 (2012) *Water for Your Soul (2015) ==References== == Other websites == * *Official website Category:1987 births Category:Living people Category:Actors from Devon Category:Actors from Kent Category:Brit Award winners Category:British soul musicians Category:British blue-eyed soul singers Category:English blue-eyed soul singers Category:English singer- songwriters Category:English television actors Category:British Grammy Award winners Category:Musicians from Devon Category:Musicians from Kent Category:People with dyslexia",
 "title": "Joss Stone"
}