{
 "id": "390080",
 "text": "Jay Robert Inslee (born February 9, 1951) is an American politician. In 2013, he became the 23rd Governor of the US state of Washington. Before becoming the governor, he was a United States Congressman in the House of Representatives for more than 20 years. He is a member of the Democratic Party. Inslee is known for climate change policies and for his education reforms in Washington state. He was Chair of the Democratic Governors Association from 2018 to 2019. On March 1, 2019, Inslee announced his campaign for President of the United States. He ended his campaign on August 21, 2019. ==Early life== Inslee was born in Seattle, Washington. He graduated from the University of Washington and Willamette University College of Law. A politically active student, he became a criminal prosecutor after graduation. ==Early political career== He was in the Washington House of Representatives from 1989 to 1993. In 1992, Inslee was elected to represent in the United States House of Representatives. He was defeated for reelection in 1994. Inslee briefly returned to private legal practice. He made his first run for Governor of Washington in 1996, but lost. He was regional director for the United States Department of Health and Human Services under President Bill Clinton. ==Congress== Inslee returned to the U.S. House of Representatives in 1999, this time for . He was reelected six times before announcing that he would make another run for governor in the 2012 election. He resigned from Congress to focus on his campaign. ==Governor of Washington== He defeated Republican Rob McKenna, the Attorney General of Washington. Inslee was reelected to a second term in 2016, defeating Republican Seattle Port Commissioner Bill Bryant, 54% to 46%. He became known nationwide for his climate change reforms and for his criticisms of President Donald Trump. Inslee, State Attorney General Bob Ferguson and State Solicitor General Noah Purcell sued the Trump Administration over Executive Order 13769. The case led to the order being blocked by the courts and it was later superseded by other executive orders. He left office on January 15, 2025. ==2020 presidential run== In December 2018, Inslee created a PAC to raise money for a possible presidential bid in the 2020 election. On January 2, 2019, it was reported that Inslee was beginning to form an exploratory committee, the first step in a campaign. On February 27, 2019, it was reported that Inslee would soon launch a campaign. He formally did so on March 1, 2019 in Seattle. He ended his campaign on August 21, 2019 citing low polling numbers. ==Personal life== Inslee lives on Bainbridge Island, Washington. He and his wife Trudi have 3 children. He married Trudi in 1972. He follows the Protestantism religion. ==References== ==Other websites== *Governor Jay Inslee official government site * *Profile at the Biographical Directory of the United States Congress * Category:1951 births Category:Living people Category:2020 United States presidential candidates Category:American Protestants Category:American environmentalists Category:Governors of Washington (state) Category:Politicians from Seattle Category:United States representatives from Washington Category:Democratic Party (United States) politicians",
 "title": "Jay Inslee"
}