{
 "id": "390023",
 "text": "The Boeing 737 Next Generation, often called the 737NG, is a family of Boeing 737s. The 737-600, -700, -800 and -900 are all 737NG aircraft. It is the third family of Boeing 737. The family which came before it is the 737 Classic (−300/-400/-500) family. They have been made since 1991 by Boeing Commercial Airplanes. All 737s are twin-engined, narrow-body airliners. This means that they all have two engines and only have one aisle between seats. 4,293 737NG aircraft have been delivered (as of December 2012). More than 6,300 have been ordered by airlines.\"737 Model Orders and Deliveries data.\" Boeing, March 2011. Retrieved April 19, 2011.\"Boeing Delivers 100th Next-Generation 737-900ER.\" Kompas.com. Retrieved November 23, 2011. Southwest Airlines has more 737NGs than any other airline. Ryanair, a low-cost airline from Ireland, also has a lot of 737NGs. The only planes Ryanair has are 737-800s. The main rival of the 737NG family is the Airbus A320 family. The Boeing 737 MAX will eventually replace the 737NG. == Design and development == === Background === After Airbus launched the Airbus A320, Boeing started designing a new series of Boeing 737. The 737 Next Generation (NG) program was announced on November 17, 1991. Boeing made many changes from the 737 Classic, like the wings. These changes made its area bigger by 25 percent. The wingspan was 16 ft (4.88 m) bigger than the Classic. These changes also meant that it could carry 30% more fuel. CFM56-7B engines were used, allowing the 737NG to fly 900 nautical miles (about 1036 miles) farther. === Interior === The inside of the 737 Next Generation was better than the style used on the Boeing 757-200 and the Boeing 737 Classic. It used certain parts of the Boeing 777's inside style. The style of the 737 Next Generation was made into the usual style of the Boeing 757-300. In 2010, the inside of the 737NG was re-designed to look like the Boeing 787 Dreamliner. The new design was called the Boeing Sky Interior. However, the Sky Interior can only be put into new aircraft. === Making and testing === The first 737NG was a 737−700. The prototype 737−800 was finished on June 30, 1997 and first flew on July 31, 1997. The smallest 737NG, the 737−600 series, is the same size as the 737−500. On August 18, 1998, the FAA gave it permission to fly.Shaw 1999, pp. 14–15. === Further developments === In July 2008, Boeing brought new brakes for 737NGs. They were supposed to replace the steel brakes originally added. They made the brakes lighter. The lost by the new installation on the Boeing 737-800 meant that 0.5% less fuel will be burned while in the air. Delta Air Lines got the first new 737NG with these brakes. That plane was a 737-700.\"Boeing Next-Generation 737 Carbon Brakes Earn FAA Certification.\" Boeing Press Release, August 4, 2008. Retrieved August 30, 2009. On August 21, 2006, Sky News had said that some 737NGs had faulty parts. The report said that Boeing had found some parts of the plane to be faulty, but they had decided not fix it. Boeing said that these statements were \"without merit\".\"Report alleges faulty parts in jets.\" United Press International, August 21, 2006. Retrieved August 22, 2006. However, another show looked at 737NGs and also thought that some things were faulty.Al Jazeera English \"Boeing Safety Claims Investigated.\" youtube.com, December 15, 2010. == Replacement == Since 2006, Boeing was thinking about replacing the 737 with a very different and new design.\"Boeing firms up 737 replacement studies by appointing team.\" Flight International, March 3, 2006. Retrieved April 13, 2008. On July 20, 2011, Boeing announced that it would make a new version of the 737. The new variation would have 2 CFM International LEAP-X engine. American Airlines said it would order 100 of these planes.\"Boeing and American Airlines Agree on Order for up to 300 Airplanes\". Boeing, July 20, 2011. Retrieved November 1, 2011. The new version was finished in 2016.Ostrower, Jon. \"Boeing close to re-engined 737 fan size decision.\" Air Transport Intelligence news via FlightGlobal.com, August 18, 2011. Retrieved August 20, 2011. On August 30, 2011, Boeing said it would definitely make this new plane. They called it the Boeing 737 MAX.Boeing 737 MAX. NewAirplane.com The CFM International LEAP-1B engines that it uses burns 16% less fuel than the Airbus A320neo family.\"Boeing Launches 737 New Engine Family with Commitments for 496 Airplanes from Five Airlines.\" boeing.mediaroom.com, August 30, 2011.\"Boeing officially launches re-engined 737.\" flightglobal.com, August 30, 2011.Board Approves Re-Engined 737&channel;=comm \"Boeing Board Approves Re-Engined 737.\" Aviation Week, August 30, 2011. The Boeing 737 MAX's main rival is the Airbus A320neo family. ==Variants== ===737-600=== The 737-600 replaced the 737-500. Its main rival is the Airbus A318. 69 737-600s have been made. As of 2012, Boeing has taken the 737-600 out of its list of prices. This might mean that the 737-600 is not being made anymore. Only four airlines operate it now, those airlines are Air Algérie, Aeroflyer, Janet Airlines and Kelowna flightcraft. [note: could someone make pages for these airlines please?] ===737-700=== The 737-700 replaces the 737-300. It began its usage in 1998.\"Boeing 737-600/700.\" airliners.net. Retrieved February 4, 2008. Its main rival is the Airbus A319. Southwest Airlines currently has the most 737-700s. They have more than 400 of them. The 737-700C is a version where the seats can be taken out to carry cargo instead. There is a big door on the left of the aircraft. The United States Navy got the first 737-700C. The Navy planes are called the C-40 Clipper.\"U.S. Naval Reserve Gets First Look at Newest Class of Aircraft.\" DefenseLink (U.S. Department of Defense). Retrieved January 21, 2008. ====737-700ER==== The 737-700ER (\"ER\" means \"extended range\") came out on January 31, 2006.\"Boeing Launches Longest-Range 737 with ANA.\" It can fly for .\"Boeing 737-700ER Technical Information\". Boeing The 737-700ER's main rival is the Airbus A319LR. ===737-800=== The 737-800 is a longer version of the 737-700. It replaces the 737-400. For many airlines in the United States, the 737-800 replaced Boeing 727-200s. The 737-800 is one of the planes which replaces the McDonnell Douglas MD-80. It burns of fuel every hour. That is about 80% less fuel than an MD-80.Wallace, James. \"Aerospace Notebook: MD-80 era winding down as fuel costs rise.\" Seattlepi.com, June 24, 2008. Retrieved August 30, 2009. On August 14, 2008, American Airlines said it was ordering 26 737-800s.\"Boeing, American Airlines Finalize Deal for 26 Next-Generation 737s.\" Boeing Press Release, August 14, 2008. Retrieved August 30, 2009. 2,135 737-800s have been delivered. The 737-800's main rival is the Airbus A320. ===737-900=== The 737-900 is the longest 737 ever made. Alaska Airlines got the first -900 on May 15, 2001. The 737-900 has the same MTOW as the 737−800. It also does not carry any more fuel. The 737-900 can carry more luggage but cannot fly as far. This meant that it could not be a rival to the Airbus A321. ====737-900ER==== The 737-900ER (\"ER\" stands for \"extended range\") is the newest Boeing 737. It was made to replace the 757-200. It was also made to be a rival to the Airbus A321. The 737-900ER can carry more fuel than other 737s. The first ever 737-900ER was finished on August 8, 2006. Lion Air got the first 737-900ER on April 27, 2007. Lion Air has ordered 166 737-900ERs as of August 2011. On August 22, 2011, it was said that Delta Air Lines ordered 100 737-900ERs. That is the biggest single order for this type of 737.\"Air Transport Intelligence news: Delta to cap its narrowbody order at 100 737-900ERs.\" Flightglobal, August 22, 2011. Retrieved August 22, 2011. ==Users== As of July 2010, 3,119 Boeing 737 Next Generation planes are being used by airlines. There are 62 -600s, 1,019 -700s, 1,915 -800s and 123 -900s.\"World Airliner Census\". Flight International, pp. 26–49. August 24–30, 2010. ==Orders and deliveries== Boeing 737 Next Generation Orders and Deliveries Model Series Orders Deliveries Commercial Jets Total Unfilled Total 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 737-600 69 69 10 3 3 6 5 4 6 24 8 737-700 1,316 230 1,086 7 43 23 51 61 101 103 93 109 80 71 85 75 96 85 3 737-700C 17 2 15 1 2 1 1 2 2 3 3 737-700W 14 14 2 2 5 2 1 1 1 737-800 4,132 1,379 2,753 351 283 323 283 190 214 172 104 78 69 126 168 185 133 65 737-800A 40 20 20 9 12 1 3 2 737-900 52 52 6 6 11 8 21 737-900ER 520 370 150 44 24 15 28 30 9 Total 6,160 2,001 4,159 411 365 366 367 284 324 291 208 199 167 213 281 269 253 158 3 Business Jet 737-700BBJ 115 5 110 2 7 4 4 4 6 9 3 3 3 8 13 11 25 8 737-800BBJ 21 3 18 2 2 1 2 1 3 2 5 737-900BBJ 7 1 6 4 1 1 Total 143 9 134 4 7 10 5 6 6 11 4 3 6 10 18 11 25 8 Grand Total 6,303 2,010 4,293 415 372 376 372 290 330 302 212 202 173 223 299 280 278 166 3 Data through December 31, 2012. Updated on January 7, 2013. ==Accidents== The Boeing 737 Next Generation series has been involved in 8 hull-loss accidents and 7 hijackings. people have died in these.\"Accident statistics for Boeing 737-600.\" aviation-safety.net. Retrieved May 22, 2010.\"Accident statistics for Boeing 737–700.\" aviation-safety.net. Retrieved May 22, 2010.\"Accident statistics for Boeing 737–800.\" aviation-safety.net. Retrieved May 22, 2010.\"Accident statistics for Boeing 737–900.\" aviation- safety.net Retrieved May 22, 2010. A hull-loss accident is an accident where the plane is damaged so much it cannot be repaired, or if it is completely destroyed.The most notable accidents are shown here. * While landing at Chicago Midway International Airport on December 8, 2005, Southwest Airlines Flight 1248, a B737-7H4, was not able to stop before the end of the runway.It then crashed onto. some cars on a street, killing a six-year-old boy. People on board the plane had injuries that were not serious. The plane later became a N286WN after repairs.\"ASN Aircraft accident Boeing 737-7H4 N471WN Chicago- Midway Airport, IL (MDW) .\"aviation-safety.net Retrieved November 2, 2013. * On September 29, 2006, Gol Transportes Aéreos Flight 1907, a 737-8EH, crashed into a Embraer Legacy 600 over Mato Grosso.The 737 crashed into a rainforest, while the Legacy was able to make an emergency landing.154 died in the accident(everyone on the 737)and 7 survived(everyone on the Legacy).\"ASN Aircraft accident Boeing 737-8EH PR-GTD Peixoto Azevedo, MT \" Aviation Safety Network.Retrieved November 2, 2013. * Kenya Airways Flight 507 crashed shortly after takeoff from Douala Airport, Cameroon into a swamp on 5th May 2007 at night.The pilots did not know that the plane was turning to the right by itself, and after the captain turned the plane further, the plane started to descend and the crash followed. All 114 onboard are killed.\"ASN Aircraft accident Boeing 737-8AL 5Y-KYA Douala Airport (DLA)\"'. Retrieved 11th November 2013. * China Airlines Flight 120 caught fire and exploded after landing at Naha Airport on 20th Aug 2007.There was a fuel leak on the right wing as it was damaged when the flaps were retracted after landing.Fuel flowed to high- temperature areas near the right engine,causing a fire. All 165 survived the accident as they left the plane before the fire spread into the passenger cabin.\"ASN Aircraft Accident Boeing 737-809 B-18617 Okinawa-Naha Airport(OKA) \".Retrieved 11th November 2013. * Due to birdstrike, the nose, wings and engines of Ryanair flight 4102 were damaged while the plane was landing at Rome Ciampino Airport on November 10, 2008. The plane stopped on the runway with the left main landing gear collapsed. Although none of the 172 onboard were injured, the plane was written off.\"ASN Aircraft Accident Boeing 737-8AS EI-DYG Roma-Ciampino Airport (CIA)\" Aviation Safety Network. Retrieved February 27, 2014. * Turkish Airlines Flight 1951 crashed while landing at Amsterdam Schiphol Airport on February 25, 2009. Investigators later discovered that one of the altimeters, which show how high the plane is flying, was wrong. This led the autopilot to switch the engines to \"idle\", and the engines only produced a small amount of thrust. As the plane flew on, it eventually stalled, and started descending. The pilots did not realise this until the warning started, and did not control the plane properly to recover from the stall, causing the crash. 9 people were killed.\"ASN Aircraft Accident Boeing 737-8F2 TC-JGE Amsterdam-Schiphol International Airport (AMS) \" Aviation Safety Network. Retrieved February 27, 2014. * Just after takeoff from Beirut International Airport in Lebanon on January 25, 2010, Ethiopian Airlines Flight 409 crashed into the sea, killing all 90. While the Lebanese investigators blamed the pilots for not controlling the plane properly causing a loss of control,\"ASN Aircraft Accident Boeing 737-8AS (WL) ET-ANB Beirut International Airport (BEY)\" Aviation Safety Network. Retrieved February 27, 2014. Ethiopian Airlines thought that the Lebanese were incorrect, saying that the plane could have been struck by lightning, or even shot down by a missile.\"Pilot Error Probable Cause of Ethiopian Airlines 737 Crash\" Flightglobal, March 28, 2011. Retrieved February 27, 2014. * Air India Express Flight 812, a Boeing 737-8HG, was not able to stop before the end of the runway while landing at Mangalore Airport in India on May 22, 2010. The plane continued out of the airport and fell into a gorge, killing 158 people. The accident was determined to caused by pilot error. This is the worst ever crash of a Boeing 737 aircraft. ==Details== Boeing 737 Next Generation details 737-600 737-700 / 737-700ER 737-800 737-900ER Cockpit crew Two Two Two Two Length 102 ft 6 in (31.2 m) 110 ft 4 in (33.6 m) 129 ft 6 in (39.5 m) 138 ft 2 in (42.1 m) Wingspan 117 ft 5 in (35.7 m) 117 ft 5 in (35.7 m) 117 ft 5 in (35.7 m) 117 ft 5 in (35.7 m) Overall height 41 ft 3 in (12.6 m) 41 ft 2 in (12.5 m) 41 ft 2 in (12.5 m) 41 ft 2 in (12.5 m) Service ceiling 41,000 ft (12,500 m) 41,000 ft (12,500 m) 41,000 ft (12,500 m) 41,000 ft (12,500 m) Cruising speed Mach 0.785 (447 kt, 514 mph, 828 km/h) Mach 0.785 (447 kt, 514 mph, 828 km/h) Mach 0.785 (447 kt, 514 mph, 828 km/h) 0.78 (444 kt, 511 mph, 823 km/h) Maximum speed Mach 0.82 (475 kt, 544 mph, 876 km/h) Mach 0.82 (475 kt, 544 mph, 876 km/h) Mach 0.82 (475 kt, 544 mph, 876 km/h) Mach 0.82 (475 kt, 544 mph, 876 km/h) Engine (× 2) CFM 56-7B20 CFM 56-7B26 CFM 56-7B27 CFM 56-7B27 Sources: Boeing 737 Specifications,Boeing 737 Technical Information, Boeing Commercial Airplanes. 737 Airport Planning ReportBoeing 737 Airplane Characteristics for Airport Planning, Boeing Commercial Airplanes. ==Related pages== ==References== ===Notes=== ===Bibliography=== * Endres, Günter. The Illustrated Directory of Modern Commercial Aircraft. St. Paul, Minnesota: MBI Publishing Company, 2001. . * Norris, Guy and Mark Wagner. Modern Boeing Jetliners. Minneapolis, Minnesota: Zenith Imprint, 1999. . * Shaw, Robbie. Boeing 737–300 to 800. St. Paul, Minnesota: MBI Publishing Company, 1999. . ==Other websites== *737 page on Boeing.com *Boeing 737-600/700/800/900 on Aerospace-Technology.com *Boeing 737NG on Smartcockpit.com 737 Next Generation",
 "title": "Boeing 737 Next Generation"
}