{
 "id": "390195",
 "text": "The Boeing 737 MAX is a new family of Boeing 737. It is made by Boeing Commercial Airplanes. These airplanes replaced the Boeing 737 Next Generation family. It is the fourth family of 737. The biggest change is the engines. The 737 MAX has new, better CFM International LEAP-1B engines. The outside of the plane also got changes. The very first 737 MAX was delivered in 2017, 50 years after the first Boeing 737 took off. Boeing had 4,166 orders for the 737 MAX as of September 2022. Larger and smaller versions have different capacity and range. After two fatal crashes of MAX 8 aircraft in October 2018 and March 2019, regulatory authorities around the world ordered airlines to stop using MAX 8 and MAX 9 airplanes until the reason for the crashes is found. Boeing stopped making them for a few months in early 2020, and resumed at a slow rate. Various regulatory authorities authorized a return to service in December 2020 and January 2021. ==Development== Since 2006, Boeing has been thinking about replacing the 737 with a completely new design.\"Boeing firms up 737 replacement studies by appointing team.\" Flight International, March 3, 2006. Retrieved April 13, 2008. In 2010, Airbus said it was making the Airbus A320neo family, which is an improved version of the Airbus A320 family. Airlines started ordering a lot of A320neos. AirAsia and IndiGo are examples. This made Boeing's managers allow the 737 MAX to be developed on August 30, 2011. Boeing said that the 737 MAX will use 16% less fuel than the Airbus A320 and 4% less than the Airbus A320neo. Boeing thinks the 737 MAX will be able to fly farther than Airbus A320neo. The first 737 MAX aircraft is supposed to be delivered in 2017. The 737 MAX only has three types. They are the 737 MAX 7, 737 MAX 8 and 737 MAX 9. The 737 MAX 7 will replace the 737-700, the 737 MAX 8 will replace the 737-800 and the 737 MAX 9 will replace the 737-900ER. The -700, -800 and -900ER sold the most out of the 737 Next Generation family.\"737 Model Orders and Deliveries data.\" Boeing, September 2011. Retrieved October 11, 2011. At first, Boeing would not say which airlines had ordered 737 MAX planes (except American Airlines). On November 17, 2011, Boeing said that nine airlines had ordered 700 planes. On December 13, 2011, Southwest Airlines said they had ordered 150 aircraft. In December 2011, Boeing had 948 orders from 13 airlines. In January 2012, Norwegian Air Shuttle said it had ordered 100 Boeing 737 MAX planes. This is the first 737 MAX order from Europe. In July 2012, Virgin Australia said it would buy 23 MAX aircraft. Later that month, Air Lease Corporation (ALC) said it would buy 75 MAX aircraft.Boeing Gets $7.2 Bln Order From Air Lease On July 12, 2012 United Airlines said it would order 100 Boeing 737 MAX 9 and 50 737-900ER aircraft. This entire order costs $14.8 billion.United Airlines Orders 150 Boeing 737s, Including 100 737 MAX 9s In late July 2012, Aeromexico said it would buy 90 737 MAX 8 aircraft. In August 2012, Silk Air said it would order 31 737 MAX 8 and 23 737-800 aircraft.SilkAir signs LOI for 31 Boeing 737-8s, 23 737-800sBoeing: News Releases In September 2012, Avolon said it had ordered 10 737 MAX 8s, 5 737 MAX 9s and 10 737-800s. On October 1, 2012, Gol Transportes Aéreos said it has ordered 60 737 MAX 8s.Gol orders 60 737 MAX aircraft On October 3, GECAS ordered 75 737 MAX 8s and 10 737-800s.Boeing, GECAS Finalize Order for up to 100 737 MAXs and Next-Generation 737s – Oct 3, 2012GECAS finalizes 737 order | ATWOnline On the same day, 22 Boeing 737 MAX 8s were ordered. The airline who ordered these planes is not known. On October 11, 2012, Alaska Airlines ordered 50 Boeing 737s, 20 737 MAX 8, 17 737 MAX 9, and 13 Boeing 737-900ERs.Boeing, Alaska Airlines Announce Order for 737 MAXs and Next-Generation 737s – Oct 11, 2012 On November 4, 2012, ALAFCO ordered 20 Boeing 737 MAX 8s. On November 5, 2012, Aeromexico bought 90 Boeing 737 MAX 8s and 9s. On December 6, 2012, Icelandair bought 12 Boeing 737 MAX aircraft (8 MAX 8s, and 4 MAX 9s). On January 2, 2013, Aviation Capital Group (ACG) bought 60 737 MAX aircraft. 50 of them are the MAX 8. 10 are the MAX 9. This order has the 1,000th order in it. On February 7, 2013, American Airlines said it would definitely buy 100 Boeing 737 MAX 8s. On February 13, 2012, Icelandair made its order bigger. They have now bought 16 aircraft (9 Boeing 737 MAX 8s, and 7 Boeing 737 MAX 9s). On May 14, 2013, Turkish Airlines ordered 50 737 MAX aircraft (40 MAX 8s, 10 MAX 9s). ==Design== Boeing spent a lot of 2011 looking at two different diameters of CFM International LEAP-1B engine: or . Both of these would mean that Boeing would have to make some changes to the wheels, because the engines need to be above the ground. Boeing said the bigger engine would use less fuel. However, because it is bigger, it would make more drag and be heavier. This would mean that even more changes would be needed. Both engines are bigger than the CFM56-7B engines on the Boeing 737 Next Generation. The new engine will use 10–12% less fuel than the engines on the 737NG. It has been said that Boeing are looking at parts of the plane that can be changed to make less drag and burn less fuel. In November 2011, Boeing said it would use the diameter engine. The landing gear will need to be made longer by 6–8 inches (15–20 cm). This is to make sure the engines stay above the ground.\"Boeing reveals 737 Max configuration details\". Flight International, November 3, 2011. Boeing will probably say exactly what the 737 MAX looks like sometime in 2013. On May 17, 2012, Boeing said the engine's diameter had been made bigger. This means it is now 69.4 inches (176 cm). The 737 MAX will have the Boeing Sky Interior. The Boeing Sky Interior is like the cabin of the Boeing 787 Dreamliner. The 737 MAX will also have winglets. The winglets used on the 737 MAX will be different to the winglets on the 737NG. Boeing says the new winglets will help the plane use 1.5% less fuel. Boeing does not want to change the cockpit because they want it to be similar to the cockpit on the 737NG. Boeing also wants to add some more fly-by-wire to the 737 MAX. However, Boeing said that changes will be \"very minimal\". ==Types of Boeing 737 MAX== * 737 MAX 7 – Replaces the Boeing 737-700 * 737 MAX 8 – Replaces the Boeing 737-800 * 737 MAX 8-200 * 737 MAX 9 – Replaces the Boeing 737-900ER * 737 MAX 10 ==Details== Boeing 737 MAX details 737 MAX 7 737 MAX 8 737 MAX 9 Length 110 ft 4 in (33.6 m) 129 ft 6 in (39.5 m) 138 ft 2 in (42.1 m) Wingspan 117 ft 9 in (35.9 m) 117 ft 9 in (35.9 m) 117 ft 9 in (35.9 m) Height 41 ft 0 in (12.5 m) 41 ft 0 in (12.5 m) 41 ft 0 in (12.5 m) Cruising speed Mach 0.79 (522 mph, 842 km/h) Mach 0.79 (522 mph, 842 km/h) Mach 0.79 (522 mph, 842 km/h) Engine (× 2) CFM LEAP-1B CFM LEAP-1B CFM LEAP-1B Sources: Boeing 737 specificationsBoeing 737 Technical Information, Boeing Commercial Airplanes.Flight, Boeing Defines the 737 MAX ==Orders== Boeing 737 MAX firm orders Order made on Country Customer Type Amount United States Southwest Airlines 737 MAX 8 150 Norway Norwegian Air Shuttle 737 MAX 8 100 Indonesia Lion Air 737 MAX 9 201 Australia Virgin Australia 737 MAX 8 23 United States Air Lease (ALC) 60 737 MAX 8, 15 737 MAX 9 75 United States United Airlines 737 MAX 9 100 Ireland Avolon 10 737 MAX 8, 5 737 MAX 9 15 Unknown Unknown 737 MAX 57\"737 Model Orders and Deliveries data.\" Boeing, January 2013. Retrieved February 14, 2013. Brazil Gol Transportes Aéreos 737 MAX 8 60 United States/Ireland GECAS 737 MAX 8 75 United States Alaska Airlines 20 737 MAX 8, 17 737 MAX 9 37 Kuwait ALAFCO 737 MAX 8 20 Mexico Aeromexico 737 MAX 8 60 Singapore SilkAir 737 MAX 8 31 United States Aviation Capital Group 50 737 MAX 8, 10 737 MAX 9 60 United States American Airlines 737 MAX 8 100 Iceland Icelandair 9 737 MAX 8, 7 737 MAX 9 16 Turkey Turkish Airlines 40 737 MAX 8, 10 737 MAX 9 50 Totals 1,285 ==Related pages== ==References== ==Other websites== * Boeing 737 MAX page on Boeing.com * Boeing 737 MAX on Boeing's NewAirplane.com site 737 MAX",
 "title": "Boeing 737 MAX"
}