{
 "id": "390140",
 "text": "\"Mine\" is a song written and recorded by American singer-songwriter Taylor Swift from her third studio album Speak Now. The song was produced by Nathan Chapman and Swift. The song tells of running away from relationships due to observing heartache and breakups. The song was released August 4, 2010 by Big Machine Records. It got good reviews from the music critics. The song was a top-ten and received certification in Australia, Canada, and Japan. The song peaked at number three on the Billboard Hot 100, number two on the Hot Country Songs chart, and number one on the Adult Contemporary chart. It was certified as triple platinum by the Recording Industry Association of America == Personnel == * Taylor Swift – vocals, songwriter, producer, acoustic guitar * Nathan Chapman – producer, acoustic guitar, electric guitar, banjo, digital piano, piano, synthesizer * Brian Sutton – acoustic guitar * John Gardner – drums * Nick Buda – drums * Shannon Forrest – drums * Grant Mickelson – electric guitar * Mike Meadows – electric guitar * Paul Sidoti – electric guitar * Rob Hajacos – fiddle * Tim Lauer – Hammond B3 * Al Wilson – percussion * Eric Darken – percussion * Tim Lauer – piano * Smith Curry – steel guitar == Charts == ===Weekly charts=== Weekly chart performance for \"Mine\" Chart (2010–2011) Peak position France Airplay (SNEP) 84 Japan Hot 100 (Billboard) 6 Japan Adult Contemporary (Billboard) 1 Japan Digital Chart (RIAJ) 17 Mexico Ingles Airplay (Billboard) 14 ===Year-end charts=== Year-end chart performance for \"Mine\" Chart (2010) Position Australia (ARIA) 86 Canada (Canadian Hot 100) 51 Hungary (Rádiós Top 40) 69 Japan Hot 100 (Billboard) 39 Taiwan (Hito Radio) 12 US Billboard Hot 100 46 US Adult Contemporary (Billboard) 23 US Adult Top 40 (Billboard) 38 US Hot Country Songs (Billboard) 38 Chart (2011) Position US Adult Contemporary (Billboard) 7 == Certifications == == Release history == Release dates and formats for \"Mine\" Region Date Format Label Various August 3, 2010 Digital download Big Machine United States August 4, 2010 Country radio August 24, 2010 Contemporary hit radio United Kingdom October 17, 2010 Digital download October 18, 2010 CD single Germany October 22, 2010 United States November 8, 2011 Digital download – Pop Mix Big Machine ==References== Category:2010 songs Category:Taylor Swift songs",
 "title": "Mine (song)"
}