{
 "id": "390290",
 "text": "Joseph Isadore \"Joe\" Lieberman (February 24, 1942 - March 27, 2024) was an American politician who was the United States Senator from Connecticut from 1989 to 2013. Before that he was the Attorney General of Connecticut and a member of the Connecticut Senate. When he was a senator, he had another position, Chairman of the Senate Committee on Homeland Security and Governmental Affairs. He was a former member of the Democratic Party, he was the party's nominee for vice president in the 2000 election. He later became an independent, though continued to caucus with Senate Democrats. ==Early life== Lieberman was born in Stamford, Connecticut, the son of Marcia (née Manger) and Henry Lieberman, who ran a liquor store. His family was Jewish. His paternal grandparents emigrated from Poland and his maternal grandparents were from Austria. ==Presidential politics== In the 2000 election, he was chosen by Al Gore for his vice president. Lieberman became the first practicing Jew to run for the nation's second-highest office. Lieberman was selected from a group of potential running mates that reportedly included Senators John Kerry and John Edwards, the team that would form the Democratic presidential ticket four years later. Lieberman and Gore lost the electoral vote to George W. Bush and Dick Cheney, but they won the popular vote. In 2004, Lieberman ran for President of the United States, but lost the nomination to John Kerry. Lieberman was the first person of Jewish background or faith to run on a major party Presidential ticket. == Involvement with No Labels == Joe Lieberman co-founded No Labels in 2010 and served as the groups chairman until his death in 2024. He hoped to organize a bipartisan unity ticket in the 2024 United States presidential election that would run as a third party against Joe Biden and Donald Trump. He successfully recruited Chris Christie, the former Republican Governor of New Jersey, to serve as No Labels' presidential nominee. No Labels abandoned the plan to run a presidential ticket upon Lieberman's death. ==Personal life== Lieberman lived in New Haven, Connecticut and New York City. Lieberman died on March 27, 2024 at NewYork-Presbyterian Hospital at the age of 82. He died of injuries from a fall he had at his home in The Bronx. ==References== Category:1942 births Category:2024 deaths Category:Lawyers from Connecticut Category:Independent politicians in the United States Category:Jewish American politicians Category:2004 United States presidential candidates Category:Jewish lawyers Category:People from Stamford, Connecticut Category:United States senators from Connecticut Category:Yale University alumni Category:Accidental deaths from falls in the United States",
 "title": "Joe Lieberman"
}