{
 "id": "390432",
 "text": "Marco Stefano Belinelli (born March 25, 1986 in San Giovanni in Persiceto) is an Italian basketball player. He used to play for the Golden State Warriors, for the Toronto Raptors, and for the New Orleans Hornets. In 2012, he started playing for the Chicago Bulls. ==Biography== Starting his career in the youth teams of Virtus Bologna, Marco Belinelli made his professional debut in LegA in 2002. In the following year, he switched to the rival Bologna club, Fortitudo Bologna, due to his former club's financial troubles. He achieved an Italian championship with them in 2005. In 2006, he represented Italy in the World Championships, with the team finishing in ninth place. In 2007, he entered the NBA Draft, which took place on June 28, 2007, at Madison Square Garden in New York. The Golden State Warriors selected him as the eighteenth overall pick. On August 11, 2010, he was traded to the New Orleans Hornets in exchange for Julian Wright.Raptors acquire Julian Wright on www.kusports.com In 2011, he played in the playoffs as a starter for the New Orleans Hornets and had an impressive season. During the 2011 European Championship, Italy managed to field its three NBA players: Marco Belinelli, Danilo Gallinari, and Andrea Bargnani. Despite being placed in a challenging group in the initial round, which included France, Germany, Serbia, Israel, and Latvia, Italy finished the competition with only one victory. In 2014, he achieved an NBA championship with the San Antonio Spurs, becoming the first Italian player to accomplish this feat. On July 13, 2015, he signed with the Sacramento Kings.Belinelli quitte San Antonio pour rejoindre les Kings on www.basketusa.com On February 11, 2018, he signed with the Philadelphia 76ers.Marco Belinelli en route pour Philadelphie on www.Lefigaro.fr On July 1, 2018, he made a return to the San Antonio Spurs, signing a two-year contract worth twelve million dollars. On November 26, 2020, he left the NBA and returned to Virtus Bologna. ==References== ==Other websites== Category:1986 births Category:Living people Category:Atlanta Hawks players Category:Chicago Bulls players Category:Golden State Warriors players Category:Italian basketball players Category:New Orleans Hornets players Category:Philadelphia 76ers players Category:Sacramento Kings players Category:San Antonio Spurs players Category:Shooting guards Category:Small forwards Category:Sportspeople from Emilia-Romagna Category:Toronto Raptors players",
 "title": "Marco Belinelli"
}