{
 "id": "39054",
 "text": "An extrasolar planet (or exoplanet) is a natural planet in a planetary system outside our own solar system. A related concept is an exomoon, a natural satellite orbiting an exoplanet. In 2013, estimates of the number of terrestrial planets in the Milky Way ranged from at least 17 billion to at least 144 billion. The smaller estimate studied planet candidates gathered by the Kepler space observatory. Among them are 461 Earth-size planets, at least four of which are in the \"habitable zone\" where liquid water can exist. One of the four, dubbed Kepler-69c, is a mere 1.5 times the size of the Earth and around a star like our own Sun – about as near as the current data allow to finding an \"Earth 2.0\".Palmer, Jason 2013. Kepler telescope: Earth-sized planets 'number 17bn'. BBC News Science & Environment. Earlier work suggested that there are at least 100 billion planets of all types in our galaxy, an average of at least one per star. There are also planets that orbit brown dwarfs, and free-floating planets that orbit the galaxy directly just as the stars do. It is unclear whether either type should be called a \"planet\". Analogies with planets in the Solar System apply to few of the extrasolar planets known. Most are quite unlike any of our planets, for example the so- called \"hot Jupiters\". == History == === Early speculations === In the sixteenth century, the Italian philosopher Giordano Bruno, an early supporter of the Copernican theory that the Earth and other planets orbit the Sun, put forward the view that the fixed stars are similar to the Sun and are likewise accompanied by planets. Bruno was burnt at the stake by the Holy Inquisition.\"Cosmos\" in The New Encyclopædia Britannica (15th edition, Chicago, 1991) 16:787:2a. \"For his advocacy of an infinity of suns and earths, he was burned at the stake in 1600.\" In the eighteenth century, the same possibility was mentioned by Isaac Newton in his Principia. Making a comparison to the Sun's planets, he wrote \"And if the fixed stars are the centres of similar systems, they will all be constructed according to a similar design and subject to the dominion of One\". ===Confirmed discoveries=== The first published and confirmed discovery was made in 1988.Campbell B.; Walker G.A.H.; Yang S. 1988. A search for substellar companions to solar-type stars. Astrophysical Journal 331: 902–921. Bibcode 1988ApJ...331..902C. doi:10.1086/166608 It was finally confirmed in 2002. In 1992, radio astronomers announced the discovery of planets around a pulsar.Wolszczan A. & Frail D.A. 1992. A planetary system around the millisecond pulsar PSR1257+12. Nature 355 (6356): 145–147. doi:10.1038/355145a0 These pulsar planets are believed to have formed from the unusual remnants of the supernova that produced the pulsar, in a second round of planet formation. Otherwise they may be the remaining rocky cores of gas giants that survived the supernova and then decayed into their current orbits. On October 6, 1995, Michel Mayor and Didier Queloz of the University of Geneva announced the first definitive detection of an exoplanet orbiting an ordinary main-sequence star (51 Pegasi). This discovery, made at the Observatoire de Haute-Provence, started the modern era of exoplanetary discovery. Technological advances, most notably in high-resolution spectroscopy, led to the quick detection of many new exoplanets. These advances allowed astronomers to detect exoplanets indirectly by measuring their gravitational influence on the motion of their parent stars. Additional extrasolar planets were eventually detected by watching occultations when a star becomes dimmer as an orbiting planet passed in front of it. In May 2016 NASA announced the discovery of 1,284 exoplanets which brought the total number of exoplanets to over 3,000.\"NASA's Kepler Mission Announces Largest Planet Collection Ever Discovered\" May 10, 2016 https://www.nasa.gov/press-release/nasas-kepler- mission-announces-largest-collection-of-planets-ever-discovered == Types == Extrasolar planets can have many different forms. * They can be gas giants or rocky planets ** They can possibly be dwarf planets, i.e. planets smaller and less dense than regular planets * They can orbit several different types of stars ** They can be free-floating or orbit a brown dwarf * They may support life. One recently discovered exoplanet, Gliese 581g is thought to possibly support life, but the existence of this planet is not yet confirmed. Classes of exoplanets include: * A super-terran or super-Earth is a terrestrial planet that is bigger than Earth, but smaller than Neptune * A water-world is a hypothetical class of planet between terrestrial and jovian. These worlds would have very very little, if any dry land. * Hot Jupiters are gas planets orbiting closer to their stars than Mercury to the sun. * Rogue planets orbit no stars at all. === Nearest === The nearest star with planets is Alpha Centauri. It is 4.3 light years away. Using standard rockets, it would take tens of thousands of years to get there. The nearest star similar to our Sun is Tau Ceti. It has five planets, one of which in the habitable zone, where liquid water may exist.Tau Ceti's planets nearest around single, Sun-like star. BBC News Science & Environment. Tuomi M. et al [2012]. Signals embedded in the radial velocity noise. Astronomy and Astrophysics (in press). === Most Earth-like === Some extrasolar planets might be Earth-like. This means that they have conditions very similar to that of the Earth. Planets are ranked by a formula called the Earth similarity index or ESI for short. The ESI goes from one (most Earth-like) to zero (least Earth-like). For a planet to be habitable it should have an ESI of at least 0.8. For comparison, the four solar terrestrial planets are included in this list. Name Distance (ly) Status Year of discovery Ref Earth warm terran Kepler-438b warm terran 472.9 2015 Kepler-1410b warm superterran 1213.4 2011 Gliese 667 Cc warm terran 23.6 2011 Kepler-442b warm superterran 1291.6 2015 Kepler-62e warm superterran 1199.7 2013 Kepler-452b warm superterran 1402.5 2015 Gliese 832 c warm superterran 16.1 2014 Kepler-283c warm superterran 1496.8 2011 Kepler-436b warm superterran 1339.4 2015 Kepler-1229b warm superterran 769.7 2016 Tau Ceti e warm superterran 11.9 2012 Kepler-296f warm superterran 1089.6 2011 Gliese 180 c warm superterran 39.5 2014 Gliese 667 Cf warm terran 23.6 2013 Gliese 581 g warm superterran 20.2 2010 Gliese 163 c warm superterran 48.9 2012 Gliese 180 b warm superterran 39.5 2014 HD 40307 g warm superterran 41.7 2012 Kepler-61b warm superterran 1062.8 2013 Kepler-443b warm superterran 2564.4 2015 Gliese 422 b warm megaterran 41.3 2014 Kepler-22b warm superterran 619.4 2011 Kepler-440b warm superterran 706.5 2015 Kepler-298d warm superterran 1545 2012 Kepler-439b warm superterran 1914.8 2015 Kapteyn b warm superterran 12.7 2014 Kepler-62f warm superterran 1199.7 2013 Kepler-186f warm terran 492 2014 Kepler-174d warm superterran 878.3 2011 Gliese 667 Ce warm terran 23.6 2013 Gliese 682 c warm superterran 16.6 2014 Gliese 581 d warm superterran 20.2 2007 Reanalysis of data suggests ‘habitable’ planet GJ 581d really could exist – Astronomy Nowhttp://www.sciencemag.org/content/347/6226/1080.3.abstract Kepler-155c hot superterran 965 2014 Venus warm terran Mars warm subterran Mercury hot mercurian == Related pages == * Planet * List of exoplanets * dwarf planet * 51 Pegasi b * 70 Virginis b == References == == Other websites == === Search projects === * University of California Planet Search Project * The Geneva Extrasolar Planet Search Programmes * PlanetQuest distributed computing project * Extrasolar Planets === Resources === * NASA's PlanetQuest ** PlanetQuest 3D Atlas of extrasolar planets within 400 light years of our Solar System ** Planetquest Flash * German Center for Exo-Planet Research Jena/Tautenburg * Astrophysical Institute & University Observatory Jena (AIU) * Table of known planetary systems * Extrasolar Planet XML Database * Andrew Collier Cameron, Extrasolar planets, Physics World (January 2001). (See the online version .) * searchable dynamic database of extrasolar planets and their parent stars * List of important exoplanets * Extrasolar Planets - D. Montes, UCM * Extrasolar Visions === News === * 6-8 Earth-Mass Planet Discovered orbiting Gliese 876 * Newfound World Shatters Distance Record from space.com * Oldest Known World from space.com * Earth Sized Planets Confirmed from space.com * Sunshade to Look for Distant Life from news.bbc.co.uk",
 "title": "Extrasolar planet"
}