{
 "id": "39069",
 "text": "\"Advance Australia Fair\" is the official national anthem of Australia. Peter Dodds McCormick (–1916) wrote the music and the words for the song. It was first performed in 1878, but it only became Australia's official anthem in 1984. Between 1878 and 1984, the song was used inside of Australia as a patriotic song. For a time the song announced the news from the Australian Broadcasting Commission. When Australia became a Federation in 1901, the song was sung by a choir of 10,000 people. In 1977 there was a vote for the national anthem between four songs during the 1977 Australian referendum. The other three songs were: * God Save the Queen, which was then the official national anthem * Waltzing Matilda, often regarded as the unofficial anthem * Song of Australia. Advance Australia Fair received 43.29% of the vote, defeating the three alternatives: Waltzing Matilda (28.28%), Song of Australia (9.65%), and the existing national anthem God Save the Queen (18.78%). However, it was not until 1984 that the national anthem was changed to reflect the popular vote. Other songs and marches have been influenced by Advance Australia Fair, such as the Australian Vice-Regal salute. ==Lyrics== While the original lyrics are in English, because Australia is a very multicultural and multilingual nation, the lyrics have been unofficially translated into many other languages, including Chinese, Arabic, Vietnamese, Italian, Greek, Spanish, Korean, German, French and Polish. It has also been translated into many Australian Aboriginal languages, most famously Dharug but also others such as Pitjantjatjara, Warlpiri, Nyungar and Yugambeh-Bundaljung. English original Pronunciation of the words with an Australian accent (IPA transcription) Official Chinese translationhttps://immi.homeaffairs.gov.au/citizenship-subsite/files/our- common-bond-testable-chinese- simplified.pdfhttps://immi.homeaffairs.gov.au/citizenship-subsite/files/our- common-bond-testable-chinese-traditional.pdf Australians all let us rejoice, For we are one and free; We've golden soil and wealth for toil; Our home is girt by sea; Our land abounds in nature's gifts Of beauty rich and rare; In history's page, let every stage Advance Australia Fair. In joyful strains then let us sing, Advance Australia Fair. Beneath our radiant Southern Cross We'll toil with hearts and hands; To make this Commonwealth of ours Renowned of all the lands; For those who've come across the seas We've boundless plains to share; With courage let us all combine To Advance Australia Fair. In joyful strains then let us sing, Advance Australia Fair. [ə.ˈstɹæɪ̯.ɫjənz oːɫ ɫet ɐs ɹɪ.ˈd͡ʒoɪ̯s] [foː(ɹ) wɪi̯ ɐː(ɹ) (one æːnd fɹɪi̯] [wɪi̯v ˈgɐʉ̯ɫ.dən soɪ̯ɫ æːnd weɫθ foː(ɹ) tʰoɪ̯ɫ] [ˈæɔ̯(ɹ) hɐʉ̯m ɪz gɵː(ɹ)t bɑe̯ sɪi̯] [ˈæɔ̯(ɹ) ɫæːnd ə.ˈbæɔ̯ndz ɪn ˈnæɪ̯.t͡ʃə(ɹ)z gɪfts] [ɐv ˈbjʉː.tɪi̯ ɹɪt͡ʃ æːnd ɹeː(ɹ)] [ɪn ˈhɪs.tə.ɹɪi̯z pʰæɪ̯d͡ʒ ǀ ɫet ˈe.v(ə.)ɹɪi̯ stæɪ̯d͡ʒ] [əd.ˈvæːns ə.ˈstɹæɪ̯.ɫjə feː(ɹ)] [ɪn ˈd͡ʒoɪ̯.fəɫ stɹæɪ̯nz ðen ɫet ɐs sɪŋ] [əd.ˈvæːns ə.ˈstɹæɪ̯.ɫjə feː(ɹ)] [bɪ.ˈnɪi̯θ ˈæɔ̯(ɹ) ˈɹæɪ̯.djənt ˈsɐ.ðə(ɹ)n kɹɔs] [wɪi̯ɫ tʰoɪ̯ɫ wɪð hɐː(ɹ)ts æːnd hæːndz] [tʰʉː mæɪ̯k ðɪs ˈkʰɔ.mən.ˌweɫθ ɐv ˈæɔ̯(ɹ)z] [ɹɪ.ˈnæɔ̯nd ɐv oːɫ ðə ɫæːndz] [foː(ɹ) ðɐʉ̯z hʉːv kʰɐm ə.ˈkɹɔs ðə sɪi̯z] [wɪi̯v ˈbæɔ̯nd.ɫəs pɫæɪ̯nz tʰʉː ʃeː(ɹ)] [wɪð ˈkʰɵː.ɹəd͡ʒ ɫet ɐs oːɫ ˈkʰɔm.bɑe̯n] [tʰʉː əd.ˈvæːns ə.ˈstɹæɪ̯.ɫjə feː(ɹ)] [ɪn ˈd͡ʒoɪ̯.fəɫ stɹæɪ̯nz ðen ɫet ɐs sɪŋ] [əd.ˈvæːns ə.ˈstɹæɪ̯ɫjə feː(ɹ)] 歡笑吧，澳洲各人民， 我們自由同心； 有多產的黃金沃土，供人拓墾， 大洋圍繞全境； 遍地富含稀世資源， 處處豐饒美景； 讓歷代累積的步伐， 率美麗澳洲前進。 讓我們齊聲歡唱道： 澳洲美之國，前進。 耀眼的南十字星下， 我們並肩打拼， 為了使我們的聯邦 舉世皆聞其名； 這裡有無窮的原野， 給遠來的移民； 大家勇銳相連來使 澳洲美之國，前進。 讓我們齊聲歡唱道： 澳洲美之國，前進。 ==Sound file== ==References== Category:National symbols of Australia Category:Australian patriotic songs",
 "title": "Advance Australia Fair"
}