{
 "id": "390723",
 "text": "The Polisario Front (, transliterates to , translates to Popular Front for the Liberation of El Hamra and Río de Oro) is a rebel militia group and political party, which is active in Western Sahara. The movement succeeded the older movement called Movimiento para la Liberación del Sahara, which was active until the 1960s. The movement was founded in the early 1970s. It was first active fighting for the independence of the Spanish Sahara, which was a Spanish colony until 1975. After the Spanish left, Mauritania and Morocco annexed the Western Sahara, the Polisario, however, claimed the entire Western Sahara under the Sahrawi Arab Democratic Republic. In 1991, the United Nations brokered a peace agreement. Nowadays, Western Sahara is split into two zones, separated by the Moroccan Wall. Morocco controls de facto most of the territory. File:Polisario troops.jpg|Parade of Polisario Troops in Western Sahara, celebrating the 32nd anniversary of the Polisario, in 2005 File:Mohamed Abdelaziz.jpg|The person in white is Mohamed Abdelaziz the first leader of the Frente Polisario File:Western sahara walls moroccan map- en.svg|Western Sahara, the territory marked in yellow is controlled by the Polisario Front == History == === Founding: === The Polisario Front was founded on May 10 1973, by a group of Sahrawi students and activists. At the time, Western Sahara was under Spanish control. The group began in Mauritania but had supporters throughout Western Sahara. Their objective was to fight for independence and to put an end to Spanish Colonial Rule. The first military action taken by the Polisario Front took place on May 20 1973, when they attacked a Spanish military post. This date is remembered as the beginning of their armed struggle. ==== Spanish withdrawal and regional conflict: ==== In 1975. after many years of pressure, the Spanish Government agreed to withdraw from Western Sahara. Instead of granting it independence, Spain signed the Madrid Accords, granting control over the territory over to Morocco and Mauritania. This decision was not accepted by the Sahrawi people or the Polisario Front. The group went on to start a war against both Morocco and Mauritania. On February 27 1976, the Polisario Front declared the Sahrawi Arab Democratic Republic (SADR), which is still a government in exile today. In 1979 Mauritania signed a peace treaty with the Polisario Front and surrendered its claim to the Southern part of the Western Sahara. However Morocco quickly took over that area. Since then Morocco has controlled about 80% of Western Sahara. While the Polisario Front controls much smaller parts in the East. The SADR government is located in refugee camps in Tindouf Algeria. ===== Ceasefire and renewed conflict: ===== In 1991 the United Nations, helped in arranging ceasefire between Morocco and the Polisario Front. A United Nations mission named MINURSO was started to monitor the ceasefire and prepare for a referendum. This referendum would allow Sahrawis to vote on whether they wanted independence or join Morocco. However the vote has not been possible due to disagreements on both sides. In November 2020, there was an increase in tensions once again. Polisario supporters blocked a road near the town of Guerguerat which is a buffer zone. Morocco responded to this action by sending its military. The Polisario then declared the ceasefire to be over, which led to the small-scale fighting restarting. == Political Ideology == === Independence and Anti-Colonialism === The primary idea behind the Polisario Front is that the Sahrawi people should have the right to govern themselves. The group believes in anti-colonialism and wants to put an end to foreign control over their land. They argue that the people of Western Sahara should decide their future in a democratic vote. ==== Socialism and Equality ==== The Polisario Front has socialist roots. It believes in equality and providing basic services such as healthcare, food and education to everyone. In the refugee camps, it has attempted to create a fair society, where men and women can both hold leadership roles. Women often work in schools, local governments and health centres. ===== Secularism ===== The Polisario Front is also a secular group. Religion does play a role in daily life, but it is kept separate from politics. The group respects and allows for different beliefs but does not use religion in policies. == Structure == === Leadership === The person in command of the Polisario Front is called the Secretary General. The Secretary General is also the president of the SADR. Brahim Ghali is the current Secretary General and president of the SADR. The government consists of a parliament and several ministries. ==== Military Wing ==== The Polisario Front also has a military wing which goes by the: Sahrawi People's liberation army (SPLA). It is primarily based in Algeria near the Moroccan wall. ===== Refugee Camps ===== The Sahrawi people primarily live in five main camps near Tindouf Algeria. Within these camps there are schools, hospitals and even local governments. == Foreign Relations == === Algeria === Algeria strongly supports the Polisario Front by supplying them with money, weapons and land. Algeria also hosts the refugee camps. ==== African Union and Global Recognition ==== More than 40 countries recognize the SADR and it is also a fully integrated member of the African Union. ===== United States and Morocco ===== In December 2020, the United States of America under president Donal Trump stated that it recognized Morocco's claim over Western Sahara. ====== United Nations and European Union ====== The United Nations still supports a vote for independence. The European Union also hopes for a peaceful solution. == References == # Stephen Zunes and Jacob Mundy, Western Sahara: War, Nationalism, and Conflict Irresolution (Syracuse, NY: Syracuse University Press, 2010). # Erik Jensen, Western Sahara: Anatomy of a Stalemate (Boulder, CO: Lynne Rienner Publishers, 2005). # Human Rights Watch, “Human Rights in Western Sahara and in the Tindouf Refugee Camps,” 2008, # Jacob Mundy, “Autonomy & Intifada: New Horizons in Western Saharan Nationalism,” Review of African Political Economy 33, no. 108 (2006): 255–267. # United Nations, “MINURSO: United Nations Mission for the Referendum in Western Sahara,” # International Crisis Group, “Western Sahara: Out of the Impasse,” Middle East/North Africa Report No. 66, June 2007. # Amnesty International, “Morocco/Western Sahara: Human Rights in the Tindouf Refugee Camps,” 2016, # Al Jazeera, “Western Sahara Ceasefire Broken as Morocco Launches Operation,” November 13, 2020, # France 24, “Polisario Front Ends Ceasefire with Morocco over Western Sahara,” November 14, 2020, # GlobalSecurity.org, “Polisario Front,” # Middle East Monitor, “Polisario Front's Struggle Gains Global Support,” May 21, 2021, # Harriet Sherwood, “Life in the Sahrawi Camps,” The Guardian, September 4, 2019, # Sahrawi Arab Democratic Republic (SADR), # ReliefWeb, “Situation in Tindouf Camps,” United Nations OCHA, 2020, # BBC News, “Timeline: Western Sahara,” 2016, # African Union, “Member States,” # United Nations General Assembly, “Resolutions on the Question of Western Sahara,” # Reuters, “Trump Recognizes Moroccan Sovereignty over Western Sahara,” December 10, 2020, # Karen DeYoung, “Trump Administration Recognizes Morocco’s Claim to Western Sahara,” The Washington Post, December 10, 2020, # European Council on Foreign Relations (ECFR), “The EU and the Western Sahara,” 2021, Category:Western Sahara Category:Nationalist organizations in Africa Category:National liberation movements Category:Rebel militia groups in Africa Category:1970s establishments in Africa",
 "title": "Polisario Front"
}