{
 "id": "390888",
 "text": "is a series of anthropomorphic animal figures. They are made from plastic and fake animal fur. They were started in Japan in 1985 by Epoch, but they are now sold worldwide. Many books, DVDs and TV series have been based on the characters. The characters were originally woodland animals like bears, rabbits and hedgehogs, but now other animals such as penguins, meerkats and elephants have been added into the mix. The word sylvan means \"forest\" in Latin. == Setting == Sylvanians were origanally set in Japan in the 1950's most of the families are rural middle-class with many luxuries and local businesses. They have many leisure activities such as horse riding, rowing and hosting garden parties. The simple caravan means that they can enjoy short stays on holiday. This means that they can be away from their house whether it is a small cottage or a multi-storey town house. == Growing == In 1985 Sylvanian Families were launched in both Japan and North America. They were such a success that in 1987 they moved over the Atlantic to Western Europe and to the UK. By 1988 these small toys were a major success world wide, they went on to win London toy of the year award 3 times in a row this had never been achieved before or after. They were so popular that in the late 80's an animated TV series was made, this was greatly watched and spain and the UK. In the 90's it was aired on American TV. == Stopping and Starting == By the mid 1990's Sylvanian Families, despite their major success, had gone out of business in the UK. The production company Tomy lost the rights to Sylvanian Families and American Calico Critters. In the late 90's another company, Flair, took over Sylvanian Families and reintroduced them into the UK. It was in 2007 that they celebrated their 20th birthday a special edition dalmation family (that had not been sold since they went out of production) with red party hats saying 'happy birthday'. 2012 was the 25th birthday and they sold a celebration rabbit family in honour a birthday that they never have seen if it hadn't have been for Flair. == The London Shop == The address for the Sylvanian Families Shop in London is 68 Mountgrove Road. The shop is quite small but stuffed from floor to ceiling with figures, displays and new box sets. People from all around the world to go to the Sylvanian shop to become one of the many people who have been inside the famous shop. == Japanese Musuem and Shop == In Japan there is a giant life size Sylvanian Families village, including a bakery with real bread based on the bread in watermill bakery. You can meet life size Sylvanian characters and go in life size houses made from the models themselves. Category:Toys Category:Manufacturing companies of Japan Category:1985 establishments in Japan",
 "title": "Sylvanian Families"
}