{
 "id": "390823",
 "text": "The Boeing 80, sometimes called the Boeing Model 80 or just the Model 80, was an American airliner. It was a biplane with three engines. The Boeing 80 was built by the Boeing Airplane Company. It could carry mail and passengers. ==Development and design== Boeing Air Transport was started on February 17, 1927 by William Boeing. On July 1, 1927, planes from Boeing Air Transport started flying mail from San Francisco to Chicago.Davies Air Enthusiast January/February 2007, pp. 66-67. At first, the Boeing Model 40A was used for this. Boeing decided to make a plane to carry passengers. In 1928 it designed the Model 80.Bowers 1989, p. 136. The Boeing 80 could carry 12 people.Taylor 1983, p. 72.Davies Air Enthusiast January/February 2007, p. 71. The pilots sat in a cockpit in front of the passengers. The first Boeing 80 took off on July 27, 1928. Three more Boeing 80s were made before Boeing started to make the Boeing 80A. The Boeing 80A was longer and it could carry 18 people. It also had better engines. It first took off on July 18, 1929.Davies Air Enthusiast March/April 2007, p. 62. ==History== The Boeing 80 first flew for Boeing Air Transport on September 20, 1928. It soon turned out to be successful. The Boeing 80A started being used in September 1929.Taylor 1983, p.73. In May 1930, Boeing Air Transport hired eight female flight attendants. They first flew on May 15.Davies Air Enthusiast March/April 2007, p. 67. The Boeing 80 and 80A were used until the Boeing 247 replaced them in 1934. ==Different types of Boeing 80== * Model 80 - first type of Boeing 80 (four of these were made) * Model 80A - more aerodynamic and had new engines (10 of these were made) ==Users== ; *Boeing Air TransportCohen, Stan. \"Chapter 4.\" Flying Beats Work: The Story of Reeve Aleutian Airways. Missoula, Montana: Pictorial Histories Publishing Company, 1988. . *Monterey Peninsula Airways *Morrison- Knudsen Company *Robert Campbell Reeve *Standard Oil, California\"Flying the Boeing Model 80.\" Internet Modeler. Retrieved: September 20, 2010. *United Airlines ==Boeing 80s which still exist== One Boeing 80A was found in a dump at Anchorage Airport in 1960. It was fixed up and it is now in the Museum of Flight in Seattle.\"Boeing 80A-1\". The Museum of Flight. Retrieved: July 4, 2009. ==Details (Model 80A)== ==References== ;Notes ;Bibliography * Bowers, Peter M. Boeing Aircraft since 1916. London: Putnam, 1989. . * Davies, Ed. \"Boeing's Airline: The Life and Times of Boeing Air Transport, Part One\". Air Enthusiast, No. 127, January/February 2007, pp. 64–74. Stamford, UK:Key Publishing. * Davies, Ed. \"Boeing's Airline: The Life and Times of Boeing Air Transport, Part Two\". Air Enthusiast, No. 128, March/April 2007. Stamford, UK: Key Publishing. pp. 62–73. * Taylor, H.A. \"When Boeing Flew the Mails\". Air Enthusiast, Twenty-two, August–November 1983, pp. 64–74. Bromley, UK: Pilot Press. ==Other websites== * \"Night Flyers At 10,000 Feet Hurdle The Rockies\", Popular Science, August 1931, about the Boeing 80 * \"How Many Parts Has The Modern Airplane\", Popular Mechanics, January 1932, article about making a Boeing 80 080, Boeing",
 "title": "Boeing 80"
}