{
 "id": "390998",
 "text": "The Kennedys was an American-Canadian 2011 Emmy Award-winning miniseries. ==About== The Kennedy's was about the political career and the personal life of John F. Kennedy, Robert F. Kennedy, and Joseph P. Kennedy, Sr.. The show was about how Joseph P. Kennedy, Sr. made John F. Kennedy win his election for President. As the show continued, they show the difficulties of Kennedy's presidency, Joseph's stroke and rough relationship with Rose Fitzgerald Kennedy, and the assassination of both John and Robert Kennedy. The show also featured John's relationship with his wife Jacqueline Kennedy. ==Cast== *Greg Kinnear as John F. Kennedy *Katie Holmes as Jacqueline Kennedy *Barry Pepper as Robert F. Kennedy *Tom Wilkinson as Joseph P. Kennedy, Sr. *Diana Hardcastle as Rose Fitzgerald Kennedy *Chris Diamantopoulos as Frank Sinatra *Charlotte Sullivan as Marilyn Monroe *Kristin Booth as Ethel Kennedy *Serge Houde as Sam Giancana *Enrico Colantoni as J. Edgar Hoover *Don Allison as Lyndon B. Johnson *Rothaford Gray as Abraham Bolden *Gabriel Hogan as Joseph P. Kennedy, Jr. ==Awards and nominations== Year Association Category Result 2011 26th Gemini Awards Best Dramatic Mini-Series or TV Movie Best Achievement in Make-Up Best Costume Design Best Direction in a Dramatic Program or Mini- Series Best Original Music Score for a Dramatic Program, Mini-Series or TV Movie Best Photography in a Dramatic Program or Series Best Production Design in a Fiction Program or Series Best Sound in a Dramatic Program Best Performance by an Actress in a Supporting Role in a Dramatic Program or Mini- Series — Diana Hardcastle Best Performance by an Actor in a Featured Leading Role in a Dramatic Program or Mini-Series — Barry Pepper 63rd Primetime Emmy Awards Outstanding Hairstyling for a Miniseries or a Movie Outstanding Makeup for a Miniseries or a Movie (non-prosthetic) Outstanding Sound Mixing for a Miniseries or a Movie Outstanding Miniseries Outstanding Lead Actor in a Miniseries or a Movie — Greg Kinnear Outstanding Lead Actor in a Miniseries or a Movie — Barry Pepper Outstanding Supporting Actor in a Miniseries or a Movie — Tom Wilkinson 2012 Producers of the Year Awards Television Producer of the Year Award in Longform 18th Screen Actors Guild Awards Outstanding Performance by a Male Actor in a Television Movie or Miniseries — Greg Kinnear 64th Directors Guild of America Awards Outstanding Directorial Achievement in Movies for Television and Mini-Series — Jon Cassar History Makers Awards Best Historical Drama Production ==References== ==Other websites== * * at History Television * at History UK * at ReelzChannel Category:2011 American television series debuts Category:2011 American television series endings Category:Emmy Award winning programs Category:English-language television programs Category:John F. Kennedy Category:American political drama television series",
 "title": "The Kennedys (miniseries)"
}