{
 "id": "391021",
 "text": "Richard John Kind (born November 22, 1956) is an American actor. He is known for his roles in Mad About You (as Dr. Mark Devanow) and in Spin City (as Paul Thomas Lassiter). Kind voiced Riley's imaginary friend Bing Bong in Pixar's Inside Out. ==Early and personal life== Kind was born on November 22, 1956 in Trenton, New Jersey to a Jewish family. He grew up in Bucks County, Pennsylvania. Kind studied at Pennsbury High School and at Northwestern University. He married Dana Stanley in 1999 and they divorced in 2014. They have three children. Actor and director George Clooney is a close friend, and was best man at Kind's wedding. ==Filmography== ===Film=== Year Title Role Notes 1986 Nothing in Common Ad Exec in Bar Uncredited 1988 Vice Versa Floyd 1988 Meanwhile in Santa Monica 1989 How I Got Into College 1991 Queens Logic Actor 1991 Ghoulies Go to College Cat Ghoulie (voice) 1991 All-American Murder Lou Alonzo 1992 Mr. Saturday Night Reporter 1993 Tom and Jerry: The Movie Tom (voice) 1993 Quest of the Delta Knights Wamthool 1994 Clifford Julien Daniels 1994 Stargate Gary Meyers, Ph.D 1996 Johns Paul Truman 1996 Shooting Lily Florist 1997 Hacks Benny 1997 Cold Around the Heart Attorney Nabbish 1998 A Bug's Life Molt (voice) 1999 Our Friend, Martin Mr. Willis (voice) 1999 How the Grinch Stole Christmas Whobris 2000 Tom Sawyer Mr. Dobbins (voice) 2001 Cats & Dogs Calico (voice) 2002 Quicksand Kensington 2002 Confessions of a Dangerous Mind Casting Executive Man 2003 The Station Agent Louis Tiboni 2003 Shrink Rap Herb 2003 Nobody Knows Anything! Real Estate Agent 2004 Garfield: The Movie Dad Rat (voice) 2004 Elvis Has Left the Building Burning Elvis 2004 Dog Gone Love Doug 2005 Bewitched Abner Kravitz 2005 The Producers Jury Foreman 2006 Spymate Dr. Farley 2006 Cars Van (voice) 2006 The Wild Larry the Anaconda (voice) 2006 I Want Someone to Eat Cheese With Herb Hope 2006 For Your Consideration Marketing Person 2006 Everyone's Hero Hobo Andy, Maitre D' (voice) 2006 Raising Flagg Bill Reed 2007 The Grand Andy Andrews 2007 The Visitor Jacob 2007 National Lampoon's Bag Boy Dave Weiner 2007 Big Stan Mal 2007 The Neighbor Wilder 2008 Dr. Dolittle: Tail to the Chief Groundhog (voice) 2008 The Understudy Ian 2008 Roadside Romeo Guru (voice) Uncredited 2009 Ingenious Newkin 2009 A Serious Man Uncle Arthur 2009 Heidi 4 Paws Grandfather (voice) 2009 Help Me, Help You Fish 2009 Santa Buddies Eddy the Elf Dog (voice) 2010 Toy Story 3 Bookworm (voice) 2010 Hereafter Christos 2010 The Search for Santa Paws Eddy the Elf Dog (voice) 2011 Fancypants Mr. Camp 2011 Cars 2 Van (voice) 2011 Bad Seed Tim 2012 BuzzKill Stan Fuller (voice) 2012 The Producers Max Bialystock 2012 Argo Max Klein 2012 Divorce Invitation George Mason 2012 Santa Paws 2: The Santa Pups Eddy the Elf Dog (voice) 2013 Dealin' with Idiots Harold 2014 Obvious Child Jacob 2014 Chu and Blossom Fred 2014 The Angriest Man in Brooklyn Bix Field 2014 Yellowbird Michka (voice) English version 2014 All Stars Richard 2014 Ride Boss 2015 Inside Out Bing Bong (voice) 2015 The Lennon Report Dr. Stephan G. Lynn 2015 The Paper Store Prof. Marty Kane 2015 Detours Sam Jacobson 2016 Albion: Rise of the Danann Brian TBA The Hebrew Hammer vs. Hitler Hasid ===Television=== Year Title Role Notes 1984 The Ratings Game Steve TV movie 1985 Two Fathers' Justice District Attorney Turpin TV movie 1987 Hooperman Reindeer Episode: \"Deck the Cell with Bars of Folly\" 1987 Bennett Brothers Richard Bennett TV movie 1988 My Sister Sam Lang Episode: \"The Art of Love\" 1988 Mr. Belvedere Joe Episode: \"Marsha's Secret\" 1989 Empty Nest Elton Sexton Episode: \"A Life in the Day\" 1989 Unsub Jimmy Bello 8 episodes 1989 21 Jump Street Caller (voice) Episode: \"Next Victim\" 1989 Anything but Love Bradley Episode: \"Just the Facts, Ma'am\" 1990–1991 Carol & Company Skit characters 31 episodes 1991 Princesses Episode: \"Someday My Prince Will Gum\" 1991 The Carol Burnett Show Skit characters 1992 Stand By Your Man Larson Episode: \"Spare Me\" 1992 Great Scott! Alberts Episode: \"Choir Mire\" 1992–1999 Mad About You Dr. Mark Devanow 37 episodes 1993 The Building The Neurotic Director Episode: \"Father Knows Best\" 1993–1995 The Commish Alex Beebee 6 episodes 1994 The Nanny Jeffrey Needleman Episode: \"The Playwright\" 1994 Blue Skies Kenny 8 episodes 1995 A Whole New Ballgame Dwight Kling 7 episodes 1995 Nowhere Man Max Webb Episode: \"The Spider Webb\" 1996 Space: Above and Beyond Colonel Matthew Burke Episode: \"Level of Necessity\" 1996 Madness of Method Owen Goodwin TV short 1996–2002 Spin City Paul Lassiter 145 episodes 1997-2003 The Days in the Lives of Beau Beau's uncle (voice) 4 episodes 1998 Something So Right Paul Episode: \"Something About the 'Men' in Menstruation\" 1998 The Lionhearts Additional voices Episode: \"Singin' in the Mane\" 1999 Strangers with Candy Harry Link, DDS Episode: \"Who Wants Cake?\" 1999 The Wild Thornberrys Lyrebird (voice) Episode: \"Koality and Kuantity\" 2001 Even Stevens Uncle Chuck Stevens Episode: \"Uncle Chuck\" 2001 The Santa Claus Brothers Roy (voice) TV movie 2001–2002 Oswald Pongo (voice) 5 episodes 2002–2003 Still Standing Dr. Nathan Gerber 2 episodes 2002–2009 Curb Your Enthusiasm Cousin Andy 4 episodes 2003 Just Shoot Me! Jimmie Korsh Episode: \"The Last Temptation of Elliot\" 2003 Miss Match Phil Weston Episode: \"Kate in Ex-tasy\" 2003–2004 Scrubs Harvey Corman 4 episodes 2003–2007 Kim Possible Frugal Lucre (voice) 5 episodes 2004 Girlfriends Peter Miller Episode: \"Prophet & Loss\" 2004 Oliver Beene Barnaby Rollins Episode: \"X-ray Specs\" 2004 The Division Hicks Episode: \"Lost and Found\" 2004 My Life, Inc. Dan Mannion TV movie 2004 That '70s Show Kimberly's Dad Episode: \"(I Can't Get No) Satisfaction\" 2004 Less than Perfect Lance Corcoran Episode: \"Shoo-In\" 2004 Father of the Pride Zebra (voice) 2 episodes 2004–2008 Go Baby! Narrator (voice) 2005 Head Cases Lou Albertini Episode: \"S(elf) Help\" 2005 Genetically Challenged Shermie Frankl TV movie 2005 E-Ring Asst. Public Affairs Sec. Danton Murphy 2 episodes 2005 Reba David Episode: \"Issues\" 2005–2013 Sesame Street Fairy Balloon Person, Mr. Disgracey 2 episodes 2005–2013 American Dad! Al Tuttle (voice) 4 episodes 2006 Three Moons Over Milford Pete Watson Episode: \"Dog Day Aftermoon\" 2006 Stargate Atlantis Lucius Lavin 2 episodes 2006 The Angriest Man in Suburbia Josh TV movie 2007 Law & Order: Criminal Intent Ernest Foley Episode: \"Privilege\" 2007 Psych Hugo Episode: \"From the Earth to Starbucks\" 2007 All of Us Dennis 2 episodes 2007 Two and a Half Men Artie Episode: \"Is There a Mrs. Waffles?\" 2007 Sands of Oblivion Ira TV movie 2009 Chowder Gumbo (voice) Episode: \"The Deadly Maze\" 2009 Dora the Explorer Greedy King (voice) Episode: \"Dora Saves the Crystal Kingdom: Trilogy 2\" 2009 Sherri Whiny Neighbor Episode: \"Indecision '09\" 2009–2011 The Penguins of Madagascar Roger (voice) 6 episodes 2010 Leverage Mayor Bradford Culpepper III 2 episodes 2010 Trauma Ira Episode: \"Frequent Fliers\" 2010 'Til Death Charlie Episode: \"Brother's Keeper\" 2010 Burn Notice Marv 3 episodes 2011 Harry's Law Marty Slumach Episode: \"Send in the Clowns\" 2011 Mr. Sunshine Rod McDaniel 2 episodes 2011 Femme Fatales Jonathan Shields Episode: \"Behind Locked Doors, Part One\" 2011 Phineas and Ferb Executive (voice) Episode: \"Perry the Actorpus\" 2011–2012 Luck Joey Rathburn 10 episodes 2012 Sketchy Lord Arby Episode: \"Downtown Arby's\" 2012 NYC 22 Geoff Arnhauldt Episode: \"Thugs and Lovers\" 2012 Law & Order: Special Victims Unit Jonas Dworkin Episode: \"Acceptable Loss\" 2013 Kroll Show Mark Episode: \"Can I Finish?\" 2013 Golden Boy Paul Daly 3 episodes 2013 Childrens Hospital Marvin Episode: \"Country Weekend\" 2013 Drop Dead Diva Marty Frumm Episode: \"One Shot\" 2013 Dark Minions Feldenbaum TV movie 2013 The Good Wife Judge Alan Davies Episode: \"The Next Day\" 2014 The Michael J. Fox Show Mr. Norwood Episode: \"Secret\" 2014 Ten X Ten Man 50s Miniseries 2014 Bad Teacher Brie's Husband Episode: \"Pilot\" 2014 Glee Mr. Rifkin Episode: \"The Back-Up Plan\" 2014 Sharknado 2: The Second One Harland 'The Blaster' McGuinness TV movie 2014 TripTank Dad, Stanley (voice) 2 episodes 2014 The Middle Dr. Niller Episode: \"Unbraceable You\" 2014–2015 Randy Cunningham: 9th Grade Ninja Mort Weinerman (voice) 4 episodes 2014–2015 Gotham Mayor Aubrey James 7 episodes 2014–2017 Red Oaks Sam 9 episodes 2015 What's Your Emergency Devon Micketty Episode: \"Let's Make a Date\" 2015 Unbreakable Kimmy Schmidt Mr. Lefkovitz Episode: \"Kimmy Goes to School!\" 2015 Love Is Dead Ken Bell TV movie 2015 Happyish Moses Episode: \"Starring Helen Keller, Moses and Lenny Bruce\" ===Video games=== Year Title Role 1998 A Bug's Life Molt 2006 Cars Van 2011 The Penguins of Madagascar: Dr. Blowhole Returns – Again! Roger ==References== ==Other websites== * * *Fairfield Arts & Convention Center Category:1956 births Category:Living people Category:Actors from Rochester, New York Category:Actors from Pennsylvania Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:Jewish American actors",
 "title": "Richard Kind"
}