{
 "id": "391055",
 "text": "Wikivoyage is a free travel and tourism guide on the web. It is written by volunteer authors using a wiki. Anyone can edit articles. The name \"Wikivoyage\" is a combination of the words \"wiki\" and \"voyage\", the French word for travel, journey, or trip. Wikivoyage started publicly in December 2006 as a German-language version that was supported by German and Swiss authors. It was owned by a German non-profit association named Wikivoyage e.V. The Italian version started in December 2007. In 2012, the content of Wikitravel in other languages was copied to Wikivoyage. At the same time Wikivoyage became hosted by the Wikimedia Foundation (WMF), a non-profit organization that hosts other wikis such as Wikipedia.The Case of Wikitravel and Wikivoyage Governance Across Borders, July 2012 Wikivoyage was officially re-launched by Wikimedia on January 15, 2013. At that time Wikivoyage was available in German, Italian, English, French, Dutch, Russian, Swedish, Portuguese and Spanish languages. The English version is the biggest, with more than 27,400 articles in September 2016. ==Description== Wikivoyage is written by the collaboration of Wikivoyagers from around the world. Articles cover different levels of geography, from continents to districts of a city. Articles mostly consist of: destinations, itineraries, phrasebooks, and travel topics. ===Destinations=== Geographical units are described in articles based on, \"can you sleep there?\" The hierarchy includes: * Continents * Continental sections (like Southeast Asia) * Countries * Regions within countries (provinces, counties, states, groups of states etc.) * Cities of any size, including small villages if they are tourist destinations * Districts within large cities * National parks provided they have accommodation for the traveller Articles list attractions such as hotels, restaurants, bars, stores, nightclubs, tour operators, museums, statues or other works of art, city parks, town squares or streets, festivals or events, transport systems or stations, bodies of water, and uninhabited islands. ===Itineraries=== An itinerary describes a list of destinations and attractions to visit during a specific amount of time, with recommendations of how long to stay and routes to follow. Itineraries usually have a well-defined path. ===Phrasebooks=== A phrasebook has: # An overview of a language, giving a brief history, where it is spoken, how many speakers, the alphabet or symbols, and other general information on the language. # A pronunciation guide, with a description of each written symbol in the language (that is, its alphabet), and a pronunciation note for each symbol. # A phrase list. Each entry includes the word or phrase being translated, the spelling in the local language symbols as it would be seen written down, and a pronunciation cue. ===Travel topics=== Travel topics include the following: Something that is too large or too detailed to go in a destination article. General travel information that applies to many destinations. Major events that occur in different places. Specialist information such as scuba-diving sites. ==References== ==Other websites== * Wikivoyage in English * Wikivoyage in many languages Category:Travel Category:Wikimedia Category:Wikis Category:Websites established in 2006",
 "title": "Wikivoyage"
}