{
 "id": "391184",
 "text": "Platform shoes are shoes that have extremely dense soles. They are often made out of plastics, rubber or cork. Platform shoes were first worn during the Ancient era. They are known to add height to whoever is wearing them. The shoes are oftentimes worn to avoid coming in contact with urban street filth, grime and muck. These shoes were very popular between the 1930s and the 1980s in the United States, Europe and the United Kingdom. They were worn mostly by girls or young women, although middle-aged or elderly women sometimes wear the shoes. Comfort platforms were invented during the disco music era, and would be designed to mix added heights and sneaker style or orthotic comforts. The fad eventually fizzled out during the late 1980s and early 1990s, though by then people of all ages, particularly girls and young to middle-aged women, wore the shoes. Category:Footwear 1930's Moshe Kimel introduced the modern platform shoe in the 30's for actress Marlene Dietrich. This started a fad among the elite and well to do. The growing popularity of the shoe sparked several well known copies such as \"the rainbow\" by Salvatore Ferragamo . At this time the shoes were typically made with cork due to the production material changes many had to face during World War II. As many trends do this one slowly disappeared from the main stream media, and didn't reaper till the late 60's. 1970's-1980's Carole Basetta was the well known designer producing shoes for famous artists such as David Bowie . This time it was not just a feminine fashion statement but men also wore platforms as well because platforms started coming in different forms like boots, trainers, and sandals. Tony Randell wore clear platforms with goldfish in the heals on a tv show and again these shoes appeared in Starsky and Hutch . In the 80's brands popularized the comfort platform which was meant for everyday use. Late 90's early 2000's While introduced in the early 90's platforms didn't pick up in mainstream fashion till the late 90's. This may be due to Naomi Campbell's runway fall in 1993 while wearing Vivienne Westwood's platform heels. After the 90's platforms did not pick up again till around 2003-2004 when YSL made a tribute sandal to commemorate the 70's shoe style. Many celebrities' liked this design for the added sex appeal. 2010-2020 This era of platform shoe was more popular with the platform boot style. Some of the more well known brands are Demonia, Bordello, and Dolls kill. With the rise of E-girl as a subculture in 2019 the sale of gothic style platform boots have gone up. During the 2010 era clear shoes wear also popularized by Kim Kardashian West. These clear platform shoes allow to to put trinkets in your shoe ranging from flowers, kids toys, and plastic fish to Halloween decorations, spiders, and baby doll heads.",
 "title": "Platform shoe"
}