{
 "id": "391117",
 "text": "Delta Cephei (δ Cep, δ Cephei) is a binary star system about 887 light-years away in the northern constellation of Cepheus, the King. At this distance, the apparent magnitude of the star is reduced by 0.23 as a result of gas and dust along the line of sight. Delta Cephei, found by John Goodricke in 1784, was only the second Cepheid variable discovered.The first was Eta Aquilae earlier the same year. It is very important because its distance is extremely well known. This is partly because it is in a star cluster,de Zeeuw P.T. et al 1999. A Hipparchus census of the nearby OB associations. Astronomical Journal 117 (1): 354–399. Majaess D.; Turner D & Gieren W. 2012. New evidence supporting cluster membership for the keystone calibrator Delta Cephei. Astrophysical Journal 747 (2): 145. close enough for the precise Hubble Space Telescope/Hipparcos parallaxes to give a good result. As a result, it is known as a \"fundamental distance calibrator\", or absolute candle.Benedict, G. Fritz et al 2002. Astrometry with the Hubble Space Telescope: a parallax of the fundamental distance calibrator δ Cephei, Astronomical Journal 124 (3): 1695–1705. Delta Cephei is a classical, or type I, Cepheid variable. The only Cepheid variable closer to us is Polaris, the North Star, whose distance is still not exactly known. Delta Cephei is emitting around 2,000 times the Sun's luminosity. This is producing a strong stellar wind, which, with the pulsations and shocks in the star's atmosphere, Neilson, Hilding R. & Lester, John B. 2008. On the enhancement of mass loss in Cepheids due to radial pulsation. The Astrophysical Journal. 684 (1): 569–587. is ejecting mass at the rate of masses per year. This is the equivalent to the mass of the Sun roughly every million years. The matter is flowing outward at a velocity of about 350 km s–1. This expelled gas forms a nebula about one parsec across, centered on Delta Cephei, and contains 0.07–0.21 solar masses of neutral hydrogen. Matthews L.D. et al 2012. New evidence for mass loss from δ Cephei from H I 21 cm line observations. The Astrophysical Journal 744 (1): 53. A bow shock is being formed where the stellar wind is colliding with the surrounding interstellar medium.Fazio G. 2010. Discovery of an infrared bow shock associated with Delta Cephei. Bulletin of the American Astronomical Society. 41: 839. == References == Category:Variable stars",
 "title": "Delta Cephei"
}