{
 "id": "391173",
 "text": "Jonathan M. \"Jon\" Lovitz (born July 21, 1957) is an American comedian, actor and singer. He was known for his sketches on Saturday Night Live from 1985 through 1990. He was also known for his guest-star role as Steve on Friends. He won two Emmy Awards for his writing on comedy series and a Screen Actors Guild Award for his acting in a crew. Lovitz was born on July 21, 1957 in Los Angeles, California to a Romanian-Hungarian-Russian-Jewish family.Jewishbiography.com > Jewish Biography --> Biographies --> List of Jewish Actors and Actresses > Jon Lovitz. Retrieved on 2012-02-03. He studied at the University of California at Irvine. ==Filmography== Year Title Role Notes 1986 Hamburger... The Motion Picture Security guard 1986 Last Resort Bartender 1986 Jumpin' Jack Flash Doug 1986 Ratboy Party guest 1986 Three Amigos Morty 1987 Radio Voice role 1988 Big Scotty Brennen 1988 My Stepmother Is an Alien Ron Mills 1990 Mr. Destiny Clip Metzler 1991 Chula Voice role 1992 Unknown 1992 Ernie Capadino 1992 Mom and Dad Save the World Emperor Tod Spengo 1993 Loaded Weapon 1 Becker 1993 Coneheads Dr. Rudolph 1994 City Slickers II: The Legend of Curly's Gold Glen Robbins 1994 North Arthur Belt 1994 Trapped in Paradise Dave Firpo 1996 For Goodness Sake II Unknown 1996 Sol 1996 Matilda Mickey 1996 High School High Richard Clark Lead Role 1998 Jimmie Moore Uncredited 1998 Happiness Andy Kornbluth 1999 Lost & Found Uncle Harry 2000 Small Time Crooks Benny 2000 Little Nicky Peeper 2000 Sand Kirby 2001 3000 Miles to Graceland Jay Peterson 2001 Cats & Dogs Calico Voice role 2001 Rat Race Randall 'Randy' Pear 2001 Good Advice Barry Sherman 2002 Eight Crazy Nights Tom Baltezor Voice role 2003 Dickie Roberts: Former Child Star Sidney Wernick 2004 Dave Markowitz 2005 Bailey's Billion$ Bailey 2005 Pancho's Pizza Unknown Short film 2005 Mr. Marks 2006 Farce of the Penguins \"My eyes are up here\" Penguin Voice role Direct-to-DVD release 2006 Mel 2006 Southland Tales Bart Bookman 2007 I Could Never Be Your Woman Rob Direct-to-DVD release 2010 Casino Jack Adam Kidan 2012 Jewtopia Dennis Lipschitz 2012 Hotel Transylvania Quasimodo Voice role 2013 Bula Quo! Wilson 2013 Grown Ups 2 Squats Fitness Janitor 2013 Jay & Silent Bob's Super Groovy Cartoon Movie The Mad Scientist 2014 Birds of Paradise Skeeter Voice 2015 A Mouse Tale King of Mice Voice 2015 Hotel Transylvania 2 The Phantom of the Opera Voice 2015 The Ridiculous Six ==References== ==Other websites== * * * Jon Lovitz On MySpace.com Category:1957 births Category:Living people Category:Comedians from Los Angeles Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American television personalities Category:Jewish American actors Category:Actors from Los Angeles Category:Writers from Los Angeles Category:Singers from Los Angeles Category:American Emmy Award winners Category:Screen Actors Guild Award winners",
 "title": "Jon Lovitz"
}