{
 "id": "391256",
 "text": "The Boeing 314 Clipper was a flying boat. It was made by the Boeing Airplane Company between 1938 and 1941. It was one of the biggest planes at that time, and it used the wing of the XB-15 bomber. Twelve Clippers were made for Pan Am. Three of them were sold to BOAC during the Battle of Britain (1940). ==Design and development== Pan American had asked for a flying boat with a very long range. Boeing wanted to make it, and Pan American asked for six of Boeing's planes. Boeing engineers used a wing taken from one of Boeing's earlier planes. The new plane had Wright Twin Cyclone.Bowers December 1977, pp. 14–15. The plane made flew for the first time on June 7, 1938. The test pilot found some things wrong with the plane. Boeing fixed these and the plane was fine.Bogash, Robert A. \"In Search of an Icon: The Hunt for a Boeing B-314 Flying Boat, Pan American NC18601 - the Honolulu Clipper\" rbogash.com. Retrieved: July 31, 2011. Weight was very important. Every passenger could only have of baggage for free. They had to pay $3.25 per lb ($7.15/kg) if they went over this limit.Klaás 1989, pp. 17, 20. Pan Am's \"Clippers\" were meant for luxury. The seats could be changed into beds. The plane normally flew at only , so flights sometimes lasted more than 12 hours.Klaás 1989, p. 86. The 314s had a lounge and dining area, and the planes had chefs from four-star hotels. Men and women had dressing rooms, too. The luxury on Pan American's Boeing 314s was better than anything since then. They were for very rich people. It cost about the same amount as it would have cost to fly on Concorde in 2006.\"British Airways Concorde.\" Travel Scholar, Sound Message, LLC. Retrieved: August 19, 2006. The 314 was also successful because of its Pan Am flight crews. They were very good at long-distance flying. Many of the flights had another crew for training.Klaás 1989, p. 64. Only the best pilots flew the Boeing 314. If it was hard to see because of fog, pilots sometimes landed at sea and then moved Clipper on the water.Masland, William M. Through the Back Doors Of The World In A Ship That Had Wings. New York: Vantage Press, 1984. . ==History== The first 314, Honolulu Clipper, started being used in January 1939. When war started in the Pacific, Pacific Clipper was flying to New Zealand. Instead of going back to Honolulu, it went to New York. This was done to avoid being shot down by Japanese fighters. Pan Am's Boeing 314s were used by the military in World War II. The only thing that changed was how the painting on the plane looked. The Clippers were still flown by their crews from Pan Am. The Boeing 314s used by the military were called C-98s. Winston Churchill flew on Boeing 314s sometimes.Hardesty 2003, pp. 37–41. After the war, many Clippers were given back to Pan Am. However, the Boeing 314 was now out-of-date. ===Retirement=== One Pan Am 314, called the California Clipper, had flown more than one million miles when it was retired.Klaás 1990, p. 78. Three Boeing 314s crashed.Klaás 1993, pp. 16–18. ==Types of Boeing 314== ;Model 314 :First version, six made ;Model 314A :Better version with better engines, more fuel and better cabin. It would fly for 4,700 miles.\"From Pan Am To Boa: First of three Boeing 214—As now on British Empire Routes.\" Flight, June 26, 1941. Retrieved: August 2, 2011. Six were made. ==Users== ; *Pan American World Airways *United States Army Air Forces *United States Navy ; *British Overseas Airways Corporation == Boeing 314s which still exist == No Boeing 314s still exist today. However, there is a replica at the Foynes Flying Boat Museum, Foynes, County Limerick, Ireland.\"Foynes Flying Boat Museum.\" flyingboatmuseum.com. Retrieved: December 2, 2007. ==Details (314A Clipper)== ==References== ;Notes ;Bibliography * Bowers, Peter M. \"The Great Clippers, Part I.\" Airpower, Volume 7, No. 6, November 1977. * Bowers, Peter M. \"The Great Clippers, Part II.\" Wings, Volume 7, No. 6, December 1977. * Bridgeman, Leonard. “The Boeing 314-A Clipper.” Jane's Fighting Aircraft of World War II. London: Studio, 1946. . * Brock, Horace. Flying the Oceans: A Pilot's Story of Pan Am, 1935-1955. New York: Jason Aronson, Inc., 3d edition: 1978, . * Dorr, Robert F. Air Force One. New York: Zenith Imprint, 2002. . * Dover, Ed. The Long Way Home: A Journey into History with Captain Robert Ford. Albuquerque, New Mexico: Amazon POD, Revised Edition 2010, First edition 2008. . * Hardesty, Von. Air Force One: The Aircraft that Shaped the Modern Presidency. Chanhassen, Minnesota: Northword Press, 2003. . * Klaás, M.D. \"Clipper Across the Pacific, Part One.\" Air Classics, Volume 25, No. 12, December 1989. * Klaás, M.D. \"Clipper Across the Pacific, Part Two.\" Air Classics, Volume 26, No. 1, January 1990. * Klaás, M.D. \"Clipper Flight 9035.\" Air Classics, Volume 29, No. 2, February 1993. * Klaás, M.D. \"The Incredible Clippers.\" Air Classics, Volume 5, No. 5, June 1969. * Klaás, M.D. \"When the Clippers Went to War\" Air Classics, Volume 27, No. 4, April 1991. * \"Towards the Flying Ship - Details of the Boeing 314 or Atlantic Clipper: A 100-passenger Successor?\" Flight, July 21, 1938, pp. 67–68. ==Other websites== * The Boeing 314 * Pan American Clippers 1931-1946 * Boeing 314 * Boeing 314 * Boeing 314 * China Clipper 75th Anniversary Commemorative Flight (November 2010 - San Francisco Aeronautical Society) * \"Two Day Turn Around\", February 1941 article 314",
 "title": "Boeing 314"
}