{
 "id": "391393",
 "text": "Abel Makkonen Tesfaye (; born February 16, 1990), known professionally as the Weeknd, is a Canadian singer-songwriter and actor. Recognized for his unconventional musical production, artistic reinventions, and signature falsetto register, Tesfaye is one of the most innovative and influential artists of his generation. == Early life == Abel Makkonen Tesfaye was born on February 16, 1990, in Scarborough, Ontario, Canada, to parents Makkonen Tesfaye and Samrawit Hailu,. His father left when Abel was young. His mother worked several jobs and, as a result, was taken care of by his grandmother. She took Abel to their Ethiopian Orthodox church services. At age 11, Abel tried marijuana for the first time and moved onto harder drugs. == Career == On March 21, 2011, the Weeknd released his first mixtape, House of Balloons, to public and critical approval. The record contains several successful songs, including \"Wicked Games\" and \"High for This\". Also the title track is based on the hit \"Happy House\" by Siouxsie and the Banshees. The latter has been recognized by the music magazine Pitchfork.Neyland, Nick, « The Weeknd’s House Of Balloons » [archive], Pitchfork The eclectic music of Tesfaye combines samples of other artists like Beach House and Aaliyah. He also released two other albums the same year with singles named \"Thursday\" and \"Echoes of Silence\". With Drake’s help, he performed the popular song \"The Zone\". In addition, the Weeknd gave his first performance in London in June 2012, and was surprised that among the spectators were famous singers like Katy Perry and Florence Welch. At this first show, he sang a unique interpretation, the reprise of \"Dirty Diana\" by Michael Jackson.Soriano, Kristen; Solomon, Michael; Stern, Claire (May 11, 2012). \"The Weeknd, 22, recording artist - 30 Under 30: The Essential Names to Know\". Elle (New York). Archived from the original on January 21, 2013. Retrieved January 21, 2013 In November 2012, at the age of 22, The Weeknd released Trilogy, comprising the last three albums remixed with Universal Music Group. The Recording Industry Association of America certified Trilogy gold in the U.S. shortly after its release. In 2013, he gave a concert in the Trianon Room in Paris. The audience during the presentation consisted mainly of young adults aged between the ages of 17 and 30. The Weeknd's songs are known for being rhythmic and sensual. In addition, he had the opportunity to start his career singing alongside rapper Wiz Khalifa with the hit \"Remember Me\". He has also worked with the artists Kendrick Lamar, J. Cole and Frank Ocean. The Weeknd's fourth album, Beauty Behind the Madness (2015), spawned the number-one hit singles \"Can't Feel My Face\" and \"The Hills\", along with the top-three song \"Earned It\", which was used in the soundtrack for the film adaptation of Fifty Shades of Grey. On September 22, 2016, The Weeknd released a single, \"Starboy\", which features French electronic duo Daft Punk. They helped produce the song, and it has topped the Billboard Hot 100 and Canadian Hot 100 charts. The third and fourth singles, \"I Feel It Coming\" (also featuring Daft Punk) and \"Party Monster\", were released on November 18. The Weeknd's fifth studio album, also called Starboy, was released on November 25, 2016. The album entered the US Billboard 200 chart at number one, and all 18 songs entered the Billboard Hot 100. Only Drake has more entries from one album, with the 20 songs from his album Views entering the chart. On March 30, 2018, he released the EP, My Dear Melancholy, which contains six songs. The first track and first single, \"Call Out My Name\", entered the US Billboard Hot 100 at number four, with the EP entering at the top of the Billboard 200 album chart with 169,000 copies sold and streamed in its first week. == Personal life == The Weeknd dated American model Bella Hadid from September 2015 until November 2016. In late 2016, he began dating American singer-actress Selena Gomez. They broke up in late 2017. ==Accolades== ==Discography== Studio albums * Kiss Land (2013) * Beauty Behind the Madness (2015) * Starboy (2016) * After Hours (2020) * Dawn FM (2022) * Hurry Up Tomorrow (2025) ==Filmography== * Michael Jackson's Journey from Motown to Off the Wall (2016) * Uncut Gems (2019) * The Show (2021) * Live at SoFi Stadium (2023) * The Idol (2023) * Hurry Up Tomorrow (2025) ==Tours== Headlining * The Fall Tour (2012) * The Kiss Land Fall Tour (2013) * King of the Fall Tour (2014) * The Madness Fall Tour (2015) * Starboy: Legend of the Fall Tour (2017) * The Weeknd Asia Tour (2018) * After Hours til Dawn Tour (2022–2025) Supporting * Florence and the Machine – Ceremonials Tour (2012) * Justin Timberlake – The 20/20 Experience World Tour (2013) * Drake – Would You Like a Tour? (2014) Current touring members * Patrick Greenaway – lead guitar (2012–present), synthesizer (2020–2022) * Ricky Lewis – drums (2011–present) * Mike Dean – synthesizer, guitar, bass, keyboards, saxophone (2022, 2023–present) Former touring members * Nathaniel James – bass, keyboards (2012) * Ledaris \"LJ\" Jones – bass, keyboards (2013–2022) == Notes == ==References== ==Other websites== * Category:1990 births Category:Canadian singer-songwriters Category:Canadian record producers Category:Living people Category:R&B; musicians Category:Musicians from Ontario",
 "title": "The Weeknd"
}