{
 "id": "391329",
 "text": "The Division of Flinders is an Australian Electoral Division in Victoria. The division was one of the original 75 divisions set up for the first federal election in 1901. It once covered country areas south and east of Melbourne which are now outer southern suburbs on the Mornington Peninsula, including Dromana, Hastings and Portsea. It is named for Matthew Flinders, the first man to sail right around Australia, and the person who gave Australia her name. ==Members== Member Party Term Arthur Groom Free Trade 1901–1903 James Gibb Free Trade, Anti-Socialist 1903–1906 (Sir) William Irvine Anti-Socialist 1906–1909 Commonwealth Liberal 1909–1917 Nationalist 1917–1918 Stanley Bruce Nationalist 1918–1929 Jack Holloway Labor 1929–1931 Stanley Bruce United Australia 1931–1933 James Fairbairn United Australia 1933–1940 Rupert Ryan United Australia 1940–1944 Liberal 1944–1952 Keith Ewert Labor 1952–1954 Robert Lindsay Liberal 1954–1966 (Sir) Phillip Lynch Liberal 1966–1982 Peter Reith Liberal 1982–1983 Bob Chynoweth Labor 1983–1984 Peter Reith Liberal 1984–2001 Greg Hunt Liberal 2001–present It has usually been a fairly safe seat for the Liberal Party and the earlier conservative parties. It was won by the Australian Labor Party in 1929 when Prime Minister Stanley Bruce was defeated. This was the first time an Australian Prime Minister has lost his own seat at a general election. The only other time this has happened was when Liberal Prime Minister John Howard lost his seat of Bennelong in the 2007 election. James Faibairn was Australia's first Minister for Air; he was one of three government ministers killed in the Canberra air disaster in 1940. Sir Phillip Lynch and Peter Reith were former Deputy Liberal leaders. Greg Hunt was Minister for the Environment in the Abbott Government. ==Election results== ==References== *Division of Flinders - Australian Electoral Commission ==Other websites== * Greg Hunt's website Flinders Category:1901 establishments in Australia",
 "title": "Division of Flinders"
}