{
 "id": "39136",
 "text": "The United States Air Force (USAF) is the aerial warfare branch of the United States armed forces and one of the eight uniformed services. It was a part of the United States Army until September 18, 1947.80 P.L. 235, 61 Stat. 495 (1947); Air Force Link, (2006) \"Factsheets: The U.S. Air Force\". Retrieved April 7, 2006. The USAF is the largest and most of technologically advanced air force in the world. It has thousands of aircraft in service including bombers, fighter aircraft, transports and other kinds, and hundreds of Intercontinental ballistic missiles. Hundreds of thousands of men and women are on active duty in the Air Force and others are in the Reserves and the United States National Guard. ==Officer ranks== Pay grade O-1 O-2 O-3 O-4 O-5 O-6 O-7 O-8 O-9 O-10 Special Insignia Title Second Lieutenant First Lieutenant Captain Major Lieutenant Colonel Colonel Brigadier General Major General Lieutenant General General General of the Air Force Abbreviation2 2d Lt 1st Lt Capt Maj Lt Col Col Brig Gen Maj Gen Lt Gen Gen GAF NATO Code OF-1 OF-2 OF-3 OF-4 OF-5 OF-6 OF-7 OF-8 OF-9 OF-10 1 Awarded as an honorary rank or during periods of a declared war. 2 No periods are used in actual grade abbreviation. 1 Awarded as an honorary rank or during periods of a declared war. 2 No periods are used in actual grade abbreviation. 1 Awarded as an honorary rank or during periods of a declared war. 2 No periods are used in actual grade abbreviation. 1 Awarded as an honorary rank or during periods of a declared war. 2 No periods are used in actual grade abbreviation. 1 Awarded as an honorary rank or during periods of a declared war. 2 No periods are used in actual grade abbreviation. ===Warrant officers=== The Air Force warrant officer ranks, while authorized by law, are not used. ===Enlisted personnel=== US DoD Pay grade E-1 E-2 E-3 E-4 E-5 E-6 E-7 E-7 E-8 E-8 E-9 E-9 E-9 E-9 Insignia No Insignia Title Airman Basic Airman Airman First Class Senior Airman Staff Sergeant Technical Sergeant Master Sergeant¹ Master Sergeant¹ Senior Master Sergeant¹ Senior Master Sergeant¹ Chief Master Sergeant¹ Chief Master Sergeant¹ Command Chief Master Sergeant Chief Master Sergeant of the Air Force Abbreviation AB Amn A1C SrA SSgt TSgt MSgt MSgt SMSgt SMSgt CMSgt CMSgt CCM CMSAF NATO Code OR-1 OR-2 OR-3 OR-4 OR-5 OR-6 OR-7 OR-7 OR-8 OR-8 OR-9 OR-9 OR-9 OR-9 ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. ¹ The USAF does not have a separate First Sergeant rank; it is instead a duty denoted by a diamond within the upper field. == References == ==Other websites== *Find a grave memorial of a World War II \"WASP\" {Women Air Service pilot} Category:Military aviation Category:1947 establishments in the United States",
 "title": "United States Air Force"
}