{
 "id": "391306",
 "text": "\"Professor\" Irwin Corey (July 29, 1914 - February 6, 2017) was an American comedian, actor, and activist. His career began in 1938. Corey began his stand-up career in an San Francisco club, the Hungry i. ==Early life== Corey was born on July 29, 1914 in Brooklyn, New York to an Jewish family. His parents were forced to give him up in an Hebrew Orphan Asylum of New York. He was never adopted, so he spent the rest of his teenage years in the Asylum. Corey studied at the Belmont High School in Los Angeles, California. ===Influences=== Corey was influenced by Charlie Chaplin and by The Marx Brothers. He had influence Lenny Bruce, Mort Sahl, Shelley Berman, Jonathan Winters, Bob Newhart, and Tom Smothers. Lenny Bruce once said that Corey is \"one of the most brilliant comedians of all time\".Kitty Bruce (ed.), The Almost Unpublished Lenny Bruce: from the private collection of Kitty Bruce, Running Press, 1984. p. 10 ==Personal life== Corey was married to Fran Corey from 1941 until her death in 2011. They had two children, Margaret Corey (dead) and Richard Corey. He also has a grandson, Amadeo. He lived in his home town of San Francisco, California until moving to Manhattan, New York for his comedic stage career. Corey died at his Manhattan apartment on February 6, 2017, aged 102. ==Movies== *How to Commit Marriage (1969) *Fore Play (1975) *Car Wash (1976) *Thieves (1977) (reprising his stage role) *Chatterbox! (1977) (cameo) *Fairy Tales (1979) *Stuck on You! (1983) *Jack (1996) *The Curse of the Jade Scorpion (2001) *Irwin & Fran (2012) ==References== ==Other websites== * The Professor's official web site * * National Book Awards speech * New York Press: \"Who Am the World's Foremost Authority?\" * \"Cinema Retro covers Prof. Irwin Corey's 95th birthday party at The Players club\" (2009) Category:1914 births Category:2017 deaths Category:Jewish American actors Category:American movie actors Category:American centenarians Category:American television actors Category:American stage actors Category:American radio actors Category:American voice actors Category:American radio personalities Category:Television personalities from New York City Category:Comedians from New York City Category:Actors from New York City Category:Comedians from San Francisco Category:Actors from San Francisco",
 "title": "Irwin Corey"
}