{
 "id": "391599",
 "text": "In the state of Vermont, United States, there are 23 colleges and universities. This includes one research university, six master's universities, an art school, a culinary school, a law school. The state's largest school is its public university, the University of Vermont. ==Institutions== School Location(s) Control TypeSchool types are based on the Carnegie Classification of Institutions of Higher Education. Enrollment (2009) Founded Bennington College Bennington Private Baccalaureate college 857 1932 Burlington College Burlington Private Baccalaureate college 224 1972 Castleton State College Castleton Public Baccalaureate college 3,050 1787 Champlain College Burlington Private Baccalaureate college 3,482 1878 College of St. Joseph Rutland Private (Catholic) Master's university 547 1956 Community College of Vermont 12 locations Public Associate's college 10,830 1970 Goddard College Plainfield Private Master's university 982 1938 Green Mountain College Poultney Private (Methodist) Baccalaureate college 911 1834 Johnson State College Johnson Public Master's university 2,619 1828 Landmark College Putney Private Associate's college 598 1984 Lyndon State College Lyndonville Public Baccalaureate college 1,854 1911 Marlboro College Marlboro Private Baccalaureate college 523The enrollment count for Marlboro College includes 188 students at Marlboro College Graduate Center, which is listed as a separate school in IPEDS. 1946 Middlebury College Middlebury Private Baccalaureate college 2,484 1800 New England Culinary Institute Montpelier, Essex Junction Private (for-profit) Culinary school 807 1980 Norwich University Northfield Private Master's university 5,280 1819 Saint Michael's College Colchester Private (Catholic) Baccalaureate college 3,438 1904 SIT Graduate Institute Brattleboro Private Master's university 727 1965 Southern Vermont College Bennington Private Baccalaureate college 543 1926 Sterling College Craftsbury Common Private Baccalaureate college 141 1958 University of Vermont Burlington Public Research university 15,785 1791 Vermont College of Fine Arts Montpelier Private Art schoolVCFA's only offered degree is the Master of Fine Arts, suggesting that its listing in the Carnegie Classification as an associate's college is a mistake. 311 1831 Vermont Law School South Royalton Private Law school 748 1972 Vermont Technical College Randolph Center Public Baccalaureate/associate's college 1,910 1866 ==References and notes== ;General * * * ;Specific ==Other websites== *Consortium of Vermont Colleges *Department of Education listing of accredited institutions in Vermont Category:Lists of colleges and universities",
 "title": "List of colleges and universities in Vermont"
}