{
 "id": "391749",
 "text": "{{Infobox company | name = Tesla, Inc. | logo = Tesla Motors.svg | logo_size = 130px | image = Gigafactory Texas Building 1 June 2022.jpg | image_size = 250px | image_caption = Gigafactory Texas, Tesla's headquarters, in Austin, Texas | former_name = Tesla Motors, Inc. (2003–2017) | type = Public | traded_as = | ISIN = | industry = | founded = in San Carlos, California, U.S. | hq_location = Gigafactory Texas | hq_location_city = Austin, Texas | hq_location_country = U.S. | num_locations = 1,068 sales, service and delivery centers | area_served = | key_people = {{Unbulleted list | Elon Musk (CEO) | Robyn Denholm (chair) }} | products = | production = | services = | revenue = (2022) | operating_income = (2022) | net_income = (2022) | assets = (2022) | equity = (2022) | num_employees = 127,855 (2022) | subsid = | owner = Elon Musk (21%) | website = | footnotes = Financials . References: }} Tesla, Inc. ( or ) is a company based in Austin, Texas which makes electric cars. It was started in 2003 by Martin Eberhard and Dylan Stott. Eberhard no longer works there. Today, Elon Musk is the Chief Executive Officer (CEO). It started selling its first car, the Roadster in 2008. The Tesla name originally comes from Nikola Tesla. He was an inventor who worked with electricity, electric cars and many other ideas along with Thomas Edison a century earlier. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits. It provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; and purchase financing and leasing services. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also offers service and repairs to its energy product customers, including under warranty; and various financing options to its solar customers. == Roadster == There were some test cars built from 2004 to 2007, but regular production started in 2008. From then until the end of 2011, they sold 2,150 Tesla Roadsters to customers in 31 countries. It sold for about $100,000 dollars, but it was very fast ( in 3.9 seconds) and could go a long way before the batteries needed to be recharged. One big problem of electric cars compared to cars that run on gasoline is that most electric cars could not go very far before needing to be recharged. A gasoline car can often go before needing more fuel, but most electric cars could not go over on a charge (EV-1, RAV4-EV, etc.). The Roadster could go on a single charge. On February 6, 2018, SpaceX Falcon Heavy sent Elon Musk's Roadster into a Solar orbit. == Model S == The Model S replaces the Roadster. It is sold with different battery sizes – for $58,750 it can go . The top end can go on a charge and with all the extras can cost $100,000. The 2013 Model S was named the Motor Trend Car of the Year, the 2013 Car of the Year by Automobile Magazine and the 2013 World Green Car at the New York International Auto Show. It has a lower drag coefficient than a Toyota Prius, so it uses less energy to push the air out of the way as it moves. As of 2019, the 2019 Tesla Model S can go up to an EPA rated on a single charge. In 2020, this range was made longer, at . == Model X == The Model X is a mid-sized, all-electric, luxury, crossover utility vehicle (CUV) made by Tesla, Inc. that uses falcon wing doors for access to the second and third row seats. The prototype was unveiled at Tesla's design studios in Hawthorne on February 9, 2012. The Model X has an official EPA rated range and the combined fuel economy equivalent and energy consumption for the AWD P90D was rated at . == Model 3 == The Model 3 is a mid-size (US) / compact executive (EU) luxury all-electric four-door sedan manufactured and sold by Tesla, Inc. According to Tesla officials, the 2019 Model 3 Standard Battery version delivers an EPA-rated all-electric range of and the 2019 Long Range Battery version delivers . The Model 3 has a minimalist dashboard with only a centre-mounted LCD touchscreen. Tesla stated that the Model 3 carries full self-driving hardware to be optionally enabled at a future date. Within a week of unveiling the Model 3 in 2016, Tesla revealed they had taken 325,000 reservations for the car, more than triple the number of Model S sedans sold by the end of 2015. These reservations represent potential sales of over US$14 billion. By August 2017, there were 455,000 net reservations, and an average of 1,800 reservations were being added per day. Limited production of the Model 3 began in mid-2017, with the first production vehicle rolling off the assembly line on July 7, 2017, and the official launch and delivery of the first 30 cars on July 28. On July 1, 2018, it was announced that Tesla had met its production goal of 5,000 cars in a week. Total production through end of June 2018 has been 28,578 cars. == Notes == == References == == Other websites == *Official website * Category:2003 establishments in California Category:Companies based in the San Francisco Bay Area Category:Electric vehicles Category:Palo Alto, California Category:Elon Musk Category:American automobile companies",
 "title": "Tesla, Inc."
}