{
 "id": "39182",
 "text": "The 2004 Summer Olympics, officially known as the Games of the XXVIII Olympiad, were held in Athens, Greece from August 13, 2004, until August 29, 2004. It was the first time since 1906 that the Olympics were held in Greece. 10,625 athletes took part. There were 301 medal events. == Bids == The four other candidate cities were Rome, Cape Town, Stockholm, and Buenos Aires. Six other cities had applied, but were turned down by the IOC in 1996. These cities were Istanbul, Lille, Rio de Janeiro, San Juan, Seville, and Saint Petersburg.International Olympic Committee - Athens 2004 - Election Athens won every round of voting and easily beat Rome in round 5, the final vote. Round 2 was to settle a tie break between Cape Town and Buenos Aires from round 1. 2004 Host City Election — ballot results 2004 Host City Election — ballot results 2004 Host City Election — ballot results 2004 Host City Election — ballot results 2004 Host City Election — ballot results 2004 Host City Election — ballot results 2004 Host City Election — ballot results City Country Round 1 Round 2 Round 3 Round 4 Round 5 Athens 32 ... 38 52 66 Rome 23 ... 28 35 41 Cape Town 16 62 22 20 Stockholm 20 ... 19 Buenos Aires 16 44 == Medal count == The ranking in this table is based on information provided by the International Olympic Committee. The total number of bronze medals is greater than the total of gold or silver because in boxing and judo, two bronze medals were awarded in each weight class. Countries are ranked firstly by the number of gold medals they have, then by the number of silver, and then by the number of bronze. Where countries have the same number of each type of medal, they are listed alphabetically and given the same ranking. Medal numbers shown in bold are the highest in their section. Greece, the host nation is highlighted in lavender. Rank Nation Gold Silver Bronze Total 1 United States (USA) 36 39 28 103 2 China (CHN) 32 17 14 63 3 Russia (RUS) 27 27 38 92 4 Australia (AUS) 17 16 16 49 5 Japan (JPN) 16 9 12 37 6 Germany (GER) 13 16 20 49 7 France (FRA) 11 9 13 33 8 Italy (ITA) 10 11 11 32 9 South Korea (KOR) 9 12 9 30 10 Great Britain (GBR) 9 9 12 30 11 Cuba (CUB) 9 7 11 27 12 Ukraine (UKR) 9 5 9 23 13 Hungary (HUN) 8 6 3 17 14 Romania (ROU) 8 5 6 19 15 Greece (GRE) 6 6 4 16 16 Brazil (BRA) 5 2 3 10 17 Norway (NOR) 5 0 1 6 18 Netherlands (NED) 4 9 9 22 19 Sweden (SWE) 4 2 1 7 20 Spain (ESP) 3 11 5 19 21 Canada (CAN) 3 6 3 12 22 Turkey (TUR) 3 3 4 10 23 Poland (POL) 3 2 5 10 24 New Zealand (NZL) 3 2 0 5 25 Thailand (THA) 3 1 4 8 26 Belarus (BLR) 2 6 7 15 27 Austria (AUT) 2 4 1 7 28 Ethiopia (ETH) 2 3 2 7 29 Iran (IRI) 2 2 2 6 29 Slovakia (SVK) 2 2 2 6 31 Chinese Taipei (TPE) 2 2 1 5 32 Georgia (GEO) 2 2 0 4 33 Bulgaria (BUL) 2 1 9 12 34 Jamaica (JAM) 2 1 2 5 34 Uzbekistan (JAM) 2 1 2 5 36 Morocco (MAR) 2 1 0 3 37 Denmark (DEN) 2 0 6 8 38 Argentina (ARG) 2 0 4 6 39 Chile (CHI) 2 0 1 3 40 Kazakhstan (KAZ) 1 4 3 8 41 Kenya (KEN) 1 4 2 7 42 Czech Republic (CZE) 1 3 4 8 43 South Africa (RSA) 1 3 2 6 44 Croatia (CRO) 1 2 2 5 45 Lithuania (LTU) 1 2 0 3 46 Egypt (EGY) 1 1 3 5 46 Switzerland (SUI) 1 1 3 5 48 Indonesia (INA) 1 1 2 4 49 Zimbabwe (ZIM) 1 1 1 3 50 Azerbaijan (AZE) 1 0 4 5 51 Belgium (BEL) 1 0 2 3 52 Bahamas (BAH) 1 0 1 2 52 Israel (ISR) 1 0 1 2 54 Cameroon (CMR) 1 0 0 1 54 Dominican Republic (DOM) 1 0 0 1 54 United Arab Emirates (UAE) 1 0 0 1 57 North Korea (PRK) 0 4 1 5 58 Latvia (LAT) 0 4 0 4 59 Mexico (MEX) 0 3 1 4 60 Portugal (POR) 0 2 1 3 61 Finland (FIN) 0 2 0 2 61 Serbia and Montenegro (SCG) 0 2 0 2 63 Slovenia (SLO) 0 1 3 4 64 Estonia (EST) 0 1 2 3 65 Hong Kong, China (HKG) 0 1 0 1 65 India (IND) 0 1 0 1 65 Paraguay (PAR) 0 1 0 1 68 Colombia (COL) 0 0 2 2 68 Nigeria (NGE) 0 0 2 2 68 Venezuela (VEN) 0 0 2 2 71 Eritrea (ERI) 0 0 1 1 71 Mongolia (MGL) 0 0 1 1 71 Syria (SYR) 0 0 1 1 71 Trinidad and Tobago (TRI) 0 0 1 1 Total Total 301 301 327 929 ==Highlights== * Greek sprinters Konstantinos Kenteris and Ekaterini Thanou withdraw from the games after allegedly staging a motorcycle accident in order to avoid a drug test. * World record holder and strong favourite Paula Radcliffe crashes out of the women's marathon, leaving Mizuki Noguchi to win the gold. * While leading in the men's marathon with less than 10 kilometres to go, Brazilian runner Vanderlei de Lima is attacked by Irish priest Cornelius Horan and dragged into the crowd. De Lima recovered to take bronze. He was later awarded the Pierre de Coubertin medal for sportsmanship. * British athlete Kelly Holmes wins gold in the 800 m and 1500 m. * Liu Xiang wins gold in the 110 m hurdles, equalling Colin Jackson's 1993 world record time of 12.91 seconds. This was China's first ever gold in men's track and field. * The Olympics saw Afghanistan's first return to the Games since 1999. * Hicham El Guerrouj wins gold in the 1500 m and 5000 m. He is the first person to do this at the Olympics since Paavo Nurmi in 1924. * Greek athlete Fani Halkia comes out of retirement to win the 400 m hurdles. * The US women's 4 × 200 m swimming team of Natalie Coughlin, Carly Piper, Dana Vollmer and Kaitlin Sandeno win gold. They beat the long-standing world record set by the German Democratic Republic in 1987. * The United States lost for the first time in Olympic men's basketball since NBA players were let to play in the Games. This defeat came at the hands of Puerto Rico 92–73. * Argentina wins a shocking victory over the United States in the semi-finals of men's basketball. They go on to beat Italy 84–69 in the final. * Windsurfer Gal Fridman wins Israel's first-ever gold medal. * Dominican athlete Félix Sánchez won the first ever gold medal for the Dominican Republic in the 400 m hurdles event. * German kayaker Birgit Fischer wins gold in the K-4 500 m and silver in the K-2 500 m. She became the first woman in any sport to win gold medals at 6 different Olympics, the first woman to win gold 24 years apart and the first person in Olympic history to win two or more medals in five different Games. * Swimmer Michael Phelps wins 8 medals (6 gold and 2 bronze). He became the first athlete to win 8 medals in non boycotted Olympics. * United States' gymnast Carly Patterson becomes only the second American woman to win the all- around gold medal. * Chilean Tennis players Nicolás Massu and Fernando Gonzalez won the gold medal in the Doubles Competition. Massu won the gold and Gonzalez the bronze on the Singles competition. These were Chile's first-ever gold medals. * South America had its best Olympics, with nine gold medals. ==Venues== ===OAKA=== * Athens Olympic Aquatic Centre – diving, swimming, synchronized swimming, water polo * Athens Olympic Tennis Centre – tennis * Athens Olympic Velodrome – cycling (track) * Olympic Indoor Hall – basketball (final), gymnastics (artistic, trampolining) * Olympic Stadium – ceremonies (opening/ closing), athletics, football (final) ===HOC=== * Fencing Hall – fencing * Helliniko Indoor Arena – basketball, handball (final) * Olympic Baseball Centre – baseball * Olympic Canoe/Kayak Slalom Centre – canoeing (slalom) * Olympic Hockey Centre – field hockey * Olympic Softball Stadium – softball ===Faliro=== * Faliro Olympic Beach Volleyball Centre – volleyball (beach) * Faliro Sports Pavilion Arena – handball, taekwondo * Peace and Friendship Stadium – volleyball (indoor) ===GOC=== * Goudi Olympic Hall – badminton * Olympic Modern Pentathlon Centre – modern pentathlon ===Football venues=== * Kaftanzoglio Stadium (Thessaloniki) * Karaiskakis Stadium (Athens) * Pampeloponnisiako Stadium (Patras) * Pankritio Stadium (Heraklion) * Panthessaliko Stadium (Volos) ===Other venues=== * Agios Kosmas Olympic Sailing Centre – sailing * Ano Liosia Olympic Hall – judo, wrestling * Galatsi Olympic Hall – gymnastics (rhythmic), table tennis * Kotzia Square – cycling (individual road race) * Marathon (city) – athletics (marathon start) * Markopoulo Olympic Equestrian Centre – equestrian * Markopoulo Olympic Shooting Centre – shooting * Nikaia Olympic Weightlifting Hall – weightlifting * Panathinaiko Stadium – archery, athletics (marathons finish) * Peristeri Olympic Boxing Hall – boxing * Schinias Olympic Rowing and Canoeing Centre – canoeing (sprint), rowing * Stadium at Olympia – athletics (shot put) * Vouliagmeni Olympic Centre – cycling (individual time trial), triathlon == References ==",
 "title": "2004 Summer Olympics"
}