{
 "id": "39203",
 "text": "Captain Underpants is a popular series of children's books by Dav Pilkey. Most of the books take place in Piqua, Ohio. == Characters == === Main === * George Beard - A 9 3/4-year-old black-skined boy with a flat top. He wears a tie. * Harold Hutchins - A next-door-neighbor and friend of George. He is 10 years old and has a bad hair cut. * Mr. Benny Krupp - Mr. Krupp is the mean school principal of George and Harold. * Captain Underpants - The alter-ego of Principal Krupp. He one day got superpowers. * Melvin Sneedly - George and Harold's smart nemesis. He wears glasses and a bow tie. * Ms. Ribble - The fourth grade teacher of George and Harold. * Sulu And Crackers - George and Harolds pets. * Yestreday Gorge and Harold Doubles of the 2 boys of the same name. === Recurring (Appearing more then once) === * Harold's sister * Henry Hutchins - Harold's grandfather * Jane Beard - George Beard's great- grandmother * Ingrid Ashley and Larry Zarrow - The local TV reporters for Eyewitness News (Channel 4). ===Villains=== * Dr. Diaper - An evil scientist who wears a diaper. * The Talking Toilets- Toilets that can only shout \"YUM, YUM, EAT 'EM UP!\"and eat people, created when George and Harold wrote it in a comic book, and fed it to a machine that makes living 3D copys of 2D drawings created by Melvin Sneedley. * The Turbo-Toilet 2000- The leader of the talking toilets. He appeared on his own in book 11. * Jennifer - An evil alien. * Zorx and Klax - Jennifer's Friends. They tried to help him take over Earth. * Professor Poopypants- A mad scientist from New Swissland that forced everyone to change their name to what the Name Change-o-Chart 2000 says. He later changed his name to Tippy Tinkletrousers. * Wedgie Woman - Ms. Ribble after hypnosis from George and Harold. * Evil George and Evil Harold - George and Harold's evil twins from the alternate dimension. They first met when a horrible accident with the time machine occurred. * Captain Blunderpants - Captain Underpants' evil twin from the alternate dimension. * Nice Mr. Krupp - The Nice Counterpart of Mr. Krupp from the alternate dimension. == List of dinosaurs seen in Captain Underpants == To take this list into consideration - and in line for George and Harold's knowledge, pterosaurs and other reptiles will also be included as dinosaurs. * Allosaurus * Apatosaurus * Brachiosaurus * Dilophosaurus * Ceratosaurus * Ankylosaurus (only mentioned offscreen by Harold in the final book) * Monoclonius * Spinosaurus * Chasmosaurus * Small coelurosaur - possibly Compsognathus * Corythosaurus * Velociraptor * Diplodocus * A duck-billed dinosaur - possibly Maiasaura * Parasaurolophus * Elasmosaurus * Pteranodon * Dimorphodon (referred to as a pterodactyl) * Quetzalcoatlus * Stegosaurus * Styracosaurus * Triceratops * Tyrannosaurus rex * Dimetrodon * Carnotaurus == Forms == === Books === There are 12 Books, The First one is known as The Adventurers Of Captain Underpants, The next one being called Captain Underpants And The Attack Of The Talking Toilets. ==== Spin-offs ==== Captain Underpants Has 2 spin-offs: * Super Diaper Baby * Dog Man === Film === All of the Captain Underpants Films are made by DreamWorks Animation. ==== Movie ==== (See Captain Underpants: The First Epic Movie) ==== TV Show ==== There is a 2018 TV show named The Epic Tales of Captain Underpants. It ran all the way into 2020. It had 3 seasons and 3 specials. Category:20th-century American novels Category:American children's books",
 "title": "Captain Underpants"
}