{
 "id": "392501",
 "text": "Tiny Toon Adventures, also known as Steven Spielberg Presents Tiny Toon Adventures, is an American animated comedy sitcom adventure television series. It aired from September 14, 1990 to December 12, 2009. It follows a group of young cartoon characters who attend Acme Looniversity in the town of Acme Acres to become the next generation of Looney Tunes characters. ==Characters== *Buster Bunny: (voiced by Charlie Adler) A blue male rabbit based on Bugs Bunny. *Babs Bunny: (voiced by Tress MacNeille) A pink female rabbit based on Bugs too. *Plucky Duck: (voiced by Joe Alaskey), A green male duck based on Daffy Duck. *Hamton J. Pig: (voiced by Don Messick), A pink male pig based on Porky Pig. *Fifi La Fume: (voiced by Kath Soucie), A purple-and-white female skunk based on Pepé Le Pew who speaks with a French accent. *Shirley McLoon: (voiced by Gail Matthius), A white female loon based on Shirley MacLaine and Melissa Duck. *Dizzy Devil: (voiced by Frank Welker), A purple Tazmanian devil based on Taz. *Furrball: (voiced by Frank Welker), A blue cat based on Sylvester the Cat. *Sweetie Bird: (voiced by Candi Milo), A pink canary bird based on Tweety. *Calamity Coyote: (voiced by Frank Welker), A gray coyote based on Wile E. Coyote. *Elmyra Duff: (voiced by Cree Summer) A redheaded girl based on Elmer Fudd who wears a blue blouse, a white skirt, black shoes, and a blue bow with a skull at the center. She is the show's female villain. She cares for animals in selfish ways. *Montana Max: (voiced by Danny Cooksey), A young, brown-haired boy based on Yosemite Sam. He is loud, has a bad temper, and loves money. He is the show's male villain. *Gogo Dodo: (voiced by Frank Welker), A green male dodo based on Yoyo Dodo. *Little Beeper: (voiced by Frank Welker) A red and orange feathered roadrunner. *Sphinxy Sphinx (voiced by Susan Blu) A young female sphinx, who is Gogo's best friend, and she both lives in Wackyland and attends Acme Looniversity as one of its top contract students. ==Other websites== *Tiny Toon Adventures at the Internet Movie Database *Tiny Toon Wiki Category:1990 American television series debuts Category:Animated television series Category:Looney Tunes Category:CBS network shows Category:First run syndicated television programs Category:2009 American television series endings Category:English-language television programs",
 "title": "Tiny Toon Adventures"
}