{
 "id": "392651",
 "text": "Tipu Sultan (born Fateh Ali Tipu) (1 December 1751 – 4 May 1799), is also known as Sher-e-mysoor, was the ruler of Mysore from 1782 to 1799. He was also a scholar, soldier and poet. == Family background == Tipu Sultan was the eldest son of Sultan Hyder Ali according to widely recognised recordation of Punjabi chroniclers, he might belong to caste of the Sipra-Gill Jat patrilocal family. Tipu Sultan was born in Devanahalli in 1751. The birthplace of Tipu Sultan, located very close to the Devanahalli Fort is just a small pillared closed place with a stone tablet which declares the place to be the birthplace of Tipu Sultan. The area around the place is known as Khas Bagh. Tipu Sultan introduced several new laws, including new coinage, a new lunisolar calendar and a new land revenue system. He started the growth of the silk industry in Mysore. At the request of the French, he built a church, the first in Mysore. With French help, Tipu Sultan fought against the British to keep Mysore's independence. His ancestors were Muslim Sipra (Gill Jats) from Punjab == History of Tipu Sultan == Tipu sultan was born in the Bangalore area of devanto Hyder Ali, a military officer and practical ruler of the kingdom of Mysore in the year 1751. His Father & Mother named their baby Fateh Ali but after called him Tipu after the local saint Tipu Mastan Aulia.Soon, Hyder Ali’s career progressed and in 1761 he became the ruler of Mysore. Hyder Ali had a political alliance with the French, and Tipu studied military tactics and strategies from the French. He had some of the best tutors to teach him various subjects like shooting, riding and swordsmanship and joined his father in the 1766 invasion of Malabar. Tipu at age 15 with a force of only two to three thousand men captured the family of the Malabar chief. The Malabar ruler surrendered to Hyder Ali because of Tipu’s successful invasion. Ghazi Khan, a high officer in the military of Hyder Ali and a great warrior himself, tutored Tipu Sultan. This military education made Tipu a great soldier and a general.Tipu sultan died in 4th Anglo Mysore war == Ruler of Mysore == After Hyder Ali died in the year 1782, Tipu became the new ruler of Mysore. He had already fought in two victorious wars – the First Anglo Mysore and the Second Anglo Mysore War, under the leadership of his father. He knew that British forces were a great threat to his kingdom. He therefore focused more on military advances especially Mysorean rockets which were successfully used by his father in the Second Anglo Mysore War against the British. == Mysore Rockets == In the mid eighteenth century rockets had declined in significance as a tool for bombardment with improvements in mortar fire. At the Battle of Pollilur fought in 1780 iron cased rockets were effectively deployed by Mysore forces, restricting the East India Company’s vanguard movement, and causing bodily harm to defending troops. Mysore rockets were iron cased with swords fitted onto them as stabilising sticks. The rockets encountered by the British, were advanced for the time and captured their imagination and curiosity. Tipu Sultan had written a Military Manual Fathul Mujahidin in which he explained the operation of these Mysore Rockets. This was mainly due to the iron casing holding the rocket propellant which enabled greater pressure and extended performance of up to 2 km. In the year 1801, several of the Mysore rockets were sent to England in the Royal Arsenal lab for R&D; by Col. (Later Sir) William Congreve. Roughly, 4 years later in the year 1805, Royal Arsenal came up with their first Congreve rocket only due to the Technology devised by Haider Ali and his son Tipu Sultan. These Congreve Rockets helped the British troops in the Napoleonic Wars and also in the War of 1812, with a significant role in the Battle of Baltimore. == Palaces of Tipu Sultan across Bangalore == Bangalore Fort though built by Kempe Gowda of Vijaynagar Empire in the 16th century, was renovated and made into a stone fort by Hyder Ali in 1761. At one point in time when the British bombed the fort, Tipu Sultan repaired it completely. However, the fort was captured by the British after the third Anglo Mysore War. Currently, Delhi Gate and remnants of bastions are the only two parts remaining of this once so powerful fort. Within the Bangalore fort, there is a palace made of wood famously known as Tipu Sultan’s Summer Palace. Though started during the period of Hyder Ali, its building ended during the reign of Tipu Sultan. An example of Indo-Islamic architecture, the walls of the palace are embellished by pretty flower motifs. Currently, the fort is a tourist place in Bangalore near the Kalasipalyam Bus Stand. Tipu Sultan in his tenure also finished the construction of Lal Bagh Botanical Garden in the Bangalore area which was started by his father Haider Ali. The garden has a large collection of tropical plants as well as a lake and an aquarium. Located in South Bangalore, it is one of the major hot spot of Bangalore. The garden is made in the Mughal style and comprises several plants and trees from various nations. == Anglo Mysore Wars and death of Tipu Sultan == Srirangapatnam, the island fortress was the capital of Mysore during the 19th century. It was so well organized with good trade routes that British feared terrible consequences. In addition, the ruler of Mysore had an army as effective as that of British. This led to four to consecutive wars. Although the first two were won by the Ruler of Mysore, the third had dire consequences – Tipu’s two sons aged 8 and 10 were detained by the British forces. Finally, in the fourth, the British first besieged the fortress and then took it by storm. Tipu Sultan, the ruler of Mysore, was killed in the battle for Srirangapatnam. ==Other websites== * The Sword of Tipu Sultan - Volume 1 == References == Category:1750 births Category:1799 deaths Category:Indian monarchs Category:18th century in India Category:Indian Muslims",
 "title": "Tipu Sultan"
}