{
 "id": "392643",
 "text": "David Johnny Oduya (born October 1, 1981) is a Swedish former professional ice hockey defenceman. He played parts of sixteen seasons in the National Hockey League (NHL). He played for the New Jersey Devils, Atlanta Thrashers, Winnipeg Jets, Chicago Blackhawks, Dallas Stars, Ottawa Senators, and Philadelphia Flyers. He won the Stanley Cup with the Blackhawks, once in 2013 and again in 2015. ==Career== He was drafted by the Washington Capitals with the 221st overall pick in the 2001 NHL Entry Draft. He first played in the NHL for the New Jersey Devils. He played 4 seasons with the Devils before he was traded to the Atlanta Thrashers on February 4, 2010 along with Niclas Bergfors, Patrice Cormier and a 1st round draft pick in the 2010 NHL Entry Draft for Ilya Kovalchuk and Anssi Salmela. He played 3 seasons with the Atlanta Thrashers/Winnipeg Jets and was traded to the Chicago Blackhawks for a 2nd round pick and a 3rd round pick in the 2013 NHL Entry Draft. On June 24, 2013, He won the Stanley Cup with the Blackhawks after they defeated the Boston Bruins 4 games to 2 in the 2013 Stanley Cup Finals. On July 15, 2015, Oduya signed a two-year contract with the Dallas Stars. On 28 February 2017, the Stars would trade Oduya back to the Blackhawks in exchange for Mark McNeill and a fourth-round draft pick. On 24 July, Oduya would sign a one-year contract with the Ottawa Senators. The Senators would put Oduya on waivers and the Philadelphia Flyers would claim him on 26 February. He would only play one game with the Flyers before suffering a lower body injury on 10 March. He didn't play another game in the NHL after and would retire from playing professional ice hockey. ==References== ==Other websites== * Category:1992 births Category:Living people Category:Atlanta Thrashers players Category:Chicago Blackhawks players Category:Dallas Stars players Category:Moncton Wildcats players Category:New Jersey Devils players Category:Philadelphia Flyers players Category:Sportspeople from Stockholm Category:Stanley Cup champions Category:Swedish Hockey League players Category:Swedish ice hockey defencemen Category:Victoriaville Tigres players Category:Winnipeg Jets players",
 "title": "Johnny Oduya"
}