{
 "id": "39270",
 "text": "In an ethnic cleansing, one ethnic or religious group forces another to leave an area. The goal of an ethnic cleansing is to remove a specific group of people from a certain geographical area. Methods of ethnic cleansing include forcing people to move; deporting people; threatening them until they leave; rape; and mass murder. ==Definitions== === What is it? === The United Nations defines ethnic cleansing this way:Hayden, Robert M. (1996). Schindler's Fate: Genocide, Ethnic Cleansing, and Population Transfers. Slavic Review 55 (4): 727-48. * It is done on purpose, as part of a plan * It is done by one ethnic or religious group * That group wants to be the only group that lives in a certain area * The group uses violence, conflict and terror to force other ethnic or religious groups to leave that area === Methods === Throughout history, methods of ethnic cleansing have included: * Murder * Torture * Arresting innocent people and putting them in jail * Executing people without a trial * Rape and sexual assault * Forcing people to live in ghettoes * Forced migration and deportation * Attacking civilians and civilian areas (like homes and schools) * Destroying property === Genocide vs. ethnic cleansing === Also see: Genocide Genocide is a form of ethnic cleansing. In a genocide, one group or country attempts to destroy a different national, racial, ethnic, or religious group - either partially, or completely. For example, during the Holocaust, Adolf Hitler and Nazi Germany tried to kill every Jew in Europe. This was both a genocide and an ethnic cleansing. However, not every ethnic cleansing is a genocide. In an ethnic cleansing, one group is trying to make the second group leave a specific area.Case of Jorgic v. Germany: Judgment §45 (European Court of Human Rights, December 10, 2007). Citing Bosnia and Herzegovina v. Serbia and Montenegro § 190 (International Court of Justice). European Court of Human Rights. Council of Europe. Retrieved April 9, 2016. For example, in 1492, Spain ordered its Jews to convert to Catholicism or leave, and at least 40,000 fled. This was an ethnic cleansing, because Spain was trying to make all Jews leave the country. However, because Spain was not also trying to destroy the Jews as a group, this was not a genocide (based on the definitions in international laws). ==International law== Also see: International Criminal Court International law does not recognize ethnic cleansing as a specific crime. In fact, there is no agreed-upon definition of \"ethnic cleansing\" in the law.Ferdinandusse, Ward (2004). The Interaction of National and International Approaches in the Repression of International Crimes. The European Journal of International Law 15 (4): 1041-1053. . Archived from the original on July 5, 2008. However, there are international laws against genocide, war crimes, and crimes against humanity. Acts of ethnic cleansing often qualify as one of these crimes (and some qualify as all three). Ethnic cleansing often involves murdering, raping, deporting, and/or persecuting large groups of people; these are all crimes against humanity under the International Criminal Court's laws.Rome Statute of the International Criminal Court . Article 7: Crimes against humanity. pp. 3-4. January 16, 2002. Retrieved April 9, 2016. In 2009, the International Criminal Tribunal for the Former Yugoslavia (ICTY) agreed that deporting a population from its home is a crime against humanity.Updated Statute of the International Criminal Tribunal for the Former Yugoslavia, Article 5. p. 6. International Criminal Tribunal for the former Yugoslavia. United Nations. September 2009. Retrieved April 9, 2016. ==Examples of ethnic cleansing== ===Jews in ancient and medieval history=== Also see: Pogroms and antisemitism During ancient and medieval history, Jewish people in many countries were victims of ethnic cleansing. For example, around 1290 AD, King Edward I ordered all of the Jews in England to leave the country. Hundreds of elderly Jews were executed. Next, France and some German states did the same. Then, in 1492, Spain ordered its Jews to convert to Catholicism or leave the country. It threatened to execute any Jew who stayed in Spain, without giving them a trial first. Between 40,000 and 100,000 Jews were forced to leave Spain. Ten years later, in 1502, Spain also forced its Muslims to leave the country. File:Expulsion judios-en.svg|Ethnic cleansing of Jews in Europe from 1100 1600 File:BritLibCottonNeroDiiFol183vPersecutedJews.jpg|\"Jews being Persecuted\" (England, 13th century) File:French Jews executed by burning.jpg|Drawing of French Jews being burned to death (1410) File:Alhambra Decree.jpg|Spain's original law requiring Jews to convert to Catholicism or leave Spain File:An auto-da-fé of the Spanish Inquisition and the execution o Wellcome V0041892.jpg|Jews who refused to convert or leave Spain were called heretics and could be burned to death on a stake ===Early modern history: Ireland=== In 1652, Oliver Cromwell and the English military took over Ireland. Cromwell wanted all Catholics to leave eastern Ireland.Norbrook, David (2000).Writing the English Republic: Poetry, Rhetoric and Politics, 1627–1660. Cambridge University Press. p. 245. . He \"offered Irish Catholics a choice between genocide and forced mass population transfer\" to northwest Ireland. Cromwell and the English military took away 40% of the land owned by Irish Catholics and gave it to English Protestants. On land that Catholics still owned, they burned crops. Their goal was to starve the Irish Catholics and force them to move away.Stewart, Frances (2000). War and Underdevelopment: Economic and Social Consequences of Conflict, Volume I. Oxford University Press. p. 51. . The English also massacred Irish Catholics and threatened to execute any Irish person who fought back.Parliament of England (August 12, 1652). Act for the Settlement of Ireland. Constitution Society. Retrieved April 9, 2016. England's actions were \"the greatest episode of ethnic cleansing ever attempted in Western Europe,\" according to historian John Morrill.Morrill, John (December 2003). Rewriting Cromwell – A Case of Deafening Silences. Canadian Journal of History 38 (3): 553. About 600,000 Irish people died almost half (43%) of the Irish population. This was definitely an ethnic cleansing, because the English tried to force all Catholics out of eastern Ireland.Lutz, James M.; & Lutz, Brenda J. (2004). Global Terrorism. Routledge. p. 193. .Levene, Mark (2005). Genocide in the Age of the Nation-State. I.B.Tauris. pp. 55-57. . Since so many Irish Catholics were killed, some historians say it was also a genocide.Coogan, Tim Pat (2002). The Troubles: Ireland's Ordeal and the Search for Peace. St. Martin's Griffin. p. 6. .Axelrod, Alan (2002). Profiles in Leadership. Prentice Hall Press. p. 122. .Ellis, Peter Berresford (2002). Eyewitness to Irish History. John Wiley & Sons Inc. p. 108. . They argue that Cromwell was trying to destroy the Irish Catholics, not just push them into the northwest. File:Oliver Cromwell Gaspard de Crayer.jpg|Oliver Cromwell led the program to ethnically 'cleanse' eastern Ireland of Irish Catholics File:Map of British plantations of Ireland, 1550–1610.png|Map showing Irish-controlled areas in green before Cromwell invaded File:PRENDERGAST(1870) p 415 Map of the Settlement of Ireland by the Act of 26th September, 1653.jpg|In 1653, Cromwell ruled that all Irish Catholics had to move to the green areas on this map File:Massacre at Drogheda.jpeg|English soldiers massacre Irish Catholic civilians ===The 19th century: Native Americans removal=== In the 19th century, the United States government committed an ethnic cleansing against Native American tribes. At that time, the United States was much smaller than it is now, and its population was growing. People wanted more land. The area we now call the Southern United States had always belonged to Native American tribes, like the Cherokee Nation. However, many Americans wanted to take over this land. In the early 1800s, the United States government started a program of 'removing' these tribes from the South. Its goal was to make the tribes move west, outside the United States, so Americans could take their land. Some tribes signed treaties and agreed to move. However, other tribes refused to leave the land that had always been theirs. In 1830, President Andrew Jackson signed the Indian Removal Act. He used this law to force tribes in the South to leave the United States.Prucha, Francis Paul (1984). The Great Father: The United States Government and the American Indians, Volume I. University of Nebraska Press. p. 206. ASIN B002DIAUDE. Under Jackson's command, the United States military took land away from Creek and Seminole Indians. ==== The Trail of Tears ==== The Cherokee Nation refused to leave their homes. In 1838, President Martin van Buren ordered the military to force them to leave.p. 41 Soldiers forced about 15,000 Cherokees and 2,000 of their slaves into internment camps, where 353 Cherokee died from diseases during one summer.pp. 41–42 After that, the United States military forced the Cherokee to walk from the South to what is now Oklahoma and Arkansas. Around 4,000 people died on the way, according to most historians. This was one out of every four people in the Cherokee population. Because so many people died, this forced migration is now called the Trail of Tears. File:0000001c.jpg|Map showing the U.S. states (in red) and Indian territory before Indian Removal started File:Hunting Indians in Florida.jpg|Drawing called \"Hunting Indians in Florida with Bloodhounds\" (1848) File:Trails of Tears en.png|Map showing the forced migration of Indian tribes File:Fort Marr.JPG|Part of the internment camp the Cherokee were forced into File:Village Creek State Park Wynne AR 61.jpg|Drawing of the Trail of Tears File:Trail of tears map NPS.jpg|Map showing Trail of Tears routes ===The 20th century: Poles during The Holocaust=== In 1939, Nazi Germany invaded Poland. This started World War II. After taking over part of Poland, Nazi Germany committed an ethnic cleansing against the Polish people. The Nazis forced at least 1.5 million Polish people out of the country. They wanted to make room for Germans to move into Poland and have the living space for themselves. They also used the Polish people they deported for forced labor. The Nazis sent hundreds of thousands of Polish people to concentration camps and death camps. During World War II, they killed at least 3 million Polish Jews and at least 1.9 million non-Jewish Poles. File:Bydgoszcz 1939 Polish priests and civilians at the Old Market.jpg|Public execution of innocent Polish civilians (1939) File:Bundesarchiv Bild 101I-133-0703-19, Polen, Litzmannstadt, Juden hinter Stacheldraht.jpg|Jews inside a Polish ghetto (1941) File:Deportation to Treblinka from ghetto in Siedlce 1942.jpg|Polish Jews who were deported from a ghetto to a death camp (1942) File:Czeslawakwoka.jpg|A Polish child who died after 3 months in Auschwitz (1942) File:German officer executes Jewish women who survived a mass shooting outside the Mizocz ghetto, 14 October 1942.jpg|Nazi Einsatzgruppen massacre Polish civilians (1942) File:Polish farmers killed by German forces, German-occupied Poland, 1943.jpg|Polish farmers murdered by Nazis (1943) ===The 21st century: Darfur=== Starting in 2003, the government of Sudan was accused of committing an ethnic cleansing against black ethnic groups in Darfur.Power, Samantha (August 23, 2004). \"Dying in Darfur: Can the ethnic cleansing in Sudan be stopped?\" The New Yorker. Archived from the original on December 4, 2004. Retrieved April 10, 2016.Andersson, Hilary (May 27, 2004). \"Ethnic cleansing blights Sudan.\" BBC News Online. BBC. Retrieved April 10, 2016. The Sudanese military, police, and a militia called the Janjaweed have done this by:Collins, Robert O. (2005). Civil Wars and Revolution in the Sudan: Essays on the Sudan, Southern Sudan, and Darfur, 1962–2004. Tsehai Publishers. p. 156. . * Attacking and massacring civilians * Bombing and burning down villages * Forcing people to leave Darfur, then giving their villages to Arab people * Raping and sexually assaulting thousands of women and girls As of 2007, about 450,000 black Darfurians had been killed, and about 800 villages had been destroyed. As of April 2008, about 2.5 million people one-third of Darfur's population were living in refugee camps. These people had been forced to leave their homes, either by soldiers, or because their villages had been destroyed. File:Darfur map.png|Map showing Darfur (in green) File:Darfur report - Page 1 Image 1.jpg|A village that was burned down (2004) File:Darfur report - Page 5 Image 1.jpg|More than 40,000 refugees lived in this camp in Sudan (2004) File:Darfur refugee camp in Chad.jpg|A refugee camp in Chad for Darfurians (2005) File:North Darfur IDP malnourished child.jpg|A starving refugee child File:Satellite image of the burning of Tajalei, March 6, 2011.jpg|Satellite photo of a burned village (2011) ==Notes== ==References== Category:Crimes against humanity",
 "title": "Ethnic cleansing"
}