{
 "id": "392830",
 "text": "Sonic the Hedgehog CD (Sonic CD for short) is a platform video game created by Sega. It is part of the Sonic the Hedgehog series. It was released for the Sega CD game console in 1993. In chronological order it is after the first game and \"before the sequel.\" The game involves the use of a time travel system that allows Sonic to travel to both the past and the future in a level. Each zone has four variants: the \"past,\" the \"present,\" the \"good future,\" and the \"bad future.\" Each has different graphics, music, enemies, and obstacles. The game introduces two characters to the Sonic the Hedgehog series: Amy Rose, a pink female hedgehog who is in love with Sonic, and Metal Sonic, an evil robotic version of Sonic. ==Gameplay== Sonic CD is similar to the original game; the player goes through lots of levels called \"zones\" to battle Dr. Robotnik every 3 acts. This game adds time travel; Sonic can hit a time post and keep running fast to go to the past or future. To make a good future, the player must explore each zone's past version to find a generator and destroy it. ==Development== ===Release and translation=== Sonic CD was released in Japan on September 23, 1993. It was released in Europe in October 1993. The game was released in North America in November 1993. ===Remake=== In 2011, for the 20th anniversary of Sonic the Hedgehog, indie game developer Christian Whitehead made a new version of the game for Xbox 360, PlayStation 3, Windows, iOS and Android. The port was a success, and Whitehead was later asked by Sega to remake Sonic 1 and Sonic 2 for mobile devices. Whitehead would go on to help make Sonic Mania. Those ports of 1, 2 and CD would be used in Sonic Origins. ==Reception== Sonic CD received a lot of praise. The Sega CD version sold more than 1.5 million copies. It sold more copies than any other game on the Sega CD.Official Gallup UK Mega-CD sales chart, February 1994, published in Mega issue 17 The graphics and sound were praised. Electronic Games said that the game looked similar to older games. They said it did not use the Sega CD's special features very much. However, they said that this did not make the game worse. They said the music was what made Sonic CD \"stand above the crowd\". The reviewers of Electronic Gaming Monthly (EGM) said the game's animated cinematics and sound were good. however, they said that the frame rate decreases during special stages. The gameplay was liked. Sega Pro said the bigger environments and the time travel added to the replay value. They said that \"the more you play Sonic CD the better it gets\". However, they said they felt the game was too easy. In its debut issue, Sega Magazine said Sonic CD could be \"a classic\". They said the originality in the special stages and time travel was great. ==Notes== ==References== Category:1993 video games Category:Android (operating system) games Category:IOS games Category:Platform games Category:PlayStation Network games Category:Sega CD games Category:Side- scrolling platform games Category:Side-scrolling video games Category:Single- player video games Category:Sonic the Hedgehog games Category:Video games about time travel Category:Video games developed in Japan Category:Windows games Category:Xbox 360 Live Arcade games",
 "title": "Sonic the Hedgehog CD"
}