{
 "id": "393399",
 "text": "The 2006 Royal Rumblewas the nineteenth annual Royal Rumble PPV event held by WWE at the American Airlines Arena, in Miami, on January 29, 2006. It was sponsored by Sony Entertainment and The Con. ==Qualification matches== *Chavo Guerrero defeated Rob Conway – Raw, January 9 *Shelton Benjamin defeated Val Venis – Raw, January 9 *Kane defeated Snitsky – Raw, January 9 *Sylvan defeated Scotty 2 Hotty – WWE Velocity, January 15 (aired January 21) *Trevor Murdoch defeated Antonio – WWE Heat, January 16 (aired January 20) *Viscera defeated Lance Cade, Gregory Helms and Tyson Tomko in a Battle Royal match – WWE Heat, January 16 (aired January 20) *Jonathan Coachman defeated Jerry Lawler – Raw, January 23 *The Mexicools (Psicosis and Super Crazy) defeated The Dicks (Chad and James) and The Full Blooded Italians (Nunzio and Vito) in a Triple Threat tag team match – SmackDown!, January 24 (aired January 27) Other on-screen talent Role: Name: Commentator Michael Cole Commentator Jerry \"The King\" Lawler Commentator Joey Styles Commentator Tazz Commentator Carlos Cabrera Commentator Hugo Savinovich Interviewer Todd Grisham Interviewer Josh Mathews Ring announcer Tony Chimel Ring announcer Lilian Garcia Referee Mike Chioda Referee Mickie Henson Referee Chris Kay Referee Jim Korderas Referee Nick Patrick Referee Charles Robinson General manager Theodore Long General manager Vince McMahon Bingo machine tumbler Candice Michelle Bingo machine tumbler Victoria Bingo machine tumbler Torrie Wilson ==Results== No. Results Stipulations Times Heat Finlay defeated Brian Kendrick Singles match 02:07 1 Gregory Helms defeated Kid Kash (c), Funaki, Jamie Noble, Nunzio and Paul London 6-Way Cruiserweight match for the WWE Cruiserweight Championship 07:40 2 Mickie James defeated Ashley Singles match with WWE Women's Champion Trish Stratus as Special Guest Referee 07:44 3 The Boogeyman defeated John \"Bradshaw\" Layfield (with Jillian Hall) Singles match 01:54 4 Rey Mysterio won by last eliminating Randy Orton 2006 Royal Rumble match 1:02:12 5 John Cena defeated Edge (c) (with Lita) Singles match for the WWE Championship 14:02 6 Kurt Angle (c) defeated Mark Henry (with Daivari) Singles match for the World Heavyweight Championship 09:29 ===Royal Rumble entrances and eliminations=== Red ██ and \"Raw\" indicates a Raw superstar, blue ██ and \"SD!\" indicates a SmackDown! superstar. A new entrant came out approximately every 90 seconds. Draw Entrant Brand Order Eliminated by Time Eliminations Triple H Raw 28 Mysterio 60:09 5 Rey Mysterio SD! 62:12 6 Simon Dean SD! Mysterio and Triple H 00:45 0 Psicosis SD! Mysterio 01:15 0 Ric Flair Raw Triple H 01:20 0 Raw Triple H 09:02 2 Jonathan Coachman Raw Big Show 00:30 0 Bobby Lashley SD! Big Show & Kane 04:17 1 Kane Raw Triple H 03:33 1 10 Sylvan SD! Lashley 00:18 0 11 Carlito Raw 26 Van Dam 38:29 2 12 Chris Benoit SD! 17 Orton 30:31 2 13 Booker T SD! Benoit 00:18 0 14 Joey Mercury SD! 22 Nitro 29:14 1 15 Tatanka SD! 12 Mercury & Nitro 14:09 0 16 Johnny Nitro SD! 23 Michaels 25:45 2 17 Trevor Murdoch Raw 13 Michaels 13:41 0 18 Eugene Raw 15 Benoit 16:25 0 19 SD! 10 Van Dam 02:49 0 20 Rob Van Dam Raw 27 Mysterio 23:52 3 21 Orlando Jordan SD! 21 Orton 16:09 0 22 Chavo Guerrero Raw 11 Triple H 00:59 0 23 Matt Hardy SD! 14 Viscera 07:42 0 24 Super Crazy SD! 16 Mysterio 07:40 0 25 Shawn Michaels Raw 25 Shane McMahon 12:55 3 26 Chris Masters Raw 19 Carlito 07:01 1 27 Viscera Raw 18 Carlito & Masters 05:20 1 28 Shelton Benjamin Raw 24 Michaels 06:51 0 29 Goldust Raw 20 Van Dam 03:09 0 30 Randy Orton SD! 29 Mysterio 13:04 2 ==References== Category:Royal Rumble Category:Sports in Miami Category:2006 in American television Category:2006 in professional wrestling Category:2000s in Florida Category:21st century in Miami",
 "title": "Royal Rumble (2006)"
}