{
 "id": "393394",
 "text": "Brooke Adams (February 8, 1949) is an American actress. == Selected Filmography == Film Year Title Role Notes 1971 Murders in the Rue Morgue Nurse (uncredited) 1974 Party Guest (uncredited) 1974 The Lords of Flatbush (uncredited) 1976 Car Wash Terry 1977 Shock Waves Rose 1978 Days of Heaven Abby 1978 Invasion of the Body Snatchers Elizabeth Driscoll 1978 (uncredited) 1979 Stacey Bishop 1979 Sarah Dacos 1979 Cuba Alexandra Lopez de Pulido 1980 Tell Me a Riddle Jeannie 1983 Utilities Marion Edwards 1983 Sarah Bracknell 1985 Almost You Erica Boyer 1985 Special Guest Star in Stuff Commercial 1985 Key Exchange Lisa 1987 Man on Fire Jane 1991 Virginia Marshall 1992 Gas Food Lodging Nora 1995 Elizabeth Thomas Brewer 2002 Made-Up Elizabeth James Tivey Also producer 2003 Party Animals Celeb Mother Short film 2005 At Last Carol Singleton 2006 Samantha Porter 2008 Carolyn 2009 Gary's Walk Marcia Television Year Title Role Notes 1965 O.K. Crackerby! Cynthia Crackerby 14 episodes 1974 F. Scott Fitzgerald and 'The Last of the Belles' Kitty Preston TV movie 1975 Who Is the Black Dahlia? Diane Fowler TV movie 1975 Song of the Succubus Olive Deems / Gloria Chambers TV movie 1975 Black Bart Jennifer TV short 1975 Murder on Flight 502 Vera Franklin TV movie 1976 Police Woman Angela Episode: \"Angela\" 1976 James Dean Beverly TV movie 1976 Mitzi Margolis Episode: \"The Boy Next Door\" 1976 Kojak Julie Winston Episode: \"Dead Again\" 1977 Family Lizzie Episode: \"Acts of Love: Part 1\" Episode: \"Acts of Love: Part 2\" 1978 Family Lizzie Episode: \"Echoes of Love\" 1979 Nero Wolfe Sarah Dacos TV movie 1981 Great Performances Episode: \"Summer\" 1984 Lace Jennifer 'Pagan' Trelawney TV movie 1984 Special People Diane Dupuy TV movie 1984 American Playhouse Episode: \"Haunted\" 1985 Lace II Pagan Tralone TV movie 1987 American Playhouse Julia Newell Episode: \"The Innocents Abroad\" 1987 Paul Reiser Out on a Whim TV movie 1988 Grace Danet TV movie 1988 Moonlighting Terri Knowles 3 episodes 1989 Bridesmaids Pat TV movie 1991 Sometimes They Come Back Sally Norman TV movie 1993 Anna TV movie 1994 Probable Cause TV movie ==References== Category:Actors from New York City Category:American movie actors Category:1949 births Category:Living people",
 "title": "Brooke Adams"
}