{
 "id": "393472",
 "text": "OS X 10.8 \"Mountain Lion\" is an operating system made by Apple Inc. for its Macintosh line of computers. It is a version of OS X, and carries the release number 10.8. It was released on July 25, 2012. According to Apple, \"Mountain Lion\" contains over 200 changes and improvements since OS X 10.7 \"Lion\". It was a very good operating system, but Apple decided to ruin the UI two updates later (in OS X 10.10 \"Yosemite\"). ==History== \"OS X 10.8\" was announced February 16, 2012 along with the release of an unfinished (developer preview) version for people who are signed up to its \"Developer Portal\". The upgrade saw released to the public on the Mac App Store on 25 July, 2012 after over 5 months in beta. ==Notable New Features== Main features: *Notification Center - a place to see what has happened on your computer since you last checked. *Notes - an app to make notes on, similar to that on the iPad and iPhone. *Messages - send free \"iMessages\" to other Mac, iPhone and iPad users. *Reminders - make your Mac remind you about something, similar to the iPhone and iPad app. *Game Center - play games and compare scores with other Game Center users on Mac, iPhone and iPad. *AirPlay Mirroring - stream your Mac's screen to an Apple TV. *Power Nap - allows your Mac to download updates while asleep. *Safari 6 - includes a new search/address bar and a new way to see all your open tabs. *Dictation - allows you to dictate words to your Mac so you don't have to type. Smaller features: *Updated dock - the dock has a more metallic look, rather than the glass look seen previously. *Facebook and Twitter integration - share files directly to Facebook and Twitter, and post/tweet from Notification Center. *Save to iCloud - save Pages, Keynote and Number's documents to iCloud. *Gatekeeper - stops apps from installing unless from the Mac App Store or approved by Apple. *Search Launchpad - search for an app in launchpad. == References == Category:MacOS",
 "title": "OS X Mountain Lion"
}