{
 "id": "393646",
 "text": "Elizabeth Marie Tall Chief (stage name Maria Tallchief; January 24, 1925 - April 11, 2013) was the first person of Native American descent to become prima ballerina for a major company. She is especially well known for her time with the New York City Ballet, where she performed between 1948 and 1965. Maria Tallchief grew up on an Indian reservation in Oklahoma. Her father was Osage. Her mother was Scottish-Irish. She started doing ballet at age four. By the time she was eight, she had already gone through all teachers at her level in Oklahoma, so her family moved to Beverly Hills. She was trained by Bronislava Nijinska, David Lichine, and George Balanchine. Balanchine became her husband in 1942. She starred in many of her husband's ballets including The Firebird. After she starred in The Firebird, she got international recognition. She was an artistic director of the Chicago City Ballet from 1980 to 1987. She was recognized in the National Women's Hall of Fame. Maria Tallchief died due to complications from surgery to fix a broken hip at the Northwestern Memorial Hospital in Chicago at age 88. ==References== *Anderson, Jack. \"Maria Tallchief, a Dazzling Ballerina and Muse for Balanchine, Dies at 88.\" New York Times Apr 13 2013, Late Edition (East Coast) ed. ProQuest. 29 May 2015. *Matheson, Katy. \"Tallchief, Maria.\" World Book Advanced. World Book, 2015. Web. 29 May 2015. ==Other websites== *Archive footage of Maria Tallchief and Michael Maule performing Firebird in 1951 at Jacob's Pillow *Biography for Maria Tallchief at the Internet Movie Database *Maria Tallchief from Upstream Video Productions *Maria Tallchief interview by Bruce Duffie * Maria Tallchief Dances TV appearance, Christmas 1952 Category:Entertainers from Oklahoma Category:1925 births Category:2013 deaths Category:Deaths from surgical complications Category:Deaths from fractured hip Category:Accidental deaths in Chicago Category:Accidental deaths from falls Category:American dancers Category:20th-century Native American people",
 "title": "Maria Tallchief"
}