{
 "id": "393786",
 "text": "James Jesus Angleton (December 9, 1917 – May 12, 1987) was chief of CIA counterintelligence from 1954 to 1975. His official title was Associate Deputy Director of Operations for Counterintelligence (ADDOCI). He started towards the end of World War II, and worked in Italy for the OSS (Office of Strategic Services) after the war. Returning to Washington DC, he became one of the founding members of the CIA in 1949. The peak of his career was in detecting \"moles\", that is, foreign spies in American and western secret services.Mangold, Tom. 1991. Cold Warrior: James Jesus Angleton: the CIA's master spy hunter. New York: Simon and Schuster. The 1970s Church Committee of the US Senate established that Angleton was in charge of the domestic spying activities of the CIA under 'Operation CHAOS'.Mazzetti, Mark. Perspective on the jewels From the C.I.A.'s chief historian. Washington - New York Times Blog. The New York Times. Retrieved 2 December 2010. Eventually he was fired when he accused several western prime ministers of aiding the Soviet Union, and the anti-war and civil rights movements of the 1960s and 1970s as having foreign funding.Buckley, William F., Jr. Spytime: the undoing of James Jesus Angleton: a novel. New York: Harcourt, 2000. ISBN 0-15-100513-3. ==References== * Engelberg, Stephen. 1987. James Angleton, Counterintelligence Figure, Dies. The New York Times, May 12, Late City Final Edition, Section D, Page 31, Column 1. * Hersh, Seymour. The Angleton Story\". The New York Times Magazine, June 25, 1978, p. SM4. * Holzman, Michael. 2008. James Jesus Angleton, the CIA and the Craft of Counterintelligence, University of Massachusetts Press. ==Other websites== * Frontline—\"The Spy Hunter\" May 14, 1991 by Tom Mangold for the PBS program * Category:1917 births Category:1987 deaths Category:American autobiographers Category:Anti-communists Category:Harvard University alumni Category:People from Boise, Idaho Category:Politicians from Idaho Category:Yale University alumni",
 "title": "James Jesus Angleton"
}