{
 "id": "394131",
 "text": "Sub-Roman Britain is the name given to Britain after the Roman legions left. It usually means the time between 410 AD and the beginning of the seventh century. == History == After four centuries of controlling Britain, the Romans left Roman Britain at the beginning of the fifth century. However Roman culture and probably a kind of Latin language survived for another two centuries with the Anglo-Saxons slowly settling from northern Germany and the Jutland peninsula. Initially, Subroman Britain successfully fought the invasion, thanks to a mythical king called King Arthur. Probably he was Ambrosius Aurelianus, a powerful Romano-British leader around mid-5th century. He was renowned for his campaigns against the Saxons, and there is some speculation that he (or his son, according to the historian Gildas) may have commanded the Romano-British forces at the Battle of Badon Hill, where the barbarians were defeated around 500 AD. The Anglo-Saxons obtained control of eastern England at the end of the 5th century. In the mid-6th century they started expanding again into the English Midlands. Then in the 7th century they expanded again into the south-west and the north of England. The unconquered parts of southern Britain, notably Wales and surrounding areas of western Britain, retained their Romano-British culture, in particular Christianity. The Anglo-Saxons gained control of eastern England at the end of the 5th century. In the mid-6th century they started moving again into the English Midlands. Then in the 7th century they moved again into the south-west and the north of England. The parts of southern Britain they hadn't invaded yet, notably Wales and surrounding areas of western Britain, kept their Romano-British culture, in particular Christianity. Some Anglo-Saxon histories (in context) call the Romano-British people \"Welsh\", which is an Old English word meaning 'foreigner'. Historically, Wales and the south-western peninsula were known respectively as North Wales and West Wales. Recent discoveries have helped document the continuing urban occupation of some Romano-British towns near Watling Street such as Viriconium (Wroxeter) and Venta (Caerwent), in those two centuries.Roger White and Philip Barker, Wroxeter: Life and Death of a Roman City, (Stroud: Tempus, 1998) One of the last Sub-Roman cities to be conquered by the Anglo-Saxons was Deva Victrix (Chester), where Roman \"amphoras\" were used until 616 AD.P. Carrington, Eng. Heritage Bk. of Chester, 53; cf. S. Ward and others, Excavations at Chester: Saxon Occupation within Roman Fortress, 32-5; V.C.H. Ches. i. 238. The Romano-British may have survived partly because of the Chester city walls; the city had been defended by walls since the Deva Victrix fort was built on the site in 79 AD. However, there were romanized Britons -retaining their \"insular latin\"- until the late seventh century, as demonstrated by archaeological discoveries in Tintagel and other localities.Romanized Tintagel lasted until 670 AD, at least ==Notes== ==Bibliography== * Mann, J. C. Spoken Latin in Britain as evidenced by the Inscriptions, in Britannia 2 (1971) * Morris, John. The Age of Arthur: A History of the British Isles from 350 to 650. Barnes & Noble Books, New York, 1996. * Pearsall, Derek. Arthurian Romance: a short introduction. Blackwell. Oxford, 2005 * Smith, C. Vulgar Latin in Roman Britain: Epigraphic and other Evidence, in Aufstieg und Niedergang der Römischen Welt 2.29.2 (1983), pp. 893 – 948 * Snyder, Christopher A. Sub-Roman Britain (AD 400-600): A Gazetteer of Sites. British Archaeological Reports (BAR) British Series No. 247. Oxford, 1996: Tempvs Reparatvm. ==Related pages== * Roman Empire * History of the United Kingdom * Roman Britain * Roman Wales * Chester city walls * King Arthur Category:History of the British Isles Category:Roman Empire",
 "title": "Sub-Roman Britain"
}