{
 "id": "394231",
 "text": "Ambrosius Aurelianus was a powerful Romano-British leader in Sub-Roman Britain around mid-5th century. He has been identified with the legendary King Arthur by historians like John Morris.Chapter nine: Ambrosius Aurelianus ==Life== Ambrosius Aurelianus was born in Roman Britain in the years when Roman legions withdrew from the British isles and started the Anglo-Saxon conquest. He seems to be born in a noble Roman family, resident in Britain for many generations. He also appeared independently in the legends of the Britons, beginning with the 9th-century \"Historia Brittonum\", written by Nennius. His importance comes from the fact that he is the only Romano-british leader named by Gildas, who was the only historian who lived during Sub-Roman Britain times: this fact makes Ambrosius Aurelianus an historical and \"real\" personality in the King Arthur legends. He was renowned for his campaigns against the Anglo-Saxons, and there is some speculation that he (or his son, according to the historian Gildas) may have commanded the Romano-British forces at the Battle of Badon Hill, where the barbarians were won around 500 AD. After this battle for fifty years the Anglo-Saxons were stopped from conquering all of Britain. ==According to Gildas== Ambrosius Aurelianus is one of the few people that Gildas (a sixth century historian who lived in South-west Britain and wrote \"De Excidio Britanniae\", which focused largely on the history of Christian Britain) identifies by name in his sermon De Excidio et Conquestu Britanniae, and the only one named from the 5th century. Following the destructive assault of the Saxons, the survivors gather together under the leadership of Ambrosius, who is described as: :\"... a gentleman who, perhaps alone of the Romans, had survived the shock of this notable storm. Certainly his parents, who had worn the purple, were slain by it. His descendants in our day have become greatly inferior to their grandfather's [avita] excellence.\" We know from Gildas that he was of high birth, and had Roman ancestry; he was presumably a Romano-Briton, rather than a Roman from elsewhere in the empire, though it is impossible to be sure. It also appears that Ambrosius was a Christian: Gildas says that he won his battles \"with God's help\". According to Gildas, Ambrosius organised the survivors into an armed force and achieved the first military victory over the Saxon invaders. However, this victory was not decisive: \"Sometimes the Saxons and sometimes the citizens (meaning the Romano-British inhabitants) were victorious.\" ==Related pages== * King Arthur * Sub-Roman Britain ==Notes== ==Bibliography== * Gidlow, Christopher. The Reign of Arthur: From History to Legend. Sutton Publishing. London, 2004 . * Higham, N. J. King Arthur, Myth-Making and History Routledge. London, 2002 * Morris, John. The Age of Arthur: A History of the British Isles from 350 to 650. Scribner Ed. New York, 1973 * Reno, Frank. Historic King Arthur: Authenticating the Celtic Hero of Post-Roman Britain. Publisher McFarland. London, 2007 Category:Roman people Category:History of the British Isles Category:5th-century births Category:Year of death unknown",
 "title": "Ambrosius Aurelianus"
}