{
 "id": "39429",
 "text": "The Jews or Jewish people are an ethnoreligious group whose ethnoreligion is Judaism. * * * * * A Jew is someone who is of Jewish heritage or who has converted to the Jewish religion. Jewish people typically consider themselves not only as adherents of a religion, therefore a Jew is not only one that practices the religion of Judaism, but it is also one who is of Jewish ethnic heritage. Jews originated as an ethnoreligious group in the Middle East. ==Overview== According to traditional Jewish law, called Halakha, someone is Jewish if their mother was a Jew or if they have converted to Judaism. Judaism has been described as a religion, a race, an ethnic group, a culture, a nation, and an extended family. ==Demographics== Israel is the only modern country with a Jewish majority, but there are Jewish minorities in many places in the world. Most of them live in large cities in the United States, Argentina, Europe and Australia. Both Israel and the U.S. have over five million Jews., based on In the Soviet Union there were more than two million Jews, but many of them moved to Israel, the U.S. and other Western countries since the collapse of the Soviet Union. Jews have been victims of various persecutions. The most well known happened during the Second World War, when at least 6,000,000 Jews were killed by the Nazis. The event is known as the Holocaust. ==Jewish ethnic groups== All ethnic (non-convert) Jews have genetic heritage from the Levant (the region now known as Israel and/or Palestine). Within all of the world's Jews, there are Jewish ethnic groups. The two biggest are called Ashkenazi (who have historically lived in Central and Eastern Europe) and Sephardic (who have historically lived in lands around the Mediterranean Sea, particularly Spain and Portugal). Jews from the Middle East, the Caucasus, and Central Asia are called Mizrahi Jews. There are also Ethiopian Jews, Indian Jews (Bene Israel) and Chinese Jews (Kaifeng Jews). Many of these groups have moved from one place to another. For example, many Ashkenazi Jews live in the United States, and many Sephardic and Mizrahi Jews live in France. Jews speak the languages of the countries where they live. Hebrew is the language of Judaism because it is the language in which the Bible was written. It is still used for prayers. In Israel, Ivrit, which is the name for the new Hebrew language, is the common language. There are also other Jewish languages such as Yiddish and Ladino which are still spoken and written by some Jews. ==History== ===Origin=== Judaism began with a man named Abram who lived in the city of Ur in modern-day Iraq. As per the Midrash, Abram strongly believed that the people in Ur were wrong to pray to different gods and statues. He believed that there was really only one god who was not a statue. The Torah tells that God spoke to Abram and told him to leave Ur with his family and move to Canaan, where he started a new religion. God told him that his name would be changed to Abraham. The Midrash also says that angels taught Abraham a new holy language, which Jews believe is the language today known as Hebrew. Hebrew continues to be the language of Judaism. Abraham's grandson Jacob is said to be the one who first had the name of \"Israel\". * * * * * * * * * * The Bible says that the people of Israel were slaves in Egypt. God helped Moses to set them free. After this, Moses met God on Mount Sinai and received the Torah from God. ===Bronze age=== The Hebrews, or Israelites, began a country called Israel in Canaan. They fought many wars against other peoples in the area. One of them were the Philistines. After the death of King Solomon who was the son of King David, the Israelite kingdom split into two: ten tribes in a new kingdom of Israel and the other two tribes in a new Kingdom of Judah. Judah continued the monarchy of the old Israel. The 2 tribes that made Judah were Judah and Benjamin. The name Jew comes from the name of one of these tribes, Judah. A country called Assyria later conquered the Northern Kingdom, and most of the 10 tribes would be deported and exiled, and to this day it is not known where they are. Some stayed and mixed with foreigners and became the Samaritans. Others fled to Judah where they adopted the everyday life of those who lived in Judah. Judah was subsequently conquered by Babylonia and its people were taken captive to Babylon. This is called the Babylonian exile, because they were exiled (taken away) from Judah. They were allowed to go back to Judah again when Babylon was conquered by the Persian Empire. The Israelites that were in the exile then became known as Jews because their religion and culture went through some changes that were suited to Judahites. Some Jewish people stayed in Babylon (now Iraq) and others also lived in other countries. ===Classical antiquity=== By 50 BC, Judah (then called Judea) was ruled by the Roman Empire. During this time, the main language of Judea was Aramaic. The Jews did not like the Roman government or customs, and often made trouble for the Romans. In 70 AD, after a revolt against the government by the Jewish community, the Romans destroyed Judea's capital city, Jerusalem, and its temple, which was made when the Jews returned from Exile. In 135 AD, a man called Simon Bar Kokhba leads another revolt against the Romans. The Romans then decided the Jews were too much trouble. The Romans destroyed all of Judea and killed many Jews. They destroyed Jerusalem and renamed it to Aelia Capitolina. And they renamed Judea to Syria Palaestina in order to offend them. Palaestina means the land of Philistines. They were the enemy of the Israelites. They sent the remaining Jews into exile in the rest of the Empire. The Jews weren't allowed to return. The Jewish people lost their country. They became a small minority in almost every place they lived. This time is called the Diaspora, when Jews spread around the world. They lived in many other countries. Jews living in Spain and Portugal used the language Ladino (also called Judeo-Spanish). Jews living in Germany, Poland, Russia, and other countries in Central-Eastern Europe spoke the language Yiddish. Jews living in North Africa spoke Judeo-Arabic or Haketia, the local name for Ladino. Jews have lived in most, but not all, places in the world, including India, China, Yemen, and Ethiopia. Even today, Jews who do not live in Israel are often said to live \"in the Diaspora\". In some places, like India , Jews lived without any problems. In other places, like most of Europe and Islamic countries, there was bigotry or even hatred against Jews and they lived under discriminatory laws. Sometimes Jews suffered from outright persecution (that is: systematic hatred and violence), sometimes they were forced to dress in special, ugly clothes, pay higher taxes than others, not build higher houses than others, not to ride a horse or donkey, wear certain badges etc. A lot of Christians especially in Europe in the Middle Ages thought that Jews were responsible for the death of Jesus. The Christians persecuted the Jews en masse. The Roman Catholic Church also forbade Christians from lending money against interest, some Jews worked as bankers and money-lenders, and became known as skillful bankers. ===Middle Ages=== One nomad nation, the Khazars, converted to Judaism in the 8th century. The Khazar khanate, which was in the modern Ukraine and southern Russia, was the only independent Jewish state before modern day Israel. The Khazar state was destroyed by the Kevian Rus' in 987. The Jewish people have always believed that they have a special mission from God. They do things in their own ways, such as having special rules about food and eating, not working on Shabbat, keeping their own holidays, and not marrying people from other religions. Because of this, people in many different times and countries have thought that the Jews were strange, and maybe dangerous. Many countries made laws that the Jews could not work in some jobs or live in some places. Sometimes Jewish people were killed because of their religion. The word \"antisemitism\" means the hatred for Jews. ===20th century=== ====The Holocaust==== During the 1930s and 1940s, the Nazi, or National Socialist government of Germany conquered most of Europe. They did terrible things to the Jewish people. The Nazi government killed more than six million Jewish people. Before they were killed, often by means of a gas chamber, many of the Jews were made to be forced workers, and some of them were forced to help in the killing and capturing of the others. ====Cold War==== In 1948, after World War II, the United Nations made the country of Israel for the Jews in Palestine, which is in the same place as the original Israel, in the Middle East. The land had been part of the Ottoman Empire before World War I. Britain then controlled the area under the oversight of the United Nations. Many Jews moved back to Israel, then called Palestine, starting in the late 1800s. When the country of Israel was made in 1948, there were about 600,000 Jews in it. Today there are about 7,181,000 Jews in Israel. When Jews moved back to Palestine, there were some people living there now. Most of them did not want to live in a Jewish country. This was the beginning of the Israeli-Arab or Israeli-Palestinian conflict, which continues today. Jews have come to Israel from all over the world, bringing different languages, music, food, and history to create a unique culture. Israel is the only country in the world where most people are Jews and where Hebrew is the main language. ===Today=== Jewish history continues today in both Israel and the Diaspora. Outside of Israel, there are many Jews in the United States, Great Britain, Canada, France, Russia, Ukraine, Germany, Argentina, Brazil, South Africa, and Australia. There are smaller numbers of Jews living in other parts of the world. Some of the major problems faced by the Jewish people today include resolving the Israeli- Palestinian conflict and dealing with high rates of assimilation (loss of Jewish identity) in some countries, like the United States. == Famous Jews == Many Jewish people have done great things in science, literature, business, and the arts. Some of the most famous include: * David Ben-Gurion, Israeli politician * Mel Brooks, movie director * Noam Chomsky, American linguist and writer * Aaron Copland, composer * Bob Dylan, American singer * Albert Einstein, scientist * Anne Frank, writer * Sigmund Freud, father of psychoanalysis * George Gershwin, composer * Emma Goldman, anarchist * Theodor Herzl, founder of modern Zionism * Jesus, central figure of Christianity * Franz Kafka, writer * Henry Kissinger, former American Secretary of State * Emma Lazarus, author * Rosa Luxemburg, politician * Moses Maimonides, Jewish philosopher * Marx Brothers, comedians * Golda Meir, Israeli politician * Benjamin Netanyahu, Israeli politician * Shimon Peres, Israeli politician * Yitzhak Rabin, Israeli politician * Natalie Portman, actress * Philip Roth, American writer * Mark Rothko, American painter * Bernie Sanders, United States senator * Steven Spielberg, movie director * Baruch Spinoza, philosopher * Mark Spitz, swimmer *Three Stooges,comedians * Barbra Streisand, singer and actress == References ==",
 "title": "Jew"
}