{
 "id": "394824",
 "text": "Abdominal compartment syndrome occurs when the abdominal cavity (compartment) within the body becomes subject to increased pressure from within. This may be caused by internal bleeding, a blockage or fluid build-up in the intestines, or 'ascites': Fluid accumulated in the peritoneal cavity - the space between the lining of the abdomen (peritoneum) and the abdominal organs (the stomach, small and large intestines, pancreas, liver, and gallbladder). This increased pressure causes the abdomen to distend or expand, stretching the skin and placing pressure on the abdominal organs, which can constrict the blood vessels which supply them. When the pressure reaches a level above that of the blood supply to the tissues and organs of the abdomen, ischemia will happen leading to organ dysfunction and eventually failure.Pearson EG, Rollins MD, Vogler SA et al. Decompressive laparotomy for abdominal compartment syndrome in children: before it is too late. J Pediatr Surg. 2010 Jun;45(6):1324-9. doi: 10.1016/j.jpedsurg.2010.02.107. PMID 20620339 An operation called a decompressive laparotomy may need to be performed, where an incision is made to open the abdominal cavity. The incision is typically left open for a period of time to reduce the pressure in the abdomen.Claudio Ronco, Rinaldo Bellomo, John Kellum:Critical Care Nephrology. Saunders; 2nd edition (2009) Abdominal compartment syndrome can be divided into three categories: *Primary or acute abdominal compartment syndrome occurs when injuries within the abdomen are responsible for the compartment syndrome *Secondary abdominal compartment syndrome occurs when there are no visible injury within the abdomen but injuries outside the abdomen cause fluid build-up inside the abdominal cavity *Chronic abdominal compartment syndrome occurs happens in association with diseases such as cirrhosis of the liver. ==References== == External links == * openabdomen.org * wsacs.org Category:Syndromes affecting the gastrointestinal tract Category:Syndromes",
 "title": "Abdominal compartment syndrome"
}