{
 "id": "395089",
 "text": "Pratapgarh () is a district of Uttar Pradesh (U.P.), India. It is the administrative headquarters of Pratapgarh district, part of the Prayagraj division. It came into existence in 1858 CE. This district is situated on 25째 34' and 26째 11' north latitude) and 81째 19' and 82째 27' east longitude. This district is situated enroute to the Prayagraj - Ayodhya highway (NH -96), 61 km from Prayagraj and 39 km from Sultanpur. The height of this district is about 137 meters above sea level. It is spread over 110 kilometers from east to west. River Ganga flows from south-west and it separates the district from Prayagraj and Kaushambi (Fatehpur). Ganga, Sai, Bakulahi are the main rivers here. Loni and Sarkani rivers flow in the district. The Gomti river flows from the north-eastern part of this district. It is believed that Lord Rama visited the area and worshipped at the place where Bela Bhawani Temple is located. The Bhayaharan Nath Dham finds mention in the Mahabharata. Legend has it that Bhim (one of the Pandava brothers) killed the demon Bakasur and installed the Shivaling in the temple. The Sai River flowing through the district is considered holy by the Hindu devotees and several pilgrims converge here for a holy dip. Apart from the Hindus, Pratapgarh also attracts the Buddhists who come here to visit the Kot Monastery. Ajit Pratap Singh made his headquarters at Rampur near Aror. During his reign, he built a fort (garh) and named it Pratapgarh after himself. Famous tourist places include: # BELA DEVI Temple # Shani Dev Temple # BHAKTI DHAM Mangarh (Kunda) # Ghusmeshwar Nath Dham # Baba Bhayaharan Nath Dham # Yaksh Prashn Sthal (Ajgara) # Mahdaha & Sarai Nahar Rai #ghuisarnath dham (sangipur) Bhakti dham mangarh situated near kunda, a well known and prominent tourist place is well connected by Lucknow-prayagraj national highway. Ghuisarnath is situated in sangipur connected by Raebareli -pratapgarh national highway. The most prominent leaders of pratapgarh who are raghuraj pratap singh(Raja bhaiya),former jail minister of Uttar pradesh,member of legislative assembly from kunda legislative assembly,Pramod tiwari,former foreign affair minister during congress government regime,sangam lal gupta,moti singh,Kumari ratna singh etc. Also paternal residence of Shri Amitabh Bachchan is situated near Patti. Legislative assembly in pratapgarh are kunda,babaganj,rampur khas, pratapgarh Sadar,raniganj,Patti, gadwara (formerly know as vishwanathganj) Lok sabha constituencies under this district are kaushambi constituency and pratapgarh constituency. Ganga expressway Category:Districts of Uttar Pradesh",
 "title": "Pratapgarh district, Uttar Pradesh"
}