{
 "id": "395130",
 "text": "Samuel Marshall \"Sam\" Raimi (born October 23, 1959) is an American movie director, producer, writer, and actor. He directed the Spider-Man movie trilogy (2002–2007). He also directed Oz the Great and Powerful, in addition to the Evil Dead franchise. Raimi's films are known for their dynamic visual style, influenced by comics and slapstick comedy. Raimi was born on October 23, 1959 in Royal Oak, Michigan to a Hungarian-Russian Jewish family. He was raised in Birmingham, Michigan. He studied at Groves High School and at Michigan State University. Raimi founded the production company Renaissance Pictures in 1979, and Ghost House Pictures in 2002. His latest film, the Marvel Cinematic Universe film Doctor Strange in the Multiverse of Madness, was released on May 6, 2022. It was Raimi's highest-grossing film. == Early life == Raimi was born in Royal Oak, Michigan. His family is Conservative Jewish. He is a son of merchants Celia Barbara (née Abrams) and Leonard Ronald Raimi. His ancestors were Jewish immigrants from Russia and Hungary. His younger brother Ted is an actor. His older brother Ivan is a screenwriter and physician. His older sister, Andrea Raimi Rubin, is a court reporter. Another older brother, Sander, died at 15 in an accidental drowning; Raimi has said that the trauma brought the remaining family closer together and \"colored everything he's done for the rest of his life.\" Raimi also mentioned that Sander first introduced him to Spider-Man, starting his love for comics. Raimi graduated from Groves High School. He attended Michigan State University, where he studied English but left after three semesters to film The Evil Dead. ==References== ==Other websites== * Category:1959 births Category:Living people Category:Actors from Michigan Category:Movie directors from Michigan Category:Movie producers from Michigan Category:Saturn Award winners Category:Screenwriters from Michigan Category:People from Royal Oak, Michigan Category:American movie actors Category:American Jews Category:American voice actors Category:Republicans (United States)",
 "title": "Sam Raimi"
}