{
 "id": "395256",
 "text": "Reuben was the son of Jacob and Leah in the Book of Genesis. ==Birth== Jacob was in love with Rachel, the daughter of Laban and asked to marry her. Laban said he would let Jacob marry her if he worked for him as a shepherd for seven years. Jacob worked for those years but they felt like they were only seven days because of how much he loved Rachel. But then, Laban tricked Jacob into marrying Rachel’s older sister Leah instead of marrying her and said he didn’t believe in the younger daughter marrying before her older sister married so Jacob had to work for Laban for another seven years so that Laban would let him marry Rachel. Jacob loved Rachel but he did not love Leah so Leah prayed to the Lord saying “give me children, for I am despised”. So the Lord had mercy on her and she became pregnant and gave birth to a son. And Leah said “now my husband shall love me” and named her son Reuben. ==Mandrakes== After Leah gave birth to Simeon, Levi and Judah (Biblical personage), Bilhah gave birth to Gad and Asher, Zilpah gave birth to Dan and Naphtali and Leah gave birth to Zebulun and Issachar, then Reuben found mandrakes and gave them to his mother Leah. When Rachel asked Leah for the mandrakes,Leah said “first you take from me my husband and now the mandrakes of my son” and agreed to give Rachel the mandrakes if Leah became Jacob’s main wife. ==Bilhah== It’s written in the Torah that Reuben lay down with Bilhah and that his father Jacob heard about it. (Genesis 35:22) Though the Talmud says that this was a metaphor and that Reuben actually took Bilhah’s bed from his father’s tent but that this was seen as being like the sin of incest (Shabbat 55) and says that this works because in the Book of Job wanting to commit incest is seen as committing incest. ==The story of Joseph== In the story of Joseph, when the brothers are about to kill Joseph, Reuben tells them that instead of murdering him they should throw him into a big hole in the ground and leave him to die. But Reuben secretly planned to rescue Joseph and so when Reuben came back to save Joseph and found out that he had already been sold into slavery, Reuben tore his clothes in mourning for Joseph. And after Simeon was jailed, Reuben told his brothers that the Lord was punishing them all for what they did to Joseph. ==Inheritance== According to Jewish tradition, Reuben didn’t get the inheritance that a firstborn son would usually get because he was being punished for the sin with Bilhah. ==Talmud== Rabbi Shimon son of Eliezer teaches that after Leah died and Jacob moved his bed to the tent of Bilhah, Reuben took the bed from Bilhah’s tent and put in the tent of his mother Leah to honour his mother’s memory and the sin Reuben committed by doing that was compared to incest but Reuben did not actually have sex with Bilhah. Though there are also Rabbis in the Talmud who say that he did. ==The Zohar== According to the Zohar, Reuben lying down with Bilhah cannot be wikt:literally true because then Reuben wouldn’t have become the father of a tribe of the Israelites. It says that Reuben knew from prophecy that there were supposed to be only twelve tribes of Israel so he moved his father’s bed from Bilhah’s tent even though the Shechina is there whenever married people do their religious duty to have sex with each other but by meddling Reuben made the Shechina leave that tent and that was Reuben’s sin. Category:Old Testament people",
 "title": "Reuben"
}