{
 "id": "39550",
 "text": "Condoleezza Rice ( ; born November 14, 1954) is an American diplomat and political scientist who served as the 66th U.S. secretary of state under George W. Bush from 2005 to 2009. A member of the Republican Party, she was also the U.S. national security advisor from 2001 to 2005. Rice is the first African-American woman U.S. secretary of state and U.S. national security advisor in U.S. history. Rice was born in Birmingham, Alabama as the only child to John W. Rice. She grew up in the Southern United States where it was racially segregated. She got a bachelor's degree in political science from the University of Denver and her master's degree from the University of Notre Dame. In 1981, Rice got a Doctor of Philosophy from the School of International Studies at the University of Denver. She worked at the U.S. Department of State under President Jimmy Carter. She served on the National Security Council to President George H. W. Bush from 1989 to 1991. In 2001, Rice became the U.S. national security advisor under President George W. Bush. In 2005, she became the U.S. secretary of State. Since 2020, she has been the 8th director of the Hoover Institution at Stanford University. == Biography == === Early life and education === Condoleezza Rice was born on November 14, 1954, in Birmingham, Alabama, to John Wesley Rice Jr. and Angelena Ray. Her father, a Presbyterian minister and counselor, was an academic who taught at Tuskegee Institute and later at the University of Denver. Her mother, a schoolteacher and an educator, strongly emphasized the importance of education and the power of learning. The family lived in Birmingham until 1967, when they moved to Denver, Colorado, for her father’s new job at the University of Denver. Rice attended St. Mary’s Academy, a private school in Denver, where she was one of only a few African American students. By the time she was in high school, she began to develop an interest in political science, international relations, and history. Rice attended Denver’s high school, the Denver East High School, where she nurtured her interests in classical music, piano, with the goal of pursuing a career as a concert pianist. In 1970, she attended the University of Denver at 16, where majored in political science and minored in music. Rice spoke about her decision to attend the University as she was influenced by her father’s academic ties there. She later graduated with a bachelor’s degree in political science in 1974. After completing her undergraduate degree, she first attended the University of Notre Dame in Indiana, where she earned a master’s degree in political science in 1975. Rice said she was influenced by Josef Korbel, the father of Madeleine Albright, who was a professor at the University of Denver. Korbel, a prominent expert on European history and international relations. == Early career == In 1977, Rice worked in the U.S. Department of State in 1977, during the Carter administration as an intern in the Bureau of Educational and Cultural Affairs. She also studied Russian at Moscow State University in the summer of 1979, and interned with the RAND Corporation in Santa Monica, California. From 1980 to 1981, she was a fellow at Stanford University's Arms Control and Disarmament Program, having won a Ford Foundation Dual Expertise Fellowship in Soviet Studies and International Security. Rice was one of only four women along with Janne E. Nolan, Cindy Roberts, and Gloria Duffy, whom were studying international security at Stanford on fellowships at the time. From February 1989 through March 1991, Rice served on President George H. W. Bush’s National Security Council staff. She served as Director, then Senior Director of Soviet and East European Affairs, as well as Special Assistant to the President for National Security. In 1986, while an International Affairs Fellow of the Council on Foreign Relations, Rice also served as Special Assistant to the Director of the Joint Chiefs of Staff. === Early political views === Rice was initially a Democrat has and expressed she was critical of the foreign policy stance of President Jimmy Carter's administration. She disagreed with Carter's approach to handling the Soviet Union and the Cold War tensions. Rice felt that the U.S. needed a stronger, assertive stance against Soviet expansionism, while taking firmer action to countering communist influence globally. In 1982, she left the Democratic Party and registered as a Republican. == Academic career == Rice’s academic career began after she completed her graduate studies with a Ph.D. in political science from the University of Denver. Rice’s dissertation, called The Soviet Union and the Use of Force in the Developing World, focused on Soviet military policy, regarding its interventions in developing countries during the Cold War. In 1981, she accepted a faculty position at Stanford University in California and joined Stanford’s Department of Political Science, a department known for its focus on international relations, political theory, and security studies. As a professor, Rice taught courses in political science, including classes on international relations, U.S. foreign policy, and the Cold War. === Provost === In 1993, Rice was appointed as provost of Stanford University, and made history becoming the first woman and the first African American to hold this position. As Provost, Rice was the chief academic officer of Stanford University, with the primary responsibility for overseeing the university’s academic operations and budget. In this role, she worked closely with the president of the university, Gerhard Casper, and other senior administrators to ensure the smooth functioning of the university’s academic affairs. She had a wide range of responsibilities, including overseeing the university’s 15 schools and departments, managing faculty appointments and promotions, and overseeing resources for research programs, graduate education, and undergraduate instruction. Rice also played a key role in representing Stanford’s academic interests to external stakeholders, including donors, the media, and government agencies. == Private sector == Rice joined the Chevron Board of Directors in 2011. At Chevron, she used her experience in foreign policy and global security to advise on issues such as energy security, international regulations, and the company’s operations in politically sensitive regions of the world. Rice served on Chevron’s Nominating and Governance Committee and helped guide the company through critical decisions regarding governance and international operations. In addition to her role at Chevron, Rice has served on the boards of several other prominent organizations, contributing her leadership and strategic insights. She has held positions as a member of the board of directors for major corporations, including Mickelson & Co., Transamerica, and McKinsey & Company. Rice worked closely with senior executives, helping to shape the vision and direction of each organization, while also offering advice on crisis management, particularly in regions that were subject to political volatility. === Rice Hadid Global === In addition to her board memberships, Rice co-founded Rice Hadid Global, a consulting firm, alongside prominent business partners. The firm provides consulting services to organizations and governments, particularly on issues related to global risk management, international relations, and leadership. == U.S. National Security Advisor (2001–2005) == In 2001, Rice became the 19th U.S. national security advisor to President George W. Bush. She made history become the first woman and first African-American to hold the position. As NSA, she was responsible for advising the president on matters of national security and foreign policy, coordinating the activities of the National Security Council (NSC), and ensuring that the president's decisions regarding defense, intelligence, and foreign affairs were imposed across government agencies. === The 9/11 Attacks === When al-Qaeda terrorists carried out coordinated attacks on the World Trade Center in New York City and the Pentagon in Washington, D.C. on September 11, 2001, Rice worked closely with President Bush and other senior advisors to form a tangiable national security strategy in response to the terrorist attack on U.S. soil. In the months after the attacks, Rice was involved in establishing the Department of Homeland Security (DHS) in 2002, a landmark decision that reshaped U.S. domestic security policy and aimed to better coordinate efforts to prevent future attacks. === War on Terror and the Invasion of Afghanistan === Rice's influence over U.S. foreign policy was crucial in the Bush administration’s launch of the War on Terror. Following the 9/11 attacks, the Bush administration quickly turned its attention to Afghanistan, where the Taliban government had been harboring al-Qaeda. Rice worked with Secretary of Defense Donald Rumsfeld, CIA Director George Tenet, and other senior officials to lay the groundwork for Operation Enduring Freedom, the U.S.-led military intervention aimed at dismantling al-Qaeda’s base of operations and overthrowing the Taliban regime. She played a central role in coordinating with allied countries to secure international support for the military operation, particularly NATO allies and regional partners such as Pakistan. Rice also worked to ensure that the U.S. government was united in its efforts, even though the country focused on addressing domestic security concerns in the wake of 9/11. === The Iraq War === In 2003, Rice was her involvement in the decision to invade Iraq. The Bush administration's push for military action in Iraq was based on the belief that Iraqi leader Saddam Hussein possessed weapons of mass destruction and could potentially use them against the United States or provide them to terrorist groups such as al-Qaeda. This belief became a central justification for the U.S. invasion of Iraq, despite the lack of evidence that Hussein had an active WMD program. She helped coordinate the administration’s strategy for presenting WMD program as a significant threat to U.S. national security. In public speeches and testimony, she emphasized the potential dangers of Saddam Hussein’s regime and argued that Iraq was a key part of the broader War on Terror. However, as the Iraq war unfolded, the absence of WMDs became a major political fallout for the Bush administration. Rice’s role in the lead-up to the invasion was heavily criticized and despite the criticism, Rice defended of the decision that removing Saddam Hussein was necessary to combat fight against terrorism and the promotion of democracy in the Middle East. === Global Diplomacy === Rice was also deeply involved in managing U.S. relationships with key international partners, including European allies, Russia, and the Middle East. She was involved in brokering agreements with NATO and other international organizations to ensure that the War on Terror was seen as a cooperative global effort. Her diplomatic efforts helped strengthen alliances, although they were also at times strained by disagreements over specific aspects of U.S. policy, particularly in Iraq. == U.S. Secretary of State (2005–2009) == In 2005, Rice became the 66th U.S. secretary of State, and made history became the first African-American woman to hold this position. As secretary of State, Rice and the Bush administration was deeply focused on two major international issues: the War on Terror, following the U.S.-led invasion of Iraq in 2003, and the hope democracy in the Middle East. These two issues were central to Rice’s diplomatic agenda, which she carried out with a clear commitment to promoting democratic values and securing international cooperation in confronting global threats. === Transformational Diplomacy === As secretary of state, Rice introduced her initiative \"Transformational Diplomacy\", which was a new approach to foreign policy. Her goal was to use U.S. diplomacy not just to maintain peace and stability, but to actively promote democracy, human rights, and economic development in countries around the world, especially in the Middle East. Some of the key ideas of the initiative included: • Helping countries that were under authoritarian rule transition to democratic systems. • Encouraging democratic reforms in the Middle East. She hoped that by supporting political reforms, terrorism and extremism could be reduced. • Building strong relationships with countries open to reform to strive for change. • Building ties with India and China to make diplomacy more inclusive. • Focusing on development to support economic growth, education, and improving living conditions in countries in diplomatic efforts. • Supporting The Freedom Agenda to supporting peaceful transitions to democracy, protecting human rights, and building civil society. === Israel- Palestinian Conflict === Rice played a significant role in U.S. policy toward the Israeli-Palestinian conflict, which was a central issue in the Middle East during her tenure. She supported President Bush's vision for a two-state solution, which aimed at creating an independent Palestinian state alongside Israel. Rice was involved in multiple rounds of peace negotiations, including efforts to revive the peace process and address the political and humanitarian crises in Gaza and the West Bank. She worked closely with the leaders of Israel, the Palestinian Authority, and other Middle Eastern countries to create peace talks. === Lebanon and Syria === In Lebanon, Rice supported efforts to help the country emerge from political and military turmoil, particularly following the assassination of former Prime Minister Rafik Hariri in 2005. She also advocated for U.S. policy that pressured Syria to withdraw its forces from Lebanon and end its long-standing political and military interference in the country. === Europe === Rice sought to rebuild transatlantic relations, particularly with European powers, after the divisions caused by the Iraq invasion. She worked to improve ties with European leaders, focusing on areas of common interest such as counterterrorism, economic cooperation, and regional security. Despite the tension caused by Iraq, Rice played a key role in reestablishing dialogue with countries such as France and Germany, who initially opposed to the invasion. === Russia and China === Rice’s approach to Russia involved a balancing act. While she worked to strengthen U.S.-Russia relations, especially in areas like counterterrorism and nonproliferation, she also confronted Russia on issues such as its policies in Chechnya, its opposition to NATO expansion, and its stance on arms control. Rice advocated for promoting human rights and democracy within Russia, even as the U.S. sought to engage with Russian President Vladimir Putin on strategic issues. With China, Rice focused on managing the complexities of a rising global power. While the U.S. sought to cooperate with China on issues such as trade, North Korea, and climate change, Rice also navigated tensions surrounding human rights concerns, Taiwan, and China’s growing military presence in the Asia-Pacific region. She emphasized the importance of a stable U.S.-China relationship and worked to ensure that diplomatic dialogue remained open, even amid tensions. === North Korea and Iran === Rice was deeply involved in managing the U.S. response to North Korea’s nuclear ambitions. She was a strong advocate for the Six-Party Talks, which involved the U.S., China, Japan, Russia, South Korea, and North Korea, in an effort to negotiate a peaceful resolution to the North Korean nuclear crisis. While progress was slow, Rice supported a diplomatic approach, seeking to limit North Korea’s ability to develop nuclear weapons while engaging China and other regional partners to put pressure on Pyongyang. Rice played a key role in the U.S. policy toward Iran. She supported diplomatic efforts to address the Iranian nuclear program, whil advocating for tougher sanctions against the regime for its nuclear activities and its sponsorship of terrorism in the Middle East. Rice’s tenure came with heightened tensions over Iran’s nuclear ambitions, and she worked alongside European allies to push Iran to comply with the International Atomic Energy Agency (IAEA) and the United Nations Security Council’s demands for transparency. == Post–Bush administration (2009–present) == After the Bush administration ended in 2009, Rice continued to be publicly active. In 2020, she became the 8th director of the Hoover Institution, a prominent conservative think tank at Stanford University that focuses on public policy research dedicated to preserving historical records, promoting individual liberty, advancing free-market principles, and developing solutions to the critical policy issues. As director, Rice’s vision for the Hoover Institution centered around addressing issues such as political polarization, global security, economic challenges, and technological change. She emphasized the importance of fostering a space for intellectual diversity and creating dialogue among scholars from different political and ideological backgrounds. Rice worked to ensure that the institution's output was relevant to modern policy debates, while maintaining Hoover’s commitment to traditional principles of individual liberty, limited government, and free markets. == Honorary degrees == Rice has received several honorary degrees from various American universities, including State Year School Degree Georgia 1991 Morehouse College Doctor of Laws (LL.D) 1994 University of Alabama Doctor of Humane Letters (DHL) 1995 University of Notre Dame Doctor of Laws (LL.D)Former Secretary of State Condoleezza Rice to speak at Notre Dame - website of Notre Dame NewsHonorary Degree Recipients, 1849-2024 - website commencement of the University of Notre Dame 2002 National Defense University Doctor of National Security AffairsList of Honorary Degree Recipients - website of the National Defense University 2003 Mississippi College School of Law Doctor of Laws (LL.D) 2004 University of Louisville Doctor of Public Service (DPS) 2004 Michigan State University Doctor of Humane Letters (DHL) 2006 Boston College Doctor of Laws (LL.D) 2008 Air University Doctor of Letters (D.Litt.) 2010 Johnson C. Smith University Doctor of Laws (LL.D) 2012 Southern Methodist University Doctor of Laws (LL.D) 2015 College of William and Mary Doctor of Public Service (DPS) 2018 Sewanee: The University of the South Doctor of Civil Law (DCL) 2021 Siena College Doctor of Humane Letters (DHL) == Honors == ; National * Ellis Island Medal of Honor ; Foreign * Knight's Cross of the Order of Polonia Restituta (Poland, 1998)M.P. 1998 nr 10 poz. 184 * Grand Officer of the Order of the Star of Romania (Romania, 2003)DECRET nr. 677 din 24 octombrie 2003 * Member 1st Class of the Order of the Balkan Mountains (Bulgaria, 2007)Remarks at Stara Planina Awards Ceremony - website of the United States Department of State * Grand Cross with Gold Badge of the Order of San Carlos (Colombia, 2009) * Grand Cordon of the Order of the Rising Sun (Japan, 2017)2017 Autumn Conferment of Decoration == Published works == * Rice, Condoleezza (1984). The Soviet Union and the Czechoslovak Army: Uncertain Allegiance. Princeton University Press. * Rice, Condoleezza & Dallin, Alexander (eds.) (1986). The Gorbachev Era. Stanford Alumni Association, trade paperback (1986), ; Garland Publishing, Incorporated, hardcover (1992), 376 pages, . * Rice, Condoleezza with Zelikow, Philip D. (1995). Germany Unified and Europe Transformed: A Study in Statecraft. Harvard University Press. (1995), 520 pp., . * Rice, Condoleezza, \"Campaign 2000: Promoting the National Interest\" in Foreign Affairs, 2000. * Rice, Condoleezza, with Kiron K. Skinner, Serhiy Kudelia, and Bruce Bueno de Mesquita (2007). The Strategy of Campaigning: Lessons from Ronald Reagan and Boris Yeltsin , paperback, 356 pp., . University of Michigan Press, Ann Arbor. * Rice, Condoleezza (2010), Extraordinary, Ordinary People: A Memoir of Family, Crown Archetype, * Rice, Condoleezza (2011), No Higher Honor: A Memoir of My Years in Washington. Crown Archetype, * Rice, Condoleezza (2017), Democracy: Stories from the Long Road to Freedom, Twelve, 496 pp., . * ==References== == Official websites == Category:1954 births Category:Living people Category:African-American politicians Category:Stanford University faculty Category:American political scientists Category:American Presbyterians Category:Politicians from Birmingham, Alabama Category:United States National Security Advisors Category:United States Secretaries of State Category:Educators from Birmingham, Alabama",
 "title": "Condoleezza Rice"
}