{
 "id": "39554",
 "text": "Paul Williams can be: * Paul Williams (songwriter) (born 1940), songwriter for the Carpenters and many other groups; also film and television actor * Paul Williams (saxophonist) (1915–2002), rhythm and blues saxophonist * Paul Williams (The Temptations) (1939–1973), one of the lead singers of the popular Motown act The Temptations * Paul Williams (stage name for Paul Humphries), mandolinist and harmony singer for bluegrass legend \"Jimmy Martin and the Sunny Mountain Boys\" * Paul Williams, birth name of soul musician Billy Paul * Paul Williams (British singer), vocalist and keyboardist for 1970s bands Tempest and IOU. * Paul Williams (Composer / Pianist) (born 1940), a Composer and Pianist in the UK * Paul Williams (Crawdaddy! creator) (born 1948), American author who created the music magazine Crawdaddy! * Paul Williams (writer), a British writer associated with Doctor Who * Paul L. Williams, former FBI consultant, journalist and author * Paul O. Williams (born 1935), American science-fiction author and poet * Paul Williams (Irish journalist), is an Irish journalist and non-fictioncrime writer * Paul Williams (footballer), English association football (soccer) player for Stoke City F.C. * Paul Williams (Australian rules footballer) (born 1973), Australian rules football player for the Sydney Swans * Paul Williams (boxer) (born 1981), American welterweight boxer * Paul Williams (architect) (1894–1980), prominent African American architect in Los Angeles, California * Paul Williams (director) (born 1943), American film and television director * Paul Williams (politician) (born 1922), former British Member of Parliament * Paul Williams (professor), professor at American University and director of the Public International Law & Policy Group * Paul Williams (British professor), professor of Indian and Tibetan Philosophy at the University of Bristol, UK. * Paul Williams (Y&R;), a fictional character on The Young and the Restless",
 "title": "Paul Williams"
}