{
 "id": "395878",
 "text": "Catharina-Amalia, Princess of Orange (given names: Catharina-Amalia Beatrix Carmen Victoria; born 7 December 2003) is the oldest child of King Willem- Alexander of the Netherlands, and Queen Máxima. On 30 April 2013, she became the heiress apparent to the Dutch throne when her father became king. ==Birth and baptism== Princess Catharina-Amalia was born on 7 December 2003 at HMC Bronovo in The Hague. On 12 June 2004, Catharina-Amalia was baptized by Reverend Carel ter Linden in the Grote, or St. Jacob's, Church in The Hague. == Childhood == Princess Catharina-Amalia was enrolled in Bloemcamp school in Wassenaar on 10 December 2007. Her birthdays are usually celebrated with a concert at Kloosterkerk, The Hague. The concerts are attended by ambassadors and members of the royal household and the Council of State of the Netherlands. On her seventh birthday, a Douglas C-47 Skytrain once owned by her great-grandfather Prince Bernhard of Lippe-Biesterfeld, was named after Catharina-Amalia by Peter Hartman. The princess herself did not go to the naming ceremony because of school obligations. On 28 January 2013, it was stated that Queen Beatrix would abdicate on 30 April. Because of this, Princess Catharina-Amalia, as the heiress apparent to her father, would take the title of Princess of Orange. She is the first person to have this title. After her father became king, she still lives in Wassenaar, but will eventually move with her family to Huis ten Bosch. Princess Catharina-Amalia has had a seat in the Advisory Division of the Council of State of the Netherlands since she turned 18-years-old (age of majority). ==Titles, styles and arms== ===Title=== * 7 December 2003 – 30 April 2013: Her Royal Highness Princess Catharina-Amalia of the Netherlands, Princess of Orange, Princess of Orange-Nassau * 30 April 2013 - present: Her Royal Highness The Princess of Orange, Princess of the Netherlands, Princess of Orange-Nassau Her official title in Dutch is Hare Koninklijke Hoogheid De Prinses van Oranje Queen Beatrix abdicated the Dutch throne on 30 April 2013. Upon the abdication, Princess Catharina-Amalia became the Princess of Orange as heiress apparent. ==Honours== ;Dutch orders and decorations As a daughter of one of the 2 Heads of the House, when she becomes 18 years old, she will become : * : Knight Grand Cross of the Order of the Netherlands Lion (7 December 2021) Orders for services to the Royal House - description at the website of the Dutch Royal House (Dutch language) : \"Princesses (daughters of the Heads of the House of Nassau) receive the order at majority age (18), as decided in 1984 by Queen Beatrix and Grand-Duke Jean\" * Netherlands: Knight of the Order of the Gold Lion of the House of Nassau (7 December 2021) ==References== ==Other websites== * Royal House of the Netherlands |- Category:2003 births Category:Living people Category:Dutch royalty Category:Princesses of Orange Category:Recipients of the Order of the Lion of the Netherlands Category:Knights Grand Cross of the Order of the Lion of the Netherlands Category:People from The Hague",
 "title": "Catharina-Amalia, Princess of Orange"
}