{
 "id": "395936",
 "text": "Grupo Televisa, S.A.B. () is a Mexican multimedia mass media company and the largest in Hispanic America and the Spanish-speaking world.Putting Pictures to Work - Snell & Wilcox and in the Spanish-speaking World. It is a major international entertainment business, with much of its programming airing in the United States on Univision, with which it has an exclusive contract. == Telenovelas == Televisa produces telenovelas since 1959. The most successful telenovelas was: *La usurpadora (1998): with Gabriela Spanic, Fernando Colunga, Libertad Lamarque, Chantal Andere, Marcelo Buquet and Juan Pablo Gamboa. *Destilando amor (2007): with Angélica Rivera, Eduardo Yañez, Chantal Andere, Martha Julia, Sergio Sendel and Ana Martin. *Mañana es para siempre (2008): with Lucero, Fernando Colunga, Silvia Navarro, Rogelio Guerra, Sergio Sendel and Dominika Paleta. *Amor bravío (2012): with Silvia Navarro, Cristian de la Fuente, Leticia Calderón, César Évora, René Strickler, Flavio Medina, Laura Carmine, José Elías Moreno, Alex Sirvent, Fernanda Castillo, María Sorté, Florencia de Saracho, Olivia Bucio and Lisset. *Cañaveral de pasiones (1996): with Azela Robinson, Juan Soler, Daniela Castro, Francisco Gattorno, Patricia Navidad, Roberto Ballesteros and Angélica Aragón. *Abismo de pasión (2012): with Sabine Moussier, David Zepeda, Angelique Boyer, Mark Tacher, Salvador Zerboni, Livia Brito and Blanca Guerra. *La sombra del pasado (2015): with Michelle Renaud, Pablo Lyle, Alexis Ayala, Thelma Madrigal, Alejandra Barros, Cinthia Klitbo, Susana González and Beatriz Merino. *El amor invencible (2023): with Angelique Boyer, Daniel Elbittar, Danilo Carrera, Leticia Calderón, Gabriela Platas, Guillermo Garcia Cantu. *El privilegio de amar (1999): with René Strickler, Adela Noriega, Helena Rojo, Andrés García, Enrique Rocha, Cynthia Klitbo, César Évora and María Sorte. *Para volver a amar (2011): with Zaide Silvia Gutiérrez, Rebecca Jones, René Strickler, Alejandra Barros, Alejandro Camacho, Nailea Norvind, Juan Carlos Barreto, África Zavala, Mark Tacher, Sophie Alexander and Agustin Arana. *Teresa (2010): with Angelique Boyer, Sebastián Rulli, Aaron Díaz, Ana Brenda Contreras, Cynthia Klitbo, Silvia Mariscal and Manuel Landeta. *Rubi (2004): with Barbara Mori, Sebastián Rulli, Eduardo Santamarina, Ana Martin and José Elías Moren. *Cuna de lobos (1986) with María Rubio, Diana Bracho, Alejandro Camacho, Gonzalo Vega and Rosa Ma. Bianchi. *Los ricos tambien Lloran (1978) with Veronica Castro, Rogelio Guerra, Rocío Banquells, Guillermo Capetillo and Edith González. *El camino secreto (1985) with Daniela Romo, Salvador Pineda, Claudio Brook, Carlos Ancira, Gabriela Rivero, Pedro Armendáriz, Arsenio Campos, Fernando Sáez, Patsty, Leticia Calderon and Pilar Pellicer. == Channels == * Las Estrellas * Foro TV * El Canal 5* * Nueve (Mexican TV network) === Other channels === * Tiin * Golden * Golden Edge * Golden Premier * Ritmoson Latino * Telehit * TLNovelas == Noticieros Televisa == * Noticieros Televisa is the news division of Grupo Televisa, which produces national and local news for Televisa's TV channels and local stations across Mexico. It is headed by Leopoldo Gómez, the Vice President of News for Televisa. == Logos == File:Logotipo de Televisa (1973-1980).png|1973–1980 File:Logotipo de Televisa Aureo.png|1980-1990 File:Logotipo de Televisa (1990-1998).png|1990-2001 File:Logotipo de Televisa (2000-2016).png|2001-2016 File:Logotipo de Televisa.svg|2016–2022 File:Logo de Grupo Televisa.svg|2022–Present == Other websites == * Televisa.com ==References== Category:Mass media in North America Category:Entertainment companies Category:Companies of Mexico",
 "title": "Televisa"
}