{
 "id": "39600",
 "text": "The 1030s was a decade that began on 1 January 1030, and ended on 31 December 1039. It is distinct from the decade known as the 104th decade which began on January 1, 1031 and ended on December 31, 1040. == Events == === Europe === * 1030 - On July 29, during the Battle of Stiklestad of Norway, Olav Haraldsson lost to the people he ruled and is killed in the fight. The people he lost to were called \"pagan\" because they were not Christian. Later on, Olav is made a saint and is called the patron saint of Norway and Rex perpetuum Norvegiae ('the eternal king of Norway', or 'King of Norway forever'). * 1030 - The city of Kaunas in Lithuania is founded. * 1030 - The city of Tartu in Estonia is founded. * 1030 - Thalwil, Switzerland, is talked about for the first time * 1030 - Henry I of France fights against his father Robert. * 1031 - Collapse of the Moorish Caliphate of Córdoba. * 1031 - Byzantine general George Maniaces captures Edessa. * 1031 - Henry I becomes King of France * 1031 - Bezprym seizes the throne of Poland from Mieszko II Lambert * 1034 - On April 11, Empress Zoe of Byzantium marries her chamberlain and elevates him to the throne of the Eastern Roman Empire as Michael IV. * 1034 - Free County becomes subject to the Holy Roman Empire. * 1035 - Harald I becomes King of England. * 1035 - Harthacanute becomes king of Denmark. * 1035 - Magnus I becomes king of Norway. * 1035 - William II (the future William I of England) becomes duke of Normandy. * 1035 - Construction on the cathedral of Saint Sabino begins in Bari. * 1035 - Koper is awarded town rights. * 1036 - Edward the Confessor's younger brother Alfred Aetheling is blinded and murdered in an apparent attempt to seize the throne of England from Harold I. * June 4, 1039 — Henry III becomes King of Germany. * 1039 - The Abbey of Bec is founded. * 1039 - Bretislav I of Bohemia invades Poland. === Asia === * 1030 - The Song Dynasty Chinese historian and scholar Ouyang Xiu earned his jinshi degree at the age of 22 by passing the highest level tests in the country. This was his third time to take the test. This degree let him work for the government as a scholar-official. * 1030 - Byzantine Emperor Romanus III attacks Syria. * 1030 - Masud begins to rule the Ghaznavid Empire after the death of his father Mahmud. * 1036 - Emperor Go-Suzaku ascends the throne of Japan. === Other === * 1036 - First appearance of the Flower Sermon in Buddhist literature == Births == * July 26, 1030 — Stanislaus of Szczepanów, Saint Stanislaw (died 1079) * 1030 - Baldwin VI, Count of Flanders (died 1070) * 1030 - Vsevolod I of Kiev (died 1093) * 1031 - Matilda of Flanders, Queen consort of the Kingdom of England * September 3, 1034 - Emperor Go-Sanjō of Japan (d. 1073) == Deaths == * April 30, 1030 — Mahmud of Ghazni * July 19, 1030 — Adalberon, bishop of Laon * July 29, 1030 — King Olaf II of Norway (born 995) * September 30, 1030 — William V, Duke of Aquitaine (born 969) * July 20, 1031 - King Robert II of France (b. 972) * September 2, 1031 - Saint Emeric of Hungary * July 1–July 3, 1035 — Robert I Duke of Normandy at Bythinian Nicaea while on pilgrimage * October 18, 1035 — Sancho III of Navarre * November 4, 1035 — Jaromír, duke of Bohemia * November 12, 1035 — Canute the Great, King of England, of Denmark, of Norway, some of Sweden, and the territories near the legendary Jomsviking stronghold Jomsburg. * c. February 5, 1036 - Alfred Aetheling, Anglo-Saxon prince * May 15, 1036 — Emperor Go-Ichijō of Japan (b. 1008) * June 12, 1036 — Tedald, Bishop of Arezzo * June 13, 1036 — Ali Az-Zahir, caliph * 1036 - Sweyn Knutsson, son of Canute the Great * March 10, 1039 — Eudes of Aquitaine, Duke of Gascony * June 4 - Conrad II (the Elder), Holy Roman Emperor * 1039 - Iago ab Idwal ap Meurig, Prince of Gwynedd * 1039 - Unsuri, Persian poet == References == Category:1030s",
 "title": "1030s"
}