{
 "id": "396268",
 "text": "The Ryūkyūan languages (Okinawan: 琉球口, Duuchuuguchi) are a group of Japonic languages spoken in the Ryūkyū Islands, the southernmost part of Japan. The languages are Amami, Kunigami, Okinawan, Miyako, Yaeyama and Yonaguni. Although Japan says the Ryukyuan languages are dialects of Japanese, most linguists see them as languages. This is because Japanese speakers would not be able to understand Ryukyuan without learning it. In the past, the Ryukyuan languages were spoken all over Ryukyu. Due to the languages being discriminated against, they have become endangered languages. Most Ryukyuans now speak Japanese. == History == When a group people called the Yayoi came to Japan, they brought over a language called Proto-Japonic. This language diverged into Japanese and Ryukyuan over time. == Sound Changes == Japanese and Ryukyuan have different sound changes. For example, Japanese “o” becomes Okinawan “u”. This is why the Japanese word “to” (and) is “tu” in Okinawan. It’s also common for Japanese “k” to become Okinawan “ch”. This causes “Okinawa” to become “Uchinaa”. In the Yonaguni language, Japanese “y” becomes “d”. Japanese “yama” (mountain) is “dama” in Yonaguni. == Language Usage == Most older Ryukyuans can speak a Ryukyuan language, while younger people speak Japanese. Ryukyuan languages are also spoken in Hawaii and South America as many Ryukyuans live there too. ==Further reading== *Sanseido (1997). 言語学大辞典セレクション：日本列島の言語 (Selection from the Encyclopædia of Linguistics: The Languages of the Japanese Archipelago). \"琉球列島の言語\" (The Languages of the Ryukyu Islands). *Ashworth, D. E. (1975). A generative study of the inflectional morphophonemics of the Shuri dialect of Ryukyuan. Thesis (Ph. D.)—Cornell University, 1973. *Heinrich, Patrick (2004): Language Planning and Language Ideology in the Ryūkyū Islands, in: Language Policy 3.2, (2004): 153 *Heinrich, Patrick, Shinsho Miyara, Michinori Shimoji, eds. 2014. Handbook of the Ryukyuan Languages. Berlin: de Gruyter. *Serafim, L. A. (1985). Shodon: the prehistory of a Northern Ryukyuan dialect of Japanese. [S.l: s.n. *Shimabukuro, Moriyo. 2007. The accentual history of the Japanese and Ryukyuan languages: a reconstruction. Languages of Asia series, v. 2. Folkestone, Kent: Global Oriental. *Uemura, Yukio, and Wayne P. Lawrence. 2003. The Ryukyuan language. Endangered Languages of the Pacific Rim (Series), A4-018. Osaka, Japan: ELPR. ==Other websites== * Ryukyuan language phonetic database == References == Category:Languages of Asia Category:Ryukyu Islands",
 "title": "Ryukyuan languages"
}