{
 "id": "396264",
 "text": "Felipe de Jesús Calderón Hinojosa (born August 18, 1962) is a Mexican politician. He was President of Mexico from 1 December 2006 to 30 November 2012. He is a member of the Partido Acción Nacional (PAN), one of the three major Mexican political parties. Calderón was born on August 18, 1962 in Morelia, Mexico. He studied at Free School of Law, at Autonomous Technological Institute of Mexico, and at Harvard University. Calderón has been married to Margarita Zavala since 1993. She ran for president in the 2018 election, but dropped out of the race. Calderón is Chairperson of Global Commission for the Economy and Climate which issued The New Climate Economy Report. == Personal background[edit] == Felipe Calderón was born in Morelia, Michoacán, Mexico on August 18, 1962. He is the youngest of five brothers and son of Carmen Hinojosa Calderón and the late Luis Calderón Vega. His father was a co-founder of the National Action Party and an important political figure. The elder Calderón occupied state posts and served a term as federal deputy. He spent most of his life working within the party and spent most of his free time promoting the PAN. The young Calderón was active in his father's campaigns. As a boy, he distributed party pamphlets and flyers, rode PAN campaign vehicles and chanted slogans at rallies. After growing up in Morelia, Calderón moved to Mexico City, where he received a bachelor's degree in law from the Escuela Libre de Derecho. Later, he received a master's degree in economics from the Instituto Tecnológico Autónomo de México (ITAM) and a Master of Public Administration degree in 2000 from the John F. Kennedy School of Government at Harvard University. Following his father's example, he joined the PAN, with the desire of one day becoming Mexico's president. It was in the National Action Party that Calderón met his wife, Margarita Zavala, who served in Congress as a federal deputy. They have three children, María, Luis Felipe and Juan Pablo. Calderón is Roman Catholic. === Political and social views === To demands for detailed revelation of his personal positions on abortion, Calderón responded that he voted for life. Calderón's administration sought to maintain moderate positions on social policy and supported Mexican legislation guaranteeing abortion for rape victims, when pregnancy endangers a woman's life or in cases of severe fetal deformity; has publicly advocated the legalization of small quantities of cocaine and other drugs for addicts who agree to undergo treatment; and has approved a right-to-die initiative for ill patients to refuse invasive treatment or extraordinary efforts to prolong their lives. As for his economic policies, he supports balanced fiscal policies, flat taxes, lower taxes, and free trade. == Political career == He was a local representative in the Legislative Assembly and, on two different occasions, in the federal Chamber of Deputies. He ran for the governorship of Michoacán in 1995 and served as national president of the PAN from 1996 to 1999. During his tenure, his party maintained control of 14 state capitals, but also faced a reduced presence in the federal Chamber of Deputies. Soon after Vicente Fox took office as president, Calderón was appointed director of Banobras, a state-owned development bank. He was accused by political opponents of committing abuse, disputing use of certain legal procedures to finance property valued between three and five million Mexican pesos (between US$300,000 and $500,000); however, once political objections arose, he used other means to formalize his transaction. He joined the presidential cabinet as Secretary of Energy, replacing Ernesto Martens. He left the post in May 2004 in protest of Vicente Fox's criticism of his presidential ambitions while supporting those of Santiago Creel. == 2006 presidential campaign == Members of his party chose him as the PAN presidential candidate. In a series of three primary elections, he defeated the favored former Secretary of the Interior under President Vicente Fox, and thus the election of Calderón as party candidate surprised many analysts. The PAN pointed to his competitive primary election as a sign of internal democracy. In other major parties, there was one candidate or all strong candidates but one were eliminated. Calderón's campaign gained momentum after the first presidential debate. Subsequent poll numbers put him ahead of López Obrador from March to May; some polls favored him by as much as 9 percentage points. This trend in his favor was contained after the second presidential debate when López Obrador decided to start joining the debates. Final poll numbers days ahead of the results indicated that his opponent's prior lead had shrunk further; some polls gave López Obrador the lead, while others favored Calderón and still others indicated a technical tie. === Results === e • d Summary of the 2 July 2006 Mexican presidential election results Candidates Party Alliance Votes % Felipe Calderón National Action Party None 15,000,284 35.89% Andrés Manuel López Obrador Party of the Democratic Revolution Coalición por el Bien de Todos 14,756,350 35.31% Roberto Madrazo Institutional Revolutionary Party Alianza por México 9,301,441 22.26% Patricia Mercado Social Democratic and Peasant Alternative Party None 1,128,850 2.70% Roberto Campa Cifrián New Alliance Party None 401,804 0.96% Write in 297,989 0.71% Blank/Invalid 904,604 2.16% Total 41,791,322 100.0% Source: Instituto Federal Electoral [5] == Presidency == === Inauguration === Mexican Constitution states that the President must be inaugurated by taking the oath of office before Congress in the lower house, the Chamber of Deputies. The PRD opposition had threatened to not allow Calderón to take the oath of office and be inaugurated as president. Ahead of claims that the PRD would disrupt the precedings, the PAN took control of Congress's main floor three days before the inauguration was scheduled. On November 30, 2006, outgoing President Vicente Fox Quesada and still President- elect Felipe Calderón Hinojosa stood side-by-side on national television as Fox turned over the presidential sash to a cadet, who handed it to Calderón. Afterwards, Fox read a short speech indicating that he had concluded his mandate by receiving the flag \"that had accompanied him during the last six years which he had devoted himself completely to the service of Mexico and had the utmost honor of being the president of the republic\". Calderón then made a speech to the Mexican public indicating that he would still attend the inauguration ceremony at the Chamber of Deputies. He made a call to unity. Calderón's inauguration ceremony on 1 December at the Congress of the Union was tense and lasted less than five minutes, as he barely managed to recite the oath of office while the PRD legislators shouted in protest against the alleged electoral fraud and attempted to impede his inauguration, and afterward he quickly left the building for security reasons as some of the legislators engaged in violent brawls. Besides the claims of fraud, Calderón took office with the smallest percentage of votes for a winning presidential candidate in Mexican history (35.8%), which meant that his administration would face severe legitimacy problems. Only a month after taking office, Calderón declared war on the drug cartels and organized crime, thus beginning the Mexican Drug War. This was considered by many as an immediate strategy to gain popular legitimacy and acceptation for the new President after the convoluted elections. ==References== ==Other websites== * Office of the President of Mexico site *Encyclopaedia Britannica, Felipe Calderon full access article * Extended biography by CIDOB Foundation * Felipe Calderón's speech to the Mexican people from the 'National Auditorium', 2006 Category:1962 births Category:Living people Category:Presidents of Mexico Category:People from Michoacán Category:People from Madrid Category:Honorary Knights Grand Cross of the Order of the Bath",
 "title": "Felipe Calderón"
}