{
 "id": "396224",
 "text": "A Zirkel is a symbol used in Central European student societies (Studentenverbindungen). == Look and meaning == A Zirkel consists of interwined lines, mostly followed by an exclamation mark. The lines mostly show the first letters of the name of the Studentenverbindung and/or the letters v, c, f or e, f, v. ;Examples File:Zirkel_1927.JPG | Zirkel of Corps Germania in Munich File:Zirkel_Gothia.jpg | Zirkel of Akademisches Corps Gothia in Innsbruck File:Zirkel_stpauli_jena.svg | Zirkel of Sängerschaft zu St. Pauli in Jena File:Zirkel_Ascania_Köln.png | Zirkel of Burschenschaft Ascania in Cologne File:Zirkel_Arminia_Leipzig.tif | Zirkel of Burschenschaft Arminia in Leipzig File:Zirkel der Landsmannschaft Schottland zu Tübingen.png | Zirkel of Landsmannschaft Schottland in Tübingen Meaning of v-c-f: * Vivant fratres coniuncti (\"the joined brothers should live\")Peter Krause: O alte Burschenherrlichkeit - Die Studenten und ihr Brauchtum, Graz, Wien, Köln 1979, page 78, 79 or * Vivat circulus fratrum (\"the circle of brothers should live\") or * Vivat, crescat, floreat (\"live, grow, flourish\").Paulgerhard Gladen: Gaudeamus igitur - Die studentischen Verbindungen einst und jetzt, Köln 2001, page 31 Meaning of e-f-v: * Ehre, Freiheit, Vaterland (\"Honour, Freedom, Fatherland\"). The meaning of the exclamation mark is not quite clear. == Using == The members of the Studentenverbindung use the Zirkel as sign on Couleur or other things (such as beer glasses, etc). If a member signs in affairs of its Studentenverbindung it places the Zirkel after its signature. This use is similar to the use of postnominals in Anglo-Saxon countries. ;Examples File:Strassencerevis_Rhen_Sil.jpg | Straßencerevis with embroidered Zirkel and oak leaves File:AKV_Alemannia_Alemannkrug_1.JPG | beer mug and Zipfel with Zirkel ==References== ==Further reading== * Peter Krause: O alte Burschenherrlichkeit - Die Studenten und ihr Brauchtum, Graz, Wien, Köln 1979 (German), * Peter Krause: O alte Burschenherrlichkeit - Die Studenten und ihr Brauchtum, 5. verb. Auflage, Graz, Wien, Köln 1997 (German), * Paulgerhard Gladen: Gaudeamus igitur - Die studentischen Verbindungen einst und jetzt, Köln 2001 (German) * Edgar Hunger / Curt Meyer: Studentisches Brauchtum, Bonn, Stuttgart 1958 (German) Category:Symbols",
 "title": "Zirkel (Studentenverbindung)"
}