{
 "id": "396494",
 "text": "Alameda is a city in the U.S. state of California. It is next to Oakland and the San Francisco Bay. In 2020, about 78,280 people lived in Alameda. Most of the city is on an island, called Alameda Island. The other large part is Bay Farm Island, which is now connected to the mainland. The third part of Alameda is Coast Guard Island, which is a military base for the U.S. Coast Guard. ==History== The city was founded in 1853, as three smaller towns. The east end was Alameda, the middle was called Encinal, and the west end was called Woodstock. The east end was incorporated as a town in 1854.Statutes of California, 1854, pp.209–211 The three towns became one in 1872. When the town was built, Alameda was not an island. It was connected to Oakland at the east end. On the west end, there was an inlet of water called an estuary. People used the estuary for shipping, but it was not deep enough. To make it deeper, engineers planned to dig a canal going all the way around Alameda. In 1902, a canal was finished that separated it from Oakland. From 1917 to 1939, there was a popular amusement park called Neptune Beach. In the 1940s the land was filled to make Bay Farm Island. A U.S. Navy base called Naval Air Station Alameda was opened in 1940. It was closed down in 1997. ==Statistics about the people== In the 2020 census, there were 78,280 people living in Alameda, in 30,980 households. The population density was 7,491.6 people per square mile (2,892.5/km²). The racial makeup was 43.6% White, 32.5% Asian, 5.9% Black, 0.6% Native American, 0.5% Pacific Islander, 4.1% from one other race, and 12.9% from two or more races. Hispanics and Latinos were 12.1% of the people. The median age was 41.4 years. The age breakdown was 19.9% under age 18, 62.5% from 18 to 65, and 17.5% over 65. The gender breakdown was 47.7% male and 52.3% female. Of the households, 63.4% were families, 30.2% had children under age 18, 47.7% had a married couple, 6.6% had an unmarried couple, 28.7% had a woman with no partner, 17.0% had a man with no partner, and 28.3% had one person living alone. The average household size was 2.48 people. There were 33,009 housing units in Alameda, and people lived in 93.9% of them. Of the households, 48.3% owned their home and 51.7% rented it. ==Transport== There are five ways to drive to or from Alameda island. These are the Posey and Webster Street Tubes; the Park Street Bridge, the Fruitvale Bridge; the High Street Bridge; and the Bay Farm Island Bridge. The Posey Tube is one-way into Oakland, and the Webster Street Tube is one way into Alameda. There is also a bicycle bridge next to the Bay Farm Island Bridge. All of these bridges are drawbridges: they rise into the air so boats can go under them. There used to be a railroad in Alameda, but it shut down. ==Related pages== *Alameda High School ==References== Category:1853 establishments in California",
 "title": "Alameda, California"
}