{
 "id": "39677",
 "text": "Alien is a 1979 British science fiction–horror movie directed by Ridley Scott. It is called a science fiction movie because the story takes place in outer space, and there are alien creatures. The movie's title refers to a highly aggressive (angry) and intelligent extraterrestrial (alien creature) that attacks and kills the crew of the spaceship Nostromo. The movie stars Sigourney Weaver as Ellen Ripley, Tom Skerritt as Captain Dallas, and Ian Holm as Ash. The extraterrestrials in the movies are usually called Xenomorphs. Alien was a box office success (it made a lot of money). It led to a successful Hollywood franchise of books, video games, merchandise, and three official sequels (follow-ups). Along with launching the career of actress Sigourney Weaver, the movie is credited as being the first action movie to have a strong female heroine. There are three sequels to this movie: Aliens (1986), Alien³ (1992), Alien: Resurrection (1997), and a cross-overs: Alien vs. Predator (2004) and Aliens vs. Predator: Requiem (2007). The famous tagline (slogan) for the movie was: In space no one can hear you scream. ==Plot== A spaceship called the Nostromo is towing cargo through space when it gets a signal from an unknown source on an alien planet. The crew wake up from cryonic sleep and go down to the planet to find out what it is. They find a large alien ship wrecked there. Its pilot is long dead and on board they find mysterious eggs. One of the crew, Kane (John Hurt) looks into an egg and is attacked by an alien creature that grabs onto his face. They bring him back to the Nostromo and try to cut the creature off him, but find out it has acid for blood. The creature later falls off and dies, but Kane is killed afterwards by another alien the first creature put into his stomach. The new creature quickly grows into a huge monster and starts killing the rest of the crew. Later the survivors find out that Ash is actually an evil android and the company that owns the Nostromo secretly wants the alien and doesn’t care if they die getting it. The survivors destroy Ash and plan to blow up the ship. The alien kills everyone left except Ripley and the ship’s cat Jonesy, who escape in a small shuttle before the Nostromo explodes. However, the alien is actually still on board the shuttle. Ripley kills it by shooting it into space and blasting it with the shuttle’s engines. The movie ends with Ripley going into cryonic sleep with Jonesy after leaving a message that the ship was destroyed and the rest of the crew are dead. == Other websites == * * Executive producer Ron Shusett on making Alien - video interviews and transcript Category:1979 horror movies Category:1970s monster movies Category:1970s English-language movies Category:1979 science fiction movies Category:20th Century Fox movies Category:Alien movies Category:American monster movies Category:British science fiction movies Category:British horror movies Category:Movies set on fictional planets Category:Movies composed by Jerry Goldsmith Category:Movies directed by Ridley Scott Category:United States National Film Registry movies Category:Movies that won the Best Visual Effects Academy Award Category:Saturn Award winning movies Category:American science fiction horror movies Category:Movies about extraterrestrial life Category:Body horror movies Category:Movies set in the future",
 "title": "Alien (movie)"
}