{
 "id": "397100",
 "text": "Jason Statham (born 26 July 1967) is an English actor, martial artist and movie producer. Statham is known for his roles in Lock, Stock and Two Smoking Barrels (1998), Snatch (2000), The One (2001), The Transporter trilogy (2002–2008), The Italian Job, (2003), Death Race, Crank (2006), War (2007), The Bank Job (2008), The Expendables (2010), The Expendables 2 (2012), The Expendables 3 (2014) and Expend4bles (2023). Many of these roles are as antihero in action movies. He does most of his own stunts. Statham was born on 26 July 1967 in Shirebrook, Derbyshire, England. He was raised in Great Yarmouth, Norfolk. Statham has been partners with Kelly Brook from 1997 until they separated in 2004. He began dating model Rosie Huntington-Whiteley in April 2010 and they got engaged in 2016. He and Rosie welcomed a son named Jack in June 2017. == Personal life == Statham has been in a relationship with model Rosie Huntington-Whiteley since 2010. The couple announced their engagement in January 2016. Their son was born in June 2017. Their daughter was born on 2 February 2022. They reside in Beverly Hills, California. ==Movie list== ===Movies=== Year Title Role Notes References 1998 Lock, Stock and Two Smoking Barrels Bacon 2000 Snatch Turkish 2000 Turn It Up Mr. B 2001 Ghosts of Mars Sergeant Jericho Butler 2001 MVA Agent Evan Funsch 2001 Mean Machine Monk 2002 Frank Martin 2003 Handsome Rob 2004 Collateral Airport Man Cameo 2004 Cellular Ethan Greer 2005 Transporter 2 Frank Martin 2005 Revolver Jake Green 2005 London Bateman 2005 Chaos Detective Quentin Conners 2006 Yves Gluant Uncredited 2006 Crank Chev Chelios 2007 War FBI Agent John Crawford Also known as Rogue: Assassin 2008 Terry Leather 2008 In the Name of the King Farmer Daimon 2008 Death Race Jensen Garner Ames / Frankenstein 2008 Truth in 24 Narrator Documentary; voice only 2008 Transporter 3 Frank Martin 2009 Crank: High Voltage Chev Chelios 2010 13 Jasper Bagges 2010 Lee Christmas 2011 Arthur Bishop 2011 Gnomeo & Juliet Tybalt Voice only 2011 Blitz Detective Sergeant Tom Brant 2011 Killer Elite Danny Bryce 2012 Truth in 24 II Narrator Documentary; voice only 2012 Safe Luke Wright 2012 Lee Christmas 2013 Parker Parker 2013 Fast & Furious 6 Deckard Shaw Cameo 2013 Hummingbird Joseph \"Joey\" Jones U.S. title: Redemption 2013 Homefront Phil Broker 2014 The Expendables 3 Lee Christmas 2015 Wild Card Nick Wild 2015 Furious 7 Deckard Shaw 2015 Spy Rick Ford 2016 Mechanic: Resurrection Arthur Bishop 2017 The Fate of the Furious Deckard Shaw 2018 The Meg Jonas Taylor 2019 Fast & Furious Presents: Hobbs & Shaw Deckard Shaw Also producer 2021 Wrath of Man Patrick \"H\" Hill / Mason Hargreaves 2021 F9 Deckard Shaw Cameo 2023 Operation Fortune: Ruse de Guerre Orson Fortune Also producer 2023 Fast X Deckard Shaw 2023 Meg 2: The Trench Jonas Taylor 2023 Expend4bles Lee Christmas Also producer 2024 The Beekeeper Adam Clay Also producer 2025 A Working Man Levon Cade Filming; also producer ===Video games=== Year Title Role Notes References 2002 Red Faction II Mandril Shrike 2003 Call of Duty Sergeant Waters 2015 Sniper X with Jason Statham Team Leader Mobile game ===Music videos=== Year Artists Title Role Notes 1993 The Shamen \"Comin' On\" Background Dancer 1994 Erasure \"Run to the Sun\" Background Dancer 1995 The Beautiful South \"Dream a Little Dream of Me\" Moviegoer 2014 Calvin Harris \"Summer\" Driver ==Awards and nominations== Year Nominated work Association Award Result 2015 Spy Broadcast Film Critics Association Awards Best Actor in a Comedy 2015 Furious 7 Teen Choice Award Choice Movie: Villain 2024 Expend4bles Razzie Awards Worst Picture 2024 Meg 2: The Trench Razzie Awards Worst Actor ==Notes== == References == ==Other websites== * * Category:1967 births Category:Living people Category:English movie actors Category:English television actors Category:English stage actors Category:English voice actors Category:English movie producers Category:British martial artists Category:Actors from Derbyshire Category:Actors from Norfolk Category:British divers",
 "title": "Jason Statham"
}