{
 "id": "397411",
 "text": "Wisconsin Rapids is a city in Wood County, Wisconsin, United States. 18,877 people lived there at the 2020 census. ==Geography== Wisconsin Rapids is at (44.386805, -89.823078). According to the United States Census Bureau, the city has a total area of , of which, is land and is water. ==History== The American Indians called the area \"Ahdawagam\", meaning \"Two-sided Rapids\". Although Europeans began to settle this area in the 1830s, Wisconsin Rapids has been known by this name only since 1920. Prior to that, it was split by the Wisconsin River, with the west side as Centralia and the east side as Grand Rapids. The two cities joined in 1900, together known as Grand Rapids. The name was changed in 1920 to avoid mail and other goods from being sent to the much better known Grand Rapids, Michigan. ==Demographics== ===2020 census=== As of the 2020 census, there were 18,877 people, 8,655 households, and 4,465 families in Wisconsin Rapids. The population density was 1,360.2 people per square mile (525.2/km²). There were 9,265 housing units. The breakdown by race was 87.4% White, 3.5% Asian, 1.4% Black, 0.9% Native American, 1.5% from one other race, and 5.3% from two or more races. Hispanics and Latinos made up 4.6% of the people. The median (middle) age was 41.9 years. The age breakdown was 21.1% under age 18, 56.6% from 18 to 65, and 22.3% over 65. The gender breakdown was 47.7% male and 52.3% female. Of the households, 23.5% had children under age 18, 33.7% had a married couple, 9.8% had an unmarried couple, 33.9% had a woman with no partner, 22.7% had a man with no partner, and 40.7% had one person living alone. The average household size was 2.13 people. ==Economy== Known for its wood and paper making history, Wisconsin Rapids is also important to the cranberry industry. Wisconsin Rapids is the home of the international educational software company, Renaissance Learning Inc. as well as other national and global companies. In the past, Rapids was home to the headquarters for Consolidated Papers, now owned by NewPage Corporation. The company continues its presence in the area with a paper mill that houses two paper machines and a \"Kraft process\" pulp mill. ==Education== Mid-State Technical College offers job-related training, and Lakeland College offers academic learning. Lincoln High School is the local public high school (grades 10–12) in Wisconsin Rapids. Assumption High School is a private Catholic high school in Wisconsin Rapids. The city has two public junior high schools: East Junior High School (grades 8–9) and Wisconsin Rapids Middle School (grades 6–7). River Cities High School also exists as a charter school alternative to the local high schools. ==Recreation== Wisconsin Rapids has several local parks, including Robinson Park, Gaynor Park, and Lyon Park. There is also a recently built skate park. The state water-skiing championships are held at Lake Wazeecha every year and the national BMX Bandit cycling championships are held at the Central Wisconsin BMX bicycle track. There are three museums, the South Wood County Historical Corporation Museum, the Alexander House, and the Paper Making Museum, all of which are housed in large former family homes. There is a city zoo (free to enter), and two public swimming pools. There is a prairie chicken sanctuary at the Buena Vista Wildlife Reservation, and every year the Prairie Chicken Festival is held. The Betty Boop Festival or the Grim Natwick Animated Film Festival are held annually since the inaugural events in 2010. The Cranberry Blossom Festival takes place in July and the Grand Affair Arts Festival in September of each year. In summer of 2010, the new baseball team, the Wisconsin Rapids Rafters of the summer college Northwoods League, played their first season at Witter Field. ==Media== ===Print media=== * Daily Tribune Website, Daily Newspaper. Started 1920 from merger of Grand Rapids Leader (est. 1914) and Grand Rapids Tribune. About 10,766 readings of this newspaper take place each day, according to Mondo Newspapers * The VOICE Of Wisconsin Rapids Website , Weekly Newspaper. Independently owned, founded 2009. * Buyers' Guide, Website Weekly advertisement newspaper with some editorial content ===Television=== * RCCA: Website River Cities Public, educational, and government access (PEG) broadcast on cable tv. ===Radio=== Although this is a list of radio stations based in the Wisconsin Rapids area, the signals of radio stations from much of Central Wisconsin are commonly received in the city. ;AM Radio stations * WFHR 1320 kHz, News/Sports Talk Radio - Established November 1940 ;FM Radio stations * Kool Gold 105.5 MHz WRCW - Oldies/Sport Established as KZZA in 2003 * Hot 96-7 96.7 MHz WHTQ Top 40 - Established as WYTE in 1985, latterly WLJY * WIFC 95.5 MHz - CHR - Established 1969 * WDEZ 101.9 MHz Country & western - Established as WRIG in 1964 * Y106.5 106.5 MHz WYTE- Contemporary Country & Western - Established as WDLB in 1965 * WGLX 103.3 MHz WGLX-FM - Classic Rock - Established as WFHR-FM in 1946 ==Notable residents== * Ken Anderson, professional wrestler * Mark E. Anderson, U.S. National Guard general * Bonnie Bartlett, actress * Bruno Block, MLB catcher * D.L. Bogdan, author of historical novels http://www.lifeatthecenterwi.com/an-interview-with-novelist- d-l-bogdan/ * Theodore W. Brazeau, Wisconsin legislator * James Daly, actor * Stephen E. Johnson, U.S. Navy admiral * Tom Metcalf, MLB pitcher * Edith Nash, educator and poet * Philleo Nash, professor and anthropologist * Grim Natwick, animator and film director (1890–1990) * John Offerdahl, NFL player * Bryan Reffner, NASCAR driver * Don Rehfeldt, All-American college & NBA basketball player * Scott Scharff, NFL player * Dick Trickle, NASCAR driver * J.R. Turner, fiction writer, Executive Director of the Wisconsin Writers' Association * Herman C. Wipperman, Wisconsin legislator * Isaac P. Witter, Wisconsin legislator * Joseph Wood, merchant, and Wisconsin legislator ==References== ==Other websites== * City of Wisconsin Rapids, Wisconsin * Wisconsin Rapids Area Convention and Visitors Bureau * Wisconsin Rapids Chamber of Commerce * Wisconsin Rapids Public Schools * McMillan Memorial Library * Wisconsin Rapids & Wood County History * The Betty Boop Festival * Central Wisconsin BMX Category:1920 establishments in the United States Category:Cities in Wisconsin Category:Wood County, Wisconsin Category:County seats in Wisconsin Category:1920s establishments in Wisconsin",
 "title": "Wisconsin Rapids"
}