{
 "id": "397473",
 "text": "Władziu (or Vladziu) Valentino Liberace (May 16, 1919 - February 4, 1987), best known as Liberace, was an American pianist88 notes pour piano solo, Jean- Pierre Thiollet, Neva Editions, 2015, p. 163. and vocalist of Polish-Italian origin. Liberace's career lasted four decades. It included concerts, recordings, movies, television and endorsements. During the 1950s–1970s he was the highest-paid entertainer in the world.Barker, 2009, p. 367. He lived a life of flamboyant excess both on and off the stage. == Records == The success of Liberace's syndicated television program made him a popular recording artist. From 1947-51, he released 10 albums. By 1954, it jumped to nearly 70.Pyron, 2000, p. 157. He released several recordings through Columbia Records, including Liberace by Candlelight. He sold over 400,000 albums by 1954. His most popular single was \"Ave Maria\", selling over 300,000 copies.Pyron, 2000, p. 153. His albums included popular songs at the time, such as \"Hello, Dolly!\". He also played his versions of classical music for the composed by Chopin and Liszt. Many fans of classical music criticized them (and Liberace's skills as a pianist in general) for being \"pure fluff with minimal musicianship\". In his life, he received six gold records. == Personal life and death == Liberace was born on May 16, 1919 in West Allis, Wisconsin. During his career, Liberace denied being homosexual. He successfully won lawsuits against The Daily Mirror newspaper and Confidential magazine, who had reported some of his gay relationships. He was awarded damages and legal fees. Towards the end of his life his chauffeur sued him for \"palimony\". The lawsuit was unsuccessful. He died of pneumonia caused by AIDS/HIV on February 4, 1987 in Palm Springs, California, aged 67. == Other reading == ===Biographies=== * Crying All the Way to the Bank, by Revel Barker (Famous Trials) 2009 * The Liberace Story, by Chester Whitehorn (editor). Screen Publications Inc, New York, 1955 (softcover – #4 in the Candid Profile series) * Liberace: On Stage and Off, by Anthony Monahan. GRT Music Productions, Sunnyvale California, 1976 (hardcover) * Liberace: The True Story, by Bob Thomas. St. Martins Press, New York, 1987 (hardcover) * Behind the Candelabra: My Life with Liberace, by Scott Thorson with Alex Thorleifson. E.P. Dutton, New York, 1988 (hardcover) * Liberace: A Bio-Bibliography, by Jocelyn Faris. Greenwood Press, Westport CT, 1995 * Liberace: An American Boy, by Darden Asbury Pyron. University of Chicago Press, 2000, (hardcover) Read an excerpt. * Liberace (Lives of Notable Gay Men and Lesbians), by Ray Mungo and Martin B. Duberman. Chelsea House Publications ==References== ==Other websites== * * The Liberace Foundation *Liberace video footage after winning the case against the Daily Mirror * Excerpts from Cassandra's column * Transcript of CNN interview with Scott Thorson about his time with Liberace * Yesterday's News: June 18, 1959: Liberace wins libel suit * Liberace's Greatest Songs DVD review and history of Liberace's syndicated television series. * Liberace Museum To Close Category:1919 births Category:1987 deaths Category:Deaths from pneumonia Category:Actors from Wisconsin Category:American movie actors Category:American pianists Category:American stage actors Category:American television actors Category:Deaths from AIDS Category:Gay men Category:Infectious disease deaths in California Category:LGBT actors Category:LGBT musicians Category:LGBT people from Wisconsin Category:LGBT singers Category:Musicians from Wisconsin Category:Singers from Wisconsin",
 "title": "Liberace"
}