{
 "id": "397958",
 "text": "Lagrange points are stable positions near large bodies in orbit. When two large bodies are in orbit around each other, there are places that a third body can occupy. Lagrange points are found in the orbits of Earth and the Sun, or the Moon and the Earth. The most well-known natural occupants of Lagrange points are Trojan asteroids. The points are five places where a small object (such as a man-made satellite) can orbit. At those points, the gravitational forces of the two large bodies and forces due to motion all balance up. So, at those places, a small object keeps more or less in a stable position. Dust clouds, asteroids, and man-made satellites are found in those points. This effect is named after the mathematician Joseph-Louis Lagrange, who wrote a paper on this in 1772 (long before we put satellites into orbit). The five places are called L1, L2, L3, L4 and L5. The first three (L1, L2, L3) are called metastable because if a satellite gets a bit out of place, it will fall away from that point, and not come back without using fuel. L4 and L5 are considered stable - if a satellite gets a bit out of place, it will be pulled back into place by the gravity and centripetal forces, and oscillate around the Lagrange point. This can result in very wide swings around L4 and L5, sometimes called by such names as \"tadpole\" and \"horseshoe\" orbits. NASA has inserted satellites into two Lagrange points of the Sun-Earth system. The L1 point (between the Earth and the sun) is used for satellites in a halo orbit to watch the sun, looking for solar flares. The L2 point (beyond the Earth) is used for space telescopes such as the James Webb Space Telescope launched on 25 December 2021. It is a million miles (about 1.5 million kilometers) from Earth. Because L4 and L5 are stable, they have attracted dust clouds. The Earth-Sun system has attracted a few asteroids and the bigger planets have more and larger ones. These asteroids are called Trojan asteroids. ==References== Category:Solar System Category:Satellites Category:Celestial mechanics",
 "title": "Lagrange point"
}