{
 "id": "398119",
 "text": "John Randolph Thune (born January 7, 1961) is an American politician. Thune is the senior United States Senator from South Dakota and a member of the Republican Party. He used to be a United States Representative for South Dakota's at-large congressional district. In 2025, he became the Senate Majority Leader. Thune was born on January 7, 1961 in Pierre, South Dakota. He is of Norwegian descent. Thune studied at Biola University and at the University of South Dakota. He has been married to Kimberley Weems since 1984. They have two children. Thune was selected by the Senate Republican Conference to become the Majority Whip for the 116th Congress, replacing Senator John Cornyn of Texas, who was term limited in the position. In 2021, he became Senate Minority Whip. In 2024, Thune was elected to be the Senate Republican leader, replacing Mitch McConnell. Thune is the first Senate party leader to have originally taken office as a senator in the 21st century.staff, The Hill. “Live Updates: Johnson Nominated for Speaker, Thune Elected Senate GOP Leader.” The Hill, 13 Nov. 2024, https://web.archive.org/web/20241113184833/https://thehill.com/homenews/house/4987984-house- senate-republicans-leadership-election/. Accessed 14 Nov. 2024. ==References== ==Other websites== *United States Senator John Thune official U.S. Senate site *Friends of John Thune official campaign site *www.amazon.com *Profile from SourceWatch *Representative-Elect John Thune (R-SD) profile from CNN, 1996 Category:1961 births Category:Living people Category:American Protestants Category:Evangelicals Category:People from Sioux Falls, South Dakota Category:United States representatives from South Dakota Category:United States senators from South Dakota Category:Republican Party (United States) politicians Category:People from Pierre, South Dakota Category:Majority leaders of the United States Senate Category:Opposition to Viktor Orban Category:Opposition to Vladimir Putin",
 "title": "John Thune"
}