{
 "id": "39827",
 "text": "Kristallnacht, also known as the Reichskristallnacht or Reichspogromnacht, was a two-day pogrom against Jews in Nazi Germany, Austria and the Sudetenland, parts of the then-Czechoslovakia. It occurred on November 9‒10, 1938. The name Kristallnacht means \"Night of Broken Glass\" in English. Kristallnacht was an important event leading up to the Holocaust. Various Nazi organizations participated, including the Schutzstaffel (SS), Sturmabteilung (SA), and Hitlerjugend (Hitler Youth). Many ordinary Germans joined in, motivated by antisemitism. * * * * * * * * The consequences to Jews were severe. At least a thousand were killed. Thousands more had their property looted or destroyed. Another 30,000 were deported to concentration camps after the pogrom. Fire departments and police stood by and watched. ==Name== The word \"Kristallnacht\" means \"Night of Crystal\" or \"Night of Broken Glass\" in English. Not everybody agrees on this name. It has been called a euphemism because it does not mention violence, only property damage (particularly broken windows and crystal chandeliers). Additionally, -nacht (\"night\") suggests that the pogrom lasted just a single night, not two days. ==Assassination of Ernst vom Rath== On November 7, 1938, Ernst Eduard vom Rath, a diplomat at the German Embassy in Paris, was shot by a 17-year-old Polish Jew named Herschel Grynszpan.Sometimes spelled Grünspan. Two days later, vom Rath died from his injuries, and Kristallnacht began. ===Motivations=== On October 26, 1938, the Gestapo was ordered to arrest and deport all Polish Jews living in Germany. This included Grynszpan's family, which had been living in Germany since the early 1920s. With at least 12,000 others, the family was deported to Poland after having all of their property seized. From there, they sent a postcard to Herschel (who was living in Paris), explaining what had happened and asking for help. After shooting vom Rath, Herschel explained that he hoped to draw the world's attention to the persecution of Jews in Nazi Germany. When French police arrested him after the shooting, he said: When he was arrested, Herschel was carrying a postcard he had written to his parents, further explaining his motivations: ===Prior incident=== There had been a similar event in February 1936, when a Jewish student named David Frankfurter assassinated NSDAP Secretary Wilhelm Gustloff. Hitler was furious, but unlike on Kristallnacht, he did not allow the Nazis to take revenge against Jews. He wanted the upcoming 1936 Summer Olympics in Berlin to be good propaganda for Nazi Germany. Scenes of violence, he worried, might cause other countries to boycott the Olympics. In 1938, Hitler no longer had these worries, and the Nazis punished tens of thousands of Jews after vom Rath's death. ==Pogrom== ===Looting=== Kristallnacht began with massive property damage. Together the SA, the Hitler Youth, and German citizens targeted Jewish property all across Germany, Austria, and the Sudetenland. Specifically, they: * Destroyed and looted Jewish homes, hospitals, schools, and about 7500 businesses * Destroyed Jewish cemeteries * Damaged over 1400 synagogues and prayer rooms * Destroyed 267 synagogues completely ===Massacre=== At least 1,000 Jews were killed during the night of Kristallnacht (though SS officers claimed that only 91 had died).Asbjørn Svarstad. https://www.nettavisen.no/norsk-debatt/vare-joder-er- nordmenn-ikke-israelere/o/5-95-1443876. Nettavisen.no. Retrieved 2023-11-09 Many others were beaten or assaulted. Police reports of suicides and rapes increased after Kristallnacht. A 2012 study reported that just in Austria, 680 Jews died by suicide on Kristallnacht. ===Arrests and deportations=== More than 30,000 Jewish men were arrested during Kristallnacht and imprisoned in Nazi concentration camps (primarily Dachau, Buchenwald, and Sachsenhausen). Many died there. ==Intensified persecution== The Nazi regime used Kristallnacht as an excuse to worsen their persecution of the Jews. By the time World War II started months later, more than 200,000 had emigrated to escape this persecution. ===Financial punishments=== The Nazis decided that the Jews should be liable for all of the property damage committed during Kristallnacht. They punished Jews with a collective fine of 1 billion Reichsmarks (equal to about $400,000,000 in United States dollars at the time). When Jews who had lost property received insurance payments, the Nazis seized them. If they had more than 5,000 Reichsmarks in assets, Jews were forced to give 20% of them to the state. Many Jews had their properties forcibly taken, or had to sell and abandon their homes, stores, and businesses. ===New laws=== The Nazi regime used the Kristallnacht as an excuse to completely remove Jews from German public life. After the pogrom, the Nazis made dozens of laws taking property and rights away from Jews. Under these laws: * \"Aryan\" people took over Jewish business and property, usually paying very little * Jews were forbidden from practicing many professions, including teaching, medicine, and law (they were already ineligible for jobs in the public sector) * Jewish children were expelled from German schools * German Jews lost their right to have a driver's license or own an automobile * Jews were restricted from using public transportation * Jews could not enter “German” theaters, movie cinemas, or concert halls ==Importance== Kristallnacht was an important event leading up to the Final Solution and the Holocaust. It marked Nazi Germany's change from discriminating against Jews to systematically persecuting and deporting them. ==Gallery== File:Bundesarchiv Bild 146-1988-078-07, Herschel Feibel Grynszpan.jpg|Kristallnacht started after Herschel Grynzpan (above) shot Ernst vom Rath File:Ernst-vom- Rath.jpg|Grynzpan was angry that Ernst vom Rath (above) had let his family be deported File:Destroyed Ohel Yaaqov Synagogue.jpeg|The Nazis destroyed many synagogues, like this one in Munich File:0254 HM Monson Collection Vienna 1938 01 49 45 00.webm|Home movie from Vienna showing how Jewish stores were destroyed File:Synagogue Eisenach burning- Nov 1938.jpg|A ruined synagogue in Germany File:Bundesarchiv Bild 146-1982-174-27, Nürnberg, Ausweisung polnischer Juden.jpg|Polish Jews being forced to leave their homes in Germany, 1938 ==Related pages== * Babi Yar * Iași pogrom * Odessa massacre * Jedwabne pogrom * Rhineland massacres ==References== Category:Racism Category:Nazism Category:Fascism Category:Massacres Category:Antisemitism Category:The Holocaust Category:Discrimination Category:Jewish history Category:1938 in Germany Category:1930s in Europe Category:1930s in Austria Category:1930s in Germany Category:History of Europe Category:History of Austria Category:History of Germany Category:Antisemitism in Europe Category:Antisemitism in Germany",
 "title": "Kristallnacht"
}