{
 "id": "398507",
 "text": "Para-alpine skiing classification is the order system for para-Alpine skiing designed to give equal competition between alpine skiers with different types of limited physical powers. The system of ordering are grouped into three general condition of being unable sorts: stand, unable to see and being seated. Group selection is done by International Paralympic Committee AlpineSkiing. Prior to that, several groups dealt with this including the International Sports Organization for the Disabled (ISOD), International Stoke Mandeville Games Federation (ISMWSF), International Blind Sports Federation (IBSA) and Cerebral Palsy International Sports and Recreation Association (CP- ISRA). Some order systems are persons given government by bodies other than International Paralympic Committee Alpine skiing, such as the Special Olympics. The sport is open to all competitors with a no seeing or physical condition of being unable stand. It is not open to people with intellectual disabilities. File:B1 class.png| B1 skier who cannot see well File:B2 class.png| B2 skier who cannot see well File:B3 class.png| B3 skier who cannot see well File:Wheelchair_rugby_profile_classification_C5.svg| Able to move area of a CP5 classified skier File:Wheelchair_rugby_profile_classification_C5-6.svg|Able to move area of a CP5/CP6 classified skier File:Wheelchair_rugby_profile_classification_C6-7.svg|Able to move area of a CP6/CP7 classified skier File:Wheelchair_rugby_profile_classification_C7-8.svg|Able to move area of a CP7/CP8 classified skier The first order systems for para-Alpine sking were made in Scandinavia in the 1960s, with early systems designed for skiers with no legs or arms. At the time, necessary things had yet to be done to let skiers with spinal cord wounds ski. The purpose of the early order systems was to be made around use of arms and legs but ended up being a medical order system. At the first Winter Paralympics in 1976, there were two groups in the system of ordering for the sport. By the 1980s, groups had existence for skiers with cerebral palsy. At that time, with inspiration from wheelchair basketball classification, efforts were made to make order more of an able to use better system. Ten groups had existence by the 1980s, and since then, efforts have been made to make better the doing work well of order by making fewer the number of classes so fewer medals can be rewarded. Competition rules for groups use rules made by or are an adjustment from rules by the International Ski Federation. For skiers with seeing problems, guides are used to help the skier down the mountain. For standing skiers, different part rules come to a decision about what sort of necessary things is let in competition, such as one long stick, two sticks or no sticks, or one or two skis. Seated skiers use a specially designed ski for going over snow quickly called a mono- ski. Skiers are put in a group based on medical, and their body position when they ski. Unable to see skiers are put in order only on a medical. Standing type Type What Equipment LW 1 Twice leg cutting off above the knee, middle to serious cerebral palsy, or equal problem two narrow wood fixed on feet for going over snow quickly (skis), two outrigger skis LW 2 ne only leg cutting off above the knee two skis, two outrigger skis LW 3 twice leg cutting off below the knee, warm cerebral palsy, or equal impairment Two skis, two sticks LW 4 one only leg cutting off below the knee Two skis, two sticks LW5/7-1 twice arm cutting off above the angle of arm Two skis, no sticks LW 5/7-2 twice arm cutting off, one above and one below the angle of arm Two skis, no sticks LW 5/7-3 twice arm cutting off below the angle of arm Two skis, no sticks LW6/8.1 one only arm cutting off above the angle of arm Two skis, one stick LW 6/8.2 one only arm cutting off below the angle of arm Two skis, one stick LW9.1 cutting off or equal impairment of one arm and one leg above the knee skier can chose LW9.2 cutting off or equal impairment of one arm and one leg below the knee skier can chose being seated types (monoskiers) Type What LW10.1 paralysis of the legs and lower half of the body with no upper stomach- related group event and no able to use being seated balance LW 10.2 paralysis of the legs and lower half of the body with some upper stomach-related group event and no able to use being seated balance LW11 paralysis of the legs and lower half of the body with equal able to use being seated balance LW12.1 paralysis of the legs and lower half of the body with some leg purpose, use and good being seated balance LW 12.2 twice leg cutting off above the knees Seeing types Type What B1 completely unable to see B2 used-in-seeing acuity of less than 2/60 B3 used-in-seeing acuity of 2/60 to 6/60 ==References== Category:Paralympic Games Category:Alpine skiing",
 "title": "Para-alpine skiing classification"
}