{
 "id": "398511",
 "text": "Geologic time scale uses the principles and techniques of geology to work out the geological history of the Earth.Levin, Harold 2003. The Earth through time, Hoboken, New Jersey: Wiley, p.2 It looks at the processes which change the Earth's surface and rocks under the surface. Geologists use stratigraphy and paleontology to find out the sequence of the events, and show the plants and animals which lived at different times in the past. They worked out the sequence of rock layers. Then the discovery of radioactivity and the invention of radiometric dating techniques gave a way to get the ages of the layers (strata). We now know the timing of important events that have happened during the history of Earth. The Earth is about 4.567 billion (4,567 million) years old. The geological or deep time of Earth's past has been organized into various units. Boundaries on the time scale are usually marked by major geological or palaeontological events, such as mass extinctions. For example, the boundary between the Cretaceous period and the Palaeogene period is defined by the Cretaceous–Tertiary extinction event. This marked the end of the dinosaurs and of many marine species. Prospecting for energy sources and valuable minerals depends on understanding the geological history of an area. Such knowledge can also help lessen the hazards of earthquakes and volcanoes. == Terminology == The largest defined unit of time is the supereon composed of Eons. Eons are divided into Eras, which are in turn divided into Periods, Epochs and Stages. At the same time paleontologists define a system of faunal stages, of varying lengths, based on the kinds of animal fossils found there. In many cases, such faunal stages have been adopted in building the geological nomenclature, though in general there are far more recognized faunal stages than defined geological time units. Geologists tend to talk in terms of Upper/Late, Lower/Early and Middle parts of periods and other units, such as \"Upper Jurassic\", and \"Middle Cambrian\". Upper, Middle, and Lower are terms applied to the rocks themselves, as in \"Upper Jurassic sandstone,\" while Late, Middle, and Early are applied to time, as in \"Early Jurassic deposition\" or \"fossils of Early Jurassic age.\" The adjectives are capitalized when the subdivision is formally recognized, and lower case when not. Thus in 2018 when three divisions (subepochs) of the Holocene were formally recognized it became correct to write \"Early Holocene\" instead of \"early Holocene\". Because geologic units occurring at the same time but from different parts of the world can often look different and contain different fossils, there are many examples where the same period was historically given different names in different locales. For example, in North America the Lower Cambrian is called the Waucoban series that is then subdivided into zones based on trilobites. The same timespan is split into Tommotian, Atdabanian and Botomian stages in East Asia and Siberia. A key aspect of the work of the International Commission on Stratigraphy is to reconcile this conflicting terminology and define universal horizons (time division) that can be used around the world. == Table of geologic time == The following table summarizes the major events and characteristics of the periods of time making up the geologic time scale. As above, this time scale is based on the International Commission on Stratigraphy. The height of each table entry does not correspond to the duration of each subdivision of time. (not shown to scale) Geologic time Eon Era Period/Age4,5 Epoch Major Events Start (Years Ago)3,6 Phanerozoic Cainozoic Quaternary Holocene Rise of human population; Last ice age ends 11,700 Pleistocene Ice ages and warmer periods; extinction of many large mammals; evolution of fully modern humans 2.588 million Tertiary Neogene Pliocene Climate cools further; Australopithecine hominins evolve 5.333 million Miocene Earth has many forests; animals flourish but later temperatures start to cool 23.03 million Palaeogene Oligocene The continents move into their current places 33.9 million Eocene The Himalayas are formed as India moves into Asia 56 million Palaeocene India reaches Asia; mammals evolve into new groups; birds survive extinction 66 million Mesozoic Cretaceous Upper Cretaceous Dinosaurs become extinct in K/T extinction event. 100.5 million Lower Cretaceous Dinosaurs continue to flourish; marsupial and placental mammals appear; first flowering plants 145 million Jurassic Upper Jurassic Dinosaurs dominate on land; first birds, early mammals; conifers, cycads and other seed plants. Supercontinent Pangaea begins to break up 163.5 million Middle Jurassic 174.1 million Lower Jurassic 201.3 million Triassic Upper Triassic First dinosaurs; pterosaurs; ichthyosaurs; plesiosaurs; turtles; egg-laying mammals 237 million Middle Triassic 247.2 million Lower Triassic 252.17 million Palaeozoic Permian P/Tr extinction event – 95% of species become extinct. Supercontinent Pangaea forms. 298.9 million Carboniferous Pennsylvanian Tropical climate: abundant insects, first synapsids and reptiles; coal forests 323.2 million Mississippian Large primitive trees 358.9 million Devonian Age of fish; first amphibia; clubmosses and horsetails appear; progymnosperms (first seed bearing plants) appear 419.2 million Silurian First land plant fossils 443.4 million Ordovician Invertebrates dominant 485.4 million Cambrian Major diversification of life in the Cambrian adaptive radiation 541 million Proterozoic Neoproterozoic2 Ediacaran First multi-celled animals 635 million Cryogenian Possible Snowball Earth period 720 million Tonian Supercontinent Rodinia breaks up 1 billion Mesoproterozoic Stenian The supercontinent Rodinia forms 1.2 billion Ectasian First sexually reproducing organism 1.4 billion Calymmian The supercontinent of Columbia breaks up 1,6 billion Palaeoproterozoic Statherian Formation of the Columbia (supercontinent) happens during this period 1.8 billion Orosirian First complex single-celled life 2.05 billion Rhyacian Replacement of CO2 by oxygen triggers the Huronian glaciation in this period 2.3 billion Siderian The breakup of the supercontinent Kenorland occurs 2.5 billion Archaean Neoarchaean The supercontinent Kenorland forms 2.8 billion Mesoarchaean The supercontinet Ur is from this era 3.2 billion Palaeoarchaean Bacteria build stromatolites 3.6 billion Eoarchaean 1st supercontinet Vaalbara existed during this era 4 billion Hadean Formation of Earth 4.6 billion years ago; formation of Moon 4.5 bya 4.54 billion (~4.6 bya) # In North America, the Carboniferous is subdivided into Mississippian and Pennsylvanian sub-periods or epochs. # Discoveries in the past quarter century have substantially changed the view of geologic and paleontologic events just before the Cambrian. The term Neoproterozoic is used now, but older writers might have used 'Ediacaran', 'Vendian', 'Varangian', 'Precambrian', 'Protocambrian', 'Eocambrian', or might have extended the Cambrian further back in time. # Dates are slightly uncertain, and differences of a few percent between sources are common. This is because deposits suitable for radiometric dating seldom occur exactly at the places in the geologic column where we would most like to have them. Dates with an * are radiometrically determined based on internationally agreed GSSPs. # Paleontologists often refer to faunal stages rather than geologic periods. The faunal stage nomenclature is quite complex. See http://flatpebble.nceas.ucsb.edu/public/harland.html for an excellent time ordered list of faunal stages. # In common usage the Tertiary-Quaternary and Palaeogene-Neogene-Quaternary are treated as periods. The term 'age' (e.g. 'Neogene Age') is sometimes used instead of 'period'. # The time shown in the \"Years Ago\" column is that of the start of the Epoch in the \"Epoch\" column. == Related pages == * History of the Earth * Age of the Earth *History of the geologic time scale == References and footnotes == ==Other websites== *GSA: Geologic Time Scale * CHRONOS * National Museum of Natural History - Geologic Time * Geological Time Systems - Information model for the geologic time scale * Exploring Time from Planck Time to the lifespan of the universe Category:subfields of geology",
 "title": "Geologic time scale"
}