{
 "id": "398510",
 "text": "La tempestad (The Tempest), originally titled La tormenta, is a Mexican telenovela. It is produced by Salvador Mejía Alejandre for Televisa. It is a remake of the Colombian telenovela La Tormenta. William Levy and Ximena Navarrete star as the protagonists, while Iván Sánchez, Mariana Seoane, Laura Carmine, Daniela Romo and Cesar Evora star as the antagonists. The story is about the romance between Marina (played by Navarrete) and Damian (played by Levy). == History == As of 13 May 2013, Canal de las Estrellas is broadcasting La tempestad, replacing Amores verdaderos. == Story == La Tempestad will break with the love story of Marina (Ximena Navarrete) and Damian (William Levy). Marina Reverte works as a manager at a hotel, who is fired when complaint to prominent businessman Ernesto Contreras (Manuel Ojeda), for attempted sexual abuse an employee. He swears revenge on her. Marina is also taking care of her sick mother Beatriz Reverte (Maria Sorté), and they relocate in order to receive medical advice. Meanwhile, in the town of Nuestra Señora del Mar, Damian Fabre, a handsome young man who is captain and owner of a fishing boat called \"La Tempestad\"; works sorting merchandise for a marine cannery, called \"El Neptuno\". Esthercita (Laura Carmine), daughter of the mayor of this town, is obsessed with Damian, who does not respond to his flirtations, but Damian finally gives in, and she seduces him to succeed. Mercedes Artigas (Daniela Romo), an elegant and mysterious woman, offers Marina economic and financial management of the company Neptune, opportunity has now accepted that job and that her mother needs to live in a quiet place. Thus, Marina reaches the town of Our Lady of the Sea, where she meets Damian. Mercedes actually is the biological mother of Marina. In her youth she became pregnant and was at the mercy of Ernesto Contreras, who snatched her other twin daughter, Magdalena (Ximena Navarrete). Mercedes forged a fortune, with which also gained the respect of those around her and the power to face their enemies. Mercedes has dedicated her life to retrieve his daughters, for this has been that people involved with the underworld of white slavery, becoming \"Queen of the Night\", whose personality has allowed her to save many young victims. In their first meeting in the company \"El Neptuno\" Marine shows to Damian a haughty attitude, treating him as an employee more, for its part, Damian ignored and is filed Marina showing his authority with his crew of witnesses. Marina, furious to be humiliated, decides to break the contract with him. Olinto (Luis Manuel Ávila), administrator explains that the contract with Captain Fabré not be broken. Marina is in the village with Hernán Saldaña (Ivan Sanchez), a former classmate who is now a powerful businessman. Hernán works with a mafia devoted to kidnapping and trafficking in persons, especially women who intended to prostitution. The village mayor, Fulgencio (César Évora), is his ally. Hernán ordered to destroy the factory and ship Damian, as that would rid obstacles. Marina knows that Hernan is behind the attacks on the factory, causing considerable losses, so Marina and Damian are forced to make a truce in order to join forces, is when they recognize they have fallen in love. == Cast == Confirmed as of February 8, 2013. * William Levy as Captain Damian Fabre/ Michel Fabre, in love with Marina, Esthercita's husband, Eusebia's godson, Fulgencio and Delfina's son in law, Mercedes' boss, Bagre's friend, a head captain of La Tempestad, Hernan's rivalry friend, Michel's brother father of young Damian, mauled to death by the shark, main hero. *Ximena Navarrete as Marina Reverte / Magdalena Artigas, in love with Damian, a Neptuno owner/ a ex-hotel manager, Mercedes' biological daughter, Magdalena's biological twin sister, Esthercita, Mayuya and Ursula's enemy, Ariel's dedicated daughter, Hernan's former classmate/love interest, Rebeca's niece, Mercedes daughter, Marina's biological twin sister, main heroine. *Iván Sánchez as Hernán Saldaña, Esthercita's lover, Mercedes stepson, Fulgencio and Ursula's ally, Carmen's ex-lover/enemy, Inocencia's father/enemy, Marina's former classmate/love interest/enemy, Damian's rivalry friend/enemy, main primary antagonist. *Laura Carmine as Esther Salazar Mata \"Esthercita\", Delfina and Fulgencio's daughter, Ursula's cousin, Mayuya's friend/accomplice, Damian's wife/enemy, Hernan's lover, hates Marina, main primary antagonist. *Mariana Seoane as Ursula Salazar, Fulgencio and Delfina's niece, Hernan's ally, Esthercita's cousin, hates Marina, co-main primary antagonist. *Daniela Romo as Mercedes Artigas viuda de Saldaña, Marina's biological mother, Magdalena's mother, Jose and Damian's boss, Hernan's stepmother, main primary antagonist. *César Évora as Mayor Fulgencio Salazar, a corrupted/ruthless mayor of Nuestra Señora del Mar, Delfina's husband/enemy, Ursula's uncle, Mayuya's lover, Esthercita's father, Hernán's ally, Valdivia and Lara's henchman, hates Damian and Marina, main primary antagonist. *Lucero Lander as Delfina Mata de Salazar, Fulgencio's wife, Esthercita's mother, Ursula's aunt. *Malisha Quintana as Mayuya Canseco, Esthercita's friend/accomplice, Fulgencio's lover, eavesdropper, hates Marina, villain, Strangled by Fulgencio *María Sorté as Beatriz vda. de Reverte, Marina's mother, Rebeca's sister, Ariel's widow. *Manuel Ojeda as Ernesto Contreras, an evil and powerful man, an arrogant and vindictive authoritarian, villain. *Nora Salinas as Tia Rebeca, twins aunt of Marina/Magdalena, Beatriz's sister, Ariel's dedictated sister in law. *Arturo Peniche as Ariel Reverte, Beatriz's deceased husband, Marina's deceased father, Magdalena's deceased biological father, Rebeca's deceased brother in law, killed by Ernesto *Sharis Cid as Candeleria \"Candy\" , owner of La Dona bar. *Luis Manuel Ávila as Olinto, administrator of El Neptuno. *Alejandro IbarraAlfonso Herrera no aparecerá en La Tempestad; será sustituido por ¿¡Alex Ibarra!? as Bagre, a sailor of La Tempestad, Damian's friend. *Latin Lover as El Oso, a sailor of La Tempestad, Damina's boss. *Alfonso Iturralde as Padre Tomas, a priest. *Arturo Carmona as Jose Manriquez, Mercedes' bodyguard/driver. *Amor Flores as Jazmin, kidnapped by a mafia, in love with Lazaro. *Monica Miguel as Eusebia, Damian's godmother. *Salvador Ibarra as Lagarto *Fernando Robles as Lara, a police officer, Fulgencio's henchman, villain. *Francisco Martin as Lolo, a sailor of La Tempestad, Damian's boss. *Enrique Zepeda as Lazaro, an apprentice sailor of La Tempestad, Damian's boss, in love with Jazmin, antihero. *Alpha Acosta as Carmen *Ludwika Paleta as Inocencia *Adalberto Parra as Valdivia, a corrupted police chief, Fulgencio's henchman, villain. *Fernando Larranaga as Dr. San Miguel, a town doctor. *Jose Antonio Ferral as Toribio, a police officer. *Roberto Blandon *Janet Ruiz *Gilberto de Anda as Nereo, villain. *Sergio Reynoso as Comandate Robles, a police chief, nearly killed by Lazaro. *Oscar Bonfiglio *Eduardo Liñan as Dr. Gonzalez, a doctor. *Amparo Garrido as Alicia *Tony Vela as Macario, Ernesto's boss, villain. *Mar Contreras as Enriqueta ==Production team== *Original story - Humberto \"Kiko\" Olivieri *Adaptation and scripts - Liliana Abud, Mauricio Aridjis and Ricardo Fiallega *Literary Edition - Dolores Ortega *Special Guests - La Internacional Sonora Santanera *Theme entry - \"Today I have wanted you\" (\"Hoy tengo ganas de ti\") *Interpreter - Alejandro Fernandez and Christina Aguilera *Topic output - \"To dream\" (\"Para sonar\") *Artist - Daniela Romo and Francisco Cespedes *Musicality - Mauricio Lopez de Arriaga and Jorge Eduardo Perdaza *Musicalization Coordinator - Luis Alberto Diazayas *Scenery - Diego Lascurain and Eluart Barajas *Atmosphere - Esperanza Carmona *Costume Design - Lorena Perez and Lorenza Chavira *Image Design - Dulce Velazquez and Karla Irabien *Production Manager - Jessica Moreno, Raul Reyes Uicab and Manuel Archila *Coordination of artistic production - Gerardo Lucio Bear *Production coordination - Beatriz de Anda and Alfonso Lopez *Editors - Marco A. Rocha Maza and Juan Carlos Frutos Maza *Address dialogues - Juan Antonio Llanes *Overall coordination of production - Laura Mezta *Directors in cameras - Lino Gama Esquinca and Jesus Najera Saro *Stage director - Mónica Miguel and Eric Morales *Associate Executive Producers - Aaron Gutierrez Mendez *Executive Producer - Salvador Mejía Alejandre ==References== ==Other websites== * Category:2013 television series debuts Category:Telenovelas by Televisa Category:2010s Mexican television series debuts",
 "title": "La tempestad"
}