{
 "id": "398521",
 "text": "Harry Chapman Pincher (29 March 1914 - 5 August 2014) was an Indian-born British journalist, historian, and novelist. == Early life == Pincher was born on 29 March 1914 in Ambala, Punjab. His father was from Britain and his mother was American. Pincher studied at Darlington Grammar School and King's College London. == His work == Pincher wrote a series of books on supposed KGB spies in the West, mostly members of the British ruling class whom he believed were traitors in the service of the KGB. Among these were Roger Hollis, former head of MI5, and Harold Wilson, twice Prime Minister in the 1960s and 70s.Pincher, Chapman 1981, Their trade is treachery.Pincher, Chapman 2009. Treachery: betrayals, blunders, and cover-ups: six decades of espionage against America and Great Britain. New York: Random House, and Mainstream, UK. Many of these ideas had come from James Jesus Angleton, former CIA counterespionage chief. Angleton's career ended when his many allegations were not supported with appropriate evidence. Among his more outrageous claims was that Canadian Prime Ministers Lester Pearson and Pierre Trudeau were agents of the Soviet Union.Buckley, William F., Jr. 2000. Spytime: the undoing of James Jesus Angleton: a novel. New York: Harcourt. . Littell, Robert. 2003. The Company: a novel of the CIA. New York: Penguin Books. . Fictional history of the CIA during the Cold War in which Angleton is a major supporting character.Mangold, Tom. 1991. Cold warrior: James Jesus Angleton: the CIA's master spy hunter. New York: Simon and Schuster, 1991. Another source was Peter Wright, a former assistant director of MI5. The British Government tried to prevent the publication of Wright's own Spycatcher (1987), which covered much the same ground as Pincher's Their trade is treachery. Wright had published in Australia, and the Australian court case ran on for years with no success. In the event, nothing was proved against Hollis, who was the main target of Their trade is treachery. Later British Prime Ministers stated that Hollis was a loyal servant of the Crown, and that a great injustice had been done to him by the Pincher and Wright books. == Death == Pincher died on 5 August 2014 at the age of 100. == References == Category:1914 births Category:2014 deaths Category:British journalists Category:British historians Category:British centenarians",
 "title": "Chapman Pincher"
}