{
 "id": "398519",
 "text": "Isabella Acres (born February 21, 2001) is an American actress who played Rose on Better Off Ted. Acres was born in Atlanta, where she discovered her love for acting in children's theater. She then relocated to Los Angeles. Acres' little sister, Ava, is also an actress. Acres is best known for her series regular role as Rose Crisp on Better Off Ted, the seven-year-old daughter of Ted (Jay Harrington) who is often the most mature person at his home and workplace. The show's first season finished in August 2009, with a second picked up for January 2010. Acres also appeared on an episode of Monk in 2007, and single episodes of The Mentalist where she plays Patrick Jane's (Simon Baker) daughter and on the hit television show Hannah Montana. Acres was nominated for Best Performance in a TV Series, Guest Starring Young Actress at the Young Artist Awards 2009 for her performance in The Mentalist. She currently can be seen in the recurring role of Soleil Friedman in the second season of the Fox television series Touch. ==Filmography== ===Television=== Year Series Role Episode/Notes 2007 Monk Other Child \"Mr. Monk and the Man Who Shot Santa Claus\" 2008 The Mentalist Charlotte Jane \"Redwood\", Recurring Role 2008 Hannah Montana Little Girl \"Killing Me Softly with His Height\" 2009–2015 Phineas and Ferb Katie \"Bubble Boys\" 2009–2015 Phineas and Ferb Katie \"Isabella and the Temple of Sap\" 2009–2015 Phineas and Ferb Katie \"Thaddeus and Thor\" 2009–2015 Phineas and Ferb Katie \"De Plane! De Plane!\" 2009–2015 Phineas and Ferb Katie \"Phineas and Ferb: Summer Belongs to You!\" 2009–2015 Better Off Ted Rose Crisp Recurring in Season 1-2 2010 Scooby-Doo! Mystery Incorporated Mary-Ann Geerdon \"The Song of Mystery\" Voice Role 2011 Desperate Housewives Jenny Hunter-McDermott \"I'm Still Here\" 2011 Desperate Housewives Jenny Hunter-McDermott \"Searching\" 2011 Desperate Housewives Jenny Hunter- McDermott \"Watch While I Revise the World\" 2011 The Middle Autumn Wagner \"Valentines Day II\" 2011 Adventure Time Young Princess Bubblegum \"Mortal Recoil\" 2011 Adventure Time Young Princess Bubblegum \"Too Young\" 2011 The Event Mary \"The Little Girl\" \"The Beginning of the End\" 2011 Beyond the Blackboard Dana Television movie 2013 Touch Soleil Friedman Recurring role in Season 2 ===Film=== Year Film Role Notes 2006 Air Buddies Rosebud Sound Alike DVD Special Features 2007 30 Days of Night Little Vampire Girl ADR 2007 Fred Claus Little Girl ADR 2007 Life with Fiona Dancing Girl 2008 Horton Hears A Who! ADR 2008 The Women ADR 2008 Four Christmases ADR 2009 Cloudy with a Chance of Meatballs ADR 2010 A Nightmare on Elm Street ADR 2010 The Back-up Plan ADR 2010 Hereafter ADR 2010 How Do You Know ADR 2010 Yogi Bear ADR 2010 Little Fockers ADR 2010 The Last Airbender ADR 2010 Free Willy: Escape from Pirate's Cove Kirra Cooper Sound Alike 2010 The Future Gabriella 2012 Wreck-It Ralph Additional Voices 2012 A Monster Christmas Lilly (voice) 2013 Scooby- Doo! Stage Fright Emma Gale 2014 Home Girl 2015 Hello, My Name Is Doris Vivian 2017 The Meanest Man in Texas Ruthie Welsey ==References== == Other websites == * Category:2001 births Category:Actors from Atlanta Category:American child actors Category:American television actors Category:Living people Category:American movie actors",
 "title": "Isabella Acres"
}