{
 "id": "398697",
 "text": "Jessica Sonya DiCicco (born June 10, 1980) is an American actress, singer and voice artist. She is perhaps best known for her voice acting in animated television shows and video games. ==Filmography== Film Year Title Role Notes 1990 The Godfather Part III Child 1993 Household Saints Young Cindy Zagarella 1998 Bus No. 9 Jessica TV movie Witness to the Mob Karen TV movie 2004 50 First Dates Teenager at the zoo uncredited 2006 Over the Hedge Shelby Voice 2007 Toot & Puddle: I'll Be Home for Christmas Opal Voice / TV movie 2008 Kung Fu Panda: Secrets of the Furious Five Young Viper Voice / Short film Unstable Fables: Goldilocks & 3 Bears Show Misty Voice 2010 Einstein Pals Millie Voice / Direct-to-video (DVD) Television Year Title Role Notes 1989 Kate & Allie 2004 Jakers! The Adventures of Piggley Winks Gerdie Voice / \"Dannan's American Cousin\" (season 3, episode 5) 2004-2007 All Grown Up! 16-17 year old 7th grader named Wally (who appeared in 3 seasons and 4 episodes) Voice / Minor role Loonatics Unleashed Lexi Bunny Voice / Main role 2005-2006 The Buzz on Maggie Maggie Pesky Voice / Title role 2006-2008 The Emperor's New School Malina Voice / Main role 2006 Frances Frances Voice / Title role Shuriken School Okuni / Ami / Kita Voice / Main role Bratz Roxxi / Fiana / Sheridan Voice / Recurring role Danger Rangers Manny / Moe Voice / \"Medicine Mix Up\" (season 1, episode 5) 2007 El Tigre: The Adventures of Manny Rivera Davi Rococo Voice / Recurring role American Dragon: Jake Long Danica Voice / Recurring role 2008 Jimmy Kimmel Live! Herself season 6, episode 30 The Replacements Celebrity Starr Voice / \"Hollywoodn't\" (season 2, episode 10) 2008-2011 The Mighty B! Gwen Voice / Main role 2008-2009 Toot & Puddle Opal Voice / Main Role 2010 Two and a Half Men Jenny Voice / \"Aye, Aye Captain\" (season 7, episode 15) 2011 Tinker Bell and the Pixie Hollow Games Lilac Voice / Main Role 2011 Winx Club Lucy, Miele Voice / Minor Role. English version by Nickelodeon. 2012-2014 Adventure Time Flame Princess Voice / Minor Role 2012 Pound Puppies Patches Voice / Recurring Role 2012 The High Fructose Adventures of Annoying Orange Princess Peach Voice 2012 Motorcity Ruby the Dark Slayer Voice / \"Ride of the Fantasy Vans\" (season 1, episode 9) 2023 Kingdom Gamers Hannah / Honey Rhythm Voice / Main Role The Enchanted Garden Yona Voice / Main Role North Woods Ori Renin Voice / Main Role Video games Year Title Role Notes 2000 Midnight Club: Street Racing Announcer for the New York level 2003 Disney's Extreme Skate Adventure Skater Girl 2005 Psychonauts Franke Athens 2006 Kingdom Hearts II Olette Pimp My Ride Marcia 2007 Hot Shots Tennis Ashley Bratz 4 Real Roxxi / Fianna 2010 White Knight Chronicles: International Edition Additional Voices Final Fantasy XIII/Final Fantasy XIII-2 Cocoon Inhabitants/Additional Voices Resonance of Fate Leanne 2011 Rise of Nightmares Monica 2011 Sesame Street: Once Upon a Monster Tallulah Voice == References == ==Other websites== * Category:1980 births Category:Living people Category:Actors from Los Angeles Category:Actors from New York City Category:American child actors Category:American movie actors Category:American voice actors Category:American television actors Category:American video game actors Category:Singers from Los Angeles Category:Singers from New York City",
 "title": "Jessica DiCicco"
}