{
 "id": "398807",
 "text": "Kandhan (கந்தன்), also known as Murugan, is the tamil land god and victory. Kandhan is the major god popularly worshipped in India, Sri Lanka, Mauritius, Singapore, Malaysia and many other places of the world, where many Tamils widespreadly live. Kandhan has six shrines in Tamil Nadu, which are known as Arupadai Veedu. In Tamil Nadu, Kandan has continued to be popular with all classes of the Tamil society since the Sangam age. Kandhan is the son of Shiva and Parvati also known as kottavai, who was born to kill the Asuras and be the eternal protector of the Devas and other living beings. The Asuras, who were demons who frequently warred against the Devas, who were gods. The six sites (Arupadai Veedu) in Tamil Nadu where Kartikeya sojourned while leading his armies and killing all the Asuras are Palani, Svamimalai, Thiruparamkundram, Pazhamudirsolai, Thiruthani, Thiruchendur, are the complete six Arupadai Veedu temples of Kandhan. Kandhan is the god of Tamil language and he is mentioned a lot in Sangam literature. The six abodes of Kartikeya are all in Tamil Nadu. Each of these temples has a unique history and a different reason to worship Kandhan. Thai Poosam during January – February months and it is celebrated as a 6-day festival. On Thai Poosam day, Kavadis and Palkudams are taken by devotees in procession around Palani. Special Abhishekas are performed to the Mulavar and Utsavar. Annadhanam is provided to all devotees participating in the functions. In the night, Kandhan is taken in procession accompanied by Nadasvaram, Veda Parayanam around Palani. Vaikasi Visakam day, (during May – June month), Kavadis and Palkudams are taken by devotees in procession around Palani. Soorasamharam is celebrated during October – November month is celebrated as a 6-day festival. The devotees of Kandhan will fast for 6 days. On the evening of the 6th day, Soorasamharam (The Destruction of Sooran) will be held at every Kandhan temple around the world. The Soorasamharam festival (The Destruction of Sooran) at Thiruchendur is very special as that mythological incident occurred there only. ==References== == External Link == 1.Lord Murugan HD Wallpapers & Images Category:Hindu gods and goddesses Category:Tamil culture",
 "title": "Kartikeya"
}