{
 "id": "398818",
 "text": "Anna Schaffelhuber (born January,26 1993 in Regensburg) is a skier athlete from Germany. She has a disability. She skied at the 2011 IPC Alpine Skiing World Championships. She was the first skier to finish in the sitting women's Super Combined race, Slalom race and Giant Slalom race. == Early life == Schaffelhuber was born in Regensburg, Bavaria, Germany. She was born with an incomplete spinal cord, which caused paraplegia, so she uses a wheelchair. She started monoskiing when she was five years old, and when she was fourteen, she got a scholarship to join a national junior skiing program. ==Career== Schaffelhuber competes in para-alpine skiing in the LW10 classification. She uses a sitting mono-ski and outriggers. She was chosen for the German team at the 2010 Winter Paralympics in Vancouver, British Columbia. She competed in four events and won a bronze medal in the super-G, finishing in 1 minute and 38.25 seconds behind Claudia Lösch of Austria and Alana Nicholsfrom America. She also finished fourth in the super combined and slalom events and seventh in the giant slalom. She carried the German flag at the closing ceremony. At the 2011 IPC Alpine Skiing World Championships in Sestriere, Italy, she won three gold medals in the sitting women’s super-combined, slalom, and giant slalom events, a silver medal in the team event, and came fourth in both the downhill and super-G events. At the 2013 IPC Alpine Skiing World Championships in La Molina, Spain, she won five medals: a gold in slalom, silver medals in giant slalom and super-G, and bronze medals in super combined and downhill. She competed in her second Paralympics at the 2014 Winter Games in Sochi, Russia. There, she won her first Paralympic gold medal in the sitting downhill race with a time of 1 minute 35.55 seconds. She then won a second gold medal in the super-G race, finishing first with a time of 1 minute 29.11 seconds. In the slalom race, Schaffelhuber was first disqualified because her outriggers weren’t in the right position at the start of her first run. Her teammate Anna-Lena Forster was initially announced as the gold medal winner. However, after an appeal, Schaffelhuber was given back her gold medal, and Forster took silver. Schaffelhuber then won a fourth gold medal in the combined race, with Forster winning silver again. She finished her Paralympics with a fifth gold medal by winning the giant slalom in a total time of 2 minutes 51.26 seconds. She became the second athlete to win all the alpine skiing events after Lauren Woolstencroft did it in 2010. For her incredible performance at the Games, Schaffelhuber was awarded Best Female at the Paralympic Sports Awards. == Awards == In November 2010, Schaffelhuber was voted Athlete of the Month by the International Paralympic Committee, winning 45% of the public vote. In November 2011, she was named Germany's Disabled Athlete of the Year. In 2013, she was also chosen as the Female Disabled Athlete of the Year by the German National Paralympic Committee. ==References== Category:1993 births Category:Living people Category:German skiers Category:People from Regensburg Category:Sportspeople from Bavaria Category:Competitors at the 2018 Winter Paralympics Category:German sportspeople with disabilities",
 "title": "Anna Schaffelhuber"
}