{
 "id": "398968",
 "text": "Charles Ellis \"Chuck\" Schumer (born November 23, 1950) is the senior United States Senator from New York. He is a member of the Democratic Party and the Senate Minority Leader since 2025. ==Early career== Before his election to the U.S. Senate, Schumer served in the United States House of Representatives from 1981 to 1999. He represented New York's 16th congressional district, which was later redistricted to the 10th congressional district in 1983 and to the 9th congressional district in 1993. ==Senate Minority leader (2017)== In 2015, Senate Minority Leader Harry Reid of Nevada announced his retirement. Reid quickly supported Schumer to replace him as the new Senate Minority Leader. On November 16, 2016, Schumer was elected as the senate's new minority leader. He assumed this position on January 3, 2017. ==Personal life== Schumer was born on November 23, 1950 in Brooklyn, New York. His family is Jewish, descended from immigrants from Russia, Poland, and Austria. He studied at Harvard College and Harvard Law School, he was a three-term member of the New York State Assembly, serving from 1975 to 1980. Schumer is married to Iris Weinshall. They have two children. ==References== ==Other websites== * United States Senator Charles E. Schumer official U.S. Senate site * Chuck Schumer for U.S. Senate official campaign site * Senator Chuck Schumer interview from Fresh Air from WHYY at NPR, January 30, 2007 * Schumer Seeks Market-Maker Obligations for Computerized Traders, Jesse Westbrook, Bloomberg Businessweek, August 11, 2010 * Sound of one man voting: Chuck's 'voice' OKs border bill, Richard Sisk, New York Daily News August 12, 2010 * Israel's man in the US Senate, Al Jazeera, April 25, 2010 Category:1950 births Category:Living people Category:Jewish American politicians Category:Politicians from New York City Category:United States representatives from New York (state) Category:United States senators from New York (state) Category:Minority leaders of the United States Senate Category:Majority leaders of the United States Senate Category:Democratic Party (United States) politicians",
 "title": "Chuck Schumer"
}