{
 "id": "398972",
 "text": "Kirsten Elizabeth Rutnik Gillibrand (born December 9, 1966) is an American politician and the junior United States Senator from New York since 2009. She is a member of the Democratic Party and former member of the United States House of Representatives from New York's 20th congressional district. In January 2019, Gillibrand announced her plans to run for President of the United States in the 2020 election. She made a formal announcement on March 17, 2019.https://twitter.com/SenGillibrand/status/1107235330992812032 She ended her campaign on August 28, 2019. ==United States Senator (since 2009)== On December 1, 2008, President-elect Barack Obama announced Hillary Clinton, the junior U.S. Senator from New York, as Secretary of State. Clinton was confirmed and resigned her senate seat. The announcement began a two-month search process to fill her empty Senate seat. Under New York law, the governor appoints a replacement. A special election would then be held in November 2010 for the remainder of the full term, which ended in January 2013. Governor David Paterson picked Gillibrand on January 23, 2009. Gillibrand has moved her political positions and ideology toward a liberal, progressive position since her appointment to the Senate.url=http://www.msnbc.com/the-cycle/the-flip- flopping-nature-kirsten-gillibran Gillibrand was an important part of the successful campaign to repeal \"Don't Ask, Don't Tell\".\"What 'Don't Ask Don't Tell' did for Kirsten Gillibrand\" , Capital New York, Steve Kornacki, December 20, 2010 In March 2011, Gillibrand co-sponsored the PROTECT IP Act, which would restrict access to web sites judged to be infringing copyrights.Bill Summary & Status 112th Congress (2011–2012), \"S.968 Cosponsors\", Bill Summary & Status In 2013, Gillibrand proposed the unsuccessful legislation that would remove sexual assault cases from the military chain of command; the bill was cosponsored by Republican senators Rand Paul and Ted Cruz. In November 2017, Gillibrand made national news when she said that President Bill Clinton should have resigned from office when his affair with Monica Lewinsky was revealed. ==2020 presidential campaign== In January 2019, Gillibrand announced that she is formally exploring a run for President of the United States in the 2020 election while on The Late Show with Stephen Colbert. The next day, Gillibrand announced her candidacy for President. She made it official on March 17, 2019. After failing to qualify for the third debate in September, Gillibrand ended her campaign on August 28, 2019. ==Personal life== Gillibrand was born on December 9, 1966 in Albany, New York. She studied at Dartmouth College and the University of California, Los Angeles. Gillibrand has been married to Jonathan Gillibrand since 2001. They have two children. ==References== ==Other websites== *United States Senator Kirsten Gillibrand official U.S. Senate site *United States Senator Kirsten Gillibrand official YouTube channel *Gillibrand for Senate official campaign site *Gillibrand for Senate official YouTube channel *Campaign contributions made by Kirsten Gillibrand Category:1966 births Category:Living people Category:2020 United States presidential candidates Category:United States senators from New York (state) Category:United States representatives from New York (state) Category:People from Albany, New York Category:Democratic Party (United States) politicians Category:21st-century Roman Catholics",
 "title": "Kirsten Gillibrand"
}