{
 "id": "399016",
 "text": "Wheelchair basketball is a type of basketball for people who use wheelchairs. == Classification == Types in wheelchair basketball plays an important undertakings in the sport as the order uses total points of players to come to a decision about who can be on the basketball court. The system of ordering for the sport are 1 point player, 2 point player, 3 point player, 4 point player and 4.5 point player. The higher the point number, the greater the player's able to use body power to play wheelchair basketball. With five players on the basketball count, the total number of points may not be greater than fourteen. There has been supported views put forward as to errors of the order system as being overly complex from players, coaches and leagues. These criticisms have been printed materials in theory but not doing research made public in 1986, 1990, 1995 and 1997. Wheelchair basketball types Type What 1 point player athletes with little or no controlled in their upper body moving in all planes. Their balance in both forward and front turned to the side directions is importantly made damaged, feeble and they cannot user their arms to come back them to the upright position when unbalanced. one point players have no way to turn the middle part of their body. 2 point player athletes with some not completely, partly of the middle part of their body moving in the forward direction, but no controlled front turned to the side moving. They have control upper chief part of body but poor lower chief part control and cannot turn. 3 point player athletes with upper and middle part of body moving in the forward direction. They do go to the floor and up again without support. They have middle body turn but no controlled front turned to the side moving. 4 point player athletes with normal body moving, but usually needing support to limiting conditions in one lower leg or arm. They have trouble with controlled front turned to the side moving to one side. 4.5 point player athletes with normal middle and upper pary body for journey moving in all directions who are able to get stretched side to side with no limiting conditions. At times, players may not easily go into into a type for a full point. For this reason, they can be put in order in between, such as 1.5 points, 2.5 points, and 3.5 points. Classifiers are said words tending to stop from giving to this half point order as a competitors first order. They are said to do on the second order. == References == == Links to other sites == *International Wheelchair Basketball Federation Category:Basketball Category:Paralympic sports",
 "title": "Wheelchair basketball"
}