{
 "id": "399177",
 "text": "Ryūnosuke Akutagawa (1 March 1892 – 24 July 1927), was a Japanese writer famous for his short stories. He was born in Tokyo, Japan. Kikuchi Kan, and Kume Masao were his friends. He published a literary magazine named \"Shinshicho\" with them. His first work is \"Rounenn\". His story \"Hana\" (The Nose) was highly estimated by his master Natsume Soseki. == A chronological table == *1892 3 He was adopted by his uncle Dōshō Akutagawa because his mother was mentally ill.. *1902 4 He entered Kotojinjyo high school. *1902 11 His mother died. *1915 8 He finished writing a novel Rashomon. *1915 10 He was Natsume Soseki's student. *1915 11 He published a novel Rashomon in a magazine. *1916 4 He published a novel Hana by Shinshicho. *1919 3 He got married to Tsukamoto Fumi. *1920 3 His eldest son Hiroshi was born. *1921 7 He went to China as an office worker of a newspaper. *1922 5 He released his first essay collection Tenshin. *1922 11 His child Takashi was born. *1925 7 His child Yasushi was born. *1927 7 He committed suicide by taking Barbital at his own room. *1935 1 The Akutagawa prize, which is a literary award, was established. == Main works == Works Outline Rashomon (Gate in old Kyoto;Rashomon) This story tell about a poor young man who struggle in deciding whether to take to evil ways and live, or to die from starvation. Hana (The Nose) This story's main character is a monk, who dislikes about his very long nose. Kumonoito (A Spider's Thread) The Buddha tries to help a bad person from Hell to hang a spider's thread, because he did only one good thing before his death. However his way to climb a thread change the Buddha's feeling. Jigokuhen (Picture Of Hell) This story is about a genius artist who draws a picture of his daughter who is dying in fire, to create perfect art. Yabunonaka (The Truth's Still a Mystrery) A police of those days examines people who have something to do with a case of murder. It's so difficult for leaders to find a criminal. Kappa(River Goblin) This story express human's weak point and ugliness of capitalist exploitation through kappas. == Akutagawa's death == Akutagawa committed suicide by taking sleeping pills at age of 35. It was written that he was \"vaguely anxious about my future.\" in his suicide note. Akutagawa is one of many Japanese writers who have committed suicide. Other writers include Dazai Osamu, Mishima Yukio and Kawabata Yasunari. == References == Category:1892 births Category:1927 deaths Category:Suicides Category:Writers from Tokyo",
 "title": "Ryūnosuke Akutagawa"
}