{
 "id": "399168",
 "text": "Francis Cooke (ca. 1583 - April 7, 1663) was a passenger on the Mayflower. He was a signer of the Mayflower Compact and was an important member of Plymouth Colony. Francis Cooke lived in England and then in Leiden, Netherlands.Charles Edwards Banks, The English Ancestry and Homes of the Pilgrim Fathers: who came to Plymouth on the Mayflower in 1620, the Fortune in 1621, and the Anne and the Little James in 1623 (Baltimore, MD.:Genealogical Publishing Co., 2006) p. 48.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 121 Cooke married Hester Mahieu at the French Walloon Church in Leiden. In August 1606 Francis Cooke and his wife moved to Norwich in county Norfolk in England. They did not live there long and returned to Netherlands. Their son John was baptized at the Walloon Church in Leiden in 1607.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), pp. 121-122 == On the Mayflower == When the English Separatist Church members in Leiden decided to go to America in 1620, Cooke decided he would go with them. He brought his thirteen year–old son, John, with him. Cooke's wife and the younger children stayed in Leiden and came to Plymouth Colony on the ship Anne in July 1623.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), p. 123Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 122 The Mayflower left Plymouth, England on 6 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower reached land at Cape Cod hook. They landed on November 21. They wrote the Mayflower Compact, which made rules on how they would live and treat each other. Cooke was one of the signers.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 413George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. The Mayflower was supposed to land in Virginia Colony, but the ship was too damaged and they were forced to land at Cape Cod now called Provincetown Harbor.George Ernest Bowman, The Mayflower Compact and its signers (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7-19.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 20, 411-413 == In Plymouth Colony == In Plymouth Colony, the settlers were given land. In that Division of Land in 1623, Cooke received two acres, one for himself and one acre for his son John. He also received 4 acres for his wife and children who came over on the ship called Anne in 1623.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 417 Cooke's children were named John, Jacob, Jane, Hester and Mary.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691 (Salt Lake City: Ancestry Publishing, 1986) p. 421 Cooke seemed to have been trusted and liked by the other colonist because in early 1633, Cooke was assigned by the court to help resolve a dispute of a financial nature between Peter Browne and Dr. Samuel Fuller.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 124 In 1640/41 Cooke was one of twelve men tasked by the court to make official travel routes, and make a formal survey and mark the boundaries of plots of land and for the Jones River. In 1645 he was again road surveyor for Plymouth. In June 1650, when he was almost seventy, he was still doing survey work. In August 1659, in his late 70s, he was again called upon by the Plymouth Court to help to decide a land boundary dispute between Thomas Pope and William Shurtliff.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 270Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), pp. 124-125 Cooke also did other public service work, being on several petty and grand juries. He also served on civil case juries up to March 1643. Most of the civil case involved debts or slander. He was also on grand juries in 1638, 1640, 1642 and 1643 which involved more serious crimes.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), p. 125 In the 1643 Able to Bear Arms List, Francis Cooke and his sons Jacob and John Jr., are listed with those from Plymouth.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691 (Salt Lake City: Ancestry Publishing, 1986), p.440 On December 7, 1659 Francis Cooke made out his will, saying he was weak in body. The will was very simple and he gave everything to Hester, his loving wife. 1609.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), pp. 126 Francis Cooke died in Plymouth on April 7, 1663 and was buried on Burial Hill in Plymouth, Massachusetts.Memorial for Francis Cooke Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., Caleb Johnson, 2006), pp. 127 == References == Category:1580s births Category:1663 deaths Category:Mayflower passengers",
 "title": "Francis Cooke"
}