{
 "id": "399497",
 "text": "The Governor of the Commonwealth of Pennsylvania is the head of the executive branch of Pennsylvania's governmentPA Constitution article IV, § 2 and the commander-in-chief of the state's military.PA Constitution article IV, § 7 The job of the governor is to enforce state laws and to approve or veto bills passed by the Pennsylvania Legislature.PA Constitution article IV, § 15 The governor may grant pardons except in cases of impeachment.PA Constitution article IV, § 9 There have been seven presidents and 46 governors of Pennsylvania. Two governors serving non-consecutive terms. There have been a total of 55 terms in both offices. The longest term was that of the first governor, Thomas Mifflin. He served three full terms as governor and two years as president. The shortest term belonged to John Bell. He served only 19 days as acting governor after Edward Martin resigned. The current governor is Josh Shapiro. His term began on January 17, 2023. ==Governors== Pennsylvania was one of the first thirteen colonies. It became a state on December 12, 1787. === The Presidents of the Supreme Executive Council=== The first constitution in 1776 created the Supreme Executive Council as the executive branch. The President was the leader of the Council.1776 Constitution § 3 The president was picked each year by the council.1776 Constitution § 19 The 1776 constitution created the position of \"vice-president\" but it did not say what should happen if the president left office. This happened four times. Sources from that time still listed the chief executive as the vice president when that person acted as the president. One acting president, George Bryan, has since been recognized as a governor. This is because he acted as president for over six months. # President Took office Left office Vice President 1 Thomas Wharton Jr. March 5, 1777 May 23, 1778 Died in office. George Bryan 2 George Bryan May 23, 1778 December 1, 1778 acting as president As Vice President of the Supreme Executive Council, acted as president. Four vice presidents acted as president. Bryan's long term has caused his term to since be seen as being equal to president. 3 Joseph Reed December 1, 1778 November 15, 1781 George Bryan Resigned; no reason was recorded by the Supreme Executive Council. Matthew Smith William Moore 4 William Moore November 15, 1781 November 7, 1782 James Potter 5 John Dickinson November 7, 1782 October 18, 1785 James Ewing James Irvine Charles Biddle 6 Benjamin Franklin October 18, 1785 November 5, 1788 Charles Biddle Peter Muhlenberg David Redick 7 Thomas Mifflin November 5, 1788 December 21, 1790 George Ross ===Governors of the Commonwealth of Pennsylvania=== The 1790 constitution ended the council. It replaced the president with a governor,1790 Constitution article II, § 1 and created a three-year term for governor. This term started on the third Tuesday of the December after the election. A governors could not serve more than nine out of any twelve years.1790 Constitution article IV, § 3 The 1838 constitution moved the start of the term to the third Tuesday of the January after the election. It allowed governors to only serve six out of any nine years.1838 Constitution article II, § 3 The 1874 constitution lengthened the term to four years. It said that governors could not succeed themselves (be elected to another term while still in office).1874 Constitution article IV, § 3 The current constitution of 1968 changed this to allow governors to serve two consecutive terms.PA Constitution article IV, § 3 There are no limits on the number of terms a governor may serve in total as long as there is a four year break after a second term. If the governor dies, resigns or is impeached, the lieutenant governor becomes governor for the rest of the term. If the governor becomes unable to act as governor because of disability, the lieutenant governor only acts out the duties of governor.PA Constitution article IV, § 13 Should both offices be vacant, the president pro tempore of the state senate becomes governor.PA Constitution article IV, § 14 The position of lieutenant governor was created in the 1874 constitution. Before this, the speaker of the senate would act as governor in cases of vacancy. At first, the lieutenant governor could only act as governor. It was not until the 1968 constitution that the lieutenant governor could actually become governor. The office of governor has been vacant for an extended period of time once. There was a 17-day time period in 1848 between the death of Francis R. Shunk and the swearing in of William F. Johnston. Governors and lieutenant governors are elected on the same ticket. # Governor Took office Left office Party Lt. Governor The office of lieutenant governor was not created until the 1873 Constitution, first being filled in 1875. Terms The fractional terms of some governors are not to be understood absolutely literally; rather, they are meant to show single terms during which multiple governors served, due to resignations, deaths and the like. 7 Thomas Mifflin December 21, 1790 December 17, 1799 None The Federalist Party nominated Mifflin, but he himself carried no party label. None 3 Mifflin was elected governor three times under the 1790 Constitution, having previously been elected once as President of the Supreme Executive Council. 8 Thomas McKean December 17, 1799 December 20, 1808 Democratic- Republican 3 9 Simon Snyder December 20, 1808 December 16, 1817 Democratic- Republican 3 10 William Findlay December 16, 1817 December 19, 1820 Democratic- Republican 1 11 Joseph Hiester December 19, 1820 December 16, 1823 Democratic- Republican 1 12 John Andrew Shulze December 16, 1823 December 15, 1829 Democratic- Republican 2 13 George Wolf December 15, 1829 December 15, 1835 Democratic- Republican 2 14 Joseph Ritner December 15, 1835 January 15, 1839 Anti- Masonic 1 Ritner was the last to serve before the 1838 constitution limited governors to serving six years out of any nine years; that constitution also changed the term to commence the next January from the election, extending Ritner's term by a month. 15 David R. Porter January 15, 1839 January 21, 1845 Democratic 2 First governor to serve under the 1838 constitution. 16 Francis R. Shunk January 21, 1845 July 9, 1848 Democratic Resigned due to illness; he died of tuberculosis only 11 days later. — Office vacant July 9, 1848 July 26, 1848 — — Following Francis R. Shunk's resignation, an interregnum of 17 days occurred before the speaker of the state senate, William F. Johnston, was sworn in. 17 William F. Johnston July 26, 1848 January 20, 1852 Whig As speaker of the state senate, filled unexpired term, and was subsequently elected governor in his own right. 18 William Bigler January 20, 1852 January 16, 1855 Democratic 1 19 James Pollock January 16, 1855 January 19, 1858 Whig 1 20 William F. Packer January 19, 1858 January 15, 1861 Democratic 1 21 Andrew Gregg Curtin January 15, 1861 January 15, 1867 Republican 2 23 John W. Geary January 15, 1867 January 21, 1873 Republican 2 24 John F. Hartranft January 21, 1873 January 21, 1879 Republican None 2 First governor under the 1874 constitution, which prevented governors from succeeding themselves and lengthened terms to four years. Since Hartranft was originally elected under the previous constitution, he was allowed to succeed himself. Hartranft's first term was shortened from three to two years to fit the electoral schedule of the new constitution. John Latta 25 Henry M. Hoyt January 21, 1879 January 16, 1883 Republican Charles Warren Stone 1 26 Robert E. Pattison January 16, 1883 January 18, 1887 Democratic Chauncey Forward Black 1 27 James A. Beaver January 18, 1887 January 20, 1891 Republican William T. Davies 1 28 Robert E. Pattison January 20, 1891 January 15, 1895 Democratic Louis Arthur Watres 1 29 Daniel H. Hastings January 15, 1895 January 17, 1899 Republican Walter Lyon 1 30 William A. Stone January 17, 1899 January 20, 1903 Republican John P. S. Gobin 1 31 Samuel W. Pennypacker January 20, 1903 January 15, 1907 Republican William M. Brown 1 32 Edwin Sydney Stuart January 15, 1907 January 17, 1911 Republican Robert S. Murphy 1 33 John K. Tener January 17, 1911 January 19, 1915 Republican John Merriman Reynolds 1 34 Martin Grove Brumbaugh January 19, 1915 January 21, 1919 Republican Frank B. McClain 1 35 William Cameron Sproul January 21, 1919 January 16, 1923 Republican Edward E. Beidleman 1 36 Gifford Pinchot January 16, 1923 January 18, 1927 Republican David J. Davis 1 37 John Stuchell Fisher January 18, 1927 January 20, 1931 Republican Arthur James 1 38 Gifford Pinchot January 20, 1931 January 15, 1935 Republican Edward C. Shannon 1 39 George Howard Earle III January 15, 1935 January 17, 1939 Democratic Thomas Kennedy 1 40 Arthur James January 17, 1939 January 19, 1943 Republican Samuel S. Lewis 1 41 Edward Martin January 19, 1943 January 2, 1947 Republican John C. Bell, Jr. 42 John C. Bell, Jr. January 2, 1947 January 21, 1947 Republican vacant As lieutenant governor, acted as governor for unexpired term. 43 James H. Duff January 21, 1947 January 16, 1951 Republican Daniel B. Strickler 1 44 John S. Fine January 16, 1951 January 18, 1955 Republican Lloyd H. Wood 1 45 George M. Leader January 18, 1955 January 20, 1959 Democratic Roy E. Furman 1 46 David L. Lawrence January 20, 1959 January 15, 1963 Democratic John Morgan Davis 1 47 William Scranton January 15, 1963 January 17, 1967 Republican Raymond P. Shafer 1 48 Raymond P. Shafer January 17, 1967 January 19, 1971 Republican Raymond J. Broderick 1 49 Milton Shapp January 19, 1971 January 16, 1979 Democratic Ernest P. Kline 2 First governor under the 1968 constitution, and thus eligible to succeed himself. 50 Dick Thornburgh January 16, 1979 January 20, 1987 Republican William Scranton, III 2 51 Robert P. Casey January 20, 1987 January 17, 1995 Democratic Mark Singel 2 On June 14, 1993, Casey transferred executive authority to Lieutenant Governor Singel, and later that day underwent a heart-liver transplant operation. Singel acted as governor until Casey resumed the powers and duties of the office six months later on December 13, 1993. Because Casey never officially resigned, Singel was only an acting governor. 52 Tom Ridge January 17, 1995 October 5, 2001 Republican Mark S. Schweiker Resigned to be Director of the Office of Homeland Security. 53 Mark S. Schweiker October 5, 2001 January 21, 2003 Republican Robert Jubelirer As lieutenant governor, filled unexpired term. 54 Ed Rendell January 21, 2003 January 18, 2011 Democratic Catherine Baker KnollDied in office. 2 Joe ScarnatiAs president pro tempore of the state senate, acted as lieutenant governor. 55 Tom Corbett January 18, 2011 January 20, 2015 Republican Jim Cawley 1 56 Tom Wolf January 20, 2015 January 17, 2023 Democratic Michael J. Stack III 2 John Fetterman 57 Josh Shapiro January 17, 2023 Incumbent Democratic Austin Davis 1 ==Living former governors== , five former governors are alive. The most recent death of a former governor was that of Dick Thornburgh (1979–1987), on December 31, 2020. Name Gubernatorial term Date of birth Tom Ridge 1995–2001 Mark Schweiker 2001–2003 Ed Rendell 2003–2011 Tom Corbett 2011−2015 Tom Wolf 2015−2023 ==Notes== ==References== ;General * ;Constitutions * * * * * ;Specific ==Other websites== * Office of the Governor of Pennsylvania *",
 "title": "List of governors of Pennsylvania"
}