{
 "id": "399535",
 "text": "Mario Party DS is a party board video game for the Nintendo DS. It is part of the Mario Party series of video games. It was released in Japan on November 9, 2006, in North America on November 19, 2006, and in Europe on November 23, 2007. ==Gameplay== Mario Party DS features the same gameplay seen in previous Mario Party games. Players go around on boards to collect coins, which they can use to buy stars. Movement is done with the use of a dice block with the numbers one through ten. After all four players take their turns, a mini-game is played. The player who wins the mini-game wins coins. The winner is the player with the most stars at the end of the game. While most mini-games use the buttons and control pad, others use the console's stylus and microphone. Five boards are in the game. Each board is themed around a character in the game. Eight characters are available for players to play as. == Minigames == There are more than 70 minigames in Mario Party DS. This paragraph will name them all: *4-Player Mini-Games: Goomba Wrangler, Rail Riders, Dress for Success, Camera Shy, Hedge Honcho, Study Fall, Domino Effect, Cherry-Go-Round, Trace Cadets, Soccer Survival, Hot Shots, Call of the Goomba, Pedal Pushers, Roller Coasters Get the Lead Out, Shortcut Circuit Big Blowout, Trash Landing, Cheep Cheep Chance, Whomp-a-thon, Twist and Route, Crater Crawl, Boogie Beam, Parachutin' Gallery, Boo Tag, Dust Buddies, Cyber Scamper, Soap Surfers, Sweet Sleuth, Tidal Fools, Raft Riot, All Geared Up *1v3 Mini-Games: Power Washer, Peek-a-Boo, Fast Food Frenzy Track Star, Shuffleboard Showdown, Flash and Dash, Rubber Ducky Rodeo, Plush Crush, Rotisserie Rampage, Nothing to Luge, Penny Pinchers, Gusty Blizzard *2v2 Mini-Games: Soil Toil, Double Vision, Memory Mash, Cube Crushers, Mole Thrill Sprinkler Scalers, Cucumber Jacks, Hanger Management, Book It!, Airbrushers, Toppling Terror, Crazy Crosshairs, Shorty Scorers *Battle Mini-Games: Cheep Chump, Star Catchers, Short Fuse, Globe Gunners, Chips and Dips *Boss Mini-Games: Feed and Seed, Hammer Chime, Hexoskeleton, Book Bash, Bowser's Block Party ==References== Category:2007 video games Category:Nintendo DS games Category:Mario Party games",
 "title": "Mario Party DS"
}