{
 "id": "399539",
 "text": "Mario Party 8 is a party board video game for the Nintendo GameCube and Nintendo Wii. It is the eighth game in the Mario Party series of video games. It is the fifth Mario Party game for the GameCube, also is first title released for the Wii. The GameCube version was released in North America on May 29, 2006, in Japan on June 15, 2006, in Europe on June 22, 2006 and in Australia in July 11, 2006. The Wii version was released in North America on May 28, 2007, in Europe on June 21, 2007, and in Japan on July 26, 2007. The game was delayed in the United Kingdom after a slur was found in the game. ==Gameplay== Mario Party 8 plays the same as previous games in the Mario Party series. Players go around on boards to collect coins, which they can use to buy stars. Movement is done with the use of a dice block with the numbers one through ten. After all four players take their turns, a mini-game is played. The player who wins the mini-game wins coins. The winner is the player with the most stars at the end of the game. Gameplay is done with the Wii Remote. Six boards are in the game. While some boards have players get stars the same way as in previous Mario Party games, others have different ways. For example, in \"Koopa's Tycoon Town,\" players get stars by putting coins into hotels (like Monopoly). The hotels give stars to the player with the most coins in them. Fourteen characters are available for players to play as. Two characters, Blooper and Hammer Bro, make their first playable appearances in this game. ==Development== Mario Party 8 was developed by Hudson Soft, like all of the other Mario Party games. It was announced in September 2006 as one of several games that Nintendo was going to release for the upcoming Nintendo Wii. The game was later shown off as a demo at E3 2006. The demo only included six minigames. ==Recall and delayed release== The game's launch in the United Kingdom had a lot of problems. The game was scheduled to release on June 22, 2007, but Nintendo delayed the British version to July 13, 2007 because of a \"production issue\". When the game released on July 13, it was then immediately recalled, which means it was removed from stores. In a press release, Nintendo said that the game was recalled because of an assembly error, but some retailers said that it was supposedly recalled because some copies had the word \"spastic\" in them. The word \"spastic\" is considered a very offensive slur against disabled people in British English. Ubisoft had recalled the PSP game Mind Quiz one month earlier because of the same word. The game was eventually re-released in the United Kingdom on August 3, 2007, with a different word used instead. Nintendo said that the price of the game would be the same and the number of copies available would not be affected. ==References== Category:2007 video games Category:Mario Party games Category:Multiplayer and single-player video games Category:Obscenity controversies Category:Party video games Category:Video games developed in Japan Category:Wii games",
 "title": "Mario Party 8"
}