{
 "id": "399685",
 "text": "The Xbox One is the third video game console made by Microsoft, succeeding the Xbox 360. It was announced on May 21, 2013.Xbox One Announced - IGN It was first released on November 22, 2013, ahead of Sony's PlayStation 4. Microsoft marketed the Xbox One as an \"all-in-one entertainment system\", which is where its name comes from. The Xbox One S was released in 2016 as a successor to the original Xbox One model, around the same time that the Xbox 360 was discontinued. The Xbox One S has a smaller form factor and supports both HDR and 4K video. The Xbox One S was praised for its smaller size, visual upgrades, and lack of an external power supply. The Xbox One received another upgrade in 2017: the Xbox One X. The Xbox One X featured upgraded hardware and support for natively rendering video at 4K. The system was succeeded by the Xbox Series X and Series S consoles, which launched on November 10, 2020. At launch the Xbox One was not backwards compatible. However, at E3 2015, Xbox 360 games were announced to be added and in E3 2017, Microsoft announced that they will also add original Xbox games. On August 29, 2017, Microsoft discontinued the original Xbox One in favor of the Xbox One S and X. The Xbox One X and Xbox One S All-Digital Edition were discontinued on July 16, 2020, about the same time when the Xbox Series X series was released, leaving the standard Xbox One S as the only Xbox One model to still be in production. Just like the Xbox One's predecessor, it had its own Kinect. It was announced during the E3 2010 press conference, and was released on November 4, 2010. However in 2017, Microsoft decided to discontinue it and stopped developing on it. ==Model== === Xbox One S === thumb|right|A white Xbox One S The Xbox One S is a newer model of the original Xbox One, announced at E3 2016 and released on August 2, 2016. === Xbox One X === The Xbox One X is the latest model of the original Xbox One. It was announced at E3 2017 and was later released on November 7, 2017. ==History== Microsoft designed the console to originally being Xbox 720 in 2010. However, they decided to change it into Xbox One in 2012. It was released on November 22, 2013, a year after the Wii U and one week after the PlayStation 4. ==Related pages== *Wii U *PlayStation 4 *Nintendo Switch *Xbox *Xbox 360 *Xbox One X *Xbox Series X/S ==References== Category:Xbox",
 "title": "Xbox One"
}