{
 "id": "399963",
 "text": "John Richard Kasich Jr. (born May 13, 1952) is an American politician. He was the Governor of Ohio where he has served from 2011 to 2019. He is a Republican. Before being governor, he served in the U.S. House of Representatives and in the Ohio Senate. ==Early life== Kasich was born in McKees Rocks, Pennsylvania. His mother was of Croatian ancestry while his father was Czech. Kasich attended The Ohio State University and was part of the Alpha Sigma Phi fraternity. While he was in college, he met US president Richard Nixon in the Oval Office after writing a letter to him. ==Early career== He was elected to the Ohio Senate in 1978. He was the second-youngest person to be elected to the state's senate. Kasich was first elected to the United States House of Representatives in 1982. He became known for his role in the balanced budget of the 1990s. He was an advocate of cutting spending to make government work better for less money. He did a lot of work to pass the Goldwater–Nichols Act of 1986. The act reorganized the U.S. Department of Defense. He also worked with Ralph Nader to make less tax loopholes for corporations. In 1998, he was the main force behind the balanced budget that was signed by President Bill Clinton. He ran for president in 2000, but did not succeed. He then hosted a TV show on Fox News for a time. The show was called Heartland with John Kasich. ==Governor of Ohio (2011-2019)== He defeated Ted Strickland in the 2010 Ohio gubernatorial election. Kasich was re-elected in 2014. He got the majority of votes in 86 of the 88 Ohio counties. ==2016 presidential campaign== In April 2015, he announced that he made his New Day For America group. It was a 527 group before it became a super PAC in July.Daniel Strauss, John Kasich super PAC raises more than $11 million , Politico (July 31, 2015). In May 2015, sources close to him said he was \"virtually certain\" to run for the Republican nomination for president. Kasich announced his candidacy for president on July 21 at Ohio State University. He suspended his campaign on May 4, 2016. ==Personal life== He married Karen Waldbillig in 1997. He has two twin daughters, named Emma and Reese. Kasich is a Anglican Christian, and has been one since his parents were killed in a car crash in 1987. ==References== ==Other websites== * Kasich to announce 2016 presidential race plans July 21 * John Kasich for Governor Category:1952 births Category:Living people Category:Governors of Ohio Category:Politicians from Pennsylvania Category:2000 United States presidential candidates Category:2016 United States presidential candidates Category:United States representatives from Ohio Category:Republican Party (United States) politicians",
 "title": "John Kasich"
}