{
 "id": "399918",
 "text": "The fifth generation of video game consoles began in 1993 and ended in 2003. The fifth generation was also called the 32-bit, 64-bit or the 3D generation of video game consoles. Throughout the fifth generation, only three consoles were among the most popular video game consoles in this era. These consoles include, the Sega Saturn (1994), the Sony PlayStation (1994), and the Nintendo 64 (1996). In different parts of the world, console sales varied widely. However, the PlayStation was the best-selling system of the fifth generation. The 3DO, Atari Jaguar, Amiga CD32 and PC-FX and other consoles were also part of this generation. However, those systems were not very successful. The handheld game consoles of the fifth generation were not that successful. The first handheld, Sega Nomad had a lifespan of two years. The Virtual Boy only had less than one year. Both of them were discontinued. Nintendo's Game Boy Color became the best-selling handheld video console of the fifth generation. There were two updated versions of the original Game Boy such as the Game Boy Light (Japan only) and the Game Boy Pocket. The bit ratings of consoles in the 5th generation began to blur & were less of a selling feature than the previous \"bit wars\" of the 8 and 16 bit era. The number of \"bits\" in console names referred to the CPU word size. It had been used by hardware marketers as a \"show of power\" for many years. The fifth generation saw the increase of emulation. The development of the Internet made it possible to save and download tape and ROM images of older games. This led the seventh generation consoles to make many older games available for purchase or download. ==Home systems== ===Comparison=== Name 3DO Interactive Multiplayer Atari Jaguar Sega Saturn PlayStation Nintendo 64 Developer The 3DO Company Atari Sega Sony Nintendo Console Launch prices (USD) US$699.99 US$249.99 US$399.99 US$299.99 US$199 Release date 3 December 1994 Media CD-ROM Cartridge CD-ROM, cartridge (limited, Japan only) CD-ROM Cartridge, (proprietary magnetic disk via Japan- only add-on) Best-selling game Virtua Fighter 2, 1.7 million in Japan Gran Turismo, 10.85 million shipped (as of April 30, 2008) Super Mario 64, 11.62 million (as of May 21, 2003) CPU ARM60 32-bit RISC CPU at 12.5 MHz \"Tom\" (26.6 MHz), \"Jerry\" (26.6 MHz) and a Motorola 68000 (13.3 MHz) Two Hitachi SuperH-2 7604 32-bit RISC processors at 28.63 MHz MIPS R3000A-compatible 32-bit RISC chip running at 33.8688 MHz NEC VR4300 64-bit at 93.75 MHz GPU Two accelerated video co-processors 5 processors contained in 3 chips: \"Tom\", \"Jerry\" and Motorola 68000 Two custom 32-bit video display processors at 28.63 MHz 66 MIPS vector math unit in the main CPU Reality Co-Processor: MIPS R4000-based 8-bit integer vector processor at 62.5 MHz Memory 2MB RAM, 1MB VRAM 2 MB of fast page mode DRAM(4 chips x 512 KB) 1MB SDRAM, 1MB DRAM, 6x 512KB for 3D graphics, 3D frame buffers, 2D graphics, sound, CD subsystem, BIOS ROM 2MB, 1MB VRAM, 512KB sound 4MB (8MB with Expansion Pak) Accessories (retail) * MPEG cards * FZ-EM256 save memory backup unit * Gamegun * Mouse * Arcade Stick * Saturn digital gamepad * 3D controller * Light guns * Multitap (up to 12 players) * Sega NetLink – modem and keyboard * Keyboard * Mouse * 1.44 MB 3.5\" disk drive * DirectLink * Memory card * MPEG cards * RAM expansion cartridges * Multitap (up to 8 players) * Fishing reel controllers (Bass Landing and Reel Fishing) * Dual Analog Controller * DualShock * GunCon * Jogcon * Konami Justifier * NeGcon * PocketStation * PlayStation Mouse * Analog Joystick * Dance pad * LCD screen (for PSone systems only) * Memory card * Link Cable * Controller Pak * Memory Expansion Pak * Rumble Pak * Memory card * Fishing Reel * Transfer Pak * Nintendo 64DD (Japan only) * Microphone * TiltPak System sales (worldwide) 2 million 500,000 9.4 million 102 million 32.93 million ===Other consoles=== Name FM Towns Marty Pioneer LaserActive Amiga CD32 Neo Geo CD PC-FX Apple Bandai Pippin Developer Fujitsu Pioneer Commodore SNK NEC Apple Console Launch prices US$450 ¥89,800, US$970 US$500 US$300 US$250 US$599 Release date Media CD-ROM, 3½-inch floppy disk Laserdisc CD-ROM CD-ROM CD-ROM CD-ROM ;Non-mass-market systems File:Playdia-Console-Set.jpg File:Casio- Loopy-Console-Set.jpg ===Worldwide sales === Console Units sold PlayStation 102.49 million shipped (as of March 31, 2007) Nintendo 64 32.93 million (as of March 31, 2005) Sega Saturn 9.4 million (as of May 4, 2007) 3DO 2 million (as of May 4, 2007) Atari Jaguar 500,000 (as of May 15, 2007) Amiga CD32 100,000 PC-FX <100,000 Apple Bandai Pippin 42,000 (as of May 4, 2007) ==Handheld systems== File:Sega-Nomad-Front.jpg|Sega Nomad Released in 1995 File:Virtual-Boy-Set.jpg|Virtual Boy 1995–1996 File:Gameboy Pocket.jpg|Game Boy Pocket Released in 1996 File:GameCom-Handheld.jpg|Game.com Released in 1997 File:Game Boy Light.jpg|Game Boy Light Released in April, 1998 File:Game-Boy-Color-Purple.jpg|Game Boy Color Released in November, 1998 File:NeoGeoPocketMonochrome.jpg|Neo Geo Pocket Released in 1998 File:NeoGeo-Pocket-Color.jpg|Neo Geo Pocket Color Released in 1999 File:WonderSwan.jpg|WonderSwan Released in 1999 File:Wonderswan color-JD.jpg|WonderSwan Color Released in 2000 ===Milestone titles=== * Crash Bandicoot * Dragon Warrior VII * Final Fantasy VII * Gran Turismo * GoldenEye 007 * Star Fox 64 * The Legend of Zelda: Ocarina of Time\"NP Top 200\", Nintendo Power 200: 58–66, February 2006.\"The Greatest 200 Games of Their Time\", Electronic Gaming Monthly 200: February 2006.\"Top 100 Games of All Time\", Game Informer 36. August 2001. * Metal Gear Solid * The Need for Speed * Nights into Dreams... * PaRappa the Rapper *Perfect DarkPerfect Dark for Nintendo 64 Reviews, Ratings, Credits, and More - MetacriticPerfect Dark - Nintendo 64 - IGNPerfect Dark XBLA Review - IGN * Nintendo's Pokémon titles for the Game Boy * Super Mario 64 * Resident Evil *Silent Hill *Spyro the Dragon * Tomb Raider\"Record- Breaking Lara Croft Battles her Way Into New Guinness World Records\", MCV. January 21, 2010. == References == Category:History of video game consoles",
 "title": "History of video game consoles (fifth generation)"
}