{
 "id": "399948",
 "text": "In Christianity, the Great White Throne Judgment is the time when the dead people who did not live during the 1,000 years that Satan was imprisoned (in the bottomless pit) come back to life and are judged by God according to their works. This judgment is for those people who are not found written in the Book of Life, a book where the names of those who are going to heaven are written, because they believed Jesus to be the Son of God and the promised Messiah & sacrificial Lamb of Jewish scriptures and the prophets of old. Once the judgment has been finished, Death, Hades (translated from ᾅδης in Greek, which was later called Hell), and those who are not found written in the Book of Life will be cast into the Lake of Fire, joining the devil, the beast, and the false prophet (Rev. 20:10). Below, Revelation 20:11-15 is written to show the section of the Bible this judgment appears in. > 11 Then I saw a Great White Throne and the one sitting on it. The earth and > the heavens fled away from His presence, and there was no place found for > them. 12 And I saw the dead, small and great, standing before the throne, > and the books were opened. Another book was opened, which is the Book of > Life and the dead were judged according to their works, which are the things > recorded inside the books. 13 The sea gave up the dead which were in it, and > Death and Hell gave up the dead which was in them: and they were each judged > according to their works. 14 Then Death and Hell were cast into the Lake of > Fire, which is the second death. 15 Anyone not found written in the Book of > Life was cast into the Lake of Fire. According to the Bible, the only way to avoid the Great White Throne Judgment is to believe on the Lord Jesus Christ. As it is written in John 3:17-18 > 17 For God sent not his Son into the world to condemn the world; but that > the world through him might be saved. 18 He that believeth on him is not > condemned: but he that believeth not is condemned already, because he hath > not believed in the name of the only begotten Son of God. Category:Christian eschatology Category:New Testament Category:Afterlife",
 "title": "Great White Throne Judgment"
}