{
 "id": "399965",
 "text": "Martin Joseph O'Malley (born January 18, 1963) is an American politician who was the 17th Commissioner of the Social Security Administration from 2023 to 2024. He was the Governor of Maryland from 2007 to 2015. O'Malley was once a City Councilman and the Mayor of Baltimore. He is a member of the Democratic party. When he was governor, he passed laws legalizing same-sex marriage, saw violent crimes drop by 40%, and worked on immigration issues. O'Malley publicly announced his candidacy for the 2016 presidential election on May 30, 2015, in Baltimore, Maryland, and filed his candidacy form seeking the Democratic Party nomination with the Federal Election Commission on May 29, 2015. He suspended his campaign on February 1, 2016 after poor polling numbers and poor polling in the Iowa caucuses. ==Early life== Martin Joseph O'Malley was born on January 18, 1963, in Washington, D.C. His parents were Barbara (née Suelzer) and Thomas Martin O'Malley. He studied at The Catholic University of America and at the University of Maryland. ==Governor of Maryland== O'Malley decided not to run for governor in 2002. In 2005 after many rumours, O'Malley announced his run for governor. He won the election. He was re-elected in 2010. In April 2007, O'Malley became the first governor to sign legislation entering a state into the National Popular Vote Interstate Compact. In 2011 he signed a law that would make certain undocumented immigrants eligible for in-state college tuition on condition. He signed a law to legalize same-sex marriage in Maryland in 2012. Each law was challenged to a voter referendum in the 2012 general election and upheld by a majority of the voting public. ==2016 presidential campaign== O'Malley publicly expressed interest in a presidential run in 2016 on multiple occasions. At a press conference in Milwaukee, Wisconsin, at a National Governors Association meeting in August 2013, O'Malley stated he was laying \"the framework\" for his campaign. After months of consideration, O'Malley indicated on Twitter that he would announce his candidacy on May 30, 2015, at Baltimore’s Federal Hill Park. On May 30, O'Malley formally announced his candidacy for the 2016 presidential nomination. He dropped out of the race on February 1, 2016 after poor polling numbers. ==Later career== Since his presidential campaign, he has lectured at Georgetown University and Boston College Law School, and written two books about the use of technology in government. In July 2023, President Joe Biden announced he would nominate O'Malley to lead the Social Security Administration, which is headquartered in the suburbs west of Baltimore. His nomination was confirmed on December 18, 2023 by the United States Senate by a 50-11 vote. O'Malley resigned from the Social Security Administration on November 29, 2024, to run for the chairmanship of the Democratic National Committee in 2025. ==Personal life== O'Malley is a Roman Catholic. He married Katie Curran, the daughter of Maryland Attorney General J. Joseph Curran, Jr., in 1990. They have four children. O'Malley is an avid guitarist. ==References== ==Other websites== *Martin O'Malley official campaign site Category:1963 births Category:Living people Category:American guitarists Category:Lawyers from Washington, D.C. Category:American Roman Catholics Category:Mayors of Baltimore Category:Governors of Maryland Category:Musicians from Baltimore Category:Musicians from Washington, D.C. Category:Politicians from Washington, D.C. Category:2016 United States presidential candidates Category:Democratic Party (United States) politicians Category:Lawyers from Baltimore",
 "title": "Martin O'Malley"
}