{
 "id": "400023",
 "text": "Sheikh Hamad bin Khalifa Al Thani (, born 1 January 1952) is the former Emir of the State of Qatar. He was the Emir from 1995 to 2013. Sheikh Hamad was the heir apparent of Qatar between 1977 and 1995. He was lso the Minister of Defense at that time. In the early 1980s, he led the Supreme Planning Council. It sets the economic and social policies for Qatar. In 1992, Hamad worked more on the day-to-day running of the country. This included the development of Qatar's oil and natural gas resources. On 27 June 1995, He took control of the country from his father in a palace coup. Sheikh Hamad was crowned on 20 June 2000. The Emir is famous for helping to create the first Arab international news network, Al Jazeera, when he gave a loan of QAR 500 million ($137 million) to keep Al Jazeera running for its first five years. In late 2012 and early 2013, it was said that the Emir gave money and items to terrorist groups such as Hamas,October 23, 2012 11:03 pm, Qatar emir in landmark trip to Gaza, By Simeon Kerr in Dubai and Vita Bekker in Jerusalem, http://www.ft.com/intl/cms/s/0/0d0bb8de-1cf5-11e2-a17f-00144feabdc0.html#axzz2MxwMs81t Ansar Dine,Is Qatar fuelling the crisis in north Mali? , France 24, Latest update: 23/01/2013 , http://www.france24.com/en/20130121-qatar-mali-france- ansar-dine-mnla-al-qaeda-sunni-islam-doha and the Al-Nusra Front.Editorial, Al Qaeda in Syria, December 10, 2012, https://www.nytimes.com/2012/12/11/opinion/al-qaeda-in-syria.html?_r=0 ==References== ==Other websites== *Official site of His Highness Sheikh Hamad Bin Khalifa Al-Thani *Genealogy of The Al-Thani Dynasty, Page 7 – Website RoyalArk.net *Portrait of His Highness Sheikh Hamad Bin Khalifa Al-Thani *Denver Post article on His Highness Sheikh Hamad Bin Khalifa Al-Thani and his rise to power *Stargate Photo of Sheikh Hamad Bin Khalifa's yacht no. 1 *Constellation Photo of Sheikh Hamad Bin Khalifa's yacht no. 2 * Category:1952 births Category:Living people Category:Prime ministers of Qatar Category:Doha",
 "title": "Hamad bin Khalifa Al Thani"
}