{
 "id": "400155",
 "text": "Mandatory Palestine, sometimes referred to as the British Mandate of Palestine, was a League of Nations mandate to the United Kingdom in Palestine. It began after the British had conquered Palestine from the Ottoman Empire in World War I. At the San Remo Conference, on April 25, 1920, the mandate for Palestine was granted to Britain. The mandate became officially operative on September 29, 1923. The mandate ended when the British returned it to the United Nations on May 15, 1948. The mandate period was characterized by the conflicting nationalist interests and efforts of the Arabs and the Jews in Palestine. Because of the Balfour Declaration, the Mandatory government started off sympathetic to the Zionists. This led to displeasure in the Arab community in Palestine. The conflicting interests often led to violence, making it hard for the British to rule Palestine. Several times commissions investigated the problems in Palestine, and multiple White Papers came out in order to try solving the problems. In 1939 the British changed its position from the Balfour Declaration in favor of the Palestinian Arabs. However, after World War II, the international community pressed for both an Arab and a Jewish state in Palestine. When the British returned its mandate, the state of Israel was declared, on May 14, 1948. On the next day, the Arab-Israeli war began. == History == === Beginning of the Mandate === After the fall of the Ottoman Empire and the end of World War I, a lot of territory of the former Ottoman Empire was left on its own. The Allied nations were worried about this. Western countries believed that these countries needed help until they were able to operate on their own. In 1917 Britain had conquered Palestine, also as a result of the Balfour Declaration in which the British declared their support for creating a “national home for the Jewish people”. Consequently, after the Western powers met in Paris, it was decided France would control the mandate for (present-day) Syria and Lebanon, and Britain would have the mandate for (present-day) Israel, Palestine, Jordan and Iraq. From then on, the British army had an increased presence and ruled in Palestine until there was an official civil governing administration placed on July 1, 1920 as a result of the San Remo Conference on April 25, 1920. In this conference the mandate for Palestine and Trans-Jordan was granted to Great Britain by the main Allied Powers. This mandate was eventually formulated by the League of Nations and officially approved by the League Council on July 24, 1922. At this time, the territory of the Palestine mandate consisted of 15,000 square miles with a population of about one million, of which about 80,000 were Jewish inhabitants. === During the Mandate === ==== 1923-1936 ==== After the mandate was approved by the League of Nations on July 24, 1922, the mandate became officially operative on September 29, 1923. This led to an increase in Jewish immigration, as about 95,510 thousand Jews immigrated to Palestine from 1920–1926. This was also due to the Balfour Declaration. However the Balfour Declaration also had an impact on the Arab nationalists in Palestine. There was a large increase in Palestinian nationalism, due to an increase in Zionist immigration and settlement. Because of this, riots broke out in 1929 between Zionists and Palestinian nationalists. This was in the form of mob violence in the cities, and in the form of assaults against settlers and sabotage of crops and land in the countryside. As a result of these disturbances between the two groups, two commissions were established by the British. One was the Shaw Commission(focused on finding the underlying conditions leading to the violence), and the other one was the Hope-Simpson Commission(whose goal was to create plans to deal with the problems found by the Shaw Commission). The conclusions of these commissions were put into a British ‘White Paper’. This White Paper included plans on how to in increase better economic conditions, and stressed that the British are to treat the Arabs and Jews equally. In 1933 Arab Executive Committee published a manifesto that spoke out against British and Zionist collaboration. In October 1933 the Arab Executive Committee wanted an anti-government demonstration in Jerusalem, which caused an outburst of violence. This led to Jewish and Arab leaders having several meetings in 1934 in an effort to decrease their differences. However, this did not help, as rioting continued until 1936. ==== 1936-1947 ==== In 1936 the Arab Revolt started. There was a lot of rioting and violence. The British government wanted to find out why this happened. Therefore, in 1937 the Peel Commission was created. The Peel commission also had to come up with a “long-term solution”. An important outcome of their research was that Jews and Arabs could not live together in one state. Their solution was that the land of Palestine had to be divided in two parts: one state for the Jews and one state for the Arabs. The Zionists accepted this solution. However, the Arabs did not. The Arabs wanted all of Palestine to be an Arab state. After the conclusions of the Peel commission, Arab violence in Palestine started again. With the growing threat of a second world war, the British needed to focus their attention on other places. For that they needed peace and quiet in Palestine. However, because of the Arab uprising, it was difficult for the British to keep the order. Therefor, in 1939 the Mandatory government published a new White Paper to meet Arab demands. It basically said that “Palestine was to remain Arab, and there would be no Jewish state”. This meant that the British had changed their position from the findings of the Peel Commission. During the Second World War, the Yishuv joined the British to fight the Axis Powers. For the time being they moved their resistance toward the 1939 White Paper to second priority. After the war the British government intended to keep themselves to the 1939 White Paper. This meant that only a small number of Jews were allowed to migrate to Palestine. However, there were a lot of Holocaust survivors stuck in Europe who wanted to come to Palestine. When the United States spoke out their support to give a 100.000 Jews permission to go to Palestine, the British were in a difficult position. For various reasons, they needed to stay friendly with the United States. On the other hand, giving 100.000 immigration certificates would most likely lead to Arab violence in Palestine. Now it was the Jews who caused most unrest in Palestine. In their anger over the British refusal to let more holocaust survivors enter Palestine they committed terrorist attacks. === The end of the Mandate === After an Anglo-American Commission did not give the British a solution, the British government decided on February 14, 1947 to give their mandate back to the United Nations. The United Nations then set up the United Nations Special Committee on Palestine. This committee advised a partition of Palestine into a Jewish state and an Arab state. On November 29, 1947 the General Assembly of the United Nations voted to end the British mandate and to set up a Jewish state and an Arab state in Palestine. The British decided to end the mandate on May 15, 1948. In the afternoon of May 14, 1948 the State of Israel was declared in Tel-Aviv. == References == == Sources == * Gelvin, James L. The Israel-Palestine Conflict: One Hundred Years of War. New York: Cambridge University Press, 2014. * Gilbert, Martin. Israel: a History. London: Doubleday, 1998. * Lockman, Zachary. Comrades and Enemies: Arab and Jewish Workers in Palestine, 1906-1948. Berkeley: University of California Press, 1996. * Morris, Benny. 1948: a History of the First Arab-Israeli War. New Haven: Yale University Press, 2008. * Shapira, Anita. Israel: a History. Waltham: Brandeis University Press, 2012. * Tessler, Mark A. A History of the Israeli-Palestinian Conflict. Bloomington, IN: Indiana University Press, 2009. * Upthegrove, Campbell L. Empire by Mandate. New York: Bookman Associates, 1954. Category:20th century in Jordan Category:Former colonies in Asia",
 "title": "Mandatory Palestine"
}