{
 "id": "400371",
 "text": "Richard More (circa. 1614–1696) was a passenger on the Mayflower in 1620. He became a sailor and later a ship captain. He saved at least one colony from starvation and helped to keep the colonies prosperous by trading goods to and from England and the West Indies. He fought sea battles against the French in 1664.Donald F Harris, PhD., The More Children of the Mayflower, Part III, The Mayflower Descendant, vol. 44, no. 2 (July 1994), pp. 110, 111 Richard and his siblings were taken from their mother and given to the care of Mayflower passengers as indentured servants. Only Richard survived and lived a long and prosperous life.Anthony R. Wagner. The Origin of the Mayflower Children: Jasper, Richard and Ellen More, (Boston: The New England Historical and Genealogical Register, July 1960), vol. 114, p. 163-168Donald F Harris, PhD., The More Children of the Mayflower, Part III, The Mayflower Descendant, vol. 44, no. 2 (July 1994), p. 20 Richard has descendants that can be traced to present day.Robert Moody Sherman, CG, FASG, Robert S. Wakefield, FASG, Lydia Dow Finlay, CALS. Mayflower Families Through Five Generations: Family of Richard More (General Society of Mayflower Descendants Published 1997), vol. 15, pp. 151-155 == Mayflower voyage == The More children travelled as indentured servants to 3 of the Mayflower Pilgrims. Ellen, age 8, was assigned to Edward Winslow. She died soon after the ship landed.William Bradford. History of Plymouth Plantation by William Bradford, the second Governor of Plymouth (Boston: 1856), pp. 447, 451 Jasper, age 7, was a servant of John Carver. Jasper died in December of 1620 while the Mayflower was in Harbor. He was buried ashore in what is now the Provincetown area. There is a memorial with his name and that of four others who also died at sea or while the ship was anchored at Cape Cod Harbor in November and December of 1620. Mary, age 4, died soon after the ship landed. Richard resided with the William Brewster family until about mid-1627.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth (Boston: 1856), p. 447 The 3 children died of something that was called the ‘common infection’ because so many people died of the same illness. Only Richard survived. More and his sisters and brother left Plymouth, England on 16 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower reached land at Cape Cod hook. They landed on 21 November. They wrote the Mayflower Compact, which made rules on how they would live and treat each other.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 413George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. The Mayflower was supposed to land in Virginia Colony, but the ship was too damaged and they were forced to land at Cape Cod now called Provincetown Harbor.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 20.George Ernest Bowman, The Mayflower Compact and its signers (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7-19.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 411-413 == More's life in the New World == More was 6 when the Mayflower landed at Plymouth Colony. When he stepped on land, he worked with all of the others to help gather supplies for food and shelter and to bury the dead.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth (Boston: 1856), p. 91 In the spring of 1621, he attended the first Thanksgiving.Edward Winslow, \"Primary Sources for The First Thanksgiving at Plymouth Mourt's Relation. Pilgrim Hall Museum. Retrieved 2009-11-26. Nothing is known of More during the years he lived with the Brewster family from 1620 to 1627, except that his name is on a document giving adults cattle and other livestock.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 180 More was working for Isaac Allerton in 1628. Allerton traded goods and supplies over long distancesDonald F Harris, PhD., The More Children of the Mayflower, Part III, The Mayflower Descendant, vol. 44, no. 2 (July 1994), p. 4Nathaniel Philbrick, Mayflower: A story of Courage, Community and War (New York: Viking 2006) p. 26 He fished near Plymouth and Maine. Later he became captain on the ships that supplied the new American colonies.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 179 By early 1642, More joined the Salem church. As a member of this Church he would be allowed to give his opinion and to vote on important matters in Salem.Richard D. Pierce, The Records of the First Church in Salem Massachusetts, 1629-1736, p.171 By the age of twenty-four, More was a captain of his own small ship and traded with the colonies, the West Indies, and England. He moved to Salem Neck Massachusetts and set up his own fishing stand.Robert Charles Anderson, The Great Migration Begins: Immigrants to New England 1620-1633 Great Migration Study Project. New England Historic Genealogical Society (Boston 1995), vol II., G-O, p. 1284 Drinking water was scarce so More dug a well for himself but allowed all others to use it. He traded tobacco and other merchandise and supplies with Virginia and the West Indies, and made voyages to England. More took part in sea battles against the French in 1664. They were trying to prevent the early colonist from fishing and trading goods and supplies that the colonists needed to live. This was in an area called the Hudson River region. In 1654 More also was in another Naval battle against the French at Port Royal, Virginia.Robert Moody Sherman, CG, FASG, Robert S. Wakefield, FASG, Lydia Dow Finlay, CALS Mayflower Families Through Five Generations: Family of Richard More (Pub. General Society of Mayflower Descendants 1997), v. 15. p. 152 More rescued the colonists at the new colony at Cape Fear, North Carolina in 1665.. The people there were dying because they had no food and not enough clothes to keep them warm. The waters around Cape Fear were (and still are) very dangerous for ships yet More brought a shipment of food and supplies to aid them when other captains failed or refused to try.Robert Charles Anderson, The Great Migration Immigrants to New England, 1634-1635(FASG Published 1995) Richard and his wife Christian Hunter More had 7 children: Samuel, Thomas, Caleb, Richard Jr., Joshua, Susanna, and Christian. Robert Moody Sherman, CG, FASG, Robert S. Wakefield, FASG, Lydia Dow Finlay, CALS. Mayflower Families Through Five Generations: Family of Richard More (General Society of Mayflower Descendants Published 1997,) vol. 15, p. 156 Christian More died March 18, 1676 in Salem.Donald F Harris, PhD., The More Children of the Mayflower, Part III, The Mayflower Descendant, vol. 44, no. 2 (July 1994), vol. 44, no. 2, p. 4 == Death and burial == More died in 1696. His gravestone gives his age as 84, but he did not know his exact birth date.Donald F Harris, PhD., The More Children of the Mayflower, Part I, The Mayflower Descendant, vol. 43, no. 2 (July 1993)(quoting from Mayflower Quarterly of Feb. 1972)Charles Edward Banks. The English Ancestry and Homes of the Pilgrim Fathers (Grafton Press N.Y. 1929) P. 72 More lived longer than any other male passenger of the Mayflower.Edwin A. Hill, PhD., The English Ancestry of Richard More of the Mayflower, The New York genealogical and biographical record, (July 1905), vol 36, p. 213 He is buried in the Charter Street Burial Ground in Salem, Massachusetts. He is the only Mayflower passenger to have his gravestone where it was originally placed sometime in the mid-1690s. Also buried nearby in the same cemetery were his two wives, Christian Hunter More and Jane More. In recent years, More's metal spoon was found during the excavation of the original Plymouth Colony site. His initials were carved into it.David Lindsay, PhD., Mayflower Bastard: A Stranger amongst the Pilgrims, (New York: St. Martins Press, 2002), pp 82-83; 226 note 11 == References == Category:Mayflower passengers Category:1614 births Category:1696 deaths Category:People from Shropshire",
 "title": "Richard More"
}