{
 "id": "40068",
 "text": "Ejaculatory ducts (Latinː ductus ejaculatorius, as plural: ductus ejaculatorii) are a pair of ducts (each male has two of them) in the body of man. They are a part of the human male anatomy and reproductive system and act like a reservoir to move mature sperm (spermatozoa) closer to the urethra, out of the body. Females do not have ejaculatory ducts but they do have similar features in their anatomy called the urethral dorsal wall. Each ejaculatory duct is about 2 cm in length. Testosterone is required for them to develop, not regress (as a fetus). They get closer to each other and both get smaller towards the end of the duct where they combine or fuse together. This is likely because of apoptosis locally (close) to the urogenital sinus during fetal development. The purpose of the ejaculatory ducts is to transport mature sperm to the urethra during ejaculation. It does this by having smooth walls, with protection from the anatomy surrounding it. Gravity is a useful force in the body, and the middle of the tract being thinner than it is at the ends, making it so that it can secrete sperm into the urethra, is another useful (to the body) part of physics. It opens up into the prostatic urethra and secrets from the hole. The ducts secrets from both sides on the prostate wall which in total is around 6 mm long and covered in glandular holes. There are lots of ducts in the part of the urethra, with some clusters of them, which secrete into the vesicle and out the penis. It is formed as a normal part of fetal development, made at the same time as the epididymis, seminal vesicles and vas deferens (and trigone), they are thought to come from the mesonephric ducts (Wolffian duct system), during fetal development. Apoptosis happens (occurs) to establish entry points into the prostate, where the ureters and the mesonephric ducts (which the ejaculatory ducts form from) have one each. The ducts go into the vesicle on both sides of the prostatic utricle. In the past, it was thought that the mesonephric ducts gave mesonephric epithelium to the bladder during development, but recently they found that it is probably not the case. Instead, it is the urogenital sinus (which forms from the endoderm) in the trigone region which forms the epithelium of the bladder. The ejulatory duct shows histochemical traits. These make it different from the rest of the prostate, which comes from the urogenital sinus. Obstruction (blockage) of the ducts is rare, but may cause low sperm count (oligospermia) or azoospermia (also known as lazy sperm). Imaging can detect obstruction and can also measure the size of the seminal vesicles, usually with Magnetic Resonance Imaging (MRI). Doing so helps in the diagnosing and treatment of conditions. The size of the inside (luminal size) is a sign of dilation or obstruction of the ejaculatory ducts if they are wider than 2.3 mm. == Central zone == The central zone, where the ejaculatory ducts and vas deferens are, is rarely affected by any disease. However cysts can form on the ejaculatory duct, and are caused by injury, surgery, or obstruction. The central zone is a cone- shaped zone in the genital area of the body. It includes the ejaculatory ducts, bladder, and the urethral tract pre-prostatically (prostatic means until the tract reaches the prostate), with the bottom (apex) of the zone being at the verumontanum. The central zone has its own membrane called the urothelium, used only in the urogenital area. The bladder and organs in the zone are lined with the urothelial membrane, also called the transitional epithelium. It is stratified (made of 2 - 3 (when resting) or 5 - 7 (with a full bladder) layers of cells, which have a striped appearance). It is called transitional epithelium because it can easily change shape, which is useful for the bladder. Out of the central zone, which is below the ejaculatory ducts, the epithelium becomes intermittent epithelium, and then columnar and stratified or pseudostratified epithelium. While infections in the central zone are uncommon, there are many urinary tract infections that might happen in the urogenital system, and they often do. The two systems both have their own epithelium and are separated this way. The ejaculatory duct is the seminal vesicle joined with the vas deferens to then give sperm maturing in the epididymis a path to the urethra. The area needs to be separated (have their own membranes) the outside anatomy from the urinary system, tubules, and contents. This relationship between the membranes is important in keeping the central zone free of disease. The separation between the two membranes is the main reason why UTIs do not affect the ejaculatory ducts as often as they do the urogenital system. And the separation of the two systems allows problems from within the bladder and urinary tract to not affect the ejaculatory ducts, or anywhere before it.The smaller size at the ends of the duct, which is bigger in the middle, also helps with preventing disease. The central zone includes the inside of the bladder and urethra. This means they are lined with the urothelial membrane, which does not allow disease to spread (especially to the central zone). For the bladder, this means urine does not go back into the body which further prevents the spread of disease. == Function == During ejaculation, motile (can move) sperm in the epididymis go towards the body, through the spermatic cords and vas deferens, and into the ejaculatory duct. The ejaculatory duct takes the sperm to the prostate where it it further taken through the body (prostate) to the membranous urethra. The ejaculatory ducts walls to the prostate are smooth as to allow liquids to pass through them, like other urogenital vessels and the prostate. They are wider at the ends which show (giving the appearance of ducts) to the inside of the prostate, allowing liquid to fall in easier. Water in sperm helps with the lubrication after the ejaculatory duct, with the female vagina secreting a mucus from the paraurethral gland (also called Skene's gland) to aid in lubrication (with mucus and urine) for the vagina. There is no female prostate, but the function of Skene's gland (the correct nomenclature) is the same. Because it is homologous, the Skene's gland has been called the \"female prostate\". The clitoris is similar in this way too. In males, semen (which is 96 to 98 percent water) is secreted and leaves the penis as a mix of other fluids and sperm if the ejaculatory duct is working. Mucus-secreting cells are common in the penile urethra area, which is below the prostate, sometimes in clusters. If the prostatic reproductive system is free from disease, obstruction, and leakage, then it can transport semen safely to the prostate and do its job. Once semen from the functional reproductive system leaves through the penile urethra it is out of the body. While the ejaculatory duct is secreting into the prostatic urethra and out of itself (i.e. without obstruction) it is functioning properly. If not it might cause signs and symptoms. The role that it has is in the pre-prostatic system, and is transporting semen into the membranous urethra, which comes after the prostate (it is prostatic). After that, it is the job of the urethra to eject liquids out of the body. The ejaculatory duct also causes the reflex action of ejaculation. It is connected to a lot of nerves and has a blood supply (of numerous vessels) in the prostate, which enter (or penetrate) the prostate from outside like other vesicles. There are a lot of nerves close to (and even touching) the prostate, including one bundle of nerves. While it is not their function, the ejaculatory ducts help to identify where the location of the prostate is, relative to other autonomy. This can be helpful in prostate-related medical imaging or procedures. == Conditions == Obstructions and cysts can happen in the ejaculatory duct and make it not function as it could. These are some conditions which might happen with the organ (pathology). This may cause symptoms. Ejaculatory duct obstruction is the cause of cysts, as well as trauma, surgery, or it might be congenital. The conditions (both rare) mentioned are the ejaculatory duct: === Obstruction === Although rare it is still thought to be undiagnosed. Obstruction of the ejaculatory duct is known as EDO (abbreviation). Obstruction can cause lower sperm counts, \"lazy sperm\" (or \"slow swimmers\"), no sperm (e.g. during orgasm), and rarely, infertility. It may cause pain during ejaculation, or pain to get worse especially while ejaculating, like a kidney stone or other obstruction of the urethra does during urination. The pain might radiate (be felt at) the pelvis or lower back (lumbar, sacral), prostate, or scrotum. Pain is often felt in the perineum. In around 5% of men that are infertile, ejaculatory duct obstruction is the cause. Surgery for obstruction removal (which can improve fertility) is sometimes an option or so is surgical sperm retrieval. The obstructions may be partial or complete. The cause of ejaculatory duct obstructions is acquired or genetic. The person was either born with, or developed with an obstruction (it is congenital) or got it later on in life. Congenital causes involve fetal trauma (getting hurt while in the womb) or differences in anatomy or development. Atresia (the not opening up (shunting) of passages in development or birth) is a common cause of congenital ejaculatory duct obstruction from development. In later life the ducts might be obstructed because of iatrogenic procedure, trauma to the urethra, or come secondary to a urogenital infection. There are a lot of procedures that work well to image the ducts. MRI can be used to measure the size and dilation of the seminal vesicles. The scan is most useful when there are cysts involved In the past, fluoroscopy was used to find obstructions in the time was the imaging method of choice. Ultrasound and MRI is preferred as it is less invasive however. The gold standard and preferred method of imaging is a type of ultrasound. Specifically it is transrectal ultrasound (and it is the \"mainstay,\" which means preferred. The images taken during the procedure can assess the ability and function of the ejaculatory duct as well as checking them for blockages. On the image they are looking at: * seminal vesicle dilatation and if the width is more than 15 mm * the ejaculatory duct above the obstacle and how swollen, inflated, or inflamed (distended) the tract is there * prostate midline cystic lesions (in the middle of the prostate line to the urethra) * stones or calcification inside the ejaculatory ducts or the verumontanum A luminal dilation of 2.3 mm or more in the ejaculatory duct is a sign that it is dilated or obstructed. === Cyst === Ejaculatory duct cysts usually are in the prostate when small. They can extend up towards the head when large, from above the verumontanum and upwards in the direction the prostatic base. They happen because of ejaculatory duct obstructions. Magnetic resonance imaging is used, which finds round or oval legions in the area affected if they are present. The legions in the prostate prostatic gland are in the middle or slightly off-center. They usually start above the verumontanum and then extend into (the base of) the prostate. Obstructions cause ejaculatory duct cysts. They can be congenital (developing during birth or born with), or acquired, where they are gotten later on in life such as from inflammation or a urogenital infection. == Imaging == MRI is a useful tool to see and image the inside the body. MR Imaging (Magnetic Resonance Imaging) of the seminal vesicles before and after ejaculation shows the seminal vesicle get smaller after ejaculation in the majority of patients. Blood (serum) levels of testosterone and prolactin have been linked to the size of the seminal vesicles, where more testosterone/prolactin means they are on average bigger. These studies show the ability of the machine in determining the size of the seminal vesicles and the benefit of the diagnostics it provides. The ejaculatory ducts do not show up well on MRI 3D scans (T2 weighted, which shows water as bright, and they used sequence iii for the scan) but in one 2D image saw the vas deferens did not change size with ejaculation. This study, which saw the vas deferens not change shape, noted the seminal vesicles get smaller immediately after ejaculation, by up to 40%. The vesicles are seen to contract and secrete up to 70% of the seminal fluid stored in them during ejaculation. However the volume of the prostate did not change. The size changes and they get smaller because they have contracted and squeezed out their contents. The ampullae of the vas deferens is a canal (the same as the ejaculatory duct) which joins with the spermatic cord to form the ejaculatory, and it squeezes to move semen down the vesicle into the next part which is the duct. == Anatomy == The ejaculatory ducts are the ampulle of the vas deferens (ampullæ of ductus deferentes in Latin) connected (fused) to the duct of the seminal vesicle (the vesiculæ seminales), which happens as the vas deferens enters the prostate. They are then the ejaculatory duct. Two small openings of the ducts are on both sides of the prostatic utricle (found inside the prostate), which covers upwards and down in the prostate. It is a wall about 6 mm long and has a lot of holes in the mucous membrane for glands to secrete through and into the tube. The wall is made of fibrous tissue (microfibres) and muscular fibres (muscle) and as well as mucous membrane, where the holes are. They secrete from there into the prostatic urethra. There are a lot of holes for ducts and glands in the urethral vesicle. The back side (the posterior) of the prostate near the ejaculatory duct is flat on its surface, with a small dent (a depression) on the top and near the bladder (or superior juxtavesical), for where the (two) ducts penetrate it. Juxtavesical is the part of a vesicle that is nearer to the bladder. The penetration is into the line below the urethral vesicles. The ejaculatory duct goes through the prostate for 5-6 mm. The part of the urethra that carries semen also goes through the prostate. The tube gets thinner in the middle of the prostate than it is at the ends, where it leaves. This gives the appearance of ducts. These might change shape more, from old age, and produce conditions (health problems) in the person. The ejaculatory ducts start posterior (behind) to the prostate at the base, near the median and lateral lobes. This is near the vas deferens. The ejeculatory ducts and urethra go across the prostate before entering. The ejaculatory duct runs across the prostate for 10-15 mm, on the bottom and in front (inferoanterior) of the prostate before entering. The urethra enters from the anterior (front) of the prostate and usually passes through its anterior and middle thirds, which are sections of the prostate. The urethra going through the prostate is the prostatic urethra. The ejaculatory ducts extend from the prostate once inside and go towards the outside area of the urethra and skeletal tissue. These vessels go towards the urethra so they can empty contents out of the body. They extend to the verumontanum (the seminal colliculus) from the openings of the ejaculatory ducts. These are next to the seminal vesicles. They go through the prostate, which is covered in nerves. In the subepithelial tissue, nerves with Neuropeptide Y, and vasointestinal polypeptide (VIP), reach the smooth muscle and walls of blood vessels in the prostate. Near to the prostate are multiple nerve bundles of autonomic nerves, which are very near but can be separated from the prostate. The nerve bundle near to the ejaculatory ducts supplies them, as well as supplying the prostate, seminal vesicles, prostatic urethra (the part inside of the prostate), membranous and penile urethra (parts before and after the prostate), corpora cavernosa, corpus spongiosum, and bulbourethral glands. This part of the body, because it is closely surrounded by nerves, can be affected by invasive surgery. The nerves might become damaged and cause impotency (loss of ability to ejactulate or get an erection). Damage to the nerves here might cause the prostate to have to be scarified in order to relieve pain and symptoms. In fetal development, testosterone is required for the ejacultory ducts to form. This is why in females they do not grow (they regress). Urothelium lines the bulbourethral glands, ducts of the prostate, the seminal vesicles, vasa deferentia, and ejaculatory ducts as one piece and is separate from other epithelium. The epithelium here is called the transitional epithelium as well as urothelium. It is called transitional because it can change shape easily, which is useful for the bladder. Urothelium is another name for it. Urothelium protects the reproductive system and body from toxic things which might be going through the urethra. The relationship between the joined together protective coatings and their membranes is important in preventing the spread of infection and disease to the central zone. The urothelium lines the membranous urinary tract before the prostate, the bladder, and the inside of the bladder and ureter, and the vessels near the prostate. The membrane is stratified. It extends from the collecting ducts of the kidneys, inside the bladder and tubules, to the ejaculatory duct, and then below the duct it becomes transitional epithelium before it changes form again. The epithelium it changes to until the end (distally) of the penis is the pseudostratified columnar epithelium (of the membranous penis and most of the penile urethra). Urothelium lines the inside of the urethra and bladder. The third type of epithelium in this area (urothelium, seminiferous epithelium) is the membrane surrounding the rectal area, and is the furthest away from the reproductive area and urothelial membrane, being in in-front-and-on-top-of (superoanterior) the rectum and blanketing the area. The rectal membrane is simple columnar epithelium. The other types of lining are used only in the urinary tract and do not go near the ejaculatory ducts. The three layers of the urothelial membrane sit on top of the bladder connected with the basement membrane. It covers the ejaculatory duct as a part of its area and are all one piece. The urothelial membrane is where ejaculatory duct cysts form in the rare cares that they do. The seminiferous tubules are lined with an epithelium called seminiferous epithelium. The urothelial membrane is stratified, which means it is made up of multiple cells (in the intermediate layer it is 2 - 3 layers of cells when resting, and 5 - 7 layers with a full bladder, and goes back to its normal shape after in a healthy system) and is made up of 3 layers. It is also called the transitional epithelium. The name is because it can change shape easily. The stratified cells have their own nucleus. There are other types of membranes in other areas made of epithelial cells, some specialized (for example in the pancreas). The urothelial membrane goes from the bladder to where the ejaculatory ducts reach the prostate. Below the ejaculatory ducts the epithelium becomes intermittent epithelium, then columnar and stratified or pseudostratified. Other cells on top of the basement membrane (the epithelial layer) do have their own nucleus. The apical layer (top layer) has cells which often have two nuclei. == Related pages == * Prostate * Skene's gland * Vas deferens and seminiferous tubule == References == Category:Anatomy of the male reproductive system",
 "title": "Ejaculatory ducts"
}