{
 "id": "400604",
 "text": "The Junior Eurovision Song Contest 2004 was the second Eurovision Song Contest for young singers aged 8 to 15. It was held on 20 November 2004, in Håkons Hall, Lillehammer, Norway and lasted 2 hours and 15 minutes. The theme of the competition was \"Bright Nordic Winter Nights\". The show was presented by Stian Barsnes Simonsen and Nadia Hasnaoui. It was broadcast in 20 countries and viewed by 100 million people. Eighteen countries participated, including France and Switzerland who participated for the first time. Originally 20 countries had applied to take part in the competition, but Germany and Israel later withdrew. Spain, the United Kingdom and Croatia won the top three places, the same three countries as last year. ==Results== Draw Country Language Artist Song English translation Place Points 01 Greek Secret Band \"O palios mou eaftos\" (Ο παλιός μου εαυτός) My old self 9 48 02 English Young Talent Team \"Power of a Song\" — 12 14 03 Dutch Klaartje and Nicky \"Hij is een kei\" He's the best 11 27 04 Italian Demis Mirarchi \"Birichino\" Cheeky 16 4 05 Norwegian @lek \"En stjerne skal jeg bli\" I'm gonna be a star 13 12 06 French Thomas Pontier \"Si on voulait bien\" If we really wanted to 6 78 07 Macedonian Martina Siljanovska \"Zabava\" (Забава) Party 7 64 08 Polish KWADro \"Łap życie\" Grab life 17 3 09 Greek Marios Tofi \"Onira\" (Όνειρα) Dreams 8 61 10 Belarusian Egor Volchek \"Spiavajce sa mnoju\" (Спявайцэ са мною) Sing with me 14 9 11 Croatian Nika Turković \"Hej mali\" Hey little boy 3 126 12 Latvian Mārtiņš Tālbergs & C-Stones Juniors \"Balts vai melns\" White or black 17 3 13 English Cory Spedding \"The Best Is Yet to Come\" — 2 140 14 Danish Cool Kids \"Pigen er min\" The girl is mine 5 116 15 Spanish María Isabel \"Antes Muerta que Sencilla\" Better dead than plain 1 171 16 Swedish Limelights \"Varför jag?\" Why me? 15 8 17 French Free Spirits \"Accroche-toi\" Hold on 10 37 18 Romanian Noni Răzvan Ene \"Îţi mulţumesc\" Thank you 4 123 ==Score sheet== Results Total Score Contestants Greece 48 12 1 2 1 3 12 3 5 1 2 6 Malta 14 2 3 4 4 1 Netherlands 27 3 3 1 1 3 1 5 2 1 7 Switzerland 4 4 Norway 12 7 5 France 78 6 1 5 6 2 2 4 4 6 4 7 2 6 8 4 8 3 Macedonia 64 6 6 5 5 4 5 3 8 3 3 5 3 3 3 2 Poland 3 2 1 Cyprus 61 12 8 3 1 6 4 5 2 8 1 5 1 5 Belarus 9 1 3 1 4 Croatia 126 4 8 8 10 8 12 7 6 8 8 12 8 6 8 6 7 Latvia 3 2 1 United Kingdom 140 5 10 12 7 6 6 5 10 5 10 7 10 10 10 7 10 10 Denmark 116 7 5 7 3 12 5 8 8 7 5 6 4 10 7 10 4 8 Spain 171 10 7 10 12 8 12 10 12 10 7 12 6 7 12 12 12 12 Sweden 8 4 1 3 Belgium 37 3 4 4 7 4 2 2 2 2 1 4 2 Romania 123 8 2 10 7 10 7 6 8 12 10 12 6 2 12 6 5 === 12 points === Below is a summary of the maximum 12 points each country awarded to another: N. Recipient nation Voting nation 8 Belgium, Croatia, Denmark, France, Poland, Romania, Sweden, Switzerland 3 Belarus, Latvia, Spain 2 Macedonia, United Kingdom Cyprus, Malta 1 Greece Norway Netherlands ==Commentators== * - Angela Groothuizen (Nederland 1) * - Roman Kilchsperger (SF2), Marie-Thérèse Porchet (TSR 2), Claudio Lazzarino & Daniele Rauseo (TSI 1) * - Elsa Fayer & Bruno Berberes (France 3) * - Matt Brown (ITV2) * - Fernando Argenta (TVE1) * - Ilse Van Hoecke & Marcel Vanthilt (VRT TV1), Jean-Louis Lahaye (RTBF La Deux) * - Leonard Miron (TVR1) * - TBC (TVP1) ==References== ==Other websites== * Official Site * Lyrics of Junior Eurovision 2004 entries at ESCKaz.com ===Artists' websites=== * Official site of Noni Razvan Ene * Official site of Cory Spedding * Official site of Nika Turkovic * Official Website of Marios Tofi Category:2004 in music Category:2000s in Norway Category:Junior Eurovision Song Contest by year Category:2004 in Europe",
 "title": "Junior Eurovision Song Contest 2004"
}