{
 "id": "400954",
 "text": "The civil rights movements was a series of worldwide political movements for equal civil and political rights. Many times in history, people have used nonviolence to show that they are equal without hurting anybody. Other times were more violent with people who began to rebel against others. Many of these movements did not fully achieve their goals. However, many of them helped make steps toward equality. The main goal of the civil rights movements is that all people's rights are equally protected by the law, including the rights of minorities. Civil rights movements are different from each country. The LGBT rights movement, Women's rights movement, and many racial minority rights movements are still continuing to fight for equal rights. == Africa == === Angola === The Angolan War of Independence was fought from 1961 to 1975. Angola fought against Portugal. Portugal was making people in Angola farm cotton. Three different groups in Angola were against Portugal. Millions of people died during the war.The Decolonization of Portuguese Africa: Metropolitan Revolution and the Dissolution of Empire by Norrie MacQueen - Mozambique since Independence: Confronting Leviathan by Margaret Hall, Tom Young - Author of Review: Stuart A. Notholt African Affairs, Vol. 97, No. 387 (Apr., 1998), pp. 276-278, JSTOR === Guinea === Before 1974, the Portuguese Empire also controlled Portuguese Guinea. From 1963-1974, in the Guinea-Bissau War of Independence, the people in Guinea fought for their independence. In 1974 they won, and formed the independent country of Guinea-Bissau. === Mozambique === The Mozambican War of Independence was fought from 1964 until 1975. It was fought between Portugal, which controlled Mozambique; and the Mozambique Liberation Front or Frelimo (). The Portuguese won the conflict, using guerrilla soldiers. However, because of a coup d'état in Portugal, Mozambique became independent on June 25, 1975. == Ireland == In Northern Ireland, the Campaign for Social Justice was formed in Belfast in 1964. Next the Northern Ireland Civil Rights Association was formed. These groups wanted to: * Repeal Special Powers Acts of 1922, 1933, and 1943 * End B Specials police force * End gerrymandering of local elections * End discrimination in housing and government jobs These demands for reform caused a backlash by some in the unionist majority. This caused The Troubles to start. The Troubles were a civil war that lasted for more than 30 years. They used the same methods used by the American Civil Rights Movement: nonviolent marches, pickets, sit- ins, and protests. The first civil rights march in Northern Ireland was held on 24 August 1968 between Coalisland and Dungannon. == United States == ===Segregation=== Segregation was an attempt by white Southerners to separate the races. They did this to strengthen white pride and to be more powerful over African Americans. Segregation was often called the Jim Crow system. Segregation became common in Southern states after the end of Reconstruction in 1877. Reconstruction followed the Civil War (1861-1865). During Reconstruction, Republican governments in the Southern states were run by black people. The Reconstruction governments had passed laws opening up economic and political opportunities for black people. However, by 1877, the Democratic Party had gained control of government in the Southern states. These Southern Democrats wanted to reverse black advances made during Reconstruction. To that end, they began to pass local and state laws that said certain places were \"For Whites Only\" and others for \"Colored\". Black people had separate schools, transportation, restaurants, hospitals, and parks. Usually, they were not as good as the white-only places. Over the next 75 years, Jim Crow signs went up to separate the races in every possible place. The system of segregation also included not letting African-Americans vote (this is called disfranchisement). Between 1890 and 1910, all Southern states passed laws that made it difficult or impossible for black people to vote. For example, some laws said a person had to be able to read and write in order to vote. A lot of black people had no access to education and property ownership. Because black people could not vote, they were powerless to prevent whites from segregating all aspects of Southern life. They could do little to stop discrimination in public places, education, economic opportunities, or housing. Conditions for black people in Northern states were somewhat better. Black people were usually free to vote in the North, but there were so few of them that their voices were barely heard. Segregated facilities were not as common in the North. Black people were usually denied entrance to the best hotels and restaurants. Schools in New England were usually integrated (with black and white students together). However, those in the Midwest generally were not. ===Montgomery Bus Boycott=== On December 1, 1955, Rosa Parks, a member of the Montgomery, Alabama, branch of the National Association for the Advancement of Colored People (NAACP), was told to give up her seat on a city bus to a white person. When Parks refused to move, she was arrested. The local NAACP, led by Edgar D. Nixon, recognized that Parks' arrest might rally local blacks to protest segregated buses. Montgomery's black community had long been angry about their mistreatment on city buses, where white drivers were often rude and abusive. The community had previously considered a boycott of the buses. The Montgomery Bus Boycott was a success, with support from the 50,000 blacks in Montgomery. It lasted for more than a year. This event showed the American public that blacks in the South would not stop protesting until the end of segregation. A federal court ordered Montgomery's buses desegregated in November 1956. The boycott ended with the blacks winning the right to sit wherever they wanted. A young Baptist pastor named Martin Luther King, Jr., was president of the Montgomery Improvement Association, the organization that directed the boycott. The protest made King a national figure. King became the president of the Southern Christian Leadership Conference when it was founded in 1957. They wanted to celebrate the NAACP legal strategy by encouraging the use of nonviolence. These activities included marches, demonstrations, and boycotts. The violent white response to black direct action eventually forced the federal government to confront the issues of injustice and racism in the South. In addition to his large following among blacks, King had a powerful appeal to liberal Northerners that helped him influence national public opinion. His advocacy of nonviolence attracted supporters among peace activists. He formed alliances in the American Jewish community. He also developed supporters from the ministers of wealthy, influential Protestant congregations in Northern cities. King often preached to those congregations, where he raised funds for SCLC. === Chicano Movement === The Chicano Movement is a political, social, and cultural movement by Mexican Americans. The Chicano Movement addresses negative ethnic stereotypes of Mexican people in the media and by Americans. People such as Tiburcio Vasquez and Joaquin Murietta became folk heros to Mexican Americans. They refused to obey White Americans. === American Indian Movement === The American Indian Movement is a Native American activist organization in the United States. It was founded in 1968 in Minneapolis, Minnesota. The organization was formed to stop issues concerning the Native American urban community in Minneapolis.Miner, Marlyce. \"The American Indian Movement\" They wanted to stop poverty, housing, treaty issues, and police harassment. ==== Gender equality ==== The first feminism equality issues was suffrage rights. This led women to get the right to vote. The second feminist issue involved economic equality (for example, getting paid the same as men if they did the same kind of work). Lesbians are also part of women's rights. The lesbian feminist groups, such as the Lavender Menace, are a lesbian activism group. === LGBT rights and gay liberation === The events of the Hawaii Supreme Court promoted the United States Congress to create the Defense of Marriage Act in 1996. This act forbids the federal government from accepting same-sex relationships to get married. Currently 30 states have passed state constitutional amendments that ban same-sex marriage. However, Connecticut, Massachusetts, New Mexico, New Jersey, New York, Rhode Island, and Vermont made gay marriage legal. Before 1993, lesbian and gay people were not allowed to serve in the United States military. Under the \"Don't ask, don't tell\" policy, they were only allowed to serve in the military if they did not tell anyone of their sexual orientation. The Don't Ask, Don't Tell Repeal Act of 2010 allowed homosexual men and women to serve openly in the armed forces. Since September 20, 2011, gays, lesbians, and bisexuals have been able to serve openly. However, transsexual service-members still cannot serve openly, due to Department of Defense medical policies which consider gender identity disorder to be a medically disqualifying condition. People who oppose gay rights in the United States have been political and religious conservatives. These people cite a number of Bible passages from the Old and New Testaments as their reason. The most opposition of gay rights are in the South and other states with a large rural population. Many organizations have opposed the gay rights movement. These include the American Family Association, the Christian Coalition, Family Research Council, Focus on the Family, Save Our Children, NARTH, the national Republican Party, the Roman Catholic Church, The Church of Jesus Christ of Latter-day Saints (LDS Church), the Southern Baptist Convention, Alliance for Marriage, Alliance Defense Fund, Liberty Counsel, and the National Organization for Marriage. A number of these groups have been named as anti-gay hate groups by the Southern Poverty Law Center. == Germany == The Civil Rights Movements in Germany was a left-wing backlash against the post-Nazi Party era of the country. The movement took place mostly among disillusioned students and was largely a protest movement to others around the globe during the late 1960s. == France == A general strike broke out across France in May 1968. It became a revolutionary problem. It was discouraged by the French Communist Party. It was finally suppressed by the government, which accused the communists of plotting against the Republic. Some philosophers and historians have argued that the rebellion was the single most important revolutionary event of the 20th century because it wasn't participated in by a single demographic, such as workers or racial minorities, but was a popular uprising, superseding ethnic, cultural, age and class boundaries. == References == == Other websites == *We Shall Overcome: Historic Places of the Civil Rights Movement, a National Park Service Discover Our Shared Heritage at Travel Itinerary *A Columbia University Resource for Teaching African American History *Martin Luther King, Jr. and the Global Freedom Struggle, an encyclopedia presented by the Martin Luther King, Jr. Research and Education Institute at Stanford University * *Martin Luther King, Jr. and the Global Freedom Struggle ~ an online multimedia encyclopedia presented by the King Institute at Stanford University, includes information on over 1000 civil rights movement figures, events and organizations *\"CivilRightsTravel.com\" ~ a visitors guide to key sites from the civil rights movement *The History Channel: Civil Rights Movement *Civil Rights in America: Connections to a Movement == Books == * Manfred Berg and Martin H. Geyer; Two Cultures of Rights: The Quest for Inclusion and Participation in Modern America and Germany Cambridge University Press, 2002 * Jack Donnelly and Rhoda E. Howard; International Handbook of Human Rights Greenwood Press, 1987 * David P. Forsythe; Human Rights in the New Europe: Problems and Progress University of Nebraska Press, 1994 * Joe Foweraker and Todd Landman; Citizenship Rights and Social Movements: A Comparative and Statistical Analysis Oxford University Press, 1997 * Mervyn Frost; Constituting Human Rights: Global Civil Society and the Society of Democratic States Routledge, 2002 * Marc Galanter; Competing Equalities: Law and the Backward Classes in India University of California Press, 1984 * Raymond D. Gastil and Leonard R. Sussman, eds.; Freedom in the World: Political Rights and Civil Liberties, 1986-1987 Greenwood Press, 1987 * David Harris and Sarah Joseph; The International Covenant on Civil and Political Rights and United Kingdom Law Clarendon Press, 1995 * Steven Kasher; The Civil Rights Movement: A Photographic History (1954–1968) Abbeville Publishing Group (Abbeville Press, Inc.), 2000 * Francesca Klug, Keir Starmer, Stuart Weir; The Three Pillars of Liberty: Political Rights and Freedoms in the United Kingdom Routledge, 1996 * Fernando Santos-Granero and Frederica Barclay; Tamed Frontiers: Economy, Society, and Civil Rights in Upper Amazonia Westview Press, 2000 * Paul N. Smith; Feminism and the Third Republic: Women's Political and Civil Rights in France, 1918-1940 Clarendon Press, 1996 * Jorge M. Valadez; Deliberative Democracy: Political Legitimacy and Self-Determination in Multicultural Societies Westview Press, 2000 Movement",
 "title": "Civil rights movements"
}