{
 "id": "401115",
 "text": "The Pontic Greek genocide was the killing of Greek people who lived in the Pontus region of Ottoman Empire in what is the northeast of modern Turkey. The genocide took place between 1914 and 1923. The Young Turks and Kemalists killed or deported Pontians through the Syrian desert. The estimates of the number of people that were killed vary. Most historians say between 350,000 and 353,000 were killed. The genocide ended with the deportation of survivors to Greece during the population exchange between Greece and Turkey in 1923. The agreement to allow this exchange of people was signed after the Second Greco-Turkish War. The Pontic genocide is part of the Greek genocide. It is often seen as separate because of the geographic separation of Pontus and the political and historical features. == Background == Since 700 BC, Pontic Greeks lived near the southern coast of the Black Sea in the Pontus region. They had a strong culture with many important Greek philosophers and writers. In the 11th century, the Turks started moving to central Anatolia in an area that is now Turkey. They moved into the Pontus region. Under the Byzantine Empire (395 CE-1453), the two groups got along well with each other. However, from the start of the Ottoman Empire (1299-1922), the Pontic Greeks were not equal to the rest of the population because they were a Christian minority in a Muslim empire. Many Christian Greeks had better education and a higher economic position in the empire, which made many Muslims angry. Religion was a sign of loyalty in the Ottoman Empire, but most Pontics did not want to change their religion to Islam, which made them be seen as a danger to the empire. The Young Turk Revolution was the main event that changed the lives of Pontic Greeks in Anatolia. The political idea of the Young Turks was to \"Turkify\" the Ottoman Empire. The movement wanted to bring together everyone who shared the same language, history, and culture. That also meant that everyone who was not part of the group would have to leave. The people in the Ottoman Empire were scared that Christian groups like the Pontic Greeks would try to separate the Muslim empire, which would mean that they would lose control and power over those areas. That started the genocide to remove everyone who was not Turkish from Anatolia. IFrom 1914 to 1923, about 353,000 Pontic Greeks were killed, and 1.5 million were send into exile and so were forced to leave their homes. The genocide came in different forms and had two main phases: Young Turk and Kemalist. ==Young Turk phase (1914-1918)== The Pontic Greek men between 20 and 50 were sent to do slave work in working groups and camps of the military (Amele Tabourou). They were supposed to free the ways and open roads for Ottoman armies all over the empire. Many Pontic men died because they had to work a lot, and there was not enough water and food for everyone. From 1914 to 1918, 88 Pontic Greek villages were burnt down, women and girls were raped, and houses were robbed. There were 100,000 Pontic Greeks killed, and 255,000 were forced to leave. ==Interwar period (1918-1919)== After World War I, the Ottoman Empire and the British signed the Armistice of Mudros. The agreement allowed Greek survivors of the war to go back to their homes in Anatolia. However, most of their homes were destroyed, and it was not safe for them to stay there. The armistice also allowed the Greek government to invade Turkey to protect the Greeks in Anatolia. That is why Greece came to the city of Smyrna on May 15, 1919 and started the Second Greco-Turkish War. ==Kemalist phase (1919-1923)== The second phase of the Pontic Greek genocide took place during the Second Greco-Turkish War. It was larger in scale than the first war and resulted in complete dissappearance of Greeks in the area. The Turks feared the permanent occupation and Hellenization of parts of Anatolia, with Ionia falling under direct Athenian governance and separatism and revolt by Ottoman Greeks resulting in the establishment of Pontic state on the Black Sea. The Turks' concerns increased drastically after Greeks invading İzmir on 15th of May and became one of main reasons (and justifications) for final stage of the genocide. In late May 1919, Mustafa Kemal, just after he had arrived in Samsun, informed Constantinople that since the armistice, \"forty guerilla\" bands \"in an organized program\" were killing Turks in order to \"establish a Pontus state\". However,the reality was different. All of thosr separatist acts had resulted in almost no acts of organized rebellion and very few anti-Turk actions. Most Ottoman Greeks in the Pontus, as elsewhere in Anatolia, had remained unmoved by ethnic-nationalist appeals. An American diplomat who toured the major Pontic cities in summer 1919 reported that \"many of the most influential and rational Greeks... In Trebizond view this policy [of separatism] with disfavor.\" The local Greek Archbishop, Chrysantonos of Athens, was also opposed. The reason for Ottoman Greeks by and large distancing themselves from the pan-Hellenic national message and certainly failing to act on it is unclear. Perhaps, it was the matter of poorly developed political consciousness or the centuries-long tradition of submissiveness to Islamic hegemony. Also, they feared a massacre, as had just befallen Armenians. Demographic realities assuredly contributed since the Turks predominated in Pontus, as in Anatolia in general, and the Pontic Greeks knew it whatever their spokesmen sometimes said. A few days after the war had started, Kemal on May 19 was ordered to go to Samsun, a city in the Pontus region, to create order there. Instead, he brought more Turkish nationalists together and strengthened his tactics against the Pontic Greeks. Even more Greeks were kidnapped, killed, and tortured. Three hundred villages were destroyed, and people were burnt alive in their homes. Ordered by Kemal, the Pontic Greeks were forced to leave their homes and had to go onto death marches through the Syrian desert. The Greeks walked for weeks or even months, and many lost their lives because there were not enough food, water, or protection. They were joined by two violent groups: The Teşkilât-ı Mahsusa (Special Organization), a secret police of the Ministry of War under the Ottoman Empire, and the çetes (armed bands), who were organized criminals. Both groups created even worse conditions for the Pontic Greeks. By early 1920, the Kemalist policy of intimidating Greeks into flight had become in full swing. Nationalist army officers near Samsun toured the villages and saying that \"the Christians [were] the cause of the [Allied] occupation of Constantinople and advocated their extermination.\" At Unye and Fatsa, the Turks posted placards blaming the Christians \"for all their troubles\". Kemalists arrested and exiled to Ankara Polycacpos, the Greek bishop of the mixed town Ordu. Turks walked arout the town and were fully armed except when Allied ships werein port. \"They are on their good behavior until the ships leave.... Christians feared to venture out of town.\" In Samsun, nationalists, stressing \"the religious side of the question\", inflamed the Turkish population \"by preaching a Holy War... The Greeks are accused of violenting Turkish women, and of destroying the Holy Tombs of Sheikhs at Broussa and other captured towns.\" Nationalist members of Kemal's parliament in Ankara proposed a law calling for the deportation of all Christians from the Black Sea area, but no such law was passed because Kemal preferred less publicized methods at that time. Here and there were fatalities. In Domuz-Dere seven Greek charcoal-sellers and two children were murdered. At Gelebek station (Hackiri) in April, some 500 Christians were reportedly murdered by irregulars. Organized atrocities began in March 1920 in Izmit and in September 1920 in Cappadocia but not yet in Pontus. They eliminated illusions about Nationalists' policy towards the minority of Greeks (and Christians in general) and the future of Pontians. The full-scale campaign in Pontus began in March 1921. It may have been precipitated by the launch of the large Greek spring offensive, which began on the 23th. The leader of the Turkish campaign was General Nurredin Pasha, a killer so ruthless that in January 1922, he was brought up by his own government on charges for \"the mal-execution of his orders.\" Kemalists claimed that they were \"eradicating rebellion\" since Greeks were massacring Turks, the Greek Black Sea fleet was periodically bombarding coastal towns, and Pontic Greeks had joined the Greek Army. Western observers uniformly asserted that there was no Pontic \"rebellion\" either underway or in preparation. Turks and their defenders have also sought cover by pointing to the arrival in the Black Sea in summer 1921 of a Greek naval squadron, which stopped Turkish ships, took passengers prisoner, and later lightly shelled Inebolu. That may indeed have hastened the deportation process, but it wa not the cause of the campaign since it had been launched weeks earlier. As Count Schmeccia of the firm Lloyd Triestino in Samsun and previously a representative of the Italian High Commission, said, the Inebolu bombardment, which produced no casualties, was merely a Turkish \"excuse for the massacres\". In any event, much other evidence points to Ankara's planning for that summer's destruction of the Greek communities. An American report refers to a July 2 order from Ankara requiring deportation of all \"adult male\" Christians \"throughout the interior of Anatolia,\" not merely in the Pontus. Another report indicates that two weeks later Ankara ordered the \"immediate deportation of all Ottoman Greeks,\" which included women, children, and the eldery. In early August, the mutessarif of Bafra told a visiting American naval officer that the deportation \"of all remaining Greeks, including women and children, had been ordered by Angora.\" That order was apparently reinforced by another, from Nurredin Pasha, who instructed a local governor \"to proceed with all dispatch to carry out the orders which had been given him or that he would shortly cease to be mutassarif.\" The American officer concluded that this was \"part of an official plan which contemplates extermination of the Greeks\". There may not have been an \"open and avowed policy of extermination,\" but there was evidence of a \"popular policy\" aiming at \"Turkey for the Turk,\", as one missionary put it. Be that as it may, the large-scale massacres and deportations began already in the spring with the rural Greek communities. In the villages of Black Sea's Duzce (Kurtsuyu) kaza, \"many old men and women [were] burnt alive.@ Turks also attacked swaths of villages around Alacam, Bafra, and Carsamba and in the interior as far as Havza and Visirkopru. They took pains to make sure that there were no American witnesses. Missionaries were not allowed out of Samsun, the regional missionary center, but survivors reached the town and told their stories. American naval officers reported that the campaign was \"under strict control of the military;\" was \"directed by high authority - probably Angora [Ankara];\" and carried out, at least in part, by soldiers. A purported eyewitness stated that villagers around Bafra were subjected to \"incendiarism, shooting, slaying, hanging and outranging\" and that the villages were \"turned to heaps of ruins.\" The American officers quoted an American missionary to the effect that about a hundred Greek villages south of Bafra had been destroyed. Villagers were being killed and \"the priests... crucified\". By summer, the campaign reached towns. In Bafra, it kicked off with an ancient ploy, according to the Greek Patriarchate, with Greek notables being invited to a dinner party at the house of Efrem Aga, arrested, and murdered. Turks then rounded up and massacred young Greek men. On June 5, Bafra was sorrounded by gendarmes, brigands, and Turkish troops, and \"a special corps...formed for the purpose of exterminating the Greek element,\" who demanded that the men give themselves up. Some hid. Turks then searched the houses, pillaging and violating \"the prettiest and best bred\" women. Men were marched off, escorted by convoys. The first headed for nearby village of Blezli. Seven Bafra priests were axed to death and the rest of men were killed thereafter. One, Nicholas Jordanoglon, gave Turks 300 Turkish lira for the privilege of being shot rather than batchered with an axe or bayonet. Another 500 men, from the second convoy, were reportedly burnt alive in the church in Selamelik. Another 680 were murdered in the church at Kavdje-son. Five convoys left Bafra. At least two, according to the Greek representative to the League of Nations, were shot up by their escorts near Kavak Gorge, killing at least 900. Survivors were sent naked, \"like wandering spirits\", to Malaya, Charnout, Mamuret, and Alpistan. Western report claimed 1300 Greeks were murdered in the gorge on August 15 or 16. Ankara's government claimed those dead at Kavak had been killed justifiably in battle, after \"Greek bands\" allegedly attacked Turks. On August 8 Turks collected Bafran women and girls, \"stripped and violated them and by torture compelled many to adopt Mohammedanism.\" Those who refused conversation were led off \"to different unknown places, where many died on the way... and children were slaughtered.\" Some 6000 Greek women and children were deported from Bafra around August 31 and further 2500 on September 19. The only Greeks allowed to stay were the sick people who paid bribes. On May 25, 1922, the military base in Constantinople reached out to the Ministry of Foreign Affairs in Greece. It informed them about what was happening in the Pontus region. By then, there were almost no Pontic Greeks left in that area. The genocide ended with the the Treaty of Lausanne in 1923. It was signed by Greece and Turkey and led to a trade of people between the two countries. Almost 190,000 Greeks were send from the Ottoman Empire to Greece and about 350,000 Muslims were brought from Greece to the Ottoman Empire. With that, no more Christian Greeks were left in the Ottoman Empire. == Recognition == On December 16th, 2007, the Pontic Greek Genocide was officially recognized by the International Association of Genocide Scholars (IAGS). Not many people know and talk about the genocide because of the Armenian Genocide, which happened around the same time. On February 24, 1994 the Greek Parliament officially recognized the genocide and declared the May 19 as the national day of remembrance. Turkey has not recognized the genocide or make a statement about what happened 100 years ago in Anatolia. Many pro-Turkish scholars even say that there is not enough proof that the Young Turks had wanted to start a genocide in the first place. The genocide was recognized by Sweden in 2010 and by the Netherlands and Armenia in 2015. ==References== ==Other websites== * Greek Genocide Resource Center Category:Islam Category:Racism Category:Islamism Category:Genocide Category:War crimes Category:World War I Category:20th century Category:1920s in Turkey Category:Genocides in Asia Category:20th century in Greece Category:Crimes against humanity Category:1910s in the Ottoman Empire",
 "title": "Pontic Greek genocide"
}