{
 "id": "401140",
 "text": "Christopher Martin (15821621)A genealogical profile of Christopher Martin , (a collaboration of Plimoth Plantation and New England Historic Genealogical Society, accessed 2013) was a merchant by trade.Nick Bunker, Making Haste from Babylon: The Mayflower Pilgrims and their New World a History (New York: Knopf 2010), p. 268 He along with his family traveled on the Mayflower in 1620.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), p. 323Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) pp. 185-186 Martin, wife Mary, son Nathaniel and step-son Solomon all came from Billericay in Essex England.Charles Edward Banks, The English Ancestry and Homes of the Pilgrim Fathers (Boston: Genealogical Publishing Co., 2006), p. 70Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 183 The family did not believe in the Church of England. In 1612, Martin and his wife would not take Holy Communion. Another time, Nathaniel and Solomon made the Church Vicar angry with during a service. Martin got into trouble because he would not give church officials the financial accounts he kept.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 184 Martin and his family joined a Separatist church. They all wanted to go to the New World. Martin sold his property and bought passage on the ship.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), p. 324 The people asked Martin to help them by buying supplies. He did not spent the money wisely.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) pp. 184-185Nick Bunker, Making Haste from Babylon: The Mayflower Pilgrims and their New World a History (New York: Knopf 2010), p. 22 He purchased things like beer, wine, salted beef and pork, dried peas, fishing supplies, muskets, armor, clothing, tools, and other things to trade with the Native Americans. One thing he purchased, the screw-jack, would be very useful to keep the Mayflower from sinking.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) p. 185 == Voyage == There were two ships going to Virginia Colony, the Speedwell and the Mayflower. Martin was assigned to be the leader of the passengers on the Speedwell but the ship needed repairs. A fellow passenger and official of the trip, Robert Cushman said, that Martin will not listen to them, nor allow them to go ashore in case they should run away.Nathaniel Philbrick, Mayflower: A story of Courage, Community and War (New York: Viking, 2006), pp. 26-27 Some of the passengers quit the voyage to return to London and lost much or all of their money. Others boarded the Mayflower which became very crowded. Christopher Martin left on Mayflower in company with his wife Mary, his servant John Langmore and his stepson Solomon Prower. Nathaniel Martin stayed in England.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 323-324Charles Edward Banks, The English Ancestry and Homes of the Pilgrim Fathers (Boston: Genealogical Publishing Co., 2006), p. 66 The Mayflower left Plymouth, England on 16 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower spotted land. The Mayflower was supposed to land in Virginia Colony, but the ship was damaged and they were forced to land at Cape Cod now called Provincetown Harbor.George Ernest Bowman, The Mayflower Compact and its signers (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7-19.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 20, 411-413 They landed on 21 November. They wrote the Mayflower Compact, which made rules on how they would live and treat each other. Christopher Martin signed the Mayflower Compact. His step-son and his servant were too young to sign.Caleb H. Johnson, The Mayflower and her passengers (Indiana:Xlibris Corp., Caleb Johnson, 2006) pp. 176, 186 George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. == In Plymouth Colony == When the Mayflower was docked in the Harbor, Martin and other men went to land to find a place where they all could live. In the winter of 1621 Martin, his wife, son and servant became ill and died.Charles Edward Banks, The English Ancestry and Homes of the Pilgrim Fathers (Boston: Genealogical Publishing Co., 2006), pp. 6, 70Nathaniel Philbrick, Mayflower: A story of Courage, Community and War (New York: Viking, 2006), p. 89 Martin and his wife Mary were buried in the Cole's Hill Burial Ground, Plymouth. There is a plaque in the United Reform Church in England to honor the Mayflower passengers. The plaque names Christopher Martin, Marie (Mary) Martin, Solomon Prower and John Langerman.United Reformed Church Billericay Essex & Mayflower == References == == Further reading == *Robert C. Anderson. The Great Migration Begins. Boston: New England Historic Genealogical Society, 1995. *Robert C. Anderson. The Pilgrim Migration. Boston: New England Historic Genealogical Society, 2004. *R. J. Carpenter. Christopher Martin, Great Burstead and The Mayflower. Chelmsford, Essex, 1982. Category:Mayflower passengers Category:1580s births Category:1621 deaths Category:People buried in Cole's Hill",
 "title": "Christopher Martin"
}