{
 "id": "40126",
 "text": "The Golani Brigade (also known as Brigade No. 1) is an Israeli infantry brigade that was formed February 28, 1948 when the Levanoni Brigade was divided in two smaller brigades. It is one of the most highly decorated infantry units in the Israel Defense Forces. == Symbols and Colors == The symbol of the brigade is a green olive tree with its roots on a yellow background. The tree symbolizes strength, and the colors symbolize areas where Golani had fought. Early Golani soldiers were farmers and new immigrants, so they chose to make their beret brown, like the land. == History == During the 1950s, the Golani Brigade participated in many operations, most notably the 1951 operation against Syria and the October 1955 operation against Egypt. In the 1956 Sinai Campaign Golani's task was to capture the area around the city Rafah in the Sinai desert. At Golani Junction in the north of Israel stands the Golani Brigade Museum commemorating the brigade and its heroes. The Golani brigade has earned a reputation for its tough soldiers. They are known as being very brave and friendly, but also as being very reckless when things do not go their way. That is why they are so feared by Israel's enemies. Also, the Golani Brigade is the only brigade with the heavy IDF Achzarit armored personnel carriers. The Achzarit is a very heavily armored vehicle designed for the requirements of urban fighting. Golani's recon company (Sayeret Golani) is one of the most respected special forces units in the IDF. This unit, together with Sayeret Matkal, re-took the Mount Hermon position in the 1973 Yom Kippur War. This unit's soldiers are so dedicated that in 1994 one of its commanders rescued himself from an enemy minefield after half his right leg was blown-off. He applied the bandages to his leg himself, and he is now a senior commander in the IDF. In 1976 some of the Golani Brigade were sent to Uganda to rescue 246 Jewish hostages on Air France flight 139, hijacked by PLO terrorists. Despite winning the battle, the mission commander was killed. As of 2004, Golani operates within the northern border of Israel and in the West Bank (mainly Jenin). During 2004, a Golani battalion reinforced the Givati Brigade in the Gaza Strip. In July 2006 Golani took part in the 2006 Israel- Lebanon conflict and the fierce battle of Bint Jbeil ( en) where they lost 9 troops. == Battalions of the Golani Brigade == * Barak Battalion - Gdud 12 * Gideon Battalion - Gdud 13 * \"Golani Buds\" - includes platoons being trained for all of its units. * The Egoz Reconnaissance Unit (special unit) * The First Breachers' Battalion (HaBok'im HaRishon) - Gdud 51 == Commanders of the Golani Brigade == * 1948-1949, Moshe Mann, Mishael Shaham, Nahum Golan * 1987-1988, Gaby Ashkenazi * 1988-1990, Baruch Spiegel * 1990-1991, Moshe Tzin * 1991-1993, Yair Nave * 1993-1995, Moshe Kaplinsky * 1995-1997, Erez Gerstein * 1997-1999, Gadi Eizenkot * 1999-2001, Shmuel Zakai * 2001-2003, Moshe Tamir * 2003-2005, Erez Tzukerman * 2005-2008, Tamir Yadai * 2008-2010, Avi Peled * 2010-2012, Ofek Buchris * 2012-2014, Yaniv Asor * 2014-, Ghassan Elian == Golani Brigade in the 1948 Arab-Israeli war == === List of Israeli military operations in the 1948 Arab-Israeli war that the Golani Brigade participated in === * Operation Assaf * Operation Dekel (only elements of the brigade participated) * Operation Hiram * Operation Horev * Operation Ovdah * Operation Yiftach == Related pages == * List of Israeli military operations in the 1948 Arab-Israeli war (en) * Givati Brigade * 2023 Israel–Hamas war == Other websites == * Golani Engineering Battalion - site of Golani reservists * http://www.us-israel.org/jsource/Society_&_Culture/golani_brigade.html * - Sayeret Golani in the battle of Bint Jbail Category:1948 establishments in Israel Category:Israel Defense Forces Category:Organizations in West Asia Category:Military units in West Asia Category:Military units in the Levant",
 "title": "Golani Brigade"
}