{
 "id": "401284",
 "text": "__NOTOC__ At the time, it was known as the Year of the Consulship of Constantius and Iulianus (or, less often, year 1113 Ab urbe condita). == Events == === By place === ==== Roman Empire ==== * February - Julian, Roman Caesar, is proclaimed emperor by the Gallic legions in Lutetia (modern Paris) at the Thermes de Cluny. They refuse to support the eastern campaign against king Shapur II of Persia and revolted. * The Alamanni raid Raetia (Switzerland), but are pushed back behind the Rhine and into the Black Forest by Julian. * King Shapur II continues his campaign against the Roman fortresses. His armies capture Singara, Bezabde and Nisibis. * Emperor Constantius II and Julian send several letters to each other. They are both hoping to avoid a civil war. ==== Europe ==== * Thousands of Huns invade Europe. They spread terror as they take over territories held for generations by Alans, Heruls, Ostrogoths and Visigoths. ==== Asia ==== * Japan begins a 30-year period of great influence in Korea. === By topic === ==== Agriculture ==== * Roman authorities in Britain export wheat to supply the legions on the Rhine. They have encouraged production of wheat for that purpose. ==== Religion ==== * First Council of Constantinople: Emperor Constantius II requested a church council, at Constantinople, and both the eastern and western bishops attend the meeting. Wulfila also attends the council and endorses the resulting creed. After the council, several homoiousian bishops are deposed or banished, including Macedonius I of Constantinople and Cyril of Jerusalem. == Births == * John Cassian, Desert Father and Christian saint (approximate date) * Saint Mesrob, Armenian monk and theologian (approximate date) * Saint Ninian, missionary to Scotland (approximate date) * Tao Sheng, Chinese Buddhist scholar (approximate date) * Wang Fahui, empress during the Jin Dynasty (d. 380) == Deaths == * Eustathius of Antioch, Patriarch of Antioch (approximate date) * Murong Jun, emperor of the Former Yan (b. 319)",
 "title": "360"
}