{
 "id": "40131",
 "text": "Nancy Patricia D'Alesandro Pelosi (born March 26, 1940) is an American politician. She served as the Speaker of the United States House of Representatives from 2019 to 2023. She was also Speaker from 2007 to 2011. She represents the 12th district of California, which is part of the city of San Francisco. She was first elected to Congress in 1987. Pelosi is a member of the Democratic Party. She is the first woman to lead a major party in the United States Congress. She is also the first woman and the first Italian- American to be the Speaker of the House. On January 3, 2019, Pelosi was elected speaker for the second time. This would make her the first former speaker to become speaker again since Sam Rayburn in 1955. In the 2022 midterm elections, Republicans won control of the House, thus ending her second speakership. She announced her retirement as the leader of the House Democratic Caucus, but said she would remain a member of the House. On November 29, 2022, the House Democratic Caucus appointed Pelosi Speaker Emerita of the United States House of Representatives. ==Early life== Pelosi was born in University of Maryland St. Joseph Medical Center in Towson, Maryland and she is of Italian heritage. Her father, Thomas D'Alesandro, Junior, was Mayor of Baltimore, Maryland. He served five terms in Congress. Her brother, Thomas D'Alesandro III, also was Mayor of Baltimore. He died in October 2019, aged 90. Pelosi graduated from Trinity College in Washington, D.C. in 1962. She and her husband, Paul Pelosi, have five children: Nancy Corinne, Christine, Jacqueline, Paul and Alexandra. They also have five grandchildren. ==Political activity== On September 24, 2019, Pelosi announced the start of first impeachment hearings into Donald Trump. In December 2019, the House formally impeached Trump, though he was later acquitted in the Senate. On January 14, 2021, Pelosi announced the start of the second impeachment hearings into Donald Trump. In February 2021, the Senate acquitted Trump with a vote of 57 senators voting \"guilty\" to 43 \"not guilty\". On August 5, 2022, China imposed sanctions on Speaker Pelosi and her immediate family. This was because she visited Taiwan on August 2. ==References== Category:1940 births Category:Living people Category:Democratic Party (United States) politicians Category:United States representatives from California Category:Politicians from Baltimore Category:Politicians from San Francisco Category:Speakers of the United States House of Representatives Category:Minority leaders of the United States House of Representatives Category:20th-century Roman Catholics Category:21st-century Roman Catholics Category:20th-century American politicians Category:21st-century American politicians",
 "title": "Nancy Pelosi"
}