{
 "id": "401469",
 "text": "The Colony of Virginia (also known as Virginia Colony) was the first of thirteen colonies in North America. == Location == When the Virginia Colony was first settled, it was a huge geographic area that was England's claim on all of North America. After the United States was formed, the new government formed all of these areas from the Colony of Virginia:Charles A. Goodrich, The History of the United States of America from the Discovery of the Continent by Christopher Columbus to present time, (Hartford: H. F. Sumner & Co. 1873) pp. 35, 241 * The entire state of Illinois * The entire state of Indiana * The entire state of Kentucky * The entire state of West Virginia * Parts of Ohio * Virginia == Name == The name Virginia was first applied by Sir Walter Raleigh and Queen Elizabeth I in 1584. After the English Civil War in the mid-17th century, King Charles II nicknamed the Virginia Colony \"The Old Dominion\". This name honored the Colony's loyalty to the British Crown during the Commonwealth of England era (a period from 1649-1660 when the monarchy was ended). == History == European explorers first found modern-day Virginia in the late 16th century. In 1584 England tried to establish its first colony in the New World: the Roanoke Colony. Because of the Anglo-Spanish War, nobody could return to re-supply the colony for four years. When ships finally arrived in 1590, the Roanoke colonists were mysteriously gone. In 1607 Virginia was settled again at Jamestown by people working for the Virginia Company of London. This time, the colony succeeded. Jamestown became the first successful English settlement in the New World. However, the Virginia Company had its charter cancelled in 1624 for not making a profit. This meant they lost the legal rights to control the Virginia Colony. At this point, the British Crown took over the colony. It remained an English colony until the American Revolution. Virginia was one of the first colonies to be made a state in the new United States of America. == Related pages == * Thirteen Colonies * Jamestown, Virginia * Roanoke Colony * States of the United States * History of the United States == References == Category:18th century in Virginia Vir Category:1707 establishments Category:1700s establishments in the Thirteen Colonies",
 "title": "Colony of Virginia"
}