{
 "id": "401476",
 "text": "Paul Marco (June 10, 1927 - May 14, 2006) was an American actor. He often appeared in movies made by Ed Wood, including the \"Kelton Trilogy\": Bride of the Monster, Night of the Ghouls and Plan 9 from Outer Space. In this trilogy, he played a bumbling, fearful policeman named Kelton. ==Biography== Marco was born in Los Angeles. He took lessons in drama, singing, and dancing at an early age. After graduating from Hollywood High School, he served in the United States Navy during World War II. His first known movie role was a small part in the 1944 movie Sweet and Low-Down with Benny Goodman. In the early 1950s, The Amazing Criswell predicted on national television that Paul Marco would go far in the movie business. Criswell introduced Marco to Ed Wood. In turn, Marco introduced Ed Wood to Bunny Breckinridge, a gay Shakespearean actor. Breckinridge lived with Marco for a time and co-starred in Wood's Plan 9 from Outer Space. Marco depended on Wood for parts. He more or less retired as an actor as Ed Wood's movies shifted more and more towards pornography. In 1995, Marco recorded \"Home on the Strange\", in which he reprised his Kelton character for Dionysus Records. He revived Kelton once more in the 2005 science fiction satire/tribute film The Naked Monster. On May 14, 2006, Paul Marco died after a battle with hip problems and chronic illness. He was 78. ==Movie list== Film Film Film Film Year Film Role Notes 1944 Sweet and Low- Down Uncredited 1952 Hiawatha Uncredited 1955 Bride of the Monster Officer Kelton Alternative title: Bride of the Atom 1959 Night of the Ghouls Patrolman Paul Kelton Alternative title: Revenge of the Dead 1959 Plan 9 from Outer Space Patrolman Paul Kelton 1961 The Young Savages Uncredited 1965 Rat Fink Uncredited 1989 Horror Talk 2005 The Naked Monster Kelton the Cop 2009 Kelton's Dark Corner: Trilogy One Kelton the Cop Direct-to-DVD release Television Television Television Television Year Title Role Notes 1960 The Donna Reed Show Plumber #3 1 episode 1960 77 Sunset Strip Jeep Driver 1 episode ==References== *Sloan, Will. (April 2005). \"Can Your Heart Stand the Shocking Facts About Kelton the Cop A/K/A Paul Marco?\" Filmfax, pp. 88–89 ==Notes== ==Other websites== *Paul Marco's official website * * *Keltonsdarkcorner.com Category:American movie actors Category:American television actors Category:Actors from Los Angeles Category:1927 births Category:2006 deaths",
 "title": "Paul Marco"
}