{
 "id": "401462",
 "text": "Predator is a 1987 American science fiction horror/action movie. It was directed by John McTiernan. The movie stars Arnold Schwarzenegger, Carl Weathers, Jesse Ventura, and Kevin Peter Hall. It was distributed by 20th Century Fox. The story follows a special forces team, led by 'Dutch' (Arnold Schwarzenegger). They are on a mission to rescue hostages in Central America. The group does not know that they are being hunted by a technologically advanced alien, the Predator. Predator was written by Jim and John Thomas in 1985. Filming began in April 1986. == Production == The movie cost about $15 million to make. It was released in the United States on June 12, 1987. Predator made $98,267,558 at the box office. At first, the reviews to Predator were negative. Much of this was because of a weak plot. Two sequels, Predator 2 (1990) and Predators (2010) were made. There have also been two movies with the Alien franchise. These are Alien vs. Predator (2004) and Aliens vs. Predator: Requiem (2007). ==Cast== * Arnold Schwarzenegger as Major Alan \"Dutch\" Schaefer. * Carl Weathers as George Dillon, a former teammate of Dutch and a CIA agent. * Elpidia Carrillo as Anna, a guerrilla, captured by Dutch's troops. * Richard Chaves as Jorge \"Poncho\" Ramirez. * Jesse Ventura as Blain Cooper, who fought with Mac in the Vietnam War. * Bill Duke as Mac Eliot, a close friend of Blain's. * Sonny Landham as Billy Sole, a Native American tracker. * Shane Black as Rick Hawkins, the team's radio operator. * R. G. Armstrong as Major General Homer Phillips, the coordinator of the mission. * Kevin Peter Hall as The Predator. Hall also plays the end scene helicopter pilot. Peter Cullen did the voice of the Predator. == Box office == Predator was #1 at the US box office in its opening weekend with a gross of $12 million. Only Beverly Hills Cop II made more money in 1987. The movie earned a total of $98,267,558. Of this, $59,735,548 was from the US & Canadian box office. $38,532,010 was made overseas. ==References== == Other websites == * * Category:1987 horror movies Category:1987 action movies Category:1987 science fiction movies Category:American science fiction horror movies Category:American action movies Category:20th Century Fox movies Category:English-language movies Category:Movies directed by John McTiernan Category:Movies composed by Alan Silvestri Category:Predator movies Category:Movies set in Central America Category:Jungle movies Category:Guerrilla warfare movies Category:Movies about extraterrestrial life",
 "title": "Predator (movie)"
}