{
 "id": "4015",
 "text": "Florida ( American Spanish: ), is a state in the southeast part of the United States. It is the 22nd largest US state by total area with 65,757.70 sq mi (170,312 km2) and the third most-populous with a 2020 population of more than 21 million. It is a peninsula, which means that water surrounds the state on three of four possible sides. To the west is the Gulf of Mexico, to the south is the Florida Straits, and to the east is the Atlantic Ocean. It also borders two states, Alabama and Georgia, both along its northern border. The highest elevation in Florida is Britton Hill. Many Cubans, Haitians and other Caribbeans live in state. In 2018, The top countries of origin for Florida’s immigrants were Cuba, Haiti, Colombia, Mexico and Jamaica.Immigrants in Florida ==History== Native Americans had first settled in Florida before the arrival of the Europeans. Florida had many residents from many tribes and nations living in almost all parts of it for thousands of years. These include the Timucua, the Tequesta, the Calusa, the Seminole, the Miccosukee, and many more. Florida was first discovered by a European in 1513 by the Spanish Ponce De Leon, who called this peninsula \"Tierra de la Pascua Florida\" (Land of the Easter flowered) because it was discovered on Easter: in the next centuries only the last word remained. === Natural landscape and geography === Northern Florida contains hills because it is at the very end of the Appalachian Mountains. The highest hill in Florida is Britton Hill, in northern Walton County near the town of Lakewood, Florida. It is above sea level. It is the shortest of the highest points in all other states. Florida has the longest coastline in the continental United States.The Gulf Stream ocean current goes through the Atlantic Ocean near the east coast of Florida, so the water is warmer than the Pacific Ocean. The Gulf of Mexico is on the west coast of Florida. In the center of southern Florida is a lake called Lake Okeechobee. It is the seventh largest freshwater lake in the United States Muller, Peter O. \"Lake Okeechobee.\" World Book Online Reference Center. 2008. 12 Jan. 2008 and the second largest freshwater lake entirely within the lower 48 states. Okeechobee is 730 square miles (1,890 km²), about half the size of the state of Rhode Island, and is very shallow for a lake of its size, with an average depth of only 9 feet (3 m). A lot of south Florida used to be covered by a swamp called the Everglades. When Florida was first being settled, farmers found out the soil there was fertile, so they drained some of the wetlands in 1882 for farming. In 1947, the state constructed levees and canals to make more room for farming and houses. The Everglades is now about half the size it used to be. Most of what is left is now the Everglades National Park. Lots of animals live there, including alligators and Florida panthers. Walt Disney with his EPCOT project fixed and maintained a lot of the Floridian swamp area. Recently, Florida has been trying to restore the Everglades. At the southernmost tip of Florida is a chain of islands called the Florida Keys. There are 4500 islands in the Keys. The most famous one is Key West. Few states had a bigger population boom than Florida during the Covid pandemic. But now, many who moved there have decided that Florida is not for them, citing high inflation and the state's politics, among other things. == Weather == Florida is nicknamed the Sunshine State. During the summer, temperatures may rise up to as high as 109 degrees Fahrenheit (or 40.5 degrees Celsius). Its annual average temperature is much warmer than many of the other states, but during winter, temperatures occasionally fall below 32 degrees Fahrenheit. In Florida, a dozen palm tree species are native to the state. Florida has both a rainy season and dry season. Southern Florida does not have four separate seasons. Florida's sunny climate attracts visitors. The summer is great for surfing the waves and enjoying the beaches. The most popular sport in Florida is fishing. Florida is vulnerable to hurricanes due to its proximity to the warm waters of the Atlantic Ocean and Gulf of Mexico. Hurricane season is from June 1 to November 30, but sometimes a hurricane will occur outside of this period. Hurricane Andrew was a destructive hurricane that hit Florida on August 23, 1992. Florida's most active recorded hurricane seasons were in 2004 and 2005, when it was hit by hurricanes Charley (August 13), Frances (September 4–5), Ivan (September 16), Jeanne (September 25), Katrina (August 25), and Wilma (October 24). == Animals == Florida has many types of wildlife including: * Marine Mammals: Bottlenose Dolphin, Short- finned Pilot Whale, North Atlantic Right Whale, West Indian Manatee * Reptiles: American Alligator and Crocodile, Eastern Diamondback and Pygmy Rattlesnakes, Gopher Tortoise, Green and Leatherback Sea Turtles, Eastern indigo snake * Mammals: Florida panther, Northern River Otter, Mink, Eastern Cottontail Rabbit, Marsh Rabbit, Raccoon, Striped Skunk, Squirrel, White- tailed deer, Key Deer, Bobcats, Gray Fox, Coyote, Wild Boar, Florida Black Bear, Nine-banded Armadillos * Birds: Bald Eagle, Northern Caracara, Snail Kite, Osprey, White and Brown Pelicans, Sea Gulls, Whooping and Sandhill Cranes, Roseate Spoonbill, Florida Scrub Jay (state endemic), and others. One subspecies of Wild Turkey, Meleagris gallopavo, namely subspecies osceola, is found only in the state of Florida.C. Michael Hogan. 2008. Wild turkey: Meleagris gallopavo, GlobalTwitcher.com, ed. N. Stromberg Many species of eastern North American birds go to Florida in the winter. * Invertebrates: carpenter ants, termites, and American cockroach. In the 1930s, the Red imported fire ants were accidentally brought from South America to North America. Since then, they have spread to most of the Southern United States, including Florida. They are more aggressive than most native ant species and have a painful sting. A lot of non-native snakes have been released in the wild. In 2010 the state created a hunting season for Burmese, Indian and African rock pythons, green anacondas, and Nile monitor lizards. == Cities == The capital of Florida is Tallahassee, and Jacksonville is the state's largest city. Tallahassee is in the part of Florida called the panhandle, or the narrow part in the northwest. There are other big cities in Florida, like Tampa, Orlando and Miami. Orlando is home to many amusement and theme parks, like Walt Disney World Resort, Sea World, and Universal Studios. Millions of tourists visit Orlando each year. There is also Busch Gardens in Tampa, which is another tourist attraction. The oldest city in Florida is St. Augustine, which was founded by the Spanish in 1565. The Kennedy Space Center is on Merritt Island, near Cape Canaveral, on Florida's Space Coast. == Education == Florida has eleven state universities. They are Florida A&M; University, Florida Atlantic University, Florida Gulf Coast University, Florida International University, Florida State University, New College of Florida, University of Central Florida, University of Florida, University of North Florida, University of South Florida, and University of West Florida. The University of Central Florida has the most students. There are 28 private universities in Florida. ==Related pages== * Colleges and universities in Florida * List of cities in Florida * List of counties in Florida * List of hurricanes in Florida * List of law enforcement agencies in Florida * List of people from Florida * List of rivers of Florida == Notes == == References == Category:1845 establishments in the United States",
 "title": "Florida"
}