{
 "id": "40166",
 "text": "María Eva Duarte de Perón (May 7, 1919 – July 26, 1952) was the second wife of Argentine President Juan Perón. She was born in Los Toldos. She was the First Lady of Argentina from 1946 until she died and she served with her husband as an unofficial co-ruler of Argentina during those years. Before she died, the National Congress of Argentina made her Spiritual Leader of the Nation. She was an actress before she married Perón. == Early life == Eva grew up fairly poor and had wanted to become an actress since an early age. At sixteen, she left school and moved to Buenos Aires to pursue her dream of stardom. She got a job at a radio station there until she met Juan Perón at a charity concert held for the victims of the earthquake of San Juan in 1944. Soon, the two became very close and they were married on October 21, 1945. Eva was an active campaigner in Juan Perón's presidential campaign in 1946, and when he was elected, she continued to play an active government role. == Accomplishments == By the time of her death, she was one of the most powerful women, or maybe even the most powerful woman, in the world. She is known for her work in many charitable and feminist causes, and became an icon to many people in Argentina. Evita was President of the Peronist Women's Party, a big and powerful political party made up of women who supported the Peróns' party. She ran the Ministry of Labor and the Ministry of Health. She helped legalize divorce in Argentina, as well as playing a leading role in enacting women's suffrage in Argentina. The Maria Eva Duarte de Perón Welfare Foundation gave a lot of funds, goods and medicine to the poor. The poor liked Evita Perón a lot. Her life inspired a musical called Evita and a movie based on the musical called Evita. The movie starred Madonna. == Death == Her cancer was detected during a hysterectomy in November 1951, but the doctors were encouraged by Juan Perón, to keep it to themselves in order to not influence the presidential campaign negatively. German doctors were also involved in the treatment of Evita Peron. In December 1951, the German gynaecologist Professor Dr. Hans Hinselmann was flown to Argentina, the developer of the colposcopy which he had already developed in 1924/1925, which made early detection of cervical cancer possible for the first time. On 24 July 1952, two other experts from Germany joined the team: Dr. Paul Uhlenbruck from Cologne, a cardiovascular specialist, and Dr. Heinrich Kalk from Kassel, a liver specialist.Mehr anzeigen When she died of cervical cancer in Buenos Aires, her corpse was embalmed After her husband was overthrown in a coup d'état in 1955, her body was lost for almost 20 years, until it was found in Italy. It was brought back to Argentina and buried with her husband after he died in 1974. It was brought back by the President Isabel Perón, who was married to Juan Perón years after Eva's death. In memory of her life's work, a giant portrait on the front of Argentina's Social Development Ministry was unveiled on 26 July 2011, exactly 59 years after her death. ==References== Category:1919 births Category:1952 deaths Category:Argentine actors Category:Argentine politicians Category:Cancer deaths in Argentina Category:Deaths from cervical cancer Category:Feminists Category:Former dictators Category:Argentine movie actors Category:First Ladies and Gentlemen of Argentina Category:Peronists Category:Juan Perón",
 "title": "Eva Perón"
}