{
 "id": "401860",
 "text": "Norman Milton Lear (July 27, 1922 – December 5, 2023) was an American television writer and producer. He produced 1970s sitcoms including All in the Family, Sanford and Son, One Day at a Time, The Jeffersons, Good Times, and Maude. Lear won many awards, including six Primetime Emmy Awards, two Peabody Awards, the National Medal of Arts in 1999, the Kennedy Center Honors in 2017, and an honorary Golden Globe Award in 2021. He was a member of the Television Academy Hall of Fame. Lear was known for his political activism and supporting liberal and progressive causes and politicians. In 1980, he founded the organization People for the American Way to push against the influence of the Christian right in politics. In 2001, Lear and his wife, Lyn, purchased one of the first published copies of the United States Declaration of Independence for $8.1 million. Lear said he went on a tour with the document around the United States so that the country could experience its \"birth certificate\" firsthand.Today Show interview with Katie Couric, February 8, 2002 Lear was born on July 27, 1922 in New Haven, Connecticut to a Jewish family.Interview with Aish.com He studied at Emerson College. Lear was married to Charlotte Rosen until they divorced. Then he was married to Frances Loeb from 1956 until they divorced in 1986. He was married to Lyn Davis from 1987 until his death. In 2014, Lear published a memoir titled Even This I Get to Experience. Lear died in his Los Angeles, California home on December 5, 2023, aged 101. The cause of death was cardiac arrest caused by heart failure. ==References== ==Other websites== * *The Official Norman Lear Website *Biography of Norman Lear at the Museum of Broadcast Communications website *2005 interview with Norman Lear *2006 story on Lear and All in the Family that describes Lear's interests and his life in Vermont *Independence Road Trip *463rd Bombardment Group Historical Society *NNDB.com Profile *Norman Lear Archive of American Television interview *Born Again American website Category:1922 births Category:2023 deaths Category:American television producers Category:American television writers Category:Jewish American writers Category:Writers from New Haven, Connecticut Category:American centenarians Category:American political activists Category:American Emmy Award winners Category:Peabody Award winners Category:Golden Globe Award winners Category:Kennedy Center honorees Category:Businesspeople from New Haven, Connecticut Category:Businesspeople from Los Angeles Category:American progressives Category:Screenwriters from Connecticut Category:Screenwriters from Los Angeles Category:Movie directors from Los Angeles Category:Movie producers from Los Angeles Category:American game show hosts Category:Television personalities from Los Angeles Category:Jewish American entertainers Category:Deaths from cardiac arrest Category:Deaths from heart failure",
 "title": "Norman Lear"
}