{
 "id": "401945",
 "text": "Edward Fuller ( 1575winter of 1620/21) was a passenger on the 1620 voyage of the Mayflower. He signed the Mayflower Compact. Fuller died with his wife soon after the passengers came ashore to their new settlement at Plymouth but their sons lived. Fuller was baptized in Norfolk, England on September 4, 1575. He was the son of Robert Fuller, a butcher.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 295A genealogical profile of Edward Fuller, (a collaboration of Plimoth Plantation and New England Historic Genealogical Society accessed 2013) There is very little known about Edward Fuller's life in England. He had a brother Samuel who also travelled with him on the Mayflower. He married, but his wife's name is not known. They had two sons, Matthew in 1605 and Samuel in 1608. Fuller and his brother lived in Leiden for some time as did many other English Separatists. Separatist were people who did not believe in the Church of England.Robert Charles Anderson, Pilgrim Village Family Sketch: Edward Fuller (a collaboration between American Ancestors and New England Historic Genealogical Society) == The Voyage to the New World == In 1651 William Bradford wrote a list of the Mayflower passengers which included “Edward Fuller, and his wife, and Samuell, their son.”Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 406 The Mayflower left Plymouth, England on 16 September 1620. There were 102 passengers and 30–40 crew. On 21 November 1620, the Mayflower spotted land. The Mayflower was headed for Virginia Colony, but the ship was damaged and they were forced to land at Cape Cod now called Provincetown Harbor. The wrote the Mayflower Compact which was a list of rules on how they would live and treat each other. Fuller signed that document.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 20, 413George Ernest Bowman, The Mayflower Compact and its signers (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7-19. == In Plymouth Colony == Bradford kept a written record of the new settlement at Plymouth. He wrote that: “Edward Fuller and his wife died soon after they came ashore. Their son Samuel is living and married, and has four children or more.”Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 409 After the death of his parents, Samuel, then about age twelve, was taken into the household of his uncle, Samuel Fuller. The date of death for Fuller and his wife are unknown. It was during the winter of 16/20 and 16/21. They were buried in the Coles Hill Burial Ground in Plymouth. They are remembered on the Memorial as “Edward Fuller and his wife.”Memorial of Edward Fuller ==Fuller's family== Edward had two sons: Matthew and Samuel. Samuel went to live with his uncle and became a doctor. Matthew came over to Plymouth Colony sometime after his parents.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 416, 424 ==References== Category:Mayflower passengers Category:1575 births Category:1621 deaths Category:People buried in Cole's Hill",
 "title": "Edward Fuller"
}