{
 "id": "402050",
 "text": "The Governorship of Dalmatia (or Governatorato di Dalmazia in Italian) was a territory united to the Kingdom of Italy in April 1941, after the military conquest of the Jugoslavian Dalmatia by Italian general Vittorio Ambrosio during WWII. It lasted until September 1943. ==Characteristics== The Governorship of Dalmatia was made up of parts of coastal Kingdom of Yugoslavia that were occupied and annexed by Italy from April 1941 to September 1943. Italy already had, since 1919, the Italian Province of Zara (Provincia di Zara) on the Dalmatian coastline with Zara as capital and the island of Lagosta (actually called Lastovo) after World War I (for a total area of about 200 square kilometers). The creation of the Governorship of Dalmatia fulfilled the requests of the Italian Irredentism, that already were expressed during the \"Incidents of Spalato\". But not all of Dalmatia was annexed by Italy, as the German puppet state - the Independent State of Croatia - took some sections of the Dalmatian areas, though the Italian army held control over all of Dalmatia. The Kingdom of Italy divided the Governorship into three Italian provinces: Zara (Zadar), Spalato (Split) and Cattaro (Kotor), but never created officially an Italian region with the name \"Dalmatia\" (waiting for the future peace conference). While the Governorship was not officially a region of Italy, the northern Dalmatian islands of Krk (Veglia) and Rab (Arbe) were united to the Italian province of Fiume and became part of the Kingdom of Italy. In September 1941 Benito Mussolini, ordered the military occupation of the entire Dalmatian coast and islands (like Ragusa, Lissa, and Pago) that belonged to fascist Croatia of Ante Pavelić: he tried to annex those areas to the Governorship of Dalmatia, but was temporarily stopped by the strong opposition of Pavelić, who retained nominal control of those areas. Giorgio Bocca, Storia d'Italia nella guerra fascista 1940-1943. Mondadori editore. Milano, 2006 ==Territory== The Governatorate of Dalmatia consisted of three provinces: Zara, Cattaro and Spalato. The administrative capital was Zara. After autumn 1941 also the Dalmatian islands of Pago and Lesina were annexed. These islands were occupied militarily by the Italian army, along with an area of fascist Croatia that was off the coast of Segna to the center of Bosnia (near Sarajevo and Banja Luka). Italian Province Area (km²) Population cfr.: Davide Rodogno Il nuovo ordine mediterraneo, ed. Bollati Boringhieri, Turin 2003 Provincia di Zara 3,179 211,900 Provincia di Spalato 1,075 128,400 Provincia di Cattaro 547 39,800 Total 4,801 380,100 After the Kingdom of Italy changed sides to the Allies in 1943, German forces took over the area. This territory was not given to the fascist Italian Social Republic (which was a puppet state of Nazi Germany), but instead completely dissolved and added to the puppet Independent State of Croatia. Zara remained Italian (even under control of the German Army) until 1945. The city suffered a terrible bombing in 1944. ==References== ==Bibliography== * Dalbello M.C.; Razza antonello. Per una storia delle comunità italiane della Dalmazia. Fondazione Culturale Maria ed Eugenio Dario Rustia Traine. Trieste, 2004. ==Related pages== * Italian irredentism in Dalmatia * Incidents of Spalato Category:Dalmatia Category:1943 in Europe Category:1944 in Europe Category:1945 in Europe",
 "title": "Governorate of Dalmatia"
}