{
 "id": "402068",
 "text": ":The correct title of this article is Q: Are We Not Men? A: We Are Devo! \"Q:\" makes a link to Wikiquote.org when it is used in an article title. Q: Are We Not Men? A: We Are Devo! is the first album released by the American new wave music band Devo. This album was produced by Brian Eno, recorded mostly in London, England and released in the U.S. by Warner Bros. Records company in 1978. The album received mixed reviews from critics when it was released. It reached number 12 on the UK album charts and number 78 on the U.S. Billboard charts. Recent reviews of the album have been mostly positive. This album is included on many \"best of\" lists from magazines such as Rolling Stone, Pitchfork Media and Spin. Devo played the whole album live on stage for the first time on May 6, 2009. It was a part of the Don't Look Back (concert series)|Don't Look Back concert series. On September 16, 2009, Warner Bros. and Devo said they would re-release Q: Are We Not Men? and Freedom of Choice, and that Devo would tour and perform both albums. ==Reception by critics== The first reaction by critics to Q: Are We Not Men? A: We Are Devo! was mixed. Tom Carson, wrote in Rolling Stone that \"There's not an ounce of feeling anywhere, and the only commitment is to the distancing aesthetic of the put-on\", and opined that \"Devo lacks most of Eno's warmth and much of Bowie and Taylor's flair for mechanized melodrama. For all its idiosyncrasies, the music here is utterly impersonal.\" Critic Robert Christgau gave the album a positive rating of a B+, but noted, \"In small doses it's as good as novelty music ever gets, and there isn't a really bad cut on this album. But it leads nowhere.\" It was voted one of the best albums of the year in the Village Voice's Pazz & Jop critics poll for 1978. In January 1980, Trouser Press also named it one of the best albums of 1978. Later reception of the album has been mostly positive. Steve Huey of the online music database Allmusic scored the album four and a half \"stars\" calling it \"arguably Devo's strongest set of material, though several brilliant peaks can overshadow the remainder\", and \"a seminal touchstone in the development of American new wave.\" Q: Are We Not Men? A: We Are Devo! is on \"best of\" lists, including Spin's 50 Most Essential Punk Records, Pitchfork Media's top 100 albums of 1970s and Rolling Stone's list of The 500 Greatest Albums of All Time. It is also listed in the book 1001 Albums You Must Hear Before You Die. ==Track listing== ===Vinyl Record=== ==Band Members== * Bob Casale – rhythm guitar player, also plays keyboards, sometimes sings background vocals * Gerald V. Casale – bass player, also plays keyboards, sings main vocals * Bob Mothersbaugh – main guitar player, sings background vocals * Mark Mothersbaugh – main keyboard player, sometimes plays guitar, sings main vocals * Alan Myers – drum player ==Album producer, production mixers and engineers== * Brian Eno – producer, synthesizer and backing vocals * David Bowie - additional production mixing * Dave Hutchins – engineer * Patrick Gleeson – engineer ==Singles== * \"Come Back Jonee\" / \"Social Fools\" * \"Praying Hands\" / \"Come Back Jonee\" * \"Mongoloid\" / \"Jocko Homo\" ==Charts== Album Year Chart Peak Position 1978 Billboard Pop Albums 78 1978 UK Albums Chart 12 ==References== * * * * * * * ==Other websites== * Q: Are We Not Men? A: We Are Devo! at Rate Your Music * Category:Debut albums Category:1978 albums Category:Punk albums Category:Devo albums",
 "title": "Are We Not Men? We Are Devo!"
}