{
 "id": "402397",
 "text": "Xi Jinping (; born 15 June 1953) is a Chinese politician who has been the general secretary of the Chinese Communist Party (CCP) and chairman of the Central Military Commission (CMC), and thus the top leader of China, since 2012. Since 2013, Xi has also served as the seventh president of China. As a member of the fifth generation of Chinese leadership, Xi is the first CCP general secretary born after the establishment of the People's Republic of China (PRC). ==Early life== Xi Jinping is the son of former Chinese Vice Premier Xi Zhongxun and Qi Xin. He rose politically in China's coastal provinces. He was the Governor of Fujian between 1999 and 2002. Between 2002 and 2007, he was Governor and CCP party secretary of Zhejiang. After the dismissal of Chen Liangyu, Xi was transferred to Shanghai as the party secretary for a short time in 2007. Xi was promoted to the central leadership in October 2007 and trained to become Hu Jintao's successor. ==General Secretaryship== In November 2012, he was elected as the General Secretary of the Communist Party of China and the Chairman of the Central Military Commission in the CCP convention. This started his first term as China's top leader. In March 2013, he was elected as the president of China by the Chinese Congress. Chinese leadership changes every 5 years, and it happens roughly in October/November (for CCP and military) and March next year (for government). In October 2017 and March 2018, Xi was re-elected as party, military and government leader. This started his second term. By tradition in recent decades, the Chinese leader leads two terms (10 years in total). The second term identifies his successor and prepares for the power transfer. However, Xi stopped this tradition and abandoned his potential successors Hu Chunhua and Sun Zhengcai. On 11 March 2018, the National People's Congress approved an amendment to the Constitution of the People's Republic of China, so that Xi and the future presidents could be reelected for president without term limits.China's 'president for life': Congress votes on abolishing term limits, bbc.com, 11 March 2018‘President for life’ Xi risks repeat of China’s Mao-era mistakes, South China Morning Post (online), 11 March 2018 In July 2018, a trade war started between the US and China. At the early stage Xi showed China's muscle by declaring to fight \"a tooth for a tooth\". As the conflicts continues to worsen, China softened its stance. There were reports that Xi's authority got damaged by his handling of the trade dispute with US. In October 2022, Xi was re-elected to a third term of CCP general secretary. This re- election made him the first party leader since Mao Zedong to be chosen for a third term, though Deng Xiaoping ruled the country informally for a longer time. == Personal life == Xi was born on 15 June 1953 in Beijing, China. His father held lots of posts, including party propaganda chief and vice premier. He has been married to Peng Liyuan since 1987. They have one daughter, Xi Mingze, who graduated from Harvard University in 2015. Xi lives in Zhongnanhai, China. ==Notes== ==References== ==Other websites== *Biography at www.chinavitae.com *Xi Jinping collected news and commentary at the China Digital Times **feature article on Xi, 29 September 2012 * U.S. Embassy Beijing, Portrait of Xi Jinping , via United States diplomatic cables leak *Osnos, Evan, \"China’s Valentine’s Day in Washington\", The New Yorker, 14 February 2012. Review of comment accompanying Xi's visit. * Category:1953 births Category:Living people Category:Current national leaders Category:Presidents of the People's Republic of China Category:Dictators Category:Politicians from Beijing Category:21st-century Chinese politicians",
 "title": "Xi Jinping"
}