{
 "id": "402537",
 "text": "Susan Elizabeth Rice (born November 17, 1964) is an American diplomat and policy advisor. She was the 22nd Director of the United States Domestic Policy Council from 2021 to 2023 under President Joe Biden. A member of the Democratic Party, she was the 27th United States ambassador to the United Nations from 2009 to 2013. Rice was the 23rd U.S. National Security Advisor from 2013 to 2017 under President Barack Obama. Rice also served as the 12th assistant secretary of African Affairs from 1997 to 2001 under President Bill Clinton. ==Obama administration== She was the United States Ambassador to the United Nations. Rice served on the staff of the National Security Council and as Assistant Secretary of State for African Affairs during President Bill Clinton's second term. Rice was confirmed as UN ambassador by the U.S. Senate by unanimous consent on January 22, 2009. She is the first Jamaican-American woman to hold that office. Rice succeeded Tom Donilon as National Security Adviser. Donilon's resignation was announced on June 5, 2013.Tom Donilon resigns as Obama national security adviser Susan Rice to take over at Washington Post.com ==Post-Obama presidency activities== On March 8, 2017, Rice joined American University as a distinguished visiting research fellow in the School of International Service (SIS) at the university. In her residency she planned to work on her next book and mentoring young SIS students. On March 28, 2018, Rice was appointed to the board of directors at Netflix. ==2018 U.S. Senate race in Maine== After U.S. senator Susan Collins from Maine voted in favor of Brett Kavanaugh for the Supreme Court, Rice publicly considered a challenge to Collins in 2020. In April 2019, however, Rice announced that she would not seek a Senate run against Collins in 2020.Susan Rice Says She Won't Challenge Susan Collins in 2020, Associated Press (April 11, 2019). ==2020 presidential election== In July 2020, it was widely reported that Rice was under consideration to be Joe Biden's running mate for Vice President in the 2020 general election. ==Biden administration== On December 10, 2020, it was reported that Rice was picked by President-elect Joe Biden to serve as Director of the Domestic Policy Council in the Biden administration. She left office in May 2023 and was replaced by Neera Tanden. ==Personal life== Rice was born on November 17, 1964 in Washington, D.C.. She studied at Stanford University and the New College, Oxford. Rice is an African American whose maternal grandparents were Jamaican. ==References== ==Other websites== *United States Mission to the United Nations * The Ethiopian-Eritrean War: U.S. Policy Options Before the House Committee on International Relations, Africa Subcommittee, May 25, 1999. . Retrieved 2008-05-13. * Fox News Interview with Laura Ingraham (video) * Interview with Dave Ross on MyNorthwest.com (audio) * Profile on Foreign Policy Category:1964 births Category:Living people Category:African-American politicians Category:Businesspeople from Maine Category:Businesspeople from Washington, D.C. Category:Politicians from Maine Category:Politicians from Washington, D.C. Category:United States Ambassadors to the United Nations Category:United States National Security Advisors Category:Democratic Party (United States) politicians",
 "title": "Susan Rice"
}