{
 "id": "402843",
 "text": "The Vashi Bridge, also called Thane Creek Bridge, is a bridge that connects the city of Mumbai to the mainland of India at New Mumbai . It is built across the Thane Creek. The bridge links Mankhurd in Mumbai with Vashi in Navi Mumbai, the satellite city of Mumbai. It is one of four entry points into Mumbai, and handles traffic in the region to the west and north of Mumbai. ==History== The first bridge to connect Mumbai to Navi Mumbai was made in 1973. The bridge is 1837 metres in length and has a below-requirement 3 lane carriageway. Within two years of its opening to traffic, corrosion cracks were noticed on some parts of the bridge. This led to a series of extensive repairs. It was then decided to construct a new bridge to replace the faulty one. Construction on a new bridge began in 1987 and opened in 1997. The original Vashi Bridge or the 1st Thane Creek Bridge remains closed to traffic. The Maharashtra State Road Development Corporation (MSRDC) has plans to add six more lanes to the Vashi Bridge at an estimated cost of 400 crore. == Thane Creek Bridge - 3 == Currently, the creek boasts two bridges: Bridge No.1 (TCB-I), primarily designated for light motor vehicles, and Bridge No.2 (TCB- II), featuring a 6-lane (3+3 lane) divided carriageway. Responding to escalating traffic demands, the Maharashtra State Road Development Corporation (MSRDC) has undertaken the construction of TCB III. This upcoming infrastructure marvel will comprise two 3-lane major bridges flanking the existing TCB-II bridge. With a total length extending 3.28 kilometers, inclusive of approaches on both ends, TCB III aims to enhance connectivity and alleviate congestion along this crucial transit route. Having made substantial strides in the construction of the South Mumbai to Vashi carriage, encompassing over 85 percent of the project, the Maharashtra State Road Development Corporation (MSRDC) anticipates the possibility of unveiling one side of the road, potentially as early as April 2024. ==References== Category:Mumbai Category:Bridges in Asia Category:Buildings and structures in India Category:1997 establishments in Asia Category:1990s establishments in India",
 "title": "Vashi Bridge"
}