{
 "id": "403228",
 "text": "Water scarcity is a lack of fresh water. For us, and most land animals, fresh water is drinkable, and sea water is not. This is because sea water has a high salt content, which we and most land animals cannot deal with. The need is not just for fresh water, but for clean water. That usually means water which is free of harmful bacteria and parasites and general dust and dirt. In the 1860s the English engineer Joseph Bazalgette organized the London sewers to keep water free of cholera. This was followed by British engineers designing similar waterworks in many countries round the world. Later population growth has increased the demand for fresh water beyond the scope of these original water systems. There are arid and desert areas, and places where the water is too polluted to drink. The situation has been made worse by population growth and industrial uses of water. Global warming tends to increase the need for fresh water for all land animals, including humans. Therefore, water scarcity may be the result of both human and natural causes. Changes in climate and weather patterns can cause the availability of water to drop. Common human causes include over-consumption, bad governance, pollution, and increases in the demand for water. == Types == Different terms are used to describe different types of water scarcity: *A water shortage is when there is not enough water to meet demands. Changes in the weather, such as drought can cause water shortage. *Water stress is the difficulty of finding sources of fresh water for use. *A water crisis is a situation where the available supply of potable, clean water within an area is less than the demand for it. == Estimates == The Food and Agriculture Organization (FAO) estimates that by 2025, 1.9 billion people will be living in countries or regions with total water scarcity, and two-thirds of the world population could be under stress conditions. The World Bank has said that climate change could heavily change the future of water availability and use, and therefore increase water stress on a global scale. == Negative effects == Fresh water scarcity has negative effects on ecology, biodiversity, agriculture and human health. It has also led to armed conflicts in several cases. Some countries upriver have built dams to satisfy their needs for drinking water, irrigation and electric power. These needs have grown as populations has grown, and as climate changes has reduced rain in some places. Down river from the dam, supply is usually reduced. This creates tension between countries. The River Jordan in the Middle East, and the Nile are two good examples of where this is happening. == Related pages == * Drought * Desertification * Desalination * Irrigation * Overpopulation * Water footprint ==References== ==Further reading== * Scarcity Category:Environmental issues",
 "title": "Water scarcity"
}