{
 "id": "403468",
 "text": "The Junior Eurovision Song Contest 2006 was the fourth edition of the Junior Eurovision Song Contest. It was for young singers aged 8 to 15. The contest was broadcast live from Bucharest, Romania on 2 December 2006. It was the second time the contest had been held in a capital city. It was organised by the Romanian national broadcaster, Romanian Television (TVR), in co-operation with the European Broadcasting Union (EBU). TVR won the rights to host the contest over AVRO of the Netherlands (who hosted the next contest).'EBU Confirms: Romania to host Junior 2006' Croatia also showed an interest in hosting this contest.'Croatia and Romania want to host junior 2006' ==Results== Draw Country Language Artist Song English translation Place Points 01 Portuguese Pedro Madeira \"Deixa-me sentir\" Let me feel 14 22 02 Greek Luis Panagiotou and Christina Christofi \"Agoria koritsia\" (Αγορια κοριτσια) Boys and Girls 8 58 03 Dutch Kimberly \"Goed\" Good 12 44 04 Romanian New Star Music \"Povestea mea\" My story 6 80 05 Ukrainian Nazar Slyusarchuk \"Khlopchyk Rock 'n' Roll\" (Хлопчик рок 'н' ролл) Rock 'n' roll boy 9 58 06 Spanish Dani Fernandez \"Te doy mi voz\" I give you my voice 4 91 07 Serbian, English, French, German, Italian, Spanish, Russian, JapaneseThe Serbian song contains actually only 2 lines of chorus in Serbian, while 24 lines of verses are sung in English, French, German, Italian, Spanish, Russian and Japanese. Neustrašivi učitelji stranih jezika \"Učimo strane jezike\" (Учимо стране језике) Learning foreign languages 5 81 08 English Sophie Debattista \"Extra Cute\" — 11 48 09 Macedonian Zana Aliu \"Vljubena\" (Вљубена) In love 15 14 10 Swedish Molly Sandén \"Det finaste någon kan få\" The best someone could get 3 116 11 Greek Chloe Sofia Boleti \"Den peirazei\" (Δεν πειραζει) It doesn't matter 13 35 12 Russian Andrey Kunets \"Noviy den\" (Новый день) New day 2 129 13 Dutch Thor! \"Een tocht door het donker\" A journey through the dark 7 71 14 Croatian Mateo Đido \"Lea\" —'Lea' is a given name and thus cannot be translated. 10 50 15 Russian Tolmachevy Twins \"Vesenniy Jazz\" Spring Jazz 1 154 ==Score sheet== Results Total Score Contestants Portugal 22 7 3 Cyprus 58 3 2 3 5 3 3 3 12 6 6 Netherlands 44 5 8 2 8 6 3 Romania 80 6 8 1 4 12 4 2 6 7 7 3 2 4 2 Ukraine 58 5 2 4 6 5 4 8 1 3 8 Spain 91 7 5 7 8 6 3 1 8 8 5 7 7 1 5 Serbia 81 2 4 5 5 7 2 7 10 4 1 5 5 5 7 Malta 48 1 1 3 1 1 1 7 5 3 2 4 7 Macedonia 14 2 Sweden 116 8 7 12 7 8 4 8 10 2 6 10 10 2 10 Greece 35 12 1 7 3 Belarus 129 12 6 4 10 10 8 6 12 5 10 8 6 8 12 Belgium 71 4 3 8 6 3 5 2 6 1 1 2 4 10 4 Croatia 50 6 2 10 12 6 1 1 Russia 154 10 10 10 12 12 10 12 4 4 12 10 12 12 12 The table is ordered by appearance All countries automatically receive 12 points ===12 points=== Below is a summary of all 12 points received: N. Recipient nation Voting nation 7 Russia Belarus, Belgium, Croatia, Romania, Serbia, Sweden, Ukraine 3 Belarus Malta, Portugal, Russia 1 Croatia Macedonia Cyprus Greece Greece Cyprus Romania Spain Sweden Netherlands * All countries were given 12 points at the start of voting. This is so no country gets nul points. ==Commentators== * - Pavlo Shylko (DJ Pasha) * - Fernando Argenta & Lucho * - André Vermeulen (VRT), Maureen Louys (RTBF) * - Olga Shelest * - Adam Alsing (TV4) == Spokespersons == * - Joana Galo Costa * - George Ioannidies * - Tess Gaerthe (Represented Netherlands in 2005) * - Andrea Nastase * - Assol * - Lucia * - Milica Stanišić * - Jack Curtis * - Dennis Dimoski * - Amy Diamond * - Alexandros Chountas * - Liza Anton-Baychuk * - Sander Cliquet * - Lorena Jelusić * - Roman Kerimov ==References== ==Other websites== ;Official websites *Official Junior Eurovision Song Contest website *TVR website ;News sites *Junior Eurovision coverage by ESCKaz, in English and Russian *ESCToday.com news Category:2006 in music Category:Bucharest Category:2000s in Romania Category:Junior Eurovision Song Contest by year Category:2006 in Europe",
 "title": "Junior Eurovision Song Contest 2006"
}