{
 "id": "40369",
 "text": "Cloth, textile or fabric are similar names for manufactured material. They are often made by weaving or knitting fibres together. It is often used to make clothing or cover furniture. Cloth can be made from natural fibres or man-made ones. Examples of natural fibres are cotton, wool, and silk. Examples of man- made fibres are nylon, rayon, and polyester. == History == The first clothes, were worn at least 70,000 years ago and maybe much earlier. They were probably made of animal skins and helped to protect early humans from the weather. At some point, people learned to weave plant fibers into textiles. == Uses == Textiles are commonly used for clothing. They are also containers such as bags and baskets. In the household, textiles are used in carpeting, upholstered furnishings, window shades, towels, coverings for tables, beds, and other flat surfaces. Textiles are also used in art. In the workplace, textiles can be used in industrial and scientific processes such as filtering. It can also be used in flags, backpacks, tents, nets, handkerchiefs, cleaning rags. It is used in transportation devices such as balloons, kites, sails, and parachutes. Textiles are also used make composite materials such as fibreglass and industrial geotextiles stronger. Textiles are used in many traditional crafts such as sewing, quilting and embroidery. == Types and sources of fibre == Textiles are made from many materials. The fibre used in textiles are gotten from with four main sources. They are animal (wool, silk), plant (cotton, flax, jute, bamboo), mineral (asbestos, glass fibre), and synthetic (nylon, polyester, acrylic, rayon). The first three are natural. === Animal === There are many sources of animal fibers. They include: * Wool refers to the hair of the domestic sheep or goat. It is different from other types of animal hair because each strand is coated with scales and lanolin. Wool is commonly used for thick clothing. Examples include: ** Alpaca wool, vicuña wool, llama wool, and camel hair. They are generally used to make coats, jackets, ponchos, blankets, and other warm coverings. ** Cashmere, the hair of the Indian cashmere goat, and mohair, the hair of the North African angora goat, are types of wool that are known for their softness. ** Angora refers to the long, thick, soft hair of the angora rabbit. ** Qiviut is the fine inner wool of the muskox. * Sea silk is an extremely fine, rare, and valuable fabric. It is made from the silky filaments or byssus secreted by a gland in the foot of pen shells. * Silk is an animal textile made from the fibres of the cocoon of the Chinese silkworm. It is spun into a smooth fabric which is soft. Around four- fifths of the silk made is made up of cultivated silk. ===Plant=== There are many sources of plant fibers. They include: * Coir (coconut fibre) is used in making twine. It is also used in making doormats, brushes, mattresses, floor tiles, and bags. * Straw and bamboo are both used to make hats. Straw is a dried form of grass. It is also used for stuffing, as is kapok. * Fibres from pulpwood trees, cotton, rice, hemp, and nettle are used in making paper. * Cotton, flax, jute, hemp, modal and even bamboo fibre are all used in clothing. Piña (pineapple fibre) and ramie are also fibres used in clothing. * Acetate is used to make certain fabrics such as silks, velvets, and taffetas shinier. * Seaweed is used in making textiles. * Rayon is a fabric gotten from plant pulp. ===Mineral=== There are three sources of mineral fibers. They include: * Asbestos and basalt fibre are mineral fibres used for vinyl tiles, sheeting and adhesives, acoustical ceilings, stage curtains, and fire blankets. * Glass fibre is used in making ironing board and mattress covers, ropes and cables, reinforcement fibre for composite materials, insect netting, flame-retardant and protective fabric, soundproof, fireproof, and insulating fibres. * Metal fibre, metal foil, and metal wire have lots of uses including making cloth-of-gold and jewellery. ===Synthetic=== There are many sources synthetic fibres. They include * Polyester fibre is used in all types of clothing, either alone or used together with fibres such as cotton. * Aramid fibre (e.g. Twaron) is used for flame-retardant clothing, cut-protection, and armour. * Acrylic is a fibre used to mimic wools. It is often used to replace wool in some clothes. * Nylon is a fibre used to mimic silk. It is used in making pantyhose. Thicker nylon fibres are used in rope. * Spandex is a polyurethane product. It is used to make activewear, bras, and swimsuits. * Olefin fibre is a fibre used in activewear, linings, and warm clothing. Olefins are hydrophobic, which allows them to dry quickly. * Ingeo is a polylactide fibre mixed with other fibres such as cotton and used in clothing. It is hydrophilic. * Lurex is a metallic fibre used in clothing embellishment. * Milk proteins have also been used to make synthetic fabric. It is sold as a biodegradable, renewable synthetic fibre. * Carbon fibre is mostly used in composite materials, together with resin. The fibres are made from polymer fibres through carbonization. == Gallery == Image:Rwanda market cloth.jpg|Cloth being sold in a market in Rwanda Image:Felt cloth.jpg|Felt is made of wool without weaving Image:Denim.jpg|Denim is used to make heavy-duty working suits, and also jeans File:Cordjacke detail.jpg|Corduroy is a strong kind of cloth ==References== Category:Basic English 850 words",
 "title": "Textile"
}