{
 "id": "403690",
 "text": "A GSSP, more fully a Global Boundary Stratotype Section and Point, is an internationally agreed point which defines the start of a stage on the geologic time scale. The work is done by the International Commission on Stratigraphy, a part of the International Union of Geological Sciences. As of 2012, 64 of the 101 stages that need a GSSP have been decided. == Rules for GSSP == A geologic section has to follow the rules to be adapted as a GSSP by the ICS. The list below are the rules: * A GSSP has to decide the lower boundary (start of a geological period) of a geologic stage. * The lower boundary (start of a geological period) has to be decided using a primary (main) marker (usually first appearance datum of a fossil specie). ** There should also be secondary markers (other fossils, chemical, geomagnetic reversal). ** The horizon in which the marker appears should have minerals that can be radiometrically dated. ** The marker has to have regional and global correlation in outcrops of the same age ** The marker should be independent of facies. * The outcrop has to have an acceptable thickness * Sedimentation has to be constant without any changes in facies * The outcrop should not be affected by tectonic and sedimentary movements, and metamorphism * The outcrop has to be accessible to research and free to access. ** This includes that the outcrop has to be located where it can be visited quickly (International airport and good roads), has to be kept in good condition (Ideally a national reserve), in accessible terrain, extensive enough to allow repeated sampling and open to researchers of all nationalities. == List == This list shows some of the GSSPs. Period Epoch Age (mya) Status GSSP location Defining markers Geographic Coordinates References Phanerozoic Cainozoic Quaternary Holocene 0.117 NGRIP2 ice core, Greenland * End of the Younger Dryas stadial (cold stage) Pleistocene 2.588 Monte San Nicola Section, Sicily, Italy * Base of magnetic polarity chronozone C2r (Matuyama). * Extinction of Discoaster pentaradiatus and Discoaster surculus (Calcareous nannofossil). Neogene Pliocene 5.333 Heraclea Minoa section Heraclea Minoa, Sicily, Italy * Top of magnetic polarity chronozone C3r. * First appearance of Ceratolithus acutus and near extinction of Triquetrorhabdulus rugosus (Calcareous nannofossil). Miocene 23.03 Lemme-Carrosio Section, Carrosio, Italy * Base of magnetic polarity chronozone C6Cn.2n. * Near first appearance of Paragloborotalia kugleri (Planktonic foraminifera). Palaeogene Oligocene 33.9 Massignano Section, Massignano, Ancona, Italy * Extinction of Hantkenina and Cribrohantkenina (Planktonic foraminifera). Eocene 56 Dababiya section, Luxor, Egypt * Base of negative Carbon Isotope Excursion (CIE). Palaeocene 66 El Kef Section, El Kef, Tunisia * Iridium enriched layer associated with a major meteorite impact and subsequent extinction event. Mesozoic Cretaceous Upper Cretaceous 100.5 Mont Risoux, Hautes-Alpes, France * First appearance of Rotalipora globotruncanoides (Planktonic foraminifera) Lower Cretaceous 145 Candidates: *Magnetic—base of Chron M18r *Base of Calpionellid zone B Jurassic Upper Jurassic 163.5 Candidate sections: * Redcliff Point, Dorset, England * Savouron, Provence, France * Horizon of Cardioceras redcliffense (Ammonite). Middle Jurassic 174.1 Fuentelsaz, Spain * First appearance of Leioceras opalinum and Leioceras lineatum * Biologic: First appearance of genus Leioceras (Ammonite). Lower Jurassic 201.3 Kuhjoch section, Karwendel mountains, Northern Calcareous Alps, Austria * Near first appearance of smooth Psiloceras spela group (Ammonite). Triassic Upper Triassic 235 Prati di Stuores, Dolomites, Italy * First appearance of Daxatina canadensis (Ammonite). * Near first appearance of Metapolygnathus polygnathiformis (Conodont). * Above magnetic zone S2n. Middle Triassic 247.2 Candidate sections: * Desli Caira, Dobrogea, Romania * Guandao, Guizhou, China * First appearance of Chiosella timorensis (Conodont). * Magnetic: Base of magnetic zone MT1n. Lower Triassic 252.2 Meishan, Zhejiang, China * First appearance of Hindeodus parvus (Conodont). Palaeozoic Permian 298.9 Aidaralash, Ural Mountains, Kazakhstan * First appearance of Streptognathodus isolatus within the morphotype Streptognathodus wabaunsensis chronocline (Conodont). Carboniferous Pennsylvanian 323.2 Arrow Canyon, Nevada, USA * First appearance of Declinognathodus nodiliferus (Conodont). Mississippian 358.9 La Serre, Montagne Noire, France * First appearance of Siphonodella sulcata (Conodont). * In 2006 it was discovered that this GSSP has biostratigraphic problems. Devonian 419.2 Klonk, Prague, Czech Republic * First appearance of Monograptus uniformis (graptolite). } Silurian 443.4 Dob's Linn, Moffat, U.K. * First appearance of Akidograptus ascensus and Parakidograptus acuminatus (Graptolite). * 1.6 m above the base of the Birkhill Shale Formation. Ordovician 485.4 Greenpoint section Green Point, Newfoundland, Canada * First appearance of Iapetognathus fluctivagus (Conodont). * Planktonic graptolites occur 4.8 m above boundary. * Coincides with a peak in carbon isotopes. Cambrian 541 Fortune head section, Newfoundland, Canada * First appearance of Treptichnus pedum (trace fossil). Era Period Precambrian Proterozoic Neoproterozoic Ediacaran 635 Enorama Creek section Flinders Ranges, South Australia * Worldwide distinct cap carbonates. * Beginning of a distinctive pattern of secular changes in carbon isotopes. Cryogenian 850 Defined chronometrically now. GSSP is in progress. Tonian 1000 Defined chronometrically Mesoproterozoic Stenian 1200 Defined chronometrically Ectasian 1400 Defined chronometrically Calymmian 1600 Defined chronometrically Palaeoproterozoic Statherian 1800 Defined chronometrically Orosirian 2050 Defined chronometrically Rhyacian 2300 Defined chronometrically Siderian 2500 Defined chronometrically Archaean & Hadean Neoarchaean 2800 Mesoarchaean 3200 Palaeoarchaean 3600 Eoarchaean 4000 Hadean 4567 ==Global Standard Stratigraphic Age (GSSAs)== Because defining a GSSP depends on finding well-preserved geologic sections and identifying key events, this task becomes more harder as one goes farther back in time. Before 640 million years ago, boundaries on the geologic timescale are defined simply by reference to fixed dates, known as \"Global Standard Stratigraphic Ages\". The oldest GSSP is the one that marks the start of the Ediacaran at 635 million years ago. ==References== Category:Earth sciences Category:Geological periods",
 "title": "GSSP"
}