{
 "id": "403929",
 "text": "Robert \"Bob\" Menendez (born January 1, 1954), or Bobby Menendez is an American politician who served as the United States Senator from New Jersey. He was first appointed to the Senate in January 2006. He resigned in August 2024. He was elected Chairman of the United States Senate Committee on Foreign Relations in January 2013. ==Convictions== On April 1, 2015, Menendez attracted national media attention when he was indicted on federal corruption charges in the United States District Court. He pleaded not guilty and all charges were dropped in 2018. On September 22, 2023, Menendez along with his wife Nadine Menendez were indicted on bribery, fraud and extortion charges. On July 16, 2024, he was convicted of bribery by a New York State jury at his federal bribery trial. He is the first sitting member of U.S. Congress to be convicted of conspiracy by a public official to act as a foreign agent. ===Resignation=== After saying that he had no plans to resign after being found guilty, it was then reported on July 23, 2024 that Menendez would resign from the Senate on August 20, 2024 because of the federal conviction.https://www.nytimes.com/2024/07/23/nyregion/senator-bob-menendez- resignation.htmlhttps://www.washingtonpost.com/politics/2024/07/23/senator- bob-menendez-resigns-senate/ ==Personal life== Menendez was born on January 1, 1954 in New York City, New York. He is of Cuban descent. Menendez was raised in Union City, New Jersey. He studied at St. Peter's College and at Rutgers School of Law in Newark. Menendez was married to Jane Jacobson from 1976 until they divorced in 2005. His daughter Alicia is a journalist and his son Rob is a U.S. Representative. In 2020, he married Nadine Arslanian. ==Notes== ==References== ==Other websites== * United States Senator Robert Menendez official U.S. Senate site * New Jersey's New Senator, editorial, New York Times, December 9, 2005 * Menendez on the Move , Al Sullivan, Union City Reporter, December 11, 2005 Category:1954 births Category:Living people Category:Lawyers from New Jersey Category:People from Union City, New Jersey Category:Politicians from New York City Category:United States representatives from New Jersey Category:United States senators from New Jersey Category:Democratic Party (United States) politicians Category:21st-century American politicians Category:20th-century American politicians",
 "title": "Bob Menendez"
}