{
 "id": "404473",
 "text": "\"Rock Me\" is a song by One Direction from their second album Take Me Home. The song was written by Peter Svensson, Sam Hollander, Lukasz Gottwald, Henry Walter, and Allan Grigg and was produced by Dr. Luke, Cirkut, and Kool Kojak. The song has a mid-tempo beat and a clapping riff reminiscent of \"We Will Rock You\" by Queen. The song received mixed reviews from critics, some of whom criticized its lyrics and others of whom praised its rock elements and production. \"Rock Me\" appeared on the US Billboard Hot 100 chart. == Background == \"Rock Me\" was written in one day by guitar player Peter Svensson of the Swedish band the Cardigans, Sam Hollander, and Allan 'Kool Kojak' Grigg for One Direction's second album Take Me Home, which was released in November 2012. Grigg began by making a mid-tempo beat. Svensson has said that Hollander \"had an idea for a title that's like 'rock me' instead of ‘rock you,’ and the melody just came.\" Lukasz 'Dr. Luke' Gottwald and Henry 'Cirkut' Walter co- produced the song. == Music and lyrics == \"Rock Me\" is a mid-tempo pop rock song. Both Billboard and BBC Music said that the song was a departure from One Direction's signature bubblegum pop sound. One Direction's members’ voice ranges on the song span from F4 to C6. The instrumentals feature guitar strings and piano lines. The song is in the key of Ab major, the time signature is common time, and the tempo is a moderate 84 beats per minute. Critics have also remarked that the song has beat and clapping riff similar to those in Queen's \"We Will Rock You\". The lyrics have a nostalgic message about a former significant other and a double entendre for sexual intercourse. Regarding the double entendre, Grigg noted, \"but at the same time, there's a vulnerability in it that's, like, so sweet for girls. It's a little self- deprecating. There's not a lot of overt machismo in the song.” \"I approached it like high school,\" said Hollander, who wrote lyrics for \"Rock Me\": \"On the first record, they were freshmen, innocent and wide-eyed. Now it's sophomore year, there are parties and driver’s licenses, and the world is theirs for the taking. That's what I wanted to capture.\" == Critical reception == Alexis Petridis of The Guardian criticized the song as “excruciating” and called the lyrics tedious and uninspiring. The New Zealand Herald writer Lydia Jenkin deemed \"Rock Me\" one of \"the most banal songs ever written,\" but noted that the group \"know what teenage girls want to hear.\" Idolator critic Sam Lansky praised the track as \"irresistible\" and commended its sonic palette as \"explosively punchy.\" Writing for HitFix, Melinda Newman favored its \"nearly hypnotic anthemic\" beat, and noted that \"Rock Me\" seemed perfectly tailored to become a live staple. Ben Rayner of the Toronto Star thought the song's Queen references were “clever” and “show[ed] that One Direction’s puppeteers aren't totally operating on autopilot.\" Robert Copsey from Digital Spy opined that the song's \"simple-yet-genius catchiness\" was its strongest attribute. Billboard reviewer Chris Payne applauded its rock elements, regarding it as a “welcome” deviation from the rest of Take Me Home's bubblegum pop sound. == Chart performance == During the week of November 18, 2012, \"Rock Me\" debuted at number one on the US Bubbling Under Hot 100 Singles chart due to very high digital download sales. As a result of an \"end-of-year download rush\" in the week ending December 30, 2012, the track made it onto the US Billboard Hot 100 at number 98, which was its peak position on the chart. Chart (2012) Peak position scope=\"row\" == References == == Other websites == *\"Rock Me\" at Musicnotes.com (EMI Music Publishing) Category:2012 songs Category:One Direction songs",
 "title": "Rock Me (One Direction song)"
}