{
 "id": "404530",
 "text": "John Billington ( 1580September 30, 1630) and his family were passengers on the Mayflower in 1620. He was one of the signers of the Mayflower Compact. Billington was hanged in Plymouth Colony in 1630.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth, (Boston: 1856), p. 181 The Billington family was from England. He had a wife, Elinor and two sons, John and Francis.Robert Charles Anderson, Pilgrim Village Family Sketch: John Billington (a collaboration between American Ancestors and New England Historic Genealogical Society) A genealogical profile of John Billington, (a collaboration of Plimoth Plantation and New England Historic Genealogical Society accessed 2013) == Mayflower Voyage == Billington and his family left Plymouth England on 16 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower saw land. They were supposed to land in the Colony of Virginia, but the ship was damaged so they landed at Cape Cod now called Provincetown Harbor.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 20, 411–413 They wrote the Mayflower Compact, which made rules on how they would live and treat each other. Billington was a signer to the document.George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. == Life in Plymouth colony == Shortly after they landed, Francis went exploring and discovered a large body of water that is now called Billington Sea.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth, (Boston: 1856), p. 102 The family were Plymouth Colony's troublemakers. Billington's son, Francis, fired a musket on the Mayflower. In March 1621 Billington was punished because he did not to obey Myles Standish the military leader. He would do this many times.Nathaniel Philbrick, Mayflower: A story of Courage, Community and War, (New York: Viking 2006), p. 89 In May 1621 John Billington (the younger) became lost in the woods for many days and was returned home by some Native Americans.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth, (Boston: 1856), pp. 102, 103 449, 452 In 1625 Governor Bradford wrote a letter to Robert Cushman and said \"Billington still says many things against you. He is a bad man, and always will be\". In 1636, wife was punished and made to sit in the stocks for saying bad things about John Doane. == Death of John Billington == Billington was hanged for the murder of John Newcomen in 1630. He was about 50 years old. This was the first execution in Plymouth Colony. His burial place is unknown.William Bradford, History of Plymouth Plantation by William Bradford, the second Governor of Plymouth, (Boston: 1856), pp.276, 277Grave of John Billington == References == Category:1580s births Category:1630 deaths Category:Mayflower passengers",
 "title": "John Billington"
}