{
 "id": "404573",
 "text": "A dog's coat is the hair covering its body. A dog can have a double coat that has short, soft hair underneath a layer of long, coarse hair, or a single coat that has only the long, coarse hair. A dog's coat may also be called hair or fur. ==Four main coat attributes== Dog coats can come in many different colors, patterns, lengths, and textures. ===Coat colors=== Dog coats come in four main colors: black, brown, white, and red. The same main color can have many shades. These shades are sometimes common enough that they are given their own color names, such as gold, yellow, cream, blue, and grey. There may be several of these colors on one dog. Brown Brown Chesapeake Bay Retriever Dark chocolate Australian Kelpie Red Red Irish Setter Red Chow Chow Black Black Newfoundland Black Labrador Retriever White White American Eskimo Dog White Bichon Frisé Gold Golden Retriever Golden Retriever Apricot Apricot Poodle Apricot Poodle Yellow Yellow mixed-breed dog Yellow Labrador Retriever Cream Cream French Bulldog Cream Akita Blue Kerry Blue Terriers Blue Australian Shepherd Grey GreyWeimaraner Grey Miniature Schnauzer ===Coat patterns=== Dog coats can also have many different patterns based on spots, patches, and mixing colors. Black and tan, brown and tan, blue and tan: This pattern has two colors, with a dark color on most of the body and tan patches on the belly, legs, chest, face, and eyebrows. Brown and tan Australian Kelpie Black and Tan Coonhound Bicolor (also called Two-color, Irish spotted, Flashy, Patched, Tuxedo): This pattern can be found with any color or even other pattern as long as it includes white spots. These spots can be on the feet, tail, nose, and neck, or even cover most of the dog. Sometimes special patterns of white have special names. For example, the Irish Spotted pattern is the same on both sides of the dog and includes a white chest, a white ring around the neck, a white belly, and white feet. Black and white Border Collie Blenheim (Red-brown and white) Cavalier King Charles Spaniel Tricolor: This pattern has three clear colors. The body of the dog is usually black, brown, or blue. Its belly is white, and it has tan patches. Black tricolor Entlebucher Mountain Dog Tricolor Beagle Merle: This pattern happens when a dog's colors are mixed in with white in spots and patches. Blue merle tricolor Australian Shepherd Red merle Catahoula Leopard Dogs Tuxedo: This pattern is when a dog is mostly one color, but has a white patch on its chest, a white spot on its chin, and white on its feet. Tuxedo Chihuahua. Harlequin: This pattern is when a white dog has black patches with an uneven border. Harlequin Great Dane Spotted: This is when a mostly white dog has any color of small spots. Spotted Dalmatian Flecked, ticked, speckled: This is when a dog has very small spots of one color mixed in with its main color. Brown-ticked German Shorthaired Pointer Blue speckled Australian Cattle Dog Brindle: This pattern is when a dog's coat is a mix of black with brown, tan, or gold. It sometimes makes a \"tiger stripe\" pattern. Brindle and white Boston Terrier Brindle Galgo Español Brindle: This pattern is when a dog's coat is a mix of black with brown, tan, or gold. It sometimes makes a \"tiger stripe\" pattern. Brindle Mountain Cur Brindle Great Dane Saddle or blanket: When a dog has a large colored patch on its back. Norwegian Dunker with black saddle Sable: This pattern happens when a dog has black tips on its fur. Red sable Pomeranian Brown sable Shetland Sheepdogs ===Coat lengths and textures=== A dog's coat can be long or short. For most dogs, their hair reaches one length and then stops growing, but there are some dogs whose hair will keep growing longer and longer. Some breeds of dog do not grow hair on parts of their bodies. These dogs are called \"hairless\". Examples of \"hairless\" dogs are the Xoloitzcuintli (Mexican Hairless Dog), the Peruvian Inca Orchid (Peruvian Hairless Dog) and the Chinese Crested. ==Additional reading== * * ==Other websites== * Category:Dogs Category:Hair",
 "title": "Dog coat"
}