{
 "id": "40456",
 "text": "Munich Airport (IATAcode MUC) is an airport 28 km north east of the city Munich, Germany. It is mainly used by Lufthansa and the Star-Alliance, which Lufthansa is in. In 2008, 34.53 million passengers used the airport. After Frankfurt am Main Munich is the second most important airport in Germany. It is the 8th largest in Europe. == History == Munich Airport was opened in 1992. Before that the airport was in Riem. Building was started in 1980. Because Frankfurt am Main was so busy, Lufthansa began to use Munich for international flights. The Airport was named after Franz-Josef Strauss, a politician who was very interested in aeroplanes. People in Munich usually just call it München Flughafen or der Flughafen. In 2003 the second airport terminal was opened, for people travelling on Lufthansa and Star-Alliance only. A third runway is planned, because there is much traffic on Munich Airport, but people who live near the airport do not want it. == Geography == You can use the Munich S-Bahn lines S1 and S8 to go to the city. They both cost €8,80 and take about forty minutes. Taxis to Munich cost €50 and can get stuck because of traffic congestion. The cities near the airport are Erding and Freising. They can be reached by Bus (~3-4 €) or Taxi (~€18). The Munich Airport center (MAC) is between the two terminals but it is not so far. It has many shops and restaurants. There is a Hilton Hotel near the airport and a second hotel is planned. == Terminals == Munich Airport has two terminals. Terminal 2 is newer and larger. === Terminal 1 === Terminal 1 is used by the non-Star Alliance airlines. The halls or areas are numbered A-F. It was opened on 17th May 1992 20 million passengers can use it every year. At the moment the terminal is being renovated, giving more room for shops and other things. The first halls have already been finished. 68 Airlines use Terminal One. ==== Variable Halls ==== * Air Transat (Calgary, Halifax, Toronto, Vancouver) * Hapagfly (Antalya, Brindisi, Cairo, Catania, Dalaman, Djerba, Faro, Fuerteventura, Funchal, Hanover, Hurghada, Jerez de la Frontera, Lanzarote, Las Palmas, Luxor, Málaga, Marsa Alam, Menorca, Monastir, Palma de Mallorca, Patras, Rhodes, Santa Cruz de la Palma, Sharm el Sheikh, Tel Aviv, Tenerife) * HLX.com (Cagliari, Dubrovnik, Leipzig [starts October 30, 2006], Naples, Olbia, Palermo, Rijeka, Venice) ==== Hall A ==== * dba (Athens [ends October 28, 2006], Berlin-Tegel, Bremen, Cologne/Bonn, Dresden, Düsseldorf, Hamburg, Hanover, Moscow- Domodedovo, Münster/Osnabrück, Nice, Paris-Orly, Rome-Fiumcino [ends November 5, 2006], Thessaloniki [ends October 28, 2006]) * Hola Airlines * Nordic Regional (Palma de Mallorca) ==== Hall B ==== * British Airways (Bristol, Glasgow, London-Heathrow) * Delta Air Lines (Atlanta) * Royal Air Maroc (Casablanca) [ends November 23, 2006] * Tunisair (Djerba, Monastir, Tunis) ==== Hall C ==== * Aeroflot (Moscow-Sheremetyevo) * African Safari Airways (Mombasa) * airBaltic (Riga, Vilnius) * Air Via (Bourgas, Varna) * Atlasjet (Antalya, Istanbul-Atatürk) * Atlas Blue (Agadir) * Blue Wings * Corendon Airlines (Antalya) * Czech Airlines (Prague) * Bulgarian Air Charter (Bourgas, Varna) * EgyptAir (Cairo, Hurghada) * Emirates (Dubai) * Etihad Airways (Abu Dhabi) * Eurocypria Airlines (Larnaca, Paphos) * Inter Airlines (Antalya, Bodrum) * Onur Air (Antalya) * Polet Airlines (Voronezh) * Pegasus Airlines (Antalya, Bodrum) * Royal Jordanian (Amman) * S7 Airlines (Moscow-Domodedovo) * Sky Airline (Antalya) * SunExpress (Antalya, Bodrum, Izmir) * Syrian Arab Airlines (Aleppo, Damascus) * TACV (Sal) * Tajikistan Airlines (Istanbul- Atatürk, Dushanbe) * Tarom (Bucharest-Otopeni, Cluj, Sibiu) * Turkish Airlines (Ankara, Istanbul-Atatürk, Izmir) * Ural Airlines (Ekaterinburg) * UT Air (Tyumen) ==== Hall D ==== * Aer Lingus (Dublin) * Air France (Lyon, Paris- Charles de Gaulle Airport) * Alitalia ** Alitalia Express (Milan-Malpensa, Rome-Fiumicino) * Blu-express (Rom-Fiumicino) * easyJet (Edinburgh, London- Stansted) ** easyJet operated by easyJet Switzerland (Basel/Mulhouse) * Finnair (Helsinki) * FlyNordic (Stockholm-Arlanda) * Iberia Airlines (Madrid) * InterSky (Elba) * KLM Royal Dutch Airlines (Amsterdam) ** KLM Cityhopper (Amsterdam) * Norwegian Air Shuttle (Oslo) * Brussels Airlines (Brussels) ==== Hall E ==== Arrivals only ==== Hall F ==== Hall F is a secure terminal used by Israeli airlines only. * Arkia (Tel Aviv) * El Al (Tel Aviv) * Israir (Tel Aviv) * Sun D'Or (Tel Aviv) === Terminal 2 === Terminal 2 is used by all Star Alliance flights. It was opened on 29th June 2003 and nearly 20-25 million passengers can use it every year. Many passengers like the terminal because connections are easy and fast. The time needed for a connection inside the terminal is only 25 minutes, the airport and Lufthansa say. 26 Airlines use Terminal 2. * Aegean Airlines (Athens, Thessaloniki) * Adria Airways (Ljubljana) * Air Canada (Toronto) * Air China (Beijing) * Austrian Airlines (Vienna) * Carpatair (Timişoara) * Cimber Air (Billund) * Cirrus Airlines (Brno, Erfurt, Kiel [ends October 27, 2006], London-City) * Condor (Agadir, Antalya, Bangkok, Barcelona, Bourgas, Cancun, Cayo Coco, Dalaman, Faro, Fuerteventura, Fuchal, Hurghada, Ibiza, Jerez de la Frontera, La Romana, Lanzarote, Larnaca, Las Palmas, Madrid, Mahe Island, Málaga, Male, Marsa Alam, Mauritius, Naples, Paphos, Palma de Mallorca, Phuket, Punta Cana, Sanat Cruz de la Palma, Sharm el Sheikh, Taba, Tenerife, Varadero, Venice) * Croatia Airlines (Zagreb) * Germanwings (Berlin-Schönefeld, Cologne/Bonn, Hamburg) * LOT Polish Airlines (Gdansk, Warsaw) ** operated by Eurolot (Katowice [starts October 29, 2006], Poznan, Wroclaw) * Lufthansa (Ankara, Athens, Barcelona, Beijing, Berlin-Tegel, Boston, Bremen, Brussels, Bucharest-Otopeni, Budapest, Catania, Charlotte, Chicago-O'Hare, Cologne/Bonn, Delhi, Dubai, Düsseldorf, Frankfurt am Main, Hamburg, Hanover, Helsinki, Hong Kong, Istanbul-Atatürk, Izmir, Kyiv-Boryspil, Lisbon, London-Heathrow, Los Angeles, Madrid, Montréal [seasonal], Moscow-Sheremetyevo, Münster/Osnabrück, Naples, New York-JFK, Nice, Oslo, Palma de Mallorca, Paris-Charles de Gaulle, Rome-Fiumicino, St. Petersburg, San Francisco, São Paulo-Guarulhos, Shanghai-Pudong, Sofia, Stockholm-Arlanda, Tbilisi, Tokyo-Narita, Vienna, Washington-Dulles, Yerevan, Zürich) ** Lufthansa CityLine (Amsterdam, Basel, Birmingham, Bologna, Bordeaux, Bratislava, Bremen, Bucharest-Otopeni, Budapest, Cologne/Bonn, Copenhagen, Donetsk, Dortmund, Düsseldorf, Florence, Gdansk, Geneva, Gothenburg, Hanover, Kraków, Leipzig/Halle, Manchester, Marseille, Milan- Malpensa, Münster/Osnabrück, Naples, Nice, Oslo, Paris-Charles de Gaulle, Porto, Sarajevo, Sofia, Stockholm-Arlanda, Timişoara, Toulouse, Vienna, Warsaw, Westerland-Sylt, Zagreb, Zürich) ** Lufthansa Regional operated by Air Dolomiti (Ancona, Basel/Mulhouse, Berne, Bologna, Cagliari, Milan-Bergamo [ends October 27, 2006], Milan-Malpensa, Naples, Pisa, Prague, Rome-Fiumicino, Trieste, Turin, Venice) ** Lufthansa Regional operated by Augsburg Airways (Dortmund, Florence, Graz, Olbia, Paderborn, Poznan, Prague, Stuttgart, Wroclaw, Zagreb) ** Lufthansa Regional operated by Contact Air (Leipzig/Halle) ** Lufthansa Regional operated by Eurowings (Belgrade, Budapest, Münster/Osnabrück, Naples, Nice) ** Privatair (Newark) * Luxair (Luxembourg, Saarbrücken) * Qatar Airways (Doha) * Scandinavian Airlines System (Copenhagen) * Swiss International Airlines (Zürich) * TAP Portugal (Lisbon) * Thai Airways International (Bangkok) * United Airlines (Chicago-O'Hare, Washington-Dulles) == Central area == The central area is a shopping-mall that is in between the two terminals; the older part which belongs to terminal 1 is an indoor area. The newer part which was built as the same time as the 2nd terminal is a big outside area. == Cargo Area == The airport also has a cargo area. It is used by: * Cathay Pacific Cargo * Emirates Cargo * Qatar Airways Cargo Category:Airports in Germany Category:Buildings and structures in Munich",
 "title": "Munich Airport"
}