{
 "id": "404509",
 "text": "Degory Priest ( 1579–1621)A genealogical profile of Degory Priest, (a collaboration of Plimoth Plantation and New England Historic Genealogical Society accessed 2013) was a passenger on the voyage of the Mayflower in 1620. He signed the Mayflower Compact.Robert Charles Anderson, Pilgrim Village Family Sketch: Degory Priest, (a collaboration between American Ancestors and New England Historic Genealogical Society) The name of Digory Priest or Prust is common in Devon, Cornwall and London England.Charles Edward Banks, The English ancestry and homes of the Pilgrim Fathers who came to Plymouth on the \"Mayflower\" in 1620, the \"Fortune\" in 1621, and the \"Anne\" and the \"Little James\" in 1623 (Baltimore: Genealogical Pub. Co., 1962), p. 75 Priest was a member of the Separatists church. This religion was not allowed in England and many people moved to Leiden Netherlands Priest was one of those families. Priest was a hat-maker from London. There are many legal documents in Leiden which show that he was born in 1579. In 1611 Priest married a widow named Sarah Vincent. Sarah was a sister of Mayflower passenger Isaac Allerton.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris Corp., 2006), p. 197Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691 (Salt Lake City: Ancestry Pub., 1986), p. 341 Priest's became a citizen of Leiden on November 16, 1615 with Isaac Allerton and Roger Wilson. On June 28, 1617 Priest asked two men to sign a legal document that said that he had not hit John Cripps but only “touched his Jabot”. This was the frill on the front of his shirt. Leiden records show that Degory Priest was a witness to a statement signed on January 18, 1618. The statement was signed by Tailor Isaac Allerton. It was about the cost of a crimson coat.Caleb H. Johnson, The Mayflower and her passengers (Indiana: Xlibris 2006) p. 198 On April 9, 1619, Degory Priest and Samuel Lee signed a document for Nicholas Claverly, a Tobacco pipe maker. This document was a promise for Claverly's good behavior. Claverly had arrived in Leiden about 1615 and lived in a house owned by Degory Priest.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691 (Salt Lake City: Ancestry Pub., 1986), pp. 341–342 Records show that on May 3, 1619 Degory Priest was a witness to a document signed by Richard Tyrill. Priest said that Nicholas Claverly was not connected with the murder of Tyrill’s brother John Tyrill. == On the Mayflower == Priest came alone of the Mayflower. His family came over later in another ship. Priest left Plymouth, England on 16 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower reached land at Cape Cod hook. They landed on November 21. They wrote the Mayflower Compact, which made rules on how they would live and treat each other. Degory was one of the signers.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), p. 413George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. The Mayflower was supposed to land in the Colony of Virginia, but the ship was too damaged and they were forced to land at Cape Cod now called Provincetown Harbor.Stratton, 20.George Ernest Bowman, The Mayflower Compact and its signers (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 411–413 William Bradford wrote that seven men died soon after the ship landed. “Digerie Preist” was among them. Bradford said that all these died soon after their arrival in the general sickness. He added that Priest’s had his wife and children were sent for because she was Mr. Allerton's sister.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620–1691, (Salt Lake City: Ancestry Publishing, 1986), p. 409 Degory Priest married Sarah Vincent on November 4, 1611. She was a widow. They had two daughters. Their names were Marah and Sarah.Pilgrim Hall Museum Sarah Priest married a second time. His was also a hat-maker from Leiden. Their burial places are unknown.Charles Edward Banks, The English ancestry and homes of the Pilgrim Fathers who came to Plymouth on the \"Mayflower\" in 1620, the \"Fortune\" in 1621, and the \"Anne\" and the \"Little James\" in 1623 (Baltimore: Genealogical Pub. Co., 1962), p. 145 Priest died early in the first winter, on January 1, 1621 of the “general sickness”. He was 42 years of age. He was buried in an unmarked grave. This was the custom that first winter of 1620–1621. His name appears on the Pilgrim Memorial Tomb, located on Cole's Hill in Plymouth.Memorial of Degory Priest == References == Category:Mayflower passengers Category:1570s births Category:1621 deaths Category:Year of birth unknown Category:People buried in Cole's Hill",
 "title": "Degory Priest"
}