{
 "id": "404525",
 "text": "Thomas Rogers (1572winter 1620/21) Rogers and his oldest son travelled on the Mayflower in 1620 and signed the Mayflower Compact.Charles Edward Banks, The English Ancestry and Homes of the Pilgrim Fathers (New York: Grafton Press, 1929), p. 78Caleb H. Johnson, The Mayflower and Her Passengers (Indiana: Xlibris Corp., copyright 2006 Caleb Johnson), p. 201Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 345- Thomas Rogers was born near Watford, England. He was the son of William and Elanor Rogers.Pilgrim Village Family Sketch: Thomas Rogers (a collaboration between American Ancestors and New England Historic Genealogical Society) The family moved to Leiden Netherlands from England after 1613 because they were Separatists areligion which became illegal in England. Rogers purchased a house and became a citizen of Leiden. He was a merchant of camlet, a luxury fabric made from silk and camel’s hair. The Rogers family were very poor. == Mayflower voyage == Rogers and his 18-year- old son, Joseph left Plymouth, England on 16 September 1620. There were 102 passengers and 30–40 crew. On 19 November 1620, the Mayflower reached land at Cape Cod hook. They landed on November 21. They wrote the Mayflower Compact, which made rules on how they would live and treat each other.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), p. 413George Ernest Bowman, The Mayflower Compact and its signers, (Boston: Massachusetts Society of Mayflower Descendants, 1920). Photocopies of the 1622, 1646 and 1669 versions of the document pp. 7–19. Thomas Rogers signed the Mayflower Compact. The Mayflower was supposed to land in the Colony of Virginia, but the ship was too damaged and they were forced to land at Cape Cod now called Provincetown Harbor. == In Plymouth Colony == Rogers and his wife had six children. Their names were Thomas, Richard and Joseph, John, Elizabeth and Margaret. Thomas and Richard died young. Joseph became a well known person in Plymouth Colony.Eugene Aubrey Stratton, Plymouth Colony: Its History and People, 1620-1691, (Salt Lake City: Ancestry Publishing, 1986), pp. 346-409 Rogers died in the winter of 1620/21. His son Joseph went to live with Governor Bradford and his family. William Bradford wrote: “Thomas Rogers died in the first sickness, but his son Joseph is still living, and is married, and has six children. The rest of Thomas Rogers (children) came over, and now are married, and have many children.” Rogers was buried in an unmarked grave as were most of the Mayflower passengers who died in the first winter. The name of Thomas Rogers is on the Pilgrim Memorial Tomb on Cole's Hill.Memorial for Thomas Rogers ==References== Category:1621 deaths Category:Mayflower passengers Category:Year of birth unknown",
 "title": "Thomas Rogers"
}