{
 "id": "40476",
 "text": "Hampshire College is a private college in Amherst, Massachusetts. The current president of the college is Edward Wingenbach. The motto of the college is Non Satis Scire, which is Latin for \"to know is not enough\". == History == It was created in 1965 by four other colleges as an experiment in higher education. The campus opened and the first class of students arrived in 1970. The Presidents of Amherst College, Smith College, Mount Holyoke College, and the University of Massachusetts got together in the 1950s and early 1960s and realized that there were things their own schools did not do very well. They also thought that the world was changing a lot and needed a college where students would have a lot of responsibility for their own education to be successful in the future. Franklin Patterson and Charles Longsworth were chosen by these schools and wrote a book called The Making of a College that said how Hampshire was to be run and what kind of programs it would offer. Today, this book is considered an inspirational document by Hampshire students and faculty who try to live up to its ideals. ==Program== Hampshire College describes itself as an experimenting college because it is always changing and improving how it does things, rather than doing the same thing as other colleges. Students usually do individual projects in order to move towards graduation. There is some required coursework, but it is not the main point of the school. Students also do not receive grades for completing their work. Instead, they get something called a narrative evaluation, which is a long written explanation of what they did right and what they did wrong. There are also no specific required classes for graduation, but students must take classes in different areas depending on where they are in their studies. The program is divided into three \"Divisions\" rather than four years, and students complete each Division as they show that they are capable of harder work. Most students graduate in four years, but not everyone takes the same amount of time for each Division. *Division I, requires students to complete one course in each of the five \"Schools of Thought\" (see below) and three other courses, either on or off campus. Students are allowed to take classes at any of the other four founding schools. *Division II, the concentration or \"major,\" requires students to learn about a single subject in detail. Each student is responsible for designing their own Division II. They work with a committee of at least two faculty members. Many students choose a faculty committee whose members have the same interests as they do. Division II also has a community service project and a multicultural perspectives requirement (all students must show some study in a culture different then their own). *Division III, the advanced project, requires students to complete a complex project in their field of choice. Division III usually lasts one year and is completed while taking few or no classes. A Division III topic can be a long written paper (it is something like a traditional college's \"bachelor's\" or \"honors\" thesis, or, for the very best students, a Master's or other graduate thesis), but it can also be a collection of creative work (writing, painting, photography, and movie are popular choices) or a hands-on engineering project, or invention. The Hampshire College faculty are not organized in traditional departments but in loosely collected Schools. The Schools' names and subjects have changed over the years, but there have always been between three and five of them. Since 2005, the Schools are: *Cognitive Science (CS): includes linguistics, most psychology, some philosophy, neuroscience, and computer science. *Humanities, Arts, and Cultural Studies (HACU): includes film, some studio arts, literature, media studies, and most philosophy. *Social Science (SS): includes most sociology and anthropology, economics, history, politics, and some psychology. *Natural Science (NS): includes most traditional science and mathematics *Interdisciplinary Arts (IA): includes performing arts, some studio arts, and creative writing. ==Alumni and faculty== ===Notable Hampshire College alumni=== *Ken Burns, documentary filmmaker, The Civil War, Baseball and Jazz *Chuck Collins, political activist, co-founder of United For a Fair Economy *John Dwork, famously received a bachelor's degree in Frisbee (technically, \"Flying Disc Entertainment and Education\") from Hampshire in January 1984 *John Falsey, television writer and producer, co-creator of St. Elsewhere and Northern Exposure *Daniel Horowitz, noted criminal-defense attorney. *Emily Hubley, award-winning animator, Hedwig and the Angry Inch *Will Killingsworth, musician, Orchid (band), Bucket Full of Teeth and Ampere (band) recording engineer, Dead Air Studios *Toby Driver, musician and artist, Kayo Dot and maudlin of the Well *Jon Krakauer, mountain climber and author, Into Thin Air and Into the Wild *Josiah Litant, Hampshire Assistant Dean of Student Services *Jeff Maguire, Academy Award-nominated screenwriter, In the Line of Fire *Eugene Mirman, comedian *Liev Schreiber, stage and screen actor, The Manchurian Candidate, director, Everything is Illuminated *Elliott Smith, singer and songwriter *Lee Smolin, theoretical physicist at the Perimeter Institute *Danny Tamberelli, actor, The Mighty Ducks and television series All That and The Adventures of Pete and Pete *Barry Sonnenfeld, director, Men in Black *Naomi Wallace, playwright, One Flea Spare, Slaugher City *Mike Ladd, Hip Hop MC and member of the Anti-Pop Consortium *Gary Hirshberg, Founder of Stonyfield Farm Yogurt *Joshua Wesson, Founder of Best Cellars, a national chain of affordable wine shops *Evan B. Brandes, Attorney / Author *Thanu Yakupitiyage, activist and DJ ===Notable past and present faculty=== *Eqbal Ahmad, post-colonial political scholar *Leonard Baskin, artist *James Baldwin, writer *Herbert J. Bernstein, theoretical physicist, philosopher and educator *Bill Brand, experimental filmmaker *Susan Douglas, sociologist, writer *Mark Dresser, jazz musician, contrabass virtuoso *Marty Ehrlich, jazz musician *Lynne Hanley, literary critic *Norton Juster, architect and writer *Michael Klare, expert on U.S. defense policy *Yusef Lateef, musician *Michael Lesy, writer *Jerome Liebling, filmmaker and photographer *Lester Mazor, legal scholar, former law clerk to former Chief Justice Warren E. Burger *Abraham Ravett, filmmaker *Eric Schocket, American studies scholar *Frank Holmquist, political scientist focusing on Africa and Kenya specifically *Vivek Bhandari, subaltern studies political scholar *Laurie Nisonoff, feminist economist *Annie G. Rogers, clinical psychologist, writer, poet *Andrew Salkey, writer == Other websites == *Hampshire College *Hampshire College Archives, featuring PDF text of The Making of a College and documents from Hampshire College history *The Re-Radicalization of Hampshire College *The Hampshire College Daily Jolt *The Princeton Review: Hampshire College Category:Colleges and universities in Massachusetts Category:Five Colleges, Incorporated Category:1965 establishments in the United States Category:1960s establishments in Massachusetts",
 "title": "Hampshire College"
}