{
 "id": "40474",
 "text": "The Mass Rapid Transit system, commonly known as the MRT, is a rapid transit system that makes up the railways in Singapore, covering most of the city- state. Following two decades of planning, the system began operations in November 1987 with 5 stations spread over of track. The network has since grown quickly in accordance with Singapore's aim of developing a complex rail network as the core of the country's public transportation system, averaging a daily ridership of 3.384 million in 2019. The MRT is known as one of the best rapid transit system in the world. It is a rapid transit system which links the different places of Singapore together using a network, or different connections of trains. When a person travels from one place to another, he or she boards a train in a train station and then the train moves until the train reaches the place he or she wants to come out, or alight from. Sometimes he or she has to change trains. == Overview == About 3.4 million passengers use the MRT everyday. The system is 231 km long and has 134 stations. Trains run from 5:30 am to 1:00 am every day except for the festive periods, such as Christmas Eve, New Year's Eve and Chinese New Year's Eve. A train comes every 2–3 minutes in peak hours, every 7 minutes during off-peak hours and 5–6 minutes for the weekend service. It is operated by Singapore's SMRT Corporation and SBS Transit. There are currently 6 lines in the MRT system, where they are connected by special stops called interchanges. The lines are North South Line, East West Line, North East Line, Circle Line, Downtown Line and the Thomson-East Coast Line. On 16 December 2011, the MRT network suffered what is likely to be the worst breakdown in its 24-year operating history. 'A power rail problem' made North-South Line trains suddenly lose power and stopped in darkness and without air conditioning for up to an hour accompanied only by light from mobile phones. == Network == Name and color Commencement Last extension Next extension Terminus Stations Length Depot Operator Control Center 7 November 1987 2 November 2019Canberra infill station 2030sSungei Kadut and Brickland infill stations Jurong East Marina South Pier 27 Bishan Depot Ulu Pandan Depot Changi Depot Tuas Depot SMRT Trains (SMRT Corporation) Kim Chuan Depot 12 December 1987 18 June 2017Tuas West extension Pasir Ris Changi Airport Tuas Link 35 28 May 2009 14 January 2012Circle Line extension 2025Circle Line Stage 6 Dhoby Ghaut HarbourFront Marina Bay 30Excluding Bukit Brown MRT Station, which is not in operation Kim Chuan Depot 31 January 2020 13 November 2022Thomson-East Coast Line stage 3 2024Thomson-East Coast Line stage 4 Woodlands North Gardens by the Bay 9 Mandai Depot Mandai Depot Subtotal (lines under SMRT Trains): 101 20 June 2003 20 June 2011Woodleigh station 2023North East Line extension HarbourFront Punggol 16 Sengkang Depot SBS Transit (ComfortDelGro Corporation) Sengkang Depot 22 December 2013 21 October 2017Downtown Line Stage 3 2024Downtown Line Stage 3e Bukit Panjang Expo 34 Tai Seng Facility Building Gali Batu Depot Gali Batu Depot Subtotal (lines under SBS Transit): 50 Total: 128Excluding duplicating interchange stations. == Openings == * 7 November 1987: Yio Chu Kang - Toa Payoh * 12 December 1987: Toa Payoh - Outram Park * 12 March 1988: Outram Park - Clementi * 5 November 1988: Clementi – Lakeside * 20 December 1988: Yio Chu Kang – Yishun * 4 November 1989: Marina Bay – Tanah Merah * 16 December 1989: Tanah Merah – Pasir Ris * 10 March 1990: Jurong East – Choa Chu Kang * 6 July 1990: Lakeside – Boon Lay * 10 February 1996: Yishun – Choa Chu Kang * 10 January 2001: Tanah Merah – Expo * 18 October 2001: Dover * 8 February 2002: Expo – Changi Airport * 20 June 2003: HarbourFront – Punggol * 28 February 2009: Boon Lay – Joo Koon * 28 May 2009: Bartley – Marymount * 17 April 2010: Bartley – Dhoby Ghaut * 8 October 2011: Marymount – HarbourFront * 14 January 2012: Promenade - Marina Bay * 22 December 2013: Bugis - Chinatown * 23 November 2014: Marina Bay - Marina South Pier * 27 December 2015: Bukit Panjang - Bugis * 18 June 2017: Joo Koon - Tuas Link * 21 October 2017: Chinatown - Expo * 2 November 2019: Canberra MRT station * 31 January 2020: Woodlands North - Woodlands South * 28 August 2021: Springleaf - Caldecott * 13 November 2022: Stevens - Gardens by the Bay == Expansion == The MRT system only had two lines, the North South and East West Lines, for more than ten years until the opening of the North East Line in 2003. While plans for these lines, as well as those being built, were made long before, the Land Transport Authority's (LTA) proposal named \"A World Class Land Transport System\" in 1996 showed that the government wanted to greatly expand on the existing system.Land Transport Authority, Singapore 1996, pg. 44-47 The plans allow for the long-term replacement of the bus network by rail-based transportation as the main way of public transportation. It called for the expansion of the 67 kilometres of track in 1995 to over 360 in the year 2030. It was expected that daily ridership in 2030 would have grown to 6.0 million from the current 1.4 million passengers. === Thomson-East Coast Line === The 43-kilometre Thomson-East Coast Line was planned to be completed by 2025 and will consist of 32 stations. It was originally planned to be completed by 2024 but this plan was changed due to the Covid-19 pandemic. It will connect to the North South Line at Woodlands station, Orchard and Marina Bay, to the Circle Line at Thomson, Caldecott and Marina Bay, to the Downtown Line at Stevens and Sungei Bedok, and to the East West and North East lines at Outram Park. The first part, or stage, opened in 2019. The Thomson-East Coast Line was a result of joining two separate lines, the Thomson Line and the Eastern Region Line, which was announced on 15 August 2014. The Thomson Line consisted of the part from Woodlands North to Marina Bay, while the Eastern Region Line consisted of the rest of the joined line. A new extension to the line was announced on 25 May 2019. The new extension will connect the line to Singapore Changi Airport, allowing people arriving from the airport to go to the city without changing to another train. The tracks of the East West MRT line that currently go to the airport will also be used by this extension, which means that trains on the line will go all the way to Tanah Merah station, and there will be no more East West line trains using these tracks. This extension is expected to open by/before 2040. ===North East Line Extension=== To be opened by 2024, the 2-kilometre extension will run from Punggol through Punggol North including the new Punggol Downtown. The extension is for future residents in Punggol North to have access by train to the city centre as well as other parts of Singapore. === Downtown Line === The Downtown Line was built in three stages, with the first opening in 2013, the second in 2015, and the third in 2017. An extension to the third stage, known as Stage 3e, will open in 2025, being 2.2 kilometres long and with two more stations. On 7 March 2015, Senior Minister of Stage for Transport Janil Puthucheary said that there will be a new station called Hume, to be built between the already open stations of Hillview and Beauty World. This station will open in 2025. When Hume opens, the line will be 42 kilometres long and have 37 stations. On 25 May 2019, the Land Transport Authority announced another extension to the second stage of the line to a new station, Sungei Kadut MRT station. This extension will open in the mid-2030s. ===Circle Line Stage 6=== To be opened by 2026, the 4-kilometre extension will run from Marina Bay through Keppel, ending at HarbourFront, making the Circle Line a full continuous circle. ===Jurong Region Line=== First proposed as a LRT line when originally announced in 2001, the Jurong Region Line is now going to be a medium capacity line. The new plan will serve West Coast, Tengah and Choa Chu Kang and Jurong. The line will open in stages from 2026. ===Cross Island Line=== The 50-kilometre Cross Island Line will go across the island of Singapore, passing through Tuas, Jurong, Sin Ming, Ang Mo Kio, Hougang, Punggol, Pasir Ris and Changi. The addition of the new line brings commuters with another way for east–west travel to the current East West Line. It will also connect to all the other major lines to serve as a key transfer line, adding to the role currently fulfilled by the orbital Circle Line; the Cross Island Line will also become the first line to have interchange stations with all existing lines as of 2023. (Under construction lines included). The first stage will open by 2029, and other stages are expected to open by 2031. === Brickland and Sungei Kadut MRT stations === On 25 May 2019, the LTA announced two new stations to be built on the North South line. Brickland station will be built between Bukit Gombak and Choa Chu Kang, while Sungei Kadut will be built between Yew Tee and Kranji. Both stations will open in the mid-2030s. === Possible new line along north-east area === In the LTA's Land Transport Master Plan (LTMP) 2040, there will be studies to see if a new line can be built, between Woodlands, and Greater Southern Waterfront areas. If the line is built, it will be about 30 kilometres long, and will be completed as early as 2040. The line could serve around 400,000 houses, and lower the time needed for travel to the city by up to 40 minutes. == Facilities at the stations == Every station has ticket machines, restrooms (toilets), a passenger service center, which controls what is happening in the train station and has wired radio with the train operator, payphones (public phones) and access for disabled. Some of them have automated teller machines, kiosks and a bus interchange nearby. All stations in Singapore are either elevated or underground, with the exception of Bishan. Underground stations and trains are air-conditioned and have full-height platform screen doors. Elevated stations have half-height platform screen doors. == Rolling stock == A total of 12 types of rolling stock are used on the MRT lines. Almost all of them are powered by 750 voltage current from a third rail, except those on the North East MRT Line, which uses 1500 voltage current from overhead wires. === North South and East West Lines === For the North South and East West Lines, seven types of rolling stock are used. The oldest is the C151, built in 1986-89 by a collaboration between Kawasaki Heavy Industries and three sub-companies, Kinki Sharyo, Nippon Sharyo and Tokyu Car Corp. 66 trainsets are in operation, which were upgraded between 2006 and 2008. 19 more C651s were purchased in 1994 from Siemens AG, followed by 21 more C751B sets, built in 1999-2000 by Kawasaki and Nippon Sharyo. Two companies, Kawasaki and CRRC Qingdao Sifang, have collaborated to build 3 types of rolling stock. The fourth rolling stock in operation is the C151A. They were built between 2010 and 2014, and started operations in 2011. The next rolling stock that started operations is the C151B, which began operations on 16 April 2017. The next rolling stock, being built between 2017 and 2018, is the C151C, and it began operations on 30 September 2018. The newest rolling stock, the R151, began operations on 4 June 2023 on the East West Line. With 106 trains ordered, it plans to replace the C151, C651 and the C751B. === North East Line === On the North East Line, 25 six-car trainsets of the C751A were built from 1999 to 2002 by Alstom. A further 18 trainsets, the C751C, were built by Alstom and Shanghai Electric and entered operation on 1 October 2015. A new model, the C851E, entered service in 2023, with 6 trainsets. === Circle Line === For the fourth MRT line, the Circle Line, 40 three-car trainsets of C830s were built from 2005 to 2008 and began operations in 2009. Together with the C751Cs, the same companies made 24 C830C trainsets which began operations on 26 June 2015. === Downtown Line === For the fifth MRT line, the Downtown Line, 73 three car C951s were built by Bombardier Transportation and began operations in 2013. An additional 15 trains and a final 4 trains were ordered, bringing the total number of C951s to 92 trainsets. === Thomson-East Coast Line === For the sixth MRT line, the Thomson-East Coast Line, 91 four-car trainsets of CT251 rolling stock are built and were delivered between 2018 and 2021, and it began operations in 2020. == Fares and ticketing == Stations are divided into two areas, paid and unpaid, which allow the rail operators to collect fares by controlling entry only through the fare gates, also known as access control gates. These gates, connected to a computer system, are able to read and change electronic tickets that can store data, and can store information such as the initial and destination stations and the duration for each trip.Sharp 2005, pg. 113-115 General Ticketing Machines sell tickets for single trips or allow the customer to purchase more value for stored-value tickets. Standard tickets can be used up to 6 times within 30 days from the day of purchase. The machines also allow the customer to buy more credit for stored-value tickets. Such tickets require a minimum amount of stored credit. As the fare system has been connected together by TransitLink, commuters need to pay only one fare and pass through two fare gates (once on entry, once on exit) for an entire journey, even when transferring between lines operated by different companies. Commuters can choose to extend a trip mid-journey, and pay the difference as they exit their destination station. The ticketing system uses the EZ-Link and NETS FlashPay contactless smart cards based upon the System for e-Payments (SeP) system for public transit built on the Singapore Standard for Contactless ePurse Application (CEPAS) system. This system allows for up to 4 card issuers in the market. The EZ-Link card was introduced on 13 April 2002 as a replacement to the original TransitLink farecard while its competitor the NETS FlashPay card entered the smart card market on 9 October 2009. The adult EZ-link card is at S$15 while the NETS FlashPay card is at S$13. == Safety == Assurance has been given by both operators and authorities, that many actions have been taken in an effort to ensure the safety of passengers, with SBS Transit having to make greater efforts in actively publicising its safety considerations on the driverless North East Line before and after its opening. Safety campaign posters are highly visible in trains and stations, and the operators frequently play safety announcements to passengers and to commuters waiting for trains. Fire safety standards are about the same as the strict guidelines of the US National Fire Protection Association. Platform screen doors are installed at all underground stations, with half-height platform screen doors installed at all above-ground stations. These doors prevent suicides and disallowed access to restricted areas, as well as keeping normal temperatures in stations. Bylaws reduce uncivil, disruptive and dangerous acts, such as smoking, the consumption of food and drink, using safety features in an evil way, and unlawfully going onto the railway tracks. Penalties ranging from fines to jail are given for these offences. Safety concerns were raised among the public after several accidents on the system during the 1980s and 1990s, but most problems have been fixed. On 5 August 1993, two trains collided at Clementi MRT Station because of an oil spillage on the track, which resulted in 132 injuries. There were calls for platform screen doors to be installed at above-ground stations after several incidents in which passengers were killed by oncoming trains when they fell onto the railway tracks at above-ground stations. The people in charge initially rejected such proposals as they felt that the functional purposes were not worth the high cost of installation, but changed their minds when the government announced plans to install half-height automatic platform gates in a speech on 25 January 2008, reasoning that worldwide installations of these gates reduced the market price for them. == Security == Security concerns related to crime and terrorism were not the biggest priority of the system's planners at its original creation. However, after the Madrid train bombings in 2004 and the failed plan to bomb the Yishun MRT Station, the operators deployed private, unarmed guards to patrol station platforms and check the belongings of commuters. Recorded announcements are frequently made to remind passengers to report suspicious activity and not to leave their belongings unattended. Digital closed-circuit cameras (CCTVs) have been upgraded with recording software at all stations and trains operated by SMRT Corporation. Trash bins and mail boxes have been removed from station platforms and concourse levels to station entrances, to remove the risk that bombs will be placed in them. Photography without prior allowance was also banned in all MRT stations since. On 14 April 2005, the Singapore Police Force announced plans to improve rail security by creating a specialised Police MRT Unit, now known as Public Transport Security Command (Transcom). These armed officers began patrols on the MRT and LRT systems on 15 August 2005, conducting random patrols in pairs in and around rail stations and within trains. They are trained and allowed to use their firearms if they need to, including killing if necessary. == Rules == Priority Seating Usually, each MRT carriage has a number of seats designated as 'priority seats' near the train doors for the use of the elderly, pregnant women, parents with babies and those with mobility issues. The use of these seats by those who do not fall into the above categories or do not need seats on the MRT has been a topic of repeated public debate in Singapore. In 2019, LTA launched the \"Can I request a seat?\" initiative. Under this initiative, LTA will provide passengers with a non- visible health or disability condition or a short-term or temporary condition (such as being on holiday) with a corresponding lanyard or sticker that reads \"Can I sit?\" upon request. Eating or Drinking According to Regulation 14 of the Rapid Transport System Regulations, it is prohibited to consume food or drink on MRT carriages or at MRT stations. Offenders can be fined up to S$500. SMRT has stated that this ban also applies to the consumption of snacks (such as sweets) and drinking plain water. Some commentators have argued that SMRT's strict enforcement of this ban, especially in hot weather or for those with legitimate needs (e.g. consuming food or drinks for medical reasons), is disproportionate and unnecessary. Photography Photography and videography at all MRT stations requires a permit between 10am and 4pm on weekdays. Any photos or videos taken inside the premises without a permit are requested to be removed. ==Related pages== * Light Rail Transit (Singapore) * List of Singapore MRT stations * List of Singapore LRT stations ==Notes== == References == ==Other websites== * SMRT Trains * SBS Transit * Land Transport Authority * Transitlink * Public Transport Council Category:1987 establishments in Singapore Category:Buildings and structures in Singapore",
 "title": "Mass Rapid Transit (Singapore)"
}