{
 "id": "404878",
 "text": "Elizabeth Chase Olsen (born February 16, 1989) is an American actress. She was born in Los Angeles, California. She is the younger sister of the actresses Mary-Kate and Ashley Olsen. She had her debut film role in the thriller Martha Marcy May Marlene in 2011, for which she was acclaimed and nominated for a Critics' Choice Movie Award. Olsen received a BAFTA Rising Star Award nomination and graduated from New York University two years later. She is most known for her role as Wanda Maximoff / Scarlet Witch in the Marvel Cinematic Universe movies Avengers: Age of Ultron (2015), Captain America: Civil War (2016), Avengers: Infinity War (2018), and Avengers: Endgame (2019) and in the movie Doctor Strange in the Multiverse of Madness (2022).. She then reprised her role in the Disney+ miniseries WandaVision (2021) and the second season of What If...? (2023). Outside of her work with Marvel, Olsen starred in the monster movie Godzilla (2014), the mystery movie Wind River (2017), and the dramedy Ingrid Goes West (2017). She executive produced and starred as a widow in the drama series Sorry for Your Loss (2018–2019), earning a nomination for a Critics' Choice Television Award. Olsen has since portrayed Candy Montgomery in the miniseries Love & Death (2023), for which she has been nominated for another Golden Globe Award. == Early life and education == Elizabeth Chase Olsen was born on February 16, 1989, in Sherman Oaks, California. Her mother, Jarnie, is a former dancer, while her father, Dave, is a real estate agent. She is the younger sister of twins Mary-Kate and Ashley Olsen, who became television and film actresses as children. Olsen also has an older brother, a younger half-brother, and a younger half-sister. Her parents divorced in 1996. Olsen began acting when she was four years old, appearing in Mary-Kate and Ashley's projects, including the 1994 television film How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. As a child, she took acting classes and spent time at musical theatre camp. Olsen nearly quit pursuing acting in 2004 due to the media attention toward Mary-Kate's eating disorder. She went to Campbell Hall School in Studio City, California. Olsen attended New York University (NYU)'s Tisch School of the Arts, during which she took classes at Atlantic Theater Company and spent a semester at the Moscow Art Theatre School in Russia. She attained understudy roles in the 2008 off-Broadway production of the play Dust and the 2009 Broadway production of the play Impressionism, which led to her securing an agent. Olsen graduated from NYU in January 2013. == Career == === Early roles and acclaim (2011–2014) === Olsen made her film debut in the 2011 thriller film Martha Marcy May Marlene. The film, along with her performance, received critical acclaim following its premiere at the Sundance Film Festival. Olsen earned several award nominations for her portrayal of the titular Martha, a young woman suffering from delusions after fleeing her life in a cult and returning to her family, including those for the Critics' Choice Movie Award for Best Actress and the Independent Spirit Award for Best Female Lead. She attributed her interest in the character to her own fascination with mental illnesses. Olsen next appeared in the horror film Silent House, which garnered her \"rave reviews\". Despite premiering at the Sundance Film Festival alongside Martha Marcy May Marlene, it was released in 2012, during which she also starred in the thriller Red Lights and the comedy Liberal Arts. In January 2013, Olsen garnered a nomination for the BAFTA Rising Star Award at the 66th British Academy Film Awards. She played Edie Parker, novelist Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in the biographical drama Kill Your Darlings. She appeared in the American remake of the 2003 South Korean film Oldboy, playing Marie Sebastian, a nurse who helps the protagonist, played by Josh Brolin, find his daughter. That same year, she starred as the titular Juliet in an off-Broadway production of the play Romeo and Juliet by William Shakespeare. The New York Times critic Ben Brantley described her portrayal as \"an open book, and a slim volume, alternating between saucy petulance and hysteria\". She played the leading role in In Secret, a film adaptation of Émile Zola's 1867 novel Thérèse Raquin. The film was released in February 2014. Later that year, Olsen starred in the monster film Godzilla, opposite Bryan Cranston and Aaron Taylor-Johnson, which received positive reviews and grossed $529 million against a $160 million production budget. She and Dakota Fanning co-starred as teenage girls in Brooklyn in the film Very Good Girls, released that same year, which Josh Duboff of Vanity Fair characterized as unfavorably reviewed. === Marvel Cinematic Universe and continued success (2015–present) === Olsen starred in the 2015 superhero film Avengers: Age of Ultron, a sequel to The Avengers, joining the Marvel Cinematic Universe media franchise and rising to fame. In the film, she portrayed Wanda Maximoff / Scarlet Witch, which marked the comic book character's film debut. She first appeared as the character in a post- credits scene of the 2014 film Captain America: The Winter Soldier, alongside Taylor-Johnson, who portrayed Scarlet Witch's brother, Pietro Maximoff / Quicksilver. Olsen played the part with an accent originating from a fictional country called Sokovia, which she described as similar to Slovakian. She reprised the role in Captain America: Civil War (2016), Avengers: Infinity War (2018), and Avengers: Endgame (2019), the last of which became the second highest-grossing film of all time. Olsen portrayed Audrey Williams, the wife, manager, and duet partner of singer Hank Williams, portrayed by Tom Hiddleston, in the 2015 biographical film I Saw the Light, directed by Marc Abraham. In 2017, she starred as a novice FBI agent in the mystery film Wind River and a social media influencer in the comedy-drama film Ingrid Goes West, both of which were released in August to critical praise. Vulture's David Edelstein found Olsen's \"incongruously high-schoolish demeanor\" in Wind River problematic, while Peter Travers of Rolling Stone wrote that she gave a \"major eye-opener of a performance\" in Ingrid Goes West, deeming it \"toxic perfection\". The following year, she appeared in the Netflix film Kodachrome, playing a caregiver to a photographer, played by Ed Harris. Olsen executive produced and starred as a young widow named Leigh Shaw in the Facebook Watch web television series Sorry for Your Loss, which premiered in September 2018. She said the three years it took to develop the series enabled her to immerse herself in Shaw's impulses. Critics reviewed the series positively, and Olsen's performance, which earned her a nomination for the Critics' Choice Television Award for Best Actress in a Drama Series, was noted as \"stunning\", \"disciplined and sharp\", as well as \"slyly sympathetic\". The series was canceled in January 2020 after two seasons. Alongside Paul Bettany as Vision, Olsen played Scarlet Witch again in the superhero miniseries WandaVision, which premiered on Disney+ in January 2021. In addition to complimenting Olsen and Bettany's chemistry, critics praised the cast, with Vox's Alex Abad-Santos writing Olsen was brilliant in her portrayal and Linda Holmes of NPR highlighting her \"indelible central performance\" in their respective reviews. Olsen earned a Primetime Emmy Award nomination for Outstanding Lead Actress in a Limited or Anthology Series or Movie and Golden Globe Award nomination for Best Actress – Miniseries or Television Film for her performance. She reprised the role in the film Doctor Strange in the Multiverse of Madness, which was released in May 2022. In 2023, she portrayed Candy Montgomery in Love and Death, an HBO Max limited series about a 1980 Texas murder. Following the series, Olsen then starred in Azazel Jacobs’ His Three Daughters. She is scheduled to star in the sci-fi drama movie The Assessment, David Freyne's romantic comedy Eternity, and Todd Solondz's movie Love Child. == Personal life == Olsen has been an atheist since the age of 13 because she believed that \"religion should be about community and having a place to go in prayer, not something that should determine women's freedoms.\" She is an ambassador for the company Bobbi Brown Cosmetics. She and actor Boyd Holbrook were in a relationship from 2011 to 2014. Olsen became engaged to musician Robbie Arnett, of the American band Milo Greene, in July 2019 after three years of dating but after a year of marriage they got a divorce and ended up with one of her good friends who do not know the name off but have the initials AM. Olsen revealed in June 2021 that the two had married. In her first public relationship she also had a secret affair with a woman with the initials VB. Together, they co-wrote the children's books Hattie Harmony: Worry Detective, released in June 2022, and Hattie Harmony: Opening Night, released in June 2023. Olsen and Arnett's experiences with anxiety inspired the books' creations. == Acting credits == === Film === Year Title Role Notes 2011 Martha Marcy May Marlene Martha 2012 Red Lights Sally Owen Silent House Sarah Peace, Love & Misunderstanding Zoe Liberal Arts Zibby 2013 Kill Your Darlings Edie Parker Oldboy Marie Sebastian / Mia Doucett 2014 In Secret Thérèse Raquin Captain America: The Winter Soldier Wanda Maximoff Uncredited; post-credits scene Very Good Girls Gerry Fields Godzilla Elle Brody 2015 Avengers: Age of Ultron Wanda Maximoff / Scarlet Witch I Saw the Light Audrey Williams 2016 Captain America: Civil War Wanda Maximoff / Scarlet Witch 2017 Ingrid Goes West Taylor Sloane Wind River Jane Banner 2018 Kodachrome Zooey Kern Avengers: Infinity War Wanda Maximoff / Scarlet Witch 2019 Avengers: Endgame Wanda Maximoff / Scarlet Witch 2022 Doctor Strange in the Multiverse of Madness Wanda Maximoff / Scarlet Witch Post-production 2023 His Three Daughters Christina Also executive producer 2024 The Assessment Mia Post-production TBA Eternity Joan Post-production === Television === Year Title Role Notes 1994 How the West Was Fun Girl in Car Television film 2016 Drunk History Norma Kopp Episode: \"Siblings\" 2017 HarmonQuest Stirrip Episode: \"The Keystone Obelisk\" 2018-2019 Sorry for Your Loss Leigh Shaw Main role; also executive producer 2021 WandaVision Wanda Maximoff / Scarlet Witch Main role 2021-2022 Marvel Studios: Assembled Herself Episode: \"Assembled: The Making of WandaVision\" 2022 Saturday Night Live Herself Episode: \"Benedict Cumberbatch/Arcade Fire\" 2023 Love and Death Candy Montgomery Miniseries What If...? Wanda-Merlin Maximoff / Scarlet Witch Voice; 2 episodes === Theatre === Year Title Role Venue 2013 Romeo and Juliet Juliet Classic Stage Company ==Awards and nominations== Year Work Award Category Result Ref WandaVision Dorian Television Awards Best TV Performance Gold Derby Television Awards Best Movie/Limited Series Actress Hollywood Television Critics Association Best Actress in a Limited Series, Anthology Series, or Movie Online Film and Television Association Best Actress in a Motion Picture or Limited Series Primetime Emmy Awards Outstanding Lead Actress in a Limited Series or Movie Television Critics Association Individual Achievement in Drama Critics' Choice Television Awards Best Actress in a Limited Series or Movie Made for Television Golden Globe Awards Best Actress in a Miniseries or Motion Picture Made for Television ==References== == Other websites == * * * * Category:Actors from Los Angeles Category:1989 births Category:Living people Category:American atheists Category:American movie actors Category:American child actors Category:American television actors",
 "title": "Elizabeth Olsen"
}