{
 "id": "404819",
 "text": "JibJab is a website created by Evan and Gregg Spiridellis in 1999. JibJab was noticed in the 2004 U.S. presidential election with their video of George W. Bush and John Kerry singing “This Land is Your Land” becoming popular. The company creates original content. It has three main sections on the website: eCards; \"Everyday Fun Sendables\" such as funny videos; and \"Originals,\" including \"This Land,\" \"Time for Some Campaignin',\" and \"Big Box Mart.\" JibJab has also produced commercials for clients like Sony, Noggin, Disney and Cartoon Network. == Political comedy == === Capitol III === JibJab made a flash movie for the 2000 United States presidential election in July 2000, which featured a rap battle between the two main candidates, Vice President Al Gore and Texas governor George W. Bush. Presidents Bill Clinton and George H. W. Bush also make cameos. === Ahnuld for Governor === In 2003, JibJab made a flash movie making fun of Arnold Schwarzenegger running for governor of California. === This Land === For the 2004 United States presidential election, JibJab made a flash movie entitled \"This Land\", which is a parody of This Land Is Your Land. The two main candidates, President George W. Bush and US Senator John Kerry are the main stars. The parody was very popular.https://usatoday30.usatoday.com/money/industries/technology/maney/2004-07-27-jibjab_x.htm === Good to Be in DC === JibJab followed up with another animation set to the tune of Dixie. In this video, animated versions of Bush, Kerry, and their running mates, Dick Cheney and John Edwards, singing about their hopes for the upcoming election. === Second Term === Immediately after Bush's election victory, JibJab released a third video, \"Second Term\", in the tune of She'll be Coming 'Round the Mountain. === Time for Some Campaigning === For the 2008 United States presidential election, JibJab released another animation. It is in the tune of Bob Dylan's The Times They Are a-Changin. Animated versions of the two main candidates, US Senators Barack Obama and John McCain, sing about their hopes for the election. === He's Barack Obama === Upon Obama's election victory and him taking power, JibJab released another animation, where they showed Obama as a superhero. The music is a rock version of When Johnny Comes Marching Home, and it is about Obama's promises as President. === 2012 election === JibJab did not make another animation and instead focused on their e-card business. However, an election web-app released in October of that year. == Year in Review == JibJab started the tradition of making animations reviewing the events that happened each year, with an animation released between Christmas and New Year's Eve, sung to all classic melodies. The tradition originally lasted from 2005 to 2014, however JibJab revived the tradition in 2020 due to popular demand. === \"2-0-5\" (2005) === This is a parody of the songs Auld Lang Syne and Turkey in the Straw, and is sung in the perspective of George W. Bush. The events mentioned include: * Kim Jong-il * A space shuttle mission * Israeli disengagement from Gaza * The 2005 United States federal budget * Decline of U.S. jobs * Al-Qaeda insurgency * Bush's declining popularity * Plame affair grand jury investigation * Karl Rove * Energy Policy Act of 2005 * Michael D. Brown * Harriet Miers Supreme Court nomination * United States housing bubble * Gas prices * Overseas job decline * Hurricane Katrina * Federal Emergency Management Agency * Guantanamo Bay detention camp * Avian influenza * Camp Casey, Crawford, Texas protests * Somalian piracy attack on the MV Seabourn Spirit * Mahmoud Ahmadinejad * The increase in popularity of same-sex marriage in the United States and the 2005 Civil Marriage Act of Canada * Stem cells * Scooter Libby * Tom DeLay === Nuckin' Futz (2006) === This is a parody of Jingle Bells sung in an elementary-school Christmas concert. Notable events mentioned include: * Iraqi Civil War (2006-2008) * War in Afghanistan * Brad Pitt and Angelina Jolie having a baby * Osama bin Laden's compound in Abbottabad * Britney Spears undergoing rehab * The trial and execution of Saddam Hussein * Dick Cheney accidentally shooting friend Harry Whittington during a hunting trip * The 2006 transatlantic aircraft plot and subsequent liquid bans * Hugo Chavez's UN Speech * Tom Cruise's appearance on The Oprah Winfrey Show * 2006 Thai coup d'état * Mel Gibson’s DUI incident * Ted Haggard's sex scandal * Death of Abu Musab al-Zarqawi * Google buying YouTube * Fidel Castro's failing health * Ariel Sharon suffering a stroke * The Jack Abramoff Indian lobbying scandal * Tom DeLay's trial * The William J. Jefferson corruption case * The Mark Foley scandal * Paris Hilton swearing she never had sex * Religious conflict in various parts of the world * Kim Jong-il testing a bomb * Kenneth Lay's death following his trial * Lance Bass coming out as gay * Donald Rumsfield resigning from being Secretary of Defense * Democrats gain full control of Congress for the first time since 1992 * 2006 Lebanon War * Iran's nuclear program === In 2007 (2007) === This is a parody of Billy Joel's We Didn't Start the Fire, portrayed by angels, who were afraid God would be upsetted by the year's tragic events and would rather sugar-coat it in the song. Notable events mentioned include: * Global warming * Terrorism, especially from Osama bin Laden * Oil prices * Michael Vick's role in the Bad Newz Kennels dog fighting investigation * Al Gonzales resigning as attorney general * Lindsay Lohan's cocaine bust * Dennis Kucinich swearing that he saw a UFO * The 2007 Chinese export recalls * The campaigning of Republican candidates Rudy Giuliani, Mitt Romney, John Boehner, John McCain, and Fred Thompson and Democratic candidates Hillary Clinton, John Edwards, and Barack Obama for the 2008 United States presidential election * The War in Dafur * The war in Iraq * The Don Imus Rutgers University women's basketball team controversy * The coverage of Anna Nicole Smith's death * Blackwater USA * Britney Spears' performance at the 2007 MTV Video Music Awards * The Barry Bonds perjury case * The Malibu forest fires * The first flight of the Airbus A380 * Bob Barker retiring as host of The Price is Right * Karl Rove dancing * The O.J. Simpson robbery case * President of Pakistan Pervez Musharraf * President of Syria Bashar al-Assad * President of Iran Mahmoud Ahmadinejad * Caitlin Upton winning the Miss Team USA pageant * Cargill's beef recalls * The Larry Craig scandal * The rise of Facebook * 2007 Boston Red Sox season * The release of Halo 3 for Xbox 360 * The rise of the Nintendo Wii * Martin Scorsese winning at the Academy Awards * Brad Pitt and Angelina Jolie adopting another baby * Knut the polar bear's debut to the public * The initial release of the iPhone * Sanjaya Malakar's performance on American Idol === The JibJab Year in Review 2008 === This is a parody of Miss Suzie sang by Baby New Year 2008. Notable events mentioned include * The 2007-08 financial crisis * The federal takeover of Fannie Mae and Freddie Mac * The liquidity crisis of the American International Group * The bankruptcy of Lehman Brothers * The continuing War in Afghanistan * The automotive industry crisis's impact on the Big Three automobile manufacturers * Jesse Jackson threatening to castrate Obama * Rick Dyer and Matthew Whitton's YouTube video claiming to have seen Bigfoot's corpse in northern Georgia * The Eliot Spitzer prostitution scandal * David Duchovny undergoing rehabilitation * Dick Cheney having a heart attack * Energy crisis * Barack Obama defeating John McCain in the 2008 United States presidential election * McCain forgetting how many houses he owned * Sarah Palin being McCain's running mate, which shocked the press * The Islamabad Marriott Hotel bombing * Bill Gates leaving day-to-day operations at Microsoft * Vladimir Putin's role in the Russo-Georgian War * Hurricanes Ike and Gustav * John Edwards cheating on his wife === Never a Year like '09 (2009) === This is a parody of The Entertainer. Notable events mentioned include * Barack Obama's inauguration *Obama being the first African-American president in American history * Fraud in Afghanistan during a presidential election * Protests over the Iranian presidential election * The Henry Louis Gates arrest controversy * John and Kate Gosselin getting divorced * The finger-biting incident at a pro-Obama healthcare rally in Thousand Oaks, California * The public health insurance option * Sarah Palin resigns from her post as Governor of Alaska * Bill Clinton picks up Laura Ling and Euna Lee during his trip to North Korea * The swine flu pandemic * The David Letterman extortion attempt * The General Motors Chapter 11 reorganization * The \"Miracle on the Hudson\" water landing of US Airways Flight 1549 by captain Sully Sullenberger * The Michael Phelps marijuana scandal * \"Octomom\" makes headlines for giving birth to octuplets * Chicago's failed Summer Olympics bid * Michael Vick returning from his NFL suspension * Brett Favre joining the Minnesota Vikings * Joe Wilson yelling \"You lie!\" during Obama's speech to Congress * The balloon boy hoax * The California budget crisis * The American Recovery and Reinvestment Act of 2009 * Carrie Prejean * Mark Sanford going to Argentina and cheating on his wife * David Souter * Sonia Sotomayor becomes the first Latina to go into the Supreme Court * Obama wins a Nobel Peace Prize * Muammar Gaddafi's United Nations speech * The \"Three-Wolved Moon\" * The deaths of Billy Mays, Patrick Swayze, Walter Cronkite, Farrah Fawcett, Ed McMahon, Ted Kennedy, and Michael Jackson * Keyboard Cat * Levi Johnston's Playboy cover magazine * Kanye West interrupting Taylor Swift === So Long to Ya 2010 (2010) === This is a parody of The Daring Young Man on the Flying Trapeze portrayed by Barack Obama and Joe Biden. Notable events mentioned include: * Tea Party movement * The foreclosure crisis * Obamacare * Joe Biden swearing on national television while introducing Obama during the signing ceremony * An earthquake in Haiti * The eruption of Eyjafjallajökull in Iceland, disrupting air travel across Europe * Greece's debt crisis * The Deepwater Horizon oil spill * The Mosque at Ground Zero * WikiLeaks * The campaign finance reform in the United States * Elena Kagan * Obama's popularity declining * Charles B. Rangel, Stanley A. McChrystal, and Hamid Karzai * The war in Iraq * Don't Ask, Don't Tell Repeal Act of 2010 * Sarah Palin and Glenn Beck on Fox News * Colleen LaRose * Michelle Obama going to Spain * JetBlue flight attendant incident * Rahm Emanuel's resignation * Russian spies * 2010 Times Square car bombing attempt * Support Our Law Enforcement and Safe Neighborhoods Act * California legalizing marijuana * Inherited wars * Debt * Gridlocking politicians * Iran's nuclear threats * Presidential seal falls off podium during speech at women's conference === 2011 Buh-Bye (2011) === This is a parody of My Bonnie Lies Over The Ocean. Notable events mentioned include: * The introduction of Ben & Jerry's new ice cream flavor, \"Schweddy Balls\", inspired by Saturday Night Live * Charlie Sheen * Theft claims by Lindsay Lohan * Charges of sexual assaults against Dominique Strauss-Kahn * The campaigning of Republicans Mitt Romney, Rick Perry, and Herman Cain for the 2012 United States presidential election * The trial and conviction of Dr. Conrad Murray * Arnold Schwarzenegger's love child scandal * Standard & Poor lowering America's rating * The high unemployment rate * The United States debt-ceiling crisis * Weinergate * Taxation and Class War debates * Rupert Murdoch getting hit with a pie * The 2011 United States listeriosis outbreak * Greek debt * The Arab Spring (including the 2011 Egyptian revolution and the 2011 Libyan civil war) * The death of Muhamar Gaddafi * The removal of Don't ask, don't tell * The claims and denials of homosexuality in Sesame Street characters Bert and Ernie * The death of Osama bin Laden * An earthquake and nuclear crisis in Japan * Riots in Great Britain * The 2011 end times prediction by Harold Camping * The widespread 2012 phenomenon (also called the Mayan Prophecy or the Mayan Apocalypse) * The short-lived marriage by Kim Kardashian and Kris Humphries * Jessica Simpson and Beyoncé have babies * The bankruptcy of Borders Group * Netflix policy changes lead people to unsubscribe, consequently losing over 75% brand value * Justin Bieber's new hairstyle * Rebecca Black's hit song \"Friday\" * The Royal Wedding * The Occupy Wall Street movement and the widespread of the Occupy movement * The deaths of Steve Jobs, Elizabeth Taylor, Betty Ford, Randy Savage, Andy Rooney, Peter Falk, Ryan Dunn, and Amy Winehouse * The Nyan Cat * The last Space Shuttle mission * The incident in Zanesville, Ohio when exotic animals, such as lions, tigers, and bears were released. === 2012 The End is Near (2012) === This is a parody of Down By The Riverside portrayed by Mayans. Notable events mentioned include: * Global warming causing Arctic ice to melt * Felix Baumgartner jumping to solid ground from the edge of the atmosphere (Red Bull Stratos) * The ongoing conflict in Libya * The United States fiscal cliff * Zumba * Fifty Shades of Gray * Sam Champion and Anderson Cooper coming out as gay * Chick-Fil-A hating gay people * Kristen Stewart cheating on Robert Pattinson * The divorce of Katie Holmes and Tom Cruise * Lance Armstrong blowing his career for using steroids * The disappointing price plunge of Facebook stock once the company went public * The record-breaking success of Marvel's Avengers movie, surpassing the same year's films The Dark Knight Rises; The Hunger Games and The Amazing Spider- Man * Rush Limbaugh's sexist tirade against Sandra Fluke, calling her such names as a \"slut\" * Disney's purchase of Lucasfilm * Here Comes Honey Boo Boo * Gangnam Style by Psy * The failed restoration of Elías García Martínez's Ecce Homo by amateur restorer Cecilia Giménez * Erhmagerd memes * The Secret Service escort scandal * The Petraeus scandal * Obamacare * The 2012 United States presidential election, Barack Obama defeating Mitt Romney * The Olympics * Arnold Schwarzenegger's autobiography Total Recall: My Unbelievably True Life Story * The deaths of Michael Clarke Duncan, Andy Griffith, Phyllis Diller, Sherman Hemsley, Dick Clark, Larry Hagman, Whitney Houston, Jerry Nelson, Donna Summer, Neil Armstrong, Hector Camacho, Alastair Burnet, Ernest Borgnine, Maurice Sendak, Dave Brubeck, and Ray Bradbury * Hurricane Sandy * Fail Mary, the controversial game between the Green Bay Packers and Seattle Seahawks that led to public outcry over NFL's replacement referees * Israel and Palestine arguing * Snooki having a baby === 2013 What a Year (2013) === This is a parody of Give My Regards To Broadway. Notable events mentioned include: * The 2012–13 Egyptian protests and the overthrow of Mohamed Morsi * Drone warfare in Pakistan * Edward Snowden exposing the NSA scandal * Sequestering * A government shutdown * Obamacare * Rob Ford smoking crack * Weinergate again * The movie Gravity * The Pope quits * The striking down of the Defense of Marriage Act and California Propisition 8 * Kanye West having a baby * A royal baby * The popularity of The Walking Dead and Breaking Bad, as well as the latter's series finale * The launch of the iPhone 5S and 5C * Harlem Shake by Bauuer * Wrecking Ball by Miley Cyrus * Jeff Bezos buying the Washington Post * Paula Deen allegedly saying the N-word * Blurred Lines * The deaths of James Gandolfini, Lou Reed, Nelson Mandela, and Margaret Thatcher among others * Blockbuster going out of business * Batkid * Grand Theft Auto V * What Does the Fox Say by Ylvis * Floods in Colorado * A typhoon in the Philippines * A tornado in Oklahoma * Sharknado * The Justin Bieber-Anne Frank controversy * Marissa Mayer buying Tumblr * The Hunger Games: Catching Fire * Jennifer Lawrence playing Katniss Everdeen * Jason Collins coming out as gay === 2014 You are History (2014) === This is a parody of Beethoven's 9th Symphony. Notable events mentioned include: * 2014 Winter Olympics * 2014 Israel–Gaza conflict * The December 2014 Sony Pictures Entertainment hack and temporary cancellation of The Interview * The How I Met Your Mother series finale * Renée Zellweger's facial reconstruction * The 2014 Omar J. Gonzalez White House intrusion * Kim Kardiashian's butt * ISIS * Russia fighting against Ukraine * The Republicans taking over Congress * Barack Obama's executive orders * Michael Brown and Eric Garner's deaths, and subsequent unrest * Ebola * Washington, D.C. and Colorado legalizing marijuana * Jay Leno retiring from the Night Show, being replaced by Jimmy Fallon * The ending of Colbert Report * All About that Bass by Megan Trainor * Shia LaBeouf no longer being relevant * Roger Goodell terminating Ray Rice from the Baltimore Ravens and Adrian Peterson from the Minnesota Vikings over domestic violence cases * The marriage of Brad Pitt to Angelina Jolie and George Clooney to Amal Alamuddin * The divorce of Chris Martin and Gwyneth Paltrow * Justin Bieber's egg-throwing and DUI incidents, subsequent arrest, and continued career downfall * The Solange Knowles-Jay-Z elevator brawl * Cosmos: A Spacetime Odyssey hosted by Neil deGrasse Tyson * The Rosetta Spacecraft successfully landing on a comet * The success of Guardians of the Galaxy and Interstellar * 4Chan * \"Happy\" by Pharrell Williams and his giant mountie hat from the 56th Annual Grammy Awards * \"Weird Al\" Yankovic * Jane Foster becomes Marvel Comics' first ever female Thor * The deaths of Casey Kasem, Norman Bridwell, Robin Williams, Sid Caesar, Pete Seeger, Richard Attenborough, Mickey Rooney, Maya Angelou, Jan Hooks, Harold Ramis, Joan Rivers, and Philip Seymour Hoffman * The 2014 FIFA World Cup, specifically Germany's 7-1 thrashing of Brazil in the semifinals * \"Anaconda\" by Nicki Minaj and Eaten Alive * The iPhone 6 * Malaysia Airlines aircraft losses (The disappearance of Malaysia Airlines Flight 370 and shooting down of Malaysia Airlines Flight 17) * Potato Salad Kickstarter * Gamergate controversy * The Chase Bank, Home Depot, and Sony data breaches * Tracy Morgan's traffic accident and subsequent lawsuit against Walmart * The Washington Redskins change their logo * Malala Yousafzai winning a 2014 Nobel Peace Prize * The discovery of Dreadnoughtus schrani, believed to be the largest dinosaur ever to exist * Star Wars: The Force Awakens announcement * Janet Yellen becomes Chairwoman of the Federal Reserve Board of Governors * The racist comments made by Donald Sterling, and the ensuing controversy === 2025 Happy Birthday (2025) === This is an original song. Notable events mentioned include: * Taylor Swift winning at the Grammys * Anora winning an Academy Award * Dog * Donald Trump getting impeached * The COVID-19 pandemic and resulting lockdowns * The usage of frogs * The use of \"Karen\" as an insult * The use of hand sanitizer during the pandemic * The closing of barber shops during the pandemic, resulting in \"pandemic hair\" * Panic buying of toilet paper during the pandemic * The use of the app Zoom to communicate during the pandemic * The closing of movie theaters during the pandemic, resulting in the rise of streaming service * The killing of George Floyd and subsequent unrest * Donald Trump's tweets * Sweatpants * Tiger King * The murder hornet scare * The rise of Tik Tok and Donald Trump's attempt to ban the service * Jeff Bezos being rich * Sports events held in empty stadiums due to the pandemic * LeBron James wins his fourth NBA championship * The deaths of David Lynch, Tom Robbins, and Pope Francis, among others * Incidents during the 2020 United States presidential election, including Donald Trump interrupting Joe Biden and a fly landing on Mike Pence * The delay of the final results of the election, due to mail-in voting caused by the pandemic * Joe Biden defeating Donald Trump in the election, and Trump's accusitions of voting fraud and attempts to overturn the election in favor of Trump * US West Coast fires * The failing economy caused by the pandemic Animated by John Joven ==References== Category:American websites Category:1999 establishments in California",
 "title": "JibJab"
}