{
 "id": "404904",
 "text": "County Meath () is a county in Ireland. It is part of the province of Leinster. It is named after the ancient Kingdom of Mide (in Gaelic Mide means \"middle\"). 184,135 people lived in the county according to the 2011 census. The county town is Navan, this is where the county hall and government are located. Trim used to be the county town. The River Boyne flows through the county. == Main towns == # Navan 28,559 people # Ashbourne 11,355 people # Laytown-Bettystown-Mornington 10,889 people # Ratoath 9,043 people # Trim 8,268 people # Dunboyne 6,959 people # Kells 5,888 people # Duleek 3,988 people # Dunshaughlin 3,903 people # Stamullen 3,130 people # ==History== The county is sometimes known by the nickname \"The Royal County\" because of its history as the seat of the High King of Ireland. County Meath formed the eastern part of the former Kingdom of Mide. The seat of the High King of Ireland was at Tara which is not far from Navan. The archaeological complex of Brú na Bóinne is 5,000 years old. It includes the burial sites of Newgrange, Knowth and Dowth, in the north-east of the county. It is a UNESCO designated World Heritage Site. ==Economy== The county has a lot of farms, mainly cattle, dairying, potatoes and grain. Meath is Ireland's leading county producer of potatoes, and a significant producer of beef, barley, milk, wheat, and root vegetables. Europe's largest underground lead-zinc mine, Tara Mines, has operated since 1977, at a location to the west of Navan. ==Main roads in Meath== * The M1 motorway linking Dublin and Belfast * The N2 / M2 motorway linking Dublin and Derry * The N3 / M3 motorway linking Dublin and Cavan * The N4 / M4 motorway linking Dublin and Sligo ==Places of interest== * The Hill of Tara, an ancient historical site. * Castles at Trim, Slane (private), Dunsany (limited opening), Killeen (A Hotel). * Religious ruins at Trim (two), Bective, Slane (two), Dunsany, Skryne (Skreen). * 2500-year-old mound structures of disputed origin at Teltown. Teltown is home to Ireland's pre- Olympic Games, which some records date back to 1869 BCE. * Brú na Bóinne Unesco World Heritage Site. * Loughcrew, an ancient historical site. ==References== ==Other websites== *Meath County Council *Meath Tourism *CSO Website *County Meath History Geography map guide",
 "title": "County Meath"
}