{
 "id": "404998",
 "text": "The Jeopardy! Teen Tournament is a yearly tournament on the American television game show Jeopardy! It features middle school and high school students between the ages of thirteen and eighteen. The tournament plays like the Tournament of Champions. 15 contestants play in a two week tournament. The first five games are the quarterfinals, with three new contestants each day. The winners of the five games move on to the semi-finals. The four losing contestants with the highest scores also move on as \"wild card\" players. If there is a tie at the end of a game, a Final Jeopardy!-type answer is given, and the first player to ring in with the correct response wins the game. If all three players have a score of zero, none of the contestants move on to the semi-finals, and another wild card spot is added. The next three games are the semi-final games. The three winners of the semi-finals move on to the finals. The last two games are the two-day finals. In both games, the contestants start with zero scores, and the contestants' final scores from the two days are added together to see who is the winner. The contestant with the highest score from the two days wins. The other two contestants win smaller cash prizes. ==Contestant selection== ===1990s=== Would-be contestants mailed postcards with their names and addresses to Jeopardy!. 1,200 teens were selected at random from the postcard entries and were invited to come (at their own expense) to one of four regional test centers (e.g. Houston, Minneapolis, Philadelphia, and Los Angeles) to take a timed written qualifying examination with the 50 clues read by Alex Trebek on a video monitor at the front of an exam room. Passing scorers were invited back for an interview and mock game using an electronic buzzer system. Their photographs are taken for their files, and they are asked to fill out a short information sheet with interesting facts about themselves that may be later used by Alex Trebek during the interview portion of the show. Selected contestants and alternates were notified that they had been chosen to appear on the show one to two months later. They are then flown to Los Angeles to tape the show. Taping occurs over a period of two days, with the five quarterfinals played on the first day and the three semifinals and two final games played on the second day. Accommodations were provided for the contestants at the Beverly Hilton in Beverly Hills, with taping taking place at the Sony Pictures Studios in Culver City, California. ===2000s=== Contestants registered on the Jeopardy! web site rather than submitting postcards. As before, a select number of registrants were invited to audition and take a written test at a regional audition. Accommodations for contestants are provided at the Hilton in Universal City, California. ===2006–2019=== All web site registrants take a 50-question timed online test at one set test time, usually late February. The test is given using Adobe Flash and takers are given 15 seconds per clue to type in their responses. A random selection of those who pass the test are invited to attend regional auditions in November at 4 locations around the United States at which another 50-question written test is given, followed by interviews and mock games. The number of students selected for the regional auditions is usually around 300, from which 15 are selected for the show. ==Prizes== Year(s) Finalists (guaranteed amounts) Semifinalists Quarterfinalists Winner Second place Third place 1987 $25,000 (and a spot in the Tournament of Champions) $5,000 $5,000 $1,000 1988-Winter 1997 $10,000 $7,500 Fall 1997–2000 $15,000 $10,000 $2,500 2001 $50,000 2002–2003 $20,000 $15,000 2004–2005 $75,000 $25,000 2006–2014 $10,000 $5,000 2016−2019 $100,000 $50,000 $25,000 ===Other prizes=== * Until 2000, all Teen Tournament winners were invited to participate in the Tournament of Champions. When eligible, eight Teen Tournament winners made the Tournament of Champions semifinals, but none ever advanced to the finals. * In 1999 and again from 2001 to 2003, the Teen Tournament winner was awarded a new car (a Chevrolet Cavalier in 1999, a Chevrolet Tracker in 2001, a Mitsubishi Eclipse GS Convertible in 2002, and a Volkswagen New Beetle in 2003). * Contestants in the 2005 Teen Tournament were awarded a computer package. * Some Teen Tournament winners were later invited to Jeopardy!'s \"all-time best\" tournaments. ** 1989 winner Eric Newhouse was a Super Jeopardy! semifinalist in 1990, a Million Dollar Masters finalist in 2002, and received a bye to the second round of 2005's Ultimate Tournament of Champions. ** All but 2 Teen Tournament winners to that point competed in 2005's Ultimate Tournament of Champions, with 1992 winner April McManus & 1995 winner Matthew Zielenski both advancing to the quarterfinals. ** 1991 winner Andrew Westney competed in the 1980s round of 2014's Battle of the Decades tournament (after being voted in as the fan favorite amongst past champions from the 1980s in an online vote), but lost in his match. ** 2013 winner Leonard Cooper competed in 2019's All-Star Games tournament as a member of Team Austin Rogers. His team wound up competing in the wildcard match where they were eliminated, collecting and splitting $75,000. ** 2019 Semifinalist and 2023 High School Reunion winner Justin Bolsen competed in the 2024 Tournament of Champions. ** Fall 2008 semifinalist Brandon Saunders and Cooper competed in the 2024 Invitational Tournament. ** 2018 winner Claire Sattler, 1st runner-up Maya Wright, 2019 winner Avi Gupta, and semifinalist Jackson Jones competed in the 2025 Invitational Tournament. ==List of participants== The following is a list of contestants and where they placed in the tournament. Winners and runners-up who earned more than the minimum guarantees are as indicated in parentheses. Finalists Semifinalists Quarterfinalists Season 3 (February 16–27, 1987) Winner: Michael Galvin 1st runner-up: Mitch Epner ($13,800) 2nd runner-up: Dana Venator Mike Becker Paul Egendorf Brian Kalt Salil Kumar Lisa Patterson David Simon Felicia Corralez Creswell Formey Curt King Dawn Marie Nolan Sara Stanchina Amy Wilson Season 4 (February 8–19, 1988) Winner: Michael Block 1st runner-up: David Javerbaum ($21,400) 2nd runner-up: David Graham ($14,300) Jason Albert Chris Capozzola Sascha Dublin Neil Gronewetter Mark Wong Stefanie Wulfestieg Mia Diamond Sarah Fanning Delaine Foss Gene Hayes Eric Reid Julie Robichaux Season 5 (February 6–17, 1989) Winner: Eric Newhouse ($28,100) 1st runner-up: Stanley Wu ($15,700) 2nd runner-up: Elena Whitley ($13,400) Kristen Brimus Dan Chase Ryan Godfrey Matt Lindley Peter Morris Matt Pearson David Dodson Tracy Fisher Marny Helfrich Samantha Moeschler Greg Parde Laura Spear Season 6 (February 5–16, 1990) Winner: Jamie Weiss ($26,000) 1st runner-up: Andrew McGeorge ($15,400) 2nd runner-up: Richard Morris ($11,799) Peji Ghanouni Mike Grant Scott Hoffman Beth Mullins Wen Shen Avi Stadler Chris Black Jennifer Dikes Dionne King Sharon Kristal Kate Veksler Stacey White Season 7 (February 11–22, 1991)Jeopardy Teen Tournament Intros Winner: Andy Westney 1st runner-up: Dana Bacon ($17,400) 2nd runner-up: Julie Knauer ($13,992) Joann Chan Kareem Crayton Agatha Feltus Robert Fielding Maggie Large Jim Paluszak Chris Beckner Dan Gordon Francesca Khactu Christy Peterson Lauren Sager Hanna Stotland Season 8 (February 24–March 6, 1992) Winner: April McManus 1st runner-up: Cori Van Noy ($10,600) 2nd runner-up: Jill Young Dylan Fulmer Pat Gavin Matt Kane Rob Marus Raj Raghavan Becky Slitt Jason Colby KC Harris Muffy Marracco Morris Melissa Murray Trucle Nguyen Adrienne Williams Kevin Hayes Season 9 (February 15–26, 1993) Winner: Fraser Woodford ($28,999) 1st runner-up: Jesse Roach ($12,600) 2nd runner-up: Mit Robertson ($8,400) Anne Black Nancy Dickman Patricia Larash Lev Osherovich Carrie Pruett Suj Vijayan Chris Dobbertean Jessi Gile Brent Keeling Becky Pawlowski Colin Rafferty Scott Steiger Season 10 (February 14–25, 1994) Winner: Matt Morris ($29,601) 1st runner-up: Peter Steffen ($22,999) 2nd runner-up: Paul Loeffler ($13,200) Jesse Irwin Jeremy Manta E.J. Sieracki Gerry Tansey Dorothy Thompson Felicia Wu Scott Alport Rebecca Cinderbrand Alice Handley Carsten Reichel Valerie Volcovici Jonathan Zimmerman Season 11 (February 6–17, 1995) Winner: Matthew Zielenski ($42,300) 1st runner-up: Susannah Batko-Yovino ($26,200) 2nd runner-up: Deborah Sager ($17,300) Chris Jacobs Sujit Raman Mathew Sandler Shannon Shelton Chuck Truesdell Halla Yang Erika Brown Courtney Donovan Gwen Shen Gus Splittorf Jim Stichen Martha Van Hoy Season 12 (May 6–17, 1996) Winner: Amanda Goad ($31,200) 1st runner-up: Derek Bridges ($31,200) 2nd runner-up: Joe Gurski ($24,800) Linda Alila Julee Baber Anthony Chiu Peter M. Friedman Geoffrey Hatchard Ben Healy Carmen Abrazado Heather Burnett Talisha Burton Lawson Fite Penelope Pajel Jodi Sangster Season 13 (February 3–14, 1997) Winner: Josh Den Hartog 1st runner-up: Justin Powell ($17,125) 2nd runner-up: Akiva Fox Fran Bigman Matthew Burgess Pooja Dhume Brandon Frantz Faith Hillis Tanis O'Connor Chad Bell Audrey Droesch Sharon Druck Rita Hamad Brian Joseph Alex Rubalcaya Season 14 (November 3–14, 1997), with its second week at DAR Constitution Hall in Washington, D.C. Winner: Sahir Islam ($26,300) 1st runner-up: Enos Williams ($20,800) 2nd runner-up: Kristen Stuckey ($14,400) Evan Johnson Jonathan Lowe James Sumner Kathy Thompson Bea Vo Kira Whelan Julie Anastasi Meghan Arnold Rachel Johnson Deon Lackey Jennifer Rehmann Justin Watkins Season 15 Teen Reunion Tournament (November 16–20, 1998) at the Boch Center in Boston, Massachusetts Winner: Eric Newhouse 1st runner-up: David Javerbaum 2nd runner-up: Chris Capozzola Sascha Dublin Creswell Formey Samantha Moeschler Peter Morris Julie Robichaux Amy Wilson Stan Wu Stefanie Wulfestieg Dana Venator Season 15 (February 22–March 5, 1999) Winner: Melissa Sexstone 1st runner-up: Trish Ranney ($17,600) 2nd runner-up: Elizabeth Nyman Jeff Cary Lina Ghosh Katie Halliday Oliver Longwell Sam Sanker Joan Williams Nate Budde Milo Dochow Brian Dunlap Lindsay Embysk Kitty Roberts Rubani Trimiew Season 16 (November 1–12, 1999) with its second week at the Theater at Madison Square Garden in New York City Winner: Chacko George 1st runner-up: Emily Deveau 2nd runner-up: Kristi Jones ($10,700) Jack Challis Erin Gell Gerrit Hall Brittan Heller Chrissy Ijams Elizabeth Norton Miguel Dickson Scott Duquette Brian Golden Marcia Hensley Brian Polk Adam Trabka Season 17 (April 30–May 11, 2001) at the Pennsylvania Convention Center in Philadelphia, Pennsylvania Winner: Graham Gilmer 1st runner-up: Andy Siegler 2nd runner-up: Colleen Mahoney Ryan Ballangee Logan Bell Katherine Bushey Misti Coronel Jonathan Reinstein Alexis Stevens Caley Anderson Paige Feldman Tom Hartmann Nicole Reimer Amanda Trujillo Farah Zolghadr Season 18 (February 4–15, 2002) Winner: Bernard Holloway 1st runner-up: George Nelson ($29,497) 2nd runner-up: Seth Disner ($28,900) Lindsey Bartlett Heidi Greimann Emily Karrs Andy Kravis Evan Stewart Liana Walters Anna Gohmann Blake Hernandez Seveen Kannankara Margaret Monroe Allie Pape Dan Royles Season 19 (February 3–14, 2003) Winner: John Zhang 1st runner-up: Tyler Allard ($28,400) 2nd runner-up: Anthony Valente ($24,799) Russell Berris Stephanie Ehresman Tara Karr John Matthews Benjamin Swartz Shuyu Wang Susan Bellenot Kendra Chapman Jonathan Gillerman Joel Knight Brittany McCants Elizabeth Mullowney Season 20 (February 9–20, 2004) Winner: Jennifer Wu 1st runner-up: Chris Holden 2nd runner-up: Courtney Bennis Meghan Apfelbaum Heather Goodlett Kerry Lambeth Muhammad Meigooni Matt Nordsten Oliver Sherouse Ashley Anderson Emily Birkel Lauren Drell Brad Hoff Jason Rindenau Zach Schoepflin Season 21 (January 26 – February 8, 2005) Winner: Michael Braun 1st runner-up: Wes Kovarik ($30,000) 2nd runner-up: Anne Shivers ($18,000) Caitlin Cook Ruvani Fonseka Steve Golden Jimmy Li Peter Severson Orlando Zambrano Vanamali Compton Amy Fletcher Allan Long Whitney Prince Kerri Regan Chloé White Season 22 (February 6–17, 2006) Winner: Papa Chakravarthy 1st runner-up: Andrew Kreitz 2nd runner-up: Matt Klein Camille Bullock Joseph Graumann Iddoshe Hirpa David Hoffelmeyer Sebastian Johnson Allison Peña Laura Ansley Katie James Loren Loiacono Lauren Romero Kenneth Schlax Andrew Watkins Season 23 (February 5–16, 2007) Winner: David Walter 1st runner-up: Ben Schenkel ($42,800) 2nd runner-up: Stephen Fritz ($25,460) Caroline Bartman Frank Firke Heidi Fogle Naomi Hinchen Myles Jeffrey Hank Robinson Kristin Briggs Allison Dziuba Jeffrey Gerlomes Caroline Jones Heidi Liu Eliza Urban Season 23 Teen Tournament Summer Games (July 16–27, 2007) Winner: Meryl Federman 1st runner-up: Greg Peterson ($38,600) 2nd runner-up: Kyle Neblett ($36,400) Lisa Ackerman Jeffrey Baer Kriti Gandhi Rachel Gottesman Andy Hutchins Aiden Pink Kristiana Henderson Amy Levine Tommy Maranges Lindsey Nicolai Ben Noe Amy Varallo Season 24 (February 11–22, 2008) Winner: Rachel Horn 1st runner-up: Rachel \"Steve\" Cooke ($25,000) 2nd runner-up: Zia Choudhury ($18,000) Hunter Brown Will Casper Todd Faulkenberry Katie Gill Melissa Luttmann Naren Tallapragada Maria Bennici Bonnie Cao Mollie Haycock Becky Kralle Janelle Lambert Nick Philip Season 25 (November 10–21, 2008) Winner: Anurag Kashyap 1st runner-up: Bradley Silverman ($44,600) 2nd runner-up: Audrey Hosford ($26,400) Ben Chuchla Shelby Malone Sarah Marx Brandon Saunders Jay Schrader Karan Takhar Haley Batz Charlie Carbery Casey Clough Katie Houghton Drew Scheeler Christopher Weis Season 26 (November 2–13, 2009) Winner: Rachel Rothenberg 1st runner-up: Will Dantzler ($31,600) 2nd runner-up: Aidan Mehigan Zach Blumenfeld Solomon Howard Gabriel Johnson Hema Karunakaram Gabe Orlet Lindsay Oxx Bonny Jain Emily Lever Stephanie Radke Samantha Reback Kennedy Stomps Forrest Sturgill Season 27 (February 17–March 2, 2011) Winner: Raynell Cooper 1st runner-up: Kailyn LaPorte ($42,600) 2nd runner-up: Raya Elias-Pushett ($20,851) Nikhil Desai Erin Hart Idrees Kahloon Lindsey Thiesfeld Kate Wadman Brandon Welch Cosi Audi Raphie Cantor Steven Ho Christian Ie Carlee Jensen Andrew Van Duyn Season 28 (April 30–May 11, 2012) with its second week at DAR Constitution Hall in Washington, D.C. Winner: Elyse Mancuso ($79,600) 1st runner-up: Rose Schaefer ($36,000) 2nd runner-up: Catherine Briley ($31,000) Krishna Bharathala Evan Eschliman Ben Greenho Anshika Niraj Eliza Scruton Kevin Yang Morgan Flood Gabriela Gonzales Jeff Haylon Sam Leanza Caleb Olson Rob Schrader Season 29 (January 30–February 12, 2013) Winner: Leonard Cooper 1st runner-up: Barrett Block ($35,600) 2nd runner-up: Nilai Sarda ($26,400) Tori Amos William Crouch Kelton Ellis Emily Greenberg Irene Vazquez Joe Vertnik Lila Anderson Arjun Byju Olivia Hummer Brittany Poppen Katie Stone Jordan Villanueva Season 30 (July 21–August 1, 2014) Winner: Jeff Xie 1st runner-up: Alan Koolik ($54,200) 2nd runner-up: Cooper Lair ($31,200) Kat Deabill William Golden Selena Groh Sam Lerner Sydney Mokel Joe Taglic Nikki Airi Eileen Bunch Erin Christopher Kevin Huang Ananya Nrusimha Josiah Takang Season 33 (November 9–22, 2016) at DAR Constitution Hall in Washington D.C. Winner: Sharath Narayan 1st runner-up: Alec Fischthal 2nd runner-up: Michael Borecki Lily Allingham Lucia Geng Apurva Kanneganti Antonio Karides Emily LaMonica Connor Pierce Leeyu Addisu Jack Bekos Porter Bowman Sabrina Duong Michael Kwan Jasmine Wheeler Season 35 (November 7-20, 2018) Winner: Claire Sattler 1st runner-up: Emma Arnold 2nd runner-up: Maya Wright Tim Cho Jack Izzo Rohan Kapileshwari Caleb Richmond Audrey Satchivi Autumn Shelton Maggie Brown Rotimi Kukoyi Anish Maddipoti Dan Oxman Isabella Pagano Rhea Sinha Season 35 (June 17-28, 2019) Winner: Avi Gupta 1st runner-up: Ryan Presler 2nd runner-up: Lucas Miner Justin Bolsen Jackson Jones Hannah Nekritz Teagan O'Sullivan Eesha Sohail Shriya Yarlagadda Rohit Kataria Sreekar Madabushi Stephanie Pierson Alison Purcell Audrey Sarin Sophia Weng Amanda Goad and Derek Bridges were tied for first place at the end of the 1996 Teen Tournament. The tie was broken in a special tiebreaker round. The category was U.S. Cities and the answer was \"A November 1995 Bosnian peace accord is named for this city\". The correct response, given by Amanda, was \"What was Dayton, Ohio?\". The 2012 Teen Tournament also ended in a tie in the last quarterfinal match between Evan Eschliman and Gabriela Gonzales. The category was Literary Characters and the answer was \"Although he doesn't actually appear in 1984, his presence is everywhere—on posters, coins & telescreens\". The correct response, given by Evan was \"Who is Big Brother?\" (Evan advanced to the semifinals, but Gabriela did not have enough money to make it via wildcard). Jeff Xie and Alan Koolik were tied for first place at the end of the 2014 Teen Tournament. The tie was broken in a special tiebreaker round. The category was the Civil War and the answer was \"The battles of Shiloh and Collierville were fought in this state\". The correct response, given by Jeff, was \"What is Tennessee?\". Avi Gupta and Jackson Jones were tied for first place at the last semifinals of the 2019 Teen Tournament. The tie was broken in a special tiebreaker round. The category was American History and the answer was \"Types of it you could find in Boston Harbor on December 16, 1773 included Souchong & Bohea\". The correct response given by Avi was \"What is Tea?\".J! Archive–Help–Tiebreaker Round definition Owing to a questionable judges' ruling in Final Jeopardy!, Milo Dochow was brought back for the Winter 2000 Jeopardy! College Championship; however, he failed to advance to the semifinals. Peter Morris in 1989 and Muffy Marracco Morris in 1992 were the first pair of siblings to appear in the Teen Tournament; they are brother and sister. Peter Morris appeared again in the 1998 Teen Reunion Tournament. Wen Shen in 1990 and Gwen Shen of 1995 were also brother and sister. Lauren Sager (1991) and Deborah Sager (1995) are sisters.The Daily Pennsylvanian 'Jeopardy!' star quick on the buzzer Jay Schrader (2008) and Rob Schrader (2012) are brothers. Leonard Cooper in 2013 is the only contestant in Jeopardy! tournament history (all tournaments combined) to lose his semifinal but win the tournament. A triple-zero score in the second semifinal necessitated the use of the wild card option in the semifinals, similar to the first round. In the third semifinal, Nilai Sarda ($30,400) defeated Cooper ($30,200) and Emily Greenberg ($24,400). The only other non-zero semifinal score was Irene Vazquez ($100) from the first semifinal. Since then, all Jeopardy! tournament semifinals require a winner. A triple-zero score will now require a tie-breaker. ==Merchandising== A console game based upon the Teen Tournament was released in the mid 1990s for the Nintendo Game Boy. ==Teen Reunion Tournament== The Jeopardy! Teen Reunion Tournament was a special one- week tournament held in November 1998 at the Boch Center in Boston, Massachusetts that invited back 12 former Teen Tournament contestants from the first three tournaments on Jeopardy! ===Format=== Twelve former Teen Tournament contestants competed three at a time in four qualifying round matches. Winning contestants who were among the top three scorers would play in the final match for $50,000. Losing qualifiers took home $5,000, while the non-playing finalist took home $7,500. The third-place finisher took home a minimum guarantee of $10,000, while the second-place finisher was entitled to a minimum guarantee of $15,000. The highest scoring player in the finals took home $50,000. The two nonwinning finalists also received the board game Game of the Year by University Games as well as a Tigris Pyramid and Movana. ===Results=== ;Qualifying round * November 16, 1998: Dana Venator defeated Peter Morris and Creswell Formey. * November 17, 1998: David Javerbaum defeated Amy Wilson and Sascha Dublin. * November 18, 1998: Eric Newhouse defeated Stefanie Wulfestieg and Julie Robichaux. * November 19, 1998: Chris Capozzola defeated Stanley Wu and Samantha Moeschler. Capozzola, Javerbaum, and Newhouse advanced to the finals. ;Finals * November 20, 1998: Newhouse defeated Javerbaum and Capozzola. == References == ==Other websites== * Official Jeopardy! website Category:Jeopardy!",
 "title": "Jeopardy! Teen Tournament"
}