{
 "id": "404999",
 "text": "The Jeopardy! College Championship is a yearly tournament on the American television game show Jeopardy! It features full-time undergraduate college students who have not yet gotten a degree. The Jeopardy! College Championship is one of the traditional tournaments held each season on the TV quiz show Jeopardy! Contestants in this tournament are full-time undergraduate college students with no prior degrees and traditionally wear a sweater bearing the name of their college or university during their appearances. The existence of this tournament does not disqualify college students from auditioning for the regular shows, but tournament participants cannot later compete in regular play. The tournament began during the 1988-89 season (Season 5) and has been played every season (except for seasons 31, 35, and 37), always during any one of the three traditional sweeps ratings periods (November, February, or May) with the exception of being held in April 2018 due to Alex Trebek's brain surgery and April 2020 due to The Greatest of All Time Tournament. Some contestants for the inaugural tournament were selected through contestant searches held in Daytona Beach, Florida, and Palm Springs, California, during the Spring break season in 1989. ==Format== The College Championship uses a ten-game format similar to that used for the Tournament of Champions and the Teen Tournament: 15 players, in groups of three, play in five quarterfinal games; the winners of those five games and the four highest-scoring nonwinners as wild cards become the nine semifinalists who compete in three games, with no two players rematching each other in the semifinal round. The three semifinal winners advance to the two-day final round, in which contestants play two separate matches, with the contestants' combined scores for both matches determining the champion (contestants start with $0 each day). ==Prizes== ===Cash=== All College Championship contestants receive cash prizes, based on their progress through the tournament. Contestants eliminated prior to the finals receive fixed payouts, while contestants in the finals receive guaranteed minimums, but can earn more. Over time, the prizes have increased in value, as shown below: Year(s) Finalists (guaranteed amounts) Semifinalists Quarterfinalists Winner Second place Third place 1989–1997 $25,000 $10,000 $7,500 $5,000 $1,000 1998–1999 $15,000 $10,000 $2,500 2000–2002 $50,000 2003 $25,000 $15,000 2004–present $100,000 $50,000 $25,000 $10,000 $5,000 ===Trophies=== Winners also receive a small replica trophy of the larger College Championship trophy, which is retained by Jeopardy! in Southern California. On the larger trophy are engraved the names of every year's winner. ===Vehicles=== From 1993–2004, the winner also won a new car (Dodge from 1993–1994, Volvo from 1995–2003, and Volkswagen in 2004), and the company who manufactured the car matched each finalists' totals and set up scholarships in those amounts earned for the finalists' schools. ===Other Prizes=== * Participants in the Season 17 College Championship received custom Jeopardy! jackets by L.L. Bean. * Participants in the Season 27 College Championship received a Nintendo Wii and the Jeopardy! Wii game. ===Tournament of Champions=== In addition to the above-mentioned winnings, the winner earns an automatic position in the next Tournament of Champions, though two winners (Vinita Kailasanath in 2001 and Joey Beachum in 2008) deferred their berths in their intended tournament until the following installments due to scheduling conflicts. Three College Champions have made the Tournament of Champions finals (Tom Cubbage in 1989, Jeff Stewart in 1994, and Cliff Galiher in 2007), but only Cubbage won the event. Many college champions have been invited to later Jeopardy! \"all-time best\" tournaments as well, with varying degrees of success: *1989 winner Tom Cubbage competed in the next year's Super Jeopardy! tournament, losing his opening quarterfinal match. *Every College Championship winner to that point competed in 2005's Ultimate Tournament of Champions, with 2000 winner Pam Mueller advancing to the semifinals, and 1996 winner Shane Whitlock advancing to the quarterfinals. *Cubbage, Mueller, Whitlock, 1993 winner Phoebe Juel, and 2001 winner Vinita Kailasanath all competed in 2014's Jeopardy! Battle of the Decades, with both Cubbage & Mueller advancing to the semifinals. Whitlock, 2008 winner Joey Beachum, and November 2010 winner Erin McLean were among the past champions in the fan favourite online voting to earn one of three slots in the tournament, but only Whitlock won the fan vote for his decade. *2017 winner Lilly Chin was the alternate of the All-Star Games appearing in the audience on Facebook Live. *Mueller and 2012 winner Monica Thieu both competed as team members in 2019's Jeopardy All-Star Games; Mueller was drafted to team Colby Burnett while Thieu was drafted to team Ken Jennings. Both teams advanced to the finals with Thieu's team finishing second and Mueller's team finishing third. *Mueller, Thieu, 2014 winner Terry O'Shea, Chin, and 2018 winner Dhruv Gaur competed in 2024's Invitational Tournament. *Whitlock competed in 2025's Invitational Tournament. ==List of participants== The following is a list of contestants and where they placed in the tournament. Finalists who earned more than the minimum guarantee are as indicated. Finalists Semifinalists Quarterfinalists Alex Trebek Era (1984–2020) Season 5 (May 8–19, 1989) Winner: Tom Cubbage (Southern Methodist University, $26,600) 1st runner-up: Alex Yang (Tulane University, $24,601) 2nd runner-up: Linda Krisak (Case Western Reserve University) Kyle Bostian (University of Massachusetts Amherst) Jason Moore (University of Southern California) David Nieporent (Princeton University) Jason Powderly (Florida State University) Monroe Roark (University of West Georgia) Kristine Zaleskas (Harvard University) Paula Ashbaugh (Michigan State University) Ann Danielson (Amherst College) Betty Hsu (University of California, Los Angeles) Dave Piatt (Johns Hopkins University) Anna Simopolous (Cornell University) Chris Swensen (Towson University) Season 6 (May 7–18, 1990) Winner: Michael Thayer (Rutgers University) 1st runner-up: David Honea (North Carolina State University) 2nd runner-up: Amy Zucker (Wesleyan University) Joey Burgoon (Georgia Tech) Matthew Miller (University of Michigan) Katie Polk (College of William & Mary) Gavin Russell (University of California, Berkeley) Noah Smith (Northwestern University) Brad Williams (University of Northern Iowa) Elena Broder (Duke University) Eryn Brown (Harvard University) Bobbie Diamond (Oberlin College) Julie Gross (Rice University) Sue O'Connor (Saint Mary's College (Indiana)) Penny Prior (Georgetown University) Season 7 (May 6–17, 1991) Winner: Scott Gillispie (Georgia Institute of Technology, $27,400) 1st runner-up: Andre DuVoisin (University of New Orleans, $10,600) 2nd runner-up: Tim Lakin (Northwestern University) Kelly Barbour (Texas A&M; University–Commerce) Kimberly Bartlett (University of Alabama) Michael Canter (Princeton University) Katie Czukas (University of California, Berkeley) David Morris (Duke University) Franco Recchia (Wayne State University) Maureen Duffy (Ohio State University) Mike Furlanetto (Williams College) Holly McCann (Wayne State University) Maureen McIvor (Georgetown University) Jean O'Hearn (New York State University) Eric Przybylko (Stanford University) Season 8 (May 4–15, 1992) Winner: Billy Baxter (College of William & Mary, $26,200) 1st runner-up: Stephanie Leveene (University of Delaware, $16,800) 2nd runner-up: Nick Jungman (University of Oklahoma, $16,800) Ernst Bell (University of Florida) Amy Cheek (Samford University) Glenn Cotton (Louisiana State University) Kyle Graham (University of North Carolina at Chapel Hill) Ken Kansa (George Washington University) Chris Montplaisir (University of North Carolina at Chapel Hill) Margaret Bickers (Agnes Scott College) Katherine Bryant (Harvard University) David Ellis (Michigan State University) Hans Hornstein (California Institute of Technology) Tricia Johnson (Southern Methodist University) Hannah Stiers (St. John's College) Season 9 (May 3–14, 1993) Winner: Phoebe Juel (Grinnell College, $28,000) 1st runner-up: Eric Biber (Harvard University, $19,100) 2nd runner-up: John Van De Weert (Princeton University, $16,800) Keena Baumgartner (University of Illinois at Urbana–Champaign) Nelson Brooks (University of South Carolina) Dave Larson (University of Wisconsin–Madison) Ann Menge (Marquette University) Jessica Sison (San Francisco State University) Jeffrey Thompsen (University of California, Berkeley) Patrick Archdeacon (Columbia University) Andi Bloom (Illinois State University) Sate Falley (Florida Atlantic University) Ericka Hayes (Washington University in St. Louis) Nikki Laski (Iowa State University) Rhonda Rodriguez (Boston University) Season 10 (May 2–13, 1994) Winner: Jeff Stewart (Brigham Young University) 1st runner-up: Dave Goldsmith (Colgate University, $19,160) 2nd runner-up: Keri Ellis (Michigan Technological University, $7,600) Kristen Brewe (University of Minnesota) Brooke Gallagher (University of Maryland, Baltimore County) Brian Johnson (University of Florida) Elizabeth Lizotte (Simpson College) Martin Poteralski (Georgia Tech) Sarah Jane Whitten (University of Texas at Dallas) Maggie Bandur (Northwestern University) Benoy Chacko (University of Michigan) Mark Rooney (University of Missouri) Matt Stone (University of Illinois at Urbana–Champaign) John Sweeney (University of Nebraska–Lincoln) Shawn Wrobel (Stanford University) Season 11 (May 1–12, 1995) Winner: Ben Lyon (University of Oklahoma) 1st runner-up: Rebekah Reeves (Texas A&M; University, $13,800) 2nd runner-up: Stephen Smith (University of Notre Dame, $12,400) Cynthia Greenlee (University of North Carolina) Todd Konkel (Rice University) JL McHenry (Tufts University) Pat Toft (University of Minnesota) Neal Vermillion (Illinois Wesleyan University) Tamir Waser (University of Virginia) Jodi Boyle (Douglass Residential College) Sandra Cha (Harvard University) Josh Elman (Stanford University) Scott Hackler (Louisiana State University) Nancy Lishaa (Johns Hopkins University) Andrea Mazza (University of Missouri) Season 12 (February 12–23, 1996) Winner: Shane Whitlock (University of Arkansas, $32,800) 1st runner-up: Vandana Madhavan (Harvard University, $21,000) 2nd runner-up: Bryan Fagan (Missouri State University, $13,199) Bronwyn Bedient (University of North Carolina) Stephanie Brown (University of West Georgia) Brian Gondos (University of Pennsylvania) Bill Lee (University of Washington) Michael Musgrove (Georgia Tech) Mark Schmidt (Baldwin Wallace University) Alison Anderson (Boston University) Colin Campbell (Princeton University) Jenn Cunningham (Yale University) Alex Rucker (George Washington University) Rachel Schifter (Colgate University) Jeff Warren (Abilene Christian University) Season 13 (May 12–23, 1997) Winner: Craig Barker (University of Michigan) 1st runner-up: Mark Urciuolo (Marist College) 2nd runner-up: Steven Bevier (Michigan State University) Brian Chan (Harvard University) Bill McKinley (Wittenberg University) Eric Slack (Purdue University) Lisa Talley (Loyola University New Orleans) Joel Vaughan (Duke University) Aaron Wenger (University of Louisville) Oliver Baptiste (William Paterson University) Leslie Campisi (Loyola University New Orleans) Brigid Laurie (Bryn Mawr College) Andrea Pinyan (Alfred University) Andrea Riquier (Boston University) James Tong (Yale University) Season 14 (May 4–15, 1998) at Zellerbach Hall on the University of California, Berkeley campus Winner: Andrew Hutchings (Harvey Mudd College) 1st runner-up: Alex Weathers (Massachusetts Institute of Technology, $16,199) 2nd runner-up: Shane Underwood (University of Alabama) Adia Benton (Brown University) Cathy Landers (University of California, Berkeley) Grace Lansangan (Barton College) Claire Ogilvie (Yale University) Kristen Page (University of Mary Washington) Bryan Stofferahn (Santa Clara University) Lucas Bergman (University of Illinois at Chicago) Leslie Cooper (University of Southern California) Chanel Lee (University of Virginia) Katy Sprinkel (DePauw University) Sub Stockman (University of Pennsylvania) Mari Webel (Stanford University) Season 15 (May 3–14, 1999) at the Rosemont Theatre in Rosemont, Illinois Winner: Carolyn Cracraft (University of Chicago) 1st runner-up: Katie King (University of Kentucky) 2nd runner-up: Josh Levy (University of Pennsylvania, $12,295) Meg Audette (Wofford College) Cameron Blakemore (Oklahoma State University–Stillwater) Stephen James (University of North Texas) Veronica Lee (University of Oregon) Jason McClellan (Texas A&M; University) Whitney Owens (Northwestern University) Julie Ann Cohen (University of Michigan) Tara Crabtree (University of Washington) Aaron Johnson (Rowan University) Butch Malec (Reed College) Paul Marchegiani (Northwestern University) Nicole Thibodeau (University of Illinois at Chicago) Season 16 (February 7–18, 2000) Winner: Janet Wong (Drew University) 1st runner-up: Adam Center (Georgetown University, $17,299) 2nd runner-up: Greg Hodgin (Emory University) Julia Becker (Brandeis University) Gina Bronsberg (University of Illinois) Molley Jesse (University of Virginia) Michael LaMasse (Eastern Michigan University) Kurt Medland (Albion College) Natalie Tindall (Florida A&M; University) Darren Bates (University of California, San Diego) Peter Scott Breeze (Ithaca College) Anita Brkic (University of California, Los Angeles) Gwyneth Connell (Amherst College) Milo Dochow (Cooper Union) Marcail Moran (Hollins University) Season 17 (November 8–21, 2000) at Meany Hall on the University of Washington campus in Seattle, Washington Winner: Pam Mueller (Loyola University Chicago) 1st runner-up: Jonah Knobler (Harvard University) 2nd runner-up: Carl Gilbertsen (University of Illinois) Mitali Banerjee (Rice University) Matt Keller (Vanderbilt University) Erin Milligan (University of Delaware) Suzanne Rivoire (University of Texas at Austin) Genevieve Romeo (Ursinus College) Dave Sabath (University of Wisconsin–Madison) Jim Giesen (University of Washington) Iyesatu Kamara (University of Washington) Jordan Kovnot (Dartmouth College) Rob Schickler (Baylor University) Lisa Thimjon (Luther College (Iowa)) John R. Williams (George Washington University) Season 18 (November 7–20, 2001) at Pauley Pavilion on the University of California, Los Angeles campus Winner: Vinita Kailasanath (Stanford University) 1st runner-up: Matt Schnippert (Florida State University, $19,801) 2nd runner-up: Thomas Zamora (University of Southern California, $14,100) Sara Dean (Syracuse University) Brett Dvorak (Indiana University) Mysti Kofford (Boston University) Jayce Newton (University of California, Los Angeles) Marques Redd (Harvard University) Brittany Rogers (Saddleback College) Erin Bogart (Miami University) Jamie Green (Brown University) Susan Haarman (Marquette University) Tony Nagatani (Ithaca College) Andrew Nerlinger (University of Notre Dame) Sam Weaver (Bradley University) Season 19 (November 11–22, 2002) at Jerome Schottenstein Center on the Ohio State University campus in Columbus, Ohio Winner: Kyle Hale (Texas A&M; University, $51,300) 1st runner-up: Mark Kehres (Ohio State University, $49,200) 2nd runner-up: Jara Dorsey (Carnegie Mellon University) Arianna Haut (Washington University in St. Louis) Stacy Lee (Smith College) Corrie Loeffler (Azusa Pacific University) Sarah Martin-Anderson (California State University, Bakersfield) Pat Mobley (University of Michigan) Katie Orphan (Whitworth University) Hikma Abdulghani (Columbia University) Brian Andrews (DePaul University) Jenny Hauser (University of Arizona) Allison Hurley (University of Cincinnati) Adam Kay (Salt Lake Community College) Tony Sina (Temple University) Season 20 (November 10–21, 2003) at Payne Whitney Gymnasium on the Yale University campus in New Haven, Connecticut Winner: Keith Williams (Middlebury College) 1st runner-up: Grant Hutchinson (University of West Florida) 2nd runner-up: Joshua Perkins (Rice University) Alex Albrecht (Purdue University) Ellen Auer (St. Olaf College) Ken Basin (University of Southern California) Jim Fitzpatrick (Wake Forest University) Heather Groggel (Concordia University Wisconsin) Robby Schrum (Yale University) Lauren Henderson (Colby College) Amanda Johnson (University of Chicago) Karli Kosman (Mt. San Jacinto College) Mary Naam (Harvard University) Lee Tucker (Carleton College) Joyce Yuan (University of California, Berkeley) Season 21 (November 10–23, 2004) at the Petersen Events Center on the University of Pittsburgh campus Winner: Kermin Fleming (Carnegie Mellon University) 1st runner-up: Ari Schoenholtz (Williams College) 2nd runner-up: Rachel McCool (Dickinson College) Kelley Burd (West Virginia University) Lindsey Hargrove (University of Texas at Austin) Amory Jendrek (Davidson College) Vicky Manos (St. John's University) Casey Retterer (University of Maryland, College Park) Lily Wang (Columbia University) Matt Bushell (Georgetown University) Jeff Love (Stanford University) Chris Maes (University of Wisconsin–Green Bay) Larry Marshall (University of Missouri) Amanda Nowotny (University of Pittsburgh) Brad Selvig (Florida State University) Season 22 (November 7–18, 2005) at the RBC Center just off the North Carolina State University campus in Raleigh, North Carolina Winner: Nico Martinez (Stanford University) 1st runner-up: Adam Pinson (University of Alabama at Birmingham) 2nd runner-up: Jayanth Iyengar (Washington University in St. Louis) Beth Cimini (Boston University) Peter Ellis (North Carolina State University) Ben Goldman (New York University) Alison Jenik (University of Maryland, College Park) Amanda Walker (Gonzaga University) Antonia Wang (Purdue University) Anna Allie (University of Michigan–Dearborn) Chris Breen (Princeton University) Colin Brown (University of Rochester) Malisha Butts (North Carolina Central University) Christopher Chilton (University of North Carolina at Chapel Hill) Chelsea He (Duke University) Season 23 (April 30, 2007 – May 11, 2007) at the Galen Center on the campus of the University of Southern California Winner: Cliff Galiher (University of California, Los Angeles) 1st runner-up: Craig Boge (Stanford University) 2nd runner-up: Christine Kennedy (University of Notre Dame) Hayley Clatterbuck (University of Nebraska–Lincoln) Alice Luo (Georgia Tech) Dean Malec (Northwestern University) Will Schultz (University of North Carolina at Chapel Hill) Haritha Sudanagunta (University of California, San Diego) Pete Troyan (University of Michigan) Elise Burton (University of California, Berkeley) Brady Cassis (Yale University) Ashley Grand (Harvard University) Anna Han (Pennsylvania State University) Sarah Nothnagel (University of Southern California) Kaitlin Welborn (University of Pennsylvania) Season 24 (May 5–16, 2008) at the Kohl Center on the campus of the University of Wisconsin–Madison Winner: Joey Beachum (Mississippi State University) 1st runner-up: Danielle Zsenak (Marquette University) 2nd runner-up: Andrew Chung (Harvey Mudd College) Danny Devries (University of Michigan) Tara Franey (Michigan State University) James Grant (Georgetown University) Gabrielle McMahan (Florida A&M; University) Suchita Shah (University of Wisconsin–Madison) Vera Swain (University of South Carolina) Jonathan Hawley (Harvard University) Than Hedman (University of Colorado Boulder) Brandon Hensley (California Institute of Technology) Meredith Johnson (University of Minnesota) Dara Lind (Yale University) Katie Winter (Tufts University) Season 25 (May 4–15, 2009) Winner: Patrick Tucker (University of Notre Dame) 1st runner-up: Eric Betts (Emory University) 2nd runner-up: Laura Myers (University of Missouri, $29,900) Andrew Ceppos (Tufts University) Ariella Goldstein (Muhlenberg College) Erica Greil (Princeton University) Greg Lichtenstein (Vassar College) Scott Menke (Johns Hopkins University) Mark Petterson (University of Kansas) Elyssa Browning (St. John's College) Larissa Charnsangavej (Rice University) Kadeem Cooper (University of Virginia) Anthony Dedousis (Harvard University) Jennifer Duann (Ohio State University) Courtney Trezise (Michigan State University) Season 26 (February 1–12, 2010) Winner: Nick Yozamp (Washington University in St. Louis) 1st runner-up: Ryan Stoffers (University of California, Los Angeles) 2nd runner-up: Surya Sabhapathy (University of Michigan, $26,600) Dan D'Addario (Columbia University) Lindsay Eanet (University of Missouri) James Hill III (Santa Clara University) Leah Anthony Libresco (Yale University) Samira Missaghi (University of Minnesota) Ashley Walker (Dartmouth College) Robbie Berg (University of Pennsylvania) Rebecca Maxfield (Brown University) Prashant Raghavendran (University of Texas at Dallas) Lyndsey Romick (Lewis & Clark College) Danny Vopava (University of Wisconsin–River Falls) Will Warren (University of Alabama) Season 27 (November 8–19, 2010) Winner: Erin McLean (Boston University) 1st runner-up: Sam Spaulding (Yale University) 2nd runner-up: Hans von Walter (Southern Adventist University) Sid Chandrasekhar (University of Pennsylvania) Ellen Eichner (Ohio State University) Marshall Flores (Arizona State University) Steve Greene (University of California, Los Angeles) Kyle Kahan (Texas A&M; University) Lea Tottle (Florida State University) Olivia Colangelo (University of Notre Dame) Folake Dosu (Stanford University) Steph Gagelin (University of North Dakota) Amanda J. Ray (University of Virginia) Tim Relihan (University of Nebraska) Katie Singh (Northwestern University) Season 28 (February 1–14, 2012) Winner: Monica Thieu (University of North Texas) 1st runner-up: Sarah Bart (Goucher College) 2nd runner-up: Zack Terrill (Vanderbilt University) Jaime Alayon (George Washington University) Tyler Benedict (Columbia University) Greer Mackebee (Duke University) Weston Mangin (California Polytechnic State University) Matt Olson (Stanford University) Connie Shi (University of Michigan) Sarah Bauer (Indiana University) Zach McDonnell (College of William & Mary) Marie McGraw (Massachusetts Institute of Technology) Charlie Rooney (Loyola University Chicago) Anne Rozek (Eastern Illinois University) Carrie Tian (Harvard University) Season 29 (May 6–17, 2013) Winner: Jim Coury (Georgetown University) 1st runner-up: Trevor Walker (Massachusetts Institute of Technology) 2nd runner-up: Kristen Jolley (Georgia Tech) Cindy Cammarn (Bowdoin College) Daniel Donohue (Northwestern University) Hannah Shoenhard (Scripps College) Jed Silver (Tufts University) Julia Sprangers (University of Wisconsin–Madison) Nishanth Uli (Washington University in St. Louis) Bill Driscoll (Stanford University) Forrest Farjadian (University of Tulsa) Jack Houston (Azusa Pacific University) Paige Radtke (University of Colorado Boulder) Laura Rigge (Wellesley College) Taylor Roth (Baylor University) Season 30 (February 10–21, 2014) Winner: Terry O'Shea (Princeton University) 1st runner-up: Tucker Pope (Texas A&M; University) 2nd runner-up: Kevin Shen (University of California, Berkeley) Laurie Beckoff (University of Chicago) Julia Clark (Harvard University) Ben Juster (University of California, Los Angeles) Erika Sloan (Middlebury College) Whitney Thompson (University of Oklahoma) Eric Turner (Vanderbilt University) Kenesha Bennett (Oakwood University) James Fulwiler (Temple University) Maria Khrakovsky (Ohio State University) Cameron Kim (Duke University) Sarah Stevens (University of Delaware) Alex Sventeckis (Ball State University) Season 32 (February 1–12, 2016) Winner: Sam Deutsch (University of Southern California) 1st runner-up: Niki Peters (University of California, Berkeley) 2nd runner-up: Sarah Dubnik (University of Pittsburgh) Ziad Ali (North Carolina State University) Emily Bingham (Wright State University) Kate Laubscher (Northeastern University) Hannah Norem (Augustana University) Emily Sun (Columbia University) Gus Woythaler (Stanford University) Adam Antoszewski (University of Virginia) Kevin Brown (Louisiana State University) Noah Cowan (Brown University) Carissa Pekny (United States Military Academy) Amanda Rosner (Northwestern University) Michael Sieja (Mississippi State University) Season 33 (February 13-24, 2017) Winner: Lilly Chin (Massachusetts Institute of Technology) 1st runner-up: Gary Tse (United States Naval Academy) 2nd runner-up: Viraj Mehta (Stanford University) Alex Bourzutschky (California Institute of Technology) Mari Hanley (Stetson University) Mohan Malhotra (New York University) Julia Marsan (Georgetown University) Netanel Paley (Yeshiva University) Clarissa Santori (Northeastern University) Zach Atwell (University of Kentucky) Esteban Fernandez (San Francisco State University) Allison Holley (Lawrence University) Jennifer Katz (Macalester College) Corey Schmalzle (Lehigh University) Hannah Whisnant (United States Military Academy) Season 34 (April 9-20, 2018) Winner: Dhruv Gaur (Brown University) 1st runner-up: William Scott (Tufts University) 2nd runner-up: Hannah Sage (University of Central Florida) Thatcher Chonka (University of Oklahoma) Jordan Goodson (Columbia University) Rishab Jain (Georgia Tech) Rebecca Rosenthal (Swarthmore College) Alli Ross (Worcester Polytechnic Institute) Eric Thorpe (Dartmouth College) Josie Bianchi (Stanford University) Patricia Jia (University of Pennsylvania) Harry Kioko (University of Chicago) Sheldon Lewis II (Rochester Institute of Technology) Carsen Smith (Vanderbilt University) Caroline Trammell (Furman University) Season 36 (April 6-17, 2020) presented by LendingTree Winner: Nibir Sarma (University of Minnesota) 1st runner-up: Tyler Combs (Indiana University) 2nd runner-up: Xiaoke Ying (University of Southern California) Joe Coker (Hendrix College) Marshall Comeaux (University of Texas at Austin) Kayla Kalhor (University of Florida) Beni Keown (Northwestern University) Londyn Lorenz (University of Mississippi) Nathaniel Miller (Yale University) Sophie Casarico (Florida State University) Emma Farrell (Carnegie Mellon University) Alistair Gray (University of California, San Diego) Sirad Hassan (Princeton University) Natalie Hathcote (Liberty University) Kylie Weaver (Pennsylvania State University) Milo Dochow was a losing contestant in the Winter 1999 Teen Tournament but was invited to participate in the following year's College Championship after being potentially disadvantaged by a questionable judges' ruling in Final Jeopardy!. The first quarterfinal match of the 1992 College Championship ended in a tie, between Chris Montplasir and Ken Kansa. Chris won the tie-breaker to earn a spot in the semifinals and Ken earned enough money to earn a wildcard spot (although two other tie-breaker clues were given and correct responses were given for neither, resulting in editing out of the broadcast). The first semifinal match of the 1997 College Championship also ended in a tie, between Steven Beiver and Brian Chan. Steven gave the correct response to the tie-breaker clue to earn a spot in the finals. Kevin ended up with $0 going into the Day Two Final Jeopardy!, and ineligible to play. He was kept to have his first day score tabulated for purposes of the final score in the two day total dollars format. Kate Laubscher, Hannah Norem, and Michael Sieja were tied at $14,400 in the quarterfinals at the end of Final Jeopardy. Hannah led going into Final Jeopardy, while Kate and Michael tied. Kate led going into Double Jeopardy, eliminating Michael for the last spot in the semifinals. Stanford University is the only college to have two winners. The only College Champions from Ivy League schools are Terry O'Shea of Princeton University in 2014 and Dhruv Gaur of Brown University in 2018. ==References== ==Other websites== * Official Jeopardy! website * Official Jeopardy! Season 34 College Championship website * Official Jeopardy! Season 36 College Championship website Category:Jeopardy!",
 "title": "Jeopardy! College Championship"
}