{
 "id": "404912",
 "text": "The Eddington limit, or Eddington luminosity was first worked out by Arthur Eddington. It is a natural limit to the normal luminosity of stars. The state of balance is a hydrostatic equilibrium. When a star exceeds the Eddington limit, it loses mass with a very intense radiation-driven stellar wind from its outer layers. Eddington's models treated a star as a sphere of gas held up against gravity by internal thermal pressure. Eddington showed that radiation pressure was necessary to prevent collapse of the sphere.Eddington A.S. 1926. The internal constitution of stars. Cambridge University Press. Most massive stars have luminosities far below the Eddington luminosity, so their winds are mostly driven by the less intense line absorption. The Eddington limit explains the observed luminosity of accreting black holes such as quasars. == Super-Eddington luminosities == Eddington limit explains the very high mass loss rates seen in the outbursts of η Carinae in 1840–1860. The regular stellar winds can only stand for a mass loss rate of about 10−4–10−3 solar masses per year. Mass loss rates of up to 0.5 solar masses per year are needed to understand the η Carinae outbursts. This can be done with the help of the super-Eddington broad spectrum radiation driven winds. Gamma-ray bursts, novae and supernovae are examples of systems exceeding their Eddington luminosity by a large factor for very short times, resulting in short and highly intensive mass loss rates. Some X-ray binaries and active galaxies are able to maintain luminosities close to the Eddington limit for very long times. For accretion powered sources such as accreting neutron stars or cataclysmic variables (accreting white dwarfs), the limit may act to reduce or cut off the accretion flow. Super-Eddington accretion onto stellar-mass black holes is one possible model for ultraluminous X-ray sources (ULXs). For accreting black holes, all the energy released by accretion does not have to appear as outgoing luminosity, since energy can be lost through the event horizon, down the hole. Effectively, such sources may not conserve energy. Most luminous known K- and M-type supergiants Name Luminosity () Effective temperature (K) Spectral type Notes References LGGS J013312.26+310053.3 575,000 4,055 LGGS J004520.67+414717.3 562,000 – M1I Likely not a member of the Andromeda Galaxy, should be treated with caution in regards to the H–D limit. LGGS J013339.28+303118.8 479,000 3,837 M1Ia Stephenson 2 DFK 49 390,000 4,000 K4 Another paper estimate a much lower luminosity () HD 269551 A 389,000 3,800 K/M WOH S170 380,000 3,750 M Large Magellanic Cloud membership uncertain. RSGC1-F02 363,000 3660 M2 LGGS J013418.56+303808.6 363,000 3,837 LGGS J004428.12+415502.9 339,000 – K2I AH Scorpii 331,000 3,682 M5Ia SMC 18592 309,000 \\- 355,000 4,050 K5–M0Ia LGGS J004539.99+415404.1 309,000 – M3I LGGS J013350.62+303230.3 309,000 3,800 HV 888 302,000 3,442–3,500 M4Ia RW Cephei 300,000 4,400 K2Ia-0 LGGS J013358.54+303419.9 295,000 4,050 GCIRS 7 295,000 3,600 M1I SP77 21-12 295,000 4,050 K5-M3 EV Carinae 288,000 3,574 M4.5Ia HV 12463 288,000 3,550 M Probably not a LMC member. LGGS J003951.33+405303.7 288,000 – LGGS J013352.96+303816.0 282,000 3,900 RSGC1-F13 282,000 3,590 WOH G64 282,000 3,400 M5I Likely the largest known star. Westerlund 1 W26 275,000 3,782 M0.5-M6Ia LGGS J004731.12+422749.1 275,000 – VY Canis Majoris 270,000 3,490 M3–M4.5 Mu Cephei 3750 M2 Ia LGGS J004428.48+415130.9 269,000 M1I RSGC1-F01 263,000 3,450 M5 LGGS J013241.94+302047.5 257,000 3,950 LMC 145013 251,000 \\- 339,000 3,950 M2.5Ia–Ib LMC 25320 251,000 3,800 M == References == Category:Astrophysics",
 "title": "Eddington limit"
}