{
 "id": "404997",
 "text": "The Jeopardy! Tournament of Champions is a yearly tournament on the American television game show Jeopardy!. It features 15 players who have won the most games from the past season. It started in 1964 when Art Fleming was host of the show; it is also played on the show with Alex Trebek as host until 2019, with Buzzy Cohen guest hosting the 2021 Tournament of Champions. Ken Jennings is now the host of the tournament starting with the 2022 Tournament of Champions. Winners of the College Championship (since 1989) and the Teachers Tournament (since 2011) also play in the Tournament of Champions. Jeopardy!'s Tournament of Champions takes two weeks. The first five games are the quarterfinals, with three new contestants each day. The winners of the five games move on to the semi-finals. The four players with the highest scores who did not win their quarterfinal game also move on as \"wild card\" players. If there is a tie at the end of a game, one final answer is given, and the first player to ring in with the correct response wins the game. If all three players have a score of zero, none of the players move on to the semi-finals, and another wild card spot is added. The next three games are the semi-final games. The three winners of the semi-finals move on to the finals, which happens over two games and two days. Unlike the quarterfinals, if all three players have a score of zero, one final answer is given, with the first player to ring in with the correct question wins the game. This rule change was first implemented in 2013 to avoid a repeat of the November 2012 taping of the Teen Tournament which made it unfair for contestants who played in the semifinal before the zero loss. In each finals game, the players start with zero scores; after the second finals game, each player's score is added to their score from the first game, with the highest score being the winner, or \"Grand Champion.\" The other two players win smaller cash prizes or their two-day total, whichever is higher. In 2022 (Season 38) the tournament took a new format which expanded the field to 21 contestants. The top three seeded contestants will qualify for the semifinal rounds; the remaining 18 contestants will play six quarterfinal games, with no wild-card spots given. The six winners will advance to the semifinals and join the top three seeds. The winners of the semifinal matches will advance to the finals, which will consist of a minimum of three and a maximum of seven games, similar to the Greatest of All Time tournament (see below). The first finalist to win three games will win the tournament and the $250,000 top prize. The second-place and third-place prizes will be determined first by number of wins, then by number of second-place finishes, and finally by total score across all games played, and will win $100,000 and $50,000, respectively. From time to time, special Tournaments of Champions have been played. In 2002, the show held a Million Dollar Masters tournament. This was a two-week tournament where the winner won $1,000,000. It was taped at Radio City Music Hall in New York City. In 2005, the show held an Ultimate Tournament of Champions. It was a 15-week tournament with 145 players. The two players who made it to the finals would play against Ken Jennings for $2,000,000. In 2014, the show held a Battle of the Decades to commemorate the show's 30th anniversary. It was a 5-week tournament featuring 45 players; the field of contestants was broken up into three decades. The first three weeks featured players from their respective decades. Five winners from each decade advanced to the quarterfinals to compete for a $1,000,000 grand prize. ==Prizes== Year(s) Finalists (guaranteed amounts) Semifinalists Quarterfinalists Winner Second place Third place 1964–1974 All players kept their total cash scores none 1985 $100,000 Kept their total cash scores $5,000 $1,000 1986 $5,000 1987–1996 $10,000 $7,500 1998–2001 $15,000 $10,000 $2,500 2003–2004 $250,000 $50,000 $25,000 $10,000 $5,000 2006–2024 $100,000 $50,000 2025–present $75,000 $75,000 ==List of participants== The following is a list of contestants and where they placed in the tournament. Prize amounts for the non-winning finalists who won more than the minimum guarantees are as indicated in parentheses. The Season 37 (all were champions in games hosted by Alex Trebek, games hosted by Austin Cohen), and some Season 39 and 40 (both tournaments hosted by Ken Jennings) Tournaments featured players who won their games with a different host than the host in the Tournament of Champions. They are designated. The Season 41 tournament will be the first where all champions played under the same host since the Season 36 tournament. Finalists Semifinalists Quarterfinalists Art Fleming Era (1964–75)Most episodes from the Art Fleming era of Jeopardy! do not survive, so there is no video record of these Tournament of Champions games; paper records indicating the players may be found in the NBC Master Books daily broadcast log, available on microfilm at the Library of Congress Motion Picture and Television Reading Room. A summary of those records may be found here. A listing of Jeopardy! Grand Champions, 1968–74, may be found in First annual (1964) Winner: Terry Thompson Phyllis Gallo John Murphy Helen Beck Rosemary Taubert Pat McDermott Madeline Von Koch Sid Kramer Ruth Lind [No quarterfinals] Second annual (1965) Winner: Babs McClellan Carolyn Benson Bob Wilder Lou Ehrlich Pat Day Doris Sullivan Jim Cahill Bob Law Earle Codrington [No quarterfinals] Third annual (1966) Winner: Burns Cameron Other finalists not recorded Bob Bovard Phyllis Grant Tye Heckman Leona Huerbach Sarah Moore Pat Rohan John Schenck Fran Winnick [No quarterfinals] Fourth annual (1967) Winner: Anne Fried Eleanor Endsley Harry Murtha Frank Gray Sheila Gabriel Rosemary Marnell Libby Dyer Gail Berry Howard August [No quarterfinals] Fifth annual (1968) Hutton \"Red\" Gibson John Miller Shep Shepherd Fran Fisk Bill Martin Penny Costigen Marcia Bikalis Judy Gex Sally Hickman [No quarterfinals] Sixth annual (1969) Winner: Jay Wolpert Elliot Shteir Nick Rorick Elliot Baritz Jane Gschwend (biggest winner in NBC Jeopardy! history) Ann Baker Larry Schiller Joan Nephew John Gridley Judy Rubin Grant Willis Jack Gurner Mendy Snyder Burt Sherman Pat Dougiallo Jay Hayes Judy Reimer Joan Lawrence Seventh annual (1970) Winner: Gene Cheatam Mary Lee Fox Barbara Franco Dolores Henderson Russ Poylo Hunter Farnum Steve Haufman Helen Mabry M. McNeil [No quarterfinals] Eighth annual (1971) Winner: Rock Johnson Riza Gross Jan Churchwell Peggy Rathert Don Marms Karolyn Battle Jim Shannon Michael Aronson Joel Tuber [No quarterfinals] Ninth annual (1972) Winner: Anne Marie Sutton Jay Delehanty Susan Smith Paul Wilson Lorraine Gorman Donna Angle Luanne Keller Sheila November Jay Delehanty [No quarterfinals] Tenth annual (1973) Winner: Paula Ogren Adeline Schulman Dan Donohue Carol Reeve Reid Williamson Connie Christensen Phil Price Louise Windgrad Rosemary Travis [No quarterfinals] Eleventh annual (1974) Winner: Denny Golden Dave Hilliard Pete Staley Kathleen Lang Andy Miller Art Newell Faye Ringel Other semifinalists not recorded [No quarterfinals] 1984 Version - Alex Trebek era (1984-2021) The final 35 episodes were aired posthumously after Trebek died on November 8, 2020. The 2021 Tournament of Champions was for Trebek-era champions only. No interregnum champions participated. Season 2 (November 11–22, 1985) Winner: Jerry Frankel 1st runner-up: Bruce Fauman ($9,399) 2nd runner-up: Steve Rogitz ($5,100) Ron Black Paul Boymel (Season 1's biggest winner) Liz Caccese Larry Floyd John Hnat Ric Moser Elise Beraru SSGT Paul Croshier Michael Day John Genova Paula Tupper Nathan Walpow Season 3 (November 10–21, 1986) Winner: Chuck Forrest (Season 2's biggest winner) 1st runner-up: Paul Rouffa 2nd runner-up: Marvin Shinkman Beryl Arbit Donald Burgo Gary Giardina Lionel Goldbart Gary Palmer Jay Rosenberg Harvey Becker Jared Eisenstat Danny Green Mark Leinwand Eric Schoeck Guy Tonti Season 4 (November 9–20, 1987) Winner: Bob Verini 1st runner-up: David Traini ($16,000) 2nd runner-up: Eugene Finerman ($11,600) Eric Berman Richard Cordray Michael Galvin Doug Molitor John Ryan (Season 3's biggest winner) Roger Storm Keith Bell Jonathan Fellows Frank Hughes John Podhoretz Zeke Sevilla, Jr. Keith Walker Season 5 (November 7–18, 1988) Winner: Mark Lowenthal 1st runner-up: Bruce Naegeli (Season 4's biggest winner, $18,799) 2nd runner-up: Sandra Gore ($13,000) Roy Holliday Peggy Kennedy Richard Perez-Pena Steven Popper Michael Rankins Kate Waits Michael Block Barbara-Anne Eddy Leah Greenwald Stephen Lebowitz Bruce Seymour Ron Trigueiro Season 6 (November 6–17, 1989) Winner: Tom Cubbage (won Season 5's College Championship) 1st runner-up: Rich Lerner ($15,500) 2nd runner-up: Brian Wangsgard (Season 5's biggest winner) Bruce Cox Peggi Malys Mark McDermott Eric Newhouse Ouida Rellstab Cigus Vanni Cathy Boggs Jeff Richmond Joel Sacks Chris Shea Yael Sofaer Jim Tompkins-MacLaine Season 7 (November 5–16, 1990) Winner: Bob Blake 1st runner-up: Larry McKnight 2nd runner-up: Steve Berman Jeff Bandman Andrew Bernknopf Erik Larsen Ofc. Frank Spangenberg (Season 6's biggest winner) Eric Terzuolo Jamie Weiss Lisa Guay Dan Katz Richard Neale George Soule Michael Thayer Elaine Zollner Season 8 (November 4–15, 1991) Winner: Jim Scott 1st runner-up: Steve Robin ($12,600) 2nd runner-up: Lou Pryor (won Season 7's Seniors Tournament, $9,700) Mark Born (Season 7's biggest winner) Leslie Frates Scott Gillispie Jonathan Jacobs Lois Kurowski Mark Pestronk Sara Cox Tom Halpern Bruce Ikawa John LeDonne Andy Westney Lynne Wexler Season 9 (November 9–20, 1992) Winner: Leszek Pawlowicz 1st runner-up: Bruce Simmons 2nd runner-up: Jerome Vered (Season 8's biggest winner) India Cooper Kirk Ditzler Richard Kaplan April McManus Leonard Schmidt Robert Slaven Billy Baxter Ofc. Frank Epstein John Kelly, RET USAF Steve Newman Dave Willis Phil Yellman Season 10 (November 15–26, 1993) Winner: Tom Nosek 1st runner-up: Bev Schwartzberg ($19,100) 2nd runner-up: Marilyn Kneeland (won Season 9's Seniors Tournament, $11,500) Dennis Donohue Phoebe Juel Jack Mahoney Leslie Miller Ed Schiffer (Season 9's biggest winner) Walt Senterfitt Debby Arnold Al Lin Linda Sheppard Diane Siegel David Tiemann Fraser Woodford Season 11 (November 14–25, 1994) Winner: Rachael Schwartz 1st runner-up: Jeff Stewart (won Season 10's College Championship, $20,800) 2nd runner-up: David Hillinck ($7,500) Kurt Bray Steve Chernicoff John Cuthbertson (Season 10’s biggest winner) Jean Grewe Brian Moore Bill Pitassy Amy Fine Fred Frank Matt Morris Tom Nichols Bart Thomas David Venderbush Season 12 (November 13–24, 1995) Winner: Ryan Holznagel 1st runner-up: David Siegel (Season 11's biggest winner, $24,600) 2nd runner-up: Isaac Segal ($16,600) Bruce Borchardt Jonathan Groff Paul Thompson (Season 12's biggest winner) Jim Vercolen Gordon Wean Matt Zielenski Aaron Klein Len Krisak Ben Lyon John McKeon Jim Morgan Linda Roberts Season 13 (November 18–29, 1996) Winner: Michael Dupée 1st runner-up: Bob Scarpone ($11,000) 2nd runner-up: Michael Daunt ($8,200) Bill Dickenson Amanda Goad Mary Hirschfeld Bill Sloan Beverly Spurs Shane Whitlock Bernie Cullen David Cuneo Brad Plovan David Sampugnaro Lucien Schmit Barbara Walker Season 14 (February 2–13, 1998) Winner: Dan Melia (Season 14's biggest winner) 1st runner-up: Kim Worth (Season 13's biggest winner) 2nd runner-up: Bob Harris Sahir Islam Lyn Payne Claudia Perry Fred Ramen Peter Scott Grace Veach Craig Barker Josh Den Hartog Paul Gutowski Pam Mifflin Arthur Phillips Wes Ulm Season 15 (February 8–19, 1999) Winner: Dave Abbott 1st runner-up: J.J. Todor ($20,600) 2nd runner-up: Juliet Wiley David Bagley (Season 15's biggest winner) Dan Girard Pat Healy Lance Johnson Andrew Maly John Skelton James Arey Andrew Hutchings Lara Robillard Chris Ward Carolyn White Melizza Zygmunt Season 16 (May 8–19, 2000) taped at the Atlanta Civic Center in Atlanta, Georgia Winner: Robin Carroll 1st runner-up: Jeremy Bate 2nd runner-up: Steve Fried Mike Blumenfeld Carolyn Cracraft Terry Currin Chacko George Michael Rooney Eddie Timanus Jack Archey Lee Lassiter Darlene Lieblich Helen Petroff Melissa Sexstone Janet Wong Season 18 (October 22–November 2, 2001) Winner: Brad Rutter 1st runner-up: Tad Carithers 2nd runner-up: Rick Knutsen Larry Cloud Lan Djang Mark Eckard Ryan Moore Pam Mueller Babu Srinivasan (Season 17's biggest winner) Michael Arnone Michelle Clum Bob Fleenor Andrew Garen Kevin Keach Doug Lach (Season 16's biggest winner) Season 19 (May 5–16, 2003) Winner: Mark Dawson 1st runner-up: Brian Weikle (Season 19's biggest winner, $56,601) 2nd runner-up: Eric Floyd (Season 18's biggest winner) Alan Bailey Mark Brown Jill Bunzendahl Chimka Max Levaren Trevor Norris Travis Troyer Kathy Cassity Kyle Hale Jackie Harrison Mark Lee Jason McCune Ben Tritle Season 21 (September 20–October 1, 2004) Winner: Russ Schumacher 1st runner-up: Tom Walsh (Season 20's biggest winner) 2nd runner-up: Arthur Gandolfi Seth Alcorn Tom Baker Anne Boyd Vinita Kailasanath Chris Miller Steve Reynolds John Beck Sam Ott Scott \"Renzo\" Renzoni Sean Ryan Jim Stalley Keith Williams Season 22 (May 8–19, 2006) Winner: Michael Falk 1st runner-up: Vik Vaz 2nd runner-up: Bill MacDonald David Madden (Season 22's biggest winner) Kevin Marshall Bob Mesko Jason Richards Aaron Thompson Maria Wenglinsky Kerry Breitenbach Doug Dorst Kermin Fleming Tom Kavanaugh Nico Martinez David Rozenson Season 24 (November 5–16, 2007) Winner: Celeste DiNucci 1st runner-up: Doug Hicton 2nd runner-up: Cliff Galiher (won Season 23's College Championship) Paul Glaser Christian Haines Chris Mazurek Susan Mitchell Jeff Spoeri Craig Westphal Mehrun Etebari (Season 23's biggest winner) Cathy Lanctot Andrew Rostan Nick Swezey Sara Terrell Steve Unite Season 25 (March 11–24, 2009) taped at the Las Vegas Convention Center in Las Vegas, Nevada Winner: Dan Pawson 1st runner-up: Larissa Kelly (Season 24's biggest winner) 2nd runner-up: Aaron Schroeder Ben Bishop Matt Kohlstedt Cora Peck Dave Simpson Donna Vogel Mark Wales Carl Brandt Deborah Fitzgerald Lisa Klink Tom Morris Erik Nelson Jim Stevens Season 26 (May 10–21, 2010) Winner: Vijay Balse 1st runner-up: Jason Zollinger (Season 26's biggest winner) 2nd runner-up: Stefan Goodreau Dave Belote Justin Bernbach (Season 25's biggest winner) Terry Linwood Liz Murphy Andy Srinivasan Nick Yozamp Joey Beachum Ryan Chaffee Regina Robbins Patrick Tucker Christine Valada Stephen Weingarten Season 28 (November 2–15, 2011) Winner: Roger Craig 1st runner-up: Tom Nissley (Season 27's biggest winner) 2nd runner-up: Buddy Wright Erin McLean Joon Pahk Jay Rhee Mark Runsvold Justin Sausville Kara Spak John Krizel Tom Kunzen Paul Kursky Brian Meacham Christopher Short Charles Temple Season 29 (February 13–26, 2013) presented by Prudential Winner: Colby Burnett (won Season 29's Teachers Tournament) 1st runner-up: Keith Whitener 2nd runner-up: Kristin Morgan Stephanie Jass Jason Keller (Season 28's biggest winner) Dave Leach Dan McShane Paul Nelson Jason Shore David Gard David Menchaca Joel Pool Ashok Poozhikunnel Patrick Quinn Monica Thieu Season 31 (November 10–21, 2014) Winner: Ben Ingram (Season 29's biggest winner) 1st runner-up: Arthur Chu 2nd runner-up: Julia Collins (Season 30's biggest winner) Sandie Baker Joshua Brakhage Jared Hall Mark Japinga Terry O'Shea Rebecca Rider Jim Coury Drew Horwood Sarah McNitt Andrew Moore John Pearson Rani Peffer Season 32 (November 9–20, 2015) Winner: Alex Jacob 1st runner-up: Matt Jackson (Season 32's biggest winner) 2nd runner-up: Kerry Greene Brennan Bushee Dan Feitel Catherine Hardee Andrew Haringer John Schultz Vaughn Winchell Michael Bilow Jennifer Giles Scott Lord Kristin Sausville Greg Seroka (Season 31's biggest winner) Elliot Yates Season 34 (November 6–17, 2017) presented by Consumer Cellular Winner: Austin \"Buzzy\" Cohen 1st runner-up: Alan Lin 2nd runner-up: Austin Rogers (Season 34's biggest winner) Tim Aten Lilly Chin Andrew Pau Lisa Schlitt Jason Sterlacci Pranjal Vachaspati Hunter Appler David Clemmons Sam Deutsch Jon Eisenman Justin Vossler Seth Wilson (Season 33's biggest winner) Season 36 (November 4–15, 2019) presented by Consumer Cellular Winner: James Holzhauer (Season 35's biggest winner) 1st runner-up: Emma Boettcher 2nd runner-up: Francois Barcomb (won Season 35's Teachers Tournament) Gilbert Collins Dhruv Gaur Steven Grade Kyle Jones Rachel Lindgren Lindsey Shultz Eric R. Backes Alan Dunn Ryan Fenster Anneke Garcia Josh Hill Rob Worman Season 37 (May 17–28, 2021) presented by Consumer Cellular Hosted by Austin \"Buzzy\" Cohen, for Trebek-era champions only. Winner: Sam Kavanaugh 1st runner-up: Jennifer Quail 2nd runner-up: Veronica Vichit-Vadakan Ryan Bilger Karen Farrell Ryan Hemmel Nibir Sarma Kevin Walsh Jason Zuffranieri (Season 36's biggest winner) Ben Henri MacKenzie Jones Steve Moulds Sarah Jett Rayburn Paul Trifiletti Andy Wood 1984 Version - Interregnum era (January 11, 2021-June 30, 2023) All Tournament of Champions featuring champions of the Interregnum era were hosted by Ken Jennings. Season 39 (October 31-November 21, 2022) Champions in this tournament are designated with the host at the time they were champions -- Alex Trebek (T), the Interregnum, with the host's name referenced (I), Mayim Bialik (B), or Ken Jennings (J). Winner: Amy Schneider (J) (bye) 1st runner-up: Andrew He (J) 2nd runner-up: Sam Buttrey (B) (won Season 38's Professors Tournament) Eric Ahasic (B) Matt Amodio (I/B) (bye)Amodio's wins came in games hosted by Robin Roberts, LeVar Burton, David Faber, Joe Buck, Mike Richards, and Mayim Bialik. (Season 38's biggest winner) John Focht (J) Maureen O'Neil (J) Tyler Rhode (B) Mattea Roach (J/B) (bye) Brian Chang (J) (Season 37's biggest winner) Jonathan Fisher (B) Jackie Kelly (J/B) Ryan Long (B) Zach Newkirk (T/J)Newkirk was champion at the end of Season 36 hosted by Alex Trebek taped in March 2020, and unable to return because of travel restrictions until December 2020 tapings, by then was in the Interregnum, which Ken Jennings hosted. Courtney Shah (I)Sanjay Gupta hosted her wins. Margaret Shelton (J) Jaskaran Singh (B) Jessica Stephens (B)Stephens qualified in tournament hosted by Jennings, but played in a Bialik hosted game. Megan Wachspress (B) Rowan Ward (I/J)Ward qualified in tournament hosted by Jennings, but played in a Joe Buck hosted game. Christine Whelchel (J) Season 40 (February 23-March 19, 2024) (B) denotes champions in Bialik-hosted episodes. (J/B) denotes player won games with both hosts. Winner: Yogesh Raut 1st runner-up: Ben Chan (J/B) 2nd runner-up: Troy Meyer Ike Barinholtz (B) Luigi de Guzman Brian Henegar Emily Sands (I)Anderson Cooper and Bill Whitaker hosted her games. David Sibley Jared Watson (B) Kevin Belle (J/B) Deb Bilodeau Justin Bolsen (T/B) Nick Cascone (I)Katie Couric and Dr. Mehmet Oz hosted his appearances. Jake DeArruda Ben Goldstein (B) Melissa Klapper Suresh Krishnan (B) Ray Lalonde Matthew Marcus Sean McShane Cris Pannullo (Season 39's biggest winner) Josh Saak (I)Saak's wins came in games hosted by George Stephanopoulos and Robin Roberts. Emmett Stanton Yungsheng Wang (B) Stephen Webb Hannah Wilson (B) Juveria Zaheer (B) '1984 Version - Ken Jennings era (since July 3, 2023) Season 41 (January 27, 2025-February 13, 2025) Date is last possible date with the three games to win format in use in all Jennings-hosted versions. Winner: Neilesh Vinjamuri 1st runner-up: Adriana Harmeyer (bye) (Season 40's biggest winner) 2nd runner-up: Isaac Hirsch (bye) Drew Basile (bye) Mark Fitzpatrick Drew Goins (alt.)Alternate added after Lisa Ann Walter, Celebrity Tournament winner, was unable to participate; selection based on runner-up of Champions Wildcard. Amy Hummel Ryan Manton Will Wallace Alison Betts Grant DeYoung David Erb Allison Gross Greg Jolin Amar Kakride Kevin Laskowski Lucas Partridge Weckiai Rannila Mehal Shah Will Stewart Rishabh Wuppalapati ==References== ==Other websites== * Official Jeopardy! website Category:Jeopardy!",
 "title": "Jeopardy! Tournament of Champions"
}