{
 "id": "405002",
 "text": "Ethel Greenglass Rosenberg (25 September 191519 June 1953) and Julius Rosenberg (12 May 191819 June 1953) were an American married couple who were executed for espionage during the Cold War. The Rosenbergs were members of the Communist Party of the United States. They were accused of giving information about the atomic bomb to the Soviet Union (a communist country). Later evidence showed that Julius was a spy, but Ethel was not. == Espionage == Julius Rosenberg was an electrical engineer at the United States Army Corps Engineering Laboratories. He was recruited by Soviet spies on Labor Day in 1942. By late 1944, Julius had become a recruiter for Soviet spies, and he supervised several other spies, including his brother-in-law David Greenglass. Greenglass was a machinist for the Manhattan Project (the United States Army's secret program to build an atomic bomb). Greenglass was arrested on 15 June 1950. He confessed to spying and said Julius was involved. He later testified that he gave Julius information about nuclear weapons. Greenglass originally said his sister Ethel was not involved, but later said she was. On 17 July 1950, the Federal Bureau of Investigation (FBI) arrested Julius. They arrested Ethel three and a half weeks later. The Rosenbergs were accused of giving information about nuclear weapons to another spy, who then gave it to a Soviet official in New York City. === Convictions === In 1951 Julius and Ethel were convicted of conspiracy to commit espionage during a time of war. President Dwight D. Eisenhower later explained in a press release: > They have been found guilty of conspiring with intent and reason to believe > that it would [help] a foreign power, to deliver to ... that foreign power > certain highly secret atomic information relating to the national defense of > the United States. Many people (in many countries) thought the Rosenbergs were innocent. Some supporters thought they were being persecuted because of antisemitism. (Both were of Jewish descent.Encyclopedia of Media and Propaganda in Wartime America) Others believed the Rosenbergs were guilty, but should not be executed. == Executions == As president, Eisenhower had the power to stop the Rosenbergs' execution. (This power is called executive clemency.) He refused, saying on 11 February 1953: > [T]he crime for which they have been found guilty and sentenced far exceeds > [the crime] of the taking of the life of another citizen [by executing > them]; it involves the deliberate betrayal of the entire nation and could > [easily] result in the death of many, many thousands of innocent citizens[.] === Protests === By the next day, 436 people had sent telegrams asking Eisenhower to reconsider and stop the execution. According to a White House memo, most of these people lived in cities on the East and West Coasts (especially New York and California). As time went on, supporters continued to contact Eisenhower. A White House memo describes how the Rosenbergs' sons asked Eisenhower not to execute their parents: > Note of 2/16/53 to the President from Michael and Robert Rosenberg... [they] > state they don't want to be left without a mommy and daddy. As their execution date approached, the Rosenbergs' supporters organized rallies and urged people to contact Eisenhower. However, they were not successful. Both Rosenbergs were executed by electrocution on 19 June 1953, at Sing Sing Prison in New York. They were the first American civilians ever to be executed for conspiracy to commit espionage during wartime. == Post-war evidence == After the Soviet Union ended in 1991, many secret Soviet records were released. Evidence showed that Julius Rosenberg had been a spy, but Ethel had not. Based on this evidence, her sons (and other supporters) have asked several United States presidents to exonerate Ethel. According to Edward Shapiro's research: > The Rosenberg case neither resulted from nor increased anti-Semitism ... > [There have been] questions regarding the fairness of the trial. > Nevertheless, no evidence [exists] that the jury’s decision or the sentence > would have differed had the Rosenbergs been Gentiles.\" == References == Category:1915 births Category:1918 births Category:1953 deaths Category:American communists Category:Couples Category:Criminals from New York City Category:Executed American people Category:Jewish American criminals Category:People executed by electric chair Category:People from Manhattan Category:American spies for the Soviet Union",
 "title": "Julius and Ethel Rosenberg"
}