{
 "id": "405065",
 "text": "The revenge of the Forty-seven Ronin took place in Japan at the start of the 18th century. It describes a historical event, but there is a lot of fiction added to the story too. The story tells of a group of samurai who were left leaderless (becoming ronin) after their daimyo (lord) Asano Naganori had to kill himself by committing seppuku (ritual suicide). He had to do this because he assaulted a court official named Kira Yoshinaka. The ronin waited and planned almost two years, and then killed Kira to avenge their master's honour. They delivered Kira's head to Asano's grave. After that, the ronin had to kill themselves by committing seppuku as they had committed the crime of murder. One noted Japanese scholar described the tale, the most famous example of the samurai code of honor, bushidō, as the country's \"national legend.\" == Gallery == Image:Sengakuji Ronin Graves.jpg|Incense burns at the graves of the Forty-seven Ronin at Sengaku-ji. Image:Chushingura.47ronin.attackingthehouseofkira.print.kunisada.i.01.obverse.refshot.jpg|Woodcut by Kunisada depicting the attack (early 1800s). Image:47_Ronin_garden_raid.jpg|Postcard depicting the attack, early 1920s. ==Notes== ==References== * Allyn, John. (1981). The Forty-Seven Ronin Story. New York. * Dickens, Frederick V. (1930) Chushingura, or The Loyal League. London. * Forbes, Andrew ; Henley, David (2012). Forty-Seven Ronin: Tsukioka Yoshitoshi Edition. Chiang Mai: Cognoscenti Books. ASIN: B00ADQGLB8 * Forbes, Andrew ; Henley, David (2012). Forty-Seven Ronin: Utagawa Kuniyoshi Edition. Chiang Mai: Cognoscenti Books. ASIN: B00ADQM8II * Keene, Donald. (1971). Chushingura: A Puppet Play. New York. * * Robinson, B.W. (1982). Kuniyoshi: The Warrior Prints. Ithaca. * Sato, Hiroaki. (1995). Legends of the Samurai. New York. * Screech, Timon. (2006). Secret Memoirs of the Shoguns: Isaac Titsingh and Japan, 1779–1822. London. * Steward, Basil. (1922). Subjects Portrayed in Japanese Colour-Prints. New York. * Titsingh, Isaac. (1820). Mémoires et Anecdotes sur la Dynastie régnante des Djogouns, Souverains du Japon. Paris: Nepveu. * Weinberg, David R. et al. (2001). Kuniyoshi: The Faithful Samurai. Leiden. ==Other websites== *Robson, Lucia St. Clair (1991) The Tokaido Road. Forge Books. New York. *Chushingura and the Samurai Tradition – Comparisons of the accuracy of accounts by Mitford, Murdoch and others, as well as much other useful material, by a noted scholars of Japan *Ako's Forty-Seven Samurai – Web site produced by students at Ako High School; contains the story of the 47 ronin's story, and images of wooden votive tablets of the 47 ronin in the Oishi Shrine, Ako *The Trouble with Terasaka: The Forty-Seventh Ronin and the Chushingura Imagination by Henry D. Smith II, Japan Review, 2004, 16:3-65 *Well photos – The well where 47 ronin washed the head of Kira *Five different woodblock print versions of the story by Ando Hiroshige * National Diet Library: photograph of Sengaku-ji (1893); photograph of Sengaku-ji (1911) *Yoshitoshi, 47 Ronin series (1860) Category:Japanese folklore",
 "title": "Forty-seven Ronin"
}