{
 "id": "405110",
 "text": "This is a list of the governors of Wyoming. It includes territorial governors. Wyoming Territory was created in 1868. Wyoming became a state on July 10, 1890. ==Governors== ===Governors of Wyoming Territory=== # Name Photo Took office Left office 1 John Allen Campbell 1869 1875 2 John Milton Thayer 1875 1878 3 John Wesley Hoyt 1878 1882 4 William Hale 1882 1885 5 Elliot S.N. Morgan 1885 1885 6 Francis E. Warren 1885 1886 7 George White Baxter 1886 1886 8 Elliot S.N. Morgan 1886 1887 9 Thomas Moonlight 1887 1889 10 Francis E. Warren 1889 1890 ===Governors of Wyoming=== Governor Took office Left office Party Secretary of State Notes 1 Francis E. Warren October 11, 1890 November 24, 1890 Republican John W. Meldrum Resigned to take an elected seat in the United States Senate. Amos W. Barber 2 Amos W. Barber November 24, 1890 January 2, 1893 Republican Amos W. Barber As state secretary of state, acted as governor. 3 John E. Osborne January 2, 1893 January 7, 1895 Democratic 4 William A. Richards January 7, 1895 January 2, 1899 Republican Charles W. Burdick 5 DeForest Richards January 2, 1899 April 28, 1903 Republican Fenimore Chatterton Died in office. 6 Fenimore Chatterton April 28, 1903 January 2, 1905 Republican 7 Bryant B. Brooks January 2, 1905 January 2, 1911 Republican Fenimore Chatterton William Schnitger 8 Joseph M. Carey January 2, 1911 January 4, 1915 Democratic Frank L. Houx Switched parties from Republican to Progressive in 1912. Progressive 9 John B. Kendrick January 4, 1915 February 26, 1917 Democratic 10 Frank L. Houx February 26, 1917 January 6, 1919 Democratic 11 Robert D. Carey January 6, 1919 January 1, 1923 Republican William E. Chaplin 12 William B. Ross January 1, 1923 October 2, 1924 Democratic Frank Lucas 13 Frank Lucas October 2, 1924 January 5, 1925 Republican 14 Nellie Tayloe Ross January 5, 1925 January 3, 1927 Democratic 15 Frank C. Emerson January 3, 1927 February 18, 1931 Republican Alonzo M. Clark 16 Alonzo M. Clark February 18, 1931 January 2, 1933 Republican As state secretary of state, acted as governor until replacement elected. 17 Leslie A. Miller January 2, 1933 January 2, 1939 Democratic Alonzo M. Clark Lester C. Hunt 18 Nels H. Smith January 2, 1939 January 4, 1943 Republican Lester C. Hunt 19 Lester C. Hunt January 4, 1943 January 3, 1949 Democratic Mart T. Christensen William Jack Arthur G. Crane 20 Arthur G. Crane January 3, 1949 January 1, 1951 Republican Arthur G. Crane 21 Frank A. Barrett January 1, 1951 January 3, 1953 Republican Clifford J. Rogers 22 Clifford J. Rogers January 3, 1953 January 3, 1955 Republican 23 Milward Simpson January 3, 1955 January 5, 1959 Republican Everett T. Copenhaver 24 John J. Hickey January 5, 1959 January 2, 1961 Democratic Jack R. Gage Resigned to take an appointed seat in the United States Senate. 25 Jack R. Gage January 2, 1961 January 7, 1963 Democratic 26 Clifford P. Hansen January 7, 1963 January 2, 1967 Republican Thyra Thomson 27 Stanley K. Hathaway January 2, 1967 January 6, 1975 Republican 28 Edgar J. Herschler January 6, 1975 January 5, 1987 Democratic 29 Mike Sullivan January 5, 1987 January 2, 1995 Democratic Kathy Karpan 30 Jim Geringer January 2, 1995 January 6, 2003 Republican Diana J. Ohman Joseph Meyer 31 Dave Freudenthal January 6, 2003 January 3, 2011 Democratic Joseph Meyer Max Maxfield 32 Matt Mead January 3, 2011 January 7, 2019 Republican Max Maxfield Ed Murray Edward Buchanan 33 Mark Gordon January 7, 2019 Incumbent Republican Edward Buchanan ===References=== ==Living former governors== , four former governors were alive. The most recent governor to die was Clifford P. Hansen (1963-1967), on October 20, 2009. The most recently-serving governor to die was Edgar J. Herschler (1975-1987), on February 5, 1990. Name Gubernatorial term Date of birth Mike Sullivan 1987-1995 Jim Geringer 1995-2003 Dave Freudenthal 2003-2011 Matt Mead 2011-2019 * Category:Lists of governors",
 "title": "List of governors of Wyoming"
}