{
 "id": "405174",
 "text": "Samuel \"Sam\" Houston (March 2, 1793 - July 26, 1863) was an American statesman, politician, and soldier. He is best known for his leading role in bringing Texas into the United States. Houston, Texas and Sam Houston State University was named after him. Shortly afterwards, he relocated to Coahuila y Tejas, then a Mexican state, and became a leader of the Texas Revolution. Sam Houston supported annexation by the United States. When he assumed the governorship of Texas in 1859, Houston became the only person to have become the governor of two different U.S. states through direct, popular election, as well as the only state governor to have been a foreign head of state. Houston was born on March 2, 1793 in Rockbridge County, Virginia. He was of an Irish- Scottish descent. Houston was married to Eliza Allen from 1829 until they divorced in 1837. Then he was married to Diana Rogers Gentry until they divorced. Then he was married to Margaret Moffette Lee from 1840 until his death in 1863. Houston had seven children. Houston died on July 26, 1863 in Huntsville, Texas from pneumonia, aged 70. ==References== ==Other websites== * Life of General Houston, 1793–1863 published 1891, hosted by the Portal to Texas History. * Sam Houston ; David Crockett. published 1901, hosted by the Portal to Texas History. * * Sam Houston Memorial Museum * Sam Houston Memorial Museum Antiquities Collection From Texas Tides * Sam Houston's Obituary – The Tri Weekly Telegraph, Houston, Texas July 29, 1863 – TexasBob.com * Sam Houston Historic Schoolhouse in Maryville, TN USA * Documentary film on life of Sam Houston. Massive web site with many pictures, links, and educational tools. * Tennessee Encyclopedia of History and Culture entry * Tennessee State Library & Archives, Papers of Governor Sam Houston, 1827–1829 * Sam Houston Rode a Gray Horse * Houston Family Papers, 1836–1869 and undated, in the Southwest Collection/Special Collections Library at Texas Tech University *Booknotes interview with Marshall DeBruhl on Sword of San Jacinto: The Life of Sam Houston, May 2, 1993. Category:1793 births Category:1863 deaths Category:Deaths from pneumonia Category:Governors of Texas Category:United States senators from Texas Category:Governors of Tennessee Category:United States representatives from Tennessee Category:Democratic Party (United States) politicians Category:People from Huntsville, Texas Category:Politicians from Virginia",
 "title": "Sam Houston"
}