{
 "id": "405148",
 "text": "The Declaration of Arbroath is a declaration of Scottish independence, made in 1320. It was a letter sent to Pope John XXII, dated 6 April 1320. The declaration confirmed Scotlands's status as a independent, sovereign state and defended Scotland's right to use military action when unjustly attacked. The letter was signed at Arbroath by eight earls and thirty-one barons. ==Background== When King Alexander III of Scotland died in 1286, his heir was his granddaughter Margaret, Maid of Norway.The Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, ed. James Balfour Paul, Vol. I (Edinburgh: David Douglas, 1904), p. 7 In 1289, King Edward I of England negotiated to have his son, Edward II of England become her husband and share the crown of Scotland. J. D. Mackie, A History of Scotland, Second Edition, ed. Bruce Lenman; Geoffrey Parker (London; New York: Penguin Books Ltd., 1991), p. 63 But Margaret died on her way from Norway to Scotland in 1290. This began a period in Scotland called the First Interregnum (1290–1292). Scotland was without a monarch. Edward I stepped in to choose who would be king from among the candidates who had any claim to the throne. He chose John of Scotland. But, Edward treated the Scottish king badly. When King John tried to break free, Edward put him in prison, then allowed him to live in France. In 1296 Edward invaded Scotland with his army to take everything for himself. Scotland remained without a king until 1306 when Robert the Bruce declared himself king of Scotland defying Edward I. Just before doing this, Robert the Bruce had been involved in a dispute with John Comyn. The two met before the altar in Greyfriars Church in Dumfries in 1306 and a fight broke out. John Comyn was killed and Robert the Bruce was crowned king three weeks later at Scone. Accused of murdering Comyn, the Bruce was excommunicated by the Pope. During the wars that followed, the Scots won a major battle at the Battle of Bannockburn in 1314.Herbert Maxwell, A History of the House of Douglas, Vol. I (London: Freemantle & Co., 1902), pp. 45-6 In 1317 the pope called for a two year truce, which Scotland ignored. For failing to listen to him, he excommunicated all of Scotland.G. W. S. Barrow, Robert Bruce: And the Community of the Realm of Scotland (Edinburgh: Edinburgh University Press, 2005), p. 395 ==Overview== The Declaration was part of a larger plan to show the Pope and others that Scotland was an independent kingdom and had a right to rule itself. The English king Edward I had written to the pope before confirming his right to rule Scotland.G. W. S. Barrow, Robert Bruce: And the Community of the Realm of Scotland (Edinburgh: Edinburgh University Press, 2005), p. 239 For his part, the pope refused to accept Robert the Bruce as King of the Scots.G. W. S. Barrow, Robert Bruce: And the Community of the Realm of Scotland (Edinburgh: Edinburgh University Press, 2005), p. 394 Dated April 1320, the Declaration of Arbroath was a letter to Pope John XXII at Avignon from fifty leading men of Scotland.G. W. S. Barrow, Robert Bruce: And the Community of the Realm of Scotland (Edinburgh: Edinburgh University Press, 2005), pp. 394-95 There were 39 names, (eight Scottish earls and thirty one barons), who signed the document with their seals. On strips on the bottom of the letter are seals and names of eleven more who signed. Bernard Linton, Chancellor of Scotland and Abbot of Arbroath is believed to be the author.Ronald McNair Scott: Robert the Bruce, King of Scots (New York: Carroll & Graf Publishers, Inc., 1992), p 196, It was written at the monastery of Arbroath in Scotland. The letter began by reminding the pope of Scotland's conversion to Christianity by Saint Andrew. That under the protection of the church, Scotland had lived in peace until King Edward I of England pretended to be their friend. He then invaded their country while it was without a king. The letter then told of the hardships they faced under English rule. Showing their resolution the letter stated: == Immediate effect == The pope was impressed by the declaration and with the promise by the Scottish barons to support the pope's crusade.Ronald McNair Scott: Robert the Bruce, King of Scots (New York: Carroll & Graf Publishers, Inc., 1992), p 197 He encouraged Edward II to make peace with the Scots. The pope sent two delegates. The French king also wanted to see peace between England and Scotland and he sent two delegates. Peace talks went on until 1321 without the English recognizing Scottish independence. The English convinced the pope it was the fault of the Scottish that there was no progress. The pope issued six rulings against the Scots stating all invaders of England would be excommunicated and re-issued the excommunication against Robert the Bruce. Finally in October 1328 a peace treaty was agreed to between Scotland and England. Edward III gave up all claims on Scotland.Ronald McNair Scott: Robert the Bruce, King of Scots, Canongate 1996, pp. 221-24 The interdict on Scotland and the excommunication of its king were finally removed.Ronald McNair Scott: Robert the Bruce, King of Scots, Canongate 1996, p. 225 The second part of the treaty agreed that the son of Robert the Bruce, David II of Scotland and the sister of Edward III of England would marry. The wedding took place on 12 July of 1338 when David II, then four years old married Joan of the Tower, aged six, at the church at Berwick, Scotland.Ronald McNair Scott: Robert the Bruce, King of Scots, Canongate 1996, p. 224 In 1998 The United States Congress resolved that the US Declaration of Independence has been modeled on the Declaration of Arbroath. It was further resolved that April 6th was from that day on officially National Tartan Day in commemoration of that famous document.David Armitage, The Declaration of Independence: A Global History (Cambridge, MA: Harvard University Press, 2007), p. 42 == Related pages == * Declaration of Independence * List of signatories of the Declaration of Arbroath == Notes == == References == == Other websites == * Declaration of Arbroath on National Archives of Scotland website (includes full Latin text and English translation) * National Tartan Day April 6 commemorates the signing of the Declaration of Arbroath in 1320 Arbroath Category:National liberation movements Category:1320 Category:14th century in Scotland",
 "title": "Declaration of Arbroath"
}