{
 "id": "40535",
 "text": "Jamestown is a town in the United States. It was founded on May 13, 1607, by about 100 men and boys and women who came to Virginia from London, England. They named the town Jamestown after King James. These men hoped to find gold and silver in order to become rich. There was no gold or silver in the land because of its geography, which they did not understand at the time. However, they did find out that they could make lots of money from growing and selling tobacco crops, due to the marshy soil. Soon, they were making their fortune from tobacco instead of gold. Jamestown was the first permanent English settlement in what would become the United States. The town was built on Jamestown Island along the James River. This location was selected because the local Native American tribes did not live on the island. Built on a peninsula, it was a good place to defend themselves from other European colonists. == Background == Before Jamestown, fourteen colonies had been attempted in North America by Spain, France and England. Out of these, only two Spanish colonies survived making Jamestown the third European colony that succeeded for any period of time. The first colony attempted by Spain was in 1526 at San Miguel de Gualdape. Very little was known of it, including that its location was somewhere on the coast of present-day Georgia or South Carolina. In 1562, Jean Ribaut established a colony of French Huguenots called Charlesfort on Parris Island, South Carolina. He left about 27 men there while he returned to France. Meanwhile, the men of the colony revolted against their commander. They built a boat and attempted to return to France. The English attempted to establish Roanoke Colony in 1587. But this was a failure. James I of England issued a charter in 1606 to set up a settlement in North America. At the time the English called the entire coast (above Florida) Virginia after Elizabeth I of England, the \"virgin queen\". One of the purposes of the new colony were to find a river route to the Pacific Ocean to establish trade with the Orient. Three ships, the Susan Constant, the Godspeed and the Discovery set sail from London on December 20, 1606 bound for Virginia. Onboard there were 106 settlers (4 were boys) and 39 crew members. However, it is not known how many may have died during the Voyage. They arrived on April 26, 1607. == The Settlement == The first day, between 20 and 30 men explored the site but then they came under attack by Indians at dusk. The people of Jamestown found there were many problems to their colony. The water was bad for drinking. Many insects lived around the swampy land. The insects gave the people who lived there diseases. The leader, Captain John Smith, made the rules for the men. One of the rules was, \"You don't work, you don´t eat.\" The settlers traded with the Powhatan people. They gave the Powhatans tools, pots, and knives, in return for corn and vegetables. Two thirds died before another ship arrived from England in 1608 with more food and more settlers. During the harsh winter of 1609, most of the settlers starved to death and the survivors resorted to cannibalism.New York Times == Museum == There is a museum in Jamestown. === Inside === The museum includes the museum with historical tools and figures like Pocahontas, daughter of the Powhatan (Wahunsenacawh) and English people. It has a trivia about the cultures, government, and more, and some movies to watch about the history. Another is a movie about how the people in the settlement were living and the Native tribes. === Outside === The outside has a replica of a city in the Native tribe. If you go a little further, you see another replica of James Fort, where the crew built and lived including houses. If you go more further, you see a replica of Godspeed, one of the three ships that came to the settlement (it is the photo). === We are done with the tour, what do I do? === There is a café and a gift shop. Just walk all the way to the exit. == Related pages == * Roanoke Colony * Starving Time * Powhatan People (Native tribe from Viriginia) * Jamestown Settlement == Notes == == References == == Other websites == * * Category:Towns in Virginia Category:17th-century establishments in Virginia Category:1600s establishments in North America",
 "title": "Jamestown, Virginia"
}