{
 "id": "405487",
 "text": "Walter Stewart (1292–1327) a Scottish nobleman and knight, he was the 6th hereditary High Steward of Scotland. He was also the father of King Robert II of Scotland. ==Biography== Walter was born in 1292.The Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, Vol. I, ed. James Balfour Paul (Edinburgh: David Douglas, 1904), pp. 13-14 He was the son of James Stewart, 5th High Steward of Scotland and Gilles (or Egidia) de Burgh. Walter was one of the Scottish leaders at the Battle of Bannockburn. Just before the battle began Walter along with his cousin James Douglas, Lord of Douglas were knighted by King Robert the Brucealong with many others. Both he and James Douglas were both leaders of the left battalion in the battle.William Fraser, The Douglas Book, Vol. I (Edinburgh: 1885), p. 126 He took part of all the Wars of Scottish Independence between Robert the Bruce and Edward II of England.The Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, Vol. I, ed. James Balfour Paul (Edinburgh: David Douglas, 1904), p. 14 The king sent Walter to bring home his wife Queen Elizabeth and daughter princess Marjory from Berwick. They had been held prisoner by the English for eight years.J. T. T. Brown, 'The Origin of the House of Stewart', The Scottish Historical Review, Vol. 24, No. 96 (Jul., 1927), p. 278 Walter then married the princess Marjory. During the king's absence in Ireland the High Steward and Sir James Douglas managed government affairs and spent time defending the Scottish Borders. Upon the capture of Berwick-upon-Tweed from the English in 1318 he was placed in command of the town. On 24 July 1319 the town was attacked by King Edward II of England. Several of the siege engines were destroyed by the Scots' garrison and the Steward suddenly rushed in force from the town to drive off the enemy. In 1322, with Douglas and Thomas Randolph, he made an attempt to surprise the English King at Byland Abbey, near Malton, Yorkshire. Edward, however, escaped, pursued towards York by The Steward and 500 horsemen. Walter, Steward of Scotland, made a charter to John St. Clair, his valet, of the lands of Maxton, Roxburghshire, circa 1320/1326, one of the witnesses being \"Roberto de Lauwedir (Robert de Lauder) tunc justiciario Laudonie\" (Justiciar of Lothian).Angus, William, editor, Miscellaneous Charters 1315-1401, in Miscellany of The Scottish History Society, vol.5, 1933, p.9. ==Family and issue== Walter married, in 1315, Marjorie, only daughter of Robert I of Scotland by his first wife Isabella of Mar. The Lordship of Largs, taken from John Balliol, was given to Walter by Robert the Bruce, who also gave him the Farme Castle lands in Rutherglen as well as other lands and the barony of Bathgate, Linlithgowshire. Walter and Marjorie had one son: * Robert II of Scotland Walter later married Isabel de Graham, daughter of Sir John Graham of Abercorn and Mary of Strathearn. They had three children: * John Stewart of Ralston * Andrew StewartThe Scots Peerage, Founded on Wood's Edition of Sir Robert Douglas's Peerage of Scotland, Vol. I, ed. James Balfour Paul (Edinburgh: David Douglas, 1904), p. 15 * Egidia Stewart. She married first, James Lindsay of Crawford. She married second Hugh Eglinton of Ardrossan and third to James Douglas of Dalkeith. ==Notes== ==References== ==Further reading== * Dunbar, Sir Archibald H., Bt., Scottish Kings, a Revised Chronology of Scottish History, 1005 - 1625, Edinburgh, 1899, pps: 126 - 144. * Weis, Frederick Lewis, et all, The Magna Charta Sureties 1215, 5th edition, Baltimore, 2002, p. 50\\. Category:1290s births Category:1327 deaths Category:House of Stuart Category:Signatories to the Declaration of Arbroath Category:Scottish nobility",
 "title": "Walter Stewart, 6th High Steward of Scotland"
}