{
 "id": "406097",
 "text": "Rose Marie \"Rosemary\" Kennedy (September 13, 1918 – January 7, 2005) was a member of the Kennedy family. She was the first sister of President John F. Kennedy, Senator Robert F. Kennedy, and longtime Senator Ted Kennedy. She was said to have substandard intelligence, with a mental age of between age 8 and 13. She had seizures and sudden changes in mood. At this time, doctors thought that a surgery called a lobotomy would fix these problems. In a lobotomy, one part of the brain is cut away from the rest. She got a lobotomy in 1941, when she was 23 years old, but it failed. She was left with the intelligence of a two-year-old child. After this, she could not speak correctly or walk. She lived the rest of her life in a care facility for people with disabilities. ==Early life== Rosemary was born at her parents' home in Brookline, Massachusetts. She was the third child and first daughter of Joseph Patrick Kennedy, Sr. and Rose Elizabeth Fitzgerald. Although named after her mother,Leamer, p. 137. she was commonly called \"Rosemary\" or \"Rosie\". Rose Kennedy sent Rosemary to the Sacred Heart Convent in Elmhurst, Providence, Rhode Island, at age 15, where she was educated separately from the other students. Two nuns and a special teacher, Miss Newton, worked with her all day in a separate classroom. The Kennedys gave the school a new tennis court for their efforts. Her reading, writing, spelling, and counting skills were reported to be at a fourth-grade level. She studied hard but felt she disappointed her parents, whom she wanted to please. During this period, her mother arranged for her older brother Jack to accompany her to a tea-dance. Thanks to him, she appeared \"not different at all\" during the tea- dance.Leamer, pp. 203-204. == Lobotomy == When Rosemary Kennedy was in her early 20s, she had mental health problems. She was sometimes violent and would hit people. Her father worried that she would get pregnant. He also worried that her behavior would cause controversy for other members of the family. She also had seizures. Doctors thought that a lobotomy would make her more calm, and fix these problems. Her father decided she should get a lobotomy, without telling his wife. They did the surgery in November 1941. It failed, so Rosemary could not walk or talk correctly any more. James Watts was one of the doctors who did the surgery. He said that before the surgery, Rosemary probably had depression.Kessler, Ronald, The Sins of the Father, Warner Books, 1996, p. 244. Afterwards, Rosemary could not live alone. She lived at Craig House, a hospital for people with mental health problems. In 1949, they moved her to another facility, called Saint Coletta. This facility cared for people with mental disabilities. Her father never saw her again. Until 1961, the family kept her health problem a secret. They did not talk about it in public. ==Death== Rosemary Kennedy died from natural causes on January 7, 2005, at the Fort Atkinson Memorial Hospital in Fort Atkinson, Wisconsin, at the age of 86, with her sisters Jean, Eunice, and Patricia, and brother Ted, by her side. She was buried beside her parents in Holyhood Cemetery in Brookline, Massachusetts. ==Related pages== *Kennedy family ==References== ==Other websites== * *\"Rosemary Kennedy, JFK's sister, dies at 86 – Born Mentally Disabled, She Was Inspiration for Special Olympics\" obituary by The Associated Press at MSNBC, January 8, 2005 Category:People from Massachusetts Category:1918 births Category:2005 deaths Category:Kennedy family Category:People from Brookline, Massachusetts",
 "title": "Rosemary Kennedy"
}