{
 "id": "406017",
 "text": "Gyula Horn (5 July 1932 – 19 June 2013) was a Hungarian politician. He was the Prime Minister of Hungary from 1994 to 1998. He is best known for his role in Hungary's transition to democracy and his efforts to improve relations with neighboring countries. Horn was born on July 5, 1932, in Budapest, Hungary. He studied economics at the Budapest University of Economics. He later worked as a journalist for the Hungarian Communist Party's newspaper, Népszabadság. Horn became involved in politics in the 1960s. He quickly rose through the ranks of the Hungarian Socialist Workers' Party (MSZMP), which governed Hungary under communism. In 1989, he played an important role in negotiating the withdrawal of Soviet troops from Hungary and in facilitating Hungary's transition to democracy. After the fall of communism, Horn was appointed as the Minister of Foreign Affairs under Prime Minister József Antall. In this role, he worked to improve relations with neighboring countries, including Romania, Slovakia, and Austria. He was also instrumental in Hungary's efforts to join NATO and the European Union. In 1994, Horn succeeded Péter Boross as Prime Minister after his coalition won a landslide victory in the parliamentary elections. As Prime Minister, Horn continued his efforts to improve relations with neighboring countries and oversaw significant economic and social reforms. Horn's government implemented a series of measures aimed at improving the country's fiscal position and promoting economic growth. These measures included the introduction of a flat tax system, the privatization of state-owned enterprises, and the creation of a modern social welfare system. Horn's time as Prime Minister was not without controversy. His government faced criticism for its handling of social issues and for its alleged involvement in corruption scandals. Horn's government also came under fire for its response to the 1997 floods that devastated parts of Hungary. Despite these challenges, Horn is widely regarded as an important figure in Hungary's transition to democracy and its emergence as a modern, market-oriented economy. His efforts to improve relations with neighboring countries helped to ease tensions in the region and paved the way for greater cooperation and integration. Horn retired from politics in 2002 and returned to journalism. He died on June 26, 2013, at the age of 80. His legacy as a statesman and a champion of democracy and peace is widely recognized, both in Hungary and around the world. == Early life and education == Gyula Horn was a Hungarian politician. He was the country's Prime Minister from 1994 to 1998. He was born on July 5, 1932, in Budapest, Hungary. He grew up in a working-class family. Despite his family's financial struggles, he excelled academically and received a scholarship to attend university. Horn studied economics at Karl Marx University, where he became involved in politics and joined the Hungarian Socialist Workers' Party. He graduated in 1954 and began his political career shortly thereafter. == Administration and party career == Gyula Horn was a prominent member of the Hungarian Socialist Party. He had a long and successful political career. He was first elected to parliament in 1971. He served in various government positions over the years, including as Minister of Foreign Affairs. In 1994, he was elected as Hungary's Prime Minister and led the country through a period of economic reform and transition to a market economy. Horn was instrumental in negotiating the withdrawal of Soviet troops from Hungary and played a key role in the country's integration into NATO and the European Union. Despite facing criticism and opposition from some quarters, Horn remained a popular and respected figure in Hungarian politics until his retirement in 2004. == His role in 1956 == During the Hungarian Revolution of 1956, Gyula Horn played an active role as a member of the Hungarian Socialist Workers' Party. At the time, he was a young journalist and served as the editor-in-chief of the party's daily newspaper, Szabad Nép. Horn was sympathetic to the goals of the revolutionaries. He advocated for reforms within the party to address the concerns of the protesters. However, when Soviet forces invaded Hungary and suppressed the revolution, Horn was forced to flee the country and went into hiding. Despite his role in the party, he was not considered a leading figure in the revolution and his actions during this period did not have a significant impact on his subsequent political career. == Illness and death == In the years leading up to his death, Gyula Horn struggled with various health issues, including heart disease and lung cancer. Despite his declining health, he remained active in public life and continued to participate in political events and speak out on important issues. In 2013, he was admitted to a hospital in Budapest and had surgery to treat his lung cancer. However, his condition worsened and he died on June 19, 2013, at the age of 80. Following his death, Horn was widely mourned in Hungary and remembered as a respected statesman and a key figure in the country's transition to democracy. Category:1932 births Category:2013 deaths Category:Deaths from frontotemporal dementia Category:Politicians from Budapest Category:Prime ministers of Hungary Category:Socialists",
 "title": "Gyula Horn"
}