{
 "id": "406036",
 "text": "Rumination is the constant urge for a person to focus their attention on their troubles, misery or worries and possible causes or consequences. Rumination is having thoughts about earlier events, failures, abuse or hardships. The tendency to ruminate often serves as a big factor for clinical depression. People who ruminate a lot are more likely to become depressed and to carry major mental troubles, such as generalized anxiety disorder and suicidal behavior. One type of rumination, the state rumination, is connected with pessimism and serious neurosis. == Theories == === Response Styles Theory === The Response Styles Theory (RST) was developed by Susan Nolen-Hoeksema in the early 1990s in the hope of explaining the strong relationship between depression and rumination. The theory describes rumination as a way of dealing with hard situations where you keep thinking about how and why you are depressed, and difficult situations in this way are more likely to get depressed in the future. Even though this theory is most focused on how rumination influences depression, research on rumination also explains how it relates to other mental troubles too, like anxiety, binge drinking and eating disorders. Wendy Traynor and her co-workers tried to improve RST to explain the link between rumination and depression better, because some people said that there might be other things that explain the relationship. They created the two-factor model. This says that rumination can be divided into two parts: brooding and reflection. Brooding is when you keep thinking of how your situation right now is not where you want to be, and what stops you from getting there. This style of rumination is related both to being depressed and getting depressed in the future. The second style is reflection, and is thought to be a better way to deal with difficult situations and feelings as it is related to less depression in the future. Reflection is when a person often tries to solve problems by thinking about how they can deal with their difficult situation or depression. People have criticised RST for being too simple. They say that we should pay more attention to how the things that make up rumination, like feeling lonely, being mean to yourself and feeling sad, influence each other. New research suggests that it might be wrong to simply describe rumination using two words (reflection and brooding), and that how we measure rumination should mirror how the parts that make up rumination are influencing each other. === Goal Progress Theory === Goal Progress Theory (GPT) says that rumination is a way of achieving goals. This way of seeing rumination is very different from RST, which says that rumination “does not lead to active problem solving”. More specifically, GPT defines rumination as a result of the Zeigarnik Effect, which says that unfinished tasks come to mind more easily than finished tasks. So, when people who ruminate think the same thoughts over and over GPT explains this as a way of finding another path to reach a goal, and says that they will stop ruminating when they reach this goal. This concept has been tested in experiments. In one, people were told not to think of a white bear and were given feedback that either they did or did not succeed in this. Those who thought that they had not succeeded had thoughts related to white bears come to mind more easily than those who were told that they had been successful, showing the possible effect of unfinished goals on rumination. == Links to mental illnesses == === Depression === It is generally thought that those who ruminate, especially those who brood, have a higher likelihood of getting depressed and falling into a deeper depression than those who do not. This association seems to hold even when you account for people being depressed at the start of the study, and to be valid across ages and populations. Ruminating is also suggested to make people more vulnerable to other risk factors for depression such as gender, less memory of one’s own life, neuroticism, negative thinking styles and perfectionism. The effects of the other kind of rumination, reflection, are more varied. Even though it is generally agreed that the this style of rumination is related to less depression overall, and especially a smaller likelihood of developing depression in the future, new research points to the connection between the reflection and self-critical ruminative thinking (often thinking the same mean thoughts about yourself). At first, RST said that rumination predicted for how long one was depressed, but evidence has shown that this might not be true, and instead rumination predicts how many and how deep depressive episodes a person might have. It was also first suggested that people who ruminate can distract themselves to improve their mood, but this has been questioned and evidence against it has been shown since. === Anxiety === Rumination is in many ways similar and related to worry, which is central to anxiety disorders. This relationship is thought to explain the part of the link between anxiety and rumination. Still, rumination on its own, especially the brooding kind, has been shown to predict both having anxiety and getting it in the future. Brooding has also been shown to make the link between neuroticism and anxiety stronger. Rumination is also thought to increase the risk of getting other mental troubles like bipolar disorder, eating disorders, binge drinking and self-injury. == Gender differences == Studies on what groups of people ruminate and how much show that women generally ruminate more than men. This difference is the biggest in teenage years, but on the whole it is small. Studies on this suggest that the higher likelihood for women to ruminate might explain the generally bigger portion of women suffering from depression compared to men. This finding is limited by similar things such as worry and neuroticism playing into the association, though. The two-factor model suggests that it is the higher rates of brooding among women specifically that is driving the gender differences we see in depressive symptoms. == References == Category:Emotions Category:Neurology",
 "title": "Rumination"
}