{
 "id": "406088",
 "text": "Schizoid personality disorder is a Cluster A personality disorder which is not being interested in social relationships, often being alone. They are also secretive and don't show many emotions. It is often shortened to SzPD or SPD. This condition is not schizophrenia. People with SzPD will typically share some of the symptoms of schizophrenia. However, schizoids do not have the positive symptoms of schizophrenia such as hallucinations. A negative symptom is one that is taken away from a person. A positive symptom is one that is added to a person. People who have SzPD do not want interpersonal relationships which require emotion and commitment. People with SzPD are introverts who feel the need to be independent or alone. Many schizoids are asexual or have little interest in sexual encounters. Any relationships they may have probably does not involve emotional attachment. SzPD is more common in men than women.Coid, Jeremy; Yang, Min; Tyrer, Peter; Roberts, Amanda; Ullrich, Simone 2006. Prevalence and correlates of personality disorder in Great Britain. The British Journal of Psychiatry: The Journal of Mental Science. 188 (5): 423–31. doi:10.1192/bjp.188.5.423. ISSN 0007-1250. PMID 16648528 Some of the negative symptoms of the disorder (such as low energy) may be treated with some antipsychotic drugs. Theodore Millon said that there are four types of schizoid: languid, remote, depersonalized, and affectless. Salman Ahktar said that there were two types of schizoid: overt, and covert. Overt means visible, covert means secret or invisible. Covert or secret schizoids are active in social conversation and the outside world. However they do not tend to get emotionally attached to people. Acting differently in public is known as masking. == Diagnosis == The Diagnostic and Statistical Manual of Mental Disorders is a manual for diagnosing mental disorders. DSM-5 still includes schizoid personality disorder with the same requirements as in DSM-4. To be diagnosed with SzPD, one must have these behaviors consistently and be troubled by them. They also need to have at least four of these symptoms. # Does not want nor enjoy close relationships. This includes family. # Almost always chooses to do things alone. # Has little or no interest in having sexual experiences with another person. # Does not find most things fun. # Does not have close relationships except for family. # Appears to not care if complimented or insulted. # Does not show many emotions. Another way a person with SzPD can be diagnosed is through the ICD-10 which is the International Classification of Diseases. The person must have the behaviors consistently. They must be troubled by them. They also need to have at least four of these symptoms. # Does not find most things fun. # Does not show many emotions. # Does not show love or anger. # Appears to not care if complimented or insulted. # Little or no interest in having sexual experiences with another person (taking into account age). # Almost always chooses to do things alone. # Spends too much time fantasizing or thinking. # Does not want nor has any close relationships. # Does not care about being normal. Sometimes SzPD can be confused with other disorders such as Depression or Avoidant Personality Disorder. Sometimes people can have SzPD and other similar disorders. This is called being comorbid. == Treatment == To manage their disorder, people with SzPD can take medication. One is called Buproprion. They can also go to psychotherapy. This means they talk to a therapist. The therapist helps them try to connect more with other people. == Related pages == * Introvert * Solitude == References == Category:Personality disorders Category:Relationships",
 "title": "Schizoid personality disorder"
}