{
 "id": "40626",
 "text": "Rule of law is a legal maxim that suggests that no one is above the law and governmental decisions must be made only by applying known legal and moral principles.Black's Law Dictionary, Fifth Edition, page 1196 (West Publishing Company 1979). The Rule of Law limits the powers of Government by judicial defense of laws and the Constitution which is based on recognized basic legal values, established in international law. The Rule of Law is meant to prevent dictatorship and to protect the rights of the people. The rule of law is especially important as an influence on the economic development in developing and transitional countries.Luis Flores Ballesteros. \"Corruption and development. Does the “rule of law” factor weigh more than we think?\" 54 Pesos May. 2008:54 Pesos 15 Nov 2008. Constitutional economics is the study of government spending, which, in many transitional and developing countries, is completely controlled by the executive. The standards of constitutional economics can be used during annual budget process. The availability of an effective court system, to be used by the civil society in courts in situations of unfair governmental distribution of national money is a key element for the success of the rule-of-law in developing countries.Mohammad Amin & Jamal Haidar, 2012. \"The cost of registering property: does legal origin matter?,\" Empirical Economics, Springer, vol. 42(3), pages 1035-1050, June To date, the term “rule of law” has been used primarily in the English- speaking countries. The originally German doctrine of Rechtsstaat is similar, and has been translated into other languages of continental Europe as État de droit (Fr.), Estado de derecho (Sp.), Stato di diritto (It.), and Правовое государство (Ru.). Rechsstaat can be translated into English as “legal state” or \"constitutional state\". Peter Barenboim, Natalya Merkulova. \"The 25th Anniversary of Constitutional Economics: The Russian Model and Legal Reform in Russia, in The World Rule of Law Movement and Russian Legal Reform \", edited by Francis Neate and Holly Nielsen, Justitsinform, Moscow (2007). Rule of law is also a main purpose of Council of Europe for solidarity and international peace. == Related pages == * Constitution * Constitutionalism * Constitutional economics * International human rights law * Political economy * Right to a fair trial * Vienna Declaration * Council of Europe ==References== == Other websites == * What is the Rule of Law? University of Iowa Center for International Finance and Development * Centre for Public Law has an audio and written analysis of the Rule of Law by Lord Bingham of Cornhill (the senior Lord of Appeal in Ordinary of the United Kingdom supreme court) Category:Law la:Regnum legis",
 "title": "Rule of law"
}