{
 "id": "40662",
 "text": "Sheev Palpatine, also known as Darth Sidious or simply the Emperor, is a fictional character and the main antagonist of the Star Wars franchise. The character is played by actor Ian McDiarmid. == Character history == Palpatine is the main villain in each film trilogy of the Skywalker Saga. His story begins in the prequel trilogy. He is shown to be a politician and powerful Dark Lord of the Sith. Palpatine secretly tells the Trade Federation to take over his home planet Naboo. He uses the crisis to get elected as Supreme Chancellor of the Galactic Republic. He then leads the Republic into the Clone Wars. Palpatine uses the war to kill the Jedi and turns the Republic into the Empire. He makes himself emperor and turns Jedi Knight Anakin Skywalker into his apprentice, Darth Vader. The prequel trilogy also shows Palpatine as the master of Darth Maul and Count Dooku. Palpatine's master was Darth Plagueis, who could create life and save people from death. In the final film of the original trilogy, Palpatine is killed by Darth Vader with the help of Luke Skywalker. His Empire is also defeated. Later, Palpatine returns from death and plots revenge. He creates Snoke to lead the First Order against the New Republic. He also turns Luke's nephew, Ben Solo, into Kylo Ren. In the final film of the sequel trilogy, Palpatine is weak and in hiding on the Sith planet Exegol. He begins the Final Order to take back control of the galaxy. His plan is stopped by his granddaughter, the young Jedi Rey. Fearing her power, Palpatine tried to find Rey when she was a child, but she was hidden by her parents on the planet Jakku. He tries to get Rey to kill him, in anger, so that his spirit can possess her body. Rey refuses and destroys Palpatine with the help of the spirits of past Jedi. == Pop culture == Since the initial theatrical run of Return of the Jedi, Sidious has become a widely recognized symbol of evil in popular culture, and since the prequel movies, also one of sinister deception and the subversion of democracy. The Star Wars Databank describes him as \"the supreme ruler of the most powerful tyrannical regime the galaxy had ever witnessed\". Aside from the movies, Palpatine appears in various canon and non-canon Star Wars media, including Clone Wars (2003–5), The Clone Wars (2008–14, 2020), Rebels (2014–18), The Bad Batch (2021–), Obi- Wan Kenobi (2022) and Tales of the Jedi (2022–), all set before the original trilogy. == References == Category:Fictional characters introduced in 1980 Category:Galactic emperors Category:Internet memes Category:Star Wars characters Category:Supervillains Category:Fictional mass murderers",
 "title": "Palpatine"
}