{
 "id": "406892",
 "text": "Baby Daddy is an ABC Family situation comedy. It stars Jean-Luc Bilodeau (as Ben Wheeler), Tahj Mowry (as Tucker Dobbs), Derek Theler (as Danny Wheeler), Chelsea Kane (as Riley Perrin) and Melissa Peterman (as Bonnie Wheeler). The show was green-lighted on February 2, 2012. It began production on March 28, 2012. It began airing on ABC Family on June 20, 2012. On August 17, 2012, the show was renewed for a second season. It started on May 29, 2013. On March 22, 2013, ABC Family announced that the show will continue on for its third season. Baby Daddy was renewed for a fourth season on March 17, 2014. It premiered on October 22, 2014, with the series' first Halloween episode \"Strip or Treat\". In 2018, the series was canceled after six series. == Plot == The show follows Ben Wheeler, a single bartender in his twenties who lives in New York City. A one-night-stand, whom he had forgotten about, leaves her 3-month- old baby on his doorstep. He later finds out that the baby is his daughter, Emma. Ben raises Emma with the help of his brother, Danny, his two close friends, Riley and Tucker, and his mother, Bonnie. == Characters == *Benjamin \"Ben\" Bon Jovi Wheeler (Jean-Luc Bilodeau): the lead character of the series. He doesn't know what he wants to do with his life and is actual age has not been mentioned. He learns a lesson that he has to believe in himself if he's going to raise his daughter. \\- ABC Family *Tucker Dobbs (Tahj Mowry): Ben's best friend and roommate. He marked his food as soon as he heard about Danny moving in. Tucker is friendly towards everybody so long as they don't eat all of his food. \\- ABC Family He and Bonnie are the only ones that know Danny is in love with Riley. In earlier episodes he had a girlfriend named Vanessa who appeared to be a running gag due to her never being on camera. *Daniel \"Danny\" J. Wheeler (Derek Theler): Ben's older brother, who is a professional hockey player. He was traded to the Rangers. He caused Tucker to mark all his food in the kitchen because he \"looked\" like an eater. His little brother looks up to him, because he has everything a man would want. He's the only person that knows that Riley loves Ben and she usually hurts him for it because she wants him not to tell. In turn he loves Riley, but she does not know how he feels and he feels awkward because she often shares her feelings for Ben with him. \\- ABC Family *Bonnie Wheeler (Melissa Peterman): Ben and Danny's mother. She wanted to be a model but never \"recovered\" after having Danny. She thinks that Ben is not ready to take care of a child because she still \"buys his pants.\" \\- ABC Family She and Tucker are the only ones that know Danny is in love with Riley. *Riley Perrin (Chelsea Kane): Ben's close female friend. It has been said that she has lost 200 pounds. She is in love with Ben but Danny is the only person who knows about it. She is highly intelligent, as she passed her LSATs and entered law school. \\- ABC Family She has liked Ben ever since they were little. *Emma Wheeler (Ali and Suzy Hartman in Season 1; Mila and Zoey Beske since Season 2): Ben's daughter, who was left on his doorstep. ===Recurring characters=== *Ali and Susanne Hartman as Emma Wheeler (season one) *Zoey and Mila Beske as Emma Wheeler (season two) *Jase Whitaker as Bartender *Rachna Khatau as Sondra ===Guest appearances=== *Ana Nogueira as Chloe *Briana Lane as Cassie *David Cade as Jack Parker *Cali Fredrichs as Zoe *David S. Lee as Henderson *Tuc Watkins as Hank *Ashley Argota as Ava *Amber Stevens as Izzy *Greg Grunberg as Ray *Melissa Tang as Katie *Lucy Hale as Piper ==Episodes== ==References== ==Other websites== * * Category:2012 American television series debuts Category:2017 American television series endings Category:2010s American sitcoms Category:Television series about brothers Category:Television series about dysfunctional families Category:Television series about friendship Category:Television series set in New York City Category:English-language television programs",
 "title": "Baby Daddy"
}