{
 "id": "406870",
 "text": "The House of Tusculum were a powerful noble family of Latium, Italy. They were the Counts of Tusculum between the 10th and 12th centuries. Several popes and an antipope during the 11th century came from their family. The counts of Tusculum were influential figures in Roman politics and religion for more than a century. ==Counts== This list is partially incomplete in the 10th century. The chronology and dates are often uncertain. They were only counts from about 1013. Before this, they were lords. *before 924 Theophylact I *until 924 Alberic I, consul son-in-law *924 – 954 Alberic II, son *before 1013 Gregory I, son (Excellentissimus vir – Praefectus navalis) *until 1012 Theophylact II, son of Gregory I *1012 – 1024 Romanus, (Consul et dux, senator) brother of Theophylact II and son of Gregory I *1032 – 1045 Alberic III, (Imperialis palatii magister Consul et dux – Comes sacri palatii Lateranensis) brother of Theophylact II and Romanus; *1024 – 1032 Theophylact III son of Alberic III *1044 – 1058 Gregory II, (Consul, nobilis vir, senator Comes Tusculanensis), son of Alberic III *1058 – ca 1108 Gregory III, (Comes Tusculanensis Consul, illustris) son of Gregory II *ca 1108 – 1126 Ptolemy I (Tolomeo I), (Consul, comes Tusculanus) son Gregory III; *1126 – 1153 Ptolemy II (Tolomeo II), (Illustrissimus, dominus Consul et dux) son of Ptolemy I; *1153 – ca 1167 Jonathan, (Comes de Tusculano) co-ruler with Raino son of Ptolemy II; *1153 – 1179 Raino, (Nobilis vir, dominus) brother of Jonathan, co-ruler with Jonathan. ==Popes== Those who were also counts are listed in boldface. * John XI (931-935), son of Alberic I \"Pope John XI\", Catholic Encyclopedia; retrieved 2011-11-3. * John XII (955-964), son of Alberic II \"Pope John XII\", Catholic Encyclopedia; retrieved 2011-11-3. * Benedict VII (974-983), nephew of Alberic II \"Pope Benedict VII\", Catholic Encyclopedia; retrieved 2011-11-3. *Benedict VIII (1012-1024), son of Gregory I \"Pope Benedict VIII\", Catholic Encyclopedia; retrieved 2011-11-3. *John XIX (1024-1032), son of Gregory I \"Pope John XIX (XX)\", Catholic Encyclopedia; retrieved 2011-11-3. *Benedict IX (1032-1048), son of Alberic III\"Pope Benedict IX\", Catholic Encyclopedia; retrieved 2011-11-3. Two of the Tusculum clerics are today known as antipopes:\"Antipope\", Catholic Encyclopedia; retrieved 2011-11-7. * Antipope Benedict X (1058-1059), son of Alberic III\"Pope Benedict X)\", Catholic Encyclopedia; retrieved 2011-11-3. * Antipope Victor IV (1159-1164), born Octavius\"Victor IV\", Catholic Encyclopedia; retrieved 2011-11-7. == References == Tusculum Category:People from Lazio Category:Papal families",
 "title": "House of Tusculum"
}