{
 "id": "407138",
 "text": "Abdulaziz (Ottoman Turkish: عبد العزيز) (8 February 1830 - 4 June 1876) was the 32nd Sultan of the Ottoman Empire and was 111st Caliph of Islam. He ascended the throne when he was 31 years old, reigned between 25 June 1861 and 30 May 1876. He was the son of Sultan Mahmud II and became sultan after the death of his brother Abdülmecid I.Chambers Biographical Dictionary, , page 2 He was deposed in 1876, having become unpopular, and was found dead six days later. == His Reign == Abdulaziz was fond of wrestling, hunting and arm wrestling. He expanded and modernized the Ottoman navy, making it the third largest in the world. This resulted in large debts to European countries. He also bought modern weapons for the Ottoman Army and expanded it. Sultan Abdulaziz frequently organized trips to inland and abroad. He was the first Sultan who visited Egypt after Yavuz Sultan Selim who had conquered Egypt in 1517. As well as principalities Abdulaziz was the first Sultan who visited Europe. And often contacted with other countries' leaders. In the peroid of Abdulaziz the Ottomans pay attention to get along with West. Ottoman's westernization politics that began with the Edict Of Gülhane of the Tanzimat was continued. New provinces were created country-wide and the Istanbul University's system re-edited by copying France's education system. Sirkeci Train Station began to be built in the Abdülaziz era. Here are some modernization introductions enacted by him. * New soldier uniforms were prepared * Post stamps were used for the first time * Lighthouses were built along the coasts. * Ottoman Bank was opened. * High schools and industry schools were opened. * Forest, mine, and medicine schools were opened * Rulers of France, Austria, and Iran visited Istanbul. == Lover of Polish Arabian Horses == In 1864 the westernizing Ottoman sultan Abdülaziz imported 90 mares and two stallions from Count Branicki\"s studs in Bialocerkiew/Poland. == Descendants of Abdulaziz == Only male descendants of Abdulaziz are considered representatives of the former Ottoman throne. Name Position Relation Abdülmecid II last Ottoman Caliph (1922–1924) 37th Post-Imperial of the House of Osman (1922–1944) son Şehzade Mehmed Cemaleddin Post-Imperial Head of the House of Osman (1944-1946) grandson Şehzade Ömer Faruk Osmanoğlu Post-Imperial Head of the House of Osman (1946-1969) grandson Şehzade Mehmed Abdülaziz II Post-Imperial Head of the House of Osman (1969–1977) grandson Şehzade Süleyman Saadeddin Post-Imperial Head of the House of Osman (1977-1985) great-grandson Şehzade Orhan Saadeddin Post-Imperial Head of the House of Osman since 1985 great-great-grandson == References == == Other websites == Category:1830 births Category:1876 deaths Category:Knights of the Garter Category:Knights of the Golden Fleece Category:Sultans of the Ottoman Empire Category:Caliphs",
 "title": "Abdülaziz"
}