{
 "id": "407570",
 "text": "Yoshi's Story is a platform video game for the Nintendo 64 game console. It was developed and published by Nintendo. It is part of the Yoshi series. It was released in Japan on December 21, 1997, in North America on March 10, 1998, and in Europe on May 10, 1998. It was later released for the Wii's Virtual Console service in 2007 and the Wii U's Virtual Console service in 2016, and was one of the launch titles for the expansion pack for Nintendo Switch Online. The game plays similar to Super Mario World 2: Yoshi's Island. The player moves Yoshi through many stages while collecting pieces of fruit. The goal in each stage is to fill the Fruit Frame by collecting 30 pieces of fruit. Fruit can be found in many places in a stage. They can be found lying on the stage, floating in bubbles, or carried by enemies. Players can play as eight different Yoshis. Each Yoshi has a different color. The game takes place in a pop-up book. Each world is made from a different material, such as cardboard, fabric, plastic, and wood. ==Gameplay== The player can choose between two different game modes from the game's main menu. These modes are called Story Mode and Trial Mode. After the player chooses a mode, they can choose a course to play and choose which Yoshi they would like to play as. Trial Mode does not have any courses to play at the start of the game. The player must beat a course in Story Mode before they can play it in Trial Mode. On each course, the goal is to fill the Fruit Frame by eating 30 pieces of fruit.Yoshi's Story Instruction Booklet. NUS-P-NYS-NUK4. Nintendo, 1998. For introduction, see p. 5. For clearing courses, see p. 13. For Yoshi's abilities, see pp. 8-11. For Special Hearts, see p. 14. For saving the game, see p. 18. For 30 melons per course, see p. 13. For pause screen, see p. 15. For basic points from fruit, see p. 18. For enemy multiplier bonuses, see p. 18. There are a lot of fruit in each level. Fruits can be found lying around, floating in bubbles, and carried by some enemies. The player needs to apply strategy to get a high score. The courses are spread across six pages. Each page has four courses. The courses are sorted by difficulty, and the choice of which course to play is made individually for each page. While the first page will always show all four courses, the other pages will only show one course at first. The player must collect Special Hearts to unlock the other courses. Each course has three hearts to collect, and the number of hearts collected decides the number of additional courses that are unlocked on the next page. For example, if the player collects two hearts during a course, they will be able to choose from course 1, 2, and 3 on the next page. The abilities of the playable Yoshis include running, ducking, jumping, ground pounding, temporary hovering, and throwing eggs. ==Release== Nintendo wanted to release Yoshi's Story in North America by the 1997 holiday season, but the release was delayed until March 1998. A Nintendo official said that the delay was to make sure the game was high-quality.Snider, Mike (August 29, 1997). \"Nintendo games will miss holidays.\" USA Today. Once the game was finished, Nintendo shipped 800,000 units from Japan to American retailers.\"Nintendo Thinks 800,000 Yoshis Will Last Two Months.\" Multimedia Wire. March 18, 1998. Retailers were worried that there would be shortages, but a Nintendo official promised that there would be enough copies.Sporich, Brett (March 2, 1998). \"Unlike with GoldenEye, Nintendo sees no shortage for Yoshi's Story.\" Video Business. ==Reception== The game has a 65 out of 100 score on Metacritic based on eight reviews.\"Yoshi's Story Critic Reviews for Nintendo 64 at Metacritic.com\". Metacritic. Retrieved February 16, 2012. GamePro considered the game's very good art to be the one good part, saying that little kids would really like the game. They also complained that the analog control is too hard to use. Peer Schneider of IGN said that the analog control is easy to use. In 2020, Screen Rant said that they liked the game's art style. ==References== Category:1997 video games Category:Yoshi games Category:Nintendo 64 games Category:Nintendo Entertainment Analysis and Development games Category:Platform games Category:Side-scrolling platform games Category:Single-player video games Category:Video game sequels Category:Video games developed in Japan Category:Virtual Console games Category:Virtual Console games for Wii U",
 "title": "Yoshi's Story"
}