{
 "id": "407613",
 "text": "Herbert Marshall McLuhan, CC (July 21, 1911 – December 31, 1980) was a Canadian Professor of English literature who turned his attention to media. He was interested in the ways different media affected society. His work was a cornerstone of media studies, and had some practical applications in the advertising and television industries. His best-known work was Understanding Media:The Extensions of Man. McLuhan is known for coining the expressions the medium is the message and the global village. Although he was a fixture in media discourse in the late 1960s, his influence began to wane in the early 1970s. In the years after his death, he continued to be a controversial figure in academic circles. With the arrival of the internet, however, there was renewed interest in his work and perspective. == The Gutenberg Galaxy == McLuhan's The Gutenberg Galaxy: the making of typographic man (1962) was a history of print, and its effect on society. In the book, McLuhan showed how alphabetic writing, the printing press and later media, affect thought, which in turn affects social organization: :\"If a new technology extends one or more of our senses outside us into the social world, then new ratios among all of our senses will occur in that particular culture. It is comparable to what happens when a new note is added to a melody. And when the sense ratios alter in any culture then what had appeared lucid before may suddenly become opaque, and what had been vague or opaque will become translucent\".McLuhan, Marshall 1962. The Gutenberg Galaxy: the making of typographic man. London: Routledge & Kegan Paul. page 41 A typical idea: * The new electronic interdependence recreates the world in the image of a global village. Remember, this was written before anyone had any idea of the world wide web.McLuhan, Marshall 1962. The Gutenberg Galaxy: the making of typographic man. London: Routledge & Kegan Paul. page 31 His sayings range from the amusing: * Nobody ever made a grammatical error in a non-literate society.McLuhan, Marshall 1962. The Gutenberg Galaxy: the making of typographic man. London: Routledge & Kegan Paul. page 239 to the mysterious: * Typography cracked the voices of silence.McLuhan, Marshall 1962. The Gutenberg Galaxy: the making of typographic man. London: Routledge & Kegan Paul. page 251 == Understanding Media == Understanding Media: the extensions of Man was a pioneering study of the effects of media. The book suggests that media affect their content in important ways. It is an attempt to understand how different media have affected society. McLuhan suggests that media play a role, not by the content delivered, but by the characteristics of the medium itself. McLuhan pointed to the light bulb as an example. A light bulb does not have content in the way that a newspaper has articles or a television has programs, but it is a medium that has a social effect. The light bulb lets people do things at nightime which would be impossible in darkness. He describes the light bulb as a medium without any content. McLuhan states that \"a light bulb creates an environment by its mere presence\".Understanding Media, p. 8. He then goes on to compare the effects of radio, television and film (movis). The book is the source of the well-known phrase \"The medium is the message\". This is the idea that a medium like television actually affects the way information is seen and understood. == The Medium is the Message == The Medium is the Message: an inventory of effects (1967) was a spin-off from his previous book. It was compiled by Quentin Fiore from writings of McLuhan with many photos and graphics selected by the compiler. The text is based on published McLuhan works, but the sources are not listed. It was a huge best-seller. \"eventually selling nearly a million copies worldwide\". ==Related pages== * Eric McLuhan == References == Category:1911 births Category:1980 deaths Category:Writers from Alberta Category:Canadian Roman Catholics Category:Academics of the University of Toronto Category:Canadian educators",
 "title": "Marshall McLuhan"
}