{
 "id": "407702",
 "text": "\"(I've Had) The Time of My Life\" is a duet by Bill Medley and Jennifer Warnes. It was written by Franke Previte, John DeNicola, and Donald Markowitz. The song was on the soundtrack of the 1987 movie, Dirty Dancing. The song reached number one on the US Billboard Hot 100 chart in November 1987 for one week. It also reached number one on the Adult Contemporary chart for fourt weeks. In the United Kingdom, it reached number six. In January 1991, after the movie was released on television in the UK, it reached number eight. The song won the Academy Award for Best Original Song in 1987. It also won the Grammy Award in 1988 for Best Pop Performance by a Duo or Group with Vocals. Also in 1988, the song won the Golden Globe Awards for Best Original Song. == Cover versions == * Carmen & Piero (2004)Best of Mundart and Duets, track listings and charts Lescharts.com (Retrieved July 25, 2008) * Katie Price and her then-husband, pop singer Peter Andre (2006) * Jermaine Jackson and R&B;/dance music singer Jocelyn Brown (2007) * Barry Manilow (2008) * The cast of Glee (2009) * Sam Milby and Toni Gonzaga (2009)Sam Milby and Toni Gonzaga--I've had the time of my life Cover https://www.youtube.com/watch?v=XRABcfKRnLQ * The Black Eyed Peas used the chorus in their song, \"The Time (Dirty Bit)\" (2010) * Datarock * Kris Lawrence and Kyla (2011) * The song was also used a commercial jingle for Sandals Resorts. * Panzerballett (2012) * This song was covered by the Strictly Come Dancing band and singers, led by David Arch, in 2012, as the backing for gymnast Louis Smith and professional dancer Flavia Cacace's salsa in week 3 and the first part of the final. == Track listings == ; 7\" single # \"(I've Had) The Time of My Life\" (4:47) # \"Love Is Strange\" by Mickey & Sylvia (2:52) ; 12\" maxi and CD single # \"(I've Had) The Time of My Life\" (6:46) # \"In the Still of the Night\" by The Five Satins (2:59) # \"Love Is Strange\" by Mickey & Sylvia (2:53) # \"Overload\" by Zappacosta (3:39) ; Cassette # \"(I've Had) The Time of My Life\" (4:47) # \"In the Still of the Night\" by The Five Satins (2:59) # \"Love Is Strange\" by Mickey & Sylvia (2:53) # \"Overload\" by Zappacosta (3:39) == Charts and sales == === Peak positions === Chart (1987–1988) Peak position Australian ARIA Singles Chart\"(I've Had) The Time of My Life\", in various singles charts Lescharts.com (Retrieved April 7, 2008) 1 Austrian Singles Chart 3 Canadian Singles Chart\"Canadian Singles Chart from Nanda Lwin; Top 40 Hits: The Essential Chart Guide (2000)\" 2 Dutch Top 40 1 German Singles Chart 5 Irish Singles ChartIrish Single Chart Irishcharts.ie (Retrieved April 7, 2008) 5 Spain (AFYVE) 5 Swedish Singles Chart 12 Swiss Singles Chart 5 UK Singles Chart\"(I've Had) The Time of My Life\", UK Singles Chart Chartstats.com. Retrieved April 7, 2008. 6 US Billboard Hot 100[ Billboard charts.] Allmusic.com. Retrieved September 8, 2008. 1 US Billboard Adult Contemporary 1 Chart (1990) Peak position UK Singles Chart\"(I've Had) The Time of My Life\" (1990 issue), UK Singles Chart. Chartstats.com. Retrieved April 7, 2008. 8 Chart (1991) Peak position Irish Singles Chart 17 Chart (1992) Peak position French SNEP Singles Chart 5 Chart (1993) Peak position French SNEP Singles Chart 48 === Year-end charts === Chart (1988) Position Australian Singles Chart1988 Australian Singles Chart. aria.com. Retrieved July 25, 2008. 1 Austrian Singles Chart1988 Austrian Singles Chart Austriancharts.at. Retrieved July 25, 2008. 28 Dutch Top 40 1 === Certifications === Country Certification Date Sales certified Australia. cria.ca. Retrieved April 21, 2012. Gold 1987 35,000 CanadaCanada certifications . cria.ca. Retrieved July 25, 2008. Gold January 12, 1988 50,000 NetherlandsDutch certifications . nvpi.nl. Retrieved December 9, 2008. Platinum 1988 60,000 U.S.U.S. certifications. riaa.com. Retrieved July 25, 2008. Gold February 24, 1989 500,000 == References == Category:1987 songs Category:Best Original Song Academy Award-winning songs Category:Jennifer Warnes songs",
 "title": "(I've Had) The Time of My Life"
}