{
 "id": "407705",
 "text": "Naval aviation is the air force branch of a navy. Its aircraft may be airplanes and helicopters. == Missions == Missions for naval aviation include: * Maritime patrol, with aircraft like Lockheed P-3 Orion or Ilyushin Il-38 May. It is for air reconnaissance over oceans and seas, which is looking for enemy warships, particularly submarines. Weapons are generally torpedoes, missiles, mines, and light rockets. * Coastal Survey, with aircraft like Dassault Falcon 50M or Fokker 50 MPA, is like maritime patrol but closer to the coast. Some of the aircraft that are used are armed. * Search and rescue, with aircraft and helicopters like Aérospatiale SA-321 Super Frelon or Lockheed HC-130 Hercules. is to find and rescue the victims of accidents at sea. That happens after shipwrecks or in heavy storms. * Fighting and air combat is the mission of naval fighters that fly from an aircraft carrier. Famous aircraft in 2013 are Dassault Rafale M and F/A-18 Hornet. * Fighting against submarines, is the mission of naval helicopters like Sikorsky SH-60 Seahawk or Mil Mi-14. Weapons are generally torpedoes pr mines. == Countries == In 2013, the following countries had a naval aviation: Argentina, Brazil, France, India, Italy, Japan, Russia, Spain, the United Kingdom, and the United States. == History == The first naval aviation was the British Royal Naval Air Service, which was created on 13 April 1912. On April 1, 1918, the Royal Naval Air Service and the Royal Flying Corps were merged into the Royal Air Force. During World War I and after World War II, naval aviation were used for all kinds of combat missions. Famous battles were Pacific War, Normandy landings, the Dieppe Raid, and the Battle of Midway. After the World Wars, it was used for the Falklands War, the Libyan Civil War, and the Gulf War. == United States Marine Corps Aviation == United States Marine Corps Aviation was used during World War II, the Korean War, and the Vietnam War ==U.S. naval aviation== U.S. naval aviation was used during World War II, the Korean War, and the Vietnam War. Category:Military aviation Category:Navy",
 "title": "Naval aviation"
}