{
 "id": "407701",
 "text": "\"I'll Stand By You\" is a song by The Pretenders. It was released in 1994. It was for their sixth studio album, Last of the Independents. It was written by Chrissie Hynde with help from Tom Kelly and Billy Steinberg. \"I'll Stand By You\" became a hit song for the group and their most popular recording. It became their last successful single in North America. The song is a power ballad. It talks about love and faithfulness in times of feeling down or worthless. Since its release, the track had also became a major hit for the British girl group Girls Aloud in 2004. American singer Carrie Underwood recorded the song in 2007. She did so as a charity single to help others. Colombian singer Shakira recorded the song as a charity single as well. It was to raise money for the victims of the 2010 Haiti earthquake. == The Pretenders' version == ===Charts=== ====Peak positions==== Chart (1994) Peak position Australian ARIA Singles Chart 8 UK Singles Chart 10 U.S. Billboard Hot 100 16 U.S. Billboard Modern Rock Tracks 21 Swedish Top 60 Singles 21 ====End of year charts==== End of year chart (1995) Position U.S. Billboard Hot 100 95 == Girls Aloud version == ===Charts=== Chart (2004) Peak position ====Year-end chart==== Chart (2004) Peak position United Kingdom (2004) 34 ====Certification==== Country Certification (sales thresholds) United Kingdom Silver ====Chart procession and succession==== == Carrie Underwood version == ===Charts=== Chart (2007) Peak position * A Charted from unsolicited airplay. == Shakira version == ===Chart performance=== Chart (2010) Peak position ==Other versions== *Patti Labelle (2005) *Rod Stewart (2006) *American Idol Season 6 contestant Gina Glocksen performed the song in the Top 10 round. *The cast of Glee (2009) *The girl group \"Belle Amie\" performed the song in the 2010 X Factor finals. *One of American Idol Season 10 Top 24 Girls, Pia Toscano, performed this song, in which the judges made their first standing ovation of the season. *Kim Wilde (2011) * Girl Group Fifth Harmony performed the song on the second season of The X Factor USA during Thanksgiving week. *During the 12th season of American Idol, contestant Angela Miller performed the song. == References == Category:1994 songs Category:1990s ballads Category:Rock ballads Category:The Pretenders songs Category:Rod Stewart songs Category:Kim Wilde songs Category:Girls Aloud songs Category:Shakira songs Category:Carrie Underwood songs",
 "title": "I'll Stand by You"
}