{
 "id": "407860",
 "text": "Lawrence Robert \"Larry\" Shreve (born January 11, 1941 in Windsor, Ontario) better known by his ring names, Abdullah the Butcher and The Madman from the Sudan, is a Canadian retired professional wrestler. Due to years of frequent blading, there are many scars on his forehead. Mick Foley said that Shreve used to put gambling chips into the deeper divots in his head to both entertain and scare the people at the casinos they went to. During his professional career, Shreve has competed for many different companies including WCW, ECW, Dragon Gate, New Japan Pro Wrestling. He was inducted into the WWE Hall of Fame in 2011 by Terry Funk. \"Superstar\" Billy Graham hat he wanted his own name to be taken out of the Hall of Fame, saying \"It is a shameless organization to induct a bloodthirsty animal such as Abdullah the Butcher into their worthless and embarrassing Hall of Fame and I want the name of Superstar Billy Graham to be no part of it.\" ==Championships== Shreve held many championships during his professional wrestling career: *All Japan Pro Wrestling **NWA International Tag Team Championship (one time) - with Ray Candy **NWA United National Championship (one time) **PWF United States Heavyweight Championship (one time) **PWF World Heavyweight Championship (one time) **Champion Carnival (1976, 1979) **January 4th Korakuen Hall Heavyweight Battle Royal Winner (2008) *Big Japan Pro Wrestling **BJW Deathmatch Heavyweight Championship (one time) *Central States Wrestling **NWA Central States Tag Team Championship (two times) - with Roger Kirby *Georgia Championship Wrestling **NWA Georgia Heavyweight Championship (one time) **NWA Georgia Television Championship (one time) *International Wrestling Association **IWA International Heavyweight Championship (three times) *Lutte Internationale (Montreal) **Canadian International Heavyweight Championship (one time) *Midwest Wrestling Federation **MWWF Heavyweight Championship (two times) *NWA All-Star Wrestling **NWA Canadian Tag Team Championship (Vancouver version) (two times) - with Dr. Jerry Graham (one) and Armand Hussein (one) **NWA World Tag Team Championship (Vancouver version) (one time) - with Dr. Jerry Graham *NWA Detroit **NWA United States Heavyweight Championship (Detroit version) (one time) **NWA World Tag Team Championship (Detroit version) (one time) - with Killer Tim Brooks *NWA New Zealand **NWA New Zealand British Commonwealth Championship (one time) *NWA Southwest **NWA Texas Hardcore Championship (one time) *National Wrestling Federation **NWF Heavyweight Championship (two times) **NWF International Championship (one time) *Pro Wrestling Illustrated **He was ranked #35 of the 500 best singles wrestlers of the \"PWI Years\" by PWI in 1991. *Stampede Wrestling **NWA Canadian Heavyweight Championship (Calgary version) (one time) **Stampede North American Heavyweight Championship (six times) *Tokyo Pro Wrestling **TPW Tag Team Championship (one time) - with Benkei *Tokyo Sports Grand Prix **Best Bout Award (1979) with Tiger Jeet Singh vs. Antonio Inoki and Giant Baba on August 26 **Popularity Prize (1978, 1980) *World Class Wrestling Association **WCWA Brass Knuckles Championship (one time) *World Wrestling Council **WWC Caribbean Heavyweight Championship (two times) **WWC Hardcore Championship (one time) **WWC North American Heavyweight Championship (two times) **WWC Puerto Rico Heavyweight Championship (three times) **WWC Universal Heavyweight Championship (three times) **WWC World Heavyweight Championship (one time) *Wrestling Observer Newsletter awards **Wrestling Observer Newsletter Hall of Fame (Class of 1996) *World Wrestling Entertainment **WWE Hall of Fame (Class of 2011) ==References== ==Other websites== * *Abdullah the Butcher's WWE Hall of Fame profile Category:1941 births Category:Living people Category:Black Canadian sportspeople Category:Canadian professional wrestlers Category:Sportspeople from Windsor, Ontario Category:WWE Hall of Fame",
 "title": "Abdullah the Butcher"
}