{
 "id": "407826",
 "text": "Vincent Eugene Craddock (or simply Gene Vincent; February 11, 1935 – October 12, 1971) was an American musician. His music was rock and roll and rockabilly. He was notable for his 1956 classic single \"Be-Bop-A-Lula\". He had other hit songs, including \"Race with the Devil\". == Death and legacy == Vincent died at the age of 36 on October 12, 1971, from a combination of a ruptured ulcer, internal hemorrhage and heart failure, while visiting his father in Saugus, California. He is interred at Eternal Valley Memorial Park, in Newhall, California. Vincent is mentioned in one of Ian Dury's earliest songs, \"Upminster Kid\" (on the 1975 Kilburn and the High Roads album Handsome), with the words \"Well Gene Vincent Craddock remembered the love of an Upminster rock 'n' roll teen\". Vincent had died just four years earlier. He later recorded the song \"Sweet Gene Vincent\". Vincent was the first inductee into the Rockabilly Hall of Fame upon its formation in 1997. The following year he was inducted into the Rock and Roll Hall of Fame. Vincent has a star on the Hollywood Walk of Fame at 1749 North Vine Street. In 2012, his band, the Blue Caps, were retroactively inducted into the Rock and Roll Hall of Fame by a special committee, alongside Vincent. On Tuesday, September 23, 2003, Vincent was honored with a Norfolk's Legends of Music Walk of Fame bronze star embedded in the Granby Street sidewalk. Ritchie Unterberger from AllMusic said that Vincent was a famous rockabilly musician who really showed off the cool, rebellious side of rock and roll with his slick hair, leather jackets, and love for fast cars and girls. Village Voice critic Robert Christgau was less impressed by the musician's career, saying \"Vincent was never a titan – his few moments of rockabilly greatness were hyped-up distillations of slavering lust from a sensitive little guy who was just as comfortable with 'Over the Rainbow' in his normal frame of mind.\" However, he included Vincent's compilation album The Bop That Just Won't Stop (1974) in his \"basic record library\", published in Christgau's Record Guide: Rock Albums of the Seventies (1981). == References == Category:1935 births Category:1971 deaths Category:Disease-related deaths in California Category:People from Norfolk, Virginia Category:Singers from Virginia Category:Deaths from ulcers",
 "title": "Gene Vincent"
}