{
 "id": "407926",
 "text": "Connecticut has a variety of animal species. * The state bird is the American Robin. * The state insect is the European Mantis. * The state animal is the Sperm Whale. * The state shellfish is the Eastern Oyster. * The state fish is the American Shad. * The state fossil is the Eubrontes giganteus. ==Biodiversity== There are 599 Connecticut species listed as endangered, threatened or of special concern. These are 11 species of mammals, 50 species of birds, 11 species of reptiles, 7 species of amphibians, 7 species of fish, and 170 species of invertebrates. ==Ancient life== The Peabody Museum of Natural History and the Dinosaur State Park are two places which preserve the prehistory of Connecticut. Extinct species that once roamed Connecticut include Coelophysis,* Age of Dinosaurs Field Trip Dilophosaurus, and Eubrontes.* Aspects of Connecticut's Physical Geography ==List of native species== Sources appear below.University of New Haven Student Projects - \"Potential Impacts of the Proposed Galleria at Long Wharf on the Biological, Chemical, and Socioeconomic Aspects of the Local New Haven Environment\" - Slide 7: Species List, by Sara Ignudo and Farah Refai, Fall 2000 ===Annelids=== * Ampharete arctica * Capitella capitata * Capitellidae * Eteone lactea * Glycera dibranchiata * Alitta (Nereis) succinea * Ophelia sp. * Phyllodoce sp. * Polydora sp. * Scoloplos robustus * Spio setosa * Spionidae * Streblospio benedicti * Syllidae sp. ===Arthropods=== * Chiridotea s p p. * Gammarus sp. * Neomysis americana * Sphaeroma quadridentata ===Mollusks=== * Acteocina canaliculata * Gemma gemma * Nassarius obsoletus * Mulinia lateralis * Mya arenaria * Nucula sp. * Periploma papyratium * Retusa canaliculata * Tellina agillis ==Related pages== * Plants of Connecticut == References == ==More reading== * Aspects of Connecticut's Physical Geography * Connecticut Audubon Society * Connecticut Department of Environmental Protection - Natural Diversity Data Base * Fishes of the Connecticut River * The Flora and Fauna of Branford Category:Connecticut Category:Animals of North America",
 "title": "Animals of Connecticut"
}