{
 "id": "407986",
 "text": "Austin Butler (born August 17, 1991) is an American actor. His early roles were as Jake Krandle in the TV series iCarly and as James Garrett in Zoey 101. He became well known in 2022 for playing Elvis Presley in Elvis. The role won him a Golden Globe Award, BAFTA Award and earned him an Academy Award for Best Actor nomination. == Personal life == Austin Butler was born in Anaheim, California. His parents are Lori Butler and David Butler. Butler was in a relationship with actress Vanessa Hudgens from 2011 to 2020. He is currently dating model Kaia Gerber since late 2021. ==Career== His first acting job was in a supporting role in the TV Series Ned's Declassified School Survival Guide. His older sister also plays in that TV series. From 2007 to 2008 he played in the 4th season of Zoey 101 as James Garrett. Other television appearance were Hannah Montana, iCarly, Jonas L.A., Zeke and Luther, and Wizards of Waverly Place. In 2009, he was in the TV series Ruby & the Rockits as Jordan Gallagher. This series was unsuccessful and ended after 10 episodes. Later, he played with Ashley Tisdale in the film Aliens in the Attic and in Sharpay's Fabulous Adventure. Since 2011, he has been in the ABC-Family-Series Switched at Birth. In July 2019, he appeared in the Quentin Tarantino movie Once Upon a Time in Hollywood as a fictional version of Manson Family member Tex Watson. That same month, Butler was cast as Elvis Presley in Elvis, a biographical movie about the singer directed by Baz Luhrmann. In 2024, he portrayed Feyd-Rautha Harkonnen in Dune: Part Two, directed by Denis Villenueve and based on the novel by Frank Herbert. ==References== ==Other websites== * Category:1991 births Category:Living people Category:BAFTA Award winning actors Category:Golden Globe Award winning actors Category:Actors from Anaheim, California Category:American television actors Category:American movie actors Category:American voice actors Category:Models from California",
 "title": "Austin Butler"
}