{
 "id": "407977",
 "text": "The 1936 Olympic football tournament was won by Italy. They were the favourites to win, having won the FIFA World Cup in 1934. The host nation, Germany, were also one of the favourites at the start of the competition. They had only lost at home once in three years. However, they were beaten in the quarter-finals. The bronze- and gold-medal games were watched by a combined total of 195,000 people. ==Medalists== * * * Bruno Venturini Alfredo Foni Pietro Rava Giuseppe Baldo Achille Piccini Ugo Locatelli Annibale Frossi Libero Marchini Luigi Scarabello Carlo Biagi Giulio Cappelli Sergio Bertoni Alfonso Negro Francesco Gabriotti * * * Franz Fuchsberger Max Hofmeister Eduard Kainberger Karl Kainberger Martin Kargl Josef Kitzmüller Anton Krenn Ernst Künz Adolf Laudon Franz Mandl Klement Steinmetz Karl Wahlmüller Walter Werginz * * * Henry Johansen Fredrik Horn Nils Eriksen Frithjof Ulleberg Jørgen Juve Rolf Holmberg Sverre Hansen Magnar Isaksen Alf Martinsen Reidar Kvammen Arne Brustad Øivind Holmsen Odd Frantzen Magdalon Monsen ==First round== \\---- \\---- \\---- \\---- \\---- \\---- \\---- ==Quarter finals== \\---- \\---- \\---- \\---- Replay 1 Due to a pitch invasion, the match was declared null and void. It was ordered to be replayed on August 10. Peru did not accept this decision and withdrew from the tournament. ==Semi finals== \\---- ==Bronze medal match== ==The Final (Gold medal match)== ===Bracket=== {{Round16 |3 August – Berlin| |1| |0 |4 August – Berlin| |3| |2 |3 August – Berlin| |4| |0 |4 August – Berlin| |9| |0 |5 August – Berlin| |3| |1 |6 August – Berlin| |7| |3 |5 August – Berlin| |3| |0 |6 August – Berlin| |2| |0 |7 August – Berlin| |8| |0 |7 August – Berlin| |2| |0 |8 August – Berlin| |2| |02 |8 August – Berlin| |5| |4 |10 August – Berlin| (AET)|2| |1 |11 August – Berlin| |3| |1 |15 August – Berlin| (AET)|2| |1 |13 August – Berlin| |3| |2| |widescore=yes}} 2Awarded. ==Final ranking== # # # # # # # # # # # # # # # # ==Other websites== *Olympic Football Tournament Berlin 1936 , FIFA.com *RSSSF Archive Category:Olympic football tournaments Category:1936 in sports Category:1936 Summer Olympics events",
 "title": "Football at the 1936 Summer Olympics"
}