{
 "id": "408099",
 "text": "This is a list of kings who ruled over the German territories of central Europe. The kings reigned from the division of the Frankish Empire in 843 until the end of the German Empire in 1918. It also includes the heads of the different German confederations after the collapse of the Holy Roman Empire in 1806. ==Kingdom of Germany, 843–1806== Emperors are listed in bold. Rival kings, anti-kings, and junior co-regents are listed in italics. Image Name House King Emperor Ended Notes Louis the German (Ludwig II der Deutsche) Carolingian 11 August 843 — 23 August 876 Son of Emperor Louis the Pious and grandson of Charlemagne Louis the Younger (Ludwig III der Jüngere) Carolingian 28 August 876 — 20 January 882 Son of Louis the German; ruled in East Francia, Saxony, and from 880 also Bavaria Carloman (Karlmann) Carolingian 28 August 876 — 22 March 880 Son of Louis the German; ruled in Bavaria; from 877 he also ruled as King of Italy Charles the Fat (Karl III, der Dicke) Carolingian 28 August 876 12 February 881 11 November 887 Son of Louis the German; ruled in Alemannia, Raetia, from 882 in the entire Eastern Kingdom; from 879 also King of Italy Arnulf of Carinthia (Arnulf von Kärnten) Carolingian 30 November 887 25 April 896 8 December 899 Son of Carloman Louis the Child (Ludwig IV das Kind) Carolingian 21 January 900 — 20/24 September 911 Son of Arnulf of Carinthia Conrad I (Konrad I) Conradine (Franconian) 10 November 911 — 23 December 918 Henry I the Fowler (Heinrich I der Vogler) Liudolfing 23 April 919 — 2 July 936 Arnulf the Bad (Arnulf der Böse, Herzog von Bayern) Luitpolding (Bavarian) 919 — 921 Rival king to Henry I Otto I the Great (Otto I der Große) Ottonian 7 August 936 2 February 962 7 May 973 Son of Henry I; first king crowned in Aachen Cathedral since Lothair I; crowned as Otto by the grace of God King;Alfred P. Smyth, Palgrave Macmillan (1998) Medieval Europeans: studies in ethnic identity and national perspectives in medieval Europe, p. 64 crowned Holy Roman Emperor in 961. Otto II the Red (Otto II) Ottonian 26 May 961 25 December 967 7 December 983 Son of Otto I; Otto by the grace of God King under his father 961–973; also crowned Emperor in his father's lifetime Otto III (Otto III) Ottonian 25 December 983 21 May 996 21 January 1002 Son of Otto II; Otto by the grace of God King Henry II (Heinrich II der Heilige) Ottonian 7 June 1002 26 April 1014 13 July 1024 Great-grandson of Henry I Conrad II (Konrad II) Salian (Frankish) 8 September 1024 26 March 1027 4 June 1039 Great-great-grandson of Otto I Henry III (Heinrich III) Salian 14 April 1028 25 December 1046 5 October 1056 Son of Conrad II; King (of the Germans?) under his father 1028–1039 Henry IV (Heinrich IV) Salian 17 July 1054 21 March 1084 31 December 1105 Son of Henry III; King of Germany under his father 1054–1056 Rudolf of Rheinfelden (Rudolf von Rheinfelden) Rheinfeld 15 March 1077 — 15 October 1080 Rival King to Henry IV Hermann of Salm (Hermann von Luxemburg, Graf von Salm) Salm 6 August 1081 — 28 September 1088 Rival King to Henry IV Conrad (Konrad) Salian 30 May 1087 — 27 July 1101 Son of Henry IV; King of Germany under his father 1087–1098, King of Italy 1093–1098, 1095–1101 in rebellion. Henry V (Heinrich V) Salian 6 January 1099 13 April 1111 23 May 1125 Son of Henry IV; King of Germany under his father 1099–1105, forced his father to abdicate. Lothair III (Lothar III) Supplinburger 30 August 1125 4 June 1133 4 December 1137 Conrad III (Conrad III) Hohenstaufen 7 March 1138 — 15 February 1152 Grandson of Henry IV (through his mother); Previously Rival King to Lothair III 1127–1135 Henry Berengar (Heinrich (VI)) Hohenstaufen 30 March 1147 — August? 1150 Son of Conrad III; King of Germany under his father 1147–1150 Frederick I Barbarossa (Friedrich I Barbarossa) Hohenstaufen 4 March 1152 18 June 1155 10 June 1190 Nephew of Conrad III Henry VI (Heinrich VI) Hohenstaufen 15 August 1169 14 April 1191 28 September 1197 Son of Frederick I; King of Germany under his father 1169–1190 Frederick II (Friedrich II) Hohenstaufen 1197 — 1197 Son of Henry VI; King of Germany under his father 1196 Philip of Swabia (Philipp von Schwaben) Hohenstaufen 6 March 1198 — 21 August 1208 Son of Frederick I; Rival king to Otto IV Otto IV (Otto IV von Braunschweig) Welf 29 March 1198 4 October 1209 5 July 1215 Rival king to Philip of Swabia; later opposed by Frederick II; deposed 1215; died 19 May 1218 Frederick II (Friedrich II) Hohenstaufen 5 December 1212 22 November 1220 26 December 1250 Son of Henry VI; Rival king to Otto IV until 5 July 1215 Henry (Heinrich (VII)) Hohenstaufen 23 April 1220 — 15 August 1235 Son of Frederick II; King of Germany under his father 1220–1235 Conrad IV (Konrad IV) Hohenstaufen May 1237 — 1 May 1254 Son of Frederick II; King of Germany under his father 1237–1250 Henry Raspe (Heinrich Raspe) Thuringia 22 May 1246 — 16 February 1247 Rival King to Frederick II William of Holland (Wilhelm von Holland) Holland 3 October 1247 — 28 January 1256 Rival King to Frederick II and Conrad IV, 1247–1254 Richard of Cornwall (Richard von Cornwall) Plantagenet 13 January 1257 — 2 April 1272 Rival king to Alfonso of Castile; held no real authority. Alfonso of Castile (Alfons von Kastilien) House of Burgundy 1 April 1257 — 1275 Grandson of Philip; Rival king to Richard of Cornwall; held no authority; later opposed by Rudolf I; relinquished claims 1275, died 1284 Rudolf I (Rudolf I von Habsburg) Habsburg 29 September 1273 15 July 1291 First of the Habsburgs Adolf of Nassau (Adolf von Nassau) Nassau 5 May 1292 — 23 June 1298 According to some historians, Adolf's election was preceded by the short-lived kingship of Conrad, Duke of Teck. See his article for details. Albert I (Albrecht I von Habsburg) Habsburg 24 June 1298 — 1 May 1308 Son of Rudolf I; Rival King to Adolf of Nassau, 1298 Henry VII (Heinrich VII, Luxemburger) Luxembourg 27 November 1308 13 June 1311 24 August 1313 Louis IV (Ludwig IV, der Bayer, Wittelsbacher) Wittelsbach 20 October 1314 17 January 1328 11 October 1347 Grandson of Rudolf I; Rival king to Frederick the Fair 1314–1322 Frederick the Fair (Friedrich der Schöne, Habsburger) Habsburg 19 October 1314/ 5 September 1325 — 28 September 1322/ 13 January 1330 Son of Albert I; Rival king to Louis IV 1314–1322; associate king with Louis IV 1325–1330 Charles IV (Karl IV von Luxemburg) Luxembourg 11 July 1346 5 April 1355 29 November 1378 Grandson of Henry VII; Rival king to Louis IV, 1346–1347; also King of Bohemia, King of Italy and Holy Roman Emperor Günther von Schwarzburg (Günther von Schwarzburg) Schwarzburg 30 January 1349 — 24 May 1349 Rival King to Charles IV Wenceslaus (Wenzel von Luxemburg) Luxembourg 10 June 1376 — 20 August 1400 Son of Charles IV; King of Germany under his father 1376–1378; deposed 1400; also by inheritance King of Bohemia; died 1419 Rupert of Palatinate (Ruprecht von der Pfalz, Wittelsbacher) Wittelsbach 21 August 1400 — 18 May 1410 Great-grandnephew of Louis IV Sigismund (Sigismund von Luxemburg) Luxembourg 20 September 1410/ 21 July 1411 3 May 1433 9 December 1437 Son of Charles IV Jobst of Moravia (Jobst von Mähren, Luxemburger) Luxembourg 1 October 1410 — 8 January 1411 Nephew of Charles IV; Rival King to Sigismund Albert II (Albrecht II) Habsburg 18 March 1438 — 27 October 1439 4th in descent from Albert I; son-in-law of Sigismund Frederick III (Friedrich III) Habsburg 2 February 1440 16 March 1452 19 August 1493 4th in descent from Albert I; 2nd cousin of Albert II Maximilian I (Maximilian I) Habsburg 16 February 1486 4 February 1508 Emperor-elect 12 January 1519 Son of Frederick III; King of Germany under his father 1486–1493; adopted the title Emperor-elect in 1508 with the Pope's approval Charles V (Karl V) Habsburg 28 June 1519 24 February 1530 3 August 1556 Grandson of Maximilian I; died 21 September 1558 Ferdinand I (Ferdinand I) Habsburg 5 January 1531 14 March 1558 Emperor-elect 25 July 1564 Grandson of Maximilian I; brother of Charles V; King of Germany under his brother Charles V 1531–1556; last king to be crowned in Aachen Cathedral. Emperor-Elect Maximilian II (Maximilian II) Habsburg 22 November 1562 25 July 1564 Emperor-elect 12 October 1576 Son of Ferdinand I; King of Germany under his father 1562–1564 Rudolf II (Rudolf II) Habsburg 27 October 1575 2 November 1576 Emperor-elect 20 January 1612 Son of Maximilian II; King of Germany under his father, 1575–1576 Matthias (Matthias) Habsburg 13 June 1612 13 June 1612 Emperor-elect 20 March 1619 Son of Maximilian II Ferdinand II (Ferdinand II) Habsburg 28 August 1619 28 August 1619 Emperor-elect 15 February 1637 Grandson of Ferdinand I Ferdinand III (Ferdinand III) Habsburg 22 December 1636 15 February 1637 Emperor-elect 2 April 1657 Son of Ferdinand II; King of Germany under his father 1636–1637 Ferdinand IV (Ferdinand IV) Habsburg 31 May 1653 — 9 July 1654 Son of Ferdinand III; King of Germany under his father Leopold I (Leopold I) Habsburg 18 July 1658 18 July 1658 Emperor-elect 5 May 1705 Son of Ferdinand III Joseph I (Joseph I) Habsburg 23 January 1690 5 May 1705 Emperor-elect 17 April 1711 Son of Leopold I; King of Germany under his father 1690–1705 Charles VI (Karl VI) Habsburg 27 October 1711 27 October 1711 Emperor-elect 20 October 1740 Son of Leopold I Charles VII (Karl VII) Wittelsbach 14 January 1742 14 January 1742 Emperor-elect 20 January 1745 Husband of Maria Amalia, daughter of Joseph I Francis I (Franz I) Lorraine 13 September 1745 13 September 1745 Emperor-elect 18 August 1765 Husband of Maria Theresa, daughter of Charles VI Joseph II (Joseph II) Habsburg-Lorraine 27 March 1764 18 August 1765 Emperor-elect 20 February 1790 Son of Francis I and Maria Theresa; King of Germany under his father 1764–1765 Leopold II (Leopold II) Habsburg-Lorraine 30 September 1790 30 September 1790 Emperor-elect 1 March 1792 Son of Francis I and Maria Theresa Francis II (Franz II) Habsburg-Lorraine 7 July 1792 7 July 1792 Emperor-elect 6 August 1806 Son of Leopold II. He dissolved the Holy Roman Empire. Also Emperor of Austria 1804–1835. Died 1835. ==German confederations, 1806–1871== ===Confederation of the Rhine, 1806–1813=== Name Portrait Title House Began Ended Napoleon I, Emperor of the French (Napoléon I, Kaiser der Franzosen) Protector of the Confederation of the Rhine Bonaparte 25 July 1806 19 October 1813 ===German Confederation, 1815–1866=== Name Portrait Title House Began Ended Francis I, Emperor of Austria (Franz I, Kaiser von Österreich) President of the German Confederation Habsburg-Lorraine 20 June 1815 2 March 1835 Ferdinand I, Emperor of Austria (Ferdinand I, Kaiser von Österreich) President of the German Confederation Habsburg-Lorraine 2 March 1835 12 July 1848 Archduke John of Austria (Erzherzog Johann von Österreich) Imperial VicarElected by the Frankfurt National Assembly as Imperial Vicar of a new German Reich. The German Confederation was considered dissolved. Habsburg-Lorraine 12 July 1848 20 December 1849 Frederick William IV, King of Prussia (Friedrich Wilhelm IV, König von Preußen) Emperor of the Germans elect Hohenzollern Elected Emperor of the Germans by the Frankfurt National Assembly on 28 March 1849, but refused the crown on 3 April 1849 President of the Erfurt Union 26 May 1849 29 November 1850 Francis Joseph I, Emperor of Austria (Franz Joseph I, Kaiser von Österreich) President of the German Confederation Habsburg-Lorraine 1 May 1850 24 August 1866 ===North German Confederation, 1867–1871=== Name Portrait Title House Began Ended Wilhelm I, King of Prussia (Wilhelm I, König von Preußen) President of the North German Confederation Hohenzollern 1 July 1867 18 January 1871 ==German Empire, 1871–1918== Image Name Date of birth Monarch From Monarch Until Date of death Wilhelm I (William I) (Hohenzollern) 22 March 1797 18 January 1871 9 March 1888 9 March 1888 Friedrich III (Frederick III) (Hohenzollern) 18 October 1831 9 March 1888 15 June 1888 15 June 1888 Wilhelm II (William II) (Hohenzollern) 27 January 1859 15 June 1888 9/28 November 1918His abdication was announced by the Chancellor on 9 November. The king went into exile in the Netherlands. He did not officially abdicate until 28 November. (abdicated) 4 June 1941 ==Related pages== * List of rulers of Saxony ==Footnotes== Germany Germany Category:History of Germany Category:Holy Roman Empire List Of German Monarchs",
 "title": "List of German monarchs"
}