{
 "id": "408196",
 "text": "Kalmar is a town on the coast of Småland in south-eastern Sweden. Kalmar is the central city of Kalmar Municipality, the seat of Kalmar County and the former diocese of Kalmar diocese (which became part of Växjö diocese in 1915). Kalmar got a college in 1977 and a university city in 2010. Kalmar's central city had 41 388 inhabitants in 2020. Kalmar is Småland's third largest urban centre after Jönköping and Växjö. The Kalmar Union of the various Scandinavian states was so named because it was started there in 1397. == Etymology == The Old Swedish place name Kalmarnir or Kalmarnar contains the joint kalm, 'stone cairn' and the plural form arnar of arin, 'gravel island'. The name may have referred at the earliest to the area of Stensö (Stone Island) just south of the town. Kalmar had a large German population in the Middle Ages and possibly influenced by the name of the German town Wismar (from the high german wisa and mara, both meaning 'swamp') a reduction of the suffix may have taken place. An older piece evidence than the one mentioned is Kalmarna sutuma, 'Kalmarsund' on a rune stone from the 11th century at Ärja ödekyrka in Åkers sn. Södermanland. The name Calmar had long had the genitive form Calmare. Even in the so-called Kalmarvisan it is spoken of as \"Kalmare town\". A 17th-century ship known from early Swedish emigration history was called Calmare Nyckel, a name that still occurs in various contexts. In today's Standard Swedish, place names ending in a vowel do not receive the genitive s in established fixed compounds, while place names ending in a consonant do. The genitive-e in the word Kalmar, which has been removed today, explains why the grammatical form of the name violates this rule. It is thus \"Kalmar län\", \"Kalmar domkyrka\", \"Kalmar Slott\" and so on, without -s, and respectively \"Blekinge län\", \"Lund domkyrka\" and \"Ovanåkers kommun\", \"Wismar town hall\". In more occasional constructions, the word Kalmar has the genitive-s in the usual way, for example \"Kalmar's population.\" The place name was spelled Calmar from the 13th century until the mid-19th century. Through initiatives in 1851 by the newspaper \"Calmarposten\" (published 1795-1819) and especially through the newspaper \"Kalmar\" founded in 1864 (which was renamed \"Kalmar-Kalmar läns tidning\" in 1918) and its efforts to modernise, the spelling gradually changed to the present day spelling. The C spelling (and also the genitive form Calmare) still appears in some company and association names, e.g. Calmar Stadshotell, Calmareboden, Calmare Internationella Skola (CIS). The Iowian city Calmar got it's name through a kalmar-born swedish immigrant. == Transport and communications == The city is connected to the outside world by train (Öresund trains, Kust till Kust and Stångådalsbanan), bus and air (Kalmar Öland Airport). The Öland Bridge and the connecting roads run through the northern part of the city. The city is located on the E22 between Malmö and Norrköping and is the start/end point of the Riksväg 25 towards Halmstad and Växjö. Within the city and the county, urban and rural traffic is operated by Kalmar Läns Trafik. Sweden's longest bridge, Ölandsbron, runs between Kalmar and Färjestaden on Öland. Kalmar Öland Airport is Småland's largest airport. == References == ==Other websites== Category:Settlements in Kalmar County",
 "title": "Kalmar"
}