{
 "id": "408311",
 "text": "Shaun T (born May 2, 1978), is an American motivational speaker, fitness trainer, fitness motivator, businessman, television personality and choreographer. He is best known for his home fitness programs for adults and children which include T25, Insanity and Hip-Hop Abs. == Life and career == Shaun T was raised in Deptford, New Jersey. He grew up playing football, baseball and running track. He attended Rowan University where he received his bachelor's degree in Sports Science and minored in Theater/Dance. While there, he was initiated into Alpha Phi Alpha fraternity. After gaining 50 pounds in his freshman year of college, Shaun T became interested in fitness and changed his course of study. He now lives in Phoenix, Arizona.Coach Wayne, Interview for Team Ripped His career began as a health and fitness specialist. He also became a personal trainer and health program manager at Wyeth and also worked at a number of fitness chains, including Equinox Fitness. Shaun T began dancing in college, at 21 years old. He was required to teach an aerobics class which was part of his Sports Science degree and then became an aerobics instructor. After graduating from Rowan University, he moved to Los Angeles where he worked as a choreographer, dancer and trainer.IMDB biography His first professional work as a dancer was for Mariah Carey. Shaun T was teaching a fitness class at Equinox Fitness where he was approached by representatives of Beachbody and asked him to submit a demo for a workout video. Shaun T has been openly gay since October 2012 and is married to Scott Blokker. Twitter items referred to by Gawker (may require registration to view): * * * -- With \"the homie\", Shaun T is referring to Scott Blokker, while Marcia Cuff is \"the BFF\". == Home fitness programs == === Insanity === Carl Daikeler and Jon Congdon launched the Beachbody fitness company in 1998. They were looking for new fitness workout home videos. They approached Shaun T who submitted a demo which would later be called \"Insanity\", released in 2009. It was termed \"the hardest workout put on DVD\". It was sold through TV ads. Because of the difficulty of the workout and its popularity, Shaun T has been a guest on The Oprah Winfrey Show, The Tyra Banks Show, Doctors and the Dr. Oz Show. === Hip- Hop Abs === Shaun T's first work for Beachbody, Hip Hop Abs was released in 2003. In 2007, it was the top-selling workout video in the United States. == Videography == * 2023: Dig Deeper * 2021: Let's get up! * 2019: Transform :20 * 2017: Shaun Week * 2015: Cize (Exercise video series, tagline \"The end of exercise\") * 2014: Insanity Max 30 (Exercise video series) * 2013: Focus T25 (Exercise video series) * 2012: Insanity: The Asylum Vol. 2 - Elite Training Series (Exercise video series) * 2011: Insanity: The Asylum (Exercise video series) * 2009: Insanity (Exercise video series) * 2008: Rockin' Body (Exercise video series) * 2008: Shaun T's Fit Kids Club (Exercise video for ages 7 and up) * 2008: Get Real with Shaun T (Exercise video for pre-teens) * 2007: Hip Hop Abs (Exercise video series) ==Related pages== * Beachbody == References == == Other websites == * Shaun T Fitness: Official Site * Shaun T's official Facebook page Category:1977 births Category:Living people Category:American television personalities Category:Gay men Category:LGBT African-Americans Category:LGBT broadcasters Category:People from New Jersey",
 "title": "Shaun T"
}