{
 "id": "408324",
 "text": "The Princess Diaries is a 2001 American comedy movie. It was produced by singer and actress Whitney Houston. It was directed by Garry Marshall. It is based on Meg Cabot's 2000 novel of the same name. The movie stars Anne Hathaway as Mia Thermopolis. She is a teenager who discover that she is the heir of the throne of the fictional Kingdom of Genovia. Genovia is ruled by her grandmother Queen Dowager Clarisse Renaldi, played by Julie Andrews. It also stars Heather Matarazzo as Mia’s best friend Lilly Moscovitz and Héctor Elizondo as Joseph, the Queen's Head of Security, and Robert Schwartzman as Lilly's brother Michael, who has a crush on Mia. The movie was released in North American theaters on August 3, 2001. The movie peaked at number three in the box office. The movie was very successful. It grossed $165,335,153 worldwide. A sequel, The Princess Diaries 2, was released in August 2004. ==Plot== Shy high school student Mia Thermopolis resides with her single mother, Helen, in a refurbished firehouse in San Francisco. Unpopular among her peers, Mia suffers from a fear of public speaking while harboring a crush on Josh Bryant, and is often teased by his popular girlfriend Lana Thomas. Mia's only friends are social outcast Lilly Moscovitz, and Lilly's older brother Michael, who secretly harbors feelings for her. Mia learns from her estranged paternal grandmother, Clarisse, that she is the sole heir to the European kingdom of Genovia, having inherited the throne from her recently deceased father Philippe. Clarisse is determined to groom Mia into a refined princess so she may one day rule the kingdom over which Clarisse currently presides. Overwhelmed by the discovery, Mia initially refuses until Helen convinces her to attend her grandmother's \"princess lessons\" on the condition that she needs not make her final decision until the Genovian Independence Day Ball in three weeks' time. Mia receives a glamorous makeover and a limousine chauffeured by Joe, the queen's head of security and confidante, who becomes a father figure to her. Mia's transformation causes her schoolmates to treat her differently, while her increasingly hectic schedule strains her relationship with Lilly. To appease her best friend, Mia tells Lilly the truth and swears her to secrecy. However, the public soon learns that Mia is a princess after the secret is sold to the press by Paolo, the hairdresser responsible for Mia's makeover, and the paparazzi begin to pursue her relentlessly. Although Mia embarrasses herself at her first state dinner, the queen admits that she found her clumsiness endearing and suggests that they spend quality time together. While bonding, Clarisse explains that although Mia's parents loved each other, they divorced amicably in order to pursue their own passions, Philippe remaining in Genovia to eventually become King, and Helen returning to America with Mia to offer her a \"normal\" childhood. As Mia's popularity grows, Josh invites her to attend a beach party with him. Mia accepts, causing her to neglect Lilly and forego her plans with Michael. Josh kisses Mia in front of the paparazzi to bolster his own fame, while Lana helps the paparazzi photograph Mia wearing only a towel; both photographs are printed in the newspaper the following day. Finding the photos inappropriate for a princess, Clarisse admonishes Mia for her behavior, after which a humiliated Mia promises to renounce her title. Joe reminds Clarisse that Mia is still a teenager and her granddaughter, suggesting that the queen reacted too harshly. After making amends with Lilly, Mia finally stands up to Lana for bullying a schoolmate. Mia invites Lilly and Michael to the ball but Michael declines, still heartbroken over Mia's initial dismissal. After Clarisse apologises to Mia for scolding her, she states that Mia must publicly renounce the throne at the ball. Terrified by the prospect, Mia plans to run away until she discovers a touching letter from her late father and relents. Mia's car malfunctions while driving to the ball, stranding her in a downpour until she is retrieved by Joe. When she finally arrives, Mia, still wet and untidy from the rain, delivers a compelling speech and accepts her role as Princess of Genovia. After changing into a gown, Mia accompanies Clarisse into the ballroom where Michael, who has accepted Mia's apology, invites her to dance before confessing their feelings for each other and sharing their first kiss. In the final scene, Mia is shown travelling to Genovia in a private plane with her pet cat Fat Louie, and she writes in her diary that she plans to relocate to Genovia with their mother. ==Cast== * Anne Hathaway as Mia Thermopolis * Julie Andrews as Queen Clarisse Renaldi * Heather Matarazzo as Lilly Moscovitz * Héctor Elizondo as Joseph \"Joe\" * Mandy Moore as Lana Thomas * Caroline Goodall as Helen Thermopolis, Mia's mother * Robert Schwartzman as Michael Moscovitz * Erik von Detten as Josh Bryant * Sean O'Bryan as Patrick O'Connell * Sandra Oh as Vice Principal Gupta * Kathleen Marshall as Charlotte Kutaway * Mindy Burbano as Gym teacher, Ms. Harbula * René Auberjonois (uncredited) as Voice of Philippe Renaldi * Larry Miller (uncredited) as Paolo ==Awards and nominations== Year Award Category Nominee Result 2002 ALMA Award Outstanding Song in a Motion Picture Soundtrack \"Miracles Happen\" by Myra ASCAP Top Box Office Film John Debney Artios Award Best Casting for Feature Film, Comedy Marcia Ross, Donna Morong, Gail Goldberg BFCA Award Best Family Film - Live Action Golden Trailer Award Best Animation/Family Hollywood Makeup Artist Hair Stylist Guild Award Best Contemporary Makeup - Feature Hallie D'Amore, Leonard Engelman MTV Movie Award Breakthrough Female Performance Anne Hathaway Teen Choice Award Choice Movie: Actress, Comedy Anne Hathaway Choice Movie: Comedy Young Artist Award Best Family Feature Film - Comedy == Other websites == * * * * * Category:2001 comedy-drama movies Category:2001 romantic comedy movies Category:American comedy-drama movies Category:American romantic comedy movies Category:American teen comedy movies Category:American teen drama movies Category:American teen romance movies Category:2000s English-language movies Category:Movies about princesses Category:Movies about royalty Category:Movies set in San Francisco Category:Movies set in Europe Category:Movies set in a fictional country Category:Movies set in palaces Category:Movies directed by Garry Marshall Category:Disney movies Category:Movies about old age",
 "title": "The Princess Diaries"
}