{
 "id": "408316",
 "text": "\"No Scrubs\" is a Grammy Award-winning song. It was recorded by American contemporary R&B; girl group TLC. It was for their album, FanMail. It was released on February 2, 1999 as the lead single. \"No Scrubs\" became TLC's third number-one single and eighth top-ten single on the US Billboard Hot 100. It also earned them their second Grammy nomination for Record of the Year. It was certified gold in the US for sales of over 500,000 copies. It was the second-best performing song of 1999 in the US, behind Cher's \"Believe\". English singer-songwriter Ed Sheeran credited the writers of \"No Scrubs\" when he used a sample of the song in his 2017 single, \"Shape of You\". ==Track listings== US CD and cassette single US 12-inch single International maxi single European 12-inch single UK CD1 UK CD2 French CD single ==Credits and personnel== Credits adapted from the back cover of \"No Scrubs\". Production * Produced by Kevin \"Shekspere\" Briggs for Shekspere Productions, Inc. and D.A.R.P. Inc. * Recorded by Carlton Lynn at D.A.R.P. Studios, Atlanta, Georgia * Assisted by Ty Hudson * Mixed by Leslie Braithwaite at D.A.R.P. Studios * Assisted by Vernon J. Mungo * Background vocals by Rozonda \"Chilli\" Thomas, Tionne \"T-Boz\" Watkins, Debra Killings, Kandi Burruss and Tameka \"Tiny\" Cottle * MIDI and sound design by Shekspere for Shekspere Productions, Inc. * Mastered by Herb Powers at Powers House of Sound, New York Executive producers * Antonio M. Reid * Kenneth B. Edmonds * Dallas Austin * TLC Artwork * Art director – Darrick \"O.L.\" Warfield * Creative coordinator – Cherie O'Brien * Photography – Seb Janiak ==Charts== ===Weekly charts=== Weekly chart performance for \"No Scrubs\" Chart (1999) Peak position Denmark (IFPI) 5 Europe (European Hot 100 Singles) 2 Greece (IFPI) See LW column. 4 Iceland (Íslenski Listinn Topp 40) 11 Italy (Musica e dischi) 7 Poland (Music & Media) 1 ===Year-end charts=== Year-end chart performance for \"No Scrubs\" in 1999 Chart (1999) Position Australia (ARIA) 12 Belgium (Ultratop 50 Flanders) 32 Belgium (Ultratop 50 Wallonia) 16 Canada Top Singles (RPM) 5 Canada Dance/Urban (RPM) 1 Europe (European Hot 100 Singles) 16 France (SNEP) 21 Germany (Official German Charts) 27 Netherlands (Dutch Top 40) 16 Netherlands (Single Top 100) 19 New Zealand (Recorded Music NZ) 8 Norway End of School Period (VG-lista) 9 Romania (Romanian Top 100) 9 Sweden (Sverigetopplistan) 60 Switzerland (Schweizer Hitparade) 23 UK Singles (OCC) 16 UK Airplay (Music Week) 10 UK Urban (Music Week) 3 US Billboard Hot 100 2 US Hot R&B;/Hip-Hop Singles & Tracks (Billboard) 4 US Mainstream Top 40 (Billboard) 6 US Rhythmic Top 40 (Billboard) 1 ===Decade-end charts=== Decade- end chart performance for \"No Scrubs\" from 1990 to 1999 Chart (1990–1999) Position US Billboard Hot 100 33 ==Certifications== ==Release history== Release dates and formats for \"No Scrubs\" Region Date Format(s) Label United States February 2, 1999 Rhythmic contemporary radio February 8, 1999 Urban contemporary radio United Kingdom March 22, 1999 United States March 23, 1999 Japan March 25, 1999 CD single LaFace ==References== ==Other websites== * Category:1999 songs Category:TLC (group) songs Category:Billboard Hot 100 number one songs Category:Billboard Rhythmic Songs number-one singles Category:Dance-pop songs Category:Hip hop songs Category:R&B; songs",
 "title": "No Scrubs"
}