{
 "id": "40858",
 "text": "The Moscow Metro is a metro system which reaches nearly every part of the city of Moscow in Russia. It is one of the most heavily used metro systems in the world. It is also famous for its stations, which are heavily decorated with paintings. In total the metro is 314 kilometres long and has 214 stations (including 1 temporarily closed). During the day about 7.2 million passengers use the metro. As in many subway systems every line has its own colour, name and number. In total there are 14 lines. The metro runs from 5:30 AM to 1:00 AM. In peak hours trains run every 90 seconds, in the rest of the day every 3–4 minutes and in the evening every 6–10 minutes. The metro does not publish a timetable, because the trains run at short intervals. Part of Filevskaya line (4) has a timetable because there are two lines there - new line to Mezhdunarodnaya and old line to Fili. == History == The first stations were opened 1935, May 15th. There were routes from Sokolniki to Park kultury and to Smolenskaya. First the Moscow metro had name after Lazar Kaganovich who was the had of Moscow Committee of All-Union communist party. In 1957 he was exiled from the party, and the Moscow metro became be named after V. I. Lenin. During the Great Patriotic War of the Soviet Union some stations were used as shelters against bombs. == Lines == The Moscow Metro has 16 lines, consisting of 14 normal lines and one light line and one U-railway. Here is a short overview of the lines: Name Number Line completion Newest station added Length Stations Sokolnicheskaya 1935 2019 44.1 km 26 Zamoskvoretskaya 1938 2018 42.8 km 24 Arbatsko-Pokrovskaya 1938 2012 45.1 km 22 Filyovskaya 1958 2006 14.9 km 13 Koltsevaya 1950 1954 19.4 km 12 Kaluzhsko-Rizhskaya 1958 1990 37.6 km 24 Tagansko-Krasnopresnenskaya 1966 2015 42.2 km 23 Kalininskaya 1979 2014 19.7 km 10 Solntsevskaya 2014 2020 24.9 km 12 Serpukhovsko- Timiryazevskaya 1983 2023 41.5 km 25 Lyublinsko-Dmitrovskaya 1995 2023 28.0 km 17 Bolshaya Koltsevaya Line 2018 2023 ~11 km 6 Butovskaya 2003 2014 10.0 km 7 Monorail 2004 2004 4.2 km 6 Moscow Central Circle 2016 2016 54 km 31 Nekrasovskaya 2019 2020 TBD km 10 Total: Total: Total: Total: 325.4 km 194 == Tickets == There are tickets for a certain number of rides and tickets for a certain time. The moscow metro uses magnetic cards for tickets with a certain number of rides: 1,2,5,10,20 and 60. These tickets were first sold in 1993 as a test. All other tickets are Transport Cards (Smartcards). There are two kinds of smartcards, 'unlimited' and 'social'. Both kinds of cards can be used for 30, 90 or 1 year. Social cards are free for senior citizens and reduced for students. == Interesting Facts == The metro has a gauge of 1520 mm, like most Russian railways. It gets the electricity from a third rail. The metro is run on a voltage of 825V AC. The average distance between stations is 1800 m. The shortest is 300m between the stations Alexandrovskiy Sad and Arbatskaya. The longest distance between stations is 6627 m between Krylatskoe and Strogino. The long distance helps trains travelling faster and more efficient. Most platforms are at least 155 m long. They can take trains which have 8 cars. The only exceptions are some stations on Filyovskaya Line which can only take 6-car trains. These stations are: * Delovoy centr * Studentcheskaya * Kutuzovskaya * Fili * Bagrationovskaya * Filyovskiy Park and Pionerskaya Trains on lines 2, 6, 7 and 9 have eight cars, on lines 3, 8, 10 seven cars and on lines 4, 5 and 11 six cars. Line 12 is different from all other lines. Its platforms are much shorter than the normal platforms. They are only 96 m longs. It has newer trains than the other line. The metro has 214 stations. 71 of them are deep under the ground, 87 are just under the ground. There are also 10 stations above the ground and 3 on bridges. On trains to the city there is a male announcer, on trains from the city there is a female announcer. (The boss calls you to work, the wife calls you home). One of the stations - Vorobievy Gory is situated at the bridge and has a great view at the Moscow river. Also this station is the longest at Moscow. == Metro 2 == Although this has not been officially said, many independent studies say that there is a second, deeper metro system designed for emergency evacuation of important city personnel in case of attack. It is believed that it consists of a single track and connects the Kremlin, chief HQ (Genshtab), Lubyanka (FSB Headquarters) and the Ministry of Defence, as well as numerous other secret installations. There are also entrances to the system from several civilian buildings such as the Russian State Library, Moscow State University (MSU) and at least two stations of the regular metro.[citation needed] It is speculated that these would allow for the evacuation of a small number of randomly chosen civilians, in addition to most of the elite military personnel. The only known junction between the secret system and normal Metro is behind the station Sportivnaya of the Sokolnicheskaya Line. == Statistics == Latest numbers from official site . Passengers 2603.2 million passengers — paid a trip 1958.6 million passengers Average number of passengers per day 7132.1 thousand passengers Revenue from fares 15997.4 million rubles Network length 320.9 km Number of lines 12 Longest line Arbatsko-Pokrovskaya Line (43.7 km) Shortest line Kakhovskaya Line (3.3 km) Longest section Krylatskoe–Strogino (6.625 km) Shortest section Delovoy Tsentr–Mezhdunarodnaya (502 m) Number of stations 192 — transfer stations 61 — transfer points 26 — surface/elevated 15 Deepest station Park Pobedy (84 m) Most shallow underground station Pechatniki Station with the longest platform Vorobyevy Gory (282 m) Number of stations with a single entrance 70 Total number of entrances 273 Number of turnstiles 2545 Number of escalators 681 — including Monorail stations 18 Total length of all escalators 67.4 km Number of depots 15 Total number of train runs per day 10072 Average speed: — commercial 41.57 km/h — technical 48.85 km/h Total number of cars (average per day) 4545 Cars in service (average per day) 3565 Total run of cars 733.6 million car-kilometers — with passengers 699.2 million car-kilometers Average run of cars per day 562.3 car-kilometers Average passengers per car 48 people Longest escalator 126 m (Park Pobedy) Total number of ventilation shafts 406 Number of local ventilation systems in use 5551 Number of medical assistance points 46 Total number of employees 37401 people — males 19936 people — females 17465 people Timetable fulfillment 99.98 % Minimum average interval 90 sec Average passenger trip 13.0 km == Expansion plans == === 2014 === * Spartak * Troparyovo * Kotelniki == Other websites == * Official Website * Metro.ru — Information, history, maps, art",
 "title": "Moscow Metro"
}