{
 "id": "408637",
 "text": "Melville Louis Kossuth (Melvil) Dewey (December 10, 1851 – December 26, 1931) was an American librarian and educator. He invented the Dewey Decimal library classification system. ==Early life== Dewey was born on December 10, 1851, in Adams Center, New York. He attended Alfred University in 1870 and then Amherst College. He earned a bachelor's degree in 1874 and a master's in 1877. ==Career== While still a student, he founded the Library Bureau, a company that sold index-cards and filing-cabinets used in libraries and businesses.Michael Dewe (1968), \"Historical aspects of library supply\". In: Library World Vols 70–72, Grafton (eds), pp. 27–28. He developed his book classification system based on a decimal numbering system while working in the Amherst library. He published a first edition in 1876.Wiegand, W. A. (1998). \"The \"Amherst Method\" : The Origins of the Dewey Decimal Classification Scheme\". In: Libraries & Culture. Vol. 33, No. 2, Spring 1998. He was one of the founders of the American Library Association in 1876 and served for many years as editor of the Journal of the American Library Association. In the 1880's he took a position as librarian at Columbia University Libraries, where he developed one of the first training schools for librarians.Sarah K. Vann. Training for Librarianship Before 1923. Chicago: American Library Association, 1961. p. 28. ==Lake Placid Club== Dewey founded the Lake Placid Club in Lake Placid, New York in 1895 as a health club and retreat. The Winter Olympics were held there, mostly led by his son Godfrey ==Reforms== He advocated for spelling reform for the English language. At one point he changed the spelling of his name from \"Melvile\" to \"Melvil,\" removing redundant letters. He also for a brief time wrote his surname as \"Dui.\" He also founded The Metric Bureau in 1876 to advocate for the United States to move to metric measurement.Hector Vera, \"Melvil Dewey, Metric Apostle\", MetricToday: The U.S. Metric Association Newsletter, vol. 45, no. 4, July–August 2010, pp. 1, 4–6. ==Personal life== Dewey married twice, first to Annie R. Godfrey, and then to Emily McKay Beal. He and his first wife had one child, Godfrey. He moved to Florida and founded Lake Placid, Florida. He died of a stroke there in 1931. ==References== Category:1851 births Category:1931 deaths Category:Columbia University faculty Category:American inventors Category:Librarians",
 "title": "Melvil Dewey"
}