{
 "id": "408799",
 "text": "Elizabeth Egan Gillies (born July 26, 1993 in Haworth, New Jersey) is an American actress, singer, dancer and voice actress. ==Life== Elizabeth Gillies went to Haworth Public School in her home town. After that she went to Northern Valley Regional High School at Demarest in Demarest. She has a younger brother named George. ==Career== Gillies made her Broadway debut at age 15 in the musical 13, playing the character of Lucy. She made her first television appearance in The Black Donnellys (2007), later starring as Jade West in the Nickelodeon series Victorious (2010-2013). From 2011-2014, she provided the voice of Daphne in Nickelodeon's Winx Club, and she had a main role in the FX comedy series Sex & Drugs & Rock & Roll (2015-2016). Since 2017, Gillies has starred as billionaire heiress and energy executive Fallon Carrington in The CW's series Dynasty, a reboot of the 1980s series of the same name. She has also appeared in various feature and television films, including the horror film Animal (2014), the television film Killing Daddy (2014), the comedy film Vacation (2015), and the black comedy thriller film Arizona (2018). ==Filmography== ===Film=== Year Title Role Notes 2008 Harold Evelyn Taylor 2008 Shelby Wexler Direct-to-video film 2011 Eradicator folks Short film 2012 Winx Club: The Secret of the Lost Kingdom Daphne Voice role (English dub) 2014 Animal Mandy 2015 Vacation Heather 2018 Arizona Kelsey 2022 Catwoman: Hunted Catwoman Voice role 2023 Spread Ruby ===Television=== Year Title Role Notes 2007 Young Jenny 3 episodes 2009 Bat Mitzvah Guest Episode: \"Bad Bad News\" 2010–2013 Victorious Jade West Main role 2011 iCarly Jade West Crossover special: \"iParty with Victorious\" 2011 Big Time Rush Heather Fox Episode: \"Big Time Secret\" 2011–2014 Winx Club Daphne Voice role; 24 episodes 2012 White Collar Chloe Woods Episode: \"Upper West Side Story\" 2013 Tracy Cooper Episode: \"Prelude to a Kiss\" 2014 Sam & Cat Jade West Episode: \"#TheKillerTunaJump: #Freddie #Jade #Robbie\" 2014 Killing Daddy Callie Ross Television film 2015–2016 Sex & Drugs & Rock & Roll Gigi Main role 2015 Singer Voice role; episode: \"The Penguin Who Loved Me\" 2015 American Dad! Lena Horne Voice role; episode: \"A Star Is Reborn\" 2017–2022 Dynasty Fallon Carrington / Alexis Carrington (2019) Main role; director, 2 episodes 2018 Robot Chicken Sun Baby, Marie \"Slim\" Browning Voice role; episode: \"Gimme That Chocolate Milk\" 2019 Welcome to the Wayne Parana Sycamore Voice role; episode: \"That's Squidjit Bowling\" 2020 Make It Work! Herself Television special 2022 Family Guy Alana Voice role; episode: \"All About Alana\" 2022 The Orville Dinal Episode: \"Mortality Paradox\" ===Music videos=== Year Title Artist 2010 \"Freak the Freak Out\" Victoria Justice 2011 \"Beggin' on Your Knees\" Victoria Justice 2011 \"All I Want Is Everything\" Victoria Justice 2011 \"Take a Hint\" Victoria Justice and herself 2011 \"Time in the Day\" Mikey Deleasa 2012 \"Time of Our Life\" Big Time Rush 2012 \"Make It in America\" Victoria Justice 2012 \"We Are Believix\" Herself 2012 \"You Don't Know Me\" Herself 2013 \"Right There\" Ariana Grande 2015 \"Die Trying\" Herself 2016 \"Bang Bang\" Herself 2018 \"Thank U, Next\" Ariana Grande 2020 \"Stuck With U\" Ariana Grande featuring Justin Bieber ==References== Category:1993 births Category:Living people Category:Actors from New Jersey Category:Singers from New Jersey Category:American dancers",
 "title": "Elizabeth Gillies"
}