{
 "id": "408881",
 "text": "The Golden Fleece and the Heroes Who Lived Before Achilles is a children's book. It was written by Padraic Colum. Willy Pogany drew the pictures. This book uses English words to tell a lot of stories that were told in the Greek language before. The stories are very old. This book was published in 1921. In 1922, it was made a Newbery Medal Honor Book.\"Newbery Medal and Honor Books, 1922–Present \". American Library Association. Retrieved 2009-12-30. ==Story== This book tells about a young man named Jason who went on an adventure far away from home. He was looking for the Golden Fleece. He took fifty friends with him. His friends were the strongest and bravest people in the world. They were called the Argonauts, because they sailed in a ship called Argo. One of his friends, Orpheus, was the best singer and music maker in the world. In this book, while Jason and his friends look for the Golden Fleece, Orpheus tells them a lot of other stories about places they go and people they meet. Of all the stories in the book, the ones that are not the main story about Jason go in this order: * Jason's mother tells Jason and his fifty friends the story of the Golden Fleece. * Orpheus tells the Argonauts how the world began. * The Argonauts land on an island where only women live. Orpheus tells the women the story of the goddess Demeter and how she lost her daughter Persephone. This story explains why winter happens. * Atalanta, who is one of the Argonauts, tells a story about how another girl named Atalanta was tricked into losing a race. * Castor and Pollux tell the story of Pandora, Epimetheus, and Pandora's box. This story explains why bad things happen. * The Argonauts pass the mountain where Prometheus is chained up. Orpheus tells how Prometheus stole fire from the gods and gave it to human beings. This story teaches people not to want things they should not have. * Orpheus tells the story of how Perseus killed Medusa. Medusa was a kind of monster called a Gorgon. Her hair was made of snakes. She looked so scary that anyone who looked at her was turned into stone. After Jason gets the Golden Fleece, he hears that if he goes home right away his wicked uncle will kill him. So he and his fifty friends go and have other adventures instead. These are those adventures: * They hunt the Calydonian boar, and Atalanta falls in love, but the man she loves is killed before they can get married. * One of the Argonauts, Peleus, marries a sea nymph. He has a son, Achilles. * Theseus, who is another one of the Argonauts, kills a monster called the Minotaur. * Hercules is also one of the Argonauts. He does his well-known labors, which are hard jobs. Hercules also hears a funny story about frogs and mice fighting a big battle. * Orpheus gets married, but his wife dies. Orpheus goes down to the place where dead people stay. He tries to bring his wife back. He does not get her back. Finally it is safe for Jason to go back home. He goes home and lives happily ever after, and teaches younger people to have adventures. ==References== ==Other websites== * The Golden Fleece and the Heroes Who Lived Before Achilles at Project Gutenberg Category:Children's books Category:Newbery Honor books Category:1921 books Category:Irish literature",
 "title": "The Golden Fleece and the Heroes Who Lived Before Achilles"
}