{
 "id": "408845",
 "text": "Shirley Valentine is a 1989 British romantic comedy-movie. It stars Pauline Collins. Tom Conti plays her lover. Bernard Hill plays her husband. Alison Steadman plays her friend. It is about a Liverpool housewife whose family gives her too little attention. She travels to Greece and has an affair with a local man. The screenplay is by Willy Russell. It is based on his 1986 one- character play of the same title. This movie was released in August 1989 in the United States. The reviews for Shirley Valentine were mixed. The movie received several awards and was nominated for some Golden Globe and Academy Awards. ==Main cast == * Pauline Collins as Shirley Valentine-Bradshaw * Tom Conti as Costas Dimitriades * Julia McKenzie as Gillian * Alison Steadman as Jane * Joanna Lumley as Marjorie Majors * Sylvia Syms as Headmistress * Bernard Hill as Joe Bradshaw * George Costigan as Dougie * Anna Keaveney as Jeanette * Tracie Bennett as Millandra Bradshaw * Ken Sharrock as Sydney * Karen Craig as Thelma * Gareth Jefferson as Brian * Gillian Kearney as young Shirley * Catharine Duncan as young Marjorie ==Awards and nominations== * Academy Award for Best Actress (Pauline Collins, nominee) * Academy Award for Best Original Song (nominee) * BAFTA Award for Best Film (nominee) * BAFTA Award for Best Actress in a Leading Role (Pauline Collins, winner) * BAFTA Award for Best Adapted Screenplay (nominee) * Golden Globe Award for Best Motion Picture – Musical or Comedy (nominee) * Golden Globe Award for Best Actress – Motion Picture Musical or Comedy (Pauline Collins, nominee) * Golden Globe Award for Best Original Song (nominee) * British Comedy Award for Top Comedy Film (winner) * Evening Standard British Film Award for Best Actress (Pauline Collins, winner) * Evening Standard British Film Award for Best Adapted Screenplay (winner) * Grammy Award for Best Song Written for a Motion Picture, Television or Other Visual Media (nominee) == Other websites == * Category:1989 comedy-drama movies Category:1989 romantic comedy movies Category:1989 romantic drama movies Category:Adultery in movies Category:American comedy-drama movies Category:American romantic comedy movies Category:American romantic drama movies Category:British comedy-drama movies Category:British romantic comedy movies Category:British romantic drama movies Category:1980s English-language movies Category:Movies set in England Category:Movies set in Greece Category:Movies directed by Lewis Gilbert Category:Movies composed by Marvin Hamlisch Category:Paramount Pictures movies",
 "title": "Shirley Valentine (movie)"
}