{
 "id": "408887",
 "text": "Robert Jack Windham (born November 26, 1942 in Sweetwater, Texas - April 7, 2016) better known by his ring name, Blackjack Mulligan, was a retired American professional wrestler, author and former American football player. ==Career== Before he started his professional wrestling career, Windham played football at Texas Western College, which is now known as the University of Texas at El Paso. He then left UTEP to play the pre-season for the New York Jets of the National Football League. Wahoo McDaniel told Windham to train for professional wrestling and he trained with Verne Gagne. He would later join the American Wrestling Association and moved to the World Wide Wrestling Federation. During his time in the WWWF, Windham became a villain called Blackjack Mulligan. Windham would later team with Jack Lanza which he formed the tag team, The Blackjacks with. He won the NWA American Tag Team Championship, NWA Texas Tag Team Championship, WWA World Tag Team Championship and the WWWF World Tag Team Championship during his time in The Blackjacks. He also wrestled as a singles competitor and once competed for the WWWF Championship against Pedro Morales in Boston. During the match, Morales slashed Windham across his leg and arm with a knife. The wound became infected but Windham recovered. NOTE: It was not Pedro Morales who cut Blackjack that night in the Boston Garden. In reality, it was a crazed fan who sliced his leg open after approaching rigside. The knife had also been dipped in pigfat, adding insult to injury. Mulligan was bleeding severly, and became septic, nearly losing his life. He also teamed with André the Giant and Bill Eadie in the wrestling stable, The Machines. Bobby \"The Brain\" Heenan inducted The Blackjacks into the WWE Hall of Fame in 2006. ==Personal== He is part of the Windham wrestling family and is the father of wrestlers Barry and Kendall Windham, the father-in-law of Mike Rotundo, and the grandfather of Bray Wyatt and Bo Dallas. ==Championships== Windham held many championships during his professional wrestling career: *Championship Wrestling from Florida **NWA Brass Knuckles Championship (Florida version) (one time) **NWA United States Tag Team Championship (Florida version) (one time) - with Dusty Rhodes *European Wrestling Union **EWU World Super Heavyweight Championship (one time) *International Pro Wrestling **IWA World Tag Team Championship (one time) - with Larry Hennig *International Wrestling Federation **IWF Heavyweight Championship (one time) *Mid-Atlantic Championship Wrestling **NWA United States Heavyweight Championship (Mid-Atlantic version) (three times) **NWA World Tag Team Championship (Mid-Atlantic version) (one time) - with Ric Flair *NWA Big Time Wrestling **NWA American Heavyweight Championship (one time) **NWA American Tag Team Championship (one time) - with Blackjack Lanza **NWA Texas Heavyweight Championship (one time) **NWA Texas Tag Team Championship (one time) - with Blackjack Lanza *NWA Western States Sports **NWA International Heavyweight Championship (Amarillo version) (two times) **NWA Western States Tag Team Championship (one time) - with Dick Murdoch *Pro Wrestling Illustrated **He was named the PWI Most Inspirational Wrestler of the Year in 1978. **He was ranked #159 of the 500 best singles wrestlers by PWI during the \"PWI Years\" in 2003. *World Wrestling Association **WWA World Heavyweight Championship (one time) **WWA World Tag Team Championship (one time) - with Blackjack Lanza *World Wide Wrestling Federation/World Wrestling Entertainment **WWE Hall of Fame (Class of 2006) **WWWF World Tag Team Championship (one time) - with Blackjack Lanza ==References== ==Other websites== *Official website *The Blackjacks on WWE.com Category:1942 births Category:2016 deaths Category:American football players Category:American professional wrestlers Category:Former WWE wrestlers Category:New York Jets players Category:Professional wrestling announcers Category:Sportspeople from Texas Category:WWE Hall of Fame",
 "title": "Blackjack Mulligan"
}