{
 "id": "40892",
 "text": "Jessica Simpson (born July 10, 1980) is an American singer and actress. She is known for her reality television show, Nick and Jessica: Newlyweds. In the late 2000s, she was married to Nick Lachey. In 2005, she filed for divorce and she married Eric Johnson. She is the daughter of Tina and Joe Simpson and older sister of singer and actress Ashlee Simpson. She has starred in the movies The Dukes of Hazzard (2005) and Employee of the Month (2006) ==Early life== Jessica Simpson was born in Abilene, Texas. She is the daughter of Tina Ann and Joseph Truett. She has a sister whose name is Ashlee Simpson who is also a singer. At first, Simpson sang at a local church. At age twelve, she auditioned for The Mickey Mouse Club, but was not selected. == Music Career == Simpson began her music career in the late 1990s and has sold over 20 million albums worldwide. From 1999 to 2010, Simpson released five studio albums and three EPs. Her debut album, Sweet Kisses (1999) sold two million copies in the United States and featured hit single \"I Wanna Love You Forever.\" The album earned a double platinum certification from the Recording Industry Association of America (RIAA). In 2001, she explored a more mature sound on her album Irresistible (2001), which recieved gold certification by the RIAA. In July 2001, Simpson began performing as a co-headliner on the Total Request Live Tour for the tour's first fourteen dates, alongside artists such as Destiny's Child and Nelly. On August 7, 2001 Simpson embarked on the DreamChaser Tour, a 15-date tour of North America. Simpson's third studio album, In This Skin (2003), sold over three million copies in the United States. It was released the day that Newlyweds: Nick and Jessica premiered. In This Skin debuted at number ten on the Billboard 200. The second single of the album, \"With You\" was a hit, reaching top twenty on the Billboard Hot 100 and topping the Mainstream Top 40 chart with its radio airplay. In 2004, Simpson appeared in the halftime show the Superbowl XXXVIII. That same year, in March 2004 she recorded new material for a re-release of In This Skin. Following the re- release, the album went on to sell over three million copies. \"Take My Breath Away\" and \"Angels\" were singles from the re-release. Following the release of her first Christmas album, ReJoyce: The Christmas Album (2004) which peaked at number fourteen on the Billboard 200 and was certified gold by the RIAA, Simpson made her feature film debut as Daisy Duke in The Dukes of Hazzard (2005). She recorded a cover of \"These Boots Are Made for Walkin\" for the film's soundtrack, which was a hit single. That same year, she performed \"The Star-Spangled Banner\" at the Indy 500. Simpson's fifth studio album A Public Affair (2006), debuted at number five on the Billboard 200. Simpson later moved to country music with albums like Do You Know (2008), which debuted at No. 1 on Billboard's Top Country Albums, and peaked at No. 4 in Top Album Sales. Following a break from music, she returned with country album Nashville Canyon Part 1 (2025) in March 2025, which her sister Ashlee described as having an \"Americana, rockability, timeless, old-school, classic vibe\" in a their feature piece with The Cut. The emotional EP, not only marks Simpson's return to music but is a raw, emotional and personal look into her life. According to her feature with People Magazine, she wrote the album in Nashville, Tennessee because she felt a special connection to the city. Simpson started working on the album in fall of 2023. She describes her experience writing in Nashville as healing: \"[it's like going straight into therapy\".]The first single from the album \"Use My Heart Against Me\" was released on February 21, 2025. == Personal life == Simpson was married to musician Nick Lachey from 2002 until they divorced in 2006. Simpson began dating NFL tight end Eric Johnson in 2010. The couple has 2 children together—daughter Maxwell Drew Johnson (born May 1, 2012) and son Ace Knute Johnson (born June 30, 2013). ==Albums== * Sweet Kisses - November 9, 1999 * Irresistible - May 29, 2001 * In This Skin - August 19, 2003 * Rejoyce: The Christmas Album - November 23, 2004 * A Public Affair - August 29, 2006 * Do You Know - 2008 * Happy Christmas - 2010 * Nashville Canyon Part 1 - 2025 ==References== ==Other websites== * Jessica Simpson—official website * Category:1980 births Category:Living people Category:Actors from Texas Category:American Baptists Category:American movie actors Category:American pop musicians Category:American television actors Category:Singers from Texas Category:People from Abilene, Texas",
 "title": "Jessica Simpson"
}