{
 "id": "409035",
 "text": "A Mii is a customizable character created by the player, used on Nintendo's video game consoles. Miis made their first appearance on the Wii when it was released. They also appear on the Nintendo 3DS, Wii U and Nintendo Switch consoles, and in some games for the Nintendo DS. Miis allow players to create a caricature of themselves, other people, or of invented characters. They are created in the Mii Channel on the Wii, in the Mii Maker on the 3DS and Wii U, and in system settings on the Nintendo Switch. The Nintendo DS does not have a way to make Miis on the console itself, but the games that use Miis include a Mii Maker to let players create them. The player can change the look of a Mii in many ways. They can give it different hairstyles, eyes, nose, and mouth shapes. They can change the eye and hair color of a Mii. (Players can only choose from a few colors on older consoles, but on the Nintendo Switch, a Mii's eye and hair color can be any color.) They can also give a Mii facial hair and wrinkles. Accessories such as hats and glasses can be added. The player can change the size of things like the Mii's eyes, nose, and mouth. The player can change a Mii's height and weight. On the 3DS and Wii U, the player can take a picture of their face, and the console creates a Mii for them. The player can then change their Mii. When the player makes a Mii, they can use it in many different video games. Some games use Miis for all the characters, such as Wii Sports, Tomodachi Life, and Miitopia. Many other games use Miis with other characters, such as Mario Kart Wii and Super Smash Bros. Ultimate. A lot of games on the Wii and 3DS use Miis as a profile picture, such as Rhythm Heaven Fever and Rhythm Heaven Megamix. == Famous Miis == Miis can be found in many places in modern pop-culture. Here are some examples: Hamburger Mii (also know as \"beef boss\"): The Hamburger Mii, mostly known as \"beef boss\" is a Mii whose original creator is unknown. The Mii resembles the image of a burger by using the wide variety of customization options on the Mii Maker. The Mii was recently popularized by the Youtuber and Twitch Streamer Poofesure, who uses the Mii in most of his game playthroughs. Matt: \"Matt\" is the in-game name of one of the 60 CPU Miis made by Nintendo for their Wii- series games. Matt is found in all of the Wii series games, but is most iconic for his appearance in Wii Sports and Wii Sports Resort as the champion in the sports boxing and sword play, and being particularly difficult to defeat. Matt was also popularized as an internet-meme. ==References== Category:Nintendo video game characters Category:Wii Category:Nintendo 3DS",
 "title": "Mii"
}