{
 "id": "409126",
 "text": "Big Brother 15 is the fifthteenth season of the American reality television show, Big Brother. It began airing on CBS starting on June 26, 2013 on Sundays, Tuesdays and Wednesdays. It will continue to air on CBS until September 18, 2013. It is being called the \"longest season to date\" in Big Brother history, lasting a total of 90 days. This season features sixteen HouseGuests. The show's format remained the same from previous seasons of the show. A group of contestants, known as \"HouseGuests\", compete to win the series by voting each other off. They must be the last HouseGuest remaining. Each week, one HouseGuest, known as the Head of Household, must nominate two of their HouseGuests for eviction. The winner of the Power of Veto can remove one of the nominees from the block. The Head of Household must nominate another HouseGuest as a replacement. The HouseGuests then vote to evict one of them, the nominee with the most votes are removed from the show. When only two HouseGuests remain, the last seven evicted HouseGuests, known as the Jury of Seven, would decide which of them would win the $500,000 prize. A HouseGuest can be expelled from the show for not following rules. There have been several controversial remarks from some of the Big Brother 15 HouseGuests. Their comments have angered viewers and because of this, the show's ratings have dropped. Many journalist have made negative reviews about the HouseGuests who made these remarks. HouseGuest including Aaryn Gries, GinaMarie Zimmerman and Spencer Clawson have made racist comments about two African American contestants on the show. Spencer made negative comments about a gay contestant calling him \"Kermit the Fag\". Aaryn and GinaMarie also made negative comments about Asian contestant Helen. Aaryn and GinaMarie were fired from their jobs because of their comments.\"Union Pacific statement regarding Spencer Clawson's comments on the Big Brother reality television show.\" http://www.uprr.com/newsinfo/2013/spencer_big_brother.shtml . Retrieved 07-06-2013. However, they did not know about this until after the show because they were not allowed to be in contact with anyone outside of the Big Brother house. The show had to even put disclaimers before the episodes started to inform viewers that the comments made by houseguests were not the opinions of CBS. They are ==HouseGuests== Name Age on entry Occupation Residence 22 College student 28 Real estate agent 26 Professor 29 Pediatric speech therapist 25 Lifeguard 27 Nutritionist 32 Pageant coordinator 37 Political consultant 29 Youth counselor 23 Boat shop associate 25 Unemployed 26 Property appraiser 23 Bartender 23 Pizza delivery boy 28 Entrepreneur 31 Railroad conductor === Future appearances === Nick Uhas appeared on season 12 of America's Got Talent. He advanced past the initial audition stage, but was ultimately eliminated before the live shows. In 2019, Uhas became the host of the Netflix reality series Blown Away. Elissa Slater competed on The Amazing Race 31 alongside her sister (and former Big Brother winner) Rachel Reilly. ==Have-Nots== Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Week 7 Week 8 Week 9 Week 10 Week 11 Week 12 Have-Nots Andy, Elissa, Helen, Howard, Judd Andy, Candice, Elissa, Helen Amanda, Jessie, Judd, McCrae None Have/Have Not Phase Finished N/A N/A N/A ==Voting history== Week 1 Week 2 Week 3 Week 4 Week 5 Week 6 Week 7 Week 8 Week 9 Week 10 Week 11 Week 12 Week 13 Eviction votes received Day 43 Day 49 Head of Household McCrae Aaryn Helen Judd Aaryn GinaMarie Aaryn Andy Aaryn Elissa GinaMarie (none) M.V.P. Elissa Elissa Elissa America America America (none) Nominations (pre-veto) Candice David Jessie Elissa Helen Jeremy Aaryn Kaitlin Spencer Aaryn Elissa Kaitlin Amanda Howard Spencer Amanda Candice Jessie Jessie Spencer Jessie Spencer Elissa Helen Aaryn McCrae McCrae Amanda Veto Winner McCrae Jeremy Kaitlin Elissa Spencer Jessie Aaryn Andy Elissa Amanda McCrae (none) Nominations (post-veto) David Elissa Jessie Elissa Helen Nick Aaryn Jeremy Spencer Aaryn GinaMarie Kaitlin Amanda Candice Howard Amanda Candice Spencer Judd Spencer Jessie Spencer Helen Spencer Aaryn Andy Spencer Amanda Andy David Nick Jeremy Kaitlin Howard Candice Judd Head of Household Helen Nominated GinaMarie Elissa Elissa Jeremy Nominated Howard Head of Household Judd Jessie Helen Aaryn Tiebreak(Amanda) 0 Spencer David Nick Nominated Kaitlin Candice Nominated Nominated Nominated Nominated Aaryn Nominanted Jury Member 2 McCrae Head of Household Nick Jeremy Kaitlin Howard Candice Judd Jessie Helen Aaryn Jury Member Judd David Nick Jeremy Head of Household Howard Candice Nominated Evicted (Day 49) Aaryn Jury Member 7 Elissa Nominated Nominated Jeremy Kaitlin Howard Candice Judd Jessie Spencer Head of Household Jury Member 9 Amanda David Nick Jeremy Kaitlin Nominated Nominated Judd Jessie Helen Aaryn Nominated Jury Member 0 Aaryn Elissa Head of Household Nominated Nominated Head of Household Candice Head of Household Jessie Head of Household Nominated Evicted (Day 70) Evicted (Day 70) Evicted (Day 70) Evicted (Day 70) Jury Member 4 Helen David Nominated Head of Household Kaitlin Howard Candice Judd Jessie Nominated Evicted (Day 63) Evicted (Day 63) Evicted (Day 63) Evicted (Day 63) Evicted (Day 63) Jury Member 4 Jessie Nominated Nick Jeremy Kaitlin Howard Candice Judd Nominated Evicted (Day 56) Jury Member 6 Candice Elissa Nick Jeremy Kaitlin Nominated Nominated Evicted (Day 49) Jury Member 7 Howard David Elissa Jeremy Kaitlin Nominated Evicted (Day 42) 7 Kaitlin Elissa Elissa Spencer Nominated Evicted (Day 35) 9 Jeremy Elissa Elissa Nominated Evicted (Day 28) 9 Nick David Nominated Evicted (Day 21) 7 David Nominated Evicted (Day 13) 7 Notes 1 2 2, 3 3, 4 none 5 Evicted David 7 of 12 votes to evict Nick 7 of 11 votes to evict Jeremy 9 of 10 votes to evict Kaitlin 9 of 9 votes to evict Howard 7 of 8 votes to evict Candice 7 of 7 votes to evict Judd 7 of 7 votes to evict Jessie 6 of 6 votes to evict Helen 4 of 5 votes to evict Judd Won re-entry into game Aaryn 4 of 4 votes to evict ===Notes=== *: For the first three weeks, viewers voted for which HouseGuest they believed to be playing the best game. This HouseGuest is named the Most Valuable Player, or M.V.P., and has the power to nominate one HouseGuest for eviction. This nomination is made privately and the HouseGuest is not obligated to reveal their identity. If the veto is used to save the M.V.P.-nominated HouseGuest, the M.V.P. also privately nominates the replacement. Their nominations are shown in bold. *: For weeks four through six, America was given the M.V.P. power. The HouseGuest with the most viewer votes, other than the HoH and their two nominees, became the third nominee. If the veto is used to take the original M.V.P. nominee off the block, then the next eligible HouseGuest with the highest amount of viewer votes will be nominated in their place. The nominations are shown in bold. *: Week 6 was a double eviction week. Following the first eviction, the remaining HouseGuests played a week's worth of game – including HoH and Veto competitions, and Nomination, Veto, and Eviction ceremonies – during the remainder of the live show, culminating in a second eviction for the week. *: After the normal Week 6 eviction, the M.V.P. power was removed from the game. All nominations after Week 6, including that week's second eviction, only have two HouseGuests nominated for eviction. *: During the Head of Household competition in Week 9, the first four jurors were allowed to compete for an opportunity to come back into the game. The juror who lasted the longest would return to the game to win and was eligible to become Head of Household if that juror finished first amongst the other HouseGuests in the competition. == Show ratings == # Air Date United States Source Households (rating/share) 18–49 (rating/share) Viewers (millions) Rank (timeslot) Rank (night) 1 Wednesday, June 26 3.9/7 2.2/8 6.51 1 1 2 Sunday, June 30 3.5/6 1.9/6 5.81 1 1 3 Tuesday, July 2 3.6/6 1.9/6 5.64 2 3 4 Wednesday, July 3 1.6/7 5.42 1 1 5 Sunday, July 7 3.8/7 2.1/7 6.24 1 1 6 Wednesday, July 10 3.7/7 2.0/7 5.85 2 3 7 Thursday, July 11 4.0/7 2.1/7 6.18 1 1 81 Sunday, July 14 2.1/3 6.27 1 1 9 Wednesday, July 17 3.9/7 2.2/8 6.44 1 2 (Tie) 10 Thursday, July 18 4.2/7 2.4/7 6.70 1 1 11 Sunday, July 21 4.1/7 2.5/8 6.91 1 1 12 Wednesday, July 24 2.3/8 6.44 1 3 13 Thursday, July 25 4.2/7 2.5/8 6.90 1 1 / 14 Sunday, July 28 4.1/7 2.3/7 6.81 1 1 // 15 Wednesday, July 31 2.1/7 6.25 2 3 16 Thursday, August 1 4.4/7 2.5/8 7.12 1 1 http://blog.zap2it.com/frominsidethebox/2013/08/tv-ratings-big-brother-hits- season-high-in-viewers-thursday.html ? 17 Sunday, August 4 4.1/7 2.3/7 6.79 2 2 18 Wednesday, August 7 2.2/8 6.43 1 2 192 Thursday, August 8 2.4/7 7.10 1 1 203 Sunday, August 11 2.4/8 7.14 1 1 21 Wednesday, August 14 2.0/7 6.17 1 3 22 Thursday, August 15 2.2/7 6.90 1 1 23 Sunday, August 18 2.1/6 6.48 1 1 24 Wednesday, August 21 25 Thursday, August 22 26 Sunday, August 25 27 Wednesday , August 28 28 Thursday, August 29 *: Episode 8 was delayed by 20 minutes due to live golf coverage. *: Episode 19 was delayed by up to an hour on the West Coast due to live football coverage. *: Episode 20 was delayed by 8 minutes ET/CT due to live golf coverage. == References == == Other websites == *CBS Official Site *Global TV Official Site *Official Casting Website Category:2013 in American television Category:2013 television seasons Category:Big Brother seasons Category:American television seasons",
 "title": "Big Brother 15 (American season)"
}