{
 "id": "409128",
 "text": "José Alberto \"Pepe\" Mujica Cordano (20 May 1935 - 13 May 2025) was an Uruguayan politician. He served as President of Uruguay from 2010 to 2015. He won the 2009 presidential election and took office as President on 1 March 2010. He has been called \"the world's 'poorest' president\" because he donates around 90 percent of his $12,000 monthly salary to charities to help poor people and small entrepreneurs. ==Senate career== In the 1994 general elections, Mujica was elected deputy and in the elections of 1999 he was elected senator. In 1994 Mujica was chosen to be a deputy and then in 1999 he was chosen to be senator in the [general election] of Uruguay in that year. In 2004, Mujica's political party was very popular because of his charisma and simple living. In 2004 there were more elections and Mujica was chosen to be a senator again, this helped his political party and Tabaré Vázquez to be president. ==Minister of Livestock== On March 1, 2005, President Tabaré Vázquez made Mujica as the Minister of Livestock, Agriculture and Fisheries (Mujica's own professional background was in the agricultural sector). Since becoming minister, Mujica resigned his position as senator. He held this position until a cabinet change in 2008, when he resigned and was replaced by Ernesto Agazzi. Mujica then returned to his seat in the Senate. ==Personal life== Mujica was born on 20 May 1935 in Montevideo, Uruguay. His parents were Demetrio Mujica, of Spanish Basque ancestry,Mujica paseará por Muxika, la tierra de sus antepasados , Diario La RepúblicaMujica recibió las llaves de la ciudad de Muxika , Diario La República and Lucy Cordano, of Italian descent. In 2005, Mujica married senator Lucía Topolansky. In April 2024, Mujica announced that he was diagnosed with esophageal cancer. He died at 89 on 13 May 2025 at his farmhouse in Rincón del Cerro, Uruguay from the disease. ==References== ==Other websites== * Biography by CIDOB Foundation * Uruguay's President-Elect: Che Guevara’s Spiritual Heir by The Daily Maverick Category:1935 births Category:2025 deaths Category:Deaths from esophageal cancer Category:Presidents of Uruguay Category:South American philanthropists Category:Politicians from Montevideo",
 "title": "José Mujica"
}