{
 "id": "409120",
 "text": "This article lists video games that were released in the year 2013. These includes, Batman: Arkham, Army of Two, BioShock, Call of Duty: Ghosts, Company of Heroes, Crysis, Dead Space, Devil May Cry, Final Fantasy, Fire Emblem, God of War, Dead Island, Grand Theft Auto, Killzone, Lost Planet, Pokémon, Sly Cooper, StarCraft, Tomb Raider and Total War. Also in 2013, PlayStation 4 from Sony Computer Entertainment and the Xbox One from Microsoft were released. ==Events== Days Event February 20–22 Sony's eighth generation console PlayStation 4 (PS4) reveal held at New York City, New York. March 22 – 24 PAX East 2013 held at the Boston Convention and Exhibition Center. March 23–25 Midwest Gaming Classic held at the Sheraton Milwaukee Brookfield Hotel in Brookfield, Wisconsin. March 25 – 29 Game Developers Conference 2013 held in San Francisco, California. May 21–23 Microsoft's eighth generation console Xbox One reveal held at Microsoft Redmond Campus, Washington. June 11 – 13 E3 2013 was held at the Los Angeles Convention Center. June 22 – 23 Rezzed 2013 is held at the NEC Birmingham. July 18 - 21 SDCC 2013 is held at the San Diego Convention Center. July 19 – 22 PAX Australia 2013 is held at the Melbourne Showgrounds. August 1 – 4 QuakeCon 2013: The massive annual LAN party held in Dallas, Texas. August 22 – 25 GamesCom 2013 is held in Cologne, Germany. August 30 – September 2 PAX Prime 2013 held at the Washington State Convention Center in Seattle. September 19 – 22 Tokyo Game Show 2013 at the Makuhari Messe in Tokyo. September 26 – 29 Eurogamer Expo 2013 held in Earls Court, London. October 3–6 Indiecade festival held in Culver City, California. October 4 – 7 EB Games Expo 2013 held at the Sydney Showground in Sydney Olympic Park, New South Wales. ==Console releases== The list of game consoles to be released in 2013 in North America. Month Day Console June 25 Ouya July 31 Nvidia Shield November 15 PlayStation 4 November 22 Xbox One ==Game releases== The list of games released, or due for release, in 2013 in North America. ===January–March=== Month Day Title Platform(s) J A N U A R Y 2 Retro City Rampage XBLA 3 Unchained Blades 3DS 8 Anarchy Reigns PS3, X360 Earth Defense Force 2017 PSVita 10 Fieldrunners 2 Win 15 Corpse Party: Book of Shadows PSP DmC: Devil May Cry PS3, X360 17 Temple Run 2 iOS 19 Super Hexagon Droid 22 The Cave PSN, WiiU Mad Dog McCree PSN Ni no Kuni: Wrath of the White Witch PS3 23 The Cave XBLA Strike Suit Zero Win 24 The Cave Win, Mac Might & Magic: Clash of Heroes iOS Temple Run 2 Droid 25 Ace Combat: Assault Horizon Win DmC: Devil May Cry Win 29 Dungeonland Win Hitman: HD Trilogy PS3, X360 30 Skulls of the Shogun XBLA, Win Wizardry Online Win 31 Antichamber Win Little Inferno iOS Sonic & All-Stars Racing Transformed Win F E B R U A R Y 4 Fire Emblem Awakening 3DS 5 Dead Space 3 Win, PS3, X360 Fist of the North Star: Ken's Rage 2 PS3, X360 Sly Cooper: Thieves in Time PS3, PSVita 7 After Burner Climax iOS Fist of the North Star: Ken's Rage 2 WiiU 8 We Sing 80s Wii 10 Brain Age: Concentration Training 3DS 12 Alien Breed PSN, PSVita Aliens: Colonial Marines Win, PS3, X360 Pro Evolution Soccer 2013 3DS Sonic & All- Stars Racing Transformed 3DS 14 Impire Win 19 Crysis 3 Win, X360, PS3 March of the Eagles Win Metal Gear Rising: Revengeance PS3, X360 22 Baldur's Gate: Enhanced Edition Mac 25 Krater Mac 26 Brütal Legend Win Dynasty Warriors 7: Empires PSN Etrian Odyssey IV: Legends of the Titan 3DS Ninja Gaiden Sigma 2 Plus PSVita Runner 2 WiiU, Win, Mac, Lin 27 Runner 2 XBLA Super Hexagon Lin 28 Retro City Rampage WiiWare M A R C H 5 The Amazing Spider-Man WiiU Atelier Ayesha: The Alchemist of Dusk PS3 Castlevania: Lords of Shadow – Mirror of Fate 3DS Major League Baseball 2K13 PS3, X360 MLB 13: The Show PS3, PSVita Naruto Shippuden: Ultimate Ninja Storm 3 X360, PS3 Runner 2 PSN The Sims 3: University Life Win, Mac SimCity Win Tomb Raider Win, PS3, X360 7 Liberation Maiden iOS Rayman Jungle Run Win Sonic Dash iOS 12 Darkstalkers Resurrection PSN God of War: Ascension PS3 Sniper: Ghost Warrior 2 PS3, X360, Win StarCraft II: Heart of the Swarm Win, Mac 13 Darkstalkers Resurrection XBLA 14 A World of Keflings Win Chaos Rings II Droid Slam Bolt Scrappers Win 18 Lego City Undercover WiiU 19 The Croods: Prehistoric Party! WiiU, Wii, 3DS, NDS Gears of War: Judgment X360 Hotline Miami Mac Monster Hunter 3 Ultimate WiiU, 3DS Need for Speed: Most Wanted WiiU The Walking Dead: Survival Instinct PS3, X360, Win, Wii U 20 Giana Sisters: Twisted Dreams XBLA Retro/Grade Win Shoot Many Robots Droid 21 Hyperdimension Neptunia Victory PS3 Trials Evolution: Gold Edition Win Zen Pinball 2 WiiU 22 Dead or Alive 5 Plus PSVita Resident Evil 6 Win 24 Luigi's Mansion: Dark Moon 3DS Pokémon Mystery Dungeon: Gates to Infinity 3DS 26 Army of Two: The Devil's Cartel PS3, X360 BioShock Infinite PS3, X360, Win Final Fantasy XI: Seekers of Adoulin Win, X360 Machinarium PSVita Slender: The Arrival Win Terraria PSN Tiger Woods PGA Tour 14 PS3, X360 27 Terraria XBLA 28 Final Fantasy V iOS HarmoKnight 3DS Ms. Splosion Man iOS Race Driver: Grid Mac Tactical Intervention Win ===April–June=== Month Day Title Platform(s) A P R I L 2 Cities in Motion 2 Win, Mac Defiance Win, PS3, X360 Duke Nukem II iOS Grand Theft Auto: Liberty City Stories PSN Grand Theft Auto: Vice City Stories PSN Ninja Gaiden 3: Razor's Edge PS3, X360 3 BattleBlock Theater XBLA Injustice: Gods Among Us iOS Ms. Splosion Man Win 4 Sonic & Sega All-Stars Racing Mac Toki Tori 2 WiiU 5 Double Dragon II: Wander of the Dragons XBLA Red Orchestra: Ostfront 41-45 Mac 9 Age of Empires II: HD Edition Win Guacamelee! PSN, PSVita Worms 2: Armageddon Droid 10 Age of Wushu Win ShootMania Storm Win 11 Gemini Rue iOS 14 Star Wars: The Old Republic - Rise of the Hutt Cartel Win 15 Little Inferno Mac 16 Darkfall Unholy Wars Win Injustice: Gods Among Us WiiU, PS3, X360 Pandora's Tower Wii Shin Megami Tensei: Devil Summoner: Soul Hackers 3DS 17 Sacred Citadel Win, PSN, XBLA 18 Papo & Yo Win 19 God Mode Win, XBLA We Sing UK Hits Wii 21 Lego City Undercover: The Chase Begins 3DS 23 Black Rock Shooter: The Game PSP Dead Island: Riptide Win, PS3, X360 Don't Starve Win Dragon's Dogma: Dark Arisen PS3, X360 God Mode PSN Guilty Gear XX: Λ Core Plus R PSVita Star Trek Win, PS3, X360 Thomas Was Alone PS3, PSVita 24 Dyad Win Fieldrunners 2 Droid Monaco: What's Yours is Mine Win Sturmwind DC Poker Night 2 XBLA 25 Mega Man 4 3DS XCOM: Enemy Unknown Mac 26 Mars: War Logs Win Poker Night 2 Win, Mac 29 Stealth Bastard Deluxe Mac, Lin 30 Deadly Premonition: Director's Cut PS3 Far Cry 3: Blood Dragon PSN Katamari Damacy PSN Poker Night 2 PSN Soul Sacrifice PSVita Thomas Was Alone PSN, PSVita Zeno Clash II Win M A Y 1 Far Cry 3: Blood Dragon Win, XBLA Fez Win 2 Might & Magic Heroes VI: Shades of Darkness Win Zoombies: Animales de la Muerte iOS 7 Fatal Frame II: Crimson Butterfly PSN 8 Crash Course 2 XBLA 9 Mario and Donkey Kong: Minis on the Move 3DS 10 Carmageddon Droid Monaco: What's Yours is Mine XBLA 14 Dust 514 PS3 Manhunt PSN Metro: Last Light Win, PS3, X360 16 Mega Man 5 3DS Sonic the Hedgehog iOS, Droid The Starship Damrey 3DS 17 Dragon's Lair Win, Mac 21 Fast & Furious: Showdown Win, PS3, X360, WiiU, 3DS Lego Batman 2: DC Super Heroes WiiU Ratchet & Clank: Full Frontal Assault PSVita Resident Evil: Revelations Win, PS3, X360, WiiU 22 Call of Juarez: Gunslinger Win, PSN, XBLA The Incredible Adventures of Van Helsing Win, XBLA 23 Poker Night 2 iOS 24 Donkey Kong Country Returns 3D 3DS Dust: An Elysian Tail Win Sniper Elite V2 WiiU 28 Fuse PS3, X360 Grid 2 Win, PS3, X360 30 Mega Man X WiiU The Legend of Zelda: Oracle of Seasons and Oracle of Ages 3DS J U N E 3 Final Fantasy IV Droid 4 Class of Heroes 2 PSP, PSVita Eve Online: Odyssey Win Limbo PSVita Marvel Heroes Win, Mac Remember Me Win, PS3, X360 The Elder Scrolls V Skyrim: Legendary Edition Win, PS3, X360 5 State of Decay XBLA 9 Animal Crossing: New Leaf 3DS 12 Zeno Clash II XBLA 13 Rugby Challenge 2 Win, PS3, X360 14 The Last of Us PS3 18 Dungeons & Dragons: Chronicles of Mystara XBLA, PSN, Win, WiiU Epic Mickey 2: The Power of Two PSVita 20 Drakerider Droid Max Payne 3 Mac Neverwinter Win New Super Luigi U Wii U XCOM: Enemy Unknown iOS 23 Game & Wario WiiU 24 Joe Danger Win Joe Danger 2: The Movie Win 25 Company of Heroes 2 Win Deadpool Win, PS3, X360 Hotline Miami PSN, PSVita Muramasa Rebirth PSVita Project X Zone 3DS Ride to Hell: Retribution Win, PS3, X360 The Sims 3: Island Paradise Win, Mac 26 Batman: Arkham City Lockdown Droid 27 Layton Brothers: Mystery Room iOS Leisure Suit Larry: Reloaded Win, Mac Might & Magic: Clash of Heroes Droid Samurai Shodown II iOS, Droid ===July–September=== Month Day Title Platform(s) J U L Y 3 Limbo iOS Monaco: What's Yours is Mine Mac Mortal Kombat Win Napoleon: Total War Mac 4 Dark Win 8 Sonic the Hedgehog 4: Episode I Ouya Sonic the Hedgehog 4: Episode II Ouya 9 Civilization V: Brave New World Win, Mac Dark X360 Dota 2 Win Metal Gear Solid: The Legacy Collection PS3 NCAA Football 14 PS3, X360 10 Crazy Taxi Droid 11 Deus Ex: The Fall iOS Toki Tori 2+ Win, Mac 16 Dynasty Warriors 8 PS3, X360 Shin Megami Tensei IV 3DS Time and Eternity PS3 Turbo: Super Stunt Squad WiiU, Wii, PS3, X360, 3DS, NDS 23 Stealth Inc. - A Clone in the Dark PSN, PSVita The Smurfs 2 WiiU, Wii, PS3, X360, 3DS, NDS 25 TurtleStrike iOS, Droid 26 Shadowrun Returns Win, Mac, iOS, Droid 31 Rise of the Triad Win TBA Ashes Cricket 2013 Win, PS3, X360, WiiU, Wii Sir, You Are Being Hunted Win, Mac, Lin Sonic the Hedgehog CD Ouya A U G U S T 4 Pikmin 3 WiiU 6 Disney's Planes WiiU, Wii, 3DS, NDS Dragon's Crown PS3, PSVita Tales of Xillia PS3 11 Mario & Luigi: Dream Team 3DS 13 Angry Birds Trilogy Wii, WiiU DuckTales Remastered PSN, WiiU, Win Europa Universalis IV Win, Mac, Lin 15 Payday 2 Win, PS3, X360 18 Disney Infinity WiiU, Wii, PS3, X360, Win, 3DS 20 Saints Row IV Win, PS3, X360 The Bureau: XCOM Declassified Win, PS3, X360 Tom Clancy's Splinter Cell: Blacklist Win, PS3, X360, WiiU 22 Skullgirls Win 27 Castlevania: Lords of Shadow Win Final Fantasy XIV: A Realm Reborn Win, PS3 Hatsune Miku: Project DIVA F PS3 Killer is Dead PS3, X360 Lost Planet 3 Win, PS3, X360 Madden NFL 25 PS3, X360 30 Painkiller: Hell & Damnation PS3, X360 War for the Overworld Win, Mac, Lin TBA Brothers: A Tale of Two Sons Win, PSN, XBLA SimCity Mac S E P T E M B E R 3 Diablo III PS3, X360 Rayman Legends PS3, WiiU, X360 Total War: Rome II Win 10 Killzone: Mercenary PSVita Kingdom Hearts HD 1.5 Remix PS3 NHL 14 PS3, X360 Puppeteer PS3 Young Justice: Legacy PS3, X360, WiiU, Win, 3DS 11 DuckTales Remastered XBLA 15 The Wonderful 101 WiiU 17 Grand Theft Auto V PS3, X360 MechWarrior Online Win 18 Broken Sword: The Serpent's Curse Win, Mac, Lin, iOS 20 Pro Evolution Soccer 2014 Win, PS3, X360, PSP 24 FIFA 14 Win, X360, PS3, Wii, PS2, PSVita, PSP, 3DS 27 Alien Rage Win, PSN, XBLA Deadfall Adventures Win, X360 TBA Might & Magic X: Legacy Win ===October–December=== Month Day Title Platform(s) O C T O B E R 1 NBA 2K14 PS3, X360'' 8 Beyond: Two Souls PS3 Disgaea D2: A Brighter Darkness PS3 Just Dance 2014 Wii, WiiU, X360, PS3 13 Pokémon X and Y 3DS 20 Skylanders: Swap Force Wii, WiiU, X360, PS3 16 Zumba Fitness: World Party Wii, WiiU, X360 22 Tearaway PSVita 25 Batman: Arkham Origins Win, PS3, X360, WiiU 29 Assassin's Creed IV: Black Flag Win, PS3, X360, WiiU Battlefield 4 Win, X360, XBO, PS3, PS4 WWE 2K14 PS3, X360 TBA The Legend of Zelda: The Wind Waker HD WiiU Wii Party U WiiU N O V E M B E R 5 Call of Duty: Ghosts Win, X360, XBO, PS3, PS4, WiiU 19 Need for Speed: Rivals Win, PS3, PS4, X360, XBO Watch Dogs Win, WiiU, X360, XBO, PS3, PS4 TBA Donkey Kong Country: Tropical Freeze WiiU Mario Party 3DS The Legend of Zelda: A Link Between Worlds 3DS Wasteland 2 Win, Mac, Lin D E C E M B E R 3 Dead State Win TBA Planetary Annihilation Win Super Mario 3D World WiiU Wii Fit U WiiU ===Unscheduled releases=== Below is a list of games which have been announced to be released in 2013 in North America, but have no exact release date or month yet. Title Approximate Date Platforms Genre References Amnesia: A Machine for Pigs Summer Win, Mac, Lin Survival horror Among the Sleep Q4 Win, Mac Survival horror ARMA 3 Q3 Win Open world, Tactical shooter Big Ant Cricket Win, X360, PS3 Sports/Cricket Carmageddon: Reincarnation Q3/Q4 Win, Mac, Lin Vehicular combat, racing Castle of Illusion Starring Mickey Mouse HD Remake Q3 Win, PSN, XBLA Platform Castlevania: Lords of Shadow 2 Q4 Win, X360, PS3 Action-adventure Command & Conquer Win Real-time strategy The Dark Eye: Demonicon Early 2013 Win, PS3, X360 RPG Dementium II Q3 Win Survival horror, first-person shooter Devil's Third Win, X360, PS3 Third-person shooter Edge of Twilight Win, X360, PS3 Action-adventure FIFA Manager 14 Q3/Q4 Win Sports, simulation Fortnite Win Survival horror Forza Motorsport 5 Q4 XBO Racing God Eater 2 PSVita, PSP Action RPG Gran Turismo 6 Q4 PS3 Racing Hellraid Win, X360, PS3 Action Invizimals: The Alliance PSVita Action Invizimals: The Lost Kingdom PS3 Action-adventure Jane Jensen's Moebius Win Adventure Killzone: Shadow Fall Q4 PS4 First-person shooter Kinetic Void Win, Mac, Lin Space trading and combat simulator Lego Marvel Super Heroes Q3/Q4 3DS, NDS, PS3, PSVita, Win, WiiU, X360 Action-adventure Mario & Sonic at the Sochi 2014 Olympic Winter Games Q4 WiiU, 3DS Sports Mario Golf: World Tour Q3 3DS Sports Mars: War Logs PSN, XBLA Action RPG Medieval Mayor Win City- building Metal Gear Solid V: The Phantom Pain PS3, PS4, X360, XBO Stealth, third-person shooter Modern Combat 5 iOS, Droid One Piece: Pirate Warriors 2 Q3/Q4 PS3 Action Ong Bak: Tri Win, PSN, XBLA Action RPG Outlast Q3 Win Survival horror Pac-Man and the Ghostly Adventures Q3 Win, PS3, X360, WiiU, 3DS Platform Path of Exile Win Action RPG Phantasy Star Online 2 Early 2013 Win MMORPG Phoenix Wright: Ace Attorney - Dual Destinies Q3/Q4 3DS Adventure, visual novel Pro Evolution Soccer 2014 Win, PS3, WiiU, X360, PSP, PSVita, 3DS Sports Rain PS3 Adventure Ratchet & Clank: Into the Nexus Q4 PlayStation 3 Platform Raven's Cry Q3 Win, PS3, X360 Action-adventure, role-playing Rambo: The Video Game Win, PS3, X360 Action-adventure RollerCoaster Tycoon Q3 iOS, Droid Construction and management simulation Sacred 3 Win, PS3, X360 Action role-playing Scribblenauts Unmasked: A DC Comics Adventure Q3/Q4 3DS, WiiU, Win Puzzle, action Shantae and the Pirate's Curse 3DS Platform Shovel Knight Win, WiiU, 3DS Platform Smite Win Multiplayer online battle arena Sonic Lost World Q3/Q4 WiiU, 3DS Action-adventure, Platformer South Park: The Stick of Truth Q4 Win, PS3, X360 RPG Spelunky Q3 PSN, PSVita Action-adventure, platform Starbound Win, Mac, Lin Sandbox, Action-adventure, platform State of Decay Win Survival horror Survarium Q4 Win MMOFPS Teenage Mutant Ninja Turtles: Out of the Shadows Q3 PSN, XBLA, Win Action-adventure Terraria Q3 PSVita Action- adventure The Banner Saga Win, Mac, Lin, iOS Tactical role-playing The Guided Fate Paradox Q3/Q4 PS3 Tactical role-playing The Walking Dead Season Two Q3 TBA Adventure The Wolf Among Us Q3 Win, Mac, PSN, XBLA Adventure Until Dawn PS3 Survival horror Wolfenstein: The New Order Q4 Win, PS3, PS4, X360, XBO First-person shooter X Rebirth Win Space trading and combat simulator Yarn Yoshi Q4 WiiU Platform Zoombies: Animales de la Muerte Droid Shooter ==References== *",
 "title": "2013 in video games"
}