{
 "id": "409207",
 "text": "A chemical nomenclature is a set of rules for creating a system of names (\"nomenclature\") for chemicals. This is done so that everyone uses the same name for a chemical. The system used most often around the world today is the one created and developed by the International Union of Pure and Applied Chemistry (IUPAC). The IUPAC's rules for naming chemical compounds are written in a series of books. The system for naming organic compounds is written in the Blue Book.. . . The system for naming inorganic compounds is written in the Red Book.International Union of Pure and Applied Chemistry (2005). Nomenclature of Inorganic Chemistry (IUPAC Recommendations 2005). Cambridge (UK): RSC–IUPAC. . Electronic version (PDF). A third book, called the Green Book,International Union of Pure and Applied Chemistry (1993). Quantities, Units and Symbols in Physical Chemistry, 2nd edition, Oxford: Blackwell Science. . Electronic version (PDF). gives recommendations about the use of symbols for physical quantities. A fourth book, the Gold Book,Compendium of Chemical Terminology, IMPACT Recommendations, 2nd ed., Oxford: Blackwell Scientific Publications. (1997) contains the definitions of many of the technical terms used in chemistry. Similar books exist for biochemistry,Biochemical Nomenclature and Related Documents, London: Portland Press (1992). analytical chemistry,International Union of Pure and Applied Chemistry (1998). Compendium of Analytical Nomenclature (definitive rules 1997, 3rd. ed.). Oxford: Blackwell Science. . macromolecular chemistry,Compendium of Macromolecular Nomenclature, Oxford: Blackwell Scientific Publications (1991). and clinical chemistry.. The books do not cover everything, however. Shorter recommendations for specific circumstances are published sometimes in the journal Pure and Applied Chemistry. == References == == Other websites == * Interactive IUPAC Compendium of Chemical Terminology (interactive \"Gold Book\") * IUPAC Nomenclature Books Series (list of all IUPAC nomenclature books, and means of accessing them) * IUPAC Compendium of Chemical Terminology (\"Gold Book\")",
 "title": "Chemical nomenclature"
}