{
 "id": "409494",
 "text": "The Anglo-Dutch Wars ( or ) were a series of wars fought between the Dutch Republic and the Kingdom of England and later the United Kingdom of Great Britain during the 17th and 18th centuries. They fought for control over trade routes on the seas. All of the wars were mostly fought by naval warfare. The First War (1652–1654) took place during the Interregnum in England, the period after the English Civil War when England did not have a king or a queen. The war was fought between the navies of England and the Dutch Republic (also known as the United Provinces). It mainly took place in the English Channel and the North Sea. It ended with the Royal Navy of England gaining control of those seas and a monopoly over trade with the English colonies.Rickard, J. (11 December 2000), First Anglo-Dutch War (1652-1654), History of War. The Second (1665–1667) and the Third (1672–1674) Wars happened after the English Restoration of the monarchy. England tried to end the Dutch monopoly over world trade. Most of the fighting in both wars was done in the North Sea. In the Third War, England fought alongside France. Both wars ended in strong victories for the Dutch and confirmed their position as the leading maritime power of the 17th century. The English took New Netherland, and the Dutch let them keep it in return for Suriname. The Fourth War (1780–1784) took place after the Acts of Union 1707 in Great Britain and involved the Dutch Republic and Great Britain. The main cause was that Britain disagreed with the Dutch trading with the United States during the American Revolutionary War. The war ended with the Treaty of Paris (1784) and ended with a very big defeat for the Dutch, who lost parts of the Dutch Empire. ==Related pages== * Glorious Revolution * History of England *History of the United Kingdom * British East India Company * Dutch East India Company * Anglo-Manipur War ==References== ==More reading== * D. R. Hainsworth, et al. (1998) The Anglo-Dutch Naval Wars 1652-1674 * James Rees Jones (1996) The Anglo-Dutch wars of the seventeenth century * Angus Konstam and Tony Bryan (2011) Warships of the Anglo-Dutch Wars 1652-74 ==Other websites== * . *National Maritime Museum , London. *Dutch Admiral Michiel de Ruyters' flagship 'The Seven Provinces' is being rebuilt in the Dutch town of Lelystad. * . Category:17th century in Europe Category:18th century in Europe Category:History of the Netherlands Category:Wars involving the United Kingdom Category:18th-century conflicts",
 "title": "Anglo-Dutch Wars"
}