{
 "id": "409448",
 "text": "Minions is a 2015 American computer-animated comedy movie and a spin- off/prequel to the 2010 animated movie Despicable Me and the 2013 animated movie - and sequel to Despicable Me - Despicable Me 2. It was released on July 11, 2015. The movie stars Sandra Bullock and Jon Hamm and is narrated by Geoffrey Rush. A sequel Minions: The Rise of Gru, was released in 2022. == Cast == * Pierre Coffin as the yellow, small Minions, including: **Kevin, The leader of the trio of Minions who set out to find a boss. **Stuart, a musician, and the slacker of the three. **Bob, the youngest and smallest of the group. * Sandra Bullock as Scarlet Overkill, the world's first female supervillain and Herb's wife. * Jon Hamm as Herb Overkill, a genius inventor and Scarlet's husband. * Michael Keaton as Walter Nelson, Madge's thief husband and Tina, Walter Jr. and Binky's father. * Allison Janney as Madge Nelson, Walter's thief wife and Tina, Walter Jr. and Binky's mother. * Steve Coogan as the aged, blind Tower Guard. **Coogan also voices Professor Flux, a scientist. * Jennifer Saunders as Queen Elizabeth II. * Geoffrey Rush as the narrator. * Steve Carell as young Gru, the Minions' boss at the end of the movie. * Katy Mixon as Tina Nelson, Walter and Madge's thief daughter, Walter Jr.'s younger sister and Binky's older brother. * Michael Beattie as Walter Nelson Jr., Walter and Madge's thief son and Tina and Binky's older brother. **Beattie also voices a VNC Announcer. * Hiroyuki Sanada as Dumo, a sumo fighter villain. * Dave Rosenbaum as Fabrice, Scarlet's personal stylist. ==Other websites== * * * * * Category:2015 comedy movies Category:2015 computer-animated movies Category:American comedy movies Category:American animated movies Category:Despicable Me Category:Universal Pictures movies Category:Illumination movies Category:Prequel movies Category:Buddy movies Category:Movies directed by Pierre Coffin Category:Movies directed by Kyle Balda",
 "title": "Minions (movie)"
}