{
 "id": "4096",
 "text": "Estonia (), officially the Republic of Estonia () is a small country in the Baltic states of Northern Europe. The capital city is Tallinn. Estonia has borders with Sweden, Finland, Russia and Latvia. Its population is 1,332,893. The territory includes the mainland and 2,222 islands in the Baltic Sea.Matthew Holehouse Estonia discovers it's actually larger after finding 800 new islands The Telegraph, 28 August 2015 ==History== People have lived in Estonia since at least 9,000 BC. The oldest known settlement in Estonia is the Pulli settlement, which was on the banks of the Pärnu River. Estonia became independent from Russia in 1920 after a brief War of Independence at the end of World War I (1914-1918). During World War II (1939–1945), Estonia was occupied by the Soviet Union and Germany. It then became the Estonian Soviet Socialist Republic and lost its independence. Estonia had its independence restored in 1991. It became a member of the North Atlantic Treaty Organization (NATO) on 29 March 2004. It joined the European Union on 1 May 2004. == Politics == In January 2021, Estonia became the only country in the world led by women by having a female president (Kersti Kaljulaid) and female prime minister (Kaja Kallas). A few months later, Alar Karis replaced Kaljulaid as president and in 2024 Kristen Michal replaced Kallas as Prime minister. The foreign intelligence service warned in 2024 that Russia intended to double the number of its troops stationed along its border. Estonia plans to spend more than 3% of GDP on defence. ==Geography== Estonia is bordered to the north by the Gulf of Finland with Finland on the other side, to the west by the Baltic Sea with Sweden on the other side, to the south by Latvia (343 km), and to the east by Lake Peipus and Russia (338.6 km).. Official website of the Republic of Estonia (in Estonian) Average elevation reaches only . The country's highest point is the Suur Munamägi in the southeast at . Estonia has many forests, almost 50% of the land is covered with forests.Facts Estonian Timber The most common tree species are pine, spruce and birch. Estonia has over 1,400 lakes and over 2,000 islands. The longest rivers are Võhandu (), Pärnu (), and Põltsamaa (). ==Biodiversity== Mammals in Estonia include the grey wolf, lynx, brown bear, red fox, badger, wild boar, moose, red deer, roe deer, beaver, otter, grey seal, and ringed seal. The critically endangered European mink has been successfully reintroduced to the island of Hiiumaa. The rare Siberian flying squirrel is present in east Estonia. Over 300 bird species have been found in Estonia. These include the white-tailed eagle, lesser spotted eagle, golden eagle, western capercaillie, black and white stork, many species of owls, waders, geese and many others. The Barn swallow is the national bird of Estonia. Protected areas cover 18% of Estonian land and 26% of its sea territory. There are 5 national parks, 159 nature reserves, and many other protection areas. ==Government== The Riigikogu is the name of the parliament in Estonia. ===Administrative regions=== Since administrative reform in 2017, there are in total 79 local governments. This includes 15 towns and 64 rural municipalities. All municipalities have equal legal status and form part of a county, which is a state administrative unit. The counties are: * Harju County * Hiiu County * Ida-Viru County * Jõgeva County * Järva County * Lääne County * Lääne-Viru County * Põlva County * Pärnu County * Rapla County * Saare County * Tartu County * Valga County * Viljandi County * Võru County ==Culture== According to speedtest.net, Estonia has one of the fastest Internet download speeds in the world with an average download speed of 27.12 Mbit/s. Estonia won the Eurovision Song Contest in 2001 with the song \"Everybody\" performed by Tanel Padar and Dave Benton. In 2002, Estonia hosted the event. The Estonian National Day is the Independence Day celebrated on 24 February. This is the day the Estonian Declaration of Independence was issued. , there are 12 public holidays and 12 national holidays celebrated each year. In June 2023, the Estonian government passed a bill legalising same-sex marriage and same-sex adoption in Estonia. The bill went into effect on 1 January 2024, making Estonia the first Baltic state and country formerly occupied by the Soviet Union to legalise same-sex marriage and adoption. ==International rankings== The following are links to international rankings of Estonia. Index Rank Countries reviewed Freedom House Internet Freedom 2016 1 65 International Tax Competitiveness Index 2023 1 38 Environmental Performance Index 2016 8 180 Index of Economic Freedom 2017 6 180 Reporters Without Borders Press Freedom Index 2011–2012 11 187 State of World Liberty Index 2006 1 159 Human Development Index 2019 30 189 Corruption Perceptions Index 2016 22 176 TRACE Matrix business bribery risk 2016 3 199 Networked Readiness Index 2014 21 133 Ease of Doing Business Index 2017 12 190 State of The World's Children's Index 2012 10 165 State of The World's Women's Index 2012 18 165 World Freedom Index 2014 8 165 Legatum Prosperity Index 2019 21 149 ==Related pages== * Estonia at the Olympics * Estonia national football team * List of rivers of Estonia == References == == Other websites == * Official State Website Category:European Union member states Category:1991 establishments in Europe",
 "title": "Estonia"
}