{
 "id": "409753",
 "text": "Robert II Archbishop of Rouen (989–1037) and Count of Évreux. He was an important and influential member of the clergy of Normandy. Robert was an advisor to five dukes of Normandy. ==Career== Robert was the son of Richard I the Fearless by his wife Gunnora.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: Verlag von J. A. Stargardt, 1984), Tafel 79 He was a younger brother of duke Richard II and the uncle of duke Robert I. He was appointed the Archbishop of Rouen by his father . He was also given the countship of Évreux at the same time.David Crouch, The Normans; The History of a Dynasty (London & New York: Hambledon Continuum, 2007), p. 21 Robert had always been involved in Norman politics and was a strong supporter of the Norman dukes.David C. Douglas, William the Conqueror (Berkeley & Los Angeles: University of California Press, 1964), p. 119 His nephew Richard III had a troubled and short reign of just over a year. When he was succeeded by his brother Robert I, as Duke of Normandy, Archbishop Robert had a great deal of trouble helping the new duke.David C. Douglas, William the Conqueror (Berkeley & Los Angeles: University of California Press, 1964), p. 32 In 1028 the duke attacked him and then made him leave Normandy. Duke Robert I then laid siege to Hugh d'Ivry, Bishop of Bayeux who also questioned his authority as duke.François Neveux, The Normans, Trans. Howard Curtis (London: Constable & Robinson, Ltd., 2008), p. 100 From exile in France, Archbishop Robert excommunicated his nephew Duke Robert and placed Normandy under an interdict. The Archbishop and Duke finally came to an agreement. Archbishop Robert lifted the interdict and excommunication; Duke Robert restored the Archbishop to his see. He also gave back his countship of Evereux, and returned all his properties.François Neveux, The Normans, Trans. Howard Curtis (London: Constable & Robinson, Ltd., 2008), p. 102 Duke Robert also returned all the property that he or his vassals had taken from the church. By 1033 Duke Robert was starting a major campaign against his cousin Alan III, Duke of Brittany.David Crouch, The Normans; The History of a Dynasty (London & New York: Hambledon Continuum, 2007), p. 52 He and Alan had been raiding back and forth but finally a peace was negotiated between them by Archbishop Robert, their mutual uncle. In 1035 Duke Robert had decided on a pilgrimage to Jerusalem.The Gesta Normannorum Ducum of William of Jumièges, Orderic Vitalis, and Robert of Torigni, Ed. & Trans. Elizabeth M.C. Van Houts, Vol. I (Clarendon Press, Oxford, 1992), pp. 80-5 After making his illegitimate son William (William the Conqueror) his heir he asked the archbishop to watch over and protect his young son. Duke Robert then set out on his pilgrimage to Jerusalem never to return to Normandy. He died on his return journey. Archbishop Robert kept his promise and ruled Normandy as regent for William until his death in 1037. When Robert died it caused an increase in lawlessness in Normandy.David C. Douglas, William the Conqueror (Berkeley & Los Angeles: University of California Press, 1964), p. 164 Robert was a witness to at least fifteen ducal charters during his career. David Douglas, 'The Earliest Norman Counts', The English Historical Review, Vol. 61, No. 240 (May, 1946), p. 132 He influenced Norman politics for nearly fifty years. ==Family== Robert married Herlevea and they had the following children: * Richard, Count of Évreux (d. 1067). * Ralph de Gacé, Sire de Gace. He married Basilla, daughter of Gerard Flaitel. They had one son, Robert, who died without heirs. Basilla married secondly Hugh de Gournay.Anselme de Sainte-Marie, Histoire de la Maison Royale de France, et des grands officiers (Paris: Compagnie des Libraires, 1726), p. 478 * William d'Évreux, married Hawise de Echauffour, daughter of Giroie, Lord of Échauffour, and had a daughter, Judith, who married Roger I of Sicily.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: Verlag von J. A. Stargardt, 1984), Tafel 206 * Herleva de Evereux (married Gerard Flaitel) ==References== Category:989 births Category:1037 deaths Category:French Christians Category:House of Normandy Category:Normans Category:Archbishops",
 "title": "Robert II, Archbishop of Rouen"
}