{
 "id": "4099",
 "text": "Lithuania is a country in Europe. It borders Latvia to the north, Belarus to the southeast, Poland to the south and Russia to the southwest. It is one of the Baltic states. ==Overview== The country's area is 65,300 km² and there are about 2.8 million people who live in Lithuania. The national language is the Lithuanian language, which is spoken by around 3 million people. Vilnius is the capital and largest city. Lithuania is a member of the European Union, NATO, and several other organizations. The colors of the Lithuanian flag are yellow (at the top) for the sun, green (in the middle) for the fields, and red (at the bottom) for the blood of Lithuanians fighting for its independence. == History == Lithuania began to turn into a country in the 7th to the 9th centuries from Baltic nations group. The Balts, the ancestors of Lithuanians and the Latvians, came to the area between Nemunas and the Daugava Rivers and the Baltic Sea from the supposed original homeland of the Proto-Indo-European languages. Many scientists think they came there sometime in the 3rd millennium BC. The traditional date of the beginning of the country is 1236, when the Lithuanians won the Battle of Šiauliai (Battle of Sun). The Grand Duchy of Lithuania signed a treaty with Poland in 1569. The country was taken over by the Russian Empire in 1795, which ended the Polish-Lithuanian Commonwealth. It got back its independence on February 16, 1918. In 1940, the country was annexed by the Soviet Union. On June 22, 1941, during the German invasion, Lithuania was occupied until 1944. Lithuania declared its independence again on March 11, 1990. The country is now an independent semi- presidential democratic republic. == Politics == Lithuania has been a member of NATO and the EUsince 2004. Lithuania is a semi presidential republic that restored its independence and democracy in 1990. Since then, very important reforms were made and Lithuania is now declared as a democratic state that grants the human rights. The Constitution that was adopted in 1992 declares that the leader of the country is the President, who must be elected to take office. Elections are held every five years. If the President breaks their oath, they can be forced to resign by the Parliament. The President also represents Lithuania abroad and is the commander-in-chief. The legislative power of Lithuania is called the Seimas, or Parliament. There are 141 members of Seimas who are elected for four-year-terms. Seimas passes the laws that must be executed by the government, that is formed in Seimas, and it must be accepted by the President. The Prime Minister is set and fired by the President. The justice is under the power of the courts. The supreme court in Lithuania is the Constitutional Court. == Administrative subdivisions == Lithuania is divided into 10 counties, 60 municipalities and 500 elderates. The counties are: * Alytus County * Kaunas County * Klaipėda County * Marijampolė County * Panevėžys County * Šiauliai County * Tauragė County * Telšiai County * Utena County * Vilnius County The county governor rules the county. He or she must be appointed by the central government. Municipalities are governed by the Municipal Councils that are elected for 4 year terms. The head of a municipality is the mayor. The elderates are governed by the elders. The elders are appointed by the municipal councils. == Geography == Lithuania is a country in Northern Europe. Its neighbours are Poland in the southwest, Russia (Kaliningrad) in west, Latvia in north and Belarus in the east. Lithuania borders the Baltic Sea and 99 kilometres of its coast belong to Lithuania. The highest hill is Aukštojas (294 metres high), the largest lake is Drūkšiai. 31% of the land is suitable for farms. Lithuania is divided into 5 cultural regions according to their past and traditions: * Aukštaitija * Dzūkija * Mažoji Lietuva (Lithuania Minor) * Suvalkija * Žemaitija (Samogitia) === Climate === Extreme temperatures in Lithuania (°C) Month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Highest Temperatures +12,6 +16,5 +21,8 +28,8 +34 +35 +37,5 +36 +32 +26 +18 +15,6 Lowest Temperatures -40,5 -42,9 -37,5 -23,0 -6,8 -2,8 +0,9 -2,9 -6,3 -19,5 -23 -34 == Economy == Lithuania has a fast growing economy. It grew up to 7% in the first quarter of 2008. GDP per capita, based on purchasing power parity is estimated to be $19,730 in 2008. The nominal GDP per capita is estimated to be $14,213 at the same year. According to these numbers, Lithuanian per capita GDP reaches only 61% of EU average. However, it is impressive that only in 8 years, since 2000 it grew up from 30% of EU average. Emigration still creates a problem, however. This means that the country's own people are leaving their homeland in search for better opportunities like jobs elsewhere. According to the official data, emigration in 2006 was 30% lower than the previous year, with 3,483 people leaving in four months. == Demographics == About 80% of people in Lithuania are Lithuanians. The other 20% are minorities which include 234,989 Poles (6.7%), 219,789 Russians (6.3%), 42,866 Belarusians (1.2%), 22,488 Ukrainians (0.7%), and 4,007 ethnic Jews (2001 census data). There are also much smaller populations of Armenians, Azeris, Georgians, Germans, Celts, Finns, Karaims (Karaites), Latvians, Estonians, Moldovans, Greeks, Romanians, Gypsies (Roma), Bashkirs, Tatars, Uzbeks, Tajiks, and Kazakhs in Lithuania. Lithuanian is spoken by 82% of the people and it is the only official language. Polish is used mostly in Vilnius County where Polish politicians are elected to represent the Polish minority. The documents and street names must be in Lithuanian. The biggest cities are Vilnius with 542,287 people living in it, Kaunas with 358,107 people living in it, and Klaipėda with 185,899 people living in it. === Largest cities === City Region Population Density* (/km2) Area (km2) Vilnius East 401 Kaunas Middle 157 Klaipėda West 98 Šiauliai North 81 Panevėžys North 52 Alytus South 40 Marijampolė South 21 Mažeikiai North 14 Jonava Middle n/d n/d Utena East 15,1 Kėdainiai Middle n/d 44 == Education == The nursery schools and the kindergartens are the first-level education forms. However, they are not compulsory. The children start attending the primary school at age 7, where educational programs last for 4 years; then they must start attending secondary school (5th to 10th grades). After finishing 8th or 10th grade, the student can continue learning at the high school or choose courses at the vocational college. The students who finish the high school can join colleges and universities. Higher education is free for the students whose annual median of grades is 8 or higher. The others have to pay ~1300 Euros per semester at least. The higher education schools are universities and colleges. The main universities are: * Vilnius University (the oldest university in northeastern Europe, founded in 1579); * University of Vytautas the Great, in Kaunas; * The University of Technology of Gediminas, in Vilnius; * The Klaipėda University. == Media == === Radio and television === Lithuanians can choose from many television and radio stations. The first radio station was started in 1926 in Kaunas. The first television station started in 1957. The main radio stations are: * Public broadcaster: LRT Radijas (talk station), LRT Klasika (classical music), LRT Opus (alternative music) * M-1 (TOP 40) * Lietus (Lithuanian pop) * Radiocentras (TOP 40) * Power Hit Radio (dance) * ZIP FM (TOP 40) * M-1 Plius (adult contemporary) * Žinių Radijas (talk station) The most popular TV stations are: * Public broadcaster: LRT Televizija (main programme), LRT Plius (culture, sports, movies) * TV3 (national) * LNK (national) * BTV (national) * Lrytas TV (national) * TV1 (women-oriented) * TV8 (women-oriented) * TV6 (men-oriented) * Info TV (news) === Printed media and Internet === The oldest legal newspaper in Lithuania is the Polish Kurier Wilenski. It was first published in the 18th century and is now only popular with the Polish community. The biggest selling newspapers are: * Lietuvos Rytas (national) * Verslo žinios (business) * Kauno diena (regional) * Vakaro žinios (tabloid) * Vakarų ekspresas (regional) Internet news portals are very popular in Lithuania. They have the latest information and also let people make comments. The most popular Internet sites with news and information are: * Delfi.lt * 15min.lt * lrytas.lt * tv3.lt * lrt.lt ==Related pages== * Lithuania at the Olympics * Lithuania national football team * List of rivers of Lithuania == Notes and references == == Other websites == * The site of the President's administration * The site of Lithuanian Parliament * The site of Government of Lithuania * The Official site of Department of Statistics * The official site of Vilnius Municipality * The official site of Kaunas Municipality * The official site of klaipėda Municipality Category:European Union member states",
 "title": "Lithuania"
}