{
 "id": "410045",
 "text": "Rollo (–), also called Rolf (Hrolf) was a Viking leader. In 911 he was given lands around Rouen by the Frankish king Charles the Simple. He passed on his ever growing fief to his descendants, known as the counts and later dukes of Normandy. He was the first of the dynasty known as the House of Normandy. A \"Stature of Rollo\" now stands in Rouen, Normandy. == Early career == Rollo might have been a son of Rognvald, earl of More (in present day Norway) and was a Viking raider in France. David C. Douglas, William the Conqueror; The Norman Impact upon England (Berkeley; Los Angeles, University of California Press, 1964), p. 16 He probably also raided Scotland and Ireland. Rollo played a part in the Siege of Paris (885–86) and then captured Bayeux according to Dudo of Saint-Quentin. François Neveux, The Normans; The Conquests that Changed the Face of Europe, trans. Howard Curtis (London: Constable & Robinson Ltd., 2008), p. 59 While Rollo was given lands around Rouen in 911 by the French king, Flodoard of Reims says that there were many bands of Northmen raiding in western France at the time.The Annals of Flodoard of Reims 919–966, ed. & trans. Steven Fanning; Bernard S. Bachrach (Toronto: University of Toronto Press, 2011), pp. xx-xxi In his writing he paid more attention to another group of Vikings under Ragenold. Flodoard had no way of knowing then that of all the Viking bands those under Rollo would grow to become the great duchy of Normandy. == Beginnings of Normandy == In 918 King Charles and Rollo met on the border of the Vexin and Roumois. The Roumois was the name then for the province of which Rouen was the capital.David Crouch, The Normans; The History of a Dynasty (London; New York: Hambledon Continuum, 2007), p. 4 In a charter the king confirmed to Rollo the city of Rouen. He also gave him all the territory west to the border of Brittany. By 924 Normandy was growing into a principality.David Crouch, The Normans; The History of a Dynasty (London; New York: Hambledon Continuum, 2007), p. 7 It was at this time that he acquired Bayeux and also Maine.The Normans in Europe, trans. Elisabeth van Houts (Manchester; New York: Manchester University Press, 2000), p. 16 Rollo appears in annals only here and there.The Annals of Flodoard of Reims 919–966, ed. & trans. Steven Fanning; Bernard S. Bachrach (Toronto: University of Toronto Press, 2011), p. xxi He was fighting over the castle of Eu against King Raoul. He also came to the aid of King Charles the Simple against Herbert II of Vermandois. Rollo died about 928.The Normans in Europe, ed. & trans. Elisabeth van Houts (Manchester; New York: Manchester University Press, 2000), p. 2 == Family == Rollo's first wife was Poppa.Detlev Schwennicke, Europaische Stammtafeln: Stammtafeln zur Geschichte der Europaischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 79 Together they had: * William I, Longsword. He succeeded his father as princeps of Normandy. * Gerloc, wife of William III, Duke of Aquitaine. Rollo's second wife was Gisela, daughter of Charles III the Simple, King of France. Detlev Schwennicke, Europaische Stammtafeln: Stammtafeln zur Geschichte der Europaischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 1 They had no children. Gerloc's daughter, Adelaïde of Aquitaine, married the king of the franks, Hugues Capet whose descent remained on the throne of France until de XIXth century. == Notes == == References == Category:840s births Category:920s deaths Category:Dukes and duchesses of Normandy",
 "title": "Rollo"
}