{
 "id": "41016",
 "text": "K2 is the second-highest mountain in the world, standing at tall. It is also known as Mount Godwin-Austen or Chogori (ཆོགོ་རི།). K2 is part of the Karakoram mountain range, and is located in Kashmir. The name, 'K2' originated from the first survey of the Karakoram range. In the survey, surveyors named each mountain with a 'K' and a number after that. K2 is known as the 'Savage Mountain' and is considered more difficult to climb than Mount Everest, the highest mountain in the world. It has the second-highest fatality rate among all mountains over 8,000 meters, with approximately one death for every four climbers who reach the summit. As of 2011, only 300 people had successfully reached the top of K2, while more than 80 climbers lost their lives attempting the ascent. K2 can be climbed during both summer and winter seasons. The top of the mountain was first reached in 1954 by Italian climbers Lino Lacedelli and Achille Compagnoni. == Name == The name K2 was first used by the Great Trigonometrical Survey of British India. Thomas Montgomerie conducted the first survey of the Karakoram range from Mount Harmukh. During the Survey, he sketched the two most prominent peaks and labeled them K1 and K2. The rule of the Great Trigonometrical Survey was to use local names for mountains when possible. K1 was locally known as Masherbrum. K2, however, appeared not to have a local name. The reason was probably its remoteness. It cannot be seen from Askole, the last village to the south, or from the nearest village to the north. People think that the name 'Chogori' is the rightful local name for K2. Chogori comes from two Balti words, chhogo (\"big\") and ri (\"mountain\") (ཆོགོ་རི།) There is not much evidence for its widespread use, however. It may have been invented by Western explorers. It does form the basis for the name Qogir () which the Chinese government uses as the official name of the mountain. As the mountain did not have a local name, the name Mount Godwin- Austen was suggested. This was in honor of Henry Godwin-Austen, who had been an early explorer of the area. While the name was rejected by the Royal Geographical Society, it was used on several maps and is still used.To this day, the mountain is still known as K2. This name now exists in the Balti language as Kechu or Ketu (ཀེ་ཆུ།). The Italian climber Fosco Maraini stated that while the name K2 came by chance, it was good for the mountain. He said: == Climbing history == === Early attempts === The mountain was first surveyed by a European team in 1856. Team member Thomas Montgomerie first called the mountain K2. The other mountains were originally named K1, K3, K4, and K5, but were later changed to local names.Kenneth Mason (1987 edition) Abode of Snow p.346 In 1892, Martin Conway led a British expedition that made it to the Baltoro Glacier. The first real attempt to climb K2 was made in 1902 by an Anglo-Swiss expedition. It took fourteen days for them to reach the foot of the mountain. After five attempts, the team only made it to . The next expedition was in 1909. It was led by the Italian Prince Luigi Amedeo, Duke of the Abruzzi. This team made it only to an elevation of on the Southeast Spur of the mountain. Not finding any other routes, the Duke said that K2 would never be climbed. The next attempt was not made until 1938. At that time, American Charles Houston took an expedition to the mountain. They decided that the Abruzzi Spur was the best route and made it to a height of around . In 1939, an American expedition led by Fritz Wiessner came within of the summit. It ended in disaster when four members died on the mountain. Charles Houston tried again in 1953. The try was a failure due to a storm, which trapped the team for 10 days at . One climber died in the expedition. Many others nearly died in a mass fall but were saved by Pete Schoening. === First success === Finally, in 1954, an Italian expedition made it to the summit. It was led by geologist Ardito Desio. The two climbers to reach the top were Lino Lacedelli and Achille Compagnoni, at 6 pm on 31 July 1954. One member of the expedition (Colonel Muhammad Ata-Ullah of Pakistan) had been part of the 1953 American attempt as well. Other members were scientists, a doctor, a photographer, and others. Mario Puchoz died in the attempt. Two other members had to be hospitalized and one had to have his toes amputated due to frostbite. === Later success === The second success was not until 23 years after the first. It was a Japanese expedition led by Ichiro Yoshizawa in 1977. The third success was in 1978 and used a different route from the first two. This one was done by an American team, led by James Whittaker. Another notable success was in 1982 when a Japanese team climbed from the harder Chinese side of the mountain. The previous successes had been from the Pakistan side. The expedition was led by Makoto Shinkai and Masatsugo Konishi. Three members of the team made it to the summit on 14 August. One of them, however, died when coming down. Four other members made it to the summit the next day, on 15 August. The first person to reach the summit twice was Czech climber Josef Rakoncaj. He was part of a 1983 Italian expedition that made the summit. Then three years later he made the summit again as part of an international expedition. The first woman to reach the summit was Polish climber Wanda Rutkiewicz in 1986. Two other women reached the summit later that same day, but died when coming down. In 1986, Benoit Chamoux used 23 hours to climb (from base camp) to the mountain top. He climbed without oxygen bottles. In 2004, the Spanish climber Carlos Soria Fontán became the oldest person ever to summit K2, at the age of 65. In 2018, Polish climber Andrzej Bargiel became the first person to ski down K2 after he made it to the top. In 2022, Chhiring Sherpa climbed the mountain in 12 hours and 20 minutes. He used oxygen bottles. Around 700 people have climbed (as of August 2022) to the summit of K2. 190 of those (climbs or) ascents, were in 2022. == Climbing difficulty == Even though the summit of Mount Everest is higher, K2 is a much more difficult and dangerous climb. This is because of its worse weather. It is believed by many to be the world's most difficult and dangerous to climb. This is why it is nicknamed \"The Savage Mountain\".The popularity was mentioned of the Mount Everest, which is much higher than the popularity or vanity of K2. At least 80 (as of September 2010) people have died attempting the climb. ==Investigation of the death of a porter (2023)== In August 2023, Pakistani authorities started to investigate the death of Mohammed Hassan. Media said that \"dozens of climbers\" that wanted \"to reach the summit [or top of the mountain] had walked past the man after he was [...] injured in a fall.\" He died a few hours later on the mountain. Video clips have been published by many news websites. Media says that video clips show climbers stepping or walking over the injured man without trying to help him. Wilhelm Steindl, a mountain climber, said \"If I or any other Westerner [or people from the Western world] had been lying there, [then] everything would have been done to save them\", and \"Everyone would have had to turn back to bring the injured person back down to the valley\". Only one witness has talked with the police, according to media (August 15). He says that climbers were jumping and straddling over the injured porter that was dying on the path. (A porter is a person who carries things (or cargo) for others.) The police of Gilgit-Baltistan are doing the investigation. The military and the department of tourism have jurisdiction where the porter died. Furthermore, the government of Gilgit-Baltistan created a committee (or group) of 5 people that have made a report. The report \"will be made public\" [...] \"a few days after August 30. The report must be given [around August 23 or] within 15 days of August 7. == References == == Other websites == * Map of K2 * 'K2: The Killing Peak' Men's Journal November 2008 feature * Story of the 1902 K2 expedition by Aleister Crowley, who was in the group * The climbing history of K2 from the first attempt in 1902 until the Italian success in 1954. *The climbing history of K2 from the first attempt in 1902 until the Italian success in 1954. Category:Karakoram Category:Mountains of Asia Category:Mountains of Xinjiang Category:Mountains of Pakistan Category:Gilgit-Baltistan",
 "title": "K2"
}