{
 "id": "410412",
 "text": "The Aérospatiale SA-365 Dauphin 2 is a French helicopter. It is both a civilian and military helicopter. Mainly used for search and rescue, it is also used for transport and war against submarines. In this last kind it can carry one or two torpedoes. It is a modernized variant of Aérospatiale SA-360 Dauphin, with two turboshafts. == Variants == * SA-365C : This is the version of original series. It has pads as an undercarriage. * SA-365F : This is the first important series. It has retractable wheels as an undercarriage. ** SA-365N : This is the version of SA-365F for export. * SA-366 : This is the version made specially for United States Coast Guard and known as HH-65 Dolphin. * SA-365K : This is the first non-naval version, dedicated to aerial attack. * SA-365M : This is the first official military variant, later designated AS-565 Panther. * SA-365DGV (DGV for Dauphin à Grande Vitesse, or in English High Speed Dauphin) : This is an experimental variant for high speed research. Its name is in reference of French high-speed rail TGV. In 1992 after founding of Eurocopter all designations in SA- were changed to AS-. So SA-365N became AS-365N. Harbin Z-9 is a Chinese variant built under licence, and Eurocopter EC155 is the new one, built at the beginning as AS-365N4. == Users == Militaries and governmental Aérospatiale SA-365N Dauphin 2 were acquired by : Australia, Argentina, Bangladesh, Chile, Dominican Republic, France, Greece, Iceland, Ireland, Kuwait, Malaysia, Saudi Arabia, South Africa, Sri Lanka, Switzerland, UK, USA, Uruguay and many others. == Bibliography == * Jackson, Robert, Helicopters: Military, Civilian, and Rescue Rotorcraft (The Aviation Factfile). London: Grange Books Ltd, 2005. . * Gaillard, Pierre, Avions et hélicoptères militaires d'aujourd'hui Paris, France : Larivière éditions, 1999. . * Frawley, Gerard, The international directory of military aircraft 2002/2003 . London: Aerospace Publication, 2002. . Category:French military aircraft Category:Helicopters Dauphin",
 "title": "Aérospatiale SA-365 Dauphin 2"
}