{
 "id": "410445",
 "text": "Urban design is a subject of urban planning focusing on design of cities or other urban areas. Whereas architecture focuses on individual buildings, urban design is about the design of whole neighbourhoods and entire cities. It is about making them functional and attractive. There are many problems that urban design tries to fix. One of them has to do with public health. One of the most talked about issues is about how easily people can walk to where they need to go. It became a bigger issue recently, not only because of the environment, but also because of people not being very healthy. Cities with a lot of gas cars hurt people. When people live around cars that blow smoke. people start to get really sick. People's hearts will beat in a weird way and it can lead to people dying. More people die from bad air each year than from getting hit by a car. That makes people want some changes. So they go out to say to people that the cities have to change. Instead of cars, they want cities to use trains for going really far, and they want cities to use bikes or buses to go not very far. Then they want people to be able to walk to any close by places. This would help public health double by getting rid of car smoke and getting people to walk more. This can help people's hearts beat normally and not let them die. It is also good exercise. There is evidence that cities can get people to walk more in them by having more open public spaces, stores within walking distance, grass, trees and other pleasing designs outside, and other things. It also helps with mental health, because people are more likely to talk to each other and that cuts down on loneliness. Other websites * 5th International Urban Design Conference * 4th International Urban Design Conference * 2th International Urban Design Conference * Shenzhen & Hong Kong Bi‐City Biennale of Urbanism & Architecture * Bat Yam International Biennale of Landscape Urbanism 2010 * Cities of the Future: overview of important urban design elements * MA Theories of Urban Practice program in New York City",
 "title": "Urban design"
}