{
 "id": "410782",
 "text": "This is a list of analog television stations in the Philippines. Currently, there are two major networks competing for bigger audience share; GMA Network Inc. and TV5 Network, Inc. Most free-to-air networks are popularly known by their flagship channels (e.g. RPN 9 and GMA 7 (both Manila) instead of simply Radio Philippines Network and GMA Network respectively). Analog television in the Philippines began to shut down on February 28, 2017, and is scheduled to complete by the end of 2025 respectively in Mega Manila and sooner as possible on Outside areas of Mega Manila. Currently, all analog TV stations are still using the NTSC standard. == NTC's Frequency Allocations == These frequencies are used in Philippine Analog Television broadcasting. Type Band Type Video Frequency Used for VHF Band I 55.25 MHz~83.25 MHz TV-2 to 6 Band II 91.25 MHz~169.25 MHz FM Radio CATV-95 to 99 CATV-14 to 22 Band III 175.25 MHz~211.25 MHz TV-7 to 13 (Unk. VHF Band) 217.25 MHz~463.25 MHz CATV-23 to 64 Military UHF Band IV Band V 470.143 MHz~693.143 MHz TV-14 to 51 ISDB-T Digital TV (Unk. UHF Band) 699.25 MHz~801.25 MHz TV-52 to 69 Not used since 1993 Wireless Broadband providers Public Communications ==Metro Manila (NCR)== ===Metro Manila=== Type Callsign Ch. # Freq. (MHz) Owner Launch VHF Band I DZMV-TV TV-2 55.25 MHz Advanced Media Broadcasting System (under blocktime agreement from ABS-CBN Corporation) Currently broadcasting: ALLTV September 13, 2022 (frequency used by ABS-CBN from 1969 to 1972 and September 14, 1986, to May 5, 2020; by BBC from 1973 to 1986) DWGT-TV TV-4 67.25 MHz People's Television Network, Inc. Currently broadcasting: PTV February 2, 1974 (frequency used by ABS-CBN from 1969 to 1972) DWET-TV TV-5 77.25 MHz TV5 Network, Inc. Currently broadcasting: TV5 July 1962/February 21, 1992 VHF Band III DZBB-TV TV-7 175.25 MHz GMA Network, Inc. Currently broadcasting: GMA October 29, 1961 DZKB-TV TV-9 187.25 MHz Radio Philippines Network and Nine Media Corporation (under blocktime agreement from TV5 Network Inc.) Currently broadcasting: RPTV October 15, 1969 (frequency used by CBN, now ABS- CBN from 1958 to 1969) DZOE-TV TV-11 199.25 MHz ZOE Broadcasting Network (under blocktime agreement from ABS-CBN Corporation) Currently broadcasting: A2Z April 13, 1998/October 10, 2020 (frequency used by MBC from 1962 to 1972 and frequency used by DBS from 1995 to 1998) DZTV-TV TV-13 211.25 MHz Intercontinental Broadcasting Corporation Currently broadcasting: IBC March 1, 1960 UHF Bands IV and V DZEC-TV TV-25 537.25 MHz Eagle Broadcasting Corporation Currently broadcasting: NET25 April 23, 2000 (frequency used by ACWS-UBN from 1999 to 2000) DWDB-TV TV-27 549.25 MHz Citynet Network Marketing and Productions Currently broadcasting: GTV August 25, 1995/June 4, 2019 (formerly branded as Citynet Television from 1995 to 1999, Entertainment Music Channel in 1999, Channel [V] Philippines from 1999 to 2001 and GMA News TV from 2019 to 2021) DWAO-TV TV-37 609.25 MHz Progressive Broadcasting Corporation Currently broadcasting: UNTV January 1, 1999 (formerly NUTV Channel 37 from 1999 until 2002) DWNB-TV TV-41 633.25 MHz Nation Broadcasting Corporation Currently broadcasting: One Sports January 1, 2001/February 21, 2011 (formerly MTV Philippines, AksyonTV and 5 Plus) DZCE-TV TV-48 675.25 MHz Christian Era Broadcasting Service International Currently broadcasting: INCTV July 21, 2005/October 31, 2012 (on TV-49/681.25 MHz; shifted to current channel in 2017 to allow full-time simulcast with its digital signal) ===Inactive stations=== Type Callsign Ch. # Freq. (MHz) Assignee Launch Ceased operations VHF Band I DWWX-TV TV-2 55.25 MHz ABS-CBN Corporation Formerly xas: ABS-CBN October 23, 1953 (original frequency was ABS Channel 3 from 1953–69) May 5, 2020 (due to a cease and desist order from the National Telecommunications Commission to ABS-CBN after its legislative franchise expired.) On January 25, 2022, it was confirmed that the NTC had \"temporarily\" granted Manny Villar-controlled Advanced Media Broadcasting System, Inc. to do a \"test\" broadcast on such [up to 83.25 MHz] until the scheduled end-2024/2027 shutdown of Analog TV broadcasting in the country. UHF DWCP-TV TV-21 513.25 MHz Southern Broadcasting Network and Solar Entertainment Corporation Formerly broadcasting: ETC May 30, 1992 September 12, 2019 (shifted to full digital broadcasting) DWAC-TV TV-23 525.25 MHz ABS-CBN Corporation Formerly branded as: S+A October 12, 1996 (frequency used by EEC (formerly Philippine provider of MTV Asia/Channel V) from 1992 to 1996 and formerly branded as Studio 23 from 1996 to 2014) May 5, 2020 (same reason as ABS-CBN.) On January 26, 2022, the National Telecommunications Commission assigned this channel's frequency to Aliw Broadcasting Corporation. DZRJ-TV TV-29 561.25 MHz Rajah Broadcasting Network and Solar Entertainment Corporation Formerly branded as: RJTV 29/2nd Avenue May 1993 June 5, 2018 (end of blocktime agreement by Solar Entertainment Corporation and shifted to full digital broadcasting) DWKC-TV TV-31 573.25 MHz Broadcast Enterprises and Affiliated Media Formerly broadcasting: BEAM October 31, 1993/July 3, 2011 December 31, 2021 (shifted to full digital broadcasting) DZOZ-TV TV-33 585.25 MHz ZOE Broadcasting Network Formerly branded as: Light Network May 1, 2006 February 28, 2017 (shifted to full digital broadcasting) DWAQ-TV TV-39 621.25 MHz Swara Sug Media Corporation Formerly broadcasting: SMNI 2000/January 8, 2006 January 1, 2023 (shifted to full digital broadcasting) DWBM-TV TV-43 645.25 MHz Mareco Broadcasting Network 1994 2000s (former carry-over TV station of 105.1 Crossover (now Q105); frequency later used by AMCARA Broadcasting Network for digital broadcasts of some ABS-CBN TV Plus exclusive channels) DWVN-TV TV-45 657.25 MHz Gateway UHF Broadcasting Formerly broadcasting: 3ABN International & Hope Channel Philippines June 1, 2001 December 1, 2018 (analog signal off-air) TV-51 693.25 MHz Mediascape, Inc. 2010 2011 (shifted to full digital broadcasting for TV5's digital test transmission) Type Callsign Ch. # Freq. (MHz) Owner Launch Ceased operations ===Inactive station that Uses higher than the NTC's Frequency Standards=== The following TV Station is inactive and this station is still off-the-air until now, as this station is using higher than the NTC's Philippine Television Frequency for UHF, which is between 471.25 MHz and 693.25 MHz (Video Carrier). The frequencies above 700 MHz (Channels 52 to 69 are assigned from 699.25 MHz to 801.25 MHz Video Carrier) was used for Wireless Broadband Providers and Public Communications. For more details, refer to Pan-American television frequencies. Callsign Ch. # Freq. (MHz) Owner Launch Ceased operations DWBC-TV TV-68 795.25 MHz Byers Communication, Inc. Formerly branded as: Intervision 68 October 1992 July 1993 (due to intense competition from SkyCable) ==Cordillera Administrative Region (CAR)== ===Abra=== Callsign Ch. # Freq. (MHz) Location Owner DWBG-TV TV-7 175.25 MHz Peñarrubia GMA Network, Inc. Currently broadcasting: GMA ===Benguet=== Callsign Ch. # Freq. (MHz) Location Owner DZHB-TV TV-6 83.25 MHz Baguio Intercontinental Broadcasting Corporation D-8-XM-TV TV-8 181.25 MHz Baguio People's Television Network, Inc. DZEA-TV TV-10 193.25 MHz Benguet GMA Network, Inc. Currently broadcasting: GMA DZBS-TV TV-12 205.25 MHz Baguio Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DWDG-TV TV-22 519.25 MHz Benguet GMA Network Inc. Currently broadcasting: GTV DWBG-TV TV-24 531.25 MHz Benguet Vanguard Radio Network, Inc. DZET-TV TV-28 555.25 MHz Baguio TV5 Network Inc. Currently broadcasting: TV5 DZFB-TV TV-32 574.25 MHz Baguio Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DZRU-TV TV-36 603.25 MHz Baguio Nation Broadcasting Corporation and TV5 Network, Inc. Currently broadcasting: One Sports DZNU-TV TV-42 N/A Baguio Information Broadcast Unlimited Currently broadcasting: UNTV ===Mountain Province=== Callsign Ch. # Freq. (MHz) Location Owner DZVG-TV TV-5 77.25 MHz Mountain Province GMA Network Inc. Currently broadcasting: GMA ==Region I (Ilocos Region)== ===Ilocos Norte=== Callsign Ch. # Freq. (MHz) Location Owner DWTE-TV TV-2 55.25 MHz Laoag TV5 Network, Inc. Currently broadcasting: TV5 D-5-AS-TV TV-5 77.25 MHz San Nicolas GMA Network, Inc. Currently broadcasting: GMA DWCS-TV TV-13 211.25 MHz Laoag Intercontinental Broadcasting Corporation DZHH-TV TV-27 537.25 MHz San Nicolas GMA Network Inc. Currently broadcasting: GTV DWSB-TV TV-35 585.25 MHz Laoag Sonshine Media Network International DWIB-TV TV-39 621.25 MHz Laoag Information Broadcast Unlimited Currently broadcasting: UNTV ===Ilocos Sur=== Callsign Ch. # Freq. (MHz) Location Owner DWAE-TV TV-4 67.25 MHz Vigan People's Television Network, Inc. DWTP-TV TV-13 211.25 MHz Candon Tirad Pass Network DWDI-TV TV-32 579.25 MHz Vigan Mediascape, Inc. Currently broadcasting: TV5 DWIC-TV TV-36 603.25 MHz Vigan Information Broadcast Unlimited Currently broadcasting: UNTV DWSP-TV TV-38 615.25 MHz Vigan Sonshine Media Network International DWBC-TV TV-48 675.25 MHz Bantay GMA Network Inc. Currently broadcasting: GMA ===La Union=== Callsign Ch. # Freq. (MHz) Location Owner DZUL-TV TV-5 77.25 MHz San Fernando Sea & Sky Broadcasting, Inc. ===Pangasinan=== Callsign Ch. # Freq. (MHz) Location Owner DWDJ-TV TV-40 627.25 MHz Dagupan Mediascape, Inc. Currently broadcasting: TV5 ==Region II (Cagayan Valley)== ===Batanes=== Callsign Ch. # Freq. (MHz) Location Owner DWAZ-TV TV-7 175.25 MHz Basco GMA Network, Inc. Currently broadcasting: GMA ===Cagayan=== Callsign Ch. # Freq. (MHz) Location Owner DWBB-TV TV-7 175.25 MHz Tuguegarao GMA Network, Inc. Currently broadcasting: GMA DWEO-TV TV-11 199.25 MHz Tuguegarao People's Television Network, Inc. DZBB-TV TV-13 211.25 MHz Aparri GMA Network, Inc. Currently broadcasting: GMA D__-TV TV-24 N/A Aparri Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 DWGP-TV TV-26 543.25 MHz Aparri GMA Network Inc. Currently broadcasting: GTV DWHK-TV TV-27 549.25 MHz Tuguegarao GMA Network Inc. Currently broadcasting: GTV DWZE-TV TV-39 621.25 MHz Tuguegarao Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 DWIE-TV TV-51 693.25 MHz Tuguegarao Information Broadcast Unlimited Currently broadcasting: UNTV ===Isabela=== Callsign Ch. # Freq. (MHz) Location Owner DWLE-TV TV-7 175.25 MHz Santiago GMA Network Inc. Currently broadcasting: GMA DWAA-TV TV-13 211.25 MHz Santiago Rinconada Broadcasting Corporation DWDH-TV TV-25 537.25 MHz Santiago Mediascape, Inc. And TV5 Network Inc. Currently broadcasting: TV5 DWSA-TV TV-37 609.25 MHz Santiago Sonshine Media Network International ==Region III (Central Luzon)== ===Aurora=== Callsign Ch. # Freq. (MHz) Location Owner D-5-ZB-TV TV-5 77.25 MHz Baler GMA Network Inc. Currently broadcasting: GMA ===Nueva Ecija=== Callsign Ch. # Freq. (MHz) Location Owner DWNU-TV TV-48 675.25 MHz Cabanatuan Multipoint Broadcasting Network Currently broadcasting: NETV 48 ===Pampanga=== Callsign Ch. # Freq. (MHz) Location Owner DWCL-TV TV-12 205.25 MHz San Fernando UBC Global Media Ministries Incorporated and Brigada Mass Media Corporation Currently broadcasting: Ka-Brigada TV 12 DWRW-TV TV-36 603.25 MHz Angeles RadioWorld Broadcasting Corporation Currently broadcasting: CLTV 36 DZCL-TV TV-38 615.25 MHz Angeles Information Broadcast Unlimited Currently broadcasting: UNTV DWCL-TV TV-40 337.25 MHz San Fernando Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines *Signals can be seen in some parts of Metro Manila ===Tarlac=== Callsign Ch. # Freq. (MHz) Location Owner TV-24 531.25 MHz Capas, Tarlac Mediascape, Inc. and TV5 Network Currently broadcasting: TV5 DWRP-TV TV-26 543.25 MHz Tarlac Radio Corporation of the Philippines Currently broadcasting: Monday-Friday: RTV Tarlac Channel 26 / Saturday and Sunday: CNN Philippines ===Zambales=== Callsign Ch. # Freq. (MHz) Location Owner DZPT-TV TV-2 65.25 MHz Olongapo People's Television Network Currently broadcasting: PTV DWNS-TV TV-10 193.25 MHz Olongapo GMA Network Inc. Currently broadcasting: GMA DWRG-TV TV-26 545.25 MHz Olongapo GMA Network, Inc. Currently broadcasting: GTV TV-28 555.25 MHz Olongapo Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 DWIG-TV TV-48 675.25 MHz Olongapo Information Broadcast Unlimited Currently broadcasting: UNTV ==Region IV-A (Calabarzon)== ===Batangas=== Callsign Ch. # Freq. (MHz) Location Owner DWNI-TV TV-6 83.25 MHz Batangas DCG Radio-TV Network D-12-ZB-TV TV-12 205.25 MHz Batangas GMA Network, Inc. Currently broadcasting: GMA DWDK-TV TV-26 543.25 MHz Batangas GMA Network, Inc. Currently broadcasting: GTV DWBD-TV TV-30 567.25 MHz Batangas Mediascape, Inc. Currently broadcasting: TV5 *Signals can be seen in some parts of Metro Manila ===Quezon=== Callsign Ch. # Freq. (MHz) Location Owner DWPP-TV TV-8 181.25 MHz Lucena DCG Radio-TV Network ===Rizal=== Callsign Ch. # Freq. (MHz) Location Owner DWJJ-TV TV-44 651.25 MHz Jalajala GMA Network, Inc. Currently broadcasting: GMA *Signals can be seen in some parts of Metro Manila ==Region IV-B (Mimaropa)== ===Occidental Mindoro=== Callsign Ch. # Freq. (MHz) Location Owner D-13-ZR-TV TV-13 211.25 MHz San Jose GMA Network, Inc. Currently broadcasting: GMA DWHJ-TV TV-26 543.25 MHz San Jose GMA Network, Inc. Currently broadcasting: GTV TV-34 591.25 MHz San Jose Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Palawan=== Callsign Ch. # Freq. (MHz) Location Owner DYGS-TV TV-4 67.25 MHz Puerto Princesa People's Television Network, Inc. DWKT-TV TV-5 77.25 MHz Puerto Princesa DCG Radio-TV Network Currently broadcasting: CNN Philippines DYAA-TV TV-6 83.25 MHz Brooke's Point GMA Network, Inc. Currently broadcasting: GMA DWRF-TV TV-8 181.25 MHz Coron GMA Network, Inc. Currently broadcasting: GMA DWRK-TV TV-9 187.25 MHz Puerto Princesa Kaissar Broadcasting Network, Inc. DYPU-TV TV-12 205.25 MHz Puerto Princesa GMA Network, Inc. Currently broadcasting: GMA DWPI-TV TV-25 604.25 MHz Puerto Princesa Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DWHI-TV TV-27 549.25 MHz Puerto Princesa GMA Network, Inc. Currently broadcasting: GTV DWDD-TV TV-29 561.25 MHz Puerto Princesa Nation Broadcasting Corporation Currently broadcasting: TV5 DWDZ-TV TV-33 585.25 MHz Puerto Princesa ZOE Broadcasting Network Currently broadcasting: Light TV DWDW-TV TV-39 621.25 MHz Puerto Princesa Bandera News Philippines Currently broadcasting: Bandera News TV Palawan ===Romblon=== Callsign Ch. # Freq. (MHz) Location Owner DWTR-TV TV-7 175.25 MHz Tablas GMA Network, Inc. Currently broadcasting: GMA ==Region V (Bicol Region)== ===Albay=== Callsign Ch. # Freq. (MHz) Location Owner DWLA-TV TV-12 205.25 MHz Legazpi GMA Network, Inc. Currently broadcasting: GMA DWJB-TV TV-27 549.25 MHz Legazpi GMA Network, Inc. Currently broadcasting: GTV DWIA-TV TV-43 N/A Legazpi Information Broadcast Unlimited Currently broadcasting: UNTV ===Camarines Norte=== Callsign Ch. # Freq. (MHz) Location Owner DWGC-TV TV-8 181.25 MHz Daet GMA Network, Inc. Currently broadcasting: GMA TV-37 N/A Daet Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Camarines Sur=== Callsign Ch. # Freq. (MHz) Location Owner DWLV-TV TV-2 55.25 Mhz Iriga Bicol Broadcasting System Currently broadcasting: TV5 DWMA-TV TV-4 67.25 MHz Naga People's Television Network, Inc. DWAI-TV TV-7 175.25 MHz Naga GMA Network, Inc. Currently broadcasting: GMA DWKI-TV TV-10 193.25 MHz Iriga Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DWNA-TV TV-22 519.25 MHz Naga Nation Broadcasting Corporation Currently broadcasting: TV5 DZDP-TV TV-28 555.25 MHz Naga GMA Network Inc. Currently broadcasting: GTV DWTU-TV TV-40 627.25 MHz Naga Mediascape, Inc. and TV5 Network Inc. Currently broadcasting: One Sports DZTR-TV TV-50 N/A Naga Information Broadcast Unlimited Currently broadcasting: UNTV ===Catanduanes=== Callsign Ch. # Freq. (MHz) Location Owner D-13-ZC-TV TV-13 211.25 MHz Virac GMA Network, Inc. Currently broadcasting: GMA TV-28 N/A Virac Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Masbate=== Callsign Ch. # Freq. (MHz) Location Owner DYKD-TV TV-7 175.25 MHz Mobo GMA Network, Inc. Currently broadcasting: GMA DWHL-TV TV-27 549.25 MHz Masbate GMA Network, Inc. Currently broadcasting: GTV TV-30 N/A Masbate Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Sorsogon=== Callsign Ch. # Freq. (MHz) Location Owner DWGA-TV TV-2 55.25 MHz Juban GMA Network, Inc. Currently broadcasting: GMA ==Region VI (Western Visayas)== ===Aklan=== Callsign Ch. # Freq. (MHz) Location Owner DYBB-TV TV-2 55.25 MHz Numancia GMA Network, Inc. Currently broadcasting: GMA DYCJ-TV TV-25 537.25 MHz Kalibo Mediascape, Inc. Currently broadcasting: TV5 DYBL-TV TV-27 549.25 MHz Kalibo GMA Network, Inc. Currently broadcasting: GTV ===Capiz=== Callsign Ch. # Freq. (MHz) Location Owner DYAM-TV TV-5 77.25 MHz Roxas GMA Network, Inc. Currently broadcasting: GMA DYBK-TV TV-27 549.25 MHz Roxas GMA Network, Inc. Currently broadcasting: GTV DYMD-TV TV-33 585.25 MHz Roxas Mediascape, Inc. Currently broadcasting: TV5 DYSW-TV TV-39 621.25 MHz Roxas Sonshine Media Network International ===Iloilo=== Callsign Ch. # Freq. (MHz) Location Owner DYDY-TV TV-2 55.25 MHz Iloilo People's Television Network, Inc. DYXX-TV TV-6 83.25 MHz Iloilo GMA Network, Inc. and Asian-Pacific Broadcasting Company Currently broadcasting: GMA DYJB-TV TV-12 205.25 MHz Iloilo Intercontinental Broadcasting Corporation DYKV-TV TV-28 555.25 MHz Iloilo GMA Network, Inc. and Asian-Pacific Broadcasting Company Currently broadcasting: GTV DYZA-TV TV-33 N/A Iloilo ZOE Broadcasting Network (under blocktime agreement from ABS-CBN Broadcasting Corporation) Currently broadcasting: A2Z DYMB-TV TV-36 603.25 MHz Iloilo Mediascape, Inc. Currently broadcasting: TV5 DYNY-TV TV-42 N/A Iloilo Information Broadcast Unlimited Currently broadcasting: UNTV ===Negros Occidental=== Freq. (MHz) Callsign Ch. # Location Owner DYKB-TV TV-8 181.25 MHz Bacolod Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines D-10-YA-TV TV-10 193.25 MHz Sipalay GMA Network, Inc. Currently broadcasting: GMA DYGM-TV TV-13 211.25 MHz Bacolod GMA Network, Inc. Currently broadcasting: GMA DYGB-TV TV-24 531.25 MHz Bacolod Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DYAQ-TV TV-30 567.25 MHz Murcia GMA Network, Inc. Currently broadcasting: GMA Network DYTE-TV TV-32 579.25 MHz Bacolod TV5 Network, Inc. Currently broadcasting: TV5 DYNA-TV TV-48 N/A Bacolod Information Broadcast Unlimited Currently broadcasting: UNTV ==Region VII (Central Visayas)== ===Bohol=== Callsign Ch. # Freq. (MHz) Location Owner D-11-YE-TV TV-11 199.25 MHz Jagna GMA Network, Inc. Currently broadcasting: GMA DYID-TV TV-50 675.25 MHz Tagbilaran Information Broadcast Unlimited Currently broadcasting: UNTV ===Cebu=== Callsign Ch. # Freq. (MHz) Location Owner DYSS-TV TV-7 175.25 MHz Cebu GMA Network, Inc. Currently broadcasting: GMA DYKC-TV TV-9 187.25 MHz Cebu Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DYPT-TV TV-11 199.25 MHz Cebu People's Television Network, Inc. DYTV-TV TV-13 211.25 MHz Cebu Intercontinental Broadcasting Corporation DYET-TV TV-21 513.25 MHz Cebu TV5 Network, Inc. Currently broadcasting: TV5 DYGA-TV TV-25 537.25 MHz Cebu Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DYLS-TV TV-27 549.25 MHz Cebu GMA Network, Inc. Currently broadcasting: GTV DYAN-TV TV-29 561.25 MHz Cebu Nation Broadcasting Corporation and TV5 Network, Inc. Currently broadcasting: One Sports TV-34 591.25 MHz Cebu ZOE Broadcasting Network Currently broadcasting: Light TV DYNU-TV TV-39 621.25 MHz Cebu Progressive Broadcasting Corporation Currently broadcasting: UNTV DYNZ-TV TV-41 N/A Cebu ZOE Broadcasting Network (under blocktime agreement from ABS-CBN Broadcasting Corporation) Currently broadcasting: A2Z DYCS-TV TV-47 669.25 MHz Cebu Archdiocese of Cebu Currently broadcasting: CCTN DYGC-TV TV-51 693.25 MHz Cebu GMA Network Inc. Currently broadcasting: GMA Network ===Negros Oriental=== Callsign Ch. # Freq. (MHz) Location Owner D-5-YB-TV TV-5 77.25 MHz Dumaguete GMA Network, Inc. Currently broadcasting: GMA D-10-YM-TV TV-10 193.25 MHz Dumaguete People's Television Network, Inc. DYBM-TV TV-28 555.25 MHz Dumaguete GMA Network, Inc. Currently broadcasting: GTV TV-44 N/A Dumaguete Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ==Region VIII (Eastern Visayas)== ===Eastern Samar=== Callsign Ch. # Freq. (MHz) Location Owner DYVB-TV TV-8 181.25 MHz Borongan GMA Network, Inc. Currently broadcasting: GMA TV-30 N/A Borongan Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Leyte=== Callsign Ch. # Freq. (MHz) Location Owner DYTS-TV TV-4 67.25 MHz Tacloban BJDS Marketing/Sarraga Integrated & Management Corporation Currently broadcasting: TV5 DYDS-TV TV-6 83.25 MHz Palo Intercontinental Broadcasting Corporation DYCO-TV TV-8 181.25 MHz Tacloban People's Television Network, Inc. DYCL-TV TV-10 193.25 MHz Tacloban GMA Network, Inc. Currently broadcasting: GMA DYPR-TV TV-12 205.25 MHz Tacloban Philippine Collective Media Corporation Currently broadcasting: PRTV DYIL-TV TV-12 205.25 MHz Ormoc GMA Network, Inc. Currently broadcasting: GMA DYBJ-TV TV-26 543.25 MHz Tacloban GMA Network, Inc. Currently broadcasting: GTV DYOG-TV TV-30 496.25 MHz Tacloban Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DYNV-TV TV-39 N/A Tacloban Information Broadcast Unlimited Currently broadcasting: UNTV DY__-TV TV-40 627.25 MHz Tacloban Mediascape, Inc. Currently broadcasting: TV5 ===Western Samar=== Callsign Ch. # Freq. (MHz) Location Owner DYAS-TV TV-5 77.25 MHz Calbayog GMA Network, Inc. Currently broadcasting: GMA DYWP-TV TV-12 205.25 MHz Calbayog People's Television Network ==Region IX (Zamboanga Peninsula)== ===Zamboanga del Norte=== Callsign Ch. # Freq. (MHz) Location Owner D-4-XT-TV TV-4 213.25 MHz Dipolog GMA Network, Inc. Currently broadcasting: GMA DXAV-TV TV-26 314.25 MHz Dipolog GMA Network, Inc. Currently broadcasting: GTV ===Zamboanga del Sur=== Callsign Ch. # Freq. (MHz) Location Owner DXEJ-TV TV-3 155.25 MHz Pagadian GMA Network, Inc. Currently broadcasting: GMA DXAU-TV TV-26 652.25 MHz Pagadian GMA Network, Inc. Currently broadcasting: GTV TV-32 N/A Pagadian Mediascape Inc. and TV5 Network Inc. Currently broadcasting: TV5 ===Zamboanga Sibugay=== Callsign Ch. # Freq. (MHz) Location Owner DXAD-TV TV-6 227.25 MHz Ipil Ipil Broadcasting System DXSI-TV TV-11 770.25 MHz Ipil People's Television Network ===Zamboanga City=== Callsign Ch. # Freq. (MHz) Location Owner DXXX-TV TV-5 111.25 MHz Zamboanga City Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DXVC-TV TV-7 375.25 MHz Zamboanga City People's Television Network, Inc. DXLA-TV TV-9 573.25 MHz Zamboanga City GMA Network, Inc. Currently broadcasting: GMA DXGB-TV TV-11 478.25 MHz Zamboanga City Golden Broadcast Professionals, Inc. Currently broadcasting: TV5 DXZB-TV TV-13 298.25 MHz Zamboanga City TV-13 Cooperative for Service of Zamboanga DXVB-TV TV-21 602.25 MHz Zamboanga City GMA Network, Inc. Currently broadcasting: GTV DXGA-TV TV-25 721.25 MHz Zamboanga City Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DXDE-TV TV-29 579.25 MHz Zamboanga City Golden Broadcast Professionals, Inc. Currently broadcasting: One Sports DXNZ-TV TV-40 N/A Zamboanga City Information Broadcast Unlimited Currently broadcasting: UNTV ==Region X (Northern Mindanao)== ===Bukidnon=== Callsign Ch. # Freq. (MHz) Location Owner DXMK-TV TV-12 509.25 MHz Kitanglad GMA Network, Inc. Currently broadcasting: GMA ===Lanao del Norte=== Callsign Ch. # Freq. (MHz) Location Owner DXRV-TV TV-11 618.25 MHz Iligan GMA Network, Inc. Currently broadcasting: GMA ===Misamis Occidental=== Callsign Ch. # Freq. (MHz) Location Owner DXGM-TV TV-5 501.25 MHz Ozamiz GMA Network, Inc. Currently broadcasting: GMA DXWV-TV TV-13 709.25 MHz Ozamiz Mindanao Broadcasting & News Network DXAT-TV TV-22 625.25 MHz Ozamiz GMA Network Inc. Currently broadcasting: GTV DXOC-TV TV-48 492.25 MHz Oroquieta Mediascape, Inc. Currently broadcasting: TV5 ===Misamis Oriental=== Callsign Ch. # Freq. (MHz) Location Owner DXKO-TV TV-5 630.25 MHz Cagayan de Oro Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DXCC-TV TV-10 524.25 MHz Cagayan de Oro Intercontinental Broadcasting Corporation DXTE-TV TV-21 738.25 MHz Cagayan de Oro TV5 Network, Inc. Currently broadcasting: TV5 DXGC-TV TV-25 400.25 MHz Cagayan de Oro Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel PHL DXCO-TV TV-29 81.25 MHz Cagayan de Oro Nation Broadcasting Corporation and TV5 Network, Inc. Currently broadcasting: One Sports DXEV-TV TV-33 N/A Cagayan de Oro ZOE Broadcasting Network (under blocktime agreement from ABS-CBN Broadcasting Corporation) Currently broadcasting: A2Z DXJC-TV TV-35 138.25 MHz Cagayan de Oro GMA Network, Inc. Currently broadcasting: GMA DXNY-TV TV-41 N/A Cagayan de Oro Information Broadcast Unlimited Currently broadcasting: UNTV ==Region XI (Davao Region)== ===Davao del Norte=== Callsign Ch. # Freq. (MHz) Location Owner DXPT-TV TV-48 710.25 MHz Tagum People's Television Network, Inc. ===Davao del Sur=== Callsign Ch. # Freq. (MHz) Location Owner DXET-TV TV-2 93.25 MHz Davao City TV5 Network, Inc. Currently broadcasting: TV5 DXMJ-TV TV-5 67.25 MHz Davao City GMA Network, Inc. Currently broadcasting: GMA DXSS-TV TV-7 576.25 MHz Davao City Southern Broadcasting Network Currently broadcasting: Solar Learning DXWW-TV TV-9 489.25 MHz Davao City Radio Philippines Network and Nine Media Corporation Currently broadcasting: CNN Philippines DXNP-TV TV-11 84.25 MHz Davao City People's Television Network, Inc. DXTV-TV TV-13 614.25 MHz Davao City Intercontinental Broadcasting Corporation DXRS-TV TV-23 196.25 MHz Davao City Rajah Broadcasting Network DXGD-TV TV-25 597.25 MHz Davao City Gateway UHF Broadcasting Currently broadcasting: 3ABN International & Hope Channel Philippines DXRA-TV TV-27 420.25 MHz Davao City GMA Network, Inc. Currently broadcasting: GTV DXAN-TV TV-29 827.25 MHz Davao City Nation Broadcasting Corporation and TV5 Network, Inc. Currently broadcasting: One Sports DXBM-TV TV-33 634.25 MHz Davao City Manila Broadcasting Company Currently broadcasting: DZRH News Television DXUN-TV TV-38 818.25 MHz Davao City Davao Christian Bible Channel DXAQ-TV TV-43 412.25 MHz Davao City Sonshine Media Network International DXEX-TV TV-48 N/A Davao City ZOE Broadcasting Network (under blocktime agreement from ABS-CBN Broadcasting Corporation) Currently broadcasting: A2Z DXNU-TV TV-51 294.25 MHz Davao City Information Broadcast Unlimited Currently broadcasting: UNTV ==Region XII (Soccsksargen)== ===Cotabato=== Callsign Ch. # Freq. (MHz) Location Owner DXBV-TV TV-12 205.25 MHz Kidapawan GMA Network Inc. Currently broadcasting : GMA TV-35 N/A Kidapawan Mediascape Inc. and TV5 Network Inc Currently broadcasting: TV5 ===South Cotabato=== Callsign Ch. # Freq. (MHz) Location Owner DXWP-TV TV-5 286.25 MHz General Santos People's Television Network, Inc. DXBG-TV TV-8 307.25 MHz General Santos GMA Network Inc. Currently broadcasting: GMA DXER-TV TV-12 479.25 MHz General Santos TV5 Network, Inc. Currently broadcasting: TV5 TV-22 149.25 MHz General Santos Nation Broadcasting Corporation and TV5 Network, Inc. Currently broadcasting: One Sports DXMP-TV TV-26 599.25 MHz General Santos GMA Network, Inc. Currently broadcasting: GTV DXYM-TV TV-39 147.25 MHz General Santos Brigada Mass Media Corporation Currently broadcasting: Brigada News TV DXNV-TV TV-48 N/A General Santos Information Broadcast Unlimited Currently broadcasting: UNTV ==Region XIII (Caraga Region)== ===Agusan del Norte=== Callsign Ch. # Freq. (MHz) Location Owner DXNS-TV TV-7 501.25 MHz Butuan Northern Mindanao Broadcasting System Currently broadcasting: Bee TV DXGL-TV TV-13 482.25 MHz Butuan PEC Broadcasting Corporation DXBM-TV TV-26 520.25 MHz Butuan GMA Network, Inc. Currently broadcasting: GMA DXSW-TV TV-39 617.25 MHz Butuan Sonshine Media Network International ===Agusan del Sur=== Callsign Ch. # Freq. (MHz) Location Owner DXSK-TV TV-8 782.25 MHz Prosperidad People's Television Network DXDP-TV TV-10 684.25 MHz San Francisco PEC Broadcasting Corporation ===Surigao del Norte=== Callsign Ch. # Freq. (MHz) Location Owner D-10-XA-TV TV-10 82.25 MHz Surigao City GMA Network, Inc. Currently broadcasting: GMA DXAW-TV TV-27 222.25 MHz Surigao City GMA Network, Inc. Currently broadcasting: GTV ===Surigao del Sur=== Callsign Ch. # Freq. (MHz) Location Owner DXRC-TV TV-2 528.25 MHz Tandag GMA Network, Inc. Currently broadcasting: GMA DXTN-TV TV-6 666.25 MHz Tandag Tandag News TV-6 DXLG-TV TV-8 518.25 MHz Tandag PEC Broadcasting Corporation ==BARMM (Bangsamoro Autonomous Region in Muslim Mindanao)== ===Lanao del Sur=== Callsign Ch. # Freq. (MHz) Location Owner DXKC-TV TV-10 715.25 MHz Marawi Muslim Mindanao Radio and Television Currently broadcasting: TV5 DXRR-TV TV-13 373.25 MHz Marawi Ranao Radio Broadcasting and TV System Currently broadcasting: Ranao TV 13 ===Maguindanao=== Callsign Ch. # Freq. (MHz) Location Owner DXAA-TV TV-8 183.25 MHz Cotabato City People's Television Network D-10-TE-TV TV-10 684.25 MHz Cotabato TV5 Network, Inc. Currently broadcasting: TV5 DXMC-TV TV-12 317.25 MHz Cotabato City GMA Network Inc. Currently broadcasting: GMA DXMB-TV TV-27 429.25 MHz Cotabato City GMA Network, Inc. Currently broadcasting: GTV DXNC-TV TV-40 684.25 MHz Cotabato Nation Broadcasting Corporation Currently broadcasting: One Sports ===Sulu=== Callsign Ch. # Freq. (MHz) Location Owner DXLS-TV TV-12 493.25 MHz Jolo GMA Network, Inc. Currently broadcasting: GMA Network DXGP-TV TV-26 96.25 MHz Jolo GMA Network, Inc. Currently broadcasting: GTV ==Related pages== *Television in the Philippines ==References== Category:Philippine television-related lists",
 "title": "List of television stations in the Philippines"
}