{
 "id": "410846",
 "text": "Lee Daniels' The Butler is a 2013 American historical drama movie directed by Lee Daniels. It is based on Eugene Allen, who was a White House butler during eight American presidencies from 1952 to 1986. It was the last movie produced by Laura Ziskin. ==Synopsis== The fictional Cecil Gaines is based on Eugene Allen who worked at the White House during eight presidential terms from 1952 to 1986. He started as a \"pantry man,\" was promoted to butler, and then Maître d'hôtel. ==Cast== * Forest Whitaker as Cecil Gaines. Aml Ameen portrays a young Cecil Gaines * Oprah Winfrey as Gloria Gaines * Cuba Gooding, Jr. as Carter Wilson * Terrence Howard as Howard * David Oyelowo as Louis Gaines * Vanessa Redgrave as Annabeth Westfall * Alex Pettyfer as Thomas Westfall * Mariah Carey as Hattie Pearl * Yaya DaCosta as Carol Hammie * Colman Domingo as Freddie Fallows * Clarence Williams III as Maynard ===Historical figures=== * Robin Williams as President Dwight D. Eisenhower * Melissa Leo as First Lady Mamie Eisenhower (scenes deleted) * James Marsden as President John F. Kennedy * Minka Kelly as First Lady Jackie Kennedy * Liev Schreiber as President Lyndon B. Johnson * Wanda Leigh as First Lady Lady Bird Johnson (scenes deleted) * John Cusack as President Richard Nixon * Alan Rickman as President Ronald Reagan * Jane Fonda as First Lady Nancy Reagan * Nelsan Ellis as Martin Luther King, Jr. * Alex Manette as White House Chief of Staff H. R. Haldeman * Lenny Kravitz as James Holloway * Marco St. John as Chief Justice Warren E. Burger * Jesse Williams as civil rights activist James Lawson * Ray Gaspard as Pat Buchanan * Orlando Eric Street as President Barack Obama (scenes deleted) ==Awards== Awards Award Category Recipients and nominees Result Hollywood Film Awards Best Director Lee Daniels Hollywood Film Awards Spotlight David Oyelowo People's Choice Awards Favorite Dramatic Movie People's Choice Awards Favorite Dramatic Movie Actress Oprah Winfrey Phoenix Film Critics Society Best Actress in a Supporting Role Oprah Winfrey Screen Actors Guild Award Outstanding Performance by a Cast in a Motion Picture Screen Actors Guild Award Outstanding Performance by a Male Actor in a Leading Role Forest Whitaker Screen Actors Guild Award Outstanding Performance by a Female Actor in a Supporting Role Oprah Winfrey Satellite Awards Best Actor in a Motion Picture Forest Whitaker Satellite Awards Best Actress in Supporting Role Oprah Winfrey Satellite Awards Best Art Direction & Production Design Diane Lederman, Tim Galvin ==References== ==Other websites== * Category:2013 movies Category:African-American movies Category:American drama movies Category:2010s historical movies Category:Movies set in Washington, D.C. Category:Movies set in Louisiana Category:Movies set in California Category:Movies about John F. Kennedy Category:Movies about Ronald Reagan",
 "title": "The Butler"
}