{
 "id": "410852",
 "text": "Silvio Fazio (April 9, 1952 - May 9, 2024) was an Italian writer. He was born in Rome, Italy. ==Biography== Fazio graduated from accounting at the Institute Sandro Botticelli in Rome. He left Italy in 1977 to live in Nice, France. Fazio was the union representative for Workers' Force Ouvrière, from 2002 to 2010. In 2002 he signed the agreement for a reduction in working hoursNews France Television 12/07/2002 for two hotels on the French Riviera. In 2006, Silvio Fazio published his first science fiction novel: Il Segreto della grande porta. In 2010 he wrote the biography of Richard Ramirez, the Night Stalker, Il Profeta di Satana. In 2012, the author released Où les Dieux vont mourir (French), that challenges the official interpretation given by the FBI after the massacre at Columbine High School and in two documentary films, Bowling for Columbine (Michael Moore) and Elephant (Gus Van Sant). On April 6, 2009 the writer survives the terrible earthquake in Abruzzo (l’Aquila) and harshly criticized the Italian government for its deficiency of efficacy in the relief efforts for the victims. The author doesn't like the society gossip column and he declines any International Book Fair that he considers not- literary conventions. Fazio wrote some shorts novels for anthologies for Perrone Publisher and, sometimes, he use pseudonyms. Fazio died on May 9, 2024 in Nice, France, one month after his 72nd birthday. ==Published works== === Fiction === * 2006 : Il segreto della grande porta (Aletti) * 2007 : I labirinti di Zeus (Aletti) * 2007 : Tra l'alba e il tramonto (Aletti) * 2007 : La diligenza della verità (UniService) * 2007 : L'antro del mai (Phasar) * 2008 : Un grido nell'acqua (Boopen) * 2008 : Beelzebul (Boopen) * 2008 : Le torri del male (Boopen) * 2010 : Il Profeta di Satana (Stampa Alternativa) * 2012 : Où les Dieux vont mourir (Edilivre) === Shorts Novels for Giulio Perrone Publisher === * 2008 : La vita che vorrei pseudonym Silvio Rotti * 2008 : Vivo per lei * 2009 : Sono nato un 9 aprile pseudonym Fabrizio Spampinato * 2009 : Lester pseudonym Claudio Nasica * 2009 : L'Isola del peccato pseudonym Massimo Russaiolo * 2009 : La carezza del male * 2009 : La Bussola * 2009 : Io un superbo? pseudonym Elena Spampinato ==References== ==Other websites== * Historical archives of the Botticelli school. * Video Où les Dieux vont mourir * Web article for the book Il Profeta di Satana * Article Voila.com about the Author * Google Books Category:2024 deaths Category:1952 births Category:Writers from Rome",
 "title": "Silvio Fazio"
}