{
 "id": "410858",
 "text": "A controlled-access highway is a highway designed to allow traffic to safely travel at fast speeds. They are known by various terms around the world. The name motorway is used in the United Kingdom, Ireland, New Zealand and some other Commonwealth nations. In North America and Australia, the name freeway is used. In Germany, they are called Autobahns. These kinds of highways can have 4 lanes or more. They carry many vehicles. They have no traffic-lights nor ground level intersections. All roads crossing the highway go over a bridge or a tunnel. Ramps connect the highways to smaller roads and other highways. The place where highways meet these roads are called junctions or interchanges. Places where cars can leave or enter the motorway are called exits. Many freeways do not allow slower traffic, such as bicycles and pedestrians, to enter them. Most controlled-access highways are divided with at least two lanes going each way, but they can be much wider in large cities. ==Gallery== Image:Autopista-Central-2.jpg|Autopista Central, Santiago, Chile Image:AutopistaLibertadores.JPG|Autopista Los Libertadores, (International Freeway) Santiago, Chile Image:Queensway east of Riverside Drive Ottawa.jpg|Highway 417 (The Queensway) in Ottawa, Ontario, Canada Image:376 east.jpg|Interstate 376 eastbound in downtown Pittsburgh, Pennsylvania, US Image:Motorväg_-_bild.jpg|International E-Road E6 E20 in southwest Varberg, Sweden Image:Old_Autobahn_DE.jpg|An older German Autobahn without an emergency lane Image:Lowry_Hill_Tunnel.jpg|Interstate 94 entering the Lowry Hill Tunnel in Minneapolis, Minnesota, US Image:Romania_A2_Freeway.jpg|A2 Motorway connecting the city of Bucharest with Constanta, Romania Image:Highway1-cassiar-southbound.jpg|British Columbia Highway 1 in Vancouver, British Columbia Image:Alessandria-L'autostrada_A-26-tratto_appenninico.jpg|The Italian Autostrada A26 while it enters a tunnel Image:Atlanta 75.85.jpg|The \"Downtown Connector\" (I-75 and I-85) in Atlanta, Georgia, United States, during rush hour == References == Category:Highways",
 "title": "Controlled-access highway"
}