{
 "id": "410993",
 "text": "The Internal Revenue Service (IRS) issues tax forms to people and organisations who pay tax in the United States. These documents are used by taxpayers to report information about their finances. This includes information about income, which is required by the Internal Revenue Code (IRC) in order to calculate how much tax must be paid to the federal government of the United States. There are over 800 forms. The best-known of these is Form 1040 used by individual people. == Types of forms == *Form 1040 is used by individual people. It is used to report their income, calculate how much tax they have already paid, and how much more they need to pay. These are issued every year, and each person must send the form back with their information written in. The forms are normally due by April 15 of the next year. *Form 990 provides the public with financial information about a specific organization. It is also used by government agencies to make sure organizations that do not have to pay tax (such as non-profit organizations) comply with the rules. By doing this, they make sure that these organizations are really not making any profits. *Form 1040NR is used by foreign workers who have earned income from the United States. *Informational returns report information to taxpayers to help them complete their own tax returns. They are prepared by employers and banks. Copies of them are also sent to the IRS. An example is Form 1098, which is used to report interest that a taxpayer has paid on his or her mortgage. *Several forms begin with the code W. Some examples of these include: **Form W-2 is used by an employer to report wages paid to employees. It also reports the tax that was deducted from those wages.See generally , 26 C.F.R. sec. 31.6051-1 and sec. 31.6051-2. Employers must complete a Form W-2 for each employee to whom they pay a salary or wage. An employer must mail out the Form W-2 to employees on or before January 31. This gives the employees about 2 months to finish their tax returns before the April 15 due date. **Form W-9 is used to request a taxpayer's identification number and certification. To apply for this, the taxpayer must give some basic information like name, marriage status, and social security number.Internal Revenue Code ยง 31.3406(h)-3 == References == == Other websites == * Internal Revenue Service Category:Taxation in the United States",
 "title": "IRS tax forms"
}