{
 "id": "411065",
 "text": "Soups have been made since ancient times. This page lists a selection of well- known soups from the various cuisines around the world. They are sorted by the type of soup. Some soups are served with large chunks of meat or vegetables left in the liquid; these are categorised below as \"chunky\". A broth is a flavoured liquid usually made from boiling a meat and bone or vegetable for a period of time in a stock. A common type of broth is consommé. A potage is a category of thick soups, stews or porridges. In some of them, meat and vegetables are boiled together with water until they turn into a thick mush. Bisques are creamy soups traditionally made with shellfish, but can be made with any type of seafood. The base of cream soups is dairy. Chowders are thick soups usually containing some type of starch. Coulis were originally meat juices, and now are thick purees. Some soups are only ever served cold, and other soups can be served cold as an option. Name Image Type Description Ajiaco Chunky A chicken soup from Colombia Avgolemono Chunky A soup made in Greece and Cyprus. It is made with chicken, rice, egg and lemon. Borscht Chunky A Ukrainian soup made with cabbage, beet and meat. Caldo verde Chunky A Portuguese soup made of minced kale and onion. Cazuela Chunky A South American and Spanish soup. It is made of a clear broth, rice, potato, squash or pumpkin, corn and chicken or beef. Pictured is an Ecuadorian Cazuela. Cock-a- leekie Chunky Leek and potato soup made with chicken stock, from Scotland. Corn flakes and milk Chunky A soup from the United States. It is made with corn flakes and milk. It can have sugar, nuts or fruit in it, too. Fufu and Egusi soup Chunky A traditional soup from Nigeria made with vegetables, meat, fish and ground melon seeds. Gomguk Chunky A Korean soup. It is made with various beef parts, such as ribs or oxtail. The broth of gomguk tends to have a milky colour. Goulash soup Chunky A Hungarian soup made with beef, pork, paprika, peppers, tomato, potato and onion. Gumbo Chunky A traditional African-American soup from Louisiana. It is thickened with okra pods. Hot and sour soup Chunky Soups from several Asian cuisines. All variations of the soup contain ingredients to make it both spicy and sour. Kharcho Chunky A Georgian soup of lamb, rice, vegetables and a highly spiced boullion. Kimchi Guk Chunky Korean Kimchi soup. Lagman Chunky A traditional Uzbek soup of pasta, vegetables, ground lamb and several spices. Leek soup Chunky A simple soup made from leeks. It is popular in Wales during St. David's Day. Lentil soup Chunky A soup popular in the Middle East and Mediterranean. Made of lentils. Matzah ball soup Chunky An Ashkenazi Jewish soup. It is a popular food at Passover. The Matzah ball dumplings are traditionally served in chicken broth. Menudo Chunky Mexican soup made of tripe, calf's feet, chilis and hominy. Minestrone Chunky Italian vegetable soup, with noodles. Miyeok guk Chunky Korean soup of seaweed. Mulligatawny Chunky Indian soup with meat, vegetables and spices. Barley soup Chunky Made of several varieties of onion barley, with chicken broth. Nettle soup Chunky A soup made from the shoots of the stinging nettle. It is popular in Scandinavia and eastern Europe Oxtail soup Chunky Oxtail soup is made with beef tails. There are at least five popular versions of oxtail soup, but none of them are related. These are from Korea, China, Indonesia, and the southern United States. Pozole Chunky Mexican thick soup made of pork or chicken meat and broth, hominy, onion, garlic, dried chilis and cilantro. Phở Chunky A Vietnamese beef or chicken soup. It is made with scallion, onion, ginger, coriander, basil, cinnamon, star anise, cloves and cardamom. Pumpkin Smooth or chunky Made from pumpkin. Pictured is a pumpkin cream soup. Ramen Chunky A Japanese soup made from flavoured broth, noodles, various meats like pork or lobster, onion and other various herbs (miso), and sometimes even corn. Samgyetang Chunky Korean chicken ginseng soup made with glutinous rice, jujubes, chestnuts, garlic and ginger. Snert Chunky A thick pea soup, eaten in the Netherlands as a winter dish. It is traditionally served with sliced sausage. Shchi Chunky A Russian cabbage soup. Shchav Chunky A sorrel soup in Polish, Russian and Yiddish cuisines. Sopa de res Chunky A traditional soup in El Salvador. Its main ingredient is beef shank. You can use any vegetable (for example: corn, carrot, potato, yuca). Solyanka Chunky A soup with pickled cucumbers, sausages, smoked meat. It is from Russia. Soto Chunky A group of soups from Indonesia. They are based on various spice pastes, broths and sometimes coconut milk. They are often named after the region they come from. Split pea Chunky A Canadian soup made usually from dried peas, such as the split pea. It is greyish-green or yellow in colour depending on the variety of peas used. Taco soup Chunky Made up of ingredients similar to those used inside a taco: ground beef, tomatoes, chopped green chilis, olives, onions, corn, beans and a packet of taco seasoning. Vegetarian versions do not include the ground beef. Tom Yum Chunky A Thai soup with lemongrass and coconut milk. It is sour. Tomato soup Smooth or chunky A traditional Hungarian and Polish soup made with tomato as the main ingredient. Tteokguk Chunky Korean tteok (rice cake) soup. Winter melon Chunky A Chinese soup, winter melon, filled with stock, usually chicken stock vegetables and meat, which has been steamed for a few hours. Żurek Chunky A Polish wheat soup with sausages often served in a bowl made of bread. Cold borscht Cold (chilled) A Lithuanian soup, usually made in summer time. It is based on beet. Cucumber soup Cold (chilled) A soup based on cucumbers, known in various cuisines. Gazpacho Cold (chilled) A Spanish soup made of pureed tomato and vegetables. Naengmyeon Cold (chilled) Korean buckwheat noodles in a tangy iced beef broth, raw cut vegetables, a slice of a pear, and often a boiled egg and/or cold beef. Okroshka Cold (chilled) Russian kvass-based vegetable and ham soup. Salmorejo Cold (chilled) Spanish tomato soup with garlic and bread crumbs. Sayur Asem Cold (chilled) An Indonesian soup that tastes sour and spicy. Sour cherry soup Cold (chilled) A cream-based Hungarian soup. Tarator Cold (chilled) A Bulgarian cold soup made from yoghurt and cucumbers. Vichyssoise Cold (chilled) A French-American creamy potato and leek soup, served with chives. Ginataan Dessert A Filipino soup made from coconut milk, milk, fruits and tapioca. It is served cold. Bouillabaisse Fish French fish soup Carp soup Fish A soup made with the head and organs of a carp. It also includes onion and vegetaple. Part of traditional Czech Christmas Eve dinner. Cioppino Fish Italian-American fish stew with tomatoes and a variety of fish and shellfish Fanesca Fish A traditional cod soup from Ecuador. Fisherman's soup Fish Hungarian spicy river-fish soup made with a lot of hot paprika. Lohikeitto Fish A Finnish soup made with salmon, potatoes (other root vegetables can be added such as rutabaga, carrots, onions), cream and dill. Mohinga Fish A traditional Burmese fish soup made of chickpea flour and/or crushed toasted rice, garlic, onions, lemongrass, banana tree stem, ginger, fish paste, fish sauce and catfish in a rich broth. Ukha or уха Fish Russian fish soup, made of cod or salmon, vegetables, lime, dill, parsley and black pepper. Waterzooi Fish A Belgian fish soup. Bird's nest soup Noodle A delicacy in Chinese cuisine. Beef noodle soup Noodle A Chinese noodle soup made of stewed or red braised beef, broth, vegetables and noodles. Chicken noodle soup Noodle A chicken soup that includes noodles, such as egg noodles. Egg drop soup Noodle A savoury Chinese soup made from cracking eggs into boiling water or broth. Phở Noodle Vietnamese noodle soup. Ramen Noodle Japanese fresh or dried noodles in broth. Pasta fagioli Noodle Italian noodle soup. Soto ayam Noodle A spicy soup from Indonesia. It has shredded chicken, with noodles, and a variety of garnishes. Avgolemono (Αυγολέμονο) Potage Greek soup made of lemon juice, rice, and egg yolk. Beer soup Potage A recipe from the Middle Ages using heated beer and pieces of bread, though other ingredients were also used. French onion soup Potage Broth made with onions and beef. Often topped with croutons and cheese. Panada Potage A soup made with leftover bread, eggs, beef broth and Parmigiano-Reggiano Cheese. Saxe-Coburg soup Potage A soup that was probably created for Queen Victoria's consort, Prince Albert, who came from Saxe-Coburg. Others claim it is named for their son, Edward VII. The soup is based on chicken stock, plus chopped Brussels sprouts, onion, and bits of smoky ham. When pureéd the soup turns a pale green. One recipe in Mrs Beeton's Book of Household Management suggests adding \"green colouring, if needed.\" Tinola Potage Broth popular in the Philippines made with pieces of chicken, sliced green papayas. Rasam Potage South Indian broth made in various ways using different spices and tamarind. Lobster bisque Bisque Lobster stew Bisque A cream or stock-based soup with chunks of lobster. Shrimp bisque Bisque New England clam chowder Chowders Made with potatoes and cream. Manhattan clam chowder Chowders Made with a tomato base. Corn chowder Chowders Chupe Chowders She-crab soup Chowders A creamy soup from South Carolina. It is made with crab meat and crab eggs. Consommé Clear or stock Consommé Alexandra Clear or stock A soup created by Auguste Escoffier. It is one of the many dishes named after Queen Alexandra. Two pints of chicken consommé thickened with some poached tapioca, strained through muslin. One tablespoonful of white chicken-meat, one tablespoonful of small chicken quenelles, and one tablespoonful of lettuce chiffonade are put into the soup tureen and the boiling consommé poured on. The dish was then sent to the table immediately. Consommé Brillat-Savarin Clear or stock A soup named after Jean Anthelme Brillat-Savarin. It is made by taking a basic chicken consommé and adding chicken breast and savoury pancakes, along with lettuce and sorrel chiffonade (strips) and chervil leaves. Consommé Princess Alice Clear or stock A soup dish named after Princess Alice, a granddaughter of Queen Victoria. It was created by Auguste Escoffier. It is made of artichoke hearts and lettuce, both shredded and cooked separately in butter plus cooked vermicelli pasta added to a basic clarified white consommé. Miso soup Fermented A traditional Japanese soup produced by fermenting rice, barley and/or soybeans. Sour rye soup Fermented A traditional Polish soup produced by fermenting rye and/or wheat flour. == Related pages == *Soup ==Notes== ==References== * Soups *",
 "title": "List of soups"
}