{
 "id": "411189",
 "text": "Hugh the Great or Hugues le Grand (895–16 June 956) was duke of the Franks and count of Paris. ==Early career== Hugh was the son of King Robert I of France and Béatrice of Vermandois.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Verlag von J. A. Stargardt, Marburg, Germany, 1984), Tafeln 10-11 She was the daughter of Herbert I, Count of Vermandois. Hugh was born in 895 in Paris, France. His eldest son was Hugh Capet who became King of France in 987.Jim Bradbury, The Capetians: Kings of France, 987-1328 (Hambledon Continuum, London & New York, 2007), p. 69 Hugh was a member of the family known as the Robertians.Lucien Bély, The History of France ( J.P. Gisserot, Paris, 2001), p. 21 ==Duke of France== In 922 the barons of western Francia revolted against the Carolingian king Charles the Simple. In his place they elected Robert I, Hugh's father, as King of Western Francia.Pierre Riché, The Carolingians; A Family who Forged Europe, Trans. Michael Idomir Allen (University of Pennsylvania Press, Philadelphia, 1993), p.250 Robert I died in battle at Soissons in 923. When Hugh refused the crown it went to his brother-in-law, Rudolph of France. Charles the simple asked his cousin Herbert II, Count of Vermandois for help in getting back his crown. But instead of helping the king he put him in prison. Herbert then used the threat of releasing his prisoner to get what he wanted. But Charles died in 929.Pierre Riché, The Carolingians; A Family who Forged Europe, Trans. Michael Idomir Allen (University of Pennsylvania Press, Philadelphia, 1993), pp.250-1 From then on Hugh the great, acting for King Rudolph, had to struggle with Herbert II. Finally Rudolph and Herbert II came to an agreement in 935. At the death of King Rudolph in 936, Hugh possessed nearly all of the region between the Loire and the Seine. This was the same territory as Neustria with the exceptions of Anjou and of Normandy.Elizabeth M. Hallam, Capetian France; 987-1328 (Longman Group Ltd., London & New York, 1980), p. 89 Hugh was one of those who brought Louis IV (d'Outremer) from the Kingdom of England in 936.The Annals of Flodoard of Reims: 919-966, Ed. & Trans. Stephen Fanning & Bernard S. Bachrach (University of Toronto Press, 2011), p. xvii In 937 Hugh married Hedwige of Saxony, a daughter of Henry I the Fowler of Germany and Matilda of Ringelheim.Pierre Riché, The Carolingians; A Family who Forged Europe, Trans. Michael Idomir Allen (University of Pennsylvania Press, Philadelphia, 1993), p.262 Very soon however Hugh was quarrelling with King Louis. In 939 king Louis attacked Hugh the Great and William I, Duke of Normandy. But soon after they made a truce which lasted until June.The Annals of Flodoard of Reims; 919-966, Ed. & Trans. Steven Fanning & Bernard S. Bachrach (University of Toronto Press, 2011), p. 31 That same year Hugh, along with Herbert II of Vermandois, Arnulf I, Count of Flanders and Duke William Longsword paid homage to the Emperor Otto the Great. They supported him in his struggle against Louis.The Annals of Flodoard of Reims; 919-966, Ed. & Trans. Steven Fanning & Bernard S. Bachrach (University of Toronto Press, 2011), p. 32 When Louis fell into the hands of the Normans in 945, he was handed over to Hugh in exchange for their young duke Richard.David Crouch, The Normans (Hambledon Continuum, London & New York, 2007), p. 16 Hugh released Louis IV in 946 but made him surrender the fortress of Laon.Jim Bradbury, The Capetians: Kings of France, 987-1328 (Hambledon Continuum, London & New York, 2007), p. 40 In 948 at a church council at Ingelheim the bishops excommunicated Hugh even though he was not there.Jim Bradbury, The Capetians: Kings of France, 987-1328 (Hambledon Continuum, London & New York, 2007), p. 41 Hugh's response was to attack Soissons and Reims. Hugh finally changed his mind and made peace with Louis IV, and the church. When Louis IV died Hugh was one of the first to recognize Lothair as his successor. For helping to have him crowned the new king gave Hugh Burgundy and Aquitaine.Jim Bradbury, The Capetians: Kings of France, 987-1328 (Hambledon Continuum, London & New York, 2007), p. 42 In the same year Giselbert, Duke of Burgundy acknowledged Hugh as his overlord and gave his daughter in marriage to Hugh's son Otto-Henry. On 16 June 956 Hugh the Great died in Dourdan. ==Family== In 922 Hugh married Judith, the daughter of Roger, Count of Maine and Rothilde. She died childless in 925. Hugh's second wife was Eadhild, daughter of Edward the Elder, king of the Anglo-Saxons. They married in 926 and she died in 938, childless. Hugh's third wife was Hedwig of Saxony, daughter of Henry the Fowler and Matilda of Ringelheim. She and Hugh had: * Beatrice, married Frederick I, Duke of Upper Lorraine. * Hugh Capet.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Verlag von J. A. Stargardt, Marburg, Germany, 1984), Tafel 11 * Emma.(-aft. 968). * Otto, Duke of Burgundy, a minor in 956. * Odo-Henry I, Duke of Burgundy (d. 1002). ==References== Category:890s births Category:950s deaths Category:Dukes and duchesses of France",
 "title": "Hugh the Great"
}