{
 "id": "411350",
 "text": "Takao Yoshida (born October 26, 1973) is a Japanese professional wrestler and former mixed martial artist who is currently working for New Japan Pro Wrestling under the ring name, Taka Michinoku. ==Career== Michinoku has competed for many professional wresting companies during his career including Extreme Championship Wrestling (ECW), CMLL, World Wresting Federation (WWF), Kaientai Dojo and All Japan Pro Wrestling. During his time in the WWF, Michinoku became the first ever WWF Light Heavyweight Champion when he defeated Brian Christopher at D-Generation X: In Your House. He was also known for his time in the stable Kai En Tai with Sho Funaki. Michinoku faced Keiichiro Yamamiya at Pancrase: Alive 4 on April 27, 1997 but was defeated 7:36 in the first round from submission by keylock. ==Championships== *All Japan Pro Wrestling **AJPW World Junior Heavyweight Championship (one time) *El Dorado Wrestling **UWA World Trios Championship (one time) (with Francis Togo and Antonio Honda) *Frontier Martial Arts Wrestling **FMW Independent World Junior Heavyweight Championship (two times) *Independent Wrestling World **IWW Junior Heavyweight Championship (one time) *Kaientai Dojo **FMW/WEW Hardcore Tag Team Championship (one time) (with TOMO Michinoku) **Independent World Junior Heavyweight Championship (one time, current) **Strongest-K Championship (two times) **Strongest-K Tag Team Championship (three times) (with Handsome Joe (two) and Kengo Mashimo (one)) **UWA/UWF Intercontinental Tag Team Championship (one time) (with Ryota Chikuzen) **UWA World Middleweight Championship (one time, current) **Strongest-K Tournament (2007) *Michinoku Pro Wrestling **Tohoku Junior Heavyweight Championship (one time) *New Japan Pro Wrestling **IWGP Junior Heavyweight Tag Team Championship (one time) (with Dick Togo) *Pro Wrestling Illustrated **He was ranked #191 of the 500 best singles wrestlers by PWI during the \"PWI Years\" in 2003. *Tokyo Sports Grand Prix **Best Technical Wrestler (2005) *World Entertainment Wrestling **WEW Six Man Tag Team titles (one time) (with Gosaku Goshogawara and Tetsuhiro Kuroda) *World Wrestling Federation **WWF Light Heavyweight Championship (one time) == References == ==Other websites== *Taka Michinoku on New Japan Pro Wrestling * Category:1973 births Category:Living people Category:Former WWE wrestlers Category:Japanese professional wrestlers Category:Professional wrestling executives Category:Sportspeople from Chiba Prefecture",
 "title": "Taka Michinoku"
}