{
 "id": "41153",
 "text": "Adenosine triphosphate (ATP) is a chemical. All living things make ATP to store energy and to move it to the cells that need it. Cells get all their energy from ATP. They break ATP molecules apart to use the stored energy. The harder a cell works, the more ATP it needs. == Use == The ATP molecule is very versatile: it is used for many chemical reactions in the body. Energy is stored in its chemical bonds. The energy that is stored can be used later. When ATP breaks a bond with a phosphate group and becomes ADP, energy is released. This is an exothermic reaction. The ATP phosphate exchange is a nearly never-ending cycle, stopping only when the cell dies. === Functions in cells === ATP is the main energy source for most cellular functions. This includes the synthesis of macromolecules. It is used in DNA and RNA. ATP also helps macromolecules get across cell membranes. === DNA and RNA synthesis === In all known organisms, DNA is made by the action of ribonucleotide reductase (RNR) enzymes. These enzymes reduce the sugar residue from ribose to deoxyribose by removing oxygen. ATP is one of the four nucleotides put into RNA molecules by RNA polymerases. The energy driving this polymerization comes from cutting off two phosphate groups. The process is similar in DNA biosynthesis. == History == * ATP was discovered in 1929 by Karl Lohmann and Jendrassik and, independently, by Cyrus Fiske and Yellapragada Subba Rao of Harvard Medical School. Both teams were competing against each other to find an assay (way of measuring) for phosphorus. * ATP was proposed to be the intermediary between energy-yielding and energy-requiring reactions in cells by Fritz Albert Lipmann in 1941. * ATP was first synthesized (created) in the laboratory by Alexander Todd in 1948. * The Nobel Prize in Chemistry 1997 was split, one half given to both Paul D. Boyer and John E. Walker for their elucidation of the enzymatic mechanism underlying the synthesis of adenosine triphosphate (ATP) and the other half to Jens C. Skou for the first discovery of an ion-transporting enzyme, Na+, K+ -ATPase. == References == Category:Cellular respiration Category:Organonitrogen compounds Category:Phosphates",
 "title": "Adenosine triphosphate"
}