{
 "id": "411543",
 "text": "Richard III (997/1001 – 6 August 1027) was the Duke of Normandy. His short reign of one year opened with a rebellion by his younger brother Robert I and ended with his death. == Early career == Richard III was the oldest son of Richard II, Duke of Normandy and his wife Judith of Brittany.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band III, Teilband 1 (Marburg, Germany: J. A. Stargardt, 1984), Tafel 79 He was born . Around the year 1020, Richard's father sent him in command of a large army to rescue his brother-in-law, Reginald I, Count of Burgundy.François Neveux, A Brief History of the Normans, trans. Howard Curtis (Constable & Robbinson, Ltd, London, 2008), pp. 97-8 It was a distance of about 250 miles (400 kilometers) from Normandy.Reginald was being held prisoner by Bishop Hugh of Auxerre.François Neveux, A Brief History of the Normans, trans. Howard Curtis (Constable & Robbinson, Ltd, London, 2008), pp. 97-8 Richard III's capture of the castle of Minamde was enough to convince Bishop Hugh to surrender and release Reginald. When his father died in August of 1026, as the oldest son, Richard III succeeded him as Duke of Normandy.François Neveux, A Brief History of the Normans, trans. Howard Curtis (Constable & Robbinson, Ltd, London, 2008), p. 98 By all accounts Richard III was accepted by the barons of Normandy and had no problems accepting his new role as duke. Richard III had given his younger son, Robert, the town of Exmes and the county of Hiemois.David Crouch, The Normans: The History of a Dynasty, (Hambledon Continuum, 2007), p. 46 But once Richard III became duke, his younger brother Robert was not satisfied. He raided the diocese of his uncle Robert II, Archbishop of Rouen. He also captured his brother's fortress city of Falaise. Robert's rebellion lasted through the end of 1026 and into early 1027.David C. Douglas, William the Conqueror (Berkeley & Los Angeles: University of California Press, 1964), p. 32 Finally Richard III laid siege to Falaise and brought the walls down. Robert surrendered and promised to be faithful. Richard III then took the next step; he arranged with king Robert II of France to marry his young daughter, Adelis. She was given rich dowry which included the city and county of Coutances. Even though he was now newly married to a king's daughter, he already had children by a concubine. But unexpectedly Richard III died on 5 or 6 August 1027. He had a son named Nicholas, but the boy was immediately sent to the monastery at Fécamp. With Nicholas out of the way the duchy passed to his Richard III's younger brother Robert, who became the sixth duke of Normandy as Robert I. ==Marriage== In January of 1027 he was married to AdelaDetlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band III, Teilband 1 (Marburg, Germany: J. A. Stargardt, 1984), Tafel 11 a younger daughter of Robert II of France and Constance of Arles. After Richard's death Adela secondly married Baldwin V, Count of Flanders. ==Issue== By his wife Adela he had no children. By an unknown concubine he had at least two children: * Alice/Alix of Normandy who married Ranulph, Viscount of Bayeux. * Nicolas, Monk at Fécamp, Abbot of Saint-Ouen, Rouen (died 26 Feb 1092) ==References== Category:990s births Category:1027 deaths Category:Dukes and duchesses of Normandy",
 "title": "Richard III, Duke of Normandy"
}