{
 "id": "411665",
 "text": "A celestial coordinate system is a coordinate system that helps astronomers specify the location of objects in the sky. These objects may be stars, planets or even satellites. There are several such coordinate systems listed below. All of them are spherical. The fundamental plane divides the celestial sphere into two equal hemispheres and defines the baseline for the latitudinal coordinates, similar to the equator in the geographic coordinate system. The poles are located at ±90° from the fundamental plane. The primary direction is the starting point of the longitudinal coordinates. == Coordinate systems == These are common coordinate systems used by the astronomical community: === Horizontal system === The horizontal system is based on the position of the observer on Earth. It is a useful coordinate system for finding and tracking objects for observers on Earth. It is based on the position of stars relative to an observer's true or ideal horizon. === Equatorial system === The equatorial coordinates are based on the position of stars relative to the Earth's equator. Imagine the Earth's equator extended out to an infinite distance. The equatorial describes the sky as seen from the solar system. Modern star maps almost exclusively use equatorial coordinates. === Eclyptic system === The fundamental plane is the plane of the Earth's orbit, also called the ecliptic plane. There are two versions: the geocentric ecliptic coordinates centred on the Earth, and heliocentric ecliptic coordinates centred on the centre of mass of the solar system. The geocentric ecliptic system was the principal coordinate system for ancient astronomy and is still useful for computing the apparent motions of the Sun, Moon, and planets.Aaboe, Asger. 2001 Episodes from the early history of Astronomy. New York: Springer- Verlag, p 17–19. The heliocentric ecliptic system describes the planets' orbital movement around the Sun, and centres on the barycenter of the solar system. This is very close to the centre of the Sun). The system is mainly used for computing the positions of planets and other solar system bodies, and their orbits. === Galactic system === The galactic coordinate system uses the approximate plane of our galaxy as its fundamental plane. The solar system is still the centre of the coordinate system, and the zero point is defined as the direction towards the galactic centre. 'Galactic latitude' means, roughly, the elevation above the galactic plane. 'Galactic longitude' is the direction relative to the centre of the galaxy. === Supergalactic system === The supergalactic coordinate system is a fundamental plane with a higher than average number of local galaxies in the sky as seen from Earth. == Software == There is standard software which does the calculations: *NOVAS: Naval Observatory Vector Astronomy Software. *IAU Standards of Fundamental Astronomy. Coordinate system Center point (origin) Fundamental plane (0° latitude) Poles Coordinates Primary direction (0° longitude) Latitude Longitude Horizontal (also called - or -az) Observer Horizon Zenith, nadir Altitude (a) or elevation Azimuth (A) North or south point of horizon Equatorial Center of the Earth(geocentric), or Sun(heliocentric) Celestial equator Celestial poles Declination (\\delta) Right ascension (\\alpha) or hour angle (h) Vernal equinox Ecliptic Ecliptic Ecliptic poles Ecliptic latitude (\\beta) Ecliptic longitude (\\lambda) Galactic Center of the Sun Galactic plane Galactic poles Galactic latitude (b) Galactic longitude (l) Galactic center Supergalactic Supergalactic plane Supergalactic poles Supergalactic latitude (SGB) Supergalactic longitude (SGL) Intersection of supergalactic plane and galactic plane == References == Category:Coordinate systems Category:Astronomy",
 "title": "Celestial coordinate system"
}