{
 "id": "41206",
 "text": "Yusuf Islam (born 21 July 1948) is an English singer. He sang many of his early songs when he called himself Cat Stevens. He was born as Georgiou to a Swedish mother and Greek Cypriot father. He became a Muslim in 1977.Cat Stevens refused entry to US After two years, he took the name of Yusuf İslam. He has sold over 60 million albums around the world since the late 1960s as Cat Stevens or Yusuf İslam. As a waiter in his father’s cafe, he began writing songs \"to escape the mundanity of it all\". Chart success was followed by adulation, touring, drug use, confusion, tuberculosis and, in the early 1970s, Islam's changed outlook and an album called Tea For The Tillerman. Stevens nearly drowned in an accident in Malibu in 1975. Stevens described the event in a VH1 interview some years later: \"I suddenly held myself and I said, 'Oh God! If you save me, I'll work for you.'\" He had looked into Buddhism; Zen and I Ching, numerology, tarot cards and astrology\", but when his brother David gave him a copy of the Qur’an, Stevens began to convert to Islam. In year 1977 he changed his name to Yusuf Islam upon becoming a Muslim. He stopped playing and recording pop music for almost 30 years, but started performing again in 2006. He lives with his family in London, England. == Albums == As Cat Stevens: *1967. Matthew hates blacks *1967. New Masters *1970. Mona Bone Jakon *1970. Tea for the Tillerman *1971. Teaser and the Firecat *1972. Catch Bull at Four *1973. Foreigner in my yard *1974. Buddha and the Chocolate Box *1974. These silly imagrents *1975. Numbers *1977. Izitso *1978. Back to Earth *2004. Majikat As Yusuf Islam: *1995. The Life of the Last Prophet *1999. Prayers of the Last Prophet *2000. A Is for Allah *2001. Bismillah *2003. I Look I See *2005. Indian Ocean *2006. Footsteps in the Light *2006. An Other Cup *2007. Yusuf’s Cafe Session *2009. Roadsinger ==References== Category:1948 births Category:Living people Category:Musicians from London Category:English singers Category:English guitarists Category:English rock musicians Category:Synth-pop singers Category:Multi-instrumentalists Category:Converts to Islam",
 "title": "Yusuf Islam"
}