{
 "id": "412162",
 "text": "Sung Jae-ki (; 成在基, 11 September 1967 – 26 July 2013) was a South Korean human- and civil-rights activists, Liberalism thinkers. From 2008 to 2013, he was the first leader of 'Man of Korea' (), a men's rights and men's liberalism civic group. he was abolition activity of ministry of woman. He was early leaders of South Korean Men's liberation movements, In 1999 to 2013, he actively participated in liberalism movement, gender liberation movement, anti-feminist movement until his death. he was devoted to male liberation and male right advocacy. also he was Men's shelter and Crime victims male rescue activities. In 2013, himself off under Mapo Bridge. because his debt for $200 million.Suicide performance and journalist ethics News Dongah nickname was Shimheon(심헌 審軒) and Shimheon(심헌 心軒), 'Chungjuk(청죽 靑竹), Chinise name was Imsung(임성 臨聖). penname was Bluewolf(푸른 늑대 靑狼), Tongbalbass(똥발바쓰), Tongball(똥발). == Life == Sung was born Hyomokdong in Daegu. he was studying Daeryun middle school, Daeryun high school and Yeungnam University(1985-1993). In 1987 until 1990, he served in the army, 11th Infantry Division, at Dongsong town, cheolwon in Province Gangwon. In his early years, he was a business man. after 2000 to November 2006, he was Operate Thomas MacFly consulting & headhunting company(토마스 맥플라이 컨설팅 & 헤드헌팅),investment-entrepreneurship and headhunting company in Daegu and Busan, Seoul. In 1990s, he was to Controversy, Oppositions of South Korean feminists, feminist movements. In 1999 to 2013, he was take part activity of anti-feminism movement and masculinity movement, libertarian movements. In October until December 1999, he was joint to the movement against to abolition of hojuje(호주제 폐지). hojuje was setting is one representative of the family was this family's one husband or fathers. In 2001, he joined the human- and civil-rights movements. On 26 December 2006 he joined the anti-feminism men's liberation club. In 2008, he joined a men's rights movement club. In 2008, more civic groups, feminists of South Koreas were against for two children's custody of Seong-Min Cho, Divorced famouse baseball player of South Korea. reason was violence of Cho's. Sung was only Advocacy to Seong-Min Cho, Sung was said Cho was two child's father and only living parents. In 2001 to 2013 Sung Jae-ki was abolition activity of ministry of woman. he was a leader of Men's Association, a human right group, 2008 to 2013. He argued for the abolition of the Ministry of Woman (Ministry of Gender Equality). He also argued for men's rights, sexual liberal, mens liberations. but that during his debt for $200 million. He was his life was devoted entirely to the movement of liberation movements liberalism Gender and Korean, and made it possible to introduce improvements on all male rights, offer of male shelter and Protective Facility. but criticism and prejudice Along with debt, in marked the biggest setback. In 2011 he was opened to temporary accommodation at Yengdeungpo and Samsung-Dong at Gangnam, Victims Men of Domestic Violence. it's burden of expenses is personal expense. also his temporary accommodation of Victims Men of Domestic Violence was accept to gay, male transgender people. some South Korean gay and transgender people was kicked out of there house. In 2011 - 2013 he was given protection of Crime Victims Male, Youth Runaway and street children. also accept of homeless, gay, and transgender people. his life was devoted entirely to sexual Liberation Movement and liberalism Movement of Korean. he was support to possible improvements in Male human rights and offer of shelter and refuge of male. in 2013, he was in debt collectors. July 26, he was jumping suicide of bridge railing for han river.South Korean channel films suicide that he was the last said, \"Male is a human!(남자도 사람이다.)\" 3days later, his body was found at Mapo Bridge, in Seoul. burial was Gyongsan park cemetery. == Related pages == * Man of Korea * Han Seung-oh * Han Chi-hwan == Sources == * Kim Yong-suk: The Ddanji December, 2012. The ddanji group, 2012 == Site link == * Activist's 'suicide' causes huge stir Koreatimes 2013.07.26 * * MHRA Sung Jae-gi dead A-Voice of Man == Other websites == * 남성연대 * Sung Jae-ki twitter * '이기적 여성들'에 일침…성재기, 대체 누굴까? * '성매매 안하면 현금준다?' 캠페인 논란 * 그는 왜 여성부 폐지에 '목숨'을 걸었나? 머니투데이 2012.01.04 * Suicide performance and journalist ethics News Dongah * Grabación de un suicidio en Corea del Sur abre el debate sobre la ética de los medios de comunicación * Activista Sung Jae-ki se suicidó frente a las cámaras de televisión Category:1967 births Category:2013 deaths Category:Anti- communists Category:South Korean autobiographers Category:South Korean businesspeople Category:Civil rights activists Category:South Korean human rights activists Category:philosophers Category:South Korean politicians Category:liberalism Category:Suicides by drowning",
 "title": "Sung Jae-ki"
}