{
 "id": "41244",
 "text": "An oil well is a well to get petroleum from the ground. People in the petroleum industry look for a place that might have oil. They drill a hole deep in the ground and, if the oil is there, then pump it up from the hole. Most oil is very deep underground. == History == More than 5,000 years ago, ancient people like the Sumerians, Assyrians, and Babylonians, used things like crude oil, bitumen, and asphalt from places like Tuttul (now called Hīt) on the Euphrates River. They used these substances for lots of things. The Egyptians were the first to use liquid oil as a kind of medicine, probably for healing wounds, as a rub for sore muscles, and to help with digestion. The Assyrians, on the other hand, used bitumen as a punishment by pouring it over people who broke the law. In ancient times, oil and its products were also important for fighting wars. The Persians, for example, used arrows soaked in oil to set things on fire during battles. Later, people in places like Arabia and Persia learned to make flammable stuff from crude oil for military use. This knowledge eventually spread to Europe, likely because of the Arab invasion of Spain, and by the 12th century, Europeans were learning how to turn oil into things that could light up the darkness. A few hundred years later, Spanish explorers found oil coming out of the ground in places like Cuba, Mexico, Bolivia, and Peru. In North America, there were also lots of places where oil would naturally seep out of the ground. Early explorers in what's now New York and Pennsylvania noticed this, and even American Indians were known to use the oil for medicine. Oil wells can be classified by purpose: * Production wells produce gas or oil. * Appraisal wells determine the characteristics of a hydrocarbon accumulation. * Exploration wells explore for new oil and gas. * Wildcat wells explore areas which are not near known gas or oil fields. Active wells can also be categorized as: * Oil producers may produce some gas, but they primarily produce liquid hydrocarbons. * Gas producers primarily produce gaseous hydrocarbons and aquifer producers primarily produce water to for the purpose of re-injecting it into the ground to manage the pressure of gas or oil wells. * Water injectors inject the water that is removed from the aquifer producers, as well as disposal of any water obtained during gas or oil production. * Gas injectors inject gas into reservoirs to maintain the reservoir’s pressure, as well as for disposal and sequestering of gas that cannot be immediately used. Wells may be straight holes, or directionally drilled: * Straight(vertical) holes wells are those drilled to targets essentially beneath the surface location of the well, although some small deviation in the well bore can occur during the drilling process. * Directionally drilled wells are those which are drilled to targets not directly beneath the surface location of the well. Directionally drilled wells can be classified further into Straight kick, S- kick and horizontal wells. ** In straight kick wells, the well bore is deviated until the desired angle is achieved. This angle is maintained all the way to the bottom of the hole. ** In S-kick wells, the well bore is deviated to achieve the desired horizontal displacement and then returns to a vertical direction before penetrating the producing zone. The term \"S-kick\" is derived from the shape of the course. ** Horizontal wells, as the name implies, are deviated until the well bore achieves a horizontal direction. The well bore may then continue in the horizontal direction for hundreds or even thousands of feet, depending on results desired. == References == Category:Petroleum",
 "title": "Oil well"
}