{
 "id": "412639",
 "text": "The Mac App Store is an application that lets Apple Macintosh users download other applications (\"apps\") to their computer. In June 2013, the Mac App Store had more than 15,300 applications. ==History== The store was announced by Apple on October 20, 2010 alongside OS X Lion. People were able to send the apps they had made to Apple from November 3, 2010 so they would be included in the App Store when it was released. The Mac App Store was released on January 6, 2011 as an update to all users using the newest version of OS X. After 24 hours of release, Apple announced that there was a total of more than one million downloads. It launched with over 1000 programs on January 6, 2011, including Apple's own \"Work '09\", \"iLife '11\", \"Aperture\" and apps made by other companies that were first made for the iPhone and iPad, such as Angry Birds, Flight Control, and Twitter for Mac. Most of the apps were games. Angry Birds, a popular video game on the iOS App Store, was the number one paid app on the Mac App Store on the first day. ==Regulations== Before an app is added to the store, it is first checked by Apple to make sure it is a useful app and does not break any of the App Store rules. Apps in the store are not allowed to: * Change the way macOS looks or works. * Look different to the way a Mac app usually looks. * Copy the purpose of one of Apple's apps. * Copy software that is already in the store without improving it. * Display pornographic material. * Purposely stop working after a while (expire). * Not work with the latest version of macOS. * Be a trial, test, demo or beta (unfinished) version of the software. * Reference a trademark without permission. * Use Java (unless bundled into an app). * Use PowerPC code requiring Rosetta. ==Usage by Apple== Apple regularly uses the store to sell its own software. Some examples of software provided by Apple through the App Store are: * OS X Updates - starting with OS X Lion, all OS X and Server updates have been sold through the App Store. * iWork - Apple's productivity apps. * iLife - Apps that allow users to store and edit photos, videos and music. * iBooks Author - for users to create iBooks. * Xcode - so people can make apps. * Aperture - Apple's professional photo editing app. * Final Cut Pro - Apple's professional video editing app. * Logic Pro X - Apple's professional music editing app. * Apple Remote Desktop - allows people to control their computer from any Mac. ==Related pages== * App Store (iOS) ==References== ==Other websites== * Category:Apple software",
 "title": "Mac App Store"
}