{
 "id": "412769",
 "text": "Count of Anjou was a title first given to Ingelger.Bernard S. Bachrach, Fulk Nerra, the neo-Roman consul, 987-1040 (Berkeley: University of California Press, 1993), p. 4 His male line ended with Geoffrey II of Anjou. The next line of counts of Anjou were descended from Geoffrey's sister Ermengarde- Blanche and her husband Geoffrey II, Count of Gâtinais.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 82 Their descendants include the Plantagenet kings of England.Kate Norgate, England under the Angevin Kings, Vol. I (London ;New York Macmillan and Co. 1887), p. 3 == Counts of Anjou == === House of Ingelger === * Ingelger (died ) * Fulk I 'the Red' (929–942) * Fulk II 'the Good' (942–960) * Geoffrey I 'Greymantle' (958–987) * Fulk III 'Nerra' (987–1040) * Geoffrey II 'Martel' (1040–1060)The countship passed through his sister Ermengarde-Blanche of Anjou to his nephew Geoffrey III below: === Angevins and Plantagenets === * Geoffrey III 'the Bearded' (1060–1067) * Fulk IV 'le Rechin' (1067–1096), (1106–1109) * Geoffrey IV 'Martel' (1096–1106) * Fulk V 'le June' (1109—1143), Count of Anjou, Maine and King of Jerusalem (1131–1143) * Geoffrey V 'Plantagenet' (1129–1151), Count of Anjou, Maine and Duke of Normandy (1144–1150) * Henry II 'Curtmantle' (1150–1189), Duke of Normandy (1151-1189), King of England (1154–1189) * Richard I 'Lionheart' (1189–1199), King of England (1189–1199) * Arthur I (1199–1203) In 1204, Anjou was lost to king Philip II of France. It was re- granted as an appanage for Louis VIII's son John. He died in 1232 at the age of thirteen. Anjou was then given to Louis's youngest son, Charles. He later became the king of Sicily. === Capetian dynasty === ==== Capetian House of Anjou ==== * Charles I (1246–1285), King of Sicily, King of Jerusalem, Count of Maine, of Provence, of Forcalquier * Charles II (1285–1290) * Margaret I (1285–1299) In 1290, Margaret married Charles of Valois, the younger brother of king Philip IV of France. He became Count of Anjou in her right. ==== House of Valois ==== * Charles III (1270–1325), count of Valois * Philip I (1293–1350), Philip the Fortunate, count of Maine, of Valois * John II (1319–1364), John the Good * Louis I (1339–1383) ==References==",
 "title": "Count of Anjou"
}