{
 "id": "412804",
 "text": "The arrondissement of Céret is an arrondissement of France; it is the southermost arrondissement of Metropolitan France. It is part of the Pyrénées- Orientales département. Its capital is the city of Céret. The arrondissement of Céret is in the southeast of the department; it is the southernmost arrondissement of France. ==History== When the Pyrénées-Orientales department was created on 17 February 1800, the arrondissement of Céret was part of that original department. ==Geography== The arrondissement of Céret is the smallest of the arrondissements of the department, with an area of , but it is the second in population, after the Perpignan arrondissement, with 73,192 inhabitants and a density of inhabitants/km². The arrondissement is bordered to the north by the Perpignan arrondissement, to the east by the Mediterranean Sea, to the south by Spain, to the west and northwest by the Prades arrondissement. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Céret, there are 2 cantons whose communes are in the arrondissement: La Côte Vermeille and Vallespir-Albères. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Céret INSEE Code Canton Céret Perpignan Prades Total 6601 Les Aspres 4 18 22 6602 Le Canigou 16 25 41 6605 La Côte vermeille 7 7 6617 Vallespir-Albères 13 13 ===Communes=== The arrondissement of Céret has 40 communes; they are (with their INSEE codes): # Amélie-les-Bains-Palalda (66003) # Argelès-sur-Mer (66008) # Arles-sur-Tech (66009) # Banyuls-dels-Aspres (66015) # Banyuls-sur- Mer (66016) # Calmeilles (66032) # Cerbère (66048) # Collioure (66053) # Corsavy (66060) # Coustouges (66061) # Céret (66049) # L'Albère (66001) # La Bastide (66018) # Lamanère (66091) # Laroque-des-Albères (66093) # Le Boulou (66024) # Le Perthus (66137) # Le Tech (66206) # Les Cluses (66063) # Maureillas-las-Illas (66106) # Montauriol (66112) # Montbolo (66113) # Montesquieu-des-Albères (66115) # Montferrer (66116) # Oms (66126) # Palau- del-Vidre (66133) # Port-Vendres (66148) # Prats-de-Mollo-la-Preste (66150) # Reynès (66160) # Saint-André (66168) # Saint-Génis-des-Fontaines (66175) # Saint-Jean-Pla-de-Corts (66178) # Saint-Laurent-de-Cerdans (66179) # Saint- Marsal (66183) # Serralongue (66194) # Sorède (66196) # Taillet (66199) # Taulis (66203) # Villelongue-dels-Monts (66225) # Vivès (66233) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 66008 Argelès-sur-Mer 10,279 La Côte vermeille Albères et de la Côte Vermeille 66049 Céret 7,663 Vallespir-Albères Vallespir 66024 Le Boulou 5,573 Vallespir-Albères Vallespir 66016 Banyuls-sur-Mer 4,767 La Côte vermeille Albères et de la Côte Vermeille 66148 Port-Vendres 4,200 La Côte vermeille Albères et de la Côte Vermeille 66003 Amélie-les-Bains-Palalda 3,554 Le Canigou Haut Vallespir 66168 Saint-André 3,309 La Côte vermeille Albères et de la Côte Vermeille 66133 Palau-del-Vidre 3,205 La Côte vermeille Albères et de la Côte Vermeille 66196 Sorède 3,153 Vallespir-Albères Albères et de la Côte Vermeille 66053 Collioure 3,046 La Côte vermeille Albères et de la Côte Vermeille ==Related pages== *Arrondissements of the Pyrénées- Orientales department *List of arrondissements of France ==References== ==Other websites== *Photos, slide show *Walks in the Céret region *Ceret virtual Tours Ceret",
 "title": "Arrondissement of Céret"
}