{
 "id": "41294",
 "text": "Garlic (species Allium sativum) is a type of plant that people eat for food. Garlic is related to onions, shallots, and leeks. It has a very strong flavor and smell. Most of the time, people use it as a flavoring so that it helps make food taste better. Garlic is used as herbal medicine in the treatment of cold and flu. It has side effects of heartburn, flatulence and sweating. The part of the garlic plant that people eat is called the head. It grows at the bottom of a long green stalk. People pull the head apart into smaller pieces called cloves of garlic. Cloves have papery skin on them. People peel off the skin before cooking the cloves. People plant garlic in the fall right after the first frost. They plant the clove like a seed. One clove can grow into a whole head. The garlic plant grows its roots before the ground freezes for winter. People harvest (collect) the garlic in the middle of the next summer. == Cultivation == Garlic cultivation is when you grow garlic plants for their bulbs. The bulbs are the part of the plant that you eat or use for cooking. They have a strong smell and taste, and they are good for your health. To grow garlic, you need to do these things: Choose healthy pieces of garlic to plant. They are called cloves. Each clove can grow into a new plant. Find a place with good soil that is not too wet or too dry. The soil should have organic matter, like compost or manure, to make it rich and fertile. The place should also get enough sunlight, at least 6 hours a day. Dig holes in the soil about 2 inches deep and 6 to 8 inches apart. Put one clove in each hole, with the pointy end facing up. Cover the cloves with soil and press it lightly. Water the soil well after planting, and then water it once a week or when it is dry. Do not water too much or too little, as this can affect the growth of the bulbs. Give the plants some nutrients, like fertilizer or organic matter, to help them grow better. You can do this when you plant them, or after a few weeks. Do not give too much nitrogen, as this can make the bulbs soft and rubbery. Remove any weeds that grow near the plants, as they can take away water and nutrients from the garlic. You can use a hoe or your hands to pull out the weeds. Wait for the plants to grow and form bulbs. This can take 3 to 6 months, depending on the variety and the weather. The plants need some cold weather, called vernalization, to make the bulbs. You can tell when the bulbs are ready by looking at the leaves. When the leaves turn yellow and dry, it is time to harvest. Dig out the bulbs carefully from the soil, using a spade or a fork. Do not pull them by the leaves, as this can damage the bulbs. Shake off any excess soil and cut off the roots and leaves. Leave a few inches of the stem attached to the bulb. Dry the bulbs in a place that is dry, cool, and airy for a few weeks. This is called curing. It helps the bulbs last longer and have a better flavor. You can lay them on a flat surface, or hang them in bunches or braids. Store the bulbs in a dry, dark, and cool place, like a basement or a pantry. You can keep them in a mesh bag, a paper bag, or a cardboard box. Do not store them in a plastic bag, as this can make them rot. Check them regularly and remove any bad ones. Growing garlic is not very hard, but it needs some care and attention. If you follow these steps, you can grow your own garlic and enjoy its benefits. Garlic is a perennial flowering plant that is native to Central Asia, South Asia and northeastern Iran. and grows from a bulb. It has a tall, erect flowering stem that grows up to . The leaf blade is flat, linear, solid, and the size is approximately wide. == Folklore == Garlic is in legends about vampires. In these legends, vampires do not like garlic. Garlic keeps vampires away. Writers for the Toronto Garlic Festival say this might be because the vampire legend comes from the disease porphyria. People with porphyria do not like to eat foods that have sulfur in them, like garlic. ==References== Category:Herbs Category:Allium",
 "title": "Garlic"
}