{
 "id": "413319",
 "text": "Atlantic hurricane seasons Before 1600 1600s 1700s 1800s 1810s 1820s 1830s 1840s 1850s While information for every storm that happened is not available, some parts of the coastline had enough people to give information of hurricane happenings. Each season was an event in the annual cycle of tropical cyclone formation in the Atlantic basin. Most tropical cyclone formation occurs between June 1 and November 30. == 1700–1719 == Although not listed below, the Great Storm of 1703 that struck the Kingdom of England may have been a hurricane. Year Location Date Deaths Damage/Notes 1700 Charleston, South Carolina September 14 98 N/A 1703 Virginia, Maryland, New England October 18 N/A Great wind and flood damage; many ships were lost 1705 Havana, Cuba N/A Many were lost 4 ships lost 1706 Virginia November 6 N/A 14 ships lost 1707 St. Kitts and Nevis September 2 N/A Nevis was \"nearly ruined\", and several ships were wrecked off the coast of St. Kitts 1707 St. Augustine, Florida September 30 N/A Heavy flooding and damage 1708 Veracruz N/A 578 N/A 1712 Jamaica September 8 400 Many houses destroyed 1713 Martinique September 4 – 5 September 100 N/A 1713 South Carolina September 16 70 Heavy flooding, created new inlets 1714 Florida Keys Late June Many drowned Many ships sank 1715 Bahamas, Florida Keys July 31 1000–2500 4 ships lost == 1720–1739 == Year Location Date Deaths Damage/Notes 1720 Puerto Rico N/A 500 N/A 1722 Puerto Rico, Jamaica, Carolinas August 28 – 3 September 280 N/A 1722 Jamaica, Louisiana, South Carolina 10 September – 28 September 400 * Moved through Lesser Antilles 11 September. * Landfall in Louisiana on 23 September with 15 hours of hurricane winds and an 8-foot storm surge * Many ships lost in Louisiana * Eight-foot storm surge caused flooding in New Orleans, leading to removal of territorial capital to Baton Rouge * Three days of flooding rains in South Carolina around 27 September. 1723 Massachusetts February 23 – February 24 0 1724 Chesapeake Bay August 23 N/A Severe crop damage, one ship lost 1724 Hispaniola September 12 121 N/A 1726 Jamaica November 2 18+ N/A 1728 Carolinas August N/A N/A 1730 Jamaica September 1 N/A One ship, including the ex-president of Panama, lost. 1731 Windward Passage June 24 1+ two ships destroyed 1733 St. Kitts June 30 Several At least one ship wrecked 1733 Bahamas, Florida Keys July 15 56 N/A 1737 Dominican Republic September 9 Several people drowned Many ships destroyed == 1740–1759 == Year Location Date Deaths Damage/Notes 1740 Puerto Rico September 11 – 12 September N/A Two ships destroyed 1740 Louisiana September 23 N/A Destroyed town of La Balize 1742 Virgin Islands, Puerto Rico October 27 – October 28 N/A Two ships lost 1743 Jamaica October 20 \"Great number\" N/A 1744 Jamaica October 31 – November 1 182 N/A 1746 Caribbean Sea N/A N/A Thirteen ships destroyed 1747 Virginia September 15 50+ Indentured servant ship destroyed 1747 North Carolina, Massachusetts October 8 \"Many\" Seven ships destroyed 1747 Bermuda October 10 \"Violent gale of wind\" 1747 St. Kitts October 24 \"Upwards of 20 sail of vessels lost\" 1748 Off Virginia Capes September 11 \"Dispersed fleet\" 1748 Bermuda October 13 Up to £20,000 damage 1749 North Carolina, Virginia, Maryland October 12 One family £30,000, flood and tree damage 1750 Offshore North Carolina August 17 N/A Four ships lost 1751 St. Kitts July 24 Entire crew one ship lost 1752 South Carolina September 15 103 N/A 1752 Cuba September 26 N/A Sixteen ships lost 1752 Offshore Florida October 22 7+ twelve ships lost 1754 Santo Domingo September N/A twelve ships lost 1757 Virginia August 11 Rain for 3 days; great SW-NW-N gusts 1758 St. Kitts November 10 200 N/A 1758 St. Marks, Florida N/A 40 N/A == 1760–1769 == Year Location Date Deaths Damage/Notes 1740 Puerto Rico September 11 – 12 September N/A Two ships destroyed 1740 Louisiana September 23 N/A Destroyed town of La Balize 1742 Virgin Islands, Puerto Rico October 27 – October 28 N/A Two ships lost 1743 Jamaica October 20 \"Great number\" N/A 1744 Jamaica October 31 – November 1 182 N/A 1746 Caribbean Sea N/A N/A Thirteen ships destroyed 1747 Virginia September 15 50+ Indentured servant ship destroyed 1747 North Carolina, Massachusetts October 8 \"Many\" Seven ships destroyed 1747 Bermuda October 10 \"Violent gale of wind\" 1747 St. Kitts October 24 \"Upwards of 20 sail of vessels lost\" 1748 Off Virginia Capes September 11 \"Dispersed fleet\" 1748 Bermuda October 13 Up to £20,000 damage 1749 North Carolina, Virginia, Maryland October 12 One family £30,000, flood and tree damage 1750 Offshore North Carolina August 17 N/A Four ships lost 1751 St. Kitts July 24 Entire crew one ship lost 1752 South Carolina September 15 103 N/A 1752 Cuba September 26 N/A Sixteen ships lost 1752 Offshore Florida October 22 7+ twelve ships lost 1754 Santo Domingo September N/A twelve ships lost 1757 Virginia August 11 Rain for 3 days; great SW-NW-N gusts 1758 St. Kitts November 10 200 N/A 1758 St. Marks, Florida N/A 40 N/A == 1770–1779 == Year Date Location Deaths Damage/Notes 1771 May 23–24 Jamaica and Cuba N/A N/A 1771 November 30 – December 1 Vera Cruz, Mexico 1772 August 1–7 Hispaniola, Cuba 1772 28 August – 4 September Greater Antilles including Puerto Rico and Jamaica; Mobile, Alabama; New Orleans, Louisiana At least 280 A westward moving hurricane hit Puerto Rico on August 28. It continued through the Greater Antilles, hitting Hispaniola on the 30th and later Jamaica. It moved northwestward through the Gulf of Mexico, and hit just west of Mobile, Alabama on the 4th. Many ships were destroyed in the Mobile area, and its death toll is at least 280 deaths. This storm was famously described by Alexander Hamilton, who was living on Saint Croix at the time, and wrote a letter about it to his father.A Few of Hamilton's Letters Including His Description of the Great West Indian Hurricane of 1772 pp. 261 1772 September 1 North Carolina 50 14 vessels forced ashore 1772 Various Saint Kitts and Nevis \"Several\" Three hurricanes hit the island group during the year, one of which is mentioned above. On St. Kitts, the damage was considerable. Many houses were flattened, and there were several fatalities and many more injuries. Total damage from the storm was estimated at 500,000 pound sterling on St. Kitts. The second storm struck just three days later. 1773 August 26 Virginia Unknown Damage to ships in the area.Virginia Gazette from September 2, 1773 1773 September 13–14 Colombia 1773 September 30 – October 2 Virginia Unknown Three days of rainfall across the region 1774 August 24–25 Virginia Unknown \"August nor'easter\" that caused two days of heavy rainfall. 1774 September 3 Annapolis, Maryland Unknown The Maryland capitol building in Annapolis saw roof damage from a hurricane that began on September 3 and lasted about 24 hours. A \"stormy\" northeast wind was seen in Westmoreland County Virginia, along with a \"flood of rain.\" 1774 October Havana, Cuba 1775 Late July Caribbean Sea Unknown N/A 1775 August 28–29 Havana 1775 August 29 – September 9 Outer Banks, Virginia, Newfoundland 4163 A hurricane hit the Outer Banks of North Carolina on August 29. It turned northeastward and left the state on the 2nd, bringing heavy wind and rain to southeastern Virginia. The hurricane stuck the eastern coast of Newfoundland on September 9, 1775. Approximately 4000 sailors, mostly from England and Ireland, were reported to have been drowned; a localized, storm surge is reported to have reached heights of between 20 and 30 feet. The hurricane, also known as the Independence Hurricane, is Canada's deadliest natural disaster, as well as the eighth deadliest hurricane in history. 1775 November 2 Caicos Islands 11 Several English warships lost 1776 June South coast of Cuba 1776 June New Orleans, Louisiana 1776 July 10 Virginia Unknown Affected a Revolutionary War battle in Virginia; it caused supply ships to sink in the Chesapeake Bay area, and resulted in moderate damage to the area. 1776 August Off northern coast of Cuba 1776 September 5 Guadeloupe 6,000 Seventh deadliest Atlantic hurricane in history 1777 June Florida Several One ship sunk; no one recovered 1777 August 26 Chesapeake Bay Unknown Hampered General Howe's march on Philadelphia. Caused Washington to seek refuge at Hermitage in Elkton, MD 1777 September 10 to 16 Central Atlantic, Pennsylvania Unknown Five ships were lost in a hurricane that moved across the Central Atlantic on September 10. 1777 October Oriente, Cuba and St. Dominigue 1778 August 12 Virginia Unknown Prevented a naval battle between the British and French in the Revolutionary War, causing them to separate as the hurricane moved up the coast. 1778 August–September Havana, Cuba 1778 October 28 Cuba Several Most lives lost due to drowning. 1778 November 1 Cape Cod, Massachusetts 50–70 Possibly related to the previous storm 1779 May 25–26 Jamaica N/A N/A 1779 August 18 Havana, Cuba, Louisiana Unknown All but one warship in a Spanish fleet were sunk off the coast. When it hit New Orleans, Louisiana on the 18th, it pushed the ships in the harbor well inland, causing heavy damage. William Dunbar first theorized from this system that a hurricane revolved around a vortex in the center. 1779 August 28 Martinique \"Many\" N/A 1779 December 3 Atlantic coast 120 N/A == 1780–1789 == The 1780 Atlantic hurricane season was a very deadly hurricane season. About 25,000 people died mainly due to three storms in October. * A hurricane affected Puerto Rico on June 19, 1780. * The second hurricane seen hit New Orleans, causing a lot of damage. * A hurricane hit Jamaica on October 5, it also hit Cuba. The storm killed about 1115 people. This was also known as the Savanna-la-Mar Hurricane. * The Great Hurricane of 1780 killed 22,000 people in the eastern Caribbean Sea. Making it the deadliest Atlantic hurricane ever seen. * A powerful hurricane in the Eastern Gulf of Mexico from October 17 to the 21st killed 2,000 people. Also known as Solano's Hurricane. *During late October, a storm hit Barbados and St. Lucia. *A storm moved along the East Coast of the United States on November 17. Year Date Location Deaths Damage/Notes 1781 August 1 Jamaica N/A Many ships were sunk and pushed ashore. 1781 August 23 New Orleans, Louisiana N/A N/A 1781 Unknown Offshore Florida 2000 N/A 1782 July Havana, Cuba 1782 September 16 Central Atlantic coast 3000 A hurricane that hit the fleet of Admiral Thomas Graves as it sailed across the North Atlantic in September 1782. It is believed to have killed some 3,500 people. 1783 September 19 North Carolina N/A Three ships sunk 1783 October 7 South Carolina, North Carolina N/A Charleston saw excessive rain and wind with the cyclone. Winds shifted from northwest to northeast as the storm passed offshore. Extensive damage was seen in North Carolina. Richmond saw violent northeast gusts for 24 hours, but no damage. Norfolk and Portsmouth reported a \"25 foot tide\" which caused damage.Pennsylvania Gazette October 29, 1783 and Ludlum 1963 p. 29 1784 June Florida Straits 1784 July 30 Jamaica 2 N/A 1784 Unknown Curaçao N/A Many ships damaged or destroyed 1785 August 24–29 Greater Antilles including Jamaica 142 Westward moving hurricane hit St. Croix, Puerto Rico, Jamaica, and Cuba. 1785 September 1 Delaware 181 One of the few hurricanes on record in the state of Delaware. 1785 September 23–24 Mid-Atlantic states N/A Led to the \"highest tide ever before known in Norfolk.\" It struck the lower Chesapeake Bay. Portsmouth experienced a strong northeast to northwest gale for 3 days. The storm in Virginia was noted in both the Virginia Gazette of October 1, and the New Jersey Gazette of October 1.Ludlum 1963 p. 30 The Annual Register the next year reported that several ships had been driven ashore by the tide and the wind, with a total damage estimated at around £30,000. 1785 September 25 Puerto Rico N/A San Lupo Hurricane – devastated agricultural fields. Governor Juan Dabán visited the islands affected area to inspect and help with the damages; it was the first time a governor of Puerto Rico did that after a Hurricane. 1786 September 2 Barbados \"Several\" Several houses destroyed 1786 October 5 Eastern Virginia N/A Heavy rainfall accompanied the storm. According to George Washington, tides were \"occasionally high\" at Mount Vernon, with \"high freshes.\" James Madison at Montpelier saw the Rapidan River overflow its banks. The center may have passed very near his location, as the winds shifted from southeast to southwest. 1786 October 20 Jamaica 7 N/A 1787 September 2–4 Belize, Vera Cruz, Mexico 100 It has been named \"Event 6\" in Belizean records by McCloskey and Keller. Several injuries were caused by this hurricane in Vera Cruz. 1787 September 19 Georgia, South Carolina 23 1787 September 23 Honduras 100 N/A 1788 July 24 Mid-Atlantic States N/A George Washington reported from Mount Vernon a \"very high northeast wind\" the previous night, which sank ships and blew down tree. A \"more violent and severe a hurricane than for many years.\" Madison at Montpelier reports a \"great wind and rain.\" According to the Philadelphia Independent Gazette on August 8, the storm in Norfolk began from the northeast at 5 p.m. on the 23rd, then blew a \"perfect hurricane\" from the south at 12:30 a.m.. The tide was lower than in 1785. Alexandria also saw the winds switch from east-northeast to south, which caused the highest known tide in the Potomac.Ludlum 1963, p. 30–31 1788 August 14–19 Martinique, Dominica, Bahamas, New England 600–700 N/A 1789 August 19 New Jersey, New England N/A Heavy damage == 1790–1790 == Year Date Location Deaths Damage/Notes 1791 June 21–22 Cuba 3000 Caused crop damage and animal deaths 1791 Unknown Southern Texas N/A 1791 October 25 Puerto Rico 1792 August 1 Lesser Antilles N/A Several ships destroyed 1792 October Havana, Cuba 1793 August 13 Virgin Islands 28 Moved slowly through the area 1793 August Louisiana N/A Caused crop damage and minor flooding 1794 May 28 Jamaica N/A N/A 1794 June 27 Jamaica N/A One ship destroyed in a tropical storm 1794 Late July Jamaica \"Heavy deaths\" N/A 1794 August 9–10 Havana 1794 August 27–31 Cuba and Louisiana 100+ In Louisiana, heavy flooding, high winds, crop damage, and unusually large hail occurred 1794 Early October Northeastern Florida N/A Caused beach erosion and damage 1794 October 26 Mid-Atlantic states N/A 1795 July 20 New Orleans 1795 August 2 North Carolina N/A Several Spanish ships lost; brought heavy rain through the mid-Atlantic, disrupting mail service and damaging crops. \"A fleet of eighteen Spanish ships, sailing from Havana to Spain, was struck off Cape Hatteras; an undisclosed number of these ships were lost.\" At Annapolis, rain set it on the afternoon of the 2nd, before it escalated later in the day, when it \"Blow'd a Harrican.\" Trees were levelled and the tide was so high that \"one could not get to the Market House with out a Boat.\" Vessels were driven ashore by the tempest (from the diary of William Faris). 1795 August 12 North Carolina N/A Considered a major hurricane, caused additional flooding and crop damage after the previous storm; the damage could be \"Modestly estimated at a year's rent\", quoted by Thomas Jefferson. The \"powerful torrent\" of rain in Petersburg caused creeks to rise higher than noted in the previous 70 years (North Carolina Journal). Winds were gusty at Farmville, where a \"great fresh\" was reported. Annapolis reported strong winds and rains on August 13th as well. 1796 August 26–27 New Orleans 1796 October 2 Pinar del Río, Cuba, Bahamas N/A Caused shipping delays 1797 September 5 North Carolina N/A One ship sunk 1797 October 15–19 Bahamas and South Carolina \"Many\" Several ships lost 1799 September 23 Jamaica 27 Remained offshore, but rain, flooding, and winds were very strong 1799 October Oriente, Cuba ==Related pages== *List of Atlantic hurricane seasons ==References== == Other websites == *http://www.nhc.noaa.gov/pastdeadlyapp1.shtml *http://www.candoo.com/genresources/hurricane.htm#1700 *http://www.hpc.ncep.noaa.gov/research/roth/vahur.htm *http://www.srh.noaa.gov/lch/research/la18hu.htm *18th century Category:18th century in North America",
 "title": "List of Atlantic hurricanes in the 18th century"
}