{
 "id": "413432",
 "text": "Alison \"Ali\" Hewson (née Stewart; 23 March 1961) is an Irish activist and businesswoman. She is the wife of singer and musician Paul Hewson, known as Bono, from the rock group U2. Raised in Raheny, she met her future husband at a young age at Mount Temple Comprehensive School and married him in 1982. She has a degree in politics and sociology from University College Dublin in 1989. The couple have four children together and live at residences in Ireland, France, and the United States. She has inspired several U2 songs, most famously \"Sweetest Thing\". ==Early life== Alison Stewart was born on 23 March 1961,the daughter of Terry and Joy Stewart and the granddaughter of Hector Grey, a well known Dublin trader and shop owner. Alison studied at Mount Temple Comprehensive SchoolDunphy, Unforgettable Fire, p. 72. where, at the age of twelve, she met Paul Hewson, who was a grade ahead of her. ==Marriage and family== She married Bono on 21 August 1982Kootnikoff, Bono, p. xvi. in a Church of Ireland ceremonyDunphy, Unforgettable Fire, p. 201. at All Saints Church, Raheny. In debt to U2's label, Island Records, the couple did not have ready funds for a honeymoon, but label head Chris Blackwell gave them use of the Goldeneye estate he owned in Jamaica.Stokes, Into the Heart, p. 46. At first, the newly married couple shared a small mews house in Howth with the rest of the band.McCormick, U2 by U2, p. 130. It took her a while to enjoy the band's music, as her own tastes ran toward her father's Frank Sinatra and Nat King Cole records. == Career as activist == In 1992, Hewson participated in Greenpeace protests against the Sellafield plant for nuclear reprocessing, located across the Irish Sea in Cumbria, England. This involvement led her to become interested in the Chernobyl nuclear disaster of 1986. Since 1994, Hewson has been a patron of Chernobyl Children's Project International == Career as businesswoman == In 2005, Hewson, Bono and designer Rogan Gregory co-founded the Edun fashion label (\"nude\" spelled backwards, to suggest both \"natural\" and the Garden of Eden). It was intended to help bring about positive change in Africa through a fair trade-based relationship rather than by direct aid. == Hewson and U2 == Songs written by Bono that were at least in part inspired by Ali go back to the earliest period of the band's recording career, with the track \"Another Time, Another Place\" off their 1980 first album, Boy.Stokes, Into the Heart, p. 14. She helped Bono get through a bad period of writer's block during the lead-up to the 1983 War album and especially in the lyric composition for \"Sunday Bloody Sunday\".Stokes, Into the Heart, p. 38. She was the inspiration for the personal themes of \"New Year's Day\" on that record as well.Stokes, Into the Heart, p. 41. The album and the accompanying War Tour brought financial success to the band, and Bono and Ali moved into a three-level, three-room Martello tower in Bray for some years.Kootnikoff, Bono, p. 57. The group's 1984 song \"Promenade\" reflects both that location and the spiritual aspects of his desire for her.Stokes, Into the Heart, p. 56. The U2 song \"Sweetest Thing\" was written for Hewson as a gift because Bono forgot her birthday whilst recording with the band during The Joshua Tree sessions. Originally released as a B-side in 1987, it was later re-recorded and released as a single from the compilation album The Best of 1980–1990 in 1998. Hewson agreed to appear in the single's music video as long as all proceeds from it went to Chernobyl Children's Project. == References == == Bibliography == *Dunphy, Eamon (1987) Unforgettable Fire: The Story of U2. New York: Warner Books. . *Flanagan, Bill (1996) U2: At the End of the World. New York: Delta. *Kootnikoff, David. (2012) Bono: A Biography. Santa Barbara, California: ABC-CLIO. *Stokes, Niall (2005 edition). Into the Heart: The Stories Behind Every U2 Song. New York: Thunder's Mouth Press. *U2; McCormick, Neil (ed). (2006) U2 by U2. London: HarperCollins. Category:1961 births Category:Living people Category:Anti-nuclear activists Category:Irish businesspeople Category:Irish activists",
 "title": "Ali Hewson"
}