{
 "id": "413420",
 "text": "Touraine () is one of the traditional provinces of France. Its capital was Tours. In 1790 France changed from being divided into provinces to being divided into departments. Touraine was divided between the departments of Indre-et-Loire, :Loir-et-Cher and Indre. ==Geography== Touraine has a network of rivers. The Loire and its tributaries the Cher, the Indre and the Vienne all make up a part of the Paris river basin. It is well known for its wine.Francis Miltoun, Castles and chateaux of old Touraine and the Loire country (Boston: L. C. Page & Co., 1906), p. 129 The TGV connects Tours with Paris. The trip takes less than an hour. This has made Touraine a place of residence for people who work in the capital but seek a different quality of life. ==History== Touraine takes its name from a Celtic tribe called the Turones, who inhabited the Tours region about two thousand years ago. In 1044, the control of Touraine was given to the counts of Anjou. This same dynasty who (as the House of Plantagenet) became kings of England in 1154. The castle of Chinon was their great stronghold. In 1205, Philip II Augustus of France regained Touraine. At this time, Touraine was made into a Duchy. In 1429, Saint Joan of Arc had a historic meeting with the future King of France Charles VII at Chinon. Throughout the late 15th and 16th centuries, Touraine was a favorite residence of French kings. The castles were converted to Renaissance châteaux; for this reason the region was titled \"The Garden of France\". These same châteaux became popular tourist attractions in modern times. The royal duchy became a province in 1584, and was divided into departments in 1790. ==Famous natives== * René Descartes * Honoré de Balzac ==Famous non-natives== * Leonardo da Vinci died in Amboise in 1519 * Archibald Douglas, 4th Earl of Douglas, Duke of Touraine leader of the Army of Scotland in France during the Hundred Years' War.Mémoires de la Société archéologique de Touraine (Tours: L. Pericat, 1885), p. 379 == Notes == == References == Category:Geography of France Category:Pays de la Loire Category:Centre-Val de Loire",
 "title": "Touraine"
}