{
 "id": "413506",
 "text": "Tonic immobility is a natural state of paralysis that animals enter, often called animal hypnosis. Its function is not certain. It may be related to mating in certain animals like sharks and mammals. It may also be a way of avoiding or deterring predators (playing dead is called thanatosis). The term tonic immobility has also been used for the paralysis that often immobilizes animals, such as rodents or birds, when they feel threatened by a predator. Tonic immobility plays a role in survival if it helps a hunted animal to blend in with its surroundings. Tonic immobility can be induced without causing any apparent stress to the animal. For example, stroking a particular area of a lobster's shell or focusing a hen's attention on a line on the ground. Tonic immobility has also been said to occur in humans that are subject to intense trauma, such as rape or sexual assault.Catatonia in humans is a serious psychiatric condition that often involves a state of immobility. == Sharks == Some sharks can be placed in a tonic state.Henningsen A.D. 1994. Tonic immobility in 12 elasmobranchs: use as an aid in captive husbandry. Zoo Biology 13: 325-332 The shark remains in this state of paralysis for an average of fifteen minutes before it recovers. Scientists have exploited this phenomenon to study shark behaviour. Some sharks go into tonic immobility when they are turned upside down. With tiger sharks (measuring 3–4 metres, or 10–15 feet, in length), tonic immobility may be achieved by placing hands lightly on the sides of the animal's snout in the area surrounding its eyes. Scientists believe that tonic immobility in sharks may be related to mating, because female sharks seem more responsive than males. During tonic immobility, the dorsal fin(s) straighten, and both breathing and muscle contractions become more steady and relaxed. Great White Sharks are not so responsive as other species when tonic immobility has been attempted. In an interesting eye witness case off the coast of California, a female orca was seen holding the shark upside down to induce tonic immobility. It kept the shark still for fifteen minutes, causing it to suffocate to death. This was the first recorded eye witness case of predation on a great white shark in the wild by a species other than humans. Another case of orcas purposely inducing tonic immobility in fish has been seen with stingrays in New Zealand. In this case, the orcas turn themselves upside down before attacking, trap the stingrays in their mouths, then quickly right themselves, in turn flipping the stingray over, inducing the tonic immobility, rendering the fish helpless and an easy meal. == Chicken hypnotism == A chicken can be \"hypnotized\", or put into a trance, by holding its head down against the ground, and drawing a line along the ground with a stick or a finger, starting at the beak and extending straight outward in front of the chicken. If the chicken is hypnotized in this manner, it will remain immobile for somewhere between 15 seconds and 30 minutes, continuing to stare at the line. One theory is that the trance is caused by fear,Gallup G.G. Jr. et al 1970. Effect of varying conditions of fear on immobility reactions in domestic chickens (Gallus gullus). Journal of Comparative and Physiological Psychology 73: 442-445Gallup G.G. Jr. 1979. Tonic immobility as a measure of fear in the domestic fowl. Animal Behaviour 27: 316-317 which is probably a defensive mechanism intended to feign death, albeit rather poorly. The first known written reference for this method came in 1646, in Mirabile Experimentum de Imaginatione Gallinae by Athanasius Kircher in Rome.Gilman T.T; Marcuse F.L. & Moore A.U. 1960. Animal hypnosis: a study of the induction of tonic immobility in chickens. Journal of Comparative Physiology and Psychology 43: 99-111 === Methods === Another hypnosis technique is to hold the chicken face up with its back on the ground, and then run a finger downwards from the chicken's wattles to just above its vent. The chicken's feet are exposed, which facilitates the application of medication for foot mites, etc. Clapping hands or giving the chicken a gentle shove will awaken it. One can also hypnotize a chicken by mimicking how it sleeps with its head under its wing. In this method, hold the bird firmly, placing its head under its wing, then, gently rock the chicken back and forth and set it very carefully on the ground. It should stay in the same position for about 30 seconds. H.B. Gibson, in his book Hypnosis: its nature and therapeutic uses, says the record period for a chicken remaining in hypnosis is 3 hours 47 minutes. == Trout tickling == Trout tickling is the art of rubbing the underbelly of a trout using fingers. If done properly, the trout will go into a trance-like state after a minute or so, and can then easily be thrown onto the nearest bit of dry land.Brian Morgan. Story of the Virgin Soldier (Trout Tickling) : Part of the BBC's WWII People's War Series. 12 May 2005. Article ID A4057706. Accessed on: 16-1-07. == Tonic immobility as a scientific tool == The rationale for the tonic immobility test is that the experimenter simulates a predator thereby eliciting an anti-predator response \"death feigning\". The precept is that the prey animal 'pretends' to be dead to be able to escape when/if the predator relaxes its concentration. Death feigning birds often take advantage of escape opportunities; tonic immobility in quail reduces the probability of the birds being predated by cats.Forkman B. et al 2007. A critical review of fear tests used on cattle, pigs, sheep, poultry and horses. Physiology & Behavior 92: 340-374 To induce tonic immobility, the animal is gently restrained on its side or back for a period of time, e.g. 15 seconds. This is done either on a firm, flat surface or sometimes in a purpose-built ‘V’ or ‘U’-shaped restraining cradle. In rodents, the response is sometimes induced by additionally pinching or attaching a clamp to the skin at the nape of the neck.Zamudio S.R. et al 2009. The effects of acute stress and acute corticosterone administration on the immobility response in rats. Brain Research Bulletin 80: 331-336 Scientists record behaviours, such as the number of inductions (15 second restraining periods) required for the animal to remain still, the latency to the first major movements (often cycling motions of the legs), latency to first head or eye movements and the duration of immobility, sometimes called the ‘righting time’. Tonic immobility has been used to show that hens in cages are more fearful than those in pens. Hens on the top tier of tiered battery cages are more fearful than those on the lower levels.Jones R.B. 1987. Fearfulness of caged laying hens: The effects of cage level and type of roofing. Applied Animal Behaviour Science 17: 171-175 Hens carried by hand are more fearful than hens carried on a mechanical conveyor.Scott G.B. & Moran P. 1993. Fear levels in laying hens carried by hand and by mechanical conveyors. Applied Animal Behaviour Science 36: 337-345 Hens transported for longer times are more fearful than those transported for shorter times.Cashman P; Nicol C.J. & Jones R.B. 1980. Effects of transportation on the tonic immobility fear reactions of broilers. British Poultry Science 30: 211-221 Tonic immobility as a scientific tool has also been used with mice,Bazovkina D.V. et al 2011. Effects of lipopolysaccharide and interleukin-6 on cataleptic immobility and locomotor activity in mice. Neuroscience Letters 487: 302-304 gerbils,Griebel G; Stemmelin J. & Scatton B. 2005. Effects of the cannabinoid CB1 receptor antagonist rimonabant in models of emotional reactivity in rodents. Biological Psychiatry, 57: 261-267 guinea pigs,Donatti A.F. & Leite-Panissi C.R.A. 2011. Activation of corticotropin-releasing factor receptors from the basolateral or central amygdala increases the tonic immobility response in guinea pigs: an innate fear behaviour. Behavioural Brain Research 225: 23-30 rats, rabbits.Verwer C.M. et al 2009. Handling effects on body weight and behaviour of group-housed male rabbits in a laboratory setting. Applied Animal Behaviour Science, 117: 93-102 pigsHessing M.J.C. et al 1994. Individual behavioral and physiological strategies in pigs. Physiology and Behavior 55: 39–46 and monkeys.V. Holcombe. et al 1979. The immobilization response in rhesus monkey: a behavioral and electroencephalographic study. == References == Category:Zoology Category:Ethology",
 "title": "Tonic immobility"
}