{
 "id": "413558",
 "text": "Air Force One is a 1997 American action-thriller movie written by Andrew W. Marlowe and directed by Wolfgang Petersen. It is about a group of Russian terrorists hijacking Air Force One. It stars Harrison Ford, Gary Oldman, Glenn Close, Xander Berkeley, Jürgen Prochnow, William H. Macy, Dean Stockwell, Wendy Crewson, Philip Baker Hall and Paul Guilfoyle. The movie was composed by Jerry Goldsmith. ==Filming== Kevin Costner was offered the role of President James Marshall but turned it down as he had other commitments, and the script was given to Harrison Ford who accepted it. Ford refused to do a scene in the script where Marshall sits down to gather himself as he felt that he didn't sit down when family is in a crisis. Marlowe always felt the \"Get off my plane!\" line was cheesy until Ford performed it to \"pitch-perfect\". ==Release== It was released on July 25, 1997. When the move came out, U.S. President Bill Clinton praised it. The movie was a box office success and received mostly positive critical reviews. It became the fifth highest- grossing movie of 1997, earning $315.2 million worldwide. It also received two Academy Award nominations for Best Sound and Best Film Editing, losing both awards to Titanic. ==Response== On Rotten Tomatoes, Air Force One has an approval rating of 79% based on 63 reviews, with an average rating of 7/10. On Metacritic, the movie has a weighted average score of 62 out of 100, based on 25 critics. Audiences polled by CinemaScore gave the movie an average grade of \"A\" on an A+ to F scale. A Wall Street Journal poll in 2016 named Harrison Ford's James Marshall as the \"greatest fictional U.S. president of all time\". ==References== ==Other websites== *Air Force One DailyScript.com Category:1997 action movies Category:1997 thriller movies Category:Movies directed by Wolfgang Petersen Category:Movies composed by Jerry Goldsmith Category:1990s English-language movies Category:Columbia Pictures movies Category:Political movies Category:Movies about terrorism Category:Movies about dictators Category:1990s action thriller movies Category:American action thriller movies Category:American crime thriller movies Category:American disaster movies Category:American crime drama movies Category:German action movies Category:German crime movies Category:German thriller movies Category:Buena Vista International movies Category:Movies about abduction Category:Movies about families Category:Movies about air forces Category:Movies set in Germany Category:Movies set in Kazakhstan Category:Movies set in Moscow Category:Movies set in Washington, D.C. Category:Movies set in the 1990s",
 "title": "Air Force One (movie)"
}