{
 "id": "413694",
 "text": "Dolby Surround 7.1 is a sound system by Dolby Laboratories. It produces theatrical 7.1 surround sound in cinemas. It adds two new channels to current Dolby Digital 5.1. The first movie to feature Dolby Surround 7.1 was Toy Story 3 (2010) by Disney and Pixar. There are 4,500 locations worldwide as of March 2013. ==2010== Title Release date Notes Studios Toy Story 3 June 18, 2010 First film to use Dolby Surround 7.1 Walt Disney Pictures Pixar Animation Studios Step Up 3D August 6, 2010 First live-action film to use Dolby Surround 7.1 Touchstone Pictures Summit Entertainment Offspring Entertainment Legend of the Fist: The Return of Chen Zhen September 23, 2010 First Hong Kong film to use Dolby Surround 7.1 Media Asia Entertainment Group Basic Pictures Julia's Eyes October 20, 2010 First Spanish film to use Dolby Surround 7.1 DeAPlaneta Megamind November 5, 2010 Dreamworks Animation Paramount Pictures Tangled November 24, 2010 Walt Disney Pictures Walt Disney Animation Studios The Chronicles of Narnia: The Voyage of the Dawn Treader December 10, 2010 20th Century Fox Walden Media Dune Entertainment Tron: Legacy December 17, 2010 Walt Disney Pictures LivePlanet Gulliver's Travels December 22, 2010 20th Century Fox Davis Entertainment Dune Entertainment ==2011== Title Release date Notes Studios Gnomeo & Juliet February 11, 2011 Touchstone Pictures Rocket Pictures Arc Productions Mars Needs Moms March 11, 2011 Walt Disney Pictures ImageMovers Digital Torrente 4: Lethal Crisis June 18, 2011 Warner Bros. Spain Lord of the Dance 2011 Entertainment One Dum Maro Dum April 22, 2011 First Bollywood film to use Dolby Surround 7.1 Fox Searchlight Pictures Fox Star Studios Ramesh Sippy Entertainment The Lost Bladesman April 28, 2011 Shanghai Film Group Corporation Thor May 6, 2011 Paramount Pictures Marvel Studios Pirates of the Caribbean: On Stranger Tides March 11, 2011 Walt Disney Pictures Jerry Bruckheimer Films Kung Fu Panda 2 May 26, 2011 Dreamworks Animation Paramount Pictures Super 8 June 10, 2011 Paramount Pictures Bad Robot Productions Amblin Entertainment Cars 2 June 24, 2011 Walt Disney Pictures Pixar Animation Studios Transformers: Dark of the Moon June 29, 2011 Paramount Pictures Hasbro Derrière les murs July 6, 2011 First French film to use Dolby Surround 7.1 Europa Corp. Captain America: The First Avenger July 22, 2011 Paramount Pictures Marvel Studios Fright Night August 19, 2011 Touchstone Pictures DreamWorks Bodyguard August 31, 2011 Bollywood film Reliance Entertainment The Art of Flight September 8, 2011 Warrior (2011 film) September 9, 2011 Lionsgate Entertainment Samsara September 11, 2011 Oscilloscope Laboratories The Lion King September 16, 2011 3D release to use Dolby Surround 7.1 Walt Disney Pictures Walt Disney Animation Studios Lee's Adventure 2011 Real Steel October 7, 2011 Touchstone Pictures DreamWorks Ra.One October 24, 2011 Bollywood film Eros International Ltd. Puss in Boots September 16, 2011 Dreamworks Animation Paramount Pictures Immortals November 11, 2011 Relativity Media Universal Studios Rockstar November 11, 2011 Eros International The Twilight Saga: Breaking Dawn - Part 1 November 18, 2011 Summit Entertainment Happy Feet Two November 18, 2011 Warner Bros. Pictures Village Roadshow Pictures The Muppets November 23, 2011 Walt Disney Pictures The Muppets Studio Hugo November 23, 2011 Paramount Pictures The Flowers of War December 16, 2011 First Chinese film to use Dolby Surround 7.1 EDKO Film Mission Impossible: Ghost Protocol December 16, 2011, 2011 Paramount Pictures The Adventures of Tintin: The Secret of the Unicorn December 21, 2011 Paramount Pictures Nickelodeon Movies Don 2 December 21, 2011 Bollywood film Reliance Entertainment War Horse December 21, 2011 Touchstone Pictures DreamWorks ==2012== Title Release date Notes Studios Beauty and the Beast January 13, 2012 3D release to use Dolby Surround 7.1 Walt Disney Pictures Walt Disney Animation Studios The Viral Factor January 17, 2012 Emperor Motion Pictures Underworld: Awakening January 13, 2012 Screen Gems Lakeshore Entertainment The Chemical Brothers: Don't Think 2012 Satchurated: Live in Montreal 2012 John Carter March 9, 2012 Walt Disney Pictures Kahaani March 9, 2012 Viacom 18 Motion Pictures Nightfall March 15, 2012 Sil-Metropole Organisation Ltd. The Hunger Games March 23, 2012 Lionsgate Entertainment Agent Vinod March 23, 2012 Eros Entertainment Illuminati Films Housefull 2: The Dirty Dozen April 5, 2012 Eros International Tezz April 27, 2012 Eros International The Avengers May 4, 2012 Marvel Studios Jannat 2 May 4, 2012 Bollywood film Fox Star Studios Dangerous Ishhq May 11, 2012 Bollywood film Reliance Entertainment Department May 18, 2012 Bollywood film Viacom 18 Motion Pictures Oberoi Line Productions Rowdy Rathore June 1, 2012 UTV Motion Pictures Snow White and the Huntsman June 1, 2012 Universal Pictures Roth Films Prometheus June 8, 2012 20th Century Fox Madagascar 3: Europe's Most Wanted June 8, 2012 Dreamworks Animation Paramount Pictures Brave June 22, 2012 First film to use Dolby Atmos Walt Disney Pictures Pixar Animation Studios Abraham Lincoln: Vampire Hunter June 22, 2012 20th Century Fox Teri Meri Kahaani June 22, 2012 Eros International Gangs of Wasseypur – Part 1 June 22, 2012 Viacom 18 Motion Pictures Maximum June 29, 2012 Bol Bachchan July 6, 2012 Bollywood film Shree Ashtavinayak Cine Vision Ltd Ice Age: Continental Drift July 13, 2012 20th Century Fox Blue Sky Studios Kyaa Super Kool Hain Hum July 27, 2012 Bollywood film Eros International Gangs of Wasseypur – Part 2 August 8, 2012 Viacom 18 Motion Pictures The Bourne Legacy August 10, 2012 Universal Pictures Ek Tha Tiger August 15, 2012 Yash Raj Films Jeena Hai Toh Thok Daal September 14, 2012 Bollywood film Viacom 18 Motion Pictures Finding Nemo September 14, 2012 3D release to use Dolby Surround 7.1 Walt Disney Pictures Pixar Animation Studios Pat Metheny: The Orchestrion Project 2012 OMG – Oh My God! September 28, 2012 Bollywood film Viacom 18 Motion Pictures Frankenweenie October 5, 2012 Also used Dolby Atmos Walt Disney Pictures Bhoot Returns October 12, 2012 Bollywood film Eros International Chakravyuh October 24, 2012 Base Industries Groups Chasing Mavericks October 26, 2012 Also used Dolby Atmos 20th Century Fox Walden Media Wreck-It Ralph November 2, 2012 Also used Dolby Atmos Walt Disney Pictures Walt Disney Animation Studios Ah Boys to Men November 6, 2012 Golden Village Pictures Lincoln November 9, 2012 Touchstone Pictures DreamWorks Studios Amblin Entertainment Son of Sardaar November 13, 2012 Bollywood Viacom 18 Motion Pictures Eros International The Twilight Saga: Breaking Dawn – Part 2 November 16, 2012 Lionsgate Entertainment Life of Pi November 21, 2012 Also used Dolby Atmos 20th Century Fox Rise of the Guardians November 21, 2012 Also used Dolby Atmos Dreamworks Animation Paramount Pictures Khiladi 786 December 7, 2012 Bollywood film Eros International The Hobbit: An Unexpected Journey December 14, 2012 Also used Dolby Atmos Warner Bros. Pictures New Line Cinema Metro-Goldwyn-Mayer WingNut Films Monsters, Inc. December 19, 2012 3D release to use Dolby Surround 7.1 Walt Disney Pictures Pixar Animation Studios The Guillotines December 20, 2012 Stellar Megamedia Group We Pictures Dabangg 2 December 21, 2012 Bollywood film Arbaaz Khan Productions Jack Reacher December 21, 2012 Bollywood film Paramount Pictures The Last Tycoon December 7, 2012 Bollywood film Distribution Workshop Les Misérables December 25, 2012 Bollywood film Universal Pictures ==2013== Title Release date Notes Studios Inkarr January 18, 2013 Viacom 18 Motion Pictures Race 2 January 25, 2013 Bollywood film UTV Motion Pictures Akaash Vani January 25, 2013 Wide Frame Pictures David February 1, 2013 Reliance Entertainment ABCD: Any Body Can Dance February 8, 2013 UTV Motion Pictures A Good Day to Die Hard February 13, 2013 Also used Dolby Atmos 20th Century Fox Murder 3 February 15, 2013 Fox Star Studios Oz: The Great and Powerful March 8, 2013 Also used Dolby Atmos Walt Disney Pictures Roth Films Aatma March 22, 2013 First Bollywood movie released in Dolby Atmos Wide Frame Pictures The Croods March 22, 2013 Also used Dolby Atmos Dreamworks Animation 20th Century Fox G.I. Joe: Retaliation April 5, 2012 Paramount Pictures Metro-Goldwyn-Mayer Hasbro Trance March 27, 2013 Fox Searchlight Pictures Himmatwala March 29, 2013 UTV Motion Pictures Chashme Baddoor April 5, 2013 Bollywood film ShowMaker Pictures Jurassic Park April 5, 2013 3D release to use Dolby Surround 7.1 Universal Pictures Amblin Entertainment Commando April 12, 2013 Also used Dolby Atmos Reliance Entertainment Oblivion April 18, 2012 Also used Dolby Atmos Universal Pictures Iron Man 3 May 3, 2012 Also used Dolby Atmos Marvel Studios Star Trek Into Darkness May 17, 2013 Also used Dolby Atmos Paramount Pictures Epic May 24, 2013 20th Century Fox Blue Sky Studios Man of Steel June 14, 2013 Also useed Dolby Atmos Warner Bros. Pictures Legendary Pictures DC Entertainment Monsters University June 21, 2013 Also used Dolby Atmos Walt Disney Pictures Pixar Animation Studios The Lone Ranger July 3, 2013 Also used Dolby Atmos Walt Disney Pictures Pacific Rim July 12, 2013 Also used Dolby Atmos Warner Bros. Pictures Legendary Pictures Turbo (film) July 17, 2013 Also used Dolby Atmos Dreamworks Animation 20th Century Fox The Wolverine July 26, 2013 Also used Dolby Atmos 20th Century Fox Top Cat: The Movie August 2, 2013 USA release to used Dolby Surround 7.1 Warner Bros. Pictures Planes August 9, 2013 Also used Dolby Atmos Walt Disney Pictures DisneyToon Studios Percy Jackson: Sea of Monsters August 16, 2013 Also used Dolby Atmos 20th Century Fox Cloudy with a Chance of Meatballs 2 September 27, 2013 Also used Dolby Atmos Columbia Pictures Sony Pictures Animation Free Birds November 1, 2013 Relativity Media Reel FX Creative Studios Thor: The Dark World November 8, 2013 Also used Dolby Atmos Marvel Studios Frozen November 27, 2013 Also used Dolby Atmos Walt Disney Pictures Walt Disney Animation Studios The Hobbit: The Desolation of Smaug December 13, 2013 Also used Dolby Atmos Warner Bros. Pictures New Line Cinema Metro-Goldway-Mayer WingNut Films Walking with Dinosaurs December 20, 2013 Also used Dolby Atmos 20th Century Fox Fox Animation Studios BBC Earth Dhoom 3 December 25, 2013 Also used Dolby Atmos Yash Raj Films == References == ==Other websites== * Dolby 7.1 webpage * Movies Released Presented in 7.1 Category:Audio technology",
 "title": "Dolby Surround 7.1"
}