{
 "id": "413813",
 "text": "Geoffrey III of Anjou (1040–1096), called le Barbu (\"the Bearded\"), was a French nobleman who was the Count of Anjou 1060-68. == Early career == Geoffrey III, born , was the oldest son of Geoffrey II, Count of Gâtinais and Ermengarde-Blanche of Anjou. Ermengarde-Blanche was the daughter of Fulk III of Anjou.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 82 Both he and his younger brother Fulk, called le Réchin, were raised at the court of their uncle, Geoffrey Martel. Both Geoffrey and Fulk were knighted by him in 1060. Geoffrey was well treated by his uncle but the count may have favored his younger nephew, Fulk. Nonetheless Geoffrey became his heir to succeed him as count of Anjou.W. Scott Jesse, Robert the Burgundian and the Counts of Anjou, c.1025-1098 (Catholic University of America Press, 2000), p. 54 Geoffrey III reigned as Count of Anjou until the countship was taken from him by his brother, Fulk.Jim Bradbury, 'Fulk le Réchin and the Origin of the Plantagenets', Studies in Medieval History Presented to R. Allen Brown, Ed. Christopher Harper-Bill, Christopher J. Holdsworth, Janet L. Nelson (The Boydell Press, 1989), p. 27 == Count of Anjou == He succeeded his uncle Geoffrey Martel in 1060, but it soon became clear to his vassals he was not a very good count.W. Scott Jesse, Robert the Burgundian and the Counts of Anjou, c.1025-1098 (Catholic University of America Press, 2000), p. 55 Geoffrey Martel left his younger brother, Fulk, Saintonge as an appanage. In 1062, when Saintonge was attacked by Count Guy-Geoffrey of Poitou, Geoffrey did nothing to help Fulk and Saintonge was lost.Henk Teunis, The Appeal to the Original Status: Social Justice in Anjou in the Eleventh Century (Hilversum: Uitgeverij Verloren, 2006), p. 75 In 1063 the county of Maine was lost to Anjou as well. In 1064 Geoffrey failed to come to the aid of one of his vassals, Rainaldus of Chateau-Gontier, who was captured by the Bretons.Henk Teunis, The Appeal to the Original Status: Social Justice in Anjou in the Eleventh Century (Hilversum: Uitgeverij Verloren, 2006), p. 76 In 1065 Geoffrey angered Archbishop Barthelemy of Tours by trying to force his own choice for Bishop of Le Mans on the church.W. Scott Jesse, Robert the Burgundian and the Counts of Anjou, c.1025-1098 (Catholic University of America Press, 2000), p. 61 In turn the archbishop excommunicated Geoffrey. As the situation in Anjou became worse Fulk argued with his brother Geoffrey. Finally, in 1067, Fulk rebelled and took the county away from Geoffrey, briefly imprisoning him. In 1068 Geoffrey attacked Fulk, and once again he was defeated. This time Geoffrey was imprisoned where he remained for 28 years.Jim Bradbury, The Routledge Companion to Medieval Warfare (Routledge, London, 2005) p. 38 Geoffrey was finally freed by the intervention of Pope Urban II in 1096. But Geoffrey died soon after his release.Jim Bradbury, 'Fulk le Réchin and the Origin of the Plantagenets', Studies in Medieval History Presented to R. Allen Brown, Ed. Christopher Harper-Bill, Christopher J. Holdsworth, Janet L. Nelson (The Boydell Press, 1989), p. 37 == Family == Geoffrey married Julienne de Langeais before 1060. She died after 7 August 1067. They had no children.K.S.B. Keats- Rohan, Family Trees and the Root of Politics; A Prosopography of Britain and France from the Tenth to the Twelfth Century (Woodbridge: The Boydell Press, 1997), p. 257 == Notes == == References == Category:1040s births Category:1096 deaths Category:Counts of Anjou",
 "title": "Geoffrey III, Count of Anjou"
}