{
 "id": "413936",
 "text": "The Division of Charlton was an Australian Electoral Division in New South Wales. It was created in 1984 and was named for Matthew Charlton, leader of the Australian Labor Party 1922-28. It covered the Hunter Region area of New South Wales. It included the towns of Cardiff, Wallsend, Toronto, Morisset, Cooranbong, Glendale and Warners Bay. In October 2015 the Australian Electoral Commission said the division would be renamed at the next election. Because of population changes New South Wales lost one division, and a new one was created in Western Australia. To abolish the seat, the boundaries in New South Wales were redrawn. The old Division of Hunter was to be abolished. Since Hunter is an original Federation electorate, the Australian Electoral Commission's guidelines for redistributions means it has to try and keep the Hunter name.Australian Electoral Commission to abolish Federal NSW seat of Hunter: ABC 16 October 2015Draft federal redistribution of New South Wales: Poll Bludger The area of Hunter was moved eastward and took over Charlton's former area.http://www.abc.net.au/news/federal-election-2016/guide/hunt/ ==Members== Image Member Party Term Notes Bob Brown Labor 1984–1998 Previously held the Division of Hunter. Served as minister under Bob Hawke and Paul Keating. Retired, and his daughter, KellyHoare took over the seat. Kelly Hoare Labor 1998–2007 Lost preselection and retired. Greg Combet Labor 2007–2013 Served as minister under Kevin Rudd and Julia Gillard. Retired Pat Conroy Labor 2013–2016 Transferred to the Division of Shortland after Charlton was abolished in 2016 Greg Combet had been Secretary of the Australian Council of Trade Unions (ACTU). He was Minister for Climate Change and Energy Efficiency in the Gillard Government. In the 2013 election, the Liberal Party candidate, Kevin Baker, resigned after being involved with an offensive website. This happened after nominations closed, so the Liberal Party could not select a new candidate and Baker's name was still on the ballot papers. ==Election results== * 2004 election results * 2007 election results * 2010 election results * 2013 election results ==References== ==Other websites== * Division of Charlton - Australian Electoral Commission * Pat Conroy's website Category:Former electoral divisions of Australia Category:Electoral divisions of New South Wales Category:1984 establishments in Australia",
 "title": "Division of Charlton"
}