{
 "id": "414204",
 "text": "Erysimum caboverdeanum is a plant species that belongs to the Brassicaceae family, the cabbage or mustard family. It is found only in the Fogo island, Cape Verde. It was named for the first time by the French botanist Auguste Jean Baptiste Chevalier in 1935. Available on at TelaBotanica. Caboverdeanum (or the original caboverdeana) is a Latin word that means \"Cape Verdean\" or \"from Cape Verde\". ==Synonym== Chevalier named, in 1935, this species as Matthiola caboverdeana; this name now is a synonym because Sunding changed it to the present name, Erysimum caboverdeanum. ==Common names== It is locally known as crabo bravo (\"wild carnation\") Alda Roque Gomes, Teresa Vasconcelos et M. Helena Guimarães de Almeida, « Plantas na medicina tradicional de Cabo Verde », p. 7 in Plantas Medicinais e Fitoterapêuticas nos Trópicos, IICT /CCCM, 29, 30 et 31 octobre 2008 and alecrim branco (\"white rosemary\"). ==Description== Erysimum caboverdeanum is a biennial small bush, up to high; its stems are woody and they stand upright. The narrow leaves are about long and wide and their margins are finely toothed. The flowers, which are white or lilac coloured, are in groups (inflorescences) at the end of the stems. The fruits are very narrow and stand upright. ==Where it grows== Erysimum caboverdeanum is an endemic species of the Cape Verdean island of Fogo on the volcano Pico do Fogo. It is common in soils with a recent volcanic origin at an altitude between ; it is found on the slopes of the volcano and in the Chã das Caldeiras, the plain in the volcanic crater. ==Uses== The species is used for traditional medicinal purposes mainly as an infusion. It is possible to use it as an ornamental plant, even in places like central Europe. ==References== ==Other websites== * Catalogue of Life: Erysimum caboverdeanum (Chev.) Sunding , retrieved on 21 August 2013 * Erysimum caboverdeanum at NCBI, retrieved on 21 August 2013 Category:Brassicaceae Category:Cape Verde",
 "title": "Erysimum caboverdeanum"
}