{
 "id": "414231",
 "text": "The Division of Maribyrnong is an Australian Electoral Division in the state of Victoria. It is in the north-western suburbs of Melbourne. It includes Moonee Ponds, Essendon, Niddrie, Keilor East, Avondale Heights, Tullamarine, Airport West, Sunshine and Brooklyn. Over the years the boundaries have been redrawn and the Division has been slowly moving west. It originally included the suburbs of Footscray and North Melbourne. According to the 2006 census, this electorate has the most Catholics in Australia with 44.4% of population. The Division was set up in 1906 and named after the Maribyrnong River, which runs through it. Maribynong is an Indigenous Australian word for yam or edible root. ==Members== Member Party Term Samuel Mauger Protectionist 1906–1909 Commonwealth Liberal 1909–1910 James Fenton Labor 1910–1931 United Australia 1931–1934 Arthur Drakeford Labor 1934–1955 Philip Stokes Liberal 1955–1969 Moss Cass Labor 1969–1983 Alan Griffiths Labor 1983–1996 Bob Sercombe Labor 1996–2007 Bill Shorten Labor 2007–present Samuel Mauger was the Post-Master General in 1908. James Fenton was the Minister for Trade and Customs in the Scullin Government, and Post-Master General in the Lyons Government. Arthur Drakeford was the Minister for the Air, Minister for Civil Aviation, and for a short time Minister for the Navy during the Curtin and Chifley Governments. Moss Cass was the Minister for the Environment and Conservation in the Hawke Government. Alan Griffiths was the Minister for Resources in 1990, the Minister for Tourism in 1991 and the Minister for Industry, Technology and Regional Development in 1993. Bill Shorten is the former National Secretary of the Australian Workers' Union. He was Minister for Employment and Workplace Relations and Minister for Education during the Gillard and Rudd governments. In 2013 he became the leader of the Australian Labor Party, and the Leader of the Opposition. ==Election results== ==References== ==Other websites== * Division of Maribyrnong - Australian Electoral Commission * Bill Shorten's website Category:Electoral divisions of Victoria, Australia Category:1906 establishments in Australia",
 "title": "Division of Maribyrnong"
}