{
 "id": "414365",
 "text": "Auguste Jean Baptiste Chevalier was a French botanist, and explorer of tropical Africa, especially of French Africa and Côte d'Ivoire. ==Biography== Chevalier was born on 23 June 1873 in Domfront, a town in Orne, Lower Normandy, France. His family had a small farm in Normandy and he studied first in Domfront and then in Caen. He finished high school in 1891 and began to study at Caen University and, in 1893, Élie Antoine Octave Lignier, botanist at the university, put him in charge of making the catalog of the university herbarium. After his military service in 1894, he got his degree in natural sciences in 1896 and he began to work with the botanist Charles Eugene Bertrand at the University of Lille. In 1897, he got a scholarship, allowing him to enter the botanical laboratory of Philippe Van Tieghem at the National Museum of Natural History. From 1899 to 1900, he was part of a scientific travel to Sudan. Chevalier got a doctorate in 1901 and then made many scientific travels, mainly to Africa but also to tropical Asia and to South America. He became an assistant in the Colonial Agriculture Laboratory of the École pratique des hautes études (an establishment of research and higher education); in 1907 he became the deputy director of the institution and then in 1912 was made director of it. In 1921, he began publishing the journal Revue de Botanique Appliquée, in French, where he wrote many articles. Christophe Bonneuil, « Auguste Chevalier, Savant colonial», in \"Les Sciences hors d'Occident au 20ème Siècle : Colloque = 20th Century Sciences : beyond the Metropolis : Colloquium\", 1994/09, Paris In 1929 he was made professor of crop production at the National Museum of Natural History of France; he remained here until his retirement in 146. He became a member of the French Academy of Sciences in 1937. After his death in 1956, the Domfront municipality gave his name to the high school of the city in 1959. ==Publications== Partial list of articles and books of Auguste Chevalier: * 1901 : Monographie des Myricacées : anatomie et histologie, organographie, classification et description des espèces, distribution géographique, in Mémoires de Société des Sciences Naturelles de Cherbourg 22:85-340. ( in Biodiversity Heritage Library. Retrieved on 20 August 2013.) * 1907 : Mission Chari-Lac Tchad 1902-1904 : L'Afrique centrale française : Récit du voyage de la mission, Paris, éditions Challamel. (Télécharger sur Internet Archives. Retrieved on 21 August 2013.) * 1908 : La forêt vierge de la Côte d'Ivoire, Masson, Paris * 1935 : Les Îles du Cap-Vert : Géographie, biogéographie, agriculture : Flore de l'archipel, Paris, laboratoire d'agronomie coloniale du Muséum national d'histoire naturelle. (Télécharger sur Tela Botanica : Le Réseau de la botanique francophone. Retrieved on 18 August 2013.) * 1935 : « Les Dépôts quaternaires de l'ancien cratère de Pedra de Lume (île de Sal, archipel du Cap-Vert) », avec Léonce Joleaud et Georges Petit, dans Comptes- rendus des séances de l'Académie des sciences, vol.200, pp. 1334-1336. * 1942 : L'Agriculture coloniale : Origines et évolution, Presses universitaires de France, coll. « Que sais-je? ». * 1944 : Le Café, Presses universitaires de France, coll. « Que sais-je? ». ==References== ==Other websites== * Auguste Chevalier, un éminent botaniste français. Lycée Auguste-Chevalier * Bonneuil, C. Auguste Chevalier Savant colonial * Short biography with Photo of Chevalier Category:French botanists Category:French explorers Category:1873 births Category:1956 deaths Category:People from Orne",
 "title": "Auguste Jean Baptiste Chevalier"
}