{
 "id": "414339",
 "text": "The Division of Melbourne Ports was an Australian federal electoral division in the inner south-eastern suburbs of Melbourne, Victoria, Australia. It was set up for the first election in 1901. At the time it was named Melbourne Ports as it covered both Port Melbourne and Williamstown. Later it included the suburbs of Albert Park, Balaclava, Caulfield, Caulfield East, Caulfield North, part of Elsternwick, Elwood, Middle Park, Port Melbourne, Ripponlea, St Kilda, St Kilda East, St Kilda West, Southbank, South Melbourne and parts of South Yarra and Docklands. It was abolished in 2019, and renamed as Macnamara. ==Members== Image Member Party Term Notes Samuel Mauger Protectionist 1901–1906 Previously held the Victorian Legislative Assembly seat of Footscray. Transferred to the Division of Maribyrnong James Mathews Labor 1906–1931 Retired Jack Holloway Labor 1931–1951 Previously held the Division of Flinders. Served as minister under John Curtin, Frank Forde and Ben Chifley. Retired Frank Crean Labor 1951–1977 Previously held the Victorian Legislative Assembly seat of Albert Park. Served as minister and Deputy Prime Minister under Gough Whitlam. Retired Clyde Holding Labor 1977–1998 Previously held the Victorian Legislative Assembly seat of Richmond. Served as minister under Bob Hawke. Retired Michael Danby Labor 1998–2019 Retired Samuel Mauger was later elected to the Division of Maribyrnong. Jack Holloway became Minister for Social Services and Minister for Health in 1941. From 1943–1949 he was Minister for Labour and National Service. Frank Crean was Treasurer and Minister for Trade in the Whitlam Government. In 1975 he was Deputy Prime Minister of Australia. Clyde Holding had been the Leader of the Opposition in the Victorian Parliament. He held several positions in the Hawke Government including Aboriginal Affairs, Employment Services and Youth Affairs, Transport and Communications Support, Immigration, Local Government and Ethnic Affairs. ==Election results== * 2004 election results * 2007 election results * 2010 election results * 2013 election results ==References== ==Other websites== *Division of Melbourne Ports – Australian Electoral Commission *Michael Danby's website Category:Former electoral divisions of Australia Category:Electoral divisions of Victoria, Australia Category:1901 establishments in Australia Category:Melbourne",
 "title": "Division of Melbourne Ports"
}