{
 "id": "414590",
 "text": "The Caledonian Forest is a type of woodland that once covered vast areas of Scotland. Today, parts of the original forest survive, covering in 84 places. The forests are home to a wide variety of wildlife, much of which is not found elsewhere in the British Isles. ==History== The Caledonian forests were formed at the end of the last ice age. Trees began to recolonise what is now the British Isles over a land bridge which is now beneath the English Channel. Forests of this type were found all over what is now the island of Great Britain for a short period. Then the climate began to warm and the pine wood retreated north into the Scottish Highlands. The native pinewoods which formed this westernmost outpost of the boreal forest of Europe are estimated to have covered as a vast wilderness of pine, birch, rowan, aspen, juniper, oak and a few other species. On the west coast, oak and birch predominated in a temperate rainforest ecosystem rich in ferns, mosses and lichens. The forest takes its name from the Romans, who called Scotland Caledonia, from the early Celtic word '*caleto-' meaning 'hard, strong'. The name was used by a local tribe or tribal confederation of native Picts or Britons called the Caledonii. == Rewilding == Today less than 1% of the original native pinewood forest survives, in isolated remnants. The only real future of the once great forest is rewilding. This amounts to keeping sections free of deer and hogs until trees have a chance to grow. Natural predators are also needed to keep control of herbivores which would otherwise eat everything before trees could grow. Alan Watson Featherstone explains his life's work.Restoring the ancient Caledonian Forest. ==Wildlife== A unique ecosystem in the British Isles, the Caledonian pinewoods are home to some of the country's rarest wildlife. It is one of the last remaining wildernesses in the British Isles, but most of it has gone. Breeding bird species in Caledonian pine forests which breed nowhere else in the British Isles: *Black-throated diver *Capercaillie *Common goldeneye *Crested tit *Golden eagle *Greenshank *Horned grebe *Parrot crossbill *Red-throated diver *Redwing *Scottish crossbill *Temminck's stint *Wood sandpiper Breeding bird species in Caledonian pine forests rare elsewhere in the British Isles: *Black grouse *Common crossbill *Goosander *Siskin *Redpoll *Osprey *Red-breasted merganser *Long-eared owl Mammal species present in Caledonian pine forests: *European beaver The Scottish Beaver Network (viewed June 11th 2009) *Feral goat *Mountain hare *Pine marten *Red deer *Red fox *Red squirrel *Roe deer *Wildcat == References == Category:Forests of the United Kingdom Category:Geography of Scotland Category:Conservation",
 "title": "Caledonian Forest"
}