{
 "id": "414562",
 "text": "Iranian Azerbaijanis (Azerbaijani: ایران آذربایجانلیلاری; Persian: ایرانیان آذربایجان) are Iranians of Azerbaijani ethnicity. They are primarily found in and are native to the region of Iranian Azerbaijan. Iranian Azerbaijanis are the second largest ethnic group in Iran. Iranian Azerbaijanis are traditionally sensitive to their ethnic identity, but are supportive of bilingualism in Azerbaijani and Persian as well.Mirvahedi, Seyed Hadi, ed. (2019). The Sociolinguistics of Iran's Languages at Home and Abroad: The Case of Persian, Azerbaijani, and Kurdish. Palgrave Macmillan. p. 53. == Origin == Iranian Azerbaijanis are a Turkic speaking people of mostly Iranian origin. According to Richard Frye, Iranian Azerbaijanis mainly descended from the earlier Iranian speakers of the region, who were Turkified after a massive migration of Oghuz Turks but still exist in smaller pockets, while Olivier Roy stated that Azerbaijanis as the descendants of the Iranian population of Azerbaijan (who spoke west Iranian languages such as Tati, which is still found in residual forms), which was Turkified by Turkomans from Anatolia from the 13th century onwards. The Azerbaijani language, who is lost the vocal harmony typical of Turkic languages, described as a Turkic language learned and spoken by Iranian peasants. According to Russian scholar Rostislav Rybakov, Iranian Azerbaijan was almost fully Turkicized by 14th and 15th centuries, though the local population left its mark in the Azerbaijani culture and language and the ethnic border between the Turkish people and Azerbaijanis was established in the 16th century.\"\"History of the East\" (\"Transcaucasia in 11th–15th centuries\" in Rostislav Borisovich Rybakov (editor), History of the East. 6 volumes. v. 2. \"East during the Middle Ages: Chapter V., 2002. – . )\". In 1900, Joseph Deniker, stated that Azerbaijanis of Caucasus and Iran, who spoke a Turkic language, of the same physical type as Persians, who spoke an Iranian language. === Genetics === A comparative study (2013) on the complete mitochondrial DNA diversity in Iranians has indicated that Iranian Azerbaijanis are more related to the people of Georgia, than they are to other Iranians, as well as to Armenians. The same multidimensional scaling plot demonstrates the intermediate position of Caucasian Azerbaijanis between the Azerbaijanis/Georgians and Turks/Iranians groupings.Derenko, M., Malyarchuk, B., Bahmanimehr, A., Denisova, G., Perkova, M., Farjadian, S., & Yepiskoposyan, L. (2013). Complete Mitochondrial DNA Diversity in Iranians . PLoS ONE, 8(11), e80673. There is no significant difference between them and the other major ethnic groups of Iran. According to HLA testing, Azerbaijanis of Iran cluster together with the Turkmens of Gorgan and Kurds and constitute an intermediate position between Iranian populations and Western Siberians, specifically Chuvash, Mansi people, and Buryats (subgroups of Turkic peoples, Ugrians, and Mongols respectively). Several genetic studies show that the Azerbaijanis' gene pool largely overlap with that of the native populations in support of language replacement, including elite dominance, scenarios, while also demonstrating significant genetic influence from Siberia and Mongolia. No close genetic relationship was observed between Azerbaijanis of Iran and the people of Turkey or Central Asians. A study conducted on Azerbaijanis of Tabriz in 2022 also concluded that the genetic origins and Turkic language of the Azerbaijanis are do not correlate. == Identity == The Azerbaijanis are a Turkic speaking, predominantly Shia Muslim people and are culturally part of the Iranian peoples.\"Land and People\" In \"Azerbaijan, country, Asia\". Columbia Encyclopedia, 6th ed. Columbia University Press. \"The Azeri (Azerbaijani), a Turkic-speaking, Shiite Muslim people of Persian culture, make up about 90% of the republic's population; Dagestanis, Russians, and Armenians (largely in Nagorno-Karabakh) are the largest minorities.\" The Azerbaijani language belongs to the Oghuz branch of the Turkic language family. Iranian Azerbaijani material culture is a result of multi-secular symbiosis, is thus a subtle combination of indigenous elements and nomadic contributions. Most of the Iranian Azerbaijanis call themselves and are referred to as \"Turks\" but also insist on their Iranian identity. Buttressed not only by the religious bond (being mostly Shia Muslim in contrast to the Turkish people of Anatolia, who are Sunni Muslims) but also by cultural, historical, and economic factors. Iranian Azerbaijanis are committed to Iranian culture and consider their destiny to be with the Persians rather than with \"other Turks.\" Because of this, morerecently, in World War II, contact with the Azerbaijanis in Soviet Union were not overly cordial. === Role of the Iranian Azerbaijanis in Iranian nationalism === According to Ahmadi, the nationalism in Iran is that it has been largely promoted by intellectuals coming from the ethnically populated or originally non-Persian-speaking areas of Iran, in this case, Azerbaijani- speaking elites have played a remarkable role. Azerbaijani intellectuals such as Mirza Fatali Akhundov, Kazemzadeh Iranshahr, Ahmad Kasravi, Hassan Taqizadeh, Mahmoud Afshar, Taqi Arani, Yahya Zoka, Rezazadeh Shafaq, Javad Tabatabai, and others have contributed to the idea of nationalism and Iranian national identity and culture. In addition to being, one of the forerunners of modern Iranian nationalism, Akhundov is also one of the founders of modern Iranian literature.Tadeusz Swietochowski, Russia and Azerbaijan: A Borderland in Transition (New York: Columbia University Press), 1995, pp. 27–28: Mirza Fatali Akhundov is not the only Azerbaijani intellectual in framing Iranian ultra-nationalism. Hassan Taqizadeh, the organizer of \"Iran Society\" in Berlin, has contributed to the development of Iranian nationalism. Since 1916 he published Kaveh periodical in Persian language, which included articles emphasizing the racial unity of Germans and Iranians.بهنام، جمشید (1386). برلنی ها: اندیشمندان ایرانی در برلن 1915–1930. نشر فرزان، تهران.فشار یزدی، محمود (1338). \"زوال زبان فارسی یعنی زوال ملت ایران.\" در آینده، دوره چهارم، شماره 4، مسلسل 44 (اسفند 1388)، صص 268- Mahmoud Afshar, in various articles in his journal Āyanda (1925–27, 1944–45, 1955), a political scientist, pioneered a systematic scholarly treatment of various aspects of Iranian national identity, territorial integrity, and national unity. An influential nationalist, he also displayed a strong belief in the nationalist character of Iranian people throughout the country’s long history. He was the first to propose the idea of pan-Iranism to safeguard the unity and territorial integrity of the nation against the onslaught of pan-Turkism and pan-Arabism. Ahmad Kasravi was the first Iranian Azerbaijani intellectual to take a strong position against Ottoman pan-Turkists and wrote the most significant work on the Iranian identity of Azerbaijan and its original Iranian language before the Turkification, Old Azeri. This work enjoyed worldwide scholarly success. The publication of this work can also be considered an affirmation of the indestructible bond of Turkophone Iranians to Iran. Kazemzadeh Iranshahr, an ardent nationalist, set forth his views in a number of essays in his journal (1922–26), and more specifically in his Tajalliyāt-e ruḥ-e irāni (). He had maintained a clear romantic and primordialist notion of the Aryan race and the superior character of the Iranian peoples, which has manifested itself throughout the history of the nation. ==== Reactions to irredentism of Republic of Azerbaijan ==== In the post-Soviet era, when Elchibey, his Azerbaijani Popular Front Party, and other political elites and printed media initially launched their irredentist claims toward Iranian Azerbaijan by raising ideas such as \"united Azerbaijan\" or \"the ques tion of southern Azerbaijan,\" Iranian Azerbaijanis were among the first to refute the historicity of such claims, beginning their historical, political and cultural research to launch an Iranian counter-argument. Kaveh Bayat, the contemporary Iranian historical researcher, wrote the first articles on pan-Turkism. In his other works, he presented documentary analysis of the early pan-Turkist claims against Iran in Turkey of the 1920s, and showed how Iranian Azerbaijani intellectuals and activists, such as Ali Sadeghi Tabrizi, Habibollah Nobakht, Taqi Arani, Moghaddam Bayat, and Rezazadeh Shafagh, were at the forefront of the fight for the defense of the Iranian identity of Azerbaijan and the Persian language. == Demographics == Sources indicate that Azerbaijanis make up about 16 to 24 per cent of total population of Iran, making them the second largest ethnic group in Iran after the Persians. == Sources == * * * * * * * * * * * * * Category:Azerbaijani people Category:Ethnic groups in Iran ==Notes==",
 "title": "Iranian Azerbaijanis"
}