{
 "id": "414722",
 "text": "The Count of Flanders was the ruler or leader of the county of Flanders from the 9th century until the French Revolution in 1790. The first count was Baldwin I \"Iron Arm\".Jeff Rider, 'Vice, Tyranny, Violence, and the Usurpation of Flanders (1071) in Flemish Historiography from 1093 to 1294', Violence and the Writing of History in the Medieval Francophone World, eds. Noah D. Guynn; Zrinka Stahuljak (Woodridge, Suffolk: D.S. Brewer, 2013), p. 55 By expanding its borders the early counts managed to keep Flanders independent. Later, the lack of natural borders allowed invaders into Flanders. Andre de Vries, Flanders : A Cultural History: A Cultural History (Oxford; New York: Oxford University Press, 2007), p. xiii Counts of Flanders were always concerned with hunting and preserving their hunting grounds. For that reason many were called foresters. Andre de Vries, Flanders : A Cultural History: A Cultural History (Oxford; New York: Oxford University Press, 2007), p. xvi The last count was Francis II. After 1795 Flanders no longer existed as a county. ==List of Counts of Flanders== === 1st House of Flanders === *Baldwin I Iron Arm (863-879), married Judith daughter of Charles the Bald. *Baldwin II the Bald (879-918), son of Baldwin I and Judith *Arnulf I the Great (918-964), son of Baldwin II, joinly with: **Baldwin III (958-962), son of Arnulf I *Arnulf II (964-988), son of Baldwin III *Baldwin IV the Bearded (988-1037), son of Arnulf II *Baldwin V de Lille (1037-1067), son of Baldwin IV *Baldwin VI (1067-1070), son of Baldwin V, Count of Hainaut *Arnulf III (1070-1071), son of Baldwin VI, Count of Hainaut *Robert I the Frisian (1071-1093), son of Baldwin V *Robert II (1093-1111), son of Robert I *Baldwin VII Hapkin (1111-1119), son of Robert II === House of Estridsen === *Charles I the Good (1119-1127), cousin of Baldwin VII, designated by him === House of Normandy === *William I Clito (1127-1128), great-grandson of Baldwin V, designated by Louis VI of France === House of Alsace or House of Metz === *Theodoric (1128-1168), grandson of Robert I, recognised by Louis VI of France *Philip I (1168-1191), son of Theodoric *Margaret I (1191-1194), daughter of Theodoric, **jointly with her husband Baldwin of Hainaut === 2nd House of Flanders === *Baldwin VIII (1191-1194), husband of Margaret I, patrilineal great-great- grandson of Baldwin VI, also Count of Hainaut *Baldwin IX (1194-1205), son of Baldwin VIII, also Latin Emperor of Constantinople *Joan I (1205-1244), daughter of Baldwin IX, jointly with **Ferdinand (1212-1233) **Thomas (1237–1244) *Margaret II (1244-1278), sister of Joan, married first to Burchard IV of Avesnes and then William of Dampierre **jointly with her sons from second marriage, William III of Dampierre (1247-1251) and Guy of Dampierre (1251-1305) :In 1244, the Counties of Flanders and Hainaut were claimed by Margaret II's sons, the half-brothers John I of Avesnes and William III of Dampierre in the War of the Succession of Flanders and Hainault. In 1246, King Louis IX of France awarded Flanders to William. === House of Dampierre === *William I (1247-1251), son of Margaret II and William II of Dampierre *Guy I (1251-1305), son of Margaret II and William II of Dampierre, also Count of Namur *Robert III (\"the Lion of Flanders\") (1305-1322), son of Guy *Louis I (1322-1346), grandson of Robert III *Louis II (1346-1384), son of Louis I *Margaret III (1384-1405), daughter of Louis II, **jointly with her husband, Philip II === House of Burgundy === *John the Fearless (1405-1419), son of Margaret III and Philip II of Burgundy *Philip III the Good (1419-1467), son of John *Charles II the Bold (1467-1477), son of Philip the Good *Mary the Rich (1477-1482), daughter of Charles the Bold, jointly with her husband Maximilian I, Holy Roman Emperor === House of Habsburg === *Philip IV the Handsome (1482-1506), son of Mary and Maximilian *Charles III (1506-1555), son of Philip, also Holy Roman Emperor (as Charles V) and King of Spain (as Charles I) Charles V proclaimed the Pragmatic Sanction of 1549 eternally uniting Flanders with the other lordships of the Low Countries in a personal union. When the Habsburg empire was divided among the heirs of Charles V, the Low Countries, including Flanders, went to Philip II of Spain, of the Spanish branch of the House of Habsburg. *Philip V (1555-1598), son of Charles III, also King of Spain as Philip II *Isabella Clara Eugenia (1598-1621), daughter of Philip II, **jointly with her husband Albert, Archduke of Austria) *Philip VI (1621-1665), grandson of Philip III, also King of Spain as Philip IV *Charles IV (1665-1700), son of Philip IV, also King of Spain as Charles II *Philip VII (House of Bourbon) (1700-1706), great-grandson of Philip IV Between 1706 and 1714 Flanders was invaded by the English and the Dutch during the War of the Spanish Succession. The fief was claimed by the House of Habsburg and the House of Bourbon. In 1713, the Treaty of Utrecht settled the succession and the County of Flanders went to the Austrian branch of the House of Habsburg. *Charles V (1714-1740), great grandson of Philip III, also Holy Roman Emperor (elect) *Maria Theresa (1740-1780), daughter of Charles IV, jointly with **Francis I (1740-1765) *Joseph I (1780-1790), son of Maria Theresa and Francis I *Leopold (1790-1792), son of Maria Theresa and Francis I *Francis II (1792-1835), son of Leopold, also Holy Roman Emperor The title was abolished after revolutionary France annexed Flanders in 1795. Francis II relinquished his claim on the Low Countries in the Treaty of Campo Formio of 1797. The area remained part of France until the end of the Napoleonic Wars. == References == Category:Counts and countesses of Flanders Category:History of France",
 "title": "Count of Flanders"
}