{
 "id": "414827",
 "text": "Felix Arvid Ulf Kjellberg (born 24 October 1989), better known by his online username PewDiePie, is a Swedish YouTuber. His content has changed significantly since he began uploading, now focusing on Minecraft gaming videos and established series such as 'You Laugh You Lose' and 'Last Week I Asked You (LWIAY)' where he reviews memes that his fans have posted on Reddit. He has over 111 million subscribers as of January 2024, but is slowly losing subscribers now as YouTube is removing inactive subscribers. On 15 August 2013, his channel became the most subscribed channel on YouTube. He was also the first YouTuber creator to get 100 million subscribers. == Early life == PewDiePie was born on 24 October 1989 in Gothenburg, Sweden. Before starting his own YouTube channel, PewDiePie studied Industrial Economics and Technology Management at Chalmers University of Technology until he dropped out. Disapproving of his decision, his parents cut off his support. He made a living by selling hot dogs until his channel got enough subscribers for him to make a living from the channel. == Career == === YouTube === In 2013 PewDiePie surpassed Smosh making him the Number 1 Youtuber. PewDiePie was the first channel ever to pass 50 million subscribers. PewDiePie is attempting to break the like record on YouTube. PewDiePie was the first individual creator ever to pass 100 million subscribers on YouTube as of August 2019, though he did lose the position of being the first channel ever to reach that milestone by the Indian music channel T-Series in months earlier. PewDiePie has been creating content that can be described as \"silly and fun\". Videos such as Meme Review, You Laugh You Lose (YLYL), Pew News, and Last Week I Asked You (LWIAY) are just a few examples. Recently, he has been uploading many Minecraft videos. In 16 November 2022 MrBeast surpassed PewDiePie. == Personal life == PewDiePie lives in Japan. He formerly lived in Brighton, England with his wife, Marzia Bisognin, who is also a former YouTuber. In 2019 he married his long-time girlfriend, Marzia Bisognin. The marriage was held at Kew Gardens in London, England. == Notes == == References == == Other websites == * * * Category:1989 births Category:Living people Category:People from Gothenburg Category:Swedish YouTubers",
 "title": "PewDiePie"
}