{
 "id": "414916",
 "text": "Baldwin I (died 879), also known as Baldwin Iron Arm (), was a French nobleman and became the first count of Flanders. == Career == Baldwin's father was named Audacer but little else is known of him.David Nicholas, Medieval Flanders, (New York: Longman, 1992), p. 16 His family was related to the counts of Laon. Before holding Flanders Baldwin was already a count, probably at Ghent. Baldwin was in Senlis in 862. Somehow he decided to take Judith, the daughter of Charles the Bald, the king, for his wife.Patricia Carson, The Fair Face of Flanders (Tielt, Belgium: Drukkerij Lannoo NV, 2001), p. 29 Judith, had been the wife of two English kings, Athelwulf († 858) and Athelbald († 860).Philip Grierson, 'The Relations between England and Flanders before the Norman Conquest', Transactions of the Royal Historical Society, Fourth Series, Vol. 23 (1941), p. 84 On her return and still in her teens she was being held at the castle of Senlis by her father.Eleanor Shipley Duckett, Carolingian Portraits; A Study in the Ninth Century (Ann Arbor: The University of Michigan Press, 1988), p. 220 Baldwin took Judith, the twice widowed daughter of Charles the Bald, and the couple fled to the court of Lothair II, king of Lorraine. He was Judith's cousin. Once they were safely out of her father's reach Baldwin married her. This was about 863. King Charles had his bishops excommunicate the couple. He also demanded that his nephew return Baldwin and his daughter Judith to him. At this point Baldwin and Judith fled to Rome. They asked Pope Nicholas I to intercede and legitimize their marriage. Baldwin made known his intent to join the Vikings if his marriage was not allowed. Vikings were a constant threat in northern France and Baldwin was needed to help fight them. The pope decided their marriage was valid and had the bishops withdraw their excommunication. Charles the Bald was forced to accept Baldwin as his son-in-law. The couple was married a second time, in public. Her father did not attend but sent officials to witness the marriage.Eleanor Shipley Duckett, Carolingian Portraits; A Study in the Ninth Century (Ann Arbor: The University of Michigan Press, 1988), p. 222 He gave Baldwin the honors the pope recommended. Baldwin was given rule over Flanders with the title of margrave (count of a borderland) of Flanders.The Oxford Encyclopedia of Medieval Warfare and Military Technology, Vol. 1, ed. Clifford Rogers (New York: Oxford University Press, 2010), p. 105 He protected Flanders for the next fifteen years from Vikings. He became known for his harsh treatment of anyone attacking Flanders. This later gave him the name \"Baldwin Iron Arm\". In 867 Baldwin built a castle at Ghent to protect from Viking raids.Randall Fegley, The Golden Spurs of Kortrijk: How the Knights of France Fell to the Foot Soldiers of Flanders in 1302 (Jefferson, NC; London: McFarland, 2002), p. 78 The city built up around the castle. Ghent became the seat of his countship. Baldwin also built a castle at Bruges, the port city on the North Sea. It too was for the purpose of stopping Viking plundering.Randall Fegley, The Golden Spurs of Kortrijk: How the Knights of France Fell to the Foot Soldiers of Flanders in 1302 (Jefferson, NC; London: McFarland, 2002), pp. 5-6 When Charles the Bald died in 877, Baldwin faithfully supported his son, Louis the Stammerer, helping him become king of the Franks. Baldwin died in 879. == Family == Baldwin married Judith (–after 870), daughter of Charles the Bald, King of the Franks and Holy Roman Emperor.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A., Stargardt, 1984) Tafel 82 Together they had: * Baldwin II (–918), he succeeded his father as count. * Raoul (Rodulf) († 896), Count of Cambrai. * Guinidilda, she married Wifredo I, Count of Barcelona.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A., Stargardt, 1984) Tafel 68 == Notes == ==References== Category:879 deaths Category:Counts and countesses of Flanders Category:9th-century births",
 "title": "Baldwin I, Count of Flanders"
}