{
 "id": "41492",
 "text": "Edward the Confessor (4 April 1003 — 5 January 1066) also nicknamed as the Saint, the Pious, and the Faithful was the King of England from 1042 until his death in 1066. During his reign, England experienced peace, stability, and prosperity. The kingdom was also very unstoppable and also, the kingdom's life quality and the standard of living and health care improved as well. Edward spent many years in Normandy. The Anglo-Saxon nobles invited Edward back to England in 1041. He became part of the household of his half-brother Harthacnut. According to the Anglo-Saxon Chronicle both were sworn in as king together. Following Cnut II's death on 8 June 1042, Edward ascended the throne. The Anglo-Saxon Chronicle indicates the popularity he enjoyed at his accession — \"before he (Cnut II) was buried, all the people chose Edward as king in London\". Edward was crowned at the cathedral of Winchester, the royal seat of the West Saxons on 3 April 1043. == The succession == Edward's death left England without a clear-cut successor. Harold Godwinson had led successful raiding parties into Wales in 1063. He negotiated with his inherited rivals in Northumbria in 1065, and in January 1066, upon Edward's death, he was made King Harold II. The Norman position was that William the Conqueror had been designated the heir, and that Harold had been publicly sent to him as emissary from Edward, to apprise him of Edward's decision. However, William's biographer, William of Poitiers, admitted that the old king had made a deathbed gift of the crown to Harold.Barlow, Frank 1997. Edward the Confessor. Oxford: Oxford University Press. p252. On Edward's death, Harold was approved by the Witenagemot which, under Anglo-Saxon law, held the ultimate authority to convey kingship. Edward also made his great nephew Edgar Ætheling his heir. However, Edgar had no following among the earls: he had lived in Hungary, and was a boy of fifteen. This opened the way for Harold's coronation, and the invasions of two claimants to the throne, the unsuccessful invasion of Harald Hardrada in the north and the successful one of William of Normandy. Edward was canonized (made a saint) in 1161 by Pope Alexander III, and is commemorated on 13 October. ==Related pages== * Harold Godwinson * William the Conqueror * Battle of Hastings == References == == Other websites == * England, Anglo-Saxon & Danish Kings (-1066) on Medieval Lands Category:1003 births Category:1066 deaths Category:Christian saints Category:House of Wessex Category:People buried in Westminster Abbey Category:11th century in England",
 "title": "Edward the Confessor"
}