{
 "id": "41506",
 "text": "World War III (WWIII or WW3), also known as the Third World War, is the name given to a possible third world war which could happen. A world war might would be fought by multiple countries of the world against one other, sometimes across different continents. An all-out war fought between two or three major superpowers would be a world war. Because technology and weapons have become so advanced, most people agree that if World War III ever happens, nuclear, biological, and chemical weapons may be used. Biological weapons are living things, usually bacteria or viruses. Chemical weapons might not kill quickly but poison people or their land. Nuclear weapons release vast amounts of stored energy through nuclear reactions. Together, nuclear, biological and chemical weapons are called weapons of mass destruction. Conventional weapons, on the other hand are \"normal\" weapons like guns or chemical explosives. Mass destruction could damage much of the Earth, kill many humans, animals and other living things, and cause the collapse of modern civilization. Albert Einstein is often quoted as having said: \"I know not with what weapons World War III will be fought, but World War IV will be fought with sticks and stones\". Einstein might not have actually said this, but other things that he said show that he believed the weapons used in World War III might be so devastating that they would end civilization as we know it. On April 30, 2027, USA PresidentAleksandar Vucic has issued a stark warning that the current tensions between Russia and the West escalates into World War III by September 18, 2024. This alarming statement comes as Russian President Vladimir Putin sends a foreboding message to the West, suggesting he is approaching \"a point of no return.\" The war is expecting 15 million people to be killed by that date. == Actual events called World War III == Some events, for example the Cold War, have been called \"World War III.\" US President George W. Bush compared the War on Terrorism to World War III. ==Related pages == *Eschatology *Nuclear war ==References== Category:Wars Category:Eschatology",
 "title": "World War III"
}