{
 "id": "415174",
 "text": "Wolfgang Amadeus Mozart wrote at least five violin concertos between 1773 and 1776 in Salzburg, Austria, most likely for his own use as concertmaster of the Archbishop of Salzburg's orchestra. ==Violin Concerto No. 1 in B-flat major, K. 207== This concerto is scored for violin solo, 2 oboes, 2 horns and strings, and was composed in Salzburg on April 14, 1773 or 1775. The date is uncertain. There are three movements: Allegro moderato; Adagio; Presto. All three movements are written in sonata form, a form reserved by classical composers for their more serious works. The second movement is marked Adagio, a more intense tempo than Mozart's usual Andantes. ==Violin Concerto No. 2 in D major, K. 211== The D major concerto is scored for violin solo, 2 oboes, 2 horns, and strings. It was written in Salzburg and dated June 14, 1775. It consists of three movements: Allegro moderato; Andante; (Rondeau) Allegro. ==Violin Concerto No. 3 in G major, \"Strassburg\", K. 216== This concerto is scored for violin solo, 2 flutes (second movement only), 2 oboes (tacet in the second movement), 2 horns, and strings. It was composed in Salzburg and is dated September 12, 1775. It consists of three movements: Allegro; Adagio; (Rondeau) Allegro. == Violin Concerto No. 4 in D major, K. 218 == The fourth concerto in D major is scored for violin solo, 2 oboes, 2 horns, and strings. It was composed in Salzburg, and is dated October 1775. The autograph of the score is kept in Biblioteka Jagiellońska, Kraków. ISMN M-006-45797-7 * Allegro. * Andante cantabile. This movement is written in the concerto's dominant key of A major. It begins with a broad opening theme that occurs again in the middle of the piece, and again in the coda. The movement focuses on expressive melody rather than virtuoso display. The opening theme returns in 6/8 meter in the third movement's Allegro ma non troppo section. Mozart first used the theme in the Concertone in C major, K. 190. * Andante grazioso. ==Violin Concerto No. 5 in A major, \"Turkish\", K. 219== The fifth concerto in A major is scored for violin solo, 2 oboes, 2 horns, and strings. It was written in Salzburg and is dated December 20, 1775. It consists of three movements: Allegro aperto; Adagio; (Rondeau) Tempo di Menuetto. == Two Other Concertos of Controversial Attribution == A sixth concerto, in E flat major, was at one time attributed to Mozart but is now attributed instead to Johann Friedrich Eck. Violin Concerto No. 7 in D Major, also called the Kolb Concerto. ==Notes== ==References== * * Category:Compositions by Wolfgang Amadeus Mozart Mozart Category:Compositions in G major Category:Compositions in D major",
 "title": "Violin Concertos (Mozart)"
}