{
 "id": "415266",
 "text": "Baldwin VI of Flanders (–1070), called Baldwin de Mons was a Frankish nobleman. He was the ruling Count of Hainaut (jure uxoris) from 1051 to 1070 (as Baldwin I) and succeeded his father as Count of Flanders from 1067 to 1070. == Career == Baldwin was the oldest son of Baldwin V, Count of Flanders and Adela of France. Adela was a daughter of king Robert II of France.Gilbert of Mons, Chronicle of Hainaut, Trans. Laura Napran (Woodbridge: The Boydell Press, 2005), p. 4 and Constance of Arles.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: Verlag von J. A. Stargardt, 1984), Tafel 187 He was also the brother of Matilda of Flanders, Queen consort of England and wife of William the Conqueror, King of England.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 5 His father arranged his marriage, under threat of arms, to Richilde, Countess of Hainaut.Renée Nip, 'The Political Relations Between England and Flanders (1066–1128)', Anglo-Norman Studies 21: Proceedings of the Battle Conference 1998, ed. Christopher Harper-Bill (Woodbridge: The Boydell Press, 1989), p. 147. She was the widow of Herman of Mons and heiress of Hainaut. Because Hainaut was a part of the Holy Roman Empire this enraged Emperor Henry III who had not been consulted. He went to war against the two Baldwins but was not successful. Between 1050 and 1054 Lambert II, Count of Lens fought alongside the Baldwins against Henry III. He was one of Baldwin V's leading vassals.K. S. B. Keats- Rohan, Domesday People, A Prosopography of Persons Occurring in English Documents 1066-1166 (Woodbridge: The Boydell Press, 1999), p. 196 Lambert was killed at the battle of Lille in 1054.John Carl Andressohn, The ancestry and life of Godfrey of Bouillon (Ayer Publishing, 1972), p. 20 Others fighting for the Counts of Flanders against Henry III included the lords of Alost.Heather J. Tanner, Families, Friends, and Allies: Boulogne and Politics in Northern France and England, c.879–1160 (Leiden: Koninklijke Brill NV, 2004), pp. 87–88 Richilde son Roger, from her first marriage, was thought by her not fit to be the next count of Hainaut. Baldwin and Richilde arranged for him to be the Bishop of Chalons. This allowed her son by her second marriage, Baldwin (II) to become the count of Hainaut. Her daughter by her first husband became a nun. Baldwin acquired the remainder of the county of Hainaut by fiefs and by purchasing allods. Baldwin died 17 Jul 1070. His early death left Flanders and Hainaut in the hands of his young son Arnulf III, with Richilde as regent.Renée Nip, 'The Political Relations between England and Flanders (1066–1128)', Anglo-Norman Studies 21: Proceedings of the Battle Conference 1998, Ed. Christopher Harper-Bill (Woodbridge: The Boydell Press, 1999), p. 154 Baldwin rebuilt the monastery of Hasnon and gave gifts of his own properties to support it. He placed monks there and made it his burial place.Herman (of Tournai), The Restoration of the Monastery of Saint Martin of Tournai, Ed. Lynn Harry Nelson (Catholic University of America Press, 1996), p. 27 == Family == Baldwin and Richilde were the parents of: *Arnulf III, Count of Flanders (–1071). *Baldwin II, Count of Hainaut (–1098). ==Notes== ==References== Category:1030s births Category:1070 deaths Category:Counts and countesses of Flanders Category:Counts of Hainaut",
 "title": "Baldwin VI, Count of Flanders"
}