{
 "id": "415227",
 "text": "Angry Birds Toons is a Finnish animated television series based on the Angry Birds series of games created by Rovio Entertainment. The series was first shown on channel Teletoon. It began on March 16, 2013. The duration of the episode was 2 minutes 48 seconds earlier, and later became 2 minutes 47 seconds. There are 52 episodes in the first season, and 26 in the second and third seasons. == Characters == The characters in Angry Birds Toons are birds, pigs, and other animals. None of the characters in the series say anything. Birds chirp, pigs grunt. But these sounds, including shouts, groans, growls, squeaks, squeals, laughter, etc., are being published by people, Finnish actors (often the authors of the series themselves are scriptwriters, directors, composers). === Birds === * Red is the clear leader among the birds. He takes special care of eggs, devoting all his free time to them. He tries to destroy pigs at the first opportunity. He made his first appearance in the episode \"Chuck Time\". * Jay, Jake, and Jim are three twin brothers who are cheerful and active chicks. They love pranks, and their actions often lead to trouble. They like to make fun of other birds and pigs. They made their first appearance in the episode \"Full Metal Chuck\". * Chuck is fast and athletic, a bit vain and arrogant. He has the ability to accelerate so that everything around he slows down. He made his first appearance in \"Chuck Time\". * Matilda is caring, kind, and has cooking skills, although sometimes her cooking can only be fed to pigs. Despite her kindness, Matilda can get very angry. She made her first appearance in the episode \"Egg Sounds\". * Bomb is fun and aggressive at the same time. He loves ice cream, corn and knows how to explode. He wants to do \"heroic\" deeds, but only succeeds sometimes. He made his first appearance in the episode \"Off Duty\". * Bubbles is cheerful and friendly, very fond of sweets, and when candy is taken away from him, he becomes enraged and does anything to get the candy back. Like the Bluebirds, they are a child. Can swell up to the size of Terence. He made his first appearance in the Halloween special \"Night of the Living Pork\". * Terence, as shown in this series, sullen, stubborn, and stern, even a little wild. Calm and solid as a wall. But despite this, he sometimes smiles. He made his first appearance in the episode \"Gardening with Terence\". * The Eggs are the unborn children of birds. According to the plot, pigs want to steal them and cook scrambled eggs from them. Each of the adult birds wants to instil their own character in their offspring. They made their first appearance in the episode \"Egg Sounds\". === Pigs === * Minion Pigs are the main population of Pig City, loyal servants of the King, ready to carry out any order. They are very sociable and social, they love parties and celebrations. They do not recognize high-ranking persons without their headdress. They made their first appearance in the episode \"Where's My Crown?\" * King Pig is the leader of the pigs. He dreams of getting bird eggs and making scrambled eggs from them. Greedy, stupid, fond of sweets. I'm used to the fact that everyone obeys his orders. Sometimes he behaves like a child. He also made his first appearance in \"Where's My Crown?\" * Corporal Pig is a pig with a helmet. He leads the minions and is also the head of the Pig King's guards. He constantly tries to steal bird eggs, but all his attempts and plans fail. He, once more, made his first appearance in \"Where's My Crown?\" * Foreman Pig is the head of security and Pig City's foreman. He wants to get a promotion from the King of Pigs, he is ready to do anything for this. He made his first appearance in \"Slappy-Go- Lucky\". * Chef Pig is the head chef and advisor to the King of Pigs. He dreams of taking the crown from him and becoming the ruler of Pig City. He made his first appearance in \"True Blue?\". * Chronicler Pig is the Chronicler, Priest, Judge, and Master of Ceremonies of Pig City, one of the Pig King's most loyal servants. He is very intelligent and calm. He made his first appearance in \"Love is in the Air\". * Professor Pig is a genius scientist and inventor, though his creations don't always work properly. He dreams of birds and pigs living in harmony. He made his first appearance in the episode \"Slappy-Go- Lucky\". * Fat Pig is a strong but narcissistic, arrogant and cowardly pig. He can sing very loudly. He made his first appearance in the episode \"El Porkador!\". * Hambo is a tenacious and brave fighter, a loyal apprentice of the Corporal. However, he is inattentive and a bit stupid. He made his first appearance in the episode of the same name \"Hambo\". * Muscle Pig is a pumped- up pig who is used to solving all problems with his immense strength. He loves to fight, but on the condition that he wins. He can't stand losing. He made his first appearance in the episode \"Hamshank Redemption\". == Episodes == The following is a list of all episodes of Angry Birds Toons, split into three seasons and released over the course of 3 years, between 2013 and 2016. === Season 1 (2013-2014) === # Chuck Time # Where's My Crown? # Full Metal Chuck # Another Birthday # Egg Sounds # Pig Talent # Cordon Bleugh! # True Blue? # Do as I say! # Off Duty # Slingshot 101 # Thunder Chuck # Gardening with Terence # Dopeys on a Rope # Trojan Egg # Double Take # Crash Test Piggies # Slappy- Go-Lucky # Sneezy Does It # Run Chuck Run # Hypno Piggies # Eggs Day Out # Gate Crasher # Hog Roast # The Bird That Cried Pig! # Hamshank Redimption # Green Pig Soup # Catch of the Day # Nighty Night Terence # Piggy Wig # Pig Plot Potion # Tooth Royal # Night of the Living Pork # King of the Castle # Love is in the Air # Fired Up # Clash of Corns # A Pig's Best Friend # Slumber Mill # Jingle Yells # El Porkador! # Hiccups # The Butterfly Effect # Hambo # Bird Flu # Piggies from the Deep # Oh Gnome! # Shrub It In # The Truce # Operation Opera # Chucked Out # Bomb's Awake === Season 2 (2014-2015) === # Treasure Hunt # Sweets of Doom # Party Ahoy # Hide and Seek # Sink or Swim # Super Bomb! # Just So # The Miracle of Life # Cave Pig # Joy to the Pigs # Dogzilla # Boulder Bro # Chuck Mania # Not Without My Helmet # Mona Litha # Sir Bomb of Hamelot # Bearded Ambition # Cold Justice # Slow the Chuck Down! # Brutal vs. Brutal # Eating Out # The Great Eggscape # Sleep like a Hog # Bombina # Pig Possessed # Epic Sax-Off === Season 3 (2015-2016) === # Royal Heist # Bad Hair Day # Golditrotters # A Fistful of Cabbage # Porcula # Didgeridork # The Porktrait # Fix It! # Age Rage # Catching the Blues # Last Tree Standing # Happy Hippy # Mind the Pony # Robo-Tilda # King of the Ring # Spaced Out # Battling Buttlers # Egghaustion # Short and Special # Hocus Porcus # Romance in a Bottle # The Butler Did It! # Stalker # Photochucked # Bake On! # Toy Hoggers == Development == Rovio had announced a TV series based on the Angry Birds video games for Q4 2012. They planed to produce 52 short (sub-3 minute) episodes.Angry Birds animated series coming this fall, is a movie next? The series was produced by Finnish animation studio Kombo, which Rovio bought in June 2011.Angry Birds animated TV series to premiere in Autumn 2012 The series will have 52 episodes, 4 seasons, and the theme song will be Angry Birds. \"I am happy to say we are going to roll out a weekly animation series this year of short format content,\" said Nick Dorra, head of animation at Rovio.Rovio confirms Angry Birds mobile animation series It aired on the Angry Birds apps on March 16-17, 2013. == References == Category:2013 animated television series Category:2013 television series debuts Category:2016 television series endings Category:American animated television series Category:Cartoon Network series Category:Comedy television series Category:Finnish culture Category:Flash animation Category:Traditional animation",
 "title": "Angry Birds Toons"
}