{
 "id": "415214",
 "text": "Humberto Maturana (September 14, 1928 - May 6, 2021) was a Chilean biologist and philosopher. He was one of the second-wave systems scientists and cyberneticians. Ramage, Magnus & Shipp, Karen 2012. Systems thinkers Maturana was born in Santiago, Chile. Maturana, with Francisco Varela, was known for creating the term autopoiesis about the nature of life.Maturana H. & Valera F. 1980. Autopoiesis and cognition: the realization of the living. Boston: Reidel. His work has been influential in many fields, mainly the field of systems thinking and cybernetics. Overall, his work is concerned with the biology of cognition. Maturana died on May 6, 2021 in Santiago from pneumonia at the age of 92. ==Publications== Books, a selection: * 1980. Autopoiesis and cognition: the realization of the living, with Francisco Varela. Boston Studies in the Philosophy of Science. * 1984. The tree of knowledge: biological basis of human understanding, with Francisco Varela. Revised edition 1992. * 1990. Biology of cognition and epistemology. Universidad de la Frontera. Temuco, Chile. * 1992 Conversations with Humberto Maturana: questions to biologist psychotherapist, with K. Ludewig. Universidad de la Frontera. Temuco, Chile. * 1994. Reflections and conversations, with Kurt Ludewig. Collection Family Institute. FUPALI Ed. Cordova. * 1994. Democracy is a work of art. Collection Roundtable. Linotype Ed Bogota Bolivar y Cia. * 1997 Objectivity: an argument to force. Santiago de Chile: Dolmen. * 1997 Machines and living things: autopoiese to do organização vivo. With Francisco Varela Porto Alegre: Medical Arts. * 2004. From being to doing: the origins of the biology of cognition, with Bernhard Poerksen. * 2009. The Origins of humanness in the biology of love, with Gerda Verden-Zoller and Pille Brunnel. * 2004. From biology to psychology. * 2009. Sense of humanity. == References == Category:1928 births Category:Chilean biologists Category:Systems scientists Category:2021 deaths Category:Scientists from Santiago Category:Philosophers Category:Writers from Santiago",
 "title": "Humberto Maturana"
}