{
 "id": "415496",
 "text": "Developmental coordination disorder is a chronic disability that affects coordination. It is also known as developmental motor coordination disorder, developmental dyspraxia or dyspraxia. Around 2-6% of people have dyspraxia. Four times as many males than females have it. David Grant 2010. That's the way I think: dyslexia, dyspraxia and ADHD explained. Oxford; New York: Routledge, p. 141. It is sometimes called 'clumsy child syndrome',Penny Deiner 2013. Inclusive early childhood education: development, resources, and practice. Belmont, CA: Wadsworth Cengage Learning, p. 395. but adults have it too. Most people with dyspraxia have other disabilities such as ADHD or autism and Hypermobility. There is no single cause of dyspraxia. It may not appear until later in childhood or sometimes even in adolescence. It cannot be cured: people who have it will live with it for life, however people are able to overcome it and find alternative ways to accomplish tasks which may usually be difficult without support. ==Signs== *Difficulty tying shoelaces *Difficulty running, crouching and climbing stairs *Poor coordination *Untidiness *Incorrect way of running *Self-care difficulties *Messy eating *Not doing well in Physical Education classes *Inability to ride a bike, jump rope and spin a hoop *Not alternating feet when going on stairs == Associated disorders == People who have developmental coordination disorder may also have one or more of these conditions: *Attention deficit hyperactivity disorder (ADHD) (inattention, hyperactivity, impulsive behaviour). *Autism spectrum disorder *Dyscalculia (difficulty with mathematics), *Dysgraphia (an inability to write neatly and/or draw), *Dyslexia (difficulty with reading and spelling), *Hypotonia (low muscle tone)Barnhart R.C. et al 2003. Developmental coordination disorder. Phys Therapy 83 (8): 722–31. PMID 12882613 *Sensory processing disorder *Specific language impairment (SLI) *Visual perception deficits ==Famous people with dyspraxia== Daniel Radcliffe has dyspraxia.Chris Irvine, 'Harry Potter's Daniel Radcliffe has dyspraxia', The Telegraph, Telegraph Media Group Limited (04 September 2013) == References == ==Other websites== *Dyspraxia Foundation website *Dyspraxia Yahoo Group Category:Disability",
 "title": "Developmental coordination disorder"
}