{
 "id": "415793",
 "text": "The Anthem of Armenian Soviet Socialist Republic () was the national anthem of Armenia when it was a republic of the Soviet Union.http://elibrary.lt/resursai/Uzsienio%20leidiniai/Countries/Russia/Himnai_USSR/Armenian%20lyrics.pdf Armenian lyrics The writer of the lyrics was Sarmen (Armenak Sarkisyan), a poet. The composer of this song was Aram Khachaturian. He was known for his ballets. Like many national anthems of republics of the Soviet Union, this song praised Vladimir Lenin, the October Revolution and Communism. It also praised the friendship of republics of the Soviet Union. \"Hayastan\" in the lyrics was the name that the Armenian ethnic called themselves. \"Severe\" in the lyrics means the Armenian history, such as earthquakes. After Armenia became independent from the Soviet Union in 1991, the national anthem was changed to Our Fatherland.Armenia (1944-1991), NationalAnthems.info, 2013. Kendall, David. ==Lyrics== Armenian lyrics Armenian Cyrillic script Romanization of Armenian IPA transcription Translation Սովետական ազատ աշխարհ Հայաստան՝ Բազում դարեր դաժան ճամփա դու անցար՝ Քաջ որդիք քո մաքառեցին քեզ համար՝ Որ դառնաս դու մայր հայրենիք հայության: Կրկներգ Փառք քեզ՝ միշտ փառք՝ Սովետական Հայաստան՝ Աշխատասեր՝ ճարտարագործ-շինարար՝ Ժողովրդոց սուրբ դաշինքով անսասան՝ Դու ծաղկում ես և կերտում լույս ապագադ: Լենինն անմահ մեզ հուրն անշեջ պարգեվեց՝ Մեր դեմ շողաց երջանկաբեր այգաբաց՝ Հոկտեմբերը կործանումից մեզ փրկեց Եվ տվեց մեզ նոր՝ պայծառ կյանք փառապանծ: Կրկներգ Մեծ Ռուսիան մեզ եղբայրության ձեռք մեկնեց՝ Մենք կերտեցինք ամրակուռ նոր պետություն՝ Լենինյան մեր կուսակցությունն իմաստուն Հաղթորեն մեզ դեպ կոմունիզմ է տանում: Կրկներգ Советакан азат ашхарһ Һајастан, Базум дарер дажан чамԥа ду анцар, Қаџ вордиқ қо мақар̌ецин қез һамар, Вор дар̌нас ду мајр Һајрениқ һајуҭјан. Кркнерг: Ԥар̌қ қез, мишт ԥар̌қ Советакан Һајастан, Ашхатасер, чартарагорҵ- шинарар, Жоғоврдоц сурб дашинқов ансасан, Ду цағкум јес јев кертум луйс апагад. Ленинн анмаһ мез һурн аншеџ паргевец, Мер дем шоғац јерџанкабер ајгабац, Һоктемберъ корҵанумиц мез ԥркец Јев твец мез нор, пајҵар кјанқ ԥарапанҵ. Кркнерг Меҵ Р̌усиан мез јеғбајруҭјан ѕер̌қ мекнец, Менқ кертецинқ амракур нор петуҭјун, Ленинјан мер кусакцуҭјунн имастун, Һағҭорен мез дер комунизм е танум. Кркнерг Sovetakan azat ašxarh Hajastan, Bazum darer dažan čampha du anchar, Khadž vordikh kho makhařechin khez hamar, Vor dařnas du majr Hajrenikh hajuthjan. Kærknerg: Phařkh khez, mišt phařkh Sovetakan Hajastan, Ašxataser, čartaragorc-šinarar, Žoqoværdoch surb dašinkhov ansasan, Du caqkum jes jev kertum lujs apagad. Leninn anmah mez hurn anšedž pargevech, Mer dem šoqach jerdžankaber ajgabach, Hoktemberæ korcanumich mez phærkech Jev tævech mez nor, pajcař kjankh phařapanc. Kærknerg Mec Řusian mez jeqbajruthjan dzeřkh meknech, Menkh kertechinkh amrakuř nor petuthjun, Leninjan mer kusakchuthjunn imastun, Haqthoren mez dep komunizm e tanum. Kærknerg [sɔvɛtɑkɑn ɑzɑt ɑʃχɑɾh hɑjɑstɑn ǀ] [bɑzum dɑɾɛɹ dɑʒɑn t͡ʃɑmpʰɑ du ɑnt͡sʰɑɹ ǀ] [kʰɑd͡ʒ vɔɾdikʰ kʰɔ mɑkʰɑrɛt͡sʰin kʰɛz hɑmɑɹ ǀ] [vɔɾ dɑrnɑs du mɑjɹ hɑjɾɛnikʰ hɑjutʰjɑn ǁ] [kəɾknɛɾg] [pʰɑrkʰ kʰɛz ǀ miʃt pʰɑrkʰ sɔvɛtɑkɑn hɑjɑstɑn ǀ] [ɑʃχɑtɑsɛɹ ǀ t͡ʃɑɾtɑɾɑgɔɾt͡s ʃinɑɾɑɹ ǀ] [ʒɔʁɔvəɾdɔt͡sʰ suɾb dɑʃinkʰɔv ɑnsɑsɑn ǀ] [du t͡sʰɑʁkum jɛs jɛv kɛɾtum lujs ɑpɑgɑd ǁ] [lɛninː ɑnmɑh mɛz huɾn ɑnʃɛd͡ʒ pɑɾgɛvɛt͡sʰ ǀ] [mɛɹ dɛm ʃɔʁɑt͡sʰ jɛɾd͡ʒɑnkɑbɛɹ ɑjgɑbɑt͡sʰ ǀ] [hɔktɛmbɛɾə kɔɾt͡sɑnumit͡sʰ mɛz pʰəɾkɛt͡sʰ] [jɛv təvɛt͡sʰ mɛz nɔɹ ǀ pɑjt͡sɑr kjɑnkʰ pʰɑrɑpɑnt͡s ǁ] [kəɾknɛɾg] [mɛt͡s rusjɑn mɛz jɛʁbɑjɾutʰjɑn d͡zɛrkʰ mɛknɛt͡sʰ ǀ] [mɛnkʰ kɛɾtɛt͡sʰinkʰ ɑmɾɑkur nɔɹ pɛtutʰjun ǀ] [lɛninjɑn mɛɹ kusɑkt͡sʰutʰjunː imɑstun ǀ] [hɑʁtʰɔɾɛn mɛz dɛp kɔmunizm ɛ tɑnum ǁ] [kəɾknɛɾg] Independent Soviet world – Armenia! Thou hast for centuries passed a path austere, Thy brave sons for thee struggled, For thee to become the Armenians' motherland. Chorus: Glory to thee, shall there always be glory to Soviet Armenia! Hardworking thou art – architect-building, Unbreakable by the holy alliance of the folk, Thou art blooming and thou createst thy future bright! Immortal Lenin presented us with eternal fire, The dawn of bliss shone upon us, From destruction hath October rescued us And newly bright and glorious life it gavest us. Chorus Great Russia extended to us the hand of friendship, We have created a new state so strong. Our sagacious Party of Lenin Victoriously leadeth us to Communism! Chorus ==Trivia== *This anthem did not begin with an intro. *This anthem never mentioned Stalin in the lyrics. ==References== Armenian Soviet Socialist Republic Category:Anthems of Soviet Socialist Republics",
 "title": "Anthem of the Armenian Soviet Socialist Republic"
}