{
 "id": "415762",
 "text": "This article lists the most distant things known to us, all of which are galaxies or energy sources inside galaxies. Their distances are described in two ways. redshift = z, and billion light years (Gly). As of 2012, there are only about 50 possible objects z=8 or farther, and another 100 z=7 candidates.FirstGalaxies, Our latest results Candidates vary in their notability, so not everything is included here. 1 Gly = 1 billion light-years = 109 ly. Examples of the most distant things Name Redshift (z) Distance (Gly) Type Notes F200DB-045 z = 20.4 13.725 Galaxy JADES-GS-z14-0 z = 14.32 Galaxy HD1 z = 13.27 13.579 Galaxy JADES-GS-z13-0 z = 13.20 13.576 Galaxy or dark star Possibly a dark star. GN-z11 z = 10.6034 13.39 Galaxy Confirmed galaxy EGSY8p7 z = 8.68 13.23 Galaxy Confirmed galaxy EGSY8p7 Star 22 z = 8.68 13.23 Star A yellow hypergiant and is the most distant known star. GRB 090423 z = 8.2 13.18 Gamma-ray burst NASA, New gamma-ray burst smashes cosmic distance record , 28 April 2009 EGS-zs8-1 z = 7.73 13.13 Galaxy Confirmed galaxy z7 GSD 3811 z = 7.66 13.11 Galaxy galaxy z8 GND 5296 z≅ 7.51 13.1 Galaxy Note the discrepancy between distance and red-shift.Finkelstein S.L. et al 2013. A galaxy rapidly forming stars 700 million years after the Big Bang at redshift 7.51\". Nature. 502: 524. UDFj-39546284 z≅11.9 13.37 Protogalaxy This is a protogalaxy.HubbleSite, \"NASA's Hubble finds most distant galaxy candidate ever seen in Universe\", STScI-2011-05, 26 January 2011 MACS0647-JD z≅10.8 13.3 Galaxy or protogalaxy Candidate most distant galaxy. MACS J1149-JD z≅9.6 13.2 Galaxy or protogalaxy Zheng W. et al 2012. A magnified young galaxy from about 500 million years after the Big Bang. Nature 489 (7416): 406–408. GRB 090429B z≅9.4 13.14 Penn State SCIENCE, \"Cosmic explosion is new candidate for most distant object in the Universe\" , Derek. B. Fox , Barbara K. Kennedy , 25 May 2011 Gamma-ray burst/progenitor/remnant Space Daily, Explosion helps researcher spot Universe's most distant object, 27 May 2011 UDFy-33436598 z≅8.6 Galaxy or protogalaxy GRB 090423 z≅8.2 13.035 Gamma-ray burst/progenitor/remnant NASA, \"New gamma-ray burst smashes cosmic distance record\" , 28 April 2009 BoRG-58 z≅8 Cluster or protocluster Protocluster candidate A1689-zD1 z≅7.6 13 Galaxy or protogalaxy Galaxy SXDF-NB1006-2 z≅7.215 12.91 Galaxy or protogalaxy Galaxy GN-108036 z≅7.213 12.91 Galaxy or protogalaxy Galaxy BDF-3299 z=7.109 12.9 Galaxy or protogalaxy, spectroscopic redshift. Vanzella et al. (2011), ApJ,730,35 ULAS J1120+0641 z≅7.085 12.9 Quasar Scientific American, \"Brilliant, but distant: most far-flung known quasar offers glimpse into early universe\", John Matson, 29 June 2011 A1703 zD6 z≅7.045 12.89 Galaxy or protogalaxy BDF-521 z=7.008 12.89 Galaxy or protogalaxy, spectroscopic redshift. Vanzella et al. (2011), ApJ,730,35 IOK-1 z≅6.964 12.88 Galaxy or protogalaxy LAE J095950.99+021219.1 z≅6.944 Galaxy or protogalaxy Lyman-alpha emitter--Faint Galaxy PSO J172.3556+18.7734 z = 6.82 Quasar (Astrophysical jet) Earendel z = 6.2 Star Blue hypergiant. * UDFy-38135539 is the furthest confirmed object (spectroscopically analysed) at 13.1 Gly. == Related pages == * Galaxy * List of galaxies * IC 1101: the largest known galaxy, with about 100 trillion stars.https://arxiv.org/PS_cache/astro-ph/pdf/0209/0209205v2.pdf == References == Category:Galaxies Category:Astronomy lists",
 "title": "Most distant things"
}