{
 "id": "415843",
 "text": "This is a list of monarchs of Wessex until 927. For later monarchs, see the List of English monarchs. Details for many of the later English monarchs are confirmed by a number of sources. But the earliest kings of Wessex predate many written sources.Barbara Yorke, Kings and Kingdoms of Early Anglo-Saxon England (London: Routledge, 1997), p. 1 Wessex was one of the seven kingdoms of the British Heptarchy. This is a later name given to the seven Anglo-Saxon kingdoms of England during the early Middle Ages.Michael Frassetto, The Early Medieval World (Santa Barbara, CA: ABC-CLIO, 2013), p. 308 Besides Wessex it included Northumbria, Mercia, East Anglia, Essex, Kent, and Sussex. The year 865 saw the arrival of the Great Heathen Army in East Anglia.D. P. Kirby, The Earliest English Kings, Second Edition (London; New York: Routledge, 2000), p. 173 One by one the Anglo-Saxon kingdoms were defeated by the Danes (Vikings). By the close of the ninth century the last four independent kingdoms of England had been reduced to just one.N. P. Brooks, 'England in the Ninth Century: The Crucible of Defeat', Transactions of the Royal Historical Society, Fifth Series, Vol. 29, (1979), p. 1 Wessex was the only remaining kingdom not destroyed by the Vikings. Under Alfred the Great Wessex became the core of a unified England.Michael Frassetto, The Early Medieval World (Santa Barbara, CA: ABC-CLIO, 2013), p. 54 His grandson, Athelstan was the first King of England.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), pp. 339-40 == Monarchs of the West Saxons (Wessex) == === Cerdicing Dynasty === * Cerdic (519–534) *Creoda (534?) Likely disputed * Cynric (534–560) * Ceawlin (560–591) * Ceol (591–597) * Ceolwulf (597–611) * Cynegils (611–643) * Cwichelm (626–636) * Cenwalh (643–645) * Centwine (probable) (645–648) * Cenwalh (648–672) (restored to the throne) * Seaxburh (672–674) * Cenfus (674) * Aescwine (674–676) * Centwine (676–685) * Caedwalla (685–688) * Ine (688–726) * Athelheard (726–740) * Cuthred (740–756) * Sigeberht (756–757) * Cynewulf (757–786) * Beorhtric (786–802) * Egbert (802–839) * Athelwulf (839–858) * Athelbald (858–860) * Athelbert (860–865) * Athelred (865–871) * Alfred the Great (871–899) * Edward the Elder (899–924) * Alfweard (924), son of Edward, ruled for 16 days. * Athelstan (924–927), after 927 ruled as King of the English. == Related pages == * List of English monarchs * Wessex monarchs == Image gallery == File:Cherdik - John Speed.JPG| File:Penda of Mercia.jpg| File:Swilfrid1.jpg| File:Egbert - MS Royal 14 B V.jpg| File:Æthelwulf - MS Royal 14 B V.jpg| File:Alfred the Great.jpg| File:Murder of Cenulph - King of Wessex 031.png| == Notes == == References == * Category:Lists of British monarchs",
 "title": "List of monarchs of Wessex"
}