{
 "id": "416237",
 "text": "Technical writing is communication about technical and occupational fields. The Society for Technical Communication (STC) defines technical writing as any form of communication that is: Defining technical communication. STC. #communicating about technical or specialized topics, such as computer applications, medical procedures, or environmental regulations; or #providing instructions about how to do something, regardless of the task's technical nature. The audience is a vital part of the writing. If, say, writing medical instructions to help patients and care-providers, the writing might be for doctors & nurses; lay people with a good general education; or poorly-educated people. The writing would be quite different in each case. For example: :\"Match level of technical discussion and formality to intended purpose and audience. For audience, consider education, professional experience, reading level, and motivations. Use clear and simple diction to make writing accessible to readers for whom English is not their first language\".Standards and guidelines for technical writing. McCormick School of Engineering and Applied Science, Northwestern University. Technical writing communicates visually as well as verbally. A communication should follow an overall logic. One approach is descriptive, such as \"Parts of a car engine\". Another is the problem-solver: \"How to change tyres\". Practical encyclopedias usually inform and have how to do it sections. Medical encyclopedias are a good example. Medline Plus a service of the U.S. National Library of Medicine and the National Institutes of Health. A medical encyclopedia provides information to readers about health questions. People have always needed how-to guides, which appeared in manuscripts before the arrival of print.Wight, Thomas 1569. A booke of the arte and maner, how to plant and graffe all sortes of trees: with divers other new practise, by one of the Abbey of Saint Vincent in Fraunce by Leonard Mascall. == References == Category:Prose Category:Communication",
 "title": "Technical writing"
}