{
 "id": "416776",
 "text": "Salome is a short opera by Richard Strauss. It is based on the Biblical story of Salome, Herod and John the Baptist. The original play Salomé was written by Oscar Wilde in November and December 1891 in French. Hedwig Lachmann translated the play into German. Richard Strauss saw the play and decided in 1902 to make an opera out of it. The opera was first performed in Dresden in December 1905. \"The Dance of the Seven Veils\" is a famous excerpt from the opera. It is sometimes performed in concerts. The opera was very successful; Strauss made so much money with Salome that he could afford to buy a beautiful house in the town of Garmisch-Partenkirchen. The opera also caused a long- lasting scandal after it was first produced in Dresden. At the Vienna Court Opera the work could not be performed for nearly twenty years because of censorship, at the Royal Opera House Covent Garden the opera had to be modified, in New York there was only one performance - then the wealthy donors of the Metropolitan Opera decided that this opera was not suitable for the American public. ==Principal characters== * Salome, a very young and very beautiful princess - soprano * Herodes, king of Judaea, her stepfather - tenor * Herodias, queen, mother of Salome - mezzo-soprano * Jochanaan, also known as John the Baptist - bass-baritone ==The story== Herodes is the King of Judea and he has thrown a wild party at his palace. The action takes place at the palace on a terrace outside the banqueting hall. Herodes, his wife Herodias, and her daughter Salome are all inside the banqueting hall when the opera starts. Narraboth, the captain of Herodes’s guards, is madly in love with Salome. But his friend, Herodias’s servant, is concerned. The moon looks strange, which he believes is a sign that something terrible will happen, especially if Narraboth keeps staring at Salome. Some Jews cause an uproar in the hall and the guards scoff at their religion but suddenly, there is a voice from a deep pit with a cover on it. Some of the guests outside ask the guards who it is and they answer: This is Jokanaan, a prophet from the desert. Nobody knows exactly what he’s saying, but Herodes has forbidden anyone from seeing him. Salome gets offended by some of the party guests and rushes out of the hall. She calls them names in return but she stops as the prophet starts saying more strange things. Salome asks who he is, if he says bad things about her mother, and if he is an old man. They respond that they do not know what he is saying but he is quite young. Salome says that she would like to meet him, but they tell her that she cannot. However, she sees Narraboth looking at her and tells him she may smile at him and give him a flower tomorrow if he lets her see Jokanaan. So he commands the guards to bring the prophet out of the pit as Salome looks on with desire. Jokanaan sees her staring at him, so he asks who she is. When she responds, he is shocked and demands that she get away but she is still infatuated. In turn she praises his pale skin, his black hair, and his red lips. Each time he tells her to get away from him. She turns around and insults those same features but on the third time, she insists that she wants kiss his lips. Narraboth begs her to stop, but she does not hear him and he kills himself. Jokanaan curses her and returns to the pit. Herodes comes outside asking where the Princess is when all of a sudden he notices the Moon. Herodias follows him out and dismisses him, urging him to come back inside. However, Herod wants to stay outside with Salome. He notices Narraboth’s body and comments that he did not order the man to kill himself, but he always saw him looking at Salome with desire. He orders his body to be taken away as he feels a very cold wind and hears a sound like the huge wings flapping. Herodias thinks he is sick but Herodes responds that Salome is the one who looks like she has never been sicker. He offers her food, wine, and a seat in her mothers throne, but she responds that she is not hungry, thirsty, or tired. Jokanaan speaks again and Herodias orders the prophet to be silenced. Herodes, however, is worried that something bad will happen to him if something bad happens to Jokanaan, since he is a prophet. Herodias dismisses him again and asks why he does not give Jokanaan to the Jews. They agree with her, but start bickering because they do not believe that he is a prophet. Jokanaan speaks of the “savior of Man.” One of the people suggests that it could be the Messiah, since there is a person around Judea doing miracles, but this just makes them all argue more. The scene becomes even more chaotic until Herodes asks Salome to dance for him, promising her anything, even half his kingdom, if she does. She agrees and dances the “Dance of the Seven Veils.” She comes onto the stage wearing nothing but the veils and seductively takes them all off. Herod is very pleased until she asks for her reward: the head of Jokanaan on a silver platter. He is horrified and offers her his best items but she persists. Finally, he gives in. An executioner is sent into the pit, but Salome hears him drop his blade and Jokanaan does not cry out. She is furious, and tells Herodias’s servant that there will be many more dead bodies if she does not get what she wants. Finally, the executioner returns, bearing the bloody head. Salome seizes it and begins to embrace it passionately as the moonlight disappears and reappears. Herodes, fleeing in shock, orders his soldiers to kill her. Category:Compositions by Richard Strauss Category:1905 works Category:1900s operas",
 "title": "Salome (opera)"
}