{
 "id": "416888",
 "text": "In Ancient Rome, several types of Roman houses existed. Those in Rome were of at least three different types ranging from tenements to mansions. == Insulae == Ordinary people lived in apartment blocks called Insulae, a kind of apartment building. It housed most people of lower- or middle-class status (the plebs). The wealthiest from the upper-middle class (the equites) had their own homes. Insulae were of poor quality but had running water and sanitation. Rooms could be owned or rented. They were built in timber, mud brick and later primitive concrete.Humphrey, John W; John P. Oleson & Andrew N. Sherwood 1998. Greek and Roman technology: a sourcebook. London: Routledge They were restricted in height to about 20 meters. Fires and collapses happened. Among his many business interests, Marcus Licinius Crassus speculated in real estate and owned numerous insulae in the city. When one collapsed from poor construction, Cicero said that Crassus was happy that he could charge higher rents for a new building than the collapsed one.Aldrete, Gregory S. 2004. Daily life in the Roman city. Greenwood Press, 75. == Domus == Houses of the rich and the upper classes were large and lavish. The atrium, the most important part of the house, was where guests were greeted. The atrium was open in the centre and was surrounded at least in part by porticoes with high ceilings. It often contained only a little furniture to give the effect of a large space. In the centre was a square roof opening in which rainwater could come and drain inwards from the slanted tiled roof. There were kitchens, bedrooms, a dining room, and a number of open rooms. The master's office was placed so that the master could see what others were doing. The domus was not just a house but was a place to do business as well. Servants would use a servants' entrance, not the main entrance. Slaves could not leave the house without the permission of the master. == Villas == A Roman villa was a Roman country house built for the upper classes. There were two kinds of villas.Becker, Jeffrey & Terrenato, Nicola 2012. Roman Republican villas: architecture, context, and ideology. Ann Arbor: University of Michigan Press. The villa urbana, was a country seat in easy reach of Rome or another city. The villa rustica was a farm-house estate, like the later English country house, and was occupied by servants who ran the estate. In the empire, there was a concentration of Imperial villas near the Gulf of Naples, on the Isle of Capri, at Monte Circeo on the coast and at Antium (Anzio). Wealthy Romans escaped the summer heat in the hills round Rome, especially around Frascati (such as Hadrian's Villa). Cicero had at least seven villas. The oldest of them was near Arpinum, which he inherited. Pliny the Younger had three or four of which the example near Laurentium is the best known from his descriptions.du Prey, Pierre de la Ruffiniere 1995. The villas of Pliny from antiquity to posterity. Large villas were important to the Roman economy. They dominated the Po valley, Campania and Sicily and were also found in Gaul. Villas were centres of mining, pottery or horse raising. Villas specialising in shipping olive oil to Roman legions in Germany were a feature of the southern Iberian province of Hispania Baetica.Numerous stamped amphorae from Baetica have been found in Roman sites of northern Gaul. Some luxurious villas have been excavated in North Africa in Africa Province and Numidia. Another example is Fishbourne Palace, in Britannia. == References == house Category:Houses",
 "title": "Roman house"
}