{
 "id": "417030",
 "text": "This is a list of gods, goddesses, people and other figures from Greek mythology. They are sorted into sections below. The immortals include gods (deities), spirits and giants. Being immortal means that they live forever. The mortals include heroes, kings, Amazons and other people. The list does not include creatures. These figures are described by ancient writers, the oldest of which are Homer and Hesiod.M. L. West, Hesiod: Theogony, Oxford University Press (1966), pages 40, 47Antony Andrewes, Greek Society, Pelican Books (1971), pages 254–5 The Greeks created images of their deities for many reasons. A temple would house the statue of a god or goddess, or several deities. The statue might be decorated with relief scenes depicting myths. These were also often painted on pottery and minted on coins. Roman mythology includes many of the same figures, but uses different names: calling Zeus by the name of Jupiter and Aphrodite by the name of Venus, for example. This is called the Venetian creole language. It is called Venetian band. ==Immortals== ===Olympians=== The main and most important gods were the Twelve Olympians. The home of these gods is at the top of Mount Olympus. There was some variation as to which deities were included in the Twelve.According to As such, the list below numbers fourteen. It includes all those who are commonly named as one of the Twelve in art and poetry. Dionysus was a later addition; in some descriptions, he replaced Hestia. Hades is not usually included among the Olympians, because his home was the underworld. Some writers, however, such as Plato, named him as one of the Twelve.Plato, The Laws, 828 d-e, Plato: Phaedrus, 246 e-f Deity Description Aphrodite (, Aphroditē) Goddess of love, beauty and desire. She was married to Hephaestus, but she had many lovers, including Ares, Adonis and Anchises. She was depicted as a beautiful woman and often naked. Her symbols include roses and other flowers, the scallop shell, and myrtle wreath. Her sacred animals are doves and sparrows. The Roman version of Aphrodite was Venus. Image: Cnidian Aphrodite, a Roman work based on an original by Praxiteles Apollo (, Apóllōn) God of light, healing, music, poetry, plague, prophecy, and more. He is the son of Zeus and Leto, and the twin brother of Artemis. Apollo was associated with the Sun; while Artemis was the Moon. Both use a bow and arrow. In the earliest myths, Apollo fights with his half-brother Hermes. In sculpture, Apollo was depicted as a handsome young man with long hair and a perfect physique. His attributes include the laurel wreath and lyre. He often appears in the company of the Muses. Animals sacred to Apollo include roe deer, swans, cicadas, hawks, ravens, crows, foxes, mice and snakes. Image: Apollo holding a lyre and pouring a libation, on a drinking cup from a tomb at Delphi Ares (, Árēs) God of war and bloodshed. He was the son of Zeus and Hera. He was depicted as a young man, either naked with a helmet and spear or sword, or as an armed warrior. Ares generally represents the chaos of war in contrast to Athena, who represented strategy and skill. Ares' sacred animals are the vulture, venomous snakes, dogs and boars. The Roman version of Ares is Mars. Image: Roman marble head of the war god, modelled after a Greek bronze original Artemis (, Ártemis) Goddess of hunting, wilderness, animals and childbirth. In later times she became associated with the Moon. She is the daughter of Zeus and Leto, and the twin sister of Apollo. She is depicted as a young virgin woman. In art she is often shown holding a hunting bow and arrows. Her attributes include hunting spears, animal furs, deer and other wild animals. Her sacred animals are deer, bears and wild boars. The Roman version of Artemis is Diana. Image: Artemis reaching for arrow (missing) from her quiver, with a hunting dog Athena (, Athēnâ) Goddess of wisdom and skill, warfare and tactics. According to most traditions, she was born from Zeus's head fully formed and wearing armour. She was depicted with a helmet, holding a shield and a spear, and wearing the Aegis over a long dress. Poets describe her as having very bright, keen eyes. She was a special patron of heroes such as Odysseus. She was also the patron of the city Athens (which is named after her). Born from the head of Zeus (her father) and her mother is Metis, the first wife of Zeus. Her symbol is the olive tree. She is often shown beside her sacred animal, the owl. The Roman version of Athena is Minerva. Image: Athena on a red-figure cup, dating from 500–490 BCE Demeter (, Dēmētēr) Goddess of farming, the harvest and fertility. Demeter is a daughter of Cronus and Rhea. Her brother is Zeus, with whom she had Persephone. She was one of the main deities of the Eleusinian Mysteries. She was depicted as an older woman, often wearing a crown and holding bunches of wheat. Her symbols are the cornucopia, wheat-ears, the winged snake, and the lotus staff. Her sacred animals are pigs and snakes. The Roman version of Demeter is Ceres. Image: Demeter, sitting down, on a relief from Turkey Dionysus (, Diónysos) God of wine, parties and festivals, madness and ecstasy. He was depicted in art as either an older man with a beard or a pretty young man with long hair. His attributes include the thyrsus (a pinecone-tipped staff), drinking cup, grape vine, and a crown of ivy. He is often shown with his thiasos, a group of followers that includes satyrs, maenads, and his teacher Silenus. The consort of Dionysus was Ariadne. Animals sacred to him include dolphins, snakes and donkeys. Dionysus was a later addition to the Olympians; in some descriptions, he replaced Hestia. \"Bacchus\" was another name for him in Greek, and this was used by the Romans for their version of the god. Image: Dionysus sitting on a leopard Hades (, Hádēs) King of the underworld and god of the dead. His consort is Persephone. His attributes are the cornucopia, key, sceptre, and the three-headed dog Cerberus. The owl was sacred to him. He was one of three sons of Cronus and Rhea, and therefore was ruler of one of the three realms of the universe, the underworld. He is not very often included as one of the Olympians, however. In Athenian literature, \"Ploutōn\" () was his preferred name, while \"Hades\" was more common as a name for the underworld. The Romans translated \"Ploutōn\" as Pluto, the name for their version of Hades. Image: Hades lying down, holding a giant drinking horn and offering a bowl to Persephone Hephaestus (, Hḗphaistos) God of fire, metalworking and crafts. He was the son of Hera by parthenogenesis. He is the smith of the gods and the husband of Aphrodite. He was usually depicted as a bearded man with hammer, tongs and anvil—the tools of a smith—and sometimes riding a donkey. His sacred animals are the donkey, the guard dog and the crane. One of his many creations was the armour of Achilles. Hephaestus used fire to create things. The Roman version, however, Vulcan, was feared for his destructive power; he was associated with volcanoes. Image: Thetis receives the armour made for her son Achilles by Hephaestus Hera (, Hḗra) Queen of the heavens and goddess of marriage, women and birth. She is the wife of Zeus and daughter of Cronus and Rhea. She was usually depicted as a regal woman, wearing a crown and veil and holding a lotus-tipped staff. Although she was the goddess of marriage, Zeus's many affairs drive her to jealousy and anger. Her sacred animals are the heifer, the peacock and the cuckoo. The Roman version of Hera is Juno. Image: Bust of Hera wearing a crown Hermes (, Hērmēs) God of travel, animal husbandry, writing, trade, and more. He is the son of Zeus and Maia, Hermes is the messenger of the gods. He also leads the souls of the dead into the afterlife. He was depicted either as a handsome and fit young man, or as an older bearded man. He was often shown wearing sandals with small wings on them. His sacred animals are the tortoise, the ram and the hawk. The Roman version of Hermes was Mercury. Image: Hermes holding his caduceus and wearing a cloak and hat for travel Hestia (, Hestía) Goddess of the hearth, home and chastity. She was described as a virgin. She is a daughter of Rhea and Cronus, and sister of Zeus. She could not often be identified in Greek art. She appeared as a veiled woman. Her symbols are the hearth and kettle. In some descriptions, she gave up her seat as one of the Twelve Olympians to Dionysus, and she plays a minor role in Greek myths. The Roman version of Hestia, however, Vesta, was a major goddess in Roman culture. Image: Hestia from a relief depicting all twelve Olympians in procession Poseidon (, Poseidōn) God of the sea, rivers, floods, droughts, earthquakes, and the creator of horses. He is a son of Cronus and Rhea, and brother to Zeus and Hades. He rules one of the three realms of the universe as king of the sea and the waters. In classical artwork, he was depicted as an older man with a very large beard, and holding a trident. The horse and the dolphin are sacred to him. His wife is Amphitrite. The Roman version of Poseidon was Neptune. Image: Sculpture of Poseidon, from the National Archaeological Museum of Athens Zeus (, Zeus) King of the gods, and ruler of Mount Olympus. He is the god of the sky, thunder and lightning, law and order, and fate. He is the youngest son of Cronus and Rhea. He overthrew his father and took the throne of heaven for himself. In artwork, he was depicted as a regal, older man with a dark beard. His usual attributes are the royal sceptre and the lightning bolt. His sacred animals are the eagle and the bull. The Roman version of Zeus, Jupiter, was also the main god of the Romans. Image: Coin made under Alexander the Great showing Zeus on his throne holding a sceptre and eagle. ===Primordial deities=== The primordial deities are the first beings that existed. They are what makes up the universe. All other gods descend from them. The first among them is usually said to be Chaos. Chaos is the “nothingness” from which all of the others were made. These gods are usually depicted as a place or a realm. Tartarus, for example, is depicted as the deepest pit in the underworld. His brother Erebus is also depicted as a place of darkness, or the emptiness of space. Gaia is depicted as nature or the Earth. Pontus is depicted as the oceans, lakes, and rivers. Chronos is depicted as time. Ancient Greek name English name Description (Achlýs) Achlys The spirit of misery, sadness and the never-ending night. (Aithḗr) Aether The god of the upper air and light. (Anánkē) Ananke The goddess of inevitability, compulsion and need. (Cháos) Chaos The nothingness from which everything else came. Described as a void. (Chrónos) Chronos The titan of time. Not to be confused with the Titan Cronus, the father of Zeus. (Érebos) Erebus The god of darkness and shadow. (Eros) Eros The god of love. The Roman version of Eros was Cupid. (Gaîa) Gaia Goddess of the Earth (Mother Earth); mother of the Titans. (Hēméra) Hemera Goddess of daylight. (Hydros) Hydros God of waters. (Hypnos) Hypnos God of sleep. (Móros) Moros Spirit of doom. (Nē̂soi) The Nesoi The goddesses of islands and the sea. (Nýx) Nyx The goddess of the night. (Ophíōn) Ophion An elder god. In some versions of the myth, he ruled the Earth with his consort Eurynome before Cronus overthrew him. Another account describes him as a snake. (Ouranós) Uranus The god of the heavens (Father Sky); father of the Titans. (Oúrea) The Ourea The gods of mountains. (Phánēs) Phanes The god of procreation. (Phýsis) Physis The spirit of the origin and ordering of nature. (Póntos) Pontus The god of the sea, father of the fish and other sea creatures. (Tártaros) Tartarus God of the deepest, darkest part of the underworld (which is itself also referred to as Tartarus). (Thálassa) Thalassa Spirit of the sea and consort of Pontos. (Thánatos) Thanatos God of death. Brother to Hypnos (sleep) and in some myths Moros (doom). (Thésis) Thesis Spirit of creation. ===Titans=== The Titans are the older kind of gods in Greek mythology. The original Twelve Titans were children of Gaia (Mother Earth) and Uranus (Father Sky).Hesiod, Theogony 132-138. Their leader was Cronus, who overthrew his father Uranus and became ruler of the gods. Cronus' consort was his sister Rhea. Their children were Zeus, Hades, Poseidon, Hera, Demeter and Hestia. Cronus and the Titans were overthrown by Zeus, his youngest son. They fought a war called the Titanomachy. The Titans are depicted in Greek art less often than the Olympians. Greek name English name Description The Twelve Titans (Hyperíōn) Hyperion Titan of light. With Theia, he is the father of Helios (the sun), Selene (the moon), and Eos (the dawn). (Iapetós) Iapetus Titan of mortality and father of Prometheus, Epimetheus, Menoetius and Atlas. (Koîos) Coeus Titan of intelligence and the axis of heaven. (Kreîos) Crius Titan God of heavenly constellations and in charge of ordering the measures of the year.Father of Astraeus, Pallas and Perses. Not much is known about him.\"About the other siblings of Kronos no close inquiry is called for,\" observes Friedrich Solmsen, in discussing \"The Two Near Eastern Sources of Hesiod\", Hermes 117.4 (1989:413–422) p. 419. \"They prove useful for Hesiod to head his pedigrees of the gods\", adding in a note \"On Koios and Kreios we have to admit abysmal ignorance.\" (Crónos) Kronos The leader of the Titans, who overthrew his father Uranus. He was later overthrown by his own son, Zeus. Not to be confused with Chronos, the god of time. (Mnēmosýnē) Mnemosyne Titan of memory, and mother of the Nine Muses. (Ōceanós) Oceanus Titan of the ocean, the great river that flows around the earth. (Phoíbē) Phoebe Titan of prophecy, and consort of Coeus. (Rhéa) Rhea Titan of fertility and mothers. She is the sister and consort of Cronus, and mother of Zeus, Hades, Poseidon, Hera, Demeter and Hestia. (Tēthýs) Tethys Wife of Oceanus, and the mother of the rivers, fountains and clouds. (Theía) Theia Titan of sight and the light of the sky. She is the consort of Hyperion, and mother of Helios, Selene and Eos. (Thémis) Themis Titan of divine law and order. Other Titans (Astería) Asteria Titan of oracles and falling stars. (Astraîos) Astraeus Titan of dusk, stars and planets and the art of astrology. (Átlas) Atlas Titan who was forced to carry the sky upon his shoulders by Zeus. Son of Iapetus. (Aúra) Aura Titan of the breeze and the air of early morning. (Diṓnē) Dione Titan of the oracle of Dodona. (Ēṓs) Eos Titan of the dawn. (Epimētheús) Epimetheus Titan of afterthought and excuses. (Eurybía) Eurybia Titan of the seas and consort of Crius. (Eurynómē) Eurynome Titan of pastures, and mother of the three Charites by Zeus. (Hḗlios) Helios Titan of the sun and guardian of oaths. (Clyménē) Asia Or Clymene. Titan of fame and infamy, and wife of Iapetos. (Lēlantos) Lelantos Titan of air and hunters. (Lētṓ) Leto Titan of motherhood and mother of the twins Artemis and Apollo. (Menoítios) Menoetius Titan of anger, rash action and mortality. Killed by Zeus. () Metis Titan of wisdom, advice and cunning. (Pállas) Pallas Titan of war. He was killed by Athena during the Titanomachy. (Pérsēs) Perses Titan of destruction and peace. (Promētheús) Prometheus Titan of forethought and craftiness. Creator of humans. (Selḗnē) Selene Titan of the moon. (Stýx) Styx Titan of the river Styx in the underworld. Personification of hatred. ===Giants=== The Giants (, Gigantes) were the children of Gaia. She was fertilised by the blood of Uranus, after Uranus was castrated by his son Cronus. After the Titans' lost their war against the Olympians, Gaia made the Giants rise up against the Olympians to restore the Titans' rule. The Olympians got help from the hero Heracles to stop the Giants. This war was the Gigantomachy. * The Hekatonkheires (), the Hundred-Handed Ones. Three giant gods of violent storms. Sons of Uranus and Gaia. Each have different characteristics. ** Briareus or Aigaion (), the Vigorous ** Cottus (), the Furious ** Gyges (), the Big-Limbed * Agrius (), a man-eating Thracian giant who was half-man and half-bear * Alcyoneus (), the eldest of the Thracian giants, who was killed by Heracles * Aloadae (), twin giants who tried to break into heaven ** Otos () ** Ephialtes () * Antaeus (), a Libyan giant who wrestled all those who visited Libya to death. He was killed by Heracles. * Argus Panoptes (), a hundred-eyed giant who kept watch over Io * Cyclopes (Elder), three one-eyed giants who made the lightning-bolts of Zeus ** Arges () ** Brontes () ** Steropes () * Cyclopes (Younger), a tribe of one-eyed, man-eating giants who herded sheep on the island of Sicily ** Polyphemus (), a cyclops who briefly captured Odysseus and his men, but was then blinded by the hero * Enceladus (), one of the Thracian giants who fought against the gods * The Gegenees (), a tribe of six-armed giants fought by the Argonauts on Bear Mountain in Mysia * Geryon (), a three-bodied, four-winged giant who lived on the island of Erytheia * The Laestrygonians (), a tribe of man-eating giants whom Odysseus met on his travels * Orion (), a giant huntsman whom Zeus placed among the stars as the constellation of Orion * Porphyrion (), the king of the Thracian Giants. He was killed by Heracles and Zeus with arrows and lightning-bolts after he tried to rape Hera. * Talos (), a giant forged from bronze by Hephaestus. He was given by Zeus to his lover Europa to be her bodyguard. * Tityos (), a giant killed by Apollo and Artemis when he tried to rape their mother Leto. * Typhon (), a monstrous storm-giant who was defeated and imprisoned in the pits of Tartarus ===Personified concepts=== * Adephagia (), spirit of greed * Adikia (), spirit of injustice and doing the wrong thing * Aergia (), spirit of laziness * Agon (), spirit of contest, who had an altar at Olympia, where the Olympic Games were held * Aidos (), spirit of modesty and respect * Aisa (), personification of fate * Alala (), spirit of the war cry * Alastor (), spirit of blood feuds and vengeance * Aletheia (), spirit of truth * The Algea (), spirits of pain and suffering ** Achos (), trouble or distress ** Ania (), ache or anguish ** Lupe (), pain or sadness * Alke (), spirit of ability and courage * Amechania (), spirit of helplessness * The Amphilogiai (), spirits of disputes and debates * Anaideia (), spirit of ruthlessness, and the unforgiving * The Androktasiai (), spirits of killing in the battles * Angelia (), spirit of messages and announcements * Apate (), spirit of deceit * Apheleia (), spirit of simplicity * Aporia (), spirit of difficulty * The Arae (), spirits of curses * Arete (), spirit of virtue and goodness * Atë (), spirit of mischief, delusion, and ruin * Bia (), spirit of force, power and strength * Caerus (), spirit of opportunity * Corus (), spirit of over-indulgence * Deimos (), spirit of fear * Dikaiosyne (), spirit of justice * Dike (), spirit of rights and fair judgement * Dolos (), spirit of tricks and deception * Dysnomia (), spirit of anarchy and lawlessness * Dyssebeia (), spirit of disrespecting the gods * Eirene (), goddess of peace * Ekecheiria (), spirit of truce, and stopping fights; honoured at the Olympic Games * Eleos (), spirit of mercy, pity, and compassion * Elpis (), spirit of hope * Epiphron (), spirit of careful thought * Eris (), spirit of strife and discord * The Erotes () ** Anteros (), god of love that is returned ** Eros (), god of love and sex ** Hedylogos (), god of flattery and flirting ** Himeros (), god of sexual desire ** Pothos (), god of lust * Eucleia (), spirit of glory * Eulabeia (), spirit of discretion and caution * Eunomia (), goddess of good law and order * Eupheme (), spirit of praise, applause, and shouts of triumph * Eupraxia (), spirit of well-being * Eusebeia (), spirit of loyalty, duty and respect * Euthenia (), spirit of wealth * Gelos (), spirit of laughter * Geras (), spirit of old age * Harmonia (), goddess of harmony * Hebe (), goddess of youth * Hedone (), spirit of pleasure and fun * Heimarmene (), personification of the fate of the universe * Homados (), spirit of the noise of battle * Homonoia (), spirit of agreements * Horkos (), spirit of oaths * Horme (), spirit of energetic activity, impulse or effort * Hybris (), spirit of sadistic behaviour * Hypnos (), god of sleep * The Hysminai (), spirits of fighting and combat * Ioke (), spirit of battles * Kakia (), spirit of bad habits and bad morals * Kalokagathia (), spirit of nobility * The Keres (), spirits of violent death * Koalemos (), spirit of stupidity * Kratos (), spirit of strength and power * Kydoimos (), spirit of confusion and the noise of battle * Lethe (), spirit of forgetfulness, and of one of the rivers in the underworld * Limos (), spirit of hunger and starvation * The Litae (), spirits of prayer * Lyssa (), spirit of rage * The Machai (), spirits of fighting and combat * Mania (), spirit or spirits of insanity * The Moirai (), or \"Fates\" ** Clotho (), who spins the life thread ** Lachesis (), who measures the life thread ** Atropos (), who cuts the life thread * Momus (), spirit of mockery, blame and criticism * The Neikea (), spirits of feuds and arguments * Nemesis (), goddess of revenge and retribution * Nike (), goddess of victory * Nomos (), spirit of law * Oizys (), spirit of sadness * The Oneiroi (), spirits of dreams ** Epiales (), spirit of nightmares ** Morpheus (), god of dreams, who takes the shape of humans ** Phantasos () spirit of fantasies, who takes the shape of objects ** Phobetor () or Icelos (), spirit of nightmares, who takes the shape of animals * Palioxis (), spirit of retreat from battle * Peitharchia (), spirit of obeying * Peitho (), spirit of persuasion and seduction * Penia (), spirit of poverty and need * Penthus (), spirit of mourning * Pepromene (), personification of the fate of the universe, similar to Heimarmene * Pheme (), spirit of rumours and gossip * Philophrosyne (), spirit of kindness * Philotes (), spirit of friendship, affection and sex * Phobos (), spirit of panic and fear * The Phonoi (), spirits of murder and killing * Phrike (), spirit of horror * Phthonus (), spirit of envy and jealousy * Pistis (), spirit of trust * Poine (), spirit of punishment and penalty for the crime of murder * Polemos (), personification of war * Ponos (), spirit of hard labour * Poros (), spirit of being able to accomplish something * Praxidike (), spirit of getting justice * Proioxis (), spirit of pursuit on the battlefield * Prophasis (), spirit of excuses * The Pseudologoi, spirits of lies * Ptocheia (), spirit of begging * Soter () and Soteria (), spirits of safety * Sophrosyne (), spirit of moderation, self-control, temperance, and discretion * Techne (), spirit of art and skill * Thanatos (), spirit of death and mortality * Thrasos (), spirit of boldness * Tyche (), goddess of luck, chance and fate * Zelos (), spirit of rivalry, devotion, emulation and envy ===Underworld deities=== These deities lived in the underworld. The ruler of the underworld was Hades, who is listed further above under \"Olympians\". * Amphiaraus (), a hero of the war of the Seven Against Thebes. He became an oracular spirit of the underworld after he died. * Angelos (), a daughter of Zeus and Hera who became an underworld goddess * Askalaphos (), the son of Acheron and Orphne who looked after the orchards in the underworld. She was later transformed into an owl by Demeter. * Cerberus (), the three-headed dog who guarded the gates of Hades * Charon (), ferryman of Hades * Empusa (), monstrous spirits with flames for hair, the leg of a goat and the other leg made of bronze. They are also servants of Hecate. * Erebos (), the primeval god of darkness, his mists surrounded the underworld and filled the hollows of the earth * The Erinyes (), the Furies, goddesses of retribution ** Alecto (), the unceasing one ** Tisiphone (), avenger of murder ** Megaera (), the jealous one * Hecate (), goddess of magic, witchcraft, the night, ghosts, and necromancy * Judges of the Dead ** Aiakos (), keeper of Hades' keys and judge of the men of Europe. He used to be king of Aegina when he was alive. ** Minos (), judge of the final vote. He had been king of Crete when he was alive. ** Rhadamanthys (), a former lawmaker and judge of the men of Asia * Keuthonymos (), a spirit and the father of Menoetes * Cronus (), deposed king of the Titans; after he was released from Tartarus he was made king of the Island of the Blessed * Lamia (), a vampiric spirit who followed Hecate * Lampades (), nymphs who held torches ** Gorgyra () ** Orphne (), mother of Askalaphos * Macaria (), daughter of Hades and goddess of blessed death (not the same as the daughter of Heracles) * Melinoe (), daughter of Persephone and Hades who accepted sacrifices offered to the ghosts of the dead * Menoetes (), a spirit who herded the cattle of Hades * Mormo (), a fearsome spirit who followed Hecate * Nyx (), the primeval goddess of night * Persephone (), queen of the underworld, wife of Hades and goddess of spring * Rivers of the Underworld ** Acheron (), the river of pain ** Kokytos (), the river of crying ** Lethe (), the river of forgetfulness ** Phlegethon (), the river of fire ** Styx (), the river of oaths * Tartarus (), the primeval god of the darkest pit of Hades * Thanatos (), spirit of death and minister of Hades ===Sea deities=== * Aegaeon (), god of sea storms and a friend of the Titans * Amphitrite (), sea goddess and consort of Poseidon * Benthesikyme (), daughter of Poseidon, who lived in Ethiopia * Brizo (), patron goddess of sailors, who sent prophetic dreams * Ceto (), goddess of the dangers of the ocean and of sea monsters * Charybdis (), a sea monster and spirit of whirlpools and the tide * Cymopoleia or Kymopoleia (), a daughter of Poseidon, married to the giant Briareus * Delphin (), the leader of dolphins. Poseidon placed him in the sky as the group of stars called Delphinus. * Eidothea (), prophetic sea nymph and daughter of Proteus * Glaucus (), a god of fishermen and sailors * Gorgons (), three monstrous sea spirits ** Stheno () ** Euryale () ** Medusa () * The Graeae (), three ancient sea spirits who personified the white foam of the sea. They shared one eye and one tooth between them. ** Deino () ** Enyo () ** Pemphredo () * The Harpies (), spirits with wings. They were associated with sudden gusts of wind. ** Aello () or Aellope () or Aellopous () ** Ocypete () or Ocypode () or Ocythoe () ** Podarge () or Podarke () ** Celaeno () ** Nicothoe () * Hippocampi (), the horses of the sea. They are half horse with the tail of a fish. * The Ichthyocentaurs (), two sea gods with the upper bodies of men, the lower fore- parts of horses, ending in the long tails of fish ** Bythos () ** Aphros () * Karkinos (), a giant crab who worked with the Hydra to kill Heracles. When it died, Hera put it in the sky as the group of stars called Cancer. * Ladon (), a sea snake with a hundred heads. It guarded the western parts of the sea, and the island and golden apples of the Hesperides. * Leucothea (), a sea goddess who helped sailors in trouble * Nereides (), sea nymphs ** Thetis (), leader of the Nereids. She organised the birth of animals in the sea. ** Arethusa (), a daughter of Nereus who was transformed into a fountain ** Galene (), goddess of calm seas ** Psamathe (), goddess of sandy beaches * Nereus (), the old man of the sea, and the god of fish * Nerites (), a sea spirit who was transformed into a shell-fish by Aphrodite * Oceanus (), Titan god of the river Oceanus, that flows around the Earth * Palaemon (), a young sea god who helped sailors in trouble * Phorcys (), god of the hidden dangers of the sea * Pontos (), primeval god of the sea, father of fish and other sea creatures * Poseidon (), king of the sea and leader of the sea gods; also god of rivers, flood and drought, earthquakes, and horses * Proteus (), a prophetic old sea god who could change shape. He herded Poseidon's seals. * Scylla (), a monstrous sea goddess * The Sirens (), sea nymphs who lured sailors to their death with their song ** Aglaope () or Aglaophonos () or Aglaopheme () ** Himerope () ** Leucosia () ** Ligeia () ** Molpe () ** Parthenope () ** Peisinoe () or Peisithoe () ** Raidne () ** Teles () ** Thelchtereia () ** Thelxiope () or Thelxiepeia () * The Telchines (), sea spirits from the island of Rhodes. The gods killed them when they turned to evil magic. ** Actaeus () ** Argyron () ** Atabyrius () ** Chalcon () ** Chryson () ** Damon () or Demonax () ** Damnameneus () ** Dexithea (), mother of Euxanthios by Minos ** Lycos () or Lyktos () ** Lysagora () ** Makelo () ** Megalesius () ** Mylas () ** Nikon () ** Ormenos () ** Simon () ** Skelmis () * Tethys (), wife of Oceanus, and the mother of the rivers, fountains and clouds * Thalassa (), primeval spirit of the sea and consort of Pontos * Thaumas (), god of the wonders of the sea * Thoosa (), goddess of strong currents * Triteia (), daughter of Triton and friend of Ares * Triton (), son and herald of Poseidon. He had the body of a man and the tail of a fish. ===Sky deities=== * Achelois (), a minor moon goddess * Aeolus (Aiolos, ), god of the winds * Aether (), primeval god of the upper air * Alectrona (), goddess of the dawn or waking up * Anemoi, gods of the winds ** Boreas (), god of the north wind and of winter ** Eurus (), god of the east or southeast wind ** Notus () god of the south wind ** Zephyrus (), god of the west wind ** Aparctias (), another name for the north wind (not the same spirit as Boreas) ** Apheliotes (), god of the east wind (when Eurus is considered southeast) ** Argestes (), another name for the west or northwest wind ** Caicias (), god of the northeast wind ** Circios () or Thraskias (), god of the north-northwest wind ** Euronotus (), god of the southeast wind ** Lips (), god of the southwest wind ** Skeiron (), god of the northwest wind * Apollo, god of the sun and light, knowledge, music and healing * Arke (), messenger of the Titans and twin sister of Iris * Astraios (), Titan god of stars, planets and astrology * The Astra Planeti (), gods of the five \"wandering stars\" (planets that can be seen from Earth) ** Stilbon (), god of Hermaon, the planet Mercury ** Eosphorus (), god of Venus the morning star ** Hesperus (), god of Venus the evening star ** Pyroeis (), god of Areios, the planet Mars ** Phaethon (), god of Dios, the planet Jupiter ** Phaenon (), god of Kronion, the planet Saturn * Aurai (), nymphs of the cool breeze ** Aura (), goddess of the breeze and the air of early morning * Chaos (), represented the lower atmosphere which surrounded the earth * Chione (), goddess of snow and daughter of Boreas * Helios (), Titan god of the sun and guardian of oaths * Selene (), Titan goddess of the moon * Eos (), Titan goddess of the dawn * Hemera (), primeval goddess of daylight * Hera (), queen of heaven and goddess of the air and stars * Herse (), goddess of the morning dew * The Hesperides () * Iris (), goddess of the rainbow and a messenger of the gods * Nephelai (), cloud nymphs * Ouranos (), primeval god of the heavens * Pandia (), daughter of Selene and Zeus * The Pleiades (), goddesses of the stars named after them ** Alcyone () ** Sterope () ** Celaeno () ** Electra () ** Maia () ** Merope () ** Taygete () * Zeus (), king of heaven and god of the sky, thunder and lightning ===Rustic deities=== * Aetna (), goddess of Mount Etna, the volcano in Sicily * Amphictyonis (), goddess of wine and friendship between nations. This is a local form of the goddess Demeter. * Anthousai (), flower nymphs * Aristaeus (), god of bee-keeping, making cheese, herding, growing olives, and hunting * Attis (), god of plants and consort of Cybele * Britomartis (), a Cretan goddess of hunting and fishing nets * Cabeiri (), gods or spirits who looked after the Mysteries of the islands of Lemnos and Samothrace ** Aitnaios () ** Alkon () ** Eurymedon () ** Onnes () ** Tonnes () * Centaurs (), a race of half-man, half-horse beings ** Asbolus () ** Chariclo (), wife of Chiron ** Chiron (), the eldest and wisest of the centaurs ** Eurytion () ** Nessus (), a ferryman at the river Euenus ** Pholus () * The Cercopes (), a pair of monkey-like thieves who lived in Lydia in western Anatolia ** Akmon () ** Passalos () * Chloris (), goddess of flowers and wife of Zephyrus * Comus (), god of celebrating and partying * Corymbus (), god of the fruit of the ivy * The Curetes (), looked after baby Zeus on Mount Ida. They are very similar to the Korybantes. * Cybele (), a goddess of mountains and nature. She was a Phrygian goddess adopted by the Greeks. She was associated with Rhea. * The Dactyls (), minor deities originally representing fingers of a hand ** Acmon () ** Damnameneus () ** Delas () ** Epimedes () ** Heracles (not the same as the hero with this name) ** Iasios () ** Kelmis () ** Skythes () ** Titias (), a friend of Cybele ** Cyllenus (), a friend of Cybele * Dionysus (), god of wine, parties, and wild plants * Dryades (), tree and forest nymphs * Epimeliades (), nymphs who protected flocks of sheep * Gaia (), primeval goddess of the earth * Hamadryades (), oak tree dryades * Hecaterus (), minor god of the hekateris, a dance of involving moving the hands quickly * Hephaestus (), god of metalworking * Hermes (), god of roads, herds and flocks * The Horae (), the Hours ** The goddesses of law and order *** Eunomia (), spirit of good order and laws *** Dike (), spirit of moral order and fair justice *** Eirene (), spirit of peace ** The goddesses of the order of nature *** Thallo (), goddess of spring, buds and blooms *** Auxo (), goddess of spring growth *** Karpo (), goddess of autumn, harvesting and fruits ** The goddesses of welfare *** Pherousa (), goddess of substance *** Euporie (), goddess of abundance *** Orthosie (), goddess of prosperity ** The goddesses of the times of day *** Auge (), first light of the morning *** Anatole () or Anatolia (), sunrise *** Mousika or Musica (), the morning hour of music and study *** Gymnastika, Gymnastica () or Gymnasia (), the morning hour of exercise *** Nymphe (), the morning hour of bathing and washing *** Mesembria (), noon *** Sponde (), libations poured after lunch *** Elete, prayer, the first of the afternoon work hours *** Akte, Acte () or Cypris (), eating and pleasure, the second of the afternoon work hours *** Hesperis (), evening *** Dysis (), sunset *** Arktos (), night sky ** The goddesses of seasons *** Eiar (), spring *** Theros (), summer *** Pthinoporon (), autumn *** Cheimon (), winter * Korybantes (), the dancers who worshipped Cybele ** Damneus () ** Idaios () ** Kyrbas () ** Okythoos () ** Prymneus () ** Pyrrhichos (), god of the rustic dance * Maenades (), crazed nymphs who follow Dionysus ** Methe (), nymph of drunkenness * Meliae (), nymphs of honey and the ash tree * Naiades (), freshwater nymphs ** Daphne () ** Metope () ** Minthe () * The Nymphai Hyperboreioi (), gods of the various aspects of archery ** Hekaerge (), represented distancing ** Loxo (), represented trajectory ** Oupis (), represented aim * Oreades (), mountain nymphs ** Adrasteia (), a nursemaid of the baby Zeus ** Echo (), a nymph cursed never to speak except to repeat the words of others * Oceanides (), freshwater nymphs. The main ones were: ** Beroe (), the daughter of Aphrodite and Adonis, who was seduced by both Dionysus and Poseidon ** Calypso () ** Clytie () ** Eidyia (), the youngest of the Oceanides * The Ourea (), primeval gods of mountains * The Palici (), a pair of gods who looked after the geysers and thermal springs in Sicily * Pan (), god of shepherds, pastures and fertility * The Potamoi, river gods ** Achelous (), greatest of the river gods ** Acis () ** Acheron () ** Alpheus () ** Asopus () ** Cladeus () ** Eurotas () ** Cocytus () ** Lethe () ** Peneus () ** Phlegethon () ** Styx () ** Scamander () * Priapus (), god of fertility and gardens * Rhea (), the great mother and queen of the mountain wilderness * Satyrs (), fertility spirits ** Krotos (), a hunter and musician who lived with the Muses on Mount Helicon * Silenus (), an old god of the dance and of wine * Telete (), goddess of initiation into the orgies of Bacchus * Zagreus (), the first incarnation of Dionysus in the Orphic mysteries ===Agricultural deities=== * Adonis (Άδωνις), a deity of life, death and rebirth * Aphaea (Αφαία), minor goddess of agriculture and fertility * Carme (Κάρμη), spirit of the harvest festival in Crete * Carmanor (Καρμάνωρ), a Cretan harvest god * Chrysothemis (Χρυσόθεμις), goddess of the \"Golden Custom\", a harvest festival, daughter of Demeter and Carmanor * Cyamites (Κυαμίτης), demi-god of the bean * Demeter (Δήμητρα), goddess of fertility, agriculture and harvest * Despoina, daughter of Poseidon and Demeter, goddess of mysteries in Arcadia * Dionysus (Διόνυσος), god of wine and growing grapes * Eunostus (Εύνοστος), goddess of the flour mill * Hestia (Ἑστία), goddess of the hearth and the baking of bread * Persephone (Περσεφόνη), queen of the underworld, wife of Hades and goddess of spring growth * Philomelus (Φιλόμελος), demi-god of agriculture. He was said to have invented the wagon and the plough. * Plutus (Πλοῦτος), god of wealth, including agricultural wealth, son of Demeter ===Deified mortals=== * Achilles (), the hero of the Trojan War * Aiakos (), a king of Aegina. He was appointed as a Judge of the Dead in the underworld after his death. * Aeolus (Aiolos) (), a king of Thessaly. He was made the immortal king of the winds by Zeus. * Amphiaraus (), a hero of the war of the Seven Against Thebes. He became an oracular spirit of the underworld after his death. * Ariadne (Αριάδνη), a princess of Crete who became the immortal wife of Dionysus * Aristaeus (Ἀρισταῖος), a hero from Thessaly. For his inventions he was immortalised as the god of bee-keeping, cheese-making, herding, olive-growing, and hunting. * Asclepius (), a healer from Thessaly and a son of Apollo. He was killed by Zeus, but was later put into the sky as the group of stars called Ophiuchus. * Attis (), a consort of Cybele. He was given immortality as one of her attendants. * Bolina (), a mortal woman transformed into a nymph by Apollo * The Dioscuri (), divine twins ** Castor () ** Pollux () * Endymion (), lover of Selene. He was made to sleep forever so that he would never age. * Ganymede (), a handsome prince of Troy. He was kidnapped by Zeus and made cup-bearer of the gods. * Glaucus (), god of fishermen, made immortal after eating a magical herb. * Hemithea () and Parthenos (), princesses of Naxos who jumped into the sea to escape their angry father. Apollo transformed them into demi-goddesses. * Heracles (), divine hero * Lampsace (), a Bebrycian princess who was worshipped as a goddess for helping the Greeks * Minos (), a king of Crete. He was made a Judge of the Dead in the underworld after his death. * Ino (), a princess of Thebes who became the sea goddess Leucothea. * The Leucippides (), wives of the Dioscuri ** Phoebe (), wife of Pollux ** Hilaeira (), wife of Castor * Orithyia (), an Athenian princess. She was kidnapped by Boreas and made the goddess of mountain winds. * Palaemon (), a prince of Thebes made into a sea god along with his mother, Ino * Phylonoe (), daughter of Tyndareus and Leda. She was made immortal by Artemis. * Psyche (), goddess of the soul ===Health deities=== * Apollo, god of healing and medicine ** Asclepius (Ασκληπιός), god of healing *** Aceso, goddess of the healing of wounds and the curing of illnesses *** Aegle, goddess of very good health *** Epione (Ἠπιόνη), goddess of stopping of pain *** Hygieia (Ὑγεία), goddess of cleanliness and good health *** Iaso (Ἰασώ), goddess of cures, and ways of healing *** Panacea (Πανάκεια), goddess of healing *** Telesphorus (Τελεσφόρος), demi-god of recuperation from illness or injury ===Other deities=== * Acratopotes (), god of unmixed wine and the lack of self-control * Agdistis (), a deity of nature who had both male and female sexual organs * Alexiares and Anicetus ( and ), twin sons of Heracles who were associated with defence * Aphroditus (), a male version of Aphrodite, from Cyprus * Astraea (), virgin goddess of justice * Auxesia () and Damia (), two local goddesses of fertility * Charites (), goddesses of charm, beauty, nature, creativity and fertility ** Aglaea (), goddess of beauty, decoration and glory. Her father is Cupid or Eros. ** Euphrosyne (), goddess of joy ** Thalia (), goddess of celebrations and banquets :* Hegemone (), goddess of plants :* Antheia (), goddess of flowers :* Pasithea (), goddess of rest and relaxation :* Cleta (), \"the glorious\" :* Phaenna (), \"the shining\" :* Eudaimonia (), \"happiness\" :* Euthymia (), \"good mood\" :* Calleis (), \"beauty\" :* Paidia (), \"play, amusement\" :* Pandaisia (), \"banquet for everyone\" :* Pannychis (), \"festivity\" * Ceraon (), demi-god of mixing wine * Chrysus (), spirit of gold * Circe (), a minor goddess of magic. She was a witch living on the island of Aeaea. * Daemones Ceramici (), five spirits who plagued the potters ** Syntribos (), the one who shatters ** Smaragos (), the one who smashes ** Asbetos (), the one who chars ** Sabaktes (), the one who destroys ** Omodamos (), crudebake * Deipneus (), demi-god of making bread * Eiresione (), personification of the olive branch * Eileithyia (), goddess of childbirth * Enyalius (), minor god of war * Enyo (), goddess of destructive war * Harpocrates (), god of silence * Hermaphroditus (), god of hermaphrodites and effeminate men * Hymenaios (), god of marriage and marriage feasts * Ichnaea (), goddess of tracking * Iynx (), goddess of the love charm * Matton (), demi-god of kneading dough * Muses (), goddesses of music, song and dance, and the source of inspiration to poets ** Titan Muses, daughters of Gaia and Uranus *** Aoide (), muse of song *** Arche (), muse of origins *** Melete (), muse of meditation and practice *** Mneme (), muse of memory *** Thelxinoe (), who charmed minds ** Olympian Muses, daughters of Zeus and Mnemosyne *** Calliope (), muse of epic poetry *** Clio (), muse of history *** Erato (), muse of erotic poetry *** Euterpe (), muse of lyric poetry *** Melpomene (), muse of tragedy *** Polyhymnia ( or ), muse of sacred poetry *** Terpsichore (), muse of dance and choral poetry *** Thalia (), muse of comedy and bucolic poetry *** Urania (), muse of astronomy ** Younger Muses, daughters of Apollo *** Cephisso () *** Apollonis () *** Borysthenis () *** Hypate (), one of the three muses of the lyre *** Mese (), one of the three muses of the lyre *** Nete (), one of the three muses of the lyre ** Polymatheia (), muse of knowledge * Palaestra (), goddess of wrestling * Rhapso (), minor goddess or nymph worshipped in Athens ==Mortals== ===Heroes=== * Abderus, helped Heracles during his eighth Labour. He was killed by the Mares of Diomedes. * Achilles (Αχιλλεύς or Αχιλλέας), hero of the Trojan War and a main character in the Iliad * Aeneas (Αινείας), a hero of the Trojan War and the common ancestor of the Roman people * Ajax the Great (Αίας ο Μέγας), a hero of the Trojan War and king of Salamis * Ajax the Lesser (Αίας ο Μικρός), a hero of the Trojan War and leader of the Locrian army * Amphitryon (Αμφιτρύων), Theban general who rescued Thebes from the Teumessian fox. His wife was Alcmene, mother of Heracles. * Bellerophon, hero who killed the Chimera * Castor, the mortal Dioscuri twin. After Castor died, his immortal brother Pollux shared his divinity with him so that they could still be together. * Chrysippus, a divine hero of Elis * Daedalus, creator of the labyrinth and great inventor, until King Minos trapped him in his own creation. * Diomedes, a king of Argos and hero of the Trojan War * Eleusis, hero of the town of Eleusis * Eunostus, a Boeotian hero * Ganymede, hero of Troy and lover of Zeus. He was given immortality and made cup-bearer to the gods. * Hector, hero of the Trojan War and champion of the Trojans * Iolaus, nephew of Heracles who helped his uncle in one of his Labours * Jason, leader of the Argonauts * Meleager, a hero who sailed with the Argonauts and killed the Calydonian Boar * Odysseus, a hero and king of Ithaca. His travels are the subject of Homer's Odyssey. He also played an important role in the Trojan War. * Orpheus, a legendary musician and poet who tried to recover his dead wife from the underworld * Pandion, the hero of the Pandionis tribe of Attica. He is usually assumed to be one of the legendary Athenian kings Pandion I or Pandion II. * Perseus (Περσεύς), the first king of Mycenae and son of Zeus. He killed Medusa. * Theseus, son of Poseidon and a king of Athens. He killed the Minotaur. ===Notable women=== * Alcestis (Άλκηστις), daughter of Pelias and wife of Admetus. She was known for being very devoted to her husband. * Amymone, the only one of Danaus' daughters who refused to murder her husband * Andromache (Ανδρομάχη), wife of Hector * Andromeda (Ανδρομέδα), wife of Perseus. She was placed among the stars after her death. * Antigone (Αντιγόνη), daughter of Oedipus and Jocasta * Arachne (Αράχνη), a skilled weaver who was transformed into a spider by Athena * Ariadne (Αριάδνη), daughter of King Minos of Crete. She helped Theseus to kill the Minotaur and became the wife of Dionysus. * Atalanta (Αταλάντη), heroine who participated in the Calydonian Boar hunt * Briseis, a princess of Lyrnessus, taken and given to Achilles as a prize of war * Caeneus, formerly Caenis, a woman who was transformed into a man and became a warrior. * Cassandra, a princess of Troy who was cursed. She could see the future but nobody would ever believe her. * Clytemnestra, sister of Helen and wife of Agamemnon * Danaë, the mother of Perseus by Zeus * Deianeira, the second wife of Heracles. She was tricked into killing her husband. * Electra, daughter of Agamemnon and Clytemnestra. She helped her brother Orestes plan revenge against their mother for the murder of their father. * Europa, a Phoenician woman, kidnapped by Zeus * Hecuba (Ἑκάβη), wife of Priam, king of Troy, with whom she had 19 children * Helen, daughter of Zeus and Leda. Her abduction caused the Trojan War. * Hermione (Ἑρμιόνη), daughter of Menelaus and Helen. She was the wife of Neoptolemus, and later Orestes. * Iphigenia, daughter of Agamemnon and Clytemnestra. Agamemnon sacrificed her to Artemis to make the goddess happy. * Ismene, sister of Antigone * Jocasta, mother and wife of Oedipus * Medea, a sorceress and wife of Jason. She killed her own children to punish Jason for being unfaithful. * Medusa, a mortal woman transformed into a monster by Athena * Niobe, a daughter of Tantalus. She claimed to be superior to Leto, which caused Artemis and Apollo to kill her 14 children. * Pandora, the first woman * Penelope, loyal wife of Odysseus * Phaedra, daughter of Minos and wife of Theseus * Polyxena, the youngest daughter of Priam. She was sacrificed to the ghost of Achilles. * Semele, mortal mother of Dionysus ===Kings=== * Abas, a king of Argos * Acastus, a king of Iolcus. He sailed with the Argonauts and participated in the Calydonian Boar hunt. * Acrisius, a king of Argos * Actaeus, first king of Attica * Admetus (Άδμητος), a king of Pherae. He sailed with the Argonauts and participated in the Calydonian Boar hunt. * Adrastus (Άδραστος), a king of Argos and one of the Seven Against Thebes * Aeacus (Αιακός), a king of the island of Aegina. After he died, he became one of the three judges of the dead in the underworld. * Aeëtes, a king of Colchis and father of Medea * Aegeus (Αιγεύς), a king of Athens and father of Theseus * Aegimius, a king of Thessaly and the common ancestor of the Dorians * Aegisthus (Αίγισθος), lover of Clytemnestra. Together they planned to murder Agamemnon and become king and queen of Mycenae. * Aegyptus (Αίγυπτος), a king of Egypt * Aeson, father of Jason and rightful king of Iolcus. His throne was taken from him by his half-brother Pelias. * Aëthlius, first king of Elis * Aetolus (Αιτωλός), a king of Elis * Agamemnon (Ἀγαμέμνων), a king of Mycenae and commander of the Greek armies during the Trojan War * Agasthenes, a king of Elis * Agenor (Αγήνωρ), a king of Phoenicia * Alcinous (Αλκίνους or Ἀλκίνοος), a king of Phaeacia * Alcmaeon, a king of Argos and one of the Epigoni * Aleus, a king of Tegea * Amphiaraus (Ἀμφιάραος), a seer and king of Argos. He participated in the Calydonian Boar hunt and the war of the Seven Against Thebes. * Amphictyon (Ἀμφικτύων), a king of Athens * Amphion and Zethus, twin sons of Zeus and kings of Thebes. They built the city's walls. * Amycus, son of Poseidon and king of the Bebryces * Anaxagoras (Ἀναξαγόρας), a king of Argos * Anchises (Αγχίσης), a king of Dardania and father of Aeneas * Arcesius, a king of Ithaca and father of Laertes * Argeus, a king of Argos * Argus, a son of Zeus and king of Argos after Phoroneus * Assaracus, a king of Dardania * Asterion, a king of Crete * Athamas (Ἀθάμας), a king of Orchomenus * Atreus (Ἀτρεύς), a king of Mycenae and father of Agamemnon and Menelaus * Augeas (Αυγείας), a king of Elis * Autesion, a king of Thebes * Bias, a king of Argos * Busiris, a king of Egypt * Cadmus, first king of Thebes * Car, a king of Megara * Catreus, a king of Crete. A prophecy said that his own son would kill him. * Cecrops, a native king of Athens * Ceisus, a king of Argos * Celeus, a king of Eleusis * Cephalus, a king of Phocis who accidentally killed his own wife * Cepheus, a king of Ethiopia * Cepheus, a king of Tegea who sailed with the Argonauts * Charnabon, a king of the Getae * Cinyras, a king of Cyprus and father of Adonis * Codrus, a king of Athens * Corinthus, first king of Corinth * Cranaus, a king of Athens * Creon, a king of Thebes, brother of Laius and uncle of Oedipus * Creon, a king of Corinth who was friendly towards Jason and Medea * Cres, an early king of Crete * Cresphontes, a king of Messene descended from Heracles * Cretheus, first king of Iolcus * Criasus, a king of Argos * Cylarabes, a king of Argos * Cynortas, a king of Sparta * Cyzicus, king of the Dolionians. He was mistakenly killed by the Argonauts. * Danaus, a king of Egypt and father of the Danaides * Dardanus, first king of Dardania, and son of Zeus and Electra * Deiphontes, a king of Argos * Demophon of Athens, a king of Athens * Diomedes, a king of Argos and hero of the Trojan War * Echemus, a king of Arcadia * Echetus, a king of Epirus * Eetion, a king of Cilician Thebe and father of Andromache * Electryon, a king of Tiryns and Mycenae. Son of Perseus and Andromeda. * Elephenor, a king of the Abantes of Euboea * Eleusis, king of Eleusis in Attica * Epaphus, a king of Egypt and founder of Memphis * Epopeus, a king of Sicyon * Erechtheus, a king of Athens * Erginus, a king of Minyean Orchomenus in Boeotia * Erichthonius, a king of Athens. He was born out of Hephaestus' attempt to rape Athena. * Eteocles, a king of Thebes and son of Oedipus. He and his brother Polynices killed each other. * Eteocles, a king of Orchomenus * Eurotas, a king of Sparta * Eurystheus, a king of Tiryns * Euxantius, a king of Ceos, son of Minos and Dexithea * Gelanor, a king of Argos * Haemus, a king of Thrace * Helenus, seer and twin brother of Cassandra. He later became king of Epirus. * Hippothoön, a king of Eleusis * Hyrieus, a king of Boeotia * Ilus, first king of Troy * Ixion, a king of the Lapiths. He tried to rape Hera and was imprisoned in Tartarus. * Laërtes, father of Odysseus and king of the Cephallenians. He sailed with the Argonauts and participated in the Calydonian Boar hunt. * Laomedon, a king of Troy and father of Priam * Lycaon of Arcadia, an Arcadian king who was transformed into a wolf by Zeus * Lycurgus of Arcadia, a king of Arcadia * Lycurgus of Nemea, a king of Nemea * Makedon, a king of Macedon * Megareus of Onchestus, a king of Onchestus in Boeotia * Megareus of Thebes, a king of Thebes * Melampus, a legendary soothsayer and healer, and king of Argos * Melanthus, a king of Messenia * Memnon, a king of Ethiopia who fought on the side of Troy during the Trojan War * Menelaus, a king of Sparta and the husband of Helen * Menestheus, a king of Athens who fought on the side of the Greeks during the Trojan War * Midas, a king of Phrygia. He was given the power to turn anything to gold just by touching it. * Minos, a king of Crete. After his death, he became one of the judges of the dead in the underworld. * Myles, a king of Laconia * Nestor, a king of Pylos who sailed with the Argonauts. He participated in the Calydonian Boar hunt and fought with the Greek armies in the Trojan War. * Nycteus, a king of Thebes * Odysseus, a hero and king of Ithaca whose travels are the subject of Homer's Odyssey. He also played a major role in the Trojan War. * Oebalus, a king of Sparta * Oedipus, a king of Thebes. He fulfilled a prophecy that said he would kill his father and marry his mother. * Oeneus, a king of Calydon * Oenomaus, a king of Pisa * Oenopion, a king of Chios * Ogygus, a king of Thebes * Oicles, a king of Argos * Oileus, a king of Locris * Orestes, a king of Argos and a son of Clytemnestra and Agamemnon. He killed his mother in revenge for her murder of his father. * Oxyntes, a king of Athens * Pandion I, a king of Athens * Pandion II, a king of Athens * Peleus, king of the Myrmidons and father of Achilles. He sailed with the Argonauts and participated in the Calydonian Boar hunt. * Pelias, a king of Iolcus. He took the throne from the rightful heir, Aeson. * Pelops, a king of Pisa and founder of the House of Atreus * Pentheus, a king of Thebes. He banned people from worshipping Dionysus, and was torn apart by Maenads. * Perseus (Περσεύς), first king of Mycenae. He killed Medusa. * Phineus, a king of Thrace * Phlegyas, a king of the Lapiths * Phoenix, first king of Phoenicia * Phoroneus, a king of Argos * Phyleus, a king of Elis * Pirithoös, king of the Lapiths and husband of Hippodamia. The Battle of Lapiths and Centaurs occurred at his wedding. * Pittheus, a king of Troezen and grandfather of Theseus * Polybus of Corinth, a king of Corinth * Polybus of Sicyon, a king of Sicyon and son of Hermes * Polybus of Thebes, a king of Thebes * Polynices, a king of Thebes and son of Oedipus. He and his brother Eteocles killed each other. * Priam, king of Troy during the Trojan War * Proetus, a king of Argos and Tiryns * Pylades, a king of Phocis and friend of Orestes * Rhadamanthys, a king of Crete. After his death, he became a judge of the dead in the underworld. * Rhesus, a king of Thrace who sided with Troy in the Trojan War * Sarpedon, a king of Lycia and son of Zeus. He fought on the side of the Greeks during the Trojan War. * Sisyphus, a king of Thessaly who tried to cheat death. He was sentenced to an eternity of rolling a heavy rock up a hill, only to watch it roll back down. * Sithon, a king of Thrace * Talaus, a king of Argos who sailed with the Argonauts * Tegyrios, a king of Thrace * Telamon, a king of Salamis and father of Ajax. He sailed with the Argonauts and participated in the Calydonian Boar hunt. * Telephus, a king of Mysia and son of Heracles * Temenus, a king of Argos and descendant of Heracles * Teucer, first king of Salamis. He fought on the side of the Greeks in the Trojan War. * Teutamides, a king of Larissa * Teuthras, a king of Mysia * Thersander, a king of Thebes. He was one of the Epigoni. * Theseus, a king of Athens. He killed the Minotaur. * Thyestes, a king of Mycenae and brother of Atreus * Tisamenus, a king of Argos, Mycenae and Sparta * Tyndareus, a king of Sparta ===Seers=== Seers were prophets, people who were said to be able to see the future or predict events before they happened. * Amphilochus (Αμφίλοχος), a seer and brother of Alcmaeon. He died in the war of the Seven Against Thebes. * Anius, son of Apollo who prophesied that the Trojan War would end in its tenth year * Branchus, a seer and son of Apollo * Calchas, an Argive seer who helped the Greeks during the Trojan War * Carnus, an Acarnanian seer and lover of Apollo * Carya, a seer and lover of Dionysus * Cassandra, a princess of Troy who was cursed. She could see the future but nobody would ever believe her. * Ennomus, a Mysian seer, killed by Achilles during the Trojan War * Halitherses, an Ithacan seer. He warned the men who wanted to marry Penelope that Odysseus would return. * Helenus, seer and twin brother of Cassandra, who later became king of Epirus * Iamus, a son of Apollo who was also a prophet. He founded the Iamidai. * Idmon, a seer who sailed with the Argonauts * Manto, seer and daughter of Tiresias * Melampus, a legendary soothsayer and healer, and king of Argos * Mopsus, the name of two legendary seers * Polyeidos, a Corinthian seer who saved the life of Glaucus * Telemus, a seer who foresaw that the Cyclops Polyphemus would be blinded by Odysseus * Theoclymenus, an Argive seer * Tiresias, blind prophet of Thebes ===Amazons=== * Aegea (), a queen of the Amazons * Aella (), an Amazon who was killed by Heracles * Alcibie(), an Amazonian warrior, killed by Diomedes at Troy * Antandre (), an Amazonian warrior, killed by Achilles at Troy * Antiope (), a daughter of Ares and sister of Hippolyta * Areto (), an Amazon * Asteria (), an Amazon who was killed by Heracles * Bremusa (), an Amazonian warrior, killed by Idomeneus at Troy * Celaeno (), an Amazonian warrior, killed by Heracles * Eurypyle (), an Amazon leader who invaded Ninus and Babylonia * Hippolyta (), a daughter of Ares and queen of the Amazons * Hippothoe (), an Amazonian warrior, killed by Achilles at Troy * Iphito (), an Amazon who served under Hippolyta * Lampedo (), an Amazon queen who ruled with her sister Marpesia * Marpesia (), an Amazon queen who ruled with her sister Lampedo * Melanippe (), a daughter of Ares and sister of Hippolyta and Antiope * Molpadia (), an Amazon who killed Antiope * Myrina (), a queen of the Amazons * Orithyia (), an Amazon queen * Otrera (), a queen of the Amazons, consort of Ares and mother of Hippolyta * Pantariste (), an Amazon who fought with Hippolyta against Heracles * Penthesilea (), a queen of the Amazons who fought in the Trojan War on the side of Troy ===Inmates of Tartarus=== * The Danaides, forty-nine daughters of Danaus who murdered their husbands. They were punished for their crimes by being made to carry water in leaking jugs forever. * Ixion, a king of the Lapiths who tried to rape Hera. He was tied to a burning wheel in Tartarus as punishment. * Sisyphus, a king of Thessaly who tried to cheat death. He was sentenced to an eternity of rolling a big round rock up a hill, only to watch it roll back down. * Tantalus, a king of Anatolia who killed his son Pelops and served him as a meal to the gods. He was punished with the torture of starvation. Food and drink dangled forever just out of his reach. ==Related pages== * Iliad * Odyssey * Theogony * List of Norse gods and goddesses * List of Egyptian gods and goddesses * List of Roman gods and goddesses ==References== * Greek",
 "title": "List of figures in Greek mythology"
}