{
 "id": "41718",
 "text": "{{Infobox writer | name = Robert Browning | image = Robert Browning by Herbert Rose Barraud, circa 1888.jpg | caption = Browning, | birth_date = | birth_place = Camberwell, London, England | death_date = | death_place = Venice, Kingdom of Italy | occupation = Poet | alma_mater = University College London | genre = | movement = Victorian | notableworks = Pied Piper of Hamelin, Men and Women, The Ring and the Book, Dramatis Personae, Dramatic Lyrics, Dramatic Romances and Lyrics, Asolando | signature = Robert Browning Signature.svg | spouse = | children = Robert Wiedeman Barrett \"Pen\" Browning | relatives = Robert Browning (Father) Sarah Anna Wiedemann (Mother) }} Robert Browning (7 May 1812 – 12 December 1889) was an English poet and playwright of Victorian era.Robert Browning, Biography. He was born in Camberwell, London. He was married to the poet Elizabeth Barrett Browning. They both moved to Italy and lived in Florence. He had one son. Browning died in Venice, Italy. He was buried in Poets' Corner of Westminster Abbey. He wrote a poem called The Laboratory which was about a woman using poison to kill her lover's girlfriend. Browning's longest work was the poem The Ring and the Book. It consists of more than twenty thousand lines. It is based on a true story. It tells about a real crime committed in Italy at the end of 17th century. Its main hero is Pompilia Comparini, a young woman stabbed to death by her husband, count Guido Franceschini. Poet's best work is probably the book Men and Woman. It was published in 1855. It is a collection of monologues. Browning's last book is Asolando which was published in 1889. Gilbert Keith Chesterton wrote a book about Robert Browning; it was called Robert Browning and was published by Macmillan & Co. in 1903. == References == Category:1812 births Category:1889 deaths Category:English poets Category:English playwrights Category:People buried in Westminster Abbey Category:Writers from London Category:People from Camberwell",
 "title": "Robert Browning"
}