{
 "id": "417378",
 "text": "Athelheard, also spelled Æthelheard (died 740), was a West Saxon nobleman and atheling. He was the King of Wessex from 726 until his death. He took the powerful kingdom of Wessex left to him by his father, Ine and gained a bit more from Mercia. He was seen as one of Wessex’s most powerful kings. In 740, he died probably due to food poisoning & was succeeded by his son, Cuthred. == King of Wessex == When Ine stepped down as King of Wessex it caused a problem of succession.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 309 Ine's son had been killed rebelling against Ine a year earlier. Ine was now in his sixties and retired to Rome. He 'commended his kingdom to younger men'. It came down to a struggle between the two athelings, Oswald and Athelheard,Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 310 Oswald was descended from Ceawlin.The Anglo-Saxon Chronicle: According to Several Original Authorities, ed. & trans. Benjamin Thorpe, Vol II (London: Longman, Green, Longman and Roberts, 1861), p. 39 The same entry calls Athelheard kinsman to Ine. The two fought and Athelheard became king. In one charter Athelheard is called the brother of Ine's wife Atelburh.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 77 In 733 Somerton was lost to King Aethelbald of Mercia.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 73 This was quickly followed by the territory beyond Selwood being lost to Mercia. Athelheard's authority was so weak that Aethelbald was able to give the Archbishop of Canterbury a gift of the monastery of Cookham in Berkshire (Wessex). Aethelbald also took Wiltshire, Sussex and much of the heartlands of Wessex. Athelheard could do nothing to prevent this loss. He also took part in Athelbald's wars with the Welsh. It seems Athelbald's wife, Frithugyth, was Mercian herself. In 737 she made a pilgrimage to Rome along with bishop Forthhere of Sherborne.The Anglo- Saxon Chronicle: According to Several Original Authorities, ed. & trans. Benjamin Thorpe, Vol II (London: Longman, Green, Longman and Roberts, 1861), p. 40 Athelheard died in 740, his successor was his kinsman Cuthred.The Anglo- Saxon Chronicle: According to Several Original Authorities, ed. & trans. Benjamin Thorpe, Vol II (London: Longman, Green, Longman and Roberts, 1861), p. 41 == Family == He married Frithugyth. They had no known children. == Notes == ==References== == Other websites == * Britannia: Kings of Wessex Category:Year of birth unknown Category:740 deaths Category:Kings of Wessex",
 "title": "Athelheard of Wessex"
}