{
 "id": "417494",
 "text": "The Eurovision Song Contest was held in Copenhagen, Denmark. The competition went to Denmark, after Emmelie de Forest won the Eurovision Song Contest 2013. The first semifinal took place on 6 May 2014, the second semifinal on 8 May 2014 and, the Grand final was held on 10 May 2014. ==Semi-final 1== Spain, France, and Denmark will vote in this semi-final. The top 10 countries will qualify to the final. Draw Country Language Artist Song English translation 01 English Aram MP3 \"Not Alone\" — 02 English Aarzemnieki \"Cake to Bake\" — 03 English Tanja \"Amazing\" — 04 English Sanna Nielsen \"Undo\" — 05 English Pollapönk \"No Prejudice\" — 06 English Hersi \"One Night's Anger\" — 07 English Tolmachevy Sisters \"Shine\" — 08 English Dilara Kazimova \"Start a Fire\" — 09 English Mariya Yaremchuk \"Tick-Tock\" — 10 English Axel Hirsoux \"Mother\" — 11 English Cristina Scarlat \"Wild Soul\" — 12 English Valentina Monetta \"Maybe (Forse)\" — 13 Portuguese Suzy \"Quero ser tua\" I want to be yours 14 English The Common Linnets \"Calm After the Storm\" — 15 Montenegrin Sergej Ćetković \"Moj svijet\" (Мој свијет) My world 16 English András Kállay-Saunders \"Running\" — :1.The song is in English; however, there are some phrases in Latvian.Cake to bake, original lyrics, Eurovision.tv.Cake to bake, English lyrics, Eurovision.tv. == Semi-final 2 == Germany, Italy, and the United Kingdom will vote in this semi-final. The top 10 countries will qualify to the final. Draw Country Language Artist Song English translation 01 English Firelight \"Coming Home\" — 02 Hebrew, English Mei Finegold \"Same Heart\" — 03 English Carl Espen \"Silent Storm\" — 04 English The Shin and Mariko \"Three Minutes to Earth\" — 05 Polish, English Donatan & Cleo \"My Słowianie - We Are Slavic\" Us Slavs 06 English Conchita Wurst \"Rise Like a Phoenix\" — 07 English Vilija Matačiūnaitė \"Attention\" — 08 English Softengine \"Something Better\" — 09 English Can-Linn feat. Kasey Smith \"Heartbeat\" — 10 English Teo \"Cheesecake\" — 11 English Tijana \"To the Sky\" — 12 English Sebalter \"Hunter of Stars\" — 13 English Freaky Fortune feat. RiskyKidd \"Rise Up\" — 14 English, Slovene Tinkara Kovač \"Round and Round\" — 15 English Paula Seling & Ovi \"Miracle\" — == Finalists == Draw Country Language Artist Song English translation 23 (host) English Basim \"Cliche Love Song\" — French TWIN TWIN \"Moustache\" — English Elaiza \"Is It Right\" — Italian Emma \"La mia città\" My city English, Spanish Ruth Lorenzo \"Dancing in the Rain\" — English Molly \"Children of the Universe\" — :2.The song is in French; however, there is one sentence in English and one sentence in Spanish. == References == Category:2014 in Europe Category:2014 in music Category:2010s in Denmark Category:21st century in Copenhagen 2014 Category:May 2014 events",
 "title": "Eurovision Song Contest 2014"
}