{
 "id": "417416",
 "text": "Installation art is a style of visual art that uses three-dimensional objects. These artworks are usually meant to change the perception of a space (the way a space is seen). Installation artworks can be permanent or temporary and are shown in museums, galleries or in public spaces. Some of the earliest installation artworks were Marcel Duchamp's readymade objects. However, the real development started in the 1970s. Today, with the improvement of technology, artists use and mix new medias and may involve sensors too in order to make the visitors interact with the installations. ==Gallery== File:Duchamp Fountaine.jpg|Marcel Duchamp, Fountain 1917. Photograph by Alfred Stieglitz File:NEORIZON.jpg|Neorizon by Maurice Benayoun, urban interactive art installation (eArts Festival Shanghai 2008) File:Dombis 1687.jpg|Irrationnal Geometrics by Pascal Dombis, 2008 File:Signorina Felicita installation.JPG|La Signorina Felicita 2013 - installation created in Agliè (Torino, Italy) as a homage to Guido Gozzano's poem La signorina Felicita ovvero la Felicità File:The installation by L. Chiarelli.JPG|Installation \"Only for Your Eyes\" by Lidia Chiarelli, on show at \"Promotrice delle Belle Arti\", Torino File:Pathway of Poems for Peace.JPG|\"The Pathway of Poems for Peace\" is the landscape installation created for the World Peace Day 2015, Agliè Italy File:Gian Carlo Riccardi, La stanza delle meraviglie, 1989, Arpino.jpg|Gian Carlo Riccardi, La stanza delle meraviglie, 1989, Arpino, Italy. ==Bibliography== * Bishop, Claire. Installation Art a Critical History. London: Tate, 2005. * Coulter-Smith, Graham. Deconstructing Installation Art. Online resource * “Installation.” Oxford English Dictionary. 2006. Oxford English Dictionary Online. 30 January 2006 . * “Install, v.” Oxford English Dictionary. 2006. Oxford English Dictionary Online. 30 January 2006 . * Reiss, Julie H. From Margin to Center: The Spaces of Installation Art. Cambridge, MA: MIT Press, 2001. * Rosenthal, Mark. Understanding Installation Art: From Duchamp to Holzer. Munich: Prestel Verlag, 2003. * Suderburg, Erika. Space, Site, Intervention: Situating Installation Art. Minneapolis London: University of Minnesota Press, 2000. * Ferriani, Barbara. Ephemeral Monuments: History and Conservation of Installation Art. Los Angeles: Getty Publications, 2013.",
 "title": "Installation art"
}