{
 "id": "417466",
 "text": "The Peasants' Revolt was a rebellion of peasants in England, in 1381. It was the biggest rebellion of farmers in medieval England. The Peasants' Revolt is also called Wat Tyler's Rebellion, after Wat Tyler, who was a local leader of the peasants in the rebellion. It has also been called the Great Rising. The causes of the rebellion are unclear today, but there are different candidates: *There was a large epidemic of the Black Death, which lasted from 1347 to 1353. This reduced the number of workers and caused economic problems. *To finance Hundred Years' War, the English crown raised taxes several times within a short period of time. *The central government in London was weak at the time. == Life of peasants == There were two types of peasants: serfs and free peasants. Serfs were tenant farmers who worked without pay for a lord. In exchange, they got permission to live on the lord's land. They also got protection from the knights living on the lord's manor. Under feudalism, serfs had many difficulties. They barely had enough food to live on, and they had few possessions. They were not slaves, but they were not completely free. Serfs had less than any of the other social classes in medieval society. Though they had more freedoms than serfs, life was also difficult for free peasants. Even though they were \"free,\" they were still controlled by the higher social classes. They had to pay rent to live \"free.\" They had to pay for many other things too, like collecting water or getting married. Most peasants lived in houses which also housed the animals of the village. == Timeline == * May 30th: The peasants of Essex chase Thomas Bampton out of Fobbing. * June 1st: The revolt spreads through Essex, Hertfordshire, and Suffolk. * June 7th: Maidstone and Rochester castles surrender to the revolt. * June 10th: A new leader, Wat Tyler, appears. The rebels of Kent and Essex march on London to explain their grievances. However, Wat Tyler has a different plan: to attack London. King Richard II of England is completely surprised, and only has a few hundred troops in London. * June 13th: The peasants kill many lawyers under the command of Wat Tyler. Most of London is not destroyed. King Richard agrees to meet the rebels at Mile End. * June 14th: Richard meets with Tyler, and Tyler gives him the peasants’ demands. The king agrees to all of these demands. Meanwhile, a group of peasants goes to the Tower of London and beheads some of their worst enemies. These include Simon Sudbury, Robert Hailes, and John Legge. * June 15th: Wat Tyler wants to meet with the king again to make more demands. When they meet, Tyler is killed. It is not clear what happened to cause Tyler's death. King Richard orders his troops to destroy the rebels; they kill over a thousand. Fifty years later, most of Wat Tyler's demands were put into place by the king. ==References== Category:14th century in England Category:1381 Category:Rebellions in Europe",
 "title": "Peasants' Revolt"
}