{
 "id": "417727",
 "text": "Social isolation is having little or no contact with society. It often comes from being rejected by society. It is different to loneliness, which comes from a temporary lack of contact. Social isolation is different because it lasts a long time and is done on purpose. Social isolation sometimes begins early in life. It is often caused from being unemployed, sick or discriminated. Anybody of any age can be affected. Social isolation can mean staying home alone for a long time. Not seeing or speaking with anybody, even on the phone - this includes not answering if the call or try to talk first. Social isolation can also mean not having relationships, friendships or family connections that last a long time. == Causes == The reasons for social isolation can begin at any stage in life, including early childhood. Growing up brings many emotions that are hard to deal with, this can cause people to stop sharing all of their feelings, which makes them feel alone from a young age. Older people are more likely to be affected by social isolation. This can be because with old age health of both the mind and the body get worse, making it harder to be in contact with society; old people are also more likely to not have a lot of money which can cause problems. Also, death of loved ones comes with old age, this doesn’t only make their social circle smaller, but also makes it more difficult for them to socialise again, as it can be emotionally painful. Some data shows that Gay, Lesbian and Transgender people are more likely to be socially isolated because they are less likely to have children and start their own family and because they might no longer be accepted by their relatives and friends because of homophobia. Social isolation in people might have gone up because more and more people are starting to live alone, as it is becoming normal in the modern world after the middle of the 20th century. However, it is important to not confuse living alone and feeling lonely as social isolation – they can just be causes. There are many more reasons for people to stop contact with society: * Abuse – people being abused might not be allowed to socialise with others, as punishment or to stop them from telling others about the abuse. * Health problems – people might have health problems that make it impossible or difficult for them to socialise such as being in a wheelchair or having serious illnesses. They might find it difficult to leave their house, it might be impossible, or they might be too weak and this stops them from socialising. This is common in people with autism, because they can often find social situations too much to handle, because they sometimes do not understand social signs. They sometimes act in ways that other people do not understand and even put themselves in danger on accident. So, sometimes it is safer for people to stay at home and not socialise. People might also be too shy to socialise because of their health problems. * Hearing loss – this makes it hard to talk and listen to others. Loss of hearing can also cause shyness and stop people from even trying to socialise. * Life changes – changes such as finishing school of leaving a job quickly takes away big groups of people. Sometimes work and school are the only places people socialise, so quick changes like that can cause total loss of contact with society. == Effects == Social isolation can affect people of all ages, but signs are different for different ages. If social isolation lasts for long periods of time, similar a serious illness, it can cause many bad effects such as loneliness, low self confidence and fear of other people. It can be both an effect and also a cause for illnesses of the mind such as depression and anxiety. People’s personal lives are affected too – relationships with loved ones may fall apart, this can lead to feelings of guilt and shame. Those feelings can lead to serious illnesses such as depression. When people realise that they are socially isolated, sometimes they have feelings of extreme nervousness, which may make them isolate even more. === Dangers === A study from 2013 found that social isolation can cause death just as much as “smoking, obesity, elevated blood pressure, and high cholesterol” because social isolation badly affects health. Social isolation can cause stress, unhealthy eating and lower people's wishes to take care of themselves; in extreme cases these things can lead to death. Social isolation has also been shown to physically change the brain. Studies have shown that it changes the part of the brain for learning and memory. Social isolation also changes the brain’s ability to produce different chemicals that impact mood, it makes it difficult for the brain to produce chemicals that make people happy - Dopamine. == Social isolation and the internet == Scientists do not agree on if the internet changes how social isolation can affect us, there is a high level of disagreement because this is a new topic to research. However, studies have found that internet use did not have a bad effect on people’s social circles, in fact, using the internet made people’s social circles bigger and friendships closer, making social isolation less likely. Talking using the internet makes communication easier by removing barriers such as not being able to walk outside because of an illness, because of this it can lead to lower levels of social isolation. == Related pages == *Alienation *Social rejection *Social relation *Social stigma *Solitude ==References== Category:Social sciences Category:Psychology",
 "title": "Social isolation"
}