{
 "id": "417744",
 "text": "A runaway is a child or minor who has left their parents or legal guardians without permission. A person who runs away usually does so because of problems in the family.Smollar, 1999; Robertson & Toro, 1998 Girls run away more often than boys. == Risk factors == Studies suggest that most children run away for one or more of these reasons: * Their parents do not care much about them * There is physical or sexual abuse in the family * At least one parent is addicted to drugs or alcohol * There is violence in the family When the runaway children were asked in a 2007 study, half of them said they had at least one parent who abused alcohol. A third had at least one parent who was addicted to drugs. After studying runaways in a province of Pakistan, a 2011 journal article concluded that other children gave the runaway the idea to leave home in nearly 9 out of 10 cases (89%). The likelihood of depression among female runaways is related to family conflict and communication. Depression in male runaways is typically related to the father being an alcoholic and poor family relationships. Negative interactions within the family appear to greatly influence depressive symptoms for both genders. == Problems after running away == According to a 2010 article, about half of the children that run away will no longer go to school. Some will become homeless. Runaways are at a higher risk of: * Suffering from depression * Trying to die by suicide * Becoming criminals or victims * Becoming addicted to drugs * Getting sexually transmitted infections * Having an unwanted pregnancy * Being sexually exploited * Post-traumatic stress disorder (trauma generally begins with runaway's family experiences and worsens with additional traumatic events) == Related pages == * Poverty * Homelessness ==References== Category:Family Category:Human behavior Category:Street children == Other websites == * National Runaway Switchboard for young people in the United States and U.S. Territories * The Runaway Helpline for young people in the United Kingdom * Family and Youth Services Bureau * National Clearinghouse on Families & Youth",
 "title": "Runaway (dependent)"
}