{
 "id": "41792",
 "text": "Metz is a city in France, the prefecture of the Grand Est region and the Moselle department. ==History== There was once a city in Roman times, called Divodurum. It was the capital of a Celtic tribe called Mediomatrici. They were called the \"Mettis\" for short, which is where the name \"Metz\" comes from. The Romans controlled this city for a long time as an important center in Gallia, but it was captured by Attila the Hun in 451. It was shortly after taken over by the Franks. Metz remained a very important city, and as the borders changed over the years, it became the capital of Austrasia (from 561 to 751) and of Lotharingia (from 843 to 925), before becoming part of the Holy Roman Empire (from 925). The city was handed to King Henry II of France in 1552. In 1633, it became the capital of a French province called the \"Three Bishoprics\". The Prussians captured the town in 1870 and Metz once again became part of Germany, until 1918 when it was won back by France. The Germans captured it once more in1940 but France regained it in 1944. == Monuments == In this city, there are a lot of monuments like : * The Opéra-théâtre, XVIII°s, the oldest theatre of France, it is on an island. * The Place Saint-Louis, XIV°s, it is triangular, with arcaded houses typical of the architecture of Metz. * The Cathédrale Saint-Etienne (St. Stephen's Cathedral), X°s, gothic style, with 6000m² of stained glass. * The Jardin botanique de Metz (Botanical garden of Metz), 1866, there are 490.000 flowers every years and there is a greenhouse. == Climate == Metz has an oceanic climate (Cfb in the Koeppen climate classification). == Education == * CentraleSupélec * Supélec == Twin towns – sister cities == Metz is twinned with: * Luxembourg City, Luxembourg, since 1952 * Trier, Germany, since 1957 * Gloucester, United Kingdom, since 1960 * Tangier, Morocco * Saint-Denis, Réunion, France, since 1986 * Karmiel, Israel, since 1987 * Yichang, China, since 1991 * Hradec Králové, Czech Republic, since 2001 ==References== Category:Former regional capitals in France",
 "title": "Metz"
}