{
 "id": "41838",
 "text": "Manioc (or Cassava, or Yuca, especially in Latin America) is a shrub. It belongs to the Spurge family of plants and it grows in tropical climates. It is cultivated for its edible root. The manioc must be cooked properly to detoxify it before it is eaten as it contains cyanide, and can be used in dumplings, soups, stews and gravies. Image:Iwata kenichi cassava.jpg Image:Manihot esculenta dsc07325.jpg Image:Dried manioc.jpg File:Manihot esculenta MHNT.BOT.2004.0.508.jpg|Manihot esculenta - Museum specimen Manioc is a plant grown for its big white root. The root is an important food source for people in many tropical countries. Such countries are like Africa, South America and Asia. It is a tall, shrubby plant that grows to about 4-6 meters tall. It has large green leaves. The root of the plant is long and white. It is usually about 15 centimeters wide. The root of the manioc plant is rich in carbohydrates. It also contains other important nutrients, such as vitamin C and iron. 100 grams of manioc root contains around 130 calories, 30 grams of carbohydrates, 2 grams of fiber, 1.6 gram of protein, and negligible amount of fat. To eat the root, it must be cleaned, peeled, and sometimes grated. It can be cooked in different ways, like fry, boil, or bake. It is used to make different foods like cakes, bread, and fufu. Manioc is also used to make flour and other food products. The flour is gluten-free. The it can be used for baking and making different dishes. It is commonly used to thicken sauces and soups. Tapioca the popular ingredient in many dishes also made with manioc. People eat leaves of manioc as a vegetable. People also used the young shoots in salads or cooked as a green. However, it is important to note that it contains a toxic chemical called linamarin. It needs to be removed before eating. This is done by grating, soaking and cooking the root. If it's not done well, it can make sick. In some places, people make a drink from the root called \"cassava beer\". Also, it is used as food for animals, and its leaves as forage. Manioc can be grown with little care and few things, making it a good crop for small farmers. It can also be grown on the same land for a few years in a row. ==Related pages== * Kinako ==References== Category:Malpighiales Category:Root vegetables",
 "title": "Manioc"
}