{
 "id": "41843",
 "text": "Life cycle means the stages a living thing goes through during its life. In some cases the process is slow, and the changes are gradual. Humans have various stages of growth during their lives, such as zygote, embryo, child and adult. The change from a child to an adult is slow and continuous. In many societies it is marked by ceremonies at puberty. In most insects the transition is sharp and well-defined: egg > larva > pupa > imago (adult). == Different generations have different forms == In some animals, the parent generation looks different from the child. The most common case is that there are two different forms. One form will have sexual reproduction, the others might not reproduce, or might reproduce asexually. Some plants and a few other organisms have a system called alternation of generations which is not quite the same because one form is haploid and the other is dipoid. === Parasites === Parasites are organisms that benefit from harming other organisms. The organism they profit from is usually called host. Many parasites have complex life cycles, where they need different hosts for different stages of their development. As an example, the cycle egg > snail host > mammal host is common for parasites of herbivorous mammals. Malaria is caused by single-celled parasites. These parasites go through two stages in their development. One stage is in the blood of mosquitoes, the other in the blood of humans. === Cnidaria === Examples of this can also be found in the Cnidaria. These animals live in the sea or in freshwater and the structure of most is relatively simple. Some live as single animals, others form colonies. In a colony, many animals live together. Often, each animal in a colony is specialized, and needs the other animals of the colony to survive. ==== Complete cycle ==== A well-known example where different generations have different forms is the jellyfish. It has two: * One is called medusa: it reproduces sexually, and is what most people associate with the word jellyfish.Very ofen the medusa is free-floating. * The other form is called polyp. It does not reproduce sexually, and is usually sessile. Polyps are generally attached to the sea floor or another hard surface in the water. Coral reefs are colonies of polyps. In a complete cycle, the offspring of a medusa will develop into a polyp, and the offspring of a polyp will be a medusa. File:Polypen_einer_Gorgonie.jpg|Polyps File:HydomedusaeAglanthaDigitale.jpg|A medusa ==== Incomplete cycle and variations ==== Sometimes the cycle is modified or incomplete. Anthozoa is a group of the Cnidaria which contains sea anemones and corals. In the anthozoa, there is only a polyp stage, and no medusa stage. The box jellyfish form another small group in the Cnidaria. In the box jellyfish, the polyp transforms into the medusa. In some cases, only part of the polyp transforms, the part that is left regenerates to form a new polyp. People have also talked about the box jellyfish because many of them produce poison that is very effective, and that can be dangerous to humans. In the stalked jellyfish, there is only one form, which has been interpreted as a sessile medusa. File:Acanthastrea_lordhowensis.jpg|Single polyp of a coral File:PillarCoral.jpg|A Coral File:Urticina_piscivora_1.jpg|A sea anemone File:Avispa_marina.jpg|The sea wasp, a box jellyfish File:Haliclystus_stejnegeri_1.jpg|A stalked jellyfish. == Related pages == *Metamorphosis *Parasitism *Life cycle (computing) *Alternation of generations Category:Biology",
 "title": "Life cycle"
}