{
 "id": "418634",
 "text": "Gloria Jean Watkins (September 25, 1952 - December 15, 2021), better known by her pen name bell hooks was an award-winning African-American radical feminist writer and speaker. bell hooks takes her name from her great-grandmother Bell Blair Hooks.hooks, bell. \"Inspired Eccentricity: Sarah and Gus Oldham.\" Family: American Writers Remember Their Own. Eds. Sharon Sloan Fiffer and Steve Fiffer. New York: Vintage Books, 1996. 152. Her pen name does not use capital letters because the ideas in her writing are more important than the fact that she wrote them.Heather Williams. \"bell hooks Speaks Up\". The Sandspur (2/10/06). Retrieved September 10, 2006. == Biography == She was born in Kentucky and grew up in a working class family. When she was very young, she was in a racially segregated school where she did not learn with white students. Later, she went to a high school that had many white students and teachers. She went to Stanford University, University of Madison-Wisconsin, and University of California, Santa Cruz. In 1976 she started teaching at the University of California. In 1978 she published a collection of poems called And There We Wept: Poems. In 1981 she published her first academic book called Ain't I a Woman? Black Women and Feminism. In it, hooks talks about the racism and sexism black women face in the civil rights and feminist movements. hooks started writing Ain't I a Woman? when she was 19, and it took her 6 years to write and 8 years to find a publisher. Afterwards, hooks became popular and many wanted to hear her ideas. She is considered an important leftist (anti- capitalism) and postmodern political thinker. In 1984, she wrote a book called Feminist Theory: From Margin to Center. The main idea focuses on the idea that feminism is about making women equal to men. hooks says this does not make sense, because men are not equal due to things like racism and classism - the divide between rich and poor. hooks talks about feminism that is more inclusive. hooks asks women to understand they are different but still accept each other. This idea of gender relating to race and class is called intersectionality. hooks also says men must do their part in helping to stop the patriarchy. hooks has written over 30 books. Her work deals with the idea of a white-supremacist-capitalist-patriarchy. This is the idea that white people rule, capitalism rules, and men rule. By combining them into one term, hooks says they are connected. She also talks about how communities that love are able to overcome these problems. hooks also thinks education is important, and has written seven books to help educate children. The most popular is Happy to Be Nappy. She has been in several documentaries about politics. Happy to be Nappy was made into an award-winning documentary in 2004 called Happy to be Nappy and Other Stories of Me. In Give a Damn Again she talks with Cornel West. hooks died at her home in Berea, Kentucky from kidney failure, on December 15, 2021, at the age of 69. == Select bibliography == * And There We Wept: Poems. (1978).OCLC 6230231. * Ain't I a Woman?: Black Women and Feminism (1981) * Feminist Theory: From Margin to Center(1984) * Talking Back: Thinking Feminist, Thinking Black (1989) * Yearning: Race, Gender, and Cultural Politics (1990) * Breaking Bread: Insurgent Black Intellectual Life (1991) (with Cornel West) * Black Looks: Race and Representation (1992) * Sisters of the Yam: Black Women and Self-recovery (1993) * Teaching to Transgress: Education As the Practice of Freedom (1994) * Outlaw Culture: Resisting Representations (1994) * Killing Rage: Ending Racism (1995) * Art on My Mind: Visual Politics (1995) * Reel to Real: Race, Sex, and Class at the Movies. 1996. ISBN 0-415-91823-5. OCLC 35229108. * Bone Black: Memories of Girlhood (1996) * Wounds of Passion: A Writing Life (1997) * Happy to Be Nappy (1999) * Remembered Rapture: The Writer at Work (1999) * Justice: Childhood Love Lessons. 2000. ISBN 0-688-16844-2.OCLC 41606283. * All About Love: New Visions (2000) * Feminism Is for Everybody: Passionate Politics (2000) * Where We Stand: Class Matters (2000) * Salvation: Black People and Love (2001) * Communion: The Female Search for Love (2002) * Homemade Love (2002) * Be Boy Buzz (2002) * Teaching Community: A Pedagogy of Hope (2003) * Rock My Soul: Black People and Self-esteem (2003) * The Will to Change: Men, Masculinity, and Love (2003) * Space (2004) * We Real Cool: Black Men and Masculinity (2004) * Skin Again (2004) * Soul Sister: Women, Friendship, and Fulfillment (2005) * Homegrown: Engaged Cultural Criticism (2006) * Witness (2006) * Grump Groan Growl (2008) * Belonging: A Culture of Place (2009) * Teaching Critical Thinking: Practical Wisdom (2010) * Appalachian Elegy: Poetry and Place (2012) * Writing Beyond Race: Living Theory and Practice (2013) == Movie appearances == * Black Is... Black Ain't (1994) * Give a Damn Again (1995) * Cultural Criticism and Transformation (1997) * My Feminism (1997) * Voices of Power (1999) * Baadasssss Cinema (2002) * I Am a Man: Black Masculinity in America (2004) * Writing About a Revolution: A Talk (2004) * Happy to Be Nappy and Other Stories of Me (2004) * Is Feminism Dead? (2004) * Fierce Light: When Spirit Meets Action (2008) * Occupy Love (2012) ==References== Category:1952 births Category:2021 deaths Category:African-American writers Category:American feminist writers Category:American radical feminists Category:Writers from Kentucky Category:Deaths from renal failure",
 "title": "Bell hooks"
}