{
 "id": "418772",
 "text": "Cenwalh (also spelled Coenwalh, 4 April 615 – 27 October 672) was a the King of Wessex from 642 to 645 and again from 648 until his death in 672. He was also a Claimant to the West Saxon throne from 645 to 648. He was deposed by his former brother-in-law, King Penda of Mercia because Cenwalh divorced Penda's sister, Ardith. During Cenwalh's rule, Wessex continued to expand and the kingdom's relations with Mercia soured even more than ever. He was also a great soldier, actively fighting in Battles and Wars. In 623 when he was just eight, Cenwalh alongside his father, Cynegils and their family, converted to Roman Catholicism. Cenwalh was considered a great ruler who cared more about his people than himself. He followed the footsteps of his father to becoming one of Wessex's greatest kings. Cenwalh died in Winchester from Tuberculosis on the afternoon of 27 October 672, at the age of 57. He was succeeded by his second wife, Seaxburh. == King of Wessex == Cenwalh was the son of King Cynegils.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln Zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 77 When his father died in 643 Cenwalh succeeded him as king of Wessex.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 207 He married a sister of Penda of Mercia who was the power in the region at that time. When Cenwalh repudiated her (set her aside) in favor of another wife, Penda invaded Wessex.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 67 Penda drove Cenwalh into exile in East Anglia. He remained in East Anglia for three years with King Anna of East Anglia.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 154 There he learned about Christianity and was baptised. While in exile, Wulfhere, the son of Penda, took a great deal of territory away from Wessex. He gave the Isle of Wight to Aethelwalh, King of Sussex. == King of Wessex restored == Cenwalh was restored to his kingdom . How he was allowed to return is not recorded. Nor is it recorded who ruled Wessex in his absence. But an entry in the Anglo-Saxon Chronicle for the year 648 seems to indicate it might have been Cuthred, the son of Cwichelm. Cenwalh gave Cuthred three thousand hides of land (300–450 square miles) of land at Ashdown in Berkshire. This may have been most, if not all, of Berkshire.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 208 This was much larger than an estate a king might give a family member. Cenwalh seems to have left the Thames river basin as a result of pressure from Mercia. That made Berkshire his northern frontier with Mercia. When Bishop Birinus died in 650, Cenwalh invited Agilbert, a Frankish monk to come to Wessex as the new bishop of Dorchester. But after some time Cenwalh grew tired of not being able to understand the bishop, who apparently did not speak the Anglo- Saxon language.Peter Hunter Blair, The World of Bede (Cambridge; New York: Cambridge University Press, 1990). p. 111 Cenwalh created a new diocese at Winchester in 660 and made Wine the first bishop. Agilbert took offense at not being consulted and returned to Gaul. Wine was later expelled by Cenwalh and went to King Wulfhere of Mercia. Bede stated that Wine purchased the see (diocese) of London from Wulfhere.D. P. Kirby, The Earliest English Kings, Second Edition (London; New York: Routledge, 2000),p. 49 This left Wessex without a bishop. Cenwalh sent appeals to Agilbert to return to Wessex. Agilbert turned Cenwalh down saying his current duties as bishop of Paris prevented his return.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 155 But he sent his nephew Leutherius in his place. Cenwalh sent Leutherius to Theodore, Archbishop of Canterbury for consecration. Leutherius was welcomed in Wessex as the new bishop of Winchester. In 652 Cenwalh was fighting at Bradford on Avon.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 305 Who he was fighting against is not entirely clear. But the Welsh were there led by Morgan Mwyfawr. At least one chronicle calls it a civil war implying he was also fighting other West Saxons. In 658 he defeated the British at Penselwood. He defeated them a second time at Postbury. By 661 he had regained control over Somerset. But Mercia was constantly pushing into his territory. It was also in 661 that Wulfhere of Mercia controlled all lands north of the Thames including the abbey at Dorchester. This was one reason Cenwalh created the new diocese at Winchester which was further away from Mercian control. Cenwalh's territory in the mid-660s was significantly reduced by the Mercians. Cenwalh died in 672.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 68 After his death his widow, Queen Seaxburh, did what she could to hold Wessex together. == Family == * Cenwalh married first, N.N. (name not known), a sister of Penda of Mercia. He abandoned her . * Cenwalh married secondly, Seaxburh. She succeeded him and ruled as Queen of Wessex. :No children are recorded from either marriage. ==Notes== == References == == Other websites == * Britannia: Kings of Wessex Category:Year of birth unknown Category:670s deaths Category:Kings of Wessex",
 "title": "Cenwalh of Wessex"
}