{
 "id": "418747",
 "text": "Wine or Wini (died before 672) was a 7th century Bishop. He was the first Bishop of Winchester. He later became the Bishop of London. == Bishop of Winchester == Wine had been ordained in Gaul.Peter Hunter Blair, The World of Bede (Cambridge; New York: Cambridge University Press, 1990). p. 112 In Wessex King Cenwalh of Wessex had grown tired of his current bishop, Agilbert, who apparently did not speak the Anglo-Saxon language. Wine did speak Anglo-Saxon and was invited by Cenwalh to come to Wessex.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 154 Cenwalh built a new church at Winchester; dividing his kingdom into two dioceses. There, Wine was consecrated the first bishop of Winchester in 660.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 304 Agribert took offense at not being consulted and returned to Gaul. King Oswiu of Northumbria appointed a monk named Chad to be bishop to the Northumbrians. He sent Chad to Canterbury to be consecrated Bishop of York. On Chad's arrival in Kent, however, he discovered Archbishop Dusdedit had died.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 197 As no successor had yet been appointed, Chad went to Bishop Wine in Wessex to be consecrated. Wine was the only consecrated Bishop in England at the time recognized by the Church at Rome. == Bishop of London == Wine was later expelled by Cenwalh and went to King Wulfhere of Mercia. Bede stated that Wine purchased the see (diocese) of London from Wulfhere.D. P. Kirby, The Earliest English Kings, Second Edition (London; New York: Routledge, 2000),p. 49 Wine remained the Bishop of London until his death. Wine died in 671.Thomas Allen, The History and Antiquities of London, Westminster, Southwark and Other Parts Adjacent (London: G. Virtue, 1839), p. 312 == Notes == == References == Category:Year of birth unknown Category:670s deaths Category:Bishops",
 "title": "Wine (bishop)"
}