{
 "id": "418798",
 "text": "Walt Disney Studios Home Entertainment (also called Buena Vista Home Entertainment until 2024) is the division of The Walt Disney Company that distributes videos of movies to be played in the home. Disney began distributing videos under its own label in 1978 under the name Walt Disney Home Video. The company distributes DVDs and Blu-ray discs under the labels Walt Disney Studios Home Entertainment, Touchstone Home Entertainment and Hollywood Pictures Home Entertainment. It also includes acquired labels such as Marvel Home Entertainment, Lucasfilm Home Entertainment and 20th Century Home Entertainment. It releases its Disney-branded movies under the brand name Disney DVD. Disney began releasing titles on DVD in 1997, although they were not released in this format in the UK until 2000. They stopped released videos in VHS format in 2006. They began releasing movies on Blu-ray disc in the same year, under the brand name Disney Blu-ray. In 2024, Disney stopped releasing titles under it's own home video business and began to release titles under Sony Pictures Home Entertainment, starting with the 20th Century Studios movie The First Omen on 30th July 2024. == Walt Disney Gold Classic Collection == The Walt Disney Gold Classic Collection is a line of videos and DVDs released by The Walt Disney Company which ran from 2000 to 2001. The collection released before it was the Walt Disney Masterpiece Collection. All titles released were released in both VHS and DVD except for Toy Story, which was released on VHS only. It was also the only title in the Walt Disney Gold Classic Collection to have the Walt Disney Company intro. ===Similar later releases=== VHS DVD Title Release Dates Notes Yes Yes The Rescuers May 20, 2003 ===Similar later releases II=== VHS DVD Title Release Date Notes Yes Yes The Rescuers Down Under May 20, 2003 THX \"The Rescuers Down Under\" Logo Epilogue Same as the 2003 release Trailer for Finding Nemo and A Bug's Life Yes Yes The Tigger Movie THX \"The Tigger Movie\" Logo Same as the 2003 release == 2-Movie Pack == Title Release Dates Notes The Rescuers and The Rescuers Down Under May 20, 2003 Disc in the same as the 2003 release Disc 1 THX \"The Rescuers\" Logo Disc 2 THX \"The Rescuers Down Under\" Logo Epilogue Trailer for Finding Nemo and A Bug's Life == 2-Movie Collection == ===DVD release=== ===DVD Packaging release=== ===Blu-ray release=== Title Release Dates Notes Pooh's Grand Adventure / The Jungle Book August 2, 2011 Special 2-Movie Feature A Goofy Movie / Wreck-It Ralph 2012 September 24, 2013 Special 2-Movie Feature An Extremely Goofy Movie / The Jungle Book 2 April 21, 2015 Special 2-Movie Feature == 3-Movie Collection == ===DVD release=== ===DVD Packaging release=== ===Blu-ray release=== Title Release Dates Notes Oliver and Company / The Fox and the Hound & The Fox and the Hound 2 July 1, 2014 Pooh's Heffalump Movie / A Goofy Movie and Wreck-It Ralph 2012 August 26, 2014 == DVD releases == Title Release Date Notes The Rescuers Down Under May 20, 2003 2-Disc Collector's Edition Epilogue THX \"The Rescuers Down Under\" Logo Trailer for Finding Nemo and A Bug's Life Wilbur's Great Adventure Game Theatrical Trailer Same as the 2003 release The Tigger Movie THX \"The Tigger Movie\" Logo Bounce Together Game Music Video \"You're Heart Will Lead You Home\" Theatrical Trailer Same as the 2003 release == Blu-ray releases == Title Release Dates Notes Pooh's Grand Adventure: The Search for Christopher Robin July 17, 2018 Disney Movie Club Exclusive Release Piglet's Big Movie July 17, 2018 Disney Movie Club Exclusive Release Wreck-It Ralph (2012) September 10, 2019 == Blu-ray 3Ds releases == Titles Release Dates Notes Wreck-It Ralph (2012) March 5, 2013 September 17, 2013 Cars October 29, 2013 == 4K Ultra HD Blu-ray releases == Title Release Dates Notes Wreck-It Ralph November 6, 2018 ==Related pages== * List of Disney theatrical animated features ==References== ==Other websites== * Disney DVD * * * Category:1978 establishments in the United States Category:Companies based in California Category:Disney companies",
 "title": "Walt Disney Studios Home Entertainment"
}