{
 "id": "418814",
 "text": "Kamen Rider (Masked Rider) is a long-running Japanese Tokusatsu television series. It is first installment in the popular Kamen Rider Series. It is aimed at children. There is also a manga. It is about a superhero who rides a motorbike and wears a mask. The original airing consisted of a total 98 episodes and were broadcast from April 3, 1971 to February 10, 1973 on MBS and NET (now TV Asahi). ==Story== The series takes place in a world plagued by Shocker, a mysterious worldwide Terrorism organization formed by remaining member of the Nazi Party. To further its plans for Hegemony, Shocker recruited its agent through kidnapping, turning their victims into mutant Cyborg and, ultimately, Mind control them. However, one victim named Takeshi Hongo escaped just before the final brainwashing. With his sanity and moral conscience intact, Takeshi battle Shocker's minions as the grasshopper-themed cyborg superhero Kamen Rider. Another victim of the cyborg process, freelance photographer Hayato Ichimonji, became Kamen Rider 2 after Kamen Rider, who eventually renamed himself as \"Kamen Rider 1\", saved him from Shocker's brainwashing. Assisted by motorcycle race team manager Tobei Tachibana and FBI agent Kazuya Taki, the Kamen Riders fought in both solo and partnered missions against Shocker and its replacement organization, Gelshocker. ==Cast== * Takeshi Hongo: Hiroshi Fujioka * Hayato Ichimonji: Takeshi Sasaki * Kazuya Taki: Jirō Chiba * Tobei Tachibana: Akiji Kobayashi * Ruriko Midorikawa: Chieko Maki * Hiromi Nohara: Yoko Shimada * Shiro: Jo Honda * Yuri: Wakaki Oki * Mari: Linda Yamamoto * Michi: Katsumi Nakajima * Goro Ishikura: Yasuharu Miura * Emi: Emily Takami * Mika: Yoko Sugibayashi * Tokko: Machiko Nakajima * Naoki: Tomonori Yazaki * Mitsuru: Yoshikazu Yamada * Yokko: Yoshida Nakada * Choko: Mimy * Narration: Shinji Kanae ==Staff== * Creator: Shotaro Ishinomori * Scriptwriters: Masaru Igami, Shinichi Ichikawa, Masayuki Shimada, Mari Takizawa, Hisashi Yamazaki, Takao Nagaishi, Masahiro Tsukada, Ikurō Suzuki, Takeo Ōno, Fumio Ishimori, Kimiyuki Hasegawa, Kimio Hirayama, Minoru Yamada, Gorō Oketani, Shotaro Ishinomori * Directors: Kōichi Takemoto, Itaru Ohita, Hidetoshi Kitamura, Minoru Yamada, Issaku Uchida, Katsuhiko Taguchi, Masahiro Tsukada, Shotaro Ishinomori, Atsuo Okunaka * Composer: Shunsuke Kikuchi ==Songs== ; Opening themes * \"Let's Go! Rider Kick\" ** Lyrics: Shotaro Ishinomori ** Composition & Arrangement: Shunsuke Kikuchi ** Artist: Hiroshi Fujioka/Koichi Fuji, Male Harmony ** Episodes: 1 - 13 (Fujioka), 14 - 88 (Fuji) * \"Rider Action\" ** Lyrics: Shotaro Ishinomori ** Composition & Arrangement: Shunsuke Kikuchi ** Artist: Masato Shimon ** Episodes: 89 – 98 ; Ending themes * \"Kamen Rider no Uta\" (\"The Song of Kamen Rider\") ** Lyrics: Saburō Yatsude ** Composition & Arrangment: Shunsuke Kikuchi ** Artist: Koichi Fuji, Male Harmony ** Episodes: 1 – 71 * \"Rider Action\" ** Lyrics: Shotaro Ishinomori ** Composition & Arrangement: Shunsuke Kikuchi ** Artist: Masato Shimon ** Episodes: 72 – 88 * \"Lonely Kamen Rdier\" ** Lyrics: Mamoru Tanaka ** Composition & Arrangement: Shunsuke Kikuchi ** Artist: Masato Shimon ** Episodes: 89 – 98 ==Legacy== The Kamen Rider original series famously spearheaded launched the \"Second Kaiju Boom\" or \"Henshin Boom\" on Japanese television in the early 1970s, greatly impacting the superhero and action- adventure genre in Japan. The famous \"henshin sequence\", in which the title hero performs ritualistic poses and shouting a keyword to transform into his superhero form has since before a staple in Japanese pop-culture, inspiring superheroes and magical girl genres. Kamen Rider went to later produce a great number of spin-offs which remain in production today. Several Kamen Rider series were aired in Japan after the first Kamen Rider finished. After Kamen Rider Black RX ended production in 1989, the series was put on hold. There were three movies released as the 1990's \"Movie Riders\", which were Shin Kamen Rider: Prologue, Kamen Rider ZO and Kamen Rider J. After the original creator Shōtarō Ishinomori's death, the Kamen Rider franchise had continued in 2000 with Kamen Rider Kuuga. As of 2025, thirty-five Kamen Rider series have been made, with the newest bring Kamen Rider Gavv which in premiered September 2024. As of 2005, a remake of the Kamen Rider series was made and reimagined with Kamen Rider The First and continued with Kamen Rider The Next released in 2007. As of 2021, stating from Kamen Rider: Beyond Generations, Hiroshi Fujioka's son, Maito will portray Takeshi Hongo's younger-self. ==Other websites== *Website at Igadevil Category:Japanese science fiction television series Category:Science fiction television series Category:1971 establishments in Asia Category:1971 television series debuts Category:1973 television series endings Category:1970s establishments in Japan Category:Teen television series Category:1970s Japanese television series debuts Category:1970s Japanese television series endings",
 "title": "Kamen Rider"
}