{
 "id": "418986",
 "text": "Cynegils (23 May 587 — 5 September 642) was the King of Wessex from 611 until his death in 642. He was the son of King Ceol who died when Cynegils was young. He succeeded his uncle who was Ceol's younger brother, Ceolwulf, as king. During his reign, the kingdom expanded into northern Wiltshire and Somerset, southern Gloucestershire and Oxfordshire, and western Berkshire. He is depicted as one of Wessex's greatest and most powerful kings ever. == King in Wessex == Cynegils was the grandson of Cutha.Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 77; Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 303 He was the son of Ceol of WessexDetlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band II (Marburg, Germany: J. A. Stargardt, 1984), Tafel 77 and probably the nephew of Ceolwulf.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 303 He ruled jointly with his son Cwichelm.Barbara Yorke. Kings and Kingdoms of Early Anglo-Saxon England (London: Routledge, 1997), p. 143 The Anglo-Saxon Chronicle for the year 614 says Cynegils and Cwichelm fought together at a place named Beandun. The account said they slew two thousand sixty-five Welsh.Benjamin Thorpe, The Anglo-Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 19 This was a major victory for the West Saxons. Cynegils had some setbacks however during the middle of his reign. His son Cwichelm sent someone to try to kill King Edwin of Northumbria.Benjamin Thorpe, The Anglo-Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 20 When Edwin attacked Wessex in retaliation five Kings of Wessex were killed.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 206 The Northumbrian attack weakened the West Saxon army. The Anglo-Saxon Chronicle for 628 says that Cyngils, king of Wessex, and Cwichelm his son 'fought with Penda at Cirencester and came to an agreement with him there'.Benjamin Thorpe, The Anglo-Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 21 The 'agreement' seems to have been to give Cirencester to Penda.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 45 So this was a defeat for Cynegils and his son Cwichelm and a permanent loss of Cirencester. In 634 Pope Honorius I sent Bishop Birinus to England. When he reached the territory of the Gewisse (Wessex) he found them almost completely pagan. He began to convert the West Saxons to Christianity. In 635 Cynegils was baptized by Birinus and King Oswald of Northumbria stood as his Godfather.Benjamin Thorpe, The Anglo-Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 22 This may have been a condition of the marriage between Oswald and Cynegils's daughter, Cyneburh.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 304 He gave Bishop Birinus the city of Dorchester and several churches so he could convert the pagans in Wessex.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin Books, 1990), p. 153 The conversion took some time to complete and several kings who followed were either pagan or converted to Christianity later in their reigns. Cwichelm, his son, ruling as either co-king or underking, died in 636. From that time on Cynegils seems to have ruled Wessex by himself until his death in 643. He was succeeded by his son Cenwalh.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 207 Cynegils's reign marked the turning point for Wessex from bands of warriors to the beginnings of a united kingdom. == Family == Cynegils had the following children: * Cwichelm (died 636), ruled with his father * Cenwalh (died 672), succeeded his father as King of Wessex * Centwine, King of Wessex * Cyneburh, in 635 married King Oswald of Northumbria == Notes == == References == == Other websites == * Britannia: Kings of Wessex Category:Year of birth unknown Category:Kings of Wessex Category:642 deaths Category:6th- century births Category:Anglo-Saxons Category:House of Wessex Category:Kings and Queens of England",
 "title": "Cynegils of Wessex"
}