{
 "id": "419003",
 "text": "The foreign relations of Bangladesh are the Bangladeshi government's policies with other countries. Since independence in 1971, Bangladesh has officially followed a principle of being friendly with all nations and not being enemies with any. As a member of the Non-Aligned Movement, Bangladesh has tended to not take sides with major powers. Since the end of the Cold War, the country has pursued better relations with its neighbours. It has strong relations with other Muslim countries. It does not recognise Israel. == United Nations == Bangladesh joined the United Nations in 1974 and was elected to the Security Council in 1978–1980 and again in 2000–02. Foreign Minister Mr. Humayun Rasheed Choudhury was president of the 41st UN General Assembly in 1986. Bangladesh has played a significant role in international peacekeeping activities. Nearly 10,000 Bangladeshi military personnel are overseas with UN peacekeeping forces. Bangladeshi troops have served or are serving in Somalia, Rwanda, Mozambique, Kuwait, Bosnia and Herzegovina, Haiti, and East Timor. In December 2021, Bangladesh was the largest provider of UN peacekeeping troops with 6608 people followed by Rwanda with 6335. ==By country== ===Myanmar=== Myanmar is Bangladesh's eastern neighbour. A great amount of tension exists between the two countries. This is due to border disputes and the presence of over 270,000 Rohingya Muslim refugees in Bangladesh from mainly-Buddhist Myanmar. As a result of bilateral discussions, and with the cooperation and assistance of the UNHCR, most of the Rohingya refugees returned to Burma. As of 2000, about 22,000 refugees remain in camps in southern Bangladesh. At the 2008 ASEAN Regional forum summit in Singapore, Bangladesh and Myanmar said they would solve their Maritime boundary disputes as quickly as possible especially that a UN deadline in claiming maritime territories would expire in three years time. Both countries discussed the possibility of linking the two countries together in an attempt to boost their trade and commerce relations. The estimate to complete the 25 km highway is three years and at the cost of $20 million. Another aspect of this plan is to connect the highway to the Asian Superhighway which would connect the two countries to China. Although these have not been solved, and tensions are worsening. ===Russia=== ===South Korea=== ===United Kingdom=== The relations between the two are historical, because the British started their conquest of British India from present-day Bengal region of Bangladesh. Bangladesh has been in the Commonwealth since 1972. There are many Bengalis within the community of Great Britain == Related pages == * Indo-Bangladeshi barrier * Foreign relations of Pakistan == References == == Other websites == * Ministry of Foreign Affairs",
 "title": "Foreign relations of Bangladesh"
}