{
 "id": "41901",
 "text": "The Kargil War also known as the Kargil conflict, was a war fought between Indian armed forces and Pakistan Army in 1999. Pakistani regiments involved in the Kargil War were Northern Light Infantry, Sind regiment, Azad Kashmir regiment, Baloch Regiment, Gilgit Scouts, Chitral Scouts, Bajaur Scouts, troops from Special Service Group, Regiment of Artillery. The Pakistan Army also used artillery support from Pakistan Occupied Kashmir. The war resulted in victory for the indian side. Pakistan and its army even refused to collect the dead bodies of their troops. India regained control of all the captured posts across the Line of Control. ==Beginning== It took place between May and July 1999 in the Kargil district of Kashmir and along the Line of Control. The cause of the war was a series of events that worsened the already existing Indo-Pakistani relations. India had violated agreements concerning the Kashmir conflict before. In Jammu and Kashmir, the Line of Control resulting from the cease-fire of December 17, 1971, shall be respected by both sides without prejudice to the recognized position of either side. Both sides refrain from the threat of use of force in violation of this Line.\" India's move into Siachen in 1984 was a flagrant violation of this agreement. It had breached the agreement of LOC by perpetuating aggression in Neelum Valley as well and finally in Kargil. To put a stop to India's actions, the Pakistan army went on, although without proper coordination with its government. Pakistan clearly did not win the war militarily as well as politically and diplomatically. However, confusions still remain to this day as to who won the war but based on military action alone it was a decisive victory for India as India successfully regained most of the intruded territory and was also successful in pushing back both Pakistani and Pakistani based militants back on the other side of LoC. Pakistani soldiers and Pakistan backed militants got into areas on the Indian side of the Line of Control to occupy military posts vacated in the winter. India responded by launching a military and diplomatic offensive to drive out the Pakistani forces. The Indian Army launched a number of patrols to the area to estimate the extent of the infiltration. The Indian Army recaptured majority of the positions on the Indian side of the LOC within two months of the conflict according to official count, an estimated 75%–80% of the intruded area and nearly all high ground was back under Indian control while Pakistan lost all control over the Kargil area due to orders to withdraw from the Kargil area. Fearing large-scale increase in seriousness in the military conflict, the international community, led by the United States, increased diplomatic pressure on Pakistan to withdraw forces from remaining Indian territory. The Pakistani casualties in the war were around 400 while the Indian casualties during the conflict stood at more than 587 soldiers. ==End== Pakistan lost the Kargil War. The conflict officially came to an end on July 26, with India regaining its earlier hold on Kargil. The Kargil war is one of the most recent examples of high-altitude warfare in mountainous terrain. == References == ==Footnotes== * Names for the conflict: There have been various names for the conflict. During the actual fighting in Kargil, the Indian Government was careful not to use the term \"war\", calling it a \"war- like situation\", even though both nations indicated that they were in a \"state of war\". Terms like Kargil \"conflict\", Kargil \"incident\" or the official military assault, \"Operation Vijay\", were thus preferred. After the end of the war however, the Indian Government increasingly called it the \"Kargil War\", even though there had been no official declaration of war. Other less popularly used names included \"Third Kashmir War\" and Pakistan's codename given to the infiltration: \"Operation Badr\". Category:Wars involving India Category:Wars involving Pakistan Category:1999 in Asia Category:1990s in India Category:20th century in Pakistan Category:Conflicts in 1999",
 "title": "Kargil War"
}