{
 "id": "419000",
 "text": "James Riddle Hoffa (born February 14, 1913 – disappeared July 30, 1975, declared dead July 30, 1982) was an American labor union leader. He was the President of the International Brotherhood of Teamsters (IBT) union from 1958 until 1971. He disappeared in late July 1975, aged 62. ==Life== Jimmy Hoffa was born in Brazil, Indiana, on February 14, 1913. His family moved to Detroit in 1924. Hoffa lived in the Detroit area for the rest of his life. His first job was in a grocery store. He worked under an abusive boss, which is what gave him the idea of working with labor unions. Hoffa left his job in 1932 and was soon working for the Teamsters union. This was mainly a union for truck drivers, though Hoffa never worked as a truck driver himself. He helped grow and manage the union in the Detroit area. In those years, the union was growing quickly. The Teamsters union had always had links to organized crime, especially the American Mafia. These links grew as the union grew. As Hoffa became more important in the union, he began making agreements with the Mafia.Moldea, first edition, 1978 Hoffa became the head of the Detroit branch of the Teamsters union in 1946. In 1952, he became vice president of the Teamsters Union. In 1957, he then became its president. He would be re-elected in 1961 and 1966. Under Hoffa, the Teamsters Union continued to grow. In 1964, he helped strike a contract that could cover all truck drivers in the United States. However, both the Teamsters Union and Hoffa were facing investigation for their links to organized crime. Soon after Hoffa became its president, this led to the Teamsters union being forced to leave the AFL-CIO (the main national organization of labor unions). Hoffa was taken to jail in 1967 for fraud and jury tampering, and sentenced to 13 years. His vice president Frank Fitzsimmons began to run the union instead. In 1971, Fitzsimmons replaced Hoffa as president. President of the United States Richard Nixon pardoned Hoffa in 1971, but in return, Hoffa could not work for a labor union again until 1980. Despite this, Hoffa began planning to return to leading the Teamsters union. However, he had many opponents, including some members of the Mafia who had once been his friends. He was married to Josephine Poszywak from 1936 until his disappearance in 1975. They had two children. His daughter Barbara worked as a judge. His son James P. Hoffa has been the leader of the Teamsters union since 1999. ==Disappearance== Hoffa vanished on 30 July 1975. He had gone to meet two members of the Mafia at a restaurant near Detroit. He was last seen waiting for them in the restaurant's parking lot.Hoffa, by Arthur A. Sloane, MIT Press, 1991. He was declared legally dead in 1982. His disappearance gave rise to many theories as to what happened to him. Most theories believe that Hoffa was lured away and murdered by his enemies in the Mafia, who then found a way to get rid of his body. Examples of how this could have been done include taking it to a crematorium the Mafia owned or burying it in a hidden place. James Buccellato, an expert on crime, says it is unlikely the body was moved a long distance. In 2013, the FBI searched a place north of Detroit after hearing news that Hoffa might have been buried there,Land claimed to be Jimmy Hoffa burial site owned by Jack Tocco in 1970s | Detroit Free Press | freep.com but they did not find him. ==In popular culture== *Hoffa was portrayed by Robert Blake in the 1983 television movie Blood Feud, Trey Wilson in the 1985 television miniseries Robert Kennedy & His Times, and by Jack Nicholson in the 1992 movie Hoffa. In the 1978 movie F.I.S.T., Sylvester Stallone portrays Johnny Kovak, a character based on Hoffa. In 2019, Al Pacino played him in The Irishman. ==Related pages== *List of people who disappeared mysteriously: 1910–1990 ==References== ==Other websites== * Category:1913 births Category:1975 deaths Category:Unsolved murders in the United States Category:Brazil, Indiana Category:American murder victims Category:People declared dead in absentia Category:Missing American people Category:American labor leaders Category:American political activists Category:People from Indiana",
 "title": "Jimmy Hoffa"
}