{
 "id": "419113",
 "text": "George Soros ( or ; ; born August 12, 1930, as Schwartz György) is a Hungarian-American business magnate, investor, and philanthropist.http://www.companydirectorcheck.com/george-soros List of companies related to George Soros He is the chairman of Soros Fund Management. He is known as \"The Man Who Broke the Bank of England\" because of his US$1 billion in investment profits during the 1992 Black Wednesday UK currency crisis.George Soros FAQ . GeorgeSoros.com ==Early life== Soros was born on August 12, 1930 in Budapest, Hungary,The New Yorker: THE MONEY MAN by JANE MAYER: Can George Soros’s millions insure the defeat of President Bush? October 18, 2004. where he was raised. He emigrated to London by himself at 17, and later to New York. He survived the Nazi occupation of Budapest, before moving to London and studying at the London School of Economics. ==Career== Soros is a well-known supporter of progressive-liberal political causes.Shawcross, William (September 1, 1997). \"Turning Dollars into Change\" . Time. Between 1979 and 2011, Soros gave away over $8 billion to causes related to human rights, public health, and education. He played a significant role in the peaceful transition from communism to capitalism in Hungary (1984–89) and founded Europe's Central European University in Budapest, providing the initial endowment to open the first campus.\"Hungary: Soros Donates $250 Million to University in Budapest\". IPR Strategic Business Information Database. Info Prod Research. October 16, 2001. Soros is also the chairman of the Open Society Foundations. ==Personal life== Soros was married to Annaliese Witschak from 1960 until they divorced in 1983. They had three children. Then, Soros was married to Susan Weber Soros from 1983 until they divorced in 2005. They had two children. Soros is now married to Tamiko Bolton since 2013. Soros is a supporter of the Democratic Party. Soros is a donates annual high sums for FC Bayern Munich. ==References== ==Other websites== * * Open Society Foundations * Institute for New Economic Thinking * Column archives at Project Syndicate * Column archives at The New York Review of Books * Forbes.com: George Soros * The Money Man – New Yorker Category:1930 births Category:Living people Category:American billionaires Category:American Jews Category:American philanthropists Category:American progressives Category:Businesspeople from London Category:Businesspeople from New York City Category:Democrats (United States) Category:Holocaust survivors Category:Hungarian Jews Category:Jewish billionaires Category:Jewish businesspeople Category:Jewish philanthropists Category:Naturalized citizens of the United States Category:Businesspeople from Budapest Category:Jewish atheists",
 "title": "George Soros"
}