{
 "id": "419175",
 "text": "Ceolwulf (29 May 561 – 26 March 611) was the King of Wessex from 567 until his death in 611. The second son of Cutha who was the son of Cynric, Ceolwulf succeeded his older brother Ceol in October 597. As Ceol's son, Cynegils was young to become king, Ceolwulf took the throne in order to maintain stability and security in the kingdom as back then, young kings were considered very weak. When Ceolwulf ascended to the throne, the majority of the kingdom mainly Middlesex was very decentralised. However, he implemented policies which centralised power which made the kingdom more powerful even though he continued to have litte power in Middlesex. He also fought the Britons, the Celts and the Picts even though there's a lack of evidence that the Saxon Army went up north as far as modern-day Scotland. However, there was allegedly a conflict in Chester when it wasn't under Anglo-Saxon yet. In 607, Ceolwulf lost Middlesex to Mercia after a year-long conflict and also fought a battle with Sussex even though the outcome is unknown. In March 611, Ceolwulf died of dysentery and was succeeded by his nephew, Cynegils. He was buried at Winchester Cathedral three days later. His reign was largely successful as he reestablished hegemony in the kingdom and also saved it from the brink. He was also seen as a powerful warrior who fought tremendous battles. == Birth & Early Life == Ceolwulf was born on 5 March 561 in Winchester, Wessex. He was the son of Cutha who was the son of Cynric, grandson of Cerdic and the younger brother of Ceawlin. Ceolwulf was also the younger brother of his predecessor, Ceol. Not much was known in Ceolwulf's early life but we do know that he grew up in Winchester & lived in the Castle at that time since he was of course a part of the royal family at that time. ==Becoming King of Wessex== On 5 June 597, Ceol died due to poisoning & since his son, Cynegils was too young to rule, Ceolwulf became King instead. His coronation was five days after becoming King. ==Death & Burial== On 15 April 611, Ceolwulf traveled to Wales for a nine day trip. On the third day of his trip, Ceolwulf was assassinated. The trip was canceled & Ceolwulf returned to Wessex where he died just 4 days later because the wound became more & more infected in his body. He was succeeded by his older brother Ceol's son, that is Cynegils. He was buried 3 days later in a secret & private valut under the Castle. == Notes == == References == == Other websites == * Britannia: Kings of Wessex Category:Year of birth unknown Category:610s deaths Category:Kings of Wessex",
 "title": "Ceolwulf of Wessex"
}