{
 "id": "419251",
 "text": "Substance abuse, or drug abuse, happens when a person uses a drug over and over again, in ways that hurt their health. The person is using the drug to change their mood or to feel better, not for any health reason. Sometimes when the person uses the drug for a long time, they will start to act differently. Some of the drugs are illegal to have or use, or can have certain limits that the person does not follow. Addiction is when people are used to taking a substance, and they feel bad when they are unable to get it. Very often, such people will also change their lives, so they can get the substance or drug they need more easily. == Is it substance abuse? == Substance abuse can have different symptoms in different people. “Drug abuse” is not used in the DSM or ICD. In the DSM, the term “substance abuse” is used instead to mean the misuse of one of ten different types of drugs. A person can also become dependent on drugs.American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders (5th ed.). Arlington, VA: American Psychiatric Publishing. Repetitive use of a drug can cause dependence as well as tolerance. Tolerance happens when it takes more of a drug to produce the same effect than a previous time. The term “drug misuse” is sometimes used when the drug being used is a prescription medication that is classified as sedatives (medicines that make someone calm), anxiolytics ( make someone less worried or anxious), analgesics (medicines that reduce pain), or stimulants (medicines that give someone more energy).Barrett SP, Meisner JR, Stewart SH (November 2008). \"What constitutes prescription drug misuse? Problems and pitfalls of current conceptualizations\" (PDF). Curr Drug Abuse Rev 1 (3): 255–62. Someone who abuses their drugs may have to illegally buy them from someone who gets them from a doctor. Not everyone agrees on the definition of substance abuse. Different countries have different rules for what is a drug and what drugs are illegal. People also do not agree about what is abuse. In most Western countries, one glass of wine is acceptable, but drinking more than one bottle at once is abuse. To some people, any drinking can be seen as abuse. In the United States, any use of marijuana == What causes people to abuse substances? == In many cases, when a person is using drugs, their thinking and behaviors change. Sometimes, they commit crimes while using drugs. They may do things that are not safe, like drive a car while drunk. When people abuse drugs over a longer time, their personalities often change as well. The people who abuse drugs are often addicted. Since many of these drugs are illegal, very often drug users have problems with the law. There are two major ideas about why people abuse drugs.\"Addiction is a Chronic Disease\". http://archives.drugabuse.gov/about/welcome/aboutdrugabuse/chronicdisease. Many people believe that both can be true for different cases or with different people, which is one reason why different treatments work better or worse for different people. One idea about why people use drugs is because of their genes. When a person's parents or grandparents have been addicted to drugs, alcohol, cigarettes, or even coffee, the same genes that made them become addicted could be passed down to any of their children. When someone is born with genes that increase addiction, it causes their brain and body to become dependent on drugs very quickly. But even if a person's genes make it easier for them to become addicted to drugs, that person still needs to try a drug first, before they can become addicted to it. This idea also means that different people can have a harder or easier time stopping drugs after they are already addicted. The second major idea is that drug use is a habit that becomes harmful. It is always very hard to stop bad habits, but in this idea, drugs are one of the strongest bad habits because drugs cause so many changes in the brain. Each time a person uses drugs, the parts of the brain that think about drugs become stronger and stronger. In this idea, if a person likes drugs, that person starts to plan their day around using drugs. To stop a habit as strong as drug use, many other things about that person's life must also change. This idea also means that, the longer a person takes drugs, the harder it is for them to stop taking drugs. == What kind of drugs are abused? == People abuse drugs in many different ways, including: * Taking illegal drugs (like heroin or cocaine) * Using legal medicines to feel good, not for what they are supposed to treat (for example, taking oxycodone to feel very good, not as a painkiller) * Taking too much of a drug on purpose (for example, taking more than a normal amount of oxycodone because it will make the euphoria from the drug even better) === Illegal drugs === Some of the most commonly abused illegal drugs are: * Cocaine, including crack cocaine * Heroin * Marijuana * MDMA (also called Ecstasy or Molly) * Methamphetamine (also called meth), including crystal methamphetamine * Synthetic cannabinoids (a man-made drug that includes the main chemical in marijuana; also called K2 or Spice) === Legal drugs and medicines === Some of the most commonly abused legal drugs and medicines are: * Alcohol * Nicotine (the drug in cigarettes) * Over-the-counter cough and cold medicines that include dextrometorphan (DMX) * Prescription opioids (strong painkillers), like oxycodone, hydrocodone, and methadone * Prescription sedatives (drugs that make people feel relaxed or sleepy), like barbiturates, benzodiazepines, and sleep medicines * Prescription stimulants (drugs that make people feel more awake and have more energy), like medicines used for ADHD === Alcohol === Alcohol is the most commonly abused substance in the United States. The addiction to alcohol is called alcoholism. There are standardized questionnaires to find out how much alcohol people usually drink, and if they have problems with their drinking habits. Examples are the CAGE questionnaire for adults, or the CRAFFT Screening Test, used for young people. the CRAFFT screening test can also be used to test for other drug-related behavior. Binge drinking is when someone drinks a large amount of alcohol that goes past the recommended servicing size. Binge drinking is usually done as a group. It is very common at football tailgates and house parties in college. Many people will participate in binge drinking without knowing it, especially when groups are playing drinking games such as \"Beer pong\" and \"Flip cup,\" where the amounts of alcohol are not regulated. The most dangerous aspect of binge drinking is the potential for serious or fatal injuries that could occur after someone has participated in binge drinking. As binge drinking happens in a group, the people in the group my cause a person to drink more than they should. == Substance abuse, depression, and suicide == People who abuse drugs have a high rate of suicide. This is because of the changes in the brain caused by drugs, both when they are being used and the changes they cause over time. Another cause is the loss of family and friends because of drug abuse. In the United States, about 30% of all people who perform suicide have abused alcohol at some point.Isralowitz, Richard (2004). Drug use: a reference handbook. Santa Barbara, Calif.: ABC-CLIO. pp. 122–123. . This table explains more about how some commonly abused drugs relate to depression and suicide: Substance abused Effects related to suicide Alcohol People who misuse alcohol are more likely to have a number of mental health disorders. Alcoholics have a very high suicide rate. Suicide from alcoholism is more common in older adults. If a person drinks 6 or more drinks per day, they are six times more likely to commit suicide. Many heavy drinkers have major depressive disorder, and heavy drinking itself can cause major depressive disorder in a lot of alcoholics. Benzodiazepines People are more likely to be depressed and have a higher risk of suicide if they have been abusing benzodiazepines (like Xanax) or using them for a long time. Depressed adolescents who were taking benzodiazepines were much more likely to hurt themselves or kill themselves. Cigarette smoking Many studies have shown a link between smoking, thinking about suicide, and suicide attempts. In studies done with 50,000 nurses and 300,000 male U.S. Army soldiers, the people who smoked between 1 to 24 cigarettes per day had twice the suicide risk, and people who smoked 25 cigarettes or more had 4 times the suicide risk, as compared with those who had never smoked. Cocaine Misuse of drugs such as cocaine often has a link with suicide. When cocaine's effects wear off, people go through cocaine withdrawal. During this time, many people feel very bad. Suicide is most likely to happen during this time in people who use a lot of cocaine or are addicted. In younger adults, suicide more commonly happens when two or more drugs are taken together. Crystal meth Crystal meth use has a strong link with depression and suicide, as well as a range of other bad effects on physical and mental health. Heroin 3% to 35% of deaths among heroin users are thought to be from suicide. Overall, heroin users are 14 times more likely than people who do not use heroin to die from suicide. == Treatment == Treatment of substance abuse can include both therapy and medicine. Therapy for substance abuse helps people not use drugs when they feel they need to. For children and young adults, both the child and the family may have therapy. The child will learn how to not abuse, and the family will learn how to help the child. The organization Alcoholics Anonymous helps people with alcohol abuse.\"Self-Help Groups Article \". Retrieved May 27, 2015 For some kinds of substance abuse, medicine can be used to help.The California Evidence-Based Clearinghouse: Current Pharmacological Treatment Available for Alcohol Abuse. Copyright 2006-2013. Some of these medicines, such as methadone, stop the drug from working in the brain. Other medicines can cause people to feel ill if they use the substance that they abuse. Some medicines, like bupropion, makes people stop wanting the drug so much. Many substances can cause withdrawal. Withdrawal is a group of bad feelings that happen when someone stops taking a drug suddenly if they were regularly taking that drug before. For someone to have withdrawal, they must be dependent on the drug. Different drugs cause different things to happen during withdrawal. They can also cause different amounts of trouble for the person in withdrawal. Withdrawal from some drugs, like heroin and other opiates, can be dangerous or deadly and should be done with a doctor or nurse taking care of the person in withdrawal. Like with any other drugs that have been taken regularly, simply stopping to take them may be dangerous. A plan needs to be made on how to stop taking the drug. Actually stopping can take a long time. Sometimes Relapse can also take place and one should be cautious to not let that happen. == Likelihood == About 9% of Americans have a substance abuse issue. Young people are the most likely to experiment with and abuse drugs. Drug abuse affects about 5% of adolescents. More men than women have substance abuse disorder, though women are more likely to have an issue with abusing prescription medication. Children who have parents with substance abuse issues are more likely to have a substance abuse issue when they grow up. === Special populations === Certain groups of people are more likely to develop substance abuse issues. One group is immigrants or other people who have left their home country. They often have issues in their new country, and some use drugs as a way to feel better.National Institute on Alcohol Abuse and Alcoholism. (2005). Module 10F: Immigrants, refugees, and alcohol. In NIAAA: Social work education for the prevention and treatment of alcohol use disorders (NIH publication). Washington, D.C. Another group that is at risk is homeless children. They will use drugs to become closer to each other.Cottrell-Boyce, Joe (2010). \"THE ROLE OF SOLVENTS IN THE LIVES OF STREET CHILDREN\" (PDF). African Journal of Drug & Alcohol Studies 9 (2): 93–102. doi:10.4314/ajdas.v9i2.64142. Retrieved 28 January 2014. A third group that is at risk is musicians. They may use stimulants to make themselves more active and happy. Singers can also hurt themselves if they use drugs that are inhaled.Breitenfeld D., Thaller V., Perić B., Jagetic N., Hadžić D., Breitenfeld T. (2008). \"Substance abuse in performing musicians\". Alcoholism: Journal on Alcoholism and Related Addictions 44 (1): 37–42. == History == The first official definition of substance abuse was made in 1932 by the American Psychiatric Association. This definition was only used when the substance was illegal and not being used as medicine.Glasscote, R.M., Sussex, J.N., Jaffe, J.H., Ball, J., Brill, L. (1932). The Treatment of Drug Abuse for people like you...: Programs, Problems, Prospects. Washington, D.C.: Joint Information Service of the American Psychiatric Association and the National Association for Mental Health. In 1966, the American Medical Association defined abuse as the drug being given by someone to themselves without a doctor. The first edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM) had drug abuse as a symptom of other psychological issues. In the third edition, substance abuse was made its own issue. The DSM also has drug abuse as a different issue than drug dependence, which is defined as compulsive use of a drug. == Society and culture == Most countries have laws that make having or using certain drugs illegal. The rules for these drugs can be different between countries or in different parts of the same country. Many drugs that are illegal in several places are sold to make money for groups known as drug cartels. Drug abuse can also cause issues in a country’s economy. According to the European Union, about 2.5 billion dollars are lost each year because of people abusing drugs. This loss comes from people not going to work or having to go to the hospital because of the side effects of the drug. In the United Kingdom, about 29 billion dollars a year are lost. This number does not include the cost of police or other law enforcement. In the United States, the cost was 181 billion dollars in 2002. This number includes costs because of health issues, loss of work, law enforcement, and welfare programs. == Related pages == * Drug addiction ==References== Category:Health problems Category:Psychiatry",
 "title": "Substance abuse"
}