{
 "id": "419269",
 "text": "The Britons (also called Brythons) were the people who spoke a Celtic language known as Common Brittonic. They lived in Great Britain during the Iron Age, Roman Britain and the Sub-Roman period following the Romans' departure from Britain. Following the arrival of the Anglo-Saxons, who occupied most what is now the country of England, some of the Britons migrated to Wales, Cornwall and southern Scotland, while others moved to Armorica and renamed it Brittany. Those who remained were absorbed into Anglo-Saxon society. == Name == The name of the Britons in the modern English language is borrowed in part from , and in part from the French language of the Middle Ages (). During Roman Britain, the Latin word and its plural, , took the place of the Romans' earlier word for a person from Britain, , and its plural, the . The people of Roman Britain (the Romano-British population) named themselves in Latin. Other people also named the Britons this way: the work of the Roman historian Procopius names them as and in Ireland, the Britons were named the . Some modern Celtic languages also use this form for Britain was well: and . The Anglo-Saxon historian Bede, writing in Latin, used the name , with the plural . The \"e\" vowel in this spelling could be taken from the Anglo-Saxon language's word for the Britons: , also spelled Britt-, Bryt, Brytt-, Bret, and Brit. The Anglo- Saxons probably took this name from the Romano-British. The was a word used in Britain from the 5th century. Whether the Anglo-Saxons took the name Brett from the Latin name or from a British word of the same meaning is unknown. The Anglo-Saxons must have started using the word Brett by the 6th century. If they had copied the British word at a later time, the word would have had -th- instead of -t-, like the . In that case, the Old English copy would have had -þ- or -ð- in the place of -tt-. The name continued to be used in Middle English, with the spellings Bret, Brette, Brettis. Middle English also used the forms Brut and Brutt-, with the spelling copied from the name of Brutus of Troy. Mythology in the Middle Ages said that Britain was named after Brutus. In Early Modern English, the forms Brett and Britt were used. The spellings Bret and Brit were used in Scots. The first Professor of Celtic at the University of Oxford, John Rhys, was the first person to use the name \"Brython\" (from ) in academia as another English language word for the Britons. He named the languages of the Britons \"Brythonic\", or the \"Brythonic languages\". Rhys used these names to be clear about what he meant, because names like \"British\" can be ambiguous (with more than one meaning). \"Brythonic\" and \"Brythonic languages\" are names that are no longer common. The names \"Brittonic\" and \"Brittonic languages\" are now more common in linguistics (the study of languages). == Celtic tribes == From the Iron Age onward, Britain was divided among a variety of Celtic tribes. When the Romans came, many of the tribes adopted Roman culture and the Latin language. === Central === * The Brigantes - Controlled what would later be much of Northern England. * The Carvetii - Located in the area of the Solway Plain just north of Hadrian's Wall. * The Corieltauvi - They lived in what is now the East Midlands. * The Cornovii - Lived in what is now the West Midlands. * The Parisii - Occupied what is now East Yorkshire. === Southeastern === * The Atrebates - Occupied what is now West Sussex, parts of Hampshire and Surrey. * The Belgae - Were in and around the county of Hampshire. * The Cantiaci - Lived in and gave their name to the modern county of Kent * The Catuvellauni - Occupied what would later be Hertfordshire, Bedfordshire and Cambridgeshire. * The Iceni - Were in area of what was later Norfolk, Suffolk, Cambridgeshire and Huntingdonshire * The Regnenses - They occupied what would be East Sussex and Surrey. * The Trinovantes - Controlled Essex and parts of Hertfordshire and Middlesex. === Western === * The Deceangli - Their territory included north-east Wales. * The Demetae - Gave their name to Dyfed; also inhabited modern Pembrokeshire and Carmarthenshire. * The Dobunni - Their territory included Northern Somerset, Bristol, and Gloucestershire. * The Dumnonii - Occupied what would be Cornwall and Devon. * The Durotriges - Occupied the later area of Dorset and western Hampshire. * The Gangani - They occupied much of north-western Wales. * The Ordovices - They lived in northern Wales and Anglesey * The Silures - Their territory included modern Monmouthshire, Breconshire and Glamorganshire. == Notes == == References == == Other websites == * The Kingdom of the Britons, BBC Scotland's History * Celtic Britons, BBC Wales History Category:Ethnic groups in Europe Category:History of the United Kingdom Category:Celtic peoples",
 "title": "Celtic Britons"
}