{
 "id": "419321",
 "text": "Ceol also spelled Ceola or Ceolric (20 April 557 – 16 October 597) was the King of Wessex from 592 until his assassination in 597. His reign is mostly known thanks to the Anglo-Saxon Chronicle. ==Early Life== Ceol was born on 20 February 557. His father was Cutha, who was the son of King Cynric and the younger brother of Ceawlin who was then crown prince. Ceol grew up learning Archery, Science, History, and as well as learning to fight in battles. When Ceol grew older, his battle skills improved and that he quickly rose through the ranks. ==Reign== ===Revolt against Ceawlin=== In 584, Ceol's father was killed most likely on the orders of Ceawlin who was now king as Cutha attempted to overthrow him in the failed Revolt of 584 as Ceawlin accidentally killed Cutha's wife. Ceol was mad at his uncle for killing his father, who Ceol loved so much. However, Ceawlin exiled Ceol and his family away from Wessex. They lived in exile in Essex. Seven years later in November 591, Ceol raised troops against Ceawlin in Essex and started another revolt against the king. Ceol and his troops captured every part of Wessex. They captured the many major cities in Wessex including Dorchester and the capital, Winchester. Ceawlin was eventually overthrown and exiled in Tuam, Chonnacht (present-day Ireland). ===Rule=== Ceol, who was now king was crowned on 25 June 592 at Winchester Cathedral. The first thing Ceol did as king was to rebuild the kingdom as it has been destroyed during the rebellion. He ordered the reconstruction of the towns in Wessex that has been damaged. Ceol then planned to reform the country and improve the literacy rate in the kingdom. He builded more schools for young kids to be educated. He also expanded the army and the navy of Wessex. He also created peace with neighbouring countries and as well as stabilising Wessex. However, for those who opposed his rule, Ceol would put them in prison. Thus Ceol became controversial and many people began opposing his rule. ===Downfall and Death=== Because Ceol became super controversial and would put many people in prison, his younger brother, Ceolwulf started a revolt against Ceol and killed him. Ceolwulf eventually became the new king. ==Legacy== Ceol has a great reputation. During his rule, Wessex became more powerful and the people would experience peace and prosperity. His son Cynegils would go on to become the King of Wessex after Ceol's younger brother, Ceolwulf died in 611. Ceol was considered a great and a solid king. Category:557 births Category:597 deaths Category:Kings and Queens of Wessex Category:6th century in England",
 "title": "Ceol of Wessex"
}