{
 "id": "419450",
 "text": "Meet the Press is an American television news/interview show that airs on NBC. It began on November 6, 1947. It is the longest-running television show in American television history. The show's format has a long one-on-one interview with a person who works in politics. There may also be a discussion with either members of Congress or political commentators. Meet the Press began on radio in 1945 as American Mercury Presents: Meet the Press. It was a show that was used to promote The American Mercury, an American magazine that was issued from 1924 to 1981.60 Years Ago in News History: America Meets the Press from the Newseum website The show moved to television with a shorter title of just Meet the Press on November 6, 1947. Over the years, the show has had twelve hosts called \"moderators\". The first moderator was Martha Rountree. The current moderator is Kristen Welker, who has hosted the show since 2023. Tim Russert was the show's longest-lasting moderator, who hosted from 1991 until his death on June 13, 2008. == Moderators == This is a list of moderators who have hosted Meet the Press. Martha Rountree 1947–1953 Ned Brooks 1953–1965 Lawrence E. Spivak 1966–1975 Bill Monroe 1975–1984 Roger Mudd & Marvin Kalb (co-moderators) 1984–1985 Marvin Kalb 1985–1987 Chris Wallace 1987–1988 Garrick Utley 1989–1991 Tim Russert 1991–2008 Tom Brokaw 2008 David Gregory 2008–2014 Andrea Mitchell 2014 Chuck Todd 2014–2023 Kristen Welker 2023–present == References == == Other websites == * Meet the Press official website * 60th anniversary background information * * * Category:NBC network series Category:American television talk shows Category:1950s American television series Category:1960s American television series Category:1970s American television series Category:American television news programs Category:Black and white television series Category:NBC Category:Peabody Award winners Category:Radio programs Category:English-language television programs",
 "title": "Meet the Press"
}