{
 "id": "419446",
 "text": "Ceawlin (also spelled Ceaulin, Caelin and Celin; 27 February 530 — 25 April 593) was the King of Wessex from 560 until in 592 where he was overthrown by his nephew, Ceol, who became his successor. His reign is mostly known thanks to the Anglo-Saxon Chronicle. It was said that Ceawlin was very active fighting in battles. It was also said that it was during Ceawlin's reign where Wessex greatly expanded. == War leader and king == Ceawlin was the son of Cynric. He is mentioned as fighting alongside his father against the Bretons at Branbury in 556.Benjamin Thorpe, The Anglo-Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 15 According to the Anglo-Saxon Chronicle Ceawlin became king of the West Saxons in 560.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 21 Bede states Ceawlin was the second king to rule the southern English as overlord.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 111 The informal term for a king that ruled over other kings was bretwalda. The term comes from the Anglo-Saxon Chronicle and means 'Britain ruler'.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), pp. 34–35 These overkings typically received tribute from other Anglo- Saxon kings in the south.Barbara Yorke, Wessex in the early Middle Ages (London; New York: Leicester University Press, 1995), p. 34 In 577 Ceawlin, with his son Cuthwine, led the Gewisse against the Britons at 'Deorham' (Dyrham in Gloucestershire).Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 29 They reportedly killed three kings, Coinmail, Condidan, and Farinmail. Ceawlin and Cuthwine captured Gloucester, Cirencester and Bath. West Saxons then colonized the lower Severn valley. The importance of this victory was that it gave the West Saxons access to the western sea.Peter Hunter Blair, An Introduction to Anglo-Saxon England (Cambridge: Cambridge University Press, 2003), p. 35 This also divided the Britons so they could no longer communicate by land. But it was territory later Wessex kings would not be able to hold. In 584 Ceawlin defeated the Britons at Fethanlea (Oxfordshire) but his ally Cutha was killed there.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 301 About 592 Ceawlin fought a battle at Woddesbeorg (or Wodnesbeorg) also called Adam's Grave, east of Devizes in Wiltshire. There was a 'great slaughter' but nothing was said as to who he fought; Britons or Anglo-Saxons. But it was over this loss that Ceawlin was driven out of power.Benjamin Thorpe, The Anglo- Saxon Chronicle according to the Several Original Authorities: Translation (London: Her Majesty's Stationery Office, 1861), p. 17 His nephew Ceol replaced him as king in 592.Jim Bradbury, The Routledge Companion to Medieval Warfare (London; New York: Routledge, 2004), p. 25 Ceawlin died in 593. At the end of his reign, the Gewisse or West Saxons held the lands of Berkshire, Wiltshire, Hampshire and much of Gloucestershire. == Notes == == References == == Other websites == * Britannia: Kings of Wessex Category:Year of birth unknown Category:590s deaths Category:Kings of Wessex",
 "title": "Ceawlin of Wessex"
}