{
 "id": "419418",
 "text": "A harrow is a farm tool. It is an implement for breaking up and smoothing out the surface of the soil. In this way it is different from a plow, which cuts deeper into the soil. A plow also lifts up the soil and tips it over, but a harrow works mostly by cutting into the soil and breaking it up. Harrowing is often carried out on fields to follow the rough surface left by plowing. The purpose of this harrowing is generally to break up clods (lumps of soil) and to provide a finer finish, a good tilth or soil structure that is good for planting seeds. It may also be used to remove weeds and to cover up seed after sowing. Harrows differ from cultivators in that they disturb the whole surface of the soil, instead of disturbing only narrow trails that avoid crop rows (to kill weeds). ==Types== There are four general types of harrows: disc harrow, tine harrow, chain harrow and chain disk harrows. Harrows were originally pulled by draft animals, such as horses, mules, or oxen, or in some times and places by people. In modern practice they are almost always pulled by tractors, either from a drawbar or mounted on the three-point hitch. Harrows may be of several types and weights, depending on their purpose. They almost always consist of a rigid frame that holds discs, teeth, linked chains, or other means of moving soil—but tine and chain harrows are often only supported by a bar at the front of the set. * Disc harrows are typically used for heavy work, such as following plowing to break up the sod. The discs have notched edges and are slightly curved to help them catch the soil and rotate. This helps mix the soil, instead of leaving ridges and trails behind. In addition, there are various types of power harrow, in which the cultivators are power- driven from the tractor rather than working by being dragged. Giant disc harrows can be used in place of a plow in rough areas with tree stumps and rocks. * Chain harrows are often used for lighter work such as levelling the tilth or covering seed. They can also be used on pastures to spread out manure, or for smoothing a playing field, such as a baseball infield. * Tine harrows are used to prepare the field before planting, to remove small weeds in growing crops and to loosen the soil between rows. This lets water soak into the ground easier. A tine is a metal bar pointing to the ground. Unlike a disc, it does not rotate. * The fourth is a chain disk harrow. Disk attached to chains are pulled at an angle over the ground. These harrows move rapidly across the surface. The chain and disk rotate to stay clean while breaking up the top surface to about 1 inch (3 cm) deep. A smooth seedbed is prepared for planting with one pass. Depending on the type of soil and the crop being planted, one or more types of harrows may be used to get the soil ready for planting. If the soil is very light so that it might easily be wind-blown, a roller can be used at the end to settle it. A drag is a name for a heavy harrow, often a chain type. ==References== Category:Agricultural machinery",
 "title": "Harrow (tool)"
}