{
 "id": "41947",
 "text": "Extraterrestrial life is life that is not from the planet Earth. It is also called alien life or just extraterrestrials or aliens. The word 'Terra' in Latin refers to our planet - Earth. Thus, extraterrestrial life refers to the life forms not originating on or from the planet Earth. It is reasonable to say that planets rather like ours exist, and that life might evolve there also. So far, none has been found, though it is possible that life once existed on Mars.Sagan, Carl & Shklovskii I.S. 1966. Intelligent life in the Universe. Random House. It is not a new idea. Some philosophers have speculated on the existence of other planets like ours, with the idea that what happened here could also happen there.Crowe, Michael J. 1986. The Extraterrestrial life debate, 1750–1900. Cambridge. Crowe, Michael J. 2008. The extraterrestrial life debate Antiquity to 1915: a source book. University of Notre Dame Press. One thing we do know is that many other star systems have exoplanets. Searches like SETI have been made for signals from extraterrestrial life-forms.Sagan, Carl 1973. Communication with extraterrestrial intelligence. MIT Press. No clear signals from outer space have been detected yet. ==In fiction== Alien life is commonly seen in Science fiction and some Fantasy. Aliens in fiction are frequently shown as looking a lot like humans, but some authors have created much stranger aliens. H.P. Lovecraft, Kurt Vonnegut, and H.G. Wells all wrote about aliens that look very different than humans. ==In religion== Some religions believe in aliens and may treat them like divine beings in other religions. Examples are Raëlism, Scientology and the Heaven's Gate cult, who killed themselves because they thought it would allow their souls to go to an alien spaceship. ==In pseudoscience== Some people think that UFOs are alien spacecraft, or claim to have seen alien life on Earth. They may even claim they were kidnapped by aliens, who are often said to have big black eyes and grey skin. There is no good evidence for these claims and most scientists consider them Pseudoscience or Urban legends. ==Related pages== * Abiogenesis * Astrobiology * Earliest known life forms * Extraterrestrial sky * Panspermia * Voyager Golden Record == References == == Other websites == *Actual Aliens : Extraterrestrial News and Current Events *PBS: Exploring Space - The Quest for Life by Scott Pearson *ufoskeptic.org by Bernard Haisch *\"What Aliens Might Look Like\" from National Geographic *Top stars picked in alien search",
 "title": "Extraterrestrial life"
}