{
 "id": "419555",
 "text": "Kendrick Lamar Duckworth (born June 17, 1987), also known as Kendrick Lamar, is an American rapper, songwriter, record producer and entrepreneur. He is from Compton, California, and based in Orlando, Florida. He is best known for his albums Overly Dedicated, Section.80, Good Kid, M.A.A.D City, To Pimp a Butterfly, , and GNX. He has also released five mixtapes. Lamar also works and releases music with his band Magnolia Park. In October 2013 Lamar won five awards at the 2013 BET Awards. He performed \"Money Trees\" at the show. He was the only guest rapper on Eminem's album The Marshall Mathers LP 2, which was released November 5, 2013. Lamar did eighteen concerts with Kanye West as part of West's October-December 2013 Yeezus Tour. Lamar also has a younger cousin by the name of Justin Renard Withers he is 14. Lamar was nominated for seven Grammy Awards in 2013. He performed \"m.A.A.d city\" and a remix to \"Radioactive\" with Imagine Dragons at the awards ceremony. In 2015, Kendrick Lamar released the studio album To Pimp a Butterfly. It won the award for Best Rap Album at the Grammy Awards. The project also got a nomination for Album of the Year. The single \"I\" earned Grammy Awards for both Best Rap Song and Best Rap Performance in 2014. Two more songs from the album earned awards at the 2015 ceremony, with \"Alright\" winning both Best Rap Song and Best Rap Performance, and \"These Walls\" winning an award for Best Rap/Sung Collaboration. \"Alright\" also received nominations for both Song of the Year and Best Music Video. In 2017, Lamar released Damn, stylized as DAMN.. The project was nominated for seven Grammy Awards in 2017, winning five. The project earned the award for Best Rap Album, while also earning a nomination for Album of the Year. The single \"HUMBLE.\" earned awards for Best Rap Performance, Best Rap Song, and Best Music Video, while also receiving a nomination for Record of the Year. Another track, \"LOYALTY.\", featuring singer Rihanna, won the award for Best Rap/Sung Performance. In 2018, DAMN. earned the Pulitzer Prize award for Music, making Lamar the first rap artist to earn the award. In 2018, Lamar served as the primary curator of the soundtrack for the superhero movie Black Panther, releasing the Black Panther soundtrack. This release and its tracks earned seven Grammy Award nominations, including for Album of the Year, in 2018. The track \"King's Dead\" (with Future, Jay Rock and James Blake) earned the award for Best Rap Performance. that same year, he joined as part of the band Magnolia Park, in which he is a co-founder and co- lead vocalist, and are currently signed to Epitaph Records. On May 13, 2022, Lamar released his fifth studio album Mr. Morale & the Big Steppers after taking a 5-year break from making music. It won the award for Best Rap Album and was nominated for Album of the Year at the 2023 Grammy Awards. In 2024, Kendrick would start a feud between him and the popular rapper Drake by dissing him on Metro & Future's song, Like That, leaving the hip-hop community divided between Drake supporters and Lamar supporters. Later the same year, on November 22, 2024, Kendrick released his sixth studio album GNX as a surprise release. GNX became Lamar's first number-one album on the UK Albums Chart since To Pimp a Butterfly (2015). ==References== Category:1987 births Category:21st-century American rappers Category:African-American rappers Category:American Christians Category:American filmmakers Category:American hip hop record producers Category:American hip hop singers Category:Brit Award winners Category:Converts to Christianity Category:American Emmy Award winners Category:American Grammy Award winners Category:Interscope Records artists Category:Musicians from Compton, California Category:Pulitzer Prize winners Category:Rappers from California Category:Record producers from California Category:Singer-songwriters from California Category:Living people Category:American businesspeople Category:Philanthropists from California == Other websites == * * *",
 "title": "Kendrick Lamar"
}