{
 "id": "419756",
 "text": "Major roads in New South Wales are organised into many routes. These help drivers to navigate their way between places in the state. Each route is given its own route number. The number consists of a letter (M, A or B) and a one- or two-digit number. 'M' routes are motorways, 'A' routes are national routes, and 'B' routes are state routes. The route system includes highways, motorways, and other important roads that have not been declared highways. Route numbers have been allocated to roads in New South Wales since 1955. To supplement the national route number system, three ring roads were built in Sydney in 1964. These were numbered 1, 3 and 5. In 1973, a system of numbering freeways was introduced to New South Wales to complement the national routes and ring roads. In 1974, the National Highway network was defined, which in New South Wales included the Hume Highway, Federal Highway, Barton Highway, Sydney-Newcastle Freeway (now Pacific Motorway) and New England Highway. In 1993, Sydney's Metroad system was introduced. In 2013, the state replaced its entire system of State Routes, National Routes, National Highways and Metroads with a new route numbering system of letters and numbers. The roads no longer uses National Highway shields on any route. This new system of routes are the routes that are listed below. ==Motorways (M routes)== Route # Road name Destinations Distance (km) M1 Pacific Motorway Ewingsdale to Queensland border 56 M1 Pacific Motorway Grafton Bypass M1 Pacific Motorway M1 Pacific Motorway M1 Pacific Motorway Wahroonga to Newcastle 127 M1 M1 (Sydney) Artarmon to Kyeemagh 21 M1 Princes Motorway Waterfall to Wollongong 53 M2 M2 (Sydney) Artarmon to Seven Hills 25 M4 M4 Western Motorway, M4 East Haberfield to Lapstone 46 M5 M5 (Sydney) Mascot to Edmondson Park 26 M6 Southconnex (proposed) M7 Westlink M7 Prestons to Seven Hills 40 M8 Westconnex M8 A3/M5 junction to St Peters 9 M9/M10 Outer Sydney Orbital (under proposal) M12 Western Sydney Airport Mwy (proposed) M15 Hunter Expressway Cameron Park to Belford 39 M23 Federal Highway Yarra to ACT border 66 M25 Barton Highway (under construction) M31 Hume Motorway/Hume Highway Prestons (Sydney) - Goulburn - Gundagai - Albury - Victoria border 512 ==Routes of national significance (A routes)== Route # Road name Destinations Distance (km) A1 Pacific Highway Ewingsdale to Newcastle 620 A1 Pacific Highway Wahroonga to Artarmon 15 A1 A1 (Sydney) Kyeemagh to Waterfall 31 A1 Princes Highway Wollongong to Victoria border 426 A2 A2 (Sydney) Seven Hills to Windsor 21 A3 A3 (Sydney) Mona Vale to Blakehurst 52 A4 A4 (Sydney) North Sydney to North Strathfield 15 A6 A6 (Sydney) Carlingford to Heathcote 34 A8 A8 (Sydney) Mona Vale to North Sydney 23 A9 A9 (Sydney) Campbelltown to Windsor 61 A15 New England Highway Branxton - Tamworth - Armidale - Queensland Border 541 A20 Sturt Highway Gundagai to Victoria Border 597 A22 Hume Highway, Parramatta Road Sydney to Liverpool 30 A25 Barton Highway ACT border to Yass 40 A28 Cumberland Highway Wahroonga to Prestons 42 A32 Barrier Highway, Great Western Highway, and Mitchell Highway Lapstone to SA Border 1146 A34 Milpera Road, Canterbury Road, New Canterbury Road Liverpool to Newtown 26 A36 Princes Highway, King Street, City Road Kogarah to Sydney 11 A37 Newcastle Inner City Bypass Windale to Sandgate 16 A38 A38 (Sydney) North Ryde to Dee Why 18 A39 Newell Highway Victoria border - Narranderra - Dubbo - Narrabri - Queensland border 1059 A40 Victoria Road Rozelle to West Baulkham Hills 29 A41 Mid- Western Highway and Olympic Highway Bathurst to Albury 423 A43 New England Highway and Motorway Link Warnervale to Branxton 115 A44 Great Western Highway (Sydney) Strathfield to Emu Plains 45 A48 Illawarra Highway Sutton Forest to Wollongong 62 A49 Central Coast Highway Doyalson to Kariong 50 ==Routes of state significance (B routes)== Route # Road name Destinations Distance (km) B23 Monaro Highway ACT border - Cooma - Victoria border B51 Kamilaroi Highway Willow Tree to Narrabri B52 Kings Highway ACT border to Batemans Bay B53 B53 (NSW) Wallsend to Morisset B55 Castlereagh Highway Lithgow - Mudgee - Gilgandra - Queensland border B56 Oxley Highway Port Macquarie to Coonabarabran B57 B57 (NSW) Speers Point to Charlestown B58 Riverina Highway Deniliquin to Victoria border B59 Bells Line of Road Windsor to Lithgow B60 Bruxner Highway Ballina to Boggabilla B62/ Tourist Drive 24 Ewingsdale to Lismore B63 Kotara to Nelson Bay B64 Mid-Western Highway Cowra to Hay B65 Bulli Tops - Wollongong - Shellhabour B68 Beresfield to Cessnock B69 Appin Road Campbelltown to Bulli Tops B70 Warnervale to Noraville B71 Mitchell Highway Nyngan to Queensland border B72 Snowy Mountains Highway Steeple Flat to Stony Creek 287 B73 Mittagong to Nowra B74 Wyong Road Tuggerah to The Entrance B75 Cobb Highway Wilcannia - Deniliquin - Victoria border 598 B76 Gwydir Highway and Kamilaroi Highway South Grafton to Bourke B78 Waterfall Way Urunga to Armindale 165 B79 Silver City Highway Curlwaa to Broken Hill B81 Lachlan Valley Way Yass to Molong B82 B82 (Hunter Region, NSW) Freemans Waterhole to Branxton B83 Pacific Highway Wahroonga to Somersby B84 Golden Highway Belford to Dubbo 314 B85 Goldfields Way West Wylong to Junee 113 B87 Kidman Way Jerilderie to Bourke 644 B88 Picton Road Picton to Wollongong 45 B89 West Wallsend to Belmont B91 Summerland Way Grafton to Queensland border 199 B94 Burley Griffin Way Bowning to Griffith 289 B95 Fossickers Way Tamworth to Warialda ==References== Category:Roads in New South Wales Category:Lists of roads",
 "title": "List of road routes in New South Wales"
}