{
 "id": "419736",
 "text": "Agilbert (flourished 650–) was Frankish by birth and educated in Ireland. He became the second Bishop to the West Saxons after Bishop Birinus. Following a disagreement with king Cenwalh of Wessex he returned to Gaul to eventually become the Bishop of Paris. == Career == === Wessex === Agilbert studied in Ireland for several years.David Farmer, The Oxford Dictionary of Saints, Fifth Edition Revised (Oxford: Oxford University Press, 2011), p. 6 In 650 he came to Wessex as a missionary.Charles Dodd, Church History of England, Vol. I (London: Charles Dolman, 1840), p. 44 Cenwalh, the king, was impressed by his background he offered Agilbert the bishopric of Dorchester.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 154 This was the seat originally given to Bishop Birinus who founded a church at Dorchester on Thames.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 118 Birinus had died in 650 and Cenwalh was looking for a replacement.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 304 But after some time Cenwalh grew tired of not being able to understand the bishop, who apparently did not speak the Anglo-Saxon language.Peter Hunter Blair, The World of Bede (Cambridge; New York: Cambridge University Press, 1990). p. 111 Cenwalh created a new diocese at Winchester in 660 and made Wine the first bishop. Agribert took offense at not being consulted and left his see.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 122 === Northumbria === Agilbert did not leave England immediately but visited Northumbria.N. J. Higham, The Convert Kings: Power and Religious Affiliation in Early Anglo-Saxon England (New York: Manchester University Press, 1997), p. 255 A controversy had occurred in the Northumbrian church over the date of Easter. The king Oswiu of Northumbria and his son Eahlfrith each backed a different church position. Why Agilbert came to Northumbria at this time or who sent him is not recorded. But kings Osiwu and Cenwalh were friends. They both supported the Roman position that Easter should be celebrated the same throughout the Christian world. A synod was called at Whitby to settle the issue. Bishop Agilbert was the senior ecclesiastic there who supported the Roman position. As he did not speak the language well, he asked Wilfrid to speak for him. Their argument was why did only the remote parts of Britain celebrate Easter differently than the remainder of the Christian world? Osiwu made a decision to celebrate Easter with the rest of the Christian churches. === France === Agilbert wandered in Gaul (later France) for a time before accepting the position of Bishop of Paris. He held that position from for about 12 years. He consecrated Wilfrid as a bishop at Compiègne along with several others. Later Bishop Wine was expelled from Wessex by Cenwalh.D. P. Kirby, The Earliest English Kings, Second Edition (London; New York: Routledge, 2000),p. 49 This left Wessex without a bishop. Cenwalh sent appeals to Agilbert to return to Wessex. Agilbert turned Cenwalh down saying his current duties as bishop of Paris prevented his return.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 155 But he sent his nephew Leutherius in his place. Leutherius was welcomed in Wessex as the new bishop of Winchester. Agilbert died sometime after 679. He was buried at the monastery of Jouarre. ==Notes== ==References== Category:year of birth unknown Category:year of death unknown Category:Bishops",
 "title": "Agilbert"
}