{
 "id": "420440",
 "text": "Eastern Development Region () was one of Nepal's five development regions. It was at the eastern end of the country. Its headquarters were at Dhankuta. ==Geography== The Eastern Development Region had Sikkim and West Bengal (India) to the east, Bihar (India) to the south, the Central Development Region to the west and the Tibet Autonomous Region (People's Republic of China) to the north. The Eastern Region was the third largest Development Region of Nepal with an area of . It was the second in population with 5,811,555 (21.9% of total) people living there in 2011. Its population density was 204.2 persons/km2. The region had three ecological zones: the high mountains, the hills and the Terai. The highest mountain in the region, and in the world, is Mount Everest. It is in the Solukhumbu District, Sagarmatha Zone. The lowest point of Nepal, Kechana Kalan is also here, in the Jhapa district. It is near the Mechi river and close to the border with India. The most important rivers in the Eastern Development Region were the Kosi, tributary of the Ganges river; and the Mechi, tributary of the Mahananda River. Nepal's largest river system (the Kosi) and its highest waterfall (the Hyatrung in the Terhathum district) were found in this region. The Hyatrung waterfall () is high. The region is rich in biodiversity. There are 28 species of Rhododendron (out of the 31 species available in Nepal) in the Tinjure- Milke-Jaljale area. ==Cities== The major cities of this region were Biratnagar, Dharan, Dhankuta, Itahari, Rajbiraj, Birtamod Urlabari and Damak. Other notable places are Namche Bazaar (the town near the base camp of Mt. Everest), Gaighat, Lahan, Ilam, etc. ==Administrative subdivisions== The Eastern Development Region had 3 Zones, parallel to each other, with a total of 16 Districts, 893 Village Development Committees (VDCs), 1 Sub-metropolitan city, and 13 Municipalities; the zones and districts were: Zone Population (2011) Area (km²) Pop. density (inh/km²) Districts Number Names Kosi 2,335,047 9,669 241.5 6 Bhojpur, Dhankuta, Morang, Sankhuwasabha, Sunsari, Terhathum Mechi 1,422,182 8,196 173.5 4 Ilam, Jhapa, Panchthar, Taplejung Sagarmatha 2,054,326 10,591 194.0 6 Khotang, Okhaldhunga, Saptari, Siraha, Solukhumbu, Udayapur Total 5,811,555 28,456 204.2 16 ==References== 5\\. growing dental services in kathmandu ==Related pages== *Development regions of Nepal *Districts of Nepal *Zones of Nepal ==Other websites== * Administrative Division of Nepal - Geonames * Purvāñcala * Nepalese Army: Eastern Division Category:Subdivisions of Nepal",
 "title": "Eastern Development Region, Nepal"
}