{
 "id": "420533",
 "text": "The branle is an old French dance of the 16th century. Though French in origin, it spread to most of western Europe. Spelling varies greatly: bransle, brangle, brawl, brawle, brall(e), braul(e), or (Scot.) brantle. == Dance == There are few descriptions of the dance steps. It is a sequence dance performed with partners in lines or circles.Arbeau, Thoinot [1589] 1967. Orchesography, translated by Mary Stewart Evans, with a new introduction and notes by Julia Sutton and a new Labanotation section by Mireille Backer and Julia Sutton. American Musicological Society Reprint Series. New York: Dover. ; . In John Marston's The Malcontent (1604), act 4, scene 2, the character Guerrino describes the steps of a dance called Beanchaes brawl (Bianca's branle): > t'is but two singles on the left, two on the right, three doubles forward, a > trauerse of six round: do this twice, three singles side, galliard tricke of > twentie, curranto pace; a figure of eight, three singles broken downe, come > vp, meete two doubles, fall backe, and then honour. A more detailed and more accessible account is given of the Scots branle by the dance historian Melusine Wood.Wood, Melusine [1952] 1982. Historical dances 12th to 19th century. London: Dance Books, p97 et seq: Steps used in the Scots branle. == Music == The music for the dance was written in duple or triple meter, depedning on the type of branle. The four types are simple, duple, guy, and Burgandian, as described by Thoinot Arbeau in his Orchesography. == Further reading == * *Heartz, Daniel 1998. New Grove Dictionary of Music and Musicians, 242-245. Macmillan. *Marston, John 1999. The Malcontent, edited by George K. Hunter, with a new introduction, together with a revised reading text and commentary notes. Revels Plays. Manchester University Press. . *Semmens, Richard T. 1997. Branles, Gavottes and Contredanses in the later seventeenth and early eighteenth centuries. Dance Research 15, 2, 35–62. == References == == Other websites == *Branle on Cunnan website: Category:Ballroom dances Category:French culture",
 "title": "Branle"
}