{
 "id": "420690",
 "text": "Central Development Region ( - Madyamānchal Bikās Kshetra) was one of Nepal's five development regions. It was in the east-central part of the country. Its headquarters were at Hetauda. ==Geography== The Central Development Region had the Eastern Development Region to the east, the India to the south, the Western Development Region to the west and the People's Republic of China to the north. The region was the fourth largest Development Region of Nepal. Its area was . It was first in population. There were 9,656,985 people living there in 2011. Its population density was the highest of all regions with 352.3 persons/km2. Part of this region was in the Kathmandu Valley with an area of . It was long from east to west, and long from north to south. The most important river in the Central Development Region was the Bagmati, tributary of the Kosi river. It flows through the Kathmandu Valley. It is part of the Ganges watershed. The Bagmati is considered a holy river by Hindus and Buddhists. Other rivers of this region were Kamala, Lakhandei and Bisnumati. These three small rivers are tributaries of the Bagmati. ==Cities== The major cities of this region were Kathmandu, Patan, Bharatpur, Bhaktapur, Bhairawa, Lalitpur, Nagarkot and Janakpur. Other notable places were Khokana, Hetauda, Harisiddhi, Godavari, etc. ==Administrative subdivisions== The region had 3 zones with a total of 19 districts: Zone Population (2011) Area (km²) Pop. density (inh/km²) Districts Number Names Janakpur 2,837,481 9,669 293.5 6 Dhanusa, Dolkha, Mahottari, Ramechhap, Sarlahi, Sindhuli Bagmati 3,843,596 9,428 407.7 8 Bhaktapur, Dhading, Kathmandu, Kavrepalanchok, Lalitpur, Nuwakot, Rasuwa, Sindhulpalchok Narayani 2,975,908 8,313 358.0 5 Bara,Chitwan, Makwanpur, Parsa, Rautahat Total 9,656,985 27,410 352.3 19 ==Related pages== *Development regions of Nepal *Districts of Nepal *Zones of Nepal ==References== ==Other websites== * Administrative Division of Nepal - Geonames * Madhyamāñcala * Friends of the Bagmati * UNESCO - Kathmandu Valley Category:Subdivisions of Nepal",
 "title": "Central Development Region, Nepal"
}