{
 "id": "420601",
 "text": "John Davis (born in 1784 in Surrey) was an American ship captain from New Haven, Connecticut. He is thought to have been the first to land on mainland Antarctica.Jane Bourke, Amazing Antarctica: Resource book (Greenwood, West. Aust.: Ready-Ed Publications, 2004), p. 6 He is one of four explorers who share this claim. In February 1821 he may have landed a boat at Hughes Bay.Christopher C. Joyner, Antarctica and the Law of the Sea (Dordrecht: Nijhoff, 1992), p. 5 The Davis Strait which separates Baffin Bay from the Labrador Sea was named by William Baffin in 1916. He probably named it after John Davis.William J. Mills, Exploring Polar Frontiers: A Historical Encyclopedia, Volume 1 (Santa Barbara, CA: ABC-CLIO, 2003), p. 177 On March 20, 1820, Davis left New Haven, Connecticut for a trip to the Pacific Ocean. He had received news of the discovery of the South Shetland Islands while he was anchored at the Falkland Islands. Learning there were large numbers of seals there, he and another ship captain sailed their vessels to Greenwich Island. But it was too late in the season and other sealers were there before them. So Davis took his ship, named Cecilia, in search of seals further south. Finding many seals at Low Island he continued southwards. He probably came upon Hughes Bay on the Antarctic Peninsula. His ship's log records he found \"a large body of land.\" He sent a boat to shore to look for seals but found none. He also wrote \"I think this southern land to be a continent\". He also wrote in the log the latitude was 64°01'S (sixty-four degrees, one minute, south). Davis continued his journey back to Greenwich Island arriving there on 10 February, 1821. He wintered at the Falkland Islands and returned to seal hunting the following season.Robert K Headland, Chronological List of Antarctic Expeditions and Related Historical Events (Cambridge: Cambridge University Press, 1989), p. 121 It remains impossible, however, to prove he was the first to reach Antarctica. ==References== Category:American explorers Category:1784 births Category:People from Surrey Category:English explorers Category:People from Connecticut Category:Explorers of Antarctica Category:Year of death unknown",
 "title": "John Davis (sealer)"
}