{
 "id": "42089",
 "text": "Edward IAlthough he is often known as \"Edward I\", some historians call him \"Edward IV\" because prior to the Norman conquest, there were three kings with the name \"Edward\": Edward the Elder, Edward the Martyr and Edward the Confessor. Because some historians refer to the first three King Edwards of England as \"Edward I\", \"II\" and \"III\", Edward who is often called Edward I is known as \"Edward IV\". (17 June 1237 – 7 July 1307), nicknamed the Tall, the Brave, the Lord, the HammerEdward was nicknamed \"the Hammer\" because he was called \"Hammer of the Scots\" because of his interest in Scotland. However, the nickname was not used during his lifetime and Edward got the nickname after his death. and as well as Longshanks (meaning 'long legs'), was the King of England from 1272 to his death. He was the son of King Henry III of England and Queen Eleanor of Provence. He was considered one of England's best kings because of his effective rule and his braveness. As a young man, Edward fought Simon de Montfort in defence of his father's crown. He went on a crusade, and his father died as Edward was on his way back. As a ruler, he improved the laws and made the English Parliament regular and more important. He conquered Wales and subdued the Welsh by brutal policies. He was determined to control Scotland through puppet kings and barely managed to do it during his lifetime. He expelled the Jewish people from England. == Early life == Edward I was born at Westminster in June 1237 to King Henry III of England and his wife, the French noblewoman and English Queen Eleanor of Provence. The baby was named Edward after an earlier king, Edward the Confessor, who happened to be a personal hero of his HenryMarc Morris 2008. A great and terrible King: Edward I and the forging of Britain, chapter 1. As a boy, Edward had a good education and was taught in Latin and French, the most used languages in Europe at the time. In 1254, English fears of a Castilian invasion of the English province of Gascony made Henry III arrange a marriage between his 15-year-old son and the 13 year-old Eleanor, the half-sister of King Alfonso X of Castile. Eleanor and Edward married on 1 November 1254 in Castile. As part of the marriage agreement, the young prince got grants of land worth 15,000 marks a year. Though the endowments King Henry made were sizable, they offered Edward little independence. He had received Gascony as early as 1249, but Simon de Montfort, 6th Earl of Leicester, as royal lieutenant, drew the income. In practice, Edward derived neither authority nor revenue from the province. The grant that he received in 1254 included most of Ireland and much land in Wales and England, including the earldom of Chester, but the king kept control over the land, particularly in Ireland and so Edward's power was limited there as well, and the king got most of the income from those lands. ===Civil war=== The years 1264–1267 saw the conflict known as the Second Barons' War in which baronial forces led by Montfort fought against those who remained loyal to the king.The First Barons' War was in 1215–1217. The first scene of battle was the city of Gloucester, which Edward, now a young man who could participate in battles, managed to retake from the enemy. When Robert de Ferrers, Earl of Derby, came to the assistance of the rebels, Edward negotiated a truce with him but later broke its terms. Edward then captured Northampton from Montfort's son, also Simon. The baronial and royalist forces finally met at the Battle of Lewes, on 14 May 1264. Edward, commanding the right wing, performed well and soon defeated the London contingent of Montfort's forces. Unwisely, however, he followed the scattered enemy in pursuit and on his return found the rest of the royal army defeated. By the agreement known as the Mise of Lewes, Edward and his cousin Henry of Almain were given up as prisoners to Montfort. Edward remained in captivity until March, and even after his release he was kept under strict surveillance. Meanwhile, de Montfort used his victory to set up a de facto government. He even summoned the Parliament of 1265, known as Montfort's Parliament. Then, on 28 May 1265, Edward managed to escape his custodians and joined up with the Earl of Gloucester, who had recently defected to the king's side. Montfort's support was now dwindling, and Edward retook Worcester and Gloucester with relatively little effort. Meanwhile, Montfort had made an alliance with Llywelyn and started moving east to join forces with his son Simon. Edward managed to make a surprise attack at Kenilworth Castle and moved on to cut off Montfort. The two forces then met at the second great encounter of the Barons' War, the Battle of Evesham, on 4 August 1265. Montfort stood little chance against the superior royal forces, and after his defeat, he was killed and mutilated on the field. The war did not end with Montfort's death, and Edward continued campaigning. At Christmas, he came to terms with the younger Simon de Montfort and his associates at the Isle of Axholme, in Lincolnshire. In March, Edward led a successful assault on the Cinque Ports. A contingent of rebels held out in the virtually-impregnable Kenilworth Castle and did not surrender until the drafting of the conciliatory Dictum of Kenilworth.The Dictum restored land to the disinherited rebels, in exchange for a fine decided by their level of involvement in the wars; In April, it seemed as if the Earl of Gloucester would take up the cause of the reform movement, and the civil war would resume, but after a renegotiation of the terms of the Dictum of Kenilworth, the parties came an agreement.The essential concession was that the disinherited would now be allowed to take possession of their lands before paying the fines. Edward, however, was little involved in the settlement after following the wars since his main focus was now on planning his upcoming crusade. ===Crusade and accession=== The Eighth Crusade was Louis IX's campaign in Tunisia, and the Ninth Crusade was Edward's expedition to the Holy Land. The two are sometime considered as one crusade. Edward took the Crusader's cross in an elaborate ceremony on 24 June 1268, with his brother Edmund and cousin Henry of Almain. Among others who committed themselves to the Ninth Crusade were some of Edward's former opponents. There was great difficulty raising funds for the expedition. Originally, the Crusaders intended to relieve the beleaguered Christian stronghold of Acre, but before they could do so, several disasters happened to the French forces. They were struck by an epidemic, which on 25 August took the life of King Louis himself in 1270The disease in question was either dysentery or typhus; When Edward arrived at Tunis, Charles had already signed a treaty with the emir, and there was little else to do but return to Sicily. The crusade was postponed until next spring, but a devastating storm off the coast of Sicily made Charles of Anjou and Louis's successor, Philip III, decide against from any further campaigning. Edward decided to continue alone and on 9 May 1271 finally landed at Acre. By then, the situation in the Holy Land was become fragile. Jerusalem had fallen in 1244, and Acre was now the centre of the Christian area. The Muslim states were on the offensive under the Mamluk leadership of Baibars and were now threatening Acre itself. An embassy to the Mongols helped bring about an attack on Aleppo in the north, which helped to distract Baibar's forces. In November, Edward led a raid on Qaqun, which could have served as a bridgehead to Jerusalem, but both the Mongol invasion and the attack on Qaqun failed. Things now seemed increasingly desperate. Finally, an attack by a Muslim assassin in June forced him to abandon any further campaigning. Although he managed to kill the assassin, he was struck in the arm by a dagger that was feared to be poisoned, and he became severely weakened over the following months. It was not until 24 September that Edward left Acre. Arriving in Sicily, he was met with the news that his father had died on 16 November. Edward was deeply saddened by this news, but rather than hurrying home at once, he made a leisurely journey northwards. The political situation in England had been stable since the mid-century upheavals, and Edward was proclaimed king at his father's death, rather than at his own coronation, as had been customary.Though no written proof exists, it is assumed that this arrangement was agreed on before Edward's departure; In Edward's absence, the country was governed by a royal council, led by Robert Burnell. The new king embarked on an overland journey through Italy and France, where, among other things he visited the pope in ,and suppressed a rebellion in Gascony. It was only on 2 August 1274 that he returned to England, and he was crowned on 19 August. == King == Edward's reign had two main phases. The first phase was administration of a now-peaceful country. The second phase was warfare against Wales and Scotland. === Administration === His first concerns were to restore order and to re-establish royal authority after the disastrous reign of his father. To do so, he changed the administrators. He appointed Robert Burnell as chancellor, who held the post until his death in 1292. Edward then replaced most local officials such as the sheriffs. That was done to prepare for an inquiry, which would hear complaints about abuse of power by royal officers. Laws were made to define rights about ownership of land, recovery of debts, trade and local peacekeeping. === Parliament === Edward reformed the English Parliament and made it a source for generating revenue.Dictionary of National Biography. Edward held Parliament regularly in his reign. In 1295, a significant change occurred. For Parliament, in addition to the Lords, two knights from each county and two representatives from each borough were summoned. Before, the Commons had been expected simply to assent (say 'yes') to decisions already made by the rulers. Now, they would meet with the full authority (plena potestas) of their communities to give assent to decisions made in Parliament. The king now had full backing for collecting 'lay subsidies' from the entire population. Lay subsidies were taxes collected at a certain fraction of the movable property of all laymen. Historians have called it the \"Model Parliament\".The term was first introduced by William Stubbs; === War in Wales === Llywelyn ap Gruffudd, the main Welsh leader, refused to do homage to Edward and married Eleanor, the daughter of Simon de Montfort. In November 1276, war was declared. Initial operations were launched under the command of Mortimer, Edmund Crouchback (Edward's brother) and the Earl of Warwick. Support for Llywelyn was weak amongst the Welsh. In July 1277, Edward invaded with a force of 15,500, 9,000 of whom were Welshmen. The campaign never came to a major battle, and Llywelyn soon realised that he had no choice but to surrender. By the Treaty of Aberconwy in November 1277, he was left only with the land of Gwynedd, but he was allowed to keep the title of Prince of Wales. When war broke out again in 1282, it was entirely different. For the Welsh, the war was over national freedom and had wide support, especially after attempts to impose English law on Welsh subjects. For Edward, it became a war of conquest. The war started with a rebellion by Dafydd, Llywelyn's younger brother, who was annoyed with the reward that he had received from Edward in 1277. Llywelyn and other Welsh chieftains soon joined in, and initially, the Welsh experienced military success. The Welsh advances ended on 11 December, however, when Llywelyn was lured into a trap and killed at the Battle of Orewin Bridge. The English conquest was complete with the capture in June 1283 of Dafydd, who was taken to Shrewsbury and executed as a traitor next autumn. Further rebellions occurred in 1287 to 1288 and in 1294. In both cases, the rebellions were put down. By the 1284 law, the Statute of Rhuddlan, Wales was incorporated into England and was given an governing system like the English, with counties policed by sheriffs. English law was introduced in criminal cases though the Welsh were allowed to maintain their own laws in some cases of property disputes. After 1277 and increasingly after 1283, Edward embarked on a full-scale project of English settlement of Wales. He created new towns like Flint, Aberystwyth and Rhuddlan. Edward started a large program of building castles to keep the Welsh under control. His castles started the widespread use of arrowslits in castle walls across Europe and drre on Eastern influences. Another product of the Crusades was the introduction of the concentric castle, and four of the eight castles that Edward founded in Wales followed such a design. In 1284, King Edward's son Edward, later Edward II. was born at Caernarfon Castle. In 1301 at Lincoln, the young Edward became the first English prince to be invested with the title of Prince of Wales.This title became the traditional title of the heir apparent to the English throne. Prince Edward was not born heir apparent, but became so when his older brother Alphonso died in 1284; . === Wars in Scotland === Scotland and England were at peace in the 1280s. Alexander III of Scotland and Edward had an understanding by which Alexander held land in England. Thay gave him the excuse to acknowledge Edward as his lord and left ambiguous whether or not thay applied to Scotland as well. The heir to the throne was his infant granddaughter Margaret. Unfortunately, Alexander died in 1286, followed by Margaret in 1290. That left Scotland without a king, which started the problems. ==== Struggle for the crown of Scotland ==== There were fourteen claimants of whom John Balliol and Robert de Brus (the grandfather of the famous Robert the Bruce) had the best cases. The competitors agreed to hand over the realm to Edward until a decision was made. John Balliol was chosen in 1292. Edward continued to push his claim as overlord of Scotland. He interferred in some of the legal affairs of Scotland and insisted for the Scots to provid military service in his army. This caused the Scots to make an alliance with France and to attack Carlisle. Edward responded by invading Scotland in 1296 and taking the town of Berwick in a particularly-bloody attack. At the Battle of Dunbar, Scottish resistance was effectively crushed. Edward confiscated the Stone of Destiny, the Scottish coronation stone, and brought it to Westminster. He also deposed Balliol, placed him into the Tower of London and installed Englishmen to govern the country. The campaign had been very successful, but the English triumph would only be temporary. ==== William Wallace ==== Although the Scottish conflict had seemed settled in 1296, it was started again by William Wallace, who came from one of the notable families. Wallace was a warlord, rather than a politician, and soon started a rebellion. He defeated a large English force at Stirling Bridge in 1297 while Edward was in Flanders. In 1298, Edward defeated Wallace at the Battle of Falkirk. The Scots then avoided open battle in favour of raiding England with small groups. Edward's next move was political. In 1303, a peace agreement was made between England and France, breaking up the Franco-Scottish alliance. Robert de Brus and most of the other nobles pledged allegiance to Edward. Wallace was betrayed, handed to the English and was publicly executed. The situation changed again in 1306, when Brus murdered his rival John Comyn and had himself crowned King of Scotland by Isobel, the sister of the Earl of Buchan. Edward, in ill health, sent armies north under other commanders. Brus was beaten at the Battle of Methven in June 1306. After the battle, Edward followed with brutal suppression of the allies of Brus, which fuelled more rebellions in response. The conflict was still in progress in 1307 when Edward, now an elderly man, led his final campaign into Scotland before he died at the border city of Burgh by Sands at age 70. That led to the succession of the Prince of Wales as Edward II of England. == Issue == Eleanor of Castile died on 28 November 1290. Unlike most other arranged marriages, it was a happy one. Edward was deeply affected by her death. He erected twelve Eleanor crosses, one at each place that her funeral cortège (procession) stopped for the night. As part of the peace accord between England and France in 1294, it was agreed that Edward should marry the French princess Margaret. The marriage took place in 1299. Edward and Eleanor had at least fourteen children, perhaps as many as sixteen. Of them, five daughters survived into adulthood, but only one boy did so: his son and heir Edward, Prince of Wales. Edward was concerned with his son's failure to live up to expectations and at one point exiled the prince's favourite Piers Gaveston. Edward may have known his son was bisexual but did not throw Gaveston from the castle battlements, despite what is shown in Braveheart. ==Notes== == References == * * * * * * * * * * * * * * * * == Other websites == * * Category:1239 births Category:1307 deaths Category:House of Plantagenet Category:13th century in England Category:14th century in England",
 "title": "Edward I of England"
}