{
 "id": "420824",
 "text": "Prayer in Christianity is seen by most Christians as a way of communication with God.Mark R. McMinn, Psychology, Theology, and Spirituality in Christian Counseling (Carol Stream, IL: Tyndale House, 2011), p. 68 Prayer is seen as being therapeutic by many Christian leaders. Christians have long used both formal written prayers and have also used extemporaneous prayers, which is simply talking to God, using a person's own words.https://gracechurchgalveston.org/2018/09/01/what-type-of-prayer/ Charismatic and Pentecostal Christians also pray in tongues. They believe that the Holy Spirit is praying through them. The Lord's Prayer, which Jesus taught his disciples, was important as an example in the early churches.Roy Hammerling, The Lord's Prayer in the Early Church: The Pearl of Great Price (Basingstoke: Palgrave Macmillan, 2010), p. 1 The prayers in the Old Testament and New Testament have also influenced Christian thought.Into God's Presence: Prayer in the New Testament, ed. Richard N. Longenecker (Grand Rapids, MI: W.B. Eerdmans, 2002), p. xi Many of the Psalms in the Bible are said to God and so are prayers. Many Christians also try to listen to God when praying. They believe that God speaks to them through the Bible, but also directly when they are willing to receive His messages. Many hymns are directed to God so are also prayers. The Lord's Prayer is included toghether with other formal prayers, such as the Gloria Patri and the Hail Mary, in the Holy Rosary while thinking about important events in the lives of Jesus and Mary. The Roman Catholic Church has always recognized the efficacy of the Holy Rosary devotion.Pope John Paul II, Rosarium virginis Mariae, 16 October 2002, Libreria Editrice Vaticana The Saint Lucia of Fatima said that Virgin Mary \"in these last times in which we live has given new efficacy in the recitation of the Holy Rosary\" and that \" She has given this efficacy to such an extent that there is no problem, no matter how difficult it is, whether temporal or above all spiritual, in the personal life of each one of us, of our families … that cannot be solved by the Rosary\". https://aleteia.org/2020/01/14/theres-no- problem-no-matter-how-difficult-that-the-rosary-cant-solve/ ==References== ==Other websites== *Prayers at christianity.about.com Category:Christian worship and liturgy Category:Christian terminology",
 "title": "Prayer in Christianity"
}