{
 "id": "421000",
 "text": "William Marshal, 1st Earl of Pembroke ( 1146 — 14 May 1219), sometimes called William, the Marshal or simply the Marshal amd also William Marshal I and nicknamed the Great or the Fearless was an English knight and a nobleman who served four kings of England during his time as a knight: Henry II, Richard I, John, and Henry III. He was the Regent of England during the childhood of King Henry III from the king's ascending to the throne in 1216 until William's death in 1219. During his time, he was one of the most important persons in the monarchy next to the Royal family itself. He was noted for his superior combat skills, his continuing loyalty to his Kings and his great ability in diplomacy. Marshal began his life as a “landless” knight to become the Earl of Pembroke and one of the wealthiest men in the country. Shortly after his death in 1219 at the age of 73, his oldest son, William Marshal, 2nd Earl of Pembroke, commissioned a biography of the life of his father. Though biographers often embellish their subjects, many of the events of William's life stated there are clearly recorded elsewhere in historical records. Five of his sons succeded William as the Earl of Pembroke: William, Richard, Gilbert, Walter, and Anselm. William had a great reputation. He was considered to be one of the greatest and most loyal knights in history. William was very active fighting in battles even in his old age. He successfully defeated the French at the Battle of Lincoln in 1217. William led his army to victory and thus, resulted in winning the First Barons' War for King Henry III and resisting the French invasion. == Childhood == William Marshal’s father, was John Marshal, called John the Marshal. He was the Lord of Newbury Castle located in County Berkshire in England. When William was a young boy, there was a fierce civil war in England between King Stephen, grandson of William I, also called William the Conqueror and Henry I's daughter, Empress Matilda. When William I died, both Stephen and Matilda believed they were the true successor to the Crown. This period in history was known as the time of The Anarchy because there was much lawlessness and violence in the Kingdom. Many barons and Earls would \"change sides\" when it benefited them to do so and John Marshal was no exception. At first he pledged his fealty or loyalty to King Stephen but later changed it to Empress Matilda. This act helped to turn the tide in the civil war. A.J. Holden, editor, translated by S. Gregory and D. Chrouch, History of William Marshal, (London:Anglo-Norman Text Society from Birbeck College, 2004), v. 1, pp. 3, 5, 9 == Early life as a knight == At an early age, William was sent to William de Tancarville to learn the skills of knighthood. He was knighted in 1166. He then crossed the channel to Normandy and went to serve under his uncle, Patrick, the Earl of Salisbury. He fought in Ponthieu in 1168 when greatly outnumbered, his uncle was killed and William was taken prisoner. Marshal's great skill and bravery was noticed and he was ransomed by Queen Eleanor of England. A.J. Holden, editor, translated by S. Gregory and D. Chrouch, History of William Marshal, (London:Anglo-Norman Text Society from Birbeck College, 2004), v. 1, pp. 39, 43, 85, 87, 89, 97 As a young adult, Marshal went to many tournaments. These were contests and mock (imitation) wars where Knights competed for great prizes. Tournaments were an opportunity for a knight to acquire valuable possessions such as money, a horse, armor and weapons. They were dangerous and it was not unusual for a knight to be killed during a tournament.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), pp. 73-75 == William and Henry, the young king == William had become a very skilled knight and after his ramsom he became part of Henry II’s household, teaching men to fight.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), p. 79 He became tutor, guardian, protector and friend to the son of Henry II, known historically as Henry the Young King. When young Henry was crowned, Marshal was assigned to serve him as captain of the guard and chief of the knights. It was Marshal who would knight the young King Henry.Sidney Painter, William Marshal, Knight-Errant, Baron, and Regent of England (Baltimore: Johns Hopkins Press, 1933; reprint Toronto: University of Toronto Press, 1982), p. 32 Marshal also accompanied young Henry on many tournaments. In 1173 young Henry argued with his father. He wanted to assume the throne of England even though his father was still alive. He left England and took his brother Richard with him to his mother's lands in Aquitaine. In 1174, Henry II and his son made peace. William continued on to win fame in tournaments. The young king became ill and died of a sudden disease at Martel on 11 June 1183.Sidney Painter, William Marshal, Knight-Errant, Baron, and Regent of England (Baltimore: Johns Hopkins Press, 1933; reprint Toronto: University of Toronto Press, 1982), pp. 30, 34, 35 == On crusade and fighting under Henry II == On his deathbed young Henry ordered Marshal to go on Crusade on his behalf. With Henry II's permission, William went on Crusade for two years and his superior fighting skill was recognized by the Knights Templar. When he returned, Henry II at once took him into high favor, and made him a member of his household. Marshal then fought for Henry II against the French King Louis VII of France and in skirmishs against Henry's other sons now in rebellion.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), pp. 117-119 Richard (called Lionhearted) was Henry II’s second son and he also wanted to be King of England and did not want to wait until his father died. After a skirmish, Marshal came upon Richard and instead of killing him, he killed his horse. Shortly thereafter, Henry II became ill and retreated to Chinon where he died in 1189.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), pp. 122-123 == William with Richard I == Richard did not forget Marshal’s act of bravery and loyalty and when he became King, he took Marshal to fight against the King of France. After a time, Richard decided to go on Crusade and left Marshal in England as the Justiciar of England who acted for the king in his absence and presided over the king's courts during his absence.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), pp. 139-140 Richard I reaffirmed his father's promise to William and gave him the heiress of the Earldom of Pembroke, Striguil and the lands that came with her as was promised to him by Henry II shortly before Henry's death. Marshal at once became one of the richest men in the Kingdom. He acquired property in four countries.Complete Peerage, Vol X (1945), pp. 358-64 Marshal fought valiantly for Richard against the King of France and was there when the peace treaty was made. In 1199 King Richard was wounded and died of his wounds. At that point there was another dispute about who would next be King of England, Arthur or John.M. Althus Mason, edited by Sidney Lee, Dictionary of National Biography, {London: Macmillan and Co; Smith, Elder & Co. 1893), v. 36, p. 227 Geoffrey II, Duke of Brittany, was another son of Henry II and would have been the next in line to be King but he died on either the 19 or 21 August 1186, at the age of 27. The more common version is that he was trampled to death in a jousting tournament. Geoffrey had a son Arthur I, who became the next Duke of Brittany. Arthur felt that he was also heir to the throne of England. Marshal believed that as a brother to King Richard, and in accordance with Norman custom, John, Geoffrey’s brother, should become the next King. It was resolved in John’s favor and he became the next King of England.Sidney Painter, William Marshal, Knight-Errant, Baron, and Regent of England (Baltimore: Johns Hopkins Press, 1933; reprint Toronto: University of Toronto Press, 1982), p. 119 == William and King John == William fought alongside King John and after a time, John made William the Marshal of England. King John was a man who was disliked by many of his barons and Earls. He knew this and distrusted them. When Marshal went over to protect his lands in Ireland the King made him give one of his sons as hostage to make sure that Marshal was not disloyal to him. King John sometimes took lands away from Marshal and at other times gave them back. There was strife all during the reign of King John but Marshal remained loyal to the King throughout.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), pp. 142-144 King John died on 18 October, 1216. At that time his son, Henry III was too young to rule the kingdom. Marshal was appointed as Regent to Henry III to make decisions on Henry’s behalf until he came of age.M. Althus Mason, edited by Sidney Lee, Dictionary of National Biography, ( London: Macmillan and Co; Smith, Elder & Co. 1893), v. 36, pp. 229-231 == William and Henry III == Marshal was quite old by then but managed the affairs of Henry III as Regent and even fought in combat at the Battle of Lincoln. He was approximately 70 years of age. On 14 May 1219 Marshal died at Caversham.Georges Duby, translated by Richard Howard William Marshal, the Flower of Chivalry, (New York:Pantheon Books 1985), p. 3 == Death of William Marshal == When he knew he was dying he took on the robe of a Knights Templar and after his death he was buried in the Temple Church in London. William Marshal’s effigy can still be seen at the Temple Church, London, with his son next to him. Temple Church photo gallery == References == Category:1100 births Category:1200 deaths Category:English knights Category:Crusaders Category:People from Berkshire",
 "title": "William Marshal, 1st Earl of Pembroke"
}