{
 "id": "421267",
 "text": "The Sobolev space is a function space in mathematics. These functions all have a norm. This norm is a combination of Lp-norms of the function together with its derivatives up to a given order. The derivatives are understood in a suitable weak sense to make the space complete, i.e. a Banach space. Intuitively, a Sobolev space is a space of functions with sufficiently many derivatives for some application domain, such as partial differential equations,. They are equipped with a norm that measures both the size and regularity of a function. Sobolev spaces are named after the Russian mathematician Sergei Sobolev. Their importance comes from the fact that weak solutions of some important partial differential equations exist in appropriate Sobolev spaces, even when there are no strong solutions in spaces of continuous functions with the derivatives understood in the classical sense. The space is very useful to look at for partial differential equation. The spaces may be characterized by smooth functions. It is used by mathematicians. There is a strong relation between Soblev space and Besov space. Sobolev spaces are named for the Russian mathematician Sergei Sobolev in the 1930s. His space has many uses. They are most used for understanding the solutions of ordinal differential equations and partial differential equations. According to the applications above, there were questions on how to characterize the space using classical functions. These questions were answered in 1964, by Meyers and Serrin. == Introduction and definition == Meyers and Serrin's theorem is well known for how to characterize to Sobolev spaces by collection of functions can classical derivative up to given oder same as order of distributional derivative of the Sobolev space. In this section, we shall first recall that definition of Sobolev spaces and set to several preliminaries as follows. : W^{m,p}(\\Omega) = \\left \\\\{ u \\in L^p(\\Omega) : D^{\\alpha}u \\in L^p(\\Omega) \\,\\, \\forall |\\alpha| \\leq m \\right \\\\}. Here, Ω is an open set in ℝn and 1 ≤ p ≤ +∞. The natural number m is called the order of the Sobolev space Wk,p(Ω). Category:Calculus",
 "title": "Sobolev space"
}