{
 "id": "421349",
 "text": "Oscar Armando Yanes González (25 April 1927 - 21 October 2013) was a Venezuelan journalist and bestselling author. Yanes is considered to be a pioneer in Venezuela's broadcast journalism department. He was awarded three times with the National Prize for Journalism. In 1992, he won the Silver Book Prize, awarded by Planeta Publishing, for the largest book circulation of the year. == Biography == Yanes was born on 25 April 1927 in Caracas, Venezuela. As a child, he attended the Zamora School, in San Juan Parish. The idol of the parish was the boxer Armando Best. Pompeyo Márquez and Eloy Torres also studied at that school. Both were boxers who were going to end up as communist leaders. Later, Yanes went to the University and studied as a journalist after he had seen a notice from the newspaper. He entered the first school of journalism that existed in Venezuela, at the Free University \"Augusteo\", which had been founded in October 1941 by Monsignor Rafael Lovera under General Isaiah Medina Angarita. Press freedom was given by Angarita and allowed the circulation of three newspapers that made history: Últimas Noticias, El Nacional and El Morrocoy Blue. Yanes signed up for the founding squad of Últimas Noticias and stayed there for a few years.[1] At age 25, he assumed the direction of the newspaper La Esfera. Ramón David León, who gave him the chance at 13 of getting to know the world of journalism, gave him his office and his position 12 years later, when he decided to sell the newspaper to Miguel Ángel Capriles. Leading the team of Venevisión, a Venezuelan network, Yanes was sent in 1966 to Vietnam as a war correspondent and press officer. For two months, he made six reports that were distributed throughout Latin America: \"The War on the Sea\" (la guerra en el mar), \"The War in the Air\" (la guerra en el aire), \"The War in the Jungle\" (la guerra en la selva), \"The Vietcong, \"The Religion \"(la religion) and \"The Vietnamese Woman\" (la mujer vietnamita). He stood out as professor of the first class of the School of Social Communication of the Central University of Venezuela (Universidad Central de Venezuela) and taught a class in the Andrés Bello Catholic University (Universidad Catolica Andres Bello) of Caracas.[2] He won on three occasions the National Prize for Journalism, the Monseñor Pellín Prize and the First Prize of the Association of Writers of Venezuela in the contest of biographies of famous Venezuelans, for his work \"Carlos J. Bello, the Forgotten Sage.\" He also won the Silver Book Award in 1992, which is awarded by Editorial Planeta for the book with the highest circulation of the year. Considered one of the pioneers in real-time television journalism, with particular interviews confronting many in front of the cameras, he became famous for his television programs. Yanes was famous for his tales about contemporary history in the television program Así son las Cosas (The Way Things Are). In the late 1940s, he received first prize from the Venezuelan Association of Writers for his book Carlos J. Bello, el Sabio Olvidado.(Carlos J. Bello, the Forgotten Wise Man). In 1992, he won the Silver Book Prize awarded by Planeta Publishing, for the largest book circulation of the year.[3] He died on 21 October 2013 in Caracas from pneumonia, aged 86. ==References== ==Other websites== * Category:1927 births Category:2013 deaths Category:Deaths from pneumonia Category:Disease-related deaths in Venezuela Category:People from Caracas Category:Venezuelan writers",
 "title": "Oscar Yanes"
}