{
 "id": "421465",
 "text": "Roger I de Montgomery, was the seigneur (lord) of Montgomery and vicomte of the Hiesmois in Normandy. == Career == Roger was the son of Hugh de Montgomery and his wife Josceline.K.S.B. Keats-Rohan, 'Aspects of Torigny's Genealogy', Nottingham Medieval Studies, Vol. 37 (1993), p. 24 She was the niece of Gunnora, Duchess of Normandy.Kathleen Thompson, 'The Norman Aristocracy before 1066; The Example of the Montgomerys', Historical research; the Bulletin of the Institute of Historical Research, Vol. 60, Issue 123 (October 1987), p. 254 Roger held the lands of Saint-Germain-de-Montgommery and Sainte-Foy-de- Montgommery. Both had traces of early castles.George Edward Cokayne, The Complete Peerage; or, A History of the House of Lords and all its Members from the Earliest Times, Volume XI, ed. Geoffrey H. White (London: The St. Catherine Press, Ltd., 1949), p. 682, n. (b) He became the Viscount of the Heismois about the same time Robert I of Normandy became Duke in 1027.Kathleen Thompson, 'The Norman Aristocracy before 1066; The Example of the Montgomerys', Historical research; the Bulletin of the Institute of Historical Research, Vol. 60, Issue 123 (October 1987), p. 256 But as the viscount he witnessed a royal charter to the abbey of St. Wandrille .David C. Douglas, William the Conqueror (Berkeley, Los Angeles: University of California Press, 1964), p. 94 Like Duke Robert, Roger began taking properties that belonged to the church. These included () half the town of Bernay.Kathleen Thompson, 'The Norman Aristocracy before 1066; The Example of the Montgomerys', Historical research; the Bulletin of the Institute of Historical Research, Vol. 60, Issue 123 (October 1987), p. 255 He took over a woodland at 'Crispus Fagidus' which belonged to Jumièges Abbey. He put an end to a market held by the same abbey and took it into his own domain.Cassandra Potts, Monastic revival and regional identity in early Normandy (Woodbridge, UK: The Boydell Press, 1997), p. 121 Later he seemed to have a change of heart. He returned the market to the abbey and paid restitution for their losses. After 1035 Roger seems to have lost favor with the young duke William. He signed an early charter of Duke William simply as 'Roger of Montgomery'.Kathleen Thompson, 'The Norman Aristocracy before 1066; The Example of the Montgomerys', Historical research; the Bulletin of the Institute of Historical Research, Vol. 60, Issue 123 (October 1987), p. 257 He apparently was no longer the viscount. In 1037 when rebellions broke out, Roger was one of the rebels. When he was defeated he fled to the court of Henry I of France.François Neveux, The Normans; The Conquests that Changed the Face of Europe, trans. Howard Curtis (London: Constable & Robinson Ltd., 2008), p. 112 Roger was forced into exile by Osbern the Steward. Osbern was later killed by William de Montgomery, Roger's son.Kathleen Thompson, 'The Norman Aristocracy before 1066; The Example of the Montgomerys', Historical research; the Bulletin of the Institute of Historical Research, Vol. 60, Issue 123 (October 1987), pp. 257-58 Where and when Roger died is unknown.George Edward Cokayne, The Complete Peerage; or, A History of the House of Lords and all its Members from the Earliest Times, Volume XI, ed. Geoffrey H. White (London: The St. Catherine Press, Ltd., 1949), p. 683 In 1068 his wife was still holding lands at Bures and Saint-Pair. == Family == The name of Roger's wife is unknown but he had five sons:George Edward Cokayne, The Complete Peerage; or, A History of the House of Lords and all its Members from the Earliest Times, Volume XI, ed. Geoffrey H. White ( London: The St. Catherine Press, Ltd., 1949), pp. 683-84 n. (d) * Hugh de Montgomery * Robert de Montgomery * Roger II de Montgomerie, 1st Earl of Shrewsbury. * William de Montgomery killed during the minority of duke William * Gilbert de Montgomery who in 1063 supposedly poisoned by Mabel de Bellême ==Notes== ==References== Category:Year of birth unknown Category:Year of death unknown Category:Normans",
 "title": "Roger I de Montgomery"
}