{
 "id": "421616",
 "text": "Diddy Kong Racing is a racing video game for the Nintendo 64 game console. It was developed and published by Rareware. It is the first spin-off of the Donkey Kong Country series. It was released on November 14, 1997 in North America, and on November 21, 1997 in Japan and Europe. Diddy Kong Racing has gameplay that is similar to Mario Kart 64. It has an adventure mode with several worlds that have several race tracks, a battle stage, and a race against a boss. Players can choose to use a car, a hovercraft, or a plane, although some tracks make the player use one of those. Each track has boosters that make the player go faster, and balloons that give the player an item that they can use during the race. Players can choose from 10 characters. Two of the game's characters, Conker and Banjo, would later star in their own games. Conker went on to star in Conker's Bad Fur Day, while Banjo went on to star in Banjo-Kazooie. A remake for the Nintendo DS called Diddy Kong Racing DS was released on February 5, 2007 in North America and on April 20, 2007 in Europe. It has better graphics and use of the console's touch screen. Banjo and Conker do not appear in it. ==Characters== *Diddy Kong *Krunch *Bumper the Badger *Banjo *Conker *Tiptup the Turtle *Timber the Tiger *Pipsy *Drumstick the Rooster (Unlockable) *T.T. (Unlockable) *Taj the Genie (Playable in DS remake) *Wizpig (Playable in DS remake): Main antagonist *Tricky the Triceratops (Dino Domain Boss) *Bluey the Walrus (Snowflake Mountain Boss) *Bubbler the Octopus (Sherbet Island Boss) *Smokey the Dragon (Dragon Forest Boss) ==Non-Playable Characters== *Taj ==Bosses== *Wizpig *Tricky the Triceratops *Bluey the Walrus *Bubbler the Octopus *Smokey the Dragon ==References== ==Other websites== *Official Diddy Kong Racing site (Archive) Category:1997 video games Category:Rare (company) games Category:Donkey Kong Category:Christmas video games Category:Kart racing video games Category:Nintendo 64 games Category:Nintendo DS games Category:Racing video games Category:Vehicular combat games Category:Video games about dinosaurs",
 "title": "Diddy Kong Racing"
}