{
 "id": "421762",
 "text": "Ms. Pac-Man is an arcade video game made by Midway Manufacturing (now Midway Games). It was released one year after Pac-Man, on May 22, 1980.US Copyright Filing PA0000140275 It became one of the most popular video games of all-time after its release. This led Namco to make the game an official title in the Pac-Man series. It has a female character, new mazes, and changes in gameplay from Pac-Man. It is most successful American-made arcade game, selling 115,000 arcade cabinets. ==Gameplay== Ms. Pac-Man plays similarly to Pac-Man. The player has to move Ms. Pac-Man, a yellow disc, around a maze. The goal is to eat all of the yellow pellets (circles) while not getting caught by the ghosts. The player can get more points by eating fruits that appear. When Ms. Pac-Man eats a white pellet, the ghosts turn blue. The player can eat them for points. The game has 256 stages. Like Pac-Man, the 256th level cannot be finished because of a problem with the creation of the game.Donhodges.Com—Ms. Pac-Man's Kill Screens Analyzed And Fixed The game has gameplay changes from the original Pac-Man. They include: *The game has four different mazes instead of one maze that is played for the whole game. *Three of the four mazes have two sets of warp tunnels instead of one. *Instead of staying in the middle of the maze, the fruit moves around the maze, going in and out of warp tunnels. *The ghosts have different behaviors. *The game has different sound effects and music. ==Notes== ==References== ==Other websites== *Ms. Pac-Man at the Killer List of Videogames *Ms. Pac-Man at the Arcade History database * * Category:1982 video games Category:Arcade games Category:Atari 2600 games Category:Atari 5200 games Category:Commodore 64 games Category:Game Boy games Category:Game Boy Color games Category:Game Gear games Category:IOS games Category:Master System games Category:Midway video games Category:Multiplayer and single-player video games Category:Namco video games Category:Nintendo Entertainment System games Category:Pac-Man Category:Sega Genesis games Category:Super Nintendo Entertainment System games Category:Video game sequels Category:Video games about ghosts Category:Video games developed in the United States Category:Xbox 360 Live Arcade games Category:ZX Spectrum games",
 "title": "Ms. Pac-Man"
}