{
 "id": "421773",
 "text": "The First Presbyterian Church is a historic church in Trenton, New Jersey, United States. It is located at 120 East State Street. The church building was built in 1726.John Hall, History of the Presbyterian Church in Trenton, N. J. (New York: Anson D. F. Randolph, 1859), p. 57 During the American Revolutionary War the British occupied Trenton. They used the church as a stable to keep their horses. It was repaired when they left.John O Raum, History of the city of Trenton, New Jersey (Trenton, NJ: W.T. Nicholson, 1871), p. 108 In 1804 the old stone church was taken down. A new church of all brick was completed in 1805.John O Raum, History of the city of Trenton, New Jersey (Trenton, NJ: W.T. Nicholson, 1871), p. 104 The church building was added to the National Register of Historic Places in 2005.National Register of Historic Places, New Jersey - Mercer County The church graveyard is the burial place of at least two Revolutionary War notables. Colonel Johann Rall, Commander of the Hessians forces defeated by General George Washington.Steven M. Richman, Reconsidering Trenton: The Small City in the Post-Industrial Age (Jefferson, NC: McFarland, 2011), p. 79 He died just after the Battle of Trenton. John Rosbrugh, was killed at the Battle of the Assunpink Creek (Second Battle of Trenton).John C. Clyde, Rosbrugh, A Tale of the Revolution (Easton, 1880), p. 56 He was the first U.S. chaplain killed in battle.Thompson, Parker C. (1978). The United States Army Chaplaincy. Office of the Chief of Chaplains, Department of the Army, Washington D.C., p. 148 The inventor of the steamboat, John Fitch, was a member of the congregation at First Presbyterian. ==References== Category:National Register of Historic Places Category:Trenton, New Jersey Category:Presbyterianism Category:Churches in the United States Category:Buildings and structures in New Jersey Category:1720s establishments in the Thirteen Colonies Category:1726 establishments Category:18th-century establishments in New Jersey",
 "title": "First Presbyterian Church (Trenton, New Jersey)"
}