{
 "id": "42187",
 "text": "| members = | missionaries = 54,539 (2021) | aid = | tertiary = | website = | other_names = }} The Church of Jesus Christ of Latter-day Saints (LDS Church) is the largest group in the Mormon movement. It was started in 1830 in New York by Joseph Smith. Members of this church believe that Joseph Smith was chosen to be a prophet to bring back the church more like how Jesus Christ had set it up when he was alive. They also believe that the Father, Son and Holy Spirit are three separate individuals, but all have the same purpose. LDS scriptures include the Bible, the Book of Mormon, the Doctrine and Covenants, and the Pearl of Great Price. Members of the church are sometimes called Mormons. They properly known as Latter-Day Saints. They are well known for being active in missionary work. == Beliefs and practices == The headquarters of the church is in Salt Lake City, Utah, but there are more than 16 million members living all over the world. About six million members live in the United States. It is also the fourth largest church in the United States. The leader of the Church is called the President of the Church, and members respect him as a prophet. The current President is Russell M. Nelson. Latter-day Saints believe in the Holy Scriptures including the Bible and the Book of Mormon. They also believe that it is important for families to spend a lot of time together, and that after they die, they can live together forever. Latter-day Saints do not drink alcohol, coffee, or tea; smoke tobacco; or use other drugs. They meet once a week on Sunday for church, where they take the sacrament and listen to short talks by members of their own congregation. They also alternate between Sunday school to learn more about their scriptures and Relief Society (women group) and Elders Quorum (men group) where they discuss religious topics. Latter-day Saints also have buildings called temples. These are the most holy buildings in their religion. After a temple has been dedicated, only Latter-day Saints that are living lives in accordance with the teachings of the church can go in the temple. Latter-day Saints believe in helping poor and needy people all around the world. Because of this, Latter-day Saints have given $1.2 billion, since 1985, in cash and assistance to other people. They also believe it is important to learn their family history, often called genealogy. They also help others to learn their family histories, and give access to all their family history records for free, through the internet, on the website Familysearch.org. ==Organization== The leaders of the Church are fifteen men titled apostles. The man who has been an Apostle for the longest time becomes President of the Church and the man who has been an Apostle the second longest is President of the Quorum of the Twelve Apostles. The President of the Church picks two Apostles to be his First and Second Counselors in the First Presidency (the First Presidency being the President and the 2 Counselors while the other 12 Apostles make up the Quorum of the Twelve Apostles). If the President of the Quorum of the Twelve is one of the Counselors, or the second longest serving Apostle is too sick to do the work that comes with being President of the Quorum of the Twelve, the longest serving other Apostle who is not in the First Presidency is named Acting President of the Quorum of the Twelve Apostles. Since Russell M. Nelson became President of the Church, Dallin H. Oaks has been President of the Quorum of the Twelve Apostles and First Counselor in the First Presidency, and until he died in November 2023 M. Russell Ballard was Acting President of the Quorum of the Twelve Apostles. There are several geographical divisions of the Church. The biggest ones are areas. An area might be a whole country, or part of a continent. Another division is a temple district. A temple district contains all the congregations served by one temple. This often means a whole state, region, or large city. Still another division is the mission, which is an area to which missionaries are assigned; almost all of the world is part of a mission, whether or not missionaries live or seek converts there. Another geographical division of the church is the stake. Stakes contain all the Latter-day Saints in a geographic area (for example, the stake in Whittier, California serves all the Latter-day Saints in Whittier, Pico Rivera and La Mirada). A stake often contains several thousand members. Stakes are divided into wards. In areas where the church is less established and there are not enough members to form a stake, a district is formed. Districts serve much the same role as stakes. In turn, districts are divided into branches. If the church membership grows large enough, a district will be changed into a stake and the branches into wards. Each congregation is one ward (or branch). A ward might contain only people who speak a language other than the local language of its area. Examples include areas next to large U.S. military bases in foreign countries, where English-language wards may be organized, and major U.S. cities with many immigrants, where wards using Spanish, dialects of Chinese, or other languages are often formed. In some places, there are special wards for deaf people, where the services are held in the local sign language (such as American Sign Language in English-speaking North America). The church also has \"singles wards\", in which the congregation is made up only of single adults. In turn, there are two types of singles wards—Young Single Adult (YSA), for ages 18 to 30, and Single Adult (SA), for those over 30. ==History== The church was founded by Joseph Smith in 1830 in upstate New York. It was probably due to the Book of Mormon, which Smith said he had translated from gold plates that were buried in a nearby hill. Smith's followers first went to Kirtland, Ohio in 1831. The first temple was built in Kirtland, and by the mid-1830s, there were over 17,000 members of the Church of Jesus Christ of Latter-Day Saints. In 1838, the Latter-day Saints settled in Independence and Far West, Missouri. They were driven out because people in Missouri did not trust Latter-day Saints. The Latter-day Saints then moved to Nauvoo, Illinois. There, Smith started to practice polygamy and tried to start a \"theodemocracy,\" which combined Latter-day Saints rule with American democracy. In 1844, Smith got a Nauvoo newspaper shut down that said he was doing bad things. Then Smith was accused of treason, and while he was waiting in jail, he was killed by a mob. After Smith's death, there was a fight over who should replace Smith. Brigham Young led most of the Latter-day Saints to Utah in 1847. When Utah became a territory in 1850, it was somewhat of a theocracy. Later in the 1850s, there was conflict between the Latter-day Saints and the U.S. government over control of the territory. This was called the Utah War. The Mountain Meadows massacre was part of the Utah War. In the late 19th and early 20th centuries, Latter-day Saints settled the \"Mormon Corridor\" in Utah and surrounding states in the Western United States. Some of the places they settled were Mesa, Arizona; San Bernardino, California; Las Vegas, Nevada; and Cardston, Alberta. By 1890, the Church of Jesus Christ of Latter-Day Saints had built temples in three Utah cities. Brigham Young died in 1877. Around that time, the U.S. government made polygamy against the law. Polygamy had been practiced by Young and some members of the church since the 1840s. Laws by the U.S. government led to many Latter-day Saints leaders going into hiding, and many polygamists being sent to jail. In 1890, the church stopped polygamy. This is thought to be the beginning of the modern era of the Mormon church. In the early 20th century, the Church of Jesus Christ of Latter-Day Saints grew, and opened its first temples outside of Utah. Soon tithing (giving money to the Church) was made a part of being a good member. In 1995, Gordon Hinckley became president. He got the church to build many temples in the United States and elsewhere around the world. The current President is Russell M. Nelson after the death of Thomas S. Monson in January 2018. ==Missions== Young people are encouraged to go on missions when they get old enough. Men may go for two years after they are 18 years old (as long as they have graduated from high school), and women may go for 18 months after they are 19 years old. Before an August 2012 change in church policy, men had to be 19 in most countries, and women throughout the world 21, before they could go on missions. More men go on missions than women do. These missionaries go to a \"Missionary Training Center\" for a few months where they learn how to be good missionaries, and then live in another place for their mission. The Church tells them where they need to go. Then they work with one other missionary who is the same gender as they are (called a \"companion\"), and change companions often so they are not always with the same person. Missionaries will go to people who live near them and teach them about the Church, and baptize people who want to join the Church. They also help people around them, even if these people are not in the Church. Often they help by building houses for people who need them. Older people sometimes go on missions after their children grow up. They get to go with their spouse. There are many different kinds of missions for \"senior missionaries\". Some of them are only a few months, and some of them are a few years. These missions can be \"service missions\", which means that they go to help people who live in the area. Sometimes the senior missionary is a \"mission president\". This means that they lead and help young missionaries in the place where they go to live. ==Criticisms== The LDS church has been heavily criticized since its creation. Some of the criticisms are listed below. ===Current=== * Church members being told to give 10% of the money they earn to the church * Not allowing non-members, or members that do not have church permission to attend temples, to go to weddings at temples. * Continuing to believe that it is best for mothers to remain in the home and raise a family * Allowing baptism on behalf of those who are dead, to let the dead people join the church * Pushing to not allow Same-sex marriage, even in areas that have a very small Latter-day Saint population (Such as California's Proposition 8, which passed partly due to a media campaign funded by the church) * Not saying how much money the church has * Believing that God was once a man * Not allowing the drinking of alcohol, coffee, tea ===Past=== * Polygamy, allowing men to have more than one wife (the church stopped this in 1890, though some other break off churches still allow it) * Not allowing black people to go inside temples, go on missions, or become leaders until 1978 * For Brigham Young, the second prophet of the church, teaching that God was once as Adam, though this was never official church doctrine.. The full text from the Journal of Discourses 1:51 reads as follows: \"It is true that the earth was organized by three distinct characters, namely, Eloheim, Yahovah, and Michael, these three forming a quorum, as in all heavenly bodies, and in organizing element, perfectly represented in the Deity, as Father, Son, and Holy Ghost. Again, they will try to tell how the divinity of Jesus is joined to his humanity, and exhaust all their mental faculties, and wind up with this profound language, as describing the soul of man, \"it is an immaterial substance!\" What a learned idea! Jesus, our elder brother, was begotten in the flesh by the same character that was in the garden of Eden, and who is our Father in Heaven. Now, let all who may hear these doctrines, pause before they make light of them, or treat them with indifference, for they will prove their salvation or damnation. I have given you a few leading items upon this subject, but a great deal more remains to be told. Now, remember from this time forth, and for ever,that Jesus Christ was not begotten by the Holy Ghost.\" ==Notes== ==References== == Other websites == * ChurchofJesusChrist.org - Official Website * ComeUntoChrist.org - Intro to the Church Category:1830 establishments in the United States Category:1830s establishments in New York (state) Category:History of Utah Category:Mormonism Category:Christian organizations based in the United States",
 "title": "The Church of Jesus Christ of Latter-day Saints"
}