{
 "id": "422296",
 "text": "Armillaria gallica (or A. bulbosa or A. lutea) is a species of honey mushroom in the order Agaricales. The species is common and ecologically important. It decays wood. It can live as a saprophyte, or as an opportunistic parasite. In weakened trees it causes root rot. It is found in temperate regions of Asia, North America, and Europe. The species forms the above-ground fruiting bodies \"(mushrooms\") in soil or rotting wood. The fungus has been accidentally introduced to South Africa. Armillaria gallica is a largely underground fungus. The fungus develops underground root-like structures, called rhizomorphs. These help it to decompose dead wood in temperate broadleaf and mixed forests. Its ability to bioluminesce and to form large and long-lived colonies are especially interesting. ==Humongous fungus== Armillaria gallica was found in the Upper Peninsula of Michigan in the early 1990s. In one forest, Armillaria-infected oak trees were harvested, and their stumps left to rot in the field. Later, when red pines were planted in the same location, the seedlings were killed by the fungus. Using sequence analysis, the underground mycelia of one individual fungal colony covered , weighing over , with an estimated age of 1,500 years. The authors noted: \"This is the first report estimating the minimum size, mass, and age of an unambiguously defined fungal individual. Although the number of observations for plants and animals is much greater, members of the fungal kingdom should now be recognized as among the oldest and largest organisms on Earth\".Smith M.L; Bruhn J.M. & Anderson J.B. 1992. The fungus Armillaria bulbosa is among the largest and oldest living organisms. Nature 356 (6368): 428–431. After the Nature paper was published, media outlets from around the world visited the site where the specimens were found. As a result of this publicity, the individual acquired the common name \"humongous fungus\".Volk T.J. 2002. The Humongous Fungus – ten years later. Department of Biology, University of Wisconsin. There was afterward some scholarly debate as to whether the fungus qualified to be considered in the same category as other large organisms such as the blue whale or the giant redwood.Wilson J. 1999. Biological individuality: the identity and persistence of living entities. Cambridge University Press. pp. 23–25. Gould, Stephen Jay, 1992. A humongous fungus among us. Natural History. July, 10-14. Reprinted in Gould S.J. 1996 Dinosaur in a haystack. Penguin. == Gallery == File:Armillaria gallica 27834.jpg Armillaria galica 12.jpg Armillaria galica.jpg Armillaria gallica (14490889010).jpg Hallimasch3.jpg Gruga-0003.jpg == References == Category:Mushrooms",
 "title": "Armillaria gallica"
}