{
 "id": "422431",
 "text": "is a manga series written and illustrated by Hajime Isayama. In 2013, it was adapted into an anime series and was produced by Wit Studio and Production I.G. A film of the same name was also released in 2015. == Plot == The series follows the story of Eren Yeager, a boy who lives in the town of Shiganshina, and his friends Mikasa Ackerman, and Armin Arlert. They live in a civilization surrounded by three circular walls. Over one hundred years ago, humanity was driven to the brink of extinction after the appearance of humanoid giants called Titans, who attack and eat humans on sight. According to what is known, the civilization within the walls is the last surviving remainder of humanity. Their civilization is surrounded by three circular walls called Wall Maria, Wall Rose, and Wall Sina. In the year 845, the outermost wall (Wall Maria) is breached by two new types of Titans, the Colossal Titan and the Armored Titan. This leads other titans to infiltrate the outermost areas of civilization and begin slaughtering its inhabitants. During this incident, Eren's mother is eaten by a Titan, and Eren swears revenge against all Titans. Eren enlists in the military and is also accompanied by his childhood friends Mikasa and Armin. Five years after Shiganshina's fall, the Colossal Titan appears and attacks the city of Trost, located on the second innermost wall (Wall Rose). Eren helps to successfully defend the city after he discovers that he has the mysterious ability to turn himself into a sentient Titan at will. He additionally regains some memories of his father shortly after the fall of Wall Maria, telling him that the truth about their world can be found in their basement in Shiganshina. These events draw the attention of the Survey Corps and their commander, Erwin Smith, who intends to use Eren's power to reclaim Wall Maria and reach the Yeagers' basement to find the truth about the Titans. Eren, Mikasa, and Armin are transferred to the Special Operations Squad, under the care of Levi Ackerman and Hange Zoë. Eren joins his companions to fight and protect what remains of humanity while he also looks for the answers to the mysteries surrounding the Titans, the Walls, as well as his father's mysterious disappearance. == Anime == The anime was directed by Tetsurō Araki. It started broadcasting in Japan on July 8, 2013. It aired on MBS and ran from April 6, 2013 to September 28, 2013. Funimation began releasing the series in North America on home video in 2014. The second season of the anime series aired between April 1, 2017 and June 17, 2017. A trailer for the third season was released on April 27, 2018. The third season started broadcasting in Japan in July 23, 2018. == Reception == The series has been highly praised and has won multiple awards including the Kodansha Manga Award in the shōnen category in 2011 and best director, best script, best soundtrack, runner-up for commercial, best theme song, top female character, and title of the year in the 3rd Newtype Anime Awards. The series was nominated for both the 4th annual Manga Taishō award and the 16th annual Tezuka Osamu Cultural Prize. The 2012 edition of Kono Manga ga Sugoi! named the series the 8th best manga series for male readers. Six of the seven English volumes that were published in North America have charted on The New York Times Manga Best Seller list for the week of October 13, 2013, with volume one having been on the list for 19 weeks. Volume one was #2 on Nielsen BookScan's list of top 20 graphic novels in American bookstores for August 2013, and for the month of September, the series had more volumes on the list than any other series. The series was also named one of the Young Adult Library Services Association's \"Great Graphic Novels for Teens\" == References == == Other websites == * Official website (manga) * Official website (anime) Category:2013 television series debuts Category:2014 anime OVAs Category:2015 anime movies Category:2018 anime television series Category:Anime series based on manga Category:Manga",
 "title": "Attack on Titan"
}