{
 "id": "422467",
 "text": "Puffinus is a genus of seabirds in the order Procellariiformes. It is made up of about 20 small to medium-sized shearwaters. Two other shearwater genera are named: Calonectris, which comprises three large shearwaters, and Procellaria with another four large species. The latter are usually called 'petrels', although they are thought to be more closely related to the shearwaters than to the other petrels. Even though their name looks like puffin, the puffins are auks, and not related to the shearwaters in the genus Puffinus; the genus name Puffinus is actually a New Latin loanword based on the English \"puffin\". == Taxonomy == Genus Puffinus * (Sub)Genus Puffinus (\"Puffinus\" group) – smaller species, closely related to Calonectris ** Christmas Shearwater, Puffinus nativitatis ** Galápagos Shearwater, Puffinus subalaris ** Fluttering Shearwater, Puffinus gavia ** Hutton's Shearwater, Puffinus huttoni ** Scarlett's Shearwater, Puffinus spelaeus (prehistoric) ** Yelkouan Shearwater, Puffinus yelkouan ** Balearic Shearwater, Puffinus mauretanicus ** Menorcan Shearwater, Puffinus sp. (prehistoric) – possibly extirpated population of extant species; tentatively placed in this group ** Dune Shearwater or Hole's Shearwater, Puffinus holeae (prehistoric) ** Lava Shearwater or Olson's Shearwater, Puffinus olsoni (prehistoric) – tentatively placed in this group ** Little Shearwater, Puffinus assimilis ** Bryan's Shearwater, Puffinus bryani ** Heinroth's Shearwater, Puffinus heinrothi ** Audubon's Shearwater, Puffinus lherminieri *** Persian Shearwater, Puffinus (lherminieri) persicus *** Tropical Shearwater or Baillon's Shearwater, Puffinus (lherminieri) bailloni *** Bannerman's Shearwater, Puffinus (lherminieri) bannermani ** Barolo Shearwater, Puffinus baroli ** Boyd's Shearwater, Puffinus boydi ** Manx Shearwater, Puffinus puffinus ** Black-vented Shearwater, Puffinus opisthomelas ** Townsend's Shearwater, Puffinus auricularis ** Newell's Shearwater, Puffinus newelli *** Rapa Shearwater, Puffinus (newelli) myrtae ** Bermuda Shearwater, Puffinus parvus (extinct) – tentatively placed in this group * (Sub)Genus Ardenna (\"Neonectris\" group) – larger species, a distinct lineage ** Pink-footed shearwater, Puffinus creatopus ** Flesh-footed Shearwater, Puffinus carneipes ** Great Shearwater, Puffinus gravis ** Sooty Shearwater or \"muttonbird\" (New Zealand), Puffinus griseus ** Short-tailed Shearwater or \"muttonbird\" (Southern Australia), Puffinus tenuirostris ** Wedge-tailed Shearwater or \"muttonbird\" (Northern and western Australia), Puffinus pacificus ** Buller's Shearwater, Puffinus bulleri Category:Procellariidae",
 "title": "Puffinus"
}