{
 "id": "422648",
 "text": "Pierre Gustave Toutant Beauregard (May 28, 1818 - February 20, 1893) was an American military officer, politician, inventor, writer, civil servant. He was the first prominent general of the Confederate States Army during the American Civil War. Today, he is known as P. G. T. Beauregard, but he rarely used his first name as an adult. ==Early life== Beauregard was born on May 28, 1818 in St. Bernard Parish, Louisiana. He was raised in New Orleans, Louisiana. Beauregard studied at the United States Military Academy. ==Career== After the South seceded, he resigned from the US Army and became the first Confederate brigadier general. He commanded the defenses of Charleston, South Carolina, at the start of the Civil War at Fort Sumter on April 12, 1861. Three months later he won the First Battle of Bull Run near Manassas, Virginia. ==Personal life== Beauregard was married to Marie Antoinette Laure Villeré from 1841 until her death in 1850 after giving birth to their third child. They had three children, René, Henri, and Laure. Then he was married to Caroline Deslonde from 1860 until her death in 1894. They had no children. ==Later life== Following his military career, Beauregard returned to Louisiana, where he served as a railroad executive. He became wealthy because of his role in creating the Louisiana Lottery. ==Death== Beauregard died on February 20, 1893 in his sleep from heart disease in his New Orleans, Louisiana home.Detzer, Allegiance, pp. 272-301; Williams, pp. 57-61; He was 74 years old. He was buried at Metairie Cemetery in New Orleans, Louisiana. ==Further reading== * Conrad, Glenn R. \"Pierre Gustave Toutant Beauregard.\" In A Dictionary of Louisiana Biography, vol. 1, edited by Glenn R. Conrad. New Orleans: Louisiana Historical Association, 1988. . * Robertson, William Glenn. Backdoor to Richmond: The Bermuda Hundred Campaign, April-June 1864. Baton Rouge: Louisiana State University Press, 1987. . * Roman, Alfred. The Military Operations of General Beauregard in the War between the States, 1861 to 1865: Including a Brief Personal Sketch and a Narrative of his Services in the War with Mexico, 1846-8. New York, Da Capo Press, 1994. . First published 1884 by Harper & Brothers. * Winters, John D. The Civil War in Louisiana. Baton Rouge: Louisiana State University Press, 1963. . ==References== ==Other websites== *P. G. T. Beauregard biography and timeline *Several Letters of P. G. T. Beauregard *The Citadel Archives, Beauregard, Pierre Gustave Toutant, 1818-1893 Category:1818 births Category:1893 deaths Category:Confederate Army generals Category:American inventors Category:Businesspeople from New Orleans Category:Politicians from New Orleans Category:Writers from New Orleans Category:Military people from Louisiana",
 "title": "P. G. T. Beauregard"
}