{
 "id": "422764",
 "text": "Peada (died 17 April 656) was briefly the King of Mercia. From he had been King of the Middle Angles. Peada was a pagan who accepted baptism in order to marry the daughter of Oswiu of Northumbria. == King in Mercia == Peada was a son of King Penda.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 177 In he was made king of the Middle Angles by his father.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 252 The Middle Angles were a group of peoples located between Mercia and East Anglia. They later became part of Mercia. Peada asked for the hand of Alflaed, daughter of Oswiu of Northumbria. Oswiu agreed on condition Peada and his kingdom became Christian. In 653 Peada was baptised by Finan, Bishop of Lindisfarne, and married Alflaed.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 230 On 15 November 655 the armies of Oswiu and Penda met in battle near Leeds. Although he had the larger army, Penda was killed.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 196 This established Oswiu as king of all Northumbria and as overlord of all the English south of the River Humber. Oswiu ruled northern Mercia himself, but gave southern Mercia to Peada to rule as king.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 185 Peada was murdered five months later - probably upon the orders of his wife Alflaed.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 253 Mercians rebelled against Oswiu, and Peada's brother Wulfhere became king of Mercia. == Notes == == References == == Other websites == * The Kings of Mercia Category:Year of birth unknown Category:650s deaths Category:Converts to Christianity Category:Kings and Queens of Mercia",
 "title": "Peada of Mercia"
}