{
 "id": "422796",
 "text": "Randall Stuart \"Randy\" Newman (born November 28, 1943) is an American singer, songwriter, arranger, composer, pianist and conductor. Newman is known for his voice and his composition works for the Disney Pictures/Pixar movies. He served as the new voice of the bill following the death of the original voice actor Jack Sheldon ==Early life== Newman was born on November 28, 1943, in Los Angeles, California. He was raised in New Orleans, Louisiana. Newman studied at University High School and at the University of California, Los Angeles. ==Career== Since the 1980s, Newman has worked mostly as a movie composer. His movie scores include Ragtime, Awakenings, The Natural, Leatherheads, James and the Giant Peach, Meet the Parents, Cold Turkey, Seabiscuit and The Princess and the Frog. He has scored seven Disney-Pixar movie: Toy Story, A Bug's Life, Toy Story 2, Monsters, Inc., Cars, Toy Story 3, and most recently, Monsters University. ==Awards== Newman has been nominated for 20 Academy Awards, winning only two. He has also won three Emmys, six Grammy Awards, and the Governor's Award from the Recording Academy. Newman was added to the Songwriters Hall of Fame in 2002. In 2007, he was honored as a Disney Legend.Randy Newman Disney Legend. Legends.disney.go.com. Retrieved on 2012-07-13. Newman was inducted to the Rock and Roll Hall of Fame in April 2013. ==Personal life== Newman was married to Roswitha Schmale, who was born in Germany, from 1967 to 1985, and they had three children. He has been married to Gretchen Preece, with whom he has two children, since 1990. He is of Jewish descent and a atheist. ==Filmography== * Yakety Yak, Take it Back (1991) ... Himself ==References== ==Other websites== * * *Randy Newman: American Dreams, Kevin Courrier (2005) *Interview with Randy Newman on the Art of Songwriting *Randy Newman in NPR's All Songs Considered *Randy Newman at Movieguide *Randy Newman at NNDB Category:1943 births Category:Living people Category:American movie score composers Category:American pianists Category:American singer-songwriters Category:Best Original Song Academy Award-winning songwriters Category:Emmy Award winners Category:American Grammy Award winners Category:Singers from Los Angeles Category:Singers from New Orleans Category:Musicians from Los Angeles Category:Musicians from New Orleans Category:Pianists Category:American Jews Category:Jewish musicians Category:Jewish atheists Category:American atheists",
 "title": "Randy Newman"
}