{
 "id": "422995",
 "text": "The Sune series is a series of children's/youth books by Swedish writers Anders Jacobsson and Sören Olsson. The books have been published since 1984. The stories are originally a radio series, produced as totally 90 episodes for Swedish radio between the years of 1983 and 1993. The Sune books are set in fictional town of Glimmerdagg in Sweden, which just like Berts hometown Öreskoga is located somewhere between Karlskoga-Örebro. There is Söderskolan, for the grades 1–6. The Sune books are told in the third person perspective and using the present tense and uses imperfect during flashback scenes, while Bert is told as a first person narrative. Instead of being a typical \"tough guy\" who uses to fight or play soccer, Sune is more interested into girls. ==Books== *1984 – Sagan om Sune (\"The Tale About Sune\") *1985 – Sune börjar tvåan (\"Sune Starts the Second Grade\") *1986 – Självklart, Sune (\"Of Course, Sune\") *1989 – Sune och Svarta Mannen (\"Sune and the Dark Man\") *1989 – Tjejtjusaren Sune (\"Sune, the Girl Charmer\") *1991 – Duktigt, Sune! (\"Well Done, Sune!\") *1992 – Sunes jul (\"Sune's Christmas\") *1994 – Sunes sommar (\"Sune's Summer\") *1994 – Supersnuten Sune (\"Sune, the Super Cop\") *1995 – Sune älskar Sophie (\"Sune Loves Sophie\") *1996 – Sunes hjärnsläpp (\"Sune's Brain Drop\") *1997 – Sunes hemligheter (\"Sune's Secrets\") *1997 – Gult är fult, Sune (\"Yellow is Ugly, Sune\") *1998 – Plugghästen Sune (\"Sune, the Swot\") *1998 – Sune och familjen Anderssons sjuka jul (\"Sune and the Andersson Family's Sick Christmas\") *1999 – Sune och klantpappan (\"Sune and the Clumsy Father\") *2000 – Sunes största kärlekar (\"Sune's Greatest Loves\") *2001 – Släkten är värst, Sune (\"Meet the Parents, Sune\") *2002 – Sune och Mamma Mysko (\"Sune and the Weird Mother\") *2003 – Sune och Tant Tonåring (\"Sune and the Teenage Lady\") *2004 – Allt är guld, Sune (\"Everything is Golden, Sune\") *2005 – Sune och syster vampyr (\"Sune and Sister Vampire\") *2006 – Spik och panik Sune (\"Nails and Panic, Sune\") *2007 – Fy katten, Sune (\"Red Cats, Sune\") *2008 – Sunes tusen tjusarknep (\"Sune's Thousand Charming Tricks\") *2009 – Sune i Grekland (\"Sune in Greece\") *2010 – Skämtaren Sune (\"Sune the Joker\") *2011 – Sunes skolresa (\"Sune's School Trip\") *2012 – Sune och tjejhatarligan (\"Sune and the Girl-Hating Gang\") *2012 – Sune: the Superstar! (\"Sune and the Girl-Hating Gang\") *2013 – Sune och roboten Rudolf (\"Sune and Rudolf, the Robot\") *2014 – Sune på bilsemester (\"Sune on car vacation\") *2015 – Sune i fjällen (\"Sune in the Scandinavian Mountains\") *2015 – Sune i Ullared (\"Sune in Ullared\") == References == ==Other websites== * Böckerna om Sune * Känner du familjen Andersson? Category:Swedish children's books",
 "title": "Sune (book series)"
}