{
 "id": "422993",
 "text": "The Bert Diaries are a series of novels written in the form of a diary. They are by Swedish writers Anders Jacobsson and Sören Olsson. The main character is a teenager named Bert Ljung. Ljung lives in Öreskoga, a fictional town in Sweden, in the late 1980s and early 1990s. The first book was published in 1987. Bert and his friends also have a pop/rock band, the Heman Hunters. A TV series was made in 1994. It is directed by Tomas Alfredson and Svante Kettner. It was followed by a movie in 1995, also directed by Alfredson. In late-July 2016 the recording of a new Bert film was announced. Between 1993 and 2002, and comic book, FF med Bert, was publishedSeriesamlarna Between 1992 and 1999, comic albums were published.Seriesamlarna ==List of books== ===Old version=== *Berts dagbok (Bert's Diary) - 1987, new edition in 1993 *Bert och brorsorna (Bert and the Brothers) - 1995 *Bert och Boysen (Bert and the Boys) - 1996 *Bert och bacillerna (Bert and the Coodies) - 1997 *Berts första betraktelser (Bert's First Reflections) - 1990 *Berts vidare betraktelser (Bert's Further Reflections) - 1991 *Berts ytterligare betraktelser (Bert's Additional Reflections) - 1991 *Berts bravader (Bert's Exploits) - 1991 *Berts bekännelser (Bert's Confessions) - 1992 *Bert och badbrudarna (Bert and the Bath Chicks) - 1993 *Berts bekymmer (Bert's Worries) - 1994 *Berts bryderier (Bert's Embarrassments) - 1995 *Berts befrielse (Bert's Liberation) - 1996 *Bert och beundrarinnorna (Bert and the Admirers) - 1997 *Bert Babyface (Bert Babyface) - 1998 *Berts bokslut (Bert's Closure) - 1999 ===New version=== *Bert och kalla kriget (Bert and the Cold War) - 2005 *Bert och Heman Hunters (Bert and the Heman Hunters) - 2006 *Bert + Samira = Sant? (Bert + Samira = True?) - 2007 *Bert Badbojen (Bert the bath boy) - 2008 *Bert och ryska invasionen (Bert and the Russian Invasion) - 2009 *Bert och datadejten (Bert and the Computer Date) - 2010 *Bert och friheten (Bert and Freedom) - 2011 *Bert får scenskräck (Bert gets stage fright) - 2012 *Bert och frestelsen (Bert and the temptation) - 2012 *Berts fejsbok (Bert's Facebook) - 2013 *Bert och skrynkliga tanten (Bert and the wrinkled lady) - 2014 ==References== ==Other websites== * De populära Bertböckerna! * Böckerna om Håkan Bråkan Category:Swedish children's books",
 "title": "Bert Diaries"
}