{
 "id": "42307",
 "text": "Noodles are thin strips of pasta which are made from dough. The dough for the noodles can be made in different ways: * Egg noodles are made of eggs and wheat flour. Asian egg noodles, Italian type pastas or Reshteh are made this way. * Wheat noodles- Mee pok, Lamian, Ramen, Udon, Champon, and Yakisoba-type noodles * Rice noodles - Asian bihun, Vietnamese Pho * Glass noodles are made of Mung bean or potato starch * Buckweat noodles - Japanese Soba * Laghman - Noodles from Kazakhstan Noodles are usually cooked in boiling water. Sometimes, after boiling, noodles are fried in a pan with other ingredients while being moved around in order to be mixed well, which is called stir frying. ==Kinds of noodles (especially in Japan)== *Ramen *Udon chicken chow mein *Spaghetti *Linguine *Soba *Somen *Tsukemen *Cup noodle ==References== == Noodles gallery == File:Misua noodle making Taiwan.jpg|Taiwanese Misua File:Chicken Chow Mien Chicken Chowmien Noodles.jpg|Chicken Chow Mien File:Lobster with soup yi fu noodles.jpg|Lobster Yimein File:(Pasta) by David Adam Kess (pic.2).jpg|Pastas File:The local style meat sauce pasta.jpg|Spaghetti File:A Two box of Pasta on the On Hing Noodle Shop in Tuen Mun.jpg|A Pasta File:Two of Italian Pasta at Pasta noodle station in Conrad Hong Kong.jpg|Spaghetti File:A Box Shahe Fen on the Noodle Shop at San Hui Market.jpg|Shehe Fen File:A Six boxes Chinese Noodles on the Noodles Shop in Cheung Chau.jpg|Cart Noodles File:Mushroom with chinese noodles in home.jpg|Shrimp Noodle File:Chinese mix noodles in hk.jpg|La Mein File:A Some bag of Chinese White Noodles in Tsuen Wan.jpg|Chinese White Noodle File:Fried noodles at Chinese Food Shop in Yuen Long Market.jpg|Che Chai Noodle and Chow Mein File:White noodle rolls and sha ho fan in Ng Pik Kee Noodle Shop.jpg|Rice Noodle Rolls and Sha He Fens and File:Chow mein noodle and white rice noodle rolls on vegetarian restaurant.jpg|Chow Mein File:茂名的香油捞粉皮.jpg|Fen Pi File:Three things on the red boxes from Man Fung Noodle Shop in Tsuen Wan.jpg|Some Chinese Noodles File:Fong Chi Red Potato Noodles at Siu Fong Shopping Mall in Tuen Mun.jpg|link=|Chinese Sweet Potato Noodles",
 "title": "Noodle"
}