{
 "id": "423093",
 "text": "Columbia Business School (CBS) is a business school of Columbia University in Manhattan, New York City.Roger L. Kemp, Town and Gown Relations: A Handbook of Best Practices (Jefferson, NC: Mcfarland, 2013), p. 126 It was established in 1916.AACSB International, Organisational Capability and Competitive Advantage (Bradford: Emerald Group Publishing, 2011), p. 175 n. 12 Its purpose is to provide training and professional preparation for undergraduate and graduate Columbia University students. It is one of six Ivy League business schools. Its admission process is among the most selective of top schools. ==MS Programs== Columbia Business School offers three separate Master of Science degrees in Management Science & Engineering, Financial Economics and Marketing. Admission to the programs is extremely competitive: in 2011, there were 543 applicants to the Financial Economics program and only 10 students were accepted. ==CIBE== The Certificate in Business Excellence (CIBE) is awarded to students who complete a total of 18 program days of executive education within a four-year period. Any executive education program at Columbia Business School can be applied toward the completion of the certificate. Recipients of the CIBE are granted full alumni status with Columbia Business School,Bricker's International Directory 2006 including the following alumni benefits: * Invitations to Columbia Business School alumni events and programs around the world * Lifetime Columbia Business School e-mail address * Subscriptions to all Columbia Business School alumni publications * Eligibility to join a Columbia Business School alumni club ==People== ===Alumni=== Columbia Business School has over 39,000 living alumni. Some of the more notable alumni include the following: * Erskine Bowles, MBA 1969, Former White House Chief of Staff; President of the University of North Carolina system * Warren Buffett, MS 1951, Billionaire CEO of Berkshire Hathaway * Penny Chenery, MBA, American sportswoman who bred and raced Secretariat, 1973 winner of the Triple Crown * Alexander Haig, MBA 1955, United States Secretary of State * Irving Kahn, MBA, oldest living active investment professional * Frank Lautenberg, BS 1949, U.S. Senator from New Jersey * Mauricio Macri, attended, incumbent Chief of Government of the Autonomous City of Buenos Aires * Christopher O'Neill, MBA 2005, British- American businessman and husband of Princess Madeleine of Sweden * Washington SyCip, MBA 1943, founder of the Asian Institute of Management and Sycip Gorres Velayo & Co. * Eudora Welty, MBA 1930–31, American author, winner of the Pulitzer Prize in 1973; recipient of the Presidential Medal of Freedom ==Sources== Category:Columbia University Category:1916 establishments in the United States Category:1910s establishments in New York (state)",
 "title": "Columbia Business School"
}