{
 "id": "423102",
 "text": "Herman Kahn (February 15, 1922 – July 7, 1983) was one of the most famous futurists of the second half of the twentieth century. His theories helped to develop the nuclear strategy of the United States.Nuclear strategy: how nuclear weapons fit into the nation's military and diplomatic policy. See Schelling T.C. 1960. The strategy of conflict. Harvard University Press, and Schelling T.C. 1966. Arms and influence. Yale University Press. == Career == Kahn, a man of \"captivating personality and large intellectual gifts\",Smith, James A. 1991. The idea brokers: think tanks and the rise of the new policy eilte. New York: Macmillan & Free Press. worked for the RAND Corporation, Santa Monica, California, as a military strategist (19481958). He was a founder of the Hudson Institute think tank. This gives ideas and consultations for the U.S. government and military chiefs, and for business clients. He was known for analyzing the likely consequences of nuclear war and recommending ways to improve survivability. His key idea was that the threat of nuclear war could be controlled by the use of carefully graded deterrence. In order to get his ideas across he ran two-day seminars which included role-playing in various scenarios. His ideas, when published in On Thermonuclear War, caused a sensation. :\"At the minimum, an adequate deterrent for the United States must ... persuade [the Soviets] that, no matter how skillful or ingenious they were, an attack on the United States would lead to a very high risk if not certainty of large-scale destruction to Soviet civil society and military forces\". However, responses must be proportionate, because if one threatened all-out war as a response for some rather modest misbehaviour, then the threat was simply not believable, and would not work. The need to think things through in detail was the topic of his second book, Thinking about the Unthinkable. Kahn was less successful later in his career when he turned his attention to general economics and politics. His ideas on Japan seemed good at the time,Kahn, Herman 1970. The emerging Japanese superstate: challenge and response. Prentice Hall. Kahn, Herman 1971. The Japanese challenge: The success and failure of economic success. Morrow; Andre Deutsch. but now seem to be not quite right. He predicted that Japan would become the world's third superstate and a military superpower. This he based on Japan's record after 1946, which was spectacular, with quality production and undercutting markets in the older economies. As it turned out, Japan's economy stalled in the 1980s, and has never recovered its previous growth rate. The role he predicted for Japan is now filled by China, a country with a huge reserve of poorly-paid workers and significant military forces. However, Japan has the second largest economy in the region, and now has good relations with the U.S.A.Hook, Glenn D. & others. 2011. Japan's international relations: politics, economics and security. Routledge. (comprehensive textbook) == Publications == Works written by Kahn include: *1960. On thermonuclear war. Princeton University Press. *1962. Thinking about the unthinkable. Horizon Press. *1965. On escalation: metaphors and scenarios. Praeger. *1967. The Year 2000: a framework for speculation on the next thirty-three years. MacMillan. . With Anthony Wiener. *1968 Can we win in Viet Nam?. Praeger. Kahn with four other authors: Gastil, Raymond D.; Pfaff, William; Stillman, Edmund; Armbruster, Frank E. *1970. The Emerging Japanese Superstate: challenge and response. Prentice Hall. *1971. The Japanese challenge: The success and failure of economic success. Morrow; Andre Deutsch. *1972. Things to come: thinking about the seventies and eighties. Macmillan. . With B. Bruce-Briggs. *1973. Herman Kahnsciousness: the megaton ideas of the one-man think tank. New American Library. Selected and edited by Jerome Agel. *1974. The future of the corporation. Mason & Lipscomb. *1976. The next 200 Years: a scenario for America and the world. Morrow. *1979. World economic development: 1979 and beyond. William Morrow; Croom Helm. . With Hollender, Jeffrey, and Hollender, John A. *1981. Will she be right? The future of Australia. University of Queensland Press. . With Thomas Pepper. *1983. The Coming Boom: economic, political, and social. Simon & Schuster; Hutchinson. *1984. Thinking about the unthinkable in the 1980s. New York: Simon and Schuster. == References == Category:1922 births Category:1983 deaths Category:American atheists Category:American Jews Category:American mathematicians Category:People from Bayonne, New Jersey",
 "title": "Herman Kahn"
}