{
 "id": "423272",
 "text": "Softwood is wood that comes from conifer trees.Brian Bond; University of Tennessee Agricultural Extension Service, Wood identification for hardwood and softwood species native to Tennessee (Knoxville: Agricultural Extension Service, University of Tennessee, n.d.), p. 4 Softwood makes up about 80% of the world's production of lumber.James L. Howard, U.S. timber production, trade, consumption, and price statistics 1965-2002, Research Paper FPL-RP-615 (U.S. Department of Agriculture; Forest Service), p. 5 Traditional production areas include North America, Scandinavia, Baltic countries and China. The opposite of softwood is hardwood, which is wood that comes from dicotyledonous trees. Softwoods are not always softer than hardwoods. Both groups include a variety of wood types that vary in actual hardness. For example balsa is a hardwood but is softer than most softwoods. Douglas fir, a softwood, is much harder than many hardwoods. Both groups of woods also vary in durability, that is, in the resistance to rotting. Some softwoods may rot more easily than some hardwoods, others less easily. The most-used softwoods are less durable. There is often confusion on softwoods, as names like \"pine\" and \"cedar\" are used for different woods, that are not botanically related and are not really similar in properties. If softwoods have discernable heartwood, the colors are limited to shades of brown, from very light brown to reddish brown. == Pictures of some softwoods == Taxodium distichum02.jpg|Baldcypress Bleistiftzeder Holz.JPG|Eastern redcedar Wood Abies alba.jpg|Fir Wood of Tsuga heterophylla.jpg|Hemlock Wood Larix decidua.jpg|Larch Wood Pseudotsuga taxifolia.jpg|Oregon pine ParanaPW.jpg|Parana pine Pine in straight grain.jpg|Pine Wood sequoia sempervirens.jpg|Redwood Wood picea abies.jpg|Spruce W Redced.jpg|Western redcedar Eiben c.jpg|Yew wood == References == *Jane F.W. 1970. The structure of wood. 2nd ed, edited by K. Wilson & D.J.B. White. London: Adam & Charles Black. ISBN 9780713609127 Category:Wood",
 "title": "Softwood"
}