{
 "id": "423363",
 "text": "On June 12, 1987, at the Brandenburg Gate, United States president Ronald Reagan gave a speech that is now known by a key line from the middle part: \"Mr. Gorbachev, tear down this wall!\" Reagan wanted Soviet leader Mikhail Gorbachev to open the Berlin Wall, which had blocked West Berlin since 1961. Not many people in the Reagan administration liked the idea of Reagan saying the famous line. Some thought it would make the relationship between the United States and Soviet Union worse. However, Reagan liked the line and kept it in his final speech. Over 50,000 people had protested against Reagan before he arrived in Berlin. During the visit, many parts of Berlin were closed off to stop anti-Reagan protests. The next day, The New York Times had Reagan’s picture on the front page with the title \"Reagan Calls on Gorbachev to Tear Down the Berlin Wall\". Its impact on the Kremlin became known after the fall of the Berlin Wall in 1989. In the years after the Cold War, it was seen as one of the most well known speeches of an American president in Berlin after John F. Kennedy's 1963 speech \"Ich bin ein Berliner\". Reagan's speech was written by Peter Robinson. == Background == The \"tear down this wall\" speech was not the first time Reagan had talked about the issue of the Berlin Wall. In a visit to West Berlin in June 1982, he said, \"I'd like to ask the Soviet leaders one question [...] Why is the wall there?\". In 1986, 25 years after the wall was built, the West German newspaper Bild-Zeitung asked Reagan when he thought the wall could be removed. Reagan then said \"I call upon those responsible to dismantle it [today]\". On the day before Reagan's 1987 visit, 50,000 people had protested against Reagan. The city had many police officers, the most they have seen since World War II. During the visit, many parts of Berlin were closed off to stop anti-Reagan protests. (in German) Reagan talked about the protests and said at the end of his speech: \"I wonder if they ever asked themselves that if they should have the kind of government they apparently seek, no one would ever be able to do what they are doing again\". The speech was not popular within the Reagan administration. Some people working with Reagan did not want him saying \"Tear down this wall!\", saying it might risk the positive relationship Reagan had with Gorbachev. Speechwriter Peter Robinson traveled to West Germany to look for possible places where Reagan could speak, and found that many West Berliners did not like the wall. Even though he had little support for adding the line in Reagan's speech, Robinson kept it in the speech text. On Monday, May 18, 1987, Reagan met with his speechwriters and said, \"Well, there's that passage about tearing down the wall. That wall has to come down. That's what I'd like to say to them\". White House Chief of Staff Howard Baker and Deputy U.S. National Security Advisor Colin Powell were against it. However, Reagan liked the line, saying, \"I think we'll leave it in.\" Robinson, said that the line \"tear down this wall\" was inspired after talking with Ingeborg Elz of West Berlin. In a conversation with Robinson, Elz said, \"If this man Gorbachev is serious with his talk of Glasnost and perestroika he can prove it by getting rid of this wall.\" Speechwriter Anthony Dolan said in November 2009, that during an Oval Office meeting Reagan came up with the line and not Robinson. This caused Robinson and Dolan to write each other letters defending their own thoughts about who came up with the line. == Speech == Reagan arrived in Berlin on Friday, June 12, 1987. Reagan and his wife, Nancy, were taken to the Reichstag where they saw the wall from a balcony. Reagan then gave his speech at the Brandenburg Gate at 2:00 p.m., in front of bulletproof glass. West German president Richard von Weizsäcker, chancellor Helmut Kohl, and West Berlin mayor Eberhard Diepgen were there at the event. In the speech, he said: ==Response== The speech got little coverage from the media at the time. Time magazine wrote about the speech 20 years later. John Kornblum, senior U.S. diplomat in Berlin at the time of Reagan's speech, and U.S. Ambassador to Germany from 1997 to 2001, said \"[The speech] wasn't really elevated to its current status until 1989, after the wall came down.\" East Germany's communist rulers did not think the speech would have an impact, calling it \"an absurd demonstration by a cold warrior\". The Soviet press agency TASS said Reagan's speech was supportive of a war. Former West German Chancellor Helmut Kohl said he would never forget standing near Reagan when he told Gorbachev to tear down the Berlin Wall. \"He was a stroke of luck for the world, especially for Europe.\" In an interview, Reagan said that the East German police did let people to come close to the wall, which kept citizens from seeing him speak. Some critics thought that the speech did not cause the Berlin Wall to fall and that Reagan did not deserve credit. In a September 2012 article in The Atlantic, Liam Hoare asked readers to \"stop crediting Ronald Reagan for the fall of the Berlin Wall\". Author James Mann did not support this, writing that the speech was important in making the Soviets weak. Mann said that Reagan was \"helping to set the terms for the end of the cold war\". In November 2019, a bronze statue of Reagan was made, near the site of the speech. ==Gallery== File:President Ronald Reagan making his Berlin Wall speech.jpg|Reagan making the speech File:President Ronald Reagan and Nancy Reagan departure after remarks at Berlin Wall.jpg|Ronald and Nancy Reagan leaving the Brandenburg Gate after the speech File:President Ronald Reagan and Nancy Reagan during his trip to West Berlin.jpg|West Berlin mayor Eberhard Diepgen watching the speech File:President Ronald Reagan and German Chancellor Helmut Kohl at the Berlin Wall.jpg|Reagan being shown the Berlin Wall with German Chancellor Helmut Kohl File:Berlin-Memorial to the Victims of the Wall-1982.jpg|A section of the wall mentioned in the speech File:Berlin Wall at the Reagan Library.jpg|A piece of the Berlin Wall at the Ronald Reagan Presidential Library ==More readings== * * * ==References== ==Other websites== * Full text and audio MP3 of the speech * Full video of President Reagan delivering the speech at the Brandenburg Gate, courtesy of the Reagan Foundation. *Ronald Reagan Signed and Inscribed Photograph at the Berlin Wall Shapell Manuscript Foundation * Reagan speechwriter Peter Robinson reflecting on the speech before the Commonwealth Club of California in 2004. Category:1987 in Europe Category:Speeches by Ronald Reagan Category:Mikhail Gorbachev Category:Berlin Wall Category:1980s in the Soviet Union Category:1987 in the United States Category:1980s in Germany",
 "title": "Tear down this wall!"
}