{
 "id": "423366",
 "text": "Bill de Blasio (born Warren Wilhelm, Jr.; May 8, 1961) is an American politician. He was the Mayor of New York City from 2014 until 2022. He formerly served as the New York City Public Advocate from 2010 to 2013. Before that, he was a New York City Council member. == Career == He was the Democratic Party nominee in the 2013 election to become Mayor of New York City. On November 5, 2013, De Blasio won the mayoral election by a landslide, receiving over 73% of the vote. He is the first Democratic mayor of the city in nearly 20 years. De Blasio was re-elected as Mayor in the 2017 mayoral election with 66.5% of the vote. On January 1, 2018, Bernie Sanders sworn-in De Blasio in his second mayoral inauguration as Mayor. On May 16, 2019, De Blasio announced his candidacy for President for the 2020 election. He released a YouTube video in which he stated \"I’m Bill de Blasio and I’m running for president because it’s time we put working people first\". He withdrew from the race on September 20, 2019. In February 2020, he endorsed Bernie Sanders for president. In May 2022, De Blasio announced he would run for the United States House of Representatives for New York's 10th congressional district. In July 2022, he dropped out of the race and retired from politics to focus on working with non-profit organizations. == Personal life == De Blasio was born on May 8, 1961 in New York City. His mother's parents were Italian immigrants; his father is of German ancestry. De Blasio studied at Columbia University and at New York University. He has been married to Chirlane McCray since 1994. They have two children. ==References== ==Other websites== * *Office of the Public Advocate *Bill de Blasio: official website *When Bill de Blasio's Wife Was a Lesbian, Out (magazine), September 3, 2013 Category:1961 births Category:Living people Category:2020 United States presidential candidates Category:Mayors of New York City Category:Democratic Party (United States) politicians",
 "title": "Bill de Blasio"
}