{
 "id": "423485",
 "text": "Judgment Day (2000) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on May 20, 2000 at the Freedom Hall in Louisville, Kentucky. It was the second Judgment Day event held by the WWF and the first to take place yearly. The show featured the return of The Undertaker, who for the first time appeared in his \"American Bad Ass\" gimmick. ==Matches== No. Results Stipulations Times 1 The British Bulldog defeated Joey Abs Singles match 4:28 2 Essa Rios and Lita defeated Kaientai (Taka Michinoku and Funaki) Mixed tag team match 5:02 3 The Godfather defeated D'Lo Brown Singles match 3:40 4 Too Cool (Scotty 2 Hotty, Grand Master Sexay and Rikishi) defeated Team ECK (Kurt Angle, Edge and Christian) Six-man tag team match 9:47 5 Eddie Guerrero (c) (with Chyna) defeated Perry Saturn and Dean Malenko Triple threat match for the WWF European Championship 7:56 6 Shane McMahon defeated Big Show Falls Count Anywhere match 7:11 7 Chris Benoit (c) defeated Chris Jericho Submission match for the WWF Intercontinental Championship 13:22 8 D-Generation X (Road Dogg, X-Pac and Tori) defeated The Dudley Boyz (Bubba Ray and D-Von Dudley) Double Tables match 10:55 9 Triple H (with Stephanie McMahon-Helmsley) defeated The Rock (c) 6-5 Iron Man match for the WWF Championship with Shawn Michaels as the special guest referee 1:00:00 === Iron man match === Score Point Winner Decision Notes Time 0–1 The Rock Pinfall Pinfall after a Rock Bottom 10:42 1–1 Triple H Pinfall after a Pedigree 25:26 2–1 Pinfall with an inside cradle 26:26 3–1 Pinfall after a Piledriver 32:22 3–2 The Rock Pinfall after a DDT 40:33 3–3 Disqualification Triple H was disqualified for attacking The Rock with a steel chair 43:30 4–3 Triple H Pinfall Pinfall using the ropes for leverage 44:06 5–3 Technical submission The Rock passed out in a Sleeper hold by Triple H 47:25 5–4 The Rock Count out Triple H was counted out after a Pedigree on a broadcast table by The Rock 56:05 5–5 Pinfall Pinfall after a People's Elbow 57:59 6–5 Triple H Disqualification The Rock was disqualified after The Undertaker attacked Triple H with a Chokeslam and a Tombstone Piledriver with 1 second on the clock 1:00:00 ==References== ==Other websites== *Official Judgment Day 2000 website Category:2000 in professional wrestling Category:Louisville, Kentucky Category:WWE Judgment Day Category:2000 in the United States Category:History of Kentucky",
 "title": "Judgment Day (2000)"
}