{
 "id": "423492",
 "text": "The Kingdom of Mercia was an important monarchy in the English Midlands from the 6th century to the 10th. From the mid-7th century until it ceased to exist as a kingdom, Mercia was the most powerful of the Anglo-Saxon kingdoms. Some of its rulers were the first to claim titles such as King of the English and King of Britain. Mercia was one of the seven kingdoms of the Heptarchy. This is a later name given to the seven Anglo-Saxon kingdoms of England during the early Middle Ages.Michael Frassetto, The Early Medieval World (Santa Barbara, CA: ABC-CLIO, 2013), p. 308 Besides Mercia it included Northumbria, Wessex, East Anglia, Essex, Kent, and Sussex.Michael Frassetto, Encyclopedia of Barbarian Europe: Society in Transformation (Santa Barbara, CA: ABC-CLIO, 2003). pp. 201–02 The first dynasty of Mercian kings are called the Iclingas. The name comes from Icel who ruled the Mercians .John Nowell Linton Myres, The English Settlements (Oxford; New York: Oxford University Press, 1989), p. 185 Members of this dynasty claimed to be descendants the royal family of their homeland in Western Europe. Mercia became a dominant force under Penda from about until his death in 655.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 178 Bretwalda, his son, was the first Mercian overlord of the southern English.Frank Stenton, Anglo-Saxon England (Oxford: Oxford University Press, 1971), p. 34 Offa (757–796), was the first of the Anglo-Saxon kings who might rightly be called \"king of the English\".Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 257 Mercia was never again as powerful as it was during Offa's reign.John Cannon; Ralph Griffiths, The Oxford Illustrated History of the British Monarchy (Oxford; New York: Oxford University Press, 1998), p. 26 For their successors in England see List of English monarchs. == Monarchs of Mercia == === Iclingas === * Icel (late 5th century–early 6th century) - Son of Eomer, King of the Angles. * Cnebba - Son of Icel * Cynewald - Son of Cnebba * Creoda (–) - Son of Cynewald. * Pybba (–) - Son of Creoda. * Cearl (–) - Listed by Bede * Penda (–655) - Son of Pybba. * Eowa (–642) - Co-ruled with Penda, son of Pybba. * Peada (655–655) - Son of Penda. * Oswiu of Northumbria (ruled Mercia 655–658) - King of Northumbria, took control of Mercia. * Wulfhere (658–675) - Son of Penda. * Aethelred - Son of Penda. * Coenred (704–709) - Son of Wulfhere. * Ceolred (709–716) - Son of Aethelred. * Ceolwald of Mercia (716) - Probable son of Aethelred, may have ruled briefly. * Aethelbald (716–757) - Grandson of Eowa. * Beornred of Mercia (757) - No known connection to Iclingas dynasty. * Offa (757–796) - Great-great-grandson of Eowa. * Ecgfrith (796) - Son of Offa. * Coenwulf (796–821) - A descendant of Pybba. * Ceolwulf I of Mercia (821–823) - Brother of Coenwulf. === Other dynasties === When the Iclingas line died out in the male line, members of other noble Mercian families competed for the throne.Nicholas Higham; M. J. Ryan, The Anglo-Saxon World (New Haven: Yale University Press, 2013), p. 240 The 'B' dynasty is for kings Beornwulf, Berhtwulf and Burgred. The 'W' dynasty is for king Wiglaf. Others have no dynasty they are connected with. * Beornwulf (823–826) - \"B\" dynasty. * Ludeca (826–827) - Unknown or no dynasty connections. * Wiglaf of Mercia (1st reign) (827–829) - \"W\" dynasty. * Egbert of Wessex (829–830) - King of Wessex who took control of Mercia. * Wiglaf of Mercia (restored to the throne) (830–839) - \"W\" dynasty. * Wigmund (–) - \"W\" dynasty, son of Wiglaf. * Wigstan (840) - \"W\" dynasty, son of Wigmund. * Aelfflaed of Mercia (840) - Daughter of Ceolwulf I, wife of Wigmund. Regent for her son Wigstan. * Beorhtwulf (840–852) - \"B\" dynasty. * Burgred (852–874) - \"B\" dynasty. * Ceolwulf (874–) - Unknown dynasty. === Client rulers under Wessex === After being defeated by Alfred the Great, the king of Wessex, the rulers were no longer considered kings and queens but rather ealdormen. The title of the female rulers was \"Lady of the Mercians.\" They were styled Kings and Queens in Mercia only. * Aethelred, Lord of the Mercians (–911) - Unknown dynasty. * Ethelflaeda, Lady of the Mercians (911–918) - Daughter of King Alfred of Wessex, wife of Aethelred. * Aelfwynn, Lady of the Mercians (918) - Daughter of Ethelflaeda and Aethelred. Removed from her position by her uncle Edward the Elder, King of Wessex. === Rulers in name only === After Mercia became an annex of Wessex (Mercia was no longer a kingdom), 'King of Mercia' became a title only. * Athelstan (924) - Son of King Edward the Elder he became the first King of England. * Edgar of England (957–959) - Nephew of Edward the Elder he succeeded as King of England. == Image gallery == File:Creda - John Speed.JPG| File:Mercia family tree.jpg| File:Penda of Mercia.jpg| File:Chad Peada Wulfhere at Lichfield.jpeg| File:Burgred king of Mercia 852 874.jpg| File:Matthew Paris Offa horseback.jpg| File:Kingdom of Mercia.png| == Notes == == References == Category:Lists of British monarchs *",
 "title": "List of monarchs of Mercia"
}