{
 "id": "423631",
 "text": "is a Japanese retired professional wrestler better known under the ring names, Jushin Liger and Jushin \"Thunder\" Liger. He mainly worked for New Japan Pro Wrestling. He worked for them from 1984 until he retired in 2020. He has competed many different professional wrestling companies in Japan and North America. Liger worked for World Championship Wrestling (WCW) from 1991 to 1999. During his time in WCW, he won the WCW Light Heavyweight Championship when he defeated then-champion Brian Pillman during a house show in Atlanta, Georgia on December 25, 1991. He held the title for 2 months and was defeated Pillman at SuperBrawl II. He also challenged Konnan for the WCW United States Heavyweight Championship at Slamboree '96 but lost the match. He also competed for Total Nonstop Action Wrestling (TNA) from 2005 to 2006. Liger captained the New Japan team in the TNA 2006 World X Cup Tournament. They defeated Petey Williams, captain of Team Canada at TNA Sacrifice on May 14, 2006 using a Crash Thunder Buster when Williams was distracted by the rest of Team Japan. Liger was eliminated in the X-Cup Gauntlet later in the same night and Team Japan was not able to gain any points in the match as it was won by Team Canada with Team Mexico as runners up. On March 7, 2019, Liger said that he was going to retire after Wrestle Kingdom 14. At Wrestle Kingdom 14, Liger wrestled in his last match. He teamed with Naoki Sano and they lost to Hiromu Takahashi and Ryu Lee. Liger was the innovator of the Shooting star press. The Jushin Liger gimmick is based on an extremely popular anime superhero, Jushin Liger. ==Championships== *All-Star Promotions **World Heavy Middleweight Championship (two times) *Consejo Mundial de Lucha Libre **CMLL Universal Championship (2010) **CMLL World Middleweight Championship (one time) **CMLL World Tag Team Championship (one time) (with Hiroshi Tanahashi) *Dragon Gate **Open the Dream Gate Championship (one time) *Jersey All Pro Wrestling **JAPW Light Heavyweight Championship (one time) *8Michinoku Pro Wrestling / North Eastern Wrestling **British Commonwealth Junior Heavyweight Championship (two times) **Super J Cup (2000) *New Japan Pro Wrestling **IWGP Junior Heavyweight Championship (eleven times) **IWGP Junior Heavyweight Tag Team Championship (six times) (with The Great Sasuke (one), El Samurai (one), Minoru Tanaka, (one), Koji Kanemoto (one), AKIRA (one), and Tiger Mask IV (one)) **J-Crown (one time) **NWA World Junior Heavyweight Championship (one time) **NWA World Welterweight Championship (one time) **UWA World Junior Light Heavyweight Championship (one time) **WWA World Junior Light Heavyweight Championship (one time) **WWF Light Heavyweight Championship (one time)1 **WAR International Junior Heavyweight Championship (one time) **Top/Best of the Super Juniors (1992, 1994, 2001) **G1 Climax Junior Heavyweight Tag League (2001) (with El Samurai) **Naeba Cup Tag Tournament (2001) (with Yuji Nagata) **Young Lion Cup (1986) **Outstanding Performance Award (2000) **Tag Team Best Bout (2003) (with Koji Kanemoto vs. Kotaro Suzuki and Naomichi Marufuji on June 10) *Osaka Pro Wrestling **Osaka Pro Wrestling Tag Team Championship (one time) (with Takehiro Murahama) *Pro Wrestling Illustrated **He was ranked #8 of the 500 best singles wrestlers by PWI in the PWI 500 in 2000. **He was ranked #12 by the PWI in the PWI Years in 2003. *Pro Wrestling Noah **GHC Junior Heavyweight Championship (one time) **GHC Junior Heavyweight Tag Team Championship (one time) (with Tiger Mask IV) **NTV G+ Cup Junior Heavyweight Tag League (2013) (with Tiger Mask IV) *World Championship Wrestling **WCW Light Heavyweight Championship (one time) *Wrestle Association R **WAR International Junior Heavyweight Tag Team Championship (one time) (with El Samurai) **Super J Cup (1995) *Wrestling Observer Newsletter **5 Star Match (1994) (vs. The Great Sasuke on July 8) **Best Gimmick (1989) **Best Flying Wrestler (1989 to 1993) **Best Technical Wrestler (1989 to 1992) **Best Wrestling Maneuver (1987, 1988) (Shooting star press) **Match of the Year (1990) *vs. Naoki Sano on January 31 in Osaka, Japan) **Most Outstanding Wrestler (1990 to 1992) **Rookie of the Year (1984) tied with Tom Zenk **Wrestling Observer Newsletter Hall of Fame (Class of 1999) 1Even though Liger won the championship, the win and reign aren't recognized by World Wrestling Entertainment. No reign with the championship is recognized by the company before December 1997. == References == ==Other websites== *WWE profile *NJPW profile Category:1962 births Category:Living people Category:Japanese mixed martial artists Category:Japanese professional wrestlers Category:Sportspeople from Hiroshima Category:Total Nonstop Action Wrestling alumni Category:WWE Hall of Fame",
 "title": "Jushin Liger"
}