{
 "id": "42373",
 "text": "James Clerk Maxwell (born 13 June 1831 in Edinburgh – died 5 November 1879) was a British mathematician, physicist and discoverer of Maxwell's equations. ==Early life== Maxwell grew up in a rich religious family. In 1845, when he was only 14, he wrote a paper describing a way of drawing mathematical curves with a piece of string. In 1847 he started studying mathematics at the University of Edinburgh. In 1850 Maxwell changed to Peterhouse and then Trinity College at the University of Cambridge. He won prizes from the university for his work and was given his degree in 1854. From 1855 to 1872 he did research on colour blindness. ==Works== In 1856 Maxwell was made a professor of 'Natural Philosophy' (which is what science was called then) at Marischal College, Aberdeen. He worked there until the two colleges in Aberdeen joined together in 1860 and he lost his job. He then became a professor at King's College London. In 1861 he was elected to the Royal Society. In 1871, he became the first Cavendish Professor of Physics at Cambridge. He studied many things, but is known best for his mathematical work on electromagnetism and on the behaviour of gases. He used the experiments of Michael Faraday to see how magnetism and electricity were connected. This helped him to make his equations that allowed scientists to understand light and radio waves. He lived at Glenlair House, his family estate near the village of Parton, Castle Douglas in Kirkcudbrightshire. Maxwell died in 1879 from cancer, and is buried in the graveyard at Parton Church. == Publications == * Maxwell, James Clerk, \"On the Description of Oval Curves, and those having a plurality of Focus (geometry)|Foci\". Proceedings of the Royal Society of Edinburgh, Vol. ii. 1846. * Maxwell, James Clerk, \"Illustrations of the Dynamical Theory of Gases\". 1860. * Maxwell, James Clerk, \"On Physical Lines of Force\". 1861. * Maxwell, James Clerk, \"A Dynamical Theory of the Electromagnetic Field\". 1865. * Maxwell, James Clerk, \"On Governors \".From the Proceedings of the Royal Society, No.100. 1868. * Maxwell, James Clerk, \"Theory of Heat\". 1871. * Maxwell, James Clerk, \"A Treatise on Electricity and Magnetism\". Clarendon Press, Oxford. 1873. * Maxwell, James Clerk, \"Molecules \". Nature, September, 1873. * Maxwell, James Clerk, \"Matter and Motion\", 1876. * Maxwell, James Clerk, \"On the Results of Bernoulli's Theory of Gases as Applied to their Internal Friction, their Diffusion, and their Conductivity for Heat\". * Maxwell, James Clerk, \"Ether\", Encyclopædia Britannica, Ninth Edition (1875–89). Category:1831 births Category:1879 deaths Category:Scientists from Edinburgh Category:Scottish mathematicians Category:British theoretical physicists Category:Scottish physicists",
 "title": "James Clerk Maxwell"
}