{
 "id": "423731",
 "text": "Leati Joseph \"Joe\" Anoa'i (born May 25, 1985 in Pensacola, Florida), better known by his ring name Roman Reigns, is an American professional wrestler and former American football player. He is currently signed to WWE, where he performs on the SmackDown brand. He is a two-time and the longest reigning WWE Universal Champion (as well as the last recognized Universal Champion) and a four-time WWE Champion (both championships were combined as the Undisputed WWE Universal Championship since WrestleMania 38 in April 2022), making him a six- time world champion overall. He is a member of the Anoaʻi family which is a renowned Samoan-American wrestling dynasty. Reigns was a member of The Shield along with Dean Ambrose and Seth Rollins from 2012 to June 2, 2014 before reuniting again in 2017 and 2019. From 2020 to 2024, he was leader of the stable The Bloodline, which included other members of the Anoa'i family. His reign of 1,316 days as Universal Champion is the fourth-longest world title reign in WWE history and the longest championship reign of any title in WWE since 1988. He is also a former United States, Intercontinental, and WWE Tag Team Champion (all held one time), the 2015 Royal Rumble winner, the 28th Triple Crown Champion and the 17th Grand Slam Champion. Reigns has been in the last match of many premium live events, including WWE's biggest yearly event, WrestleMania. He was praised for playing his heel character as the Bloodline's leader. However, he was criticized when he played a face from 2014 to 2020. == Football career == Before he started his professional wrestling career, Anoa'i played football at the Georgia Institute of Technology and was named first- team All-ACC his senior year. He went drafted in the 2007 NFL Draft but ended up being signed by the Minnesota Vikings. He was picked up by the Jacksonville Jaguars to provide depth at defensive end to their roster and in 2008 he was signed by the Edmonton Eskimos of the Canadian Football League (CFL) and accepted a spot on the team's practice roster. == Professional wrestling career == === WWE (2010–present) === ==== Florida Championship Wrestling and NXT (2010–2012) ==== In July 2010, Anoa'i was signed to a developmental contract with World Wrestling Entertainment (WWE) and was put on their developmental territory Florida Championship Wrestling (FCW). He debuted under the ring name Roman Leakee on September 9, 2010 and competed in a singles match that resulted in a loss to Richie Steamboat. He then lost to Idol Stevens and Wes Brisco and finally earned his first win on September 21 in a match against Fahd Rakman. In late 2011, he formed a team with Donny Marlow and they challenged the Florida Tag Team Champions Calvin Raines and Big E Langston on July 8 but were unsuccessful in winning their match. On the February 5 episode of FCW television, he defeated his later Shield teammates Dean Ambrose and Seth Rollins in a triple threat match to become the number one contender for the FCW Florida Heavyweight Championship but he was unable to win the championship when he was defeated by champion Kruger. He was able to win the Florida Tag Team Championship with Mike Dalton before they lost the belts to CJ Parker and Jason Jordan. ==== The Shield (2012–2014) ==== Roman Reigns along with Dean Ambrose and Seth Rollins, made their main roster television debut on November 18, 2012 at the Survivor Series pay-per-view alongside, triple-powerbombing Ryback through the announce table during the triple threat main event for the WWE Championship, which allowed CM Punk to pin John Cena after an earlier Shell Shock from Ryback to retain the title. == Personal life == In early 2005, while studying at Georgia Institute of Technology, Anoaʻi met and began dating Galina Becker. They were married in December 2014, and live in Tampa, Florida. Their first child, a daughter, was born in December 2007 . They had twin sons in November 2016, followed by another set of twin sons in March 2020. On the October 22, 2018 episode of Raw, Anoaʻi announced that he had been living with chronic myeloid leukemia, a form of blood cancer. He was diagnosed in 2007 during his American Football career and continues to take medication. Because of his leukemia, he took a break from professional wrestling until February 25, 2019, and again for some months in 2020 during the COVID-19 pandemic. ==Acting Career== ===Film=== Year Title Role Notes 2016 Countdown Himself Uncredited cameo 2017 The Jetsons & WWE: Robo-WrestleMania! Himself (voice) 2019 Fast & Furious Presents: Hobbs & Shaw Mateo Hobbs 2020 The Wrong Missy Tatted Meathead (Gary) 2021 Rumble Ramarilla (voice) ===Television=== Year Title Role Notes 2013 Total Divas Himself 1 episode 2015 WWE 24 Himself Documentary about WrestleMania 31 2016 Unfiltered Himself Interview show with Renee Young 2016 WWE 24 Himself Documentary about WrestleMania 32 2019 WWE Chronicle Himself 2 episode 2019 Cousins for Life Rodney Episode: \"Farewell to Arthur?\" 2019 Fox's New Year's Eve with Steve Harvey Himself 2020 Elena of Avalor Kizin (voice) Episode: \"Giant Steps\" == Championships and accomplishments == ===College Football=== * NCAA ** First-team All-ACC (2006) ===Professional wrestling=== * CBS Sports ** Feud of the Year (2020) * ESPN ** Best Storyline of the Year (2022) – ** Best Storyline of the Year (2023) – ** Male Wrestler of the Year (2022) * ESPY Awards ** Best WWE Moment (2019) – * Florida Championship Wrestling ** FCW Florida Tag Team Championship (1 time) – with Mike Dalton * New York Post ** Storyline of the Year (2022) – * Pro Wrestling Illustrated ** Comeback of the Year (2019) ** Inspirational Wrestler of the Year (2018, 2019) ** Most Hated Wrestler of the Year (2016) ** Most Improved Wrestler of the Year (2015) ** Tag Team of the Year (2013) – ** Ranked No. 1 of the top 500 singles wrestlers in the PWI 500 in 2016 and 2022 ** Wrestler of the Year (2022) * Sports Illustrated ** Wrestler of the Year (2021) * Wrestling Observer Newsletter ** Best Box Office Draw (2022, 2023) ** Feud of the Year (2023) ** Best Gimmick (2021) ** Most Improved (2013) ** Tag Team of the Year (2013) – ** Most Overrated (2016) ** Worst Feud of the Year (2013) – * WWE ** WWE (World Heavyweight) Championship (4 times) ** WWE Universal Championship (2 times, last) ** WWE Intercontinental Championship (1 time) ** WWE United States Championship (1 time) ** WWE Tag Team Championship (1 time) – with Seth Rollins ** 28th Triple Crown Champion ** Ninth Grand Slam Champion (under current format; 17th overall) ** Royal Rumble (2015) **WWE World Heavyweight Championship Tournament (2015) **Elimination Chamber (2018) ** Slammy Award (7 times) *** Breakout Star of the Year (2013) *** Extreme Moment of the Year (2015) – *** Faction of the Year (2013, 2014) *** Superstar of the Year (2014) *** Trending Now (Hashtag) of the Year (2013) – #BelieveInTheShield *** \"What a Maneuver\" of the Year (2013) – Spear ** WWE Year-End Awards (2 times) *** Best Reunion (2018) *** Hottest Rivalry (2018) ** Bumpy Award (1 time) *** Superstar of the Half-Year (2021) ==Footnotes== ==References== ==Other websites== * * Category:1985 births Category:Living people Category:American football players Category:American professional wrestlers Category:Edmonton Elks players Category:Sportspeople from Florida Category:WWE wrestlers Category:People from Pensacola, Florida",
 "title": "Roman Reigns"
}