{
 "id": "423787",
 "text": "Nicholas Warren Francis \"Nick\" Bockwinkel (December 6, 1934 in St. Paul, Minnesota - November 14, 2015 in Las Vegas, Nevada) was an American professional wrestler. He was known for competing in American Wrestling Association (AWA). Bockwinkel was known for his technical ability and ring psychology as well as his calm, charismatic and articulate promos which helped distinguish him from many of his contemporaries. ==Career== Before becoming a professional wrestler, he was going to play football at the University of Oklahoma but he suffered a knee injury and Oklahoma withdrew his football scholarship. He was trained by his father Warren Bockwinkel and Lou Thesz. He joined the American Wrestling Association (AWA) in 1970 and formed a team with Ray Stevens and their manager Bobby Heenan. The team won the AWA World Tag Team Championship three times. He ended Verne Gagne's seven year reign when he won the AWA World Heavyweight Championship. He won the Championship four times and had feuds with the likes of Billy Robinson, Dick the Bruiser, The Crusher, Mad Dog Vachon, Jerry Lawler, Otto Wanz, Mr. Saito, Verne Gagne and Hulk Hogan. He competed in the first ever AWA versus World Wide Wrestling Federation (WWWF) World Title Unification match, wrestling WWWF Champion, Bob Backlund, to a double count-out, on March 25, 1979. He worked for the company from 1970 to 1987 and wrestled his last match against Larry Zbyszko after he paid him back for costing him the AWA World title by knocking him out with a roll of coins and pinning him on an episode of AWA Championship Wrestling. He was the President of the Cauliflower Alley Club, as well as the on-screen General Manager for AWA Superstars. He was inducted in the WWE Hall of Fame on March 31, 2007. ==Death== Bockwinkel died in Las Vegas, Nevada at the age of 80. ==Championships== *American Wrestling Association **AWA World Heavyweight Championship (four times) **AWA World Tag Team Championship (three times) (with Ray Stevens) *Championship Wrestling from Florida **NWA Florida Tag Team Championship (one time) (with Ray Stevens) *Continental Wrestling Association **AWA Southern Heavyweight Championship (one time) *Mid-South Sports **NWA Georgia Heavyweight Championship (two times) **NWA Georgia Television Championship (three times) *NWA Big Time Wrestling **NWA World Tag Team Championship (Texas version) (two times) (with Ricky Romero) *NWA Los Angeles **NWA \"Beat the Champ\" Television Championship (two times) *NWA Mid-Pacific Promotions **NWA Hawaii Heavyweight Championship (two times) **NWA Hawaii Tag Team Championship (one time) (with Bobby Shane) **NWA United States Heavyweight Championship (Hawaii version) (one time) *NWA San Francisco **NWA World Tag Team Championship (San Francisco version) (two times) (with Ramon Torres) *Pacific Northwest Wrestling **NWA Pacific Northwest Heavyweight Championship (two times) **NWA Pacific Northwest Tag Team Championship (three time) (with Nick Kozak (two) and Buddy Mareno (one)) *Pro Wrestling Illustrated **PWI Stanley Weston Award (2007) **PWI Tag Team of the Year (1973) (with Ray Stevens) **He was ranked #18 of the 500 best singles wrestlers of the \"PWI Years\" in 2003. *Professional Wrestling Hall of Fame and Museum **Class of 2003 *World Wrestling Association (Los Angeles) **WWA International Television Tag Team Championship (two times) (with Édouard Carpentier (one) and Lord James Blears (one)) *World Wrestling Entertainment **WWE Hall of Fame (Class of 2007) *Wrestling Observer Newsletter awards **Wrestling Observer Newsletter Hall of Fame (Class of 1996) ==References== ==Other websites== *WWE profile Category:1934 births Category:2015 deaths Category:American professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Sportspeople from Saint Paul, Minnesota Category:WWE Hall of Fame",
 "title": "Nick Bockwinkel"
}