{
 "id": "423717",
 "text": "Joseph Ruud (born November 28, 1981), better known by his ring name Erick Rowan, is an American professional wrestler. He is signed to WWE and performs on their SmackDown brand as a member of The Wyatt Sicks. Rowan first competed in WWE from 2011 to 2020, where he was a member of The Wyatt Family along with Bray Wyatt, Luke Harper, Daniel Bryan, Braun Strowman and Randy Orton. He began performing as Erick Redbeard on the independent circuit and for All Elite Wrestling, before re-signing with WWE in 2024. ==Career== Rudd competed in various independent promotions in both the United States and Japan before signing with WWE. In 2007, he worked for Pro Wrestling Noah in Japan under the ring name, Thoruf. After his time with them was done, he returned to the United States and started competing for F1rst Wrestling under the ring name, Thoruf Marius. During his time there he feuded with Brody Hoofer. === WWE (2011–2020) === In 2011, Ruud signed a developmental contract with WWE. He was assigned to their developmental territory Florida Championship Wrestling and started competing under the ring name Erick Rowan. He debuted on FCW TV in August 2011 when he defeated Kenneth Cameron. When FCW changed its name to NXT Wrestling, he debuted on the December 12, 2012 episode of NXT as a follower of Bray Wyatt, who introduced Rowan as his \"second son\". As a member of the stable The Wyatt Family, Rowan teamed with Wyatt's \"first son\" Luke Harper. They defeated Percy Watson and Yoshi Tatsu on the January 9, 2013 episode of NXT and defeated them again on the January 23 in the first round of the NXT Tag Team Championship tournament. Rowan and Harper defeated Bo Dallas and Michael McGillicutty in the semi-finals but were defeated in the finals by Adrian Neville and Oliver Grey. Harper and Rowan won a triple threat elimination tag match on May 2 and defeated Neville and Bo Dallas, who filled in for the injured Grey, on the May 8 epsiode (taped on May 2) to win the tag titles. On June 20, they lost the NXT Tag Team Championship to Adrian Neville and Corey Graves. Starting on May 27, 2013, videos played on Raw to promote the upcoming main roster debut of the Wyatt Family. They debuted on the July 8 episode when they attacked Kane. Rowan made his WWE in-ring debut in a tag team match on the July 26 episode of SmackDown, where he and Harper defeated Tons of Funk (Brodus Clay and Tensai). Rowan and Harper went on a winning streak over many teams for a couple months but suffered their first lost on the October 11 episode of SmackDown from Cody Rhodes and Goldust. On September 29, 2014, Rowan and Harper were \"set free\" by Wyatt, therefore the Wyatt Family broke up and Rowan began wrestling in singles competition. On the November 17 episode of Raw, Rowan became a face when he joined Team Cena for Survivor Series, while Harper joined Team Authority. At the event, Rowan was eliminated by Harper, with the help of Seth Rollins, but Team Cena later won the match. At the 2015 Royal Rumble, Rowan entered his first Royal Rumble match. Although he lost to Harper in a qualifying match 3 days before on SmackDown, he entered the match anyway after attacking number 6 entrant Curtis Axel before he could make his way to the ring. Rowan was eliminated by Wyatt. After an injury, Rowan returned on the October 19 episode of Raw as a heel when he re-joined the Wyatt Family. On April 3, 2016, at WrestleMania 32, Rowan answered The Rock's challenge to a match, after the Wyatts confronted him. The Rock defeated Rowan in six seconds, which broke the record for the shortest WrestleMania match of all time. On July 19, Rowan was drafted to SmackDown in the 2016 WWE draft along with Wyatt. On April 10, 2017, the Wyatt Family broke up again when Wyatt was moved to Raw in the Superstar Shake-up. On the October 10 episode of SmackDown Live, Rowan and Harper, now wrestling simply under their last names, were reintroduced as the Bludgeon Brothers. They defeated the Hype Bros (Zack Ryder and Mojo Rawley) in their return match on November 21. At WrestleMania 34 on April 8, 2018, they won the SmackDown Tag Team Championship in a Triple threat tag team match also involving champions The Usos (Jey and Jimmy Uso), and The New Day (Big E and Kofi Kingston). This also was Rowan's first main roster championship win. On the August 21 episode of SmackDown Live, they lost the title to The New Day (Kingston and Xavier Woods) in a no disqualification match. After both Rowan and Harper were injured, the Bludgeon Brothers broke up. Rowan returned from injury at the Royal Rumble pay-per-view event on January 27, 2019,helping Daniel Bryan to keep his WWE Championship against AJ Styles. On the May 7 episode of SmackDown Live, Rowan and Bryan defeated The Usos for the vacant SmackDown Tag Team Championship. At Extreme Rules on July 14, they lost the titles to the New Day (Big E and Xavier Woods) in a Triple threat tag team match also involving Heavy Machinery (Otis and Tucker). On September 3, Rowan turned on Bryan. In the 2019 draft on Ocrober 14, he was drafted to Raw. On April 15, 2020, he was released from WWE, ending his time in the company after nine years. === Return to independent circuit and All Elite Wrestling appearances (2020–2022) === Following his time WWE, Ruud began wrestling under the ring name \"Erick Redbeard\". After the death of his friend and former tag team partner Brodie Lee, Redbeard appeared on All Elite Wrestling's (AEW) Brodie Lee Celebration of Life on December 30. He protected members of The Dark Order (a stable peviously led by Lee) from being attacked by Wardlow during a six-man tag team match. Redbeard returned to AEW on the March 4, 2022 episode of Rampage and teamed with Death Triangle (Pac and Penta Oscuro). On March 6, they faced the House of Black (Malakai Black, Brody King, and Buddy Matthews) at Revolution's \"Buy-In\" pre-show event. They lost the match after Redbeard got pinned by Black. === Return to WWE (2023–present) === On August 25, 2023, Rowan made his return to WWE on SmackDown in a tribute to Bray Wyatt, who died from a heart attack the day before. In May 2024, he signed a contract to return to the company full-time. On the June 17 episode of Raw, Rowan was reintroduced a part of The Wyatt Sicks, the new stable led by Uncle Howdy. His new mask looked like Ramblin' Rabbit from Bray Wyatt's \"Firefly Funhouse\". On August 5, Rowan won his return match, teaming with his new partners Dexter Lumis and Joe Gacy against American Made (Chad Gable, Julius Creed and Brutus Creed). ==Championships and accomplishments== * French Lake Wrestling Association ** FLWA Heavyweight Championship (1 time) *Insane Wrestling Revolution **IWR World Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Ranked No. 57 of the top 500 singles wrestlers in the PWI 500 in 2014 * Wrestling Observer Newsletter ** Best Gimmick (2013) * World Series Wrestling ** WSW Tag Team Championship (1 time) - with Matt Basso * WWE ** WWE SmackDown Tag Team Championship (2 times) – with Harper (1) and Daniel Bryan (1) ** NXT Tag Team Championship (1 time) – with Luke Harper ** Slammy Award (1 time) *** Match of the Year (2014) – * Other Titles **Doublewide Bar Championship (1 time) ==References== ==Other websites== * Category:1981 births Category:Living people Category:American professional wrestlers Category:Sportspeople from Minneapolis Category:WWE wrestlers",
 "title": "Erick Rowan"
}