{
 "id": "423813",
 "text": "Frank Donald Goodish (June 18, 1946 – July 17, 1988) was an American professional wrestler and football player. He is known for competing in National Wrestling Alliance (NWA), World Wide Wrestling Federation (WWWF) and the American Wrestling Association (AWA). Before becoming a professional wrestler, Goodish played football at the University of Iowa and West Texas State. He then played in the NFL for the Washington Redskins on their \"taxi squad\" in 1968 and was cut during second season.Jim Wilson & Weldon T. Johnson. Chokehold: Pro Wrestling's Real Mayhem Outside the Ring (p.112–113) During his time competing in the United States, Goodish was involved in feuds with the likes of Kamala the Ugandan Giant, Abdullah the Butcher, and Jerry Blackwell. During his time in Japan, he tag teamed with Stan Hansen. ==Death== On July 16, 1988, before his match with Dan Spivey in Bayamón, Puerto Rico, Goodish was told to go into the shower by fellow wrestler and booker, José Huertas González to discuss business.Mick Foley. Have A Nice Day: A Tale of Blood and Sweatsocks (p.115) Goodish waited in the shower and a scuffle ensued which was followed by two groans that was loud enough for the entire locker room to hear. Tony Atlas ran over to the shower and saw that Goodish was bent over and was holding his stomach.Atlas, Tony. ATLAS Too Much ... Too Soon. Crowbar Press. (p.197-205) He then looked up and noticed that González was holding the knife. Atlas had to carry Goodish down the stairs because Goodish was so big that the paramedics could not lift him up. The last words that Goodish said to Atlas were \"Tell my little son I love him, and tell my wife I love her, too.\" Dutch Mantell received a subpoena after the trial was over and Tony Atlas refused to testify, and without his testimony the District Attorney had no case. González was charged with first-degree murder but that was later reduced and he was tried for involuntary homicide. ==Championships== *All Japan Pro Wrestling **NWA International Heavyweight Championship (three times) **PWF World Tag Team Championship (one time) (with Stan Hansen) **World's Strongest Tag Determination League (1981) (with Jimmy Snuka) **World's Strongest Tag Determination League (1983) (with Stan Hansen) **January 3 Korakuen Hall Heavyweight Battle Royal (1979) *Central States Wrestling **NWA Central States Heavyweight Championship (one time) **NWA Central States Tag Team Championship (one time) (with Ernie Ladd) *Championship Wrestling from Florida **NWA Florida Heavyweight Championship (one time) *National Wrestling Federation **NWF International Championship (one time) *NWA Big Time Wrestling / World Class Wrestling Association **NWA American Heavyweight Championship (four times) **NWA American Tag Team Championship (three times) (with Kerry Von Erich) **NWA Brass Knuckles Championship (Texas version) (six times) **NWA Texas Heavyweight Championship (one time) **NWA Texas Tag Team Championship (three times) (with Mike York (one), Gino Hernandez (one), and Kerry Von Erich (one)) **WCWA Television Championship (one time) *NWA Tri-State **NWA United States Tag Team Championship (Tri-State version) (two time) (with Stan Hansen) *NWA Western States Sports **NWA Western States Heavyweight Championship (one time) *Pro Wrestling Illustrated **PWI Editor's Award (1988) (tied with Adrian Adonis) **He was ranked #14 of the 500 best singles wrestlers of the \"PWI Years\" in 2003. *Southwest Championship Wrestling **SCW Southwest Brass Knuckles Championship (one time) **SCW World Tag Team Championship (one time) (with Dick Slater) *St. Louis Wrestling Hall of Fame **Class of 2007 *World Wrestling Association **WWA World Heavyweight Championship (one time) *Wrestling Observer Newsletter awards **5 Star Match (1984) (with Stan Hansen vs. Dory and Terry Funk on December 8) **Best Brawler (1980 to 1984, 1987, 1988) **Wrestling Observer Newsletter Hall of Fame (Class of 1996) == References == ==Other websites== *WWE profile Category:1946 births Category:1988 deaths Category:American football players Category:American murder victims Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Detroit Category:Washington Redskins players Category:WWE Hall of Fame",
 "title": "Bruiser Brody"
}