{
 "id": "423962",
 "text": "5 Seconds Of Summer (abbreviated 5SOS) is a pop-rock band from Quakers Hill, a Western suburb of Sydney, Australia. The band has 4 members: Calum Hood (bass guitar, vocals), Michael Clifford (guitar, vocals), Luke Hemmings (lead vocals, guitar), and Ashton Irwin (drums, vocals). Luke, Calum, and Michael all attended Norwest Christian College in Riverstone, NSW. Ashton, however, attended Richmond High School in Richmond, NSW. Michael came up with the name '5 Seconds Of Summer'. Calum writes most of their music and they often sing about love or according to Ashton, life. The band have talked about being heavily influenced by famous rock bands such as Green Day, All Time Low, Blink-182, and Nirvana. In an interview, they stated that their music was \"Basically the love child of all their favorite bands\". They have also said that their hero is Billie Joe Armstrong, the lead singer of Green Day. They supported Hot Chelle Rae on their 2012 \"Whatever\" tour. They toured with One Direction for their TMH and WWA tours and gained international fame. They now have their own tour \"Rock Out With Your Socks Out\" (ROWYSO). Their second headline tour started in February 2016, \"Sounds Live Feels Live\" (SLFL). The band has released five studio albums, 5 Seconds Of Summer (2014), Sounds Good Feels Good (2015), Youngblood (2018), CALM (2020) and 5SOS5 (2022). ==Career== 5 Seconds of Summer started out with Luke Hemming making covers on YouTube and, then he invited Calum and Michael to the band as well, where they were quickly getting recognition. Later on, they were in need of a drummer which led them to Ashton Irwin on Facebook from a mutual friend, and they officially became a band on December 3, 2011. Louis Tomlinson and Niall Horan from One Direction later directed their attention toward them. Over the years 5SOS released EP's like Somewhere New (2012), Unplugged (2012), Don't Stop (2014), Good Girls (2014), Amnesia (2014), and She's Kinda Hot (2015). They proceeded to release their first album \"5 Seconds of Summer\" on June 27, 2014 which got recognition from fans worldwide and resulted in their first headlining tour \"Rock Out With Your Socks Out\". Their second album \"Sounds Good Feels Good\" was released on October 23, 2015, followed by their second headlining world tour \"Sounds Live Feels Live\". The band released their third album, Youngblood, on the June 15, 2018, after returning from their 3-year hiatus. Since then, the band has featured on The Chainsmokers' single \"Who Do You Love\", and joined The Chainsmokers on their tour, World War Joy. They went on the No Shame tour and will be featuring the famous rock band, All Time Low. The band has just finished their latest album. It’s called 5SOS5 and features songs like Bad Omens (2022), Easy For You To Say (2022) and Me Myself & I (2022). They are also going on their 12th headlining tour to promote the record, playing in countries like Argentina, Portugal, and the United States. Studio Albums # 5 Seconds Of Summer (2014) # Sounds Good Feels Good (2015) # Youngblood (2018) # CALM (2020) # 5SOS5 (2022) ==Sources== Category:2010s Australian music groups Category:2011 establishments in Australia Category:Australian pop music groups Category:Australian rock bands Category:Boy bands Category:Musical groups established in 2011 Category:Musical groups from Sydney Category:Musical quartets Category:Pop rock bands Category:MTV Video Music Award winners",
 "title": "5 Seconds of Summer"
}