{
 "id": "424081",
 "text": "No Way Out (2008) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on February 17, 2008 at the Thomas & Mack Center in Las Vegas, Nevada. It was the tenth No Way Out event held by WWE. ==Matches== No. Results Stipulations Times 1 Kane defeated Shelton Benjamin Singles match 5:32 2 Chavo Guerrero (c) defeated CM Punk Singles match for the ECW Championship 7:06 2 The Undertaker defeated Batista, Finlay, Montel Vontavious Porter, The Great Khali (with Ranjin Singh), and Big Daddy V (with Matt Striker) Elimination Chamber match for a World Heavyweight Championship match at WrestleMania XXIV 29:28 3 Ric Flair defeated Mr. Kennedy by submission Career Threatening match 7:13 4 Edge (c) defeated Rey Mysterio Singles match for the World Heavyweight Championship 5:27 5 John Cena defeated Randy Orton (c) by disqualification Singles match for the WWE Championship 15:51 6 Triple H defeated Jeff Hardy, Shawn Michaels, Chris Jericho, Umaga, and John \"Bradshaw\" Layfield Elimination Chamber match for a WWE Championship match at WrestleMania XXIV 23:54 (c) –is the champion(s) going into the match D – This match was a dark match === Elimination Chamber entrances and eliminations (SmackDown/ECW) === Eliminated Wrestler Entered Eliminated by Method Time Big Daddy V Batista Pinned after a DDT by The Undertaker 09:07 The Great Khali The Undertaker Submitted to the Hell's Gate 12:38 MVP Finlay Pinned after being thrown off a chamber pod by The Undertaker 22:31 Finlay The Undertaker Pinned after a Chokeslam 24:11 Batista Pinned after a Tombstone Piledriver 29:28 The Undertaker === Elimination Chamber entrances and eliminations (Raw) === Eliminated Wrestler Entered Eliminated by Method Time JBL Chris Jericho Pinned after a Codebreaker 13:44 Umaga Pinned after a Pedigree from Triple H and a Swanton Bomb from Hardy 19:45 Chris Jericho Jeff Hardy Pinned after a Sweet Chin Music from Michaels 19:57 Shawn Michaels Triple H Pinned after a Pedigree 20:25 Jeff Hardy Pinned after a Pedigree on a chair 23:54 Triple H ==References== ==Other websites== *Official No Way Out 2008 website Category:2008 in professional wrestling Category:WWE No Way Out Category:2000s in Nevada",
 "title": "No Way Out (2008)"
}