{
 "id": "424291",
 "text": "Hiroshi Tanahashi (born November 13, 1976) is a Japanese professional wrestler. He is currently signed to New Japan Pro-Wrestling (NJPW). He is also the president and representative director for NJPW. During his time in NJPW, he has become a six-time IWGP Heavyweight Champion. He shares the record for most reigns as IWGP Heavyweight Champion with Tatsumi Fujinami and also holds the record for most successful defenses with eleven during his fifth reign as champion. On December 23, 2023, Tanahashi was named as both the President and Representative Director of New Japan Pro-Wrestling. ==Career== Before becoming a professional wrestler, Tanahashi played baseball in high school and also started wrestling during his time attending Ritsumeikan University in Kyoto. While he was wrestling, he was noticed by New Japan Pro Wrestling talent scouts and was invited to try out for the New Japan Dojo. His tryout was successful and he was brought in as a trainee. Tanahashi made his debut in October 1999 in a match against Shinya Makabe. During that time, he was viewed as a big prospect and he earned wins over lucha libre legend Negro Casas in July 2000 and American Scott Hall in September 2001. He would go on to team with Kenzo Suzuki with their tag team being called the Kings of the Hills. The team ended when a real life incident occurred in November 2002 with Tanahashi being stabbed in the back by Hitomi Hara (a TV Asahi news reporter that he had dated for a brief amount of time). He was hospitalized, but recovered. He returned to in-ring competition this time as a singles wrestler on February 16, 2003 in a match against Manabu Nakanishi in front of a sold-out Tokyo crowd. On January 4, 2014, Tanahashi was able to defeat Shinsuke Nakamura in the main event of Wrestle Kingdom 8 in Tokyo Dome to win the IWGP Intercontinental Championship. He had a rematch against Nakamura at The New Beginning in Hiroshima on February 9 where he was successful in defending his championship. When Nakamura won the 2014 New Japan Cup, Tanahashi had a second rematch against Nakamura at Invasion Attack 2014 on April 6. Nakamura defeated Tanahashi for the championship in the match. ==Championships== *Consejo Mundial de Lucha Libre **CMLL Universal Championship (2013) **CMLL World Tag Team Championship (one time) (with Jushin Liger) **CMLL World Trios Championship (one time) (with Okumura and Taichi) *New Japan Pro Wrestling **IWGP Heavyweight Championship (six times) **IWGP Intercontinental Championship (one time) **IWGP Tag Team Championship (two times) (with Yutaka Yoshie (one) and Shinsuke Nakamura (one)) **IWGP U-30 Championship (two times) **G1 Climax (2007) **G2 U-30 Climax (2003) **New Japan Cup (2005, 2008) **IWGP Heavyweight Title Tournament (2007) **U-30 One Night Tag Tournament (2004) (with Taiji Ishimori) **Heavyweight Tag MVP Award (2005) (with Shinsuke Nakamura) **Fighting Spirit Award (2003) **New Wave Award (2002) **Outstanding Performance Award (2003, 2004) **Singles Best Bout (2004) (vs. Hiroyoshi Tenzan on August 15) **Young Lion Award (2001) *Pro Wrestling Illustrated **He was ranked #3 of the top 500 singles wrestlers in the PWI 500 in 2013. *Pro Wrestling Noah **GHC Tag Team Championship (one time) (with Yuji Nagata) *Tokyo Sports Grand Prix **Best Bout Award (2012) (vs. Kazuchika Okada on June 16) **Fighting Spirit Award (2003, 2006) **MVP Award (2009, 2011) **Performance Award (2007) *Wrestling Observer Newsletter **5 Star Match (2012) (vs. Minoru Suzuki on October 8) **5 Star Match (2013) (vs. Kazuchika Okada on April 7) **5 Star Match (2013) (vs. Kazuchika Okada on October 14) **Feud of the Year (2012) (vs. Kazuchika Okada) **Match of the Year (2012) (vs. Minoru Suzuki on October 8) **Most Outstanding Wrestler (2012) **Wrestler of the Year (2011, 2012) **Wrestling Observer Newsletter Hall of Fame (Class of 2013) == References == ==Other websites== *NJPW profile * Category:1976 births Category:Living people Category:Japanese professional wrestlers Category:People from Gifu Prefecture Category:Professional wrestling executives Category:Total Nonstop Action Wrestling alumni",
 "title": "Hiroshi Tanahashi"
}