{
 "id": "424375",
 "text": "No Way Out (2007) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on February 18, 2007 at the Staples Center in Los Angeles, California. It was the ninth No Way Out event held by WWE. Although the event was announced to be exclusive to the SmackDown! brand, ECW's World Champion Bobby Lashley defended his title against Mr. Kennedy, while Raw's World Tag Team Champions John Cena and Shawn Michaels also competed in the main event. No Way Out was WWE's last single- branded PPV until Backlash (2016). ==Matches== No. Results Stipulations Times 1 Rob Van Dam defeated Shelton Benjamin Singles match 5:02 2 Chris Benoit and The Hardys (Matt and Jeff Hardy) defeated Montel Vontavious Porter and MNM (Joey Mercury and Johnny Nitro) (with Melina) by submission Six-man tag team match 14:19 3 Chavo Guerrero defeated Scotty 2 Hotty, Daivari, Gregory Helms (c), Funaki, Shannon Moore, Jimmy Wang Yang, and Jamie Noble Cruiserweight Open for the WWE Cruiserweight Championship 14:11 4 Finlay and Little Bastard defeated The Boogeyman and Little Boogeyman Mixed tag team match 6:44 5 Kane defeated King Booker (with Queen Sharmell) Singles match 12:38 6 Paul London and Brian Kendrick (c) defeated Deuce 'n Domino (with Cherry) Tag team match for the WWE Tag Team Championship 8:07 7 Mr. Kennedy defeated Bobby Lashley (c) by disqualification Singles match for the ECW World Championship 15:27 8 Ashley Massaro defeated Jillian Hall, Kelly Kelly, Layla and Brooke Adams Diva Talent Invitational 9:40 9 John Cena and Shawn Michaels defeated Batista and The Undertaker) Tag team match 22:09 (c) –is the champion(s) going into the match D – This match was a dark match ===Cruiserweight Open eliminations=== Elimination no. Wrestler Eliminated by Elimination move Time 1 Daivari Scotty 2 Hotty Worm 01:39 2 Scotty 2 Hotty Gregory Helms Double knee facebreaker 03:30 3 Funaki Roll-up 03:50 4 Shannon Moore Double knee facebreaker 05:40 5 Gregory Helms Jimmy Wang Yang Roll-up after Hurricanrana 07:20 6 Jamie Noble Yang Time 10:44 7 Jimmy Wang Yang Chavo Guerrero Frog splash 14:11 Winner: Chavo Guerrero ==References== ==Other websites== *Official No Way Out 2007 website Category:2007 in professional wrestling Category:Sports in Los Angeles Category:WWE No Way Out Category:2007 in American television Category:2000s in Los Angeles, California Category:2007 in California Category:February events",
 "title": "No Way Out (2007)"
}