{
 "id": "424530",
 "text": "A tenon saw is a type of backsaw that is used to cut straight lines in wood. It does not cut materials such as metal. It is a standard item in the carpenter's toolkit. A tenon saw is made out of high-speed steel (HSS) and brass. It is sometimes made out of hard-carbon steel (heat treated steel). The tenon saw falls under the backsaw family due to the rib that runs along the top of the blade. This improves rigidity and stiffness. The saw has a fine-toothed crosscut for sawing plywood, thin wood and large joints. == Uses == Tenon saws may be used to cut both hardwood and softwood, typically in order to create the tenon portion of a mortise and tenon joint. These saws are used similarly to hand saws (aka \"panel saws\"), as the user creates a cutline, following single-direction strokes until cut is deep enough. Cutting in both directions may then begin.The angle of a tenon saw's handle allows the user to provide more downward force on the saw, allowing for a quicker cut. Tenon saws are widely used in construction and woodworking joints, having a smaller blade compared to other back saws and ranging from 10 to 14 inches. Cross-cutting wood can also be done with the tenon saw, given that the cut is not deeper than the height of the saw, not including the rib. The tenon saw's capabilities do not include cutting curves (as jigsaws may) or thick lumber (as circular saws may). Types of tenon saws include stopped (or blind) tenon saws, through tenon saws, angled tenon saws, and wedged tenon saws. == History == The exact birthdate of the tenon saw is unknown, but its historical roots date back to the 18th and 19th century, where it was commonly referred to as a \"sash saw\". Craftsmen of this date relied on a basic kit of three backsaws: the dovetail saw, carcase saw, and tenon saw. In the 18th and 19th centuries, joinery was revolutionized with the introduction of new tools and materials such as the tenon saw. Dowel and mortise and tenon joints allowed for more complex designs. These joints also became widely used in furniture. The tenon saw is still used today to craft various wooden constructs and items. ==References== Mark. \"What is a Tenon Saw\" . Creator Skills. Retrieved 2024-07-10. \"The Saw Guide | Tool Guide | Common Woodworking- Woodworking for Beginners\". Common Woodworking. 2018-03-23. Retrieved 2024-07-10. \"Understanding Western Backsaws\". Popular Woodworking. 2008-03-17. Retrieved 2024-07-10. Category:Woodworking tools Category:Cutting tools",
 "title": "Tenon saw"
}