{
 "id": "424654",
 "text": "Over the Limit (2012) was a professional wrestling pay-per-view show made by WWE. It was held on May 20, 2012 at the PNC Arena in Raleigh, North Carolina. It was the third and last Over the Limit event held by WWE. ==Matches== No. Results Stipulations Times 1 Kane defeated Zack Ryder Singles match 6:52 2 Christian won by last eliminating The Miz 20-man Battle Royal 12:24 3 Kofi Kingston and R-Truth (c) defeated Dolph Ziggler and Jack Swagger (with Vickie Guerrero) Tag team match for the WWE Tag Team Championship 12:17 4 Layla (c) defeated Beth Phoenix Singles match for the WWE Divas Championship 7:10 5 Sheamus (c) defeated Alberto Del Rio (with Ricardo Rodriguez), Randy Orton and Chris Jericho Fatal four-way match for the World Heavyweight Championship 15:53 6 Brodus Clay (with Cameron and Naomi) defeated The Miz Singles match 4:12 7 Christian defeated Cody Rhodes (c) Singles match for the WWE Intercontinental Championship 7:25 8 CM Punk (c) defeated Daniel Bryan Singles match for the WWE Championship 23:48 9 Ryback defeated Camacho (with Hunico) Singles match 1:54 10 John Laurinaitis defeated John Cena No Disqualification match 17:08 === Battle Royal === Elimination Wrestler Eliminated by Times 1 Heath Slater The Great Khali 1:27 2 Michael McGillicutty 1:40 3 JTG The Usos 2:02 4 Yoshi Tatsu Drew McIntyre 2:18 5 Ezekiel Jackson Curt Hawkins and Tyler Reks 2:30 6 Jey Uso Darren Young 3:07 7 Drew McIntyre Curt Hawkins and Tyler Reks 3:40 8 Curt Hawkins The Great Khali 3:56 9 Tyler Reks 3:57 10 Jinder Mahal 4:08 11 The Great Khali Darren Young, The Miz, and Titus O'Neil 5:21 12 Titus O'Neil Jimmy Uso 6:03 13 Jimmy Uso Darren Young 6:40 14 William Regal Christian 7:17 15 Darren Young Alex Riley 7:48 16 Alex Riley The Miz 8:30 17 Tyson Kidd David Otunga 9:32 18 David Otunga Christian 11:29 19 The Miz 12:24 Winner: Christian ==References== ==Other websites== *Official Over the Limit 2012 website Category:2012 in professional wrestling Category:Sports in Raleigh, North Carolina Category:WWE Over the Limit Category:2012 in American television Category:2010s in North Carolina Category:May 2012 events",
 "title": "Over the Limit (2012)"
}