{
 "id": "424613",
 "text": "The Campan valley is a valley of the Pyrenees in the French department department of Hautes-Pyrénées in the Occitanie region. The valley is in the arrondissement of Bagnères-de-Bigorre, and Bagnères-de-Bigorre (the subprefecture of the arrondissement) is at the northern end of the valley. ==Geography== This is one of the valleys found in the upper watershed of the Adour river, on the northern slopes of the Pyrenees. It is formed by three high valleys (valleys in the mountains) where are the sources of the three Adours that meet at Sainte-Marie-de-Campan and then in Baudéan to form the Adour river that then flows beyond Bagnères-de-Bigorre. The valley goes from the northwest to the southeast, from Sainte-Marie de Campan to Montgaillard. The three high valleys (and their rivers) are: * the Payolle valley (Adour de Payolle);For SANDRE (Service d'administration nationale des données et référentiels sur l'eau), the French official organism, the Adour de Payolle is only the name given to the upper part of the Adour river. * the Gripp valley (Adour de Gripp); and * the Lesponne valley (Adour de Lesponne). There are many small lakes; some of them are reservoirs (man-made lakes). The larger of these lakes is the Lac Bleu de Lesponne, or simply the Lac Bleu, with an area of . The Pic du Midi de Bigorre and its astronomical observatory are located in the valley of Campan. The ski resorts of La Mongie and Payolle are also found in this valley. ==Gallery== File:Monument aux morts de Campan.JPG|Memorial, Campan File:Église Notre-Dame-de-l' Assomption de Sainte- Marie-de-Campan.JPG|Sainte-Marie-de-Campan church, Campan File:Vue vers l'aval de La Séoube.jpg|View of La Séoube, Payolle valley File:Lac Bleu de Lesponne.jpg|Lac Bleu (Blue Lake), Lespone File:La Mongie ski resort - The village.jpg|La Mongie ski resort File:Payolle, la petite piste de ski ou de luge.jpg|Payolle ski resort ==Related pages== * Adour river ==Notes== ==References== ==Other websites== * Commune de Campan - Official site * Lacs des Pyrénées - Vallée de Campan Category:Hautes-Pyrénées",
 "title": "Campan valley"
}