{
 "id": "424656",
 "text": "David Marvin Blake (born January 18, 1970), better known by his stage names DJ Quik or Da Quiksta, is an American rapper and record producer. Blake was born in Compton, California. ==Early life== Blake was born on January 18, 1970 in Compton, California. He was mainly inspired by funk and soul artists,[ allmusic ((( Quik Is the Name > Overview )))] such as Roger Troutman (who even taught him to use the talkbox, which became a trademark for Quik's sound throughout his career) and George Clinton. Out of respect for his beloved friend, Roger Troutman, he retired the talkbox. David's love for music began at age 2, as his mother had an extensive record collection. By age 12 he was already playing instruments. By the age of 21, he was a platinum-selling artist. He began selling homemade mixtapes (notably The Red Tape, 1987) after he received a turntable for his 9th grade graduation. He then began doing shows DJing around Southern California, many of which ended in rival gang related altercations. He was a member of the Tree Top Pirus Bloods. In the 11th grade, Quik dropped out of high school. For a period of about three years he was homeless after his mother lost her home, due to foreclosure. He would later say that after his success in the rap world many of his family members \"popped up\". ==Discography== ===Studio albums=== *Quik Is the Name (1991) *Way 2 Fonky (1992) *Safe + Sound (1995) *Rhythm-al-ism (1998) *Balance & Options (2000) *Under tha Influence (2002) *Trauma (2005) *The Book of David (2011) *The Midnight Life (2014) ===Live albums=== *Greatest Hits: Live at the House of Blues (2006) ===Collaboration albums=== * Blaqkout with Kurupt (2009) * Rosecrans with Problem (2017) ==Filmography== Year Movie Character Notes 2003 Visualism: The Art of Sound into Vision Himself Main Role 2006 Keeping Up with the Steins Himself Cameo 2010 Malice n Wonderland Piano player Year Title Character Notes 2004 Method & Red Himself Episode: \"Something About Brenda\" 2005 Entourage Himself Episode: \"The Bat Mitzvah\" 2007 Everybody Hates Chris Hilton \"Hilly Hill\" Reed Episode: \"Everybody Hates DJ's\" ==Awards and nominations== American Music Awards |- |1992 |Himself |Favorite Rap/Hip-Hop Artist | |- Awards |- |2012 |Himself |Biggest Celebrity DJ | |- ==References== Category:Singers from California Category:Rappers from California Category:1970 births Category:Living people Category:20th-century American rappers Category:American record producers Category:American DJs Category:People from Compton, California Category:Rappers from Los Angeles",
 "title": "DJ Quik"
}