{
 "id": "425171",
 "text": "In 1944, the Polish resistance Home Army rebelled against Nazi occupation of Warsaw. This rebellion is known as the Warsaw Uprising. The resistance Home Army wanted to free Warsaw from Nazi Germany. The resistance army fought against German troops for 63 days. After that, there was no chance of winning, so they surrendered. German troops killed many civilians in the city. After the uprising, the city of Warsaw was destroyed almost completely. At the time of the uprising, the Red Army was stationed on the other side of the river Vistula, which runs through the city of Warsaw. The Uprising was the largest attack done by any European resistance movement of World War II. The Slovak National Uprising, which happened from 29 August to 28 October 1944, is comparable. == Overview == At the same time as the attack, the Soviet Union's Red Army got close to the east of the city and the German forces retreated. However, the Soviets stopped moving forward. This allowed the Germans to destroy the city and defeat the Polish resistance. The Warsaw uprising began on 1 August 1944. It was part of a big plan, Operation Tempest. Operation Tempest started when the Soviet Army got near Warsaw. The goals of the Polish resistance were to push the German troops out of the city. They also wanted to free Warsaw before the Soviets arrived. This would help the Polish Underground State to take control of the city. At the start of the battle, the Polish resistance got control over most of central Warsaw. By 14 September, Polish forces under Soviet command captured the east bank of the Vistula river. Winston Churchill asked Stalin and Franklin D. Roosevelt to help the Polish troops, but the Soviets would not help. Churchill sent over 200 drops of supplies by air. The US Army Air Force sent one drop of supplies by air. About 16,000 members of the Polish resistance were killed and about 6,000 were badly wounded. In addition, between 150,000 and 200,000 Polish civilians were killed. The Germans also found many Jews the Poles were hiding. More than 8,000 German soldiers were killed or went missing, and 9,000 were wounded. During the fighting in the city about a quarter of Warsaw's buildings were destroyed. After the surrender of Polish forces, German troops destroyed 35% of the city. ==Background== By July 1944, Poland had been occupied by Nazi German troops for almost five years. The Polish Home Army was loyal to the Polish government in London. It had planned to attack the Germans. Germany was fighting a group of Allied powers, led by the Soviet Union, the United Kingdom and the United States. At the start, the plan of the Home Army was to join with the invading forces of the Western Allies as they freed Europe from the Nazis. In 1943, the Soviets were about to reach the pre-war borders of Poland before the Allied invasion of Europe got very far. The Soviets and the Poles were both enemies of Nazi Germany. But they had different goals. The Home Army wanted a democratic capitalist Poland that was allied with the West. The Soviet leader Stalin wanted to make Poland a communist country that was allied to the Soviet Union. The Soviets and the Poles did not trust each other. Soviet partisans in Poland often disagreed with Polish resistance troops that were allied to the Home Army. Stalin stopped all Polish-Soviet relations on 25 April 1943 after the Germans told the world about the Katyn massacre of Polish army officers. Stalin refused to admit that he ordered the killings. The Home Army commander, Tadeusz Bór-Komorowski made a plan on 20 November, called Operation Tempest. On the Eastern Front, local units of the Home Army were to attack the German Wehrmacht and help Soviet troops. ==Evening before the battle== On 13 July 1944 as the Soviet attack crossed the old Polish border, the Poles had to make a decision. They could either start to attack the Germans, which might not be supported by the Soviets, or do no attacks and be criticized by the Soviets. The Poles were worried that if Poland was freed from German occupation by the Red Army, then the Allies would not accept the Polish government in London after the war. When the Poles saw the actions of the Soviet forces, they realized they needed to make a decision. In Operation Ostra Brama, NKVD forces shot or arrested Polish officers and forced lower ranks to join the Soviet-controlled Polish forces. On 21 July, the Home Army decided to launch Operation Tempest in Warsaw soon. The plan was intended as a way of showing Poland was its own country and as an attack against the German occupiers. On 25 July, the Polish government-in-exile (against the views of Polish Commander-in-Chief General Kazimierz Sosnkowski) approved the plan for an uprising in Warsaw. In the early summer of 1944, German plans required Warsaw to be the defensive centre of the area. The Germans wanted to hold on to Warsaw no matter how many losses they had. The Germans had built fortifications and sent many new troops. This slowed after the failed '20 July Plot' to kill Adolf Hitler. The German troops in Warsaw were weak and did not feel confident. However, by the end of July, new troops arrived to help the German forces in the area. On 27 July, the Governor of the Warsaw District, Ludwig Fischer, called for 100,000 Polish men and women to build fortifications around the city. The inhabitants of Warsaw did not obey. The Home Army became worried about possible revenge actions by the Germans or mass arrests, which would make it hard for the Poles to start an attack. The Soviet forces were approaching Warsaw, and Soviet-controlled radio stations called for the Polish people to attack the Germans. On 25 July, the Union of Polish Patriots made a radio broadcast from Moscow. It told Poles to attack the Germans. On 29 July, the first Soviet tanks reached the edges of Warsaw. They were counter-attacked by two German Panzer Corps: the 39th and 4th SS. On 29 July 1944 Radio Station Kosciuszko located in Moscow told Poles to \"Fight The Germans!\". Bór-Komorowski and several senior officers held a meeting on that day. Jan Nowak-Jeziorański, who had arrived from London, said support from the Allies would be weak. On 31 July, the Polish commanders General Tadeusz Bór- Komorowski and Colonel Antoni Chruściel ordered the Home Army forces to be ready by 17:00 the following day. ==Wola massacre== During the uprising, Heinrich Himmler had given the order to storm Wola, a part of Warsaw. The rebels were holding this quarter. Himmler ordered that all people in Wazaw, who were not German, must be killed. This order was applicable to both civilians, and fighters, and also did not take into account if the people supported the uprising. With this order, Himmler wanted to break down the resistance of the Polish people against the German occupation. As a result, there were mass killings of people, mostly between August 5 and August 7. Estimates are that between 20,000 and 30,000 civilians were killed. in these three days. According to sources, about 20 German soldiers were killed, about 40 were wounded. Until August 12, about 50,000 Polish civilians lost their lives in Wola. ==References== Category:1944 in Europe Category:1940s in Poland Category:European battles of World War II Category:History of Warsaw Category:September 1944 events Category:October 1944 events Category:Winston Churchill",
 "title": "Warsaw Uprising"
}