{
 "id": "425284",
 "text": "Survivor Series (2007) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on November 18, 2007 at the American Airlines Arena in Miami, Florida. It was the 21st Survivor Series event held by WWE. In the main event for the SmackDown! brand, Batista defeated The Undertaker in a Hell in a Cell match to keep his World Heavyweight Championship. Raw's main match saw Randy Orton defeat Shawn Michaels to keep his WWE Championship, and in ECW's title match, ECW Champion CM Punk kept his title against John Morrison and The Miz in a Triple Threat match . ==Matches== No. Results Stipulations Times 1 CM Punk (c) defeated John Morrison and The Miz Triple threat match for the ECW Championship 7:56 2 Mickie James, Maria, Torrie Wilson, Michelle McCool and Kelly Kelly defeated Beth Phoenix, Jillian Hall, Melina, Victoria and Layla 10-Diva tag team match 4:42 3 Lance Cade and Trevor Murdoch (c) defeated Hardcore Holly and Cody Rhodes Tag team match for the World Tag Team Championship 7:18 4 Team Triple H (Triple H, Jeff Hardy, Rey Mysterio and Kane) defeated Team Umaga (Umaga, Mr. Kennedy, Montel Vontavious Porter, Finlay and Big Daddy V) (with Matt Striker) Four-on-five Survivor Series elimination match 22:08 5 The Great Khali (with Ranjin Singh) defeated Hornswoggle (with Mr. McMahon and Shane McMahon) by disqualification Singles match 3:16 6 Randy Orton (c) defeated Shawn Michaels Singles match for the WWE Championship 17:48 7 Batista (c) defeated The Undertaker Hell in a Cell match for the World Heavyweight Championship 21:24 === Survivor Series elimination match === Eliminated Wrestler Eliminated by Method Time Kane Big Daddy V Pinfall 05:25 Rey Mysterio Umaga 09:14 MVP Jeff Hardy 12:49 Mr. Kennedy Triple H 14:20 Big Daddy V 15:24 Finlay 21:14 Umaga Jeff Hardy 22:08 Jeff Hardy and Triple H (Team Triple H) ==References== ==Other websites== *Official Survivor Series 2007 website Category:2007 in American television Category:2007 in professional wrestling Category:Sports in Miami Category:Survivor Series Category:2007 in Florida Category:21st century in Miami Category:November events",
 "title": "Survivor Series (2007)"
}