{
 "id": "425447",
 "text": "Bohol is the tenth-largest island of the Philippines and the main island of the Bohol province. It is part of the Region VII (Central Visayas) in the Visayas island group. The Philippine Tarsier, one of the smallest primate in the world, is one endemic animal of southern Philippines, including the island of Bohol. ==Geography== The island of Bohol has an oval shape and is surrounded by 73 smaller islands; the larger of these small islands are Panglao, in the southwest in front of the city of Tagbilaran, and Lapining, in the northeast. The main island of Bohol has an area of and a coastline of . It lies southeast from Cebu Island across the Cebu Strait (sometimes called Bohol Strait) and southwest from Leyte, separated by the Camotes Sea and Canigao Channel. Bohol is also located north of Mindanao with the Bohol Sea or Mindanao Sea between them. The terrain of Bohol is basically hilly and about half the island is covered in limestone. The interior is a large plateau. In the centre of the island, mainly in the municipalities of Sagbayan, Batuan and Carmen, are the Chocolate Hills, over 1,270 hills cone-shaped hills over an area of . The main mountain range of the island is Sierra Bullones that is along the south coast. It begins near Loboc, goes to the east and then to the northeast to end near Candijay. The highest point of this range and in the entire province is Mount Mayana (). ===Rivers=== There are four main rivers that flow through Bohol: * Loboc flows from the centre of the island to the southeastern coast. * Inabanga, the largest river of the island, runs in the northwestern part of the province. * Abatan flows in the southwest; and * Ipil river flows in the north. ===Climate=== The climate of the island of Bohol is a warm tropical climate (Köppen climate classification Af); it is typically hot and wet throughout the year and rainfall is both heavy and frequent. ==Gallery== File:Chocolate Hills Bohol.JPG|Aerial view of Bohol's interior Bohol Hills, Tree, Philippines.jpg|Bohol Hills File:Loboc River.jpg|River cruise on the Loboc River File:Tarsius syrichta.jpg|Philippine Tarsier File:Church Corella.jpg|Catholic Church in Corella, Bohol Loboc, Museum of Loboc, Loboc Church, Bohol, Philippines.jpg|Museum of Loboc ==References== ==Related pages== * Central Visayas ==Other websites== * Visayan Silent Gardens - Bohol Island * Bountiful Bohol * Bohol, Philippines - Tourism informations Category:Islands of the Philippines",
 "title": "Bohol (island)"
}