{
 "id": "425489",
 "text": "Survivor Series (2004) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on November 14, 2004 at the Gund Arena in Cleveland, Ohio. It was the 18th Survivor Series event held by WWE. The main event match for the Raw brand was a 4 on 4 Survivor Series match, where Team Orton (Randy Orton, Chris Benoit, Chris Jericho, and Maven) defeated Team Triple H (Triple H, Edge, Batista, and Gene Snitsky). In the main match for SmackDown!, John \"Bradshaw\" Layfield (JBL) defeated Booker T to keep his WWE Championship. ==Matches== No. Results Stipulations Times 1 La Résistance (Sylvain Grenier and Robért Conway) (c) defeated Rosey and The Hurricane Tag team match for the World Tag Team Championship 4:59 2 Spike Dudley (c) defeated Billy Kidman, Chavo Guerrero, and Rey Mysterio Fatal Four- Way match for the WWE Cruiserweight Championship 9:09 3 Shelton Benjamin (c) defeated Christian (with Tyson Tomko) Singles match for the WWE Intercontinental Championship 13:23 4 Team Guerrero (Eddie Guerrero, Big Show, Rob Van Dam, and John Cena) defeated Team Angle (Kurt Angle, Carlito Caribbean Cool, Luther Reigns and Mark Jindrak) (with Jesús) Four-on-four Survivor Series elimination match 12:26 5 The Undertaker defeated Heidenreich (with Paul Heyman) Singles match 15:58 6 Trish Stratus (c) defeated Lita by disqualification Singles match for the WWE Women's Championship 1:24 7 John \"Bradshaw\" Layfield (c) (with Orlando Jordan) defeated Booker T Singles match for the WWE Championship 14:43 8 Team Orton (Randy Orton, Chris Benoit, Chris Jericho, and Maven) defeated Team Triple H (Triple H, Edge, Batista, and Snitsky) (with Ric Flair) Four-on-four Survivor Series elimination match 24:31 === Survivor Series elimination matches === ==== SmackDown! ==== Eliminated Wrestler Eliminated by Team Method Time Carlito Caribbean Cool N/A Team Angle Left the arena 0:00 Rob Van Dam Kurt Angle Team Guerrero Pinfall 8:45 Mark Jindrak Eddie Guerrero Team Angle 9:10 Luther Reigns Big Show 10:26 Kurt Angle 12:26 Eddie Guerrero, Big Show and John Cena (Team Guerrero) ==== Raw ==== Eliminated Wrestler Eliminated by Team Method Time Chris Benoit Edge Team Orton Pinfall 7:24 Batista Chris Jericho Team Triple H 10:39 Gene Snitsky N/A Disqualification 16:05 Maven Triple H Team Orton Pinfall 16:50 Chris Jericho Edge 19:04 Edge Randy Orton Team Triple H 22:59 Triple H 24:31 Randy Orton (Team Orton) ==References== ==Other websites== *Official Survivor Series 2004 website Category:2004 in American television Category:2004 in professional wrestling Category:Sports in Cleveland Category:Survivor Series Category:2000s in Cleveland, Ohio",
 "title": "Survivor Series (2004)"
}