{
 "id": "425443",
 "text": "Survivor Series (2005) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on November 27, 2005 at the Joe Louis Arena in Detroit, Michigan. It was the 19th Survivor Series event held by WWE. In the first of two main event matches, John Cena defeated Kurt Angle to keep his WWE Championship. The second main event was a 5-on-5 Survivor Series match, where Team SmackDown! (Batista, Rey Mysterio, John \"Bradshaw\" Layfield (JBL), Bobby Lashley, and Randy Orton) defeated Team Raw (Shawn Michaels, Kane, The Big Show, Carlito, and Chris Masters). In another match, Triple H defeated Ric Flair in a Last Man Standing match. ==Matches== No. Results Stipulations Times 1 Juventud (with Psicosis and Super Crazy) defeated Simon Dean Singles match 4:10 2 Booker T (with Sharmell) defeated Chris Benoit Singles match 14:39 3 Trish Stratus (c) (with Mickie James) defeated Melina (with Joey Mercury and Johnny Nitro) Singles match for the WWE Women's Championship 6:30 4 Triple H defeated Ric Flair Last Man Standing match 27:01 5 John Cena (c) defeated Kurt Angle Singles match for the WWE Championship with Daivari as the special guest referee 13:56 6 Theodore Long (with Palmer Cannon) defeated Eric Bischoff Singles match 5:23 7 Team SmackDown! (Batista, Rey Mysterio, John \"Bradshaw\" Layfield, Bobby Lashley, and Randy Orton) defeated Team Raw (Shawn Michaels, Kane, Big Show, Carlito, and Chris Masters) Five-on-five Survivor Series tag team elimination match 24:01 === Survivor Series elimination match === Eliminated Wrestler Eliminated by Team Method Time Bobby Lashley Shawn Michaels Team SmackDown! Pinfall 7:17 Kane Batista Team Raw 11:41 Batista Big Show Team SmackDown! 12:27 Big Show Rey Mysterio Team Raw 14:28 Carlito John \"Bradshaw\" Layfield 17:35 Chris Masters Rey Mysterio 19:12 Rey Mysterio Shawn Michaels Team SmackDown! 20:30 John \"Bradshaw\" Layfield 20:44 Shawn Michaels Randy Orton Team Raw 24:01 Randy Orton (Team SmackDown!) ==References== ==Other websites== *Official Survivor Series 2005 website Category:2005 in American television Category:2005 in professional wrestling Category:Sports in Detroit Category:Survivor Series Category:2000s in Detroit",
 "title": "Survivor Series (2005)"
}