{
 "id": "425689",
 "text": "Survivor Series (2003) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on November 16, 2003 at the American Airlines Center in Dallas, Texas. It was the 17th Survivor Series event held by WWE. The main event match was for Raw's World Heavyweight Championship. Goldberg defeated Triple H to keep his title. The main match for the SmackDown! brand was a Buried Alive match, where Mr. McMahon defeated The Undertaker with the help of Kane. In a traditional 5-on-5 Survivor Series match, Team Bischoff (Chris Jericho, Christian, Randy Orton, Scott Steiner and Mark Henry) defeated Team Austin (Shawn Michaels, Rob Van Dam, Booker T, Bubba Ray Dudley, and D-Von Dudley). Also, an Ambulance match took place, where Kane defeated Shane McMahon. ==Matches== No. Results Stipulations Times 1 Tajiri (c) (with Akio and Sakoda) defeated Jamie Noble Singles match for the WWE Cruiserweight Championship 4:13 2 Team Angle (Kurt Angle, Chris Benoit, John Cena, Hardcore Holly, and Bradshaw) defeated Team Lesnar (Brock Lesnar, Big Show, Matt Morgan, Nathan Jones and A-Train) Five-on-five Survivor Series elimination match 13:15 3 Molly Holly (c) defeated Lita Singles match for the WWE Women's Championship 6:48 4 Kane defeated Shane McMahon Ambulance match 13:34 5 The Basham Brothers (Doug and Danny Basham) (with Shaniqua) (c) defeated Los Guerreros (Eddie and Chavo Guerrero) Tag team match for the WWE Tag Team Championship 7:31 6 Team Bischoff (Chris Jericho, Christian, Randy Orton, Scott Steiner and Mark Henry) defeated Team Austin (Shawn Michaels, Rob Van Dam, Booker T, Bubba Ray Dudley, and D-Von Dudley) Five-on-five Survivor Series elimination match 27:27 7 Mr. McMahon defeated The Undertaker Buried Alive match 11:59 8 Goldberg (c) defeated Triple H (with Ric Flair) Singles match for the World Heavyweight Championship 11:44 === Survivor Series elimination matches === SmackDown! Eliminated Wrestler Team Method Time Hardcore Holly N/A Team Angle Disqualification 0:00 A-Train Bradshaw Team Lesnar Pinfall 0:27 Bradshaw Big Show Team Angle 0:48 Matt Morgan Kurt Angle Team Lesnar 9:11 Nathan Jones Submission 9:31 Kurt Angle Brock Lesnar Team Angle Pinfall 9:43 Brock Lesnar Chris Benoit Team Lesnar Submission 11:43 Big Show John Cena Pinfall 13:15 John Cena and Chris Benoit (Team Angle) Raw Eliminated Wrestler Eliminated by Team Method Time Scott Steiner Booker T Team Bischoff Pinfall 7:28 Booker T Mark Henry Team Austin 7:57 Mark Henry Rob Van Dam, D-Von Dudley, Bubba Ray Dudley Team Bischoff 10:03 Rob Van Dam Randy Orton Team Austin 12:06 D-Von Dudley Chris Jericho 13:49 Bubba Ray Dudley Christian 16:53 Christian Shawn Michaels Team Bischoff 20:28 Chris Jericho 23:58 Shawn Michaels Randy Orton Team Austin 27:27 Randy Orton (Team Bischoff) ==References== ==Other websites== *Official Survivor Series 2003 website Category:2003 in American television Category:2003 in professional wrestling Category:Sports in Dallas Category:Survivor Series Category:2003 in Texas Category:21st century in Dallas",
 "title": "Survivor Series (2003)"
}