{
 "id": "425731",
 "text": "Section.80 is the first studio album by Kendrick Lamar. It was released on July 2011 through Top Dawg Entertainment. Its lyrics tell stories about two different women \"Keisha\" and \"Tammy\". It was supported by the promotional conscious hip hop song \"HiiiPoWeR\". ==Critical Response== The album sold very well. It caught the attention of Dr. Dre who discovered Kendrick Lamar and signed him to Aftermath Records and Interscope Records. ==Music and Lyrics== The album Section.80 is a concept album which lyrics revolve around two different women: \"Keisha\" and \"Tammy\". Keisha is a fictional prostitute who seeks prostitution only to her demise. Tammy is woman who had a boyfriend, but leaves him after discovering he was unfaithful. She then kills him. She also talks about another women going through the same thing. These two women then become lesbian and become afraid of all males. HiiiPower is a protest song and was the only single released from Section.80, The music video was released with the begin showing a statement from Lamar, saying that he was ordered to. The statement may be meant figuratively. The lyrics to the album deal with racism as well as many other topics. Lamar said in an interview that Section.80 is for people who are from the 1980s, which may explain the title. Lamar later admitted that he hated making the album, referring to it as \"goofy ahh\". ==Controversy== The album cover shows ammuntion to a rifle with the Bible covered with weed and a lighter. This sparked some controversy, saying it was at it was disrespectful to the Bible. Lamar later explained that no disrespect was meant towards the Bible. ==Tracklisting== *\"Fuck Your Ethnicity\"-3:44 *\"Hol'Up\"-2:53 *\"A.D.H.D.\"-3:35 *\"No Makeup (Her Vice)\"-3:55 *\"Tammy's Song (Her Evils)\"-2:41 *\"Chapter Six\"-2:41 *\"Ronald Reagan Era (His Evils)\"-3:36 *\"Poe Mans Dreams (His Vice)\"-4:21 *\"The Spiteful Chant\"-5:20 *\"Chapter Ten\"-1:15 *\"Keisha's Song (Her Pain)\"-3:47 *\"Rigamortis\"-2:48 *\"Kush & Corinthians (His Pain)\"-5:04 *\"Blow My High (Members Only)\"-3:35 *\"Ab-Soul's Outro\"-5:50 *\"HiiiPoWeR\"-4:39 ==References== Category:2011 albums Category:Hip hop albums Category:Kendrick Lamar albums",
 "title": "Section.80"
}