{
 "id": "425739",
 "text": "Suicide prevention is when local organizations, mental health doctors and nurses, and psychologists try to stop people from attempting suicide. One thing to do is stop people who are about to attempt suicide. Another way to stop people from attempting suicide is to treat the symptoms of depression, help people to cope during a time of crisis, reduce the issues that put people at risk of attempting suicide, and give people hope for a better future. Suicide is not just a medical or mental health issue. Making sure people have friends and family to help them and taking away dangerous items can also stop people from attempting suicide. In the U.S., there is a National Strategy for Suicide Prevention. It was created by the Department of Health and Human Services in 2001. Suicide prevention activities include messages aimed at people and messages for everyone in the community.\"Suicide Prevention: at what level does it work?\", Bertolote, Jose. World Psychiatry. 2004 October; 3(3): 147-151. ==National strategies== In 2001, the U.S. Department of Health and Human Services created a National Strategy for Suicide Prevention. The document looks at how suicide can be stopped in the community. The strategy does not say how to help individual people. The document has the following goals: # Let people know that suicide can be prevented # Develop support for preventing suicide # Make sure people do not feel bad about getting help for feeling suicidal # Start community suicide prevention programs # Make it harder for people to get dangerous items like guns # Train doctors and nurses on how to know when a person might attempt suicide # Help doctors and nurses to get better at helping people who are suicidal # Creating more links between community services # Make sure that TV news and newspapers talk about suicide in the right way # Encourage research on suicide and suicide prevention # Create more systems to watch people who might attempt suicide ===Specific strategies=== To help stop people from attempting suicide, many methods have been used: * Confidential telephone help. * Encouraging optimism and connections with family and friends. * Educating people about suicide, including risk factors, warning signs and help. * Training doctors and nurses and creating crisis phone lines. * Reducing domestic violence and drug abuse * Reducing access to toxic substances and handguns * Reducing amount of medicine in packages of non-prescription medicines e.g. aspirin. * Trying to help high- risk groups. * Research. (see below) It has also been suggested that news media can help prevent suicide by linking suicide with negative results, such as pain for the pain felt by the family. ==Interventions== Many methods of stopping suicide exist. These include talking to the person, looking for risks, and making it harder for people to get dangerous items. ===Direct talks=== The World Health Organization says a good way to help people who are suicidal is to talk to them. The person can also be asked about depression, and if they plan to attempt suicide. \"Preventing Suicide - A Resource for Primary Health Care Workers\" (PDF), World Health Organization, Geneva, 2000, p. 13. Talking with people about suicide does not create suicidal thoughts. The doctor has to show concern and compassion. Doctors should try to reduce sadness and let the person know that people care. The WHO says not to not say everything will be all right. However, some people who have talked about suicide have attempted it. This means that doctors need to make sure the person is comfortable talking about his or her feelings. ===Screening=== The U.S. Surgeon General says there are ways to find out which people are at risk of suicide. This may be the best way to stop children and adolescents from attempting suicide.Office of the Surgeon General: The Surgeon General's Call To Action To Prevent Suicide 1999 There are tools like questionnaires to help doctors to know who is at risk. One example is the Beck Hopelessness Scale. These questionnaires are good for finding adolescents and young adults who might want to attempt suicide.Rory C. O'Connor, Stephen Platt, Jacki Gordon: International Handbook of Suicide Prevention: Research, Policy and Practice, p. 510 Doctors should interview people who seem to be at risk.Rory C. O'Connor, Stephen Platt, Jacki Gordon, International Handbook of Suicide Prevention: Research, Policy and Practice, p.361; Wiley-Blackwell (2011), Questionnaires may not always tell doctors which person will attempt suicideAlan F. Schatzberg: The American Psychiatric Publishing textbook of mood disorders, p. 503: American Psychiatric Publishing; (2005) Asking about suicide does not increase the risk. In approximately 75 percent of suicides, the people had seen a doctor in the last year. About 45 to 66 percent of people saw a doctor the month they committed suicide. About 33 to 41 percent of those who committed suicide had used mental health services in the prior year. About 20 percent used mental health services in the month before they committed suicide. This shows that doctors need to get better at knowing which people will attempt suicide. ===Lethal means reduction=== Making it hard for people to get dangerous things is an important part of suicide prevention. Making it hard for people to get dangerous items can lead to less suicides. Putting up fences at bridges and cliffs reduces suicides. Putting up signs or increasing patrols is not so helpful One example of making dangerous items less available is coal gas in the United Kingdom. Until the 1950s, the most common way of committing suicide in the UK was poisoning by inhaling coal gas. In 1958, natural gas was used instead. Natural gas is much less dangerous. So less people committed suicide.The Coal Gas Story, Kreitman, N. The Coal Gas Story: United Kingdom suicide rates, 1960-1971. Br J Prev Soc Med. 1976 Jun;30(2):86-93. In the United States,studies show that firearms increase suicide risk. Because guns are quick and more dangerous than other suicide method, they lead to more suicides. ==Treatment== Treatments to reduce the risk of suicide can include medical approaches,Randolph B. Schiffer, Stephen M. Rao, Barry S. Fogel, Neuropsychiatry: Neuropsychiatry of suicide, pp. 706-713, (2003) prescription medicine, and talk therapy. About 10% of people with psychiatric problems may have a medical condition that the doctor does not know about which is causing their symptoms. About 50% may have a medical condition that the doctor does not know about which is making their symptoms worse.Chuang L., Mental Disorders Secondary to General Medical Conditions; Medscape;2011 Illegal drugs and prescribed medications may also cause problems.Andreas P. Otte, Kurt Audenaert, Kathelijne Peremans, Nuclear medicine in psychiatry: Functional imaging of Suicidal Behavior, pp.475-483, Springer (2004); Treating medical conditions may reduce the risk of suicidal ideas.Patricia D. Barry, Suzette Farmer; Mental health & mental illness,p.282, Lippincott Williams & Wilkins;(2002) Recent research shows that lithium lowers the risk of suicide for people with bipolar disorder. Lithium also lowers the suicide risk in those with regular depression. Talk therapy can reduce suicidal ideas such as Dialectical behavior therapy (DBT). Benefits include a reduction in self-harm behaviour and suicidal ideas.Canadian Agency for Drugs nd technology in Health: Dialectical Behaviour Therapy in Adolescents for Suicide Prevention: Systematic Review of Clinical- Effectiveness, CADTH Technology Overviews, Volume 1, Issue 1, March 2010 National Institute of Mental Health: Suicide in the U.S.: Statistics and Prevention Cognitive Behavior Therapy for Suicide Prevention (CBT-SP) helps adolescents at high risk of suicide attempts. ===Respect and self-esteem=== The World Health Organization states that \"worldwide, suicide is among the top five causes of mortality in the 15- to 19-year age group. In many countries it ranks first or second as a cause of death among both boys and girls in this age group\". The organization says teens need help with difficult and stressful life situations.\" It also says that teachers need to prevent bullying and violence at schools. ===Support groups=== Many non-profit organizations exist that try to prevent suicide. Examples include the American Foundation for Suicide Prevention in the United States, which provide crisis hotlines. In addition, some groups such as To Write Love on Her Arms use social media to reach more people. ==Related pages== * List of suicide crisis lines * The Jed Foundation * The Trevor Project * National Suicide Prevention Lifeline * Self- esteem ==References== ==Other websites== *CDC website on Suicide Prevention *The Suicide Prevention Resource Center (SPRC) *Stamp Out Suicide! *The JED Foundation *American Association of Suicidology *American Foundation for Suicide Prevention *International Association for Suicide Prevention *Samaritans of Singapore Category:Suicide Category:Prevention",
 "title": "Suicide prevention"
}