{
 "id": "425867",
 "text": "The Syrian civil war, also known as the Syrian Uprising (), or Syrian Crisis (),الأزمة السورية United Nations, 4 September 2012 is an ongoing armed conflict in the Syrian Arab Republic. The conflict started in 2011 after Bashar al-Assad's tyranny brutally cracked down on marches against him in Daraa, sparking off the 13-year civil war. Since then, it has developed to be one of the deadliest conflicts in the 21st century. More than 614,000 people have been killed, and more than 5 million have been displaced, forming the largest refugee crisis in the world. Heavy fighting started again with a major rebel offensive in the northwest led by Tahrir al-Sham in November 2024, during which Aleppo was seized. After that came the Fall of Damascus. ==Background== ===Minority rule=== Syria has a diverse population regarding faith, ethnic and language minorities creates more tension in the country. The country is a Sunni Muslim majority, with Shia sects forming different branches, such as the Alawi. Around 10% of the Syrian population is estimated to belong to the Alawi community. Even though they belong to the broader Shia, they have a secretive and exclusive community. Druze, Kurdish, Christian groups, and other minorities are also found in the country. The fact that a minority group rules a majority also contributed to the growing tension. ===Political instability=== In 1943 the newly independent Syria did not have a central figure to lead the country. Provisional governments followed each other while contesting groups tried to rule the country. The Ba'ath Party was constructed around the Nahda a and started a political union with Egypt under the United Arab Republic. In the 1963 coup d'état, the Ba'ath Party targeted the UAR and appointed a new president. In 1970, Alawi general Hafez al-Assad took control of the country that year with a coup and became president. Hafez al-Assad's regime was supposedly secular, although coming from an Alawi family himself. The growing income gap in society and the stagnant economy fuelled opposition against the regime, particularly among the Sunni groups. He ruled the country for the next 30 years until his passing. In 2000, his son Bashar al-Assad followed him as Syria's president. He promised political and economic reforms that never happened, which only increased the dissatisfaction of the Syrian nation. He strengthened his grip on power via coercion and symbolism, which resulted in a massive personality cult around him. He held parades to glorify the leader, which required a need for obedience and affection to the ruler from society regardless of the true feelings and disagreement of the people. ===Environmental issues=== Between 2006 and 2010, Syria experienced the worst drought in its history. The drought intensified the already existing water and agricultural problems. It caused huge agricultural failures and livestock mortality. His policies contributed to the severity of the drought by exploiting the already limited land and water resources. Approximately 1.5 million people have migrated from rural farming areas to the peripheries of urban centres. Those areas were already burdened by the huge population growth caused by the Iraqi refugees arriving between 2003 and 2007. The drought contributed to the rising food prices and the decline of the country's GDP. Adequate water supply is still a concern in the country. ===Socioeconomic issues=== In the 1990s and 2000s, Syria's economy was in crisis because, among other economic failures, oil revenue and support from other Arab countries shrunk over the years. As a result, the working classes were impoverished throughout the years, and inequality rates increased. Unemployment rates were high, especially among the youth. The drought took away the source of income for many agrarian Syrians. When villagers relocated to the big cities, they struggled to find employment, which fueled growing resentment. The nation struggled with high inequality and rampant corruption since only the privileged families who were tied to Assad profited from privatization. 1.5 million Syrians became internally displaced by drought on top of the 1.5 million Iraqi refugees. By 2010 20% of Syria's population was constituted by IDPs. The country experienced a 50% population increase from 2002 to 2010, which further increased the strain on its resources. This led to illegal settlements, overcrowding, and increase in crime. Assad neglected these problems, which grew the people's frustration. Most importantly, Syrian citizens were fed up with the political oppression by Assad's regime. ===Arab Spring=== The Syrian uprising that followed was part of the Arab spring. In other Arab countries before 2011, discontent was also rising about the current political and economic environment. In December 2010, a Tunisian man named Mohamed Bouazizi set himself on fire after being repeatedly mistreated by Assad's officials. This led to considerable civil unrest in the country and eventually to mass demonstrations. Ben Ali, Tunisia's president, eventually resigned and fled. Surrounding Arab countries followed and in many countries, the people started demonstrating, demanding political change. It did not take long for the Syrian people to follow these examples. ==Beginning== The Syrian civil war started on 15 March 2011 with demonstrations in Daraa, demanding Assad to resign and transition to democracy. These demonstrations resulted from rising discontent among Syrian citizens regarding what Syria had become under the regime of President Assad. In March 2011, children between 10 and 15 wrote antiregime graffiti on a wall saying, \"It's your turn, Doctor\". The regime quickly arrested these children and tortured them in prison. Consequently, demonstrations started to erupt in Daraa, demanding the immediate release of these children. The regime tortured to death one of the 13-year-old boys they captured. His name was Hamza al-Khatib, and he became one of the early symbols of the brutal oppression the nation is fighting against. The demonstrations in Daraa escalated after the Syrian military started using water cannons, tear gas and live bullets against the protesters. The Syrian regime responded with increasingly more violence. Bashar al-Asad spoke in front of the Parliament, which was broadcasted on television after the first demonstrations and claimed that the protesters were trying to destroy Syria and \"enforce an Israeli agenda.\" Consequently, demonstrations spread across the country, reaching Aleppo, the second-largest city in Syria, resulting in the killing and detention of hundreds of protestors. This resulted in the beginning of an armed insurgency, starting with forming of the Free Syrian Army in July 2011, consisting of defected army soldiers and civilian volunteers. Battles took place in many towns and cities across the country. The United States imposed economic sanctions on Syria two months after the demonstrations started. As the military opposition became stronger and more organized, the United Nations declared the Syrian uprising a civil war in December 2011. ==Fall of Ba'athist rule== A myriad of factors, including the COVID-19 pandemic * * * and pro-Russian Western leftist opposition to NATO intervention, * * * * * * * * * * had made the civil war a frozen conflict for several years until December 2024. * * * * * In December 2024, regrouped rebel forces launched large-scale multi-pronged offensives unseen for a decade amid weakened local Russian and Iranian military presence, * * * * * reportedly due to the countries' respective involvement in the invasion of Ukraine and conflict with Israel. Aleppo, Homs and Daraa, * * * * * three of the largest Syrian cities, fell to the rebels within a week, who also encircled Syria's capital Damascus. * * * * * On December 8, 2024, Bashar al-Assad fled the capital as the rebels stormed in. * * * * * Assad's protecting power Russia claimed that Assad had left Syria * * * * * for Moscow. * * * * * Rebels inside the capital announced the end of the six-decade Ba'athist rule in Syria. * * * * * ===Transitional government=== The united opposition announced that Mohammed al-Bashir, a previous leader of the provisional Salvation Government in Turkish-controlled northwest Syria, was named as the head of the transitional government, expected to serve until March 2025. * * * * * ==Foreign involvement== Critics argue that Western intervention at the time had used too much of an optimistic approach. Most Western politicians thought President Assad and his regime would fall within a year. They completely underestimated the strength of his regime. This is why the West did not intervene early on in the conflict. Only when the Islamic State gained territory did the West become more actively engaged in the conflict because this threatened their national security. However, there was never a defined plan, only the wish to remove the president and his current regime at the time from power. Russia and China, on the other hand, were always more actively engaged in the conflict, supporting the Syrian regime. ===Actors=== ====Syrian Armed Forces==== Firstly, the most important actor in the Syrian civil war is the Syrian Armed Forces under Assad's tyranny. They are fighting in support of Assad's regime and against the armed opposition forces. Both the United Nations Human Rights Council and the Syrian Network for Human Rights have concluded that the Syrian Armed Forces are guilty of the most and worst human rights abuses. Following huge amounts of defections, the Syrian Armed Forces have since late 2015 depended largely on hired militias and volunteers from outside of Syria. ====Syrian opposition factions==== Secondly, the opposition forces consist of a big number of factions, with the Free Syrian Army as an important coalition of several of these militias. The Free Syrian Army was founded by defecting Syrian Army officers with the goal to protect civilians and to destroy Assad's tyranny. It claimed to be \"the military wing of the Syrian opposition\". Between 2011 and 2015, the Free Syrian Army lost most of its influence because of a lack of funding, infighting and was gradually taken over by rival Islamist groups. After an intervention by the Turkish military in 2016, most of the Free Syrian Army became the Syrian National Army, also known as the Turkish-backed Free Syrian Army. The Syrian National Army became a coalition of opposition forces, coordinated and funded by Turkey. The goals of the Syrian National Army are to counter the forces under Assad's tyranny, the Syrian Democratic Forces and Islamist extremist forces, including the Islamic State and Hay'at Tahrir al- Sham. ====Syrian Democratic Forces (SDF)==== Thirdly, the Syrian Democratic Forces (SDF) is a Kurdish-led military alliance governing the self-declared Autonomous Administration in North and East Syria commonly referred to as Rojava. The main goal is to establish a democratic and non-religious system in Syria. Therefore, they have mostly been fighting ISIL together with Western countries. Furthermore, they are opposed to the Syrian National Army, as the Turkish forces consider the Kurdish leadership of the SDF a terrorist organization and actively fight them. Within the SDF, their are Kurdish militant groups fighting for them such as the YPG and the PKK. ====Islamist militias==== Fourthly, numerous Islamist groups have been active in the Syrian Civil War. For example, in late 2011 the Islamist group al-Nusra Front began to have a bigger role in the forces. However, the most influential and effective Islamist group has been the Islamic State (ISIL), also known as the Islamic State of Iraq and Syria (ISIS). They emerged in April of 2013 and as of 2014, they effectively were in control of 30% of Syria and 40% of Iraq. In July 2014, they changed their name to the Islamic State, shorthanded ISIL in their language. The ISIL has been fought by the Turkish-backed Syrian National Army, the Syrian Democratic Forces, forces of Assad's tyranny and a US-led coalition. Consequently, by 2017 it had lost 95% of its territory and in 2018 it was declared officially defeated by the United States. This seems not to be entirely true, as more recent news has shown that IS is making a comeback. In 2022, already several attacks claimed by the Islamic State have been documented. ISIL has been widely known for its terroristic regime, including many human rights abuses, such as mass public executions and torture. The group attracted many young Islamists from all over the world due to their anti-western and extremist Islamic attitude. Consequently, they have also done terrorist attacks in the West, which is why the West has been so focused on actively fighting IS. ===Territorial Control=== By July 2013, Assad's tyranny controlled approximately 30–40% of the country's territory and 60% of the Syrian population. In the beginning of 2022, the Assad regime is back to controlling more than 63% of Syrian territory, while the opposition forces control about 11% and the Syrian Democratic forces around 26%. ===Proxy wars=== ====USA vs. Russia==== Currently, the war cannot simply be described as a domestic two-sided war but must be described as several overlapping proxy wars. The first one of these is between the United States and Russia. Between 2015 and 2024, Russia provide vital support for Assad's tyranny. The main reason for this is that stability in the region will make it easier for Russia to exert its influence. Furthermore, it is a perfect opportunity to display Russia's military capabilities. On the other hand, the United States and NATO are partly involved in the war to counter this Russian influence in the MENA region. ====Saudi Arabia vs. Iran==== The second proxy war is between Iran and Saudi Arabia. Iran has supported Assad's tyranny since the start of the conflict. The reasons for this are that Iran and Syria have long been allies, and the survival of the Syrian regime is essential for Iran's geopolitical interests. Iran has supported the Syrian regime by providing military supplies, helping pro-Assad militias and sending Hezbollah troops. Saudi Arabia, on the other hand, has since 2012 been funding and arming the rebels, together with Qatar. The main reason for this is to counter Iranian power and achieve regional dominance. ====Turkey vs. Russia==== Moreover, Turkey is an essential foreign actor in the war. Turkey aims to prevent the Syrian Democratic Forces from successfully creating an independent state. As the leadership of the SDF, the Peoples Defense Unit (YPG), is largely Kurdish, creating an independent state would set an example for Kurds in Turkey. This would threaten Turkey's territorial integrity. Furthermore, Turkey considers the YPG to be a terrorist organization. Turkey has been a dominant force in Northern Syria throughout the war, providing the opposition with military aid, building governance institutions and funding infrastructure projects. ===Aid=== Several cease-fire attempts were made during the civil war. The first one was by Kofi Annan, who worked as the representative of the United Arab League. He set out a peace plan, but even after he met with Bashar al- Assad, the fighting continued. The plan for a cease-fire was disregarded. At the time, the casualties already included 17,000 deaths. Eleven thousand nine hundred were civilians, 900 military defectors and 4,350 pro-Assad soldiers. Shortly after the failure of the peace plan, Annan urged Iran to take a greater role in helping to stop the war. The United Kingdom and France have also been significant actors in the conflict, as they have been providing aid to several moderate opposition forces. Turkey and Iran also claimed to have recruited Pakistani mercenaries to fight for opposing sides, which could have also resulted in them fighting each other. ==Human rights abuses== Several institutions have documented many grave human rights abuses throughout the conflict, including Human Rights Watch, the United Nations High Commissioner for Human Rights and the Syrian Network for Human Rights. International organizations accused both government and opposition forces of human rights violations. According to the UN, Assad committed the most atrocities. ===War crimes=== Forces of Assad's tyranny committed a series of atrocities, including numerous massacres, starving sieges * * * * * and chemical attacks, * * * * * * * * * * The Syrian-Russian-Iranian axis is guilty of most atrocities, primarily terror bombing of civilian infrastructure. The forces of Assad's tyranny kidnapped, tortured and slaughtered hundreds of thousands of Syrians. Since the beginning of the war, almost 15,000 Syrians have died of torture, while 100,000 Syrians are still missing. Assad's tyranny deployed chemical weapons, especially a nerve agent called sarin. This drew attention from the international community. The US and Russia made Syria sign the Chemical Weapons Convention, forbidding the use of chemical weapons. Assad allegedly handed over his chemical weapons in 2014. In 2017, the town of Khan Shaykhun was hit by another sarin attack, which killed 90 people, and 30 of them were children. ===Humanitarian crisis=== According to the United Nations, as of 2022, more than 12 million Syrians will be living in food insecurity, and more than 14.6 million Syrians will be in need of humanitarian assistance. Millions of citizens are still short of electricity, food and drinking water. This is worsened by Russia's invasion of Ukraine in March of 2022, which hinders essential food imports. Of the 14.6 million Syrians that are in need of humanitarian assistance, 1.48 million people are in catastrophic need, claims the U.N. Office for the Coordination of Humanitarian Affairs. Above all that, the economic toll of the war has resulted in 90% of Syrians living under the poverty line as of 2022. The United Nations say the humanitarian crisis is worsening in 2022, and a peace agreement is far from reaching. However, at the Brussels Conference in 2022, international donors have agreed to provide Syria with 6.7 billion USD for support and reconstruction. ==Death toll== Assad's dictatoral regime killed at least 400,000. Meanwhile, The Syrian Observatory for Human Rights (TSOHR) has claimed to have documented a much higher death toll, arguing that 610 000 people died since the start of the conflict, of which they have already identified and documented 500 000. ===Refugee crisis=== According to the UN Refugee Agency, 6.6 million Syrians have fled the country since 2011, and 6.7 million people are internally displaced. Most went to neighbouring countries, such as Jordan, Lebanon, Turkey and Iraq, which were the most affected; however, millions of Syrians also seeked refuge in Europe. Two significant migration flows were through Turkey and the Balkans, until the EU border in Hungary, and from the coast of Africa into southern Europe. Many people went through dangerous boat trips in the Mediterranean, leading to many drownings. This became an important point of discussion for the European Union, with some countries more and others less welcoming to receiving these refugees. ==Related pages== *List of ongoing armed conflicts ==References== Category:Wars Category:Asia Category:Iran Category:China Category:Syria Category:Racism Category:Israel Category:Turkey Category:Russia Category:Kurdistan Category:Civil wars Category:Saudi Arabia Category:2020 in Asia Category:2021 in Asia Category:2022 in Syria Category:2023 in Syria Category:United States Category:United Kingdom Category:European Union Category:2010s in Syria Category:2010s conflicts Category:Conflicts in 2020 Category:Conflicts in 2021 Category:Conflicts in 2022 Category:Conflicts in 2023 Category:Left-wing politics Category:November 2024 events Category:December 2024 events Category:Wars involving Syria Category:Civil wars involving Asia Category:Autonomous Administration of North and East Syria",
 "title": "Syrian civil war"
}