{
 "id": "425809",
 "text": "Social cognitive theory (SCT) says that a part of a person's knowledge acquisition comes from observing others. This is done through actions with other people, experiences, and the effects of the media. The theory is used in psychology, education and communication. It was advanced by Albert Bandura. The theory is a part of his social learning theory. The theory say that when people see someone doing something and the consequences of that action, they remember what happened and use this information to guide their own actions. Watching a person do something can also cause the viewer to act in a way they have already learned.Bandura, A., Social foundations of thought and action : a social cognitive theory. 1986, Englewood Cliffs, N.J.: Prentice-Hall.Bandura, A. (2008). Social cognitive theory of mass communication. In J. Bryant & M. B. Oliver (Eds.), Media Effects: Advances in Theory and Research (pp. 94-124). New York, NY: Routledge. In other words, people do not learn new behaviors only by trying them and either succeeding or failing. The survival of humanity sometimes depends on taking the actions other people took. When people are rewarded or punished for their behavior, the outcome of the behavior helps people choose to do the same thing or not. Media is a source of many things for people to watch and see these actions take place. ==History== The basis for social cognitive theory come from Edwin B. Holt and Harold Chapman Brown's 1931 book. It says that all animal action is based on needs of \"feeling, emotion, and desire\". The most notable part of this theory is that it saya a person cannot learn to imitate until they are imitated. In 1941, a book by Neal E. Miller and John Dollard had a new version of Holt's theory. They said four things affect learning: drives, cues, responses, and rewards. One driver is social motivation, It includes imitativeness, the process of matching an action to a cue of where and when to perform the action. If a behavior is imitated depends on if the person doing it gets a positive or negative response. Miller and Dollard said that if a person were motivated to learn a particular behavior, then that behavior would be learned through watching. By imitating these actions a person would learned the action and would be rewarded with positive reinforcement. SCT has been used to many areas of human life. These include career choice, learning and achievement. ==References== ==Further reading== *Bandura, Albert (1976). Social Learning Theory. Englewood Cliffs, NJ: Prentice Hall. *Bandura, Albert (1985). Social Foundations of Thought and Action. Englewood Cliffs, NJ: Prentice-Hall. *Berg, Insoo Kim; Miller, Scott D. (1992). Working with the Problem Drinker: A Solution-focused Approach (pp. 733–735). New York: Norton. *Pajares, Frank; Prestin, Abby; Chen, Jason; Nabi, L. Robin. \"Social Cognitive Theory and Media Effects\". In Nabi, Robin L.; Oliver, Mary Beth, The SAGE Handbook of Media Processes and Effects. Los Angeles: SAGE, 2009. 283-297. *Bandura, Albert (2001). Social Cognitive Theory: An Agentic Perspective. Annual Review of Psychology. ==Other websites== * \"Albert Bandura Bobo Doll Experiment: Modelling of Aggression.\" YouTube * \"Albert Bandura speaking at Everett M. Rogers Award Colloquium 2007\" YouTube, (1h33) Category:Psychology",
 "title": "Social cognitive theory"
}