{
 "id": "425812",
 "text": "The International Bank Account Number is an internationally-recognised way of identifying bank account numbers. Its abbreviation is \"IBAN\". The IBAN was developed to enable people in the European Union to send money to a bank account in another country. When a person uses a computer to make a money transfer, the IBAN has features that allow the person’s computer to check for typing errors. The IBAN is now used in all European countries and also in many developing countries. Developed countries outside Europe such as the United States, Australia and Canada do not use the IBAN. ==Layout== IBANs are usually written in groups of four characters. This makes it easy for people to copy the numbers. The first four characters in an IBAN have the same meaning throughout the world. Each country has its own layout for the rest of the IBAN. For example \"\" is a British IBAN for a bank account at the National Westminster Bank. The parts of this IBAN are described below: :`GB29 NWBK 6016 1331 9268 19` :`ccxx bbbb ssss ssaa aaaa aa` The letters in the second row have the following meanings: :*\"`cc`\" shows the country where the bank account is kept. For example, all British IBANs start with \"GB\", all French IBANs with \"FR\" and so on. Developed countries outside Europe such as the United States, Australia and Canada do not use the IBAN. :*\"`xx`\" are a number between \"00\" and \"99\". These characters are called a checksum. A computer can calculate the checksum for the IBAN and compare it to the checksum that the user typed in. If the user made a typing mistake, the two checksums will not be the same and the computer will give an error message. :Each country has its own layout for the rest of the IBAN. This example shows the British layout. :*\"`bbbb`\" is a bank code. In the example above, \"NWBK\" is the code for National Westminster Bank. :*\"`ssss ss`\" is the bank sort code. In the example above, \"\" comes from the sort code \"\". :*\"aa `aaaa aa`\" are the bank account number. In the example above, \"\" come from bank account number \"31926819\". == Checking an IBAN == A computer can check an IBAN by changing it into an integer and dividing the number by 97. If the IBAN is valid, the remainder equals 1. The rules for changing the IBAN to an integer are: : Step 1: Move the first four characters of the IBAN to the end of the IBAN. Step 2: Replace the letter \"A\" with the number \"10\", replace the letter \"B\" into the number \"11\" and so on. Remove all blank spaces. Step 3: Divide the number by 97 and save the remainder. Step 4: If the remainder is 1, the check has worked. For Example check that \"`GB29 NWBK 6016 1331 9268 19`\" is a valid IBAN. : IBAN: `GB29 NWBK 6016 1331 9268 19`. Step 1: Rearrange: ` N W B K60161331926819 G B29`. Step 2: Convert to integer: `2332112060161331926819161129`. Step 3: Compute remainder: `2332112060161331926819161129` mod 97 = 1. Step 4: Check result The answer is 1, so the code has passed the check. Many computer programs have been written to check whether or not an IBAN is valid. These programs do not check whether or not an IBAN is genuine. They do check that a genuine IBAN has been copied correctly. UNESCO maintains one such program and have made the source code public. It will detect a large number of mistakes that users might make when they are copying a genuine IBAN by hand. These mistakes include: *Missing a character. *Adding an extra character. *Entering a number when a letter is expected. *Entering a letter when a number is expected. *Swapping two characters round. ==Administration== The IBAN was developed to make it easier to transfer money from a bank in one EU country to a bank in another EU country. This was important when people bought goods from other countries. The rules for the IBAN were drawn up by the International Organization for Standardization (ISO) in 1997. They were revised in 2003 and again in 2007. The rules that were written in 2007 consist of two rule books: *ISO 13616-1:2007 lists the rules for creating IBANs. *ISO 13616-2:2007 list the rules for an organisation called a Registration Authority (RA). The Regulation Authority is responsible for keeping a list which countries used IBANs. Since 2003 the Regulation Authority has been SWIFT. All bank accounts within the European Union must have an IBAN. Bank accounts can also have a domestic bank account identifier. The domestic bank account identifier in the United Kingdom is the sort code and bank account number. During 2014 all banks in Europe that use the euro must start using the IBAN for customer account numbers. They will no longer be allowed to use older national systems. The IBAN is also used in many developing countries including Brazil, Pakistan. Turkey and many counties in the Middle East. ==References== Category:Finance Category:ISO standards",
 "title": "International Bank Account Number"
}