{
 "id": "425902",
 "text": "Art music is a term which includes classical music, and various kinds of serious modern music. Other terms for it are serious music,Mount, Andre 2010. Does serious music belong in pop? - borrowings from Stravinsky in the music of Frank Zappa. and legitimate music.Chandler, Chip 2001. Symphony celebrates Aaron Copland. Amarillo Globe-News (22 January).Cooke, Mervyn 2002. Jazz among the classics: the case of Duke Ellington. In The Cambridge Companion to Jazz, Mervyn Cooke and David Horn (eds). Cambridge University Press, 153–7. (cloth) (pbk)Ake, David 2002. Learning jazz, teaching jazz. In The Cambridge Companion to Jazz, Mervyn Cooke and David Horn (eds). Cambridge University Press, 255–69. (cloth) (pbk) The need for such terms came with the modern movement in the arts. Clearly the music of, say, Schonberg was serious, bur not classical in the sense of Bach and Beethoven. Stravinsky's music was a bridge between the two genres. It was classical music in part, and touched with African- influenced syncopations and dischords. So terms like \"art music\" and \"modern music\" were used by art critics and academics in their writing. Art music can be defined as serious music with a written musical tradition.Siron, Jacques Musique Savante (serious music), Dictionnaire des mots de la musique. Paris: Outre Mesure: 242. Denis Arnold, Art music, art song. In The New Oxford Companion to Music, Volume 1: A-J. Oxford University Press, 111. The term art music is used often and has a clear meaning. Musicologist Philip Tagg calls it one part of an clear and unquestioned \"triangle consisting of 'folk', 'art' and 'popular' musics\".Tagg, Philip 1982. Analysing popular music: theory, method and practice. Popular Music. 2, 41. He explains that each of these three is distinguishable from the others according to certain criteria. The main tradition in the Western world is usually called classical music. In this regard, it is frequently used as a contrasting term to popular music and traditional or folk music.\"Music\" in Encyclopedia Americana, reprint 1993, p. 647.Philip Tagg, \"Analysing Popular Music: Theory, Method and Practice\", Popular Music 2 (1982): 37-67, here 41-42. == References == Category:Music genres",
 "title": "Art music"
}