{
 "id": "426173",
 "text": "Lockdown was a yearly pay-per-view made by Total Nonstop Action Wrestling (TNA). The event is usually produced in April. The first Lockdown event took place on April 24, 2005 at the TNA Impact! Zone in Orlando, Florida. The final Lockdown took place on February 23, 2016 at the Wembley Arena in London, England. The event features a Six Sides of Steel cage when the ring still had 6 sides. They switched to a normal, 4-sided steel cage in 2010. They also have gimmick matches such as the Lethal Lockdown (which is a variant of the WarGames match that was popularized in World Championship Wrestling), the Xscape match which is a multi-competitor elimination cage match where the last two remaining competitors must climb over or use the door to escape the cage, and the Queen of the Cage match which featured TNA Knockouts. ==Dates and venues== Event Date City Arena Main event Lockdown (2005) April 24, 2005 Orlando, Florida TNA Impact! Zone A.J. Styles versus Abyss in a Six Sides of Steel Cage match to become number one contender to the NWA World Heavyweight Championship Lockdown (2006) April 23, 2006 Orlando, Florida TNA Impact! Zone Sting's Warriors (Sting, A.J. Styles, Rhino, and Ron Killings) vs Jarrett's Army (Jeff Jarrett, Chris Harris, James Storm, and Scott Steiner) in a Four- on-Four Lethal Lockdown match Lockdown (2007) April 15, 2007 St. Charles, Missouri Family Arena Team Angle (Kurt Angle, Jeff Jarrett, Rhino, Samoa Joe, and Sting) versus Team Cage (Christian Cage, Abyss, A.J. Styles, Scott Steiner, and Tomko) in a Five-on-Five Lethal Lockdown match Lockdown (2008) April 13, 2008 Lowell, Massachusetts Tsongas Arena Kurt Angle (c) versus Samoa Joe in a Six Sides of Steel Cage match for the TNA World Heavyweight Championship Lockdown (2009) April 19, 2009 Philadelphia, Pennsylvania Liacouras Center Sting (c) versus Mick Foley in a Six Sides of Steel Cage match for the TNA World Heavyweight Championship Lockdown (2010) April 18, 2010 St. Charles, Missouri Family Arena Team Hogan (Hulk Hogan, Abyss, Rob Van Dam, Jeff Jarrett, and Jeff Hardy) versus Team Flair (Ric Flair, Sting, James Storm, Robert Roode, and Desmond Wolfe) in a Four-on-Four Lethal Lockdown match Lockdown (2011) April 17, 2011 Cincinnati, Ohio U.S. Bank Arena Sting (c) versus Rob Van Dam versus Mr. Anderson in a Three Way Steel Cage match for the TNA World Heavyweight Championship Lockdown (2012) April 15, 2012 Nashville, Tennessee Nashville Municipal Auditorium Bobby Roode (c) versus James Storm in a Steel Cage match for the TNA World Heavyweight Championship Lockdown (2013) March 10, 2013 San Antonio, Texas Alamodome Jeff Hardy (c) versus Bully Ray in a Steel Cage match for the TNA World Heavyweight Championship Lockdown (2014) March 9, 2014 Miami, Florida BankUnited Center Team MVP (MVP (captain), The Wolves, (Eddie Edwards and Davey Richards) and Willow) versus Team Dixie (Bobby Roode (captain), The BroMans (Robbie E and Jessie Godderz) and Austin Aries) in a Eight-man Lethal Lockdown match match with Bully Ray as the special guest referee. Lockdown (2015) Janyary 9, 2015 (Taped) January 30 , 2015 & February 6 , 2015 (Air) New York, New York Manhattan Center Team Angle (Angle (captain), Gunner, and Austn Aries) and Bobby Lashley) versus The Beat Down Clan (MVP (captain), Kenny King, and Low Ki and Samoa Joe) in a Eight-man Lethal Lockdown match match. Lockdown (2016) February 23, 2016 London, England Wembley Arena Matt Hardy (c) versus Ethan Carter III in a Six Sides of Steel Cage match for the TNA World Heavyweight Championship ==Other websites== *TNA website Category:Total Nonstop Action Wrestling",
 "title": "TNA Lockdown"
}