{
 "id": "426529",
 "text": "Survivor Series (1997) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 9, 1997 at Molson Centre in Montreal, Quebec. It was the eleventh Survivor Series event held by the WWF. The main event ended in controversy after a real life event happened which was later dubbed the \"Montreal Screwjob\". Vince McMahon ordered the referee Earl Hebner to end the match when Shawn Michaels held Bret Hart in Hart's own finishing maneuver, the Sharpshooter, even though Hart did not submit. ==Matches== No. Results Stipulations Times 1 The New Age Outlaws (Billy Gunn and \"Road Dogg\" Jesse James) and The Godwinns (Henry O. and Phineas I. Godwin) defeated The Headbangers (Mosh and Thrasher) and The New Blackjacks (Blackjack Windham and Blackjack Bradshaw) Four-on-four Survivor Series elimination match 15:25 2 The Truth Commission (The Jackyl, The Interrogator, Sniper, and Recon) defeated The Disciples of Apocalypse (Crush, Chainz, 8-Ball, and Skull) Four-on-four Survivor Series elimination match 9:59 3 Team Canada (The British Bulldog, Jim Neidhart, Doug Furnas and Phil Lafon) defeated Team USA (Vader, Goldust, Marc Mero and Steve Blackman) (with Sable) Four-on-four Survivor Series elimination match 17:05 4 Kane (with Paul Bearer) defeated Mankind Singles match 9:27 5 The Road Warriors (Hawk and Animal), Ahmed Johnson and Ken Shamrock defeated The Nation of Domination (The Rock, Faarooq, Kama Mustafa and D'Lo Brown) Four-on-four Survivor Series elimination match 20:28 6 Stone Cold Steve Austin defeated Owen Hart (c) (with The British Bulldog, Jim Neidhart, Doug Furnas and Phil Lafon) Singles match for the WWF Intercontinental Championship 4:03 7 Shawn Michaels \"defeated\" Bret Hart (c) by submission Singles match for the WWF Championship 19:58 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Henry O. Godwinn Blackjack Bradshaw Pinfall 3:52 Blackjack Windham Phineas I. Godwinn 5:14 Mosh Billy Gunn 8:42 Phineas I. Godwinn Thrasher 12:38 Blackjack Bradshaw Road Dogg 13:44 Thrasher Billy Gunn 15:25 The New Age Outlaws (Road Dogg and Billy Gunn) Eliminated Wrestler Eliminated by Method Time Chainz The Interrogator Pinfall 1:18 The Jackyl 8-Ball 2:50 Recon Skull 5:18 Skull Sniper 6:30 8-Ball The Interrogator 8:50 Sniper Crush 9:46 Crush The Interrogator 9:59 The Interrogator Eliminated Wrestler Eliminated by Method Time Steve Blackman N/A Countout 5:16 Jim Neidhart Vader Pinfall 6:53 Phil Lafon 8:28 Marc Mero Doug Furnas 11:18 Goldust N/A Countout 16:26 Doug Furnas Vader Pinfall 16:54 Vader The British Bulldog 17:05 The British Bulldog Eliminated Wrestler Eliminated by Method Time Hawk The Rock Pinfall 2:09 Faarooq Ahmed Johnson 4:53 Ahmed Johnson The Rock 6:09 Kama Mustafa Animal 10:44 Animal N/A Countout 14:12 D'Lo Brown Ken Shamrock Submission 16:54 The Rock 20:28 Ken Shamrock ==References== ==Other websites== *Official Survivor Series 1997 website Category:1997 in professional wrestling Category:1997 in Canada Category:Sport in Montreal Category:Survivor Series Category:20th century in Montreal",
 "title": "Survivor Series (1997)"
}