{
 "id": "426589",
 "text": "In war, when enemy forces are close to capturing a city, the government or military forces in control of a city will sometimes declare it an open city, meaning they will not defend against or resist the attacking armies. The attacking armies will be expected to not to bomb or attack the city. This approach aims to prevent historic landmarks from being destroyed and civilians from being killed. == No resistance == An open city is not defended and not fortified. It is open to occupation by opposing forces with no resistance by the defenders.Adam Roberts, 'Undefended Towns', Crimes of War: What the Public Should Know, eds. Roy Gutman; David Rieff (New York: W.W. Norton & Co., 1999), p. 360 Under International law an open city may not be bombed or subject to artillery attack. Attacking forces do not always respect cities that call themselves an \"open city.\" Defensive forces may use it as a political tactic as well.Murphy, Paul I. and Arlington, R. Rene. (1983) La Popessa: The Controversial Biography of Sister Pasqualina, the Most Powerful Woman in Vatican History. New York: Warner Books Inc. , p. 210 In some cases, the declaration of a city to be \"open\" is made by a side which is close to defeat. In other cases, the city could be defended but the defenders do not want the city to be destroyed. == World War II open cities == Several cities were declared open during World War II: * Brussels in 1940 by the Belgians * Oslo in 1940 by the Norwegians * Paris in 1940, from which the French Government fled after it became apparent that they could not defend it * Belgrade in April 1941 by the Yugoslavs, whose status as an open city was not respected by the Wehrmacht * Penang in December 1941, after the British Armies in Malaya retreated to Singapore * Manila in 1941, which the United States military abandoned during the Japanese invasion. * Rome on 14 August 1943, which the defending Italian forces declared unilaterally to be an \"open city\" following the cessation of Allied bombing. This applied when under attack by the Germans; subsequently Allied forces entered Rome in June 1944 and retreating German forces also declared Florence and Chieti \"open cities\" on 24 March 1944. * Athens on 11 October 1944 by retreating German Forces ==Related pages== * Laws of war * Geneva Conventions ==References== == Other websites == * Manila: How Open Was This Open City?, History Net Category:War",
 "title": "Open city"
}