{
 "id": "426595",
 "text": "A war of attrition is a military strategy in which one side tries to cause the other to lose so many soldiers and to have so much military equipment destroyed that the enemy forces are worn down until they collapse. The side that has more resources (soldiers and military equipment) usually wins. == Strategic considerations == Military experts like Sun Tzu say attrition is not the best way to win a war. A famous quote by Sun Tzu is \"the supreme art of war is to subdue the enemy without fighting.\" In a war of attrition, both parties think they can win. One is always wrong, and often, both are wrong. Both sides can end up with fewer resources than when they began. Ideally, wars are won using the fewest soldiers and weapons possible. Another form of attrition warfare is the search-and-destroy operations that were used by the United States during the Vietnam War. That conflict showed that wars of attrition do not work when the enemy is willing to absorb higher losses and to continue a war indefinitely. == American Civil War == Union General Ulysses S. Grant began a war of attrition with the Battle of the Wilderness. That was a change for the Army of the Potomac, which was no longer going after the Confederate capital at Richmond, Virginia. Grant was now directly going after Robert E. Lee's Army of Northern Virginia. It was the first battle of the Union Army's Overland Campaign and ended with neither side victorious. The combined casualties totaled 28,000. Grant knew that although his losses were greater, any losses for the Confederacy would reduce its capacity to fight. The North had a much larger pool of resources to work with than the South. Grant concluded that any Confederate losses were, therefore, worth the sacrifice made by the Union Army. == World War I == One of the best examples of a war of attrition is World War I on the Italian and the Western Fronts. Both sides were drained until one side did not have enough men, horses, food and other military resources to continue. The term was often used to show a lack of imagination in simply throwing soldiers at their enemy. That implies attrition warfare can be avoided, but that is not always unfortunately the case, and attrition is frequently a key approach to winning a war. An army will use maneuver and position to its advantage so that when the fight,l occurs, the enemy suffers the greater loss of resources. Attrition may be necessary to create the space in which to maneuver and position forces. For that reason, the two approaches to fighting a war are closely linked, and attrition is often the more important one. The end of World War I is described in detail by Keegan. It is enough to say that Germany could not replace the casualties with equal numbers of new troops.Keegan, John 1999. The first world war. The German offensive 1918. London: Pimlico. ISBN 0-7126-6645-1 == References == == Other websites == * The War of Attrition between Egypt & Israel (1968-1970):YouTube Category:Military terminology Category:Military tactics",
 "title": "Attrition warfare"
}