{
 "id": "426647",
 "text": "The Tribal Hidage is generally considered to be a tribute list dated to 7th or 8th century Anglo-Saxon England. It was a list of 35 tribes that made up the majority of the peoples living in southern England at that time. Each tribe or kingdom on the list had a rounded off number of hides (units of land measurement). Modern historians believe it was created by either Mercian or Northumbrian overlords to collect tribute from the other groups. == Origins == The Tribal Hidage is an important historical document.Cyril Hart, 'The Tribal Hidage', Transactions of the Royal Historical Society, Fifth Series, Vol. 21 (1971), p. 135 The oldest copies available were written in style of the 11th century. This is at a time when many of the names of the earlier regions had been forgotten. In some cases the list is the only evidence that a region or people of that name ever existed.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 295 There were probably older versions of the Tribal Hidage and may have dated back to when Penda of Mercia dominated Anglo- Saxon England (642–655).J. Brownbill, 'The Tribal Hidage', The English Historical Review, Vol. 40, No. 160 (Oct., 1925), p. 497 Historians are mixed when it comes to where the document came from originally. It may have been written by Paulinus for King Edwin of Northumbria.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 116 It may have been created for the use of Offa of Mercia.Cyril Hart, 'The Tribal Hidage', Transactions of the Royal Historical Society, Fifth Series, Vol. 21 (1971), p. 133 Others have not suggested a place or reign, but a particular period of time for when it was probably written—between 670-690.Wendy Davies; Hayo Vierck:, 'The Contexts of Tribal Hidage: Social Aggregates and Settlement Patterns', Frühmittelalterliche Studien, Volume 8 (May 3010) pp. 223–302 Historians are not certain what the exact reason was for creating the list. Most seem to agree it was probably a tribute list. There are signs that the list was updated over a period of time. So it may have had more than one purpose.Peter Featherstone, 'The Tribal Hidage and the Ealdormen of Mercia', Mercia: An Anglo-Saxon Kingdom in Europe, eds. Michelle P. Brown; Carol A. Farr (London: Continuum International Publishing Group, 2005), p. 23 == The Hidage list == The text in the original documents is corrupt. Not every name can be clearly read. The names on the list are for tribal groups of peoples and not for districts or regions they lived in. Three different revisions have been identified by historian David Dumville. These are called Recension A, Recension B, and Recension C.Peter Featherstone, 'The Tribal Hidage and the Ealdormen of Mercia', Mercia: An Anglo-Saxon Kingdom in Europe, eds. Michelle P. Brown; Carol A. Farr (London: Continuum International Publishing Group, 2005), pp. 23–24 The first part of the list had 20 names. At the end of the first group is a total number of hides of land given as 66, 100. The numbers of hides for each group add up to 66,100 so the number is correct. The second group of 15 names has a total under it listed at 242,700 hides. But this is incorrect. If you add up the hides for each of the names in this group it totals 244,100. These are almost certainly math errors. === Primary list === Of the first or primary part of the list contained several recognized peoples: * Mercian lands - 30,000 hides.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 117 * Wrekin dwellers - 7,000 hides * Lindsey–folk - 7,000 hides (including Hatfield) * Wrekin- dwellers - 7,000 hides (Staffordshire, Northern Shropshire) * Western men - 7,000 hides (Worcestershire, Herefordshire) * South Gyrwas - 600 hides * North Gyrwas - 600 hides * Elmet dwellers - 600 hides * The remaining 13 names had between 300 and 1,200 hides each. === Secondary list === This part of the list seems to have been added: * Hwicce - 7,000 hides. (Worcestershire, Gloucestershire, and parts of Warwickshire, Herefordshire, Shropshire, and Staffordshire) * East Angles - 30,000 hides. * East Saxons - 7,000 hides. (Essex, Hertfordshire, Middlesex) * Kent men - 15,000 hides. * South Saxons - 7,000 hides. * West Saxons - 100,000 hides. * The remaining nine names had between 300 and 4,000 hides each. == Notes == == References == == Other websites == * The Tribal Hidage Online, The British Library Category:Anglo- Saxons Category:History of England",
 "title": "Tribal Hidage"
}