{
 "id": "427060",
 "text": "Hatfield Chase is a low-lying area in South Yorkshire and North Lincolnshire, England. It was often flooded. Hatfield chase was a royal hunting ground until Charles I tried to have it drained. He hired a Dutch engineer to drain the water in 1626.Biographical Dictionary of the History of Technology, eds. Lance Day, Ian McNeil (London; New York: Routledge, 1996), p. 725 The engineer's name was Cornelius Vermuyden. He also changed the courses of the rivers Don, Idle and Torne. This included making drainage channels. But the project was not completely successful. More work was done in the 1760s to see to the problem of winter flooding. Modern pumps now work to drain the area. The history of Hatfield chase goes back to the end of Roman Britain. ==Location== On the west Hatfield Chase is bordered by the M18 motorway. The River Ouse is its northern border. The River Idle is to the south, and the Isle of Axholme borders the area to the east. It covers an area of around , including two large peat bogs known as Thorne and Hatfield Moors. Hatfield chase is part of the once vast Humberhead Levels, a wetland which originally covered some . == History == Originally the region was called Haethfieldlande or Hatfield. It was another minor Anglo-Saxon kingdom listed in the Tribal Hidage.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), pp. 87–88 Very little is known about Hatfield and nothing of its kings. Unlike other petty kingdoms in this area of Britain, the name here is of Anglo-Saxon origin and not British. According to the Tribal Hidage, 'Hatfield-land' was merged with Lindsey into a single kingdom. Afterwards it became known simply as Hatfield Chase, an area on the west part of Lindsey, later part of Yorkshire and Lincolnshire. Hatfield was the site of a synod held by Theodore, the Archbishop of Canterbury . It was a royal residence of several kings of Northumbria. Edwin of Northumbria was killed here at the Battle of Hatfield Chase on 12 October 633.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 140 Later, Hatfield chase became a part of the East Riding of Yorkshire. Before the drainage and lowering of the water levels Hatfield chase was home to large numbers of aquatic birds. The waters were full of fresh-water fish.William Brocklehurst Stonehouse, The History and Topography of the Isle of Axholme (London: Longman, Rees, Orme, & Company, 1839.), p. 63 == Notes == == References == Category:History of England Category:South Yorkshire",
 "title": "Hatfield Chase"
}