{
 "id": "427106",
 "text": "A food group is a collection of foods that have nutritional properties or biological classifications that are almost the same. People have written nutrition guides to put different foods into food groups and recommend daily servings of each group for a healthy diet. ==Common food groups== * Dairy, also called milk products, is sometimes grouped together with milk alternatives or meat. This is usually a small er category in nutrition guides. Some examples of dairy products ae milk, butter, yogurt and cheese, and most nutrition guides put them in a different place from other food groups. Some groups, such as the Harvard School of Public Health (HSPH) have said that dairy products should not be a food group. The HSPH says that \"research has shown little benefit, and considerable potential for harm, of such high dairy intakes. Moderate consumption of milk or other dairy products—one to two servings a day—is fine, and likely has some benefits for children. But it’s not essential for adults, for a host of reasons.\" * Fruits, sometimes grouped together with vegetables, have apples, oranges, bananas, berries and lemons. Fruits are carbohydrates, like sugar, dairy, grains, and starches. * Grains, also called cereals sometimes have potatoes and other starches. This is mostly the largest group in nutrition guides. Wheat, rice, oats, barley, bread and pasta are grains. * Meat, sometimes called protein, can sometimes have legumes, eggs, meat analogues and/or dairy. In most nutrition guides, this group is usually a medium- to smaller-sized category. Some examples of meat are chicken, fish, turkey, pork and beef. * Sweets, also called sugary foods sometimes has fats and oils. Sweets is mostly a very small group in nutrition guides, and sometimes this group is not included or is put apart from other food groups. Some examples are candy, soft drinks, cake, pie and ice cream. * Vegetables, sometimes grouped with fruit and occasionally with legumes. This is usually a large group. Most times, only grains, are a larger group than vegetables in nutrition guides. Some vegetables are spinach, carrots, onions, peppers, and broccoli. * Water is treated in very different ways by different nutrition guides. Some nutrition guides do not include water, while others include it, and yet others make it the most important part or basic part of the guide. Water is sometimes grouped with tea, fruit juice, vegetable juice and even soup, and is recommended to be drunk in large amounts. ==Uncommon food groups== The number of \"common\" food groups can change depending on who is defining them. Canada's Food Guide, which has been printed every year since 1942 and is the second most requested government document (after the income tax form) in Canada, recognizes only four official food groups, with all other foods called \"another.\" Some of these \"others\" include: * Alcohol is put away from other food groups and recommended only for certain people in moderation by Harvard's Healthy Eating Pyramid and the University of Michigan's Healing Foods Pyramid, while Italy's food pyramid includes a half-serving of wine and beer. ==References== Category:Nutrition Category:Healthy lifestyle",
 "title": "Food group"
}