{
 "id": "427309",
 "text": "Passenger name record is the name for a set of data in a database, which contains the path a passenger travelling with one or more airlines takes. In some cases, groups of people travelling together are stored in the same passenger name record. Passenger details often contain more information than that which is strictly necessary. Additional information stored includes the gender of the passenger, if the passenger is part of a frequent flyer programme, details about the ticket, or if the passenger has special meal requirements - for example vegetarian. ==International PNR Sharing Agreements== ===European Union to United States=== United States–European Union Agreement on Passenger Name Records. ===European Union to Australia=== On January 16, 2004, the Article 29 Working Party released their Opinion 1/2004 (WP85) on the level of PNR protection ensured in Australia for the transmission of Passenger Name Record data from airlines. :Customs applies a general policy of non retention for these data. For those 0.05% to 0.1% of passengers who are referred to Customs for further evaluation, the airline PNR data are temporarily retained, but not stored, pending resolution of the border evaluation. After resolution, their PNR data are erased from the PC of the Customs PAU officer concerned and are not entered into Australian databases. In 2010 the European Commission's Directorate-General for Justice, Freedom and Security was split in two. The resulting bodies were the Directorate-General for Justice (European Commission) and the Directorate- General for Home Affairs (European Commission). On the 4th of May 2011, Stefano Manservisi, Director-General at the Directorate-General for Home Affairs (European Commission) wrote to the European Data Protection Supervisor (EDPS) with regards to a PNR sharing agreement with Australia, a close ally of the US and signatory to the UKUSA Agreement on signals intelligence. The EDPS responded on the 5th of May in Letter 0420 D845: :I am writing to you in reply to your letter of 4 May concerning the two draft Proposals for Council Decisions on (i) the conclusion and (ii) the signature of the Agreement between the European Union and Australia on the processing and transfer of Passenger Name Record (PNR) data by air carriers to the Australian Customs and Border Protection Service. :We understand that the consultation of the EDPS takes place in the context of a fast track procedure. However, we regret that the time available for us to analyse the Proposal is reduced to a single day. Such a deadline precludes the EDPS from being able to exercise its competences in an appropriate way, even in the context of a file which we have been closely following since 2007. ===European Union to Canada=== The Article 29 Working Party document Opinion 1/2005 on the level of protection ensured in Canada for the transmission of Passenger Name Record and Advance Passenger Information from airlines (WP 103), 19 January 2005, offers information on the nature of PNR agreements with Canada. ===India=== In India PNR is used by Indian Railway as Passenger Name Record Usually Travelers need it to check their confirmation of their seats. It is a 10 Digit Number which has to be entered on website for checking PNR Status . == Related pages == * Passenger manifest ==References== Category:Transport Category:Databases",
 "title": "Passenger name record"
}