{
 "id": "427469",
 "text": "An airline alliance is an agreement of two or more airlines to work with each other. The three largest airline alliances are Star Alliance, SkyTeam, and Oneworld. Airline alliances make it easier for passengers to travel around the world, often by codeshare agreements, with fewer stops or connections. The biggest alliance is Star Alliance, with 28 member airlines such as United, Lufthansa, and Air Canada. The second biggest is SkyTeam, with 19 members including Delta, KLM, and Air France. The third biggest alliance is Oneworld, with 13 members including American Airlines, British Airways, and Qantas. ==Alliances== Membership and market data for the largest airline alliances (as of March 2013) Star Alliance 28 members Founded 1997 SkyTeam 19 members Founded 2000 Oneworld 13 members Founded 1999 Rest of Industry (selected major nonaligned carriers) Passengers per year 649 million 506 million 303 million 1,223 million Countries 194 187 155 204 (total countries) Destinations 1,410 1,024 850 4,000 (total destinations) Fleet size 4,703 4,150 2,382 13,669 Revenue Billion US$ (€) 160.9 (124) 97.9 (90) 89.875 (85) 4651,325 (3550) Market share 29.30% 24.6% 23.2% 22.9% Current Participants¹ Members (JP) Adria Airways 2004 (A3) Aegean Airlines 2010 (AI) Air India 2014 (AC) Air Canada Founder (CA) Air China 2007 (NZ) Air New Zealand 1999 (NH) All Nippon Airways 1999 (OZ) Asiana Airlines 2003 (OS) Austrian Airlines 2000 (AV) Avianca 2012 (SN) Brussels Airlines 2009 (CM) Copa Airlines 2012 (OU) Croatia Airlines 2004 (MS) EgyptAir 2008 (ET) Ethiopian Airlines 2011 (BR) EVA Air 2013 (LO) LOT Polish Airlines 2003 (LH) Lufthansa Founder (OAL) Olympic Air 2013 (SK) Scandinavian Airlines Founder (ZH) Shenzhen Airlines 2012 (SQ) Singapore Airlines 2000 (SA) South African Airways 2006 (LX) Swiss International Air Lines 2006 (TA) TACA 2012 (JJ) TAM Airlines 2010 (TP) TAP Portugal 2005 (TG) Thai Airways International Founder (TK) Turkish Airlines 2008 (UA) United Airlines Founder (US) US Airways 2004 Members (SU) Aeroflot 2006 [suspended] (AR) Aerolíneas Argentinas 2012 (AM) Aeroméxico Founder (UX) Air Europa 2007 (AF) Air France Founder (CI) China Airlines 2011 (MU) China Eastern Airlines 2011 (OK) Czech Airlines 2001-2024 (DL) Delta Air Lines Founder (VS) Virgin Atlantic 2023 (GA) Garuda Indonesia 2014 (KQ) Kenya Airways 2007 (KL) KLM 2004 (KE) Korean Air Founder (ME) Middle East Airlines 2012 (SV) Saudia 2012 (SAS) Scandinavian Airlines 2024 (RO) TAROM 2010 (VN) Vietnam Airlines 2011 (MF) Xiamen Airlines 2012 Members (AB) Air Berlin 2012 (AA) American Airlines Founder (BA) British Airways Founder (CX) Cathay Pacific Founder (AY) Finnair 1999 (IB) Iberia Airlines 1999 (JL) Japan Airlines 2007 (LA) LAN Airlines 2000 (MH) Malaysia Airlines 2013 (QF) Qantas Founder (QR) Qatar Airways 2013 (RJ) Royal Jordanian 2007 (UL) SriLankan Airlines 2014 (S7) S7 Airlines 2010 (MX) Mexicana 2009 (ceased operations in 2010, but is considered an inactive member) Africa (AH) Air Algérie (W3) Arik Air (AT) Royal Air Maroc (TU) Tunisair Asia (KC) Air Astana (HU) Hainan Airlines (EK) Emirates (EY) Etihad Airways (GF) Gulf Air (IR) Iran Air (9W) Jet Airways (PK) Pakistan International Airlines (PR) Philippine Airlines (HY) Uzbekistan Airways Europe (EI) Aer Lingus (KM) Air Malta (BT) airBaltic (V3) Carpatair (CY) Cyprus Airways (LY) El Al (OV) Estonian Air (FI) Icelandair (JU) Jat Airways (DY) Norwegian Air Shuttle (UN) Transaero (PS) Ukraine International Airlines (UT) UTair Aviation North America (FL) AirTran Airways (AS) Alaska Airlines (G4) Allegiant Air (BW) Caribbean Airlines (CU) Cubana (F9) Frontier Airlines (HA) Hawaiian Airlines (B6) JetBlue (WN) Southwest Airlines (NK) Spirit Airlines (SY) Sun Country Airlines (VX) Virgin America (WS) WestJet Oceania (DJ) Virgin Australia South America (G3) Gol Transportes Aéreos Future Members Past Members (CZ) China Southern Airlines 2007-2020 (AZ) ITA Airways (Alitalia) 2001–2009 as Alitalia-Linee Aeree Italiane, rejoined 2009 and exited in 2025 (JJ) TAM Airlines 2014-2020 Quality Quality Quality Quality Quality Average Star Rating 3.593 3.26 3.615 3.196 5-Star Airlines 42.857% : All Nippon Airways, Asiana Airlines, Singapore Airlines, EVA Air 0.00% : Korean Air, Garuda Indonesia 42.857% : Cathay Pacific, Qatar Airways, Japan Airlines 14.286% : Hainan Airlines 4-Star Airlines 30.556% 13.889% 11.111% 44.444% 3-Star Airlines 11.864% 11.864% 5.085% 71.186% 2-Star Airlines 0% 0% 0% 100% 1-Star Airlines 0% 0% 0% 100% ==References== ==Other websites== * Oneworld * SkyTeam * Star Alliance",
 "title": "Airline alliance"
}