{
 "id": "427692",
 "text": "Laverne Cox (born May 29, 1972) is an American actress and LGBT advocate. She is best known for playing Sophia Burset in Orange Is the New Black, a Netflix series. Burset is a transgender woman in a women's prison. ==Early life== Laverne Cox was born in Mobile, Alabama and was raised by a single mother and grandmother within the AME Zion church. She has an identical twin brother, M Lamar, who portrays the pre-transitioning Sophia (as Marcus) in Orange Is the New Black. Cox stated she attempted suicide at the age of 11, when she noticed that she had developed feelings about her male classmates and had been bullied for several years for not acting \"the way someone assigned male at birth was supposed to act\". Cox is making a documentary about CeCe McDonald, an African American transgender woman who was put in prison for killing a man who attacked her. On January 13 2014 Cox met CeCe to drive her home after she was released from prison.Laverne Cox Meets CeCe McDonald After Prison Release | HuffPost Cox spoke at the start of the 2014 National Gay and Lesbian Task Force conference Creating Change.WATCH: Laverne Cox Kills it With 'Creating Change' Speech Cox was chosen as one of the 2014 grand marshalls for the New York City Pride March.Laverne Cox, Jonathan Groff & Rea Carey Are NYC Pride March Grand Marshalls ==Honors and awards== * 2013 – Anti-Violence Project 2013 Courage Award honoree * 2013 – Reader's Choice Award at Out Magazines OUT100 Gala, honoring the magazine's selection of 2013s 100 \"most compelling people of the year.\" * 2014 – Woman of the Year by Glamour magazine. * 2014 – Included in the annual Root 100; this list honors \"standout black leaders, innovators and culture shapers\" age 45 and younger. * 2014 – Topped the British newspaper The Guardians third annual World Pride Power List, which ranks the world's most influential LGBT people. * 2014 – Stephen F. Kolzak Award from GLAAD. * 2014 – Named to the EBONY Power 100 list. * 2015 – Named to the 2015 OUT Power 50 List. * 2015 – Included in the People World's Most Beautiful Women List. * 2015 – Three Twins Ice Cream in San Francisco renamed its chocolate orange confetti ice cream Laverne Cox's Chocolate Orange Is the New Black for Pride weekend. * 2015 – Named in the 2015 Time 100 Most Influential People List; her entry was written by Jazz Jennings. * 2015 – Named by Forum for Equality as one of their 31 Icons of the LGBT History Month. * 2015 – Winner of a Daytime Emmy Award in Outstanding Special Class Special as Executive Producer for Laverne Cox Presents: The T Word. This made Cox the first openly transgender woman to win a Daytime Emmy as an Executive Producer; as well, The T Word is the first trans documentary to win a Daytime Emmy. * 2017 – Named to the 2017 OUT Power 50 List. ==References== ==Other websites== * Official website Category:Actors from Alabama Category:American feminists Category:LGBT actors Category:LGBT African-Americans Category:LGBT people from Alabama Category:Living people Category:People from Mobile, Alabama Category:Transgender women Category:1972 births",
 "title": "Laverne Cox"
}