{
 "id": "42769",
 "text": "The Kinsey Reports are two books, published in 1948 and 1953 by Alfred Kinsey and his co-workers. The books Sexual Behaviour in the Human Male and Sexual Behaviour in the Human Female, were based on thousands of interviews by Kinsey and his team. The books were shocking when they came out, as they talked about subjects that were taboo. It also questioned widely-held beliefs about sexuality. They were controversial. == Findings of the reports == Kinsey found the following, amongst other things: #There are different sexual orientations: about 46% of men have reacted to both sexes; this means they are not completely heterosexual. 37% had at least one homosexual experience. About 10% were more or less openly homosexual. With women these numbers are lower. About 7% of single women, and about 4% of the women had been married were about halfway on the scale (3 out of 6), more or less equally homosexual, and heterosexual. 2%-6% of married women, and 1-3% of unmarried women were more or less exclusively homosexual. #Masturbation is common: about 62% of women, and about 92% of men have used masturbation at least once. #How often they have sex: women reported to have had sex 2.8 times a week (in the late teens), 2.2 times a week by age 30, and once a week by age 50. #Sadomasochism: 12% of women, and 22% of men said they were sexually aroused by a sadomasochistic story. 55% of women, and 50% of men have had an erotic reaction when they were bitten. == Criticism == People said that the selection of the sample (those asked) was not well done. One in four were prisoners, and 5% were male prostitutes. The institute, or location Kinsey did these tests, then did another such tests, without asking prisoners or prostitutes, and the findings were more or less the same. People also say that child abuse may have been involved when collecting the data. == Kinsey scale == The Kinsey scale attempts to describe a person's sexual history or episodes of their sexual activity at a given time. It uses a scale from 0 to 6. 0 means the person tested is exclusively heterosexual. A person scoring 6 is exclusively homosexual. In the Kinsey Reports, an extra grade was used for asexuality. The scale was first published in Sexual Behavior in the Human Male (1948). It was also important in the complementary work Sexual Behavior in the Human Female (1953). Kinsey introduced the scale: :\"Males do not represent two discrete populations, heterosexual and homosexual. The world is not to be divided into sheep and goats. It is a fundamental of taxonomy that nature rarely deals with discrete categories... The living world is a continuum in each and every one of its aspects. :\"While emphasising the continuity of the gradations between exclusively heterosexual and exclusively homosexual histories, it has seemed desirable to develop some sort of classification which could be based on the relative amounts of heterosexual and homosexual experience or response in each history... An individual may be assigned a position on this scale, for each period in his life.... A seven-point scale comes nearer to showing the many gradations that actually exist.\" (Kinsey et al 1948. pp. 639, 656) The scale is as follows: Rating Description 0 Exclusively heterosexual 1 Predominantly heterosexual, only incidentally homosexual 2 Predominantly heterosexual, but more than incidentally homosexual 3 Equally heterosexual and homosexual 4 Predominantly homosexual, but more than incidentally heterosexual 5 Predominantly homosexual, only incidentally heterosexual 6 Exclusively homosexual * Men: 11.6% of white males aged 20–35 were given a rating of 3 for this period of their lives.Kinsey, Alfred et al 1948. Sexual behavior in the human male. Saunders, Table 147, p. 651 * Women: 7% of single females aged 20–35 and 4% of previously married females aged 20–35 were given a rating of 3 for this period of their lives.Kinsey, Alfred et al 1953. Sexual behavior in the human female. Saunders, Table 142, p. 499 2 to 6% of females, aged 20–35, were given a rating of 5, and 1 to 3% of unmarried females aged 20–35 were rated as 6. ==References== == Other websites == *The Kinsey Institute Website Category:Books about sexuality Category:Science books Category:1948 books Category:1953 works",
 "title": "Kinsey Reports"
}