{
 "id": "427828",
 "text": "Anna Komnene (sometimes spelled Comnena; Greek: Άννα Κομνηνή, Anna Komnēnē) was a Greek princess, scholar, and doctor. She was the eldest daughter of Emperor Alexios I Komnenos of Byzantium and Irene Doukaina. Komnene was born in the Porphyra, the purple room of the Byzantine royal palace in Constantinople, on December 2nd, 1083. For some time, the emperor did not have a son, so Komnene who was originally engaged to Constantine Ducas, became an heir to the throne. While they were engaged, Anna went to live with Ducas’s mother, Maria of Alania, where Komnena got an education in mathematics, philosophy, and medicine. Anna’s future changed significantly when her brother John was born in 1087 and became the heir to the throne. This sparked Komnene’s jealousy and hatred for her brother for the rest of her life. Unfortunately, Constantine Ducas died young and Anna married Nicephorus Bryennius in 1097 AD. Anna began to plot a plan for her husband to inherit the throne, with the help of her grandmother, Anna Dalassene. Anna’s mother, Irene, also helped Anna try to persuade her father while on his death bed, to give Brynnius the throne. The plan failed, mainly because of Nicephorus’s loyalty to the heir of the throne, John. At her father’s funeral, Anne is thought by many historians to have attempted an assassination of John, before he could claim the throne, but failed yet again. John II Komnenos took the throne in 1188. Anna is supposed to have continued plotting against her brother, even though her husband refused to help her. Once her antics were discovered, Anna’s lands were taken, and she was prohibited from entering the royal palace ever again. When Bryennius, her husband, died, Anna moved into a convent and began her work as a historian. While she lived there, Anna wrote her book, The Alexiad. “The Alexiad” is a lengthy biography of her father’s reign and the Byzantine Empire. It provides a picture of religious and intellectual activities within the empire. Anna writes about the faults and flaws in her father’s reign as well as the successes and accomplishments. The 15 books of The Alexiad are written solely in Greek. Anne is the only female historian who wrote in Greek before the 19th century. She is also one of very few female authors and historians from Byzantium and was viewed as lesser by many. Her book is still important because Anna had access to the royal archives and had an inside view of politics. Her book remains one of the essential primary sources for Byzantine history and is a common read for those studying the time period. Anna may have spent a large part of her life in a convent, but she did in fact become a nun until shortly before she died. She is thought to have died in 1153 however the exact date is unknown. Category:1083 births Category:1153 deaths Category:Greek princes and princesses Category:Greek physicians",
 "title": "Anna Komnene"
}