{
 "id": "427901",
 "text": "An uninterruptible power supply (or uninterruptible power source; UPS) is an apparatus that provides electric power in an emergency when there is a problem with the normal electricity supply. It provides an almost instantaneous supply of electricity during any power failure. It is used normally to protect any sensitive hardware (computer, data center, telecommunication) in which if there is any disruption of power supply, it might easily damage that equipment. UPS batteries are lead acid batteries that use gel sulfuric acid instead of the liquid sulfuric acid car batteries use. UPS batteries are sealed and have the ability to store electricity and provide a consistent high surge DC current to a UPS system which converts it to a stabilized AC current. UPS batteries have a wide selection of dimensions and one of their main properties is that they do not leak or produce fumes. This is one of the most important reasons why they are used safely in houses, server rooms, data centers, manufacturing environments, hospitals, offices, and other poorly ventilated areas. These sealed lead-acid batteries can be found in some of the electronics stores or UPS specialized stores. Most people use a type of UPS called a full-time or full double conversion UPS, which is also the most effective. The utility power that comes into a UPS is alternating current (AC), which is also what most IT equipment needs (ITE). Choosing the correct UPS for the job is very important. Batteries, on the other hand, use direct current (DC), so all battery-type UPSes must change the incoming alternating current (AC) power into direct current (DC) to charge the batteries. This process is called \"rectification.\" The UPS must still send AC power to the ITE, so a device called an inverter must turn DC power back into AC power. In a double-conversion UPS, power goes through the rectifier, and then the inverter is on its way to the ITE. The voltage and frequency of the output have nothing to do with the voltage and frequency of the input. They can even be completely different from the input, so this system is technically called \"voltage and frequency independent\" (VFI). == References == Category:Electricity",
 "title": "Uninterruptible power supply"
}