{
 "id": "428115",
 "text": "Cranes are a British dream pop band. Their most well known song is perhaps \"Shining Road\". They formed in 1985 in Portsmouth, England. The band's founding members were singer Alison Shaw, her brother Jim Shaw and guitarist Kevin Dunford. Dunford left the band in 1990. He was replaced by Mark Francombe who had such diverse musical influences as Velvet Underground, Can and Thobbing Gristle. He also liked building experimental electronic devices to alter his guitar-sound as well as wearing experimental hair. In 1989 their 6-track EP Self Non Self was released by Bite Back. A further guitarist, Matt Cope, was recruited. In 1990 they released an EP called Inescapable. It was their first release on the record label Dedicated. Later in 1990 they released another EP, Espero. 1991 saw the release of Tomorrows Tears followed by Adoration. Their first album, Wings of Joy, was released in 1991. It reached number fifty-two in the UK Album Chart. In 1992 they opened 90 shows for The Cure on the U.S. and European legs of their \"Wish\" world tour. During a break from this tour their second album Forever was written and recorded and was released in 1993. It got to number forty in the UK. The single \"Jewel\" reached number twenty-nine in the UK Singles Chart. It was a collaboration with The Cure and became Cranes best-selling single. Their third album Loved was released in 1994. Three singles were released from the album: \"Lilies\", \"Shining Road\", and \"Beautiful Friend\". In 1996 Cranes released 10,000 copies of La Tragédie d'Oreste et Électre. This album, based on a Jean-Paul Satre work, Shaw recites entirely in French. The next year Population 4 was released. It was their last album on Dedicated. In 1997 the band broke up. In 2000 they reformed. They released Future Songs in 2001. In 2002 they performed before The Cure at Hyde Park. They released an EP called Submarine. Only 2000 copies of it were made. There were eight songs on it. All of them were remixes. In 2004 Particles and Waves was released. Cranes performed as the opening act for The Cure at the Move Festival. In 2007 Cherry Red Records released Wings of Joy again. Seven extra songs were on it. In 2008 they released an album called Cranes on their record label Dadaphonic. Pitchfork gave it a score of 7.2 out of 10. In 2009 Loved was released again by Cherry Red Records. There were seven extra songs on it. ==References== Category:Musical groups established in 1989 Category:1980s British music groups Category:1990s British music groups Category:2000s British music groups Category:2010s British music groups",
 "title": "Cranes (band)"
}