{
 "id": "428159",
 "text": "Edward Teller (January 15, 1908 – September 9, 2003) was a Hungarian-American Jewish theoretical physicist.* * * * * He was born in Budapest, the capital city of Hungary. Back then, Hungary was the major part of the empire of Austria-Hungary. He is known as \"the father of the hydrogen bomb\". ==Early life== Teller was Jewish. Teller did not speak until he was three years old. He left Hungary in 1926. He moved to Germany. He went to the University of Karlsruhe there. He then went to the University of Leipzig. He got his Ph.D. in physics there. In 1933 Adolf Hitler became the leader of Germany. Teller decided to move so the Nazis wouldn't kill him for being a Jew. In 1934 Teller moved to Copenhagen in Denmark. He joined the Institute for Theoretical Physics there. He married Augusta Maria Harkanyi. Teller then moved to London in England to teach at University of London. ==Career== ===Before World War II=== In 1935 he moved to the United States to become a professor at George Washington University. In 1941 he stopped working at George Washington University. He joined the Manhattan Project in 1942. At the time it was called the Manhattan Engineering District. With Stanislaw Ulam and other immigrant scientists he invented the fusion bomb. ===Cold War=== In 1952 Teller opened Lawrence Livermore National Laboratory at the University of California with Ernest Lawrence. In 1953 Teller became a professor at the University of California. He was on the cover of TIME magazine in 1957. From 1958 to 1960, Teller worked as the director of the Lawrence Livermore National Laboratory. He was the associate director until 1977. The laboratory is now called Los Alamos Scientific Laboratory. In 1979, Teller had a heart attack. He blamed it on Jane Fonda. In 1982 he became a member of the White House Science Council. Teller was given one of the first Ig Nobel Prizes for Peace in 1991. ===21st century=== In 2000, Teller's wife died. In 2001, a book Teller wrote about his life, Memoirs: A Twentieth Century Journey In Science And Politics, was published by Basic Books. Teller was 93. ==Death== He died from a stroke on September 9, 2003 at Stanford University. ==Views== Teller was an agnostic.Edward Teller (2002). Memoirs: A Twentieth Century Journey In Science And Politics. Basic Books. p. 32. . \"Religion was not an issue in my family; indeed, it was never discussed. My only religious training came because the Minta required that all students take classes in their respective religions. My family celebrated one holiday, the Day of Atonement, when we all fasted. Yet my father said prayers for his parents on Saturdays and on all the Jewish holidays. The idea of God that I absorbed was that it would be wonderful if He existed: We needed Him desperately but had not seen Him in many thousands of years.\" He also was a Republican. ==References== Category:1908 births Category:2003 deaths Category:Hungarian Jews Category:Jewish American academics Category:Jewish American scientists Category:Naturalized citizens of the United States Category:Scientists from Budapest Category:Refugees from Nazism Category:American theoretical physicists Category:Hungarian physicists",
 "title": "Edward Teller"
}