{
 "id": "42836",
 "text": "The Piccadilly line is a line of the London Underground. It is coloured dark blue on the Tube map. It is the fifth busiest line on the Underground network judged by the number of passengers transported per year. It is mainly a deep- level line, running from the north to the west of London via Zone 1. However, there are a number of surface sections mostly in its westernmost parts. Out of the 53 stations served, 25 are underground. It is the second longest line on the system, after the Central Line. == Infrastructure == ===Rolling stock=== Like most Underground lines, the Piccadilly line is operated by a single type of rolling stock. In this case it is the 1973 tube stock. The trains are painted in the standard London Underground livery of blue, white and red. Seventy-six trains out of a fleet of 88 are needed to run the line's peak service. One unit (166-566-366) was severely damaged by the terrorist attack of 7 July 2005. The stock was recently refurbished, and was due for replacement by 2014, but the order for new trains was cancelled in July 2010. The line was previously worked by 1959 stock, 1956 stock, 1938 stock, standard tube stock and 1906 gate stock. The line has two depots, at Northfields and Cockfosters. There are sidings at Oakwood, South Harrow, Arnos Grove, Rayners Lane, Down Street, Wood Green, Barons Court, Acton Town, Ruislip and Uxbridge. ===Signalling=== The line is controlled from the control centre at Earl's Court, which it used to share with the District line. It is in need of resignalling, and this work is planned to be carried out by 2014. ===Service pattern=== The current off-peak service pattern is: : 6 trains per hour – (via Terminals 1, 2, 3) : 6 trains per hour Cockfosters – (returning around the loop and serving Terminals 1, 2, 3) : 3 trains per hour Cockfosters – : 3 trains per hour Cockfosters – : 6 trains per hour Arnos Grove – Often late evening services terminate at instead of Cockfosters. Trains will also make an additional stop at during early mornings and late evenings but will not stop at the station during the main part of the day. Other services operate at times, especially at the start and towards the end of the traffic day. ===Map=== Easier Versions can be found http://www.tfl.gov.uk/assets/downloads/standard-tube-map.gif ==Stations== (In order from east to west.) ===Cockfosters branch=== Cockfosters branch Station Image Opened Additional information 31 July 1933 One of the two depots is located here 13 March 1933 Opened as Enfield West; renamed Enfield West Oakwood 3 May 1934; renamed 1 September 1946 13 March 1933 in deep-level tunnel 19 September 1932 Trains may terminate here: there are several sidings for stabling trains Tunnel section commences 19 September 1932 19 September 1932 19 September 1932 19 September 1932 Original Section 15 December 1906 15 December 1906 Opened as Gillespie Road; renamed Arsenal (Highbury Hill) 31 October 1932; the suffix was later dropped in 1960 15 December 1906 15 December 1906 15 December 1906 Opened as King's Cross; renamed King's Cross for St. Pancras 1927; renamed 1933 15 December 1906 15 December 1906 Renamed Holborn (Kingsway) 22 May 1933; the suffix was later dropped. 11 April 1907 15 December 1906 15 December 1906 15 December 1906 Opened as Dover Street; renamed 18 September 1933 15 December 1906 In the event of disruption, trains may terminate here via a crossover 15 December 1906 8 January 1907 15 December 1906 15 December 1906 Tunnel section ends 15 December 1906 15 December 1906 ===Extension to Hounslow and Uxbridge=== Extension to Hounslow and Uxbridge Station Image Opened Additional information 1 January 1869 Originally the London and South Western Railway; first served by the Piccadilly line 23 June 1963 1 July 1879 Originally the Metropolitan District Railway, later District line; first served by the Piccadilly line 4 July 1932 The line splits here into two branches – the Heathrow branch and the Uxbridge branch. ===Heathrow branch=== Continuing from Acton Town Station Image Opened Additional information 1 May 1883 Originally the Metropolitan District Railway, later District line; first served by the Piccadilly line 29 April 1935 16 April 1908 Originally the District line (one of the two depots is here and some trains terminate here); first served by the Piccadilly line 9 January 1933 1 May 1883 Originally the District line; first served by the Piccadilly line 13 March 1933 23 March 1934 2 May 1909 Opened as Hounslow Town by the District line renamed 1 December 1925; first served by the Piccadilly line 13 March 1933 1 April 1886 Opened as Heston-Hounslow by the District line, renamed 1 December 1925; first served by the Piccadilly line 13 March 1933 Tunnel section recommences 21 July 1884 Opened as Hounslow Barracks by the District line, renamed 1 December 1925; first served by the Piccadilly line 13 March 1933, resited 19 July 1975 19 July 1975 12 April 1986 16 December 1977 Opened as Heathrow Central; renamed Heathrow Central Terminals 1,2,3 on 3 September 1983; renamed 12 April 1986 27 March 2008 Just beyond Heathrow Terminals 1, 2, 3 tube station, the line goes into a new section to serve Heathrow Terminal 5 tube station, which opened in March 2008. Half of all Heathrow trains use the loop and serve Terminal 4 and the other half omit Terminal 4 and serve Terminal 5. ===Uxbridge branch=== Continuing from Acton Town Station Image Opened Additional information 1 July 1879 Originally the District line; first served by the Piccadilly line 4 July 1932 23 June 1903 Originally the District line; first served by the Piccadilly line 4 July 1932 6 July 1931 Originally the District line; first served by the Piccadilly line 4 July 1932; renamed Park Royal (Hanger Hill) 1 March 1936; renamed 1947 28 June 1903 Opened as Perivale-Alperton by the District line; renamed 7 October 1910; first served by the Piccadilly line 4 July 1932 28 June 1903 Originally the District line; first served by the Piccadilly line 4 July 1932 ( ) 28 June 1903 Originally the District line; first served by the Piccadilly line 4 July 1932 28 June 1903 Originally the District line; first served by the Piccadilly line 4 July 1932; closed when re-located 4 July 1935; re-opened 5 July 1935 1 March 1910 Originally the District line; first served by the Piccadilly line 23 October 1933 (from here to Uxbridge trains share track with Metropolitan line, and some trains terminate here) 1 March 1910 Originally the District line; first served by the Piccadilly line 23 October 1933 5 August 1912 Originally the District line; first served by the Piccadilly line 23 October 1933 1 March 1910 Originally the District line; first served by the Piccadilly line 23 October 1933 (some trains terminate here in Monday-Friday peak hours) 1 March 1910 Originally the District line; first served by the Piccadilly line 23 October 1933 10 December 1923 Originally the District line; first served by the Piccadilly line 23 October 1933; renamed Hillingdon (Swakeleys) April 1934; the suffix was later dropped; closed when re-located 5 December 1992; re-opened 6 December 1992 1 March 1910 Terminus. Originally the District line; first served by the Piccadilly line 23 October 1933; closed when re-located 3 December 1938; re-opened 4 December 1938 ==Closed stations== * opened on 30 November 1907 as the Strand tube station. It was at the end of a branch line from the main line at . An evening through-northbound 'Theatre' train ran until 1910. From 1917 onwards, it was served only by a shuttle from Holborn. In the same year it was renamed Aldwych when Charing Cross on the Northern line was renamed Strand. It was temporarily closed in 1940 during World War II to be used as an air-raid shelter. It re-opened in 1946. The possibility of extending the branch to Waterloo was discussed, but the scheme never proceeded. Aldwych was finally closed on 30 September 1994; the level of use was said to be too low to justify the £1 million in estimated costs of a complete replacement of the lifts. The station is regularly used by film makers. * opened 15 December 1906; closed 30 July 1934, between and . * opened 15 December 1906; closed 21 May 1932, between and . * Osterley & Spring Grove first served 13 March 1933; closed 24 March 1934 between and . It was replaced by Osterley. * opened 23 June 1903; closed 5 July 1931. Although on the route of the current Piccadilly line, a short distance north of the present station, it was never served by Piccadilly line trains. It was opened by the District line, the original operator of the line between and , and was closed and replaced by the present Park Royal station before the Piccadilly line started running trains to South Harrow in 1932. * opened 15 December 1906; closed 19 September 1932, between and . It has been suggested that this station may be reopened to serve new developments on the nearby Kings Cross railway lands, but this idea is not being progressed at present. The road the station served, 'York Road', has since been renamed 'York Way'. ==Future== The Piccadilly line was to be upgraded in 2014–15 and would have had new trains as well as new signalling. This would have increased the line's capacity by some 24%. Bids for the rolling-stock order were submitted in 2008. However, after the acquisition of Tube Lines by Transport for London in June 2010, this order was cancelled. ==Maps== * Cockfosters – * Oakwood – * Southgate – * Arnos Grove – * Bounds Green – * Wood Green – * Turnpike Lane – * Manor House – * Finsbury Park – * Arsenal – * Holloway Road – * Caledonian Road – * King's Cross St. Pancras – * Russell Square – * Holborn – * Covent Garden – * Leicester Square – * Piccadilly Circus – * Green Park – * Hyde Park Corner – * Knightsbridge – * South Kensington – * Gloucester Road – * Earl's Court – * Barons Court – * Hammersmith – * Turnham Green – * Acton Town – * South Ealing – * Northfields – * Boston Manor – * Osterley – * Hounslow East – * Hounslow Central – * Hounslow West – * Hatton Cross – * Heathrow Terminal 4 – * Heathrow Terminals 1, 2, 3 – * Heathrow Terminal 5 – * Ealing Common – * North Ealing – * Park Royal – * Alperton – * Sudbury Town – * Sudbury Hill – * South Harrow – * Rayners Lane – * Eastcote – * Ruislip Manor – * Ruislip – * Ickenham – * Hillingdon – * Uxbridge – * Cockfosters Depot – * Northfields Depot – ==Related pages== * Leslie Green – architect of the Great Northern, Piccadilly & Brompton Railway's early stations * Vauxhall Cross tube station – fictional Piccadilly line tube station ==References== ;Notes ;Bibliography * * * * * ==Other websites== * * * Category:Airport rail links in London Category:London Underground lines Category:Transport in the London Borough of Brent Category:Transport in the London Borough of Camden Category:Transport in the London Borough of Ealing Category:Transport in the London Borough of Enfield Category:Transport in the London Borough of Hackney Category:Transport in the London Borough of Hammersmith and Fulham Category:Transport in the London Borough of Haringey Category:Transport in the London Borough of Harrow Category:Transport in the London Borough of Hillingdon Category:Transport in the London Borough of Hounslow Category:Transport in the London Borough of Islington Category:Transport in the Royal Borough of Kensington and Chelsea Category:Transport in the City of Westminster Category:1906 establishments in England",
 "title": "Piccadilly line"
}