{
 "id": "42851",
 "text": "The 2000 Summer Olympics, officially known as the Games of the XXVII Olympiad, took place in Sydney, New South Wales, Australia from September 15, 2000 until October 1, 2000. 199 National Olympic Committees (NOCs) were in the Sydney Games. Four were in the Olympics for the first time. These were Timor-Leste, Eritrea, Micronesia and Palau. ==Returned medals== Marion Jones, winner of three gold and two bronze medals for the United States, gave back her medals in October 2007. She said she took tetrahydrogestrinone (THG), a drug that could make her run faster, from September 2000 through July 2001. On 2 August 2008, the International Olympic Committee took the gold medal from the U.S. men's 4x400-meter relay team. Antonio Pettigrew said he used a banned substance. Besides Pettigrew other athletes used performance-enhancing drugs. These are twins Alvin and Calvin Harrison, and Jerome Young. On 28 April 2010, the IOC took China's bronze medal from Gymnastics. This was for using an underage gymnast. ==Venues== ===Sydney Olympic Park=== *Olympic Stadium: Ceremonies (opening/closing), Athletics, Football (final) *Sydney International Aquatic Centre: Diving, Modern Pentathlon (swimming) Swimming, Synchronised Swimming, Water Polo (medal events) *State Sports Centre: Table Tennis, Taekwondo *NSW Tennis Centre: Tennis *State Hockey Centre: Field Hockey *The Dome and Exhibition Complex: Badminton, Basketball, Gymnastics (rhythmic), Handball (final), Modern Pentathlon (fencing, shooting), Volleyball (indoor) *Sydney SuperDome: Gymnastics (artistic, trampoline), Basketball (final) *Sydney Baseball Stadium: Baseball, Modern Pentathlon (riding, running) *Sydney International Archery Park: Archery ===Sydney=== *Sydney Convention and Exhibition Centre: Boxing, Fencing, Judo, Weightlifting, Wrestling *Sydney Entertainment Centre: Volleyball (indoor final) *Dunc Gray Velodrome: Cycling (track) *Sydney International Shooting Centre: Shooting *Sydney International Equestrian Centre: Equestrian *Sydney International Regatta Centre: Rowing, Canoeing (sprint) *Blacktown Olympic Centre: Baseball, Softball *Fairfield City Farm: Cycling (mountain biking) *Ryde Aquatic Leisure Centre: Water Polo *Penrith Whitewater Stadium: Canoeing (slalom) *Bondi Beach: Volleyball (beach) *Sydney Football Stadium: Football *Olympic Sailing Shore Base: Sailing *Centennial Parklands: Cycling (road) *Marathon course: Athletics (marathon) *North Sydney: Athletics (marathon start) *Sydney Opera House: Triathlon ===Outside Sydney=== *Bruce Stadium, Canberra: Football *Hindmarsh Stadium, Adelaide: Football *Melbourne Cricket Ground: Football *Brisbane Cricket Ground: Football ==References==",
 "title": "2000 Summer Olympics"
}