{
 "id": "42852",
 "text": "The 2002 Winter Olympics, officially known as the XIX Olympic Winter Games, were held in Salt Lake City, Utah, United States from February 8 2002 to February 24 2002. There were about 2,400 athletes from 77 nations. They were in 78 events. Utah was the fifth state in the United States to host the Olympic Games. 78 National Olympic Committees sent athletes to the Salt Lake City games. Cameroon, Hong Kong (China), Nepal, Tajikistan, and Thailand were in their first Winter Olympic games. ==Highlights== *The Olympic Flame was lit by the members of the gold medal-winning US Hockey Team of the 1980 Winter Olympics in Lake Placid, NY. *These Olympics were the first time a United States president opened an Olympic Winter Games. *These were the first Games to be held under IOC president Jacques Rogge. *Janica Kostelić won three golds and a silver which were the first Winter Olympic medals ever for Croatia It was the first three-gold performance by a female. *Skeleton returned as a medal sport in the 2002 Games for the first time since 1948. *2002 was the first time with the Women's Bobsled Event. *China won its first and second Winter Olympic gold medals, both by women's short-track speed skater Yang Yang (A). *One of the most memorable stories of the event was at the men's short track. Australian skater Steven Bradbury was behind in the semi-final. The winning skaters crashed into each other, letting him finish second and go through to the final. Bradbury was again behind in the final. Again all four other skaters crashed out in the final turn. He won the gold medal.This was the first gold for Australia—or any other country of the Southern Hemisphere—in the Olympic Winter Games. *Australia won their second gold medal when Alisa Camplin won in Women's Aerials. This was the first ever Winter Games gold won by a woman from the Southern Hemisphere. *The Canadian men's ice hockey team defeated the American team 5–2 to claim the gold medal. This ended 50 years without the hockey gold. The Canadian women's team also defeated the American team 3–2. Category:2002 in the United States Category:21st century in Utah Category:Salt Lake City",
 "title": "2002 Winter Olympics"
}