{
 "id": "428578",
 "text": "Colin Henry Wilson (26 June 1931 – 5 December 2013) was an English novelist and writer. Wilson also wrote widely on true crime and criminology, mysticism, the paranormal, and other topics. In all, there are over 120 books, including some fiction. He preferred to call his philosophy new existentialism or phenomenological existentialism. Wilson was interested in metaphysics and the occult. In 1971, he wrote a nonfiction book named The Occult: A History. In it, he talked about the beliefs of Aleister Crowley, George Gurdieff, Helena Blavatsky, Kabbalah, primitive magic, Franz Mesmer, Grigori Rasputin, and Paracelsus. He also wrote a biography of Crowley, Aleister Crowley: The Nature of the Beast. He also wrote biographies on other visionaries in spirituality and psychology, including, George Gurdjieff, Carl Jung, and Wilhelm Reich. Wilson suffered a stroke in June 2012 and lost his ability to speak. He died on 5 December 2013, aged 82. == The Outsider == This was the book which made his name. It was really a work of literary criticism, but was also about social philosophy. It was based mainly on the work of Dostoyevsky, Camus and Satre, all of whom featured characters who were lost, outsiders, alienated from society. Gollancz published the 24-year-old Wilson's The Outsider in 1956. The book became a best-seller and helped popularise existentialism in Britain. Kenneth Allsop, The angry decade: a survey of the cultural revolt of the nineteen fifties. London: Peter Owen. It has never been out-of-print since publication day and has been translated into over thirty languages (including Russian and Chinese). == Crime == Wilson's writing on crime is quite extensive and commercially successful. He wrote several books about serial killers and murderers. * The mammoth book of true crime. New edition 1988. London: Robinson. * The serial killers: a study in the psychology of violence. London: W.H. Allen. (with Donald Seaman) * A plague of murder: the rise and rise of serial killing in the modern age. London: Robinson. == References == == Other websites == * Colin Wilson Papers (2 document boxes) housed at the Eaton Collection of Science Fiction and Fantasy of the University of California, Riverside Libraries. * The Colin Wilson Collection at the University of Nottingham, United Kingdom - This is Wilson's bibliographer Colin Stanley's collection of books, articles, manuscripts, letters, photographs and assorted ephemera now at the University of Nottingham. Regularly updated by Stanley. Category:1931 births Category:2013 deaths Category:British esotericists Category:English science fiction writers Category:English philosophers Category:Mystics Category:Writers from Leicester Category:Literary critics Category:Existentialists",
 "title": "Colin Wilson"
}