{
 "id": "428521",
 "text": "Benedict Biscop (–690), also called Biscop Baducing, was an Anglo-Saxon nobleman, monk and abbot. He was the founder and benefactor of the Monkwearmouth-Jarrow Abbeys. He had been a thane of King Oswiu of Northumbria and an officer in his court. Benedict Biscop is probably best known for the library he created at Jarrow and for being the mentor of the Venerable Bede. He was venerated as a saint after his death. ==Life== Benedict Biscop was born .Bede; C. W. Grocock; I. N. Wood, The Abbots of Wearmouth and Jarrow (Oxford: Clarendon Press, 2013), p. xv He was from a noble family of Northumbrian Angles.Bede; James Patterson; Peter Wilcock; et al., Lives of the First Five Abbots of Wearmouth & Jarrow: Benedict, Ceolfrid, Eosterwine, Sigfrid and Huetbert (Sunderland: Hills & Co., 1910), p. 45 As a young man he was a member of the court of King Oswiu of Northumbria while still young. He was a rich nobleman who had a good deal of political power.Michael Gleason, 'Bede and his Fathers', Classica et mediaevalia, Vol. 45 (1994), p. 223 When he was twenty- five he gave up his secular life, his marriage and family and decided to join the Church.Charles Forbes Montalembert; Aurélien Courson, The monks of the West from St. Benedict to St. Bernard, Volume 4 (London: J.C. Nimmo, 1896), p. 172 In 653 he went on a journey to Rome on a pilgrimage. He traveled with Wilfrid, who later became Bishop of York. He returned home shortly after that.Bede; James Patterson; Peter Wilcock; et al., Lives of the First Five Abbots of Wearmouth & Jarrow: Benedict, Ceolfrid, Eosterwine, Sigfrid and Huetbert (Sunderland: Hills & Co., 1910), p. 47 He made a second trip to Rome in 664 and stayed about two months. He then retired to the island of Lérins and became a monk there.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), pp. 184–85 After two years he agreed to guide Theodore, the new Archbishop of Canterbury, from Rome to England. On arriving at Canterbury, Benedict became abbot of St Augustine's Abbey (also called the monastery of St. Peter and St. Paul, Canterbury). He also made a trip to Vienne to acquire a collection of books. Biscop made a fourth journey to acquire more books in 679. In 674 Biscop built a monastery known as Monkwearmouth. Ecgfrith, King of Northumbria gave him fifty hides of land at the mouth of the River Wear.John Marsden, Northanhymbre Saga; The History of the Anglo-Saxon Kings of Northumbria (London: Kyle Cathie Limited, 1992), p. 178 This monastery would be dedicated to Saint Peter and came to be called St. Peter's at Monkwearmouth. Benedict wanted his monastery to be a center of both learning and religion.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 159 Benedict used Frankish stonemasons who he brought over to England to construct the monastery. Monkwearmouth was the first (and Jarrow the second) church structures to be built of stone in England. Benedict them brought over glassmakers from Frankia to fit the windows of the church and chapels with fine stained glass. They established a glass workshop there at Monkwearwolf.Treasures of Britain: The Architectural, Cultural, Historical and Natural Heritage of Britain, ed. John Julius Norwich (New York: W.W. Norton, 2002), p. 606 Within a year the monastery was completed.Abbeys and Churches of England and Wales; Descriptive, Historical, Pictorial, ed. T. G. Bonney (London: Cassel, 1887), p. 86 In 678 a letter from Pope Agatho exempted the monastery from external control. Benedict got all the furnishings, sacred vessels, decorations and vestments. Some he found locally while others he bought in Francia and Rome. In 680 Benedict made another trip to Rome. This time it was to escort back to England a new member of his monastery. This was Abbot John, Arch-cantor and abbot of the monastery of Saint Martin. He was to be their instructor for all the chants for the church year. These were taught exactly as they were sung at St. Peter's Basilica in Rome.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 234 In 682 King Ecgfrith gave another forty hides of land to Benedict for a second monastery. It was to be at the mouth of the River Trent at Jarrow.John Marsden, Northanhymbre Saga; The History of the Anglo-Saxon Kings of Northumbria (London: Kyle Cathie Limited, 1992), p. 179 The stained glass for Jarrow came from the same monastery workshop at Monkwearmouth.N. J. Higham, The Kingdom of Northumbria; AD 350–1100 (Stroud, Gloucestershire: Sutton Publishing, 1993), p. 137 The dedication ceremony for Jarrow abbey was held on 23 April 685. Named for Saint Paul when the sister monastery was completed Benedict assigned Ceolfrith to be the abbot. Bede, who was about ten years old at the time, was one of the monks who went with him. To prevent any jealousy between his two houses Benedict deliberately made the two dependant on each other. That way they could be treated as a single monastery. He also decided there should be only one abbot to rule both houses. Benedict himself was the first abbot of Monkwearmouth- Jarrow and remained the abbot for sixteen years. Monkwearmouth and Jarrow together housed about 600 monks. Bede commented on the character of Benedict Biscop.Bede; James Patterson; Peter Wilcock; et al., Lives of the First Five Abbots of Wearmouth & Jarrow: Benedict, Ceolfrid, Eosterwine, Sigfrid and Huetbert (Sunderland: Hills & Co., 1910), pp. 64–65 Benedict was modest and unassuming. He went about his daily tasks the same as abbot of his twin- monasteries as he had done as a monk. He liked to join the other monks in their duties whether it was in the kitchen or threshing grain. He enjoyed working in the bakery as much as working in the gardens. As the master he was gentle and kind in keeping order among the other monks. He took all his meals with the other monks and ate what they ate.Bede; James Patterson; Peter Wilcock; et al., Lives of the First Five Abbots of Wearmouth & Jarrow: Benedict, Ceolfrid, Eosterwine, Sigfrid and Huetbert (Sunderland: Hills & Co., 1910), pp. 66–67 Benedict slept in the same small cell as any other monk would. As he lay dying he asked for all the monks to assemble around him so he could say goodby. He died on 7 March 685. His assistant Ceolfrith replaced Benedict as abbot of both Monasteries.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 185 == Notes == == References == == Other websites == * St. Benedict Biscop * St. Benedict Biscop, Abbot Category:620s births Category:680s deaths Category:English Christians Category:People from Northumbria",
 "title": "Benedict Biscop"
}