{
 "id": "428674",
 "text": "John Christopher McGinley (born August 3, 1959) is an American actor, writer, producer, author, a board member and international spokesman for the Global Down Syndrome Foundation, and a spokesman for the National Down Syndrome Society. He is known for his roles as Perry Cox in Scrubs, Bob Slydell in Office Space, Sergeant Red O'Neill in Oliver Stone's Platoon and Marv in Stone's Wall Street. He has also written and produced for television and movies. McGinley is also an author and a spokesperson for the National Down Syndrome Society. ==Filmography== Year Title Role Notes 1986 Sweet Liberty Floyd 1986 Platoon Sergeant O'Neill 1987 Wall Street Marvin 1988 Talk Radio Stu 1988 Shakedown Sean Phillips 1989 Lost Angels Dr. Farmer 1989 Born on the Fourth of July Official #1 – Democratic Convention, Pushing Wheelchair 1989 Fat Man and Little Boy Capt. Richard Schoenfield, MD 1989 Suffering Bastards Buddy Johnson Writer 1991 Point Break FBI Agent Ben Harp 1991 Highlander II: The Quickening David Blake 1992 Article 99 Dr. Rudy Bobrick 1992 Cruel Doubt Attorney Jim Vos Burgh 1992 A Midnight Clear Major Griffin 1993 Hear No Evil Mickey O'Malley 1993 Watch It Rick Producer 1994 On Deadly Ground MacGruder 1994 Surviving the Game John Griffin 1994 Car 54, Where Are You? Officer Francis Muldoon 1994 Wagons East Julian Rogers 1995 Born to Be Wild Max Carr 1995 Seven California (SWAT leader) 1995 Nixon Earl in Training Film 1996 Marine Captain Hendrix 1996 Set It Off Detective Strode 1996 Mother Carl 1997 Flypaper Joe 1997 Colin Fitz Lives! Colin Fitz 1997 Intensity Edgler Foreman Vess 1997 Truth or Consequences, N.M. Eddie Grillo 1997 Nothing to Lose Davis 'Rig' Lanlow 1998 Target Earth Agent Vincent Naples 1998 The Pentagon Wars Col. J.D. Bock 1999 Office Space Bob Slydell 1999 Any Given Sunday Jack Rose 1999 Three to Tango Strauss 1999 Woody 2000 Get Carter Con McCarty 2001 Summer Catch Hugh Alexander Uncredited 2001 Sgt. Sisk 2002 Stealing Harvard Detective Charles 2002 Highway Johnny the Fox 2002 Crazy as Hell Parker 2002 It's a Very Merry Muppet Christmas Movie Himself 2003 Identity George York 2005 Alien Planet Narrator 2006 Puff, Puff, Pass Jerry Dupree 2006 A.W.O.L. Garris 2006 Two Tickets to Paradise Mark Won - Method Fest - Festival Directors Award 2007 Wild Hogs Gay Highway Patrolman 2007 Are We Done Yet? Chuck Mitchell Jr. 2008 American Crude Jim 2009 Life's a Trip Mark Hewson 2009 Superman/Batman: Public Enemies John Corben / Metallo (voice) Direct-to-video 2012 Alex Cross Richard Brookwell 2012 Watercolor Postcards Merlin 2013 42 Red Barber 2014 Kid Cannabis John Grefard 2016 Get a Job Diller 2016 The Belko Experiment Wendell Dukes 2016 The Drowning Teddy 2017 Battle of the Sexes Herb 2017 The Good Catholic Father Ollie 2018 Benched Don ==References== ==Other websites== * * Category:1959 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Comedians from New York City Category:Writers from New York City",
 "title": "John C. McGinley"
}