{
 "id": "428885",
 "text": "The Airbus A350 XWB (XWB standing for Extra Wide Body) is a type of airplane built by European aerospace company Airbus. It is a wide-body, long-ranged aircraft. The plane is able to carry between 300 and 410 passengers in a 3-class configuration. On January 15, 2015, the A350-900 entered service with Qatar Airways, and the A350-1000 on February 24, 2018 with the same airline. It has suffered one complete hull-loss with Japan Airlines Flight 516 during the Haneda runway collision incident on January 2, 2024. Nevertheless, it is one of the safest and most technically advanced aircrafts of all time. ==Variants== === A350-900 (A359/359) === The A350-900 is s a wide-body, twin- engined aircraft made by Airbus. It is the shortest plane in its family, which holds 300-350 passengers in a three-class configuration. This plane is the first of its family. ==== A350-900ULR ==== The A350-900ULR is the upgraded version of the A350-900, which \"ULR\" stands for Ultra Long Range. Its larger fuel tanks allow for a longer range of 9,700 nm. The first operator of the type is Singapore Airlines in 12 October 2018. ===A350-1000 (A35K/351)=== The A350-1000 is a wide body twin engined aircraft made by Airbus. It is the lengthened version of the A350-900 that is 7 meters longer than the A350-900, and can hold 350-410 passengers when arranged in a three-class configuration. == Specifications == Airbus A350 Characteristics Model A350-900/-900ULR A350-1000 A350F Cockpit crew Two Seating 315 (48J+267Y) 369 (54J+315Y) 11 Max limit 440 480 Cargo capacity 36 LD3 or 11 pallets 44 LD3 or 14 pallets 40 upper deck containers + 30 lower deck LD3 Overall length 66.8 m (219.2 ft) 73.79 m (242.1 ft) 70.8 m (232.2 ft) Wing 64.75 m (212.43 ft) span, 31.9° sweep Aspect ratio 9.49 9.03 Wing area 442 m2 (4,760 sq ft) 464.3 m2 (4,998 sq ft) Overall height 17.05 m (55 ft 11 in) 17.08 m (56 ft 0 in) Fuselage 5.96 m (19.6 ft) width, 6.09 m (19.98 ft) height Cabin width 5.61 m (18 ft 5 in), 5.71 m (18 ft 9 in), 9-abreast seat: 18 in (46 cm) MTOW 283 t (623,908 lb) ULR: 280 t (620,000 lb) 319 tonnes (703,000 lb) Max payload 53.3 t (118,000 lb) 45.9–56.4 t (101,300–124,300 lb) 67.3 t (148,000 lb) 111 t (245,000 lb) Fuel capacity 140.8 m3 (37,200 US gal) 110.5 t (244,000 lb) ULR: 170 m3 (44,000 US gal) 158.8 m3 (42,000 US gal) 124.65 t (274,800 lb) OEW 142.4 t (314,000 lb) typical 134.7–145.1 t (297,000–320,000 lb) 155 t (342,000 lb) dry 124.4 t (274,000 lb) 131.7 t (290,000 lb) MEW 115.7 t (255,075 lb) 129 t (284,000 lb) Engines (2×) Rolls-Royce Trent XWB Max thrust (2x) 5 97,000 lbf (431.5 kN) Cruise speed Mach 0.85 (488 kn; 903 km/h; 561 mph) Typical, Mach 0.89 (513 kn; 950 km/h; 591 mph) Maximum Range 8,300 nmi (15,372 km; 9,600 mi) 8,700 nmi (16,100 km; 10,000 mi) 4,700 nmi (8,700 km; 5,400 mi) Takeoff (MTOW, SL, ISA) 2,600 m (8,500 ft) Landing (MLW, SL, ISA) 2,000 m (6,600 ft) Service ceiling 43,100 ft (13,100 m) 41,450 ft (12,630 m) File:China Airlines (Taiwan) Airbus A350-941 B-18917 arriving at JFK Airport.jpg|China Airlines (Taiwan) Airbus A350-941 B-18917 arriving at JFK Airport File:Singapore Airlines A350-900 (9V-SMS) @ MAN, Sept 2019.jpg|An A350 of Singapore Airlines File:Qatar Airways (A7-ALH) Airbus A350-941 MSN-012.jpg|An A350 of Qatar Airways File:Cathay Pacific A350-900 (B-LRJ) @ DUS, Dec 2017.jpg|A Cathay Pacific A350 File:Airbus A350-941 ‘N502DN’ Delta Air Lines (48644053197).jpg|An A350 of Delta Air Lines == Incidents and accidents == The fleet of A350s was involved in one hull-loss accident that occurred on 2 January 2024, when Japan Airlines Flight 516, an A350-900, collided on the runway with a de Havilland Canada DHC-8. ==References== Category:Airbus aircraft",
 "title": "Airbus A350 XWB"
}