{
 "id": "428809",
 "text": "Sino-Vietnamese characters () are Chinese-style characters read as either Vietnamese or as Sino-Vietnamese. When they are used to write Vietnamese, they are called Nôm. The same characters may be used to write Chinese. In this case, the character is given a Sino-Vietnamese, or Han-Viet, reading. Han-Viet is a system that allows Vietnamese to read Chinese. It is equivalent to pinyin in English. Some of these characters are also used in China; others are used only in Vietnam. Chinese characters were introduced to Vietnam when the Han Empire invaded the country in 111 BC. Even after Vietnam became independent in AD 939, the country continued to use Classical Chinese () for official purposes. In the 1920s, Vietnam shifted from traditional characters to the Latin alphabet. The Han-Nom Institute was founded in Hanoi in 1970 to collect and study documents written in the traditional script. The institute has submitted a list of 19,981 Sino-Vietnamese characters to Unicode for electronic encoding. This includes a core set of 9,299 characters called the Nôm Ideographs. == History == Chinese characters were introduced to Vietnam after the Han Empire conquered the country in 111 BC. Independence was achieved in 939, but the Chinese writing system was adopted for official purposes in 1010. Soon after the country achieved independence, Vietnamese began to use Chinese characters to write their own language. The Van Ban bell, engraved in 1076, is the earliest known example of a Nôm inscription. Nguyen Thuyen composed Nôm poetry in the 13th century. However, none of his work has survived. The oldest surviving Nôm text is the collected poetry of King Tran Nhan Tong, written in the 13th century. Classical Chinese was used by the royal court and for other official purposes. The Temple of Literature in Hanoi was the best-known school for the study of Chinese. The civil service examination tested knowledge of Chinese. It was given once every three years. Students who passed the exam could go on to become magistrates. Confucian scholars saw Chinese as the language of education and looked down on Nôm. Popular opinion favored Nôm. Some kings thought that all writing should be done in Chinese. They suppressed Nôm. Other kings promoted Nôm. In 1867, King Tu Duc issued a decree encouraging the use of Nôm. Only a small percentage of the population was literate in any language. But nearly every village had at least one person who could read Nôm aloud for the other villagers. Jean-Louis Taberd wrote the first Nôm dictionary in 1838. In 1910, the colonial school system adopted a \"Franco-Vietnamese curriculum\", which emphasized French and alphabetic Vietnamese. The Vietnamese alphabet is a form of the Latin alphabet that includes tone marks. On December 28, 1918, King Khai Dinh declared that the traditional writing system no longer had official status. The civil service exam was given for the last time at the imperial capital of Hue on January 4, 1919. The examination system, and the education system based on it, had been in effect for almost 900 years. China itself stop using Classical Chinese soon afterward as part of the May Fourth Movement. ==Language issues == Chinese characters are used to write various languages in China and elsewhere, including Mandarin, the most widely spoken language in China, Cantonese, spoken in Hong Kong and southern China, and Classical Chinese, traditionally used for formal writing. The characters were formerly used in Korea and in Vietnam. Japan uses a mix of Chinese characters and two native phonetic writing systems. Even characters that retain their original meaning in all languages may be read in various ways. The character 十 is pronounced as shí in Chinese romanization (pinyin), jū in Japanese romanization (Hepburn), sip in Korean romanization (Revised Romanization), and thập in the Han-Viet system used in Vietnam. In all these languages, the meaning of the character is “ten.” The majority of the characters used in Nôm are of Chinese origin, chosen because they have an appropriate pronunciation or meaning. For example, the character used to write the word \"Nôm\" 喃 is pronounced nán in Chinese and means “chattering.”This character (, ) is identical to the character for “chattering” and is derived from it. So Nôm does not mean “southern\" (nam, 南), as sometimes claimed. The fit between the Chinese character and the Vietnamese word is not always exact. The word \"Nôm\" does not have any negative connotation in Vietnamese, but rather suggests plain talk, something easy to understand. Nôm includes thousands of characters not found in Chinese. In contrast, Japan developed only a few hundred kokuji, most of them describing plants and animals found only in Japan. Korea had just a small number of rarely used gukja. These characters were created by writers who combined pre- existing elements. One element, called the radical, indicates the character's meaning, or at least a semantic category. The other element, called the remainder, gives pronunciation. This is similar to how most Chinese characters are written. Like Chinese, Vietnamese is a tonal language. In contrast, Japanese and Korean can be written in phonetic scripts that do not indicate tone. ==Readings== When a character is read as Vietnamese, it is romanized according to its Nôm reading. When it is read as Chinese, it can be romanized into Vietnamese as Han-Viet, or into English as pinyin. The chart below uses a darker background to display the Nôm Ideographs (V0 to V3), considered to be the core Nôm character set. Hán Nôm Ideographs Ideograph Composition Readings English Codepoint V Source Status in Chinese Nôm Han-Viet Pinyin ⿰女美 mẹ mĩ mĕi mother U+5A84 V0-347E Kangxi, HDZ ⿰亻⿱𠂉昜 thương thương shāng to love U+50B7 V1-4C22 Kangxi, HDZ, HK glyph ⿰亻等 đấng đẳng děng Used in đấng anh hùng (heroes) U+203AC V2-6E62 None ⿰口湿 nhấp thấp shī Used in nhấp nhổm (anxious) U+20FBE V3-3059 None ⿰育个 dọc dục yù Used in bực dọc (frustrated) U+2B1A1 V4-5224 None ⿰朝乙 giàu triêu cháo wealthy U+2B86F V4-405E None ⿰月報 béo báo bào fat U+F04A5Not yet in unicode. This is a temporary code assigned by the Nôm Foundation. V+63D0AThis code is from Nguyen Quang Hong,Tự Điển Chữ Nôm Dẫn Giải (2014), p. 106. None Key: Kangxi and HDZ (Hanyu Da Zidian) are comprehensive Chinese dictionaries. The HK glyphs are a set of nearly 5,000 glyphs taught in the Hong Kong school system. Sources: , . The Nôm readings are from the Vietnamese Nôm Preservation Foundation, Han-Viet is from Hán Việt Từ Điển, and pinyin is from Purple Culture. ==Encoding== In 1994, the Ideographic Rapporteur Group agreed to include Sino-Vietnamese characters in Unicode. In 1993-2001, the Han-Nom Institute assembled a collection of 9,299 “Nôm Ideographs\" in four sets. These are the V0, V1, V2, and V3 characters shown below. A Sino-Vietnamese character is first assigned a V Source code, and later a codepoint. These codes are used to transmit and store the character electronically. An appropriate font must be installed to render them. The Nôm Ideographs were extracted from two dictionaries published in the 1970s, one in Saigon and the other in Hanoi. V Source annotations were added to the glyphs that were already encoded. The rest were assigned codepoints in Extension B. The Hán Nôm Coded Character Repertoire (2008) integrates the work of the Han-Nom Institute with that of the U.S.-based Vietnamese Nôm Preservation Foundation. This book presents a comprehensive list of 19,981 Sino-Vietnamese characters, including the Nôm Ideographs, manuscript variants, characters formerly used by the Tay people of northern Vietnam, as well as numerous Chinese characters with Han-Viet readings. Set Characters Unicode block Standard Date Example Sources V0 2,246 Basic Block (593), A (138), B (1,515) TCVN 5773:1993 2001 ten, U+28492 V1 3,311 Basic Block (3,110), C (1) TCVN 6056:1995 1999 happiness, U+559C Vũ Văn Kính & Nguyễn Quang Xỷ 1971, V2 3,205 Basic Block (763), A (151), B (2,291) VHN 01:1998 2001 fit, match, U+230E4 V3 535 Basic Block (91), A (19), B (425) VHN 02:1998 2001 not, U+20059 Manuscripts V4 785 Extension C The V4 set is split between extensions C and E. It contains 2,230 characters. 2009 𪝌 to get, U+2A74C , , V4 1,028 Extension E 2015 noodle soup, U+2C5BE V5 ~900 This set was proposed in 2001, but the characters were already encoded. No V Source was added. 2001 spear, U+39B8 Vũ Văn Kính & Nguyễn Quang Xỷ 1971, Hồ Lê 1976 V6 ~8,000 Basic Block, Extension A Assembled by the Nôm Na Group. Most of these are Chinese characters that are already encoded. Projected einsteinium, U+9384 Sources: , , and ==Notes== ==Citations== ==Bibliography== * . This books lists 8,187 Nom characters. * * * . This is the most comprehensive Nôm dictionary with over 19,000 characters. * * . Hồng was the leader of the Nôm encoding project. This dictionary contains 12,000 entries. * * . This article tells how the Nom Na Tong font was created. * * * This first Nôm dictionary. * * Ngô's group was sponsored by the Nôm Foundation. This work was later integrated into the Hán Nôm Coded Character Repertoire (2008). * This is a comprehensive bibliography. * . This book contains 17,761 Sino-Vietnamese characters. * * * * * This is the most widely available Nôm reference. It is an updated version of Vũ Văn Kính’s 1971 work. * ==Fonts== Some characters in this article may require the installation of an additional font to display properly: * Hanamin B – This Japanese font supports nearly 90,000 characters, including those in Unicode CJK Extension C. * NomNaTongLight – This font, created by the Vietnamese Nôm Preservation Foundation, is based on characters found a 1933 woodblock print . * Han Nom Font Set – This open source font supports over 70,000 Unicode CJK codepoints. * Fonts for Chu Nom. How to display and use Han-Nom characters. ==Other websites== * Chunom.org \"This site is about Chu Nom, the old writing system of Vietnam.\" * Vietnamese Nôm Preservation Foundation. Features a dictionary with the complete set of Sino- Vietnamese characters. * Han-Nom Collection , digitized manuscripts held by the National Library of Vietnam. * Han-Nom Research Institute * Tạp chí Hán Nôm [Journal of Han-Nom Studies] * Ngành Hán Nôm . A four-year program in Han- Nom is offered at the University of Social Sciences and Humanities of Ho Chi Minh City. * Cách Gõ Chữ Hán Nôm - WinVNKey Software to allow the entry of Han-Nom characters by reading. * 倉頡之友《倉頡平台2012》 Cangjie input method for Windows that allows keyboard entry of all Unicode CJK characters by character shape. Supports over 70,000 characters. Users may add their own characters and character combinations. Category:Writing systems Category:Vietnam",
 "title": "Sino-Vietnamese characters"
}