{
 "id": "42899",
 "text": "Daylight saving time (DST) or summer time (ST) is a time to keep during summer. During the summer months, the sun stays visible for a longer time, and sunset happens late in the day. For this reason, certain countries advance the time by one hour near the start of summer, and put it back one hour during autumn. DST helps stores that sell to people after they get off work, and it does not hurt farmers and others whose hours are set by the sun. It cuts traffic accident rates. Sometimes it can reduce energy costs, but it can also increase them. Most of the world's countries do not use DST, but it is common in Europe and North America. The United States, Australia, the United Kingdom, Canada and many other countries have DST. These countries also have regions that do not have DST: *United States: most of Arizona and Hawaii *Australia: Queensland, Western Australia and the Northern Territory *Canada: Saskatchewan except for a few locations with the border with Alberta and Manitoba, and the Yukon Territory Iceland, Russia, Belarus, and some parts of Ukraine are countries in Europe without DST. , the following places plan to start and end DST at the following times:. Detailed DST information about each location, current and historical, can be found under the relevant section of this website, and can be referred to for information in this article unless otherwise specified. Places DST start DST end Shift * Bahamas * Bermuda * Canada, except Yukon, most of Saskatchewan, and parts of British Columbia (northeast), Nunavut (Southampton Island), Ontario (Atikokan) and Quebec (Le Golfe-du-Saint-Laurent) * Greenland: Pituffik Space Base * Haiti * Mexico: Baja California, and municipalities near the U.S. border except in Sonora * Saint Pierre and Miquelon * Turks and Caicos Islands * United States, except Arizona (without Navajo Nation), Hawaii and U.S. territories Second Sunday in March at 02:00 First Sunday in November at 02:00 1 hour * Cuba Second Sunday in March at 00:00 First Sunday in November at 01:00 1 hour * European Union, except Overseas France * Akrotiri and Dhekelia * Albania * Andorra * Bosnia and Herzegovina * Faroe Islands * Gibraltar * Greenland, except Pituffik Space Base and east coast of National Park * Guernsey * Isle of Man * Jersey * Kosovo * Liechtenstein * Monaco * Montenegro * North Macedonia * Northern Cyprus * Norway * San Marino * Serbia * Switzerland * Ukraine, except occupied territories * United Kingdom * Vatican City Last Sunday in March at 01:00 [UTC] Last Sunday in October at 01:00 [UTC] 1 hour * Moldova * Transnistria Last Sunday in March at 02:00 Last Sunday in October at 03:00 1 hour * Lebanon Last Sunday in March at 00:00 Last Sunday in October at 00:00 1 hour * Israel Friday before last Sunday in March at 02:00 Last Sunday in October at 02:00 1 hour * Palestine Second Saturday after Ramadan at 02:00 Saturday before last Sunday in October at 02:00 1 hour * Egypt Last Friday in April at 00:00 Last Thursday in October at 24:00 1 hour * Chile, except Magallanes Region First Saturday in September at 24:00 [UTC−04:00] First Saturday in April at 24:00 [UTC−03:00] 1 hour * Paraguay First Sunday in October at 00:00 Fourth Sunday in March at 00:00 1 hour * Australia: Australian Capital Territory, Jervis Bay Territory, New South Wales (except Lord Howe Island), Norfolk Island, South Australia, Tasmania and Victoria First Sunday in October at 02:00 First Sunday in April at 03:00 1 hour * Australia: Lord Howe Island First Sunday in October at 02:00 First Sunday in April at 02:00 30 minutes * New Zealand Last Sunday in September at 02:00 [UTC+12:00] First Sunday in April at 02:00 [UTC+12:00] 1 hour In the table above, the DST times show the time before being moved forward or back. The shift is how much time is added at the DST start time and subtracted at the DST end time. For example, in Canada and the United States, the local time changes from 02:00 to 03:00 when DST starts and from 02:00 to 01:00 when DST ends. If a time zone is listed (e.g., UTC−04:00), all time zones in a country move forward and backward simultaneously; otherwise, time zones change in their local time. Areas shown in the same color start and end DST within less than a week of each other. == Europe == === European Union === Since 1971 all clocks in the European Union have changed on same dates and at the same time, 06:00 GMT.British Summer Time European Summer Time begins (clocks go forward) at 01:00 UTC on the last Sunday in March, and ends (clocks go back) at 01:00 UTC on the last Sunday in October: Start End ? ? === United Kingdom === Permanent Summer Time has support in some northerly countries such as the UK. It was tried in the British Standard Time experiment, with Britain remaining on GMT+1 throughout the year. This took place between 27 October 1968 and 31 October 1971. There are proposals for GMT+1 in the winter, and DST summer time (GMT+2) in the summer. In favour are most city dwellers: children do not have to come home after school in the dark, and late afternoon and early evening activities benefit. In favour also were those concerned with accidents, because both accidents and fuel consumption go down.RoSPA suggests this would reduce the number of accidents over this period as a result of the lighter evenings. Against are many farmers in northerly latitudes, because sunrise would occur in winter at about 10:00 in the morning. However, in March 2010 the National Farmers Union said that it was not against Single/Double Summer Time, and is in fact relatively neutral, with many farmers expressing a preference for the change. == Middle East and North Africa == === Egypt === === Israel === === Lebanon === === Palestine === == North America == === United States === The following table lists future starting and ending dates of daylight saving time in the United States: Year Start End === Canada === == South America == === Chile === === Paraguay === == Oceania == === Australia === === New Zealand === == Automatic adjustment == Most mobile phones and computers connected to the Internet will automatically adjust their clocks for DST. Some computers will not adjust or will adjust the time incorrectly or on the wrong date. Also, computers with more than one operating system may be incorrectly adjusted twice or more when each operating system boots. == Notes == == References == == Other websites == * Daylight Saving Time – Time Change. TimeAndDate.com * About Daylight Saving Time - History, rationale, laws & dates . WebExhibits Category:Time zones",
 "title": "Daylight saving time"
}