{
 "id": "429266",
 "text": "Big Hero 6 is an American computer animated superhero buddy comedy movie based on the Marvel Comics superhero comic that has the same name. It was released on November 5, 2014 by Walt Disney Studios Motion Pictures. The movie grossed over $651.8 million worldwide making it the highest-grossing animated movie of 2014, it also won the 87th Oscars for best animated feature. The movie is about a boy named Hiro. He lives in the city of San Fransokyo (a mixture of Tokyo and San Francisco). He changes himself and his friends into high-tech heroes to protect the city. One of his friends is Baymax, a robot created by Tadashi (Hiro's brother). Baymax's only purpose is to take care of people. == Voice cast == * Scott Adsit as Baymax, an inflatable robot built by Tadashi as a medical assistant. * Ryan Potter as Hiro Hamada, a 14-year-old robotics prodigy. Speaking of the character, Hall said \"Hiro is transitioning from boy to man, it's a tough time for a kid and some teenagers develop that inevitable snarkiness and jaded attitude. Luckily Ryan is a very likeable kid. So no matter what he did, he was able to take the edge off the character in a way that made him authentic, but appealing\". * Daniel Henney as Tadashi Hamada, Hiro's older brother and Baymax's creator. On Tadashi and Hiro's relationship, Conli said \"We really wanted them to be brothers first. Tadashi is a smart mentor. He very subtly introduces Hiro to his friends and what they do at San Fransokyo Tech. Once Hiro sees Wasabi, Honey, Go Go, and Fred in action, he realizes that there's a much bigger world out there that really interests him\". * T.J. Miller as Fred, a comic book fan and slacker who is also a team mascot at the San Fransokyo Institute of Technology. Speaking of Miller, co- director Chris Williams said \"He's a real student of comedy. There are a lot of layers to his performance, so Fred ended up becoming a richer character than anyone expected\", both literally and metaphorically. * Jamie Chung as Go Go Tomago, a tough and athletic student who specializes in electromagnetics. Hall said \"She's definitely a woman of few words. We looked at bicycle messengers as inspiration for her character\". * Damon Wayans Jr. as Wasabi, a smart and neurotic youth who specializes in lasers. On the character, Williams said \"He's actually the most conservative, cautious—hesic the most normal among a group of brazen characters. So he really grounds the movie in the second act and becomes, in a way, the voice of the audience and points out that what they're doing is crazy\". * Genesis Rodriguez as Honey Lemon, a chemistry enthusiast at the San Fransokyo Institute of Technology. Williams said, \"She's a glass-is-half-full kind of person. But she has this mad- scientist quality with a twinkle in her eye – there's more to Honey than it seems\". Rodriguez reprised her role in the Latin American Spanish dub of the film. * James Cromwell as Robert Callaghan / Yokai, the head of a robotics program at the San Fransokyo Institute of Technology who becomes an extremely powerful masked supervillain to exact revenge on Krei. * Alan Tudyk as Alistair Krei, a pioneer entrepreneur, tech guru and the CEO of Krei Tech. * Maya Rudolph as Cass Hamada, Hiro and Tadashi's aunt and guardian. * Katie Lowes as Abigail Callaghan, the daughter of Professor Callaghan and a test pilot for Krei Tech. * Daniel Gerson as Desk Sergeant Gerson, the desk sergeant for the San Fransokyo Police Department. * Paul Briggs as Yama, a gangster who seeks revenge on Hiro after he defeats his robot in a clandestine fight with illegal betting. * David Shaughnessy as Heathcliff, Fred's family butler. * Billy Bush as a newscaster * Stan Lee as Fred's father, who appears during the tour of Fred's home in a family portrait and briefly appears in the film's post-credits scene where it is revealed that he was once a superhero. ==Possible sequel== On February 18, 2015, the film's directors, Don Hall and Chris Williams, said a sequel was possible, and that they were interested, but that it was too soon to make that decision. However, Hall added, \"Having said that, of course, we love these characters, and the thought of working with them again some day definitely has its appeal.\" In March 2015, Génesis Rodríguez told MTV that a sequel was being considered, saying, \"...There's nothing definitive. There's talks of something happening. We just don't know what yet.\" In April 2015, former Marvel editor Stan Lee mentioned the franchise as one of several that he understood were in Marvel's plans for upcoming films. In March 2021, head animator Zach Parrish expressed a desire for a sequel, \"There have definitely been stories told beyond... I think there's still a lot of potential. There's still plenty of time. The beauty of animation is that can pick up the story at the very end of Big Hero, or we could jump in time. We could go wherever we want, since it's animation.\" == References == Category:2014 action movies Category:2014 computer-animated movies Category:2014 comedy movies Category:2014 science fiction movies Category:2010s superhero movies Category:Academy Award winning movies Category:American action comedy movies Category:American buddy movies Category:American science fiction movies Category:Comedy science fiction movies Category:Disney animated movies Category:English-language movies Category:Movies about revenge Category:Movies that won the Best Animated Feature Academy Award",
 "title": "Big Hero 6 (movie)"
}