{
 "id": "429210",
 "text": "The Apollo Lunar Module (LM) is a spidery-looking lander that landed on the moon. It was built for the US Apollo program to carry a crew of two from lunar orbit to the surface and back. The LM was the last of the Apollo “hardware” to be developed. Its start had been delayed while NASA made up its mind to take the lunar-orbit meeting approach and thus require a vehicle like the LM for a landing. A contract with the prime builder was signed on January, 1963, almost two years after the Apollo project began. The LM was tested several times in space.Moon Race: The History of Apollo DVD, Columbia River Entertainment (Portland, Oregon, 2007) Finally, on July 20, 1969 the Apollo 11 LM Eagle made the first manned lunar landing. As Apollo missions progressed, Apollo 12, 14, 15, 16, 17 had lunar landings using their LMs. Apollo 13 had a terribly dangerous accident when an oxygen tank exploded. The Apollo 13 Lunar module, called Aquarius, played an unexpected role in saving the lives of the three astronauts after the explosion. == Specifications == The LM was consisted of an ascent stage and decent stage. === Descent stage === This was the unmanned lower part of the LM. it looked like octagonal-shaped. It was made of aluminum alloy and had four legs for landing. It had a descent rocket engine, and batteries and various supplies and scientific equipment to be used when landing on the moon and during the astronauts’ stay on the moon. To land on the moon, the descent engine would be fired to begin the LM’s drop from out in lunar orbit down toward the moon. LM could descend vertically and hover above the surface of moon. After the two men finished their stay on the surface, the ascent stage, sitting on the descent stage, would use its ascent engine firing to lift itself off the moon. === Ascent stage === This was the roundish upper half of the LM, the command center and crew cabin as well as the launching rocket for leaving the moon. To save weight, there were no seats for the men. They would stand, loosely held in place by straps. In front and on either side of them were control panels for the LM’s guidance, communication, environment and propulsion systems. On the left side, there was a window by which commander could look out to steer the LM. Overhead in the middle section was the of diameter hatch where the astronauts transferred to and from the Command Module when two vehicles were linked. LM’s ascent rocket to meet Command Module was below the deck of the midsection. Although ascent rocket was small, it was sufficient because the moon’s weak gravity – one-sixth that of earth’s – meant that the LM would not require a strong push to rise from the lunar surface. == First flight of Lunar Module == On Monday, January 22, 1968, a 16-ton unmanned Lunar Module surrounded by a protective shield stood on top of a two-stage Saturn 1-B rocket called Apollo 5. This flight was made to do two important tests. One was to check separating stage from main rocket. The second was to check test firing of the descent engine, but this mission did not succeed. The Apollo 5 test ended after eight hours, and the LM remained in earth orbit. It eventually dropped into the atmosphere and burned up. == Related pages == * Apollo Command/Service Module * Apollo program * NASA == References == == Other websites == * 50 Years Ago: The Apollo Lunar Module * Google Moon overview of Apollo landing sites * NASA catalog: Apollo 14 Lunar Module * Demonstration of the Lunar Excursion Module and explanation of its systems * Space/Craft Assembly & Test Remembered * We Called It 'The Bug' , * Apollo 11 LM Structures handout for LM-5 (PDF) * Apollo Operations Handbook, Lunar Module (LM 10 and Subsequent), Volume One. Subsystems Data (PDF) * Apollo Operations Handbook, Lunar Module (LM 11 and Subsequent), Volume Two. Operational Procedures * Apollo 15 LM Activation Checklist for LM-10 * Lunar module launch video Category:Apollo program Category:NASA spacecraft",
 "title": "Apollo Lunar Module"
}