{
 "id": "429425",
 "text": "Nuufolau Joel \"Joe\" Seanoa (born March 17, 1979), better known by the ring name Samoa Joe, is an American professional wrestler. He is currently signed to All Elite Wrestling (AEW) and also wrestles in their sister company, Ring of Honor (ROH). Joe is also known for his time in Total Nonstop Action Wrestling and WWE, where he competed on the NXT and Raw brands. He first wrestled for Ring of Honor (ROH) from 2002 to 2007. During his time in ROH, he held the ROH World Championship for a record 21 months. During his time in AEW, Joe has been a one-time AEW World Champion and a two-time AEW TNT Champion. ==Career== ===All Elite Wrestling=== On April 1, 2022, at Supercard of Honor XV, Joe returned to Ring of Honor and was announced as the newest signing of AEW by Tony Khan. On the April 6 episode ofDynamite, Joe defeating Max Caster in his AEW debut to qualify for the 2022 Owen Hart Foundation Tournament. The following week, Joe defeated Minoru Suzuki to win the ROH World Television Championship, this made him an ROH Triple Crown winner. Joe defeated Johnny Elite in the quarter-finals and Kyle O'Reilly in the semi- finals of the Owen Hart Foundation Tournament, but losing to Adam Cole in the final at Double or Nothing on May 29. At Full Gear in November 2022, Joe defeated Wardlow and Hobbs to win the TNT Championship. He then began calling himself the \"King of Television\". On January 4, 2023, Joe lost the TNT Championship to Darby Allin, but won it back from him on February 1 in a No Holds Barred match. After the match, he was attacked by a returning Wardlow. Joe lost the TNT Championship to Wardlow at Revolution on March 5. At All In in August 2023, Joe lost to CM Punk in a match for the \"Real World Championship\". This would be Punk's last match in AEW, because he was officially fired from AEW after another backstage altercation. Joe then won the Grand Slam World Championship Eliminator Tournament to get a match for the AEW World Championship. At Grand Slam on September 20, he lost his championship match against champion MJF. On November 10, Joe vacated the ROH World Telvision championship to focus on challenging for the AEW World Championship. 8 days before he became the longest-regning holder of that title at 574 days. At New Year's Smash on December 27, Joe was supposed to team with MJF to defend the ROH World Tag Team Championships in place of an injured Adam Cole. Before the match, it looked like Joe was attacked by The Devil's Masked Men (who were later revealed to be Matt Taven and Mike Bennett) backstage. MJF would fight The Devil's Masked Men in a two-on-one Handicap match but lost the match and the titles. It was then revealed that Joe faked the attack and then attacked MJF after the match. At Worlds End, Joe defeated MJF to become the new AEW World Champion. At Dynasty on April 21, 2024, Joe lost the title to Swerve Strickland. ==Championships== * All Elite Wrestling ** AEW TNT Championship (2 times) ** AEW World Championship (1 time) **AEW World Trios Championship (1 time, current) - with Katsuyori Shibata and Powerhouse Hobbs ** Grand Slam World Championship Eliminator Tournament (2023) *Ballpark Brawl **Natural Heavyweight Championship (1 time)1 * CBS Sports ** Commentator of the Year (2020) ** Smack Talker of the Year (2018) *Extreme Wrestling Federation **Xtreme 8 Tournament (2006) *Independent Wrestling Association Mid-South **Revolution Strong Style Tournament (2004) * German Wrestling Association ** GWA Heavyweight Championship (1 time) *Pro Wrestling Illustrated **He was ranked #4 of the 500 best singles wrestlers in the PWI 500 in 2006. **He was ranked #4 of the 500 best singles wrestlers in the PWI 500 in 2008. **PWI Feud of the Year (2007) (vs. Kurt Angle) **PWI Most Popular Wrestler of the Year (2006) *Pro Wrestling Noah **GHC Tag Team Championship (one time) (with Magnus) *Pro Wrestling Zero-One **NWA Intercontinental Tag Team Championship (one time)2 (with Keiji Sakoda) * Ring of Honor ** ROH Hall of Fame (class of 2022) ** ROH Pure Championship (1 time) ** ROH Triple Crown Champion ** ROH World Championship (1 time) ** ROH World Television Championship (1 time) *SoCal Uncensored **Rookie of the Year (2000) *Total Nonstop Action Wrestling **TNA World Heavyweight Championship (1 time) **TNA Television Championship (1 time) **TNA World Tag Team Championship (2 times) – by himself (1)3, with Magnus (1) **TNA X Division Championship (4 times) **King of the Mountain (2008) **Maximum Impact Tournament (2011) **Super X Cup (2005) **Turkey Bowl (2007) **Feast or Fired (2009 – TNA World Heavyweight Championship contract) **Wild Card Tournament (2011) (with Magnus) **Third TNA Grand Slam Champion (one time) **Third TNA Triple Crown Champion (one time) **Mr. TNA (2006) **Mr. X Division (2006) **Feud of the Year (2006–2007) (with Kurt Angle) **Finisher of the Year (2007) (Muscle Buster) *Twin Wrestling Entertainment **TWE Heavyweight Championship (one time) *Ultimate Pro Wrestling **UPW Heavyweight Championship (one time) **UPW No Hold Barred Championship (two times) *United Independent Wrestling Alliance **UIWA Tag Team Championship (two times) *Wrestling Observer Newsletter **5 Star Match (2004) (vs. CM Punk at ROH Joe vs. Punk II on October 16) **5 Star Match (2005) (vs. AJ Styles and Christopher Daniels at TNA Unbreakable on September 11) **5 Star Match (2005) (vs. Kenta Kobashi at ROH Joe vs. Kobashi on October 1) **Best Brawler (2006) **Match of the Year (2005) (vs. Kenta Kobashi, ROH Joe vs. Kobashi, October 1) **Most Outstanding Wrestler (2005) * WWE ** Dusty Rhodes Tag Team Classic (2015) – with Finn Bálor ** NXT Championship (3 times) ** WWE United States Championship (2 times) 1After he was stripped of the title, his reign was stricken from the promotion's records and the title returned to the opponent that he beat, Eddie Osbourne. 2After the title was vacated, Joe and Sakoda's reign was stricken from the promotion's records. 3He held the title by himself during his first reign. ==References== ==Other websites== * *TNA profile Category:1979 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Sportspeople from California Category:Total Nonstop Action Wrestling alumni",
 "title": "Samoa Joe"
}