{
 "id": "429400",
 "text": "Robert Lee \"Bob\" Backlund (born August 14, 1949) is an American professional wrestler. He is best known for working for the World Wide Wrestling Federation/World Wrestling Federation from 1977 to 1984. He is known for holding the record for the second longest reign as WWE Champion in history which is ahead of Hulk Hogan's first reign and behind Bruno Sammartino's first. Signature move known as the cross face chicken wing was said to be inescapable once fully applied. Before becoming a professional wrestler, Backlund started as an accomplished amateur wrestler and wrestled for the North Dakota State University Bison during the late 1960s to early 1970s. He also ran for a Connecticut seat in Congress on a Republican ticket in 2000 but was unsuccessful. He was inducted into the WWE Hall of Fame by Maria Menounos on April 6, 2013. ==Championships== *Championship Wrestling from Florida **NWA Florida Tag Team Championship (one time) (with Steve Keirn) *Georgia Championship Wrestling **NWA Georgia Tag Team Championship (one time) (with Jerry Brisco) *NWA Western States Sports **NWA Western States Heavyweight Championship (three times) *Northeast Wrestling Federation **NEWF Heavyweight Championship (one time, first) *Pro Wrestling Illustrated **PWI Match of the Year (1978) (vs. Billy Graham on February 20) **PWI Match of the Year (1982) (vs. Jimmy Snuka in a cage match on June 28) **PWI Most Hated Wrestler of the Year (1994) **PWI Most Inspirational Wrestler of the Year (1977) **PWI Most Inspirational Wrestler of the Year (1981) **PWI Rookie of the Year (1976) **PWI Wrestler of the Year (1980) **PWI Wrestler of the Year (1982) **He was ranked him #7 of the 500 best singles wrestlers of the \"PWI Years\" in 2003. *Professional Wrestling Hall of Fame and Museum **Modern Era (Class of 2008) *St. Louis Wrestling Club **NWA Missouri Heavyweight Championship (one time) *World Wide Wrestling Federation/World Wrestling Federation/WWE **WWF Tag Team Championship (one time) (with Pedro Morales) **WWWF/WWF Championship (two time) **WWE Hall of Fame (Class of 2013) *Wrestle Association R **WAR World Six-Man Tag Team Championship (one time) (with Scott Putski and The Warlord) *Wrestling Observer Newsletter awards **Best Technical Wrestler (1980) **Match of the Year (1980) (vs. Ken Patera in a Texas Death match on May 19 in New York City, New York) **Most Disgusting Promotional Tactic (1982) (Being WWF Champion) **Most Overrated Wrestler (1983) **Wrestling Observer Newsletter Hall of Fame (Class of 2004) ==References== ==Other websites== *WWE profile Category:1949 births Category:American professional wrestlers Category:Former WWE wrestlers Category:Living people Category:Sportspeople from Minnesota Category:WWE Hall of Fame",
 "title": "Bob Backlund"
}