{
 "id": "42963",
 "text": "A chemical bond is a type of attraction force which holds together different chemical species. Atoms bonded stay together unless the needed amount of energy is transferred to the bond. In general, strong chemical bonding comes with the sharing or transfer of electrons between the participating atoms. The atoms in molecules, crystals, metals and diatomic gases are held together by chemical bonds. There are two types of bonds; covalent and ionic. Covalent bonds form when atoms share electrons. Ionic bonding is the attraction between oppositely charged ions. Chemical bonds are negatively charged electrons that are pulling protons into each other. Because atoms and molecules are three- dimensional, it is difficult to use a single method to indicate orbitals and bonds. In molecular formulas the chemical bonds between atoms are indicated in different ways depending on the type of discussion. A common way chemists describe chemical bonds is through the number of electrons each atom has on itself. Each atom is drawn with the number of electrons as dots or lines to form a maximum of eight. If the electrons form a chemical bond then a line is drawn between the two electrons. The number of bonds developed increases the number of lines. Atkins, Peter; Loretta Jones 1997. Chemistry: molecules, matter and change. New York: W. H. Freeman, pp. 294–295. ISBN 0-7167-3107-X Bonds can be double bonds or triple bonds. ==Ionic bonding== Ionic bonding is when non metals and metals are attracted to each other in a crystal structure.The metals and non metals in the crystal structure become charged atoms, called ions.The ions can either be positive or negative, a positive ion loses electrons and is called a cation and a negative ion gains electrons,and is called an anion.Generally the cation is a metal and an anion a non- metal,however this is not always the case. ==Covalent Bonding== Covalent bonding is when elements share electrons by mixing atomic orbitals together.Covalent bonds can be split into 2 types.The first type is called a Sigma bond and is represented by the greek letter σ, and this is when two diffrent atoms overlap head-on,which makes the bonds quite strong,usually single bonds are usually sigma bonds. The other type is a Pi bond which is represented by the greek letter π, and they are formed when p orbitals overlaps sideways(laterally).There are two bonds that are bonded by both sigma bonds and pi bonds,double bonds and triple bonds.Double bonds are formed from one sigma bond and one pi bond whereas triple bonds are formed from one sigma bond and two pi bonds. ==Triple bond== A triple bond is when two chemical elements share six electrons rather than two.Here is some examples of triple bonded compounds. acetylene, H−C≡C−H cyanogen, N≡C−C≡N carbon monoxide, C≡O Chemical compounds with triple bond ==Use of Lewis structures to show what is connected through chemical bond(s)== == Related pages == *Chemical formula *Double bonds *Intermolecular force == References == Category:Quantum chemistry Category:Energy",
 "title": "Chemical bond"
}