{
 "id": "429730",
 "text": "Joseph Kabila Kabange (commonly known as Joseph Kabila, born 4 June 1971) is a Congolese politician. He became President of the Democratic Republic of the Congo in January 2001. He took office ten days after the assassination of his father, President Laurent-Désiré Kabila. He was elected as President in 2006. In 2011, he was re-elected for a second term. Forbes writer Richard Miniter documented the wealth of Joseph Kabila, estimated at 2 billion US Dollars in offshore banks in the British Virgin Islands, accumulated in just over 13 years of being in power.Richard Miniter: Obama’s Secret Neo-Con Agenda, Forbes, July 1, 2014 After widespread speculation surrounding his continued stay in office, it was feared Kabila would seek re-election for a third term in the 2018 election. But he announced in August 2018, that he will not stand.https://www.aljazeera.com/news/2018/08/drc-kabila-stand-election-spokesman-180808130105604.html | DR Congo's Kabila will not stand for re-election: spokesmanhttps://www.reuters.com/article/us-congo-politics/congos-kabila-to-step-down-ahead-of-presidential-election-idUSKBN1KT1L4 | Congo's Kabila will not stand for election in December | Article [AMP] | Reuters In October 2021, Joseph Kabila defended his graduation thesis at the University of Johannesburg. A master's degree in political science and international relations was awarded to him at the end of his studies which lasted five years. In April 2025, the Attorney General of the Armed Forces filed a request with the Senate to lift Joseph Kabila's immunity, which would allow him to be prosecuted for treason, war crimes and crimes against humanity.https://www.rfi.fr/fr/en-bref/20250430-rdc-une-requ%C3%AAte-d%C3%A9pos%C3%A9e-au-s%C3%A9nat-pour-obtenir-une-lev%C3%A9e-de-l-immunit%C3%A9-de-l-ex-pr%C3%A9sident-kabila | RDC: une requête déposée au Sénat pour obtenir une levée de l'immunité de l'ex-président Kabila | Article [AMP] | Radio France International ==References== ==Other websites== * Joseph Kabila, The Untold Story * Rape in the DRC * BBC Country Profile * Official website of the President of the DRC * Joseph Kabila 2011 campaign site * Democratic Republic of the Congo – Permanent Mission to the United Nations * DR Congo presidential candidates face off in second round Jane's Intelligence Watch Report, 22 August 2006 * For Congo's Leader, Middling Reviews by Jeffrey Gettleman, The New York Times, April 4, 2009 Category:1971 births Category:Living people Category:Presidents of the Democratic Republic of the Congo Category:Makerere University alumni",
 "title": "Joseph Kabila"
}