{
 "id": "429894",
 "text": "Gimpo is a city in Gyeonggi Province, South Korea. Administrative districts are 3 Eup, 3 Myeons, and 6 Dongs. About 300,000 people live in this city. There are several attractions in this city such as Moonsoo Sanseong, Jangreung, and Deokpojin. Now it has six sister cities, Shinmin City, Hatek City, Liberty County, Glendale city, Sangju city and Haenam-gun. ==Modern history== In 1914, the three Goons (Gimpo, Yangcheon, and Tongjin) were integrated to become Gimpo Goon. In 1963, Yangdong and Yangseo Myeons were incorporated into Seoul City. In 1979, Gimpo Myeon was elevated to Eup. In 1983, Tongjin Myeon was newly established (1 Eup and 8 Myeons). In 1998, Gimpo Goon Elevated to Gimpo City (3 Dongs and 6 Myeons). In 2003, Three Dongs of Gimpo were separated into Sawoo Dong and Poongmoo Dong. In 2012, Janggi Dong was newly established (3 Eup, 3 Myeons, and 5 Dongs) and has been developed into Gimpo Hangang new town. ==Statistics== Area: ===Households and population=== * The number of households: 116,067 households * Population: 303,833 (Men: 153,159, Women:150,674) ===Administrative districts=== * 3 Eup: Tongjin Eup, Gochon-Eup, Yangchon-Eup * 3 Myeons: Yangchon-myeon, Daegot- myeon, Wolgot-myeon, Haseong-myeon * 5 Dongs: Gimpo 1-dong, Gimpo 2-dong, Sau- dong, Pungmu-dong, Janggi-dong * The number of public officials: 856 ===Business status=== * Mining Industry-Number of enterprises: 3, Employees: 41 * Manufacturing industry- Number of enterprises: 5,992, Employees: 52,749 * Others-Number of enterprises: 13,500, Employees: 50,700 ===Automobile registration status=== * Total number of registered automobiles: 125,914 * Number of registered passenger cars: 96,173 (76.3%) ===Agriculture status=== * Farmhouses: 6,271 households * Population: 19,351 * Farmland area: 84.61㎢ (30.6%) ===Educational institution status=== * Kindergartens: 65, Elementary schools: 37, Middle schools: 18, High schools: 10, Colleges: 1, Universities: 1 * Population status: Based on the data from the end of July 2013, Farmhouse and farming population: December * 31st, 2006. Business status: The end of July 2013, Educational institution status: The end of July 2013 ==Symbols of Gimpo== *Symbol Mark :The horizon expresses an open field and vast land of Gimpo. And the indigo part at the bottom promises a rich and clean Gimpo with abundant water resources. The oval shape expresses the infinitely expanding, developing and changing images of Gimpo. At the same time it symbolizes a stably advancing Gimpo. *The flower of the city : Forsythia :You can see Forsythia all around this city. People believe that it delivers a richness and happiness to them during springtime. Also it symbolizes the hope of having courage and volition for people who are starting a new year. *The tree of the city : Zelkova :As a leafy tree of the elm tree family, it has a huge, stable figure. It symbolizes an adamant will. *The bird of the city : Magpie :As an omnivorous bird of the crow family, magpies inhabit one place during the four seasons. The bird has a plain figure and noble character, and symbolizes stability and prosperity. ==Attractions== *Moonsoo Sanseong This mountain fortress located on Mt. Moonsoo (376m). It is designated Historical remains No. 139. It is the fortress built in the 20th year of Joseon’s 19th King Sookjong’s reign (1694) to ward off foreign enemies from the sea and protect Ganghwa-do. *Jangneung It contains the graves of the Wonjong, fifth son of Seonjo and Queen Inheon of the Joseon Dynasty. *Deokpojin It is assumed to have been an important military strategic. It was established during the reign of King Seonjo of the Joseon Dynasty who experienced invasions of Japanese. ==Sister cities== *Shinmin City, China. Establishment of a sisterhood relationship: Oct, 1994. *Hatek City, China. Establishment of a sisterhood relationship: Feb, 2006. *Liberty County, U.S. Establishment of a sisterhood relationship: Feb, 1997. *Glendale city, U.S. Establishment of a sisterhood relationship: Aug, 2010. *Sangju city, Gyeongsangbuk-do. Establishment of a sisterhood relationship: July, 2011. *Haenam-gun, Jeollanam-do. Establishment of a sisterhood relationship: May, 2012. ==References== *Gimpo official website Category:Cities in South Korea",
 "title": "Gimpo"
}