{
 "id": "429888",
 "text": "Jack McBrayer (born May 27, 1973) is an American comedic actor. He became famous after appearing many times on Late Night with Conan O'Brien. He won some Emmy Awards. He starred as the title character, Wander, in the Disney Channel original series Wander Over Yonder. He also appeared in the films such as Despicable Me (2010), and other. ==Early life== McBrayer was born in Macon, Georgia, and moved to Conyers, Georgia when he was 15. He studied theater administration at the University of Evansville, worked at The Second City and IO Theater (1995–2002), an experience that introduced him to 30 Rock creator Tina Fey and prepared him \"100%\" for his role on her show. ==Personal life== He is also good friends with actress Tina Fey. ==Filmography== ===Movies=== Year Film Role Notes 2004 Blackballed: The Bobby Dukes Story Stuart Applebaum 2005 Elliot's friend Uncredited 2006 Talladega Nights: The Ballad of Ricky Bobby Glenn 2007 Walk Hard: The Dewey Cox Story DJ 2008 Forgetting Sarah Marshall Darald 2009 Spring Breakdown Stage Manager 2010 Cats & Dogs: The Revenge of Kitty Galore Chuck 2010 Despicable Me Tourist Father / Carnival Games Worker Voice only 2011 Conan O'Brien Can't Stop Himself 2012 Wreck-It Ralph Fix-It Felix Jr. Voice only 2012 Starbucks Barista 2012 Mr. Mendenhall 2013 Movie 43 Brian Segment \"iBabe\" 2013 The To Do List Hillcrest Manager 2013 Savannah Sir Graham 2013 Planes Car-Bug Filming 2014 Cooties Filming 2014 Planes 2: Fire & Rescue Car-Bug Filming 2015 Wreck-It Ralph 2 Fix-It Felix Jr. Voice only ===Television=== Year Show Role Notes 1999 Early Edition Teddy, Rehearsal Dinner Toaster Episode: \"The Out-of-Towner\" 2002–2004 Late Night with Conan O'Brien Various 2005 Weekends at the D.L. Soldier 1 episodes 2005–2006 Arrested Development Country Club Waiter 2 episodes 2006–2013 30 Rock Kenneth Parcell 139 episodes 2006 Kevin Episode: \"Will Power\" 2008–present Yo Gabba Gabba! Himself 2009 Marlon Episode: \"Abracadabra Cadabra Ca-Green!\" 2009–present Phineas and Ferb Irving Voice Only 2010 Tim and Eric Awesome Show, Great Job! Best Man Episode: \"Comedy\" 2010 Ugly Americans Kong Episode: \"Kong of Queens\" 2010 Robotomy Frenemy Episode: \"Frenemy\" 2010 Kung Fu Panda Holiday Special Wo Hop Voice only 2011 Bob's Burgers Kevin / Marbles 2 episodes 2011 Ewell Freestone \"Peach Guy\" Episode: \"The Great Simpsina\" 2011 Conan Ghost / Drug Dealer / Conan 3 episodes 2011 Portlandia Zupan's Market Customer Episode: \"Cool Wedding\" 2011 Archer Randy Episode: \"Bloody Ferlin\" 2013 Wander Over Yonder Wander Voice only 2013 Nerdist Himself Guest appearance 2013 Bob's Burgers Kevin Voice only; Episode: \"Boyz 4 Now\" 2013 Drunk History Nixon Aide Haldeman 2 episodes 2013 The Middle Dr. Ted Goodman 3 episodes ===Other=== * Kate's Place - Curry ==References== ==Other websites== * * Interview with McBrayer on The Sound of Young America * Entertainment Weekly interview with Jack McBrayer and the actors who portray TV assistants Lloyd (\"Entourage\") and Marc (\"Ugly Betty\"). Category:1973 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Georgia (U.S. state) Category:Comedians from Georgia (U.S. state) Category:People from Macon, Georgia Category:Emmy Award winning actors",
 "title": "Jack McBrayer"
}