{
 "id": "42994",
 "text": "The Æsir (Old Norse: singular ǫ́ss or áss; feminine ásynja, plural ásynjur) are the main group or tribe of deities in Norse mythology. Including Odin, Frigg, Thor, and Baldr, the Æsir reside in the realm of Asgard, at the top of Yggdrasil's highest branch. Alongside the Æsir is a second family of gods, known as the Vanir, who joined with the Æsir to form a single, unified pantheon after the devastating war between the two tribes of deities. The Vanir were native to Vanaheimr, the god Njörðr and his children, Freyr and Freyja chief among them. The Æsir gods were usually connected with power and war, and the Vanir were associated with fertility and nature. ==Norse mythology== The things that happened between the Æsir and the Vanir are an interesting part of Norse mythology. While other cultures have had \"elder\" and \"younger\" generations of gods, as with the Titans and the Olympians of ancient Greece, the Æsir and Vanir were portrayed as contemporaries. The two tribes fought battles, concluded treaties, and exchanged hostages. Freyr and Freyja were said to be hostages. Some believe that events that occurred between the Æsir and Vanir were a reflection of events common between different Norse clans at the time. The Æsir did not grow old and instead remaining young by eating the apples of Iðunn. While they did not age, they could be killed. It was said that most of them woulld die at Ragnarök. == List of Æsir == * Baldr—God of light and radiance, he is the most beloved of the gods. He is the son of Odin and Frigg and younger brother of Thor. * Frigg—Wife of Odin and goddess of marriage, she rules Asgard as queen alongside the All-Father. * Heimdallr—Known as the All-Seeing, he is the guardian of the rainbow bridge Bifröst. * Höðr—God of winter and darkness; a blind god, he is the son of Odin and Frigg. * Iðunn—Goddess of youth, she was keeper of the apples that grant the gods their phenomenal longevity and youth. * Loki—Though oftentimes referred to as the god of trickery and mischief, Loki is not counted among the Æsir. The son of the (female) jötunn Laufey and Fárbauti (Old Norse: “cruel striker”), he is Odin’s blood brother. * Odin—God of wisdom, poetry and war, he is chief of the Æsir and ruler of Asgard. * Sif—Goddess of agriculture and fertility, she is the beloved wife of Thor, known across the Nine Worlds for her golden hair, which was sheared by Loki. * Thor—God of thunder and lightning, he is Asgard's greatest champion. He is the eldest son of Odin, born to him by Jörð, the personification of the Earth. * Týr—God of law and heroic glory, he is one-handed. Either the son of Odin or the jǫtnar Hymir and Hroðr (Old Norse: “famed”). * Ullr—God of the hunt and archery, he is the son of Sif and Thor's stepson. * Viðarr—God of vengeance, he is the son of Odin and the female jötunn Gríðr. == Other websites == * W. Wagner's \"Asgard and the Home of the Gods\" e-book * Peter Andreas Munch's \"Norse Mythology: Legends of Gods and Heroes\" e-book Category:Norse gods and goddesses",
 "title": "Æsir"
}