{
 "id": "430185",
 "text": "Survivor Series (1995) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 19, 1995 at the USAir Arena in Landover, Maryland. It was the ninth Survivor Series event held by the WWF. ==Matches== No. Results Stipulations Times 1 Smoking Gunns (Billy and Bart Gunn) defeated Public Enemy (Rocco Rock and Johnny Grunge) Tag team match N/A 2 The BodyDonnas (Skip, Rad Radford, Dr. Tom Prichard and 1-2-3 Kid) (with Sunny and Ted DiBiase) defeated The Underdogs (Marty Jannetty, Hakushi, Barry Horowitz and Bob Holly) Four-on-four Survivor Series elimination match 18:45 3 Bertha Faye, Aja Kong, Tomoko Watanabe and Lioness Asuka (with Harvey Wippleman) defeated Alundra Blayze, Kyoko Inoue, Sakie Hasegawa and Chaparita Asari Four-on-four Survivor Series elimination match 10:01 4 Goldust defeated Bam Bam Bigelow Singles match 8:18 5 The Darkside (The Undertaker, Savio Vega, Fatu and Henry Godwinn) (with Paul Bearer) defeated The Royals (King Mabel, Jerry Lawler, Isaac Yankem and Hunter Hearst Helmsley) (with Sir Mo) by countout Four-on-four Survivor Series elimination match 14:21 6 Shawn Michaels, Ahmed Johnson, British Bulldog and Sycho Sid (with Ted DiBiase and Jim Cornette) defeated Yokozuna, Owen Hart, Razor Ramon and Dean Douglas (with Mr. Fuji) Four-on-four Survivor Series elimination match 27:24 7 Bret Hart defeated Diesel (c) No Disqualification match for the WWF Championship 24:54 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Dr. Tom Prichard Bob Holly Pinfall 5:17 Bob Holly Skip 5:23 Hakushi Rad Radford 8:10 Rad Radford Barry Horowitz 11:26 Barry Horowitz The 1-2-3 Kid 12:25 Skip Marty Jannetty 15:02 Marty Jannetty The 1-2-3 Kid 18:45 The 1-2-3 Kid Eliminated Wrestler Eliminated by Method Time Lioness Asuka Alundra Blayze Pinfall 1:41 Sakie Hasegawa Aja Kong 3:58 Chaparita Asari 4:25 Kyoko Inoue 5:02 Tomoko Watanabe Alundra Blayze 6:30 Bertha Faye 7:11 Alundra Blayze Aja Kong 10:01 Aja Kong Eliminated Wrestler Eliminated by Method Time Jerry Lawler The Undertaker Pinfall 12:19 Isaac Yankem 12:50 Hunter Hearst Helmsley 13:35 Mabel N/A Countout 14:21 Fatu, Henry O. Godwinn, Savio Vega, and The Undertaker (clean sweep) Eliminated Wrestler Eliminated by Method Time Dean Douglas Shawn Michaels Pinfall 07:30 Sycho Sid Razor Ramon 16:18 Owen Hart Ahmed Johnson 21:49 Razor Ramon The British Bulldog 24:08 Yokozuna Ahmed Johnson 27:24 Ahmed Johnson, The British Bulldog, and Shawn Michaels ==References== ==Other websites== *Official Survivor Series 1995 website Category:1995 in professional wrestling Category:1995 in the United States Category:20th century in Maryland Category:Survivor Series",
 "title": "Survivor Series (1995)"
}