{
 "id": "430280",
 "text": "Amanda Michelle Todd (born November 27, 1996) died by suicide on October 10, 2012 at the age of 15 at her home in Port Coquitlam, British Columbia, Canada. She was a sophomore when she died. On October 10, 2012, she posted a video on YouTube called My Story: Struggling, bullying, suicide and self-harm. Todd's suicide was written about her life on index cards. Many news websites linked to Todd's video. It had 1,600,000 views by October 13, 2012. Todd's death made people pay attention to the issue of cyberbullying, extortion and bullying. People made memorial pages for Todd on Facebook. Some people posted mean comments on them while others supported her. ==Background== On her YouTube video Todd revealed that she showed her breasts on a video chat. She got a message on Facebook from a man. The message said that if Todd did not show more parts of her body then he would post the pictures he had taken of her from the video chat to the Internet. The police came to her home to tell her that photos of her were sent to \"everyone\". Todd then got depression and panic disorder. She started abusing alcohol and drugs. Todd was asked by a boy to come to his house. The boy had a girlfriend but he acted like he liked Todd. She went to his house. The next week the boy's girlfriend appeared at Todd's school with fifteen other people. Todd was hurt really really bad and it was filmed by people who watched. When she went home she drank bleach. People made fun of her for doing this and wrote on Facebook that they wished that she had not survived. ==Aftermath== Aydin Coban, a 35-year-old man from The Netherlands was charged with extortion, internet luring, criminal harassment and child pornography in connection with Todd's suicide in 2014. Coban had already been sentenced to 10 years and 8 months in prison for commiting sexual blackmail against victims in The Netherlands. In December 2020, Coban was extradited to Canada to face trial in the Supreme Court of British Columbia. On August 5, 2022, a jury found him guilty on all charges and he was sentenced to 13 years in prison. ==Notes== ==References== ==Other websites== *My Story: Struggling, bullying, suicide and self-harm Category:1996 births Category:2012 deaths Category:British Columbia Category:Suicides by hanging Category:Suicides in Canada",
 "title": "Suicide of Amanda Todd"
}