{
 "id": "430358",
 "text": "thumb|300px|Fitting of a noisy curve by an asymmetrical peak model, with an iterative process (Gauss-Newton algorithm with variable damping factor α). Top: raw data and model. Bottom: evolution of the normalised sum of the squares of the errors. Curve fitting is constructing a mathematical function which best fits a set of data points.S.S. Halli, K.V. Rao. 1992. Advanced Techniques of Population Analysis. Page 165 (cf. ... functions are fulfilled if we have a good to moderate fit for the observed data.)The Signal and the Noise: why so many predictions fail - but some don't. Nate SilverData Preparation for Data Mining: Text. Dorian Pyle. Curve fitting may involve either interpolationNumerical Methods in Engineering with Python 3. Jaan Kiusalaas. p21, 24. or smoothing.Numerical methods of curve fitting. Philip George Guest. Page 349. Using interpolation requires an exact fit to the data. With smoothing, a \"smooth\" function is constructed, that fit the data approximately. A related topic is regression analysis,Fitting Models to Biological Data Using Linear and Nonlinear Regression. Harvey Motulsky, Arthur Christopoulos.Regression analysis. Rudolf J. Freund, William J. Wilson, Ping Sa. p 269. which focuses more on questions of statistical inference such as how much uncertainty is present in a curve that is fit to data observed with random errors. Fitted curves can be used to help data visualization,Visual Informatics. Halimah Badioze Zaman et al. Page 689.Numerical Methods for Nonlinear Engineering Models. By John R. Hauser. Page 227. to guess values of a function where no data is available,Methods of Experimental Physics: Spectroscopy, vol 13, Part 1. Claire Marton. p 150. and to summarize the relationships among two or more variables.Encyclopedia of research design, vol 1. Edited by Neil J. Salkind. p 266. Extrapolation refers to the use of a fitted curve beyond the range of the observed data.Community analysis and planning techniques. Richard E. Klosterman. p 1. This is subject to a degree of uncertainty,An introduction to risk and uncertainty in the evaluation of environmental investments. DIANE Publishing. pg 69 since it may reflect the method used to construct the curve as much as it reflects the observed data. ==References== Category:Mathematical approximation",
 "title": "Curve fitting"
}