{
 "id": "430414",
 "text": "Jean-Marie Faustin Goedefroid \"João\" de Havelange (May 8, 1916 – 16 August 2016) was a Brazilian association football administrator. He was the 7th President of FIFA (Fédération Internationale de Football Association). He was elected to the position in 1974. He resigned in 1998, after 24 years in charge. He was elected as an honorary president of FIFA in 1998 after he left office. He resigned in 2013 due to \"health and personal reasons\". Havelange was a swimmer at the 1936 Summer Olympics in Berlin. He was also part of the team that tied for 13th in water polo at the 1952 Summer Olympics in Helsinki. == Assessment == Writing in June 1998, as Havelange was leaving FIFA, and before the eruption of most of the controversies surrounding him, The New York Times commented on Havelange's leadership: > \"[Havelange] ran FIFA, as the world soccer federation is known, with a > combination of autocratic rigidity and progressive reform. In 24 years as > FIFA's president, Havelange was credited with building the Zurich-based > organization from a fledgling operation in a private residence to a > worldwide force that oversees a $250 billion-a-year international industry. > With Blatter working by his side for 17 years and implementing his programs > as FIFA's general secretary, Havelange increased the size of the World Cup > from 16 to 32 teams, introduced a World Cup for women, gained a place for > women's soccer in the Summer Olympics and built up marketing and television > rights fees to the point that each of FIFA's 204 national federations will > receive $1 million from the 1998 World Cup.\" — ==Honors== * Cavalier of the Légion d'honneur * Order of Special Merit in Sports * Commander of the Cavaliers of the Order of Infante D. Henrique * Cavalier of the Order of Vasa * Grand Cross of Elizabeth the Catholic ==References== ==Other websites== Category:1916 births Category:2016 deaths Category:Competitors at the 1936 Summer Olympics Category:1952 Summer Olympics Category:Olympians for Brazil Category:Brazilian centenarians Category:Sportspeople from Rio de Janeiro Category:Presidents of FIFA Category:Swimmers Category:Brazilian water polo players",
 "title": "João Havelange"
}