{
 "id": "430419",
 "text": "4 is the fourth studio album by American singer Beyoncé, released on June 24, 2011. Seven singles were released from the album. \"Run the World (Girls)\" was the first single from the album. Pitchfork gave the album a score of 8 out of 10. The single \"Love on Top\" won the Best Traditional R&B; Performance Award at the Grammy Awards. The album has sold three million copies. The third song on the album \"I Miss You\" was written by Frank Ocean. ==Track listing== ==Charts== ===Weekly charts=== Chart (2011–2012) Peak position Australian Urban Albums (ARIA) 1 Russian Albums (2M) 5 ===Monthly charts=== Chart (2011) Peak position ===Year-end charts=== Chart (2011) Position Australian Albums (ARIA) 26 Australian Urban Albums (ARIA) 3 Belgian Albums (Ultratop Flanders) 61 Belgian Albums (Ultratop Wallonia) 81 Brazilian Albums (ABPD) 11 Brazilian International Albums (ABPD) 2 Danish Albums (Hitlisten) 93 Dutch Albums (MegaCharts) 29 French Albums (SNEP) 77 French Digital Albums (SNEP) 40 Hungarian Albums (MAHASZ) 77 Italian Albums (FIMI) 99 Polish Albums (ZPAV) 36 Russian Albums (2M) 52 Swiss Albums (Schweizer Hitparade) 57 UK Albums (OCC) 18 UK R&B; Albums (OCC) 4 US Billboard 200 21 US Top R&B;/Hip-Hop Albums (Billboard) 7 Worldwide IFPI 12 Chart (2012) Position Australian Urban Albums (ARIA) 24 UK Albums (OCC) 79 US Billboard 200 91 US Top R&B;/Hip-Hop Albums (Billboard) 13 Chart (2013) Position Australian Urban Albums (ARIA) 29 US Top R&B;/Hip-Hop Albums (Billboard) 73 Chart (2014) Position Swedish Albums (Sverigetopplistan) 86 Chart (2015) Position Australian Urban Albums (ARIA) 89 Chart (2016) Position Swedish Albums (Sverigetopplistan) 79 Chart (2017) Position Australian Urban Albums (ARIA) 84 Chart (2018) Position Australian Urban Albums (ARIA) 84 Chart (2019) Position Australian Urban Albums (ARIA) 77 ===Decade-end charts=== Chart (2010–2019) Position UK Albums (OCC) 79 US Billboard 200 123 ==References== Category:2011 albums Category:Beyoncé albums Category:Funk albums Category:R&B; albums Category:Columbia Records albums",
 "title": "4 (Beyoncé album)"
}