{
 "id": "430581",
 "text": "Ryan Parmeter (born February 6, 1980) is an American professional wrestler. He currently performs for Impact Wrestling as a member of The Design. Parmeter wrestles under the ring name Kon. He is best known for his work in WWE, where he wrestled under the ring names Conor O'Brian and Konnor. He was part of the fourth season of NXT and placed fourth on the fifth season of NXT. He was formerly in the WWE from 2005 to 2008, but both Parmeter and his girlfriend who was also employed with the company asked for their released due to health problems. He was re-signed by the WWE on July 14, 2010 and was sent to their FCW developmental territory. He competed on the fourth season of NXT but was the second person eliminated. He also competed on the fifth season of NXT titled NXT Redemption but was eliminated fourth. Parmeter won the NXT Tag Team Championship with Viktor on September 12, 2013 when they defeated Adrian Neville and Corey Graves. They were the longest reigning NXT Tag Team Champions of all time, holding the titles for 364 days. ==Championships and accomplishments== *Atomic Revolutionary Wrestling **ARW Tag Team Championship (1 time) – with Vik *Coastal Championship Wrestling **CCW Heavyweight Championship (1 time) **CCW Tag Team Championship (1 time) – with Sean Allen *Deep South Wrestling **DSW Heavyweight Championship (2 times) *Four Star Championship Wrestling **FSCW Heavyweight Championship (1 time) **FSCW Tag Team Championship (1 time) – with Jeff \"J-Dawg\" Brooks *Georgia Championship Wrestling **GCW Heavyweight Championship (1 time) * Insane Wrestling Revolution ** IWR World Heavyweight Championship (1 time) *Kings of Pro Wrestling **KPW Heavyweight Championship (2 times) *Maximum Pro Wrestling **MPW Television Championship (1 time) *NWA Sunray Pro Wrestling **NWA Sunray Heavyweight Championship (1 time) *Platinum Pro Wrestling **PPW Platinumweight Championship (1 time) *Pro Wrestling Illustrated **PWI ranked him No. 123 of the top 500 singles wrestlers in the PWI 500 in 2014 *WWE **NXT Tag Team Championship (1 time) – with Viktor ==References== ==Other websites== *Official website . * * * Category:1980 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:Sportspeople from Grand Rapids, Michigan Category:Total Nonstop Action Wrestling people",
 "title": "Conor O'Brian"
}