{
 "id": "430533",
 "text": "WCW Monday Nitro was a professional wrestling television program for World Championship Wrestling (WCW). The show ran from September 4, 1995 to March 26, 2001 and had 288 episodes. == History == When Nitro debuted it started a ratings battle which became known as the Monday Night Wars between WCW and WWF which lasted almost six years. WCW started the nWo storyline which helped them gain more viewers than the WWF. They would continue to defeat the WWF in viewers for 84 consecutive weeks which forced WWF owner Vince McMahon to change the style of wrestling his promotion was doing and introduce The Attitude Era. As the nWo storyline became stale, fans turned from WCW to watch the WWF. On the January 4, 1999 episode of Nitro, commentator Tony Schiavone gave away the results to Raw which included underdog Mick Foley defeating The Rock saying: ::\"Fans, if you're even thinking about changing the channel to our competition, do not. We understand that Mick Foley, who wrestled here at one time as Cactus Jack, is gonna win their World title. Ha! That's gonna put some butts in the seats, heh.\" Bischoff thought that in doing this, viewers would be put off by this and would not watch Raw. His plan backfired however and a lot of Nitro viewers changed the channel to watch Raw because they were excited to see the underdog Foley win the championship. The fans switched back to Nitro after Foley won but from that week on, Nitro was beat by Raw in the ratings by a large amount and WCW was never able to regain their former success. === Special episodes === Episode Title Date Rating Note Episode 1 September 4, 1995 2.5 nWo Monday Nitro December 22, 1997 3.5 The Fingerpoke of Doom January 4, 1999 5.0 WarGames 2000 September 4, 2000 3.6 The Night of Champions March 26, 2001 3.0 == On-air personalities == === Commentators === Commentators Year(s) Eric Bischoff, Bobby Heenan and Steve McMichael (1st hour) January 1993-March 1993 Eric Bischoff, Bobby Heenan and Tony Schiavone August 25, 1997 (2nd hour) Tony Schiavone and Larry Zbyszko May 27, 1996 – July 29, 1996 (1st hour) August 5, 1996 – April 21, 1997 (1st hour) Tony Schiavone, Bobby Heenan and Larry Zbyszko April 28, 1997 - May 19, 1997 (1st hour) Eric Bischoff and Bobby Heenan May 20, 1996 – June 10, 1996 (1st hour/2nd hour) July 1, 1996 - July 22, 1996 (2nd hour) August 5, 1996 – August 26, 1996 (2nd hour) Tony Schiavone, Larry Zbyszko and Eric Bischoff July 29, 1996 (2nd hour) Eric Bischoff, Bobby Heenan and Mike Tenay September 2, 1996 – October 28, 1996 (2nd hour) November 11, 1996 - November 18, 1996 (2nd hour) Tony Schiavone, Mike Tenay and Larry Zbyszko May 26, 1997 – July 28, 1997 (1st hour) August 11, 1997 - March 29, 1999 (1st hour/1st-2nd hour) Tony Schiavone, Bobby Heenan and Mike Tenay November 4, 1996 (2nd hour) November 25, 1996 – March 29, 1999 (2nd hour/3rd hour) August 4, 1997 (2nd hour-3rd hour) December 20, 1999 – January 24, 2000 (1st/2nd hour-3rd hour) Tony Schiavone and Bobby Heenan June 17, 1996 – June 24, 1996 (2nd hour) April 5, 1999 – July 12, 1999 (1st-3rd hour) August 9, 1999 – December 13, 1999 (1st-3rd hour) Scott Hudson and Bobby Heenan July 19, 1999 – August 2, 1999 (1st-3rd hour) Tony Schiavone, Mike Tenay and Mark Madden January 31, 2000 (1st-2nd hour) Tony Schiavone and Mark Madden February 7, 2000 – March 27, 2000 (1st-2nd hour) August 28, 2000 (1st-2nd hour) Tony Schiavone, Scott Hudson and Mark Madden April 10, 2000 – July 10, 2000 (1st-2nd hour) July 24, 2000 – August 21, 2000 (1st-2nd hour) September 18, 2000 – October 2, 2000 (1st-2nd hour) October 30, 2000 – November 6, 2000 (1st-2nd hour) November 20, 2000 - December 4, 2000 (1st-2nd hour) December 18, 2000 (1st-2nd hour) Tony Schiavone, Mark Madden and Stevie Ray July 18, 2000 (1st-2nd hour) October 9, 2000 – October 23, 2000 (1st-2nd hour) Tony Schiavone, Mark Madden and Jeremy Borash September 4, 2000 - September 11, 2000 (1st-2nd hour) Tony Schiavone, Mike Tenay and Stevie Ray November 13, 2000 (1st-2nd hour) Tony Schiavone, Scott Hudson and Stevie Ray December 12, 2000 (1st-2nd hour) Tony Schiavone, Scott Hudson and Disco Inferno January 8, 2001 (1st-2nd hour) Tony Schiavone and Scott Hudson January 15, 2001 – March 26, 2001 (1st-2nd hour) === Ring announcers === Ring announcer Year(s) David Penzer September 4, 1995–March 26, 2001 Michael Buffer (For select main events, May 12, 1997–March 26, 2001) ==Related pages== * World Championship Wrestling * WCW Thunder == References == == Other websites == *WCW on WWE.com Category:1995 American television series debuts Category:2001 American television series endings Category:American television series Category:Sports television series Category:World Championship Wrestling Category:English-language television programs",
 "title": "WCW Monday Nitro"
}