{
 "id": "430668",
 "text": "The Hohe Warte Stadium is a football stadium in the Döbling district of Vienna. It is the home ground of the oldest football club in Austria, First Vienna FC 1894. It is also used by the American football team Vienna Vikings. It is one of the oldest stadiums which are still in use in professional football. ==History== The stadium was opened in 1921 with a match between First Vienna and S.C. Hakoah Wien. It was at that time the biggest in Europa. It was and still is the homeground of First Vienna F.C. 1894. The stadium was planned by Eduard Schönecker, who was not only a architect, but also a notable football defender playing for SK Rapid Wien and the national team. With 90,000 capacity it was the largest stadium in Europe at this time. In 1923, 80,000 visitors were looking at the match of the Austrian national football team versus Italy. The stadium was also used for open air opera performances and boxing events. In the 1920s the stadium was used for open air operas and boxing. 1924 the composer Pietro Mascagni conducted the opera Aida by Giuseppe Verdi. Today the capacity is 5,500 because the city closed the natural hills around the stadium for visitors. The costs to maintain the stadium are €400,000. There are plans to build a wellness center to lower the costs for the club.Hochfliegende Pläne für die Hohe Warte - derStandard.at ==International matches at Hohe Warte stadium== Date Versus Result 3 May 1908 Hungary 4-0 8 June 1908 England 1-11Highest defeat in international match history. 1 June 1909 England 1-8 1 May 1910 Hungary 2-1 5 May 1912 Hungary 1-1 23 April 1922 Germany 0-2 11 June 1922 Switzerland 7-1 24 September 1922 Hungary 2-2 15 April 1923 Italy 0-0 6 May 1923 Hungary 1-0 15 August 1923 Finland 2-1 First match versus Finland 22 June 1924 Egypt 1-8First match versus Egypt. First encounter with a team outside Europe. 14 September 1924 Hungary 2-1 22 March 1925 Switzerland 2-0 5 May 1925 Hungary 3-1 27 September 1925 Spain 0-1 14 March 1926 Czechoslovakia 2-0 19 September 1926 Hungary 2-3 10 October 1926 Switzerland 7-1 7 November 1926 Sweden 3-1 20 March 1927 Czechoslovakia 1-2 10 April 1927 Hungary 6-0 22 May 1927 Belgium 4-1 1 April 1928 Czechoslovakia 0-1 6 May 1928 Yugoslavia 3-0 7 October 1928 Hungary 5-1 28 October 1928 Switzerland 2-0 7 April 1929 Italy 3-0 5 May 1929 Hungary 2-2 15 September 1929 Czechoslovakia 2-1 14 May 1930 England 0-0 21 September 1930 Hungary 2-2 16 November 1930 Sweden 4-1 12 April 1931 Czechoslowakia 2-1 3 May 1931 Hungary 0-0 16 May 1931 Scotland 5-0First match versus Scotland. 24 April 1932 Hungary 8-2 9 April 1933 Czechoslowakia 1-2 15 April 1934 Hungary 5-2 5 April 1936 Hungary 3-5 ==References== Category:Football stadiums in Austria Category:1921 establishments in Europe Category:1920s establishments in Austria Category:Football stadiums in Vienna",
 "title": "Hohe Warte Stadium"
}