{
 "id": "43073",
 "text": "The Arabian Sea is the northwest part of the Indian Ocean. To its west are the Guardafui Channel, Somali Sea and the Arabian Peninsula. To its east is the Indian Peninsula. It covers around . The Arabian Sea is one of the warmest seas. ==Limits== The International Hydrographic Organization defines the limits of the Arabian Sea as follows: * On the west: the eastern limit of the Gulf of Aden. * On the north: a line joining Ràs al Hadd, east point of the Arabian Peninsula (22°32'N) and Ràs Jiyùni (61°43'E) on the coast of Pakistan. * On the south: a line running from the southern extremity of Addu Atoll in the Maldives, to the eastern extremity of Ràs Hafun (the easternmost point of Africa, 10°26'N). * On the east: the western limit of the Laccadive Sea a line running from Sadashivgad on the west coast of India () to Cora Divh () and thence down the west side of the Laccadive and Maldive archipelagos to the most southerly point of Addu Atoll in the Maldives. ==Border and Basin countries== The countries into which the Arabian Sea drains include: # - 2,500 Km Coastline # - 1,050 Km Coastline # # # # # ==Other names== Other names for the sea include: # Indian Sea # Sindhu Sagar # Fars Darya # Erythraean Sea # Sindh Sea # Green Sea # Mare di Persia # Persian Sea The Arabian Sea, historically and geographically, has been referred to by different names by Turks, Persians, Arabs,Indians and scholars of Geography and cartography in medieval Islam, European geographers and travelers, including the Ministry of Iran. In Indian folklore, it is referred to as Darya, Sindhu Sagar, and Arab Samudra. Arab sailors and nomads used to call this sea by different names, including the green sea, Bahre Fars, the ocean sea, the Hindu sea, the Makran Sea, the sea of Oman, among them the Zakariya al-Qazwini, Al-Masudi , Ibn Hawqal and (Hafiz-i Abru) They wrote: “The green sea and Indian sea and Persian sea are all one sea and in this sea there are strange creatures. Ibn Khordadbeh, Ibn Sa'id al-Maghribi, Muhammad al-Idrisi, Istakhri, Mahmud al- Kashgari, Khashkhash Ibn Saeed Ibn Aswad, and Muhammad ibn Musa al-Khwarizmi had mentioned the sea as Persian sea and Bahr e Fars. Some medieval maps, including the map by Vincenzo Maria, Coronelli, 1693 had mentioned the Persian sea and also Macran. Cornelius Le Brun's Year 1718 Map. On this map, the name of the Oman Sea is recorded as \"Gulf of Hormuz\". Map of Iran in the 16th century by Abraham Ortelius in which the name of the Persian Sea and the Indian Sea appear.http://catdir.loc.gov/catdir/toc/fy11pdf02/2010344035.pdf Iran, had in the past, been called persian sea, but now like Turkey, it is called Oman sea together with the gulf of Oman Encyclopædia Iranica also call it Oman sea. ==Maps with historical names== Many atlases had published old maps of Asia and Indian ocean such as Atlas of The Arabian Peninsula in Old European Maps.Paris, 424pp. contains 253 maps.10 maps have used persian Sea (for the body of water which is now called Arabian sea)the maps in pages: -141-226-323-322-331-345-347-363-355•The Arabian Peninsula In Old European Maps La Peninsule Arabique dans les cartes europeenes Anciennes: Khaled Al Ankary: Amazon.com: Books such as the hours shape map of Bunting H.S.Q34/24CM Hanover,1620.File:Documents on the Persian Gulf's name File:A horizontal Malabar Coast miniature, a reprint by Petrus Bertius, 1630.jpg|A horizontal Malabar Coast miniature, a reprint by Petrus Bertius, 1630 File:Basra- ps64.JPG|Persian Sea. File:Map of persia.jpg|Macran File:Soulier, E.; Andriveau-Goujon, J. Anciens Empires Jusqua Alexandre. 1838.jpg|Soulier, E.; Andriveau-Goujon, MER ERYTHREE 1838. File:1658 Jansson Map of the Indian Ocean (Erythrean Sea) in Antiquity - Geographicus - ErythraeanSea- jansson-1658.jpg|1658 Jansson Map of the Indian Ocean (Erythrean Sea) File:The western part of the Indian Ocean, by Vincenzo Maria Coronelli, 1693, from his system of global gores the south.jpg|The western part of the Indian Ocean, by Vincenzo Maria Coronelli, 1693, from his system of global gores the south File:The western part of the Indian Ocean, by Vincenzo Maria Coronelli, 1693 from his system of global gores the Makran coast.jpg|The western part of the Indian Ocean, by Vincenzo Maria Coronelli, 1693 from his system of global gores the Makran coast File:Periplous of the Erythraean Sea.svg|Periplous of the Erythraean Sea ===Gallery=== File:Dugong.jpg|Dugong mother and her offspring in shallow waters. File:The-Worlds-Most-Isolated-and-Distinct-Whale- Population-Humpback-Whales-of-the-Arabian-Sea-pone.0114162.s001.tif|Critically endangered Arabian humpback whales (being the most isolated, and the only resident population in the world) off Dhofar, Oman. File:Nakhl-Minoo.jpg|Palm and sunset in Minoo IslandIran. File:Makran sea .makoran coast in Iran.jpg|Makran coast.Chabahar Port File:Makoran sea .Makoran coast in Iran.jpg|Makran sea. Chabahar File:Red Coast of Makoran sea Iran.jpg|Makran coast. File:Arabian or Makoran sea .Makoran red coast in Iran.jpg|Iran Makran coast ==Related pages== * Indian Ocean ==References== * http://lib.eshia.ir/23019/1/577 ==Other websites== * Category:Seas of the Indian Ocean",
 "title": "Arabian Sea"
}