{
 "id": "430944",
 "text": "Ida (died ) is the first known king of the Anglian kingdom of Bernicia. He was called Ida the 'Flame-bearer' by Welsh poets. Ida ruled from around 547 until his death. He is considered the founder of a line of Anglian kings who later ruled the powerful kingdom of Northumbria. == Reign == The Anglo-Saxon Chronicle, under the year 547 states: \"In this year Ida assumed the kingdom, from whom arose the royal race of the Northumbrians, and reigned twelve years, and he built Bebanburh (Bamborough), which was at first inclosed by a hedge, and afterwards by a wall.\"The Anglo-Saxon Chronicle According to the Several Original Authorities, ed. & trans. Benjamin Thorpe, Vol. II Translation (London: Longman, Green, Longman and Roberts, 1861), p. 15 Ida captured the fortress of Din Guairi from the Britons. It would later be renamed Bamburgh.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 273 He defeated their leader who was named Outigern. Ida was a powerful warrior and king according to early sources.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 82 He is seen to have brought the north (north of the River Humber) under his protection. Ida would have been an overking. But at Ida's death his overkingship did not pass to his successor.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 98 At the time Ida ruled, Bernicia would have had British kingdoms to their north and west. Most these kingdoms were conquered at some point by the Bernicians. No records of the individual kingdoms or the battles they fought mention Ida. To the south was the Anglo-Saxon kingdom of Deira. Nennius in his Historia Brittonum wrote that Ida united Bernicia with Deira.John Marsden, Northanhymbre Saga; the History of the Anglo-Saxon Kings of Northumbria (London: Kyle Cathie Limited, 1992), p. 32 He also claimed that Ida was the first king of a united Northumbria 50 years before it actually happened. But Ida does not appear on any of the king's list for Deira. The king of Deira at this time was Yffi. According to the Anglo-Saxon Chronicle Ida had died by 560. Ida was succeeded by Glappa who reigned for one year.David Hughes, The British Chronicles, Volume 1 (Westminster, MD: Heritage Books, 2007), p. 244 == Notes == == References == == Other websites == * Kings of Bernicia Category:560s deaths Category:Year of birth unknown Category:Anglo-Saxon royalty",
 "title": "Ida of Bernicia"
}