{
 "id": "431093",
 "text": "Survivor Series (1993) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 24, 1993 at Boston Garden in Boston, Massachusetts. It was the seventh Survivor Series event held by the WWF. ==Matches== No. Results Stipulations Times 1 Billy Gunn defeated The Brooklyn Brawler Singles match 7:46 2 Marty Jannetty, Randy Savage, Razor Ramon and The 1–2–3 Kid defeated Irwin R. Schyster, Diesel, Rick Martel and Adam Bomb (with Harvey Wippleman) Four-on-four Survivor Series elimination match 26:58 3 The Hart Family (Bret Hart, Owen Hart, Bruce Hart and Keith Hart) (with Stu Hart) defeated Shawn Michaels and His Knights (The Red Knight, The Blue Knight and The Black Knight) Four-on-four Survivor Series elimination match 30:57 4 The Heavenly Bodies (Jimmy Del Ray and Tom Prichard) (with Jim Cornette) defeated The Rock 'n' Roll Express (Ricky Morton and Robert Gibson) (c) Tag team match for the SMW Tag Team Championship 13:41 5 The Four Doinks (The Bushwhackers (Butch and Luke ) and Men on a Mission (Mabel and Mo)) (with Oscar) defeated The Headshrinkers (Samu and Fatu), Bastion Booger and Bam Bam Bigelow (with Luna Vachon and Afa) Four-on-four Survivor Series elimination match 10:58 6 The All-Americans (Lex Luger, The Undertaker, Rick Steiner and Scott Steiner) (with Paul Bearer) defeated The Foreign Fanatics (Yokozuna, Crush, Ludvig Borga and Quebecer Jacques) (with Jim Cornette, Johnny Polo, and Mr. Fuji) Four-on-four Survivor Series elimination match 27:59 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Diesel Randy Savage Pinfall 10:20 Randy Savage Irwin R. Schyster 16:47 Irwin R. Schyster Razor Ramon 20:32 Razor Ramon N/A Countout 20:42 Rick Martel The 1-2-3 Kid Pinfall 25:49 Adam Bomb Marty Jannetty 26:58 The 1-2-3 Kid and Marty Jannetty (Team Razor) Eliminated Wrestler Eliminated by Method Time The Black Knight Owen Hart Pinfall 10:49 The Red Knight Bret Hart Submission 18:06 The Blue Knight Owen Hart 23:55 Owen Hart Shawn Michaels Pinfall 27:26 Shawn Michaels N/A Countout 30:57 Bret Hart, Bruce Hart and Keith Hart (The Hart Family) Eliminated Wrestler Eliminated by Method Time Samu Bushwhacker Luke Pinfall 3:02 Bastion Booger Mabel 6:02 Fatu Bushwhacker Butch 8:33 Bam Bam Bigelow Mabel 10:58 The Bushwackers (Luke and Butch) and Men on a Mission (Mabel and Mo) (The Four Doinks) (clean sweep) Eliminated Wrestler Eliminated by Method Time Rick Steiner Ludvig Borga Pinfall 5:05 Crush N/A Countout 11:36 Jacques Lex Luger Pinfall 14:04 Scott Steiner Yokozuna 16:57 The Undertaker N/A Double countout 22:26 Yokozuna Ludvig Borga Lex Luger Pinfall 28:02 Lex Luger (All Americans) ==References== ==Other websites== *Official Survivor Series 1993 website Category:1993 in professional wrestling Category:1993 in the United States Category:Sports in Boston Category:Survivor Series Category:20th century in Boston Category:1990s in Massachusetts",
 "title": "Survivor Series (1993)"
}