{
 "id": "431105",
 "text": "Manhattan is a city in the state of Kansas in the United States. It is at the junction of the Kansas River and Big Blue River. It is the county seat of Riley County. The city extends into Pottawatomie County. In 2020, 54,100 people lived there. It is sometimes confused with Manhattan, New York. The city was created by settlers from the New England Emigrant Aid Company. They created it as a Free-State town in the 1850s. This was during the Bleeding Kansas era. It is nicknamed \"The Little Apple\" as a play on New York City's \"Big Apple\". Manhattan is best known as where Kansas State University is. It is a college town. Fort Riley, a United States Army base, is west of Manhattan. ==History== ===Native American settlement=== Before settlement by European-Americans in the 1850s, Native American tribes lived in the area. From 1780 to 1830 it was where the Kaw people (also known as the Kansa) lived. The Kaw settlement was called Blue Earth Village (Manyinkatuhuudje). It was named after the river the tribe called the Great Blue Earth River. It is known as the Big Blue River. The river intersected with the Kansas River by their village. Blue Earth Village was the place of a large battle between the Kaw and the Pawnee in 1812. The Kaw tribe lost their land in a treaty signed at the Shawnee Methodist Mission on January 14, 1846. ===1854: Polistra and Canton=== The Kansas–Nebraska Act opened the Kansas territory to settlement by U.S. citizens in 1854. In Fall 1854, George S. Park created the first white settlement where Manhattan is. Park named it Polistra (some refer to it as Poliska or Poleska). In late 1854, Samuel D. Houston and three other people created Canton, a nearby community. It was near the mouth of the Big Blue River. Neither Canton nor Polistra ever grew beyond their original founders. ===21st century=== In 2007, CNN and Money magazine said Manhattan was one of the ten best places in America to retire young. In 2011, Forbes said Manhattan was the best for \"Best Small Communities for a Business and Career.\" ==Geography== Manhattan is at (39.190142, −96.586818), or about west of Topeka on the Kansas River. The United States Census Bureau says that the city has an area of . Of that, is land and is water. ===Geographic features=== Manhattan is in Kansas' Flint Hills region. That region has rolling hills covered in tall grasses. However, the downtown area was built on a broad, flat floodplain at the junction of the Kansas and Big Blue rivers. Manhattan is the biggest town in the Flint Hills. The Flint Hills Discovery Center is in Manhattan. Tuttle Creek Reservoir is north of Manhattan. The lake was created when the Big Blue River was dammed to help stop floods in the 1960s. It is a state park that has many things to do. The Konza Prairie, a tallgrass prairie preserve owned by The Nature Conservancy and Kansas State University, is south of Manhattan. ===Climate=== Manhattan has a humid continental climate (Köppen Dfa). It has hot, humid summers and cold, dry winters. The hottest temperature was on August 13, 1936. The coldest temperature was on February 12, 1899. ====Tornadoes==== The state of Kansas falls within an area sometimes called Tornado Alley. The worst tornado in Manhattan was at 10:30 pm on June 11, 2008. Thirty-one homes and some businesses were destroyed by the EF4 tornado. The tornado caused about $20 million in damage to Kansas State University's campus. Some university buildings got a lot of damage. The tornado's winds destroyed the Wind Erosion Laboratory's garage.Wichita Eagle-Beacon Tornadoes rip Manhattan, KSU damage more than $20 million No one was killed. Before that, the worst tornado to hit Manhattan was on June 8, 1966. The 1966 tornado caused $5 million in damage. It injured at least 65 people in Manhattan. ====Flooding==== The worst floods in Manhattan's history were the 1903 and 1908 floods, the Great Flood of 1951 and the Great Flood of 1993. ==People== Manhattan is the main city of the Manhattan metropolitan area. In 2014, there was am estimated 98,091 people living there. It is also the main city of the Manhattan-Junction City, Kansas Combined Statistical Area. In 2014, there was an estimated 134,804 people living there. That would make it the fourth biggest urban area in Kansas. ===2020 census=== In 2020, there were 54,100 people, 21,414 households, and 9,995 families living in the city. Of the households, 39.4% owned their home and 60.6% rented their home. The median age was 25.4 years. Of the people, 76.0% were White, 5.9% were Black, 5.3% were Asian, 0.5% were Native American, 0.3% were Pacific Islanders, 3.5% were from some other race, and 8.4% were two or more races. Hispanic or Latino of any race were 9.2% of the people. ===2010 census=== In 2010, there were 52,281 people, 20,008 households, and 9,466 families living in Manahttan. ==Government== ===Local=== Manhattan uses a council-manager system. It has a five-member City Commission. Elections are nonpartisan. They happen every other year, in odd-numbered years. Three City Commission positions are chosen in each election. The Mayor has the same voting rights as other Commissioners and does not have a veto. ===Federal=== Manhattan is in Kansas's 1st congressional district. Republican Roger Marshall represents Manhattan in the United States House of Representatives. ==Economy== Manhattan's economy is based on the public sector. Kansas State University is the biggest employer in town. Its 24,000 students help support the retail and entertainment venues in Manhattan. The second-biggest employer in Manhattan is the city school district. Many civilians and military personnel are employed by Fort Riley. Many of them also live in Manhattan and support its economy, including more than 3,500 civilian Fort Riley employees. ===Historic businesses=== Manhattan's Tallgrass Brewing Co was the biggest brewery in Kansas until closed in 2018. ==Education== Kansas State University is the biggest employer and educational institution in the city of Manhattan. It has about 24,000 students. Kansas State University is the best among state universities in the United States in its total number of Rhodes, Marshall, Truman, Goldwater, and Udall scholars since 1986.\"Achievements\" Kansas State University, Retrieved on April 20, 2009 Manhattan also has the Manhattan Christian College, Manhattan Area Technical College, the American Institute of Baking and The Flint Hills Job Corps Training Center, and the Kansas Building Science Institute. Manhattan is served by US$383 Manhattan-Ogden. It has one public high school with two campuses (Manhattan High School), two middle schools (Susan B. Anthony and Dwight D. Eisenhower), and eight elementary schools (Amanda Arnold, Frank V. Bergman, Bluemont, Lee, Marlatt, Northview, Theodore Roosevelt and Woodrow Wilson). Manhattan also has two private school systems: Flint Hills Christian School (Preschool – 12th grade) and the Manhattan Catholic Schools. Manhattan Catholic School has two buildings, the grade school building (K-5)and the Luckey Jr. High building (6–8), formerly called the Luckey high building dedicated to Monsignor Luckey. The school's mascot is \"Luckey the Cardinal\". ==Transportation== ===Airports=== Manhattan Regional Airport (MHK) is west of Manhattan on K-18. It is the second busiest commercial airport in Kansas. American Airlines and subsidiary American Eagle use the airport. It has multiple flights daily to Chicago's O'Hare International Airport and the Dallas/Fort Worth International Airport. It also does general aviation and charter flights. The nearest big commercial airports are in Kansas City (MCI) and Wichita, Kansas (ICT). ===Rail=== Domestic passenger rail service to Manhattan started on August 20, 1866. The Kansas Pacific Railroad built the first railroad there. A railroad of the Union Pacific Railroad still goes through the city, but all passenger service to Manhattan stopped after the Amtrak took over passenger rail in 1971. The Rock Island Railroad also used to go to Manhattan as a stop on Rock Island's Kansas City–Colorado Springs Rocky Mountain Rocket service.\"Rocky Mountain Rocket\" Schedule, Retrieved 15-3-11 ===Public transportation=== In Manhattan, there is a small public transportation system. It is provided by Riley County's subsidized paratransit service, ATA Bus. ATA uses four small buses and a number of minivans.\"ATA Bus\" Riley County, Kansas, Retrieved on April 8, 2009 ===Highways=== Several highways go to Manhattan: * runs about south of Manhattan. Three exits have a direct connection to Manhattan. ** Exit 313 – K-177 ** Exit 307 – McDowell Creek Road ** Exit 303 – K-18 * goes through Manhattan. * goess north from I-70 as Bill Snyder Highway until the Kansas River viaduct. * is a major connector in Manhattan. * (Seth Child Road) ==Media== ===Newspaper=== The Manhattan Mercury is Manhattan's main newspaper. It publishes six days per week. Other newspapers published in Manhattan include: the alternative weekly The Hype Weekly which focuses on events, arts, and culture in the area; the weekly Manhattan Free Press; the agriculture- focused Grass & Grain; and the K-State university newspaper, the Kansas State Collegian. Manhattan has had at least one newspaper published for the town continuously since The Kansas Express published its first newspaper on May 21, 1859. ===Radio and television=== Manhattan is a center of broadcast media for the surrounding area. One AM and ten FM radio stations are licensed to the city. Manhattan is in the Topeka, Kansas television market. The first television station in Kansas was W9XAK in Manhattan. It was licensed to broadcast by the Federal Radio Commission on March 9, 1932. ==Sister cities== * Dobřichovice, Czech Republic (2006). ==Related pages== * Johnny Kaw – fictional Paul Bunyanesque character * Freedom's Frontier National Heritage Area * June 1966 tornado outbreak sequence * Great Flood of 1951 ==References== ==More reading== * Olson, Kevin G. W. Frontier Manhattan: Yankee Settlement to Kansas Town, 1854–1894 (University Press of Kansas, 2012) 273 pp. ==Other websites== * * ;City * City of Manhattan * Manhattan – Directory of Public Officials * Manhattan – Convention and Visitor's Bureau * Manhattan Chamber of Commerce * Manhattan – Kansas business directory ;Schools * USD 383, local school district ;Newspapers * The Hype Weekly * The Manhattan Mercury * The Manhattan Free Press * The Kansas State Collegian ;Other * Manhattan's Sunset Zoo * Manhattan's Insect Zoo * The Great Manhattan Mystery Conclave * Manhattan Kansas Travel and Recreation ;Maps * Manhattan City Map , KDOT Category:County seats in Kansas Category:Cities in Pottawatomie County, Kansas Category:1855 establishments in Kansas Territory",
 "title": "Manhattan, Kansas"
}