{
 "id": "431129",
 "text": "Juan Canaveris (1748–1822) was an Italian notary. He worked for the viceroyalty of Río de la Plata in the 1700s. == Biography == He was born in Saluzzo, Piedmont, Kingdom of Sardinia in 1738 or 1748. His parents were Gabriel Canaveri and Margarita Jugluns, but he changed his name from the Italian-sounding Canaveri to the Spanish-sounding Canaveris later on. Canaveris became a notary. He arrived at Buenos Aires around 1770, where he married Bernarda Esparza, the granddaughter of Miguel Jerónimo Esparza. At that time, Esparza was the alcalde, or governor, of Cabildo of Buenos Aires. Between 1777 and 1786, Canaveris worked as the portero of the court of auditors, In 1795, he was appointed as representative of the protector guardian of natural resources and Indians in the village of San Pablo de Capinota, Bolivia. In 1798, delegates of the council of Santiago del Estero appointed Canaveris chief assignee for Cabildo. == 1806-1810 == During the British invasions of the Río de la Plata, Canaveris returned to work as a portero under the orders of Martín de Alzaga. His sons, José, Manuel, and Joaquín also participated in the defense of Buenos Aires in the regiments—Quinteros and Labradores, Húsares of Pueyrredón, and Cántabros Montañeses. The monk Martin Esparza, a relative of Canaveris's wife, was killed by British troops during the second invasion in the interior Convent of Santo Domingo. During the May Revolution of 1810, Canaveris went to a community meeting and voted to dismiss the viceroy. == Descendants == Canaveris' descendants include Feliciano, and Isabelino Canaveris, both of whom served in the military. Hector Canaveri served as congressman of the Province of Buenos Aires. Camilo Canaveri was a lawyer. He also was the grandfather of doctors Sinforoso Amoedo and Angel Canaveris. His youngest son Mariano Canaveris, became a teacher. == References == == Other websites == * http://www.dante.edu.ar/web/dic/c.pdf * Documentos para la historia argentina Category:1748 births Category:1822 deaths Category:Politicians from Buenos Aires Category:People from Piedmont",
 "title": "Juan de Canaveris"
}