{
 "id": "431235",
 "text": "Dwarf stars refers to several types of star. The term was originally used in 1906 by the Danish astronomer Ejnar Hertzsprung. He noticed that the reddest stars—classified as K and M in the Harvard scheme—could be divided into two distinct groups. They are either much brighter than the Sun, or much fainter. To distinguish these groups, he called them \"giant\" and \"dwarf\" stars.Brown, Laurie M; Pais, Abraham & Pippard A.B. eds. 1995. Twentieth Century Physics. New York: American Institute of Physics, p. 1696. The dwarf stars were fainter and the giants brighter than the sun. However, the term \"dwarf\" was later expanded to include: * Dwarf star: this usually refers to any main- sequence star, a star of luminosity class V. ** Red dwarfs are low-mass main- sequence stars. They have cool temperatures and spectral classes M and K. Examples include Proxima Centauri and Alpha Centauri B. ** Yellow dwarfs are main-sequence (dwarf) stars with masses similar to the Sun. They have roughly the same temperature and are of spectral classes G. Examples include Alpha Centauri A. ** Blue dwarfs is a word very rarely used for high-mass main- sequence stars, which are blue, hot, and have spectral classes A and B. Examples include Regulus and Bellatrix. * A white dwarf is a star composed of electron-degenerate matter. This may be the final stage in the evolution of stars not massive enough to collapse into a neutron star or undergo a Type II supernova--stars less massive than about 9 solar masses. Examples include Sirius B and Procyon B. ** A black dwarf is a white dwarf which has cooled enough that it no longer emits any visible light. No black dwarfs are known, and it is possible that no black dwarf exists yet.https://xxx.lanl.gov/abs/astro-ph/9701131v1 * A brown dwarf is a \"substellar object\". It is not massive enough to ever fuse hydrogen into helium, but still massive enough to fuse deuterium--less than about 0.08 solar masses and more than about 13 Jupiter masses. == References == Category:Types of stars",
 "title": "Dwarf star"
}