{
 "id": "431257",
 "text": "The zebrafish (Danio rerio) is a freshwater fish native to India. It is often sold under the name zebra danio. == Psychology == In 2015, a study was published about zebrafishes' capacity for episodic memory. The individuals showed a capacity to remember context with respect to objects, locations and occasions (what, when, where). Episodic memory is a capacity of explicit memory systems, typically associated with conscious experience. The Mauthner cells integrate many different kinds of sensory stimuli to produce the escape reflex. Those stimuli are found to include the lateral line signals by McHenry et al. 2009 and visual signals consistent with looming objects by Temizer et al. 2015, Dunn et al. 2016, and Yao et al. 2016. ==In the aquarium== The zebrafish is a peaceful fish and can be kept in a community tank. They can be kept in a temperature of 19–27°C. They grow to about 5 cm.Fishkeeping - Caresheets - Zebra Danio () - Danio rerio The typical environment of the Zebrafish is in rivers, little streams, slowly flowing pools close to nearby streams and rice paddies. The natural history of the Zebrafish is limited as very little information about their true natural history is known. However, it is known that Zebrafish have a high reproductivity and quick growth rates. Zebrafish are suitable models for researching tissue repair and regeneration in vertebrates because of their restorative capabilities. They can fully regenerate injured hearts, portions of their brain and other organs. Zebrafish are one of the most common species used for genetic and developmental research. ==Diet== Zebrafish happily eat flake foods and bloodworm. Other foods Zebrafish consumes are mosquito larvae and zooplankton. ==References== Category:Cypriniformes Category:Freshwater fish Category:Aquarium fish 3\\. Gemberling, M., Bailey, T. J., Hyde, D. R., & Poss, K. D. (2013). The zebrafish as a model for complex tissue regeneration. Trends in genetics : TIG, 29(11), 611–620. https://doi.org/10.1016/j.tig.2013.07.003 4\\. Engeszer , R.E. , Patterson , L.B. , Rao , A.A. and Parichy , D.M. ( 2007 ). Zebrafish in the wild: A review of natural history and new notes from the field . Zebrafish , 4 , 21 – U126. https://doi.org/10.1089/zeb.2006.9997 5\\. C. Graham, M.A. von Keyserlingk, B. Franks. (2018). Zebrafish welfare: Natural history, social motivation and behaviour. Applied Animal Behavior Science, 200 (2018), pp. 13-22. https://doi.org/10.1016/j.applanim.2017.11.005",
 "title": "Zebrafish"
}