{
 "id": "431338",
 "text": "Aethelthryth (sometimes called Æthelthryth, Æðelþryð, Æþelðryþe, or Etheldreda (about 636 AD – June 23, 679 AD) was an Anglo-Saxon saint. She was also an East Anglian princess and Abbess of Ely. == Life == Aethelthryth was born in East Anglia (now Suffolk). She was one of the four daughters of Anna of East Anglia. All of these women became nuns and founded abbeys.N. J. Higham, An English Empire: Bede and the Early Anglo-Saxon Kings (Manchester: Manchester University Press, 1995), p. 236 She was a beautiful young girl who wanted to devote herself to the Church and took a vow to remain a virgin.Liber Eliensis; a History of the Isle of Ely from the Seventh to Twelfth Century, ed. Janet Fairweather (Woodbridge: Boydell, 2004), p. 17 When the princips Tondberht of the South Gyrwas.N. J. Higham, An English Empire: Bede and the Early Anglo- Saxon Kings (Manchester: Manchester University Press, 1995), p. 124 asked for her hand in marriage her parents said yes, but Aethelthryth refused. Though she was married she resolved to keep her solomn vow. Upon his death in 655, she retired to the Isle of Ely, which she had received from her husband as a gift. Aethelthryth was then married to Ecgfrith of Northumbria in 660. Ecgfrith was a younger son of King Oswiu of Northumbria and his wife Enfleda.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 284 Shortly after Ecgfrith became king, Aethelthryth asked her husband if she could become a nun.N. J. Higham, An English Empire: Bede and the Early Anglo-Saxon Kings (Manchester: Manchester University Press, 1995), p. 236-237 She was encouraged by Bishop Wilfrid to remain celibate.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 135 This caused friction between Ecgfrith and Bishop Wilfrid. One story tells that Ecgfrith first agreed that she should continue to remain a virgin but in about 672 he wished to have an heir. He tried to bribe Wilfrid to convince the queen to give him an heir. This failed and the king tried to take his queen from her convent. She fled back to Ely with two nuns and managed to evade capture. The legend says that she escaped due to the miraculous rising of the tide. Another version of the legend stated that she stopped on the journey at 'Stow' and hid under an ash tree which suddenly came from her staff after she planted it in the ground. This came to be known as 'St Aethelthryth 's Stow', when a church was built to commemorate this event.Virginia Blanton, Signs of Devotion: The Cult of St. Æthelthryth in Medieval England, 695-1615 (University Park, PA:Pennsylvania State University Press, 2007), p. 154 Stow Minster contains a stained glass window that portrays the legend. Ecgfrith later married Eormenburg and expelled Wilfrid from his kingdom in 678. According to the Anglo-Saxon Chronicle, Aethelthryth founded a double monastery at Ely in 673, which was later destroyed in the Danish invasion of 870. She lived at St. Ely for the remainder of her life in pious devotion. She died of the plague.Alban Butler; Paul Burns, Lives of the Saints\"\", (Collegeville, Minnesota: Liturgical Press 2003), p. 228 There is a hymn that was written in her honor.N. J. Higham, An English Empire: Bede and the Early Anglo-Saxon Kings (Manchester: Manchester University Press, 1995), p. 239 Aethelthryth's niece and her great-niece, both of whom were royal princesses, succeeded her as abbess of Ely. Bede and The Liber Eliensis describe how in 695, Aethelthryth's body was dug up by her sister Seaxburth, to be transferred from a common grave to the new church at Ely. She had been dead sixteen years. When her body was exhumed it was said to have been just as it was when she was alive. She was reburied in a white, marble coffin.Ridyard, Royal Saints, p. 53.Fairweather, Liber Eliensis, pp. 56-61. Aethelthryth's uncorrupted body and clothes were said to have miraculous powers. A burial chamber made of white marble was taken from the Roman ruins at Grantchester, which was found to be the right fit for Aethelthryth. Seaxburh supervised the preparation of her sister's body, which was washed and wrapped in new robes before being reburied.Ridyard, The Royal Saints, p. 179. Seaxburgh apparently oversaw the transference of her sister's remains without the supervision of her bishop, using her knowledge gained from her family's links.Yorke, Nunneries, p. 50. St Etheldreda's Church is dedicated to the saint. It was originally part of the palace of the Bishops of Ely. In later years the palace was used by the Spanish Ambassadors, enabling Roman Catholic worship to continue in the church. It is now a Roman Catholic parish church in Ely, Cambridgeshire. It is part of the Diocese of East Anglia within the Province of Westminster. The church contains the shrine and relics of Aethelthryth. == Bibliography == *Virginia Blanton (2007) Signs of Devotion: the cult of St Aethelthryth in medieval England, 695-1615. University Park, Pa: Pennsylvania State University Press *McCash, June Hall & Judith Clark Barban, ed. and trans. (2006) The Life of Saint Audrey; a text by Marie de France. Jefferson, NC: McFarland *M. Dockray-Miller (2009) Saints Edith and Aethelthryth: Princesses, Miracle Workers, and their Late Medieval Audience; the Wilton Chronicle and the Wilton Life of St Aethelthryth, Turnhout: Brepols Publishers . * Maccarron, Máirín, \"The Adornment of Virgins: Æthelthryth and Her Necklaces,\" in Elizabeth Mullins and Diarmuid Scully (eds), Listen, O Isles, unto me: Studies in Medieval Word and Image in honour of Jennifer O’Reilly (Cork, 2011), 142-155. * Major, Tristan, \"Saint Etheldreda in the South English Legendary,\" Anglia 128.1 (2010), 83-101. *Wogan-Browne, Jocelyn, \"Rerouting the Dower: The Anglo- Norman Life of St. Audrey by Marie (of Chatteris?)\", in Power of the Weak: Studies on Medieval Women, ed. Jennifer Carpenter and Sally-Beth Maclean (Champaign: University of Illinois Press, 1995), 27-56. == References == ==Further reading== * == Other websites == *Richard John King, 1862. Handbook of the Cathedrals of England (Oxford) ( On-line text) * *The Life of St. Aethelthryth by Aelfric of Eynsham Category:630s births Category:679 deaths Category:Christian saints Category:Princes and princesses Category:Anglo-Saxon royalty",
 "title": "Aethelthryth"
}