{
 "id": "431392",
 "text": "The Wyatt Family was a professional wrestling stable in the WWE. The original members of the stable were Bray Wyatt (the leader), Erick Rowan, and Luke Harper. They were joined by Braun Strowman in August 2015. Daniel Bryan and Randy Orton were also members for a short time. The stable played a backwoods cult with Bray Wyatt as their leader. Harper and Rowan won the NXT Tag Team Championship in May 2013, while Wyatt and Orton won the SmackDown Tag Team Championship at Tables, Ladders and Chairs in December 2016 (Harper also defended the titles under the freebird rule). On December 26, 2020, Harper died from idiopathic pulmonary fibrosis. On August 24, 2023, Wyatt died from a heart attack. This left Erick Rowan as the last living original member of the Wyatt Family. ==Career== ===NXT=== Wyatt debuted his character in Florida Championship Wrestling (FCW) and it was drew comparisons to Max Cady of the 1991 movie Cape Fear and Waylon Mercy (a character portrayed by WWF alumni Dan Spivey). After FCW was renamed NXT, he formed The Wyatt Family in November and introduced Luke Harper as his first \"son\" and Erick Rowan as his second \"son\". Harper and Rowan competed in the NXT Tag Team Championship tournament to crown the first champions. They defeated Percy Watson and Yoshi Tatsu in the first round and Bo Dallas and Michael McGillicutty in the semi-finals. They lost to Adrian Neville and Oliver Grey in the finals. Wyatt returned from a torn pectoral muscle and had a match on the February 21 episode of NXT where he defeated Yoshi Tatsu. Harper and Rowan won a triple threat elimination tag match on the May 2 episode of NXT to earn a shot at the championships. Wyatt also had a match against Chris Jericho later in the show but was defeated. Harper and Rowan won the NXT Tag Team Championships after they defeated Neville and Bo Dallas (who was filling in for an injured Grey) on the May 8 episode of NXT (taped on May 2). Harper and Rowan held the titles for 49 days and were defeated by Adrian Neville and Corey Graves on the June 20 episode of NXT (aired on July 17). ===WWE=== The Wyatt Family debuted on WWE's main roster and attacked Kane after his match with Christian on the July 8 episode of Raw. The Wyatt Family would then send cryptic messages to Kane asking him to \"follow the buzzards\". Kane challenged Wyatt to a Ring of Fire match at SummerSlam and Wyatt accepted his challenge. They made their pay-per-view debut at SummerSlam where they defeated Kane in the Ring of Fire match, following interference from Harper and Rowan. On October 6, 2013 at Battleground, Wyatt defeated Kofi Kingston in a match. Their winning streak came to an end when they were defeated by Cody Rhodes and Goldust on the October 11 episode of SmackDown. They then feuded with Daniel Bryan and CM Punk and faced them at Survivor Series but were defeated. The Wyatt Family faced Daniel Bryan in a 3-on-1 handicap match at TLC: Tables, Ladders & Chairs where they defeated him. They defeated Daniel Bryan, Cody Rhodes, and Goldust in a 6-man tag team match on the December 23rd episode of Raw and were defeated by the team of Daniel Bryan, CM Punk, and John Cena at Tribute to the Troops. Daniel Bryan faced all three members of The Wyatt Family in a Gauntlet match on the December 30th episode of Raw. Bryan defeated Harper and Rowan by pinfall and Wyatt by disqualification. After the match, The Wyatt Family beat down Bryan until Bryan finally joined them. Two weeks later, on the January 13, 2014 Raw, Bryan turned against the Family, attacking the other three members in the ring. A few days before that Raw show, thousands of fans at a Michigan State University basketball game repeated Bryan's \"Yes!\" chant. This received large Internet exposure and major coverage on ESPN. One writer for Yahoo! Sports thought that WWE had Bryan turn against the Family because of the Michigan State incident. == Timeline == == Championships and accomplishments == * Pro Wrestling Illustrated ** Ranked Wyatt No. 6 of the top 500 singles wrestlers in the PWI 500 in 2014 ** Ranked Harper No. 24 of the top 500 singles wrestlers in the PWI 500 in 2015 ** Ranked Rowan No. 57 of the top 500 singles wrestlers in the PWI 500 in 2014 ** Ranked Bryan No. 1 of the top 500 singles wrestlers in the PWI 500 in 2014 ** Ranked Strowman No. 163 of the top 500 singles wrestlers in the PWI 500 in 2016 ** Ranked Orton No. 13 of the top 500 singles wrestlers in the PWI 500 in 2017 * Rolling Stone ** Rookie of the Meh (2015) – Strowman * Wrestling Observer Newsletter ** Best Gimmick (2013) – Wyatt, Harper, and Rowan * WWE **NXT Tag Team Championship (1 time) – Harper and Rowan ** WWE Championship (1 time) – Wyatt ** WWE SmackDown Tag Team Championship (1 time) – Wyatt, Orton, and Harper1 ** Royal Rumble (2017) – Orton 1 Wyatt, Orton, and Harper defended the title under the Freebird Rule. == References == == Other websites == * Bray Wyatt on WWE.com * Erick Rowan on WWE.com * Luke Harper on WWE.com * Daniel Bryan on WWE.com * Braun Strowman on WWE.com * Randy Orton on WWE.com Category:WWE teams and stables",
 "title": "The Wyatt Family"
}