{
 "id": "431644",
 "text": "Yeezus is the sixth studio album by American hip hop recording artist Kanye West. It was released on June 18, 2013, by Roc-A-Fella Records and Def Jam Recordings. The album was given very good reviews by music critics. Yeezus entered the Billboard 200 at number one. It also reached number one in 30 other countries. Pitchfork gave the album a score of 9.5 out of 10. Yeezus faced a lot of controversy for its offensive lyrics. The name Yeezus is a combination of Ye and Jesus. Yeezus is a hip-hop album. ==Singles== \"Black Skinhead\" was released as the first single from the album on June 19, 2013. It reached 34 in the UK Singles Chart. \"Bound 2\" was released as the album's second single. The music video for the single had West's fiancee at the time, Kim Kardashian in it. ==Awards== The album was nominated for Album of the Year at the 2014 Grammy Awards. The fourth song on the album, \"New Slaves\", was nominated for the Grammy Award for Best Rap Song. Time magazine chose Yeezus as the best album of 2013. In Pitchfork's 2013 Readers Poll, Yeezus was chosen as 2013's best album. ==Tour== On October 19 2013 West started The Yeezus Tour. A Tribe Called Quest gave their last performance there. The tour ended on December 23 2013. == Track listing == Credits adapted from West's official website. ;Notes * signifies an additional producer * signifies a co-producer * \"I Am a God\" features vocals by Justin Vernon. * \"New Slaves\" features vocals by Frank Ocean. * \"Hold My Liquor\" features vocals by Chief Keef and Justin Vernon. * \"I'm In It\" features vocals by Justin Vernon and Assassin. * \"Guilt Trip\" features vocals by Kid Cudi. * \"Send it Up\" features vocals by King L. * \"Bound 2\" features vocals by Charlie Wilson. ;Sample credits * \"On Sight\" contains interpolations of \"Sermon (He'll Give Us What We Really Need)\", written by Keith Carter, Sr., and performed by Holy Name of Mary Choral Family, re-sung by a different choir. * \"I Am a God\" contains samples of \"Forward Inna Dem Clothes\", written by Clifton Bailey III and H. Hart, and performed by Capleton; and samples of \"Are Zindagi Hai Khel\", written by Anand Bakshi and Rahul Burman, and performed by Burman, Manna Dey, and Asha Bhosle. * \"New Slaves\" contains samples of \"Gyöngyhajú lány\", written by Gábor Presser and Anna Adamis, and performed by Omega. * \"I'm In It\" contains samples of \"Lately\", written by Vidal Davis, Carvin Haggins, Andre Harris, Kenny Lattimore, and Jill Scott, and performed by Lattimore. * \"Blood on the Leaves\" contains samples of \"Strange Fruit\", written by Lewis Allan, and performed by Nina Simone; and samples of \"R U Ready\", written by Ross Birchard and Lunice Pierre, and performed by TNGHT. * \"Guilt Trip\" contains interpolations of \"Chief Rocka\", written by Keith Elam, Kevin Hansford, Dupre Kelly, Christopher Martin, Alterick Wardrick and Marlon Williams, and performed by Lords of the Underground; and samples of \"Blocka (Ackeejuice Rockers Remix)\", written by Terrence Thornton and Tyree Pittman, and performed by Pusha T featuring Travis Scott and Popcaan. * \"Send It Up\" contains samples of \"Memories\", written by Anthony Moses Davis, Collin York and Lowell Dunbar, and performed by Beenie Man. * \"Bound 2\" contains samples of \"Aeroplane (Reprise)\", written by Norman Whiteside, and performed by Wee; samples of \"Bound\", written by Bobby Massey and Robert Dukes, and performed by Ponderosa Twins Plus One; and samples of \"Sweet Nothin's\", written by Ronnie Self, and performed by Brenda Lee. == Personnel == Credits are adapted from the album's liner notes. * Alvin Fields – choir director * Andrew Dawson – engineer * Anthony Kilhoffer – engineer * Arca – additional programming * Benji B – additional production * Brodinski – additional production * Carmen Roman – choir * Ché Pope – A&R;, additional programming, co-executive producer * Chris Galland – assistant mixing * Chris Gehringer – mastering * Crystal Brun – choir * Daft Punk – producer * Dave \"Squirrel\" Covell – assistant engineer * David Rowland – assistant engineer * Delbert Bowers – assistant mixing * Dylan Wissing –drums * Eric Lynn – assistant mixing * Frank Ocean – additional vocals * Gesaffelstein – additional production * Gloria Ryann – choir * Hudson Mohawke – additional programming, co-producer * Jack Donoghue – additional production * Jessenia Pena – choir * Joe Perez – graphic design * John Morgan – choir * Josh Smith – assistant engineer * Justin Vernon – additional vocals * K. Nita – choir * Kanye West – creative director, executive producer, producer, vocals * Keith Parry – assistant engineer * Ken Lewis – choir producer, engineer, noises, vocal sounds * Kenta Yonesaka – assistant engineer * Kevin Matela – assistant engineer * Khoï Huynh – assistant engineer * Lorraine Berry – choir * Lupe Fiasco – additional production * Manny Marroquin – mixing * Marc Portheau – assistant engineer, engineer * Matt Teitelman – percussion * Mike Dean – additional production, engineer * Nabil Essemlani – assistant engineer * Natalis Ruby Rubero – choir * Noah Goldstein – additional production, additional programming, associate producer, engineer, mixing * Raoul Le Pennec – assistant engineer * Rick Rubin – executive producer * Ronnie Artis – choir * Sean Drew – choir * Sean Oakley – assistant engineer, assistant mixing * Sham Joseph – additional production * Teachers – co-producer * Timeka Lee – choir * Travis Scott – additional programming * Ultra$ound - producer * Uri Djemal – choir engineer * Vlado Meller – mastering ==Charts== === Weekly charts === Chart (2013) Peak position scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" scope=\"row\" Russian Albums (NFPS) 1 Scottish Albums (OCC) 4 scope=\"row\" scope=\"row\" scope=\"row\" Taiwanese Albums (RIT) 16 scope=\"row\" UK R&B; Albums Chart (OCC) 1 scope=\"row\" US Top R&B;/Hip- Hop Albums (Billboard) 1 ===Year-end charts=== Chart (2013) Position Australian Albums Chart 65 Belgian Albums Chart (Flanders) 147 Canadian Albums Chart 38 US Billboard 200 37 US Top R&B;/Hip-Hop Albums 12 US Top Rap Albums 8 Chart (2014) Position US Top R&B;/Hip-Hop Albums 38 US Top Rap Albums 22 ==Certifications== ==Release history== Region Date Format Label Australia June 18, 2013 Universal Germany New Zealand Def Jam United States France June 21, 2013 Universal United Kingdom June 22, 2013 Virgin EMI ==Notes== ==References== Category:2013 albums Category:Kanye West albums Category:Def Jam Recordings albums Category:Experimental music albums Category:Hip hop albums Category:R&B; albums Category:Roc-A-Fella Records albums",
 "title": "Yeezus"
}