{
 "id": "431651",
 "text": "Guns, Germs and Steel is a 1997 book by Jared Diamond about the history of humans. The book is about why some human societies (from small tribes to big countries) were more able to use inventions and conquer (take over) others. Diamond thinks the answer is geography, not differences in the people themselves. The book deals with many topics, including history, geography, biology, anthropology and sociology. In 2005, PBS aired a TV program about the book's ideas, with Diamond as the presenter. ==Summary== ===Introduction=== In the introduction, Diamond writes about meeting Yali, a man from New Guinea, in 1972. Yali asked \"Why is it that you white people [made] so much cargo and brought it to New Guinea, but we black people had little cargo of our own?\" By \"cargo\", Yali meant inventions and objects that are made in a factory. Diamond thought about this question for years, which led to him writing the book. Diamond says that sometimes, one society has been far better at fighting wars and using inventions than another. This has led to times when one society found it very easy to conquer another. One example is when the Spanish conquered the Inca Empire in the 1530s. The Spanish won because they had far better weapons, and they also had horses. This is why thousands of Incas died fighting against 168 Spaniards at the Battle of Cajamarca. Another important reason why the Spanish won was diseases. The Spanish did not know that they had brought diseases to South America that killed many people. This also weakened the Inca Empire. The Spanish conquered the Inca Empire with their \"guns, germs and steel\", and other things. Diamond starts by talking about how modern humans (homo sapiens) spread out of Africa and around the world. Diamond believes that it is unlikely that some modern humans could be born more intelligent than others, because if a more intelligent type of human appeared, they would spread around the world very quickly. ===How farming began=== At first, humans lived in hunter-gatherer societies. This means that they lived by hunting animals and picking up foods from plants. The journey towards modern inventions began about 9,000 years ago when humans first learned to grow crops. In order to start farming these crops, humans first had to domesticate the crops, meaning that they had to change them so that they were better for farming. They did this by using selective breeding. This means that they planted the seeds from the best plants, to make sure that better plants appeared the next year. Diamond talks about why this happened to some plants and not others. For example, most trees are not useful for farming because they take a very long time to grow. The most useful plants were plants that took only a year to grow. The Fertile Crescent (an area now mostly in Iraq, Syria and Turkey) was the first place where humans learned to farm. China and New Guinea were also early places where humans learned to farm. Later, farming also began in other regions. However, some regions had more useful crops than others. Crops were more useful if they had more nutritious, meaning they had things like proteins that humans need from their food. They were also more useful if they were easier to grow and were less likely to fail in bad weather. This is why crops from the Fertile Crescent and China spread a long way, while those from New Guinea did not spread far from the island. Farming was a big change. In a farming society, more people could live in the same area (population density) than a hunter-gatherer society. This is why they could easily take over the lands of hunter-gatherers, if their crops could grow there. Diamond notes that it was usually easier for crops to spread east or west than north or south, because crops could only grow in a similar climate. Humans from farming societies spread to regions where their crops could grow, such as from the Fertile Crescent to Europe, North Africa and South Asia and from China to the rest of East Asia. Eurasia (Europe and Asia) became home to far more farming societies than the rest of the world, and they had better crops. Meanwhile, these crops could not spread from North Africa into the middle of Africa, and therefore they did not spread to South Africa (where the crops could grow). Meanwhile, until Europeans discovered the Americas, crops from Central America did not spread to South America, and crops from South America did not spread to Central America. Humans also domesticated animals. As with plants, only some animals were good for this. For example, animals that lived in herds were easier to control than animals that lived alone. Mostly for similar reasons, Eurasia had more farm animals than the other parts of the world. Only two large animals were domesticated outside of Eurasia: llamas and alpacas in South America. Living with animals caused humans to catch more diseases. These spread through Eurasia and Africa. This is why many Native Americans died of diseases after European people travelled to the Americas, but the Europeans did not catch diseases from the Native Americans. On the other hand, in tropical areas, diseases like malaria stopped Europeans from moving into those areas until the late 19th century. ===Farming by region=== Diamond writes about what each region was like before European explorers started travelling around the world: *Eurasia and North Africa: Many crops and animals were domesticated in the Fertile Crescent and spread to these regions, as far west as Ireland and as far east as Japan. They also used crops and animals that were domesticated in other areas, such as rice from China and horses from the Steppes, a region in Central Asia. These areas had more crops than any other part of the world. This is why they had the best farming. Inventions and countries appeared in Eurasia and North Africa much earlier than anywhere else. Eurasia had so many people who lived near to each other and near to farm animals that many diseases like smallpox spread around the region. *The Americas: The Americas were too far away from Eurasia, so did not have their crops. Although many Eurasian crops are grown in North America today, there were few that the Native Americans could domesticate and those that could were not very useful. In some places, people domesticated more useful crops, such as maize in Central America and potatoes in South America. This led to inventions being made; Central America is the only place outside of Eurasia to invent writing on their own. They became home to empires like the Aztec Empire and Inca Empire. But this happened later than in Eurasia, and they did not have as many crops. Because they were too far away from Eurasia, they did not have Eurasian diseases like smallpox. *The rest of Africa: The Sahara Desert was one of several things that made it hard for farming to spread from North Africa to the other parts of Africa. Some farming did spread through Africa, such as cows. Africans also domesticate some crops, such as yams in West Africa and coffee beans in Ethiopia, but their crops were not as good as Eurasia. Most African societies also caught Eurasian diseases like smallpox, although the Khoisan in South Africa did not. *New Guinea: New Guinea was one of the first places to begin farming, with crops such as bananas. However, their crops were not as useful as Eurasian crops or maize, so this farming did not spread far. Because it already had farming societies, New Guinea was one of the few islands in the area that was not settled by Austronesians. The people did get some things from the other islands, such as chickens and Eurasian diseases. *Australia: Australia is the smallest continent. This is one reason why the Australian Aborigines did not domesticate any crops or animals. Although the Aborgines did trade with farmers in New Guinea and Indonesia, they did not start growing their crops. This was because they were far away and because the climate was different in Australia. The Aborigines also did not have Eurasian diseases. *Other Southeast Asian and Pacific islands: Apart from the areas with New Guinean farming, these areas either had no humans or hunter-gatherers until the Austronesian farmers came. The Austronesians probably came from Taiwan. From 3000 BC to 1500 BC, the Austronesians used their boats to sail across the oceans. Some of the last islands that humans reached were Hawaii around 500 AD and New Zealand around 1300 AD. These were reached by Austronesians hundreds of years before European explorers. Some Austronesians did have Eurasian diseases, in places like Indonesia, but those who lived further away in the Pacific Islands did not have Eurasian diseases. ===Inventions=== Diamond believes that farming was important because humans had to start farming before they could invent things like cities, metal, the wheel and writing. Farming led to humans living in larger groups, so they had to form more complicated societies. They began to live in countries rather than tribes. In a farming society, not everyone may work on a farm. Some people can do other jobs, like rulers, writers and inventors, because there is so much food. The societies with the best farming were the ones that were more likely to have inventors. This is different to a hunter-gatherer society, where everyone must help find food. Later in the book, Diamond talks about why European countries developed more inventions than the rest of Eurasia. Because of this, some European countries were the first places to be changed by the Industrial Revolution and they also formed empires that ruled over distant lands (known as colonialism). Until the 15th century, China actually had more inventions than Europe. Diamond suggests that this changed because many European countries were in competition with each other. European countries had to keep changing and using new inventions, to avoid being conquered by other countries. Meanwhile, China was ruled as one empire that did not have to worry about this. Diamond also believes that geography affected this pattern. Geography made it hard for Europe to unite into large countries, but made it easy for China. Category:Science books Category:History books Category:Pulitzer Prize winners Category:1997 books Category:American literature",
 "title": "Guns, Germs and Steel"
}