{
 "id": "43182",
 "text": "The Arabian horse is a breed famous for beauty and stamina. It is one of the oldest horse breeds in the world. Arabian horses were bred with other archaic Arabian horses, who are their direct relatives who have not became separate breeds with enough genetic differences to add their speed, beauty, endurance, strong bones. Today, Arabian horse and archaic Arabian horse ancestors are found in every Arabian breed of riding horse in the Arabian Peninsula. The Arabian horse was developed in the deserts of the Arabian Peninsula by the Bedouin people. People sometimes brought their horses into family tents for shelter and protection. This close relationship with humans made the Arabian horses as horses with a kind temper for people and quickness to learn friendship with people. It also was used as a war horse. This meant that it needed to be speedy and to be very alert. This blend of traits makes it necessary for people today to treat Arabian horses with kindness and respect. == Breed traits == All Arabian horses have triangle-shaped heads, a wide forehead, big eyes, large nostrils, small muzzles (noses). Most have a concave or \"dished\" profile. They have a slim, arched neck, smooth hindquarters, a naturally high-carried tail. Arabians have strong bones and good feet. They are especially noted for their excellent endurance. Arabians's hair coat colors are bay, gray, chestnut, black, white, brown, roan, piebald. Arabian horses can have robicono, sabino genes. All Arabian horses have black skin under their hair coat, except under their white markings. The Bedouins sold many Arabian horses to people from Europe. Other Arabian horses were captured in wars and taken to other countries outside of the Middle East. Today, Arabian horses are found all over the world. Arabian horse families are now labeled by where their most recent ancestors were bred, such as \"Polish,\" \"Spanish,\" \"Crabbet\" (from England), \"Russian,\" \"Egyptian\", and \"Domestic\" (in the United States), \"Weil-Marbach\" in Germany. For example, an Arabian horse who is called as a \"Polish Arabian\" is an Arabian horse who has recent ancestors that were bred at farms in Poland, from horses, which the Polish people bought from the Bedouins in the Arabian Peninsula many centuries ago. == Uses == Arabian horses compete in many places, including horse races, horse shows, endurance riding, show jumping, and more. They also make good pleasure, trail, working ranch horses for people who do not like competitive events. Arabian horses also are seen in movies, parades, circuses and other places where horses are used. == History == There are many legends and myths about Arabian horses. One legend says that the prophet Muhammad selected his five finest mares (female horses), called Al Khamsa (\"the five\") to be the foundation of the Arabian breed of horses fully. An another legend says the Queen of Sheba gave an Arabian mare to King Solomon, and that is how the Arabian horse breed began historically. Yet an another story says that Yahweh created the Arabian horses from the south wind in the Arabian Peninsula, saying, \"I create you all, oh Arabian horses. I give you flight without wings.\" In real history, Arabian horses are one of the oldest human-developed horse breeds in the world. Pictures of \"Proto-Arabian\" horses that look a lot like modern Arabian horses were painted on rocks in the Arabian Peninsula as far back as 2500 BCE. The ancestors of the Bedouins had tamed horses not long after they tamed camels also. A horse skeleton was also unearthed in the Sinai peninsula in Egypt in Avaris, that was dated to 1700 BCE, and that this horse is the earliest horse in live in all of Ancient Egypt. It was brought by the Hyksos invaders who lived in Egypt. This horse had a wedge-shaped head, large eyes, a small muzzle, just like the Arabian horses that live today. In the Arabian desert, humans were the only source of food and water for the Arabian horse. Where there was no pasture, the Bedouin fed their horses dates, a fruit of the date palms, and camels's milk. Arabian horses needed to live on very little food and water, survive a dry climate that was very hot in the day but very cold at night. Weak horses did not live and died off immediately, and the strong horses who survived the Arabian desert also then survived being ridden onto all wars. Therefore, the Arabian horse became very tough and able to live in a harsh world. == Famous Arabian horses == Napoleon rode a gray Arabian stallion named Marengo. George Washington rode a half-Arabian named Blueskin during the American Revolution. A fictional horse, \"The Black Stallion,\" was played by a real black Arabian stallion named Cass Ole in the movie that was based on the book by Walter Farley. == Aziziye Stud == In 1864, the Sultan Abdulaziz, founded a new horse stud with Arabian horses and sent a commission to purchase in Bialocerkiew, the stud of Count Branicki in Poland, whose breeding have a very good reputation. The Commission purchased 92 horses, including some descendants of the 1855, stallion Indjanin imported from England. == Other websites == * Arabian Horse Association (USA) * Arabian Horse site (AR) Category:Horse breeds",
 "title": "Arabian horse"
}