{
 "id": "431832",
 "text": "The Gangetic Plains is the large space of level land that is made by the Ganges River in the northern parts of India and the border surrounding areas of the Himalayas. It is an important part of the countries of India, Nepal, and Bangladesh. Its space of about is the home of about 1 billion people (about one in every seven persons alive today). Its western edge is the Thar Desert; its northern edge is the Himalaya Mountains, the highest mountains on Earth; its eastern edge is the Ganges Delta of Bangladesh, the largest River delta in the world; and its southern edge is made by the Vindhya Mountains and Satpura Range and Chota Nagpur Plateau of middle India.The area has fertile land for agriculture, adequate water supply and favourable climate. It is known as a Cradle of civilization. === Formation of Northern Plains: === Due to the uplift of the Himalayas in the Tethys Sea, the northern part of the Indian Peninsula got subsided and formed a large basin. === Chief Characteristics: === * The northern plain of India is formed by three river systems, i.e. the Indus, the Ganga, and the Brahmaputra; along with their tributaries. * The northern plains are the largest alluvial tract of the world. These plains extend approximately 3200 km from west to east. * The average width of these plains varies between 150 and 300 km. In general, the width of the northern plains increases from east to west (90-100km in Assam to about 500km in Punjab). * The exact depth of alluvium has not yet been fully determined. According to recent estimates, the average depth of alluvium in the southern side of the plain varies between 1300-1400m, while towards the Shiwaliks, the depth of alluvium increases. The maximum depth of over 8000m has been reached in parts of Haryana. * The extreme horizontal of this monotonous plain is its chief characteristic (200m – 291m). The highest elevation of 291 m above mean sea level near Ambala forms a watershed between the Indus system and the Ganga system). * The monotony of the physical landscape is broken at the micro level by the river bluffs, levees, etc. ** Floodplain – That part of a river valley, adjacent to the channel, over which a river flows in times of a flood. ** Levee – An elevated bank flanking the channel of the river and standing above the level of the flood plain. ** Bluff – A river-cut cliff or steep slope on the outside of a meander. A line of bluffs often marks the edge of a former floodplain. Northern Plains of India === Physiographic Divisions of the Northern Plains: === From the north to the south, the northern plains can be divided into three major zones: # The Bhabar # The Tarai # The alluvial plains. Bhabar: * Bhabar is a narrow belt (8-10km wide) which runs in the west-east direction along the foot of the Himalayas from the river Indus to Teesta * Rivers that descend from the Himalayas deposit their load along the foothills in the form of alluvial fans * These fans consisting of coarser sediments have merged together to build up the Piedmont Plain/the Bhabar. * The porosity of the pebble-studded rock beds is very high and as a result, most of the streams sink and flow underground. Therefore, the area is characterized by dry river courses except in the rainy season. * The Bhabar tract is not suitable for the cultivation of crops. Only big trees with large roots thrive in this region. * The Bhabar belt is comparatively narrow in the east and extensive in the western and north- western hilly regions. Northern Plains of India Tarai: ** It is a 10-20 km wide marshy region in the south of Bhabar and runs parallel to it. ** The Tarai is wider in the eastern parts of the Great Plains, especially in the Brahmaputra valley due to heavy rainfall. ** It is characterized by the re- emergence of the underground streams of the Bhabar belt. ** The reemerged water transforms large areas along the rivers into badly drained marshy lands. ** Once covered with dense forests, most of the Tarai land (especially in Punjab, Uttar Pradesh, and Uttarakhand) has been reclaimed and turned into agricultural land over a period of time. Northern Plains of India Bhangar: ** It is the older alluvium along the river beds forming terraces higher than the flood plain. ** Dark in color, rich in humus content, and productive. ** The soil is clayey in composition and has lime modules (called kankar) ** Found in doabs (interfluve areas) ** ‘The Barind plains’ in the deltaic region of Bengal and the ‘Bhur formations’ in the middle Ganga and Yamuna doab are regional variations of Bhangar. ** In relatively drier areas, the Bhangar also exhibits small tracts of saline and alkaline efflorescence known as ‘Reh’, ‘Kallar’ or ‘Bhur’. Reh areas have spread in recent times with an increase in irrigation. ** Maybe fossil remains of even those plants and animals that have become extinct. Northern Plains of India Khadar: ** Composed of newer alluvium and forms the flood plains along the river banks. ** Light in color, sandy in texture, and more porous. ** Found near the riverbeds. ** A new layer of alluvium is deposited by river floods almost every year. This makes them the most fertile soils of the Ganges. ** In Punjab, the Khadar-rich flood plains are locally known as ‘Betlands’ or ‘Bets’. ** The rivers in the Punjab-Haryana plains have broad flood plains of Khadar flanked by bluffs, locally known as Dhayas. These bluffs are as high as 3 meters. Category:Geography of India Category:Geography of Nepal Category:Geography of Bangladesh Category:Plains",
 "title": "North Indian Plain"
}