{
 "id": "43195",
 "text": "A transposable element is often called a transposon. It is a sequence of DNA that can move to new positions in the genome of a single cell. The press sometimes call them jumping genes, but it is not correct to call them 'genes'. Transposons were first found by Barbara McClintock while working on maize in the 1930s to 1950s. She discovered transposition in maize, but it took years before her work was understood. She received a Nobel Prize for her work in 1983. Transposition can create significant mutations and alter the cell's genome size. ==Types == Transposons are only one of several types of mobile genetic elements. Transposons themselves are of two types according to their mechanism, which can be either \"copy and paste\" (class I) or \"cut and paste\" (class II). Class I (Retrotransposons, aka retroposons): They copy themselves in two stages, first from DNA to RNA by transcription, then from RNA back to DNA by reverse transcription. The DNA copy is then inserted into the genome in a new position. Retrotransposons behave very similarly to retroviruses, such as HIV. Class II (DNA transposons): By contrast, the cut-and-paste transposition mechanisms of class II transposons do not involve an RNA intermediate. == As causes of disease == Transposons are mutagens. They can damage the genome of their host cell in different ways: * A transposon or a retroposon that inserts itself into a functional gene will most likely disable that gene. * After a transposon leaves a gene, the resulting gap will probably not be repaired correctly. * Multiple copies of the same sequence, such as Alu sequences can hinder precise chromosomal pairing during mitosis and meiosis, resulting in unequal crossovers, one of the main reasons for chromosome duplication. == Use == Transposons can carry accessory genes, such as antibiotic resistance genes. They can be used to put a gene into the DNA of an organism. This has been done with fruit flies (Drosophila melanogaster) by putting the transposon into the embryo. == Examples == * The first transposons were discovered in maize (Zea mays), by Barbara McClintock in 1948, for which she was awarded a Nobel Prize in 1983. She noticed chromosome mutations caused by these transposons. About 50% of the total genome of maize consists of transposons. The Ac/Ds system McClintock described are class II transposons. * One family of transposons in the fruit fly Drosophila melanogaster are called P elements. They seem to have first appeared in the species only in the middle of the twentieth century. Within 50 years, they have spread through every population of the species. Artificial P elements are used to insert genes into Drosophila by injecting the embryo.Ivics Z. and Izsvak Z. 2005. A whole lotta jumpin’ goin’ on: new transposon tools for vertebrate functional genomics. Trends Genet. 21, 8-11. * The most common form of transposon in humans is the Alu sequence. It is approximately 300 bases long and can be found between 300,000 and a million times in the human genome. *Mariner-like elements are another prominent class of transposons found in multiple species including humans. The Mariner transposon was first discovered by Jacobson and Hartl in Drosophila.Jacobson J.W; Medhora M.M. & Hartl D.L. 1986. Molecular structure of a somatically unstable transposable element in Drosophila. PNAS 83, 8684-8 . This Class II transposable element is known for its uncanny ability to be transmitted horizontally in many species.Lohe A.R; Moriyama E.N; Lidholm D.A. & Hartl D.L. 1995. Horizontal transmission, vertical inactivation, and stochastic loss of mariner-like transposable elements. Mol Biol Evol 12, 62-72.Lampe D.J. et al. 2003. Recent horizontal transfer of mellifera subfamily mariner transposons into insect lineages representing four different orders shows that selection acts only during horizontal transfer. Mol Biol Evol 20, 554-62. There are an estimated 14 thousand copies of Mariner in the human genome comprising 2.6 million base pairs.Mandal P.K. & Kazazian H.H. Jr. 2008. SnapShot: Vertebrate transposons. Cell 135, 192-192 e1. == Evolution == Transposons are found in many forms of life. They may have arisen independently many times, or perhaps just once and then spread to other kingdoms by horizontal gene transfer. While some transposons may confer benefits on their hosts, most are regarded as selfish DNA parasites. In this way, they are similar to viruses. Various viruses and transposons also share features in their genome structures and biochemical abilities, leading to speculation that they share a common ancestor. Excessive transposon activity can destroy a genome, which is lethal. Many organisms have developed mechanisms to inhibit them. Bacteria may delete transposons and viruses from their genomes; eukaryotic organisms use RNA interference (RNAi) to inhibit transposon activity. In vertebrate animal cells nearly all the 100,000+ DNA transposons in a genome code for inactive polypeptides.Plasterk R.H.A; Izsvák Z. and Ivics Z. 1999. Resident aliens: the Tc1/mariner superfamily of transposable elements. Trends Genet. 15, 326-332. In humans, all of the Class I-like transposons are inactive. The first DNA transposon used as a tool for genetic purposes, the Sleeping Beauty transposon system, was a transposon which was resurrected from a long evolutionary sleep.Ivics Z. et al 1997. Molecular reconstruction of Sleeping Beauty, a Tc1-like transposon from fish, and its transposition in human cells. Cell 91, 501-510. Luft F.C. 2010. Sleeping Beauty jumps to new heights. Mol. Med 88 (7): 641–643. === Role in the immune system === Transposons may have been co-opted by the vertebrate immune system as a means of producing antibody diversity: The V(D)J recombination system operates by a mechanism similar to that of transposons. This is a system of three genes which get rearranged in the production of vertebrate lymphocytes. The system diversely encode proteins to match antigens from bacteria, viruses, parasites, dysfunctional cells such as tumor cells,Abbas A.K. and Lichtman A.H. 2003. Cellular and molecular immunology. 5th ed, Saunders, Philadelphia. and pollens. The final DNA sequence, and thus the sequence of the antibody, is highly variable, even when the same two V, D, or J segments are joined. This great diversity allows VDJ recombination to generate antibodies even to microbes that neither the organism nor its ancestors have ever previously encountered. == References == Category:DNA Category:Evolutionary biology",
 "title": "Transposable element"
}