{
 "id": "432033",
 "text": "Oliver Glasner (born 28 August 1974) is an Austrian retired football player. He is now coach of Crystal Palace F.C. in the Premier League. ==Career== Glasner started with SV Riedau, then went on to SV Ried. There he played from 1992 until 2011. In the 2003/04 season, he played for LASK Linz on loan. For SV Ried he played 516 matches and scored 27 goals. He played for Ried in an international match in 2011. He then had to have surgery on his brain, which ended his career. In 2012 he came to FC Red Bull Salzburg and worked in the managing staff. After the replacement of Ricardo Moniz he became assistance coach to Roger Schmidt. For the 2014/15 season he became head coach of SV Ried. Laola1.at 2015 Glasner went to LASK Linz for the 2015/16 season to act as head coach and sports director. ORF Oberösterreich (German) With LASK he was promoted to the Bundesliga in 2017 and placed fourth with the Upper Austrians at the end of the 2017/18 season. In the 2018/19 season, Glasner took second place with LASK in the regular season and qualified for the championship group. There they were able to hold on to second place and thus qualify for the second qualifying round of the Champions League. For the 2019/20 season he moved to Germany and took over the Bundesliga team VfL Wolfsburg. In the 2020/21 season they qualified for the Champions League. For the 2021/22 season, Glasner moved to Eintracht Frankfurt in the Bundesliga. In the Europa League they reached the final for the first time after 42 years. They won the final against Glasgow Rangers on 18 May 2022 on penalties. Glasner became the third Austrian coach after Béla Guttmann and Ernst Happel who won an European football competition. The following season, Eintracht Frankfurt took part in the Champions League for the first time. They finished second in the group but lost to SSC Neapel in the Knock-out stage. After the season Glasner left Frankfurt. In February 2024 Glasner moved to the English Premier League club Crystal Palace. cpfc.co.uk/news ==Honours== *Austrian Cup: 1998, 2011 with SV Ried *Lifetime Honorary captain of SV Ried *UEFA Euroleague: 2022 with Eintracht Frankfurt ==References== Category:1974 births Category:Living people Category:Austrian football managers Category:Austrian footballers Category:FC Liefering managers Category:SV Ried managers Category:LASK managers Category:Austrian football defenders Category:LASK players",
 "title": "Oliver Glasner"
}