{
 "id": "432548",
 "text": "Lupita Nyong'o (born 1983) is a Kenyan-Mexican actress and filmmaker. The first American movie she acted in was 12 Years a Slave. Nyong’o won several awards, including the Academy Award for Best Supporting Actress, for her role in 12 Years a Slave. She was also in Black Panther (2018) and Us (2019). ==Early life and career== Nyong'o was born in Mexico City, Mexico, in 1983 to Dorothy and Peter Anyang' Nyong'o. Her parents had fled Kenya because they were being harassed by the government there; her uncle was killed in 1980. The family moved back in 1987 but they were still harassed by Daniel arap Moi's government, which was supported by the United States and United Kingdom. Nyong'o was raised mostly in Kenya, but returned to Mexico as a teenager and attended university in the United States. After graduating, she played a role in the 2009 Nigerian television show Shuga. She went back to school and got a Master's degree from Yale's School of Drama in 2012. In 2014, Nyong’o won several awards, including the Academy Award for Best Supporting Actress, for her role in 12 Years a Slave. She said her acting in 12 Years a Slave was inspired by Michael Jackson and Whoopi Goldberg. Nyong'o was nominated for the British Film Academy’s Rising Star Award and on the cover of Dazed & Confused and W magazine's February 2014 issues. She was named the most beautiful in the world by PEOPLE magazine in April 2014. Nyong'o continued to act in major Hollywood movies including Star Wars: The Force Awakens (2015), The Jungle Book (2016), Black Panther, and Us. As well as acting, in 2019 and 2020 she wrote a children's book, Sulwe, which was released in English, Swahili, and Luo. She also won a Daytime Emmy Award for an episode in “Bookmarks: Celebrating Black Voices,” in which she read from her children’s book Sulwe. ==References== Category:Academy Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:1983 births Category:Living people Category:Mexican movie actors Category:Kenyan people Category:Actors from Mexico City",
 "title": "Lupita Nyong'o"
}