{
 "id": "432850",
 "text": "The École Polytechnique Massacre, known also as the Montreal massacre was a school shooting on December 6, 1989. It took place at the École Polytechnique de Montréal, an engineering school and faculty that is affiliated with the Université de Montréal in Montreal, Quebec, Canada. Marc Lépine, a twenty-five year old, shot 28 people and killed 15 people as well as himself (suicide). The shooter targeted women in the attack and said that he was \"fighting feminism\" and called the women \"a bunch of feminists\". ==The attack== He entered the building sometime at 4 p.m. on December 6, 1989 with a Ruger Mini-14 rifle and hunting knife. After he entered a second floor mechanical engineering class of about sixty students at about 5:10 p.m., he approached a student that was giving a presentation. He ordered that everyone stop what they were doing and both men and women to go to opposite sides of the classroom. Nobody moved at first, believing it to be a joke until he fired a shot into the ceiling. He asked the women whether they knew why they were but some asked who he was. He answered that he was fighting feminism. One of the students, Nathalie Provost, protested that they were women studying engineering, not feminists fighting against men. He responded by opening fire on the students from left to right, killing six—Hélène Colgan, Nathalie Croteau, Barbara Daigneault, Anne-Marie Lemay, Sonia Pelletier, and Annie St- Arneault—and wounding three others, including Provost. He killed six women and wounded three others there. After that, he moved to the second floor corridor and wounded three other students before he entered another room where he tried to shoot a female student twice but failed. He reloaded the gun in the emergency staircase and tried to enter the room that he left but the students locked the door. He attempted to unlock it with three gunshots but failed. He moved through the corridor where he shot and wounded a student. He went to the financial services office and shot and killed a woman through the window of a door she had locked. He went down the stairs to the first floor cafeteria which had around a hundred people in it. He shot a woman standing near the kitchens and wounded another student. After hearing the gunshots, everyone scattered. He killed two more women after finding them hiding. He went up the escalator to the third floor shooting and wounding three students in the corridor. After entering a classroom where a presentation was being held, he shot at the front row and killed two women who were trying to escape. He shot three more female students and killed another. After hearing Maryse Leclair, a student he had shot, ask for help, he took out his hunting knife and stabbed her three times, killing her. He then took off his hat, wrapped his jacket around the gun and killed himself. ==References== Category:1989 in North America Category:1980s in Canada Category:20th century in Montreal Category:Attacks on buildings and structures in North America Category:Attacks on buildings and structures in the 1980s Category:Incidents of violence against women Category:Mass murder in the 1980s Category:Mass shootings in North America Category:Massacres in North America Category:Murder in Canada Category:Murders by firearm Category:Murder-suicides in North America Category:School shootings Category:Suicides by firearm Category:Suicides in Canada",
 "title": "École Polytechnique massacre"
}