{
 "id": "432858",
 "text": "Ezra Matthew Miller (born September 30, 1992) is an American actor of Jewish descent. They played Patrick in the 2012 movie The Perks of Being a Wallflower. For the role they won the Boston Society of Film Critics Award for Best Supporting Actor. Miller appeared in the 2016 movie Batman v Superman: Dawn of Justice as The Flash. They played the role again on Suicide Squad, the 2017 movie Justice League and in their own 2023 movie. Miller portrayed Credence Barebone in the 2016 movie Fantastic Beasts and Where to Find Them. Miller came out as queer in 2012. ==Filmography== Year Title Role Notes 2008 Afterschool Robert 2009 City Island Vincent \"Vinnie\" Rizzo Jr. 2010 Beware the Gonzo Eddie \"Gonzo\" Gilman 2010 Every Day Jonah 2011 Another Happy Day Elliot Hellman 2011 Busted Walk Jay Turner Short film 2011 We Need to Talk About Kevin Kevin Khatchadourian 2012 The Perks of Being a Wallflower Patrick 2014 Madame Bovary Leon Dupuis 2015 The Stanford Prison Experiment Daniel Culp / Prisoner 8612 2015 Trainwreck Donald 2016 Batman v Superman: Dawn of Justice Barry Allen / The Flash 2016 Suicide Squad Barry Allen / The Flash Cameo 2016 Fantastic Beasts and Where to Find Them Credence Barebone 2017 Justice League Barry Allen / The Flash 2018 Fantastic Beasts: The Crimes of Grindelwald Credence Barebone 2021 Zack Snyder's Justice League Barry Allen / The Flash 2021 Asking For It Mark Vanderhill 2022 Untitled third Fantastic Beasts movie Credence Barebone Post-production 2022 The Flash Barry Allen / The Flash Filming TBA Dalíland Young Salvador Dalí Post-production ==References== == Other websites == * Category:1992 births Category:Living people Category:Actors from New Jersey Category:American child actors Category:American child singers Category:American movie actors Category:American television actors Category:Jewish American actors Category:Jewish American musicians Category:LGBT actors Category:LGBT Jews Category:LGBT people from New Jersey Category:LGBT singers Category:People from Wyckoff, New Jersey Category:Queer people Category:Singers from New Jersey Category:LGBT models Category:Models from New Jersey",
 "title": "Ezra Miller"
}