{
 "id": "43299",
 "text": "Iguanodon is a genus of ornithopod dinosaur from the Lower Cretaceous period in Europe, North America, Africa and Asia. It lived 125/126 million years ago (mya).Norman, David B. 2004. \"Basal Iguanodontia\". In Weishampel D.B., Dodson P., and Osmólska H. (eds) The Dinosauria. 2nd ed, Berkeley: University of California Press. pp413–437 Discovered in 1822 and described three years later by English geologist Gideon Mantell, Iguanodon was the second dinosaur formally named, after Megalosaurus. Together with Megalosaurus and Hylaeosaurus, it was one of the three genera originally used to define the Dinosauria. A large, bulky herbivore, Iguanodon is thought by some to be in the same family as the duck-billed hadrosaurs. The taxonomy of the genus continues to be a topic of study as new species are named or long-standing ones reassigned to other genera. Scientific understanding of Iguanodon has evolved over time. New information is got from the fossils. Researchers have made suggestions about the living animal, including feeding, movement, and social behaviour. As one of the first scientifically known dinosaurs, Iguanodon is well known.Norman, David B.; Weishampel, David B. 1990. \"Iguanodontidae and related ornithopods\". In Weishampel, David B.; Dodson, Peter; and Osmólska, Halszka (eds) The Dinosauria. Berkeley: University of California Press. pp510–533 == Species == There are at least two species recognised: *I. bernissartensis, described by George Albert Boulenger in 1881, is the type species for the genus. This species is best known for the many skeletons discovered in a coal mine in Bernissart, Belgium in 1878. The coal dates to the earliest Cretaceous period.Paul, Gregory S. 2008. A revised taxonomy of the iguanodont dinosaur genera and species. Cretaceous Research 29 (2): 192–216. 36 adult skeletons were excavated at this site, a coal mine. This is by far the largest find of this species. The species is large and strong. *I. galvensis, described in 2015, is based on adult and juvenile remains found in deposits in Teruel, Spain, dating to about 126 mya.Francisco J. Verdú et al 2015. Perinates of a new species of Iguanodon (Ornithischia: Ornithopoda) from the lower Barremian of Galve (Teruel, Spain). Cretaceous Research 56: 250–264. doi:10.1016/j.cretres.2015.05.010. == Posture and movement == Because its front limbs were shorter than the hindlimbs, Mantell guessed it could move on two legs, as opposed to Owen, who thought it was quadrupedal. As it happens, it probably used both modes. Slow walking would be done on all fours, and faster running on the hind legs. Either way, the position of the body would be more horizontal than upright, with the tail held above the ground by its ossified (bony) ligaments (they can be clearly seen on the skeleton). It would defend itself against predators on its hind legs, using its strong front arms and dagger-like thumbs as weapons. == Eating == The teeth were close-set grinding teeth suitable for a browser. it is believed that, as with most other ornithischians, Iguanodon had some sort of cheek-like structure, muscular or non-muscular, to keep food in the mouth.Fastovsky D.E. and Smith J.B. 2003. Dinosaur paleoecology. The Dinosauria, 614–626. == References == Category:Iguanodonts",
 "title": "Iguanodon"
}