{
 "id": "43314",
 "text": "The Waffen-SS was part of the Schutzstaffel (SS). \"Waffen-SS\" means \"Armed SS\" or \"Armed Elite Guards\" in German. The Waffen-SS was a paramilitary organization within the SS. Which is the SS’s own Nazi ground Army . The divisions of the Waffen-SS were made of highly trained soldiers. Their original job was to protect higher-ranking people in the SS and the Nazi Party but later the Waffen-SS became a fully fledged military unit. Together with the Sturmabteilung (\"Storm Battalion,\" or SA), they were used as a paramilitary police force. In 1937, some soldiers were reorganized and nazi leaders gave some SS members the job of guarding and running concentration camps (and, later, death camps). These soldiers were moved from the Waffen-SS to the SS-Totenkopfverbände. But a main time the totenkopfverbände are a part of the SS too. In some of the concentration camps, like Auschwitz and Buchenwald, doctors of the Waffen-SS did experiments on humans. Heinrich Himmler led the SS from 1929 until Nazi Germany lost World War II in 1945. After World War II, the SS were found guilty of crimes against humanity, and the SS was completely abolished. ==Divisions of the Waffen-SS== The Waffen-SS was grouped into divisions, as follows:Cook, Stan & Bender, Roger James 1994. Leibstandarte SS Adolf Hitler: uniforms, organization, & history. San Jose, CA: R. James Bender. * SS-Infantry-Divisions * SS-Mountain-Divisions * SS- Armored-Grenadier-Divisions * SS-Tank-Divisions * SS-Cavalry-Divisions The differences to the normal army units were as follows: * All Infantry divisions had Anti-aircraft-cannons and supply battalions * All mountain divisions had either a tank division or stormtroopers. * All tank divisions had special battalions * All divisions had more infantry == War crimes of the Waffen-SS == * The motorised infantry \"Leibstandarte Adolf Hitler\" took over the Wormhoudt, in northern France. This happened in the month of May 1940. During the takeover, members of the division shot 45 captured British prisoners of war. * About a day after Allied soldiers had landed in Normandy, members of the SS Panzer Division \"Hitlerjugend\" shot about 18 Canadian prisoners of war in the courtyard of the Abbey Ardenne Near Caen. Kurt Meyer was charged after the war for the war crime and was sentenced to death. However, the case fell apart when Canadian officers came to his defense. * The massacre of Oradour-sur- Glane is directly linked to the history of the Waffen-SS. The 2nd tank division \"Das Reich\" killed 642 people. There were 245 women and 207 children among them. The victims were either shot, or burned in their houses. ==British SS== One of the strangest SS units was the British Free Corps. It was a unit of the Waffen SS during World War II. The unit was made of about 27 prisoners of war from the British Empire. One British soldier who helped recruit other soldiers to join the unit was John Amery. After the war, he was sentenced to death for high treason, he was then executed. ==The troops after 1945== After the end of the war, all soldiers were dismissed from the SS, since the SS was dissolved after the fall of the German Reich.In 1951, the Hilfsgemeinschaft auf Gegenseitigkeit der ehemaligen Angehörigen der Waffen-SS was founded in Germany. This translates to Mutual support organisation of former members of the Waffen-SS'. In English, it is better known as \"HIAG.\" The group wanted soldiers who were in the Waffen-SS to be treated the same as soldiers of the Wehrmacht (the regular German Armed Forces ).The group also publishes a magazine. The magazine tries to send the message that the Waffen-SS Soldiers were just and not inhumane or war criminals any more than any other soldiers on neither side of the conflict. Sometimes, there are also revisionist articles in it. == References == == Other websites == * Waffen-SS * Waffen-SS Divisions Category:War crimes Category:World War II Category:SS",
 "title": "Waffen-SS"
}