{
 "id": "43339",
 "text": "A sex toy is a device that helps humans get more pleasure when they have sex or when they masturbate. Sometimes these devices are also called adult toy, or marital aid. \"Marital aid\" may also apply to herbs or drugs that have such an effect. Herbs with such an effect are aphrodisiacs. Pornography is not called a sex toy. Neither are condoms or methods of birth control. Sex toys can be bought in sex shops. There are also special trade fairs for them. And many online stores sell them on the internet. Crab-eating Macaques on Bali have been seen as they used stones to sexually stimulate themselves.Camilla Cenni et al.: Inferring functional patterns of tool use behavior from the temporal structure of object play sequences in a non-human primate species. In: Physiology & Behavior. Band 222, 2020, 112938, doi:10.1016/j.physbeh.2020.112938. Camilla Cenni et al.: Do monkeys use sex toys? Evidence of stone tool-assisted masturbation in free-ranging long-tailed macaques. In: Ethology. Band 128, Nr. 9, 2022, S. 632–646, doi:10.1111/eth.13324. == History == The idea of a sex toy isn't new. Some, shaped as phalluses, have been made since the Neolithic. There are paintings from Ancient Engypt that show dildoes. Artifacts from the Upper Paleolithic of a type called bâton de commandement could have been used for sexual purposes.Marshack, A. 1972 The Roots of Civilization McGraw-Hill New York: 333 Few archaeologists consider these items as sex toys, but archaeologist Timothy Taylor put it, \"Looking at the size, shape, and—some cases—explicit symbolism of the ice age batons, it seems disingenuous to avoid the most obvious and straightforward interpretation. But it has been avoided.\"Taylor, T. 1996. The Prehistory of Sex. New York: Bantam. p. 128.Paul L. Vasey, Intimate Sexual Relations in Prehistory: Lessons from the Japanese Macaques. World Archaeology, Vol. 29, No. 3, Intimate Relations (Feb., 1998), pp. 407-425 == Legality == Sex toys are illegal in some countries. India considers them obscene, and sellng or trading them is banned.Singh, Jyotsna (20 June 2007). India rattled by vibrating condom. BBC News In Malaysia, selling dildoes is banned as well. == Effects == There has been research into sex toys, to see if their use is good for health or not. Most studies show that most people have a positiive experience about using sex toys. They report that they are sexually aroused and satisfied more often, that it was easier to get an orgasms (especially for women), and that there was a more playful approach to sex and the fun of something new during sex. There are stores that specialise on toys for women. Some organizations link the sale of sex toys with sexual education and aim to support women's sexual empowerment. In clinical settings, more positive effects have been found: Sex toys are used for therapies, for example, in the context of therapy for orgasm disorders. They can also enable people with disabilities to have more sexual activity. == Types == Types of sex toys include: * Dildo * Vibrator (sensual) == References == Category:Sex toys",
 "title": "Sex toy"
}