{
 "id": "433402",
 "text": "Paracanthurus is a genus of surgeonfish. It contains a single member species, Paracanthurus hepatus. It is often called the palette tang. It lives in the Indian Ocean and the western and central Pacific Ocean. It is a popular fish in marine aquariums. ==Description== The palette tang has a royal blue body, a yellow tail, and a black area that looks like an artist's palette. The lower body is yellow in the west-central Indian Ocean.H. Debelius, Indian Ocean Tropical Fish Guide (Aquaprint Verlags GmbH, 1993) It grows to 30 cm (12 in.).Meryl G. Rose, Field Guide to the Sāmoan Archipelago: Fish, Wildlife, and Protected Areas (Honolulu: Bess Press, 2002), p. 124 This fish has a flat shape, like a pancake, with a circular body shape, a pointed snout-like nose, and small scales. The Palette Tang has 9 spines on its back. It also has 3 spines on the bottom near the tail. Other names this species is known by include regal tang, palette surgeonfish, blue tang (sometimes confused with the Atlantic Acanthurus coeruleus), royal blue tang, hippo tang, flagtail surgeonfish, pacific regal blue tang and blue surgeonfish. ==Range== The species' range is broad. It can be found throughout the tropical waters of the Indian Ocean and the western and central Pacific Ocean. It is also found in the seas connecting the two oceans. It is seen in reefs of East Africa, Japan, Samoa, New Caledonia, and the Great Barrier Reef.Robert F Myers, Micronesian Reef Fishes: a field guide for divers and aquarists (Barrigada, Territory of Guam, U.S.A.: Coral Graphics, 1999), p. 184 They live in pairs or in a small groups of up to 10 or 12 individuals. These fish reach sexual maturity at 9–12 months of age. The Palette Tang is one of the most common and most popular Marine Aquarium fish all over the world.George C. Blasiola, The Saltwater Aquarium Handbook (Hauppauge, NY: Barron's, 2000), p. 76 In an aquarium they must be given more space or they will act aggressively towards each other. ==Diet== As a young fish it eats mostly plankton. Adults fish are omnivorous and feed on plankton and algae. Spawning occurs during late afternoon and evening hours. While it is spawning the fish's color changes from an even dark blue to a pale blue. == References == ==Other websites== * Tangs and Surgeonfish * E.J. Peiker, Palette Tang * Palette Surgeonfish (a.k.a. Pacific Blue Tang or Yellowtail Surgeonfish), Toledo Zoo Category:Acanthuriformes",
 "title": "Paracanthurus"
}