{
 "id": "433451",
 "text": "The Division of Riverina is an Australian electoral division in the state of New South Wales. It is located in south-west rural New South Wales, generally following the Murrumbidgee River valley. It was one of the original 75 divisions set up for the first Australian federal election in 1901. It was named after the Riverina region in which it is located. The division includes the cities of Wagga Wagga and Griffith and the towns of Coleambally, Coolamon, Gundagai, Hillston,Junee, Leeton, Narrandera, Temora, Tumut, Tumbarumba and West Wyalong. The Sturt Highway runs along the length of the division. ==History== There was a by-election in Riverina in 1904. Robert Blackwood won the seat by only a few votes from John Chanter. The results were challenged in the courts and a new election was held in which Chanter won the seat. There was another by-election in 1965 after Hugh Roberton resigned. In the 1984 the division was abolished and replaced by the Division of Riverina-Darling. In 1992 the division was re-created. Originally the division included the Labor- voting mining towns of Broken Hill and Cobar, but these are now in the divisions of Farrer and Parkes. This has made Riverina a safe National Party seat. ==Members== Riverina (1901–1984) Member Party Term John Chanter Protectionist 1901–1903 Robert Blackwood Free Trade 1903–1904 John Chanter Protectionist 1904–1909 Labor 1909–1913 Franc Falkiner Commonwealth Liberal 1913–1914 John Chanter Labor 1914–1916 National Labor 1916–1917 Nationalist 1917–1922 William Killen Country 1922–1931 Horace Nock Country 1931–1940 Joe Langtry Labor 1940–1949 Hugh Roberton Country 1949–1965 Bill Armstrong Country 1965–1969 Al Grassby Labor 1969–1974 John Sullivan Country 1974–1975 National Country 1975–1977 John FitzPatrick Labor 1977–1980 Noel Hicks National Country 1980–1982 National 1982–1984 Riverina (1993–present) Member Party Term Noel Hicks National 1993–1998 Kay Hull National 1998–2010 Michael McCormack National 2010–present Al Grassby was the Minister for Immigration in the Whitlam government. ==Election results== ==References== ==Other websites== * Division of Riverina - Australian Electoral Commission Category:Electoral divisions of New South Wales Category:1901 establishments in Australia Category:1984 disestablishments in Australia Category:1992 establishments in Australia",
 "title": "Division of Riverina"
}