{
 "id": "43346",
 "text": "Velociraptor Velociraptor = 'swift robber', sometimes called 'raptor' for short. was a predatory dromaeosaur of the Upper Cretaceous, about 75–71 million years ago. Godefroit, Pascal et al 2008. A new species of Velociraptor (Dinosauria: Dromaeosauridae) from the Upper Cretaceous of northern China. Journal of Vertebrate Paleontology 28 (2): 432–438. It was a slender, lightly built carnivore. It was about two meters long (nearly seven feet) and 0.62 meters tall at the hip. Velociraptor had one sickle-shaped claw on its foot which measured 6.5 centimeters along its length, and a smaller one on each hand. Velociraptor was warm blooded and had feathers. Fossils from China suggest that the whole clade had similar traits.Milner, Angela 2002. Dinobirds: from dinosaurs to birds. Natural History Museum, London.Gee, Henry 2000. Deep time: cladistics, the revolution in evolution. Fourth Estate, London. Chapter 6 \"The being and becoming of birds\" is about the origin of birds.Benton M.J. et al. 2008. The remarkable fossils from the Early Cretaceous Jehol biota of China and how they have changed our knowledge of Mesozoic life. Proceedings of the Geological Association 119, p209–228. Fossils of Velociraptor were first found in the Gobi Desert of Mongolia in 1922. In 1988, scientists from China found Velociraptor skeletons in northern China.Dong Zhiming 1988. Dinosaurs from China. transl. Angela Milner, BM(NH)/China Ocean. A famous Velociraptor, discovered in 1971, was found attacking a Protoceratops in a fossil from Mongolia. == Feathers == In September 2007 researchers found quill knobs on the forearm of a Velociraptor found in Mongolia. These bumps on bird wing bones show where feathers anchor, and their presence on Velociraptor indicate it also had feathers.Turner A.H.; Makovicky P.J.; Norell M.A. 2007. Feather quill knobs in the dinosaur Velociraptor. Science 317: 1721. PMID 17885130. Turner and colleagues interpreted the presence of feathers on Velociraptor as evidence that the ancestors of dromaeosaurids could fly, making Velociraptor and other large members of this family secondarily flightless. This idea has since been discarded; the unmodified forearms count against it. Therefore, the feathers in the ancestors of Velociraptor had another function. The feathers of the flightless Velociraptor may have been used for display, and/or for covering their nests while brooding. The majority view is that dinosaur feathers were primarily adaptations for temperature regulation, and that other uses came later. Velociraptor was not able to fly. == Species == Specimens from two species have been found: *V. mongoliensis in Mongolia *V. osmolskae in Inner Mongolia, China In both cases the ecology of the time was dry, with sand dunes and occasional streams. == Related pages == * Origin of birds == References == Category:Dromaeosauridae Category:Feathered dinosaurs",
 "title": "Velociraptor"
}