{
 "id": "433589",
 "text": "Oswiu (–15 February 670), also known as Oswy or , became the King of Bernicia at the death of his brother Oswald. Later he became the King of Northumbria. When Oswiu defeated and killed Penda of Mercia at the Battle of the Winwaed, he became the seventh bretwalda over the southern English kings. He took the throne of Mercia and appointed his son-in-law Peada (Penda's son) as a client king. Oswiu was one of those rare kings of Northumbria who died of natural causes and not in battle. == Early career == Oswiu was born Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 281 He was a son of King Athelfrith of Bernicia and his second wife Acha of Deira. He was a younger brother of King Oswald of Northumbria.Rudolf Abraham, St Oswald's Way and St Cuthbert's Way (Milnthorpe, Cumbria: Cicerone, 2013), p. 26 When he was about 6 years old his father was killed in battle by Edwin who became King of Northumbria.John Marsden, Northanhymbre Saga; the History of the Anglo-Saxon Kings of Northumbria (London: Kyle Cathie Limited, 1992), p. 108 Along with his brothers Eanfrith and Oswald and their sister Aebbe, he found safety with the Scots in Dál Riata. The monks of Iona baptized the children and raised them in the Celtic Christian faith.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 279 About 634 Oswiu married Rhiainmelt, daughter of Rhoeth of Rheged, a marriage alliance arranged by his brother King Oswald. He had a son by this marriage, Alfrith of Deira. Rhiainmelt seems to have died as a year later Oswiu was in Ireland with the Dál Riatans. There he was involved with Fina, the daughter of the high King Colman. There is no record they married but they had a son Aldfrith of Northumbria (Irish name Flann Fína mac Oswiu). == King of Bernicia == When his brother Oswald was killed in 642, the overlordship died with him.Peter Hunter Blair, Roman Britain and Early England 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1963), p. 195 Oswald had been king of a combined Bernicia, Deira and Lindsey (kingdom).N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 128 But Northumbria was divided back into its earlier weaker sub-kingdoms. Penda, now the most powerful king in England took Lindsey. Oswiu became King of Bernicia.Frank Stenton, Anglo-Saxon England (Oxford: Oxford University Press, 1971), p. 83 Oswine claimed Deira, preventing Oswiu from keeping it with Bernicia. A year after it happened Oswiu recovered parts of his brother's body from the battlefield where he died. Oswiu had Oswald's arm enshrined in his royal centre at Bamburgh and his head was taken to Lindisfarne. Oswiu invaded Deira in 651 seeking to reunite Deira with Bernicia. Oswine was betrayed by one of his own noblemen and was murdered in 651 on Oswiu's orders.N. J. Higham, The Kingdom of Northumbria AD 350–1100 (Dover, NH: Alan Sutton Publishing, 1993), p. 130 But the Deirans chose Athelwald, Oswiu's nephew, as their king. Athelwald then aligned himself with Oswiu's enemy, Penda. Deira was under the protection of Mercia for the next three years. But Penda was determined to defeat Oswiu and take Bernicia as well. In 654 Penda raised a large army of some thirty 'legions'. According to Bede, Penda attacked Oswiu several times. With a much smaller force Oswiu attacked Penda's army near the banks of the River Winwaed.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), pp. 183–84 Most of the commanders of the thirty legions were killed including King Anna of East Anglia and Penda. From this time Oswiu became the bretwalda or overlord over all the southern English people including Mercia.Frank Stenton, Anglo-Saxon England (Oxford: Oxford University Press, 1971), p. 84 Mercia was then divided. North of the River Trent was controlled directly by Oswiu. He made Peada of Mercia, Penda's son, king over the part of Mercia south of the Trent. Peada had married Oswiu's daughter, Alflaed. Peada was murdered five months later by Alflaed, possibly on Oswiu's orders.Mike Ashley, The Mammoth Book of British Kings and Queens (New york: Carroll & Graf, 1999), p. 253 Mercians rebelled against Oswiu and Peada's brother Wulfhere became king of Mercia.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 185 == Easter controversy == When Oswiu and Eanflaed were married, he was raised in the Celtic church while she was raised in the Roman church.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 282 The main difference was how each calculated the date of Easter. Members of the Celtic church might be celebrating Easter while the Roman church was celebrating Lent. In 658 his son Alfrith, who now supported the Roman Church, replaced several of his Celtic church officials with those from the Roman church. To resolve the differences between the two religions in his kingdom, Oswiu called for a synod in 664. Called the Synod of Whitby it was to decide on when to celebrate Easter and what rules the monasteries in Northumbria would follow.Frank Stenton, Anglo- Saxon England (Oxford: Oxford University Press, 1971), p. 123 Members of the church were summoned from all over the north. The Roman position was given by Wilfrid who would afterwards become Bishop of Northumbria. Bishop Colmán argued for the Ionan calculation of Easter given them by Columba, founder of their order. Oswiu made the decision in favor of the Roman practice, uniting Northumbria under one religion. It joined Northumbrian religious practices to those of the southern English.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 283 Bede, in his Ecclesiastical History, Book IV, chapter 5 gives the date of Oswiu's death as 15 February, 670 and his age at 58.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 212 His wife Eanflaed retired to the monastery at Whitby. This is where their daughter, also named Enflaed, was brought up. In 680 Enflaed and her daughter became joint abbesses at Whitby. Enflaed died . == Family == Based on Nennius' Historia Brittonum Oswiu's first wife was a Briton named Reinmelth. She was the daughter of Royth, King of Rheged.John Marsden, Northanhymbre Saga; the History of the Anglo-Saxon Kings of Northumbria (London: Kyle Cathie Limited, 1992), pp. 135, 137 Together they had a son: * Alfrith, King of Deira. * Alflaed, she married Peada of Mercia.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin, 1990), p. 177 By Fina, daughter of the Irish High King Coleman, he had: * Aldfrith (Flann Fína mac Oswiu), King of Northumbria.Celtic Culture: A Historical Encyclopedia, ed. John T. Koch (Santa Barbara, CA: ABC-CLIO, 2006), p. 752 Oswiu married Eanflaed, daughter of King Edwin of Deira.Frank Stenton, Anglo- Saxon England (Oxford: Oxford University Press, 1971), p. 81 Together they had: * Ecgfrith, King of Deira under his father's rule and King of Northumbria at Oswiu's death.Mike Ashley, The Mammoth Book of British Kings and Queens (New York: Carroll & Graf, 1999), p. 270 * Elfwine, Kings of Deira. * Ostryth, married Aethelred I of Mercia * Enflaed, co-abbess of Whitby == Notes == == References == == Other websites == * Kings of Northumbria * The Battle of Winwaed: The Venerable Bede's Account Category:610s births Category:670 deaths Category:Northumbrian royalty",
 "title": "Oswiu of Northumbria"
}