{
 "id": "433706",
 "text": "Willow Camille Reign Smith (born October 31, 2000) is an American singer and actress. She is the daughter of actors Will Smith and Jada Pinkett Smith. She began acting in 2007 in the movie I Am Legend. She released her first single \"Whip My Hair\" in 2010. She released a single with Nicki Minaj in 2011. == Career == === 2007–2008 === Willow Camilie Reign Smith singer and actress. As her acting career kick started, Smith made her acting debut in I Am Legend a post-apocalyptic action thriller film alongside her father. Her next film, Kit Kittredge: An American Girl, a comedy-drama film was released on July 2, 2008. In 2008, she voiced in Madagascar: Escape 2 Africa, a 2008 American computer- animated comedy film produced by DreamWorks Animation and distributed by Paramount Pictures, as character young Gloria the hippo alongside her mother as character of Gloria the hippo. === 2009-2011 === Smith's mother Jada Pinkett Smith announced in an interview on Lopez Tonight that Smith would be releasing an album. Smith then released her first single, \"Whip My Hair\", which went platinum in the US and peaked at number eleven. In the UK the single peaked at number two. It sold 1,216,000 digital copies in the US. Smith soon after announced her next single, \"21st Century Girl\". The video clip of the song shows Willow on the set of the music video. 21st Century Girl is an upbeat dance song and was produced by Swedish production team Twin. She performed the song on The Oprah Winfrey Show, she released it the next day on February 3, 2011. The video was released March 9, 2011. On October 6, 2011, \"Fireball\", a collaboration between Smith and rapper Nicki Minaj, was released. It was released on iTunes two days later and was released to U.S. urban radio on October 18, 2011. In the song, Minaj says: \"Ok, I'm the street fighter, call me Chun-Li\" making referring to the character Chun-Li from the video game franchise Street Fighter. The song was a commercial failure, failing to chart in any type of music market, except the US R&B; chart, charting at 121. It was her first song to miss the Billboard Hot 100. Smith's producer announced that they were almost finished working on her debut album, and that it would be done soon. He also said it has a similar style to \"Whip My Hair\". The name of the album was later announced to be Knees and Elbows. It was scheduled to be released around April 2012, but was later announced that it would be released later in the year. === May 1, 2012 === She released a music video for \"Do it Like Me (Rockstar)\", saying that it was her \"first video ever\". === July 2, 2012 === Smith released the \"I Am Me\" music video at the BET Awards. === July 17, 2012: I Am Me === She released her fourth single, \"I Am Me\" via iTunes and Amazon. Knees and Elbows has still not been released yet and has most likely been abandoned and scrapped. === Summer, 2013: Melodic Chaotic === Smith and DJ Fabrega started a duo named \"Melodic Chaotic\". \"The Intro\" was released as the first track, === July 6, 2013: Summer Fling === \"Summer Fling\" was released as the second track of the two. The music video was directed by Smith and Mike Vargas who previously directed her single \"I Am Me\". The song has been loads of criticism for its mature tone, the use of the word \"fling\", and the fake English accent she tries to speak. === September 16, 2013 === Smith performed \"Summer Fling\" on the series premiere of The Queen Latifah Show. During the performance, she said: \"Just for clarity, the word fling means something that's short lived...And this song is dedicated to all the kids around the world whose summer is never long enough.\" === October 24, 2014: 3 === Smith and FADER announced that Smith would be releasing her first EP, titled \"3\", on October 31, 2014 for free via Google Play for limited time and November 10, 2014, but it was later pushed to November 17, 2014 via iTunes. === November 2014 === The same day, she held a concert in New York City at The FADER Fort, where she performed select tracks from her new EP with SZA. She also performed the song \"5\" with her brother, as well as \"Summer Fling\" and a new mix of her famous hit \"Whip My Hair\". === May 7, 2015: F Q-C #7 === Smith released the single \"F Q-C #7\" which was a major commercial failure, failing to get on any charts. An music video was released for the song the same day on Vevo. === September 2015 === After release, a video to the track \"Why Don't You Cry\" was released. === December 11, 2015: Ardipithecus === Willow released her first album Ardipithecus. About her debut's title album, Willow said \"Ardipithecus Ramidus Sahelanthropus tchadensis is the scientific name of the first hominid bones found on earth. I wanted to name my musical compilation after it because, while I was making these songs, I was in such a transitional state. Digging deep in the soil of my heart and finding bits and pieces of my ancient self that tell stories, which end up being the lyrics to the songs.\" === 2016 === Fashion Awards Smith won an award for New Fashion Icon. === December 7, 2016: Mellifluous === She self-released an only streaming album titled \"Mellifluous\" === December 11, 2016 === Her single \"Wait a minute\" taken from her album \"Mellifluous\" saw little success upon its release and which saw it's sales and streams go up to a million in the United States. === October 31, 2017: Birthday === On her birthday, October 31, 2017, she released her second studio album \"The 1st\" which is praised for its musical development, but mostly focusing Willow's ability to create music following her 1990s R&B; predecessors, apart from not having been lively during the time. === End of 2017 === She toured the album with Jhene Aiko alongside St. Beauty, Kodie Shane, and Kitty Cash. Along with her mother and grandmother, Adrienne Banfield-Norris, Smith hosts Red Table Talk, a web talk show for which she received a Daytime Emmy Award nomination. === June 24, 2019 === Smith announced her third studio album, Willow. === July 19, 2019: Willow === It was released and was co-produced by herself and Tyler Cole. The album includes a feature from her brother Jaden Smith which is the song \"U know\" anc was produced by Tyler Cole. === 2020: The Anxiety === Smith and Cole later released a collaborative album titled The Anxiety. === April 27, 2021: Transparent Soul === Smith released \"Transparent Soul\" featuring Travis Barker, a pop-punk song that was her first song into that genre. Willow described the song as having been written during a very introspective time at the beginning of the COVID-19 pandemic, and inspired by a quote from Hindu guru Radhanath Swami. Smith was also inspired to enter the genre by her mother, Jada Pinkett Smith, who previously was in nu metal band Wicked Wisdom in the early 2000s === July 16, 2021: Lately I Feel Everything === Smith released her fourth album Lately I Feel Everything, featuring guests artists including Tierra Whack, Avril Lavigne and Travis Barker.The album has two singles, \"Transparent Soul\" and \"Lipstick\" == References == ==Other websites== * Category:2000 births Category:Actors from Los Angeles Category:African- American actors Category:American child actors Category:American child singers Category:Singers from Los Angeles Category:Living people Category:African- American singers Category:American Jews Category:American contemporary R&B; singers Category:American dancers Category:American hip hop singers Category:American movie actors Category:American pop singers Category:American producers Category:American television actors Category:Bisexual people Category:Emmy Award winners Category:Jewish actors Category:LGBT African- Americans Category:LGBT actors Category:LGBT dancers Category:LGBT people from California Category:LGBT singers Category:Musicians from Los Angeles Category:Singer-songwriters from California",
 "title": "Willow Smith"
}