{
 "id": "433962",
 "text": "Bảo Đại (22 October 1913 – 30 July 1997) was the last king of Vietnam. He was the 13th and last king of the Nguyễn Dynasty. He was the leader of the country during World War II. Bảo Đại ruled as the King of Annam from 1926 to 1945. Japan briefly took control of Vietnam in 1945, and Bảo Đại was made Emperor of Vietnam but with little real power. France took back control of Vietnam in 1949 as the State of Vietnam. Bảo Đại served as Chief of State from then to 1955, but the French had the real power. == Early Life == Bảo Đại was born on 22 October 1913 and given the name of Prince Nguyễn Phúc Vĩnh Thụy in the Palace of Doan-Trang-Vien. He was sent to France to be educated. On 8 January 1926, he was made the emperor after his father's death and took the name Bảo Đại (Protector of Grandeur). == Independence and abdication == In 1940, during the WW2, Imperial Japan took over French Indochina. In 1945, the Japanese made Bảo Đại into declaring Vietnamese independence from France as a member of Japan's sphere of influence; the country then became the Empire of Vietnam. The Japanese surrendered to the Allies in August 1945, and the Viet Minh aimed to take power in Vietnam. Due to Hồ Chí Minh's popular political stand against the French and the 1945 famine, he was able to persuade Bảo Đại to abdicate and hand over power to the communists. == Return to Power == Bảo Đại was an advisor during the First Indochina War. During the war, he signed many treaties that made him very unpopular. After the First Indochina War, a peace deal was made to split Vietnam into two, with State of Vietnam receiving the South. Bảo Đại remained \"Head of State\" of South Vietnam but moved to Paris and appointed Ngô Đình Diệm as his prime minister. == Second Removal From Power == A rigged referendum made Ngô Đình Diệm the president of the new Republic of Vietnam, so Bảo Đại was removed from power. ==References== Category:History of Vietnam Category:Vietnamese nobility Category:Kings and queens Category:1913 births Category:1997 deaths",
 "title": "Bảo Đại"
}