{
 "id": "43405",
 "text": "A washing machine also know as a washer is a machine that washes dirty clothes. It contains a barrel into which the clothes are placed. This barrel is filled with water, and then rotated very quickly by the use of a motor to make the water remove dirt from the clothes. The user adds detergent (liquids or powders) to clean clothes more effectively. ==Operation== Washing machines have ways to control how the machine operates. Some of the possible controls are: * temperature of the water * timer of the wash cycle (before the soapy, dirty water is rinsed out) * number of wash cycles before completing == Types of washing machines == Washing machines may be fully automatic or partly automatic. === Semi-Automatic Washing Machines === Semi-automatic washing machines have separate sections for Dryer and Washer. These washing machines are often termed as semi-manual as here you have to manually put clothes into washer tub, put water & detergent according to your laundry size, and once washing is finished, you again have to manually put washed clothes for drying in dryer section. These are mostly cheaper machines. === Fully-Automatic Washing Machines === Fully-automatic washing machines are easier to use. They have only one section for washing and for spin-drying. Once you put clothes in a fully-automatic washing machine, it automatically takes required quantity of water, detergent and just with one click provided your washed & dry clothes. Washing machines may load from the top or the front. === Front loading === A front loading washing machine has a door in the front. The clothes to be washed have to be put in and the door closed before the barrel can fill with water. This type of machine can have a clothes drying machine stacked on top to save space on the floor. Because of the water used, the washing machine is heavier than the dryer so the washer is at the bottom. === Top loading === With a top loading washing machine, the opening is at the top. The barrel can be filled with water and soap before the clothes are put in for washing. This type of machine can not have anything placed on top of it because of the opening there. A top-loading washing machine is a type of washing machine where the opening is located at the top of the machine. This type of machine typically has a barrel or drum where clothes are placed for washing. The barrel can be filled with water and soap before the clothes are added, allowing the detergent to dissolve and mix with the water for optimal cleaning. One important limitation of top-loading washing machines is that nothing can be placed on top of the machine due to the location of the opening. This can be inconvenient for some users who may wish to use the top of the machine for storage or other purposes. However, some top-loading washing machines are designed with a flat top that can be used as a workspace or for placing items, such as laundry baskets or detergent containers, while the machine is not in use. Despite this limitation, top-loading washing machines remain a popular choice for many households due to their ease of use and affordability compared to other types of washing machines. They are also generally easier to repair and maintain, as their components are more easily accessible than those of front-loading machines. === Stacked washer and dryer === Sometimes a washing machine and a clothes dryer are put together. The washing machine is usually on the bottom of the stack because the water in it makes the machine heavier than the dryer. In this arrangement the washing machine may be front-loading or top-loading. For the top-loading washing machine, room must be left to open the door at the top to add the clothing to be washed. A front-loading washing machine can have the dryer sitting on top of it. ==References== Category:Home appliances",
 "title": "Washing machine"
}