{
 "id": "434083",
 "text": "State of Vietnam was a former autonomous state controlled by France. It was established in 1949. It was an associated state and a constituent territory of the French Indochina until 1954. From 1954, it became fully independent from France since this country lost the First Indochina War. It was replaced by Republic of Vietnam in 1955. It proclaimed its sovereignty over all of Vietnam's territories, but in fact, it only controlled small parts of its proclaimed territories. Most of its territories was controlled by Viet Minh and Democratic Republic of Vietnam. Only French-occupied territories in Vietnam was controlled by the State of Vietnam. From 1954, the 1954 Geneva Accords divided Vietnam into two countries: North Vietnam and State of Vietnam. North Vietnam's territory is from Quang Binh Province to the North. The State of Vietnam's territory is from Quang Tri Province to the South. Its area was 173,809 km2 from 1954. ==History== State of Vietnam was established in 1949. It was preceded by the Provisional Central Government of Vietnam. It was established in 1948. In 1950, it was recognised by France, United Kingdom and United States with the capital of Saigon and the chief of state of Bao Dai. In 1954, France lost the First Indochina War. That led to the 1954 Geneva Accords. It divided Vietnam into two countries. State of Vietnam and France gathered their troops in Southern Vietnam. On 26 October, it was replaced by Republic of Vietnam. ==Military== Following the signing of the 1949 Élysée Accords in Paris, Bao Dai was able to create a National Army for defense purposes. It fought under the State of Vietnam's banner and leadership and was commanded by General Nguyen Van Hinh. ==Related pages== * Empire of Vietnam * Republic of Vietnam ==References== Category:1949 establishments in Asia Category:1955 disestablishments Category:1950s disestablishments in Asia Category:20th century in France Category:20th century in Vietnam Category:Former countries in Asia Category:States and territories established in the 1940s Category:States and territories disestablished in the 20th century",
 "title": "State of Vietnam"
}