{
 "id": "434219",
 "text": "Jonás Joaquín Ortiz Alberto (born in 1989), is better known by his stage name Black Point (sometimes El Negro or Black Jonas Point). He is a Dominican rapper, songwriter and producer. Ortiz, along with Del Patio and Pitbull, wrote and performed the song \"Watagatapitusberry\". This song reached number 30 in the US Billboard Latin Songs chart and number 13 in the US Billboard Tropical Songs chart. ==Biography== Black Point was born in Santo Domingo, in the Dominican Republic. He was only 8 when he started to get interested in hip hop music and start writing rap songs. His manager, Big W One, was the person that produced and record his debut song of rap on the 2000. On 2008 Black Point arrives to the Dominican Republic's radio stations gaining so much fame with themes like \"Mi mujer no era mala\", \"Amigo\" and the famous collaboration of hip hop Dominican culture, \"Capea El Dough: All Stars\". ==Discography== ===Singles=== Title Year Tu Siempre Dices 2008 Mi Mujer No Era Mala 2008 Te Lo Agradezco 2008 Fumao Y Loco 2009 Dominicano Soy 2009 Flore' Para Los Muertos 2009 Yo Soy Tu Hombre feat. L.R. \"La Fucking Ley and T.y.S & Alex B 2009 Capea El Doug All Star all stars 2009 Tengo Dinero 2009 Corremo' el Bloque Ft Ñengo Flow 2010 Mi Coro 2010 Pla, Pla, Pla 2010 Cuídate 2010 Obsesión 2010 Juicio Final 2010 Topalo y Siéntelo Y Escupelo 2010 Chuponsito 2010 Watagatapitusberry 2010 Que Buena Tu Ta' Ft Fuego and all stars 2010 Cuídate Del Jolopero 2010 Hooky Party feat. Sensato Del Patio 2010 Tikita Tikita Tikita 2010 Problema Y Mujeres 2010 El Capo 2011 Disparate 2011 El Calentón 2011 Todo Acabó, Tiro por la Culata 2011 Me Quiere O No Me Quiere? 2011 Yo Tengo Sed 2011 Escucho Voces 2011 Te Deculate' 2011 Ustedes No Son De Na 2011 Ando buscándote ft Teno el Melodico 2012 Vejigazo 2012 Me Kitpreee 2012 Lo Que Quieras 2012 Solo grita 2012 Señor yo te doy gracias 2012 Seguimos Juntos Ft Nico 2012 Sexy 2013 Cromo X - Te Quiero Amar (Remix) 2013 Déjame Entrar Ft Randy, De La Ghetto and Secreto El Biberon 2013 Te Enseñe A Querer 2013 La Para de tu Coro Ft Daddy Yankee, Cromo X, Jacool, Mozart La Para & Secreto El Biberon 2013 Se Valiente 2013 Carro En Movimiento 2013 Tu Si Pelea 2013 Prendi 2014 Tu Sabe Que No 2014 == References == == Other websites == * * Black Point discography at MusicBrainz * Category:1989 births Category:Living people Category:Dominican Republic musicians Category:Rappers Category:Dominican Republic writers",
 "title": "Black Point"
}