{
 "id": "434477",
 "text": "William Frank Buckley, Jr.\"William Francis\" in the editorial obituary \"Up From Liberalism\" The Wall Street Journal February 28, 2008, p. A16; Martin, Douglas, \"William F. Buckley Jr., 82, Dies; Sesquipedalian Spark of Right\", obituary, New York Times, February 28, 2008, which reported that his parents preferred \"Frank\", which would make him a \"Jr.\", but at his christening, the priest \"insisted on a saint's name, so Francis was chosen. When the younger William Buckley was 5, he asked to change his middle name to Frank and his parents agreed. At that point, he became William F. Buckley Jr. .\" (November 24, 1925 – February 27, 2008) was an American conservative authorItalie, Hillel via Associated Press. \"Conservative Author Buckley Dead at 82\" San Francisco Chronicle, February 27, 2008. Accessed January 18, 2009. and commentator. He founded the political magazine National Review in 1955, which had a big impact on the American conservative movement. He supported Barry M. Goldwater and Ronald Reagan. == Career == He hosted 1,429 episodes of the television show Firing Line from 1966 until 1999, where he became known for his transatlantic accent and wide vocabulary.The Wall Street Journal February 28, 2008, p. A16 He also wrote a nationally syndicated newspaper column, and wrote many spy novels.For complete, searchable texts see Buckley Online . == Personal life == Buckley was born November 24, 1925, in New York City. He was of Irish descent. As a child he lived in Mexico and learned Spanish. He studied in France and England and learned their languages. In 1950, Buckley married Patricia Buckley. They had a son, Christopher. Buckley died at his home in Stamford, Connecticut, on February 27, 2008. Initially, it was reported that he was found dead at his desk in his study, a converted garage. At the time of his death, he had been suffering from emphysema and diabetes. His cause of death was soon ruled as emphysema. ==References== ==Other websites== * * Buckley Online , a complete guide to the writings William F. Buckley at Hillsdale College * William F. Buckley at Library of Congress Authorities — with 109 catalog records Category:1925 births Category:2008 deaths Category:Deaths from emphysema Category:Republicans (United States) Category:Writers from New York City Category:Conservatism",
 "title": "William F. Buckley Jr."
}