{
 "id": "434585",
 "text": "Southern Lebanon is the most southern of the four regions in Lebanon. It includes the governorates of Nabatieh and South Lebanon. Southern Lebanon is the Lebanese border region to Israel. == Geography == Southern Lebanon goes from the Awwali River in the north to the Lebanese-Israeli border in the south. It has a coast in the west and hilly and mountainous areas inland. The height of the land varies from 100 to 1000 meters. The Litani River flows through this region. === Administrative Division === Southern Lebanon includes two of the eight governorates in Lebanon: Nabatieh and South Lebanon. In the east, Nabatieh has a population of 276,285 (2023) and is divided into four districts: Bent Jbeil, Hasbaya, Marjaayoun, and Nabatieh. In the west, South Lebanon has a population of 718,765 (2016) and is divided into three districts: Jezzine, Saida, and Tyr. ==== Major cities in Southern Lebanon ==== * Nabatieh City * Jezzine * Sidon (Saida) * Tyr == Demographics == === Religion === The population of Southern Lebanon is mostly Shiite. There are also smaller groups of Maronites and Sunnis. === Syrian Refugees === Lebanon currently hosts an estimated 1.5 million Syrian refugees. 104.627 of them currently live in South Lebanon and another 65.718 reside in Nabatieh (2022). == History == Until World War I, Southern Lebanon was part of the Ottoman Empire. In 1920, at the San Remo conference, France got control over what became Syria and Lebanon, including Southern Lebanon. In 1948, after Israel was created and the Arab-Israeli war happened. Southern Lebanon became the border region to Israel. More than 100,000 Palestinian refugees came to Lebanon after the 1948 war. In September 1970, the Jordanian government expelled the Palestinian Liberation Organization (PLO). The PLO then moved to Southern Lebanon. Yasser Arafat, the leader of the PLO, used Southern Lebanon to launch attacks into Israel. At that time, Southern Lebanon was a rural and undeveloped area. The Lebanese government had left the area, and local militias took control. The Lebanese Army had left in 1968, and the last local elections were in 1963. === Good Fence Policy === Since Israel was established, Israeli officials wanted to partner with the Christian population in Southern Lebanon. They hoped to help create a Christian state in Lebanon that would be a friend to Israel. In 1975, Israel started the Good Fence Policy. Gates were set up along the Lebanese-Israeli border so friendly people in Southern Lebanon could get medical care and other supplies. At the same time, Israel made alliances with the Maronite groups of fighters in Southern Lebanon, exchanging information for weapons. === Operation Litani === In March 1978, Israeli Prime Minister Menachem Begin started Operation Litani in response to PLO attacks. He sent Israeli troops into Southern Lebanon. There were an estimated 1,100-2,000 Lebanese and Palestinian victims and 20 Israeli victims. Additionally, 100,000-250,000 Lebanese people had to leave their homes. In March 1978, the United Nations decided on Resolutions 425 and 426, They created the United Nations Interim Force in Lebanon (UNIFIL). UNIFIL was to have 6,000 troops, last for eight months, and aim to restore security and peace. They wanted Israeli forces to leave give control back to the Lebanese government. However, neither the Israeli troops nor the local groups of fighters liked the UNIFIL forces. When it was time for Israel to withdraw, they handed the border region to the South Lebanon Army (SLA) led by Major Sa'ad Haddad instead of UNIFIL. Haddad made and controlled a security zone for Israel and created the (unrecognized) Free and Independent Lebanese State. === 1982 Israeli Invasion === UNIFIL was did not manage to provide security and return authority to the Lebanese government. However, from 1981 to 1982, there was a weak ceasefire. United States President Jimmy Carter wanted Israel to leave Southern Lebanon. In 1982, someone tried to kill the Israeli ambassador to the United Kingdom. Israel thought that was a violation of the ceasefire by the PLO. Israel then invaded Southern Lebanon again, in an operation called Operation Peace for Galilee. Israeli Defense Minister Ariel Sharon led the forces. He wanted to drive the PLO 40 kilometers inland to stop them from firing rockets at Israel. This led to a siege of Beirut and conflicts with Syrian troops in Lebanon. === Israeli Occupation of Southern Lebanon === 1983, Israel and the Lebanese government signed a peace agreement, but local groups of fighters in Southern Lebanon, especially the Druze and Shia groups, did not accept it. Despite the ongoing conflict, at the Naquara talks in 1985, Israel did not want to give control of the region and security zone to UNIFIL. Instead, Israel wanted the South Lebanon Army (SLA) to keep control. This was not acceptable to the Lebanese government, which wanted Israel to withdraw completely and return control to them. A small number of Israeli soldiers stayed in Southern Lebanon until March 2000, when the Israeli government decided to withdraw. The Israeli also did not like the occupation because Israeli soldiers died in Hezbollah attacks. They also thought keeping the security zone cost a lot of money. The SLA also lost morale and eventually collapsed on May 24, 2000. === Blue Line === The ongoing conflict since 1978 made the Israeli-Lebanese border unclear. UNIFIL had to check if Israel had left South Lebanon because of Resolution 425. This was hard to do without a clear border. Miklos Pinther, the UN's chief cartographer, was asked to set this border. Due to lack of old records, he and his team decided on a practical line close to the original mandate border. This line, called the Blue Line, is not an official border by international law. It acts as a de facto border. == Hezbollah in Southern Lebanon == Hezbollah was formed in 1982 during the Israeli occupation of Southern Lebanon. At that time, the Shiite community in Lebanon was powerless and poor, which became worse due to the Palestinian-Israeli conflict. A split in Amal, the main Shia party in Lebanon, led to the creation of Islamic Amal, which helped start Hezbollah. This new group joined with others, like the Association of the Ulama of Jabal Amil, to fight the Israeli occupation. After the assassination of Sayyid Abbas Musawi in 1992, Hassan Nasrallah became the leader of Hezbollah. The group's ideas are based on the teachings of Ayatollah Ruhollah Khomeini and the concept of Velayat-e Faqih, which supports rule by Islamic clerics. ==References== Category:Geography of Lebanon",
 "title": "Southern Lebanon"
}