{
 "id": "434566",
 "text": "Artemisia Gentileschi (July 8, 1593 – c. 1656) was an Italian Baroque painter. Gentileschi was born in Rome in 1593. This was at the start of Baroque painting. She was the first child of the Tuscan painter Orazio Gentileschi. Artemisia trained in his workshop for a number of years before making works herself. She was influenced by the painter Caravaggio. Gentileschi's first signed and dated painting was Susanna and the Elders. It was dated 1610, which was when she was 17. In 1616, Gentileschi became the first woman member of the Accademia del Disegno (the Florentine Academy of Art). Her most well-known painting is Judith Beheading Holofernes. Gentileschi moved to Naples in 1630 and visited London, England in 1639. Gentileschi died in Naples, but the exact date is unknown. It was some time after 1654. ==Legacy== Gentileschi was not included in the history of 17th-century art after her death. Many of her paintings were thought to have been made by her father or students of Caravaggio. Scholars started paying attention to her work in the early 1900's. In the 1970s she became a champion of second wave feminist art historians. Artist Judy Chicago included a place setting for Gentileschi in the 1979 art installation The Dinner Party. In 2020, the National Gallery, London held a retrospective of Gentileschi's work entitled Artemisia. Gentileschi's work is in museums including the Museo del Prado in Madrid, the Metropolitan Museum of Art in New York City, the Uffizi in Florence, Italy, and the National Gallery, London. ==Gallery== File:Susanna and the Elders (1610), Artemisia Gentileschi.jpg|Susanna and the Elders, 1610 File:Artemisia Gentileschi Selfportrait Martyr.jpg|self-portrait, around 1615 File:Gentileschi judith1.jpg|Judith and her Maidservant, between 1618 and 1619 File:Artemisia Gentileschi - Giuditta decapita Oloferne - Google Art Project- Adjust.jpg|Judith Beheading Holofernes around 1620 ==Related pages== * List of Italian painters ==References== ==Other websites== * *Artemisia Gentileschi: \"The Spirit of Caesar in the soul of a woman!\" video by the National Gallery Category:1593 births Category:1656 deaths Category:17th- century Italian painters Category:16th-century Italian painters Category:People from Rome",
 "title": "Artemisia Gentileschi"
}