{
 "id": "434829",
 "text": "Abu Nidal () (May 1937 – 16 August 2002), born Sabri Khalil al-Banna (), was the founder of Fatah – The Revolutionary Council (), a militant Palestinian separatist group also known as the Abu Nidal Organization (ANO).Melman 1986, p. 213. The Guardian said that he was born in 1939; The Times said 1940; the Truman Institute of the Hebrew University of Jerusalem gave his birth year as 1934. Issam Sartawi told Yossi Melman it was 1936. Melman says it was 1937. * There is also disagreement about his name. The Daily Telegraph has written that he was Hasan Sabri al-Banna; the Middle East International has said he was Muhammad Sabri al-Banna. Stewart Steven says in his writing about the Mossad, that he was Sabri Khalil al-Banna or Mazan Sabri al-Banna. The name Khalil comes from his father; it is an Arab tradition that the father's name be added to the son's name. Al-Banna means \"the mason\" (Melman 1986, pp. 44–45). He was also known as Amin al-Sirr and Sabri Khalil Abd Al Qadir. At the height of his power in the 1970s and 1980s, Abu Nidal was mostly known as the most merciless of the Palestinian political leaders.See, for example: * MacAskill, Ewen and Nelsson, Richard. \"Mystery death of Abu Nidal, once the world's most wanted terrorist\", The Guardian, 20 August 2002. * Melman, Yossi. The Master Terrorist: The True Story Behind Abu Nidal, Mama Books, 1986, p. 4. * McLaughlin, Abraham. \"A matter of ethics for cloak-and-dagger set\", The Christian Science Monitor, 5 October 2001. * \"Abu Nidal Organization\", Council on Foreign Relations, October 2005. * , Council of the European Union, 21 December 2005. He told Der Spiegel in a rare interview in 1985: \"I am the evil spirit which moves around only at night causing ... nightmares.\"Melman 1986, p. 3. ==References== Category:1937 births Category:2002 deaths Category:Islamist insurgents Category:Palestinian Muslims Category:Palestinian nationalists Category:Palestinian militants Category:People from Tel Aviv Category:Cairo University alumni",
 "title": "Abu Nidal"
}