{
 "id": "435039",
 "text": "Movable Ink is a technology company that allows marketers to change emails after they have been sent out. The technology can change emails based on the moment of engagement, the user's current location, social cues, fast-moving inventory, and it works across all email clients. Leena Rao (10 November 2011). “Movable Ink Launches Service To Stream Live Content In Emails”. TechCrunch. Movable Ink has been called \"The Harry Potter of Email\" because it includes parts of code into an email's HTML that makes the content come to life and update in real-time. Alyson Shontell (12 October 2013). \"Movable Ink, A Startup That Magically Updates Content In Sent Emails, Just Raised $1.3 Million\". Business Insider. == Overview == Movable Ink's technology allows email marketers to pull real-time content from their websites and embed that information into emails. When recipients open the emails, they contain the most up-to-date information as well as contextual data based on a person’s location, time of day, or the device they’re viewing the email on.Ryan Kim (9 September 2011). “Movable Ink breathes life into e-mail” . GigaOm. The company also offers advanced email tracking reports and real-time metrics.Joann Pann (2 August 2013). “10 Email Extras You Should Be Using for Increased Productivity”. Mashable. Companies using Movable Ink include Nordstrom, Bloomingdale's, American Eagle Outfitters and Verizon,Mike Marshall (7 August 2012). “Michael Nutt of Movable Ink is helping make e-mail more current”. The Huntsville Times. Movable Ink was founded by Vivek Sharma and Michael Nutt in New York City in November 2010.Alyson Shontell (7 June 2011). “The 25 Hot New York City Startups You Need To Watch”. Business Insider. == Funding == In October 2011, Movable Ink received $1.3 million dollars in funding, led by Contour Ventures, Metamorphic Ventures, ff Ventures, and Kima Ventures, as well as angels Joshua Baer, Bob Pittman, Andy Russell, and Alan Laifer.Alyson Shontell (13 October 2011). “Movable Ink, A Startup That Magically Updates Content In Sent Emails, Just Raised $1.3 Million” . Business Insider. In May 2013, Movable Ink received $11 million in funding led by Intel Capital, with participation from its previous investors. Colleen Taylor (8 May 2013). “Movable Ink Gets $11 Million Series B Led By Intel Capital For Real-Time Email Marketing Tech”. TechCrunch. == References == Category:American technology companies Category:2010 establishments in the United States Category:Companies based in New York City",
 "title": "Movable Ink"
}