{
 "id": "435133",
 "text": "Jean-Pierre Thiollet (born 9 December 1956 in Poitiers) is a French author and journalist. In 2017, he creates the Cercle InterHallier, in tribute to Jean- Edern Hallier.La Lettre A, 21 February 2017, https://www.lalettrea.fr/medias_groupes/2017/02/21/thiollet-loue-edern- hallier,108212725-brl In October 2016, after dedicating a book about Jean- Edern Hallier to \"the youth native from Euroland, zone F, victim of an old criminal political ruling class\", he denounces in an interview \"the French crime, committed by a political class, from the left as from the right\". From 2009 to 2012, he worked as one of the France-Soir editors-in- chief.http://www.liberation.fr/medias/2012/12/04/france-soir-le-mystere-de-la- chambre-noire_865115, \"France-Soir : le mystère de la chambre noire\", Libération, Isabelle Hanne, 4 December 2012 In 2010, he was among the petition's signatures for Roman Polanski when the film director was temporarily arrested by Swiss police at the request of U.S authorities. Since 2007, he has been a member of the World Grand Family of Lebanon (RJ Lebanon Club). He was, with Alain Decaux, Frédéric Beigbeder and Richard Millet, one of the guest writers at the 2005 Beirut Book Fair (BIEL) for Je m'appelle Byblos (My Name Is Byblos). In 1994, he was the author allowed to interview Gérard Mulliez, one of the wealthiest and powerful people in France, for the book The Customer Driven Company — Moving from Talk to Action (translated in French as La Dynamique du client) by Richard C. Whiteley. From 1988 to 1994, he was editor-in-chief for Le Quotidien de Paris (Daily Press Group).European Biographical Directory, R.H. Neirijnck ed., Bruges, Belgium ; http://www.lanouvellerepublique.fr/France- Monde/Actualite/24-Heures/n/Contenus/Articles/2014/06/30/Thiollet-1967309 == Bibliography == * Hallier, chagrins d'amour, with text by François Roboth, Neva Editions, 2024. * Hallier, tout feu tout flamme, with text by François Roboth, Neva Editions, 2023. * Hallier en roue libre, with texts by François Roboth, Neva Editions, 2022. * Hallier, L'Edernel retour, with texts by François Roboth, Neva Editions, 2021. * Hallier, L'Homme debout, with texts by François Roboth, Neva Editions, 2020. * Hallier Edernellement vôtre, with texts by Isabelle Coutant-Peyre and François Roboth, Neva Editions, 2019. * Hallier ou l'Edernité en marche, with text by François Roboth, Neva Editions, 2018. * Improvisation so piano, Neva Editions, 2017. * Hallier, l'Edernel jeune homme, Neva Editions, 2016. * 88 notes pour piano solo, Neva Editions, 2015. * Piano ma non solo, Anagramme Editions, Paris, 2012.shown at Fouquet's Barrière Hôtel in Paris, 4 April 2012 * Bodream ou rêve de Bodrum, Anagramme Ed., Paris, 2010. * Carré d'Art : Barbey d'Aurevilly, Lord Byron, Salvador Dalí, Jean-Edern Hallier, with texts by Anne-Elisabeth Blateau and François Roboth, Anagramme Ed., Paris, 2008. Art Institute of Chicago, http://ryerson.artic.edu/search~S1?/tCarr{u00E9}+d%27art/tcarre+dart/1%2C6%2C6%2CB/frameset&FF;=tcarre+dart+barbey+daurevilly+byron+dali+hallier&1%2C1%2C/indexsort=- * Les Risques du manager, with A. Kibarian, Vuibert Ed., Paris, 2008. * Barbey d'Aurevilly, with texts by Eugen Drewermann, Jean-Louis Christ and Bruno Bontempelli, H & D, 2006 (ISBN 2-914266-06-5) and 2007 (ISBN 2-914266-08-1). With CDRom. * Je m'appelle Byblos, foreword by Guy Gay-Para, H & D, 2005. * Sax, Mule & Co, H & D, 2004. * Foreword to Willy, Colette et moi by Sylvain Bonmariage, Anagramme Ed., 2004 (reprint). * Demain 2021 — Jean-Claude Martinez (book-length interview), G. de Bouillon, 2004. * Les Dessous d'une Présidence, Anagramme Ed., 2002. * Beau linge et argent sale - Fraude fiscale internationale et blanchiment des capitaux (Tax Avoidance, Tax Evasion and Money Laundering), Anagramme Ed., 2002, ). * Vitamines & Minéraux, Anagramme Ed., 2001. * Les baux sans peine (The leases without penalty), Axiome Ed., 1999. * La Vie plurielle (Conjugal life. Types of union in the new legislative arena : information for all on their advantages and disadvantages), Axiome Ed., 1999. * La Pensée unique, collective work (with Jean Foyer), Economica/J. M. Chardon & D. Lensel Ed., 1998. * Le Chevallier à découvert, Laurens Ed., 1998. Library of Congress http://catalog.loc.gov/cgi- bin/Pwebrecon.cgi?DB=local&Search;_Arg=thiollet+chevallier&Search;_Code=GKEY%5E*&CNT;=100&hist;=1&type;=quick * Euro-CV, Top Ed., 1997. * L'Anti-Crise, with M-F Guignard, Dunod, 1994. * Os très primeiros meses num novo emprego, with M-F Guignard, transl. Maria Mello, Biblioteca do desenvolivemento pessoal, Publicações Europa-América, Mem Martins, 1993. (Réussir ses trois premiers mois dans un nouveau poste, Nathan, Paris, 1992. )Portugal National Library, http://catalogo.bnportugal.pt/ipac20/ipac.jsp?session=1F3B8770624M6.269109&profile;=bn&uri;=link=3100018~!118019~!3100024~!3100022&aspect;=basic_search&menu;=search&ri;=7&source;=~!bnp&term;=Thiollet%2C+Jean- Pierre&index;=AUTHOR * Utrillo, collective work, F. Birr Ed., 1982. ==References== Category:1956 births Category:Living people Category:French journalists Category:Writers from Nouvelle-Aquitaine Category:People from Poitiers Category:People from Vienne",
 "title": "Jean-Pierre Thiollet"
}