{
 "id": "43528",
 "text": "Peter Cushing, OBE (26 May 1913 – 11 August 1994) was an English actor. He is best known for his roles in horror movies and Star Wars Episode IV: A New Hope. == Career == Born Peter Wilton Cushing in London, England. His movie career began in 1939 in a small role in The Man in the Iron Mask (1939), followed by Laddie (1940). He played a character called Osric in a movie version of William Shakespeare’s play Hamlet (1948), with Laurence Olivier. His most famous roles were Victor Frankenstein, in the British horror movie The Curse of Frankenstein (1957), by Terence Fisher. Victor creates a monster in the attic of his castle. His other famous role was that of Doctor Van Helsing in Dracula (1958), in this movie he must fight Dracula. In these two movies he was accompanied by another famous actor Christopher Lee. They formed a very successful duo, starring in dozens of Hammer movies as The Hound of the Baskervilles (1959), The Mummy (1959), The Gorgon (1964), Dr. Terror's House of Horrors (1965). They clashed again as Van Helsing and Dracula, in Dracula A.D. 1972 (1972), and The Satanic Rites of Dracula (1974). Also re-interpret the character of Baron Frankenstein, in The Revenge of Frankenstein (1958), The Evil of Frankenstein (1964), by Freddie Francis, Frankenstein Created Woman (1967), Frankenstein Must Be Destroyed (1969), and Frankenstein and the Monster from Hell (1974), directed by Terence Fisher. Peter Cushing also teamed with Vincent Price in movies including Scream and Scream Again (1970), Dr. Phibes Rises Again (1972), Madhouse (1974), which plays an evil agent movie., and House of the Long Shadows (1983). In 1977 he obtained the role of Grand Moff Tarkin, in Star Wars by George Lucas. In the last years of his career had appearances in some comedies Top Secret! (1984). His last job was in 1986 in the movie Biggles (1986). In 1982 he was diagnosed with prostate cancer. He died of the disease in 1994. == Television == Cushing also made television, in mystery series, including Sherlock Holmes (1968), as Sherlock Holmes, The Avengers, Great Mysteries, Space: 1999, The New Avengers, Hammer House of Horror, and the TV movies The Masks of Death (1984), as Sherlock Holmes == Filmography == Movies Year Títle Role Note 1939 The Man in the Iron Mask Second Officer 1940 Laddie Robert Pryor 1940 A Chump at Oxford Student (Jones) 1940 Vigil in the Night Joe Shand 1940 The Hidden Master (short) Robert Clive 1940 Women in War Capt. Evans (uncredited) 1940 The Howards of Virginia Leslie Stephens (uncredited) 1941 They Dare Not Love Sub-Lieutenant Blackler (uncredited) 1948 Hamlet Osric 1952 Moulin Rouge Marcel de la Voisier 1954 The Black Knight The Black Knight 1955 The End of the Affair Henry Miles 1955 Magic Fire Otto Wesendonk 1956 Alexander the Great General Memnon 1957 Time Without Pity Jeremy Clayton 1957 The Curse of Frankenstein Victor Frankenstein 1957 The Abominable Snowman Dr. John Rollason 1958 Violent Playground Father Laidlaw 1958 Dracula Van Helsing 1958 The Revenge of Frankenstein Doctor Victor Stein 1959 The Hound of the Baskervilles Sherlock Holmes 1959 John Paul Jones Captain Richard Pearson 1959 The Mummy John Banning 1960 Manía Dr. Robert Knox 1960 Cone of Silence Capt. Clive Judd 1960 The Brides of Dracula Dr. J. Van Helsing 1960 Suspect Capt. Clive Judd 1960 Sword of Sherwood Forest Sheriff of Nottingham 1961 The Hellfire Club Merryweathe 1961 Fury at Smugglers' Bay Squire Trevenyan 1961 The Naked Edge Mr. Evan Wrack 1962 Cash on Demand Fordyce 1963 The Man Who Finally Died Dr. Peter von Brecht 1964 The Evil of Frankenstein Baron Frankenstein 1964 The Gorgon Dr. Namaroff 1965 Dr. Terror's House of Horrors Dr. Terror 1965 She Holly 1965 The Skull Dr. Christopher Maitland 1965 Dr. Who and the Daleks Dr. Who 1966 Island of Terror Dr. Brian Stanley 1966 Daleks' Invasion Earth: 2150 A.D. Dr. Who 1967 Some May Live John Meredith 1967 Frankenstein Created Woman Baron Frankenstein 1967 Night of the Big Heat Dr. Vernon Stone 1967 Torture Garden Lancelot Canning 1968 The Blood Beast Terror Detective Inspector Quennell 1968 Corruption Sir John Rowan 1969 Frankenstein Must Be Destroyed Baron Frankenstein 1970 Scream and Scream Again Major Heinrich Benedek 1970 One More Time Dr. Frankenstein (uncredited) 1970 The Vampire Lovers General von Spielsdorf 1971 The House That Dripped Blood Philip Grayson 1971 Twins of Evil Gustav Weil 1971 I, Monster Frederick Utterson 1972 Incense for the Damned Dr. Walter Goodrich 1972 Tales from the Crypt Arthur Edward Grimsdyke 1972 Dracula A.D. 1972 Professor Van Helsing 1972 Fear in the Night The Headmaster/Michael Carmichael 1972 Dr. Phibes Rises Again Captain 1972 Asylum Mr. Smith 1972 Horror Express Dr. Wells 1973 Nothing But the Night Sir Mark Ashley 1973 The Creeping Flesh Emmanuel Hildern 1973 And Now the Screaming Starts! Dr. Pope 1973 The Satanic Rites of Dracula Prof. Van Helsing 1974 From Beyond the Grave The Proprietor 1974 Madhouse Herbert Flay 1974 The Beast Must Die Dr. Christopher Lundgren 1974 Frankenstein and the Monster from Hell Baron Victor Frankenstein 1974 The Legend of the 7 Golden Vampires Professor Laurence Van Helsing 1974 Tendre Dracula MacGregor 1975 The Ghoul Dr. Lawrence 1975 Legend of the Werewolf Prof. Paul 1975 Shatter Paul Rattwood 1976 Trial by Combat Sir Edward Gifford 1976 At the Earth's Core Dr. Abner Perry 1976 The Devil's Men Baron Corofax 1977 Star Wars Grand Moff Tarkin 1977 Shock Waves SS Commander 1977 The Uncanny Wilbur Gray 1977 Die Standarte Baron von Hackenberg 1978 Son of Hitler Heinrich Haussner 1979 A Touch of the Sun Commissioner Potts 1979 Arabian Adventure Wazir Al Wuzara 1981 Mystery on Monster William T. Kolderup 1981 Black jack Sir Thomas Bedford 1983 House of the Long Shadows Sebastian Grisbane 1984 Top Secret! Bookstore Proprietor 1984 Sword of the Valiant: The Legend of Sir Gawain and the Green Knight Seneschal / Gaspar 1986 Biggles Colonel William Raymond == References == * * * * Overview of Peter Cushing as Sherlock Holmes at Baker Street Dozen. * Literature on Peter Cushing * Peter Cushing Association Category:1913 births Category:1994 deaths Category:Actors from Surrey Category:Cancer deaths in England Category:Deaths from prostate cancer Category:English movie actors Category:English stage actors Category:English television actors",
 "title": "Peter Cushing"
}