{
 "id": "435381",
 "text": "Oberlin College is a private liberal arts college in Oberlin, Ohio. It was the first college in the United States to accept African-American students as well as female students. It is also known for the Oberlin Conservatory of Music. Oberlin is a member of the Great Lakes Colleges Association and the Five Colleges of Ohio consortium. == History == Oberlin College and the town of Oberlin were started together in 1833.James Harris Fairchild, Oberlin: The Colony and the College, 1833-1883 (Oberlin, OH: E.J. Goodrich, 1883), p. 9 In 1837, the college began a program of coeducation; admitting female students.College Access & Opportunity Guide (Bethesda, MD: Center for Student Opportunity, 2010), p. 322 In 1835, the college began a policy of interracial education. The Board of Trustees voted to allow black students at a time when there was only one black person living in the county.James Harris Fairchild, Oberlin: The Colony and the College, 1833-1883 (Oberlin, OH: E.J. Goodrich, 1883), pp. 64–65 The first black student was a former slave, James Bradley from Cincinnati. The first building was Tappan Hall, named for Arthur Tappan of New York City. It was both a dormitory and classroom.Geoffrey Blodgett, Oberlin Architecture, College and Town: A Guide to Its Social History (Oberlin College: Kent State University Press, 1985), p. 2 In 1903 Memorial Arch was constructed. It was to honor those from Oberlin college who were killed in the Boxer Rebellion in China. ==Conservatory of Music== In 1865, Oberlin started its music program.Carole J Everett; Peterson's, College Guide for Performing Arts Majors (Lawrenceville, NJ: Peterson's, 2009), p. 251 A music conservatory is on the college campus. Students benefit from over 500 performances yearly, most free of charge, with concerts and recitals almost daily. The Conservatory was one of the recipients of the 2009 National Medal of Arts. ==Allen Memorial Art Museum== The Allen Memorial Art Museum is on the college campus. It holds an art collection showing the history of Art that has 12,000 pieces.Sarah S. Brophy; Elizabeth Wylie, The Green Museum: A Primer on Environmental Practice (Lanham: AltaMira Press, 2008), p. 23 It also has a unique art rental program. At the beginning of every semester, students camp out in front of the north gate to get first pick of artwork by artists including Renoir, Dalí, and Picasso.Angell, Sue (September 26, 2005). \"Art Rental Still Going Strong After 60 Years\". Oberlin Online: News and Features. (web link: Oberlin.edu ) ==References== Category:Colleges and universities in Ohio Category:1833 establishments in Ohio",
 "title": "Oberlin College"
}