{
 "id": "435524",
 "text": "Carmen Salinas Lozano (October 5, 1939 – December 9, 2021) was a Mexican actress, impressionist, comedian, politician and theatre entrepreneur. She was thought to be one of the first actress' in Mexico. She has appeared in over 100 movies. She was known for her roles in María Mercedes, Hombre en llamas, La rose de Guadalupe, La familia P. Luche, Mujeres Asesinas 2, and in Parodiando. Salinas is known for her movie role in Abrázame muy fuerte. Salinas was born on October 5, 1939 in Torreón, Coahuila, Mexico. == Political and legislative career == In an interview conducted with El Universal in March 2015, Salinas declared that she \"had been a priísta ever since [she] had the use of reason\". In 2015, the PRI placed Salinas on its proportional representation list for election from the fourth electoral region, winning her a seat in the Chamber of Deputies for the LXIII Legislature of the Mexican Congress; Salinas served on the Gender Equality, Radio and Television, and Health Commissions. Salinas, who only completed primary school, had the lowest educational level of all the deputies in the legislature. ==Death== Salinas had a cerebral hemorrhage caused by hypertension on November 11, 2021 in Mexico City and was hospitalized while in a coma. She died a month later on December 9, 2021 at the age of 82. ==Awards and nominations== Year Award Category Telenovela Result 1993 TVyNovelas Awards Best Co-star Actress María Mercedes 1996 TVyNovelas Awards Best Co-star Actress María la del Barrio 1999 TVyNovelas Awards Best Co-star Actress Preciosa 2001 TVyNovelas Awards Best Co-star Actress Abrázame Muy Fuerte rowspan=2 2002 TVyNovelas Awards Best Co- star Actress Entre el Amor y el Odio 2002 TVyNovelas Awards Special Award for Artistic Career Special Award for Artistic Career rowspan=2 2003 TVyNovelas Awards Special Award: 50 Years as Actress Special Award: 50 Years as Actress 2010 TVyNovelas Awards Best First Actress Hasta que el dinero nos separe rowspan=2 2012 TVyNovelas Awards Best First Actress Triunfo del amor 2013 TVyNovelas Awards Special Lifetime Achievement Award Special Lifetime Achievement Award rowspan=2 2008 Premios Diosas de Plata Female in a Minor Role La misma luna == References == ==Other websites== * * Biografía de Carmen Salinas Category:1939 births Category:2021 deaths Category:Mexican politicians Category:Mexican movie actors Category:Mexican television actors Category:Mexican stage actors Category:Mexican voice actors Category:Actors from Coahuila Category:Deaths from cerebral hemorrhage Category:Deaths from hypertension",
 "title": "Carmen Salinas"
}