{
 "id": "435523",
 "text": "Guilt is a feeling that a person has when they realise or believe that they have done something wrong. This usually depends on that person's own conscience, their understanding of right and wrong.\"Guilt.\" Encyclopedia of Psychology . 2nd ed. Ed. Bonnie R. Strickland. Gale Group, Inc., 2001. eNotes.com. 2006. 31 December 2007 Guilt is usually related to remorse (\"feeling sorry\"). The American Psychological Association (APA) defines guilt as a “self-conscious emotion” denoted by a “painful appraisal of having done (or thought) something that is wrong.” It also notes that such emotion can inspire people to reverse or compensate for perceived wrongdoing. The origins of guilt as a human emotion are widely debated and theorized within many different disciplines. Examples of avenues through which guilt may be derived include society, culture, religion, and family. According to Carolyn Zahn- Waxler, professor of psychology at the University of Wisconsin–Madison, and Grazyna Kochanska, professor of developmental psychology at the University of Iowa, people first experience guilt during conscious development in childhood. Because guilt is complex and empathetic, many professionals characterize it as a defining emotion that distinguishes humans from other animals. Guilt can sometimes cause anxiety. A person may react to their guilt in either a peaceful or violent way. A person might begin blaming the victim of their own actions. Guilt contributes to many psychological conditions and to psychopathy. For example, some researchers suggest that sociopaths have little or no regard for others and therefore feel little guilt. Conversely, people who have schizophrenia or depression feel too much guilt and may find themselves projecting guilt onto hallucinations or ruminating on past mistakes. Additionally, people who experience anxiety disorders, such as generalized anxiety disorder or obsessive-compulsive disorder (OCD), may become preoccupied with guilt about their thoughts or actions. == References == Category:Emotions Category:Philosophy of life",
 "title": "Guilt (emotion)"
}