{
 "id": "435607",
 "text": "Asa Akira (born January 3, 1986) is the stage name of an American pornographic actress and model. Akira has appeared in over 505 adult films as of May 2016. ==Awards== List of accolades received by Asa Akira {| class=\"collapsible collapsed\" width=100% {| class=\"collapsible collapsed\" width=100% {| class=\"collapsible collapsed\" width=100% Awards Awards Awards Award Won ;AVN Awards ;NightMoves Awards ;Pornhub Awards ;Urban X Awards ;XBIZ Awards ;XRCO Awards ;Others Year Ceremony Category Work 2011 AVN Award Best All-Girl Three- Way Sex Scene (with Alexis Texas & Kristina Rose) Buttwoman vs. Slutwoman Best Anal Sex Scene (with Manuel Ferrara) Asa Akira Is Insatiable Best Double Penetration Sex Scene (with Toni Ribas & Erik Everhard) Best Three-Way Sex Scene (Girl / Boy / Boy) (with Prince Yahshua & Jon Jon) Urban X Award Best Couple Sex Scene (with Mr. Pete) Vajazzled Porn Star of the Year 2012 AVN Award Best Anal Sex Scene (with Nacho Vidal) Asa Akira Is Insatiable 2 Best Double-Penetration Scene (with Mick Blue & Toni Ribas) Best Group Sex Scene (with Erik Everhard, Toni Ribas, Danny Mountain, Jon Jon, Broc Adams, Ramón Nomar, & John Strong) Best Tease Performance Best Three-Way Sex Scene, Boy / Boy / Girl (with Mick Blue & Toni Ribas) Best Solo Sex Scene Superstar Showdown 2: Asa Akira vs. Kristina Rose NightMoves Award Best Ass (Editor's Choice) rowspan=5 XBIZ Award Female Performer of the Year XRCO Award Female Performer of the Year Superslut AEBN VOD Award Performer of The Year Galaxy Award Best Personal Website (North America) AsaAkira.com 2013 AVN Award Best Double-Penetration Sex Scene (with Ramón Nomar & Mick Blue) Asa Akira Is Insatiable 3 Best Group Sex Scene (with Erik Everhard, Ramón Nomar, & Mick Blue) Best Three-Way Sex Scene (Girl / Girl / Boy) (with Brooklyn Lee & James Deen) Best POV Sex Scene (with Jules Jordan) Asa Akira to the Limit Best Star Showcase Female Performer of the Year rowspan=6 XRCO Award Female Performer of the Year NightMoves Award Best Ethnic Performer (Fan's Choice) Galaxy Award Best Female Performer (America) Sex Award Porn Star of the Year Porn's Perfect Girl / Girl Screen Couple (with Jessica Drake) 2014 AVN Award Best Porn Star Website (tied with JoannaAngel.com) AsaAkira.com NightMoves Award Best Body (Editor's Choice) rowspan=2 2015 XRCO Award Mainstream Adult Media Favorite 2017 AVN Award Best Solo / Tease Performance Asa Goes To Hell XBIZ Award Best Supporting Actress DNA 2018 AVN Award Mainstream Star of the Year XBIZ Award Best Actress – Couples-Themed Release The Blonde Dahlia 2019 AVN Award Mainstream Venture of the Year rowspan=7 Hall of Fame Pornhub Award Best Fan Club 2020 XRCO Award Hall of Fame Pornhub Award Favorite MILF 2022 Favorite Social Media Personality 2023 Brazzers Hall of Fame ==References== ==Other websites== Category:1986 births Category:Living people Category:Actors from Manhattan Category:American adult models Category:American pornographic actors Category:Models from Manhattan Category:American erotic dancers Category:American feminists Category:Actors from Tokyo Category:AVN Award winners",
 "title": "Asa Akira"
}