{
 "id": "435728",
 "text": "The 2nd century BC was a century that started on the first day of 200 BC and ended on the last day of 101 BC. It is considered part of the Classical period of history. After having won the Second Punic War, the Roman Republic continued expanding by conquering neighbouring territories. It eventually made Greece part of its empire. It also took the coast of North Africa after destroying the city of Carthage at the end of the Third Punic War. In the east, the Seleucid Empire was forced to make concessions to Rome in order to avoid war. Rome came to dominate the Mediterranean Sea during this period. By the end of the century, its army changed from conscription to a voluntary professional force. These changes were known as the Marian Reforms. In East Asia, China became very successful under the Han Dynasty. Its empire extended from Korea in the east to Vietnam in the South and, to the borders of what is today Kazakhstan in the west. The Han also try to get help in fighting the Xiongnu from the Yuezhi people in the west.C.Michael Hogan, Silk Road, North China, The Megalithic Portal, ed. A. Burnham It is also during this century that the first paper was made in China. In Europa, the Second Macedonian War fought between Macedon, led by Philip V of Macedon, and Rome (200–197 BC) marked a significant stage in increasing Roman intervention in the affairs of the eastern Mediterranean, which would eventually lead to Rome's conquest of the entire region. In 203-191 the Boii were submitted by the Romans and their territory became part of Galia cisalpina. In 192-190 Rome wages war against the king Antiochus III the Great. Cato the Elder, is elected censor in 184, an try to oppose Hellenism. The Third Macedonian War (171-168) against Perseus of Macedon won by the Romans. After the Third Punic War (149-146), Carthage is taken and destroyed by the Romans. Between 133 and 121, the Gracchi brothers advocate for social reform but are both killed. Gallia Narbonensis is conquired by the Roman Republic in 125–121. Together with the Teutones and the Ambrones, the Cimbi fight the Roman Republic between 113 and 101 BC during the Cimbrian War. The Cimbri were initially successful but they were decisively defeated at the Battle of Vercellae by Gaius Marius ==References==",
 "title": "2nd century BC"
}