{
 "id": "435739",
 "text": "A nuclease is an enzyme which cuts the bonds between the nucleotide subunits of nucleic acids, which are the building blocks of DNA and RNA. These enzymes act like molecular scissors, cutting the phosphodiester bonds that hold nucleotides together in these genetic molecules. Nucleases are essential in various cellular processes, including DNA repair, replication, and gene regulation. Well known nucleases are deoxyribonuclease and ribonuclease. == Kinds of nuclease == Nucleases may have the prefix \"endo\" or \"exo\" added to the name. Endonucleases break nucleic acid chains in a specific place between two nucleosome units. Exonucleases remove nucleotides from the ends of DNA molecules. A restriction endonuclease does a specific job. It scans the length of a DNA molecule. Once it finds a particular sequence, it binds to the DNA molecule and makes a cut in each of the two sugar-phosphate backbones. Different endonucleases cut in different places, but one endonuclease will always cut a palindromic base sequence the same way, no matter what DNA molecule it is acting on. Once the cuts have been made, the DNA molecule breaks into fragments. In fact, more than 900 restriction enzymes, some sequence specific and some not, have been isolated from over 230 strains of bacteria since their discovery.Baker, Tania A. & Kornberg, Arthur 2005. DNA replication. University Science. Ellenberger T. et al 2006. DNA repair and mutagenesis'. Washington, D.C: ASM Press. There are two types of cuts and the result can be sticky or the blunt end of the palindromic sequence. This division is based on the the way each restriction enzyme cuts through the DNA double strand. These enzymatic tools were important to scientists who were gathering the tools needed to \"cut and paste\" DNA molecules. They needed a tool to cut DNA at specific sites, rather than at random sites along the length of the molecule. This way they could cut DNA molecules in a predictable way. This whole field of research started many years ago with the Avery–MacLeod–McCarty experiment.Arber W. & Linn S. 1969. DNA modification and restriction. Annu. Rev. Biochem. 38:467-500. == References == Category:Enzymes Category:Genetic engineering",
 "title": "Nuclease"
}