{
 "id": "435942",
 "text": "Poi is a skill toy. Poi means both a style of performing art and the equipment used for engaging in poi performance. As a skill toy poi is an object or theatrical prop. Poi started with the Māori people of New Zealand, where it is still practised today.Poi activity, TKI Poi spinning involves using a set of weights on strings. Many people use beanbags in long socks. These are called a set of poi. People spin the poi around their body drawing shapes in the air. LED lights or fire are sometimes used to make the poi easier to see and more exciting to watch. == Useful moves with poi spinning == Walk or jump while spinning poi. Do dance moves. Stay in the same place but move the spin image everywhere and in all directions. Move body with poi or arms. If hands go right, move body to right. Spin slow or fast. Straighten your arms. Add difficulty for example stand on 1 leg. Lie down on the ground and spin. This can help to make many poi tricks: * Visualize moves that you need to make. * Drawing simple geometric shapes in air with 2 arms everywhere including behind back and behind head. This will also help to make tricks that require spinning behind back. * Film yourself on camera and watch this video or use a mirror. *Divide the trick into steps. * Close eyes. Pay attention on how you feel. * If you try to spin trick in 1 hand, you can make your left hand spin what you need. Right hand do random actions. This will be especially useful in hybrid tricks. Because in this way you detach left hand from right hand. After that left and right hand can do really different moves. * To make hybrid tricks you can pay 90% attention to what left arm spin and 10% attention to what right arm spin. == What abilities increases with poi spinning == Poi can develop rhythm, balance, concentration, coordination, grace, body stretches, grip strength, attention . Some poi tricks like complex atomic tricks can develop skill of solving geometric puzzles. Besides increasing abilities, poi can be useful like a physical activity. Physical activity increases when the spinner spins heavy poi, spins fast, and adds body moves. Poi can be used as art of drawing shapes in the air. This can be done by taking photos on exposure when the spinner uses LED or fire poi. == Spinning more than 2 poi == When a spinner has 2 or more poi in one hand he can have 3 poi or more poi in 2 hands. This can be useful in these cases: * When spinner spin 3 poi this can be useful in 3d tricks when each poi spin in different plane. For example 3 poi can spin in 3 planes when each of 3 planes are parallel to different faces of a cube. These 3 planes are called face plane, wheel plane and helicopter plane. * When spinner spin 4 poi and has 2 poi in each hand. Each hand can make tricks similar to butterfly trick. == Different types of poi == * Fabric poi . A striped sock poi can stretch more when the speed of spin increases. Striped sock poi prevent tangling of 2 poi. * LED poi. Can have different modes. Each mode have unique drawing from different colors. podpoi 2 is a type of LED poi where many different poi heads are synchronized via wireless connection so that all they will change mode synchronously in a smart way that will look interesting. * Pixel poi draw images in air. * Fire poi. They are usually set on fire after soaking in kerosene. Different types of fire poi are monkey fist, twister, cathedral, block, mura, weka. == Other websites == . Wikibooks section about Poi tricks. ==References== Category:Performing arts",
 "title": "Poi spinning"
}