{
 "id": "436022",
 "text": "Mamdouh Mohamed Gad Eldamaty ( born December 6, 1961 in Cairo) is Professor of Egyptology at the Department of Archaeology, Faculty of Arts, Ain Shams University in Cairo. On May 15, 2011, he became Cultural Counselor and Head of Educational Mission at the Embassy of Egypt in Berlin. ==Early life and education== He attended high school in Cairo. In 1979, he registered at the Faculty of Archeology, Cairo University. In July 1981, he was looking for a summer job as a student. He went to the Egyptian Museum in Cairo and met with Dr. Mohamed Saleh, the vice director of the museum. He worked there for one month. In summer 1982, he worked at the museum again for a summer student job. He did work that brought him in contact with all departments of the museum. In 1983, he graduated at the Faculty of Archeology, Cairo University. After his graduation, he worked again for the museum for one month for free. After that, he joined the restoration team of the Coptic Museum for several months. In January 1984, he started his 15 month long conscription service. He worked at the museum again from April 1985 to September 1987. He rejoined his Faculty at Cairo University to resume higher studies. The thesis of his Master's Degree was \"St- Meskhnet hall at Dendara Temple, linguistic and cultural study\" under supervision of Prof. Abdelhalim Noureldin and partnership of Dr. Ola El- Aguizy. Through his work at the Museum he became acquainted to many Egyptologists and archaeologists who visited the Museum. Among those was Prof. Erich Winter at Trier University, who with his wife visited Egypt in 1987 and were accompanied by the young Mamdouh Eldamaty during their 3-day visit to Siwa Oasis. This new contact proved to be quite useful as Prof. Winter encouraged him to continue his studies under his supervision at the Department of Egyptology at Trier University. In October 1988 he worked as a curator at Faculty of Archaeology Museum of Cairo University. During his work he got his Master Degree in April 1989 in Egyptology. Immediately he left Egypt for Germany on leave to prepare his PhD. Trying his luck without any state sponsored scholarship it was rather difficult to get an entry visa to study in Germany. Thanks to the help and support of his Professor and guarantor, Prof. Dr. Mohamed Saleh, an entry visa was issued and he started his German courses at Cologne University. He supported his life by working during summer vacation. While in Cologne he held correspondence with Trier University. He got an acceptance from Trier University, which he joined from winter semester 1989/ 1990. He started his Trier residence by learning German until he acquired the ‘Prüfung zum Nachweis der Deutsch Sprachkenntnis’ that qualified him to regular study at the university. He registered for Egyptology as major subject with classical archaeology and ethnology as minor subject in summer semester 1991. At the winter semester 1992/ 93 he registered for his PhD with thesis ‘Sokar- Osiris- Kapelle im Tempel von Dendera’ for which he received a study scholarship from Ministry of Culture at Rhineland Palatia that enabled him to finish his study in June 1995. During his stay in Germany, on February 26th 1992 he married Aida Abdelghany Ahmed, who studied sociology at Zagazig University. She accompanied him to Germany where gave birth to their first daughter, Mariam (11.Feb. 1993) in Trier. He returned to Egypt in September 1995 but kept visiting Trier frequently in the years 1996, 1997, 1999, 2002, 2004 and 2007 in order to follow recent publications and studies on Egyptology. Back in Cairo, where the family got a son and another daughter, he worked for the Faculty’s Museum until January 1996. Starting from January 1996 he started as lecturer for Egyptology at Faculty of Tourism and Hotels, Cairo University, Fayoum Branch. Upon founding an archaeological department at the Faculty of arts, Ain Shams University in August 1998, he moved to the new department as a lecturer for Egyptology until end of 2001. ==Career== ===Director General of Egyptian Museum in Cairo=== At the beginning of 2001 he was appointed Director General of the Egyptian Museum in Cairo, a post that he held until end of January 2004. During his directorship the Museum witnessed several far reaching activities, developing its cellar, restoration of old records of the Museum, preparing for the second chamber for royal mummies and establishing a restoration laboratory for papyrus, in cooperation with Corrado Basile, Director of Istituto Internazionale del Papiro, Siracusa in Italy. In July 2001 he laid a plan for the centennial of the Egyptian Museum in Cairo, which included several projects to promote and develop the old institution. ===Professor at Ain Shams University=== He returned to his main work in teaching at the Ain Shams University. There he got the post of associate professor of Egyptology at the Faculty of Arts from 25.03.2001 till 20.08.2006. As of 21.08.2006 he became a full professor of Egyptology and presided over the archaeological Department of Faculty of Arts from 12.09.2006 till 12.09.2009. He was assigned to head the college center for studies, consultations and training from 15.10.2008 till 13.10.2009 when he overtook the post of director of open education center from 22.03.2009 till 15.11.2009. From 13.09.2009 till 14.05.2011 he was the Dean of Faculty of Arts. During his deanship he supervised the project for sustainable development and qualifying for Accreditation. He organized the first election process in Egyptian universities to choose his successor as Dean of the Faculty in March 2011, as he left the country on 15.05.2011 in the capacity of cultural counselor at the Egyptian Embassy to Berlin and head of educational mission there. At this post he supervises all Egyptian students in Germany, Netherlands, Poland, Denmark, Sweden, Finland and Norway. ==Membership and other professional activities== *International Committee of Arabic Museums (ICOM-Arab). Vice President of ICOM-Arab (Sep. 2001 – Oct. 2003). *President of ICOM-Arab (Oct. 2003 - 2004). *International Association of Egyptologists. *Arab Archaeologists Association. *Egyptian Society for historical studies. *The German Archaeological Institute *The team in charge of the establishment of the Egypt Archaeological Map. *Board of Directors of the antiquities Museum of the library of Alexandria (Bibliotheca Alexandrina). *Egyptological team in charge of the organization of the exhibits of the New Museum of Egyptian antiquities to be built in Giza (from Sep.1999 to 31.01.2004). *Board of Directors of Cairo Museum (from 01.02.2001 to 31.01.2004). *Board of Directors of permanent committee in SCA. (From 01.02.2001 to 31.01.2004). *Board of Directors of Museums sector in SCA. (From 01.02.2001 to 31.01.2004). Awards and Honors Legion of Honor “Cavalier” from the Italian Government (Oct. 10. 2004). State Award for Excellence in Social Sciences (Jun. 21. 2010) ==Scientific publications== *“Squatting statues in the Cairo Museum”, in: Mitteilungen des Deutschen Archäologischen Instituts Abteilung Kairo 46, Mainz 1990, 1-13 (Taf. 1-9). *“Isis-Hathor im Tempel von Dendera”, in: Aegyptiaca Treverensia 7 (Festschrift für Erich Winter), Mainz 1994, 81-87. *Sokar-Osiris-Kapelle im Tempel von Dendera, Hamburg 1995. *“Eine Szene der Besänftigung der Sachmet im Kiosk von Dendera”, in: Journal of the faculty of Archaeology 7, Cairo 1996, 147-156. *“Der Goldfalke als Opfergabe in den grichisch-römischen Tempel”, in: Göttinger Miszellen 161, Göttingen 1997, 51-64. *“Horus als Ka des Königs”, in: Göttinger Miszellen 169, Göttingen 1999, 31-45 (Taf. 1-8). *Catalogue Général of Egyptian Antiquities in the Cairo Museum, Statues of the XXVth. and XXVIth. Dynasties, Nr. 48601-48649, Cairo 1999. (together with Jack A. Josephson) *“Die Schutzformeln hinter dem König im Kiosk des Tempels von Dendera”, in: Bibliothèque d’Étude 138 (Hommages a Fayza Haikal), Cairo 2003, 83-91. *“Die Treppe des Hinaufsteigens zum Dach des Tempels von Dendera im Neujahrfest”, in: Egyptology at the dawn of the twenty-first century (proceedings of the Eighth International Congress of Egyptologists, Cairo 2000), vol. 1, Cairo 2003, 171-179. *“The Egyptian Directors of the Cairo Museum 1941-1991”, in: Bulletin of the Egyptian Museum 1, Cairo 2004, 7-8. (together with Heba Samy) *Ein ptolemäisches Pristerdekret aus dem Jahr 186 v. Chr. eine neue Version von Philensis II in Kairo, APF-Beiheft 20, München und Leipzig 2005. *“Zur Bedeutung der leeren Kartuschen”, in: Göttinger Miszellen 207 (2005), pp. 23–36. *“Stela of Iuyres in Cairo Museum”, in: Journal of the faculty of Archaeology 10, Cairo 2005, pp 63–69. *“Zwei Stelen mit Sonnenhymnen aus dem Kairener Museum”, (FS Mohamed Saleh), in: Bulletin of the Egyptian Museum 2, Cairo 2005, pp. 55–60. *“Die leeren Kartuschen aus der Regierungszeit von Kleopatra VII. im Tempel von Dendera”, in: OLA 150 (Leuven, 2007), pp. 511– 544. *“A Statuette of Psamtik I with a Spear”, in: Sue H. D’Auria, Servant of Mut: Studies in Honor of Richard A. Fazzini, Leiden 2007, pp. 83–88. *“Die leeren Kartuschen im Tempel von Edfu”, in: U. Rössler & T. Tawfik (HRSG.), Die ihr vorbeigehen werdet ... Wenn Gräber, Tempel und Statuen sprechen, Gedenkschrift für Prof. Sayed Tawfik Ahmed, SDAIK 16, Berlin 2009, pp. 81–102, Taf. 9-12. *\"Die leeren Kartuschen von Echnaton”, in: Sue H. D'Auria (edit.), Offeringsof the Discerning Eye, An Egyptological Medley in Honor of Jack Josephson, (= Culture and Hisrtory of the Ancient Near East 38, Leiden 2010), pp. 79–81. *“Die ptolemäische Königin als Weiblicher Horus”, in: A. Jördens und J. F. Quack (edit.), Ägypten zwischen innerem Zwist und äußerem Druck. Die Zeit Ptolemaios’ VI. bis VIII., (= PHILIPPIKA, Marburger altertumskundliche Abhandlungen 45, Wiesbaden 2011), pp. 24–57. ==Articles in Catalogs of special exhibitions== *Cat. No. 78, 79 & 105, in: The Quest for Immortality, Treasures of Ancient Egypt, Washington 2002. (in USA). *The Third Intermediate Period (together with Isabelle Franco), in: The Pharaohs, Milano 2002, 69-83. (in Italy). *Pro0swpa thj Aigu0ptou Apo0 thn Gki0za sto Fagiou0m (together with Mohamed Saleh), Athens 2003. (in Greece). *Cat. Nr. 42-46, in: Tutanchamun, das goldene Jenseits, Basel 2004. (in Switzerland). *Das Ägyptische Museum in Kairo, in: Tutanchamun, das goldene Jenseits, Basel 2004, 17-26. (in Switzerland). Editing of *Egyptian Museum collections around the World, Studies for the Centennial of the Egyptian Museum, Cairo 2002 (together with Mai Trad). *Bulletin of the Egyptian Museum, Vols. 1-2, Cairo 2004-2005 (together with Zahi Hawass and Khaled Daoud). ==Related pages== *List of Egyptian scientists ==References== Category:1961 births Category:Living people Category:Egyptian academics Category:Egyptian scientists Category:People from Cairo",
 "title": "Mamdouh Eldamaty"
}