{
 "id": "436283",
 "text": "Seymour Benzer (October 15, 1921 – November 30, 2007) was an American physicist, biologist and geneticist. He was of Jewish descent.Oralhistories.library.caltech.edu His career began during the molecular biology revolution of the 1950s, and he eventually rose to prominence in the fields of molecular and behavioral genetics. He led a genetics research lab at Purdue University and at the California Institute of Technology.Greenspan R.J. 2008. Seymour Benzer (1921–2007). Current Biology 18 (3): R106–R110. Benzer made fundamental discoveries in two quite different fields of genetics. He got his PhD in solid-state physics, but soon switched to genetics after he read Erwin Schrödinger's book What is Life? == Phage genetics == At Purdue University, Benzer developed the \"T4 rII system\", a new genetic technique. This used recombination in T4 bacteriophage rII mutants to map the inside structure of genes.Benzer S. 1961. On the topography of the genetic fine structure. Proceedings of the National Academy of Sciences 47 (3): 403–415. Benzer realized that by generating many r mutants and recording the recombination frequency between different r strains, he could make a detailed map of the gene, much as Alfred Sturtevant had done for chromosomes.Weiner, Jonathan 1999. Time, love, memory: a great biologist and his quest for the origins of behavior. New York: Knopf. Taking advantage of the enormous number of recombinants that could be analyzed in the rII mutant system, Benzer was eventually able to map over 2400 rII mutations. The data he collected provided the first evidence that the gene is not an indivisible entity, as previously believed, and that genes were linear. Based on his rII data, Benzer also proposed distinct classes of mutations including deletions, point mutations, missense mutations, and nonsense mutations.CalTech Oral Histories: Interview with Seymour Benzer. p47 onwardsHolmes F.L. & Summers W.C. 2006. Reconceiving the gene: Seymour Benzer's adventures in phage genetics. New Haven: Yale University Press. == Behavioral genetics == Benzer was one of the first scientists in the field of behavioral genetics. As the field began to emerge in the 1960s and 70s, Benzer found himself in scientific opposition to another of the field's leading researchers, Jerry Hirsch. Hirsch believed that behaviors were so complex they could not be explained as the action of single genes, Benzer thought behaviors might be directed by single genes. Both researchers tried their ideas out on Drosophila. Hirsch artificially selected for behaviors of interest over many generations, while Benzer used methods to isolate mutants for a particular behavior.Tully T. 1996. Discovery of genes involved with learning and memory: An experimental synthesis of Hirschian and Benzerian perspectives. Proceedings of the National Academy of Sciences. 93 (24): 13460–13467. Benzer and Hirsch's competing philosophies developed behavioral genetics, and helped it become a legitimate area of study in the scientific community. == Honors and awards (selection) == * Fellow of the American Academy of Arts and Sciences (1959) * Albert Lasker Award for Basic Medical Research (1971) * Louisa Gross Horwitz Prize from Columbia University (1976), * National Medal of Science (1982) * Thomas Hunt Morgan Medal (1986) * Wolf Prize in Medicine (1991) * Crafoord Prize (1993) * NAS Award in the Neurosciences from the National Academy of Sciences (2001) * Gairdner Foundation International Award (2004) (second award) He was a member of the U.S. National Academy of Sciences, the Royal Society and the French Academy of Sciences. == References == Category:1921 births Category:2007 deaths Category:American biologists Category:American geneticists Category:American physicists Category:Purdue University faculty Category:Foreign Members of the Royal Society Category:Jewish American academics Category:Jewish American scientists Category:Jewish Wolf Prize winners Category:American molecular biologists Category:Scientists from New York City Category:California Institute of Technology faculty",
 "title": "Seymour Benzer"
}