{
 "id": "436444",
 "text": "George Christopher Williams (May 12, 1926 – September 8, 2010) was an American evolutionary biologist.Meyer A. 2010. George C. Williams (1926–2010). Nature 467 (7317): 790. Williams was a professor emeritus of biology at the State University of New York at Stony Brook. He was best known for his critique of group selection, though later in life he recognized that it did sometimes occur. The work of Williams in this area, with W.D. Hamilton, John Maynard Smith and others, led to the development of a gene-centered view of evolution. In 1999 Williams shared the Crafoord Prize, with Maynard Smith and Ernst Mayr, for developing the concept of evolutionary biology. ==Academic work== Williams' 1957 paper Pleiotropy, natural selection, and the evolution of senescence was influential in 20th century evolutionary biology. It contains three important ideas.Williams, George C. 1957. Pleiotropy, natural selection, and the evolution of senescence. 11. Evolution (4): 398–411. In this paper Williams proposed that senescence should be generally synchronized by natural selection.The idea was proposed earlier by Peter Medawar in the 1950s: Medawar P.B. 1952. An unsolved problem of biology. An inaugural lecture delivered at University College London, 6 December, 1951. London: H.K. Lewis; see also Medawar, Peter 1957. Uniqueness of the individual. London: Methuen. ISBN 9780486240428. Medawar P.B. & J.S. 1983. Aristotle to Zoos: a philosophical dictionary of biology. p58. . It was also discussed by John Maynard Smith. Szathmáry E.R. & Hammerstein P. 2004. Obituary: John Maynard Smith (1920–2004). Nature 429 (6989): 258–259. > \"if the adverse genic effects appeared earlier in one system than any other, > they would be removed by selection from that system more readily than from > any other. In other words, natural selection will always be in greatest > opposition to the decline of the most senescence-prone system.\" This paper also contains the first outline of the idea that natural selection might select for menopause and post-reproductive life in females, although Williams does not explicitly mention grandchildren or the inclusive fitness contribution of grandparenting. By helping grandchildren survive, grandparents promote the survival of an average of one-quarter (1/4) of their own genome.Maynard Smith, John. 1999. Evolutionary genetics. 2nd ed, Cambridge University Press.p100 In his first book, Adaptation and Natural Selection, Williams advocated a \"ground rule or perhaps doctrine would be a better term ... that adaptation is a special and onerous concept that should only be used where it is really necessary\",Williams, G.C. 1966. Adaptation and natural selection. Princeton University Press, Princeton, N.J. p4 and, that, when it is necessary, selection among genes or individuals would in general be the preferable explanation for it. This contributed to the development of a gene- centered view of evolution; Richard Dawkins built on Williams' ideas in this area in the book The Selfish Gene. Williams was also well known for his work on the evolution of sex, and was an advocate of evolutionary medicine. == Books == * Williams G.C. 1966. Adaptation and natural selection. Princeton University Press, Princeton, N.J. * Williams G.C., ed. 1971. Group selection. Aldine-Atherton, Chicago. * Williams G.C. 1975. Sex and evolution. Princeton University Press, Princeton, N.J. * Williams G.C. 1992. Natural selection: domains, levels, and challenges. Oxford University Press, New York. * Nesse R.M. and G.C. Williams. 1994. Why we get sick: the new science of Darwinian medicine. Times Books, New York. * Williams G.C. 1996. Plan and purpose in nature. Weidenfeld & Nicolson, London (published in the U.S. in 1997 as The Pony Fish’s glow and other clues to plan and purpose in nature. Basic Books, New York). == References == Category:1926 births Category:American evolutionary biologists Category:2010 deaths Category:Deaths from Parkinson's disease",
 "title": "George C. Williams"
}