{
 "id": "436927",
 "text": "Adolfo Suárez González, 1st Duke of Suárez, Grandee of Spain (25 September 1932 - 23 March 2014) was a Spanish lawyer and politician. Suárez was Spain's first democratically elected prime minister after the dictator of Franco. Suárez was born in Cebreros, Spain. During his term as Prime Minister, Suárez was the key figure in the country's change to democracy. He led and founded some democratic political parties in Spain. He created the Political Reform of Spain in 1976 which helped Spain to become a democratic country. In 2005, he was diagnosed with Alzheimer's disease. He died nine years later in Madrid at the age of 81. ==Early life== Suárez was born in Cebreros, Spain. His parents were Hipólito Suárez Guerra and Herminia González Prados. He studied at the University of Salamanca. Suárez married María Amparo Illana Elórtegui in 1961. ==Political career== On 4 July 1976, King Juan Carlos appointed Suárez as Prime Minister of Spain. He was the first Prime Minister under the 1978 Constitution of Spain. In late July of 1977, Suárez became a member of the Congress of Deputies for Madrid. He was a member until he retired from politics in 1991. In 1977, Spain had its first free elections in 41 years. Suárez was elected Prime Minister. He and the people working with him won the 1979 elections under the new constitution. He resigned as Prime Minister on 29 January 1981. In 1981, King Juan Carlos of Spain gave Suárez the hereditary title of \"Duque de Suárez\" (Duke of Suárez). He also received the title Grande de España (English: Grandee of Spain) because of his role in the change to democracy. The Prime Minister after Suárez was Leopoldo Calvo Sotelo. In 1986, Suárez ran again for Prime Minister. He lost to Felipe González. ==Personal life== Suárez had five children. His first child died in 2004 from cancer. His wife of fifty years, María Amparo died in 2001. He lived in Madrid during his retirement years. ==Health and death== On 31 May 2005, Suárez's son, Adolfo Suárez Illana, announced on Spanish television that his father was suffering from Alzheimer's disease. Suárez died from a respiratory infection in Madrid, aged 81. ===Funeral=== Suárez was granted a state funeral. His small memorial service was held on March 26 at the Ávila Cathedral. Many politicians attended including all former living Spanish Prime Ministers. His state funeral was held on 31 March 2014. He was buried at the Ávila Cathedral. ==Legacy== On 24 March 2014, the Spanish government decided to rename the Madrid Barajas Airport to Adolfo Suárez Madrid-Barajas in honor of his service to the country. ==Honorary titles== * Mr. Adolfo Suárez (1932–1976). * The Most Excellent Adolfo Suárez, Prime Minister of Spain (1976–1981). * The Most Excellent The Duke of Suárez, Grandee of Spain (1981–2007). * The Most Excellent The Duke of Suárez, Grandee of Spain, Order of the Golden Fleece (2007–2014). ==Some honors or awards== * Grand Cross of the Order of Civil Merit (18 July 1969).Spanish: Boletín Oficial del Estado 69-07-18, Spanish Official Journal (accessed on December 23, 2011) * Gold Medal of Segovia (17 November 1969). * Grand Cross of the Civil Order of Alfonso X, the Wise (1 April 1970).Spanish: Boletín Oficial del Estado 71-04-05, Spanish Official Journal (accessed on December 23, 2011) * Gold Medal of Ávila (12 February 1981).Adolfo Suárez, Medalla de Oro de Ávila, e Hijo Adoptivo de dicha ciudad * Adopted Son of Ávila (12 February 1981). *Gold Medal of Madrid (30 November 1995).Medalla de Oro de Madrid para Adolfo Suárez, Teresa Berganza, Pedro Laín Entralgo y Joaquín GarriguesConcesión de la Medalla de Oro de Madrid para Adolfo Suárez * Prince of Asturias Concord Award (13 September 1996).Concesión Príncipe de Asturias a Don Adolfo Suárez González. Hemeroteca El País *Coexistence Award of Ceuta (30 April 1999).Suárez, González y Roca hablarán de \"España desde la Constitución\". Hemeroteca El País. Consultado el 24 de marzo de 2014. *Gold Medal of Castilla y León (22 March 1997).Adolfo Suárez, profeta en su tierra *Medal of Honor of Madrid (15 May 2011).Medalla de Honor de Madrid para Suárez, y de Oro para González y Aznar ==Related pages== * Prime Minister of Spain * Cebreros * Francisco Franco * Union of the Democratic Centre (Spain) ==Further reading== * Medalla de Oro de la provincia de Segovia concedida a su Alteza Real Don Juan de Borbón y Battenberg (1991). Segovia. Provincial Council of Segovia. . ==References== ==Other websites== *Biography by CIDOB (in Spanish) *Tribute to Adolfo Suárez: Guestbook *Spain's first post-Franco PM, Adolfo Suarez, dies at 81 Category:1932 births Category:2014 deaths Category:Infectious disease deaths in Spain Category:People from Castile and León Category:People with Alzheimer's disease Category:Prime Ministers of Spain",
 "title": "Adolfo Suárez"
}