{
 "id": "436904",
 "text": "Hans Jakob \"Jack\" Steinberger (25 May 1921 - 12 December 2020) was a German- born American physicist of Jewish descent. He co-discovered the muon neutrino, along with Leon Lederman and Melvin Schwartz. He was given the 1988 Nobel Prize in Physics. Steinberger now lives in Switzerland. He studied at the Illinois Institute of Technology and the University of Chicago. He was elected a member of the Academia Europaea in 1991. Steinberger was an atheist, and a member of the International Academy of Humanism. Steinberger died on 12 December 2020 in Geneva, Switzerland at the age of 99. ==References== ==Books== *Steinberger, J., W. K. H. Panofsky & J. Steller. \"Evidence for the Production of Neutral Mesons by Photons\", Radiation Laboratory, University of California-Berkeley, United States Department of Energy (through predecessor agency the Atomic Energy Commission), (April 1950). *Panofsky, W. K. H., J. Steinberger & J. Steller. \"Further Results on the Production of Neutral Mesons by Photons\", Radiation Laboratory, University of California-Berkeley, United States Department of Energy (through predecessor agency the Atomic Energy Commission), (October 1, 1950). *Steinberger, J. \"Experimental Survey of Strange Particle Decays\", Columbia University, Nevis Laboratories, United States Department of Energy (through predecessor agency the Atomic Energy Commission), (June 1964). ==Other websites== *Biography and Bibliographic Resources, from the Office of Scientific and Technical Information, United States Department of Energy *Autobiography (at the Nobel Prize web site) *official web site for the Nobel Prize in Physics *CERN web site for Jack Steinberger Category:1921 births Category:2020 deaths Category:American atheists Category:American Nobel Prize winners Category:American physicists Category:German Jews Category:Humanists Category:Jewish American academics Category:Jewish American scientists Category:Jewish atheists Category:Jewish Nobel Prize winners Category:Naturalized citizens of the United States Category:People from Bavaria Category:Refugees from Nazism Category:University of Chicago alumni Category:German Nobel Prize winners Category:Members of Academia Europaea",
 "title": "Jack Steinberger"
}