{
 "id": "436930",
 "text": "The Honorable Sir Charles Kuen Kao, GBM, KBE, FRS,List of Fellows of the Royal Society 1660 – 2007 FREng (November 4, 1933 - September 23, 2018) was a Chinese-born American and British electrical engineer and physicist. He helped discover the development and use of fiber optics in telecommunications. Kao was awarded the 2009 Nobel Prize in Physics for \"groundbreaking achievements concerning the transmission of light in fibers for optical communication\". Kao holds dual citizenship of the United Kingdom and the United States. Kao is known as the \"Godfather of Broadband\". Kao was diagnosed with Alzheimer's disease in 2002 and had speech difficulty.Ifeng.com: 港媒年初传高锟患老年痴呆症 妻称老人家记性差 He died on September 23, 2018 from complications of the disease in Sha Tin, Hong Kong at the age of 84. ==References== ==Books== * K. C. Kao, T. W. Davies (1968), \"Spectrophotometric Studies of Ultra Low Loss Optical Glasses – I: Single Beam Method\", Journal of Scientific Instruments (Journal of Physics E) 2 (1): 1063–1068. * K. C. Kao (June 1986), \"1012 bit/s Optoelectronics Technology\", IEE Proceedings 133, Pt.J, No 3, 230–236. * K. C. Kao, A Time And A Tide (Autobiography of Charles K. Kao) * K. C. Kao (July 2005)《潮平岸闊——高錕自述》(translated by 許迪鏘) Joint Publishing (Autobiography of Charles K. Kao) ==Other websites== * 2009 Nobel Prize in Physics information * BBC: Lighting the way to a revolution * IEEE Oral-History: Charles Kao * Mountain View Voice: The legacy of Charles Kao * Man who lit up the world – Professor Charles Kao CBE FREng Ingenia, Issue 43, June 2010 Category:1933 births Category:2018 deaths Category:Deaths from Alzheimer's disease Category:Naturalized citizens of the United States Category:Chinese physicists Category:Hong Kong people Category:British physicists Category:American physicists Category:Scientists from Shanghai Category:Chinese Nobel Prize winners Category:21st-century Chinese people Category:20th-century Chinese people",
 "title": "Charles K. Kao"
}