{
 "id": "43690",
 "text": "The Han dynasty came to power in 202 BC. They followed the laws of Confucianism and legalism. This was called 'the Han synthesis'. The Han dynasty was considered the golden age of early China with many important events and discoveries. == History == The Han dynasty ruled China for over 400 years: from 206 B.C. to 220 A.D. Its first emperor was Liu Bang, known in Chinese as Emperor Gaozu of Han. Emperor Gaozu maintained a legalist ideology, just like the Qin dynasty had. However, the emperor also had ideas related to Confucianism about having a centralized system showing benevolence. After eighty years, Emperor Wu of Han launched a period of military expansion. The Han armies took control of many territories, including the extremely important Silk Road in Mongolia and Xinjiang. The Silk Road helped make the empire a political, economic, military, and cultural center, but it was very expensive to manage and further expansion was cut off. Several factors contributed to the fall of the Han dynasty, including uprisings of desperate and hungry people, the spread of attacks by nomadic groups, and official corruption. == Importance == === Accomplishments === Under the Han dynasty: * China made progress in arts and science * The empire also became larger and larger * China started trading with a number of other countries * The Silk Road was formed. Merchants used the Silk Road to reach China for trade. * Buddhism was introduced in China. === Han Chinese === In the Han dynasty, many of the features of Chinese culture (including Confucianism and Chinese characters) became firmly established. For this reason, the dominant ethnic group in China today calls themselves the Han Chinese. == Literature == Fairbank, John King and Merle Goldman 1992. China: a new history. 2nd enlarged edition 2006. Cambridge: MA; London: The Belknap Press of Harvard University Press. == Other websites == * Han Dynasty by Minnesota State University * Han Dynasty art with video commentary, Minneapolis Institute of Arts Category:Chinese dynasties Category:3rd-century BC establishments Category:3rd-century disestablishments",
 "title": "Han dynasty"
}