{
 "id": "437145",
 "text": "Maya Mikhaylovna Plisetskaya (; 20 November 1925 - 2 May 2015) was a Russian ballerina, choreographer, director and actress. She was born in Moscow, Soviet Union. Plisetskaya gained an interest in ballet at a young age and was active during the Soviet period. She has been called by some, such as Nikita Khrushchev, one of the best ballerinas of all time. She was married to composer and pianist Rodion Shchedrin from 1958 until her death. ==Early life== Plisetskaya was born in Moscow, Russia to Lithuanian Jewish parents. Her mother, Rachel Messerer, was a silent movie actress and her father, Mikhail Plisetski, was a diplomat. She studied at the Bolshoi Theater. == Family == In 1938, her father was arrested and later executed during the Stalinist purges. Her mother was arrested soon after and, with Maya's seven- month-old baby brother, sent to a gulag in Kazakhstan for the next three years.They were sent to ALZHIR camp, a Russian acronym for the Akmolinskii Camp for Wives of Traitors of the Motherland, \"enemies of the people\" Plisetskaya was taken in by her maternal aunt (a ballerina) until her mother was released in 1941. During the years without her parents, and barely a teenager, Plisetskaya \"faced terror, war, and dislocation\". As a result, \"Maya took refuge in ballet and the Bolshoi Theatre\".Homans, Jennifer. Apollo’s Angels: a history of ballet, Random House (2010) pp. 383-386 == Dancing == For many years she was not allowed to tour outside the Soviet Union. This ban was lifted in 1959 by Nikita Khrushchev. Able to travel the world as a member of the Bolshoi, her skill as a dancer was widely recognised. It set a high standard for ballerinas in technique and dramatic presence. Khrushchev allowed her to go on the Bolshoi tour in New York and he was immensely satisfied upon reading the reviews of her performances. He embraced her on her return. Within a few years, she was recognized as “an international superstar” and a continuous “box office hit throughout the world”. The Soviet Union treated her as a favored cultural emissary, as “the dancer who did not defect”. Although she toured extensively during the years that other dancers defected, including Rudolph Nureyev, Natalia Makarova and Mikhail Baryshnikov, Plisetskaya always returned to Russia. Plisetskaya explains that for her generation, and her family in particular, defecting was a moral issue. She had once asked her mother why their family didn't leave the Soviet Union when they had the chance, at the time living in Norway. Her mother said “Misha would never have been a traitor”. ==Personal life== Plisetskaya married composer Rodion Shchedrin in 1958. They lived in Munich, Germany. She was close friends with Robert F. Kennedy. Plisetskaya was a naturalized citizen of LithuaniaPlisetskaya and Shchedrin settle in Lithuania, upi.com; accessed 4 May 2015. and Spain.Two greats of world ballet win Spanish Nobels , expatica.com; accessed 4 May 2015. ==Death== Plisetskaya died in Munich, Germany on 2 May 2015 from a heart attack, aged 89. == Awards == Plisetskaya was given many awards by the Soviet Union, and by Russia. Of special note were: === Soviet Union === * Hero of Socialist Labour (1985) * Three Orders of Lenin (1967, 1976, 1985) * Lenin Prize (1964) * People's Artist of USSR (1959) === Russia === * Order of Merit for the Fatherland ==References== ==Other websites== * Category:1925 births Category:2015 deaths Category:Russian choreographers Category:Entertainers from Moscow Category:Lithuanian Jews Category:Russian ballerinas Category:Russian Jews Category:Russian movie actors Category:Soviet actors Category:Soviet Jews",
 "title": "Maya Plisetskaya"
}