{
 "id": "437276",
 "text": "Brianne Sidonie Desaulniers, known professionally as Brie Larson, (born in Sacramento, California, October 1, 1989) is an American actress. She played Molly in the 2012 movie version of 21 Jump Street. She also played Envy in Scott Pilgrim vs. the World. Larson won the Academy Award for Best Actress for her role as Ma in the 2015 movie Room. Brie Larson is Captain Marvel. == Awards and nominations== Brie Larson has received many awards and nominations. She began acting at age eight, and followed it with minor supporting roles in various movies. Her breakthrough came with her leading performance in the 2013 coming-of-age drama film Short Term 12, for which she was nominated for the Independent Spirit Award and a Critics' Choice Award. She garnered widespread acclaim for her performance as Joy \"Ma\" Newsome in the 2015 drama Room, for which she won the Academy Award for Best Actress, the Golden Globe Award for Best Actress in a Motion Picture – Drama, the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role, the BAFTA Award for Best Actress in a Leading Role, and the Critics' Choice Movie Award for Best Actress. == Filmography == === Movies === Year Title Role Notes 1999 Special Delivery Little Angel 2004 13 Going on 30 Six Chick 2004 Sleepover Elizabeth \"Liz\" Daniels 2005 Madison Racing Girl 2006 Hoot Beatrice \"The Bear\" Leep 2007 Farce of the Penguins I Need a Z-Pack Penguin Voice 2008 Remember the Daze Angie Ford 2008 The Babysitter Allison 2009 House Broken Susan \"Suzy\" Decker 2009 Just Peck Emily Donaldson 2009 Tanner Hall Kate 2010 Greenberg Sara 2010 Scott Pilgrim vs. the World Natalie V. \"Envy\" Adams 2011 Treatment Franny 2011 Weighting Co-director and co-writer 2011 Smorgasbord Ciara 2011 Rampart Helen 2012 21 Jump Street Molly Tracey 2012 The Trouble with Bliss Stephanie Jouseski 2012 The Arm Co-director and co-writer 2013 Bitter Orange Myrtle 2013 Don Jon Monica Martello 2013 Short Term 12 Grace Howard 2013 The Spectacular Now Cassidy 2014 The Gambler Amy Phillips 2015 Digging for Fire Max 2015 Trainwreck Kim Townsend 2015 Room Joy \"Ma\" Newsome 2016 Free Fire Justine 2017 Kong: Skull Island Mason Weaver 2017 The Glass Castle Jeanette Walls 2017 Unicorn Store Kit 2017 Basmati Blues Linda 2019 Captain Marvel Carol Danvers 2020 Untitled Victoria Woodhull film Victoria Woodhull Announced March 2017 === Television === Year Title Role Notes 1998 The Tonight Show with Jay Leno Roadkill Easy Bake Oven / Girl Scout 2 episodes 1998 To Have & to Hold Lily Quinn 2 episodes 1999 Touched by an Angel Rachel Episode: \"Into the Fire\" 1999 Popular Robin Robin Episode: \"Fall on Your Knees\" 2000 Then Came You Young Allison Episode: \"Then Came Aidan's Ex\" 2000 Schimmel Samantha Pilot 2001 - 2002 Raising Dad Emily Stewart 22 episodes 2003 Right on Track Courtney Enders Film 2003 Hope & Faith Sydney Shanowski Unaired pilot 2008 Ghost Whisperer Krista Eisenburg Episode: \"Slam\" 2009 The Burg Hipster Girl Episode: \"Change\" 2009 - 2011 United States of Tara Katherine \"Kate\" Gregson 36 episodes 2011 The League Ashley 2 episodes 2012 NTSF:SD:SUV:: Katerin Episode: \"The Real Bicycle Thief\" 2012 Entry Level Laura Pilot 2013 Kroll Show College Girl 2 episodes 2013 - 2014 Community Rachel 3 episodes 2015 Comedy Bang! Bang! Herself Episode: \"Brie Larson Wears a Billowy Long-Sleeve Shirt and White Saddle Shoes\" 2016 Saturday Night Live Host Episode: \"Brie Larson/Alicia Keys\" ==References== Category:American Academy Award winning actors Category:Golden Globe Award winning actors Category:American television actors Category:American movie actors Category:Actors from Sacramento, California Category:1989 births Category:Living people",
 "title": "Brie Larson"
}