{
 "id": "437240",
 "text": "Diego da Silva Costa (born 7 October 1988) is a Brazilian-Spanish footballer who plays as a striker for Grêmio and the Spanish national football team. == Football Career == Costa was born in Brazil, and played for the Brazil national football team for the first time in 2013. However, he then chose to play for Spain. This made the Brazilian football manager, Luiz Felipe Scolari, very angry. The Brazilian Football Confederation have even asked the country's government to remove Costa's citizenship. (The right to be a country's citizen). In March 2014, Costa became a member of the Spanish national football team. This was when he was granted his Spanish citizenship. He made his first appearance against Italy and represented Spain in the 2014 FIFA World Cup. == Youth career == Costa spent 2 years at Barcelona Esportivo Capela (Brazillian football club), from 2004 to 2006. After this, he then began his senior career in Portugal by joining Penafiel. == Senior Career == === Penafiel (Loan) === In the same year as joining Braga, he was sent on a loan spell to Penafiel. He played 13 league games with 5 goals. === Atletico Madrid (2007–09) === In 2007, Costa joined Atletico Madrid for a fee of . Unfortunately, he didn't get a game to play due to loan spells. === Braga (Loan) === Diego Costa remained at Braga in 2007 but on a loan spell. This time, he made 7 league appearances, but he failed to score a goal. In the UEFA Cup, he scored his first goal in a domestic cup against Parma F.C. (Italian football team). === Celta de Vigo (Loan) === He was then loaned to Celta for the 2007-08 Segunda Division season. In that season, he made an impressive 30 appearances and scored 5 goals. === Albacete (Loan) === Staying in the Segunda Division, he then joined on loan Albacete Balompie for the 2008-09 season. At this loan spell, he made 35 league appearances and 9 goals. === Real Valladolid === Costa was bought by Real Valladolid from Atletico Madrid in 2009 Transfer Window. In this 2009-10 season, he made 34 league appearances with 8 goals. But it wasn't enough to keep Valladolid in La Liga, the top division in Spain. Valladolid was eventually relegated to the Segunda División. === Return to Atletico Madrid === Costa returned to Atletico in June 2010 for an undisclosed fee. Since then, Costa has made a superb 94 league appearances and 43 league goals during his 4 year spell with the club. In his time, he suffered with a few injuries during his time. This include his hamstring injury he suffered near to the end of the 2013-14 La Liga season. === Chelsea === On 1 July 2014, it was announced that Chelsea had agreed a fee with Atletico to sign Costa for a fee of £32 million. He made his first league appearance against Burnley in a game which he scored in for Chelsea to win 3–1. ==Career statistics== ===Club=== Club Season League National cup League cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Penafiel (loan) 2006–07 Liga de Honra 13 5 1 0 — — — 14 5 Braga (loan) 2006–07 Primeira Liga 6 0 1 0 — 2 1 — 9 1 Celta Vigo (loan) 2007–08 Segunda División 30 6 1 0 — — — 31 6 Albacete (loan) 2008–09 Segunda División 35 10 1 0 — — — 36 10 Valladolid 2009–10 La Liga 34 8 2 1 — — — 36 9 Atlético Madrid 2010–11 La Liga 28 6 5 1 — 6 1 — 39 8 2012–13 La Liga 31 10 8 8 — 5 2 — 44 20 2013–14 La Liga 35 27 6 1 — 9 8 2 0 52 36 Total 94 43 19 10 — 20 11 2 0 135 64 Rayo Vallecano (loan) 2011–12 La Liga 16 10 0 0 — — — 16 10 Chelsea 2014–15 Premier League 26 20 1 0 3 1 7 0 — 37 21 2015–16 Premier League 28 12 4 2 1 0 8 2 — 41 16 2016–17 Premier League 35 20 5 2 2 0 — — 42 22 2017–18 Premier League 0 0 0 0 0 0 0 0 0 0 0 0 Total 89 52 10 4 6 1 15 2 — 120 59 Atlético Madrid 2017–18 La Liga 15 3 3 2 — 5 2 — 23 7 2018–19 La Liga 16 2 0 0 — 4 1 1 2 21 5 2019–20 La Liga 23 5 0 0 — 7 0 0 0 30 5 2020–21 La Liga 7 2 0 0 — 0 0 — 7 2 Total 61 12 3 2 — 16 3 1 2 81 19 155 55 22 12 — 36 14 3 2 216 83 Atlético Mineiro 2021 Série A 15 4 3 1 — 1 0 — 19 5 Wolverhampton Wanderers 2022–23 Premier League 23 1 1 0 1 0 — — 25 1 Botafogo 2023 Série A 13 3 0 0 — 2 0 — 15 3 Grêmio 2024 Série A 1 0 0 0 — 1 0 6 6 8 6 Career total 430 154 42 18 7 1 57 17 9 8 543 198 ===International=== Appearances and goals by national team and year National team Year Apps Goals Brazil 2013 2 0 Total 2 0 Spain 2014 7 1 2015 3 0 2016 4 3 2017 2 2 2018 8 4 Total 24 10 Career total 26 10 :As of match played 20 June 2018. Spain score listed first, score column indicates score after each Costa goal. International goals by date, venue, cap, opponent, score, result and competition No. Date Venue Cap Opponent Score Result Competition 1 12 October 2014 Stade Josy Barthel, Luxembourg City, Luxembourg 7 3–0 4–0 UEFA Euro 2016 qualification 2 5 September 2016 Estadio Reino de León, León, Spain 12 rowspan=2 3 5 September 2016 Estadio Reino de León, León, Spain 12 5–0 4 9 October 2016 Loro Boriçi Stadium, Shkodër, Albania 14 1–0 2–0 2018 FIFA World Cup qualification 5 24 March 2017 El Molinón, Gijón, Spain 15 3–0 4–1 2018 FIFA World Cup qualification 6 11 June 2017 Philip II Arena, Skopje, Macedonia 16 2–0 2–1 2018 FIFA World Cup qualification 7 27 March 2018 Wanda Metropolitano, Madrid, Spain 18 1–0 6–1 Friendly 8 15 June 2018 Fisht Olympic Stadium, Sochi, Russia 21 rowspan=2 9 15 June 2018 Fisht Olympic Stadium, Sochi, Russia 21 2–2 10 20 June 2018 Kazan Arena, Kazan, Russia 22 1–0 1–0 2018 FIFA World Cup == Honours == Atlético Madrid *La Liga: 2013–14, 2020–21 *Copa del Rey: 2012–13 *UEFA Champions League runner-up: 2013–14 *UEFA Europa League: 2017–18 *UEFA Super Cup: 2010, 2012, 2018 Chelsea *Premier League: 2014–15, 2016–17 *FA Cup runner-up: 2016–17 *Football League Cup: 2014–15 Atlético Mineiro * Campeonato Brasileiro Série A: 2021 * Copa do Brasil: 2021 Grêmio * Campeonato Gaúcho: 2024 Individual *La Liga Player of the Month: September 2013 *La Liga Team of the Season: 2013–14 *Trofeo EFE: 2013–14 *UEFA Champions League Team of the Season: 2013–14 *Zarra Trophy: 2013–14 *Premier League Player of the Month: August 2014, November 2016 *PFA Team of the Year: 2014–15 Premier League Records *Fastest goal in the UEFA Super Cup: 2018 (49 seconds in against Real Madrid) == International career == During his international career, he started with the Brazilian National Team in 2013. He only made 2 appearances with no goals. But controversy was created when Costa was granted a Spanish citizenship in 2014. Then, Costa adopted Spain as his national side. He made his debut against Italy on the 5 March 2014. Spain won 1–0. Costa was called- up to play for Spain in the 2014 FIFA World Cup. He started for both of the first two games of Spain's tournament against the Netherlands and Chile, but was rested against Australia. Spain lost 5–1 against Holland And 2–0 against Chile. They did win 3–0 against Australia in their final group game, but it wasn't enough to keep them to progress into the knock out phases. Costa is still yet to score a goal for Spain during his time playing as a striker for the national side. == References == Category:1988 births Category:Living people Category:Chelsea F.C. players Category:Footballers from Sergipe Category:Premier League players Category:Spanish footballers Category:Wolverhampton Wanderers F.C. players Category:2014 FIFA World Cup players Category:2018 FIFA World Cup players",
 "title": "Diego Costa"
}