{
 "id": "437404",
 "text": "This is the title history of the WWE Intercontinental Championship. The title was introduced in 1979 when Pat Patterson was awarded the championship he won a fictional tournament in Rio de Janeiro, Brazil. In total, there have been 91 distinct championship holders as of . The wrestler with the most reigns as Intercontinental Champion is Chris Jericho with 9. The longest reigning Intercontinental Champion is Gunther. The current champion is Dominik Mysterio, who is in his first reign. == Title history == No. Champion Reign Date Days held Location Event Notes Ref. 1 Pat Patterson 1 Rio de Janeiro, Brazil — Patterson became the first champion as a result of defeating Ted DiBiase to win the WWF North American Heavyweight Championship on June 19, 1979 in Allentown, PA, and defeating Johnny Rodz in a fictional tournament final in Rio de Janeiro, Brazil. 2 Ken Patera 1 New York, NY WWF on MSG Network 3 Pedro Morales 1 WWF Became the first Triple Crown Champion as a result of this win. 4 Don Muraco 1 Philadelphia, PA WWF on PRISM Network 5 Pedro Morales 2 New York, NY WWF on MSG Network 6 Don Muraco 2 During his reign, the WWF left the National Wrestling Alliance (NWA). 7 Tito Santana 1 Boston, MA WWF 8 Greg Valentine 1 London, ON, Canada Maple Leaf Wrestling Aired on October 13, 1984 on tape delay. 9 Tito Santana 2 Baltimore, MD House show This was a steel cage match. 10 Randy Savage 1 Boston, MA WWF on NESN 11 Ricky Steamboat 1 Pontiac, MI WrestleMania III 12 The Honky Tonk Man 1 Buffalo, NY Superstars of Wrestling Aired on June 13, 1987 on tape delay. 13 The Ultimate Warrior 1 New York, NY SummerSlam 14 Rick Rude 1 Atlantic City, NJ WrestleMania V 15 The Ultimate Warrior 2 East Rutherford, NJ SummerSlam — Vacated — — Syracuse, NY Wrestling Challenge Warrior gave up the title to focus on defending the WWF Championship. WWE lists April 1, 1990, the day of Warrior's title win at WrestleMania VI, as the date the title was vacated. 16 Mr. Perfect 1 Austin, TX Superstars of Wrestling Defeated Tito Santana in a tournament final. Aired on May 19, 1990 on tape delay. 17 The Texas Tornado 1 Philadelphia, PA SummerSlam 18 Mr. Perfect 2 Rochester, NY Superstars of Wrestling Aired on December 15, 1990 on tape delay. 19 Bret Hart 1 New York, NY SummerSlam 20 The Mountie 1 Springfield, MA House show 21 Roddy Piper 1 Albany, NY Royal Rumble 22 Bret Hart 2 Indianapolis, IN WrestleMania VIII 23 The British Bulldog 1 London, England SummerSlam 24 Shawn Michaels 1 Terre Haute, IN Saturday Night's Main Event Aired on the November 14, 1992 edition on tape delay. 25 Marty Jannetty 1 New York, NY Raw 26 Shawn Michaels 2 Albany, NY House show — Vacated — — — — Michaels was stripped of the title for failing to defend it within 30 days. In reality, Michaels was suspended for testing positive for steroids. .; DVD Heartbreak & Triumph: The Shawn Michaels Story. 27 Razor Ramon 1 New Haven, CT Raw Ramon and Rick Martel were the final two participants in a battle royal, in which the last two would face off the next week for the vacant title; Ramon won the match which aired October 11, 1993 on tape delay. Shawn Michaels returned in November 1993, saying he was the legitimate champion as nobody defeated him for the title (though not recognized as such by WWF). Ramon went on to defeat Michaels in a ladder match on March 20, 1994 at WrestleMania X to become undisputed champion. 28 Diesel 1 Rochester, NY WWF Superstars of Wrestling Aired on April 30, 1994 on tape delay. 29 Razor Ramon 2 Chicago, IL SummerSlam 30 Jeff Jarrett 1 Tampa, FL Royal Rumble – Bob Holly † <1 Moline, IL WWF Action Zone Defeated Jarrett to win the title. Later that night, it was judged that Jarrett's foot had been on the rope during the pinfall, and Holly was stripped of the Intercontinental Championship. This reign is no longer recognized by WWE. — Vacated — — Held up when match between Jarrett and Holly ended controversially. 31 Jeff Jarrett 2 Moline, IL WWF Action Zone Defeated Bob Holly in a rematch for the vacant title. 32 Razor Ramon 3 Montreal, QC, Canada House show This was a ladder match. WWE lists the end of Ramon's reign on May 22, 1995. 33 Jeff Jarrett 3 Trois-Rivières, QC, Canada WWE lists the start of Jarrett's reign on May 22, 1995. 34 Shawn Michaels 3 Nashville, TN In Your House 2: The Lumberjacks 35 Dean Douglas 1 <1 Winnipeg, MB, Canada In Your House 4: Great White North Douglas won the title by forfeit because Michaels was attacked outside a nightclub in Syracuse, NY on October 14, 1995. This is the title's shortest reign to date, lasting 14 minutes. 36 Razor Ramon 4 91 37 Goldust 1 Fresno, CA Royal Rumble WWE lists the end of Goldust's reign on March 25, 1996. — Vacated — — San Bernardino, CA Raw Held up when a title defense against Savio Vega ends in a no contest. Aired April 15, 1996 on tape delay. 38 Goldust 2 San Bernardino, CA Raw Defeated Savio Vega in a rematch. Aired April 22, 1996 on tape delay. 39 Ahmed Johnson 1 Milwaukee, WI King of the Ring WWE lists the end of Johnson's reign on August 19, 1996. — Vacated — — Seattle, WA Raw Johnson gave up the title after being attacked by the debuting Faarooq after winning an 11-man battle royal. 40 Marc Mero 1 Hershey, PA Raw Defeated Faarooq in a tournament final. 41 Hunter Hearst Helmsley 1 Fort Wayne, IN 42 Rocky Maivia 1 Lowell, MA 43 Owen Hart 1 Omaha, NE Raw is War 44 Steve Austin 1 East Rutherford, NJ SummerSlam WWE mistakenly lists the end of Austin's reign on October 5, 1997 (lasting 63 days). — Vacated — — — — Vacated because of a neck injury that Austin suffered when he won the title. 45 Owen Hart 2 St. Louis, MO Bad Blood: In Your House Defeated Faarooq in a tournament final for the vacant championship. 46 Steve Austin 2 Montreal, QC Survivor Series 47 The Rock 2 Portland, ME Raw is War Austin handed the title to The Rock, who was formerly known as Rocky Maivia. 48 Triple H 2 New York, NY SummerSlam This was a Ladder match. Triple H was formerly known as Hunter Hearst Helmsley. WWE mistakenly lists the end of Triple H's reign on October 12, 1998 (lasting 43 days). — Vacated — — — — Vacated because of a knee injury. 49 Ken Shamrock 1 Uniondale, NY Raw is War Defeated X-Pac in a tournament final for the vacant championship. 50 Val Venis 1 Memphis, TN St. Valentine's Day Massacre: In Your House Billy Gunn was the special guest referee. 51 Road Dogg 1 San Jose, CA Raw is War 52 Goldust 3 East Rutherford, NJ 53 The Godfather 1 Detroit, MI 54 Jeff Jarrett 4 Moline, IL WWE lists the start of Jarrett's reign on May 31, 1999, when the match aired on tape delay. Just over a week earlier, Jarrett's tag team partner, the Blue Blazer, was meant to win the title at Over the Edge, but he died after an entrance accident. The title was instead later dropped to his friend and partner, Jarrett, in Owen Hart's memory. 55 Edge 1 Toronto, ON House show 56 Jeff Jarrett 5 Buffalo, NY Fully Loaded WWE lists the end of Jarrett's reign on July 26, 1999. 57 D'Lo Brown 1 Columbus, OH Raw is War This was a Winner Takes All match, which was also for Brown's WWF European Championship. The match aired on August 2, 1999 on tape delay, but WWE lists the start of Brown's reign on July 26, 1999. 58 Jeff Jarrett 6 Minneapolis, MN SummerSlam Jarrett also won the European Championship in the match. The following day, he gave the European title to Mark Henry as a gift for helping him defeat Brown. 59 Chyna 1 Cleveland, OH No Mercy This was a Good Housekeeping match. Chyna became the first and only female Intercontinental Champion. 60 Chris Jericho 1 Sunrise, FL Armageddon — Chris Jericho and Chyna 1† Miami, FL Raw is War On December 28, 1999 (aired December 30, 1999) on SmackDown!, a title match between Chyna and Jericho ended in a double pinfall; as a result they were recognized as co-champions. WWE does not list this period as an official reign but as a vacancy. 61 Chris Jericho 2 New York, NY Royal Rumble Jericho defeated Chyna and Hardcore Holly in a triple threat match to become undisputed champion. 62 Kurt Angle 1 Hartford, CT No Way Out Angle was also European Champion during this time. 63 Chris Benoit 1 Anaheim, CA WrestleMania 2000 Benoit won the first fall of a two-fall Triple Threat Match between Chris Jericho (who Benoit pinned) and Kurt Angle, where both of Angle's championships were on the line. WWE lists the end of Benoit's reign on July 22, 1999 (lasting 49 days). 64 Chris Jericho 3 Richmond, VA SmackDown! WWE lists the start of Jericho's reign on May 4, 2000, when the match aired on tape delay. 65 Chris Benoit 2 Uniondale, NY Raw is War Triple H was the special outside enforcer. 66 Rikishi 1 Memphis, TN SmackDown! WWE lists the start of Rikishi's reign on June 22, 2000, and the end on July 6, 2000. Both matches aired on tape delay. 67 Val Venis 2 Fort Lauderdale, FL WWE lists the start of Venis' reign on July 6, 2000, when the match aired on tape delay. 68 Chyna 2 Raleigh, NC SummerSlam This was a mixed tag team matchbetween the teams of Chyna and Eddie Guerrero and Venis and Trish Stratus, in which the winner of the fall would win the title. Chyna pinned Stratus to win Venis' title. 69 Eddie Guerrero 1 Lexington, KY Raw is War This was a triple threat match, also involving Kurt Angle. WWE lists the end of Guerrero's reign on November 23, 2000, when the match aired on tape delay. 70 Billy Gunn 1 Sunrise, FL SmackDown! WWE lists the start of Gunn's reign on November 23, 2000, when the match aired on tape delay. 71 Chris Benoit 3 Birmingham, AL Armageddon 72 Chris Jericho 4 New Orleans, LA Royal Rumble This was a ladder match. WWE lists the end of Jericho's reign on April 5, 2001, when the match aired on tape delay. 73 Triple H 3 Oklahoma City, OK SmackDown! WWE lists the start of Triple H's reign on April 5, 2001, and the end on April 12, 2001. Both matches aired on tape delay. 74 Jeff Hardy 1 Philadelphia, PA Hardy became the youngest Intercontinental champion to date. WWE lists the start of Hardy's reign on April 12, 2001, when the match aired on tape delay. 75 Triple H 4 Knoxville, TN Raw is War 76 Kane 1 Sacramento, CA Judgment Day This was a chain match. WWE lists the end of Kane's reign on June 28, 2001, when the match aired on tape delay. 77 Albert 1 New York, NY SmackDown This was a no disqualification match. WWE lists the start of Albert's reign on June 28, 2001, when the match aired on tape delay. 78 Lance Storm 1 Buffalo, NY Raw is War 79 Edge 2 San Jose, CA SummerSlam 80 Christian 1 Pittsburgh, PA Unforgiven 81 Edge 3 St. Louis, MO No Mercy This was a ladder match. 82 Test 1 Uniondale, NY Raw 83 Edge 4 Greensboro, NC Survivor Series This title unification match was also for Edge's WCW United States Championship, which then became inactive. 84 William Regal 1 Atlanta, GA Royal Rumble 85 Rob Van Dam 1 Toronto, ON, Canada WrestleMania X8 On March 25, 2002, the championship became exclusive to the Raw brand when Van Dam was drafted there as part of the 2002 WWE Draft. 86 Eddie Guerrero 2 Kansas City, MO Backlash The title was renamed the WWE Intercontinental Championship on May 6, 2002 after World Wrestling Federation Entertainment, Inc. settled a lawsuit with the World Wide Fund for Nature, and it became simply World Wrestling Entertainment. 87 Rob Van Dam 2 Edmonton, AB, Canada Raw This was a ladder match. On July 22, 2002, Van Dam defeated Jeff Hardy in a title unification match to also win his WWE European Championship, which was then retired. 88 Chris Benoit 4 Greensboro, NC The title became exclusive to SmackDown when Benoit went to the SmackDown brand on July 30 (aired August 1). WWE mistakenly lists the end of Benoit's reign on August 26, 2002. 89 Rob Van Dam 3 Uniondale, NY SummerSlam The title returned to the Raw brand because of Van Dam's status as a Raw superstar. The following night on Raw, Van Dam defeated Tommy Dreamer in a title unification match to also win his WWE Hardcore Championship, which was then retired. WWE mistakenly lists the start of Van Dam's reign on August 6, 2002 (lasting 40 days). 90 Chris Jericho 5 Denver, CO Raw 91 Kane 2 Houston, TX 92 Triple H 5 <1 North Little Rock, AR No Mercy This was a unification match to unify the Intercontinental Championship into the World Heavyweight Championship. — Unified — — North Little Rock, AR No Mercy Unified with Triple H's World Heavyweight Championship.The Intercontinental Championship became inactive. 93 Christian 2 Charlotte, NC Judgment Day Won a battle royal also involving Booker T, Val Venis, Chris Jericho, Goldust, Test, Lance Storm, Kane and Rob Van Dam to win the vacant title, which was reactivated by Raw Co-General Manager Stone Cold Steve Austin. 94 Booker T 1 Montreal, QC, Canada Raw 95 Christian 3 Des Moines, IA House show 96 Rob Van Dam 4 Rosemont, IL Raw This was a ladder match. 97 Chris Jericho 6 <1 Fayetteville, NC 98 Rob Van Dam 5 This was a steel cage match. 99 Randy Orton 1 Orlando, FL Armageddon Mick Foley was the special guest referee. 100 Edge 5 Hartford, CT Vengeance — Vacated — — Wichita Falls, TX Raw Vacated because of a groin injury. 101 Chris Jericho 7 Portland, OR Unforgiven Defeated Christian in a ladder match to win the vacant title. 102 Shelton Benjamin 1 Milwaukee, WI Taboo Tuesday Benjamin was voted into this match. 103 Carlito 1 Phoenix, AZ Raw WWE mistakenly lists the end of Carlito's reign on September 19, 2005. 104 Ric Flair 1 Oklahoma City, OK Unforgiven Flair became the oldest Intercontinental champion to date. WWE mistakenly lists the start of Flair's reign on September 19, 2005 (lasting 153 days). 105 Shelton Benjamin 2 Trenton, NJ Raw 106 Rob Van Dam 6 Lexington, KY Backlash This was a Winner Takes All match, which was also for Van Dam's Money in the Bank contract. 107 Shelton Benjamin 3 Lubbock, TX Raw This was a 3-on-2 Handicap Texas Tornado match featuring Benjamin, Chris Masters and Triple H against WWE Champion John Cena and Rob Van Dam, in which anyone who beat Cena or Van Dam would win their respective title. Benjamin pinned Van Dam to win the Intercontinental title. 108 Johnny Nitro 1 Charlotte, NC Vengeance This was a triple threat match, also involving Carlito. 109 Jeff Hardy 2 Topeka, KS Raw 110 Johnny Nitro 2 Columbus, OH This was a no disqualification match. 111 Jeff Hardy 3 Manchester, England 112 Umaga 1 Bakersfield, CA 113 Santino Marella 1 Milan, Italy This was a No Holds Barred match, Marella was \"picked out of the audience\" by Mr. McMahon. 114 Umaga 2 Dallas, TX WWE lists the end of Umaga's reign on September 3, 2007, when the match aired on tape delay. 115 Jeff Hardy 4 Columbus, OH WWE lists the start of Hardy's reign on September 3, 2007, when the match aired on tape delay. 116 Chris Jericho 8 Milwaukee, WI 117 Kofi Kingston 1 Dallas, TX Night of Champions 118 Santino Marella 2 Indianapolis, IN SummerSlam This was a mixed tag team match in which both the Intercontinental and Women's Championships were on the line. The title was won when partner Beth Phoenix pinned Mickie James. 119 William Regal 2 Manchester, England Raw 120 CM Punk 1 Rosemont, IL This was a no- disqualification match. 121 John \"Bradshaw\" Layfield 1 Jacksonville, FL 122 Rey Mysterio 1 Houston, TX WrestleMania XXV On April 13, 2009, the title became exclusive to the SmackDown brand for the first time, when Mysterio was drafted there as part of the 2009 WWE Draft. 123 Chris Jericho 9 New Orleans, LA Extreme Rules This was a No Holds Barred match. Jericho became a record nine-time champion. 124 Rey Mysterio 2 Sacramento, CA The Bash This was a Mask vs. Title match. WWE lists the end of Mysterio's reign on September 4, 2009, when the match aired on tape delay. 125 John Morrison 3 Cleveland, OH SmackDown WWE lists the start of Morrison's reign on September 4, 2009, when the match aired on tape delay. John Morrison was formerly known as Johnny Nitro. 126 Drew McIntyre 1 San Antonio, TX TLC: Tables, Ladders & Chairs On May 7, 2010 Theodore Long suspended McIntyre and vacated the title. The following week on SmackDown, Kofi Kingston won a tournament to crown a new champion, but Mr. McMahon reversed Long's decision. The vacancy of the title and Kingston's championship win are not listed by WWE, and WWE continued to recognize McIntyre as champion during this time. 127 Kofi Kingston 2 Detroit, MI Over the Limit WWE lists the end of Kingston's reign on August 6, 2010, when the match aired on tape delay. 128 Dolph Ziggler 1 Laredo, TX SmackDown WWE lists the start of Ziggler's reign on August 6, 2010, and the end on January 7, 2011. Both matches aired on tape delay. 129 Kofi Kingston 3 Tucson, AZ WWE lists the start of Kingston's reign on January 7, 2011, and the end on March 25, 2011. Both matches aired on tape delay. 130 Wade Barrett 1 Columbus, OH WWE lists the start of Barrett's reign on March 25, 2011, when the match aired on tape delay. 131 Ezekiel Jackson 1 Washington, D.C. Capitol Punishment WWE lists the end of Jackson's reign on August 12, 2011, when the match aired on tape delay. 132 Cody Rhodes 1 Sacramento, CA SmackDown WWE lists the start of Rhodes' reign on August 12, 2011, when the match aired on tape delay. On August 29, 2011, the brand extension ended, allowing the championship to be defended on both the Raw and SmackDown brands. 133 Big Show 1 Miami Gardens, FL WrestleMania XXVIII 134 Cody Rhodes 2 Rosemont, IL Extreme Rules This was a tables match. 135 Christian 4 Raleigh, NC Over the Limit 136 The Miz 1 St. Louis, MO Raw 1000 137 Kofi Kingston 4 Memphis, TN Main Event WWE lists the start of Kingston's reign on October 17, 2012, and the end on December 31, 2012. Both matches aired on tape delay. 138 Wade Barrett 2 Washington, D.C. Raw WWE lists the start of Jackson's reign on December 31, 2012, when the match aired on tape delay. 139 The Miz 2 East Rutherford, NJ WrestleMania 29 Match aired live on YouTube and WWE.com as part of the WrestleMania 29 pre-show. 140 Wade Barrett 3 Raw 141 Curtis Axel 1 Rosemont, IL Payback This was a Triple Threat match, also involving The Miz. 142 Big E Langston 1 Nashville, TN Raw On February 12, 2014, Big E Langston's ring name was shortened to \"Big E\". 143 Bad News Barrett 4 East Rutherford, NJ Extreme Rules Bad News Barrett was formerly known as Wade Barrett. — Vacated — — Hartford, CT Raw The title was vacated because of a shoulder injury. 144 The Miz 3 Tampa, FL Battleground This was a 19-man battle royal. The Miz last eliminated Dolph Ziggler to win the vacant title. 145 Dolph Ziggler 2 Los Angeles, CA SummerSlam 146 The Miz 4 Nashville, TN Night of Champions 147 Dolph Ziggler 3 Memphis, TN Raw 148 Luke Harper 1 Roanoke, VA 149 Dolph Ziggler 4 Cleveland, OH TLC: Tables, Ladders and Chairs This was a ladder match. 150 Bad News Barrett 5 Corpus Christi, TX Raw Ziggler defeated Barrett in a singles match, but The Authority's Director of Operations Kane restarted the match as a 2-out-of-3 falls match, which Barrett won. 151 Daniel Bryan 1 Santa Clara, CA WrestleMania 31 This was a seven-man ladder match, also involving Dean Ambrose, Dolph Ziggler, Luke Harper, R-Truth, and Stardust. — Vacated — — Cincinnati, OH Raw The title was vacated because Bryan suffered a concussion. 152 Ryback 1 112 Corpus Christi, TX Elimination Chamber This was an Elimination Chamber match, also involving Sheamus, Dolph Ziggler, Mark Henry, R-Truth, and King Barrett. Ryback pinned Sheamus to win the vacant title. 153 Kevin Owens 1 September 20, 2015 84 Houston, TX Night of Champions 154 Dean Ambrose 1 December 13, 2015 64 Boston, MA TLC: Tables, Ladders & Chairs 155 Kevin Owens 2 February 15, 2016 48 Anaheim, CA Raw This was a Fatal Five-Way match, also involving Tyler Breeze, Dolph Ziggler and Stardust. 156 Zack Ryder 1 April 3, 2016 1 Arlington, TX WrestleMania 32 This was a seven-man ladder match, also involving The Miz, Stardust, Dolph Ziggler, Sin Cara and Sami Zayn. 157 The Miz 5 April 4, 2016 188 Dallas, TX Raw On July 19, 2016, the brand extension returned and the title became exclusive to the SmackDown brand following the 2016 WWE Draft. 158 Dolph Ziggler 5 October 9, 2016 37 Sacramento, CA No Mercy This was a title vs. career match. Had Zigger lost, he would have been forced to retire from in-ring competition. 159 The Miz 6 November 15, 2016 49 Wilkes-Barre, PA SmackDown This was the 900th episode of SmackDown. 160 Dean Ambrose 2 January 3, 2017 152 Jacksonville, FL On April 10, 2017, the title became exclusive to the Raw brand when Ambrose was drafted there as part of the 2017 WWE Superstar Shake-up. 161 The Miz 7 June 4, 2017 169 Baltimore, MD Extreme Rules Had Ambrose been disqualified, he would have lost the title. 162 Roman Reigns 1 November 20, 2017 63 Houston, TX Raw 163 The Miz 8 January 22, 2018 83 Brooklyn, NY Raw 25 Years 164 Seth Rollins 1 April 8, 2018 72 New Orleans, LA WrestleMania 34 This was a Triple Threat match, also involving Finn Bálor. 165 Dolph Ziggler 6 June 18, 2018 61 Grand Rapids, MI Raw 166 Seth Rollins 2 August 19, 2018 119 Brooklyn, NY SummerSlam 167 Dean Ambrose 3 December 16, 2018 29 San Jose, CA TLC: Tables, Ladders & Chairs 168 Bobby Lashley 1 January 14, 2019 34 Memphis, TN Raw This was a Triple Threat match, also involving Seth Rollins 169 Finn Bálor 1 February 17, 2019 22 Houston, TX Elimination Chamber This was a 2-on-1 Handicap match, also involving Lio Rush. Bálor pinned Rush to win the title. 170 Bobby Lashley 2 March 11, 2019 27 Pittsburgh, PA Raw 171 Finn Bálor 2 April 7, 2019 98 East Rutherford, NJ WrestleMania 35 On April 16, 2019, the title became exclusive to the SmackDown brand when Bálor was drafted there as part of the 2019 WWE Superstar Shake-up. 172 Shinsuke Nakamura 1 July 14, 2019 201 Philadelphia, PA Extreme Rules 173 Braun Strowman 1 January 31, 2020 37 Tulsa, OK SmackDown 174 Sami Zayn 1 March 8, 2020 Philadelphia, PA Elimination Chamber This was a 3-on-1 Handicap match, also involving Shinsuke Nakamura and Cesaro who teamed with Zayn. Zayn pinned Braun Strowman to win the title. — Vacated — May 12, 2020 — — — Zayn was stripped of the title after choosing not to compete during the COVID-19 pandemic. In storyline, he said that he was still be the champion, and continued to carry around his copy of the belt after his return in August. 175 AJ Styles 1 June 8, 2020 74 Orlando, FL SmackDown Defeated Daniel Bryan in a tournament final for the vacant title. WWE lists the start of Styles' reign on June 12, 2020, when the match aired on tape delay. WWE incorrectly lists Styles' reign as lasting 71 days, ending on August 22, 2020. 176 Jeff Hardy 5 August 21, 2020 37 177 Sami Zayn 2 September 27, 2020 86 Clash of Champions This was a triple threat ladder match also involving AJ Styles in which the winner had to retrieve both Hardy's belt and Zayn's belt to become the undisputed champion. WWE lists the end of Zayn's reign on December 25, 2020, when the following episode aired on tape delay. 178 Big E 2 December 22, 2020 110 St. Petersburg, FL SmackDown WWE lists the start of Big E's reign on December 25, 2020, when the match aired on tape delay. 179 Apollo Crews 1 April 11, 2021 124 Tampa, FL WrestleMania 37 This was a Nigerian Drum Fight. 180 King/Shinsuke Nakamura 2 August 13, 2021 182 Tulsa, OK SmackDown King Nakamura was renamed back to Shinsuke Nakamura on October 8, 2021. WWE lists the end of Nakamura's reign on February 18, 2022, when the following episode aired on tape delay. 181 Sami Zayn 3 February 11, 2022 21 New Orleans, LA WWE lists the start of Zayn's reign on February 18, 2022, when the match aired on tape delay. 182 Ricochet 1 March 4, 2022 98 Miami, FL 183 Gunther 1 June 10, 2022 666 Baton Rouge, LA This is the title's longest reign to date. On April 28, 2023, the championship became exclusive to the Raw brand when Gunther was drafted there as part of the 2023 WWE Draft. 184 Sami Zayn 4 April 6, 2024 119 Philadelphia, PA WrestleMania XL 185 Bron Breakker 1 August 3, 2024 Cleveland, OH SummerSlam 186 Jey Uso 1 Ontario, CA Raw 187 Bron Breakker 2 Philadelphia, PA 188 Dominik Mysterio 1 Paradise, NV WrestleMania 41 This was a Fatal four-way match, also involving Penta and Finn Bálor, whom Mysterio pinned. == Combined reigns == :As of , . † Is the current champion Rank Wrestler No. of reigns Combined days Combined days rec. by WWE 1 1 666 2 2 619 617 3 8 597 592 4 2 541 539 5 1 454 453 6 2 443 441 7 4 437 434 8 2 434 432 9 1 414 413 10 2 406 404 10 3 406 403 12 5 397 390 13 2 383 390 14 6 372 341 15 5 366 359 16 3 354 352 17 2 339 337 18 9 318 311 19 6 298 284 20 2 290 288 21 1 285 284 22 2 277 272 23 4 291 286 24 4 266 272 25 2 257 254 26 3 245 242 27 1 233 232 28 2 232 29 1 231 230 30 6 211 224 31 1 210 209 32 3 209 203 33 5 196 34 4 192 188 35 2 190 190 36 5 171 166 37 3 168 158 38 2 162 160 39 1 161 160 40 1 155 155 40 1 155 153 42 1 148 147 43 4 142 159 44 1 138 137 45 2 132 131 45 2 132 130 47 2 128 129 48 2 126 124 49 1 125 124 50 1 124 123 51 2 120 118 52 2 118 119 53 2 114 116 54 1 112 111 55 1 98 98 56 1 90 90 57 1 84 83 58 2 83 79 59 1 77 76 60 1 74 71 61 2 65 91 61 1 65 64 63 2 64 62 64 1 63 62 65 2 61 60 66 1 59 58 67 2 57 58 68 1 51 53 69 1 50 57 70 1 49 48 71 1 43 1 43 42 73 1 37 36 74 1 35 34 75 1 34 33 76 1 76 1 28 27 76 1 28 27 79 1 27 24 79 1 27 26 79 1 27 26 79 1 27 26 83 1 26 27 84 1 20 20 85 1 19 17 86 1 14 13 1 14 13 88 1 13 12 89 † 1 + 90 1 2 1 91 1 1 92 1 <1 <1 == References == == Other websites == * WWE Intercontinental Title History Category:Lists of professional wrestlers Category:World Wrestling Entertainment championships",
 "title": "List of WWE Intercontinental Champions"
}