{
 "id": "43744",
 "text": "The 1936 Summer Olympics () was a sporting event. They were officially called as the Games of the XI Olympiad. They were branded as Berlin 1936. The Olympics were from 1 to 16 August 1936. They took place in Berlin, Nazi Germany.Sports Reference.com (SR/Olympics), \"1936 Berlin Summer Games\" ; retrieved 2012-7-24. The 1932 Los Angeles games were very successful. Nazi Germany wanted to have a more successful Olympic Games than in 1932. Adolf Hitler built a new track and field stadium. The stadium had seats for 100,000. Hitler also built 6 gymnasiums. They also built other, smaller arenas. The Games were the first to be on TV. There were radio broadcasts to 41 different countries.Rader, Benjamin G. \"American Sports: From the Age of Folk Games to the Age of Televised Sports\", 5th ed. Leni Riefenstahl was paid by the German Olympic Committee to show the Games for $7 million. She made a movie about the Olympics. This movie was called Olympia. It was important in techniques seen in making sports videos now. Hitler used the 1936 Games to promote the Nazi government, racial supremacy, and antisemitism. The Nazi Party newspaper said that Jewish people should not allowed to be in the Olympic games.Nagorski, Andrew. Hitlerland: American Eyewitnesses to the Nazi Rise to Power. New York: Simon and Schuster, 2012, p. 188.David Clay Large, Nazi Games: The Olympics of 1936, p. 58. German Jewish people were not allowed to be athletes in the games. However, some Jewish female swimmers from the Hakoah Vienna sports club were in the games. Some Jewish athletes from other countries were not allowed to compete, either. This is because their countries did not want to offend the Nazis. Lithuania was not allowed to be in the Olympics because they were very anti-Nazi. The games were thought to be successful. The costs of the games was mostly paid for by the German government.Zarnowski, C. Frank. \"A Look at Olympic Costs,\" Citius, Altius, Fortius (US). Summer 1992, Vol. 1, Issue 1, pp. 21-22 [6-7 of 17 PDF]; retrieved 2012-7-24. The Germans earned 7.5million Reichsmark from the tickets. (€ in ). This gave the Nazis a profit of over one million R.M. During World War II, there were no Olympics for 12 years. The next Olympic Games were in 1948 in St. Moritz, Switzerland. The next Summer Games were in London, England. == Games == === Opening ceremony === The opening ceremony was in the Berlin Olympic Stadium on 1 August 1936. The Hindenburg showed the Olympic flag. Adolf Hitler and Henri de Baillet-Latour went into the stadium. After that, the parade of nations started. Each nation had their own costume. Since Greece was the origin of the Ancient Olympics, they went into the stadium first. Germany went into the stadium last. Many athletes gave the Nazi salute as they passed Hitler. Some people gave Hitler the Olympic salute. The Olympic salute looked like the Nazi salute, but with the arm raised higher. United States, India, and China put their hats over their hearts. All countries lowered their flags as the passed Hitler. The only countries that did not do this were the United States, the United Kingdom, Switzerland, and the Commonwealth of the Philippines. Thomas Wolfe was at the event. He said that the event was almost religious. He also said the crowd screamed and cheered for Hitler.Jesse Owens. TV documentary. WGBH Educational Foundation. 2012. Presented on YLE TV 1, 9 July 2014. The German Olympic Committee's president gave a speech. Hitler then said that the Olympic games were open. Hitler said this from his own box in the stadium. The Olympic flame was first used in the 1928 Summer Olympics in Amsterdam. However, this was the first time they used the torch in a relay. The Nazis invented running the torch from ancient Olympia to the host city. The \"torch bearer\", or the person who ran with the torch, ran to the top of the stadium. There, he lit a cauldron. This would light the torch for the rest of the games. Not everything wet to plan. According to Louis Zamperini, an American athlete, there was an issue with the pigeons. He said that the Germans released 25,000 pigeons. Right after that, they had shot a cannon. This scared the poop out of the pigeons. === Events === There were 129 events. There were 25 sports disciplines. These 25 disciplines made 19 different sports. The number of events in each discipline is shown in parentheses. * Aquatics ** ** ** * * * * * ** Road (2) ** Track (4) * ** Dressage (2) ** Eventing (2) ** Show jumping (2) * * * * * * * * * * * * ** Freestyle (7) ** Greco-Roman (7) This was the first time that Basketball, canoeing and handball were in the Olympics. Handball was not in the Summer Olympics until Munich in 1972. There were two demonstration sports: baseball and gliding. There were also art competitions for medals. In the closing ceremony, there were medals given for alpinism and aeronautics feats. There were also Indian sports,Nag, Utathya (14 April 2022). \"Kho Kho, a kabaddi-like sport linked with Indian epic Mahabharata - know all about it\". Olympics.com wushu and motor racing. == Participating nations == A total of 49 nations sent athletes to compete at the Berlin games.Taking part in the games for the first time were Afghanistan, Bermuda, Bolivia, Costa Rica, Liechtenstein and Peru. * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ==Medals== These are the 12 nations that won the most medals at the 1936 Games. ==Gallery== File:Olympic Fire in Berlin 1936.jpg|The Olympic Fire in Berlin File:Unter den Linden, jobbra a Staatsbibliothek, háttérben a Brandenburgi kapu. Fortepan 17439.jpg|German symbols and Nazi swastika File:Olimpiai Stadion, a női magasugrás eredményhirdetése (1. Csák Ibolya, Magyarország). Fortepan 17417.jpg|Spectators giving the Nazi salute during a medal ceremonies File:Olympic bell Berlin.JPG|Olympic Bell File:Tableau Résultats JO 1936-1.JPG|Results Table 1 File:Tableau Résultats JO 1936-2.JPG|Results Table 2 ==Related pages== * Olympic football tournament 1936 (Austria) * Jesse Owens ==References == ==Further reading== * Barry, James P. The Berlin Olympics. World Focus Books. * Grix, Jonathan, and Barrie Houlihan. \"Sports mega-events as part of a nation's soft power strategy: The cases of Germany (2006) and the UK (2012).\" British journal of politics and international relations 16.4 (2014): 572–596. online * Hilton, Christopher. Hitler's Olympics: The 1936 Berlin Olympic Games. (2006) * Krüger, Arnd. The Nazi Olympics of 1936, in Kevin Young and Kevin B. Wamsley (eds.), Global Olympics: Historical and Sociological Studies of the Modern Games. Oxford: Elsevier 2005; pp. 43–58. * Krüger, Arnd, and William Murray (eds.), The Nazi Olympics: Sport, Politics and Appeasement in the 1930s. (Univ. of Illinois Press 2003). * Lehrer, Steven. Hitler Sites: A City-by-city Guidebook (Austria, Germany, France, United States). McFarland, 2002. * Large, David Clay. Nazi games: the Olympics of 1936 (WW Norton & Company, 2007). * Mandell, Richard D. The Nazi Olympics (University of Illinois Press, 1971). * Rippon, Anton. Hitler's Games: The 1936 Olympics. (2012) excerpt * Socolow, Michael J. Six Minutes in Berlin: Broadcast Spectacle and Rowing Gold at the Nazi Olympics. Urbana, IL: University of Illinois Press, 2016. * Walters, Guy, Berlin Games – How Hitler Stole the Olympic Dream. (2006) excerpt ==Other websites== * * Complete official IOC report. Part I * Complete official IOC report. Part II * United States Holocaust Memorial Museum – Online Exhibition: Nazi Olympics: Berlin 1936 * United States Holocaust Memorial Museum – Library Bibliography: 1936 Olympics * Virtual Library: the NAZI Olympics * Die XI. Olympischen Sommerspiele in Berlin 1936 at Lebendiges Museum Online. In German * 1936 Olympics and the Struggle for Influence on C-SPAN * The 1936 Olympic Games in Berlin, Germany * Nazi Games at PBS International Category:Racism Category:1936 in Germany Category:Olympic Games in Germany Category:Sport in Berlin Category:1930s in Berlin",
 "title": "1936 Summer Olympics"
}