{
 "id": "437660",
 "text": "Paul Heyman (born September 11, 1965) is an American professional wrestling manager. He is currently working for WWE. He has also worked as a promoter, commentator, and journalist. He is best known as the owner and creator of Extreme Championship Wrestling (ECW). He also worked in World Championship Wrestling (WCW). ==Career== On the May 7, 2012 episode of Raw, Heyman returned to the WWE as Brock Lesnar's legal advisor. When Lesnar left, Heyman aligned himself with CM Punk on the September 3 episode of Raw when he was seen driving a car which Punk entered. He managed Punk until Money in the Bank when Heyman turned on Punk by smashing him with a ladder while he was climbing up another ladder. He returned on the December 30th edition of Raw and returned to being the manager of Brock Lesnar. On April 6, 2014, Heyman was the manager of Lesnar when Lesnar conquered The Undertaker's undefeated streak at WrestleMania XXX. This was the first loss at WrestleMania. Paul Heyman also became the manager of Cesaro, who revealed himself to be a \"Paul Heyman guy\" on the following episode of Raw. When Roman Reigns returned at SummerSlam 2020, Paul Heyman decided that he was siding with him on the following SmackDown episode. Reigns accepted, but only if Reigns signed the contract and defeated both Bray Wyatt and Braun Strowman in a Triple Threat match for the Universal Championship at Payback, then Paul would be officially Roman Reigns' Special Council or Wise Man. Reigns won the match and the title. To this day, Paul Heyman is still Reigns' Wise Man. On April 5, 2024, Heyman was inducted into the WWE Hall of Fame by Roman Reigns. == Awards and accomplishments == * Inside The Ropes Magazine ** Manager of the Year (2020) * Pro Wrestling Illustrated ** Faction of the Year (2022) – with The Bloodline ** Manager of the Year (1992) * WWE ** WWE Hall of Fame (Class of 2024) ** WWE Year-End Award (1 time) *** Best on the Mic (2018) ** Slammy Award (1 time) *** Mic Drop of the Year (2024) – * Wrestling Observer Newsletter ** Feud of the Year (2023) ** Best Color Commentator (1991) ** Best Booker (1994–1997, 2002) ** Best on Interviews (2013–2014) ** Best Non-Wrestler (2001, 2002, 2004, 2012–2014, 2018, 2019, 2021, 2022, 2024) ** Best Non-Wrestler of the Decade (2010s) ** Best on Interviews of the Decade (2010s) ** Most Disgusting Promotional Tactic (2012) Angle with CM Punk, exploiting Jerry Lawler's real- life heart attack, playing footage of him near death ** Wrestling Observer Newsletter Hall of Fame (Class of 2005) == References == ==Other websites== *WWE profile * Category:1965 births Category:Living people Category:Jewish American sportspeople Category:Professional wrestling announcers Category:Professional wrestling managers and valets Category:Professional wrestling promoters Category:Sportspeople from New York (state) Category:WWE executives Category:WWE Hall of Fame Category:WWE people",
 "title": "Paul Heyman"
}