{
 "id": "437676",
 "text": "Many past and present European monarchies have reserved titles used just by the heir apparent to the throne. The famous example of this is Charles, Prince of Wales, former heir to the British throne.Plantagenet Somerset Fry, The Kings & Queens of England & Scotland (New York: Grove Weidenfeld, 1990), p. 57 Many heir have had “crown prince” as their title. ==Titles in present and former kingdoms== === Present Kingdoms === *Crown Prince of Denmark, used by the heir to the Kingdom of Denmark. **The present heir is Christian, Crown Prince of Denmark. *Crown Prince of Norway, used by the heir to the Kingdom of Norway. **The present heir is Haakon, Crown Prince of Norway. *Crown Prince of Sweden, used by the heir to the Kingdom of Sweden. **The present heir is Victoria, Crown Princess of Sweden who holds the title in her own right. *Duke of Brabant, used by the heir to the Kingdom of Belgium. **The title of Crown Prince of Belgium was also used once but later abandoned after the death of Crown Prince Louis Philippe. **The present heir is Princess Elisabeth, Duchess of Brabant. *Prince of Asturias, used by the heir to the Kingdom of Spain. **In addition, the heir holds the titles of Prince of Viana, Prince of Girona, Duke of Montblanc, Count of Cervera and Lord of Balaguer. **The present heir is Leonor, Princess of Asturias. *Prince of Orange, used by the heir to the Kingdom of the Netherlands. **The present heir is Catharina-Amalia, Princess of Orange. *Prince of Wales, used by the heir to the United Kingdom of Great Britain and Northern Ireland. **In addition, the heir holds the titles of Duke of Cornwall, Duke of Rothesay, Earl of Chester, Earl of Carrick, Baron of Renfrew, Lord of the Isles and Prince and Great Steward of Scotland. **The present heir is William, Prince of Wales. === Former Kingdoms === *Crown Prince of Greece, used by the heir to throne of Greece while the country was a monarchy. **The title Duke of Sparta was used once for Crown Prince Constantine I but abandoned for being contrary to the constitution. *Crown Prince of Hanover, used by the heir to the former Kingdom of Hanover before its annexation by Prussia. *Crown Prince of Prussia & German crown prince, used by the heir to the German Empire. *Dauphin of France, used by the heir to the throne of France while the country was a monarchy. *Duke of Tarnovo, used by the heir to the throne of Bulgaria while the country was a monarchy. *King of the Romans, used by the heir of the Holy Roman Emperor and thus the person expected to rule over the Holy Roman Empire. *Prince of Piedmont/Naples, used by the heir to the throne of Italy while the country was a monarchy. *Prince Royal of Portugal, used by the heir to the throne of Portugal while the country was a monarchy. **The title held by the heir used to be Prince of Brazil, Duke of Braganza. *Tsarevich of Russia, used by the heir to the Russian Empire. ==Titles in present Principalities and Grand Duchies== *Hereditary Prince of Monaco, used by the heir to the Principality of Monaco. *Hereditary Prince of Liechtenstein, used by the heir to the Principality of Liechtenstein. *Hereditary Grand Duke of Luxembourg, used by the heir to the Grand Duchy of Luxembourg. ==Territories prior to unification == === German states === Prior to the unification of Germany, the area was made up of dozens of small principalities such as Duchies and Grand DuchiesJanet Robinson; Joe Robertson, Handbook of Imperial Germany (Bloomington, IN: AuthorHouse, 2009), p. 68 and most of them used the titles of Hereditary Grand Duke or Hereditary Prince [followed by name of state] such as: *His Royal Highness The Hereditary Grand Duke of Hesse, heir to the Grand Duchy of Hesse. *His Royal Highness The Hereditary Grand Duke of Mecklenburg-Schwerin, heir to the Grand Duchy of Mecklenburg-Schwerin. *His Royal Highness The Hereditary Grand Duke of Oldenburg, heir to the Grand Duchy of Oldenburg. *His Royal Highness The Hereditary Prince of Baden, heir to the Grand Duchy of Baden.Jonathan Steinberg, Bismarck: A Life (New York: Oxford University Press, 2011), p. 111 * His Serene Highness The Hereditary Prince of the Palatinate, heir to the Electorate of the Palatinate. * His Serene Highness The Hereditary Prince of Waldeck and Pyrmont, heir to the Principality of Waldeck and Pyrmont. *His Highness The Hereditary Prince of Saxe-Coburg and Gotha, heir to the Duchy of Saxe-Coburg and Gotha. === Italian states === Prior to the unification of Italy, the area was made up of independent Kingdoms, Duchies and Grand Duchies. *Grand Prince of Tuscany, used by the heir to the Grand Duchy of Tuscany. *Hereditary Prince of Naples, used by the heir to the Kingdom of Naples. **After the unification with Sicily in 1825, the title Duke of Calabria was used by the heir to the throne. *Hereditary Prince of Modena, used by the heir to the Duchy of Modena. *Hereditary Prince of Parma, used by the heir to the Duchy of Parma. *Prince of Piedmont, used by the heir to the Duchy of Savoy. **When the duchy became the Kingdom of Sardinia, the title Duke of Savoy was also used by the heir to the throne. ==Examples== *Ferdinando de' Medici, Grand Prince of Tuscany known as the Grand Prince all his life as he never succeeded dying before his father. *Philippe of Belgium present day King of the Belgians who was known as the Duke of Brabant from 1993-2013. *King Victor Amadeus III of Sardinia was known as the Duke of Savoy from 1726-1773. *Emperor Wilhelm II - known as the Crown Prince of Prussia & German crown prince for 6 months in 1888. *Queen Charlotte of Württemberg known as The Hereditary Princess of Württemberg for five months in 1797. == References == Category:Titles Category:Royalty and nobility",
 "title": "Titles of European royal heirs"
}