{
 "id": "437708",
 "text": "Nicola Sacco (22 April 1891 – 23 August 1927) and Bartolomeo Vanzetti (11 June 1888 – 23 August 1927) were two Italian anarchists who were convicted of murder in the United States in 1920. They were executed on August 23, 1927. Their trial has been called \"one of the most divisive in the history of the United States.\" Many people have argued that the two men were innocent and were wrongfully convicted because of their political beliefs.William Young and David E. Kaiser, Postmortem: New Evidence in the Case of Sacco and Vanzetti, Amherst, MA: University of Massachusetts Press, 1985, == Background == Sacco and Vanzetti immigrated from Italy to the United States in 1908. Sacco became a shoemaker, and Vanzetti sold fish. As anarchists, they opposed World War I. To avoid being drafted into the United States Army, they fled to Mexico in 1917. Later they returned to the United States, but risked being deported because of their actions. == Trial == Sacco and Vanzetti were accused of murdering two men (Alessandro Berardelli and Frederick Parmenter) while robbing the Slater and Morrill Shoe Company in Braintree, Massachusetts. Their murder trial began on May 31, 1921. Describing the trial, a New York Times article said: > [F]or seven weeks, in a sweltering second floor courtroom, defense and > prosecution presented wildly opposing testimony on the defendants and on > ballistics. Both defendants admitted that they had lied in interrogation, > explaining that they thought they were being held as anarchists and wanted > to protect their comrades. Judge Thayer permitted extensive questioning > about the defendants’ anarchism and draft‐dodging. === Bias === Also see: Bias and Prejudice Many historians agree that Sacco and Vanzetti did not get a fair trial. Some believe the two were wrongfully convicted; others think only Sacco was guilty. The two men insisted they were innocent until their deaths. Since their deaths, scholars have mostly agreed that Sacco and Vanzetti were wrongfully convicted. Both men had immigrated to the United States from Italy. Their trial happened during the ‘First Red Scare’, when many Americans feared that foreigners would bring communism to their country. Anti-Italian and anti-immigrant feelings may have prejudiced the jury (influenced their decision). The two men were also anarchists who supported rebellion against governments that were violent and oppressive. To explain why they were carrying weapons when they were arrested, the men had to describe their anarchist beliefs in court. This may have also prejudiced the jury. In addition, Sacco and Vanzetti did not speak English and could not afford to hire an attorney to defend them. === Protests === The case drew attention from around the world. Many people believed the two were put on trial because of their political beliefs. There were worldwide protests. Members of the prosecution team received threats, and police began guarding the head prosecutor's home. In Philadelphia and New York City, bombs were set off. A juror's house was bombed (though nobody was injured). == Execution == On April 9, 1927, Vanzetti said in his last statement to the court: > This is what I say: I would not wish to a dog or to a snake, to the most low > and misfortunate creature of the earth—I would not wish to any of them what > I have had to suffer for things that I am not guilty of. But my conviction > is that I have suffered for things that I am guilty of. I am suffering > because I am a radical and indeed I am a radical; I have suffered because I > was an Italian, and indeed I am an Italian; I have suffered more for my > family and for my beloved than for myself; but I am so convinced to be right > that if you could execute me two times, and if I could be reborn two other > times, I would live again to do what I have done already. On August 23, 1927, Sacco and Vanzetti were executed by electric chair. Five days later, two hundred thousand mourners joined his funeral procession through Boston. == Modern day == Fifty years after they were executed, Massachusetts Governor Michael Dukakis issued a Proclamation that made 23 August 1977 “Nicola Sacco and Bartolomeo Vanzetti Memorial Day.\" (This was the the 50th anniversary of their execution day.) The Proclamation acknowledged that Sacco and Vanzetti had not received a fair trial. It also said: > The atmosphere of their trial and appeals was permeated by prejudice against > foreigners and hostility towards unorthodox political views ... any stigma > and disgrace should be forever removed from [their] names[.] == Related pages == * Anarchism * Xenophobia * First Red Scare == References == Category:1927 Category:1920s in the United States Category:20th century in Massachusetts Category:Italian anarchists Category:People executed by electric chair Category:Trials Category:American murderers",
 "title": "Sacco and Vanzetti"
}