{
 "id": "43775",
 "text": "Cowboy Bebop is a Japanese anime television show aired from 1998 to 1999. It was created by Sunrise and directed by Shinichiro Watanabe. The show is about a group of bounty hunters who travel in outer space to catch criminals. It has 26 episodes. The series has received a TV-14 rating in the United States, while six episodes received a TV-MA and three episodes receiving a TV-PG. The series aired in the United States in 2001 on Cartoon Network's Adult Swim. It was the first anime to be aired on Adult Swim. It was very successful. It was so successful that Cartoon Network decided to put more anime on Adult Swim. There is a movie, a manga, and two video games based on the show. The movie is called Cowboy Bebop: Knockin' on Heaven's Door. The video games are for Playstation and Playstation 2 were not released in the United States. The series is inspired by American culture. Jazz music is mostly played in the show. The episodes are called \"Sessions.\" == Story == In 2071, the members of the space ship Bebop travel through outer space trying to catch criminals. Bounty hunters are known as \"Cowboys\". If they catch the criminals alive then they get a reward. If the criminals die, the cowboys get nothing. The criminals are called bounties. Most episodes are about catching a bounty. Some episodes are about the characters' pasts and lives. At the beginning there are two main heroes, Spike and Jet. Later they would meet with others. They had become the crew of the space ship Bebop. Other members of the Bebop are Faye, computer hacker Ed, and a dog named Ein. == Characters == * Spike Spiegel is the main character. He is a master in shooting and martial arts, and is also a good pilot. He is voiced by Koichi Yamadera in the Japanese version and Steven Blum in the English version. * Jet Black is a former detective and is the owner of the Bebop. He is voiced by Unsho Ishizuka in the Japanese version and Beau Billingslea in the English version. * Faye Valentine is a novice fighter with a gambling addiction. She joins the crew of the Bebop uninvited. She is voiced by Megumi Hayashibara in the Japanese version and Wendee Lee in the English version. * Edward is a female character who likes to hack into computers, and walk on her hands. She is voiced by Aoi Tada in the Japanese version and Melissa Fahn in the English version. Her full name is Wong Hau Pepelu Tivrusky IV. * Ein is a pet dog. He is very smart because scientists did experiments on him. Ein cannot speak, but he seems to understand what people say. He also knows how to play the board game Go. * Vicious is a villain voiced by Norio Wakamoto in the Japanese version and Skip Stellrecht in the English. * Julia is Spike's love interest. She is voiced by Gara Takashima in the Japanese version and Mary Elizabeth McGlynn in the English version. * Punch and Judy. Punch is voiced by Tsutomu Taruki in the Japanese version and Paul St. Peter in the English version. Judy is voiced by Miki Nagasawa in the Japanese version and Lia Sargent in the English version. The name Punch and Judy comes from the popular British puppet show. == Episode List == {| class=wikitable Episode Title Episode 1 Asteroid Blues Episode 2 Stray Dog Strut Episode 3 Honky Tonk Woman Episode 4 Gateway Shuffle Episode 5 Ballad of Fallen Angels Episode 6 Sympathy for the Devil Episode 7 Heavy Metal Queen Episode 8 Waltz for Venus Episode 9 Jamming with Edward Episode 10 Ganymede Elegy Episode 11 Toys in the Attic Episode 12 Jupiter Jazz, Part One Episode 13 Jupiter Jazz, Part Two == Notes == ==References== == Other websites == * Mirror of Cowboy Bebop official site * Animax Japan's official website for Cowboy Bebop * Animax East Asia's official website for Cowboy Bebop * Animax South Asia's official website for Cowboy Bebop * Adult Swim - Cowboy Bebop * * Cowboy Bebop Screenshots Archive * Cowboy Bebop reviewed at Anime Academy Category:1998 anime television series Category:Sunrise (company)",
 "title": "Cowboy Bebop"
}