{
 "id": "437873",
 "text": "Stuart McPhail Hall (3 February 1932 – 10 February 2014) was a Jamaican-born cultural theorist and sociologist. Hall, with Richard Hoggart and Raymond Williams, was one of the founding figures of British Cultural Studies.Procter, James 2004. Stuart Hall, Routledge Critical Thinkers. He was President of the British Sociological Association 1995–97. In the 1950s Hall was a founder of the influential New Left Review. Hall become a Professor of Sociology at the Open University.Chen, Kuan-Hsing. 1996. The formation of a diasporic intellectual: an interview with Stuart Hall in Stuart Hall: critical dialogues in cultural studies. David Morley and Kuan-Hsing Chen, eds: New York: Routledge. Hall retired from the Open University in 1997 and was a Professor Emeritus.Stuart Hall: Culture and Power. Interview. Radical Philosophy, November/December 1998. British newspaper The Observer called him \"one of the country's leading cultural theorists\". Hall died on 10 February 2014, from complications following kidney failure a week after his eighty second birthday.David Morley and Bill Schwarz, \"Stuart Hall obituary: Influential cultural theorist, campaigner and founding editor of the New Left Review\", The Guardian, 10 February 2014. ==Related pages== *List of sociologists from Europe ==References== ==Other websites== * Obituary in The Independent by Marcus Williamson * John O'Hara interview with Stuart Hall for the Australian Broadcasting Corporation's Doubletake program, originally broadcast 5 May 1983: The Narrative Construction of Reality - Stuart Hall . Republished in centerforbookculture.org's \"Context\" online edition, No. 10. Retrieved on 2008-04-16. * Mitchell, Don. Chapter 24: Stuart Hall. In: Key Thinkers on Space and Place. Phil Hubbard, Rob Kitchin, Gill Valentine (2004), pp. 160ff. . * Marxist Media Theory * A brief biography Category:1932 births Category:2014 deaths Category:British sociologists Category:Academics of the Open University Category:Jamaican writers Category:Marxists",
 "title": "Stuart Hall (cultural theorist)"
}