{
 "id": "438323",
 "text": "The Stasi was the official state security service of East Germany, the German Democratic Republic in short the GDR. The Stasi motto was \"Schild und Schwert der Partei\" (Shield and Sword of the Party). \"The Party\" was the ruling Socialist Unity Party of Germany. The main job of the Stasi was to prevent opposition to the Party. It was one of the most effective and ruthless secret police agencies in the world.Chambers, Madeline No remorse from Stasi as Berlin marks fall of Wall , Reuters, 4 Nov 2009.Angela Merkel 'turned down' job from Stasi, The Daily Telegraph, 14 November 2012.Connolly, Kate,'Puzzlers' reassemble shredded Stasi files, bit by bit, The Los Angeles Times, 1 November 2009.Calio, Jim, The Stasi prison ghosts, The Huffington Post, 18 November 2009.Rosenberg, Steve, Computers to solve Stasi puzzle, BBC, 25 May 2007.New study finds more Stasi spooks, Der Spiegel, 11 March 2008. The Stasi headquarter were in East Berlin, with a group of buildings in Lichtenberg and several other buildings in Berlin. One of its main tasks was spying on the people, through a vast network of citizens who were informants (\"snitches\"). Informants were paid, or given favours for their information. The Stasi also worked as an intelligence agency abroad, using espionage and covert operations in foreign countries. Under its long-time head Markus Wolf it got a reputation as one of the most effective intelligence agencies of the Cold War. The Stasi was also tasked with counter-intelligence. They were responsible for stopping foreign-intelligence services from working in GDR. After German reunification in 1990, many Stasi officials were prosecuted for their crimes. The files that the Stasi had kept on millions of East Germans were laid open. Now citizens can see their personal files on request; these files are kept by the Federal Commissioner for the Stasi Archives. == References == Category:1950 establishments in Europe Category:1950s establishments in Germany Category:1990 disestablishments in Germany Category:East Germany Category:German intelligence agencies",
 "title": "Stasi"
}