{
 "id": "438567",
 "text": "Nadine Gordimer (20 November 1923 – 13 July 2014) was a South African writer, political activist and recipient of the 1991 Nobel Prize in Literature. She was known as a woman \"who through her magnificent epic writing has – in the words of Alfred Nobel – been of very great benefit to humanity\".\"A Writer's Life: Nadine Gordimer \", 3 April 2006, Telegraph. She was of Jewish descent. Gordimer's writing helped abolishing apartheid in South Africa. She was active in the anti-apartheid movement, joining the African National Congress during the days when the organization was banned. Later on she was also active in HIV/AIDS causes. Gordimer was one of 20 Nobel LaureatesSuch as Peter Agre, Yuan T. Lee, Elinor Ostrom, Werner Arber, David Gross, James Mirrlees, Carlo Rubbia, Paul J. Crutzen, Mario J. Molina, Amartya Sen, Peter Doherty (scientist), Walter Kohn, Douglass North, John Sulston, Murray Gell-Mann, Harold Kroto, Douglas Osheroff, Muhammad Yunus who signed the \"Stockholm memorandum\" at the 3rd Nobel Laureate Symposium on Global Sustainability in Stockholm, Sweden on 18 May 2011.\"Stockholm Memorandum,\" Nobel-cause.de, 2011 Gordimer was born near Springs, a small town outside of Johannesburg on 20 November 1923. Gordimer died on 13 July 2014 at the age of 90. == Further reading == * Ronald Suresh Roberts, No Cold Kitchen: A Biography of Nadine Gordimer (2005) * No Cold Kitchen: A Biography of Nadine Gordimer by Ronald Suresh Roberts (STE) == References == == Other websites == * Index of New York Times articles on Gordimer * Guide to the Gordimer manuscripts, 1934–1991 (Lilly Library, Indiana University, Bloomington, Indiana) * Nadine Gordimer Collection at the Harry Ransom Center at the University of Texas at Austin Category:1923 births Category:2014 deaths Category:Jewish activists Category:Jewish atheists Category:Jewish Nobel Prize winners Category:Nobel Prize in Literature winners Category:People from Johannesburg Category:South African anti-apartheid activists Category:South African Jews Category:South African Nobel Prize winners Category:South African writers Category:White South African people Category:HIV/AIDS activists",
 "title": "Nadine Gordimer"
}