{
 "id": "43853",
 "text": "A prophecy is a prediction about the future. In many religions, prophecies are viewed as messages from God, or a god. They frequently concern one specific event (like the end of the world, the arrival of a messiah, or a natural disaster). They can be hard to understand and can be interpreted in different ways. In Ancient Greece, people who made prophecies were called oracles, most notably the Oracle of Delphi. Nostradamus, a 16th-century prophet, is well- known today. Many other prophets have existed throughout history. The verb that means \"to make a prophecy\" is \"to prophesy\". These two words are spelled and pronounced differently and pronounced differently. \"Prophesy\" is a verb, and \"prophecy\" is a noun. == Prophecy in religion == === Judeo-Christian religions === There are many prophecies in the Bible. Some tell of future blessings: good things that will happen because of God's mercy and forgiveness. Others warn of punishments to come. Some discuss both blessings and punishments. Biblical prophecies fall into two categories: conditional and unconditional. Conditional prophesies say that punishment can be avoided if a person changes their ways. For example, in the Book of Jonah, God sends Jonah to warn the residents of Nineveh that they will be destroyed if they do not change their behavior. The people repent, and God decides not to destroy them. Later, Jesus made conditional prophecies, warning people to believe in his teachings and live by God's rules in order to receive blessings instead of punishments. Meanwhile, unconditional prophecies tell of events that will happen no matter what, regardless of what anyone does. For example, the Book of Revelation describes what the world's end times will look like. Moses, Jesus and other religious leaders who tell people to live a good life are called prophets by their followers, even though they may not tell about future events. ===False prophecies=== Sometimes people are \"false prophets\": they make an incorrect prediction about the future based on something they read in the Bible or think God told them. Many people throughout history have incorrectly predicted the date of the end of the world or Christ's return. According to the Book of Matthew, Jesus himself said that \"No one knows the day or the hour\" of his return. Matthew 24:36 == Prophecies not related to religion == Scientists sometimes make predictions about the future. Sometimes their predictions are correct, but often they are wrong or only partly correct. The famous inventor Thomas Edison predicted that electricity would replace steam as a way to power trains. He also predicted that gold could be made from iron, giving it little worth as money. Neither prediction was correct. Albert Einstein said in 1932 that atomic energy would never be possible. This was incorrect. Politicians also make prophecies that may or may not be correct. Adolf Hitler predicted that the Nazis would rule for 1000 years, but they were defeated in only 12 years (1933-1944). Many organizations try to predict the outcome of elections, with very mixed accuracy. Others predict the winners of sporting events, but are often wrong because of \"upsets\": games with unexpected results. A famous baseball player, Yogi Berra, once said: \"It's tough to make predictions, especially about the future\". == Self-fulfilling prophecies == According to the Cleveland Clinic: > Self-fulfilling prophecies occur when a prediction brings about its own > fulfillment. In layman’s terms, that means that if you believe something to > be true, you’ll act as if it were true. And your actions double down on your > prediction to make it a reality. For example, if a person thinks they will fail at something, they might not try very hard to achieve it, making them unsuccessful. Abraham Lincoln said \"The most reliable way to predict the future is to create it.\" == References == Category:Theology Category:Future",
 "title": "Prophecy"
}