{
 "id": "438612",
 "text": "Lenexa is a city in Johnson County, Kansas United States. It is the 9th most populated city in the Kansas City Metropolitan Area. In 2020, 57,434 people lived there. It is where Garmin was created. It is the regional headquarters of Kiewit Construction and the former headquarters of Applebee’s. It is bordered by the cities of Shawnee to the north, Overland Park to the east, De Soto to the west and Olathe to the south. ==Geography== Lenexa is at (38.964689, -94.759535). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ==People== ===2020 census=== The 2020 census says that there were 57,434 people, 23,934 households, and 15,432 families living in Lenexa. Of the households, 57.0% owned their home and 43.0% rented their home. The median age was 38.4 years. Of the people, 78.0% were White, 6.4% were Black, 4.1% were Asian, 0.4% were Native American, 0.1% were Pacific Islanders, 2.9% were from some other race, and 8.1% were two or more races. Hispanic or Latino of any race were 8.3% of the people. ===2010 census=== The 2010 census says that there were 48,190 people, 19,288 households, and 13,065 families living in Lenexa. ==Economy== Garmin was created in Lenexa ===Largest employers=== The City's 2015 Comprehensive Annual Financial Report says that the biggest employers in the city are: # Employer # of Employees 1 United Parcel Service 2,087 2 Quest Diagnostics/Lab One 1,954 3 Kiewit Power Engineers Company 1,292 4 JC Penney Logistics Center 1,200 5 Alliance Data Systems 730 6 Gear for Sports 600 7 Lakeview Village 586 8 Lexmark 570 9 Clinical Reference Lab 567 10 PRA International 560 ==References== ==Other websites== ;City * City of Lenexa * Lenexa - Directory of Public Officials ;Schools * De Soto School District * Olathe School District * Shawnee Mission School District ;Maps * Lenexa City Map, KDOT Category:Cities in Johnson County, Kansas Category:1869 establishments in Kansas",
 "title": "Lenexa, Kansas"
}