{
 "id": "438785",
 "text": "AMOLED (Active Matrix Organic Light Emitting Diode) is a display technology mainly used in mobile phones, televisions and other electronic devices with a screen. An AMOLED display uses an active matrix of organic light-emitting diodes (OLED) that emits light when an electrical signal is present. As of 2008, AMOLED technology was used in phones, media players, and digital cameras. They are now being used more in low-power, cheaper and large-sized applications as well. == Advantages == OLEDs work like LEDs except the diodes in OLEDs are thinner. Other type of displays, such as LCDs, require an external light source (backlighting) to illuminate the screen whereas OLED displays do not. Energy efficiency is also an advantage of AMOLED displays. It is more energy efficient than LED and other types of displays. This is because AMOLED displays generate less heat while emitting light, allowing for a more efficient energy transfer. It is energy efficient in its ability to consume less power as well. It can be utilized well for portable consumer electronic devices, where good battery life is essential. Because of this efficiency, AMOLED displays can also be considered eco-friendly. Compared to other types of displays, AMOLED displays can produce high refresh rates although LCD and IPS displays lead in that specific area. AMOLED technology also allows for bending displays, which manufacturers use to make bezel-less screens that bend behind the display. == Disadvantages == In previous days, AMOLED displays were prone to screen burn-ins, which leaves a permanent imprint of overused colors from overused images, though the imprint only appears if the screen is used at maximum brightness for a long time. This problem was fixed by using a software technique called pixel shifting. Pixel shifting is when the image on the screen is shifted a few pixels at each set interval. Because of the organic compounds of its technology, unlike light diodes or inorganic crystalline, AMOLED displays are highly susceptible to water damage. Putting the display in water would result in immediate color and pixel damage. Thus, sealing techniques must be taken into consideration during the manufacturing process. In previous days, AMOLED displays were dimmer compared to LCDs. But the Samsung E6 AMOLED display was able to achieve as high as 2600 nits on smartphones. It is rumored that the Honor Magic 6 RSR might offer an OLED display having a peak brightness of up to 5000 nits. For an LCD display to achieve this level of brightness, it would consume much more power as well as produce heat. == Marketing == AMOLED Screens have been marketed in various ways by different companies. Apple refers their modern AMOLED displays as “Super Retina XDR” while Samsung refers to theirs as “Dynamic AMOLED”. Motorola, HTC, Google and all other device manufacturers market in different ways although most of their screens are created by Samsung, which controls 98% of the AMOLED display market. == Future development == Manufacturers have tried to address the disadvantages of AMOLED display technology. Samsung has announced their launch of the world’s first stretchable touchscreen display with a 9:1 inch dynamic stretchable AMOLED display. The new screen is based off of LTPS (Low Temperature Polycrystalline Silicon) technology, which helps with deforming necessary pixels for stretching. AU Optronics, an electronics manufacturer in Taiwan, has also made moves to develop in-cell touch panels into AMOLED display’s fabrication process. The flexibile AMOLED displays are being used in all foldable smartphones and will be used until micro-OLED technology become affordable. The Samsung E7 AMOLED, the next generation display, is about to enter the smartphone industry. == References == Category:Display technology Category:Mobile phones",
 "title": "AMOLED"
}