{
 "id": "438839",
 "text": "Dinosaur renaissance is a term coined in a 1975 issue of Scientific American by Robert Bakker to describe the renewed interest in paleontology. This has lasted from the 1970s to the present. It was caused by a great increase in dinosaur discoveries, and by new ideas of how they lived. The \"renaissance\", a word which means \"rebirth\", changed how dinosaurs pictured both by professional illustrators, and in the public eye. John Ostrom's 1964 discovery of Deinonychus is one of the most important fossil finds.Dromaeosauridae Deinonychus was an active predator that clearly killed its prey by leaping and slashing or stabbing with its \"terrible claw\". Evidence of a truly active lifestyle included long strings of tendons running along the tail, making it a stiff counterbalance for jumping and running. One conclusion was that at least some dinosaurs had a high metabolism, and so in some cases were warm-blooded. This was popularized by Ostrom's student Robert Bakker. The impression of dinosaurs as being slow, cold-blooded, small-brained reptiles needed to be rethought, at least for some of the carnivores. == Main issues == These are the main points: *Dinosaurs are a natural monophyletic group. *Warm- bloodedness and activity levels. Robert Bakker argued that dinosaurs were warm-blooded and active animals, capable of sustained periods of high activity. His methodology was fiercely debated among scientists. Now it is thought that many dinosaurs had higher metabolic rates than living reptiles, but also that the situation is complex and varied. Many dinosaurs could have had intermediate metabolic rates. The discovery of feathers on dinobirds clinched the argument for the smaller theropods. *Social behaviour of dinosaurs. Fossil tracks suggest that sauropod dinosaurs moved in structured herds, with the adults surrounding the juveniles in a protective ring. Studies of dinosaur nests suggested that duckbilled dinosaur Maiasaura cared for its young. *Dinosaur movement. The dinosaur renaissance changed their portrayal by artists. Bakker's illustration of Deinonychus is one of the most recognisable and iconic of dinosaur restorations.It is now known that the drawing is inaccurate in many respects, including the pubis being far too short, and the fact that feathers are lacking. Another result of modern fossil finds is the balance of bipedal dinosaurs. Dinosaurs, we now know, move with body almost horizontal, balanced over the hips by a long and often heavy tail. This tail is kept stiff by tough tendons running along the vertebrae. In many adult dinosaurs the tail tendons became ossified (partly bony), keeping the tail more rigid. *New extinction theories. The assumption that dinosaurs became extinct because they were inferior in competition with mammals is wrong. Iridium, a metal found mainly in meteorites, was found in the Cretaceous- Tertiary boundary layer. Also the Chicxulub crater was found. This suggested the extinction had been caused by a meteor impact. Later, the existence of the Deccan Traps at the same time showed that enormous flood volcanism was also at work. *Cultural impact. The dinosaur renaissance revived the general interest in dinosaurs. A flood of books, films, television programmes and general publicity has followed. Jurassic Park is the best-known example of this. == Chinese lagerstätten == The discovery of new feathered dinosaurs in China has kept the field in the forefront of research and populat attention. Lower Cretaceous geological formations in the northeastern Chinese province of Liaoning are especially noteworthy. The animals found there are known as the Jehol biota. == References == Category:Metaphors referring to nature Category:Dinosaurs",
 "title": "Dinosaur renaissance"
}