{
 "id": "439552",
 "text": "Robert Lee \"Bobby\" Eaton (August 14, 1958 - August 4, 2021) was an American professional wrestler. He was best known for being part of the team the Midnight Express. During his career, he competed in many different promotions. These include: Mid-America Wrestling, Continental Wrestling Association, Mid- South Wrestling, World Class Championship Wrestling, Jim Crockett Promotions, World Championship Wrestling, Smoky Mountain Wrestling and made small guest appearances for Extreme Championship Wrestling and Total Nonstop Action Wrestling. ==Health and death== On September 6, 2006, it was reported that Eaton was in the hospital after he suffered a heart attack. He was released from the hospital two days later and he released a statement through the Wrestling Observer website saying that he did not have a heart attack but was diagnosed with high blood pressure with a hint of diabetes. He has also suffered several health issues later on which include cardiac problems which have seen him hospitalized on several occasions. In June 2013, he had a pacemaker inserted. In July 2021, Eaton was hospitalized after falling. He died a month later on August 4, 2021 just ten days before his 63rd birthday in Nashville, Tennessee. ==Championships== *Georgia Championship Wrestling **NWA Georgia Television Championship (one time) *International Wrestling Cartel **IWC Tag Team Championship (one time) (with Dennis Condrey) *Jim Crockett Promotions/World Championship Wrestling **NWA United States Tag Team Championship (three times) (with Stan Lane) **NWA (Mid-Atlantic version)/WCW World Tag Team Championship (three times) (with Dennis Condrey (one), Stan Lane (one) and Arn Anderson (one)) **WCW World Television Championship (one time) *Mid-Atlantic Championship Wrestling **NWA Mid-Atlantic Tag Team Championship (one time) (with Rikki Nelson) *Continental Wrestling Association **AWA Southern Tag Team Championship (four times) (with Sweet Brown Sugar (two) and Duke Myers (two)) **CWA World Heavyweight Championship (one time) **NWA Mid-America Heavyweight Championship (eleven times) **NWA Mid-America Tag Team Championship (six times) (with Lanny Poffo (one), George Gulas (three), Mexican Angel (one) and Great Togo (one)) **NWA Mid-America Television Championship (one time) **NWA World Six-Man Tag Team Championship (four times) (with George Gulas and Jerry Barber (one), George Gulas and Arvil Hutto (one), George Gulos and The Mexican Angel (one), and Secret Weapon and Tojo Yamamoto (one)) *Mid-South Wrestling Association **Mid-South Tag Team Championship (two times) (with Dennis Condrey) *NWA Bluegrass **NWA Bluegrass Tag Team Championship (one time) (with Dennis Condrey) *NWA Rocky Top **NWA Rocky Top Tag Team Championship (one time) (with Dennis Condrey) *Pro Wrestling Illustrated **He was ranked #27 of the top 500 singles wrestlers in the PWI 500 in 1992. **He was ranked #91 of the top 500 singles wrestlers of the \"PWI Years\" in 2003. **PWI Tag Team of the Year (1987) (with Stan Lane) *Smoky Mountain Wrestling **SMW Beat the Champ Television Championship (one time) *World Class Championship Wrestling **NWA American Tag Team Championship (one time) (with Dennis Condrey) *Wrestling Observer Newsletter awards **Hall of Fame (Class of 2009) (with Dennis Condrey and Stan Lane as the Midnight Express) **Most Underrated Wrestler (1985, 1986, 1990, 1993) **Tag Team of the Year (1986) (with Dennis Condrey) **Tag Team of the Year (1987, 1988) (with Stan Lane) **Worst Worked Match of the Year (1991) (with P.N. News vs. Terrance Taylor and Steve Austin in a Scaffold match at The Great American Bash) ==References== ==Other websites== *Online World of Wrestling profile Category:1958 births Category:2021 deaths Category:American professional wrestlers Category:Sportspeople from Huntsville, Alabama",
 "title": "Bobby Eaton"
}