{
 "id": "439639",
 "text": "Marek Židlický (born February 3, 1977) is a Czech former professional ice hockey defenceman. He played parts of fourteen seasons in the National Hockey League (NHL). He played for the Nashville Predators, Minnesota Wild, New Jersey Devils, Detroit Red Wings, and New York Islanders. He also played for Kladno of Czech Extraliga (ELH) and HIFK of the SM-liiga (SM-l). ==Career== Before playing in the NHL, Židlický played five seasons in the Czech Extraliga with HC Kladno and four seasons in the SM-liiga with HIFK. He was drafted by the New York Rangers with the 176th overall pick in the 2001 NHL Entry Draft. The Rangers and Židlický could not agree on contract terms and he stayed in Finland for a year to play with the HIFK. On December 12, 2002, he was traded along with Rem Murray and Tomáš Klouček to the Nashville Predators for Mike Dunham. During the 2004–05 NHL lockout, he returned to Finland and returned to play for HIFK. He signed a four-year contract worth $13.5 million with the Predators on May 8, 2006. The Predators traded him to the Minnesota Wild for Ryan Jones and a second round draft pick on July 1, 2008. He played four seasons with the Wild. He was traded to the New Jersey Devils for Kurtis Foster, Nick Palmieri, Stephane Veilleux and a 2nd round draft pick from the Washington Capitals. The Devils resigned him in July 2013. On March 2, 2015, the Devils would trade Židlický to the Detroit Red Wings in exchange for a third-round pick in the 2016 NHL Draft. He would find success with the Red Wings immediately, scoring the game-winning overtime goal to defeat the New York Rangers. On September 18, 2015, he would sign a one-year; $1.5 million contract to join the New York Islanders. Židlický would retire from playing professional ice hockey in 2016. ==References== ==Other websites== * * Category:1977 births Category:Living people Category:Czech ice hockey players Category:Detroit Red Wings players Category:Minnesota Wild players Category:Nashville Predators players Category:New Jersey Devils players Category:New York Islanders players Category:Olympic bronze medalists for the Czech Republic Category:Ice hockey defencemen",
 "title": "Marek Židlický"
}