{
 "id": "439769",
 "text": "The National War Labor Board (NWLB) was an agency of the United States government created in early 1918 by President Woodrow Wilson which was made up of twelve members from business and labor. The co-chairmen were former President William Howard Taft and attorney Frank Walsh. Its purpose was to make sure labor strikes did not hurt the war effort. The board ended after the war in May 1919. The National War Labor Board was reestablished on January 12, 1942 by President Franklin D. Roosevelt. The chairman was William Hammatt Davis. This board ended its duties. == National War Labor Board WW I == The United States entered World War I in April 1917. Soon the government became concerned that labor strikes might stop the production of military equipment and supplies. In response President Woodrow Wilson created the National War Labor Board.The American Economy: A Historical Encyclopedia, Volume 1, ed. Cynthia Clark Northrup (Santa Barbara, CA: ABC-CLIO, 2011), p. 315 The board recognized the worker's right to organize unions and bargain collectively. Former President Taft and labor attorney Frank Walsh were the co-chairmen. The board had little real power but depended on their ability to negotiate compromises between the two sides. They succeeded in preventing a number of strikes. After Germany was defeated the board was disbanded. In 1919 several strikes broke out in the coal and steel industries. The board supported an eight-hour day for workers and equal pay for equal work regardless of sex.Report of the Secretary of the National War Labor Board to the Secretary of Labor (Washington, DC: Government Printing Office ,1920), pp. 69, 72 == National War Labor Board WW II == The National War Labor Board was started up again by President Franklin D. Roosevelt, on January 12, 1942. The chairman was William Hammatt Davis. The board's job was to prevent wartime labor disputes.The Oxford Encyclopedia of American Business, Labor, and Economic History, ed. Melvyn Dubofsky (New York: Oxford University Press, 2013), p. 139 Also to insure that higher wage settlements did not cause inflation. The board was generally favorable to unions. The board encouraged the use of fringe benefits instead of inflation-causing higher wages. In 1942 the board began a maintenance of membership policy which attracted new members into labor unions. Unions understood they had to minimize any activism among their members in order to gain favorable rulings from the NWLB. Dispite the efforts of labor unions there were wartime strikes. Most of these were unauthorized (by the unions) or wildcat strikes (non-union). The CIO (Congress of Industrial Organizations), later part of the AFL-CIO, largely cooperated with the board. When the number of strikes peaked in 1944 CIO members maintained their no-strike pledge. By the time the war ended, membership in the CIO was nearly 5 million. The NWLB provided arbitrators on an honorary basis, that is, without fees. But they encouraged paid arbitrators and by war's end most who arbitrated disputes were paid a fee of from $25–$100 per day.Frances Kellor, American Arbitration: Its History, Functions and Achievements (Washington, DC: Beard Books, 2000), p. 89 In 1945 the board was disbanded. A wave of strikes broke out just the same as when the NWLB ended in 1918.The American Economy: A Historical Encyclopedia, Volume 1, ed. Cynthia Clark Northrup (Santa Barbara, CA: ABC-CLIO, 2011), p. 202 == References == == Other websites == *Guide to the United States NWLB files 1913-1945 at Cornell University Library *Records of the National War Labor Board (World War I) Category:United States government agencies Category:1918 establishments in the United States Category:1919 disestablishments",
 "title": "National War Labor Board"
}