{
 "id": "439958",
 "text": "Harold Allen Ramis (November 21, 1944 - February 24, 2014) was an American comedic actor, director, producer and writer. His best known movie roles were as Egon Spengler in Ghostbusters (1984) and Russell Ziskey in Stripes (1981), both movies he co-wrote. He also wrote and directed Caddyshack (1980), National Lampoon's Vacation (1983), Groundhog Day (1993) and Analyze This (1999). Ramis was born in Chicago, Illinois to a Jewish family. He was married to San Francisco artist Anne Plotkin from 1967 until their divorce. They had a daughter, Violet, whose godfather is actor Bill Murray. He later married Erica Mann in 1989. They had two sons: Julian Arthur and Daniel Hayes. Ramis died from an infection of the blood vessel (vasculitis) at his home in North Shore, Chicago. He was 69. ==Filmography== Year Title Director Writer Producer Notes 1978 National Lampoon's Animal House 1979 Meatballs 1980 Caddyshack Directorial Debut 1981 Stripes 1983 National Lampoon's Vacation 1984 Ghostbusters 1986 Back to School 1986 Club Paradise 1986 Armed and Dangerous 1988 Caddyshack II 1989 Ghostbusters II 1991 Rover Dangerfield 1993 Groundhog Day BAFTA Award for Best Original Screenplay 1995 Stuart Saves His Family 1996 Multiplicity 1999 Analyze This 2000 Bedazzled 2002 Analyze That 2005 The Ice Harvest 2009 Year One Executive Producer * The First $20 Million Is Always the Hardest (2002) * I Want Someone to Eat Cheese With (2006) * Archie's Final Project (2009) ==References== ==Other websites== * Category:1944 births Category:2014 deaths Category:Deaths from vasculitis Category:Actors from Chicago Category:American movie actors Category:American television actors Category:American television directors Category:American television producers Category:American television writers Category:Jewish American actors Category:Jewish American writers Category:Movie directors from Chicago Category:Movie producers from Chicago Category:Screenwriters from Chicago",
 "title": "Harold Ramis"
}