{
 "id": "440130",
 "text": "Charles Evans Hughes, Sr. (April 11, 1862 – August 27, 1948) was an American statesman, lawyer and Republican politician from New York. He served as the 36th Governor of New York (1907–1910), Associate Justice of the Supreme Court of the United States (1910–1916), United States Secretary of State (1921–1925), a judge on the Court of International Justice (1928–1930), and the 11th Chief Justice of the United States (1930–1941). He was the Republican candidate in the 1916 U.S. Presidential election, losing narrowly to Woodrow Wilson. Hughes was a professor in the 1890s, a supporter of Britain's New Liberalism, an important leader of the progressive movement of the 20th century, a leading diplomat and New York lawyer in the days of Harding and Coolidge, and was known for being a swing voter when dealing with cases related to the New Deal in the 1930s. Historian Clinton Rossiter has hailed him as a leading American conservative.Clinton Rossiter, Conservatism in America (1962) p. 174 On August 27, 1948, Hughes died in what is now the Tiffany Cottage of the Wianno Club near Barnstable, Massachusetts. His remains are buried at Woodlawn Cemetery in Bronx, New York. ==More reading== *Hall, Kermit L., ed. The Oxford Companion to the Supreme Court of the United States. Oxford, Oxfordshire: Oxford University Press, 1992. ; . *Martin, Fenton S. and Goehlert, Robert U., The U.S. Supreme Court: A Bibliography, (Congressional Quarterly Books, 1990). . *Perkins, Dexter, Charles Evans Hughes and American democratic statesmanship (Boston: Little, Brown, 1956). *Pusey, Merlo J., Charles Evans Hughes, 2 vol. (New York: Macmillan, 1951).. the standard scholarly biography *Shesol, Jeff. Supreme Power: Franklin Roosevelt vs. The Supreme Court (W.W. Norton, 2010) *Simon, James F., FDR and Chief Justice Hughes: The President, the Supreme Court, and the Epic Battle Over the New Deal (Simon & Schuster, Forthcoming, February 2012). ==References== ==Other websites== *Grave of Charles Evans Hughes at Find a Grave *The Hughes Court at Supreme Court Historical Society. * \"Charles Evans Hughes, Presidential Contender\" from C-SPAN's The Contenders Category:1862 births Category:1948 deaths Category:Deaths from pneumonia Category:Governors of New York (state) Category:United States Secretaries of State Category:Chief justices of the United States Category:Politicians from New York (state) Category:Republican Party (United States) politicians Category:People from Glens Falls, New York Category:Lawyers from New York (state) Category:International Court of Justice judges",
 "title": "Charles Evans Hughes"
}