{
 "id": "4402",
 "text": "There are a number of communist parties around the world. In world history, the Russian and Chinese communists are very important. In Western Europe, the French, Spanish and Italian communist parties are the biggest. They have taken part in either local, regional or central government in those countries. Some communist parties have different names, such as Socialist Party, Socialist Workers Party, or Workers Party. But most socialist parties are social democratic and not communist. == List == * === Other Communist parties in today's world === * Algeria - Algerian Party for Democracy and Socialism * Argentina - Communist Party of Argentina * Australia - Communist Party of Australia * Austria - Communist Party of Austria * Bangladesh - Communist Party of Bangladesh * Belarus - Communist Party of Belarus * Belgium - Communist Party of Belgium * Bosnia and Herzegovina - Workers’ Communist Party of Bosnia and Herzegovina * Brazil - Brazilian Communist Party, Communist Party of Brazil * Canada - Communist Party of Canada, Marxist-Leninist Party of Canada * Chile - Communist Party of Chile * Colombia - Communist Party of Colombia * Cyprus - Progressive Party of the Working People of Cyprus * Czech Republic - Communist Party of Bohemia and Moravia * Denmark - Communist Party (Denmark), Communist Party Of Denmark, Workers' Communist Party (Denmark) * Egypt - Egyptian Communist Party * Finland - Communist Party of Finland * France - French Communist Party * Germany - Communist Party Of Germany * Greece - Communist Party of Greece (KKE) * Honduras - Communist Party of Honduras ** Hungary - Hungarian Worker's party * India - Communist Party of India, Communist Party of India (Marxist) *Iraq - Iraqi Communist Party * Israel - Israeli Communist Party * Italy - Italian Communist Party (2016), Communist Refoundation Party * Ireland - Communist Party of Ireland, Workers Party of Ireland * Japan - Japanese Communist Party *Kazakhstan - Communist Party of Kazakhstan, People's Party of Kazakhstan * Mexico - Popular Socialist Party Of Mexico * Moldova - Party of Communists of the Republic of Moldova * Netherlands - New Communist Party of the Netherlands * New Zealand - Socialist Party of Aotearoa * Norway - Communist Party of Norway * Pakistan - Communist Party of Pakistan * Palestinian Authority - Palestine People's Party * Peru - Peruvian Communist Party, Shining Path * Poland - Communist Party of Poland * Portugal - Portuguese Communist Party, Portuguese Workers' Communist Party *Philippines-Communist Party of the Philippines * Russia - Communist Party of the Russian Federation, Communist Workers Party of Russia, All-Union Party «Union of Communists» * Serbia and Montenegro - New Communist Party of Yugoslavia * Slovakia - Communist Party of Slovakia * South Africa - South African Communist Party * Spain - Communist Party of Spain * Sudan - Sudanese Communist Party * Sweden - Communist Party (Sweden), Communist Party Of Sweden * Switzerland - Swiss Party of Labor * Syria - Syrian Communist Party, Syrian Communist Party (Unified) * Tajikistan - Communist Party of Tajikistan * Turkey - Workers' Party of Turkey , Labour Party (Turkey) * Ukraine - Communist Party of Ukraine,Union of Communists of Ukraine * United Kingdom - Communist Party of Britain, Communist Party of Britain (Marxist-Leninist), Communist Party of Great Britain (Marxist-Leninist), New Communist Party of Britain, Revolutionary Communist Group * United States - Communist Party USA, Revolutionary Communist Party * Venezuela - Communist Party of Venezuela, Marxist–Leninist Communist Party of Venezuela === Old Communist parties which do not exist today === * Nepal - Communist Party of Nepal (Maoist), Communist Party of Nepal (Unified Marxist-Leninist) * Cambodia - Communist Party of Cambodia (Khmer Rouge) * Czechoslovakia - Communist Party of Czechoslovakia * Germany - Communist Party of Germany * Germany (East) - Socialist Unity Party of Germany * Hungary - Hungarian Communist Party, Hungarian Workers Party *Indonesia - Indonesian Communist Party (PKI) *Italy - Italian Communist Party (1921) * Mexico - Mexican Communist Party (PCM) * Netherlands - Communist Party of the Netherlands became part of GroenLinks in 1989 * New Zealand - Communist Party of New Zealand * Poland - Polish United Workers Party * Poland - Communist Party of Poland massacred by Stalin in 1938, see Polish minority in Soviet Union * Romania - Romanian Workers' Party * Soviet Union - Communist Party of the Soviet Union * United Kingdom - Communist Party of Great Britain * Yugoslavia - Communist Party of Yugoslavia * Switzerland - Communist Party of Switzerland * Turkey - Turkish Workers Party (TIP) ==Related pages== * Communism * List of members of the Comintern * List of left communist internationals * List of political parties ==References== * *",
 "title": "List of communist parties"
}