{
 "id": "44029",
 "text": "Dimetrodon was a genus of non-reptilian Pelycosaur (early Synapsida) from the first part of the Early Permian period (about 295–272 million years ago). == Fossils == Dimetrodon walked on four legs and had a tall, curved skull with large teeth of different sizes set along the jaws. Most fossils have been found in the southwestern United States, from red beds in Texas and Oklahoma. Newly discovered fossils of Dimetrodon are now found in Germany. The largest known species of Dimetrodon is D. angelensis at and the smallest is D. teutonis at . == Ecosystem == Dimetrodon was a carnivore, probably the top predator in its environment. Its main feature is the large sail on its back formed by elongated spines extending upwards from the vertebrae. The spines would be joined by skin. The general opinion of paleontologists is that it was a temperature-regulating device.Florides G.A. et al 2001. Natural environment and thermal behaviour of Dimetrodon limbatus. Journal of Thermal Biology 26 (1): 15–20. The idea is that the animal could warm up in the early morning by placing itself broadside to the Sun, and later could cool off in the shade, or arrange for its body to get less sunlight. At this stage in evolution, no land animals were homoiotherms. Very likely the sail was also used for sexual or territorial signalling. In which case, the skin would be coloured. This, of course, is supposition, but it does make sense of the animal's most extraordinary feature. == Evolutionary terms == In evolutionary terms, Dimetrodon was a synapsid (Primitive mammal), a line of land animals which eventually gave rise to the mammals. It was not on the direct line of descent,Benson R.J. 2012. Interrelationships of basal synapsids: cranial and postcranial morphological partitions suggest different topologies. Journal of Systematic Paleontology 10 (2). but a good example of the evolutionary grade typical of Permian synapsids. Dimetrodon evolved from lizard like syanspids from the Late Carboniferous. == Pelycosaur cousin == Another synaspid was the smaller and similar Edaphosaurus. Edaphosaurus was an herbivore and probably the prey item for Dimetrodon. Growth and metabolism Dimetrodon probably had a much higher metabolism than its cousin (Edaphosaurus). While Dimetrodon was faster, Edaphosaurus was probably really slow. This indicated that Edaphosaurus was cold-blooded. By using its sail and trapping heat from the sun, Edaphosaurus could use this way as regulating its own body temperature. Same with Dimetrodon. == Skull == In the front of Dimetrodon's mouth was steak like biting teeth (front teeth). But in the back of it's mouth were teeth that were like chewing teeth. This told us that Dimetrodon had different pairs of teeth. == References == Category:Pelycosaurs",
 "title": "Dimetrodon"
}