{
 "id": "44030",
 "text": "Spinosaurus was a huge semi-aquatic dinosaur from the Cretaceous, that lived 112 to 93.5 million years ago.Morrelle, Rebecca 2014. Spinosaurus fossil: 'Giant swimming dinosaur' unearthed. BBC News Science & Environment. It was one of the largest and the longest of all known terrestrial carnivores that weights up to 7.4-20 metric tons in body mass. It had rather short hind limbs that made it easier to walk on muddy surfaces and nostrils on top of its crocodile-like head. This would let it submerge its' snout into waterways that would help it to catch fish, similar to a heron The same researchers suggests it was longer and heavier than Tyrannosaurus rex. Spinosaurus bones were first discovered in Egypt in 1912 by German paleontologist Ernst Stromer in 1915. Two species, S. aegyptiacus and S. marocannus which is most likely invalid.Spinosaurus looked like Baryonyx, except it was larger and more heavily built. Six specimens of Spinosaurus have been uncovered. The first fossils were destroyed in Munich, during World War II, in a 1944 bombing raid by the British. A note on classification: The material also supports the monophyly of the Spinosaurinae and the separation of Spinosaurus and Irritator. == Description == 99-93.5 million years ago, the Sahara Desert was wet. Animals included the pterosaur Alanqa, types of giant crocodylomorphs, and theropod predators close to the size of T. rex. The largest predator was Spinosaurus. In the past, it was thought that Spinosaurus aegyptiacus was bipedal. By 2014, some scientists believed that Spinosaurus aegyptiacus was quadrupedal because it is front-heavy. But later reaserch suggests it could walk bipedally Spinosaurus was longer than Tyrannosaurus. Estimates published in 2005, 2007, and 2008 suggested that it was between 15 metres (50 ft) in length and 7 to 20.9 tonnes (7.7 to 23.0 short tons) in weight. A new estimate published in 2014 and based on a more complete specimen, supported the earlier research, finding that Spinosaurus could reach lengths of over 15 m (49 ft). However in 2022 a study by Paul Sereno and colleuges said that Spinosaurus would reach a maximum body length and weight of 14 meters and 7.4 metric tonnes respectively It had a two meter high sail on its back like Dimetrodon. Several uses have been suggested for this sail, such as to help control its body temperature but this is considered not likely by current scientific reaserch , as a way to attract a mate, for species reognitionand to intimidate or frighten enemies. It was most likely used for the latter 3 purposes. It lived in what is now the Sahara Desert, but which then was mangrove forests alongside shoreline conditions, tidal flats and channels. The skull of Spinosaurus was long and narrow like that of a modern orinoco crocodile. Spinosaurus is known to have eaten fish. Evidence suggests that it lived like a giant heron == Media == It was featured as the main dinosaur in the 2001 film Jurassic Park III where it fights and kills a T-Rex. It has also appeared on postage stamps in several countries, and many toy companies have made models of Spinosaurus. == References == Category:Spinosauridae Category:Dinosaurs of Africa Category:Cretaceous dinosaurs",
 "title": "Spinosaurus"
}