{
 "id": "440368",
 "text": "The United States Women's Bureau (WB) is an agency of the United States government. It is a part of the United States Department of Labor. The Woman's Bureau was established by Congress in 1920. It is the only federal agency mandated to represent the needs of women wage earners in the public policy process. The Director is appointed by the President and confirmed by the Senate. He or she is supported by a staff in the national office as well as ten regional offices. ==History== In 1918 President Woodrow Wilson created Woman in Industry Service.Theda Skocpol, Protecting Soldiers and Mothers: The Political Origins of Social Policy in the United States (Cambridge, MA: Harvard University Press, 1995), p. 419 It was the predecessor of the more permanent Women's Bureau which was founded in 1920.Encyclopedia of U.S. Labor and Working-class History, Volume 1, ed. Eric Arnesen (New York; Oxford: Routledge, 2007), p. 1512 The agency was founded by an act of Congress. The first director was Mary Anderson.Jill Roe, Her Brilliant Career: The Life of Stella Miles Franklin (Cambridge, MA: Harvard University Press, 2009), p. 255 She had been the assistant director of the Woman in Industry Service. She remained the director through World War II.Notable American Women: The Modern Period: a Biographical Dictionary (Cambridge: The Belknap Press of Harvard University Press, 1980), p. 149 In 1922, the WB investigated and reported on the conditions facing 'negro women in industry.' The WB successfully advocated for the inclusion of women under the Fair Labor Standards Act of 1938. By 1942 shortages of manpower and efforts by woman's advocate groups such as the Women's Bureau saw the female labor force go up from 12 to 18 million.Rosalind Rosenberg, Changing the Subject: How the Women of Columbia Shaped the Way We Think About Sex and Politics (New York: Columbia University Press, 2004), p. 179 Their wages doubled and even tripled during the war. But after the war the difference between woman's and men's working wages returned. In the 1950s, the Woman's Board focused on 'older women as office workers.' The WB played a large role in the passage of the Equal Pay Act of 1963. In 1982, the Woman's Board started a major initiative to encourage employer-sponsored childcare. This was followed by the start of a multimedia Work and Family Clearinghouse in 1989. they also worked for the passage of the Family and Medical Leave Act of 1993. In 1996, the Woman's Board published a fact sheet on the workplace effects of domestic violence. == Related pages == * United States Department of Labor * Fair Labor Standards Act of 1938 * Equal Pay Act of 1963 == References == == Other websites == * US Department of Labor; Woman's Bureau Category:1920 establishments in the United States Category:United States Department of Labor",
 "title": "United States Women's Bureau"
}