{
 "id": "440324",
 "text": "Joseph Shuster (July 10, 1914 – July 30, 1992) was a Canadian-American cartoonist. Shuster along with Jerry Siegel created Superman. It proved one of the most popular and influential comic book hero in comic book history. Shuster died of a heart failure and hypertension in Los Angeles, California, aged 78.Folkart, Burt A. (August 3, 1992). \"Joe Shuster, Co-Creator of Superman, Dead at 78\". Los Angeles Times.McGasko, Joe (June 18, 2013). \"The Superman Curse\" . The Biography Channel. == Creating Superman == Schuster and Siegel created a bald telepathic villain, willing world domination, as the protagonist of the short story The Reign of Superman, published in Siegel's 1933 science fiction Science Fiction № 3. The character was not successful, and Siegel found a more familiar hero. Schuster modeled the character on Douglas Fairbanks, and his alter ego in glasses, Clark Kent, a combination of Harold Lloyd and Schuster himself, and the name \"Clark Kent\" comes from the stars of the films Clark Gable and Kent Taylor. Lois Lane was modeled after Joanna Carter, who was Joe's friend before she became Siegel's wife. Then Siegel and Schuster began a six-year search for a publisher. They called the project The Superman and brought it to Consolidated Book Publishing, which published a 48-page black-and-white comic book called \"Detective Dan: Secret Operative\" № 48, but after that this cooperation finished. Schuster took this to heart and burned every page of the story, only the cover was saved. Siegel and Schuster compared this character to Slam Bradley, an adventurer the couple created for Detective Comics № 1 (March, 1937). In 1938, editor Vin Sullivan chose it as a cover feature for National Action Comics №1 (June, 1938). The following year, Siegel and Schuster initiated a series of Superman comics. Then Siegel and Schuster sold the company's rights to $130 and a contract to supply to the publisher of Action Comics. Siegel and Schuster's status as children of Jewish immigrants is also believed to have an influence on their work. Timothy Aaron Pevey claimed that they had created \"a figure whose desire was to fit into American culture as an American,\" which Pevey felt was an important aspect of the American personality. When Superman first appeared, Clark Kent's Superman alter ego worked for the Daily Star, named Schuster after the Toronto Daily Star, his former employer in Toronto. Schuster said that he modeled the urban landscape of Superman's hometown of Metropolis from his old hometown. When the comic strip became international, the company was finally renamed the Daily Planet. ==References== ==Other websites== *Comic Art & Graffix Gallery – Artist Biography *Additional, Aug 13, 2008. Category:1914 births Category:1992 deaths Category:Deaths from heart failure Category:Naturalized citizens of the United States Category:American comics artists Category:American cartoonists Category:Writers from Ontario Category:People from Toronto",
 "title": "Joe Shuster"
}