{
 "id": "440553",
 "text": "Valéry Marie René Georges Giscard d'Estaing (, , ; 2 February 19262 December 2020), also known as Giscard or VGE, was a French politician and writer. He was the 20th President of France from 1974 to 1981 during the Fifth Republic. Born in Koblenz, Germany, Giscard d'Estaing began his political career as a Gaullist and slowly began to change his political thinking around the time he was the Minister of Finance when Jacques Chaban-Delmas and Pierre Messmer were prime ministers. He won the presidential election of 1974 with 50.8% of the vote against François Mitterrand of the Socialist Party. His presidency was seen as liberal for his focus on divorce, birth control and abortion. His presidency helped modernise the country because he helped create TGV and supported nuclear power. However, he became unpopular because of a bad economy and the 1973 energy crisis, which many felt that it was the end of the \"Trente Glorieuses\". In 1981, he lost his re-election campaign to Mitterrand, with 48.2% of the vote. After his presidency, he was a member of the Constitutional Council. He also was President of the Regional Council of Auvergne from 1986 to 2004. Giscard d'Estaing focused on the European Union after his presidency. He was in charge of the Convention on the Future of Europe that created the treaty that would have created a constitution for Europe, but it did not pass. In 2003, he was elected to the Académie française and was given the Charlemagne Prize. At the time of his death at age 94 years, Giscard d'Estaing was the longest-lived French president in history. He died in December 2020 from COVID-19. ==Early life== Giscard d'Estaing was born on 2 February 1926 in Koblenz, Germany, during the French occupation of the Rhineland. He was the oldest son of Jean Edmond Lucien Giscard d'Estaing and his wife Marthe Clémence Jacqueline Marie (May) Bardoux. Giscard d'Estaing had an older sister, Sylvie and younger siblings Olivier, Isabelle, and Marie-Laure. He joined the French Resistance and was part of the Liberation of Paris where he protected Alexandre Parodi. He then joined the French First Army. He was later given the Croix de guerre for his military work. He studied at Lycée Blaise- Pascal in Clermont-Ferrand, École Gerson and Lycées Janson-de-Sailly and Louis-le-Grand in Paris. He graduated from the École polytechnique and the École nationale d'administration. He later joined the Inspection des finances. He worked in the Tax and Revenue Service, then joined the staff of Prime Minister Edgar Faure from 1955 to 1956. ==Early political career== In 1956, Giscard d'Estaing was elected to the National Assembly as a deputy for the Puy-de-Dôme département. He joined the National Centre of Independents and Peasants (CNIP), a conservative group. After the Fifth Republic was created, the CNIP leader Antoine Pinay became Minister of Economy and Finance and chose him as Secretary of State for Finances from 1959 to 1962. ===Member of the Gaullist majority=== In 1962, when Giscard d'Estaing was nominated as Minister of Economy and Finance, his party split up with the Gaullists and left the majority coalition. At first, Giscard d'Estaing was a supporter of French president Charles de Gaulle. He did not support this and founded the Independent Republicans (RI). During this time, he supported the United States dollar to be used for international payments.Barry Eichengreen, Exorbitant Privilege: The Rise and Fall of the Dollar and the Future of the International monetary system, p. 4. In 1966, Giscard d'Estaing was removed from the cabinet. He made the RI into a political party, the National Federation of the Independent Republicans (FNRI), and founded the Perspectives and Realities Clubs. In 1969, Giscard d'Estaing supported a \"no\" vote in the constitutional referendum which focused on the regions and the Senate. De Gaulle had said that he would resign if the \"no\" vote won. After De Gaulle resigned, many of his supporters blamed Giscard d'Estaing for De Gaulle's resignation. From 1967 to 1974, he was Mayor of Chamalières. During the 1969 presidential campaign, he supported the winning candidate Georges Pompidou. He later became the Minister of Economy and Finance again. ==President of France== === Presidential election victory === In 1974, after the death of President Georges Pompidou, Giscard d'Estaing announced his candidacy for the presidency. His two main challengers were François Mitterrand for the left and Jacques Chaban-Delmas, a former Gaullist Prime Minister. Jacques Chirac explained that Giscard d'Estaing was the best candidate to stop Mitterrand from being elected. In the election, Giscard d'Estaing beat Mitterrand by a small number of votes, winning 50.7% of the vote which was 425,000 votes. At 48, he was the third youngest president in French history at the time, after Louis-Napoléon Bonaparte and Jean Casimir-Perier. ===Domestic activities=== When Giscard d'Estaing made it easier for people to get political asylum, he expanded health insurance, lowered the voting age to 18, and modernised the divorce law. He supported the creation of the TGV high speed train network and the Minitel telephone upgrade. He supported nuclear power. Economically, Giscard d'Estaing's presidency increased personal incomes, as employment went up 29% and pensions by 65%. Giscard d'Estaing tried to make the presidency look less like a monarchy. He rode the Métro, ate monthly dinners with citizens, and even invited garbage men from Paris to have breakfast with him in the Élysée Palace. Many of his critics believed that Giscard was not formal enough to be president. Many conservatives that supported him slowly began to criticise him because he helped legalise abortion. Even though he was against the death penalty, Giscard d'Estaing said in his 1974 campaign that he would support the death penalty for some criminals. He did not remove three death sentences that happened during his presidency, making France the last country in Europe to take part of death penalty. Prime Minister Jacques Chirac, who resigned in 1976, began to criticise Giscard d'Estaing's leadership and later became political enemies with him. ===Foreign activities=== Giscard d'Estaing was a close friend of West German Chancellor Helmut Schmidt and together they helped create the European Monetary System. They also helped make the Soviet Union support the Helsinki Accords. He supported creation of the European Council at the Paris Summit in December 1974. In 1975, Giscard d'Estaing made the King of Spain Juan Carlos I to ban Chilean dictator Augusto Pinochet from his coronation by saying that if Pinochet went, he would not. Although France accepted many Chilean political refugees, Giscard d'Estaing's government secretly worked with Pinochet's and Argentina's Jorge Rafael Videla's dictatorship governments. Giscard d'Estaing supported de Gaulle's African policy where supported delivering oil supplies to and from Africa. In 1977, in the Opération Lamantin, he ordered the French military to go to Mauritania and stop the Polisario guerrillas fighting against Mauritania. Giscard d'Estaing became controversial for his support of Jean-Bédel Bokassa in the Central African Republic. Due to the growing unpopularity of that government, he began to slowly criticise Bokassa. In 1979's Operation Caban, French troops helped remove Bokassa from power and made former president David Dacko the new leader. The Diamonds Affair, known in France as l'affaire des diamants, was a major political scandal in the Fifth Republic. In 1973, while Minister of Finance, Giscard d'Estaing was given diamonds by Bokassa. Many believe this is what made him lose his re-election. ===Re-election loss=== In the 1981 presidential election, Giscard d'Estaing's re-election was in trouble because former Prime Minister Chirac ran against him. Chirac finished third and did not tell his supporters to vote for Giscard in the second round of the election. Giscard d'Estaing lost to Mitterrand by 3 points in the runoff, ending a 23-year conservative presidential span. He blamed Chirac for his defeat. Giscard d’Estaing was seen as an important person in modernising France and making the European Union strong. He was popular because his presidency passed many small social reforms, such as lowering the voting age by three years, allowing divorce by common consent, and legalising abortion. However, he was unable to fix the great economic crisis of his term, a worldwide economic recession caused by a massive increase in oil prices. His foreign policy was remembered for his close relationship with West German Chancellor Helmut Schmidt. Together they helped expand and made Europe's economic power stronger as they pushed for the European Monetary System and helped create the G-7 system. ==Post-presidency== After he lost in 1981, Giscard d'Estaing retired for a short time from politics. In 1984, he was re- elected to his seat in the National Assembly and won the presidency of Auvergne. He was President of the Council of European Municipalities and Regions from 1997 to 2004. In 1982, along with former U.S. President Gerald Ford, Giscard d'Estaing co-founded the annual AEI World Forum. He has also was a member of the Trilateral Commission after being president. Giscard d'Estaing hoped to become prime minister after the re-election of Mitterrand, but he was not chosen for this job. During the 1988 presidential campaign, he did not support two of his two former Prime Ministers Jacques Chirac and Raymond Barre. Giscard d'Estaing was President of the UDF from 1988 to 1996. Most of the UDF politicians supported the candidacy of the RPR Prime Minister Édouard Balladur at the 1995 presidential election, but Giscard d'Estaing supported Chirac, who won the election. In 2000, he created a proposal to limit the length of a presidential term from seven to five years, a proposal that eventually won its referendum proposal by President Chirac. Following his retirement from the National Assembly his son Louis Giscard d'Estaing was elected. In 2003, Giscard d'Estaing became a member of the Académie française. In 2004, he became a member of the Constitutional Council.VGE page on Oxford Reference. His support for creating a European Constitution, were criticised. Many believed Giscard should have been removed from the council and be given a life membership in the Senate.\"La Chiraquie veut protéger son chef quand il quittera l'Elysée\", Libération, 14 January 2005 He supported the presidential campaigns of Nicolas Sarkozy in 2007 and François Fillon in 2017. In 2013, Giscard d'Estaing supported same-sex marriage in France. On 21 January 2017, he became the oldest former president in French history. ==European activities== Giscard d'Estaing was a supporter of a stronger European Union. From 1989 to 1993, Giscard d'Estaing was a member of the European Parliament. From 1989 to 1991, he was also chairman of the Liberal and Democratic Reformist Group. From 2001 to 2004, he was President of the Convention on the Future of Europe. On 29 October 2004, the European heads of state approved and signed the European Constitution based on a draft supported by Giscard d'Estaing's work at the Convention. Although the constitution was not approved by French voters in May 2005, Giscard d'Estaing continued to support for its passage in other European Union states. Giscard d'Estaing was a supporter of the Lisbon Treaty. In 2008 he became the Honorary President of the Permanent Platform of Atomium Culture. On 27 November 2009, Giscard d'Estaing started the Permanent Platform of Atomium Culture during its first meeting, held at the European Parliament. ==Personal life== Giscard d'Estaing's name was often shortened to \"VGE\". He was also known as l'Ex, especially during the time he was the only living former president. On 17 December 1952, Giscard d'Estaing married Anne-Aymone Sauvage de Brantes. His family did not live in the presidential Élysée Palace during his presidency. In 1974, Le Monde reported that he used to leave a letter about where he was in case of an emergency. In May 2020, Giscard d'Estaing was accused of touching a German journalist's buttocks during an interview in 2018. He denied the accusations, saying that he never did this, however apologised to the reporter. In 2005, he and his brother bought the castle of Estaing. However, many newspapers in different countries why they bought with many believing they wanted to become French nobility. It was put up for sale in 2008 for €3 million It is now owned by the Valéry Giscard d'Estaing Foundation. Giscard d'Estaing wrote his second romantic novel, published on 1 October 2009 in France, titled The Princess and the President. It tells the story of a French leader having a romantic affair with a character called Patricia, Princess of Cardiff. This caused many rumours that the book was based on a real-life affair between Giscard d'Estaing and Diana, Princess of Wales. He later said that such an affair never happened and that the book was fictional. ==Death== On 14 September 2020, Giscard d'Estaing was hospitalised for breathing problems at the Hôpital Européen Georges-Pompidou in Paris. He was later diagnosed with a lung infection. He was hospitalised again on 15 November, but left the hospital on 20 November. Giscard d'Estaing died of problems caused by COVID-19 on 2 December 2020 during the pandemic in France at his Authon, Loir-et-Cher home, aged 94. His funeral and burial was held on 5 December in Authon with forty people going the event. President Emmanuel Macron released a statement calling Giscard d'Estaing a \"servant of the state, a politician of progress and freedom\". Macron declared a national day of mourning for Giscard d'Estaing on 9 December. Former presidents Nicolas Sarkozy and François Hollande, 2017 presidential candidate Marine Le Pen, German Chancellor Angela Merkel, and European Union leaders Charles Michel, David Sassoli, and Ursula von der Leyen all talked positively about Giscard d'Estaing's role in modernising France and relations with the European Union. ==Honours and awards== Giscard d'Estaing was honoured with the Grand-croix of the Legion of Honour and of the Ordre National du Mérite. In 1966, he was made Knight Grand Cross of the Order of Isabella the Catholic. In 1973, Giscard d'Estaing was honored with the Knight Grand Cross of the Order of Merit of the Italian Republic. In 1975, Giscard d'Estaing was honoured with Portugal's Grand Collar of the Order of Saint James of the Sword. In 1976, he was honoured with the Order of the Bath, and Order of the Southern Cross. In 1978, Giscard d'Estaing was made Knight of the Order of the Elephant and honoured with the Grand Collar of the Order of Prince Henry by Portugal. That same year, he was honored with the Order of Charles III by Spain. In 1980, Giscard d'Estaing was honoured with the Order of the Seraphim. In 1979, he was given the Nansen Refugee Award. In 2003, Giscard d'Estaing received the Charlemagne Award of the German city of Aachen. He was also a Knight of Malta. ==References== ==Other websites== * Biography on the French National Assembly website * First and second-round results of French presidential elections * Category:1926 births Category:2020 deaths Category:Deaths from the COVID-19 pandemic in France Category:People from Koblenz Category:Politicians from Rhineland-Palatinate Category:Presidents of France Category:Recipients of the Order pro merito Melitensi Category:French Ministers of Finance Category:French military people Category:French Roman Catholics Category:Princes of Andorra Category:Anti-communists Category:French novelists Category:French mayors Category:20th-century presidents of France",
 "title": "Valéry Giscard d'Estaing"
}