{
 "id": "440530",
 "text": "Earnest Lee \"Ernie\" Hudson (born December 17, 1945) is an American actor.Ernie Hudson Biography, FilmReference.com. He is known for his roles as Winston Zeddemore in the Ghostbusters movie series, Sergeant Albrecht in The Crow, and Warden Leo Glynn on HBO's Oz. ==Filmography== Year Title Role Notes 1976 Leadbelly Archie The Human Tornado Bo Credited as Louis Hudson 1979 The Main Event Killer 1980 Joni Earl The Octagon Quinine The Jazz Singer Heckler 1981 Underground Aces African General 1982 Penitentiary II Half Dead 1983 Spacehunter: Adventures in the Forbidden Zone Washington Going Berserk Muhammed Jerome Willy Two of a Kind Det. Skaggs 1984 Ghostbusters Winston Zeddemore National Lampoon's Joy of Sex Mr. Porter 1987 Weeds Bagdad 1988 The Wrong Guys Dawson 1989 Trapper County War Jefferson Carter Leviathan Justin Jones Collision Course Shortcut Ghostbusters II Winston Zeddemore 1992 The Hand That Rocks the Cradle Solomon 1994 Sugar Hill Lolly Jonas No Escape Hawkins The Crow Sergeant Albrecht The Cowboy Way Officer Sam 'Mad Dog' Shaw Airheads Sergeant O'Malley Speechless Ventura 1995 The Basketball Diaries Reggie Congo Captain Monroe Kelly 1996 Tornado! Dr. Joe Branson The Substitute Principal Claude Rolle For Which He Stands DEA Agent Baxter Just Your Luck Willie 1997 Fakin' Da Funk Joe Lee Mr. Magoo Agent Gus Anders, CIA Levitation Downbeat 1998 Butter Curtis \"8 Ball\" Harris Stranger in the Kingdom Rev. Walter Andrews Best of the Best: Without Warning Detective Gresko October 22 Arthur 1999 Lillie Larry Miller Shark Attack Lawrence Rhodes The Last Siege Senator Douglas Wilson Interceptors Major McKenzie Stealth Fighter President Westwood 2000 Red Letters Detective Glen Teal The Watcher Ibby Paper Bullets Detective Ron Mills Miss Congeniality FBI Asst. Director Harry McDonald Everything's Jake Jake 2003 Anne B. Real Principal Davis 10-8: Officers on Duty Senior Deputy John Henry Barnes 2004 Clifford's Really Big Movie P.T. Voice role 2005 Marilyn Hotchkiss' Ballroom Dancing and Charm School Blake Rische Miss Congeniality 2: Armed and Fabulous FBI Asst. Director Harry McDonald Everwood Bill Hoover Halfway Decent Tom 2006 Hood of Horror Roscoe 2007 Certifiably Jonathan Museum Guard Nobel Son Sgt. Bill Canega All Hat Jackson Jones 2008 The Man in the Silo Marcus Wells Pie'n Burger Cedric Balancing the Books Detective Carter 2009 Dragonball Evolution Sifu Norris Lonely Street Capt. Morgan Machete Joe Sheriff Taylor Pastor Brown Deacon Harold Todd 2010 Smokin' Aces 2: Assassins' Ball Anthony Vejar Stasis Stranger Short film Game of Death Catholic Priest Ultraman Zero: The Revenge of Belial Jean-Bot English Voice Dubbing for 2012 2011 Beverly Hills Chihuahua 2 Pedro Voice role 2012 Beverly Hills Chihuahua 3: Viva La Fiesta! Pedro Voice role Turning Point Joe Johnson Mickey Matson and the Copperhead Conspiracy Ivan Stumpwater 2014 You're Not You John 2015 Gallows Road Bob Collins 2016 Batman: Bad Blood Lucius Fox Voice role God's Not Dead 2 Judge Stennis Ghostbusters Uncle Bill Jenkins Cameo Spaceman Joe 2018 Nappily Ever After Richard Jones 2020 Ghostbusters 2020 Winston Zeddemore Post-production ==References== ==Other websites== * *Interview (March 2008) with Ernie Hudson, by Matthew Waldram Category:1945 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:Actors from Michigan",
 "title": "Ernie Hudson"
}