{
 "id": "440535",
 "text": "Tun Dr. Mahathir bin Mohamad (Jawi: ; born 10 July 1925) is a Malaysian politician. He was the Prime Minister of Malaysia from May 2018 to March 2020. He was also the fourth Prime Minister of Malaysia. He held the job for 22 years from 1981 to 2003. This made him Malaysia's longest-serving Prime Minister. His political career lasted for almost 70 years. Mahathir studied medicine and worked as a doctor before entering politics. Mahathir became Prime Minister of Malaysia in 1981 and held the position until 2003. During his time in office, he focused on modernizing Malaysia's economy and infrastructure. He implemented various policies to promote industrialization and technological development, which contributed to Malaysia's economic growth. As Prime Minister, Mahathir was known for his strong leadership and vision for Malaysia's future. He promoted policies aimed at reducing poverty and improving education and healthcare. His efforts helped Malaysia become one of the more prosperous nations in Southeast Asia. After retiring as Prime Minister in 2003, Mahathir remained active in Malaysian politics and continued to advocate for various social and economic issues. In 2018, Mahathir announced his bid for another term as Malaysian Prime Minister for the 2018 general election. He won the election in May 2018. On 24 February 2020, Mahathir announced his resignation as Prime Minister.Malaysia's PM Mahathir Mohamad resigns amid political turmoil Throughout his career, Mahathir has been widely respected for his dedication to Malaysia's development and his commitment to improving the lives of its people. His contributions to the country's progress and his leadership continue to be remembered positively by many Malaysians. Even after retirement, he continues to be active and speaks publicly. ==Early life and political career== Mahathir born on July 10, 1925, in Alor Setar, Kedah, became politically active after World War II. He protested against the Malayan Union's decision to grant citizenship to non- Malays. Mahathir excelled in his studies and became a medical doctor. He joined UMNO (United Malays National Organisation) and entered Parliament in 1964. After serving one term, he lost his seat and was expelled from UMNO due to disagreements with Prime Minister Tunku Abdul Rahman. During his time away from mainstream politics, Mahathir wrote his first book, The Malay Dilemma, advocating for affirmative action for Malays in education and society. The book criticized the government led by Tunku Abdul Rahman and was banned upon publication. Mahathir returned to UMNO and Parliament after Tunku Abdul Rahman resigned. He was appointed to the Cabinet and became Deputy Prime Minister by 1976. In 1981, Mahathir was sworn in as Malaysia's Prime Minister, a position he held for over two decades. ==First term as prime minister (1981-2003)== Mahathir became Prime Minister on July 16, 1981, when he was 56 years old. In his early years as leader (1981-1987), he worked to strengthen his position in UMNO and won the 1982 general election. Economically, Mahathir supported privatization, thinking the government shouldn't be in business. He privatized airlines, utilities, and telecom firms, averaging about 50 a year by the mid-1990s. This improved conditions and made good money for the government. During this time, Mahathir led the building of the North-South Expressway, a big highway from Thailand to Singapore. He also started Proton, a car company with Mitsubishi. Proton faced problems at first but became the biggest car maker in Southeast Asia by the late 1980s, helped by tariffs. In 1989, Mahathir had a heart attack but got better and led Barisan Nasional to win the 1990 election. When the Malaysian New Economic Policy ended in 1990, Mahathir made Vision 2020. This plan aimed for Malaysia to become a fully developed country by 2020 with strong economic growth. In the 1990s, Mahathir started important projects to make Malaysia better. He created the Multimedia Super Corridor to help technology and business. Mahathir also built Putrajaya as Malaysia's main place for government offices. Additionally, he made the Petronas Twin Towers, which became symbols of Malaysia growing and getting stronger during his time as leader. In 1997, there was a big problem with haze in Southeast Asia caused by fires in Indonesian forests; Mahathir started a firefighting operation across borders to help deal with it. During the Asian financial crisis in 1997, Mahathir didn't follow advice from the IMF and his deputy, Anwar Ibrahim. Instead, he spent more money and made Malaysia's money stay the same as the US dollar. This helped Malaysia recover faster than other countries nearby. In September 2003, five years after Malaysia introduced capital controls following the financial crisis, the IMF agreed that Malaysia was correct to make its own decisions. At a UMNO meeting in 2002, Mahathir said he would stop being prime minister. But his supporters came up to him and asked him to stay, so he changed his mind. He decided to retire in October 2003 to help the next leader, Abdullah Ahmad Badawi, take over smoothly. Mahathir had been the leader for more than 22 years, making him the longest- serving elected leader in the world when he retired. ===Foreign relations=== ====United States==== During Mahathir's rule, the United States was the largest foreign investor and one of Malaysia's closest allies. Mahathir always spoke out against U.S. foreign policy. From 17 to 20 January 1984, Mahathir had an official working visit to the United States. During this visit, he met President Ronald Reagan. Afterward, he had a private visit to Tulsa, Oklahoma. During his tenure as Prime Minister, Mahathir also had unofficial meetings with other US Presidents George H. W. Bush, George W. Bush, and Bill Clinton in various locations to discuss palm oil issues and America's stance toward Muslim countries. Mahathir criticized the 2003 U.S.-led Iraq invasion and accused Halliburton, once led by Vice President Dick Cheney, of making billions in profits. He said Halliburton's stock price rose from $10 before the war to about $46 after winning Iraq contracts worth nearly $20 billion. Mahathir called Cheney and President Bush \"war criminals\" and said they should be tried for their actions in Iraq. ==Interim years (2003–2018)== After retiring in 2003, Mahathir received the title Tun. He said he would quit politics completely and turned down a role in Abdullah Badawi's government. Despite this, Mahathir kept busy as CEO, Chairman, and advisor to important Malaysian companies like Proton and Petronas. In 2015, Mahathir strongly criticized Prime Minister Najib Razak's government, especially over the 1Malaysia Development Berhad scandal. He called for Najib to step down and even joined a large protest rally called Bersih 4 with his wife, Siti Hasmah Mohamad Ali. In 2016, Mahathir founded Parti Pribumi Bersatu Malaysia (PPBM). By 2017, he joined the opposition group Pakatan Harapan and became its chairman. On 8 January 2018, Mahathir was chosen as the prime ministerial candidate for Pakatan Harapan in the election on May 9. He wanted to replace his former ally, Najib Razak. Wan Azizah Wan Ismail, the wife of Mahathir's former rival Anwar Ibrahim, was his deputy candidate. ==Second term as prime minister (2018–2020)== On 10 May 2018, Pakatan Harapan won the election, making Mahathir Prime Minister again. This victory ended Najib's time as the 6th Prime Minister of Malaysia. Mahathir took the oath of office as the 7th Prime Minister at 9:30 pm on May 10, 2018. Mahathir became the world's oldest serving state leader at 92 years and 304 days old, and the first Malaysian prime minister not from UMNO. His deputy, Wan Azizah, became Malaysia's first female deputy prime minister. In April 2019, Mahathir was named one of Time magazine’s 100 most influential people. ===Domestic affairs=== Mahathir said he would \"restore the rule of law\" and reopen investigations into the 1Malaysia Development Berhad scandal. He told the media that Najib might be punished if found guilty of corruption. Mahathir also told immigration officials to stop Najib and his wife Rosmah Mansor from leaving the country when they tried to go to Indonesia. In June 2018, Mahathir set up his seventh government with 29 ministers. He removed the unpopular Goods and Services Tax, lowering it from six percent to zero. Mahathir also said he would cut government spending by letting go of many civil servants, stopping an expensive high-speed rail link between Kuala Lumpur and Singapore, and reducing big construction projects started by Najib. Under Mahathir's leadership, Malaysia's press freedom got a bit better, and its rank in the Press Freedom Index improved. The government said it would limit palm oil farming to 6.55 million hectares by 2023 and began trying to improve palm oil's reputation worldwide through lobbying efforts. On 20 June 2018, Mahathir met with the father of murdered Mongolian woman Altantuya Shaariibuu and they agreed to reopen the case of her murder. In October 2019, Mahathir announced the Shared Prosperity Vision 2030, aiming for Malaysia to become a high-income country by 2030. His government also focused on making defense more transparent by preparing Malaysia's first defense policy white paper to outline future plans. ===Foreign relations=== In his second term, Mahathir visited Japan and Indonesia to make friends stronger. He met twice with President Rodrigo Duterte to work together on safety, money, and politics with the Philippines. Mahathir also worked on getting along better with Japan and getting closer to Russia in trading and defense. He went to a meeting in Vladivostok for the Eastern Economic Forum in late 2019. Malaysia made a new plan for how it deals with other countries in late 2019. Mahathir and Indonesian President Joko Widodo talked about what to do about European Union rules that affect palm oil fuel. Mahathir criticized the killing of Saudi journalist Jamal Khashoggi in October 2018 and the assassination of Iranian General Qasem Soleimani by the United States in 2020. Mahathir supported the peace talks between North and South Korea in 2018–19. He also said Malaysia would reopen its embassy in North Korea, which had been closed since Kim Jong- nam was assassinated in 2017. ====China==== Mahathir's government wanted to maintain good relations with China but decided to review all Belt and Road Initiative projects started by the previous Malaysian government. He called these projects \"unequal treaties.\" His administration paused work on the East Coast Rail Link but later resumed it after renegotiating terms. Mahathir also canceled about $2.8 billion in deals with China Petroleum Pipeline Bureau due to high repayment costs. On 13 February 2020, Mahathir talked with Chinese President Xi Jinping to show support and discuss working together on the COVID-19 outbreak. ===Resignation=== Mahathir resigned as Prime Minister on 24 February 2020. After his resignation, he served as the interim Prime Minister until a new Prime Minister was appointed. During this time, he continued to manage the government's day-to-day operations. In March 2020, Muhyiddin Yassin was appointed as the new Prime Minister, and Mahathir stepped down from his interim role. ==Post-premiership (2020–present)== Mahathir started the Homeland Fighter's Party (PEJUANG) in August 2020. His son Mukhriz Mahathir and three other MPs joined. The party was registered in July 2021. In August 2021, Mahathir and other MPs protested in Merdeka Square, demanding Muhyiddin resign for his handling of the COVID-19 pandemic after police blocked them from entering parliament. He said he would run in the 2022 general election. On 19 November, he lost his seat and election deposit, which was his first loss in 53 years. No one from PEJUANG or Gerakan Tanah Air won a seat. He later said he would drop his party’s plans and focus on writing about Malaysian history. On 16 December 2022, Mahathir has resigned as Pejuang chairperson. On 10 February 2023, he was one of 13 leaders who left the party after it decided to end its relationship with GTA. Mahathir later joined the party called Parti Bumiputera Perkasa Malaysia (Putra). ==Personal life== Mahathir enjoys sailing, horse riding, and carpentry. He has made a working steam train and a boat. Mahathir says he lives a long life because he eats well, reads newspapers daily, exercises, and stands up straight. His favorite song is \"My Way\". He likes to read books by Wilbur Smith and Jeffrey Archer. People often ask him how he has lived so long. He says it's because he stays active and keeps his mind sharp. On 23 September 2024, Mahathir shared a video of himself driving at the Sepang International Circuit (SIC). In the three- minute clip, he pressed the gas and reached a speed of 154 km per hour. On 13 October 2024, Mahathir talked about his health, saying he is thankful that he can still work and think. ===Marriage and family=== In college, Mahathir met his future wife, Siti Hasmah Mohamad Ali, who was also studying medicine. They got married in 1956. They have four biological children: Marina (born in 1957), Mirzan, Mokhzani and Mukhriz. They also adopted three more children, Maizura, Melinda and Mazhar, over the next 27 years. ===Health=== In 1989, Mahathir had a heart attack. His doctor suggested surgery in the United States, but he disagreed. Many people were surprised by his decision. He explained, \"I had to trust our Malaysian doctors. If I didn't set an example, others wouldn't trust our medical services.\" Reflecting on why he chose not to go abroad for surgery, he wrote, \"Being a doctor myself, I understood the risks. I knew there was a chance I might not survive because it was not a common procedure at that time.\" On 9 November 2006, Mahathir had a heart attack and was taken to the hospital at 4 a.m. in the morning. In September 2007, he underwent heart bypass surgery after experiencing two heart attacks within 10 months. On 16 December 2021, Mahathir went to the National Heart Institute for a check-up and to be watched by doctors. He left the hospital after a few days. In January 2022, Mahathir had a planned medical procedure at the same hospital. He went back to the hospital later that month and stayed in the coronary care unit. After leaving the hospital again, he kept getting treatment and getting better. On 31 August 2022, Mahathir was hospitalized after testing positive for Covid-19. On 1 August 2023, he was admitted to the National Heart Institute to treat an infection. On 26 January 2024, Mahathir went to the National Heart Institute because he was sick. He left on March 18, after being there for 53 days. Four months later on 15 July, Mahathir was admitted to the hospital because he was coughing. On 29 July, Sufi Yusoff, a spokesperson for Mahathir, said that Mahathir is allowed to go back home. A few months later on 16 October, he was hospitalized again for a respiratory tract infection. ==Legacy== Mahathir knew industrialization and exports were key. Under him, Malaysia tried to diversify its economy and move away from traditional sectors. Manufacturing, especially electronics, cars, and textiles, became important. His government encouraged foreign investment, gave incentives for industry, and improved infrastructure to support new businesses. He successfully raised Malaysia's profile on the world stage and made it one of the leading Asian economies in the 1990s. Mahathir led the modernization of Malaysia by building the North-South Expressway and promoting major infrastructure projects like the Kuala Lumpur International Airport and the Petronas Twin Towers. These achievements and more have earned him the title of Malaysia’s Father of Modernization (Bapa Pemodenan). In 1998, Malaysia faced a serious economic crisis due to external and internal problems. Mahathir took strong actions to stabilize and recover the economy. His government set up capital controls, fixed the ringgit’s value to the US dollar, and made major reforms to fix weaknesses in the financial system and corporate governance. During his time as Prime Minister, Mahathir strongly supported Bosniaks during the Bosnian War. Malaysia allowed Bosnians to enter without a visa and sent peacekeeping forces to Bosnia. Mahathir also helped organize an OIC summit in 1993 to discuss providing weapons for Bosnia and worked with other countries at the UN to support Bosnia. ==Awards and honours== ==Bibliography== ===Books=== * The Malay Dilemma (1970) * The Challenge (1986) * Regionalism, Globalism, and Spheres of Influence: ASEAN and the Challenge of Change into the 21st century (1989) * Mahathir, Great Malaysian Hero (1990) * The Asia That Can Say No (1994) * The Pacific Rim in the 21st century (1995) * The Challenges of Turmoil (1998) * The Way Forward (1998) * A New Deal for Asia (1999) * Islam & The Muslim Ummah (2001) * Globalisation and the New Realities (2002) * Reflections on Asia (2002) * The Malaysian Currency Crisis: How and why it Happened (2003) * Achieving True Globalization (2004) * Islam, Knowledge, and Other Affairs (2006) * Principles of Public Administration: An Introduction (2007) * Chedet.com Blog Merentasi Halangan (Bilingual) (2008) * A Doctor in the House: The Memoirs of Tun Dr Mahathir Mohamad (2011) * Doktor Umum: Memoir Tun Dr. Mahathir Mohamad (2012) *Blogging to Unblock (Book 2): A Citizen's Rights (2013) *Dr. M: Apa Habaq Orang Muda? (2016) * Capturing Hope: The Struggle Continues for a New Malaysia (2021) ==Related pages== *Mahathir, the Musical *Mahathir Science Award *List of oldest living state leaders *1987 United Malays National Organisation leadership election == Notes == ==References== ==More reading== * * ==Other websites== Category:Mahathir Mohamad Category:1925 births Category:Living people Category:Prime ministers of Malaysia Category:Deputy Prime Ministers of Malaysia Category:Grand Commanders of the Order of the Defender of the Realm Category:Malayali people Category:Malaysian writers Category:Muslims Category:Recipients of the Nishan-e-Pakistan Category:Mahathir Mohamad family",
 "title": "Mahathir Mohamad"
}