{
 "id": "440762",
 "text": "Long-term memory (LTM) is our memory of past events. It follows from short- term memory, and involves the growth of nerve synapses which are very long- lasting. == Types of LTM == The brain does not store memories in one unified structure, as might be seen in a computer's hard disk drive. Instead, different types of memory are stored in different regions of the brain. Long term memory is typically divided up into two major headings: explicit memory and implicit memory.Atkinson R.C. & Shiffrin R.M. 1968. Chapter: Human memory: a proposed system and its control processes. The psychology of learning and motivation 2: 89–195. === Explicit memory === Explicit or 'declarative' memory refers to memories which can be consciously recalled such as facts and knowledge. These are partly encoded by the hippocampus, stored elsewhere. Exactly where is unknown, but the temporal cortex has been proposed as a likely candidate. Research shows that amnesiac patients with damage to the medial temporal lobe performed more poorly on explicit learning tests than did healthy controls. However, the same patients performed at the same rate as healthy controls on implicit learning tests. This implies that the medial temporal lobe is heavily involved in explicit learning, but not in implicit learning.Meulemans, Thierry & Van der Linden, Martial 2003. Implicit learning of complex information in amnesia. Brain and Cognition, 52(2), 250-257. Aggleton, John P. 200). Understanding anterograde amnesia: Disconnections and hidden lesions. The Quarterly Journal of Experimental Psychology, 61(10), 1441-1471. ===Implicit Memory=== Implicit or procedural memory refers to the use of objects or movements of the body, such as how exactly to use a pencil, drive a car, or ride a bicycle. This type of memory is encoded and it is presumed stored by the striatum and other parts of the basal ganglia. The basal ganglia is believed to mediate procedural memory and other brain structures and is largely independent of the hippocampus.Foerde K. & Poldrack R.A. 2009. Procedural learning in humans. The New Encyclopedia of Neuroscience, 7, 1083-1091.https://dx.doi.org/10.1016/B978-008045046-9.00783-X The parietal and occipital regions are associated with implicit memory.Manelis A; Hanson C. & Hanson S.J. 2011. Implicit memory for object locations depends on reactivation of encoding-related brain regions. Human Brain Mapping, 32(1), 32-50.https://dx.doi.org/10.1002/hbm.20992Holz J. et al 2012. PLoS ONE, 7(7), 1–10 === Emotional memory === The memory for events that evoke a particularly strong emotion may involve both declarative and procedural memory processes. Emotional memories are consciously available, but elicit a powerful, unconscious physiological reaction. Research indicates that the amygdala is extremely active during emotional situations, and acts with the hippocampus and prefrontal cortex in the encoding and consolidation of emotional events.Buchanan, Tony W. 2007. Retrieval of emotional memories. Psychological Bulletin, 133(5). 10.1037/0033-2909.133.5.761Cahill L. & McGaugh J.L. 1996. Modulation of memory storage. Current Opinion and Neurobiology, 6(2), 237-242. == Working memory == Working memory (STM) is not part of long term memory, but is important for long term memory to work. Working memory holds and works on information for a short period before it is either forgotten or put into long term memory. Then, to remember something from long term memory, it must come back into working memory. If working memory is overloaded it can affect the encoding of long term memory. Ranganath C.C; Michael B.X. & Craig J.B. 2005. Working memory maintenance contributes to long-term memory formation: neural and behavioral evidence. Journal of Cognitive Neuroscience, 17 (7), 994–1010.Axmacher N. et al 2010. Electrophysiological signature of working and long-term memory interaction in the human hippocampus. European Journal of Neuroscience, 31(1), 101–117. == References == Category:Memory Category:Human skills",
 "title": "Long-term memory"
}