{
 "id": "441090",
 "text": "Sarin (or GB) is a nerve gas, a deadly poison. It was developed as a chemical weapon for use in war by Nazi Germany. It is classified as a weapon of mass destruction in UN Resolution 687. Production and stockpiling of sarin was outlawed by the Chemical Weapons Convention of 1993, and it is classified as a Schedule 1 substance according to the convention. That means that is a very dangerous chemical that has no use outside of chemical warfare. Sarin can be lethal even at very low concentrations. Death comes in 1 to 10 minutes after breathing it in. It paralyses lung muscles. Antidotes, such as atropine, can save a person if given immediately. Sarin (GB). Emergency Response Safety and Health Database. National Institute for Occupational Safety and Health. Accessed April 20, 2009. People who get a non-lethal dose, but do not get immediate treatment, may suffer permanent neurological damage. == How sarin works == Like other nerve agents, sarin attacks the nervous system by stopping nerve endings in muscles from switching off. Death will usually occur as a result of asphyxia due to the inability to control the muscles involved in breathing function. In vertebrates, acetylcholine is the neurotransmitter used at the neuromuscular junction, where signals are transmitted between neurons from the central nervous system to muscle fibres. Normally, acetylcholine is released from the neuron to stimulate the muscle, after which it is degraded by acetylcholinesterase. This allows the muscle to relax. Inhibition of cholinesterase means the neurotransmitter continues to act on the muscle fibre. This stops breathing. == History == Sarin was discovered in 1938 in Wuppertal-Elberfeld in Germany by scientists at IG Farben attempting to create stronger pesticides. it is the most toxic of the four G-Series nerve agents made by Germany. The name \"sarin\" comes from letters in the scientists' names: Gerhard Schrader, Otto Ambros, Gerhard Ritter, and Hans-Jürgen von der Linde. In mid-1939, the formula for the agent was passed to the chemical warfare section of the German Army Weapons Office, which ordered that it be brought into mass production for wartime use. It was not used in World War II. === Use === * March 1998: Sarin was one of the gases used by Saddam Hussein to attack the Kurdish village of Halabja. * April 1988: Sarin was used four times against Iranian soldiers in April 1988 at the end of the Iran–Iraq War. It helped Iraqi forces retake control of the al-Faw Peninsula during the Second Battle of al-Faw. Using satellite imagery, the United States assisted Iraqi forces to find the position of the Iranian troops during those attacks.Harris, Shane; Matthew M. Aid 2013. Exclusive: CIA files prove America helped Saddam as he gassed Iran. Foreign Policy (magazine). * 1995: Japanese cult Aum Shinrikyo released an impure form of sarin in Matsumoto, Nagano, killing eight people and harming over 200. * 2013: Sarin was used in Ghouta, Syria, during the Syrian Civil War killing over a thousand rebels, civilians including many children. A UN team traced the chemical blueprint to the Syrian government. The government denied responsibility. == Properties == Sarin is a liquid. It has no color and no smell. However, sarin that is not pure can look brown and smell like burnt rubber. It is miscible in water, which means that it can dissolve in water. Sarin melts at −56 °C and boils at 158 °C. === Toxicity === Sarin is very dangerous, whether someone touches it or breathes it in. The LD50 of sarin is 172 μg/kg. This means that a group of people were injected with 172μg of sarin per kilogram of body weight, 50% of the people in that group would die. This was determined when scientists injected mice with sarin. They then did calculations to determine the ratio of sarin per kilogram and get the LD50. Pure sarin is estimated to be 26 times more deadly than cyanide. == Production == Sarin is made by mixing different chemicals together. It is difficult and dangerous for the average person to make sarin or get many of the chemicals needed to make sarin. 1) Methylphosphonyl difluoride with isopropyl alcohol. Hydrofluoric acid is made as a byproduct of the reaction: : 2) Methylphosphonyl difluoride and methylphosphonic dichloride. This is called the \"Di-di\" process. Hydrochloric acid is made as a byproduct: Both methods leave a lot of acid behind. This is a problem because acid will corrode the containers used to store sarin in. == Storage == Sarin is hard to store because the bond between the phosphorus and the fluorine is easily broken. That's why it is stored as two separate chemicals that create sarin when they are mixed. Sarin decomposes at a high pH. First, it breaks down to isopropyl methylphosphonic acid (IMPA). Then it breaks down to methylphosphonic acid (MPA). IMPA can be detected to find out if sarin was used somewhere because it is a chemical not found in nature. == Symptoms == In medicine, the acronym SLUDGE is used to remember some of the symptoms of sarin poisoning: * Salivation (the salivary glands work too hard and create a lot of saliva) * Lacrimation (tears come out of the eyes) * Urination (the person will not be able to stop himself from urinating) * Defecation (the person will also not be able to stop himself from defecating) * Gastrointestinal upset (problems with the gastrointestinal system, like diarrhea) * Emesis (throwing up) Other symptoms of sarin poisoning include: * Myosis (the pupils in the eyes constrict - they get very small) * Muscle spasms (the muscles get very tight and painful). Eventually the muscles can become paralyzed. ** This can make it impossible for a person to control the muscles needed for breathing. If this happens, breathing will stop and the person can die because they are not able to breathe in oxygen. * Bradycardia (very slow heart rate) * Bronchoconstriction (the tubes leading to the lungs get smaller, which makes it harder, or even impossible, to breathe air into the lungs) * Seizures and status epilepticus * Loss of consciousness == Related pages == * Phosgene * VX == References == Category:Poisons Category:Nerve agents Category:Wuppertal Category:Organic compounds",
 "title": "Sarin"
}