{
 "id": "441036",
 "text": "Benjamin Satterly (born 22 August 1986) is an English professional wrestler. He currently wrestles under the ring name PAC. He has also wrestled under the ring names Adrian Neville and later Neville in WWE and Pac in the Independent circuit. He is currently signed to AEW. He is a former one-time NXT Champion, a two-time and longest-reigning WWE Cruiserweight Champion and a two-time NXT Tag Team Champion with Oliver Grey and Corey Graves. ==Career== On the 16 January 2013 episode of NXT, he made his WWE debut under the ring name Adrian Neville defeating Sakamoto. On the 13 February episode of NXT (originally taped on 31 January), Neville along with Oliver Grey, won the finals of tournament to crown the first ever NXT Tag Team Champions by defeating the Wyatt Family (Luke Harper and Erick Rowan). When Grey suffered a torn ACL (in storyline caused by the Wyatt Family), Neville decided to choose Bo Dallas as his new partner in April. On the 8 May episode of NXT (taped on 2 May), during the team's first defence, Neville and Dallas lost the championships to the Wyatt Family. At NXT Arrival, Neville was able to win the NXT Championship when he defeated Bo Dallas in a ladder match. On 11 December at the NXT Takeover: [R]Evolution event, Neville lost the championship to Sami Zayn. ==Championships== *All Elite Wrestling **AEW All-Atlantic Championship (1 time, first) **AEW World Trios Championship (2 times) – with Penta El Zero M and Rey Fénix (1) and Claudio Castagnoli and Wheeler Yuta (1) **AEW All- Atlantic Championship Tournament (2022) ** Men's Casino Tag Team Royale (2021) – with Rey Fénix * 3 Count Wrestling ** 3CW Heavyweight Championship (1 time) **3CW Young Lions Championship (1 time) * American Wrestling Rampage ** AWR No Limits Championship (1 time) * Dragon Gate ** Open the Dream Gate Championship (1 time) ** Open the Brave Gate Championship (1 time) ** Open the Twin Gate Championship (1 time) – with Dragon Kid ** Open the Triangle Gate Championship (3 times) – with Masato Yoshino and BxB Hulk (1), Naoki Tanizaki and Naruki Doi (1), and Masato Yoshino and Naruki Doi (1) **Open The Brave Gate Title Tournament (2010) * Dragon Gate USA ** Open the United Gate Championship (1 time) – with Masato Yoshino **Open The United Gate Title Tournament (2010) * Frontier Wrestling Alliance ** FWA Flyweight Championship (1 time) * Independent Wrestling Federation ** IWF Tag Team Championship (1 time) – with Harry Pain * One Pro Wrestling ** 1PW Openweight Championship (1 time) * Pro Wrestling Guerrilla ** PWG World Tag Team Championship (1 time) – with Roderick Strong ** Dynamite Duumvirate Tag Team Title Tournament (2007) – with Roderick Strong * Pro Wrestling Illustrated ** Ranked No. 11 of the top 500 singles wrestlers in the PWI 500 in 2017 ** Ranked No. 4 of the top 50 tag teams in the PWI Tag Team 50 in 2022 * Rolling Stone ** Most Exciting NXT Up- and-Comer (2014) ** Most Jaw-Dropping Finisher (2015) ** One-Night-Only Face Turn of the Year (2017) ** Worst Entrance Gimmick on Great New Main-Roster Wrestler (2015) * SoCal Uncensored ** Match of the Year (2006) * Westside Xtreme Wrestling ** wXw World Lightweight Championship (2 times) * WWE ** WWE Cruiserweight Championship (2 times) ** NXT Championship (1 time) ** NXT Tag Team Championship (2 times, first) – with Oliver Grey (1) and Corey Graves (1) ** NXT Tag Team Championship Tournament (2013) – with Oliver Grey ** Slammy Award for Breakout Star of the Year (2015) *Wrestle Zone Wrestling **wZw Zero-G Championship (1 time) ==References== ==Other websites== * * Category:1986 births Category:Living people Category:All Elite Wrestling people Category:English professional wrestlers Category:Former WWE wrestlers Category:People from Newcastle upon Tyne",
 "title": "Pac (wrestler)"
}