{
 "id": "44131",
 "text": "Marilyn Monroe (born Norma Jeane Mortenson; June 1, 1926 – August 4, 1962) was an American actress, writer, model, singer and filmmaker. Famous for playing comic \"blonde bombshell\" characters, she became one of the most popular sex symbols of the 1950s. Between 1946 and 1962, she made 44 movies. Although she was a top-billed actress for only a decade, her films grossed $200 million by the time of her unexpected death in 1962. == Early life == Norma Jeane Mortenson was born on June 1, 1926 at LAC+USC Medical Center in Los Angeles, California, United States. When she was seven years old, her mother, Gladys (Monroe) Baker Mortenson, was hospitalized after being diagnosed as a paranoid schizophrenic, a severe mental condition. Norma was left in a series of foster homes and the Los Angeles Orphans' Home Society. The constant move from one foster home to another resulted in Norma's \"sketchy\" educational background. After Norma's sixteenth birthday, her foster parents had to move from California. To avoid an orphanage or a new foster home, Norma chose to get married. On June 19, 1942, Norma married James Dougherty, but the marriage would all but end when he joined the U.S. Merchant Marines in 1943. Though her difficult childhood and early failed marriage would make Norma Jean a strong and resilient woman, these experiences would also add to her insecurities and flaws—things that would ultimately shape her into a great tragic figure of the twentieth century. == Movies == Marilyn Monroe became famous, starring in a number of hit movies during the 1950s and early 1960s. She also became famous for modeling for photographers and singing in her musical movies. One time, she sang \"Happy Birthday\" to President John F. Kennedy. It turned out to be one of her last appearances. ==Personal life== ===Marriages=== The 16-year-old Norma Jeane married James Dougherty on June 19, 1942. After the wedding, he joined the navy. At this time, Norma met an army photographer, David Conover. She began a career as a model. She changed her name to Marilyn Monroe. She and Dougherty divorced on September 13, 1946. Monroe married the baseball star Joe DiMaggio on January 14, 1954. The marriage lasted for nine months. She had met DiMaggio on a blind date, during the filming of the movie Monkey Business in 1952. The marriage was closely followed by the public. DiMaggio retired from baseball, and Marilyn became very famous. DiMaggio was sad that his career as a baseball star was ending, and was jealous of Marilyn for being admired. He spent most of his time watching television and Monroe found it boring. They separated on October 31, 1954. From 1961, they became friends again. DiMaggio said that he gave Marilyn a rose every week for 20 years. Marilyn married Arthur Miller on June 29, 1956. She converted to Judaism. She had met him during the filming of As Young As You Feel in 1951. She was so happy with him and they tried to have children together. Marilyn had three miscarriages, because of her endometriosis. Miller wrote the screenplay for the movie The Misfits. The filming caused many problems between Marilyn and Arthur and they separated on January 20, 1961. == Death == She died early from an overdose of barbiturates on August 4, 1962 in Brentwood, Los Angeles, California, U.S. at 36 years old. == Filmography == * Dangerous Years (1947) * Scudda Hoo! Scudda Hay! (1948) * Ladies of the Chorus (1948) * Love Happy (1949) * A Ticket to Tomahawk (1950) * The Asphalt Jungle (1950) * All About Eve (1950) * The Fireball (1950) * Right Cross (1951) * Home Town Story (1951) * As Young as You Feel (1951) * Love Nest (1951) * Let's Make It Legal (1951) * Clash by Night (1952) * We're Not Married! (1952) * Don't Bother to Knock (1952) * Monkey Business (1952) * O. Henry's Full House (1952) * Niagara (1953) * Gentlemen Prefer Blondes (1953) * How to Marry a Millionaire (1953) * River of No Return (1954) * There's No Business Like Show Business (1954) * The Seven Year Itch (1955) * Bus Stop (1956) * The Prince and the Showgirl (1957) * Some Like It Hot (1959) * Let's Make Love (1960) * The Misfits (1961) * Something's Got to Give (1962 - unfinished) == Awards and nominations == * 1951 Henrietta Awards: The Best Young Box Office Personality * 1952 Photoplay Award: Fastest Rising Star of 1952 * 1952 Photoplay Award: Special Award * 1952 Look American Magazine Achievement Award: Most Promising Female Newcomer of 1952 * 1953 Golden Globe Henrietta Award: World Film Favorite Female. * 1953 Sweetheart of The Month (Playboy) * 1953 Photoplay Award: Most Popular Female Star * 1954 Photoplay Award for Best Actress: for Gentlemen Prefer Blondes and How to Marry a Millionaire * 1956 BAFTA Film Award nomination: Best Foreign Actress for The Seven Year Itch * 1956 Golden Globe nomination: Best Motion Picture Actress in Comedy or Musical for Bus Stop * 1958 BAFTA Film Award nomination: Best Foreign Actress for The Prince and the Showgirl * 1958 David di Donatello Award (Italian): Best Foreign Actress for The Prince and the Showgirl * 1959 Crystal Star Award (French): Best Foreign Actress for The Prince and the Showgirl * 1960 Golden Globe, Best Motion Picture Actress in Comedy or Musical for Some Like It Hot * 1962 Golden Globe, World Film Favorite: Female * Star on the Hollywood Walk of Fame 6104 Hollywood Blvd. * 1999 she was ranked as the sixth-greatest female star of all time by the American Film Institute in their list AFI's 100 Years... 100 Stars. == References == == Sources == * * * * * * * * * * * * * * * == Other websites == * The Official Marilyn Monroe Website * * * * * Gallery: The Life of Marilyn Monroe *Marilyn Monroe Quotes Category:1926 births Category:1962 deaths Category:Actors from Los Angeles Category:American autobiographers Category:American movie actors Category:Converts to Judaism Category:Drug-related deaths in the United States Category:Golden Globe Award winning actors Category:Hawthorne, California Category:Jewish American actors Category:Jewish American musicians Category:Jewish American writers Category:Jewish models Category:Models from Los Angeles Category:Singers from Los Angeles",
 "title": "Marilyn Monroe"
}