{
 "id": "441743",
 "text": "A parliamentary republic is a name for a government. The system is used in many countries. ==What it looks like== In a parliamentary system, the legislature is the part of government that makes laws. The legislature also gives power to the executive (the part of government that enforces laws). This is the basic form of a parliamentary republic. The difference is how the legislature gets its power. The legislature is not chosen by a ruler or by birth. The people choose the legislature in an election. This means that the executives get their power from the legislature, but the legislature gets its power from the people. ==How it works== The people choose the legislature. There are many people in the legislature. That group then gets together to choose one person to be their leader. The leader is often part of the legislature. The name for this job is Prime Minister in most countries. The Prime Minister is the head of government. This person leads the country. This way, the people are the power behind the parliamentary republic. They choose the units that make government work. This is different from other parliamentary systems because the legislature is chosen in a different way. In other parliamentary systems, members are chosen by the head of state, the local leaders, or by birth. In a parliamentary republic, the people choose the members. The people do this through elections. Sometimes they vote for every person in parliament. Other times they vote for people in their area. The politicians they elect go to parliament to make laws and select the head of state. This gives the people power to decide who is in government. ==Examples== Country Parliamentary republic adopted Albania 1991 Bangladesh 1991Was a parliamentary republic between 1971 and 1975. Bosnia and Herzegovina 1991 Botswana 1966 Bulgaria 1989 Cape Verde 1990 Croatia 2000 Czech Republic 1993 Dominica 1978 East Timor 1999 Estonia 1991Estonia was a parliamentary republic between 1919 and 1934 when the government was overthrown by a coup d'état. Ethiopia 1991 Finland 1919 Germany 1949At the end of World War II Germany was divided into West Germany and East Germany. This date shows the start of the Federal Republic of Germany, although the area of former East Germany was no part of that parliamentary republic until 1990. Greece 1975 Hungary 1990 Iceland 1944 1950 Iraq 2005 Ireland 1949 Israel 1948 Italy 1946 Kiribati 1979 Kyrgyzstan 2010 Latvia 1991Latvia was a parliamentary republic between 1921 and 1934. The then prime minister Kārlis Ulmanis took power in a coup d'état. In June 1940, Latvia was occupied and annexed by the Soviet Union. Lebanon 1941 Libya 2012 Lithuania 1991Lithuania was previously a parliamentary republic between 1920 and 1926 when democratic government was overthrown in a coup d'état. In June 1940 Lithuania was occupied and annexed by the Soviet Union. Macedonia 1991 Malta 1974 Marshall Islands 1979 1992 Federated States of Micronesia 1986 Moldova 1994The first parliamentary elections were held in February and March 1990. The Communist Party of Moldova was the only group in this election. Other people were allowed to be in the election without a group. In 1991, the country moved away from Soviet Union. In 1994, the Moldovans held the first free elections. Mongolia 1949 Montenegro 1992 Nauru 1968 Nepal 2008 Pakistan 2010 Poland 1990 Samoa 2007 San Marino 0301 Serbia 1991 Singapore 1995 Slovakia 1993 Slovenia 1991 Somalia 2012 South Africa 1961 1976 Turkey 1946 Vanuatu 1980 ==Notes== ==References== Category:Forms of government Category:Parliaments",
 "title": "Parliamentary republic"
}