{
 "id": "441993",
 "text": "Utatsusaurus is the earliest-known form of an ichthyopterygian. It lived in the earliest Lower Triassic period, about 250245 millions years ago. It is nearly 3m (about 9 feet) long with a slender body.Motani R; Minoura N. and Ando T. 1998. Ichthyosaurian relationships illuminated by new primitive skeletons from Japan. Nature. 393 (6682): 255-257. The name Utatsusaurus was given after the city Utatsu-cho where the first specimen was found.Shikama T; Kamei T. and Murata M. 1977. Early Triassic ichthyosaur, Utatsusaurus hataii gen. et sp. nov., from the Kitakami Massif, Northeast Japan. Science Reports of the Tohoku University Second Series (Geology). 48 (1-2): 77-97. The fossils have been found in the Lower Triassic of Miyagi Prefecture, Japan and British Columbia, Canada.Motani R. 1999. Phylogeny of the Ichthyopterygia. Journal of Vertebrate Paleontology. 19 (3): 473-496. Utatsusaurus is one of the most primitive (basal) types of ichthyosaur.Motani R. 1997. New information on the forefin of Utatsusaurus hataii (Ichthyosauria). Journal of Paleontology. 71 (3):475-479.Motani R. 2005. Evolution of fish-shaped reptiles (Reptilia : Ichthyopterygia) in their physical environments and constraints. Annual Review of Earth and Planetary Sciences. 33: 395-420. It has transitional features between its ancestral land-dwelling forms and the more derived ichthyosaurs. Unlike the more advanced ichthyosaurs, Utatsusaurus has no dorsal fin and has a broad skull. The snout gently tapers, compared to the more rounded one of more derived ichthyopterygians.Cuthbertson R.S; Russell A.P. and Anderson J.S. 2013. Reinterpretation of the cranial morphology of Utatsusaurus hataii (Ichthyopterygia) (Osawa Formation, Lower Triassic, Miyagi, Japan) and its systematic implications. Journal of Vertebrate Paleontology. 33(4): 817-830. The tail had a long low fin, quite different from the tail shape of later forms. This suggests that the animal swam by undulation, waving its body to & fro, rather than using its paddles and tail. The 2011 Tōhoku earthquake and tsunami destroyed the local museum, but fortunately the specimens were not there at the time. == References == Category:Ichthyosaurs",
 "title": "Utatsusaurus"
}