{
 "id": "442569",
 "text": "Bronchiectasis is an obstructive lung disease. It is caused by chronic inflammation of the bronchi. It is sometimes said to be part of the group of diseases called chronic obstructive pulmonary disease. People with bronchiectasis have swollen bronchi. Around 1,500 deaths reported in UK each year are thought to be caused by bronchiectasis. It is more common in males than females and 350,000 to 500,000 people are affected by bronchiectasis each year in America. ==Signs== People with bronchiectasis have signs and symptoms such as: pain in the chest, tiredness, bad breath, sinusitis, coughing up blood (haemoptysis), and a wheeze. Coarse crackling sounds can be heared when the person breathes in. 3 out of 4 people cough up a lot of sputum that is green or pale yellow. 9 out of 10 people with the disease have a cough that does not go away. The defect can cause finger clubbing. Chronic inflammation of the airways in bronchiectasis causes permanent dilation and thinning of the airways. ==Types== There are three kinds of bronchiectasis. These are: *Cylindrical bronchiectasis *Varicose bronchiectasis *Saccular or cystic - This is the most severe type. It is often found in people with cystic fibrosis. ==Causes== People can be born with bronchiectasis or they can develop it later. In about 4 out of 10 cases, a cause is found. People who have rheumatoid arthiritis and smoke are ten times more likely to have the disease. Patients with alpha 1-antitrypsin deficiency have also been found to be more likely to get bronchiectasis but it is not known why.Shin MS, Ho KJ (1993). \"Bronchiectasis in patients with alpha 1-antitrypsin deficiency. A rare occurrence?\". Chest 104 (5): 1384–86. doi:10.1378/chest.104.5.1384. PMID 8222792. ==Diagnosis== It is usually diagnosed using a CT scan. ==Treatment== Antibiotics are used to treat bronchiectasis. It can also be treated with other drugs. Sometimes surgery is needed. == Prevention == To prevent bronchiectasis, it is essential to avoid lung infections and lung damage that can cause it. Children should get vaccines to protect against measles, whooping cough, and pneumonia. Parents should watch their children to prevent them from breathing in small objects like food or toys. People with bronchiectasis should avoid smoking and breathing in harmful fumes or gases that can cause infections and more problems. To slow down the progress of this long-term disease, doctors try to the airways clear and remove mucus from the lungs with drugs or surgery. Antibiotics can be used to treat infections and stop the cycle of damage and more infections. A machine might be used to help the patient breathe if needed. Regular vaccines for pneumonia, the flu, and whooping cough can also help. Maintaining a healthy body weight and seeing a doctor regularly can also be helpful. The severity of symptoms and the extent of damage seen on X-rays can affect how likely a person is to survive this disease. ==History== René Laennec wrote the first description of bronchiectasis in 1819. == Related pages == * Exudate * Cor pulmonale * Chronic obstructive pulmonary disease ==References== Category:Pulmonology",
 "title": "Bronchiectasis"
}