{
 "id": "442678",
 "text": "Sidharth Malhotra (born 16 January 1985) is an Indian actor and former model. He appears in Hindi language films of Bollywood. He started his career in movies with Karan Johar's movie Student of the Year (2012), along with other newcomers, Varun Dhawan and Alia Bhatt, for which he received a nomination in the Filmfare award for Best Male Debut. Later, he gained appreciation in the 2014 movie Hasee Toh Phasee in which he was paired opposite Parineeti Chopra, recently he has been paired opposite Shraddha Kapoor in Ek Villain which has been released on June 27, 2014. Besides acting in movies, he performs in award functions and is a celebrity endorser for many brands. ==Filmography== Key Denotes films that have not yet been released Year Film Role Notes 2012 Student of the Year Abhimanyu \"Abhi\" Singh 2014 Hasee Toh Phasee Nikhil Bharadwaj 2014 Ek Villain Guru Divekar 2015 Brothers Monty Fernandes 2016 Kapoor & Sons Arjun Kapoor 2016 Baar Baar Dekho Jai Varma 2017 A Gentleman Gaurav Kapoor / Rishi Purohit Also playback singer for song \"Bandook Meri Laila\" 2017 Ittefaq Vikram Sethi Negative role 2018 Aiyaary Major Jai Bakshi 2019 Jabariya Jodi Abhay Singh 2019 Marjaavaan Raghu 2021 Shershaah Vikram Batra / Vishal Batra 2021 Thank God TBA Filming 2021 Mission Majnu TBA Filming ==Awards and nominations== Year Film Award Category Result 2012 Student of the Year BIG Star Entertainment Awards Most Entertaining Actor (Film) Debut—Male 2013 ETC Bollywood Business Awards Most Profitable Debut (Male) Filmfare Awards Best Male Debut Screen Awards Most Promising Newcomer—Male Zee Cine Awards Best Male Debut Stardust Awards Breakthrough Performance—Male Superstar of Tomorrow—Male Star Guild Awards Best Male Debut Times of India Film Awards Best Debut—Male South Africa India Film and Television Awards Debut Actor of the Year—Male ==References== ==Other websites== * Category:1985 births Category:Living people Category:Actors from Delhi Category:Punjabi people Category:Indian movie actors Category:Indian models",
 "title": "Sidharth Malhotra"
}