{
 "id": "442609",
 "text": "The Silver Star (officially the Silver Star Medal), is the United States third highest military decoration for valor. It can be awarded to any person serving in the United States Armed Forces. The medal is awarded for gallantry in action against an enemy of the United States. == History == The Silver Star is the successor award to the earlier \"Citation Star\". The Citation Star was established by an act of Congress on July 9, 1918. On July 19, 1932, the Secretary of War approved changing the \"Citation Star\" to the Silver Star Medal. The original \"Citation Star\" is added to the center of medal. The Silver Star's ribbon is red, white and blue. Authorization for the Silver Star Medal was placed into law by an act of Congress for the U.S. Navy on August 7, 1942. An Act of Congress for the U.S. Army was authorized on December 15, 1942.Fred L. Borch III, Medals for Soldiers and Airmen: Awards and Decorations of the United States (Jefferson, NC: McFarland & Company, Inc., Publishers, 2013), p. 53 The US Army and Air Force currently awards the medal as the \"Silver Star\". The US Navy, Marine Corps, and Coast Guard continues to award the medal as the \"Silver Star Medal\". == Award criteria == The Silver Star is awarded to anyone serving in or with the United States Armed Forces, for \"gallantry in action\". This is: # Against an enemy of the United States. # While engaged in military operations against opposing forces. # When serving in a military conflict along with friendly forces where the US is not a belligerent. Air Force pilots, combat systems officers, Navy and Marine Corps aviators and Naval Flight Officers flying fighter aircraft are often considered eligible to receive the Silver Star upon becoming an ace ( having five or more confirmed aerial kills). In multi-seat fighters, the weapon systems officer or radar intercept officer is also eligible.Korean War pilot receives Silver Star 56 years later . Retrieved 2009-03-10. The Silver Star may also be awarded to members of the armed forces of friendly foreign nations meeting the criteria.Office of the Federal Register (US), The Code of Federal Regulations of the United States of America, Revised (Washington, DC: US Government Printing Office, 1985), p. 332 == Order of Precedence == The Silver Star is worn on the uniform after the Distinguished Service Medal. It is to be worn before the Defense Superior Service Medal. When a second (or more) award is given for the Silver Star, an oak leaf cluster is added to the ribbon. == Related pages == * Bronze Star Medal == References == == Other websites == * The Pyramid Of Honor; Order of Precedence of Military Awards Category:Orders, decorations, and medals of the United States Category:Military of the United States Category:1932 establishments in the United States",
 "title": "Silver Star"
}