{
 "id": "442939",
 "text": "Alexei Anatolievich Navalny (рус. Алексей Анатольевич Навальный) (4 June 1976 - 16 February 2024) was a Russian lawyer, politician, and activist. He was a known critic of President Vladimir Putin. ==Early life== Navalny was born in Butyn to a Ukrainian father and Russian mother. In 1993 he started his law degree at Peoples’ Friendship University, in Moscow. In 1998 he graduated. In 2000, Navalny joined the Russian United Democratic Party, \"Yabloko\". ==Career== He became known through his LiveJournal blog. In 2012, The Wall Street Journal described him as \"the man Vladimir Putin fears most.\" In September 2013 Navalny came second in the Moscow mayoral election. Navalny is a Russian Opposition Coordination Council member. He is a Yale World Fellow. 60 Minutes called Navalny ‘’the man trying to beat Putin’ in a program aired in December 2017. He was a candidate for President of Russia in the 2018 election. He ran against President Vladimir Putin. In January 2021, he published his investigation about Putin's palace. Because of it, rallies of Navalny's supporters had been started. ==Personal life== Navalny was poisoned by Putin on August 2020. After this incident and being in the hospital, Navalny went to prison on political ground. He had two children and a wife. He met his wife after a vacation in Turkey in 1999. ==2020 poisoning and arrest== On 20 August 2020, Navalny was poisoned during a flight from Tomsk, Siberia to Moscow and was hospitalized in Omsk. He was soon in a coma, on a ventilator. On 7 September 2020, he woke up from the coma, and on 14 September, he was taken off the ventilator. He was released on 22 September. On 17 January 2021, he went back to Russia, where he was arrested for going against terms of a suspended jail sentence. On 4 August 2023, Navalny was given an increased sentence of 19 years in prison for extremism charges. == Death == On 16 February 2024, the Russian prison service announced that Navalny had died in prison in Yamalo-Nenets, after taking a walk and feeling unwell in the morning. == Awards == * Sakharov Prize (2021) == Notes == ==Other websites== *https://www.politico.eu/article/russian-election-alexei-navalnys-final-plan- to-cause-vladimir-putin-maximum-damage/. March 14, 2024 ==References== Category:1976 births Category:2024 deaths Category:Russian bloggers Category:Russian lawyers Category:Politicians from Moscow Category:Anti- Corruption Foundation Category:Russian activists",
 "title": "Alexei Navalny"
}