{
 "id": "442948",
 "text": "The Distinguished Service Cross (abbreviation DSC) is the second highest military award that can be given to a member of the United States Army. It is awarded for extreme gallantry and risk of life in actual combat with an armed enemy force. Actions that merit the Distinguished Service Cross must be above those required for all other U.S. combat decorations, but are not high enough for the Medal of Honor. The Distinguished Service Cross is the same as the Navy Cross (Navy and Marine Corps). The Air Force) has the Air Force Cross and the Coast Guard has the equivalent Coast Guard Cross. All are equivalent (equal) awards. == History == The Distinguished Service Cross was first awarded during World War I. In addition, a number of awards were made for actions before World War I. These were to soldiers who had received a 'Certificate of Merit' for gallantry. At the time the certificate was given it was the only other honor for gallantry the Army could award other than a Medal of Honor. Others were awarded for earlier actions in the Philippines, on the Mexican Border and during the Boxer Rebellion.'Medals in Lieu of Brevets', Army and Navy Register, Vol 72, no. 2206 (28 October 1922), p. 410 == Criteria == The Distinguished Service Cross may be awarded to any person serving in any capacity with the United States Army. The person must distinguish himself or herself by extraordinary heroism while engaged in an action against an enemy.Frank C. Foster, United States Army Medal, Badges and Insignias (Fountain Inn, SC: MOA Press, 2011), p. 83 Or, while engaged in military operations involving conflict with an opposing/foreign force or while serving with friendly forces. The act or acts of heroism must have been so notable and have involved risk of life so extraordinary as to set the individual apart from his or her comrades.578.10 Distinguished Service Cross But it is not sufficient to merit the Medal of Honor. == Order of precedence == The Distinguished Service Cross is worn on the uniform after the Medal of Honor but before the Defense Distinguished Service Medal.Fred L. Borch III, Medals for Soldiers and Airmen: Awards and Decorations of the United States (Jefferson, NC: McFarland & Company, Inc., Publishers, 2013), p. 105 It is to be worn before the Silver Star. When a second (or more) award is given an oak leaf cluster is added to the award. == Notes == == References == == Other websites == * Distinguished Service Cross; US Military Awards for Valor Category:Orders, decorations, and medals of the United States Category:Military of the United States Category:1910s establishments in the United States",
 "title": "Distinguished Service Cross (United States)"
}