{
 "id": "443109",
 "text": "The four verb aspects in English (simple, continuous, perfect, and perfect continuous) can be combined with the past, present, and future to create 12 verb forms. Verb Form Formula Uses Example Sentences Present Simple Verb + s/es in third person. Repeated actions. Facts or generalizations. Scheduled events in the near future. Now (non-continuous verbs). I play football. Cats like milk. The match starts at 2 o'clock. I am here now. Present Continuous Am/is/are + present participle Now. Longer actions in progress now. Near future. Repetition and irritation with \"always\". I am sitting. I am studying to become a doctor. I am meeting some friends after work. She is always coming to class late. Past Simple Verb + ed, or irregular verbs. Completed action in the past. A series of completed actions. Duration in the past. Habits in the past. Past facts or generalizations. I saw a movie yesterday. I finished work, walked to the beach, and found a nice place to swim. I lived in Brazil for two years. I studied French when I was a child. She was shy as a child, but now she is very outgoing. Past Continuous Was/were + present participle. Interrupted action in the past. Specific time as an interruption. Parallel actions. Atmosphere. Repetition and irritation with \"always\". I was watching TV when she called. Last night at 6 PM, I was eating dinner. I was studying while he was making dinner. The sun was shining. She was always coming to class late. Present Perfect Has/have + past participle. Unspecified time before now. Duration from the past until now (non-continuous verbs). I have seen that movie twenty times. I have had a cold for two weeks. Present Perfect Continuous Has/have + been + present participle. Duration from the past until now. Recently, lately. They have been talking for the last hour. Recently, I have been feeling really tired. Past Perfect Had + past participle. Completed action before something in the past. Duration before something in the past (non-continuous verbs). You had studied English before you moved to New York. By the time Alex finished his studies, he had been in London for over eight years. Past Perfect Continuous Had been + present participle. Duration before something in the past. Cause of something in the past. They had been talking for over an hour before Tony arrived. Jason was tired because he had been jogging. Simple Future Will + verb. Am/is/are + going to + verb. \"Will\" to express a voluntary action. \"Will\" to express a promise. \"Be going to\" to express a plan. \"Will\" or \"be going to\" to express a prediction. I will send you the information when I get it. I will call you when I arrive. He is going to spend his vacation in Hawaii. The year 2222 will be a very interesting year. Future Perfect Will + have + verb. Am/is/are + going to + have + verb. Completed action before something in the future. Duration before something in the future. The house isn't completely built yet, but when I visit in June, they will have finished it. You can come over at 8. We will have eaten dinner by then. Future Continuous will + be + present participle Action in progress at a particular time in the future. Future action continuing over a period of time. I will probably be running when you come home. Be quiet when you come home. Everyone will be sleeping. I’m going to be studying all next week. We will be traveling for most of 2019. Future Perfect Continuous will + have + been + present participle Duration before something in the future. Cause of something in the future. By the time I finish my Ph.D., I will have been studying for over 20 years! The house will be a mess. We will have been painting all day. ==References== Category:Grammar",
 "title": "Uses of English verb forms"
}