{
 "id": "443381",
 "text": "Escolania de Montserrat is a boys' choir in the Benedictine abbey of Santa Maria de Montserrat. The abbey is near Barcelona (Catalonia, Spain). The boys are sopranos and altos. Sometimes the Montserrat Chapel Choir sings with them, when needed for the music they are performing. The Escolania of Montserrat belongs to the Monastery of Monserrat. It is one of the oldest boys choirs in Europe. The Escolania has been a religious and musical institution since the 14th century. There are more than fifty boys in the choir, from ages nine to fourteen. The boys are from various towns in Catalonia, the Balearic Islands, and the Valencian community. At the Escolania, they complete courses at the primary, and beginning of secondary levels. They also study music. The Escolania takes pride in providing high-level musical education. Each student must study two instruments: the piano, and a second orchestral instrument of their choice. They also study Musical Language, Orchestra, and participate in the choir.L'Escolania de Montserrat. Més de set segles de tradició musical i educativa. Montserrat (2007) ==Musical activities of the choir== The school choir sings every day in the Basilica. They often sing in front of large groups of pilgrims and visitors from around the world. More people attend the midday singing of Salve Regina than any other performance. They choir have released many albums. They have toured in several countries, including Hungary, Switzerland, France, Italy, Belgium, Germany, Poland, and Russia. They have performed in Russia three times (Moscow 2011 & 2013, and St. Petersburg 2011).La Revista de l'Escolania. ==History== *1025: The Benedictine Community of Montserrat was founded.Albareda, Anselm: Història de Montserrat. Montserrat (1931) *12th Century: Period of the Virgin of Montserrat. Pilgrims started to climb the mountain to worship the Virgin.Laplana, Josep de C.: Nigra sum. Iconografia de Santa Maria de Montserrat. Publicacions de l'Abadia de Montserrat, Montserrat (1995) *1307: First documentation showing the existence of the Escolania, which is also the first reference to the choir robes worn today.Caralt, Ambròs M.: L'Escolania de Montserrat. Abadia de Montserrat (1955) *1479: The choir sang for the Catholic King Fernando during his visit to Barcelona. *1494: Abbot Garcia de Cisneros spoke of the importance of religious music in relation to the choristers of the Escolania, which was made up of about 20 boys at the time. *16th Century: Bartomeu Garriga, a chorister at the time, promised that when he was older, he would make a great temple for the Virgin. In 1560, as Abbot of the Monastery, he started to construct the current Basilica. *17th-18th Century: Period of growth, with the first appearance of Masters of the Escolania. This title was given to monks that directed the choir and cultivated a new repertoire of compositions. *1889-1909: Fr. Manuel Guzman introduced a new style to the sound of the choir, and continued on to teach future directors of the Escolania. *1909-1911: Fr.Ramir Escofet became director. *1911-1933: Fr. Anselm Ferrer, of Italy, became the director and composer. He created the first recordings of the Escolania and evolved the tone of the choir. *1933-1936: Blessed Fr. Angel Rodamilan was director as well as a martyr during the Civil War.Vivancos, Bernat: Àngel Rodamilans, 1874-1936. Evocació i recerca. Publicacions de l'Abadia de Montserrat (1997) *1936-1939: The monks and students had to abandon Montserrat during the Spanish Civil War. *1939-1953: Fr. David Pujol was director. *1953-1997: Fr. Ireneu Segarra, director and composer. Under his leadership, the choir grew to fifty students, and released numerous records. They also began to perform concerts outside of Montserrat for the first time in the 1960s, including international tours. *1997-2000: Fr. Jordi-Agustí Piqué was the director. *2000-2007: Joaquim Piqué was the first lay director. *2007–2014: Bernat Vivancos was the director. *2014-Present: Llorenç Castelló is the current director.Choir Director == References == == Other websites == * Official website of the choir * The Escolania's official youtube channel * Discography Category:Pages created with the Article Wizard from 2014 Category:choirs",
 "title": "Escolania de Montserrat"
}