{
 "id": "443386",
 "text": "Yun Hyok-seok (, October 7, 1984 – April 26, 2003) was a South Korean activist, poet and writer. He fought for human rights, civil rights, LGBT rights and peace. His nickname was Yook Woo Dang (Protecting sexual minorities Koreatimes 2013-08-23 ), which means \"six friends\". He wrote using the names Sulheon (, ) and Midong (, , \"Beauty Boy\"), Donghwa (동화, 童花, Boy's flower), Roman Catholic baptismal name is Antonio. Yun was born in Incheon. His family is Catholic.나의 일곱번째 친구는 누구입니까 한겨레신문 2013.04.26 He later moved to Seoul. While he was a student, he began writing and poetry. In March 2000, he started going to Incheon Seil high school. At high school, he came out as gay. This made him isolated from his classmates.기독 청소년 ‘육우당’이 왜 목을 맨 지 아십니까? 미디어오늘 2013.04.27. By November 2002, he left high school. He began living in a neighbourhood of Dongdaemun District of Seoul. Yun's nickname, Yook Woo Dang, means \"six friends\". It refers to alcohol, tobacco, sleeping pills, foundation make-up, green tea and rosary beads.지상에 천국을 일군 한 동성애인의 꿈 한겨레신문 2013.05.21 His penname Sulheon came from Heo Chohui's nickname Nanseolheon. Heo Chohui was a female poet and painter during the Joseon dynasty in Korea. In 2002 and 2003, Yun became an activist for human rights and peace. In March 2003, he was a conscientious objector to South Korea's conscription military service. But his opinions did not matter to some Koreans, because of his sexuality. In early April 2003, some South Korean Christian organisations gave a statement against homosexuality.“내 혼은 꽃비 되어” 참세상 2006.04.26 Yun spoke out against this and wrote an article to some South Korean newspapers and the foreign press. In April 26, 2003, Yun committed suicide, in Dongdaemun in Seoul.\"가식적인 기독교에 깨달음을\"…어느 10대의 죽음 프레시안 2013.04.21 He hanged himself.10대 동성애자 '사회적 차별비관' 자살 윤씨의 죽음을 애도한다 오마이뉴스 2003.05.06 He did it to protest discrimination against gay people in South Korea.육우당(六友堂), ‘성소수자 해방’을 위해 지다 참세상 2008.05.01 Queer Rights Activists in South Korea Step Up Efforts to Support LGBTQ Youth == Book == * Let My Spirit Rain Down as Flower Petals (내 혼은 꽃비 되어) * Diary of Yook Woo Dang (육우당일기) (not published) == Related pages == * Homophobia == References == == Other websites == * Memorial museum von Yukwudang * Protecting sexual minorities Koreatimes 2013-08-23 * Queer Rights Activists in South Korea Step Up Efforts to Support LGBTQ Youth * 윤씨의 죽음을 애도한다 오마이뉴스 2003.05.06 * 청소년유해매체물에 '동성애' 삭제키로 오마이뉴스 2003.04.29 * 육우당(六友堂), ‘성소수자 해방’을 위해 지다 참세상 2008.05.01 * 육우당은 여전히 희망이 존재한다고 말하고... 참세상 2006.04.18 * \"가식적인 기독교에 깨달음을\"…어느 10대의 죽음 프레시안 2013.04.21 * 동성애자가 사탄? 너희는 파시스트 기독교인 경향신문 2012.01.25 * “내 혼은 꽃비 되어” 참세상 2006.04.26 * layoung shin Category:1984 births Category:2003 deaths Category:South Korean autobiographers Category:Gay men Category:South Korean human rights activists Category:Korean poets Category:LGBT rights activists Category:LGBT writers Category:Suicides by hanging Category:Writers who committed suicide Category:People from Incheon",
 "title": "Yun Hyon-seok"
}