{
 "id": "443374",
 "text": "Angry Birds Epic is a role-playing video game developed by Chimera Entertainment and published by Rovio Entertainment. The game was available on iOS in Australia, Canada and New Zealand on March 12, 2014 and was released worldwide on June 12, 2014. The game was removed from app stores in 2019. ==Gameplay== Angry Birds Epic is a turn-based RPG; the player explores a wide map on a quest to retrieve the birds' eggs from the pigs. In each level, the player is pit against a varying team of pigs. 3 out of 5 birds who are unlocked over the course of the game can be brought into a level: Red is a melee-type who mainly attacks but can also grant teammates shields, Chuck is a magic-type who can summon lightning to attack pigs and grant special effects on teammates, Matilda is a support-type who can heal teammates and steal health from pigs, Bomb is a melee-type who deals large amounts of damage and increases the strength of teammates, and the Blues are a range-type who can apply both positive or negative effects to either team. The player uses their finger to select a bird and drag to the target. If the target is a pig, the bird will attack them. If the target is a teammate, the bird will grant a special effect to aid them. After all of the birds have acted once, it switches to the pigs' turn and vice versa. Every attack from a bird fills a Rage Chilli meter. When the meter is full, the player can drag the Rage Chilli onto a bird to let them perform an incredibly strong attack. The meter then immediately drains after being used, restarting the process. Everyone has a limited amount of health and cannot fight without any; the player wins if all pigs run out of health, and loses if all birds run out of health. ===Crafting=== After winning a level, the player can spin a roulette wheel containing different kinds of materials. The amount of rewards earned depends on the number of stars earned via a score. Those materials can then be used to craft new weapons, shields and classes. Weapons increase attack power or change a bird's method of attacking, shields do the same for defence and support, and classes affect what abilities a bird has. Some materials can also be used to brew potions, which can be used mid-level to aid a bird. ==Reception== ==References== Category:2014 video games Category:Android (operating system) games Category:IOS games Category:Role-playing video games Category:Mobile games Category:Multiplayer and single-player video games",
 "title": "Angry Birds Epic"
}