{
 "id": "443604",
 "text": "Jacob Wilson Parrott (July 17, 1843-December 22, 1908) was the first person to be given the Medal of Honor. ==Biography== Parrott was from Fairfield County, Ohio. He joined the 20th OVI for 90 days. When he finished that he returned to his home town of Kenton, Ohio. He joined the United States Army in 1861 as a private in Company K, 33rd Ohio Infantry. He first fought in the Battle of Ivy Mountain. In April 1862, he volunteered to take part in a raid with twenty-one others (later known as \"Andrews' Raiders\" because they operated under the command of James J. Andrews). After going behind Confederate lines and stealing the locomotive \"General,\" they were captured and imprisoned. Parrott was severely beaten 110 times to try to make him talk. He and fourteen others managed to escape. Only six of them reached friendly lines. He was later exchanged. He met President Abraham Lincoln in Washington, D.C.. Secretary of War Edwin M. Stanton gave him the Medal of Honor. He served with the Union Army for the rest of the war. He was commissioned as a second lieutenant in 1863 after the Battle of Stones River. H was commissioned as a first lieutenant in 1864. He returned to Kenton, Ohio after the war. He remained a cabinet maker. He ran a stone quarry south of Kenton, Ohio. Parrott suffered a heart attack and died while walking home from the county courthouse in Kenton, Ohio. He is buried in Grove Cemetery, on State Route 309, east edge of Kenton, Ohio. ==Medal of Honor citation== Rank and Organization: :Private, Company K, 33d Ohio Infantry. Place and date: Georgia, April 1862. Entered service at: Hardin County, Ohio. Birth: July 17, 1843, Fairfield County, Ohio. Date of issue: March 25, 1863. Citation: ==Notes== ==References== * * * * Category:1843 births Category:1908 deaths Category:Deaths from myocardial infarction Category:Disease-related deaths in Ohio Category:Military people from Ohio Category:United States Army Medal of Honor recipients",
 "title": "Jacob Parrott"
}