{
 "id": "443859",
 "text": "Kenneth Hood \"Buddy\" MacKay Jr. (March 22, 1933 – December 31, 2024) was an American politician and diplomat. He served as Governor of Florida, following the death of then-Governor Lawton Chiles.State: MacKay steps into awkward 23 days He served as Governor for less than a month. He is the last Democrat to serve as Governor of Florida. ==Early life== MacKay was born in Ocala, Florida. His family were citrus farmers. He studied at the University of Florida. MacKay served the United States Air Force. He married Anne Selph in 1960. ==Early career== MacKay was elected to the Florida House of Representatives in 1968, and to the Florida Senate in 1975. From 1983 to 1989 he served for three terms in the United States House of Representatives. Controlling the national budget one of his main concerns. In 1988 he received the Democratic nomination for the United States Senate, but lost in a very close race for that office to Connie Mack III. ==Lieutenant Governor of Florida== MacKay won the 1990 Democratic primary for Lieutenant Governor on the ticket headed by former Senator Lawton Chiles. They won the election and were re-elected in 1994. MacKay succeeded Chiles as governor after his sudden death in 1998. ==Governor of Florida== In 1998 MacKay sought to succeed Chiles as Governor, easily winning the Democratic nomination with his full support (Chiles and MacKay were known for their friendly relationship). He was defeated by Republican nominee Jeb Bush. A few months later, he became governor after Chiles' death. MacKay served as governor for 23 days. During his term as governor, MacKay granted six pardons to female prisoners and tried to fix the Everglades. He appointed Peggy Quince for Florida Supreme Court. In 1999, he was succeeded by Bush. ==Personal life== MacKay lives in Tallahassee with his wife. MacKay has four children. MacKay died at his home in Ocklawaha, Florida, on the afternoon of December 31, 2024. ==References== ==Other websites== *Profile in Notable Name Database (NNDB) Category:1933 births Category:2024 deaths Category:Governors of Florida Category:Lieutenant Governors of Florida Category:American diplomats Category:Democratic Party (United States) politicians Category:People from Ocala, Florida Category:20th- century American politicians Category:Members of the Florida Legislature",
 "title": "Buddy MacKay"
}