{
 "id": "44404",
 "text": "The Spanish Armada was a Spanish naval fleet (army of ships) that was famously used by King Philip II of Spain against England in 1588. The ships were on their way to Flanders, across the English Channel, to fetch an army to invade England. However, the Royal Navy, under Queen Elizabeth I, caught up with the ships on the way. English ships sailed from Plymouth to attack the Armada. They were faster and more easily moved than the larger Spanish galleons. The English fired on the Armada and lost no ships as the Spanish sailed eastward off the south coast of England. That started on 12 July 1588 and ended in August 1588. The second-in-command of the Royal Navy was Sir Francis Drake. A story is that he was playing a game of bowling with his friends when he heard of the attack, but he boldly insisted that he had time to finish the game and then to defeat the Spanish Armada. The story was first written 100 years after the supposed events, however, and so it may have not have happened. The Spanish Armada was led by Spanish Duke of Medina Sidonia. He had no naval experience but replaced the original commander, who had died in February. The following year, an English Armada, sometimes called the \"Counter-Armada\" attacked the Spanish Navy in Portugal but complety failed also. That makes much less famous than the Spanish Armada. ==Reasons for war== The Anglo- Spanish War (1585-1604) had several causes: * Years of religious differences led up to the conflict between Catholic Spain and Protestant England. Philip II particularly feared the spread of Protestantism in England. He wanted to conquer England to bring it back to Catholicism and so he also had the support of the pope. * Spain saw England as a competitor in trade and in expansion to the New World (America) That led to many skirmishes (irregular fights) between English pirates and privateers and Spanish vessels. English sailors targeted Spanish shipping around Europe and the Atlantic Ocean. * The turning point came following the execution of Mary, Queen of Scots, Spain’s Catholic ally, which had been ordered by Elizabeth. That was the final straw for Philip II, Mary’s husband, after tensions had long existed England and Spain. * England, as a Protestant nation, continued to interfere in the Netherlands to support those who wanted independence from Spain. * In April 1587, while the Spanish Armada was being prepared, Drake burned over 20 Spanish ships in the Spanish port of Cadiz. == Defeat == The defeat of the Armada is often attributed to a severe storm that scattered the Spanish vessels before they met the British fleet. The Spanish could not use their advantage of having far more ships. The English had only 55 ships, which were not larger but carried more guns. The Spanish had only short-range cannons, but the English had long-range cannons. Part of the English strategy was to sink or to damage the enemy ships before they got close enough to fire back at them. The English ships could also move more easily. The Spanish galleons could have their oars broken off completely by a heavy vessel sailing past nearby. The morale and the dedication of the English sailors were high, especially by the famous speech by Elizabeth I and their loyalty to England. They also were led by experienced captains, who had years of naval battles behind them. The defeated Spanish fled northward through the North Sea, and the English chased them. Many more ships were lost, and thousands of men died during the retreat. ==Aftermath== The English sailors had done very well but failed to get paid and were made to stay on their ships and \"guard\" in case there was another Spanish attack. Lord Howard of Effingham was shocked when he found out that his soldiers were not getting paid. He said, \"I would rather have never a penny in the world, than they should lack\" (Modern English: I would rather never have money to having my men not have it). A year later, Elizabeth I sent a similar English Armada of more than 100 ships and 19,000 troops to complete her victory. It was to seize a fleet of Spanish treasure ships and to impose a new king on Portugal. However, that expedition also failed. A second Spanish Armada in 1596 and a third one in 1597 also failed. ==Reasons for Spanish failure== ===Unrealistic expectations=== King Philip II of Spain had a poor understanding of his plan of action. He believed that God was on his side, which was a faulty understanding of reality. ===Drake’s raid on Cadiz=== As the Armada was being prepared, English Admiral Sir Francis Drake launched a daring raid on the Spanish port of Cadiz, which disrupted the Spanish preparations and forced the invasion to be postponed until 1588. ===Duke of Medina-Sidonia=== The Duke of Medina-Sidonia had been selected for not his skills as an admiral but his noble birth. He was not very confident to lead such a huge armada against the English naval ships. He had also been known to get seasick. ===Lack of experienced gunners=== The Spanish lacked experienced gunners on their ships. On the other hand, the English fleet roughly had one man in ten as a gunnery specialist. That meant that that every gun crew was supervised by someone with the relevant skills and experience. As a result, when the battle came, the English fired two or three times faster. ===Poorer ammunition=== The Spanish carried more ammunition for their cannons than the English, but it was not as good. The iron ore in Spain was inferior in that found in England. The situation was made worse by the rush to produce ammunition for the expedition. To speed production, cannonballs had been cooled in water, which weakened their structure. ===Weather=== Even before they reached their destination, the Spanish ships had been scattered by storms twice. Some were damaged, others were lost, and there were long delays while they regrouped. That was an omen of what was to come, when storms smashed the Spanish fleet as it fled the English. The Spanish then limped home around the British Isles. ===Fire ships=== The English used fire ships against the Spanish fleet. They did not sink any enemy ships. However, they forced the Spanish to scatter, and ships were damaged as they collided one another. That gave the English an advantage in the days that followed. == Other websites == * Spanish Armada Citizendium * Category:16th century in Spain Category:History of the British Isles Category:Royal Navy Category:Crusades Category:1588",
 "title": "Spanish Armada"
}