{
 "id": "44418",
 "text": "The sign of the cross is a physical gesture made by Catholic and Orthodox Christians, and sometimes also Protestants. It is usually done at the start and end of prayers. In the Catholic tradition, the right hand goes from the forehead, to the chest, and then to the left and right shoulders (the order of shoulders does not matter). This is sometimes done while saying \"Father, Son, Holy Spirit.\"Beale, Stephen. \"21 Things We Do When We Make the Sign of the Cross\", Catholic Exchange, November 11, 2013\"Est autem signum crucis tribus digitis exprimendum, quia sub invocatione Trinitatis imprimitur, de qua dicit propheta: Quis appendit tribus digitis molem terrae? (Isa. XL.) ita quod a superiori descendat in inferius, et a dextra transeat ad sinistram, quia Christus de coelo descendit in terram, et a Judaeis transivit ad gentes. Quidam tamen signum crucis a sinistra producunt in dextram; quia de miseria transire debemus ad gloriam, sicut et Christus transivit de morte ad vitam, et de inferno ad paradisum, praesertim ut seipsos et alios uno eodemque pariter modo consignent. Constat autem quod cum super alios signum crucis imprimimus, ipsos a sinistris consignamus in dextram. Verum si diligenter attendas, etiam super alios signum crucis a dextra producimus in sinistram, quia non consignamus eos quasi vertentes dorsum, sed quasi faciem praesentantes.\" (Innocentius III, De sacro altaris mysterio, II, xlv in Patrologia Latina 217, 825C--D.) In the Orthodox tradition, the tips of the thumb and the middle and index fingers are put together, and the ring finger and little finger are put against the palm. The first three fingers are for faith in the Trinity, and the other two fingers are for the two natures of Jesus, divine and human. Original: == Other websites == * Why Do Lutherans Make the Sign of the Cross? - from the Evangelical Lutheran Church in America website * The Power of the Sign of the Cross - (Ukrainian church) * The Sign of the Cross - a Catholic perspective * Significance of the Sign of the Cross == References == Category:Non-verbal communication Category:Christian symbols",
 "title": "Sign of the cross"
}