{
 "id": "444293",
 "text": "Jab main Brookfield college Rahim Yar khan main tha tab SE main tum SE pyar karta hoon Sabahat Qamer plz mujhse shadi Kar lo.Hai koi Jo meri shadi Khawaja Fareed College Rahim Yar Khan BS Computer Science 8th Samester ki Sabahat Qamer SE karwa de ?Salman Khan (pronunciation : ; born Abdul Rashid Salim Salman Khan on December 27, 1965) is an Indian actor, producer, television presenter, and philanthropist. Khan works in Hindi language films and television shows. Khan was sentenced to a five-year imprisonment on May 6, 2015 from starting T-Series, running over 5 people, and killing 1, with his car. On May 8, 2015, Khan was not granted bail. Salman Khan was born in Indore, Madhya Pradesh, India. His parents are veteran his first wife Sushila Charak (later adopted the name Salma Khan) and Salim Khan. == Filmography == Year Title Role(s) Notes 1988 Biwi Ho To Aisi Vicky Bhandari Debut film 1989 Maine Pyar Kiya Prem 1990 Baaghi: A Rebel for Love Saajan Sood 1991 Sanam Bewafa Salman Khan 1991 Patthar Ke Phool Suraj Verma 19 Love Prithvi 1991 Saajan Akash Varma 1992 Suryavanshi Vicky / Suryavanshi Vikram Singh 1992 Ek Ladka Ek Ladki Raja 1992 Jaagruti Jugnu 1992 Nishchaiy Rohan Yadav / Vasudev Gujral 1993 Chandra Mukhi Raja Rai 1993 Dil Tera Aashiq Vijay 1994 Andaz Apna Apna Prem Bhopali 1994 Hum Aapke Hain Koun..! Prem 1994 Chaand Kaa Tukdaa Shyam Malhotra 1994 Sangdil Sanam Kishan 1995 Karan Arjun Karan / Ajay 1995 Veergati Ajay 1996 Majhdhaar Gopal 1996 Khamoshi: The Musical Raj 1996 Jeet Raju 1997 Judwaa Raja / Prem Malhotra 1997 Auzaar Inspector Suraj Prakash 1997 Dus Captain Jeet Sharma 1998 Pyaar Kiya To Darna Kya Suraj Khanna 1998 Jab Pyaar Kisise Hota Hai Suraj Dhanrajgir 1998 Bandhan Raju 1998 Kuch Kuch Hota Hai Aman Mehra 1999 Jaanam Samjha Karo Rahul 1999 Biwi No.1 Prem 1999 Hum Dil De Chuke Sanam Sameer 1999 Hello Brother Hero 1999 Hum Saath-Saath Hain: We Stand United Prem 2000 Dulhan Hum Le Jayenge Raja Oberoi 2000 Chal Mere Bhai Prem Oberoi 2000 Har Dil Jo Pyar Karega Raj / Romi 2000 Kahin Pyaar Na Ho Jaaye Prem Kapoor 2001 Chori Chori Chupke Chupke Raj Malhotra 2002 Tumko Na Bhool Paayenge Veer Singh Thakur / Ali 2002 Hum Tumhare Hain Sanam Suraj 2002 Yeh Hai Jalwa Raj 'Raju' Saxena / Raj Mittal 2003 Tere Naam Radhe Mohan 2003 Baghban Alok Raj 2004 Phir Milenge Rohit Manchanda 2004 Garv: Pride and Honour ACP Arjun Ranavat 2004 Mujhse Shaadi Karogi Sameer Malhotra 2004 Dil Ne Jise Apna Kahaa Rishabh 2005 Lucky: No Time for Love Aditya 2005 Maine Pyaar Kyun Kiya? Dr. Samir Malhotra 2005 No Entry Prem 2005 Kyon Ki Anand 2006 Shaadi Karke Phas Gaya Yaar Ayaan 2006 Jaan-E-Mann Suhaan Kapoor 2006 Saawan... The Love Season Sameer 2006 Baabul Avinash Kapoor 2007 Salaam-e-Ishq: A Tribute To Love Rahul 2007 Partner Prem 2007 Marigold: An Adventure in India Prem 2008 God Tussi Great Ho Arun Prajapati (A.P) 2008 Heroes Balkar Singh / Jassvinder Singh 2008 Yuvvraaj Deven Yuvvraaj 2009 Wanted Radhe / Rajveer Shikhawat 2009 Main Aurr Mrs Khanna Samir Khann 2009 London Dreams Mannu (Manjit Khosla) 2010 Veer Veer / Veera 2010 Dabangg Inspector Chulbul Pandey (Robinhood Pandey) 2011 Ready Prem Kapoor 2011 Bodyguard Lovely Singh 2012 Ek Tha Tiger Tiger / Manish Chandra / Avinash Singh Rathod 2012 Dabangg 2 Inspector Chulbul Pandey (Robinhood Pandey) 2014 Jai Ho Major Jai Agnihotri 2014 Fugly Himself Special appearance 2014 Kick Devi Lal singh/Devil 2014 Being Bhaijaan Himself Documentary film 2015 Bhajhrangi Bhaaijaan Pawan Kumar Chaturvedi 2015 Hero — Producer and playback singer for song \"Main Hoon Hero Tera\" 2015 Prem Ratan Dhan Payo Prem Dilwale / Yuvraj Vijay Singh 2016 Sultan Sultan Ali Khan 2019 Bharat Bharat Actor and producer Dabangg 3 Chulbul Pandey Producer Screenplay writer 2021 Radhe: Your Most Wanted Bhai Radhe Actor and producer Antim: The Final Truth Inspector Kuldeep Singh Gill Actor and producer ==Awards and nominations== == References == == Other websites == * * Category:1965 births Category:Living people Category:Indian movie actors Category:Indian movie producers Category:Indian screenwriters Category:Indian television presenters Category:Indian philanthropists",
 "title": "Salman Khan"
}