{
 "id": "444347",
 "text": "Luka Rocco Magnotta (born Eric Clinton Kirk Newman; July 24, 1982) is a convicted Canadian murderer. He was found guilty of murdering 33-year-old Jun Lin. After killing him, Magnotta cut the body into pieces and sent these body parts to different political parties and elementary school. Lin was a Chinese international student. Magnotta has had schizophrenia since 2000. He was convicted of fraud in Toronto in 2005. He was sentenced to community service and probation. An 11-minute video, showing the murder was uploaded to Bestgore.com. It was titled 1 Lunatic 1 Ice Pick. The video included footage of Magnotta repeatedly stabbing the victim and then the victim's dismemberment. After this, Magnotta ran away from Canada. He was the subject of an Interpol red notice. This led to an international manhunt. Magnotta was caught after he was found in an Internet café in Berlin. He was reading news about himself. He tried to give fake names to police before he admitted to who he was. He was handed over to Canadian authorities in Berlin on June 18, 2012. Magnotta returned to Canada on a Royal Canadian Air Force CC-150 Polaris. He was jailed in a single cell at the Rivière-des-Prairies detention centre. At 11 am on May 29, 2012, a package which contained a left foot was delivered to the main offices of the Conservative Party of Canada. Another package which contained a left hand was addressed to the Liberal Party. It was intercepted in a Canada Post processing facility. A janitor found a decomposing torso in a suitcase in the alley behind an apartment building in the Snowdon area of Montreal. On June 5, 2012, a package which contained a right foot was delivered to St. George's School. Another package which contained a right hand was sent to False Creek Elementary School in Vancouver. On June 6, 2012, Lin's family arrived at Trudeau Airport in Montreal. A candlelight vigil was then held in Montreal. The body parts were later matched to Jun Lin by DNA samples from his family. After police got an anonymous tip, they found Lin's head. It was lying at the edge of a small lake in Montreal's Angrignon Park. On July 11, Lin's body was burned at his funeral. His ashes were buried in the Notre- Dame-des-Neiges cemetery in Montreal. Canadian media named Magnotta the \"Canadian Newsmaker of the Year.\" This caused controversy. After committal for trial, the judge set a trial date of September 8, 2014 on April 29, 2013. On September 29, 2014 in court in Quebec, Magnotta admitted that he killed Jun Lin. He pled \"not guilty \"to murder due to his schizophrenia.Porn star admits killing and chopping up lover In addition to schizophrenia, Magnotta has been diagnosed with borderline personality disorder and histrionic personality disorder.Psychiatrist downplays giant red flag After a twelve-week trial, the jury were given their final instructions from the trial judge on December 15, 2014. On their eighth day of discussing the case, the jury returned a verdict of guilty on all charges. Magnotta was given a life sentence. He will be eligible for parole in 25 years. Magnotta was also sentenced to 19 years for other charges. Magnotta was previously wanted by animal rights groups for allegedly posting videos of himself killing kittens. There was no accusation for these videos. ==References== ==Other websites== * Category:1982 births Category:Living people Category:2012 crimes Category:Canadian murderers Category:Fraudsters Category:Prisoners Category:People with borderline personality disorder Category:People with histrionic personality disorder Category:People with schizophrenia",
 "title": "Luka Magnotta"
}