{
 "id": "444499",
 "text": "Cuvier's beaked whale (Ziphius cavirostris), is the only member of the genus Ziphius. It is the most widely distributed of all the beaked whales.Grzimek, Bernhard et al 2003. Grzimek's animal life encyclopedia. Vol 15, Mammals IV. 2nd ed, Farmington Hills, MI: Gale. It is a record deep diver: :\"Cuvier’s beaked whales are likely to be the most extreme divers among marine mammals, able to go nearly 3km down and hold their breath for more than two hours\".Amos, Jonathan 2014. Beaked whale is deep-dive champion. BBC News Science & Environment. ==History of discovery== The French anatomist Georges Cuvier, in his Sur les Ossemens fossiles (1823),Cuvier, Georges 1823. Recherches sur les ossemens fossiles. 5.1 (2nd ed), Paris, 350–2, fig 7. first described the species based on an imperfect skull from the Mediterranean coast of France. A peasant had found it on the shore in 1803. Cuvier named it Ziphius cavirostris. The specific name comes from the Latin cavus for \"hollow\" or \"concave\". This refers to the deep hollow in the skull, a diagnostic trait of the species. Cuvier believed it was an extinct species. In 1850 zoologists realized the species was still living, when Paul Gervais compared the type specimen to a whale stranded at Aresquiès, Hérault. He found the two to be identical.Turner W. 1872. On the occurrence of Ziphius cavirostris in the Shetland Seas, and a comparison of its skull with that of Sowerby’s whale (Mesoplodon Sowerbyi). Transactions of the Royal Society of Edinburgh 26 (4): 759–80. == Prey == Cuvier's beaked whale feeds on several species of squid. They also prey on deep-sea fish.Evans, Peter G.H. 1987. The natural history of whales and dolphins. New York: Facts on File, p137. On March 27 2014 a Cuvier's beaked whale tracked by a satellite-linked tag set a new deep diving record for a sea mammal, plunging nearly two miles below the ocean surface. Although it is in the Odontoceti, it has little use for teeth. As adults, two incisors at the front of the lower jaw stick forward. Basically, it sucks in prey by expanding its throat.Heyning, John E 2002. Cuvier's beaked whale. In Jefferson, Thomas A. Encyclopedia of marine mammals. Academic Press, 305–7. == References == Category:Toothed whales",
 "title": "Cuvier's beaked whale"
}