{
 "id": "444574",
 "text": "was a Japanese geneticist and evolutionary biologist. He went to the United States in 1951 as a visiting scholar to UCLA. He later became a citizen of the USA. == Biography == Susumu Ohno was born of Japanese parents in Seoul, Korea, on February 1, 1928. The family returned to Japan after the war in 1945. His passion for science came from his lifelong love of horses. He earned a Ph.D. in veterinary science at Tokyo University of Agriculture and Technology in 1949, and later a Ph.D. and D.Sc. from Hokkaido University. == Scientific contributions == Ohno suggested that gene duplication plays a major role in evolution in his classic book Evolution by Gene Duplication (1970).Ohno, Susumu 1970. Evolution by gene duplication. Berlin: Springer-Verlag. Subsequent research has overwhelmingly confirmed the key role of gene duplication in molecular evolution. Sometimes. one gene copy, or \"paralog\", takes on a totally new function after a gene duplication event. This means one of the gene copies mutates to develop a function that was not present in the ancestral gene.Conrad B. and Antonarakis S.E. 2007. Gene duplication: a drive for phenotypic diversity and cause of human disease. Annual review of genomics and human genetics 8, 17-35. In this way, a gene duplication may lead to new possibilities in its descendents. Normally, a big change in gene function is resisted because the original function is needed, but after a duplication one gene carries on the original function. Therefore, a change of function in the second copy is possible without loss of fitness.De Smet R. & Van de Peer Y. 2012. Redundancy and rewiring of genetic networks following genome-wide duplication events. Current opinion in plant biology. Feb, 1-9.Ruby J.G. et al 2007. Evolution, biogenesis, expression, and target predictions of a substantially expanded set of Drosophila microRNAs. Genome research 17 (12) 1850-1864.D.H. Graur and W.-H.C. Li 2000. Fundamentals of Molecular Evolution. 2nd ed, Sinauer. In his book, he also suggested that vertebrate genome is the result of one or more entire genome duplications. Variations of this idea have come to be known as the 2R hypothesis (also called \"Ohno's hypothesis\"). He indicated that mammalian X chromosomes are conserved among species: it has been referred to as Ohno's law.Ohno S. 1967. Sex chromosomes and sex-linked genes. Berlin: Springer-Verlag.Ohno S. 1979. Major sex-determining genes. Berlin: Springer-Verlag. He also invented the term Junk DNA for segments of the DNA that have no known function. == Related pages == *Gene duplication *Polyploidy == References == == Other websites == * Biographical memoir by Ernest Beutler * Biography by Ulrich Wolf * Tamil work by Susumu Ohno * Japanese-Tamil link Category:1928 births Category:2000 deaths Category:Evolutionary biologists Category:Japanese scientists Category:People from Seoul Category:Geneticists",
 "title": "Susumu Ohno"
}