{
 "id": "444662",
 "text": "Downtown no Gaki no Tsukai ya Arahende!! (English: Downtown's We Aren't Errand Boys!) is an Japanese variety show show. It is shown on the Nippon Television network and features the popular Japanese owarai duo, Downtown. The show is popular for its \"no laughing\" batsu games where the cast has to endure many ridiculous situations for 24 hours in a place which the theme is and must not laugh or they will be hit with a weapon on the buttocks. Usually, this program is shown for about 6 hours on the New Year's Eve. This program has a long broadcast period after Shōten in Nippon Television. Downtown no Gaki no Tsukai ya Arahende!! ==Cast== ===Regular=== *Downtown's Hitoshi Matsumoto (Matsumoto Hitoshi) and Masatoshi Hamada (Hamada Masatoshi) Hitoshi Matsumoto is taking charge of the composition of this program.He suggests many of plans. Masatoshi Hamada does chairman advance. *Hōsei Yamasaki (Yamasaki Hōsei) He is an indispensable character to this program. *Cocorico Naoki Tanaka (Tanaka Naoki) and Shōzō Endō (Endō Shōzō) ===Semi-regular=== *License Takahumi Inomoto (Inomoto Takahumi) and Kazuhiro Huziwara (Huziwara Kazuhiro) preceding opinion or plan ===Periodical Guest=== *Zimi-Onishi He appears in series as a punishment or a Must not laugh *Itsuzi Itao He appears in series as a punishment or a Must not laugh, Itao Plan *Moriman Yamazaki VS Moriman *Syozi Murakami Syozi Murakami classroom ===Other Cast=== *Itao's wife and Itao's child *Central African TV *Tonight is YAMADA *Pikaderi-Umeda ==Program staff== *Kenji Suga (nickname Ga-su-) He is Nippon Television work deputy chief *Toshihide Saito (nickname Heipo-) Comprehensive production ==Project== *Free talk *Matsumoto vs Hamada battle series *Must not laugh series *Yamazaki vs Moriman Moriman has won all the games. *Hightension series *Good-bye Yamazaki Hosei series *Entertainers fishing championship *seven changes ==Audience ratings== This program is always ranked in the top 10 in variety program annual audience rating from 1995 to 2001. The number of sales of a total of eight DVDs records smash success which sells about 1700000 sheets. The ninth DVD was also sold, it became the 1st place of a ranking first appearance, and the number of the gross sales exceeded 2 million sheets. ==Other websites== *Official website (Japanese) * YOSHIMOTO R and C CO.,LTD./ Gakitsuka DVD (Japanese) ==References== Category:Japanese television series Category:1980s television series Category:1990s television series Category:2000s television series Category:2010s television series Category:1989 television series debuts",
 "title": "Downtown no Gaki no Tsukai ya Arahende!!"
}