{
 "id": "444687",
 "text": "An Extremely Goofy Movie (also known as Another Goofy Movie) is a 2000 American direct-to-video animated comedy movie. It was produced by Lynne Southerland and was directed by Ian Harrowell and Douglas McCarthy. It is a sequel to the 1995 movie A Goofy Movie. An Extremely Goofy Movie was released on February 29, 2000 in North America, the latest release was September 1, 2001 in Russia. The movie holds a 57% rating on Rotten Tomatoes. The movie won the \"Best Animated Home Video Production\" category at the 28th Annie Awards in 2000. Bill Farmer was also nominated for \"Best Voice Acting by a Male Performer\". It was originally set to release in fall 1999, but like it's predecessor, it was pushed back to 2000. == Cast == * Bill Farmer as Goofy Goof. (Andrew Collins was his supervising animator) * Jason Marsden as Max Goof (Bob Baxter and Steven Trenbirth were his supervising animators) * Jeff Bennett as Bradley Uppercrust III, an unemployment lady and Chuck the Sportscaster (Kevin Peaty was the supervising animator for Bradley Uppercrust III) * Jim Cummings as Pete and Toy Factory Boss * Brad Garrett as Tank * Vicki Lewis as the Beret Girl in the Cafe (Kevin Peaty was her supervising animator) * Bebe Neuwirth as Sylvia Marpole, the Head College Librarian (Andrew Collins was her supervising animator) * Rob Paulsen as P.J. (a.k.a. P.J. Pete). (Bob Baxter and Steven Trenbirth were his supervising animators) * Pauly Shore as Robert \"Bobby\" Zimeruski The additional voices were provided by the following voice actors: * Paddi Edwards as Receptionist at Office * Barbara Harris as a Cafe Cashier * Sherry Lynn as Girl at Club * Kath Soucie, Cree Summer-Francks and Jenna von Oy as three co-ed's. ==References== == Other websites == *Official website * Category:2000 movies Category:2000 animated movies Category:American comedy movies Category:Disney animated movies Category:Disney direct-to-video movies Category:Direct-to-video movies Category:English-language movies Category:Goofy Category:Movies about dogs Category:Movies based on TV series",
 "title": "An Extremely Goofy Movie"
}