{
 "id": "4450",
 "text": "Sir Anthony Charles Lynton \"Tony\" Blair (born 6 May 1953) is a British politician who served as Prime Minister of the United Kingdom from 1997 to 2007. He was Leader of the Labour Party from 1994 to 2007 and Member of Parliament (MP) for Sedgefield from 1983 to 2007. On the day he stood down as Prime Minister and MP, he was made official Envoy of the Quartet on the Middle East on behalf of the United Nations, the European Union, the United States and Russia. Blair was elected Leader of the Labour Party in the 1994 leadership election following the sudden death of his predecessor, John Smith. Under Blair's leadership the party abandoned many policies it had held for decades. Labour won a landslide victory in the 1997 general election, which ended 18 years of Conservative rule with the heaviest Conservative defeat since 1832. He was the Labour Party's longest-serving Prime Minister and the only leader to have taken the party to three uninterrupted general election victories. Gordon Brown, Chancellor of the Exchequer during all Blair's ten years in office, succeeded him as party leader and Prime Minister in 2007. ==Early life== Blair was born at Queen Mary Maternity Home in Edinburgh on 6 May 1953. He was the second son of Leo and Hazel Blair. Blair joined the Labour Party in 1975. ==Career== Blair was a lawyer before becoming a politician. He married Cherie Booth, also a lawyer, who graduated from the London School of Economics with a first-class honours degree. Blair himself left Oxford University with a second-class degree. They have four children: Euan, Nicky, Kathryn, and Leo. There was a controversy over Blair sending Euan to a grant-maintained school. As a result of this, Alastair Campbell discovered Blair \"standing stark naked reading the Daily Mail.\" ===As Prime Minister=== As Leader of the Labour Party, he won the 1997, 2001 and 2005 UK general elections. Blair is the first and only Labour Party leader to have won three general elections in a row. He attributes his success in politics to a pair of \"lucky brogues\", which he wore for every single Prime Minister's Questions of his leadership. He claimed that \"cheap shoes are a false economy\". Blair strongly supported a number of elements of US foreign policy, notably participating in the invasions of Afghanistan in 2001 and Iraq in 2003. He faced heavy criticism for this. The facts about Iraq's possible possession of weapons of mass destruction that he relied on, which later turned out to be false, led many to perceive him as dishonest. Playwright Harold Pinter and former Malaysian Prime Minister Mahathir Mohamad said Blair committed war crimes. Criticism also arose for his involvement in bombings of Yugoslavia in 1999 when he supported the Kosovo Albanian UÇK guerrillas. ===After-PM=== On the day of his resignation, Blair was made an official envoy in the Middle East. In 2004, he started the Commission for Africa. He continued work as a commissioner after his service as Prime Minister ended. In December 2021, Queen Elizabeth II honored Blair with the Order of the Garter. ==References== ==Other websites== * Category:1953 births Category:Living people Category:Alumni of the University of Oxford Category:British Roman Catholics Category:British autobiographers Category:Labour Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:Leaders of the Labour Party (UK) Category:Leaders of the Opposition (United Kingdom) Category:Politicians from Edinburgh Category:Presidential Medal of Freedom recipients Category:Members of the Privy Council of the United Kingdom Category:UK MPs 1983–1987 Category:UK MPs 1987–1992 Category:UK MPs 1992–1997 Category:UK MPs 1997–2001 Category:UK MPs 2001–2005 Category:UK MPs 2005–2010",
 "title": "Tony Blair"
}