{
 "id": "44547",
 "text": "Georgios Kyriacos Panayiotou (25 June 1963 - 25 December 2016), known professionally as George Michael, was an English singer-songwriter, and record producer. He is regarded as one of the greatest cultural icons of all time and one of the greatest artists in music history. ==Overview== George Michael is seen as one of the greatest cultural icons of all time and one of the greatest artists in music history. In May 2025, \"Careless Whisper\" was voted as the most favourite song in the United Kingdom (UK) for the seventh year. * * * * * ==Career== ===1980s=== George Michael rose to fame in the 1980s, when he formed the pop duo Wham! with his school friend Andrew Ridgeley. The duo released a string of massive singles in 1982 like \"Young Guns (Go for It)\" and \"Wham Rap! (Enjoy What You Do)\", both written by Michael. In 1983, Wham!'s debut album, Fantastic was released. It reached #1 in the UK charts and had the hit single \"Club Tropicana\" with a music video, shot in Ibiza. After a year, Wham changed its image with the release of their second album Make It Big, which was a critical and commercial success, hitting #1 in both the UK and the USA. It produced four singles, all topping the charts on both sides of the Atlantic. One of the most popular songs in the album, Careless Whisper, Michael's first solo single, was released in 1984 while he was still performing with Wham!. In 1986, Wham! disbanded after release of a third studio album, single and concert at Wembley Stadium. Following his split with Wham!, George Michael began a successful solo career, releasing four studio albums, Faith (1987), Listen Without Prejudice Vol. 1 (1990), Older (1996), and Patience (2004). Michael has sold over 100 million records worldwide as of 2010, encompassing 11 British #1 singles, 9 British #1 albums, 10 US #1 singles, and 2 US #1 album. Michael's 1987 debut solo album, Faith has sold over 20 million copies worldwide alone and its considered by some music critics to be one of the greatest albums in pop music history. ===2000s=== In 2004, Radio Academy has named Michael the most played artist on British radio between the period of 1984-2004. In 2006, George Michael announced his first tour in 15 years. 25 Live tour was a massive, worldwide undertaking by Michael that spanned forth individual tours over the course of five years (2006, 2007, 2008, 2009 and 2010). ==Charity== In November 1984, Michael joined other popular British and Irish pop stars to form Band Aid, singing on the charity song \"Do They Know It's Christmas?\" for relief of famine in Ethiopia. This single became the UK Christmas number one on the UK Singles Chart in December 1984. Michael's own song, \"Last Christmas\" by Wham!, was held at number two. \"Do They Know It's Christmas?\" sold 3.75 million copies in the UK. The song became the biggest selling single in UK Chart history. It held this position until 1997 when it was overtaken by Elton John's \"Candle in the Wind 1997\", released in tribute to Princess Diana following her death Michael also attended Diana's funeral with Elton John. Michael donated the royalties from \"Last Christmas\" to Band Aid and subsequently sang with Elton John at Live Aid (the Band Aid charity concert) in 1985. ==Personal life== Georgios Kyriacos Panayiotou was born in London to White English parents, his mother is of Spanish, Portuguese, Dutch and German descent and his father is of Greek and Cypriot descent. Michael was raised there and in Hertfordshire. He was initially private about being homosexual. During his Wham! career, he was in relationships with well-known women such as actress Brooke Shields, and model Pat Fernandes. Between 1986 and 1988, he was romantically involved with Kathy Yueng, an American makeup artist who was featured in the \"I Want Your Sex\" music video. Nonetheless, his sexual orientation was well known among London music business people. These persisted into his solo career, but Michael had already established a relationship with Anselmo Feleppa, whom he had met at the 1991 concert Rock in Rio. Feleppa died of an AIDS-related brain hemorrhage in 1993. Michael's single \"Jesus to a Child\" is a tribute to Feleppa: he consistently dedicated it to him before performing it live, as is his 1996 album Older. Starting in 1996, Michael was in a long-term relationship with businessman Kenny Goss. They had homes in London and Dallas. ==Death== On 25 December 2016, before 17:24 GMT, Michael died at his property in Goring, Oxfordshire, England from heart failure and a fatty liver, aged 53. Before 22:59 GMT his publicist stated that he had \"passed away peacefully\" and Thames Valley Police said they were treating the death as unexplained and there were no suspicious circumstances. South Central Ambulance Service had attended his property at 13:42 GMT on Christmas Day. ==Discography== ===Studio albums=== Year Album details 1987 Faith * Release date: 2 November 1987 * Label: Columbia Records 1990 Listen Without Prejudice Vol. 1 * Release date: 11 September 1990 * Label: Columbia Records 1996 Older * Release date: 14 May 1996 * Label: DreamWorks Records 2004 Patience * Release date: 18 May 2004 * Label: Epic Records ==Tributes== ===Elton John=== Elton John was among those who paid tribute to Michael, emotionally addressing the audience in Las Vegas on 28 December, \"What a singer, what a songwriter. But more than anything as a human being he was one of the kindest, sweetest, most generous people I've ever met.\" ===Adele=== At the 59th Annual Grammy Awards on February 12, 2017, Adele performed a slow version of \"Fastlove\" in tribute to Michael. ===Geri Halliwell=== In June 2017, Michael's close friend, former Spice Girls member Geri Halliwell, released a charity single, \"Angels in Chains\", a tribute to him, to raise money for Childline. ==References== Category:Gay men Category:1963 births Category:2016 deaths Category:LGBT singers Category:LGBT songwriters Category:English LGBT people Category:Singers from London Category:Criminals from London Category:Deaths from myocarditis Category:Deaths from liver disease Category:Deaths from cardiomyopathy Category:English singer-songwriters Category:Musicians from Hertfordshire Category:British LGBT rights activists Category:Commanders of the Order of the British Empire",
 "title": "George Michael"
}