{
 "id": "445557",
 "text": "Álvaro \"Al\" Montoya (born February 13, 1985) is an American former professional ice hockey goaltender. He played parts of ten seasons in the National Hockey League (NHL). He played for the Phoenix Coyotes, New York Islanders, Winnipeg Jets, Florida Panthers, Montreal Canadiens, and Edmonton Oilers. He is the first Cuban American to play in the NHL. ==Career== Before playing in the NHL, Montoya played 15 games with the Texas Tornado and 24 games with the USA Hockey National Team Development Program of the North American Hockey League (NAHL), 3 years of college ice hockey at the University of Michigan and 2 games with the Charlotte Checkers of the ECHL. Montoya was drafted with the 6th overall pick by the New York Rangers in the 2004 NHL Entry Draft. On February 26, 2008, the Rangers sent Montoya along with Marcel Hossa to the Phoenix Coyotes for Fredrik Sjöström, David LeNeveu, and Josh Gratton. His first game in the NHL was with the Coyotes on April 1, 2009 and he was able to record a 3-0 shutout victory over the Colorado Avalanche. The Coyotes traded him to the New York Islanders for a sixth round draft pick on February 9, 2011. Montoya signed a one-year contract extension with the Islanders on March 29. On July 4, 2012, he was signed to a one-year, $601,000 deal by the Winnipeg Jets after he was released from the Islanders. On June 28, 2014, Montoya was signed as a free agent by the Florida Panthers to a two- year, $1,050,000 contract. On July 1, 2016, Montoya signed a one-year; $950,000 contract with the Montreal Canadiens. On January 2, 2017, he would sign a two-year contract to stay in Montreal. On January 4, 2018, the Canadiens traded Montoya to the Edmonton Oilers in exchange for a fourth-round pick in the 2018 NHL Entry Draft. In 2019, Montoya retired from playing professional ice hockey. On September 9, 2021, Montoya accepted a job to become a director of community outreach for the Dallas Stars. ==References== == Other websites == * * Category:1985 births Category:Living people Category:Bakersfield Condors players Category:Edmonton Oilers players Category:Florida Panthers players Category:Hartford Wolf Pack players Category:Montreal Canadiens players Category:New York Islanders players Category:Phoenix Coyotes players Category:San Antonio Rampage players Category:Sportspeople from Chicago Category:Winnipeg Jets players Category:ECHL players Category:United States Hockey League players",
 "title": "Al Montoya"
}