{
 "id": "445563",
 "text": "Topsham is a town in Sagadahoc County, Maine, United States. Its population was 9,560 at the 2020 census. It is part of the Portland-South Portland- Biddeford, Maine metropolitan statistical area. Topsham is where the Topsham Fair happens every year. ==History== The Pejepscot Abenaki Indians, a sub- tribe of the Anasagunticooks (now Androscoggins), used to own the land that is now Topsham. They called the this area \"Sawacook.\" The Pejepscot Abenaki controlled the Androscoggin River. They lived and fished at Pejepscot Falls. But a plague, probably smallpox brought by Europeans, killed most of the tribe's population in 1615-1616. On June 16, 1632, the Plymouth Council gave some land that had once belonged to the Abenaki to Thomas Purchase and George Way. The land was later given to Richard Wharton, and then in 1714 it was given to the Pejepscot Company. The first sawmill there was built in 1716 on the Cathance River. In 1717 the area got its current name, Topsham. It is named after the town of Topsham in Devon, England. On January 31, 1764, Topsham was incorporated as a town by the Massachusetts General Court. Shipbuilding and lumber mills were important early businesses in Topsham. Pejepscot Falls provided the power to support industry. Lumber mills were very active between 1750 and 1770. Factories later produced things like lumber, watches, doors and pottery. Topsham and Brunswick were connected with the Underground Railroad during the years of slavery. There were safe houses and underground tunnels to hide escaped slaves in both towns. http://www.curtislibrary.com/wp-content/uploads/2013/08/FACTS-AND-LEGENDS-THE- UNDERGROUND-RR.pdf The Brunswick and Topsham Water District was incorporated in 1903. File:Pejepscot Falls, Androscoggin River, ME.jpg|Pejepscot Falls in 1869 File:Topsham from Mason St, by Barnes, G. W. (George W.).jpg|Town view c. 1875 File:Paper Mills, Topsham, ME.jpg|Paper mills c. 1912 ==Geography== According to the United States Census Bureau, the town has a total area of , of which is land and is water. The Androscoggin River, the Cathance River and the Muddy River drain Topsham. These rivers empty into Merrymeeting Bay, an inland delta. Merrymeeting Bay is located to the northeast of Topsham. Interstate 295, U.S. Route 201, and state routes 24 and 196 all go through Topsham. Topsham borders the towns of Bowdoin and Bowdoinham to the north, Brunswick to the south, and Durham and Lisbon to the northwest. ==Demographics== As of the census of 2020, there were 9,560 people, 4,138 households, and 2,679 families residing in the town. The population density was . There were 4,413 housing units at an average density of . The racial makeup of the town was 93.3% White, 0.8% African American, 0.2% Native American, 1.3% Asian, 0.3% from other races, and 4.0% from two or more races. Hispanic or Latino of any race were 1.8% of the population. ==Education== Public schools in the area are operated by Regional School Unit (RSU) 75. There are two elementary schools, Williams-Cone School and Woodside Elementary. The middle school is Mt. Ararat Middle School, and the high school is Mt. Ararat High School. ==Sites of interest== * Androscoggin Pedestrian Swinging Bridge * Bradley Pond Farm Preserve * Cathance River Nature Preserve * Pejepscot Paper Company Mill (1868) * Topsham Fair == Notable people == * Douglas C. Bennett, President Emeritus of Earlham College * William A. Ellis, former member of the Wisconsin Senate, was born in Topsham * Frank Glazer, pianist, composer and professor of music * Elijah Kellogg, minister, lecturer, author * Holman S. Melcher, Civil War era officer and politician * Benjamin Orr, US congressman * Benjamin Randall, US congressman * John Rensenbrink, co- founder of the Maine Green Independent Party and the Green Party of the United States * Carter Smith, film director and fashion photographer ==References== ==Further reading== * History of Brunswick, Topsham, and Harpswell, Maine Including Ancient Pejebscot. By George Augustus Wheeler and Henry Warren Wheeler. Published 1878. Full image at books.google. * Pejepscot Historical Society * ==Other websites== * Town of Topsham, Maine Category:Towns in Maine Category:1764 establishments in the Thirteen Colonies",
 "title": "Topsham, Maine"
}