{
 "id": "445817",
 "text": "Devan Dubnyk (born May 4, 1986) is a Canadian former professional ice hockey goaltender. He played 12 seasons in the National Hockey League (NHL). He played for the Edmonton Oilers, Nashville Predators, Arizona Coyotes, Minnesota Wild, San Jose Sharks, and the Colorado Avalanche. He was born in Regina, Saskatchewan but grew up in Calgary, Alberta. ==Career== Before playing in the NHL, Dubnyk played 5 years with the Kamloops Blazers of the Western Hockey League (WHL). He also played 1 season with the Stockton Thunder of the ECHL. During his time with the Blazers, he was named the CHL Scholastic Player of the Year as the major-junior player that was best able to combine success on the ice and in school in 2004. Dubnyk was drafted with the 14th overall pick by the Edmonton Oilers in the 2004 NHL Entry Draft. He made his NHL debut with the Oilers on November 28, 2009 in a 7–3 loss to the Vancouver Canucks. He recorded his first NHL win on March 21, 2010 in a 5–1 victory over the San Jose Sharks. He was re-signed to a two-year contract by the Oilers on July 13, 2010. On January 15, 2014, the Oilers traded Dubnyk to the Nashville Predators for Matt Hendricks. Dubnyk started 2 games for the Predators and was sent down to the AHL to make room for Pekka Rinne who was returning from injury. On March 5, 2014, the Predators traded Dubnyk to the Montreal Canadiens for future considerations. On July 1, 2014, Dubnyk signed one-year contract with the Arizona Coyotes. On January 14, 2015, the Coyotes traded Dubnyk to the Minnesota Wild in exchange for a 3rd-round pick in the 2015 NHL Entry Draft. On October 29, 2022, Dubnyk announced that he was retiring from playing professional ice hockey. ==References== == Other websites == * * Category:1986 births Category:Arizona Coyotes players Category:Canadian ice hockey goaltenders Category:Charlotte Checkers (2010–) players Category:Colorado Avalanche players Category:Edmonton Oilers players Category:Hamilton Bulldogs (AHL) players Category:Ice hockey people from Saskatchewan Category:Kamloops Blazers players Category:Living people Category:Minnesota Wild players Category:Nashville Predators players Category:San Jose Sharks players Category:Springfield Falcons players Category:Wilkes-Barre/Scranton Penguins players Category:Sportspeople from Regina, Saskatchewan Category:ECHL players",
 "title": "Devan Dubnyk"
}