{
 "id": "445969",
 "text": "Saraya-Jade Bevis (born 17 August 1992) is an English professional wrestler. She most recently wrestled for All Elite Wrestling (AEW) under the ring name Saraya. She is also known for her time in WWE where she wrestled under the ring name Paige. During her time in WWE, she became a two-time Divas Champion and a one-time NXT Women's Champion, as well as the first and youngest person to win the latter title. She is also known under the ring name Britani Knight. She used that name while performing on the independent circuit. Bevis is a member of the British wrestling's Knight family which is made up of her real life family. It includes her parents, Saraya and Ricky, and her brother, Zak Zodiak == Career == === WWE (2011–2022) === In September 2011, Bevis signed a contract with WWE and started in their developmental territory, Florida Championship Wrestling (FCW). She used the ring name Paige, taking it from the character Paige Matthews from Charmed. In 2012, FCW became NXT. In June 2013, Paige entered a tournament to crown the first NXT Women's Champion. She defeated Tamina and Alicia Fox in the first two rounds, and Emma in the finals on 20 June (aired on 24 July). On 7 April 2014 episode of Raw, Paige made her main roster debut in WWE. She gave her congratulations to WWE Divas Champion AJ Lee on her successful title defense at WrestleMania XXX. Lee challenged Paige to a match and put her championship on the line. In the match, Paige was able to defeat AJ and win her first Divas Championship in WWE. When she won the championship, she became the first female wrestler to hold a developmental (NXT Women's) and primary (WWE Divas) championship at the same time and also became the youngest Divas Champion. On 24 April, she was forced to vacate her NXT Women's Championship. On 30 July episode of Raw, AJ Lee returned to the WWE and defeated Paige for the Divas Championship. On 17 August at SummerSlam, Paige won her second Divas Championship from AJ, but lost it back to her a month later at Night of Champions in a triple threat match also involving Nikki Bella. In October 2014, Paige joined the cast of Total Divas. On 13 July 2015, Stephanie McMahon introduced Charlotte and Becky Lynch, who mde their main roster debuts, as Paige's partners. They then named their team \"Team PCB\". On 21 September, the night after Charlotte won the Divas Championship at Night of Champions, Paige turned heel after insulting her partners and the Divas division. In the 2016 WWE draft on 19 July, Paige was drafted to Raw. However, she did not compete for more than one year because of a neck injury. On 20 November 2017, she returned on Raw and was joined by the debuting Mandy Rose and Sonya Deville. They attacked Sasha Banks, Bayley, Mickie James and Raw Women's Champion Alexa Bliss. The following week Paige announced that the group would be called Absolution. At a house show on 27 December, Paige suffered another neck injury after a kick from Sasha Banks in a six-woman tag team match, therefore retiring from in-ring competition. She continued to manage Rose and Deville until 10 April 2018, when she was named the new general manager of SmackDown by Shane McMahon. The previous person in this position. Daniel Bryan, was cleared to return to wrestling. Paige also turned face once again. On 17 December, she was removed from the role when the McMahon family announced they would take over control of WWE. In April 2019, Paige began managing the Kabuki Warriors (Asuka and Kairi Sane). On 28 October episode of Raw, Asuka and Sane turned on her when Asuka sprayed green mist in her face. Paige then became a contributor for WWE Backstage, on FS1. On 10 June 2022, Paige announced that she would leave WWE on 7 July, therefore ending her time in the company after nearly eleven years. === All Elite Wrestling (2022–2025) === On 21 September 2022 at Grand Slam, Saraya made her debut for All Elite Wrestling (AEW). She saved Toni Storm and Athena from a beatdown by Britt Baker, Jamie Hayter, and Serena Deeb. On 9 November episode of Dynamite, she announced that she was cleared to return to the ring and would wrestle her first match since 2017 against Britt Baker at Full Gear on 19 November. At the event, Saraya defeated Baker. In her second AEW match Saraya on 11 January 2023 she teamed with Toni Storm and lost against Baker and AEW Women's World Champion Jamie Hayter. The following week, Saraya and Storm turned heel and attacked Willow Nightingale. On 5 March at Revolution, Ruby Soho joined them after failing to win the title from Hayter and attacking her. On 10 March, the group became known as \"The Outcasts\". On 27 August at All In London, Saraya won the AEW Women's World Championship. She defeated Dr. Britt Baker, D.M.D., Toni Storm, and former champion Hikaru Shida in a four- way match in front of her home country fans. On 10 October episode of Dynamite, Saraya lost the AEW Women's World Championship back to Shida. On 26 March 2025, Saraya announced that she is leaving AEW. == Other media == In July 2012, Channel 4 made a documentary about Bevis and her family titled The Wrestlers: Fighting with My Family. The documentary was turned into the 2019 film Fighting with My Family, with Florence Pugh playing Bevis. Bevis has appeared in seven WWE video games. She made her in-game debut as a downloadable character in WWE 2K15, and is featured as a playable character in WWE 2K16, WWE 2K17, WWE 2K18,WWE 2K19 WWE 2K20. and WWE 2K Battlegrounds In October 2014, Bevis joined the cast of Total Divas, a reality television show produced by WWE and E!, for the second part of the show's third season, which began airing in 2015. In June 2015, Bevis became one of the judges on the sixth season of Tough Enough. On 3 August 2015, Bevis was a guest on Stone Cold Steve Austin's Stone Cold Podcast, which aired on the WWE Network. Bevis has appeared in two WWE Studios films: Santa's Little Helper, released in November 2015, and Scooby-Doo! and WWE: Curse of the Speed Demon, in which she performed a voice role and was released in July 2016. She also peformed a voice role in the WWE Studios and Sony Pictures Animation film Surf's Up 2: WaveMania, which was released in 2017. Bevis was featured in the WWE Network special WWE Chronicle that premiered on 26 January 2019. ==Personal life== She is in a relationship with Ronnie Radke of Falling in Reverse and has appeared in the music video for their song \"I'm Not a Vampire (Revamped)\". She also used their song \"Zombified\" as her entrance theme in AEW. == Films and television == Film Year Title Role Notes 2015 Santa's Little Helper Eleanor USA TV movie 2016 Scooby-Doo! and WWE: Curse of the Speed Demon Herself Voice performance Straight-to-DVD 2017 Surf's Up 2: WaveMania Paige Voice performance Straight-to-DVD Television Year Title Role Notes 2012 The Wrestlers: Fighting With My Family Herself Documentary 2015 WWE Tough Enough Judge Season 6 2015 Conan Herself Season 5, episode 155 2015–2019 Total Divas Main cast (seasons 3–6; 8) Guest (season 9) 2016 Ridiculousness Season 7, episode 12 2018–2019 Total Bellas Guest (seasons 3 & 4): 3 episodes Miz & Mrs. Episode: \"Proud Papa\" 2019 What Just Happened??! with Fred Savage Episode: \"Havenbrook\" 2019–2020 WWE Backstage Contributor 2023 AEW All Access Main cast ==Championships== *All Elite Wrestling **AEW Women's World Championship (1 time) **AEW Women's World Championship Qualifier Tournament (2023) *German Stampede Wrestling **GSW Ladies Championship (1 time) *Herts & Essex Wrestling **HEW Women's Championship (2 times) *Premier Wrestling Federation **PWF Ladies Tag Team Championship (1 time) (with Sweet Saraya) *Pro-Wrestling: EVE **Pro-Wrestling: EVE Championship (1 time, first) *Pro Wrestling Illustrated **She was ranked #1 of the top 50 female wrestlers in the PWI Female 50 in 2014, and #2 in 2015 *Real Deal Wrestling **RDW Women's Championship (1 time) *Real Quality Wrestling **RQW Women's Championship (1 time) *Swiss Championship Wrestling **SCW Ladies Championship (1 time) *World Association of Women's Wrestling **WAWW British Tag Team Championship (1 time) (with Melodi) **WAWW Ladies Hardcore Championship (1 time) **WAWW British Ladies Championship (1 time) *WWE **WWE Divas Championship (two times) **NXT Women's Championship (one time, first) **NXT Women's Championship Tournament (2013) ** WWE Year-End Award (1 time) *** General Manager of the Year (2018) ==References== ==Other websites== * * * * Category:1992 births Category:All Elite Wrestling alumni Category:Living people Category:English professional wrestlers Category:Female professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling authority figures Category:Sportspeople from Norwich Category:Twitch (service) streamers",
 "title": "Paige (wrestler)"
}