{
 "id": "44611",
 "text": "The Brixton riot of 11 April 1981 was the biggest of three riots in Brixton, London, and the biggest riot in London. ==Brixton before the riots== Brixton in south London was a very poor inner-city area with many problems — high unemployment, much crime, bad housing. Many black people, mostly of Caribbean origin, lived there. Many people there disliked the police. ==The evening of April 10== The riot was unplanned. On the evening of the 10th, at around 5.15pm, a black boy with a knife wound was stopped by police. As he was brought to a police car by two policemen along Railton Road a large crowd attacked the police and the fight only ended when more policemen arrived; the youth was taken to hospital. ==The night of April 10 and 11== Through the night of the 10th and on the 11th the police brought many officers into the area. Throughout the day crowds slowly got together. In early evening, as the police tried to make some arrests on Atlantic Road, the riots started: a few bricks were thrown and windows smashed. More police came and more things were thrown. The police retreated, leaving their cars to be burned. Other cars were burned and things were stolen from shops on Railton Road, Mayall Road, Leeson Road and Brixton Road before the police came back. The police closed the Atlantic-Railton-Mayall area to the public, although many other streets had groups of rioting people as well. The rioters started throwing with bricks, bottles, and Molotov cocktails. Cars and buildings were burned and fire engines attacked as they tried to stop the flames. The riot was at its peak at around 8pm, with two public houses, schools and other buildings burning. Two hours later the police had the area under some control, although the fire brigade returned at the next morning only. By 1am the area was largely under control, with no large crowds – except the police – on the streets. There were tries to start violence again on the 12th, but they were stopped by more than 1,000 police on the streets. ==After the riots== The riot was followed by almost 300 police injuries and 65 bad civilian injuries; over 100 cars were burned, including 56 police cars; almost 150 buildings were damaged, with thirty burned. There were 82 arrests. Between 3 and 11 July of that year, there were more riots in England. There were riots in Handsworth, Southall, Toxteth, and Moss Side. There were also smaller pockets of unrest in Leeds, Leicester, Southampton, Halifax, Bedford, Gloucester, Coventry, Bristol, and Edinburgh. ==Brixton riots in the media== The riots inspired the Eddy Grant song, \"Electric Avenue.\" The Clash also made a song about Brixton, \"The Guns of Brixton.\" This song came out before the riots of 1981 (The album was sold first in 1979), but it describes the general atmosphere in the area. Category:1981 crimes Category:1981 in the United Kingdom Category:1980s crimes in the United Kingdom Category:1980s fires Category:1980s in London Category:1980s riots Category:Arson Category:Attacks on buildings and structures in London Category:Attacks on buildings and structures in the 1980s Category:Building and structure fires in the United Kingdom Category:Fires in London Category:Riots in England Category:1980s disasters in the United Kingdom Category:Brixton",
 "title": "1981 Brixton riot"
}