{
 "id": "446654",
 "text": "Eugene Nicholas \"Gene\" Kiniski (November 23, 1928 – April 14, 2010) was a Canadian professional wrestler and actor. He became one of the first World Champions in professional wrestling to have a former background in football, after Bronko Nagurski. Kiniski is best known for his time in many different NWA-owned territories where he won multiple championships. Before starting his wrestling career, Kiniski played football with the Edmonton Eskimos of the Canadian Football League (CFL). On his team, Kiniski was joined by future professional wrestlers Wilbur Snyder and Joe Blanchard. Al Oeming and Stu Hart were at the Eskimos training camp when Kiniski was trying out for the team.National Wrestling Alliance, The Untold Story of the Monopoly that Strangled Pro Wrestling, p. 212, Tim Hornbaker, ECW Press, 2007, Kiniski had a lengthy stint in the World Wide Wrestling Federation (WWWF) in 1964. During his time in the WWWF, Kiniski had matches against Bruno Sammartino and they had a match at Madison Square Garden on November 16, 1964. After he Kiniski thought he had pinned Sammartino on the second fall, he took the championship and left. He was counted out be kept the championship until they had a rematch on December 14. On April 4, 2010, Jim Ross announced on his blog that Kiniski had \"taken a turn for the worse and is battling to stay alive. 'Big Thunder's' cancer has spread to his brain and some speculate that is just a matter of time (before he dies)\" Kiniski died on April 14, 2010 in Blaine, Washington. ==Championships== *American Wrestling Association **AWA United States Heavyweight Championship (two times) **AWA World Heavyweight Championship (one time) **AWA World Tag Team Championship (two times) (with Hard Boiled Haggerty) *Cauliflower Alley Club **Other honoree (1992) *Japan Wrestling Association **JWA All Asia Tag Team Championship (one time) (with Caripus Hurricane) **NWA International Heavyweight Championship (one time) *Maple Leaf Wrestling **NWA British Empire Heavyweight Championship (Toronto version) (two times) **NWA Canadian Open Tag Team Championship (two times) (with Fritz Von Erich (one) and Don Leo Jonathan (one)) *Montreal Athletic Commission **MAC International Heavyweight Championship (one time) *NWA: All-Star Wrestling **NWA British Empire Heavyweight Championship (Vancouver version) (two times) **NWA Canadian Tag Team Championship (Vancouver version) (ten times) (with Mr. X (two), Don Leo Jonathan (one), Bob Brown (two), The Brute (one), Dutch Savage (one), Mr. Saito (one), Dale Lewis (one), and Siegfried Steinke (one)) **NWA Pacific Coast Heavyweight Championship (Vancouver Version) (seven times) **NWA Pacific Coast Tag Team Championship (Vancouver Version) (three times) (with Killer Kowalski (one) and Hard Boiled Haggerty (two)) *NWA Chicago **NWA World Tag Team Championship (Chicago Version) (one time) (with Dick Afflis) *NWA Los Angeles **NWA Los Angeles International Television Tag Team Championship (one time) (with John Tolos) *NWA Mid-Pacific Promotions **NWA Hawaii Heavyweight Championship (two times) **NWA North American Heavyweight Championship (Hawaii Version) (three times) **NWA Hawaii Tag Team Championship (one time) (with Lord James Blears) *NWA San Francisco **NWA World Tag Team Championship (San Francisco version) (three times) (with Lord James Blears) *NWA Western States Sports **NWA International Heavyweight Championship (Amarillo version) (one time) *Professional Wrestling Hall of Fame **Class of 2008 *Southwest Sports, Inc. **NWA Texas Heavyweight Championship (one time) **NWA Texas Tag Team Championship (one time) (with Len Crosby) *St. Louis Wrestling Club **NWA Missouri Heavyweight Championship (one time) **NWA World Heavyweight Championship (one time) *World Wrestling Association **WWA World Heavyweight Championship (one time) *World Wide Wrestling Federation **WWWF United States Tag Team Championship (one time) (with Waldo Von Erich) *St. Louis Wrestling Hall of Fame **(Class of 2007) *National Wrestling Alliance **NWA Hall of Fame (Class of 2009) *Wrestling Observer Newsletter awards **Wrestling Observer Newsletter Hall of Fame (Class of 1996) ==References== Category:1928 births Category:2010 deaths Category:Canadian movie actors Category:Canadian professional wrestlers Category:Cancer deaths in Washington (state) Category:Deaths from brain cancer Category:Edmonton Elks players Category:Former WWE wrestlers Category:Sportspeople from Edmonton",
 "title": "Gene Kiniski"
}