{
 "id": "446799",
 "text": "Mixels is a American animated television series that aired on Cartoon Network and was co-produced by The Lego Group and Cartoon Network Studios. The series first aired on February 12, 2014, with a new episode of Teen Titans Go! entitled \"Be Mine\". The series revolves around the eponymous creatures known as Mixels, small colorful creatures that can mix and combine with one another. The Mixels are opposed by the evil Nixels, small, discolored and evil creatures led by King Nixel. Although previous Lego series, such as Lego Ninjago and Lego Legends of Chima, use CGI animation, Mixels made use of Toon Boom Harmony software, animated at Atomic Cartoons, Inc., before later being animated traditionally at Digital eMation, Inc., Big Star Entertainment, Inc., and Saerom Animation, Inc. A mobile app was released for the series on March 4, 2014, named Calling All Mixels, and even earlier two websites, one on the LEGO website and another owned by Cartoon Network, were launched where fans can learn about the Mixels. Nine series of collectible Lego building toys were also released, based on the characters. On February 19, 2014, the series had begun airing as an interstitial program on Boomerang, and still currently airs as such. The TV series wrapped up production in July 2016, and the series finale aired on October 1, 2016, marking the end of the franchise, with bar references in Uncle Grandpa and The Lego Movie 2: The Second Part. == Premise == Mixels consists of 24 tribes who each have a different color scheme and inhabit a fantasy landscape. These creatures can Mix (a two-Mixel combination), Max (a three-Mixel combination and the tribe's own one), and Murp (a failed Mix) in all kinds of situations, using items called cubits, which inhabit the Mixels. ==Characters== === Mixels === Mixels are fictional creatures who consists of many different, fun-loving tribes who each have a different color scheme. It is noted that American voice actors play Gox (Chris Cox), Camillot (Jeff Bennett), Jinky (Jeff Bennett), Mixadel (Richard Steven Horvitz), and King Mixelot (Dave Fennoy), who are all British-accented characters. ==== Series 1 ==== ===== Infernites ===== Based on fire, the Infernites are the red primary tribe of Series 1. They live in the ‘Magma Wastelands’ near the center of ‘Mixel Land’. * Flain (voiced by Tom Kenny) − Flain is the leader of the tribe called the ‘Infernites’, along with the other Mixels. Flain is adventurous and smart because he is known to his friends as ‘the smart one’. His head is on fire. When he thinks deeply or gets angry, his head runs the risk of catching on fire, so he tries to stay calm. * Vulk (voiced by Jess Harnell) − Vulk is a one-eyed Mixel who is dimwitted but liked by his friends. Among his looks is how he is one of many cyclopses. His superheated hands can melt through solid rocks and the ‘Nixels’, however he may inadvertently hurt other Mixels with those hands, which make another Mixels not want to have high-fives or anything else with him. * Zorch (voiced by David P. Smith) − Zorch is an Infernite who has fiery jets that let him \"run around with surprising speed\". He is a \"crazy prankster\", but well liked by his friends of whom he sometimes plays pranks on. His fiery jets from his rear leave the Nixels standing in a smoke cloud. ===== Cragsters ===== Based on rock, the Cragsters are the secondary tribe of Series 1. They live in tunnels that they have dug deep under the surface of Mixel Land. * Krader (voiced by David P. Smith) − Krader is a super-strong and tough Mixel with a short temper. Roughly considered the Cragsters' leader, he has a rotating torso and massive hand, which can fold into a demolition ball, allowing him to bulldoze through rocks and dig deep pits to trap the Nixels. * Seismo (voiced by Tom Kenny) − Seismo is a lanky and shy Mixel who can cause earthquakes with his unusually massive feet; he uses this ability as a weapon against the Nixels. * Shuff (voiced by Jess Harnell) − Shuff is helpful and friendly, but very clumsy. His body is like \"a living wrecking ball\", and he accidentally destroys everything with it. ===== Electroids ===== Based on electricity, the Electroids are the yellow tertiary tribe of Series 1. They live in the Mountain Forest and stay as close as possible to the lightning storms that energize them. * Teslo (voiced by Tom Kenny) − Teslo is the leader of the Electroids. He fights with his electrically charged tail. While usually level- headed, he has an open secret fear of heights. He is one of many cyclopses. * Zaptor (voiced by Jess Harnell) − Zaptor is energetic and thrives on action. He is capable of releasing massive blasts of energy and blinding light, but overuses his ability, much to the chagrin of the other Mixels. * Volectro (voiced by David P. Smith) − Volectro stores electricity in his hair. When overloaded with electricity, he can draw objects to himself with static electricity that charges his hair. ==== Series 2 ==== ===== Frosticons ===== Based on ice, the Frosticons are the blue secondary tribe of Series 2. They live near the crystalized shells of dead volcanoes. * Flurr (voiced by Phil LaMarr) − Flurr is the leader of the Frosticons. Flurr is the only Frosticon who never feels sleepy and likes to fly around and explore Frosticon lands. He is good at spotting Nixels that are invaded far away, but sometimes misses obvious things. * Slumbo (voiced by Fred Tatasciore) − Slumbo is the sleepiest Frosticon. It takes an earthquake to wake him up, but when he is awake, he has the power to move giant objects and create obstacles for the Nixels. Slumbo can brain-freeze the Mixels from making ice tunnels. * Lunk (voiced by Billy West) − An unbelievably slow Frosticon, Lunk makes the other Frosticons seem positively energetic. He is not the brainiest or the most graceful when waddling across ice and balancing on his stubby hands, but his thick ice exoskeleton makes him incredibly durable. When he is sneezing, he can instantly freeze a Nixel in an ice cube. ===== Fang Gang ===== Based on eating and wood, the Fang Gang are the brown primary tribe of Series 2. They live on a farm. * Gobba (voiced by Billy West) − Gobba is the bite-loving leader of the Fang Gang who can use his sensitive, whiplike tongue to seek out food on his homeland, a farm. He is the best taster of feelings among the Fang Gang, carving totem poles. * Jawg (voiced by Fred Tatasciore) − Jawg is a character who protects his friends by using his indestructible teeth. He is a dog who can speak, and will not hesitate to bite intruders with his teeth. * Chomly (voiced by Phil LaMarr) − Chomly is the lazy trash compactor of the Fang Gang who will try to crunch just about anything not nailed down. Chomly is close- talking and has incredibly bad breath. This makes no Mixel wanting to be stuck next to Chomly at a 'Fang Gang food party', but his stinking breath comes in handy for repelling the Nixels. ===== Flexers ===== Based on rubber, the Flexers are the orange tertiary tribe of Series 2. They live in the Rubberlands, in line with what they are based on. * Kraw (voiced by Fred Tatasciore) − Kraw might be short, but he is one confident character. Claiming to be the smartest Mixel, he loves to challenge the Mixels to a quiz, but his main strength is to turn into a bouncy, rubber super ball to evade or smash Nixels. He is one of many cyclopses. * Tentro (voiced by Phil LaMarr) − The incredibly elasticated Tentro is one of the most powerful of the Flexers. Despite being strong and super intelligent, he lacks confidence. No one knows why, though, because he has tentacles that pack a huge punch and the ability to climb any surface and capture any Nixel who attacks him. * Balk (voiced by Billy West) − Balk may be the slowest of the Flexers, but his mallet-like head can hit, pummel, and crush whatever is in the way. His head-butting has bashed his brain cells, so he can be forgetful when finding it hard to spit out the right words, yet there is nobody better than him to defend the Rubberlands, where the Flexers themselves live, from Nixel Invasions. ==== Series 3 ==== ===== Glorp Corp ===== Based on slime, the Glorp Corp are the green primary tribe of Series 3. They are swamp-dwelling thrill-seekers. * Glomp (voiced by Maddie Taylor) − Glomp is the leader of the Glorp Corp. He always \"hatches hair-brained schemes\" and plays goofy games, making him have lots of fun. Mixels will not get too close: the tallest Glorp Corp member usually has slimy hands and a runny nose. He is one of many cyclopses. * Glurt (voiced by Bumper Robinson) − Glurt is a slimy hound-like creature who is the most excitable member of the Glorp Corp. With a pointy tail and a yapping mouth, he slobbers with delight when he sees anyone. An avid garbage collector, he gobbles up all the trash, cleaning up after the Glorp Corp. * Torts (voiced by Carlos Alazraqui) − Torts has bulky feet and is the slowest-moving member of the Glorp Corp. A slob who enjoys playing for thrills, he shoots gloopy, green slime from his hands. Anything can stick to him, which is great fun when goofing around and perfect for catching Nixels. ===== Spikels ===== Based on spikes, the Spikels are the tertiary tribe of Series 3. They live in a feminine-like home. * Scorpi (voiced by Maria Bamford) − The leader of the Spikels, Scorpi loves bedtime-esque things. He always sees life with wonder and scuttles around on his centipede-like legs when seeking fun. He loves to hug and snuggle, but beware of his dangerous, pointy tail. * Footi (voiced by Bumper Robinson) − \"Livewire\" Footi can't stop moving at all. Everyday's moment always bursts with exciting possibilities for him. He loves to skip, jump, and dance. The other Mixels must give him plenty of room when he starts stomping around; his huge, spiky feet are dangerous, so Mixels must watch out. He is characterized as feminine due to his voice. * Hoogi (voiced by Maddie Taylor) − Hoogi is the slowest-moving of the Spikels. He has giant fang teeth and is also super affectionate, giving the Mixels the best hugs with his lanky arms. He walks as slowly as a zombie, but getting grabbed by his spiky hands can be painful: Mixels may want to avoid one of his hugs. ===== Wiztastics ===== Based on magic, the Wiztastics are a purple traveling troupe of magicians and the secondary tribe of Series 3. They live in a magic tent and put on shows for the Mixels. * Magnifo (voiced by Brian Stepanek) − Magnifo is the most smart and most serious of the Wiztastics. With a wizard's hat, a wizard's cape, and two magic wands, he puts energy into every show with the help of his bumbling assistants. Even if the Mixels think his act is cheesy, they shouldn't tell him or the rest of the Wiztastics; they love it. He is one of many cyclopses. * Mesmo (voiced by Carlos Alazraqui) − Mesmo looks the part of magic with his expressive wizard-hat eyelids, goatee beard, and magic tail that drops spells. But his problem is that he lacks in showmanship; Mesmo needs help peacocking his huge wings and stealing the show. * Wizwuz (voiced by Bumper Robinson) − Wizwuz is the over-enthusiastic magician's assistant of the Wiztastics. On stage, he constantly messes up the show, but his improvised antics are half the fun. Whether burping spells or hanging from the ceiling, Wizwuz loves to perform and make the audience laugh. ==== Series 4 ==== ===== Orbitons ===== Based on space, the Orbitons are the secondary tribe of Series 4. They live in Orbitopia of the Mixel Moon. * Niksput (voiced by Andrew Kishino) − The leader of the Orbitons, Niksput is charismatic but unintelligent, and often pretends to be smarter and braver than he actually is. He can fly at high speeds, but often crashes due to his lack of skill. He is Also one of many cyclopses. * Nurp-Naut (voiced by Justin Grollman for Nurp and Rodger Bumpass for Naut) − Nurp-Naut has two personalities : Nurp is playful and childlike, and Naut is serious and mature. These personalities are aware of each other and even communicate with each other. Whenever his personality changes his head spins rapidly. Naut is also one of many cyclopses. * Rokit (voiced by Phil Hayes) − Rokit is incredibly serious. Whenever he does something, he puts his full effort into it. He is often frustrated about the other Oritons' lack of discipline. ===== Infernite Cousins ===== Based on fire, the Infernite Cousins are the primary tribe of Series 4. They, like the Infernites, live in the Magma Wastelands near the center of Mixel Land. * Meltus (voiced by Jess Harnell) − Meltus may look scary, but he is really a shy and nervous Infernite who is allergic to everything. Even when he walks outside, he starts sneezing fire. * Flamzer (voiced by Rodger Bumpass) − Dramatic and anxious, he can move quickly, like a scaredy-cat. He is one of many cyclopses. * Burnard (voiced by Jess Harnell) − Everything is funny to Burnard. He laughs a lot; he even laughs through fear and sadness. Even if he laughs hard enough, he spews fire. However, the only way to make him stop laughing is by telling him a funny joke whose punchline he does not get. ===== Glowkies ===== Based on bioluminescence, the Glowkies are the tertiary tribe of Series 4. They live in a cave on the Mixel Moon. * Globert (voiced by Dave Fennoy) − Globert is flamboyant, and loves to perform. He is one of many cyclopses with their largest eye. * Vampos (voiced by Sam Riegel) − Vampos is the athletic member of the Glowkies. Although he loves sports, he is considered very relaxed and calm. * Boogly (voiced by Dave Fennoy) − Boogly is snobbish, and complains about almost everything. He is one of many cyclopses. ==== Series 5 ==== ===== Klinkers ===== * Gox (voiced by Chris Cox) − Gox is almost like a tycoon from the Steam Age. * Jinky (voiced by Jeff Bennett) − Jinky is an old heavy metal star in the form of a walking boiler-room. * Kamzo (voiced by Steve Blum) − A moody dumpster-dweller, Kamzo is only happy when going on a mechanical mission. ===== Frosticon Cousins ===== The second part of the Frosticons. * Krog (voiced by Dave Fennoy) − A living garbage disposal, he can chomp through anything. * Chilbo (voiced by Griffin Burns) − Chilbo is a know-it-all who is always ready to explain everything obvious in relentless detail. * Snoof (voiced by Daran Norris) − Snoof is a bright-eyed bumpkin who has a naive fascination, with his world around him. ===== Lixers ===== Yellow Mixels who always like to lick things. * Spugg (voiced by Daran Norris) − Super-curious and alert, he has a rotating head that keeps an eye on everything around him. * Turg (voiced by Peter Jason) − Turg looks like an experiment gone wrong and is part frog, part chicken, and part unknown. He has an extra long tongue. * Tungster (voiced by Tom Kenny) − His tongue is really long and slightly bigger than Turg's. ==== Series 6 ==== ===== Weldos ===== Based on the construction workers. * Kramm (voiced by Dave Fennoy) − He has a jackhammer for a hand. * Forx (voiced by Chris Cox) − His jaw is like a bucket and he his eyebrows look like horns. * Wuzzo (voiced by Peter Jason) − His nose is shaped like a chainsaw. ===== Glorp Corp Cousins ===== The second version of the Glorp Corp. * Dribbal (voiced by Jeff Bennett) − A smart leader of the Glorp Corp Cousins. He has glasses. * Gurggle (voiced by Jeff Bennett) − A taller member of the tribe who has long slimy legs. * Slusho (voiced by Griffin Burns) − A flying member of the tribe who has sneezing powers. ===== Munchos ===== Purple Mixels who always eat things. * Snax (voiced by Griffin Burns) − He has big cheeks with which he looks like he's chewing. * Berp (voiced by Tom Kenny) − He has several arms which he can use to serve food and his mouth looks like a bucket. * Vaka-Waka (voiced by Jess Harnell for Vaka and Daran Norris for Waka) − Vaka-Waka is conjoined: he is two Mixels in one! ==== Series 7 ==== ===== Mixopolis City Police Department (MCPD) ===== Mixels that are based on police officers. * Kuffs (voiced by Phil Hayes, later by Steve Blum) − He has handcuffs which he can use to arrest people. * Busto (voiced by Chris Cox) − Like a living jail cell which he can use to bust others. * Tiketz (voiced by Daran Norris) − A living motorcycle-like character who can ride and take tickets from others. ===== Medivals ===== Medieval related Mixels. * Camillot (voiced by Jeff Bennett) − A living castle with a cannon like a nose. * Mixadel (voiced by Richard Steven Horvitz) − A living catapult who can shoot rocks. * Paladum (voiced by Eric Bauza) − A flying Medival. ===== Mixies ===== Yellow Mixels that are related to musicians. * Jamzy (voiced by Cree Summer) − A living guitar. * Tapsy − A living drum set who can tap himself. * Trumpsy − A living trumpet who can play trumpet noises through his mouth. ==== Series 8 ==== ===== Mixopolis City Fire Department (MCFD) ===== Mixels who work as firefighters. * Splasho (voiced by Richard Steven Horvitz) − His neck is shaped like a ladder which he can use to climb. * Aquad (voiced by Steve Blum) − A sliding Mixel who can shoot water from the sides of his body. * Hydro (voiced by Jess Harnell) − A living fire hydrant who can also shoot water out of his mouth. ===== Pyrratz ===== Pirate related Mixels. * Sharx (voiced by Peter Jason) − His head is like a shark. * Skulzy − He has a skull as a head and wears an eye patch in front of which he hides and stores some loot. * Lewt − A living treasure chest full of loot. ===== Medix ===== Mixels who are related to doctors. * Surgeo (voiced by Jess Harnell) − He is like a surgeon. * Skrubz − His head looks like a light stand and his hands both have defibrillation paddles. * Tuth (voiced by Peter Jason) − He is related to a dentist. He looks like a big tooth who wears a blue bow tie and has a toothbrush instead of one arm. ==== Series 9 ==== ===== Trashoz ===== Mixels who are like garbage collectors. * Gobbol − He is like a living dumpster. He can eat garbage. * Sweepz − He has brushes for hands which he can use to sweep things. * Compax − He is a living garbage truck. He can pick up garbage and later compact them somewhere. ===== Nindjas ===== Ninja-like Mixels. * Mysto (voiced by Tom Kenny) − A wise master of the Nindjas. * Cobrax (voiced by Leonard Garner) − A cobra-like Nindja. * Spinza (voiced by Steve Blum) − He has spinning powers. ===== Newzers ===== Mixels who are like news reporters. * Screeno (voiced by Tom Kenny) − He is like a living TV and his head is like a screen. * Camsta (voiced by Gregg Bissonette) − A camera-like Newzer who can fly. * Myke (voiced by Gregg Bissonette) − He mostly uses a microphone. === Other characters === ==== Nixels ==== Nixels are evil creatures, unlike the Mixels. These include: * The species in general (all voiced by Fred Tatasciore) − The main villains of the series, Nixels are annoying and destructive little creatures who are spread all over the land of the Mixels. They live to tear down and break apart the world around them, including any combinations that the Mixels create. When they swarm together, they break apart a Mixel in seconds. They used to only say \"nix\", but they later say more wording. * Major Nixel (voiced by Fred Tatasciore, later by Rodger Bumpass, and afterward Peter Jason) − Major Nixel is the Nixels' military leader. He is the only Nixel capable of speech and is abusive towards his underlings. He resembles a war general with a mustache. He is also the only Nixel without being in a Lego set. * King Nixel (voiced by Phil Hayes, later by Steve Blum) − King Nixel is the true leader of the Nixels. ==== Mixamals ==== * Amphipod (voiced by Daran Norris) − * Mixapod (voiced by Eric Bauza) − * Mixeloptors (all voiced by Michael Winslow) − * Mixie Cat (voiced by Richard Steven Horvitz) − ==== Mixels ==== In addition to the original Mixels, there are other Mixels who don't have a Lego set. These include: * Scrud (voiced by Richard Steven Horvitz) − He is a Frosticon. * Narrator (voiced by Rodger Bumpass) − He is a Frosticon. * Teacher (voiced by Cree Summer) − She is a Flexer, and is the only female character. * Booger (voiced by Tom Kenny) − He is a member of the Glorp Corp. * Blip (voiced by Tom Kenny) − He is a Spikel. * Ranger Jinx (voiced by Jeff Bennett) − He is a Spikel. * Gate Keeper (voiced by Rodger Bumpass) − He is a Spikel. * Principal Knave (voiced by Chris Cox) − He is a Klinker. * Referee (voiced by Phil Hayes) − He is a Muncho. * Zabo (voiced by Jess Harnell) − He is a Muncho. * Sergeant (voiced by Dave Fennoy) − He is part of the MCPD. * King Mixelot (voiced by Dave Fennoy) − He is a Medival. * Fire Chief (voiced by Peter Jason) − He is part of the MCFD. ==Episodes== ===Series overview=== ===Season 1 (2014)=== No. in series No. in season Title Written and storyboarded by Original air date Production code ===Season 2 (2015–16)=== No. in series No. in season Title Written and storyboarded by Original air date Production code ====Series 1==== Series 1 was released on March 1, 2014, and consists of the tribes the Infernites, the Cragsters, and the Electroids. Tribe Reference Name Released Notes Infernite 41500 Flain March 1, 2014 58 pieces Infernite 41501 Vulk and Nixel March 1, 2014 69 pieces Infernite 41502 Zorch March 1, 2014 45 pieces Cragster 41503 Krader and Nixel March 1, 2014 66 pieces Cragster 41504 Seismo March 1, 2014 50 pieces Cragster 41505 Shuff March 1, 2014 51 pieces Electroid 41506 Teslo and Nixel March 1, 2014 54 pieces Electroid 41507 Zaptor March 1, 2014 61 pieces Electroid 41508 Volectro March 1, 2014 70 pieces =====Series 2===== Series 2 was released on June 1, 2014, and consists of the tribes the Frosticons, the Fang Gang, and the Flexers. Tribe Reference Name Released Notes Frosticon 41509 Slumbo and Nixel June 1, 2014 61 pieces Frosticon 41510 Lunk June 1, 2014 51 pieces Frosticon 41511 Flurr June 1, 2014 46 pieces 41512 Chomly and Nixel June 1, 2014 68 pieces 41513 Gobba June 1, 2014 57 pieces 41514 Jawg June 1, 2014 61 pieces Flexer 41515 Kraw June 1, 2014 70 pieces Flexer 41516 Tentro June 1, 2014 69 pieces Flexer 41517 Balk and Nixel June 1, 2014 68 pieces =====Series 3===== Series 3 was released on September 1, 2014, and consists of the tribes the Glorp Corp, the Spikels, and the Wiztastics. Tribe Reference Name Released Notes Glorp Corp 41518 Glomp September 1, 2014 64 pieces Glorp Corp 41519 Glurt and Nixel September 1, 2014 62 pieces Glorp Corp 41520 Torts September 1, 2014 48 pieces Spikel 41521 Footi September 1, 2014 72 pieces Spikel 41522 Scorpi September 1, 2014 70 pieces Spikel 41523 Hoogi and Nixel September 1, 2014 69 pieces 41524 Mesmo September 1, 2014 64 pieces 41525 Magnifo and Nixel September 1, 2014 61 pieces 41526 Wizwuz September 1, 2014 70 pieces =====Series 4===== Series 4 was released on February 1, 2015, and consists of the tribes the Orbitons, the Infernite Cousins, and the Glowkies. Tribe Reference Name Released Notes Orbiton 41527 Rokit and Nixel February 1, 2015 66 pieces Orbiton 41528 Niksput February 1, 2015 62 pieces Orbiton 41529 Nurp-Naut February 1, 2015 52 pieces Infernite Cousin 41530 Meltus February 1, 2015 66 pieces Infernite Cousin 41531 Flamzer and Nixel February 1, 2015 60 pieces Infernite Cousin 41532 Burnard February 1, 2015 58 pieces 41533 Globert February 1, 2015 45 pieces 41534 Vampos and Nixel February 1, 2015 59 pieces 41535 Boogly February 1, 2015 52 pieces =====Series 5===== Series 5 was released on June 1, 2015, and consists of the tribes the Klinkers, the Frosticon Cousins, and the Lixers. Tribe Reference Name Released Notes Klinker 41536 Gox and Nixel June 1, 2015 62 pieces Klinker 41537 Jinky June 1, 2015 59 pieces Klinker 41538 Kamzo June 1, 2015 58 pieces Frosticon Cousin 41539 Krog and Nixel June 1, 2015 60 pieces Frosticon Cousin 41540 Chilbo June 1, 2015 65 pieces Frosticon Cousin 41541 Snoof June 1, 2015 52 pieces Lixer 41542 Spugg June 1, 2015 51 pieces Lixer 41543 Turg and Nixel June 1, 2015 56 pieces Lixer 41544 Tungster June 1, 2015 60 pieces =====Series 6===== Series 6 was released on October 1, 2015, and consists of the tribes the Weldos, the Glorp Corp Cousins, and the Munchos. Tribe Reference Name Released Notes Weldo 41545 Kramm October 1, 2015 68 pieces Weldo 41546 Forx October 1, 2015 65 pieces Weldo 41547 Wuzzo and King Nixel October 1, 2015 74 pieces Glorp Corp Cousin 41548 Dribbal October 1, 2015 52 pieces Glorp Corp Cousin 41549 Gurggle and Cubit October 1, 2015 66 pieces Glorp Corp Cousin 41550 Slusho and Nixel October 1, 2015 53 pieces Muncho 41551 Snax October 1, 2015 51 pieces Muncho 41552 Berp and Nixel October 1, 2015 68 pieces Muncho 41553 Vaka-Waka October 1, 2015 69 pieces ===== Series 7 ===== Series 7 was released on February 1, 2016, and consists of the tribes the MCPD (Mixopolis City Police Department), the Medivals, and the Mixies. Tribe Reference Name Released Notes 41554 Kuffs February 1, 2016 63 pieces 41555 Busto and Nixel February 1, 2016 69 pieces 41556 Tiketz February 1, 2016 62 pieces Medival 41557 Camillot February 1, 2016 64 pieces Medival 41558 Mixadel February 1, 2016 63 pieces Medival 41559 Paladum and Nixel February 1, 2016 64 pieces Mixie 41560 Jamzy and Nixel February 1, 2016 70 pieces Mixie 41561 Tapsy February 1, 2016 57 pieces Mixie 41562 Trumpsy February 1, 2016 54 pieces ===== Series 8 ===== Series 8 was released on June 1, 2016, and consists of the tribes the MCFD (Mixopolis City Fire Department), the Pyrratz, and the Medix. Tribe Reference Name Released Notes MCFD 41563 Splasho June 1, 2016 67 pieces MCFD 41564 Aquad June 1, 2016 70 pieces MCFD 41565 Hydro and Nixel June 1, 2016 70 pieces 41566 Sharx June 1, 2016 55 pieces 41567 Skulzy and Nixel June 1, 2016 66 pieces 41568 Lewt June 1, 2016 62 pieces Medix 41569 Surgeo June 1, 2016 63 pieces Medix 41570 Skrubz and Nixel June 1, 2016 68 pieces Medix 41571 Tuth June 1, 2016 67 pieces =====Series 9===== Series 9–the final series of the line–was released on October 1, 2016, and consists of the tribes the Trashoz, the Nindjas, and the Newzers. Tribe Reference Name Released Notes 41572 Gobbol and Nixel October 1, 2016 62 pieces 41573 Sweepz October 1, 2016 61 pieces 41574 Compax October 1, 2016 66 pieces 41575 Cobrax and Nixel October 1, 2016 64 pieces 41576 Spinza October 1, 2016 60 pieces 41577 Mysto October 1, 2016 64 pieces 41578 Screeno October 1, 2016 73 pieces 41579 Camsta and Nixel October 1, 2016 62 pieces 41580 Myke October 1, 2016 63 pieces ==Discontinuation== Shortly after Cartoon Network announced that the episode \"Nixel Nixel Go Away\" will be the series finale, The Lego Group cancelled production of the toy line. As a result, the theme was discontinued. ==References== Category:Cartoon Network series Category:English-language television programs Category:2014 American television series debuts Category:2016 American television series endings",
 "title": "Mixels"
}