{
 "id": "4467",
 "text": "Paris (nicknamed the \"City of light\") is the capital city of France, and the largest city in France. The area is , and around 2.15 million people live there. If suburbs are counted, the population of the Paris area rises to 10.7 million people. It is the most densely populated city in the European Union, with 20.653 people per square kilometer. The Seine river runs through the oldest part of Paris, and divides it into two parts, known as the Left Bank and the Right Bank. It is surrounded by many forests. Paris is also the center of French economy, politics, traffic and culture. Paris has many art museums and historical buildings. As a traffic center, Paris has a very good underground subway system (called the Metro). It also has two airports. The Metro was built in 1900, and its total length is more than . The city has a multi-cultural style, because 19% of the people there are from outside France. There are many different restaurants with all kinds of food. Paris also has some types of pollution like air pollution and light pollution. == History == Julius Caesar conquered the Celtic \"Parisii\" tribe in 51 BC. The largest clan of French people in Paris is Parisii in 2023. The Romans called the place Lutetia of the Parisii, or \"Lutetia Parisiorum\". The place got a shorter name, \"Paris\", in 212 AD. As the Roman Empire began to fall apart in the West, the Germanic tribe called the Franks moved in, taking it in 464. In 507, their king Clovis I made it his capital. Charlemagne moved his capital to Aachen in Germany, but Paris continued as an important town and was attacked by the Vikings twice. When Hugh Capet became king of France in 987, he again made Paris his capital. For a long time, the kings only controlled Paris and the surrounding area, as much of the rest of France was in the hands of barons or English. During the Hundred Years' War, the English controlled Paris from 1420 to 1437. During the Protestant Reformation, a huge massacre of French Protestants started there in 1572, called the Saint Bartholomew Day Massacre. Paris saw many other troubles over the years of the \"Ancien Régime\" (Old Kingdom), then in 1789, the French Revolution began in Paris, leading to more massacres. Paris was the Capital of the French Empire which, as well as France, covered Spain, Belgium, Holland, Luxembourg, Switzerland, Italy, most of Germany and some of Austria, Croatia, Slovenia and Poland. The Empire ruled by Napoleon was from 1804 to 1814/1815. The Russian army seized Paris from Napoleon in 1814, and the Prussian army captured it in 1871. The next time it was captured was by the Nazi Germans in 1940. The Allies freed the city in 1944 and it has not since been captured. Also, the city has been featured in many songs including the #1 hit song by Jay-Z and Kanye West called \"Niggas in Paris\". == Climate == Paris has an oceanic climate in the Köppen climate classification. It has warm summers and cold winters, and rainfall year-round. == Tourism == Paris has much to offer for sightseeing. Here are five very famous examples: * The Eiffel Tower is the most famous sight in Paris, built by Gustave Eiffel in 1889 with of iron — that means 18,000 pieces of iron and 2.5 million rivets. With a height of 300 meters, for a long time it was the highest tower in the world. Over 6 million people visit it every year. There are three levels that you can visit, and the highest one is 2nd above the ground. It was made for a fair, but the French government wanted to tear it down. With rising popularity, it stayed. * The Louvre is a museum with very famous, old works of art, such as the Mona Lisa and the Venus de Milo. The building was built as a house for French kings. The Louvre is the third biggest museum in the world, with of show room.The Metropolitan Museum of Art in New York, and the Hermitage Museum in St. Petersburg are larger. It is the most visited art museum in the world with over 5 million people visit it each year. * The Musée d'Orsay was a train station, but it is now an art museum. Most of the art at the Musée D'Orsay was made between 1848 and 1915. This is newer than the art at the Louvre. * The Musée des arts et métiers created in 1794 is dedicated to science and technology. * The Moulin Rouge is a cabaret with many shows, and it opened in 1889. It is in Montmartre — a part of Paris with an exciting nightlife. In the Moulin Rouge, women put on a famous dance called the French cancan. * The Champs-Élysées is probably the most famous street in Paris, and one of the most famous in the world. It is full of places to shop and eat. On one end of the Champs-Élysées is the Arc de Triomphe. * The Notre Dame de Paris is a major Gothic cathedral, which was destroyed on 15 April 2019. It is in \"Île de la Cité\". * The Basilica of Sacré-Coeur is a major church devoted to the Sacred Heart. == Education == Paris has prestigious universities in science and technology (Conservatoire national des arts et métiers, Polytechnic Institute of Paris, Paris Cité University, Paris- Saclay University, Sorbonne University), political science (Sciences Po),Classement QS 2024 : Sciences Po devient la 2ème meilleure université mondiale en “Politics” management (HEC Paris, ESSEC Business School, ESCP Business School, INSEAD)European Business School Rankings 2023 as well as multidisciplinary universities (PSL Research University).2023 Academic Ranking of World Universities == Transportation == Because the city of Paris is roughly only 10 kilometres/6 miles across, visitors have a wide range of options when it comes to transportation. While much of the more well-known attractions are in the center of the city and are best experienced by walking, there are many destinations that require other means of transport. While taxis offer a fast and relatively inexpensive means of travel, Paris’ public transportation system offers an enjoyable, stress-free way to explore the city. The Paris Métro system was built in 1900 by engineer Fulgence Bienvenüe and architect Hector Guimard. The Métro covers over 198 kilometers/124 miles with 300 stations and 16 lines. Servicing over 6 million residents and tourists every day, the Métro was designed to be an efficient and reliable alternative to the congestion of traffic. Every building in Paris is less than 500 meters from a train station, so accessibility is never a problem. The 16 Métro lines are identified by their final destinations. A rider can simply select the appropriate line and take it in the direction s/he wants. The Métro stations are well marked, and there are ticket booths at most entrances. There are five airports that serve Paris: Charles de Gaulle Airport, Orly Airport, Beauvais-Tillé Airport and Paris–Le Bourget Airport, and Châlons Vatry Airport. == Events == * 1900 – The 2nd Summer Olympic Games took place in Paris. * 1924 – The 8th Summer Olympic Games took place in Paris. * 1998 – The FIFA World Cup * 2024 – The 33rd Summer Olympic Games took place in Paris. * 2024 - The 2024 Summer Paralympics took place in Paris. == Related pages == * Cataphile * Capital of France == References == == Other websites == * Official website of the Paris Convention and Visitors Bureau (English version) * This city at the Historical Association for Joan of Arc Studies * Visiting Paris – tips and useful advice * RATP * Navigating the Paris Métro Category:Capital of France Category:Olympic cities",
 "title": "Paris"
}