{
 "id": "446841",
 "text": "Sesame Workshop is a company established in 1968. It was called Children's Television Workshop (CTW) until 2000. The Workshop is an American non-profit organization for the research and production of educational children's programs. The Workshop oversaw the production of Sesame Street, a television show for pre-school children from low-income families. Two years were spent, from 1966 to 1968, researching, developing, and raising money for the new show. It was called \"one of the most important television developments of the decade\".Davis, Michael 2008. Street Gang: the complete history of Sesame Street. New York: Viking Penguin. ISBN 978-0-670-01996-0 Sesame Street was designed in 1969. Co-founder Joan Ganz Cooney said of the CTW model: \"From the beginning, we—the planners of the project—designed the show as an experimental research project with educational advisers, researchers, and television producers collaborating as equal partners\".Borgenicht, David 1998. Sesame Street unpaved. New York: Hyperion, 9. ISBN 0-7868-6460-5 She described the collaboration as an \"arranged marriage\".Cooney, Joan Ganz 2001. Foreword. In Fisch, Shalom M. and Truglio, Rosemarie T. (eds) 2001. \"G\" is for Growing: thirty years of research on children and Sesame Street. Mahweh, New Jersey: Erlbaum, xi. ISBN 0-8058-3395-1 In 2022, Hasbro acquired Sesame Workshop and Sesame Street. On July 24, 2023, Cartoon Network Studios currently went defunct, and later became a replacement of the Workshop. == Research == Cooney's proposal included using \"in-house formative research\".This means trying the programs out on real kids during the production stage. This would inform and improve production. Independent evaluations tested the show's impact on its young viewers' learning.Fisch, Shalom M. and Lewis Bernstein 2001. Formative research revealed: methodological and process issues in formative research\". In Fisch, Shalom M. and Truglio, Rosemarie T. (eds) \"G\" is for Growing: thirty years of research on children and Sesame Street. Mahweh, New Jersey: Erlbaum, 40. ISBN 0-8058-3395-1Mielke, Keith W. 2001. A review of research on the educational and social impact of Sesame Street\". In Fisch, Shalom M. and Truglio, Rosemarie T. (eds) \"G\" is for Growing: thirty years of research on children and Sesame Street. Mahweh, New Jersey: Erlbaum, 85. ISBN 0-8058-3395-1 Gerald S. Lesser and Edward L. Palmer were hired to do research for the show. Lesser and Palmer were the only scientists in the U.S. studying children and television at the time.144 They were responsible for developing a system of planning, production, and evaluation, and the interaction between television producers and educators, later called the \"CTW model\".Morrow, Robert W. 2006. Sesame Street and the reform of children's television. Baltimore, Maryland: Johns Hopkins University Press, 68. ISBN 0-8018-8230-3 68Lesser, Gerald S. 1974. Children and television: lessons from Sesame Street. New York: Vintage Books. ISBN 0-394-71448-2 == Later == After Sesame Streets initial success, the CTW began to think about its survival. Their funding sources were organizations that tended to start projects, not sustain them. Government funding ended by 1981. The CTW expanded into other areas, including the publications of books and music, international co- productions, interactive media and new technologies, licensing arrangements, and outreach programs to preschools. By 2005, income from the CTW's international co-productions of the show was $96 million. By 2008, the Sesame Street Muppets accounted for $15–17 million per year in licensing and merchandising fees. == Television shows == *Sesame Street International (1968-present) *The Electric Company (1971-2011) *Square One TV (1987-1996) *Ghostwriter (1992-1996) *Big Bag International (1996-1998) *Esme & Roy (2018-2021) == References == Category:American entertainment companies Category:Non-profit organizations of the United States Category:1968 establishments in the United States Category:Hasbro subsidiaries Category:2022 mergers and acquisitions",
 "title": "Sesame Workshop"
}