{
 "id": "447037",
 "text": "Awards for mathematics is a list of prizes for mathematicians. *Prize: It is generally dedicated to the memory of a great mathematician or philanthropist. *Organization: It may be a Mathematical Society, Foundation or State agency event sponsor. *Headquarters or convener country, which may be rotating among the members of a society. *The suffix (+) after the country indicates that foreigners are allowed to participate mathematicians. *Value of prize, usually fixed, but sometimes the contestant expenses are included. *Note Contains a comment or a series of fixed concepts: :• Number of years, age limit to appear in the competition. :• Women, when they can only participate. :• Student grant, for courses, masters or projects. :•University, you have to be linked to access to the event. :• Specialty, if the event is dedicated to only one branch of mathematics. You can choose the order of the list by clicking on the Prize, Organize, Value, etc.. Prize Organize Headquarters Value Note Breakthrough Prize in Mathematics Yuri Milner, Marc Zuckerberg Russia $3,000,000 Konex Prize Konex Argentina Premio Clodomiro Picado Twight MICIT Costa Rica ≈ $9,000 Medalla Narcís Monturiol GenCat Spain €3,000 Premio TWAS ICTP Italy + $2,000 Premio Nacional de Ciencias y Artes SEP Mexico + Bernd Aulbach Prize ISDE United States + €400 Mca Prize CIMAT UMALCA Mexico + $1,000 Americas Prize CIMAT UMALCA Mexico + $5,000 Solomon Lefschetz Medals CIMAT UMALCA Mexico + $5,000 Beal Prize Andrew Beal AMS United States + $1,000,000 Philip Leverhulme Prize Leverhulme Trust England + £70,000 Premio Euskadi de Investigación EJGV Spain €40,000 Shao prize Hong Kong $1,000,000 Prix Elie Cartan CNRS France €3,800 < 45 years Prix Thérèse Gautier ASF France €10,000 Prix Gabrielle Sand et M. Guido Triossi ASF France €1,500 Prix Léonid Frank ASF France + €30,000 Prix Jacques-Louis Lions SMAI France €10,000 Prix Blaise Pascal SMAI GAMNI France €3,000 Prix Lagrange SMAI SEMA SIMAI Europe + Prix Maurice Audin SMAI SMF France €1 500 < 45 years André Lichnerowicz prize EPFL Switzerland €500 Poisson geometry Leonard Eisenbud prize AMS United States $5,000 David P. Robbins prize AMS United States $5,000 Prix Fonde par L'État France €7,500 Prix La Recherche France < 40 years Prix Jacques Herbrand ASF France €25,000 < 35 years Prix Ernest Déchelle ASF France €1 500 Prix Paul Doistau \\- Émile Blutet ASF France €3,000 Prix Petit d'Ormoy, Carrière, Thébault ASF France €1 500 Médaille Émile Picard ASF France Royal Medal RSL England £5,000 Richard C. DiPrima Prize SIAM United States + $1,000 Red Sock Award SIAG United States + $100 Gábor Szegö Prize SIAG United States + Australian Mathematical Society Medal AustMS Australia + Premio Franco Tricerri UMI Italy Premio Calogero Vinti UMI Italy €4,100 Premio Gaetano Fichera UMI Italy €5,000 Premio Ennio de Giorgi UMI Italy €3,000 Abramov Prize SPb Russia <35 years Premio Internacional Abertis Abertis Spain €10,000 Christopher Heyde Medal AAS Australia $10,000 Premi Nacional de Recerca FCRI Spain €40,000 Abdus Salam Award NUST Pakistan $1,000 Abel Prize Norway + €740,000 Ackermann Teubner Germany + €30,000 Adams Prize England + £14,000 < 40 years Adrien Pouliot Award Canada Aisenstadt Prize CRM Canada $3,000 Premi Albert Dou SEMA SCM Spain €2,500 D'Alembert Award ASME United States Alexander von Humboldt Awards Germany + €60,000 Alfréd Rényi Prize Hungary Prix Ampère ASF France €30,500 Austrian Math. Society Prize ÖMG Austria €1,000 Premio Giuseppe Bartolozzi UMI Italy €516 Bateman Prize Beal Conjecture and Prize AMS United States + $1,000,000 Beale-Orchard-Hays Prize MOS United States $1,500 Berwick Prize LMS England Bôcher Memorial Prize AMS United States + $5,000 Bolyai Janos Prize HAS Hungary + €179,000 Leonard M. Blumenthal Award AMS United States + Premio Renato Caccioppoli UMI Italy Georg Cantor Medal DMV Germany Carl Friedrich Gauss Prize IMU DMV Germany + €10,000 Centennial Fellowships AMS United States $90,000 Chauvenet Prize MAA United States $1,000 Charles Moran Award Australia < 40 years Chern Medal ICM United States $250,000 Millennium Prize Problems CMI United States + $1,000,000 each Clay Research Award CMI United States Frank Nelson Cole Prize AMS United States $5,000 Collatz Prize United States < 42 years Premio Consagración ANCEFN Argentina $10,000 COPSS Presidents Award United States < 40 years Coxeter-James Prize CMS Canada Crafoord Prize KVA Sweden + $600,000 J.D. Crawford Prize SIAG United States $750 Christopher Zeeman Medal IMA LMS England CRM Fields PIMS Prize Canada Dannie Heineman Prize APS United States + $10,000 David- Borwein CMS Canada David Hilbert Award WFNMC closed Denes König Prize SIAG/DM SIAM United States $1,000 Premio Descartes UE Europe €1,000,000 Award for Distinguished Public Service AMS United States + $4,000 Dirac Medal ICTP United States + $5,000 Premio Divulgacion en Matemáticas SEMA Spain Emil Artin Junior Prize AMS Armenia Erdos Prize WFNMC Israel < 40 years Premio de Excelencia Científica FCFM Chile $15,000 < 40 years Premio Estímulo ANCEFN Argentina $5,000 Euler Book Prize MAA United States EMS Monograph Award EMS + Europa €10,000 EMS Prize ECM Europe + €5,000 < 35 years Falconer Lecturer AWM MAA United States Premio Fermat IMT France + €20,000 Junior Fermat Prize IMT France + €2,000 Premi Ferran Sunyer i Balaguer IEC Spain + €15,000 Fields Medal IMU Europa + €10,000 Frederick W. Lanchester Prize INFORMS United States + $5,000 Frohlich Prize LMS England Fronteras FBBVA CSIC Spain + €400,000 Student grant Fullbright Argentina United States Student grant Fulkerson Prize MPS AMS United States + $1 500 Premio Évariste Galois SCM IEC Spain €1,000 Germund Dahlquist Prize SIAM United States + $1,000 George B. Dantzig Prize SIAM MOS United States + George David Birkhoff Prize SIAM AMS United States + $5,000 George Polya Prize SIAM United States + $20,000 George Szekeres Medal AustMS Australia + Guy Medal RSS England Hannan Medal AustMS Australia Hans Freudenthal Awards ICMI Holland + Heinz Hopf Prize ETH Switzerland + €20,000 Henri-Poincare Prize IAMP Europe + Michael Holmboe Memorial Prize Norway €35,800 Premio Príncipe de Asturias de Investigación FPA Spain + €50,000 ICTCM Award ICTCM United States + J. L. Lions ECCOMAS Europa + $3,000 < 40 years J.H. Wilkinson Prize SIAM United States + $3,000 Jeffery-Williams Prize CMS Canada + John Lighton Synge Award RSC Canada + Premio Nacional de Investigación Júlio Rey Pastor MEC Spain + Premio Nacional de Ciencias Exactas de Chile CNCA Chile 18,125,000 pesos Jürgen Moser Lecture SIAG United States $500 Premio José Luis Rubio de Francia RSME Spain €3,000 Premio Joseph S.DeBlasi ACM United States + Karp Prize ASL United States + Keith Medal England + Kirkman medal ICA Felix Klein EMS ITWM Germany + €5,000 < 38 years Knuth Prize ACM IEEE-CS United States $5,000 Krieger-Nelson Prize CMS Canada Women Lagrange Prize MPS MOS United States $1,500 Premio Europeo Latsis ESF Europa + 100,000 Swiss francs Leroy P. Steele Prize AMS United States + $5,000 Leslie Fox Prize IMA United States + < 31 numerical analysis. Lester Randolph Ford Prize MAA United States $500 Levi L. Conant Prize AMS United States $1,000 Lilavati Award ICM IMU India $20,000 Lobachevsk Prize RAS Russia + Loeve Prize United States + $30,000 Lyapunov Award ASME United States Michler Prize AWM United States $46,000 Women Morgan Prize AMS MAA United States + $1,200 E.H. Moore Prize AMS United States $5,000 NAS Award NAS United States $5,000 National Medal of Science NSF United States + Naylor Prize LMS England Nemmers United States $150,000 Northwestern University Nessyahu Prize Israel Nevanlinna Prize IMU Finland + Norbert Wiener Prize AMS United States $5,000 Oberwolfach Prize MFO Germany + €10,000 < 35 years Ostrowski Prize Switzerland 100,000 Fr. Oswald Veblen Prize EMS United States + $5,000 Geometry Paul Erdos Award WFNMC Bulgaria + Paul Erdos Prize HAS Hungary Peter Henrici Prize SIAM ETHZ United States $5,000 Pi Mu Epsilon Award AMS United States Pioneer Prize ICIAM United States $1,000 < 42 years Premio Pitágoras Italy + €20,000 Polya Prize LMS England Prix Poncelet ASF France 2,000 Fr Prandtl medall ECCOMAS Europa Concurso Unión Europea para Jóvenes Científicos EUCYS Europa €28,500 18–20 years Jóvenes Investigadores CSIC Spain €5,000 15–20 years Ralph E. Kleinman Prize SIAM United States $5,000 Ramanujan Prize ICTP Italy + $10,000 < 45 years Premio Reconocimiento UMALCA Latin America $2,500 Richard Rado Preis Germany €1,000 Rolf Schock Prize KVA Sweden + €44,000 Rollo Davidson Prize England Rosalind Franklin RSL England £30,000 RSA Medal RSA United States + $200,000 Ruth Lyttle Satter Prize AMS United States $5,000 Salem Prize AMS United States + SASTRA Ramanujan Prize SASTRA India $10,000 < 35 years Schafer Prize AWM United States Women Premio SEMA al joven investigador SEMA Spain €1,500 Prix de thèse SMAI GAMNI ECCOMAS Europe + Senior Whitehead Prize LMS England + Starting Grant ERC Europa €1 500,000 Student grant Selfridge Prize ANTS Germany Comp. Number Theory Prix Servant ASF France €7,500 Shaw Prize China + $1,000,000 Sylvester Medal RSL England + £3,500 Sir Edmund Whittaker England Edimburgh Sloan Fellowship APSF United States Smith's Prize England Sofja-Kovalevskaja Award Humboldt foundation Germany €1,650,000 Premio Sofia Kovalévskaya SMM FSK Mexico Prix Sophie-Germain ASF France €8,000 Premio Sotero Prieto MMS Mexico Stampacchia Medal UMI Italy + Stefan Bergman Prize AMS United States $12,500 Takebe Prizes MSJ Japan Premio Talento Matemático Chile $5,000 < 23 years J. Hall Taylor Medal ASME United States + $1,000 Theodore von Karman Prize SIAM United States $1,000 Thomas Ranken Lyle Medal AAS Australia Turing Award ACM Intel Google United States + $250,000 Whitehead Prize LMS England + Whittaker Prize England + £500 < 35 years Senior Whittaker Prize England + £500 < 35 years W.T. and Idalia Reid Prize SIAM United States + $20,000 Wilks Memorial Awrd ASA United States $1,500 William Lowell Putnam MAA United States $2 500 Wolf Prize Israel + $100,000 < 40 years Wolfskehl Prize Germany €14,000 Zienkievwicz Medal England + £1,000 Category:Mathematics lists",
 "title": "Awards for mathematics"
}