{
 "id": "447066",
 "text": "ECW Heat Wave, known as NXT Heatwave since 2022. is a series of professional wrestling events that was first made by Extreme Championship Wrestling (ECW) from 1994 to 2000. ECW began making it a pay-per-view starting in 1998. In 2022, WWE (which bought ECW in 2003) brought back the event's name for their NXT brand. ==Results== ===1994=== Heat Wave 1994: The Battle for The Future took place on July 16, 1994 at the ECW Arena in Philadelphia, Pennsylvania. It was the first Heat Wave event held by ECW. ===1995=== Heat Wave 1995: Rage In The Cage! took place on July 15, 1995 at the ECW Arena in Philadelphia, Pennsylvania. It was the second Heat Wave event held by ECW. ===1996=== Heat Wave 1996 took place on July 13, 1996 at the ECW Arena in Philadelphia, Pennsylvania. It was the third Heat Wave event that ECW produced. The event was only available on the internet. ==== Four-Way Dance eliminations ==== Elimination no. Wrestler Eliminated by Elimination move Time 1 Chris Jericho 2 Cold Scorpio Pinfall 27:00 2 2 Cold Scorpio Pitbull #2 Pinfall 31:00 3 Pitbull #2 Shane Douglas Pinfall 40:47 Winner: Shane Douglas ===1997=== Heat Wave 1997 took place on July 19, 1997 at the ECW Arena in Philadelphia, Pennsylvania. It was the fourth Heat Wave event made by ECW. ===1998=== Heat Wave 1998 took place on August 2, 1998 at the Hara Arena in Dayton, Ohio. It was the fifth Heat Wave event made by ECW and the first to be broadcast on pay-per-view. The event also featured talent from Frontier Martial-Arts Wrestling (FMW). ===1999=== Heat Wave 1999 took place on July 18, 1999 at the Hara Arena in Dayton, Ohio. It was the sixth Heat Wave event made by ECW. ===2000=== Heat Wave 2000 took place on July 16, 2000 at the Grand Olympic Auditorium in Los Angeles, California. It was the seventh Heat Wave event and the last to be made by ECW. === 2022 === NXT Heatwave 2022 took place on August 16, 2022, at the WWE Performance Center in Orlando, Florida as a special episode of the NXT TV series on the USA Network. === 2023 === NXT Heatwave 2023 took place on August 22, 2023, at the WWE Performance Center in Orlando, Florida as a special episode of the NXT TV series on the USA Network. === 2024 === NXT Heatwave 2024 took place on July 7, 2024, on the weekend of Money in the Bank. It happened at the Scotiabank Arena in Toronto, Ontario, Canada, making this the biggest arena to host a Heatwave event. It now was held as a livestreaming event on Peacock in the U.S. and the WWE Network elsewhere. == References == ==Related pages== *Extreme Championship Wrestling *WWE NXT Category:Extreme Championship Wrestling Category:World Wrestling Entertainment pay-per-view events Category:1994 establishments in the United States",
 "title": "ECW Heat Wave"
}