{
 "id": "447175",
 "text": "Lewis & Clark College is a private university in Portland, Oregon. The school was formed in 1867. In 2022, it had about 3,600 students and about 270 teachers. ==History== The college started in 1867 in Albany, Oregon as part of the Presbyterian Church. At that time is was called Albany Collegiate Institute. The first class graduated in 1873. In 1905 the school changed its name to Albany College and started giving Bachelor of Arts degrees. The school opened a campus in Portland in 1934. The Portland campus was very popular, so the school decided to move there. The school opened a much larger campus in Portland in 1942, and renamed the school Lewis & Clark College, to honor the Lewis and Clark Expedition. In 1966, the school stopped being part of a church and became a secular school.Our History - Lewis & Clark College ==Students== In 2022 Lewis & Clark College had 3705 students. 2,205 of those students were undergraduate students. The school has 29 majors. The most popular major is psychology. In 2024 tuition was $64,828 a year. In 2014, 64% of students who applied to the school were accepted. 60% of students are female, and 40% of students are male. The school does not have any fraternities or sororities.Lewis & Clark College - Best Colleges - US News US News and World Report - Accessed 17 April 2014 Some notable graduates of the school are: * Ahmed Ali Al Sayegh - A minister of state for the United Arab Emirates * Matt Biondi - A swimmer who won 11 Olympic medalsWhere Are They Now - Matt Biondi SFGate, accessed 28 January 2015 * Earl Blumenauer - The U.S. Representative for Oregon's 3rd congressional district from 1996 to 2024 * Don Bonker - The U.S. Representative for Washington's 3rd Congressional district from 1975 to 1989 * Kate Brown - The Governor of Oregon from 2015 to 2023 * Haben Girma - A lawyer, writer and disability rights advocate. * Heidi Heitkamp - A United States senator for North Dakota from 2013 to 2019 * Jeanne M. Holm - The first woman to be a 1 Star General in the United States Air Force * Monica Lewinsky - An anti-bullying activist * Muhammad bin Nayef - The Deputy Crown Prince of Saudi ArabiaFuture king of Saudi Arabia graduated from Lewis & Clark with a degree in political science The Oregonian, accessed 28 January 2015 * Markie Post - An actress * Bill Walker - The Governor of Alaska from 2014 to 2018 * Pete Ward - A professional baseball player ==References== Category:Colleges and universities in Oregon Category:Portland, Oregon Category:1857 establishments in the United States Category:19th-century establishments in Oregon",
 "title": "Lewis & Clark College"
}