{
 "id": "447203",
 "text": "Burushal state or\" Bru zha land\" is the old name for \" Gilgit Division\" of the Gilgit Baltistan the region of Pakistan. Burushal, which was once an independent state in the past, is located in the Gilgit-Baltistan province of Pakistan. Burushal is a word from Burushaski which means \"headland of the Brušo/Burusho nation\". The inhabitants here are called Burusho/Brušo and their dialect is Brušski/burushaski. The Burusho people have the distinction of being the oldest inhabitants of the northwest of India and the first settlers. And they may have been before the migration of Indo Aryans. The history of Burushal is very old. Today we don't know what exactly is it's origion At it's peaks it's was extended from Tibet to Persia (today wakhan Afghanistan) which means it includes Ladakh, Jammu, Kashmir, Gilgit, and Chitral. Sindhu ==Migration of other nations== Then the migration started towards this region. Balti came from China ( mostly Tibet) and settled and from this the state of Baltistan started. Local people (Burusho) called them Balox and the area called Baloi (بلوئی). After that Aryan Groups also moved to this area thus they are founder of Dard-Desh. Shina language is one of the major languages of Dard nations, which is spoken in most parts of Gilgit-Baltistan. This was followed by a kind of decline of the state of Brushal. Burushal, which was such a big state, was now limited only to Gilgit Division ( which today includes includes District Gilgit, Nagar Ghizer and Hunza). And then to only Hunza and Nagar with its capital at Capel Dons /Dongs \"Nagar khas\"/Oyum Nagar The king was called\" Tham\" in burushaski . The Tham/king had twins are said to have shown hostility to one another from birth. Thereupon their father, unable to settle the question of succession, divided his state between them, giving Girkis the north/west, (Hunza) and to Moghlot the (Nagar) south/east bank of the river and thus the state of Burushal further divided Nagar and Hunza. ==History== Nagar and Hunza were small states and derived most of their income from looting trade caravans from China. The British wanted to trade from here to Russia, but these states were preventing them from doing so, so it was decided to attack Nagar in 1891 under the leadership of Colonel Durand. Finally, with the help of a traitor, the British army reached the top of the fort and stormed the fort, ending thousands of years of Nagar independence. The bravery of the small army is acknowledged. ==Geography== Today we talk about Burushal we usually refer to \"Gilgit Division \" Which includes Nagar Hunza Gilgit and Ghizer as sub-division Districts. Chitral is in the south west of Burushal, China is in the north, Afghanistan is in the north and northwest and Dardistan/ Diamar is in the south, and southeast. Baltistan (baloi/boloristan) is at east and northeast. 37187 square km Hunza Nagar Burushal Burushal Category:Gilgit-Baltistan",
 "title": "Brooshal"
}