{
 "id": "447437",
 "text": "Henri Jules de Bourbon, Prince of Condé (Paris, 29 July 1643 – Paris, 1 April 1709) was a member of the House of Bourbon and was the Prince of Condé till his death. He was also the only surviving son of the famous Grand Condé. He was known for his bizarre bouts of madness. He was also ranked as a Prince of the blood st the Royal court of Versailles. At the end of his life he suffered from clinical lycanthropy and was considered insane. ==Marriage and children== He was married to Princess Anne Henriette of Bavaria at the Louvre in December 1663. She was a cousin of Elisabeth Charlotte of the Palatinate. The couple had ten children including the next Prince of Condé. He also had an illegitimate daughter with a mistress. He was well educated but had a malicious character. # Marie Thérèse de Bourbon (1 February 1666 – 22 February 1732) married the Prince of Conti and had children. #Henri de Bourbon, Duke of Bourbon (5 November 1667 – 5 July 1670) died in childhood. # Louis de Bourbon. (10 November 1668 – 4 March 1710) married Louise Françoise de Bourbon, légitimée de France a daughter of Louis XIV; the couple had children. # Anne de Bourbon. (11 November 1670 – 27 May 1675) died in childhood. # Henri de Bourbon, Count of Clermont (3 July 1672 – 6 June 1675) died in childhood. # Louis Henri de Bourbon, Count of La Marche (9 November 1673 – 21 February 1677) died in childhood. # Anne Marie Victoire de Bourbon (11 August 1675 – 23 October 1700) died unmarried and childless. # Anne Louise Bénédicte de Bourbon (8 November 1676 – 23 January 1753) married Louis Auguste de Bourbon, Duke of Maine and had children. # Marie Anne de Bourbon (24 February 1678 – 11 April 1718) married Louis Joseph de Bourbon , Duke of Vendôme but died childless. ==Titles, styles, honours and arms== ===Titles and styles=== *29 July 1643 – 26 December 1646 His Serene Highness Duke of Albret *26 December 1646 – 11 November 1686 His Serene Highness the Duke of Bourbon *11 November 1686 – 1 April 1709 His Serene Highness The Prince of Condé. Category:1643 births Category:1709 deaths Category:House of Bourbon Category:French princes Category:Dukes and Duchesses of Bourbon",
 "title": "Henri Jules, Prince of Condé"
}