{
 "id": "447687",
 "text": "Narendra Damodardas Modi (born 17 September 1950) is an Indian politician who is the 14th and current Prime Minister of India since 2014. He was previously the Chief Minister of the state of Gujarat from 2001 to 2014. He was elected prime minister in May 2014. He is a member of the right-wing Bharatiya Janata Party. He is the first Indian prime minister to be born after the country's independence from the British Empire in 1947. ==Early life== Narendra Modi was born into a Gujarati family in Vadnagar. As a child, he used to help his father, who ran a tea stall at Vadnagar railway station. Later, he and his brother ran a tea stall of their own at a bus terminus. In 1978, Modi received a B.A. degree in political science from School of Open Learning at the University of Delhi, graduating with a third class. Five years later, in 1983, he received a Master of Arts degree in political science from Gujarat University, as an external distance learning student. ==2019 Polls== Modi led the BJP in the 2014 Indian general election which gave the party a majority in the Indian lower house of parliament, the Lok Sabha, the first time for any single party since 1984. He soon became Prime Minister of India. PM Modi's administration has tried to raise foreign investment in the Indian economy and cut spending on healthcare and social welfare programmes. The Modi government has made amendments to existing environmental and labour laws. Following his party's victory in the 2019 Indian general election, introduced the Citizenship Amendment Act, which resulted in widespread protests across the country. Modi was appointed Chief Minister of Gujarat in 2001. Modi was elected to the legislative assembly soon after. His administration oversaw the 2002 Gujarat riots, and he was criticized for how he handled them initially,which was his starting career as a chief minister .There have been multiple investigations into the Gujarat riots, including a Supreme Court- appointed Special Investigation Team (SIT), which cleared Modi of any wrongdoing.. As a Prime Minister, Narendra Modi has had high approval ratings. In early 2017, a survey from Pew Research Center showed Modi to be the most popular figure in Indian politics.https://www.hindustantimes.com/india- news/morning-brief-how-spg-thwarted-possible-threat-to-modi-in-kyiv- bangladesh-guards-stop-india-from-building-fence-more-101724467977281.html ==Personal life== In 1968, he married Jashodaben. However, the couple has been separated. Narendra has a close relationship with his mother, Hiraben(who died). He is a vegetarian.https://www.livemint.com/news/world/pakistan-needs- a-leader-like-narendra-modi-nationalism-has-worked-well-for-india-pak- politician-11724588320598.html According to Modi and his neighbors, during his childhood, Modi occasionally assisted in his father's tea business on the platform of Vadnagar railway station. ==Notes== ==References== ==Other websites== * Official Biographical Sketch in Lok Sabha Website * Narendra Modi Early Life, Education ,Political Journey, challenges and Achievement * Category:1950 births Category:Living people Category:Prime Ministers of India Category:Current national leaders Category:Politicians from Gujarat Category:Bharatiya Janata Party politicians Category:Indian Hindus Category:Members of the Lok Sabha",
 "title": "Narendra Modi"
}