{
 "id": "44779",
 "text": "MapleStory is an online computer game made by the Korean company Wizet, and maintained and distributed by Nexon. Playing the game is free, but people can buy clothes and other in-game items from the \"Cash Shop\" using money. MapleStory has way less than 10,000 concurrent players world-wide. The game has many different versions for people to play on based on location. MapleStory got its name from the maple leaf. Therefore, the game has the maple leaf item during events. == Gameplay == This game is a 2D side-scrolling massively multiplayer online role-playing game which requires players to create characters and then play the game as the \"Novice Job Advancement\". The name depends on the class he or she picked. Then, one does quests or grinds at monsters until either LV. 120 or LV. 200 depending on the class one chooses. One can get Job Advancements to get stronger in-game. Please note the number of the level required to job advance might change due to some recent patches: 1st Job requires LV. 10, 2nd Job requires LV. 30, 3rd Job requires LV. 70 (LV. 60 after the Tempest expansion) and 4th Job requires LV. 120. (LV. 100 after the Tempest expansion) Every year, MapleStory receives a lot of updates, which some players found the game going into a better direction but some players felt that the game is just getting spoiled. The Maple World is known to be big that one needs to use transportation to travel over places. Taking a ship required the in-game currency mesos and some waiting time. However, to prevent other characters to be a goner forever, the ship is free of charge. Meso is the in-game currency for MapleStory used to buy potions, equipment or cool items in the Free Market (Note: The Free Market prices are not free, the items are usually as expensive as one billion.) Mesos cannot be bought. They are hard to earn by questing or trading and are easy to spend on things in the Free Market. There are other systems and features in the game. == Reboot and non Reboot worlds == The game has 2 different types of worlds, Reboot and non Reboot. In Reboot worlds, you cant trade, buy or sell anything with other players, but you must earn everything manually by yourself and work harder to make progress, but drops and money in game is tripled x5 or even higher. Reboot worlds also has enemies which have more health points (HP) than non Reboot worlds, there are many more differences. In normal non Reboot worlds, monsters are weaker. You can trade with other players and there are no restrictions on trading, buying, or selling items between players. A new Reboot world called Hyperion was also recently released in North America territory. == New Classes in the game == There are many new classes which have been added to the game. The game currently has over 50 different classes to choose from to play in the game, which are all appearing on the game's official site. These classes include Beast Tamer, Xenon, Phantom, Luminous, Mechanic, Wild Hunter, Kaiser, Angelic Buster, Kain, Khali, and many more. == MapleStory DS == MapleStory DS (Korean: 메이플스토리 DS) is a Nintendo DS game coming in April 2010, being worked on with Nexon and Nintendo. They said that the Korean put-up date was in 2009. The game was talked about in E3 2006. On January 9 2007, Nexon and the newly made Nintendo of Korea put up a trailer for the game. They first said the game would be put up in September 2007. It was found out it will be an online game, that works with the Nintendo DS Wi-Fi System. In an interview with the boss of international business development, Stephen Lee said that the game will work in single player. He also said there were going to be microphone and touch-responsive features. == References == == Other websites == * Official MapleStory international website * MapleStory global Category:2003 video games Category:Free online games Category:Free-to- play video games Category:IOS games Category:Massively multiplayer online role-playing games Category:Side-scrolling video games Category:Video games developed in South Korea Category:Windows games",
 "title": "MapleStory"
}