{
 "id": "447892",
 "text": "Sam & Cat was an American television program. It starred Jennette McCurdy as Sam Puckett and Ariana Grande as Cat Valentine. The program was first shown on June 8, 2013 on Nickelodeon. Sam & Cat\" is a crossover and a spin-off of the programs iCarly (Sam) and Victorious (Cat). The show is about the two girls living together and being babysitters. The program was announced on November 29, 2012. It began production in January 2013. On 12 March 13 2014, a second season was announced. ==Cancellation== On July 13, 2014, the series was cancelled because of problems with the two stars (McCurdy and Grande). ==Summary== Sam Puckett has been driving around on her motorcycle. She sees a girl thrown into a garbage truck. Sam saves Cat and they become friends. They move to Cat's house because Nona moved away. They become babysitters to get money. Their friends include Goomer and Dice. ==Characters== ===Main=== * Jennette McCurdy as Sam Puckett * Ariana Grande as Cat Valentine * Cameron Ocasio as Dice. * Maree Cheatham as Nona ===Secondary=== * Zoran Korach as Goomer * Griffin Kane and Emily Skinner as Max and Chloe * Sophia Grace & Rosie as Ruby and Gwen They also were in #RevengeOfTheBritBrats where they return and drive a wedge between Sam and Cat. * Dan Schneider as the voice of Tandy * Lisa Lillien as the voice of Bungle * Ronnie Clark as Herb * Ryan P. Shrime as Yokvish ===Minor=== * River Alexander as Dilben * Ben Giroux as Jeff Du Shell * Tyler Michael Brown and Rashaan Smith as Bob and Ethan * Jake Brennan as Butler Torso * Susan Huckle as Debbie Torso * Jack DeSena as Host of Texting Competition * Aubrey K. Miller as Ellie ==Episodes== ==Production== On August 3, 2012 the show was announced. On November 29, 2012 it got picked up to start in 2013. Production began in January 2013. On July 11, 2013 twenty more episodes were added. Filming began on September 14, 2013. The show first was to start on March 23, 2013. It was moved to the fall and then to June 2013. It finally started on June 8, 2013. ==Reviews== The first episode was watched by 4.2 million people. The most watched episode is \"#TheKillerTunaJump: #Freddie #Jade #Robbie\" with 4.8 million people watching. The least watched episode is \"#SecretSafe\" 2.0 million people. In December 2013 Common Sense Media rated it two stars and said it makes people laugh \"at the expense of any realistic content.\" ==Awards== Year Award Category Recipient Result 2013 J-14 Teen Icon Awards Icon TV Show Sam & Cat 2013 J-14 Teen Icon Awards Icon TV Actress Ariana Grande 2013 J-14 Teen Icon Awards Icon TV Actress Jennette McCurdy 2014 ANMTVLA Awards Best Children Series in 2013 Sam & Cat 2014 ANMTV Brazil Awards Best child and adolescent series exhibited in 2013 Sam & Cat 2014 2014 Kids' Choice Awards Favorite TV Show Sam & Cat 2014 2014 Kids' Choice Awards Favorite TV Actress Ariana Grande 2014 2014 Kids' Choice Awards Favorite TV Actress Jennette McCurdy ==International premieres== Country Channel Premiere Title Source(s) United States Nickelodeon June 8, 2013 Sam & Cat Canada YTV August 12, 2013 Sam & Cat Canada Nickelodeon (Canada) September 7, 2013 Sam & Cat United Kingdom Ireland Nickelodeon (UK & Ireland) September 1, 2013 (preview) October 14, 2013 (premiere) Sam & Cat Australia Nickelodeon (Australia) September 30, 2013 (preview) October 11, 2013 (premiere) Sam & Cat Poland Nickelodeon (Poland) September 28, 2013 Sam i Cat Germany Nickelodeon (Germany) Sam & Cat Netherlands Belgium Nickelodeon (Netherlands & Flanders) Sam & Cat Denmark Nickelodeon (Denmark) Sam & Cat September 29, 2013 Norway Nickelodeon (Norway) Sam & Cat September 29, 2013 Sweden Nickelodeon (Sweden) Sam & Cat September 29, 2013 New Zealand Nickelodeon (New Zealand) Sam & Cat September 30, 2013 (preview) October 7, 2013 (premiere) Nickelodeon Greenlights Additional 20 Episodes Of Top-Rated Comedy Sam & Cat, Starring Jennette McCurdy And Ariana Grande Philippines Nickelodeon (Philippines) Sam & Cat October 11, 2013 Hong Kong Indonesia Macau Malaysia Singapore Thailand Taiwan Vietnam Nickelodeon (Southeast Asia) Sam & Cat Brazil Nickelodeon (Brazil) Sam & Cat October 19, 2013 Argentina Chile Colombia El Salvador Mexico Peru Venezuela Dominican Republic Ecuador Bolivia Uruguay Paraguay Nickelodeon (Latin America) Sam & Cat France Nickelodeon (France) October 30, 2013 Sam et Cat Portugal Nickelodeon (Portugal) November 4, 2013 Sam & Cat Spain Nickelodeon (Spain) Sam & Cat Italy Nickelodeon (Italy) Sam & Cat South Africa Nickelodeon (Africa) Sam & Cat Turkey Nickelodeon (Turkey) November 11, 2013 Sam & Cat Quebec VRAK.TV December 31, 2013 Sam et Cat http://blogue.bellmediatvplus.ca/plaisir-garanti-a-vrak-tv-cet- hiver/http://www.vrak.tv/television/horaire/courante/20140102/ Hungary Nickelodeon (Hungary) February 16, 2014 Sam és Cat Greece Nickelodeon (Greece) February 24, 2014 Sam & Cat Japan NHK April 2, 2014 サム&キャット ==References== ==Other websites== * Official website * Sam & Cat at Nick.com * Category:Television spin-offs Category:Nickelodeon television series Category:2010s American sitcoms Category:2013 American television series debuts Category:2014 American television series endings Category:English- language television programs",
 "title": "Sam & Cat"
}