{
 "id": "44784",
 "text": "Mount Fuji (富士山, Fuji-san) is the tallest mountain in Japan, at high. JapanGuide.com: \"Mount Fuji\". Retrieved 2011-12-12. It is also a volcano. It is on the border between Shizuoka Prefecture and Yamanashi Prefecture. Mount Fuji is a famous cultural icon of Japan, as a lot of people have painted it and taken photographs of it. It became the 13th UNESCO World Heritage Site in Japan on June 22, 2013. The last time it erupted was from 1707 to 1708. ==Dormant volcano== Mount Fuji is officially classified as an active volcano, National Institute of Advanced Industrial Science and krabs (AIST), Geological Survey of Japan : \"Active Volcanoes in Japan\"; \"Mount Fuji\". Retrieved 2011-12-12. but some describe Fuji as dormant or inactive.Ball, Jessica. \"Voices: Dead or alive ... or neither? Why a dormant volcano is not a dead one,\" Earth Magazine (American Geosciences Institute). September 8, 2010. Retrieved 2012-6-14. The last major event was the Hōei eruption of Mount Fuji which started on December 16, 1707 (Hōei 4, 23rd day of the 11th month) and ended about January 1, 1708 (Hōei 4, 9th day of the 12th month) during the Edo period. Shizuoka University website : 宝永四年（1707）噴火 . Retrieved 2011-12-12. Cinders and ash from Fuji fell like rain in Izu Province, Kai Province, Sagami Province, and Musashi Province.Titsingh, Isaac (1834). Annales des empereurs du Japon, p.416. ==Shinto== The mountain is thought to be named after Fuchi, the Buddhist fire goddess. SacredDestinations.com: \"Mount Fuji, Japan\". Retrieved 2011-12-12. The mountain is sacred in the Shinto religion and at the bottom of the mountain are shrines to the goddess Konohananosakuya-hime (コノハナノサクヤヒメ）). ==Climbing== Many people climb Mt. Fuji every year. The official climbing season is in the summer: July 25 to August 25. There are three mountain-climbing routes on the Shizuoka side of Mt. Fuji. There is a post office on the top of Mt. Fuji which is open only in summer. The post office was built in 1909 and is the highest post office in Japan. Shizuoka Prefecture website : \"Mt. Fuji Trivial Fact Quiz\" . Retrieved 2011-12-12. == Mountain in art == In 2009, Mount Fuji was recognized as one of the 100 Landscapes of Japan which best show contemporary Japan and its culture in the Heisei period.\"100 Landscapes of Heisei announced,\" Yomiuri Shimbun. May 2009. Retrieved 2012-3-30. Image:The Great Wave off Kanagawa.jpg|The Great Wave off Kanagawa (1832), from 36 Views of Mount Fuji, by Hokusai Image:Katsushika Hokusai - Fine Wind, Clear Morning (Gaifū kaisei) - Google Art Project.jpg|Red Fuji by Hokusai Image:Hodogaya on the Tokaido.jpg|Hodogaya on the Tokaido Road by Hokusai File:Hiroshige Mt fuji 2.jpg|The sea off Satta, Suruga (Suruga Satta no Kaijō) by Hiroshige (1859) Image:Hiroshige Mt Fuji seen across a plain.jpg|Mt. Fuji seen across a plain by Hiroshige Image:Hiroshige, Sugura street.jpg|Surugacho (Suruga Street) (1856), from One Hundred Famous Views of Edo by Hiroshige, depicting the Echigoya kimono and money exchange store with Mount Fuji in background == Related pages == * List of World Heritage Sites in Japan * List of volcanos * Extinct volcano ==References== ==Other websites== * Nippon Archives, Nippon Archives - The history of Mount Fuji * Japan-guide.com, Mount Fuji * Kawaguchi Lake Immersive Virtual Tour * Pictures of routes up Mount Fuji * Mount Fuji climbing & sightseeing guide Category:Volcanoes of Japan Category:Shizuoka Prefecture Category:Yamanashi Prefecture",
 "title": "Mount Fuji"
}