{
 "id": "44798",
 "text": "PRIDE Fighting Championships was a mixed martial arts organization based in Japan (1997–2007). PRIDE held more than sixty mixed martial arts events. As one of the most MMA organizations in the world during its ten years of operation, PRIDE broadcast to about 40 countries worldwide. == History == PRIDE Fighting Championships was first started in 1997 by the match popular Japanese pro-wrestler Nobuhiko Takada with Rickson Gracie, champion of the Gracie family of Brazilian jiu-jitsu practitioners. The event, held at the Tokyo Dome on October 11, 1997 attracted 47,000 fans, as well as Japanese mass media attention. The success of the first event enabled its promoters to hold a regular series of mixed martial arts events and grew up to be the most popular mixed martial arts event in Japan. == Rules == ===Match length=== PRIDE matches make up of three rounds; the first round is ten minutes, and the second and third round are five minutes. Intermissions between each round were two minutes in length. In PRIDE US events, NSAC Unified MMA rules were used, with non-title matches consisting of three five minute rounds and title matches of 5 five minute rounds both having 60 second intermissions between rounds. When two rounds of a Grand Prix took place on the same night, Grand Prix bouts consisted of two rounds; the first lasting ten minutes and the second lasting five. Intermissions between each round remained two minutes in length. ===Weight classes=== *Heavyweight (more than / ) *Middleweight (less than or equal to / ) *Welterweight (less than or equal to / ) *Lightweight (less than or equal to / ) ===RING=== PRIDE used a five-roped square ring with sides in length (approximately ). ===Fighter’s clothing=== PRIDE allowed fighters latitude in their choice of clothing but open finger gloves, a mouthguard and a protective cup were duty. Fighters were allowed to use tape on parts of their body or to wear a gi top, gi pants (Judo, Jujutsu, Karate), wrestling shoes, kneepads, elbow pads, or ankle supports at their own discretion, though each was checked by the referee before the fight. ===Victory=== *Submission *A fighter taps either his opponent or the mat three times *Knockout *A fighter falls from a legal blow and is either unconscious or unable to continue. *Technical Knockout *Referee Stoppage: the referee sees that one fighter is completely dominant to the point of endangering his opponent, the referee will stop the match. *Doctor Stoppage: in the event that a fighter is injured (via fair methods) and cannot continue the match, his opponent will be declared the winner. The ring doctor will be the one to determine whether the fighter can continue or not. In the event that an injury was caused by illegal methods, the perpetrator will be disqualified. *A fighter's corner throws in the towel. ===Decision=== If the match reaches its time limit then the outcome of the bout is determined by the three judges. The fight is scored in its entirety and not round-by-round. After the third round, each judge must decide a winner. Matches cannot end in a draw. A decision is made according to the following standard in this order of priority: #the effort made to finish the fight via KO or submission, #damage given to the opponent, #standing combinations and ground control, #takedowns and takedown defense, #aggressiveness, and #weight (in the case that the weight difference is / or more). == Fouls == *Head butting. (Beginning at PRIDE 12) *Eye gouging. *Hair pulling. *Biting. *Fish hooking. *Any attacks to the groin *Strikes to the back of the head, which includes the occipital region and the spine. The sides of the head and the area around the ears are not considered to be the back of the head. (see Rabbit punch) *Small joint manipulation (control of four or more fingers/toes is necessary). *Elbow strikes to the head and face. *Intentionally throwing your opponent out of the ring. *Running out of the ring. *Purposely holding the ropes. Fighters cannot purposely hang an arm or leg on the ropes and it will result in an immediate warning. == PRIDE champions == *Heavyweight (over ) Fedor Emelianenko (Russia) *Middleweight (under ) Dan Henderson (USA) *Welterweight (under ) Dan Henderson (USA) *Lightweight (under ) Takanori Gomi (Japan) Category:1997 establishments in Japan Category:2007 disestablishments in Japan Category:Mixed martial arts organizations",
 "title": "PRIDE Fighting Championships"
}