{
 "id": "44795",
 "text": "Alain Prost (born 24 February 1955 in Lorette, France) is a French retired automobile racer and Formula One World Champion. His nickname is \"Professor\". Prost is the one of the greatest Formula One drivers of all time. He won the championship four times: 1985, 1986, 1989 and 1993. Only Lewis Hamilton (7), Michael Schumacher (7) and Juan Manuel Fangio (5) have won more times than Prost. == Formula One == He started driving with McLaren in 1980. From 1981 until 1983, he was racing for Renault F1. Prost returned to McLaren in 1984 and raced for them until 1989. During this time he won his first three championships. Prost left McLaren to race for Scuderia Ferrari in 1990 and 1991. In 1992, Prost took a year off from racing. He returned to racing in 1993 with WilliamsF1. Prost retired from racing after winning his fourth title in that year. Prost raced in 202 Grand Prix races between 1980 and 1993. He held the record for most wins with 51 until 2001. He was in the pole position in 33 of those races and had the fastest lap time in 41 races. == Career in numbers == === Comparison with team-mates === In his career, Prost beat nearly all his team-mates on total points, including five World Champions. Only in 1980 he lost by a point and in 1984 by half a point. Year Prost's points Team- mates' points Team-mate 1980 5 6 John Watson 1981 43 11 René Arnoux 1982 34 28 René Arnoux 1983 57 22 Eddie Cheever 1984 71.5 72 Niki Lauda 1985 76 (73) 14 Niki Lauda 1986 74 (72) 22 Keke Rosberg 1987 46 30 Stefan Johansson 1988 105 (87) 94 (90) Ayrton Senna 1989 81 (76) 60 Ayrton Senna 1990 73 (71) 37 Nigel Mansell 1991 34 21 Jean Alesi 1993 99 69 Damon Hill == Formula One results == (Races in bold mean pole position, races in italics show fastest lap) Year Team Car Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 WDC Points 1980 Marlboro Team McLaren McLaren M29B Ford Cosworth DFV 3.0 L V8 ARG 6 BRA 5 RSA DNS USW 16th 5 McLaren M29C BEL Ret MON Ret FRA Ret GBR 6 GER 11 AUT 7 McLaren M30 DUT 6 ITA 7 CAN Ret USA DNS 1981 Equipe Renault Elf Renault RE20B Renault-Gordini EF1 1.5 L V6 T USW Ret BRA Ret ARG 3 SMR Ret BEL Ret 5th 43 Renault RE30 MON Ret ESP Ret FRA 1 GBR Ret GER 2 AUT Ret DUT 1 ITA 1 CAN Ret CPL 2 1982 Equipe Renault Elf Renault RE30B Renault-Gordini EF1 1.5 L V6 T RSA 1 BRA 1 USW Ret SMR Ret BEL Ret MON 7 USE NC CAN Ret DUT Ret GBR 6 FRA 2 GER Ret AUT 8 SUI 2 ITA Ret CPL 4 4th 34 1983 Equipe Renault Elf Renault RE30C Renault-Gordini EF1 1.5 L V6 T BRA 7 2nd 57 Renault RE40 USW 11 FRA 1 SMR 2 MON 3 BEL 1 USA 8 CAN 5 GBR 1 GER 4 AUT 1 DUT Ret ITA Ret EUR 2 RSA Ret 1984 Marlboro McLaren International McLaren MP4/2 TAG 1.5 L V6 T BRA 1 RSA 2 BEL Ret SMR 1 FRA 7 MON 1 CAN 3 USE 4 USA Ret GBR Ret GER 1 AUT Ret DUT 1 ITA Ret EUR 1 POR 1 2nd 71.5 1985 Marlboro McLaren International McLaren MP4/2B TAG 1.5 L V6 T BRA 1 POR Ret SMR DSQ MON 1 CAN 3 USA Ret FRA 3 GBR 1 GER 2 AUT 1 DUT 2 ITA 1 BEL 3 EUR 4 RSA 3 AUS Ret 1st 73 (76) 1986 Marlboro McLaren International McLaren MP4/2C TAG 1.5 L V6 T BRA Ret ESP 3 SMR 1 MON 1 BEL 6 CAN 2 USA 3 FRA 2 GBR 3 GER 6 HUN Ret AUT 1 ITA DSQ POR 2 MEX 2 AUS 1 1st 72 (74) 1987 Marlboro McLaren International McLaren MP4/3 TAG 1.5 L V6 T BRA 1 SMR Ret BEL 1 MON 9 USA 3 FRA 3 GBR Ret GER 7 HUN 3 AUT 6 ITA 15 POR 1 ESP 2 MEX Ret JPN 7 AUS Ret 4th 46 1988 Honda Marlboro McLaren McLaren MP4/4 Honda RA168E 1.5 L V6 T BRA 1 SMR 2 MON 1 MEX 1 CAN 2 USA 2 FRA 1 GBR Ret GER 2 HUN 2 BEL 2 ITA Ret POR 1 ESP 1 JPN 2 AUS 1 2nd 87 (105) 1989 Honda Marlboro McLaren McLaren MP4/5 Honda RA109E 3.5 L V10 BRA 2 SMR 2 MON 2 MEX 5 USA 1 CAN Ret FRA 1 GBR 1 GER 2 HUN 4 BEL 2 ITA 1 POR 2 ESP 3 JPN Ret AUS Ret 1st 76 (81) 1990 Scuderia Ferrari Ferrari 641 Ferrari 036 3.5 L V12 * * * Ferrari 036 3.5 L V12 USA Ret BRA 1 SMR 4 MON Ret 2nd 71 (73) Ferrari 641/2 CAN 5 MEX 1 FRA 1 GBR 1 GER 4 HUN Ret BEL 2 ITA 2 POR 3 ESP 1 JPN Ret AUS 3 1991 Scuderia Ferrari Ferrari 642 Ferrari 037 3.5 L V12 USA 2 BRA 4 SMR DNS MON 5 CAN Ret MEX Ret 5th 34 Ferrari 643 FRA 2 GBR 3 GER Ret HUN Ret BEL Ret ITA 3 POR Ret ESP 2 JPN 4 AUS 1993 Canon Williams Renault Williams FW15C Renault RS5 3.5 L V10 RSA 1 BRA Ret EUR 3 SMR 1 ESP 1 MON 4 CAN 1 FRA 1 GBR 1 GER 1 HUN 12 BEL 3 ITA 12 POR 2 JPN 2 AUS 2 1st 99 == Related pages == * Formula 1 * Juan Manuel Fangio == References == == Other websites == * Grand Prix History - Hall of Fame , Alain Prost * Alain Prost statistics Category:1955 births Category:Living people Category:Armenian diaspora Category:French Formula One drivers Category:Sportspeople from Auvergne-Rhône-Alpes Category:People from Loire",
 "title": "Alain Prost"
}