{
 "id": "448092",
 "text": "Gabe Abrahams is a walker and world-record holder of Multiday events (Walking, Speed Walking, Beach Walking). He was born in the district of Les Corts, Barcelona, Spain (1966). He is a descendant by maternal line of the noble houses Solar de Valdeosera (La Rioja) and House of Elgeta (Basque Country), who were Lords of Gipuzkoa. His ancestors were also from other regions of Spain, Jews and Scandinavians. == Toulouse-Lleida == Gabe Abrahams walked 500 km from Toulouse (France) to Lleida (Spain), crossing Pau, France, when he was 20 years old. In 2000’s, he made his debut in sports like Beach Run and Nordic Walking. He broke several World Records. == 500 miles of Beach Walking == In January 2014, Gabe Abrahams retired from these sports and he focussed on great walks of Multiday (Walking, Speed Walking, Beach Walking). In August 20-29, 2015, Gabe Abrahams walked 500 km on the sand of Sant Adrià de Besòs, Badalona and Barcelona beaches in 206 hours and 30 minutes (8 days, 14 hours and 30 minutes). He broke Beach Walking World Records of 300 miles (482,803 km) and 500 km. In June 03-24, 2016, Gabe Abrahams walked 500 miles (804,672 km) on the sand of Castelldefels, Sant Adrià de Besòs, Badalona and Barcelona beaches in 21 days. He broke Beach Walking World Record of 500 miles. In 2015 and 2016, he also broke the greatest distance of Beach Walking. == 1.000 miles in Barcelona Metropolitan Area == Since 03-06 to 04-11, 2017, Gabe Abrahams walked with Power Walking technique 1.000 miles (1.609,344 km) between Barcelona, La Sentiu, Gavà (Garraf) and Castellbisbal (Barcelona Metropolitan Area) in 36 days and 5 hours. He broke the Speed Walking World Record of 1.000 miles and the greatest distance of Speed Walking. == 1.000 miles in Aragon == Since 04-20 to 05-22, 2018, Gabe Abrahams walked with Power Walking technique 1.000 miles between Monzón and Zaragoza, on a circuit that crossed Aragon, in 32 days and 21 hours. Again, he broke the Speed Walking World Record of 1.000 miles. == Around Navarra and Cinco Villas == Since 01-28 to 02-06, 2020, Gabe Abrahams walked around Navarra and Cinco Villas (505 km) in 8 days, 22 hours and 10 minutes. He broke the Around Navarra and Cinco Villas World Record. == 10 days in Catalonia Coast == In June 09-19, 2021, Gabe Abrahams walked with Power Walking technique 535,8 km between El Masnou and Vilanova i la Geltrú (Catalonia Coast) in 10 days. He broke the Speed Walking World Record of 10 days. == 1.925 km in Catalonia Coast == Since 03-23 to 05-04, 2023, Gabe Abrahams walked with Power Walking technique 1.925 km between El Masnou and Vilanova i la Geltrú in 42 days. He broke 6 weeks Speed Walking World Record and the greatest distance of Speed Walking. == 1 week in Barcelona Metropolitan Area == In May 17-24, 2025, Abrahams also walked with Power Walking technique 403 km between Barcelona, Badalona and Cornellà de Llobregat (Barcelona Metropolitan Area) in 7 days. He broke 1 Week Speed Walking World Record. == Writer == Since 2020, Gabe Abrahams was columnist and author in different media (Nueva Tribuna, Rebelion.org, Tercera Información...) and he wrote about sports, culture and history. Abrahams wrote many biographical articles of world and Olympic champion athletes. He also wrote biographical articles about the painter Diego Rivera, the architects Modest Feu and Adolf Florensa or the musician Erik Satie. In 2022, Gabe Abrahams published the book Caminatas de 1.000 millas, Barcelona 2017 y Aragón 2018. In the following years, Abrahams also published the books Gestas deportivas: atletas, ciclistas, tenistas... (2023) and Olímpicos, biografías de héroes del deporte (2024), books that compiled biographies of great athletes of the 20th century. == Multiday World Records == World Records Marks City & Date Multiday -Speed Walking- 1 week 403 km Barcelona-Badalona-Cornellà de Llobregat, 05-17/24-2025 Multiday -Speed Walking- The greatest distance walked with Speed Walking 1,925 km El Masnou-Vilanova i la Geltrú, 03-23/05-04-2023 Multiday -Speed Walking- 6 weeks 1,925 km El Masnou-Vilanova i la Geltrú, 03-23/05-04-2023 Multiday -Speed Walking- 10 days 535,8 km El Masnou-Vilanova i la Geltrú, 06-09/19-2021 Multiday -Walking- Around Navarra and Cinco Villas (505 km) 8 days, 22 hours and 10 minutes Navarra and Cinco Villas, 01-28/02-06-2020 Multiday -Speed Walking- 1.000 miles 32 days and 21 hours Aragon, 04-20/05-22-2018 Multiday -Speed Walking- The greatest distance walked with Speed Walking 1.000 miles Barcelona-La Sentiu, Gavà (Garraf)-Castellbisbal, 03-06/04-11-2017 Multiday -Speed Walking- 1.000 miles 36 days and 5 hours Barcelona-La Sentiu, Gavà (Garraf)-Castellbisbal, 03-06/04-11-2017 Multiday -Beach Walking- The greatest distance walked on the beach 500 miles Castelldefels, Sant Adrià de Besòs- Badalona-Barcelona, 06-03/24-2016 Multiday -Beach Walking- 500 miles 21 days Castelldefels, Sant Adrià de Besòs-Badalona-Barcelona, 06-03/24-2016 Multiday -Beach Walking- The greatest distance walked on the beach 500 km Sant Adrià de Besòs-Badalona-Barcelona, 08-20/29-2015 Multiday -Beach Walking- 500 km 206:30 Sant Adrià de Besòs-Badalona-Barcelona, 08-20/29-2015 Multiday -Beach Walking- 300 miles 203:20 Sant Adrià de Besòs-Badalona-Barcelona, 08-20/29-2015 == References == == Other websites == * Gabe Abrahams. World Ranking -National and World Race Walking- * Gabe Abrahams. enciclopèdia.cat, Enciclopèdia Catalana Category:Spanish athletes Category:Racewalkers Category:Sportspeople from Barcelona Category:Living people Category:1966 births Category:World record holders",
 "title": "Gabe Abrahams"
}