{
 "id": "448409",
 "text": "TF1 is a French commercial public broadcaster television network owned by TF1 Group, controlled by the Bouygues conglomerate. TF1's average market share of 24% makes it the most popular domestic network. TF1 is part of the TF1 Group of mass media companies, which also includes the news channel LCI. It previously owned the satellite TV provider TPS, which was sold to Canal+ Group. The network is a supporter of the Hybrid Broadcast Broadband TV (HBBTV) initiative promoting and establishing an open European standard for hybrid set-top boxes for the reception of terrestrial TV and broadband multimedia applications with a single user interface. ==History== TF1 stood first for Television France 1 created in 1978. TF1 was the only channel in France for 28 years so I had Broadcasted Parent and English Tv shows. It was the only channel in France for 28 years, and has often changed its name since the creation of Radio-PTT Vision on April 26, 1935, making it one of the oldest television stations in the world, and one of the very few prewar television stations to remain in existence to the present day. It became Radiodiffusion nationale Télévision (RN Télévision) in 1937, Fernsehsender Paris (Paris Television) during German occupation in 1943, RDF Télévision française in 1944, RTF Télévision in 1949, la Première chaîne de la RTF in 1963 following the creation of the second channel, la Première chaîne de l'ORTF in 1964 and finally Télévision Française 1 (TF1) in 1975. ==Parent Programming== French TV shows now airing: *Julie Lescaut *Diane, femme flic *Alice Nevers, le juge est une femme *Joséphine Ange gardien *No limit *Falco These TF1 Original TV shows were shown on TF1 : *Les toqués *Rose et Val, Soeur Thérèse.com, Mes amis, mes amours, mes emmerdes..., Commissaire Cordier, R.I.S Police scientifique, Les Cordier, juge et flic ; Extrême limite ; La Vie devant nous ; Joséphine ange gardien. American TV shows now airing (dubbed and sometimes also subtitled): Surface (Surface) *Law & Order: Special Victims Unit (New York unité spéciale) *Walker, Texas Ranger (Walker, Texas ranger) *Life (Life) *Monk (Monk) *CSI: NY (Les experts : Manhattan) *CSI: Crime Scene Investigation (Les experts) *Wild Card (Méthode Zoé) *The Young and the Restless (Les feux de l'amour) *Crossing Jordan (Preuve à l'appui) *House (Dr House) *Grey's Anatomy (Grey's Anatomy) *Close to Home (Close to Home) *The Mentalist (Mentalist) *Law & Order: Criminal Intent (New York section criminelle) *CSI: Miami (Les experts : Miami) *Brothers & Sisters (Brothers & Sisters) *Dirty Sexy Money (Dirty Sexy Money) *Army Wives (American Wives) Kids TV series *Totally Spies! (Original Productions) *The Amazing Spiez (Original Productions) *Monster Buster Club (Original Productions) *MasterChef France (Original Programming) *MasterChef France Junior (Original Programming) *Pokémon *Dora the Explorer *Sonic X among others. *Rekkit Rabbit (Original Programming) *Sesame Street *Babar and the Adventures of Badou (Co-Original Programming) In 2005, TF1 launched TF1Vision, a video on demand service. ==Kids Original Programming== *Totally Spies *The Amazing Spiez! *Monster Buster Club *Rekkit Rabbits ==Related pages== * People's Television Network * Intercontinental Broadcasting Corporation * DWET-TV * DWNB-TV * DWVN-DTV * BBC * CCTV ==References== == Other websites == * Category:Television channels in France",
 "title": "TF1"
}