{
 "id": "448550",
 "text": "The Amazing Spiez! is a French/Canadian animated television series. It is produced by the French company Marathon Media and the Canadian company Image Entertainment Corporation. It was first broadcast on March 15, 2009 on Disney Channel Asia. It aired on TF1 in France and Teletoon in Canada. The series had 52 episodes (2 seasons). It aired its last episode on May 25, 2012. Its spinoff is Totally Spies. ==Plot== 4 kids are secretly undercover as spiez! for WOOHP taking down Baddies headed by Jerry Lewis the Head/Founder of WOOHP a secret spy organization. ==Characters== *Lee Clark is the oldest of the SpieZ at age 13. He is the strongest and most athletic spy. His spy suit is red. *Marc Clark is the smartest of the SpieZ at age 12. He is very intelligent, which his siblings often find freaky. His spy suit is blue. *Megan Clark is the only girl of the SpieZ at age 12, and Marc's fraternal twin sister. She always hangs out with her 3 brothers. Her spy suit is pink. *Tony Clark in the youngest of the SpieZ at age 11. He is a very hyperactive boy who would rather act before even thinking. His spy suit is yellow. *Jerry Lewis is the founder of WOOHP (World Organization of Human Protection). He sends the spies on missions. *Cal and Karen Clark are the parents of the SpieZ. They are former agents part of an organization called OOPSIE. *Tami is a popular girl at the SpieZ' school, and a rival to them. ==Episodes== The Amazing Spiez! had 52 episodes. Each episode was 26 minutes long. The series had 52 episodes divided in 2 seasons. The series first episode premiered on March 15 2009 and the last episode premiered on May 25, 2012. ==Broadcast== The series came on Disney Channel Asia, TF1, Teletoon, Cartoon Network USA, NHK Japan, Canal J and other networks ==References== Category:2000s animated television series Category:2009 Canadian television series debuts Category:2009 French television series debuts Category:2012 Canadian television series endings Category:English-language television programs Category:2010s French television series endings",
 "title": "The Amazing Spiez!"
}