{
 "id": "44854",
 "text": "Emo is a kind of music which is short for \"emotive hardcore.\" The style first formed in the mid-1980s, taking the musical sounds of hardcore punk and post- hardcore and combining them with sad and sensitive lyricism (words) that emo has become so well known for. In the mid-1990s, emo incorporated indie rock elements. This ultimately made the emo bands of the 90's much less angry and 'punk-ish' and more dramatic, sometimes even acoustic. Once emo became popular in the 2000s, it became shaped by pop punk, (a mix of emo and pop punk exists, and is called \"emo-pop\") alternative rock and melodic hardcore. The birthplace of the emo style of music is often said to be Washington, D.C.. This is because the first known emo band, Rites Of Spring, is from that city. ==Fashion== As emo entered the mainstream, it became as tied to fashion as to the music genre. The term \"emo\" is associated with wearing skinny jeans, as well as tight T-shirts (usually short-sleeved) or zip-up hoodies which often bear the names of emo bands. Studded belts, converse sneakers, vans, and black wristbands also became associated with emo fashion. Also, thick, horn-rimmed glasses remained in emo fashion. In the mid-2000s, eyeliner and black fingernails became another common thing in emo fashion. The most famous part of emo fashion is the emo hairstyle. The emo hairstyle is flat, straight, and usually jet black hair with long bangs that often will cover a lot of the face. This fashion has at times been characterized as a fad. Emo fashion also has been often confused with goth fashion and scene fashion. As emo became known as a subculture, people who both dressed in emo fashion and associated themselves with the genre of emo music have been called \"emo kids\" or \"emos\". ==Music== Examples of bands that emos have been known for listening to are My Chemical Romance, Green Day, Hawthorne Heights, Silverstein, AFI, Dashboard Confessional, Simple Plan, Brand New, From First to Last, Armor for Sleep, Aiden, Senses Fail, Fall Out Boy, Taking Back Sunday, The Movielife, Death Cab for Cutie, The Used, Alesana, Finch, Panic! at the Disco, and Paramore. Emo kids also tend to show high interest in lesser known emo bands, such as Ashestoangels, A Thorn For Every Heart, Dear Whoever and (early) Greeley Estates. Three of the bands mentioned above are multi-platinum acts (My Chemical Romance,\"My Chemical Romance’s Gerard Way Taps Another Nail Into 'Emo' Coffin\" , Rolling Stone, September 20, 2007, retrieved 2 May 2009. Fall Out Boy,\"Misery Business\", 14 June 2007, BBC.co.uk, retireved 2 April 2009. F. McAlpine] and Panic at the Disco\"Panic! At The Disco declare emo 'Bullshit!' The band reject 'weak' stereotype\", NME, 18 December 2006. Retrieved 10 August 2008.) and they are known for making \"emo-pop\" music early in their careers. They have, however, protested to belonging to the emo genre. ==Criticism and controversy== ===Stereotypes=== People who associate themselves with emo tend to be looked at by society as anxious and emotional. These types of people are looked at by society to be associated with depression, self-harm and suicide. Some people explained the difference between emos and goths by saying that \"emos hate themselves, while goths hate everyone.\" ====Suicide and self harm==== Some people believe emo is a bad thing. A teenager named Hannah Bond died by hanging herself, blamed by both her mother, Heather Bond, and Hannah's coroner (\"dead body analyst\"). They both believed that emo music caused Hannah to think that suicide is good. They noticed that Hannah appeared to really enjoy the band My Chemical Romance. They noticed that she joined an \"emo cult\", and an image of an emo girl with bloody wrists was shown on her Bebo page. It was reported that Hannah told her parents that her self-harm was an \"emo initiation ceremony\". Heather Bond does not like emo culture: \"There are 'emo' websites that show pink teddies hanging themselves.\" After the results of her dead body are reported on the magazine NME, fans of emo music were complaining that the emo culture did not promote self-harm and suicide. The band My Chemical Romance felt sad about Hannah's death, and spoke verbally that the band is both anti-violence and anti-suicide. ==Artists== * Matchbook Romance * My Chemical Romance * Story of the Year * Hawthorne Heights * Senses Fail * Underoath * The Red Jumpsuit Apparatus * Secondhand Serenade ==Related pages== * Screamo ==References== Category:Music genres Category:Subculture",
 "title": "Emo"
}