{
 "id": "448921",
 "text": "This is the list of motorways in the United Kingdom. Great Britain has a road numbering system, and Northern Ireland has its own road numbering system. == Great Britain == === M-designated motorways === Link Route Counties (England) Council Areas (Scotland) Local gvt. areas (Wales) M1 Nicknamed the 'gateway to the North'. The eastern north-south motorway links London (Hendon) to Leeds. It continues north to the A1 near Garforth. The first inter-urban motorway. Greater London, Hertfordshire, Bedfordshire, Buckinghamshire, Northamptonshire, Leicestershire, Nottinghamshire, Derbyshire, South Yorkshire, West Yorkshire M2 From Strood to Faversham. It bypasses the Medway Towns. Kent M3 Main motorway from London to the south coast. Linking Sunbury-on-Thames to Southampton. Surrey, Hampshire M4 The southern east-west motorway linking London (Chiswick) to Bristol and on to South Wales, terminating just beyond Pontarddulais. Greater London, Berkshire, Buckinghamshire, Wiltshire, Gloucestershire, Monmouthshire, Newport, Cardiff, Vale of Glamorgan, Rhondda Cynon Taff, Bridgend, Neath Port Talbot, Swansea, Carmarthenshire M5 The main motorway through South West England. Linking the M6 at Great Barr (on the Birmingham / West Bromwich / Walsall border) to Exminster near Exeter. West Midlands, Worcestershire, Gloucestershire, Bristol, Somerset, Devon M6 The main western north-south motorway linking the North West of England with the South. It is the longest motorway in the UK. Starts at M1 near Rugby and terminates at the A74(M) at Gretna which continues to Glasgow. Leicestershire, Warwickshire, West Midlands, Staffordshire, Cheshire, Merseyside, Greater Manchester, Lancashire, Cumbria M6 Toll A toll motorway bypassing a busy stretch of the M6 around the Birmingham and Wolverhampton areas from near Coleshill to Cannock. West Midlands, Staffordshire M8 Linking Edinburgh to the A8 at Langbank, via Glasgow and Livingston. There is a gap in the motorway between Chapelhall and Bargeddie (south-east and south-west of Coatbridge) where the road is classified as the A8, this section will soon be upgraded to motorway standard. Edinburgh, West Lothian, North Lanarkshire, Glasgow, Renfrewshire M9 Linking the M8 just west of Edinburgh to Dunblane via Stirling and Falkirk. Edinburgh, West Lothian, Falkirk, Stirling M11 Linking London (Woodford) to Cambridge. Greater London, Essex, Cambridgeshire M18 Linking the M1 at Rotherham to the M62 near Goole. South Yorkshire, East Riding of Yorkshire M20 Linking the M25 at Swanley to Folkestone. Kent M23 Linking Hooley in Surrey (just north of the M25, and south of Coulsdon) to Crawley. Surrey, West Sussex M25 The London orbital motorway, numbered clockwise from Dartford around London to Thurrock. (The Dartford Crossing between Thurrock and Dartford is not classified as a motorway, being the A282.) Kent, Surrey, Berkshire, Greater London, Buckinghamshire, Hertfordshire, Essex M26 A short link between the M25 at Sevenoaks and the M20 before Maidstone. Kent M27 The south coast route running from Cadnam, west of Southampton, to Portsmouth. Hampshire M32 A spur from the M4 near Winterbourne to central Bristol. Gloucestershire, Bristol M40 The southeast-northwest motorway linking Denham, west of London, to the M42 south of Solihull. Buckinghamshire, Oxfordshire, Northamptonshire, Warwickshire M42 Part of the Birmingham orbital motorway, from the M5 near Bromsgrove, running around the south and east of Birmingham and continuing north towards Measham. A section near Coleshill has been replaced by the M6 Toll. Worcestershire, Warwickshire, West Midlands, Leicestershire M45 A short spur linking the A45 south west of Rugby to the M1 south east of Rugby and north of Daventry. Warwickshire, Northamptonshire M48 The Severn Bridge, linking the M4 at Olveston (near Thornbury), over the River Severn, to the M4 at Rogiet (near Caldicot). This used to be part of the M4 before the Second Severn Crossing was built. Gloucestershire, Monmouthshire M49 A short link from the M5 to the M4 west of Bristol. Bristol, Gloucestershire M50 Linking the M5 north of Tewkesbury to Ross-on-Wye. Worcestershire, Gloucestershire, Herefordshire M53 Linking Wallasey and Chester. Merseyside, Cheshire M54 Linking the M6 north of Wolverhampton to Wellington west of Telford. Staffordshire, Shropshire M55 Linking the M6 north of Preston to Blackpool. Lancashire M56 Linking Manchester (Gatley) to the A5117 between Ellesmere Port and Chester. Greater Manchester, Cheshire M57 The Liverpool bypass running north-west from the M62 near Huyton to Switch Island between Maghull and Aintree. Merseyside M58 Linking Switch Island (between Maghull and Aintree, northern Liverpool) to Wigan. Merseyside, Lancashire, Greater Manchester M60 The Manchester Outer Ring Road, an orbital motorway, numbered clockwise from Stockport. Greater Manchester M61 Linking Manchester (Worsley) to Bamber Bridge near Preston. Greater Manchester, Lancashire M62 The trans-Pennine link – connecting Liverpool to the A63 between North Cave and Newport, west of Kingston upon Hull. There is a gap in the motorway between Winton and Simister where the road has been reclassified to become the northern part of the M60 Manchester orbital motorway. From its western terminus to J6, the M62 is not a trunk road and is under the jurisdiction of Liverpool City Council. Merseyside, Cheshire, Greater Manchester, West Yorkshire, North Yorkshire, East Riding of Yorkshire M65 Linking Bamber Bridge near Preston to Colne. From J10 to J14, the M65 is not a trunk road and is under the jurisdiction of Lancashire County Council. Lancashire M66 Linking Ramsbottom to the M60 at Whitefield. Lancashire, Greater Manchester M67 Linking the M60 at Denton, east Manchester, to Hattersley, east of Hyde. Greater Manchester M69 Linking Coventry to Leicester. Warwickshire, Leicestershire M73 Linking the M74 near Uddingston to the M80, south-west of Cumbernauld. North Lanarkshire, Glasgow M74 Linking Glasgow (Pollokshields) to the A74(M) at Abington. Glasgow, North Lanarkshire, South Lanarkshire M77 Linking the M8 at Glasgow (Pollokshields) to Fenwick near Kilmarnock. Glasgow, East Renfrewshire, East Ayrshire M80 Linking the M8 at Glasgow (Riddrie) and the M9 south of Stirling. Glasgow, North Lanarkshire, Falkirk, Stirling M90 Linking Inverkeithing, north of the Forth Road Bridge, to Perth. There are plans to extend the motorway south across the Firth of Forth, to join the M9 at Kirkliston. Fife, Perth and Kinross M180 Linking the M18 at Thorne to the junction of the A15 (south of the Humber Bridge) and A180 (west of Grimsby). South Yorkshire, Lincolnshire M181 A spur from the M180 running to the west of Scunthorpe. Lincolnshire M271 Spurs from the M27 heading north to the A3057 (south of Romsey), and south to Totton. Hampshire M275 A spur from the M27 on Horsea Island into Portsmouth (Landport). The motorway is not a trunk road and is under the jurisdiction of Portsmouth City Council. Hampshire M602 Linking the M62 at Winton to Salford, just west of the centre of Manchester. Greater Manchester M606 A spur from the M62 near Cleckheaton into Bradford. West Yorkshire M621 The section from the M62 to junction 3 was constructed as the Leeds South West Urban Motorway. The remainder of the motorway was constructed as the Leeds South East Urban Motorway as was part of the M1, and indeed formed its northern most section until 1999 with the completion of the M1/A1 link and the completion of the road at J3. It now links the M62 at Gildersome to the M1 near Rothwell. West Yorkshire M876 Linking the M80 near Denny, north-west of Falkirk, to the A876 near the Kincardine Bridge. A short section of the motorway north of Stenhousemuir is classified as the M9. Falkirk M898 A spur from the M8 near Erskine to the A898, the Erskine Bridge approach road. Renfrewshire == Northern Ireland == === M-designated motorways === Link Route Council areas M1 Linking Belfast to Dungannon. Belfast, Lisburn, Craigavon, Dungannon and South Tyrone M2 In two sections, one linking Belfast to Antrim, and the other bypassing Ballymena. The section in between was planned, but never built. Belfast, Newtownabbey, Antrim, Ballymena M3 Linking the M2 in north Belfast to the A2 Sydenham Bypass in east Belfast. Belfast M5 Linking the M2 in north Belfast to Newtownabbey. Belfast, Newtownabbey M12 A spur from the M1 near Derrymacash to the north of Portadown. Craigavon M22 Linking the M2 at Antrim to Randalstown. Antrim ==Related pages== *Great Britain road numbering scheme == References == Category:United Kingdom-related lists Category:Lists of roads",
 "title": "List of motorways in the United Kingdom"
}