{
 "id": "448993",
 "text": "The District of Diekirch (, German: Diekirch, ) was one of three districts of the Grand Duchy of Luxembourg. Its capital was the city of Diekirch. In 2015, the districts were abolished. It was the northernmost of the districts and, with an area of , the largest of the three districts. It has a population of 83,661 inhabitants and a population density of inhabitants/km², the lowest density of all districts. ==History== When the districts were created on 24 February 1843, Diekirch was one of the three of the country. On 2012, the communes of Heinerscheid and Munshause were made part of the commune of Clervaux; Hosingen, Consthum and Hoscheid were merged to made the new commune of Parc Hosingen; Ermsdorf and Medernach were merged to made the new commune of Vallée de l'Ernz; Heiderscheid and Neunhausen were joined to Esch-sur-Sûre. So the number of communes changed from 43 to 36. ==Geography== The Diekirch district is bordered to the west and north by Belgium (Belgian provinces of Luxembourg and Liège), to the east by Germany (German Land of Rhineland- Palatinate, to the south by the Luxembourg district and to the southwest by the Grevenmacher district. The two highest hills in Luxembourg, the Kneiff () and Buurgplaatz (), are in this district, in the commune Troisvierges. The former Diekirch District coincides with the Oesling Region, except for the southern parts. ==Composition== The Diekirch district has 5 cantons and 36 communes. Canton Capital Area (km²) Population (2014) Density (inhab./km²) Communes 1 Clervaux Clervaux 342.2 16,447 5 2 Diekirch Diekirch 204.5 30,460 10 3 Redange Redange 267.5 17,086 10 4 Vianden Vianden 78.5 4,722 3 5 Wiltz Wiltz 264.6 14,946 8 ===Cantons and their communes=== #Clervaux ##Clervaux ##Parc Hosingen ##Troisvierges ##Weiswampach ##Wincrange #Diekirch ##Bettendorf ##Bourscheid ##Diekirch ##Erpeldange ##Ettelbruck ##Feulen ##Mertzig ##Reisdorf ##Schieren ##Vallée de l'Ernz #Redange ##Beckerich ##Ell ##Grosbous ##Préizerdaul ##Rambrouch ##Redange ##Saeul ##Useldange ##Vichten ##Wahl #Vianden ##Putscheid ##Tandel ##Vianden #Wiltz ##Boulaide ##Esch-sur- Sûre ##Eschweiler ##Goesdorf ##Kiischpelt ##Lac de la Haute-Sûre ##Wiltz ##Winseler ==References== Category:Districts of Luxembourg",
 "title": "Diekirch District"
}