{
 "id": "449237",
 "text": "George John Mitchell Jr. (born August 20, 1933) is an American lawyer, businessman and politician. He is a Democrat. Mitchell served as a United States Senator from Maine from 1980 to 1995 and as Senate Majority Leader from 1989 to 1995. ==Early life== Mitchell was born in Waterville, Maine. His father, George John Mitchell, Sr. (born Joseph Kilroy), was of ethnic Irish descent but was adopted by a Lebanese family when he was orphaned. ==Political career== In 1980, he was elected to the United States Senate. He became Senate Majority Leader in 1989. He briefly was a United States District Judge of the United States District Court for the District of Maine from 1979 to 1980. Since retiring from the Senate in 1995, he had a key role in peace talks in Northern Ireland and the Middle East. He appointed United States Special Envoy for Northern Ireland (1995–2001) by President Clinton and as United States Special Envoy for Middle East Peace (2009–2011) by President Barack Obama. He was a primary architect of the 1996 Mitchell Principles and the 1998 Good Friday Agreement in Northern Ireland, and was the main investigator in two \"Mitchell Reports\", one on the Arab–Israeli conflict (2001) and one on the use of performance-enhancing drugs in baseball (2007). ==Post Senate career== Mitchell was chairman of The Walt Disney Company from March 2004 until January 2007, and later as chairman of the international law firm DLA Piper. He was the Chancellor of Queen's University in Belfast, Northern Ireland, from 1999 to 2009. Mitchell also was a co-chair of the Housing Commission at the Bipartisan Policy Center.Bipartisan Policy Center's Housing Commission In 2015, unsealed court documents showed Mitchell's possible involvement with the Jeffrey Epstein child trafficking ring. ==Health== Mitchell was diagnosed with a \"small, low grade, and localized\" prostate cancer in 2007. In August 2020, he was diagnosed with leukemia. ==References== ==Other websites== * * * * * * * * * Category:1933 births Category:Living people Category:Majority leaders of the United States Senate Category:Businesspeople from Maine Category:Lawyers from Maine Category:Maronites Category:United States senators from Maine Category:Democratic Party (United States) politicians Category:20th-century American politicians Category:United States Special Envoy for Northern Ireland",
 "title": "George J. Mitchell"
}