{
 "id": "449398",
 "text": "Telugu cinema, consisting primarily of movies in the Telugu language in the Indian states of Andhra Pradesh and Telangana. It is popularly called as Tollywood. It is one of the largest movie production centers in India. 1992 film Gharana Mogudu, directed by K. Raghavendra Rao, is the first Telugu film to gross over 10 crore at the box office. The following is the list of highest grossing Telugu films (including dubbed versions) based on world wide collections (gross and distributors share). Background color indicates movies playing on in theaters around the world NOTE: Since Tollywood collection figures have no certain sources, figures are provided on the basis of many sources. Though figures contradicted with some reliable sources in some cases, figures which are cited in most sources are only included. == Worldwide Collections == === Gross Collections === Rank Peak Title Year Studio(s) Worldwide Gross Ref(s) 1 1 Baahubali : The Conclusion 2017 Arka Media Works Baahubali: The Conclusion Total Worldwide Collections – Box Office Andhra 2 1 Baahubali : The Beginning 2015 Arka Media Works Why 'Baahubali' will beat 'Bajrangi Bhaijaan' in the box office race soon! – DNA 22 September 2015Bahubali / Baahubali Total Box office collections – Prabhas, Rajamouli, Rana – BLR Eagle 20 October 2015 3 3 Saaho 2019 UV Creations Saaho 4 4 Ala Vaikunthapurramuloo 2020 Haarika & Hassine Creations, Geetha Arts 5 4 Syeraa Narasimha Reddy 2019 Konidela Productions Syeraa Narasimha Reddy 6 3 Rangasthalam 2018 Mythri Movie Makers Rangasthalam – Box Office Collection – Indian Movie Stats 7 7 Sarileru Neekevvaru 2020 Sri Venkateswara Creations, AK Entertainments Sarileru Neekevvaru – Cinetrak 8 4 Maharshi 2019 SVC, PVP Cinema, Vyjayanthi Movies 9 2 Khaidi No. 150 2017 Konidela Productions 10 5 Bharat Ane Nenu 2018 DVV Entertainments 150 - 11 6 Aravindha Sametha 2018 Haarika & Hassine Creations 144 - 12 2 Srimanthudu 2015 Mythri Movie Makers 13 1 Magadheera 2009 Geetha Arts 14 9 F2 (Fun & Frustration) 2019 Sri Venkateswara Creations F2 – Cinetrak 15 2 Attarintiki Daredi 2013 Sri Venkateswara Cine Chitra 16 5 Janatha Garage 2016 Mythri Movie Makers 17 5 Sarainodu 2016 Geetha Arts Sarrainodu – Box Office Collection – Indian Movie Stats 18 9 Jai Lava Kusa 2017 NTR Arts Jai Lava Kusa – Box Office Collection – Indian Movie Stats 19 12 Geetha Govindam 2018 GA2 Pictures 20 9 DJ 2017 Sri Venkateswara Creations Duvvada Jagannadham Final Total WW Collections – Andhra Box Office 29 August 2017 === Share Collections === The worldwide distributor share figures are given here after adding dubbed versions of Tollywood movies. The distributor shares are net gross [worldwide gross (total tickets sold x ticket rate)-GST] minus theater rentals. The theater rentals vary. Multiplexes give 50% in week one, 42.5% in week two, 37.5% in week three and 30% thereafter to the distributor. Rank Peak Title Year Studio Worldwide Share ref(s) 1 1 Baahubali : The Conclusion 2017 Arka Media Works 2 1 Baahubali : The Beginning 2015 Arka Media Works 3 3 Saaho 2019 UV Creations – Box Office Andhra 30 September 2019 4 4 Ala Vaikunthapurramuloo 2020 Geetha Arts Ala Vaikunthapurramuloo Collections – Box Office Andhra 2 February 2020 5 4 Syeraa Narasimha Reddy 2019 Konidela Productions Syeraa Narasimha Reddy Total Worldwide Collections – Box Office Andhra 6 6 Sarileru Neekevvaru 2020 AK Entertainments Sarileru Neekevvaru Total Worldwide Collections – Box Office Andhra 8 March 2020 7 3 Rangasthalam 2018 Mythri Movie Makers Rangasthalam Total Worldwide Collections – Box Office Andhra 23 June 2018 8 2 Khaidi No.150 2017 Konidela Productions Khaidi No. 150 Total Worldwide Collections – Box Office Andhra 9 5 Maharshi 2019 Sri Venkateswara Creations, PVP Cinema, Vyjayanthi Movies Maharshi Total Worldwide Collections – Box Office Andhra 10 5 Bharat Ane Nenu 2018 DVV Entertainments 92 - 11 6 Aravindha Sametha 2018 Haarika & Hassine Creations 89 - 12 2 Srimanthudu 2015 Mythri Movie Makers Srimanthudu Final Collections – AP Herald 14 October 2015 13 1 Magadheera 2009 Geetha Arts Pawan Kalyan set to beat Ram Charan? – Times of India 16 October 2013 14 9 F2 (Fun & Frustration) 2019 Sri Venkateswara Creations F2 (Fun & Frustration) Total Worldwide Collections – Box Office Andhra 15 4 Janatha Garage 2016 Mythri Movie Makers Janatha Garage Final Total WW Collections = Andhra Box Office 25 October 2016 16 2 Attarintiki Daredi 2013 Reliance Entertainment, Sri Venkateswara Cine Chitra No controversies: AD stands out as clear winner – Gulte 4 November 2013 17 5 Sarainodu 2016 Geetha Arts Sarainodu Total Worldwide Collections – BoxOfficeAndhra 26 June 2016 18 9 Jai Lava Kusa 2017 NTR Arts Jai Lava Kusa Total Worldwide Collections – Box Office Andhra 19 9 DJ 2017 Sri Venkateswara creations Duvvada Jagannadham Worldwide Closing Shares – Telugu360 3 August 2017 20 13 Geetha Govindam 2018 GA2 Pictures == Top grossers by year == Year Title Studio ref(s) 2020 Ala Vaikunthapurramuloo Geetha Arts 2019 Saaho UV Creations 2018 Rangasthalam Mythri Movie Makers 2017 Baahubali : The Conclusion Arka Media Works 2016 Janatha Garage Mythri Movie Makers 2015 Baahubali : The Beginning Arka Media Works Top 5 Grossing Telugu Movies Of 2015 – Great Andhra 30 December 2015 2014 Race Gurram Sri Lakshmi Narasimha Productions Top Grossing Telugu Films of 2014: Allu Arjun's 'Race Gurram', Ram Charan's 'Yevadu', Nag's 'Manam' and Others – International Business Times 28 December 2014Race Gurram to be aired on TV soon – Times of India 8 October 2014 2013 Attarintiki Daredi Reliance Entertainment, Sri Venkateswara Cine Chitra Telugu cinema industry loses 300 crores in 2013 – Times of India 8 December 2013 2012 Gabbar Singh Parameswara Art Productions Tollywood's blockbuster year – Times of India 28 December 2012Pawan Kalyan beats Mahesh Babu – Times of India 9 January 2013 2011 Dookudu 14 Reels Entertainment Year of family entertainers – The Hindu 24 December 2011 2010 Simha United Movies Action, romance & some comedy... – Times of India 21 June 2010Top 10 Telugu Movies of 2010 – Jollyhoo 29 December 2010 2009 Magadheera Geetha Arts Tollywood's report card of 2009 – Times of India 27 December 2009 2008 Jalsa Geetha Arts 'GS 2' to Become Pawan-Devi's 4th Mega Hit! – CineJosh 19 December 2013 2007 Yamadonga Vishwamithra creations All Time Tollywood Top 10 Films – Andhraboxoffice 2006 Pokiri Vaishno Academy, Indira Productions Pokiri tops 2006 – The Hindu 29 December 2006 2005 Andarivadu Geetha Arts 2004 Shankar Dada MBBS Gemini Film Circuit Year 2004 a flashback – The Hindu 31 December 2004 2003 Tagore Leo Projects Private Limited How Tagore Bigger Than Simhadri n Okkadu? – Cinejosh 24 September 2014 2002 Indra Vyjayanthi Movies Telugu Cinema roundup in 2002 – Telugu cinema Hits of 2002 – Idlebrain 2001 Narasimha Naidu Sri Venkataramana Productions kushi no 2 blockbuster in 2001 – SBDBforums == USA collections == The USA gross figures of Top-20 tollywood movies are given here. Rank Peak Title Year Studio USA Gross ref(s) 1 1 Baahubali : The Conclusion 2017 Arka Media Works million 2 1 Baahubali : The Beginning 2015 Arka Media Works million US box office collection: 'Baahubali' (Bahubali) continues to do better business than 'Srimanthudu' – International Business Times 22 September 2015 3 3 Ala Vaikunthapurramuloo 2020 Geetha Arts million 4 3 Rangasthalam 2018 Mythri Movie Makers million 5 4 Bharat Ane Nenu 2018 DVV Entertainments million 6 2 Srimanthudu 2015 Mythri Movie Makers million 'Srimanthudu' 5th Weekend Box Office Collection: Mahesh Babu's Film Fails to Cross 3 Million Mark in 31 Days – International Business Times 8 September 2015 7 6 Saaho 2019 UV Creations million 8 6 Mahanati 2018 Vyjayanthi Movies, Swapna Cinema million 9 8 Syeraa Narasimha Reddy 2019 Konidela Productions million 10 7 Geetha Govindam 2018 Geetha Arts million 11 3 A..Aa.. 2016 Haaria & Hassine Creations million 12 4 Khaidi No. 150 2017 Konidela Productions million 13 13 Sarileru Neekevvaru 2020 AK Entertainments million 14 10 Aravindha Sametha 2018 Haarika & Hassine Creations million 15 11 F2 (Fun & Frustration) 2019 Sri Venkateswara Creations million 16 6 Fidaa 2017 Sri Venkateswara Creations million 17 7 Agnyaathavaasi 2018 Haarika & Hassine Creations million 18 3 Nannaku Prematho 2016 Sri Venkateswara Cine Chitra million http://www.ibtimes.co.in/us-box-office-collection-oopiri-beats-manam-record- turns-4th-highest-grossing-telugu-film-675087 -International Business Times 17 April 2016 19 1 Attarintiki Daredi 2013 Reliance Entertainment, Sri Venkateswara Cine Chitra million Nannaku Prematho beats Attarintiki Daredi in USA – TeluguSquare 24 Januar 2016Attarintiki Daredi collects 20 cr in overseas – Times of India 29 October 2013 20 16 Maharshi 2019 SV Creations, PVP Cinema, Vyjayanthi Movies million == Records == === Highest grossing(share) movies by month === Month Movie Year Share collections Studio Ref(s) January Ala Vaikunthapurramuloo 2020 161 cr Geetha Arts February Mirchi 2013 47 cr UV creations Top Worldwide Share (Telugu): 'Yevadu', 'SVSC', 'Attarintiki Daredi', 'Mirchi' and Other Films – International Business Times 16 February 2014 March Rangasthalam 2018 122 cr Mythri Movie Makers April Baahubali : The Conclusion 2017 813 cr Arka Media Works May Maharshi 2019 101 cr Sri Venkateswara Creations, PVP Cinema, Vyjayanthi Movies June DJ 2017 70 cr Sri Venkateswara Creations July Baahubali : The Beginning 2015 311 cr Arka Media Works August Saaho 2019 213 cr UV Creations September Janatha Garage 2016 81 cr Mythri Movie Makers October Syeraa Narasimha Reddy 2019 145 cr Kondiela Productions November Damarukam 2012 26 cr RR Movie Makers December Dhruva 2016 55 cr Geetha Arts Dhruva Final Total WW Collections – Andhra Box Office === Biggest opening day === Rank Peak Movie Year Studio(s) AP/Nizam Share ref(s) Release Day 1 1 Baahubali : The Conclusion 2017 Arka Media Works 42.8 cr Baahubali : The Conclusion Collections – Box Office Andhra 28 April 2017 Friday 2 2 Syeraa Narasimha Reddy 2019 Konidela Production Company 37.7 cr Syeraa Narasimha Reddy Collections – Box Office Andhra Wednesday 3 2 Saaho 2019 UV Creations 36.2 cr Saaho Collections – Box Office Andhra Friday 4 4 Sarileru Neekevvaru 2020 AK Entertainments 30.6 cr Sarileru Neekevvaru Collections – Box Office Andhra 12 January 2020 Saturday 5 2 Agnyaathavaasi 2018 Haarika & Hassine Creations 26.3 cr Agnyaathavaasi Collections – Box Office Andhra 11 January 2018 Wednesday 5 2 Aravinda Sametha 2018 Haarika & Hassine Creations 26.3 cr Aravinda Sametha Collections – Box Office Andhra 12 October 2018 Thursday 7 4 Vinaya Vidheya Rama 2019 DVV Entertainments 26.1 cr Vinaya Vidheya Rama Collections – Box Office Andhra Friday 8 5 Maharshi 2019 SVC, PVP Cinema, Vyjayanthi Movies 24.0 cr Maharshi Collections – BoxOfficeAndhra Thursday 9 1 Katama Rayudu 2017 North Star Entertainments 20.7 - 23.3 cr Friday 10 1 Khaidi No. 150 2017 Konidela Productions 23.2 cr Khiadi No. 150 Collections – Box Office Andhra 12 January 2017 Wednesday === Biggest opening week === Rank Peak Movie Year Studio(s) AP/Nizam Share ref(s) 1 1 Baahubali : The Conclusion 2017 Arka Media Works 117.5 cr 2 2 Ala Vaikunthapurramuloo 2020 Geetha Arts 84.9 cr Ala Vaikunthapurramuloo Collections – BoxOfficeAndhra 20 January 2020 3 2 Syeraa Narasimha Reddy 2019 Konidela Productions 83.0 cr Syeraa Narasimha Reddy Collections – Box Office Andhra 09 October 2019 4 3 Sarileru Neekevvaru 2020 AK Entertainments 80.7 cr Sarileru Neekevvaru Collections – Box Office Andhra 18 January 2020 5 2 Saaho 2019 UV Creations 73.8 cr 6 1 Baahubali : The Beginning 2015 Arka Media Works 61.3 cr Histoic Baahubali 1st Week Total Collections – Andhraboxoffice 17 July 2015 7 3 Rangasthalam 2018 Mythri Movie Makers 58.6 cr Rangasthalam Collections – BoxOfficeAndhra 6 April 2018 8 4 Maharshi 2019 Sri Venkateswara Creations, PVP Cinema, Vyjayanthi Movies 58.3 cr 9 2 Khaidi No.150 2017 Konidela Productions 56.4 cr 10 5 Aravinda Sametha 2018 Haarika & Hassine Creations 55.6 cr Aravinda Sametha Collections – Box Office Andhra 19 October 2018 == Notes == == References == Category:Lists of movies Category:India- related lists",
 "title": "List of highest-grossing Telugu movies"
}