{
 "id": "449441",
 "text": "The Eastern Theater of the American Civil War included the U.S. states of Virginia, West Virginia, Maryland, Pennsylvania, the District of Columbia and the coastal seaports and fortifications of North Carolina. There were many battles fought in this area, especially in northern and eastern Virginia. Several battles were fought between the Union Army of the Potomac and Confederate Army of Northern Virginia. There was so much fighting in Virginia because the Confederate capital was at Richmond, Virginia. The Eastern Theatre was the scene of several key battles. These included the First Battle of Bull Run, the bloody Battle of Antietam and the greatest battle, the Battle of Gettysburg. Only 100 miles separated the two capital cities, Washington, D.C. the Union capital and the Confederate capital at Richmond, Virginia. Between the two lay the Shenandoah Valley, a natural corridor that could hide entire armies. ==Principal commanders of the eastern theater== == Background == After the fall of Fort Sumter in April 1861, both sides scrambled to create armies. President Abraham Lincoln issued a call for 75,000 volunteers to suppress the rebellion. This immediately caused the secession of four additional states, including Virginia. The United States Army had only around 16,000 men, with more than half spread out in the West. The army was commanded by the elderly Lt. Gen. Winfield Scott, veteran of the War of 1812 and the Mexican-American War. On the Confederate side, only a handful of federal officers and men resigned and joined the Confederacy. The formation of the Confederate States Army was a matter initially undertaken by the individual states. == Major campaigns and battles == Campaign Effective Dates of the Campaign Notes Battle of Fort Sumter April 12–13, 1861 War started, CSA victory First Battle of Bull Run July 16–22, 1861 First Manassas, CSA victory Peninsula Campaign March 17 - August 3, 1862 Jackson's Valley Campaign May 15 - June 17, 1862 Second Battle of Bull Run August 7 - September 2, 1862 (\"Second Manassas\" for Confederate service) Maryland Campaign September 3–17, 1862 (\"Sharpsburg\" for Confederate service) Battle of Fredericksburg November 9 - December 15, 1862 Battle of Chancellorsville April 27 - May 3, 1863 Gettysburg Campaign June 29 - July 3, 1863 Battle of the Wilderness May 4–7, 1864 Battle of Spotsylvania Court House May 8–21, 1864 Overland Campaign May and June 1864 Siege of Petersburg June 4, 1864 - April 2, 1865 Valley Campaigns of 1864 August 7 - November 28, 1864 Appomattox Campaign April 3–9, 1865 == References == == Other websites == * The Civil War in Four Minutes: War in the East, Civil War Trust; YouTube * Eastern Theater Battles; YouTube Category:American Civil War",
 "title": "Eastern Theater of the American Civil War"
}