{
 "id": "449582",
 "text": "County Armagh is one of six counties that together make up Northern Ireland. It is also one of the 32 counties of Ireland. County Armagh lies in the north- east of the island of Ireland. The county is 1,326 km²County Armagh, Land Area big. About 174,792 people live there. The county is named after the city Armagh. The name \"Armagh\" comes from the Irish word Ard meaning \"high place\" and Macha. In stories, Macha is a goddess of Ireland. Armagh was the main town for the historic Ulaid kings of Ulster. ==Landscape== The landscape has hills in the south. Slieve Gullion is the highest mountain. It goes down from there and becomes flatter with small hills called drumlins in the middle and the west. It is fairly flat in the north, and is at sea level at Lough Neagh. There are a few small islands in the lake. ==History== Ancient Armagh was the territory of the Ulaid people before the year 400. The Red Branch ruled the county. Their capital was a fort called Emain Macha near Armagh. The Red Branch play an important role in the stories in the Ulster Cycle. They are also part of the story the \"Cattle Raid of Cooley\". Armagh was the Roman Catholic home of Saint Patrick. ===The Troubles=== South Armagh is mostly nationalist. In the late 20th century, a significant minority of its inhabitants supported the IRA. ==Main towns== * Newry (though part of the settlement is in County Down) * Craigavon, includes: ** Lurgan ** Portadown * Armagh (has city status) * Bessbrook * Keady * Richhill * Tandragee ==Baronies== Baronies are old divisions of Ireland. Below is a list of the baronies in County Armagh. * Armagh * Fews Lower * Fews Upper * Oneilland East * Oneilland West * Orior Lower * Orior Upper * Tiranny ==Transport== Two major highways run through County Armagh. The M1 links Belfast to Dungannon in the north of the county. The A1/N1 from Belfast to Dublin runs in the far south east. Armagh has lots of local roads connecting the towns and villages. There used to be many railways in County Armagh, but there are only a few stations left. Ulsterbus is the bus company that runs most public transport in the county. It includes buses from most towns to Belfast. Railway companies Northern Ireland Railways and Iarnród Éireann together run the Enterprise service. It has trains that go to Dublin (about an hour) and Belfast (about forty minutes) a few times daily. There are many more Northern Ireland Railways trains into Belfast and Bangor. ==Inland waterways== The Ulster Canal and the Newry Canal run through County Armagh. The canals are not fully open for boats to use. ==People associated with County Armagh== * Frank Aiken (1898–1983), born in County Armagh, Irish Republican, Irish Minister for External Affairs, Tánaiste * Saint Benignus of Armagh, (d. 467), first rector of the Cathedral School of Armagh and Bishop of Armagh * Brian Boru (941–1014), buried in Armagh City, victor of Clontarf, High King of Ireland * Arthur Hunter Palmer (1819–1898), born in County Armagh, 5th Premier of Queensland * Seamus Mallon (1936– ), born in County Armagh, first deputy First Minister of Northern Ireland * Colin Morgan (1986– ), born in County Armagh, Actor * Paul Muldoon (1951- ), born in County Armagh, Poet, winner of the Pulitzer Prize for Poetry and the T. S. Eliot Prize * Tomás Ó Fiaich (1923–1990), born in County Armagh, Cardinal (Catholicism), Catholic Archbishop of Armagh and Primate of All Ireland 1977–90 * Eunan O'Neill (1982), born in County Armagh, journalist, Russia Today * Sir William Olpherts (1822–1902), born in County Armagh, soldier and recipient of the Victoria Cross * Ian Paisley (1926– ), born in County Armagh, clergyman, politician, second First Minister of Northern Ireland * Saint Patrick (fifth century), first Bishop of Armagh * George William Russell 'Æ' (1867–1919), born in County Armagh, author, critic and painter * Robert Stewart, Viscount Castlereagh (1759–1822), educated in The Royal School, Armagh. British Foreign Secretary, Secretary for War, Leader of the United Kingdom House of Commons and Chief Secretary for Ireland * Colin Turkington (1982), born in Portadown, County Armagh, professional racing driver and 2009 British Touring Car champion. * James Ussher (1581–1656), Church of Ireland Archbishop of Armagh and Primate of All Ireland 1625–1656 * Richard Wellesley, 1st Marquess Wellesley (1760–1842), educated in The Royal School, Armagh. Lord Lieutenant of Ireland and Governor General of India ==Places of interest== * Armagh Observatory, founded in 1790 & Armagh Planetarium, a modern working astronomical research institute with a rich heritage * Armagh Public Library on Abbey Street in Armagh City * Navan Fort, now a tree ring mound. It once housed the rulers of Ulster. It now has a modern interactive visitor centre * Saint Patrick's Church of Ireland Cathederal which was founded in 445. * Saint Patrick's Roman Catholic Cathederal * Gosford Castle, 19th-century castle with a lot of grounds * Slieve Gullion, extinct volcano with crater lake. It has the highest burial cairn in Ireland. 9 counties can be seen from the top. There is also a visitor centre. ==References== ==Other websites== * * Armagh and Down tourism * Armagh history * Public Records Office of Northern Ireland – Irish Administrative Divisions * Triskelle – County Armagh * Notes on County Armagh * Selected Monuments in County Armagh * Poyntzpass Presbyterian Church, Armagh",
 "title": "County Armagh"
}