{
 "id": "44964",
 "text": "A stoat (Mustela erminea) is a small mammal of the family Mustelidae. It is also called a short tailed weasel. It is bigger than a weasel. Stoats in their white winter coat are also called ermines. They can grow to be as long as 30 centimeters (a foot long). They eat other small animals and bird eggs, and can kill animals bigger than themselves. They can also store food for later. They kill by biting the neck of their prey at the place where the skull attaches to the rest of the body. ==Description== Stoats are long and thin with short legs, small ears, and thick warm fur. Their fur is brown, but changes to white in the winter. The tail has a black tip all year round. The whiskers are brown or white in colour, and very long. Stoats have a good sense of smell, and they hunt using smell. They do not see color as well as humans, but they can see better at night. Males are 187–325 mm (7.4–12.8 in) in length. Females are 170–270 mm (6.7–10.6 in) in length. The tail is 75–120 mm (3.0–4.7 in) in males. The tail is 65–106 mm (2.6–4.2 in) in females. Males weigh 258 grams (9.1 oz). Females weigh less than 180 grams (6.3 oz). ==Behavior== Stoats are largely crepuscular, meaning that they are most active during dawn and dusk, though they spread out their activity in short bursts during the day and night as well. Stoats can spray a bad smelling fluid when they are scared. They are also good at climbing trees. The stoat does not dig its own burrows. Instead it uses the burrows of the rodents it kills. The skins and underfur of the rodents it kills are used to line the nest chamber. The nest chamber is sometimes found in places that doesn't look like a good place to live in, such as among logs piled against the walls of houses. The stoat also lives in old and rotting stumps, under tree roots, in heaps of brushwood, haystacks, in bog hummocks, in the cracks of empty mud buildings, in rock piles, rock clefts, and even in magpie nests. ==Feeding== The stoat lives by hunting. It usually hunts large rodents and lagomorphs. It will attack animals much larger than itself. In Russia, its prey includes rodents and lagomorphs such as European water voles, common hamsters, pikas. It overpowers them in their burrows. It also eats small birds, fish, and shrews and, more rarely, amphibians, lizards, and insects. In Great Britain, European rabbits are an important source of food. Stoats that live in Great Britain rarely kill shrews, rats, squirrels and water voles, though rats may be an important source of food locally. In Ireland, shrews and rats are frequently eaten. In North America, where the ecological niche for rat and rabbit sized prey is taken by the larger long- tailed weasel, the stoat hunts mice, voles, shrews, and young cottontail. In New Zealand, the stoat mostly feeds on birds, including the rare kiwi, kaka, mohua, yellow-crowned parakeet, and New Zealand dotterel. ==Distribution and Habitat== Stoats live in temperate, subarctic northern areas. They live in parts of Europe, Asia, and North America. They were brought to New Zealand to kill rabbits. Unfortunately, they also killed many of the native New Zealand birds. The stoat lives throughout North America, Europe, and Asia, from Greenland and the Canadian and Siberian Arctic islands. Stoats in North America are found throughout Alaska and Canada south through most of the northern United States to central California, northern Arizona, northern New Mexico, Iowa, the Great Lakes region, New England, and Pennsylvania, but are absent from most of the Great Plains, and the Southeastern United States. The stoat in Europe is found as far south as in Portugal. It also lives in most islands with the except Iceland, Svalbard, the Mediterranean islands and some small North Atlantic islands. In Japan, it is lives in the central mountains (northern and central Japan Alps) to northern part of Honshu (mainly above 1,200 m) and Hokkaidō. ==Reproduction== Stoats live alone and are territorial. The gestation period is usually around 300 days. After mating in the summer, the kits will not be born until the following spring. Female stoats spend almost all their lives either pregnant or in heat.They mate once a year and have several babies, which are called kits. The kits may not develop for 8–9 months after the female becomes pregnant. When weather conditions are good and there is plenty of food, the kits begin to grow and are born within a month. The males do not help raise the babies. Males become sexually mature at 10–11 months. Females become sexually mature at the age of 2–3 weeks whilst still blind, deaf and hairless. ==References== Category:Mustelids Category:Mammals of Asia Category:Mammals of Europe Category:Mammals of North America",
 "title": "Stoat"
}