{
 "id": "45001",
 "text": "GoldenEye 007 is a first-person shooter video game on the Nintendo 64. Its story is based on the 1995 movie GoldenEye. The main character of the game is James Bond, Agent 007. It is a 3D first person shooter style game. Its multiplayer mode is also very popular. The game has received a very positive reception and is often said to be one of the best games ever made. In November 2010, a remake of the game was released for the Nintendo Wii and Nintendo DS. However, it was not received as positively and it was criticized. == Levels == There are 20 levels in the game, which are separated into 9 missions. Some missions only have one level while others have many. There are also 2 bonus missions. * Mission 1 : Arkhangelsk – Bond is sent to help fellow agent Alec Trevelyan (Agent 006) in a secret laboratory. * Mission 2 : Severnaya - Bond must sneak into a bunker and steal a key for the satellite. * Mission 3 : Kyrgyzstan - Bond is sent to destroy a Silo and prevent rockets from taking off. * Mission 4 : Monte Carlo - Bond goes aboard a Frigate to rescue hostages and plant a tracker on an enemy helicopter. * Mission 5 : Severnaya - Bond returns to the same place as Mission 2 and rescues the heroine, Natalya. * Mission 6 : St Petersburg - Bond learns that 006 is the leader of Janus, a crime group that is using the satellite for evil. Bond is later arrested, but breaks out and chases 006. * Mission 7 : Cuba - Bond follows 006 to Cuba and fights in a final showdown with his former friend. *Mission 8 : Teotihuacán - Bond goes to an ancient Aztec temple to blow up a secret rocket facility. It uses designs from the 1979 Bond movie Moonraker. *Mission 9 : el-Saghira - Bond visits a temple in Egypt to track down the evil Baron Samedi, a character from the 1973 Bond movie Live and Let Die. The game is one of the world's most highly acclaimed first-person shooter games and has been rated highly on many lists. Screwattack.com for instance put it first on its list of top ten first- person shooter games, taking the title away from games like Halo and Half Life 2. Category:1997 video games Category:James Bond Category:Rare (company) games Category:Cold War video games Category:First-person shooters Category:Multiplayer and single-player video games Category:Nintendo 64 games Category:Nintendo video games Category:Stealth video games Category:Video games based on movies Category:Video games set in the Soviet Union Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "GoldenEye 007 (1997 video game)"
}