{
 "id": "450075",
 "text": "The District of Luxembourg () was one of three districts of the Grand Duchy of Luxembourg. Its capital was Luxembourg City. In 2015, the districts were abolished. The district is to the southwest of the country. It was the second largest district of the three districts, with an area of . It was the district with more people living in it with a population, in 2014, of 401,041 inhabitants and a population density of inhabitants/km². ==History== When the districts were created on 24 February 1843, Luxembourg was one of the three of the country. On 30 May 1857, the Mersch canton was taken from the Luxembourg district to made part of the new district of Mersch. on 4 May 1867, the new district was abolished and the Mersch canton was made again a part of the Luxembourg district. On 2012, the communes of Bascharage and Clemency were combined to make the new commune of Käerjeng. So the number of communes changed from 47 to 46. ==Geography== The district of Luxembourg is bordered to the north by the Diekirch district, to the east by the Grevenmacher district, to the south by France (the Meurthe-et-Moselle and Moselle départements) and to the west by Belgium (the Belgian province of Luxembourg). ==Composition== The Luxembourg district has 4 cantons and 46 communes. Canton Capital Area (km²) Population (2014) Density (inhab./km²) Communes 1 Capellen Capellen 199.21 43,607 10 2 Esch-sur-Alzette Esch-sur-Alzette 242.77 160,960 14 3 Luxembourg Luxembourg 238.46 167,199 11 3 Mersch Mersch 223.90 29,275 11 ===Cantons and their communes=== #Capellen ##Dippach ##Garnich ##Hobscheid ##Käerjeng ##Kehlen ##Koerich ##Kopstal ##Mamer ##Septfontaines ##Steinfort #Esch-sur-Alzette ##Bettembourg ##Differdange ##Dudelange ##Esch-sur-Alzette ##Frisange ##Kayl ##Leudelange ##Mondercange ##Pétange ##Reckange-sur-Mess ##Roeser ##Rumelange ##Sanem ##Schifflange #Luxembourg ##Bertrange ##Contern ##Hesperange ##Luxembourg ##Niederanven ##Sandweiler ##Schuttrange ##Steinsel ##Strassen ##Walferdange ##Weiler-la-Tour #Mersch ##Bissen ##Boevange-sur-Attert ##Colmar-Berg ##Fischbach ##Heffingen ##Larochette ##Lintgen ##Lorentzweiler ##Mersch ##Nommern ##Tuntange ==References== Category:Districts of Luxembourg",
 "title": "Luxembourg (district)"
}