{
 "id": "450175",
 "text": "Louise Françoise de Bourbon (1 June 1673 – 16 June 1743) was an illegitimate daughter of King Louis XIV of France and his famous mistress Madame de Montespan. Her marriage to a prince of the blood in 1685, caused great scandal and she had an open rivalry with her older sister Françoise Marie, Duchess of Orléans. She was also responsible for the construction of the Palais Bourbon in Paris which is today used by the French National government. She had a very close relationship with her older half-brother the Grand Dauphin. Several of her children were thought to be illegitimate as, for a majority of her marriage she was having an affair with the Prince of Conti. Even when her husband succeeded to the Condé title the young princess was always known as Madame la Duchesse or the Duchess of Bourbon. ==Biography== Louise Françoise was born on 1 June 1673, at Tournai. She was the daughter of King Louis XIV of France and his mistress, Madame de Montespan. On 25 May 1685, at the age of eleven, Louise Françoise was married to Louis de Bourbon, Duke of Bourbon, a distant sixteen-year old cousin of her father, King Louis XIV of France. The king gave his daughter a large marriage dowry of one million French livres (old French currency) upon her marriage. Louise Françoise and her husband eventually had nine children. All of them survived into adulthood. Her marriage was generally not happy, and her and her husband both had love affairs. Louise Françoise was very close to her half-brother Louis, Grand Dauphin and was apart of the cabale de Meudon, a group centred on her half- brother. Louise Françoise died on 16 June 1743, at her own home, the Palais Bourbon, in Paris, France, at the age of seventy. Her husband, Louis de Bourbon, died before her in 1710. ==Images== File:François de Troy - Louise Françoise de Bourbon, mademoiselle de Nantes - Google Art Project.jpg|Portrait of Louise Françoise, by François de Troy. File:The sisters Mademoiselle de Blois and Mademoiselle de Nantes by Philippe Vignon.jpg|Painting of Louise Françoise (on the right) and her younger sister Françoise Marie de Bourbon (on the left), by Philippe Vignon. File:Gobert - Louise-Françoise de Bourbon as a widow - Mount Stewart.jpg|Portrait of Louise Françoise, by Pierre Gobert. File:Gobert - The Duchess of Bourbon with her daughter \"Mademoiselle de Vermandois\" - Alte Pinakothek.jpg|Portrait of Louise Françoise (on the left) with her daughter Henriette Louise de Bourbon, by Pierre Gobert. ==Titles, styles, honours and arms== ===Titles and styles=== *1 June 1673 - 19 December 1673 unnamed child; *19 December 1673 - 25 May 1685 Her Highness Louise Françoise de Bourbon, Légitimée de France, Mademoiselle de Nantes *25 May 1685 - 1 April 1709 Her Serene Highness the Duchess of Bourbon (Madame la duchesse de Bourbon) *1 April 1709 - 4 March 1710 Her Serene Highness the Princess of Condé (Madame la princesse de Condé) *4 March 1710 - 16 June 1743 Her Serene Highness the Dowager Princess of Condé (Madame la princesse de Condé douairière) :Note: Even while Princess of Condé, Louise Françoise was still known as the Duchess of Bourbon. ==References== Category:1673 births Category:1743 deaths Category:House of Bourbon (Condé branch)",
 "title": "Louise Françoise de Bourbon, Duchess of Bourbon"
}