{
 "id": "450137",
 "text": "ECW CyberSlam was a professional wrestling event and pay-per-view that was produced by Extreme Championship Wrestling (ECW). It ran from 1996 to 2000. ==Results== ===1996=== CyberSlam 1996 took place on February 17, 1996 at the ECW Arena in Philadelphia, Pennsylvania. It was the first CyberSlam event that ECW produced. # Matches Stipulations Times 1 The Bad Crew (#1 and #2) and Judge Dredd defeated Dino Sendoff, Don E. Allen and Dirtbike Kid Six-Man Tag Team match 2:03 2 Spiro Greco defeated El Puerto Riqueño Singles match 4:26 3 Taz defeated Joel Hartgood Singles match 1:53 4 Bubba Ray Dudley defeated Mr. Hughes Singles match 0:35 5 Don Bruise and Ron Bruise defeated The Headhunters (A and B) Tag team match 3:54 6 JT Smith defeated Axl Rotten Singles match 6:12 7 Francine and The Pitbulls (#1 and #2) defeated Stevie Richards and The Eliminators (Perry Saturn and John Kronus) Triple Dog Collar match 15:00 8 2 Cold Scorpio (c) fought Sabu to a draw Singles match for the ECW World Television Championship 30:00 9 Shane Douglas defeated Cactus Jack Singles match 15:40 10 Raven (c) defeated The Sandman Singles match for the ECW World Heavyweight Championship 10:18 (c) – refers to the champion(s) heading into the match ===1997=== CyberSlam 1997 were two events that took place on February 21, 1997 and on February 22, 1997 at both the Lost Battalion Hall in Queens, New York and the ECW Arena in Philadelphia, Pennsylvania. It was the second CyberSlam event that ECW produced. The event featured two events which were held at February 21 and February 22. The first event happened on February 21, 1997 in Lost Battalion Hall in Queens, New York # Results Stipulations Times 1 Balls Mahoney defeated Chris Chetti Singles match 5:58 2 Brian Lee and Chris Candido defeated The Pitbulls (Pitbull#1 and Pitbull#2) Tag Team match 10:20 3 Buh Buh Ray Dudley defeated Spike Dudley Singles match 10:43 4 The Sandman and Tommy Dreamer defeated Raven and Stevie Richards Tag Team match 14:15 5 The Gangstas (New Jack and Mustafa) defeated Axl Rotten and D-Von Dudley Tag Team match 13:14 6 Taz defeated Little Guido by submission Singles match 4:04 7 The Eliminators (Perry Saturn and John Kronus) (c) defeated Rob Van Dam and Sabu Tag Team match for the ECW Tag Team Championship 21:15 The second event happened on February 22, 1997 in ECW Arena in Philadelphia, Pennsylvania. # Results Stipulations Times 1 The Eliminators (Perry Saturn and John Kronus) (c) defeated Rob Van Dam and Sabu Tables & Ladders match for the ECW Tag Team Championship 20:40 2 Chris Chetti defeated Little Guido Singles match 5:46 3 Stevie Richards defeated Balls Mahoney Singles match 12:26 4 Axl Rotten defeated Spike Dudley Singles match 4:06 5 The Dudley Boyz (Bubba Ray Dudley and D-Von Dudley) defeated The Gangstas (New Jack and Mustapha Saed) Tag Team match 14:22 6 Taz defeated Tracy Smothers Singles match 3:21 7 Raven and Brian Lee defeated Terry Funk and Tommy Dreamer Tag Team match 18:53 8 Sabu defeated Chris Candido Singles match 18:26 ===1998=== CyberSlam 1998 took place on February 21, 1998 at the ECW Arena in Philadelphia, Pennsylvania. It was the third CyberSlam event that ECW produced. The event started with a ten- bell salute to honor Louie Spicolli who had died six days earlier from an accidental drug overdose. # Matches Stipulations Times 1 Jerry Lynn defeated Danny Doring Singles match 10:00 2 Al Snow defeated Tracy Smothers Singles match 22:07 3 Chris Chetti defeated Doug Furnas Singles match 4:07 4 Lance Storm defeated Chris Candido Singles match 8:46 5 Taz (c) defeated Brakkus Singles match for the ECW World Television Championship 5:37 6 Justin Credible defeated Tommy Dreamer First Blood match 11:11 7 The Sandman, Axl Rotten and Balls Mahoney defeated Spike Dudley, New Jack and John Kronus and Bubba Ray Dudley, D-Von Dudley and Big Dick Dudley Nine-Man Tag Team match 18:25 8 Shane Douglas and Bam Bam Bigelow defeated Rob Van Dam and Sabu Tag team match 23:13 (c) – refers to the champion(s) heading into the match ===1999=== CyberSlam 1999 took place on April 3, 1999 at the ECW Arena in Philadelphia, Pennsylvania. It was the fourth CyberSlam event that ECW produced. # Matches Stipulations Times 1 Jerry Lynn defeated Yoshihiro Tajiri Singles match 8:51 2 Nova defeated Rod Price Tag team match 4:22 3 Super Crazy defeated Mosco de la Merced Singles match 9:50 4 Taka Michinoku defeated Papi Chulo Singles match 6:42 5 Rob Van Dam (c) defeated 2 Cold Scorpio Singles match for the ECW World Television Championship 16:42 6 Taz (c) defeated Chris Candido Singles match for the ECW World Heavyweight Championship 11:46 7 Shane Douglas defeated Justin Credible Singles match 14:48 8 Bubba Ray Dudley, D-Von Dudley and Mustapha Saed defeated New Jack, Axl Rotten and Balls Mahoney Ultimate Jeopardy match 14:22 (c) – refers to the champion(s) heading into the match ===2000=== CyberSlam 2000 took place on April 22, 2000 at the ECW Arena in Philadelphia, Pennsylvania. It was the fifth and final CyberSlam event that ECW produced. # Matches Stipulations Times 1 Masato Tanaka defeated 2 Cold Scorpio Singles match 07:50 2 Lance Storm and Dawn Marie defeated Nova and Jazz Mixed Tag Team match 09:05 3 Little Guido defeated Super Crazy and Kid Kash Three-Way Dance match 11:49 4 The New Dangerous Alliance (C.W. Anderson and Bill Wiles) defeated Danny Doring and Roadkill Tag team match 11:14 5 Balls Mahoney and New Jack defeated Da Baldies (DeVito and Angel) Tag Team match 10:40 6 Steve Corino defeated Dusty Rhodes Singles match 12:23 7 Rhino defeated Yoshihiro Tajiri (c) Singles match for the ECW World Television Championship 05:00 8 Tommy Dreamer defeated Taz (c) Singles match for the ECW World Heavyweight Championship 13:31 9 Justin Credible defeated Tommy Dreamer (c) Singles match for the ECW World Heavyweight Championship 06:42 (c) – refers to the champion(s) heading into the match ==Related pages== *Extreme Championship Wrestling == References == Category:Extreme Championship Wrestling Category:1996 establishments Category:2000 disestablishments",
 "title": "ECW CyberSlam"
}