{
 "id": "450439",
 "text": "The spotted bass (Micropterus punctulatus) also called the Kentucky Bass, is a freshwater game fish in the sunfish family. It is a species of black bass native to the lower and central Mississippi River basin in North America. It has been introduced into other U.S. states as far west as California. It has also been introduced into other countries. The spotted bass is often confused with the largemouth bass because it has the same coloring. But it is distinguished by having a smaller mouth than the largemouth. In size it is smaller than either the largemouth or smallmouth bass. In 1956 it became the official game fish of Kentucky. From that time on it was popularly called the Kentucky bass.Arthur Lander, A Fishing Guide to Kentucky's Major Lakes (Lexington: University Press of Kentucky, 2010), p. 31 == Subspecies == Currently there are three recognized subspecies of spotted bass. * The Alabama spotted bass (Micropterus p. henshalli). They are found mainly in Alabama, Mississippi and Georgia.Keith A. Jones, Knowing Bass: The Scientific Approach to Catching More Fish (Guilford, CT: Lyons Press, 2005), p. 7 * The northern spotted bass (Micropterus punctulatus punctulatus). This is the most common type. * The Wichita spotted bass (Micropterus p. wichitae). They are found in the Wichita Mountains of Oklahoma.Peter B. Moyle, Inland Fishes of California (Berkeley: University of California Press, 2002), p. 405 In addition there are reports of hybrid spotted bass occurring naturally.Ken Schultz, Ken Schultz's Field Guide to Freshwater Fish (Hoboken, NJ: Wiley, 2004), p. 52 This is between largemouth and spotted bass—the offspring of which are difficult to identify as either species. == Physical description == The spotted bass is a fish with a slender body marked by black blotches on its side. As the fish matures these become an irregular band. Their color ranges from a light green to light brown.Ken Schultz, Ken Schultz's Field Guide to Freshwater Fish (Hoboken, NJ: Wiley, 2004), p. 51 Unlike the largemouth, the tongue of the spotted bass has a patch of teeth. Their gill covers also have a large dark spot on them. The Alabama spotted bass is distinguished by a dark spot on the tail in addition to the one on each gill cover. The Northern spotted bass has a tail spot, but the gill spot is not as distinct. The average size is four to five pounds. The IFGA world record is 10 pounds 4 ounces. == Habitat == Unlike the largemouth bass, the spotted bass seems to like current (moving water).Barry St.Clair, Fishing Texas: an angler's guide to the area's prime fishing spots (Guilford, CT: Lyons Press, 2012), p. 11 They can tolerate warmer water than largemouths and do well in streams and rivers. They can also thrive in southern reservoirs that have gravel and rock bottoms. Like it's better known cousins, the spotted bass is carnivorous. It will eat prey from the bottom to the surface of the water.Centrarchid Fishes: Diversity, Biology and Conservation, eds. Steven Cooke; David P. Philipp (Chichester, U.K.: Wiley-Blackwell, 2009), p. 453 If available it will feed primarily on crayfish. It also preys on minnows, catfish, and insects. At spawning the male makes from one to four nests and defends them until the females lay their eggs. Females lay fewer eggs than largemouth or smallmouth bass. But once the eggs are deposited in the nest, she will remain to help guard the nest for another day before leaving.Homer Circle, Bass Wisdom (New York, NY : Lyons Press, 2000), p. 3 The male then guards the nest(s) against Bluegills and other raiding fish. They continue to guard the fry after hatching. Unlike other black basses, spotted bass tend to group together and form schools. They are sometimes seen chasing schools of shad in open water. == Angling == Many spotted bass are caught by accident by fishermen seeking largemouth or smallmouth bass.Keith Sutton, 'Sizzling Spots', Field & Stream, Vol. XCVI, No. 3 (July, 1991), pp. 53–54 They are found in streams and rivers like smallmouth, although they cannot tolerate water as cold. They also cannot tolerate the low oxygen saturation in warm water that largemouths can. Otherwise they live in the same waters. The spotted bass is a strong fighter, once hooked, much like the smallmouth.Dave Whitlock, L. L. Bean Fly Fishing for Bass Handbook (Guilford, CT: Lyons Press, 2000), p. 149 Unlike either of their cousins they do not tend to jump from the water. The same lures that attract other black bass also attract spotted bass. But their strong preference for crayfish makes any lure that resembles a crayfish very effective. In mid-summer, fishing in reservoirs, spotted bass can be as deep as 100 feet. Fishermen need to get their lures deep enough to attract the spotted bass. == References == Category:Centrarchidae Category:Edible fish Category:Freshwater fish",
 "title": "Spotted bass"
}