{
 "id": "450459",
 "text": "Dean Simon (born August 4, 1960) is an American retired professional wrestler. He was best known under the ring name Dean Malenko. Malenko is currently signed to the All Elite Wrestling (AEW) as a senior producer. Malenko was known by the nicknames \"The Man of 1,000 Holds\" and \"The Iceman\" due to his technical wrestling ability and his cold and calculating demeanor. During his career, Malenko competed in Extreme Championship Wrestling (ECW), World Championship Wrestling (WCW), and in the World Wrestling Federation (WWF). Although he was never able to win a World Championship, he was able to win many other different championships during his run. On May 24, 2019, Malenko joined All Elite Wrestling (AEW) as a senior producer. ==Personal life== Malenko is Jewish, is married to his wife and has 3 children. In 2019, Simon revealed that he had Parkinson's disease. ==Championships== *Extreme Championship Wrestling **ECW World Television Championship (two times) **ECW World Tag Team Championship (one time) (with Chris Benoit) *International Championship Wrestling Alliance **ICWA Light Heavyweight Championship (one time) *Pro Wrestling Illustrated **He was ranked #1 of the top 500 singles wrestlers in the PWI 500 in 1997. **He was ranked #161by the PWI in the PWI Years in 2003. *Suncoast Pro Wrestling **Suncoast Pro Wrestling Southern Heavyweight Championship (one time) *World Championship Wrestling **WCW Cruiserweight Championship (four times) **WCW United States Heavyweight Championship (one time) **WCW World Tag Team Championship (one time) (with Chris Benoit) *World Wrestling Federation **WWF Light Heavyweight Championship (two times) *Wrestling Observer Newsletter awards **Feud of the Year (1995) (vs. Eddie Guerrero) **Best Technical Wrestler (1996, 1997) ==References== ==Other websites== * Category:1960 births Category:Living people Category:All Elite Wrestling people Category:American professional wrestlers Category:Jewish American sportspeople Category:People with Parkinson's disease Category:Professional wrestling executives Category:Professional wrestling referees Category:Sportspeople from New Jersey",
 "title": "Dean Malenko"
}