{
 "id": "450827",
 "text": "Bergmann's rule is an ecogeographic principle. It says that, within a widely distributed group of animals, the larger ones are found in colder environments, and the smaller ones are found in warmer regions. So, for example, with bears the largest member is the polar bear, and the smallest members are found in subtropical areas (panda). The largest tiger is the Siberian tiger. Large mammals of the late ice age were in general larger than their descendants today. The rule is named after nineteenth-century German biologist Carl Bergmann, who described the pattern in 1847, though he was not the first to notice it. Bergmann's rule appears to hold true for many mammals and birds, but there are exceptions.Meiri S. & Dayan T. 2003. On the validity of Bergmann’s rule. J. Biogeography 30, 331–351.Ashton K.G Tracy M.C. & de Queiroz A. 2000. Is Bergmann's rule valid for mammals? The American Naturalist, 156, 390–415.Millien V. et al 2006. Ecotypic variation in the context of global climate change: revisiting the rules. Ecology Letters 9: 853–869.Freckleton R.P.; Harvey, P.H. & Pagel M. 2003. Bergmann's rule and body size in mammals. American Naturalist 161 (5): 821–825. Although originally put in terms of species, it seems to apply to populations within a species. Bergmann's rule is most often applied to mammals and birds which are endotherms, but some researchers have also found evidence for the rule in studies of ectothermic species.Olalla-Tárraga, Miguel Á; Rodríguez M.Á. & Hawkins B.A. 2006. Broad-scale patterns of body size in squamate reptiles of Europe and North America. Journal of Biogeography 33 (5): 781–793. Timofeev S.F. 2001. \"Bergmann’s principle and deep-water gigantism in marine crustaceans. Biology Bulletin of the Russian Academy of Sciences. 28 (6): 646–650. In addition to being a general pattern across space, Bergmann’s rule has been reported in extinct populations from the fossil record.Smith F.A; Betancourt J.L. & Brown J.H. 1995. Evolution of body size in the woodrat over the past 25 000 years of climate change. Science 270 (5244): 2012–2014. Huey R.B. et al 2000. Rapid evolution of a geographic cline in size in an introduced fly. Science 287 (5451): 308–309. Hunt G. & Roy K. 2006. Climate change, body size evolution, and Cope's rule in deep-sea ostracodes. Proceedings of the National Academy of Sciences of the USA 103 (5): 1347–1352. In particular, reversible dwarfing of mammals happened during two extremely warm but rather brief times in the Palaeogene.Secord R. et al 2012. \"Evolution of the earliest horses driven by climate change in the Paleocene-Eocene Thermal Maximum. Science 335 (6071): 959–962. Erickson J. 2013. Global warming led to dwarfism in mammals twice. University of Michigan. These were the warmest periods in the whole Cainozoic, and are known as the Paleocene–Eocene thermal maximum, and the Eocene Thermal Maximum 2. == References == Category:Zoology",
 "title": "Bergmann's rule"
}