{
 "id": "450818",
 "text": "Renee Paquette (born September 19, 1985) is a Canadian sports broadcaster. She is currently working with All Elite Wrestling (AEW), for which she does interviews and occasional commentary, using her birth name. Previously, she had worked for WWE under the ring name Renee Young, performing the same duties. Paquette first worked as a sportscaster for The Score, known now as Sportsnet 360. ==Early life== She was born in Ajax, Ontario. She grew up in both Ajax and Whitby, Ontario. She grew up as a WWE fan. When she was asked about it, she answered: \"I was. I attended a few events and WrestleMania VI. My dad is a concert promoter and he’d get me into the events. I remember being backstage and meeting \"Stone Cold\" Steve Austin, Triple H, Chyna and Trish Stratus as a kid, so it’s really funny to me that I ended up here. I went on a different path than wanting to become a WWE Superstar. I have a broadcasting and performance background.\" ==Career== ===The Score (2009–2012)=== She started her career by working with The Score. While there, she worked on a programme called Right After Wrestling, later renamed Aftermath with Arda Ocal and former WWE referee Jimmy Korderas. ===WWE (2012–2020)=== In October 2012, Paquette signed with the WWE and was renamed under the ring name Renee Young. She made her on-screen debut on the March 29, 2013 episode of SmackDown where she interviewed Randy Orton, Big Show and Sheamus. She made her commentary debut on NXT in September 2013. She was also a presenter on The JBL and Cole Show and hosts WWE Vintage Collection alongside WWE Hall of Famer Mean Gene Okerlund. Young left WWE in 2020 following that year's SummerSlam. Young explained that she left WWE because of the cancelation of WWE Backstage and that she felt that she had accomplished everything in WWE. === Post-WWE work and AEW (2021–) === In 2021, she made a one-off WWE appearance shortly after creating a podcast and an accompanying YouTube channel, and also started a show on the Sirius XM satellite radio platform. On October 12, 2022, Tony Khan confirmed via his social media account that Paquette had signed with All Elite Wrestling (AEW). She made her debut the same night on Dynamite. == Personal life == In 2013, Paquette began dating Jonathan Good, then performing in WWE as Dean Ambrose, and now known in AEW as Jon Moxley. The two lived near Las Vegas, where they were married in a ceremony at their home in the early hours of April 9, 2017. Their daughter Nora was born on June 13, 2021. A few months later, they settled in Good's hometown of Cincinnati to be closer to both his family and Paquette's family in her hometown of Toronto. ==Awards== *WWE **Slammy Award for Favorite Web Show of the Year (2013) (with Michael Cole and John Bradshaw Layfield for The JBL and Cole Show) ==References== ==Other websites== * * Category:1985 births Category:Living people Category:All Elite Wrestling people Category:Canadian television presenters Category:Professional wrestling announcers Category:Sportspeople from Ontario",
 "title": "Renee Paquette"
}