{
 "id": "450903",
 "text": "Dementia praecox is a term in Latin which Emil Kraepelin invented and contrasted with a mental illness called manic-depressive insanity Stephan Heckers and Kenneth S. Kendler The evolution of Kraepelin's nosological principles World Psychiatry. 2020 Oct; 19(3): 381–388. Published online 2020 Sep 15. doi: 10.1002/wps.20774 which is re-described as Bipolar disorder today.Janusz K. Rybakowski 120th Anniversary of the Kraepelinian Dichotomy of Psychiatric Disorders Curr Psychiatry Rep 21, 65 (2019). https://doi.org/10.1007/s11920-019-1048-6 For Kraepelin and other psychiatrists, people diagnosed with manic-depressive insanity often had episodes in which they seemed normal, while people with dementia praecox did not. Dementia is a mental illness which mostly occurs in old people. ==History== Morel first describes as a term \"démence précoce\" (the words are French: in English précoce is translated as precocious - meaning early in age: young) in his work of 1852 M. Morel pp.37, 38, 361 of Études cliniques: traité théorique et pratique des maladies mentales considérées dans leur nature, leur traitement, et dans leur rapport avec la médecine légale des aliénés, Volume 1 Grimblot, 1852ADITYANJEE, MD, mrcpsych, YEKEEN A. ADERIBIGBE, MD, FWCAP, D. THEODORIDIS, MD and W. VICTOR R. VIEWEG, MD Dementia praecox to schizophrenia:The first 100 years p.438 Morel used his description to describe the condition of a teenager who retreated from society, and started to show symptoms similar to those of dementia.Adityanjee MD, MRCPSYCH , Yekeen A. Aderibigbe MD, FWCAP , D. Theodoridis MD, W. Victor R. Vieweg MD In: Dementia praecox to schizophrenia: The first 100 years Psychiatry and Clinical Neurosciences Volume 53, Issue 4 August 1999 04 January 2002 https://doi.org/10.1046/j.1440-1819.1999.00584.x Kraepelin used dementia praecox for diseases that were characterized by a destruction of the personality, with damage to the mood and the will.Emil Kraepelin: Psychiatrie. Ein Lehrbuch für Studirende und Aerzte. 8. Auflage. Barth, Leipzig 1913, Band 3, Klinische Psychiatrie, S. 668 The theory of praecox of dementia could not be proved. In 1911, Eugen Bleuler said that dementia praecox was actually schizophrenia. The word schizophrenia was not used widely before 1925. ==References== Category:Dementia Category:Mental illnesses",
 "title": "Dementia praecox"
}