{
 "id": "451352",
 "text": "Gideon Algernon Mantell MRCS FRS (Lewes, 3 February 1790 - London, 10 November 1852) was an English obstetrician, geologist and palaeontologist. Mantell's work on the structure and life of Iguanodon began the scientific study of dinosaurs. In 1822 he was responsible for the discovery (and the eventual identification) of the first fossil teeth, and later much of the skeleton, of Iguanodon.Cadbury, Deborah. 1998. The dinosaur hunters: a story of scientific rivalry and the discovery of the prehistoric world. London: Fourth Estate. . Dean, Dennis R. 1999. Gideon Mantell and the discovery of dinosaurs. Cambridge: Cambridge University Press. Mantell's work on the Cretaceous of southern England was also important. His phrase the \"Age of Reptiles\" was significant. He recognised that reptiles were the dominant life-form in what we now call the Jurassic and Cretaceous periods. Mantell did two things which were most important. He showed that the teeth of Iguanodon meant it must be a herbivore, and its shorter front legs meant it could be bipedal (walk on two legs). This was denied by Richard Owen, who did a good deal to hide Mantell's achievements. The discovery of this fossil is known to be the first evidence of a prehistoric reptilian dinosaur, dating back roughly 130 million years ago. At the end of Mantell's life he suffered terribly from damage to his spine caused by an accident. He took an overdose of opium, which caused his death. It is not known whether he did this deliberately; he took opium to dull the pain.Spokes, Sydney 1927. Gideon Algernon Mantell LLD, FRCS, FRS, surgeon and geologist. London: John Bales & Danielson. == Works by Mantell == Sixty- seven books and memoirs appear in Agassiz and Strickland's Bibliographia Zoologiæ, and forty-eight scientific papers in the Royal Society's Catalogue. *The Fossils of the South Downs. Royal 4to,Royal 4to is a paper size. It produces a fairly large book with wide pages. 42 plates. London 1822. This was his first book, the plates of which were drawn by his wife. Very expensive, at £3. 3/- (three guineas). At double the price, plates were hand-coloured.Price details from trade adverts in other volumes. *Outlines of the natural history of the environs of Lewes. 4to, 24pp, 3pl. Lewes, 1824. *Illustrations of the Geology of Sussex, containing figures and descriptions of the fossils of Tilgate Forest. Royal 4to, 20 plates, £2. 15s. 6d. 1827. *The Geological Age of Reptiles. In Jameson's Edinburgh Philosophical Journal, 1831. *The Geology of the South-East of England. 8vo, with coloured maps, sections, and numerous plates, £1. 1/-. 1833. *Thoughts on a Pebble. 1836. *The Wonders of Geology or, a familiar exposition of geological phenomena: being the substance of a course of lectures delivered at Brighton. 2 vols, London, 1838. Lithographic plates drawn by his wife. Data from 4th ed of 1840: vol 1: 428p, frontis & 4 plates; vol 2: pages 429795 plus appendix, glossary and other material, coloured frontis & 10 coloured pates, most drawn by his wife. Mantell's most extensive work. *The Medals of Creation. 2 vols, 1844. *Thoughts on Animalcules. small 4to, 144p, 12 coloured plates. London: Murray, 1846. 1850 title: The invisible world revealed by the microscope or, thoughts on animalcules. *Geological Excursions round the Isle of Wight and along the adjacent Coast of Dorsetshire. 1847. *Pictorial Atlas of Fossil Remains consisting of coloured Illustration selected from Parkinson's \"Organic Remains of Former World\" and Arti's \"Antediluvian Phytology\". London: Bohn. 1850. *Petrifactions and their teachings. 1851. == References == Category:1790 births Category:1852 deaths Category:English biologists Category:Fellows of the Royal Society Category:British obstetricians",
 "title": "Gideon Mantell"
}