{
 "id": "451492",
 "text": "The Kashmir Valley (Urdu: وادی کشمیر) or Vale of Kashmir is a valley between the Karakoram and the Pir Panjal Range.Landscapes and Landforms of India, ed. Vishwas S Kale (Dordrecht: Springer Verlag, 2014), pp. 125–126 It was formed by the draining of the huge Karena lake during a period of tectonic uplift. The Mughal Emperor Jahangir (1569–1627) called the Kashmir Valley a \"paradise on earth\". It is in the Indian administered state of Jammu and Kashmir. There are 10 districts in this administrative division. The valley is about long and wide. == Natural beauty == It was called Kaspeiria by the ancient Greeks. In classical literature Herodotus calls it Kaspatyrol.P. N. K. Bamzai, Culture and Political History of Kashmir, Vol. 1 (New Delhi: M.D. Publications, 1994), pp. 4–6 Xuanzang, the Chinese monk who visited Kashmir in 631 AD called it Kia-shi-mi-lo. Tibetans called it Khachal, meaning \"snowy mountain\". It is and has been a land of rivers, lakes and wildflowers. The Jhelum River runs the entire length of the valley. The valley is isolated by snow-capped mountains on all sides. Lakes such as Dal Lake and nearby Nagin Lake have hundreds of houseboats. This is from the British Raj era when foreigners were not allowed to buy land here. So they constructed large wooden houseboats to spend the summers in. This, in turn, has led to houseboat hotels. Many are decorated with wood carvings and Victorian era furniture. == Dispute == India and Pakistan fought over the region in 1947–1948. Under the supervision of the United Nations the two agreed on a ceasefire along a line which left the Kashmir Valley under the administration of India. In 1972, India and Pakistan sign a peace treaty called the Simla Agreement. It said that in the future both would settle their differences peacefully. It also renamed the ceasefire line the Line of Control. India claims the entire state including the Kashmir Valley to be part of India. Both the United States and the United Kingdom support turning the Line of Control into the border between India and Pakistan. India seems to go along with this while Pakistan is entirely against it. India has sent large security forces to Kashmir over the years. Kashmir has remained one of the world's most militarized areas. In 1989 there was an armed uprising against Indian control. India blamed Pakistan and accused them of sponsoring terrorism. In 1999 a third conflict arose over the area. Pakistani-backed forces infiltrated into Kashmir. While both armies have fired across the Line of Control, India has not sent troops into Pakistan. Tens of thousands of people have been killed so far in Kashmir. == Status quo == The vast majority of the population in the Kashmir Valley is Muslim. The economy is mainly farming but in recent years tourism has become an important industry. Neither India or Pakistan wants full-scale war (both have nuclear weapons). Neither wants the International sanctions that would surely come if there was a war. == Politics == === Political parties === * Jammu and Kashmir Democratic Freedom Party (JKDFP). They were founded in 1998 and favor self- rule for Jammu and Kashmir. * Jammu and Kashmir People’s Democratic Party (PDP). Founded in 1999 they are a separatist party that wants self-rule for Jammu and Kashmir. * All Parties Hurriyat Conference (APHC). Founded in 1993, they are an alliance of 26 political, social and religious organisations in Kashmir who want to be ruled by Pakistan. * Indian National Congress (INC). They are one of India's two major political parties. In the 2009 general election it formed a coalition majority to run the government. * Bharatiya Janata Party (BJP). They are the second largest party in India and are the Hindu-National party. They were in power from 1998 to 2004. * Jammu and Kashmir National Conference Party (NCP). Founded in 1939 they were the leading party for several decades in Kashmir. They favor self rule. === Militant groups === * Jaish-e-Mohammed. They operate in Kashmir but are based in Pakistan. They want rule by Pakistan. The group has been banned in Pakistan since 2002 but still operate. * Hizb-ul-Mujahideen. They are a militant group operating in Kashmir since 1989. * Lashkar-e-Taiba. They have been responsible for a number of violent attacks including the Red Fort attacks in Delhi in 2000. India believes they are responsible for the 2009 Mumbai attacks. They are largely non-Kashmiri. They operate in Kashmir but are based in Pakistan. ==References== Category:Kashmir",
 "title": "Kashmir Valley"
}