{
 "id": "45155",
 "text": "Onions are plants in the genus, Allium. They are eaten as vegetables. Most species of onions have bulbs that people can eat. They have a strong flavour and a very distinctive smell. Onions have been grown for a long time. They were probably first grown in Ancient Egypt, together with leek and garlic, but maybe earlier. Now, most of the world's cultures eat onions. == Cultivation == Farmers and gardeners can grow onions from seeds or from bulbs. If they plant seeds, they must later pull out most of the young plants so the rest can grow better. This is called 'thinning'. A different way to plant onions is to plant young bulbs. This is faster, but the onions that grow this way are weaker than the onions that started as seeds. == In food == Onions can be eaten in different ways: * Fried sliced or chopped onions are often served on hot dogs. ** Onion rings are sliced, the slices dipped in batter, and deep-fried so the batter is crisp and onion is cooked soft. * Pickled onions are eaten as a relish with chips or with salad. * Raw onions: ** Sliced (cut into flat layers) for hamburgers and sandwiches ** Chopped or minced fine in salads or as garnish on cooked foods * Cooked in soups, stews and curries * Roasted whole alongside roasted meat * Red Onions * == Why onions make eyes water == When cutting an onion, the cells of the onion start to open. Then, some chemicals react. When one chemical floats through the air and reaches your eyes, they sting. There are ways to keep the chemical away. You can: * Cut the onion under water * Keep the onion in the fridge, and cut when it is cold * Leave the root end on until last * Use a sharper knife * Have a fan blowing away from you on the onion * Wear goggles, like for swimming or skiing The ability of plants to deter or limit being eaten is called defence against herbivory. == Gallery == File:Two colors of onions.jpg|Two colours of onion File:YellowOnions.jpg|Yellow Onions File:Onion Flower Head.jpg|Flower head of a yellow onion Category:Root vegetables Category:Allium",
 "title": "Onion"
}