{
 "id": "45179",
 "text": "Logitech (sometimes shortened to Logi) is a Swiss company that makes electronics. They are best known for making peripheral equipment for computers, including webcams, keyboards and computer mice. == History == Logitech was founded in Apples, Switzerland, in 1981 by graduates of Stanford University Daniel Borel and Pierluigi Zappacosta, and former Olivetti engineer Giacomo Marini.Peter Day, BBC . \"165 University Ave: Silicon Valley's 'lucky building' .\" Aug 27, 2010. Retrieved Dec 8, 2016. In 2001, Logitech acquired Labtec for $150 million to expand its range of computer peripherals. In 2007, Logitech licensed Hillcrest Labs' Freespace motion control technology to produce the MX Air Mouse, which allows a user to use natural gestures to control a PC.Techspot 13 July 2007. Logitech's MX Air Mouse with freespace motion control Popular Mechanics 1 October 2009. Logitech's MX Air Cordless Laser Mouse: Best Pointer We've Tried (with Video). In December 2009, Logitech acquired video conferencing equipment maker Lifesize Communications. In July 2011, Logitech acquired the mobile visual communications provider Mirial. In January 2013, Bracken Darrell became Logitech's chief executive officer; then-CEO Guerrino De Luca continued as Logitech's chairman of the board. In January 2016, Logitech spun off the video conferencing equipment maker Lifesize.Sead Fadilpasic, IT Pro Portal. “Lifesize splits from Logitech, continues solo .” Date Jan 15, 2016. Accessed Oct 12, 2019.Heather Clancy, Fortune. “Life After Logitech: Cloud Video Pioneer Sees ‘Torrid’ Growth.” Date Jan 21, 2016. Accessed Oct 12, 2019. In April 2016, Logitech agreed to pay penalty related to accusations that it and some former executives improperly inflated the company's results for its 2011 fiscal year to meet guidance and other accounting violations. On 12 April 2016, Logitech announced that they had agreed to acquire Jaybird, a leader in wireless audio wearables for sports and active lifestyles, for , with an additional earnout of up to based on achievement of growth targets. On 15 September 2016, Logitech announced that they had purchased the Saitek brand and assets from Mad Catz for . On 26 September 2019, Logitech acquired Streamlabs, producer of software and tools for live-streaming, for approximately $89 million. On 29 July 2021, Logitech, in collaboration with choreographer JaQuel Knight, introduced its #Creators4BIPOC initiative under the Logitech For Creators brand. It allows social media creators, particularly BIPOC influencers, to copyright and monetize their online creations by making it possible for choreographers who amplify attention to hits by major artists in the entertainment business to secure copyright of their choreography using Labanotation and earn royalties from it. == Mice == The first mice were made in Switzerland. Now Logitech makes its items all over the world. Selling computer mice made Logitech a big company. In 2008, Logitech made its billionth mouse. == Product lines == As well as webcams, keyboards and mice, Logitech also makes other products such as: * Loudspeakers * Gamepads * Phone accessories * Special TV remotes *Headphones *Programmable remote controls Logitech has also made two computer games: Jelly Jumper and Jelly Battle. == References == == Other websites == * Logitech * Mouse maker reveals how niche players succeed , Swissinfo, 20.4.2006 Category:Technology companies of Switzerland Category:Morges (district)",
 "title": "Logitech"
}