{
 "id": "451856",
 "text": "Marathon Media (becomes Banijay Kids & Family) is a French company in Neuilly- sur-Seine, France Founded in 1990 It does Teens, Childs and Parent Television series in very huge animation industry. ==Information== The shows are dubbed into French (1st official), Japanese (2nd official), English, Thai, German, Dutch, Malay, Arabic, Italian, Romanian, Spanish, Portuguese, and other languages dubbed and shown around the world. Marathon Media Group was acquired by Zodiak Entertainment and renamed Marathon Media. ==Productions== *Enigma *Famous 5: On the Case *Kassai and Leuk *LazyTown (French dubbed version) *Logo Story(Co-Production with Disney Channel and Gaumont Alphanim) *Gormiti *Dork Diaries(Co-Production With Nelvana Nickelodeon Animation Studio Canal J and ProchLight Entertainment) *Marsupilami (not the Disney production) *Martin Mystery(Co-Production with Image Entertainment Corporation, Canal J and YTV) *Mission: Odyssey *Monster Buster Club(Co-Production with Image Entertainment Corporation, TF1, YTV) *The Mozart Band (co-production with BRB International) *The Selfish (co-production with France 3) *Mythic Warriors: Guardians of the Legend *Team GalaxyCo-Production with Image Entertainment Corporation, Canal J, YTV) *The Secret World of Santa Claus *The Amazing Spiez!(Co-Production with Image Entertainment Corporation, TF1, Teletoon, Telifilm Canada and Canal J) *Redakai: Conquer the Kairu *Totally Spies!(co-produced with Image Entertainment Corporation, TF1, Teletoon, The Walt Disney company France, Marathon Images and Zodiak Kids) *LoliRock Zodiak to Launch 'LoliRock' at MIPTV *Rekkit Rabbit(Co-produced with TF1 and Disney XD Europe) *Blake and the aliens(Co-produced with Nickelodeon U.S) *The Mysterys of Alfred Hedgehog (Co - produced with Qubo TVOKids Knowledge Kids and Garmount Animation ==Sources== ==Other websites== * Marathon Media Website Category:French animation studios Category:Neuilly-sur-Seine",
 "title": "Zodiak Kids Studios"
}