{
 "id": "45184",
 "text": "Nihilism is a way of thinking which rejects meaning, concepts, or life. It can be a or a condition. Nihility means \"nothingness\", and \"\" is the Latin word for \"nothing\". Nihilism can mean the belief that values are meaningless ideas. It can also mean the belief that nothing has any meaning or purpose. There are many different beliefs that can be called nihilism. Friedrich Nietzsche was a German thinker who wrote many things about nihilism. What he wrote is often called the most important explanation of nihilism. Nietzsche wrote that nihilism comes from questioning traditional values until they fall apart. This is called \"\". Russian thinkers like Mikhail Bakunin and Dmitry Pisarev inspired a lot of nihilists because they believed this kind of destruction was good. The word \"nihilism\" was also made popular by a Russian novel called Fathers and Sons by Ivan Turgenev. The hero of the story is a nihilist named Bazarov. Russian nihilism inspired many revolutionaries, like Sergei Nechaev and Vladimir Lenin. The Russian author Fyodor Dostoevsky was almost also a nihilist. But he became an after ten years in exile. He wrote about nihilism in many novels such as Crime and Punishment. The people who assassinated the Russian emperor, Tsar Alexander II on 13 March 1881, are often called nihilists too. Nietzsche thought value destruction had bad results but couldn't be stopped. He also thought Christianity had made value destruction happen, and called it a type of nihilism. He thought Christianity was nihilistic because it was , meaning it has a negative and unhealthy attitude towards living. Religious thinkers have instead said that nihilism comes from rejecting religion. Sometimes people think parts of Buddhism are like nihilism, even though other parts reject nihilism. In the 18th and 19th centuries, the word \"nihilism\" was mostly used against people who rejected religion or believed in nothing. Either way, nihilism is often seen as a word for life-denying beliefs. == Important terms == * anti-nihilism — Anti- nihilism means to be against nihilism. It was also a genre of Russian literature in the 19th century. Examples of people who have been called anti- nihilists are Ivan Turgenev, Fyodor Dostoevsky, and Friedrich Nietzsche. But in one way or another, many anti-nihilists have ended up helping nihilism. * life-denying — If something is life-denying it means it has a negative and unhealthy attitude towards living. It is the opposite of being \"life- affirming\". Gilles Deleuze says that denying life and existence is what Friedrich Nietzsche calls \"nihilism\". Nihilism is often seen as a word for life-denying beliefs. * value destruction — Value destruction means destroying the values that people take for granted. This is by questioning traditional values until they fall apart. Friedrich Nietzsche wrote that nihilism is about destroying what exists and not just wanting it gone. This is also called the devaluation of values, which means destroying the worth of those values. == Origins == The word \"nihilism\" comes from \"\", which is the Latin word for \"nothing\". But the exact origins of the word \"nihilism\" are unknown. In the Middle Ages the word was used for some kinds of heresy. Around the time of the French Revolution, it was a word for the destruction of Christianity and traditional European values. It was used in many European countries. Soon, the word was also used in English. It probably came from the French, German, or Late Latin form of the word. \"Nihilism\" first became a philosophical word in German, and then in Russian. These two meanings were combined by Friedrich Nietzsche. === German nihilism === In 1733, the word \"nihilism\" was used by a German writer named Friedrich Leberecht Goetz. He used the word as a literary term. A Swiss thinker called Jacob Hermann Obereit also used the word in 1787, and Friedrich Heinrich Jacobi did in 1799. This is where it first became part of philosophy. The belief that no one can know true reality is what Obereit called \"nihilism\". He used this definition to call Immanuel Kant a nihilist. This was because Kant said people cannot be certain of real things, but can only be certain about their experience of real things. Jacobi also used this definition to say Kant and his followers were nihilists. For example, he famously called Johann Gottlieb Fichte a nihilist. Jacobi thought German idealism and humanism were kinds of nihilism that came from the Age of Enlightenment. According to him, these so-called rational philosophies were the total opposite of rational. Around 1824, a German journalist called Joseph von Görres used the word \"nihilism\" in a political way. He said that rejecting social structures was nihilism. But the word \"nihilism\" almost died out during this time. For example, the German thinker Max Stirner is called one of the first true nihilists but he never used the word. He wrote most of his works in the 1840s. === Russian nihilism === Russian nihilism was an early kind of nihilist philosophy. It was also a subculture that sometimes mixed with revolutionism. Russian nihilism is often wrongly called a kind of political terrorism because of this. Its main interest was to destroy traditional values, especially in art and religion. Its main philosophers were Nikolay Chernyshevsky and Dmitry Pisarev. It also attacked the belief in free will and God. German nihilism came from German idealism, but Russian nihilism was different because it attacked idealism. Nikolai Nadezhdin was probably the first writer to use the word \"nihilism\" in Russian. He first used it in 1829 by calling scepticism the same as nihilism. And Vasilij Bervi used the same meaning. Russian journalists like Mikhail Katkov and Vissarion Belinsky also used the word. Katkov called nihilism because it rejected all morality. He worried it could cause a revolution. Belinsky used the word in a more neutral way. But the word was still not popular at the time. Mikhail Bakunin is often called the father of Russian nihilism. In 1842, he wrote: \"Let us therefore trust the eternal spirit which destroys and annihilates only because it is the unfathomable and eternal source of all life. The passion for destruction is a creative passion, too!\". Then in the 1850s and 60s, the theory behind Russian nihilism started to form. Originally it was a philosophy of scepticism towards morals and truth. It was in 1862 that the Russian author Ivan Turgenev made the word \"nihilism\" popular. He used it in his novel called Fathers and Sons to describe the attitude of the younger generation. The nihilists in the book say they are people who reject that they can. Even though Turgenev was more of an , many young people started to call themselves \"nihilists\" because of this book. For Pisarev, nihilism was mostly philosophical and not political. He thought extraordinary people should free themselves from rules and morals. He thought anyone who did this would be above ordinary people. But later, Russian nihilism became more and more political. It inspired many revolutionaries such as Sergei Nechaev and Vladimir Lenin. === Nietzsche === Probably the most important explanation of nihilism comes from Friedrich Nietzsche. He wrote many criticisms against nihilism. But he also had some similar beliefs to nihilists like Dmitry Pisarev and Max Stirner. Because of this, he is sometimes called a nihilist and sometimes called an . His explanation of nihilism combined the German and Russian meanings of the word, and also went further. When Nietzsche asks the question \"What does nihilism mean?\", his answer is that \"the highest values themselves.\" He says nihilism is when someone thinks that what exist is not what exist.Nietzsche, Friedrich. KSA 12:9 [60] For example, some people want a perfect world to exist instead of the real world. But nihilism isn't just about wanting it all gone — Nietzsche says that nihilism is also trying to attack and destroy everything that exists. == Related pages == * Absurdism * Cynicism * Egoism * Existentialism * God is dead * Pessimism * Postmodernism == References == Category:Philosophical movements and positions Category:Terrorism Category:Anarchism",
 "title": "Nihilism"
}