{
 "id": "452026",
 "text": "A surface-to-air missile (SAM), also known as a ground-to-air missile (GTAM) or surface-to-air guided weapon (SAGW), is a type of missile that is launched from ground or from a ship to destroy aircraft or other missiles. It is one type of Anti-aircraft warfare. == Surface-to-air rockets == Model Picture Info Patriot rockets (or missiles) Range: it can go up to 160 km. It shoots down ballistic rockets.https://www.politico.eu/article/give-us-the-damn-patriots- ukraine-needs-air-defenses-now-minister-says/. Retrieved 2024-04-05 Variant (or model) of MIM-104: *M902 Patriot PAC-3 Buk 9K37 *9K37M1; **\"Buk-M1-2\", the latest version (as of 2024's second quarter); At least one system was valued at $100 million;https://www.kyivpost.com/post/31649. Retrieved 2024-04-25 In use by Russian forces. *FrankenSAM, surface-to-air missile system that uses three different missiles: Sea Sparrow, Sidewinder, and Patriot missiles and Patriot sensor elements; Those are launched from a 9K37 Buk missile launchers that has been modified by Ukraine.In Ukraine, for the first time, the air defense system of the FrankenSAM — was used to bring down Shahed from a distance of 9 km, Lisa Brovko, babel.ua, 17 January 2024.Ukraine says it deployed its 'FrankenSAM' air-defense systems made from stitching together US and Soviet weapons. Business Insider. 28 December 2023. In use by Ukrainian forces. Pechora S-125 *Pechora 2D *Newa SC Osa 9K33 *Osa- AKM *Osa-AKM-P1 \"Żądło\" Kub 2K12 *M3/2D * * * Kub-M2 Stormer HVM Type: Very short range Avenger 9K35 Strela-10 9K35M Strela-10M4 Tunguska 2K22 Tunguska *Variant: 2K22M IRIS-T IRIS-T SLS MIM-23 Hawk Phase I MIM-23 Hawk Phase III IRIS-T IRIS-T SLM NASAMS Aspide Aspide 2000 Skyguard Spada Aster SAMP/T; medium and long range S-200 Long range some were used again (as late as 2024's second quarter) during the Russian invasion of Ukraine.https://www.kyivpost.com/post/31356. Retrieved 2024-04-19https://www.nettavisen.no/norsk-debatt/ukraina-er-i-ferd-med-a- vinne-luftkrigen/o/5-95-1672552. Retrieved 1 March 2024 The Kyiv Post said, that maybe the rockets \"have been upgraded\", as of 2024.https://www.kyivpost.com/analysis/31842. Retrieved 2024-05-01 S-300 S-300V1 *S-300P/PS/PT *S-300PMU S-125 Used by Ukraine during the Russian invasion of Ukrainehttps://www.kyivpost.com/post/35197. Retrieved 2024-07-02 ==References== ==Other websites== * Rest-of-World Missile Systems Category:Missiles",
 "title": "Surface-to-air missile"
}