{
 "id": "452169",
 "text": "The Battle of Hampton Roads was a naval battle of the American Civil War. It was fought on March 8 and 9, 1862 near Hampton Roads, Virginia. It was an important battle because it was the first combat between ironclad warships. The Confederate ironclad CSS Virginia tried to break the Union navy blockade of Hampton Roads. The blockade prevented all commerce with Norfolk and Richmond, Virginia. On March 8, the Virginia sank and damaged several union battleships. On March 8, the Union ironclad USS Monitor arrived and fought the Virginia. The battle lasted for several hours. But neither ship could defeat the other.Clifford L. Linedecker, Civil War, A to Z: The Complete Handbook of America's Bloodiest Conflict (New York: Ballantine Books; Presidio Press, 2005), p. 156 Both ships left the fight thinking they had won.John V. Quarstein, The Battle of the Ironclads (Charleston, SC: Arcadia, 1999), p. 8 But the Confederates failed to break the blockade.Adam Hook; Angus Konstam, Hampton Roads 1862: Clash of the Ironclads (Oxford: Osprey, 2002), p. 7 Both ironclads were lost soon after the battle. When Norfolk fell in May 1862, the CSS Virginia was destroyed by its crew so it wouldn't be captured.Craig L. Symonds, The Naval Institute Historical Atlas of the U.S. Navy (Annapolis, MD: Naval Institute Press, 2001), p. 87 The USS Monitor was lost in a storm near Cape Hatteras on December 31, 1862. Her wreck was found in 1974. The Battle of Hampton Roads did not make a big difference in the outcome of the Civil War. But it changed the way people fought wars with ships. The battle proved that ironclad warships were much stronger than wooden ships. After this battle, the U.S. and other countries stopped building wooden ships. They started building iron warships instead. == Notes == == References == == Other websites == * The Battle of Hampton Roads (2002); YouTube * The Warrior’s Influence Abroad: The American Civil War (why the Monitor was created) Hampton Roads Category:1862 in Virginia Category:March 1862 events",
 "title": "Battle of Hampton Roads"
}