{
 "id": "45241",
 "text": "Deinonychus pronounced:dei-ON-ike-US was a medium theropod dinosaur. It was a dromaeosaur, and also a larger relative of the famous Velociraptor. This 3.4 meter (11 ft) long Deinonychus lived during the Lower Cretaceous, about 115-108 million years ago. Fossils have been found in the U.S. states of Montana, Wyoming, and Oklahoma. Deinonychus is perhaps the single most important dinosaur discovered in the mid 20th century.Fastovsky D.E; Weishampel D.B. 2005. \"Theropoda I: Nature red in tooth and claw\". In Fastovsky D.E. & Weishampel D.B.. The evolution and extinction of the dinosaurs. 2nd ed, Cambridge University Press, pp. 265–299. ==Ostrom's analysis== Paleontologist John Ostrom's study of Deinonychus in the late 1960s started the debate on whether dinosaurs were warm-blooded.Desmond A.J. 1977. The hot-blooded dinosaurs. It is now accepted that all or most smaller theropods had feathers whose function was temperature regulation. Ostrom noted the small body, sleek, horizontal, posture, and the enlarged claws on the feet, which suggested the animal was an active, agile predator. Before this, the popular idea of dinosaurs had been one of plodding, reptilian giants.Bakker, Robert T. 1975. Dinosaur Renaissance, in Scientific American, April issue.Bakker, Robert T. 1986. The Dinosaur heresies: new theories unlocking the mystery of the dinosaurs and their extinction. Zebra Books. Deinonychus means 'Terrible claw'. This refers to the large, sickle-shaped claw bone on the second toe of each hind foot. In life, a horny sheath over this bone extended the length. Ostrom reconstructed the claw as over long. The species name antirrhopus means “counter balance”. This refers to Ostrom's idea that the tail balanced the front of the body. As in other dromaeosaurs, the tail vertebrae have ossified (bony) tendons and super-long bone processes. These features seemed to make the tail into a stiff counterbalance. A fossil of the closely related Velociraptor has an connected tail skeleton that is curved side to side in a long S–shape. This suggests that, in life, the tail could swish to the sides with some flexibility. ==Paleoecology== Deinonychus remains have been found near those of the ornithopod Tenontosaurus. Teeth discovered near Tenontosaurus specimens suggest it was hunted or at least scavenged by Deinonychus. ==References== Category:Dromaeosauridae",
 "title": "Deinonychus"
}