{
 "id": "452665",
 "text": "The 9th Regiment Illinois Volunteer Infantry was an infantry regiment that served in the Union Army during the American Civil War. == History == Shortly after the Battle of Fort Sumter, President Lincoln called for 75,000 volunteers.Marion Morrison, A History of the Ninth Regiment Illinois Volunteer Infantry, with the Regimental Roster (Carbondale: Southern Illinois University Press, 1997), p. 7 They were to serve for three months. The state of Illinois put out a call to form units. Six companies came from St. Clair County. Madison County sent three companies. Montgomery county sent one company. All nine companies met at Springfield, Illinois on April 23, 1861. There they were formed into the 9th Regiment, Illinois volunteer infantry. There were rumors that the Confederates intended to invade at Cairo, Illinois. In response, orders were issued for the 9th Infantry to occupy Cairo. They arrived and set up camp on May 1, 1861.Marion Morrison, A History of the Ninth Regiment Illinois Volunteer Infantry, with the Regimental Roster (Carbondale: Southern Illinois University Press, 1997), p. 9 The first few months were spent on the Mississippi river guarding Cairo. Their three-month enlistments were up in July. Most of the men reenlisted for three years. In September the regiment moved to Paducah, Kentucky. There they did little more than drill practice.Peter E. Cozzens, \"My Poor Little Ninth\": The Ninth Illinois at Shiloh, Illinois Historical Journal, Vol. 83, No. 1 (Spring, 1990), p. 34 On February 15, 1862 they joined the fighting at the Battle of Fort Donelson. Their losses included 36 killed and 165 wounded, out of a total strength of 600. After the Confederates surrendered, they were transported by riverboats up the Tennessee River. They left the boats at Pittsburg Landing, Tennessee and camped nearby.Peter E. Cozzens, \"My Poor Little Ninth\": The Ninth Illinois at Shiloh, Illinois Historical Journal, Vol. 83, No. 1 (Spring, 1990), pp. 36–42 On April 6, 1862 they woke up to the sound of cannons. While they were waiting to join the battle, new orders were given. They were ordered to exchange their gray coats for Union blue. This way they would not be mistaken for Confederate troops. They then joined the battle of Shiloh. They fought most of the day. At Shiloh the 9th Illinois had the highest casualties of any Illinois unit. They lost 366 of their comradesVictor Hicken, Illinois in the Civil War (Urbana, University of Illinois Press, 1966), p. 70 They also fought at the Second Battle of Corinth. The regiment was changed to the 9th Illinois Volunteer Mounted Infantry Regiment on March 15, 1863. On July 9, 1865 the 9th Illinois Infantry was mustered out (released from military service) at Louisville, Kentucky.Illinois Adjutant General's Report, Regimental and Unit Histories (Illinois, 1866), p. 20 ==Total strength and casualties== The regiment suffered 5 officers and 211 recruited men killed in action or mortally wounded. 1 officer and 200 enlisted men died of disease. In total there were 417 casualties (persons killed or wounded). == Uniforms == The 9th Illinois volunteers, along with the 8th, 11th, and 12th, all wore gray coats trimmed in blue.Ron Field, Robin Smith, Uniforms of the Civil War: An Illustrated Guide for Historians, Collectors, and Reenactors (Guilford, CT: Lyon's Press, 2005), p. 122 They also wore Zouave caps. In 1862, they changed to the same blue uniforms as other Union Army regiments. Most of the Illinois infantry regiments used Springfield Model 1861 muskets. ==Commanders== *Colonel Augustus Mersy - Mustered out with the regiment == Notes == == References == == Other websites == *The Civil War Archive Category:Union Army",
 "title": "9th Illinois Volunteer Infantry Regiment"
}