{
 "id": "452791",
 "text": "Sonny Bill Williams is a New Zealand sportsman. He plays various sports. He has won numerous team and individual awards and titles. Williams was born in Auckland. His father is from Samoa. His mother is a white New Zealander. ==Sporting history== *2004-2008: played Rugby league for Canterbury Bulldogs in the National Rugby League. Also played for the New Zealand team. *2008-2010: played Rugby union for Toulon. *2009-2013: boxed six times. He boxed as a Heavyweight. He won all his fights. *2010: played rugby for Canterbury and New Zealand. *2011: played rugby for the Crusaders and New Zealand. *2012: played rugby for the Chiefs and New Zealand. Also played rugby for Panasonic in Japan. *2013: played Rugby league for the Sydney Roosters in the NRL. Also played for the New Zealand team. *2014: played Rugby league for the Sydney Roosters. ==Sporting achievements== * 2004: NRL winner with the Bulldogs. Also won RLIF International Newcomer of the Year award. * 2010: Ranfurly Shield winner with Canterbury. Also won ITM Cup with Canterbury. * 2011: Rugby World Cup winner with New Zealand. Also won Bledisloe Cup with New Zealand. * 2012: Super Rugby winner with the Chiefs. Also won Bledisloe Cup with New Zealand. Also won New Zealand Professional Boxing Association heavyweight title. * 2013: NRL winner with the Roosters. Also won WBA International heavyweight title. Also won RLIF International Player of the Year award. * 2014: World Club Challenge winner with the Roosters. == Statistics == ===Club rugby league=== Season Club Matches Tries 2004 Bulldogs 15 4 2005 Bulldogs 5 1 2006 Bulldogs 21 8 2007 Bulldogs 21 14 2008 Bulldogs 11 4 2013 Roosters 24 8 2014 Roosters 9 2 Total NA 106 41 ===Club rugby union=== Season Club Matches Tries 2008-10 Toulon 33 6 2010 Canterbury 6 4 2011 Crusaders 15 5 2012 Chiefs 18 5 2012-13 Panasonic 7 2 Total NA 79 22 ===National rugby league and rugby union=== Year Team Matches Tries 2004-13 New Zealand Kiwis 12 5 2010-12 New Zealand All Blacks 19 6 Total NA 31 11 ==References== * * Category:1985 births Category:Living people Category:New Zealand boxers Category:Converts to Islam Category:New Zealand rugby league players Category:New Zealand rugby union players Category:RC Toulonnais players Category:Sportspeople from Auckland",
 "title": "Sonny Bill Williams"
}