{
 "id": "452722",
 "text": "{{Infobox settlement | name = Ruston, Louisiana | official_name = City of Ruston | native_name = ruston de Louisiane | native_name_lang = | other_name = | settlement_type = City | image_skyline = Cyclists heading north on N. Vienna St. in Ruston, LA.jpg | imagesize = | image_caption = Cyclist riding north on North Vienna Street | image_flag = | image_seal = | image_shield = | nickname = Louisiana's College Town; The Peach City; Rus Vegas | image_map = | map_caption = Interactive map of Ruston | pushpin_map = | coordinates = | subdivision_type = Country | subdivision_name = | subdivision_type1 = State | subdivision_name1 = | subdivision_type2 = Parish | subdivision_name2 = Lincoln | established_title = | established_date = | established_title1 = Incorporated | established_date1 = | government_type = Mayor-Council | leader_party = R | leader_title = Mayor | leader_name = Ronny Walker | area_total_km2 = 54.93 | area_total_sq_mi = 21.21 | area_land_km2 = 54.75 | area_land_sq_mi = 21.14 | area_water_km2 = 0.18 | area_water_sq_mi = 0.07 | elevation_m = | elevation_ft = 331 | population_footnotes = | population_total = 22166 | population_as_of = 2020 | population_est = | pop_est_as_of = | population_density_sq_mi = 1048.58 | population_density_km2 = | population_blank1_title = µSA (2020) | population_blank1 = 48,396 (US: 228th) | population_blank2_title = CSA (2020) | population_blank2 = 255,500 (US: 123rd) | population_demonym = Rustonian | timezone1 = CST | utc_offset1 = -6 | timezone1_DST = CDT | utc_offset1_DST = -5 | postal_code_type = ZIP code | postal_code = 71270, 71272, 71273 | area_code_type = | area_code = 318 | blank_name_sec1 = Interstate | blank_info_sec1 = | blank1_name_sec1 = U.S. | blank1_info_sec1 = | blank2_name_sec1 = Louisiana | blank2_info_sec1 = | blank_name_sec2 = Airport | blank_info_sec2 = Ruston Regional Airport | website = |pop_est_footnotes = |unit_pref = Imperial |blank_name = FIPS code |blank_info = 22-66655 |area_footnotes = }} Ruston is the parish seat of Lincoln Parish, Louisiana, United States. Ruston is the principal city of the Ruston micropolitan area which includes all the Lincoln Parish. == Geography == Ruston is located at (32.529674, -92.640466) and has an elevation of . According to the United States Census Bureau, the city has a total area of , of which, of it is land and of it (0.3%) is water. Regional cities and their distance from Ruston, Louisiana include: City Miles Monroe, Louisiana 32 miles Shreveport, Louisiana 68 miles Jackson, Mississippi 152 miles El Dorado, Arkansas 53 miles Texarkana, Texas 139 miles Little Rock, Arkansas 171 miles New Orleans, Louisiana 296 miles Lufkin, Texas 185 miles Alexandria, Louisiana 94 miles Vicksburg, Mississippi 109 miles == Education == === College === College City Louisiana Tech University Ruston Grambling State University Grambling == Media == list of Media in the Ruston Micropolitan area and East Central Ark-la-tex: === Newspaper === Newspaper Serve Ruston Daliy News City of Ruston === AM === Channel Callsign Format Owner 1490 KRUS Urban contemporary Example === FM === Channel Callsign Format Owner 88.3 KAPI Example Example 89.1 KLPI Example Example 91.5 KGRM Example Example 94.1 KRLQ Classic Country Example 95.5 KQWJ Example Jonesboro 97.7 KPCH Sports The Radio Center 99.3 KNBB Oldies The Radio Center 104.9 KTOC Gospel Jonesboro 107.5 KXKZ Country The Radio Center == Transportation == === Interstates === Number Highway 20 I-20 === U.S. === Number Number 63 U.S. 63 80 U.S. 80 167 U.S. 167 == Point of Interest == Place Address Ruston Country Club 2000 S Vienna St, Ruston, LA 71270 == Notable people == # Trace Adkins, Country singer who attended Louisiana Tech; originally from Sarepta # Stephen Babcock, high-profile Louisiana trial lawyer who attended Ruston High School, and Louisiana Tech University. # C.E. Byrd, president of Louisiana Tech, and founder of C.E. Byrd High School in Shreveport. # C.E. \"Cap\" Barham, attorney, state senator, and lieutenant governor # Charles C. Barham, attorney and former state senator # Leon Barmore, basketball coach who was born and reared in Ruston, played basketball at Louisiana Tech # George W. Bond, president of Louisiana Tech University from 1929 to 1936 # Terry Bradshaw, member of the Pro Football Hall of Fame, attended Louisiana Tech # Kix Brooks, country music singer, who attended Louisiana Tech. # P.J. Brown, NBA player, attended Louisiana Tech # Mary Elizabeth Talbot Busbee (1927-2012), the First Lady of Georgia from 1975 to 1983, was born and reared in Ruston. Known as \"Mary Beth\", she was a medical technologist and a graduate of Louisiana Tech. Her husband was the late Democratic Governor George D. Busbee. # John Ardis Cawthon, education professor and regional historian at Louisiana Tech University # John R. Conniff, educator, president of Louisiana Tech from 1926 to 1928 # Claybrook Cottingham, president of Louisiana College from 1910–1941, and Louisiana Tech president from 1941 until his death in 1949 # Paul M. Davis, Jr., orthopedic surgeon and real estate developer in Alexandria, was born in Ruston in 1919. # Fred Dean, NFL Hall of Fame, attended Ruston High and Louisiana Tech # Hollis Downs former state representative; financial analyst; Louisiana Tech professor # Clarence Faulk, newspaper publisher, radio broadcaster, businessman # W. C. Friley, founder of Ruston College in late 1880s, a forerunner of Louisiana Tech; later president of Hardin-Simmons University in Abilene, Texas, and Louisiana College in Pineville, succeeded there in 1910 by Claybrook Cottingham # Will Cullen Hart Indie rock musician, visual artist, and founding member of the Elephant Six Collective and The Olivia Tremor Control, and leader of Circulatory System, attended Ruston High School and was a disc jockey at Louisiana Tech's radio station KLPI # Wiley W. Hilburn, journalist and author # Berry Hinton, baseball coach and Louisiana Tech alumni secretary # George B. Holstead, state representative from Lincoln Parish (1964–1980) # Sonja Hogg, founding coach of the Louisiana Tech Lady Techsters # John S. Hunt, III, Louisiana Public Service Commissioner from 1964–1972, was born in Ruston. # Bert Jones, former NFL player, attended Ruston High School # Dub Jones, former NFL player, attended Ruston High. # K.D. Kilpatrick, mortician and former member of the Louisiana State Senate # Karl Malone, Basketball Hall of Famer, attended Louisiana Tech, currently lives in Ruston # Jeff Mangum, Indie rock musician and founding member of the Elephant Six Collective and Neutral Milk Hotel, attended Ruston High School and was a disc jockey at Louisiana Tech's radio station KLPI # Garnie W. McGinty, Louisiana historian # Paul Millsap, NBA player, attended Louisiana Tech # E. R. Minchew, educator # Ryan Moats, athlete, attended Louisiana Tech # Robert W. Mondy, historian of early years of Lincoln Parish and the American frontier # Luke McCown, NFL quarterback, attended Louisiana Tech # Kim Mulkey, head women's basketball coach at Baylor University, whose career as a player at Louisiana Tech placed her in the Women's Basketball Hall of Fame # L.D. \"Buddy\" Napper, attorney, former state representative, and minor league baseball player # Virgil Orr, former state representative; Louisiana Tech vice president # Morgan D. Peoples, historian # Hilda Taylor Perritt, first female mayor of Ruston from 1991-1998 # Elton C. Pody, mayor of Ruston from 1983 to 1991 # Arthur T. Prescott, educator and founding president from 1894 to 1899 of Louisiana Tech University # Patrick Ramsey, athlete, attended Ruston High # Tim Rattay, athlete, attended Louisiana Tech # E.S. Richardson, president of Louisiana Tech from 1936–1941 # Willie Roaf, NFL Hall of Fame player, attended Louisiana Tech # Scotty Robertson, high school, college, and professional basketball coach, died in Ruston in 2011 # W. C. Robinson, mathematics professor and second president of Louisiana Tech from 1899 to 1900 # Jimmy G. Shoalmire, historian, Ruston resident, 1958–1967 # Robert C. Snyder, English professor at Louisiana Tech, a founder of the Lincoln Parish Library # Matt Stover, current NFL player, attended Louisiana Tech # George Stone, former National League pitcher with the Atlanta Braves and New York Mets. # Josh Scobee, current NFL player, attended Louisiana Tech # Don Shows, football coach # Mickey Slaughter, former NFL quarterback, attended, and later coached football for, Louisiana Tech # Polly Smith, photographer # Robert Schneider, Indie rock musician, record producer, founding member of the # Elephant Six Collective, and frontman of The Apples in Stereo, attended Ruston High School # Lawson Swearingen, reared in Ruston, former state senator, president of the University of Louisiana at Monroe, and professor of management at Southeastern Louisiana University # F. Jay Taylor, president of Louisiana Tech, 1962–1987 # David William Thomas lived in Ruston during the early 1930s while he headed the Louisiana Tech Journalism Department # William Y. Thompson, historian # Robert O. Trout, sociologist # Kyle Williams, NFL player, attended Ruston High # John D. Winters, historian # Kenny Wright, 9-year NFL DB.(Minnesota Vikings 1999-2001, Houston Texans 2002-2004, Jacksonville Jaguars 2005, Washington Redskins 2006, and Cleveland Browns 2007) ==References== == Other websites == * City of Ruston * Ruston-Lincoln Convention And Visitors Bureau * Lincoln Parish Category:Parish seats in Louisiana Category:Cities in Louisiana Category:Settlements in Lincoln Parish, Louisiana Category:1885 establishments in the United States Category:1880s establishments in Louisiana",
 "title": "Ruston, Louisiana"
}