{
 "id": "45287",
 "text": "Cnut II and I (Danish: Knud II; 25 May 994 — 12 November 1035) nicknamed the Great (Danish: den Store) was the King of Denmark as Cnut II from 1018, King of England as Cnut I from 1016, and King of Norway from 1028 until his death in 1035. Cnut was considered one of Europe's most powerful rulers during his time. He ruled over England, Denmark, Norway, and a part of Sweden on which are called the North Sea Empire. == Conquest of England == In the summer of 1015, Canute's fleet set sail for England with a Danish army of perhaps 10,000 in 200 longships.Trow M.J. 2005. Cnut: Emperor of the North. Stroud: Sutton. Cnut was at the head of an array of Vikings from all over Scandinavia. The invasion force was to be in often close and grisly warfare with the English for the next fourteen months. Practically all of the battles were fought against Aethelred's son, Edmund Ironside. After ascending the throne in 1016, Canute executed many of Edmund's followers, to make his crown safe. == Family == Canute, a Christian, had two wives. His first wife, or perhaps concubine, was called Ælfgifu. She was a handfast wife, meaning the marriage was made by joining hands, not by a church ceremony. This was legal at that time. She became his northern queen. His second wife was Emma of Normandy, who was also called Ælfgifu in Old English. Their wedding was a Christian wedding. She was kept in the south, with an estate in Exeter. Both wives bore sons who became kings of England. Canute kept the Church sweet with many gifts. === Issue === *1 – Ælfgifu of Northampton **Sweyn Knutsson, King of Norway **Harold Harefoot, King of England *2 – Emma of Normandy **Harthacanute, King of Denmark and England **Gunhilda of Denmark, wed Henry III, Holy Roman Emperor. == Canute and the waves == There is a story that Canute sat on his throne ordering the sea to turn back. We do not know whether this really happened. It seems to come from Henry of Huntington (c. 1088 – c. 1154).Henry of Huntingdon 1853. The Chronicle of Henry of Huntingdon, comprising The History of England, from the invasion of Julius Caesar to the accession of Henry II. English translation by T.A.M. Forester; London: Bohn. He relates it as follows: \"When King Cnute had reigned for twenty years, he departed this life at Shaftesbury and was buried at Winchester in the Old Minster. A few words must be devoted to the power of this king. Before him there had never been in England a king of such great authority. He was lord of all Denmark, of all England, of all Norway, and also of Scotland. In addition to the many wars in which he was most particularly illustrious, he performed three fine and magnificent deeds....The third, that when he was at the height of his ascendancy, he ordered his chair to be placed on the sea-shore as the tide was coming in. Then he said to the rising tide, 'You are subject to me, as the land on which I am sitting is mine, and no one has resisted my overlordship with impunity. I command you, therefore, not to rise on to my land, nor to presume to wet the clothing or limbs of your master.' But the sea came up as usual, and disrespectfully drenched the king's feet and shins. So jumping back, the king cried, 'Let all the world know that the power of kings is empty and worthless, and there is no king worthy of the name save Him by whose will heaven, earth, and sea obey eternal laws.' Thereafter King Cnut never wore the golden crown on his neck, but placed it on the image of the crucified Lord, in eternal praise of God the great king. By whose mercy may the soul of King Cnut enjoy rest.\" Henry of Huntingdon, Historia Anglorum (VI.17) == References == == Other websites == *Canute the Great At Find A Grave *Canute the Great Category:990s births Category:1035 deaths Category:Kings and Queens of Denmark Category:Kings and Queens of Norway Category:People buried in Winchester Cathedral Category:11th century in England",
 "title": "Canute"
}