{
 "id": "452910",
 "text": "A software release life cycle is the different stages of making a computer program, giving it out to other people, and making sure the computer program works right after it is released. Stages can either be officially announced and regulated by developers, or sometimes the term is used to describe the state of the product. == Stages of development (making the computer program) == === Pre-alpha === Pre-alpha is the first stage of making a computer program. People making the computer program think up what the computer program should have in it, and start to actually create the computer program itself. Also, programs that have not yet entered the alpha or beta stage, but passed the development stage, are called so. === Alpha === Alpha software is a computer program that can do most of what the programmers (people who make the software) want it to do, but it has lots of problems. Only the things that the programmers really want the software to do has been made without many problems. === Beta === A computer program goes into beta when programmers have made the software do everything it needs to do, but there may still be problems. The people who make the software then give it out to other people, so they can test whether the software works properly. They may still find problems that they did not find in alpha. Some programs, even very stable, exist only as beta versions. The most frequent reason is that the developer continues to release new features which are not usually well tested. In this way responsible developers inform users about the increased risk of problems, but not to avoid responsibility. Even a final version of every program or operating system contains a disclaimer that says that a developer is not responsible for any loss or damage caused to a user. It is also known as betaware. === RC === RC (release candidate) is a candidate stage for becoming stable. The software of this stage has passed almost full testing and the main errors have been corrected. But at the same time, there are some bugs that could not be found during testing. It is also called as \"going silver\". === RTM === RTM (release to manufacturing) is a publication of a product which is ready for replication. This is a stable version of the program that has gone through all stages of development. The main errors were fixed, but there is a possibility of new mistakes. === GA === GA (general availability) is a public version of the software and people can buy it. The time between RTM and GA can be from a week to a month. At this stage, the software \"went into operation\". ==Related pages== * Software release == References == Category:Software",
 "title": "Software release life cycle"
}