{
 "id": "453139",
 "text": "Lab Rats (Lab Rats: Bionic Island since the fourth season) is an American television series by It's a Laugh Productions and Disney XD. It first started in 2012. The show is about a teenager named Leo who discovers three teens with bionic powers in the basement (lab) of his home. The show had 90 episodes in 5 seasons. == Plot summary == In the start (Season 1) Leo discovered Adam, Bree and Chase and the Lab Rats wanted to go to school and have a social start so season 1 had more of showing who they are. In a season 1 episode Marcus had been shown to be a bad guy to Leo but not to the Lab Rats but in more episodes they start doing more life-saving events and in the Season 1 finale they go to space. In Season 2 in \"Bionic Showdown\" Marcus becomes a threat to all of the Lab Rats and Donald as it starts with more villains like Marcus and Douglas. Then in the Season 2 final \"No Going Back\" the bad guys keep coming to try to get them and all season finales end with a cliff hanger with the series premiere of Season 3 (Sink Or Swim) continuing from the season finale of Season 2. == Main Characters == * Tyrel Jackson Williams as Leo Dooley * Billy Unger as Chase Davenport * Kelli Berglund as Bree Davenport * Spencer Boldman as Adam Davenport * Hal Sparks as Donald Davenport ==Season 3== *1. Sink Or Swim Air date: February 17, 2014 Plot: The Lab Rats are on the run as stowaways on a cargo freight headed to the unknown. Once captured by the ship's crew, they are forced to choose between helping a submarine in danger, which would reveal their whereabouts and put them at risk of being caught, or staying quiet. Meanwhile, Leo and Davenport try to find a way out of the elevator. *2. Jet Wing Air date: February 27, 2014 Plot: Donald performs Death defying stunt to earn money for a new lab. *3. Mission: Creek High Air date: March 3, 2014 Plot: The Lab Rats get a new lab then Principal Perry makes the team take her on a mission but when they put a fake one perry accidentally launches a rocket a there high school Meanwhile Leo takes Danelle on a date to prove he is not bad luck. == Awards & Nominations == Year Awards Category Nominee(s) Result 2016 Kids' Choice Awards Favorite TV Show Lab Rats: Bionic Island Favorite Male TV Star Tyrel Jackson Williams == Other websites == Lab Rats at the Internet Movie Database ==References== Category:American television series Category:2012 American television series debuts",
 "title": "Lab Rats"
}