{
 "id": "45311",
 "text": "Edward III (13 November 1312–21 June 1377) was a King of England who ruled for 50 years. Edward was born on 13 November 1312 to Edward II and Isabella of France. He was the oldest of their five children. He had two younger brothers (Adam FitzRoy and John of Eltham, Earl of Cornwall) and two younger sisters (Joan of the Tower and Eleanor of Woodstock). Edward made England the strongest military power during his reign. Edward was crowned when he was fourteen years old, after his father was forced to abdicate. After his victory against Scotland, he declared himself heir to the French throne in 1337, which started the Hundred Years' War. The war went very well for England, and the victories at the Battles of Crécy and Poitiers led to the Treaty of Brétigny by which he gained a lot of territory. When he became older, he was much less active, mostly a result of his bad health. He died of a stroke in 1377, aged 64. Edward also established the Order of the Garter and developed legislature and government. However, during his reign was the Black Death. Edward and his wife, Philippa of Hainault, had many children, and as they travelled, the children were generally known by where they were born though the oldest son, Edward \"of Woodstock,\" became known to later generations as Edward, the Black Prince. He died before his father Edward III, and his older son, Edward of Angoulême, had died a child and so younger son, Richard of Bordeaux, succeeded Edward III as Richard II of England. However, Richard was deposed by his cousin Henry IV of England, whose father, John of Gaunt, had married the heiress of Lancaster. His family, the House of Lancaster, fought the Wars of the Roses against the House of York, which was descended from the daughter of Edward III's son Lionel of Antwerp (who was older than John) over who was the rightful king. In his own time and for centuries afterward, Edward III was greatly praised, but Whig historians saw him as an irresponsible adventurer. That view has turned, and modern historians see what a good king he was. == Other websites == *The Medieval Sourcebook) has some good sources relating to the reign of Edward III: ** The Ordinance of Labourers, 1349 ** The Statute of Laborers, 1351 ** Thomas Walsingham’s account of the Good Parliament of 1376. * Man of War: Edward III, King of England at myarmoury.com Category:1312 births Category:1377 deaths Category:House of Plantagenet Category:14th century in England",
 "title": "Edward III of England"
}