{
 "id": "453436",
 "text": "The national anthem of the Republic of China, also unofficially known as Sān Mín Zhǔyì ('The Tridemism'), was originally created by a Sūn Yìxiān speech in 1924 and was set to music by Chéng Màoyún a few years later when the Guómíndǎng adopted new a new flag and emblem. The anthem was later adopted for the Republic of China in 1937, then officially in 1943. A bit later, when the Japanese surrendered, this song became official in the island of Taiwan. When the communists took control of the mainland in 1949, repelling the nationalists to Taiwan, this anthem became banned in the mainland but continues to be in use in Taiwan to this day alongside the national banner anthem. ==Lyrics== Traditional Chinese Simplified Chinese Bopomofo Pinyin Mandarin IPA Pe̍h-ōe-jī 三民主義，吾黨所宗， 以建民國，以進大同。 咨爾多士，為民前鋒； 夙夜匪懈，主義是從。 矢勤矢勇，必信必忠； 一心一德，貫徹始終。https://english.president.gov.tw/Page/97 National anthem. english.president.gov.tw. Office of the President.http://www.nationalanthems.info/tw.htm Taiwan (national anthem). nationalanthems.info. 2013. Kendall, David. 三民主义，吾党所宗， 以建民国，以进大同。 咨尔多士，为民前锋； 夙夜匪懈，主义是从。 矢勤矢勇，必信必忠； 一心一德，贯彻始终。 ㄙㄢ ㄇㄧㄣˊ ㄓㄨˇ ㄧˋ， ㄨˊ ㄉㄤˇ ㄙㄨㄛˇ ㄗㄨㄥ, ㄧˇ ㄐㄧㄢˋ ㄇㄧㄣˊ ㄍㄨㄛˊ， ㄧˇ ㄐㄧㄣˋ ㄉㄚˋ ㄊㄨㄥˊ. ㄗ ㄦˇ ㄉㄨㄛ ㄕˋ， ㄨㄟˋ ㄇㄧㄣˊ ㄑㄧㄢˊ ㄈㄥ, ㄙㄨˋ ㄧㄝˋ ㄈㄟˇ ㄒㄧㄝˋ， ㄓㄨˇ ㄧˋ ㄕˋ ㄘㄨㄥˊ. ㄕˇ ㄑㄧㄣˊ ㄕˇ ㄩㄥˇ， ㄅㄧˋ ㄒㄧㄣˋ ㄅㄧˋ ㄓㄨㄥ, ㄧˋ ㄒㄧㄣ ㄧˋ ㄉㄜˊ， ㄍㄨㄢˋ ㄔㄜˋ ㄕˇ ㄓㄨㄥ。 Sānmín Zhǔyì, wúdǎng suǒ zōng; Yǐ jiàn Mínguó, yǐ jìn dà tóng. Zī'ěr duō shì, wéi mín qiánfēng; Sù yè fěi xiè, zhǔyì shì cóng. Shǐ qín shǐ yǒng, bì xìn bì zhōng; Yì xīn yì dé, guànchè shǐzhōng. [sán.mǐn ʈʂù.î ǔ tàŋ swɔ̀ tsʊ́ŋ] [ì tɕjɛ̂n mǐn.kwɔ̌ ì tɕîn tâ.tʰʊ̌ŋ] [tsɹ̩́ àɚ twɔ́.ʂɻ̩̂ wɛ̂i mǐn tɕʰjɛ̌n.fɤ́ŋ] [sû.jɛ̂ fɛ̀i ɕjɛ̂ ʈʂù.î ʂɻ̩̂ tsʰʊ̌ŋ] [ʂɻ̩̀ tɕʰǐn ʂɻ̩̀ jʊ̀ŋ pî ɕîn pî ʈʂʊ́ŋ] [î ɕín î tɤ̌ kwân.ʈʂʰɤ̂ ʂɻ̩̀ ʈʂʊ́ŋ] Sam bîn chú gī, ngô͘ tóng só͘ chong, Í kiàn Bîn-kok, í chìn tāi tông, Chu ní to sū, ûi bîn chiân hong, Siok iā húi hāi, chú gī sī chiông, Sí khîn sí ióng, pit sìn pit tiong, i̍t sim i̍t tek, koàn thiat sí tiong! ===Official English translation=== :San Min Chu-i, :Our aim shall be: :To found a free land, :World peace, be our stand. :Lead on, comrades, :Vanguards ye are. :Hold fast your aim, :By sun and star. :Be earnest and brave, .Your country to save, :One heart, one soul, :One mind, one goal...https://books.google.com/books?id=wkjaAAAAMAAJ&q;=Freedom+songs+of+the+United+Nations Office of War Information, United Nations Information Office, 1943. ==References== Category:Asian anthems Category:Taiwan",
 "title": "National Anthem of the Republic of China"
}