{
 "id": "45366",
 "text": "Henry VI (6 December 1421 - 21 May 1471) was King of England twice. The first time was from 31 August 1422 to 1461. The second time was from 1470 to 21 May 1471. He was also the King of France from 1422 to 1453. == Early life == Henry was the only child of King Henry V of England and was his heir. He was born on 6 December 1421 at Windsor. He became king at the age of nine months on 31 August 1422, when his father died. His mother, Catherine of Valois, was then only twenty years old. Because she was the daughter of King Charles VI of France, and France had been the enemy of England, the English people did not trust her, and she was not allowed to have a large part in raising her son. Humphrey, Duke of Gloucester, Henry IV of England's youngest son, was given the position of \"Protector and Defender of the Realm and the Church\" (Regent of England) until the King was old enough to rule. Humphrey's job was to keep the peace and deal with Parliament. Henry IV's oldest living son, John, Duke of Bedford, was made the Regent of France and was in charge of running the war that was happening. Bedford also replaced Gloucester as Regent of England whenever he was in England. == Coronation == Henry was eventually made King of England at Westminster Abbey on 6 November 1429 a month before his eighth birthday. He was made King of France at Notre Dame in Paris on 16 December 1431. Because he was a child, he was not allowed to control the government until he was declared of age on his sixteenth birthday, in 1437, the same year that his mother died. == Marriage == Because of his success in the Hundred Years' War, Henry V had left England with a lot of land in France. Since Henry VI was still a child, and England was ruled by a regent, much of the land that his father gained was lost. Diplomatic mistakes and military failures caused the loss of most of the English land in France. Henry VI was a deeply spiritual man and was not very interested in politics. He let his court be controlled by a few noblemen, who were called his \"favourites\". The people who wanted to end the war in France became more powerful, and Henry went along with them. Henry was told that the best way to get peace with France was to marry Margaret of Anjou, who was a niece of King Charles VII of France. Charles agreed to let Henry marry Margaret as long as he did not have to give her a dowry and was given the lands of Maine and Anjou by the English. Henry agreed but did not let Parliament know about the gifts of land. He thought that the English people would not be happy to know that the land was being given away to France. The marriage happened in 1445. Margaret was much the opposite of Henry. She was ready to take decisions and lead,a nd he was happy to be led by her. Margaret was a stronger ruler than Henry ever was even though she was only sixteen. == Wars of the Roses == == Death and legacy == Henry was imprisoned in the Tower of London, where he was murdered on 21 May 1471. Popular legend said that Richard, Duke of Gloucester, was behind the murder, as well as the that of Henry VI's son, Edward of Westminster. Henry VI was originally buried in Chertsey Abbey. In 1485, his body was moved to St George's Chapel, in Windsor Castle. He was succeeded by Edward IV, the son of Richard of York, 3rd Duke of York. ==Notes== Category:1421 births Category:1471 deaths Category:House of Lancaster Category:Dukes and Duchesses of Aquitaine Category:15th century in England",
 "title": "Henry VI of England"
}