{
 "id": "453615",
 "text": "Marjane Satrapi is a writer and artist. She was born on November 22, 1969 in Rasht, Iran. She lives in Paris, France. Satrapi writes comics about her life. She draws the pictures herself. She also draws pictures for other children’s books.\"Marjane Satrapi.\" Authors and Artists for Young Adults, vol. 55, Gale, 2004. Biography In Context. Accessed 10 May 2018. == Education and Early Life == She was the only child of Marxist parents. Satrapi’s parents were educated, and taught Satrapi to think for herself. She went to high school at Lycee Francais in Tehran, Iran. When she was 14, Satrapi’s parents sent her to Vienna, Austria to learn in a freer country. When Satrapi was 19, she moved back to Iran to study decorative arts at the Tehran School of Fine Arts. The change from the western world to Iran was difficult for her. In 1994, Satrapi moved to Strasbourg, France to study art for 3 years. She now lives in Paris, France.\"Marjane Satrapi.\" Authors and Artists for Young Adults, vol. 55, Gale, 2004. Biography In Context, http://link.galegroup.com/apps/doc/K1603001160/BIC?u=palo88030&sid;=BIC&xid;=e61cf85f. Accessed 13 May 2018.\"Marjane Satrapi.\" Gale Student Resources in Context, Gale, 2008. Student Resources In Context, http://link.galegroup.com/apps/doc/EJ2181100279/SUIC?u=palo88030&sid;=SUIC&xid;=1771f93d. Accessed 13 May 2018. == Beliefs == Satrapi thinks countries should not spend money on weapons. She thinks they should spend money for kids to go to school in different countries. She thinks that studying in different countries helps people understand each other better. In RandomHouse.com, Satrapi said, \"I believe there are ways to solve the world's problems. Instead of putting all this money to create arms, I think countries should invest in scholarships for kids to study abroad [other countries]. Perhaps they could become good and knowledgeable professors in their own countries. You need time for that kind of change, though.\"\"Marjane Satrapi.\" Authors and Artists for Young Adults, vol. 55, Gale, 2004. Biography In Context, http://link.galegroup.com/apps/doc/K1603001160/BIC?u=palo88030&sid;=BIC&xid;=e61cf85f. Accessed 13 May 2018. == Writing and the War == Iran's Islamic Revolution against the Shah, the country’s dictator, started in 1979. Satrapi’s uncle was put in prison by the Shah, then murdered by people who supported the war. Satrapi wrote a popular series of comics called Persepolis. Persepolis: The Story of a Childhood, tells about Satrapi's life, the discrimination she faced, and moving to Europe. She later wrote a sequel to Persepolis that talked about how she was treated badly for years when she went back to Iran. Satrapi’s most famous book is called Persepolis.Spurgeon, Thomas. \"Comics.\" World Book Advanced, World Book, 2018. Persepolis is the old Persian capital. The comic book is about Satrapi’s childhood in Iran during the war. This time was when country wanted to end the Shah’s cruel rule. She has written three comic books relating to her life. The first and second are about her childhood. The third is about her study in different countries. She is planning to write a fourth book about her return to Iran.\"Marjane Satrapi.\" Authors and Artists for Young Adults, vol. 55, Gale, 2004. Biography In Context, http://link.galegroup.com/apps/doc/K1603001160/BIC?u=palo88030&sid;=BIC&xid;=e61cf85f. Accessed 13 May 2018. == Awards == \\- Prix Alph'art Coup de Coeur for beginning comic artist award for Persepolis-- 2001 \\- Prix du Lion for Persepolis-- 2001 \\- Prix France Info for best news comic strip for Persepolis-- 2002 \\- Prix Alph'art for best script for Persepolis Tome 2—2002 \\- Fernando Buesa Blanco peace prize for Persepolis—2003 \\- Prix d'Angouleme for best book of the year for Chicken and Plums—2005 \"Marjane Satrapi.\" Newsmakers, Gale, 2006. Biography In Context, http://link.galegroup.com/apps/doc/K1618004338/BIC?u=palo88030&sid;=BIC&xid;=828a9a6a. Accessed 13 May 2018. ==References== * Trickey, Erick. \"Marjane Satrapi.\" Newsmakers. Detroit: Gale, 2006. Biography in Context. Web. 12 May 2014. * \"Marjane Satrapi.\" Random House. Web. 15 May 2014. . * \"Marjane Satrapi.\" Authors and Artists for Young Adults. Vol. 55. Detroit: Gale, 2004.Biography in Context. Web. 12 May 2014. Category:1969 births Category:Iranian writers Category:Living people",
 "title": "Marjane Satrapi"
}