{
 "id": "453782",
 "text": "Céret is a commune in the Pyrénées-Orientales department in southern France. It was the capital of the historic Catalan comarque of Vallespir. It is a subprefecture in the department and the capital of the Céret arrondissement. == Name of the city == The name Céret comes from the Catalan name for the town: Ceret. Former known names of Céret are, in order of appearance, vicus Sirisidum in 814, vico Cereto in 866, villa Cerseto in 915, vigo Ceresido in 930, also Cered and Ceriteto in the 10th century, Ceret, Cericeto in the XIth and XIIth centuries, Cirset around 1070, Cersed (one of the most common forms) in 1130 and Cerset in 1138, and from the XIIIth to the XVth centuries Cereto, Ceret, Seret and Saret. Ceret becomes the most common form around the XVIth century. == Geography == Céret lies in the foothills of the Pyrénées mountains, in southern France. It is in the valley of the Tech river. It has an area of and its average altitude is ; at the city hall, the altitude is . The lowest point () of the commune is on the Tech river and the highest is on the Roc de Frausa (). Céret and its neighboring communes The commune is at from Perpignan, from Montpellier and at from Toulouse. It is surrounded by the communes Vivès, Saint-Jean-Pla-de-Corts, Maureillas-las-Illas, Reynès, Oms. === Climate === The climate of Céret, in the Köppen climate classification, is Cfb - Oceanic climate with template summers. ==Population== The inhabitants of Céret are known, in French, as cerétans (women: céretanes). With a population in 2014 of 7,663, Céret has a population density of inhabitants/km2. Evolution of the population in Céret Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:8000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:2000 start:0 ScaleMinor = gridcolor:lightgrey increment:1000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2011 text:2011 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 5438 bar:1975 from:0 till: 5987 bar:1982 from:0 till: 6798 bar:1990 from:0 till: 7285 bar:1999 from:0 till: 7291 bar:2006 from:0 till: 7568 bar:2011 from:0 till: 7583 bar:2014 from:0 till: 7663 PlotData= bar:1968 at: 5438 fontsize:S text: 5,438 shift:(-12,5) bar:1975 at: 5987 fontsize:S text: 5,987 shift:(-18,5) bar:1982 at: 6798 fontsize:S text: 6,798 shift:(-18,5) bar:1990 at: 7285 fontsize:S text: 7,285 shift:(-18,5) bar:1999 at: 7291 fontsize:S text: 7,291 shift:(-18,5) bar:2006 at: 7568 fontsize:S text: 7,568 shift:(-18,5) bar:2011 at: 7583 fontsize:S text: 7,583 shift:(-18,5) bar:2014 at: 7663 fontsize:S text: 7,663 shift:(-18,5) == Administration == Céret is a subprefecture of the Pyrénées- Orientales department since 1790. It is also the capital of the arrondissement of Céret and the administrative centre () of the canton Vallespir-Albères with 13 communes and 29,894 inhabitants in 2014. It is part of the intercommunality Vallespir (). ===Mayors=== Mayor Term start Term end Onuphre Tarris 1919 1940 Henri Rey 1940 1941 Henri Mouchard 1941 1943 Jean Maler 1943 1944 Jacques Souquet 1944 1945 Gaston Cardonne 1945 1947 Henri Guitard 1947 1963 Marcel Parayre 1963 1964 Michel Sageloly Sr. 1964 1983 Henri Sicre 1983 1995 Michel Sageloly Jr. 1995 1996 Henri Sicre 1996 2001 Alain Torrent 2001 2020 Michel Coste 2020 === Twin cities === Céret is a twin town of: * Almonte, Spain * Banyoles, Spain * Lüchow, Germany == Economy == The region around Céret is a major fruit producer, in particular famed for its cherries. The first of the season's pick are, by local tradition, sent to France's President. Céret has a cherry festival each year. The cherry season is during the end of April and May. == Sites of interest == Céret is famous for its Musée d'Art Moderne (Museum of Modern Art), which has numerous Picasso paintings, sculptures and ceramics. The museum also features paintings by Chagall, Matisse, Herbin, Soutine, lots of Fauves and a few Impressionists. The Museum of Musical Instruments opened in May 2013 and has a unique collection of instruments and musical scores. The Pont du Diable (Devil's Bridge) is a single arch stone bridge built between 1321 and 1341. == Gallery == File:Céret, France, main street 2.jpg|Céret, main street File:Ceret, església barroca.jpg|Saint Peter church, Céret File:Céret 2010 001.jpg|Le Tech river, Céret File:Pont du Diable 2.JPG|Le Pont du Diable (The Devil's bridge), Céret == Related pages == * Arrondissement of Céret * Communes of the Pyrénées-Orientales department == References == == Other websites == * City Council website * Ceret tourist information office * Communauté de communes du Vallespir * Museum of Modern Art website Category:Subprefectures in France Category:Communes in Pyrénées- Orientales",
 "title": "Céret"
}