{
 "id": "453840",
 "text": "Interlanguage fossilization is when people learning a second language take rules from their native language and incorrectly apply them to the second language they are learning.fossilize in the Random House Unabridged Dictionary: (of a linguistic form, feature, rule, etc.) to become permanently established in the interlanguage of a second-language learner in a form that is deviant from the target-language norm and that continues to appear in performance regardless of further exposure to the target language. This results in a language system that is different from both the person's native language and second language. In 1972, Selinker showed the concept of \"interlanguage fossilization\". ==Causes== There are two reasons why the interlanguage fossilization happens: * Adults' learning style: Interlanguage fossilization occurs in adults learning a new language. Unlike the child, adults can't ignore about language rules and grammar. When adults study a new language, they always check the language rules or grammar. This can make learning a language much harder. Adults are more likely to be influenced by their native language. The native language interferences hold adults back from improving language proficiency. Many adults language learners experience the interlanguage fossilization. * Acceptance: Acceptance of a new culture can also cause interlanguage fossilization. If the learners are in a new country, then they may have to learn a new language. When the learners are in new cultures, they try to make it suitable for themselves in new circumstances. At first, they worry because there are big cultural differences. Therefore, the learners study hard. After time goes by, people stop studying a new language because they do not worry anymore. The learner think that they are fully adapted in the new culture and they are confident with their new language proficiency. Then, interlanguage fossilization happens. == References == *Brown, H. D. (2007). Principles of Language Learning and Teaching (5th ed.). White Plains, NY:Pearson Education. *ZhaoHong Han. (2004) Clevedon, England: Multilingual Matters. Pp. x + 201. Fossilization in Adult Second Language Acquisition *Xueping Wei, (2008) Implication of IL Fossilization in Second Language Acquisition. Graduate School of Foreign Language, Beijing Language and Culture University. Vol.1, No.1 Category:Language Category:Learning",
 "title": "Interlanguage fossilization"
}