{
 "id": "45423",
 "text": "Richard III (1452–1485) was the King of England from 1483 until 1485. He was the last king from the House of Plantagenet. Richard was part of the House of York during the Wars of the Roses. He was the younger brother of King Edward IV. When Edward IV died, his 12-year-old son became King Edward V. Richard was given the role of \"LOrd Protector\", meaning he would run the country until Edward V became an adult. However, Edward IV, a well-known womanizer, had entered into a second secret marriage with his children's mother while he was still married to Eleanor Butler. That made all of his seven children illegitimate. The Three Estates and the City of London began discussions about the evidence brought forth by Bishop Robert Stillington, and they concluded that the late king had committed bigamy, which made his children bastards, who were ineligible to inherent the throne. The crown was presented to the oldest male relative of Edward IV, Richard. The rumour that Richard had ordered the boys to be killed originated in the French court and did not reach England for several months. Richard put down a rebellion in October 1483 by his old friend the Duke of Buckingham, and the simultaneous first attempt by Henry Tudor and his French troops to land in England to usurp the throne. Buckingham was beheaded for high treason, and bad weather on the English Channel prevented Henry from landing. Henry successfully landed in Wales in August 1485. While he did not succeed in attracting men to his cause, the Stanley brothers agreed to bring their sizable private army with him. That led to the Battle of Bosworth Field in which Richard was betrayed and killed by William Stanley's men. His nude body was put on public display in Leicester for three days before Henry allowed the body to be buried in a quickly-dug grave in their priory in Leicester. In 2012, Richard's skeleton was rediscovered beneath a car park, where the priory had once stood. It was reburied in Leicester Cathedral in March 2015. For many years, Richard III was seen as a villain. The Tudor dynasty encouraged that, as did Shakespeare's famous play Richard III. Almost all writers at the time saw him as either a hero or a villain. In both the past and the present, some writers say that Richard III made many good laws, such as an individual is innocent until proven guilty, and land and property cannot be seized while an accused awaited trial. He abolished various illegal means by which the southern English nobility made money off the lower classes, which made Richard several enemies. Others argue that he was ruthless but that his behaviour was common for the powerful people of that time. == Early life == Richard was the youngest son of Richard, Duke of York. He had three elder brothers: Edward, Edmund and George. Both Richard, Duke of York, and his second son, Edmund, were killed in battle during the Wars of the Roses. The eldest son, Edward, was a very good soldier and won the throne of England in battle against the reigning king, King Henry VI. Edward then became King Edward IV of England, and his two brothers, George and Richard, became powerful men. Richard married Anne Neville, whose father had once been a friend of the family. Richard and Anne had known each other since they were children, but Anne had been taken to France, where she had married the Prince of Wales, the son of Henry VI. When the Prince of Wales was killed in battle, Anne became a widow and soon was married to Richard even though he had been her husband's enemy. Richard and Anne lived at Middleham Castle, in North Yorkshire. They had one son, who was named Edward after Richard's brother, King Edward. Richard quarrelled frequently with his brother George, who was married to Anne's sister, Isabel. King Edward became so angry that he put George in prison, where he died. King Edward married a woman called Elizabeth Woodville, who had been married before and had many relatives. Soon, her relatives became very rich and powerful, which caused bad feeling among those who had been in the king's favour before the marriage. Edward and Elizabeth had several children, including two sons, who were named Edward and Richard. When Edward IV suddenly died in April 1484, his elder son became King Edward V, but he was still a boy. Richard had been asked by his brother the king to look after the two boys. He was worried that the new young king would not be able to rule the country properly. He was also worried that the Woodvilles would soon be telling the king what to do and rule the country for themselves. == King == Richard took the throne from his nephew two months later. He claimed that Edward IV's marriage to Elizabeth Woodville was not a proper marriage, which would mean that Edward V could not be king. Parliament then passed a law that agreed with him. He was crowned as Richard III on 6 July 1483. King Richard sent Edward and his brother to live in the Tower of London. A few months later, the princes in the tower disappeared and were never seen again. That became the mystery of the Princes in the Tower. At the time, many people believed that Richard had ordered someone to kill them. Many historians agree, but there is no way to be certain. Richard was not in London at the time, but the boys were guarded by men who were loyal to him. As people started to believe that Richard had ordered the boys to be killed, many people turned against him. One of them was his friend the Duke of Buckingham, who started a failed rebellion. Henry Tudor, a distant relative of the House of Lancaster, then became Richard's main enemy, returned to England and raised an army. Richard and Henry's armies fought each other at the Battle of Bosworth Field in 1485. Henry won the battle and became the next King of England as Henry VII. Richard was killed in the battle though not by Henry himself. Richard was the last English king to die in battle. He suffered 13 head wounds; two were so severe that they would have killed him almost immediately. After the battle, his body was stripped of clothing and carried naked on the back of a horse to Leicester. He was buried in Greyfriars Church. ==Rediscovery and reburial of the body== Greyfriars Church was later demolished, and the site became part of the garden of a large house. For about 200 years, a stone pillar marked the site of the grave, which had disappeared by 1844. Other buildings were added to the site over the years. By 1944, the area around the grave had become a car park for the nearby council offices. In 2012, archaeologists began a project to find the body. On 24 August 2012, they started digging in the car park and found a skeleton on the first day. On 12 September, they suggested that the skeleton was that of Richard III. On 4 February 2013, it was announced that it was his and that they had used DNA testing to confirm ther result. His skeleton shows that he was killed by two head wounds, similar to how 15th-century writers said that he died. It also shows that the body was further damaged after his death. Richard's skeleton revealed he had severe scoliosis. On 26 March 2015, Richard's body was reburied. It now lies in a tomb in Leicester Cathedral. ==Historians' views== There has been discussion for many years about whether Richard III was good or bad. During his reign, which lasted only two years, he was very popular in parts of the country, especially in northern England. However, his enemies raised a big army against him and defeated him in battle. It is often said that \"history is written by the winners\". After Henry VII won, Richard III was often treated as a villain in writings and stories. For example, in Shakespeare's play Richard III, he is shown to be totally evil. On the other hand, some writers from the time of Richard's reign make him a hero and ignore his flaws. In 1605, the historian William Camden wrote that \"he lived wickedly, yet made good laws\". Modern historians also try to be careful when judging Richard III. For example, some historians have praised him for giving ordinary people more rights. However, many also think that he ordered the killing of the Princes in the Tower. Among the laws that Richard III made were removing limits on the printing and sale of books, more rights to people accused of a crime, laws to protect people from fraud when land was sold, bans on other types of fraud and changing the law from French into English. He created the Council of the North, which for the next 150 years would help solve problems in northern England. ==References== == Other websites == * Richard III society Category:1452 births Category:1485 deaths Category:House of York Category:Kings and Queens of England Category:Military people killed in action Category:People from Northamptonshire Category:15th century in England Category:British people with disabilities",
 "title": "Richard III"
}