{
 "id": "454330",
 "text": "\"Torn\" is a song written by Scott Cutler, Anne Preven, and Phil Thornalley for their band Ednaswap. It became famous when it was covered by Australian singer-songwriter Natalie Imbruglia for her debut album Left of the Middle. Imbruglia got a Grammy nomination for Best Female Pop Vocal Performance fot the track, losing to Celine Dion's \"My Heart Will Go On\". == Music video == The music video, directed by Alison Maclean shows Imbruglia singing along with the song are interspersed with footage of her and Jeremy Sheffield engaging in a romantically conversation. These couple of scenes turn out to be B-roll footage. During the last chorus, the apartment walls start wobbling and the crew comes to dismantle it. Imbruglia begins to dance during the finishing guitar solo as her \"world\" crumbles around her. The video of the song was rated the second best video of all time by MTV Italy. == Chart performance (Sale) == The physical single of Imbruglia's version of the song has sold more than 4 million copies worldwide, including more than 1 million copies in the UK alone. In the UK, it is the 85th biggest selling single of all time. The track peaked at #2 for three weeks, being held off the top spot by Aqua's \"Barbie Girl\" and then dropped to #4. As a result, the song is the second biggest-selling single in history not to have topped the UK Singles Chart. On 24 September 2007, Natalie Imbruglia's version of the song re-entered the UK Singles Chart at #70, on the strength of digital sales after her greatest hits album was released. In the Flanders region of Belgium, the single peaked at a number one for 7 weeks and charted for 22 weeks. As of 2011, \"Torn\" holds the record for most played song on Australian radio since 1990, played more than 300,500 times since its 1998 release. In the United States, the song peaked at #1 on the Hot 100 Airplay chart for 11 consecutive weeks. In 2003, \"Torn\" was declared the No. 1 Best Pop Song on a top 10 list, part of a larger collection of songs by Q magazine in their special edition 1001 Best Songs Ever. Billboard ranked \"Torn\" the No. 26 Best Pop Song based only on pop radio charts compiled between 1992–2012. == Charts and certifications == === Charts === Chart (1998) Peak Position Australia (ARIA)\"Natalie Imbruglia Torn (Song).\" Australian-Charts.com. Hung Medien. Retrieved 8 April 2016. 2 Austria (Ö3 Austria Top 40)\"Natalie Imbruglia Torn.\" AustrianCharts.at: Das Österreichische Hitparaden und Musik-Portal. Hung Medien. Retrieved 8 April 2016. 3 Belgium (Ultratop 50 Flanders)\"Natalie Imbruglia Torn.\" Ultratop: Vlaanderen De Enige Echte Officiële Hitparade. Hung Medien. Retrieved 8 April 2016. 1 Belgium (Ultratop 50 Wallonia) 5 Canada (RPM) 1 Denmark (IFPI) 1 European Hot 100 2 Finland (Suomen virallinen lista) 8 France (SNEP)\"Natalie Imbruglia Torn (Chanson).\" LesCharts.com. Hung Medien. Retrieved 9 April 2016. 4 Germany (Media Control AG) 4 Ireland (IRMA) 4 Italy (FIMI) 2 Netherlands (Dutch Top 40) 2 New Zealand (Recorded Music NZ)\"Natalie Imbruglia Torn (Song).\" Charts.org.NZ. Hung Medien. Retrieved 9 April 2016. 5 Norway (VG- lista)\"Natalie Imbruglia Torn (Song).\" NorwegianCharts.com. Hung Medien. Retrieved 9 April 2016. 6 Spain (AFYVE) 1 Sweden (Sverigetopplistan)\"Natalie Imbruglia Torn (Song).\" SwedishCharts.com. Hung Medien. Retrieved 9 April 2016. 1 Switzerland (Schweizer Hitparade)\"Natalie Imbruglia Torn.\" Hitparade.ch: Die Offizielle Schweizer Hitparade. Hung Medien. Retrieved 9 April 2016. 2 UK Singles (Official Charts Company) 2 US Billboard Adult Contemporary\"Natalie Imbruglia: Left of the Middle Awards.\" AllMusic. All Media Network, LLC. Retrieved 8 April 2016. 4 US Billboard Adult Top 40 1 US Billboard Hot 100 42 US Billboard Mainstream Top 40 1 US Billboard Modern Rock Tracks 12 === Certifications === Region Certification Sales/Shipments Australia (ARIA) Platinum 70,000 Belgium (BEA)\"Ultratop 50 Compilations Wallonie 1998.\" In \"Awards 1998.\" Ultratop: Belgique Francophone Le Seul Classement Officiel. Hung Medien. Retrieved 9 April 2016. Platinum 50,000 France (SNEP) Gold 262,000 Germany (BVMI) Germany 250,000 Sweden (GLF) Platinum 30,000 Switzerland (IFPI Switzerland) \"Awards: Natalie Imbruglia.\" Hitparade.ch: Die Offizielle Schweizer Hitparade. Hung Medien. Retrieved 9 April 2016. Gold 25,000 United Kingdom (BPI) Platinum 1,110,000 == References == Category:1997 songs Category:1990s ballads Category:Pop ballads Category:Rock ballads Category:Alternative pop songs Category:Natalie Imbruglia songs",
 "title": "Torn"
}