{
 "id": "454495",
 "text": "In fishing, casting is the act of throwing bait or a lure using a fishing rod, reel, and line. Several types of rod and reels are designed just for casting. The method of casting can vary but in each case the object of casting is to get the bait or lure to where the fish are. == Basic methods == The most accurate type of cast is the 'overhead cast'. The angler raises the rod (and reel) back behind the head, then quickly flicks the rod forward, releasing the line as the cast is completed.James A. Cruikshank, 'Bait Casting for Black Bass', Field and Stream, Ninth Year, Number one (May 1901), p. 160 The 'side cast' is less forceful but easier to learn. The rod is swung back in a horizontal motion then quickly moved forward releasing the line.A. J. McClane, McClane's Secrets of Successful Fishing (New York: H. Holt, 1979), p. 13 Both basic methods have variations. But both are popular when using spinning and casting rods. Fly fishing uses similar movements, but the line release is different. All types of rods and reels need to match the weight rating of the rod, reel, line and lure for best performance. === Spinning rods & reels === Anyone can learn to cast a lure with a spinning rod and reel in just a few minutes.'Spinning: An Easy Way to Fish', Boys Life, Special Fishing Issue (June 1981), p. 39 Two types of spinning reels, open faced and close faced.Jeff Deitrich, Spinner Fishing for Trout: A Proven System of Tackle, Techniques, and Strategies for Catching Trout (Mechanicsburg, PA: Stackpole Books, 2003), p. 6 They work differently. With a closed face reel a push- button is held down and released at the end of the cast. Open face reels require the angler to first open the bail, then hold and release the line with your forefinger as you cast. Open faced reels have a disadvantage when casting short distances. Short casts causes the line to twist. This in turn causes line tangles on the spool. Spinning rods and reels work best using light line and light lures.Dannie Elwins, 101 Fly Fishing Tips for Beginners and Experts (Dannie Elwins, 2009), p. 5 Spinning reels have an advantage over casting reels when casting into the wind. === Bait casting rods & reels === Bait casting (also called baitcasting) reels come in different sizes and capacities. Depending on use, they also can have different features. The common feature is a horizontal spool that the line winds onto. Casting reels usually have better control of the line and lure. They have better accuracy than other types. Bait casting reels are better at handling heavier line and lures. But there is a learning curve to become skilled with a bait casting rod and reel. To cast a bait casting reel, a push-button is pressed and held until you want to release the line. Bait casting reels have a tendency to 'snarl' or 'backlash'. This is because during the cast the line is coming off the reel at a high rate of speed. When the lure hits the water the line stops. But the spool on the reel keeps turning, causing the line to snarl up. This is even more so when casting into the wind. Practice with bait casting reels minimizes this problem. To control snarling, bait casting reels usually have a brake. This automatically stops the spool when the line stops. Reels have either a magnetic brake control or a centrifugal brake control. Some have both. These must be adjusted to balance between good distance in casting and preventing backlash. Many anglers set the brake lightly to allow more distance. Then they control the braking with their thumb on the spool. Low-profile bait casting reels are designed especially for using the thumb. === Saltwater Baitcasting Reels & Rods === Saltwater baitcasting might seem intimidating, but this dynamic duo of rod and reel can unlock a world of precision angling in the salty realm. Ditch the spinning reel's passive approach – baitcasters offer direct line control, letting you cast with laser accuracy, skip lures across the surface, and maneuver them around structure with finesse, crucial for targeting saltwater veterans like redfish and snook. Their rugged construction stands up to the harshness of the ocean, boasting corrosion-resistant bodies, powerful drags, and sealed bearings to handle aggressive fish and relentless waves. Forget the dreaded backlash – modern baitcasting reels feature advanced braking systems that adapt to your casting style, making them surprisingly beginner-friendly. So, where do you start? Here are some rod and reel combos to consider for your saltwater baitcasting journey: ==== Rod ==== * Shimano Encounter Shore: This versatile rod comes in various lengths and actions, making it perfect for targeting various inshore species. Its lightweight construction and Fuji guides provide excellent feel and casting performance. * St. Croix Mojo Salt: This budget-friendly option offers exceptional value, with a durable graphite blank and comfortable cork grips. Its moderate action handles a variety of lures and fish sizes, making it a great learning tool. * Daiwa Fuego Baitcasting Rod: This rod is known for its sensitivity and power, thanks to its high-modulus graphite blank and split-grip design. It's a great choice for targeting larger inshore fish like jack crevalle and cobia. ==== Reel ==== * Abu Garcia Pro Max Baitcast: This classic reel delivers a smooth, reliable performance with its corrosion-resistant components and magnetic braking system. Its comfortable palm grip and adjustable drag make it easy to learn and adapt to different fishing situations. * Pflueger President XT Baitcasting Reel: This reel features a low-profile design for increased casting comfort. Its sealed bearings and durable construction make it a good choice for saltwater environments, while its external braking system allows for easy adjustments on the fly. * KastKing Spartacus Maximus Baitcasting Reel: This budget-friendly option offers surprising quality, with a strong aluminum frame and powerful drag. Its dual braking system provides confidence for beginners, while its comfortable palm grip makes long days on the water enjoyable. Remember, choosing the right rod and reel is personal. Consider your target species, fishing style, and budget when making your decision. Don't be afraid to ask experienced anglers or visit local tackle shops for advice. With the right gear and practice, saltwater baitcasting can open a world of exciting possibilities, transforming you from a passive angler to a master of the tide. ==== Flipping and pitching ==== Among the specialized types of casts with a bait casting rod are two made popular by tournament fishermen: * Flipping (or Flippin') is a very short cast of just a few feet. It drops a lure into heavy cover.Steve Price; Guy Eaker, Catching Bass Like a Pro (Helena, MT: Falcon, 2000), p. 50 It requires a stiff rod and heavy braided fishing line. * Pitching (or Pitchin') is a short cast of just a few yards. Also for heavy cover it also works with a stiff rod and heavy braided fishing line. In both methods, the rod is used to swing the lure (like a pendulum) out over the water. In both cases the lure enters the water very quietly and so as not to frighten the fish. File:Fishing-spinning-reel.JPG| File:Baitcaster.jpeg| File:Multisnelle.jpg| File:Rodonleaf.JPG| File:Señuelo de Pesca.jpg| File:Spinner lure no feather ora.png| File:AdamsDryFly.jpg| === Fly rods & reels === Fly fishermen use artificial flies as a lure. Most flies have almost no weight and by themselves could not be cast with other types of rods and reels. The fly rod works because it uses a much heavier line than the other types. It is the line that is being cast. The fly simply goes where the line goes. Fly casting looks more difficult than it is.John Bailey, The Complete Guide to Fishing: The Fish, the Tackle, and the Techniques (Guilford, CT: Lyons Press, 2003), p. 110 In less than a couple of hours most beginners can learn the basic cast. Fly casting is more involved than other types of casting.Ken Schultz, Ken Schultz's Essentials of Fishing: The Only Guide You Need to Catch (Hoboken, NJ: Wiley, 2010), p. 327 There are fly fishing schools that teach fly casting. To cast a fly rod, the angler pulls several feet of line off the reel.John Bailey, The Complete Guide to Fishing: The Fish, the Tackle, and the Techniques (Guilford, CT: Lyons Press, 2003), p. 112 The rod tip is moved back then in a fluid motion and accelerating, it is moved forward as the line is released. In fishing streams and rivers, trees and shrubs on the bank may prevent an overhead cast.Gene Kugach, Freshwater Fishing Tips and Techniques (Mechanicsburg, PA: Stackpole Books, 1997), pp. 104–05 Another type of cast is the 'roll cast'. Using the rod tip the fisherman forces the rod tip down to roll the line forward. Most fly lines are rated by a weight system. A 1wt (one weight) is very light while a 13wt is very heavy.Michael D. Shook, The Complete Idiot's Guide to Fly Fishing (New York, NY : Alpha Books, 1999), p. 20 It would be suitable for large salt water fish. Rods (and reels) are rated by the weight of the line they are designed for. Unfortunately there is no one size for all kinds of fish and fishing situations. === Net casting === The term may also be used for casting a net. The net is cast (thrown) by hand so that it spreads out on the water and sinks. Fish are caught in the net and it is hauled back in. Net casting is often used to catch fish for bait.Gunnar Miesen; Steve Hauge, Live Bait Fishing: Including Doughbait & Scent (Mankato, MN: Creative; Hove, UK: RotoVision, 2005), p. 20 Modern cast nets have a radius of from 4 to 12 feet (1.2 to 3.6 metres). A larger net full of fish may take more than one person to pull it in. Cast nets also sometimes use a 'net thrower' device. This helps spin the net as its thrown, keeping it open. Cast nets work best in shallow water. == Competitive casting == Casting (known as Casting Sport) is also a sport. The sport is supervised by the International Casting Sport Federation (ICSF). As of April 2014 are in 31 countries. Casting competitions were active in England and the United States in the later 1800s. In 1881 the first tournament was held just outside of London. In 1955, 14 different national associations started the ICF (now ICSF). The ICSF sets all international standards for the sport. It sponsors tournaments. It also recognizes world records for accuracy and distance. This sport uses plastic weights or hookless flies. Competitions can be held on water or on athletic fields. There are competitive divisions for almost all types of fly, fixed spool and revolving spool tackle, and competitor classes. Competitive casting is part of the World Games. World Championship in 2014 are to be held in Szamotuly (Poland), from 3 to 7 September. ==References== ==Other websites== * How to do the overhead cast * How to do the side cast * Casting a fly rod *How to use fishing pliers Category:Fishing",
 "title": "Casting (fishing)"
}