{
 "id": "454564",
 "text": "Alain Mabanckou (born 24 February 1966) is a writer. He is a French citizen born in the Republic of the Congo. His first novel was published in 1998. Mabanckou's work has been published in fifteen languages. His non-fiction books talk about Africa and the African diaspora in France.\"Alain Mabanckou, l'enfant noir\". \"G.L.\", Le Nouvel Observateur, 19 August 2010. Mabanckou is a Professor of Literature at UCLA. == Early Life == Alain Mabanckou was born in Congo-Brazzaville in 1966 . He spent his childhood in the coastal city of Pointe-Noire .He received a scholarship at The Marien Ngouabi University in Brazzaville to go to France at the age of 22 . After receiving a post-graduate Diploma in Law from the Université Paris-Dauphine, he worked for about ten years for the group Suez-Lyonnaise des Eaux. == Awards == * Prix de la Société des poètes français, 1995 for L'usure des lendemains * Grand prix littéraire d'Afrique noire, for Bleu-Blanc-Rouge, 1999 * Prix du roman Ouest-France- Etonnants Voyageurs 2005, for Verre cassé * Prix des cinq continents de la francophonie 2005, for Verre cassé * Prix RFO du livre 2005, for Verre cassé * Prix Renaudot 2006, for Mémoires de porc-épic * Prix de La Rentrée littéraire 2006, for Mémoires de porc-épic * Prix Aliénor d'Aquitaine 2006, for Mémoires de porc-épic * Prix Créateurs Sans Frontières 2007 (Ministère français des Affaires Etrangères), for Mémoires de porc-épic * Médaille de citoyen d'honneur de la ville de Saint-Jean-d'Angély (Charente-Maritime, France), 2004 * Chevalier de la Légion d'honneur par décret du Président de la République française, 2010. * Georges Brassens Prize 2010, for Demain j'aurai vingt ans * Académie Française Prize : Grand Prix de littérature Henri Gal 2012 for his entire work * Premio Strega Europeo : 2015, Finalist * Man Booker International Prize: 2015, Finalist * 2016 Puterbaugh Fellow for the entire body of work * 2017 Man Booker International Prize selection for the novel Black Moses * The Guardian ranked Broken Glass #99 in its list of 100 Best Books of the 21st Century. * ==References== Category:1966 births Category:Living people Category:French novelists Category:Republic of the Congo people Category:University of California, Los Angeles faculty",
 "title": "Alain Mabanckou"
}