{
 "id": "454688",
 "text": "Robin Morgan (born January 29, 1941) is an American activist, poet, and actress. She is most well known for her work as a key member of the feminist movement. She is most well known for organizing the 1968 Miss America Protest in Atlantic City, New Jersey. == Early life == She attended The Wetter School in Mount Vernon, and graduated in the year 1956. Although, after finishing her high school degree, her mother did not let her attend a formal university. Instead, she had a private tutor teach her college level courses and took some classes from Columbia University as a part-time student there. == Career == Her career started very young as a child model and actress. In 1945, she had her own radio show called The Little Robin Morgan Show. At that same time, she appeared multiple times as a consistent guest star on Juvenile Jury. Her best known work as an actress was on Mama, where she was one of the main characters for 7 years. Then, at age 14 she decided to switch her focus to her writing. Starting in the 1950s, she published her poems and other writing pieces. In the 1960s, she also worked as a literary agent and freelance editor in New York City. In 1968, she helped to organize the Miss America Protest in Atlantic City, New Jersey. This protest fought to end the Miss America annual beauty pageants because they enforced sexist beauty standards. This work spurred her on to join more committees and have a larger voice in the feminist movement as well as other activist movements. From 1989 to 1994 she was the editor-in-chief of Ms. Magazine, the first national liberal feminist news magazine. She did most of her activism work during the late 1900’s and early 2000’s. She has protested both nationally and globally. Her other work nationally includes protesting against pornography in the media, unequal pay, sexual harassment and assault, and many more feminist issues. Globally she traveled all around the world (especially in the late 1980’s) to fight for women's rights, racial equality, and more. Her career started as a child actress and model, before she ultimately decided to focus on her writing. She is now an award-winning author who has published poetry, nonfiction books, and fictional novels. She has also founded and/or been an important member of the National Battered Women's Refuge Network, the Student Nonviolence Coordinating Committee (SNCC), Women's Media Center, the National Network of Rape Crisis Centers, the Feminist Writers' Guild, the Women's Foreign Policy Council, the Congress of Racial Equality (CORE), the National Museum of Women in the Arts, the Sisterhood Is Global Institute, the Anti-Vietnam War movement, GlobalSister.org, New York Radical Women, W.I.T.C.H., and Greenstone Women's Radio Network. Now, she also works as a lecturer across the globe in universities and workplace settings. She also still is publishing her writing work. ==Filmography== ;1940s *Citizen Saint: The Life of Mother Cabrini (playing Francesca S. Cabrini as a child) *The Little Robin Morgan Show as herself (WOR radio show) *Juvenile Jury as herself ;1950s *Mama as Dagmar Hansen * Kraft Television Theatre's Alice in Wonderland (as Alice) *Mr. I-Magination (as self) *Tales of Tomorrow (starring as Lily Massner) *Kiss and Tell TV Special (starring as Corliss Archer, 1956) *Other videos and kinescopes in the Robin Morgan Collection at the Paley Center for Media, NYC ;1980s - 2010s *Not a Love Story: A Film About Pornography [Feature length Documentary] (as herself) (1981) *The American Experience TV Documentary (as herself) (2002) *1968 TV Documentary with Tom Brokaw (as herself) (2007) *Interview by Ronnie Eldridge (2007) *Makers: Women Who Make America on PBS (2013) == Publications == ===Poetry=== *1972: Monster (Vintage, ) *1976: Lady of the Beasts: Poems (Random House, ) *1981: Death Benefits: A Chapbook (Copper Canyon, Limited Edition of 200 copies) *1982: Depth Perception: New Poems and a Masque (Doubleday, ) *1999: A Hot January: Poems 1996–1999 (W. W. Norton, ) *1990: Upstairs in the Garden: Poems Selected and New (W. W. Norton, ) ===Nonfiction=== *1977: Going Too Far: The Personal Chronicle of a Feminist, (Random House, ) *1982: The Anatomy of Freedom (W.W. Norton, ) *1989: The Demon Lover: On the Sexuality of Terrorism (W. W. Norton, ) **2001: The Demon Lover: The Roots of Terrorism (Updated Second Edition, Washington Square Press/Simon & Schuster, Inc., ) *1992: The Word of a Woman (W.W. Norton, ) *1995: A Woman's Creed (pamphlet), The Sisterhood Is Global Institute *2001: Saturday's Child: A Memoir (W. W. Norton, ) *2006: Fighting Words: A Toolkit for Combating the Religious Right (Nation Books, ) ===Fiction=== *1987: Dry Your Smile (Doubleday, ) *1991: The Mer-Child: A New Legend for Children and Other Adults (The Feminist Press, ) *2006: The Burning Time (Melville House, ) ===Anthologies=== *1969: The New Woman (Poetry Editor) (Bobbs-Merrill, ) *1970: Sisterhood is Powerful: An Anthology of Writings from the Women's Liberation Movement (Random House, ) *1984: Sisterhood Is Global: The International Women's Movement Anthology (Doubleday/Anchor Books; revised, updated edition The Feminist Press, 1996, ) *2003: Sisterhood Is Forever: The Women's Anthology for a New Millennium (Washington Square Press, ) ===Essays=== * \"The politics of sado-masochistic fantasies\" in * \"Light bulbs, radishes and the politics of the 21st century\" in ===Plays=== *\"Their Own Country\" (debut performance, Ascension Drama Series, New York, December 10, 1961 at 8:30pm, Church of the Ascension, reception immediately following.) *\"The Duel.\" A verse play, published as \"A Masque\" in her book Depth Perception (debut perf. Joseph Papp's New Shakespeare Festival Public Theater, New York, 1979) == Related pages == *List of poets from North America == References == ==Other websites== * * Womens Media Center * The Sisterhood is Global Institute *Ms. Magazine * Papers of Robin Morgan, 1929–1991 (inclusive), 1968–1986 (bulk). Schlesinger Library, Radcliffe Institute, Harvard University. * Robin Morgan Video produced by Makers: Women Who Make America * Category:1941 births Category:American feminists Category:Living people Category:American poets Category:American activists",
 "title": "Robin Morgan"
}