{
 "id": "454747",
 "text": "Ronald Balfour Corbett CBE (4 December 1930 – 31 March 2016) was a Scottish comedian, writer, actor, and broadcaster. He was a member of the Corbett family. He was best known for his long association with Ronnie Barker in the BBC television comedy sketch show The Two Ronnies. == Early life == Ronald Balfour Corbett was born at Edinburgh Royal Maternity Hospital and Simpson Memorial Maternity Pavilion in Edinburgh, Scotland on 4 December 1930. He was the son of William Balfour Corbett (1898–1974), a master baker, and his London-born wife Annie Elizabeth Corbett (née Main; 1900–1991). He had a brother, Allan, and a sister, Margaret. == Personal life == Corbett married the actress and dancer Anne Hart at Brixton registry office on 30 May 1966.England & Wales, Civil Registration Marriage Index, 1916-2005: APR 1966 5d 183 LAMBETH – Ronald B Corbett = Anne M Padley The couple had two daughters, Emma and Sophie. Their first child, Andrew, had a heart defect and died when he was six weeks old, at St Thomas' Hospital, in London. He had four grandchildren, including Dylan Corbett-Bader. Corbett and Hart first met during the late 1950s. He was an up-and-coming comedian and she was working as a dancer at Winston's, Hanover Square, a club owned by Danny La Rue. The couple were married for 49 years until his death on 31 March 2016. Corbett and Hart lived in a seven bedroom property named Fairways in Addington, London from 1970 to 2003. The couple also owned a Scottish home named Muirfield Wood located in Gullane, East Lothian. == Death == Corbett died at Shirley Oaks Hospital in Shirley, London, England on 31 March 2016, surrounded by his family. He was 85. He had been diagnosed with motor neurone disease in 2015. Corbett's funeral was conducted by Canon Arthur Quinn at St. John the Evangelist near his home in Shirley on 18 April 2016. Mourners included Sir Michael Parkinson, David Walliams, Jimmy Tarbuck, Barry Cryer, and Rob Brydon. His body was cremated following a private service at Croydon Crematorium. His memorial service was held in Westminster Abbey on 7 June 2017. Mourners included Dame Joanna Lumley, Maureen Lipman, Dame Barbara Windsor, and Dame June Whitfield. His widow, Anne Hart, died at Muirfield Wood on 5 November 2023, at the age of 90. ==References== Category:1930 births Category:2016 deaths Category:Actors from Edinburgh Category:Scottish comedians Category:Scottish movie actors Category:Scottish stage actors Category:Scottish television actors",
 "title": "Ronnie Corbett"
}