{
 "id": "45473",
 "text": "A punt is a flat boat with a broad front. It is designed for use in small rivers or other shallow water. Punting means boating in a punt. The punter pushes a pole against the river bed (the bottom of the river) and this gives the punt a way to move. Punts were originally built as cargo boats or platforms. They were for shooting at birds and fishing. In modern times they are mostly used for pleasure trips on the rivers in the university towns of Oxford and Cambridge in England. There are also races at summer regattas on the Thames. == Punt poles == Poles for pleasure punts are normally made of spruce, or aluminium. A normal pole is about 12–16 feet (4–5 m) long and weighs about 10 lb (5 kg). In Oxford and Cambridge 16 ft long poles are sometimes used. The bottom of the pole has a metal \"shoe\", a rounded lump of metal to protect the end. The shoe is sometimes made in the shape of a swallow tail. == Other websites == ===Clubs=== * Thames Valley Skiff Club, retrieved November 2018 * Sunbury Regatta, retrieved November 2018 * Wraysbury Skiff and Punting Club , retrieved November 2018 * Dittons Skiff & Punting Club, retrieved November 2018 * The Skiff Club, retrieved November 2018 ===Punting stations=== * Cherwell Boathouse, Oxford, retrieved November 2018 * Scudamore's Punting, Cambridge, retrieved November 2018 * Rutherford's Punting Cambridge, retrieved November 2018 * Punting on the Thames, retrieved November 2018 ===Further information=== * A Thames Library, retrieved November 2018 * A detailed non-commercial guide to punting (and other boating) on the Thames, retrieved November 2018 * The Scudamore's guide to punting in Cambridge, retrieved November 2018 * Daily Info guide to punting in Oxford, retrieved November 2018 ===Punting around the world=== * In Christchurch, New Zealand * In Tübingen, Germany * In the Spreewald in Germany * On the Mutha River, India * On the Marais Poitevin, France * In Botswana Category:Boats",
 "title": "Punt (boat)"
}