{
 "id": "454938",
 "text": "Survivor Series (1987) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 26, 1987 at the Richfield Coliseum in Richfield Township, Ohio. It was the first Survivor Series event held by the WWF. ==Matches== No. Results Stipulations Times 1 Randy Savage, Jake Roberts, Ricky Steamboat, Brutus Beefcake, and Jim Duggan (with Miss Elizabeth) defeated The Honky Tonk Man, Hercules, Danny Davis, Ron Bass, and Harley Race (with Bobby Heenan and Jimmy Hart) Five-on-five Survivor Series elimination match 23:38 2 The Fabulous Moolah, Rockin' Robin, Velvet McIntyre, and The Jumping Bomb Angels (Itsuki Yamazaki and Noriyo Tateno) defeated Sensational Sherri, The Glamour Girls (Leilani Kai and Judy Martin), Donna Christanello, and Dawn Marie (with Jimmy Hart) Five-on-five Survivor Series elimination match 20:17 3 Strike Force (Tito Santana and Rick Martel), The Young Stallions (Paul Roma and Jim Powers), The Fabulous Rougeaus (Jacques and Raymond), The Killer Bees (Jim Brunzell and Brian Blair), and The British Bulldogs (Davey Boy Smith and Dynamite Kid) defeated The Hart Foundation (Bret Hart and Jim Neidhart), The Islanders (Haku and Tama), Demolition (Ax and Smash), The Bolsheviks (Nikolai Volkoff and Boris Zhukov) and The Dream Team (Greg Valentine and Dino Bravo) (with Johnny Valiant, Slick, Jimmy Hart, Bobby Heenan, and Mr. Fuji) Twenty-man tag team Survivor Series elimination match 37:14 4 André the Giant, One Man Gang, King Kong Bundy, Butch Reed, and Rick Rude (with Bobby Heenan and Slick) defeated Hulk Hogan, Paul Orndorff, Don Muraco, Ken Patera, and Bam Bam Bigelow (with Oliver Humperdink) Five-on-five Survivor Series elimination match 22:07 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Harley Race N/A Double countout 4:33 Jim Duggan Ron Bass Brutus Beefcake Pinfall 6:58 Brutus Beefcake The Honky Tonk Man 10:47 Danny Davis Jake Roberts 15:06 6 Hercules Randy Savage 20:56 7 The Honky Tonk Man N/A Countout 23:38 Survivors: Randy Savage, Jake Roberts, Ricky Steamboat Eliminated Wrestler Eliminated by Method Time Donna Christanello Velvet McIntyre Pinfall 1:57 Dawn Marie Rockin' Robin 4:12 Rockin' Robin Sensational Sherri 6:55 The Fabulous Moolah Judy Martin 10:55 Sensational Sherri Velvet McIntyre 14:56 Velvet McIntyre Leilani Kai 17:24 Leilani Kai Itsuki Yamazaki 18:38 Judy Martin Noriyo Tateno 20:17 Survivors: The Jumping Bomb Angels (Itsuki Yamazaki and Noriyo Tateno) Eliminated Wrestler (Tag Team) Eliminated by Method Time Boris Zhukov (Bolsheviks) Tito Santana (Strike Force) Pinfall 1:45 Jacques Rougeau (Fabulous Rougeaus) Ax (Demolition) 5:49 Smash (Demolition) N/A Disqualification 9:11 Tito Santana (Strike Force) Jim Neidhart (Hart Foundation) Pinfall 12:04 Dynamite Kid (British Bulldogs) Haku (Islanders) 19:57 Greg Valentine (Dream Team) Paul Roma (Young Stallions) 23:39 Bret Hart (Hart Foundation) Jim Brunzell (Killer Bees) 30:27 Tama (Islanders) B. Brian Blair (Killer Bees) 37:14 Survivors: Killer Bees and Young Stallions Eliminated Wrestler Eliminated by Method Time Butch Reed Hulk Hogan Pinfall 3:06 Ken Patera One Man Gang 8:45 Paul Orndorff Rick Rude 10:25 Rick Rude Don Muraco 11:20 Don Muraco One Man Gang 12:56 Hulk Hogan N/A Countout 18:05 King Kong Bundy Bam Bam Bigelow Pinfall 20:32 One Man Gang 22:52 Bam Bam Bigelow André the Giant 24:07 Survivor: André the Giant ==References== ==Other websites== *Official Survivor Series 1987 website Category:1987 in sports Category:1987 in the United States Category:Sports in Ohio Category:Survivor Series Category:1980s in Ohio",
 "title": "Survivor Series (1987)"
}