{
 "id": "4549",
 "text": "The United Nations (UN) is an organization between countries established on 24 October 1945 to promote international cooperation. It was founded to replace the League of Nations following World War II and to prevent another conflict. When it was founded, the UN had 51 members. Now there are 193. Most nations are members of the UN and send diplomats to the headquarters to hold meetings and make decisions about global issues. The goals of the United Nations are: * To keep world peace. * To help countries cooperate. *To reduce poverty amongst its members * To improve living conditions for people all over the world. * To make the world a better place. == History == After World War I, the nations of the world formed the League of Nations. The organization was a place where nations could talk through their differences calmly. However, some countries like Germany, Italy, and Japan ignored the League. They tried to solve their problems through war. Members of the League of Nations did not want to go to war to protect other members and so it failed. World War II soon started. The Allies of World War II often called themselves \"the United Nations\" since they were united against the Axis Powers. After the war, the winners formed a new organization for world peace. On 25 April 1945 in San Francisco, they decided on the name '\"United Nations\". In June, they signed the United Nations Charter and decided how the organization would work. The UN was created on 24 October 1945, and its first meeting was held in January 1946. Since 1947 24 October has been called “United Nations Day”. The only country whose flag is modeled after the United Nations is Somalia.Tittemore, Brian D. \"Belligerents in blue helmets: applying international humanitarian law to United Nations peace operations.\" Stan. J. Int'l L. 33 (1997): 61. == Headquarters == The United Nations is based in New York City, United States, except for the International Court of Justice, which is in The Hague, Netherlands. The leader of the United Nations is called United Nations Secretary-General. ==Activity== The UN's main buildings are in New York City. The UN also has offices in Geneva, Switzerland, Kenya, and Austria. The UN tries to be peaceful but it has been involved in armed conflicts. In the 1950s during the Soviet boycott of United Nations Security Council, the UN supported South Korea in a war against North Korea. In the 1990s, the UN helped to force Iraqi soldiers out of Kuwait. At other times, the UN has built peacekeeping forces. They travel to conflicted places in the world to keep the peace. In the 2020s there have been UN peacekeepers working in Cyprus, Lebanon, the DRC, Central African Republic, Pakistan, and several other countries. Through a series of goals, resolutions and declarations the United Nations has a set of commitments, actions, and goals to stop and reverse the spread of HIV and scale up towards universal access to HIV prevention, treatment, care, and support services. Some of the UN's main work involves the Sustainable Development Goals. These goals, sometimes called the Global Goals, were adopted by the General Assembly in 2015. These 17 goals are based around ending poverty and hunger, making people more equal, and taking action to stop climate change. UN agencies such as UNHCR, WFP, UNICEF, IOM and others are essential in delivering humanitarian assistance. == Divisions == The United Nations has six \"principal organs\": Principal organs of the United Nations Charter of the United Nations - Chapter III (Organs) UN General Assembly \\- Deliberative assembly of all UN member states (each country has one vote) UN Secretariat \\- Administrative organ of the UN International Court of Justice \\- Universal court for international law (based in The Hague) * may resolve non-compulsory recommendations to states, or suggestions to the Security Council * decides on the admission of new members, after a proposal of the Security Council * adopts the budget * elects the non-permanent members of the Security Council and all of the members of Economic and Social Council, after a proposal of the Security Council, the UN Secretary General, and the 15 judges of the International Court of Justice. * supports the other UN bodies administratively, such as in the organization of conferences, in the writing of reports and studies, and in the preparation of the budget plan * chairman, the UN Secretary General, is elected by the General Assembly for a five-year mandate and is the most important representative of the UN. * besides its headquarters in New York City, has three main offices in Geneva, Nairobi ,and Vienna * decides disputes between states that recognize its jurisdiction and creates legal opinions * has 15 judges are elected by the General Assembly for nine years. It renders judgement with relative majority * parties must be countries, not international organizations or other subjects of international law (not to be confused with the International Criminal Court) UN Security Council For international security issues UN Economic and Social Council For global economical and social affairs- UN Trusteeship Council Administered trust territories (currently inactive) * responsible for the maintenance of international peace and security * the most powerful organ of the UN, may adopt compulsory resolutions * its decisions include peacekeeping and peace enforcement missions, as well as non-military pressure mediums, such as trade embargos * has 15 members: five permanent members with veto power (China, Russia, France, the United Kingdom and the United States) and ten elected members * responsible for cooperation on economic and social fields (raising the general standard of living and solving economic, social and health problems, promotion of human rights, culture, education, and humanitarian aid) * has therefore established manyfunctional and regional commissions * also co-ordinates the cooperation with the numerous specialized agencies of the United Nations * has 54 members, elected by the General Assembly to serve staggered three-year mandates * was originally designed to manage colonial possessions that were earlier League of Nations mandates * inactive since 1994, with the last trust territory, Namibia, attaining independence in 1990 There are special agencies of the United Nations. They are independent of the UN secretariat, with their own budgets and memberships. Some of them are older than the United Nations. Here are a few of them: * The World Health Organization (WHO) * The Food and Agriculture Organization (FAO) * The United Nations Educational, Scientific and Cultural Organization (UNESCO) * The International Labour Organization (ILO) * The International Monetary Fund (IMF) * The World Meteorological Organization (WMO) The United Nations also has funds and programmes. Unlike specialized agencies, these are reliant on voluntary contributions, or money that countries can choose whether or not to give to. * The United Nations Children's Fund (UNICEF) * The United Nations Environment Programme (UNEP) * The United Nations Development Programme (UNDP) * The UN World Food Programme (WFP) * The UN Refugee Agency (UNHCR) ==Related pages== * Members of the United Nations ==References== Notes ==Other websites== *UN website *UN Foundation website Category:1945 establishments",
 "title": "United Nations"
}