{
 "id": "454984",
 "text": "Survivor Series (1989) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 23, 1989 at the Rosemont Horizon in Rosemont, Illinois. It was the third Survivor Series event held by the WWF. ==Matches== No. Results Stipulations Times 1 Boris Zhukov defeated Paul Roma Singles match N/A 2 The Dream Team (Dusty Rhodes, Brutus Beefcake, The Red Rooster and Tito Santana) defeated The Enforcers (Big Boss Man, Bad News Brown, Rick Martel and The Honky Tonk Man) (with Jimmy Hart and Slick) Four-on-four Survivor Series elimination match 22:02 3 The King's Court (Randy Savage, Canadian Earthquake, Dino Bravo and Greg Valentine) (with Jimmy Hart and Sensational Queen Sherri) defeated The 4x4s (Jim Duggan, Bret Hart, Ronnie Garvin and Hercules) Four-on-four Survivor Series elimination match 23:25 4 The Hulkamaniacs (Hulk Hogan, Demolition (Ax and Smash) and Jake Roberts) defeated The Million $ Team (Ted DiBiase, The Powers of Pain (The Warlord and The Barbarian) and Zeus) (with Virgil and Mr. Fuji) Five-on-five Survivor Series elimination match 27:32 5 The Rude Brood (Rick Rude, Mr. Perfect, The Fabulous Rougeaus (Jacques and Raymond)) (with The Genius and Jimmy Hart) defeated Roddy's Rowdies (Roddy Piper, Jimmy Snuka and The Bushwhackers (Butch and Luke)) Four-on-four Survivor Series elimination match 21:27 6 The Ultimate Warriors (The Ultimate Warrior, The Rockers (Shawn Michaels and Marty Jannetty) and Jim Neidhart) defeated The Heenan Family (Bobby Heenan, André the Giant, Haku and Arn Anderson) Four-on-four Survivor Series elimination match 20:28 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Tito Santana Rick Martel Pinfall 9:15 Bad News Brown N/A Countout 15:26 Honky Tonk Man Brutus Beefcake Pinfall 17:24 Rick Martel 20:13 The Red Rooster Big Boss Man 21:00 Big Boss Man Dusty Rhodes 22:02 Dusty Rhodes & Brutus Beefcake Eliminated Wrestler Eliminated by Method Time Hercules The Canadian Earthquake Pinfall 3:57 Greg Valentine Jim Duggan 7:32 Ronnie Garvin Dino Bravo 11:17 Bret Hart Randy Savage 19:06 Jim Duggan N/A Countout 23:25 Randy Savage, The Canadian Earthquake, & Dino Bravo Eliminated Wrestler Eliminated by Method Time Zeus N/A Disqualification 3:21 Ax The Warlord Pinfall 9:50 Smash The Barbarian 13:42 The Warlord N/A Double disqualification 19:51 The Barbarian Jake Roberts Ted DiBiase Pinfall 23:42 Ted DiBiase Hulk Hogan 27:32 Hulk Hogan Eliminated Wrestler Eliminated by Method Time Jacques Rougeau Jimmy Snuka Pinfall 4:01 Raymond Rougeau Roddy Piper 7:30 Butch Mr Perfect 10:46 Luke Rick Rude 12:14 Rick Rude N/A Double countout 18:35 Roddy Piper 7 Jimmy Snuka Mr. Perfect Pinfall 21:27 Mr. Perfect Eliminated Wrestler Eliminated by Method Time André the Giant N/A Countout 0:27 Jim Neidhart Haku Pinfall 3:32 Marty Jannetty Bobby Heenan 8:53 Haku Shawn Michaels 12:54 Shawn Michaels Arn Anderson 15:47 Arn Anderson The Ultimate Warrior 18:19 Bobby Heenan 20:28 The Ultimate Warrior ==References== ==Other websites== *Official Survivor Series 1989 website Category:1989 in professional wrestling Category:1989 in Illinois Category:Survivor Series Category:November events",
 "title": "Survivor Series (1989)"
}