{
 "id": "454983",
 "text": "Survivor Series (1988) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on November 24, 1988 at the Richfield Coliseum in Richfield Township, Ohio. It was the second Survivor Series event held by the WWF. ==Matches== No. Results Stipulations Times 1 The Ultimate Warrior, Brutus Beefcake, Sam Houston, The Blue Blazer, and Jim Brunzell (with Miss Elizabeth) defeated The Honky Tonk Man, Ron Bass, Danny Davis, Greg Valentine, and Bad News Brown (with Jimmy Hart) Five-on-five Survivor Series elimination match 17:50 2 The Powers of Pain (The Warlord and The Barbarian), The Rockers (Shawn Michaels and Marty Jannetty), The British Bulldogs (Davey Boy Smith and Dynamite Kid), The Hart Foundation (Bret Hart and Jim Neidhart), and The Young Stallions (Jim Powers and Paul Roma) defeated Demolition (Ax and Smash), The Brain Busters (Arn Anderson and Tully Blanchard), The Bolsheviks (Nikolai Volkoff and Boris Zhukov), The Fabulous Rougeaus (Raymond and Jacques), and The Conquistadors (Uno and Dos) (with Mr. Fuji, Bobby Heenan, Slick, and Jimmy Hart) Ten-on-ten Tag team Survivor Series elimination match 42:12 3 André the Giant, Rick Rude, Dino Bravo, Mr. Perfect, and Harley Race (with Bobby Heenan and Frenchy Martin) defeated Jim Duggan, Jake Roberts, Scott Casey, Ken Patera, and Tito Santana Five-on-five Survivor Series elimination match 30:03 4 The Mega Powers (Hulk Hogan and Randy Savage), Hercules, Koko B. Ware, and Hillbilly Jim (with Miss Elizabeth) defeated The Twin Towers (Akeem and Big Boss Man), Ted DiBiase, Haku, and The Red Rooster (with Slick, Bobby Heenan, and Virgil) Five-on-five Survivor Series elimination match 30:10 === Survivor Series elimination matches === Eliminated Wrestler Eliminated by Method Time Danny Davis Brutus Beefcake Technical submission 1:18 Jim Brunzell Bad News Brown Pinfall 5:12 Bad News Brown N/A Countout 7:50 Sam Houston Ron Bass Pinfall 10:09 The Blue Blazer Greg Valentine Submission 12:29 Brutus Beefcake N/A Double countout 15:44 The Honky Tonk Man 8 Ron Bass The Ultimate Warrior Pinfall 17:30 9 Greg Valentine 17:50 The Ultimate Warrior Eliminated Wrestler Eliminated by Method Time Raymond Rougeau Bret Hart Pinfall 5:22 Jim Powers Boris Zhukov 15:20 Boris Zhukov Marty Jannetty 18:09 Bret Hart Tully Blanchard 27:03 The Rockers N/A Double disqualification 27:57 The Brain Busters 7 Dynamite Kid Smash Pinfall 36:02 8 Smash N/A Countout 39:33 9 Uno The Barbarian Pinfall 42:12 The Powers of Pain (The Barbarian and The Warlord) Eliminated Wrestler Eliminated by Method Time Ken Patera Rick Rude Pinfall 8:18 Scott Casey Dino Bravo 9:27 Harley Race Tito Santana 13:19 Tito Santana André the Giant 14:40 Jim Duggan N/A Disqualification 21:22 Rick Rude Jake Roberts Pinfall 28:45 André the Giant N/A Disqualification 29:39 Jake Roberts Mr. Perfect Pinfall 30:03 Mr. Perfect & Dino Bravo Eliminated Wrestler Eliminated by Method Time The Red Rooster Randy Savage Pinfall 6:11 Hillbilly Jim Akeem 9:59 Koko B. Ware The Big Boss Man 11:45 Hercules Ted DiBiase 16:35 Ted DiBiase Randy Savage 16:57 The Big Boss Man N/A Countout 23:24 Akeem Disqualification 25:01 Haku Hulk Hogan Pinfall 29:10 Randy Savage and Hulk Hogan ==References== ==Other websites== *Official Survivor Series 1988 website Category:1988 in professional wrestling Category:1988 in the United States Category:Sports in Ohio Category:Survivor Series Category:1980s in Ohio Category:November events",
 "title": "Survivor Series (1988)"
}