{
 "id": "455047",
 "text": "Six Flags Entertainment Corporation is a company that operates 42 amusement parks in Mexico, the United States and Canada. The parks include theme parks, thrill parks, water parks and family entertainment centers. In 2011, 24.3 million people visited the parks. The name Six Flags, comes from the flags of the six different nations that have governed Texas: Spain, France, Mexico, the Republic of Texas, the United States of America, and the Confederate States of America. The original Six Flags park was (and still is) split into separate regions, such as the Spain and Mexico section which has Spanish-themed rides, attractions, and buildings. In a move to focus on its core entertainment assets, Time Warner--along with investment partner Boston Ventures--has agreed to a $1.9-billion deal to sell its stake in the Six Flags theme park chain to Oklahoma City-based Premier Parks Inc. The purchase would make Premier the world’s largest regional theme park company, with more than two dozen parks across the United States. Time Warner retains joint ownership, with various regional partners, of the international Warner Bros. Movie World theme parks. Those are located in Australia and Germany, with a third under construction in England. Premier currently operates three Northern California parks, including Water World USA parks in Sacramento and Concord. Six Flags’ only California location is Magic Mountain in Valencia. In December, Premier announced a deal to acquire six European parks. Premier would acquire 100% of Six Flags for $965 million, including $765 million in cash and $200 million in convertible preferred Premier stock. Under a long-term licensing arrangement, Premier also gains exclusive domestic in the theme park rights to Warner Bros. cartoon characters from “Looney Tunes” (including Bugs Bunny, Porky Pig, and Daffy Duck), Scooby-Doo, Tom and Jerry, Animaniacs, and DC Comics (Superman and Batman). “Today’s transaction advances our stated commitment to strengthen our balance sheet through the sale of non-core assets,” Time Warner Chairman Gerald Levin said in a statement. He stressed that the licensing agreement means that Warner Bros.’ characters would reach approximately 40 million people annually at Premier’s parks. Time Warner bought the Six Flags parks in 1992. In 1995, the company sold 51% to Boston Ventures. The Premier transaction is expected to close in the second quarter. ==References== ==Other websites== * Six Flags Official home page * Bloomberg Category:Theme park companies Category:1962 establishments Category:1960s establishments in the United States",
 "title": "Six Flags"
}