{
 "id": "455039",
 "text": "Oberdan Cattani (June 12, 1919 – June 20, 2014) was a Brazilian football player at the position of Goalkeeper. He played for Palmeiras from 1940 to 1954. Of tall stature, big hands and elasticity, his defenses made him one of the most famous Brazilian goalkeepers of the 40s, a period in which the Second World War prevented the holding of the World Cups. Oberdan was described by opponents as an agile goalkeeper with great physical strength. A hallmark of Oberdan was that he could hold the ball with just one hand. Considered as one of the finest goalkeepers of his generation. ==Club career== Oberdan Cattani was the son of Italian immigrants from the Tuscany region. He was a truck driver when he took his first test, on a day off from work. Introduced before by his brother, he was hired in 1940, remaining at the club until 1954, having played 351 matches with Palmeiras. His name is among the biggest idols of Palmeiras. In his curriculum for the club, there are four titles of Campeonato Paulista (1942, 1944, 1947 and 1950), the Tournament Rio-São Paulo of 1951 and the Copa Rio Internacional of 1951. The tournament, which was created with the aim of being a Club World Cup. In the conquest, Oberdan was in the reserve of the goalkeeper Fábio Crippa. On April 24, 1955, Oberdan was honored in São Carlos by the \"Association of Sports Chroniclers of São Carlos\", with a cup. ==International career== He made his debut for the Brazilian team in 1944 with whom he won the Roca Cup in 1945, and he finished as runners-up during 1945 Copa América. ==Personal life and death== Cattani was born in Sorocaba, São Paulo. He died in Rio de Janeiro, Brazil, aged 95 in 2014. ==Honours== ; Palmeiras * Copa Rio Internacional: 1951 * Torneio Rio-São Paulo: 1951 * Taça dos Campeões Estaduais Rio–São Paulo: 1942, 1947 * Campeonato Paulista: 1942, 1944, 1947, 1950 * Taça Cidade de São Paulo: 1945, 1946, 1950, 1951 * Torneio Início Paulista: 1942, 1946 ; Seleção Paulista * Campeonato Brasileiro de Seleções Estaduais: 1941, 1942 ; Brazil * 1945 Copa América: Runner-up * Roca Cup: 1945 ==References== Category:1919 births Category:2014 deaths Category:Brazilian association football goalkeepers Category:Footballers from São Paulo (state)",
 "title": "Oberdan Cattani"
}