{
 "id": "455015",
 "text": "Maternal health is the health of a woman during pregnancy, childbirth and her postpartum periods. It includes family planning, preconception, prenatal and postnatal caring. The risk of maternal death is higher in some areas, such as Sub-Saharan Africa, than in others. Poverty is a problem in some countries, in particular, the developing countries. In addition to sub-Saharan Africa, Black women in the US and the UK have higher maternal death rates. High rates of poverty, untreated illnesses, and a lack of access to health care, according to maternal health specialists, are to blame for higher maternal mortality rates. Other societal causes of maternal deaths include the absence of professionals, inadequate resources, early marriages, poverty in remote rural areas, and a lack of facilities and access. Pregnancy problems during and after delivery are caused by the high prevalence of cardiovascular disorders in pregnant black women. These ladies may experience potentially fatal complications depending on the severity of the condition (Howell,2018) Prenatal care is very vital when it comes to maternal health . According to the CDC Prenatal care can support both the mother and the unborn child's health. Infants born to mothers who receive prenatal care are five times less likely to die and three times more likely to have low birth weights than babies delivered to mothers who do not. There are a lot of reasons why females choose to not engage in proper prenatal care. Around 71% of low income women, according to a US study, had difficulty having access to prenatal care. Income is highly associated with prenatal health care. Despite major advancements in prenatal care, the maternal mortality rate in the USA has is very high. Rates have risen in the twenty-first century, and efforts to halt this have made little to no headway. In the US, there are different variations in maternal death rates . == More About Maternal health == # Maternal health # What is maternal health ==References== Category:Healthcare Category:Obstetrics and gynecology",
 "title": "Maternal health"
}