{
 "id": "45509",
 "text": "George Alexander \"Alex\" Trebek (July 22, 1940 - November 8, 2020) was a Canadian-American television game show host. He hosted Jeopardy! for 37 seasons from 1984 until his death in 2020. He was born in Greater Sudbury, Ontario. He became a naturalized American citizen in 1998. In 2011, he snapped his achilles tendon while trying to stop a thief trying to rob his San Francisco hotel room. In March 2019, Trebek announced that he had been diagnosed with stage IV pancreatic cancer. He died from the disease more than a year and a half later on November 8, 2020 in Los Angeles, aged 80. The same disease previously affected his predecessor on Jeopardy!, Art Fleming, 25 years earlier. He had been contracted to host Jeopardy! until 2022. Following Trebek's death, a series of guest hosts filled in for Trebek for the remainder of season 37 of Jeopardy! (his final season). On July 27, 2022, it was announced that Mayim Bialik and Ken Jennings will succeed Trebek as the permanent hosts of Jeopardy! after alternating in multi-week stints for the remainder of the show's 38th season after Mike Richards (the show's then executive producer who briefly succeeded Trebek as host of the program) was let go after taping a week's worth of episodes after various controversies came to light. On August 19, 2021, prior to the start of Jeopardy! season 38 taping, the producers of Jeopardy! re-dedicated Stage 10 at Sony Pictures Studios, the show's longtime home, the Alex Trebek Stage in his honor, with his family present at the dedication. ==Filmography== ===Animated Roles=== * 1993: Rugrats - as Alan Quebec, the host of \"Super Stumpers\" (episode 2.37 - \"Game Show Didi\") * 1996: The Magic School Bus - Announcer (voice) (episode 2.6 \"Shows and Tells\") * 1997; 2012: The Simpsons - as himself, the host of Jeopardy! in \"Miracle on Evergreen Terrace\" and \"Penny-Wiseguys\" (Voice) * 2000: Arthur - as Alex Lebek, the host of Riddle Quest * 2000: Pepper Ann - as himself (2 episodes) * 2006: Family Guy - as himself, the host of Jeopardy! in \"I Take Three Quagmire\" (voice) * 2020: Scooby-Doo and Guess Who? - as himself, the host of Jeopardy! in \"Total Jeopardy\" (voice, posthumous release) ==References== ==Other websites== * * * Category:1940 births Category:2020 deaths Category:American game show hosts Category:Canadian television presenters Category:Naturalized citizens of the United States Category:Order of Canada Category:People from Greater Sudbury Category:Entertainers from Ontario Category:Jeopardy!",
 "title": "Alex Trebek"
}