{
 "id": "455160",
 "text": "Curious George is a 2006 American animated adventure film based on the book Curious George. It was directed by Matthew O'Callaghan. It stars Will Ferrell, Drew Barrymore, Dick Van Dyke, David Cross, Eugene Levy, Joan Plowright, Michael Sorich, Michael Chinyamurindi, Clint Howard, Ed O'Ross, and Frank Welker. It was released on February 11, 2006. == Voice cast == * Frank Welker as George, a curious tailless monkey. The film's press notes mentioned that while George would be more accurately described as a chimpanzee, he was referred to as a monkey for tradition and consistency with the book series. Welker described the character as \"the nicest little monkey you would ever want to meet\". Director Matthew O'Callaghan said that it was challenging to effectively convey the monkey's emotions because the character does not speak; because of this, George's original design from the books' illustrations was modified, including replacing his black-dot eyes with larger, more expressive eyes that have irises. * Will Ferrell as Ted / The Man with the Yellow Hat, a tour guide at the Bloomsberry Museum. In a deleted scene, his last name was revealed to be Shackleford. Ferrell described the character as \"a blank canvas\" and \"a guy who's lived his life in a box\". O'Callaghan stated that Seinfeld's casting led to an expanded role for the character, in contrast to The Man with the Yellow Hat's relatively limited presence in the book series. * Drew Barrymore as Maggie Dunlop, an elementary school teacher. The character was named after Margret Rey, who created the Curious George series with her husband, H. A. Rey. O'Callaghan favored Barrymore for the role, saying: \"I've always been a big fan of Drew Barrymore so I suggested her to the studio and they all loved the idea of her.\" * David Cross as Junior, the son of the museum's owner. An early version of the screenplay involved several antagonists; O'Callaghan and screenwriter Ken Kaufman eventually replaced the multiple characters with Junior in order to simplify the story. * Eugene Levy as Clovis, an inventor who builds robotic animals. Levy has said that his experience with the character (his first voice role) informed his approach to subsequent voice work; although he prepared extensively with the script, he found that he had to do \"just about everything 10 or 15 different ways until they get what it is they're actually looking for\", and remarked that the recording process \"is a really interesting way to work\". * Joan Plowright as Ms. Plushbottom, Ted's wealthy neighbor and opera singer, whose apartment gets repainted by George. * Dick Van Dyke as Mr. Bloomsberry, the owner of the Bloomsberry Museum. O'Callaghan said he was surprised that Van Dyke had never done voice work before, explaining that \"as an animation director you always want to use people who are fresh, who haven't done animated voices—at least I do. So it was really exciting to get [Van Dyke] in the room and work with him.\" * Ed O'Ross as Ivan, the Doorman of Ted's apartment. He strictly enforces his \"No-Pet\" policy and suspects Ted of having one with him. He speaks with a thick Russian accent. ==Related pages== * Curious George (video game) == References == Category:2006 movies Category:American animated movies Category:American adventure movies Category:Movies based on books Category:2006 adventure movies Category:2006 animated movies",
 "title": "Curious George (movie)"
}