{
 "id": "455117",
 "text": "The office of Prime Minister of Liechtenstein is the highest and head of the government of Liechtenstein. They are elected every four years. The first Prime Minister of Liechtenstein was Josef Ospelt. The current Prime Minister is Brigitte Haas. ==Head of government== ===Provincial administrator (1861–1921)=== The () was the title of the head of government from 1861 to 1921. Portrait Name Term of office Term of office Term of office Political Party Monarch Portrait Name Took office Left office Time in office Political Party Monarch 1 Karl Freiherr Haus von Hausen April 1861 23 September 1884 Independent Johann II 2 Carl von In der Maur 23 September 1884 5 September 1892 Independent 3 Friedrich Stellwag von Carion 5 September 1892 24 October 1896 Independent (2) Carl von In der Maur 4 January 1897 11 December 1913 † Independent 4 Leopold Freiherr von Imhof 1 April 1914 13 November 1918 Independent — Martin Ritter 7 November 1918 7 December 1918 Christian-Social People's Party 5 Prince Karl Aloys of Liechtenstein 13 December 1918 15 September 1920 Independent 6 15 September 1920 23 March 1921 Independent ===Prime Minister (1921–present)=== The () is the current title for the head of government. Name Elected Term of office Term of office Term of office Political party Monarch Name Elected Took office Left office Time in office Political party Monarch 1 Josef Ospelt — 2 March 1921 4 May 1922 Progressive Citizens' Party Johann II — Alfons Feger — 4 May 1922 1 June 1922 Independent Johann II — Felix Gubelmann — 1 June 1922 6 June 1922 Independent Johann II 2 Gustav Schädler 1922 1926 (Jan) 1926 (Apr) 6 June 1922 28 June 1928 Christian-Social People's Party Johann II — Prince Alfred Roman of Liechtenstein — 28 June 1928 4 August 1928 Independent Johann II 3 Josef Hoop 1928 1930 1932 1936 1939 4 August 1928 3 September 1945 Progressive Citizens' Party Franz I 4 Alexander Frick 1945 1949 1953 (Feb) 1953 (Jun) 1957 1958 3 September 1945 16 July 1962 Progressive Citizens' Party Franz Josef II 5 Gerard Batliner 1962 1966 16 July 1962 18 March 1970 Progressive Citizens' Party Franz Josef II 6 Alfred Hilbe 1970 18 March 1970 27 March 1974 Patriotic Union Franz Josef II 7 Walter Kieber 1974 27 March 1974 26 April 1978 Progressive Citizens' Party Franz Josef II 8 Hans Brunhart 1978 1982 1986 1989 26 April 1978 26 May 1993 Patriotic Union Franz Josef II 9 Markus Büchel 1993 (Feb) 26 May 1993 15 December 1993 Progressive Citizens' Party Hans-Adam II 10 Mario Frick 1993 (Oct) 1997 15 December 1993 5 April 2001 Patriotic Union Hans-Adam II 11 Otmar Hasler 2001 2005 5 April 2001 25 March 2009 Progressive Citizens' Party Hans-Adam II 12 Klaus Tschütscher 2009 25 March 2009 27 March 2013 Patriotic Union Hans-Adam II 13 Adrian Hasler 2013 2017 27 March 2013 25 March 2021 Progressive Citizens' Party Hans-Adam II 14 Daniel Risch 2021 25 March 2021 10 April 2025 Patriotic Union Hans-Adam II 15 Brigitte Haas 2025 10 April 2025 Incumbent Patriotic Union Hans-Adam II == References == ==Other websites== *World Statesmen - Liechtenstein * Category:Liechtenstein-related lists",
 "title": "List of heads of government of Liechtenstein"
}