{
 "id": "455106",
 "text": "The chain pickerel (Esox niger) is a species of fish that has a number of nicknames such as the grass pickerel, jack, pickerel, common pickerel, and eastern pickerel. It is a freshwater game fish and the smallest member of the Esocidae family. They are native to Atlantic and Gulf Coast tributaries. Chain pickerel have been introduced into the Lakes Ontario and Erie drainages as well as other places. They are found in shallow pools of lakes, streams, and tidal and non-tidal rivers. They are ambush feeders that will strike at anything that swims near them. They feed mainly during daylight hours. == Physical description == Chain pickerel has the same torpedo-like shape of the Muskellunge and Northern pike. They have different markings than either of their family members. They have a chain-like pattern of dark markings on a yellowish to greenish body.Ken Schultz, Ken Schultz's Field Guide to Freshwater Fish (Hoboken, NJ: Wiley, 2004), p. 153 This pattern is what they were named for. Like other pike they have a forked tail fin and a long pointed head. Chain pickerel have a dark bar underneath each eye. The eye color is yellow or yellowish. They can live up to 10 years. == Habitat and forage == In waters not shared with Northern pike or Muskies, Chain pickerel can be abundant. They prefer shallow weedy pools and submerged trees, limbs or man- made structures. These can be dock pilings, or riprap. Pickerel ambush their prey. They eat other fish, frogs, crayfish and small mammals. Young pickerel eat aquatic insects and small Crustacea. During the winter months the adult fish move to deeper water. Spawning begins when water temperatures approach 50°F. Unlike others in the pike family, Chain pickerel eggs are sticky and ribbons of eggs stick to underwater weeds. Females lay up to 50,000 eggs. Unlike other fish, Chain pickerel do not remain to guard their young fry. == Angling == Chain pickerel are not as popular as other game fish. A good number are caught by accident while fishing for other fish. But they are popular with ice fishermen in the winter.Ed Mendus, 'Northeastern Ice Picks', Field & Stream, Vol. xcv, No. 10 (February 1991), pp. 58–59 Chain pickerel are a very good fighting fish. Anyone hooking one is in for an exciting fight. They will attack a live minnow or any lure that resembles one. In Canada, Walleyes are called 'pickerel' which sometimes confuses identification. But a walleye and a pike are very different in appearance. The world record for a chain pickerel is 9 pounds 6 ounces. It was caught in Georgia in 1961. Chain pickerel rarely grow longer than 36 inches. == References == Category:Esociformes Category:Freshwater fish",
 "title": "Chain pickerel"
}