{
 "id": "455344",
 "text": "\"Auferstanden aus Ruinen\" () (German for Risen from Ruins) was the national anthem of East Germany. == History == In 1949, the Soviet occupation zone of Allied Occupied Germany became a country that was called East Germany. For the anthem, the poet Johannes R. Becher wrote the lyrics.Aaron D. Horton, German POWs, Der Ruf, and the Genesis of Group 47: The Political Journey of Alfred Andersch and Hans Werner Richter (Lanham, MD: Fairleigh Dickinson University Press, 2013), pp. 131–32 The composer Hanns Eisler wrote the melody. == Lyrics == German original IPA transcription Actual translation Singable version 1\\. Auferstanden aus Ruinen Und der Zukunft zugewandt, Lass uns dir zum Guten dienen, Deutschland, einig Vaterland. Alte Not gilt es zu zwingen, Und wir zwingen sie vereint, Denn es muss uns doch gelingen, Dass die Sonne schön wie nie Über Deutschland scheint, Über Deutschland scheint. 1\\. [ˈaʊfɐˌʃtandən aʊs ʁuːˈiːnən] [ʊnt deːɐ̯ ˈtsuːkʊnft ˈtsuːgəvant] [las ʊns diːɐ̯ tsʊm ˈguːtn̩ ˈdiːnən] [ˈdɔʏtʃlant ˈaɪnɪç ˈfaːtɐlant] [ˈaltə noːt gɪlt ɛs tsuː ˈtsvɪŋən] [ʊnt viːɐ̯ ˈtsvɪŋən ziː ˈfɛɐ̯aɪnt] [dɛn ɛs mʊs ʊns dɔx gəˈlɪŋən] [das diː ˈzɔnə ʃøːn viː niː] [ˈyːbɐ ˈdɔʏtʃlant ʃaɪnt] [ˈyːbɐ ˈdɔʏtʃlant ʃaɪnt] 1\\. Risen from ruins And facing the future, Let us serve you for the good, Germany, united fatherland. Old woes are to be overcome And we overcome them united Because we so must succeed, [So] that the sun beautiful as never [before] Over Germany shines, Over Germany shines. 1\\. From the ruins risen newly, To the future turned, we stand. Let us serve your good weal truly, Germany, our fatherland. Triumph over bygone sorrow, Can in unity be won. For we shall attain a morrow, When over our Germany, There is radiant sun, There is radiant sun. 2\\. Glück und Friede sei beschieden Deutschland, unserm Vaterland. Alle Welt sehnt sich nach Frieden, Reicht den Völkern eure Hand. Wenn wir brüderlich uns einen, Schlagen wir des Volkes Feind. Lasst das Licht des Friedens scheinen, Dass nie eine Mutter mehr Ihren Sohn beweint, Ihren Sohn beweint. 2\\. [glʏk ʊnt ˈfʁiːdə zaɪ bəˈʃiːdən] [ˈdɔʏtʃlant ˈʊnzɐm ˈfaːtɐlant] [ˈalə vɛlt zeːnt zɪç naːx ˈfʁiːdən] [ʁaɪçt deːn ˈfœlkɐn ˈɔʏʁə hant] [vɛn viːɐ̯ ˈbʁyːdɐlɪç ʊns ˈaɪnən] [ˈʃlaːgən viːɐ̯ dɛs ˈfɔlkəs faɪnt] [last das lɪçt dɛs ˈfʁiːdəns ʃaɪnən] [das niː ˈaɪnə ˈmʊtɐ meːɐ] [ˈiːʁən zoːn bəˈvaɪnt] [ˈiːʁən zoːn bəˈvaɪnt] 2\\. Happiness and peace be granted To Germany, our fatherland. All the world longs for peace, Reach your hand out to the peoples. If brotherly we unite ourselves, We shall defeat the people's enemy. Let the light of peace shine So that a mother never more Mourns her son, Mourns her son. 2\\. May both peace and joy inspire, Germany, our fatherland. Peace is all the world's desire, To the peoples lend your hand. In fraternity united, We shall crush the people's foe. Let all paths by peace be lighted, That no mother shall again Mourn her son in woe, Mourn her son in woe. 3\\. Lasst uns pflügen, lasst uns bauen, Lernt und schafft wie nie zuvor, Und der eignen Kraft vertrauend, Steigt ein frei Geschlecht empor. Deutsche Jugend, bestes Streben Unsres Volks in dir vereint, Wirst du Deutschlands neues Leben, Und die Sonne schön wie nie Über Deutschland scheint, Über Deutschland scheint. 3\\. [last ʊns ˈpflyːgən last ʊns ˈbaʊən] [lɛɐ̯nt ʊnt ʃaft viː niː ˈtsuːfoːɐ̯] [ʊnt deːɐ̯ ˈaɪgnən kʁaft fɛɐ̯ˈtʁaʊənt] [ʃtaɪkt aɪn fʁaɪ gəˈʃlɛçt ɛmˈpoːɐ̯] [ˈdɔʏtʃə ˈjuːgənt ˈbəstəs ˈʃtʁeːbən] [ˈʊnsʁəs fɔlks ɪn diːɐ̯ ˈfɛɐ̯aɪnt] [vɪɐ̯st duː ˈdɔʏtʃlants ˈnɔʏəs ˈleːbən] [ʊnt diː ˈzɔnə ʃøːn viː niː] [ˈyːbɐ ˈdɔʏtʃlant ʃaɪnt] [ˈyːbɐ ˈdɔʏtʃlant ʃaɪnt] 3\\. Let us plough, let us build, Learn and create like never before, And, confident in immanent strength, A free generation rises up. German youth, best efforts Of our people united in you, You will become Germany's new life. And the sun beautiful as never, Over Germany shines, Over Germany shines. 3\\. Let us plough and build our nation, Learn and work as never yet, That a free new generation, Faith in its own strength beget! German youth, for whom the striving Of our people is at one, You are Germany's reviving, And over our Germany, There is radiant sun, There is radiant sun. == References == Category:Historical anthems Category:German anthems Category:1949 songs",
 "title": "Auferstanden aus Ruinen"
}