{
 "id": "455499",
 "text": "Survivor Series (1990) was a professional wrestling pay-per-view show made by the World Wrestling Federation (WWF). It took place on on November 22, 1990 (Thanksgiving Day) at the Hartford Civic Center in Hartford, Connecticut. It was the fourth Survivor Series event held by the WWF. The event is best known for featuring the debut of The Undertaker.Ted DiBiase: The Million Dollar Man, p.177, Ted DiBiase with Tom Caiazzo, Pocket Books, New York, 2008, ==Matches== No. Results Stipulations Times 1 Shane Douglas defeated Buddy Rose Singles match N/A 2 The Warriors (The Ultimate Warrior, The Legion of Doom (Hawk and Animal), and The Texas Tornado) defeated The Perfect Team (Mr. Perfect and Demolition (Ax, Smash, and Crush)) (with Bobby Heenan and Mr. Fuji) Four-on-four Survivor Series elimination match 14:20 3 The Million Dollar Team (Ted DiBiase, The Undertaker, and Rhythm & Blues (The Honky Tonk Man and Greg Valentine)) (with Virgil, Jimmy Hart, and Brother Love) defeated The Dream Team (Dusty Rhodes, Koko B. Ware, and The Hart Foundation (Bret Hart and Jim Neidhart)) Four-on-four Survivor Series elimination match 13:54 4 The Visionaries (Rick Martel, The Warlord, Power and Glory (Hercules and Paul Roma)) (with Slick) defeated The Vipers (Jake Roberts, Jimmy Snuka, and The Rockers (Shawn Michaels and Marty Jannetty)) Four-on-four Survivor Series elimination match 17:42 5 The Hulkamaniacs (Hulk Hogan, Jim Duggan, Big Boss Man, and Tugboat) defeated The Natural Disasters (Earthquake, Haku, Dino Bravo, and The Barbarian) (with Jimmy Hart and Bobby Heenan) Four-on-four Survivor Series elimination match 14:49 6 The Alliance (Nikolai Volkoff, Tito Santana, and The Bushwhackers (Luke and Butch) defeated The Mercenaries (Sgt. Slaughter, Boris Zhukov and The Orient Express (Sato and Tanaka) (with Mr. Fuji and General Adnan) Four-on-four Survivor Series elimination match 10:52 7 Hulk Hogan, The Ultimate Warrior, and Tito Santana defeated Ted DiBiase, Rick Martel, The Warlord and Power and Glory (Hercules and Paul Roma) (with Virgil and Slick) \"Grand Finale Match of Survival\": three-on-five Survivor Series elimination match which featured the survivors from the earlier matches 9:07 === Eliminations === Eliminated Wrestler Eliminated by Method Time Ax The Ultimate Warrior Pinfall 3:23 Smash N/A Disqualification 7:36 Crush Hawk Animal 6 The Texas Tornado Mr. Perfect Pinfall 11:02 7 Mr. Perfect The Ultimate Warrior 14:20 The Ultimate Warrior Eliminated Wrestler Eliminated by Method Time Koko B. Ware The Undertaker Pinfall 1:39 The Honky Tonk Man Jim Neidhart 4:16 Jim Neidhart Ted DiBiase 5:49 Dusty Rhodes The Undertaker 8:26 The Undertaker N/A Countout 9:17 Greg Valentine Bret Hart Pinfall 9:57 Bret Hart Ted DiBiase 13:54 Ted DiBiase Eliminated Wrestler Eliminated by Method Time Marty Jannetty The Warlord Pinfall 5:03 Jimmy Snuka Rick Martel 9:28 Shawn Michaels Paul Roma 15:40 Jake Roberts N/A Countout 17:42 Hercules, Paul Roma, Rick Martel and The Warlord (Clean sweep) Eliminated Wrestler Eliminated by Method Time Haku The Big Boss Man Pinfall 3:15 Jim Duggan N/A Disqualification 6:12 Dino Bravo Hulk Hogan Pinfall 7:59 Big Boss Man Earthquake 9:08 Tugboat N/A Double countout 11:33 Earthquake 7 The Barbarian Hulk Hogan Pinfall 14:49 Hulk Hogan Eliminated Wrestler Eliminated by Method Time Boris Zhukov Tito Santana Pinfall 0:48 Sato Butch 1:46 Tanaka Tito Santana 2:13 Nikolai Volkoff Sgt. Slaughter 5:25 Luke 6:30 Butch 6:53 Sgt. Slaughter N/A Disqualification 10:52 Tito Santana Eliminated Wrestler Eliminated by Method Time The Warlord Tito Santana Pinfall 0:28 Tito Santana Ted DiBiase 1:51 Paul Roma Hulk Hogan 5:57 Rick Martel N/A Countout 7:17 Ted DiBiase Hulk Hogan Pinfall 8:30 Hercules The Ultimate Warrior 9:07 Hulk Hogan and The Ultimate Warrior ==References== ==Other websites== *Official Survivor Series 1990 website Category:1990 in professional wrestling Category:1990 in the United States Category:Sports in Hartford, Connecticut Category:Survivor Series Category:20th century in Connecticut Category:November events Category:History of Hartford, Connecticut",
 "title": "Survivor Series (1990)"
}