{
 "id": "455683",
 "text": "Seoul Metropolitan Subway, often called the Seoul Subway, is a rail transit system of underground trains and commuter trains that connects Seoul to nearby suburbs. The system has 22 lines that are named after numbers (Line 1, Line 2, all the way to Line 9). It also has Gyeongui Line, Bundang Line, Shinbundang Line, A'REX, Jungang Line, Gyeongchun Line, Suin Line, Incheon Line 1, Everline, and U Line. Since 2010, all stations have smartphone-like 46-inch touchscreen kiosks so passengers can look at maps, make free phone calls, and find tourist information. All lines use special RFID cards, such as T-money, or NFC technology where passengers can pay fees. ==Lines in Service== Line name (English) Alternative Name(s) Starting Station(s) Ending Station(s) Total Length Operator Line 1 Dark Blue Line Soyosan Incheon, Sinchang, Gwangmyeong, Seodongtan 200.6 km Korail, Seoul Metro Line 2 Green Line, Ring Line City Hall, Seongsu, Sindorim City Hall, Sinseoldong, Kkachisan 60.2 km Seoul Metro Line 3 Orange Line Daehwa Ogeum 57.4 km Korail, Seoul Metro Line 4 Blue Line Danggogae Oido 71.5 km Korail, Seoul Metro Line 5 Banghwa Sangil-dong, Macheon 52.3 km Seoul Metro Line 6 Eungam(loop) Bonghwasan 35.1 km Seoul Metro Line 7 Jangam Bupyeong-gu Office 57.1 km Seoul Metro Line 8 Amsa Moran 17.7 km Seoul Metro Line 9 Gaehwa Sports Complex 26.9 km Seoul Metro9 Corp. AREX Airport Express Seoul Incheon International Airport 58.0 km Korail Airport Railroad Gyeongui·Jungang Line Munsan Seoul, Jipyeong 71.2 km Korail Gyeongchun Line Cheongnyangni, Kwangwoon University, Yongsan (ITX) Chuncheon 80.7 km Korail Bundang Line Wangsimni Suwon 52.9 km Korail Suin Line Oido Incheon 13.1 km Korail Gyeonggang Line Pangyo Yeoju 57.0 km Korail Shinbundang Line DX Line Gangnam Gwanggyo 17.3 km NeoTrans Corp. Incheon 1 Gyeyang International Business District 29.4 km Incheon Transit Incheon 2 Geomdan Oryu Unyeon 29.1 km Incheon Transit Yongin LRT Everline Giheung Jeondae·Everland 18.1 km Yongin Rapid Transit Uijeongbu LRT U Line Balgok Tapseok 11.1 km Uijeongbu LRT Corp. ==Related pages== * Busan subway Category:Railway stations in South Korea",
 "title": "Seoul Metropolitan Subway"
}