{
 "id": "455942",
 "text": "Money in the Bank is a yearly professional wrestling pay-per-view and livestreaming show made by WWE since 2010. It takes place in May, June or July each year, therefore happening between the company's two biggest yearly events, WrestleMania and SummerSlam. The 2017 event was the only Money in the Bank event to feature only one brand, being exclusive to SmackDown. The event is based around the Money in the Bank ladder match, which previously took place at WrestleMania. The winner of this multi-person ladder match gets a contract that they can use anytime to get a match for a championship of their choosing within the next 12 months. Some winners chose the cash in their contracts on the same day. A women's variation exists since the 2017 event. ==Events and winners== SmackDown-branded event # Event Date City Venue Main Event MITB Winner(s) Ref. 1 Money in the Bank (2010) July 18, 2010 Kansas City, Missouri Sprint Center Sheamus (c) vs. John Cena in a Steel cage match for the WWE Championship Kane – Match contract for SmackDown's World Heavyweight Championship The Miz – Match contract for Raw's WWE Championship 2 Money in the Bank (2011) July 17, 2011 Rosemont, Illinois Allstate Arena John Cena (c) vs. CM Punk for the WWE Championship Daniel Bryan – Match contract for SmackDown's World Heavyweight Championship Alberto Del Rio – Match contract for Raw's WWE Championship 3 Money in the Bank (2012) July 15, 2012 Phoenix, Arizona US Airways Center Big Show vs. Chris Jericho vs. John Cena vs. Kane vs. The Miz in a Money in the Bank ladder match for a WWE Championship match contract Dolph Ziggler – World Heavyweight Championship match contract John Cena – WWE Championship match contract 4 Money in the Bank (2013) July 14, 2013 Philadelphia, Pennsylvania Wells Fargo Center Christian vs. CM Punk vs. Daniel Bryan vs. Randy Orton vs. Rob Van Dam vs. Sheamus in a Money in the Bank ladder match for a WWE Championship match contract Damien Sandow – World Heavyweight Championship match contract Randy Orton – WWE Championship match contract 5 Money in the Bank (2014) June 29, 2014 Boston, Massachusetts TD Garden Alberto Del Rio vs. Bray Wyatt vs. Cesaro vs. John Cena vs. Kane vs. Randy Orton vs. Roman Reigns vs. Sheamus in a Ladder match for the vacant WWE World Heavyweight Championship Seth Rollins 6 Money in the Bank (2015) June 14, 2015 Columbus, Ohio Nationwide Arena Seth Rollins (c) vs. Dean Ambrose in a Ladder match for the WWE World Heavyweight Championship Sheamus 7 Money in the Bank (2016) June 19, 2016 Paradise, Nevada T-Mobile Arena * Roman Reigns (c) vs. Seth Rollins for the WWE World Heavyweight Championship * Seth Rollins (c) vs. Dean Ambrose in Ambrose's Money in the Bank cash-in match Dean Ambrose 8 Money in the Bank (2017) June 18, 2017 St. Louis, Missouri Scottrade Center AJ Styles vs. Baron Corbin vs. Dolph Ziggler vs. Kevin Owens vs. Sami Zayn vs. Shinsuke Nakamura in a Money in the Bank ladder match for a WWE Championship match contract Carmella – WWE SmackDown Women's Championship match contract Baron Corbin – WWE Championship match contract 9 Money in the Bank (2018) June 17, 2018 Rosemont, Illinois Allstate Arena Braun Strowman vs. Bobby Roode vs. Finn Bálor vs. Kevin Owens vs. Kofi Kingston vs. Rusev vs. Samoa Joe vs. The Miz in a Money in the Bank ladder match for a world championship match contract of the winner's brand Alexa Bliss – Women's championship match contract of the winner's brand Braun Strowman – World championship match contract of the winner's brand 10 Money in the Bank (2019) May 19, 2019 Hartford, Connecticut XL Center Ali vs. Andrade vs. Baron Corbin vs. Brock Lesnar vs. Drew McIntyre vs. Finn Bálor vs. Randy Orton vs. Ricochet in a Money in the Bank ladder match for a world championship match contract Bayley – Women's championship match contract Brock Lesnar – World championship match contract 11 Money in the Bank (2020) May 10, 2020 * Orlando, Florida * Stamford, Connecticut * WWE Performance Center * WWE Global Headquarters * Asuka vs. Carmella vs. Dana Brooke vs. Lacey Evans vs. Nia Jax vs. Shayna Baszler in a Money in the Bank ladder match for the WWE Raw Women's Championship * AJ Styles vs. Aleister Black vs. Daniel Bryan vs. King Corbin vs. Otis vs. Rey Mysterio in a Money in the Bank ladder match for a world championship match contract Asuka – Raw Women's Championship Otis – World championship match contract 12 Money in the Bank (2021) July 18, 2021 Fort Worth, Texas Dickies Arena Roman Reigns (c) vs. Edge for the WWE Universal Championship Nikki A.S.H. – Women's championship match contract Big E – World championship match contract 13 Money in the Bank (2022) July 2, 2022 Paradise, Nevada MGM Grand Garden Arena Drew McIntyre vs. Madcap Moss vs. Omos vs. Riddle vs. Sami Zayn vs. Seth \"Freakin\" Rollins vs. Sheamus vs. Theory in a Money in the Bank ladder match for a men's championship match contract Liv Morgan – Women's championship match contract Theory – Men's championship match contract 14 Money in the Bank (2023) July 1, 2023 London, England The O2 Arena The Bloodline (Roman Reigns and Solo Sikoa) vs. The Usos (Jey and Jimmy Uso) Damian Priest – Men's championship match contract Iyo Sky – Women's championship match contract 15 Money in the Bank (2024) July 6, 2024 Toronto, Ontario, Canada Scotiabank Arena Cody Rhodes, Randy Orton, and Kevin Owens vs. The Bloodline (Solo Sikoa, Tama Tonga, and Jacob Fatu) Drew McIntyre – Men's championship match contract Tiffany Stratton – Women's championship match contract ==Footnotes== == References == ==Other websites== Official Website Category:WWE Money in the Bank Category:Professional wrestling Category:2010 establishments in the United States",
 "title": "WWE Money in the Bank"
}