{
 "id": "456024",
 "text": "Walter Dean Myers (born Walter Milton Myers; August 12, 1937 - July 1, 2014) was an American novelist. He wrote children's books and young adult literature. He wrote over one hundred books including picture books and non- fiction. He won the Coretta Scott King Award for African-American authors five times. His works included Hoops (1983), Fallen Angels (1988) and Monster (1999). Myer was born in Martinsburg, West Virginia. He was raised in Harlem, New York City. Myers died from a short illness on July 1, 2014 in Jersey City, New Jersey, aged 76. He was outlived by his wife and two sons. == Works == * The Life of a Harlem Man, illustrated by Gene Riarti (Parents Magazine Press, 1968) * Where Does a Day Go?, illustrated by Leo Carty (Parents Magazine, 1968) * The Dancers, illustrated by Anne Rockwell (Parents Magazine, 1972) * The Dragon Takes a Wife, illustrated by Ann Grifalconi (Bobbs-Merrill, 1972) * Fly, Jimmy, Fly!, illustrated by Moneta Barnett (Putnam, 1974) * Fast Sam, Cool Clyde, and Stuff (Viking Press, 1975) * Social Welfare (Franklin Watts, 1976) * Victory for Jamie (Scholastic Books, 1977) * Mojo and the Russians (Viking, 1977) * Brainstorm, illustrated with photographs by Chuck Freedman (Franklin Watts, 1977) * It Ain't All for Nothin' (Viking, 1978) * The Young Landlords (Viking, 1979) – a group of kids take over an apartment building and struggle to maintain it. * The Golden Serpent, illustrated by Alice and Martin Provensen (Viking, 1980) * The Black Pearl and the Ghost; or, One Mystery after Another, illustrated by Robert Quackenbush (Viking, 1980). Mindless Behavior * The Legend of Tarik (Viking, 1981) * Hoops (Delacorte Press, 1981) – a basketball player tries not to end up * Won't Know Till I Get There (Viking, 1982) – young boys are forced to work in a retirement home * Tales of a Dead King (William Morrow and Company, 1983) * The Nicholas Factor (Viking, 1983) * Motown and Didi: A Love Story (Viking, 1984) – a young couple's love story, and their struggle living in Harlem. * Mr. Monkey and the Gotcha Bird, illustrated by Leslie Morrill (Delacorte, 1984) * The Outside Shot (Delacorte, 1984) – a talented Harlem basketball player goes to college to play * Crystal (1987) – a girl want to be a young fashion model * Fallen Angels (1988) – about young men in the army during the Vietnam war * Scorpions (1990) – a 12-year-old is asked to lead his brother's gang * The Mouse Rap (1990) – a 14-year-old is determined to find the loot from a 1930s bank heist. * Now Is Your Time! The African-American Struggle for Freedom (1992) * The Righteous Revenge of Artemis Bonner (1994) – a 12-year-old boy goes after a man that murdered his uncle. * Darnell Rock Reporting (1994) – a 13-year-old boy joins the school newspaper. * Malcolm X – By Any Means Necessary (Scholastic, 1994) * The Glory Field (1994) – a family's account of their struggle in America from the 18th century to the 1990s. * Shadow of the Red Moon (1995) * Slam (1998) – a young black teen with an attitude problem deals with life on and off the basketball court. * Monster (1999) – a 16-year-old black boy is charged with murder. * We Were Heroes: The Journal of Scott Pendleton Collins – a World War II Soldier, Normandy, France, 1944 (1999)– featuring the invasion of Normandy * 145th Street: Short Stories (2001) * Greatest: Muhammad Ali (2001) * Bad Boy; A Memoir (2001) – Myers' life as a young boy growing up in 1940s Harlem (part of the Amistad Series) * Handbook for Boys: A Novel (2003) * Somewhere in the Darkness (2003) – a young boy travels to Arkansas with a father who did not raise him * Thanks & Giving: All year long (2004) * Shooter (2004) – two friends of a school shooter give an account of him to the police * The Beast (2003) – a 17-year-old boy comes back to his home in Harlem from his boarding school to find that the girl he loves is using drugs * Autobiography of My Dead Brother (1998) – a 14-year-old boy copes with life in Harlem by drawing. * Street Love (2006) – poetic novel of a romance in Harlem * What They Found: Love on 145th Street (2007) * Harlem Summer (2007) * Game (2008) * Sunrise Over Fallujah (2008) – sequel to Fallen Angels, taking place in the Iraq War * Dopesick (2009) – a teenager kills a policeman, and must contemplate his future * Riot (2009) – fictional account of the New York Draft Riots in 1863, during the American Civil War, by the 15-year-old daughter of a black man and an Irish immigrant * Amiri & Odette (2009) – the classic Swan Lake ballet recast in hip-hop verse * Lockdown (2010) * Sunrise Over Fallujah (2010) * Kick (2011), by Myers and Ross Workman * The Cruisers (2011) * We Were Heroes: The Journal of Scott Pendleton Collins, a World War II Soldier (2011) * The Cruisers Checkmate (2012) * The Cruisers Book 3 A Star is Born (2012) * Darius & Twig (2013) * Invasion (2013) – prequel to Fallen Angels * Juba! (2015) - A fictionalized history of William Henry Lane a.k.a Master Juba, a dancer who lived in the mid 1800s and his life and dance career in New York City and London. * The Baddest Dog in Harlem (February 2016 [unspecified]) ==References== ==Other websites== * Category:1937 births Category:2014 deaths Category:African-American writers Category:American children's writers Category:American novelists Category:Disease-related deaths in New Jersey Category:Writers from Jersey City, New Jersey Category:Writers from New York City",
 "title": "Walter Dean Myers"
}