{
 "id": "456253",
 "text": "The Raspberry Pi is a series of single-board computers. They are low-cost, high-performance and the size of a credit card. The Raspberry Pi was developed in the UK by the Raspberry Pi Foundation. The Raspberry Pi Foundation's goal is to \"advance the education of adults and children, particularly in the field of computers, computer science and related subjects.\" The Raspberry Pi Foundation, \"About Us\". Retrieved 21 July 2015 Many people have used Raspberry Pis to make things like cameras, video game consoles, robots, web servers and media centres. == Versions == There are lots of different versions of the Raspberry Pi, and each has different features. All of the versions use a Broadcom 'system on a chip' (SoC) which contains an ARM-compatible central processing unit (CPU), random-access memory (RAM) and a graphics processing unit (GPU). All versions use an SD card or MicroSD card for the operating system and file storage. They also have a 40-pin General-Purpose Input/Output (GPIO) connector, which can be used for controlling other electronics. Some versions of the Raspberry Pi have an ethernet connector for connecting to the internet. Some versions can also use Wi-Fi to connect to the internet. The Raspberry Pi comes in three different sizes. The 'standard' size is used for all Model B versions, and is 85.6 mm x 56.5 mm (3.370 in × 2.224 in). The 'compact' size is used for all Model A versions, and is 65 mm × 56.5 mm (2.56 in × 2.22 in). The 'zero' size is used for all Raspberry Pi Zero versions, and is 65 mm × 30 mm (2.56 in × 1.18 in). Raspberry Pi Versions Version Model Size Processor Memory USB ports Ethernet WiFi and Bluetooth Year Released Price (USD) Raspberry Pi B Standard 700 MHz 1-core 512 MB 2 Yes No 2012 N/A A 1 No 2013 N/A B+ 4 Yes 2014 $25 A+ Compact 1 No $20 Raspberry Pi 2 B Standard 900 MHz 4-core 1 GB 4 Yes No 2015 $35 Raspberry Pi Zero Zero Zero 1000 MHz 1-core 512 MB 1 No No 2015 $5 Zero W Yes 2017 $10 Raspberry Pi 3 B Standard 1200 MHz 4-core 1 GB 4 Yes Yes 2016 $35 A+ Compact 1400 MHz 4-core 512 MB 1 No 2018 $25 B+ Standard 1 GB 4 Yes 2018 $35 Raspberry Pi 4 B (1 GB) Standard 1500 MHz 4-core 1 GB 2xUSB2, 2xUSB3 Yes Yes 2019 N/A B (2 GB) 2 GB $35 B (4 GB) 4 GB $55 B (8 GB) 8 GB 2020 $75 == Features == * The Raspberry Pi uses the ARM processor architecture, which is also used by many modern mobile phones. * An operating system can be installed using the Raspberry Pi Imager, or by copying operating system 'images' to an SD card. *Add-on boards called 'HATs' (Hardware Attached on Top) can be used to give a Raspberry Pi more features, such as LED lights, extra sensors and Power over Ethernet (PoE). == References == == Other websites == * http://www.raspberrypi.org - The Raspberry Pi Foundation *https://www.raspberrypi.org/documentation/faqs/ - Frequently Asked Questions about the Raspberry Pi Category:Computer hardware",
 "title": "Raspberry Pi"
}