{
 "id": "456545",
 "text": "Gordon James Ramsay (; born 8 November 1966) is a British chef, restaurateur, and television personality. He is known for his television cooking shows where he helps failing restaurants improve. He was awarded an OBE by Queen Elizabeth II in 2006. He used to be a Scottish League footballer. However Ramsay was forced to retire from professional football when he was 18 due to suffering a serious knee injury. He instead focused on cooking. He is married to his wife Tana (Nee Hutcheson) with who he has six children and who he married in 1996. He is well known for his fiery demeanour (bad temper) by swearing and loudly insulting people in his television programmes whenever they make mistakes. == Cooking career == Ramsay's flagship restaurant, the Restaurant Gordon Ramsay in Chelsea, London, has three Michelin stars, and has had them since 2001.Michelin 2014. London restaurants & hotels, p283. He has invested in several other restaurants, trained their chefs and designed their menus. His restaurants have been awarded 16 Michelin stars in total and currently hold 7. == Television == Ramsay has appeared as a judge on MasterChef USA. He also presented The F Word and Gordon, Fred and Gino: Road Trip. He also has his own shows including: * Hell's Kitchen, where chefs compete against each other in challenges and dinner services set by Gordon Ramsay. The last chef remaining wins a prize. * Kitchen Nightmares is a show where Ramsay goes to a struggling restaurant and helps it improve. * Hotel Hell is similar to Kitchen Nightmares. Ramsay visits a small hotel and helps it improve. * Future Food Stars is a show similar to The Apprentice UK, where contestants compete to win an investment from Gordon Ramsay. == References == Category:1966 births Category:Living people Category:British autobiographers Category:British chefs Category:British television personalities Category:British television producers Category:Officers of the Order of the British Empire",
 "title": "Gordon Ramsay"
}