{
 "id": "456626",
 "text": "Radivoj Lazić (born 1 August 1953 in Kikinda) is a Serbian musician, clarinettist, teacher, composer, painter and children's writer. == Early life == Radivoj was born on August 1st, 1953, in Kikinda (Banat, Voivodina). There he finished his elementary schooling. This was followed by two years of high school and basic studies of the clarinet. From 1971 to 1974 he attended the Music High school “Isidor Bajić” in Novi Sad with professor Mihajlo Kelbli. In 1974 he became a student of the Faculty of music in Belgrade with professor Bruno Brun. He graduated in 1979 with professor Milenko Stefanovic. == Career == In 1978 he was appointed professor of clarinet at the Music school “Kosta Manojlović” in Zemun. His pupils won several first and special prizes at the competitions in their country and abroad.The Republic Competition of Young Serbian Clarinetists, 2013 The Association of Music and Ballet pedagogues of Serbia awarded him a prize for outstanding educational results in the academic year 1994/95. == Works == In collaboration with Vlastimir Peričić he wrote many compositions for clarinet, from beginner to highly-professional level. They have been performed worldwide. He has devoted some 30 books to clarinet and published 22. The author’s works are: * I am Studying Clarinet I, II, III and IV (school for the elementary level)I am Studying Clarinet * The singing clarinet I, II, III and IV (50 easy original pieces with piano accompaniment, progressively arranged)The singing clarinet * Melodious Studies I, II (choice of 36 studies from the school I am Studying Clarinet, with piano accompaniment, for pupils’ stage appearances.))Melodious Studies * Easy Clarinet Duos I, II (20 duos from the school I am Studying Clarinet, with piano accompaniment)Easy Clarinet Duos * Scale Studies II, III and IV (corresponding volumes of the school I am Studying Clarinet)Scale Studies * Merry days in the music school (10 original compositions with piano, in progressive order from the elementary to medium level.)Merry days in the music school * Great Masters for Clarinet I, II, III, IV, V and VI (transcriptions for clarinet and piano of 65 famous pieces from the world literature.)Great Masters for Clarinet * Scale Studies (Medium level A-B)Scale Studies * The Young Clarinet Virtuoso I, II, III and IV (20 original compositions for clarinet and piano, from medium to professional level.)The Young Clarinet Virtuoso * We are playing with orchestra (choise of 25 progressively arranged pieces from the collections mentioned under The singing clarinet, Merry days in the music school, and The Young Clarinet Virtuoso, for clarinet and school orchestra.)We are playing with orchestra * Romantic Concerto in A minor == Works in wind instruments == Radivoj Lazić has written several books with pieces for other wind instruments accompanied by piano, such as: the oboe, flute, saxophone, trumpet and horn. == Importance == *With his great composing activity, Radivoj Lazić has enriched the clarinet and clarinet-pedagogical literature in Serbia and beyond. *His many books for the clarinet are a part of the school curriculum in the Republic of Serbia.Books for the clarinet by Radivoj Lazić are a part of the school curriculum in the Republic of Serbia. Page 205 *Compositions of Radivoj Lazić are often performed in concert halls in Serbia and abroad. They have been listed as a working part of the Clarinet Seminars-Masterclasses, and have been mandatory, as well as optional free compositions of many competitions. Concertino in G minor by Radivoj Lazić was an obligatory piece on the Jeunesses Musicales Competition \"The Orpheus Laureates\" in Belgrade in 1998. Recording from the International Competition \"Davorin Jenko\" held in Belgrade, Serbia, March 3, 2014. *A decade - long educational work of Radivoj Lazić has created many clarinetists who now work in Serbia and abroad. *He is the writer of a great number of textbooks for preschoolers and younger elementary school students. *He is also the founder, writer, illustrator and entire creator of the famous children's journal The colorful world. == References == ==Other websites== * *All about the clarinet and clarinetists Category:1953 births Category:Living people Category:Serbian composers Category:Serbian classical musicians Category:Clarinetists Category:Yugoslavian musicians Category:Serbian songwriters Category:Musicians from Belgrade Category:Yugoslavian artists Category:20th-century artists Category:21st-century artists",
 "title": "Radivoj Lazić"
}