{
 "id": "456749",
 "text": "Dropkick Murphys is an American Celtic punk band from Quincy, Massachusetts. The band has currently has seven members. The members are Ken Casey, Matt Kelly, Al Barr, James Lynch, Tim Brennan, Josh \"Scruffy\" Wallace, and Jeff DaRosa. The band made a name for themselves locally after frequent touring and yearly St. Patrick's Day week shows that were held in and around Boston. The band released their later album Signed and Sealed in Blood on January 8, 2013. ==History== The band started in 1996 in Quincy, Massachusetts and was made up of lead vocalist Mike McColgan, bassist/vocalist Ken Casey, guitarist Rick Barton, and drummer Jeff Erna. Erna was later replaced the next year by Matt Kelly. The band is named after professional wrestler Dr. John \"Dropkick\" Murphy. The band first started playing in the basement of a friend's barbershop and soon began to tour and record music. The band's first big break was when the were selected by The Mighty Mighty Bosstones to be the opening act for their 1997 tour in support of Let's Face It. The band released a series of EPs before they were signed to Hellcat Records. They released their debut studio album Do or Die on January 27, 1998. The album was produced by Lars Frederiksen of Rancid. Lead singer Mike McColgan would leave the band later in the year to become a Boston firefighter (He returned to the punk scene later as the singer of the Street Dogs). == Band members == ;Current *Ken Casey – Bass guitar, lead vocals (1996–present) *Matt Kelly – Drums, bodhran, vocals (1997–present) *Al Barr – lead vocals (1998–present) *James Lynch – Guitar, vocals (2000–present) *Josh \"Scruffy\" Wallace – Bagpipes, tin whistle (2003–present) *Tim Brennan – Lead guitar (2008–present), guitar, bouzouki, mandolin, accordion, keyboard, piano, vocals (2003–present) *Jeff DaRosa – Banjo, bouzouki, mandolin, guitar, keyboard, piano, harmonica, whistle, vocals (2008–present) ;Former *Rick Barton – Guitar (1996–2000) *Mike McColgan – Lead vocals (1996–1998) *Jeff Erna – Drums (1996–1997) *Joe Delaney – Bagpipes (1998–2003) *Marc Orrell – Guitar, accordion, piano (2000–2008) *Spicy McHaggis (Robbie Mederios) – Bagpipes (2000–2003) *Ryan Foltz – Mandolin, tin whistle (2000–2003) ==Discography== ===Albums=== *Do or Die (1998) *The Gang's All Here (1999) *Sing Loud, Sing Proud! (2001) *Blackout (2003) *The Warrior's Code (2005) *The Meanest of Times (2007) *Going Out in Style (2011) *Signed and Sealed in Blood (2013) *11 Short Stories of Pain & Glory (2017) *Turn up That Dial (2021) *This Machine Still Kills Fascists (2022) ==References== ==Other websites== *Official website Category:Musical groups established in 1999 Category:American punk bands Category:Musical groups from Massachusetts Category:1990s establishments in Massachusetts Category:1999 establishments in the United States Category:People from Quincy, Massachusetts",
 "title": "Dropkick Murphys"
}