{
 "id": "456701",
 "text": "Luzon is the largest state island in the Philippines. It is situated at northern portion of the country. The vicinity capital of the Philippines, Manila, as well as other cities like Quezon City, are on the island. As of the 2010 census, 48.5 million people lived on Luzon. ==Geography== ===Mainland Luzon=== There were having sub super regions the North Luzon composed Ilocos Region (I), Cordillera Administrative Region (CAR), Cagayan Valley (II), Central Luzon (III) and the South Luzon are Metro Manila (NCR), Calabarzon (4A), and Bicol Region (5), except Mimaropa (4B) as islands. ===Sea=== The \"Luzon Sea\" is located at the 9 dash line of the South China Sea in the southwest neutical miles from Taiwan, The Philippine Sea to the east, West Philippine Sea to the west, Visayan Sea in the central and Mindanao Sea to the south. ==Sub regions== Region Six division Four division Three division Two dibisyon Ilocos Region (Region I) Ilocandia Northern Luzon Northern & Central Luzon Northern & Central Luzon Cagayan Valley (Region II) Ilocandia Northern Luzon Northern & Central Luzon Northern & Central Luzon Cordillera Administrative Region Cordilleras Northern Luzon Northern & Central Luzon Northern & Central Luzon Central Luzon Central Luzon Central Luzon Northern & Central Luzon Northern & Central Luzon National Capital Region Metro Manila Metro Manila Metro Manila Southern Luzon Calabarzon Southern Tagalog Southern Luzon Southern Luzon Southern Luzon Mimaropa Southern Tagalog Southern Luzon Southern Luzon Southern Luzon Bicol Region Bicolandia Southern Luzon Southern Luzon Southern Luzon === Northern luzon === Northern Luzon is a sub region located to the north of the Philippine archipelago, comprising 4 regions of Ilocos Region, Cordillera Administrative Region, Cagayan Valley and Central Luzon. ; 4 divisions Region Regional center Division Ilocos Region San Fernando Northwestern Luzon Cordillera Administrative Region Baguio Northcentral Luzon Cagayan Valley Tuguegarao Northeastern Luzon Central Luzon San Fernando City Central Luzon ; Largest cities of Northern Luzon ; Central Luzon === Southern luzon === Southern Luzon is located at the vicinity of Philippine capital (Manila), The sub regions comprising 4 regions; Metro Manila (NCR), Calabarzon (4-A), Mimaropa (4-B) and Bicol Region or 5. ; 4 divisions Region Regional center Division Metro Manila, NCR Manila Metro Manila Calabarzon, 4-A Calamba Southern Luzon Mimaropa, 4-B Calapan Southwestern Luzon Bicol, 5 Legazpi Southeastern Luzon ; Largest cities of Southern Luzon ===Luzon Metropolitan=== Metropolitan Metropolitan center Divisions Metro Baguio Baguio Northern Luzon/Cordillera's Metro Manila Manila Southern Luzon/NCR Urban Laguna Santa Rosa Metro Naga Naga Metropolitan Metropolitan center Divisions Metro Dagupan Dagupan Northern Luzon Metro Clark Angeles City Central Luzon Metro Olongapo Olongapo Metro Batangas Batangas City Calabarzon, 4-A ==Regions of Luzon State== Island group: LUZON (NORTH PHILIPPINES) Map Region (short name) Regional center Provinces Area (km2) Population (2010) Density (per km2) National Capital Region (NCR) MANILA (capital) Metro Manila (cities) 636 11,855,975 18641.5 Cordillera (CAR) Baguio City *Abra *Apayao *BaguioA highly urbanized city, one class of cities in the Philippines, independent from any province. *Benguet *Ifugao *Kalinga *Mountain Province 18,294 1,616,867 88.4 Ilocos (Region I) San Fernando City *Ilocos Norte *Ilocos Sur *La Union *Pangasinan 12,840 4,748,372 369.8 Cagayan Valley (Region II) Tuguegarao City *Batanes *Cagayan *Isabela *Nueva Vizcaya *Quirino *Santiago CityAn independent component city, one class of cities in the Philippines that do not depend of any provincial government. 26,838 3,229,163 120.3 Central Luzon (Region III) San Fernando City *Angeles City *Aurora *Bataan *Bulacan *Nueva Ecija *Olongapo *Pampanga *Tarlac *Zambales 21,470 10,137,737 472.2 CALABARZON (Region IV-A) Calamba City *Batangas *Cavite *Laguna *Lucena City *Quezon *Rizal 16,229 12,609,803 777 MIMAROPA (Region IV-B) Calapan City *Marinduque *Occidental Mindoro *Oriental Mindoro *Palawan *Puerto Princesa City *Romblon 27,456 2,744,671 100 Bicol (Region V) Legazpi City *Albay *Camarines Norte *Camarines Sur *Catanduanes *Masbate *Naga City *Sorsogon 17,632 5,420,411 307.4 ==References==",
 "title": "Luzon"
}