{
 "id": "456888",
 "text": "is a Japanese professional wrestler. He is currently signed to Pro Wrestling Noah where he wrestles under the ring name KENTA. He previously wrestled for New Japan Pro-Wrestling (NJPW) and has also wrestled in WWE under the ring name Hideo Itami. He is best known for his 14-year tenure with Pro Wrestling Noah. During his time in Pro Wrestling Noah, Kobayashi is a former one-time GHC Heavyweight Champion, three-time GHC Junior Heavyweight and one-time GHC Tag Team Champion. He also won the 2012 Global League and the 2013 Global Tag League tournaments. He was also one half of the GHC Junior Heavyweight Tag Team Champions twice; his first reign was the inaugural reign with his longtime tag partner and rival, Naomichi Marufuji, which saw the two hold the title for almost two years. His second reign was with his protégé, Taiji Ishimori. He first wrestled under his real name, but because of potential confusion with his mentor, Kenta Kobashi (in both English and Japanese), he decided to drop his surname and only use his given name. He also spells his ring name with Roman letters in all capitals. ==WWE (2014-2019)== On January 27, 2014, he did a tryout at WWE's Performance Center in Orlando, Florida with Noah's blessing. In a press release, he said that he was not looking for a WWE contract but he only wanted to fulfill a dream that he had to take part in a WWE workout. On June 27, 2014, it was reported by Tokyo Sports that Kenta had signed with the WWE. During WWE's July 12, 2014 event in Osaka, they announced that they had signed Kenta during an in-ring segment with Hulk Hogan. He then started training at the Performance Center and working for WWE's developmental territory NXT. He debuted at NXT Takeover: Fatal 4-Way on September 11, 2014. He was introduced by William Regal. During his debut, he announced that his new ring name would be Hideo Itami, meaning \"Hero of Pain\". He would then fend off The Ascension (Konnor and Viktor) after they interrupted the segment to confront Regal. Itami made his in-ring debut on the September 18 episode of NXT, defeating Justin Gabriel. After his match, he was attacked by The Ascension. He continued to fight The Ascension in brawls but ended up on the losing side because of the numbers advantage. On the November 6 episode, Itami revealed his tag partner as the debuting Finn Bálor. On February 22, 2019, Kenta was released from the WWE. He called his time in WWE \"the most frustrating days of my life\". ==Championships and accomlpishments== *Alianza Latinoamericana de Lucha Libre **Torneo Latino Americano de Lucha Libre (2013) *Pro Wrestling Illustrated **He was ranked #22 of the top 500 singles wrestlers in the PWI 500 in 2013. *Pro Wrestling Noah **GHC Heavyweight Championship (1 time) **GHC Junior Heavyweight Championship (3 times) **GHC Junior Heavyweight Tag Team Championship (3 times) (with Naomichi Marufuji (1), Taiji Ishimori (1) and Yoshinobu Kanemaru (1)) **GHC Tag Team Championship (1 time) (with Maybach Taniguchi) **Differ Cup (2005) **Global League Tournament (2012) **Global Tag League (2013) (with Yoshihiro Takayama) **Nippon TV Cup Junior Heavyweight Tag League (2007, 2008, 2010) (with Taiji Ishimori (2007, 2008) and Atsushi Aoki (2010)) **2 Days Tag Tournament (2011) (with Yoshihiro Takayama) **One Day Six Man Tag Team Tournament (2002) (with Kenta Kobashi & Kentaro Shiga) **Matsumoto Day Clinic Cup Contention Heavyweight Battle Royal (2013) **Global Tag League Fighting Spirit Award (2014) (with Yoshihiro Takayama) *Tokyo Sports **Best Bout Award (2006) (vs. Naomichi Marufuji, October 29, 2006) **Best Tag Team Award (2003) (with Naomichi Marufuji) **Outstanding Performance Award (2013) **Technique Award (2011) *Wrestling Observer Newsletter **Best Wrestling Maneuver (2006, 2007) (Go 2 Sleep) **Tag Team of the Year (2003, 2004) (with Naomichi Marufuji) == References == ==Other websites== * *KENTA's Pro Wrestling Noah profile Category:1981 births Category:Japanese professional wrestlers Category:Living people Category:Former WWE wrestlers Category:People from Saitama Prefecture",
 "title": "Kenta Kobayashi"
}