{
 "id": "456902",
 "text": "The House of La Tour d'Auvergne was a French noble family. They had great power and wealth during the 17th and 18th century in France. The family claimed to rule the Duchy of Bouillon from the year of 1456. The duchy was later ceded to France on 26 October 1795. The family had apartments at the Palace of Versailles and a grand townhouse in Paris (now destroyed). The family were notoriously arrogant. They schemed to marry their children well. They tried to gain favour with the royal family of the time. The duchy came into the family through the marriage of Henri de La Tour d'Auvergne to Charlotte de La Marck who was a duchess in her own right. The family also claimed to be the sovereign rulers of the Principality of Sedan. The family used several lesser titles such as titles of Duke of Albret and Duke of Château-Thierry from 1651. They held the rank of \"Foreign Princes\" at Versailles. As such, they were entitled to use the style of \"Highness\". ==Dukes of Bouillon== The dukes were usually addressed by the style of Serene Highness. # Henri de La Tour d'Auvergne (1555-1623) # Frédéric Maurice de La Tour d'Auvergne (1605-1652) # Godefroy Maurice de La Tour d'Auvergne (1636-1721) # Emmanuel-Théodose de La Tour d'Auvergne (1668-1730) # Charles Godefroy de La Tour d'Auvergne (1706-1771) # Godefroy Charles Henri de La Tour d'Auvergne (1728-1792) # Jacques Léopold de La Tour d'Auvergne (1746-1802) Jacques Léopold was the last Duke of Bouillon, and following the Napoleonic Wars the duchy was absorbed into the Grand Duchy of Luxembourg. ==Notable members and relations== *Catherine de' Medici was the daughter of a La Tour d'Auvergne. *Henri de la Tour d'Auvergne, Vicomte de Turenne (1611-1675), Marshal of France, younger brother of the second Duke of Bouillon. *Marie Charlotte de La Tour d'Auvergne the Princess of Beauvau by marriage and painted by Jean Marc Nattier. *Emmanuel Théodose de La Tour d'Auvergne known as the Cardinal de Bouillon and a famous religious figure of his time. *Louis Henri de La Tour d'Auvergne known as the Count of Évreux, who also built the Hôtel d'Évreux in Paris the official residence of the President of the French Republic. Category:French nobility",
 "title": "La Tour d'Auvergne"
}