{
 "id": "457032",
 "text": "Teaching machines were originally mechanical devices. They presented educational materials and taught students. They were first invented by Sidney L. Pressey.Pressey's priority is supported by Ernest Hilgard in Hilgard E.R. 1966. Learning & the technology of instruction. Chapter 16 in Hilgard E.R. & Bower G.H. 1966. Theories of learning. 3rd ed, New York: Appleton-Century- Crofts, p554561 Programmed learning. His machine originally administered multiple-choice questions. When the machine was set so it moved on only when the student got the right answer, tests showed that learning had taken place.Pressey S.L. 1926. A simple apparatus which gives tests and scores and teaches. School and Society, 23 (586), 373–376.Pressey S.L. 1927. A machine for automatic teaching of drill material. School and Society, 25 (645), 549–552.Pressey S.L. 1932. A third and fourth contribution toward the coming \"industrial revolution\" in education. School and Society, 36 (934), 668–672.Pressey 1950. Development and appraisal of devices providing immediate automatic scoring of objective tests and concomitant self instruction. Journal of Psychology, 29, 417447. Much later, Norman Crowder developed the Pressey idea much further.Crowder N. 1959. Automatic tutoring by means of intrinsic programming. In Galanter E.H. (ed) Automatic teaching: the state of the art. New York: Wiley, 109116. B.F. Skinner was responsible for a different type of machine which used his ideas on how learning should be directed with positive reinforcement.Skinner B.F. 1965. The technology of teaching. Appleton-Century- Croft. Includes reprints of all his papers on programmed learning. There is extensive experience that both methods worked well, and so did programmed learning in other forms, such as books.Glaser R. (ed) 1965. Teaching machines and programed learning II: data and directions. Washington D.C. National Education Association. The ideas of teaching machines and programmed learning provided the basis for later ideas such as open learning and computer-assisted instruction. == Quotes == *Edward L. Thorndike in 1912: \"If, by a miracle of mechanical ingenuity, a book could be so arranged that only to him who had done what was directed on page one would page two become visible, and so on, much that now requires personal instruction could be managed by print\".Thorndike E.L. 1912. Education: a first book. New York: Macmillan, p165. *Pressey in 1932: \"Education was the one major activity in this country which has thus far not systematically applied ingenuity to the solution of its problems\". (p. 668). He thought the machine he developed would lead to an \"industrial revolution in education\" (p. 672). == References == Category:Machines Category:Education",
 "title": "Teaching machine"
}