{
 "id": "457378",
 "text": "The Comunità montana Grand Paradis (\"Grand Paradis mountain community\", in French Communauté de montagne Grand-Paradis) is an association of 13 comuni in the Italian region of Valle d'Aosta. The Comunità is named after the Gran Paradiso mountain, a mountain in the Graian Alps between the Valle d'Aosta and Piedmont regions of north-west Italy. The Gran Paradiso mountain can be seen from the comuni of the Comunità. ==Purpose== Its main purpose is to promote the development of the valleys in the preservation of their cultural and environmental heritage. The Comunità also helps with technical assistance to all the comuni of the region. The main activities have been: * protection of alpine pastures (or Alpine tundra) * development of tourism ==Geography== This Comunità is in the central part of Valle d'Aosta, to the west and south of Aosta, the capital city of the region. The comuni are in the central valley of the region and in other small lateral valleys: Val di Cogne, Valsavarenche, Val di Rhêmes and Valgrisenche. The main river in the Comunità is the Dora Baltea that flows through the Comunità from east to west. The Comunità montana Grand Paradis has a total area of about and a population of 15,674; its population density is of inhabitants/km2. The headquarters of the mountain community are in Villeneuve. The Comunità includes the following comuni: Comuni Population (2013) Area (km²) Density (Inh./km²) 1 Arvier 899 33.36 2 Avise 325 52.66 3 Aymavilles 2,066 53.41 4 Cogne 1,443 212.85 5 Introd 640 19.69 6 Rhêmes-Notre-Dame 107 86.72 7 Rhêmes-Saint-Georges 199 36.78 8 Saint-Nicolas 315 15.46 9 Saint-Pierre 3,111 26.25 10 Sarre 4,925 28.10 11 Valgrisenche 198 113.26 12 Valsavarenche 179 139.05 13 Villeneuve, Aosta Valley 1,267 8.88 ==References== ==Related pages== * Valle d'Aosta ==Other websites== * The National Union of Mountain Towns and Communities - UNCEM * Comuniverso: le 211 Comunità montane * Guida Rurale della Valle d'Aosta. Comunità Montana Comunità montana Grand Combin Category:Italian mountain communities",
 "title": "Comunità montana Grand Paradis"
}