{
 "id": "457384",
 "text": "The Comunità montana Monte Cervino (\"Monte Cervino mountain community\", in French Communauté de montagne Mont-Cervin) is an association of 12 comuni in the Italian region of Valle d'Aosta. The Comunità is named after the Monte Cervino mountain, a mountain in the Alps that is on the border between Switzerland and Italy. This mountain is at the northern end of the Valtournenche valley, which is part of this comunità. ==Purpose== Its main purpose is to promote the development of the valleys in the preservation of their cultural and environmental heritage. The Comunità also helps with technical assistance to all the comuni of the region. The main activities have been: * protection of alpine pastures (or Alpine tundra) * development of tourism ==Geography== This Comunità is in the central part of Valle d'Aosta, to the east and northeast of Aosta, the capital city of the region. The comuni are in the central valley of the region and in a small lateral valley: the Valtournenche valley. The main river in the Comunità is the Dora Baltea that flows through the Comunità from east to west. The Marmore is a small river that flows through the Valtournenche valley and joins the Dora Baltea as a left tributary at Châtillon. The Comunità montana Monte Cervino has a total area of about and a population of 16,797; its population density is of inhabitants/km2. The headquarters of the mountain community are in Châtillon. The Comunità includes the following comuni: Comuni Population (2013) Area (km²) Density (Inh./km²) 1 Antey-Saint-André 613 11.82 2 Chambave 936 21.90 3 Chamois 101 14.49 4 Châtillon 4,855 39.77 5 Emarèse 238 10.04 6 La Magdeleine 110 8.90 7 Pontey 809 15.97 8 Saint-Denis 397 11.32 9 Saint-Vincent 4,687 20.81 10 Torgnon 537 42.32 11 Valtournenche 2,169 115.58 12 Verrayes 1,345 22.58 ==References== ==Related pages== * Valle d'Aosta * Matterhorn ==Other websites== * The National Union of Mountain Towns and Communities - UNCEM * Comuniverso: le 211 Comunità montane * Guida Rurale della Valle d'Aosta. Comunità Montana Monte Cervino Category:Italian mountain communities",
 "title": "Comunità montana Monte Cervino"
}