{
 "id": "457448",
 "text": "Korean Air Lines Flight 007 (also known as KAL007 and KE007KAL 007 was used by air traffic control, while the public flight booking system used KE 007) was a scheduled Korean Air Lines flight from New York City to Seoul via Anchorage. On September 1, 1983, the airliner serving the flight was shot down by a Soviet Su-15 interceptor near Moneron Island, west of Sakhalin Island, in the Sea of Japan. The interceptor's pilot was Major Gennadi Osipovich. There are no survivors among 269 people on board, including Lawrence McDonald, representative from Georgia in the United States House of Representatives. The aircraft was en route from Anchorage to Seoul when it flew through prohibited Soviet airspace around the time of a U.S. reconnaissance mission. Former President Richard Nixon was to have been seated next to Larry McDonald on KAL 007 but decided not to go, according to the New York Post and TASS. The shooting of Korean Air Lines was one of the most tense moments of the Cold War. In the aftermath of the shooting, President Ronald Reagan made a presidential announcement,saying that what the Soviets did was bad. Reagan was angry about what happened and changed his mind of making peace with the Soviets. President Reagan announced on September 16, 1983, that the Global Positioning System (GPS) would be made available for civilian use. Nationality Passengers Crew Total 82 23 105 62 0 62 28 0 28 23 0 23 16 0 16 12 0 12 8 0 8 4 0 4 5 0 5 3 0 3 3 0 3 2 0 2 2 0 2 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 Total 246 23 269 == Reason for shooting down == According to the World History Timeline, the Russians believed the jumbo jet was a United States spy plane. Four jet fighters were scrambled from the so-called Air Force Base. Two missiles were on target. One exploded just behind the tail of the plane, and the other by the left wing of the plane. == More details about shutting down == At 1:30 a.m., Flight 007 entered Soviet airspace. However, there was not much time for Flight 007 to hover over Kamchatka to respond, so the Soviet air defense squadron deployed on the Kamchatka Peninsula returned without attempting an interception, and Flight 007 passed through Soviet airspace at 2:28 am and disappeared from Soviet radar. As Flight 007 slowed down, gained altitude, and overshot, Osipovich, apparently thinking that he was trying to outwit him, circled around Flight 007 ag, flew 8 km behind Flight 007, and fired an R-98 air-to- air missile at around 3:25 ts. ==References== ==Books== * ==Notes== ==Other websites== * Soviet Air Force Transcripts , Airliners.net * . * . * . * . Category:1983 in Asia Category:Aviation accidents and incidents in the 1980s Category:Cold War Category:Disasters in the Soviet Union Category:Presidency of Ronald Reagan",
 "title": "Korean Air Lines Flight 007"
}