{
 "id": "457591",
 "text": "Elizabeth is a city in Union County, New Jersey, United States. As of the 2020 United States Census, the city had a total population of 137,298. It is New Jersey's fourth largest city. In 2008, Elizabeth was named one of \"America's 50 Greenest Cities\" by Popular Science magazine, the only city in New Jersey selected.Elizabeth Svoboda; et al., 'America's 50 Greenest Cities', Popular Science, Vol 272, No. 3 (March 2008), pp. 51–58 The Elizabeth River runs into Newark Bay in Elizabeth. == History == Elizabeth was founded in 1665 by English settlers and originally called \"Elizabethtown\". It was part of the Elizabethtown Tract. The town was named for Elizabeth, wife of governor George Carteret. The town served as the first capital of New Jersey.Jean-Rae Turner; Richard T. Koles, Elizabeth: The First Capital of New Jersey (Charleston, SC: Arcadia, 2003), p. 13 During the American Revolutionary War, there were over a hundred battles and skirmishes fought in and around Elizabeth.Jean-Rae Turner; Richard T. Koles, Elizabeth: The First Capital of New Jersey (Charleston, SC: Arcadia, 2003), p. 28 On March 13, 1855, the City of Elizabeth was created by an Act of the New Jersey Legislature.Edwin Hatfield, History of Elizabeth, New Jersey (Carlisle, MA: Applewood Books, 2010), p. 685 On March 19, 1857, the city became part of the newly created Union County. Portions of the city were taken to form Linden Township on March 4, 1861.John P. Snyder, The Story of New Jersey's Civil Boundaries: 1606-1968 (Trenton, NJ: Bureau of Geology and Topography, 1969; Reprinted: New Jersey Geological Survey, 2004), p. 238 The Singer Sewing Machine Company was the first major industry in Elizabeth. They had up to 2,000 workers. In 1895, one of the first car companies opened. This was the Electric Carriage and Wagon Company. They were soon joined by another electric car builder, Andrew L. Riker. The Electric Boat Company got its start building submarines for the United States Navy in Elizabeth. The first boat to launch was the USS Holland (SS-1) in 1897.Biographical Dictionary of the History of Technology, eds. Lance Day; Ian McNeil (London; New York: Routledge, 1996), p. 604 Elizabeth grew in parallel to the larger city of Newark for many years. But Elizabeth has been more successful in retaining a middle class presence and was spared riots in the 1960s. == References == Category:Cities in New Jersey Category:County seats in New Jersey Category:1855 establishments in the United States Category:1850s establishments in New Jersey",
 "title": "Elizabeth, New Jersey"
}