{
 "id": "457505",
 "text": "Mickey's Diner is an art deco-styled, dining car restaurant located in downtown St. Paul, Minnesota. It is located at 36 West 7th Street. == History == The diner was built in 1937 by the Jerry O'Mahony Diner Company of Elizabeth, New Jersey.Eric Dregni, Minnesota Marvels: Roadside Attractions in the Land of Lakes (Minneapolis: University of Minnesota Press, 2001), p. 226 Then it was shipped to Saint Paul by rail and installed in 1939.Richard Gutman, American Diner Then and Now (Baltimore, MD: Johns Hopkins University Press, 2000), p. 210 The diner is 50 feet long by 10 feet wide. The 24-hour diner has operated non-stop since it first opened. In 1983, the diner was added to the National Register of Historic Places.Michael Karl Witzel, The American Diner (St. Paul, MN: MBI, 2006), p. 142 == Pop culture == The original Mickey's Diner appears in several Hollywood movies. These include The Mighty Ducks, Jingle All the Way, and A Prairie Home Companion.Holly Day, Sherman Wick, Walking Twin Cities: 34 Tours Exploring Historic Neighborhoods, Lakeside (Birmingham, AL: Wilderness Press, 2013), pp. 202–203 The diner is also featured on the front and back cover of the 1985 self-titled, debut album of R&B; singer, Alexander O'Neal. The diner appears in O'Neal's 1985 music video for the song, \"Innocent\", and in the 1991 Pet Shop Boys music video for the song, \"Where The Streets Have No Name (I Can't Take My Eyes Off Of You)\". Pictures of the diner were in local and national newspapers for a different reason during the 2008 Republican National Convention in Saint Paul. Police confronted about two hundred protesters in front of Mickey's Diner. They made them leave by using tear gas, pepper spray, and flash grenades. == References == == Other websites == *Mickey's Diner—official website *Mickey's Diner —Minnesota Historical Society Category:1939 establishments in the United States Category:Art Deco buildings Category:Buildings and structures in Minnesota Category:National Register of Historic Places Category:20th-century establishments in Minnesota",
 "title": "Mickey's Diner"
}