{
 "id": "45760",
 "text": "Nuclear power is the controlled use of nuclear energy. Nuclear energy can be released by nuclear reactions in a machine called a nuclear reactor. This energy boils water for a steam engine to make electricity, which then can be used to power machines and homes. In 2023, 10% of the world's electricity came from nuclear power. Nuclear power plants also make radioactive waste that could be harmful if it is not stored properly. == History == Enrico Fermi made the first nuclear reactor in the year 1941. Many reactors were built in the U.S. during World War II during the Manhattan Project. In 1954 the first nuclear power plant started in Obninsk near Moscow. Most nuclear power plants in the U.S. were built during the 1960s and 1970s. Nuclear reactors also power some large military ships and submarines and a few icebreakers (a kind of ship). == Energy production == Nuclear reactors use a process called nuclear fission, which uses atoms like uranium or plutonium (In particular the isotope Uranium 235) and splits them apart with particles called neutrons. This converts some of the mass into energy, according to Einstein's equation E=mc2. The fissionable elements are placed into rods called 'fuel rods'. The fuel rods are submerged in water, and the energy released in the fission reaction heats up the water which turns into steam. The steam then turns a turbine, which generates electricity. The steam is then condensed in huge cooling towers, and it turns back into water and is sent into the reactor again. The reaction can be controlled by putting 'control rods' in between the fuel rods. The control rods are generally made of boron, which absorbs neutrons and stops the reaction. A nuclear meltdown can happen when the reaction is not controlled, and starts to generate dangerous radioactive gases (like Krypton). Contrary to popular belief, nuclear reactors can't explode like a nuclear bomb, but it is a danger when radioactive materials escape. ==Accidents== Some serious nuclear accidents have occurred. A scale was made to measure how dangerous accidents are. It is called the International Nuclear Event Scale. The scale has 8 levels (0-7), and 7 is the worst. * Chernobyl disaster, happened in 1986; classified at level 7. * Fukushima nuclear disaster, happened in 2011 as a result of an earthquake, level 7. * Mayak accident; happened in 1957. The amount of radiation released and the general danger was higher than that of Chernobyl. The affected area was smaller though. For these reasons the accident is only classified as level 6.The Most Contaminated Spot on the Planet * Windscale fire in 1957 and Three Mile Island accident in 1979, at level 5. * Tokaimura nuclear accident at level 4 Nuclear-powered submarine mishaps include the Soviet submarine K-19 reactor accident (1961),Strengthening the Safety of Radiation Sources p. 14. the Soviet submarine K-27 reactor accident (1968), and the Soviet submarine K-431 reactor accident (1985). ==Economics== The economics of nuclear power is challenging, and following the 2011 Fukushima nuclear disaster, costs are likely to go up for currently operating and new nuclear power plants, due to increased requirements for on-site spent fuel management and elevated design basis threats. ==Debates== There is a debate about the use of nuclear power.James J. MacKenzie. Review of The Nuclear Power Controversy by Arthur W. Murphy The Quarterly Review of Biology, Vol. 52, No. 4 (Dec., 1977), pp. 467-468.In February 2010 the nuclear power debate played out on the pages of the New York Times, see A Reasonable Bet on Nuclear Power and Revisiting Nuclear Power: A Debate and A Comeback for Nuclear Power? Supporters, such as the World Nuclear Association and IAEA, argue that nuclear power is a sustainable energy source that reduces carbon emissions.U.S. Energy Legislation May Be 'Renaissance' for Nuclear Power. Additionally, it does not contribute to smog or acid rain. It is believed that thousands of lives have been saved by using nuclear energy instead of more dangerous fuels such as coal, oil and gas. Anti-nuclear opponents, such as Greenpeace International and the Nuclear Information and Resource Service, believe that nuclear power poses threats to people and the environment.NC WARN » Nuclear Power Nuclear power generates radioactive waste materials, both as fission products (broken atoms) and by inducing radioactivity in existing materials. ==Research== People have also been studying since the middle of the 20th century to use fusion power which produces much more energy and does not produce radioactive waste. Nuclear fusion reactors do not exist yet and are still being developed. ==Other information== In 2007, nuclear power plants made some 2600 TWh of electricity and provided 14 percent of the electricity used in the world, which represented a fall of 2 percent compared with 2006.Nuclear decline set to continue, says report Nuclear Engineering International, 27 August 2009. As of May 9, 2010, there were 438 (372 GW) nuclear reactors operating globally. A peak was reached in 2002 when there were 444 nuclear reactors operating. The nuclear emergencies at Japan's Fukushima Daiichi Nuclear Power Plant and other nuclear facilities raised questions about the future of nuclear power.Nuclear Renaissance Threatened as Japan’s Reactor Struggles Bloomberg, published March 2011, accessed 2011-03-14Analysis: Nuclear renaissance could fizzle after Japan quake Reuters, published 2011-03-14, accessed 2011-03-14Japan nuclear woes cast shadow over U.S. energy policy Reuters, published 2011-03-13, accessed 2011-03-14Nuclear winter? Quake casts new shadow on reactors MarketWatch, published 2011-03-14, accessed 2011-03-14Will China's nuclear nerves fuel a boom in green energy? Channel 4, published 2011-03-17, accessed 2011-03-17 Platts has said that \"the crisis at Japan's Fukushima nuclear plants has prompted leading energy-consuming countries to review the safety of their existing reactors and cast doubt on the speed and scale of planned expansions around the world\". Following the Fukushima nuclear disaster, the International Energy Agency halved its estimate of additional nuclear generating capacity to be built by 2035. ==Related pages== * Energy security * Nuclear accidents * Nuclear binding energy * Nuclear energy policy * Nuclear technology * Fusion power * Sustainable energy ==References== Category:Nuclear energy",
 "title": "Nuclear power"
}