{
 "id": "457709",
 "text": "The New Democratic Party (NDP) is a social democratic political party in Canada. It was formed in 1961 when the Co-operative Commonwealth Federation merged with the Canadian Labour Congress. In Canadian politics, the NDP is to the left of the Liberal Party. Wings of the NDP have formed governments in several provinces. It forms the current government in British Columbia. In the 2011 federal elections it won 98 out of 308 seats in the House of Commons. The current party leader is Jagmeet Singh. He became the leader in October 2017. ==Provincial and territorial parties== The NDP is not like other Canadian political parties. All the provincial and territorial parties are a direct part of the national/federal NDP. This means that if someone is a member of a provincial NDP party, they are automatically a member of the federal NDP. This is not the case in the Northwest Territories, Nunavut, and Quebec. This is because both the governments of the Northwest Territories and Nunavut are consensus governments. Because of this, those governments do not have political parties. The NDP are represented by their groups in charge of the ridings in those territories (both Nunavut and the Northwest Territories each have one riding). In Quebec in 1989, the provincial NDP and the federal NDP decided to separate. This is because the Quebec NDP wanted Quebec to leave Canada. In 2014, the Quebec NDP restarted but it is not related to the federal NDP. Current seat counts and leaders of provincial and territorial parties Party Seats / Total Role in legislature Last election Leader Alberta New Democratic Party 2023 Naheed Nenshi British Columbia New Democratic Party 2024 David Eby New Democratic Party of Manitoba 2023 Wab Kinew New Brunswick New Democratic Party 2024 Alex White New Democratic Party of Newfoundland and Labrador 2021 Alison Coffin Nova Scotia New Democratic Party 2024 Claudia Chender Ontario New Democratic Party 2025 Marit Stiles New Democratic Party of Quebec 2022 Raphaël Fortin New Democratic Party of Prince Edward Island 2023 Michelle Neill Saskatchewan New Democratic Party 2024 Carla Beck Yukon New Democratic Party 2021 Kate White == References == Category:1961 establishments in Canada Category:Social democratic parties Category:Political parties based in Ottawa",
 "title": "New Democratic Party"
}