{
 "id": "457817",
 "text": "The Great Recession (also called the Second Great Depression or Long Recession) was a global economic decline in the late 2000s decade. The effects of the economic problem are still obvious. A few countries, including Italy and Greece, are still in recession. The Great Recession affected world economies to different degrees. It caused more problems for some countries than others. Overall, this was the worst global recession since World War II. Southern Europe was badly affected. Some countries, including China, India, South Korea, Poland and Australia, did not have a recession during this time. Economic side-effects include household debt, low wages, high levels of unemployment and very limited chances of global growth as of 2014 in many countries. The causes of the Great Recession include a bunch of weak-points that developed in the finance system. Another cause is a series of events that began with the bursting of the United States housing bubble in 2005–2012. When housing prices fell and homeowners began to abandon their mortgages, the value of mortgage-backed securities held by investment banks went down in 2007–2008. This caused many banks to collapse or be bailed out in September 2008. This 2007–2008 phase was called the subprime mortgage crisis. The combination of banks unable to provide funds to businesses, and homeowners paying down debt rather than borrowing and spending, resulted in the Great Recession. It began in the U.S. officially in December 2007 and lasted until June 2009, lasting over 19 months. The recession was not felt the same around the world. In most of the world's big economies, particularly in North America, South America and Europe, they fell into a really bad recession. Many more recently developed economies suffered much less impact, particularly China, India and Indonesia. These economies grew a lot during this period. Similarly, Oceania didn't suffer much impact, due to it being nearby to Asian markets. ==References == Category:2000s Category:Financial crises Category:Economic history",
 "title": "Great Recession"
}