{
 "id": "457974",
 "text": "John Demjanjuk (born Ivan Mykolaiovych Demianiuk; ; 3 April 1920 – 17 March 2012) was a Ukrainian concentration camp guard , former soldier in the Soviet Red Army, and a POW during the Second World War. ==Early life== Demjanjuk was born in Ukraine. During World War II he was drafted into the Soviet Red Army, where he was captured as a German prisoner of war. ==Life in the United States== In 1952 he emigrated from West Germany to the United States, and was granted citizenship in 1958 whereupon he formally anglicized his name from \"Ivan\" to \"John\". ==Deportation== In 1986 he was deported to Israel to stand trial for war crimes, after being identified by eleven Holocaust survivors, many from Israel, as \"Ivan the Terrible\", a notorious guard at the Treblinka extermination camp in Nazi occupied Poland. Demjanjuk was accused of committing murder and acts of extraordinarily savage violence against camp prisoners during 1942–43. He was convicted of having committed crimes against humanity and sentenced to death there in 1988. The verdict was overturned by the Israeli Supreme Court in 1993, based on new evidence that \"Ivan the Terrible\" was probably another man, Ivan Marchenko.Hedges, Chris (12 August 1993). \"Israel Recommends that Demjanjuk Be Released\". The New York Times After the trial, in September 1993, he returned to his home in Ohio. In 1998 his citizenship was restored after a United States federal appeals court ruled that prosecutors had suppressed exculpatory evidence concerning his identity.Chu, Henry (18 March 2012). \"John Demjanjuk dies at 91; convicted Nazi death camp guard.\" Los Angeles Times. Retrieved 21 March 2012. ==Later charges== In 2001 Demjanjuk was charged again, this time on the grounds that he had, instead, served as a guard named Ivan Demjanjuk at the Sobibor and Majdanek camps in Nazi occupied Poland and at the Flossenbürg camp in Germany. Demjanjuk became again a stateless person in 2002 (until his death in 2012).\"John Demjanjuk's body's burial site sparks fears of Nazi shrine in Cleveland suburb\", Daily News (New York) (20 March 2012)\"Demjanjuk Lands in Munich\", Der Spiegel (5 December 2009) His deportation was again ordered in 2005, but after exhausting his appeals in 2008 he still remained in the United States, as no country would agree to accept him at that time. On 2 April 2009, it was announced that Demjanjuk would be deported to Germany, where he would stand trial, since in a bid to disassociate from the nation's past, Germany began the policy of prosecuting prisoners of war from other nations whom the German Nazis made the accessories to their crimes. On 11 May, Demjanjuk left his Cleveland home by ambulance, and was taken to the airport, where he was deported by plane, arriving in Germany the next morning.Demjanjuk en route to Germany. United Press International. 11 May 2009Kulish, Nicholas (12 May 2009) Accused Nazi Arrives in Munich. The New York Times On 13 July, he was formally charged with 27,900 counts of acting as an accessory to murder, one for each person who died at Sobibor during the time he was alleged to have served as a guard. On 30 November, Demjanjuk's trial began in Munich. ===Convictions=== On 12 May 2011, Demjanjuk was convicted pending appeal by an ordinary German criminal court as an accessory to the murder of 27,900 Jews at Sobibor and sentenced to five years in prison. The interim conviction was later annulled, because Demjanjuk died before his appeal could be heard.Aderet, Ofert. News Article. HAARETZ. Convicted Nazi criminal Demjanjuk deemed innocent in Germany over technicality. http://www.haaretz.com/print-edition/news/convicted-nazi- criminal-demjanjuk-deemed-innocent-in-germany-over-technicality-1.420280 He was later released pending trial and final verdict by the German Appellate Court. ==Death== He lived at a German nursing home in Bad Feilnbach, where he died on 17 March 2012.McFadden Robert. News Article in New York Times. 17 March 2012. John Demjanjuk, 91, Dogged by Charges of Atrocities as Nazi Camp Guard, Dies. https://www.nytimes.com/2012/03/18/world/europe/john-demjanjuk- nazi-guard-dies-at-91.html?pagewanted=all&_r=0 Despite decades of legal wrangling and controversy, Demjanjuk died a free man and legally innocent.Aderet, Ofer. Haartz Israeli News. News article 23 March 2012. Convicted Nazi criminal Demjanjuk deemed innocent in Germany over technicality. http://www.haaretz.com/print-edition/news/convicted-nazi- criminal-demjanjuk-deemed-innocent-in-germany-over-technicality-1.420280The Times of Israel. News article. Court rejects appeal for Demjanjuk citizens. 13 September 2012. http://www.timesofisrael.com/court-rejects-appeal-for- demjanjuk-citizenship/ ==References== ==Bibliography== * * * * ==Other websites== * Demjanjuk —Compilation of The Plain Dealer articles at Cleveland.com * Category:1920 births Category:2012 deaths Category:American criminals Category:Naturalized citizens of the United States Category:SS people Category:Ukrainian people",
 "title": "John Demjanjuk"
}