{
 "id": "458044",
 "text": "== 2020s == *January 24, 2025 – United States changes the name of the Gulf of Mexico to the Gulf of America. *September 30, 2022 – Russia annexes four regions from southeast Ukraine. This action is only partly recognized, and Russia did not control all the land. This land is still recognized as part of Ukraine by most countries. *September 17, 2022 – After 3 years, The Republic of Kazakhstan officially changed the name of its capital from Nur-Sultan back to Astana. *May 31, 2022 – The Republic of Turkey officially changes its name to the Republic of Türkiye. *August 15, 2021 – The Taliban overthrow the Islamic Republic of Afghanistan and replace it with the Islamic Emirate of Afghanistan. == 2010s == *February 12, 2019 – The Former Yugoslav Republic of Macedonia officially changes its name to the Republic of North Macedonia. *April 19, 2018 – The Kingdom of Swaziland changed its name to the Kingdom of Eswatini. *February 20, 2014 – Russia annexes Crimea from Ukraine Which causes the Crimea Crisis, and The Russo-Ukrainian War begins. This action is only partly recognized. *July 9, 2011 – The Republic of South Sudan becomes independent from Sudan. == 2000s == *February 17, 2008 – The Republic of Kosovo declares independence from Serbia. Its independence is only partly recognized. *June 8, 2006 – Serbia and Montenegro splits into the Republic of Serbia and the Republic of Montenegro. *February 4, 2003 – The Federal Republic of Yugoslavia votes to enact the Constitutional Charter of Serbia and Montenegro, renaming it to Serbia and Montenegro. ==20th Century== ===1990s=== *December 31, 1999 – The United States of America gives the Panama Canal Zone to Panama. *December 20, 1999 – Macau is given from Portugal to the People's Republic of China. *December 10, 1997 – Kazakhstan's government relocates its capital from Almaty to Astana. *July 1, 1997 – Hong Kong is given from the United Kingdom to the People's Republic of China. *May 21, 1997 – Zaire officially reverts its name back to the Democratic Republic of the Congo. *May 24, 1993 – Eritrea becomes independent. *January 1, 1993 – Czechoslovakia breaks up into The Czech Republic and Slovakia. *1991 – The Soviet Union breaks up. The countries of Russia, Ukraine, Belarus, Moldova, Latvia, Lithuania, Estonia, Kazakhstan, Uzbekistan, Turkmenistan, Tajikistan, Georgia, Azerbaijan, Armenia, and Kyrgyzstan are formed. *October 3, 1990 – The West Germany and the East Germany merge. They take the name the Federal Republic of Germany. ===1980s=== *June 18, 1989 – A staged coup d’état changes Socialist Republic of the Union of Burma to Republic of the Union of Myanmar. *September 21, 1981 – Belize becomes independent from the United Kingdom. ===1970s=== *December 1971 – Bangladesh (formerly East Pakistan) becomes independent from Pakistan after nine months of Bangladesh Liberation War. *December 1971 – The United Arab Emirates forms. ===1960s=== *April 26, 1964 – Tanganyika and Zanzibar merges and form The United Republic of Tanzania. *December 10, 1963 – Zanzibar gains independence from Britain. *July 5, 1962 – The Algerian State becomes independent of France. *December 9, 1961 – Tanganyika gains independence from Britain. *October 1, 1960 – The Federation of Nigeria becomes its own country. *August 15, 1960 – The Republic of the Congo becomes its own country. *August 3, 1960 – The Republic of Niger becomes its own country. ===1950s=== *January 1, 1956 – The Anglo-Egyptian Sudan becomes the Republic of the Sudan. *April 20, 1952 – Treaty of San Francisco ===1940s=== *October 7, 1949 – East Germany is founded. *September 21, 1949 – West Germany is founded. *March 31, 1949 – The Dominion of Newfoundland joins Canada. *September 9, 1948 – The Democratic People's Republic of Korea is formed in northern Korea. *August 15, 1948 – The Republic of Korea is formed in southern Korea. *May 14, 1948 – Israel claimed its independence after The 1948 Arab- Israeli War *August 15, 1947 – The Union of India becomes independent from the United Kingdom. *August 14, 1947 – The Dominion of Pakistan becomes independent from the United Kingdom. *August 17, 1945 – The Republic of Indonesia becomes independent from the Netherlands. *September 8, 1943 – The Italian Civil War has started *April 17, 1941 – Yugoslavia Ceases to exist and is divided between Axis members. *April 10, 1941 – Independent State of Croatia, is Formed as a German Puppet State. *August 30, 1940 – Second Vienna Award, Hungary annexes Northern Transylvania from Romania. *August 6, 1940 – Estonia, is annexed by the Soviet Union. *August 5, 1940 – Latvia, is annexed by the Soviet Union *August 3, 1940 – Lithuania, is annexed by the Soviet Union *March 13, 1940 – Winter War Comes to a close, the Soviet Union annexes parts of eastern Finland ===1930s=== *September 29, 1939 – Poland is divided along the Bug River between the German Reich and Union Of Soviet Socialist Republics (USSR) *September 27, 1939 – Poland Surrenders to the German Reich *September 1, 1939 – World War II Begins with the German Reich Invading Poland *March 22, 1939 – German Reich annexes Memel from Lithuania. *March 16, 1939 – Protectorate of Bohemia and Moravia Becomes a Partially annexed territory of the German Reich. *March 14, 1939 – Slovak State Becomes a German Puppet State. *March 1, 1939 – Poland annexes Zaolzie from Czechoslovakia. *November 2, 1938 – Hungary annexes parts of southern Slovakia. *September 30, 1938 – Munich Agreement, German Reich annexes the German speaking parts of Czechoslovakia. *March 12, 1938 – Anschluss, German Reich annexes Austria through a referendum. *May 9, 1936 – Italy annexes Ethiopia and Establishes Italian East Africa. ===1920s=== *The end of the Ottoman Empire: **Occupation of Constantinople after WWI (13 November 1918 – 23 September 1923). **Sultanate abolished (ended) on 1 November 1922, and the last Sultan, Mehmed VI (reigned 1918–22), left the country on 17 November 1922. **Republic of Turkey founded on 29 October 1923. The Caliphate was abolished on 3 March 1924.Hakan Ozoglu 2011. From Caliphate to secular state: power struggle in the early Turkish Republic. ABC-CLIO, p8. *December 6, 1921 – The Irish Free State becomes independent from the United Kingdom. ===1910s=== *December 1, 1918 – Kingdom of Romania merges with all the principalities (Țara Românească , Moldova and Transilvania) after the Treaty of Trianon and the collapse of the Russian Empire. *November 11, 1918 – The German Empire is dissolved and the Treaty of Versailles is signed which gives land to France, Belgium, Denmark and Poland. German colonies are split between France, Belgium and the United Kingdom. *October 14, 1918 – Austria-Hungary is dissolved into Austria, Hungary, Czechoslovakia, and Yugoslavia. *January 2, 1918 – Finland becomes independent from the Soviet Russia. *June 28, 1914 – The assassination of Archduke Franz Ferdinand of Austria and his wife Sophie causes a crisis that turned into WWI. *May 30, 1913 – Treaty of London is signed and the last of the Ottoman Empire in the Balkans is conquered by the combined forces of the Balkan League *September 29 1911 – The start of Italo-Turkish War *August 22, 1910 – Japan takes over Korea. ===1900s=== *October 6, 1908 – Bosnia is annexed by Austria-Hungary. *August 5, 1908 – Bulgaria splits off from the Ottoman Empire. ==19th Century== === 1880s === * 15 November 1884 – Berlin Conference ===1870s=== *January 18, 1871 – The German Empire is formed as one nation from a multitude of smaller German States. ===1860s=== *October 18, 1867 – The United States of America buys Alaska from the Russian Empire. *March 15, 1867 – Austro-Hungarian Compromise. Austrian empire becomes Austro- Hungary. *March 17, 1861 – The Kingdom of Sardinia-Piedmont becomes the Kingdom of Italy. ===1850s=== *1854 – United States of America buys territory from Mexico, extending the New Mexico Territory southward: Gadsden Purchase ===1840s=== *February 2, 1848 – After the Second MexicanAmerican War (April 25, 1846 – February 2, 1848) much of north-western Mexico becomes part of the United States. ===1830s=== *March 2, 1836 – The Republic of Texas declares independence from Mexico. ===1820s=== *September 7, 1822 – The Empire of Brazil declares independence from the United Kingdom of Portugal, Brazil, and the Algarves. *September 7, 1821 – The First Mexican Empire is formed. ===1810s=== * July 9, 1816 – Argentina gains independence from Spain * July 9, 1810 – France annexes (adds to its territory) Holland. ===1800s=== *August 6, 1806 – The Holy Roman Empire is dissolved. *January 1, 1804 – Haiti becomes independent from France. *1803 – The United States buys the Louisiana Territory from France. *1802 – The Nguyễn dynasty is found. ==18th Century== *July 4, 1776 – The United States of America declares independence from the United Kingdom. ==17th Century== === 1600-1699 === * 1607 – The Colony of Virginia is founded. * 1603 – Tokugawa Iesayu establishes the Tokugawa Shogunate in Japan. == 16th Century == === 1500-1599 === * 1527 – Fall of the Majapahit * 1507 – The Kingdom of Portugal conquers Muscat. * 1502 – The Golden Horde is disestablished. * 1501 – The Uzbek Khanate is disestablished. == 15th Century == * 1499 – The Safavid Empire starts conquering Persia. * 1492 – The Spanish colonization of the Americas. * May 29th, 1453 – The Byzantine Empire falls to the Ottomans. ==References== Category:Geography- related lists",
 "title": "Timeline of world map changes"
}