{
 "id": "458052",
 "text": "Kelly Preston (born Kelly Kamalelehua Smith; October 13, 1962 - July 12, 2020) was an American actress and former model. She was known for her roles in Mischief, Twins and Jerry Maguire. She married John Travolta in 1991. Preston died of breast cancer on July 12, 2020 at her home in Clearwater, Florida, at aged 57.Kelly Preston, Actress in ‘Mischief,’ ‘Jerry Maguire,’ Dies at 57 Variety ==Filmography== Year Title Role Notes 1983 10 to Midnight Doreen 1983 Metalstorm: The Destruction of Jared-Syn Dhyana 1983 Christine Roseanne 1985 Mischief Marilyn McCauley 1985 Secret Admirer Deborah Anne Fimple 1986 SpaceCamp Tish Ambrosé 1986 52 Pick-Up Cini 1987 Love at Stake Sara Lee 1987 Shirley Butts 1987 Amazon Women on the Moon Violet Segment: \"Titan Man\" 1988 Spellbinder Miranda Reed 1988 Twins Marnie Mason 1989 Bonnie 1991 Run Karen Landers 1992 Only You Amanda Hughes 1994 Double Cross Vera Blanchard Video 1994 Love Is a Gun Jean Starr 1994 Cheyenne Warrior Rebecca Carver 1995 Mrs. Munck Young Rose 1995 Waiting to Exhale Kathleen Uncredited cameo 1996 Citizen Ruth Rachel 1996 From Dusk till Dawn Newscaster Kelly Houge 1996 Curdled Kelly Hogue 1996 Jerry Maguire Avery Bishop 1997 Addicted to Love Linda 1997 Nothing to Lose Ann Beam 1998 Holy Man Kate Newell 1998 Jack Frost Gabby Frost 1999 For Love of the Game Jane Aubrey 2000 Battlefield Earth Chirk 2001 Daddy and Them Rose 2003 View from the Top Sherry 2003 What a Girl Wants Libby Reynolds 2003 Joan Walden 2004 Eulogy Lucy Collins 2004 Return to Sender Susan Kennan 2005 Sky High Josie Stronghold / Jetstream 2006 Broken Bridges Angela Delton 2007 Death Sentence Helen Hume 2008 Struck Trista Short film 2009 Old Dogs Vicki 2010 Kim 2010 Casino Jack Pam Abramoff 2018 Gotti Victoria Gotti ==References== ==Other websites== * * * Category:1962 births Category:2020 deaths Category:Deaths from breast cancer Category:Actors from Honolulu Category:Models from Hawaii Category:American movie actors Category:American television actors Category:American voice actors Category:Scientologists",
 "title": "Kelly Preston"
}