{
 "id": "458066",
 "text": "Super Mario Bros. is a 1993 American science fiction fantasy movie. It was produced by Jake Eberts and Roland Joffé. The movie was directed by Rocky Morton and Annabel Jankel. Super Mario Bros. was released on May 28, 1993. The movie is a loose live-action version of the 1985 Nintendo video game of the same name. The movie stars Bob Hoskins as Mario, John Leguizamo as Luigi, Dennis Hopper as King Koopa, and Samantha Mathis as Princess Daisy. The movie was received with mainly negative reviews from critics and holds a 24% rating on Rotten Tomatoes. Both Gene Siskel and Roger Ebert gave the movie two thumbs down on their television program Siskel & Ebert At the Movies. They also put the movie on their list for one of the worst films of 1993. It only made $20,915,465 of its $48 million budget. == Plot == 65 million years ago, a meteorite crashed onto Earth. Instead of killing all of the dinosaurs, it created a parallel dimension where dinosaurs survived and evolved into human- like beings. 20 years ago, a mother from this dimension sneaks into Brooklyn, and leaves an unborn egg on the porch of a church, leaving a piece of the meteorite with it. While the egg hatches, the mother encounters King Koopa when trying to return through a cave. She pushes a support beam over him, collapsing the cave and killing her. In 1993, Mario Mario and Luigi Mario, two brothers who operate a small plumbing business known as Mario Bros. Plumbing, receive a call from a customer and drive to the location. They are beaten to it by their competitors Scapelli Construction. When Luigi rings a telephone to look for other jobs, he hands the phone to Daisy, the boss of a fossil- excavation project. She thanks him, to which Luigi and Mario offer her to take her back to the site in their van. Luigi to ask Daisy out on a date. After a double date between Daisy, Luigi, Mario, and the latter's girlfriend Daniella, Daisy shows Luigi the site that her team is working at. They are interrupted by two Scapelli employees bursting a pipe and purposefully causing a flood. They get Mario, and the brothers manage to fix the leak. However, Koopa's cousins, Iggy and Spike, who've kidnapped several girls in Brooklyn in search of Daisy, knock out the Mario brothers and kidnap Daisy. After waking up, Mario and Luigi follow the kidnappers through a portal to Dinohatten, a chaotic city in the dinosaur dimension ruled by Koopa. Iggy and Spike tell Koopa and his second-in-command Lena that they've successfully found Daisy but lost the meteorite piece she wears as a necklace to \"the plumbers\". Koopa, needing the rock to combine both of the dimensions and take over the world, offers a reward for anyone who finds them. A large woman in red clothing named Big Bertha steals the rock from Luigi and escapes. Toad sings an \"anti-Koopa\" song to cheer the two up, but is arrested along with the plumbers. At prison, Toad is de-evolved into a Goomba. Mario and Luigi shove Koopa into the de- evolution chamber and escape prison. During their escape, Luigi finds a Bob- omb attached to some fungus. They steal a police car and drive into the desert outside the city. Meanwhile, Koopa evolves Iggy and Spike's intelligence and sends the two to hunt down the plumbers. The cousins find the plumbers, who easily overpower the Koopa cousins and demand to know where Daisy is and what the rock is. They team up to get the rock back from Big Bertha and rescue Daisy. They find Bertha at a dance club; Mario dances with her to sneakily steal the rock back. Lena and the Goombas arrive at the dance club to find the rock. She finds it and arrests Iggy and Spike while Mario and Luigi sneak away with the help of Bertha, who gives the two Stomper boots. The plumbers sneak into the boiler room of Koopa's tower and sabotage the heating. They trip the alarm, but steal two pairs of overalls, one red and one green, to use as disguises. They progress through the tower to find Daisy. Meanwhile, Iggy and Spike introduce Daisy to her father, who has been turned into fungus; he was Koopa's first de-evolution victim. As Iggy and Spike retreat, Daisy finds Mario and Luigi on a security camera. The three reunite, and Daisy tells Mario where Daniella and the other kidnapped Brooklyn girls are. While Daisy and Luigi attempt to escape, Mario goes to rescue the Brooklyn girls. He takes out a Goomba guard, and all of them ride a mattress through a frozen tunnel to escape. The plumbers and Daisy reunite, but Koopa aims a de-evolution gun at them with the rock in hand. Mario fires a Stomper boot at Koopa, knocking the rock out of his hand. Lena steals it and, having been ignored by Koopa previously, betrays Koopa to insert the piece into the meteorite, which will combine the two dimensions. Daisy and Luigi go to stop Lena and return the Brooklyn girls home, while Mario confronts Koopa. Face to face on a bridge, Mario activates the Bob-omb that Luigi found earlier and sends it towards Koopa. It falls through a hole before the two dimensions begin merging. Mario dodges a shot from the de-evolution gun, which turns Scapelli into a monkey. Daisy removes the meteorite piece, and the dimensions return to normal. Mario and Luigi fire two de-evolution guns at Koopa, slowly de-evolving him. The Bob-omb goes off directly underneath Koopa, launching him into a barrel where he transforms into a Tyrannosaurs. The Mario brothers continue firing at Koopa until he turns into sludge. Mario and Luigi are hailed by the citizens of Dinohatten as heroes. The plumbers return home, but Daisy stays behind to help rebuild her home, sharing a kiss with Luigi before he and Mario leave. Months later, Daisy visits Mario, Luigi, and Daniella to ask the brothers for help. Meanwhile, Iggy and Spike move into Brooklyn, and are approached by two Japanese video game designers who pitch a game about the two's adventures. == Cast == * Bob Hoskins as Mario Mario * John Leguizamo as Luigi Mario * Dennis Hopper as King Koopa * Samantha Mathis as Princess Daisy * Fisher Stevens as Iggy * Richard Edson as Spike * Fiona Shaw as Lena * Mojo Nixon as Toad * Dana Kaminski as Daniella * Francesca Roberts as Big Bertha * Gianni Russo as Anthony Scapelli * Don Lake as Sgt. Simon * Lance Henriksen as The King * Frank Welker as Yoshi, Goombas, and other creature voices * Dan Castellaneta as the narrator ==References== == Other websites == * Category:1990s American adventure movies Category:1993 comedy movies Category:1993 fantasy movies Category:1990s American drama movies Category:1990s English-language movies Category:Dystopian movies Category:Movies about dinosaurs Category:Movies based on video games Category:Movies composed by Alan Silvestri Category:Movies set in New York City Category:Movies set in the 20th century",
 "title": "Super Mario Bros. (movie)"
}