{
 "id": "458257",
 "text": "\"Unconditionally\" is a song by American pop singer-songwriter Katy Perry. It was the second single from her fourth studio album, Prism, and it appears as the fifth track from that album. The song is a pop rock and power pop song. It is about a woman not wanting anything more from her lover than he already gives. She will love him no matter what. == Music video == It begins with Perry, sitting on the ground while mouthing the lyrics of the song and staring at the viewer. As she finishes the first verse, the camera shifts to a ballroom, in which elegantly-dressed dancers start to dance. The song's chorus kicks in, and Perry is now found in the ballroom, in the middle of all the dancers. As the second verse begins, she has an owl on her arm, which she lets go and flies. The bird represents \"something strong, free [and] powerful\", according to Bonacorso, who added: \"She lets it go into the world[,] and that literally [means] letting this force within her go wild. That's an important part of love[,] is that you have to let it go.\" The video also shows Perry, with a golden dress and cross-shaped earrings, with flames on her body. By the second repetition of the chorus, a bed gets lit on fire, which the director included to refer to love that \"can burn you like an inferno\". As the song reaches its climax, Perry gets hit by a car, with tiny broken debris from it shattering behind her, while she remains stationary and unharmed. This scene symbolizes the experience of true love, that changes \"your world\" and \"hits you out of the blue\". This scene cuts back to the ballroom, where Perry is surrounded by a similar explosion of \"colorful\" flowers, which is used to contrast the more violent nature of falling in love and the softer part of it, the \"joyful and wonderful\" feelings. ==Credits and personnel== *Vocals: Katy Perry *Songwriting: Katy Perry, Lukasz Gottwald, Max Martin, Henry Walter *Production: Dr. Luke, Max Martin, Cirkut Credits adapted from Prism album liner notes. ==Track listing== *CD #\"Unconditionally\" – 3:48 #\"Unconditionally\" (instrumental) – 3:48 ==References== Category:2013 songs Category:Katy Perry songs == Other websites == * *",
 "title": "Unconditionally"
}