{
 "id": "458262",
 "text": "The Summit League is a NCAA conference that plays in NCAA Division I. The member universities and colleges are in the Midwestern United States, plus one member in Colorado. Their headquarters are in Sioux Falls, South Dakota, having moved from the Chicago suburb of Elmhurst, Illinois in 2018. The league once sponsored football, but dropped the sport after the 1984 season. Five Summit League members have football teams; four play in the Missouri Valley Football Conference and one in the Pioneer Football League. ==History== The Summit League was founded in 1982 as the Association of Mid-Continent Universities (AMCU or AMCU-8) with eight members. The only one of these schools that is still a member is Western Illinois. In 1989, the AMCU changed its name to the Mid-Continent Conference, or MCC (those initials, however, were also being used by the Midwestern Collegiate Conference, now the Horizon League). The Mid-Continent saw many changes in the first part of the 1990s, with the biggest coming in 1992 and 1994. In 1992, the conference added women's sports after it absorbed the North Star Conference, a league that only sponsored women's sports. Then in 1994, six schools (including three charter members) left for the Midwestern Collegiate Conference. They were replaced by six other schools, five of them coming from the collapsed East Coast Conference. None of the schools that joined in 1994 are now in the league. Since the 1994 changes, the conference has had anywhere from 8 to 10 members. It changed its name to The Summit League in 2007. ==Members== The Summit League now has nine full members. The most recent change in membership took place in 2023, when the conference's last remaining charter member, Western Illinois University, left for the Ohio Valley Conference. Another recent change took place in 2021, when the University of St. Thomas, located in the Minneapolis–Saint Paul area, joined the conference to start an unprecedented move from NCAA Division III directly to Division I. School Location Founded Type Nickname Joined Denver, Colorado 1864 Private Pioneers 2013 (Kansas City) Kansas City, Missouri 1933 Public Roos 1994, 2020 Grand Forks, North Dakota 1890 Public Fighting Hawks 2018 North Dakota State University Fargo, North Dakota 1890 Public Bison 2007 (Omaha) Omaha, Nebraska 1908 Public Mavericks 2012 Oral Roberts University Tulsa, Oklahoma 1963 Private Golden Eagles 1997, 2014 Saint Paul, Minnesota 1885 Private Tommies 2021 Vermillion, South Dakota 1862 Public Coyotes 2011 South Dakota State University Brookings, South Dakota 1881 Public Jackrabbits 2007 ===Associate members=== The Summit League has seven \"associate\" members—schools that play in a few sports, usually but not always one. Three of these schools play three sports in the conference, and three more house one sport in the conference. (Note that the NCAA counts men's and women's teams in the same sport as playing two different sports, and also considers swimming and diving to be a single sport.) Western Illinois left the Summit League in 2023, but kept its men's soccer team in that conference for the fall 2023 season. That team will join the rest of the university's sports in the Ohio Valley Conference in 2024. School Location Founded Type Nickname Summit League sports Joined Main conference Drake University Des Moines, Iowa 1881 Private Bulldogs Men's tennis 2017 Missouri Valley Eastern Illinois University Charleston, Illinois 1895 Public Panthers Men's swimming and diving Women's swimming and diving 2005 Ohio Valley Illinois State University Normal, Illinois 1857 Public Redbirds Men's tennis 2017 Missouri Valley Lindenwood University 1827 Private Lions Men's swimming and diving Women's swimming and diving 2022 Ohio Valley Greeley, Colorado 1889 Public Bears Baseball 2021 Big Sky Evansville, Indiana 1965 Public Screaming Eagles Men's swimming and diving Women's swimming and diving 2022 Ohio Valley Western Illinois University Macomb, Illinois 1899 Public Leathernecks Men's soccer 2023 Ohio Valley ===Former members=== No fewer than 23 schools have been full members, but are no longer in the league. ==References== * Category:NCAA Division I athletics conferences Category:1982 establishments in the United States",
 "title": "The Summit League"
}