{
 "id": "458270",
 "text": "A tertiary source (also called thirdhandJohn Van Rys; Verne Meyer; Patrick Sebranek, The Research Writer (Boston, MA: Wadsworth, 2012), p. 36) is an index or a summary of primary and secondary sources. In research, tertiary sources are used as a guide to help find primary and secondary sources of information.Gurdev Singh, Information Sources, Services And Systems (Delhi: PHI Learning Private Limited, 2013), p. 19 Tertiary sources are very useful to find search terms for online literary searches.Keith Howard; John Peters; John Sharp, The Management of a Student Research Project, Third Edition (Aldershot: Gower Publishing, 2010), p. 81 While tertiary sources are easy to find they are usually not considered useful for college-level research projects. == Examples == Some examples of tertiary sources are encyclopedias, dictionaries, newspapers and Magazines.Kate L. Turabian, A Manual for Writers of Research Papers, Theses, and Dissertations, Eighth Edition (Chicago: University of Chicago Press, 2013), p. 27 Encyclopedias are useful to gain a general overview of a subject. At best they are a starting point in doing research.Jane Hosie-Bounar; Barbara Waxer, Web 2.0: Making the Web Work for You, Illustrated (Boston, MA: Course Technology, 2011), p. A-4 They are useful to gain an immediate understanding of otherwise unfamiliar subjects.Handbook of Black Studies, eds. Molefi Kete Asante; Maulana Karenga (Thousand Oaks, CA: Sage Publications, 2006), p. 99 Encyclopedias, however, are not usually a reliable source for the details of a subject. As your research progresses they should be replaced with secondary or primary sources. Newspapers and magazines should be used with some caution. Some are reliable but many tend to misrepresent or oversimplify research reported in secondary sources. == Secondary or tertiary? == The distinction between sources can be relative to a specific field of study.Scott C. Bauer; S. David Brazer, Using Research to Lead School Improvement: Turning Evidence Into Action (Thousand Oaks, CA: SAGE, 2012), p. 179 In some academic disciplines the distinction between a secondary and tertiary source can sometimes be confusing. Almanacs, fact books and handbooks can at times be considered tertiary while at other times secondary sources. Some manuals and textbooks would be considered tertiary sources while others would be secondary sources. Many of these sources have to be evaluated or vetted to determine which they are. Another view taken by the Purdue University guide (Writing a research paper, 2010) refers to the \"distance\" a source is from the original research. A primary source is the research; the raw data. A secondary source reports on primary sources and includes interpretation (or explanations), analysis and commentary. A tertiary source is the furthest from the original research. In most cases their purpose is to provide a general introduction to a topic. In many scholarly fields, tertiary sources are not used for research.Wendy Oliver, Writing About Dance (Champaign, IL: Human Kinetics, 2010), p. 137Randall VanderMey; et al, The College Writer Brief: A Guide to Thinking, Writing, and Researching (Belmont, CA; Singapore: Wadsworth Cengage Learning, 2012), p. 442 == Related pages == * Primary source * Secondary source * Research * Source text == References == Category:Research methods",
 "title": "Tertiary source"
}