{
 "id": "458205",
 "text": "November to Remember (usually abbreviated to N2R) was a professional wrestling event that was produced by Eastern Championship Wrestling and Extreme Championship Wrestling (ECW). ECW began making it a pay-per-view starting in 1997. It ran from 1993 to 2000. ==Results== ===Eastern Championship Wrestling=== ====1993==== November to Remember 1993 took place on November 13, 1993 at the ECW Arena in Philadelphia, Pennsylvania. It was the only November to Remember event that was produced by Eastern Championship Wrestling. # Matches Stipulations Times 1 Salvatore Bellomo defeated Rockin' Rebel by forfeit. Chair match N/A 2 The Sandman fought Jim Neidhart to a no-contest. Singles match N/A 3 The Public Enemy (Rocco Rock and Johnny Grunge) defeated Badd Company (Pat Tanaka and Paul Diamond) South Philly Hood Tag team match N/A 4 Kevin Sullivan defeated Tommy Cairo Shoot match 2:15 5 Malia Hosaka defeated Sherri Martel by disqualification. Singles match 6:00 6 The Suicide Blondes (Johnny Hotbody and Tony Stetson) (c) defeated The Bad Breed (Ian Rotten and Axl Rotten) Tag Team match for the ECW World Tag Team Championship 6:11 7 Johnny Gunn and Tommy Dreamer defeated The Suicide Blondes (Johnny Hotbody and Tony Stetson) (c) Tag Team match for the ECW World Tag Team Championship 0:09 8 The Tazmaniac defeated Tommy Dreamer Singles match 7:00 9 Mr. Hughes defeated Johnny Gunn Singles match 9:40 10 Sabu and Road Warrior Hawk defeated Terry Funk (c) and King Kong Bundy Tag Team match for the ECW World Television Championship 12:00 (c) – refers to the champion(s) heading into the match ===Extreme Championship Wrestling=== ====1994==== November to Remember 1994 took place on November 5, 1994 at the ECW Arena in Philadelphia, Pennsylvania. It was the first November to Remember event that was produced under the Extreme Championship Wrestling name. # Matches Stipulations Times 1 J.T. Smith defeated Hack Meyers Singles match 4:02 2 The Pitbulls (Pitbull #1 and Pitbull #2) defeated The Bad Breed (Axl Rotten and Ian Rotten) Tag team match 3:11 3 2 Cold Scorpio defeated Mr. Hughes Singles match 7:09 4 Tommy Dreamer defeated Tommy Cairo Singles match 7:09 5 Dean Malenko defeated The Tazmaniac Singles match 5:13 6 The Public Enemy (Rocco Rock and Johnny Grunge) defeated Cactus Jack and Mikey Whipwreck (c) Tag Team match for the ECW World Tag Team Championship 12:34 7 Chris Benoit fought Sabu to a no-contest.* Singles match 2:00 8 Chris Benoit fought 2 Cold Scorpio to a double count-out. Singles match 12:00 9 Shane Douglas (c) defeated Ron Simmons Singles match for the ECW World Heavyweight Championship 6:43 (c) – refers to the champion(s) heading into the match * Note: The match was stopped after Sabu broke his neck during an attempted back bodydrop. ===1995=== November to Remember 1995 took place on November 18, 1995 at the ECW Arena in Philadelphia, Pennsylvania. It was the second November to Remember event that ECW produced. # Matches Stipulations Times 1 Don E. Allen fought Broad Street Bully to a no-contest Singles match 1:16 2 Konnan defeated Jason Knight Singles match with Taz as special guest referee 0:15 3 Stevie Richards (with The Blue Meanie) defeated El Puerto Riqueño Singles match 3:00 4 The Pitbulls (Pitbull #1 and Pitbull #2) (with Francine) defeated The Eliminators (John Kronus and Perry Saturn) (with Jason Knight) Tag team match 11:00 5 Rey Misterio, Jr. defeated Psicosis Mexican Death match 14:47 6 The Sandman and 2 Cold Scorpio (c) defeated The Public Enemy (Rocco Rock and Johnny Grunge) Tag Team for the ECW World Tag Team Championship 16:03 7 Bill Alfonso defeated Tod Gordon Singles match with Taz as Special Guest Referee 6:37 8 Mikey Whipwreck (c) defeated Steve Austin Singles match for the ECW Championship 4:38 9 Sabu defeated Hack Meyers Singles match 12:55 10 Terry Funk and Tommy Dreamer defeated Raven and Cactus Jack Tag Team match 13:36 (c) – refers to the champion(s) heading into the match ===1996=== November to Remember 1996 took place on November 16, 1996 at the ECW Arena in Philadelphia, Pennsylvania. It was the third November to Remember event that ECW produced. # Matches Stipulations Times 1 Stevie Richards defeated David Tyler Morton Jericho Singles match 9:25 2 Axl Rotten defeated Hack Meyers Singles match 4:25 3 Buh Buh Ray Dudley defeated D-Von Dudley Singles match 10:20 4 The Eliminators (John Kronus and Perry Saturn) fought Sabu and Rob Van Dam to a time limit draw. Tag team match to determine the #1 contender for the ECW World Tag Team Championship 27:00 5 Chris Candido defeated Mikey Whipwreck Singles match 11:54 6 The Gangstas (New Jack and Mustafa Saed) (c) defeated The Eliminators (John Kronus and Perry Saturn) and Sabu and Rob Van Dam Three-Way Dance Tag match for the ECW World Tag Team Championship 8:54 7 2 Cold Scorpio defeated J.T. Smith Loser Leaves Town match 0:32 8 2 Cold Scorpio defeated Devon Storm Loser Leaves Town match 1:00 9 2 Cold Scorpio defeated Hack Meyers Loser Leaves Town match 1:15 10 Louie Spicolli defeated 2 Cold Scorpio Loser Leaves Town match 2:14 11 The Sandman (c) defeated Raven Singles match for the ECW World Heavyweight Championship 15:07 12 Terry Funk and Tommy Dreamer defeated Shane Douglas and Brian Lee Tag Team match 26:12 (c) – refers to the champion(s) heading into the match ===1997=== November to Remember 1997 took place on November 30, 1997 at the Golden Dome in Monaca, Pennsylvania. It was the fourth November to Remember event that ECW produced. It was the first November to Remember event to be shown on pay-per-view. # Matches Stipulations Times 1 Chris Candido and Lance Storm defeated Tommy Rogers and Jerry Lynn Tag team match 16:42 2 Mikey Whipwreck defeated Justin Credible (with Jason) Singles match 7:15 3 Taz (c) defeated Pitbull #2 (with Pitbull #1, Brakkus, and Lance Wright) Singles match for the ECW World Television Championship 1:29 4 The F.B.I. (Tracy Smothers and Little Guido) (c) (with Tommy Rich) defeated The Dudley Boyz (Buh Buh Ray and D-Von) (with Big Dick Dudley, Sign Guy Dudley, and Joel Gertner), The Hardcore Chair Swingin' Freaks (Balls Mahoney and Axl Rotten) and The Gangstanators (New Jack and John Kronus) Four-Way Dance match for the ECW World Tag Team Championship 14:32 5 Rob Van Dam (with Bill Alfonso) fought Tommy Dreamer (with Beulah McGillicutty) to a no-contest Flag match 16:02 6 Sabu (with Bill Alfonso) defeated The Sandman Tables & Ladders match 20:55 7 Shane Douglas (with Francine) defeated Bam Bam Bigelow (c) Singles match for the ECW World Heavyweight Championship 25:02 (c) – refers to the champion(s) heading into the match ===1998=== November to Remember 1998 took place on November 1, 1998 at the Lakefront Arena in New Orleans, Louisiana. It was the fifth November to Remember event that ECW produced. # Matches Stipulations Times 1 The bWo (The Blue Meanie and Super Nova) defeated Danny Doring and Amish Roadkill Tag team match 10:54 2 Tommy Rogers (with Chris Chetti) defeated Tracy Smothers (with Tommy Rich, Little Guido, and Ulf Herman) Singles match 7:51 3 Lance Storm (with Tammy Lynn Bytch) defeated Jerry Lynn (with Tammy Lynn Sytch) Singles match with Mikey Whipwreck as special guest referee 16:48 4 Masato Tanaka and Balls Mahoney (with Axl Rotten) defeated The Dudley Boyz (Buh Buh Ray and D-Von) (c) (with Joel Gertner, Big Dick Dudley, and Sign Guy Dudley) Tag team match for the ECW World Tag Team Championship 15:01 5 Jake Roberts and Tommy Dreamer defeated Justin Credible and Jack Victory (with Nicole Bass, Jason, Chastity & Lance Wright) Tag Team match 12:26 6 Sabu, Rob Van Dam and Taz (with Bill Alfonso) defeated The Triple Threat (Shane Douglas, Bam Bam Bigelow and Chris Candido) (with Francine) Six- Man Tag Team match 12:57 (c) – refers to the champion(s) heading into the match ===1999=== November to Remember 1999 took place on November 7, 1999 at the Burt Flickinger Center in Buffalo, New York. It was the sixth November to Remember event that ECW produced. # Matches Stipulations Times 1 Spike Dudley defeated Simon Diamond (with Dick Hertz) Singles match 2:59 2 Little Guido (with Sal E. Graziano) defeated Nova Singles match 4:20 3 Jerry Lynn defeated Yoshihiro Tajiri (with Steve Corino and Jack Victory) and Super Crazy Three- Way Dance match 10:59 4 Da Baldies (Spanish Angel, Tony DeVito, Vito LoGrasso, and P.N. News) defeated New Jack and The Hardcore Chair Swingin' Freaks (Axl Rotten and Balls Mahoney) Handicap match 8:21 5 Sabu (with Bill Alfonso) defeated Chris Candido (with Tammy Lynn Sytch) Singles match 17:42 6 Mike Awesome (c) (with Judge Jeff Jones) defeated Masato Tanaka Singles match for the ECW World Heavyweight Championship 12:26 7 Rob Van Dam (c) (with Bill Alfonso) defeated Taz Singles match for the ECW World Television Championship 14:34 8 Rhino and The Impact Players (Justin Credible and Lance Storm) (with Jason Knight and Dawn Marie) defeated Raven, Tommy Dreamer, and The Sandman (with Francine) Six-Man Tag Team match 9:19 (c) – refers to the champion(s) heading into the match ===2000=== November to Remember 2000 took place on November 5, 2000 at the Odeum Expo Center in Villa Park, Illinois. It was the seventh and final November to Remember event that ECW produced. # Matches Stipulations Times 1 Simon Diamond and Johnny Swinger defeated Christian York and Joey Matthews Tag team match 5:20 2 Kid Kash defeated C.W. Anderson Singles match 10:45 3 Amish Roadkill, Danny Doring, and Spike Dudley defeated Hot Commodity (Chris Hamrick, Julio Dinero, and E.Z. Money) (with Elektra) Six-Man Tag Team match 8:23 4 Nova defeated Chris Chetti (with Lou E. Dangerously) Loser Leaves Town match 9:43 5 Balls Mahoney and Chilly Willy defeated Da Baldies (Angel and Tony DeVito) Flaming Tables match 12:11 6 Rhino (c) defeated New Jack Singles match for the ECW World Television Championship 7:55 7 The F.B.I. (Little Guido and Tony Mamaluke) (c) (with Sal E. Graziano) defeated The Unholy Alliance (Yoshihiro Tajiri and Mikey Whipwreck) Tag Team match for the ECW World Tag Team Championship 15:46 8 Steve Corino (with Jack Victory and Dawn Marie) defeated Justin Credible (with Francine), Jerry Lynn (c) and The Sandman Double Jeopardy match for the ECW World Heavyweight Championship 24:07 (c) – refers to the champion(s) heading into the match ==Related pages== *Extreme Championship Wrestling == References == Category:Extreme Championship Wrestling Category:November events",
 "title": "November to Remember"
}