{
 "id": "458373",
 "text": "Warner Bros. Home Entertainment (formerly Warner Home Video and WCI Home Video) is the home video arm of Warner Bros. (also known as WB). The logo could only be seen on covers of their Big Idea releases, except The Wonderful Wizard of Ha's. Shortly after HiT Entertainment purchased Lyrick Studios, Big Idea turned to WHV to distribute their videos. This resulted in HiT filing a lawsuit against them, which was one of the main reasons for Big Idea going bankrupt. They distributed several Big Idea releases and reprints from July 2002 to June 2004. When Classic Media purchased Big Idea in late 2003, the distribution rights were given to Sony Wonder (although WHV still distributed their videos until June 2004.) == List of releases and reprints == === VeggieTales === * Where's God When I'm S-Scared? (2002 reprint/2004 Classics reprint) * God Wants Me to Forgive _Them_!?! (2004 Classics reprint) * Rack, Shack & Benny (2002 reprint/2003 Classics reprint) * Dave and the Giant Pickle (2002 reprint/2004 Classics reprint) * The Toy That Saved Christmas (2002/2003 Classics reprints) * Very Silly Songs! (2002 reprint/2004 reprint) * Larry- Boy! & the Fib from Outer Space! (2002 reprint/2004 Classics reprint) * Josh and the Big Wall! (2002 reprint/2003 Classics reprint/2004 reprint) * Madame Blueberry (2002 reprint/2003 Classics reprint) * The End of Silliness? (2002 reprint) * Larry-Boy and the Rumor Weed (2004 Classics reprint) * King George and the Ducky (2002 reprint/2003 Classics reprint) * Esther...The Girl Who Became Queen (2002 reprint/2003 Classics reprint) * Lyle the Kindly Viking (2002 reprint/2003/2004 Classics reprint) * The Ultimate Silly Song Countdown (2002/2003/2004 Classics reprints) * Jonah Sing-Along Songs and More! * The Star of Christmas * The Wonderful World of Auto-Tainment! * The Ballad of Little Joe * An Easter Carol * A Snoodle's Tale * A Bug's Life * The Wonderful Wizard of Ha's === 3-2-1 Penguins! === * Trouble on Planet Wait-Your-Turn (2002 reprint) * The Cheating Scales of Bullamanka (2002 reprint) * The Amazing Carnival of Complaining (2003 reprint) * Runaway Pride at Lightstation Kilowatt (2003 reprint) * The Doom Funnel Rescue! (2003 reprint) * Moon Menace on Planet Tell-a-Lie! === LarryBoy: The Cartoon Adventures === * LarryBoy and the Angry Eyebrows (2002 reprint) * Leggo My Ego! * The Yodelnapper! * The Good, the Bad, and the Eggly === Compilations === * Holiday Double Feature * Lions, Shepherds and Queens (Oh My!) (2003 reprint; DVD only) * Stand Up, Stand Tall, Stand Strong! (2003 reprint; DVD only) * The Cucumber Collection * VeggieTales Collection 1 - 3 DVDs * VeggieTales Collection 2 - 3 DVDs * The Bumblyburg Superhero Value Pack! == Fun Facts == === Trivia === * The 2002 reprints of Rack, Shack & Benny and The Toy That Saved Christmas were released on the same day as The Star of Christmas. * The 2003 reprints of Madame Blueberry and King George and the Ducky were released on the same day as The Wonderful World of Auto-Tainment!. * The 2003 reprint of Esther...The Girl Who Became Queen was released on the same day as The Ballad of Little Joe. * The 2003 reprint of The Doom Funnel Rescue! was released on the same day as Moon Menace on Planet Tell-a-Lie! * The 2004 reprints of Where's God When I'm S-Scared?, Dave and the Giant Pickle, Lyle the Kindly Viking, and The Ultimate Silly Song Countdown were released on the same day as An Easter Carol. * The 2004 reprints of God Wants Me to Forgive _Them_!?!, Larry-Boy! & the Fib from Outer Space! and Larry-Boy and the Rumor Weed were released on the same day as A Snoodle's Tale and the Sumo of the Opera Sampler. * The 2004 reprints of Very Silly Songs! and Josh and the Big Wall! were released on the same day as A Bug's Life. * The Wonderful Wizard of Ha's is the only release by Warner Home Video to use the on-screen Warner Home Video logo. * A Snoodle’s Tale and The Wonderful Wizard of Ha’s are the only episodes released by the company to not be released by WEA at the same time. Category:Time Warner subsidiaries Category:Companies based in California",
 "title": "Warner Home Video"
}