{
 "id": "458543",
 "text": "A sockpuppet is a false identity used on the Internet intended to hide a person's real identity.William Safire, Safire's Political Dictionary (Oxford; New York: Oxford University Press, 2008), p. 589 Another word to describe a sock puppet would be alter ego. Often, a sock puppet identity is used to promote ideas or gather intelligence anonymously.Ted Claypoole; Theresa Payton, Protecting Your Internet Identity: Are You Naked Online? (Lanham, MD: Rowman & Littlefield Publishers, 2012), p. 198 Very often, they are used by individuals on the Internet praising themselves while pretending to be someone else. Politicians have frequently been accused of using sock puppets.Obama, Clinton, Palin: Making History in Election 2008, ed. Liette Gidlow (Urbana: University of Illinois Press, 2011), p. 136 Straw man sockpuppets are designed to create political mischief (making fun of an opponent's position for example). It can make it appear many people hold a certain opinion, when in fact that is false. Many online communities attempt to block sockpuppets.It can also be used to tarnish image of an individual without being recognized. ==History== The term \"sockpuppet\" was used as early as July 9, 1993.Encyclopedia of Deception, Volume 1, ed. Timothy R. Levine (Thousand Oaks, CA: SAGE, 2014), p. 854 By 1996 it was in general use. The Oxford English Dictionary at first defined it as \"a person whose actions are controlled by another\". In 2000 the U.S. News and World Report associated the word minion with a sock puppet. In 2006, an aide to a Republican congressman was caught posting messages on Democratic Party sites. Using a false identity the aide was trying to convince Democrats not to support a certain candidate.Encyclopedia of Public Relations, Second edition, ed. Robert L. Heath (Thousand Oaks, CA; London; New Delhi; Singapore: SAGE Publications, Inc., 2013), p. 858 == Other examples == * The history of reviewing one's own work under another name predates the Internet. Walt Whitman and Anthony Burgess both reviewed their own books under pseudonyms (false names).Amy Harmon, \"Amazon Glitch Unmasks War Of Reviewers,\" New York Times, February 14, 2004. * Benjamin Franklin was known to have used many pseudonyms. Some were invented to avoid censorship. Other alter egos were to invent people to argue every side of an issue.Benjamin Franklin's Intellectual World, eds. Paul E. Kerry; Matthew S. Holland (Madison, NJ: Fairleigh Dickinson University Press; Lanham, MD: Co-published with Rowman & Littlefield Publishing Group, 2012), pp. 111–112 Some of his invented names were for the purpose of satire. Others were for humor to entertain his readers. * US Intelligence agencies use sockpuppets to hide the identities of people collecting intelligence. The Huffington Post ran an article a software provider working with the US agencies on software to help manage multiple online identities. * On October 21, 2013 the Wikimedia Foundation (WMF) condemned paid advocacy sockpuppeting on Wikipedia and, on October 23, specifically banned editing by the public relations firm Wiki-PR. ==Meatpuppet== A meatpuppet is similar to a sockpuppet, except a person joins users to a website, such as Wikipedia, to be used with sockpuppet behaviors. Such users are actually real individuals that come to support another user. If a person uses real people to create accounts that support that person's opinions, this form of meatpuppetry is often called \"astroturfing\", a type of false impression of support. == References == == Other websites == * Unmask Wikipedia sock puppets by the way they write * How to Recognize an Internet Sockpuppet * Revealed: US spy operation that manipulates social media Category:Internet culture Category:Pseudonyms",
 "title": "Sock puppet (internet)"
}