{
 "id": "458592",
 "text": "Kristin Landen Davis (also listed as Kristin Lee Davis; born February 23, 1965) is an American actress. She first rose to fame for playing the role of Brooke Armstrong on Melrose Place (1995-1996) and went on to achieve greater success as Charlotte York Goldenblatt on HBO's Sex and the City (1998-2004). For her role on Sex and the City, she received an Emmy Award nomination in 2004. Her movies include Deck the Halls (2006), Sex and the City: The Movie (2008), Couples Retreat (2009). and Sex and the City 2 (2010). ==Early Life and Education== Born in Boulder, Colorado, Davis grew up as an only child.Kristin Davis Biography (1965-) on filmreference.com Her parents' marriage ended when she was just a baby, leading to her adoption by her stepfather, Keith Davis, who was a professor at the University of Colorado Boulder. Keith married her mother, Dorothy, a university data analyst, in 1968. Davis also has three half-sisters from her father's prior marriage. During her early years, her family relocated to Columbia, South Carolina, where her father served as a provost and taught psychology at the University of South Carolina. From the age of nine, Davis aspired to become an actress, a dream that took root when she was cast in the Workshop Theatre production of Snow White and the Seven Dwarfs. She continued to live in South Carolina until she completed her high school education at A.C. Flora High School in 1983. Following her graduation, she made her way to New Jersey, where she pursued her education at Rutgers University. In 1987, she proudly obtained a BFA degree in acting from Rutgers University's Mason Gross School of the Arts. Kristin Davis visited Gothenburg, Sweden, in September 2023 to receive The Perfect World Foundation Award for her efforts in conserving the planet's biodiversity. ==Career== She received Primetime Emmy Award nomination for Outstanding Supporting Actress in a Comedy Series her role as Charlotte in the final season, and well as Golden Globe Award for Best Supporting Actress – Series, Miniseries or Television Film nomination. ==References== ==Other websites== * * * Barnes and Noble biography * Kristin Davis at Emmys.com Category:1965 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:Actors from Colorado Category:Rutgers University alumni",
 "title": "Kristin Davis"
}