{
 "id": "45866",
 "text": "Conifers are gymnosperms. They are cone-bearing seed plants. All living conifers are woody plants which are perennial. Most are trees; some are shrubs. They are the Division Pinophyta or Coniferophyta.Eckenwalder, James E. 2009. Conifers of the world: the complete reference, p13. Timber Press. , . Farjon, Aljos 2008. Natural history of conifers. Timber Press. , Living conifers are all in the order Pinales. Typical examples include cedars, cypresses, firs, junipers, kauris, larches, pines, redwoods, spruces, and yews. Species of conifers can be found in almost all parts of the world, and are often the most common plants in their habitats, as in the taiga. Conifers are of great economic value, and their wood is mainly used for timber and paper-making The wood of conifers is known as softwood, though yew wood is actually quite hard. The division Coniferae contains about 700 living species. == Evolution == The earliest conifers were in the late Carboniferous (Pennsylvanian) period (about 300 million years ago),Henry R.J. 2005. Plant diversity and evolution. London: CABI. Pinophytes, Cycads, and Ginkgos all developed at this time. These plants live without being so dependent on water. Other adaptations are pollen (so fertilisation can occur without water) and the seed, which allows the embryo to be transported and developed elsewhere. Conifers appear to be one of the taxa that benefited from the Permian–Triassic extinction event. They were the dominant land plants of the Mesozoic era. Conifers were eventually overtaken by their descendants, the flowering plants, which first appeared in the Cretaceous. Flowering plants became dominant in the Cainozoic era. Conifers were a main food of herbivorous dinosaurs, and their resins and poisons no doubt gave them some protection against herbivores. All the reproductive features of modern conifers had evolved by the end of the Mesozoic era.Williams, Claire G. 2009. Conifer reproductive biology. Springer Science. == List of genera == * Araucariaceae ** Agathis (kauri) ** Araucaria (monkey puzzle) ** Wollemia (wollemi pine) * Cupressaceae ** Athrotaxis (pencil pine) ** Cryptomeria (Japanese redwood) ** Cunninghamia ** Glyptostrobus (Chinese swamp cypress) ** Metasequoia (dawn redwood) ** Sequoia (coast redwood) ** Sequoiadendron (giant redwood) ** Taiwania ** Taxodium * Pinaceae ** Abies (fir) ** Cathaya ** Cedrus (cedar) ** Keeteleeria ** Larix (larch) ** Nothotsuga (bristlecone hemlock) ** Picea (spruce) ** Pinus (pine) ** Pseudolarix (golden larch) ** Pseudotsuga (Douglas fir) ** Tsuga (hemlock) == Related pages == * Gymnosperm * Conifer cones ==References==",
 "title": "Conifer"
}