{
 "id": "458864",
 "text": "Nick Cave and the Bad Seeds are an Australian alternative rock/heavy metal band formed in 1983 by vocalist Nick Cave, multi-instrumentalist Mick Harvey and guitarist-vocalist Blixa Bargeld. The band has featured international personnel throughout its career and presently consists of Cave, violinist and multi-instrumentalist Warren Ellis, bassist Martyn P. Casey (all from Australia), guitarist George Vjestica (United Kingdom), keyboardist/percussionist Toby Dammit (United States) and drummers Thomas Wydler (Switzerland) and Jim Sclavunos (United States). Described as \"one of the most original and celebrated bands of the post-punk and alternative rock eras in the '80s and onward\", they have released seventeen studio albums and completed numerous international tours. The band was founded following the demise of Cave and Harvey's former group the Birthday Party, the members of which met at a boarding school in Melbourne. Throughout the 1980s, beginning with their debut LP From Her to Eternity (1984), the band drew largely on post-punk, blues and gothic rock, and brought in musicians such as Blixa Bargeld, Barry Adamson and Kid Congo Powers. The band later softened their sound and incorporated other influences on albums such as The Good Son (1990) and The Boatman's Call (1997). Following Harvey's departure in 2009, the band broadened their sound further to include electronic and ambient styles, which feature prominently on the trilogy of albums Push the Sky Away (2013), Skeleton Tree (2016) and Ghosteen (2019). == History == The project that later evolved into Nick Cave and the Bad Seeds began following the demise of The Birthday Party in August 1983. Both Cave and Harvey were members of the Birthday Party, along with guitarist Rowland S. Howard and bassist Tracy Pew. During the recording sessions of the Birthday Party's scheduled EPs Mutiny/The Bad Seed, internal disputes developed in the band. ==Discography== ;Studio albums * From Her to Eternity (1984) * The Firstborn Is Dead (1985) * Kicking Against The Pricks (1986) * Your Funeral... My Trial (1986) * Tender Prey (1988) * The Good Son (1990) * Henry's Dream (1992) * Let Love In (1994) * Murder Ballads (1996) * The Boatman's Call (1997) * No More Shall We Part (2001) * Nocturama (2003) * Abattoir Blues / The Lyre of Orpheus (2004) * Dig, Lazarus, Dig!!! (2008) * Push the Sky Away (2013) * Skeleton Tree (2016) * Ghosteen (2019) * Wild God (2024) ==References== Category:Australian alternative rock bands Category:Australian heavy metal bands Category:Musical groups established in 1983",
 "title": "Nick Cave and the Bad Seeds"
}