{
 "id": "458830",
 "text": "Don Edwards San Francisco Bay National Wildlife Refuge (DESFBANWR) is a US National Wildlife Refuge located in the southern part of San Francisco Bay, California. The Refuge headquarters and visitor center is located in the Baylands district of Fremont, next to Coyote Hills Regional Park, in Alameda County. The visitor center is on Marshlands Rd, off Thornton Ave. It was founded in 1974. The Don Edwards San Francisco Bay National Wildlife Refuge is one of six wildlife refuges in the San Francisco Bay Area. It was renamed Don Edwards San Francisco Bay National Wildlife Refuge in 1995 in recognition of Congressman Don Edwards and his efforts to protect sensitive wetlands in south San Francisco Bay. == Gallery == File:Don Edwards SF Bay NWR sign.jpg | The sign at the entrance to the Refuge File:Don Edwards refuge 2005.jpg|Ecotone at Don Edwards Refuge, 2005 File:Don Edwards refuge 2005-2.jpg|Freshwater slough and dry hill, summer 2005 File:Don Edwards San Francisco Bay National Wildlife Refuge 2.JPG |La Riviere Marsh File:Don Edwards San Francisco Bay National Wildlife Refuge 3.JPG | Salt pond, with the Dumbarton Bridge in the background File:Don Edwards San Francisco Bay National Wildlife Refuge 1.JPG | Salt evaporation ponds File:Don Edwards San Francisco Bay National Wildlife Refuge 8.JPG | Salt pond File:Don Edwards San Francisco Bay National Wildlife Refuge 10.JPG | View from across the salt pond File:Don Edwards San Francisco Bay National Wildlife Refuge 9.JPG | Birds in the salt pond == References == == Other websites == * Large collection of photos and trail descriptions of Don Edwards Wildlife Refuge *Don Edwards San Francisco Bay National Wildlife Refuge – United States Fish and Wildlife Service official site. *San Francisco Bay National Wildlife Refuge Complex *South Bay Salt Pond Restoration Project *Cargill Salt – San Francisco Bay Category:Protected areas Category:Alameda County, California Category:San Mateo County, California Category:Santa Clara County, California Category:1974 establishments in California",
 "title": "Don Edwards San Francisco Bay National Wildlife Refuge"
}