{
 "id": "459031",
 "text": "Ariana Grande-Butera(),Grande pronounces her name at 0:50 here born June 26, 1993) is an American singer, songwriter, record producer and actress. She is known as a pop icon and an influential person in popular music, known for her four-octave vocal range and her signature use of the whistle register. Grande's various awards include two Grammy Awards, one BRIT Award, two Billboard Music Awards, three American Music Awards, nine MTV Video Music Awards, and 36 Guinness World Records. Rolling Stone named her one of the greatest vocalists of all time. Grande started her career at age 15 by being in the Broadway theatre musical 13 (2008). She rose to fame for her role as Cat Valentine in the Nickelodeon series Victorious (2010–2013) and its spin- off series Sam & Cat (2013–2014). She signed with Republic Records in 2011. Grande's debut studio album, Yours Truly (2013), incorporated retro-pop and R&B; elements and yielded the successful single \"The Way\". My Everything (2014), her second album, experimented with EDM and put her to world-wide fame with the singles \"Problem\", \"Break Free\", and \"Bang Bang (Jessie J, Ariana Grande and Nicki Minaj song)\". Grande went into pop and R&B; with her third album Dangerous Woman (2016). Personal struggles influenced Grande's trap- infused fourth and fifth albums, Sweetener (album) (2018) and Thank U, Next (2019). The former won the Grammy Award for Best Pop Vocal Album, while the latter broke several streaming records and was nominated for Album of the Year. Thank U, Next garnered two Billboard Hot 100 number-one songs with its title track and \"7 Rings\", and made Grande the first solo artist to simultaneously occupy the top three positions on the chart. She broke the record for the most number-one debuts in Hot 100 history with the title track of her trap-influenced sixth album, Positions (album) (2020), and the collaborations \"Stuck With U\" with Justin Bieber and \"Rain on Me (Lady Gaga and Ariana Grande song)\" , the latter of which won the Grammy Award for Best Pop Duo/Group Performance. Grande ventured into dance music on her seventh album, Eternal Sunshine (2024), which produced the number-one singles \"Yes, And?\" and \"We Can't Be Friends (Wait for Your Love)\". She returned to acting with the political satire Don't Look Up (2021). Among the world's best-selling music artists, Grande has sold over 85 million records around the world. She was the most-streamed female act of the 2010s and has the second most songs with over a billion streams for a woman, with 14 on Spotify. Grande also has a large social media following; with over 380 million followers, she is the sixth-most-followed individual on Instagram and one of the most-subscribed and most followed musicians on YouTube and Spotify. She was named Woman of the Year (2018) and the most successful female artist to debut in the 2010s by Billboard, featured in listicles such as Time 100 (2016 and 2019), Forbes Celebrity 100 (2019–2020), and ranked the highest-paid female musician of 2020 by Forbes. Outside of music and film, Grande has worked with many charitable organizations and advocates for animal rights, mental health, and gender, racial, and LGBT equality. Her business ventures include R.E.M. Beauty, a cosmetics brand launched in 2021, and a fragrance line that has earned over $1 billion in global retail sales. ==Early life== Ariana Grande-Butera was born on June 26, 1993 in Boca Raton, Florida. She is the daughter of Joan Grande; ; and ; ; and Edward Butera. She is of Italian descent. Her family moved from New York to Florida before her birth. Her parents separated when she was eight years old. ==Career== ===2008–2012: Beginnings and Victorious=== Before her appearance on Nickelodeon, Grande played in the musical 13 as Charlotte in 2008 and later won an award for playing that role. From 2010 to 2013, Grande played the role of Cat Valentine in the Nickelodeon show Victorious. In August 2012, it was announced that Victorious would not be returning after three seasons. However, later that month, Nickelodeon announced a spin-off show called Sam & Cat. It included Grande from Victorious with Jennette McCurdy, who played Sam Puckett from iCarly. They would replay their roles. Even though Sam & Cat was a success for Nickelodeon, the show was cancelled on July 13, 2014 because of Grande's musical career and other problems. The final episode aired on July 17. ===2013–2014: Yours Truly and My Everything=== Grande spent three years recording her first studio album, Yours Truly. She completed the album, originally titled Daydreamin, in June 2013. It was released on August 30, 2013. In September 2013, it officially debuted at number one on the US Billboard 200 chart, with 138,000 copies sold in its first week and made Grande the first female artist (since Kesha) to have her first album debut at the top of the charts—and the fifteenth female artist overall. The first single from the album, \"The Way\" (featuring Pittsburgh rapper Mac Miller), was released on March 26, 2013. It sold 120,000 units in the first 48 hours of its release, and then it went on to sell over 219,000 units in its opening week. \"Baby I\" and \"Right There\" were also released as singles from her first album. In January 2014, Grande started working on her second studio album. She finished the album in late March 2014. The first single from the album is \"Problem\", and it features Australian rapper Iggy Azalea. It premiered at the 2014 Radio Disney Music Awards on April 27. The second single from the album, called \"Break Free\" (featuring Russian-German producer Zedd) premiered on July 2 during a one-day revival episode of the MTV show Total Request Live, named Total Ariana Live. On June 28, 2014, Grande announced that the title of her second studio album to be My Everything. It was released on August 25. ===2016–2017: Dangerous Woman=== Her third studio album, Dangerous Woman, was released May 20, 2016. The album debuted at number two on the US Billboard 200, earning 175,000 album-equivalent units in its first week, with 129,000 coming from pure sales. It was her first album to not hit number-one in the country. The lead single \"Dangerous Woman\" was released on March 11, 2016. It went to number eight on the US Billboard Hot 100. The second single \"Into You\" went to number 13 and the third single \"Side to Side\" went to number four on the chart. The album received generally positive reviews from critics. To promote the album, Grande performed at the 2016 Billboard Music Awards and MTV Video Music Awards. She also appeared on an episode of Saturday Night Live as both the host and musical guest. Grande embarked on a concert tour, the Dangerous Woman Tour, in 2017. It went to North and South America, Europe, and Asia. On May 22, 2017, numerous reports surfaced of explosions at a concert featuring Grande at the Manchester Arena in Manchester, United Kingdom. Police confirmed 22 fatalities and many injuries. They urged people to stay away from the area as they rescued and investigated. === 2018–2023: Sweetener, thank u, next, & Positions=== In April 2018, Grande released \"No Tears Left to Cry\", the lead single from her upcoming fourth studio album, Sweetener, which was released on August 17, 2018. The song entered at number three on the Billboard Hot 100. With this, she became the only act to have all four lead singles from her studio albums enter the top ten of the Hot 100 in each song's first week on the chart; \"The Way\" (from Yours Truly) and \"Dangerous Woman\" (from Dangerous Woman) both went to number 10 on the chart, while \"Problem\" (from My Everything) and \"No Tears Left to Cry\" went to number three. \"Problem\" later reached number two on the Hot 100. Six months after the release of Sweetener, Grande released her fifth studio album Thank u, next. Then in 2020, she released her sixth studio album Positions. She was featured on Lady Gaga's \"Rain on Me\" (2020), along with remixes of the Weeknd's \"Save Your Tears\" (2021) and \"Die for You\" (2023). All three of these songs reached number one on the Billboard Hot 100. Grande and Gaga also won Best Pop Duo/Group Performance at the 63rd Grammy Awards in 2021, becoming Grande's second Grammy win. === 2024–present: Eternal Sunshine === Grande released the song \"Yes, And?\" on January 12, 2024. She later announced the release of her seventh studio album, Eternal Sunshine, which came out on March 8, Grande's first album in nearly four years. \"Yes, And?\" entered at number one on the US Hot 100, becoming her eighth US chart-topper. ==Artistry== Grande possessed a four-octave light-lyric soprano vocal range. She is known for her vocal belting and her ability to sing in the whistle register. ==Personal life== She has been vegan since 2013. Ariana Grande began dating comedian Pete Davidson in May 2018 and on June 11, 2018, multiple news outlets reported that Davidson and Ariana Grande were engaged. Their engagement was called off in October 2018. In November 2019, Grande announced her support for Senator Bernie Sanders's second presidential bid. In December 2020, Grande became engaged to real estate agent Dalton Gomez. They married in mid-May 2021. In 2023, she filed for divorce from Dalton Gomez after two years of marriage. == Filmography == * Hairspray Live! (2016) * Don't Look Up (2021) * Wicked (2024) * Wicked Part Two (2025) == Discography == Studio albums * Yours Truly (2013) * My Everything (2014) * Dangerous Woman (2016) * Sweetener (2018) * Thank U, Next (2019) * Positions (2020) * Eternal Sunshine (2024) == Live performances and tours == === Stage acting === Year Production Role Director Venue Notes Ref. 2008 13 Charlotte Jeremy Sams Norma Terris Theatre, Chester Jones, Kenneth. \"Teen Time! Cast Announced for Goodspeed Run of '13' Musical\" , playbill.com, April 22, 2008 2008-2009 Bernard B. Jacobs Theatre, Manhattan Original Broadway Cast Gans, Andrew and Kenneth Jones. \"New Musical 13 to Close on Broadway in January 2009\" , playbill.com, November 21, 2008 2012 A Snow White Christmas Snow White Bonnie Lythgoe Pasadena Playhouse === Tours === ==== Headlining ==== * The Listening Sessions (2013) * The Honeymoon Tour (2015) * Dangerous Woman Tour (2017) * Sweetener World Tour (2019) ==== Promotional ==== * The Sweetener Sessions (2018) ==== Opening act ==== * Justin Bieber – Believe Tour (2013) == Awards == == References == ==Other websites== * * * * * Grande as Judy Garland starring in Up We Go in Our Fantastic Rocket, Saturday Night Live (2016) Category:1993 births Category:Living people Category:21st-century American actors Category:21st- century American singer-songwriters Category:Actors from Florida Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:American singer-songwriters Category:American contemporary R&B; singers Category:American pop singers Category:American soul musicians Category:American blue-eyed soul singers Category:American dance musicians Category:American hip hop singers Category:Urban pop musicians Category:People from Boca Raton, Florida Category:Singers from Florida Category:Award winning singers",
 "title": "Ariana Grande"
}