{
 "id": "459063",
 "text": "Segunda División B is a football league which is the third division in Spain. == Structure == The league is made of 4 groups of 20 teams, making the amount of total teams 80 in all. === Promotion === In each group, the top 6 teams qualify for the Copa Del Rey. The 2nd, 3rd, and 4th placed teams qualify for playoffs to be promoted to Segunda Division. The 1st placed team has to play a playoff with the champions of other groups and the winner is declared champion. === Relegation === In each group, the bottom 4 teams are directly sent to the Tercera División. The 16th placed teams in each group compete against each other. The worst of those teams is relegated. ==Groups== Group I Group II Group III Group IV * Atlético Baleares * Atlético Madrid B * Celta B * Coruxo * Getafe B * Ibiza * Internacional * Langreo * Las Palmas Atlético * Las Rozas * Marino Luanco * Melilla * Oviedo B * Peña Deportiva * Pontevedra * Racing Ferrol * Rayo Majadahonda * Real Madrid Castilla * San Sebastián de los Reyes * Sporting Gijón B * Alavés B * Amorebieta * Arenas * Athletic Bilbao B * Barakaldo * Burgos * Calahorra * Cultural Leonesa * Guijuelo * Haro * Izarra * Leioa * Osasuna B * Real Sociedad B * Real Unión * Salamanca CF * Tudelano * UD Logroñés * Unionistas * Valladolid Promesas * Andorra * Atlético Levante * Badalona * Barcelona B * Castellón * Cornellà * Ebro * Ejea * Espanyol B * Gimnàstic * Hércules * La Nucía * Llagostera * Lleida Esportiu * Olot * Orihuela * Prat * Sabadell * Valencia Mestalla * Villarreal B * Algeciras * Atlético Sanluqueño * Badajoz * Cádiz B * Cartagena * Córdoba * Don Benito * Linense * Marbella * Mérida * Murcia * Recreativo * Recreativo Granada * San Fernando * Sevilla Atlético * Talavera de la Reina * UCAM Murcia * Villarrobledo * Villarrubia * Yeclano == Group winners == These are all the group winners ever. The promoted group winners are in bold. Note: Since the 2008-09 season, the champion has been decided in a playoffs round. The winner of the playoffs final is highlighted in gold. The loser of the playoffs final is highlighted in silver. Year Group I Group II Group III Group IV Other promoted teams 1929 Cultural Leonesa None None None Murcia 1977–78 Racing Ferrol Almería None None Algeciras, Castilla 1978–79 Palencia Levante None None Gimnàstic, Oviedo 1979–80 Barakaldo Linares None None Ceuta, Atlético Madrileño 1980–81 Celta Mallorca None None Córdoba, Deportivo 1981–82 Barcelona B Xerez None None Cartagena, Palencia 1982–83 Athletic B Granada None None Algeciras, Tenerife 1983–84 Sabadell Lorca None None Calvo Sotelo, Logroñés 1984–85 Sestao Rayo Vallecano None None Albacete, Deportivo Aragón 1985–86 Figueres Xerez None None None 1986–87 Tenerife None None None Lleida, Granada, Real Burgos 1987–88 Eibar CFJ Mollerussa Salamanca Alzira None 1988–89 Athletic B Palamós Atlético B Levante None 1989–90 Avilés Lleida Albacete Orihuela None 1990–91 Real Madrid B Racing Santander Badajoz Barcelona BPromoted after the administrative relegation to Segunda B of Orihuela. Compostela, Mérida 1991–92 Salamanca Sant Andreu Cartagena Marbella Badajoz, Lugo, Villarreal 1992–93 Leganés Alavés Murcia Las Palmas Hércules, Toledo 1993–94 Salamanca Alavés Gramenet Extremadura Getafe, Ourense 1994–95 Racing Ferrol Alavés Levante Córdoba Almería, Écija, Sestao 1995–96 Las Palmas Sporting B Levante Jaén Atlético Madrid B, Ourense 1996–97 Sporting B Aurrerá Gimnàstic Córdoba Elche, Jaén, Numancia, Xerez 1997–98 Cacereño Barakaldo Barcelona B Málaga Mallorca B, Recreativo de Huelva 1998–99 Getafe Cultural Leonesa Levante Melilla Córdoba, Elche 1999-00 Universidad LPGC Gimnástica Gandía Granada Jaén, Murcia, Racing de Ferrol 2000–01 Atlético B Burgos Gramenet Cádiz Gimnàstic, Ejido, Xerez 2001–02 Barakaldo Barcelona B Real Madrid B Motril Almería, Compostela, Getafe, Terrassa 2002–03 Universidad LPGC Real Unión Castellón Algeciras Cádiz, Ciudad de Murcia, Málaga B 2003–04 Pontevedra Atlético B Lleida Lanzarote Gimnàstic, Racing de Ferrol 2004–05 Real Madrid B Ponferradina Alicante Sevilla B Castellón, Lorca, Real Madrid B 2005–06 Universidad LPGC Salamanca Badalona Cartagena Las Palmas, Ponferradina, Vecindario 2006–07 Pontevedra Eibar Alicante Sevilla Atlético Córdoba, Racing de Ferrol 2007–08 Rayo Vallecano Ponferradina Girona Écija Alicante, Huesca 2008–09 Real Unión Cartagena Alcoyano Cádiz Villarreal B 2009–10 Ponferradina Alcorcón Sant Andreu Granada Barcelona B 2010–11 Lugo Eibar Sabadell Murcia Alcoyano, Guadalajara 2011–12 Real Madrid Castilla Mirandés Atlético Baleares Cádiz Lugo, Ponferradina 2012–13 Tenerife Alavés L'Hospitalet Jaén Eibar 2013–14 Racing Satander Sestao River Llagostera Albacete Leganés 2014–15 Oviedo Huesca Gimnàstic Cádiz Bilbao Athletic ==References== Category:1928 establishments in Spain Category:1929 disestablishments Category:1920s disestablishments in Europe Category:1977 establishments in Europe Category:1970s establishments in Spain Category:Football leagues in Spain",
 "title": "Segunda División B"
}