{
 "id": "459033",
 "text": "Victoria Dawn Justice (born February 19, 1993) is an American actress and singer. She appeared as one of the main stars of Zoey 101 as Lola. She soon landed the main lead of Tori in another Nickelodeon series Victorious. She also appeared in the movies Unknown and in The Garden. In October 2013, she obtained the lead role on MTV's Eye Candy playing Lindy Sampson. ==Filmography== ===Film=== Year Title Role Notes 2005 When Do We Eat? Young Nikky 2006 The Garden Holly 2006 Unknown Daughter 2008 Adventures in Appletown Betsy 2012 The First Time Jane Harmon 2012 Fun Size Wren DeSantis 2013 Jungle Master Rainie Voice role (English dub) 2015 Get Squirrely Lola Voice role 2015 Naomi and Ely's No Kiss List Naomi Mills 2017 The Outcasts Jodie Schellenberger Originally titled The Outskirts 2018 Bigger Kathy Weider 2019 Summer Night Harmony 2021 Trust Brooke Gatwick 2021 Afterlife of the Party Cassie Garcia 2022 A Perfect Pairing Lola Alvarez 2023 The Tutor Annie California King Lynette To be released Sic To be released ===Television=== Year Title Role Notes 2003 Gilmore Girls Jill #2 Episode: \"The Hobbit, the Sofa, and Digger Stiles\" 2005 The Suite Life of Zack & Cody Rebecca Episode: \"The Fairest of Them All\" 2005–2008 Zoey 101 Lola Martinez Main role (seasons 2–4) 2005 Silver Bells Rose Television film 2006 Everwood Thalia Thompson Episode: \"Enjoy the Ride\" 2009 The Naked Brothers Band Herself 2 episodes 2009 Spectacular! Tammi Dyson Television film 2009 iCarly Shelby Marx Episode: \"iFight Shelby Marx\" 2009 True Jackson, VP Vivian Episode: \"True Crush\" 2010 The Troop Eris Fairy Episode: \"Speed\" 2010–2013 Victorious Tori Vega Main role 2010–2015 The Penguins of Madagascar Stacy Voice role; 2 episodes 2011 iCarly Tori Vega Episode: \"iParty with Victorious\" 2013 Big Time Rush Herself Episode: \"Big Time Tour Bus\" 2015 Eye Candy Lindy Sampson Main role 2015 Undateable Amanda 2 episodes 2016 Cooper Barrett's Guide to Surviving Life Ramona Miller 2 episodes 2016 The Rocky Horror Picture Show: Let's Do the Time Warp Again Janet Weiss Television film 2017 Impractical Jokers Herself Special guest 2017 Man with a Plan Sophia Episode: \"The Silver Fox\" 2018 Robot Chicken Student Voice role; episode: \"Factory Where Nuts Are Handled\" 2018 Queen America Hayley Wilson 2 episodes 2018 American Housewife Harper Episode: \"Trophy Wife\" 2020 The Real Bros of Simi Valley Courtney Ingles 4 episodes 2020 50 States of Fright Logan 3 episodes ==References== ==Other websites== * * Category:1993 births Category:Living people Category:Actors from Florida Category:American child actors Category:American movie actors Category:American singer-songwriters Category:American television actors Category:American voice actors Category:Singers from Florida",
 "title": "Victoria Justice"
}