{
 "id": "459108",
 "text": "The Jetsons is an American animated sitcom. It was directed by William Hanna and Joseph Barbera. There are 77 episodes and 3 seasons. Each episode is between 22 and 30 minutes. The series was first broadcast in prime time from September 23, 1962, to March 17, 1963, on ABC. It was later broadcast in reruns in syndication with new episodes made from 1985 to 1987. The Jetsons was Hanna-Barbera's Space Age counterpart to The Flintstones.CD liner notes: Saturday Morning: Cartoons' Greatest Hits, 1995 MCA Records While the Flintstones lived in a world which was a version of the Stone Age. The Jetsons live in a version of the same world in the future. The Flintstones had machines powered by birds and dinosaurs while the Jetsons had robotic machined, aliens, holograms, and other futuristic inventions. The original series had 24 episodes. They were broadcast on Sunday nights on ABC beginning on September 23, 1962. Prime time reruns were broadcast through September 22, 1963. It was the first program broadcast in color on ABC. The program did not get much attention. It was cancelled after one season and moved to Saturday mornings. It was very successful there. After the primetime run, the program aired on Saturday mornings for decades. It was on ABC for the 1963–64 season and then on CBS and NBC. New episodes were produced for syndication from 1985 to 1987. No episodes of the show were made after 1989. Much of the main cast (George O'Hanlon, Mel Blanc and Daws Butler) had died in 1988 and 1989. The 1990 movie Jetsons: The Movie was the series finale to the television program. A direct-to-video animated movie, The Jetsons & WWE: Robo-WrestleMania!, was released in 2017. ==References== Category:1980s American sitcoms Category:1980s American animated television series Category:Fictional families Category:English-language television programs Category:1962 television series debuts Category:1987 American television series endings Category:1960s American animated television series",
 "title": "The Jetsons"
}