{
 "id": "459238",
 "text": "The Association of Tennis Professionals (ATP) Tour is the top level professional tennis tour for men's tennis competitions. The 2014 ATP Tour calendar is made up of four Grand Slam tournaments (organised by the International Tennis Federation (ITF)), and sixty-one regular tournaments. It also includes the Davis Cup (organised by the ITF), and the year-end championships (the ATP World Tour Finals). The Hopman Cup, which does not distribute ranking points, is included. The season begins on 30 December 2013 and will end on 17 November 2014. The tournaments are played on flat surface, called a tennis court. The measurements of a tennis court are set by the ITF. The court is long and wide. Its width is for singles matches and for doubles matches. Tennis is played on a variety of tennis court types. Each type has to be played differently. There are four main types of courts based on what's used to build the court surface, clay, hard, grass and carpet courts. The ITF ranks them by five different speed ratings from slow to fast. ==Calendar== ;Key Grand Slam tournaments ATP World Tour Finals ATP World Tour Masters 1000 ATP World Tour 500 ATP World Tour 250 Team events ===January=== Week of Tournament Champions Runners-up Score ===February=== Week of Tournament Champions Runners-up Score ===March=== Week of Tournament Champions Runners-up Score ===April=== Week of Tournament Champions Runners-up Score ===May=== Week of Tournament Champions Runners-up Score ===June=== Week of Tournament Champions Runners-up Score ===July=== Week of Tournament Champions Runners-up Score 28 July Citi Open (report) Washington, D.C., United States ATP World Tour 500 Prize money: $1,654,295 – Court type: Hard Milos Raonic Vasek Pospisil 6–1, 6–4 28 July Citi Open (report) Washington, D.C., United States ATP World Tour 500 Prize money: $1,654,295 – Court type: Hard Jean-Julien Rojer Horia Tecău Sam Groth Leander Paes 7–5, 6–4 28 July Bet-at-home Cup Kitzbühel (report) Kitzbühel, Austria ATP World Tour 500 Prize money: €485,760 – Court type: Clay (Red) David Goffin Dominic Thiem 4–6, 6–1, 6–3 28 July Bet-at-home Cup Kitzbühel (report) Kitzbühel, Austria ATP World Tour 500 Prize money: €485,760 – Court type: Clay (Red) Henri Kontinen Jarkko Nieminen Daniele Bracciali Andrey Golubev 6–1, 6–4 ===August=== Week of Tournament Champions Runners-up Score 4 August Rogers Cup (report) Toronto, Canada ATP World Tour Masters 1000 Prize money: $3,766,270 – Court type: Hard 4 August Rogers Cup (report) Toronto, Canada ATP World Tour Masters 1000 Prize money: $3,766,270 – Court type: Hard / / 11 August Western & Southern Open (report) Cincinnati, United States ATP World Tour Masters 1000 Prize money: $4,017,355 – Court type: Hard 11 August Western & Southern Open (report) Cincinnati, United States ATP World Tour Masters 1000 Prize money: $4,017,355 – Court type: Hard / / 18 August Winston-Salem Open (report) Winston-Salem, United States ATP World Tour 250 Prize money: $683,705 – Court type: Hard 18 August Winston-Salem Open (report) Winston-Salem, United States ATP World Tour 250 Prize money: $683,705 – Court type: Hard / / 25 August 1 September US Open (report) New York City, United States Grand Slam Prize money: $ – Court type: Hard 25 August 1 September US Open (report) New York City, United States Grand Slam Prize money: $ – Court type: Hard / / 25 August 1 September US Open (report) New York City, United States Grand Slam Prize money: $ – Court type: Hard / / ===September=== Week of Tournament Champions Runners-up Score ===October=== Week of Tournament Champions Runners- up Score ===November=== Week of Tournament Champions Runners-up Score ==Sources== ==Other websites== *Association of Tennis Professionals (ATP) World Tour official website *International Tennis Federation (ITF) official website Category:ATP seasons",
 "title": "2014 ATP World Tour"
}