{
 "id": "45924",
 "text": "In physical geography, an alpine tundra, alpine habitat, alpine zone, or alpine biome is in the mountains. The alpine habitat is too high up for trees to grow but not so high that the snow and ice never melt. There are alpine places all over the Earth. There are tropical alpine places and arctic alpine places. Many alpine places are 3000 meters (10,000 feet) above sea level, but they can be higher or lower depending on how far from the equator and ocean they are. ==Plants== Alpine plants grow slowly and stay short their whole lives. There are many reasons for this: Alpine places are usually very windy, so the plants that live there are usually short and strong. They are also very cold and dry. This high up, there is not much carbon dioxide in the air, which also makes it harder for plants to grow. Alpine plants grow slowly. When living things die in alpine places, their bodies break apart slowly. This means that the soil in alpine places is not very good. Tropical alpine plants can be different from alpine plants in colder places. Their bodies stop them from losing too much water. They can have wax on their leaves to hold water in. They can have hairs to block sunlight or silver color to reflect sunlight. This keeps them from photosynthesizing so fast that they lose too much water and die. Important alpine plants: *Tussock grasses *Lichen *Sedges *Dwarf forms of trees *Shrubs *Bristlecone pine tree ==Animals== There is more ultraviolet light in alpine places than closer to sea level. Mammals can live in alpine places because they are warm-blooded. They can grow fur or fat to protect themselves from the cold. Many of them sleep in the winter. Other animals walk or climb lower down in the hills for the winter. Alpine animals usually have smaller ears, legs, and tails than other animals so they do not lose heat through them. Because there is less oxygen in alpine places, alpine animals sometimes have larger lungs and more blood cells than other animals. Few insects live in alpine places because they are so cold. Few birds live in alpine places all year, but many fly there during warm weather and fly away during the winter. Almost no amphibians or reptiles live in alpine places. Tropical alpine animals can be different from animals in other places. Mammals tend to hide a lot and have dull colors. Because the air is so thin, birds tend to have smaller bodies and longer, wider wings than other birds. Important alpine animals: *Wild sheep and goats *Chinchillas *Snowshoe hares *Voles *Pika *White-tailed ptarmigan *Big-winged birds, for example vultures and condors *Tiny birds, for example hummingbirds and sunbirds. *Rock wren *Pollinating insects, for example bumblebees and butterflies *Digging insects, for example springtails ==Name== It is named after the mountain range the Alps, but there are alpine habitats all over the world. ==History== Alexander von Humboldt was one of the first scientists to write about alpine places. He was from Germany. In the 1800s, he went to South America and climbed the Andes mountains. He wrote papers and drew drawings about the mountains and their plants and animals. In 1889, another scientist, C. Hart Merriam, wrote about \"life zones\" that he saw in mountains in Arizona. He put plants, animals, and places in groups and saw that, the further south he looked, the higher up the place had to be to have the same kinds of plants and animals. His ideas work well in North American mountains, but they do not work well in tropical places. == References == == Other websites == * Category:Biomes Category:Ecozones",
 "title": "Alpine tundra"
}