{
 "id": "459712",
 "text": "Robots is a 2005 American computer animated comic science fiction adventure comedy movie produced by Blue Sky Studios for 20th Century Fox. It stars Ewan McGregor, Halle Berry, Alec Baldwin, Mel Brooks, Amanda Bynes, Drew Carey, Stanley Tucci, Jim Broadbent and Robin Williams. It was released on March 11, 2005. == Cast == * Ewan McGregor as Rodney Copperbottom, a young blue robot and aspiring inventor * Halle Berry as Cappy, a human-themed worker at Bigweld Industries and Rodney's love interest * Greg Kinnear as Phineas T. Ratchet, Rodney's nemesis and Madame Gasket's son and right-hand man * Mel Brooks as Bigweld, the jolly inventor and owner of Bigweld Industries; until Rodney met him, Bigweld had slipped into depression at Ratchet's actions * Robin Williams as Fender Pinwheeler, an old red robot who befriends Rodney and is constantly falling apart * Amanda Bynes as Piper Pinwheeler, a yellow robot who is Fender's younger sister who has a crush on Rodney * Drew Carey as Crank Casey, an orange robot who befriends Rodney * Jennifer Coolidge as Aunt Fanny, a kind motherly robot, who takes in \"broke\" robots; she has the unintentional effect of bumping people with her large rear * Harland Williams as Lugnut, a large green robot who befriends Rodney along with his mute companion, Diesel * Jim Broadbent as Madame Gasket, an evil and hideous robot and Ratchet's mother * Dianne Wiest as Lydia Copperbottom, Rodney's mother * Stanley Tucci as Herb Copperbottom, Rodney's father and a dishwasher at Gunk's * Natasha Lyonne as Loretta Geargrinder, a receptionist at Bigweld Industries and Fender's love interest (voiced by Cat Deeley in the UK release) * Paul Giamatti as Tim the Gate Guard * Dan Hedaya as Mr. Gunk, Herb Copperbottom's grumpy boss === Cameos and various characters === * Brian Scott McFadden as Trashcan Bot (voiced by Vernon Kay in the UK release) * Jay Leno as a Fire Hydrant * Lucille Bliss as a Pigeon Lady * Paula Abdul as Wristwatch #1 * Randy Jackson as Wristwatch #2 * Ryan Seacrest as Wristwatch #3 * Al Roker as Mailbox * John Mahoney as the Employee Robots * Randall Montgomery as Zinc * Tim Nordquist as Tin Man * Lowell Ganz as Monsieur Gasket, Madame Gasket's husband and Ratchet's father (voiced by Sir Terry Wogan in the UK release) * James Earl Jones as Mufasa (archive recordings) * Catherine O'Hara as Sally (archive recordings) * William Hickey as Dr. Finkelstein (archive recordings) * James Brown as Diesel (singing voice, archive recording) * William Joyce as Angry Mob Robot * John Powell as Large Robot * Randy Thom as Bartender Additional voice talents were provided by Lara Cody, Cooper Cowgill, David Crommett, Darin DePaul, Dann Fink, Timothy Gulan, Alexander Haney, Angela Haney, Ray Iannicelli, Sondra James, Vanessa Lemonides, Anthony J. Lewis Jr., Marcus Maurice, Jennifer Perito, Kristin Reeves, David Rossmer, Lyla Stone, and Bruce Winant. ==References== == Other websites == * * (Dead link) * * * * Category:2005 computer-animated movies Category:2005 comedy movies Category:2005 science fiction movies Category:American animated movies Category:American comedy movies Category:American science fiction movies Category:Blue Sky Studios movies Category:Robot movies Category:Movies directed by Chris Wedge Category:20th Century Fox movies Category:Movies composed by John Powell Category:2000s adventure movies Category:American adventure movies",
 "title": "Robots (2005 movie)"
}