{
 "id": "459978",
 "text": "F.C. Barcelona B is the reserve team of F.C. Barcelona. They compete in the Segunda División B, the third division of Spanish association football, after being relegated from the Segunda División in the 2014-15 season finishing in 22nd place. == History == Barça B was originally founded on 1 August 1934, as Societat Esportiva Industrial Espanya. It was owned by a textile company of the same name. In 1945, the company agreed with FC Barcelona to make the club Barça's reserve team. They were promoted to La Liga in 1953, but decided to stay in Segunda División. In 1956, they won promotion again, and since teams with names of companies were not allowed, they changed their name to CD Condal. In 1970, they decided to merge Condal with Atlètic Catalunya and formed Barcelona Atlètic. They reached Segunda División B and Segunda División after 1974. In 1991, Barcelona Atlètic was then renamed FC Barcelona B. In 2008, they were named Barcelona Atlètic once again when Pep Guardiola brought them to Segunda División B, and then once again named FC Barcelona B when they were promoted to Segunda División. == League position == {| class=\"wikitable\" Season Division Place 1970–71 3rd 4th 1971–72 3rd 19th 1972–73 Regional 1st 1973–74 3rd 1st 1974–75 2nd 10th 1975–76 2nd 6th 1976–77 2nd 20th 1977–78 2nd B 5th 1978–79 2nd B 4th 1979–80 2nd B 14th 1980–81 2nd B 3rd 1981–82 2nd B 1st 1982–83 2nd 11th 1983–84 2nd 7th 1984–85 2nd 9th *22 seasons in Segunda División *18 seasons in Segunda División B *4 seasons in Tercera División *1 season in Categorías Regionales ==Honours == *Segunda División B :Winners (4): 1981–82, 1990–91, 1997–98, 2001–02 *Tercera División :Winners (2): 1973–74, 2007–08 ==Current squad== ==Related pages== * F.C. Barcelona * Mini Estadi * Barcelona * Catalonia == References == Category:FC Barcelona Category:1970 establishments in Europe Category:1970s establishments in Spain Category:Reserve football teams",
 "title": "FC Barcelona Atlètic"
}