{
 "id": "460338",
 "text": "Flags of the Nguyễn Dynasty's administrative units were used since about 1868 to 1885, with 2:2 ratio. == Royal provinces == File:Flag of Nguyen dynasty's administrative unit - Thua Thien.svg|Thua Thien (Thừa Thiên phủ, 承天府) File:Flag of Nguyen dynasty's administrative unit - Quang Tri.png|Quang Tri (Quảng Trị tỉnh, 廣治省) File:Flag of Nguyen dynasty's administrative unit - Quang Binh.png|Quang Binh (Quảng Bình tỉnh, 廣平省) File:Flag of Nguyen dynasty's administrative unit - Quang Nam.png|Quang Nam (Quảng Nam tỉnh, 廣南省) File:Flag of Nguyen dynasty's administrative unit - Quang Ngai.png|Quang Ngai (Quảng Ngãi tỉnh, 廣義省) == Provinces of Northern Region == File:Flag of Nguyen dynasty's administrative unit - Ha Noi.png|Ha Noi (Hà Nội tỉnh, 河內省) File:Flag of Nguyen dynasty's administrative unit - Lang Son.png|Lang Son (Lạng Sơn tỉnh, 諒山省) File:Flag of Nguyen dynasty's administrative unit - Bac Ninh.png|Bac Ninh (Bắc Ninh tỉnh, 北寧省) File:Flag of Nguyen dynasty's administrative unit - Son Tay.png|Son Tay (Sơn Tây tỉnh, 山西省) File:Flag of Nguyen dynasty's administrative unit - Hai Duong.png|Hai Duong (Hải Dương tỉnh, 海陽省) File:Flag of Nguyen dynasty's administrative unit - Nam Dinh.png|Nam Dinh (Nam Định tỉnh, 南定省) == Provinces of Central Region == File:Flag of Nguyen dynasty's administrative unit - Thanh Hoa.png|Thanh Hoa (Thanh Hóa tỉnh, 清化省) File:Flag of Nguyen dynasty's administrative unit - Nghe An.png|Nghe An (Nghệ An tỉnh, 乂安省) File:Flag of Nguyen dynasty's administrative unit - Ha Tinh.png|Ha Tinh (Hà Tĩnh tỉnh, 河靜省) File:Flag of Nguyen dynasty's administrative unit - Binh Dinh.png|Binh Dinh (Bình Định tỉnh, 平定省) File:Flag of Nguyen dynasty's administrative unit - Phu Yen.png|Phu Yen (Phú Yên tỉnh, 富安省) File:Flag of Nguyen dynasty's administrative unit - Khanh Hoa.png|Khanh Hoa (Khánh Hòa tỉnh, 慶和省) File:Flag of Nguyen dynasty's administrative unit - Binh Thuan.png|Binh Thuan (Bình Thuận tỉnh, 平順省) == Related pages == * Provinces of Vietnam * List of flags of Vietnam == References == * Peter Truhart, Regents of Nations, K.G Saur Münich, 1984–1988 , Art. «Vietnamese Dynasties/Vietnamesische Dynastien», pp. 1786-1790. * Vietnamese flags * Flags of the Nguyen dynasty's administrative units * The star icon in Vietnamese consciousness Category:History of Vietnam Category:Provinces of Vietnam Category:Symbols of Vietnam",
 "title": "Flags of the Nguyễn dynasty's administrative units"
}