{
 "id": "460472",
 "text": "The 2014–15 Premier League is the 23rd season of the Premier League. It is the top English professional league for association football clubs since it started in 1992. The fixtures were announced on 18 June 2014. The season started on Saturday 16 August 2014 and will end on Sunday 24 May 2015. ==Teams== A total of 20 teams will play in the league. The top 17 sides from the 2013–14 season and the three promoted from the 2013–14 Football League Championship. On 5 April 2014, Leicester City earned promotion from the 2013–14 Football League Championship after ten-years away from the Premier League. They became champions after beating Bolton Wanderers on 22 April 2014. On 21 April 2014, Burnley earned promotion to the Premier League with second place. This followed their win over Wigan Athletic. On 24 May 2014 Queens Park Rangers were the final team to be promoted after winning the 2014 Football League Championship play-off Final. They won 1–0 against Derby County at Wembley Stadium in London. The three teams replace Cardiff City, Fulham and Norwich City, who were all relegated to the Championship at the end of the previous season. ===Stadia and locations=== :Note: Table lists in alphabetical order. Team Stadium Capacity Arsenal Emirates Stadium Aston Villa Villa Park Burnley Turf Moor Chelsea Stamford Bridge Crystal Palace Selhurst Park Everton Goodison Park Hull City KC Stadium Leicester City King Power Stadium Liverpool Anfield Manchester City Etihad Stadium Manchester United Old Trafford Newcastle United St James' Park Queens Park Rangers Loftus Road Southampton St Mary's Stadium Stoke City Britannia Stadium Sunderland Stadium of Light Swansea City Liberty Stadium Tottenham Hotspur White Hart Lane West Bromwich Albion The Hawthorns West Ham United Boleyn Ground ===Personnel and kits=== Note: Flags are determined by FIFA eligibility rules. Team Manager Captain Kit manufacturer Shirt sponsor fun88 Adidas Umbro 12BET Puma King Power Standard Chartered Puma Nike Made by club Intuit QuickBooks Betway * Referee kits are made by Nike and are sponsored by EA Sports. Nike has a new match ball: the Ordem Premier League. ===Managerial changes=== Team Leaving manager Reson for Departure Date left Position in table Arriving manager Date started West Bromwich Albion Mutual consent Pre-season Tottenham Hotspur Sacked Pre- season Southampton Signed by Tottenham Pre-season Crystal Palace Mutual consent Pre-season Crystal Palace Sacked 18th West Bromwich Albion Sacked 16th Newcastle United Signed by Crystal Palace 10th 26 January 2015 Queens Park Rangers Resigned 3 February 2015 19th ==Season statistics== ===Scoring=== ====Top scorers==== Rank Player Club Goals 1 Diego Costa Chelsea 27 2 Sergio Agüero Manchester City 14 3 Charlie Austin Queens Park Rangers 13 4 Alexis Sánchez Arsenal 12 5 Harry Kane Tottenham Hotspur 10 6 Saido Berahino West Bromwich Albion 9 Wilfried Bony Swansea City Papiss Cissé Newcastle United Christian Eriksen Tottenham Hotspur Robin van Persie Manchester United ====Hat-tricks==== Player For Against Result Date Chelsea Swansea City 4–2 4 Manchester City Tottenham Hotspur 4–1 Queens Park Rangers West Bromwich Albion 3–2 Stoke City Queen's Park Rangers 3–1 4 Player scored 4 goals ===Clean sheets=== Rank Player Club Clean sheets 1 Fraser Forster Southampton 10 2 Łukasz Fabiański Swansea City 9 3 Ben Foster West Bromwich Albion 8 4 Thibaut Courtois Chelsea 7 David de Gea Manchester United Brad Guzan Aston Villa Joe Hart Manchester City Simon Mingolet Liverpool 9 Tim Krul Newcastle United 6 Hugo Lloris Tottenham Hotspur Costel Pantilimon Sunderland ===Discipline=== ====Player==== *Most yellow cards: 9 **Lee Cattermole (Sunderland) *Most red cards: 2 **Paul Konchesky (Leicester City) **Kyle Naughton (Tottenham Hotspur) ====Club==== *Most yellow cards: 58 **Sunderland *Most red cards: 5 **Aston Villa **Swansea City ==Awards== ===Monthly awards=== Month Manager of the Month Player of the Month Reference Manager Club Player Club August Garry Monk Swansea City Diego Costa Chelsea September Ronald Koeman Southampton Graziano Pellè Southampton October Sam Allardyce West Ham United Diafra Sakho West Ham United November Alan Pardew Newcastle United Sergio Agüero Manchester City December Manuel Pellegrini Manchester City Charlie Austin Queens Park Rangers January Ronald Koeman Southampton Harry Kane Tottenham Hotspur February Tony Pulis West Bromwich Albion Harry Kane Tottenham Hotspur March Arsène Wenger Arsenal Olivier Giroud Arsenal April Nigel Pearson Leicester City Christian Benteke Aston Villa ==References== ==Other websites== * Official website 2014-15 Category:2014 in association football Category:2015 in association football",
 "title": "2014–15 Premier League"
}