{
 "id": "460586",
 "text": "Ganesha Chaturthi is the 10 day-long Hindu festival held on the birthday of the Lord Ganesha. He is the son of Shiva and Parvati.Shobhna Gupta, Festivals of India (New Delhi : Har-Anand Publishing, 2002), p. 54 It is celebrated all over India. The festival is held on shukla chaturthi in the Hindu month of Bhaadrapada and ends on Anant chaturdashi. For example in 2022 it will be celebrated on August 31th. It is celebrated widely in Maharashtra. On this occasion people make special \"modaks\" which are loved by Lord Ganesha. Lalbaug is a place that every year celebrates Ganesh Chaturthi on a large scale. There are Ganesha's form like Bal Ganesh, Lalbaugchya Raja, Siddhivinayak Maharaj, and Dhagru Sheth. The most popular ones are: Shreemant Dagdusheth Halwai Ganpati Mandir and Lalbaugcha Raja. == Overview == Ganesh Chaturthi is also called Vinayaka Chaturthi, it is a pure Hindu festival, during this festival people pray Lord Ganesha with great devotion. In this occasion people keep their clay idols privately in their homes, or publicly on big pandals (or temporary stages or altars). It starts with Vedic hymns, prayers, vrata and hindu texts such as Ganesha Upanishad. Offerings of prasada after the prayer and distributing amongst the community people, prasad include sweets, modaka (it is believed to be the favourite sweet of ganesha). This festival starts on the fourth day of Hindu luni-solar calendar month Bhadrapada, which normally falls in the month of August or September. The Ganesha chaturthi ends on the tenth day. Celebrations include four stages of rituals: # Pranapratistha - It involves the positioning of the idol or deity of Lord Ganesha into the pandals. This calls for a big celebration. People pray and sing various folk songs while bringing the deity to the Pandals. They play with colours as well. # Shodasopachara - It involves praying to the lord and offering him puja. # Uttarpuja. It involves a ceremony after which the deity can be moved from his position. After this ritual, the idol is moved among the public so that they can take his blessings. Ganpati Visarjan. At this stage, the idol is immersed into the river, sea or ocean. He is believed to go back to Lord Shiva and Goddess Parvati after the immersion. ==References== Category:Hindu festivals",
 "title": "Ganesh Chaturthi"
}