{
 "id": "460627",
 "text": "Paweł Marek Huelle (10 September 1957 – 27 November 2023) was a Polish author, critic, journalist and university lecturer. He was born in Gdańsk, Poland. == Career == Huelle studied philology (language) at Gdańsk University. After that, he was the press secretary for Solidarity (Solidarnosc). He also taught various subjects at schools in Gdansk at the same time. Later he worked as the director of the Gdańsk Polish Television Center. His first novel was Weiser Dawidek. It was published in 1987. It made him famous in Poland. It is about five young friends in Gdańsk. Polish literary critics called it a masterpiece and the most important Polish literary work of the decade. \"Once one begins reading Weiser Dawidek, the book can hardly be put down. Like Opowiadania, it is written with undeniably great talent.\"Jerzy J. Maciuszko, 'Reviewed Work: Weiser Dawidek by Paweɫ Huelle', World Literature Today, Vol. 67, No. 2 (Spring, 1993), p. 407 Huelle was the Polish winner of the Samuel-Bogumil- Linde-Preis for 2005. Most of Huelle's stories are set in Gdańsk. He says that city is \"full of all kinds of ghosts. I'm not saying it's beautiful or wonderful in any way – but it's strange.\" Huelle has also published several short storiesHarold B. Segel, The Columbia Guide to the Literatures of Eastern Europe Since 1945 (New York; Chichester: Columbia University Press, 2003), p. 229 He died in Gdańsk aged 66 on 27 November 2023. ==Publications== *Weiser Dawidek (1987), * Opowiadania na czas przeprowadzki (1991), * Wiersze (1994), * Pierwsza miłość i inne opowiadania (1996), * Inne historie (1999), * Mercedes-Benz. Z listów do Hrabala (2001), * Byłem samotny i szczęśliwy (2002), * Castorp (2004), * Ostatnia Wieczerza (2007), * Opowieści chłodnego morza (2008), * Śpiewaj ogrody (2014). == References == == Other websites == * Paul Huelle: Danzig, my love (translated to English) Category:1957 births Category:2023 deaths Category:Literary critics Category:Polish journalists Category:Writers from Gdańsk",
 "title": "Paweł Huelle"
}