{
 "id": "460641",
 "text": "The following is a list of notable deaths in April 2014. * Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. ==April 2014== * April 1 - Anker Buch, 74, Danish violinist.Violinisten Anker Buch er død * April 1 - Carlos Oneto, 84, Peruvian actor and comic.Murió actor cómico Carlos Oneto ´Pantuflas´ * April 1 - Jacques Le Goff, 90, French historian, natural causes.L'historien Jacques Le Goff est mort * April 1 - Bill Mitchell, 85, Canadian hockey player (Detroit Red Wings), kidney failure.William “Red” Mitchell; 1930-2014: Toledo hockey pro was tool-die maker * April 1 - King Fleming, 91, American jazz pianist, natural causes.Jazz pianist King Fleming dead at 91 * April 1 - Merimeri Penfold, 93, New Zealand Māori language academic (University of Auckland), cancer. * April 2 - Urs Widmer, 75, Swiss author. * April 2 - Carl Epting Mundy, Jr., 78, American military officer, merkel cell carcinoma. * April 2 - Richard Brick, 68, American movie producer and business executive, esophageal cancer.R.I.P. Richard Brick * April 2 - Miloš Mikeln, 83, Slovene writer, natural causes.Miloš Mikeln 1930–2014 * April 2 - Lucy Hood, 56, American television executive, president of the Academy of Television Arts & Sciences (since 2013), cancer. * April 2 - Consuelo Moure, 67, Colombian actress, lung cancer.Murió la actriz Consuelo Moure a sus 67 años. * April 2 - Joseph Willaert, 78, Belgian painter, complications from a stroke.Schilder Joseph Willaert overleden * April 2 - Glyn Jones, 82, South African writer and actor.Glyn Jones 1931-2014 * April 3 - Tommy Lynn Sells, 49, American serial killer, execution by lethal injection. * April 3 - Paul Salamunovich, 86, American choral director and movie scorer (The Godfather), complications from West Nile virus. * April 3 - Jovan Pavlović, 78, Serbian Orthodox religion leader. * April 3 - Régine Deforges, 78, French writer, editor, director and playwright, heart attack.Mort de Régine Deforges, l'auteure de « La Bicyclette bleue » * April 3 - Arthur Smith, 93, American musician and songwriter (\"Guitar Boogie\", \"Dueling Banjos\"), natural causes. * April 3 - Máximo Cajal López, 79, Spanish diplomat.Fallece el diplomático Máximo Cajal * April 3 - Michael Prinz von Preußen, 74, German writer.Prinz Michael ist tot * April 3 - Paul Lüönd, 63, Swiss musician and politician.Zum Tod von Paul Lüönd (1950-2014) * April 3 - Virginie Korte-van Hemel, 84, Dutch politician, Deputy Minister of Justice (1982–1989).Ex-staatssecretaris Virginie Korte-van Hemel overleden * April 3 - Edvard Grimstad, 81, Norwegian politician, MP for Østfold (1989-1997), natural causes.Edvard Grimstad er død * April 3 - Fred Kida, 93, American cartoonist.Fred Kida Obituary * April 4 - Margo MacDonald, 70, Scottish politician, Parkinson's disease.Margo MacDonald MSP dies at 70 * April 4 - Kumba Ialá, 61, Bissau-Guinean politician, President (2000–2003), cardiopulmonary arrest. * April 4 - José Aguilar, 55, Cuban Olympic bronze- medalist light-welterweight boxer (1980), stroke.Fallece exboxeador cubano medallista olímpico de Moscú-1980 * April 4 - Gyula Szabó, 83, Hungarian actor.Elhunyt Szabó Gyula, a nemzet színésze * April 5 - José Wilker, 66, Brazilian movie, stage and television actor and director, heart attack. * April 5 - Peter Matthiessen, 86, American author, leukemia.Peter Matthiessen, Author and Naturalist, Is Dead at 86 * April 5 - Anja Niedringhaus, 48, German photojournalist (Associated Press), Pulitzer Prize winner (2005), shot.Anja Niedringhaus, Pulitzer Winner, Dies at 48 in Afghan Attack * April 5 - John Pinette, 50, American actor (Junior, Seinfeld, The Punisher) and comedian, pulmonary embolism.Comedian John Pinette Dead at 50 * April 5 - Wayne Henderson, 74, American jazz trombonist (The Jazz Crusaders) and record producer.Jazz legend Wayne Henderson dies at age 74 * April 6 - Peter Liechti, 63, Swiss filmmaker.Konfrontationen mit dem innern Dämon * April 6 - Mickey Rooney, 93, American actor (The Black Stallion, Babes in Arms, Night at the Museum), natural causes.Mickey Rooney, Golden Age Box Office Giant, Dies at 93 * April 6 - Mary Anderson, 96, American actress (Gone With the Wind).Mary Anderson dies at 96; actress had role in 'Gone With the Wind' * April 6 - Massimo Tamburini, 70, Italian motorcycle designer, lung cancer.Legendary Motorcycle Designer Massimo Tamburini Passes Away * April 6 - Chuck Stone, 89, American navigator, journalist and academic, Tuskegee Airman during World War II, co-founder of the NABJ, congestive heart failure. * April 6 - Liv Dommersnes, 91, Norwegian actress, natural causes.Liv Dommersnes er død * April 6 - Erzsi Kovács, 85, Hungarian pop singer and performer.Elhunyt Kovács Erzsi táncdalénekes * April 6 - Jacques Castérède, 87, French composer.Jacques Castérède est mort * April 7 - V. K. Murthy, 91, Indian movie cinematographer (Kaagaz Ke Phool, Pyaasa, Sahib Bibi Aur Ghulam).Ace cinematographer V. K. Murthy passes away * April 7 - Peaches Geldof, 25, British journalist, television presenter and model, daughter of Bob Geldof.Peaches Geldof dies aged 25 * April 7 - Frans van der Lugt, 75, Dutch Jesuit priest, shot.Syria: Dutch priest Fr van der Lugt shot dead in Homs * April 7 - George Shuffler, 88, American Hall of Fame bluegrass musician (The Stanley Brothers). * April 7 - George Dureau, 84, American painter and photographer, Alzheimer's disease.New Orleans artist George Dureau, master painter and photographer, has died * April 7 - Zeituni Onyango, 61, Kenyan- born American computer programmer, half-aunt of United States President Barack Obama, breast cancer and respiratory ailment.Zeituni Onyango, Obama’s Aunt From Kenya, Dies at 61 * April 7 - John Shirley-Quirk, 82, English bass- baritone. * April 7 - Josep Maria Subirachs, 87, Spanish Catalan sculptor and painter, Parkinson's disease.Fallece Josep Maria Subirachs, el escultor que se midió con Gaudí * April 7 - Čedo Vuković, 93, Montenegrin writer.Preminuo crnogorski književnik Čedo Vuković * April 8 - Ivan Mercep, 83, New Zealand architect (Museum of New Zealand Te Papa Tongarewa).Te Papa museum architect dies * April 8 - The Ultimate Warrior, 54, American Hall of Fame professional wrestler (WWE), heart attack.Pro wrestling legend The Ultimate Warrior dead at 54 * April 8 - Emmanuel III Delly, 86, Iraqi Chaldean Catholic prelate, Patriarch of Babylon (2003-2012).Cardinal Delly, former Chaldean patriarch, dead at 86 * April 8 - Karlheinz Deschner, 89, German writer and activist.Kirchenkritiker Karlheinz Deschner ist tot * April 8 - Fé Sciarone, 91, Dutch radio actress and comedienne.Death notice in NRC Handelsblad on 16 April 2014 * April 9 - A. N. R. Robinson, 87, Trinidadian and Tobagonian politician, Prime Minister (1986-1991), President (1997-2003).Former T&T; PM, President ANR Robinson passes away * April 9 - Norman Girvan, 72, Jamaican economist, educator, and politician, Secretary General of the Association of Caribbean States (2000-2004), fall.Professor Norman Girvan dies * April 9 - Jos Chabert, 81, Belgian politician, Minister of State (since 2009).Minister van Staat Jos Chabert overleden * April 10 - Dominique Baudis, 66, French journalist, writer and politician, Mayor of Toulouse (1983-2001), cancer.Dominique Baudis, défenseur des droits et ancien maire de Toulouse, est mort * April 10 - Jim Flaherty, 64, Canadian politician, Minister of Finance (2006-2014), heart attack.Former finance minister Jim Flaherty is dead at 64 * April 10 - Joe Dini, 85, American politician and business man, member of the Nevada House of Representatives (1967-2001). * April 10 - Sue Townsend, 68, English novelist and playwright (Adrian Mole series), stroke.BBC News - Sue Townsend, author of Adrian Mole books, dies after short illness * April 10 - Justin Marie Bomboko, 86, Congolese politician, Head of Government (1960–1961).RDC: décès d’un père de l’indépendance, Justin Bomboko * April 10 - Anatoly Sukhorukov, 78, Russian physicist.Анатолий Петрович Сухоруков * April 11 - Alfredo Alcón, 84, Argentine actor, respiratory disease. * April 11 - Jesse Winchester, 69, American musician and songwriter, cancer. * April 11 - Nandu Bhende, 58, Indian musician and actor, heart attack.Veteran Marathi musician Nandu Bhende dead * April 11 - Rolf Brem, 88, Swiss graphic artist, sculptor and illustrator.Rolf Brem ist tot * April 11 - Edna Doré, 92, British actress (EastEnders), emphysema.Edna Doré obituary * April 11 - Bill Henry, 86, American baseball player (Boston Red Sox, Cincinnati Reds), heart attack. * April 11 - Myer S. Kripke, 100, American rabbi and philanthropist, natural causes.Longtime Neb. rabbi who invested with Buffett dies * April 12 - Brita Koivunen, 82, Finnish singer.Iskelmälaulaja Brita Koivunen on kuollut * April 12 - Fred Ho, 56, American saxophonist, composer and social activist, colorectal cancer.Fred Ho, Saxophonist, Composer and Radical Activist, Dies at 56 * April 12 - Hal Smith, 82, American baseball player (St. Louis Cardinals, Pittsburgh Pirates).Ex-St. Louis Cardinals catcher Hal Smith dies in Arkansas * April 13 - Ernesto Laclau, 78, Argentine political theorist, heart attack. * April 13 - Rafał Sznajder, 41, Polish Olympic fencer (1996, 2000, 2004), heart attack.Rafał Sznajder nie żyje. Prawdopodobnie miał atak serca * April 13 - Peter Drummond-Murray of Mastrick, 84, Scottish herald and banker, illness. * April 14 - Brian Harradine, 79, Australian politician, stroke.Brian Harradine, Australia's longest-serving senator, dies in Tasmania aged 79 * April 14 - Armando Peraza, 89, Cuban-born American Latin jazz percussionist, pneumonia. * April 14 - Mick Staton, 74, American politician, member of the U.S. House of Representatives serving West Virginia's 3rd District (19811983). * April 14 - Albert Manent, 83, Spanish writer.Muere Albert Manent, Premi d'Honor de les Lletres Catalanes. * April 14 - Manuel Ortega, 92, Spanish painter.El pintor madrileño Manuel Ortega fallece a los 92 años. * April 15 - Sir Owen Woodhouse, 97, New Zealand judge, member of the Supreme Court, President of the Court of Appeal (1981-1986), natural causes.Owen Woodhouse dies, aged 97 * April 15 - Shane Gibson, 35, American guitarist (Korn, stOrk), complications from a blood clotting disorder.Former KORN Touring Guitarist SHANE GIBSON dead at 35 * April 15 - Hugo Villar, 88, Uruguayan physician and politician.Falleció Hugo Villar, exdirector del Clínicas y fundador del FA * April 15 - John Houbolt, 95, American aerospace engineer (lunar orbit rendezvous), natural causes. * April 16 - Gyude Bryant, 65, Liberian politician, Chairman of the Transitional Government of Liberia (20032006). * April 16 - Aulis Rytkönen, 85, Finnish football player and manager.Finland mourns pioneering striker Rytkönen * April 16 - Jiří Načeradský, 74, Czech artist.Zemřel významný český malíř Jiří Načeradský * April 16 - Ernst Florian Winter, 90, Austrian-American historian and political scientist.Diplomatische Akademie Wien trauert um Gründungsdirektor Prof. Ernst Florian Winter * April 16 - Albert André, 84, German Roman Catholic priest.Piesbach trauert um Monsignore Albert André * April 17 - Karpal Singh, 74, Malaysian politician, PM of Bukit Gelugor (2004-2014), traffic collision.Karpal Singh, 74, dies in car accident * April 17 - Cheo Feliciano, 78, Puerto Rican composer and singer, traffic collision.Salsa Great Cheo Feliciano Dies in Car Crash at 78 * April 17 - Gabriel García Márquez, 87, Colombian author, journalist, and screenwriter, awarded Nobel Prize for Literature (1982), pneumonia.Gabriel García Márquez, literary pioneer, dies at 87 * April 17 - Henry Maksoud, 85, Brazilian businessman, cardiac arrest.Morre em SP o empresário Henry Maksoud * April 18 - Dylan Tombides, 20, Australian association footballer (West Ham United), testicular cancer.Young Australian forward Dylan Tombides dies of cancer * April 18 - Brian Priestman, 87, British maestro and conductor (Denver Symphony Orchestra).Brian Priestman, 87, former Denver Symphony conductor * April 18 - Derek Cooper, 88, British broadcaster and food journalist, Parkinson's disease.The Food Programme founder Derek Cooper dies, aged 88 * April 18 - Andrew Sessler, 85, American physicist and academic (University of California, Berkeley), winner of the Enrico Fermi Award (2013), cancer.Former Berkeley lab director Sessler dies at 85 * April 19 - Sonia Silvestre, 61, Dominican singer and announcer, heart failure from stroke.Dominican singer Sonia Silvestre dies at 61 * April 19 - Frits Thors, 104, Dutch journalist and news anchor, natural causes.Oud-Journaallezer Thors overleden * April 19 - Mimi Kok, 80, Dutch actress, lung disease.Actrice Mimi Kok (80) overleden * April 19 - Deon Jackson, 68, American soul singer and songwriter. * April 19 - Luciano do Valle, 66, Brazilian sports commentator.Morre o locutor esportivo Luciano do Valle * April 20 - Neville Wran, 87, Australian politician, Premier of New South Wales (1976-1986), dementia.Neville Wran: former New South Wales premier dies aged 87 * April 20 - Peter Scoones, 76, British underwater photographer.Peter Scoones - obituary * April 20 - Rubin Carter, 76, American middleweight boxer, was wrongfully convicted of murder, prostate cancer.Rubin ‘Hurricane’ Carter dead at 76 * April 20 - Benedikt Sarnov, 87, Russian writer and literary critic.В Москве скончался литературовед, литературный критик Бенедикт Сарнов * April 20 - Alistair MacLeod, 77, Canadian novelist, short story writer and academic, stroke. * April 21 - Win Tin, 85, Burmese journalist and political prisoner, renal failure.Anti-junta Myanmar journalist Win Tin dies at 85 * April 21 - Alexander Lenkov, 70, Russian actor, People's Artist of Russia (1997).Умер актер Александр Леньков * April 21 - Herb Gray, 82, Canadian politician, Deputy Prime Minister (1997-2002).Former deputy PM Herb Gray dies at 82 * April 21 - Janet Gray Hayes, 87, American politician, Mayor of San Jose, California (1975-1983), stroke.San Jose's first female mayor, Janet Gray Hayes, has died at 87 * April 21 - Lionel Heinrich, 80, Canadian ice hockey player (Boston Bruins).Obituary for Lionel Heinrich * April 21 - Arlene McQuade, 77, American actress (The Goldbergs, Touch of Evil), Parkinson's disease.Arlene McQuade, Daughter on 1950s Sitcom 'The Goldbergs,' Dies at 77 * April 21 - Mundo Earwood, 61, American country music singer-songwriter, pancreatic cancer. * April 22 - Alfonso Márquez de la Plata, 80, Chilean politician, Minister of: Agriculture (1977-1980) and General Government (1983-1984), pneumonia.Esta mañana falleció ex ministro de gobierno de Pinochet, Alfonso Márquez de la Plata * April 22 - Oswaldo Vigas, 87, Venezuelan painter.Falleció el artista plástico carabobeño Oswaldo Vigas * April 22 - Ricardo Mórtola, 63, Ecuadorian architect, respiratory arrest complicated by testicular cancer.Ricardo Mórtola, arquitecto de megaobras, falleció ayer. * April 22 - George H. Heilmeier, 77, American engineer businessman.The George H. Heilmeier Faculty Award for Excellence in Research * April 23 - Mark Shand, 62, British travel writer and conservationist, brother of Camilla, Duchess of Cornwall, injuries from a fall.Camilla's Brother Dies Of Head Injury After Fall * April 23 - Michael Glawogger, 54, Austrian movie director, malaria.Filmemacher Michael Glawogger gestorben * April 23 - Connie Marrero, 102, Cuban baseball player, oldest former Major League Baseball player.Cuban hurler Conrado 'Connie' Marrero, oldest living former MLB player, dies just shy of 103 * April 24 - Tadeusz Różewicz, 92, Polish poet and playwright. * April 24 - Hans Hollein, 80, Austrian architect (Museum für Moderne Kunst, Haas House), winner of the Pritzker Architecture Prize (1985), pneumonia.Architekt Hans Hollein gestorben * April 24 - Shobha Nagi Reddy, 46, Indian politician, Andhra Pradesh MLA for Allagadda (since 1996), car accident.YSR Congress MLA Shobha Nagi Reddy succumbs to road accident injuries * April 24 - Arturo Licata, 111, Italian supercentenarian, world's oldest verified man, long-illness.Morto a Enna a 111 anni Arturo Licata, uomo piu' vecchio al mondo * April 24 - Ricardo Bauleo, 67, Argentine actor, heart failure.A los 67 años, murió el actor Ricardo Bauleo * April 24 - Konstantin Orbelyan, 85, Armenian-American composer and conductor.Famous Armenian composer Konstantin Orbelian died in Los Angeles at 86 * April 24 - Sandy Jardine, 65, Scottish association footballer (Rangers, Hearts, national team), liver cancer.Sandy Jardine: Rangers and Scotland great dies aged 65 * April 25 - Tito Vilanova, 45, Spanish football player and coach (FC Barcelona), throat cancer.Tito Vilanova dies: Ex-Barcelona coach loses cancer battle aged 45 * April 25 - Stanko Lorger, 83, Slovenian Yugoslav Olympic hurdler (1952, 1956, 1960).Umrl Stanko Lorger, prvi Slovenec med atletsko elito * April 25 - Earl Morrall, 79, American football player (Baltimore Colts, Detroit Lions, Miami Dolphins), Parkinson's disease. * April 25 - Stefanie Zweig, 81, German writer (Nowhere in Africa).Stefanie Zweig († 81) tot * April 26 - Antonio Pica, 83, Spanish actor, illness.Fallece el galán Antonio Pica * April 26 - DJ Rashad, 35, American footwork disc jockey, drug overdose. * April 26 - Sandro Lopopolo, 74, Italian Olympic silver- medalist light welterweight boxer (1960).Pugilato, è morto Sandro Lopopolo. Fu argento olimpico * April 27 - Vujadin Boškov, 82, Serbian footballer and football coach.Preminuo legendarni Vujadin Boškov * April 27 - Andréa Parisy, 78, French actress.Andréa Parisy, actrice dans \"La Grande Vadrouille\", est morte * April 27 - Yigal Arnon, 84, Israeli lawyer.עו\"ד יגאל ארנון הלך לעולמו בגיל 84 * April 27 - Harry Firth, 96, Australian racing driver and team manager, natural causes.MOTORSPORT Harry 'The Fox' Firth dies at 96 * April 28 - Jack Ramsay, 89, American Hall of Fame basketball coach (Portland Trail Blazers), cancer.Hall of Fame coach Jack Ramsay dies * April 28 - Idris Sardi, 75, Indonesian violinist and composer.Idris Sardi dies aged 76 * April 28 - Edgar Laprade, 94, Canadian ice hockey player (New York Rangers), natural causes.Edgar Laprade dies at 94 * April 28 - Dennis Kamakahi, 61, American Grammy Award-winning musician, lung cancer. * April 28 - Ryan Tandy, 32, Australian rugby league player, involved in match-fixing scandal, drug overdose.Former NRL player Ryan Tandy dead at 32 * April 29 - Iveta Bartošová, 48, Czech singer, three-time winner of Zlatý slavík (1986, 1990, 1991), suicide by train.Iveta Bartošová spáchala sebevraždu, skočila pod vlak * April 29 - Tahar Chaïbi, 68, Tunisian footballer (Club Africain), complications from a stroke.Club Africain : Décès de Tahar Chaibi * April 29 - Al Feldstein, 88, American writer and editor.Al Feldstein, Who Headed Mad Magazine, Dies * April 29 - Michael Kadosh, 74, Israeli football player and manager, cancer.הלך לעולמו מאמן הכדורגל מיכאל לופא קדוש * April 29 - Norma Pons, 70, Argentine actress and showgirl, heart attack.Murió la actriz Norma Pons * April 29 - Walter Walsh, 106, American FBI agent and Olympic shooter, oldest Olympic competitor ever.Walter Walsh, oldest Olympian, dies days shy of 107th birthday * April 29 - M. V. Devan, 86, Indian artist and academic.Artist M.V. Devan passes away * April 29 - Bob Hoskins, 71, British actor (Who Framed Roger Rabbit, The Long Good Friday, A Christmas Carol), pneumonia.Actor Bob Hoskins dies aged 71 * April 29 - Reuven Feuerstein, 92, Romanian–born Israeli psychologist.Professor Reuven Feuerstein: A personal remembrance from a very grateful mother * April 29 - Edgars Vinters, 94, Latvian painter.Mūžībā aizgājis gleznotājs Edgars Vinters * April 30 - Ian Ross, 73, Australian television news presenter, pancreatic cancer.Television newsreader Ian Ross dead at 73 * April 30 - Chris Harris, 71, British actor (Into the Labyrinth), cancer. * April 30 - Ralph Nattrass, 88, Canadian ice hockey player (Chicago Black Hawks).Ralph Nattrass ==See more months== * Deaths in January 2014 * Deaths in February 2014 * Deaths in March 2014 * Deaths in May 2014 * Deaths in June 2014 * Deaths in July 2014 * Deaths in August 2014 * Deaths in September 2014 * Deaths in October 2014 * Deaths in November 2014 * Deaths in December 2014 ==References== *04 Category:April 2014 events",
 "title": "Deaths in April 2014"
}