{
 "id": "460636",
 "text": "The following is a list of notable deaths in January 2014. * Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. ==January 2014== * January 1 - Juanita Moore, 99, American actress (Imitation of Life), natural causes. * January 1 - Herman Pieter de Boer, 85, Dutch writer, lyricist, and journalist, long- illness.Herman Pieter de Boer overleden * January 1 - Billy McColl, 62, Scottish actor (Doctor Who). * January 1 - Cal Swenson, 65, Canadian ice hockey player (Winnipeg Jets).Calvin SWENSON Notice * January 2 - Elizabeth Jane Howard, 90, English novelist, natural causes. * January 2 - Dirk Sager, 73, German journalist, stroke.ZDF trauert um Reporter Dirk Sager * January 2 - Bernard Glasser, 89, American movie producer, natural causes. * January 2 - Thomas Kurzhals, 60, German rock musician (Stern-Combo Meißen, Karat), liver cirrhosis.Thomas Kurzhals im Alter von 60 Jahren gestorben * January 2 - Harald Nugiseks, 92, Estonian war veteran and anti-communism activist.Suri Harald Nugiseks * January 3 - George Goodman, 83, American economics commentator, myelofibrosis. * January 3 - Phil Everly, 74, American singer and musician (The Everly Brothers), lung disease. * January 3 - Alicia Rhett, 98, American actress (Gone with the Wind) and portrait painter, natural causes. * January 3 - Leon de Wolff, 65, Dutch journalist and media consultant, multiple system atrophy.Journalist Leon de Wolff overleden * January 3 - Saul Zaentz, 92, American movie producer (One Flew over the Cuckoo's Nest) and music executive, Alzheimer's disease. * January 4 - Sergey Kozlov, 53, Russian footballer and coach, heart attack.Ушел из жизни игрок хабаровского «СКА» и «Океана» из Находки Сергей Козлов * January 5 - Eusébio, 71, Portuguese footballer, top goalscorer at the 1966 World Cup, heart failure. * January 5 - Carmen Zapata, 86, American actress. * January 5 - Alma Muriel, 62, Mexican actress, heart attack.Muere la actriz Alma Muriel, a los 62 años * January 5 - Sissel Sellæg, 85, Norwegian actress.Sissel Sellæg * January 5 - Mogens E. Pedersen, 85, Danish journalist.Mogens E. Pedersen er død * January 5 - Simon Hoggart, 67, British journalist, pancreatic cancer. * January 5 - Jerry Coleman, 89, American baseball player, manager and broadcaster (Yankees, Padres) and Marine aviator, complications from brain bleeding and surgery. * January 6 - Karel Gut, 86, Czech ice hockey player and manager, member of the International Ice Hockey Federation Hall of Fame.Český hokej přišel o velkou osobnost, ve věku 86 let zemřel Karel Gut * January 6 - Larry D. Mann, 91, Canadian-American actor (Gunsmoke), Alzheimer's disease. * January 6 - Lena Smedsaas, 62, Swedish journalist, cancer.TV-profilen Lena Smedsaas är död * January 6 - Mónica Spear, 29, Venezuelan actress, murder by shooting. * January 6 - Don Ward, 78, Canadian ice hockey player (Chicago Black Hawks, Boston Bruins). * January 7 - Run Run Shaw, 107, Hong Kong actor, comedian, and philanthropist, natural causes. * January 8 - Selçuk Uluergüven, 73, Turkish actor, cancer. * January 9 - Dale T. Mortensen, 74, American economist, winner of the Nobel Prize in Economics (2010), stroke. * January 9 - Josep Maria Castellet, 87, Spanish writer, publisher and editor, pneumonia.Mor l'editor, escriptor i crític literari Josep Maria Castellet als 87 anys * January 9 - Lorella De Luca, 73, Italian actress, brain tumour. * January 9 - Amiri Baraka, 79, American poet, writer and activist, surgical complications. * January 9 - Lorella De Luca, 73, Italian actress, heart failure.Addio a Lorella De Luca, Recitò in “Poveri ma belli” * January 9 - Cliff Carpenter, 98, American actor, natural causes. * January 10 - Zbigniew Messner, 84, Polish politician, Prime Minister (1985-1988), heart attack. * January 10 - Allard van der Scheer, 85, Dutch actor, lung cancer.Kluchtacteur Allard van der Scheer (85) overleden * January 10 - Larry Speakes, 74, American journalist, White House Press Secretary (1981–1987), Alzheimer's disease. * January 10 - Marly Marley, 75, Brazilian vedette and actress, pancreatic cancer.Morre a atriz Marly Marley, ex-jurada do \"Programa Raul Gil\" * January 11 - Vugar Gashimov, 27, Azerbaijani chess player, brain tumor.Умер трехкратный чемпион Азербайджана по шахматам Вугар Гашимов * January 11 - Ariel Sharon, 85, Israeli politician, Prime Minister (2001-2006), heart failure. * January 11 - Arnoldo Foà, 97, Italian movie actor, respiratory failure.Morto Arnoldo Foà, grande artista, attore e poeta: aveva 97 anni * January 11 - Keiko Awaji, 80, Japanese actress, esophageal cancer.女優の淡路恵子さん死去 * January 11 - Joe Junkin, 67, Canadian ice hockey player (Boston Bruins), cancer.Joe Junkin Passes Away * January 11 - Muhammad Habibur Rahman, 85, Bangladeshi jurist and politician, Prime Minister (1996), pneumonia. * January 12 - Alexandra Bastedo, 67, British actress (The Champions) and activist, cancer. * January 12 - Frank Marth, 91, American actor (The Honeymooners), congestive heart failure and Alzheimer’s disease. * January 12 - John Horsley, 93, British actor, prostate cancer. * January 12 - John Button, 70, British racing driver, heart attack. * January 13 - Menachem Zilberman, 67, Israeli comedian and songwriter, heart attack. * January 13 - Anjali Devi, 86, Indian actress and movie producer, multiple organ failure. * January 13 - Mihai Fotino, 83, Romanian actor, heart attack.Actorul Mihai Fotino a murit la vârsta de 83 de ani * January 14 - Juan Gelman, 83, Argentine poet, winner of the Miguel de Cervantes Prize (2007), heart failure. * January 14 - Eric Paterson, 84, Canadian Olympic champion ice hockey player (1952).Three legends pass away * January 14 - Mae Young, 90, American wrestler, long-illness.Pro wrestling legend Mae Young dead at age 90 * January 15 - John Dobson, 98, American astronomer, natural causes. * January 15 - Jon Bing, 69, Norwegian writer and legal scholar, stroke.Jon Bing er død * January 15 - Tor Milde, 61, Norwegian journalist and writer.Tor Milde er død * January 15 - Cassandra Lynn, 34, American model (Playboy), cocaine and alcohol overdose. * January 16 - Roger Lloyd-Pack, 69, English actor (Doctor Who), pancreatic cancer. * January 16 - Ruth Duccini, 95, American actor (The Wizard of Oz), natural causes. * January 16 - José Sulaimán, 82, Mexican boxing official, heart attack. * January 16 - Russell Johnson, 89, American actor (Gilligan's Island, The Twilight Zone), kidney failure. * January 16 - Dave Madden, 82, American actor (The Partridge Family), congestive heart and kidney failure. * January 16 - Hiroo Onoda, 91, Imperial Japanese Army World War II intelligence officer, did not surrender until 1974.Hiroo Onoda, Japanese soldier who hid in Philippine jungle for 29 years, dies at 91 * January 17 - Suchitra Sen, 82, Indian actress, heart attack. * January 17 - Mohammed Burhanuddin, 98, Indian Islamic leader, heart attack.Dr Sayedna Burhanuddin no more, pal (sic) of gloom descends on Dawoodi Bohras in Surat * January 17 - Sunanda Pushkar, 51, Indian-Canadian businesswoman and entrepreneur, suicide by drug overdose. * January 17 - Francine Lalonde, 73, Canadian politician, MP for Mercier (1993–2004) and La Pointe-de-l'Île (2004-2011), cancer.L'ex-députée bloquiste Francine Lalonde est décédée * January 18 - Komla Dumor, 41, Ghanaian journalist and news presenter (BBC World News), cardiac arrest. * January 18 - Milan Kajkl, 63, Czech Olympic silver-medalist ice hockey player (1976). * January 18 - Sarah Marshall, 80, English actress, cancer. * January 18 - Dennis Frederiksen, 62, American rock singer (Angel, Le Roux, Toto), liver cancer. * January 19 - Azaria Alon, 95, Israeli environmentalist, natural causes. * January 19 - Christopher Chataway, 82, British runner and politician, cancer. * January 19 - Bert Williams, 93, English footballer (Wolverhampton Wanderers, England national team), natural causes. * January 19 - Steven Fromholz, 68, American entertainer, singer and songwriter, accidental shooting. * January 20 - Claudio Abbado, 80, Italian conductor, prostate cancer.È morto Claudio Abbado, il rivoluzionario del podio * January 20 - Vern Benson, 89, American baseball player (St. Louis Cardinals) and manager (Atlanta Braves), natural causes. * January 21 - Manfred Bleskin, 64, German journalist and television news moderator.Trauer bei n-tv: Manfred Bleskin ist tot * January 21 - Georgi Slavkov, 55, Bulgarian footballer, heart attack. * January 21 - Warren Lamb, 90, English management consultant. * January 22 - Akkineni Nageswara Rao, 90, Indian actor and movie producer, cancer. * January 22 - François Deguelt, 81, French singer, heart failure. * January 22 - Kaleph Jõulu, 86, Estonian educator, writer and folklore collector.Lahkus õpetaja ja rahvaluulekoguja Kaleph Jõulu * January 23 - Riz Ortolani, 87, Italian movie composer, pneumonia.Si è spento Riz Ortolani * January 23 - Violetta Ferrari, 83, Hungarian actress.A világhírű magyar színésznőt gyászolja a szakma! Meghalt Ferrari Violetta * January 23 - Khin Yu May, 76, Burmese actress and singer.Khin Yu May obit * January 24 - Shulamit Aloni, 85, Israeli politician, leader of the Meretz party. * January 25 - Dave Strack, 90, American basketball player and coach (Michigan Wolverines), natural causes. * January 26 - José Emilio Pacheco, 74, Mexican poet, essayist, and novelist, cardiac arrest.Muere escritor mexicano José Emilio Pacheco por paro cardiorespiratorio * January 26 - Margery Mason, 100, English actress (The Princess Bride, Harry Potter and the Goblet of Fire, Love Actually). * January 26 - Paula Gruden, 92, Australian poet and translator, natural causes.V Avstraliji se je poslovila slovenska pesnica Pavla Gruden * January 27 - Pete Seeger, 94, American folk singer and songwriter, natural causes. * January 27 - Edmond Classen, 75, Dutch actor, heart failure.Acteur Edmond Classen overleden * January 28 - Jorge Obeid, 66, Argentine politician, Governor of Santa Fe (1995–1999, 2003–2007), pulmonary embolism.Falleció el diputado y ex gobernador de Santa Fe Jorge Obeid * January 28 - Dwight Gustafson, 83, American composer and conductor. * January 29 - Lars Andreas Larssen, 78, Norwegian actor, Alzheimer’s disease. Skuespilleren Lars Andreas Larssen er død * January 29 - François Cavanna, 90, French author and satirical newspaper editor, natural causes.François Cavanna, mort d'un * January 29 - Aïché Nana, 78, Turkish showgirl and actress, illness.Morta a 78 anni Aiché Nanà Addio alla ballerina della Dolce vita * January 30 - Krzysztof Birula- Białynicki, 69, Polish Olympic ice hockey player (1972).Bialynicki-Birula passes away * January 30 - Jack Stoddard, 87, Canadian ice hockey player (New York Rangers). * January 30 - The Mighty Hannibal, 74, American singer, songwriter and record producer. * January 30 - Arthur Rankin, Jr., 89, American animator, director, producer, and writer. * January 31 - Abdirizak Haji Hussein, 90, Somali politician, Prime Minister (1964–1967), pneumonia. * January 31 - Nina Andrycz, 101, Polish actress and poet. * January 31 - Miklós Jancsó, 92, Hungarian director and screenwriter. * January 31 - Christopher Jones, 72, American actor and former lover of Sharon Tate, cancer. ==See more months== * Deaths in February 2014 * Deaths in March 2014 * Deaths in April 2014 * Deaths in May 2014 * Deaths in June 2014 * Deaths in July 2014 * Deaths in August 2014 * Deaths in September 2014 * Deaths in October 2014 * Deaths in November 2014 * Deaths in December 2014 ==References== *01 Category:January 2014 events",
 "title": "Deaths in January 2014"
}