{
 "id": "460645",
 "text": "The following is a list of notable deaths in July 2014. *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. ==July 2014== * July 1 - Bob Jones, 59, British police officer, police commissioner for West Midlands Police. * July 1 - Anatoly Kornukov, 72, Soviet-born Russian military officer, commander-in-chief of the Russian Air Force (1998-2002).Скончался бывший главнокомандующий ВВС РФ Анатолий Корнуков * July 1 - Umaru Dikko, 79, Nigerian politician, stroke. * July 1 - Stephen Gaskin, 79, American counterculture figure, peace activist and commune founder (The Farm). * July 1 - Walter Dean Myers, 76, American author.Walter Dean Myers Quotes; Children's Book Author Dies At 76 * July 1 - Jean Garon, 76, Canadian politician.Former Parti Quebecois cabinet minister Jean Garon dies at 76 * July 1 - Frederick I. Ordway III, 87, American space scientist.Frederick I. Ordway III Obituary * July 1 - Graeme McMahon, 74, Australian AFL football executive, Chairman of Essendon (1996-2003), pancreatic cancer. * July 2 - Emilio Álvarez Montalván, 94, Nicaraguan ophthalmologist, Foreign Minister (1996-2001), heart attack.Fallece el doctor Emilio Álvarez Montalván * July 2 - Errie Ball, 103, Welsh-American golfer, natural causes.Errie Ball passes away at age 103 * July 2 - Chad Brown, 52, American professional poker player and actor, iposarcoma. * July 2 - Louis Zamperini, 97, American Olympic long distance runner (1936), motivational speaker, book (Unbroken) and movie figure (Unbroken), pneumonia.WWII Hero, 'Unbroken' Subject Louis Zamperini Dies at 97 * July 3 - Zalman Schachter- Shalomi, 89, Ukrainian-born American rabbi (Jewish Renewal).Rabbi Zalman Schachter-Shalomi, founder of Jewish Renewal movement, dies in Colorado * July 3 - Volkmar Groß, 66, German footballer.Trauer um Volkmar Groß * July 3 - Jini Dellaccio, 97, American photographer. * July 4 - Giorgio Faletti, 63, Italian author, actor and singer, tumor. * July 4 - Alan Alan, 87, British escapologist and magician.Obituary: Alan Alan, \"The British Houdini\" * July 4 - C. J. Henderson, 62, American horror and crime author, cancer.Welcome to the World of CJ Henderson * July 4 - Archibald Wilson, 93, Rhodesian-born Australian fighter pilot, flew for the Royal Air Force during World War II, natural causes.Passing of Air Marshal Archie Wilson * July 5 - Rosemary Murphy, 89, American actress (That Night, To Kill a Mockingbird, Mighty Aphrodite), esophageal cancer.Rosemary Murphy, 89, Emmy Winner, Dies * July 5 - Volodymyr Sabodan, 78, Ukrainian Orthodox hierarch, head of the UOC-MP (since 1992), internal bleeding. * July 6 - Alan J. Dixon, 86, American politician, United State Senator from Illinois (1981–1993), natural causes. * July 6 - Benedito de Assis da Silva, 61, Brazilian footballer (Fluminense), multiple organ failure.Eterno \"Carrasco\", ex-atacante Assis morre no Paraná, aos 61 anos * July 6 - Granville Austin, 87, American historian and academic, leading authority on the Constitution of India, awarded Padma Shri (2011).Eminent scholar of Indian Constitution, Granville Austin, is dead * July 6 - Dave Legeno, 50, British actor (Harry Potter, Batman Begins), heat stroke.‘Harry Potter’ actor found dead in ‘remote’ area * July 6 - Rogelio Polesello, 75, Argentine muralist, painter and sculptor (Op art), heart attack.Murió el artista plástico Rogelio Polesello. * July 7 - Andrew Mango, 88, Turkish-born British journalist (BBC) and biographer (Mustafa Kemal Atatürk).Atatürk biographer Andrew Mango dies * July 7 - Bora Todorović, 83, Yugoslavian-born Serbian actor (Who's Singin' Over There?, Underground, Balkan Express), complications from a stroke.Bora Todorović passed away * July 7 - Eduard Shevardnadze, 86, Soviet-born Georgian politician, President (1992-2003), Soviet Minister of Foreign Affairs (1984-1990).Fomer Georgian president, Eduard Shevardnadze dies at 86 * July 7 - Alfredo Di Stéfano, 88, Argentine-Spanish football player and coach (Real Madrid), complications following cardiac arrest.Alfredo Di Stéfano dies at the age of 88 * July 7 - Dick Jones, 87, American actor (Pinocchio), natural causes.Richard Percy Jones, Voice of “Pinocchio,” Passes Away at 87 * July 7 - Peter Underwood, 76, Australian jurist, Governor of Tasmania (since 2008), member and Chief Justice of the Supreme Court of Tasmania, kidney cancer.Peter Underwood, Tasmania Governor, dies aged 76 following kidney surgery * July 7 - Lois Johnson, 72, American country music singer. * July 7 - Lammtarra, 22, British Thoroughbred racehorse, euthanized. * July 8 - Ben Pangelinan, 58, American-Guamanian politician, member (since 1994) and Speaker (2003–2005) of the Legislature of Guam, cancer. * July 8 - John V. Evans, 89, American politician, Governor of Idaho (1977–1987).Former Idaho Gov. John Evans dies at 89 * July 8 - Plínio de Arruda Sampaio, 83, Brazilian politician, activist, and educator, bone cancer.Corpo de ex-deputado Plínio de Arruda Sampaio é velado em São Paulo (in Portuguese) * July 9 - David Azrieli, 92, Polish-born Canadian-Israeli billionaire real estate and finance executive.David Azrieli, Canadian-Israeli billionaire and philanthropist, dies at 92 * July 9 - Luiz Alberto Dias Menezes, 63, Brazilian geologist and mineral dealer.MM Gerdau presta homenagem a Luiz Menezes * July 9 - Don Lenhardt, 91, American baseball player and coach (St. Louis Browns/Baltimore Orioles, Boston Red Sox). * July 10 - Zohra Sehgal, 102, Indian actress and choreographer, cardiac arrest.Zohra Sehgal, \"Grand Old Lady of Indian Cinema\", dies at 102 * July 10 - Robert C. Broomfield, 81, American judge, member (since 1985) and Chief Judge (1994-1999) of the U.S. District Court of Arizona, cancer.Federal Court in Arizona Mourns Passing of District Judge Robert C. Broomfield * July 11 - Charlie Haden, 76, American jazz bassist and bandleader, three-time Grammy Award winner, post-polio syndrome.RIP Charlie Haden * July 11 - Sir Howard Cooke, 98, Jamaican politician, Governor-General (1991–2006). * July 11 - John Seigenthaler, 86, American journalist and newspaper editor (The Tennessean, USA Today).Prominent editor, activist John Seigenthaler dies at 86 * July 11 - Randall Stout, 56, American architect, renal cell carcinoma.Randall Stout, Architect Tied to Nature, Dies at 56 * July 11 - Tommy Ramone, 62, Hungarian- born American Hall of Fame record producer and drummer (The Ramones), bile duct cancer.Tommy Ramone, Last Surviving Original Member of Influential Punk Band, Dies at 65 * July 11 - Carin Mannheimer, 79, Swedish author and screenwriter.Carin Mannheimer har avlidit * July 11 - Ray Lonnen, 74, British actor (Harry's Game, The Sandbaggers), cancer.My dear husband @RayLonnen has passed away peacefully today after a 3 year tussle with cancer * July 12 - Nestor Basterretxea, 90, Spanish-Basque artist.Muere escultor Nestor Basterretxea a los 90 años * July 12 - Alfred de Grazia, 94, American political scientist and author. * July 12 - Valeriya Novodvorskaya, 64, Soviet-Russian politician and dissident. Valeria Novodvorskaya ölüb * July 12 - Emil Bobu, 87, Romanian communist activist and politician, Interior Minister (1973–1975) and Labor Minister (1979–1981), heart attack. * July 12 - Kenneth J. Gray, 89, American politician, member of the U.S. House of Representatives for Illinois (1955–1974, 1985–1989).Former congressman Gray dead at 89 * July 12 - Alberto Cassano, 79, Argentine engineer and academic.Falleció el científico Alberto Cassano * July 13 - Lorin Maazel, 84, American conductor, violinist, composer and music director, complications of pneumonia.Lorin Maazel, Intense and Enigmatic Conductor, Dies at 84 * July 13 - Jan Nolten, 84, Dutch racing cyclist, brain hemorrhage.Oud-wielrenner Nolten overleden * July 13 - Nadine Gordimer, 90, South African writer (The Conservationist) and anti-apartheid activist, Nobel Prize laureate in Literature (1991).SA novelist Nadine Gordimer dies * July 13 - Gert Voss, 72, German actor, leukemia.Schauspieler Gert Voss 72-jährig gestorben * July 14 - Vange Leonel, 51, Brazilian singer, writer, feminist and LGBT activist, ovarian cancer.Morre cantora Vange Leonel aos 51 anos * July 14 - Alice Coachman, 90, American Olympic champion high jumper (1948), first black woman to win an Olympic gold medal. * July 14 - Vintage Crop, 27, Irish Thoroughbred racehorse, won Melbourne Cup (1993).Vintage Crop, the 1993 Melbourne Cup winner, has died * July 14 - Martin Richard Hoffmann, 82, American politician, Secretary of the Army (1975–1977), cancer.Martin R. Hoffmann dies; Army secretary helped guide academy through scandal * July 14 - Tom Rolf, 82, Swedish-American movie editor (Taxi Driver, The Right Stuff), problems from hip surgery.Tom Rolf, Oscar-Winning Editor of 'The Right Stuff,' Dies at 82 * July 14 - Leopoldo Verona, 82, Argentine actor.Murió Leopoldo Verona * July 15 - James MacGregor Burns, 95, American historian and political scientist, awarded Pulitzer Prize (1971) for Roosevelt: The Soldier of Freedom. * July 15 - Robert A. Roe, 90, American politician, member of the U.S. House of Representatives for New Jersey's 8th district (1969–1993).Former Rep. Robert A. Roe, longtime congressman from Passaic County, dies at age 90 * July 15 - Vilma Ferrán, 73, Argentine actress.Falleció la actriz Vilma Ferrán * July 16 - Szymon Szurmiej, 91, Polish-Jewish actor and theatre manager, natural causes.Szymon Szurmiej, Jewish actor and Polish leader, dies * July 16 - Johnny Winter, 70, American blues guitarist and three-time Grammy Award-winning producer (1978-1980).R.I.P. Johnny Winter, blues legend dead at 70 * July 16 - Heinz Zemanek, 94, Austrian computer engineer pioneer.Austrian computing pioneer Heinz Zemanek dead at 94 * July 16 - Manfred Wekwerth, 84, German theatre director (Berliner Ensemble).Der Brecht-Bewahrer * July 16 - Hans Funck, 61, German movie editor (Das Experiment, Downfall, Diana), asthma attack.'Downfall' Editor Hans Funck Dies at 61 * July 16 - Karl Albrecht, 94, German billionaire grocery executive, co-founder of Aldi.Karl Albrecht, Billionaire Co-Founder of Aldi Stores, Dies at 94 * July 17 - Elaine Stritch, 89, American actress (September, Bus Stop) and double Emmy Award-winner (Law & Order (1992), 30 Rock (2006)).Elaine Stritch, tart tongued Broadway actress, dies at 89 * July 17 - John Walton, 62, Australian actor (The Young Doctors), long-illness.Actor John Walton from The Young Doctors has died age 62 * July 17 - Otto Piene, 86, German artist.German Artist Otto Piene Dies, Aged 86 * July 17 - Henry Hartsfield, 80, American NASA astronaut and test pilot (Columbia), commander for the Discovery and Challenger missions, problems from back surgery.Astronaut Hank Hartsfield, Who Led First Flight Of Space Shuttle Discovery, Dies At 80 * July 17 - Andries P Putter, 78, South African naval officer, Chief of the South African Navy, kidney failure.Oudhoof van vloot sterf toe hart, niere ingee (in Africaans) * July 17 - Ross Burden, 45, New Zealand celebrity chef, infection from bone marrow transplant.Celebrity chef Ross Burden dies * July 17 - People killed on board Malaysia Airlines Flight 17: **Liam Davison, 56, Australian author. **Pim de Kuijer, 32, Dutch lobbyist and politician.Pim de Kuijer, my friend and Aids campaigner, killed in MH17 crash **Joep Lange, 59, Dutch doctor and researcher, President of the International AIDS Society (2002-2004). **Shuba Jaya, 38, Malaysian actress. **Willem Witteveen, 62, Dutch politician and legal scholar, member of the Senate (1999-2007, since 2013).PvdA-senator omgekomen bij crash * July 18 - Dietmar Schönherr, 88, Austrian actor and entertainer.Dietmar Schönherr ist tot * July 18 - James Govan, 64, American singer. * July 18 - João Ubaldo Ribeiro, 73, Brazilian writer, pulmonary embolism.Morre no Rio o escritor João Ubaldo Ribeiro * July 19 - Andreas Biermann, 33, German footballer, suicide.Andreas Biermann mit 33 Jahren gestorben * July 19 - Lionel Ferbos, 103, American jazz trumpeter.Jazz Trumpeter Lionel Ferbos Dies * July 19 - Ingemar Odlander, 78, Swedish journalist and news reporter (Rapport).Journalisten Ingemar Odlander har avlidit * July 19 - Paul M. Fleiss, 80, American pediatrician.Dr. Paul Fleiss dies at 80; father of 'Hollywood madam' Heidi Fleiss * July 19 - Yehuda Nir, 84, Polish-born Israeli-American psychiatrist and holocaust survivor (The Lost Childhood).Yehuda Nir, a psychiatrist and Holocaust survivor dies at 84 * July 19 - Skye McCole Bartusiak, 21, American actress (The Patriot, George Lopez), epileptic seizure. * July 19 - James Garner, 86, American actor (Maverick, The Rockford Files, The Great Escape), massive heart attack.Legendary actor James Garner dead at 86 * July 19 - John Fasano, 52, American screenwriter (Another 48 Hrs.) and director (Rock 'n' Roll Nightmare).R.I.P Writer/Director/Producer John Fasano * July 19 - David Easton, 97, Canadian political scientist.Death of David Easton * July 19 - Iring Fetscher, 92, German political scientist.Ein Humanist. Der Politologe Iring Fetscher ist gestorben * July 19 - Rubem Alves, 80, Brazilian writer, philosopher and theologian, multiple organ failure due to pneumonia.Brazilian writer Rubem Alves dies * July 20 - Kadhal Dhandapani, 71, Indian actor (Kaadhal), cardiac arrest. * July 20 - Victor G. Atiyeh, 91, American politician, Governor of Oregon (19791987), complications from renal failure.Former Oregon Governor Vic Atiyeh is dead * July 20 - Álex Angulo, 61, Spanish-Basque actor (Pan's Labyrinth, El día de la bestia), traffic collision. * July 20 - Klaus Schmidt, 61, German archaeologist (Göbekli Tepe), heart attack. * July 20 - Panna Rittikrai, 53, Thai martial arts choreographer, actor and movie director, organ failure.Panna Rittikrai, Muay Thai Action Maestro, Dead at 53 * July 21 - Kevin Skinner, 86, New Zealand rugby union player (national team). * July 21 - John M. Coyne, 97, American politician, Mayor of Brooklyn, Ohio (1948–1999).Former Mayor John Coyne of Brooklyn, 97, remembered as influential politician * July 21 - Hans- Peter Kaul, 70, German judge, member of the International Criminal Court.Curtain falls for former dissenting ICC judge * July 21 - Dan Borislow, 52, American telecommunications executive, inventor of magicJack, heart attack.Dan Borislow, Whose MagicJack Started Internet Calls, Dies at 52 * July 21 - Harald Hove, 65, Norwegian politician, heart attack.Harald Hove er død * July 22 - John Blundell, 61, British economist and policy adviser, Director General of the Institute of Economic Affairs.John Blundell, the man who helped to form the IEA, is dead * July 23 - Dora Bryan, 91, British actress (Absolutely Fabulous, Last of the Summer Wine).Family announce the death of actress Dora Bryan * July 23 - Louis Lentin, 80, Irish theatre, movie and television director.Dear Daughter director Louis Lentin dies * July 23 - Saado Ali Warsame, Somali politician and folk singer, MP, shot.Somalia MP killed in drive-by shooting * July 23 - Norman Leyden, 96, American conductor, composer and musician.Norman Leyden, the Oregon Symphony's Mr. Pops and authority on big-band music, dies at 96 * July 23 - Ariano Suassuna, 87, Brazilian writer, cardiac arrest.[ Morre aos 87 anos o escritor Ariano Suassuna ] * July 24 - Jaan Arder, 62, Estonian singer (Apelsin).Suri ansambli Apelsin laulja Jaan Arder * July 24 - Władysław Sidorowicz, 68, Polish politician, Minister of Health (1991).Zmarł Władysław Sidorowicz – senator dwóch kadencji, były minister zdrowia * July 24 - Yoo Chae-yeong, 40, South Korean singer, stomach cancer.Entertainer Yoo Chae-yeong dies of cancer * July 24 - Dale Schlueter, 68, American basketball player (Portland Trail Blazers), cancer.Dale Schlueter, an original member of Portland Trail Blazers, dies at 68 * July 25 - Çolpan İlhan, 77, Turkish actress, heart attack. * July 25 - Bel Kaufman, 103, American teacher and author (Up the Down Staircase).Bel Kaufman, Up the Down Staircase writer, dies at 103 * July 25 - Carlo Bergonzi, 90, Italian operatic tenor.Morto il tenore verdiano Carlo Bergonzi * July 26 - Oleh Babayev, 48, Ukrainian politician, Mayor of Kremenchuk (since 2010), shot.У Кременчуці застрелили мера - джерело * July 26 - Majid Nizami, 86, Pakistani newspaper journalist and editor (Nawa-i-Waqt), heart disease.Senior journalist Majid Nizami laid to rest * July 26 - Roland Verhavert, 87, Belgian movie director, heart attack.Filmregisseur Roland Verhavert is gestorven * July 26 - Charles R. Larson, 77, American naval officer, Commanding Admiral of USPACOM, Superintendent of U. S. Naval Academy (1983–1986, 1994–1998), leukemia. * July 27 - George Freese, 87, American baseball player (Pittsburgh Pirates). * July 27 - Paul Schell, 76, American politician, Mayor of Seattle (1998–2002). * July 27 - Kyozan Joshu Sasaki, 107, Japanese-born American Rinzai Zen teacher.Joshu Sasaki Dies * July 28 - Margot Adler, 68, American journalist (NPR), radio broadcaster (Hour of the Wolf, Justice Talking) and author, endometrial cancer. * July 28 - James Shigeta, 85, American actor (Flower Drum Song, Die Hard, Mulan), respiratory failure.James Shigeta, 85, Leading Man in ‘Flower Drum Song,’ Dies * July 28 - Paul D. McGowan, 67, American politician, member of the Maine House of Representatives (20122014).First-term Rep. Paul McGowan dies unexpectedly * July 28 - Theodore Van Kirk, 93, American military officer, Army Major, navigator and last surviving crew member on the Enola Gay, natural causes.Theodore Van Kirk, 93, Enola Gay Navigator, Dies * July 28 - Monty M. Wyche, 87, American judge.Monty Wyche Obituary * July 28 - Yvette Lebon, 103, French actress, natural causes.Yvette Lebon, la doyenne des actrices françaises, est morte * July 28 - Sally Farmiloe, 60, South African-born British actress (Howards' Way), breast cancer.Sally Farmiloe: Jeffrey Archer's former mistress and Howards' Way actress died aged 60 * July 29 - M. Caldwell Butler, 89, American politician, member of the U.S. House for Virginia's 6th (19721983), Virginia House of Delegates (19621971).M. Caldwell Butler dies at 89 * July 29 - Giorgio Gaslini, 84, Italian pianist and composer, complications from a fall. * July 29 - Idris Muhammad, 74, American jazz drummer.Idris Muhammad, legendary New Orleans drummer, is dead at 74 * July 29 - Péter Kiss, 55, Hungarian politician, Minister of Social Affairs (20062007), member of the National Assembly (20102014). * July 29 - Jon R. Cavaiani, 70, American NCO and prisoner of war, Army Special Forces sergeant major, awarded Medal of Honor (1974).Retired Sgt. Maj. Jon R. Cavaiani, former prisoner of war, dies at 70 * July 29 - María Antonia Iglesias, 69, Spanish writer and journalist.Muere la periodista María Antonia Iglesias * July 30 - Julio Grondona, 82, Argentine football executive, President of AFA (since 1979), aortic aneurysm.Murió Julio Humberto Grondona * July 30 - Dick Wagner, 71, American rock guitarist (The Frost, Alice Cooper, Lou Reed) and songwriter (\"Only Women Bleed\"), lung infection. * July 30 - Dick Smith, 92, American special effects make-up artist. * July 30 - Sir Peter Hall, 82, British urban planner, academic, government adviser, and writer. * July 30 - Manfred Roeder, 85, German extreme-right activist and Wehrmacht soldier.Rechtsextremist Roeder starb 85-jährig in Neukirchen * July 30 - Harun Farocki, 70, German filmmaker.Harun Farocki, Celebrated Filmmaker, Dead at 70 * July 31 - Kenny Ireland, 68, Scottish actor (Benidorm), cancer.Benidorm actor Kenny Ireland dies from cancer aged 68 * July 31 - Mukku Raju, 83, Indian Tollywood actor. * July 31 - Nabarun Bhattacharya, 66, Indian author, stomach cancer. * July 31 - Jorge Jacobson, 78, Argentine journalist, anchor of Telefe Noticias, heart attack.Murió el periodista Jorge Jacobson * July 31 - Warren Bennis, 89, American scholar and author.Warren G. Bennis, Scholar on Leadership, Dies at 89 ==See more months== *Deaths in January 2014 *Deaths in February 2014 *Deaths in March 2014 *Deaths in April 2014 *Deaths in May 2014 *Deaths in June 2014 *Deaths in August 2014 *Deaths in September 2014 *Deaths in October 2014 *Deaths in November 2014 *Deaths in December 2014 ==References== *07 Category:July 2014 events",
 "title": "Deaths in July 2014"
}