{
 "id": "460642",
 "text": "The following is a list of notable deaths in May 2014. *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. ==May 2014== * May 1 - Richard Percival Lister, 99, English author, poet, artist and metallurgist.No more birthdays. R.P.Lister. * May 1 - Assi Dayan, 68, Israeli movie director and actor.Film director, actor Assi Dayan dead at 68 * May 1 - Juan de Dios Castillo, 63, Mexican football player and coach, skin cancer.Muere Juan de Dios \"Cuate\" Castillo, ex seleccionador de Honduras * May 1 - Manfred von Richthofen, 80, German sports official, Director of the Deutscher Olympischer Sportbund (1994–2006). * May 1 - Juan Formell, 71, Cuban Grammy Award-winning musician, composer and director.Murió Juan Formell, fundador y director de los Van Van * May 1 - Georg Stollenwerk, 83, German football player and coach (1. FC Köln). Ex-Nationalspieler 1. FC Köln trauert um Georg Stollenwerk * May 1 - Mel Clark, 87, American baseball player (Philadelphia Phillies).Mel Clark obituary * May 2 - Mohammad-Reza Lotfi, 67, Iranian classical musician, cancer.محمدرضا لطفی درگذشت * May 2 - Nigel Stepney, 56, British Formula One mechanic, traffic collision.Ex-Ferrari Formula 1 mechanic Nigel Stepney killed in road accident * May 2 - Žarko Petan, 85, Slovenian writer.Umrl je Žarko Petan * May 2 - Pauline Wagner, 103, American actress (King of Jazz, College Lovers) and glamour girl. * May 2 - Efrem Zimbalist, Jr., 95, American actor (Batman: The Animated Series), possible heart attack.Actor Efrem Zimbalist Jr. Dies at 95 * May 3 - Jim Oberstar, 79, American politician, member of the US House of Representatives for Minnesota's 8th District (1975–2011).Former U.S. Rep. Jim Oberstar dies at 79 * May 3 - Gary Becker, 83, American economist, laureate of the Nobel Prize in Economics (1992).Gary Becker, Who Applied Economics to Social Study, Dies at 83 * May 4 - Dick Ayers, 90, American comic book artist and cartoonist.Dick Ayers Dies, Just After His Ninetieth Birthday * May 4 - Elena Baltacha, 30, British tennis player, liver cancer. * May 4 - Edgar Cortright, 90, American scientist and engineer, stroke.Obituary: Dr. Edgar Cortright * May 4 - Helga Königsdorf, 75, German physicist and author, Parkinson's disease.Professorin und Publizistin: DDR-Schriftstellerin Helga Königsdorf ist tot * May 4 - Ross Lonsberry, 67, Canadian hockey player (Philadelphia Flyers, Los Angeles Kings, Pittsburgh Penguins), cancer.Former King, Flyer Ross Lonsberry dies at 67 * May 4 - Tatiana Samoilova, 80, Soviet actress, complications from a heart condition.Soviet Film Star Tatiana Samoilova Dies at 80 * May 5 - Eduardo Mac Entyre, 85, Argentine artist.Fallece a los 85 años el artista Eduardo Mac Entyre * May 5 - Billy Frank, Jr., 83, American Nisqually tribal fishing rights activist.Tribal fishing rights activist Billy Frank Jr. dies * May 5 - Butler Derrick, 77, American politician, member of the US House of Representatives for South Carolina's 3rd district (1975-1995), cancer. * May 6 - Wil Albeda, 88, Dutch politician, Minister of Social Affairs (1977–1981), member of the Senate (1966–1977, 1981–1983).Oud-politicus Wil Albeda overleden (88) * May 6 - Farley Mowat, 92, Canadian author.Farley Mowat, acclaimed Canadian author, dead at 92 * May 6 - Jimmy Ellis, 74, American boxer, WBA heavyweight champion (1968-1970), dementia.Jimmy Ellis, Ali’s Friend Who Won Boxing Crown, Dies at 74 * May 6 - Leslie Thomas, 83, Welsh writer (The Virgin Soldiers, Dangerous Davies).Virgin Soldiers author Leslie Thomas dies aged 83 * May 7 - Nazim Al-Haqqani, 92, Cypriot Islamic Sufism prelate and scholar, multiple organ failure.Sheik of Lefka has died * May 7 - Raúl Baca Carbo, 82, Ecuadorian engineer and politician.Muere político Raúl Baca Carbo. * May 7 - Ramón Vega Hidalgo, 80, Chilean military officer and politician, Commander-in- chief of the Chilean Air Force (1991–1995).Muere ex comandante en jefe de la FACh que fue procesado por compra de aviones Mirage * May 7 - Manuel Jiménez de Parga, 85, Spanish politician.Muere el expresidente del Tribunal Constitucional Jiménez de Parga. * May 7 - Colin Pillinger, 70, British planetary scientist, brain haemorrhage.Colin Pillinger dies after brain haemorrhage * May 7 - Sir Neville McNamara, 91, Australian defence chief. * May 8 - Jair Rodrigues, 75, Brazilian musician and singer.Jair Rodrigues morre aos 75 anos * May 8 - Mercedes Salisachs, 97, Spanish writer.Muere la escritora barcelonesa Mercedes Salisachs. * May 8 - Nancy Malone, 79, American Emmy Award-winning producer, director (Dynasty) and actress (Naked City), leukemia-induced pneumonia.Nancy Malone, Actress, Director and Pioneering TV Exec, Dies at 79 * May 9 - Harlan Mathews, 87, American politician, Senator from Tennessee (1993–1994), brain cancer.Former U.S. Sen. and Deputy Gov. Harlan Mathews dies * May 9 - Jules Mutebusi, 54, Congolese militant. * May 9 - Patrick Lucey, 96, American politician, Governor of Wisconsin (1971-1977), United States Ambassador to Mexico (1977-1979).From governor to ambassador, Lucey guided Wisconsin, national politics * May 9 - Jorge Zavala, 91, Ecuadorian politician.Jorge Zavala Baquerizo falleció en Guayaquil a la edad de 92 años. * May 9 - Mel Patton, 89, American sprinter, double Olympic champion (1948), cancer and diabetes issues. * May 10 - Carmen Alardin, 80, Mexican poet, writer and translator.Mexican poet Carmen Alardin dies at 80 * May 10 - José Falcó Sanmartín, 97, Spanish fighter pilot.Muere a los 97 años José Falcó, uno de los ases de la aviación republicana * May 10 - Andres Carrasco, 67, Argentine neurologist, challenged Monsanto over safety of glyphosate.Argentine scientist who challenged Monsanto dies * May 10 - Lem Johns, 88, American Secret Service agent (Lyndon B. Johnson).Secret Service agent in iconic LBJ photos dies * May 11 - Martin Špegelj, 86, Croatian politician and army officer. * May 11 - Barbara Knudson, 86, American actress (Meet Danny Wilson, The Jayhawkers!, The Cry Baby Killer).BARBARA KNUDSON HENRY Obituary * May 11 - Francisco Sobrino, 82, Spanish sculptor.Fallece el escultor Francisco Sobrino. * May 11 - Reg Gasnier, 74, Australian Hall of Fame rugby league player (St. George Dragons) and national team captain.Reg Gasnier, rugby league legend, has passed away * May 12 - Cornell Borchers, 89, Lithuanian-born German actress.Gerlind Cornell Borchers-Schelkopf * May 12 - H. R. Giger, 74, Swiss Academy Award-winning artist (Alien), fall. * May 12 - Ľudovít Lehen, 88, Slovakian painter and chess composer. * May 12 - Brian Marchinko, 65, Canadian ice hockey player (Toronto Maple Leafs, New York Islanders).Brian Nickolas Wayne Marchinko * May 12 - Pál Orosz, 80, Hungarian Olympic bronze-medalist football player (1960) and coach.Elhunyt Orosz Pál, a Ferencváros örökös bajnoka . * May 12 - Sarat Pujari, 80, Indian actor, heart attack.Actor Sarat Pujari dead! * May 12 - Nash the Slash, 66, Canadian rock musician (FM). (death announced on this date) * May 13 - Máximo Alcócer, 81, Bolivian footballer.Murió Alcócer, fue campeón sudamericano * May 13 - Malik Bendjelloul, 36, Swedish Academy Award-winning documentary movie director (Searching for Sugar Man), suicide. * May 13 - Fred Dunsmore, 84, Canadian ice hockey player (Winnipeg Maroons).Fred Dunsmore * May 13 - David Malet Armstrong, 87, Australian philosopher. * May 14 - Stephen Sutton, 19, British charity fundraiser, colorectal cancer.Fundraiser Stephen Sutton dies at 19 * May 15 - Jean-Luc Dehaene, 73, Belgian politician, Prime Minister (1992–1999), fall.Former Belgian Premier Dehaene Is Dead at 73 * May 16 - Viktor Sukhodrev, 81, Soviet-born Russian interpreter (Leonid Brezhnev).Скончался личный переводчик советских руководителей Виктор Суходрев * May 16 - Albert Viaplana, 81, Spanish architect.Fallece el arquitecto Albert Viaplana, autor de la dársena de la Avenida Xoán XXIII de Santiago. * May 17 - Miss Beazley, 9, American Scottish terrier, pet of George W. Bush, euthanized due to lymphoma. * May 17 - Gerald Edelman, 84, American biologist, won the 1972 Nobel Prize in Physiology or Medicine, prostate cancer and Parkinson's disease.Gerald M. Edelman, Nobel Laureate and ‘Neural Darwinist,’ Dies at 84 * May 18 - Dobrica Ćosić, 92, Serbian writer and politician, President of the Federal Republic of Yugoslavia (1992–1993).Preminuo Dobrica Ćosić * May 18 - Jerry Vale, 83, American singer. * May 18 - Per Almar Aas, 84, Norwegian politician.Aas, Per Almar ( 1929-2014 ) * May 18 - Hans-Peter Dürr, 84, German physicist.Tod von Hans-Peter Dürr * May 18 - Gordon Willis, 82, American cinematographer (The Godfather series, Annie Hall, Manhattan).R.I.P. ‘Godfather’ DP Gordon Willis * May 18 - Kaiketsu Masateru, 66, Japanese sumo wrestler and executive, ischemic heart disease. * May 18 - Wubbo Ockels, 68, Dutch physicist and astronaut, first Dutch citizen in space, kidney cancer.Wubbo Ockels overleden * May 18 - Morris Weiss, 98, American cartoonist.Morris Weiss, R.I.P. * May 19 - Jack Brabham, 88, Australian racing driver, three times Formula One world champion. * May 19 - Antanas Šurna, 75, Lithuanian actor. * May 19 - Zbigniew Pietrzykowski, 79, Polish Olympic boxer.Zbigniew Pietrzykowski, trzykrotny medalista olimpijski w boksie, nie żyje * May 19 - Mario Missiroli, 80, Italian movie director.Teatro - È morto a Torino il regista Mario Missiroli * May 19 - Simon Andrews, 29, English motorcycle racer, head injuries from race accident.Simon Andrews: English rider dies after North West 200 crash * May 20 - Charles W. Robinson, 94, American businessman and diplomat, Deputy Secretary of State (1976–1977).Charles W. Robinson, 1919-2014 * May 20 - Arthur Gelb, 90, American newspaper editor and critic (The New York Times), complications from a stroke.Longtime New York Times Editor, Critic Arthur Gelb Dies At 90 * May 20 - Barbara Murray, 84, English actress (Passport to Pimlico, The Plane Makers), heart attack.Obituary: Barbara Murray * May 21 - Alireza Soleimani, 58, Iranian Olympic freestyle wrestler, heart attack. * May 21 - Jaime Lusinchi, 89, Venezuelan politician, President (1984–1989).Falleció el expresidente de la República, Jaime Lusinchi - Nacional y Política * May 21 - Poni Adams, 95, American actress (House of Dracula). * May 22 - Imre Gedővári, 62, Hungarian Olympic champion and bronze-medalist fencer.Elhunyt Gedővári Imre * May 23 - Joel Camargo, 67, Brazilian footballer (Santos), renal failure.Morre Joel Camargo, ex-zagueiro do Santos e campeão do mundo em 1970 * May 23 - Walter Romberg, 85, East German politician, Minister of Finance (1990).Walter Romberg gestorben * May 23 - Mona Freeman, 87, American actress.Film star Mona Freeman, typecast as teen in '40s and '50s, dies at 87 * May 24 - John Vasconcellos, 82, American politician, organ failure.John Vasconcellos, longtime Silicon Valley lawmaker dies at 82 * May 25 - Wojciech Jaruzelski, 90, Polish military officer and politician, stroke.Poland's last Communist leader Wojciech Jaruzelski dies * May 25 - Bunny Yeager, 85, American model and photographer.Pin-up photographer Bunny Yeager dies at 85 * May 25 - David Allen, 78, English cricketer.Former England spinner David Allen dies * May 25 - Herb Jeffries, 100, American jazz and traditional pop singer and actor, heart failure.Herb Jeffries, Hollywood's first black singing cowboy, dies at 100 * May 25 - Tommy Blom, 67, Swedish radio host and singer.Tommy Blom är död * May 25 - Malcolm Simmons, 68, English motorcycle speedway racer (Poole Pirates), World Team Cup Winner (1974, 1975, 1977), World Pairs Champion (1976, 1977, 1978), emphysema.Poole Pirates: Former Poole rider Malcolm Simmons dies * May 26 - Manuel Uribe, 48, Mexican man, world's third-heaviest person, liver failure.Muere Manuel Uribe, quien fuera el hombre más obeso del mundo * May 26 - Miodrag Radulovacki, 81, Serbian medical research scientist.Miodrag Radulovacki Obituary * May 27 - Helma Sanders- Brahms, 73, German movie director.Filmemacherin Helma Sanders-Brahms gestorben * May 27 - Massimo Vignelli, 83, Italian graphic designer.Massimo Vignelli, a Modernist Graphic Designer, Dies at 83 * May 28 - Maya Angelou, 86, American poet, author, and civil rights activist. * May 28 - Malcolm Glazer, 85, American real estate executive and sports franchise owner (Manchester United, Tampa Bay Buccaneers).Malcolm Glazer, Buccaneers owner, dies at age 85 * May 28 - Ciro de Quadros, 74, Brazilian physician, pancreatic cancer.Obituary: Ciro de Quadros * May 28 - Azlan Shah of Perak, 86, Malaysian royal, Yang di- Pertuan Agong (1989-1994), Sultan of Perak (since 1984), Lord President of the Supreme Court (1982-1984), Chief Justice (1979-1982).Perak Sultan and former judge Azlan Shah DIES: Legacy diminished, Perak crisis remembered * May 29 - Karlheinz Böhm, 86, Austrian actor.Actor, Philanthropist Karlheinz Bohm Dead at 86 * May 29 - Walter Jakob Gehring, 75, Swiss developmental biologist (University of Basel). * May 29 - Christine Charbonneau, 70, Canadian singer and songwriter, cancer.La chanteuse et auteure Christine Charbonneau est décédée * May 30 - Hienadz Buraukin, 77, Belarusian poet, journalist and diplomat, Ambassador to the United Nations (1990–1994), cancer.Henadz Buraukin dies * May 30 - Hanna Maron, 90, German-born Israeli actress.Hanna Maron dies * May 30 - Joan Lorring, 88, British Hong Kong-born American actress.Joan Lorring, Oscar Nominated 'Corn Is Green' Actress, Dies at 88 * May 30 - Henning Carlsen, 86, Danish Bodil Award-winning movie director (Hunger, People Meet and Sweet Music Fills the Heart).Filminstruktøren Henning Carlsen er død * May 31 - Marilyn Beck, 85, American syndicated entertainment journalist and columnist, lung cancer.Marilyn Beck, longtime TV and Hollywood newspaper columnist, dies at 85 * May 31 - Hoss Ellington, 79, American race car driver and team owner (NASCAR), cancer.Ex-NASCAR driver, owner Hoss Ellington dies at 79 * May 31 - Martha Hyer, 89, American actress.Old Hollywood actress Martha Hyer dies * May 31 - Brajanath Ratha, 78, Indian poet.Eminent Odisha poet Brajanath Ratha passes away * May 31 - Mary Soames, Baroness Soames, 91, British aristocrat.Lady Soames, Winston Churchill's last surviving child, dies aged 91 ==See more months== *Deaths in January 2014 *Deaths in February 2014 *Deaths in March 2014 *Deaths in April 2014 *Deaths in June 2014 *Deaths in July 2014 *Deaths in August 2014 *Deaths in September 2014 *Deaths in October 2014 *Deaths in November 2014 *Deaths in December 2014 ==References== *05 Category:May 2014 events",
 "title": "Deaths in May 2014"
}