{
 "id": "460614",
 "text": "Louis Philippe I (6 October 1773 — 26 August 1850) nicknamed the Citizen King (French: le Roi Citoyen) was King of the French from 1830 until he was forced to abdicate following the French Revolution in 1848. As Louis Philippe III, he was also the Duke of Orléans from 1793 to 1830 where he passed that title to his son, Philippe which became the title of the heirs to the French throne rather than going back to the traditional, Dauphin of France. Throughout his reign, Louis brought peace, stability, and prosperity to France. He started France's colonialism over the world. He conquered Algeria and Tunisia which increased France's territory, army, and navy. He also ordered the completion of the Arc de Triomphe. This increased his popularity. However, in 1848, his popularity declined because he opposed parlimentarism and that he always wanted to rule as an absolute monarch. He also started to support the rich people and care less about the poor. This broke off the French Revolution of 1848. Since there were already two major revolutions and that Louis did not want another French Revolution, he abdicated the throne and fled the country. He travelled to the UK and moved into the Claremont House in Surrey and lived there under the name \"Mr Smith\" until his death due to dysentery on 26 October 1850 at the age of 77. He started France's colonialism in Africa and North America. His conquest of Algeria, Tunisia, and North America made France significantly more powerful. Louis had some of the qualities of being a good king. He greatly expanded France. He also made France more modern. He built the Arc de Triomphe, the Luxor Obelisk in the Place de la Concorde and the July Column in the Place de la Bastille. == Early life == Born at the Palais Royal in Paris he was named Louis Philippe d'Orléans, Louis Philippe in honour of his father. His parents were the Duke and Duchess of Orléans. One of the most senior members of the French royal court. He was born a Prince of the blood which entitled him to be addressed as His Serene Highness. From birth he was given the title of Duke of Valois one of his fathers subsidiary titles. He was the eldest of four children born to the duke and duchess. He was a member of the House of Orléans, itself a cadet branch of the ruling House of Bourbon. The two branches were both directly descended from Louis XIV and were often in competition with one another. His education was carried out by Madame de Genlis who was later his fathers mistress. It was she who instilled a fairly liberal attitude within the young prince. When Louis Philippe's grandfather died in 1785, his father succeeded him as Duke of Orléans and Louis Philippe succeeded his father as Duke of Chartres. His parents had a strained marriage the Duke was famous for his many extramarital affairs and his wife just quietly accepted his infidelity. She was a notoriously religious woman who relished watching her children grow up. Louis Philippe was the eldest of four children born to the couple. Louis Philippe was very close to his brother, the younger Duke of Montpensier. In 1792 he joined the French army and went to fight in Austria. But in April 1793 he deserted. He could not return to France so he found work as a teacher in Switzerland. He then went to live in Sweden. After that he lived in the United States and finally he moved to England. After the abdication of Napoleon in 1814, Louis Philippe returned to France. King Louis XVIII gave him back his Orléans estates. ===Marriage=== In 1808, proposed to Princess Elizabeth, daughter of King George III of the United Kingdom. His Catholicism and the opposition of her mother Queen Charlotte meant the princess reluctantly declined the offer. In 1809, Louis Philippe married Princess Maria Amalia of Naples and Sicily, daughter of King Ferdinand IV of Naples and Maria Carolina of Austria. They had ten children. Maria Amalia was also a niece of the late Queen Marie Antoinette. He died on August 26, 1850 in Claremont, Surrey, England. ==Children== # Ferdinand Philippe, Duke of Orléans (3 September 1810 – 13 July 1842) married Duchess Helene of Mecklenburg-Schwerin and had children. # Louise (3 April 1812 - 11 October 1850) married Leopold I of Belgium and had children. # Marie (12 April 1813 - 6 January 1839) married Married Duke Alexander of Württemberg, had children. # Louis, Duke of Nemours (25 October 1814 – 26 June 1896) married Princess Victoria of Saxe-Coburg and Gotha and had children. # François, Prince of Joinville (14 August 1818 – 16 June 1900) married Princess Francisca of Brazil and had children. # Françoise (26 March 1816 - 20 May 1818) died young. # Clémentine (6 March 1817 – 16 February 1907) married Prince August of Saxe- Coburg and Gotha and had children. # Charles, Duke of Penthièvre (1 January 1820 – 25 July 1828) died young. # Henri, Duke of Aumale (January 16, 1822 – May 7, 1897) married Princess Carolina Augusta of the Two Sicilies and had children. # Antoine, Duke of Montpensier (31 July 1824 – 4 February 1890) married Infanta Luisa Fernanda of Spain and had children. ==Legacy== When king of the French he made his children and descendants legally able to bear the title of Prince/ss of Orléans. With the style of Royal Highness. ==Titles and styles== * 6 October 1773 – 18 November 1785 His Serene Highness The Duke of Valois. * 18 November 1785 – 6 November 1793 His Serene Highness The Duke of Chartres. * 6 November 1793 – 21 September 1824 His Serene Highness The Duke of Orléans. * 21 September 1824 – 9 August 1830 His Royal Highness The Duke of Orléans. * 9 August 1830 – 24 February 1848 His Majesty The King [of the French] * 24 February 1848 – 26 August 1850 His Majesty King Louis Philippe. == References == |- |- |- |- |- Category:1773 births Category:1850 deaths Category:People from Paris Category:House of Orléans Category:Dukes and Duchesses of Valois Category:Dukes and Duchesses of Chartres Category:Dukes and Duchesses of Orléans Category:Dukes and Duchesses of Nemours Category:Dukes and Duchesses of Montpensier Category:Kings of France Category:19th-century monarchs of France",
 "title": "Louis Philippe I"
}