{
 "id": "460719",
 "text": "Glam metal (also known as hair metal or sleaze metalSteven Blush, American hair metal (Los Angeles: Feral House, 2006), p. 8) is a subgenre of heavy metal that features pop-influenced hooks and guitar riffs. It also commonly has upbeat rock anthems, and slow power ballads. It mixes the fashion of glam rock with the sound of pop metal. Glam metal dates back to the late 1970s. It evolved from the glam rock movement of the time. The visual elements of acts such as T. Rex, the New York Dolls, and David Bowie were fused with heavy metal music such as Alice Cooper and Kiss. The first examples of this fusion took place in the the United States, most notably in the Los Angeles Sunset Strip music scene. Early glam metal bands include Mötley Crüe, Hanoi Rocks, Night Ranger, Ratt, Quiet Riot, Twisted Sister, Bon Jovi, and Dokken. Glam metal was commercially successful from about 1982 to 1991. Other bands such as Poison, Skid Row, Cinderella and Warrant rose to prominence in this timeframe. From a visual perspective, glam metal is defined by flashy, tight-fitting clothing and makeup. Overall it has an androgynous aesthetic in which the traditional \"denim & leather\" aspect of heavy metal culture is replaced by spandex, lace, and bright colours. Glam metal declined in popularity in the early 1990s. Grunge and alternative rock overtook it as the mainstream rock subgenres. Bands in these genres have a more natural and stripped-down aesthetic. During this period, many of the most successful glam metal bands of 1980s disbanded or lost popularity. The genre has experienced a resurgence since the late 1990s. Many popular acts from the genre's 1980s heyday have had successful reunion tours. On top of this, new glam metal bands and artists such as the Darkness, Crashdiet, Reckless Love, and Steel Panther have emerged. ==Characteristics, fashion, and terminology== Musically, glam metal combines a traditional heavy metal sound with elements of hard rock and punk rock. It adds pop-influenced catchy hooks and guitar riffs.C. Smith, 101 Albums that Changed Popular Music (Oxford: Oxford University Press, 2009), , pp. 160–2. Like other heavy metal songs of the 1980s (most notably thrash metal songs), they often feature shred guitar solos.D. Bukszpan, The Encyclopedia of Heavy Metal (London: Barnes & Noble Publishing, 2003), , p. 63. They also include use of harmonies, particularly in the power balladsslow, emotional songs that gradually build to a strong finale.G. T. Pillsbury, Damage Incorporated: Metallica and the Production of Musical Identity (New York, NY: CRC Press, 2006), , p. 45. These were among the most commercially successful singles in the genre. They opened it up to a wider audience that would otherwise not have been attracted to traditional heavy metal. Lyrical themes often deal with love and lust, with songs often directed at a particular woman. Aesthetically glam metal draws heavily on the glam rock or glitter rock of the 1970s.P. Auslander, Performing Glam Rock: Gender and Theatricality in Popular Music (Ann Arbor, MI: University of Michigan Press, 2006), , p. 232. Often with long backcombed hair, use hair spray, use of make- up, gaudy clothing and accessories.D. Bukszpan, The Encyclopedia of Heavy Metal (London: Barnes & Noble Publishing, 2003), , p. 60. The visual aspects of glam metal appealed to music television producers, particularly MTV. This helped the genre rise to popularity. Glam metal performers became infamous for their lifestyles of drugs, strippers and late-night parties. These incidents were widely covered by the press.R. Batchelor and S. Stoddart, The 1980s (London: Greenwood Publishing Group, 2007), , p. 121. Other forms of glam metal are melodic metal, false metal, poodle bands, nerf metal, pop metal and metal pop. The last of which was coined by critic Philip Bashe in 1983 to describe bands such as Van Halen and Def Leppard.D. Weinstein, Heavy Metal: The Music and Its Culture (Cambridge, MA: Da Capo Press, 2000), , pp. 45–47. Use of the term \"hair metal\" started in the early 1990s as grunge grew in popularity at the expense of 1980s metal. Sam Dunn, in his documentary, Metal: A Headbanger's Journey, tries to differentiate pop and glam metal. He labeled the bands Def Leppard, Europe, and Whitesnake as pop metal, but Mötley Crüe and Poison as glam metal.Metal – A Headbanger's Journey, DVD, ASIN B000FS9OZY (2005). == References == Category:1980s in music Category:1990s in music Category:Fusion music genres",
 "title": "Glam metal"
}