{
 "id": "460821",
 "text": "Barry Dickins (born 1949) is an Australian artist and writer of books and plays. He was born in Reservoir, which is part of Melbourne. He left school early and worked in a factory. Later he painted sets and backgrounds for television programs. His first play, Ghosts, was performed in 1974 at La Mama Theatre. He has written many more plays. His play Remember Ronald Ryan won the 1995 Victorian Premier's Literary Award. He has also written short stories, biography, other non-fiction and children's books. Barry is known to use many 'half rhymes' in his work. == Dickins' books and plays == Drama * The Banana Bender and The death of Minnie. (Currency, 1981) * Lennie Lower. (Yackandandah, 1982) * One woman shoe. (Yackandandah, 1984) * The Bridal Suite and Mag and Bag: Two plays. (Yackandandah, 1985) * Beautland. (Currency, 1985) * The Golden Goldenbergs. (1986) * The Fool’s Shoe Hotel. (Yackandandah, 1987) * Royboys. (Currency, 1987) * Remember Ronald Ryan. (Currency, 1994) Stories * Post Office Restaurant and Other Stories. (Pascoe, 1992) Non fiction * The Gift of the Gab: Stories from the life of Barry Dickins. (1981; Penguin, 1987) * What the Dickins! A symposium of pieces from the low life. (Penguin, 1985) * You’ll Only Go In for Your Mates. (Allen & Unwin, 1991) * Guts and Pity: The Hanging that ended Capital Punishment in Australia. (Currency Press, 1996) * Ordinary Heroes: Personal Recollections of Australians at War. (Hardie Grant Books, 1999) * Articles of Light: Reflections on lowlifes, ratbags and angels. (Penguin, 2000) * Black and Whiteley: Barry Dickins in search of Brett. (Hardie Grant Books, 2002) Review Children's books * My grandmother. (Penguin, 1989) * My grandfather: Years of hope and vigour. (Penguin, 1993) * Joey: A dog for all seasons. (Puffin, 1995) == References == == Other websites == * Interview from The Age * Drawings * Saint Dymphna's Bells Poem Category:1949 births Category:Living people Category:Writers from Melbourne Category:Australian playwrights Category:Australian painters Category:Australian children's writers Category:Artists from Victoria (Australia)",
 "title": "Barry Dickins"
}