{
 "id": "46120",
 "text": "A micro-organism or microbe is an organism which is microscopic, which means that they are so small that people cannot see them with the naked eye. The study of microorganisms is called microbiology. Micro-organisms include bacteria, fungi, archaea, protists and viruses, and are among the earliest known life forms. The first of these four types of micro-organisms may either be free-living or parasitic. Viruses can only be parasitic, since they always reproduce inside other living things.Forterre P. 2010. Defining life: the virus viewpoint. Orig Life Evol Biosph. 40(2):151-60. Most micro-organisms are unicellular organisms with only one cell, but there are unicellular protists that are visible to the human eye, and some multicellular species are microscopic. Micro-organisms live almost everywhere on earth where there is liquid water, including hot springs on the ocean floor and deep inside rocks within the earth's crust. Such habitats are lived in by extremophiles. Micro- organisms are critical to nutrient recycling in ecosystems, because they act as decomposers. Because some micro-organisms can also take nitrogen out of the air, they are an important part of the nitrogen cycle. Pathogenic, or harmful, microbes can invade other organisms and cause disease. == Free-living micro- organisms == Free-living microbes get their energy in many different ways. Some use photosynthesis, like plants do. Some break down natural chemicals in their environment. Others feed on things that were once living, such as fallen leaves and dead animals, causing them to breakdown or decay. Some fungi and bacteria cause food to decay. Moldy bread or fruit, sour milk, and rotten meat are examples of decayed food. In nature, decayed materials mix with soil, providing essential nutrients for plants to use. Without this process, the nutrients in the soil would run out. These types of organisms are called decomposers. They are the natural recyclers of living things on our planet. Microbes also help us make some of our foods, such as bread, cheese, yogurt, beer, and wine. They feed on the sugar in grain, fruit, or milk, giving these foods a special texture and taste. == Parasitic microbes == Some microbes, often called germs, cause illness or disease. They are parasites which live by invading living things. Chickenpox, mumps, and measles are all caused by viruses. Some bacteria are also germs. They cause many infectious diseases including tuberculosis and tetanus. Certain bacteria cause tooth decay. It is possible to protect humans against some harmful microbes by storing and preparing food properly, cleaning the teeth, washing hands, and by avoiding close contact with ill people. == Comensalism == All animals seem to have bacteria and protozoa living in or on them without doing much harm. Sometimes, as with herbivores, the microorganisms are vital to the digestion of food. The human gut has more organisms living inside it than there are cells in the human body. ==References== == Other websites == * Microbe News from Genome News Network * BBC News, 28 September, 2001: The microbes that 'rule the world' Citat: \"... The Earth's climate may be dependent upon microbes that eat rock beneath the sea floor, according to new research....The number of the worm-like tracks in the rocks diminishes with depth; at 300 metres (985 feet) below the sea floor, they become much rarer...\" * BBCNews: 16 January, 2002, Tough bugs point to life on Mars Citat: \"...This research demonstrates that certain microbes can thrive in the absence of sunlight by using hydrogen gas...\" * BBCNews: 17 January, 2002, Alien life could be like Antarctic bugs * Microbiology * Microbe fixes nitrogen at a blistering 92 C Category:Microbiology",
 "title": "Microorganism"
}