{
 "id": "461266",
 "text": "Doug is an animated television program. The program was created by Jim Jinkins. The program is about the early adolescent life of its title character, Douglas \"Doug\" Funnie. Doug, was 11-12 years old in the first 4 seasons of the series. He was 13 years old in seasons 5 to 7. Doug was broadcast on Nickelodeon in from 1991 until 1994. The series was on ABC (Disney) from 1996 until 1999. == Characters == * Douglas Yancey \"Doug\" Funnie was voiced by Billy West in the Nickelodeon series and Tom McHugh in the Disney series. Doug is a shy 11 (later 12)-year-old boy. Most of the time, he is dealing with his fear of failure. He is good at writing, drawing, making music and caring for animals. Doug narrates every episode. He also writes his experiences in his journal. He has an alter ego, Quailman. Quailman was inspired by Jinkins's childhood home movies in which they posed as superheroes. ==Other media== ===Stage show=== On March 15, 1999, Disney premiered a new musical stage show, Doug Live!, at Disney's Hollywood Studios (at the time known as Disney-MGM Studios) at the Walt Disney World Resort. The show ran until May 12, 2001. ===Film=== A theatrical feature-length film, Doug's 1st Movie, was released on March 26, 1999, before production on the television show ceased. During this time, meet-and-greet costumed versions of Doug and Patti were seen in Walt Disney World. ===Video game=== A video game for Game Boy Color was released in 2000, titled Doug's Big Game. ===Television === The series was parodied in the Robot Chicken episodes \"Endless Breadsticks\" \"Yogurt in A bag & \"Strummy Strummy Sad Sad\" where Billy West reprises his role of the title character, while Samaire Armstrong voiced Patti and Seth Green voiced Porkchop. ===Comics=== While Doug had never received his own self-titled print media outside of books that retold events of the TV series' episodes, comics that entailed original stories were published in the magazine Disney Adventures, from Volume 7 #5 in February 1997, to Volume 12 #1 in February 2002. To date, the one-page comic \"Neckerchief Grief\" is the last official material that features Doug in any major capacity. == References == Category:Nickelodeon television series Category:1990s American animated television series Category:1990s children's television series Category:1991 American television series debuts Category:1994 American television series endings Category:1996 American television series debuts Category:1999 American television series endings Category:English-language television programs",
 "title": "Doug"
}