{
 "id": "461586",
 "text": "Robert James \"Bob\"/\"Gino\" Marella (June 4, 1937 – October 6, 1999) was an American professional wrestler, play-by-play commentator, and booker. He was better known by his ring name Gorilla Monsoon. He is known for his professional wrestling run as a super-heavyweight main eventer. He is also known for being the voice of the World Wrestling Federation as a commentator and backstage manager during the 1980s and 1990s. He also served as the on- screen WWF President. In honor of Monsoon, the staging area behind the entrance curtain at an event, a position which Monsoon established and where he could often be found during WWF shows late in his career, is named the Gorilla Position. On June 9, 1994, he was inducted into the WWE Hall of Fame by Jim Ross. ==Death== On October 6, 1999, Monsoon died of heart failure brought on by complications of diabetes at his Willingboro Township, New Jersey home. In a tribute which aired on WWF television after his death, McMahon described Marella as \"one of the greatest men I have ever known.\" Monsoon's death was acknowledged by WCW commentator Tony Schiavone (at Bobby Heenan's request) on the October 11, 1999 episode of WCW Monday Nitro, even though Monsoon had never worked for WCW. Heenan said: \"Gorilla will be sadly missed. Now he was one big tough man. He was a decent honest man. And we're all gonna miss him very much. And you know the pearly gates in heaven? It's now gonna be called 'the Gorilla position.' Goodbye, my friend.\" He was interred next to his son, Joey Marella, at Lakeview Memorial Park in Cinnaminson, New Jersey. == In wrestling == *Finishing moves **Airplane spin, sometimes followed by Monsoon slamming his opponent to the mat *Signature moves **Chop **Gorilla press slam **Manchurian Splash/Gorilla Splash (Running splash) ==Championships== *Cauliflower Alley Club **Other honoree (1994) *George Tragos/Lou Thesz Professional Wrestling Hall of Fame **Class of 2011 *Professional Wrestling Hall of Fame and Museum **Class of 2010 *World Championship Wrestling (Australia) **IWA World Heavyweight Championship (1 time) *World Wide Wrestling Federation/World Wrestling Federation **WWF Hall of Fame (Class of 1994) **WWWF United States Tag Team Championship (2 times) (with Killer Kowalski (1) and Bill Watts (1)) *World Wrestling Association (Los Angeles) **WWA World Tag Team Championship (2 times) (with Luke Graham (1) and El Mongol (1)) *World Wrestling Council **WWC North American Heavyweight Championship (2 times) *Wrestling Observer Newsletter **Worst Television Announcer (1985, 1991–1995) == References == ==Other websites== *WWE profile Category:1937 births Category:1999 deaths Category:American professional wrestlers Category:Deaths from diabetes Category:Deaths from myocardial infarction Category:Former WWE wrestlers Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Professional wrestling executives Category:Sportspeople from New York City Category:WWE Hall of Fame",
 "title": "Gorilla Monsoon"
}