{
 "id": "46155",
 "text": "Diablo II is a fantasy action role-playing computer game. The game was created by Blizzard Entertainment. It sold more than 1 million copies in the first two weeks after its release. It has sold over 15 million copies worldwide. The developer is remaking the game, with graphical improvements et cetera, known as Diablo 2: Resurrected .Diablo 2: Resurrected: Everything we know ==Storyline and quests== The game is divided into 4 acts. Each act is one part of the story. There are up to six quests in each act that must be completed before the player can go to the next act. The last quest is always the one where the player has to beat a boss. The bosses for each act are: *Act I: Andariel *Act II: Duriel *Act III: Mephisto *Act IV: Diablo Quests are parts of the story where the player has to complete certain tasks in order to continue on with the game. ==Gameplay== ===Characters Classes=== The game has five different types (or classes) of characters to chose from. Each character has a set skill tree, which is listed below. *Amazon - A bow and javelin using female character. She is good at attacking from a distance. *Barbarian - A male fighter who is good with all weapons. *Necromancer - A male magic user who uses the undead as his weapon. *Paladin - A male holy warrior that uses both magic and weapons in a fight. *Sorceress - A female magic user who uses the powers of Lightning, Fire and Ice. ===Leveling=== To increase a characters level in Diablo II, the player must run the character around killing the monsters that appear in the different areas. Once a monster is defeated, it sometimes drops items or coins. When a monster is killed, it will not come back until the game is saved and started again. Each character has a certain amount of experience that they needs to gain before they can become the next level. This number depends upon what level the character is. The higher the level, the more experience is needed to level. Characters gain bonuses when they level: *Each character gets 5 points each level to increase their attributes. Players usually decide what to increase by what character class they are. Necromancers and Sorceresses tend to get more Energy than Strength and Defense, while Barbarians and Paladins tend to get the opposite. *Each character gets 1 skill point each level to spend on a particular skill. Many players choose only one part of the skill tree to train in. That is the only one they put their skill points into. Others put their points into more than 1 of the skill trees listed above per character. Diablo II: Lord of Destruction Expansion *Adds Druid and assassin classes *Adds Act 5 == Related pages == * Diablo (video game) == References == == Other websites == * Official Site * The Arreat Summit , official Strategy Guide * DiabloII.net - Diablo, Hellfire, Diablo II Fansite Category:2000 video games Category:Blizzard video games Category:Action role-playing video games Category:Classic Mac OS games Category:Dark fantasy video games Category:Hack and slash role-playing games Category:Impact of the Columbine High School massacre Category:MacOS games Category:Multiplayer and single-player video games Category:Multiplayer online games Category:Permadeath games Category:Role-playing video games Category:Video game sequels Category:Video games developed in the United States Category:Video games set in hell Category:Windows games",
 "title": "Diablo II"
}