{
 "id": "461502",
 "text": "The following is a list of notable deaths in September 2014. *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. ==September 2014== * September 1 - Mark Gil, 52, Filipino actor, liver cirrhosis.Mark Gil passes away * September 1 - Maya Rao, 86, Indian dancer, cardiac arrest.Renowned Kathak dancer Maya Rao dead * September 1 - Joseph Shivers, 93, American textile chemist, developed spandex.Joseph Clois Shivers Jr. * September 1 - Gottfried John, 72, German actor (GoldenEye), cancer.\"James Bond\"-Bösewicht Gottfried John ist tot * September 1 - Elena Varzi, 87, Italian actress, cardiac arrest.Addio a Elena Varzi, volto del neorealismo italiano * September 1 - A. J. Langguth, 81, American historian and journalist.A.J. Langguth dies at 81; foreign correspondent and historian of wars * September 1 - Mary T. Clark, 100, American academic and civil rights advocate.Mary Clark Obituary * September 1 - Moktar Ali Zubeyr, 37, Somali militant, Emir of al-Shabaab (2009–2010, since 2011), airstrike.Terror Leader Moktar Ali Zubeyr Killed in U.S. Strike * September 2 - Norman Gordon, 103, South African cricketer. * September 2 - Helena Rakoczy, 92, Polish Olympic gymnast (1952 and 1956), natural causes.Zmała Helena Rakoczy * September 2 - Steven Sotloff, 31, American journalist (Time), beheaded by the Islamic State.Steven Sotloff: Islamic State 'kills US hostage' (death reported on this date) * September 2 - J. LaMoine Jenson, 79, American religious leader, President of the Priesthood of the Apostolic United Brethren, cancer.J. LaMoine Jenson, Utah polygamist leader, dies at 79 * September 2 - Peter Carter, 57, British diplomat, Ambassador to Estonia (2007–2012), Deputy High Commissioner to Nigeria (since 2012), heart attack.UK diplomat dies after 'heart attack' in Lagos airport * September 2 - Antonis Vardis, 66, Greek composer and singer.Prominent Greek Singer Antonis Vardis Passes Away * September 3 - Go Eun-bi, 21, South Korean singer (Ladies' Code), car accident.Ladies' Code member EunB revealed to have passed away in a car accident + two members in critical condition * September 3 - Andrew Madoff, 48, American investment broker, son of Bernard Madoff, lymphoma.Bernie Madoff's Son Dies Of Lymphoma * September 3 - Mark Otway, 82, New Zealand tennis player.Mark Otway obituary (death announced on this date) * September 3 - Aarno Raninen, 70, Finnish actor, composer and musician, house fire.Thursday's papers: That NATO summit, stalled pension reform talks, more health care fines, and a musician's passing * September 3 - Niki Nordenskjöld, 38, Swedish actress (Solsidan) and illustrator, cancer.Insamling Niki Nordenskjöld * September 3 - Roy Heather, 79, English television actor (Only Fools and Horses).Only Fools And Horses star Roy Heather dies aged 79 * September 4 - Habib Wali Mohammad, 93, Pakistani ghazal singer.Renowned ghazal singer Habib Wali passes away * September 4 - Joan Rivers, 81, American actress and comedian, respiratory and cardiac arrest.Joan Rivers, Legendary Comedienne, Dies at 81 * September 4 - Gustavo Cerati, 55, Argentine singer and musician (Soda Stereo), respiratory arrest.Gustavo Cerati, beloved Argentine rock star, dies at 55 * September 4 - Franca Falcucci, 88, Italian politician, Minister of Education (1982–1987).Muore l'ex ministro dell'Istruzione e senatrice Franca Falcucci * September 4 - Donatas Banionis, 90, Lithuanian Soviet actor (Solaris), inspired Vladimir Putin to join the KGB, stroke.Soviet-Era Actor Who Inspired Vladimir Putin Dies at 90 * September 4 - Włodzimierz Kotoński, 89, Polish composer.Kompozytor Włodzimierz Kotoński, pierwszy twórca polskiej awangardy elektronicznej, nie żyje * September 4 - Orunamamu, 93, American-born Canadian storyteller.Orunamamu * September 4 - Roy Leonard, 83, American radio personality (WGN) (AM), esophageal infection. * September 4 - Martynas Andriukaitis, 33, Lithuanian basketball player, suicide by gunshot.Buvęs krepšininkas M. Andriukaitis nušovė savo žmoną ir nusižudė * September 4 - Hopeton Lewis, 66, Jamaican singer, kidney failure. * September 4 - Gerrit Kouwenaar, 91, Dutch poet, recipient of P. C. Hooft Award (1970).Gerrit Kouwenaar (1923-2014), een leven lang maatschappelijk betrokken * September 4 - Clare Cathcart, 48, Northern Irish actress (Call the Midwife, Doctors), asthma attack.Clare Cathcart Dead: 'Call The Midwife' And 'Doctors' Actress Dies, Aged 48 * September 4 - Joseph B. Raynor, Jr., 91, American politician, Member of the North Carolina Senate (1965–1992).Former state lawmaker, businessman Joe B. Raynor of Fayetteville dies * September 5 - Ron Mulock, 84, Australian politician, Deputy Premier of New South Wales (1984-1988). * September 5 - Eoin Young, 75, New Zealand journalist. * September 5 - Wolfhart Pannenberg, 85, German theologian.Wolfhart Pannenberg (1928-2014) * September 5 - Karel Černý, 92, Czech art director and production designer (Amadeus).Zemřel filmový architekt Karel Černý, držitel Oscara za Amadea * September 5 - Simone Battle, 25, American actress (Zoey 101) and singer (G.R.L.), suicide by hanging. * September 5 - Bruce Morton, 83, American news correspondent (CBS, CNN). * September 6 - Cirilo Flores, 66, American Roman Catholic prelate, Bishop of San Diego (since 2013), prostate cancer.San Diego Catholic bishop dies after battle with cancer * September 6 - Odd Bondevik, 73, Norwegian theologian.Odd Bondevik (73) er død * September 6 - Stefan Gierasch, 88, American actor (Carrie, Dark Shadows, High Plains Drifter).Stefan Gierasch – Obituary * September 6 - Kira Zvorykina, 94, Soviet-born Belarusian chess player.Ушла из жизни Кира Алексеевна Зворыкина (1919-2014) * September 7 - Kwon Ri-se, 23, South Korean singer (Ladies' Code), injuries from car accident.[BREAKING Ladies' Code's RiSe passes away] * September 7 - Yoshiko Ōtaka, 94, Chinese- born Japanese actress (Eternity) and singer, member of the House of Councillors (1974–1992), heart failure.Japan's World War II Film Idol Rikoran Dies at 94 * September 7 - Jim Dobbin, 73, British politician, MP for Heywood and Middleton (1997-2014).Labour MP Jim Dobbin dies aged 73 * September 7 - Raul M. Gonzalez, 83, Filipino politician, Secretary of Justice (2004–2009), multiple organ failure.Ex-DOJ chief Raul Gonzalez dies * September 7 - Fanny Godin, 112, Belgian supercentenarian, oldest person in Belgium.Oudste Belg (112) overleden * September 7 - Harold Shipp, 88, Canadian businessman. * September 7 - Harry Evans, 68, Australian public servant, Clerk of the Australian Senate (1988–2009).Harry Evans, Australia's longest-serving Clerk of the Senate, dies at 68 * September 7 - Elsa-Marianne von Rosen, 90, Swedish ballet dancer, choreographer and actress, natural causes.Elsa-Marianne von Rosen död * September 7 - Don Keefer, 98, American actor (Butch Cassidy and the Sundance Kid, Gunsmoke, The Twilight Zone), natural causes.Don Keefer, Who Was Turned Into a Jack-in-the-Box on 'The Twilight Zone,' Dies at 98 * September 8 - S. Truett Cathy, 93, American restaurateur (Chick-fil-A).Chick- fil-A founder S. Truett Cathy has died * September 8 - Gerald Wilson, 96, American jazz musician, pneumonia.Gerald Wilson dies at 96; multifaceted jazz musician * September 8 - Edward R. Hauser, 98, American animal scientist.Hauser, Edward R. * September 8 - George Zuverink, 90, American baseball player, pneumonia.Holland native George Zuverink, ex-MLB pitcher, dies at 90 * September 8 - Bobby Fong, 64, American academic, President of Ursinus College (since 2011), aneurysm. * September 8 - Sean O'Haire, 43, American professional wrestler (WCW, WWE), suicide.Former WWE wrestler Sean O'Haire found dead at his home * September 8 - Rashi Fein, 88, American economist and professor.RASHI FEIN * September 9 - Graham Joyce, 59, British fantasy author, lymphoma.Graham Joyce (1954-2014) * September 9 - Firoza Begum, 84, Bangladeshi singer, heart and kidney failure. * September 9 - Howell Evans, 86, Welsh actor (Stella).Tributes paid to actor Howell Evans who played Daddy in Ruth Jones' Sky 1 show Stella * September 9 - Bob Suter, 57, American ice hockey player, Olympic champion (1980), heart attack. * September 9 - Denny Miller, 80, American actor (Tarzan, the Ape Man, Wagon Train), Lou Gehrig's disease.Denny Miller, Star of 'Tarzan' and 'Wagon Train,' Dies at 80 * September 9 - Montserrat Abelló i Soler, 96, Spanish poet and translator.Muere Montserrat Abelló * September 10 - Emilio Botín, 79, Spanish banker and businessman, Executive Chairman of Grupo Santander, heart attack. * September 10 - Richard Kiel, 74, American actor (The Spy Who Loved Me, Moonraker, Happy Gilmore, Tangled), coronary heart disease.James Bond Villain Richard Kiel Reportedly Dies at 74 * September 11 - Joachim Fuchsberger, 87, German-Australian actor and television host, multiple organ failure.TV- Legende: Joachim Fuchsberger ist tot * September 11 - Antoine Duhamel, 89, French composer and conductor.Le compositeur de la Nouvelle Vague Antoine Duhamel est mort * September 11 - Bob Crewe, 82, American songwriter and record producer (The Four Seasons).Four Seasons Songwriter Bob Crewe Dead At 82 * September 11 - Sir Donald Sinden, 90, English actor, prostate cancer.Sir Donald Sinden: Legendary actor dies aged 90 * September 11 - Kendall Francois, 43, American serial killer, apparent natural causes.Poughkeepsie serial killer Kendall Francois dies in prison at age 43 * September 11 - Rudolf Kortokraks, 86, German-Austrian painter.Maler Rudolf Kortokraks 86-jährig in Hallein gestorben * September 11 - Hamish McHamish, 15, Scottish celebrity cat, chest infection.In pictures: Hamish McHamish the famous St Andrews cat dies aged 15 * September 12 - Atef Ebeid, 82, Egyptian politician, Prime Minister (1999-2004). * September 12 - Ian Paisley, 88, Northern Irish politician, Leader of the Democratic Unionist Party (1971–2008), First Minister (2007–2008).Former First Minister and DUP leader Ian Paisley has died * September 12 - John Bardon, 75, English actor (EastEnders). * September 12 - Joe Sample, 75, American jazz musician (The Crusaders).Joe Sample, iconic jazz pianist & composer, is dead at 75 * September 12 - Antony Kidman, 75, Australian psychologist, biochemist and writer, father of Nicole Kidman, heart attack.Nicole Kidman's dad died from a heart attack * September 13 - David Cawthorne Haines, 44, British humanitarian aid worker and ISIS hostage, beheading.David Haines's 'evil murder' condemned by PM (death reported on this date) * September 13 - Marvin Cheung, 67, Hong Kong politician, chairman of AAHK, leukemia.CE saddened by death of Dr Marvin Cheung * September 13 - Milan Galić, 76, Serbian footballer. * September 13 - Benjamin Adekunle, 78, Nigerian army leader.Benjamin Adekunle is dead * September 13 - Frank Torre, 82, American baseball player (Milwaukee Braves, Philadelphia Phillies), cardiac arrest.Frank Torre, older brother of Yankees Hall of Fame skipper Joe and former Milwaukee Braves first baseman, dead at 82 * September 14 - Nicholas Romanov, Prince of Russia, 91, French-born Russian claimant to the headship of the House of Romanov (since 1992).В Італії помер старший в роду Романових - князь Микола Романович * September 14 - Tony Auth, 72, American Pulitzer Prize-winning cartoonist, cancer. * September 14 - Boris Khimichev, 81, Russian actor, brain cancer.Скончался актер Борис Химичев * September 14 - Angus Lennie, 84, Scottish movie (The Great Escape, Oh! What a Lovely War) and television actor (Crossroads, Doctor Who).Angus Lennie dead: Great Escape's The Mole dies aged 84 * September 14 - Assheton Gorton, 84, British production designer (Blowup, The French Lieutenant's Woman). * September 14 - Philip Somerville, 84, English milliner.Philip Somerville - obituary * September 15 - Post Bahadur Bogati, 61, Nepalese politician, brain haemorrhage caused by cardiac arrest.UCPN (Maoist) Vice chairman passes away * September 15 - Yitzhak Hofi, 87, Israeli general, director of Mossad (1974–1982).Israeli ex-Mossad chief Yitzhak Hofi dead at 87 * September 15 - Eugene I. Gordon, 84, American physicist.Eugene I. Gordon * September 15 - John Anderson, Jr., 97, American politician, Governor of Kansas (1961–1965).Former Kansas Gov. John Anderson Jr. dies at 97 * September 15 - Jürg Schubiger, 77, Swiss children's writer.Schweizer Schriftsteller Jürg Schubiger gestorben * September 15 - Jeremy Ball, 45, Australian actor (The Matrix) and politician, Deputy Mayor of Launceston, Tasmania (since 2011), car accident.Tributes flow for Launceston Deputy Mayor Jeremy Ball killed in Bass Highway crash * September 15 - Jackie Cain, 86, American jazz vocalist (Jackie and Roy), stroke-related problems.Jackie Cain, sparkling jazz singer in duo with husband for decades, dies at 86 * September 16 - Alf Ivar Samuelsen, 72, Norwegian politician, Mayor of Flakstad (1986–1987), tractor crash.Tidligere stortingsmann og ordfører døde i ulykke * September 16 - Darrell Zwerling, 86, American character actor (Chinatown, Grease). (death announced on this date) * September 16 - Buster Jones, 71, American voice actor (Super Friends).Buster Jones, Voice Actor on ‘Super Friends,’ Dies at 71 * September 17 - China Zorrilla, 92, Uruguayan actress (Elsa & Fred), pneumonia.China Zorrilla falleció hoy a los 92 años * September 17 - Andriy Husin, 41, Ukrainian football player (Dynamo Kyiv, Krylia Sovetov, national team) and coach, traffic collision.Знаменитий динамівець Андрій Гусін розбився на смерть * September 17 - George Hamilton IV, 77, American country music singer, heart attack.George Hamilton IV, 50-year Opry star, dies at age 77 * September 17 - Peter von Bagh, 71, Finnish movie historian.R.I.P. Peter von Bagh, the movie buff’s movie buff * September 17 - Lorna Thomas, 96, Australian cricket player and coach, natural causes.Lorna Thomas dies aged 96 * September 18 - Kenny Wheeler, 84, Canadian jazz trumpeter.\"RIP, Kenny Wheeler\" * September 18 - George Radwanski, 67, Canadian journalist and civil servant, Privacy Commissioner (2000–2003), heart attack. * September 18 - Earl Ross, 73, Canadian race car driver, winner of the Daytona 500 (1974).Earl Ross, only Canadian to win NASCAR Cup race, dies * September 19 - Elaine Lee, 75, South African-born Australian actress (Number 96).Elaine Lee, the 'charming, funny and delightfully sexy' Number 96 star, has died aged 75 * September 19 - U. Srinivas, 45, Indian mandolin player, liver failure. * September 19 - Avraham Heffner, 79, Israeli filmmaker (Laura Adler's Last Love Affair).הבמאי והתסריטאי אברהם הפנר הלך לעולמו (in Hebrew) * September 19 - Francisco Feliciano, 73, Filipino composer and conductor. * September 19 - Iain MacCormick, 74, Scottish politician, MP for Argyllshire (1974–1979).Former Argyll SNP MP Iain MacCormick dies * September 19 - Milton Cardona, 69, Puerto Rican jazz musician, heart failure.Día triste en la salsa, falleció el conguero Milton Cardona * September 19 - Audrey Long, 92, American actress (Yankee Doodle Dandy, Tall in the Saddle). * September 20 - Anatoly Berezovoy, 72, Soviet cosmonaut.Новости Роскосмоса * September 20 - Polly Bergen, 84, American singer and actress (Cape Fear, The Polly Bergen Show, Desperate Housewives), heart failure.Polly Bergen Versatile Actress Singer Dies At 84 * September 20 - Vince Callahan, 82, American politician, member of the Virginia House of Delegates (1968–2008), West Nile virus.Northern Va. legislator Vincent F. Callahan Jr. dies at 82; Republican served 40 years * September 20 - Rob Bironas, 36, American football player (Tennessee Titans), car accident.Former Titans kicker Rob Bironas dies in car accident * September 20 - George Sluizer, 82, Dutch movie director (The Vanishing).Cineast George Sluizer overleden * September 20 - Eric Lynch, 39, American actor, member of The Howard Stern Show's Wack Pack, multiple organ failure. * September 20 - Takako Doi, 85, Japanese politician, pneumonia.土井たか子氏が死去 女性初の衆院議長 * September 21 - Linda Griffiths, 60, Canadian actress and playwright, breast cancer.\"Linda Griffiths, actor and playwright, dead after battle with cancer\" * September 21 - Caldwell Jones, 64, American basketball player (Philadelphia 76ers, Portland Trail Blazers), heart attack. * September 21 - Frieda Szwillus, 112, German supercentenarian, oldest living person in Germany.Frieda Szwillus, geb. Hennig * September 21 - Mike Harari, 87, Israeli intelligence officer.Israeli Agent Who Hunted Down Munich Olympic Killers Dies at 87 * September 21 - Cecilia Cenci, 72, Argentine actress, brain cancer.Fallece la actriz argentina Cecilia Cenci * September 22 - Flor Van Noppen, 58, Belgian politician, member of the Member of the Chamber of Representatives of Belgium (2007–2014), multiple system atrophy.Flor Van Noppen (N-VA) overleden * September 22 - Sahana Pradhan, 88, Nepalese politician, brain haemorrhage. * September 22 - Hasse Wallman, 78, Swedish entertainment executive, composer and movie director and producer, horse riding accident.2E Group: Storägaren avliden * September 22 - Skip E. Lowe, 85, American talk show host,emphysema.Skip E. Lowe, Talk Show Host and Inspiration for Martin Short’s Jiminy Glick, Dies at 85 * September 22 - Erik van der Wurff, 69, Dutch pianist and composer, cancer.Erik van der Wurff overleden * September 22 - Ben Webb, 37, New Zealand artist.\"Ben Webb dies\", Otago Daily Times, 24 September 2014. p.5 * September 23 - Gilles Latulippe, 77, Canadian comedian, actor and theatre manager, lung cancer.Gilles Latulippe est décédé * September 23 - Rodney Milgate, 80, Australian painter, playwright and newsreader, heart attack.Artist and former TV newsreader Rodney Milgate dies * September 23 - Al Suomi, 100, American professional hockey player (Chicago Blackhawks).ALBERT SUOMI Obituary * September 23 - Henryk Glücklich, 69, Polish speedway rider.Henryk Glücklich nie żyje * September 24 - Abubakar Shekau, 44, Nigerien militant, Emir of Boko Haram (since 2009), killed by Nigerian forces.Boko Haram chief Abubakar Shekau dead, Nigerian military claims (death reported on this date) * September 24 - Christopher Hogwood, 73, English conductor.Conductor Christopher Hogwood dies aged 73 * September 24 - Greg Mackey, 52, Australian rugby league player (South Sydney Rabbitohs, Canterbury-Bankstown Bulldogs), heart attack.Tributes pour in for Warrington great Greg Mackey who died on Wednesday * September 24 - Deborah Cavendish, Duchess of Devonshire, 94, British writer and duchess, last living Mitford sister, natural causes.Last Mitford sister, Deborah Dowager, Duchess of Devonshire, dies aged 94 * September 24 - Karl Miller, 83, British literary editor (The Listener, London Review of Books).Karl Miller, founding editor of London Review of Books, dies at 83 * September 24 - Madis Kõiv, 84, Estonian author, physicist and philosopher.Suri Madis Kõiv * September 24 - Carlotta Ikeda, 73, Japanese butoh dancer, liver cancer.舞踏家のカルロッタ池田さん死去 * September 25 - Sulejman Tihić, 62, Bosnian politician, Member of the Presidency (2002–2006), Member of the House of People (2011–2014).Umro Sulejman Tihić * September 25 - Rezső Gallai, 110, Hungarian supercentenarian, oldest man in Europe.Meghalt Gallai Rezső bácsi, az ország legidősebb lakója * September 25 - Ulrick Chérubin, 70, Canadian politician, Mayor of Amos, Quebec (since 2002).Le maire d'Amos, Ulrick Chérubin, est mort * September 25 - Stephen Sykes, 75, English prelate, Bishop of Ely (1990-1999) * September 25 - Dorothy Tyler-Odam, 94, British athlete and Olympic silver-medalist (1936 and 1948).Dorothy Tyler dies aged 94 * September 26 - Michael McCarty, 68, American stage actor, heart failure.Broadway Veteran Michael McCarty Dies at 68 * September 26 - Sam Hall, 93, American television writer (Dark Shadows, One Life to Live), pneumonia. * September 27 - Eugie Foster, 42, American science fiction writer, respiratory failure caused by cancer.Eugie K. Foster Update * September 27 - James Traficant, 73, American politician, member of the U.S. House of Representatives for Ohio's 17th district (1985–2002), tractor accident.James A. Traficant Jr., colorful Ohio congressman expelled by House, dies at 73 * September 27 - Zhang Xianliang, 77, Chinese author and poet.Famed Chinese writer Zhang Xianliang dies * September 27 - Jean-Jacques Pauvert, 88, French publisher.Jean-Jacques Pauvert, éditeur légendaire et atypique, est mort * September 27 - Taylor Hardwick, 89, American architect, cancer. * September 27 - Abdelmajid Lakhal, 74, Tunisian theatre director and actor.Décès de l’acteur Abdelmajid Lakhal * September 28 - Petr Skoumal, 76, Czech musician and composer.Zemřel Petr Skoumal * September 29 - Luis Nishizawa, 96, Mexican painter.Fallece el pintor mexicano Luis Nishizawa a los 96 años de edad * September 29 - George Shuba, 89, American baseball player (Brooklyn Dodgers). * September 29 - Miguel Boyer, 75, French-born Spanish economist and politician, Minister of Economy, Treasury and Commerce (1982–1985), pulmonary embolism.Miguel Boyer Dies at 75 Years Old in Madrid * September 30 - Molvi Iftikhar Hussain Ansari, 72, Indian Kashmiri cleric, politician and businessman, cirrhosis.Kashmiri Shia leader Ifftekhar Ansari dies * September 30 - Jerrie Mock, 88, American pilot, first woman to fly solo around the world. * September 30 - Martin Lewis Perl, 87, American physicist, discovered the tau particle, Nobel Prize laureate in Physics (1995), heart attack.Stanford's Martin L. Perl, winner of 1995 Nobel Prize for discovery of tau lepton, dead at 87 ==See more months== *Deaths in January 2014 *Deaths in February 2014 *Deaths in March 2014 *Deaths in April 2014 *Deaths in May 2014 *Deaths in June 2014 *Deaths in July 2014 *Deaths in August 2014 *Deaths in October 2014 *Deaths in November 2014 *Deaths in December 2014 ==References== *09 Category:September 2014 events",
 "title": "Deaths in September 2014"
}