{
 "id": "46168",
 "text": "Angel is a spin-off from the American television series Buffy the Vampire Slayer. Angel has a darker feel than Buffy, and at times did better in the U.S. Nielsen Ratings than Buffy.Topping, Keith, Hollywood Vampire, (3rd edition, includes Season 4) Virgin Books (2004), page 360: \"During [November- December 2002]., Angel was getting slightly higher ratings than Buffy, aided by a new Sunday-slot and the popular series Charmed as its lead-in show\". The series was created by Buffy's creator Joss Whedon along with David Greenwalt. It first aired in October of 1999. Like Buffy, it was produced by Whedon's production company, Mutant Enemy. The series tells the story of the vampire Angel. Angel had his soul returned to him as punishment for killing a gypsy girl. This made him tormented by all the bad things he had done. During the first four seasons of the show, he works as a private detective in a fiction version of Los Angeles, California. There, he and a variety of others work to \"help the helpless\" and \"save the souls\" of those who had lost their way. This usually meant fighting evil demons or humans that worked with demons (the law firm Wolfram and Hart). He also had to fight his own violent nature. (Not all \"demons\" in the Angel universe are evil beings.) The fifth season saw Angel taking over as the person in charge of the evil law firm Wolfram and Hart. This was done to try to fight evil from the inside. == Production == === Origins === Several years before the Angel first showed on television, writer Joss Whedon created the idea behind Buffy the Vampire Slayer to change the Hollywood formula of \"the little blonde girl who goes into a dark alley and gets killed in every horror movie.\"Billson, Anne, \"Buffy the Vampire Slayer\" (BFI TV Classics S.). British Film Institute (December 5, 2005), pp24–25. Whedon was not happy with the way that the Buffy idea was first done in the 1992 movie, Buffy the Vampire Slayer,.Havens, Candace, Joss Whedon: The Genius Behind Buffy Benbella Books (May 1, 2003), p23: \"I had written this scary film about an empowered woman, and they turned it into a broad comedy. It was crushing.\" He was given the chance to do the story better with the television series of the same name.Golden, Christopher, and Holder, Nancy, Watcher's Guide Vol. 1. Simon & Schuster (October 1, 1998), pp249–250 The early years of the series were about the life of Buffy Summers, a high-school aged vampire slayer, and her group of friends in Sunnydale (a fictional small town in California). The supernatural parts in the series took the place of the real problems that are a part of adolescence and young adulthood.Wilcox, Rhonda, and Lavery, David, Fighting The Forces Rowman & Littlefield (April 2002), \"In the world of Buffy the problems that teenagers face become literal monsters…\", page xix The character Angel was first seen in the first episode. He became a regular cast member during the second/third seasons. In the fictional universe created by Buffy (the Buffyverse),The term 'Buffyverse' is used amongst fans of Buffy/Angel online to describe the fictional universe established by Buffy/Angel. It is also used in published materials such: Walton, Andy, \"Slang-age in the Buffyverse\", CNN (February 18, 2004 ), and the book, Ouellette, Jennifer, Physics of the Buffyverse , Penguin Books (January 2007). Angel was born in 18th century Ireland. After being turned into a soulless immortal vampire, he became very well known for the evil things he did. Over 100 years later, Angel killed a gypsy girl. Her family punished him by returning his soul. He felt a very large amount of guilt for what he had done over all those years. Angel eventually began on a path of redemption. He hoped that he might make up for his past by doing good deeds. In the Buffy third season final episode, Angel leaves Sunnydale for Los Angeles to continue his path of redemption without Buffy. Whedon believed that \"Angel was the one character who was bigger than life in the same way that Buffy was, a kind of superhero.\"Havens, Candace, Joss Whedon: The Genius Behind Buffy Benbella Books (May 1, 2003), p103. While the main idea behind Buffy was \"High school as a horror movie\" in small-town America,'Said, SF', \"Interview with Joss Whedon by SF Said \", Shebytches.com (2005). Greenwalt and Whedon wanted to make Angel into a different \"gritty, urban show\".Havens, Candace, Joss Whedon: The Genius Behind Buffy Benbella Books (May 1, 2003), p102 (quote from Greenwalt) Joss Whedon and David Greenwalt created a short video, often called the \"Unaired Angel pilot\" for the WB Network. The idea for the series was a new version of the old detective genre. === Cancellation === On Valentine's Day, 2004, the WB Network said that Angel would not be brought back for a sixth season.KJB, \"Breaking News: Angel to End After 5 Seasons. Whedon talks about cancellation\", IGN.com (February 13, 2004). Joss Whedon posted a message on a popular fan site, The Bronze: Beta, in which he showed his surprise. He said he was \"heartbroken\".Whedon, Joss, Online post , Bronzebeta.com (February 14, 2004). Archived version. Fans created letter-writing campaigns and online petitions. They tried to get other networks, UPN mainly (the network that picked up Buffy), to pick up the show. Angel's final episode, \"Not Fade Away\", aired on the WB May 19, 2004. == Characters == === Main characters === * Angel (David Boreanaz) – Vampire over two hundred years old. He was known as Angelus during the time he was causing evil across Europe. He was cursed with a soul which gave him a conscience and guilt for the centuries of murder and torture he had done. Angel moves to L.A. in search of redemption. * Cordelia Chase (Charisma Carpenter) – At Sunnydale, Cordelia was a shallow cheerleader. She is changed by the loss of her parents' financial support and her not becoming a star in L.A. She joins Angel Investigations to help Angel. * Allen Francis Doyle (Glenn Quinn) – He was born to a human mother and a demon father in Dublin, Ireland. He became a messenger for the Powers That Be. * Wesley Wyndam-Pryce (Alexis Denisof) – His failure as a Watcher and being fired from the Watchers' Council led Wesley to hunt demons. He joined Angel and went on to lead Angel Investigations. * Charles Gunn (J. August Richards) - He grew up in a part of Los Angeles where the police were afraid to go. Gunn grew up fighting vampires. He did not trust Angel at first but eventually joins the group. * Winifred \"Fred\" Burkle (Amy Acker) – A young Texan physicist, she is trapped in a world where humans are enslaved by demons for five years. Angel saved her and brought her back to L.A. * Connor (Vincent Kartheiser) – Connor is born in Los Angeles, California. He was a \"miracle\", a human child born of two vampires, Angel and Darla. He was taken to a hell dimension. He spent his childhood and much of his adolescence there. He came back to L.A. as an angry young man. * Lorne (Andy Hallett) – Lorne was a demon. Lorne lived in L.A. as the host of a Caritas, a violence-free demon-friendly karaoke bar. He can see into people's souls when they sing. His full name is Krevlorneswath of the \"Deathwok Clan\". * Spike (James Marsters) – A vampire who roamed Europe with Angel in the late 19th century. He joins the team after getting back his own soul. * Illyria (Amy Acker) – One of the Old Ones. She was one of the first demons who ruled the area that now includes California. Long ago, Illyria's corpse was placed in a stone sarcophagus. Her powers were taken away and put in jewels on her coffin. Illyria came back by infecting the body of a human (Winifred Burkle). * Harmony Kendall (Mercedes McNab) – At high school, she was a member of Cordelia Chase's popular clique, the \"Cordettes\". During her graduation, she is turned into a vampire. She kept her \"bubbly\" personality, and many of her bad personality traits. This made her very bad as a vampire. She decided to get a job with evil law firm Wolfram and Hart as a secretary. == Footnotes and references == :All links retrieved and checked as of November, 2006 or after. == Other websites == * * 20th Century Fox—Angel section * All Things Philosophical on Buffy the Vampire Slayer (includes Angel content) * Whedonesque.com * Stakes and Salvation: a Buffyverse Encyclopedia * WhedonWiki.com Category:1999 American television series debuts Category:2004 American television series endings Category:1990s American television series Category:2000s American television series Category:2000s horror television series Category:American fantasy television series Category:American horror television series Category:American television spin-offs Category:Television series created by Joss Whedon Category:Television series set in Los Angeles Category:WB network shows Category:English-language television programs Category:The WB original programming",
 "title": "Angel (1999 TV series)"
}