{
 "id": "46177",
 "text": "Sir John Major (born 29 March 1943) is a British politician who was Prime Minister of the United Kingdom and Leader of the Conservative Party from 1990 to 1997. He served as a member of the Cabinet under Margaret Thatcher as Chief Secretary to the Treasury (1987-1989), Foreign Secretary (1989) and Chancellor of the Exchequer (1989-1990). == Early life and career == Major was born at St Helier Hospital and Queen Mary's Hospital for Children in St Helier, London, in England and left school at the age of 16. He became a Conservative councillor in 1968. At the 1979 general election, Major was elected Member of Parliament (MP) for Huntingdonshire (Huntingdon after 1983). ==Prime Minister== After holding several cabinet positions, Major was elected to replace Margaret Thatcher as Prime Minister and party leader. On taking office, he saw British action in the Gulf War (1991) and his party's narrow re-election in the 1992 general election. After this, the Conservatives under Major became unpopular because of the \"Black Wednesday\" stock market crash in late 1992 and how they became divided over the issue of European Union. Beaten at the 1997 general election, Major stood down as Prime Minister for Tony Blair of the Labour Party, and was replaced as Conservative leader by William Hague. He stood down as an MP at the 2001 general election. ==Personal life== Major married Norma Johnson (now (Dame) Norma Major ) on 3 October 1970. She was a teacher, and a member of the Young Conservatives. They became engaged after only ten days. They have two children; a son, James, and a daughter, Elizabeth. They have a holiday home on the coast of north Norfolk, near Weybourne. He is a keen follower of cricket, motor racing, and also a supporter of Chelsea Football Club. Major has so far declined a life peerage on standing down from Parliament. ==References== ==Other websites== * * * * * Category:1943 births Category:Living people Category:Chancellors of the Exchequer Category:Companions of Honour Category:English Anglicans Category:Conservative Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:Knights of the Garter Category:Leaders of the Conservative Party (UK) Category:Leaders of the Opposition (United Kingdom) Category:Politicians from Surrey Category:Members of the Privy Council of the United Kingdom Category:Secretaries of State of the United Kingdom Category:UK MPs 1979–1983 Category:UK MPs 1983–1987 Category:UK MPs 1987–1992 Category:UK MPs 1992–1997 Category:UK MPs 1997–2001",
 "title": "John Major"
}