{
 "id": "46183",
 "text": "Carl Linnaeus (23 May 1707 – 10 January 1778), also known as Carolus Linnaeus, was a Swedish botanist, physician and zoologist who created the binomial nomenclature.Stafleu, F.A. (1976–1998). Taxonomic Literature. Second edition. An authoritative work on the names of botanists, their works and publication data, issued under the auspices of the IAPT. In this system, every kind of animal and plant is given a name consisting of two Latin words, for its genus and species. This became used by biologists all over the world, so he is known as the \"father of modern taxonomy\". He was a good linguist, and famous in his time. He was made a noble by the Swedish king. == Biography == === Early life === Carl was born in Småland in southern Sweden. He was going to be a priest like his father, but did not do well enough in school. Instead, Carl studied at a college for botany because he liked it. He studied in Lund and tried to improve the garden there. He later went to another college. === Travels and research === In 1735, Linnaeus moved to the Netherlands for three years. There, he earned his degree in medicine. He also published his book on plant classification. His book was called Systema Naturæ. His book explained how to classify living things by putting them into groups. Some of these groups are bigger than others. Later he moved to Stockholm and practiced as a doctor. In 1739, Linnaeus married Sara Morea in Stockholm. Throughout the 1740s he conducted many field trips to places in Sweden to name plants and animals. When not on travels, Linnaeus worked on his classification, so it would work for plants, animals, and minerals. The Swedish king Adolf Fredrik made Linnaeus a noble in 1757, and Linnaeus took the last name von Linné, later often signing just Carl Linné. === Last years === After he was made a noble, he continued teaching and writing. His reputation had spread over the world, and he talked with many different people. Linnaeus was upset by weak health, and he had gout and tooth aches.Uppsala University, Linné Online, English language version A stroke in 1774 weakened him, and two years later he had another, losing the use of his right side. He died on January 1778 and was buried in Uppsala cathedral.1911 Encyclopedia Britannica == Mankind == Linnaeus classified man as among the primates, which was already well understood by anthropologists like Blumenbach and natural historians like Buffon. It attracted the criticism of the Swedish church. The Lutheran Archbishop of Uppsala accused him of \"impiety\". Linnaeus recognised four races in the human species. These were European whites, American reds (Native Americans), Asian browns, and African blacks. Blumenbach's classification was similar, with the addition of a Mongolian (= Chinese) or yellow race. Thus recognition of man's position as a primate and the existence of races was quite widespread before the theory of evolution was formulated. == Related pages == *List of biologists == Notes and references == === Sources === * Sörlin & Fagerstedt, Linné och hans lärjungar, 2004. * J.L.P.M.Krol, Linneaus' verblijf op de Hartekamp In: Het landgoed de Hartekamp in Heemstede. Heemstede, 1982. Category:1707 births Category:1778 deaths Category:Taxonomy Category:Swedish physicians Category:Naturalists Category:Swedish biologists Category:Botanists Category:Deaths from stroke",
 "title": "Carl Linnaeus"
}