{
 "id": "461968",
 "text": "Giancarlo Esposito (born April 26, 1958) is an American actor, director and producer. He played Buggin' Out in Do the Right Thing. He played Left Hand Lacey in Mo' Better Blues. He also played Julian in School Daze, Gus in Breaking Bad and Akela in The Jungle Book. Esposito was born in Copenhagen, Denmark to an African-American mother and Italian father. He was raised in Manhattan, New York City from age six. ==Filmography== Year Title Role Notes 1979 Running Puerto Rican Teenager 1981 Taps Cadet Captain JC Pierce 1983 Trading Places Cellmate 1983 Enormous Changes at the Last Minute Julio 1984 Go Tell It on the Mountain Elisha 1984 The Cotton Club Bumpy Hood 1985 Desperately Seeking Susan Street Vendor 1986 Maximum Overdrive Videoplayer 1987 Sweet Lorraine Howie 1988 School Daze Julian 1989 Do the Right Thing Buggin' Out 1990 Mo' Better Blues Left Hand Lacey 1990 King of New York Lance 1991 Harley Davidson and the Marlboro Man Jimmy Jiles 1991 Night on Earth YoYo 1992 Bob Roberts John Alijah \"Bugs\" Raplin 1992 Malcolm X Thomas Hagan 1994 Fresh Esteban 1995 The Usual Suspects Jack Baer 1995 Blue in the Face Tommy 1995 The Keeper Paul Lamont Also co-producer 1995 Waiting to Exhale David Matthews Uncredited 1997 Nothing to Lose Charlie Dunt 1997 Big City Blues Georgie 1998 Twilight Reuben Escobar 1998 Phoenix Louie 2001 Josephine Spike 2001 Monkeybone Hypnos 2001 Ali Cassius Marcellus Clay Sr. 2001 Piñero Miguel Algarín 2003 Ash Tuesday Karl 2003 Blind Horizon JC Reynolds 2004 Noise Hank 2004 Doing Hard Time Captain Pierce Direct-to-DVD 2004 A Killer Within Vargas 2005 Hate Crime Det. Esposito 2005 Chupacabra: Dark Seas Dr. Peña Direct-to- DVD 2005 I Will Avenge You, Iago! Director 2005 Back in the Day Benson Copper 2005 Carlito's Way: Rise to Power Little Jeff Direct-to-DVD 2005 Derailed Detective Franklin Church 2006 Last Holiday Senator Dillings 2006 Sherrybaby Parole Officer Hernandez 2006 Rain Ken Arnold 2007 Racing Daylight Fred / Drifter 2007 The Box Detective Dwayne Burkhalter 2007 Mano Nino Short film 2007 Feel the Noise Roberto 2008 Gospel Hill Dr. Palmer Also director and producer 2010 Rabbit Hole Auggie 2011 S.W.A.T.: Firefight Inspector Hollander Direct-to-DVD 2011 Certainty Father Heery 2012 Alex Cross Daramus Holiday 2012 Dreaming American Daytona LeMans Short film 2014 Requiem for the Big East Narrator 2014 Son of Batman Ra's al Ghul (voice) Direct-to-DVD 2014 Batman: Assault on Arkham Black Spider (voice) Direct-to-DVD 2014 Poker Night Bernard 2015 Maze Runner: The Scorch Trials Jorge 2016 The Pills – Sempre meglio che lavorare (it) Bangla Boss 2016 The Jungle Book Akela (voice) 2016 Money Monster Captain Marcus Powell 2016 Brother Nature Congressman Frank McClaren 2017 The Show Mason Washington Also director and producer 2017 Stuck Lloyd 2017 Okja Frank Dawson 2017 Unacknowledged Narrator 2018 Maze Runner: The Death Cure Jorge 2018 MFKZ Mr. K (voice) English dub 2020 The Long Home William Tell Oliver Post-production 2020 Stargirl Archie Post-production 2021 FarCry 6 Antón Castillo TBA Da 5 Bloods Filming ==References== ==Other websites== * Category:Actors from New York City Category:African-American actors Category:African-American movie producers Category:American movie actors Category:American television actors Category:Actors from Copenhagen Category:1958 births Category:Living people",
 "title": "Giancarlo Esposito"
}