{
 "id": "462459",
 "text": "Richard Dawson Kiel (September 13, 1939 – September 10, 2014) was an American actor. He was best known and remembered for his role as Voltaire to Dr. Miguelito Loveless in the first season episodes of The Wild, Wild West (1965-1966). Keil was also known for his prominent role as Jaws in the James Bond movies The Spy Who Loved Me and Moonraker. Keil's movie and television acting career lasted over 50 years. ==Early life== Kiel was born and raised in Detroit, Michigan. He then moved to Fresno, California and began his acting career in Hollywood. ==Acting career== Kiel began his acting career in 1960. His first television role was in the television show Laramie and his first movie role was in the 1961 movie The Phantom Planet. Kiel also played the role of the titanium-toothed Bond villain Jaws in the James Bond movies The Spy Who Loved Me (1977) and Moonraker (1985) as well as in the James Bond video game Everything or Nothing. He also played Mr. Larson in the 1996 comedy film Happy Gilmore. Richard also portrayed all of the Kanamits in the epic Twilight Zone episode \"To Serve Man\" In 1986, Kiel was nominated for a Saturn Award for his role as Jaws in both The Spy Who Loved Me and Moonraker. Kiel's last television role was in the 2000 television series Bloodhounds, Inc. and his last movie was in the 2010 animated movie Tangled, where he provided the voice for the character of Vladimir, a gigantic but soft-hearted thug who collects ceramic unicorns. ==Personal life== Kiel was originally married to Faye Daniels from 1960 until they divorced in 1973. Then, he was married for a second time to Diane Rogers from 1974 until his death in 2014. Both Kiel and Rogers had 4 children together. Keil also had acromegaly, which creates too much growth hormones. In 2005, he also wrote his own autobiography \"Making It BIG In The Movies\". ===Death=== Kiel died on September 10, 2014 in Fresno, California at the age of 74. Kiel died from a heart attack caused by coronary artery disease. He was 3 days away from turning 75. Prior to his death, Keil had been admitted to a hospital in Fresno after breaking his leg the previous week. ==References== ==Other websites== * Category:1939 births Category:2014 deaths Category:Actors from Detroit Category:Actors who played Bond villains Category:American movie actors Category:American stage actors Category:American television actors Category:American video game actors Category:American voice actors Category:Deaths from myocardial infarction Category:Deaths from coronary artery disease",
 "title": "Richard Kiel"
}