{
 "id": "46254",
 "text": "The beak, a bill, or a rostrum is the nose and mouth of a bird. The beak is used for eating, fighting, grooming, and many other things. Beaks on different types of birds can be very different in size, shape and color. Beaks are made of an upper and lower mandible. In most species, two holes are used for breathing. == Parts == The upper and lower parts of the beak are called mandibles. They are attached to the skull. The edges of the mandibles are used for cutting and grabbing food. Some birds have sharp points or grooves on the edge of the beak. These shapes make it easier to hold insects or break seeds. Birds that hunt fish or other animals often have more sharp points. The nostrils are the two breathing holes on the beak. They are usually on the top mandible on the part close to the head. A few species breathe through their mouths and have no nostrils. In some birds the nostrils cannot be seen because they are under feathers or a cover called an operculum. Ducks, geese, and swans have a special plate at the end of the beak called a nail. The nail is hard and is used to force out food that is stuck to a surface or in the ground. The egg tooth is a small, hard lump that grows on the tip of baby bird beaks. It grows before they hatch and falls off soon after. Birds use the egg tooth to break open the egg from the inside. Only a few species of birds kick the inside of the egg to hatch instead of using an egg tooth. == Use == Beaks are used for preening (grooming the feathers). A bird can comb its feathers with its beak to adjust any that are badly positioned. Many birds spread a thin layer of oil onto their feathers, which helps to waterproof them. They also remove any dirt or parasites at the same time. Many birds use beaks during courtship. They may dance, touch each other's beaks, or tap things with their beaks. In some species, birds may preen each other as either a friendship behavior or courting behavior. Birds lose body heat through their beaks because beaks have blood in them and are not covered with feathers. Birds in warm places can lose heat this way without sweating and losing water. Birds in cold climates have smaller beaks to stop too much heat loss. Category:Animal anatomy",
 "title": "Beak"
}