{
 "id": "462780",
 "text": "The State Anthem of the Azerbaijan SSR () was the national anthem of Azerbaijan when it was a republic of the Soviet Union. It was then known as the Azerbaijan SSR.National Anthem of Azerbaijan in the Soviet period (PDF), page 4. Administrative Department of the President of the Republic of Azerbaijan Presidential Library. ==Background== The anthem was used from 1944 to 1992. It was composed by Uzeyir Hajibeyov, who also composed the March of Azerbaijan, the current national anthem of Azerbaijan. Suleyman Rustam, Samad Vurgun and Huseyn Arif wrote the lyrics which were changed in 1978 to remove mentions of Joseph Stalin. Like many national anthems of the republics of the Soviet Union, this song praised Vladimir Lenin (and formerly Joseph Stalin as well), the October Revolution and Communism. It also praised the friendship of the republics of the Soviet Union. It was the anthem of Azerbaijan when it gained independence until 1992 when the March of Azerbaijan was restored. ==Lyrics== ===Post-Stalinist version (1978–92)=== ====Azerbaijani lyrics==== Cyrillic script (then official) Jaꞑalif (obsolete) Perso-Arabic script (then banned) IPA transcription Modern Latin script (in use since 1992) Азәрбајҹан! Чичәкләнән республика, шанлы дијар! Гадир совет елләриндә һәм азадсан, һәм бәхтијар. Октјабрдан гүввәт алыб сән говушдун сәадәтә, Алгыш олсун бу һүнәрә, алгыш олсун бу гүдрәтә Нәгарәт: Јолумуз Ленин јолудур, партијадыр рәһбәримиз, Коммунизмин ҝүнәшилә нурланаҹаг сәһәримиз. Биз ҝедирик ҝәләҹәјә галибләрин ҹәрҝәсиндә, Јаша, јаша, Азәрбајҹан, бөјүк совет өлкәсиндә!'' Одлар јурду, бу ағ ҝүнләр ел ҝүҹүнүн бәһрәсидир, Гәһрәманлыг, бир дә һүнәр азад инсан һәвәсидир. Нәсилләрдән-нәсилләрә јадиҝардыр дәјанәтин, Коммунизмә биз ҝедирик, сыра мөһкәм, аддым мәтин. Нәгарәт Рәшадәтли рус халгыдыр достлуг, бирлик бајрагдары, Мүгәддәсдир, сарсылмаздыр дост елләрин бу илгары. Гардаш халглар бирлијиндән алдыг ҝүҹү, гүдрәти биз, Гој вар олсун бу иттифаг – шанлы Совет Вәтәнимиз! НәгарәтГосударственный гимн Азербайджанской ССР, simvolika.rsl.ruАзербайджанская ССР, СССР наша Родина Azərʙajçan! Cicəklənən respuʙlika, şanlь dijar! Qadir sovet ellərində həm azadsan, həm ʙəxtijar. Oktjaʙrdan qyvvət alьʙ sən qovuşdun səadətə, Alqьş olsun bu hynərə, alqьş olsun ʙu qydrətə! Nəqarət: Jolumuz Lenin joludur, partijadьr rəhʙərimiz, Kommunizmin gynəşilə nurlanaçaq səhərimiz. Biz gedirik gələçəjə qaliblərin çərgəsində, Jaşa, jaşa, Azərʙajçan, ʙɵjyk sovet ɵlkəsində!'' Odlar jurdu, ʙu aƣ gynlər el gyçynyn ʙəhrəsidir, Qəhrəmanlьq, ʙir də hynər azad insan həvəsidir. Nəsillərdən-nəsillərə jadigardьr dəjanətin, Kommunizmə ʙiz gedirik, sьra mɵhkəm, addьm mətin. Nəqarət Rəşadətli rus xalqьdьr dostluq, ʙirlik ʙajraqdarь, Myqəddəsdir, sarsьlmazdьr dost ellərin ʙu ilqarı. Qardaş xalqlar ʙirlijindən aldьq gyçy, qydrəti ʙiz, Qoj var olsun bu ittifaq – şanlь Sovet Vətənimiz! Nəqarət !آذربایجان! چیچک‌لنه‌ن رئسپوبلیکا، شان‌لی دیار .قادیر سووئت ائللرین‌ده هم آزادسان، هم بختیار ،اوکتیابردان قوت آلیب سن قوووشدون سادته آلقیش اولسون بو هونره، آلقیش اولسون بو قودرته :خور ،یولوموز لئنین یولودور، پارتییادیر رهبریمیز .کوم‌مونیزمین گونشیله نورلاناجاق سحریمیز ،بیز گئدیریک گله‌جه‌یه قالیبلرین جرگه‌سین‌ده یاشا، یاشا، آذربایجان، بؤیوک سووئت اؤلکه‌سین‌ده ،اودلار یوردو، بو آغ گونلر ائل گوجونون بهره‌سی‌دیر .قهره‌مان‌لیق، بیر ده هونر آزاد اینسان هوه‌سی‌دیر ،نسیللردن-نسیللره یادیگاردیر دیانتین .کوم‌مونیزمه بیز گئدیریک، سیرا مؤهکه‌م، آددیم متین خور ،رشادت‌لی روس خالقی‌دیر دوستلوق، بیرلیک بایراقداری .مقدس‌دیر، سارسیلمازدیر دوست ائللرین بو ایلقاری ،قارداش خالقلار بیرلیین‌دن آلدیق گوجو، قودرتی بیز قوی وار اولسون بو اتفاق – شان‌لی سووئت وطنیمیز خور [ɑzæɾbɑjd͡ʒɑn ‖ t͡ʃit͡ʃæclænæn ɾespublikɑ ǀ ʃɑŋɫɯ dijɑɾ ‖] [gɑdiɾ sovet elːæɾindæ hæm ɑzɑd̥sɑn ǀ hæm bæχtijɑɾ ‖] [oktjɑbɾ̩dɑŋ gyvːæt ɑɫɯb̥ sæŋ govuʃdun sæɑdætæ ǀ] [ɑɫgɯʃ oɫsum bu hynæɾæ ǀ ɑɫgɯʃ oɫsum bu gydɾætæ ‖] [χoɾ] [joɫumuz leniɲ joɫuduɾ ǀ pɑɾtijɑdɯɾ ɾæhbæɾimiz ǀ] [komːunizmiɲ ɟynæʃilæ nuɾɫɑnɑd͡ʒɑχ ʃæhæɾimiz ‖] [bizʲ ɟediɾiç ɟælæd͡ʒæjæ gɑliblæɾin d͡ʒæɾɟæsindæ ǀ] [jɑʃɑ jɑʃɑ ǀ ɑzæɾbɑjd͡ʒɑn ǀ bœjyç sovet œʎcæsindæ ‖]'' [odɫɑɾ juɾdu ǀ bu ɑʝ ɟynlæɾ eʎ ɟyd͡ʒynym bæhɾæsidiɾ ǀ] [gæhɾæmɑŋɫɯχ ǀ biɾ dæ hynæɾ ɑzɑd insɑn hævæsidiɾ ǁ] [næsilːæɾdæn næsilːæɾæ jɑdigɑɾdɯɾ dæjɑnætin ǀ] [komːunizmæ bizʲ ɟediɾiç ǀ sɯɾɑ mœhcæm ǀ ɑdːɯm mætin ‖] [χoɾ] [ɾæʃɑdætli ɾus χɑɫgɯdɯɾ dostɫuχ ǀ biɾliç bɑjɾɑgdɑɾɯ ǀ] [mygædːæsdiɾ ǀ sɑɾsɯɫmɑzdɯɾ dost elːæɾim bu iɫgɑɾɯ ‖] [gɑɾdɑʃ χɑɫgɫɑɾ biɾlijindæn ɑɫdɯχ ɟyd͡ʒy ǀ gydɾæti biz ǀ] [goj vɑɾ oɫsum bu itːifɑχ ǀ ʃɑŋɫɯ sovet vætænimiz ‖] [χoɾ] Azərbaycan! Çiçəklənən respublika, şanlı diyar! Qadir sovet ellərində həm azadsan, həm bəxtiyar. Oktyabrdan qüvvət alıb sən qovuşdun səadətə, Alqış olsun bu hünərə, alqış olsun bu qüdrətə! Xor: Yolumuz Lenin yoludur, partiyadır rəhbərimiz, Kommunizmin günəşilə nurlanacaq səhərimiz. Biz gedirik gələcəyə qaliblərin cərgəsində, Yaşa, yaşa, Azərbaycan, böyük sovet ölkəsində!'' Odlar yurdu, bu ağ günlər el gücünün bəhrəsidir, Qəhrəmanlıq, bir də hünər azad insan həvəsidir. Nəsillərdən-nəsillərə yadigardır dəyanətin, Kommunizmə biz gedirik, sıra möhkəm, addım mətin. Xor Rəşadətli rus xalqıdır dostluq, birlik bayraqdarı, Müqəddəsdir, sarsılmazdır dost ellərin bu ilqarı. Qardaş xalqlar birliyindən aldıq gücü, qüdrəti biz, Qoy var olsun bu ittifaq – şanlı Sovet Vətənimiz! Xor Azərbaycan SSR-in Dövlət himni, Azərbaycan :: Baş səhifə ====Translations==== Russian English Азербайджан! Республика весны, отваги и труда! Свободный край, счастливый край в союзе братском навсегда. В огне борьбы взошла твоя неугасимая заря; Твоя судьба окрылена высоким солнцем Октября. Припев: Путь к счастью Ленин нам открыл, ведет нас партия вперед, И коммунизма ясный свет к свершеньям доблестным зовет. Мы сотворили новый мир, в грядущий день устремлены. Так славься, наш Азербайджан, в семье республик всей страны! Страна огней, заветный край, земля любимая навек! Здесь вдохновенный, щедрый труд вершит свободный человек. Благословенная земля светлей и краше с каждым днем. Тепло сердец, сиянье дум Стране Советов отдаем. Припев Непобедим, несокрушим союз народов — наш оплот, И знаменосцем дружбы той великий русский стал народ. Единству нашему верны — прочнее сплава в мире нет! Мы твердой поступью идем дорогой славы и побед. ПрипевГосударственный гимн Азербайджанской ССР, Азербайджан :: Главная страница Azerbaijan, the glory, the flowers of the Republic! The Soviet people to bring a strong new birth of freedom. October Revolution will be happy to give you infinite courage. Cheers for the extraordinary wisdom, cheering for the people's power! Refrain: Wise leadership of the party of Lenin created we walk in the road. Sun shine communism, shines with the city and countryside. We continue to win tomorrow's victory laurel to forge ahead. Long live, long live, Azerbaijan, the great Soviet land! The Fire country, Snow peak cultivated proven people. Fearless thirst for freedom fighting hero is a martyr. The determination of a thousand memories transmission burst today, We move towards communism, the pace of a firm and stable. Refrain The friendly people of Russia, the heroic champion of the league, To firmly hold the sacred sincere hand of friendship. Forces from alliance unbreakable fraternal peoples, Let this treasure filled with glorious Soviet motherland! RefrainThe national Anthem of Azerbaijan SSR, Azerbaijan :: Main page ===Original version (1944–78)=== ===Azerbaijani lyrics=== Cyrillic script (after 1958) Cyrillic script (1939–58) Jaꞑalif (1933–39) IPA transcription Modern Latin script (1992–present) Азәрбајҹан – дүнја ҝөрмүш бу шәрәфли, шанлы дијар, Вәтән ешги бабалардан галмыш әзиз бир јадиҝар, Ганлы дөјүш мејданында биз јаратдыг ағ ҝүнләри – Нәсилләрдән нәсилләрә јурдумузун шөһрәти вар. Хор: Гој вар олсун Азәрбајҹан, Одлар јурду – Ана вәтән Гоҹа Шәргә ҝүнәш доғур јурдумузун гүдрәтиндән. Бајрағымыз сосиализмин гардаш елләр дүнјасыдыр, Јаша вәтән! Халгымызын шәрәфисән, шөһрәтисән.'' Устадымыз бөјүк Ленин – шанлы зәфәр бајрағымыз, Рәһбәримиз Сталиндир – бизим һәјат нөврағымыз. Ҝөзәл Бакы! Гүдрәтиндән илһам алыр Азәрбајҹан – Азад елли, азад ҝүнлү доғма Совет торпағымыз. Хор Гардашымыз рус халгыдыр азадлығын бајрагдары, Ганымызла сувармышыг бу достлуғу, бу илгары, Јер үзүнүн шөһрәтидир шанлы Совет торпағымыз – Бу торпагда чичәк ачды инсанлығын илк баһары… Хор Азәрбайҹан – дүня ҝөрмүш бу шәрәфли, шанлы дияр, Вәтән эшги бабалардан галмыш әзиз бир ядиҝар, Ганлы дөйүш мейданында биз яратдыг ағ ҝүнләри – Нәсилләрдән нәсилләрә юрдумузун шөһрәти вар. Хор: Гой вар олсун Азәрбайҹан, Одлар юрду – Ана вәтән Гоҹа Шәргә ҝүнәш доғур юрдумузун гүдрәтиндән. Байрағымыз сосиализмин гардаш элләр дүнясыдыр, Яша вәтән! Халгымызын шәрәфисән, шөһрәтисән.'' Устадымыз бөйүк Ленин – шанлы зәфәр байрағымыз, Рәһбәримиз Сталиндир – бизим һәят нөврағымыз. Ҝөзәл Бакы! Гүдрәтиндән илһам алыр Азәрбайҹан – Азад элли, азад ҝүнлү доғма Совет торпағымыз. Хор Гардашымыз рус халгыдыр азадлығын байрагдары, Ганымызла сувармышыг бу достлуғу, бу илгары, Ер үзүнүн шөһрәтидир шанлы Совет торпағымыз – Бу торпагда чичәк ачды инсанлығын илк баһары… Хор Azərʙajçan – dynja gɵrmyş ʙu şərəfli, şanlь dijar, Vətən eşqi ʙaʙalardan qalmьş əziz ʙir jadigar, Qanlь dɵjyş mejdanьnda ʙiz jaratdьq aƣ gynləri – Nəsillərdən nəsillərə jurdumuzun şɵhrəti var. Xor: Qoj var olsun Azərʙajçan, Odlar jurdu – Ana vətən Qoça Şərqə gynəş doƣur jurdumuzun qydrətindən. Bajraƣьmьz sosializmin qardaş ellər dynjasьdьr, Jaşa vətən! Xalqьmьzьn şərəfisən, şɵhrətisən.'' Ustadьmьz ʙɵjyk Lenin – şanlь zəfər ʙajraƣьmьz, Rəhʙərimiz Stalindir – ʙizim həjat nɵvraƣьmьz. Gɵzəl Bakь! Qydrətindən ilham alьr Azərʙajçan – Azad elli, azad gynly doƣma Sovet torpaƣьmьz. Xor Qardaşьmьz rus xalqьdьr azadlьƣьn ʙajraqdarь, Qanьmьzla suvarmьşьq ʙu dostluƣu, ʙu ilqarь, Jer yzynyn şɵhrətidir şanlь Sovet torpaƣьmьz – u torpaqda cicək acdь insanlьƣьn ilk ʙaharь… Xor [ɑzæɾbɑjd͡ʒɑn ‖ dyɲjɑ ɟœɾmyʃ bu ʃæɾæfli ǀ ʃɑŋɫɯ dijɑɾ ǀ] [vætæn eʃgi bɑbɑɫɑɾdɑŋ gɑɫmɯʃ æziz biɾ jɑdiɟɑɾ ǀ] [gɑŋɫɯ dœjyʃ mejdɑnɯndɑ bizʲ jɑɾɑtdɯχ ɑʝ ɟynlæɾi ǀ] [næsilːæɾdæn næsilːæɾæ juɾdumuzun ʃœhɾæti vɑɾ ‖] [χoɾ] [goj vɑɾ oɫsun ɑzæɾbɑjd͡ʒɑn ǀ odɫɑɾ juɾdu ǀ ɑnɑ vætæn] [god͡ʒɑ ʃæɾgæ ɟynæʃ doɣuɾ juɾdumuzuŋ gydɾætindæn ‖] [bɑjɾɑɣɯmɯz̥ sosiɑlizmiŋ gɑɾdɑʃ elːæɾ dyɲjɑsɯdɯɾ ǀ] [jɑʃɑ vætæn ‖ χɑɫgɯmɯzɯn ʃæɾæfisæn ǀ ʃœhɾætisæn ‖]'' [ustɑdɯmɯz bœjyç lenin ǀ ʃɑŋɫɯ zæfæɾ bɑjɾɑɣɯmɯz ǀ] [ɾæhbæɾimiz̥ stɑlindiɾ ǀ bizim hæjɑt nœyɾɑɣɯmɯz ‖] [ɟœzæl bɑcɯ ‖ gydɾætindæn ilhɑm ɑɫɯɾ ɑzæɾbɑjd͡ʒɑn ǀ] [ɑzɑd elːi ǀ ɑzɑd ɟynly doɣmɑ sovet toɾpɑɣɯmɯz ‖] [χoɾ] [gɑɾdɑʃɯmɯz ɾus χɑɫgɯdɯɾ ɑzɑdɫɯɣɯm bɑjɾɑgdɑɾɯ ǀ] [gɑnɯmɯzɫɑ suvɑɾmɯʃɯɣ bu dostluɣu ǀ bu iɫgɑɾɯ ǀ] [jeɾ yzynyn ʃœhɾætidiɾ ʃɑŋɫɯ sovet toɾpɑɣɯmɯz ǀ] [u toɾpɑgdɑ t͡ʃit͡ʃæç ɑt͡ʃdɯ insɑŋɫɯɣɯn iʎç bɑhɑɾɯ ‖] [χoɾ] Azərbaycan – dünya görmüş bu şərəfli, şanlı diyar, Vətən eşqi babalardan qalmış əziz bir yadigar, Qanlı döyüş meydanında biz yaratdıq ağ günləri – Nəsillərdən nəsillərə yurdumuzun şöhrəti var. Xor: Qoy var olsun Azərbaycan, Odlar yurdu – Ana vətən Qoca Şərqə günəş doğur yurdumuzun qüdrətindən. Bayrağımız sosializmin qardaş ellər dünyasıdır, Yaşa vətən! Xalqımızın şərəfisən, şöhrətisən.'' Ustadımız böyük Lenin – şanlı zəfər bayrağımız, Rəhbərimiz Stalindir – bizim həyat növrağımız. Gözəl Bakı! Qüdrətindən ilham alır Azərbaycan – Azad elli, azad günlü doğma Sovet torpağımız. Xor Qardaşımız rus xalqıdır azadlığın bayraqdarı, Qanımızla suvarmışıq bu dostluğu, bu ilqarı, Yer üzünün şöhrətidir şanlı Sovet torpağımız – u torpaqda çiçək açdı insanlığın ilk baharı… Xor ====Translations==== Russian English Азербайджан – увидел мир эту славную, доблестную страну, Славная Родина, оставшаяся в памяти от отцов, На поле сражения в кровавой битве мы сотворили светлые дни – Из поколения в поколения прославляется наша Родина. Припев: Пусть процветает Азербайджан, Родина – Страна Огней Могущество Родины озаряет солнцем Старый Восток. Наш флаг является миром для братских социалистических республик, Живи Родина! Ты слава нашего народа. Наш вождь Великий Ленин – славный флаг победы, Лидер Сталин – наш путеводитель в жизни. Прекрасный Баку! Азербайджан вдохновляется от твоей мощи, Родная Советская земля, свобода народа, свобода дня. Припев Русский народ – наши братья, знаменосцы свободы, Эту дружбу, этот свет мы окропили кровью. Доблестная советская земля, ты слава Мира – Открылись первые весенние цветы человечества на этой Земле! Припев Azerbaijan the worldly glorious, glorious land, Motherland love left from fathers, a dear love We have created shiny days at the bloody battlefields The popularity of our country exist from generations to generations. Refrain: Long live Azerbaijan, Land of Fire – our Motherland Old East is caused our a sunrise from the might of our country. Our flag is a world of fraternal socialism, Long live the Motherland! You are the glory of our people, pride. Our leader the great Lenin – our glorious victory flag, Stalin's guide, the life style of ours. Beautiful Baku! Azerbaijan takes inspiration from your might Free nation, free days in this native Soviet land. Refrain Russian people are our brothers, the flag carriers of freedom, We have fed this friendship, this inspiration with our blood, The glorious Soviet land is the pride of the earth The first spring of humanity flourished in this land… Refrain ==Related pages== * National anthem of Azerbaijan ==References== ==Other websites== * MIDI file * Vocal recording in MP3 format * Lyrics - nationalanthems.info Category:National symbols of Azerbaijan Category:1944 establishments in the Soviet Union Category:1992 disestablishments Category:Anthems of Soviet Socialist Republics Category:Azerbaijan Soviet Socialist Republic",
 "title": "Anthem of the Azerbaijan Soviet Socialist Republic"
}