{
 "id": "462919",
 "text": "Sir Marcus Laurence Elwin \"Mark\" Oliphant, (8 October 1901 – 14 July 2000), commonly known as Marcus Oliphant, was an Australian physicist and humanitarian. He helped to develop nuclear weapons. He was involved with the first experimental demonstration of nuclear fusion. == Biography == Oliphant was born on 8 October 1901 in Kent Town, Adelaide, Australia. His father, Harold George “Baron” Oliphant, was a civil servant. His mother, Beatrice Edith Fanny Oliphant, was an artist. After graduating from Adelaide High School in 1918, he was unable to get money to pay for university. He got a job cleaning floors at a jewelry store. He was soon able to study at the University of Adelaide. He was interested in medicine, but Kerr Grant, the physics professor, offered him a place in the Physics Department. He received his Bachelor of Science degree in 1921. Oliphant attempted to build a cyclotron at the University of Birmingham. The completion of it was postponed by the World War II in Europe in 1939. He was involved with the development of radar with John Randall and Harry Boot. They created a completely new design, the cavity magnetron, which made microwave radar possible. His most important achievement was being involved with the development of the atomic bomb. He reported that it was possible, and achievable as early as 1943. He spread his research in the United States, which led to the development of the Manhattan Project, led by physicist J. Robert Oppenheimer. Oliphant died on 14 July 2000 in Canberra, Australia. ==Achievements == Many places and things are named after Oliphant. There is the Oliphant building at the Australian National University, the Mark Oliphant Conservation Park, a South Australian high schools science competition, the Oliphant Wing of the Physics Building at the University of Adelaide, and a high school in Munno Para West, South Australia. He is known for the co-discovery of deuterium, tritium, helium-3 and nuclear fusion and for the development of microwave radar. ==Awards== He achieved many awards over the course of his life. *1937 Elected Fellow of the Royal Society *1943 Awarded Hughes Medal by the Royal Society *1946 Awarded Silvanus Thomson Medal, Institute of Radiology *1948 Awarded Faraday Medal by the Institution of Engineers *1954 Elected (Foundation) Fellow of the Australian Academy of Science *1954 Elected (Foundation) President of the Australian Academy of Science *1955 Invited to deliver the Bakerian Lecture by the Royal Society *1955 Invited to deliver the Rutherford Memorial Lecture by the Royal Society *1956 Received Galathea Medal from King Frederick IX of Denmark *1959 Created Knight Commander of the Order of the British Empire *1977 Appointed Companion of the Order of Australia Category:1901 births Category:2000 deaths Category:Australian physicists Category:Nuclear engineers",
 "title": "Marcus Oliphant"
}