{
 "id": "462916",
 "text": "Archibald William Roach (8 January 1956 – 30 July 2022) was an aboriginal-Australian singer-songwriter and guitarist. Roach was born in Mooroopna, Victoria, Australia.Abc.net.au,. 2008. 'Talking Heads - Archie Roach And Ruby Hunter'. Accessed June 8 2015. http://www.abc.net.au/tv/talkingheads/txt/s22 His songs are popular in the Australian Aboriginal community. == Early Life == At the age of three or four, Roach was taken from his family by the Australian government. His two sisters were also taken away. After spending time in an orphanage, he was raised in Melbourne, Australia, by a white family, who had moved to Melbourne from Scotland.AllMusic,. 2015. 'Archie Roach | Biography | Allmusic'. Accessed June 8 2015. http://www.allmusic.com/artist/archie-roach-mn0000601551/biography As a teenager, Roach ran away from home to look for his biological parents. After running away, while homeless and abusing alcohol, Roach met his wife, musician Ruby Hunter. During the late 1980s, Roach and Hunter created a band named “Altogether” with other Aboriginal musicians. ==Health and death== In mid-2011, Roach was diagnosed with early lung cancer, and had one of his lungs removed. While recovering, he released his hit album “Into the Bloodstream.”Lungfoundation.com.au,. 2014. 'Lung Cancer Survivor Archie Roach Shines A Hopeful Light | Lung Foundation Australia'. Accessed June 8 2015. http://lungfoundation.com.au/lung-cancer-survivor-archie-roach-shines-a-hopeful-light/ . Roach died on July 30, 2022 in Warrnambool, Victoria from a long-illness, aged 66. ==Awards and achievements== His album Charcoal Lane won an ARIA Award as the Best Indigenous Album of the Year. He was given an ARIA Award as the Best New Talent. The Rolling Stone Magazine listed it in the Top 50 Albums of 1992. Looking for the Butter Boy won three ARIA Awards in 1998. In 2013, Roach won a Deadly Award for Album of the Year. He has also won two ARIA awards and a national Human Rights Award for his songs “Took the Child Away” and “Charcoal Lane.” Many of his songs talk about his experiences and the difficulties he has faced as an Aboriginal Australian. In 2015 Roach was made a member of the Order of Australia.ABC News,. 2015. 'Singer Song-Writer Archie Roach Honoured On Queen's Birthday'. Accessed June 8 2015. http://www.abc.net.au/news/2015-06-08/singer-song-writer-archie-roach-honoured-on-queens-birthday/6526182. ==Discography== * Koorie (with Ruby Hunter) (1989) * Charcoal Lane (1990) * Jamu Dreaming (1993) * Searching for the Butter Boy (1997) * Sensual Being (2002) * The Tracker (Movie soundtrack 2002) * Journey (2007) * Into the Bloodstream (2012)Archieroach.com.au,. 2015. 'Archie Roach - Official Website'. Accessed June 8 2015. http://www.archieroach.com.au == References == ==Other websites== * http://www.murundakdocumentary.com/artists/archie-roach/ * http://www.archieroach.com.au/#!/page_More * http://trove.nla.gov.au/people/594496 * http://www.theglobalmail.org/feature/stolen-lost-and-found/446/ Category:Indigenous Australian musicians Category:Order of Australia Category:1956 births Category:2022 deaths Category:Australian rock singers Category:Australian rock musicians Category:Australian guitarists Category:Australian singer-songwriters Category:Musicians from Victoria (Australia) Category:Writers from Victoria (Australia)",
 "title": "Archie Roach"
}