{
 "id": "462974",
 "text": "ITV is a British free-to-air commercial television channel in the United Kingdom owned and operated by ITV Digital Channels, a division of ITV plc, and is a part of ITV network. Previously a network of separate regional television channels, ITV currently operates in England, Wales, Scotland, the Channel Islands and United States. From 2001 until 2013, the channel was called ITV1. In 2004, Granada acquired Carlton Communications to form ITV plc. ITV also manages an international network supported by subscription services, and its programmes are also available in the UK via Freesat, Sky, Virgin Media, Freeview, and ITV Hub. A Europe version of ITV launched in 2004 on FL1, Citycable, Orange TV, Dstv, YouView & UPC Programming. ITV launched in Middle East and North Africa on beIN. An Asian version of ITV launched in 2014 on TVPlayer, beIN and Virgin TV Go. An Australian version of ITV launched in 2008 on Swisscom TV Australia & Sky Go. In 2006, they purchased ITV for their selves after Carlton Communications. The companies filed for Chapter 11 bankruptcy in September 2022, closing ITV channel in the world. Phillip has confirmed that there would be no more ITV after 2013 and 2019 channels. ITV1 will be available for the new name and it will be released on 15 November 2022. == History == ITV was launched in 1955 as Independent Television the first TV channel in the United Kingdom. ITV name was only used in England, Wales, Southern Scotland and Isle of Man until Channel Television adopted the name in January 2006, bringing it to the Channel Islands. The licensees that used the ITV & ITV1 brand are: ITV Anglia, ITV Border, ITV Carlton Television, ITV Central Independent Television, ITV Channel Television, ITV Granada, ITV Wales & West, ITV London Weekend Television, ITV Meridian, ITV Tyne Tees, ITV Westcountry and ITV Yorkshire. The network production arms of the ITV-plc owned licencees have been gradually combined since 1993 to eventually form ITV Studios. == Regions == Broadcast area Pre-ITV1 branding Post-ITV1 branding English-Scottish border/Isle of Man Border ITV North East England Tyne Tees ITV Yorkshire and Lincolnshire Yorkshire ITV North West England Granada ITV Wales HTV Wales ITV Cymru Wales West of England HTV West ITV The Midlands Carlton Central ITV East of England Anglia ITV London (weekdays) Carlton London ITV London (weekends) LWT (London Weekend Television) ITV South and South East England Meridian ITV South West England Carlton Westcountry ITV Channel Islands Channel ITV Channel Television In the English regions, + Border Scotland, Channel Islands Isle of Man and Channel of Man the channel has been known from 2006 until 2013 as ITV1, since 14 January 2013 to 2022 as ITV at all times and November 15, 2022 as ITV1 at all times. The ITV Wales name is not used overnight. Areas without full ITV branding: Broadcast area Present Branding Former Branding Northern Ireland UTV Ulster Television*** Northern Scotland STV (North) Grampian Television Central Scotland STV (Central) Scottish Television == Branding and Idents == === Independent Television (1955–1989) === From the founding of the ITV Network in 1955, it was known nationally as Independent Television (later ITV) and locally by the regional branding of the local ITV franchise operator. === ITV (1989–1998) === In 1989, the ITV Association set out a basic presentation package with a new \"ITV\" logo, which included idents, promotions and general on and off air design, and an edit of this package was designed for each franchise holder. The dual branded idents included a large \"ITV\" logo, in which the \"V\" contained Viking part of the franchise's logo, and written below the logo in a grey capitalised font was the name of the regional broadcaster. However, only half of the regional broadcasters opted to use the package, which had completely failed by 1997. ====ITV (1998-2001)==== In 1999, another second common presentation (once again using dual-branding with the ITV name) was launched, under the theme, \"TV from the Heart\". === ITV1 (2001–2013) === By 2001, all eleven franchises of England and Wales were owned by either Granada plc or Carlton Communications, and a new common name, ITV1, was launched on 11 August 2001 to coincide with digital channel ITV2. The existing \"Hearts\" idents were simply re-edited. In January 2006, the channel adopted a new on- air look to coincide with the launch of ITV4, designed mainly to improve cross-channel promotion across ITV's multichannel presence. The new logo brought ITV1, ITV2 and ITV3 in line with ITV4's, and had been observed on various billboard ads in the UK when the new identity was first used on-screen on 16 January 2006. ==== ITV Day ==== In 2005, ITV plc introduced a new channel branding called ITV Day, used to identify ITV1 between 9.25am and 6.00pm. ITV Day was treated as a separate entity to ITV1 and featured its own presentation set focusing using the colours of red, orange and yellow and featured scenes of typical \"daytime\" activities. Promotions were used in a similar format to ITV1, and all daytime programmes advertised within ITV1 hours were branded with the ITV Day logo. A similar \"UTV Day\" branding was adopted in Northern Ireland. Michael Grade took ITV customers to ITV HD took place in 2006. === 2013 rebranding === On 15 November 2012, it was announced that as part of a major rebranding, ITV1 was renamed back to its previous name, ITV. In addition to this, ITV had a new colour-changing logo stylised as handwriting, that changed colour depending on the programming it is used on. It was revealed that the logo had green and purple for Dancing on Ice, and green and brown for I'm a Celebrity...Get Me Out of Here!. The overhaul is linked to ITV's attempt to cut costs, curb debts and reduce the company's reliance on advertising. This overhaul of their brand affected all ITV plc channels and online services. This rebrand went live on 14 January 2013, at the same time as the other ITV channels. Also for the first time in its history, a digital on-screen graphic (DOG) was introduced. ===2019 rebranding=== On January 1, 2019, Grade renamed its logo, and is owned by Wayback Machine in England. The logo is now ITV Digital Channels in 2019 instead of ITV plc so as of 2022, 2023 and 2024, ITV plc and ITV Digital Channels continues the channel to use this logo. ===2022 rebranding=== As of 2022, both channels continues to use their logos. The dual branded idents included a medium \"ITV1\" logo in which the V and 1 contained the part of the franchise logo, and written the below the logo in a light blue capitalised font that was printed on regular broadcasters. == Spin-off channels == ITV has two spin-off channels, ITV HD & ITV +1, which both launched in 2009. ITV HD was originally available in 2006 for a while for some programming, but officially launched in 2009. * CITV on ITV2 was ITV and CITV2 when CITV+1 ITV2 launch of the day ITV2 +1 Start of CITV+1 'stv' CSTV * CITV+1 or ITV+1HD == Availability outside the UK == ITV (as UTV) is widely available in the Republic of Ireland on cable and MMDS, as well as being received directly in areas bordering Northern Ireland, or in coastal areas from Wales (as ITV Wales). It is also available on cable and IPTV in Switzerland and Liechtenstein. Since 27 March 2013, ITV London has been offered by British Forces Broadcasting Service (BFBS) to members of HM Forces and their families around the world, replacing the BFBS3 TV channel, which already carried a selection of ITV programmes. == Logos == File:ITV1 logo 2004.png|The ITV1 logo was broken into blocks and was used from November 2004 to November 2006. File:ITV1 2006.png|The ITV1 logo text was changed from white to black. Logo used from November 2006 to April 2010. File:ITV1.png|Third ITV1 logo used from April 2010 to January 2013. ==Programming== * Fast Forward == References == ==Other websites== * Category:1955 establishments in the United Kingdom Category:ITV (TV network)",
 "title": "ITV1"
}