{
 "id": "46319",
 "text": "Sauropsids are a group of land vertebrates which includes all existing reptiles and birds and their fossil ancestors. They are one of the two groups which evolved from egg-laying amniotes in the first part of the Carboniferous period.Gauthier J.A; Kluge A.G & Rowe T. 1988. The early evolution of the Amniota. pp103–155 in Michael J. Benton (ed) The phylogeny and classification of the tetrapods, Volume 1: Amphibians, Reptiles, Birds. Systematics Association, Special vol 35A. Clarendon Press, Oxford.Gauthier J.A. 1994. The diversification of the amniotes. In D.R. Prothero and R.M. Schoch (eds) Major features of vertebrate evolution. 129-159. Knoxville, Tennessee: The Paleontological Society.Laurin M. & Gauthier J.A. 1996. Amniota, mammals, reptiles (turtles, lizards, Sphenodon, crocodiles, birds) and their extinct relatives. Version 01 January 1996. The Tree of Life Web Project. The synapsids are the other group which evolved from amniotes. They gave rise, eventually, to the mammals. Living sauropsids include lizards, snakes, turtles, crocodiles, and birds. Extinct sauropsids include non-avian dinosaurs, pterosaurs, plesiosaurs, ichthyosaurs, and many others. ==Origin of tetrapods== More or less, the evolution of tetrapods has taken this course: *Sarcopterygii **Coelacanthimorpha (Coelacanths) **Dipnoi (lungfish) ***Tetrapodomorpha The earliest tetrapods lived in water.Clack, Jennifer 2012. Gaining ground: the origin and early evolution of tetrapods. 2nd ed, Bloominton, Indiana: Indiana University Press. , () Clear fossil tetrapod tracks from the mid-Devonian predate previous tetrapod records by 18 million years.Janvier, Phillipe and Clément, Gaël 2010. Muddy tetrapod origins. Nature 463, p40. Nine genera of Devonian tetrapods have been described. These earliest tetrapods were not terrestrial. They lived in swampy habitats like shallow wetlands, coastal lagoons, brackish river deltas, and even shallow marine sediments. ===Romer's gap=== Between the lobe-finned fish tetrapods and the first amphibia and amniotes in the Middle Carboniferous lies a gap of 30 million years, with few satisfactory tetrapod fossils. This is \"Romer's gap\".Romer A.S. 1949. The vertebrate body. Saunders, Philadelphia. 2nd ed. 1955; 3rd ed. 1962; 4th ed. 1970 Some new fossils were found in the 1990s, such as Pederpes, right in the middle of the Romer Gap. The gap still obscures the details of the tetrapod transition. Sometime, in the later Devonian or earliest Carboniferous, the fishapods became mainly land-based. One group of them kept their link to the water, and always laid their eggs in water. They became the amphibians. The others evolved a way of laying eggs on land. They were the amniotes, whose key innovation was the cleidoic egg. Sometime in the middle or lower Carboniferous, the amniotes split into two lines. One line lead to the reptiles of all kinds, and we call that the Sauropsida. The other line led eventually to the mammals, and we call that the Synapsida. It is not right to say \"mammals evolved from reptiles\" because both groups derived from early amniotes. In any event, modern reptiles are vastly different from modern mammals.Goodrich E.S. 1930. Studies on the structure and development of vertebrates. Macmillan, London. xxx+837p, 754 figures. One of the great works of vertebrate comparative anatomy. Both groups have evolved for over 300 million years from the early amniotes. ==Tetrapods== *Land-dwelling tetrapods **Amphibians > amniota and present-day amphibians **Amniota ***Sauropsida > present-day reptiles and birds ***Synapsida > present-day mammals ==References==",
 "title": "Sauropsid"
}