{
 "id": "46317",
 "text": "This is a list of mottos for the different states of the United States. To help tourism, states can also make state slogans. State Motto Translation (If applicable) Alabama Audemus jura nostra defendere (Latin, \"We dare to defend our rights\" or \"We Dare Maintain Our Rights\") Alaska North to the Future Arizona Ditat Deus (Latin, \"God enriches\") Arkansas Regnat populus (Latin, \"The people rule\") California Eureka (Greek, \"I have found it\") Colorado Nil sine numine (Latin, \"Nothing without Providence\" or \"Nothing without the Deity\") Connecticut Qui transtulit sustinet (Latin, \"He who transplanted sustains\") Delaware Liberty and independence Florida In God we trust Georgia Wisdom, Justice, Moderation Hawaii Ua Mau ke Ea o ka ‘Āina i ka Pono (Hawaiian, \"The life of the land is perpetuated in righteousness\") Idaho Esto perpetua (Latin, \"Let it be perpetual\") Illinois State sovereignty, national union Indiana The crossroads of America Iowa Our liberties we prize and our rights we will maintain Kansas Ad astra per aspera (Latin, \"To the stars through difficulties\") Kentucky English: United we stand, divided we fall Latin: Deo gratiam habeamus (Latin, \"Let us be grateful to God\"; adopted in 2002) Louisiana Union, justice, and confidence Maine Dirigo (Latin, \"I direct\") Maryland Fatti maschi, parole femmine / Scuto bonae voluntatis coronasti nos / crescite et multiplicamini (Italian, \"Strong deeds, gentle words\") / (Latin \"By the shield of your good will you have crowned us\") / (Latin \"grow and multiply\") Massachusetts Ense petit placidam sub libertate quietem (Latin, \"By the sword we seek peace, but peace only under liberty\") Michigan Si quaeris peninsulam amoenam circumspice / Tuebor (Latin, \"If you seek a pleasant peninsula, look about you\") / (Latin, \"I will defend\") Minnesota L’étoile du Nord / Quae sursum volo videre (French, \"The star of the North\") / (Latin, \"I long to see what is beyond\") Mississippi Virtute et armis (Latin, \"By valor and arms\") Missouri Salus populi suprema lex esto (Latin, \"The Welfare of the People is the Highest Law\") Montana Oro y plata (Spanish, \"Gold and silver\") Nebraska Equality before the law Nevada All for our country New Hampshire Live free or die New Jersey Liberty and Prosperity New Mexico Crescit eundo (Latin, \"It goes by growing\") New York Excelsior! (Latin, \"Ever Upward!\") North Carolina Esse quam videri (Latin, \"To be, rather than to seem\") North Dakota Liberty and union, now and forever, one and inseparable / Strength from the soil Daniel Webster quote used on the Great Seal / motto used on the Coat of Arms Ohio With God, all things are possible / Imperium in imperio (Latin \"an empire in an empire\") (an empire in an empire was repealed) Oklahoma Labor omnia vincit (Latin, \"Hard work conquers all things\") Oregon The Union, and Alis volat propriis (Latin, \"She flies with her own wings\") Pennsylvania Virtue, Liberty and Independence Rhode Island Hope South Carolina Dum spiro spero / animis opibusque parati (Latin, \"While I breathe, I hope\" / \"prepared in minds and resources\") South Dakota Under God the people rule Tennessee Agriculture and Commerce Texas Friendship Utah Industry Vermont Freedom and Unity and Stella quarta decima fulgeat (Latin, \"May the 14th star shine bright\") Virginia Sic semper tyrannis (Latin, \"Thus always to tyrants\") Washington Al- ki (Chinook Jargon, \"By and by\") West Virginia Montani semper liberi (Latin, \"Mountaineers are always free\") Wisconsin Forward Wyoming Equal Rights and Cedant arma togae. (Latin, \"Let weapons yield to the toga.\") == District of Columbia and United States Territories == Jurisdiction Motto Translation (If applicable) American Samoa Samoa, Muamua Le Atua (Samoan, \"Samoa, Let God be First\") District of Columbia Justitia Omnibus (Latin, \"Justice for all\") Puerto Rico Joannes Est Nomen Eius (Latin, \"John is his name\") In honor of San Juan, i.e. John the Baptist Guam Where America's Day Begins Virgin Islands United in Pride and Hope ==Related pages== * List of U.S. state nicknames ==References== == Other websites == * http://www.cco.net/~paz/motto&songs.htm; * Kentucky's newer motto Mottos, List of U.S. state *",
 "title": "List of U.S. state mottos"
}