{
 "id": "463288",
 "text": "American imperialism is the American policy of maintaining or extending power over foreign nations, particularly through expansionism. Expansionism was a primary objective of most empires, an example being the British Empire. This includes politics, money, culture, and the military. After World War II, the United States became a strong and powerful country. This influence continues today. It has a strong global influence. American imperialism began in the 1890s. In 1896, the US annexed the Hawaiian Islands. After the Spanish- American War, the US annexed Puerto Rico, Guam, and the Philippines. In 1914, the US completed the Panama Canal. The Roosevelt Corollary to the Monroe Doctrine increased American influence in Latin America. It was the basis for Roosevelt's Big Stick policy. == History == === Before World War II === Before World War II, America was isolationist, in accordance with the wishes of its first president, George Washington. Starting at the beginning of the 20th century, its influnce grew with movies and music. It also had a very important role in World War I, which led to much discussion within America. === After World War II === After World War II, the United States became very strong. It had a good economy. When the Marshall Plan started in 1948, America helped rebuild Europe. This started America's close relationship with Europe. Because of all this, other countries became dependent on the United States and followed its lead. It was a founding member of the UN, an organization made to make countries work together. === Cold War === During the Cold War, the United States and the Soviet Union were the two big powers. The US wanted to stop the spread of communism, so it formed alliances like NATO and gave aid to other countries. This made the U.S. very influential and important to global politics. === After the Cold War === When the Soviet Union collapsed in 1991, the United States became the only superpower. This made the world unipolar (one central power), with the U.S. as the main leader. The US shaped international institutions, made economic rules, and sometimes used its military in different parts of the world. == Economic power == The U.S. dollar is the main currency used around the world. This makes the U.S. very powerful economically. Organizations like the International Monetary Fund (IMF) and the World Bank are also influenced by the U.S. This helps the U.S. set global economic policies and make trade agreements that help its interests (what the US wants). == Cultural influence == American culture, like movies, music, and technology, is spread worldwide. American tech companies, social media, and fashion also have a big impact. == Challenges and concerns == Some people criticize America. They say the U.S. sometimes acts like an empire, putting its interests before others. Military interventions and the idea that America is special have made some upset. === China === China has been growing economically since the 20th century. Some people think that China will overtake America on the World Stage. == References == Category:Foreign relations of the United States Category:History of the United States",
 "title": "American imperialism"
}