{
 "id": "463414",
 "text": "Sacrifice (2011) was a professional wrestling pay-per-view show made by Total Nonstop Action Wrestling (TNA). It was held on May 15, 2011 at the TNA Impact! Zone in Orlando, Florida. It was the seventh Sacrifice event that TNA held. There were nine matches on the card. The main event saw Sting defeat Rob Van Dam to retain the TNA World Heavyweight Championship. Sacrifice gained mixed reviews. James Caldwell of Pro Wrestling Torch thought that the show had an \"Awful undercard and decent-to-acceptable second-half of the card\". He said that \"Overall, TNA was missing a match like Steiner vs. Morgan, which they began hyping at the first set of TV tapings, to better bridge the middle of the show to the main event matches. Instead, the show had too many matches the crowd had no emotional investment in.\" ==Matches== # Results Stipulations Times 1 Mexican America (Anarquia and Hernandez) (with Sarita and Rosita) defeated Ink Inc. (Jesse Neal and Shannon Moore) Tag team match 9:39 2 Brian Kendrick defeated Robbie E (with Cookie) Singles match 6:41 3 Mickie James (c) defeated Madison Rayne Singles match for the TNA Women's Knockout Championship; if James was the winner, Tara's contract with Rayne would be nullified and Tara would be free to work in TNA. 6:57 4 Kazarian (c) defeated Max Buck Singles match for the TNA X Division Championship 11:21 5 Crimson defeated Abyss Singles match 10:43 6 Beer Money, Inc. (James Storm and Robert Roode) (c) defeated Immortal (Chris Harris and Matt Hardy) Tag team match for the TNA World Tag Team Championship 13:51 7 Tommy Dreamer defeated A.J. Styles No Disqualification match 13:04 8 Kurt Angle and Chyna defeated Jeff and Karen Jarrett Mixed tag team match 10:19 9 Sting (c) defeated Rob Van Dam Singles match for the TNA World Heavyweight Championship 12:43 (c) – refers to the champion(s) heading into the match ==References== ==Other websites== *Official TNA Sacrifice website Category:2011 in American television Category:2011 in professional wrestling Category:Sports in Orlando, Florida Category:Total Nonstop Action Wrestling pay-per-view events Category:2010s in Orlando, Florida Category:2011 in Florida Category:May 2011 events",
 "title": "Sacrifice (2011)"
}