{
 "id": "463441",
 "text": "Got7 (; romanized as Gatsebeun; stylized as GOT7) is a multi-national K-pop boy group formed in 2014. Got7 has seven members. The leader JB, Mark, Jackson, Jinyoung, Youngjae, BamBam and Yugyeom. They are a multinational group with members from South Korea, Hong Kong, Thailand, and the United States. Got7 released their debut EP, Got It?, on January 20, 2014. On October 22, 2014, they debuted in Japan with the release of their first Japanese single, \"Around the World\". == Debut == Two members of GOT7 made their debut as “JJ Project” in 2012. On January 16, 2014, the two members joined the other five members and re-debuted as “GOT7”. Their debut EP “Got It?” was released on January 20, 2014. Their Japanese single “AROUND THE WORLD” was released January 22, 2014. Their activities in Japan ended in 2020. == Members == Mark is the oldest member of GOT7, but JB is the leader of this group. JB, Jinyoung, Youngjae, Yugyeom are all Korean. Mark is from the United States. Jackson is from Hong Kong and BamBam is Thai. == Additional information == This idol group was formed by GOT7 Entertainment. GOT7 is a member of G7 Nation. All members were trainees of JYP Entertainment. Jinyoung is active as an actor. JB is in two units of GOT7 members. One unit is “JJ Project” with Jinyoung and the other is “Jus2” with Yugyeom. The music videos of \"Just right\", \"Lullaby\", and \"Never Ever\" have over 100 million views. == Award history == Since their debut in 2014, they received 56 awards and 148 nominations. In 2014, Got7 won Best New Artist Group at the Seoul Music Awards and received three nominations at the 29th Golden Disk Awards, winning the Newcomer Award and China Goodwill Star Award. In 2020, they got awards “WORLDWIDE FANS’ CHOICE” in MAMA (Mnet Asian Music Awards) and “year’s artists awards” in TMA (THE FACT MUSIC AWARDS). == References == Category:2014 establishments in South Korea Category:Hip hop bands Category:JYP Entertainment artists Category:K-pop music groups Category:Musical groups established in 2014 Category:South Korean boy bands",
 "title": "Got7"
}