{
 "id": "463786",
 "text": "A fallen angel is an angel who has sinned and has been sent out of heaven. == Bible == The Bible mentions \"sons of Elohim\" (sons of God) in Book of Genesis, who had evil powerful children. Some Jews and Christians think this refers to angels who left heaven and had children together with human women. There is also another opinion. Some Jews and Christians believe they are not angels, but \"kings\" who had evil and powerful children instead. Isaiah compares a Babylonian king to an Angel who wanted to be God himself. So he tried to rise to the highest heaven but fell into the deepest underworld instead. For Christians, this angel was Lucifer. Jews usually don't think this verse really refers to an angel but is only a poem. In the New Testament, it is said that Hell is prepared for Satan and his fellow (fallen) angels. Jesus is reported to say that he saw Satan fall from heaven. This is the reason why Christians believe that Satan has indeed been thrown out of heaven. This verse also confirms for Christians that the \"morning star\" in the Old Testament indeed speaks about a fallen angel. The last chapter of the Bible, the Book of Revelation, describes a battle between the Archangel Michael and Satan. Here, Satan and his angels lose and are thrown out of heaven. == Enoch's Book == The book mentions angels who mated with human women. These are supposed to be the same angels mentioned in Genesis. Their children are the giants. According to the Book of Enoch, the giants were slain by the Archangels or died during the Deluge. The fallen angels are imprisoned in the underworld. The most famous fallen angels are named Azazel and Semjaza. They also teach sorcery and warcraft to humans. Azazel is blamed for corrupting the entire world with his teachings. Satan is also mentioned in this Book, but he is not among the fallen angels. Satan instead appears to be the one who punishes the fallen angels and sinful humans. == Islam == In the Quran, creatures fallen from heaven appear twice. One is Satan (named Iblis in the Quran) and the other is a pair of fallen angels called Harut and Marut. However, Muslims are undecided if these beings are really angels. Some Muslims don't believe that angels could sin, therefore think that angels will never be cast away from heaven. They think that Satan was not an angel himself but only lived among the angels. Harut and Marut are alternatively thought to be kings instead of angels, like the \"Sons of Elohim\" in Genesis. Others have no worries about the idea of fallen angels. But even if they are fallen, they don't rebel against God for Muslims. The angels are still the servants of God. Iblis and Harut and Marut do not fall together but each are punished for their own sins: * Iblis: When God creates the first human (Adam), God commands the angels to bow before Adam. But Iblis argues that the angels are better than humans, so they shouldn't bow down. Because Iblis thinks God's command was unjust, he is no longer allowed to be in heaven and is thrown to the earth. Iblis promises revenge and proves to be right and tries to show God that humans are sinful. For this reason, Iblis seduced humans into sin, including Adam and Eve. Iblis is now punished again for tempting Adam and Eve into sin, and this time banished to hell. * Harut and Marut: Their sin is not mentioned in the Quran, but used to explain why they are on earth. According to the Quran, they are on earth and teach humans sorcery. According to the Muslim story, some angels wanted to destroy all humans because they are sinful, but God said, they shouldn't be so harsh to humans. If angels would live on earth, they would also sin. So Harut and Marut made a bet with God, they wouldn't sin if they lived on earth. However, they lose the bet, commit sins, and are not allowed to return to heaven. == Scholarly explanation == Scholars think that the idea of \"fallen angels\" comes from humans observing shooting stars. Before humans knew what stars are, many humans believed they are gods or angels. So, when they so a shooting star, and it looked like they fall to earth, they believed a creature (like an angel) from heaven was falling down. The idea that fallen angels taught sorcery and sin, could also explain how sin entered a perfect world. If God created a good and perfect world, there would be no sin. But when there is sin in the world, sin must have come from outside of the world, what is the world of the angels. Category:Theology * *",
 "title": "Fallen angel"
}