{
 "id": "463777",
 "text": "Marc Okrand (; born July 3rd, 1948) is an American linguist. He is known for making the Klingon language. ==Biography== ===Linguistics=== Okrand worked with Native American languages. He earned a bachelor's degree from the University of California, Santa Cruz in 1972. His 1977 doctoral work from the University of California, Berkeley, was on the grammar of Mutsun, a dialect of Ohlone (a.k.a. Southern Costanoan). Southern Costanoan is an extinct Utian language earlier spoken in the north central Californian coastal areas from Northern Costanoan down to 30 miles south of Salinas. Okrand's doctoral work was watched over by early linguist Mary Haas. He taught college linguistics courses at the University of California, Santa Barbara, from 1975 to 1978. After that he took a post doctoral fellowship at the Smithsonian in Washington, D.C., in 1978.Wall Street Journal Helping the Hearing Impaired And Voicing the Klingons, May 14, 2009 ===Star Trek=== Okrand helped make closed captioning for the Oscars award show in 1982. While there Okrand met the producer for the movie Star Trek II: The Wrath of Khan. His first work was replacing in Vulcan language words for Star Trek II: The Wrath of Khan. The actors had been filmed talking in English. He was then hired by Paramount Pictures to make the Klingon language. Okrand also taught the actors using it in Star Trek III: The Search for Spock, Star Trek V: The Final Frontier, and Star Trek VI: The Undiscovered Country. He was later also hired for the 2009 Star Trek film for their use of the Romulan and Vulcan languages.YouTube Okrand Answers \"What was your involvement in the new Star Trek movie\" He also made a Klingon dialogue for the 2009 movie, but it was not used in the final edited version. Okrand was also involved in Star Trek Into Darkness, but only after the movie was finished being made. ==References== ==Other websites== * * a press release about Marc Okrand at the National Captioning Institute's website * * Marc Okrand at startrek.com * Interview with Marc Okrand in the Wall Street Journal Category:1948 births Category:Living people Category:American linguists",
 "title": "Marc Okrand"
}