{
 "id": "463849",
 "text": "This is a timeline of events in the Levant by the Jihadist militant group called the Islamic State (also called IS, ISIS, ISIL or Daesh). ==2014 events== === January 2014 === * 3 January: ISIS was proclaimed an Islamic state in Fallujah. After tension for a long time, the newly formed Army of Mujahedeen, the Free Syrian Army and the Islamic Front launched an offensive against ISIS-held territory in the Syrian provinces of Aleppo and Idlib. A spokesman for the rebels said that rebels had attacked ISIS in up to 80% of all ISIS-held villages in Idlib and 65% of those in Aleppo. * 4 January: ISIS claimed responsibility for the car-bomb attack on 2 January that killed four people and wounded dozens in the southern Beirut suburb of Haret Hreik, an area controlled by Hezbollah. * 6 January: Syrian rebels had managed to expel ISIS forces from the city of Ar-Raqqah, ISIS's largest stronghold and capital of Ar-Raqqah province. Several weeks later ISIS took the city back. * 8 January: Syrian rebels expelled most ISIS forces from the city of Aleppo. However, ISIS reinforcements from Deir ez-Zor province managed to retake several neighborhoods of the city of Ar-Raqqah. By mid-January ISIS fighters had retaken the entire city of Ar-Raqqah, while rebels expelled ISIS fighters fully from Aleppo city and the villages west of it. * 25 January: ISIS announced the creation of its new Lebanese arm, pledging to fight the Shia militant group Hezbollah and its supporters in Lebanon. * 29 January: Turkish aircraft near the border fired on an ISIS convoy inside Aleppo province in Syria, killing 11 ISIS fighters and one ISIS emir. * 30 January: ISIS fired on border patrol soldiers in Turkey. The Turkish Army retaliated with Panter howitzers and destroyed the ISIS convoy. * In late January, it was confirmed that Syrian rebels had assassinated ISIS's second-in-command, Haji Bakr, who was al-Qaeda's military council head and a former military officer in Saddam Hussein's army. === February 2014 === * 3 February: al-Qaeda's general command broke off its links with ISIS, reportedly to concentrate the Muslim extremist effort on unseating President Bashar al-Assad. * By mid-February, the al-Nusra Front had joined the battle in support of rebel forces, and expelled ISIS forces from Deir ez-Zor province in Syria. * 23 February: The Islamic State carried out a suicide attack in Aleppo killing a commander of Ahrar ash-Sham and 6 other members of the group. === March 2014 === * By March, ISIS forces had fully retreated from Syria's Idlib province after battles against the Syrian rebels. * 4 March: ISIS retreated from the Aleppo province–Turkey border town of Azaz and nearby villages, choosing instead to stay around Ar- Raqqah, expecting more fighting with al-Nusra. * 8 March: During an interview with French television channel France 24, Iraqi Prime Minister Nouri al-Maliki accused Saudi Arabia and Qatar of openly funding ISIS.\"Exclusive: Iraq's Maliki accuses Saudi Arabia of supporting 'terrorism'\". France 24. 8 March 2014. * 20 March: In Niğde, a city in Turkey, three ethnic Albanian members of ISIS—Benjamin Xu, Çendrim Ramadani and Muhammed Zakiri—opened fire while hijacking a truck, killing one police officer and one gendarmerie officer and wounding five people. Shortly after their arrest, Polis Özel Harekat teams launch a series of operations against ISIS in the capital city, İstanbul. Police found documents and an ISIS flag in one place and two people from Azerbaijan were arrested. === April 2014 === * 27 April: Iraqi military helicopters reportedly attacked and destroyed an ISIS convoy of eight vehicles inside Syria. This may be the first time that Iraqi forces have struck outside their country since the Gulf War. === May 2014 === * 1 May: ISIS carried out a total of seven public executions in the city of Ar-Raqqah, in northern Syria. Pictures that emerged from the city show how ISIS had been carrying out public crucifixions in areas under its control. In most of these crucifixions, the victims were shot first and their bodies were then displayed, but there were also reports of crucifixions after the victims were shot or beheaded. In one case, a man was said to have been \"crucified alive for eight hours,\" but there was no indication of whether he died. === June 2014 === * In early June, following its large-scale offensives in Iraq, ISIS was reported to have seized control of most of Mosul, the city with the second highest population in Iraq, a large part of the surrounding Nineveh province, and the city of Fallujah. ISIS also took control of Tikrit, the administrative center of the Salah ad Din Governorate, with the ultimate goal of capturing Baghdad, the capital city of Iraq. ISIS was believed to have only 2,000–3,000 fighters up until the Mosul campaign, but during that campaign, it became clear that there were far more fighters than was previously thought. * In June there were reports that a number of Sunni groups in Iraq had joined ISIS. However, the Kurds—who are mostly Sunnis—in the northeast of Iraq, were unwilling to be drawn into the conflict, and there were clashes in the area between ISIS and the Kurdish Peshmerga. * 5 June: ISIS militants stormed the city of Samarra, Iraq, before being ousted from the city by airstrikes mounted by the Iraqi military. * 6 June: ISIS militants carried out multiple attacks in the city of Mosul, Iraq. * 7 June: ISIS militants took over the University of Anbar in Ramadi, Iraq and held 1,300 students hostage, before being driven out by the Iraqi military. * 9 June: Mosul fell to ISIS control. The militants seized control of government offices, the airport, and police stations. Militants also looted the Central Bank in Mosul, reportedly stealing US$429 million. More than 500,000 people fled Mosul to escape ISIS.\"Iraq crisis: Islamists force 500,000 to flee Mosul\".BBC News. 11 June 2014. Mosul is a strategic city as it is at a crossroad between Syria and Iraq, and poses the threat of ISIS seizing control of oil production. * 11 June: ISIS seized the Turkish consulate in the Iraqi city of Mosul, and kidnapped the head of the diplomatic mission and several staff members. ISIS seized the Iraqi city of Tikrit. * 12 June: Human Rights Watch, an international human rights advocacy organization, issued a statement about the growing threat to civilians in Iraq. * 13 June: Navi Pillay, UN High Commissioner for Human Rights, expressed alarm at reports that ISIS fighters \"have been actively seeking out—and in some cases killing—soldiers, police and others, including civilians, whom they perceive as being associated with the government.\"Cumming-Bruce, Nick \"U.N. Warns of Rights Abuses and Hundreds Dead in Iraq Fighting\" The New York Times. 13 June 2014. * 15 June: ISIS militants captured the Iraqi city of Tal Afar, in the province of Nineveh. ISIS claimed that 1,700 Iraqi soldiers who had surrendered in the fighting had been killed, and released many images of mass executions via its Twitter feed and various websites.Norland, Rod; Rubin, Alissa A. \"Massacre Claim Shakes Iraq\" The New York Times. 15 June 2014. * 22 June: ISIS militants captured two key crossings in Anbar, a day after seizing the border crossing at Al-Qaim, a town in a province which borders Syria. According to analysts, capturing these crossings could aid ISIS in transporting weapons and equipment to different battlefields. * 24 June: The Syrian Air Force bombed ISIS positions in Iraq. Iraqi Prime Minister Nouri al-Maliki stated: \"There was no coordination involved, but we welcome this action. We welcome any Syrian strike against Isis because this group targets both Iraq and Syria.\" * 25 June: The al-Nusra Front's branch in the Syrian town of al-Bukamal pledged loyalty to ISIS, thus bringing months of fighting between the two groups to a close.Syrian branch of al Qaeda vows loyalty to Iraq's ISIS\" France 24. 25 June 2014. * 25 June: In an interview with the BBC Arabic service, Nouri al-Maliki said that Iraq had purchased used Sukhoi fighter jets from Russia and Belarus to battle ISIS militants, after delays in the delivery of F-16 fighters purchased from the US. \"[If] we had air cover, we would have averted what happened\", he said. * 26 June: Iraq launched its first counterattack against ISIS's advance with an airborne assault designed to seize back control of Tikrit University. * 28 June: The Jerusalem Post reported that the Obama administration had requested US$500 million from Congress to use in the training and arming of \"moderate\" Syrian rebels fighting against the Syrian government, in order to counter the growing threat posed by ISIS in Syria and Iraq.\"Obama seeks $500 million from Congress to train 'moderate' Syrian rebels to fight ISIS\" The Jerusalem Post. 28 June 2014. * 29 June: ISIS announced the establishment of a new caliphate. Abu Bakr al-Baghdadi was appointed its caliph, and the group formally changed its name to the Islamic State. === July 2014 === * 2 July: Abu Bakr al- Baghdadi, the self-proclaimed caliph of the new Islamic State, said that Muslims should unite to capture Rome in order to \"own the world.\" He called on Muslims the world over to unite behind him as their leader. *3 July: ISIS captured Syria's largest oilfield from rival Islamist fighters, al-Nusra Front, who put up no resistance to the attack. Taking control of the al-Omar oilfield gave ISIS access to potentially useful crude oil reserves. *17 July: Syria's Shaer gas field in the Homs Governorate was seized by Islamic State. According to the Syrian Observatory for Human Rights, at least 90 National Defence Force guards defending the field were killed, as were 21 ISIS fighters. The SOHR later put the death toll from the fighting and executions at 270 soldiers, militiamen and staff, and at least 40 ISIS fighters. *19 July: ISIS claimed responsibility for a suicide bombing which killed 33 people and left more than 50 wounded. The explosion occurred in Baghdad's Kadhimiya district, which is the site of a major Shia shrine. *24 July: ISIS blew up the Mosque and tomb of the Prophet Yunus (Jonah) in Mosul, with no reported casualties. Residents in the area said that ISIS had erased a piece of Iraqi heritage. Johah's tomb was also an important holy site concerning Jewish heritage. *26 July: ISIS blew up the Nabi Shiyt (Prophet Seth) shrine in Mosul. Sami al-Massoudi, deputy head of the Shia endowment agency which oversees holy sites, confirmed the destruction and added that ISIS had taken artifacts from the shrine to an unknown location. *28 July: To mark the Muslim holy festival of Eid al-Fitr, which ends the period of Ramadan, ISIS released and circulated a 30-minute video showing graphic scenes of mass executions. * The UN reported that of the 1,737 fatalities of the Iraq conflict during July so far, 1,186 were civilians. === August 2014 === *1 August: The Indonesian National Counterterrorism Agency (Badan Nasional Penanggulangan Terorisme) declared ISIS a terrorist organization. *2 August: The Iraqi Army confirmed that 37 loyalist fighters had died during combat with Islamic State militants south of Baghdad, and in Mosul. The Patriotic Union of Kurdistan claimed that \"hundreds\" of IS militiamen had died in the action. *2 August: ISIS and its al-Nusra Front allies invaded Lebanon in and around the town of Arsal, sparking a five day battle between them and the Lebanese army, who pushed ISIS back across the border into Syria. Over a hundred fighters were killed, and scores of civilians were killed or wounded. *3 August: IS fighters occupied the city of Zumar and an oilfield in the north of Iraq, after a battle against Kurdish forces. *5 August: Al Jazeera reported that an IS offensive in the Sinjar area of northern Iraq had forced 30,000–50,000 Yazidis to flee into the mountains, fearing they would be killed by the IS. They had been threatened with death if they refused conversion to Islam. A UN representative said that \"a humanitarian tragedy is unfolding in Sinjar.\" *6 August: The Islamic State kidnapped 400 Yazidi women in Sinjar to sell them as sex slaves. *7 August: IS fighters took control of the town of Qaraqosh in the province of Nineveh in northern Iraq, which forced its large Christian population to flee. *7 August: US President Obama authorized targeted airstrikes in Iraq against ISIS, along with airdrops of aid. The UK offered the US assistance with surveillance and refuelling, and planned humanitarian airdrops to Iraqi refugees. *8 August: The US asserted that the systematic destruction of the Yazidi people by the Islamic State was genocide. The US military launched indefinite airstrikes targeting Islamic State fighters, equipment and installations, with humanitarian aid support from the UK and France, in order to protect civilians in northern Iraq. The Islamic State had advanced to within 30 km of Erbil in northern Iraq. The UK also considered joining the US in airstrikes. *10 August: France's Foreign Minister Laurent Fabius said that Iraq's Kurds must be equipped to fight against ISIS and indicated that France would consider providing arms aid \"in liaison with the Europeans\". Islamic State militants buried an unknown number of Yazidi women and children alive, in an attack that killed 500 people, in what has been described as ongoing genocide in northern Iraq. *11 August: The Arab League accused the Islamic State of committing crimes against humanity. The UK decided not to join the US in airstrikes and instead stepped up its humanitarian aid to refugees. *12 August: The parents of kidnapped American journalist James Foley received an email from his captors. The US announced that it would not extend its airstrikes against the Islamic State to areas outside northern Iraq, emphasizing that the objective of the airstrikes was to protect US diplomats in Erbil. The US and the UK airdropped 60,000 litres of water and 75,000 meals for stranded refugees. The Vatican called on religious leaders of all denominations, particularly Muslim leaders, to unite and condemn the IS for what it described as \"heinous crimes\" and the use of religion to justify them. *13 August: The Syrian Observatory for Human Rights reported that Islamic State jihadists had seized control of six villages near the Turkish border in the northern province of Aleppo in Syria. *15 August: The United Nations Security Council issued a resolution which \"deplores and condemns in the strongest terms the terrorist acts of ISIL (Islamic State) and its violent extremist ideology, and its continued gross, systematic and widespread abuses of human rights and violations of international humanitarian law.\" *16 August: The Islamic State massacred 80 Yazidis. The EU agreed to supply Kurdish forces with arms, and US military forces continued to attack Islamic State fighters in the area around Iraq’s crucial Mosul Dam. *17 August: The Syrian Observatory for Human Rights reported that the Islamic State had killed 700 members of the Syrian al- Sheitaat tribe, mostly civilians, after two weeks of clashes over the control of two oilfields in the region. Peshmerga troops, aided by the US air campaign, began an offensive to take back the strategic Mosul Dam from the Islamic State, amid fears that the destruction of the dam might unleash a 65-foot wave of water that would engulf the northern city of Mosul, and even flood Baghdad. (Accessible via Google.) * 18 August: Pope Francis, leader of the world's 1.2 billion Roman Catholics, said that the international community would be justified in stopping Islamist militants in Iraq. He also said that it should not be up to a single nation to decide how to intervene in the conflict. *19 August: According to the Syrian Observatory for Human Rights, the Islamic State now had an army of more than 50,000 fighters in Syria. American journalist James Foley was beheaded by the Islamic State on video tape. *20 August: President Obama denounced the \"brutal murder of Jim Foley by the terrorist group ISIL.\" *21 August: The US military admitted that a covert rescue attempt involving dozens of US Special Operations forces had been made to rescue James Foley and other Americans held captive in Syria by Islamic State militants. The air and ground assault, involving the first known US military ground action inside Syria, had the authorization of President Obama. The ensuing gunfight resulted in one US soldier being injured. The rescue was unsuccessful, as Foley and the other captives were not in the location targeted. This was the first known engagement by US ground forces with suspected Islamic State militants. The US Defense Secretary warned that the Islamic State were tremendously well-funded, adding, \"They have no standard of decency, of responsible human behavior\", and that they were an imminent threat to the US. *22 August: The US is considering airstrikes on ISIS in Syria, which would draw US military forces directly into the Syrian Civil War, as President Obama develops a long-term strategy to defeat the Islamic State. Accessible via Google. *26 August: The Islamic State carried out a suicide attack in Baghdad killing 15 people and injuring 37 others. *28 August: The Islamic State beheaded a Lebanese Army soldier whom they had kidnapped. The group also beheaded a Kurdish Peshmerga fighter in response to Kurdistan's alliance with the United States, and executed around 250 Syrian soldiers captured after the fall of Tabqa Air Base in Ar-Raqqah province. The soldiers had earlier been marched to their place of execution wearing just their underwear. * 29 August: UK Prime Minister David Cameron raised the UK's terror level to \"severe\" and committed to fight radical Islam \"at home and abroad\". * 31 August: Iraqi military forces supported by Shia militias and American airstrikes broke the two-month siege of the northern Iraqi town of Amerli by Islamic State militants. German Federal Minister of Defence Ursula von der Leyen announced that Germany will send enough weapons to arm 4,000 Peshmerga fighters in northern Iraq fighting Islamic State insurgents. The delivery to be scheduled in stages will include 16,000 assault rifles, 40 machine guns, 240 rocket-propelled grenades, 500 MILAN anti-tank missiles with 30 launchers and 10,000 hand grenades, with a total value of around 70 million euros. In order to assess the needs of the Peshmerga and prevent an excessive accumulation of arms, the Bundeswehr seconded six liaison officers to Erbil who will report to Berlin. === September 2014 === * 1 September: The German government's Cabinet decision to arm the Kurdish Peshmerga militia was ratified in the Bundestag by a \"vast majority\" of votes, after an emotional debate. * 2 September: The IS released a video showing the beheading of a man whom they identified as American journalist Steven Sotloff. * 4 September: A member of the Islamic State issued a threat to Russian President Vladimir Putin, vowing to oust him over his support of Bashar al-Assad's regime in Syria.Original video with English subtitles and transcript by MEMRI at * 5 September: The German Bundeswehr dispatched the first of a planned series of cargo planes to Iraq, loaded with helmets, vests, radios, and infrared night- vision rifle scopes. After a three-hour stopover in Baghdad for inspection, the aircraft will deliver the equipment to German personnel already in Erbil for distribution to the Kurdish fighters. Qassem Soleimani, Commander of the elite Iranian Revolutionary Guard Quds Force, has been to the Iraqi city of Amirli, to work with the United States in pushing back militants of the Islamic State. * 8 September: The Islamic State carried out a double suicide attack in a town north of Baghdad killing 9 people and wounding 70 others. * 10 September: After ISIS had outraged American opinion by beheading two American journalists and had seized control of large portions of Syria and Iraq in the face of ineffective opposition from American allies, President Obama decided on a new objective for a rollback policy in the Middle East. He announced: \"America will lead a broad coalition to roll back this terrorist threat. Our objective is clear: We will degrade, and ultimately destroy, ISIL through a comprehensive and sustained counterterrorism strategy.\" * 12 September: A Western-backed Syrian rebels group operating around Damascus and the Islamic State signed a \"non-aggression\" agreement. * 13 September: UK humanitarian aid worker David Cawthorne Haines, whose life had been threatened by Jihadi John in the Steven Sotloff video, was purportedly beheaded in a video titled \"A Message to the Allies of America\". * 15 September: The Battle of Suq al Ghazi ended with a US-Iraqi win. * 18 September: The Australian Federal Police, Australian Security Intelligence Organisation, Queensland Police and New South Wales Police launched the largest counterterrorism operation in Australian history. The targets were ISIS-linked networks thought to be planning to behead an Australian at home and launch mass-casualty attacks in populated areas. Fifteen people were arrested in the raids by police and intelligence organisations, with one being charged with terrorism offences. * 20 September: The hostages captured on 11 June 2014 from the Turkish consulate in Mosul were released. * 21 September: ISIS released a speech, titled \"Indeed, You Lord (sic) is Ever Watchful\", encouraging Muslims around the world to kill non-Muslims. * 22 September: Air operations begin over Syria; cruise missiles and precision-guided bombs strike ISIS targets in Syria. *29 September: ISIS releases third video of \"long-term prisoner\" and journalist John Cantlie entitled \"Lend Me Your Ears - Messages From The British hostage John Cantlie: Episode 2\". As in previous videos, Cantlie appears alone, sitting at a desk wearing an orange prison uniform. The scripted video criticizes US president Barack Obama’s strategy of using air strikes to defeat Islamic State fighters. === October 2014 === *3 October: After a meeting of the Australian National Security Committee, Australian prime minister Tony Abbott announced that Australia would contribute eight F/A-18F Super Hornets to aid the war effort against Islamic extremists in Iraq. The aircraft join a KC-30A Tanker and an E-7A Wedgetail AEW&C; aircraft already deployed. *3 October: ISIS releases video showing beheading of British aid worker Alan Henning and threatens American aid worker, Peter Kassig ==References== Category:2014 in Asia Category:21st century in Iraq Category:2010s in Syria Category:Islamic State",
 "title": "Timeline of the Islamic State (2014)"
}