{
 "id": "463898",
 "text": "Abdullah II ibn al-Hussein (, ʿAbdullāh aṯ-ṯānī ibn al-Ḥusayn; born 30 January 1962) is the King of Jordan. He became king on 7 February 1999 after the death of his father King Hussein. King Abdullah, whose mother is Princess Muna al- Hussein, is a member of the Hashemite family.Kingabdullah.jo (2006), His Majesty King Abdullah II: King of the Hashemite Kingdom of Jordan. Royal Hashemite Court. Retrieved on 14 December 2007 His mother Muna al-Hussein is from Suffolk, England. ==Early life and Career== Abdullah was born at Palestine Hospital in Amman, He is eldest son of King Hussein of Jordan and His second wife Princess Muna Al-Hussein, His name sake from his great gandfather Abdullah I, He has four brother and six sisters, Princess Alia, Prince Faisal, Pincess Aisha, Princess Zein, Princess Haya, Prince Ali, Prince Hamazah, Prince Hashem, Princess Iman and Princess Raiyah, He has begin his school life at Islamic Educational College at Amman and study at St Edmund's School in UK, He has high school life at Eaglebrook School and Deerfield Academy in US. He began his military career at Royal Military Academy Sandhurst in 1980, While he was a training officer in the Jordanian Armed Forces, After Sandhurst, He commissioned as a second lieutenant in the British Army and served a year in Britain and West Germany as a troop commander in 13/18 Royal Hussars. He has studied at Pembroke College in Oxford completed by one year special studies in Maddie Eastern affairs, After He joined to Royal Jordanian Army on his return home, serving as first lieutenant and then platoon commander and assistant commander of company in the 40th Armoured Brigade, He took a free-fall parachuting course in Jordan. In 1985, He took Armored Officer's Anvanced Course at Fort Knox, He became commander of a tank company in the 91st Armored Brigade with the rank of captain, Abdullah has served with the Royal Jordanian Air Force's anti-tank helicopter wing and Receiving training to fly Corbra Attack Helicopters. Abdullah has attended the Edmund A Walsh School of Foreign Serive at Georgetown University in Washington DC, At 1987, He undertaking advanced study and research in International affairs, He return home to serve as assistant commander of the 17th Royal Tank Battalion in 1989, later being promoted to major. Abdullah has attended a staff course at the British Staff College on 1990, And served the fallowing year in the Office of the Inspector General of the Jordanian Armed Forces as the Armored Corps representative. He commanded a battalions in the 2nd Armored Cavalry Regiment in 1992 and promoted colonel the fallowing year, commanding the 40th Brigade. He met Raina Ai- Yassin on a marketing employee at Apple Inc in Amman, At a dinner organized by his sister Princess Aisha in January 1993, They are engaged two months later, And their marriage took place in June 1993. In 1994, Abdullah has assumed command of Jordan's Special Forces and of other elite units as a brigadier general, restructuring them into the Joint Special Operations Command two years later. He became a major general, attended a course in defence resources management at the American Naval Postgraduate School and commanded an elite special forces manhunt in the pursuit of outlaws in 1998, The operations reportedly end successfully, with his name chanted on the streets of Amman. Titles and Styles 30 January 1962-1 March 1965: His Royal Highness The Crown Prince of Jordan 1 March 1965-24 January 1999: His Royal Highness Prince Abdullah of Jordan 24 January 1999-7 February 1999: His Royal Highness The Crown Prince of Jordan 7 February 1999-present His Majesty The King of the Hashemite Kingdom of Jordan ==References== Category:1962 births Category:Living people Category:Kings of Jordan Category:Recipients of the Order of the Lion of the Netherlands Category:Knights Grand Cross of the Order of the Lion of the Netherlands",
 "title": "Abdullah II of Jordan"
}