{
 "id": "464062",
 "text": "Peter's Friends is a 1992 comedy-drama movie. It is about old friends gathering at a New Year's party. Emma Thompson plays Maggie Chester. Imelda Staunton plays Mary. Rita Rudner plays Carol. The movie was written by Rita Rudner and Martin Bergman. The director and producer was Kenneth Branagh. This movie was released on September 18, 1992. It had positive reviews from critics. ==Cast== ==Reception== ===Box office=== Peter's Friends made £3.1 million dollars in the box office in the United Kingdom. In the United States, it made over $4 million. ===Critical response=== Peter's Friends had positive reviews from critics. Rotten Tomatoes gave the movie an \"approval rating\" of 65%. Roger Ebert from the Chicago Sun-Times said the movie was \"more or less predictable\". This meant he thought the movie's structure was not original. However, he gave the movie three-and-a-half stars. He also said it reminded him of movies like The Big Chill. However, he also said that the movie was better than other moves like this one. He said the movie had good dialogue and writing. The critic James Berardinelli gave the movie two-and-a-half out of four stars. He said the movie can be funny, but also annoying. He also liked the acting and directing. His biggest complain was the movie's screenplay and that the movie was Branagh's worst screenplay. ===Accolades=== Peter's Friends was nominated for a Goya Award. The movie won two Evening Standard British Film Awards. It was 8th place in the National Board of Review's Top Ten 1992 films. Award Category Recipients Result Evening Standard British Film Awards Best Actress Emma Thompson Evening Standard British Film Awards Peter Sellers Award for Comedy Kenneth Branagh Goya Awards Best European Film Kenneth Branagh ==References== ==Other websites== * Category:1992 comedy-drama movies Category:1992 romantic comedy movies Category:British romantic comedy movies Category:British LGBT movies Category:Movies directed by Kenneth Branagh Category:Movies set in England Category:Movies set in the 1980s",
 "title": "Peter's Friends"
}