{
 "id": "46431",
 "text": "Modes in music are a kind of scale. The Ancient Greeks used several modes in their music. Medieval musicians borrowed the names of these modes to describe the scales used in their music. Western music predominantly usually uses two scales: major and minor, which correspond to the Ionian and Aeolian modes. Like any other scale, a mode can start on any note. Each mode has a different pattern of tones and semitones (or “half tones”) (see semitone). * The Western major scale (e.g. the C major scale C D E F G A B C) starts on its KEY NOTE and goes up using the following pattern of tones and semitones between each note: tone, tone, semitone, tone, tone, tone, semitone. * The Western natural minor scale (e.g. the A natural minor scale A B C D E F G A) does the same, but it has a different pattern of tones and semitones between each note: tone, semitone, tone, tone, semitone, tone, tone. The modes are easiest to see on a piano keyboard using the white notes only. The most common modern modes are: * Ionian (C D E F G A B C) * Dorian (D E F G A B C D) * Phrygian (E F G A B C D E) * Lydian (F G A B C D E F) * Mixolydian (G A B C D E F G) * Aeolian (A B C D E F G A) * Locrian (B C D E F G A B) It will be seen that * The Ionian mode is the major scale. * The Dorian is a natural minor scale with a major sixth. * The Phrygian is a natural minor scale with a minor second. * The Lydian is a major scale with an augmented fourth. * The Mixolydian is a major scale with a minor seventh. * The Aeolian is the natural minor scale. * The Locrian sounds rather strange, and was hardly ever used in Medieval music. It is a minor scale with a minor second and a diminished fifth. Each mode also has a version called “hypo—“. For example: A to A is Hypodorian. It is the same as Aeolian, but the D is treated as the “keynote”. The names of the modes come from cities in Ancient Greece. In the Middle Ages these modes were widely used in church music. Some composers in recent centuries have enjoyed using the ancient modes from time to time in their music. Folksongs are often modal. Greensleeves is an example of a well-known tune which is modal. Category:Music theory",
 "title": "Musical mode"
}