{
 "id": "464308",
 "text": "Montserrat Abelló i Soler (1 February 1918 - 9 September 2014) was a Spanish Catalan poet and translator. She translated works of literature from English to her native Catalan, and from Catalan into English. ==Early life and education== Abelló i Soler was born in Tarragona, in the Province of Tarragona. During the Spanish Civil War, she lived in exile in France, England and Chile. ==Translations== ===From English to Catalan=== She translated works by American novelist Sylvia Plath, Welsh novelist Dylan Thomas, English writer E. M. Forster, Irish-born British author Iris Murdoch and Iranian translator Mohsen Emadi ===From Catalan to English=== She translated works by writers Salvador Espriu, Mercè Rodoreda, Maria Àngels Anglada, Maria Mercè Marçal and Olga Xirinacs Díaz. ==Writing== She published works of poetry in Catalan. * 1963 - Vida diària (\"Daily life\") * 1981 - Vida diària: Paraules no dites (\"Daily Life: Words not said\") * 1986 - El blat del temps (\"The Wheat of Time\") * 1990 - Foc a les mans (\"Fire in Hand\") * 1995 - L’arrel de l’aigua (\"The Root of Water\") * 1995 - Son màscares que m’emprovo (\"Masks of Sleep that I Try\") * 1998 - Dins l’esfera del temps (\"In the Sphere of Time\") which won the Gold Critica Serra prize in 1999 * 2004 - Asseguda escrivint (\"Seated Writing\") * 2006 - Memoria de tu i de mi (\"Memories of You and Me\") In 2002, her poetry was compiled in Al cor de les paraules: obra poètica 1963-2002 (\"In the Heart of Words: Poetic Works 1963-2002\"), which in 2003 won several Catalan literary prizes. She has also contributed to anthologies (collections) of writing and poetry: * 1993 - Cares a la finestra: 20 dones poetes de parla anglesa del segle XX (\"Faces in the Window: 20 English Women Poets of the 20th century\") * 1998 - Cartografies del desig: Quinze escriptores i el seu món (\"Cartography of Desire: Fifteen writers and their world\") * 1999 - Memoria de l’aigua: Onze escriptores i el seu món (\"Memories of Water: Eleven writers and their world\") * 1999 - Paisatge emergent (\"Emergent Landscape\") ==Death== Abelló i Soler died on 9 September 2014 in Barcelona, aged 96. ==References== ==Other websites== * Montserrat Abelló i Soler at the Association of Catalan Language Writers (AELC) Category:1918 births Category:2014 deaths Category:Spanish poets Category:Spanish translators Category:Writers from Barcelona",
 "title": "Montserrat Abelló i Soler"
}