{
 "id": "464473",
 "text": "Every Witch Way is an American fantasy, comedy and drama telenovela. It stars Paola Andino, Nick Merico, Paris Smith, Rahart Adams and Daniela Nieves. It is broadcast by Nickelodeon.Every Witch Way 2 season confirmed It is the American version of the Latin American telenovela Grachi. The telenovela was first broadcast on January 1, 2014. == Plot == === Season 1 === The series is about 14-year-old Emma Alonso. After moving to Miami, she discovers that she is \"The Chosen One\", the most powerfull witch. She fells in love with her neighbor Daniel (Nick Merico). She meets Daniel's girlfriend, Maddie (Paris Smith), is also a witch, but a bad one. Maddie is most popular girl at Iridium High School and the leader of \"The Panthers\". Emma will have to go through many problems now with her new life to live happy. === Season 2 === Now that she is the only chosen one,Emma stands more for herself. A new guy named Jax that is wizard moves to town and causes drama. Daniel breaks up with Emma because she lied to him about her powers.Her evil clone,E causes trouble and Emma has to destroy her. At the end she comes back with Daniel. == Characters == === Main Characters === *Paola Andino as Emma Alonso. A new student at Iridium High School. She is a witch and uses her magical powers responsibly. She is in love with Daniel.In Season 2 makes a clone that meses it up.Later is with Jax but then gets back with Daniel and kisses. *Nick Merico as Daniel Miller. He is a star in Iridium High. He's smart, athletic, and very popular, but also very humble. He is also the captain of the Sharks.In Season 2 get jealous about Jax but then gets back with Emma. *Paris Smith as Maddie Van Pelt. She is the ex- girlfriend of Daniel, and is also the most popular girl in Iridium High School. Is an mean witch and the enemy of Emma.In Season 2 she is nicer cause shes dating Diego. *Daniela Nieves as Andi Cruz. The best friend of Emma. She is a member of the swimming club of the Iridium, The Sharks. In Season 2 she dresses a bit diffirent and shes girlfriend of a zombie but Emma sends him back. *Rahart Adams as Jax Novoa. The new guy in Season 2,he is a wizard and likes Emma. *Elizabeth Elias as Mia. The new girl (S3),she is a kanay who simillar to a witch so wants revenge and kisses Daniel. *Tyler Alvarez as Diego Rueda. A kanay and Member of The Sharks. He starts dating Maddie in Season 2. === Other Characters === * Paola Nicole Andino as E, Emma's evil and rebellious clone.She likes Jax but then become enemies. * Zoey Burger as Miss Information.She know every thing that goes on Iridium High and blogs about it.She is a human and Diego's Sister . * Melisa Caricache as Nurse Lily,Iridium High nurse and secretly Emma's magic guardian. * Julie Antonellie as Jessie,Jax young sister. *Kendall Sanders as Tony Myers. Member of The Sharks. *Rene Lavan as Franciso Alonso. Father of Emma. *Katie Barberi as Ursula Van Pelt. The mother of Maddie. She is in love with Emma's father Francisco. *Rafael de la Fuente as Julio. The adopted son of the Principal. ==Series overview== Season Episodes Originally aired (U.S. dates) First aired Last aired 1 21 2 25 Special 3 20 4 21 July 30, 2015 == References == Category:2010s teen television series Category:Nickelodeon television series Category:2010s American sitcoms Category:2014 American television series debuts Category:English-language television programs",
 "title": "Every Witch Way"
}