{
 "id": "464583",
 "text": "The following is a list of notable deaths in October 2014. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==October 2014== * October 1 - Shlomo Lahat, 86, Israeli general and politician, Mayor of Tel Aviv (1974-1993), lung infection.Former Tel Aviv mayor Shlomo Lahat dies aged 86 * October 1 - Lynsey de Paul, 64, English singer-songwriter (\"Won't Somebody Dance with Me\"), brain hemorrhage.Singer Lynsey De Paul dies aged 64 * October 2 - György Lázár, 90, Hungarian politician, Chairman of the Council of Ministers (1975–1987).Elhunyt a volt magyar kormányfő * October 2 - Pedro Peña, 88, Spanish actor (Médico de familia), Alzheimer's disease.Muere Pedro Peña, el abuelo de 'Médico de Familia' * October 2 - Vaughn O. Lang, 86, American Army lieutenant general.(Ret.) Lt. Gen. Vaughn O. Lang * October 2 - Ewen Gilmour, 51, New Zealand comedian. * October 2 - Robert Flower, 59, Australian Hall of Fame VFL footballer. * October 3 - Alan Henning, 47, British humanitarian aid worker and ISIS hostage, beheading.ISIS video claims to show beheading of Alan Henning; American threatened (death reported on this date) * October 3 - Kevin Metheny, 60, American radio executive (WNBC (AM), WGN (AM)), suspected heart attack.Kevin Metheny, former WGN-AM 720 boss and \"Pig Virus\" to Howard Stern, dead at 60 * October 3 - Ward Ruyslinck, 85, Belgian author, Alzheimer's disease.Schrijver Ward Ruyslinck overleden * October 3 - Peer Augustinski, 74, German actor.Schauspieler Peer Augustinski ist tot * October 3 - Jean- Jacques Marcel, 83, French footballer.Ex-France international Jean-Jacques Marcel dies * October 4 - Paul Revere, 76, American musician (Paul Revere & the Raiders), cancer.Paul Revere and the Raiders * October 4 - Hugo Carvana, 77, Brazilian actor (Entranced Earth, Antonio das Mortes) and director (Casa da Mãe Joana).Morre o ator Hugo Carvana * October 4 - John J. Lloyd, 92, American art director and production designer (Animal House, The Blues Brothers, The Thing).John J. Lloyd Obituary * October 4 - Fyodor Cherenkov, 55, Russian footballer (FC Spartak Moscow, Soviet national team).Скончался знаменитый футболист \"Спартака\" Федор Черенков * October 4 - Jean-Claude Duvalier, 63, Haitian politician, President (1971–1986), heart attack.Former Haiti president Duvalier dies * October 5 - Yuri Lyubimov, 97, Russian stage actor and director, founder of the Taganka Theatre, heart failure.Скончался Юрий Любимов * October 5 - Anna Przybylska, 36, Polish actress (Kariera Nikosia Dyzmy), pancreatic cancer.Anna Przybylska nie żyje. Aktorka przegrała walkę z rakiem * October 5 - David Chavchavadze, 90, British-born American author and CIA officer.Prince David Chavchavadze (1924-2014) * October 5 - Andrea de Cesaris, 55, Italian racing driver (Formula One), traffic collision.Andrea De Cesaris: Italian former Formula 1 driver dies aged 55 * October 5 - Anna Maria Gherardi, 75, Italian actress and voice actress (Lost Love, Petomaniac).Teatro, è morta a Roma l'attrice Anna Maria Gherardi * October 5 - Geoffrey Holder, 84, Trinidadian choreographer and actor (Annie, Live and Let Die, Charlie and the Chocolate Factory), pneumonia.Geoffrey Holder, Dancer, Actor, Artist and Much More, Dies at 84 * October 6 - Serhiy Zakarlyuka, 38, Ukrainian football player (Dnipro, national team) and manager, traffic collision.Погиб Сергей Закарлюка * October 6 - Marian Seldes, 86, American actress (Tom and Huck, Home Alone 3, Mona Lisa Smile), complications from dementia. * October 6 - Igor Mitoraj, 70, Polish sculptor. * October 6 - Bill Campbell, 91, American sportscaster.Voice of Philadelphia sports broadcaster Bill Campbell dies at 91 * October 6 - Feridun Buğeker, 81, Turkish footballer.Vefat ve Başsağlığı * October 7 - Cigar, 24, American thoroughbred racehorse, surgical complications.Hall of Fame racehorse Cigar dies at 24 * October 7 - Siegfried Lenz, 88, German writer (The German Lesson, The Heritage), poet, and historian.Siegfried Lenz ist tot * October 7 - Iva Withers, 97, Canadian-born American theatre actress and singer.Iva Withers, a Standby to the Rescue on Broadway, Dies at 97 * October 7 - Nika Kiladze, 25, Georgian footballer, motorcycle accident.ლანჩხუთის ”გურიას” ფეხბურთელი ავტოკატასტროფაში დაიღუპა * October 8 - Helmut Ruge, 74, German comedian, actor, and cabaret writer.Der messerscharfe Menschenfreund * October 8 - Jeen van den Berg, 86, Dutch Olympic speedskater (1956, 1960), winner of the Elfstedentocht (1954).Mister Elfsteden Jeen van den Berg (86) overleden * October 8 - Thomas Eric Duncan, 42, Liberian Ebola patient, first person diagnosed with Ebola in the United States, Ebola virus disease.US Ebola patient Thomas Duncan dies in hospital * October 8 - Zilpha Keatley Snyder, 87, American writer (The Egypt Game), stroke.Obituary: Zilpha Keatley Snyder * October 8 - Mike Waugh, 58, American politician, member of Pennsylvania State Senate (1998–2014), pancreatic cancer.Former Sen. Mike Waugh, of York County, dies * October 9 - Peter A. Peyser, 93, American politician, United States Representative for New York (1971-77 and 1979-83), Parkinson's disease.Peter A. Peyser, Congressman Who Challenged a Senator, Dies at 93 * October 9 - Jan Hooks, 57, American comedienne and actress (Saturday Night Live, Designing Women, The Simpsons, Batman Returns), cancer.‘Saturday Night Live’ Veteran Jan Hooks Dies at 57 * October 10 - Valeri Karpov, 43, Russian hockey player, 1993 world champion, head injury.Чемпион мира по хоккею Валерий Карпов скончался на 44-м году жизни * October 10 - Ed Nimmervoll, 67, Australian music journalist and author, brain cancer. * October 10 - Finn Lied, 98, Norwegian military researcher and politician.Tidligere industriminister Finn Lied er død * October 10 - Pavel Landovský, 78, Czech actor and dissident, heart attack.Neurvalý, osamělý, ale ke všem rovný. Zemřel herec Pavel Landovský * October 11 - Carmelo Simeone, 81, Argentine footballer (Vélez Sarsfield, Boca Juniors).Murió \"Cholo\" Simeone * October 11 - Tanhum Cohen-Mintz, 75, Israeli basketball player, cancer.Israeli sports mourns the passing of Cohen-Mintz * October 12 - Roberto Telch, 70, Argentine footballer (San Lorenzo, national team), heart attack.Murió el Oveja Telch, una gloria de San Lorenzo * October 12 - Ali Mazrui, 81, Kenyan professor and political writer. * October 13 - Antonio Cafiero, 92, Argentine politician, Governor of Buenos Aires (1987–1991), Senator (1993–2005), pneumonia. * October 13 - Pontus Segerström, 33, Swedish footballer (IF Brommapojkarna), brain cancer.BP-kaptenen Segerström död * October 14 - Isaiah \"Ikey\" Owens, 38, American keyboardist, heart attack.Isaiah \"Ikey\" Owens, Member of Jack White's Band and the Mars Volta, Has Died * October 14 - Elizabeth Peña, 55, American actress (The Incredibles, Rush Hour, Jacob's Ladder) and television director, septic shock and cardiopulmonary arrest complicated by cirrhosis of the liver.Elizabeth Pena, Famed Hispanic Actress, Dies at 55 * October 15 - Marie Dubois, 77, French actress (La Grande Vadrouille, Monte Carlo or Bust, La Menace), multiple sclerosis.L'actrice Marie Dubois est morte * October 15 - Giovanni Reale, 83, Italian historian and philosopher.Addio a Giovanni Reale, grande interprete di Platone * October 15 - Robert Tiernan, 85, American politician, member of the U.S. House for Rhode Island's 2nd district (1967–1975).Former Rhode Island Congressman Robert Tiernan dies at 85 * October 16 - John Spencer-Churchill, 11th Duke of Marlborough, 88, British peer, custodian of Blenheim Palace. * October 16 - Misty Upham, 32, American actress (Frozen River, August: Osage County).Misty Upham Found Dead: Family Of ‘Frozen River’ Actress Says Police Uncooperative In Search (body discovered on this date) * October 16 - Patrick Paul D’Souza, 86, Indian prelate, Bishop of Varanasi (1971–2007). * October 16 - Sumi Haru, 75, American actress (M*A*S*H).Sumi Haru, Former SAG Interim President, Dies at 75 * October 16 - Tim Hauser, 72, American musician (The Manhattan Transfer), cardiac arrest. * October 17 - Mikhail Marynich, 74, Belarusian politician.Умер Михаил Маринич. Прощание с политиком состоится 19 октября * October 17 - Daisuke Oku, 38, Japanese footballer, car accident.Former Japan international Oku dies following car crash * October 17 - Tom Shaw, 69, American prelate, Bishop of Massachusetts (1995-2014), brain cancer. * October 17 - Gero Bisanz, 78, German football host.DFB trauert um Gero Bisanz * October 17 - Edwards Barham, 77, American politician, Senator of Louisiana (1976-1980), plane crash. * October 18 - Rachel Makinson, 97, Australian research scientist.Scientist Rachel Makinson broke new ground and CSIRO glass ceiling * October 18 - Joanne Borgella, 32, American singer (American Idol) and model, endometrial cancer.Joanne Borgella, Former 'American Idol' Contestant,' Dead at 32 * October 18 - Paul Craft, 76, American musician and songwriter (\"Brother Jukebox\").Paul Craft, Songwriters Hall of Famer, dies at age 76 * October 19 - Lynda Bellingham, 66, Canadian- British actress, colon cancer.Lynda Bellingham: Tributes paid after actress dies at 66 * October 19 - Gloria Casarez, 42, American civil rights activist, cancer.Philly LGBT Advocate Gloria Casarez Dies at 42 * October 19 - Raphael Ravenscroft, 60, British saxophonist (\"Baker Street\") and author, suspected heart attack. * October 19 - John Holt, 69, Jamaican singer. * October 19 - Stephen Paulus, 65, American composer, stroke.Composer Stephen Paulus dead at 65 * October 19 - Étienne Mourrut, 74, French politician, MP for Gard's 2nd constituency (2002–2012), Mayor of Le Grau-du-Roi (1983–2014).Le Grau-du-Roi : Etienne Mourrut est décédé ce matin * October 20 - Ox Baker, 76, American wrestler and actor (Escape from New York), heart attack.Wrestling Legend Ox Baker Passes Away Aged 80 * October 20 - Oscar de la Renta, 82, Dominican Republic fashion designer, cancer.Fashion Icon Oscar de La Renta Dies at 82 * October 20 - Efua Dorkenoo, 65, Ghanaian-born British campaigner against female genital mutilation, cancer.Efua Dorkenoo OBE, the ‘incredible African female warrior', has died * October 20 - Pavle Merkù, 87, Slovene composer.Poslovil se je Pavle Merkù * October 20 - René Burri, 81, Swiss photographer, cancer. * October 21 - Gough Whitlam, 98, Australian politician, Prime Minister (1972–1975).Gough Whitlam dies at age 98 * October 21 - Mohammad-Reza Mahdavi Kani, 83, Iranian politician, acting Prime Minister (1981), heart failure.Head of Assembly of Experts dies at 83 * October 21 - Christophe de Margerie, 63, French businessman, president (CEO) of Total SA, plane crash.Christophe de Margerie, C.E.O. of Total, French Oil Giant, Dies in Accident * October 21 - Seth Gaaikema, 75, Dutch comedian and writer, heart failure.Cabaretier en tekstschrijver Seth Gaaikema uit Schijndel (75) overleden * October 21 - Benjamin C. Bradlee, 93, American journalist and editor, Executive editor of The Washington Post, Alzheimer's disease.Legendary Post Editor Ben Bradlee Dies at 93 * October 22 - John-Roger Hinkins, 80, American author and public speaker.Founder of controversial spiritualist group MSIA whose followers include Arianna Huffington dies at age 80 * October 22 - Nathan Cirillo, 24, Canadian reservist soldier, shot.Soldier fatally shot on Parliament Hill identified as Nathan Cirillo of Hamilton * October 22 - Michael Zehaf-Bibeau, 32, Canadian gunman, suspected perpetrator of the 2014 shootings at Parliament Hill, shot.Ottawa Gunman Identified As Michael Zehaf- Bibeau * October 23 - Göran Johansson, 69, Swedish politician, Mayor of Gothenburg Municipality (1988-1991), and union leader.Göran Johansson (S) har avlidit * October 23 - Alvin Stardust, 72, English singer (\"My Coo Ca Choo\"), prostate cancer.Alvin Stardust, glam rock singer, dies aged 72 * October 23 - John Bramlett, 73, American football player (Boston Patriots). * October 23 - Ghulam Azam, 91, Bangladeshi war criminal, convicted for the Bangladesh Liberation War, stroke. * October 23 - Joan Quigley, 87, American astrologer, spiritual advisor for Nancy and Ronald Reagan, short-illness.Joan Quigley, astrologer who advised Reagans, dies * October 23 - Bernard Mayes, 85, British-born American broadcast and academic, Parkinson's disease.Bernard Mayes, KQED-FM’s First General Manager, Dies at 85 * October 23 - André Piters, 83, Belgian footballer (Standard Liège).L'ancien attaquant du Standard 'Popeye' Piters est décédé * October 24 - Kim Anderzon, 71, Swedish actress (Second Dance), spinal cancer.Kim Anderzon är död * October 24 - Mbulaeni Mulaudzi, 34, South African middle-distance runner, Olympic silver medalist (2004), traffic collision. * October 24 - S. S. Rajendran, 86, Indian actor, lung infection.S S Rajendran dies at the age of 86 * October 24 - Lorenzo Albacete, 73, American Roman Catholic priest.Rest in Peace, Msgr. Lorenzo Albacete: Communion and Liberation Priest Enters Eternal Encounter * October 25 - Reyhaneh Jabbari, 26, Iranian women convicted of murder, executed.Iran hangs Reyhaneh Jabbari despite campaign * October 25 - Jack Bruce, 71, Scottish musician (Cream) and composer, liver disease.Cream bassist Jack Bruce dies, aged 71 * October 25 - Carlos Morales Troncoso, 74, Dominican politician, Vice President (1986–1994), Secretary of Foreign Affairs (2004–2014), leukemia.Muere excanciller Carlos Morales Troncoso; personalidades externan condolencias * October 25 - Marcia Strassman, 66, American actress (Welcome Back, Kotter, Honey, I Shrunk the Kids), breast cancer.Marcia Strassman Dead: Starred In ‘Welcome Back Kotter,’ ‘Honey I Shrunk The Kids’ * October 26 - Oscar Taveras, 22, Dominican baseball player (St. Louis Cardinals), car accident.Cardinals outfielder, Oscar Taveras, dies in car crash * October 26 - Mo Collins, 38, American football player (Oakland Raiders), kidney failure.Raiders guard Mo Collins dies at 38 * October 26 - Germain Gagnon, 71, Canadian ice hockey player (Chicago Blackhawks, Montreal Canadiens, New York Islanders), long-illness.Germain Gagnon s’éteint à 71 ans * October 26 - Senzo Meyiwa, 27, South African footballer (Orlando Pirates), shot.S Africa football captain Senzo Meyiwa shot dead * October 26 - Jeff Robinson, 52, American baseball player (Detroit Tigers).Former Tigers pitcher Jeff Robinson, 52, dies * October 26 - Genpei Akasegawa, 77, Japanese author and artist, sepsis.赤瀬川原平さん死去 「老人力」「超芸術トマソン」 * October 27 - Starke Taylor, 92, American politician, Mayor of Dallas, Texas (1983–1987).Former Dallas Mayor Starke Taylor Jr. Dead At 92 * October 27 - Shin Hae-chul, 46, South Korean singer (N.EX.T), heart attack.S. Korean rock singer dies following heart attack * October 28 - Hans Schneider, 87, Austrian-born American mathematician and journal editor (\"Linear Algebra and its Applications\"), cancer.Hans Schneider, a mathematician of the most linear kinds, dies * October 28 - Michael Sata, 77, Zambian politician, President (since 2011), heart attack. * October 28 - Romualdas Granauskas, 75, Lithuanian author.Mirė rašytojas Romualdas Granauskas * October 28 - Koichiro Kimura, 44, Japanese professional writer and martial artist, pneumonia.W☆ING、リングス、DDTなどで活躍した木村浩一郎さんが死去 * October 28 - Galway Kinnell, 87, American Pulitzer Prize-winning poet, leukemia.Från Ödeshög till VM-hjälte * October 29 - Klas Ingesson, 46, Swedish footballer (national team), multiple myeloma. * October 30 - Thomas Menino, 71, American politician, Mayor of Boston (1993–2014), cancer.Tom Menino, Boston's longest-serving mayor, dies at 71 * October 30 - Bob Geigel, 90, American professional wrestler and promoter, Alzheimer's disease.1970s Promoter Bob Geigel Passes Away * October 31 - David Manker Abshire, 88, American diplomat, Permanent Representative to NATO (1983–1987).Ambassador David M. Abshire, CSPC Vice Chairman, dies * October 31 - Hitoshi Motoshima, 92, Japanese politician, Mayor of Nagasaki (1979–1995). * October 31 - John Forzani, 67, Canadian businessman and football player, heart attack. Former Calgary Stampeder John Forzani dies after heart attack in California * October 31 - Renato Sellani, 88, Italian jazz pianist and composer.È morto Renato Sellani, leggenda del piano jazz * October 31 - Brad Halsey, 33, American baseball player (Oakland Athletics), fall. ==Previous months== *Deaths in January 2014 *Deaths in February 2014 *Deaths in March 2014 *Deaths in April 2014 *Deaths in May 2014 *Deaths in June 2014 *Deaths in July 2014 *Deaths in August 2014 *Deaths in September 2014 *Deaths in November 2014 *Deaths in December 2014 ==References== *10 Category:October 2014 events",
 "title": "Deaths in October 2014"
}