{
 "id": "464722",
 "text": "Ibrahim Awwad (), known by his pseudonym Abu Bakr al-Baghdadi (; 28 July 1971 - 26 October 2019) was an Iraqi terrorist and politician. He was leader of the Islamic State of Iraq and the Levant from 2013 to 2019. His followers in the Islamic State of Iraq and the Levant (ISIL) call him their caliph. On 4 October 2011, the US State Department listed al-Baghdadi as a Specially Designated Global Terrorist, and announced a reward of up to US$10 million for information leading to his capture or death. His father was Awwad Ibrahim, a religious cleric. The family belonged to al-Badri tribe. On 11 July 2017, the Syrian Observatory for Human Rights was quoted by Reuters and AFP as saying that it had \"confirmed information\" that al-Baghdadi has been killed by a Russian airstrike in Syria sometime in June 2017 at the either age of 45. However, on 28 September 2017, Islamic State of Iraq and the Levant released a 46-minute audio recording of al-Baghdadi in which he refers to events that had happened since the death rumors, including North Korean threats against Japan and United States and the recapture of Mosul by U.S. backed Iraqi forces in July. On 26 October 2019, Baghdadi killed himself by detonating a bomb on his chest during a United States special operations raid in Syria's northwestern Idlib province in a village called Barisha. This is confirmed by US President Donald Trump at 9am EST (1300 GMT). Abu Ibrahim al-Hashimi al-Qurashi replaced him as the leader of ISIS. == Personal life == Abu Bakr al-Baghdadi had several wives, including Asma Fawzi Muhammad al-Dulaimi, Israu Rajab Mahal al- Qaisi, Sujida al-Dulaimi (also known as \"Saja\") and, according to various media reports, German teenager Diane Kruger. He had children from these marriages, including a son named Huzaifa al-Badri, who was killed in action in 2018. During the Barisha raid, two or three of his children died along with him. In addition, al-Baghdadi had siblings, including Rasmia Awad, who was detained by Turkish authorities, and Juma, who acted as a courier for him. Other relatives such as Duaa Amid Ibrahim and Abu Ahmed al-Samarrai were also involved or associated with his activities. Abu Bakr al-Baghdadi's three daughters. One of his daughters, Umaima al-Baghdadi, was married to ISIS leader Abu Nuradin Rustamov, who was killed by a US F-16 fighter-bomber in 2016. ==References== Category:1971 births Category:2019 deaths Category:Caliphs Category:Iraqi politicians Category:Islamic State people Category:Al-Qaeda people Category:Murderers who committed suicide Category:Suicide bombings in the 2010s Category:Suicide in 2019 Category:Specially Designated Nationals and Blocked Persons List Category:Iraqi military people Category:Deaths by suicide bomber Category:Prisoners of war Category:War criminals",
 "title": "Abu Bakr al-Baghdadi"
}