{
 "id": "464996",
 "text": "The Guggenheim Museum Bilbao is a museum of modern art. It is in Abando, Bilbao, Spain. The museum was opened in 1997. It is one of the several museums belonging to Solomon R. Guggenheim foundation. This museum was designed by the architect Frank Gehry. There are no flat surfaces in this building. The structure of the building is made of glass, titanium, and limestone. > \"Frank Gehry’s Guggenheim Museum Bilbao not only changed the way that > architects and people think about museums, but also boosted Bilbao’s economy > with its astounding success.\" The museum has three aims in its mission. The museum wants to bring together and help the public to interpret the arts of our time. They want to encourage art education. They also want to increase the knowledge of the public's understanding of the arts. The collections at the Guggenheim Museum Bilbao have works by the some of the most famous artists of the past four decades. There are works of many genres including Minimalism, Pop Art, Conceptual Art and Abstract Expressionism. Spanish contemporary and Basque art are also displayed from some of the local and regional artists. There are over one hundred exhibitions in the museum. There have been approximately ten million visitors to the museum. File:Bilbao.Guggenheim13.jpg|Bilbao Guggenheim File:Bilbao.JPG|Bilbao Guggenheim File:Guggenheim-bilbao-jan05.jpg|Bilbao Guggenheim File:Guggenheim Museum, Bilbao, July 2010 (47).JPG|Guggenheim Museum, Bilbao, July 2010 File:Bilbao.Koons02.jpg|Bilbao Puppy by Jeff Koons File:Bilbao Guggenheim Museum, Basque Country, Spain.JPG|Acrylics on fine art paper painting by Iñaki Crespo File:Guggenheim Museum, Bilbao, July 2010 (44).JPG|Guggenheim Museum, Bilbao, July 2010 File:Guggenheim night 2 (3804035123).jpg|Guggenheim museum at night ==References== ==Other websites== *http://www.guggenheim.org/bilbao - Guggenheim Museum Bilbao *http://www.bbc.com/culture/story/20131218-when-the-museum-is-the-art - Guggenheim Museum Bilbao: Art inside and out Category:Art museums in Spain Category:Bilbao Category:12 Treasures of Spain Category:1997 establishments in Europe",
 "title": "Guggenheim Museum Bilbao"
}