{
 "id": "464971",
 "text": "Seville Cathedral is one of the famous Roman Catholic cathedrals in Spain. It is in Seville state. It is the third largest cathedral in the world and the largest Gothic style cathedral. It was consecrated in 1507. In 1987, UNESCO added this church as a World Heritage site. In the early 16th century, Hagia Sophia made the church into a mosque. At that time, the cathedral was the largest church or cathedral in the world. Christopher Columbus is buried in this church. ==Gallery== File:Cathedral and Archivo de Indias - Seville.jpg|Seville Cathedral. File:Sevilla kathedrale.jpg|Exterior of the Cathedral (South view). File:View From Seville Cathedral 02.jpg|View from inside of La Giralda. File:Seville Massive Se Cathedral Facade.jpg|Façade of the Cathedral. Image:La Giralda - 2.jpg|Giralda as seen from the outside wall of the Patio de los Naranjos. File:Torre de la Giralda - Plaza Virgen de los Reyes - Sevilla.jpg|Giralda from Plaza Virgen de Los Reyes . File:Sevilla2005July 036.jpg|Cathedral rooves as seen from the Giralda. File:Naves 001jpg.jpg|Interior of the Cathedral. File:Spain Andalusia Seville BW 2015-10-23 12-30-25 stitch.jpg|Inside the Cathedral. File:Vidriera catedral Sevilla 001.jpg|Inside the Cathedral. File:Relicarios en la capilla de las Doncellas. (Catedral de Sevilla).jpg|Relics at the Cathedral. File:Patio of the Oranges Gate, Seville Cathedral.jpg|Gate to the Patio de los Naranjos, part of the old Almohad mosque, now annexed to the Cathedral. File:Pierre Dancart Altarpiece Seville.jpg|Pierre Dancart's masterpiece, considered one of the finest altarpieces in the world. File:Cristo de los cálices.jpg|Montañés' Cristo de los Cálices (1603), located in the Sacristy. File:Seville panorama.jpg|Panoramic view File:Catedral de Santa María de la Sede. Interior.jpg|Inside the cathedral File:Sevilla cathedral - vault.jpg|Details of vaults in front of main chapel ==References== == Other websites == * Official website * Interactive 360° panorama from Plaza del Triunfo with Cathedral, Alcázar and Archivo General de Indias (Java, highres, 0,9 MB) * acred-destinations * More information of Seville Cathedral as the monument of Spain * Great Building Website with more information about Seville Cathedral * Bluffton University images and details pertaining to Catedral de Sevilla Category:Roman Catholic cathedrals in Spain Category:12 Treasures of Spain Category:15th-century buildings and structures",
 "title": "Seville Cathedral"
}