{
 "id": "464913",
 "text": "Achraf Baznani (born 1 January 1979) is a Moroccan artist, filmmaker and photographer. He was born in Marrakesh. == Biography == Baznani got started in photography by chance. He received a Kodak Ektra Compact 250 camera for his birthday as a teen. Baznani is self-taught and has never taken photography classes. He has made several short films and documentaries. These include \"Walk\" in 2006 and \"The Forgotten\" in 2007. \"The Immigrant\" in 2007 received several national and international awards. Baznani is best known for being the first artist in the Arab world to publish a photo-book based on surreal imagery. Both books, Through My Lens and Inside My dreams, are surreal. Baznani places himself within his photographs of everyday objects, scenes and amusing situations. His works were featured in various magazines worldwide like PicsArt, National Geographic, Mambo, Photo+, Amateur Photographer, Fotografe Melhor, Digital Photo magazine. During 2014, he completed his \"52 Project \", a personal mission which he committed to taking a picture every week in a row for a year. == Claim of plagiarism == Achraf Baznani had accused Heretic movie director of plagiarism, posting a side-by-side comparison of his original artwork, which was taken from the newspaper Evening Standard Charles Saatchi’s column, and the Heritic movie poster on his website. Achraf Baznani has accused the creative team behind the upcoming horror film, \"Heretic\" of plagiarizing his original artwork. Baznani claims that the official poster for the film bears striking similarities to his own work, raising questions about intellectual property rights and artistic integrity. == Awards == Achraf Baznani has won these awards: === Cinema === * 2006: Best Director: national educational film festival in Casablanca, Morocco. * 2007: Best Director: national festival of the education thread in Casablanca, Morocco. * 2008: Best Director: national festival of amateur short film Settat, Morocco. * 2008: Best Director: national festival of short film creators in Casablanca, Morocco. * 2008: Best Director: the short film festival in Nador, Morocco. * 2009: Best Director: national Educational Film Festival in Fes, Morocco. * 2009: Jury Prize at the International Festival of Short and Documentary Films in Casablanca, Morocco. * 2009: First prize in the short film festival in the Arab League. === Photography === * 2015: Best in the show in Park Art Fair International * 2015: Merit in Sydney International Exhibition of Photography * 2015: 1st Prize in B2zone art contest in Switzerland * 2016: Honorable mention in Park Art Fair International * 2016: 1st Place Winner – Golden Ribbon in Notindoor photography magazine contest * 2016: Golden Orchid Grand Prize * 2016: International Prize Colosseo, Roma, Italy == Artistic career == === Exhibitions === *2024: Don't be a Square, Akka Project, Venezia, Italy *2015 \"Colour brust\", PH21 Gallery, Budapest, Hungary * 2015: Park Art Fair International 2015, Triberg, Germany * 2015: Gallery Globe, Adisson, Texas, USA * 2015: Digital Private Exhibition Louvre Museum, Paris, France * 2015: My Small World, Solo Exhibition, Marrakesh, Morocco * 2016: International Surrealism Now, Coimbra, Portugal * 2016: Park Art Fair International 2016, Triberg, Germany * 2016: Männer, Gräfelfing, Germany * 2016: Inside my Dreams, Solo Exhibition, Rabat, Morocco === Art books === * 2014: Through my lens, Art book, . * 2014: Inside my dreams, Art book, . === Magazine covers === * YouAll Models magazine, Devember 2024 * Coral Avenue magazine, November 2024 * PH magazine, Canada, issue 42, ISSN 1924-9424. * FOTOdigital, Portugal, issue 17 * Magazine, US, issue 2, * PicsArt, US, issue 15 * Mambo, Spain, special edition December 2014 * One Shoot magazine, Mexico, issue 27 * Zarah magazine, US, October 2014 * Art Reveal Magazine, Issue 5, Finland, June 2015. * Cultura Errante, Mexico, October 2015 * Artinzene, Issue 4, New Zealand, November 2015 * Knack magazine, Issue 31 * Convex Photography Magazine - February 2016, India === Movies === * 2006: Marche * 2007: Emigrant * 2009: Eyes == References == == Other websites == * Official site * IMDb * PH Magazine , Issue 42, pp 36–39 * Achraf Baznani: Surreal, Inventive Digital Photographs Category:1979 births Category:Living people Category:Filmmakers Category:People from Marrakesh Category:Moroccan writers Category:Photographers",
 "title": "Achraf Baznani"
}