{
 "id": "465044",
 "text": "The Niagara Movement, was a civil rights group of African-American activists who wanted equal rights for blacks. It was led by W. E. B. Du Bois. The movement opposed the Atlanta Compromise by Booker T. Washington. ==Founding== Along with Du Bois and Trotter, Fredrick McGhee of St. Paul, Minnesota, and Charles Edwin Bentley of Chicago also recognized the need for a national activist group.Fox, p. 89. The foursome organized a conference to be held July 11–13, 1905, in Buffalo, New York. 59 carefully selected anti-Bookerites were invited to attend; 29 showed up, including prominent community leaders and a notable number of lawyers. At the last minute, to avoid disruption, the meeting was moved to the Erie Beach Hotel in Fort Erie, Ontario, Canada, across the Niagara River from Buffalo. The organization founded at this meeting chose Du Bois as its general secretary and Cincinnati lawyer George H. Jackson as treasurer. It set up committees to oversee progress on the organization's goals. State chapters would advance local agendas and disseminate information about the organization and its goals.Fox, p. 90. Its name was chosen to reflect the site of its first meeting and to be representative of a \"mighty current\" of change its leaders sought to bring about. Seventeen founders were each appointed as state secretary to individually represent 17 of the states of the union:The Voice of the Negro, Volumes 1 - 4, 1903–1907, Negro Universities Press, New York, 1949, page 704. Retrieved February 24, 2021. *Massachusetts – CG Morgan *Georgia – John Hope *Arkansas – FB Coffin *Illinois – CE Bentley *Kansas – B. S. Smith *D.C. – L. M. Henshaw *New York – G. F. Miller *Virginia – James Robert Lincoln Diggs *Colorado – C. A. Franklin *Pennsylvania – G. W. Mitchell *Rhode Island – Byron Gunner *New Jersey – T. A. Spraggins *Maryland – G.R. Waller *Iowa – G. H. Woodson *Tennessee – Richard Hill *Minnesota – F. L. McGhee *West Virginia – J. R. Clifford ==References== Category:Civil rights organizations based in the United States",
 "title": "Niagara Movement"
}