{
 "id": "465174",
 "text": "Hunter Andrew Pence (born April 13, 1983)\"Hunter Pence is Philly style .\" The Philadelphia Inquirer: August 11, 2011. is a retired American Major League Baseball player. Pence plays for the San Francisco Giants. He plays the position outfielder. He previously played for the Houston Astros and Philadelphia Phillies. Pence is tall. He weighs . He bats and throws right- handed. Pence was with the San Francisco Giants when they won the World Series in 2012. ==Career== Houston Astros Hunter Pence in 2008 with the Astros. A college player from Texarkana, Texas, Hunter Pence was drafted by the Milwaukee Brewers in the 40th round in 20021 but turned down the offer to join the University of Texas at Arlington Mavericks. He later signed his first professional contract with the Houston Astros, who selected him in the second round of the 2004 amateur player draft. ===Season 2007=== He played his first major league game on April 28, 2007. In his rookie season, he maintained an impressive batting average of .322 and totaled 17 home runs and 69 runs batted in 108 games. He finished 3rd in the National League Rookie of the Year voting, behind Ryan Braun and Troy Tulowitzki. 2007 Awards Voting, baseball- reference.com. Consulted on 20 october 2023. ===Season 2008=== Pence improved his statistics in his second year, hitting 160 hits, 13 more than his first season. He hit 25 home runs and drove in 83 runs. However, his batting average dropped to .269. ===Season 2009=== In 2009, the outfielder earned his first All-Star selection in Major League Baseball. ===Season 2010=== This section is empty, insufficiently detailed, or incomplete. Your assistance is welcome! How to help? ===Season 2011=== Pence was once again invited as the Astros' representative to the All-Star Game in 2011. Philadelphia Phillies Hunter Pence in June 2012 with the Philadelphia Phillies. On July 29, 2011, just two days before the trade deadline in Major League Baseball, Pence was traded to the Philadelphia Phillies in exchange for four minor league players (first baseman Jonathan Singleton, right-handed pitchers Jarred Cosart and Josh Zeid, Pence-sylvania: Phils acquire Astros outfielder, Todd Zolecki / MLB.com, 20 october 2023. outfielder Domingo Santana) Singleton move a reminder how the Astros won the Pence trade , Jose de Jesus Ortiz, Houston Chronicle, 20 october 2023.). Pence hit .324 with 35 runs batted in the last 54 games of the season with the Phillies. During this period, he hit 11 home runs, the same number he had in the previous 100 games of the 2011 season with Houston. He finished the year with a .314 batting average, 190 hits, 22 home runs, and 97 runs batted in (a new personal record). He had four hits, drove in four runs, and scored three in the five-game Division Series between the Phillies and the St. Louis Cardinals. Pence had a somewhat disappointing first half of the 2012 season. In 101 games in Philadelphia, his batting average was .271. He had 17 home runs and 59 runs batted in but also slightly more strikeouts (85). ==San Francisco Giants== Hunter Pence in 2013 with the San Francisco Giants. On July 31, 2012, Hunter Pence was traded to the San Francisco Giants in a deal that sent outfielder Nate Schierholtz, minor league catcher Tommy Joseph, and minor league right-handed pitcher Seth Rosin to Philadelphia.Giants add Pence, send three to Phillies, Chris Haft / MLB.com, 20 october 2023. He batted only .219 in his last 59 games of the 2012 season with San Francisco but still hit 7 home runs and had 45 runs batted in. He finished the season with 24 home runs and a career-high 104 runs batted in. His batting average was .253 in 160 games played for Philadelphia and the Giants. His batting average was .209 in 16 playoff games with one home run and 4 runs batted in, and he enjoyed winning the 2012 World Series with San Francisco, his first title of that kind. ===Season 2013=== The mediocre performances of late 2012 gave way to an excellent 2013 season for Pence, who was one of the top hitters for the Giants. Playing all 162 games for his team, he set a new personal record for home runs (27), added 35 doubles, had a total of 178 hits, and drove in 99 runs. He scored 91 runs and stole a personal best of 22 bases in 25 attempts. He was named the National League Player of the Month for September 2013 with 11 home runs, the highest slugging percentage in the majors during that period (.667), 16 walks, 23 runs scored, and an on-base percentage of .393. Hunter Pence of the San Francisco Giants voted the Budweiser Presents National League Player of the Month for September, MLB.com, 20 october 2023. As the 2013 season ended, Pence, who was set to become a free agent in the following weeks, signed a $90 million contract for 5 seasons with San Francisco. ===Season 2014=== Pence received his 3rd career All-Star Game invitation in 2014, his first since joining the Giants. Pence was not in the starting lineup for the Giants on September 27, 2014, ending a streak that began on September 25, 2012, of 331 consecutive starts, the longest active streak in the majors. However, a pinch-hit appearance extended his consecutive games played streak to 382, the longest active streak of its kind in the majors. Pence sits, ends consecutive starts streak , Chris Haft / MLB.com, 20october 2023. Pence won the World Series for the second time in his career when the Giants triumphed over the Kansas City Royals in the 2014 World Series. He batted .444 in the 7 games of the final, with 12 hits, a home run, 5 runs batted in, 7 runs scored, an on-base percentage of .500, and a slugging percentage of .667. He reached base 15 times in 30 plate appearances against the Royals. In total, in 17 playoff games in 2014, Pence maintained a batting average of .333 and an on- base percentage of .405. ===Season 2015=== On March 5, 2015, during spring training with the Giants, Pence fractured his left forearm when hit by a pitch from Corey Black of the Chicago Cubs, an injury that forced him into an expected 6 to 8-week period of inactivity. Indeed, he returned, following a tweet to Giants manager Bruce Bochy, on May 16. He made his season debut in Cincinnati, where he went 2 for 3 that day and hit a home run the next day. ==References== Category:Houston Astros players Category:Philadelphia Phillies players Category:San Francisco Giants players Category:1983 births Category:Living people Category:Sportspeople from Fort Worth, Texas Category:National League All-Stars",
 "title": "Hunter Pence"
}