{
 "id": "465189",
 "text": "The Walls of Ávila in central Spain were completed between the 11th and 12th centuries. They are the city's principal historic feature. == About == The work was started in 1090 by Raymond of Burgundy.International Dictionary of Historic Places: Southern Europe, Vol. 3 Southern Europe, eds. Trudy Ring; Robert M. Salkin; Sharon La Boda (Chicago: Fitzroy Dearborn Publishers, 1995), p. 69 Most of the walls appear to have been rebuilt in the 12th century. The enclosed area is a rectangle of with a perimeter of some , including 90 semicircular crenellated towers. The walls have an average width of . They have an average height of . The wall has nine fortified gates. The Puerta de San Vicente (Gate of St Vincent) and Puerta del Alcazar (Gate of the Fortress) are flanked by twin towers, high, linked by a semicircular arch. The apse of the cathedral also forms one of the towers. The fortifications are the most complete in Spain.Brad Olsen, Sacred Places Europe: 108 Destinations (San Francisco, CA: Consortium of Collective Consciousness, 2007), p. 280 It is possible to walk on the walls for about half their circumference. Some of the walls will never be able to be walked on because they are connected to other buildings. There is a large section of the walls that have not been made safe for people. The site was registered as a National Monument in 1884. In 1985, the old city of Ávila and its extramural churches were declared a World Heritage site by UNESCO.\"Old Town of Ávila with its Extra-Muros Churches\", UNESCO. Retrieved 15 April 2012 The walls were one of finalists for the 12 Treasures of Spain in 2007. == Gallery == File:Ávila 24-8-2002.jpg|A view of the Walls of Ávila File:Avila01.jpg|Another view. File:Puerta del alcazar.jpg|Puerta del Alcazar File:Ávila. Murallas 2.JPG|Walls of Ávila. File:Avila Catedral 04 by-dpc.jpg|View of the apse from the east face of the walls. ==References== ==Sources== *The information in this article is based on that in its Spanish equivalent. ==Other websites== * Walls of Ávila in Artegias.com *http://muralladeavila.com/en/ - Muralla de Category:Buildings and structures in Spain Category:12th-century establishments in Spain",
 "title": "Walls of Ávila"
}