{
 "id": "465145",
 "text": "The Royal Abbey of Santa Maria de Poblet () is a Cistercian monastery. The abbey is located at the feet of the Prades Mountains, in the comarca of Conca de Barberà, in Catalonia (Spain). It was founded in 1150 by Ramon Berenguer IV, Count of Barcelona.Mary-Ann Gallagher; Nick Inman, DK Eyewitness Travel Guide: Barcelona & Catalonia (London; New York: DK, 2013), p. 126 It was the first of three monasteries that made up the \"Cistercian triangle\".Beebe Bahrami, The Spiritual Traveler: Spain : a Guide to Sacred Sites and Pilgrim Routes (Mahwah, NJ: HiddenSpring, 2009), p. 211 The other two were Vallbona de les Monges and Santes Creus. The main architect was Arnau Bargués. ==Burials== The following kings and queens of Aragon are buried at the Poblet Monastery: *Alfonso II (1196) *James I (1276) *Peter IV (1387), and his first three wives Maria of Navarre, Eleanor of Portugal, and Eleanor of Sicily *John I (1396), and his wives, Martha of Armagnac and Violant of Bar *Martin (1410), and his first wife, Maria de Luna *Ferdinand I (1416), and his wife, Eleanor of Alburquerque *Alfonso V (1458) *John II (1479), and his second wife, Joana Enríquez ==Images== Image:Plano Poblet224.jpg|Poblet ground plan File:Spain PobletMonastry Entrance.jpg|Gate File:Poblet-Reial Monestir de Poblet 15.JPG|Main belltower File:Poblet-Reial Monestir de Poblet 20.JPG|Tomb of a king and queen of Aragon within the Reial Monestir de Poblet File:Tomb of James I of Aragon - Monastery of Poblet - Catalonia 2014.jpg|Tomb of James I of Aragon File:PobletPanteo.jpg|Part of the Royal Pantheon after restoration File:Fuente de Poblet.jpg|Fountain for ablutions in one of the cloisters ==References== ==Other websites== *Monestir de Poblet Official website *Adrian Fletcher's Paradoxplace Poblet Pages (photos) *Monestirs de Catalunya. Poblet *Poblet photos Category:World Heritage Sites in Spain Category:Buildings and structures in Catalonia Category:Monasteries Category:12th-century buildings and structures",
 "title": "Poblet Monastery"
}