{
 "id": "465118",
 "text": "The church of St Mary at Mount Naranco () is a Roman Catholic church in Oviedo, northern Spain. It was built in 848 as a royal palace for King Ramiro I of Asturias.Agnieszka Drewno; et al, DK Eyewitness Travel Guide: Northern Spain (New York: DK Publishing, 2009), p. 92 It was changed into a church during the 13th century.James Maxwell Anderson, Spain, 1001 Sights: An Archaeological and Historical Guide (Calgary, Canada: University of Calgary Press; London: Robert Hale, 1991), p. 136 Santa María church is an example of Asturian pre-Romanesque architecture.Agnieszka Drewno; et al, DK Eyewitness Travel Guide: Northern Spain (New York: DK Publishing, 2009), p. 38 In 1985 it was declared a World Heritage Site by UNESCO.Policy and Law in Heritage Conservation, ed. Robert Pickard (New York; London: Spon Press, 2001), p. 269 It was declared Bien de Interés Cultural in 1885. The Church of St Mary at Mount Naranco was one of 100 finalists for the 12 Treasures of Spain in 2007. == Gallery == File:Santa Maria del Naranco.jpg|Facade with belvedere File:20060630-Oviedo Santa Maria del Naranco.jpg|Exterior view File:Planta de Santa María del Naranco vectorized.svg|Ground map of the church File:Santa María del Naranco interior.jpg|Inner view of the lower floor == Related pages == * Asturian art == References == == Additional reading == * James Fergusson, A history of architecture in all countries, Book VII: Spanish and Portugal * Lorenzo Arias Paramo, 'Geometría y proporción en la arquitectura prerrománica asturiana', Actas del III Congreso de Arqueología Medieval Española, Universidad de Oviedo, pp. 27–37 ==Other websites== * Official page of Santa María del Naranco and San Miguel de Lillo * 3D model on Google Earth * A photo essay about the Santa María del Naranco Category:World Heritage Sites in Spain Category:Churches in Spain Category:Oviedo Category:840s establishments Category:9th-century buildings and structures",
 "title": "Santa María del Naranco"
}