{
 "id": "465113",
 "text": "The Cathedral of Málaga is a Renaissance cathedral in the city of Málaga in Andalusia, Spain. It was constructed between 1528 and 1782. ==Description== The cathedral, built on a rectangular floor plan, is composed of a nave and two aisles. The nave is wider but has the same height as the aisles. The choir stalls are the work of Pedro de Mena. ==Gallery== File:Malaga Cathedral, Malaga, Spain.jpg File:Maxim.Fotos - Málaga de noche 8.jpg File:CorocatedraldeMálaga.jpg File:CatedralMalaga1.jpg ==References== * EISMAN, E. L.: \"Traducción de una bula de la catedral de Málaga\", Jábega, nº 41, Diputación Provincial de Málaga, 1983, pp. 17–21. * GONZÁLEZ SÁNCHEZ, V.: Catálogo general de la documentación del Archivo Histórico de la Iglesia Catedral de Málaga. Málaga: Edinford, 1994. * RIESCO TERRERO, Á.: \"El Archivo Catedral de Málaga: hacia una nueva reorganización y catalogación de fondos\", Baetica: Estudios de arte, geografía e historia, nº 9, Universidad de Málaga, 1985, pp. 269–286. * RIESCO TERRERO, Á.: \"Colaboración del Obispo y Cabildo Catedral de Málaga a la empresa real de selección y edición de obras de San Isidoro de Sevilla (Edic. Regia 1597–99) y al enriquecimiento de dos grandes centros documentales: El Archivo General de Simancas y a la Biblioteca de El Escorial\", Baetica, nº 11, Universidad de Málaga, 1988, pp. 301–322. * SÁNCHEZ MAIRENA, A.: \"El Archivo de la Catedral de Málaga: su primera organización a partir del inventario de 1523\", E-Spania: Revue électronique d'études hispaniques médiévales, ISSN 1951-6169, nº 4, 2007. * SÁNCHEZ MAIRENA, A.: \"Notas sobre el Archivo de la Catedral de Málaga en el siglo XVI\" en M.ª Val González de la Peña (ed.), Estudios en memoria del profesor Dr. Carlos Sáez: Homenaje. Madrid: Universidad de Alcalá de Henares, 2007; pp. 621–650. * VEGA GARCÍA-FERRER, M.ª J.: \"Los cantorales de gregoriano en la catedral de Málaga\", F. J. Giménez Rodríguez et alii (coord.), El patrimonio musical de Andalucía y sus relaciones con el contexto ibérico. Granada: Universidad de Granada, 2008; pp. 111–126. ==Other websites== *History *Quick guide to visit: The Cathedral of Málaga Category:Roman Catholic cathedrals in Spain Category:Málaga Category:16th-century buildings and structures Category:18th- century establishments in Spain Category:1780s establishments in Europe",
 "title": "Málaga Cathedral"
}