{
 "id": "465234",
 "text": "The Park Güell (Catalan: Parc Güell) is a public park system of gardens and architectonic elements. It is located on Carmelo Hill, in Barcelona (Spain). Carmelo Hill belongs to the mountain range of Sierra de Collserola — the Parque del Carmelo (Catalan: Parc del Carmel) is located on the northern face. Park Güell is located in La Salut, a neighborhood in the Gràcia district of Barcelona. With urbanization in mind, Eusebi Güell gave the design of the park to architect Antoni Gaudí. He designed the park in the Catalonian modernism style. The park was built between 1900 and 1914. It opened as a public park in 1926. In 1984, UNESCO declared the park a World Heritage Site under “Works of Antoni Gaudí”. Park Güell was one of 100 finalists for the 12 Treasures of Spain in 2007. ==Gallery of Images== Image:View from Park Güell Terrace.jpg| View from the main terrace of the park. image:Goelenterance06390139.JPG|Entrance to the Park. image:Goelbirdnests06390137.JPG|Bird nests built by Gaudí in the terrace walls. The walls imitate the trees planted on them. image:GuellTerraceSeperate.jpg|An uninterrupted view of the terrace walls. Image:Parc Güell viaduct.jpg|Viaduct Image:Barcelona 29-04-2006 11-29-38.JPG|One of Gaudí's unique tiles in Parc Güell Image:Ceiling mosaic, Park Güell, Barcelona.jpg|Ceiling Mosaic in the Hypostyle Room, Park Güell, Barcelona Image:Park Güell - Pabellón de entrada.jpg|Pavilion at the entrance Image:Escalinata de entrada del Park Güell.jpg|Third fountain at the entrance with the dragon Image:Casa Martí Trias i Domènech.jpg|Casa Martí Trias i Domènech File:Panoramic view of the entrance to the Park Güell. Barcelona, Catalonia, Spain.jpg|Panoramic view of the entrance to the Park Güell. Barcelona, Catalonia, Spain ==References== ==Other websites== * Park Güell at Google Maps * UNESCO World Heritage Sites Works of Antoni Gaudí * Park Güell Barcelona - Gardens Guide * Park Güell Photo Gallery * Park Güell at Great Buildings * Interactive Panorama: Park Güell * Photographic walk through the Gaudí Park Category:Buildings and structures in Spain Category:World Heritage Sites in Spain Category:12 Treasures of Spain - Finalists Category:1914 establishments in Europe Category:1910s establishments in Spain",
 "title": "Park Güell"
}