{
 "id": "465291",
 "text": "Las Médulas (As Médulas or As Meduas in Galician language) is a historical site near the town of Ponferrada, Spain.Damien Simonis; et al., Spain (Footscray, Vic.; London: Lonely Planet, 2007), p. 221 It used to be the most important gold mine in the Roman Empire. In order to remove the gold, the Romans washed away an entire mountain.James Maxwell Anderson, Spain, 1001 Sights: An Archaeological and Historical Guide (Calgary, Canada: University of Calgary Press; London: Robert Hale, 1991), p. 190 From the 2nd to the 4th century AD the Romans used slaves to mine about 900 tons of gold. It left a series of rock pinnacles, gullies, caves and tunnels. Las Médulas is listed by the UNESCO as one of the World Heritage Sites.Henry Cleere, 'The World Heritage Convention As a Medium for Promoting the Industrial Heritage', IA. The Journal of the Society for Industrial Architecture, Vol. 26, No. 2, 2000, p. 33 ==References== == Further reading == *Lewis, P. R. and G. D. B. Jones, Roman gold-mining in north-west Spain, Journal of Roman Studies 60 (1970): 169-85 *Jones, R. F. J. and Bird, D. G., Roman gold-mining in north-west Spain, II: Workings on the Rio Duerna, Journal of Roman Studies 62 (1972): 59-74. *Domergue, C. and Hérail, G., Conditions de gisement et exploitation antique à Las Médulas (León, Espagne) in L'or dans l'antiquité: de la mine à l'objet, B. Cauuet, ed., Aquitania Supplement, 9 (Bordeaux 1999): 93-116. *Journeys Through European Landscapes/Voyages dans les Paysages Européens. COST-ESF, Ponferrada: 101-104. == Other websites == *Webpage of Fundación Las Médulas, with itineraries, virtual visit and practical information *UNESCO official website *Photo gallery and explanation of the explotaition system *\"Las Médulas, the Roman El Dorado\". and Article by the Leonese writer Julio Llamazares. *Spanish site dedicated to Roman technology, especially aqueducts and mines *Social Structure and Territory-Landscape Archaeology research group * Action COST A27: Understanding pre-industrial rural and mining landscapes (LANDMARKS) European research project, a platform for scientific dissemination of Las Médulas Category:World Heritage Sites in Spain",
 "title": "Las Médulas"
}