{
 "id": "465792",
 "text": "The Evermoor Chronicles is a television series for the Disney Channel. It is produced by Lime Pictures. The series premiered on the Disney Channel (UK and Ireland) on 10 October 2014. It began on 17 October 2014 on the Disney Channel in the United States, and on the Family Channel in Canada. ==Plot== The series is about Tara Crossley. She is an American teen who moves from the United States to an English village called Evermoor. As her mother and father unpack at their new home, Tara, her brother, and her British step-siblings adjust to their new life. Danger, mystery and intrigue come along with the adventure. ==Cast and characters== * Clive Rowe as Mayor Chester Doyle * Finney Cassidy as Cameron Marsh * George Sear as Seb Crossley * Georgia Lock as Bella Crossley * Georgie Farmer as Jake Crossley * Jordan Loughran as Sorsha Doyle * Naomi Sequeira as Tara Crossley ==Development== On 17 March 2014, the series was announced. Filming took place in the spring of 2014 at Arley Hall in Cheshire. The series has been described as \"a hugely exciting project for the team here in EMEA with a gripping story that I’m sure will captivate our global Disney Channel audience. The movie’s intriguing cast of characters also gives us a great opportunity to find exciting new talent” by David Levine. Lime Pictures produced the special, which was created by Diane Whitley and Tim Compton. The executive producers was Rebecca Hodgson. The producer was Compton. It was a co-production between Disney U.S. and the Walt Disney Company EMEA. ==Episodes== ===Series 1 Pilot (2014)=== Evermoor pilot movie episodes No. Title Directed by Written by UK air date U.S. air date UK viewers (in millions) U.S. viewers (in millions) ===Series 1 (2015–2016)=== The Evermoor Chronicles series 1 episodes No. Title Directed by Written by Original air date UK viewers (in millions) === Series 2 (2017) === Series 2 of The Evermoor Chronicles was confirmed via Disney Channel UK's 2017 video on YouTube. Main characters Georgia Lock, Sammy Moore, Finney Cassidy, Georgie Farmer, Alex Starke, Margaret Cabourn-Smith, Clive Rowe, and India Ria Amarteifio return. New additions to the main cast include Ben Radcliffe as Iggi, Otto's brother, Scarlett Murphy as Alice Crossley, Bella's cousin, Ben Hull as Jed Crossley, Bella's uncle and Alice's father, and Christopher Brand as Davorin, an evil man trapped inside a magic mirror. A brand new plot, opening theme song, and new cast members are made into the second series. The new series premiered Monday, May 8, 2017. The Evermoor Chronicles Series 2 episodes No. Title Directed by Written by Original air date UK viewers (in millions) ==References== Category:Disney Channel television series Category:English-language television programs",
 "title": "The Evermoor Chronicles"
}