{
 "id": "46571",
 "text": "Voyager 1 is a space probe launched by NASA on September 5, 1977, as part of a mission called the Voyager program to explore the outer Solar System and the space beyond our Sun's influence. It was launched shortly after its twin, Voyager 2. Voyager 1 communicates with Earth using the NASA Deep Space Network (DSN) to receive commands and send back data. As of July 2024, it is the farthest human-made object from Earth, located about 163.3 astronomical units away (24.4 billion kilometers or 15.2 billion miles). During its journey, Voyager 1 flew past Jupiter, Saturn, and Saturn's largest moon, Titan. NASA decided to start studying Titan over Pluto because Titan has an unique atmosphere. Voyager 1 provided detailed information about the weather, magnetic fields, and moons of Jupiter and Saturn, capturing the first close-up images of these moons. In its extended mission, Voyager 1 explores the outer edges of our Solar System and aims to enter interstellar space. It crossed the heliopause on August 25, 2012, becoming the first spacecraft to do so, marking its entry into interstellar space. Two years later, Voyager 1 confirmed its location by finding waves of energy from the Sun. In 2017, the Voyager team successfully used the probe's thrusters for the first time since 1980 to change its direction in space. This adjustment allowed the mission to continue for an additional two to three years. Voyager 1 is still sending back scientific data and is expected to keep doing so until at least 2025. Its power source might even allow it to send engineering data until 2036. == Overview == === Early history === In the 1960s, there was a plan for a Grand Tour to study the outer planets. This led NASA to start working on a mission in the early 1970s. Information from the Pioneer 10 spacecraft helped engineers design Voyager to handle the strong radiation around Jupiter. Just before launch, they added strips of kitchen-grade aluminum foil to some cables to improve radiation protection. At first, Voyager 1 was going to be called Mariner 11 and be part of the Mariner program. Because of budget cuts, the mission was changed to only fly by Jupiter and Saturn, and the probes were renamed Mariner Jupiter-Saturn. The name was later changed to Voyager when the designs became very different from the Mariner missions. === Launch and trajectory === Voyager 1 was launched on September 5, 1977, from Cape Canaveral, Florida, using a Titan IIIE rocket. Voyager 2 was launched two weeks earlier, on August 20, 1977. Even though Voyager 1 was launched later, it reached both Jupiter and Saturn sooner because it followed a shorter path. Voyager 1's launch almost failed because the second stage of the Titan rocket shut down too early, leaving fuel unburned. The Centaur stage's computers recognized this problem and burned for longer than planned to give Voyager 1 the needed speed. The Centaur stage used almost all its fuel, with just 3.4 seconds of fuel left. If this problem had happened during Voyager 2's launch, the Centaur stage would have run out of fuel before reaching the correct path. Jupiter was in a better position for Voyager 1's launch than for Voyager 2's launch. Voyager 1's initial path took it to a point 8.9 astronomical units (AU) from the Sun, just short of Saturn's orbit at 9.5 AU. Voyager 2's path only reached 6.2 AU, well short of Saturn's orbit.HORIZONS , JPL Solar System Dynamics (Ephemeris Type ELEMENTS; Target Body: Voyager n (spacecraft); Center: Sun (body center); Time Span: launch + 1 month to Jupiter encounter – 1 month) === Flyby of Jupiter === Voyager 1 started taking pictures of Jupiter in January 1979. Its closest approach to Jupiter was on March 5, 1979, at about 349,000 kilometers (217,000 miles) from the planet's center. Because it was closer, the pictures of Jupiter's moons, rings, magnetic fields, and radiation belts were better. Most of these pictures were taken during the 48 hours around the closest approach. Voyager 1 stopped taking pictures of Jupiter in April 1979. The biggest surprise was finding active volcanoes on Jupiter's moon Io. This was the first time active volcanoes were seen on another body in the Solar System. The volcanic activity on Io seems to affect the whole Jovian system. Io is the main source of sulfur, oxygen, and sodium in Jupiter's magnetosphere, which is the area around the planet influenced by its magnetic field. These elements come from Io's volcanoes and are knocked off its surface by high-energy particles. The Voyager probes made many important discoveries about Jupiter, its moons, its radiation belts, and its rings, which had never been seen before. File:Jupiter from Voyager 1 PIA02855 thumbnail 300px max quality.ogv|Voyager 1 time-lapse movie of approaching Jupiter (full-size video) File:Great Red Spot From Voyager 1.jpg|alt=The Great Red Spot as seen from Voyager 1|Jupiter's Great Red Spot, a storm larger than Earth, as seen from Voyager 1 File:Volcanic crater with radiating lava flows on Io.jpg|alt=View of lava flows radiating from the volcano Ra Patera on Io|View of lava flows from the volcano Ra Patera on Io File:Vulcanic Explosion on Io.jpg|alt=A volcanic eruption plume rises over the limb of Io|The eruption plume of the volcano Loki rises over Io File:PIA01970.jpg|alt=Europa as seen from Voyager 1 at a distance of 2.8 million km|Europa's surface, showing active geology, at a distance of 2.8 million km. File:Ganymede - PIA02278.jpg|alt=Icy surface of Ganymede as photographed from 253,000 km|Ganymede's icy surface with impact sites, from 253,000 km. === Flyby of Saturn === Both Voyagers used Jupiter's gravity to help them reach Saturn and its moons and rings. Voyager 1 arrived at Saturn in November 1980, getting as close as 124,000 kilometers (77,000 miles) to Saturn's cloud-tops on November 12, 1980. It took pictures of Saturn's rings and studied the atmospheres of Saturn and its moon Titan. Voyager 1 found that about seven percent of Saturn's upper atmosphere is helium, while almost all the rest is hydrogen. This is less helium than Jupiter's atmosphere, which has 11 percent helium. The lower amount of helium in Saturn's upper atmosphere might mean that helium is sinking through Saturn's hydrogen, which could explain why Saturn gives off more heat than it gets from the Sun. The spacecraft also measured strong winds on Saturn, about 500 meters per second (1,100 mph) near the equator, blowing mostly east. The Voyagers saw auroras on Saturn, which are ultraviolet emissions of hydrogen. These were found at mid-latitudes and polar latitudes (above 65 degrees). The high-level auroras might help form complex hydrocarbon molecules that move toward the equator. The mid-latitude auroras, which only happen in sunlight, are puzzling because auroras on Earth are usually caused by particles hitting the atmosphere at high latitudes. Both Voyagers measured Saturn's day to be 10 hours, 39 minutes, and 24 seconds long. Voyager 1 also flew by Titan, Saturn's largest moon, which has a thick atmosphere. Pictures from Pioneer 11 in 1979 showed Titan's atmosphere is complex, increasing interest. Voyager 1 came within 6,400 kilometers (4,000 miles) of Titan, passing behind it from Earth and the Sun. It measured the atmosphere's effect on sunlight and its radio signal to learn about Titan's composition, density, and pressure. Titan's mass was measured by its effect on Voyager 1's path. The thick haze around Titan made it impossible to see the surface, but measurements suggested there could be lakes of liquid hydrocarbons. Because observing Titan was very important, Voyager 1's path was planned for the best flyby of Titan. This took it below Saturn's south pole and out of the plane of the ecliptic, ending its planetary science mission. If Voyager 1 had not been able to study Titan, Voyager 2's path would have been changed to fly by Titan, but this would have meant missing Uranus and Neptune. Voyager 1's path could not continue to Uranus and Neptune, but could have been changed to go to Pluto, arriving in 1986. File:Crescent Saturn as seen from Voyager 1.jpg|alt=View of Saturn lit from the right. Saturn's globe casts its shadow over the rings to the left. Part of the lower hemisphere can be seen through the rings. Some of the spoke-like ring features are visible as bright patches.|Crescent Saturn from 5.3 million km, four days after closest approach File:Voyager1-saturn-f-ring.jpg|alt=Voyager 1 image of Saturn's F Ring|Voyager 1 image of Saturn's narrow, twisted F Ring. File:Voyager 1 - view of Saturn's moon Mimas.jpg|alt=Mimas at a range of 425,000 km from Voyager 1|Mimas at a range of 425,000 km; the crater Herschel is at upper right File:Tethys - PIA01974.jpg|alt=Tethys photographed by Voyager 1 from 1.2 million km|Tethys, with its giant rift valley Ithaca Chasma, from 1.2 million km. File:Dione from Voyager 1.jpg|alt=Fractured terrain on Dione imaged from a distance of 240,000 km from Voyager 1|Fractured terrain on Dione's trailing side, from 240,000 km. File:Rhea - PIA02270.jpg|alt=Impact craters on the surface of Rhea appear similar to Earth's Moon|The icy surface of Rhea is full of impact craters. File:Titan's thick haze layer-picture from voyager1.jpg|alt=Cream-colored section of a disk is separated from the black space above by a fuzzy blue curve|Titan's thick haze layer in this Voyager 1 image. File:Titan Haze.jpg|alt=orange colored area at bottom right is separated from black space at upper left by diagonal series of blue bands|Layers of haze on Saturn's moon Titan. === Exit from the heliosphere === On February 14, 1990, Voyager 1 took the first \"family portrait\" of the Solar System, showing all the planets from far away. One famous picture is called the Pale Blue Dot, showing Earth. Soon after, its cameras were turned off to save energy and computer resources. The software to use the cameras was removed, so turning them on again would be hard. Also, the software and computers on Earth to read the pictures are no longer available. On February 17, 1998, Voyager 1 became the farthest spacecraft from Earth, passing Pioneer 10 at a distance of 69 AU (6.4 billion miles or 10.3 billion kilometers) from the Sun. It travels at about 17 kilometers per second (11 miles per second). As Voyager 1 moved toward interstellar space, it kept studying the Solar System. Scientists used its instruments to look for the heliopause, the edge where the solar wind meets space outside the Solar System. In 2013, Voyager 1 was moving away from the Sun at about 61,197 kilometers per hour (38,026 miles per hour). It travels about 523 million kilometers (325 million miles) each year, or about one light-year every 18,000 years. ==== Termination shock ==== Scientists from Johns Hopkins University Applied Physics Laboratory believed that Voyager 1 reached the termination shock in February 2003. This is where the solar wind slows down to subsonic speeds. Some other scientists were unsure about this and discussed it in a journal called Nature on November 6, 2003. The issue couldn't be resolved until more data became available because Voyager 1's solar-wind detector stopped working in 1990. This meant that detection of the termination shock had to be figured out using data from other instruments on the spacecraft. In May 2005, NASA announced that most scientists agreed Voyager 1 was then in the heliosheath. At a scientific meeting in New Orleans on May 25, 2005, Ed Stone presented evidence suggesting that the spacecraft crossed the termination shock in late 2004. This event was estimated to have happened on December 15, 2004, when Voyager 1 was about 94 AU (8,700 million miles) away from the Sun. ==== Heliosheath ==== On March 31, 2006, amateur radio operators from AMSAT in Germany used a 20-meter dish at Bochum to track and receive radio waves from Voyager 1. They used a technique that integrated data over a long period. The data they received was checked against data from the Deep Space Network station in Madrid, Spain. This was the first time amateurs had tracked Voyager 1. On December 13, 2010, it was confirmed that Voyager 1 had moved past the radial outward flow of the solar wind. This was measured by its Low Energy Charged Particle device. Scientists think that at this distance, the solar wind turns sideways because of pressure from interstellar wind pushing against the heliosphere. Since June 2010, no solar wind has been found, which strongly supports this idea. At that time, Voyager 1 was about 116 AU (17.4 billion kilometers or 10.8 billion miles) away from the Sun. In March 2011, Voyager 1 was turned to measure the sideways movement of the solar wind where it was in space, around 33 years and 6 months after it was launched. A test maneuver in February showed that the spacecraft could move and change its position. Voyager 1 turned 70 degrees counterclockwise compared to Earth to study the solar wind. This was the first big move since Voyager 1 took the Family Portrait picture of the planets in 1990. After this move, Voyager 1 could point itself correctly again with Alpha Centauri, its guide star, and it started to send data back to Earth again. Voyager 1 was expected to enter interstellar space soon. Voyager 2 was still finding solar wind moving away from the Sun at that time, but it was expected to see the same things as Voyager 1 in the next months or years. On May 21, 2011, Voyager 1 was at 12.44° declination and 17.163 hours right ascension. Its ecliptic latitude was 34.9°. From Earth, Voyager 1 was seen in the constellation Ophiuchus. On December 1, 2011, Voyager 1 found the first Lyman-alpha radiation from the Milky Way galaxy. Before this, this radiation had only been found in other galaxies, because the Sun's light made it hard to see in our own galaxy. NASA said on December 5, 2011, that Voyager 1 had reached a new place called \"cosmic purgatory\". In this area, particles from the Sun slow down and change direction. The Sun's magnetic field also gets stronger because of pressure from the space between the stars. The number of strong particles from the Sun went down by almost half. At the same time, the number of high- energy electrons from outside went up a hundred times. The inner edge of this area is about 113 AU from the Sun. ==== Heliopause ==== In June 2012, NASA said that Voyager 1 was nearing the heliopause. This is where the solar wind from the Sun meets the particles from space. Voyager 1 was detecting more charged particles from space, which usually get pushed away by the Sun's wind. This meant Voyager 1 was reaching the edge of the Solar System. In August 2012, Voyager 1 crossed the heliopause. It was about 121 AU (1.12×10^10 miles or 1.81×10^10 kilometers) from the Sun. This was confirmed a year later. By September 2012, sunlight took almost 17 hours to reach Voyager 1, and the Sun still looked very bright from the spacecraft. Voyager 1 was traveling at 17.043 km/s (10.590 mi/s) relative to the Sun. At this speed, it would take about 17,565 years to travel one light-year. To reach Proxima Centauri, the closest star to the Sun, Voyager 1 would need 73,775 years. Voyager 1 is heading toward the constellation Ophiuchus. In late 2012, data suggested Voyager 1 had passed through the heliopause. High-energy particle collisions increased usually since May. These are thought to be cosmic rays from supernova explosions beyond the Solar System. In late August, collisions with low-energy particles from the Sun decreased. Ed Roelof, a scientist at Johns Hopkins University, said these findings met the criteria for crossing into interstellar space, even though the magnetic field's direction did not change as much as expected. On December 3, 2012, Voyager project scientist Ed Stone from the California Institute of Technology said that Voyager had found a new region inside the heliosphere. The magnetic field in this region was connected to the outside, allowing particles to move in and out. This region's magnetic field was ten times stronger than what Voyager 1 had seen before. This was the last barrier before fully entering interstellar space. === Interstellar medium === In March 2013, it was announced that Voyager 1 might have entered interstellar space, having detected a big change in the plasma environment on August 25, 2012. However, it was still uncertain whether this new region was interstellar space or another unknown part of the Solar System until September 12, 2013, when it was officially confirmed that Voyager 1 had entered interstellar space. In 2013, Voyager 1 was leaving the Solar System at a speed of about 3.6 AU (330 million miles or 540 million kilometers) per year. Voyager 2 was moving slower, at 3.3 AU (310 million miles or 490 million kilometers) per year. Each year, Voyager 1 gets farther ahead of Voyager 2. Voyager 1 reached a distance of 135 AU (12.5 billion miles or 20.2 billion kilometers) from the Sun on May 18, 2016. By September 5, 2017, it was about 139.64 AU (12.980 billion miles or 20.890 billion kilometers) from the Sun, which is just over 19 light-hours away. At the same time, Voyager 2 was 115.32 AU (10.720 billion miles or 17.252 billion kilometers) from the Sun. You can track its progress on NASA’s website. File:Cosmic Rays at Voyager 1.png|Plot showing a big increase in the rate of cosmic ray particles detected by Voyager 1 (October 2011 to October 2012) File:Solar wind at Voyager 1.png|Plot showing a big drop in the rate of solar wind particles detected by Voyager 1 (October 2011 to October 2012) On September 12, 2013, NASA officially confirmed that Voyager 1 had reached the interstellar medium in August 2012. The accepted date of this event is August 25, 2012, about 10 days before the 35th anniversary of its launch. This was when changes in the density of energetic particles were first noticed. By this time, most scientists no longer thought that a change in the magnetic field direction must happen when crossing the heliopause. A new model of the heliopause predicted no such change would be found. A key finding that convinced many scientists was an 80-fold increase in electron density, based on the frequency of plasma oscillations observed starting on April 9, 2013. This was triggered by a solar outburst in March 2012. Electron density is expected to be much higher outside the heliopause than within. Weaker sets of oscillations measured in October and November 2012 gave more data. This was needed because Voyager 1's plasma spectrometer stopped working in 1980. In September 2013, NASA released recordings of these plasma waves, the first measured in interstellar space. While Voyager 1 is often said to have left the Solar System when it left the heliosphere, the two are not the same. The Solar System is usually the much larger area of space with bodies that orbit the Sun. Voyager 1 is less than one-seventh of the way to the aphelion of 90377 Sedna and has not yet entered the Oort cloud, the source of long-period comets, which is seen as the outermost part of the Solar System. In October 2020, astronomers reported a big unexpected increase in density in space beyond the Solar System, detected by the Voyager 1 and Voyager 2 probes. This suggests that the \"density gradient is a large-scale feature of the very local interstellar medium.\" In May 2021, NASA reported the first continuous measurement of the density of material in interstellar space and the detection of interstellar sounds for the first time. === Communication problems === In May 2022, NASA reported that Voyager 1 was sending \"mysterious\" and \"peculiar\" telemetric data to the Deep Space Network (DSN). They confirmed that the spacecraft was still working, but the issue was with the Attitude Articulation and Control System (AACS). NASA's Jet Propulsion Laboratory said on May 18, 2022, that the AACS was working but sending wrong data. The problem was found to be the AACS sending its telemetry through a computer that had not been used for years, causing the data to be corrupted. In August 2022, NASA sent a command to the AACS to use another computer, which fixed the problem. They are still investigating what caused the initial switch, but engineers think it might have been a bad command from another onboard computer. On November 14, 2023, Voyager 1 began sending unreadable data. On December 12, 2023, NASA announced that Voyager 1's flight data system could not use its telemetry modulation unit, preventing it from sending scientific data. On March 24, 2024, NASA said they had made progress in understanding the data from the spacecraft. In April 2024, engineers reported that the failure was likely in a memory bank of the Flight Data Subsystem (FDS), possibly due to a high-energy particle strike or age. The FDS was not communicating properly with the telemetry modulation unit (TMU), which started sending a repeating sequence of ones and zeros, showing a stuck condition. After rebooting the FDS, communications were still not understandable. The probe could still receive commands from Earth and sent a carrier tone showing it was operational. Commands to change the modulation of the tone worked, confirming that the probe was still responsive. The Voyager team started developing a workaround, and on April 20, communication of health and status was restored by rearranging code away from the unresponsive FDS memory chip. Three percent of the memory was beyond repair, so engineers deleted unused code, such as the code for sending data from Jupiter, to make space for the necessary changes. All data from the \"anomaly period\" was lost. On May 22, NASA announced that Voyager 1 had resumed returning science data from two of its four instruments, with work continuing on the others. On June 13, NASA confirmed that the probe was returning data from all four instruments. === Future of the probe === ==== Remaining lifespan ==== In December 2017, NASA successfully used all four of Voyager 1's trajectory correction maneuver (TCM) thrusters for the first time since 1980. These thrusters replaced a set of jets that were no longer working well, helping to keep the probe's antenna pointed towards Earth. Using the TCM thrusters allowed Voyager 1 to keep sending data to NASA for another two to three years. Because of decreasing electrical power, the Voyager team had to decide which instruments to keep running and which to turn off. They turned off heaters and other systems one by one to manage power. They arranged keeping the fields and particles instruments running because they provide important data about the heliosphere and interstellar space. Engineers expect that at least one science instrument will continue to operate until around 2025. Year End of specific capabilities due to limited electrical power 1998 Ultraviolet Spectrometer (UVS) stopped working. 2007 Plasma subsystem (PLS) terminated. 2008 Planetary Radio Astronomy Experiment (PRA) turned off. 2016 Scan platform and Ultraviolet Spectrometer (UVS) observations ended. Unknown date Shutdown of science instruments begins. The order is undecided, but Low-Energy Charged Particles, Cosmic Ray Subsystem, Magnetometer, and Plasma Wave Subsystem expected to keep working. Unknown date Data Tape Recorder (DTR) operations end. Limited by ability to capture 1.4 kbit/s data using a 70 m/34 m antenna array. Unknown date Gyroscopic operations stopped. Backup thrusters used to continue gyroscopic functions. 2025–2036 Unable to power any instrument. After 2036, out of range of the Deep Space Network. ==== Concerns with orientation thrusters ==== Some thrusters used to control the spacecraft's direction and keep its antenna pointed at Earth are no longer working because their hydrazine lines are clogged. The spacecraft has no backup for its thruster system. \"Everything onboard is single-string,\" said Suzanne Dodd, Voyager project manager at JPL, in an interview with Ars Technica. NASA decided to change the spacecraft's computer software to slow down the clogging of the hydrazine lines. NASA will first test the new software on Voyager 2, which is closer to Earth, before using it on Voyager 1. ==== Far future ==== File:VoyagerOne Aug 2 2018.png|Simulated view of Voyager 1 relative to the Solar System on August 2, 2018. File:Voyagerprobes Aug 2 2018.png|Simulated view of the Voyager probes relative to the Solar System and heliopause on August 2, 2018. File:NearSunStarsSimple.jpg|In about 50,000 years Voyager 1 will be as distant as several nearby stars If Voyager 1 does not hit anything and is not collected, the New Horizons space probe will never catch up with it, even though New Horizons was launched from Earth at a higher speed. The Voyager spacecraft got speed boosts from flying by several planets, while New Horizons only got one boost from flying by Jupiter in 2007. As of 2018, New Horizons is moving at about 14 km/s (8.7 mi/s), which is 3 km/s (1.9 mi/s) slower than Voyager 1 and is still slowing down. Voyager 1 is expected to reach the Oort cloud in about 300 years and take about 30,000 years to pass through it. Though it is not going towards any specific star, in about 40,000 years, it will come within 1.6 light-years (0.49 parsecs) of the star Gliese 445, which is now in the constellation Camelopardalis and 17.1 light-years from Earth. That star is moving towards the Solar System at about 119 km/s (430,000 km/h; 270,000 mph). NASA says that \"The Voyagers are destined—perhaps forever—to wander the Milky Way.\" In 300,000 years, Voyager 1 will pass within less than 1 light-year of the M3V star TYC 3135–52–1. == Golden record == Both Voyager space probes carry a gold-plated record, designed to show the diversity of life and culture on Earth in case an alien ever finds it. The record, made by a team including Carl Sagan and Timothy Ferris, has photos of Earth and its life, scientific information, greetings from people like the United Nations Secretary-General (Kurt Waldheim) and the President of the United States (Jimmy Carter), and a collection of sounds from Earth, like whales, a baby crying, waves, and music from different cultures and times. The music includes pieces by Wolfgang Amadeus Mozart, Blind Willie Johnson, Chuck Berry, and Valya Balkanska, as well as other classical, indigenous, and folk music from around the world. The record also has greetings in 55 different languages. The project was meant to show the richness of life on Earth and human creativity, and to connect with the cosmos. File:Voyager golden record 77 supermarket.gif|A woman in a store File:Voyager golden record 11 jupiter.gif|Photo of Jupiter with its diameter indicated File:Voyager golden record 82 feeding.gif|Humans licking, eating, and drinking File:Voyager golden record 110 arecibo.gif|A photograph of the Arecibo Observatory with scale indication File:Voyager golden record 111 systemoftheworld.gif|Page 6 from Isaac Newtons Philosophiæ Naturalis Principia Mathematica, Volume III, De mundi systemate (The system of the world) File:Voyager golden record 13 earth.gif|Photograph of Egypt, Red Sea, Sinai Peninsula, and the Nile from Earth orbit, noted with Earth's atmospheric composition == Related pages == * Pioneer 10 * Pioneer 11 * Voyager 2 == References == Category:Voyager program Category:Spacecraft launched in the 1970s",
 "title": "Voyager 1"
}