{
 "id": "46637",
 "text": "In economics and marketing, a service is an economic activity (e.g., labor) offered as a product. Although a service (i.e., the activity) is a non- material good, the result it produces may be a material good depending on the service. For example, a construction service may produce a material good, but a lawn mowing service may not. In most cases, the person or company buying the service does not obtain exclusive ownership of the service, but may take ownership of the material good, if one is produced. ==Key attributes== Services can be described in terms of their main attributes. * Intangibility (cannot be touched) - They cannot be seen, handled, smelled, etc. There is no need for storage. :Because services are difficult to explain in advance, it is necessary to create a concrete image in the customer's mind to sell them. From the customer's point of view, this attribute makes it difficult to understand the value of services before the experience the service. * Perishability (If someone doesn't use it, it is lost.) - If someone cannot sell their services, their time is \"lost\". It is a lost economic opportunity. For example, a doctor that is booked for only two hours a day cannot later work those hours– she has lost her economic opportunity. Other service examples are airplane seats (once the plane departs, those empty seats cannot be sold), and theatre seats (sales end at a certain point). * Lack of transportability (cannot be transported) - Services tend to be consumed at the point of \"production\" (although this does not apply to outsourced business services). * Lack of homogeneity or, Variability (Each time it is different.) - Services are typically modified for each client or each new situation. Mass production of services is very difficult. This can be seen as a problem of quality (it's not always the same). For instance, on Monday a person was driven to his work by a taxi. Next Monday, when he is driven to work by a taxi, it is not the same, even if the taxi and the driver are the same. * Labour intensity (Most of it is work.) - Services usually mean human activity. Therefore, the human factor is often the key success factor in service industries. It is difficult to gain a dominant market share. * Demand fluctuations (It is asked for only when it is actually needed. That can change very quickly.) - It can be difficult to forecast demand (which is also true of many goods). Demand can vary by season, time of day, etc. For example, a restaurant may be busy at dinner time but not in the middle of the afternoon. * Buyer involvement (One cannot produce without contact with the consumer.) - Most service provision requires a high degree of interaction between client and service provider. * Client-Based Relationships (When the customer is happy once he will not change the provider even if there is a cheaper one.) - Is based on creating long-term business relationships. Accountants, attorneys, and financial advisers maintain long-term relationships with their clients for decades. These repeat consumers refer friends and family helping to create a client-based relationship. == Related pages == * Service sector Category:Economics",
 "title": "Service (economics)"
}