{
 "id": "466650",
 "text": "Bird sounds include bird songs, calls and any other noises they make for communication. Birds do a lot of communicating, mostly to other birds of the same species. == Bird song == Bird songs are for other members of the same species. The functions are partnership, mating and territory ownership. According to one expert source, the primary function is as a keep-off signal to other males of the same species.Attenborough's Wonder of Song. BBC tv. Depending on the species, bird songs may differ for different functions. In general, bird songs are only used by Passeriformes, the songbirds. It is one of their typical adaptations. Bird song may have evolved through sexual selection. Experiments suggest the quality of bird song may be a good indicator of fitness. Experiments also suggest that parasites and diseases may directly affect song characteristics such as song rate. This also acts as a reliable indicator of health. The song repertoire also appears to indicate fitness in some species. The ability of male birds to hold and advertise territories using song also demonstrates their fitness. == Heredity == Although the capability is inherited, songbirds learn the detail of their song by copying. They are in trouble if they live in places where there are no older birds to copy.Gill, Victoria 2021. Regent honeyeater: endangered bird 'has forgotten its song'. BBC News . On the other hand, calls are usually inherited. Alarm calls, for example, have a critical survival function. and may well predate songs in evolution by a long way. In general, males sing, and females choose mates. Both sexes use calls. === Song identification === Many bird songs are so specific that they can be used for species identification. The calls of birds have been described using words or nonsense syllables or line diagrams.Saunders, Aretas A. 1951. Guide to bird songs. New York: Doubleday == Calls == Most birds are social animals, and some are always near others of the same species. They use calls which sound quite different to their usual songs. Alarm calls are usually short and loud, and very difficult to locate. They warn others of predators. Mobbing calls gather other birds to scare off intruders. Flocks of birds call to keep themselves together in flight. Quite a few birds can mimic sounds they have heard. Parrots and drongos are famous for their mimicry. Common drongos in the Kalahari Desert use other birds' alarm calls to scare them off food. They get 23% of their food that way.National Geographic: African bird shouts false alarms to deceive and steal. Study shows drongos in the Kalahari are masters of deception. 1 May 2014Tom Flower 2010. Fork-tailed drongos use deceptive mimicked alarm calls to steal food Proc. R. Soc. B Non-vocal sounds are done by some birds. Woodpeckers drum on hollow trees as a territory marker. Snipes make a sound called \"winnowing\" or \"drumming\" with their tail feathers when flying. Storks, which are almost voiceless, clatter their beaks. == Media == The first person to record bird songs was Ludwig Karl Koch (18811974). He made the first known recording in 1937, and later became a BBC broadcaster and sound recordist. == Related pages == *Bird#Lorenz's studies == References == Category:Birds",
 "title": "Bird sound"
}