{
 "id": "466761",
 "text": "Byzantine architecture is the architectural style of the Byzantine Empire. This is a term used by modern historians to mean the Eastern Roman Empire based in Constantinople. The empire lasted for more than a millennium. It left a lasting influence on Medieval architecture in Europe and the Near East. It also influenced the later Renaissance architecture and Ottoman architecture. == As a distinctive style == Early Byzantine architecture evolved from Early Christian architecture.Alfred D. Hamlin, History of Architecture (Bremen: Salzwasser-Verl., 2010), p. 122 The early Christian style typically was a basilica with three or five isles. Usually they had wooden roofs. Vaults and domes were rarely used. Byzantine architecture rarely used three isle or five isle basilicas. In this style domes were frequently used. The Semi-dome was also used, especially over an apse.The Grove Encyclopedia of Medieval Art and Architecture, Volume 2, ed. Colum Hourihane (New York: Oxford University Press, 2012). p. 303 It reached its highest form with the use of the pendentive. These are usually used to support a dome. The Byzantine pendentive is a geometric form using four triangular legs sitting on a square base.Russell Sturgis; Francis A. Davis, Sturgis Illustrated Dictionary of Architecture and Building, Vol. III O - Z (Mineola, NY: Dover, 1989), pp. 88–89 It developed during the 6th century reign of the Byzantine Emperor Justinian I.Richard Krautheimer; Slobodan Curcic. Early Christian and Byzantine Architecture (New Haven, CT: Yale University Press, 1986), p. 238 This is when Byzantine architecture became a distinctive style. Windowed domes were also a distinctive feature of this style.David Watkin, A History of Western Architecture (London: Laurence King, 2005), p. 103 The intent was to make the dome look like a crown with jewels of light. == Legacy == In the West, Byzantine architecture was replaced by Romanesque and Gothic architecture. In Asia it had an influence on early Islamic architecture. Later Ottoman architecture was also influenced by the Byzantine style. == References == == Other websites == * Byzantine Architecture: History, Characteristics & Examples * Byzantine / Byzantine Revival Architecture Category:Architectural styles Category:Byzantine Empire",
 "title": "Byzantine architecture"
}