{
 "id": "466803",
 "text": "Brian Roy \"Spinner\" Spencer (September 3, 1949 – June 3, 1988) was a Canadian professional ice hockey left winger. He played a career total of 10 seasons in the National Hockey League (NHL). He played for the Toronto Maple Leafs, New York Islanders, Buffalo Sabres and Pittsburgh Penguins. ==Career== Spencer was drafted 55th overall by the Toronto Maple Leafs in the 1969 NHL Amateur Draft. On December 12, 1970, He was called up to play for the Leafs in what would be his first NHL game on television. Spencer phoned his father Roy in British Columbia to tell him to watch the game that night on Hockey Night in Canada. There was an interview with Spencer between periods of the game. However, in British Columbia, instead of the Toronto Maple Leafs/Chicago Black Hawks game being shown, CBC Television aired a game featuring the Vancouver Canucks versus the California Golden Seals instead. Roy was infuriated by this and drove 135 kilometres (84 mi) to Prince George, where the closest CBC Television station, CKPG-TV, is located. When he arrived there, he ordered station staff, at gunpoint, to broadcast the Maple Leafs/Black Hawks game instead. The station did put the game on, but as Roy left the station, he was confronted by the RCMP. After he had a short stand-off with the RCMP, Roy Spencer was shot and killed. He played 95 regular season games with the Maple Leafs and also spent time with their developmental team, the Tulsa Oilers. On June 6, 1972, during the 1972 NHL Expansion Draft, Spencer was claimed by the New York Islanders from the Maple Leafs. He would play 2 seasons with the Islanders before he was traded to the Buffalo Sabres in exchange for Doug Rombough on March 10, 1974. During his time with the Sabres, he had his best offensive production. He was able to record 12 goals and 29 assists in the 1974–75 season. He was a fan favourite in Buffalo, fans loved his hustle, aggressive play, and hitting ability. On September 20, 1977, the Sabres traded Spencer to the Pittsburgh Penguins in exchange for Ron Schock. During his time with the Penguins, his offensive play declined drastically. His last seasons in the NHL came in 1978-79. He was sent down to the AHL to play for the Binghamton Dusters, Springfield Indians, and Hershey Bears and then he retired in 1980. ==Death== After Spencer retired from hockey, he struggled with a life of drugs and violence. In 1987, he was charged murder and kidnapping and he faced the death penalty. Former Sabres teammate Rick Martin testified as a character witness at the trial. In March 1988, a not guilty verdict was returned by the jury and Spencer vowed to change his life around. Even though he was acquitted, his life still continued to spiral out of control and on June 3, 1988, Spencer was shot and killed at gunpoint in a robbery following a crack cocaine purchase in Riviera Beach, Florida. Two men were charged in his murder. Larry Willie Johnson was sentenced to 40 years in prison and Leon Daniels was sentenced to 18 years in prison. He was survived by five children from two marriages, and his twin brother, Byron. A book about Spencer's life called Gross Misconduct: The Life of Spinner Spencer, was written by Martin O'Malley. The book was later adapted into a made-for-television movie in Canada called Gross Misconduct by Atom Egoyan. ==Career statistics== Regular season Playoffs Season Team League GP G A Pts PIM GP G A Pts PIM 1966-67 Estevan Bruins SJHL - - - - - - - - - - 1967-68 Regina Pats WCJHL 23 1 2 3 12 - - - - - 1967-68 Calgary Centennials WCJHL 34 13 10 23 27 - - - - - 1968-69 Swift Current Broncos WCJHL 53 19 29 48 120 4 3 1 4 14 1969–70 Toronto Maple Leafs NHL 9 0 0 0 12 - - - - - 1969-70 Tulsa Oilers CHL 66 13 19 32 186 - - - - - 1970-71 Toronto Maple Leafs NHL 50 9 15 24 115 6 0 1 1 17 1970–71 Tulsa Oilers CHL 23 6 8 14 103 - - - - - 1971–72 Toronto Maple Leafs NHL 36 1 5 6 65 - - - - - 1971–72 Tulsa Oilers CHL 20 7 7 14 115 - - - - - 1972–73 New York Islanders NHL 78 14 24 38 90 - - - - - 1973–74 New York Islanders NHL 54 5 16 21 65 - - - - - 1973-74 Buffalo Sabres NHL 13 3 2 5 4 - - - - - 1974-75 Buffalo Sabres NHL 73 12 29 41 77 16 0 4 4 8 1975-76 Buffalo Sabres NHL 77 13 26 39 70 9 1 0 1 4 1976-77 Buffalo Sabres NHL 77 14 15 29 55 6 0 0 0 0 1977–78 Pittsburgh Penguins NHL 79 9 11 20 81 - - - - - 1978–79 Pittsburgh Penguins NHL 7 0 0 0 0 - - - - - 1978–79 Binghamton Dusters AHL 39 5 9 14 58 - - - - - 1979–80 Springfield Indians AHL 9 1 1 2 0 - - - - - 1979–80 Hershey Bears AHL 40 0 4 4 23 - - - - - NHL totals 553 80 143 223 634 37 1 5 6 29 ==References== == Other websites == * Category:1949 births Category:1988 deaths Category:Binghamton Dusters players Category:Buffalo Sabres players Category:Canadian ice hockey left wingers Category:Calgary Centennials players Category:Canadian murder victims Category:Deaths by firearm in Florida Category:Estevan Bruins players Category:Hershey Bears players Category:Ice hockey people from British Columbia Category:Murdered sportspeople Category:Murders by firearm in the United States Category:New York Islanders players Category:People acquitted of murder Category:Pittsburgh Penguins players Category:Regina Pats players Category:Springfield Indians players Category:Swift Current Broncos players Category:Toronto Maple Leafs players Category:Unsolved murders in the United States",
 "title": "Brian Spencer"
}