{
 "id": "466801",
 "text": "The first season of the animated comedy show Family Guy aired on Fox from April 4 to May 16, 1999. The first season of Family Guy has seven episodes. The show is about the dysfunctional Griffin family. The family consist of father Peter, mother Lois, daughter Meg, son Chris, baby Stewie, and their anthropomorphic (having human abilities) dog Brian. They all live in their hometown of Quahog, Rhode Island. The show features the voices of the show's creator Seth MacFarlane. Other voice actors include Alex Borstein, Seth Green, and Lacey Chabert. The executive producers for the first season were David Zuckerman and MacFarlane. The first episode with \"Death Has a Shadow\" and the ended with \"Brian: Portrait of a Dog\", received more positive feedback than the rest of the episodes of season one. Some critics did not like the theme of those episodes. The Volume One DVD box set, included all seven episodes and the second season. It was released in Region 1 on April 15, 2003, Region 2 on November 12, 2001, and Region 4 on October 20, 2003. The show has since been released in other television shows. MacFarlane first thought of the idea for Family Guy in 1995. He was studying animation at the Rhode Island School of Design (RISD). There, he created his thesis movie The Life of Larry. His professor at RISD submitted the movie to Hanna-Barbera. This gave MacFarlane being hired by the company. Executives at Fox saw the movie. They contracted MacFarlane to create a show based on the characters. They called it Family Guy. While working on the show, Larry and his dog Steve, became Peter and Brian. The rest of the show's characters were added later. ==Episodes== No. in series No. in season Title Directed by Written by Original air date Production code ==References== == Other websites == * Season 1 at TV.com * * Family Guy season one episode guide. IGN. Retrieved July 27, 2010. Category:1999 American television series debuts Category:Family Guy Category:American television seasons Category:1999 television seasons",
 "title": "Family Guy season 1"
}