{
 "id": "467196",
 "text": "\"El Himno de Riego\" (Meaning \"Riego's Anthem\")is the anthem of the second Spanish Republic. It was named for of Colonel Rafael Del Riego. It was composed by José Melchor Gomis. ==Lyrics== Spanish English ::Refrain: ::Soldados, la patria nos llama a la lid; ::Juremos por ella vencer o morir. :Serenos, alegres, valientes, osados, :Cantemos, soldados, el himno a la lid. :Y a nuestros acentos el orbe se admire :Y en nosotros mire los hijos del Cid. ::Refrain :Blandamos el hierro que el tímido esclavo :Del libre, del bravo, la faz no osa ver. :Sus huestes cual humo veréis disipadas, :Y a nuestras espadas fugaces correr. ::Refrain :¿El mundo vio nunca, más noble osadía? :¿Ni vio nunca un día más grande el valor, :Que aquel, inflamados, nos vimos del fuego, :Excitar a Riego de Patria el amor? ::Refrain :Honor al caudillo, honor al primero :Que el cívico acero osó fulminar. :La patria afligida oyó sus acentos :Y vió sus tormentos en gozo tornar. ::Refrain :Su voz fué seguida, su voz fué escuchada, :Tuvimos en nada soldados morir. :Y osados quisimos romper la cadena :Que de afrenta llena del bravo el vivir. ::Refrain :Mas ya la alarma tocan; las armas tan sólo :El crimen, el dolo, podrán abatir. :Que tiemblen, que tiemblen, que tiemble el malvado :Al ver al soldado la lanza esgrimir. ::Refrain :La trompa guerrera sus ecos al viento, :Horror al sediento, ya ruge el cañón. :A Marte sañudo la audacia provoca :Y el ingenio invoca de nuestra nación. ::Refrain :Se muestran: volemos, volemos, soldados. :¿Los veis aterrados, su frente bajar? :Volemos, que el libre por siempre ha sabido :del siervo vendido la audacia humillar. ::Refrain ::Refrain: ::Soldiers, the homeland calls us to the fight; ::Let us swear for her sake to triumph or to die. :Serene and happy, valiant and bold :Let us sing, soldiers, the battle hymn. :The world is astonished at our voices :And in us it beholds the sons of the Cid. ::Refrain :We brandish the iron that the timid slave :Of the free man, of the brave man, the face does not dare to see. :Like smoke, you will see his host dissipated :And run to our fleeting swords. ::Refrain :Has the world ever seen more noble daring? :Nor has any day seen greater valour, :Than that, inflamed, we showed at the fire, :To awaken in Riego the love of his land? ::Refrain :Honour to the leader, honour to the first :That the civic sword dared to strike down. :The afflicted homeland heard their voices :And saw their torments turn into joy. ::Refrain :His voice was followed, his voice was heard, :We had soldiers dying in nothing. :And we bold ones wanted to break the chain :That fills the brave man with disgrace to live. ::Refrain :But the alarm is already sounding; only weapons :Will be able to bring down crime, fraud. :Let them tremble, let them tremble, let the wicked man tremble :At the sight of the soldier wielding the spear. ::Refrain :The war trumpet echoes to the winds, :Affrighting the greedy, the cannon now roars. :The audacity of our nation provokes :And the genius [of our nation] invokes wrathful Mars. ::Refrain :They show themselves: let us fly, let us fly, soldiers. :Do you see them terrified, their head lowering? :Let us fly, such that the free man has always known :Of the sold servant, the audacity bowing. ::Refrain ==References== Category:Historical anthems Category:Spanish anthems",
 "title": "Himno de Riego"
}