{
 "id": "467315",
 "text": "Tagbilaran is the capital and main city of the Bohol province, in the Bohol island, Philippines. Because of the Tagbilaran Airport, the city is an important way for tourists to start trips through the rest of the island and neighboring islands. The inhabitants of this city are known as tagbilaranons. ==History== In 1565, a Spanish explorer named Miguel López de Legazpi came to Bohol looking for spices and gold. He made a peace pact with Datu Sikatuna in a place called Bool, now a district of Tagbilaran. This pact was signed with a blood pact between the two men. On 9 February 1742, the Governor of the Visayas Francisco Antonio Calderon de la Barca separated Tagbilaran from Baclayon and made it a town with the name of San Jose de Tagbilaran and dedicated to St. Joseph the Worker. Since then, it was part of the province of Bohol and became officially a component city (a city that is part of a province) on 1 July 1966 by the Republic Act No. 4660. ==Geography== Tagbilaran is in the southwestern part of the island of Bohol, in front of the smaller island of Panglao; between the two islands is the Tagbilaran Strait. The city is southeast of the national capital of Manila and south of the regional capital, Cebu City. It has a total area of , but the total land area, without the parts that are in the sea, is . The coastline is about long. There is a ridge (a long and narrow chain of small hills) with an average altitude of that runs parallel to the coastline; at both ends of the ridge there are two hills: Elley Hill () in the north and Banat-I Hill () in the south. Tagbilaran borders with the municipalities of Cortes (north), Corella (northeast) and Baclayon (east). To the south is the Tagbilaran Strait and the Panglao island, and to the west is the Maribojoc Bay (part of the Cebu Strait). With a population of 96,792, Tagbilaran has a population density of inhabitants/km2. ===Climate=== Tagbilaran has, like the rest of the Philippines, a tropical climate. The average temperature is high and the humidity is also high. The dry and the wet seasons are very similar. ==Administrative divisions== The city of Tagbilaran is divided into 15 barangays (like neighbourhoods). Barangay Area (km²) Population (2010) Pop. density (per km²) Bool 3.488 5,221 Booy 1.464 8,800 Cabawan 2.673 1,531 Cogon 2.044 17,114 Dampas 4.437 8,440 Dao 3.909 8,227 Manga 1.173 6,460 Mansasa 0.829 6,156 Poblacion 1 0.259 3,072 Poblacion 2 0.702 5,029 Poblacion 3 0.707 6,051 San Isidro 4.294 4,821 Taloto 2.445 6,376 Tiptip 2.821 4,360 Ubujan 1.456 5,134 TOTAL 32.701 96,792 ==Gallery== File:Tagbilaran view.JPG|View of the city of Tagbilaran File:Banat-i Hill.jpg|Banat-i Hill File:Bohol Capitol.jpg|Provincial Capitol of Bohol, Tagbilaran File:Bohol,Cebu and Laguna Vacation 026.jpg|Facade of the Saint Joseph the Worker Cathedral File:Tagbilaranchurch01.jpg|Saint Joseph the Worker Cathedral ==Related pages== * Bohol island * Bohol province ==References== ==Other websites== * City Government of Tagbilaran - official website Category:Cities in the Philippines Category:Provincial capitals of the Philippines Category:Bohol (province)",
 "title": "Tagbilaran"
}