{
 "id": "467677",
 "text": "Allegiance is a duty of of faithfulness or loyalty said to be owed, or freely committed, by the people, subjects or citizens to their state or sovereign. ==Oath of allegiance== The oath of allegiance is an oath of fidelity to the sovereign in the United Kingdom. It must be taken by all persons holding important public office and as a condition of naturalization. By ancient common law, it was required of all persons above the age of 12. It was repeatedly used as a test of loyalty. In England, it was first imposed by statute in the reign of Elizabeth I (1558). The words have, more than once, been altered since. Up to the time of the revolution, the promise was \"to be true and faithful to the king and his heirs, and truth and faith to bear of life and limb and terrene honour, and not to know or hear of any ill or damage intended him without defending him therefrom.\" The Convention Parliament enacted the form that has been in use since that time – \"I do sincerely promise and swear that I will be faithful and bear true allegiance to His Majesty ...\" In the United States and some other republics, the oath is known as the Pledge of Allegiance. Instead of declaring fidelity to a monarch, the pledge is made to the flag, the republic, and to the core values of the country, specifically liberty and justice. The reciting of the pledge in the United States is not compulsory because of the rights guaranteed to the people under the First Amendment to the United States Constitution. The guarantee of freedom of speech includes the freedom not to speak. ==In Islam== The word used in the Arabic language for allegiance is bay'at (Arabic: بيعة), which means \"taking hand\". The practice is sanctioned in the Quran by Surah 48:10: \"Verily, those who give thee their allegiance, they give it but to Allah Himself\". The word is used for the oath of allegiance to an emir. It is also used for the initiation ceremony specific to many Sufi orders. ==References== Category:Law Category:Nationalism",
 "title": "Allegiance"
}