{
 "id": "467641",
 "text": "Lincoln Center for the Performing Arts is a group of building in New York city used for showing performing arts. It is a complex of buildings. The Lincoln Center is located in the Lincoln Square neighborhood of Manhattan in New York City. Henry Timms is the president. The Lincoln Square neighborhood was named for United States President Abraham Lincoln. ==History and facilities== A group of civic leaders led by John D. Rockefeller III built Lincoln Center. It was part of the \"Lincoln Square Renewal Project\" during Robert Moses's program of urban renewal in the 1950s and 1960s.\"Rockefeller Philanthropy: Lincoln Center\" (PDF format; Adobe Reader required). Respected architects were contracted to design the major buildings on the site. Over the next thirty years the area around Lincoln Center became a new cultural hub.Roth, Leland M. (2001). American Architecture: A History. Boulder, Colo.: Westview Press. , . Rockefeller was Lincoln Center's first president in 1956. He became its chairman in 1961. Rockefeller is credited with raising more than half of the $184.5 million in private funds needed to build the complex. The center's three buildings, Avery Fisher Hall (formerly Philharmonic Hall), David H. Koch Theater (formerly the New York State Theater) and the Metropolitan Opera House were opened in 1962, 1964 and 1966, respectively. The center may have been named because it was located in the Lincoln Square neighborhood. It is unclear whether the area was named as a tribute to U.S. President Abraham Lincoln. The name was bestowed on the area in 1906 by the New York City Board of Aldermen. The records give no reason for choosing that name.[Gray, Christopher (October 2, 2005). \"Streetscapes: Readers' Questions; The Story of a Name, the Tale of a Co-op\". The New York Times. Retrieved 28 October 2014. == References == Category:Landmarks in Manhattan Category:Buildings and structures in Manhattan Category:New York City Designated Landmarks",
 "title": "Lincoln Center"
}