{
 "id": "467758",
 "text": "The Armançon is a river in France. It is a right tributary of the Yonne river. It flows mostly through the Bourgogne-Franche-Comté region. Eight communes have the name of the river in their names: Aisy-sur-Armançon, Argenteuil-sur- Armançon, Brienon-sur-Armançon, Chailly-sur-Armançon, Montigny-sur-Armançon, Pacy-sur-Armançon, Perrigny-sur-Armançon, Saint-Martin-sur-Armançon. ==Geography== The Armançon river has a length of and a drainage basin with an area of . Its average yearly discharge (volume of water which passes through a section of the river per unit of time) is 28.90 cubic metres per second at Brienon-sur-Armançon in the Yonne department. ===Course=== The source of the Armançon is in the natural region of Auxois, about to the northwest of the town Meilly-sur-Rouvres, Côte-d'Or department, at an altitude of about . The Armançon flows, in general, to the northwest and passes through the following regions, departments and communes: * Bourgogne-Franche-Comté region ** Côte-d'Or: Meilly-sur-Rouvres, Chailly-sur-Armançon, Bellenot-sous-Pouilly, Éguilly, Gissey-le-Vieil, Beurizot, Saint-Thibault, Normier, Clamerey, Marcigny-sous-Thil, Brianny, Montigny-sur-Armançon, Flée, Pont-et-Massène, Semur-en-Auxois, Millery, Genay, Villaines-les-Prévôtes, Viserny, Athie, Senailly, Saint-Germain-lès-Senailly, Quincy-le-Vicomte, Quincerot, Saint- Rémy, Buffon, Rougemont, ** Yonne: Aisy-sur-Armançon, Perrigny-sur-Armançon, Cry, Nuits, Ravières, Fulvy, Chassignelles, Ancy-le-Franc, Argenteuil-sur- Armançon, Pacy-sur-Armançon, Vireaux, Lézinnes, Ancy-le-Libre, Argentenay, Tanlay, Saint-Martin-sur-Armançon, Tonnerre, Junay, Vézinnes, Dannemoine, Cheney, Tronchoy, Roffey, Bernouil, Flogny-la-Chapelle, Villiers-Vineux, Percey, Jaulges, Butteaux, Germigny, Chéu, Saint-Florentin, Vergigny, Mont- Saint-Sulpice, Brienon-sur-Armançon, Ormoy, Esnon, Cheny, Migennes, Charmoy * Grand Est region ** Aube: Marolles-sous-Lignières Finally, it flows, as a right tributary into the Yonne river at the limits of the communes Migennes and Cheny, in the Yonne department, at of altitude. ==Main tributaries== The main tributaries, with a length greater than 30 km, of the Armançon are (only right tributaries because the left tributaries are very short): * Brenne - 71.7 km; * Armance - 47.7 km; ==Gallery== File:Armançon a Cry DSC 0184.JPG|The Armançon river at Cry. File:Semur armançon.png|The Armançon from the Joly bridge, Semur-en-Auxois File:Pont_Pinard_(Semur-en- Auxois)_15-08-2006.JPG|The Pinard bridge over the Armançon, Semur-en-Auxois. File:L'Armançon, Tonnerre (Yonne, Fr).JPG|The Armançon at Tonnerre ==Related pages== * List of rivers of France == References == ==Other websites== * Banque Hydro - Station H2482010 - L'Armançon à Brienon-sur-Armançon (Synthèse) Category:Rivers of Bourgogne-Franche-Comté Category:Rivers of Grand Est",
 "title": "Armançon"
}