{
 "id": "468018",
 "text": "The following is a list of notable deaths in November 2014. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==November 2014== * November 1 - Gustau Biosca, 86, Spanish footballer (Barcelona) and coach.Murió Biosca, el capitán del Barça ‘de les Cinc Copes’ * November 1 - Vira Silenti, 83, Italian actress (I Vitelloni, The Story of Joseph and his Brethren, Atlas Against the Cyclops), pedestrian accident.IN MORTE DI VIRA SILENTI * November 1 - Olle Häger, 79, Swedish journalist and television producer.\"Han har haft en avgörande betydelse\" * November 1 - Thomas W. Sneddon, Jr., 73, American politician and district attorney, prosecuted against Michael Jackson, cancer.Michael Jackson Prosecutor Tom Sneddon Dies of Cancer at Age 73 * November 1 - Joel Barnett, Baron Barnett, 91, British politician, MP for Heywood and Royton (1964–1983), Chief Secretary to the Treasury (1974–1979).Lord Barnett, creator of formula for UK spending allocations, dies * November 1 - Jean-Pierre Roy, 94, Canadian baseball player (Brooklyn Dodgers).Jean-Pierre Roy s'éteint à 94 ans * November 1 - Wayne Static, 48, American singer and musician (Static-X), drug overdose.Static-X frontman Wayne Static dead at 48 * November 2 - Acker Bilk, 85, British musician (\"Stranger on the Shore\").Jazz legend Acker Bilk dies aged 85 * November 2 - Veljko Kadijević, 88, Yugoslav general (Yugoslav People's Army), Minister of Defence (1988–1992).Umro ratni zločinac Kadijević, bio je vođa napada na Vukovar * November 3 - Sadashiv Amrapurkar, 64, Indian actor (Ardh Satya, Sadak), lung infection. * November 3 - Tinus Linee, 45, South African rugby player, motor neurone disease.Ex-Bok, WP centre Tinus Linee dies * November 3 - Mariam Fakhr Eddine, 81, Egyptian actress, complications from brain surgery.Egyptian Actress Mariam Fakhreddine Dead at 81 * November 3 - Augusto Martelli, 74, Italian composer (Il dio serpente), conductor, arranger and television personality.Muore Augusto Martelli, una vita in musica da Mina alla Tv * November 3 - Nina Timofeeva, 79, Russian ballet dancer.Sad news: Bolshoi star has died * November 3 - Gordon Tullock, 92, American economist.Gordon Tullock (1922-2014) * November 4 - Enrique Olivera, 74, Argentine politician, Chief of Government of Buenos Aires (1999–2000).Ex BA City mayor Olivera dies at 74 * November 4 - Eddie Stuart, 83, South African footballer, long-illness. * November 4 - Richard Schaal, 86, American actor (The Mary Tyler Moore Show, Phyllis, The Russians Are Coming, the Russians Are Coming).Richard Schaal dies at 86; character actor was a Second City pioneer * November 4 - Jeremy Dale, 34, American comic book artist.\"Skyward\" creator Jeremy Dale passes away * November 5 - Lane Evans, 63, American politician, member of the U.S. House for Illinois's 17th District (1983–2007), complications from Parkinson's disease.Former U.S. Rep. Lane Evans dies *November 5 - Manitas de Plata, 93, French flamenco guitarist.France's gypsy guitarist Manitas de Plata dies at 93 *November 5 - Alexei Devotchenko, 49, Russian actor and anti-Kremlin activist.Vladimir Putin critic dies in apartment * November 6 - Rick Rosas, 65, American session musician (Etta James, Joe Walsh, Crosby, Stills, Nash & Young), lung disease.Neil Young Bassist Rick Rosas Dead * November 6 - Victor Kostetskiy, 73, Russian actor.Виктор Костецкий * November 6 - Tommy Macpherson, 94, British Army officer and businessman.Sir Thomas Macpherson - obituary * November 6 - Alok Nembang, 41, Nepalese film director, suicide. * November 7 - Kajetan Kovič, 83, Slovene writer.Umrl je pesnik in pisatelj Kajetan Kovič * November 7 - Lincoln D. Faurer, 86, American air force officer, Director of the National Security Agency (1981–1985). * November 7 - Connie Dion, 96, Canadian ice hockey player (Detroit Red Wings).Le hockeyeur Connie Dion s'éteint * November 7 - Juan Taverna, 66, Argentine footballer.Ex-Argentine footballer Juan Taverna, an idol at Banfield, passes away * November 8 - Phil Crane, 84, American politician, member of the U.S. House from Illinois's 13th (1969–1973), 12th (1973–1993) and 8th (1993–2005) districts, lung cancer.Philip M. Crane, Former Illinois Congressman and Conservative Leader, Dies at 84 * November 8 - Ernie Vandeweghe, 86, American basketball player.Ernie Vandeweghe, Knick and Physician, Dies at 86 * November 8 - Hugo Sánchez Portugal, 30, Mexican sports commentator and footballer, carbon monoxide poisoning.Confirmaron causa de muerte de Hugo Sánchez Portugal * November 8 - Otto Ziege, 88, German cyclist.Magen-Krebs! Otto Ziege ist tot * November 9 - Myles Munroe, 60, Bahamian pastor, founder of Bahamas Faith Ministries International and Myles Munroe International, plane crash.Prominent Evangelical Pastor, Wife Among 9 Dead in Bahamas Jet Crash * November 9 - Joe Walsh, 71, Irish politician, Minister for Agriculture and Food (1992–1994, 1997–2004).Former Minister for Agriculture dies aged 71 * November 9 - M. V. Raghavan, 81, Indian Communist politician, Parkinson's disease.CMP leader M V Raghavan passes away * November 10 - Ken Takakura, 83, Japanese actor (The Yakuza, Black Rain), lymphoma.Renowned Japanese actor Ken Takakura dies at 83 * November 10 - Wayne Goss, 63, Australian politician, Premier of Queensland (1989–1996), brain tumour.Former Queensland premier Wayne Goss dead * November 10 - Al Renfrew, 89, American ice hockey player and coach (Michigan Wolverines).Longtime UM hockey coach Al Renfrew, 89, dies * November 10 - Steve Dodd, 86, Australian actor (Gallipoli, The Matrix, Quigley Down Under).Local film legend Steve Dodd passes away * November 10 - Doc Paskowitz, 93, American surfer, complications from surgery.Jewish surfing legend Dorian ‘Doc’ Paskowitz dies at 93 * November 11 - John Doar, 92, American lawyer and civil rights activist, congestive heart failure.John Doar, ex-Justice Department and civil rights lawyer, dies at 92 * November 11 - Harry Lonsdale, 82, American scientist, entrepreneur, and politician, heart failure.Harry Lonsdale, Bend entrepreneur and Senate candidate, dies at 82 * November 11 - Carol Ann Susi, 62, American actress (The Big Bang Theory, Cats & Dogs, Death Becomes Her), cancer.Carol Ann Susi, Voice Behind Big Bang Theory's Mrs. Wolowitz, Dead at 62 * November 12 - Warren Clarke, 67, British actor (Dalziel and Pascoe, A Clockwork Orange, Red Riding).Actor Warren Clarke dies, aged 67 * November 12 - Rebekah Gibbs, 41, British actress (Casualty), breast cancer.Casualty star Rebekah Gibbs dies, aged 41 * November 12 - Marge Roukema, 85, American politician, member of the U.S. House from New Jersey's 7th and 5th districts (1981–2003), Alzheimer's disease.Marge Roukema, former congresswoman, dies at age 85 * November 13 - Alexander Grothendieck, 86, German-born French mathematician, winner of the Fields Medal (1966).Alexandre Grothendieck, ou la mort d'un génie qui voulait se faire oublier * November 13 - Manoel de Barros, 97, Brazilian poet.Morre o poeta mato-grossense Manoel de Barros, aos 97 anos * November 13 - Alvin Dark, 92, American baseball player (Boston Braves, New York Giants) and manager (San Francisco Giants, Oakland Athletics), Alzheimer's disease.Alvin Dark, Giants captain, shortstop and manager whose career was dogged by racial comments, dead at age 92 * November 13 - Chris Meffert, 71, American politician, member of the Florida House of Representatives (1980-1988), amyotrophic lateral sclerosis.John Christian \"Chris\" Meffert (1943 - 2014) * November 13 - Mike Burney, 70, English saxophonist (Wizzard), cancer. * November 14 - Marius Barnard, 87, South African surgeon.Critical illness pioneer Dr Marius Barnard dies * November 14 - Eugene Dynkin, 90, Soviet-born American mathematician.Евгений Борисович Дынкин * November 14 - Jane Byrne, 81, American politician, Mayor of Chicago (1979–1983), complications from a stroke.Chicago Mayor Jane Byrne dies at 80 * November 14 - Diem Brown, 32, American reality TV show personality, ovarian cancer.Diem Brown Dies at 32 * November 14 - Robert Littell, 78, American politician, member of the New Jersey Senate (1992-2008)Robert Littell, 40-year NJ lawmaker, dies at 78 * November 14 - Morteza Pashaei, 30, Iranian singer, stomach cancer.«مرتضی پاشایی» درگذشت * November 14 - Glen A. Larson, 77, American television writer and producer (Battlestar Galactica, Knight Rider, Magnum, P.I.), esophageal cancer.Glen A. Larson, Creator of TV’s 'Quincy M.E.,' 'Magnum, P.I.' and 'Battlestar Galactica,' Dies at 77 * November 14 - Adib Jatene, 85, Brazilian cardiologist and politician, Minister of Health (1992, 1995–1996), heart attack. * November 15 - Lucien Clergue, 80, French photographer, long-illness. * November 15 - Reg Withers, 90, Australian politician, Senator (1966, 1968–1987), Lord Mayor of Perth (1991–1994).Former Perth lord mayor and Senator Reg Withers dies at 90 * November 16 - Peter Kassig, 26, American humanitarian aid worker and ISIS hostage, beheading.Obama confirms death of Peter Kassig, US aid worker held hostage by Isis (death announced on this date) * November 16 - Kim Ja-ok, 63, South Korean actress, lung cancer.Actress Kim Ja-ok dies of lung cancer * November 16 - Jadwiga Piłsudska, 94, Polish pilot and architect, daughter of Józef Piłsudski.Nie żyje Jadwiga Piłsudska-Jaraczewska. Miała 94 lata * November 16 - Sik Kok Kwong, 95, Hong Kong Buddhist monk, President of the Hong Kong Buddhist Association (1966–2014).覺光法師圓寂終年 95 歲 * November 16 - Carl Sanders, 89, American politician, Governor of Georgia (1963–1967), complications from a fall.Former Georgia Gov. Sanders dies * November 16 - Jovan Ćirilov, 83, Serbian theatrologist and author. * November 17 - Jimmy Ruffin, 78, American soul singer (\"What Becomes of the Brokenhearted\").Motown singer Jimmy Ruffin dies at age 78 * November 17 - Bill Frenzel, 86, American politician, member of the U.S. House from Minnesota's 3rd district (1971–1991), cancer.Bill Frenzel, Ex-Minnesota Congressman, Dies At 86 * November 18 - Pepe Eliaschev, 69, Argentine journalist and writer, pancreatic cancer. * November 18 - Ahmad Lozi, 89, Jordanian politician, Prime Minister (1971–1973), President of the Senate (1984–1997).Ahmad Lozi passes away * November 19 - María José Alvarado, 19, Honduran beauty queen, Señorita Honduras (2014), suspected murder.Honduras beauty queen Maria Jose Alvarado found dead (body discovered on this date) * November 19 - Richard A. Jensen, 80, American theologian.Richard A. Jensen Obituary * November 19 - Ramón Hoyos, 82, Colombian racing cyclist, heart attack.Murió Ramón Hoyos Vallejo, leyenda del ciclismo colombiano * November 19 - Otieno Kajwang, 55, Kenyan politician, Senator for Homa Bay (since 2013), MP for Mbita (1998–2013), cardiac arrest.Homabay Senator Otieno Kajwang' dies * November 19 - Gholam Hossein Mazloumi, 64, Iranian footballer (Esteghlal, national team), stomach cancer.غلامحسین مظلومی درگذشت. * November 19 - Mike Nichols, 83, German-born American director (The Graduate, Angels in America, Spamalot), Academy Award winner (1968), heart attack.Mike Nichols, Graduate director, dies at 83 * November 20 - Charlie Hall, 84, American politician, member of the Florida House of Representatives (1980-1982).Charles A. Hall Obituary * November 20 - Marian Brown, 87, American media personality, natural causes.Marian B. Brown, half of S.F.’s famous twins, dies at 87 * November 20 - Cayetana Fitz-James Stuart, 18th Duchess of Alba, 88, Spanish aristocrat.Spain's richest duchess dies aged 88 * November 21 - John H. Land, 94, American politician, Mayor of Apopka, Florida (1950–1968, 1971–2014), stroke. * November 22 - Claire Barry, 94, American singer (The Barry Sisters).Claire Barry Obituary: View Claire Barry's Obituary by the Miami Herald * November 22 - Marcel Paquet, 67, Belgian philosopher.Marcel Paquet : Nekrologi * November 22 - Fiorenzo Angelini, 98, Italian Roman Catholic prelate, President of the Pontifical Council for the Pastoral Care of Health Care Workers (1985–1996).Addio al cardinale Fiorenzo Angelini * November 23 - Marion Barry, 78, American politician, Mayor of Washington D.C. (1979-1991, 1995-1999), cardiac arrest.Former DC Mayor Marion Barry dead at 78 * November 23 - Lewis Baltz, 69, American visual artist and photographer, long-illness.Icon of New Topography movement Lewis Baltz dies at 69 * November 23 - Pat Quinn, 71, Canadian ice hockey coach and executive (Philadelphia Flyers, Toronto Maple Leafs, Vancouver Canucks), short-illness.Pat Quinn, ‘one of hockey’s most respected individuals,’ has died * November 23 - Dorothy Cheney, 98, American tennis player.Tennis Hall of Fame says 'Dodo' Cheney dies at 98 * November 24 - Jorge Herrera Delgado, 53, Mexican politician, Mayor of Durango, Durango (2004–2007), MP for Durango (since 2012), pancreatic cancer.Fallece el diputado Jorge Herrera Delgado * November 24 - Viktor Tikhonov, 84, Soviet ice hockey coach (national team), long-illness.Viktor Tikhonov, legendary Soviet Union hockey coach, dead at 84 * November 25 - Denham Harman, 98, American biogerontologist and professor emeritus, short-illness.Doctor behind 'free radical' aging theory dies at 98 * November 25 - Petr Hapka, 70, Czech composer.Zemřel hudební skladatel a zpěvák Petr Hapka * November 26 - Sabah, 87, Lebanese singer and actress.Al-Arabiyah, Lebanese legend Sabah dies at age 87 * November 26 - Frankie Fraser, 90, British gangster, complications from surgery.Mad Frankie Fraser dead: Notorious gangster dies in hospital aged 90 following leg surgery * November 26 - Gilles Tremblay, 75, Canadian ice hockey player (Montreal Canadiens).Four-time Stanley Cup winner Gilles Tremblay dies at age 75 * November 26 - Tapan Raychaudhuri, 90, Indian historian, complications from a stroke.Historian Tapan Raychaudhuri passes away * November 26 - Ángel Tulio Zof, 86, Argentine football player and coach (Rosario Central).Murió Don Ángel Tulio Zof, un ídolo histórico de Rosario Central * November 27 - Phillip Hughes, 25, Australian cricketer, head injury.Phillip Hughes passed away * November 27 - P. D. James, 94, English crime novelist (Adam Dalgliesh series).PD James, crime novelist, dies aged 94 * November 27 - Stanisław Mikulski, 85, Polish theatre and movie actor (Stawka większa niż życie).Stanisław Mikulski nie żyje. Miał 85 lat * November 28 - Said Akl, 102, Lebanese poet, writer, playwright and language reformer. * November 28 - Chespirito, 85, Mexican playwright, actor and screenwriter (El Chavo del Ocho, El Chapulín Colorado, Chespirito), heart failure.Iconic Mexican Comedian 'Chespirito' Dies at 85 * November 28 - Lucidio Sentimenti, 94, Italian footballer (Juventus, Lazio).Calcio, è morto Sentimenti IV: fu il primo portiere goleador * November 29 - Dwayne Alons, 68, American politician, member of the Iowa House of Representatives (since 1999), kidney cancer.NW Iowa state Rep. Dwayne Alons dies after cancer battle * November 29 - Mark Strand, 80, Canadian-born American poet and writer, United States Poet Laureate (1990), liposarcoma.Pulitzer-winning poet laureate Mark Strand dies at 80 years old * November 29 - Luc De Vos, 52, Belgian musician (Gorki), voice actor (Flemish version of Cars) and writer, multiple organ failure.Zanger Luc De Vos overleden aan ‘acuut falen van een aantal vitale organen’ * November 30 - Qayyum Chowdhury, 82, Bangladeshi painter.Painter Qayyum Chowdhury dies after collapsing at the Classical Music fest * November 30 - Go Seigen, 100, Chinese-born Japanese Go player, natural causes. * November 30 - Sir Fred Catherwood, 89, British politician and Christian writer, MEP (1979–1994).Sir Frederick Catherwood overleden * November 30 - Martin Litton, 97, American environmentalist and editor.Conservationist Martin Litton who kept dams out of the Grand Canyon has died at 97 * November 30 - Jarbom Gamlin, 64, Indian politician, Chief Minister of Arunachal Pradesh (2011).Former Arunachal CM Jarbom Gamlin passes away ==See more months== *Deaths in January 2014 *Deaths in February 2014 *Deaths in March 2014 *Deaths in April 2014 *Deaths in May 2014 *Deaths in June 2014 *Deaths in July 2014 *Deaths in August 2014 *Deaths in September 2014 *Deaths in October 2014 *Deaths in December 2014 ==References== *11 Category:November 2014 events",
 "title": "Deaths in November 2014"
}