{
 "id": "468004",
 "text": "Nicholas Edward \"Nick\" Cave (22 September 1957) is an Australian musician, songwriter, author, screenwriter, composer and movie actor. Cave was born in Warracknabeal, Victoria and grew up in Wangaratta, Victoria. He is best known as lead singer of the rock band Nick Cave and the Bad Seeds. The Bad Seeds began in 1983 and are known for their interesting and different musical styles. Cave had previously been the lead singer of the gothic band, The Birthday Party. This group was well known for its challenging songs and violent sound. Their music was influenced by free jazz, blues, and punk. In 2006, Cave started a garage rock band Grinderman, and recorded their first album, Grinderman (album) in 2007. Cave's music is very emotional with many different musical influences. His songs are about religion, death, love and violence.Stephen Thomas Erlewine and Steve Huey, Allmusic, [ Nick Cave > Biography]. Retrieved 30 September 2009. In the early 2010s, the NME called him \"the grand lord of gothic lushness\". Cave was added to the ARIA Hall of Fame in 2007. The ARIA Awards chairman Ed St John said, \"Nick Cave has enjoyed—and continues to enjoy—one of the most extraordinary careers in the annals of popular music. He is an Australian artist like Sidney Nolan is an Australian artist—beyond comparison, beyond genre, beyond dispute.\" == Discography == Nick Cave and the Bad Seeds * From Her to Eternity (1984) * The Firstborn Is Dead (1985) * Kicking Against the Pricks (1986) * Your Funeral… My Trial (1986) * Tender Prey (1988) * The Good Son (1990) * Henry’s Dream (1992) * Let Love In (1994) * Murder Ballads (1996) * The Boatman’s Call (1997) * No More Shall We Part (2001) * Nocturama (2003) * Abattoir Blues/The Lyre of Orpheus (2CD) (2004) * Dig, Lazarus, Dig! (2008) * Push the Sky Away (2013) * Skeleton Tree (2016) * Ghosteen (2019) * Wild God (2024) Grinderman * Grinderman (2007) * Grinderman 2 (2010) ==References== Category:1957 births Category:Australian composers Category:Australian novelists Category:Australian rock singers Category:Australian singer-songwriters Category:Living people Category:Musicians from Victoria (Australia)",
 "title": "Nick Cave"
}