{
 "id": "468055",
 "text": "Maspok (after Masovni pokret (Croatian), i.e. Mass movement) or the Croatian spring was a nationalist and secessionist rebel movement in the Socialist Republic of Croatia, Yugoslavia during 1971. The movement's demands were initially around the exclusion of the use of the Serbian language and the exclusive use of the Croatian language in Croatia (even though Serbian and Croatian are considered dialects of the same language), declaration of Croatia as a national state of Croats and Croatia as a successor to the medieval Croatian kingdom. Maspok's ultimate goal was an independent Croatian state. The Maspok movement was supported by a lot of Croatian Communists and the Ustaše emigration in the West. == Movement political demands == There were three basic points the Maspok used to attack the federal government of Yugoslavia: distribution of Croatia's tourism revenue in other parts of Yugoslavia, the amount of money Croatia contributed to the underdeveloped Yugoslav republics, and the question of the official Croatian language in Croatia. Maspok demanded recognition of the Croatian language as the official language in Croatia, and the end of the Serbian language in Croatia. Maspok insisted on cultural differences between Croats and other ethnic groups in Yugoslavia. .Vlastimir Sudar: A Portrait of the Artist as a Political Dissident: The Life and Work of Aleksandar Petrović, Intellect Books, 2013 page 203 Matica hrvatska (a Croatian cultural organization) and Hrvatski tjednik (Croatian Weekly newspaper) published a draft constitution for the new Croatian state.Geert-Hinrich Ahrens:Diplomacy on the Edge: Containment of Ethnic Conflict and the Minorities Working Group of the Conferences on Yugoslavia, Woodrow Wilson Center Press. Mar 6. 2007, page 108 Matica hrvatska published in November 1971 a full list of the Maspok's demands: * Croatia defined as the state of Croatian people only, * Croatian representative in the United Nations, * Croatian national bank and national currency, * Croatian army and Croat conscripts serving only Croatian army, * Croatian language used in the army, Croatian state affairs, education, and media.R. J. Crampton: The Balkans Since the Second World War, Routledge, Jul 15, 2014. pp. 133 Matica hrvatska cancelled work on the Serbo-Croatian dictionary and rejected the Novi Sad Agreement (about the common Serbo-Croatian language). The Novi Sad Agreement based Serbo-Croatian language orthography was replaced by the Croatian language orthography written by S. Babic, B. Finka, and M. Mogus and printed by the Matica hrvatska in the same 1971 year. Zagreb University provided broad public support to the Maspok political demands. The Zagreb University students staged mass demonstrations in Croatia in order to express their support to Maspok.Keith Langston, Anita Peti-Stantić: Language Planning and National Identity in Croatia, Palgrave Macmillan, Sep 10, 2014 == Maspok development and demise == According to some historians, Maspok was an Ustaše insurgency in Yugoslavia mentored, guarded and supported by Savka Dabčević- Kučar, Miko Tripalo and Pero Pirker, the political leadership of the Croatian Communist League. The Croatian Communist League general secretary, Miloš Žanko, publicly denounced the destructive nationalism of Matica hrvatska, Dabčević-Kučar, Tripalo, and Pirker. Žanko, on the Tenth plenum of the Croatian Communists (January 1970) accused Dabčević-Kučar, Tripalo, and Piker claiming that these three worked along with Matica hrvatska against Yugoslav socialism and on the destabilization of Yugoslavia.R. J. Crampton: The Balkans Since the Second World War Routledge, Jul 15, 2014. pp. 132 With Josip Broz's approval and the Bakarić's help, Žanko was expelled from the Croatian Communist League on the same plenum.John R. Lampe: Yugoslavia as History: Twice There Was a Country, Cambridge University Press. Mar 28. 2000, page 308. More strong opposition to Maspok came from the members of the Zagreb Praxis group (Rudi Supek, Milan Kangrga, most notably).Lee M. Roberts:Germany and the imagined East, Cambridge Scholars Press, 2005 page 52 Some minor actions against Serbs in Croatia were demonstrated by defacing or destroying Cyrillic signs and by outbreaks of violence at soccer matches. The Croatian leadership persuaded Broz that they had the situation under control. When Broz visited Croatia in July 1971 the Croatian anthem was played after the Yugoslav one.R.J. Crampton page 133 Josip Broz suppressed Maspok and, at the same time, made a great concession to Croatian nationalism. Broz allowed use of the Croatian language in Croatia and confederalized the Yugoslav Constitution in 1974, giving veto rights to the Yugoslav republics when attempting to change the Constitution. The 1974 Yugoslav Constitution was a source of a great dissatisfaction and concern of the Serbs in Yugoslavia.Momčilo Diklić: Srbi u Hrvatskoj 1945-1991: period potiranja nacionalnog identiteta, Institut za Evropske studije, 2007. page 109-112 The Croatian Communist League leadership, Dabčević-Kučar, Tripalo, and Pirker were forced to resign from their state and Communist League positions and some of the Maspok leaders were arrested and imprisoned.Cvijeto Job: Yugoslavia's Ruin: The Bloody Lessons of Nationalism, a Patriot's Warning Rowman & Littlefield, Jan 1, 2002. pp. 75 Among the arrested Maspok leaders were Franjo Tuđman and Bruno Bušić.Nova Hrvatska 1972. page 74 ==Broz's persecution of Serbian academia and liberals in other Yugoslav republics == During the year of 1972. Broz removed from the politics and state affairs Serbian Communists Marko Nikezić and Latinka Perović, Slovene Stane Kavčič, and Macedonian Krste Crvenkovski. Jasminka Udovicki, James Ridgeway: Burn This House: The Making and Unmaking of Yugoslavia, Duke University Press. Oct 31. 2000, page 73 In order to please Croatian nationalists, Broz persecuted Serbian academics who pointed at the subordinated position of the Serbian people in Yugoslavia. The two leading Serbian intellectuals, Dobrica Ćosić (prominent Serbian writer) and Mihailo Đurić (Belgrade University Law School professor) questioned the justification of the Albanian autonomy in the historic Serbian province of Kosovo. They asked why the Serbs in Croatia did not have any autonomous status, and why Vojvodina had autonomous status despite the fact that most of the inhabitants were Serbs. These two intellectuals were publicly denounced by the Broz's regime and persecuted.Jasna Dragovic-Soso: Saviours of the Nation: Serbia's Intellectual Opposition and the Revival of Nationalism, McGill-Queen's Press - MQUP, Oct 9, 2002 page 44 Professor Đurić warned that at that time Serbia's status in Yugoslavia was highly discriminatory and that Serbia was mercilessly and unjustly accused for advocating centralism and unitarianism. Đurić warned further that it was forbidden to raise questions about responsibility of those who committed the genocide of Serbian people in the Independent State of Croatia during WWII. He said that the borders of the Socialist Republic of Serbia were not the national nor historic borders of the Serbs in Yugoslavia.Hilde Katrine Haug: Creating a Socialist Yugoslavia: Tito, Communist Leadership and the National Question, I.B.Tauris, Mar 30, 2012 The Prof. Đurić trial and verdict were the part of the Broz's regime political equilibrium in the time of the Maspok activity culmination in Croatia and the time of the Maspok's leadership trial and imprisonment.Nick Miller: The Nonconformists: Culture, Politics, and Nationalism in a Serbian Intellectual Circle, 1944-1991, Central European University Press 2007 page 202 ==Croatian Spring and dissolution of Yugoslavia== Croatian Spring played a significant role in the drafting Yugoslav Constitution of 1974. The Constitution paralyzed the federal power of Yugoslavia by shifting the state administrative power to the Yugoslav republics.Branko Belan: In the Name of Independence: The Unmaking of Tito's Yugoslavia, Lulu.com, page 6 The Constitution, being insufficiently unclear and already the result of compromises with various nationalist groups in the republics and provinces, was a blueprint for secession.Dejan Jović: Yugoslavia: A State that Withered Away, Purdue University Press, 2009 page 32 == References == ==Sources== * * ==Other websites== * Croatian Spring and Dissolution of Yugoslavia Category:20th century in Croatia Category:1971 in Europe",
 "title": "Croatian Spring"
}