{
 "id": "468249",
 "text": "Paddington is a 1995 comedy-drama movie based on Michael Bond's Paddington's book series. It is about a young bear from Peru who travels to London to look for a home. Ben Whishaw voices Paddington. Nicole Kidman plays Millicent. Hugh Bonneville and Sally Hawkins plays Mr. and Mrs. Brown. Imelda Staunton plays as the voice of Aunt Lucy. Michael Gambon, Matt Lucas, Peter Capaldi and Geoffrey Palmer are also in the movie. Hugo Weaving voices Rex. Miriam Margolyes voices fly. Danny Danny Mann voices Ferdinand the duck. The movie was released on July 28, 1995 in the United Kingdom, and on August 4, 1995 in the United States. A sequel was released in late 2017. == Plot == in darkest Peru, a young bear couple called aunt Lucy and uncle Pastuzo a young bear cub from going down a waterfall and name him Paddington. Sometime later, they make marmalade on marmalade day. However, during the night of marmalade day, an earthquake strikes, forcing them to seek shelter in the Peru shelter. Uncle doesn’t make it to the shelter in time and is killed by a falling tree, with them finding his happen next morning. Morning him, they decide to go to London, which was their wish. Aunt Lucy goes to stay in the home for retired Bears while Paddington journeys to London alone. When he gets there, he is faced with unwelcoming starts: his food is nearly stolen by pigeons, he is kicked out of a train after he spills some coffee, and he doesn’t get picked up by anyone. While sitting down, he gets the attention of the brown family, which they decide to adopt. They take him to their home where a bordercollie named fly, welcome him warmly, but Rex, their dog, refuses to accept the offer of having Paddington as his nephew. on Paddington’s first night, he accidentally causes the bathroom to overflow while exploring, but the dismay of Rex. Luckily, he makes friends with a duck named Ferdinand, who also resides in the house. Since Christmas is almost nearly, Ferdinand has fear of being turned into Christmas dinner dinner, and he needs to get the alarm clock, since he had tried to crow as a rooster, but they got a lot clock after they could not stand up his quacking. He is Paddington go to get the alarm clock, which they succeeded, but they end up, awakening the Duchess, they’re unruly cat. She chases out of the house, making a mess and corners them, but Rex comes to save them, but it furious that Paddington had chose to disobey the rules. The next day, Rex orders, Paddington to stay at home since he would not trust him to look after the house again. Paddington decides to help the family, which he successfully dropped a burglar named Millicent stealing. The family is proud of Paddington, but Rex is not, and she’s jealousy growth when fly convinces him to like Rex. Christmas soon comes and Paddington for the first time. Enjoy Snow. He manages to save Ferdinand from becoming Duck l’orange by choosing a bully duck that has been bullying Ferdinand during his duckling years. He soon celebrates Christmas with the rest of the family, and managed a hard stare at the girl that was not thankful about her presence she received. paddington assume gross to be loved by the rest of the family, but Rex is not. During a parade for Paddington, he chases him, and attacks fly when he tries to stand up for him. Mishaps soon grow and Rex attacks the family, causing Henry Brown knock him out and take him to a place where he can calm down. Paddington managed to convince the band to keep playing for him while Rex is being sent to wait to calm down, where Rex can’t be seen still fuming. Fly later tell Paddington about Rex’s past while her pot is bandaged: he lost his hearing during the flood, but he couldn’t hear any of the calls, which caused him to go strict and stern over the years. Rexx later comes back, now calm down with discretion. Rex relaxes with the family during our range storm but Duches and inform him that they get rid of bears, fur clothing, and carpets, and later get rid of the bear population. When Rexx seems to agree, Paddington overhears this and runs away. Rex, fly, Ferdinand, and the brown family go to find him. Rex manages to find Paddington at a nearby cemetery where he is weak and sick from being out in the rain. Trying to bring him back home, they are suddenly ambushed by jackals lead by their leader named Dag. They take Paddington into the train car and push it into the Thames tiver, and Rex jumps in and manages to see him through minor difficulties. The brown family manages to find Paddington barely alive and Rex, pushing him to shore. Paddington is put to rest and Rex tearfully apologizes to him for everything that he put him through and being callous. The brown family manages to bring back their approval and affection by doing a jig and song for him, restoring their face. Sometime later, Rex is now a father, lie now has puppies, Paddington is loved by the world, and his aunt Lucy comes to visit. Category:2014 comedy movies Category:British comedy movies Category:Movies based on books",
 "title": "Paddington (movie)"
}