{
 "id": "468426",
 "text": "The Frugal Gourmet is an American half-hour cooking show. The show started around 1973 at Tacoma's public-TV station KTPS-TV. It was first called Cooking Fish Creatively. Later it was renamed The Frugal Gourmet. The award winning program was hosted by Jeff Smith. == History == Jeff Smith was the chaplain at the University of Puget Sound in Tacoma, Washington from 1966 to 1972. In 1965, he taught a cooking class called ”Food as Sacrament and Celebration\". In 1972, he opened and ran a restaurant called the Chaplain’s Pantry. In 1973, a local PBS television station KTPS-TV offered him his own cooking show, called Cooking Fish Creatively.Ben Witherington, The Rest of Life: Rest, Play, Eating, Studying, Sex from a Kingdom Perspective (Grand Rapids, MI: W.B. Eerdmans Publishing Co., 2012), pp. 70-71 \"I had a producer who couldn't produce, a director who couldn't direct, a technician who couldn't tech, and I wasn't so good, either\", according to Smith. The show received two Emmy nominations. The show won a 'Best of the West' Award for Educational Television in 1976. After several seasons it was renamed The Frugal Gourmet. The name change was suggested by his wife, Patty. The Frugal Gourmet ran on PBS from 1983 to 1997. It was PBS's most popular cooking show. Smith always wore a blue and white striped apron that became his \"trademark\". In 1989, during the \"Three Ancient Cuisines\" run, Smith was joined by Craig Wollam, a professionally trained Chef. Smith met Wollam by accident in a Chicago restaurant and he was hired the next day. He stayed until the show was cancelled in 1997. For the first seven seasons, the show was produced by WTTW in Chicago. From 1991, it was produced by KQED in San Francisco, and A La Carte Communications. ==Format== During each show, Smith followed a recipe showing how to prepare a dish. He goes to different places by showing food from many different cultures. The show always ended with Smith saying \"Until I see you again, this is the Frugal Gourmet; I bid you peace, bye-bye\". Smith would remind his audience that frugal doesn't mean cheap. It means that you don't waste money. And gourmet means loving good food and wine. ==Theme song== The theme music for The Frugal Gourmet was the Bourree movement from Water Music by George Frideric Handel. ==Syndication== From 1989 to 1997, reruns of earlier seasons of The Frugal Gourmet aired on Lifetime. When The Frugal Gourmet aired on Lifetime, episodes ran for about 21 minutes to make room for commercials, and several parts were cut. In 1991, GNT in Brazil began airing a Portugal dubbed version of the show entitled Frugal Gourmet. ==References== == Other websites == * The Frugal Gourmet -P2- The Italian Kitchen Category:1983 American television series debuts Category:1997 American television series endings",
 "title": "The Frugal Gourmet"
}