{
 "id": "468536",
 "text": "An argument from ignorance (), or appeal to ignorance ('ignorance' stands for \"lack of evidence to the contrary\"), is a fallacy in informal logic. It says something is true because it has not yet been proved false. Or, that something is false if it has not yet been proved true. This is also called a negative proof fallacy. This also includes the (false) assumption there are only two options (true or false). There may be as many as four choices: # true # false # unknown # unknowable. Appeals to ignorance are often used to suggest the other side needs to do the proving. Rules of logic place the burden of proof on the person making the claim.Meryl Runion 2010. How to restore sanity to our political conversations. WordStream Publishing, p. 158.Douglas Walton 2014. Burden of proof, presumption and argumentation. Cambridge University Press, p. 197. A logical fallacy is simply a bad argument.T. Damer 2013. Attacking faulty reasoning. Boston: Wadsworth, Cengage Learning, 53. Using bad logic does not necessarily mean the argument is false (or true). It is basically a hasty conclusion, one that is arrived at incorrectly.Jerome E. Bickenbach; Jacqueline M. Davies, 1997. Good reasons for better arguments. Peterborough, Ont.: Broadview Press, p. 208. But it still may be convincing to some audiences. This is why it is used in politics and advertising. == Examples == * \"This drug is safe because no-one has found any toxic effects.\"Reasoning: studies of human inference and its foundations. Adler, Jonathan E. & Rips, Lance J. 2008. Cambridge University Press, p. 405 This only implies that complete testing has been done. It does not say it has been tested completely. * \"Candidate Smith has never spoken out concerning her views on abortion. We can safely conclude that she must be pro-choice\".Jacob E. Van Vleet 2011. Informal logical fallacies: a brief guide. Lanham, MD: University Press of America, p. 9. The argument from ignorance fallacy can be used to dismiss a subject or to argue that it means the opposite. *\"Of course disease is caused by witchcraft. How else could it happen?\" (The argument from ignorance often takes the form of \"how else could X happen\" which implies that because there is no other explanation yet known, the one being offered is correct.) == References == == Other websites == * Examples of Ignorance Fallacies * Open Minds and the Argument from Ignorance Category:Logical fallacies",
 "title": "Argument from ignorance"
}