{
 "id": "468675",
 "text": "Pearl Harbor is a 2001 American epic war movie. The movie also has romance and action elements in it. It was directed by Michael Bay and was produced by Michael Bay and Jerry Bruckheimer. Pearl Harbor was released on May 25, 2001. The movie is based on the attack on Pearl Harbor. ==Reviews== The movie gained negative reviews from critics and holds a 25% rating on Rotten Tomatoes. Even though the movie received negative reviews, it was a major box office success and earned almost $450 million worldwide. The movie was nominated for four Academy Awards and won one for Best Sound Editing. Many Pearl Harbor survivors did not like the movie. They called it grossly inaccurate and pure Hollywood. In an interview, producer Jerry Bruckheimer was quoted saying, \"We tried to be accurate, but it's certainly not meant to be a history lesson\". == Cast == * Ben Affleck as First Lieutenant (later Captain) Rafe McCawley * Josh Hartnett as First Lieutenant (later Captain) Daniel \"Danny\" Walker * Kate Beckinsale as Nurse Evelyn Johnson * Cuba Gooding, Jr. as Petty Officer Second Class Dorie Miller * Tom Sizemore as Earl * Jon Voight as President Franklin D. Roosevelt * Colm Feore as Admiral Husband E. Kimmel * Mako as Kaigun Taishō (Admiral) Isoroku Yamamoto * Alec Baldwin as Major (later Lieutenant Colonel) Jimmy Doolittle ===Supporting cast=== * William Lee Scott as First Lieutenant Billy Thompson * Greg Zola as First Lieutenant Anthony Fusco * Ewen Bremner as First Lieutenant Red Winkle * Jaime King as Nurse Betty Bayer (credited as James King) * Catherine Kellner as Nurse Barbara * Jennifer Garner as Nurse Sandra * Michael Shannon as First Lieutenant Gooz Wood * Matt Davis as Joe * Cary- Hiroyuki Tagawa as Kaigun Chūsa (Commander) Minoru Genda * Dan Aykroyd as Captain Thurman * Scott Wilson as General George Marshall * Graham Beckel as Admiral Chester W. Nimitz * Tom Everett as Secretary of the Navy Frank Knox * Tomas Arana as Rear-Admiral Frank J. 'Jack' Fletcher * Peter Firth as Captain Mervyn S. Bennion * Glenn Morshower as Vice Admiral William F. 'Bull' Halsey Jr. * Madison Mason as Admiral Raymond A. Spruance * Sara Rue as Nurse Martha * Reiley McClendon as Young Danny * Jesse James as Young Rafe * Kim Coates as Lieutenant Jack Richards * Michael Shamus Wiles as Captain Marc Andrew \"Pete\" Mitscher * William Fichtner as Mr. Walker * Steve Rankin as Mr. McCawley * Andrew Bryniarski as Joe the Boxer * Leland Orser as Major Jackson * Michael Milhoan as Army Commander * Eric Christian Olsen as gunner to Captain McCawley * David Kaufman as young nervous doctor * Brandon Lozano as Baby Danny ==References== == Other websites == * Category:2001 romantic drama movies Category:2000s war movies Category:American epic movies Category:American romantic drama movies Category:American war movies Category:2000s English- language movies Category:Movies set in Hawaii Category:Japanese-language movies Category:Movies based on real life events Category:Movies composed by Hans Zimmer Category:Movies directed by Michael Bay Category:Movies set in England Category:Movies set in Japan Category:Movies set in New York (state) Category:Movies set in Washington, D.C. Category:Movies set in the 1920s Category:Movies set in the 1940s Category:Movies set in Tennessee Category:World War II movies",
 "title": "Pearl Harbor (movie)"
}