{
 "id": "468808",
 "text": "THX is the trade name of a high-fidelity sound reproduction standard. It was used for movie theaters, screening rooms, home theaters, computer speakers, gaming consoles, and car audio systems. THX stands for \"Tomlinson Holman's eXperiment\". THX was developed by Tomlinson Holman at George Lucas's company Lucasfilm founded in 1983 to ensure that the soundtrack for the third Star Wars movie, Return of the Jedi, would be accurately reproduced in the best venues. The THX system is not a recording technology, and it does not specify a sound recording format. All sound formats, whether digital (Dolby Digital, SDDS) or analog (Dolby SR, Ultra-Stereo), can be \"shown in THX.\" THX is mainly a quality assurance system. THX-certified theaters provide a high-quality, predictable playback environment to ensure that any movie soundtrack mixed in THX will sound as near as possible to the intentions of the mixing engineer. THX also provides certified theaters with a special crossover circuit whose use is part of the standard. Certification of an auditorium entails specific acoustic and other technical requirements; architectural requirements include a floating floor, baffled and acoustically treated walls, no parallel walls (to reduce standing waves), a perforated screen (to allow center channel continuity), and NC30 rating for background noise. == Applications == THX sets strict standards for high quality sound and images. According to Tomlinson Holman, the inventor of the THX system, the name of the technology was deliberately chosen because it contained both a reference to his name, and to Lucas's early movie THX 1138. The original name was \"Tom Holman's Crossover\" (Crossover being sometimes referred to as Xover) or the \"Tom Holman eXperiment.\" THX Ltd., the company that licenses THX and the associated technology, is based in San Rafael, California, but has offices in Burbank and Hollywood. THX launched a certification program for HD video products to ensure HD projectors, LCDs, plasmas and DVRs meet high standards for quality. The TiVo Series3 HD DVR and a number of projectors from Runco and Vidikron became the first THX Certified HD products. The THX II Certified Car Audio System can be found in many Lincoln automobiles produced since 2000. The system was recently recognized among the Best Car Audio Systems of 2000 by the editors of CNET. THX Ltd. started a licensing program for home screening rooms in 2000, which requires standards similar in concept, though not in detail, to its cinema certification program; before this happened, there was a very small number of (very expensive) home theatres which were actually constructed to THX Cinema standards, most notable of actor and comedian Eddie Murphy. The world's largest THX cinema is the Colosseum Kino in Oslo, Norway. The distinctive crescendo used in the THX trailers is known as the \"Deep Note.\" ==Mascot== The THX trailer entitled \"Cimarron\", which first appeared at the start of the 1988 movie Willow, used music composed by James Horner, while \"Grand\", which first appeared in theaters, featured a variation of the \"Deep Note\". The THX Broadway logo on a DVD has a lower-pitched deep note, while the VHS/Laserdisc logo had a higher-pitched deep-note that was similar to \"Wings\" (1930). The first theater THX was used in was at the University of Southern California's Eileen Norris Cinema Theatre as a part of USC's acclaimed film school. The Norris Theatre's THX system is currently second-best in California to that of the Grauman's Chinese Theatre. ==Movie references== Some trailers have references to, or are stylized to match, various movies and video games. Examples include: * Terminator 2: A change of the \"Cavalcade\" trailer shows a floating, electrified ball of energy on the screen, which is quickly replaced with an identity scanning device. The device fires beam that scans left to right, as if scanning the viewer's eyes, after which the \"T2\" logo appears. The logo is then shot by the Terminator (his reflection is slightly visible on the logo) causing it to explode into small, irregular pieces. Sparks fall as the pieces slowly melt into a silvery liquid, which then transforms back into the THX logo, and then plays the \"Deep Note\" sound. * Taz Wanted: A Looney Tunes video game have a lot of the THX Tex trailers as one of the Easter eggs: The THX logo and the \"Deep Note\" sound start as usual, which then breaks down as if due to an electrical failure. A blue light is switched on as Taz spins in from off-camera, opens a door on the X, grabs a ACME jetpack, and flies off screen, pulling out a golden hammer just before he flies off screen. Taz hammers at something on the right side of the screen, drills at something on the left side, audibly complains after dropping one of his tools, flies over to the T, and moves a large switch. The switch causes the logo to re-activate and complete its usual sequence, and then re-plays the \"Deep Note\" sound. === Parodies === * Tenacious D in: The Pick of Destiny: A short animated segment of Jack Black and Kyle Gass performing a sound check which consists of the duo farting precedes the appearance of a change reading \"THC\" with the subtitle, \"The audience is baking.\" The classic THX tone is replaced by two gas-passing sounds in the same tone. * Tiny Toon Adventures: How I Spent My Vacation: A movie begins with a hand holding a wand as if to call an orchestra to order, which then touches off a discordant, ridiculously loud, powerful trailer. The force of the sound is shown blasting characters from their seats. As the trailer comes to a close, text appears on the screen reading: \"THUD Sound Systems, a division of Mucasfilm LTD\". The trailer ends with a voice speaking the words \"The audience is now deaf.\" * The Simpsons: In the episode \"Burns' Heir\", the THX logo and the \"Deep Note\" sound play extremely loudly causing the ground to shake, people's teeth to shatter and one man's head to explode. Despite this, Grandpa Simpson still demands that they turn the volume up. * The Simpsons Movie: The DVD and Blu-ray releases have an unauthorized parody of the THX Tex trailers as an Easter egg, where Homer Simpson becomes annoyed by a \"Tex\" caricature and eventually smashes it. A disclaimer after the trailer explains that neither the trailer nor The Simpsons Movie itself involved THX's input. Because of this, an imitation of the \"Deep Note\" sound is used and the logo used in the parody reads \"TH\\\". * Over the Hedge: During the scene where the animals are in a house, one of the characters was trying to setup a camera with a television, but accidentally tunes the TV to a movie starting with the THX logo and the \"Deep Note\" crescendo. * Boondocks: In the episode \"...Or Die Trying\", Grandpa mimics the THX deep note crescendo when reassuring Jazmin that the theater they are going to is a quality theater. * 2001: In 2000, rapper Dr. Dre was sued by Lucasfilm, then-owner of THX, for using an unauthorized sample of Deep Note on his album 2001. The sample is used at the very beginning of his intro song and is almost entirely unedited and played in full. * Phineas and Ferb: The Movie: The DVD and Blu-ray have an unauthorized parody of the THX Tex trailers as an Easter egg like The Simpsons Movie, where Dr. Heinz Doofenshmirtz becomes annoyed by Tex and eventually smashes it, then Perry the Platypus flies in from off-camera. Because of this, an imitation of the \"Deep Note\" sound is used and the logo used in the original Tex trailer. * The Curse of Monkey Island: At the beginning of the video game, the THX logo that appears is replaced with the letters CMI, and instead of the \"Deep Note\" crescendo, we can hear a \"Monkeys Screaming\" crescendo. At the end, text appears on the screen reading: \"The monkeys are listening\". *Johnny Test: The Movie: The DVD and Blu-ray have an unauthorized parody of the THX Tex trailers as an Easter egg like The Simpsons Movie, where Mr. Wacko becomes annoyed by Tex and eventually smashes it. Because of this, a cyber-tronic version of the \"Deep Note\" sound is used and the logo used in the Tex 2 trailer. ==Other websites== * THX Official Website * Official THX Create a Trailer Contest 2006 * Home Theatre Program launch Category:Movie industry Category:Sound",
 "title": "THX"
}