{
 "id": "468961",
 "text": "Lakehurst is a borough in Ocean County, New Jersey, United States. As of the 2020 United States Census, 2,636 people lived there. Lakehurst was incorporated as a borough on April 7, 1921. It was made from parts of Manchester Township.Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 203. Accessed October 26, 2012. ==Geography== Lakehurst has a total area of . Of that, is land and is water. The town has a lake, Lake Horicon. The lake was created in 1942 by the Works Progress Administration. It was made by building Horicon Dam on two branches of the Toms River. ==History== Lakehurst first became known as a winter resort around the turn of the 20th century. In 1911, the rope factory in the town burned down. After that, a volunteer fire department was created.Chronology of Lakehurst History, Borough of Lakehurst. Accessed October 17, 2013. On May 6, 1937, the German zeppelin Hindenburg was arriving from Frankfurt am Main. It caught fire at the Lakehurst Naval Air Station and burned up. ==Transportation== Lakehurst is at the western end of New Jersey Route 37. New Jersey Route 70 is the main highway through the borough. County Route 547 connects from the north. Lakehurst is on the former Central Railroad of New Jersey Southern Division Main Line. The Barnegat Branch used to go from Lakehurst through Toms River and Beachwood down to Barnegat. ==Notable people== People who were born in, residents of, or otherwise closely associated with Lakehurst include: * Thomas Barlow (1896–1983), one of the first professional basketball players, he was inducted as a member of the Basketball Hall of Fame in 1981.Staff. \"Bird: $15 Million Over 7 Years\" , Los Angeles Times, September 28, 1983. Accessed February 12, 2011. * Rich Croushore (born 1970), former Major League Baseball pitcher who was born in Lakehurst when his father served in the U.S. Navy.Rich Croushore, Baseball-Reference.com. Accessed February 12, 2011.Capozzi, Jose. \"60 Seconds\" , The Palm Beach Post, March 1, 2013. Accessed October 17, 2013. * Abel Kiviat (1892–1991), silver medalist in the men's 1,500 m event at the 1912 Summer Olympics.Litsky, Frank. \"Abel Kiviat, Runner, Dies at 99; Held World 1,500-Meter Record\", The New York Times, August 26, 1991. Accessed December 26, 2012. * Juice Newton (born 1952), Grammy Award-winning American pop music and country singer.Staff. \"SQUEEZE IN A CONCERT, JUICE NEWTON, GARY PUCKETT TO TAKE STAGE AT OLDIES SHOW\", Aberdeen American News, September 4, 2008. Accessed December 26, 2012.\"TAKE FIVE: juice newton\", Las Vegas Sun, January 2, 2007. Accessed January 2, 2008. * Richard Shindell (born 1960), folk singer / songwriter.Condran, Ed. \"Heavy Hitters\" , Asbury Park Press, October 31, 2008. Accessed February 12, 2011. ==References== ==Other websites== * Lakehurst Borough web site * Lakehurst Elementary School * Data for the Lakehurst Elementary School, National Center for Education Statistics * Manchester Township High School Category:1921 establishments in the United States Category:Boroughs in New Jersey Category:Ocean County, New Jersey",
 "title": "Lakehurst, New Jersey"
}