{
 "id": "469171",
 "text": "A Penthouse is typically an apartment on the highest floor of an apartment building. It usually takes up less than half of the entire (flat) roof of the building.Illustrated Dictionary of Historic Architecture, ed. Cyril M. Harris (New York: Dover Publications, 1983), p. 408 Originally the word penthouse meant a small building with a sloped roof.Justin Cord Hayes, The Unexpected Evolution of Language (Avon, MA: Adams Media, 2012), pp. 170–171 The modern use of the word started in the 1920s in America. In the age of skyscrapers the \"house\" on the roof was called a penthouse. A penthouse can also be commercial space. == Types of penthouses == Office buildings have penthouse office suites.Kenneth Allinson; Victoria Thornton, Guide to London's Contemporary Architecture (Burlington : Elsevier Science, 2014), p. 71 Another use for a penthouse is as a restaurant or Café.Paul Hogben; Judith O'Callaghan, Leisure Space: The Transformation of Sydney, 1945-1970 (Sydney: NewSouth Publishing, 2014), p. 106 Their position on a top floor of a building allows for scenic views while dining. The Museum of Modern Art in New York City has a penthouse meeting area.A Life Roundtable on Modern Art', LIFE (October 11, 1948), pp. 57–57 A penthouse can also house a studio, such as a photographic studio. == Building codes == Under some Building codes a penthouse cannot be more than one-third the size of the floor below it. Barry D. Yatt, Cracking the Codes: An Architect's Guide to Building Regulations (New York: J. Wiley, 1998), p. 142 There is no limit to the number of penthouses a building can have. The only limit is the amount of space they can take up (one-third rule). Also, some building codes do not allow mechanical or electrical equipment to count as a penthouse unless they are enclosed by a roof. == Gallery == |Penthouse residence on a building designed by Le Corbusier, in Marseille File:Marina City, Chicago.jpg|Marina City in Chicago. The penthouse houses the physical plant. File:MoMa NY USA 1.jpg|Museum of Modern Art (NYC). The penthouse houses meeting space. File:Hogg Building -- Also Called Hogg Palace.jpg|The penthouse was used for offices of the Hogg family businesses. File:Penthouses 005.JPG|Paris penthouses. File:Luxury penthouse patriarch.jpg|Stalinist luxury: Penthouse at Patriarchy Ponds, Moscow. == References == == Other websites == * What does “penthouse” really mean? * Office penthouses languish on market * penthouse, Oxford Dictionaries Category:Habitats Category:Architectural elements",
 "title": "Penthouse"
}