{
 "id": "469117",
 "text": "This is a list of books about nuclear issues. They are recent non-fiction books which relate to uranium mining, nuclear weapons and/or nuclear power. *Atomic Obsession: Nuclear Alarmism From Hiroshima to Al-Qaeda (2010) *American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer (2005) *Britain, Australia and the Bomb (2006) *Canada’s Deadly Secret: Saskatchewan Uranium and the Global Nuclear System (2007) *Carbon-Free and Nuclear-Free (2007) *Chernobyl: Consequences of the Catastrophe for People and the Environment (2009) *Chernobyl. Vengeance of peaceful atom. (2006) *Conservation Fallout: Nuclear Protest at Diablo Canyon (2006) *Contesting the Future of Nuclear Power (2011) *Fallout: An American Nuclear Tragedy (2004) *Fukushima: Japan's Tsunami and the Inside Story of the Nuclear Meltdowns (2013) *Full Body Burden: Growing Up in the Nuclear Shadow of Rocky Flats (2012) *In Mortal Hands: A Cautionary History of the Nuclear Age (2009) *Malignant: How Cancer Becomes Us (2013) *Maralinga: Australia’s Nuclear Waste Cover-up (2007) *Megawatts and Megatons (2001) *My Australian Story: Atomic Testing (2009) *Nuclear Borderlands: The Manhattan Project in Post-Cold War New Mexico (2006) *Nuclear Implosions: The Rise and Fall of the Washington Public Power Supply System (2008) *Nuclear Nebraska: The Remarkable Story of the Little County That Couldn’t Be Bought (2007) *Nuclear or Not? Does Nuclear Power Have a Place in a Sustainable Energy Future? (2007) *Nuclear Power is not the Answer *Nuclear Terrorism: The Ultimate Preventable Catastrophe (2004) *On Nuclear Terrorism (2007) *Plutopia (2013) *Power to Save the World: The Truth About Nuclear Energy (2007) *Reaction Time: Climate Change and the Nuclear Option (2007) *The Doomsday Machine: The High Price of Nuclear Energy, The World's Most Dangerous Fuel (2012) *The Four Faces of Nuclear Terrorism (2004) *The Last Train From Hiroshima (2010) *The Lean Guide to Nuclear Energy: A Life-Cycle in Trouble (2007) *The Psychology of Nuclear Proliferation (2006) *The Unfinished Twentieth Century (2001) *Three Mile Island: A Nuclear Crisis in Historical Perspective (2004) *TORCH report (2006) *Trinity: A Graphic History of the First Atomic Bomb (2012) *Uranium Wars: The Scientific Rivalry that Created the Nuclear Age. ISBN 978-0-230-61374-4 (2009) *Voices from Chernobyl: The Oral History of a Nuclear Disaster (2005) *What Will Work: Fighting Climate Change with Renewable Energy, Not Nuclear Power (2011) *World Nuclear Industry Status Report ==Related pages== *Bulletin of the Atomic Scientists *List of environmental books ==References== ==Other websites== * ALSOS Digital Library for Nuclear Issues *Bibliography: The Atomic Bomb *Nuclear Reader Category:Books about nuclear issues",
 "title": "List of books about nuclear issues"
}