{
 "id": "46960",
 "text": "The Willis Tower, formerly known as the Sears Tower, is a 108-story, skyscraper in Chicago, Illinois. The tower has 108 stories, though the building's owners count the main roof as 109 and the mechanical penthouse roof as 110. When it finished costruction in 1973, it beat the World Trade Center in New York City to become the tallest building in the world. It was the tallest building in the world for twenty-five years until the Petronas Towers were built in Malaysia. It was also the tallest building in the Western Hemisphere for 41 years, until the new One World Trade Center beat it in 2013. Willis Tower is seen as the best work of architect Fazlur Khan. As of 2021, it is the third-tallest building in the United States and the Western hemisphere. It is also the 23rd-tallest in the world. Each year, more than one million people visit its observation deck, the highest in the United States. It is one of Chicago's most popular tourist places. The tower was renamed in 2009 after the Willis Group bought the tower. The building's largest office partner is United Airlines, which moved its corporate headquarters from 77 West Wacker Drive in 2012. Other major company offices in the tower include Schiff Hardin and Seyfarth Shaw. Morgan Stanley moved into the tower in 2019. It was known as the Sears Tower until 2009, as it was the headquarters of retail company Sears from its opening in 1974. Many people from Chicago still call the tower by its original name. == History == === Planning and construction === In 1969, Sears, Roebuck & Co. was the largest retailer in the world, with about 350,000 employees. Sears wanted to put many of its employees into one building on the western part of Chicago's Loop. The company was given a location by West Chicago Loop not far from Grant Park. Sears eventually bought the West Chicago loop location and bought 15 old buildings from 100 owners and paid $2.7 million to the city. Sears and the city of Chicago approved the design and construction began in April 1971. Sears needed of office space for its planned tower. They hired architects Skidmore, Owings & Merrill (SOM). Sears paid for construction of the building. Architects Bruce Graham and Fazlur Khan designed the building. They designed it as a nine square \"tubes\". It was connected in a 3×3 metal wrap forming a square base with sides. All nine tubes would rise up to the 50th floor of the building, where the northwest and southeast tubes end. The northeast and southwest tubes reach the 66th floor with the north, east, and south tubes end at the 90th. The last west and center tubes reach 108 floors. The Sears Tower was the first building to use this design. It was both cheaper and stronger. At 1,450 feet, it had more space and was higher than the Empire State Building. It cost much less per unit area. The system became successful in skyscraper construction and has been used in most supertall buildings. With the floors left over Sears decided to rent them to other companies for offices. Small metal floors were added to give enough space to people working in the tower. Skidmore architects proposed a tower with large, floors in the lower part of the building. They also added metal floors with many setbacks, which would give the tower its well known look. The tower passed the height of New York's unfinished World Trade Center to become the world's tallest building. The height was limited by the Federal Aviation Administration (FAA) to protect air traffic. Two antennas were added at the top of the building for television and radio broadcasting. The building was completed in May 1973 and opened the next year. Construction cost about US$150 million. Black bands appear on the tower around the 29th–32nd, 64th–65th, 88th–89th, and 104th–108th floors. These give the building's environmental support systems and hide its belted trusses. Even though adding a fire sprinkler system was not forced, the building was built with one from the beginning. There are around 40,000 sprinkler heads in the building. They cost $4 million. In February 1982, two television antennas were added to the building, increasing its total height to . The western antenna was made bigger, bringing the overall height to on June 5, 2000. It was done to improve reception of local NBC station WMAQ-TV. ===Legal action=== As the construction of the building reached as the 50th floor in 1972, people sued Sears and wanted to stop the building from passing 67 floors. The lawsuits said that above the 67th floor would make television signals bad. The Illinois Citizens' Committee for Broadcasting wanted the Federal Communications Commission (FCC) to stop the building from getting taller. On May 26, 1972, the Commission did not take action as they did not have the power to do anything. On June 30, 1972, the Illinois Supreme Court supported their decision. On September 8, 1972, the United States Court of Appeals for the Seventh Circuit supported the FCC decision, ending the lawsuit. ===After opening=== The tower did not have as many companies buying office spaces and it was half-empty for many years. In the 2000s, many companies in the tower began to leave because of terrorist threats or because they found better office spaces. In 1984, Sears decided to improve the appearance of the lower floors for civilians and tourists. Their solution was to create a new entrance, which became known as \"Lunchbox Entrance\". Sears wanted to sell the building in the late 1980s. In July 1990, with no possible buyers, Sears took out a mortgage loan on the tower for $850 million from MetLife and AEW Capital Management. Sears talked about the loan again in 1994. This led to an agreement where Sears would no longer be responsible for the $850 million loan, although it would only own the name of the building. As part of the 1994 agreement, AEW and Metlife would own the building in 2003. In 1990, the law firm of Keck, Mahin & Cate wanted to move away from the tower and into 77 West Wacker Drive. Just two years later, Sears began to move out of the tower to Hoffman Estates, Illinois. However, in 1997, the Canadian company TrizecHahn bought AEW's holdings of the building for $110 million. After the September 11 attacks, two of the largest office partners, Goldman Sachs and Merrill Lynch, quickly announced plans leave the building's 300,000 ft2 space. In 2003, Trizec sold its holdings of the tower to MetLife for $9 million. In 2004, MetLife sold the building to a group of investors from New York City and Skokie, Illinois. The price was $840 million, with $825 million held in a mortgage. In June 2006, seven men were arrested by the FBI and charged with plans to destroy the tower. The case went to court in October 2007. After three trials, five of the suspects were convicted and two acquitted. The leader of the group, Narseal Batiste, was sentenced to 13.5 years in prison. In response to the possible threat of an attack, the building's largest company space at this time, Ernst & Young, moved to North Wacker Drive in early 2009. Since 2007, the owners had thought about building a hotel on the north side of the building. The second building was thought about in the original design. The plan was eventually cancelled as the city did not allow the construction of a tall building in that location. In February 2009, the owners announced they were thinking about painting the building silver, an idea that was later stopped. It was hoped that a new paint-job would \"rebrand\" the building and show its energy efficiency for a cost of $50 million. In 2015, the Blackstone Group bought the tower for a reported $1.3 billion, the highest price ever paid for a U.S. property outside of New York City. In 2017, Blackstone announced a $500 million renovation for the building, such as building a six-story commercial area in the tower's plaza area. In May 2020, after many days of raining, the building's three basement levels were flooded. This caused the power to go out and many television and radio stations going off the air. ===Naming rights=== Sears' naming rights ended in 2003, but the building was still called the Sears Tower for many years. In March 2009, the British insurance company Willis Group Holdings agreed to rent a part of the building and got the naming rights. On July 16, 2009, the building was officially renamed the Willis Tower. On August 13, 2012, United Airlines said they were moving its corporate headquarters from 77 West Wacker Drive to Willis Tower. The naming rights are legally kept for 15 years, making it is possible that the building's name change again soon. Many Chicagoans still call the tower by its old name. A July 2009 CNN article showed some Chicagoans did not want to call the tower by its new name. An October 2010 article from Chicago magazine called the building one of Chicago's 40 most important things. The author of the article did not want call it the \"Willis Tower\". Time magazine called the name change one of the top 10 worst corporate name changes. ===Climbing=== On May 25, 1981, Dan Goodwin climbed the tower while using suction cups and wearing a Spider-Man costume. The Chicago Fire Department tried to stop him, but he made the first successful outside climb of the tower. Goodwin was arrested at the top after the seven-hour climb and was later charged with trespassing. In August 1999, Alain \"Spiderman\" Robert climbed the building all the way to the top using only his hands and feet. Bad weather such as fog made the last 20 stories of the building hard to climb for him. Since 2009, the Willis Tower has hosted SkyRise Chicago, the world's tallest indoor stair climb as a charity event. At the event, people can legally walk up the building's 103-story staircase. ==Details and height== Skidmore architects designed the Willis Tower to have large floors of in the lower part of the building. They got the design idea from an advertisement for a package of cigarettes. From the ground to the top of the taller antenna, Willis Tower is tall. It leans about towards the west because of unequal weight on its foundation. The observation deck elevators are the fastest in the world at per minute. With clear weather, four states can be seen from the observation deck: Michigan, Indiana, Illinois, and Wisconsin. The Willis Tower is the third tallest building in the Americas (after One World Trade Center and Central Park Tower) and the Western Hemisphere. With a height of with its antenna, it is the third-tallest freestanding structure in the Americas and eighth-tallest freestanding structure in the world. On November 8, 2013, architects in Chicago and New York City started talking about the height of the One World Trade Center. They were saying that Willis Tower might be taller. Four days later, it was made official that One World Trade Center is taller than the Willis Tower. At the bottom, the lowest level of Willis Tower is 43 feet below elevation. Many broadcast station transmitters are built at the top of Willis Tower. ==The Skydeck== The Willis Tower observation deck is called the Skydeck. It opened on June 22, 1974. It is on the 103rd floor. It is the highest observation deck in the United States and one of Chicago's most famous tourist attractions. About 1.7 million tourists visit the tower every year. Elevators reach the top of the building in about 60 seconds. People can feel the air pressure change as they go up. The tourist entrance is on the south side of the building on Jackson Boulevard. A second observation deck on the 99th floor was made as a backup and for private events. In January 2009, work to improve the Skydeck began, such as adding glass balconies that go outside of the building. The all-glass boxes are called \"The Ledge.\" Visitors can see the street below. The boxes can hold . It opened to the public on July 2, 2009. On May 29, 2014, the laminated glass flooring of one of the boxes broke while visitors were inside. Nobody was hurt. The flooring on that same box cracked on June 12, 2019. == Awards == The U.S. Environmental Protection Agency (EPA) gave the tower ENERGY STAR certification in 2018 for good energy efficiency. ==Related pages== * List of tallest buildings in Chicago * List of tallest buildings in the world ==References== == Other websites == * Official website * Chicago Skydeck website * Emporis.com - Willis Tower * SkycraperPage.com – Willis Tower * A view from 103rd floor of the tower Category:1973 establishments in Illinois Category:Buildings and structures completed in the 20th century Category:Skyscrapers in Chicago",
 "title": "Willis Tower"
}