{
 "id": "469825",
 "text": "It's A Very Merry Muppet Christmas Movie is a 2002 NBC Christmas television movie. It was directed by Kirk R. Thatcher and was produced by Warren Carr and Martin G. Baker. It's A Very Merry Muppet Christmas Movie was released on November 29, 2002. The movie stars The Muppets, Whoopi Goldberg, David Arquette, Matthew Lillard, Joan Cusack, and the cast of Scrubs. It is a homage to Frank Capra's 1946 movie, It's a Wonderful Life. The movie gained positive reviews from critics and holds a 90% \"Fresh\" rating on Rotten Tomatoes. The movie was nominated at the Primetime Emmy Awards for Outstanding Music and Lyrics for the song \"Everyone Matters\". == Cast == * David Arquette as Daniel * Joan Cusack as Rachel Bitterman * Matthew Lillard as Luc Fromage * Whoopi Goldberg as The Boss * William H. Macy as Glenn * Mel Brooks as Joe Snow (voice) * Chantal Strand as Nancy Nut-What * Dave \"Squatch\" Ward as Sally Ann Santa Claus ===Muppets=== * Steve Whitmire as Kermit the Frog, Rizzo the Rat, Beaker * Dave Goelz as The Great Gonzo, Dr. Bunsen Honeydew, Zoot, Waldorf * Bill Barretta as Pepé the King Prawn, Swedish Chef, Johnny Fiama, Bobo the Bear, Lew Zealand, Howard Tubman, Rowlf the Dog * Eric Jacobson as Miss Piggy, Fozzie Bear, Animal, Yoda Muppet * Kevin Clash as Sam Eagle (voice only) * Brian Henson as Scooter, Janice, Sal Minella * John Henson as Sweetums * John Kennedy as Sam Eagle (puppetry only), Dr. Teeth * Jerry Nelson as Robin the Frog, Pops, Floyd Pepper, Announcer, Statler * Allan Trautman as Joe Snow (puppetry only), Eugene the Tuba Player ===Cameos=== * Zach Braff as Himself/Dr. John \"J.D.\" Dorian * Sarah Chalke as Herself/Dr. Elliot Reid * Carson Daly as Himself * Snoop Dogg as Himself (scene deleted) * Neil Flynn as Himself/Janitor * Bill Lawrence as Himself * John C. McGinley as Himself/Dr. Perry Cox * Judy Reyes as Herself/Nurse Carla Espinosa * Kelly Ripa as Herself * Joe Rogan as Himself * Molly Shannon as Herself * Robert Smigel as Triumph, the Insult Comic Dog ==References== == Other websites == *Official website * Category:2002 movies Category:2000s family movies Category:2002 comedy movies Category:American family movies Category:American comedy movies Category:American television movies Category:Christmas movies Category:English-language movies Category:Sequel movies",
 "title": "It's a Very Merry Muppet Christmas Movie"
}