{
 "id": "470369",
 "text": "Telegram Messenger is a messaging service which lets its users send each other messages, photos, videos and documents (all file types are supported). The client applications are open source and the server is proprietary software (closed source). It is based in Dubai in the United Arab Emirates. == History == Telegram was started in 2013 by the brothers Nikolai and Pavel Durov, the creators of VK. Telegram is registered as a company in the British Virgin IslandsTelegram Messenger Inc – RIPE NCC and as an LLC in Dubai in the United Arab Emirates.Telegram FZ LLC – Dun & Bradstreet Pavel Durov said that the service was headquartered in Berlin, Germany, between 2014 and early 2015, but moved to different jurisdictions after failing to obtain residence permits for everyone on the team. According to press reports, Telegram had employees in Saint Petersburg, Russia, from 2014 to 2017. The Telegram team is based in Dubai as of 2017. In April 2018, Russian court ruled to block Telegram in Russia because of terrorists using the app. Some Russians tried to circumvent the ban by using open proxies in other countries. The Russian Government removed its ban on 18 June 2020. Russian ministers and officials now use it. On 5 October 2021, Telegram gained over 70 million new users as a result of an outage which affected Facebook and its affiliates. It has been called \"social media for organised criminals\", because there is no censorship. Durov says it is a safe haven for citizens living in repressive regimes, such as Belarus, Iran and Hong Kong. “In Dubai the government doesn’t bother us.” It allows Iran-linked militant groups including Hamas, Hizbollah and Iraqi militia groups to use it. A psychological warfare unit of the Israel Defense Forces, had run an unauthorised Telegram Channel entitled “72 Virgins — Uncensored” in 2023. Its rules say that it will block terrorist channels. In 2024 it was said to have 900 million monthly active users. It has more than 80,000 servers around the world. There are only about 50 full-time employees == Features == Telegram lets its users send voice notes, photos, videos and files of all types. Groups can also have a maximum of 200,000 members. There are channels — for one-way broadcasting of messages — with unlimited subscribers. Telegram uses a similar system of message read statuses to WhatsApp, with 1 check = sent, 2 checks = read (opened). == References == ==Other websites== * * Category:Software",
 "title": "Telegram (software)"
}