{
 "id": "470531",
 "text": "Badgers are short-legged mammals found across Europe, Africa, North America and Asia. == Physical description == Badgers have wide bodies, with short legs for digging.James C. Halfpenny, A Field Guide to Mammal Tracking in Western America (Boulder: Johnson Books, 1986), p. 87 They have long weasel-like heads with small ears. Their tails vary in length depending on species. They have black faces with white markings and grey bodies with a light-coloured stripe from head to tail. They have dark legs with light coloured underbellies. They grow to around in length including the tail. The European badger is one of the largest badgers. The American badger, the hog badger and the honey badger are a little smaller and lighter. They weigh around 9.1–11 kg (20–24 lb) on average, with some badgers in Europe and Asia weighing about 18 kg (40 lb) A male badger is called a boar.Michael Leach, Badger (New York: Rosen Publishing Group, Inc., 2009), p. 5 A female is called a sow. A young badger is called a cub. ==Distribution== Badgers are found in North America, Ireland, Britain and most of Europe. The Javan ferret-badger lives in Indonesia. Database entry includes a brief justification of why this species is of data deficient The Bornean ferret-badger lives in Malaysia. The honey badger is found in sub- Saharan Africa, the Arabian Desert, southern Levant, Turkmenistan, and India. == Behavior == Badgers all live underground.L. DeVere Burton, Fish & wildlife: principles of zoology and ecology (New York: Thompson/Delmar, 2010), p. 178 They live in burrows called setts, which may be very large. Some live on their own, moving from home to home. Others are known to form family groups called cetes. Between two and fifteen badgers can live in a cete at one time. Badgers can run or gallop at speeds of up to 25–30 km/h (16–19 mph) for short periods of time. Badgers are only active at night. They can dig a hole fast enough to escape most predators. They fill in the hole behind them as they dig. == Food== The badger’s diet is mainly small mammals; mice, gophers and squirrels. They eat amphibians, reptiles and birds. Badgers also eat earthworms, insects, grubs, and bird eggs. They will sometimes eat roots and fruit. In Britain, they are the main predator of hedgehogs. Badgers have been known to become drunk from the alcohol found in rotting fruit. ==Classification== *Family Mustelidae ** Subfamily Melinae *** Genus Arctonyx **** Hog badger, Arctonyx collaris *** Genus Meles **** Japanese badger, Meles anakuma **** Asian badger, Meles leucurus **** European badger, Meles meles *** Genus Melogale **** Burmese ferret-badger, Melogale personata **** Javan ferret-badger, Melogale orientalis **** Chinese ferret-badger, Melogale moschata **** Bornean ferret-badger, Melogale everetti **** Vietnam ferret-badger, Melogale cucphuongensis ** Subfamily Mellivorinae *** Honey badger or ratel, Mellivora capensis ** Subfamily Taxideinae: *** †Chamitataxus avitus *** †Pliotaxidea nevadensis *** †Pliotaxidea garberi *** American badger, Taxidea taxus ** Subfamily Mustelinae * Family Mephitidae ** Genus Mydaus *** Indonesian or Sunda stink badger (teledu), Mydaus javanensis *** Palawan stink badger, Mydaus marchei == References == Category:Mustelids",
 "title": "Badger"
}