{
 "id": "470986",
 "text": "Survivor Series (2014) was a professional wrestling pay-per-view and livestreaming show made by WWE. It took place on November 23, 2014 at the Scottrade Center in St. Louis, Missouri. It was the 28th Survivor Series event held by WWE. The event was offered for free to new subscribers of the WWE Network. The main event saw Team Cena (John Cena, Dolph Ziggler, Big Show, Erick Rowan and Ryback) defeat Team Authority (Seth Rollins, Kane, Mark Henry, Rusev and Luke Harper) in a traditional 5-on-5 Survivor Series elimination tag team match. A stipulation was added to the match that if Team Authority lost, they would be removed from power. Had Team Cena lost, every member of Team Cena except for Cena would have been fired. The PPV was also notable for the first appearance of former WCW and TNA wrestler Sting in WWE, who was a long hold out on signing with the company. He interfered in the main event and helped Dolph Ziggler win the match as the only survivor for Team Cena. ==Matches== ===Survivor Series elimination matches=== Eliminated Wrestler Eliminated by Team Method Times Cameron Naomi Team Paige Pinfall 6:12 Layla Alicia Fox Team Paige Pinfall 9:29 Summer Rae Emma Team Paige Submission 12:04 Paige Naomi Team Paige Pinfall 14:35 Alicia Fox, Emma, Naomi, and Natalya (Team Natalya) (clean sweep) 14:35 Eliminated Wrestler Eliminated by Team Method Times Mark Henry Big Show Team Authority Pinfall 0:50 Ryback Rusev Team Cena Pinfall 8:10 Rusev N/A Team Authority Countout 21:00 Erick Rowan Luke Harper Team Cena Pinfall 24:14 John Cena Seth Rollins Team Cena Pinfall 25:11 Big Show N/A Team Cena Countout 26:30 Kane Dolph Ziggler Team Authority Pinfall 29:35 Luke Harper Dolph Ziggler Team Authority Pinfall 31:35 Seth Rollins Dolph Ziggler Team Authority Pinfall 43:05 Dolph Ziggler (Team Cena) 43:05 ==References== ==Other websites== *Official Survivor Series 2014 website Category:2014 in professional wrestling Category:Sports in St. Louis, Missouri Category:Survivor Series Category:2010s in St. Louis, Missouri Category:2014 in American television Category:2014 in Missouri Category:November 2014 events",
 "title": "Survivor Series (2014)"
}