{
 "id": "470977",
 "text": "thumb|right|200px| A crate is a type of container often used in shipping. It can be made of wood, but crates made to carry bottles are often plastic. Steel and aluminium crates are also used. == History == The word crate comes from the word: .Diana Twede; Susan E. M. Selke, Cartons, Crates and Corrugated Board: Handbook of Paper and Wood Packaging (Lancaster, PA: DEStech Publications 2005), pp. 3–5 The earliest packaging materials were made of wood and wood fiber. The first crates used to transport anything were hampers or baskets. They were made of twigs, strips of wood, roots, and reeds. Whatever was available that could be woven into a container. Baskets were used to hold and transport food and goods. Later glass and ceramic jugs were protected by baskets. The first documented reference to a shipping crate in the United States is in a 1930 handbook, Technical Bulletin No. 171 written by C. A. Plaskett for the US Department of Agriculture. His writing implies that crates were defined before that time. C. A. Plaskett was known for his extensive testing and defining of various components of transport packaging. == Construction == While both can be used for shipping, a crate is different from a box. A crate has a frame while a box generally does not. Crates are rigid containers built for the purpose of protecting the contents. Crates can be made of wood, plastic, metal or other materials.United States, Department of the Army, Preparation of Freight for Air Shipment ([Washington, DC: Departments of the Army, the Navy, the Air Force and the Defense Supply Agency, 1989), p. 6-1 Crates usually need to be designed to exactly fit what it is they are protecting. Reusing a crate that does not fit the contents can waste space and harm the contents. == References == == Other websites == * Crating Express. Crating Express provides Packaging and Carpentry Services with Certified Wood for Export, in the Miami area, South Florida and anywhere within the USA. Crating Express is Quality Services, On time and at the Best Prices. * Wood Crate, Box and Case Style Diagrams * Building a Basic Crate 2.0 – Boston University Category:Wood Category:Containers",
 "title": "Crate"
}