{
 "id": "471035",
 "text": "Miguel Gila Cuesta (12 March 1919 in Madrid - 13 July 2001 in Barcelona, Catalonia) was a Spanish comedian, cartoonist, writer, and actor. ==Early life== When Gila was 13 years old he left school because his father died. His first job was in a garage in Madrid. Several years later he went back to school to finish his studies. He got a degree in aircraft mechanics.El perfil desconocido de Gila, el republicano que cautivó a Carmen Polo, Periodistadigital.com. He worked in the Elizalde of Barcelona Workshops. Later he was milling in Construcciones SA Aircraft (CASA) in Getafe. ==Spanish Civil War== Gila was a member of Unified Socialist Youth (JSU). When the Spanish Civil War began, he joined the republican troops. He came close to being shot by the rebel volunteers. He was able to survive. According his own words: \"the fascist troops take me among others to be executed (\"Paseo\":Definition for \"Paseo\", SpanishDict 5th meaning, Historical context.: (journey leading to the) summary execution of a political opponent Walking in English), but they were too drunk for shoot us, so they failed\". Therefore he left JSU.Nos fusilaron mal , Unidad Civica por la República. ==Career== Gila made his debut as vignettist in 1945. He become famous as a monologuist in 1951. Most of his repertory was about war histories.Miguel Gila: \"Está el enemigo?, que se ponga\" , Cadena SER. Gila's most known catchphrase was: \"Está el enemigo?, que se ponga [al teléfono]\" (Are the enemy there?, take him at phone). > \"According to his own autobiography, success came in 1951 when he starred in > Madrid as spontaneous theater Fontalba, where he told an impromptu monologue > about his experience as a volunteer in a war. From there his career took > off.\" ==Body of work== ===Works=== * \"El Libro de Quejas de Gila\". Madrid. Ediciones SEDMAY, S.A. 1975 * \"El Libro Rojo de Gila\". Madrid 1974 * \"De Gila con humor\". Madrid. Editorial Fundamentos. 1985 * \"Yo, muy bien: ¿y usted?\". Madrid. Ediciones Temas de Hoy, S.A. 1994. * \"Y entonces nací yo\". Madrid. Ediciones Temas de Hoy, S.A. 1995. * \"Un libro libre\". Promoción Popular Cristiana. 1996. * \"Memorias de un exilio\". Salamanca. Ediciones Universidad Salamanca. 1998. * \"Encuentros en el más allá\". Madrid. Ediciones Temas de Hoy, S.A. 1999. * \"Siempre Gila: Antología de sus mejores monólogos\". Madrid. Aguilar. 2001. * \"Cuentos para dormir mejor\". Barcelona. Editorial Planeta. 2001. * \"Tipologilas\". Barcelona. Círculo de Lectores. 2002. ===Screenplays=== Gila worked on the scripts of \"Cinderfella\" and \"The man traveling slowly\". He took part in the animated film, Tales of love and slaughter in 1975. It was directed by Já (Jordi Amoros). Gila wrote the screenplay with with Chumy Chúmez, Ivà and Jaume Perich. They all worked on the drawings, or animations for the movie. ===Filmography=== *1954: Three piggy banks for East *1954: Adventures of the Barber of Seville *1954: The devil plays the flute *1954: The prison *1954: Thugs' *1954: Angelica *1955: Good Bye, Sevilla *1956: My uncle Jacinto ==Later in life== Gila died in Barcelona from respiratory failure. He had a chronic lung illness.Fallece el humorista Miguel Gila en Barcelona a los 82 años de edad - Sufría una grave enfermedad pulmonar, El Mundo. == References == ==Other websites== * * Reseña sobre Gila, Encyclopedia Britannica * La última llamada de Gila. La Vanguardia, 13 July 2001 * Miguel Gila, maestro de humoristas, Diario ABC, 13 July 2001 * Fallece el humorista Miguel Gila a los 82 años de edad. El País, 13 July 2001 * Category:Spanish actors Category:Spanish comedians Category:1919 births Category:2001 deaths",
 "title": "Miguel Gila"
}