{
 "id": "471212",
 "text": "The title of Duke of Westminster was created by Queen Victoria in 1874. It was given to Hugh Grosvenor, 3rd Marquess of Westminster. The current holder of the title is Hugh Grosvenor, 7th Duke of Westminster. The current Duke, Hugh Grosvenor, the only son of the 6th Duke Gerald Grosvenor, is godfather to Prince George of Cambridge. The Present Duke is entitled to the style of address of His Grace and the family surname is Grosvenor. The Duke of Westminster's seat is at Eaton Hall, Cheshire.George Ashdown Audsley, The Stranger's Handbook to Chester, Eaton Hall and Hawarden Castles and Vicinity (Chester: Catherall, 1891), pp. 157–58 The traditional burial place of the Dukes is St Mary's Church, Eccleston. The title was raised from the rank of Marquess. The family also owned a large townhouse in London called simply \"Grosvenor House\". ==List of Dukes== # Hugh Lupus Grosvenor (1825–1899) Duke from 1874–1899 married Lady Constance Sutherland-Leveson-Gower and later Katherine Cavendish. # Hugh Grosvenor (1879–1953) Duke from 1899–1953 married Constance Cornwallis-West then Violet Nelson and again to Loelia Ponsonby followed by Anne Sullivan. # William Grosvenor (1894–1963) Duke from 1953–1963 died unmarried. # Gerald Grosvenor (1907–1967) Duke from 1963–1967; married Sally Perry. # Robert Grosvenor (1910–1979) Duke from 1967–1979; married Hon Viola Lyttelton. # Gerald Cavendish Grosvenor (1951–2016) Duke since 1979; married Natalia Phillips, a distant relative of the British and Russian royal families. He was, according to the Sunday Times Rich List 2016,The list is the 28th annual survey of the wealthiest people resident in the United Kingdom, published by The Sunday Times. worth £9.35 billion (c. US$13 billion). He was sixth in the list and the third-richest British citizen. He was the richest member of the peerage, with a wealth significantly greater than Queen Elizabeth. # Hugh Grosvenor (b. 1991). == Grosvenor House == The huge family house in Park Lane, London was called Grosvenor House. In its place is now the Grosvenor House Hotel, built on the site. The Grosvenor hotel – the venue for some of London's grandest award ceremonies – was sold to Indian conglomerate Sahara for £470m in December 2010. The head of the conglomerate is Sahara India Pariwar. ==References== Category:British Dukes and Duchesses",
 "title": "Duke of Westminster"
}