{
 "id": "471306",
 "text": "Elimination Chamber (2014) (also known as No Escape (2014) in Germany) was a professional wrestling pay-per-view show made by WWE. It took place on February 23, 2014 at the Target Center in Minneapolis, Minnesota. It was the fifth Elimination Chamber event held by WWE. There were two main events. The first saw The Wyatt Family defeat The Shield and the second saw Randy Orton successfully retain his WWE World Heavyweight Championship in an Elimination Chamber match against Daniel Bryan, John Cena, Cesaro, Christian and Sheamus. ==Matches== No. Results Stipulations Times 1P Cody Rhodes and Goldust defeated RybAxel (Ryback and Curtis Axel) (with Larry Hennig) Tag team match 10:25 2 Big E (c) defeated Jack Swagger (with Zeb Colter) Singles match for the WWE Intercontinental Championship 11:50 3 The New Age Outlaws (Road Dogg and Billy Gunn) (c) defeated The Usos (Jimmy and Jey Uso) Tag team match for the WWE Tag Team Championship 8:34 4 Titus O'Neil defeated Darren Young Singles match 8:17 5 The Wyatt Family (Bray Wyatt, Luke Harper and Erick Rowan) defeated The Shield (Roman Reigns, Seth Rollins and Dean Ambrose) Six-man tag team match 22:42 6 Cameron defeated AJ Lee (c) (with Tamina Snuka) by disqualification Singles match for the WWE Divas Championship 4:30 7 Batista defeated Alberto Del Rio Singles match 7:11 8 Randy Orton (c) defeated Daniel Bryan, John Cena, Cesaro (with Zeb Colter), Christian and Sheamus Elimination Chamber match for the WWE World Heavyweight Championship 37:30 (c) – is the champion(s) going into the match P – This match took place on the pre-show ===Entrances and eliminations=== Eliminated Wrestler Entered Eliminated by Method of elimination Time Sheamus 2 Christian Pinned after a Frog Splash off the top of a pod 26:00 Christian 4 Daniel Bryan Pinned after a Single leg running dropkick 27:12 Cesaro 1 John Cena Submitted to the STF 30:10 John Cena 5 Orton Pinned after a Sister Abigail from Bray Wyatt 32:38 Daniel Bryan 3 Orton Pinned after an RKO 37:33 Randy Orton 6 NONE NONE NONE ==References== ==Other websites== *Official Elimination Chamber 2014 website Category:2014 in American television Category:2014 in professional wrestling Category:Elimination Chamber Category:Sports in Minneapolis Category:2014 in the United States Category:History of Minneapolis Category:21st century in Minnesota",
 "title": "Elimination Chamber (2014)"
}