{
 "id": "471453",
 "text": "The world's 100 most threatened species was chosen by over 8,000 scientists from the IUCN Species Survival Commission (IUCN SSC), and the Zoological Society of London. The report was published by the Zoological Society of London in 2012 as the book, Priceless or Worthless? The species are threatened with extinction, and they have no obvious benefit for humans. This was deliberate, to avoid \"vested interests\".Vested interest: a conflict of interest which might wrongly influence decisions. Iconic and charismatic species,Iconic: having the status of an icon; charismatic: attractiveness or charm that can inspire devotion in others. such as tigers and pandas, and economically important species, have many defenders. These apparently \"worthless\" species had none. The title of the report, \"Priceless or Worthless?\", is based on that shared quality of the species. The report's co- author, Ellen Butcher, stated one of the guiding principles of the list, \"If we take immediate action we can give them a fighting chance for survival. But this requires society to support the moral and ethical position that all species have an inherent right to exist\".Kew Magazine stated that, \"A strong and consistent moral and ethical stance needs to be taken, they (the authors of The List) argue, that all species have a right to exist\". Scientists are finding they have to justify funding for protection by showing what the human benefits would be. Jonathan Baillie, of the Zoological Society of London, said \"The donor community and conservation movement are increasingly leaning towards a 'what can nature do for us?' approach, where species and wild habitats are valued and prioritised according to these services they provided for people. This has made it increasingly difficult for conservationists to protect the most threatened species on the planet\". Some of the threatened species are down to only a handful of surviving members. Santa Catarina’s guinea pig, native to a single island in Brazil, is down to its last 40–60 individuals, reduced by hunting and habitat disturbance. The Great Indian bustard is threatened by habitat loss resulting from agriculture and human development, and is down to the last 50–250 individuals. Elaeocarpus bojeri, a flowering plant found only on the island of Mauritius, has fewer than 10 surviving individuals, because of loss of habitat. The Baishan fir (Abies beshanzuensis), native to China, is down to five surviving mature individuals. Priceless or Worthless? describes the threats that each species is facing, and measures that would help their survival. ==Species list== The world's 100 most threatened species Species Common name Type Image Location(s) Estimated population Threats Abies beshanzuensis Baishan Fir Plant (tree) Baishanzu Mountain, Zhejiang, China Five mature individuals * agriculture * fire Actinote zikani Insect (butterfly) Near São Paulo, Atlantic forest, Brazil Unknown * habitat loss from human expansion Aipysurus foliosquama Leaf scaled sea-snake Reptile Ashmore Reef and Hibernia Reef, Timor Sea Unknown * unknown—probably degradation of coral reef habitat Amanipodagrion gilliesi Amani flatwing Insect (damselfly) Amani-Sigi Forest, Usamabara Mountains, Tanzania < 500 individuals * population pressure and water pollution Antilophia bokermanni Araripe manakin Bird Chapado do Araripe, South Ceará, Brazil 779 individuals * growth of agriculture * recreational facilities * water diversion Antisolabis seychellensis (earwig) Insect Morne Blanc, Mahé island, Seychelles Unknown * invasive species * climate change Aphanius transgrediens Aci Göl toothcarp Fish south-eastern shore of former Lake Aci, Turkey few hundred pairs * competition and predation by Gambusia * road construction Aproteles bulmerae Bulmer’s fruit bat Mammal (bat) Luplupwintern Cave, Western Province, Papua New Guinea approx. 150 * hunting * cave disturbance Ardea insignis White bellied heron Bird Bhutan, North East India and Myanmar 70–400 individuals * hydropower development Ardeotis nigriceps Great Indian bustard Bird Rajasthan, Gujarat, Maharashta, Andhra Pradesh, Karnataka and Madhya, India 50–249 mature individuals * agricultural development Astrochelys yniphora Ploughshare tortoise Angonoka Reptile (tortoise) Baly Bay region, northwestern Madagascar 440–770 * illegal collection for international pet trade Atelopus balios Rio Pescado stubfoot toad Amphibian (toad) Azuay, Cañar and Guyas provinces, south-western Ecuador Unknown * Chytridiomycosis * logging * agricultural expansion Aythya innotata Madagascar pochard Bird volcanic lakes north of Bealanana, Madagascar approx. 80 mature individuals * agriculture * hunting and fishing * introduced fish Azurina eupalama Galapagos damsel fish Fish Unknown Unknown * climate Change * oceanographic changes related to the 1982/1983 El Nino Bahaba taipingensis Giant yellow croaker Fish Chinese coast from Yangtze River, China to Hong Kong Unknown * over-fishing due to value of swim-bladder in traditional medicine Batagur baska Common batagur Four-toed terrapin Reptile (turtle) Bangladesh, Cambodia, India, Indonesia and Malaysia Unknown * illegal export China Bazzania bhutanica (liverwort) Plant Budini and Lafeti Khola, Bhutan two populations * forest clearance * overgrazing * development Beatragus hunteri Hirola (antelope) Mammal South- east Kenya and possibly south-west Somalia < 1,000 individuals * habitat loss * competition with livestock * poaching Bombus franklini Franklin’s bumblebee Insect (bee) Oregon and California Unknown * disease from commercial bumblebees * habitat destruction and degradation Brachyteles hypoxanthus Northern muriqui woolly spider monkey Mammal (primate) Atlantic forest, south-eastern Brazil < 1,000 * large-scale deforestation and logging Bradypus pygmaeus Pygmy three- toed sloth Mammal Isla Escudo de Veraguas, Panama < 500 * illegal logging of mangrove forests for firewood and construction * hunting Callitriche pulchra (water-starwort) Plant (freshwater) pool on Gavdos, Greece Unknown * habitat exploitation by livestock * modification of the pool by locals Calumma tarzan Tarzan’s chameleon Reptile Anosibe An’Ala region, eastern Madagascar < 100 * agriculture Cavia intermedia Santa Catarina’s guinea pig Mammal (rodent) Moleques do Sul Island, Santa Catarina, Brazil 40–60 * habitat disturbance * possible hunting * result of having such a small population Cercopithecus roloway Roloway guenon (monkey) Mammal (primate) Côte d'Ivoire Unknown * hunting * habitat loss Coleura seychellensis Seychelles sheath-tailed bat Mammal (bat) Two small caves on Silhouette and Mahé, Seychelles < 100 * habitat degradation * predation by invasive species Cryptomyces maximus Willow blister Fungi Pembrokeshire, United Kingdom Unknown * limited habitat Cryptotis nelsoni Nelson’s small-eared shrew Mammal (shrew) Volcán San Martín Tuxtla, Veracruz, Mexico Unknown * logging * cattle grazing * fire * agriculture Cyclura collei Jamaican iguana Jamaican rock iguana Reptile Hellshire Hills, Jamaica Unknown * habitat destruction * predation by introduced species Dendrophylax fawcettii Cayman Islands ghost orchid Plant (orchid) Ironwood Forest, George Town, Grand Cayman Unknown * infrastructure development Dicerorhinus sumatrensis Sumatran rhino Mammal (rhino) Sabah, Sarawak and Peninsular Malaysia, Kalimantan and Sumatra, Indonesia < 250 * hunting (horn is used in traditional medicine) Diomedea amsterdamensis Amsterdam albatross Bird Breeds on Plateuau des Tourbières, Amsterdam Island, Indian Ocean. 100 mature individuals * disease * incidental by-catch in long-line fishing Dioscorea strydomiana Wild yam Plant Oshoek area, Mpumalanga, South Africa 200 * collection for medicinal use Diospyros katendei Plant (tree) Kasyoha-Kitomi Forest Reserve, Uganda 20 individuals in a single population * agricultural activity * illegal tree felling * alluvial gold digging * small population Dipterocarpus lamellatus Plant (tree) Siangau Forest Reserve, Sabah, Malaysia 12 individuals * logging of lowland forest * creation of industrial plantations Discoglossus nigriventer Hula painted frog Amphibian (frog) Hula Valley, Israel Unknown * predation by birds * range restriction due to habitat destruction Dombeya mauritania Plant Mauritius Unknown * encroachment by invasive plant species * habitat loss due to cannabis cultivation Elaeocarpus bojeri Plant (tree) Grand Bassin, Mauritius < 10 individuals * habitat degradation Eleutherodactylus glandulifer La Hotte glanded frog Amphibian (frog) Massif de la Hotte, Haiti Unknown * charcoal production * slash-and-burn agriculture Eleutherodactylus thorcetes Macaya breast-spot frog Amphibian (frog) Formon and Macaya peaks, Masif de la Hotte, Haiti Unknown * charcoal production * slash-and-burn agriculture Eriosyce chilensis Chilenito (cactus) Plant Pta Molles and Pichidungui, Chile < 500 individuals * collection of flowering plants Erythrina schliebenii Coral tree Plant (tree) Namatimbili-Ngarama Forest, Tanzania < 50 individuals * limited habitat and small population size increase vulnerability Euphorbia tanaensis Plant (tree) Witu Forest Reserve, Kenya 4 mature individuals * illegal logging * agricultural expansion * infrastructure development Eurynorhyncus pygmeus Spoon-billed sandpiper Bird Breeds in Russia, migrates along the East Asian- Australasian Flyway to wintering grounds in Bangladesh and Myanmar 100 breeding pairs * trapping * land reclamation Ficus katendei Plant Kasyoha- Kitomi Forest Reserve, Ishasha River, Uganda < 50 mature individuals * agriculture * illegal tree felling * alluvial gold digging Geronticus eremita Northern bald ibis Bird Breeds in Morocco, Turkey and Syria. Syrian population winters in central Ethiopia. 200–249 mature individuals * habitat degradation and destruction * hunting Gigasiphon macrosiphon (flowering plant in legume family) Plant Kaya Muhaka, Gongoni and Mrima Forest Reserves, Kenya, Amani Nature Reserve, West Kilombero Scarp Forest Reserve, and Kihansi Gorge, Tanzania 33 * timber extraction * agriculture encroachment and development * predation by wild pigs Gocea ohridana (type of gastropod) Mollusc Lake Ohrid, Macedonia Unknown * increasing pollution levels * off-take of water * sedimentation events Heleophryne rosei Table mountain ghost frog Amphibian (frog) Table Mountain, Western Cape Province, South Africa Unknown * invasive plants * water abstraction Hemicycla paeteliana (type of land snail) Mollusc Jandia peninsula, Fuerteventura, Canary Islands Unknown * overgrazing * trampling by goats and tourists Heteromirafa sidamoensis Liben lark Bird Liben Plains, southern Ethiopia 90–256 * agricultural expansion * overgrazing * fire suppression Hibiscadelphus woodii Plant (small tree) Kalalau Valley, Hawaii Unknown * habitat degradation due to feral ungulates * competition with invasive plant species Hucho perryi Sakhalin taimen Fish Russian and Japanese rivers, Pacific Ocean between Russia and Japan Unknown * overfishing (sport fishing and commercial bycatch) * damming * agriculture * other land use Johora singaporensis Singapore freshwater crab Crustacean Bukit Timah Nature Reserve and streamlet near Bukit Batok, Singapore Unknown * habitat degradation due to reduction in water quality and quantity Lathyrus belinensis Belin vetchling (flowering plant related to Lathyrus odoratus - sweet pea) Plant Outskirts of Belin village, Antalya, Turkey < 1,000 * urbanisation * over-grazing * conifer planting * road widening Leiopelma archeyi Archey’s frog Amphibian (frog) Coromandel peninsula and Whareorino Forest, New Zealand Unknown * Chytridiomycosis * predation by invasive species Lithobates sevosus Dusky gopher frog Amphibian (frog) Harrison County, Mississippi, USA 60–100 * fungal disease * climate change * land-use changes Lophura edwardsi Edwards’s pheasant Bird Quang Binh, Quang Tri and Thua Thien-Hue, Viet Nam Unknown * habitat loss * hunting Magnolia wolfii (type of Magnolia tree) Plant Risaralda, Colombia < 5 * isolation of species * low regeneration rates Margaritifera marocana (type of freshwater mussel) Mollusc Oued Denna, Oued Abid and Oued Beth, Morocco < 250 * pollution * development Moominia willii (snail) Mollusc Silhouette Island, Seychelles < 500 * invasive species * climate change Natalus primus Cuban greater funnel eared bat Mammal (bat) Cueva La Barca, Isle of Pines, Cuba < 100 * habitat loss * human disturbance Nepenthes attenboroughii Attenborough’s pitcher plant Plant Mount Victoria, Palawan, Philippines Unknown * poaching Nomascus hainanus Hainan gibbon Mammal (primate) Hainan Island, China < 20 * hunting Neurergus kaiseri Luristan newt Amphibian Zagros Mountains, Lorestan, Iran < 1,000 * illegal collection for pet trade Oreocnemis phoenix Mulanje red damsel (damselfly) Insect (damselfly) Mulanje Plateau, Malawi Unknown * habitat destruction and degradation due to drainage * agricultural expansion * exploitation of forest Pangasius sanitwongsei Pangasid catfish Fish Chao Phraya and Mekong basins in Cambodia, China, Lao PDR, Thailand and Viet Nam Unknown * overfishing * collection for aquarium trade Parides burchellanus (butterfly) Insect (butterfly) Cerrado, Brazil < 100 * human expansion * limited range Phocoena sinus Vaquita (porpoise) Mammal (cetacean) Northern Gulf of California, Mexico < 200 * capture in fishermen's gillnets Picea neoveitchii Type of spruce tree Plant (tree) Qinling Range, China Unknown * destruction of forest Pinus squamata Qiaojia pine Plant (tree) Qiaojia, Yunnan, China < 25 * limited distribution * small population size Poecilotheria metallica Gooty tarantula, metallic tarantula, peacock parachute spider, peacock tarantula, Salepurgu Spider Nandyal and Giddalur, Andhra Pradesh, India Unknown * deforestation * firewood collection * civil unrest Pomarea whitneyi Fatuhiva monarch Bird Fatu Hiva, Marquesas Islands, French Polynesia 50 * predation by introduced species - Rattus rattus and feral cats Pristis pristis Common sawfish Fish Coastal tropical and subtropical waters of Indo-Pacific and Atlantic Oceans. Currently largely restricted to northern Australia Unknown * exploitation has removed the species from 95 per cent of its historical range Prolemur simus Greater bamboo lemur Mammal (primate) Southeastern and southcentral rainforests of Madagascar 100–160 * agriculture * mining * illegal logging Propithecus candidus Silky sifaka Mammal (primate) Maroantsetra to Andapa basin, and Marojeju Massif, Madagascar 100–1,000 * hunting * habitat disturbance Psammobates geometricus Geometric tortoise Reptile (tortoise) Western Cape Province, South Africa Unknown * loss of habitat destruction * predation Pseudoryx nghetinhensis Saola Mammal Annamite mountains, on the Viet Nam - PDR Laos border Unknown * habitat destruction * hunting Psiadia cataractae Plant Mauritius Unknown * development project * competition from invasive plant species Psorodonotus ebneri Beydaglari bush-cricket Insect Beydaglari range, Antalaya, Turkey Unknown * climate change * habitat loss Rafetus swinhoei Red River giant softshell turtle Reptile (turtle) Hoan Kiem Lake and Dong Mo Lake, Viet Nam, and Suzhou Zoo, China 3 * hunting for consumption * wetland destruction * pollution Rhinoceros sondaicus Javan rhino Mammal (rhino) Ujung Kulon National Park, Java, Indonesia < 100 * hunting for traditional medicine * small population size Rhinopithecus avunculus Tonkin snub-nosed monkey Mammal (primate) Northeastern Viet Nam < 200 * habitat loss * hunting Rhizanthella gardneri West Australian underground orchid Plant (orchid) Western Australia, Australia < 100 * land clearance for agriculture * climate change * salinisation Rhynchocyon sp. Boni giant sengi Mammal (shrew) Boni- Dodori Forest, Lamu area, Kenya Unknown * development causing habitat loss Risiocnemis seidenschwarzi Cebu frill-wing (damselfly) Insect (damselfly) Rivulet beside the Kawasan River, Cebu, Philippines Unknown * habitat degradation and destruction Rosa arabica Plant St Katherine Mountains, Egypt Unknown, 10 sub-populations * domestic animal grazing * climate change and drought * medicinal plant collecting * limited range Salanoia durrelli Durrell’s vontsira (type of mongoose) Mammal Marshes of Lake Alaotra, Madagascar Unknown * loss of habitat Santamartamys rufodorsalis Red crested tree rat Mammal (rodent) Sierra Nevada de Santa Marta, Colombia Unknown * urban development * coffee cultivation Scaturiginichthys vermeilipinnis Red-finned Blue-eye Fish Edgbaston Station, central western Queensland, Australia 2,000-4,000 * predation by introduced species Squatina squatina Angel shark Fish (shark) Canary Islands Unknown * benthic trawling Sterna bernsteini Chinese crested tern Bird Breeding in Zhejiang and Fujian, China. Outside breeding season in Indonesia, Malaysia, Philippines, Taiwan, Thailand. < 50 * habitat destruction * egg collection Syngnathus watermeyeri Estuarine pipefish Fish Kariega Estuary to East Kleinemonde Estuary, Eastern Cape Province, South Africa Unknown * dam construction is altering river flows * flood events into estuaries Tahina spectabilis Suicide Palm Dimaka Plant Analalava district, north-western Madagascar 90 * fires * logging * agricultural developments Telmatobufo bullocki Bullock’s false toad Amphibian (frog) Nahuelbuta, Arauco Province, Chile Unknown * construction of hydro-electricity Tokudaia muenninki Okinawa spiny rat Mammal (rodent) Okinawa Island, Japan Unknown * habitat loss * predation by feral cats Trigonostigma somphongsi Somphongs’s rasbora Fish Mae Khlong basin, Thailand Unknown * farmland conversion and urbanization Valencia letourneuxi Fish Southern Albania and Western Greece Unknown * habitat destruction * water abstraction * aggressive interaction with Gambusia Voanioala gerardii Forest coconut Plant Masoala peninsula, Madagascar < 10 * deforestation * harvesting for consumption of palm heart Zaglossus attenboroughi Attenborough’s echidna Mammal Cyclops Mountains, Papua Province, Indonesia Unknown * habitat modification and degradation * logging * agricultural encroachment shifting cultivation and hunting by local people == References == Category:Lists of animals Category:Lists of plants Category:Conservation",
 "title": "The world's 100 most threatened species"
}