{
 "id": "471638",
 "text": "Lorimar-Telepictures was an American entertainment company. It was created on April 21, 1986. The company was created by the merger of Lorimar and Telepictures. Its assets included television production and syndication, movies, home video and broadcasting. ==History== The merger of Lorimar- Telepictures was announced on October 7, 1985 by Merv Adelson.\"Lorimar in Merger.\" The Pittsburgh Press (October 7, 1985).\"A TV TITAN WAGERS A WAD ON MOVIES Lorimar-Telepictures makes a ton of money producing and distributing such TV hits as Dallas and The People's Court. Unsatisfied, chief Merv Adelson is trying to expand in theatrical films. The profits are potentially huge -- but a lot less certain.\" CNN Money (May 12, 1986). On April 21, 1986, the two companies merged. Lee Rich was one of the founders of Lorimar. In 1986, he sold his shares and left the company. On January 11, 1989, Warner Communications acquired Lorimar-Telepictures after a failed hostile takeover of the company. ==List of shows produced/distributed by Lorimar-Telepictures== Note: Most series listed here are owned and distributed by Warner Bros. Television. * The $1,000,000 Chance of a Lifetime * ALF (1986–1989) (Currently distributed by Debmar-Mercury) * Alvin and the Chipmunks (1986–1989) * Animalympics * Blood & Orchids * Chiller * The Comic Strip * Dallas (1986–1989) * A Death in California * Falcon Crest (1986–1989) * Full House (1987–1989) * Fun House (technically Lorimar Television, Telepictures & Warner Bros. in 1990) * Ghost of a Chance * Gumby (1986-1989) * Hard Choices (movie) * Here's Lucy * The Hogan Family (1986–1989) * Hunter (1986–1989) (Sony Pictures Television is the US television distributor) * It's A Living (1986-1989) * Jack Frost * Jake's Journey (1988-1989 pilots for CBS starring Graham Chapman) * Knots Landing (1986–1989) * Legendary Ladies of Rock & Roll * Max Headroom (not the original pilot by Chrysalis Visual Programming for Channel Four UK) * Love Connection (1986-1989) * Made in Heaven * Mama's Family * \"Master Harold\"...and the Boys * Our House * The People's Court * Perfect Match * Perfect Strangers (1986–1989) * Polyester * Mayberry R.F.D. * Rowan & Martin's Laugh-In * Second Serve * Shattered Innocence° * SilverHawks * Summer Girl * Superior Court * ThunderCats * The Waltons == Broadcasting == In the mid-1980s, Lorimar-Telepictures went into the broadcasting business. It bought six television stations. They were as follows: City of License / Market Station Channel TV (RF) Sold To Current Ownership Status Chico - Redding KNVN 24 (24) Goltrin Communicactions (1987) NBC affiliate owned by K4 Media Holdings Springfield - Branson KSPR 33 (19) Goltrin Communications (1987) ABC affiliate owned by Perkin Media, LLC Pittsburgh WPGH-TV 53 (43) Renaissance Broadcasting (1987) Fox affiliate owned by Sinclair Broadcast Group Midland - Odessa KMID 2 (26) Goltrin Communications (1987) ABC affiliate owned by Nexstar Broadcasting Group San Juan - Caguas - Ponce - Mayagüez WLII 11 (11) Malrite Communications (1991) Univision Owned & Operated (O&O;) WSUR-TV 9 (9) There was no success of this broadcast division. This led to the sale of each of these stations by 1991. ==References== == Other websites == * Category:Time Warner Category:Companies based in Los Angeles Category:1986 establishments in the United States Category:1989 disestablishments in the United States",
 "title": "Lorimar-Telepictures"
}