{
 "id": "471983",
 "text": "Marina Nikolayevna Oswald Porter (July 17, 1941) is the widow of Lee Harvey Oswald. According to the Warren Commission he was the sole assassin of U.S. President John F. Kennedy.John R. Tunheim, Final Report of the Kennedy Assassination Records Review Board (Assassination Records Review Board, September 1998), p. 1 She married Oswald during his temporary defection to the Soviet Union and emigrated to the United States with him. After the assassination and Oswald's murder, she testified against Oswald during the Warren Commission hearings and remarried two years after. == Life == She was born in Severodvinsk (formerly named Molotovsk), Arkhangelsk Oblast, Russia on 17 July 1941.Report of the President's Commission on the Assassination of President John F. Kennedy (Washington DC: U.S. Government Printing Office, 1964), pp. 702–704 She met Lee Harvey Oswald at a dance in March 1961 in Russia. They were married on April 30 1961. Their daughter, June Lee, was born on February 15, 1962. Later that year the Oswalds moved from Russia to the United States. In Dallas, Marina gave birth to a second daughter, Audrey Marina Rachel Oswald. After the assassination of President Kennedy in 1963, Oswald was arrested. Two days later Oswald was shot and killed by nightclub owner Jack Ruby while still in police custody. Porter was under Secret Service protection until she finished giving testimony before the Warren Commission. She told the commission she believed husband was guilty of shooting President Kennedy on Nov. 22, 1963. In 1965, she married Kenneth Jess Porter. They worked at eluding reporters, who had learned of the engagement, and travelled to Fate to be wed by a justice of the peace. They had one son. In 1989, Porter became a naturalized citizen of the United States.Edward J. Gibbons, Seven Days in November 1963: The Kennedy Assassination (Bloomington, IN: iUniverse, 2013), p. 148 As of 2013, Marina lives in Rockwall, Texas, and generally avoids publicity. https://nypost.com/2022/11/19/pal-reveals-lee-harvey- oswalds-weird-paranoid-life-pre-jfk-killing/ == Aftermath of the shooting == Porter has said that she now believes that Lee Harvey Oswald was completely innocent of the deaths of Kennedy and Tippit.Gerald Posner, Case Closed: Lee Harvey Oswald and the Assassination of JFK (New York: Open Road Integrated Media, 2013), p. 345OSWALD’S WIDOW BELIEVES HE DIDN’T ACT ALONE, Deseret News, Salt Lake City, Utah, 28 September 1988, https://www.deseret.com/1988/9/28/18779524/oswald-s-widow-believes-he-didn-t- act-alone Retrieved 27 June 2023MARINA: Oswald didn't kill ANYONE (film), Youtube.com In 1980 she was convinced by conspiracy buffs that the man in Harvey's grave was a Russian spy and not her husband. She still lives with her second husband but in private and is afraid to go out in public. She believes her phones are tapped by the Secret Service. Porter also believes the Secret Service want to kill her. ===Her later belief that Lee Harwey is in movie tapes taken during the assassination=== She also expressed her belief that Oswald was the \"prayer man\", a man seen standing on the Depository front steps in films taken by Dave Wiegman of NBC-TV and Jimmy Darnell of WBAP-TV during the assassination, an unprompted Marina told Ed LeDoux that the “Prayer Man” was Lee.Prayer Man: The Exoneration of Lee Harvey Oswald By Stan Dane (2015), p. 101. Ed Ledoux rang Marina Oswald after Stan Dane had sent enlargements and a copy of his book Prayer Man: The Exoneration of Lee Harvey Oswald, in 2018. She volunteered “It’s Lee”. She was not prompted at all. She maintains her belief that Oswald was \"prayer man\".JFK Assassination Ed Ledoux speaks with Marina Oswald, Youtube.com Nicole Brown Simpson (née Brown; May 19, 1959 – June 12, 1994) was the second wife of American professional football player and media personality O. J. Simpson. Brown was born in Frankfurt, West Germany, and moved to the U.S. early in her life. Brown and Simpson met in 1977 and married in 1985, five years after Simpson had retired from professional American football. Their marriage lasted for eight years, and they had a daughter and a son together. Reports suggest that Simpson emotionally, verbally, and physically abused Brown throughout their relationship, which continued after their divorce. They made an attempt at reconciliation, but later broke up again, seemingly permanently. She was murdered outside her Brentwood home, along with her friend Ron Goldman, on June 12, 1994. Following a highly publicized criminal trial, Simpson was acquitted of both charges of murder, though he was later found liable for the wrongful deaths in a civil lawsuit. On January 1, before 4 a.m., Brown had phoned a dispatcher, Sharon Gilbert, who heard a woman scream and what she believed to be an altercation occurring in the background. Brown was found by the responding officer hiding in the bushes outside their home, \"badly beaten and half-naked\", saying that she thought Simpson was going to kill her. Journalist Brain Heiss suggests that there is nothing the claim that LAPD responded to eight domestic violence incidents. They then shared custody of their two children. Brown also stated that Simpson had not hit her in four years, referring to the January 1, 1989 incident as the last time he had become physical with her. On June 22, 1994, Brown's sister, Denise was quoted by the New York Times that she did not think of Nicole as a battered woman, even after Simpson was charged with assault on New Year's Eve 1989, stating that she did not know of any incident besides that one. Heiss argues that a diary entry was hoaxed. On September 23, 2004, American Businessman Donald Trump criticised Brown. In July 2017, Brown's lover, Keith Zlomsowitch was arrested. On the evening of Sunday, June 12, 1994, Goldman worked a server shift at Mezzaluna Trattoria in Brentwood. Brown called to report that her mother had inadvertently dropped her reading glasses outside by the gutter when they dined there earlier in the evening. Goldman had not been their server, but after a search at the restaurant turned up the glasses, Goldman agreed, at Brown’s request, to drop them off at her home after work. \"Ron interjected he’d be happy to return them,\" said Tia Gavin, who waited on the Brown party. The Los Angeles Times reported that Goldman \"punched out at 9:33 pm and stayed another 15 minutes to have bottled water at the bar.\" He made plans to go out with Mezzaluna's bartender Stewart Tanner later that evening. Before returning the glasses, Goldman stopped by his Brentwood apartment at 11663 Gorham Avenue, presumably to shower and change clothes; his autopsy indicated he ate a salad less than 40 minutes before he was killed. He then drove to Brown’s condominium, using his friend Andrea Scott's car.Lange, Tom. Evidence Dismissed. Regnery Publishing, 1997, p. 93. Goldman* * * and Brown were stabbed to death on the walkway leading to the condominium at 875 South Bundy Drive; their bodies were discovered shortly after midnight. Goldman's knuckles were bruised; Simpson's defense team argued that this indicated he had fought strongly, while prosecutors argued it was probably from a fall. Goldman had several small wounds to his face. During a reconstruction of events, the police theorized that Brown and Goldman were talking on the front patio of Brown's condominium when they were attacked or that Goldman arrived while Brown was being attacked; in any case, the police believe that Brown was the intended target and that Goldman was killed in order to silence him. Witness Robert Heidstra testified that while walking near Brown's condominium that night, he heard a man yelling, \"Hey! Hey! Hey!\" who was then shouted at by a second man. He also heard a gate slam. Goldman's family came to believe that Goldman was the man shouting \"Hey!\" and that he may have attempted to save Brown by intervening in the attack. Goldman was 20 days shy of his 26th birthday when he died. He is buried at Pierce Brothers Valley Oaks Memorial Park in Westlake Village, California. ==Trials== === Criminal trial === After being arrested following a low-speed chase, Simpson was tried for the killings of both Brown and Goldman. The trial spanned eight months, from January 24 to October 3, 1995. During the trial, there was some speculation as to whether Goldman and Brown were secretly dating, compounded by three facts, that Brown was wearing a slinky, revealing cocktail dress when she was found dead, candles were lit in the master bedroom and bathroom, and the master bathroom’s tub was full of water. Though prosecutors argued that Simpson was implicated by a significant amount of forensic evidence, he was acquitted of both murders on October 3. Commentators agree that to convince the jury to acquit Simpson, the defense capitalized on anger among the city's African-American community toward the Los Angeles Police Department (LAPD), which had a history of purported racial bias and had allegedly inflamed racial tensions in the beating of Rodney King and subsequent riots two years prior. The trial is often characterized as the trial of the century because of its international publicity and has been described as the \"most publicized\" criminal trial in history. Simpson was formally charged with the murders on June 17; when he did not turn himself in at the agreed time, he became the subject of a police pursuit. TV stations interrupted coverage of the 1994 NBA Finals to broadcast live coverage of the pursuit, which was watched by around 95 million people. The pursuit and Simpson's arrest were among the most widely publicized events in history. Simpson was represented by a high-profile defense team, referred to as the \"Dream Team\", initially led by Robert Shapiro and subsequently directed by Johnnie Cochran. The team included F. Lee Bailey, Alan Dershowitz, Robert Kardashian, Shawn Holley, Carl E. Douglas, and Gerald Uelmen. Simpson was also instrumental in his own defense. While Deputy District Attorneys Marcia Clark, William Hodgman, and Christopher Darden believed they had a strong case, the defense team persuaded the jury there was reasonable doubt concerning the DNA evidence. They contended the blood sample had been mishandled by lab scientists and that the case had been tainted by LAPD misconduct related to racism and incompetence. The use of DNA evidence in trials was relatively new, and many laypersons did not understand how to evaluate it. The trial was considered significant for the wide division in reaction to the verdict. Observers' opinions of the verdict were largely related to their ethnicity; the media dubbed this the \"racial gap\". A poll of Los Angeles County residents showed most African Americans thought the \"not guilty\" verdict was justified while most whites thought it was a racially motivated jury nullification by the mostly African-American jury. Polling in later years showed the gap had narrowed since the trial; more than half of polled Black respondents expressed the belief that Simpson was guilty. In 2017, three jurors who acquitted Simpson said they would still vote to acquit, while one said he would convict. Comparisons were made years later between the Trayvon Martin case and the O.J. Simpson case, and how race impacted both. During an interview with Piers Morgan, when asked if there was a similarity in the racial aspects of the cases, Kim Goldman said all of the evidence pointed towards guilt in Simpson’s case, while she believed George Zimmerman’s not guilty verdict was correct because it was a self defense case and that the killing of Trayvon Martin was not racially charged. Fred Goldman also denied racism played a factor in the killing of Trayvon or the outcome of the Simpson trial in an interview. In the 1996 book Killing Time: The First Full Investigation into the Unsolved Murders of Nicole Brown Simpson and Ronald Goldman, authors Donald Freed and Raymond P. Briggs wrote that lipstick was found on Goldman's cheek after his death, and suggested that Brown kissed Goldman when he arrived and that they were together on the front porch when they were attacked. In an interview on Larry King Live, Ron's father, Fred Goldman, called into the show and berated Freed about the book. === Civil trial === In 1996, Fred Goldman and Sharon Rufo, the parents of Ron Goldman, and Lou Brown, father of Nicole Brown filed a civil suit against Simpson for wrongful death. Presiding Judge Hiroshi Fujisaki did not allow the trial to be televised, did not sequester the jury, and prohibited the defense from alleging racism by the LAPD and from condemning the crime lab. The physical evidence did not change but additional evidence of domestic violence was presented as well as 31 pre-1994 photos of Simpson wearing Bruno Magli shoes, including one that was published 6 months before the murders, proving it could not be a forgery. Results from a polygraph test that Simpson denied taking showed \"extreme deception\" when he denied committing the murders. One significant difference between the two trials was the admission of Nicole Brown's diary entries in the civil case. The civil judge found the diary entries were admissible because they were pertinent to Nicole's state of mind, which in turn was relevant to Simpson's motive—reversing a crucial ruling from the criminal case that excluded the diary as \"inadmissible hearsay\". The civil court's ruling was upheld on appeal. Fred Goldman successfully campaigned to change California’s hearsay laws to allow the testimony of a woman named Nicole (presumed to be Brown) who telephoned Sojourn House, a women's shelter. The jury found Simpson liable for the murders and awarded the victims' families $33.5 million in compensatory and punitive damages. Simpson filed for bankruptcy afterwards and relocated to Florida to protect his pension from seizure. His remaining assets were seized and auctioned off with most being purchased by critics of the verdict of the criminal trial to help the plaintiffs recoup the costs of litigation. Simpson's Heisman Trophy was sold for $255,500 to an undisclosed buyer. All the proceeds went to the Goldman family, who said they have received only one percent of the money that Simpson owes from the wrongful death suit. In an interview with Barbara Walters, Fred Goldman said that during Simpson's civil trial, he was approached by a stranger who offered to sell him an untraceable high-powered rifle to kill Simpson or to hire someone to kill Simpson for him, but the appalled Goldman refused. Fred Goldman told a radio talk show host that Simpson could keep the money under one condition, stating that if Simpson \"wants to write out a complete confession and publish it in newspapers around the country, we'll be glad to ignore the judgment. That will never happen\". In 1996 the Goldman family signed a book contract, with a guaranteed advance of $450,000 and received additional funds based on the sales of their book. Fred Goldman left a 30-year career in sales to pursue those goals by taking a $100,000-a-year job with the nonprofit Safe Streets Coalition. Since 1998 Goldman and his second wife, Patti, have been living off book profits, speaking fees. During the civil trial, Kim Goldman said that she and Michael Nigg were set-up on a blind date. After a good first date, the two went on 5 or more dates. At the time they were going out together Michael Nigg worked at a restaurant in Santa Barbara and at some point after 1992 Michael moved to Los Angeles. Kim Goldman testified that she never introduced her brother to Michael Nigg and she did not see Michael after he moved to Los Angeles. She stated she was unaware how her brother, Ron, and Michael met; she testified that the two met by happenstance. The two men apparently became good friends because, according to Ms. Goldman, Michael Nigg got her brother the job at Mezzaluna. While Kim Goldman does not have knowledge of Michael having worked at Mezzaluna, according to the Los Angeles Times Michael Nigg had been employed at Mezzaluna in Brentwood at some point. At the time of his death Michael Nigg was working at a restaurant called Sanctuary that was located in Beverly Hills. Some news reports claim that Michael Nigg “befriended Ronald Goldman when both worked at the Mezzaluna restaurant” however Ms. Goldman’s testimony establishes that the two men were friends prior to Ron being hired at Mezzaluna. It is unknown if Michael Nigg and Ron Goldman’s tenures at Mezzaluna overlapped. In an interview with 20/20, Kim Goldman said that one day some time after Simpson's acquittal, she was driving in her car when she saw him in a parking lot in Los Angeles. She considered running him over to get vengeance, but decided otherwise. === Subsequent events === Simpson was subsequently jailed for an unrelated armed robbery at a Las Vegas hotel in 2008. Both Fred and Kim Goldman were present at the robbery trial, and after Simpson's conviction, Fred Goldman expressed his satisfaction and referred to it as a \"bittersweet\" moment. In July 2017 after Simpson was granted parole, Fred Goldman inquired about the real estate purchases made by Sydney and Justin Simpson, Brown’s children with Simpson. David Cook, a lawyer for Fred Goldman, said he would seek bank records and depositions to follow the kids’ money trail and see if any of the homes were bought with their dad’s cash, which could make them eligible for a clawback. “The kids’ loss is no greater than Fred’s, but Fred’s loss should be no greater than theirs,” Cook said. In June 2022 Fred alleged in court papers (intended to keep the wrongful death and battery judgment viable) that Simpson owed $96 million due to significant interest generated on the initial order to pay damages. Following Simpson's death in 2024, Simpson estate lawyer Malcolm LeVergne pledged to prevent the Brown and Goldman families from obtaining the money which was promised in the civil trial judgement, but later reversed course. When Simpson died in 2024, Fred Goldman initially called Simpson’s death \"no great loss to the world\" but also said that it was \"just a further reminder of how long my son has been gone...how many years, and how much he’s been missed. And the only thing that is important today are (Ron and Nicole). Nothing else is important.\" Kim and Fred later issued a statement that read, \"The hope for true accountability has ended... Thank you for keeping our family, and most importantly Ron, in your hearts\". Fred Goldman said that he will still pursue \"justice\" for his son after Simpson's attorney said that the Goldman family will get \"nothing\" from the estate. A few days later, Simpson's attorney backtracked and confirmed that Simpson's estate will settle the legal verdict with the Brown and Goldman families, and said that his statements were made out of a moment of frustration over what he felt were \"insensitive\" remarks about Simpson's death. == Legacy == When filmmaker Ezra Edelman, director of the documentary O.J.: Made in America, won the Academy Award for Best Documentary Feature, he dedicated the award to both Goldman and Brown in his acceptance speech. Fred Goldman was among those whom Edelman interviewed in the documentary. == References == == Other websites == * Testimony of Maria Oswald Porter before Congress * Growing Up As Lee Harvey Oswald's Daughters Category:1941 births Category:Living people Category:People from Arkhangelsk Oblast",
 "title": "Marina Oswald Porter"
}