{
 "id": "47219",
 "text": "== The term == The term biological diversity was used first by wildlife scientist and conservationist Raymond F. Dasmann in 1968, Dasmann R.F. 1968. A different kind of country. MacMillan, New York. where he advocated conservation. It was widely adopted only in the 1980s.Soulé M.E. and B. A. Wilcox. 1980. Conservation biology: an evolutionary-ecological perspective. Sinauer. Sunderland, Massachusetts. The term biodiversity first appeared in a publication in 1988 when entomologist E. O. Wilson used it as a title.Edward O.Wilson, editor, Frances M.Peter, associate editor 1988. Biodiversity, National Academies Press. ; online edition Global Biodiversity Assessment. UNEP, 1995, Annex 6, Glossary. , used as source by \"Biodiversity\", Glossary of terms related to the CBD , Belgian Clearing-House Mechanism. Retrieved 2006-04-26. Since then, the term has often been used by biologists, environmentalists, political leaders, and citizens. A similar term in the United States is \"natural heritage.\" It predates the others and is more accepted by the wider audience interested in conservation. Broader than biodiversity, it includes geology and landforms. == Definitions == Biologists most often define biodiversity as the \"totality of genes, species, and ecosystems of a region\". An advantage of this definition is that it seems to describe most circumstances. There are three levels at which biological variety can been identified: *species diversity *ecosystem diversity *genetic diversity. == Threats == The idea can be used for tackling practical problems in conservation, for example: *loss of species *destruction of habitats *introduced and invasive species *genetic pollution *over-exploitation *effect of climate change == References == == Related pages == *Biodiversity Convention *Conservation biology *Endemism *Neurodiversity == Further reading == *Levin, Simon A. 2013. Encyclopedia of biodiversity. Academic Press. ISBN 978-0-12-384719-5 *Wilson E.O. 2016. Half-Earth: our planet's fight for life. Liveright. ISBN 978-1631490828 Category:Conservation",
 "title": "Biodiversity"
}