{
 "id": "472227",
 "text": "Kevin Baugh, (born 1962) is a Molossian politician and popular micronationalist. Baugh has been the President of the Republic of Molossia since 3 September 1999. His Presidential term started on the 3 September 1999, which is the official date of foundation of Molossia. However, his involvement in micronationalism goes way back to the end of the 1970s, when he formed, with James Spielman, the Grand Republic of Vuldstein. ==Personal life== Kevin Baugh married Adrianne Baugh on 18 October 2009 and has three children, Alexis Baugh, Carson Baugh, and Mark Baugh. ==Awards== ===Titles, honours and arms=== ====Full title==== Baugh's full title, according to the Baustralian Gazette, is: :His Excellency President Grand Admiral Colonel Doctor Kevin Baugh, Stranger Knight of the Most Noble Order of the Gadus, Stranger Officer of the Most Excellent Order of the Baustralian Empire, Lord of the Royal Order of Saint Christopher, Knight of the Order of the Heart, President and Raïs of Molossia, Protector of the Nation and Guardian of the People ====Honours==== President Baugh is almost certainly the single most decorated figure in micronational culture. Below is a partial list of honors and awards from micronations. ====National honours==== ; :2000present: Sovereign of the Order of the Desert Star (1st and 2nd classes) :2000present: Sovereign Recipient of the Order of the Miner :2000present: Sovereign Recipient of the Order of the Palm ====Foreign honours==== ; :2017present: Member or the Grand Order of the Pink Flamingo ;Angador :Before or in 2012present: Lord of the Royal Order of Saint Christopher (defunct) ; :4 February 2009 present: Knight Commander of the Austenasian Order ; :8 October 2016present: Knight of the Order of the White Star (defunct) ; :1 January 2020 present: Stranger Knight of the Order of the Gadus :4 December 2019present: Officer of the Order of the Baustralian Empire ; :20 July 2019present: Knight of Cycoldia ; :2 January 2019present: Knight of the Order of the Heart :United Royal Republics of Jockromasa 19 September 2019 - present: Knight of The Order of Holy Eagle ; :6 January 2016present: Commander of the Order of the Black Cross (defunct) ; :15 June 2019present: Knight of the Order of the Amphisbaena Potato ;Ruritania :2013present: Member of the Order of King Henry the Lion ;Republic of Scoria :2 September 2020present: Scorian Medal of Friendship ; :2012present: Knight of the Order of the Dragon (defunct) :2009present: Member of the Great Order of Vikesland (defunct) ;Orders of Westarctica. Encyclopedia Westarctica. Retrieved 24 January 2020. :2019present: Stranger Knight in the Illustrious Antarctic Order of the Orca :2015present: Knight Grand Cross in the Order of the Snowflake :30 May 2011present: Knight Commander of the Order of the Desert Heart :2005present: Knight in the Noble Order of the Sword :2005present: Knight in the Noble Order of Westarctica ==Related pages== *Republic of Molossia ==References== Category:People Category:Royal Order of Saint Christopher Category:Molossia Category:1962 births Category:Living people",
 "title": "Kevin Baugh"
}