{
 "id": "472369",
 "text": "Armageddon (2002) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on December 15, 2002 at Office Depot Center in Sunrise, Florida. It was the third Armageddon event held by WWE. The main match for the Raw brand saw Triple H defeat Shawn Michaels in a Three Stages of Hell match for the World Heavyweight Championship. The first match was a Street Fight, which Triple H won after performing a Pedigree on Michaels and pinning him. The second match was a Steel cage match, which Michaels was able to win by pinfall after he jumped off the top of the steel cage onto Triple H and through a table. The third and final match was a Ladder match, which Triple H won after he climbed up a ladder and grabbed the belt which was suspended above the ring. The main event for SmackDown! saw Kurt Angle defeat Big Show to keep his WWE Championship. Angle pinned Big Show after Brock Lesnar interfered. Another match that was on the undercard saw Chris Benoit defeat Eddie Guerrero in a submission match. Benoit made Guerrero tap out to the Crippler Crossface. ==Matches== No. Results Stipulations Times 1 Jeff Hardy defeated D'Lo Brown Singles match 4:56 2 Booker T and Goldust defeated Lance Storm and William Regal, The Dudley Boyz (Bubba Ray and D-Von Dudley), and Chris Jericho and Christian (c) Tag team elimination match for the World Tag Team Championship 16:43 3 Edge defeated A-Train by disqualification Singles match 7:12 4 Chris Benoit defeated Eddie Guerrero by submission Singles match 16:47 5 Batista (with Ric Flair) defeated Kane Singles match 6:38 6 Victoria (c) defeated Trish Stratus and Jacqueline Triple threat match for the WWE Women's Championship 4:28 7 Kurt Angle defeated Big Show (c) (with Paul Heyman) Singles match for the WWE Championship 12:36 8 Triple H defeated Shawn Michaels (c) 2–1 Three Stages of Hell match for the World Heavyweight Championship 38:35 ===Tag Team elimination match=== Elimination Wrestler Team Eliminated by Elimination move Time 1 Bubba Ray Dudley The Dudley Boyz William Regal Pinned after a roll-up 05:17 2 William Regal Lance Storm and William Regal Goldust Pinned after a scoop powerslam 05:33 3 Chris Jericho Chris Jericho and Christian (c) Booker T Pinned after a Book End 16:43 Winners: Booker T and Goldust (New World Tag Team Champions) ==References== ==Other websites== *Official Armageddon 2002 website Category:2002 in American television Category:2002 in professional wrestling Category:Sports in Florida Category:WWE Armageddon Category:2000s in Florida",
 "title": "Armageddon (2002)"
}