{
 "id": "472363",
 "text": "Armageddon (1999) was a professional wrestling pay-per-view show made by the World Wrestling Federation. It took place on December 12, 1999 at National Car Rental Center in Sunrise, Florida. It was the first Armageddon event held by the WWF. The main event saw Triple H defeat Mr. McMahon in a No Holds Barred match. Triple H won the match by pinning McMahon after he hit him with a sledgehammer, when McMahon's daughter and Triple H's (kayfabe, at that time) wife Stephanie McMahon had turned on McMahon by giving the sledgehammer to Triple H. ==Matches== No. Results Stipulations Times 1 Al Snow defeated Test Singles match 1:27 2 The Acolytes (Bradshaw and Faarooq) won by last eliminating The Hardy Boyz (Matt and Jeff Hardy) 8-team battle royal to determine the number one contenders to the WWF Tag Team Championship at the Royal Rumble 10:56 3 Kurt Angle defeated Steve Blackman Singles match 6:56 4 Miss Kitty defeated Ivory (c), Jacqueline, and B.B. Four corners Evening Gown pool match for the WWF Women's Championship with The Fabulous Moolah and Mae Young as special guest referees 2:57 5 The Hollys (Hardcore and Crash Holly) defeated Rikishi and Viscera Tag team match 4:18 6 Val Venis defeated The British Bulldog (c) and D'Lo Brown Triple threat match for the WWF European Championship 8:19 7 Kane defeated X-Pac Steel cage match 8:11 8 Chris Jericho defeated Chyna (c) (with Miss Kitty) Singles match for the WWF Intercontinental Championship 10:22 9 The Rock 'n' Sock Connection (The Rock and Mankind) defeated The New Age Outlaws (Mr. Ass and Road Dogg) (c) by disqualification Tag team match for the WWF Tag Team Championship 16:23 10 Big Show (c) defeated Big Boss Man (with Prince Albert) Singles match for the WWF Championship 3:16 11 Triple H defeated Mr. McMahon No Holds Barred match 29:59 ===Battle Royal=== Elimination Wrestler Partner/Team Eliminated by 1 Pete Gas Rodney/The Mean Street Posse Faarooq 2 Mosh Thrasher/The Headbangers The Godfather 3 Mark Henry The Godfather Bradshaw & Faarooq 4 Scotty 2 Hotty Grand Master Sexay/Too Cool Edge 5 Edge Christian/Edge and Christian D-Von Dudley 6 D-Von Dudley Bubba Ray Dudley/The Dudley Boyz Matt Hardy 7 Jeff Hardy Matt Hardy/The Hardy Boyz Faarooq Winners: Faarooq and Bradshaw The Acolytes N/A ==References== ==Other websites== *Official Armageddon website Category:1999 in American television Category:1999 in professional wrestling Category:Sports in Florida Category:WWE Armageddon Category:1990s in Florida",
 "title": "Armageddon (1999)"
}