{
 "id": "472554",
 "text": "City farming, also called urban farming, is growing a kitchen garden () in a city.Lisa Taylor; et al., Your Farm in the City: An Urban-Dweller's Guide to Growing Food and Raising Animals (New York: Black Dog & Leventhal Publishers, Inc., 2011), p. 10 This has been practiced as long as there have been cities. Other names include \"pea-patching\", victory gardening and foodscaping. == City \"farms\" == Food is grown in a city setting for the use of an individual or family as well as for the community. This is not the same as the back-to-the- land movements of the 1970s. It is mainly about the little family farm inside the city. Land use in cities is subject to local land laws. Where permitted city farms may be anything from small window boxes to shared community gardens.Robin Morris Collin, Encyclopedia of Sustainability (Santa Barbara: ABC-CLIO, 2009), p. 222 Urban farmers can grow food for their own use. They can also sell excess crops directly to stores or at a farmers' market. City farms can also be nonprofit operations that grow food for poor and homeless people. Many city farms grow organic foods. These are from plants that do not use chemical fertilizers or pesticides. City farming also includes food growing cooperatives. They provide the opportunity to get involved in agriculture in their own city.Peter Newman; Isabella Jennings, Cities as Sustainable Ecosystems: Principles and Practices (Washington, DC: Island Press, 2008), p. 180 In Brisbane, Australia a community group took a city park that flooded regularly and changed it to an organic city farm. Called Northey Street City Farm, people of all ages and backgrounds work together to grow food. Fruits, vegetables, herbs and flowers are grown. Ponds were introduced to attract beneficial insects, frogs and birds which help in pest control. == Economics == City farming allows people to save money growing and harvesting their own food.Cities Farming for the Future: Urban Agriculture for Green and Productive Cities, ed. Rene ́ van Veenhuizen (Silang, Philippines: RUAF Foundation, International Institute of Rural Reconstruction; Ottawa: International Development Research Centre, 2006.), p. ix It allows many individuals and families to make an income selling the food they grow. It helps the cities by recycling organic waste into compost and soil. It takes vacant lots and turns them into green spaces. == Community == Shared garden space or community gardens provide a sense of working together. People, especially children, learn stewardship (planning and managing resources).Lisa Taylor; et al., Your Farm in the City: An Urban-Dweller's Guide to Growing Food and Raising Animals (New York: Black Dog & Leventhal Publishers, Inc., 2011), p. 13 Kids learn responsiblity and work ethics. They are also eager to try new foods when they see them grown in their own gardens. In some countries, gardens are grown on rooftops or on pavement. In some places land around public schools is made available for gardens.African Indigenous Vegetables in Urban Agriculture, eds. Charlie M Shackleton; Margaret W Pasquini; Axel W Drescher (London; Sterling, VA: Earthscan, 2009), p. 41 This benefits the school by providing food for school lunches. It also allows children to learn about growing their own food. == Victory gardens == Victory gardens were city farms that sprang up during World War I and World War II.Environmental Impact, eds. C. A. Brebbia; Tae Soo Chon (Southampton, UK; Boston: Wit Press, 2012), p. 415 There were food shortages in the United States, the United Kingdom, Canada, Australia and Germany. In the US alone, victory gardens provided 40% of the produce used during World War II. In addition to farms, gardens were grown in window boxes, rooftops, back yards and vacant yards.Cecilia Gowdy-Wygant, \"Cultivating Victory: The Women's Land Army and the Victory Garden Movement\" (Pittsburgh: The University of Pittsburgh Press, 2013), pp. 1-2 Victory gardens gave the people at home a sense of doing their part for the war effort. Women in England tended to grow ornamental gardens. This made for an easy shift towards food gardening. Women in the US had a cultural identity with the British and also grew ornamental gardens. But there were stereotypes to working in agricultural jobs in the US. But these were quickly overcome. Victory gardens were not uncommon even among upper classes in America. == References == == Other websites == * The Victory Garden, PBS ==Further reading== * Grow your own food * Edible gardening guide * How to Design a Potager Garden Category:Gardening",
 "title": "City farming"
}