{
 "id": "472648",
 "text": "Mort & Phil (Mortadelo y Filemón in Spanish) is a Spanish comics series designed in 1958 by Francisco Ibáñez. It's one of the most popular comics in Spain. Its first title was Mortadelo y Filemón: Agencia de Información with just the main characters. Every comics strip had from one to four pages. Throughout the years, the characters have evolved. At first, Mortadelo used to wear a bowler hat. He used to wear disguises. He was known for his shapeshifter abilities. Filemón, called by Mortadelo \"Jefe\" (Chief or Boss in English) had a beaked nose and use to smoke a pipe as Sherlock Holmes used to do. Their names are wordplay. For example: Mortadelo comes from Mortadela (\"Mortadella di Bologna\") and Filemón from Filete (\"Steak\"). In 1969, Ibáñez designed more characters. He also \"founded\" the TIA. The Técnicos de Investigación Aeroterráquea: \"Aeroterrestrial Investigation Technicians\") is an organisation that is a spoof on the CIA. With those changes, the comics books were much longer (44-48 pages). These editions were more satirical in regard to Spanish and international themes such as politics and political corruption, ETA's terrorism (Barcelona '92) where the terrorist group were named as \"TETA\" (\"TITS\"), and \"PEPA\" in España '82, and the islamic one or economics.Mortadelo y los políticos de tebeo, El Mundo.es. == Background == At first the characters were a parody version of Arthur Conan Doyle's characters: Sherlock Holmes (Filemón) and Dr. Watson (Mortadelo).sandalio.com Mortadelo y Filemón, personajes que más han triunfado Later they pointed to Novísimas aventuras de Sherlock Holmes by Enrique Jardiel Poncela or Laurel and Hardy. The comics books are known for slapstick comedy. It is not unusual to see the characters being injured or hurt. They have had several accidents. For example, falling from a fifth floor window and staying alive. === 35th Anniversary === Is often enough to see Ibáñez breaking the fourth wall when he's designed by himself. In 1992 was the 35th Mort and Phil's anniversary, so he made a special edition titled El 35 aniversario. In it, Ibáñez explained his childhood and his career when he began to work in Ediciones Bruguera, Barcelona, Spain. He explained it with a burlesque point of view. He also told how Mortadelo and Filemón met each other. That edition had a huge success among its fans. In 2001, a few days after the September 11 terrorist attacks that the last page (and vignette) called the readers attention to the tragedy. It was noted also in television media, because in the vignette's background (a common gag made by Ibáñez in all his works) there was a plane that crashed into the World Trade Center, in New York, in the United States. The official website stated \"that scene was designed as it and it wasn't retouched\". Regarding the attacks: \"it was a tragical coincidence\". == Characters == * Mort (Mortadelo): He's tall and bald. When he was young he had long hair, but lost it after testing an experimental growing-hair made by Pr. Bacterio. He was bald already on the first stories. Since that \"incident\", Mortadelo became to have hard feelings about him, even burned Bacterio's beard with a blowtorch as a \"prank\" (i. e. vengenace). He's also known as \"Master of Disguises\" . * Phil (Filemón) As Mortadelo, he's bald too, but has two hairs.De la Cruz Pérez, Fernando Javier en Los cómics de Francisco Ibáñez, p. 90. He's called \"Chief\" by Mortadelo. He's known by his temperamental way, specially when a victim of his subordinate's mistakes. Despite this, both are good friends. * Superintendente Vicente or Super: He's their boss and TIA's supervisor and General Director's subordinate. His dress is always a blue jacket. He's an overweighte person with a huge moustache. Those characteristics make him target of all pranks and mockeries from his employees, specially Mortadelo and Filemón, who call him as a \"walrus\". As Filemón does, he has a huge bad temper. * Pr. Bacterio: He's the TIA's scientist. He's known by his huge black beard that reaches his chest. He's negligent at his work. All his invention fail or make disasters. Bacterio is another gag of the series due to Mortadelo and Filemon runaway to him or he is caught by their pranks or assaults. His name comes from \"Bacteria\" * Mrs. Ofelia (Srta. Ofelia): She's Super's secretary. She's overweight too and self-conscious. Besides Super, she tends to be more polite to Mortadelo and Filemon although get pissed when she's insulted by them. In fact, she's in love with Mortadelo with an \"unrequited heart\", that's one of most reasons why she's feel jealous of Mrs. Irma. * Mrs. Irma (Srta Irma): She was the second secretary. Her first appearance was in 1987 in Terroristas as a supervisor in an anti-terrorist mission where Mortadelo and Filemon were members in order to arrest an islamic cell who pretends to help their member to escape after a failed attack against the US Embassy. Irma is Ophelia's opposite: she is fit and attractive. These characteristics makes the male agents lose their minds for her, specially Mortadelo and Filemon. In response, Ofelia gets jealous sometimes. Regardless of this, they have been good friends as she can hold off the agents. This character was based on the publisher's (of the German edition) secretary who died in 1990,1985-1990 Etapa negra , La Página no Oficial de Mortadelo y Filemón - Hemeroteca. therefore Irma was \"retired\" as her mourning, although she reappeared in the 2014 movie.Hoy se estrena la película ‘Mortadelo y Filemón contra Jimmy el Cachondo’ , Combo Gamer. == Adaptations == === Movies === Title (year) Mort Phil Superintendente Vicente Pr. Bacterio Ofelia Irma El armario del tiempo (1971) Víctor Ramírez (voice) José Martínez Blanco (voice) Mortadelo & Filemon: The Big Adventure (2003) Benito Pocino Pepe Viyuela Mariano Venancio Janfri Topera Berta Ojea Mission: Save the Planet (2008) Edu Soto Pepe Viyuela Mariano Venancio Janfri Topera Berta Ojea Mortadelo & Filemon: Mission Implausible (2014)‘Mortadelo and Filemon: Mission Implausible’ (‘Mortadelo and Filemon contra Jimmy el Cachondo’): Film Review, The Hollywood Reporter. Karra Elejalde (voice) Janfri Topera (voice) Mariano Venancio (voice) Enrique Villén (voice) Berta Ojea (voice) Athenea Mata (voice) === TV Series === Title (year) Mort Phil Superintendente Vicente Pr. Bacterio Ofelia Irma Mortadelo y Filemón: Agencia de Información (1966) Víctor Ramírez (voice) José Martínez Blanco (voice) Mort & Phil (1994) Enric Cusí (voice) Xavier Martín (voice) Miguel Ángel Jenner (voice) Emilio Freixas (voice) Rosa Pastó (voice) Alicia Laorden (voice) == Further reading == * DE LA CRUZ PÉREZ, Fernando Javier. Los cómics de Francisco Ibáñez. Ediciones de la Universidad de Castilla-La Mancha Cuenca, 2008. * FERNÁNDEZ SOTO, Miguel. El mundo de Mortadelo y Filemón. Medialive Content, 2008. * GUIRAL, Antoni. El gran libro de Mortadelo y Filemón: 50 aniversario. Ediciones B. * Interviews Amaníaco: By Vázquez == References == == Other websites== * La Página (NO) Oficial de Mortadelo y Filemón * LaTIA Cuartel General, Web dedicada a Mortadelo y Filemón y otros cómics * Mortadelo y Filemón de la serie \"El humor en el cómic\" para \"La Ciberniz\" * 13 Rue Bruguera, página web dedicada a Mortadelo y Filemón y el cómic Español * Una de las últimas colecciones de lujo publicadas sobre Mortadelo y Filemón, con la autorización de Francisco Ibáñez Category:Comics Category:Television programs Category:Spanish movies",
 "title": "Mort & Phil"
}