{
 "id": "472896",
 "text": "Armageddon (2004) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on December 12, 2004 at Gwinnett Center in Duluth, Georgia. It was the fifth Armageddon event held by WWE. The pay-per-view was a SmackDown! brand exclusive. There were 10 matches on the card with all 4 of SmackDown!'s championship were on the line. The main event saw John \"Bradshaw\" Layfield defeat Booker T, Eddie Guerrero and The Undertaker in a Fatal-Four Way match to retain his WWE Championship. Layfield won by Booker. If anyone interfered on JBL's behalf he would have lost the championship. Another main match on the undercard saw Big Show defeat Kurt Angle, Mark Jindrak and Luther Reigns in a Handicap match. Big Show was able to win the match after he pinned Jindrak following an F-5. Another primary match on the card saw John Cena defeat Jesús in a Street Fight to retain his WWE United States Championship. Cena won the match by executing an FU to Jesús and pinning him. ==Matches== No. Results Stipulations Times 1 Akio and Billy Kidman defeated Paul London and Chavo Guerrero Tag team match 5:44 2 Rob Van Dam and Rey Mysterio (c) defeated René Duprée and Kenzo Suzuki (with Hiroko) Tag team match for the WWE Tag Team Championship 17:12 3 Kurt Angle defeated Santa Claus Singles match 0:25 4 Daniel Puder defeated Mike Mizanin Dixie Dog Fight 3:00 5 The Basham Brothers (Doug and Danny Basham) defeated Hardcore Holly and Charlie Haas Tag team match 6:50 6 John Cena (c) defeated Jesús (with Carlito Caribbean Cool) Street Fight for the WWE United States Championship 7:50 7 Dawn Marie defeated Miss Jackie Singles match with Charlie Haas as the special guest referee 1:43 8 Big Show defeated Mark Jindrak, Luther Reigns and Kurt Angle Handicap match 9:55 9 Funaki defeated Spike Dudley (c) Singles match for the WWE Cruiserweight Championship 9:29 10 John \"Bradshaw\" Layfield (c) defeated Eddie Guerrero, The Undertaker, and Booker T Fatal four-way match for the WWE Championship 25:36 ==References== ==Other websites== *Official Armageddon 2004 website Category:2004 in American television Category:2004 in professional wrestling Category:Sports in Georgia (U.S. state) Category:WWE Armageddon Category:2000s in Georgia (U.S. state)",
 "title": "Armageddon (2004)"
}