{
 "id": "472886",
 "text": "Armageddon (2003) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It took place on December 14, 2003 at TD Waterhouse Centre in Orlando, Florida. It was the fourth Armageddon event held by WWE. The pay-per-view was a Raw brand exclusive. The main event saw Triple H win a Triple threat match against Kane and then-champion Goldberg. Triple H won the match and the World Heavyweight Championship after he pinned Goldberg following a chokeslam from Kane. Another main match that was on the undercard was Rob Van Dam defending his WWE Intercontinental Championship against Randy Orton. Orton would end up winning the match and he became the Intercontinental Champion after he pinned Van Dam following an RKO. Another primary match that was on the undercard was Batista facing Shawn Michaels. Michaels would win the match by pinfall after he performed the Sweet Chin Music on Batista. The professional wrestling part of Canadian Online Explorer claimed that the event was a \"flop\" and rated the overall event a six out of ten. ==Matches== No. Matches Stipulations Times 1 Rico (with Miss Jackie) defeated Heidenreich Singles match 1:28 2 Booker T defeated Mark Henry (with Theodore Long) Singles match 10:20 3 Randy Orton (with Ric Flair) defeated Rob Van Dam (c) Singles match for the WWE Intercontinental Championship with Mick Foley as the special guest referee 17:59 4 Chris Jericho and Christian defeated Trish Stratus and Lita Intergender tag team match 6:37 5 Shawn Michaels defeated Batista (with Ric Flair) Singles match 12:28 6 Evolution (Ric Flair and Batista) last eliminated The Dudley Boyz (Bubba Ray and D-Von Dudley) (c) Tag Team Turmoil match for the World Tag Team Championship 20:48 7 Molly Holly (c) defeated Ivory Singles match for the WWE Women's Championship 4:23 8 Triple H defeated Goldberg (c) and Kane Triple threat match for the World Heavyweight Championship 19:28 ===Tag Team Turmoil match=== Eliminated Tag Team Entered Eliminated by Time 1 La Résistance (Robért Conway and René Duprée) 2 Rosey and The Hurricane 03:16 2 Rosey and The Hurricane 1 Mark Jindrak and Garrison Cade 03:34 3 Val Venis and Lance Storm 4 Jindrak and Cade 07:17 4 Mark Jindrak and Garrison Cade 3 The Dudley Boyz (Bubba Ray and D-Von Dudley) 11:29 5 Test and Scott Steiner 6 The Dudley Boyz 16:38 6 The Dudley Boyz (Bubba Ray and D-Von Dudley) 5 Evolution (Ric Flair and Batista) 20:48 Winners: Evolution 7 ==References== ==Other websites== *Official Armageddon 2003 website Category:2003 in professional wrestling Category:Sports in Orlando, Florida Category:WWE Armageddon Category:2003 in American television Category:2000s in Orlando, Florida Category:2003 in Florida",
 "title": "Armageddon (2003)"
}