{
 "id": "47312",
 "text": "Ramón Luis Ayala Rodríguez (born February 3, 1976), known professionally as Daddy Yankee, is a Puerto Rican rapper and singer. Ayala is famous for making songs in both English and Spanish, but Spanish is used more than English. == Biography == During his childhood, Ramón grew up with the influence of his family musician, including those of his father and some members of his mother's family. At twelve, he began singing songs inspired by reggae and hip- hop. Ramón wanted to become a professional baseball player, he will have to give up this goal after being shot in a neighborhood brawl when he was seventeen. He received two balls of AK-47, one touched his arm and the other touched him on the level of the right thigh, where he was wounded for life. After this incident, he will take a closer look at the underground rap movement, which was nascent at the time. == Career == He began his career flirting with hip-hop and with Latin rhythms like dancehall, but we can say that his greatest hits will come when he begins to perform and produce his Latin hip-hop songs. He will be one of the first artists to perform internationally in reggaeton music. Ramón invested in the world of reggaeton for thirteen years before experiencing success. He first recorded with DJ Playero, of which he is the featured artist in a production called Playero 37, which will be released in 1992. He has also partnered with artists such as Laurena Snoop Dogg, Nicky Jam, Pitbull, Mey Vidal , DJ Blass, Eric DJ, Eliel, Nas, Tony Touch or members of the G-Unit, Lloyd Banks and Young Buck. His album Barrio Fino is an essential music to the style: it comes from the deepest of his roots of his life but also his personal experience, in the neighborhoods or residential areas of Puerto Rico. The first excerpts from this album are titled Gasolina, King Daddy and No me dejes solo featuring Wisin y Yandel. == Songs == His song, Impacto, released on the album El Cartel: The Big Boss of 2007, appears in the San Juan Sounds radio station's playlist of Rockstar Games' Grand Theft Auto IV and Grand Theft Auto: The Lost and Damned games. In the Grand Theft Auto IV video game, Daddy Yankee lends his voice to the San Juan Sounds station where he acts as a DJ of the reggaeton radio station; the song \"Impacto\" also appears. This is an open- world action-adventure video game developed by Rockstar North. Daddy Yankee's latest off-music project was the release of his Trilogy game, a 3D video game based on Tower Defense games. The game was successfully presented at the New York Comic Con and the 3D action video game impressed young and old alike. It was released on November 29, 2013 and also includes Ayala songs such as \"Gasolina\" and \"Limbo\". In 2017, Daddy Yankee forms an amazing duet with Despacito in collaboration with Puerto Rican singer Luis Fonsi, who is a hit in the world. As an actor he also plays in American movies and series of commemoration Love, Glory and Beauty. On April 28, 2016, Daddy Yankee received the Industry Leader Award at the 2016 Latin Billboard Awards. After a long feud with Don Omar for ten years for the title \"King of Reggaeton\", Daddy Yankee and Don Omar announced in early 2016 at a press conference that they would perform together on stage in a series of concerts entitled The Kingdom World Tour. The announcement of the tour left many fans in disbelief because it sold in minutes in major cities like Las Vegas, Orlando, Los Angeles, New York. The concerts were structured like a boxing match, where the two artists were able to exchange musical tours, and fans voted for their winner in each city via an application designed for the event. \"Two kings, one throne,\" said Pina Records founder Rafael Pina, who had a well-established relationship with both artists and who also came up with the concept of the tour. Speaking of the tour and his rivalry with Daddy Yankee, Don Omar said, \"Let me clarify: I'm not his best friend, and he's not my best friend, but we respect each other. 'to be the best is what drove us to be better'. === Despacito === In 2017, Daddy Yankee, in collaboration with Latin pop singer Luis Fonsi, released the single \"Despacito\". It became the first Spanish-language song to reach number 1 of the Billboard Hot 100 since the song \"Macarena\" in 1996. The single has been a worldwide success. The official video of \"Despacito\" on YouTube was seen the billion times on April 20, 2017 after 97 days, becoming the second fastest video of the site to reach the milestone behind \"Hello\" Adele. His success led Daddy Yankee to become the most-watched artist in the world on the Spotify streaming service in June 2017, being the first Latin artist to do so. In 2017, Daddy Yankee donated $100,000 to the Puerto Rico Food Bank following the damage caused by Hurricane Maria. The money provided food for about 9,000 families on the island. Since October 2017. Barrio Fino and Barrio Fino on Directo have been the seventh and thirteenth best-selling Latin albums in the United States. During his career, 63 songs by Daddy Yankees found themselves in the Hot Latin Songs chart, including 24 in the top 10 and 5 in the first place. Daddy Yankee is the ninth musician with the most singles on Hot Latin Songs. Billboard hot 100 list contains 10 songs of musicians. In August 2018, Daddy Yankee participates in the Janet Jackson video, Made for Now. That same year, Daddy Yankee received an Icon Award at the Latin American Music Awards, and in October 2018, he received the YouTube Creators' Trophy for having more than ten million subscribers on his YouTube channel. The song Despacito by Luis Fonsi and Daddy Yankee, has been inducted into the Guinness World Records 2019 edition for achieving seven milestones, while Daddy Yankee has been recognized for three other records. In February 2021, Daddy Yankee released the single #Problema. In April 2021, Daddy Yankee released the single El Pony. In September 2021, Daddy Yankee released the single Métele All Perreo. == Achievements and recognitions == In February 2019, Daddy Yankee won a Lo Nuestro 2019 award for all of his works (Lifetime Achievement Award). On April 17, 2019, the singer announces that a remix of his hit Con Calma will be released soon featuring with American singer Katy Perry. It is by posting a video on his account Instagram, listening to the remix, that he confirms the rumors. The two artists then followed each other on the social networks and began to make interactions announcing their collaboration. On July 8, 2019, Daddy Yankee presents the HR Derby Champ Medallion Presentation to Pete Alonso after the MLB HR Derby victory. In November 2019, Daddy Yankee inaugurated a reggaeton museum in Puerto Rico, the first of its kind. == Discography == === Studio albums === * No Mercy (1995) * El Cangri.com (2002) * Barrio Fino (2004) * El Cartel: The Big Boss (2007) * Talento de Barrio (2008) * Mundial (2010) * Prestige (2012) * Legendaddy (2022) ==Notes== == References == == Other websites == * Official site Category:1976 births Category:Reggaeton Category:Puerto Rican singer- songwriters Category:Puerto Rican rappers Category:Latin singers Category:Living people Category:Singers from San Juan, Puerto Rico Category:Latin Grammy Award winners",
 "title": "Daddy Yankee"
}