{
 "id": "473116",
 "text": "A salient is a battlefield feature that projects into enemy territory.Edward Samuel Farrow, A Dictionary of Military Terms (New York: Thomas Y. Crowell Co., 1918), p. 531 The attacking troops creating the salient are vulnerable to attack from the front and flanks of the salient. The enemy's line facing a salient is referred to as a re-entrant (an angle pointing inwards). A deep salient is vulnerable to being \"pinched out\" across the base. If that happens the attackers are then surrounded.* This is what happened at the Battle of the Bulge in World War II.Robert E Merriam, Battle of the Bulge (Bennington, VT: Merriam Press, 2007), p. 43 In fortifications, a salient is a part of the defense structure that sticks outward. * note.\" Surrounded\" means the enemy faces you on a 360 degree front .If the \"encirclement\" is not a complete 360 degrees, you are niether \"surrounded\", nor \"encircled\" == Examples == * At the Battle of Gettysburg, during the American Civil War, Union General Daniel Sickles moved his III Corps ahead of the main line of the Union army without orders. This caused him to be nearly cut off from the main army when the Confederates attacked. Sickles had held a similar position at Catherine's Furnace in the Battle of Chancellorsville two months earlier. In both cases his corps was badly mauled and had to be rescued by other units. * At the Battle of Spotsylvania during the American Civil War, Confederate forces constructed a timber-reinforced line of trenches. The trench line bulged forward to protect a piece of high ground. This curve became known as the Mule Shoe Salient. Union troops concentrated their attack on this point. After 22 hours of hand-to-hand fighting they broke through. The Confederates pulled back to a new position. * In World War I, the British occupied a large salient at Ypres for most of the war. Formed as a result of the First Battle of Ypres, it became one of the most bloody sectors of the Western Front. When anyone in the British infantry spoke of \"The Salient\", it was understood that they were referring to Ypres.C. A. Rose, Three Years in France with the Guns: Being Episodes in the Life of a Field Battery (Luton, Bedfordshire: Andrews UK Limited, 2012), p. 21 *A similar salient existed around the French city of Verdun. The Battle of Verdun around it cost both sides heavy casualties. *Also in World War I, the Germans occupied a small salient in front of Fromelles. It was called the Sugarloaf due to its distinctive shape. *In World War II, the Soviet Union occupied a massive deep salient at Kursk. It became the site of the largest tank battle in history and a decisive battle on the Eastern Front. *In World War II, the German Army launched a surprise attack against advancing Allied forces in the Ardennes. It became commonly known as the Battle of the Bulge (also known as the Ardennes Offensive and the Von Rundstedt Offensive). == References == Category:Military terminology",
 "title": "Salients, re-entrants and pockets"
}