{
 "id": "473236",
 "text": "John Leonard \"Jack\" Swigert Jr. (August 30, 1931 – December 27, 1982) was an American test pilot, mechanical engineer, aerospace engineer, United States Air Force pilot, and NASA astronaut, one of the 24 persons who have flown to the Moon. Swigert was born in Denver, Colorado. He studied at the University of Colorado Boulder, at Rensselaer Polytechnic Institute and at University of Hartford. Before joining NASA in 1966, Swigert was a civilian test pilot and fighter pilot in the Air National Guard. After leaving NASA, he ran for Senate but lost in a primary election against Bill Armstrong. He later ran for the Congress for Colorado's new 6th district. Swigert won the election, but died before being sworn in. Swigert was diagnosed with nasal cancer while he was running for Congress. At first doctors believed he would survive after treatment, however he was soon diagnosed with bone marrow cancer after having back pain in August 1982. He died on December 27, 1982 in Washington, D.C. from respiratory failure caused by cancer, aged 51. President Richard Nixon awarded the Presidential Medal of Freedom to the Apollo 13 crew shortly after the end of their mission. In 1995, Swigert was played by Kevin Bacon in Ron Howard's movie Apollo 13. ==References== ==Other websites== *Official NASA biography *Astronautix biography of John L. Swigert, Jr. *Spacefacts biography of John L. Swigert, Jr. *Swigert at Spaceacts *Swigert at Encyclopedia of Science *About Jack Swigert *Congressional Quarterly's Guide to U.S. Elections *Jack Swigert at the Internet Movie Database *Swigert at International Space Hall of Fame *John L. \"Jack\" Swigert, Jr., Award for Space Exploration *America Space: Jack Swigert * Category:1931 births Category:1982 deaths Category:Apollo astronauts Category:American Roman Catholics Category:Deaths from respiratory failure Category:Cancer deaths in Washington, D.C. Category:Scientists from Denver Category:Politicians from Denver Category:United States representatives from Colorado Category:Republican Party (United States) politicians Category:Elected officials who died without taking their seats Category:Deaths from bone marrow cancer Category:Deaths from head and neck cancer",
 "title": "Jack Swigert"
}