{
 "id": "473374",
 "text": "Let's Go Pocoyo is a Spanish animated television series created by Zinkia Entertainment. The series is about a 10-year-old boy named Pocoyo and his friends Baby Bird (a bird), Elly (an elephant), Fred (an octopus), Loula (a dog) and Pato (a duck). ==Cast== * Isobelle Foy as Pocoyo * Stephen Hughes as Narrator ==Filming== The show was filmed sometime in . ===Series overview=== Four series have been produced with 52 episodes. There is also an unreleased episode entitled \"The See-Saw\". This episode was only released in a special version of \"El Show de Pocoyo\" on DVD during 2009. Series 3 is known as Let's Go Pocoyo, with episodes which have different segments. The 1st segment contains one relating to the story and the 2nd part involves stuff like counting, exercising, and learning about shapes. In the end, there is a music video recapping the story. Series 4 consists of episodes similar in the first two series, but now with less audience engagements from the narrator and introduces another human character Nina and her Robot friend, Roberto as the main characters. Originally in YouTube, he first half produced 26 episodes and it became successful. Because of its success, the second half with 26 episodes was produced exclusively on the Spanish children's channel Clan TVE, ABC Kids in Australia, and exclusively in the Pocoyo Party game for the PlayStation 4 and the Nintendo Switch. Since 2016, there are Specials in relation with the holidays each year with few relating to sports. Following the success of Series 4, there are episodes produced as a web series, and both series are exclusively online in YouTube. In \"A Very Special Guest\", a Christmas Special for 2019, Yanko, a giant snow yeti is introduced as a main character. Series 5 will air in 2024. ===Pilots (2002–2005)=== # Pilot (MIPCOM 2002) — Pocoyo and Pato are on a boat ride along the sea. Pato was very nervous and dizzy until a fish came along and they encouraged him a lot, and Pato's nerves calmed down. Then the fish jumped and they learned to count the fish from 1 to 3. Note: It was not publicly available until July 15, 2006, and the only characters featured were Pocoyo and Pato (Originally named “Ducky”). # The See-Saw (Second Pilot) (2005) - Pocoyo has just built a little seesaw so that he and his friend Pato can play together. Unfortunately for both of them, neither of them really knows how the seesaw works, so Elly shows up to help them out with this matter. Things seemed to be going well, until Elly accidentally ends up sending Pato into space when she sits on the seesaw. Can Pocoyo save Pato?(The characters already had their normal appearance) ===Series 1: Pocoyo (2005) === ===Series 2: Pocoyo (2006–2007)=== ===Series 3: Let's Go Pocoyo (2010)=== # Pocoyo's Band (3 July 2010) – Pocoyo has found a box with musical instruments, which contains a trumpet, a drum and a guitar. He wants to play the musical instruments but he needs help. So he calls his friends, Pato and Elly , to form a musical band. They start playing the instruments, but everything sounds very horrible. In the end, Pocoyo teaches his friends to make very simple but nice music. Note: This is the first episode to feature Isabella Foy as Pocoyo and Stephen Hughes as the Narrator. # Picnic (5 July 2010) – Pocoyo, Pato and Elly go on a picnic. But something strange happens, the sandwiches take on a life of their own! But what's going on? Pocoyo, Pato and Elly decide to chase the sandwiches, but they can't catch them, they hide inside the basket, in the trees and in small places. In the end, Pocoyo takes out a magnifying glass and sees that in fact, some bugs, called ants, took the sandwiches, and our friends decide to invite them to their picnic. # Pato's Shower (8 July 2010) – Pato has a towel, soap and a brush, so he's ready to take a shower, but suddenly, the phone starts ringing. Pato answers the phone, but no one answers and when he comes back, his stuff is gone! Pato looks for his stuff and it turns out that his friends have taken his stuff, now Pato must get his things back so he can take a shower. # The Garden (10 July 2010) – Pato is tending his garden when Pocoyo arrives. He also wants to plant a plant. Pato lends him a gardening book so he can follow the steps. Pocoyo ignores the book, so he only manages to grow a ridiculous plant. Pato helps him to get his plant to grow and bloom. # Pato the Postman (13 July 2010) – Pato has to send too many packages and too many letters to all his friends, but he is very tired from sending too many letters. Will our friends help Pato make one last very special delivery? # Colours (15 July 2010) – Pocoyo finds some new, very colorful friends. He wants to show them to Pato, but they are hiding in the blocks of the tower. Will Pocoyo be able to find his new friends? # Ready, Steady, Go! (18 July 2010) – Pocoyo, Pato and Elly take on a challenge to compete in a race. Everything starts off well, but as the race progresses, our friends cheat to get to first place, using vehicles and transport to go faster. # Camping (20 July 2010) – Pocoyo, Pato and Elly have gone camping. When night falls, they play scaring each other with flashlights. What started as an innocent game, everything gets complicated when the classic trio hears a very macabre and sinister noise. What could that noise be? # Space Mission (23 July 2010) – Our friends travel through outer space to bring the little green alien home, but the ship breaks down and they can't control it. Will they survive? Will the Green Alien return to his family? # Travel with Pato (25 July 2010) – Pato has forgotten to bring his luggage! So he needs Elly and Pocoyo to take his suitcase to the airport before he leaves. Will they be able to get his suitcase to him before Pato leaves on his trip? # Playtime (28 July 2010) – Pocoyo doesn't let his friends play with him because he wants to play alone. But then he gets sad and bored. Did Pocoyo apologize to his friends and will he play with them? # Tennis Everyone (30 July 2010) – Our friends are ready to play a tennis match. Caterpillar wants to play, but they think she is too small. Will she be able to show them that she also has the ability to play tennis, despite being so small? # Hide and Seek (2 August 2010) – Pocoyo doesn't understand the rules of the new game he has invented. With our help he manages to understand the dynamics of the game and is ready to find his friends. Will he be able to find all his friends? # Party Time (4 August 2010) – asks Fred to blow up some balloons for a party, but Fred is having a really bad time and not how he imagined. Will Fred be OK? What are our friends up to with a party? # Wheels (7 August 2010) – Caterpillar wants to ride in our friends' vehicles, but they are too big for her. With the help of our friends, Caterpillar will be able to get into each one of them. # Elly's Bath (9 August 2010) – Elly is taking a bath and Pocoyo can't wait for her to get out of the bathroom to play ball. # The Amazing Tower (12 August 2010) – Pocoyo and Pato are fighting over the building blocks and do not want to share them with each other. How can they solve the problem? # Pocoyo's New Toys (14 August 2010) – Pocoyo doesn't know how to play with his friends' new toys. But his friends help him out and Pocoyo finally learns to play with all of them. # Bathing Loula (17 August 2010) – Pocoyo and Elly need to bathe Loula because she is very dirty, but she doesn't let them clean her. What plan will our friends have to help Loula take a bath? # Magic Fingers (19 August 2010) – Pocoyo can do magic and he does it very well. All his friends are going to see Pocoyo's magic show! # Cooking With Elly (22 August 2010) – Without knowing how it was possible, the cake that Elly prepared has fallen and is very damaged. So Elly, Pocoyo and Pato will have to make another cake for our friend Caterpillar's birthday. But in the end our friends will get an unexpected surprise from Caterpillar. # Elly's Market (24 August 2010) – Pato and Pocoyo damage Elly's new market by playing with it. For this reason, they have to repair the damage and return everything to the way it was before. # Pato's Bedtime (27 August 2010) – Pato is ready to sleep in his bed, but Pocoyo prevents Pato from falling asleep and wants him to play with him during nap time. # A Hole in One (29 August 2010) – Elly is playing golf and she is very good at it. Pocoyo tries to imitate her, but since he doesn't know how to play, he cheats to beat Elly. Elly gets angry with Pocoyo, but in the end, Elly teaches him how to play without cheating. # Pocoyo's Camera (3 September 2010) – Pocoyo finds a camera and goes looking for his friends to take photos of them. His friends don't like the photos Pocoyo has taken of them. In the end, they all take much funnier photos together. # Painting With Pocoyo (5 September 2010) – Pocoyo and his friends are painting a still life of fruit. Baby Bird joins in so that his friends can paint it with the fruit, but he starts eating the whole still life. How will they solve this problem? Was Baby Bird very hungry, that's why he ate the fruit? # Playing Dress Up (8 September 2010) – Caterpillar sees her friends playing with some very funny and silly costumes. She wants to wear a costume, but there are none in her size. How will our friends get a costume of the right size for Caterpillar? # Magic Box (10 September 2010) – Pocoyo has a blue box and a red one. He can put things inside them, and after a while they disappear and appear again by magic. # Pocoyo's Restaurant (13 September 2010) – Pocoyo and Elly have set up a whole restaurant, suddenly, Angry Alien gets very hungry and asks Pocoyo and Elly to prepare something for him to eat. # Wake Up, Pocoyo! (15 September 2010) – Pocoyo doesn't want to get up, Pato will try many ways to get Pocoyo to wake up and start his day in style. # Ahoy, Pocoyo! (18 September 2010) – Pocoyo and Pato have become real pirates, Baby Bird and Caterpillar became the piranhas, and our friends and are looking for a treasure chest that will contain a wonderful and incredible treasure for them. # Elly's Computer (20 September 2010) – Elly is playing on her new computer, Pocoyo wants to play ball with Elly, but she is too focused on the video game, so Pocoyo will have to wait for Elly to finish playing. # Going To The Beach (6 October 2010) – Elly is enjoying a sunny day at the beach. She has invited Pocoyo and Pato to come to the beach and keep her company, but Pocoyo and Pato have a better idea: They decide to set up a sandy area to simulate the beach. # Big & Small (8 October 2010) – Pocoyo has a remote control that he can use to turn objects into huge or tiny sizes. He turns his friends' things into the size they didn't want and Pocoyo will have to find a way to fix a problem. # Face Painting (11 October 2010) – Elly wants Pocoyo and Pato to paint a picture of her new doll. Elly will show them which parts they have to draw, paint or colour and how to make the painting look good and perfect. # Supermarket (13 October 2010) – Pocoyo and Pato own a supermarket. Elly calls them to order a bottle, which Pocoyo puts in a basket and delivers to their home. Elly calls again asking for a carton, and then a can. After a few orders, Pocoyo and Pato are exhausted. Finally Elly writes them a shopping list so they can take everything in their cart at once. # Elly's Playhouse (16 October 2010) – Elly has a new and beautiful little house to play in. Suddenly Pocoyo and Pato appear, and cause chaos and end up destroying and knocking down the little house. With Elly's help, we can fix the little house, placing each part in the right place where they should go. # Pocoyo's Puppet Theater (18 October 2010) – Elly and Pocoyo will build a nice little theatre to play with puppets they have found. They have everything ready, they just need one important thing: the audience! # Up & Down (21 October 2010) – Baby Bird doesn't understand the meaning of 2 words: what is up and what is down. Pocoyo is going to explain to him in the easiest way the difference between up and down. He will try in different ways to explain the clear concept of up and down. Will he be able to do it? # Pocoyo's Breakfast (23 October 2010) – Pocoyo doesn't want to eat the breakfast that Elly has prepared for him, so he prefers to see what his other friends eat in the mornings to see if he can find something for breakfast that he likes and enjoys. # Traffic Jam (26 October 2010) – Pocoyo will make his friends respect and know how the different road signs work. However, this does not seem to be easy. # Pato's Living Room (28 October 2010) – Pato's living room has a sofa, a table, a TV and a rug. Pato is preparing to watch TV in peace when his friends burst into his house. But Pato doesn't feel like having company and kicks them out. In the end, he feels sorry to leave them outside and asks them to come back. # Cinema (5 November 2010) – Pato is going to show a movie for his friends, who will be the audience. He shows us the screen, the seats and the projector. Everything starts off very well until the movie gets stuck and the audience laughs. Pato gets angry but his friends manage to get him to sit with them to enjoy the show. # Elly's New Doll (7 September 2010) – Elly has gotten a new doll, which looks weird. Pocoyo and Pato ask Elly's permission to play with her new doll, but in the process they end up breaking it. Will our friends be able to repair Elly's new doll? # Circus (10 November 2010) – Pocoyo, Pato and Elly are setting up a circus with acrobats, jugglers and clowns. The show begins. At first the artists are not very coordinated, but in the end the performances are very funny and the audience has a great time. # The Best Bedroom (12 November 2010) – Elly's bedroom has a bed and a wardrobe full of clothes, Pato's has a bedside table and a lamp, and Pocoyo's has a box full of toys. All 3 friends of them think they have the best bedroom, but which of the 3 friends is the best? # Pocoyo Goes To School (15 November 2010) – Caterpillar and Baby Bird are at school. They have backpacks, notebooks and pencils. Elly is the teacher. Pocoyo and Pato don't want to play with them, they prefer to play ball. But little by little they like what they do at school more and they join their friends. # Art (17 November 2010) – Pocoyo, Elly, Caterpillar and Baby Bird have made an exhibition that brings together different artistic disciplines such as painting, sculpture and photography. Pato plays the role of an art critic and visits the exhibition, but there is nothing he likes. The others ask him to show his artistic skills, and then Pato realizes that making art is not as easy as he expected. # Pocoyo Recycles (20 November 2010) – Pocoyo and Pato find some recycling bins. Elly appears with a bunch of things to recycle: bottles, cans and newspapers. Fred also has things to recycle, but Pocoyo and Pato will have to convince him that it's a good idea. # Down on The Farm (22 November 2010) – Pocoyo, Elly and Pato are in the vegetable garden where they have planted tomatoes, carrots and lettuce. The time has come to pick them and eat them, when suddenly the vegetables start to move on their own. They finally catch them and discover why they were moving. # Nurse Elly (25 November 2010) – Pocoyo doesn't feel like cleaning up and pretends to be sick. Then Elly tells him that he has to go to bed, wear a bandage and take some medicine. Pocoyo will eventually admit that he wasn't sick and will help his friends clean up. # Fishing With Pocoyo (27 November 2010) – Pocoyo and Pato are fishing. They have a net and a rod with a peculiar hook: Caterpillar. They cast the rod and wait. Caterpillar reaches the bottom of the sea and makes friends with a fish. Pocoyo and Pato can't catch anything and they have to go down to the bottom of the sea to see what happens. Note: This is the final episode to feature Isabella Foy as Pocoyo. ===Series 4: Pocoyo (2016–21)=== ====Series 4 – Part One (2016–2017)==== # Holidays – (28 Nov 2016) Our friends are meeting up after the holidays, eager to tell each other about their adventures, but they're exaggerating a bit... Did Pocoyo really eat an entire planet? Who cares! They can all play together again now. Note: This is the first episode to feature Gigi Hatt as Pocoyo. # Christmas Tree – (17 Dec 2016) Christmas is here and Pato wants a decorated Christmas tree. He is unable to cut down an innocent fir tree, but together, with a little ingenuity and a lot of teamwork, they manage to find the perfect tree. Merry Christmas! # Chicks Dig Me – (27 Jan 2017) Pocoyo finds three chicks without a father or mother, so he decides to take care of them. But it is impossible to impose a little discipline and he cannot calm them down. It is better that Pato appears and manages to get these 3 naughty chicks to get things right. # Call Me – (17 Feb 2017) Pato has bought himself a brand new cell phone and is fascinated by technology. But he soon realizes its drawbacks: he can't attend to his friends and be on his cell phone at the same time. Get off your phone, Pato! # Muck Struck – (3 Mar 2017) Ecological disaster: the water is polluted. Pocoyo can't go to bath, Elly can't make her tea and Pato can't water the plants. What could have happened? Our friends set out to clean up the rubbish-filled lake so that the water is as clear as ever. # Nina – (24 Mar 2017) Strange things happen to Pato: the hose stops working and his hat moves by itself. He decides to investigate and discovers Nina, a tiny green girl who lives among the plants with her robot Roberto. Pato, you've made a new friend! # Hack Attack – (14 Apr 2017) Nina doesn't like football and goes off to play another game. Meanwhile, Roberto takes on the role of goalkeeper, but after a treacherous kick from the ball his circuits break down and he goes crazy. Quick, someone fix Roberto! # Hole Lotta Trouble – (28 Apr 2017) Pocoyo, Pato and Elly are playing marbles: with a little aim they have to get them into the hole. But it's not a normal hole, it swallows anything! Even our friends are sucked in. How will they get back to their world? # Great Shot! – (12 May 2017) Pocoyo and Nina are playing tennis, but Pato changes the ball for a basketball. Elly joins in and adds rugby rules. In the end, a simple tennis match has become a meaningless mix of sports. # Disco Fleaver – (19 May 2017) Loula has fleas, so Nina uses her shrink ray to try to get them to leave Loula alone. But it turns out the fleas are having a hell of a party. Will our friends be able to get Loula to stop scratching? # House Of Colours – (9 Jun 2017) Elly has a new house and wants to paint it pink. She asks Pocoyo and Pato for help, but they prefer a different colour. To work as a team, you have to agree! They're sure to paint the house to everyone's liking. # Summer Hike – (30 Jun 2017) Pocoyo, Pato and Nina go on a hike to the top of the mountain to escape the heat. Pato is carrying a huge, heavy backpack that makes the walk difficult... Does he really need a blender? Cheer up, Pato, there's nothing missing! # Bumbleberry Surprise – (7 Jul 2017) It's snack time and our friends go to the forest in search of strawberry berries. They are the essential ingredient for making a delicious cake. But Pato eats the wrong strawberry berry... Nina, help poor Pato! # Are We There Yet? – (21 Jul 2017) Elly wants to make the most of the sunny day and decides to drive to the beach. On the way she meets her friends, who do not hesitate to join the excursion. Stop after stop, the trip is going to be endless... And on top of that, they don't know the way to the beach? # Tourist Trapped – (11 Aug 2017) A group of green aliens have come to Pocoyo World to take some photos of our friends. More and more aliens tourists are arriving. Will they ever get tired? They are everywhere, even in the fridge! # Time After Time Before Time – (8 Sep 2017) Elly has been baking cakes all day, but because of a banana peel everything has gone to hell. Don't worry, Nina has the solution! They will travel back in time to prevent the accident. What could go wrong? # Tiny Fun Park – (22 Sep 2017) The theme park buses are going to be packed, so Nina makes them all tiny. Now any ordinary object can be an attraction! Sometimes plans don't go as expected, but they turn out much better! # Halloween Tales – (13 Oct 2017) It's Nina's first time celebrating Halloween, and no one can come up with a scary story... Nina is brave and not afraid of anything. Suddenly, there's a knock at the door... How scary! Who could it be? # Rock Is A Hard Place – (10 Nov 2017) Pocoyo and his friends have formed a rock band and Fred has prepared a photo shoot. But they are not sure who the leader of the group is... The concert in front of their fans is about to begin. Will they manage to play \"My Love, My Love\" in harmony? # Angry Alien Strikes Back – (15 Nov 2017) The Angry Alien returns to Pocoyo World with a master plan: to impersonate Pocoyo! At first the plan works but soon everyone starts swapping bodies, what madness! And what fun! # Magic Words – (16 Nov 2017) Something very strange is happening to Pocoyo today... Every time the Narrator asks what Pocoyo is playing with, the audience answers something else and Pocoyo's object is transformed. The audience has the power and is also very playful! # Sleep Guard – (18 Nov 2017) Sleepy Bird is getting ready for a nice nap, but Pocoyo won't stop banging his drum. Pocoyo promises to keep quiet and help Sleepy Bird get a good night's sleep, but it's much more tiring than he thought... # Insert Coin – (19 Nov 2017) The Angry Alien returns to Pocoyo's World and kidnaps Daisy, Elly's doll. In response, Elly asks Pocoyo for help, who turns this rescue into a video game, complete with a final boss! It's so easy to ask for things please. Will Pocoyo be able to rescue Daisy from the Angry Alien's hands? # Space Postal Service – (8 Dec 2017) Postman Pato is back and has a new mission: deliver a package to the Green Martian. It seems like an easy task, but the Green Martian has moved to another planet and Pato doesn't know the new address. You can do it, Pato! # An Alien Christmas Carol – (15 Dec 2017) A long time ago, on a far away planet, the Angry Alien was enjoying his first Christmas with his father, but because his father had duties on a secret mission, he had to leave a little Angry Alien alone, who very sad, ended up playing alone, accidentally destroying his Christmas tree, he found happiness in destruction. Many years later, when he saw Pocoyo and his friends' Christmas tree, he felt jealous and tried to destroy the presents, but in the end he would end up finding something bigger than a present. # Dance Off Part Two – (22 Dec 2017) Elly and Nina delight us with a synchronized dance. Pocoyo and Pato enter the scene and challenge them to a dance duel. Who will be the best dance partner? Even Roberto joins the party, let the rhythm not stop! ==== Series 4 – Part Two (2020–2021) ==== # The Grand Final – Pato and Elly are playing a very close basketball game. Pocoyo, seeing how much fun his friends are having, wants to try playing too, but quickly discovers that he's terrible at basketball. Elly and Pato try to teach him how to play, but Pocoyo just isn't made for it, so they decide to ignore Pocoyo and play alone. This doesn't sit well with Pocoyo, who starts interrupting Elly and Pato's game as a way to let off steam. # Slippery Pato – Pato has just had his morning shower, so he decides to put on some oil to moisturize his feathers, but this time Pato oils himself up a bit too much. This causes Pato to become very slippery. Pato doesn't seem to mind this and even enjoys his new slipperiness, but Pocoyo and Elly find this situation very annoying, since they can't play with Pato in the normal way, so they decide to leave Pato alone. Although Pato pays no heed to it at first, he soon finds himself involved in a dangerous situation where his friends must help him. # The Dino Box – Pocoyo has managed to create a box that can turn whoever enters it into a dinosaur. Pato is incredulous at such a claim, so Pocoyo challenges him to enter it, Pato does so, which causes him to start behaving like a dromaeosaur, so Pocoyo takes him as his pet, but soon discovers that having a dinosaur as a pet is a very difficult task. When things seemed like they couldn't get any worse, Elly also ends up turned into a Dinosaur, so it's Pocoyo's job to return his friends to normal, as they are causing chaos in Pocoyo World. # Pirates – Pocoyo discovers a pirate ship while playing. When he goes to investigate it, he discovers that it belongs to Pato and he doesn't want Pocoyo to play on it, but Pocoyo decides to get on the ship and claim it as his own. Pato doesn't like this at all, and decides to throw Pocoyo off his ship by force. This starts a pirate fight between Pocoyo and Pato to take control of the ship. This fight spreads throughout the ship, causing great damage to it. Which will lead to this incessant fight having an unexpected end. # The Pink Perfume – Elly receives a package containing her favorite perfume. Elly's perfume is made from flowers that are hard to find and Elly doesn't use her perfume too much so as not to waste it and over-consume it. After Elly leaves the perfume on a table and leaves the Narrator in charge of taking care of the perfume, Pocoyo appears and he takes Elly's perfume. Pocoyo starts to spray perfume on everyone, even on non-living objects. Elly gets sad because someone used her perfume without her permission and wasted it all. Seeing this, Pocoyo finds a solution to reverse this problem. # Robot Pocoyo – Pocoyo has become a very good robot and he knows how robots work. Some of Pocoyo's friends find it funny and others don't. Pocoyo interrupts Sleepy Bird's nap because he's jumping around, Pocoyo takes away the flower pot that Pato was watering, Pocoyo destroys Elly's picnic and then picks up the whole picnic. Octopus gets angry with Pocoyo because he sees that he's become a robot. The Pocoyo robot keeps destroying things, knocking down the block tower that Elly and Pato were making. There's a fight between the classic trio from the series, but in the end everything works out. # Pato's Phone – Pato has been very strange lately, since he never leaves his phone behind. Pocoyo notices this and together with Elly they are going to try everything to try to separate Pato from his phone. Unfortunately, everything they try doesn't manage to get Pato's attention. All seems lost for Pocoyo and Elly, until they both come up with a great idea that not even Pato will be able to ignore. Note: This May be a sequel to “Call Me”. # Fancy Dress Party – Pato, Pocoyo, Elly and the rest of our friends have received an invitation to go to a costume party, where a prize will be awarded for the best costume. Pato is very confident, because he thinks he has the prize in his bag, because he has always been the best at dressing up. Although Pato was initially confident of himself, when he sees that all the costumes he is wearing are already being worn by someone else at the party, Pato starts to get very nervous, to the point where he has a mental breakdown and loses all desire to go to the party. Pocoyo and Elly notice that Pato is missing from the party, so they decide to go look for him to find out what happened. When they get home, they see that Pato is sad in a corner, so Pocoyo and Elly look for a way to make him feel better. # Strike! – Pato has been bowling for quite a while and has proven to be good at it. When Pocoyo and Elly want to go bowling, Pato laughs at them because they have never played this game, but the truth is that Pocoyo and Elly, despite not having much experience in this game, are very good at bowling, which makes Pato very upset. Pato wants to knock down a couple of pins to get his skill back, but ends up frustrated and stressed to the max. Pocoyo and Elly give him a new hat to cheer Pato up. # Let's Tidy Up – Elly and Pocoyo leave Pato's room and leave everything disorganized, which is why Pato must leave everything organized. When Elly and Pocoyo return to the room to play again, Pato will not allow them to play because they have left his room disorganized, another reason why Pato tells Pocoyo and Elly to leave the room, but they will not allow it and will try to make more mess in the room. The story will repeat itself until Pocoyo and Elly find out that having mess in the bedrooms is bad and they go to organize Pato's bedroom. # The Balloon – Nina was happily strolling around Pocoyo World with her balloon when she comes across Pato and Pocoyo, who were having an argument, but when the boys notice her presence, they are amazed by her balloon, so they ask Nina if she lets them play with it. Nina is opposed at first, but Pocoyo convinces her, telling her that nothing bad will happen. Just when Nina gives Pocoyo her balloon, he and Pato start fighting over the balloon, which causes it to fly away into the atmosphere. Nina becomes understandably upset and demands that they go look for her balloon, so Pocoyo and Pato embark on a journey through space to recover Nina's balloon. # The Silence Challenge – Pocoyo, Pato and Elly challenge the Narrator to see how long he can go without saying a single word, not even a peep. They challenge him because they have noticed that he is very talkative and overly talkative. The Narrator will try to pass the test, but our friends will put obstacles in his way so that he will have to say words and he will lose the challenge. When the Narrator sees that he is very talkative, he wants to leave, but our friends do not want him to leave. # Overprotective Roberto – After Nina falls and hurts her knee, Roberto is determined to protect Nina, so protective will he be that he won't let Nina play with Pocoyo, Pato and Elly. In activities where there aren't even ways to get hurt, Roberto will protect Nina and look for alternatives in doing things so that Nina doesn't get \"hurt\". Soon Roberto will go overboard with the protection and Nina will get fed up with him, but in the end they can sort this mess out. # Pocoyo's Car – Pocoyo finds a stroller inside a box of old toys. When he climbs into the stroller, it's too small for him, but that doesn't matter. When Pocoyo sees his friends playing with the ball, he wants to play, but at the end of the game he punctures the ball with one of the car's tires. Elly, Pato and Nina get upset and walk away from him to play other things, but Pocoyo wants to play with them and only causes chaos. In the end, Pocoyo opens up to them and they all go to play with their real cars. # Inventions – Pocoyo and Nina have been invited to a hot dog party by Pato and they couldn't be more impatient to attend, but before they can go to the party, they must finish their homework first, since they promised several of their friends that they would help them that same afternoon. So Pocoyo and Nina will start creating inventions to be able to help their friends as quickly as possible and so that they can all go to the party. However, nothing is that easy, since the inventions don't turn out as they would expect. # My Hero – While Pocoyo is heading to the golf course to have a game with Pato, he meets Caterpillar, who is stuck in one of the holes on the course, Pocoyo selflessly helps her, which causes Caterpillar to see Pocoyo as her savior and hero. While at first everything seems to be going well with Caterpillar encouraging Pocoyo to win the golf game, things quickly get out of hand when Caterpillar starts cheating in the game to get Pocoyo to win the game. # The Rescue – Pocoyo notices that his friend Caterpillar is trapped high up in a tree, with no way of getting down, so Pocoyo calls Elly and Pato to help him come up with a plan to rescue Caterpillar. Each one comes up with a different plan, but each one fails, reaching the point where the three friends end up having an argument about who is to blame. Caterpillar, seeing this clear display of ineptitude on the part of her rescuers, decides to do something that no one saw coming. # Pocoyo's Friend – Pocoyo has been doing some very strange things lately, as Elly and Pato have noticed because they have seen him very strange. Well, Pocoyo has been playing with his new friend, who Pocoyo can only see because he is invisible, but Elly and Pato cannot. Elly and Pato think that they have lost their best friend Pocoyo, so the two have different plans to keep Pocoyo away from his invisible friend. It is a bit difficult, but in the end Pato and Elly manage to get Pocoyo to play with them again and be friends again. # Elly's Picnic – Elly is preparing to have a picnic in the countryside with Pocoyo and Pato, but before they can enjoy the snacks, Nina shows up to join them on their picnic. Elly, Pato and Pocoyo agree to this, but before they start, Nina says that she has brought something very special with her. Her friends are intrigued by this. Nina finally reveals that what she has prepared are her friends, the ants. Pocoyo, Elly and Pato flatly refuse to let the ants join the picnic, so they ban Nina from it. Thus, a war for control of the picnic begins. # Nina Discovers the World – As Nina happily walks along, she discovers something surprising that she has never seen before: a telephone. Nina, confused, tries to figure out what the mysterious device is, but when the phone starts ringing, Nina runs away in terror. The Narrator manage to calm Nina down and she goes back to inspect the phone. Just then Pocoyo arrives and gladly shows Nina what a phone is and how it works. Nina is very impressed by this and takes Pocoyo by the hand and takes him to different places to show him other objects that she doesn't know about, such as a radio. Everything seems to be going well until Pocoyo and Nina come across a vacuum cleaner, which Pocoyo doesn't know what it is, but in order to impress Nina further, Pocoyo pretends to know how it works, which will lead him to cause big problems for Pato. # The Remote Control – Pocoyo and Pato want to watch TV shows together, but they start to have a bad time. This is because each one is changing the program for the one they prefer and this leads to them starting to have a fight. Soon Pocoyo and Pato discover that the TV remote can do much more than just change the channel, since they can change the colors of objects with the remote and pause some characters. Pocoyo finds it funny, but the Narrator will soon tells him that everything is wrong. # The Tennis Racket – Pato, Pocoyo and Elly are on the tennis court to play a friendly tennis match. Elly knows the rules of the game, but Pato and Pocoyo don't know anything about the rules of tennis. Well, they don't seem to know anything about tennis because they don't even know how to use rackets. They use them as if they were guitars. As time goes by, Pato and Pocoyo start to play tennis in their own way. There comes a time when Elly doesn't agree with this way of playing. Pato and Pocoyo try to convince Elly to play, at first it doesn't go well, but finally Elly decides to play. # Nina The Dog Trainer – While Pocoyo is trying out some tricks with his dog Loula, Nina appears very impressed by the tricks Loula can do, so she asks Pocoyo if he'll let her take care of Loula that afternoon. Pocoyo is hesitant about this, since Nina has no experience with dogs, but the Narrator tells Pocoyo to let her, because after all, what could go wrong? Pocoyo agrees, but before he can tell Nina that she must use special cards to learn how to command Loula, Nina runs away in excitement with Loula, knocking over Pocoyo's cards in the process. Nina now only has one goal: to show her friends what a good trainer she is. # Prank Day – It's Prank Day in Pocoyo World and Pocoyo knows it, as he has a ton of pranks planned for his friends. Giving Elly a good scare, getting Pato wet and confusing Nina, not even the Narrator can escape Pocoyo's pranks. His pranks are so good that even his friends applaud and congratulate him, but that doesn't mean they'll sit back and do nothing, as it's Prank Day and anything goes. # I Don't Want to Go to Sleep – It's already nighttime, and Elly and Pato are getting ready to sleep, since it's already late, but Pocoyo still has a lot of energy and refuses to go to sleep, so he stays up all night playing alone. The next day, Nina arrives to have a fun day with her friends, but while Elly and Pato are full of energy, Pocoyo is very tired and sleepy, but despite his friends' suggestions for him to go to sleep, Pocoyo refuses, causing this day of games to become very interesting. # Winter Games – It's winter time in Pocoyo World and the Winter Games have begun, a competition to find the best competitors in Couples. The couples are Elly and Loula, Nina and Roberto, and finally Pato and Pocoyo. Everything seems to be going as planned, but suddenly our good friend Yanko arrives, who upon learning that the winter games are about to begin, wants to participate, but that's not possible, since the couples are already full. Pocoyo, seeing the situation, decides to take Yanko as his new partner, because Yanko was a better option than Pato. Pato gets very upset, because now he has no one to participate with, but just then Caterpillar arrives and she agrees to be Pato's new partner. Now everything is ready to start the competition, who will win? # Dragon Island – Me, seeing that Pocoyo is very bored, decide to tell him an intriguing story to captivate his imagination. He is soon joined by Elly and Pato, who are intrigued by the story. The story says that there is a dragon on an island in the Atlantic, who will only appear to those who find its tail on the island. This captivates Pocoyo so much that he decides to embark on an epic adventure to unknown lands to find the dragon. This episode features a hybrid animation between 3D and real shots. ===Specials (since 2016)=== # Crazy Inventions (Halloween special 2016) – After Pocoyo tried Pato as his volunteer to show us a teleportation machine, Pato is trapped in an unknown world. What can we do to rescue Pato? # Easter Eggs (Easter special 2017) – It's Easter in Pocoyo World and our friends Pocoyo and Pato are searching for Easter eggs in the countryside when they suddenly come across something very unusual: a huge Easter egg-themed slide. Pocoyo and Pato are eager to try out this mysterious slide, with Pato being the first to go down, but something strange happens when he crosses the middle egg. Pato has turned into an egg! And to make matters worse, Elly also goes down the slide, ending up in egg form too. Now Pocoyo, along with Nina, Roberto, and Yanko, must return our egg-themed friends to normal. Will they succeed? # Pocoyo and Nina's Terror Show (Halloween special 2017) – Pocoyo and Nina have prepared a puppet show to scare all their friends. However, their friends find the show very funny and trite, not showing the slightest feeling of fear. At this point, Pocoyo and Nina proceed to execute plan B. They begin by turning off the lights and putting on some macabre music, only for two very terrifying skulls to appear on stage, leaving the audience trembling with fear. Everything seems to be going well for Pocoyo and Nina, but everything takes an unexpected turn when neither of them knows where the skulls came from. # Nina's Easter Day (Easter special 2018) – Nina doesn't believe Easter eggs are made of chocolate and is determined to prevent Pocoyo, Pato and Elly from eating them. # The Big Soccer Match (FIFA Soccer World Cup 2018 special) – Nina was walking peacefully until she found a field where Pocoyo, Elly, Pato, and some pink Martians were playing a soccer game. Nina wanted to play a little soccer, but the trio mocked her, seeing that Nina couldn't even pass a ball. Roberto taught Nina several techniques to become a professional soccer player. Nina also put together her soccer team to take on Pocoyo's team. # Pocoyo and the Haunted House (Halloween special 2018) – Our friends run into some very scary ghosts while celebrating Halloween in a haunted mansion, but far from scaring them, the ghosts have a better idea: to dance and enjoy Halloween together. # You Are Welcome for Thanksgiving (Thanksgiving Special 2018) – Pocoyo and Nina run into Fred, who is preparing a delicious meal for Thanksgiving. However, Pocoyo and Nina don't know what Thanksgiving is, and Fred explains that it's a day when we give thanks to all our loved ones. Pocoyo and Nina get very excited and decide to thank their good friend Pato. Unfortunately, Pato doesn't take so much thanks very well. # Pocoyo's Christmas Carol (Christmas special 2018) – Pocoyo and his friends are playing in the snow, specifically with a ball. Pocoyo and Pato have an argument that goes on for quite a while, as they never stop arguing. To stop this absurd argument, Elly decides to tell them the story of Mr. Scrooge, which will give them much to think about, but even then, Pocoyo and Pato don't stop arguing. What plan will Elly have to stop this argument? # The Easter Rabbit (Easter special 2019) – Pocoyo, Pato, and Nina were preparing their eggs for Easter when they disappeared overnight. Pato is furious about this and tries to find the thief at all costs. Luckily, Roberto finds suspicious footprints near the crime scene. Now our friends must follow various clues to find their eggs, which were stolen by a mysterious Easter thief: a light blue bunny! # Halloween Potion (Halloween Special 2019) – Halloween is here, and we can't celebrate it without releasing a special episode dedicated to this holiday. Pato, Pocoyo, and Caterpillar are dressed in their costumes. Pato is dressed as Dracula, Pocoyo as Frankenstein, and Caterpillar is not wearing a costume. The gang eats pumpkin soup, which everyone likes, except for Caterpillar, because when she eats the soup, she turns into a terrifying monster. Every time Pato sees Caterpillar transformed into a fearsome monster, he gets extremely scared and hides from the monster. Pato tries to tell Pocoyo and Elly what's happening to Caterpillar. They don't believe him at all, but sooner or later, Pocoyo and Elly will believe Pato. # A Very Special Guest (Christmas Special 2019) – Elly, Pato, Caterpillar, and Baby Bird are preparing the big Christmas feast. Meanwhile, Pocoyo is riding in his sleigh while it is being pulled by Loula. On the way, the Christmas tree decorations get lost, so Pocoyo must go find them. While Pocoyo searches and collects them, he meets someone with whom he makes a new friend: the Yeti Yanko! Pocoyo takes him to where his friends are so they can meet him and become new friends with the yeti, but they are scared by this big creature. Pocoyo will try to convince his friends not to be afraid of this yeti. # Caterpillar's Egg (Easter Special 2020) – Easter has arrived in Pocoyo World, and Pocoyo, Pato, Elly, and Caterpillar are getting everything ready to celebrate Easter. Our friends are painting the eggs in very original and curious ways. After painting the eggs, they have to hide them. The search has begun. Everyone has already found the eggs, except for Elly, who hasn't found Caterpillar's egg. Elly seems to have found the egg, but Caterpillar tells her that it's not her egg. Where is Caterpillar's egg? # The Reflection (Halloween Special 2020 I) – One of the most celebrated holidays of the year has arrived: Halloween. Everyone has dressed up. Pocoyo dresses up as a witch and starts practicing his scares to scare his friends and get some candy. Unintentionally, Pocoyo casts a spell and his reflection pops out of the mirror. Pocoyo's Reflection is just like him, but much more mischievous. The Reflection plays its tricks, scaring Pocoyo's friends with a couple of spells and some real scares. When the reflection has stopped scaring his friends, Elly, Pato, and Fred start accusing Pocoyo of being the one causing the scares. Soon the gang realizes that the reflection really exists and must find a way to return it to the mirror. Will they be able to complete the mission? # Elly's Wand (Halloween Special 2020 II) – Elly, Pocoyo, and Pato are performing magic tricks using a cauldron. Elly needs an apple for the potion she's making, but she doesn't have any. So, Elly goes to look for an apple to get the missing ingredient for the potion. She tasks her helpers, Pocoyo and Pato, with watching the cauldron while she looks for the apple. Bad things happen, as Pocoyo and Pato cause a magical explosion when a jar falls to the floor, causing the explosion. The worst is yet to come, as Pocoyo and Pato lose Elly's magic wand. Pocoyo and Pato see Caterpillar take the wand. The 2 friends try to get the wand back, but Caterpillar refuses to let them catch her. Will Pato and Pocoyo be able to get the wand back before Elly realizes what happened? # Space Christmas (Christmas Special 2020 I) – The Angry Alien is happy spending Christmas alone on his planet. Pocoyo, Elly, and Pato go to visit space; more precisely, they arrive at the planet where the Angry Alien lives to share his Christmas spirit and spend Christmas with him. While Pocoyo, Elly, and Pato invade Alien's personal space, he goes to another planet where he can be alone, but our friends chase him. It won't take long for the Angry Alien to start acting bad, but Pocoyo soon calms him down by giving him a gift as part of the Christmas celebration. What will be in the gift? # Christmas Far from Home (Christmas Special 2020 II) – Christmas has arrived in Pocoyo World and our friends are wearing their Christmas hats. Pocoyo, Elly, and Loula are going on a trip because Yanko has invited them to spend Christmas with him. When Pocoyo, Pato, Elly, and Loula are already at the snowy places, they discover that everything is not going as they had planned and imagined, because it is very cold and they slip because they are walking on slippery ice. Not only is this happening to them, but when it comes time for lunch, there is no delicious food, because there are only raw and frozen fish and cookies that seem rich and delicious but are not. Soon our friends will do activities in the snow such as sledding, throwing snowballs, among others, in which they will have a great time. # Easter Eggs Surprise (Easter Special 2021) – While Pocoyo, Elly, and Pato were explaining to the Narrator what they had done, the Easter eggs they had disappeared. Pocoyo sees that there are clues that could lead to the Easter egg thief. As the trio follows the clues, they encounter possible suspects like Nina, Fred, and Caterpillar, but none of them mentioned have stolen the eggs. Mysterious clues lead to the tree where Sleepy Bird's nest is. Could Sleepy Bird be the one who stole the eggs? # Pocoyo's World Sports Games (Tokyo 2020 Olympics Special) – Pocoyo World is celebrating a sporting event called \"Pocoyo World Sports Games,\" where the inhabitants of Pocoyo World compete in different disciplines to see who is the best athlete in Pocoyo World. This time, Pocoyo participates as a judge, but things go wrong, as Pocoyo is unable to reward the athletes fairly, letting himself be carried away by what he thinks is best. # Angry Alien's First Halloween (Halloween Special 2021 I) – Angry Alien has come to Pocoyo World with the intention of conquering it for the umpteenth time, but this time something's strange, because Pocoyo World is even more terrifying than usual. It turns out that Angry Alien arrived in the middle of Halloween and everything scares him. Can Angry Alien survive Halloween? # Pocoyo's Scary Halloween (Halloween Special 2021 II) – Pocoyo, Pato, Elly and Nina get ready to dress up for Halloween night. Elly and Pato dress up with some very scary masks, while Nina has problems because her ghost costume is not scary, so she decides to go and create another one, leaving Pato and Elly alone. Pocoyo takes advantage of this, since he has something macabre planned, calls the Chihuahua Brothers and tells them to play a scary joke on Elly and Pato. At first everything seems to go according to plan, but everything takes an unexpected turn when Elly and Pato return the scare to the Chihuahua Brothers. # The Day of the Dead (Day of the Dead Special 2021) - It's the Day of the Dead, and Pato is very sad because he's just found an old book his grandfather used to teach him to read. Seeing Pato so sad, his friends, especially Nina, decide to help him by creating an altar to honor his grandfather's memory. Pato is very satisfied, but the celebration isn't over yet; thanks to the catrina (Nina), a very special person comes to visit Pato that night. # Christmas.. at the Beach? – (Christmas Special 2021) – Yanko has prepared a very special dinner to welcome his parents. Pocoyo, Pato, and Baby Bird plan to celebrate Christmas on the beach with Yanko. The three of them go through the snow to take Yanko to the beach. Yanko doesn't think this is a good idea because he misses his parents and doesn't like this different way of celebrating Christmas. Yanko tries to explain his situation to Pocoyo, but he pays no heed. Soon, the Narrator explains Yanko's situation to Pocoyo. He finally understands that Yanko was missing his parents, so they go back to the snow. # The Goblin Mask (Halloween Special 2022) – Pocoyo, Pato, Elly, and Nina are celebrating Halloween. Nina is wearing a goblin mask as her Halloween costume, but the mask is alive and causes her to lose control and eat her friends' candy. Will they be able to help Nina get rid of the mask? # Elly's Auntie Phantie (Day of the Dead Special 2022) – Elly has made a very special altar in honor of her Auntie Phantie, who misses her a lot, and since it's the Day of the Dead, Pocoyo, Pato, Baby Bird, and Caterpillar start taking things from Elly's altar without Elly's permission. Elly will do everything possible to prevent her friends from continuing to take things from the altar. Something beautiful will happen in the end: Auntie Phantie appears. To make her appear, our friends took things to make her come. # Christmas Stakeout (Christmas Special 2022) – Pocoyo, Pato, and Nina want to solve a mystery. The mystery is about who brings the Christmas presents. All three have their own beliefs. Pocoyo believes that the presents are brought by Santa Claus himself, but Nina believes that the presents are brought by the 3 Wise Men, and Pato has a rather strange belief: he believes that the presents will be brought by a gift-delivering robot. To solve the mystery, the characters get organized and watch the tree. Each one prepares things that will attract Santa Claus, the 3 Wise Men, and the Gift-Delivering Robot. # Egg-cellent Friends (Easter Special 2023) - It's Easter in Pocoyo World and our friends Pocoyo and Pato are searching for Easter eggs in the countryside when they suddenly come across something very unusual: a huge Easter egg-themed slide. Pocoyo and Pato are eager to try out this mysterious slide, with Pato being the first to go down, but something strange happens when he crosses the middle egg. Pato has turned into an egg! And to make matters worse, Elly also goes down the slide, ending up in egg form too. Now Pocoyo, along with Nina, Roberto, and Yanko, must return our egg-themed friends to normal. Will they succeed? ===Webisodes (2019–2023)=== A webisode (\"web\" and \"episode\") is an episode of a series that is shown as part of a web series or on streaming television. # Space Holidays – (21 Jun 2019) – Elly, Pocoyo, and Pato embark on a grand journey through space, as Elly has organized a vacation for everyone, during which the trio will travel and visit different planets. Things get complicated, as Pocoyo wants to spend time in the mountains, while Pato wants to go to the beach. Elly tries to calm her friends down and get them to explore the different planets, but her friends refuse, making the vacation anything but relaxing. # Back to School – (23 Aug 2019) – Back to school has begun, and our friends know it. They're excited to be going to school, except for Pocoyo, who refuses to go to class. He makes excuses like not having a backpack, not having school supplies, or not having a sticker. Luckily, his friends give him everything he needs to go to school, but even so, Pocoyo doesn't feel like going to school. Will Pocoyo realize that going to school is fun? # World Domination on Ice (13 Dec 2019) – Angry Alien has arrived at Pocoyo World with the intention of conquering it once again. Unfortunately for him, he arrives in the middle of winter, and the entire planet is covered in snow. This, combined with Yanko's presence, makes Angry Alien's mission even more complicated, as he finds himself overwhelmed by the circumstances. Will Angry Alien be able to achieve his goal? # Dinosaurs – (17 April 2020) – Pocoyo plays with some plasticine dinosaurs, so when he wakes up Sleepy Bird, he decides to play with Pato, Pocoyo gave Pato a big scare and tells him to play with him with dinosaurs, and that if he doesn't play, Pato will be a scaredy-cat. Pato plays dinosaurs with Pocoyo and they wake up Sleepy Bird again and decide to scare Elly, when they scare her, Elly decides to play, and during her nap, Sleepy Bird was listening to relaxing music, had some blindfolds and headphones. Pocoyo, Elly and Pato wake Sleepy Bird up, Sleepy Bird gets very upset but decides to play that game being the meteorite that finished off the dinosaurs. Once and for all, Pocoyo, Elly and Pato run from the scare and finally Sleepy Bird gets his nap. # Formula Pato – (26 June 2020) – Pocoyo, Pato, and Elly are going to compete in a big car race, so they're preparing their vehicles for the race. Pato has ordered a new engine to put in his green car. When Pato puts the engine in his car, something unexpected happens: His car has come to life! Pato thinks that having a good car will help him win the race, but he soon realizes that the car just wants to play with the others and have fun. What will happen to Pato? Note: This episode is a promotion to Pocoyo Racing for the mobile. # The Colouring Book – (4 September 2020) – Pocoyo is quietly reading a book to learn colors, but this isn't just any book. Every time Pocoyo turns the pages, he and the rest of the world change color depending on the color shown in the book. Pocoyo shows this curious fact to his friends, and they are fascinated, except for Pato, who wants to be his usual color. When Pocoyo, Elly, and Pato start fighting over which color they want, they begin to have a bad time. The fight is so intense that the colors merge, and after a few seconds, they turn gray. Note: This episode is a promotion to the release of Pocoyo Colors App. # The Ball Orchestra's Party – (25 September 2020) The Ball Orchestra has invited Pocoyo, Elly, and Pato to a party where the orchestra will play some peculiar and beautiful music. To get to the venue, our friends will have to decipher and pass several tests to unlock the path to the celebration. Pocoyo, Elly, and Pato will find themselves in a very strange virtual world, a place filled with music, and they'll have to be instrumental in advancing until they reach the party. # The Videogame Party – (16 April 2021) – Spring has arrived, and Nina is amazed by the enormous amount of life and flowers there. She shows it to her friends, and they are thrilled. Everything is so beautiful that Pocoyo proposes a party to celebrate this moment and invites the entire cast of the series. Everything seems great, but the happiness ends when the Angry Alien discovers that our friends are having a party, and he is determined to ruin it. The Angry Alien has arrived in Pocoyo World and is going to destroy the party, but his plans don't go as planned, so he steals the invitations. Pocoyo, Pato, Elly, and Nina must recover the invitations using a very peculiar method. Note: This episode is a promotion and follow up to Pocoyo Party for the PlayStation 4 and the Nintendo Switch. # The Treasure Hunt – (30 July 2021) – Pocoyo has found a treasure map in a bottle. He, Pato, and Elly are determined to find the treasure. To find it, they'll have to go through various places to reach the end of the path where the treasure is. The 3 pirates will have objects to guide them: Elly has a compass and Pocoyo has a spyglass. The treasure hunt will be somewhat long; they'll first have to go through the sea, where they must avoid Fred, who will do everything possible to prevent them from opening the chest above Whale. The journey continues; the best part is at the end, where the three pirates must avoid Angry Alien, who tries to protect the treasure but accidentally helps them. What will the final treasure chest contain? # Yanko's First Day – (13 August 2021) – It's time to go back to school, and Pocoyo, Pato, Nina, Baby Bird, Caterpillar, and Yanko have their school supplies and are ready to go back to school and attend classes, except for Yanko, who is afraid of entering school. When Yanko enters school, he is very shy at first, but little by little, our friends will integrate him into the classroom, and Yanko will gradually lose that fear he has in his heart. # The Top Hat – (21 January 2022) – Fred is in a hurry because he's going to be late for his upcoming magic show. Before Fred leaves for the show, he'll show us a couple of magic tricks. After these magic tricks, we discover that Fred is a great magician. In his rush, Fred accidentally leaves his top hat behind. Pocoyo and Pato are so curious that they can't hold back their urge to play with it. When they use it, it transports them to alternate, virtual places. The audience is very upset with Fred because he hasn't performed the incredible magic tricks he should have been doing. Can Pocoyo and Pato return the top hat to Fred before the audience becomes demanding? # The Universe-Changing Remote – (25 February 2022) While trying to get a ball down a tree, Pocoyo and Pato come across a mysterious black remote with a red button. When Pocoyo or Pato press the button, they change the physical laws of the universe. Not only can they change the laws of gravity, they can also swap bodies. The Narrator tries to tell Pocoyo and Pato to stop playing with that remote, but they don't pay attention. Very soon, things are getting more out of control than expected. It wouldn't take long for the remote to fall apart, which makes the Angry Martian very sad. Will Pocoyo, Pato, and Elly be able to fix the remote? # The Bee – (18 March 2022) Pocoyo, Pato, and Elly are playing ball in the park. As Pocoyo kicks the ball, it lands in the flowers. When Pato retrieves the ball, he finds a bee. The bee is harmless, but Pato gets scared. Pocoyo and Elly are also scared by the bee. Pocoyo, Elly, and Pato run away from the bee, but the bee follows them wherever they go. The trio have plans to hurt the bee, but the Narrator tells them not to do that. # What is a Cow? – (22 April 2022) While Pocoyo, Elly, and Pato were playing outdoors, they found a little chick. The little chick is very sad because he got lost and doesn't know where his home is. His home is the farm, and his friend Cow must be missing him a lot. Pocoyo, Elly, and Pato are ready to take the chick back home, but they don't know what a cow is. The little chick explains the meaning of cow to them. The trio mistakes Sleepy Bird, Whale, Loula, and other objects for a cow. Soon, our friends discover the sound of a cow, so they begin to imitate the sound to attract the cow and help the chick. # All Aboard the Train – (27 May 2022) Pocoyo and company are going for a train ride. Pocoyo is the driver and the ticket inspector, who must check that the passengers have their tickets. The trip will be accompanied by the gang of balls, another train with Fred as the driver, tunnels, and a long walk where we'll discover and learn many new things. # Fireman Pato – (17 June 2022) Pato has become a firefighter for a day to save the characters in danger in Pocoyo World. Initially, he has many emergencies in which the cast needs the help of a trained person, and that is, a firefighter. As time goes on, Pato starts making things difficult when in reality they were easier than he imagined. Unexpectedly, an event occurs in which Pocoyo, Elly, and Loula are in great danger and need the help of Pato, the firefighter. Can Pato help Pocoyo, Elly, and Loula get down from the rocky mountain they are on? # A Viking Adventure – (8 July 2022) Pocoyo is reading a book about Vikings. He likes Vikings so much that he decides to become one to defeat the fearsome Kraken (Fred the Octopus). Elly and Pato join him on the adventure. The trio will sail the seas on the boat where they will live adventures with harmless sharks and Sleepy Mermaid Bird. The trio encounters the dreaded Kraken. At first, the Kraken is eager to attack the Viking trio, but with a little music, Pocoyo, Pato, and Elly calm the Kraken, and the Kraken becomes friendly. # The Juices – (12 August 2022) Pocoyo and Pato discover that Elly makes fruit juices for her friends. Elly makes juices with many different fruits, such as strawberries, blackberries, grapes, cherries, bananas, and others. Pato and Pocoyo want to learn how to make colorful juices. At first, the prince is confused because they can't figure out how to make purple juice. Pocoyo and Pato want to make other colored juices, but Elly isn't happy about it. Pocoyo and Pato start playing tricks on Elly by mixing fruits with other fruits. This upsets Elly so much that Elly tells them she doesn't need them as her helpers anymore. # The Unicorn – (23 September 2022) Pocoyo, Elly, Pato, and Nina are drawing their favorite animals: Pocoyo's is a lion, Elly's is a monkey, and Pato's is a duck. However, Nina's favorite animal is the unicorn, because she firmly believes that unicorns are real. Her friends tell her that unicorns don't exist and refuse to believe otherwise. So Nina sets to work on her artwork to find a unicorn and prove everyone that she was right. Will Nina be able to find a unicorn in Pocoyo World? # The Big Little Race – (3 March 2023) Our favorite trio will face off in a new race to determine the best Pocoyo World runner. However, Angry Alien also wants to join the race, and our friends agree on the condition that he doesn't cheat. To no one's surprise, Angry Alien cheats, making the other runners look smaller. Now Pocoyo and his friends must come up with a way to beat Angry Alien even though they're still little. Will they succeed? # Pocoyo's Farm – (14 April 2023) It's a beautiful sunny day at Pocoyo's farm and our good friend Pocoyo is doing various activities like feeding the chicks. He does this by using a new invention, the Chicken Caller, which is a trumpet that when played attracts nearby chicks. Everything seems to be going well, when suddenly a sheep escapes from the corral, so Pocoyo decides to go after the sheep and asks the narrator to use the Chicken Caller. Unfortunately for him, Nina was spying in the area and takes the Chicken Caller thinking it's a normal trumpet. Now Nina unknowingly unleashes chaos on Pocoyo's farm. # A Surprising Birthday – (28 April 2023) Today is Pocoyo's birthday, and our friends Elly, Pato, Nina, and Roberto know it, so they've each prepared a very special gift for their best friend. Unfortunately, they can't agree on how to celebrate his birthday. Elly wants to bandage him up and surprise him with a surprise gift; Pato wants to give him a speech and eat raspberry cake; and Nina wants to give him a musical presentation with a trampoline. Can our friends agree on how to give Pocoyo the best birthday in the world? # Another Key?! – (12 May 2023) The sequel episode of the Season 1 episode \"The Key To It All\". Nina and Roberto are playing on the beach, digging in the sand to find shells. Suddenly, Nina finds an orange key buried in the sand, but this isn't just any key; it's a key that leads to an island where there's a treasure chest. Nina and Roberto prepare to find the treasure. Pocoyo was building sandcastles, but Nina and Roberto convince him to join them on the adventure. This trio will live exciting adventures while searching for the long-awaited treasure chest. # The Big Match – (19 May 2023) Pocoyo, Elly, Pato, Nina, Caterpillar, Sleepy Bird, Baby Bird, Fred, and Yanko are playing a soccer match. The players are warming up and training for the \"Big Game.\" The match is going well, with scoring chances for each team, good ball control, and apparently all the players know how to play soccer, except for Pocoyo, who apparently doesn't know how to play the sport or the rules. The match is getting better, with more scoring opportunities (some converted, others not), controversial plays, and a fight at the end. Note: This episode was originally uploaded as an HBO Max exclusive during 2021. # King Yeti – (16 June 2023) The sequel episode of the short film \"Pocoyo and the League of Extraordinary Super Friends\". The Angry Alien is back on the loose with a new plan to conquer Pocoyo World. This time he's invented a new device called The Monstrous Helmet, which turns any living creature into a terrifying monster. The Angry Alien uses this helmet on poor Yanko, turning him into a terrifying giant monster: King Yeti. Now this giant monster threatens the peace and love of Pocoyo World, so there's only one team capable of stopping him: The League of Extraordinary Super Friends. Can they turn Yanko back to normal and stop the evil plans of the Angry Alien? # The Mystery of the Missing Pato – (17 July 2023) Another sequel episode of the Season 1 episode \"The Key To It All\". It's a quiet day in Pocoyo World and our friends Pato and Pocoyo are playing with blocks as usual. Everything seems to be going as usual, until out of nowhere Pato mysteriously disappears, leaving Pocoyo very confused. This is how Pocoyo embarks on a great adventure to find his best friend back, along with Elly, discovering along the way that this disappearance is not what it seems. Will Pocoyo be able to find Pato? # Pocoyo the Policeman – (11 August 2023) It's a very unsafe day in Pocoyo World, and our friend Pocoyo decides to become an ally of the law after reading a comic about cops and robbers. While Pocoyo initially carries out his duties with a firm hand, it doesn't take long for excessive power to corrupt him, using his authority to get what he wants and falling victim to corruption. Will Pocoyo be able to return to the side of justice? == References == == Other websites == * Let's Go Pocoyo at the Internet Movie Database Category:2010s television series Category:Children's television series",
 "title": "Let's Go Pocoyo"
}