{
 "id": "473348",
 "text": "Inside Out is a 2015 American computer animated comedy-drama adventure movie. It was produced by Pixar Animation Studios and released by Walt Disney Pictures. The movie is directed by one of Pixar's leading talents Pete Docter. The film was shown at the Cannes Film Festival on May 19, 2015 and was released on June 19, 2015. ==Plot== Riley Anderson is an 11-year-old girl. She moves from Minnesota to San Francisco with her family. This affects a number of emotions in her head that each control her feelings, thoughts and memories. The five emotion characters are: Joy, Anger, Disgust, Fear and Sadness. Each of the characters has power over an island of Riley's life, which represent different parts of her personality. After a bad series of events at her first day of school, Joy and Sadness get sucked out of Headquarters, where the 5 emotions work. The rest of the movie consists of the other 3 emotions trying to compensate for Joy's absence but failing to. Near the end of the movie, after Riley tries running away out of homesickness, Sadness and Joy come back. After every emotion tried discarding Sadness in the past, she stops Riley from going back to Minnesota. Riley then goes back to her new house and cries about missing her old home with her parents, with Joy and Sadness in control. After she finishes crying, a bittersweet yellow and blue memory comes out, made by the both of them. This is Riley's first mixed-emotion memory. This memory makes the emotions realize that Sadness also plays an important role in Riley's life. ==Cast== ==Sequel== A sequel, Inside Out 2 was released on June 14, 2024.https://www.disney.co.uk/movies/inside-out-2 Inside Out 2 - Disney UK Website The sequel features 5 new emotions: Anxiety, Embarrasment, Ennui (boredom), Envy and Nostalgia. ==References== ==Other websites== * * Category:Academy Award winning movies Category:2015 movies Category:2010s American adventure movies Category:American family movies Category:American 3D animated movies Category:2010s American fantasy movies Category:2010s English- language movies Category:American fantasy-comedy movies Category:Golden Globe Award winning movies Category:Movies about families Category:Movies composed by Michael Giacchino Category:Movies about children Category:Movies set in San Francisco Category:Movies that won the Best Animated Feature Academy Award Category:Pixar movies Category:2010s 3D movies Category:2015 computer-animated movies Category:2010s coming-of-age movies Category:American coming-of-age movies Category:2015 comedy-drama movies Category:American comedy-drama movies",
 "title": "Inside Out (2015 movie)"
}