{
 "id": "47344",
 "text": "Plagiarism is the act of copying another person's ideas, words or writing and pretending that they are one's own work. It can involve violating copyright laws. College students who are caught plagiarizing can be expelled from school. It can permanently damage a student's reputation. Writers who plagiarize commit serious legal and ethical violations. == Types of plagiarism == * Direct Plagiarism – copying and pasting someone else's work, or making minor changes to someone else's work to pass it off as their own. * Self- Plagiarism – Happens when a student submits all or part of their own previous work without getting permission from all involved professors. * Mosaic Plagiarism – Or \"patch writing,\" is when parts of other works are copied without using quotation marks. It can also be when a student keeps the same structure and meaning of an original passage and only uses synonyms. * Accidental Plagiarism – This can happen when a student does not cite their sources. It can also happen when a student paraphrases information without giving attribution (credit to the original author or authors). * Mash-up – Two or more data sources that have been turned into one. They may be graphics, texts, songs, and video from various media. == Legal issues == Many cases of plagiarism, especially in schools, can lead to internal punishment. Certain people have been punished in a legal court for plagiarism, mostly due to copyright claims. Court cases include: * Sheldon v. Metro-Goldwyn Pictures Corp. (1936) * Nichols v. Universal Pictures Corp. (1930) * Steinberg v. Columbia Pictures (1987) Any work created in the US after 1st. Mar 1989 is automatically protected by copyright, even if there is no copyright notice attached to the work. The defendant could sue for any copying of this kind of intellectual property. == Avoiding plagiarism == It is usually not enough to know what plagiarism is, students must also know how to avoid plagiarism. Writers are as responsible for intentional plagiarism as they are for accidental plagiarism. It is important to cite sources while doing research. Putting this off until later can cause some sources to be forgotten or incorrectly cited. When using a source, make sure the content is in the same context as the paper. Try to avoid using biased sources. Always take the time to find the correct information about a source. For example, some web pages may be part of a larger website. While a web page article may seem fair and balanced, it can be affected by the overall bias or reputation of the publisher. Using something out of context can also lead to charges of plagiarism. Taking the time to properly cite all sources in a paper or work is paying respect to the original ideas of others. This is all part of doing good work. == Related pages == * Copyright * Copyright infringement * Academic dishonesty * Fair use * Wikipedia:Citing sources (Wikipedia guideline) * Ghostwriter * Pastiche ==References== == Other websites == * Avoiding Plagiarism: Writing With Integrity; YouTube * What is plagiarism and how to avoid it: YouTube * Avoiding plagiarism: Purdue University Category:Plagiarism Category:Copyright infringement",
 "title": "Plagiarism"
}