{
 "id": "473561",
 "text": "Louis de Bourbon, 6th Prince of Condé (10 November 1668 - 4 March 1710) was a Prince of the blood at the French court of Louis XIV. Styled as the Duke of Bourbon from birth, he succeeded his father as Prince of Condé in 1709. He was commonly called Monsieur le Duc. However, he was known by the lesser ducal title. He was prince for less than a year. As a member of the reigning House of Bourbon, he was a prince du sang. He was governor of Burgundy from 1709 to 1710.Julian Swann, Provincial Power and Absolute Monarchy: The Estates General of Burgundy (Cambridge: Cambridge University Press, 2003), p. 413 He was forced to marry an illegitimate daughter of Louis XIV. ==Issue== #Marie Gabrielle Éléonore de Bourbon, Mademoiselle de Bourbon (22 December 1690 - 30 August 1760) died unmarried. #Louis Henri I, Prince of Condé (18 August 1692 - 27 January 1740) married Marie Anne de Bourbon and had no issue. He later married Landgravine Caroline of Hesse-Rotenburg and had issue. #Louise Élisabeth de Bourbon (22 November 1693 – 27 May 1775) married Louis Armand, Prince of Conti and had issue. #Louise Anne de Bourbon, Mademoiselle de Charolais (23 June 1695 - 8 April 1758) died unmarried. #Marie Anne de Bourbon (16 October 1697 - 11 August 1741) secretly married Louis de Melun, Duke of Joyeuse. #Charles, Count of Charolais (19 June 1700 - 23 July 1760) secretly married Jeanne de Valois Saint Remy (descendant of Henri II of France) and had illegitimate issue. #Henriette Louise de Bourbon, Mademoiselle de Vermandois (15 January 1703 - 19 September 1772) died unmarried. #Élisabeth Alexandrine de Bourbon, Mademoiselle de Sens (15 September 1705 - 15 April 1765) died unmarried. #Louis, Count of Clermont (15 June 1709 - 16 June 1771) died unmarried. ==Tiles and styles== *10 November 1668 - 1 April 1709 His Most Serene Highness the Duke of Bourbon. == References == Category:House of Bourbon (Condé branch) Category:Deaths from stroke Category:Dukes and Duchesses of Bourbon Category:People from Paris Category:1668 births Category:1710 deaths",
 "title": "Louis III, Prince of Condé"
}