{
 "id": "473762",
 "text": "The 1968 Republican presidential primaries were how voters of the Republican Party chose its nominee for President of the United States in the 1968 U.S. presidential election. Former Vice President Richard Nixon was selected as the nominee through a series of primary elections and caucuses which happened in the 1968 Republican National Convention. It was held from August 5 to August 8, 1968, in Miami, Florida. ==Candidates== File:Nixon 30-0316a.jpg|Former Vice President Richard Nixon of California File:Ronald Reagan 1969.jpg|Governor Ronald Reagan of California File:Nelson_Rockefeller.jpg|Governor Nelson Rockefeller of New York File:George W. Romney official portrait.jpg|Governor George Romney of Michigan (Withdrew Feb. 28th, 1968) File:HaroldStassenOfficialOil.jpg|Former Governor Harold Stassen of Minnesota ===Favorite sons=== File:John Tower.jpg|Senator John Tower of Texas (Withdrew July 1st) (Endorsed Richard Nixon) File:George W. Romney official portrait.jpg|Governor George Romney of Michigan File:Jim Rhodes in Bettsville, Ohio October 15, 1981.jpg|Governor James A. Rhodes of Ohio File:Clifford P Case.jpg|Senator Clifford Case of New Jersey (Withdrew Before 1st Ballot) File:Governor Claude R Kirk.jpg|Governor Claude R. Kirk, Jr. of Florida (Withdrew July 12th) (Endorsed Nelson Rockefeller) File:Spiro Agnew.jpg|Governor Spiro Agnew of Maryland (Withdrew August 6th) (Endorsed Richard Nixon) File:Daniel J. Evans.jpg|Governor Daniel J. Evans of Washington (Withdrew August 5th) (Endorsed Nelson Rockefeller) File:Dewey Bartlett.jpg|Governor Dewey F. Bartlett of Oklahoma (Withdrew August 4th) (Endorsed Richard Nixon) File:StromThurmond.png|Senator Strom Thurmond of South Carolina (Withdrew Before 1st Ballot) (Endorsed Richard Nixon) File:Frankcarlson(r-ks).jpg|Senator Frank Carlson of Kansas File:Fong.jpg|Senator Hiram Fong of Hawaii File:Hickel.gif|Governor Wally Hickel of Alaska (Withdrew Before 1st Ballot) (Endorsed Richard Nixon) File:Volpe.gif|Governor John Volpe of Massachusetts (Withdrew April 30th, 1968) ===Declined to run=== File:Edward Brooke.jpg|Senator Edward Brooke of Massachusetts File:EverettDirksen.jpg|Minority Leader Everett Dirksen of Illinois File:PHDominick.jpg|Senator Peter H. Dominick of Colorado File:Gerald Ford.jpg|House Minority Leader Gerald Ford of Michigan File:James M. Gavin.jpg|Former Ambassador James M. Gavin of New York File:BarryGoldwater.png|Former Senator Barry Goldwater of Arizona File:Mark Hatfield – 1967.jpg|Senator Mark Hatfield of Oregon File:ThomasKuchel.jpg|Senator Thomas Kuchel of California File:Curtis LeMay (USAF).jpg|Retired Air Force Chief of Staff Curtis LeMay of California File:John Lindsay NYWTS 1.jpg|NYC Mayor John Lindsay of New York File:HenryCabotLodgeJr.jpg|Ambassador Henry Cabot Lodge, Jr. of Massachusetts File:Tom McCall 2.jpg|Governor Tom McCall of Oregon File:Thruston B Morton.jpg|Senator Thurston B. Morton of Kentucky File:Charles Percy.jpg|Senator Charles H. Percy of Illinois File:Wm Scranton Pennsylvania 87th Cong.png|Former Governor William Scranton of Pennsylvania File:Gen William C Westmoreland.jpg|General William Westmoreland of South Carolina Category:United States presidential primary elections Republican Party presidential primaries Category:Republican Party (United States)",
 "title": "1968 Republican Party presidential primaries"
}