{
 "id": "473889",
 "text": "New Blood Rising was a professional wrestling pay-per-view show made by World Championship Wrestling (WCW). It was held on August 13, 2000 at Pacific Coliseum in Vancouver, British Columbia. New Blood Rising replaced Road Wild as WCW's August pay-per-view. The pay-per-view's name is a reference to the New Blood stable in WCW. ==Matches== # Matches Stipulations Times 1 3 Count (Evan Karagias, Shannon Moore, and Shane Helms) (with Tank Abbott) defeated The Jung Dragons (Kaz Hayashi, Jamie-San, and Yun Yang) Ladder match 11:32 2 Ernest Miller defeated The Great Muta Singles match 6:47 3 Buff Bagwell defeated Kanyon Judy Bagwell on a Forklift match 6:45 4 KroniK (Brian Adams and Bryan Clark) (c) defeated The Perfect Event (Shawn Stasiak and Chuck Palumbo), Sean O'Haire and Mark Jindrak, and The Misfits In Action (General Rection and Cpl. Cajun) Four Corners match for the WCW World Tag Team Championship with Disqo, Tygress and Rey Misterio, Jr. serving as the special guest referees 12:22 5 Billy Kidman defeated Shane Douglas (with Torrie Wilson) Strap match 8:22 6 Major Gunns defeated Ms. Hancock Mud Rip off the Clothes match 6:43 7 Sting defeated The Demon Singles match 0:52 8 Lance Storm (c) defeated Mike Awesome Canadian Rules match1 for the WCW United States Heavyweight Championship with Jacques Rougeau acting as the Special Guest Referee 11:28 9 The Dark Carnival (Vampiro and The Great Muta) defeated KroniK (Brian Adams and Bryan Clark) (c) Tag team match for the WCW World Tag Team Championship 9:06 10 Kevin Nash defeated Goldberg2 and Scott Steiner (with Midajah) Triple Threat match 10:48 11 Booker T (c) defeated Jeff Jarrett Singles match for the WCW World Heavyweight Championship 14:54 1\"Canadian Rules\" is that, instead of the traditional three-count, the referee has to use a five-count. After the five-count, the wrestler has to stay down for ten seconds. If both of the wrestlers are still down for a ten-count for any reason, the first man who gets to his feet wins the match. Also, there are no submissions and no count-outs. 2After he was not at the pay-per-view because of a (kayfabe) mysterious motorcycle accident, Goldberg did not show up until the middle of the match. Then, in a worked shoot, Goldberg would walk out on the match, because he apparently refused to take Kevin Nash's Jacknife Powerbomb. ==References== Category:2000 in professional wrestling Category:Sport in Vancouver Category:World Championship Wrestling Category:2000 in Canada",
 "title": "New Blood Rising"
}