{
 "id": "4740",
 "text": "Melbourne () is the second-largest city in Australia. It is the capital of Victoria, a state in the south-east of Australia. The population of Melbourne was just over five million in 2020. \"Melbourne\" is an ambiguous name. The local City of Melbourne is quite small, as the City of London is. But the metropolitan area of Melbourne is nearly 9,993 km2 square kilometers (3,858 sq mi). Melbourne is a multicultural city (it welcomes people and cultures from all over the world). It is famous for its trams. In the centre of Melbourne is a river called the Yarra River. Melbourne also has many big parks and gardens and some beaches. There are many things to do in Melbourne. Visitors in Melbourne can go to museums, look at art, eat food at restaurants, go to shops and visitors can enjoy of international events like Australian Open and Formula One both in the early year. Melbourne has been the winner of the Economist's 'World's most liveable city' award seven times in a row (winner 20102017). == History == Melbourne was founded in 1835 by John Batman and John Pascoe Fawkner. In 1851, some people found gold near Melbourne. Melbourne grew very quickly because people came from all over the world to look for gold. At the end of the 19th century, Melbourne was called \"Marvellous Melbourne\". Melbourne was the biggest and most important city in Australia for many years, but now Sydney is larger (but perhaps not more important). The first Australian government was in Melbourne from 1901 to 1927, when it moved to Canberra. ==Facilities== There is a lot of industry (factories) and commerce (buying and selling) in Melbourne. Many of Australia's largest companies and many large companies from other countries work there. It is home to Australia's largest seaport. There are a number of universities (the University of Melbourne, Monash University, Deakin University, Victoria University, La Trobe University, RMIT University, Swinburne University and the Australian Catholic University). Much of Australia's automotive (car) industry is there, for example the engine maker \"Holden\", and \"Ford\" and \"Toyota\" car builders, Although all three of these companies have announced plans to move their manufacturing plants overseas with Ford already shutting down its manufacturing plant in Broadmeadows. == Population == Many people from different countries live in Melbourne. In fact 43% of the people living in Melbourne were born outside Australia or have parents from another country. All together people from 233 countries live in Melbourne and people with 116 different religions. The population (1991) is 3,156,700, and has grown in 2006 to 3,720,300. Melbourne Population by year Melbourne Population by year Melbourne Population by year 1836 177 1851 29,000 1854 123,000 (gold rush) 1860 140,000 1880 280,000 1890 490,000 1895 900,000 (economic collapse) 1956 1,500,000 1981 2,806,000 1991 3,156,700 (economic slump) 2001 3,366,542 2004 3,592,975 2006 3,720,300 (2006 estimate) == Events == * 1901 - Opening of the first Parliament of the Commonwealth of Australia * 1956 - The Olympic Games were in Melbourne. * 2006 - The Melbourne 2006 Commonwealth Games == Sister cities == Melbourne has six sister cities. They are: * Osaka, Japan (1978) * Tianjin, China (PRC) (1980) * Thessaloniki, Greece (1984) * Boston, United States (1985) * Saint Petersburg, Russia (1989) * Milan, Italy (2004) ==Climate== Melbourne has a moderate oceanic climate (Cfb) with warm summers and cool, damp and often cloudy winters. The weather is changeable, especially in summer, giving Melbourne a name for having \"four seasons in one day\". This is because it is located between the hot inland areas in the north and the cool Southern Ocean. Cold fronts in the area can bring gales, thunderstorms and hail in spring and summer. Even though it gets severe weather, the city is actually not very rainy with an annual rainfall total of 648.3 mm (25.52 in). Extreme heat can occur in Melbourne, with the highest temperature recorded being 46.4 °C (115.5 °F), on 7 February 2009. Last time Melbourne saw snow was in 1986. == Places to visit == * Federation Square * Queen Victoria Market * National Gallery of Melbourne * Melbourne Zoo * Flinder Street Station * Luna Park * Melbourne Museum * Eureka Tower * Crown Casino * St Kilda Beach, Victoria * MCG (Melbourne Cricket Ground) ==Related pages== * List of tallest buildings in Melbourne == References == Category:Former national capitals Category:Olympic cities",
 "title": "Melbourne"
}