{
 "id": "474319",
 "text": "The Division of Boothby is an Australian electoral division in South Australia. It was set up 1903 and is named for William Boothby (1829–1903), the Returning Officer for the first federal election in 1901.Profile of the Electoral Division of Boothby, 4 January 2011, Australian Electoral Commission. It covers the suburbs south of Adelaide, including Aberfoyle Park, Belair, Blackwood, Brighton, Daw Park, Eden Hills, Flagstaff Hill, Marion, Mitcham, Seacliff, St Marys and Panorama. ==Members== Image Member Party Term Notes Lee Batchelor Labour 16 December 1903 – 8 October 1911 Previously held the Division of South Australia. Served as minister under Watson and Fisher. Died in office David Gordon Commonwealth Liberal 11 November 1911 – 31 May 1913 Lost seat. Later elected to the South Australian Legislative Council in 1913 George Dankel Labor 31 May 1913 – 14 November 1916 Previously held the South Australian House of Assembly seat of Torrens. Retired George Dankel National Labor 14 November 1916 – 17 February 1917 Previously held the South Australian House of Assembly seat of Torrens. Retired George Dankel Nationalist 17 February 1917 – 26 March 1917 Previously held the South Australian House of Assembly seat of Torrens. Retired William Story Nationalist 5 May 1917 – 16 December 1922 Previously a member of the Senate. Served as Chief Government Whip in the House under Hughes. Lost seat Jack Duncan-Hughes Liberal Union 16 December 1922 – 1925 Lost seat. Later elected to the Senate in 1931 Jack Duncan-Hughes Nationalist 1925 – 17 November 1928 Lost seat. Later elected to the Senate in 1931 John Price Labor 17 November 1928 – March 1931 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as Chief Government Whip in the House under Lyons. Died in office John Price Independent March 1931 – 7 May 1931 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as Chief Government Whip in the House under Lyons. Died in office John Price United Australia 7 May 1931 – 23 April 1941 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as Chief Government Whip in the House under Lyons. Died in office Grenfell Price United Australia 24 May 1941 – 21 August 1943 Lost seat Thomas Sheehy Labor 21 August 1943 – 10 December 1949 Did not contest in 1949. Failed to win the Division of Kingston (Sir) John McLeay Sr. Liberal 10 December 1949 – 31 October 1966 Previously held the South Australian House of Assembly seat of Unley. Served as Speaker during the Menzies and Holt Governments. Retired. Son was John McLeay Jr. John McLeay Jr. Liberal 26 November 1966 – 22 January 1981 Served as minister under Fraser. Resigned in order to retire from politics. Father was John McLeay Sr. Steele Hall Liberal 21 February 1981 – 29 January 1996 Previously served as the Premier of South Australia from 1968 to 1970. Previously a member of the Senate. Retired Andrew Southcott Liberal 2 March 1996 – 9 May 2016 Retired Nicolle Flint Liberal 2 July 2016 – present Incumbent David Gordon won the seat in a by-election in 1911 caused by the death of Lee Batchelor. Another by-election was held in 1941 after the death of John Price. Sir John McLeay was Speaker of the House of Representatives from 1956-66. His son John, Jr., was a minister in the Fraser government. Steele Hall had been Premier of South Australia, when he won the seat in a by-election caused by McLeay accepting a diplomatic position overseas. ==Election results== ==Notes== * ABC profile for Boothby: 2013 * AEC profile for Boothby: 2013 * Poll Bludger profile for Boothby: 2013 Category:Electoral divisions of South Australia Category:1903 establishments in Australia",
 "title": "Division of Boothby"
}