{
 "id": "474316",
 "text": "The Division of Barker is an Australian Electoral Division in the south-east of South Australia. it includes the towns of Barmera, Berri, Bordertown, Keith, Kingston SE, Loxton, Mannum, Millicent, Mount Gambier, Murray Bridge, Naracoorte, Penola, Renmark, Tailem Bend, Waikerie, and parts of Nuriootpa and Tanunda. It was set up in 1903, and named for Collet Barker, who explored the mouth of the Murray River in 1831. ==Members== Image Member Party Term Notes Sir Langdon Bonython Protectionist 1903– 1906 Previously held the Division of South Australia. Retired John Livingston Anti-Socialist 1906– 1909 Previously held the South Australian House of Assembly seat of Victoria and Albert. Lost preselection and retired John Livingston Commonwealth Liberal 26 May 1909 – 17 February 1917 Previously held the South Australian House of Assembly seat of Victoria and Albert. Lost preselection and retired John Livingston Nationalist 17 February 1917 – 1922 Previously held the South Australian House of Assembly seat of Victoria and Albert. Lost preselection and retired Malcolm Cameron Liberal Union 1922 – 1925 Retired Malcolm Cameron Nationalist 1925 – 7 May 1931 Retired Malcolm Cameron United Australia 7 May 1931 – 1934 Retired Archie Cameron Country 1934 – 16 October 1940 Previously held the South Australian House of Assembly seat of Wooroora. Served as minister under Joseph Lyons, Earle Page and Robert Menzies. Served as Speaker during the Menzies Government. Died in office Archie Cameron United Australia 16 October 1940 – 21 February 1945 Previously held the South Australian House of Assembly seat of Wooroora. Served as minister under Joseph Lyons, Earle Page and Robert Menzies. Served as Speaker during the Menzies Government. Died in office Archie Cameron Liberal 21 February 1945 – 9 August 1956 Previously held the South Australian House of Assembly seat of Wooroora. Served as minister under Joseph Lyons, Earle Page and Robert Menzies. Served as Speaker during the Menzies Government. Died in office Dr Jim Forbes Liberal 1956 Barker by-election – 1975 Served as minister under Robert Menzies, Harold Holt, John McEwen, John Gorton and William McMahon. Retired James Porter Liberal 1975 – 1990 Retired Ian McLachlan Liberal 1990 – 1998 Served as minister under John Howard. Retired Patrick Secker Liberal 1998 – 2013 Lost preselection and retired Tony Pasin Liberal 2013 – present Current member Archie Cameron was leader of the Country Party and Speaker of the House in the Menzies Government. Cameron's death caused a by- election which was won by Jim Forbes, later a minister in the Menzies, Holt, Gorton and McMahon governments. Ian McLachlan, was Minister for Defence from 1996 to 1998 in the Howard Government. ==Election results== ==References== * ABC profile for Barker: 2013 * AEC profile for Barker: 2013 * Poll Bludger profile for Barker: 2013 Category:Electoral divisions of South Australia Category:1903 establishments in Australia",
 "title": "Division of Barker"
}