{
 "id": "47459",
 "text": "Oliver Cromwell (25 April 1599 – 3 September 1658) was an English military and political leader best known for making England a republic and leading the Commonwealth of England and primarily because of ethnic cleansing activities in Ireland euphemistically called as Cromwellian Genocide. Cromwell's actions during his career seem confusing to us today. He supported Parliament against the King, yet he ordered his soldiers to break up parliament. Under his rule, the Protectorate said that people's religious beliefs should be respected, but people who went against what most people believed were sometimes tortured and imprisoned. Cromwell was the first ruler of England to be a Puritan. He created a new model army. Many English people today think he was one of their greatest leaders. == Early life == Cromwell started off as a gentleman from Huntingdon. He first studied at Huntingdon Grammar School. He had a bad relationship with his father. He went on to Sidney Sussex College at the University of Cambridge. This was a new, small college where he had the chance to talk about his new Puritan ideas. However, he never took a degree because his father died in 1617 while he was studying. ==The English Civil War== In 1628, Cromwell became an MP and a Puritan and supported Parliament in its quarrel with the King. When war broke out, the King's army was stronger and better-prepared than the army of Parliament. Cromwell saw this, and he decided to train men to fight better. Soon the \"New Model Army\" he had trained began to win battles. As a result, Parliament won the war. By the end of the war, Cromwell was very powerful. ==The Commonwealth: 16491653== During the following years, Oliver Cromwell conducted two campaigns to subdue the Irish Catholics (1649-1650), and in the battles of Dunbar and Worcester (1650-1651) crushed the Scottish royalists, who had proclaimed King Charles II. , first- born of the executed sovereign. ===The Rump Parliament=== After the execution of the King, a republic was declared, known as the Commonwealth of England. A Council of State was appointed to manage affairs, which included Cromwell among its members. His real power base was in the army. ===Takeover of Ireland=== In 1652, Cromwell took over Ireland. Many historians believe that Cromwell committed an ethnic cleansing against the Irish Catholic people.Levene, Mark (2005). Genocide in the Age of the Nation-State. I.B.Tauris. pp. 55-57. . Cromwell wanted the Irish Catholics to move out of eastern Ireland into the northwest. According to these historians, Cromwell and his army used massacres, starvation, and threats of execution to force the Irish to leave.Parliament of England (August 12, 1652). Act for the Settlement of Ireland. Constitution Society. Retrieved April 9, 2016.Morrill, John (December 2003). Rewriting Cromwell – A Case of Deafening Silences. Canadian Journal of History 38 (3): 553. Historian Frances Stewart says that 600,000 Irish people 43% of the Irish population died from these policies. ==The Protectorate: 16531658== The House of Commons tried hard to control the army, but could not: in 1653, Cromwell dissolved the House of Commons, yielded legislative power to 139 people of his confidence and took the title of Lord Protector of England, Scotland and Ireland, with powers wider than those enjoyed by the monarch. During his tenure he reorganized public finances, promoted the liberalization of commerce in order to ensure the prosperity of the mercantile bourgeoisie, promulgated the Navigation Act (1651), through which he imposed on the Netherlands the English maritime supremacy, defeated the United Provinces (1654), snatched Jamaica from Spain (1655), persecuted the Catholics and placed England at the head of the European Protestant countries. A new constitution known as the Instrument of Government made Cromwell Lord Protector for life. He had the power to call and dissolve parliaments. In 1657, Cromwell was offered the crown by Parliament. Cromwell thought about the offer for six weeks. Then he rejected it and was ceremonially re-installed as \"Lord Protector\" (with greater powers than had previously been granted him under this title) at Westminster Hall. Cromwell is thought to have suffered from malaria (probably first contracted while on campaign in Ireland). He died at Whitehall on 3 September 1658, the anniversary of his great victories at Dunbar and Worcester.Gaunt, p.204. == After Cromwell's death == At his death (3 September 1658), however, the Republic was immersed in a period of chaos, which ended with the restoration of the monarchy in the person of Charles II of England by the Parliament (1660). Despite his prudence, the new monarch did not hesitate to order the exhumation of the corpse of the man who had signed the death sentence of his father, to cut off his head and expose it in the Tower of London. He was succeeded as Lord Protector by his son Richard. Although Richard was not entirely without ability, he had no power base in either Parliament or the Army, and was forced to resign in the spring of 1659, bringing the Protectorate to an end. A year later Parliament restored Charles II as king. When the Royalists returned to power, Cromwell's corpse was dug up, hung in chains, and beheaded. It is said that his head was lost for months until a soldier found it. His skull was passed around as a token until it was buried at Tyburn. ==References== * * Adamson, John (1987). \"The English Nobility and the Projected Settlement of 1647\", in Historical Journal, 30, 3. * Carlyle, Thomas (ed.) (1904 edition). Oliver Cromwell's letters and speeches, with elucidations ; * * Durston, Christopher (1998). The Fall of Cromwell's Major- Generals, in English Historical Review 1998 113(450): pp. 18–37, ISSN 0013-8266 . * Gardiner, Samuel Rawson (1901). Oliver Cromwell, . * * * * Kishlansky, Mark (1990), \"Saye What?\" in Historical Journal 33, 4. * * * * * * * * * * * Worden, Blair (2000). \"Thomas Carlyle and Oliver Cromwell\", in Proceedings Of The British Academy 105: pp. 131–170. ISSN 0068-1202 . * == Footnotes == == Bibliography == === Biographies === * * Ashley, Maurice (1958). The Greatness of Oliver Cromwell (Macmillan). * * * * * * Gardiner, Samuel Rawson (1901). Oliver Cromwell, . Classic biography. * * * * * Morrill, John (2004). \"Cromwell, Oliver (1599–1658)\", in Oxford Dictionary of National Biography, (Oxford University Press) * * Paul, Robert (1958). The Lord Protector: Religion And Politics In The Life Of Oliver Cromwell. * * * ===Military studies=== * Durston, Christopher (2000). \"'Settling the Hearts and Quieting the Minds of All Good People': the Major-generals and the Puritan Minorities of Interregnum England\", in History 2000 85(278): pp. 247–267, ISSN 0018-2648 . Full text online at Ebsco. * Durston, Christopher (1998). \"The Fall of Cromwell's Major-Generals\", in English Historical Review 1998 113(450): pp. 18–37, ISSN 0013-8266 * * * * * * Woolrych, Austin (1990). \"The Cromwellian Protectorate: a Military Dictatorship?\" in History 1990 75(244): 207-231, ISSN 0018-2648 . Full text online at Ebsco. * * ===Surveys of era=== * * * * * * * Trevor-Roper, Hugh (1967). Oliver Cromwell and his Parliaments, in his Religion, the Reformation and Social Change (Macmillan). online * * * ===Primary sources=== * Abbott, W.C. (ed.) (1937-47). Writings and Speeches of Oliver Cromwell, 4 vols. The standard academic reference for Cromwell's own words. . * Carlyle, Thomas (ed.) (1904 edition), Oliver Cromwell's letters and speeches, with elucidations. ; * Haykin, Michael A. G. (ed.) (1999). To Honour God: The Spirituality of Oliver Cromwell (Joshua Press), Excerpts from Cromwell's religious writings. * Morrill, John (1990). \"Textualizing and Contextualizing Cromwell\", in Historical Journal 1990 33(3): pp. 629–639. ISSN 0018-246X . Full text online at Jstor. Examines the Carlyle and Abbott editions. * * Worden, Blair (2000). Thomas Carlyle and Oliver Cromwell, in Proceedings Of The British Academy 105: pp. 131–170, ISSN 0068-1202 . ==Other websites== * The Cromwell Association * The Cromwell Museum in Huntingdon * Chronology of Oliver Cromwell World History Database * Biography at the British Civil Wars & Commonwealth website Category:1599 births Category:1658 deaths Category:Alumni of the University of Cambridge Category:English heads of state Category:Former dictators",
 "title": "Oliver Cromwell"
}