{
 "id": "47469",
 "text": "The Incredibles is a 2004 animated superhero movie. It was written and developed by Brad Bird, who once directed The Simpsons and was best known for directing the animated movie The Iron Giant. The movie was produced by Pixar Animation Studios and has won an Academy Award. The Incredibles was originally developed as a traditionally-animated movie, but after Warner Bros. shut down its animation division, Brad Bird moved to Pixar and took the story with him. The Incredibles was Pixar's first PG-rated movie. It was Pixar's final movie released on VHS. The movie depicts a world where there are superheroes, but after an intense court hearing, the government decides that all 'supers' must now go undercover and live normal lives. The main character is Robert Parr (Mr Incredible). The sequel Incredibles 2 was released to the public on June 15, 2018. ==Plot== In the 1950s, superheroes are now scorned by the public because of the collateral damage caused by their crime-fighting. After several lawsuits, the government initiates the Superhero Relocation Program, in which superheroes must give up crime-fighting and live under secret identities. Many years later, in the mid-1960s, Bob Parr and his wife Helen-formerly Mr. Incredible and Elastigirl-live in the suburbs of Metroville with their children Dash, Violet and Jack-Jack. Although Bob loves his family, he secretly resents his white-collar job and his mundane suburban life. Along with his friend Lucius Best-formerly known as Frozen-Bob occasionally moonlights as a vigilante to relive his \"glory days\". One day, Bob and Lucius are nearly caught during one of their vigilante activities when he discovers one of his friends, Gazerbeam, is missing. The next day, after his boss, Gilbert Huph, prevents him from stopping a mugging, Bob loses his temper, and injures Huph with his super strength, leading to him being fired. When he returns home, he receives a video call from a mysterious woman called Mirage, who assigns him a paid mission to defeat the Omnidroid, a savage robot on a remote island called Nomanisan. Bob travels to the island, where he battles the robot and destroys it by ripping out its power source. Bob finds the action and higher pay rejuvenating; over the next two months, while waiting for another assignment by Mirage, he improves his relationship with his family. When he finds a rip in his super suit, he visits the eccentric costume designer Edna Modeto mend it. Assuming Helen knows what Bob is doing, she designs suits for the rest of the family. Travelling to Nomanisan again, Bob discovers Mirage is working for the wicked Syndrome, a jilted fan formerly known as Buddy Pine, who now makes money as an inventor and arms dealer. After escaping from Syndrome, Bob discovers Gazerbeam's skeleton in a cave, with the reflection pointing towards writing on a wall; KRONOS. Bob uses the word to hack into Syndrome's computer, and discovers to his horror, that Syndrome has been perfecting the Omnidroid to kill superheroes after he hires them to fight it. Syndrome's plans to send the Omnidroid to Metroville, where he will manipulate its controls and defeat it, becoming a hero in the eyes of the public; his endgame is to sell his inventions around the world, so everyone can become super, rendering actual superheroes obsolete. Helen visits Edna and learns what Bob has been up to. She activates a beacon built into the suits to find Bob, accidentally causing him to be captured while infiltrating Syndrome's base. Elastigirl borrows a private plane to travel to the island, and discovers that Dash and Violet have stowed away, leaving Jack-Jack with a babysitter. Syndrome picks up on Helen's radio transmissions, and he sends anti-aircraft missiles to shoot her down, destroying the plane. Helen and the kids survive and use their powers to reach the island. Helen infiltrates the base and discovers Syndrome's plan. Discontented with Syndrome's indifference when her life was threatened, Mirage frees Bob and tells him his family are alive. Helen arrives and she and Bob race to find their children; Dash and Violet defeat Syndrome's henchmen and reunite with their parents; Syndrome captures them all, and travels to Metroville with the Omnidroid. With the help of Mirage, the family escape. Due to the Omnidroid's advanced intelligence, it recognizes Syndrome as a threat to itself, shooting off the controller from his wrist, rendering him unable to control it, and knocking him out. The Incredibles team up with Frozone, and defeat the Omnidroid. Helen acquires the controls, and Bob destroys the robot's power source. Upon arriving home, the Incredibles discover Syndrome, who plans to capture Jack-Jack and raise him as his apprentice out of revenge. As he travels to his jet, Jack Jack's power manifest and he escapes him in mid-air, being caught by Helen. Bob throws his car at Syndrome's plane, and the villain is incinerated when his cape is caught in the plane's turbines. Three months later, the Incredibles are confronted by the supervillain Underminer; they wear their masks, ready to confront the new threat together. == Voice cast == * Craig T. Nelson as Bob Parr/Mr. Incredible * Holly Hunter as Helen Parr/Elastigirl * Samuel L. Jackson as Lucius Best/Frozone * Jason Lee as Buddy Pine/Syndrome * Dominique Louis as Bomb Voyage * Teddy Newton as the Newsreel Narrator * Jean Sincere as Mrs. Hogenson * Eli Fucile and Maeve Andrews as Jack-Jack Parr * Wallace Shawn as Gilbert Huph * Spencer Fox as Dashiell \"Dash\" Parr * Lou Romano as Bernie Kropp * Wayne Canney as the Principal * Sarah Vowell as Violet Parr * Michael Bird as Tony Rydinger * Elizabeth Peña as Mirage * Bud Luckey as Rick Dicker * Brad Bird as Edna \"E\" Mode * Bret Parker as Kari * Kimberly Adair Clark as Honey * John Ratzenberger as the Underminer * Mark Andrews as Police Officer #2 * Jack Angel as Guard #2 and a Firefighter #4 * Bob Bergen as Firefighter #5 * Nicholas Bird as Rusty McAllister * Louis Braga III as Edna Mode's Security Guard * Rodger Bumpass as Firefighter #2 * Corey Burton as Firefigher #15 and the Mission Control Caller * Philip L. Clarke as Firefighter #1 * Paul Eiding as Firefighter #7 * William Farmer as Oliver Sansweet's Lawyer and Firefighter #14 * Pat Fry as Firefighter #10 * Elizabeth Greenberg as Citizen #1 * Marcel Jeannin as Mr. Hogenson * Dennis Jennings as the Robotic Security Bird * Carole Jeghers as the Firefighter Woman * Ollie Johnston as Ollie * Eddie Korbich as Firefighter #8 * Mickie McGowan as the Citizen Mother * Rick Miller as Firefighter #12 * Randy Nelson as Police Officer #1 * Teddy Newton as Jet's Automated Captain * Patrick Pinney as Oliver Sansweet and Firefighter #6 * Phil Proctor as Guard #1 and Firefighter #11 * Jan Rabson as Firefighter #3 * Joe Ranft as a Crowd Member and Monodrawolverine * Lori Richardson as the Government Public Speaker * Katherine Ringgold as Citizen #2 * Bob Scott as Mr. Incredible's Lawyer * Peter Sohn as the Mugger * Andrew Stanton as Police Officer #3 * Frank Thomas as Frank * John Walker as the Minister * Jim Ward as Firefighter #9 * Deirdre Warin as Squeaker's Owner * Hans Zimmer as Firefighter #13 Additional voices were provided by Tony Anselmo, Christopher Daniel Barnes, Susan Blu, Mary Elizabeth Clark, Pete Docter, Maile Flanagan, Jessie \"Michaela Murphy\" Flower, Louis Gonzales, Juliet Greenberg, Billy Guardino, Jess Harnell, Daamen J. Krall, Bradford Lewis, Sherry Lynn, Tress MacNeille, Ted Mathot, Jazzy Mahannah, Liliana Mumy, Bob Peterson, Jeff Pidgeon, Juliet Pokorny, A.J. Riebli III, Stephen Schaffer, Kath Soucie, Tara Strong, Steve Susskind, Brian Tochi, Erik von Detten, Pamela Gaye Walker and Patrick Walker. == Other websites == * * Official site * The Incredibles -- The Official DVD Website * * Pixar Wiki: The Incredibles Category:2004 movies Category:2004 animated movies Category:2004 computer-animated movies Category:American action comedy movies Category:Fictional families Category:Movies composed by Michael Giacchino Category:Movies directed by Brad Bird Category:Movies set on islands Category:Movies that won the Best Animated Feature Academy Award Category:Multilingual movies Category:Superhero comedy movies Category:The Incredibles Category:American superhero movies Category:2004 action movies Category:2004 comedy movies Category:2000s action comedy movies Category:2000s superhero movies",
 "title": "The Incredibles"
}