{
 "id": "474956",
 "text": "Menachem Begin (16 August 1913 – 9 March 1992) was an Israeli politician. Originally a Zionist activist in Eastern Europe, he later became Prime Minister of Israel. In 1941 he joined the Free Polish army. This is how he arrived in Mandatory Palestine in 1942. In 1942, Begin joined the Irgun, a Zionist-Jewish paramilitary organization, which was labelled as a terrorist organization in the 1940s.Irgun-Zvai-Leumi, Encyclopædia Britannica From 1943 to 1948 he was commander of the Irgun. He was the founder of the Israeli political party Likud. He was the sixth Prime Minister of Israel. Begin’s most significant acts as Prime Minister include officially declaring Jerusalem the capital of Israel, imposing Israeli law on the Golan Heights, taking Ethiopian Jews out of Africa, destroying Saddam Hussein's nuclear reactor in Iraq, controversially leading Israel through the early stages of the 1982 Lebanon War, and most famously, signing the Egypt–Israel Peace Treaty. For that treaty, Begin and Anwar Sadat shared the Nobel Peace Prize. Begin resigned as Prime Minister in October 1983. He died on 9 March 1992 after a heart attack. He was buried on the Mount of Olives. == Related pages == * Lehi militant group * Irgun == References == Category:1913 births Category:1992 deaths Category:Belarusian Jews Category:Deaths from myocardial infarction Category:Members of the Knesset Category:Government ministers of Israel Category:Israeli political leaders Category:Israeli nationalists Category:Israeli Nobel Prize winners Category:Israeli opposition leaders Category:Jewish Israeli politicians Category:Jewish military people Category:Jewish Nobel Prize winners Category:Likud politicians Category:Military personnel of World War II Category:Naturalized citizens of Israel Category:Zionists Category:Anti-communists Category:People from Brest, Belarus Category:Polish Jews Category:Polish military people Category:Prime ministers of Israel",
 "title": "Menachem Begin"
}