{
 "id": "474923",
 "text": "William TyndaleSometimes spelled Tynsdale, Tindall, Tindill, Tyndall \"Tyndale\". Random House Webster's Unabridged Dictionary (c. 1484–1536) was an English scholar. He is well known for his translation of the Bible into English and for his later prosecution and execution.Moynahan, Brian 2003. William Tyndale: If God spare my life. London: Abacus. He was influenced by both Desiderius Erasmus, who made the Greek New Testament available in Europe, and Martin Luther.Partridge A.C. 1973. English biblical translation. London: Andrè Deutsch Limited. pp. 38–39, 52–52. The spread of the Wycliffe Bible led to strong measures to keep translations in the hands of the Catholic Church. There was a death sentence for any unlicensed possession of English Bibles, but translations in all other major European languages were allowed..Daniell, David 1994. William Tyndale: a biography. Yale University Press. Tyndale's translation was the first English Bible to draw directly from Hebrew and Greek texts and the first English one to take advantage of the printing press. That was seen as a direct challenge to the Roman Catholic Church. In 1530, Tyndale also wrote The Practyse of Prelates and opposed King Henry VIII's divorce on the grounds that it contravened Scripture. A copy of Tyndale's earlier The Obedience of a Christian Man fell into the hands of Henry VIII, who found the reasons that he used to break the Church of England from the Roman Catholic Church in 1534. Meanwhile, the agents of Chancellor Thomas More were searching in Europe for Tyndale,More was Chancellor of the Duchy of Lancaster (31 December 1525 – 3 November 1529) and Lord Chancellor (October 1529 – May 1532). As a royal servant, all if his letters during those years are recorded in the royal archives. who had taken refuge and hoped the Church would not get him. Eventually, in 1535, Tyndale was arrested and jailed outside Brussels for over a year. More was executed on 6 July 1535, and Tyndale was convicted of heresy in 1536 and executed by garrotting, and his body was burnt at the stake. Tyndale's last words were \"Lord, open the King of England's eyes.\" Two years later, Henry VIII authorized the so-called Great Bible for the Church of England, which was largely Tyndale's own work. Hence, the Tyndale Bible, as it was known, played a key role in spreading the Protestant Reformation. In 1611, the 54 scholars who produced the King James Version drew significantly from Tyndale and from translations that descended from his. One estimate suggests the New Testament in the King James Version is 83% Tyndale's and the Old Testament 76%., citing . In 2002, Tyndale was placed at number 26 in the BBC's poll of the 100 Greatest Britons... A primary school has since opened in his name. == References == == Other websites == * * * The Tyndale Society. * * * * William Tyndale's Bible * Documentary on how Tyndale translated the New Testament into English on jw.org Category:Year of birth unknown Category:1480s births Category:1536 deaths Category:Alumni of the University of Oxford Category:Bible translators Category:Deaths by strangulation Category:English Protestants Category:English Roman Catholic priests Category:English theologians Category:Executed English people Category:Former Roman Catholics Category:People from Gloucestershire Category:Protestant Reformers",
 "title": "William Tyndale"
}