{
 "id": "474943",
 "text": "A blockade runner is usually a lighter-weight ship used for slipping past a naval blockade of a port or strait. This is not the same as ships used to challenge the blocking ships to break the blockade. Very often blockade running is done in order to bring food or arms to a blockaded city. In other cases the blockade runners would carry mail in an attempt to communicate with the outside world. Carrying trade goods from blockaded ports is another function.Mark Thornton; Robert Burton Ekelund, Tariffs, Blockades, and Inflation: The Economics of the Civil War (Wilmington, DE: SR Books, 2004), p. 53 == Operations == Blockade runners are often the fastest ships available. They are usually lightly armed and armored. Their operations are quite risky since blockading fleets would not hesitate to fire on them. However, the potential profits (economically or militarily) from a successful blockade run are tremendous. Blockade-runners typically had excellent crews. Although similar to smugglers, blockade-runners are often operated by state's navies as part of the regular naval fleet. Notable users of blockade runners include the Confederate States of America during the American Civil War and Germany during both World War One and World War Two. == In history == * Peloponnesian War: there were numerous blockades. Leon of Salamis sent blockade runners to get reinforcements from Athens. * Punic Wars: the Carthaginian Empire attempted to get around Roman blockades of its ports. Blockade runners brought in supplies, but eventually the Romans won out.Michael Pitassi, The Navies of Rome (Woodbridge: Boydell Press, 2009), pp. 114–115 * American Civil War: during the early war the Confederate States of America had many successful blockade runners.Angus Konstam, Confederate Blockade Runner 1861-65 (Wellingborough: Osprey Publishing, 2004), p. 20 By the time Robert E. Lee surrendered at Appomattox blockade running could not make a difference and passed into history. == References == == Other websites == * The Blockade Runners * Civil War Cat-and-Mouse Game Category:Ship types",
 "title": "Blockade runner"
}