{
 "id": "475032",
 "text": "John O'Keefe, FRS FMedSci (born November 18, 1939) is an American-British neuroscientist. He is a professor at the Sainsbury Wellcome Centre for Neural Circuits and Behaviour and the Research Department of Cell and Developmental Biology at University College London. He is one of the most notable alumni of City College of New York. == Biography == O'Keefe is known for his discovery of place cells in the hippocampus. He discovered that they show a kind of coding for places. This is a positioning system, an “inner GPS” in the brain that makes it possible to orient ourselves in space. In 2014, he received the Kavli Prize in Neuroscience \"for the discovery of specialized brain networks for memory and cognition\", together with Brenda Milner and Marcus Raichle. He shared the one-half of the Nobel Prize in Physiology or Medicine in 2014 with May-Britt Moser and Edvard Moser, who shared the other half jointly.The 2014 Nobel Prize in Physiology or Medicine. Nobel Foundation O’Keefe and his student Jonathan Dostrovsky discovered place cells by systematically analyzing the environmental factors influencing the firing properties of individual hippocampal neurons.O'Keefe J. 1971. The hippocampus as a spatial map: reliminary evidence from unit activity in the freely-moving rat. Brain Research. 34 (1): 171–175. O'Keefe J. 1976. Place units in the hippocampus of the freely moving rat. Experimental neurology. 51 (1): 78–109. == Publications == His many publications on place cells have been highly cited. In addition, he published an influential book with Lynn Nadel, proposing the functional role of the hippocampus as a cognitive map for spatial memory function.O'Keefe J. & Nadel L. 1978. The hippocampus as a cognitive map. Oxford University Press. In extensions of his work, place cells have been analyzed experimentally or simulated in models in hundreds of papers.O'Keefe J. 1979. A review of the hippocampal place cells. Progress in neurobiology. 13 (4): 419–39. Moser E; Kropff E. & Moser M. 2008. Place cells, grid cells, and the brain's spatial representation system. Annual Review of Neuroscience. 31: 69–89. == References == Category:1939 births Category:Living people Category:Naturalised citizens of the United Kingdom Category:Fellows of the Royal Society Category:People from New York (state)",
 "title": "John O'Keefe"
}