{
 "id": "47504",
 "text": "A vibrator is a device that is made to vibrate against the body, thereby stimulating the nerves and giving a pleasurable and possibly erotic feeling. == History== The electrically powered vibrator was invented in the 1880s by doctors, who were treating women for \"hysteria\" for centuries by performing what today would be considered masturbation. At the time, however, not only did doctors regard the \"vulvular stimulation\" as having nothing to do with sex, they reportedly found that it took a lot of time to do and it was hard work. The vibrator did it more quickly and easily, and because of this it was very popular with doctors. Home versions soon started being made and they were also popular, with adverts in places like Needlecraft, Woman's Home Companion, Modern Priscilla and the Sears catalog. These disappeared in the 1920s, as their appearance in pornography made it harder for polite society to avoid the sexual connotations of the devices. As \"body massagers\", millions of vibrators have been sold to both men and women. Some people that buy vibrators only use them for pains. However, many people who purchase vibrators marketed as \"body massagers\" — and, presumably, most people who purchase vibrators marketed as adult toys — use them to get sexual pleasure, most often in masturbation. Vibrators often allow people to achieve orgasm more quickly and easily, and are often said to give stronger orgasms. They are often recommended by sex therapists for women who have difficulty reaching orgasm by other means. Couples also use them sometimes. Harper's Magazine notes a Durex survey that says 46% of women have vibrators near 2006. This may have been market research relating to their vibrating condom base product. The sale of vibrators and similar items was forbidden up until recently in several states in the southern United States. In Texas, the sale of vibrators and dildos is technically illegal, but many stores will sell such items provided that the customer signs a statement that the device will be used only for educational purposes. The law’s current status in real life is not certain. The states of Georgia, Alabama, Mississippi, Indiana, Virginia, Louisiana and Massachusetts have all had laws that prohibit vibrators, but most of them have been struck down by courts or are not enforced. Only the law in Alabama is generally enforced. == Types of erotic vibrators == An enormous range of vibrators exist, falling into several broad categories: * Clitoral – Often sold as \"back massagers\", these are powerful vibrators such as the Hitachi Magic Wand or the Acuvibe. * Dildo-shaped – Approximately penis-shaped. Can be made of plastic, silicone or latex. * Waterproof – Can be used wet, such as in the shower. Although marketed as waterproof, most should not be submerged. * Rabbit, 'Jackrabbit' or 'Rampant Rabbit' – Two pronged for stimulation of both the vagina and the clitoris. * G-spot – Similar to the usual vibrator, but with a curve and often a soft jelly-like coating. The curve makes it easier to use to stimulate the g-spot or prostate. Male penises or normal traditional vibrators sometimes are unable to reach the g-spot. It is possible to do only in some positions. The shape of a g-spot vibrator makes it easy to touch the g-spot. The size of a g-spot vibrator is usually 5-7 inches. ** Simple g-spot vibrator - straight shaft and curved tip. ** G-spot vibrator with teasers - allows stimulating several erogenous zones at the same time. ** G-spot vibrator with heads - have heads of different types that can be changed at will. ** Exotic g-spot vibrators - do not have the usual shape, but an exotic one; for example, a stick with a curve or semi-ring. * Egg – Egg shaped vibrator which can be used for stimulation of the clitoris or insertion into the vagina. The egg can be inserted into the vagina or rectum, or it can be used to vibrate against another erogenous zones in men and women. Egg vibrators are normally 2.5 to 5 centimeters long and 2 centimeters in width. They are normally made of metal, rubber, silicon, plastic, chrome, or a mixture of materials. There are several types of egg vibrators: ** Single egg vibrator - includes one vibrating item. ** Double egg vibrator - includes two vibrating items for double stimulation. ** Egg vibrator without wire. Some egg vibrators can be used with a remote control and do not have any wires. They have a cord for pulling out the egg. ** Egg vibrator with sleeves. The sleeves are removable covers, which can be sold separately. They are made of various elastic materials for intensive stimulation. * Pocket rocket – Shaped like a cylinder, one of its ends has some vibrating bulges. It is meant to stimulate the clitoris or nipples, not for vaginal insertion. * \"Undercover\" vibrators – Vibrators shaped as every-day objects, such as lipstick tubes, cell phones, or art pieces. * Anal vibrators – Vibrators made for anal use have either a flared base or a long handle to grip, to prevent them from slipping inside and getting lost. *Butterfly – vibrator strapped around legs and waist for hands- free clitoral stimulation during sexual intercourse * Vibrating Cockring – vibrator (usually cordless) inserted in or attached to a cock ring, usually for stimulation of the clitoris Most vibrators use internal batteries, but some of them have a power cord and must be plugged into an power socket to work. ==References== * Joani Blank, with Ann Whidden. Good Vibrations: The New Complete Guide to Vibrators, Down There Press, 2000. . == Other websites == *Antique Vibrator and Quack Medical Museum Category:Sex toys",
 "title": "Vibrator (sensual)"
}