{
 "id": "47511",
 "text": "The Anglo-Saxons were the dominant people living in England from the mid-5th century AD until the Norman conquest in 1066. They spoke Germanic languages and are identified by Bede as the descendants of three powerful tribes. These were the Angles, Saxons, and Jutes. Their language, Anglo-Saxon or Old English, came from West Germanic dialects. It changed into Middle English from about the 11th century. Old English was divided into four main dialects: West Saxon, Mercian, Northumbrian, and Kentish. The Anglo-Saxon culture replaced the Celtic culture in the area that is now England. Modern historians do not think that the Anglo-Saxons drove the Celts away, but instead that they became an upper class to the Celts in England, and the Celts then became part of the Anglo-Saxon culture. They created seven kingdoms in England. They never conquered Wales but Anglo-Saxon kings did claim overlordship from time to time.Nicholas Hooper; Matthew Bennett, The Cambridge Illustrated Atlas of Warfare: The Middle Ages, 768-1487 (Cambridge; New Yori: Cambridge University Press, 1996), p. 70 Some Anglo-Saxons came to Britain as warriors, but others came peacefully to become farmers or to raise families. == Anglo-Saxon migration == It is not known how many Anglo-Saxons actually came to Britain between the 4th and 6th century AD. Many sources say large numbers of Anglo- Saxon settlers arrived.The Oxford Handbookغ of Anglo-Saxon Archaeology, eds. Helena Hamerow; David A. Hinton; Sally Crawford (Corby: Oxford University Press 2010), p. 32 Because of this, some of the native Britons moved west, towards Wales and Cornwall. Others went to Armorica and became the Bretons. The language of the Anglo-Saxons, Old English, became the main language in southern Britain. A few Celtic and Latin words were borrowed into Old English. In the areas such as Kent, Sussex, Essex, Suffolk and Norfolk, many of the native Britons may have been driven out.Richard Coates, \"Celtic whispers: revisiting the problems of the relation between Brittonic and Old English\" (2017) In other areas, some Britons likely remained and were absorbed into Anglo-Saxon society.Toby F. Martin, The Cruciform Brooch in Anglo-Saxon England (2015: Boydell and Brewer Press), pp. 174-178 In 2011, a historian suggested that about 1 or 2 Anglo-Saxons came to England for every 10 Celts that were already there. == Angles, Saxons and Jutes == It was Bede who identified the invaders as Angles, Saxons and Jutes.Mark Harrison 1994. Anglo- Saxon Thegn AD 449-1066. London: Osprey, p3. But he sometimes used the names Angli and Saxones for the same people in different parts of his writings.William O. Frazer & Andrew Tyrell (eds) 2000. Social identity in early medieval Britain. Leicester University Press, p72. In Book I, Chapter 15 he said that by invitation of King Vortigern \"Angles or Saxons\" came to Britain in three longships.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revd. R.E. Latham. Penguin 1990, p62. Modern authorities confirm that Angles, Saxons, Frisians and some Jutes did come to England during this migration time period. The differences between the tribes that moved to England were not significant. Kent was different in culture from other parts of England, mostly because it had close contact with parts of Europe such as Gaul.Frank Stenton 1971. Anglo-Saxon England. Oxford University Press, p10. Certain styles of jewellery are recognized by archaeologists as being typical of Anglian, Saxon and Jutish areas in Northern Europe. But why the name England came to be used for the country and English for the language is not clear.Peter Hunter Blair & Simon Keynes 2003. An introduction to Anglo- Saxon England. Cambridge University Press, p10/11. In Old English the people called themselves Engle, and in Latin they were called Angli, but nothing suggests the Angles made up the largest percentage of the Germanic peoples in Britain. The name Englaland, which became 'England' was regularly used by the 11th century. == Celtic words for the Anglo-Saxons == The native British people, who wrote in both Latin and Welsh (a Celtic language), referred to these invaders as Saxones or Saeson. The latter name is still used today in the Welsh word for English people, Saeson,John Davies, The history of Wales (London; New York: Penguin Books, 1993), p. 57 the English language, Saesneg, and things related to England, Seisnig. In the Scottish Gaelic language the word for an English person is sasannach and in Irish the word is sasanach. == Art == Anglo-Saxon art before the time of Alfred (who ruled from 871 to 899) is a mixture of Anglo-Saxon and Celtic techniques and styles. The Sutton Hoo treasure is an excellent example of very early Anglo-Saxon metalwork and jewellery. It came from a royal grave of the early 7th century. The period between Alfred and the Norman Conquest saw a distinct Anglo-Saxon style in art. This was due in part to the revival of the English economy and culture after the end of the Viking raids. This later style appears to have been in touch with trends in western Europe. Anglo-Saxon art is mainly known today through illuminated manuscripts. Manuscripts were not the only Anglo-Saxon art form, but they have survived in much greater numbers than other types of objects. People in Europe at the time regarded Anglo-Saxon goldsmithing and embroidery as especially fine. The most common examples of Anglo-Saxon art are coins. Anglo-Saxon artists also worked in fresco, ivory, stone carving, metalwork and enamel, but few of these pieces have survived. ==Literature== Old English literary works include epic poetry, biography, sermons, Bible translations, legal works, chronicles, riddles and others. In all there are about 400 surviving manuscripts from the period. A very famous work from this period is the poem Beowulf. It has achieved national epic status in Britain. The Anglo-Saxon Chronicle is a collection of important early English history. Cædmon's Hymn from the 7th century is the earliest attested literary text in (Old) English. One of the most valuable and important sources on Anglo-Saxon history is Bede's Ecclesiastical History of the English Nation. == References == == Other websites == * On the origins of Britons - according to Brian Sykes * Fides Angliarum Regum: the faith of the English kings * Anglo-Saxon origins: the reality of the myth by Malcolm Todd Category:Germanic tribes",
 "title": "Anglo-Saxons"
}