{
 "id": "475364",
 "text": "The Division of Hindmarsh is an Australian Electoral Division in South Australia. It covers the western suburbs of Adelaide, including Adelaide Airport, Ascot Park, Brooklyn Park, Edwardstown, Fulham, Glenelg, Grange, Henley Beach, Kidman Park, Kurralta Park, Morphettville, Plympton, Richmond, Semaphore Park, Torrensville, West Beach and West Lakes. It was set up in 1903 and is named after Sir John Hindmarsh, who was Governor of South Australia 1836-38. ==Members== Image Member Party Term Notes James Hutchison Labour 1903– 6 December 1909 Previously held the South Australian House of Assembly seat of East Adelaide. Served as minister under Fisher. Died in office William Archibald Labor 1910 – 14 November 1916 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as minister under Fisher and Hughes. Lost seat William Archibald National Labor 14 November 1916 – 17 February 1917 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as minister under Fisher and Hughes. Lost seat William Archibald Nationalist 17 February 1917 – 1919 Previously held the South Australian House of Assembly seat of Port Adelaide. Served as minister under Fisher and Hughes. Lost seat Norman Makin Labor 1919 – 1946 Served as Speaker during the Scullin Government. Served as minister under John Curtin, Frank Forde and Ben Chifley. Retired. Later elected to the Division of Sturt in 1954. Albert Thompson Labor 1946 – 1949 Previously held the South Australian House of Assembly seat of Semaphore. Transferred to the Division of Port Adelaide Clyde Cameron Labor 1949 – 1980 Served as minister under Gough Whitlam. Retired John Scott Labor 1980 – 1993 Retired Chris Gallus Liberal 1993 – 2004 Previously held the Division of Hawker. Retired Steve Georganas Labor 2004 – 2013 Lost seat Matt Williams Liberal 2013 – 2016 Lost seat Steve Georganas Labor 2016 – 2019 Transferred to the Division of Adelaide Mark Butler Labor 2019 – present Previously held the Division of Port Adelaide. Incumbent ==Election results== ==Other websites== ==References== * ABC profile for Hindmarsh: 2013 * AEC profile for Hindmarsh: 2013 * Poll Bludger profile for Hindmarsh: 2013 * The Australian Political Almanac, 1st edition, Peter Wilson, 2002, Hardie Grant Books Category:Electoral divisions of South Australia Category:1903 establishments in Australia",
 "title": "Division of Hindmarsh"
}