{
 "id": "47543",
 "text": "Super Mario Bros. is a video game made by Nintendo in 1985. It is played on the Nintendo Entertainment System (NES). The game is the sequel to the game Mario Bros. In Super Mario Bros., Mario goes to the Mushroom Kingdom. There, he must save Princess Toadstool from Bowser. Players can also use Luigi in two-player mode. The game was made by Shigeru Miyamoto. The music was made by Kōji Kondō. Super Mario Bros. was a very important game because it quickly changed how games were made. It was the best-selling video game ever before being beaten by Wii Sports in 2009. It turned Mario into a famous symbol. It also made the NES successful. This game greatly helped the video game industry. ==Plot== Bowser has kidnapped Princess Toadstool, who is the princess of the Mushroom Kingdom. Mario must chase Bowser through eight worlds in the Mushroom Kingdom to rescue her, with the help of his brother, Luigi. ==Gameplay== Super Mario Bros. is a platform game. In the game, Mario must go through the Mushroom Kingdom and save Princess Toadstool (later Princess Peach) from Bowser.Instruction book, p. 7. Mario jumps, runs, and walks across each level. The worlds are full of enemies, platforms, and open holes. If Mario touches an enemy, he loses a life (he dies). If he falls down a hole or misses a jump, he will also lose a life. If all lives are gone, the game is over and the player must start over.Instruction book, p. 12. Mario starts the game as Small Mario, but has several power-ups he can get from golden floating boxes called \"? Blocks\". A red and white mushroom called a Super Mushroom will turn him into Super Mario (he gets bigger). If Super Mario touches an enemy, he gets smaller instead of dying. If Super Mario hits a ? Block that has a power-up, a Fire Flower will come out; the Fire Flower will give him the power to throw fireballs, which can defeat enemies. If he gets hit as Fire Mario, he will go back to being Small Mario. Each world is divided into four levels. Some levels are underground and others are underwater. When Mario is underwater, he cannot jump on any enemy and he will shrink or die if he touches one. The fourth level of every world is a castle. Mario faces lava, fire bars, and other enemies in this level. At the end of the level is Bowser, who stands over a lava pit. Mario can throw fireballs to defeat Bowser. He can also jump over or run under Bowser to an axe. Touching the axe will destroy the bridge and cause Bowser to fall into the lava, defeating him. Toadstool's servant, Toad, will then tell Mario that the princess is in another castle. The eighth boss is the real Bowser and instead of Toad, the princess is there. Saving Princess Toadstool unlocks a hard mode and lets the player choose a world on the title screen. ==Impact== Super Mario Bros. was both the launch game and a well-liked game for the Nintendo Entertainment System. This and Duck Hunt were bundled with every NES sold, and the game sold 40 million units as a result. There is also a version of the game with Duck Hunt and World Class Track Meet, which is for the NES Power Pad. There is also a cartridge that has only Super Mario Bros. and Duck Hunt. The game's main theme, which plays in any level that takes place outdoors, is very well known. It was composed by Koji Kondo, who has been in many other Nintendo games after Super Mario Bros., like The Legend of Zelda and Super Mario Bros. 2. The game would later have updated versions such as Super Mario All-Stars and Super Mario Bros. Deluxe. The second one adds more modes like the Japanese-exclusive sequel Super Mario Bros.: The Lost Levels. The game's design was also usable in the Super Mario Maker series. ==Gallery== NES Super Mario.png|NES cartridge inside the console HVC-001 with HVC-SM 20200913.jpg|Famicom cartridge inserted the console Vs. Super Mario Bros.jpg|The arcade version, VS. Super Mario Bros. Super Mario Bros. Game & Watch by Nintendo, Model YM-105, Made In Japan, Copyright 1988 (Handheld Electronic Game).jpg|Game & Watch version of Super Mario Bros. ==References== Category:1985 video games Category:Arcade games Category:Famicom Disk System games Category:Game Boy Advance games Category:Mario platform games Category:Multiplayer and single- player video games Category:Nintendo Entertainment Analysis and Development games Category:Nintendo Entertainment System games Category:Pack-in video games Category:Side-scrolling platform games Category:Video games developed in Japan Category:Virtual Console games for Wii U",
 "title": "Super Mario Bros."
}