{
 "id": "475690",
 "text": "Power Rangers Ninja Storm is a TV show Power Rangers started in 2003. It debuted on ABC Kids. It aired from February 8 to November 22, 2003, 40 episodes. This was the first season filmed in New Zealand. It was the first season made entirely by Disney. It was the first season to have Australian and New Zealand actors (speaking in American accent). It is based on the Super Sentai series Ninpuu Sentai Hurricaneger. It is the sequel to Power Rangers Wild Force. A sequel to called Power Rangers Dino Thunder started in 2004. Takuya Kimura - 12 ￼￼8￼￼- ￼￼ Scott Sharp￼￼ ￼￼1￼￼- ￼￼ Tony Stewart￼￼ ￼￼11￼￼- ￼￼ Billy Boat￼￼ ￼￼77￼￼- ￼￼ Stephan Grégoire￼￼ ￼￼35￼￼- ￼￼ Jeff Ward￼￼ ￼￼4￼￼- ￼￼ Scott Goodyear￼￼ ￼￼99￼￼- ￼￼ Sam Schmidt￼￼ ￼￼30￼￼- ￼￼ Raul Boesel￼￼ ￼￼12￼￼- ￼￼ Buzz Calkins￼￼ ￼￼51￼￼- ￼￼ Eddie Cheever￼￼ 19-￼￼ Hiroshi Yamauchi - 12 Stan Wattles￼￼, 27-￼￼ Robbie Groff￼￼ 40-￼￼ Jack Miller￼￼ 53-￼￼ Jim Guthrie￼￼ - 1 ==Plot== Three rebellious students are the last ones remaining at their ninja academy after evil aliens attack the Earth. With mankind at the brink of destruction, the fate of the world lies in their hands. ==Characters== Actor Name Rangers Zord Pua Magasiva Shane Clarke Red Wind Ranger Hawkzord Sally Martin Tori Hanson Blue Water Ranger Dolphinzord Glenn McMillan Waldo \"Dustin\" Brooks Yellow Earth Ranger Lionzord Adam Tuominen Hunter Bradley Crimson Thunder Ranger Crimson Insectizord Jorgito Vargas Jr. Blake Bradley Navy Thunder Ranger Navy Beetlezord Jason Chan Cameron \"Cam\" Watanabe Green Samurai Ranger Samurai Star Chopper ==Cast and Characters== ===Rangers=== * Pua Magasiva as Shane Clarke, the Red Wind Ranger. * Sally Martin as Tori Hanson, the Blue Water Ranger. * Glenn McMillan as Waldo \"Dustin\" Brooks, the Yellow Earth Ranger. * Adam Tuominen as Hunter Bradley, the Crimson Thunder Ranger. * Jorgito Vargas Jr. as Blake Bradley, the Navy Thunder Ranger. * Jason Chan as Cameron \"Cam\" Watanabe, the Green Samurai Ranger. ===Supporting character=== * Grant McFarland as Sensei Kanoi Watanabe. ====Guest cast==== * Wild Force ** Ricardo Medina Jr. as Cole Evans, Red Wild Force Ranger. ** Alyson Kiperman as Taylor Earhardt, Yellow Wild Force Ranger. ** Philip Jeanmarie as Max Cooper, Blue Wild Force Ranger. ** Jessica Rey as Alyssa Enrile, White Wild Force Ranger. ** Jack Guzman as Danny Delgado, Black Wild Force Ranger. ** Philip Andrew as Merrick Ballton, the Luna Wolf Ranger ** Ilia Volok as Ancient and Reincarnated Master Org. ** Sin Wong as Toxica. ===Villains=== *Grant McFarland as Lothor **Daniel Sing as Young Kiya Watanabe *Katrina Devine as Marah *Katrina Browne as Kapri *Peter Rowley as the voice of Zurgane *Bruce Hopkins as the voice of Choobo *Michael Hurst as the voice of Vexacus *Craig Parker as the voice of Motodrone *Jeremy Birchall as the voice of Shimazu == References == Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Ninja Storm"
}