{
 "id": "47574",
 "text": "James Ramsay MacDonald (; 12 October 18669 November 1937) was a British politician and Prime Minister of the United Kingdom three times. He helped to build the Labour Party and became its first Prime Minister in 1924. His third period as Prime Minister was during the crisis of the Great Depression, when he formed a \"National Government\" in which a majority of MPs were from the British Conservative Party. He was expelled from the Labour Party. MacDonald was an illegitimate child. He was born in Lossiemouth, Scotland. He graduated from elementary school and then high school. Later he worked as a teacher for some time in his high school. In 1885, MacDonald became a member of the Social Democratic Federation. In 1886, he moved to London, where he became an accountant. On November 13, 1887, MacDonald witnessed Bloody Sunday, after which he published a pamphlet. For some time, MacDonald was also interested in Scottish politics among Scots in London and spoke in support of Scotland for Scotland. At the same time, MacDonald received an evening education at the Birkbeck Literary and Scientific Institution, but shortly before the exams he had to give up his education due to nervous exhaustion. == As Prime Minister == The main achievement of the first MacDonald government was the realization by the British that Labour did not intend to carry out radical changes, but was ready to act for the common good. At the same time, due to lack of public support and a lack of seats in the House of Commons, Labour had not been able to do much of what it had said it would do - in particular, there was no widespread nationalization and community service. Category:1866 births Category:1937 deaths Category:Members of the British House of Commons for Scottish constituencies Category:UK MPs 1906–1910 Category:UK MPs 1910 Category:UK MPs 1910–1918 Category:UK MPs 1922–1923 Category:UK MPs 1923–1924 Category:UK MPs 1924–1929 Category:UK MPs 1929–1931 Category:UK MPs 1931–1935 Category:UK MPs 1935–1945 Category:Labour Party (UK) MPs Category:People from Moray",
 "title": "Ramsay MacDonald"
}