{
 "id": "475793",
 "text": "Power Rangers Dino Thunder is a TV show Power Rangers started in 2004. It aired on ABC Kids (and Jetix). It aired from February 7, to November 27, 2004, 40 episodes. The show is notable for bringing back Jason David Frank. He played Tommy Oliver (one of the most liked characters of the franchise) in Mighty Morphin Power Rangers. It is based on the Super Sentai series Bakuryu Sentai Abaranger. It is the sequel to Power Rangers Ninja Storm. A sequel to it called Power Rangers S.P.D. started in 2005. ==Plot== A team of unlikely personalities join forces to help save the Earth from the scheming Mesogog, a dinosaur-like villain who wishes to destroy humankind. ==Characters== Actor Name Rangers Zords James Napier Connor McKnight Dino Thunder Red Ranger Tyrannosaurus Kevin Duhaney Ethan James Dino Thunder Blue Ranger Triceratops Emma Lahana Kira Ford Dino Thunder Yellow Ranger Pterosaurus Jason David Frank Tommy Oliver Dino Thunder Black Ranger Brachiosaurus Jeffrey Parazzo Trent Fernandez Dino Thunder White Ranger Tupuxuara ==Cast== ===Rangers=== * James Napier as Connor McKnight, the Red Dino Ranger. * Kevin Duhaney as Ethan James, the Blue Dino Ranger. * Emma Lahana as Kira Ford, the Yellow Dino Ranger. * Jason David Frank as Tommy Oliver, the Black Dino Ranger. * Jeffrey Parazzo as Trent Fernandez, the White Dino Ranger. ===Supporting characters=== * Ninja Storm ** Pua Magasiva as Shane Clarke, the Red Wind Ranger. ** Sally Martin as Tori Hanson, the Blue Wind Ranger. ** Glenn McMillan as Waldo \"Dustin\" Brooks, the Yellow Wind Ranger. ** Adam Tuominen as Hunter Bradley, the Crimson Thunder Ranger. ** Jorgito Vargas Jr. as Blake Bradley, the Navy Thunder Ranger. ** Jason Chan as Cameron \"Cam\" Watanabe, the Green Samurai Ranger. ** Grant McFarland as Sensei Kanoi Watanabe. ===Villains=== * Mesogog (portrayed by Latham Gaines) - The dinosauroid evil side of Anton Mercer (who is also played by Latham Gaines) caused by an experiment with dinosaur DNA gone wrong. They both share a Jekyll and Hyde relationship, Mesogog was destroyed by the Power Rangers. * Elsa (portrayed by Miriama Smith) - A minion of Mesogog who posed as Principal Randall at Reefside High School, Elsa was turned to a normal human by Mesogog's machine. * Zeltrax (voiced by James Gaylyn) - Terrence \"Smitty\" Smith was a former associate of Tommy Oliver. After Tommy's applications were accepted by Anton Mercer, Terrence was approached by the head of a rival company. While working on a breakthrough, Terrence was caught in a sudden lab explosion and his body was found by Mesogog who recreated him as an ammonite-themed cyborg, Zeltrax was destroyed by Tommy and Kira. * White Dino Ranger Clone (voiced by Adam Gardiner) - An evil clone of the White Dino Ranger created by Zeltrax from Copyotter's salvaged ability and the Geno-Randomizer. * Tyrannodrones - The cybernetic dinosauroid foot soldiers of Mesogog that were originally created by Tommy Oliver and Anton Mercer from a combination of dinosaur DNA and technology to be used for good until they were reprogrammed by Mesogog. The Tyranndrones were created for Dino Thunder, and don't have a Super Sentai counterpart, the Tyrannodrones were destroyed along with Mesogog's base. * Triptoids - The black and white amoeba-themed creatures originally from the video game \"Wizard Wood\" who were recruited and became Mesogog's alternate foot soldiers while also working for Zeltrax. The Triptoids later returned in Power Rangers Beast Morphers where they were revived by Ryjack to assist him in fighting the Beast Morpher Rangers. The Sentai counterparts are called Barmia Soldiers, and were the main foot soldiers in Abaranger. == References == Category:Mighty Morphin Power Rangers Category:English-language television programs",
 "title": "Power Rangers Dino Thunder"
}