{
 "id": "47583",
 "text": ":For the general concept of species moving around, see migration. For people moving data around see data migration. Human migration is people moving from one place to another. Migration can be within countries or between countries, and it often involves large groups of people. Humans are known to have migrated extensively throughout history and prehistory. Sometimes, the movement is voluntary, but sometimes, people are forced to move. They may suffer warfare, religious and political persecution, famine, and other natural disasters. When people are forced to move, they are refugees. Many refugees are illegal immigrants and more than half are children and women. They may live in extreme poverty, lacking food, shelter, clothing, education and medical care. ==Urbanisation(rural to urban migration)== Rural-urban migration, or urbanisation, is the movement from country areas to towns and cities. There are many reasons for people leaving the countryside. Often, they are overpopulation, high birth rates, and starvation. Mechanization has caused a reduction in jobs available in the countryside. Farming is hard work, with long hours and little pay. Many are subsistence farmers. In developing countries, a lack of money means a lack of machinery. Natural disasters, such as droughts, hurricanes, floods and volcanic eruptions, destroy villages and crops. There is a lack of services like schools and hospitals in the countryside. People move because they are looking for better-paid jobs and a higher quality of life. They have a better chance of services such as schools, medical treatment and entertainment. People are also attracted often by the advantages of a cosmopolitan lifestyle such as shops, restaurants, theatres, and nightlife. Many arrive with little money and so cannot buy or rent a house, even if one is available. They must usually make a temporary shelter with cheap or use materials. Some give up and go home. Many children of migrant worker struggle for education. In the new country, they often are not integrated and are treated like an underclass. However, they are needed even if the local population does not like immigrants because they compete for the same jobs. More people means more traffic and more crime. Immigrants help to build up cities, provide cheap labour, invest money, buy products and services, pay tax, and help companies compete. ==Ancient times== The Proto- Indo-Europeans migrated many times between 4000 and 1000 BC, according to the Kurgan hypothesis. ==Modern times== The movement of populations in modern times has continued under the form of both voluntary migration within one's region, country, or beyond, and involuntary migration, which includes slave trade, human trafficking, and ethnic cleansing. The people who migrate are called migrants or, more specifically, emigrants, immigrants or settlers, depending on the historical setting, circumstance, and perspective. Many people have died while migrating. ==References== == Other websites == * Metropolitan Museum page on Lapita culture * An mtDNA view of the peopling of the world by Homo sapiens * National Geographic: Atlas of the Human Journey (Haplogroup-based human migration maps) * Journey of Mankind : the Peopling of the World * Stalker's Guide to International Migration * Diplomacy Monitor - Migration * Global Culture: essays on migration and globalization * Here and away. Living in two worlds. A case study of international and internal migration in a small European country (1945-2000) Category:Migration",
 "title": "Human migration"
}