{
 "id": "476034",
 "text": "A media franchise, also known as a multimedia franchise and transmedia franchise, is a collection of related media in which several derivative works have been produced from an original creative work of fiction, such as a movie, a work of literature, a television program or a video game. The greatest best known famous original media franchise feature series including Disney (Mickey Mouse, Winnie the Pooh, Snow White and the Seven Dwarfs, etc.), DC Comics (Superman, Batman, Wonder Woman, etc.) and Marvel Comics (Spider-Man, Hulk, X-Men, etc.). ==Transmedia franchise== Multimedia franchises usually develop through a character or fictional world becoming popular in one medium, and then expanding to others through licensing agreements, with respect to intellectual property in the franchise's characters and settings. Disney, DC Comics and Marvel Comics famous franchises including Mickey Mouse, Winnie the Pooh, Snow White and the Seven Dwarfs, Superman, Batman, Wonder Woman, Spider- Man, Hulk and X-Men. As one author explains, \"For the studios, a home-run is a film from which a multimedia 'franchise' can be generated; the colossally expensive creation of cross-media conglomerates predicated on synergistic rewards provides an obvious imperative to develop such products.\"Barry Langford, Post-classical Hollywood: Film Industry, Style and Ideology Since 1945, p. 207, . The trend later developed wherein franchises would be launched in multiple forms of media simultaneously; for instance, the movie The Matrix Reloaded and the video game Enter the Matrix were produced at the same time, using the same actors on the same sets, and released on the same day. Several other franchises throughout the 2000s had movies and games released within days of each other, including King Kong, Star Wars, Harry Potter, Disney, DC Comics, Marvel Comics, The Lord of the Rings, The Chronicles of Narnia, Pirates of the Caribbean, and Transformers.Harry J. Brown, Videogames and Education (2008), p. 41, . ===Fiction=== Long-running franchises were common in the early studio era, when Hollywood studios had actors and directors under long-term contract. Examples include Andy Hardy, Ma and Pa Kettle, Mickey Mouse, Bugs Bunny, Daffy Duck, Marilyn Monroe, Bulldog Drummond, Superman, Wonder Woman, Spider-Man, Hulk, X-Men, Tarzan, and Batman. The longest-running modern movie franchises include James Bond, Godzilla and King Kong, Friday the 13th, A Nightmare on Elm Street, Universal Monsters, and Star Trek. In such cases, even lead actors are often replaced as they age, lose interest, or their characters. ===Non-fiction=== Non-fiction literary franchises include the For Dummies and Complete Idiot's Guides reference books. An enduring and comprehensive example of a media franchise is Playboy Enterprises, which began expanding well beyond its successful magazine, Playboy, within a few years after its first publication, into such enterprises as a modeling agency, several television shows (Playboy's Penthouse, in 1959), and even its own television channel. Twenty-five years later, Playboy released private clubs and restaurants, movie theaters, a radio show, direct to video movies, music and book publishing (including original works in addition to its anthologies of cartoons, photographs, recipes, advice, articles or fiction that had originally appeared in the magazine), footwear, clothing of every kind, jewelry, housewares (lamps, clocks, bedding, glassware), guitars and gambling, playing cards, pinball machines and pet accessories, billiard balls, bedroom appurtenances, enhancements, plus countless other items of merchandise. ==Related pages== *Movie series *Prequel *Sequel *Spin-off (media) *Spiritual successor *Trilogy == References == Category:Media franchises",
 "title": "Media franchise"
}