{
 "id": "476984",
 "text": "SummerSlam (2006) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It was held on August 20, 2006 at TD Banknorth Garden in Boston, Massachusetts. It was the nineteenth SummerSlam event held by the WWE. This was the first inter-branded pay-per-view that featured the ECW brand. The main match for the Raw brand saw Edge defeat John Cena and successfully defend his WWE Championship. Edge defeated Cena by pinfall after he hit Cena in the back of the head with a pair of brass knuckles. The main match for the SmackDown! brand was a match between Batista and King Booker for the World Heavyweight Championship. Batista won the match by disqualification after Queen Sharmell interfered in the match. Since Batista won by disqualification, he did not win the championship. The main match for the ECW brand saw The Big Show defeat Sabu in an Extreme rules match for the ECW World Championship. Big Show won the match by pinfall and retained the title after he chokeslammed Sabu through a table. ==Matches== # Matches Stipulations Times 1D Carlito defeated Rob Conway Singles match 4:20 2 Chavo Guerrero defeated Rey Mysterio Singles match 11:00 3 Big Show (c) defeated Sabu Extreme Rules match for the ECW World Championship 8:30 4 Hulk Hogan defeated Randy Orton Singles match 10:56 5 Ric Flair defeated Mick Foley (with Melina) \"I Quit\" match 12:47 6 Batista defeated King Booker (c) (with Queen Sharmell) by disqualification Singles match for the World Heavyweight Championship 10:30 7 D-Generation X (Triple H and Shawn Michaels) defeated Mr. McMahon and Shane McMahon Tag team match 13:02 8 Edge (c) (with Lita) defeated John Cena Singles match for the WWE Championship 15:40 (c) – refers to the champion(s) heading into the match D – indicates that the match was a dark match ==References== ==Other websites== *Official SummerSlam 2006 website Category:2006 in American television Category:2006 in professional wrestling Category:Sports in Boston Category:SummerSlam Category:2006 in the United States Category:2000s in Boston",
 "title": "SummerSlam (2006)"
}