{
 "id": "47693",
 "text": "Guayana Esequiba is the name Venezuela gives to a region that it claims in the west of Guyana. Its area is 159,500 square kilometers. For Guyana, this area is divided into the six administrative regions of Barima-Waini, Cuyuni- Mazaruni, Pomeroon-Supenaam, Potaro-Siparuni, Upper Takutu-Upper Essequibo and Essequibo Islands-West Demerara. The dispute over this territory is guided by the Geneva Agreement, which was signed by the United Kingdom, Venezuela, and British Guiana in the year of 1966. According to this treaty, all parties are to find a practical, peaceful and satisfactory solution to the dispute.Agreement to resolve the controversy over the frontier between Venezuela and British Guiana (Treaty of Geneva, 1966) from UN If no progress is made, the matter is to be sent to an \"appropriate international organ\" or, if this cannot be agreed upon either, to the Secretary-General of the United Nations. The Secretary-General took the dispute to the International Court of Justice. On 18 December 2020, the ICJ accepted the case .Summary of the Judgement of 18 December 2020 == History == The Essequibo river was discovered by Spanish explorers and the region was colonized by the Dutch who made settlements and plantations in the area. For hundreds of years, disputes over the land occurred but no official boundary was agreed upon between the Spanish and Dutch. A significant portion of the Dutch land was later given to the British in 1814. Historically, Venezuela claimed a majority of the land west of the Essequibo river. Britain and Venezuela argued over the boundary between British Guiana and Venezuela for much of the 19th century. In 1895, after Britain expanded further west, Venezuela sought help from the United States of America to resolve the border dispute. Britain was pressured by the United States of America to negotiate with Venezuela and both presented their case to an arbitration committee in Paris. Britain and Venezuela accepted the decision of the Tribunal in 1899 and finalized their border in 1905. Venezuela reluctantly agreed to the border but, internally within the country, there was disappointment with the result. Venezuela raised the issue again in 1962, four years before Guyana won independence from Britain. At a meeting in Geneva in 1966, the two countries agreed to hear ideas from a representative of the UN Secretary General on ways to settle the dispute peacefully. There are still diplomatic contacts between the two countries and the Secretary General's representative.Narine Singh, Jai. 1982: Diplomacia o guerra. Análisis de la controversia fronteriza entre Venezuela y Guyana. Eduven. Caracas. 223p. Cabrera Sifontes, 1988: La verdad sobre nuestra Guayana Esequiba. Monte Ávila Editores, C.A. Caracas. 161p. González Oropeza, Hermann. y Donis Ríos, Manuel. 1989: Historia de las fronteras de Venezuela. Cuadernos Lagoven. Lagoven, S.A. Caracas. 180p. Venezuelan maps drawn since 1970 show all the area from the eastern bank of the Essequibo, including the islands in the river, as Venezuelan territory. On some maps, the western Essequibo region is called the \"Zone of Reclamation\".The Trail of Diplomacy - A Documentary History of the Guyana-Venezuela Border Issue by Dr.Odeen Ishmael http://www.guyana.org/features/trail_diplomacy.html In March 2024, Venezuela passes a law that designates Essequibo as the constituent state of Venezuela.Le Monde - Le Venezuela adopte une loi affirmant sa souveraineté sur l’Essequibo, actuel territoire du Guyana https://www.lemonde.fr/international/article/2024/03/23/le-venezuela-adopte- une-loi-affirmant-sa-souverainete-sur-l-essequibo-actuel-territoire-de- guyana_6223636_3210.html ==References== Category:History of Venezuela Category:Geography of Guyana",
 "title": "Guayana Esequiba"
}