{
 "id": "477286",
 "text": "SummerSlam (2004) was a professional wrestling pay-per-view show made by World Wrestling Entertainment (WWE). It was held on August 15, 2004 at Air Canada Centre in Toronto, Ontario. It was the seventeenth SummerSlam event held by the WWE. The main match for the Raw brand saw Randy Orton defeat Chris Benoit to win the World Heavyweight Championship. Orton won the match by pinfall after he performed an RKO on Benoit. By winning the championship, Orton became the youngest World Heavyweight Champion in WWE history. The main match for the SmackDown! brand was a match between John \"Bradshaw\" Layfield and The Undertaker for the WWE Championship. JBL won the match by disqualification after The Undertaker hit him with the championship. ==Matches== # Matches Stipulations Times 1H Rob Van Dam defeated René Duprée Singles match 9:38 2 The Dudleys (Bubba Ray, D-Von, and Spike Dudley) defeated Rey Mysterio, Billy Kidman, and Paul London Six-man tag team match 8:07 3 Kane defeated Matt Hardy (with Lita) \"Till Death Do Us Part\" match 6:08 4 John Cena defeated Booker T Singles match; this was match one of a best of five series for the WWE United States Championship 6:26 5 Edge (c) defeated Chris Jericho and Batista Triple threat match for the WWE Intercontinental Championship 8:25 6 Kurt Angle (with Luther Reigns) defeated Eddie Guerrero by submission Singles match 13:39 7 Triple H (with Ric Flair) defeated Eugene Singles match 14:08 8 John \"Bradshaw\" Layfield (c) (with Orlando Jordan) defeated The Undertaker by disqualification Singles match for the WWE Championship 9:05 9 Randy Orton defeated Chris Benoit (c) Singles match for the World Heavyweight Championship 20:07 (c) – refers to the champion(s) heading into the match H – indicates that the match was shown before the pay-per-view on Sunday Night Heat ==References== ==Other websites== *Official SummerSlam 2004 website Category:2004 in professional wrestling Category:Sport in Toronto Category:SummerSlam Category:2004 in Canada Category:21st century in Toronto Category:August 2004 events",
 "title": "SummerSlam (2004)"
}