{
 "id": "477211",
 "text": "Many animals have one or more special escape reflexes. These get the animal out of trouble quickly. They use special nervous structures to do this. Examples: *Crayfish: the sensory hairs of the tail fan of crayfish are connected to a reflex arc. Giant sensory and motor nerves are connected with electrical synapses. This flicks the tail, and shoots the crayfish away from the stimulus. The neurons bypass the main neural system that controls locomotion, so shortening the reaction time. The lateral giant connection to motor giant fast flexor neurons was the first known example of an electrical synapse.Furshpan E.J. & Potter D.D. 1957. Mechanism of nerve-impulse transmission at a crayfish synapse. Nature 180: 342-343. Edwards D.H; Heitler W.J. & Krasne F.B. 1999. Fifty years of a command neuron: the neurobiology of escape behavior in the crayfish. Trends in Neurosciences 22: 153-160. *Squid: The squid giant axon is the very large (up to 1 mm in diameter; typically around 0.5 mm) axon that controls part of the water jet propulsion system in squid. It was first described by L.W. Williams in 1909,Williams, L.W. 1909. Anatomy of the Common Squid. American Museum of Natural History. but this discovery was forgotten until English zoologist J.Z. Young demonstrated the axon’s function in the 1930s.Young J.Z. 1939. Fused neurons and synaptic contacts in the giant nerve fibers of cephalopods. Phil. Trans. Roy. Soc 229:465-503 Squids use this system for making brief but very fast movements through the water. *Most fish have a special response system known as \"C-start\". It is done by the Mauthner cells. They are a pair of big neurons (one for each half of the body) in the rhombomere 4 of the hindbrain in fish and amphibians. The cells are also notable for their unusual use of both chemical and electrical synapses.Korn H. & Faber D.S. 2005. The Mauthner cell half a century later: a neurobiological model for decision-making?. Neuron 47 (1): 13–28. *Humans: We do have some escape reflexes (not just reflex arcs). We have a head ducking reflex, and a fast hand withdrawal if we touch a painful object. These reflexes are subconscious: the conscious brain only knows about them afterwards. Escape reflexes have high survival value. == References == Category:Reflexes",
 "title": "Escape reflex"
}