{
 "id": "477586",
 "text": "Cats can be many different breeds and fur coat colors. A pink cat is not a color found in nature. But several pink cats have been reported about in the news media. Sometimes the cat colour has been changed to pink with chemicals or dyes. There are also several fictional pink cats in popular culture. == Real pink cats == In September 2005, a cat named Brumas roamed away from his owners in Launceston, Cornwall. When he came back after a short time, his fur was coloured pink. No one ever figured out the cause of the colour change. Brumas was taken to the RSPCA to be tested. He did not have any toxins. Russian writer Lena Lenia had dyed a Kitten pink in early 2015, which meant led to the confusion that they thought that Kitten died from being dyed pink, and then the kitten was okay from the owner having that kitten still. In September 2010, a cat with dyed pink fur was found in Swindon, South West England. The RSPCA said the dyeing was a \"sick prank\". Even though they tried to wash the color out of the cat's fur, it stayed pink. The cat did not have any signs of side-effects or harm. The event made worldwide news. Soon the owner told the truth. She said that the cat had been dyed pink using food colouring because she was a fan of the colour. She said the act \"seemed like a good idea. I always wanted a pink animal - a bit like my hair\". She said she read the instructions carefully and the food colouring could not be harmful because it was safe for humans to eat. The RSPCA decided not to arrest her for harming her animal. In May 2011, four kittens were found in a concrete factory in Redruth, Cornwall. One kitten had pink fur. A cat rescue group named \"Cats Protection\", tried to wash out the color with shampoo, but could not. Pollution from a steel factory in Port Talbot, Wales, has turned cats both pink and grey. Cats having pink patches are found in Bulgaria. The color is probably a genetic mutation and is very close to orange. They are usually pink-white bicolor; or pink-blue-white or pink-black-white calico cats. Sometimes the lilac or cream fur color of cats is confused with pink. Lilac and cream are both natural colors in cats, and are the diluted (lighter) versions of chocolate and red. == Fictional pink cats == The Pink Panther is a cartoon cat that was created by Friz Freleng. He is seen in the opening titles of the Peter Sellers movies with his own theme music. He also had his own cartoon show. Animation historian Jerry Beck has said the cartoon cat is \"anti-authority – he's cool yet he's pink\". The character of the children's television series Bagpuss was a pink cat. The Bagpuss puppet was really supposed to be an orange marmalade colour. When the puppet was made, it was dyed pink by mistake. Another children's franchise, Strawberry Shortcake, has a pink cat named Custard who is the pet of the titular character. In 2channel/2ch, Shii is a pink cat. In 2014, a Dutch artist, Florentijn Hofman, made a tall pink cat for an exhibition in Century Park, Shanghai. Princess Carolyn from BoJack Horseman is a pink cat. There is also a pink cat in the children's show “Pete the cat” named Callie. == References == == Other websites == Category:Fictional cats",
 "title": "Pink cat"
}