{
 "id": "477505",
 "text": "Adventure fiction is a type of fiction in which an adventure forms the main storyline. The adventure is usually an exciting undertaking involving risk and physical danger. Author Malins describes adventure fiction as the story \"of the hero—individual or group—overcoming obstacles and dangers and accomplishing some important and moral mission.\"Joyce G. Saricks, The Readers' Advisory Guide to Genre Fiction (Chicago: ALA Editions, 2009), p. 15 The characters in an adventure fiction are highly sympathetic. They are also ones the reader can easily relate to. There has to be a conflict to overcome and a clever villain to stop.Holly Koelling, Classic Connections: Turning Teens on to Great Literature (Westport, CT: Libraries Unlimited, 2004), pp. 172–173 == The hero == A key part of many adventure fictions is the hero. In most stories the hero has to succeed. At the same time the hero may be the least interesting character in the story.Margaret Bruzelius, Romancing the Novel: Adventure from Scott to Sebald (Lewisburg: Bucknell University Press, 2007), p. 74 The hero is often timid, submissive and easily pushed around. The hero may be a superhero, a spy, a detective or even an antihero.Encyclopedia of Media and Communication, ed. Marcel Danesi (Toronto; Buffalo; London: University of Toronto Press, 2013), p. 11 But the hero manages to meet the challenge. All great adventure heroes seem to find the ability to beat their enemies or win over hostile environments. Sometimes the villain wins. In Edgar Allan Poe's story The Cask of Amontillado, the villain is the narrator of the story. Sometimes the villain wins only to be confronted again in a sequel. == The genre == In many adventure fictions, the adventure takes place in foreign lands or exotic places.The Guide to United States Popular Culture, eds. Ray Broadus Browne; Pat Browne (Bowling Green, OH: Bowling Green State University Popular Press, 2001), p. 12 One of the earliest adventure fiction writers was Daniel Defoe. His stories of Robinson Crusoe and Captain Singleton helped set the standards for the adventure fiction genre. Another British author Sir Walter Scott built on the formula. He combined history with adventure fiction. His historical romance novels Waverley, Rob Roy and Ivanhoe were classic adventures. They helped the reader understand the hero and gave him a code of chivalry. French author Alexandre Dumas wrote The Three Musketeers, The Count of Monte Cristo and Man in the Iron Mask. These were very popular in Europe and America. His stories had strong elements of revenge and forgiveness. James Fenimore Cooper in his adventure stories The Pioneers, The Last of the Mohicans and The Pathfinder were set in exotic new world locations. But Cooper changed the aristocratic hero into one who was noble even though not born into the nobility. == References == == Other websites == * The 200 Greatest Adventure Novels of All Time * Popular Adventure Fiction Books Category:Fiction genres",
 "title": "Adventure fiction"
}