{
 "id": "477697",
 "text": "Renzo De Felice (8 April 1929 – 25 May 1996) was an Italian historian. He was born in Rieti and studied at the Sapienza University of Rome. In his youth De Felice joined the Italian Communist Party. He left the party after the Hungarian Revolution of 1956.Return to Normalcy or a New Beginning: Concepts and Expectations for a Postwar Europe Around 1945, eds. Joachim Lund; Per Øhrgaard (Copenhagen: Copenhagen Business School Press, 2008), p. 68 He wrote more than 20 books and a large number of essays based on his extensive research.Emilio Gentile, 'Renzo De Felice: A Tribute', Journal of Contemporary History, Vol. 32, No. 2 (Apr., 1997), p. 140 He was especially known for his studies on fascism. On this subject he was considered an expert. He spent more than 40 years (1956-1996) of his life writing a biography of Benito Mussolini. He died before completing it. De Felice was considered an historical revisionist. He taught history at the Sapienza University of Rome., via HighBeam Research. 20 Jan. 2015 He was married to Livia De Ruggiero. De Felice died May 25, 1996 in Rome. ==Selected Works== *Storia degli ebrei italiani sotto il fascismo, 1961. *The Jews in Fascist Italy. A History, Enigma Books, 2001. '' *Mussolini, 4 volumes, 1965-1997 (Turin, 1965–97) ::vol. 1, Mussolini il rivoluzionario, 1883–1920; vol. 2, Mussolini il fascista, pt. 1, La conquista del potere, 1921–1925, pt. 2, L’organizzazione dello Stato fascista, 1925–1929; vol. 3, Mussolini il duce, pt. 1, Gli anni del consenso, 1929–1936, pt. 2, Lo stato totalitario, 1936–1940; vol. 4, Mussolini l’alleato, 1940–1945, pt. 1, L’Italia in guerra, 1940–1943, bk. 1, Dalla guerra “breve” alla guerra lunga, bk. 2, Crisi e agonia del regime, pt. 2, La guerra civile, 1943–1945. *Le interpretazioni del fascismo, 1969. *Il fascismo: le interpretazioni dei contemporanei e degli storici, 1970. *Intervista sul fascismo, edited by Michael Ledeen, 1975. *Ebrei in un paese arabo: gli ebrei nella Libia contemporanea tra colonialismo, nazionalismo arabo e sionismo (1835-1970), 1978. == References == Category:1929 births Category:1996 deaths Category:Italian historians",
 "title": "Renzo De Felice"
}