{
 "id": "477989",
 "text": "Camillo Paolo Filippo Giulio Benso, Count of Cavour, Isolabella and Leri (10 August 1810 – 6 June 1861), better known as Cavour (), was an Italian politician and statesman who was an important person in the movement toward Italian unification. Cavour was born in Turin during the Napoleonic rule. Until 1831, he was a military officer.Beales and Biagini, The Risorgimento and the Unification of Italy, p. 107. Later, he decided to travel around Europe to learn more about the effects of the Industrial Revolution. Those trips helped him know and understand the principles of the British liberal system. After four years, Cavour returned to Piedmont. He took charge of agriculture and the economy in general and worked for spreading schools. During that time, his business and banking activities made him one of the richest men in Piedmont.Breve biografia di Camillo Cavour From 1832 to 1848, Cavour was the mayor of Grinzane (now called Grinzane Cavour to honour him).Hearder, Cavour, Bari, 2000, p. 26. In 1847, he founded the newspaper Il Risorgimento. According to him, the process of economic and social development, which he had promoted for years, could be implemented only after a deep restructuring of political institutions. In 1850, Cavour became famous because he advocated the Siccardi Law, which diminished the privileges of the Catholic clergy. That year, the Prime Minister of the Kingdom of Sardinia, Massimo D'Azeglio, chose him as Minister of Agriculture, Trade and Navy. Later he also became Minister of Finance. After D'Azeglio resigned on November 4, 1852, Cavour became Prime Minister of the Kingdom of Sardinia.CAVOUR, Camillo Benso conte di, Dizionario Biografico degli Italiani Cavour's political program wanted to make the Kingdom of Sardinia a constitutional monarchy based on moderate and progressive liberalism and so he dedicated himself to a radical renewal of the economy. He modernised and supported agriculture, strengthened the industrial system and promoted trade with the major European powers.Mack Smith, Cavour, pp. 68-74 However, his liberal program was criticized by both the Historical Left, which cared for the poorest citizens, and by the Historical Right, which considered him as a destroyer of conservative traditions. In 1858, he signed a treaty of alliance between the Kingdom of Sardinia and the French Empire against the Austrian Empire. The next year, during the Second Italian War of Independence, Sardinia and France defeated Austria, which had controlled the north of Italy. After the Armistice of Villafranca and Giuseppe Garibaldi's expedition to the Kingdom of the Two Scilies, in the south (1860-1861), the unification of Italy was complete. Cavour became the newly-united Italy's first Prime Minister. He was also the first Minister of Foreign Affairs. He was the leader of the Liberal parliamentary group. He died of an illness in Turin. == References == * Beales, Derek & Eugenio Biagini. The Risorgimento and the Unification of Italy. Second Edition. London: Longman, 2002. * Di Scala, Spencer. Italy: From Revolution to Republic, 1700 to the Present. Boulder, CO: Westview Press, 2004. * Hearder, H. Cavour. Bari: Laterza, 2000. * Holt, Edgar. The Making of Italy: 1815–1870. New York: Murray Printing Company, 1971. Library of Congress Catalog Card Number: 76-135573 * Kertzer, David. Prisoner of the Vatican. Boston: Houghton Mifflin Company, 2004. * Mack Smith, Denis. Cavour. New York: Alfred A. Knopf, 1985. * Mack Smith, Denis. Italy: A Modern History. Ann Arbor: The University of Michigan Press, 1959. Library of Congress Catalog Card Number: 5962503 * Norwich, John Julius. The Middle Sea: A History of the Mediterranean. New York: Doubleday, 2006. == Notes == Category:1810 births Category:1861 deaths Category:Prime ministers of Italy Category:Politicians from Turin Category:Italian mayors",
 "title": "Camillo Benso, Count of Cavour"
}