{
 "id": "477993",
 "text": "Denis Mack Smith CBE FBA FRSL (3 March 1920 - 11 July 2017) was a British historian. He has written many books and articles on the history of Italy from the Risorgimento onwards. He wrote biographies of famous Italians in history: Giuseppe Garibaldi, Camillo Cavour, Victor Emmanuel II, and Benito Mussolini. He was born in London. == Career == Between 1942 and 1945, Smith was an officer in the British War Cabinet.\"Mack Smith, Denis.\" Writers Directory 2005 (Gale, 2004). HighBeam Research. 21 Jan. 2015 From 1947 to 1962 he was a fellow, tutor and lecturer at the University of Cambridge. From 1962 to 1987 he was a Senior Research Fellow at All Souls College, Oxford. He is an Honorary Fellow at Wolfson College, Oxford and of Peterhouse, Cambridge. Smith died on 11 July 2017 in London at the age of 97.Morto lo storico Denis Mack Smith L’Italia vista da un liberal inglese == Bibliography == * Cavour and Garibaldi, 1860: A Study in Political Conflict, 1954. * Garibaldi: A Great Life in Brief, 1956. * Italy: A Modern History, 1958, revised 1969, completely revised and reprinted as Modern Italy: A Political History, 1997. * A History of Sicily, with Moses Finley, in two volumes, Medieval Sicily 800-1713 and Modern Sicily after 1713, 1968; abridged and reprinted as the single volume A History of Sicily with Moses Finley and Christopher Duggan, 1986. * The Making of Italy, 1796-1870, 1968 (editor), reprinted as The Making of Italy, 1796-1866, 1988. * Great Lives Observed: Garibaldi, 1969 (editor). * Victor Emanuel, Cavour and the Risorgimento, 1971. * Vittorio Emanuele II, 1975. * Mussolini's Roman Empire (Le guerre del Duce), 1976. * Mussolini, 1981. * Cavour, 1985. * Il Risorgimento italiano. Storia e testi, 1987. * Italy and its Monarchy, 1989. * Mazzini, 1994. * La storia manipolata, 1998. == References == Category:1920 births Category:2017 deaths Category:Historians from London Category:Academics of the University of Cambridge Category:Academics of the University of Oxford",
 "title": "Denis Mack Smith"
}