{
 "id": "478082",
 "text": "SummerSlam (1999) was a professional wrestling pay-per-view show made by World Wrestling Federation (WWF). It was held on August 22, 1999 at Target Center in Minneapolis, Minnesota. It was the twelfth SummerSlam event held by the WWF. The main event saw Mankind defeat Steve Austin and Triple H in a Triple threat match to win the WWF Championship. Mankind won the match by pinfall after hitting Austin with a Double arm DDT. ==Matches== # Matches Stipulations Times 1 Jeff Jarrett (with Debra) defeated D'Lo Brown (c) Singles match for the WWF Intercontinental Championship and WWF European Championship 7:28 2 The Acolytes (Faarooq and Bradshaw) last eliminated The Holly Cousins (Hardcore Holly and Crash Holly) to win Tag team turmoil match to become the number one contenders for the WWF Tag Team Championship 17:27 3 Al Snow defeated Big Boss Man (c) Hardcore match for the WWF Hardcore Championship 7:25 4 Ivory (c) defeated Tori Singles match for the WWF Women's Championship 4:11 5 Ken Shamrock defeated Steve Blackman Lion's Den Weapons match 9:05 6 Test defeated Shane McMahon Greenwich Street Fight \"Love Her or Leave Her\" match 12:14 7 The Unholy Alliance (The Undertaker and Big Show) (with Paul Bearer) defeated X-Pac and Kane (c) Tag team match for the WWF Tag Team Championship 12:00 8 The Rock defeated Mr. Ass Kiss My Ass match 10:11 9 Mankind defeated Steve Austin (c) and Triple H (with Chyna) Triple threat match for the WWF Championship with Jesse Ventura acting as the special guest referee 16:24 (c) – refers to the champion(s) heading into the match ===Entrances and eliminations=== Draw Wrestler Order Eliminated by 1 Edge and Christian 4 Acolytes 2 The New Brood (Matt Hardy and Jeff Hardy) (with Gangrel) 1 Edge and Christian 3 Mideon and Viscera 2 Edge and Christian 4 Droz and Prince Albert 3 Edge and Christian 5 The Acolytes (Faarooq and Bradshaw) Winners 6 The Holly Cousins (Hardcore Holly and Crash Holly) 5 Acolytes ==References== ==Other websites== *Official SummerSlam 1999 website Category:1999 in American television Category:1999 in professional wrestling Category:Sports in Minneapolis Category:SummerSlam Category:1999 in the United States Category:1990s in Minnesota Category:History of Minneapolis",
 "title": "SummerSlam (1999)"
}