{
 "id": "478188",
 "text": "SummerSlam (1998) was a professional wrestling pay-per-view show made by World Wrestling Federation (WWF). It was held on August 30, 1998 at Madison Square Garden in New York, New York. It was the eleventh SummerSlam event held by the WWF. The main event saw Steve Austin defeat The Undertaker and retain his WWF Championship. Austin won the match by pinfall after he hit Undertaker with the Stunner. On the undercard, the main match was a ladder match between Triple H and The Rock for the WWF Intercontinental Championship. Triple H won the match by climbing a ladder and grabbing the title that was hanging above the ring. ==Matches== # Matches Stipulations Times 1H Too Much (Scott Taylor and Brian Christopher) defeated L.O.D. 2000 (Hawk and Animal) Tag team match N/A 2H Gangrel defeated Dustin Runnels Singles match N/A 3H The Disciples of Apocalypse (8-Ball and Skull) (with Paul Ellering) defeated Bradshaw and Vader Singles match N/A 4 D'Lo Brown (c) defeated Val Venis by disqualification Singles match for the WWF European Championship 15:31 5 The Oddities (Kurrgan, Golga, and Giant Silva) (with Luna Vachon, Violent J, and Shaggy 2 Dope) defeated Kaientai (Taka Michinoku, Dick Togo, Men's Teioh, and Sho Funaki) (with Yamaguchi-san) Handicap match 10:08 6 X-Pac defeated Jeff Jarrett Hair vs. hair match 11:09 7 Edge and Sable defeated Marc Mero and Jacqueline Mixed tag team match 8:24 8 Ken Shamrock defeated Owen Hart (with Dan Severn) Lion's Den match 9:16 9 The New Age Outlaws (Billy Gunn and Road Dogg) defeated Mankind (c) No Disqualification Handicap match for the WWF Tag Team Championship 7:30 10 Triple H (with Chyna) defeated The Rock (c) (with Mark Henry) Ladder match for the WWF Intercontinental Championship 24:32 11 Steve Austin (c) defeated The Undertaker Singles match for the WWF Championship 20:50 (c) – refers to the champion(s) heading into the match H – indicates that the match was shown before the pay-per-view on Sunday Night Heat ==References== ==Other websites== *Official SummerSlam 1998 website Category:1998 in professional wrestling Category:Sports in New York City Category:SummerSlam Category:1998 in American television Category:1990s in New York City",
 "title": "SummerSlam (1998)"
}