{
 "id": "478245",
 "text": "SummerSlam (1997) was a professional wrestling pay-per-view show made by World Wrestling Federation (WWF). It was held on August 3, 1997 at Continental Airlines Arena in East Rutherford, New Jersey. It was the tenth SummerSlam event held by the WWF. The main event saw Bret Hart defeat The Undertaker and win the WWF Championship with Shawn Michaels acting as the special guest referee. Hart won the match by pinfall after he spit in Michaels face and Michaels swung a chair, which Hart was able to avoid, and hit The Undertaker. During the Intercontinental title match between Owen Hart and Stone Cold Steve Austin, Owen botched a piledriver which had briefly paralyzed Austin and had left him with many years of neck issues which ultimately forced him to retire at age 37 in 2003. Austin has since said that his neck is in good shape and he is in zero pain after he had a successful neck surgery performed in 2000. ==Matches== # Matches Stipulations Times 1 Mankind defeated Hunter Hearst Helmsley (with Chyna) Steel cage match 16:13 2 Goldust (with Marlena) defeated Brian Pillman Singles match; since Pillman lost, he had to wear Marlena's dress until he was able to win a match. 7:17 3 The Legion of Doom (Hawk and Animal) defeated The Godwinns (Henry O. Godwinn and Phineas I. Godwinn) Tag team match 9:15 4 The British Bulldog (c) defeated Ken Shamrock by disqualification Singles match for the WWF European Championship 7:29 5 Los Boricuas (Savio Vega, Miguel Pérez, Jr., Jose Estrada, Jr., and Jesús Castillo) defeated The Disciples of Apocalypse (Crush, Chainz, 8-Ball, and Skull) Eight-man tag team match 9:08 6 Stone Cold Steve Austin defeated Owen Hart (c) Singles match for the WWF Intercontinental Championship 16:16 7 Bret Hart defeated The Undertaker (c) Singles match for the WWF Championship with Shawn Michaels as the special guest referee 28:19 (c) – refers to the champion(s) heading into the match ==References== ==Other websites== *Official SummerSlam 1997 website Category:1997 in professional wrestling Category:Sports in New Jersey Category:SummerSlam Category:1990s in New Jersey Category:1997 in the United States",
 "title": "SummerSlam (1997)"
}