{
 "id": "478255",
 "text": "Luigi Carlo Farini (October 22, 1812 - August 1, 1866) was an Italian physician, statesman and historian. Farini was born at Russi, now in the province of Ravenna.Vittorio Bersezio, Luigi Carlo Farini (Torino: Unione Tipogr-Editr, 1861), p. 3 He graduated with a degree in medicine in 1832 at the University of Bologna.Romano Pasi, Maurizio Bufalini e Luigi Carlo Farini, Edizioni del Girasole, Ravenna, 2002, p. 128 Later he worked as a physician, researching intermittent fevers and rabies. Farini was initially a republican and a supporter of Giuseppe Mazzini.Romano Pasi, Maurizio Bufalini e Luigi Carlo Farini, Edizioni del Girasole, Ravenna, 2002, p. 126 Later he became a monarchist and member of the \"Historic Right\".Francesco Leoni, Storia dei partiti politici italiani, Alfredo Guida, Napoli, 2001, p. 125 In 1851 he was, for a few months, Minister of Education of the Kingdom of Sardinia in the government led by Massimo D'Azeglio. He was dictator pro tempore of Emilia from July 20, 1859 to March 13, 1860. He had the same role in Romagna from November 9, 1859.Lorenzo Del Boca, Risorgimento disonorato, Torino, 2011, pp. 37-38. Farini was appointed President of the Council of Ministers of the Kingdom of Italy in the December 8, 1862. However, he was struck by a nervous disease that would take him to madness. During the Polish uprising of January 1863, he threatened the king Victor Emmanuel II with a knife.Storia d'Italia De Agostini, Novara 1991, pag. 148 This was because he wanted to force him to declare war against the Russian Empire.Storia del regno d'Italia di Indro Montanelli, vol. secondo, Il giornale, 1993Denis Mack Smith, I Savoia re d'Italia, Rizzoli editore, 1990 As a result of this act, he was commitmed to the asylu of Novalese, a small town near Turin.Lodovico Frapolli, cfr. Luigi Carlo Farini. Quadri storici degli ultimi anni dettati dall'autore di «Una voce», Tipografia del Diritto, Torino, 1864. Farini died at Genoa in poverty in 1866. == References == Category:1812 births Category:1866 deaths Category:Politicians from Emilia-Romagna Category:Prime ministers of Italy",
 "title": "Luigi Carlo Farini"
}