{
 "id": "479349",
 "text": "Sly Cooper is a series of video games. It is named after the title character, Sly Cooper. They are available on the PlayStation 2, PlayStation 3, and PS Vita. The series was created by Sucker Punch and published by Sony Computer Entertainment. All of the video games were also developed by them, except Sly Cooper: Thieves in Time, which was developed by Sanzaru Games. There are currently five games in the series, as well as a collection of the first three remastered: * Sly Cooper and the Thievius Raccoonus * Sly 2: Band of Thieves * Sly 3: Honor Among Thieves * The Sly Collection * Sly Cooper: Thieves in Time * Bentley's hackpack == Main Characters == * Sly Cooper - An anthropomorphic raccoon and a master thief. He was born into a family of master thieves called the Cooper Clan. He is the leader of the Cooper Gang, a band of thieves that pulls off the biggest heists. * Bentley - An anthropomorphic box turtle. He is the brains of the Cooper Gang's heists. * Murray - An anthropomorphic hippopotamus. He is the brawn of the Cooper Gang's heists. * Inspector Carmelita Montoya Fox - An anthropomorphic red fox. She is a police officer (inspector) at Interpol, an international police force based off the Interpol. She is dedicated to catching Sly and his gang and bringing them to justice. Sometimes, her romantic feelings for Sly get in the way though. * Dimitri Lousteau - An anthropomorphic French iguana. He speaks in slang since he learned English from hip hop and TV. He was originally a painter, but many people didn't like his paintings. So, he started making forgeries. Later, he became a member of the Klaww Gang in Sly 2: Band of Thieves, but was defeated by the Cooper Gang. He returns in Sly 3: Honor Among Thieves as a close ally of the Cooper Gang. He also watched over the Thievius Raccoonus in Sly Cooper: Thieves in Time when the Cooper Gang was time traveling to save the book. == Other websites == * Sly Cooper's current official website Category:Action- adventure games Category:Stealth video games Category:Video games developed in the United States Category:Video game series Category:Video games about raccoons",
 "title": "Sly Cooper (series)"
}