{
 "id": "4794",
 "text": "Leninism is a way of thinking about how the communist party should be organized. It says it should be a dictatorship of the proletariat (meaning the working class holds the power). Some historians say that Leninism is one of the first steps towards socialism (where the workers own the factories and other means of production).The New Fontana Dictionary of Modern Thought Third Edition (1999) pp. 476–477. It is one part of Marxism–Leninism, which emphasizes the transition from capitalism to socialism. ==Beliefs== Vladimir Lenin was a Russian Marxist. He had a set of ideas based on Marxism. Lenin's development of Marxism has become known as Leninism. These ideas include: * Democratic Centralism, also known as an idea of the vanguard party. Like other communists, Lenin wanted to see a socialist revolution led by the working class. But he thought the workers needed strong leadership in the form of a Revolutionary Party based on Democratic Centralism. Lenin wanted Communist political parties in every country to lead the revolution. He thought the vanguard party would need to have strong discipline, or it would fail. * The idea that capitalism is the cause of imperialism (empire-building). He thought that imperialism was the \"highest stage\" of capitalism. * Accepting the idea that the oppressed ethnic minorities (smaller groups of people) should get to have nationalism and decide how they should be governed.Lenin, V.I. (1914) The Right of Nations to Self-Determination, from Lenin's Collected Works, Progress Publishers, 1972, Moscow, Volume 20, pp. 393-454. Available online at Marxists.org. Retrieved 17 July 2021 * Teaching the proletariat (the working class) about politics, especially Marxism.Central Committee, On Proletcult Organisations, Pravda No. 270, 1 December 1920. == Related pages == * Vladimir Lenin * Marxism-Leninism * Communism == References == == Other websites == === Books by Vladimir Lenin === * What Is To Be Done?. * Imperialism: The Highest Stage of Capitalism. * The State and Revolution. * \"The Lenin Archive\". * \"First Conference of the Communist International\". === Other similar links === * \"Marcel Liebman on Lenin and democracy\" . * \"An excerpt on Leninism and State Capitalism from the work of Noam Chomsky\". * Rosa Luxemburg. \"Organizational Questions of the Russian Social Democracy\". * Karl Korsch. \"Lenin's Philosophy\". * \"Cyber Leninism\". * \"Leninist Ebooks\" . * Anton Pannekoek. \"Lenin as a Philosopher\". * Paul Mattick. \"The Lenin Legend\". * Paul Craig Roberts. \"Dead Labor: Marx and Lenin Reconsidered\". Category:Communism Category:Marxism",
 "title": "Leninism"
}