{
 "id": "479622",
 "text": "Amedeo Modigliani (12 June 1884 – 24 January 1920) was an Italian painter and sculptor. Modigliani was born in Livorno. He spent his youth in Italy. From 1906, he was active in Paris, where he met other painters, such as Pablo Picasso and Constantin Brâncuși. Modigliani died from meningitis in Paris, at the age of 35. Today, he is mostly known for his artistic nudes, which were seen as scandalous at the time. His works are on show at MoMA (New York City)https://www.moma.org/artists/4038#works and other museums. ==Gallery of works== File:Modigliani, Amedeo - Maude Abrantes.jpg|Portrait of Maude Abrantes, 1907, Hecht Museum Amedeo Modigliani, c.1915, Portrait de Picasso, oil on cardboard, 43.2 x 26.7 cm.jpg|Portrait of Pablo Picasso, 1915, private collection File:Amedeo Modigliani - Paul Guillaume, Novo Pilota - Google Art Project.jpg|Paul Guillaume, Novo Pilota, 1915, Musée de l'Orangerie File:Bride and Groom.jpg|Bride and Groom, 1915 File:Amedeo Modigliani - Jacques and Berthe Lipchitz - Google Art Project.jpg|Jacques and Berthe Lipchitz, 1916 File:1916, Modigliani, Leon Indenbaum.jpg|Léon Indenbaum, 1916, Henry and Rose Pearlman Collection, on long-term loan to the Princeton University Art Museum File:Portrait of Beatrice Hastings Amedeo Modigliani 1916.jpeg|Portrait of Beatrice Hastings, 1916 File:Amedeo Modigliani 032.jpg|Portrait of Moise Kisling, 1915 File:Amedeo Modigliani - Madame Kisling (ca.1917).jpg|Madame Kisling, 1917 File:Portrait-of-the-Artist's-Wife 1918 Amedeo Modigliani.jpg|Portrait of the Artist's Wife (Jeanne Hébuterne), 1918 File:Amedeo Modigliani 025.jpg|Jeanne Hébuterne with Yellow Sweater, 1918 File:Portrait of dedie.jpg|Dedie Hayden, 1918, Centre Georges Pompidou File:Modigliani-autoretrato-macusp1.jpg|Self-portrait, 1919, oil on canvas, Museum of Contemporary Art, São Paulo, Brazil File:Amedeo Modigliani - Gypsy Woman with Baby (1919).jpg|Gypsy Woman with Baby, 1919, National Gallery of Art File:Amedeo Modigliani 010.jpg|The Little Peasant, 1918, Tate Liverpool File:Amedeo Modigliani, 1918, Portrait of a Young Woman, oil on canvas, 61 x 45.7 cm, New Orleans Museum of Art.jpg|Portrait of a Young Woman, 1918, New Orleans Museum of Art File:Modigliani - Busto de mulher.jpg|Buste de femme, unknown, before 1919, Museo Nacional de Bellas Artes (Buenos Aires) File:GUGG Beatrice Hastings.jpg|Beatrice Hastings, 1916–1919, Solomon R. Guggenheim Museum File:Amedeo Modigliani, 1919, Woman with a Fan, oil on canvas, 100 x 65 cm, Musée d'Art Moderne de la Ville de Paris.jpg|Woman with a Fan, 1919, stolen from Musée d'Art Moderne de la Ville de Paris File:Amedeo Modigliani - Portrait of Jeanne Hebuterne, Seated, 1918 - Google Art Project.jpg|Portrait of Jeanne Hebuterne, Seated, 1918, Israel Museum, Jerusalem File:Amedeo Modigliani 035.jpg| Portrait of Blaise Cendrars, 1917, Galleria Sabauda, Turin ==Related pages== * List of Italian painters ==References== Category:1884 births Category:1920 deaths Category:Deaths from meningitis Category:Disease- related deaths in Paris Category:Italian painters Category:People from Livorno",
 "title": "Amedeo Modigliani"
}