{
 "id": "479624",
 "text": "The following is a list of notable deaths in February 2015. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==February 2015== * February 1 - Aldo Ciccolini, 89, French pianist.MORTO ALDO CICCOLINI, IL GRANDE PIANISTA CHE AMAVA FIRENZE. AVEVA 90 ANNI * February 1 - Ann Mara, 85, American football team owner (New York Giants), complications from fall. * February 1 - Udo Lattek, 80, German football player and manager (Bayern Munich, Barcelona). * February 1 - Monty Oum, 33, American animator (Red vs. Blue, RWBY), allergic reaction. * February 2 - Andriy Kuzmenko, 46, Ukrainian singer (Skryabin), car accident.У Дніпропетровській обл. в ДТП загинув співак Кузьма Скрябін (Андрій Кузьменко) * February 2 - Stewart Stern, 92, American screenwriter (Rebel Without a Cause), brain cancer.'Rebel Without a Cause' Screenwriter Stewart Stern Dies at 92 * February 2 - Anand Shukla, 74, Indian cricketer. * February 3 - Mary Healy, 96, American actress (The 5,000 Fingers of Dr. T) and singer.Mary Healy, Actress and Singer, Dies at 96 * February 3 - Sir Martin Gilbert, 78, British historian and biographer, member of the Iraq Inquiry panel.Iraq Inquiry panel member Sir Martin Gilbert dies aged 78 * February 3 - Frank Borghi, 89, American Hall of Fame soccer player (national team).St. Louis Soccer Legend Frank Borghi Dies * February 3 - Charlie Sifford, 92, American golfer, complications from a stroke.Charlie Stifford, golf pioneer, dies * February 3 - Muath Al-Kasasbeh, 26, Jordanian pilot, burned.Isis video shows Jordanian hostage being burned to death (death announced on this date) * February 4 - Eduardo Laborde, 47, Argentine rugby union player (national team), traffic collision.Un ex Puma murió en Pinamar: iba en bicicleta y lo atropellaron * February 4 - Richard Bonehill, 67, British actor and stuntman (The Empire Strikes Back, Return of the Jedi).Star Wars actor Richard Bonehill dies (death announced on this date) * February 4 - Sajida Mubarak Atrous al- Rishawi, c. 45, Iraqi Al-Qaeda bomber, executed.Jordan Executes Sajida al- Rishawi after Pilot Burned Alive by ISIS * February 4 - Fitzhugh L. Fulton, 89, American NASA research pilot. * February 4 - Wes Cooley, 82, American politician, member of the U.S. House of Representatives from Oregon (1995–1997). * February 5 - K. N. Choksy, 81, Sri Lankan lawyer and politician, MP (1989–2010), Minister of Finance (2001–2004). * February 5 - Henri Coppens, 84, Belgian footballer, winner of the Golden Shoe (1954).Voetballegende Rik Coppens (84) overleden * February 6 - Marisa Del Frate, 83, Italian actress, singer and television personality.Morta soubrette Marisa Del Frate * February 6 - Assia Djebar, 78, Algerian novelist, translator and filmmaker, member of the Académie française.Mort de l’académicienne Assia Djebar * February 6 - André Brink, 79, South African writer.Andre Brink dies * February 6 - Kathrine Windfeld, 48, Danish movie director (Hamilton: In the Interest of the Nation).Danish director Kathrine Windfeld dies aged 48 * February 6 - Norm Drucker, 94, American basketball referee.Norm Drucker, Referee Who Felled N.B.A. Giants, Dies at 94 * February 6 - Alan Nunnelee, 56, American politician, member of the U.S. House of Representatives from Mississippi (since 2011), brain cancer.Spokeswoman: Republican Rep. Nunnelee of Mississippi Dies * February 6 - Pedro León Zapata, 85, Venezuelan cartoonist, painter and writer.Muere a los 85 años el caricaturista venezolano Pedro León Zapata * February 7 - Dean Smith, 83, American Hall of Fame basketball coach (North Carolina).Dean Smith dies at age of 83 * February 7 - John C. Whitehead, 92, American financier (Goldman Sachs) and civil servant, U.S. Deputy Secretary of State (1985–1989), cancer.Whitehead, former leader of Goldman Sachs, dies at 92 * February 7 - René Lavand, 86, Argentine magician and illusionist, pneumonia.Murió el ilusionista René Lavand * February 7 - Joe B. Mauldin, 74, American bassist (The Crickets), cancer.Buddy Holly bassist Joe Mauldin dies * February 7 - Donald H. Clausen, 91, American politician, U.S. Representative from California (1963–1983).Former Local Congressman Don Clausen Dies at 91 * February 7 - Marshall Rosenberg, 80, American psychologist, creator of Nonviolent Communication.Marshall Rosenberg passed from this life on Saturday, February 7th. 2015 * February 7 - Billy Casper, 83, American golfer, seventh all-time in career PGA Tour wins, complications from pneumonia and heart attack.Billy Casper dies at age 83 * February 8 - Müzeyyen Senar, 96, Turkish singer, pneumonia.Veteran Turkish singer Müzeyyen Senar dies aged 96 * February 8 - Rauni-Leena Luukanen-Kilde, 75, Finnish parapsychologist.Ufologi Rauni-Leena Luukanen-Kilde on kuollut * February 9 - Øyvind Bjorvatn, 83, Norwegian politician, leader of the Liberal People's Party (1982–1986).Øyvind Bjorvatn er død * February 9 - Jorge Sassi, 64, Argentine actor, renal failure.A los 64 años, murió el actor Jorge Sassi * February 10 - Deng Liqun, 99, Chinese politician.邓力群同志逝世 (in Chinese) * February 10 - Naseer Aruri, 81, Palestinian scholar and human rights activist, Parkinson's disease.Palestine's champion, Naseer Aruri, dies aged 81 * February 11 - Roger Hanin, 89, French actor and movie director.Acteur Roger Hanin est mort * February 11 - Bob Simon, 73, American television journalist (60 Minutes), traffic collision.Bob Simon, '60 Minutes' correspondent, killed in crash on West Side Highway * February 11 - Ray Hathaway, 98, American baseball player (Brooklyn Dodgers). * February 11 - Anne Cuneo, 78, Swiss author and movie director.L'écrivaine vaudoise Anne Cuneo s'est éteinte à l'âge de 78 ans (in French) * February 11 - Jerry Tarkanian, 84, American Hall of Fame basketball coach (Long Beach State, UNLV, San Antonio Spurs, Fresno State), respiratory failure. * February 12 - Cornelis Pieter van den Hoek, 93, Dutch resistance fighter, recipient of the Military William Order.Drager Militaire Willems-Orde Van den Hoek (93) overleden * February 12 - Ernest J. Sternglass, 91, American physicist and professor, heart failure.Physicist Ernest Sternglass dies at 91 * February 12 - Nik Abdul Aziz Nik Mat, 84, Malaysian politician, Menteri Besar of Kelantan (1990–2013), prostate cancer. * February 12 - Tomie Ohtake, 101, Japanese- Brazilian artist, heart failure.Death notice of Tomie Ohtake * February 12 - Oliver Rackham, 75, British landscape ecologist. * February 12 - Steve Strange, 55, British musician (Visage), heart attack.New Romantic pioneer Strange dies * February 12 - David Carr, 58, American columnist (The New York Times) and author, lung cancer and heart disease.David Carr, Media Columnist for The Times, Is Dead at 58 * February 12 - Gary Owens, 80, American television announcer (Rowan and Martin's Laugh-In) and actor (Midnight Cowboy, Space Ghost), diabetes.Gary Owens, Announcer of ‘Laugh-In’ Fame, Dies at 80 * February 12 - Movita Castaneda, 98, American actress (Mutiny on the Bounty), neck injury.Movita Castaneda dies at 98; film actress was Marlon Brando's second wife * February 12 - Richie Pratt, 71, American jazz drummer.Drummer, Richie Pratt (March 11, 1943 - February 12, 2015) * February 13 - Kesava Reddy, 68, Indian writer.Telugu novelist Kesava Reddy passed away * February 13 - Stan Chambers, 91, American television reporter (KTLA). * February 14 - Wim Ruska, 74, Dutch judoka, Olympic gold medallist (1972).Oud-olympisch judokampioen Wim Ruska op 74-jarige leeftijd overleden * February 14 - Franjo Mihalić, 94, Croatian Yugoslav long distance runner, Olympic silver medallist (1956).Preminuo Franjo Mihalić Odlazak legende (in Bosnian) * February 14 - Philip Levine, 87, American poet, pancreatic cancer.Former poet laureate Philip Levine, a champion of the working class, dies at 87 * February 14 - Louis Jourdan, 93, French actor (Gigi, Octopussy).Louis Jourdan, Star of 'Octopussy' and 'Gigi', Dies at 93 * February 14 - Michele Ferrero, 89, Italian businessman (Ferrero SpA).Monaco, è morto Michele Ferrero * February 14 - Pamela Cundell, 95, English actress (Dad's Army).Pamela Cundell obituary * February 15 - Steve Montador, 35, Canadian ice hockey player (Chicago Blackhawks).Steve Montador, former Flames defenceman, dies at age 35: reports * February 15 - Haron Amin, 46, Afghan diplomat, Ambassador to Japan (2004–2009), cancer. * February 15 - Eileen Essell, 92, English actress (Duplex, Charlie and the Chocolate Factory, The Producers). * February 16 - Aleksandr Melentyev, 60, Soviet Russian sport shooter, Olympic champion (1980).Скончался олимпийский чемпион 1980 года по стрельбе из пистолета * February 16 - John Davies, 76, British historian.Historian and BBC commentator John Davies dies aged 76 (death announced on this date) * February 16 - Uri Orbach, 54, Israeli writer, journalist and politician, blood disease.Bayit Yehudi minister Uri Orbach dies at 54 * February 16 - R. R. Patil, 58, Indian politician, oral cancer.NCP Leader, R R Patil passes away * February 16 - Lesley Gore, 68, American singer (\"It's My Party\") and actress (Batman), cancer.'It's My Party' singer Lesley Gore dies at 68 * February 16 - Heinrich Windelen, 93, German politician, Member of the Bundestag (1957–1990).Trauer um Heinrich Windelen: Der frühere Bundesminister ist tot * February 16 - Lasse Braun, 78, Italian porn movie director and producer.Addio a Lasse Braun, il re del porno * February 17 - Andrzej Koszewski, 92, Polish composer.Z najgłębszym żalem zawiadamiamy, że dnia 17 lutego 2015 odszedł od nas Ś†P Prof. Andrzej Koszewski * February 17 - Cathy Ubels-Veen, 86, Dutch politician, member of the House of Representatives (1982–1986).Oud-Kamerlid Cathy Ubels (EVP) overleden ] * February 18 - Cass Ballenger, 88, American politician, member of United States House of Representatives from North Carolina (1986–2005). * February 18 - Claude Criquielion, 58, Belgian cyclist, UCI World Road Race champion (1984), complications from a stroke.Claude Criquielion overleden * February 18 - Mark Fischer, 64, American intellectual property lawyer.MARK ALAN FISCHER * February 18 - Jerome Kersey, 52, American basketball player (Portland Trail Blazers), blood clot.Portland Trail Blazers Legend Jerome Kersey Passes Away At 52 Years Old * February 19 - Harris Wittels, 30, American television producer and writer (Parks and Recreation, The Sarah Silverman Program). * February 20 - Henry Segerstrom, 91, American entrepreneur.Developer and philanthropist Henry T. Segerstrom dies at 91 * February 20 - Ibrahim Biogradlić, 83, Bosnian Yugoslav footballer, Olympic silver medalist (1956).Preminuo Ibrahim Biogradlić, rekorder po broju nastupa za FK Sarajevo * February 21 - Sadeq Tabatabaei, 71, Iranian politician, Deputy Prime Minister (1979–1980), lung cancer.صادق طباطبایی درگذشت ] * February 21 - Clark Terry, 94, American jazz trumpeter and flugelhornist, complications from diabetes.Jazz Musician Clark Terry Dies at 94 * February 21 - Daniel Topolski, 69, British rowing coach and commentator.Daniel Topolski: BBC commentator Topolski dies aged 69 * February 22 - Kim Kyung-roul, 34, South Korean professional billiards player.Billiards world in shock: Kyung- Roul Kim passed away * February 23 - John Rowlands, 76, Welsh author and novelist. Welsh author John Rowlands dies, 76 * February 24 - Rakhat Aliyev, 52, Kazah politician and diplomat, suicide by hanging. * February 24 - Irving Kahn, 109, American investor.Irving Kahn, the world's oldest investor, dies at 109 * February 24 - Roger Cecil, 72, Welsh painter. Man found dead believed to be missing man and renowned artist Roger Cecil - 'One of Wales’ most accomplished artists' (body found on this date) * February 24 - Donald Keough, 88, American businessman, President of The Coca-Cola Company (1981–1993).Former Coke President Don Keough dies * February 24 - Maurice Hurley, 75, American television writer and producer (Star Trek: The Next Generation, Baywatch, Miami Vice). * February 24 - Bertrice Small, 77, American author.Bertrice Small 1937 - 2015 * February 25 - Terry Gill, 75, Australian actor (\"Crocodile\" Dundee, Prisoner, The Flying Doctors), lung cancer.Crocodile Dundee, Flying Doctors actor Terry Gill, 75, dead * February 25 - Eugenie Clark, 92, American ichthyologist.'Shark Lady' Eugenie Clark, Famed Marine Biologist, Has Died * February 26 - Fritz J. Raddatz, 83, German feuilletonist, essayist, biographer and romancier. Der Literaturkritiker Fritz J. Raddatz ist gestorben * February 26 - Earl Lloyd, 86, American basketball player (Syracuse Nationals, Detroit Pistons).Earl Lloyd, hoops pioneer, dies * February 26 - Tom Schweich, 54, American politician, Missouri State Auditor (since 2011), suicide by gunshot.Missouri Auditor Tom Schweich dead, reportedly from self-inflicted gunshot * February 26 - Martha Cohen, 94-95, Canadian community builder and philanthropist.Martha Cohen, Calgary philanthropist, dies * February 26 - Avijit Roy, Bangladeshi-born American writer, stabbed.Bangladeshi writer attacked, dies in hospital * February 26 - Theodore Hesburgh, 97, American Roman Catholic priest, president of the University of Notre Dame (1952-1987).Rev. Theodore Hesburgh, Former Notre Dame President, Dies at 97 * February 27 - Leonard Nimoy, 83, American actor and director (Star Trek, Mission: Impossible, Fringe), COPD.Leonard Nimoy, Spock of ‘Star Trek,’ Dies at 83 * February 27 - Boris Nemtsov, 55, Russian politician, Governor of Nizhny Novgorod Oblast (1991–1997), First Deputy Prime Minister (1997–1998), Deputy Prime Minister (1998), shot.Russian opposition politician Boris Nemtsov shot dead in Moscow * February 27 - Richard Bakalyan, 84, American character actor (Batman, Chinatown, The Fox and the Hound).Richard Bakalyan * February 27 - Bohdan Tomaszewski, 93, Polish sports commentator. * February 27 - Bob Benmosche, 70, American executive, President and CEO of American International Group (2009–2014), lung cancer.Former AIG CEO Robert Benmosche Dies of Cancer at 70 * February 27 - Mykhailo Chechetov, 61, Ukrainian politician, suicide.Yanukovych’s ally Chechetov commits suicide under house arrest * February 28 - Anthony Mason, 48, American basketball player (New York Knicks), heart failure.Anthony Mason dies at age of 48 * February 28 - Yaşar Kemal, 91, Turkish author, Légion d'honneur recipient. ==Months== * January 2015 * March 2015 ==References== *02 Category:February 2015 events",
 "title": "Deaths in February 2015"
}