{
 "id": "479727",
 "text": "Luigi Federico Menabrea (September 4, 1809 - May 24, 1896), later made Count Menabrea and Marquis of Valdora, was an Italian general, statesman, mathematician and diplomat. Menabrea was born at Chambéry, then part of the Kingdom of Sardinia. He was educated at the University of Turin, where he qualified as an engineer and became a doctor of mathematics. In 1842 he wrote Sketch of the Analytical Engine Invented by Charles Babbage, Esq., a publication that influenced Ada Lovelace.Sketch of the Analytical Engine Invented by Charles Babbage, Esq. with notes by trans. Ada Lovelace, in Scientific Memoirs, Vol 3 (1842) In 1848 he began his political career, and was elected deputy in the Parliament of Piedmont; later he was Minister of War and Foreign Minister. Menabrea fought the Second Italian War of Independence; in 1860 he became lieutenant-general and conducted the siege of Gaeta: after this battle, he was appointed senator and received the title of count. Member of the \"Historical Right\", in the Kingdom of Italy he was Minister of the Navy from June 12, 1861 to March 3, 1862 and Minister of Public Works from December 8, 1862 to September 28, 1864. Luigi Federico Menabrea became Prime Minister of the Kingdom of Italy October 27, 1867 and remained in power until December 14, 1869. His government is remembered for three things: *The conflict with Giuseppe Garibaldi, who wanted to remove Rome to the Pope without the support of the French Empire. *The taxes increase, in particular the introduction of the tax on the ground that hit the poorest people of the State. *The attempt to occupy, with the permission of Argentina, a region in southern Patagonia where imprison Italian brigands.F. Izzo, I lager dei Savoia, Napoli, 1999, pp. 173-178Lorenzo Del Boca, Indietro Savoia! Storia controcorrente del Risorgimento, Piemme, Casale Monferrato, 2003, , pp. 235-236. He was very strict in enforcing his laws: in fact he ordered to the General Raffaele Cadorna to suppress in the blood the popular uprisings.Il Risorgimento sul Lago Maggiore His government fell because the two ministers withdrew their support. Menabrea was later ambassador to London and Paris.MENABREA, Luigi Federico He died in Saint-Cassin. == Note == Category:1809 births Category:1896 deaths Category:Italian generals Category:Italian mathematicians Category:People from Piedmont Category:Prime ministers of Italy Category:People from Chambéry Category:Politicians from Auvergne-Rhône-Alpes",
 "title": "Federico Menabrea"
}