{
 "id": "479734",
 "text": "The Division of Swan is an Australian electoral division located in Western Australia. The division is named after the Swan River. It was one of the 75 divisions set up for the first federal election in 1901. Historically, the electorate was a country seat extending north to Dongara, east to Merredin and south to the coast. New boundaries created a smaller area east of the Darling Range. The old area became the new seat of Moore, while Swan moved to its present position. It covers the suburbs of Ascot, Beckenham, Belmont, Bentley, Burswood, Cannington, Carlisle, Cloverdale, Como, East Cannington, East Victoria Park, Ferndale, Karawara, Kensington, Kewdale, Langford, Lathlain, Lynward, Manning, Queens Park, Redcliffe, Rivervale, Salter Point, St James, South Perth, Victoria Park, Waterford, Welshpool and Wilson. ==Members== Member Party Term Sir John Forrest Protectionist 1901–1909 Commonwealth Liberal 1909–1917 Nationalist 1917–1918 Edwin Corboy Labor 1918–1919 John Prowse Country 1919–1922 Henry Gregory Country 1922–1940 Thomas Marwick Country 1940–1943 Independent Country 1943–1943 Don Mountjoy Labor 1943–1946 Len Hamilton Country 1946–1949 Bill Grayden Liberal 1949–1954 Harry Webb Labor 1954–1955 Richard Cleaver Liberal 1955–1969 Adrian Bennett Labor 1969–1975 John Martyr Liberal 1975–1980 Kim Beazley Labor 1980–1996 Don Randall Liberal 1996–1998 Kim Wilkie Labor 1998–2007 Steve Irons Liberal 2007–present Sir John Forrest had been the Premier of Western Australia. His death in 1918 led to a by-election in 1918. Kim Beazley served as a Minister in the Bob Hawke Government. He became Leader of the Opposition from 1996 to 2001, and from 2005 to 2006. He was also Deputy Prime Minister in 1995 and 1996. After retiring from politics he became the Australian Ambassador to the United States. ==Election results== ==References== ==Other websites== * Division of Swan - Australian Electoral Commission Category:Electoral divisions of Western Australia Category:1901 establishments in Australia",
 "title": "Division of Swan"
}