{
 "id": "47984",
 "text": "The 930s was a decade that started on 1 January 930, and ended on 31 December 939. It is distinct from the decade known as the 94th decade which began on January 1, 931 and ended on December 31, 940. __NOTOC__ ==930== * The Althing of the Icelandic Commonwealth is founded. It is now one of the world's oldest parliaments. * Emperor Suzaku ascends to the throne of Japan. * Prince Bei, oldest brother of the Khitan Emperor, leaves for China. === Deaths === * Emperor Daigo of Japan * Ma Yin ==931== * Ramiro II of León becomes king of Kingdom of León. * Eric Bloodaxe becomes the second king of Norway. * March - Pope John XI succeeds Pope Stephen VII as the 125th pope. === Births === * Adelaide of Italy, wife of Otto I, Holy Roman Emperor * Emperor Muzong of Liao === Deaths === * Emperor Uda of Japan * King Harald I of Norway ==932== * Wildeck Castle is built by King Henry I in Zschopau, Germany. * The movie Monty Python and the Holy Grail is set in this year. === Births === * Empress Xiao, empress and regent of the Liao === Deaths === * Qian Liu ==933== * 15 March - Henry the Fowler defeats the Magyars in the Battle of Riade. * Cotentin and Jersey are taken by William I, Duke of Normandy. * The Kingdom of Lower Burgundy is given to King Rudolph II of Upper Burgundy. === Deaths === * King Alfonso IV of Leon * December 15 - Li Siyuan, Emperor Mingzong of Later Tang ==934== * The German king Henry I, the Fowler defeat King Gnupa and take Hedeby. * The Eldgjá volcanic eruption is the largest basalt flood in history. * Einsiedeln Abbey is founded. === Births === * Dong Yuan, Chinese painter === Deaths === * Meng Zhixiang, Chinese general * Queen Emma of France * St Gervadius Irish Saint * Ubayd Allah, political and religious leader, founder of the Fatimid Caliphate ==935== * The Fatimid dynasty makes a third failed attempt to conquer Egypt. * Córdoba is thought to be the largest city of the world, taking the lead from Baghdad. * Haakon the Good, son of Harald Fairhair, once again brings together the Norwegian lands. * Gyeon Hwon, the king of Hubaekje, is overthrown by his eldest son Singeom. * The Later Shu Kingdom is founded by Meng Zhixiang in Chengdu. === Births === * Ferdowsi Tousi, Persian poet === Deaths === * Harald Fairhair, King of Norway * Wenceslas I, Duke of Bohemia ==936== * The Kings of Wessex take control of Devon. * Otto I crowned Holy Roman Emperor at Aachen. * King Taejo of Goryeo defeats Hubaekje. * Prince Bei, elder brother of the Liao Dynasty emperor, is murdered by the Later Tang Dynasty. * Ibn Muqlah, Islamic calligrapher, is disgraced and imprisoned in Baghdad. * Pope Leo VII succeeds Pope John XI as the 126th pope. ===Births=== * Abu al-Qasim al-Zahrawi, Moorish scholar * Li Houzhu, last Chinese emperor of the Southern Tang ===Deaths=== * Henry I the Fowler, King of the Germans * Gyeonhwon, King of Hubaekje ==937== * Battle of Brunanburh: King Athelstan of England defeats the Viking king of Dublin, the Scots, and Strathclyde. * September 21 - Magdeburg becomes capital of the Holy Roman Empire. === Births === * Duke William IV of Aquitaine * Gu Hongzhong === Deaths === * July 11 - King Rudolph II of Burgundy * July 14 - Duke Arnulf I of Bavaria ==938== * The Liao Dynasty takes over Peking. * Battle of Bach Dang: Vietnam wins its independence from China. === Births === * Hugh Capet, King of France === Deaths === * Lady Ise, Japanese poet ==939== * Edmund I of England became King of England * July 14 - Pope Stephen VIII succeeds Pope Leo VII as the 127th pope. * Arabs lose Madrid to the Kingdom of León. === Births === * Emperor Romanos II of the Byzantine Empire * Emperor Taizong of Song === Deaths === * October 2 - Gilbert, Duke of Lorraine * October 27 - Æthelstan, King of the English Category:930s",
 "title": "930s"
}