{
 "id": "480187",
 "text": "Bobbi Kristina Brown (March 4, 1993 - July 26, 2015) was an American television personality, heiress and singer. She was the daughter of singers Whitney Houston and Bobby Brown. Brown was born in Livingston, New Jersey. ==Adult life== On February 11, 2012, Brown's mother, Whitney Houston, accidentally drowned in a hotel bathtub. Brown was found face down in her bath on 31 January 2015 having taken a mixture of drugs including marijuana, alcohol, benzoylecgonine (made from cocaine), benzodiazepine (a sedative) and morphine. She was placed into an induced coma, but did not recover. She died on 26 July 2015 of pneumonia caused by the overdose. ==Discography== Brown spoke and sang in some of her mother's recordings and televised performances, as well as on a television show after her mother's death. Performances and releases Year Song Album Notes 1998 \"My Love Is Your Love\" My Love Is Your Love Uncredited spoken comments during the first verse and closing of the song Live duet with Whitney Houston on concert stage in Poland 1999 VH1 Divas Live 1999: Whitney Houston (Live) – Single Live duet with Whitney Houston featuring Treach at the Divas Live '99 concert 2003 \"Little Drummer Boy\" One Wish: The Holiday Album Featured singer with Whitney Houston 2007 \"Family First\" Tyler Perry's \"Daddy's Little Girls\" – Music Inspired by the Film Studio recording with Whitney Houston, Cissy Houston, and Dionne Warwick 2009 \"My Love Is Your Love\" Live duet with Whitney Houston at the Good Morning America Concert in Central Park on September 1, 2009 2012 \"I'm Your Baby Tonight\" Performed on The Houstons: On Our Own ==Filmography== Year Title Role Notes 2005 Being Bobby Brown Herself 2009 The Oprah Winfrey Show Episode: \"Whitney Houston\" 2012 Oprah's Next Chapter The 2012 Billboard Music Awards 2012–2013 The Houstons: On Our Own 2012 For Better or Worse Tina the receptionist 2021 Whitney Houston & Bobbi Kristina: Didn't We Almost Have It All Herself Posthumous Lifetime television documentary ==References== Category:1993 births Category:2015 deaths Category:Deaths from pneumonia Category:African-American singers Category:African-American television personalities Category:Drug- related accidental deaths in the United States Category:Musicians from New Jersey Category:Television personalities from New Jersey Category:People from Livingston, New Jersey",
 "title": "Bobbi Kristina Brown"
}