{
 "id": "480229",
 "text": "An International auxiliary language (shortly IAL or auxlang) is a language that is intended for communication between people who have different first languages.Herbert N. Shenton, 'An International Auxiliary Language', Proceedings: Twenty-Fifth Annual Convention of Rotary International (Chicago: Rotary International, 1934), p. 105 Languages of large societies over the centuries have almost reached the international level, for example Latin, Greek, Standard Arabic, Standard Chinese, English, French, Portuguese, Russian, and Spanish.Bodmer, Frederick. The loom of language and Pei, Mario. One language for the world. Some people have turned to the idea of promoting an artificial or constructed language as a possible IAL, for example Esperanto, Ido and Interlingua. == Significant auxiliary languages == * pidgins - a simplified language used in Singapore, the Philippines, Polynesia and other places.Atlas of Languages of Intercultural Communication in the Pacific, Vol 3, eds. S. A. Wurm; Peter M체hlh채usler; Darrell T. Tyron (Berlin; New York: Mouton de Gruyter, 1996), p. 519 ** Mediterranean Lingua Franca - A Pidgin based on Romance languages. ** Tok Pisin - A Pidgin based on the English language. * Volap체k - the first widely used constructed language, less popular after Esperanto was introduced.Esperanto, Interlinguistics, and Planned Language, ed. Humphrey Tonkin (Lanham, MD: University Press of America, 1997), p. 183 * Esperanto - a constructed language with up to 2,000,000 speakers.Ethnologue: Languages of the World, Seventeenth edition, eds. M. Paul Lewis; Gary F. Simons; Charles D. Fennig (Dallas, TX: SIL International, 2014) online version ** Ido - a project of reformed Esperanto. * Interlingua - a constructed language. * Interlingue * Basic English - A constructed language, a simplified form of English with reduced number of wordsLanguage, a Right and a Resource: Approaching Linguistic Human Rights, ed. Mikl처s Kontra (Budapest: Central European University Press, 1999), p. 26 == Notes == == References == Category:Constructed languages Category:Interlinguistics",
 "title": "International auxiliary language"
}