{
 "id": "480500",
 "text": "Orlando Brown (born December 4, 1987) is an American actor and rapper. He is best known for his roles as Eddie Thomas on the teen sitcom That's So Raven, the voice of Sticky Webb on the animated series The Proud Family, and as the voice of Cornelius Filmore on the animated series Fillmore!. Brown is also a singer and released his debut album Trade It All in 2006. He was born in Los Angeles, California. ==Legal issues== On February 29, 2016, Brown was arrested in Torrance, California, and charged with misdemeanor, domestic battery, obstruction of justice, drug possession with intent to sell, and having contraband in jail. On January 18, 2018, Brown was arrested again, this time in Barstow, California after an alleged family dispute including an argument with a girlfriend. He was charged with battery of a spouse, resisting a police officer, and possession of a controlled substance. He was booked into the Barstow Jail on the same day. On June 5, 2018, Brown was arrested for a third time in Las Vegas after the police witnessed him walking in and out of a motel with a high drug and prostitution area. He was stopped but refused to cooperate and was thus cuffed. Brown was found to have possessed bags of drugs which were identified as crack. Brown was booked on felony narcotics possession, misdemeanor, drug paraphernalia, and resisting a police officer. On September 2, 2018, Brown was arrested for a fourth time after breaking into his friend's restaurant and trying to change the locks. ==Filmography== ===Film=== Year Title Role Notes 1995 Family Values Chuckie Television film 1995 Major Payne Tiger 1998 Senseless at the Gate Brandler Witter 2000 Inhumane Worker Marchel Williats 2000 Perfect Game Marcel Williams 2000 The Tangerine Bear Bear Little Boy Voice 2001 Max Keeble's Big Move Dobbs 2003 Maniac Magee Mars Bar Thompson 2003 Eddie's Million Dollar Cook-Off Frankie 2005 Suits on the Loose Cody 2005 The Proud Family Movie Sticky Webb Voice 2012 Christmas in Compton Tyrone 2012 We the Party Club DJ Uncredited 2013 Run Ya' Pockets: A Political Economy Analysis of Crime Amongst Harlem Youths LeTavious College film 2015 Straight Outta Compton Block Dude 2015 American Bad Boy Charles 2016 Bloody Hands Detective Brown ===Television=== Year Title Role Notes 1995 Coach Kid Episode: \"Ten Percent of Nothing\" 1996 In the House Steven Episode: \"To Die For\" 1996 The Parent 'Hood George Washington Carver Episode: \"I'm O'Tay, You're O-Tay\" 1996–1997 Waynehead Damey Wayne 13 episodes 1996–2000 Moesha Chuckie / James 3 episodes 1997 Malcolm & Eddie Max Episode: \"Hoop Schemes\" 1997 Sister, Sister Clayton Episode: \"Little Man Date\" 1997 The Pretender Bruno Episode: \"Back From The Dead Again\" 1997 The Wayans Bros. Charlie Episode: \"Say It Ain't So, Marlon\" 1996–1998 Family Matters 3J 21 episodes 1998–1999 Two of a Kind Max 8 episodes 1998–2001 The Jamie Foxx Show Nelson 4 episodes 1999 Malcolm & Eddie Cairo Episode: \"Daddio\" 1999 Friends and Foes Chris 1999 Safe Harbor Chris 10 episodes 2001 Lizzie McGuire Travis Elliot Episode: \"Random Acts of Miranda\" 2001–2005 The Proud Family Sticky Webb Voice; 38 episodes 2002–2004 Fillmore! Cornelius Fillmore 26 episodes 2002–2007 Express Yourself Himself 2003–2004 Clifford's Puppy Days Evan Thomas Taylor 3 episodes 2003–2007 That's So Raven Edward \"Eddie\" Thomas 99 episodes 2004 Start Up, Go Down, and Get Lost Dwayne 1 episode 2004 One on One Dwanye Episode: \"He's Not Heavy, He's My Half-Brother\" 2005 Phil of the Future Andrew \"Andy\" Baxley Episode: \"Team Diffy\" 2011 The End The Man / The Boomshadow 4 episodes 2011 Hell's Kitchen Himself 1 episode ==Discography== ===Albums=== Album Released Trade It All 2006 \"F**k My Fame (Radio)\" - single 2016 ==References== ==Other websites== * * Orlando Brown * Orlando Brown on Instagram * Orlando Brown on Twitter * Orlando Brown on SoundCloud * Orlando Brown on YouTube Category:1987 births Category:Living people Category:African- American actors Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Los Angeles",
 "title": "Orlando Brown"
}