{
 "id": "480695",
 "text": "Thomas the Tank Engine is a fictional steam locomotive in The Railway Series books by the Reverend Wilbert Awdry and his son, Christopher. He became the most popular character in the series. He is the title character in the television series, Thomas and Friends. ==Origins== On Christmas 1942, Wilbert Awdry gave his son Christopher a wooden model of a blue steam engine. Christopher named it Thomas. Wilbert would later write the second Railway Series book focused on Thomas. He published the book after his wife Margaret encouraged him to do so. Illustrated by Reginald Payne, Thomas was based on an LB&SCR; E2 class tank engine. ==Characteristics== Thomas is introduced as being very cheeky and fussy. He thinks his job is the most important one, and thus looks down on everyone else despite being the smallest at the time. He also tends to ignore advice and prefer doing jobs on his own. These two flaws cause him to get into accidents a lot. As the series goes on, Thomas became less selfish and got more mature over time. ==Reception== ===Awards=== Thomas was the only fictional character included in The Independent on Sundays 2009 \"Happy List\". He was listed alongside 98 real-life adults and a therapy dog for making Britain a better and happier place. In 2011, Thomas appeared on a series of 1st class UK postage stamps handed out by the Royal Mail. The postal service company did this to mark the centenary of the birth of Wilbert Awdry. === Legacy === From 2014, the in Japan dressed up five of their locomotives to look like characters from Thomas and Friends. These characters are Thomas, Hiro, , James, and Rusty. The locomotives are based at Shin-Kanaya Station. Train rides operate between Shin-Kanaya Station and Ieyama Station. The 2015 Marvel superhero movie Ant-Man features a model of Thomas. Director Peyton Reed and his production team had made sure not to make Thomas seen as evil by children. They achieved this by writing Thomas as neutral during the fighting sequence and rendering him using computer graphics to make production simpler. Video game players have frequently modified released games to include Thomas and other characters. One of the first popular efforts was replacing dragons with Thomas and Friends characters in the game The Elder Scrolls: Skyrim in 2013. Since then, Thomas has been incorporated into other games like Grand Theft Auto V, Sonic the Hedgehog and the 2019 Resident Evil 2 remake. == Related pages == * - an American short story featuring a similar blue locomotive character * - a Japanese vocal synthesiser mascot with similar characteristics and cultural influence as Thomas == References == == Sources == * * == Other websites == * * Category:Characters in written fiction Category:English children's books Category:Fictional characters introduced in the 1940s Category:Fictional characters introduced in the 20th century Category:Railway Series characters Category:Thomas and Friends",
 "title": "Thomas the Tank Engine"
}