{
 "id": "4810",
 "text": "This is a list of sovereign states and dependent territories of the world by continents. * By UN association: ** The 193 members of the United Nations (UN) ** The 2 General Assembly Observer States (the Vatican City State (sometimes Holy See) and the State of Palestine) * By other states: ** De facto states with disputed sovereignty ** States that lack international recognition ** Cook Islands and Niue, two states in free association with New Zealand, without UN membership * By non-sovereign territories: ** Generally this includes non-sovereign territories recognized by the UN as part of any state. ** Dependent territories ** Other territories often regarded as separate geographical territories even through they are integral parts of their mother states (such as the overseas departments and regions of France) Transcontinental countries are listed only once, in the continent in which the United Nations groups member states. In some cases, it is not obvious which continent a country should be listed in. For example, Cyprus is geographically part of Asia but culturally more a part of Europe. Russia's capital is in Europe but most of its land area is in Asia. The United Nations groups Georgia with Eastern European states, even though both its capital and almost all of its land area are in Asia, and it is most often categorized as an Asian country. ==Africa== Africa is the world's second-largest and second-most- populous continent. At about 30.3 million km2 (11.7 million square miles) including adjacent islands, it covers 6% of Earth's total surface area and 20% of its land area, accounting for about a fifth of the world's land. With 1.3 billion people as of 2018, it accounts for about 16% of the world's human population. It is surrounded by large areas of water. There are 54 fully recognized and independent countries in Africa, and 14.7% (1.216 billion) of the world's population lives there. It is thought to be the continent where the first humans evolved. === Sovereign states === Flag English Name Capital Population Area Currency Map 1 Algeria Algiers Algerian dinar 2 Angola Luanda kwanza 3 Benin Porto-Novo CFA franc 4 Botswana Gaborone pula 5 Burkina Faso Ouagadougou CFA franc 6 Burundi Gitega Burundi franc 7 Cameroon Yaoundé CFA franc 8 Cape Verde Praia Cape Verdean escudo 9 Central African Republic Bangui CFA franc 10 Chad N'Djamena CFA franc 11 Comoros Moroni Comorian franc 12 Democratic CongoAlso known as Congo-Kinshasa and formerly as Zaire. Kinshasa Congolese franc 13 CongoAlso known as Congo-Brazzaville. Brazzaville CFA franc 14 Djibouti Djibouti Djibouti franc 15 Egypt Cairo Egyptian pound 16 Equatorial Guinea MalaboCiudad de la Paz is to be the future capital of Equatorial Guinea; currently under construction. CFA franc 17 Eritrea Asmara nakfa 18 Eswatini Lobamba lilangeni 19 Ethiopia Addis Ababa Ethiopian birr 20 Gabon Libreville CFA franc 21 Gambia Banjul dalasi 22 Ghana Accra Ghana cedi 23 GuineaAlso known as Guinea-Conakry to distinguish it from neighboring Guinea-Bissau. Conakry Guinean franc 24 Guinea-Bissau Bissau CFA franc 25 Côte d'Ivoire Yamoussoukro CFA franc 26 Kenya Nairobi Kenyan shilling 27 Lesotho Maseru loti 28 Liberia Monrovia Liberian dollar 29 Libya Tripoli Libyan dinar 30 Madagascar Antananarivo ariary 31 Malawi Lilongwe Malawian kwacha 32 Mali Bamako CFA franc 33 Mauritania Nouakchott ouguiya 34 Mauritius Port Louis Mauritian rupee 35 Morocco Rabat Moroccan dirham 36 Mozambique Maputo metical 37 Namibia Windhoek Namibian dollar 38 Niger Niamey CFA franc 39 Nigeria Abuja naira 40 Rwanda Kigali Rwandese franc 41 São Tomé and Príncipe São Tomé Dobra 42 Senegal Dakar CFA franc 43 Seychelles Victoria Seychelles rupee 44 Sierra Leone Freetown leone 45 Somalia Mogadishu Somali shilling 46 South Africa Cape Town rand 47 South Sudan Juba South Sudanese pound 48 Sudan Khartoum Sudanese pound 49 Tanzania Dar es Salaam Tanzanian shilling 50 Togo Lomé CFA franc 51 Tunisia Tunis Tunisian dinar 52 Uganda Kampala Ugandan shilling 53 Zambia Lusaka Zambian kwacha 54 Zimbabwe Harare Zimbabwe dollar === Dependent territories === Flag English Name Capital Population Area (km²/mi²) Currency Map Canary Islands Santa Cruz de Tenerife 2,200,000 Euro French Southern and Antarctic Lands Saint-Pierre, Réunion 116,000 Euro Madeira Funchal 246,000 Euro Mayotte Mamoudzou 318,000 Euro Réunion Saint-Denis 246,000 Euro Saint Helena, Ascension and Tristan da Cunha Jamestown 7,735 Saint Helena pound * Transcontinental countries classified as Southern European countries: (Madeira), (Canary Islands) * Transcontinental countries classified as Western European countries: (French Southern and Antarctic Lands, Mayotte and Reunion) == Asia == Asia is the largest and most populous continent and is a continent in the seven continent system. Asia consists of forty-nine countries as per the United Nations along with many other highly autonomous regions and disputed areas that are often generalised as countries of their own. The 46 countries are: Flag English Name Capital Population Area Map 1 Afghanistan Kabul 2 Armenia Yerevan 3 Azerbaijan Baku 4 Bahrain Manama 5 Bangladesh Dhaka 6 Bhutan Thimphu 7 Brunei Bandar Seri Begawan 460,356 8 Cambodia Phnom Penh 9 China Beijing 10 India New Delhi 11 Indonesia Jakarta 12 Iran Tehran 13 Iraq Baghdad 14 Israel Jerusalem 15 Japan Tokyo 16 Jordan Amman 17 Kazakhstan Astana 18 North Korea Pyongyang 19 South Korea Seoul 20 Kuwait Kuwait City 21 Kyrgyzstan Bishkek 22 Laos Vientiane 23 Lebanon Beirut 24 Malaysia Kuala Lumpur 25 Maldives Male 26 Mongolia Ulaanbaatar 27 Myanmar Nay Pyi Taw 28 Nepal Kathmandu 29 Oman Muscat 30 Pakistan Islamabad 31 Philippines Manila 32 Qatar Doha 33 Saudi Arabia Riyadh 34 Singapore Singapore) 35 Sri Lanka Colombo 36 Syria Damascus 37 Tajikistan Dushanbe 38 Taiwan Taipei 39 Thailand Bangkok 40 Timor-Leste Dili 41 Turkey Ankara 42 Turkmenistan Ashgabat 43 United Arab Emirates Abu Dhabi 44 Uzbekistan Tashkent 45 Vietnam Hanoi 46 Yemen Sana'a # == Europe == Europe is the second smallest continent, but the third most populous. It is a continent in the seven continent system. In other systems, it is part of Asia, Eurasia or Eurafrasia. Below is the list of fully sovereign or de facto countries that are indisputably either entirely or partially situated within Europe. The 47 countries are: Flag English Name Capital Population Area Currency Map 1 Albania Tirana Albanian lek 2 Andorra Andorra la Vella Euro 3 Austria* Vienna Euro 4 Belarus Minsk Belarusian rouble 5 Belgium Brussels Euro 6 Bosnia and Herzegovina Sarajevo Bosnia and Herzegovina convertible mark 7 Bulgaria Sofia Bulgarian lev 8 Croatia Zagreb Euro 9 Czechia Prague Czech koruna 10 Cyprus Nicosia 1,244,188 9,251 km2 (3,572 sq mi) Euro 11 Denmark Copenhagen Danish krone 12 Estonia Tallinn Euro 13 Finland Helsinki Euro 14 France Paris Euro 15 Georgia Tbilisi 3,757,980 69,700 km2 (26,911 sq mi) Lari 16 Germany Berlin Euro 17 Greece Athens () Euro 18 Hungary Budapest Hungarian forint 19 Iceland Reykjavík Icelandic króna 20 Ireland Dublin Euro 21 Italy Rome Euro 22 Kosovo Pristina 1,836,529 Euro 23 Latvia Riga Euro 24 Liechtenstein Vaduz Liechtenstein franc 25 Lithuania Vilnius Euro 26 Luxembourg Luxembourg Euro 27 Malta Valletta Euro 28 Moldova Chișinău Moldovan leu 29 Monaco Monaco Euro 30 Montenegro Podgorica Euro 31 Netherlands Amsterdam Euro 32 North Macedonia Skopje Macedonian denar 33 Norway Oslo Norwegian krone 34 Poland Warsaw Polish złoty 35 Portugal Lisbon Euro 36 Romania Bucharest Romanian leu 37 Russia Moscow Russian rouble 38 San Marino San Marino Euro 39 Serbia Belgrade Serbian dinar 40 Slovakia Bratislava Euro 41 Slovenia Ljubljana Euro 42 Spain Madrid Euro 43 Sweden Stockholm Swedish krona 44 Switzerland Bern Swiss franc 45 Ukraine Kyiv Ukrainian hryvnia 46 United Kingdom London Sterling 47 Vatican City Vatican City Euro ==North America== North America is the third largest continent and the fourth most populous. It is a continent in the 7 continents system, consisting of 23 countries, which are: Flag English Name Capital Population Area Currency Map 1 Antigua and Barbuda St. John's East Caribbean dollar 2 The Bahamas Nassau Bahamian dollar 3 BarbadosMember of the Caribbean Community. The Caribbean Community also includes Guyana and Suriname. Bridgetown Barbadian dollar 4 BelizeMember of the Central American Integration System. Belmopan Belize dollar 5 CanadaMember of the North American Free Trade Agreement. Ottawa Canadian dollar 6 Costa Rica San José Costa Rican colón 7 Cuba Havana Cuban peso Cuban convertible peso 8 Dominica Roseau East Caribbean dollar 9 Dominican Republic Santo Domingo Dominican peso 10 El Salvador San Salvador United States dollar 11 Grenada St. George's East Caribbean dollar 12 Guatemala Guatemala City Guatemalan quetzal 13 Haiti Port-au-Prince Haitian gourde 14 Honduras Tegucigalpa Honduran lempira 15 Jamaica Kingston Jamaican dollar 16 Mexico Mexico City Mexican peso 17 Nicaragua Managua Nicaraguan córdoba 18 Panama Panama City Panamanian balboa United States dollar 19 Saint Kitts and Nevis Basseterre East Caribbean dollar 20 Saint Lucia Castries East Caribbean dollar 21 Saint Vincent and the Grenadines Kingstown East Caribbean dollar 22 Trinidad and Tobago Port of Spain 1,422,000 5,130 km² Trinidadian dollar 23 United States Washington United States dollar == South America == South America is the fourth largest continent and fifth most populous. It is a continent in the seven continent system. In other systems, it is part of The Americas. There are 12 countries. Flag English Name Capital Population 2021 Area Official languages Currency Location 1 Argentina Buenos Aires 44,012,000 2,780,000 km² Spanish Argentine peso 2 Bolivia Sucre La Paz 11,748,292 1,088,000 km² Spanish Quechua Aymara Boliviano 3 Brazil Brasilia 206,376,100 8,515,370 km² Portuguese Brazilian real 4 Chile Santiago Valparaiso 17,858,000 756,000 km² Spanish Chilean peso 5 Colombia Bogota 48,476,000 1,148,000 km² Spanish Colombian peso 6 Ecuador Quito 16,476,000 276,000 km² Spanish US dollar 7 Guyana Georgetown 747,000 214,970 km² English Guyanese dollar 8 Paraguay Asuncion 6,363,000 406,000 km² Spanish Guarani Paraguayan guarani 9 Peru Lima 33,376,476 1,285,000 km² Spanish Peruvian sol 10 Suriname Paramaribo 577,000 163,820 km² Dutch Surinamese dollar 11 Uruguay Montevideo 3,352,000 176,454 km² Spanish Uruguayan peso 12 Venezuela Caracas 27,466,364 916,000 km² Spanish Venezuelan bolivar US dollar ==Oceania== The countries (16 total) are listed below according to their UN classification: Flag English Name Capital Population 2021 Area Official languages Coin Location 1 Australia Canberra 23,342,000 7,700,000 km² English Australian dollar 2 Cook Islands Avarua 8,820 236 km² English Maori Rarotongan New Zealand dollar 3 Federated States of Micronesia Palikir 128,032 702 km² English SpanishAbout 150 Spanish speakers are found on the island of Kapingamarangi US dollar 4 Fiji Suva 851,300 18,275 km² English Fijian Hindi Fijian dollar 5 Kiribati South Tarawa 141,362 811 km² English Gilbertese ChineseAuxillary/culturally Kiribati dollar 6 Marshall Islands Majuro 82,252 181 km² English Marshallese SpanishAlthough there are at least 50 native speakers, 200 more of these are permanent support staff population. US dollar 7 Nauru YarenThere is no set capital for Nauru. The biggest city and administrative capital is Yaren. 9,122 21 km² English Nauruan Chinese Nauruan dollar 8 New Zealand Wellington 4,404,252 270,000 km² English Maori New Zealand Sign Language New Zealand dollar 9 Niue Alofi 1,242 261 km² English Niuean New Zealand dollar 10 Palau Ngerulmud 22,000 460 km² English Palauan JapaneseThere are 144 Japanese speakers in Angaur US dollar 11 Papua New Guinea Port Moresby 8,262,505 462,000 km² English Tok Pisin Hiri Motu IndonesianAbout 33,000 people on the country speak Indonesian. Kina 12 Samoa Apia 188,033 2830 km² English Samoan Tala 13 Solomon Islands Honiara 566,323 28900 km² English Pijin Solomon Islands dollar 14 Tonga Nuku'alofa 111,363 747 km² English Tongan Pa'anga 15 Tuvalu Funafuti 128,032 702 km² English Tuvaluan Tuvaluan dollar 16 Vanuatu Port Vila 266,374 12200 km² English French Bislama Vatu ==Notes== ==References== == Other website == * http://www.lonelyplanet.com/destinations/ * http://ontheworldmap.com *Continents Category:Lists by continent",
 "title": "List of countries by continents"
}