{
 "id": "4812",
 "text": "This is a list of countries and dependencies by population. It includes sovereign states, inhabited dependent territories and in some cases, constituent countries of sovereign states, with the list being primarily based on the ISO standard ISO 3166-1. For instance the United Kingdom is considered a single entity. In addition this list also includes certain unrecognized states not found in ISO 3166. The number shows how many people live in each country. Countries with the most people are at the top of the list. Countries with the fewest people are at the bottom. ==Method== Figures based on our charts are estimates or projections taken from our national census, where national data are available. Where national data are not available, figures are based on the population estimates of the United Nations. Areas that form integral parts of sovereign states, such as the countries of the United Kingdom are counted as part of the sovereign state concerned. Not included in the list are organizations such as the NATO. Other territories that are marked with an asterisk (*) are territories that do not have permanent population, such as the British Indian Ocean Territory or United States Minor Outlying Islands. ==Sovereign states and dependencies by population== Note: All 193 Members of the United Nations plus the two observer states are assigned a numbered rank. Dependent territories or constituent countries that are parts of sovereign states are not assigned a numbered rank. In addition, sovereign states with limited recognition are also included, but not assigned a number rank. List of countries and territories by total population Number Location Population % ofworld Date the United Nations) UN projection 1 Official estimate 2 Official projection Official projection 3 Official estimate 4 National annual projection 5 2023 census result 6 Official projection 7 2022 census result 8 2022 census result Official estimate National quarterly estimate*data provided by INEGI → ENOE* Monthly national estimate Official projection National annual projection Official estimate Official estimate Official figure Official estimate Official estimate National quarterly estimate Monthly national estimate Official estimate Monthly national estimate National annual projection 2022 census result Monthly national estimate National annual projection Official projection Official projection Monthly national estimate National quarterly estimate National annual projection National annual projection 2024 census result Official estimate Official projection National quarterly estimate Monthly national estimate Official projection National quarterly estimate UN estimate National annual projection Official estimate National annual projection National quarterly estimate National annual projection 2022 census result Official estimate 2021 census result National annual projection 2021 census result 2021 census result National annual projection Official projection Official projection National annual projection National annual projection Official estimate National projection Official estimate 2022 census result National annual projection Official estimate Official estimate National annual projection 2022 census result Official estimate National annual projection UN projection 2023 census result Official estimate National annual projection Official projection 2022 census result 2022 census result National annual projection National annual projection 2022 census result National annual projection National annual projection National annual projection National estimate Official estimate National estimate National annual projection National estimate Official estimate Official estimate 2022 census result 2023 estimate Monthly national estimate Official estimate Official estimate Official estimate Monthly national estimate National monthly estimate National annual projection Official estimate National quarterly estimate Official estimate National quarterly estimate National annual projection 2022 census result (China) National estimate National annual projection Monthly national estimate 2022 census result Official estimate National annual projection Official estimate Official estimate Official annual estimate 2023 census result Preliminary census result National quarterly estimate Official estimate National annual projection Monthly national estimate National quarterly estimate Official estimate National annual projection National quarterly estimate National quarterly estimate National annual projection National estimate 2022 census result Monthly national estimate Official estimate National annual projection 2023 census result Official estimate UN projection Official estimate National annual projection 2023 National census Official estimate (US) Annual projection National quarterly estimate 2023 National census Monthly national estimate Monthly national estimate National projection Official estimate Official estimate National projection National annual projection National annual projection Official projection National quarterly estimate Monthly national estimate Official estimate National annual projection Official estimate Official estimate Official estimate Official estimate National annual projection Official estimate National estimate Official projection National projection 2021 census result National annual projection National annual projection Official estimate 2017 census result National annual projection (China) National quarterly estimate Official estimate National annual estimate Official estimate Western Sahara UN projection Official estimate 2022 census result 2021 census result Official estimate 2022 census result National quarterly estimate Official estimate Official estimate National annual projection (France) National annual projection (France) National annual projection Official estimate National annual projection Census 2021 Official estimate (US) 2020 census result (Netherlands) 2023 census result National annual projection Official estimate Official estimate Official estimate (Netherlands) Official estimate National annual projection National annual estimate (UK) 2021 census result National annual estimate (US) 2020 census result Official estimate (UK) 2021 census result (UK) 2021 Census Official estimate (UK) National quarterly estimate (UK) National annual projection (Denmark) National quarterly estimate Official estimate (Denmark) Monthly national estimate 2022 census result (US) 2020 census result (UK) Official estimate (US) 2020 census result (Netherlands) Official estimate 2021 Census National estimate Census (UK) Official figure Monthly national estimate Saint Martin (France) Official estimate (UK) UN projection (Finland) Monthly national estimate 2021 Census (UK) Official estimate 2021 Census 2021 Census (France) 2023 census result National annual projection (France) Official estimate (France) Official estimate (UK) 2021 Census (UK) 2023 census result (UK) 2021 census result (Australia) 2021 Census (Australia) 2021 Census (New Zealand) 2022 Census (New Zealand) 2019 Census Official figure (Australia) 2021 Census (UK) Official estimate ==Related pages== *List of countries by population (United Nations) ==References== e * CIA, 9 August, 2005. Notes *Population",
 "title": "List of countries and dependencies by population"
}