{
 "id": "481581",
 "text": "The Chocolate Hills are a geological formation in Bohol Province, Philippines.Eye on the Philippines Global Eye Retrieved 22 December 2006. There are at least 1,260 hills (and maybe more) spread over an area of more than .Chocolate Hills Seven Natural Wonders. Retrieved 10 December 2011. They are covered in green grass that turns brown (like chocolate) during the dry season, hence the name. The Chocolate Hills a famous tourist attraction of the state Bohol. They are on the provincial flag and seal as natural attractions of the province.The Bohol Flag and Seal www.bohol.gov.ph Retrieved 15 November 2006. They are in the Philippine Tourism Authority's list of tourist destinations in the Philippines. They have been declared the country's third National Geological Monument and proposed for inclusion in the UNESCO World Heritage List.Chocolate Hills Natural Monument UNESCO World Heritage Centre Retrieved 14 November 2006. The Chocolate Hills are conical karst hills similar to those seen in the limestone regions of Slovenia, Croatia, northern Puerto Rico, Enugu and Pinar del Río Province, Cuba. They probably started as corals growing in a warm, shallow sea about two million years ago. The hills consist of sandy to rubbly marine limestones. These limestones contain abundant fossils of foraminifera, coral, molluscs, and algae.Hillmer G. 1987. Zur geologie und morphologie der straandterrassen von Cebu und Bohol Philippinen. Berliner geographische Studien. 25, p. 363–376.Travaglia C.R. et al 1987. Reconnaissance groundwater appraisal of Bohol Island, Philippines, by satellite data analysis. RSC Series no. 38. Food and Agriculture Organization of the United Nations, Rome, Italy. These conical hills were created by limestone dissolving in rainfall and groundwater. There was erosion by rivers and streams after they were lifted above sea level. The hills are separated by flat plains and have numerous caves and springs. The Chocolate Hills are a remarkable example of conical karst topography.Restificar S.D.F; Day M.J. & Urlich P.B. 2006. Protection of karst in the Philippines (Varstvo Krasa na Filipinih). 788 KB PDF version. Acta Carsologica. 35, (2), p. 121-130.Leman S.L; Reedman A. & Pei C.S. 2008. Geoheritage of East and Southeast Asia. , 5.7 MB PDF version. The CCOP-Institute for Environment and Development, Universiti Kebangsaan, Bangi Selangor, Malaysia. == References == Category:Bohol (province) Category:Carbonate rocks Category:National parks in Asia",
 "title": "Chocolate Hills"
}