{
 "id": "481664",
 "text": "Saqqara (), or Sakkara, is a vast ancient burial ground in Egypt, in area. It was the necropolis for the Ancient Egyptian capital, Memphis. Saqqara has numerous pyramids, including the world famous Pyramid of Djoser. This is sometimes referred to as the Step Tomb due to its rectangular base, and its 'steps' (mastabas: the Arabic word for 'bench'). It is about south of Cairo. Djoser's pyramid is the oldest complete stone building complex known. It was built in the Third Dynasty. Another 16 Egyptian kings built pyramids at Saqqara: these pyramids are now in various states of preservation. High officials added private funeral monuments to this necropolis during the whole pharaonic period. It was an important complex for non-royal burials and cult ceremonies for more than 3,000 years, well into Ptolemaic and Roman times. In 2018, an undisturbed tomb was discovered. It is believed to be the tomb of the royal priest Wahtye. The intact interior includes figures with colors on sculptures and wall carvings. https://www.bbc.com/news/world-middle- east-46580264 The area from Giza to Dahshur was made a World Heritage Site by UNESCO in 1979. The official name is \"Memphis and its Necropolis – the Pyramid Fields from Giza to Dahshur\". Some scholars think the name 'Saqqara' is not taken from the ancient Egyptian funerary god Sokar, but from a supposed local Berber Tribe called Beni Saqqar.Graindorge, Catherine, \"Sokar\". In Redford, Donald B., (ed) The Oxford Encyclopedia of Ancient Egypt, vol. III, pp. 305–307 == Photo gallery == Sakkara-04-Djoser-Pyramide-3.Dyn 27.JH-Palmen-1982-gje.jpg Sakkara-08-Djoser- Pyramide-Festhof-1982-gje.jpg Sakkara-12-Djoser-Pyramide-Ecke-1982-gje.jpg Sakkara-16-kleine Pyramide-1982-gje.jpg Sakkara-18-Mastaba of Mereruka- Statue-1982-gje.jpg Sakkara-20-Mastaba of Mereruka-Stiere-Voegel-1982-gje.jpg Sakkara-26-Mastaba of Mereruka-Schwein-1982-gje.jpg Sakkara-32-Blick auf die Pyramiden von Abusir (5. Dyn)-1982-gje.jpg|View to Abusir Sakkara-36-Blick auf die Pyramiden von Dahschur (4. Dyn)-1982-gje.jpg|View to Dahschur == References == Category:World Heritage Sites in Egypt Category:Buildings and structures in Ancient Egypt",
 "title": "Saqqara"
}