{
 "id": "48175",
 "text": "A war crime is a crime that breaks international laws of war. These laws say what is allowed during war and what is not. Today, these international laws are the Geneva Conventions and the Hague Convention. ==Definition== To be a war crime, a crime must be part of a plan or has to be committed against protected persons and must be committed during a war. ===International armed conflicts=== In international armed conflicts, only prisoners of war, wounded and sick enemy fighters, shipwrecked survivors, and enemy civilians are protected persons. Nationals under their own authority as well as neutral civilians living in a belligerent state and allied citizens as long their states maintain diplomatic relations with a belligerent power are not protected persons under the law of war in the same conflicts. ===Non- international armed conflicts=== In non-international armed conflicts, persons not taking part in hostilities are protected regardless of nationality. The idea of what a \"war crime\" is has changed over time. For example, in the 1940s, the strategic bombing during World War II was not a war crime. Now it is. ===International Criminal Court=== In 2002, the International Criminal Court (ICC) was created. Its goal is to look into and, if possible, punish people for war crimes. When the ICC was created, it came up with a longer list of war crimes. Its list was the first to include types of sexual abuse like forcing women into sexual slavery.pp. 8–10 ==Types of war crimes== Here are some examples of crimes that the ICC lists as war crimes. ===General war crimes=== These are war crimes whether they are committed against enemy soldiers or protected civilians or neutral persons.Law of Armed Conflict: Neutrality * Torture * Taking hostages * Destroying or stealing property * Willful attacks on neutral persons, property, or territory * Doing medical experiments on a person that will hurt them * Causing \"great suffering\" (severe physical or mental pain) on purpose * Keeping a person in jail, sentencing them, or executing them without a trial * Using chemical weapons, biological weapons, or other weapons that are illegal under international law ===Sexual war crimes=== These are war crimes whether they are committed against enemy soldiers or protected civilians or neutral persons. * Rape * Sexual slavery * Forcing a person to get sterilized * Forcing a woman to get pregnant * Forcing a person to be a prostitute * Sexual violence, including all other types of sexual abuse === War crimes against protected civilians === War crimes against protected civilians include: * Forcing protected children to become soldiers * Forcing protected civilians to leave their home countries * Starving protected civilians on purpose, as a way of making war * Attacking protected civilians, killing them, or destroying their property * Making an attack that is obviously going to kill and injure many protected civilians * Attacking places like religious buildings, schools, and hospitals, which have nothing to do with war * Mutilating a protected civilian, e.g. by cutting off an arm or hurting them in other ways that will show forever ===War crimes against enemy soldiers=== War crimes against enemy soldiers include: * Killing prisoners of war * Hurting or killing a person who has surrendered * Hurting or killing a person who is clearly a military medic or a chaplain * Tricking enemy soldiers by using a flag to signal a truce, then attacking * Hurting or killing a person who is unable to fight, e.g. because they are injured or sick * Using flags, insignia, or uniforms worn by enemy soldiers or the United Nations as a disguise while attacking ===War crimes against neutral persons=== War crimes against neutral persons include: * Hurting or killing a person who is a peacekeeper * Hurting or killing a person whose country is not participating in an armed conflict, e.g. a neutral warship in belligerent waters ==Examples of war crimes== This table shows some examples of war crimes. WAR PERPETRATOR Incident Type of war crimes Ordered or Committed By Notes World War I (1914-1918) All major belligerents Chemical weapons in World War I Use of chemical weapons Ordered by all major belligerents Throughout World War I, all major belligerents employed chemical weapons in combat in violation of the Hague Conventions of 1899 and 1907, which prohibited the use of \"poison or poisoned weapons\" in international conflicts. Second Sino- Japanese War (1937-1945) Empire of Japan Nanjing Massacre Mass murder of civilians and prisoners of war; torture; rape; robbery; setting buildings on fire Committed by the Imperial Japanese Army For six weeks after invading and taking over Nanjing, China, Japanese soldiers committed war crimes. About 200,000 people died or were killed. World War II (1939-1945) Nazi Germany Invasion of Poland Mass murder of civilians, including hospital patients; attacking refugees and civilian buildings Committed by the German Wehrmacht and Schutzstaffel (SS) The Nazis killed about 150,000–200,000 Polish civilians, including over 20,000 in mass executions by mobile death squads, and about 6,000 hospital patients. World War II (1939-1945) Empire of Japan Attack on Pearl Harbor Attacking neutral territory and murder of neutral persons Committed by the Imperial Japanese Navy On December 7, 1941, Imperial Japanese Navy aircraft and submarines attacked a United States naval base at Pearl Harbor without a state of war and without explicit warning, killing 2,403 people, destroying 188 U.S. aircraft, and sinking eight battleships. World War II (1939-1945) United States Biscari massacre Murder of prisoners of war Sergeant Horace T. West; Captain John T. Compton During the Allied invasion of Sicily, American soldiers killed 76 Italian and German prisoners of war. West was found guilty in an American court martial; Compton was found not guilty. Vietnam War (1955-1975) North Vietnam Massacre at Huế Mass murder, beatings, and torture of civilians Viet Cong and People's Army of Vietnam The Battle of Huế began on 31 January 1968, and lasted a total of 26 days. During the months and years that followed, dozens of mass graves were discovered in and around Huế. Victims included men, women, children, and infants killed under North Vietnamese occupation of Huế, South Vietnam. The estimated death toll was between 2,800 and 6,000 civilians and prisoners of war, or 5–10% of the total population of Huế. Victims were found bound, tortured, and sometimes buried alive. Many victims were also clubbed to death.Kendrick Oliver, The My Lai Massacre in American History and Memory (Manchester University Press, 2006), p. 27.Pierre Journod, \"La France, les États-Unis et la guerre du Vietnam: l'année 1968\", in Les relations franco-américaines au XX siècle, edited by Pierre Melandri and Serge Ricard (L'Harmattan, 2003), p. 176. The Troubles (1968-1998) United Kingdom Actions in Northern Ireland Torture; killing suspects (including a civilian) without trying to arrest them first Members of the British Army In the 1970s, members of the British Army commonly used torture, including waterboarding, on prisoners in Northern Ireland. They also started a \"shoot to kill\" policy, where they would shoot and kill suspects without trying to arrest them first. The European Court of Human Rights ruled that this was illegal. Iran-Iraq War (1980-1988) Iraq Iraqi chemical attacks against Iran Use of chemical weapons Ordered by Saddam Hussein; led by Alī Ḥassan al-Majīd (\"Chemical Ali\") Throughout the 1980s, Iraq used poison gases to attack Iran. A Dutch war crimes tribunal also found a Dutch businessman guilty for selling Iraq chemical weapons. War in Uganda (1985 today) Lord's Resistance Army (LRA) Many events Mass murder; kidnapping; forcing children to be soldiers and sex slaves; attacking civilians Led by Joseph Kony The LRA is a rebel group in Uganda, started in 1987. Since 1987, the LRA has forced about 60,000 100,000 children to be soldiers, and about 2 million people in central Africa had to leave their homes. In 2002, Kony ordered the LRA to start attacking civilians. The ICC has indicted Kony for 21 different war crimes. The Court has also indicted four other LRA leaders. War in Darfur (2003 today) Sudan Many events Mass murder of civilians; destroying civilian villages; rape; making civilians leave home; looting Led by Omar al-Bashir; committed by Sudanese military, police, and militia The al-Bashir government has committed many crimes against people in Darfur who are not of the Arab, Muslim majority. In 2014, the United Nations estimated that 300,000 had been killed and more than 1.5 million had been forced to leave their homes. The ICC has indicted al-Bashir and five other leaders with war crimes. ==Photo gallery== Louvain1915.jpg|The destroyed Belgian city of Leuven in 1915 by German occupation troops British 55th Division gas casualties 10 April 1918.jpg|British troops blinded by poison gas during the Battle of Estaires Chinese_civilians_to_be_buried_alive.jpg|Japanese soldiers bury Chinese civilian prisoners alive during the Nanjing Massacre Zniszczenia1939 0.jpg|Nazi invasion of Poland destroyed this Polish city, including civilian buildings Katyn Massacre - Mass Graves 2.jpg|Mass grave of Polish officers killed in the massacre at Katyn Forest Seamen at Kaneohe NAS decorate graves of Pearl Harbor victims.jpg|Seamen at Kaneohe Naval Air Station decorate the graves of their fellow neutral sailors killed at Pearl Harbor Bundesarchiv_Bild_146-1993-020-26A,_Lidice,_Ort_nach_Zerstörung.jpg|Lidice massacre in 1942 after its destruction by the Nazis Va006869.jpg|Bits of tattered clothing, sandals and slippers are examined by Vietnamese women who lost relatives in the 1968 Huế massacre Sardashtchemic.jpg|Iranian victims of the Iraqi chemical attack on Sardasht Darfur IDPs children sitting.jpg|A Sudanese family sitting in a refugee camp ICC member states.svg|Some countries (red on this map) have not agreed to be part of the ICC. This makes it harder for the ICC to punish war crimes in those countries ==Related pages== * The Holocaust * Bosnian genocide * Hague Convention * Rwandan genocide * Geneva Conventions * Cambodian genocide * Command responsibility * Crimes against humanity ==References==",
 "title": "War crime"
}