{
 "id": "482308",
 "text": "Thai people, formerly known as Siamese, are the main ethnic group of Thailand. They are part of the larger Tai group of peoples living in Southeast Asia, southern China and north-east India. They speak the Thai language, which has several regional variations. Most Thai people are followers of Theravada Buddhism. \"Thai people\" usually refers to central and southern Thai (Tai Siam),Cheesman, P. (1988). Lao textiles: ancient symbols-living art. Bangkok, Thailand: White Lotus Co., Thailand.Fox, M. (1997). A history of Laos. Cambridge, U.K.: Cambridge University Press.Fox, M. (2008). Historical Dictionary of Laos (3rd ed.). Lanham: Scarecrow Press.Goodden, C. (1999). Around Lan-na: a guide to Thailand's northern border region from Chiang Mai to Nan. Halesworth, Suffolk: Jungle Books.Wijeyewardene, G. (1990). Ethnic groups across national boundaries in mainland Southeast Asia. Singapore: Institute of Southeast Asian Studies. northern Thai (Lanna) and Isan people. However, the term has a loose meaning and can sometimes refer to any person from Thailand, not only ethnic Thais. About 60 million live in Thailand. Large populations have lived in Laos, Malaysia, Cambodia and Myanmar for many years. The ancestors of modern Thai people were one of the many ethnic tribes of the southern Chinese state of Chu which existed between 600 B.C. and 200 B.C. during the Warring States period. At that time, the ancestors of modern Thai people were known as Hundred [meaning various] Yue tribes, and had oral tradition, but without written tradition. During that time, there were relatively few people interspersed in a vast area of wilderness in southern China, extending as far north as the Yangtze River and as far south as the Pearl River. The earliest well-known written recording of the Kra-dai languages, which include the modern Thai language, is called the Song of the Yue Boatman, which was written over 2500 years ago in the state of Chu of southern China. The Kra-Dai pronunciations of the Song of the Yue Boatman were approximated by Old Chinese characters. The Kra-Dai meaning of the Song of the Yue Boatman was also translated into Old Chinese. More recent ancestors of modern Thai people, together with other ethnic groups, established the kingdom of Nam Zhao during the 7th to 9th century A.D. in Yunnan in southwest China. Tai peoples began to move south some time between the 8th and 10th centuries.Pittayaporn, Pittayawat (2014). Layers of Chinese Loanwords in Proto-Southwestern Tai as Evidence for the Dating of the Spread of Southwestern Tai. MANUSYA: Journal of Humanities, Special Issue No 20: 47-64. They settled in the valley of the Chao Phraya River. They became heavily influenced by Mon and Khmer and adopted Theravada Buddhism. Early Thai states included the Sukhothai Kingdom and Suphan Buri Province. The Thai were called \"Siam\" by the Khmer, and were ruled by the Khmer Empire. The Thai people began growing in power after they built Ayutthaya. ==References== Category:Ethnic groups in Asia",
 "title": "Thai people"
}