{
 "id": "48244",
 "text": "John Foxe (1516/1517 – 18 April 1587),\"The patent of arms granted in 1590 to the family of John Foxe, and first printed by Maitland from a copy of 1692 in the college of arms, gives his birth year as 1516, and the date may have been supplied by [his own son] Samuel. But Samuel is very inaccurate in such matters; his diary misdates important happenings in his own life; and [his other son] Simeon's statement is too precise to be disregarded.\" Mozley, 12. is remembered as the author of Foxe's Book of Martyrs. == Education and Resignation from Oxford == Foxe was born in Boston, Lincolnshire, England into a prominent family. In 1535 Foxe was admitted to Magdalen College School. He became a fellow in July 1539. Foxe resigned from his college in 1545, after referring to it as \"a prison.\" During his time at Oxford he became an evangelical, meaning that he converted to Protestant beliefs not accepted by the Church of England under Henry VIII. As he wanted to leave Oxford, Foxe looked to other evangelicals for help but received only advice and a little money. Foxe married Agnes Randall on February 3, 1547. == Life in London under Edward VI == With the death of Henry VIII in January 1547 Foxe's prospects (and those of the evangelical cause generally) changed for the better. Foxe was ordained deacon by Nicholas Ridley on June 24, 1550. == Marian Exile == In the fall of 1554 Foxe moved to Frankfurt, where he lived with Anthony Gilby in the English colony of Protestant refugees. Foxe then removed to Basel where he lived and worked with John Bale and Lawrence Humphrey. == Return to England == In 1559, when Mary I had died Foxe returned to England. He lived for some time at Aldgate, London, in the house of his former pupil, Thomas Howard. Foxe started publishing works of religious controversy and worked on a new martyrology, which would become the Foxe's Book of Martyrs. Foxe was ordained priest by Edmund Grindal, now Bishop of London, on January 25, 1560, and he moved to Norwich to live with its bishop, John Parkhurst. On March 23 of the following year the first edition of Foxe's Book of Martyrs was published. Foxe was one of the earliest students of Anglo-Saxon, and he and Day published an edition of the Saxon gospels with the help of Archbishop Parker. Foxe died on 8 April 1587 and was buried at St. Giles's, Cripplegate. == References == == Other websites == * Foxe's Book of Martyrs (Actes and Monuments) Variorum Edition Online , from the Humanities Research Institute of The University of Sheffield * Thomas Freeman, John Foxe: A Biography Category:1516 births Category:1587 deaths Category:Alumni of the University of Oxford Category:Boston, Lincolnshire Category:English historians Category:British Protestants Category:Christian ministers Category:Writers from Lincolnshire",
 "title": "John Foxe"
}