{
 "id": "482480",
 "text": "LibreOffice is a free open source office suite. It was forked from Sun Microsystems' OpenOffice.org office suite. It is a collection of office- related applications. This includes a word processor, a spreadsheet program and a presentation program. It is available for many different operating systems, including Windows, macOS and Linux. It supports the OpenDocument format as well as the file formats of Microsoft Office and most other office suites. LibreOffice was created by the Document Foundation in response to Oracle Corporation's acquisition of Sun Microsystems. == Parts == LibreOffice is a collection of applications that work together closely to provide the features expected from a modern office suite. Many of the parts are designed to be alternatives to those available in Microsoft Office. The parts available include: Component Notes Writer A word processor similar in look and feel to Microsoft Word and offering a comparable range of functions and tools. It also includes the ability to export Portable Document Format (PDF) files with no additional software, and can also function as a WYSIWYG editor for creating and editing web pages. Calc A spreadsheet similar to Microsoft Excel with a roughly equivalent range of features. Calc provides a number of features not present in Excel, including a system which automatically defines series for graphing, based on the layout of the user’s data. Calc is also capable of writing spreadsheets directly as a PDF file. Impress A presentation program similar to Microsoft PowerPoint. It includes the ability to create PDF files, and the ability to read Microsoft PowerPoint's .ppt and .pptx formats. Impress includes several ready-made presentation designs. More templates are readily available on the Internet.Presentation templates at OpenOffice.orgImpress Templates - User/Template Draw A vector graphics editor comparable in features to Microsoft Visio and early versions of CorelDRAW. It features versatile \"connectors\" between shapes, which are available in a range of line styles and facilitate building drawings such as flowcharts. It has similar features to desktop publishing software such as Scribus and Microsoft Publisher. Base A database program similar to Microsoft Access. Base allows the creation and manipulation of databases (using HSQLDB or Firebird as its storage engine), and the building of forms and reports to provide easy access to data for end- users. As with Access, Base may be used as a front-end to a number of different database systems, including Access databases (JET), ODBC/JDBC data sources and MySQL, MariaDB, PostgreSQL. While Base can be a front-end for any of the databases listed, there is no need for any of them to be installed. Math A tool for creating and editing mathematical formulae, similar to Microsoft Equation Editor. Formulae can be embedded inside other LibreOffice documents, such as those created by Writer. It supports multiple fonts and can export to PDF. == Supported operating systems == LibreOffice is available for Windows, macOS and Linux. There are also versions for Android, iOS and Chrome OS, called Collabora Office. They are provided by Collabora, one of the companies that develop LibreOffice. Collabora also develops Collabora Online, an online office suite based on LibreOffice that can be used from a web browser by multiple users. ==Scripting and extensions== LibreOffice supports third-party extensions. There are many available in the official LibreOffice site. Users can create their own using programming languages like LibreOffice Basic (a language similar to Visual Basic for Applications), Python and others. ==Versions== LibreOffice is available in two versions: * Fresh – the most recent major version, which contains the latest enhancements but which may have introduced bugs that are not in the \"still\" release. * Still – the prior major version, which, by the time it has become the \"still\" version, has had around six months of bug fixing. Users who want the most stable software should use this. When a new Fresh version is released, the existing one becomes the Still version. The previous Still version is not supported anymore. ===Release time=== LibreOffice releases a new major version every six months, in late January/early February and late July/early August. ==Other websites== * * The Document Foundation * == References == Category:Office suites Category:LibreOffice Category:Word processors Category:Spreadsheet software Category:Presentation software Category:Diagramming software Category:Graphics software Category:Vector graphics editors Category:Cross- platform software",
 "title": "LibreOffice"
}