{
 "id": "482569",
 "text": "Arthur \"Afa\" Anoa'i, Sr. (November 21, 1942 - August 16, 2024) was a Samoan American professional wrestler and manager. He was best known as one-half of the tag team The Wild Samoans with his brother Sika. He competed in many different National Wrestling Alliance (NWA) affiliates and the World Wide Wrestling Federation (WWWF). ==Personal life== He was born in Samoa and he moved with his family to San Francisco, California. Before becoming a professional wrestler, Anoa'i joined the United States Marine Corps at the age of 17. After retiring, he started the Wild Samoan Training Facility with Sika. In 1999, along with Lynn Anoa'i, Afa started the Usos Foundation, which is a non-profit organization that aims towards turning young people away from drugs, gangs and poverty by giving scholarships to the Wild Samoans Training Center. ===Health and death=== On January 11, 2024, Afa was admitted to the hospital for pneumonia and had also suffered two small heart attacks. On August 16, 2024, it was announced that Afa had died from a heart attack in Pennsylvania at the age of 81. ==Championships== *World Wrestling Council **WWC North American Tag Team Championship (1 time) (with Sika) *Championship Wrestling from Florida **NWA Florida Tag Team Championship (1 time) (with Sika) *Continental Wrestling Association **AWA Southern Tag Team Championship (1 time) (with Sika) *Georgia Championship Wrestling **NWA National Tag Team Championship (1 time) (with Sika) *Gulf Coast Championship Wrestling **NWA Gulf Coast Tag Team Championship (2 times) (with Sika) *International Wrestling Alliance **IWA Tag Team Championship (1 time) (with Sika) *Mid-South Wrestling Association **Mid-South Tag Team Championship (3 times) (with Sika) *NWA: All-Star Wrestling **NWA Canadian Tag Team Championship (Vancouver version) (1 time) (with Sika) *NWA Detroit **NWA World Tag Team Championship (Detroit version) (2 times) (with Sika) *Professional Wrestling Hall of Fame **Inducted as a member of the Wild Samoans (Class of 2012) *Southeastern Championship Wrestling **NWA Southern Tag Team Championship (Southern Division) (2 times) (with Sika) *Stampede Wrestling **Stampede Wrestling International Tag Team Championship (2 times) (with Sika) *World Wrestling Entertainment/World Wrestling Federation **WWF Tag Team Championship (3 times) (with Sika) **WWE Hall of Fame (Class of 2007) ==Acting== ===Movies=== *Body Slam - Himself (1987) *Mr. Nanny - Himself (1993) ===Television=== *Miami Vice - Henchman #2 (1987) == References == ==Other websites== * * Category:1942 births Category:2024 deaths Category:American movie actors Category:American professional wrestlers Category:Deaths from myocardial infarction Category:Former WWE wrestlers Category:Professional wrestling managers and valets Category:Professional wrestling promoters Category:Sportspeople from San Francisco Category:WWE Hall of Fame",
 "title": "Afa Anoaʻi"
}