{
 "id": "482602",
 "text": "The Smiler is a Gerstlauer Infinity Coaster located at Alton Towers in Staffordshire, United Kingdom. It has 14 inversions. The Smiler holds the world record for the roller coaster with the most inversions. The riders must be tall to ride the smiler. The top speed is about . Riders experience about the same G-Force as a drag car driver (about 4.5 Gs). The Smiler had multiple delays before opening to the public including unforseen teething problems on the 23rd which delayed the opening by another 8 days. The Smiler finally opened to the public on the 31 May 2013. The ride's trains are arranged in 4 individual ride cars in which seat four people, leading to a capacity of 16 riders per train. Five trains can run on the track at once, leading to a capacity of 1,000 riders per hour. On June 2nd 2015, an accident occurred where 5 people were seriously injured when the train crashed into a stalled test train in the batwing element.. After rigorous safety checks, the ride reopened in March 2016, and is still operating to this day with no further problems. It is perfectly safe today. == Advertising == On 11 April 2012 a mini-site was launched so visitors could check the building progress of the ride. During this time, the ride was codenamed “SW7”, like other roller coasters at Alton Towers were. During September of that year, there was subliminal advertising on the Alton Towers website and stencil art of The Smiler logo around the park. In early 2013, the logo was projected on various buildings including Big Ben, ticket barriers at Leeds railway station and even spray painted on flocks of sheep in Leicestershire, Devon and Perthshire. On 21 January 2013 the name was revealed to be “The Smiler”. In February a free mobile app was released, where you could “control” the Smiler. This is now deleted. Starting in early April, Alton Towers released a mini series showing the ride’s backstory. == Opening == The ride had a troubled opening. It was meant to first open in March 2013, but it was delayed because of issues with the lift hill. Because of this, the ride’s opening date was changed to the 23rd May 2013. Later, it was changed again to the 31st May 2013. This made people angry because they had booked to stay at the Alton Towers Hotel to be the first to ride the roller coaster. However, Alton Towers let those change their date of booking for free. == Incidents == On 2 June 2015, a very serious accident happened. An empty train collided with a full train. The staff running the ride that day decided to add another train. They decided to test the extra train to see if it was working properly. On one of the inversions, the train valleyed (got stuck) on the track. Shortly after this, a full train was sent around. A safety precaution stops a train from going up a lifthill when another train hasn’t completed a section. This happened, and the train stopped at the top of the lifthill. The staff thought it was an issue so they overrided it and let the train go as normal. Seconds later the full train collided full speed with the empty train, requiring two people needing amputation and a few other people were hurt. Because of this, Merlin Entertainments, the owners of the park were fined £7.5 million. == References == Category:Roller coasters by name Category:Staffordshire Category:2013 establishments in the United Kingdom Category:2010s establishments in England",
 "title": "The Smiler"
}