{
 "id": "48275",
 "text": "The 940s was a decade that started on 1 January 940 and ended on 31 December 949. It is distinct from the decade known as the 95th decade which began on January 1, 941 and ended on December 31, 950. __NOTOC__ ==940== * Saadia Gaon makes his siddur (Jewish prayer book) in Iraq. * Narita-san Temple is founded in Chiba, Japan. * The Liao Dynasty stops the rule that a younger sister replace an older sister who died in marriage. === Births === * Abu'l-Wafa, Iranian mathematician * Brian Boru, high king of Ireland === Deaths === * July 20 - Ibn Muqla, Abbasid vizier and calligrapher * December 25 - Makan ibn Kaki, Dailamite warlord * Taira no Masakado, leader of the Taira Clan ==941== * The Rus'-Byzantine War is fought. * Oda the Severe becomes Archbishop of Canterbury. === Births === * Charles d'Outremer, son of Louis IV of France * Brian Bórumha mac Cennétig, High-King of Ireland === Deaths === * April 21 - Bajkam, commander of commanders of the Abbasid Caliphate ==942== * The Chavda Kingdom is overthrown in Gujarat, India. * October 30 - Pope Marinus II succeeds Pope Stephen VIII as the 128th pope. === Births === * Pampa, Kannada poet in India * Genshin, Tendai scholar === Deaths === * King Idwal Foel of Gwynedd * December 17 - William I of Normandy * Gaozu of Later Jin, founder of the Later Jin Dynasty in China * Liu Yan of the Southern Han Kingdom ==943== * King Constantin II of Scotland retires and becomes a monk. His cousin Malcolm I of Scotland becomes king. === Births === *Dayang Jingxuan, a Zen Buddhist monk === Deaths === * Wang Kon, founder of the Koryo dynasty * Emperor Liezu of Southern Tang ==944== * The city of Algiers is (re)founded by the Zirid king Buluggin ibn Ziri. * Abu Yazid starts a rebellion against the Fatimids in the Aures Mountains. * The Al-Askari Mosque is built in Samarra. * King Edmund I of England takes Northumbria from the Vikings. * Emperor Romanos I Lekapenos is deposed as Byzantine emperor. It was by his own sons, Stephen Lekapenos and Constantine Lekapenos. === Births === * Otto, Duke of Burgundy * Minamoto no Yorimitsu * Fujiwara no Sukemasa * Fujiwara no Akimitsu === Deaths === * Flaithbertach mac Inmainén, abbot of Inis Cathaig, Ireland * Wilgred of Lindisfarne, Bishop of Lindisfarne * Abu Mansur Al Maturidi, Muslim theologian * Ngo Quyen, Vietnamese prefect and general * Wichmann the Elder, Saxon nobleman * Donnchad Donn, King of Ireland ==945== * The Buyid dynasty takes control of Baghdad. * The Min Kingdom is taken over by the Southern Tang Kingdom. * Edmund I of England conquers Strathclyde. He makes an alliance with Malcolm I of Scotland and gives Cumberland and Westmorland to him. * Lothair II of Italy takes control of Italy. * Romanos I Lekapenos is overthrown. Byzantine Emperor Constantine VII rules alone. === Births === * Abbo of Fleury, French monk === Deaths === * Igor of Kiev * King Krešimir I of Croatia ==946== * Eadred I becomes king of England. * Emperor Murakami becomes Emperor of Japan. * May 10 - Pope Agapitus II succeeds Pope Marinus II as the 129th pope. === Deaths === * May 17 - Al Qa'im, second Fatimid caliph. * May 26 - King Edmund I of England ==947== * The Later Jin Dynasty falls to the Later Han Dynasty in China. === Births === * Adelaide of Anjou, daughter of Fulk II of Anjou and Gerberg === Deaths === * May 18 - Emperor Taizong of the Liao Dynasty * Topiltzin Ce Acatl Quetzalcoatl, Toltec ruler * Wulfgar of Lichfield, Bishop of Lichfield * Sexhelm of Lindisfarne, Bishop of Lindisfarne * Shi Chonggui, last Emperor of China from the Later Jin Dynasty * Uchtred of Lindisfarne, Bishop of Lindisfarne * Zoltán of Hungary, Grand Prince of the Magyars ==948== * The Nri Kingdom is started by Eri. The kingdom was in what is now Nigeria. * The Nallur Kandaswamy temple is built. === Births === * Gang Gam-chan, Korean government official and military commander * Emperor Jingzong of Liao === Deaths === * December 16 - Romanos I Lekapenos, Byzantine Emperor * Gao Conghui * Gaozu of Later Han ==949== * The Byzantine Empire starts another expedition against the Emirate of Crete. === Deaths === * Emperor Yōzei, Emperor of Japan * Yunmen Wenyan, Chinese Zen Buddhist monk",
 "title": "940s"
}