{
 "id": "482938",
 "text": "This is a list of the pharaohs of Ancient Egypt. It starts in the Early Dynastic Period, before 3100 BC. It ends with the Ptolemaic Dynasty, when Egypt became a province of Rome under Augustus in 30 BC. The dates given are approximate. The list of pharaohs uses the dates of Ancient Egypt, developed by the Petrie Museum of Egyptian Archaeology. ==Old lists of pharaohs== There are old lists of pharaohs which have been discovered. These are not complete: * Palermo Stone * Turin King List * Manetho's book, Aegyptiaca (History of Egypt) * Abydos King List * Karnak Tablet * South Saqqara Stone (discovered 1923, includes the Sixth Dynasty kings) * Saqqara Tablet (discovered 1861, includes dynasties from 1–12) Other lists can be found in Herodotus, Diodorus Siculus, and Eratosthenes. Two other lists are not believed to be reliable, these are the work of \"the Arabic writers\", and the Book of Sothis. ==List== In the legendary period, there were eight god kings who ruled over Egypt. The Palermo, Turin and Manetho king lists, have different names for the eight god kings. Turin King List Manetho (Greek name) Function Ptah Hephaestus (Ptah) Craftsmen & Creation Ra Helios (Apollo) Sun Shu Aelos or Agathosdaimon (perhaps Sothis?) (Shu) Air Geb Gaia (Demeter) Earth Osiris Hades Afterlife Seth Typhon (Set) Chaos Horus Ares War Thoth Athena Knowledge Ma'at Order The god kings were followed by kings who were part god and part human. The old lists are different in naming these rulers. Turin King List Length Manetho Length Second dynasty of gods unknown Dynasty of Halfgods unknown Three Achu-Dynasties unknown 30 Kings from Memphis 1790 years Dynasty of Disciples of Horus unknown 10 Kings from Thinis 350 years ==Archaic period== The Archaic period includes the Early Dynastic Period, when Lower Egypt and Upper Egypt were ruled as separate kingdoms. ===Early Dynastic: Lower Egypt=== Lower Egypt was the northern Nile and the Nile Delta. The list may not be complete: Name Comments Dates Hsekiu Only listed on the Palermo Stone ? Khayu Only listed on the Palermo Stone ? TiuBreasted (1909) p.36 Only listed on the Palermo Stone ? Thesh Only listed on the Palermo Stone ? Neheb Only listed on the Palermo Stone ? Wazner Only listed on the Palermo Stone c. 3100 BC? Mekh Only listed on the Palermo Stone ? (destroyed) Only listed on the Palermo Stone ? Double Falcon Also known through finds from Sinai and Lower Egypt c. 3200 BC? ===Early Dynastic: Upper Egypt=== Upper Egypt was the Nile Valley, south of the Delta. The following list may not be complete (there are many more of uncertain existence): Name Image Comments Dates Scorpion I Oldest tomb at Umm el-Qa'ab had scorpion symbol c. 3200 BC? Iry-Hor Possibly the immediate predecessor of Ka. c. 3150 BC? KaRice (1999) p.86Wilkinson (1999) pp.57f. Maybe read Sekhen rather than Ka. Possibly the immediate predecessor of Narmer. c. 3100 BC King Scorpion Possibly could read Serqet; maybe the same person as Narmer. c. 3150 BC Narmer The king who combined Upper and Lower Egypt.Shaw (2000) p.196 c. 3150 BC ===First Dynasty=== The First Dynasty ruled from about 3150 to 2890 BC. Name Image Comments Dates Narmer Believed to be the same person as Menes and to have unified Upper and Lower Egypt. c. 3150 BC Hor-Aha -- c. 3050 BC Djer -- 41 years Djet -- 10 yearsWolfgang Helck: Untersuchungen zur Thinitenzeit (Agyptologische Abhandlungen), , O. Harrassowitz (1987), p. 124 Merneith Female Regent for Den, may have ruled as pharaoh in her own right -- Den First pharaoh shown wearing the double crown of Egypt, first pharaoh with a golden Horus name. 42 years Anedjib -- 10 years Semerkhet -- 9 years Qa'a -- 2916?-2890 BC In the interregnum between the first and second dynasties, two short lived pharaohs may have reigned : Name Image Comments Dates Sneferka Very short reign c. 2900 BC Horus Bird Very short reign c. 2900 BC ===Second Dynasty=== The Second Dynasty ruled c. 2890–2686 BC. Name Image Comments Dates HotepsekhemwyWilkinson (1999) pp. 83–84 — 25–29 years RanebWilkinson (1999) p. 84 Name may be read Nebra rather than Raneb. Could be the same person as Weneg.Jochem Kahl: Ra is my Lord: Searching for the Rise of the Sun God at the Dawn of Egyptian History. Harrassowitz, Wiesbaden 2007, , page 12–14 & 74. 10–14 years NynetjerWilkinson (1999) p. 79 May have divided Egypt between his successors 43–45 years WenegWilkinson (1999) pp. 87–88 Could be an independent ruler or the same as Sekhemib-Perenmaat or Raneb SenedjPascal Vernus, Jean Yoyotte, The Book of the Pharaohs, Cornell University Press 2003, p.27 Possibly the same person as Seth Peribsen Jürgen von Beckerath: Handbuch der ägyptischen Königsnamen.. Deutscher Kunstverlag, München/Berlin 1984, , page 171. Seth-Peribsen Seth- Peribsen May have reigned over Upper Egypt only, could be the same person as Senedj or Sekhemib-Perenmaat. Sekhemib-Perenmaat May have reigned over Upper Egypt only, could be the same person as Seth-Peribsen.Darell D. Baker: The Encyclopedia of the Pharaohs: Volume I – Predynastic to the Twentieth Dynasty 3300–1069 BC, Stacey International, , 2008 Khasekhem(wy) King Khasekhem King Khasekhemwy Reunified Egypt after a period of troubles ca. 2690 BC 17–18 years ==Old Kingdom== The Old Kingdom was a peak of civilisation and achievement. This was the first of three so-called \"Kingdom\" periods which mark the high points of civilization in the Nile Valley. It began when Egypt was ruled by the Third Dynasty through the Sixth Dynasty (2686-2181 BC). Many Egyptologists also include the Memphite Seventh and Eighth Dynasties in the Old Kingdom. The Old Kingdom was followed by a period of disunity called the First Intermediate Period, or as the Egyptians called it, the \"first illness.\" The royal capital of Egypt during the Old Kingdom was at Memphis. This is where Djoser set up his court. The Old Kingdom is known for the large number of pyramids. These were built as tombs for the pharoahs. The Old Kingdom is called \"the Age of the Pyramids\". ===Third Dynasty=== The Third Dynasty ruled from 2686 to 2613 BC. Name Image Comments Dates DjoserToby Wilkinson, Early Dynastic Egypt, Routledge, 1999, pp.83 & 95Toby Wilkinson, Royal Annals of Ancient Egypt, pp.79 & 258 Ordered the first pyramid in Egypt, known as The Step Pyramid. Built by the chief architect and scribe, ImhotepVerner (2001) 19 or 28 years ca. 2670 BC; Radiocarbon dates start reign between 2691 and 2625Christopher Bronk Ramsey et al., [url=\"https://dx.doi.org/10.1126/science.1189395\"]Radiocarbon-Based Chronology for Dynastic Egypt[/url], [i]Science[/i] 18 June 2010: Vol. 328. no. 5985, pp. 1554 - 1557 SekhemkhetClayton (1994) p.32 Imhotep helped build his unfinished step pyramid 2649-2643 Sanakhte Could be the same as Nebka c. 2650 Khaba Built an unfinished step pyramid 2643-2637 HuniClayton (1994) p.42 Could be the same as Qahedjet, may have started the Meidum pyramid 2637-2613 ===Fourth Dynasty=== The Fourth Dynasty ruled from 2613 to 2498 BC. It included the pharaohs who had the Great Pyramids built, Khufu (Cheops), Khafra (Chephren) and Menkaura (Mycerinus). Name Image Comments Dates Sneferu Built the Meidum Pyramid and the Bent Pyramid (341 ft/103m from the base to the tip). The Bent Pyramid has normal angles at the bottom but changes at the top. He also built the first \"true\" pyramid, the Red Pyramid. Some say that he was buried in the Red Pyramid, while others say that he was buried in the Bent Pyramid. Bones have been found at the Red Pyramid, but there is no evidence that this is Sneferu's body. 2613-2589 BC Khufu Greek form: Cheops. Built the great pyramid of Giza. In some early sources, Khufu is listed as the \"third\" of his family to rule, but there is no known record of a pharaoh between Sneferu and Khufu. It is possible that there might have been a short reign of some elder brother of Khufu, whose inscriptions, names, and monuments have gone for one reason or another. 2589-2566 BC Djedefra (Radjedef) Believed to have created the Great Sphinx of Giza as a monument to his father. He also created a pyramid at Abu Rawash. The stones from this pyramid were reused by the Romans. The pyramid may have been the highest ever built, about 20 meters taller than the Great Pyramid of Giza, because of its elevated location rather than the size from base to tip. 2566-2558 BC Khafre Greek form: Chephren His pyramid is the second largest in Giza. Some Egyptologists say he was the builder of the Great Sphinx of Giza. 2558-2532 BC -- - Here some sources have Bikheris, following Manetho -- Menkaura Greek form: Mycerinus. His pyramid is the third and smallest in Giza. 2532-2503 BC Shepseskaf Did not build a pyramid and instead had the Mastabat el-Fara'un made for himself 2503-2498 BC Djedefptah - Here some sources put Djedefptah also known as Thampthis, following Manetho -- ===Fifth Dynasty=== The Fifth Dynasty ruled from 2498 to 2345 BC. Name Image Comments Dates Userkaf Buried in a pyramid in Saqqara. Built the first solar temple at Abusir. 2498-2491 BC Sahure Moved the royal necropolis to Abusir, where he built his pyramid. 2490-2477 BC Neferirkare Kakai -- 2477-2467 BC Shepseskare Reigned most likely after Neferefre and for only a few months.Miroslav Verner (2000): Who was Shepseskara, and when did he reign?, in: Miroslav Bárta, Jaromír Krejčí (editors): Abusir and Saqqara in the Year 2000, Academy of Sciences of the Czech Republic, Oriental Institute, Prague, , p. 581-602, available online . 2467-2460 BC Neferefre -- 2460-2458 BC Nyuserre Ini -- 2445-2422 BC Menkauhor Kaiu -- 2422-2414 BC Djedkare Isesi -- 2414-2375 BC Unas His pyramid is inscribed with the earliest known pyramid texts 2375-2345 BC ===Sixth Dynasty=== The Sixth Dynasty ruled from 2345 to 2181 BC. Name Image Comments Dates Teti Was possibly murdered by Userkare 2345-2333 BC Userkare Reigned one to five years, may have murdered Teti to get the throne. 2333-2332 BC Meryre Pepi I -- 2332-2283 BC Merenre Nemtyemsaf I -- 2283-2278 BC Neferkare Pepi II Possibly the longest reigning monarch of human history with 94 years on the throne. Alternatively, it may \"only\" been 64 years. 2278-2184 BC Neferka Only mentioned in the Oxford Encyclopedia of Ancient Egypt. Ruled at the same time as Pepi II; was possibly his son or co-ruler. 2200-2199 BC Merenre Nemtyemsaf IIDodson & Hilton (2004) p.73 Short lived pharaoh, possibly an aged son of Pepi II. 1 year and 1 month c. 2184 BC Neitiqerty Siptah Identical with Netjerkare. This male king gave rise to the legendary queen Nitocris of Herodotus and Manetho.Ryholt & Bardrum (2000) pp.87-100. Sometimes listed as the first king of the combined 7th/8th Dynasties. Short reign: c. 2184 BC - 2181 BC ==First Intermediate Period== The First Intermediate Period (2181–2060 BC) is between the end of the Old Kingdom and the start of the Middle Kingdom. The Old Kingdom rapidly collapsed after the death of Pepi II. He had reigned for 94 years, longer than any monarch in history, and died aged 100. The latter years of his reign were marked by inefficiency because of his advanced age. The Union of the Two Kingdoms fell apart and regional leaders had to cope with the resulting famine. Around 2160 BC, a new line of pharaohs tried to reunite Lower Egypt from their capital in Herakleopolis Magna. Another line of pharaohs at Thebes was reuniting Upper Egypt and a clash between the two rival dynasties was inevitable. Around 2055 BC, Mentuhotep II, the son and successor of pharaoh Intef III defeated the Herakleopolitan pharaohs and reunited the Two Lands. This was the start of the Middle Kingdom. ===Seventh and Eighth Dynasties (combined)=== The Seventh and Eighth Dynasties ruled from c. 2181 to c. 2160 BC. Many of the kings only ruled for a short time from Memphis, with Egypt divided into competing regions. This table is based on the Abydos King List dating to the reign of Seti I,Jürgen von Beckerath: Handbuch der ägyptischen Königsnamen, Münchner ägyptologische Studien, Heft 49, Mainz : P. von Zabern, 1999, , available online and the Turin canon.Kim Ryholt: \"The Late Old Kingdom in the Turin King-list and the Identity of Nitocris\", Zeitschrift für ägyptische, 127, 2000, p. 99 Name Image Comments Dates Menkare Neferkare II Neferkare (III) Neby Known by texts in the tomb of his mother Ankhesenpepi. He started building a pyramid in Saqqara. Djedkare Shemai Neferkare (IV) Khendu Merenhor Some authorities place Merenhor here Neferkamin Nikare Possibly proved by a cylinder-seal. Neferkare (V) Tereru Neferkahor Proved by a cylinder seal. Neferkare (VI) Pepiseneb Neferkamin Anu Qakare Ibi Built a pyramid at Saqqara. with the last known Pyramid Texts 2169–2167 BC Neferkaure His name is found at the temple of Min at Coptos. 2167–2163 BC Neferkauhor Khuwihapi His name is found in the temple of Min and text in the tomb of Shemay. 2163–2161 BC Neferirkare He could be horus Demedjibtawy, where his name is found in the temple of Min. 2161–2160 BC ===Ninth Dynasty=== The Ninth DynastyTurin Kinglist, Columns IV,18 to V,10, Ancient Egypt dot org. Accessed 10 February 2010. ruled from 2160 to 2130 BC. The Turin King List has 18 kings in the Ninth and Tenth Dynasties. Of these, twelve names are missing and four are not complete. Name Image Comments Dates Meryibre Khety I (Acthoes I) Manetho wrote that Achthoes was the first pharoah in this dynasty. 2160-? -- \\- ? Neferkare VII - ? Nebkaure Khety II (Acthoes II) \\- ? Senenh-- or Setut - ? -- \\- ? Mery-- \\- ? Shed-- \\- ? H-- \\- ? ===Tenth Dynasty=== The Tenth Dynasty was a local group that ruled over Lower Egypt from 2130 to 2040 BC. Name Image Comments Dates Meryhathor -- 2130-? Neferkare VIII -- ? Wahkare Khety (Acthoes III) -- ? Merykare -- ?-2040 ===Eleventh Dynasty=== The Eleventh Dynasty was a local group from Upper Egypt that ruled from 2134 to 1991 BC. The 11th dynasty came from a group of Theban nomarchs who served the kings of the 8th, 9th or 10th dynasty. Name Image Comments Dates Intef the Elder Theban nomarch, who served an unnamed king, now said to be first king of the 11th Dynasty. -- The successors of Intef the Elder, starting with Mentuhotep I, eventually conquered Egypt under Mentuhotep II. Name Image Comments Dates Mentuhotep I A Theban nomarch but may have ruled independently. ?-2134 BC Intef I First member of the dynasty to claim a Horus name. 2134-2117 BC Intef II Conquered Abydos and its nome. 2117-2069 BC Intef III Conquered Asyut and possibly moved further north up to the 17th nome.Margaret Bunson: Encyclopedia of Ancient Egypt, Infobase Publishing, 2009, , available online, see p. 181 2069-2060 BC ==Middle Kingdom== The Middle Kingdom (2060–1802 BC) started at the end of the First Intermediate Period to the beginning of the Second Intermediate Period. Some scholars include the Eleventh, Thirteenth and Fourteenth Dynasties in the Middle Kingdom. The Middle Kingdom began to trade outside of the kingdom. This opening of trade led to the downfall of the Middle Kingdom, caused by an invasion from the Hyksos. ===Eleventh Dynasty continued=== The second part of the Eleventh Dynasty is considered to be part of the Middle Kingdom of Egypt. Name Image Comments Dates Mentuhotep IILabib Habachi: King Nebhepetre Menthuhotep: his monuments, place in history, deification and unusual representations in form of gods, in: Annales du Service des Antiquités de l'Égypte 19 (1963), pp. 16–52 Gained all Egypt about 2015 BC, Middle Kingdom begins. 2060-2010 BC Mentuhotep IIIWolfram Grajetzki (2006) pp. 23–25 Commanded the first expedition to Punt of the Middle Kingdom 2010-1998 BC Mentuhotep IVWolfram Grajetzki (2006) pp. 25–26 Little known pharaoh not found on later king lists; tomb unknown. May have been overthrown by his vizier and successor Amenemhat I. 1997-1991 BC === Twelfth Dynasty === The Twelfth Dynasty ruled from 1991 to 1802 BC. It is considered by later Egyptians to have been their greatest dynasty. Name Image Comments Dates Amenemhat I Amenemhat IWolfram Grajetzki (2006) pp. 28–35 Seized power after overthrowing Mentuhotep IV, and was later murdered. 1991-1962 BC Senusret IMurnane (1977) p.2 (Sesostris I) Built the White Chapel 1971-1926 BC Amenemhat IIMurnane (1977) p.7 -- 1929-1895 BC Senusret IIMurnane (1977) p.9 (Sesostris II) -- 1897-1878 BC Senusret IIIJosef Wegner, The Nature and Chronology of the Senwosret III-Amenemhat III Regnal Succession: Some Considerations based on new evidence from the Mortuary Temple of Senwosret III at Abydos, JNES 55, Vol.4, (1996), pp.251 (Sesostris III) Most powerful of the Middle Kingdom pharaohs. 1878-1860 BC Amenemhat IIIWolfram Grajetzki (2006) pp. 56–61 -- 1860-1815 BC Amenemhat IV Had a co-regency lasting at least one year based on a text found at Konosso. 1815-1807 BC SobekneferuGrajetzk (2006) pp.61-63 A rare female ruler. 1807-1802 BC ==Second Intermediate Period== The Second Intermediate Period (1802–1550 BC) was a time of chaos between the end of the Middle Kingdom, and the start of the New Kingdom. During this time, the Hyksos, who later became the Fifteenth Dynasty, arrived in Egypt. The Thirteenth Dynasty was much weaker than the Twelfth Dynasty, and was unable to hold onto the two lands of Egypt. Either at the start of the dynasty, c. 1805 BC or toward the middle of it in c. 1710 BC, the ruling family in Xois, located in the marshes of the eastern Delta, broke away from the central authority to form the Canaanite Fourteenth Dynasty. The Hyksos made their first appearance during the reign of Sobekhotep IV. About 1720 BC they took control of the town of Avaris (the modern Tell el-Dab'a/Khata'na), conquering the kingdom of the 14th dynasty. About 1650 BC the Hyksos, perhaps led by Salitis the founder of the Fifteenth Dynasty, conquered Memphis, which ended the 13th dynasty. When the 13th dynasty collapsed, the 16th dynasty to declared its independence in Thebes. It was soon taken over by the Hyksos kings.. When the Hyksos left Upper Egypt, the Egyptian ruling house in Thebes set itself up as the Seventeenth Dynasty. This dynasty under Seqenenre Tao, Kamose and Ahmose, first pharaoh of the New Kingdom, forced the Hyksos out of Egypt and back into Asia ===Thirteenth Dynasty=== The Thirteenth Dynasty (following the Turin King List) ruled from 1802 to around 1649 BC. Manetho said it lasted for about 154 years. Name Image Comments Dates Sekhemre Khutawy Sobekhotep Started the 13th Dynasty. There is a lot of evidence to prove his reign. He is now known as Sobekhotep I, but as Sobekhotep II in older studies 1802-1800 BC Sonbef Perhaps a brother of Sekhemre Khutawy Sobekhotep and son of Amenemhat IV 1800 BC - 1796 BC Nerikare 1796 BC Sekhemkare Ruled for about four years 1796–1793 BC Ameny Qemau Buried in his pyramid in south Dashur 1795-1792 BC Hotepibre Also called Sehotepibre 1792-1790 BC Iufni Only named on the Turin list. Very short reign, possibly c. 1790 – 1788 BC Amenemhet VI -- 1788–1785 BC Semenkare Nebnuni -- 1785-1783 BC or 1739 BCThomas Schneider: Lexikon der Pharaonen, Albatros, Düsseldorf 2002, Sehetepibre -- 1783-1781 BC Sewadjkare Known only from the Turin list Nedjemibre Known only from the Turin list 7 months, 1780 BC or 1736 BC Khaankhre Sobekhotep Now known as Sobekhotep II, but as Sobekhotep I in older studies Reigned c. 3 years, 1780-1777 BC Renseneb Ruled for four months 1777 BC Awybre Hor I Famous for his intact tomb treasure and Ka statue Reigned 1 year and 6 months, 1777-1775 BC Sekhemrekhutawy Khabaw Possibly a son of Hor Awibre Estimated reign 3 years, 1775-1772 BC Djedkheperew Possibly a son of Hor Awibre and brother of Khabaw, previously identified with Khendjer Estimated reign 2 years, 1772-1770 BC Sebkay Possibly two kings, Seb and his son Kay. Sedjefakare A well known king listed on numerous stelas and other documents. 5 to 7 years or 3 years, 1769-1766 BC Wegaf Founder of the dynasty in old studies c. 1767 BC Khendjer Possibly the first semitic pharaoh, built a pyramid at Saqqara Minimum 4 years and 3 months c. 1765 BC Imyremeshaw Known by two colossal statues Reigned less than 10 years, starting 1759 BC or 1711 BC.Thomas Schneider: Lexikon der Pharaonen, Albatros, 2002 Sehetepkare Intef IV -- ? Seth Meribre -- ? Sobekhotep III Ruled for four years and two months c. 1755-1751 BC Neferhotep I Ruled for 11 years 1751-1740 BC Sihathor Perhaps a ruled with with his brother Neferhotep I 1739 BC Sobekhotep IV Ruled for 10 or 11 years 1740-1730 BC Merhotepre Sobekhotep V -- c. 1730 BC Khahotepre Sobekhotep VI Ruled for 4 years 8 months and 29 days c. 1725 BC Wahibre Ibiau Ruled for 10 years and 8 months 1725-1714 BC or 1712-1701 BC Merneferre Ay I Longest reigning king of the dynasty 23 years, 8 months and 18 days, 1701-1677 BC or 1714-1691 BC Merhotepre Ini Possibly a son of his predecessor 2 Years 3 or 4 Months and 9 days, 1677-1675 BC or 1691-1689 BC Sankhenre Sewadjtu Only known from the Turinlist 3 years and 2–4 months, 1675-1672 BC Mersekhemre Ined May be the same person as Neferhotep II 3 years, 1672-1669 BC Sewadjkare Hori Ruled for five years ? Merkawre Sobekhotep VII Ruled for 2 years and 6 months K.S.B. Ryholt, The Political Situation in Egypt during the Second Intermediate Period, c.1800-1550 BC, Carsten Niebuhr Institute Publications, vol. 20. Copenhagen: Museum Tusculanum Press, 1997 1664-1663 BC Seven kings Names lost in a lacuna of the Turin canon 1663 BC -? Mer[...]re -- ? Merkheperre -- Some time between 1663 BC and 1649 BC Merkare -- Some time between 1663 BC and 1649 BC Name lost -- ? Sewadjare Mentuhotep V -- c. 1655 BC [...]mosre -- ? Ibi [...]maatre -- ? Hor[...] [...]webenre -- ? Se...kare ? ? Seheqenre Sankhptahi May be the son of his predecessor ? ...re ? ? Se...enre ? ?–1649 BC The position of the following kings is uncertain: Name Image Comments Dates Dedumose I Possibly a king of the 16th dynasty c. 1654 Dedumose II Possibly a king of the 16th dynasty ? Sewahenre Senebmiu Late 13th dynasty. After 1660 BC. Snaaib Possibly a king of the Abydos Dynasty ? ===Fourteenth Dynasty=== The Fourteenth Dynasty was a local group from the eastern Delta, based at Avaris. They ruled from either from 1805 BC or c. 1710 BC until around 1650 BC. The dynasty had many rulers with West Semitic names and is believed to have been Canaanite in origin. Name Image Comments Dates Yakbim Sekhaenre Dates uncertain 1805–1780 BC Ya'ammu Nubwoserre Dates uncertain 1780–1770 BC Qareh Khawoserre Dates uncertain 1770–1760 BC 'Ammu Ahotepre Dates uncertain 1760–1745 BC Sheshi Dates uncertainK.S.B. Ryholt: The Political Situation in Egypt during the Second Intermediate Period, c.1800-1550 BC, Carsten Niebuhr Institute Publications, vol. 20. Copenhagen: Museum Tusculanum Press, 1997 1745–1705 BC Nehesy Short reign, perhaps a son of Sheshi c. 1705 Khakherewre - ? Nebefawre - c. 1704 Sehebre Maybe Wazad or Sheneh \\- Merdjefare Maybe Wazad or Sheneh c. 1699 Sewadjkare III - ? Nebdjefare - c. 1694 Webenre - ? -- \\- ? Djefare? - ? Webenre c. 1690 Sekheperenre Name known from a single scarab seal Ruled for two months, some time between 1690 BC and 1649 BC Anati Djedkare Only known from the Turin list Bebnum Only known from the Turin list 'Apepi Listed as a king's son on five scarabs-seals The position and identity of the following pharaohs is uncertain: Name Image Comments Dates Nuya Name known from a scarab-seal Wazad May be identifiable with Sehebre or Merdjefare c. 1700 BC ? Sheneh Maybe Sehebre or Merdjefare Shenshek Name known from a scarab-seal Khamure Yakareb Yaqub-Har May belong to the 14th dynasty, the 15th dynasty or be a vassal of the Hyksos. 17th–16th centuries BCE The Turin King List has extra names, but no other evidence has been found. ===Fifteenth Dynasty=== The Fifteenth Dynasty was started by the Hyksos people who emerged from the Fertile Crescent. They ruled over much of the Nile region, from 1674 to 1535 BC. Name Image Comments Dates Semqen Chronological position uncertain. 1649 BC - ? Aperanat Chronological position uncertain. Sakir-Har - ? Khyan Conquered Thebes toward the end of his reign 30–40 years Apepi \\- Ruled for 40 years or more Khamudi \\- 1555–1544 ===Abydos Dynasty=== The Second Intermediate Period may include an independent dynasty reigning over Abydos from c. 1650 BC until 1600 BC.Detlef Franke: Zur Chronologie des Mittleren Reiches. Teil II: Die sogenannte Zweite Zwischenzeit Altägyptens, In Orientalia 57 (1988), p. 259 There are four known kings in the Abydos Dynasty, the order in which they ruled is unknown: Name Image Comments Dates Wepwawetemsaf May belong to the late 16th DynastyMarcel Marée: A sculpture workshop at Abydos from the late Sixteenth or early Seventeenth Dynasty, in: Marcel Marée (editor): The Second Intermediate period (Thirteenth-Seventeenth Dynasties), Current Research, Future Prospects, Leuven, Paris, Walpole, MA. 2010 . p. 247, 268 Pantjeny May belong to the late 16th Dynasty Snaaib May belong to the late 13th Dynasty.Jürgen von Beckerath: Untersuchungen zur politischen Geschichte der Zweiten Zwischenzeit in Ägypten, Glückstadt, 1964Jürgen von Beckerath: Handbuch der ägyptischen Königsnamen, Münchner ägyptologische Studien 49, Mainz 1999. Senebkay Tomb discovered in 2014. He maybe Woser[...]re of the Turin list. ===Sixteenth Dynasty=== The Sixteenth Dynasty was a native Theban dynasty. It began during the collapse of the Memphis-based 13th dynasty c. 1650 BC and finally conquered by the Hyksos 15th dynasty c. 1580 BC. The 16th dynasty only ruled over Upper-Egypt. Name Image Comments Dates -- Name of the first king is lost here in the Turin King List, and cannot be recovered Djehuti - 3 years Sobekhotep VIII - 16 years Neferhotep III - 1 year Mentuhotepi May be a king of the 17th Dynasty Ruled for one year Nebiryraw I Sewadjenre - Ruled for 26 years Nebiriau II - Semenre - Bebiankh - Ruled for 12 years Dedumose I May be a king of the 13th Dynasty Dedumose II - Montuemsaf - Merankhre Mentuhotep VI - Senusret IV - Sekhemre Shedwast - The 16th Dynasty may have included the pharaohs Sneferankhre Pepi IIIWolfgang Helck, Eberhard Otto, Wolfhart Westendorf, Stele - Zypresse: Volume 6 of Lexikon der Ägyptologie, Otto Harrassowitz Verlag, 1986, Page 1383 and Nebmaatre. Their chronological position is uncertain.Jürgen von Beckerath: Chronologie des pharaonischen Ägyptens, Münchner Ägyptologische Studien 46. Mainz am Rhein, 1997 ===Seventeenth Dynasty=== The Seventeenth Dynasty was based in Upper Egypt and ruled from 1650 to 1550 BC: Name Image Comments Dates Rahotep \\- c. 1620 BC Sobekemsaf I Ruled at least seven years - Sobekemsaf II His tomb was robbed and burned during the rule of Ramesses IX - Sekhemre-Wepmaat Intef V \\- - Nubkheperre Intef VI Ruled more than three years - Sekhemre-Heruhirmaat Intef VII \\- - Senakhtenre Ahmose - Name found on a gateway at Karnak in 2012. c. 1558 BC Seqenenre Tao Died in battle against the Hyksos. 1558–1554 BC Kamose 1554–1549 BC The early 17th Dynasty may also have included Nebmaatre, whose dates are uncertain. ==New Kingdom== The New Kingdom (1550–1077 BC) includes the Eighteenth, Nineteenth, and Twentieth dynasty of Egypt, from the 16th to the 11th century BC. It is between the Second Intermediate Period and the Third Intermediate Period. During the New Kingdom, Egypt's armies were able to capture nearby countries. Egypt controlled Nubia in the south, and held territories in the Near East. Egyptian armies fought with Hittite armies for control of modern-day Syria. During the New Kingdom, Egypt controlled more territory than at any other time in its history. Two of the best known pharaohs of the New Kingdom are Akhenaten and Ramesses II. Akhenaten, also known as Amenhotep IV, worshipped the god Aten. This is seen as the first monotheistic religion. Ramesses II was a powerful military ruler. He tried to recapture the territories in what is now modern Israel/Palestine, Lebanon and Syria that had been held in the Eighteenth Dynasty. At the Battle of Qadesh he led the Egyptian armies in battle against the Hittite king Muwatalli II. === Eighteenth Dynasty === The Eighteenth Dynasty ruled from c. 1550 to 1292 BC: Name Image Comments Dates Ahmose I, Ahmosis I Brother and successor to Kamose, conquered north of Egypt from the Hyksos. c. 1550–1525 BCE; Radiocarbon dating gives the start of his reign is 1570–1544 BCE.Christopher Bronk Ramsey et al., Radiocarbon-Based Chronology for Dynastic Egypt, Science 18 June 2010: Vol. 328. no. 5985, pp. 1554-1557. Amenhotep I \\- 1541–1520 Thutmose I \\- 1520–1492 Thutmose II \\- 1492–1479 Hatshepsut The second known female ruler. There may have been five other female rulers, but the evidence is uncertain. Recent evidence suggests Hatshepsut died of bone cancer.Tooth clinches identification of Egyptian queen 1479–1458 Thutmose III Often called the \"Napoleon of Egypt.\" In his early years, he was controlled by his stepmother, Hatshepsut. After she died, he began expanding Egyptian rule into the Levant. 1479–1425 Amenhotep II \\- 1425–1400 Thutmose IV \\- 1400–1390 Amenhotep III The Magnificent King Ruled Egypt at the peak of its power. He had more monuments and statues built than any other pharaoh. His mortuary temple, the largest ever built, was destroyed by Rameses II. Recent DNA testing proved he was the grandfather of Tutankhamun. 1390–1352 Akhenaten or Amenhotep IV Started a sun based religion called Atenism. His original name means \"Amun is pleased.\" 1352–1334 Smenkhkare Co-regent and successor of Akhenaten. The identity and sex of this individual is uncertain. Smenkhkare may be a son or son-in-law of Akhenaten, or wife of Akhenaten, Nefertiti. Some historians believe there were two rulers between Akhenaten and Tutankhamun. One is Smenkhkare, who is then seen as male, and a female ruler, Akhenaten's eldest daughter Meritaten 1334–1333 Tutankhamun Commonly believed to be the son of Akhenaten. He probably brought back the old religion, and his name shows the change from Aten to Amun. He is also known as the boy king. 1333–1324 Ay Close advisor to two and perhaps three of the pharaohs who ruled before him. He is said to be the power behind the throne during Tutankhamun's reign. 1324–1320 Horemheb Former General and advisor to Tutankhamun. Destroyed images of the Amarna queens and kings (all except Amenhotep III and Tiye). 1320–1292 === Nineteenth Dynasty === The Nineteenth Dynasty ruled from 1292 to 1186 BC and includes one of the greatest pharaohs, Rameses II the Great: Name Image Comments Dates Ramesses I \\- 1292–1290 Seti I \\- 1290–1279 Ramesses II the Great The pharoah associated with Moses; he reached a stalemate with the Hittites at the Battle of Kadesh in 1275 BC, after which a peace treaty was signed in 1258 BC 1279–1213 Merneptah A stele describing campaigns in Libya and Canaan is the only reference to \"Israel\" in Ancient Egyptian records. 1213–1203 Amenemses \\- 1203–1200 Seti II \\- 1203–1197 Siptah \\- 1197–1191 Tausret A female ruler also known as Tawosret. She was probably the wife of Seti II. 1191–1190 === Twentieth Dynasty === The Twentieth Dynasty ruled from 1190 to 1077 BC: Name Image Comments Dates Setnakhte \\- 1190–1186 Ramesses III Fought the Sea Peoples in 1175 BC. Killed in a harem plot. 1186–1155 Ramesses IV \\- 1155–1149 Ramesses V \\- 1149–1145 Ramesses VI \\- 1145–1137 Ramesses VII \\- 1137–1130 Ramesses VIII \\- 1130–1129 Ramesses IX \\- 1129–1111 Ramesses XGrimal (1992) p.291 \\- 1111–1107 Ramesses XI Ended rule sharing power with High Priest of Amun Herihor ruling in the south and Smendes I ruling in the north, a period known as wehem mesut. 1107–1077 ==Third Intermediate Period== The Third Intermediate Period (1077–732 BC) marked the end of the New Kingdom. After the collapse of the Egyptian empire, some dynasties of Libyan origin ruled Egypt. This is also known as the Libyan Period. ===Twenty-First Dynasty=== The Twenty-First Dynasty was based at Tanis and was a relatively weak group. They were rulers of all Egypt, but in practice their influence was limited to Lower Egypt. They ruled from 1069 to 943 BC Name Image Comments Dates Nesbanebdjed ICerny p.645 Also known as Smendes I 1077–1051 Amenemnisu \\- 1051–1047 Psusennes I Also known as the Silver Pharaoh 1047–1001 Amenemope \\- 1001–992 Osorkon the Elder \\- * (Osochor ) 992–986 Siamun \\- 986–967 Psusennes II \\- 967–943 ===Twenty- Second Dynasty=== The pharaohs of the Twenty-Second Dynasty were Libyans, ruling from around 943 to 728 BC: Name Image Comments Dates Shoshenq I 943–922 Osorkon I \\- 922–887 Shoshenq II \\- 887–885 Takelot I \\- 885–872 Harsiese A A rebel ruler, based at Thebes 880–860 Osorkon II \\- 872–837 Shoshenq III \\- 837–798 Shoshenq IV - 798–785 Pami \\- 785–778 Shoshenq V \\- 778–740 Osorkon IV \\- 740–720 ===Twenty-Third Dynasty=== The Twenty-Third Dynasty was another Libyan group, based at Herakleopolis and Thebes. They ruled from 837 to c. 735 BC: Name Image Comments Dates Takelot II He was once seen as a 22nd Dynasty pharaoh, he is now known to be the founder of the 23rd 837–813 Pedubast I He was a rebel and seized Thebes from Takelot II 826–801 Iuput I Co-regent with Pedubast 812–811 Shoshenq VI Successor to Pedubast 801–795 Osorkon III Son of Takelot II; recovered Thebes, then made himself king 795–767 Takelot III Ruled with his father Osorkon III for the first five years. 773–765 Rudamun Younger son of Osorkon III and brother of Takelot III. 765–762 Rudamun was succeeded in Thebes by a local ruler: Name Image Comments Dates Ini Ruled Thebes only 762-? ===The Libu=== Not really a dynasty, the Libu were another group of western nomads from Libya who controlled the western Delta from 805 to 732 BC. Name Image Comments Dates Inamunnifnebu 805–795 ? - 795–780 Niumateped - 780–755 Titaru - 763–755 Ker - 755–750 Rudamon - 750–745 Ankhor - 745–736 Tefnakht - 736–732 === Twenty-Fourth Dynasty === The Twenty-fourth Dynasty was a short-lived rival dynasty in the western Delta (Sais). There were only two Pharaohs, ruling from 732 to 720 BC. Name Image Comments Dates Tefnakhte \\- 732–725 Bakenrenef \\- 725–720 == Late period == The Late Period runs from 732 BC to Egypt becoming a province of Rome in 30 BC, and includes periods of rule by Nubians, Persians, and Macedonians. === Twenty-fifth Dynasty === Nubians invaded Lower Egypt and took the throne of Egypt under Piye although they already controlled Thebes and Upper Egypt in the early years of Piye's reign. Piye's conquest of Lower Egypt established the Twenty-fifth Dynasty which ruled until 656 BC. Name Image Comments Dates Piye King of Nubia; conquered Egypt in 20th year; ruled for 24 years, or possibly 30+ years 752–721 according to Dan'el Kahn Shabaka \\- 721–707/706 according to Rolf Krauss/David WarburtonR. Krauss and D.A. Warburton, \"Chronological Table for the Dynastic Period\" in Erik Hornung, Rolf Krauss & David Warburton (editors), Ancient Egyptian Chronology (Handbook of Oriental Studies), Brill, 2006. p.494 Shebitku \\- 707/706–690 according to Dan'el KahnDan'el Kahn, \"The Inscription of Sargon II at Tang-i Var and the Chronology of Dynasty 25,\" Orientalia 70 (2001), pp.1-18 Taharqa \\- 690–664 Tantamani lost control of Upper Egypt in 656 BC when Psamtik I took over Thebes in that year. 664–653 They were forced from Egypt back into Nubia, where they set up a kingdom at Napata (656–590), and, later, at Meroë (590 BC – 4th century AD). === Twenty-sixth Dynasty === The Twenty-sixth Dynasty ruled from around 672 to 525 BC. Name Image Comments Dates Necho I Was killed by an invading Kushite force in 664 BC under Tantamani. Father of Psamtik I. 672 - 664 BC Psamtik I Reunified Egypt. Son of Necho I and father of Necho II. 664 - 610 BC Necho II Most likely the pharaoh mentioned in several books of the Bible. Son of Psamtik I and father of Psamtik II. 610 - 595 BC Psamtik II Son of Necho II and father of Apries. 595 - 589 BC Wahibre (Apries) Fled Egypt after Amasis II (who was a general at the time) declared himself pharaoh following a civil war. Son of Psamtik II. 589 - 570 BC Ahmose II He was the last great ruler of Egypt before the Persian conquest. Greek historian Herodotus said he was of common origins. Father of Psamtik III. 570 - 526 BC Psamtik III Son of Ahmose II. Ruled for about six months before being defeated by the Persians in the Battle of Pelusium and executed. 526 - 525 BC === Twenty-seventh Dynasty === Egypt was conquered by the Persian Empire in 525 BC and ruled by the Persians until 404 BC. The Achaemenid shahs were the pharaohs in this era, forming a \"Twenty-seventh\" Dynasty: Name Image Comments Dates Cambyses II Defeated Psamtik III at the Battle of Pelusium at 525 BC 525 - 521 BC Petubastis III A native Egyptian rebel in the Delta 522/21 - 520 BC Smerdis (Bardiya) Son of Cyrus the Great 522 - 521 BC Darius I \\- 521 - 486 BC Xerxes I \\- 486 - 465 BC Artabanus the Hyrcanian - 465 - 464 BC Artaxerxes I Longhand \\- 464 - 424 BC Xerxes II claimant 424 - 423 BC Sogdianus claimant 424 - 423 BC Darius II 424 - 404 BC ===Twenty-eighth Dynasty=== The Twenty-eighth Dynasty lasted only six years, from 404 to 398 BC, with one Pharaoh: Name Image Comments Dates Amyrtaeus Descendant of the Saite pharaohs of the Twenty-sixth Dynasty; led a successful revolt against the Persians. 404 - 398 BC ===Twenty-ninth Dynasty=== The Twenty-ninth Dynasty ruled from 398 to 380 BC: Name Image Comments Dates Nefaarud I Also known as Nepherites. Defeated Amyrtaeus in open battle and had him executed. 398 - 393 BC Psammuthes \\- 393 BC Hakor Overthrew his predecessor Psammuthes. Father of Nefaarud II. 393 - 380 BC Nefaarud II Was deposed and likely killed by Nectanebo I after ruling for only four months. Son of Hakor. 380 BC ===Thirtieth Dynasty=== The Thirtieth Dynasty ruled from 380 until Egypt once more came under Persian rule in 343 BC: Name Image Comments Dates Nectanebo I Also known as Nekhtnebef. Deposed and likely killed Nefaarud II, starting the last dynasty of native Egyptians. Father of Teos of Egypt. 380 - 362 BC Teos of Egypt Ruled with his father Nectanebo I from about 365 BC. Was overthrown by Nectanebo II with the help of Agesilaus II of Sparta. 362 - 360 BC Senedjemibre Nakhthorhebyt (Nectanebo II) Last native ruler of ancient Egypt 360 - 343 BC ===Thirty-first Dynasty=== Egypt again came under the control of the Achaemenid Persians. The Persian rulers from 343 to 332 BC are sometimes listed as the Thirty-first Dynasty: Name Image Comments Dates Artaxerxes III Egypt came under Persian rule for the second time 343-338 BC Artaxerxes IV Arses Only reigned in Lower Egypt 338-336 BC Khababash Rebel pharaoh who led an invasion in Nubia 338-335 BC Darius III Upper Egypt returned to Persian control in 335 BC 336-332 BC ===Argead Dynasty=== The Macedonians under Alexander the Great brought in the Hellenistic period with his capture of Persia and Egypt. The Argeads ruled from 332 to 309 BC: Name Image Comments Dates Alexander the Great Macedon took over Persia and Egypt 332-323 BC Philip III of Macedon Feeble-minded half-brother of Alexander III the Great 323-317 BC Alexander IV of Macedon Son of Alexander the Great and Roxana 317-309 BC ===Ptolemaic Dynasty=== The second Hellenistic dynasty, the Ptolemies, ruled Egypt from 305 BC until Egypt became a province of Rome in 30 BC. If two dates overlap, that means there was a co-regency. The most famous member of this dynasty was Cleopatra VII. In modern times she is known simply as Cleopatra. She was the consort of Julius Caesar and after Caesar's death, of Mark Antony, and had children with both of them. Cleopatra tried to create a dynastic and political union between Egypt and Rome. This failed with the assassination of Caesar and the defeat of Mark Antony. Caesarion (Ptolemy XV Philopator Philometor Caesar) was the last king of the Ptolemaic dynasty of Egypt. He reigned jointly with his mother Cleopatra VII of Egypt, from September 2, 47 BC. He was the eldest son of Cleopatra VII, and possibly the only son of Julius Caesar, after whom he was named. Between Cleopatra's death on August 12, 30 BC, up to his own death on August 23, 30 BC, he was the sole pharaoh. It is tradition that he was hunted down and killed on the orders of Octavian, who would become the Roman emperor Augustus, but there is no evidence. Name Image Comments Dates Ptolemy I of Egypt Abdicated in 285 BC; died in 283 BC 305-285 BC Berenice I of Egypt Wife of Ptolemy I ?–285 BC Ptolemy II of Egypt - 288-246 BC Arsinoe I of Egypt Wife of Ptolemy II 284/281-c. 274 BC Arsinoe II of Egypt Wife of Ptolemy II 277–270 BC Ptolemy III of Egypt - 246-222 BC Berenice II of Egypt Wife of Ptolemy III 244/243–222 BC Ptolemy IV of Egypt - 222-204 BC Arsinoe III of Egypt Wife of Ptolemy IV 220–204 BC Hugronaphor Revolutionary Pharaoh in the South 205–199 BC Ankhmakis Revolutionary Pharaoh in the South 199–185 BC Ptolemy V of Egypt Upper Egypt in revolt 207-186 BC 204-180 BC Cleopatra I of Egypt Wife of Ptolemy V, ruled with Ptolemy VI until he was old enough to rule by himself 193–176 BC Ptolemy VI of Egypt Died 145 BC 180-164 BC Cleopatra II of Egypt Wife of Ptolemy VI 175–164 BC Ptolemy VIII of Egypt Proclaimed king by Alexandrians in 170 BC; ruled jointly with Ptolemy VI of Egypt and Cleopatra II from 169 to 164 BC. Died 116 BC 171-163 BC Ptolemy VI of Egypt Egypt under the control of Ptolemy VIII 164 BC-163 BC; Ptolemy VI restored 163 BC 163–145 BC Cleopatra II of Egypt Married Ptolemy VIII; led revolt against him in 131 BC and became sole ruler of Egypt. 163–127 BC Ptolemy VII Proclaimed co-ruler by father; later ruled under regency of his mother Cleopatra II 145–144 BC Ptolemy VIII of Egypt Restored 145–131 BC Cleopatra III of Egypt Second wife of Ptolemy VIII 142–131 BC Ptolemy Memphitis Proclaimed King by Cleopatra II; soon killed by Ptolemy VIII 131 BC Ptolemy VIII of Egypt Restored 127–116 BC Cleopatra III of Egypt Restored with Ptolemy VIII; later co-regent with Ptolemy IX and X. 127–107 BC Cleopatra II of Egypt Reconciled with Ptolemy VIII; co-ruled with Cleopatra III and Ptolemy until 116. 124–116 BC Ptolemy IX of Egypt Died 80 BC 116-110 BC Cleopatra IV of Egypt Shortly married to Ptolemy IX, but was pushed out by Cleopatra III 116–115 BC Ptolemy X of Egypt Died 88 BC 110-109 BC Berenice III of Egypt Forced to marry Ptolemy XI; murdered on his orders 19 days later 81–80 BC Ptolemy XI of Egypt Alexander II Young son of Ptolemy X Alexander; installed by Sulla; ruled for 80 days before being lynched by citizens for killing Berenice III 80 BC Ptolemy XII Son of Ptolemy IX; died 51 BC 80- 58 BC Cleopatra V of Egypt Wife of Ptolemy XII, mother of Berenice IV 79–68 BC Cleopatra VI of Egypt Daughter of Ptolemy XII 58–57 BC Berenice IV of Egypt Daughter of Ptolemy XII; forced to marry Seleucus Kybiosaktes, but has him strangled. Joint rule with Cleopatra VI until 57 BC. 58–55 BC Ptolemy XII of Egypt Restored; reigned briefly with his daughter Cleopatra VII before his death 55–51 BC Cleopatra VII Jointly with her father Ptolemy XII, her brother Ptolemy XIII, her brother-husband Ptolemy XIV, and her son Ptolemy XV; also known simply as Cleopatra 51–30 BC Ptolemy XIII of Egypt Brother of Cleopatra VII 51–47 BC Arsinoe IV of Egypt In opposition to Cleopatra VII 48–47 BC Ptolemy XIV of Egypt Younger brother of Cleopatra VII and Ptolemy XIII 47–44 BC Ptolemy XV of Egypt Infant son of Cleopatra VII; aged 3 when proclaimed co- ruler with Cleopatra. Last known ruler of ancient Egypt when Rome took over. 44–30 BC ==Rome== Cleopatra VII had affairs with the Roman Dictator Julius Caesar and Roman General Marc Antony. She killed herself when Antony was defeated by Octavian (later be Emperor Augustus). Egypt then became a province of Rome in 30 BC. Roman Emperors were given the title of Pharaoh, although exclusively while in Egypt. One Egyptian king-list lists the Roman Emperors as Pharaohs up to and including Decius. See the list of Roman Emperors. ==Notes== ==References== * J. H. Breasted, History of Egypt from the Earliest Time to the Persian Conquest, 1909 * J. Cerny, 'Egypt from the Death of Ramesses III to the End of the Twenty-First Dynasty' in The Middle East and the Aegean Region c.1380-1000 BC, Cambridge University Press, * * Dodson, Aidan and Hilton, Dyan. The Complete Royal Families of Ancient Egypt. Thames & Hudson. 2004. * Sir Alan Gardiner Egyptian Grammar: Being an Introduction to the Study of Hieroglyphs, Third Edition, Revised. London: Oxford University Press, 1964. Excursus A, pp. 71–76. * Nicolas Grimal, A History of Ancient Egypt, (Blackwell Books: 1992) * Murnane, William J. Ancient Egyptian Coregencies, Studies in Ancient Oriental Civilization. No. 40. The Oriental Institute of the University of Chicago, 1977 * Michael Rice, Who's Who in Ancient Egypt, Routledge 1999 * Ryholt, Kim & Steven Bardrum. 2000. \"The Late Old Kingdom in the Turin King-list and the Identity of Nitocris.\" Zeitschrift für ägyptische Sprache und Altertumskunde 127 * Shaw, Ian. The Oxford History of Ancient Egypt., Oxford University Press, 2000. * Shaw, Garry. The Pharaoh, Life at Court and on Campaign, Thames and Hudson, 2012. * Toby A. H. Wilkinson, Early Dynastic Egypt, Routledge 1999, * Verner, Miroslav, The Pyramids - Their Archaeology and History, Atlantic Books, 2001, * Egypt, History & Civilisation By Dr. R Ventura. Published by Osiris, PO Box 107 Cairo. ==Other websites== * Egyptian chronology site * Egyptian Royal Genealogy * Manetho and the King Lists Review of different primary king lists * Chronology Table - 0 Dynasty&History; Period, by Dariusz Sitek Multi-pages of list of pharaohs in different king lists, without the god kings, in Egyptian hieroglyphs and English * Egyptian Journey 2003: History: King Lists Hyperlink texts of the Manetho, Abydos & Turin king lists, without the god-kings * Digital Egypt for Universities * List of all female Pharaohs Pharaohs *",
 "title": "List of pharaohs"
}