{
 "id": "482981",
 "text": "The following is a list of notable deaths in March 2015. For notable deaths before the current month, please see \"Previous months\". * Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==March 2015== * March 1 - Minnie Miñoso, 92, Cuban baseball player (Chicago White Sox, Cleveland Indians), complications from COPD. * March 1 - Joshua Fishman, 88, American linguist.Joshua Fishman (1926-2015) * March 1 - Carel Visser, 86, Dutch sculptor.Carel Visser: Sculptor hailed as a master of minimalism who turned metal and concrete into elegant and powerful forms * March 2 - Dean Hess, 97, American minister and air force colonel.Dean E. HESS * March 2 - Francisco González Ledesma, 87, Spanish novelist, comics writer and journalist, complications of a stroke.Muere Francisco González Ledesma, gran exponente de la novela policíaca española * March 2 - Dave Mackay, 80, Scottish football player and coach. Dave Mackay of Scotland, Hearts, Tottenham and Derby, dies aged 80 * March 3 - M. Stanton Evans, 80, American journalist, author and educator, pancreatic cancer.M. Stanton Evans, Pioneer of Conservative Movement, Dies at 80 * March 3 - Lynn Borden, 77, American actress (Bob & Carol & Ted & Alice, Dirty Mary, Crazy Larry, Hazel).Lynn Borden Obituary * March 3 - Ernest Braun, 89, Austrian-born British academic and author. * March 4 - Ninan Koshy, 81, Indian academic. * March 5 - Vlada Divljan, 56, Serbian musician (Idoli).Preminuo Vlada Divljan * March 5 - Edward Egan, 82, American Roman Catholic prelate, Cardinal, Bishop of Bridgeport (1988–2000), Archbishop of New York (2000–2009), cardiac arrest.Death of Edward Cardinal Egan * March 5 - Jim McCann, 70, Irish musician (The Dubliners), throat cancer.The Dubliners' singer Jim McCann has passed away at age of 70 * March 6 - Fred Craddock, 86, American Christian minister, Parkinson's disease. * March 6 - Ram Sundar Das, 94, Indian politician, Chief Minister of Bihar (1979–1980).Former Bihar Chief Minister Ram Sundar Das Dies * March 6 - Vasilios Magginas, 66, Greek politician, Minister of Employment (2007).Former ND minister Vasilis Magginas passes away, aged 66 * March 7 - Edmond Malinvaud, 91, French economist.L'économiste Edmond Malinvaud est décédé * March 7 - F. Ray Keyser, Jr., 87, American politician, Governor of Vermont (1961–1963). * March 8 - Sam Simon, 59, American writer and producer (The Simpsons, The Drew Carey Show), colorectal cancer.Sam Simon, Co-Creator of ‘The Simpsons,’ Dies at 59 * March 8 - Gerardo Sofovich, 77, Argentine actor, director and television presenter, heart failure. * March 8 - Lew Soloff, 71, American jazz trumpeter (Blood, Sweat & Tears), heart attack.Passings Lew Soloff, Jazz & Blood, Sweat & Tears Trumpeter (1944 - 2015) * March 8 - Inezita Barroso, 90, Brazilian folk singer.Morre em SP, aos 90 anos, a dama da música caipira, Inezita Barroso (in Portuguese) * March 9 - Notable French people killed in the Villa Castelli helicopter crash:Three French sports personalities die in Argentina helicopter crash ** Florence Arthaud, 57, sailor. ** Camille Muffat, 25, swimmer, Olympic champion (2012). ** Alexis Vastine, 28, boxer, Olympic bronze medalist (2008). * March 9 - James Molyneaux, Baron Molyneaux of Killead, 94, Northern Irish politician, UK MP for South Antrim (1970–1983) and Lagan Valley (1983–1997), member of the House of Lords (since 1997), leader of Ulster Unionist Party (1979–1995).James Molyneaux: Former UUP leader dies age 94 * March 9 - David B. Frohnmayer, 74, American attorney, Oregon Attorney General (1981–1991), President of the University of Oregon (1994–2009), prostate cancer.Dave Frohnmayer, former UO president and Oregon attorney general, dies at 74 * March 9 - Juanita Morrow Nelson, 91, American civil rights activist.Pioneering activist for peace, civil rights and local farming Juanita Nelson dies at 91. * March 9 - Windell Middlebrooks, 36, American actor (Body of Proof, The Bernie Mac Show, The Suite Life on Deck), pulmonary embolism.Windell Middlebrooks Dies: ‘Body Of Proof’, Miller Beer Ads Actor Was 36 * March 9 - Frei Otto, 89, German architect and structural engineer.Star architect dies day after winning top prize * March 9 - Jack Harte, 94, Irish politician, Senator (1973–1992).Former Labour Senator Jack Harte dies * March 10 - Stuart Wagstaff, 90, British-Australian entertainer, complications from pulmonary fibrosis.Entertainer Stuart Wagstaff dies aged 90 * March 10 - Claude Sitton, 89, American Pulitzer Prize-winning newspaper reporter, congestive heart failure.Claude Sitton, Times Reporter Lauded for Civil Rights Coverage, Dies at 89 * March 11 - Martin H:son Holmdahl, 91, Swedish academic.Former Vice- Chancellor Martin H:son Holmdahl has passed away * March 11 - Jimmy Greenspoon, 67, American keyboard player and composer (Three Dog Night), skin cancer.Jimmy Greenspoon of Three Dog Night died from cancer at 67 * March 11 - Walter Burkert, 84, German academic and author (Homo Necans).Zum Tod des Altphilologen Walter Burkert * March 12 - Ada Jafri, 90, Pakistani Urdu poet.'Honto pay kbhi un k mery naam hi aeay’ fame poetess Ada Jafri passes away * March 12 - Sir Terry Pratchett, 66, British author (Discworld series), chest infection.Fantasy author Pratchett dies aged 66 * March 12 - Erol Büyükburç, 79, Turkish composer and singer.Turkish pop star found dead * March 12 - Michael Graves, 80, American architect.Architect Michael Graves Dies * March 12 - Magda Guzmán, 83, Mexican actress (Amor Bravío), heart attack.Magda Guzmán Dies: Mexican Actress Dead At 83 Following Heart Attack * March 13 - Daevid Allen, 77, Australian musician (Soft Machine, Gong), neck cancer.Gong founder Daevid Allen has died, aged 77 * March 13 - Irwin Hasen, 96, American cartoonist (Dondi).DC Comic artist Irwin Hasen, creator of Dondi and the Wildcat, is dead at 96 * March 13 - Al Rosen, 91, American baseball player (Cleveland Indians). * March 14 - Ana María Giunta, 72, Argentine actress, respiratory failure.Murió Ana María Giunta * March 14 - Valentin Rasputin, 77, Russian writer.Умер писатель Валентин Распутин * March 15 - Narayan Desai, 90, Indian Gandhian and writer.Narayan Desai passes away * March 15 - Sally Forrest, 86, American singer and actress (Rawhide), cancer.Sally Forrest, Ida Lupino Protégée, Dies at 86 * March 15 - Mike Porcaro, 59, American bass guitarist (Toto), complications from ALS.Death notice * March 15 - Xu Caihou, 71, Chinese general, bladder cancer.Ex-top China military official, facing bribery probe, dies * March 15 - Curtis Gans, 77, American activist and writer, lung cancer. * March 16 - Bruce Crump, 57, American rock drummer (Molly Hatchet), throat cancer.Molly Hatchet's Bruce Crump dies * March 16 - Jack Haley, 51, American basketball player (Chicago Bulls), heart disease. * March 16 - Miguel Donoso Pareja, 83, Ecuadorian writer, Parkinson's disease.Fallece el escritor ecuatoriano Miguel Donoso Pareja * March 16 - Andy Fraser, 62, British bass guitarist (John Mayall & the Bluesbreakers, Free).Free bassist Andy Fraser dead at 62 * March 16 - Buddy Elias, 89, Swiss actor (Sunshine, The Monuments Men).Anne Frank's cousin Buddy Elias dies at 89 * March 16 - Arthur A. Hartman, 89, American diplomat, Ambassador to France (1977–1981) and the Soviet Union (1981–1987), complications from surgery.Arthur A. Hartman, U.S. Ambassador to Soviet Union, Dies at 89 * March 17 - Ashley Adams, 59, Australian Paralympic shooter, traffic collision. * March 18 - Thomas Hopko, 75, American Eastern Orthodox priest and theologian, congestive heart failure.Protopresbyter Thomas Hopko * March 18 - Shaw Taylor, 90, British actor and television presenter.Police 5 star Shaw Taylor dies at his Isle of Wight home * March 19 - Danny Schechter, 72, American journalist and filmmaker, pancreatic cancer.RIP Danny Schechter, \"The News Dissector,\" Author, TV Producer, Made Six Films on Nelson Mandela * March 19 - Gus Douglass, 88, American politician, West Virginia Commissioner of Agriculture (1965–1989, 1993–2013), fall. * March 19 - Gerda van der Kade-Koudijs, 91, Dutch sprint athlete, Olympic champion (1948).Olympisch kampioene Van der Kade-Koudijs overleden * March 20 - Eva Burrows, 85, Australian Salvation Army General (1986–1993).Salvation Army leader General Eva Burrows dies, aged 85 * March 20 - Robert Kastenmeier, 91, American politician, member of United States House of Representatives from Wisconsin (1959–1991), heart failure.Ex- Wisconsin Rep. Kastenmeier, Early Vietnam Critic, Dies * March 20 - Gregory Walcott, 87, American actor (Plan 9 from Outer Space, Norma Rae, Ed Wood).Gregory Walcott, ‘Plan 9 From Outer Space’ Star, Dies at 87 * March 20 - Petr Vopěnka, 79, Czech mathematician and politician.Zemřel polistopadový ministr školství, významný matematik Vopěnka * March 20 - Malcolm Fraser, 84, Australian politician, Prime Minister (1975–1983).Former prime minister Malcolm Fraser dead at 84 * March 21 - Chuck Bednarik, 89, American NFL Hall of Fame football player (Philadelphia Eagles), complications from Alzheimer's disease.Eagles Hall of Famer Chuck Bednarik passes at age 89/ * March 21 - James C. Binnicker, 76, American air force officer, Chief Master Sergeant (1986–1990). * March 21 - Hans Erni, 106, Swiss painter, designer and sculptor.Hans Erni mit 106 Jahren gestorben * March 21 - Jørgen Ingmann, 89, Danish musician, 1963 Eurovision Song Contest winner.Danmarks første grandprix-vinder Jørgen Ingmann er død * March 22 - Arkady Arkanov, 81, Russian writer and comedian.В московской больнице скончался Аркадий Арканов * March 22 - Norman Scribner, 79, American choral conductor.Choral Arts' Norman Scribner: 1936-2015 * March 23 - Herberto Hélder, 84, Portuguese poet.Décès du poète portugais Herberto Helder * March 23 - Bobby Lowther, 91, American basketball player and athlete (LSU Tigers), All-American (1946).Bobby Lowther, LSU's lone two-sport All-American, dies * March 23 - Lee Kuan Yew, 91, Singaporean politician, Prime Minister (1959–1990), pneumonia.Lee Kuan Yew, Singapore’s Founding Father, Dies at 91 * March 23 - Lil' Chris, 24, British singer-songwriter, actor and television personality.Rock School star Lil' Chris found dead in Lowestoft * March 24 - Yehuda Avner, 86, Israeli diplomat, Ambassador to Australia and the United States, cancer.Yehuda Avner, diplomat and political icon, dies at 86 * March 24 - Moncef Ben Salem, 62, Tunisian politician.Moncef Ben Salem n'est plus * March 24 - Richard Butson, 92, Canadian explorer and physician, recipient of the George Cross.Richard Butson, GC - obituary * March 24 - Notable people killed in the crash of Germanwings Flight 9525:Germanwings Airbus A320 plane crash: First pictures of opera singers Maria Radner and Oleg Bryjak among 150 dead ** Oleg Bryjak, 54, Kazakh-born German opera singer. ** Andreas Lubitz, 27, German co-pilot. ** Maria Radner, 34, German opera singer. * March 25 - George Fischbeck, 92, American television weatherman (KABC).Dr. George Fischbeck, longtime KABC weatherman, dies * March 25 - Ivo Garrani, 91, Italian actor (Black Sunday, Hercules, Caliber 9).Addio a Ivo Garrani dal “Gattopardo” a “Un posto al sole” * March 25 - Dick Bond, 93, American politician, member of the Washington House of Representatives (1975-1987).Feisty GOP legislator Dick Bond dies at 93 * March 25 - Bill Slayback, 67, American baseball player (Detroit Tigers).Ex-Tiger, songwriter Bill Slayback dies at 67 * March 25 - Ron Suart, 94, English football player and manager (Chelsea).Chelsea mourn death of former manager Ron Suart aged 94 * March 26 - John Renbourn, 70, British guitarist (Pentangle), heart attack.Guitarist Renbourn dies aged 70 * March 26 - Karl Moik, 76, Austrian television presenter (Musikantenstadl).Karl Moik ist tot * March 26 - Luís Miguel Rocha, 39, Portuguese author, cancer.Muere el escritor portugués Luis Miguel Rocha, autor de «El último Papa» * March 26 - Dinkha IV, 79, Iraqi Syriac Christianity cleric, Catholicos-Patriarch of the Assyrian Church of the East (since 1976). * March 26 - Tomas Tranströmer, 83, Swedish poet and translator, awarded the 2011 Nobel Prize in Literature. * March 26 - Friedrich L. Bauer, 90, German computer scientist.Die Last eintöniger geistiger Tätigkeit bekämpfen - zum Tode des Informatik-Pioniers Friedrich L. Bauer * March 26 - Fred Robsahm, 71, Norwegian actor (Flashback).Natural Born Star * March 27 - Rod Hundley, 80, American basketball player (Los Angeles Lakers) and television broadcaster, Alzheimer's disease.Legendary Utah Jazz announcer ‘Hot Rod’ Hundley dies * March 27 - T. Sailo, 93, Indian military officer and politician, heart failure. * March 27 - Amaro Silva, 57, Canadian politician.Amaro Silva, former Winnipeg city councillor, dies * March 27 - Olga Syahputra, 32, Indonesian actor, comedian, singer and television host, meningitis.Comedian Olga Syahputra passes away in Singapore * March 27 - Daundre Barnaby, 24, Jamaican-born Canadian Olympic runner (2012), drowning. * March 27 - B.J. Crosby, 63, American singer and actress (Smokey Joe's Cafe), diabetic stroke.Singer/Actress B.J. Crosby Dies at 63 * March 27 - Rik Battaglia, 88, Italian actor.Rik Battaglia († 88) stirbt an Herzversagen * March 27 - Yusuf Mohamed Ismail, 54, Somali diplomat, Ambassador to Switzerland (since 2008) and the Permanent Representative to the United Nations (since 2008), shot.Somalia hotel siege ends; U.N. diplomat, 19 others killed * March 28 - Miroslav Ondříček, 80, Czech cinematographer (Amadeus, Ragtime, if....).Czech Oscar-nominated cinematographer Miroslav Ondricek dies * March 28 - Gene Saks, 93, American stage and movie director (The Odd Couple, Barefoot in the Park), pneumonia.Gene Saks, Tony-Winning Director of Neil Simon Hits, Dies at 93 * March 29 - Juan Carlos Maccarone, 74, Argentine Roman Catholic prelate, Bishop of Chascomús (1996–1999) and Santiago del Estero (1999–2005).Bishop Juan Carlos Maccarone † * March 30 - Philip A. Potter, 93, Dominica Methodist church leader, General Secretary of the World Council of Churches (1972-1984).World Council of Churches lauds Philip Potter, one of its most famed leaders * March 30 - Helmut Dietl, 70, German movie director (Schtonk!), lung cancer.Helmut Dietl ist gestorbe * March 30 - Ingrid van Houten- Groeneveld, 93, Dutch astronomer. Leidse sterrenkundige Ingrid van Houten overleden (21 oktober 1921-30 maart 2015), Astronomie.nl, 2015. Retrieved on 31 March 2015. * March 31 - Carlos Gaviria Díaz, 77, Colombian lawyer and politician, Magistrate of the Constitutional Court of Colombia (1993–2001), Senator (2006–2010), presidential candidate (2006), lung disease.Fallece el constitucionalista Carlos Gaviria a sus 77 años ==Previous months== * January 2015 * February 2015 * April 2015 ==References== *03 Category:March 2015 events",
 "title": "Deaths in March 2015"
}