{
 "id": "483584",
 "text": "Oggy and the Cockroaches is a French animated kids' television series. It was created in 1997 by Jean-Yves Raimbaud. The main characters are Oggy, Joey, Marky, Dee Dee and Jack. Season 4 onwards include the additions of Olivia and Bob. It is slapstick comedy with comic violence. ==Episodes== ==Characters== ===Main=== ====The Two Cats==== * Oggy (voiced by Ben Small) is a laid-back blue cat with some childlike aspects. * Jack (voiced by Keith Wickham) is Oggy's cousin, but he's more rough and tumble. ====The Cockroaches==== * Joey (voiced by Tim Whitnall) is the leader of the cockroaches. Some of his schemes may involve his want for money. He's very small. His right eye is pink, and his left eye is yellow. * Marky (voiced by Marc Silk) is Dee Dee and Joey's brother. His eyes are pink. * Dee Dee (voiced by Nick Mercer) is the glutton of the trio. He's an opera singer. He does detective work in 2 separate episodes. He's hungry all the time. His eyes are green like Oggy's. ===Recurring=== * Monica (voiced by Tamsin Heatley) is Oggy's twin sister who's such a tomboy in roller skates. She's Jack's love interest. * Bob (voiced by Wayne Forester) is Oggy's next-door neighbor. He's very angry. * Olivia (voiced by Maria Darling) is a female cat who loves nature. She doesn't mind the 3 tiny cockroaches: Dee Dee, Joey and Marky. Debuted in season 4 as Oggy's crush. ==International broadcast== Oggy and the Cockroaches was shown on on France 3, Canal+ Family, Gulli, Canal J, Canal+, Télétoon+, France 4, and Tiji. In the Philippines, the series was shown on TV5 in 2010. In late 2011, it was shown on Cartoon Network. It was also shown on Disney Channel from 2009 to 31 December 2013. It moved to GMA Network on 3 September 2022, under the network's Astig Authority Saturday morning block. In Arab countries, it was shown on Ajyal TV, MBC3, and Basma Channel. It also airs on 2M in Morocco and local Tunisian channels. (i.e. Tunis 7) In Italy, it was shown on Italia 1, Hiro, Boing, K2, and Frisbee. In India, It was shown on Nickelodeon, Cartoon Network, Nickelodeon, Sonic Nickelodeon, Cartoon Network and Sony YAY!. In the United States, It was shown on Nickelodeon and Nicktoons. ==Media== ===Home media=== Five DVDs were made in 2003 in the United States, the DVDs had 12 episodes. In 2005, VHSs were made in New York City. On 8 October 2008, a French DVD box-set of the first season, the pilot and the episode \"Working Cat\", was released. On 6 September 2010, three French DVD box sets of the complete first, second, and third seasons were made. In July 2011, a French DVD box-set with all episodes from seasons 1, 2 and 3 was made. Seasons 4 to 7 haven't been made. # DVD name Release date 1 Volume 1 4 November 2003 2 Volume 2 4 November 2003 3 Volume 3 25 November 2003 4 Volume 4 25 November 2003 5 Volume 5 25 November 2003 ===Magazine=== A magazine called came out in France in 2009 (two issues), and in 2011. * n°1: 11 July 2009 * n°2: 21 October 2009 * n°3: 14 January 2011 ===Music=== A music album called was made in France It was made as a CD and a digital download on 6 September 2010. ===Comics=== A French comic series was made in 2010. It is published by Dargaud. It is written by Diego Aranega, and it is drawn and colourised by . * 16 April 2010: vrooo ! * 5 November 2010: * 23 September 2011: A American comic was made on 11 December 2019. It was published by American Mythology Productions. ===CD drama=== A CD drama called , was made in France on CD and for digital download in October 2012. ===Film=== The film Oggy and the Cockroaches: The Movie (originally ) was released to theatres on 7 August 2013. ===Video game=== A video game for the Game Boy Advance was made by Xilam, but it was cancelled. ===Spin-off=== A spin-off television series called Oggy Oggy was shown on 24 August 2021. It is about a kitten called Oggy and his friends Mallow and Sporty. It is CG-animated. The series was shown on Netflix and is the first French Netflix original series. ===Reboot=== A reboot of the Oggy Oggy television series called Oggy and the Cockroaches: Next Generation was shown on 24 August 2021. == References == ==Other websites== * *Website of the producer Xilam * * Category:American children's television series Category:French animated television series Category:Nickelodeon television series Category:1998 television series debuts Category:1990s animated television series Category:2000s animated television series Category:2010s animated television series Category:2020s animated television series Category:English-language television programs Category:Cockroaches",
 "title": "Oggy and the Cockroaches"
}