{
 "id": "48364",
 "text": "Minnie Mouse is an American cartoon character. She is Mickey Mouse's significant other. They were both created by Walt Disney. Her birthday is on 18th November 1928. She only first appeared in 1928, in “Plane Crazy”. She is also known as Princess Minnie and Maestro Minnie. Minnie's favorite foods are cheese, chocolate and cake. She loves listening to jazz music, cooking, baking, shopping and makeup. She was voiced by Walt Disney from 1928 to 1929, then by Marcelite Garner, and then voiced by Russi Taylor. == Family == Minnie Mouse’s parents are unknown, but Marcus Mouse may be her father’s name. His name was first used in the comic strip story “Mr. Slicker and the Egg Robbers” (published 22 September — 26 December, 1930). The same story featured photographs of Minnie's uncle Milton Mouse with his family and her grandparents Marvel Mouse and Matilda Mouse. She also has an uncle named Mortimer Mouse and twin nieces, Millie and Melody Mouse. == Pets == Minnie Mouse has two pets, a dog and a cat. The dog is called Fifi. Fifi has 5 puppies with Mickey’s dog, Pluto. Pluto was Mickey’s first dog; he was called Rover at that time. She also has a cat called Figaro. This is the same cat which appears in the Disney movie Pinocchio. It has been recently discovered that she has adopted two new pets, a lizard and a snake, their names are Lolly and Pop, respectively. This is due to her sudden fascination with reptiles. == Marriage to Mickey == Walt Disney said in a interview in 1933 that in private Mickey and Minnie are married. He also said that many people asked him about this. Depending on the movie, Minnie and Mickey are married or sometimes not married. They also, at least in public, have no children yet. == Gossip about Minnie's name == From 19th January 1942 to 2nd May 1942 there was a comic magazine called “The Gleam”. In this magazine once it said that Minnie’s real name was Minerva Mouse. But the Walt Disney head office said that there is no register about her real name as Minerva. There is not much information about Minerva, but she is similar to Minnie’s character. Therefore, many people misunderstood that Minerva was Minnie’s real name. Formally Minnie’s name is only registered as “Minnie Mouse”. However some sources say that Minerva is Minnie’s real name, and that Minnie’s full name is Minerva “Minnie” Mouse. More likely is that Minnie's original name was the German/Dutch Wilhelmina, which is about the only name for which Minnie is the \"official\" abbreviation (http://www.thinkbabynames.com/meaning/0/Minnie ). Possibly, this fact was suppressed during the 1930s, as Germany became more unpopular due to its political and racial leanings. In episode 14 of season 4 of the series Mickey Mouse, which began airing on the Disney Channel in June 2013, Mickey addresses Minnie as \"Minifred\" (a pun on the name Winifred), but this is non-canon. == Friends == It seems that Minnie’s closest friends are Daisy Duck, Donald Duck’s girlfriend, and also sometimes Clarabelle Cow. She often goes shopping with Daisy and she spends a lot of time with her. Her friendship with Daisy is more of a product of recent cartoons, as they never interacted with each other during the classic shorts. Minnie also has another friend called Honor the Hippo and they keep their secrets in bits of moss on the pavement. Minnie's other friend Carly the Cat has a middle parting in her long hair. ==References== Category:Fictional characters introduced in the 1920s Category:Fictional mice and rats Category:Mickey Mouse universe characters Category:Animated movie characters Category:Animated television characters",
 "title": "Minnie Mouse"
}