{
 "id": "483784",
 "text": "Cædmon's Hymn is a short Old English poem originally composed by Cædmon. It was about God. It survives in a Latin translation by Bede in his Historia ecclesiastica gentis Anglorum and in other dialects written down in several manuscripts of Bede's Historia. Bede wrote about the poet and his work in the fourth book of his Historia.Charles Leslie Wrenn, A Study of Old English Literature (New York: W.W. Norton & Company, Inc., 1967), p. 92 == Cædmon == Bede told the story of Cædmon who was an illiterate cow-herder who was suddenly able to recite a Christian song of creation in Old English verse. This miracle happened after Cædmon left a feast when they were passing a harp around for all to sing a song. He left the hall after feeling ashamed that he could not contribute a song. Later in a dream he said a man appeared to him and asked him to sing a song. Cædmon responded that he could not sing. But the man told him that he could and asked him to “Sing to me the beginning of all things.” Cædmon was then able to sing verses and words that he had not heard of before.Caedmon; Daniel Paul O'Donnell; Dawn Collins, Cædmon's Hymn: A Multimedia Study, Archive and Edition (Cambridge [England]; Rochester, NY: D.S. Brewer/SEENET/the Medieval Academy, 2007), pp. 1–2 Cædmon then reported his experience first to a steward then to Hild the abbess. She invited scholars to evaluate Cædmon’s gift. Cædmon was sent home to turn more divine doctrine into song. The abbess was so impressed with the success of his gift that she told him to become a monk. Cædmon lived a long and very productive life as a monk. He created songs from all kinds of Church history and doctrine. == Choral settings of Caedmon's Hymn == The text has been set to music by a number of composers of choral music. Graham Keitch used Bede's translation for a motet which was commissioned to mark the 1100th anniversary of the death of the Anglo Saxon queen, Aethelflaed. It was first sung during the commemorative Evensong for Queen Aethelflaed which took place in Gloucester Cathedral, June 12th 2018. == Translated text == ; Old EnglishRichard Marsden, Old English Reader (Cambridge: Cambridge University Press, 2004), p. 80 : nu scylun hergan hefaenricaes uard : metudæs maecti end his modgidanc : uerc uuldurfadur swe he uundra gihwaes : eci dryctin or astelidæ : he aerist scop aelda barnum : heben til hrofe haleg scepen. : tha middungeard moncynnæs uard : eci dryctin æfter tiadæ : firum foldu frea allmectig ; Latin (Bede) : Nunc laudare debemus auctorem regni caelestis, : potentiam creatoris, et consilium illius : facta Patris gloriae: quomodo ille, : cum sit aeternus Deus, omnium miraculorum auctor exstitit; : qui primo filiis hominum : caelum pro culmine tecti : dehinc terram custos humani generis : creavit. : omnipotens ; Modern English translation : Now [we] must honour the guardian of heaven, : the might of the architect, and his purpose, : the work of the father of glory : as he, the eternal lord, established the beginning of wonders; : he first created for the children of men : heaven as a roof, the holy creator : Then the guardian of mankind, : the eternal lord, afterwards appointed the middle earth, : the lands for men, the Lord almighty. == References == == Other websites == * CAEDMON'S HYMN, Washington State University Category:Christian hymns Category:Old English literature",
 "title": "Cædmon's Hymn"
}