{
 "id": "48370",
 "text": "Porphyria is the name for a group of certain medical conditions or diseases. They have been known since the days of Hippocrates. Another name for porphyria is the madness of King George disease. They are seen by either attacks of severe pain (acute porphyrias) or light sensitive skin problems (cutaneous porphyrias), never with cutaneous (skin) light sensitivity in acute. Porphyrias are a group of uncommon disorders that are caused when there are problems with the production of chemicals called porphyrins in the body. Porphyrins are the chemical building blocks of haem, which form haemoglobin, the component of red blood cells that allows oxygen to be carried around the body. An increase in the amount of a specific porphyrin or a porphyrin precursor results in symptoms of porphyrias. Porphyrias are often separated into those that cause acute attacks and those that cause skin damage, although some disorders can have both types of symptoms. The disease is most common in European countries. ==Cause== The condition is usually caused by a genetic deficiency, but is can happen (in about 28% of cases) without family history (called de novo mutations). Chemicals which affect metabolism may also cause it. Arsenic is one example. It can be triggered by various drugs or by some environmental conditions. ==Symptoms== The disease causes skin problems, or some diseases of the nervous system, or both. Severe pain is often present. Medications are available that can at least treat the symptoms. It is most common in people between the ages of 18 to 40 years old. ===Acute=== Acute attacks are Acute Intermittent Porphyria (AIP), Hereditary Coproporphyria (HCP), Variegate Porphyria (VP) and ALA dehydratase deficiency porphyria (ADP). These tend to cause attacks in adults and the main symptoms can include: *gastrointestinal symptoms such as **abdominal pain, nausea and vomiting * cardiac symptoms such as **changes in blood pressure, increased heart rate *motor symptoms such as **muscle weakness, paralysis *psychiatric symptoms such as **anxiety, confusion or hallucination *or central nervous system (CNS) symptoms: **seizures. HCP and VP can also cause cutaneous symptoms. ===Cutaneous porphyrias=== These are Porphyria Cutanea Tarda (PCT), Congenital Erythropoietic Porphyria (CEP), Erythropoietic Protoporphyria (EPP) and X-linked dominant Protoporphyria (XLDPP). Skin porphyrias cause skin- related signs and symptoms, typically causing one of two types of symptoms: * photosensitivity leading to pain straight away upon exposure to sunlight (e.g. EPP) * blistering and fragility of the skin in areas exposed to sunlight (e.g. PCT). When someone is affected by porphyria they will start to lose their hair about two weeks after having an attack. There is no cure for the hair loss. However, there is medication available to help prevent attacks. == References == Category:Genetic disorders",
 "title": "Porphyria"
}