{
 "id": "483711",
 "text": "Pan American World Airways, or Pan Am, was once the largest airline of the USA. The crash of Pan Am Flight 103 and several other factors led to the airline to stop flying in 1991. ==History== Pan Am was founded in 1926. Its first flights were from Key West, Florida to Havana, Cuba. During the 1920s and 1930s, Pan Am bought several smaller airlines in Central America and South America. These were bought to help Pan Am expand its flights throughout The Americas. Pan Am became the first airline to circumnavigate the world in 1942. By the 1950s, Pan Am had several larger airplanes like the Boeing 377, Douglas DC-6 and the Lockheed Constellation. It went to cities all across the world. In 1959, Pan Am bought its first jet - the Boeing 707. In 1970, Pan Am introduced its first widebody jet - the Boeing 747.http://www.boeing.com/news/frontiers/archive/2008/july/i_history.pdf In 1980, Pan Am was combined with National Airlines. This was because Pan Am wanted to fly domestic flights and the government didn't allow it. When Pan Am bought National, it could finally fly domestically. In the 1980s, Pan Am started having many financial problems, having paid too much to buy National Airlines. Pan Am also spent too much money on the new Boeing 747s. The Gulf War of 1990 also caused many problems with Pan Am's transatlantic flights. Pan Am declared bankruptcy in January 1991. Delta Air Lines bought small parts of Pan Am and tried to help it. However, on December 4, 1991 Pan Am stopped flying due to the big financial problems. United Airlines got many of Pan Am's old flights. American Airlines got Pan Am's Miami hub. Pan Am was resurrected twice in 1996 and 1998. ==References== ==Other websites== *Pan Am Museum Foundation YouTube Category:Airlines of the United States Category:Companies based in Miami Category:Companies based in New York City Category:1927 establishments in the United States Category:1991 disestablishments in the United States Category:Defunct companies of the United States",
 "title": "Pan American World Airways"
}