{
 "id": "484372",
 "text": "Las Estrellas is one of the main television networks of Televisa. It has affiliate television stations all over Mexico. Its flagship station is XEW-TDT in Mexico City. == Las Estrellas International == Las Estrellas International is available as a pay television network in Europe and Australia as Canal de las Estrellas EuropaCanal de las Estrellas Europa: Europe and Australia coverage and Canal de las Estrellas Latinoamerica in Central and South America through Televisa Networks.Canal de las Estrellas Latinoameria: Latin America coverage Both feeds differ from the Canal de las Estrellas programming, usually broadcasting shows weeks behind their original broadcast. In Canada, XEW-TDT and the Las Estrellas schedule is available in full on Rogers Cable (limited to the Greater Toronto Area) and Bell Fibe TV as an eligible foreign service. == Network Logos == File:XEWTV2.png|1950 File:XEW 1952.png|1952 File:XEW-TV2 (1966).png|1966 File:XEWTV2 (1967).svg|1967 File:XEW-TV2 (1968).svg|1968 File:Canal 2 1970s logo.PNG|1970 File:El Canal de las Estrellas 1993.png|1993 File:Canal 2 (Las Estrellas) 1995.svg|1995 File:XEW-TV Canal 2 (El Canal De Las Estrellas 1996).svg|1996 File:XEW-TV2 (Las Estrellas) 1997.svg|1997 File:Canal de las Estrellas 1997-2007.svg|2007 File:XEWTV2-2008-2014.png|2008 File:XEW-TV2014.png|2014 File:XEW- HD-2016.png|2015 HD File:Canal de las Estrellas logo.svg|2015 File:Las Estrellas.svg|2016 File:Canal 2 (Las Estrellas 2017).svg|2017 File:Las estrellas 2017.jpg|2017 icon == Programming == Weekday programming in the afternoon and prime time consists of telenovelas. Las Estrellas airs sports programming and sports specials like the Olympic Games and the FIFA World Cup. Morning and afternoon programming consists of news, sports, talk shows, and variety shows. Night time programming is filled with a news program and Univision-produced shows. Examples of shows produced by Las Estrellas are Recuerda y Gana, Hoy, El Juego de las Estrellas, and Cuéntamelo ya. The network also produces and airs the Premios TVyNovelas, sponsored by the Televisa-owned magazine of the same name and considered the highest honor in the domestic Mexican television industry. ==References== == Other websites == * Category:Television networks Category:Mexico City Category:1950s establishments in Mexico Category:1951 establishments in North America",
 "title": "Las Estrellas"
}