{
 "id": "484317",
 "text": "The Chickasaw are a Native American people. They are from the Southeastern Woodlands of North America. Before Europeans came to America, they lived in the area of Mississippi, Alabama, and Tennessee. They speak the Chickasaw language. This language is in the Muskogean language family. The Chickasaw are federally recognized as the Chickasaw Nation. The Chickasaw first lived in western North America. Before the first European contact, they moved to east of the Mississippi River. They settled mostly in what is now northeast Mississippi. They were living here when European explorers and traders came. They had relationships with the French, English and Spanish during the colonial years. The United States considered the Chickasaw one of the Five Civilized Tribes. The tribe had advanced social structures and did many things that European Americans did. The US forced them to sell their land in 1832. They also forced them to move to the Indian Territory (Oklahoma) during the 1830s. Most Chickasaw now live in Oklahoma. The Chickasaw Nation in Oklahoma is the 13th largest federally recognized tribe in the United States. Its members are related to the Choctaw and share a common history with them. The Chickasaw are divided into two groups: the Impsaktea and the Intcutwalipa. They traditionally followed a system of matrilineal descent. Some property was controlled by women. Leadership in the tribe passed from a mother to her children. == Etymology == The name chickasaw originally belonged to a Chickasaw leader. Chickasaw is the English spelling of Chikashsha (). This means \"rebel\" or \"comes from Chicsa\". ==History== The origin of the Chickasaw is not known for certain. Twentieth-century scholars, such as the archeologist Patricia Galloway, think that the Chickasaw and Choctaw came from the Plaquemine culture and other groups whose ancestors had lived in the Lower Mississippi Valley for thousands of years. The Chickasaw and Choctaw then became distinct peoples in the 17th century. When Europeans first encountered them, the Chickasaw were living in villages in present-day South Carolina and northeastern Mississippi. The Chickasaw may have been migrants to the area. Their oral history says that they moved from west of the Mississippi River into present-day Mississippi in prehistoric times. Another version of the Chickasaw creation story is that they came out of the ground at Nanih Waiya, a great mound built about 300 CE by Woodland peoples. In 1540 the Spanish explorer Hernando De Soto encountered the ancestors of the Chickasaw and stayed in one of their towns. After various disagreements, the American Indians attacked the De Soto expedition in a nighttime raid, nearly destroying it. The Spanish moved on quickly. The Chickasaw began to buy guns from the British after the colony of Carolina was founded in 1670. They used these weapons to raid the Choctaw. They captured some members and sold them into Indian slavery to the British. When the Choctaw started buying guns from the French, the slave raids stopped. Allied with the British, the Chickasaw had battles with the French and the Choctaw in the 18th century, such as in the Battle of Ackia on May 26, 1736. They continued until France was defeated by the British in the Seven Years' War (called the French and Indian War in North America). After the American Revolutionary War, the Chickasaw were allies of the new United States and fought against the Indians of the old Northwest Territory. The Shawnee and other Northwest Indians were defeated in the Battle of Fallen Timbers on August 20, 1794. ===Relations with the United States=== George Washington (first U.S. President) and Henry Knox (first U.S. Secretary of War) proposed the cultural transformation of Native Americans. Washington believed that Native Americans were equals of white people, but that their society was not as good. He came up with a policy to \"civilize\" them, and Thomas Jefferson continued it. Washington's plan included impartial justice toward Indians; regulated buying of Indian lands; promotion of experiments to civilize or improve Indian society; and punishing those who violated Indian rights. The government appointed Indian agents. They lived among the Indians to teach them how to live like whites. In the 19th century, the Chickasaw increasingly adopted European-American practices, as they established schools, adopted yeoman farming practices, converted to Christianity, and built homes in styles like their European-American neighbors. ==== Treaty of Hopewell (1786) ==== The Chickasaw signed the Treaty of Hopewell in 1786. This treaty officially recognized peace between the Chickasaw and the United States. ====Treaty of 1818==== In 1818, the leaders of the Chickasaw signed a treaty giving up all land north of the southern border of Tennessee.Pate, James C. Encyclopedia of Oklahoma History and Culture. \"Chickasaw.\" Retrieved December 27, 2012. The Chickasaw kept a four-square-mile reservation, but were required to lease the land to European immigrants. ===Removal era (1837)=== The Chickasaw received $3 million U.S. dollars from the United States for their lands east of the Mississippi River. In 1836, the Chickasaw agreed to purchase land in Indian Territory from the Choctaw. They paid the Choctaw $530,000 for the western part of their land. For nearly 30 years, the US did not pay the Chickasaw the $3 million it owed them for their territory in the Southeast. The Chickasaw gathered at Memphis, Tennessee, on July 4, 1837, with all of their portable assets: belongings, livestock, and enslaved African Americans. Three thousand and one Chickasaw crossed the Mississippi River. During the journey, often called the Trail of Tears by all the Southeast tribes that had to make it, more than 500 Chickasaw died of dysentery and smallpox. When the Chickasaw reached Indian Territory, the United States merged them with the Choctaw nation. The Chickasaw wrote their own constitution in the 1850s. === American Civil War (1861) === The Chickasaw Nation became allies of the Confederate States of America in 1861. They did this because the United States government had forced them off their lands and did not protect them against the Plains tribes in the West. Confederate officials suggested that the American Indian tribes would receive an independent Indian state if the Confederacy won. At the beginning of the American Civil War, Albert Pike was made the Confederate envoy to Native Americans. He negotiated several treaties, including the Treaty with Choctaws and Chickasaws in July 1861. The treaty covered many things, such as the sovereignty of the Choctaw and Chickasaw nation, the possibility of citizenship in the Confederate States of America, and a delegate in the House of Representatives of the Confederate States of America. Because the Chickasaw sided with the Confederate States of America during the American Civil War, they had to give up some of their land after the war. The US also freed all the slaves owned by the Chickasaw. Members of the Chickasaw who returned to the United States were given US citizenship. ====Treaties==== Treaty Year Signed with Where Main Purpose Ceded Land Treaty with the Chickasaw 1786 United States Hopwell, SC Peace and Protection provided by the U.S. and Define boundaries N/A Treaty with the Chickasaw 1801 United States Chickasaw Nation Right to make wagon road through the Chickasaw Nation, Acknowledge the protection provided by the U.S. (Not Available yet) Treaty with the Chickasaw 1805 United States Chickasaw Nation Eliminate debt to U.S. merchants and traders (Not Available yet) Treaty of with the Chickasaw 1816 United States Chickasaw Nation Cede land, provide allowances, and tracts reserved to Chickasaw Nation (Not Available yet) Treaty of with the Chickasaw 1818 United States Chickasaw Nation Cede land, payments for land cession, and Define boundaries (Not Available yet) Treaty of Franklin (un-ratified) 1830 United States Chickasaw Nation, See Hiram Masonic Lodge No. 7 and Cede lands east of the Mississippi River and provide protection for the 'weak' tribe (Not Available yet) Treaty of Pontotoc 1832 United States Chickasaw Nation Removal and Monetary gain from the sale of land . ====Post–Civil War==== Because the Chickasaw were on the side of the Confederacy during the Civil War, the United States government made a new peace treaty with them in 1866. It required that they free their slaves and give citizenship to freed slaves who wanted to stay in the Chickasaw Nation. The freed slaves and their descendants became known as the Chickasaw Freedmen. However, the Chickasaw Nation did not give citizenship to the Chickasaw Freedmen. Descendants of the Freedmen continue to live in Oklahoma.The Choctaw Freedmen of Oklahoma, african-nativeamerican.com. (accessed October 17, 2013) The Chaloklowa Chickasaw Indian People were recognized as a \"state-recognized group\" by South Carolina in 2005. Their headquarters is in Hemingway, South Carolina.\"South Carolina Indian Affairs Commission. Retrieved 19 September 2012. In 2003, they asked the US Department of the Interior Bureau of Indian Affairs for federal recognition, but they did not receive it.\"Receipt of Petitions for Federal Acknowledgment of Existence as an Indian Tribe.\" Federal Register. Volume 68, Number 54. 20 March 2003. Retrieved 19 September 2012. ==Government== In the twentieth century, the Chickasaw became independent from the Choctaw and re-established their government. They are now federally recognized as the Chickasaw Nation. The tribe's government is headquartered in Ada, Oklahoma. ==Culture== Chiefs have the suffix -mingo at the end of their names. For example, Tishomingo was the name of a famous Chickasaw chief. In 2010, the tribe opened the Chickasaw Cultural Center in Sulphur, Oklahoma.\"About the Center.\" Chickasaw Cultural Center (accessed September 21, 2011) ==Notable Chickasaw people== * Travis Childers, Democratic U.S. Congressman from Mississippi ==Footnotes== ==Other websites== * Chickasaw.tv The online video network of the Chickasaw Nation. * The Chickasaw Nation of Oklahoma, official site) * Chickasaw Nation Industires (government contracting arm of the Chickasaw Nation) * \"Chickasaws: The Unconquerable People\", a brief history by Greg O’Brien, Ph.D. * Encyclopedia of North American Indians * \"Chickasaw History\" by Lee Sultzman * John Bennett Herrington is First Native American Astronaut (on chickasaw.net) * Tishomingo * Pashofa recipe * Tanshpashofa recipe * Some Chickasaw information in discussion of DeSoto Trail * Encyclopedia of Oklahoma History and Culture - Chickasaw Category:Native Americans",
 "title": "Chickasaw"
}