{
 "id": "484545",
 "text": "Dhoom () is a 2004 Indian Hindi-language action thriller movie. This movie was directed by Sanjay Gadhvi. This movie was produced by Aditya Chopra. Two sequels to the film titled Dhoom 2 and Dhoom 3 were released in 2006 and 2013. ==Plot== The story starts in the city of Mumbai, where a motorbike gang (a gang of robbers on hi-tech motorbikes, led by charismatic Kabir, is sweeping through Mumbai, outwitting the police at every turn) starts breaking into banks and other public places and vanishes onto the Western Express Highway. Assistant Commissioner of Police Jai Dixit (Abhishek Bachchan), a no-nonsense cop, is called onto the case. Dixit seeks the help of a local bike dealer/racer named Ali Akbar Fateh Khan (Uday Chopra) and devises a trap to catch the gang, but it fails. Kabir (John Abraham), the leader of the gang, eventually taunts Dixit, claiming that Dixit can't catch him even if he is right in front of him. He is proven correct, and Dixit's failure apparently causes him to part ways with Ali. ===Lure to gang=== Kabir then lures Ali into his gang as a substitute for Rohit, the gang member who was killed by Dixit. Ali falls in love with Sheena (Esha Deol), another gang member. The gang later goes to Goa to perform one last big heist before disbanding forever. Kabir sets his eyes on the largest casino in all of India. Kabir and his gang swiftly loot the casino on New Year's Eve, but they soon realize that Dixit has led them right into a trap. It is revealed that Ali was working for Dixit the whole time, and a fight ensues. ===Escape=== Kabir manages to escape from Dixit and goes back to the gang's truck, where Ali has kept Sheena bound and gagged. Kabir then viciously beats up Ali for his betrayal, but Ali is saved by Dixit's timely arrival at the scene. The gang flees, except for Sheena, while Dixit and Ali give chase to Kabir. They kill all the other gang members except Kabir, who tries to escape on his bike. He is cornered by Dixit and Ali with nowhere to go. Kabir decides to take his own life rather than let Dixit arrest him, and he rides his bike over the edge of a cliff into the water to his death. The film ends with Dixit and Ali arguing with each other, albeit in a friendly way. ==Cast== * Abhishek Bachchan as ACP Jai Dixit * Uday Chopra as Ali Akbar Fateh Khan * John Abraham as Kabir Sharma * Esha Deol as Sheena Rai * Rimi Sen as Sweety J. Dixit (Jai's wife) * Manoj Joshi as Shekhar Kamal * Aarav Chowdhary as Rahul Trivedi * Farid Amiri as Tony Raj * Rohit Chopra as Rohit Acharya * Ajay Pande as Vinod Singh * Bhupinder as Chor Bazaar Goon * Mehul Bhojak as Manu Vikram * Yusuf Hussain as Mr. Tripathi (Mumbai Police Commissioner) * Mukesh Ahuja as Bookie * Ayesha Raza as Sunaina (A T. V. reporter) * Sanjay Keni (cameo appearance) * Perizaad Zorabian (special appearance) ==Production== Aditya Chopra initially had car chases in mind instead of bikes, but Sanjay Gadhvi convinced him otherwise as the rider's faces can be seen, and he had a craze for bikes in his youth. == References == ==Other websites== * * Category:2004 movies Category:2000s Indian movies",
 "title": "Dhoom"
}