{
 "id": "484601",
 "text": "The Poland national men's volleyball team is the national volleyball team from Poland, controlled by the Polski Związek Piłki Siatkowej (PZPS), which represents the country in international competitions and friendly matches. Poland is one of the world's strongest teams, it is the reigning world champion since 2014 and is ranked third (as of August 2015) in the FIVB world ranking. This team has been named as country's Team of the Year at the Polish Sports Personality of the Year awards in Warsaw. ==Statistics== Competition Total Olympic Games 1 0 0 1 World Championship 2 1 0 3 World Cup 0 2 0 2 World Grand Champions Cup 0 0 0 0 World League 1 0 1 2 European Championship 1 5 2 8 European Games 0 0 0 0 European League 0 0 1 1 Universiade 0 1 0 1 Memorial of Hubert Jerzy Wagner¹ 6 4 2 12 Total 5 9 4 18 ¹Friendly tournament, not included in the statistics ==Olympic Games== 1964 — did not participa te * 1968 Mexico City — 5th place *: Ambroziak, Gościniak, Jasiukiewicz, Paszkiewicz, Rutkowski, Siwek, Skiba, Skorek, Szymczyk, Wagner, Zarzycki, Zduńczyk. Head coach: Szlagor * 1972 Munich — 9th place *: Ambroziak, Bebel, Bosek, Gawłowski, Gościniak, Iwaniak, Karbarz, Skorek, Stefański, Such, Świderek, Zarzycki. Head coach: Szlagor * 1976 Montreal — Gold medal *: Bebel, Bosek, Gawłowski, Karbarz, Lubiejewski, Łasko, Rybaczewski, Sadalski, Skorek (), Stefański, Wójtowicz, Zarzycki. Head coach: Wagner * 1980 Moscow — 4th place *: Bosek, Czaja, Drzyzga, Gawłowski, Jarosz, Kanicki, Kustra, Łasko, Malinowski, Molenda, Nalazek, Wójtowicz. Head coach: Skiba 1984 to 1992 — did not participate * 1996 Atlanta — 11th place *: Dacewicz, Gruszka, Janczak, Nowak, Prygiel, Roman (), A. Stelmach, K. Stelmach, Szyszko, Śmigiel, Urbanowicz, Zagumny. Head coach: Krebok 2000 — did not participate * 2004 Athens — 5th place *: A. Stelmach, Gruszka, Zagumny (), Murek, Ignaczak, Kadziewicz, Rybak, Świderski, Gabrych, Gołaś, Bąkiewicz, Szczerbaniuk. Head coach: Gościniak * 2008 Beijing — 5th place *: Winiarski, Gruszka (), Pliński, Zagumny, Wika, Wlazły, Kadziewicz, Woicki, Świderski, Gierczyński, Ignaczak, Możdżonek. Head coach: Lozano * 2012 London — 5th place *: Nowakowski, Winiarski, Kosok, Zagumny, Kurek, Jarosz, Bartman, Kubiak, Ruciak, Żygadło, Ignaczak, Możdżonek (). Head coach: Anastasi ==World Championship== * 1949 Czechoslovakia — 4th place *: Antczak, Grodecki, Frontczak, T. Maliszewski, W. Maliszewski, Markowski, Piechura, Piotrowski, Plejewski, Policewicz, Zaborzecki. Head coach: Kraus * 1952 Soviet Union — 7th place *: Antczak, Czerwiński, Flont, Grodecki, Jarosiński, Radomski, Śliwka, Pindelski, Wleciał, Woluch, Policewicz, Zabokrzecki. Head coach: Piotrowski * 1956 France — 4th place *: Czerski, Feliszewski, Mazurek, Pindelski, Radomski, Rutkowski, Szlagor, Szołomicki, Szperling, Szuppe, Wleciał, Woluch. Head coach: Busz * 1960 Brazil — 4th place *: Cieniuch, Gediga, Rusek, Rutkowski, Schlief, Sierszulski, Siwek, Suchanek, Szperling, Tietianiec, Tomaszewski. Head coach: Grochowski * 1962 Soviet Union — 6th place *: Flisiuk, Gediga, Kiełpiński, Kołodziejczyk, Pałaszewski, Rutkowski, Schlief, Sierszulski, Siwek, Szperling, Tietianiec, Tomaszewski. Head coach: Grochowski * 1966 Czechoslovakia — 6th place *: Ambroziak, Kiełpiński, Paszkiewicz, Rusek, Rutkowski, Sierszulski, Siwek, Skorek, Suchanek, Szymczyk, Tomaszewski, Wagner. Head coach: Szlagor * 1970 Bulgaria — 5th place * 1974 Mexico — Gold medal *: Bosek, Czaja, Gawłowski, Gościniak, Karbarz, Rybaczewski, Sadalski, Skiba, Skorek (), Stefański, Wójtowicz, Zarzycki. Head coach: Wagner * 1978 Italy — 8th place *: Bebel, Bosek, Czaja, Ciaszkiewicz, Drzyzga, Gawłowski, Karbarz, Kłos, Łasko, Molenda, Nalazek, Stefański. Head coach: Welcz * 1982 Argentina — 6th place * 1986 France — 9th place 1990 to 1994 — did not participate * 1998 Japan — 17th place * 2002 Argentina — 9th place *: Gruszka, Nowak, Murek (), Wagner, Ignaczak, Serafin, Prygiel, Stancelewski, Świderski, Papke, Lipiński, Gołaś. Head coach: Wspaniały * 2006 Japan — Silver medal *: Winiarski, Gruszka, Pliński, Zagumny, Grzyb, Żygadło, Wlazły, Kadziewicz, Szymański, Świderski, Gacek, Bąkiewicz. Head coach: Lozano * 2010 Italy — 13th place *: Nowakowski, Winiarski, Gruszka (), Zagumny, Kurek, Bartman, Wlazły, Czarnowski, Ruciak, Ignaczak, Możdżonek, Łomacz. Head coach: Castellani * 2014 Poland — Gold medal *: Nowakowski, Winiarski (), Konarski, Zagumny, Kłos, Wrona, Wlazły, Drzyzga, Kubiak, Ignaczak, Zatorski, Możdżonek, Mika, Buszek. Head coach: Antiga ==World Cup== * 1965 Poland — Silver medal *: Ambroziak, Kiełpiński, Paszkiewicz, Rusek, Rutkowski, Sierszulski, Siwek, Skorek, Suchanek, Szczepanowski, Szymczyk, Tomaszewski. Head coach: Kraus * 1969 East Germany — 8th place *: Bebel, Bosek, Gawłowski, Jasiukiewicz, Paszkiewicz, Radomski, Rogowicz, Skiba, Tyborowski, Wagner, Zduńczyk. Head coach: Szlagor * 1977 Japan — 4th place * 1981 Japan — 4th place 1985 to 2007 — did not participate * 2011 Japan — Silver medal *: Nowakowski, Winiarski, Zagumny, Kurek, Jarosz, Bartman, Wiśniewski, Kubiak, Ruciak, Żygadło, Ignaczak, Zatorski, Możdżonek (), Czarnowski. Head coach: Anastasi * 2015 Japan — did qualify *: Nowakowski, Konarski, Kurek, Kłos, Drzyzga, Łomacz, Kubiak (), Gacek, Zatorski, Możdżonek, Buszek, Bieniek, Mika, Szalpuk. Head coach: Antiga ==European Championship== 1948 — did not participate * 1950 Bulgaria — 6th place *: Antczak, Bińkowski, Grodecki, Frontczak, Łaszcz, Maliszewski, Piechura, Pindelski, Policewicz, Zaborzecki. Head coach: Kraus 1951 — did not participate * 1955 Romania — 6th place *:Adamczyk, Feliszewski, Kurpios, Lewkowicz, Poleszczuk, Radomski, Rutkowski, Schlief, Szołomnicki, Szuppe, Wleciał, Woluch. Head coach: Michniewski * 1958 Czechoslovakia — 6th place *: Gediga, Mazurek, Poleszczuk, Radomski, Rutkowski, Schlief, Sierszulski, Siwek, Szlagor, Szołomnicki, Szperling, Tietianiec. Head coach: Śliwka * 1963 Romania — 6th place *: Ambroziak, Gediga, Kiełpiński, Paszkiewicz, Rutkowski, Rusek, Sierszulski, Siwek, Suchanek, Szczepanowski, Tomaszewski, Wagner. Head coach: Grochowski * 1967 Turkey — Bronze medal *: Ambroziak, Gościniak, Jasiukiewicz, Paszkiewicz, Rutkowski, Skiba, Sierszulski, Siwek, Skorek, Szymczyk, Wagner, Zduńczyk. Head coach: Szlagor * 1971 Italy — 6th place * 1975 Yugoslavia — Silver medal *: Bosek, Czaja, Gawłowski, Iwaniak, Jasiukiewicz, Kustra, Lubiejewski, Łasko, Rybaczewski, Sadalski, Stefański, Wójtowicz. Head coach: Wagner * 1977 Finland — Silver medal *: Bebel, Bosek, Ciaszkiewicz, Czaja, Gawłowski, Jarosz, Karbarz, Kustra, Molenda, Sadalski, Stefański, Wójtowicz. Head coach: Welcz * 1979 France — Silver medal * 1981 Bulgaria — Silver medal * 1983 East Germany — Silver medal * 1985 Netherlands — 4th place 1987 — did not participate * 1989 Sweden — 7th place * 1991 Germany — 7th place * 1993 Finland — 7th place * 1995 Greece — 6th place 1997 to 1999 — did not participate * 2001 Czech Republic — 5th place *: Stelmach, Gruszka, Nowak, Zagumny, Murek, Michalczyk, Stancelewski, Świderski, Papke, Szczerbaniuk, Musielak, Wójcik. * 2003 Germany — 5th place *: Gruszka, Nowak, Murek, Zagumny, Ignaczak, Szczerbaniuk, Prygiel, Dacewicz, Świderski, Papke, Lipiński, Bąkiewicz. * 2005 Italy/Serbia and Montenegro — 5th place *: Gruszka, Gołaś, Murek, Żygadło, Gacek, Grzyb, Wlazły, Pliński, Świderski, Szymański, Winiarski, Woicki. Head coach: Lozano * 2007 Russia — 11th place *: Winiarski, Pliński, Zagumny, Kurek, Grzyb, Prygiel, Żygadło, Kadziewicz, Szymański, Świderski, Gacek, Bąkiewicz. Head coach: Lozano * 2009 Turkey — Gold medal *: Nowakowski, Gruszka (), Pliński, Zagumny, Kurek, Jarosz, Bartman, Gromadowski, Woicki, Ruciak, Gacek, Ignaczak, Bąkiewicz, Możdżonek. Head coach: Castellani * 2011 Austria/Czech Republic — Bronze medal *: Nowakowski, Zatorski, Gruszka (), Kosok, Kłos, Kurek, Jarosz, Mika, Drzyzga, Kubiak, Ruciak, Żygadło, Ignaczak, Możdżonek. Head coach: Anastasi * 2013 Denmark/Poland — 9th place *: Nowakowski, Winiarski, Kurek, Jarosz, Bociek, Wiśniewski, Drzyzga, Kubiak, Ruciak, Żygadło, Zatorski, Możdżonek (). Head coach: Anastasi * 2015 Bulgaria/Italy - did qualify ==World Grand Champions Cup== 1993 to 2005 — did not participate * 2009 — 4th *: Nowakowski, Łomacz, Pliński, Kurek, Jarosz, Bartman, Gromadowski, Woicki, Ruciak, Gacek, Bąkiewicz (), Możdżonek. Head coach: Castellani 2013 — did not participate ==World League== 1990 to 1997 — did not participate * 1998 Milan — 10th place * 1999 Mar del Plata — 8th place * 2000 Rotterdam — 8th place * 2001 Katowice — 7th place * 2002 Belo Horizonte — 5th place *: Siezieniewski, Gruszka, Nowak, Zagumny (), Murek, Wagner, Musielak, Prygiel, Stancelewski, Świderski, Gołaś, Szczerbaniuk. Head coach: Wspaniały * 2003 Madrid — 9th place *: Stelmach, Siezieniewski, Gruszka, Nowak, Zagumny, Murek, Żygadło, Ignaczak, Jurkiewicz, Prygiel, Michalczyk, Kadziewicz, Świderski, Rybak, Lipiński, Gołaś, Bąkiewicz, Szczerbaniuk. Head coach: Wspaniały * 2004 Rome — 7th place *: Stelmach, Winiarski, Gruszka, Dacewicz, Zagumny, Murek, Grzyb, Ignaczak, Oczko, Wlazły, Kadziewicz, Gabrych, Świderski, Papke, Ruciak, Gołaś, Bąkiewicz, Szczerbaniuk. Head coach: Gościniak * 2005 Belgrade — 4th place *: Stelmach, Winiarski, Gruszka (), Zagumny, Murek, Grzyb, Ignaczak, Szymański, Wlazły, Kadziewicz, Świderski, Gołaś. Head coach: Lozano * 2006 Moscow — 7th place * 2007 Katowice — 4th place *: Winiarski, Gruszka (), Pliński, Zagumny, Grzyb, Żygadło, Wlazły, Kadziewicz, Szymański, Świderski, Gacek, Bąkiewicz. Head coach: Lozano * 2008 Rio de Janeiro — 5th place *: Winiarski, Gruszka (), Pliński, Zagumny, Wika, Wlazły, Kadziewicz, Woicki, Świderski, Gierczyński, Ignaczak, Możdżonek. Head coach: Lozano * 2009 Belgrade — 9th place *: Nowakowski, Łomacz, Jarosz, Kurek, Grzyb, Bartman, Gromadowski, Kadziewicz, Woicki, Ruciak, Ignaczak, Bąkiewicz (), Możdżonek, Zatorski. Head coach: Castellani * 2010 Córdoba — 10th place¹ *: Winiarski, Gruszka, Pliński, Zagumny, Kurek, Jarosz, Kłos, Bartman, Wlazły, Żygadło, Zatorski, Mika, Ruciak, Gacek, Czarnowski, Bąkiewicz, Możdżonek, Łomacz. Head coach: Castellani * 2011 Gdańsk — Bronze medal *: Nowakowski, Gruszka (), Kosok, Kłos, Kurek, Jarosz, Bartman, Woicki, Kubiak, Ruciak, Żygadło, Ignaczak, Zatorski, Bąkiewicz, Możdżonek. Head coach: Anastasi * 2012 Sofia — Gold medal *: Nowakowski, Winiarski, Kosok, Zagumny, Kurek, Jarosz, Bartman, Wiśniewski, Kubiak, Ruciak, Żygadło, Ignaczak, Zatorski, Możdżonek (). Head coach: Anastasi * 2013 Mar del Plata — 11th place¹ *: Nowakowski, Winiarski, Konarski, Kosok, Kurek, Jarosz, Wrona, Bartman, Drzyzga, Kubiak, Ruciak, Żygadło, Ignaczak, Zatorski, Możdżonek (). Head coach: Anastasi * 2014 Florence — Overall 7th place¹ *: Nowakowski, Winiarski (), Konarski, Kurek, Kłos, Wrona, Bociek, Wlazły, Drzyzga, Woicki, Ruciak, Żygadło, Ignaczak, Zatorski, Ferens, Mika, Buszek, Perłowski. Head coach: Antiga * 2015 Rio de Janeiro — G1 FR 4th place and Overall 3rd place *: Nowakowski, Konarski, Kurek, Wrona, Drzyzga, Łomacz, Kubiak (), Gacek, Zatorski, Możdżonek, Mika, Buszek, Bieniek, Szalpuk. Head coach: Antiga ¹ players during all matches of intercontinental round ==European League== * 2014 – 6th place¹ *: Nowakowski, Żurek, Stępień, Kaczyński, Bołądź, Muzaj, Filip, Kędzierski, Stolc, Bieniek, Hain, Dryja, Kowalski. Head coach: Kowal. * 2015 Poland – Bronze medal¹ *: Dryja, Nowakowski, Kędzierski, Ferens, Włodarczyk, Romać, Buchowski, Pająk, Grzechnik, Wojtaszek, Filip, Bednorz. Head coach: Kowal ¹ Polish national team B ==European Games== * 2015 Baku — 4th place¹ *: Dryja, Nowakowski, Kędzierski, Kosok, Ferens, Konarski, Kowalski, Romać, Buchowski, Śliwka, Woicki, Grzechnik, Szalpuk, Wojtaszek. Head coach: Kowal ¹ Polish national team B ==Memorial of Hubert Jerzy Wagner== * 2003 Olsztyn – Silver medal *: Zagumny, Nowak, Rybak, Świderski, Szczerbaniuk, Papke, Gołaś, Szymański, Ignaczak, Prygiel, Murek, Bąkiewicz, Gruszka, Lipiński, Dacewicz. Head coach: Wspaniały * 2004 Olsztyn *: Team A – Silver medal: Stelmach, Gabrych, Murek, Gruszka, Gołaś, Szczerbaniuk, Ignaczak, Rybak, Bąkiewicz, Świderski, Kadziewicz. Head coach: Gościniak *: Team B – 5th place: Grzyb, Ruciak, Wlazły, Olejniczak, Winiarski, Prygiel, Żygadło, Wika, Oczko, Terlecki. Head coach: Kowalczyk * 2005 Olsztyn/Iława – Silver medal *: Zagumny, Stelmach, Żygadło, Murek, Świderski, Grzyb, Kadziewicz, Szymański, Ignaczak, Gacek, Wlazły, Winiarski, Pliński, Gruszka, Gołaś, Jurkiewicz. Head coach: Lozano * 2006 Ostróda/Iława/Olsztyn *: Team A – Gold medal: Pilarz, Winiarski, Gruszka, Pliński, Zagumny, Murek, Grzyb, Prygiel, Żygadło, Wlazły, Kadziewicz, Szymański, Świderski, Perłowski, Gacek, Ignaczak, Bąkiewicz, Możdżonek. Head coach: Lozano *: Team B – 6th place: Woicki, Kozłowski, Olejniczak, Patucha, Lach, Pęcherz, Czarnowski, Kosok, Domonik, Kaczmarek, Gromadowski, Tomczyk, Rusek, Neroj. Head coach: Felczak * 2007 Olsztyn/Elbląg/Ostróda – Bronze medal *: Zagumny, Żygadło, Wlazły, Szymański, Prygiel, Gruszka, Świderski, Winiarski, Bąkiewicz, Kurek, Kadziewicz, Pliński, Możdżonek, Grzyb, Gacek, Ignaczak. Head coach: Lozano * 2008 Olsztyn – Gold medal *: Woicki, Żygadło, Wlazły, Gruszka, Świderski, Wika, Gierczyński, Nowakowski, Pliński, Możdżonek, Bąkiewicz, Ignaczak. Head coach: Lozano * 2009 Łódź – Gold medal *: Nowakowski, Gruszka, Pliński, Zagumny, Kurek, Wika, Jarosz, Bartman, Gromadowski, Kadziewicz, Woicki, Ruciak, Gacek, Ignaczak, Bąkiewicz, Możdżonek, Łomacz. Head coach: Castellani * 2010 Bydgoszcz – Bronze medal *: Nowakowski, Winiarski, Gruszka, Pliński, Zagumny, Kurek, Jarosz, Kłos, Bartman, Wlazły, Żygadło, Zatorski, Mika, Ruciak, Gacek, Czarnowski, Bąkiewicz, Możdżonek, Łomacz. Head coach: Castellani * 2011 Katowice – 4th place *: Nowakowski, Zatorski, Gruszka, Kosok, Kłos, Kurek, Jarosz, Bartman, Drzyzga, Świderski, Ruciak, Żygadło, Ignaczak, Możdżonek, Mika, Kubiak. Head coach: Anastasi * 2012 Zielona Góra – Gold medal *: Zagumny, Nowakowski, Zatorski, Gruszka, Kosok, Kłos, Kurek, Jarosz, Bartman, Drzyzga, Winiarski, Ruciak, Żygadło, Ignaczak, Możdżonek, Kubiak. Head coach: Anastasi * 2013 Płock – Gold medal *: Żygadło, Bociek, Winiarski, Kubiak, Możdżonek, Nowakowski, Zatorski, Jarosz, Drzyzga, Włodarczyk, Wojtaszek. Head coach: Anastasi * 2014 Kraków – Silver medal *: Nowakowski, Winiarski, Konarski, Zagumny, Kłos, Wrona, Kubiak, Wlazły, Drzyzga, Ignaczak, Zatorski, Możdżonek, Buszek, Mika. Head coach: Antiga * 2015 Toruń – Gold medal *: Nowakowski, Konarski, Kurek, Kłos, Drzyzga, Łomacz, Kubiak (), Gacek, Zatorski, Możdżonek, Buszek, Bieniek, Szalpuk, Włodarczyk. Head coach: Antiga ==Individual awards for players== ==Current roster== ===Team A=== Updated: 25 August 2015 Represent Poland at:: * 2015 FIVB World League * 2015 FIVB World Cup * 2015 European Championship Head coach: Stéphane Antiga Assistant: Philippe Blain Coach of physical preparation: Wojciech Janas Scoutman: Oskar Kaczmarczyk Robert Kaźmierczak Doctor: Jan Sokal Physiotherapist: Paweł Brandt Tomasz Pieczko Manager: Hubert Tomaszewski No. Name Date of birth Height Weight Spike Block 2015 club align=left align=right align=left align=right align=left align=right align=left align=right 11 align=left align=right 12 align=left align=right 13 () align=right 15 align=left align=right 17 align=left align=right 18 align=left align=right 20 align=left align=right 21 align=left align=right 23 align=left align=right 25 align=left align=right ===Team B=== Represent Poland at:: * 2015 European Games * 2015 European League Head coach: Andrzej Kowal Assistant: Michał Gogol No. Name Date of birth Height Weight Spike Block 2015 club align=left align=right align=left align=right align=left align=right align=left align=right align=left align=right align=left align=right align=left align=right align=left align=right 10 align=left align=right 11 align=left align=right 12 () align=right 13 align=left align=right 14 align=left align=right 16 align=left align=right 17 align=left align=right 18 align=left align=right 20 align=left align=right 22 align=left align=right == Coach History == HEAD COACHES * 1948–1949 – Romuald Wirszyłło * 1949–1952 – Zygmunt Kraus * 1952–1953 – Wiesław Piotrowski * 1953–1954 – Zygmunt Kraus * 1954–1956 – Leonard Michniewski * 1956–1958 – Jacek Busz * 1958–1959 – Józef Śliwka * 1959–1964 – Gwidon Grochowski * 1964–1966 – Zygmunt Kraus * 1966–1973 – Tadeusz Szlagor * 1973–1976 – Hubert Jerzy Wagner * 1976–1979 – Jerzy Welcz * 1979–1983 – Aleksander Skiba * 1983–1986 – Hubert Jerzy Wagner * 1986–1988 – Stanisław Gościniak * 1988–1990 – Leszek Milewski * 1990–1992 – Edward Skorek * 1992–1993 – Zbigniew Zarzycki * 1993–1994 – Ryszard Kruk * 1994–1996 – Wiktor Krebok * 1996–1998 – Hubert Jerzy Wagner * 1998–2000 – Ireneusz Mazur * 2000–2001 – Ryszard Bosek * 2001–2003 – Waldemar Wspaniały * 2003–2004 – Stanisław Gościniak * 2005–2008 – Raúl Lozano * 2009–2010 – Daniel Castellani * 2011–2013 – Andrea Anastasi * 2014–Present Stéphane Antiga ASISSTANTS * 2011–2013 – Andrea Gardini * 2014–Present Philippe Blain ==Gallery== ===FIVB World League 2011=== * July 8, 2011 at Ergo Arena, Gdańsk - Poland vs Argentina File:World League Finals Day 3 (5918485734).jpg File:World League Finals Day 3 (5918492956).jpg File:World League Finals Day 3 (5918502466).jpg File:World League Finals Day 3 (5918507250).jpg File:World League Finals Day 3 (5918521938).jpg File:World League Finals Day 3 (5918542474).jpg * July 9, 2011 at Ergo Arena, Gdańsk - Poland vs Russia File:World Leauge Semifinals (5921306867).jpg File:World Leauge Semifinals (5921309967).jpg File:World Leauge Semifinals (5921332135).jpg File:World Leauge Semifinals (5921880596).jpg * July 10, 2011 at Ergo Arena, Gdańsk - Poland vs Argentina File:World League Final 2011 (5927616804).jpg File:World League Final 2011 (5927642320).jpg File:World League Final 2011 (5927664678).jpg File:World League Final 2011 (5927684734).jpg File:World League Final 2011 (5927689404).jpg File:World League Final 2011 (5927114249).jpg File:World League Final 2011 (5927120815).jpg * July 10, 2011 at Ergo Arena, Gdańsk - medal ceremony (bronze) File:World League Final 2011 (5927876788).jpg File:World League Final 2011 (5927100957).jpg File:World League Final 2011 (5927893012).jpg File:World League Final 2011 (5927884368).jpg File:World League Final 2011 (5927902380).jpg ===FIVB World League 2012=== * June 1, 2012 at Spodek, Katowice File:Żygadło i Winiarski.jpg File:Winiarski, Wiśniewski, Kurek.jpg File:Kubiak i Bartman.jpg File:Żygadło, Kosok, Kubiak blok.jpg File:Polscy siatkarze LŚ2012.jpg * June 3, 2012 at Spodek, Katowice File:Radość polskich siatkarzy.jpg ===FIVB World League 2013=== * July 5, 2013 at Spodek, Katowice File:Bartosz Kurek (9290654771).jpg File:Bartosz Kurek (9293461742).jpg File:Bartosz Kurek (9290648831).jpg ==References== ==Other websites== *Official website *FIVB profile Category:National volleyball teams Category:National sports teams of Poland",
 "title": "Poland men's national volleyball team"
}