{
 "id": "484741",
 "text": "Pam Muñoz Ryan (born December 25, 1951) is an American children's writer. She was born on December 25, 1951, in Bakersfield, California. She is the daughter of Don Bell and Esperanza Muñoz. She is the eldest of three sisters. She took much of her inspiration for her books from her family and human rights in history. For example, the idea for Esperanza Rising came from her grandmother's experiences immigrating to America. When Marian Sang shows the discrimination against African Americans in the theater. She has written two novels, three books in the \"Doug\" series, and 13 picture books.\"Pam Muñoz Ryan.\" The Writers Directory. Detroit: St. James Press, 2014. Biography in Context. Web. Accessed 23 Mar. 2015. == Early life == As a child, Ryan spent many summers biking to the local library. \"The library became my favorite hangout because my family didn't have a swimming pool and the library was air- conditioned. That's how I got hooked on reading and books,\" she said in an interview.\"Pam Muñoz Ryan.\" Authors and Artists for Young Adults. Vol. 47. Detroit: Gale, 2003. Biography in Context. Web. Accessed 23 Mar. 2015. However, she did not realize until later that she wanted to be a writer. During her time as a writer she won over 70 awards for all her books. == Esperanza Rising == When a rich young girl named Esperanza's father dies, she and her mother are forced to move from Mexico to America. Esperanza and her mother find work with their family as farm workers. Esperanza and her mother are in fear of being deported. Although the conditions they live are bad, they could imagine how much worse their life would be in Mexico. On this journey Esperanza learns more about herself and the world around her. == Books == *One Hundred Is a Family, illustrated by Benrei Huang, Hyperion Books (New York, NY), 1994 *(With Jerry Pallotta) The Crayon Counting Board Book, illustrated by Frank Mazzola, Jr., Charlesbridge (Watertown, MA), 1996 *The Flag We Love, illustrated by Frank Masiello, Charlesbridge (Watertown, MA), 1996 *Armadillos Sleep in Dugouts: And Other Places Animals Live, illustrated by Diane de Groat, Hyperion Books (New York, NY), 1997 *Pinky Is a Baby Mouse: And Other Baby Animal Names, illustrated by Diane de Grout, Hyperion Books (New York, NY), 1997 *California, Here We Come!, illustrated by Kay Salem, Charlesbridge (Watertown, MA), 1997 *Riding Freedom (novel), illustrated by Brian Selznick, Scholastic Press (New York, NY), 1998 *Amelia and Eleanor Go for a Ride, illustrated by Brian Selznick, Scholastic Press (New York, NY), 1999 *Esperanza Rising (novel), Scholastic Press (New York, NY), 1998 *Hello, Ocean, illustrated by Mark Astrella, Charlesbridge (Watertown, MA), 2001 *Mice and Beans, illustrated by Joe Cepeda, Scholastic Press (New York, NY), 2001 *Mud Is Cake, illustrated by David McPhail, Hyperion Books (New York, NY), 2002 *When Marian Sang: The True Recital of Marian Anderson, illustrated by Brian Selznick, Scholastic Press (New York, NY), 2002 *How Do You Raise a Raisin?, illustrated by Craig Brown, Charlesbridge (Watertown, MA), 2002 \"DOUG\" SERIES; BASED ON JIM JENKINS'S CARTOON CHARACTER 2002 *Doug Counts Down, illustrated by Matthew C. Peters, Disney Press (New York, NY), 1998 *Doug's Treasure Hunt, illustrated by Jumbo Pictures, Disney Press (New York, NY), 1998 *Funnie Family Vacation, illustrated by William Presing and Tony Curanaj, Disney Press (New York, NY), 1998 ==References== *\"Pam Muñoz Ryan.\" The Writers Directory. Detroit: St. James Press, 2014. Biography in Context. Web. Accessed 23 Mar. 2015. *\"Pam Muñoz Ryan.\" Authors and Artists for Young Adults. Vol. 47. Detroit: Gale, 2003. Biography in Context. Web. Accessed 23 Mar. 2015. *Cech, John. \"Literature for children.\" World Book Advanced. World Book, 2015. Web. Accessed 23 Mar. 2015. *Scholastic Authors Online, http://teacher.scholastic.com/ (April 10, 2002), \"Pam Muñoz Ryan's Interview Transcript\"; (April 15, 2002), \"Meet Pam Muñoz Ryan.\" Category:Writers from California Category:1951 births Category:Living people",
 "title": "Pam Muñoz Ryan"
}