{
 "id": "484737",
 "text": "Linda Sue Park is a Korean-American children’s literature poet and novelist. Park was born on March 25, 1960, in Urbana, Illinois. She was educated at Stanford University, California; Trinity College, Dublin; and Birkbeck College, London. Many of her books are written about Korean ethnicity. She was a food journalist from 1985 to 1990. She taught English as a second language from 1985 to 2001. Park enjoys cooking, reading, and watching movies and sports in her free time.\"Linda Sue Park.\" Authors and Artists for Young Adults. Vol. 49. Detroit: Gale, 2003. Biography in Context. Web. Accessed 23 Mar. 2015. ==Publications== * Seesaw Girl; 1999 * The Kite Fighters; 2000 * A Single Shard; 2001 * When My Name Was Keoko: A Novel of Korea in World War II; 2002 * The Firekeeper’s Son; 2004 * Mung-mung: A Foldout Book of Animal Sounds; 2004 * What Does Bunny See? A Book of Colors and Flowers; 2005 * Project Mulberry; 2005 * Bee-bim Bop!; 2008 * Archer’s Quest; 2006 * Tap Dancing on the Roof: Sijo; 2007 * Keeping Score; 2008 * A Long Walk to Water; 2010 * Storm Warning; 2010 * Trust No One; 2012 ==Awards== * 100 Titles for Reading and Sharing designation, New York Public Library: 1999, for Seesaw Girl and 2004, for The Firekeeper's Son * 2005, for Bee-bim Bop! * Newbery Medal for Project Mulberry * Jane Addams Peace Prize Honor Award, 2003, for A Single Shard; * Irma S and James H. Black Award finalist 2004, for When My Name Was Keoko * 2004, and CCBC Choice designation, and Bank Street College Best Children's Book of the Year designation, both 2005, for The Firekeeper's Son * Chicago Tribune Young-Adult Fiction Prize, and Notable Books for a Global Society designation, and Bank Street College Best Children's Book of the Year designation, and CCBC Choice designation 2005 and 2006 for Project Mulberry * ALA Notable Children's Books designation 2006, for Yum! Yuck! * Bank Street College Best Children's Book of the Year designation 2006, for What Does Bunny See? * Lion and the Unicorn Prize for Excellence in North American Poetry (2007), Book Sense Award finalist (2007), ABC Children's Booksellers Choice Award (2007), ALA Notable Book designation, 2008, nominated for various state reading association awards lists for Tap Dancing on the Roof ==References== * Carlson, Ann D. \"Park, Linda Sue.\" World Book Student. World Book, 2015. Web. Accessed 23 Mar. 2015. * \"Linda Sue Park.\" Contemporary Authors Online. Detroit: Gale, 2009. Biography in Context. Web. Accessed 23 Mar. 2015. Category:Writers from Illinois Category:1960 births Category:Living people",
 "title": "Linda Sue Park"
}