{
 "id": "484756",
 "text": "Elaine Lobl Konigsburg (February 10, 1930 – April 19, 2013) was an American writer. ==Early life== Elaine Lobl Konigsburg was born on February 10, 1930 in New York. She was the daughter of Adolph, a businessman, and Beulah (Klein) Lobl. E.L. Konigsburg married a man named David Konigsburg in 1952. With David, she had three children, named Paul, Laurie, and Ross. She went to Carnegie Mellon University and the University of Pittsburgh. Konigsburg was a follower of the Jewish religion. Konigsburg is the author of many children’s books, some including The Outcast of 19 Schuyler Place, From the Mixed Up Files of Mrs. Basil E. Frankweiler, and Silent to the Bone. She began her career as an author later in her life. She left teaching after the birth of her first child in 1955, and returned to teach again in 1960. She stopped teaching again two years later, to move to New York for her husband’s job. With all of her kids at school, she had time to begin her writing career. ==Accomplishments== E. L Konigsburg is the only author to have two books on the Newbery List at one time. In addition, in 1967, her book was honored in the “Book Week Children’s Festival”. She also won the William Allen White award for From the Mixed Up Files of Mrs. Basil E. Frankweiler. ==Books== * Jennifer, Hecate, Macbeth, William McKinley, and Me, Elizabeth * From the Mixed-Up Files of Mrs. Basil E. Frankweiler * About the B'nai Bagels. New York, Atheneum * A Proud Taste for Scarlet and Miniver * The Dragon in the Ghetto Caper * The Second Mrs. Giaconda * Father's Arcane Daughter * Throwing Shadows (stories) * Journey to an 800 Number * Up from Jericho Tel * Samuel Todd's Book of Great Colors * Samuel Todd's Book of Great Inventions * Amy Elizabeth Explores Bloomingdale's * T-Backs, T-Shirts, COAT, and Suit * The View from Saturday ==Sources== * \"E(laine) L(obl) Konigsburg.\" Major Authors and Illustrators for Children and Young Adults. Detroit: Gale, 2002.Biography in Context. Web. 23 Mar. 2015 E(laine) L(obl) Konigsburg.\" St. James Guide to Children's Writers. Gale, 1999. Biography in Context. Web. 23 Mar. 2 2015 Category:Writers from New York (state) Category:Newbery Medal winning authors",
 "title": "E. L. Konigsburg"
}