{
 "id": "484743",
 "text": "Jennifer L. Holm is an American author. Her books include the Babymouse series, Middle School is Worse Than Meatloaf, and The Fourteenth Goldfish. ==Early life== Holm was born in California in 1968. She grew up in Audubon, Pennsylvania. Her father, William W. Holm, was a pediatrician. Her mother, Beverly A. Holm, was a pediatric nurse. She married Jonathan Hamel, who was both a writer and a computer programmer. She went to Dickinson College in 1990. She has two children, Will and Millie May. ==Books== * Turtle in Paradise * Our Only May Amelia * Penny From Heaven * Boston Jane: An Adventure * Boston Jane: Wilderness Days * Boston Jane: The Claim * Babymouse: Queen of the World! * Babymouse: Our Hero! * Babymouse: Heartbreaker * Babymouse: Rock Star * Babymouse: Beach Babe! * Babymouse: Puppy Love * Babymouse: Camp Babymouse * Babymouse: Skater Girl * Babymouse: Monster Mash, * Babymouse for President * The Fourteenth Goldfish * Middle School is Worse than Meatloaf * The Postman Always Brings Mice * To Scratch a Thief * You Only Have Nine Lives * The Creek ==Awards== Her awards include: For Our Only May Amelia * Parents’ Choice Silver Award * The Best Book of the Year Designation * Newbery Honor * Notable Book Designation * American Library Association (ALA) * Notable Children’s Trade Book in the Field of Social Studies Designation * National Council for the Social Studies * Utah Book Award * Dorothy Canfield Fisher Children’s Book Award For Boston Jane: An Adventure * Parent’s Guide to Children’s Media Award * ALA Best Books for Young Adults citation * Book Sense 76 Pick For Penny From Heaven * Newbery Honor For Baby Mouse: Queen of the World! * Gryphon Award * ALA Notable Children’s Book * New York Book Show Awards For Baby Mouse for President * Will Eisner Comic Industry Award for best publication for early readers ==References== *\"Jennifer L. Holm.\" Contemporary Authors Online. Detroit: Gale, 2013. Biography in Context. Web. 23 Mar. 2015. Category:Writers from California Category:1968 births Category:Living people",
 "title": "Jennifer L. Holm"
}