{
 "id": "484749",
 "text": "Judy Blume is an American author. ==Early life== Judy Blume was born on February 12, 1936 to Rudolph and Esther Sussman. She was born in Elizabeth, New Jersey. Blume graduated with honors from her high school, Battin, and went on to Boston University. She was forced to quit college after a year because of a disease that caused her to have too many large white blood cells. She then transferred to New York University where she graduated in 1961 with a Bachelor of Science in early childhood education. She then had two children, Randy Lee and Lawrence Andrew. Many of her books are about the challenge pre- teens face when growing up in middle-class America. ==Publications== Judy Blume has written many books, mostly focusing on middle-class children and the problems they face in their lives. Her most famous piece is Are You There God? It’s Me, Margaret. She started out writing books meant only for adults, such as Wifey, Smart noen, and Summer Sisters. As time passed, Blume began to write books for children, including: * The One in the Middle is the Green Kangaroo * Iggie's House * Are You There God? It's Me, Margaret * Then Again, Maybe I Won't * Freckle Juice * Tales of a Fourth Grade Nothing * It's Not the End of the World * Otherwise Known as Sheila the Great * Deenie * Blubber * Forever * Starring Sally J. Freedman as Herself * Superfudge * The Judy Blume Diary: The Place to Put Your Own Feelings * Tiger Eyes * The Pain and the Great One * Just as Long as We're Together * The Judy Blume Memory Book * Fudge-A-Mania * Here's to You, Rachel Robinson * Places I Never Meant to Be (editor) * Double Fudge * Soupy Saturdays with the Pain and the Great One * Going, Going, Gone! With the Pain and the Great One ==Awards and publisher== Her books are published by Bradbury Press. Throughout her lifetime she has received many awards. Some of these include, the Margaret A. Edwards Award for Lifetime Achievement and the Library of Congress Living Legends award. ==References== * \"Judy Blume.\" Newsmakers. Detroit: Gale, 1998. Biography in Context. Web. 23 Mar. 2015. * Anderson, Celia Catlett. \"Blume, Judy.\" World Book Advanced. World Book, 2015. Web. 23 Mar. 2015. Category:1936 births Category:Living people Category:New York University alumni Category:Writers from New Jersey",
 "title": "Judy Blume"
}