{
 "id": "484758",
 "text": "Cynthia Kadohata is an American author, who has written many well known novels. A quote that expresses Cynthia Kadohata’s connection to writing and her books is “My memories become their memories, and their memories become mine.” ==Major accomplishments== She won the 2005 Newbery medal, and she wrote a short fiction that has been seen in the New Yorker, Grand Street, and Pennsylvania Review. Her autobiographical novel on Japanese American life is also widely known and highly reviewed. Cynthia also earned a journalism degree at University of Southern California. ==Early life/career== Cynthia Kadohata was born on July 02, 1956 in Chicago, Illinois. Her family moved often to places including Illinois, Michigan, Georgia, Arkansas, and California, and this traveling and the ability to see many new places gave her inspiration for many of her books, especially The Floating World. In fact, in many parts Cynthia Kadohata’s actual life inspire and encourage her to write. Later in life, Cynthia adopted her son, Sammy. She was previously married but divorced in 2000. ==Written works== ===Novels=== * The Floating World, Viking (New York, NY), 1989. * In the Heart of the Valley of Love, Viking (New York, NY), 1992. ===Young-adult novels=== * Kira-Kira, Atheneum Books for Young Readers (New York, NY), 2004. * Weedflower, Atheneum Books for Young Readers (New York, NY), 2006. * Cracker! The Best Dog in Vietnam, Atheneum Books for Young Readers (New York, NY), 2007. * Outside Beauty, Atheneum Books for Young Readers (New York, NY), 2008. * A Million Shades of Gray, Atheneum Books for Young Readers (New York, NY), 2009. * The Thing About Luck, illustrated by Julia Kuo, Atheneum Books for Young Readers (New York, NY), 2013. * Half a World Away, Atheneum Books for Young Readers (New York, NY), 2014. * Checked, Atheneum Books for Young Readers (New York, NY), 2018. ==References== * “Cynthia Kadohata.” Contemporary Authors Online. Gale, 2014. Biography in Context. 23 March 2015. * \"Cynthia Kadohata.\" Authors and Artists for Young Adults. Gale, 2006. Biography in Context. 23 March 2015. * Carlson, Ann D. \"Kadohata, Cynthia.\" World Book Student. World Book, 2015. 23 Mar 2015. Category:Writers from Illinois",
 "title": "Cynthia Kadohata"
}