{
 "id": "484751",
 "text": "Tamora Pierce is an American author. She was born in Connellsville, Pennsylvania on December 13th, 1954. Tamora Pierce is the daughter of Wayne Pierce and Jacqueline Pierce, but her parents divorced. Her family moved from Pennsylvania to California many times. Tamora loved reading books as a child, and she started writing stories when she was in 6th grade. When she was a teenager, she stopped writing. One of her teachers motivated her to continue writing, and she started writing again as an adult. == Writing == Tamora Pierce mainly writes fantasy books, but sometimes historical books. She enjoys writing series because of how the reader gets to live along with the characters. She likes writing books for teenagers. Many of her books have been translated into German, Danish, and Spanish. ==Personal life== Tamora lives in New York, New York with her husband, 4 cats, parakeet, and sometimes rescued animals. She is interested in many topics which sometimes are included in her writing. Some topics she is interested in our culture, crime, wildlife, nature, historical events, and more. == Books == ===Song of the Lioness=== * Alanna: The First Adventure (1983) * In the Hands of the Goddess(1984) * The Woman Who Rides Like a Man(1986) * Lioness Rampant(1988) ===Circle of Magic=== * Wolf-Speaker(1994) * The Emperor Mage(1995) * The Realms of the Gods (1996) ===The Immortals === * Sandry’s Book (1996) * Tris’s Book (1998) * Daja’s Book (1998) * Briar’s Book (1999) ===Beka Cooper=== * Terrier (2006) * Bloodhound (2009) * Mastiff (2011) ===Protector of the Small=== * First Test (1999) * Page (2000) * Squire (2001) * Lady Knight (2002) ===Circle Opens === * Magic Steps (2000) * Street Magic (2001) * Cold Fire (2002) * Shatterglass (2003) * The Will of the Empress: The Circle Reforged (2005) * Melting Stones (2008) * Battle Magic (2013) == Awards == === Alanna: The First Adventure === * Author's Citation, Alumni Association of the New Jersey Institute of Technology, 1984 === In the Hand of the Goddess === * SchulerExpress ZDF Preis (Germany), 1985 * South Carolina Children's Book Award nomination, 1985- 86 === Wolf Speaker === * Children's Paperbacks Bestseller, Australian Bookseller and Publisher, 1995 === The Emperor Mage === * Best Books for Young Adults list, Hawaii State Library, * Best Science Fiction, Fantasy and Horror list, Voice of Youth Advocates, both 1995, * Best Books for Young Adults list, American Library Association, 1996 === The Realms of the Gods === * Best Science Fiction, Fantasy and Horror list, Voice of Youth Advocates, 1996 * Best Books for the Teen Age list, New York Public Library ==References== * \"Tamora Pierce.\" Contemporary Authors Online. Detroit: Gale, 2013. Biography in Context. Web. 23 Mar. 2015. * \"Tamora Pierce.\" Authors and Artists for Young Adults. Vol. 26. Detroit: Gale, 1999. Biography in Context. Web. 23 Mar. 2015. Category:Writers from Pennsylvania",
 "title": "Tamora Pierce"
}