{
 "id": "484762",
 "text": "Paula Danziger (August 18, 1944 - July 8, 2004) was an American author of children's and young adult literature. ==Personal life== Danziger was born in Washington, D.C. to Samuel and Carolyn Danziger. Though she struggled in school as a child, she attended Montclair State University in New Jersey and earned a degree in 1967. She was a middle school teacher in New Jersey from 1967-1978 while studying for a Master's degree. Her studies were interrupted when she was in a car crash, where a drunk driver hit her car, and she slammed her head against the front window which caused her to have brain damage.\"Paula Danziger.\" Contemporary Authors Online. Detroit: Gale, 2005. Biography in Context. Web. 23 Mar. 2015. In 1978 she left teaching to write full-time. Although readers loved her books because of the humor, some critics called them superficial and generic. Others praised her work for tackling real-life issues.\"Paula Danziger.\" Major Authors and Illustrators for Children and Young Adults. Detroit: Gale, 2002. Biography in Context. Web. 23 Mar. 2015. Danziger died in 2004 after complications from a heart attack. She was 59. ==Awards== Some of the awards Danziger's work received: *California Young Reader Medal *Parents' Choice Award *Children’s Choice award ==Publications== * The Cat Ate My Gymsuit. Delacorte, 1974. * The Pistachio Prescription. Delacorte, 1978. * Can You Sue Your Parents for Malpractice?. Delacorte, 1979. * There's a Bat in Bunk Five. Delacorte, 1980. * The Divorce Express. Delacorte, 1982. * It's an Aardvark-Eat-Turtle World. Delacorte, 1985. * This Place Has No Atmosphere. Delacorte, 1986. * Remember Me to Harold Square. Delacorte, 1987. * Everyone Else's Parents Said Yes. Delacorte, 1989. * Make Like a Tree and Leave. Delacorte, 1990. * Earth to Matthew. Delacorte, 1991. * Not for a Billion Gazillion Dollars. Delacorte, 1992. * Amber Brown is Not a Crayon, illustrated by Tony Ross. Putnam's, 1994. * Thames Doesn't Rhyme with James. Putnam's, 1994. * You Can't Eat Your Chicken Pox, Amber Brown, illustrated by Tony Ross. Putnam's, 1995. * Amber Brown Goes Fourth, illustrated by Tony Ross. Putnam's Sons, 1995. * Amber Brown Wants Extra Credit, illustrated by Tony Ross. Putnam's Sons, 1996. * Forever Amber Brown, illustrated by Tony Ross. Putnam, 1996. * Amber Brown Sees Red, illustrated by Tony Ross. Putnam, 1997. * With Ann M. Martin, P.S. Longer Letter Later. Scholastic, 1998. * With Ann M. Martin, Snail Mail No More. 2000. * Amber Brown is Feeling Blue, illustrated by Tony Ross. Putnam's, 1998. * Contributed with other various authors to It's Super to Be Six and It's Terrific to be Ten, published by Scholastic. ==References== *\"Paula Danziger.\" St. James Guide to Young Adult Writers. Gale, 1999. Biography in Context. Web. 23 Mar. 2015. *Cech, John. \"Martin, Ann M.\" World Book Advanced. World Book, 2015. Web. 23 Mar. 2015. *Danziger, Paula. \"Paula Danziger Interview Transcript.\" Scholastic Teachers. Scholastic, n.d. Web. 23 Mar. 2015. Category:1944 births Category:2004 deaths Category:Writers from Washington, D.C. Category:American children's writers",
 "title": "Paula Danziger"
}