{
 "id": "484745",
 "text": "Lois Lowry (born Lois Ann Hammersberg; March 20, 1937) is an American author who was born in Honolulu, Hawaii. Her father wasn’t present in her childhood, so she liked to write about strong father figures in her books. She became interested in reading when she was very young. She had a lot of trouble with math. ==Career and accomplishments== Lowry began her career writing about children who face major challenges. Most had to do with family. Her first novel was A Summer to Die. It established her as an important author of young adult fiction. Her books cover many different topics, including the future, war, and humor. They are for young adults who want to read about serious issues. Lowry is a very successful author. She won the 1990 and 1994 Newbery Medal for Number the Stars and The Giver. Some of her stories are based on her childhood, like her character Anastasia Krupnik in the book Anastasia Krupnik. Some of her most famous books are Number the Stars, The Giver, Gathering Blue, Bless This Mouse, and Messenger. ==List of books written by Lois Lowry== * 1977: A Summer to Die, illustrated by Jenny Oliver, Houghton. * 1978: Find a Stranger, Say Goodbye, Houghton. * 1979: Anastasia Krupnik, Houghton. * 1979: Autumn Street, Houghton. * 1981: Anastasia Again!, Houghton. * 1982: Anastasia at Your Service, Houghton. * 1983: Taking Care of Terrific, Houghton. * 1983: The One Hundredth Thing About Caroline, Houghton. * 1984: Anastasia, Ask Your Analyst, Houghton. * 1984: Us and Uncle Fraud, Houghton. * 1985: Anastasia on Her Own, Houghton. * 1985: Switcharound, Houghton. * 1986: Anastasia Has the Answers, Houghton. * 1987: Rabble,Starkey, Houghton. * 1987: Anastasia's Chosen Career, Houghton. * 1988: All about Sam, illustrated by Diane De Groat, Houghton. * 1989: Number the Stars, Houghton. * 1990: Your Move J.P.!, Houghton. * 1991: Anastasia at This Address, Houghton. * 1992: Attaboy, Sam!, Houghton. * 1993: The Giver, Houghton. * 1995: Anastasia, Absolutely, Houghton. * 1996: See You Around, Sam!, Houghton. * 1997: Stay! Keeper's Story, illustrated by True Kelley, Houghton. * 1999: Zooman Sam, Houghton. * 2000: Gathering Blue, Houghton. * 2002: Gooney Bird Greene, Houghton. * 2004: Messenger, Houghton. * 2007: Gooney the Fabulous, Houghton. * 2012: Son, Houghton. * 2014: Gooney Bird and All Her Charms, Houghton. ==References== * May, Jill P. \"Lowry, Lois.\" World Book Advanced. World Book, 2015. Web. 23 Mar. 2015. *\"Lois Lowry.\" Major Authors and Illustrators for Children and Young Adults. Detroit: Gale, 2002. Biography in Context. Web. 23 Mar. 2015. * \"Lois Lowry.\" Authors and Artists for Young Adults. Vol. 32. Detroit: Gale, 2000. Biography in Context. Web. 23 Mar. 2015.a Category:1937 births Category:Living people Category:People from Honolulu Category:Writers from Hawaii",
 "title": "Lois Lowry"
}