{
 "id": "484873",
 "text": "Sophie Belinda Jonas (born née Turner; 21 February 1996) is a British actress. She plays Sansa Stark in Game of Thrones, She played Young Adeline March in The Thirteenth Tale. She also played Heather in the 2015 comedy movie Barely Lethal. She was born in Northampton, England. In 2019, she married singer- songwriter Joe Jonas. They have two daughters together. On September 5, 2023, Jonas filed for divorce from Turner. ==Filmography== ===Film=== Year Title Role Notes 2013 Another Me 2015 Barely Lethal Heather / Agent 84 Production Begins on Kyle Newman's Barely Lethal , Publisher: ComingSoon.net, Published date: 12 November 2013, Access date: 14 November 2013 2016 X-Men: Apocalypse 2018 Josie Josie 2018 Time Freak Debbie 2019 Dark Phoenix Jean Grey / Phoenix 2019 Heavy Maddie ===Television=== Year Title Role Notes 2011–2019 Game of Thrones Main role (59 episodes) 2013 The Thirteenth Tale Television film 2020 Survive Jane TV series ===Music videos=== Year Title Artist(s) 2014 \"Oblivion\" Bastille 2019 \"Sucker\" Jonas Brothers 2020 \"What a Man Gotta Do\" Jonas Brothers ==Awards and nominations== Year Work Award Category Result 2011 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series 2011 Game of Thrones Scream Awards Scream Award for Best Ensemble 2012 Game of Thrones Young Artist Awards Best Performance in a TV Series – Supporting Young Actress 2013 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series 2014 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series – 2015 Game of Thrones Empire Hero Award Empire Hero Award 2015 Game of Thrones EWwy Award Best Supporting Actress, Drama 2015 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series 2016 Herself Huading Awards Best Global Actress 2016 Game of Thrones Glamour Awards Best UK TV Actress 2016 Herself Venice International Film Festival International Movie Award 2016 Game of Thrones EWwy Award Best Supporting Actress, Drama 2016 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series 2017 X-Men: Apocalypse Kids Choice Awards Favorite Squad 2017 Game of Thrones Screen Actors Guild Award Outstanding Performance by an Ensemble in a Drama Series 2019 Game of Thrones Saturn Award Best Supporting Actress on Television 2019 Game of Thrones Primetime Emmy Award Outstanding Supporting Actress in a Drama Series 2019 Dark Phoenix Teen Choice Awards Choice Sci- Fi/Fantasy Movie Actress ==Awards and nominations== Year Award Category Work Result Ref Primetime Emmy Awards Outstanding Supporting Actress in a Drama Series Game of Thrones ==References== Category:English television actors Category:English movie actors Category:1996 births Category:Living people",
 "title": "Sophie Turner"
}