{
 "id": "484922",
 "text": "Saints Cyril and Methodius were brothers and 9th century Christian missionaries. They Christianized the Slavic peoples of the Danube.Lorraine Murray, Bulgaria, Hungary, Romania, the Czech Republic, and Slovakia (New York: Britannica Educational Publishing/Rosen Educational Services, LLC, 2014), p. 35 They influenced the culture and religion of all Slavic peoples. They received the title \"Apostles to the Slavs\". == Secular lives == The brothers were both born in Thessalonica. Methodios was born and died in 885.Mike Dixon-Kennedy, Encyclopedia of Russian and Slavic Myth and Legend (Santa Barbara, CA: ABC-CLIO, 1998), p. 56 Cyril was born and died (under his adopted name Constantine) in 869. Cyril was educated at the university at Constantinople under Photios I of Constantinople. He later taught there when he replaced Photios. Methodios became governor of the province of Opsikion around the same time. ==Missionaries== In 861 the Byzantine Emperor Michael III sent the two brothers to convert the Khazars to Christianity. They continued their religious conversion of the Tatars along the Black Sea for two years.Matthew Bunson, Our Sunday Visitor's Encyclopedia of Catholic History (Huntington, IN: Our Sunday Visitor Publishing Division, 2004), p. 269 ===Contribution to Slavic languages=== Afterwards, the Emperor Michael sent them to Moravia as missionaries. They taught in the Slavic languages and translated the Scriptures into Slavonic. Cyril invented an alphabet called the Glagolitic alphabet.Tanya Popovic, Prince Marko: The Hero of South Slavic Epics (Syracuse, NY: Syracuse University Press, 1988), p. 188 This became the basis for the Cyrillic alphabet. Old Church Slavonic was written in Cyrillic and Glagolitic.The Blackwell Companion to Eastern Christianity, ed. Ken Parry (Malden, MA: Wiley-Blackwell, 2010), p. 231 ==Related pages== * Saint * Christianity * Church Father * Eastern Christianity * Eastern Orthodox Church == References == Category:Christian saints Category:Slavic languages Category:Cyrillic script Category:People from Constantinople Category:810s births Category:820s births Category:860s deaths Category:880s deaths",
 "title": "Cyril and Methodius"
}