{
 "id": "48533",
 "text": "French fries, chips, finger chips, French-fried potatoes, or simply fries, are potatoes, cut, and deep fried. They are prepared by cutting potatoes into even strips, drying them, and frying them. They are usually fried in a deep fryer. During the process of making, they are pre-cut, blanched, and frozen russet potatoes are often used to make them. French fries can also be baked in a oven. French fries are served hot, either soft or crispy, and are generally eaten for lunch, dinner, or as a snack. They commonly appear on the menus of diners, fast food restaurants, pubs, and bars. People often put salt on them, and sometimes dip them in ketchup, vinegar, mayonnaise, tomato sauce, or other condiments. French fries are sometimes topped with poutine and/or chili con carne. French fries are sometimes made from sweet potatoes, instead of potatoes. When baked in a oven, little oil or no oil, is used. ==Preparation== French fries are often fried in a deep fryer, which submerges them in hot fat. They are may be cooked in oil, instead. Vacuum fryers make French fries have not as much oil, but mostly work on the French fries' color and texture, instead. The potatoes are prepared by first cutting them into even strips. They do not have to be peeled. The strips are either removed from the plate or put in cold water to remove the starch outside of the strips. Once they are taken out from the cold water, they are dried. Then they can be fried in the two-stage or two-bath technique. Most chefs think that the two-bath technique, will make them fried better. Potatoes that are taken fresh out of the ground, may have too much water which makes the French fries soft and wet. Most people choose potatoes that have not been used for a while. In the two-stage or two- bath technique, the first process to frying them, sometimes called blanching, is in hot fat, with the temperature being ( 160 °C/ 320 °F). Then they are fried for a little longer, with the temperature now being ( 190 °C/ 375 °F) so they can be crispy. After that, they are placed in a colander or on a draining cloth, and then they are eaten. The precise time for the two processes to fry them, depends on the size of the French fries. For example, for 2–3 mm strips, the first process takes about 3 minutes, and the second process, takes only seconds. Since the 1960's, most French fries have been made from frozen Russet potatoes, which have been blanched or air-dried professionally. The usual fat used for making French fries is vegetable oil. In the past, suet made from beef was recommended as the fat to making them, because it was thought that they would taste better, with vegetable shortening as a suggestion. McDonald's used a mixture of 93% of beef tallow and 7% cottonseed oil until 1990, when they changed to vegetable oil with beef flavoring. Horse fat was often used as the fat to make French fries in northern France and Belgium, until recently. Some chefs still use it. ==Related pages== * Potato chips * Cheese fries ==Other websites== * * Category:Fast food Category:Potato dishes Category:Fried foods Category:French food Category:Belgian food",
 "title": "French fries"
}