{
 "id": "48540",
 "text": "Ptolemy XV Philopator Philometor Caesar also simply known as Caesarion (June 23, 47 BC – August, 30 BC) was the son of Cleopatra VII. He ruled Egypt as a child with his mother Cleopatra until 30 BC. He was murdered by Octavian, who would later become the Roman emperor Augustus. Caesarion is probably the son of Julius Caesar. If so, he is the only known son of Caesar. Caesarion was the last king (pharaoh) of the Ptolemaic dynasty of Egypt. == Early Life == Caesarion was born in Egypt on 23 June 47 BC. His mother, Cleopatra, said that he was the son of Roman leader Julius Caesar. Even though he looked and acted like Caesar, Caesar did not officially say that he was his son.Cleopatra 1996 by Green Robert p.24 One of Caesar’s friends, Gaius Oppius, wrote a small book trying to show that Caesar could not have been Caesarion’s father. But it is possible that Caesar let Caesarion use his name. Duane W. Roller, Cleopatra: A Biography, Oxford University Press US, 2010, pp. 70–73 Caesarion spent the first two years of his life, from 46 to 44 BC, in Rome. He and his mother, Cleopatra, were guests at Juilius Caesar’s villa (Horti Caesaris). Cleopatra wanted her son to become the leader of both the Roman Republic and Egypt after his father, Caesar. When Caesar was killed on March 15, 44 BC, Cleopatra and Caesarion went back to Egypt. At the age of three, Cleopatra made Caesarion the ruler of Egypt with her on September 2, 44 BC. Cleopatra compared her relationship to her son with that of the Egyptian goddess Isis and her child Horus. From 44 BC until 36 BC, there are no informations about Caesarion. Two years later, in 34 BC, he appeared at two events called the Donations of Antioch and the Donations of Alexandria. These events were organized by Cleopatra and Mark Antony to give lands that were controlled by Rome and Parthia to Caesarion and his siblings: Alexander Helios, Cleopatra Selene II, and Ptolemy Philadelphus. == Pharaoh == In the year 34 BC, Mark Antony gave more land and titles in the east to Caesarion and his own three children with Cleopatra. Caesarion was called a god, the son of a god, and \"King of Kings.\" This was a really big title that was never given by romans to their allies. Some people thought this was a threat to the greatness of the Roman people. Antony also said that Caesarion was really Julius Caesar's son and should be the next ruler. This made Octavian (who became ruler because he was Julius Caesar's grandnephew and adopted son) very angry. These things caused a big fight between Antony and Octavian. Octavian used how angry people were about these things to get support for fighting against Cleopatra and Mark Antony. == Death == After Cleopatra and Mark Antony lost the Battle of Actium in 31 BC, Cleopatra wanted Caesarion to be the only ruler without her. She may have planned to leave with Antony. Octavian invaded Egypt and looked for Caesarion in 30 BC. Cleopatra might have sent Caesarion to a place called Berenice for safety, possibly so that he can escape to India. Plutarch said that Caesarion went to India, but he also said that Caesarion was tricked into returning to Egypt because Octavian told him that he'd let him rule Egypt. When Caesarion went back to Egypt, Octavian killed him around 30 BC. == Pictures of Caesarion == File:Venus and Cupid from the House of Marcus Fabius Rufus at Pompeii, most likely a depiction of Cleopatra VII.jpg|Possible painting of Cleopatra as a venus and her son Caesarion as a cupid The wall- painting of Venus Genetrix is similar in appearance to the now-lost statue of Cleopatra erected by Julius Caesar in the Temple of Venus Genetrix, within the Forum of Caesar. The owner of the House at Pompeii of Marcus Fabius Rufus, walled off the room with this painting, most likely in immediate reaction to the execution of Caesarion on orders of Augustus in 30 BC, when artistic depictions of Caesarion would have been considered a sensitive issue for the ruling regime. File:Statue of Horus in Edfu Temple.jpg|Horus statue with a smaller statue of Caesarion at temple of Edfu, Upper Egypt File: RPC-3901 Cleopatra VII with baby Ptolemy XV Caesarion son of Julius Caesar on coin of Cyprus 47BC displayed in the British Museum.jpg|A coin with the image of Cleopatra VII and her son Caesarion as a baby. There aren't many pictures of Caesarion left. A part of a statue was found in Alexandria in 1997, and People think that this statue belongs to Caesarion. There are two pictures of him as an adult. Pictures of Caesarion as a baby can be seen on some coins that Cleopatra made when he was still young. == Egyptian names == Caesarion had a full list of Egyptian titles and names in the Egyptian language: *Iwapanetjer entynehem – \"Heir of the god who saves\" *Setepenptah – \"Chosen of Ptah\" *Irmaatenre – \"Carrying out the rule of Ra\" or \"Sun of righteousness\" *Sekhemankhamun – \"The living representation of Amun\" == Notes == == References == Category:1st millennium BC pharaohs Category:47 BC births Category:30 BC deaths",
 "title": "Caesarion"
}