{
 "id": "48604",
 "text": "Breakdance (also called breaking, b-boying or b-girling) is a type of dance that is done by people who are part of the hip hop culture. B-boy means boy who dances on breaks (breakbeats). Breakdancing was invented in the early 1970s by African American and Latino American inner-city youth in the South Bronx in New York City.The dance style evolved during the 70s and 80s in big cities of the United States. Breakdancing uses different body movements, spins, arm movements, leg movements, all of which are done to the rhythm of hip hop music. Breakdancing was most popular in the 1980s but continues to be common today. There are four categories in breakdance. They are power moves (windmill, tomas, airtrax and so on), style moves, toprock, downrock (footwork), and freezes (chair, airchair and so on). Many of moves come from gymnastics and kung-fu. Breakdancers dance with breakbeats. The difficulty of their skills decides the better b-boy. One of the biggest breakdance contests in the world is Battle of the Year (BOTY). It has several different types of contests. There are one-on-one battles, team battle, contest of showcase and so on. B-boy battle means dancing on random music. In 2013, the team coming from South Korea, Fusion MC, won the championship. Floorriorz coming from Japan got the award of best show. Good behavior with the sub ==History== How it started Breakdancing can be traced as far as the 1970s. It became an influential form of dancing through the mediums of local parties across the Southern Bronx of New York with a growing trend of DJs. When using two copies of the same record, it created the instrumental method properly known as ‘’breaks’’. These ‘’breaks’’ showcased the skill set of top rock, down rock and passion for the art form in the latino community and black community. DJs found this as a way to gain the appeal of those interested in hip-hop and its culture. During dance battles, many people would gather around the participants that are breakdancing simultaneously with one another. The competitors' motives for their battle varied from enhancing their dancing reputations to expressing their authenticity as much as possible through the art of breakdancing. The form of breakdancing would rise to become a cultural phenomenon throughout the world. Breakdancing is often considered as one of the most culturally significant styles of dancing in hip-hop culture, as it is respected by both whites and African Americans. Breakdancing was born in the 1970s in the South Bronx, New York City as a component of hip-hop culture. It drew inspiration from different dance styles and martial arts, with early breakers introducing moves like toprocking, downrocking, and freezes.In the 1980s, breakdancing gained popularity in mainstream society thanks to films like \"Breakin'\" and \"Beat Street\". The dance form evolved using moves like spins, flips, and intricate footwork. In the 2000s, dancers blended different dance styles like acrobatics, contemporary dance, and a mix of cultural influences. The global hip-hop community played a significant part in spreading breakdancing to new places and facilitating cultural interchange. In the 2020s, dancers are exploring new boundaries and experimenting with different movements, transforming dance into a vibrant and diverse art form. Breakdancing has thrived by adapting to changes in culture, embracing fresh concepts, and remaining true to its roots of self-expression and community. == Rise of B-boys == How is started and contributions B-boys and the term b-boying refer to the dancers that perform an energetic style of dancing in hip-hop typically known as breakdancing. The concept started in the Bronx of New York during a time when the frustrations within the community were at an all-time high. DJ- Kool Herc the proclaimed founder of hip-hop used to perform at hip-hop parties where said the phrase “b-boys go down” which would kickstart a lot of b-boying within the party. Soon Afro-Caribbean elements as well as South American elements elevated the dance style and crews like Zulu Nation and Rocksteady dominated the b-boying scene. As well as breakdancing, B-boying also influenced fashion within the hip-hop community. Fashion styles such as anoraks and sweatshirts with hoods, bell bottom jeans, tennis shoes, and white sailor caps became the staple of b-boys style as the scene was developing. However, as time went on their style evolved to reflect a more energetic and thuggish style. Soon, leg jeans, leather Jenkins, bomber jackets, sweatshirts, and trainers with caps worn backward became popular not only in the hip-hop community but in American culture as well. In addition, hip-hop influencers like Charlie Funk spread this fashion to other communities and grew out of the New York scene and into the overall hip-hop scene. ==Important Movements== A freeze is a technique where the dancer suddenly stops, often in an interesting or balance-intensive position. Freezes often incorporate various twists of the body into stylish and often difficult positions. The two-step move sets up the direction of movement and builds up momentum when dancing. This move allows the dancer to stay low and in contact with the ground, which places him in a good position for performing other dance moves. As such, the two-step is often one of the first moves a break- dancer learns and it leads onto the 6-step. A kick in breakdance is a one- handed handstand, with often an impressive leg position and the free arm in some stylish position. They are often executed quickly to impress. Watch Grease this will help, or you can watch So You Think You Can Dance. This movie and show will help understand your understanding of breakdance. ==Literature== -Guillaume Éradel, C'est quoi le breakdance? Saint-Denis, Edilivre, 2015 () ==References== Category:Dance types Category:Hip hop",
 "title": "Breakdance"
}