{
 "id": "48628",
 "text": "Simone Lucie Ernestine Marie Bertrand de Beauvoir (, ; ; 9 January 1908 – 14 April 1986) was a French author (writer) and philosopher (person who writes about ways of thinking). She wrote novels (stories in a book), articles about philosophy ways of thinking or ways of living, and politics, biographies (books about other people's lives) and an autobiography (a book about her life). Her best known books are She Came to Stay and The Mandarins. Her best known writing about ideas is The Second Sex, which was written in 1949. It describes the bad experiences of women in European society, and suggests how women's lives can be improved. == Early years == Her full name was Simone Lucie-Ernestine-Marie-Bertrand de Beauvoir. She was born on January 9, 1908 in Paris. She studied mathematics and ways of thinking at the Institut Catholique. Then she studied literature and languages at the Institut Sainte- Marie. As well, she studied ways of thinking at the Sorbonne, which is at the University of Paris. == Her writing; personal life == In 1943, de Beauvoir published She Came to Stay, a story about her lover Jean-Paul Sartre (who was also a writer and a philosopher). Next, she wrote a novel called The Mandarins, which won prize. In 1944 de Beauvoir wrote an article called Pyrrhus et Cinéas, which was about a way of thinking about hard choices that people have to make. In 1949, she wrote Le deuxième sexe. It was translated by Howard Parshley to The Second Sex. It describes the bad experiences of women in European society, and suggests how women's lives can be improved. The book also discussed ways of thinking about hard choices. At the end of World War II, de Beauvoir and Sartre started a newspaper about ways of living called Les Temps Modernes. De Beauvoir was bisexual and had sexual relationships with some of her female students.Academic tug-of-love over de Beauvoir legacy She died of pneumonia. She is buried next to Sartre at the Cimetière du Montparnasse in Paris. == Some of the books she wrote == * The Blood of Others, (1945) * Who Shall Die?, (1945) * The Second Sex, (1949) * The Mandarins, (1954) * The Prime of Life, (1960) * When Things of the Spirit Come First, (1979) === Books about Simone de Beauvoir === * Beauvoir, Simone de. Woman: Myth & Reality, ** in Jacobus, Lee A (ed.) A World of Ideas. Bedford/St. Martins, Boston 2006. 780-795 == References == == Other websites == * The Internet Encyclopedia of Philosophy: Simone de Beauvoir by Shannon Mussett. Includes a bibliography of her work in English translation. * Stanford Encyclopedia of Philosophy: Simone de Beauvoir by Debra Bergoffen. Extensive bibliography. * Guardian Books \"Author Page\", with profile and links to further articles. Category:1908 births Category:1986 deaths Category:20th- century French philosophers Category:Abortion-rights activists Category:Bisexual people Category:Feminist writers Category:French atheists Category:French autobiographers Category:French feminists Category:French LGBT writers Category:French novelists Category:LGBT feminists Category:LGBT novelists Category:Writers from Paris Category:Existentialists",
 "title": "Simone de Beauvoir"
}