{
 "id": "48634",
 "text": "Make is a list of U.S. states (and the one federal district, Washington, D.C.) and territories showing their time zones. Most of the United States uses Daylight Saving Time (DST) in the summer. In the list, it will say if the ndsantate does not use DST. Note: The time zones listed on this page are listed in Coordinated Universal Time (UTC) as well as the names of the time zones as they are called within the United StatsnuaUSCes. For an explanation on what UTC+# and UTC-# mean, please see the UTC page. ==These are the times zones that are used by the United States and its territories:== #UTC-11: Samoa Standard Time (ST) # UTC-10: Hawaii-Aleutian Standard Time (HAT) #UTC-9: Alaska Standard Time (AKT) # UTC−8: Pacific Standard Time (PT) # UTC−7: Mountain Standard Time (MT) # UTC−6: Central Standard Time (CT) # UTC−5: Eastern Standard Time (ET) # UTC−4: Atlantic Standard Time (AST) # UTC+10: Chamorro Standard Time (Cht) ==State== State Time Zone Details Time Zone Current time Alabama (AL) Central Standard Time CST UTC−06:00 Alaska (AK) (Multiple Time Zones) Most of the state: Alaska Standard Time AKST UTC−09:00 Alaska (AK) (Multiple Time Zones) Western Aleutian Islands: Hawaii–Aleutian Standard Time HST UTC−10:00 American Samoa Samoa Time SST UTC−11:00 Arizona (AZ) Mountain Standard Time MST UTC−07:00 Arizona (AZ) The Navajo Nation uses Daylight Saving Time, the rest of the state does not DST N/A Arkansas (AR) Central Standard Time CST UTC−06:00 California (CA) Pacific Standard Time PST UTC−08:00 Colorado (CO) Mountain Standard Time MST UTC−07:00 Connecticut (CT) Eastern Standard Time EST UTC−05:00 Delaware (DE) Eastern Standard Time EST UTC−05:00 District of Columbia (DC) Eastern Standard Time EST UTC−05:00 Florida (FL) (Multiple Time Zones) Most of the state: Eastern Standard Time EST UTC−05:00 Florida (FL) (Multiple Time Zones) West of the Apalachicola River: Central Standard Time CST UTC−06:00 Georgia (GA) Eastern Standard Time EST UTC−05:00 Guam (GU) Chamorro Standard Time ChST UTC+10:00 Guam (GU) Guam does not use Daylight Saving Time DST N/A Hawaii (HI) Hawaii-Aleutian Standard Time HST UTC−10:00 Hawaii (HI) Hawaii does not use Daylight Saving Time DST N/A Idaho (ID) (Multiple Time Zones) Most of the state: Mountain Standard Time MST UTC−07:00 Idaho (ID) (Multiple Time Zones) North of the Salmon River: Pacific Standard Time PST UTC−08:00 Illinois (IL) Central Standard Time CST UTC−06:00 Indiana (IN) (Multiple Time Zones) Most of the state: Eastern Standard Time EST UTC−05:00 Indiana (IN) (Multiple Time Zones) Western part of the state: Central Standard Time CST UTC−06:00 Iowa (IA) Central Standard Time CST UTC−06:00 Kansas (KS) (Multiple Time Zones) Most of the state: Central Standard Time CST UTC−06:00 Kansas (KS) (Multiple Time Zones) Greeley, Hamilton, Sherman and Wallace counties: Mountain Standard Time MST UTC−07:00 Kentucky (KY) (Multiple Time Zones) Western half of the state: Central Standard Time CST UTC−06:00 Kentucky (KY) (Multiple Time Zones) Eastern half of the state: Eastern Standard Time EST UTC−05:00 Louisiana (LA) Central Standard Time CST UTC−06:00 Maine (ME) Eastern Standard Time EST UTC−05:00 Maryland (MD) Eastern Standard Time EST UTC−05:00 Massachusetts (MA) Eastern Standard Time EST UTC−05:00 Michigan (MI) (Multiple Time Zones) Most of the state: Eastern Standard Time EST UTC−05:00 Michigan (MI) (Multiple Time Zones) Gogebic, Iron, Dickinson, and Menominee counties: Central Standard Time CST UTC−06:00 Minnesota (MN) Central Standard Time CST UTC−06:00 Mississippi (MS) Central Standard Time CST UTC−06:00 Missouri (MO) Central Standard Time CST UTC−06:00 Montana (MT) Mountain Standard Time MST UTC−07:00 Nebraska (NE) (Multiple Time Zones) Most of the state: Central Standard Time CST UTC−06:00 Nebraska (NE) (Multiple Time Zones) Western part of the state: Mountain Standard Time MST UTC−07:00 Nevada (NV) (Multiple Time Zones) Most of the state: Pacific Standard Time PST UTC−08:00 Nevada (NV) (Multiple Time Zones) West Wendover: Mountain Standard Time MST UTC−07:00 New Hampshire (NH) Eastern Standard Time EST UTC−05:00 New Jersey (NJ) Eastern Standard Time EST UTC−05:00 New Mexico (NM) Mountain Standard Time MST UTC−07:00 New York (NY) Eastern Standard Time EST UTC−05:00 North Carolina (NC) Eastern Standard Time EST UTC−05:00 North Dakota (ND) (Multiple Time Zones) Most of the state: Central Standard Time CST UTC−06:00 North Dakota (ND) (Multiple Time Zones) Western North Dakota: Mountain Standard Time MST UTC−07:00 Northern Mariana Islands (MP) Chamorro Standard Time ChST UTC+10:00 Northern Mariana Islands (MP) The CNMI does not use Daylight Saving Time DST N/A Ohio (OH) Eastern Standard Time EST UTC−05:00 Oklahoma (OK) Central Standard Time CST UTC−06:00 Oregon (OR) (Multiple Time Zones) Most of the state: Pacific Standard Time PST UTC−08:00 Oregon (OR) (Multiple Time Zones) Part of Malheur County: Mountain Standard Time MST UTC−07:00 Pennsylvania (PA) Eastern Standard Time EST UTC−05:00 Puerto Rico (PR) Atlantic Standard Time AST UTC−04:00 Puerto Rico (PR) Puerto Rico does not use Daylight Saving Time DST N/A Rhode Island (RI) Eastern Standard Time EST UTC−05:00 South Carolina (SC) Eastern Standard Time EST UTC−05:00 South Dakota (SD) (Multiple Time Zones) Eastern South Dakota: Central Standard Time CST UTC−06:00 South Dakota (SD) (Multiple Time Zones) Western South Dakota: Mountain Standard Time MST UTC−07:00 Tennessee (TN) (Multiple Time Zones) West Tennessee: Central Standard Time CST UTC−06:00 Tennessee (TN) (Multiple Time Zones) East Tennessee, except Marion County: Eastern Standard Time EST UTC−05:00 Texas (TX) (Multiple Time Zones) Most of the state: Central Standard Time CST UTC−06:00 Texas (TX) (Multiple Time Zones) El Paso and Hudspeth Counties: Mountain Standard Time MST UTC−07:00 United States Virgin Islands (USVI) Atlantic Standard Time AST UTC−04:00 United States Virgin Islands (USVI) The USVI does not use Daylight Saving Time DST N/A Utah (UT) Mountain Standard Time MST UTC−07:00 Vermont (VT) Eastern Standard Time EST UTC−05:00 Virginia (VA) Eastern Standard Time EST UTC−05:00 Washington (WA) Pacific Standard Time PST UTC−08:00 West Virginia (WV) Eastern Standard Time EST UTC−05:00 Wisconsin (WI) Central Standard Time CST UTC−06:00 Wyoming (WY) Mountain Standard Time MST UTC−07:00 ==Federal district== Washington, D.C. does use Daylight Saving Time (DST). Federal district Time Zone Details Time Zone UTC Offsets Washington, D.C. Observes Daylight Saving Time EST UTC−05:00 ==Territories== The territories of the United States do not use Daylight Saving Time (DST). ==Other websites== * Official time zone site of the U.S.A. government Time zone, List of U.S. states by Category:Time zones in the United States",
 "title": "List of U.S. states and territories by time zone"
}