{
 "id": "48645",
 "text": "Paul Michael Levesque (born July 27, 1969) is an American business executive, retired professional wrestler, actor, and former bodybuilder. He is better known by the ring name Triple H, an abbreviation of his former Hunter Hearst Helmsley name. He is currently the CCO (\"Chief Content Officer\") of WWE. Before joining WWE, Levesque began his wrestling career with World Championship Wrestling (WCW) in 1993, wrestling under the name Terra Ryzing. He would then be repackaged as Jean-Paul Lévesque, a French Canadian aristocrat, before joining World Wrestling Federation (now WWE) in 1995. During his time in WWE, he was a 14-time world champion: a nine-time WWE Champion and a five-time World Heavyweight Champion In addition, he won the 1997 King of the Ring, the 2002 Royal Rumble, and was the second Grand Slam Champion. He married Stephanie McMahon in 2003, becoming the son-in-law of WWE chairman Vince McMahon. Outside of wrestling, Levesque has made many guest appearances in film and on television. He is starring in the upcoming WWE Film Journey of Death. At the 2008 edition of Backlash, Triple H won the WWE Championship. He lost the title at Survivor Series 2008 to Edge. At the 2009 No Way Out, Triple H won back the WWE Championship in an Elimination Chamber match for the 8th time, beating The Rock's record of 7 times. After entering the 2016 Royal Rumble match at no. 30, he eliminated Ambrose to win the Royal Rumble and become a 14 time world champion. He later lost the title to Roman Reigns at WrestleMania 32. In September 2021, Triple H had heart failure and doctors put an ICD in his chest during surgery. On March 25, 2022, he officially announced his retirement from in-ring competition. On the second night of WrestleMania 38, he left his wrestling boots in the ring which was a sign of retirement. ==Acting== ===Movies=== *Blade: Trinity - Jarko Grimwood (2004) *Relative Strangers - Wrestler (2006) (Uncredited) *The Chaperone - Raymond \"Ray Ray\" Bradstone (2011) *Inside Out - Arlo \"AJ\" Jayne (2011) *Scooby-Doo! WrestleMania Mystery - Himself (2014) (voice) ===Television=== *Pacific Blue - Triple H (1998) *The Drew Carey Show - The Disciplinarian (1998) *Mad TV - Himself (2001) *The Bernie Mac Show - Triple H (2005) *Billions - Himself (2023) == References == * * * == Other websites == * * Online World of Wrestling profile * Category:1969 births Category:Living people Category:Actors from New Hampshire Category:American bodybuilders Category:American movie actors Category:American professional wrestlers Category:American Roman Catholics Category:American television actors Category:Former WWE wrestlers Category:People from Nashua, New Hampshire Category:Sportspeople from New Hampshire Category:WWE executives Category:WWE Hall of Fame",
 "title": "Triple H"
}