{
 "id": "48654",
 "text": "Ernő Rubik (born 13 July 1944) is a Hungarian inventor and professor of architecture. He is the inventor of the Rubik's Cube. He was born in Budapest, Hungary. == Education Background == Rubik was a lifelong student who referred to himself as a ‘bibliophile.’ He began his education at the Secondary School of Fine and Applied Arts, where he received his high school diploma. He had always been interested in architecture and sculpture, and in 1962 he enrolled in Budapest University Of Technology. He received his bachelor's degree in art from there in 1967. He continued his academic education in 1967 by enrolling in the Hungarian Academy of Applied Arts, where he graduated in 1971 and later became a faculty member and designer at the same university. All of these schools and colleges, according to Rubik, helped him mold his life and give him a sense of purpose. He also believes that schooling is critical for a human being since it allows them to practice, think, and learn. He became a professor of architecture at Budapest College of Applied Arts after graduating in 1971. In 1974, he created a puzzle that became known as “Rubik’s Cube” or “Rubik’s Magic” to better teach his students about three-dimensional things. To create the Rubik’s Cube prototype, he used wood from his university’s workshop and rubber. In 1979, he contacted a US company called ‘Ideal Toys’ to make his idea widely known when it became popular with his students. It was immediately popular and sold in large numbers after being introduced to an international market. Rubik registered his invention as a patent. He formed a studio to create new designs and games after observing the popularity of the cube. He also created the puzzles ‘Rubik’s Snake’ and ‘Rubik’s 360.’ He was elected to the Hungarian Engineering Academy in 1990. He formed the Rubik Foundation to promote and help future students in the engineering sector to build distinctive concepts. He began teaching as an honorary guest lecturer at Keimyung University in South Korea in 2009. == Awards and Achievements == Rubik has won several major accolades for his invention, including Hungary’s highest honors, which only a few people have ever received. He has also received other awards, including the United States Science and Engineering Festival Award (2010), the Prima Primissima Prize (2010), the My Country Awards in 2012, and the Honorary Citizen of Budapest in 2014. He was elected a member of the Academia Europaea in 2015. == Some Interesting Facts of Erno Rubik == * To far, more than 350 million Rubik’s Cubes have been sold. * It took Erno Rubik a month to solve his own puzzle. * He used to work as an editor for a magazine dedicated to games and riddles. * Erno Rubik is one of them, having inspired many young children to pursue careers in science and piqued their curiosity in puzzles and designs. His inventions have made a significant contribution to science, and his expertise is simplicity, which has made him and his inventions beloved by people all over the world. == Other websites == * Official website * Brief biography of Erno Rubik * Hungarian Academy of Engineering - Rubik International Foundation * An interview with Ernő Rubik == References == Category:1944 births Category:Living people Category:Hungarian architects Category:Inventors Category:People from Budapest Category:Rubik's Cube Category:Members of Academia Europaea",
 "title": "Ernő Rubik"
}