{
 "id": "48693",
 "text": "Fritjof Capra (born February 1, 1939) is an Austrian-American physicist. Born in Vienna, Austria, Capra earned a Ph.D. in theoretical physics from the University of Vienna in 1966. He has done research on particle physics and systems theory, and has written popular books on the implications of science with ethics, metaphysics and society. In particular in The Tao of Physics he says that physics and metaphysics are leading to the same knowledge. His works all share a similar subtext: that \"there are hidden connections between everything\". Capra is both a Buddhist and a Catholic Christian. After touring Germany in the early 1980s, Capra wrote a book in 1984 with ecofeminist author Charlene Spretnak, called Green Politics. Capra pushes for western society to abandon the mechanistic views of Descartes. Unlike Descartes' reductionistic view that everything can be studied in parts to understand the whole, he allows his readers to take an objective and fresh mind, encouraging them to see the world through 'complexity theory'. Capra is aiming for a theory of living systems, a theoretical framework for ecology. This theory has its roots in several scientific fields from the first half of the twentieth century — organismic biology, gestalt psychology, ecology, general systems theory, and cybernetics. == Bibliography == *The Tao of Physics (1975) *Green Politics with (Charlene Spretnak) *The Turning Point (1982) *Uncommon Wisdom (1988) *Belonging to the Universe: Explorations on the Frontiers of Science and Spirituality (1991) (coauthored with David Steindl-Rast and Thomas Matus) *The Web of Life (1997) *The Hidden Connections: A Science for Sustainable Living (2002) == Other websites == *His homepage *The Turning Point *Home on the web for the Center for Ecoliteracy *Skeptical Inquirer on Quantum Quackery Category:1939 births Category:Living people Category:American physicists Category:Austrian scientists Category:Scientists from Vienna Category:Systems scientists",
 "title": "Fritjof Capra"
}