{
 "id": "48717",
 "text": "Lizards are a group of reptiles. Together with snakes, they make up most of the order Squamata. There are about 6,000 species,Reptile Database. Retrieved on 2012-04-22 which live all over the world, except in cold climates. They range across all continents except Antarctica, as well as most oceanic island chains.Capula, Massimo; Behler 1989. Simon & Schuster's guide to reptiles and amphibians of the world. New York: Simon & Schuster. . One type, the marine iguana, lives in the sea. Size varies greatly, from Geckos of a few inches or cm to the Komodo dragon of 3 meters (9 feet) and 70 kg (150 pounds). Some kinds of lizards are: * Basilisk * Gecko * Iguana * Monitor lizard * Frill- necked Lizard * Draco, flying lizard * Slow-worm: a lizard without legs. == Simplified classification == In the traditional taxonomy the Order Squamata is divided as follows: *Order Squamata (the scaled reptiles) ** Suborder Serpentes (snakes) ** Suborder Lacertilia / Sauria (lizards) A modern view is that the snakes and lizards are all infraorders of the Squamata:Benton, Michael 1997. Vertebrate palaeontology. Chapman & Hall, London.p238 *Order Squamata ** Infraorder Serpentes ** Infraorder Iguania: Iguanas, chameleons, agamas and relatives. ** Infraorder Gekkota: Geckos, legless lizards, blind lizards. ** Infraorder Scincomorpha: Skinks, wall lizards and relatives. ** Infraorder Anguimorpha (Platynota, Varanoidea): Monitor lizards, Gila monsters, Slow-worms and relatives. ** Infraorder Amphisbaenia: legless burrowing worm lizards. There are other versions, and the taxonomy will probably not settle until more molecular evidence is collected. == Natural history == === Anatomy === The skull structure of both snakes and lizards is distinctive. They can move their upper jaw relative to the braincase. They bear horny scales, and many use venom for attack and defense. === Evolution === The Squamates are definitely a monophyletic group; they are a sister group to the Tuatara. Judged by their fossil record, the Squamates were present in the Mesozoic, but occupied a minor place in the land ecology. Three of the six lines are recorded first in the Upper Jurassic, the others in the Cretaceous. The Mosasaurs of the Upper Cretaceous were by far the most successful of all the lizards, becoming the top predator in their ecosystem. It is now known that lizards originated in the Upper Triassic, 237201 million years ago.Fossil shows lizards millions of years older than thought. Although snakes and lizards look so different, neither are proper clades. Snakes did descend from early lizards, so both groups together do form a monophyletic clade, the Squamata. Within that clade there is another monophyletic clade, the Toxicofera. This includes all venomous reptile species, as well as many related non-venomous species. The evidence for this is in recent molecular analyses.Vidal, Nicolas, and S. Blair Hedges. 2009. The molecular evolutionary tree of lizards, snakes, and amphisbaenians. Comptes rendus biologies 332, (2) 129-139. Pyron R.A; Burbrink F.T. and Wiens J.J. 2013. A phylogeny and revised classification of Squamata, including 4161 species of lizards and snakes. BMC evolutionary biology 13, (1) 93.Wiens, John J. et al 2012. Resolving the phylogeny of lizards and snakes (Squamata) with extensive sampling of genes and species. Biology letters 8, (6) 1043-1046. ==Physiology== Lizards use anti-predator defences, including venom, camouflage, and reflex bleeding. They can also sacrifice and regrow their tails. Sight is very important for most lizards, both for finding prey and for communication. Many lizards have highly acute color vision. Most rely heavily on body language, using specific postures, gestures and movements to define territory, resolve disputes, and entice mates. Most lizards use bright colors, but not all the time. These are usually kept out of sight, otherwise the animal would be seen by predators. The bright patches are usually hidden on the underside or between scales: they are only shown when necessary. For example, the dewlap is a brightly colored patch of skin on the throat, usually hidden between scales. When a display is needed, the lizards erect the hyoid bone of their throat. This shows a large vertical flap of brightly colored skin under its head which can be then used for communication. == Images == Image:Coachella Valley Fringe-toed Lizard.JPG|Coachella Valley Fringe-toed Lizard, Uma inornata Image:plumed.basilisk.750pix.jpg|Plumed Basilisk, Basiliscus plumifrons Image:gila.monster.arp.jpg|Gila monster, Heloderma s. suspectum Image:green.tree.monitor.lizard.arp.jpg|Green tree monitor lizard, Varanus prasinus == References == * Category:Reptiles",
 "title": "Lizard"
}