{
 "id": "48728",
 "text": "Nobility was the highest social class in pre-modern societies. In the feudal system (in Europe and elsewhere), the noble were mostly those who got land from the monarch and had to provide services to him, mainly military service. Men of this class were called noblemen. It soon became a hereditary class, sometimes with a right to bear a hereditary title and to have financial and other privileges in the estates of the realm. Today, in most countries, 'noble status' means no legal privileges; an important exception is the United Kingdom, where certain titles (titles of the peerage) guaranteed until recently a seat in the Upper House of Westminster Parliament (that is why it is called House of Lords) and still provide some other, less important privileges. == History == Nobles were always recognized as lower families of the King/Queen. Nobles usually rule Duchies, Counties, and principalities. Nobles were usually given a \"noble house. Nobles usually worked as advisors to the King, and land owners. Some families did not work at all because they were quite wealthy. But not all nobles were wealthy. Some were very poor. One of the richest claim to be noble families were the Medicis. They ruled Tuscany, Milan and others. The Medicis were originally common people, but they were richer than most monarchs of the time until they fell in the 1700's. Noble families had plenty of power depending on what land they ruled. The rich Duchy of Burgundy was a major power spot because of how big to Duchy was. Another power spot was the Duchy of Milan and the Duchy of Luxembourg. Some nobles had little to no power. Most nobles are given a title such as \"lady-in-waiting,\" that is non hereditary. == Famous Noble Families == * House of Boleyn * House of Grey * House of Bourbon * House of Normandy * House of Foix * House of Hesse * House of Nassu == Nobility by rank == Title Male Female Empire Emperor Empress Kingdom King Queen Grand Principality Grand Prince Grand Princess Principality Prince Princess Archduchy Arch Duke Arch Duchess Grand Duchy Grand Duke Grand Duchess Duchy Duke Duchess Marquisate Marquess Marchioness County/Earldom Count/Earl Countess Viscounty Viscount Viscountess Barony Baron Baroness == Other websites == * The German nobility * Old Noble Family Trees * WW-Person , an on-line database of European noble genealogy * Paul Theroff's An Online Gotha * Genealogics, an extensive database of European nobles * Worldroots, a selection of art and genealogy of European nobility * RoyalArk- ruling houses in many non-European countries * Web site on the Royalty, the Nobility, the History and the Patrimony * The Armenian nobility * The Maltese Nobility and its ilks. * Italian dynastic genealogies (in Italian, with an introduction in English) * Worldwidewords * OneTree Genealogy - European Royal and Danish-Norwegian-Swedish Nobility Lineages",
 "title": "Nobility"
}