{
 "id": "48742",
 "text": "Julius Robert Oppenheimer (April 22, 1904 – February 18, 1967) was an American Jewish physicist. He was the scientific director of the Manhattan Project. In World War II. The project built the first nuclear weapons. That is why Oppenheimer is called \"the father of the atomic bomb\". ==Early life== Oppenheimer was born in New York City on April 22, 1904. He studied at Harvard University, Christ's College, Cambridge and at University of Göttingen. In 1940, he married Katherine Puening. They had two children. ==Career== He taught at the University of California, Berkeley where his works about theoretical physics became important for quantum mechanics and nuclear physics. Oppenheimer helped create the Born–Oppenheimer approximation for molecular wave functions, work on the theory of electrons and positrons, the Oppenheimer–Phillips process in nuclear fusion, and early work on quantum tunneling. He also helped create the theory of neutron stars and black holes, quantum field theory, and the interactions of cosmic rays. In 1942, Oppenheimer was hired to work on the Manhattan Project. In 1943 he became director of the project's Los Alamos Laboratory in New Mexico. His job was to help create the first nuclear weapons with other scientists and General Leslie Groves. On July 16, 1945, he was present at the first test of the atomic bomb, Trinity. In August 1945, the weapons were used against Japan in the bombings of Hiroshima and Nagasaki. After the successful testing of the atomic bomb in New Mexico, United States, he said: \"We knew the world would not be the same...now I am become Death, the destroyer of worlds.\" In 1947, Oppenheimer became the director of the Institute for Advanced Study in Princeton, New Jersey. Later in his career he supported international control of nuclear power to stop nuclear proliferation and a nuclear arms race with the Soviet Union. Oppenheimer was against making the hydrogen bomb. During the Second Red Scare, Oppenheimer lost his security clearance. In 1954, Lewis Strauss held security hearing that criticized Oppenheimer's political and nuclear ideas and his past connections with the Communist Party USA. So, Oppenheimer lost access to the government's atomic secrets and his career as a nuclear physicist ended. In December 1963, he was given the Enrico Fermi Award by President Lyndon B. Johnson. In 2022, the federal government gave back Oppenheimer's security clearance. ==Death== Oppenheimer died of throat cancer in Princeton, New Jersey on February 18, 1967 at aged 62. His remains were cremated and scattered in the ocean near his beach house in Saint John, U.S. Virgin Islands. ==Pop culture== In 2023, Christopher Nolan directed a movie based on Oppenheimer's life with Irish actor Cillian Murphy playing Oppenheimer. ==References== == Other websites == *WW2DB: Robert Oppenheimer Category:1904 births Category:1967 deaths Category:Alumni of the University of Cambridge Category:Cancer deaths in New Jersey Category:Deaths from throat cancer Category:Harvard University alumni Category:Jewish American academics Category:Jewish American scientists Category:American nuclear physicists Category:Scientists from New York City Category:American theoretical physicists Category:Educators from New York City",
 "title": "J. Robert Oppenheimer"
}