{
 "id": "48855",
 "text": "Carbon steel or plain-carbon steel, is a metal alloy. It is a combination of two elements, iron and carbon. Other elements are present in quantities too small to affect its properties. The only other elements allowed in plain- carbon steel are: manganese (1.65% max), silicon (0.60% max), and copper (0.60% max). Steel with a low carbon content has the same properties as iron, soft but easily formed. With more carbon the metal gains hardness and strength but becomes less ductile and more difficult to weld. Higher carbon content lowers steel's melting point and its temperature resistance in general. == Types of carbon steel == Typical compositions of carbon are: * Mild (low carbon) steel: approximately 0.3% carbon content with up to 0.4% manganese contentClassification of Carbon and Low-Alloy Steels (e.g. AISI 1018 steel). Less strong but cheap and easy to shape; surface hardness can be increased through carburizing.Engineering fundamentals page on low-carbon steel * Medium carbon steel: approximately 0.30% to 0.45% carbon content with 0.60 to 1.65% manganese content(e.g. AISI 1040 steel). Balances ductility and strength and has good wear resistance; used for large parts, forging and car parts.Engineering fundamentals page on medium-carbon steel * High carbon steel: approximately 0.45% to 0.75% carbon content with 0.30 to 0.90% manganese content. Very strong, used for springs and high-strength wires.Engineering fundamentals page on high-carbon steel * Very high carbon steel: upto 1.5% carbon content, specially processed to produce specific atomic and molecular micro structures. Steel can be heat-treated which allows parts to be fabricated in an easily fordable soft state. If enough carbon is present, the alloy can be hardened to increase strength, wear, and impact resistance. Steels are often wrought by cold-working methods, which is the shaping of metal through deformation at a low equilibrium or meta stable temperature. == Metallurgy == Mild steel is the most common form of steel as its price is relatively low while it provides material properties that are acceptable for many applications. Mild steel has a low carbon content (up to 0.3%) and is therefore neither extremely brittle nor ductile. It becomes malleable when heated, and so can be forged. It is also often used where large amounts of steel need to be formed, for example as structural steel. Density of this metal is 7861.093 kg/m³ (0.284 lb/in³) and the tensile strength is a maximum of 500 MPa (72500 psi) Carbon steels which can successfully undergo heat-treatment have a carbon content in the range of 0.30% to 1.70% by weight. Trace impurities of various other elements can have a significant effect on the quality of the resulting steel. Trace amounts of sulfur make the steel \"red-short\", which is a fault: the steel is brittle and crumbly. Low alloy carbon steel, such as A36 grade, contains about 0.05% sulfur and melts around 1426–1538 °C (2600–2800 °F). Manganese is often added to improve the hardenability of low carbon steels. These additions turn the material into a low alloy steel by some definitions, but AISI's definition of carbon steel allows up to 1.65% manganese by weight. Hardened steel usually refers to quenched or quenched and tempered steel. Silver Steel or high-carbon bright steel, gets its name from its appearance, due to the high carbon content. It is a very-high carbon steel, or can be thought of as some of the best high- carbon steel. It is defined under the steel specification standards BS-1407. It is a 1% carbon tool steel which can be ground to close tolerances. Usually the range of carbon is minimum 1.10% but as high as 1.20%. It also contains trace elements of 0.35% Mn (range 0.30%-0.40%), 0.40% Cr (range 0.4%-0.5%), 0.30% Si (range 0.1%-0.3%), and also sometimes sulfur (max 0.035%) and phosphorus (max 0.035%). Silver steel is sometimes used for making straight razors, due to its ability to produce and hold a micro-fine edge. == Heat treatments == The purpose of heat treating plain-carbon steel is to change the mechanical properties of steel, usually ductility, hardness, yield strength, and impact resistance. == Footnotes == == References == * Oberg, E. et al., (1996). \"Machinery's Handbook,\" 25th ed., Industrial Press Inc. * Smith, W.F. & Hashemi, J. (2006). \"Foundations of Materials Science and Engineering,\" 4th ed., McGraw-Hill. Category:Steels",
 "title": "Carbon steel"
}