{
 "id": "48915",
 "text": "An order of magnitude is an approximation of the logarithm of a value relative to some contextually understood reference value, usually ten, interpreted as the base of the logarithm and the representative of values of magnitude one. Logarithmic distributions are common in nature and considering the order of magnitude of values sampled from such a distribution can be more intuitive. When the reference value is ten, the order of magnitude can be understood as the number of digits in the base-10 representation of the value. Similarly, if the reference value is one of certain powers of two, the magnitude can be understood as the amount of computer memory needed to store the exact integer value. If two numbers have the same order of magnitude, they are about the same size. But if one would compare the surface of an orange with that of the earth, one would say the surface of the earth is many orders of magnitude larger than that of the orange. Orders of magnitude are used to make approximate comparisons. If numbers differ by one order of magnitude, x is about ten times different in quantity than y. If values differ by two orders of magnitude, they differ by a factor of about 100. Two numbers of the same order of magnitude have roughly the same scale: the larger value is less than ten times the smaller value. ==List== In words (long scale) In words (short scale) Prefix (Symbol) Decimal Power of ten Order of magnitude quintillionth nonillionth quecto- (q) 10−30 −30 quadrilliardth octillionth ronto- (r) 10−27 −27 quadrillionth septillionth yocto- (y) 10−24 −24 trilliardth sextillionth zepto- (z) 10−21 −21 trillionth quintillionth atto- (a) 10−18 −18 billiardth quadrillionth femto- (f) 10−15 −15 billionth trillionth pico- (p) 10−12 −12 milliardth billionth nano- (n) 10−9 −9 millionth millionth micro- (µ) 10−6 −6 thousandth thousandth milli- (m) 0.001 10−3 −3 hundredth hundredth centi- (c) 0.01 10−2 −2 tenth tenth deci- (d) 0.1 10−1 −1 one one uni- (no symbol) 1 100 0 ten ten deca- (da) 10 101 1 hundred hundred hecto- (h) 100 102 2 thousand thousand kilo- (k) 103 3 million million mega- (M) 106 6 milliard billion giga- (G) 109 9 billion trillion tera- (T) 1012 12 billiard quadrillion peta- (P) 1015 15 trillion quintillion exa- (E) 1018 18 trilliard sextillion zetta- (Z) 1021 21 quadrillion septillion yotta- (Y) 1024 24 quadrilliard octillion ronna- (R) 1027 27 quintillion nonillion quetta- (Q) 1030 30 In words (long scale) In words (short scale) Prefix (Symbol) Decimal Power of ten Order of magnitude ==Related pages== *Magnitude (mathematics) == Other websites == * Powers of 10, a graphic animated illustration that starts with a view of the Milky Way at 1023 meters and ends with subatomic particles at 10-16 meters. * Orders of Magnitude - Distance * What is Order of Magnitude? Category:Mathematics",
 "title": "Order of magnitude"
}