{
 "id": "48947",
 "text": "Not to be mistaken for the Muhammad Ali who became Muhammad Ali Pasha, Wali of Egypt and Sudan Muhammad Ali (born Cassius Marcellus Clay Jr.; January 17, 1942 - June 3, 2016) was an American boxer. He became one of the most famous boxers in the world with his \"rope-a-dope\" technique. He was also well known for his clever rhymes. In 1999, Ali was named \"Sportsman of the Century\" by Sports Illustrated magazine. He won the World Heavyweight Boxing Championship three times. Ali also won an Olympic gold medal for boxing during the 1960 Summer Olympics in Rome, Italy. Ali was also known as “The Greatest”. Ali was born in Louisville, Kentucky. He was named after his father, Cassius Marcellus Clay Sr. but changed his name after converting to Islam according to the Nation of Islam in 1965. Because of his Islamic beliefs, Ali would not fight in the Vietnam War when the army tried drafting him. This made him an international figure around the world. Ali retired from boxing in 1981. In the early 1980s, it was learned that Ali had Parkinson's syndrome. He became well known for his social work and charity. Muhammad Ali was married four times. He had seven daughters and two sons. One of his sons was adopted by him. On April 5, 2024, Ali was inducted into the WWE Hall of Fame by The Undertaker. == Health and Death == On December 20, 2014, Ali was hospitalized for a mild case of pneumonia. Ali was once again hospitalized on January 15, 2015, for a urinary tract infection after being found unresponsive at a guest house in Scottsdale, Arizona. He was released the next day. Ali was diagnosed with Parkinson's disease. On June 3, 2016, Ali died from septic shock due to respiratory problems at a Scottsdale, Arizona hospital, aged 74. \"Muhammad Ali Died of Septic Shock, Will Be Honored at Public Funeral: Spokesman\", by Jon Shuppe, NBC News His last words as recorded by his family physician Dr. Maxime Pompous were \"God made me the greatest boxer and cultivated goodness in me. I thank Him for his grace. I will go to Paradise and would love to defeat all the angels there. Goodbye my daughter and my doctor. See you soon.\" ==References== ==Other websites== https://innocentnews.com/muhammad-ali-jr/ Category:1942 births Category:2016 deaths Category:African-American boxers Category:American Muslims Category:Converts to Islam Category:Deaths from sepsis Category:Infectious disease deaths in Arizona Category:International Boxing Hall of Fame inductees Category:Medalists at the 1960 Summer Olympics Category:Olympic gold medalists for the United States Category:People with dyslexia Category:People with Parkinson's disease Category:Presidential Citizens Medal recipients Category:Professional wrestling referees Category:Sportspeople from Kentucky Category:WWE Hall of Fame",
 "title": "Muhammad Ali"
}