{
 "id": "48986",
 "text": "Anna Anderson (December 16, 1896 – February 12, 1984) was a woman who claimed she was Grand Duchess Anastasia Nikolaevna of Russia. The real Anastasia had been murdered in Ekaterinburg with the rest of her immediate family on July 17, 1918. Her remains have been found and extensively tested using DNA samples from Anastasia's family comparing them to Anderson. There was no match at all. Anderson attempted to kill herself in 1920 in Berlin, Germany. She was taken to a mental hospital. A short time later she began to tell her false story of escape to people there. Some people believed her. Most people did not. Her false claims were pushed for 70 years. Movies were made about her story. She married Jack Manahan and called herself Anastasia Manahan. They lived in Charlottesville, Virginia, where she died of pneumonia in 1984. == Other websites == * Article by Peter Kurth — Anna Anderson’s biographer tells why he does not believe Anna Anderson was Franziska Schanzkowska. * Russian Forensics - A site demonstrating the Russian agenda to prove Anastasia's remains were in the grave. * Anna Anderson Exposed - A site exposing why Anna Anderson was a fraud. * Anna Anderson WAS Grand Duchess Anastasia — a site supporting a \"conspiracy theory\" surrounding Anna Anderson and Anastasia * Article by Rey Barry — Journalist Rey Barry — friend of Anna Anderson and Jack Manahan, and a supporter of her pretensions. * Anastasia: Duchess in Disguise — another website arguing that photographs of Anna Anderson look like Anastasia. * Anastasia and Anna Anderson — A narrative of Anastasia’s death. * Anna Anderson/ Anastasia Manahan — A paper written by a supporter with a list of reasons why they believe that Anna Anderson was Anastasia. * Anastasia: The Truth - A website correcting misstatements recently made about Anastasia and Anna Anderson. * HIH Grand Duchess Anastasia Historical Society - A web site telling the story of Anastasia Nikolaevna and the woman who claimed to be her. * Could Anna Anderson be Anastasia? - A web site discussing the DNA tests done on Anna Anderson. * Anastasia: The Unmasking Of Anna Anderson - An online article on Anna Anderson and her claim. Category:Polish people Category:1896 births Category:1984 deaths",
 "title": "Anna Anderson"
}