{
 "id": "48991",
 "text": "Grand Duchess Tatiana Nikolaevna of Russia (Tatiana Nikolaevna Romanova; ; 10 June 1897 – 17 July 1918) was the second daughter of Emperor Nicholas II and Empress Alexandra Feodorovna. After she was murdered during the Russian Revolution, she was canonized as a passion bearer by the Russian Orthodox Church. Tatiana was the younger sister of Grand Duchess Olga and the elder sister of Grand Duchess Maria, Grand Duchess Anastasia, and Tsarevich Alexei. During World War I, she chaired many charitable committees and along with her older sister Olga, trained to become a nurse. She tended to wounded soldiers on the grounds of Tsarskoye Selo from 1914 to 1917. == Biography == === Early life === Tatiana was born on 10 June 1897. She was the second child and daughter of Emperor Nicholas II and Empress Alexandra. Her siblings were Grand Duchesses Olga, Maria, Anastasia, and Tsarevich Alexei of Russia. All of the children were close to one another and to their parents up until the end of their lives. Like the other Romanov children, Tatiana was raised with austerity. She and her sisters slept on camp beds without pillows, took cold baths in the morning,Massie, p. 132 and embroidered and knitted projects to be given as gifts or sold at charity bazaars.Zeepvat, Charlotte, The Camera and the Tsars: A Romanov Family Album, Sutton Publishing, 2004, p. 153 In their household, Tatiana and Olga were known as \"The Big Pair\". They shared a bedroom and were very close to each another from early childhood. == Appearance and personality == Tatiana was a famous beauty. She was tall, slender, and elegant. She had dark auburn hair, gray eyes, and fine features. Many viewed her as the most beautiful of the four grand duchesses and the one who resembled their mother most.Massie, Robert K. Nicholas and Alexandra, 1967, p. 133.Dehn, Lili, 1922. \"The Real Tsaritsa\", She most resembled her mother. Slender with auburn hair and clear gray eyes, she was strikingly good looking and enjoyed the attention her beauty got.The private world of the last Tsar, in the photographs and notes of General Count Alexander Grabbe. Boston : Little, Brown & Co. p. 63 According to Anna Vyrubova, when Tatiana grew up, she was the tallest and most graceful, beautiful, and romantic. Many officers fell in love with Tatiana, but there were no appropriate suitors for her.Anna Vyrubova, http://www.alexanderpalace.org/russiancourt2006/ Meriel Buchanan described her beauty as \"almost mystical.\"Meriel Buchanan. https://www.alexanderpalace.org/palace/olgabuchannan.php Alexander Mossolov, head of the Imperial Chancellery, wrote that Tatiana was the best-looking of all the sisters.Margaretta Eagar, Six Years at the Russian Court, Chapter 1,https://www.alexanderpalace.org/eagar/I.html When she was 8 years old, her tutor Pierre Gilliard said that she was prettier than her sister.Pierre Gilliard, Thirteen Years at the Russian Court, p. 20 Despite her high status, Tatiana did not use her Imperial title. Her friends, family, and servants called her by her first name and patronym, Tatiana Nikolaevna.Massie, Robert, Nicholas and Alexandra, 1967, p. 135 She did not claim the imperial title of Grand Duchess and replied that she was \"Sister Romanova the Second\".Tschebotarioff, p. 60 Tatiana was a practical, nurturing leader. She who took care of the little ones, and who was a constant help to the household and always willing to help when in need.Sophie Buxhoeveden, The Life and Tragedy of Alexandra Feodorovna, Chapter 16: The Empress and her Family, https://www.theromanovfamily.com/grand-duchess-tatiana-nikolaevna-of-russia/ Tatiana was interested in fashion. According to Sophie Buxhoeveden, She loved to dress. Any clothing, no matter how old, looked well on her. She knew how to put on her clothes, was admired and liked admiration.\" Her mother's friend Anna Vyrubova wrote that Tatiana was talented and that she could dress her mother's hair as well as a professional hair stylist. Sophie Buxhoeveden remembered that Tatiana once dressed her hair when her hairdresser was unavailable.Sophie Buxhoeveden, Before The Storm, p. 299 == Young adulthood and World War I == When World War I broke out, Tatiana became a Red Cross nurse with her mother and Olga. They cared for wounded soldiers in a private hospital on the grounds of Tsarskoye Selo. In September 1914, she was named patron of a war aid committee called the Tatiana Committee. == Russian Revolution and captivity == In March of 1917, Tatiana and her family were under house arrest at Tsarskoye Selo. The family was then moved to the former governor's mansion in Tobolsk by the provisional government that replaced the monarchy. They were strictly supervised by 300 guards, their windows were sealed and painted over as higher and higher walls were built around the building. The commanding officers could access any of the family's rooms at any time and forced the prisoners to ring a bell to use the lavatory. == Death == Throughout the civil war in 1918, the Bolsheviks grew worried that the White Army would seize the Romanovs, who could be a powerful symbol for the anti-Communist cause. The Ural Regional Soviet decided on June 29 to execute the family and received tentative approval from Moscow. On July 16, the captors were ordered to kill the family because the Red Army forces were retreating. On July 17, 1918, Tatiana and her family were executed by Bolshevik agents with gunshots and bayonets at the Ipatiev House in Yekaterinburg. To avoid the corpses' discovery, the guards stripped the bodies of clothing and jewels, mutilated them with sulphuric acid and buried them in the Koptyaki forest. == References == Category:1897 births Category:1918 deaths Category:Russian grand dukes and duchesses Category:House of Holstein- Gottorp-Romanov Category:Assassinations in the Russian Revolution Category:Russian Orthodox saints",
 "title": "Grand Duchess Tatiana Nikolaevna of Russia"
}