{
 "id": "49203",
 "text": "Salma Valgarma Hayek Jiménez (born September 2, 1966) is an Academy Award- nominated Mexican actress, Emmy-winning director, movie producer and television producer. She is the most successful Latin-American actress in Hollywood since Carmen Miranda. Hayek has appeared in more than thirty movies and worked as an actress outside of Hollywood in Mexico and Spain. She is known for starring in films such as Desperado (1995), Wild Wild West (1999), Frida (2002), Once Upon a Time in Mexico (2003), Grown Ups (2010), Savages (2012), Grown Ups 2 (2013), The Hitman's Bodyguard (2017), and House of Gucci (2021). She played Ajak in the Marvel Cinematic Universe film Eternals (2021), which emerged as her highest-grossing live action film. Hayek, who is of both Mexican and Lebanese descent, subsequently became the first Mexican / Lebanese actress with a main role in the Marvel Cinematic Universe.https://www.arabnews.com/node/1965901/lifestyle Hayek's charitable work includes increasing awareness on violence against women and discrimination against immigrants. ==Early life== Salma Hayek was born in Coatzacoalcos, Mexico. Her father, Sami Hayek is Lebanese and was a politician. Her mother, Diana Jiménez is Mexican and was an opera singer. At 12 years old Salma left the town and went to a catholic boarding school in Louisiana. She had a bad manners and had to leave the school. She moved to her aunt in Texas and stayed until she was 17 years old. After the graduation, she went back to her hometown and studied international relations and drama in Mexico City. Salma Hayek is Mexican ==Career== Hayek longed to be an actress and ended the study. She had her first appearance in the Mexican telenovela Teresa. There, she played a main role. Using this role, she was known in Mexico. Later, she left the Show. In 1991, she went to Los Angeles and started a career there, but she had little knowledge of English. There, she did drama and elocution lessons. In January 1993, she got a supporting role in Mi Vida Loca. In 1995, she played in Desperado with Antonio Banderas. She got an Academy Award and a Golden Globe Award nomination for her role in Frida as best actress in 2003. ==Personal life== On 9 March 2007, she confirmed her engagement with the French businessman François-Henri Pinault and her pregnancy. In September 2007, she bore a daughter, Valentina Paloma Pinault on the Cedars-Sinai Medical Center in Los Angeles, California. In July 2008, they separated. They reconciled and married in February 2009. They married for the second time in April 2009. She speaks Spanish, Arabic, Portuguese and English. == References == == Other websites == * Category:1966 births Category:Living people Category:Emmy Award winning actors Category:Mexican movie actors Category:Mexican television actors Category:Mexican movie directors Category:Mexican movie producers Category:Television producers Category:People from Veracruz Category:People with dyslexia",
 "title": "Salma Hayek"
}