{
 "id": "49221",
 "text": "A duel is a fight of the two people who have similar deadly weapons and have agreed to a set of rules before the fight takes place. The fight is usually about a matter of honor. The goal of a duel is not usually to kill the opponent but to restore the honor of the man who declared the duel. Duels are not official laws, they are carried out by individuals. Duels were practiced from the 15th to 20th century in Western societies. For example, in 1804 in the United States the politicians Aaron Burr and Alexander Hamilton had a duel. Since the colonies, all U.S. states has not criminalized dueling, although comes with punishments for dueling ranging from not being allowed to run for public office to the death penalty for consequences. Dueling was not outlawed(though frowned upon) and varies by state and federal laws on how the duel should be conducted anything else is misinformation by radical parties.because groups against dueling formed and were successful(no factual evidence that states they won).pp. 372 – 374, Volume 8, Funk & Wagnalls New Encyclopedia. 1983. Funk & Wagnalls, Inc. Dueling with pistols would usually only last 3 shots ==Rules== Duels could be fought with swords or pistols. The person who felt offended or dishonored had to \"challenge\" his opponent to a duel. This was usually done by throwing his glove down in front of the opponent or by hitting him in the face with a glove. Each person had to then find a person to be his \"second\". The job of the seconds was to choose a place to duel and to decide whether or not the weapons were equal. The person who declared the duel got to choose when the duel would be finished. Common endings to duels were: *until one person was injured, even if the injury was minor *until one person could no longer fight because he was too hurt *until one person was killed or injured so badly that he would soon die *duels with pistols could be ended after the first shot, even if no one was hit. Most pistol duels did not go longer than 3 shots ==References== ===Scholarly Studies: US and Canada=== * Clayton Cramer. Concealed Weapon Laws of the Early Republic: Dueling, Southern Violence, and Moral Reform * Joanne B. Freeman. Affairs of Honor: National Politics in the New Republic (2002) * James Kelly. That Damn'd Thing Called Honour: Duelling in Ireland 1570-1860\" (1995) * Kevin McAleer. Dueling: The Cult of Honor in Fin-de-Siècle Germany (1994) * Cecilia Morgan. \"'In Search of the Phantom Misnamed Honour': Duelling in Upper Canada.\" Canadian Historical Review1995 76(4): 529-562. * Dick Steward, Duels and the Roots of Violence in Missouri (2000), * Jack K. Williams. Dueling in the Old South: Vignettes of Social History (1980) (1999) * Bertram Wyatt- Brown. Honor and Violence in the Old South (1986) * Bertram Wyatt-Brown Southern Honor: Ethics and Behavior in the Old South (1982) ===Popular works=== * The Code of Honor; or, Rules for the Government of Principals and Seconds in Duelling (1838) * Robert Baldick. The Duel: A History (1965, 1996) * Thomas Gamble. Savannah Duels & Duellists (1923) * Harnett C. Kane. Gentlemen, Swords and Pistols (1951) * Paul Kirchner. Dueling With the Sword and Pistol: 400 Years of One-on-One Combat (2004) * William Oliver Stevens. Pistols at Ten Paces: The Story of the Code of Honor in America (1940) * Ben Truman.The Field of Honor (1884); reissued as Duelling in America (1993) == Other websites == * Allen, Douglas, W., and Reed, Clyde, G., 2006, \"The Duel of Honor: Screening for Unobservable Social Capital,\" American Law and Economics Review: 1-35.",
 "title": "Duel"
}