{
 "id": "49252",
 "text": "Alfredo James \"Al\" Pacino (born April 25, 1940) is an American actor. He has won an Academy Award for Best Actor an Emmy Award, and two Tony Awards. He is known for movie roles in Scarface and The Godfather. Pacino is the co- president, along with Ellen Burstyn and Harvey Keitel, of the Actors Studio. == Personal life == Pacino has four children. The eldest, Julie Marie (born 1989), is his daughter with acting coach Jan Tarrant. He also has twins, son Anton James and daughter Olivia Rose (born 2001), with actress Beverly D'Angelo. They had a relationship from 1996 to 2003. Pacino had a relationship with Diane Keaton, his co-star in the Godfather Trilogy. Other women he has had relationships with include Tuesday Weld, Marthe Keller, Kathleen Quinlan and Lyndall Hobbs.Grobel; p. xxxviii Pacino has never married. His fourth child is a son named Roman (born 2023) with Noor Alfallah, who is 54 years younger than he is. == Filmography == Year Title Role Notes 1969 Me, Natalie Tony Movie debut 1971 Bobby 1972 Michael Corleone Nominated—Academy Award for Best Supporting ActorGrobel; p. xxi Nominated—BAFTA Award for Best Newcomer Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1973 Scarecrow Francis Lionel \"Lion\" Delbuchi Serpico Frank Serpico Golden Globe Award for Best Actor – Motion Picture Drama Nominated—Academy Award for Best Actor Nominated—BAFTA Award for Best Actor in a Leading Role 1974 Michael Corleone BAFTA Award for Best Actor in a Leading Role Nominated—Academy Award for Best Actor Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1975 Dog Day Afternoon Sonny Wortzik BAFTA Award for Best Actor in a Leading Role Nominated—Academy Award for Best ActorGrobel; p. xxiii Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1977 Bobby Deerfield Bobby Deerfield Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1979 Arthur Kirkland Nominated—Academy Award for Best Actor Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1980 Cruising Steve Burns 1982 Author! Author! Ivan Travalian Nominated—Golden Globe Award for Best Actor – Motion Picture Musical or Comedy 1983 Scarface Tony Montana Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1985 Revolution Tom Dobb 1989 Sea of Love Frank Keller Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1990 Graham Filmed in 1985 Dick Tracy Alphonse \"Big Boy\" Caprice Nominated—Academy Award for Best Supporting ActorGrobel; p. xxvii Nominated—BAFTA Award for Best Actor in a Supporting Role Nominated—Golden Globe Award for Best Supporting Actor - Motion Picture Michael Corleone Nominated—Golden Globe Award for Best Actor – Motion Picture Drama 1991 Frankie and Johnny Johnny 1992 Glengarry Glen Ross Ricky Roma Nominated—Academy Award for Best Supporting ActorGrobel; p. xxviii Nominated—Golden Globe Award for Best Supporting Actor – Motion Picture Scent of a Woman Frank Slade Academy Award for Best Actor Golden Globe Award for Best Actor – Motion Picture Drama 1993 Carlito's Way Carlito 'Charlie' Brigante 1995 Two Bits Gitano Sabatoni Heat Lt. Vincent Hanna 1996 Looking for Richard Director / Narrator / Richard III Directors Guild of America Award for Outstanding Directing – Documentaries City Hall John Pappas 1997 Donnie Brasco Benjamin 'Lefty' Ruggiero John Milton 1999 Lowell Bergman Any Given Sunday Tony D'Amato 2000 Chinese Coffee Harry Levine Also director; filmed in 1997 2002 Insomnia Will Dormer S1m0ne Viktor Taransky People I Know Eli Wurman 2003 Walter Burke Gigli Starkman Angels in America Roy Cohn TV Miniseries Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie Golden Globe Award for Best Actor – Miniseries or Television Film Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie 2004 Shylock 2005 Two for the Money Walter Abrams 2007 Ocean's Thirteen Willie Bank 88 Minutes Dr. Jack Gramm 2008 Righteous Kill Det. David \"Rooster\" Fisk 2010 You Don't Know Jack Dr. Jack Kevorkian TV Film Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie Golden Globe Award for Best Actor – Miniseries or Television Film Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie 2011 Jack and Jill Himself The Son of No One Det. Stanford Wilde Salome Director 2012 Untitled Phil Spector Biopic Phil Spector TV Film 2013 King Lear King Lear Stand Up Guys Gotti Aniello Dellacroce ==Video game== Year Title Role Notes 2006 Scarface: The World Is Yours Tony Montana Video game (likeness) == Awards and nominations == Pacino has been nominated and has won many awards during his acting career. These include eight Oscar nominations (winning one), 15 Golden Globe nominations (winning four), five BAFTA nominations (winning two), two Primetime Emmy Awards for his work on television, and two Tony Awards for his work on the stage. In 2007, the American Film Institute awarded Pacino with a lifetime achievement award. In 2003 British television viewers voted Pacino as the greatest movie star of all time in a poll for Channel 4. == References == Category:1940 births Category:Living people Category:Best Actor Academy Award winners Category:Actors from New York City Category:American movie actors Category:American stage actors Category:American television actors Category:BAFTA Award winning actors Category:Drama Desk Award winners Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Tony Award winning actors",
 "title": "Al Pacino"
}