{
 "id": "49302",
 "text": "Maria Sharapova (born 19 April 1987) is a retired Russian tennis player. She was born in Nyagan, Western Siberia, RSFSR. == Early life == Her parents had moved from Belarus to protect themselves from the Chernobyl nuclear accident.Maria Sharapova plans 1st trip back to Chernobyl since family fled, USAToday. Retrieved July 23, 2008. The Sharapov1 family moved again in 1989, when Maria became interested in tennis, when watching her father play, and played tennis with a second-hand racquet. She would practice tennis by hitting the tennis ball against the wall every day, and her dad soon noticed that she was very good at the sport. Maria's tennis coaches told the Sharapovs that they should move to Moscow,The Independent, By Andrew Osborn in Moscow, Tuesday, August 3, 2004 Russia, to get better training. The Sharapova moved again, from Moscow, to follow Maria's coach, Martina Navratilova's advice, to move to the United States. There was a problem, though. Sharapova's mother, Yelena, could not get a visa to go to the United States. Meanwhile, Maria and her father tried to get Maria to go to a famous sports school, and they also had to learn English. Maria had already learned a lesson in her life that tennis excellence would only come at a price. “I used to be so lonely,” Maria Sharapova recalls. “I missed my mother terribly. My father was working as mush as he could to keep my tennis-training going. So, he couldn't see me either “Because I was so young, I used to go to bed at 8 p.m. The other tennis pupils would come in 11 p.m. and wake me up and order me to tidy up the room and clean it. “Instead of letting that depress me, I became more quietly determined and mentally tough. I learnt how to take care of myself. I never thought of quitting because I knew what I wanted. When you come from nothing and you have nothing, then it makes you very hungry and determine.... I would have put up with much more humiliation and insults that to steadfastly purse my dream.\" That toughness runs through Maria even today. == Career == She began to win tournaments and many people started to notice her. Her games improved, and Maria Sharapova gained more fans. She has won 35 singles titles in her career, including five Grand Slam championships: Wimbledon in 2004, the US Open in 2006, the Australian Open in 2008 and the French Open in 2012 and 2014. She won an Olympic silver medal at the 2012 Summer Olympics. She is the world number 3 women's tennis player as of September 2015. In 2005, she was ranked world number 1 for the first time, and in 2012 for the last time. In March 2016, Maria Sharapova revealed she had failed a drug test at the 2016 Australian Open, admitting to testing positive for meldonium, a substance banned by the World Anti-Doping Agency (WADA) at the start of 2016. On June 8, 2016, she was suspended from playing tennis for two years by the International Tennis Federation (ITF). == Foot == 1In Russia, female surnames are changed so that their gender can be identified, so Sharapov becomes Sharapova. == References == Category:1987 births Category:Living people Category:Australian Open champions Category:Doping cases in sport Category:Russian tennis players Category:French Open champions Category:Medalists at the 2012 Summer Olympics Category:Olympic silver medalists for Russia Category:Russian models Category:US Open (tennis) champions Category:Wimbledon champions Category:World No. 1 tennis players",
 "title": "Maria Sharapova"
}