{
 "id": "49363",
 "text": "Ruslana Stepanivna Lyzhychko (May 24, 1973) is a popular Ukrainian pop singer, composer, producer, conductor and dancer. She was born in the city of Lviv in Ukraine. She won the Eurovision Song Contest in Istanbul in 2004. She is also a former Member of Parliament serving as deputy in the Ukrainian parliament (Verkhovna Rada) for the Our Ukraine Party. == Human rights == In 2014, Ruslana became a leader in the Maidan movement for human rights and democratic reform in Ukraine. During the demonstrations, Ruslana stayed on the streets. At night she slept in a cold tent. Every night she sang the Ukrainian national anthem for the protestors. When the government police came, she stayed on the stage. She told the protesters to stay calm. She told the police to respect human rights. Ruslana was also in the 2004 Orange Revolution. She was UNICEF National Ambassador in Ukraine in 2005. In 2008 she spoke for green energy. == Awards == In 2014 Ruslana received the International Women of Courage Award form the U.S. Department of State. == Discography == === Albums === * Myt Vesny - Dzvinkiy viter (Moments of Spring - Sonorous wind) (1998) * Ostanne Risdvo x-90 (Last Christmas of the 90ies) (1999) * Najkrashche (The Best) (2001) * Dobriy vechir, tobi... (Good evening to you...) (2002) * Dyki Tantsi (Wild Dances) (2003) * Dyki Tantsi (Eurobonus) (2004) * Wild Dances (2004) * Wild Dances (New Year Edition) (2005) * Club'in (2006) === Singles === * Wild Dances (2004) * Dance with the Wolves (2004) * The Same Star (2005) * Dyka Energyia (Wild Energy) (2006) == References == ==Other websites== *Official website of Ruslana *Official Fan Club of Ruslana *RuslanaTV *RuslanaTube on YouTube * 2015 International Women of Courage Awards, U.S. State Department photostream on Flickr * Secretary's International Women of Courage Award (U.S. Department of State) Category:1973 births Category:Living people Category:Ukrainian singers Category:Pop musicians Category:Eurovision Song Contest winners Category:Women who received the International Women of Courage Award",
 "title": "Ruslana"
}