{
 "id": "49414",
 "text": "Francis Albert \"Frank\" Sinatra (December 12, 1915 – May 14, 1998) was an American singer and actor. His singing career was 60 years long, and more than 150 million records of his have been sold worldwide. Sinatra is widely regarded as one of the best and most admired popular singers in the history of American standards. He is also well known by the nickname \"Old Blue Eyes\". The New York Times said he was \"the first modern pop superstar\". At first, he was mostly known as a crooner, a singer of love songs. By the 1950s and 1960s, he was singing swing and jazz songs as well. Sinatra was also part of the Rat Pack, a group of entertainers (musicians and actors), in the 1950s and 1960s. The name was informal, and the group was not an official organization of any sort, but a group of friends. Members of the Rat Pack included Sinatra, Dean Martin, Sammy Davis, Jr., Peter Lawford, and Joey Bishop, as well as (more loosely) Humphrey Bogart, Judy Garland, Lauren Bacall, Sidney Luft, and Shirley MacLaine. ==Early life== He was born in Hoboken, New Jersey to Italian immigrants. The only child of Sicilian immigrants, a teenaged Sinatra decided to become a singer after watching Bing Crosby perform in the mid-1930s. He'd already been a member of the glee club in his high school and began to sing at local nightclubs ==Acting career== Sinatra was also an actor. He was in movies such as The Manchurian Candidate, From Here to Eternity, and The Man With The Golden Arm. He won an Academy Award for Best Supporting Actor for his performance in From Here To Eternity. ==Personal life== Sinatra was married 4 times. He was married to Nancy Barbato from 1939 to 1951, to Ava Gardner from 1951 to 1957, to Mia Farrow from 1966 to 1968, and to Barbara Marx from 1976 until his death on May 14, 1998. ==Death== Sinatra died on May 14, 1998 at 10:50 pm at the Cedars-Sinai Medical Center in Los Angeles, California, after suffering a heart attack. His wife Barbara was at his side. The words \"The best is yet to come\" are written on his gravestone. ==References== ==Bibliography== • Gildo De Stefano, The Voice - Vita e italianità di Frank Sinatra, Coniglio Press, Roma 2011 ==Other websites== * Album \"Songs for Young Lovers\" at YouTube * Hear Frank Sinatra on the Pop Chronicles * * Category:Actors from Jersey City, New Jersey Category:American movie actors Category:American movie producers Category:American television actors Category:Deaths from myocardial infarction Category:People from Hoboken, New Jersey Category:Musicians from Jersey City, New Jersey Category:American pop singers Category:Kennedy Center honorees Category:Singers from Jersey City, New Jersey Category:1915 births Category:1998 deaths Category:Businesspeople from Jersey City, New Jersey",
 "title": "Frank Sinatra"
}