{
 "id": "4951",
 "text": "{{Infobox U.S. state symbols |Name = Georgia |Flag = Flag of the State of Georgia.svg |Flag link = Flag of Georgia (U.S. state) |Seal = Seal of Georgia.svg |Mammal = North Atlantic right whale |Bird = Brown Thrasher |Insect = Honeybee |Fish = Largemouth Bass |Fossil = Shark tooth |Flower = Cherokee Rose |Tree = Southern Live Oak |Gemstone = Quartz |Reptile = Gopher tortoise |Dog breed = \"Adoptable Dog\" |Food = Grits, Peach |Route marker = Georgia 8.svg }} Georgia is a state in the southeastern part of the United States. It is bordered by Florida to the south, Alabama to the west, Tennessee and North Carolina to the north, and South Carolina to the east. All of Georgia's coastline is on the Atlantic Ocean, which borders Georgia to the southeast. The capital of Georgia is Atlanta. Georgia is divided into 159 counties. Georgia was established in 1732 and became a state in 1788. It was the last of the original 13 colonies and eventually joined in the growing rebellion against Britain. Georgia was named after George II of Great Britain. == History == Georgia was initially inhabited by Native Americans before the arrival of Europeans. The largest tribes were the Cherokee and the Creek. == Geography == There are 5 regional habitats of Georgia. They are the Appalachian Plateau region, the Ridge and Valley region, the Blue Ridge region, the Piedmont region, and the Atlantic Plain region. === Climate === Much of Georgia is a humid subtropical climate, with hot and humid summers. The northern parts of Georgia receive more rain than any other areas in the state. Winters are usually mild. == Cities in Georgia == The capital and largest city in Georgia is Atlanta. The 1996 Olympic Games took place there, and the book and movie Gone with the Wind was set in and around Atlanta in the 1860s. Other big cities in the state include Augusta, Columbus, Savannah, and Macon. Georgia has a total of 159 counties. Image:Cnncenter.jpg|CNN Center Image:Georgia Aquarium Jan 2006.jpg|Georgia Aquarium Image:Atlanta cityscape.jpg|Atlanta ==Related pages== * List of counties in Georgia * List of rivers of Georgia ==References== Category:1788 establishments in the United States",
 "title": "Georgia (U.S. state)"
}