{
 "id": "49577",
 "text": "This is a list of characters for Rumiko Takahashi's manga and anime series, InuYasha. ==Main characters== ===Inuyasha=== The eponymous and main character of the series. He is a half-demon (\"han'yō\" in Japanese). His father was a great demon general and the ruler of the western lands, and his mother was a human princess who opposed social standards. His father died the day he was born and his mother died when he was a child. He wields a sword Tessaiga, made from the fang of his dad,And that forward the tessaiga breaks and the tooth of Inu Yasha's father that was in the tessaiga is replaced by his own canine. On a full moon for some nights, he reverts into a human. Inuyasha meets and spends time with Kikyo, while keeping the legendary jewel. Naraku drives Kikyo and Inuyasha into fighting for the jewel and hating each other. Kikyo pins Inuyasha on a sacred tree with an arrow. Fifty years later, Inuyasha awakens on the tree and meets Kagome. Together, they search for the jewel shards, after Kagome shatters it. As Inuyasha and Kagome begin their relationship, Naraku collects all pieces of the jewel. After Naraku's defeat, Inuyasha marries Kagome. ===Kagome Higurashi=== The heroine of the series. A high school student living in Tokyo and the reincarnation of Kikyo. On her fifteenth birthday, she is dragged by one of the demons in a well and ends up traveling to the past. She finds the jewel extracted from her body and frees Inuyasha from the spell. Kagome says the word, \"sit\", causing the magical necklace to make Inuyasha fall to the ground. As the series progresses, they begin their relationship. Kagome is an archer wielding arrows and a bow. After defeating Naraku, Inuyasha sends Kagome back to her own time. Three years later, Kagome graduates from high school, travels back to the past and marries Inuyasha. ===Naraku=== The enemy demon lord responsible for making Kikyo hate Inuyasha. Fifty years before the series, Onigumo was a thief who is rescued by Kikyo. When Inuyasha makes a relationship for Kikyo, Onigumo fuses with an army of demons and becomes the lord of demons, naming himself Naraku. His spider mark appears on his back. Naraku tricks Inuyasha and Kikyo into hating each other while keeping the jewel, until they are defeated. It is also revealed that Naraku placed the Wind Tunnel curse on Miroku's grandfather, before the latter attempts to resist it. Naraku later possesses Kohaku and had the group of demon slayers killed in battle. When Naraku uses the pieces for the jewel to summon the army of incarnations, he gathers them back after Inuyasha and friends defeat them. At the end of the series, he is sent to the afterlife by Inuyasha. ===Kikyo=== A wise priestess and Kaede's sister. Fifty years ago, Kikyo meets InuYasha, before Naraku manipulates them into fighting each other and Kikyo dies from her injury. When a clay doll-maker named Urasue split the soul in half, one remains within Kagome and the other returns for Kikyo to recover her body. After Kikyo kills Urasue, she continues to reunite with Inuyasha, despite jealousy. After Naraku defeats Kikyo, he takes the remaining jewel shards. Inuyasha reconciles with Kikyo, before she dies once again, being vanished from existence. ==Supporting characters== ===Shippo=== A shape shifting fox demon. Although his age is not mentioned, he is five years old. After helping Inuyasha defeat the Thunder Brothers, Shippo plans to train and succeed for the exam. ===Miroku=== A monk having habits against women. His hand is cursed by the power of Wind Tunnel like his father used it. Though Miroku cannot resist the poison, his hand is cured after Naraku's defeat. Three years later, he marries Sango and has three children. ===Sango=== A demon slayer and Kohaku's older sister. Her grandfather, father and brother lived in a village. Naraku, disguised as the Castle's Lord, drives the army into killing each other, leaving Sango and Kohaku. When Naraku uses the jewel shard to possess Kohaku, Sango resolves to save her brother. Three years after Naraku's defeat, Sango marries Miroku and has three children. ===Kirara=== A pet cat demon often caring for Inuyasha and friends. She transforms into a flying lion during battle. She was originally owned by Midoriko. ===Kaede=== Kikyo's sister and the leader of villagers. She identifies Kagome as Kikyo's reincarnation. She tells both of them that Kagome can see the jewel unlike other people, and because Inuyasha cannot see the jewel but is strong enough to fight for it, they can work together. She loves her sister more than anything. She wishes that Kikyo's soul would rest in peace, even Urasue resurrected her. ===Kohaku=== Sango's younger brother and a demon slayer. After losing his family, he is possessed by Naraku, while the jewel shard is located on his neck. After Naraku removes the shard, Kohaku realizes his mistake. ===Koga=== The leader of a wolf demon tribe whose goal is to avenge his comrades. ===Sesshōmaru=== Inuyasha's older brother. He wields Tenseiga and Bakusaiga. ===Jaken=== A wise imp whom Sesshōmaru recruited on his journey. ===Rin=== A orphaned girl whose family were killed by thieves. She later joins Sesshōmaru. ==Other characters== ===Midoriko=== A priestess and a samurai. She had four souls, which could make anyone powerful. When she created the jewel and the demons begin to abuse it, she dies and is sent to the netherworld. Her statue appeared in a cave in Sango's village, where Shako found the jewel. Midoriko is last seen fighting countless demons, while Inuyasha rescues Kagome from the dimension. ===Shako=== Sango's grandfather and the owner of Kirara and Hiraikotsu. He finds the jewel in the cave and give it to Kikyo. ===Thunder Brothers=== Two brothers who killed Shippo's parents. They include Hiten and Manten. They are defeated by Inuyasha. Characters Category:Anime characters Category:Lists of fictional characters",
 "title": "List of InuYasha characters"
}