{
 "id": "49580",
 "text": "A plane is a tool for shaping wood. Planes are used to flatten, reduce the thickness of, and impart a smooth surface to a rough piece of lumber. As the name implies, the tool turns the worked surface into a smooth plane, a level, even surface. Hand planes are generally the combination of a cutting edge, such as a sharpened metal plate, attached to a firm body, that when moved over a wood surface, take up relatively uniform shavings, by nature of the body riding on the 'high spots' in the wood, and also by providing a relatively constant angle to the cutting edge, render the planed surface very smooth. Hand planes are ancient, originating thousands of years ago. Early planes were made from wood and blades first from bronze and later from iron and even later from steel. The cutting blade or iron was held in place with a wooden wedge. ==Parts of a Plane== Two styles of plane are shown with some parts labeled. The top of the image is a bench plane; the bottom is a block plane. * A: The Mouth is an opening in the bottom of the plane down through which the blade extends, and up through which wood shavings pass. * B: The Iron is a plate of steel with a sharpened edge which cuts the wood. * C: The Lever cap holds the blade down firmly to the body of the plane. * D: The Depth adjustment knob controls how far the blade extends through the mouth. * E: The Knob is a handle on the front of the plane. * F: The Chipbreaker or Cap iron serves to make the blade more rigid and to curl and break apart wood shavings as they pass through the mouth. * G: The Lateral adjustment lever is used to adjust the iron so that the depth of cut is uniform across the mouth. * H: The Tote is a handle on the rear of the plane. * I: The Finger rest knob Block planes are held in the palm of the hand the tip of the user's index finger rests in the indentation on top of the knob. * J: The Frog is a sliding iron wedge that holds the plane Iron at the proper angle. It slides to adjust the gap between the cutting edge and the front of the mouth. The frog is screwed down to the inside of the sole through two parallel slots and on many planes is only adjustable with a screwdriver when the plane iron is removed. ==Types of Planes== Different types of bench planes are designed to perform different tasks, with the name and size of the plane being defined by the use. They are designed to be used in order: * A scrub plane, which removes large amounts of wood quickly, is typically around 9 inches (230 mm) in length, but narrower than a smoothing plane. * A jack plane is around 14 inches (350 mm) long, continues the job of roughing out, but with more accuracy than the scrub. * A jointer plane (including the smaller fore plane) is between 18 and 24 inches (450–600 mm) long, and is used for jointing and final flattening out of boards. * A smoothing plane, up to 10 inches (250 mm) long, is used to begin preparing the surface for finishing. Planes may also be classified by the material of which they are constructed: * A wooden plane is entirely wood except for the blade. The iron is held into the plane with a wooden wedge, and is adjusted by striking the plane with a hammer. * A transitional plane has a wooden body with a metal casting set in it to hold and adjust the blade. * A metal plane is largely constructed of metal, except, perhaps, for the handles. The planes in the image are metal planes. * An infill plane has a body of metal filled with wood on which the blade rests. They are mainly used for cutting cross grained woods. Some special types of planes include: * The shoulder plane, which trims tenons and other joints. * The moulding plane, which is used to cut mouldings along the edge of a board * The rabbet plane, also known as a rebate or openside plane, which cuts rabbets (shoulders, or steps) and dadoes. * The router plane, which cuts grooves and shallow mortises. * The chisel plane, which removes wood up to a perpendicular surface such as from the bottom inside of a box. * The finger plane, which is used for smoothing very small pieces such as toy parts, very thin strips of wood, etc. * The bullnose plane, which has no 'front' on its body, and so can be used in tight spaces like the backs of drawers or on large joint-knobs. * The combination plane, which combines the function of a moulding and rabbet planes, having different cutters and adjustments * The circular or compass plane, which utilizes an adjustment system to control the flex on a steel sheet sole and create a uniform curve. A concave setting permits great control for planning large curves, like table sides or chair arms, and the convex works well for chair arms, legs and backs, and other applications. == Other websites == * Handplane Central A valuable source of information for all types of hand planes, including wooden planes, infill planes and Stanley type planes. Also information on how to make hand planes. * Getting a Hand Plane Ready for Use Instructions for lapping and sharpening a hand plane using a stationary belt sander * Cataloque of American Patented Antique Tools A pictorial collection of antique planes and other tools showing some of the variety in styles. Category:Woodworking tools",
 "title": "Plane (tool)"
}