{
 "id": "49591",
 "text": "Suspension is the term given to the system of springs, shock absorbers and linkages. The suspension acts as an intermediate between the car and the road and solves several problems: * Transfer to the frame or body of forces and moments arising from the interaction of wheels with the road surface; * Link wheels with body or frame; * Provides the necessary for the normal movement of the position of the wheels relative to the frame or body and the road; * Ensures acceptable running smoothness, compensates for uneven pavement. So a car suspension is not just a set of components for connecting wheels and body or frame, but a complex system that makes normal and comfortable movement on car driving. == Springs == Springs are elastic elements of a car suspension that work in conjunction with shock absorbers. The main functions of the springs are: *maintaining vehicle clearance under increased loads; *ensuring reliable tire contact with the road surface; *supporting and even distribution of vehicle weight; *exclude transmission of vibrations and other effects on the car body. == Shock absorbers == Shock absorbers, as a damping element of a modern suspension, convert vibrational energy into heat. The amount of energy absorbed depends on the mass of the car, the stiffness of the spring and the vibration frequency. The principle of operation of dampers is based on the displacement of fluid by a piston through special holes. In various modes, fluid is displaced through openings of different diameters. Due to this, the oscillations are absorbed both during compression and during rebound. As a result, these car suspension parts provide: *vehicle traffic safety; *control of the movement of the spring and suspension; *efficient car control; *axial braking force balance; *prevention of early tire wear; *monitoring of tire contact with the road surface; *control of swinging and oscillations about the vertical axis; *decrease in wearing of knots and units of the car. == Linkages == Using these elements, the suspension parts are fastened together, and also the suspension is attached to the body or frame of the car. The fasteners can be either a regular bolted connection (like other types of rigid joints), or a connection using special elastic elements - rubber-metal hinges (or silent- blocks). ==References== == Other websites == * Shock Absorbers * The Suspension Bible Category:Engineering",
 "title": "Suspension (vehicle)"
}