{
 "id": "49633",
 "text": "The Okinawan language (沖縄口, Uchināguchi) is a Ryukyuan language that is spoken in the Okinawa Islands of Japan. Most linguists say that it branched off from Proto-Japonic, which is the ancestor of Japanese and the Ryukyuan languages. The Japanese government says Okinawan is a dialect of Japanese because of politics. == History == When a group of people called the Yayoi came into the Ryukyu Islands, they brought over a language called Proto-Japonic. This language over time turned into the modern Ryukyuan languages. Proto-Japonic was also spoken in mainland Japan, which turned into Japanese, meaning Japanese and the Ryukyuan languages are related/have the same origin. Okinawan and other Ryukyuan languages were discriminated by Japan during the Meiji period, making the number of speakers go down. Before that, Okinawan was the official language of the Ryukyu Kingdom. == Classification == Okinawan belongs to the Ryukyuan languages. It is in the northern group with both Kunigami and Amami. Sometimes, Kunigami is listed as a dialect of Okinawan but that view is rare. == Speakers == Most older Okinawans speak Okinawan while younger Okinawans speak Japanese. This is why UNESCO lists Okinawan and the other Ryukyuan languages as “endangered”, meaning it’s possible for the language to die out in the future. == Sound Changes (Japanese vs. Okinawan) == There are many sound changes between Japanese (Standard) and Okinawan (Shuri-Naha variety): Japanese “o” - Okinawan “u” (Okinawa = Uchinaa) Japanese “k” - Okinawan “ch” (Okinawa = Uchinaa) Japanese “mi” - Okinawan “nn” (minato = nnatu) Similar sound changes are in other Ryukyuan languages. Kunigami also uses “u” instead of Japanese “o”. ==Sample words== *Mensooree () - Welcome, Hello (when receiving) *Hai (はい) - Hello (gender neutral) *Haisai () - Hello (male only) *Haitai () - Hello (female only) *Ganjyuu () - Fine health (in greeting) *Uchinaaguchi () - Okinawan language *Uchinaanchu (沖縄人/うちなーんちゅ) - Okinawan person *Yamatunchu () - Japanese person *Yuntaku () - Talking *Waa () - Informal me or I *Wan () - Formal me or I *Iyaa () - Informal You *Unjyoo () - Formal you *Un, uu () - Yes *Aibiran () - No *Furaa () - Foolish *Yinagu () - Woman *Yikiga () - Man *Warabaa, Warabi () - Children *Uya () - Parents *Kwa () - A child ( as opposed to Parents) *Niisee () - A young man *Boujya () - A baby *In () - A dog *In-gwa () - Puppy *Mayaa () - A cat *Mayaa-gwa () - Kitty *Hiijyaa (ひーじゃー) - A goat *Uchinaa (うちなー) - Okinawa *Yamatu (やまとっ) - Japan *Too (とー) - China *Chooshin (ちょーしん) - Korea *Uranda (うらんだ) - Europe *Dake (岳) - Mountain ==References== Category:Japonic languages Category:Languages of Asia Category:Ryukyu Islands Category:Ryukyuan languages",
 "title": "Okinawan language"
}