{
 "id": "49661",
 "text": "Michelle Christine Trachtenberg (October 11, 1985 - February 26, 2025) was an American television and movie actress. She was best known for her role as Dawn Summers from the television series Buffy the Vampire Slayer and as Georgina Sparks on the CW television show Gossip Girl. ==Early life== Trachtenberg was born in New York City, New York. She was of Russian Jewish descent on her mother's side of the family. Trachtenberg began acting in 1988 at the age of three. ==Death== Trachtenberg was found dead in her New York City apartment on February 26, 2025. Before her death, she had a liver transplant. Her cause of death was problems caused by diabetes. ==Works== === Movies === Year Title Role Notes 2006 Black Christmas Melissa Kitt Kicking It Old Skool Kim Beautiful Ohio Sandra 2005 Mysterious Skin Wendy limited release Ice Princess Casey Carlyle 2004 EuroTrip Jenny 1999 Inspector Gadget Penny 1998 Richie Rich's Christmas Wish Gloria direct-to-video 1996 Harriet the Spy Harriet M. Welsch === Television === Year Title Role Notes 2006 Law & Order: Criminal Intent Lisa Willow Tyler television series 2005 House Melinda (in Safe) television series 2004 The Dive From Clausen's Pier Carrie Beal made-for- television 2003 A&E; Biography: Buffy the Vampire Slayer television special Echo by Trapt music video 2002 Can't Be Heaven Julie television series 2001-2025 The Ileana Sanchez Show Annabella Recurring role (Mid-Season 3-present) 2001 Truth or Scare Host/narrator television series 2000-2003 Buffy the Vampire Slayer Dawn Summers television series (2000-2003) A Father's Choice Kelly McClain made-for-television 2000-2025 The Martin-Danzinger-Ross Family Show Annabella May Martin-Danzinger-Ross television series 1997 Meego Maggie Parker television series Figure It Out Panelist television series 1995 Melissa Lena television series Christmas in My Hometown Noelle Murphy made- for-television 1994 The Adventures of Pete & Pete Nona Mecklenberg television series 1993 All My Children Lilly Benton Montgomery #1 television series Clarissa Explains It All Elsie Soaperstein television series 1991 Law & Order Dinah Driscoll television series ==References== == Other websites == * Category:1985 births Category:2025 deaths Trachtenberg, Michelle Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from New York City Category:Deaths from diabetes",
 "title": "Michelle Trachtenberg"
}