{
 "id": "497692",
 "text": "The arrondissement of Nérac is an arrondissement of France. It is part of the Lot-et-Garonne département in the Nouvelle-Aquitaine region. Its capital, and subpréfecture of the department, is the city of Nérac. ==History== When the Lot-et-Garonne department was created on 17 February 1800, the arrondissement of Nérac was part of that original department. In 1926, the arrondissement was eliminated but, 1942, it became again an arrondissement ==Geography== The arrondissement of Nérac is in the southwest of Lot-et-Garonne, with an area of . It has 39,227 inhabitants and a population density of inhabitants/km². The arrondissement is bordered to the north by the arrondissement of Marmande, to the east by the arrondissement of Agen, to the south by the Gers department, to the southwest by the Landes department and to the northwest by the Gironde department. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Nérac, there is only one canton where not all its \"communes\" are in the arrondissement: Les Forêts de Gascogne. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Nérac INSEE Code Canton Arrondissements Total Agen Marmande Villeneuve-sur-Lot Nérac 4705 L'Albret 22 22 4708 Les Forêts de Gascogne 16 16 32 4711 Lavardac 20 20 ===Communes=== The arrondissement of Nérac has 58 communes; they are (with their INSEE codes): # Allons, Lot-et-Garonne (47007) # Ambrus (47008) # Andiran (47009) # Anzex (47012) # Barbaste (47021) # Beauziac (47026) # Boussès (47039) # Bruch (47041) # Buzet-sur-Baïse (47043) # Calignac (47045) # Casteljaloux (47052) # Caubeyres (47058) # Damazan (47078) # Durance (47085) # Espiens (47090) # Fargues-sur-Ourbise (47093) # Feugarolles (47097) # Fieux (47098) # Francescas (47102) # Fréchou (47103) # Houeillès (47119) # La Réunion (47222) # Lamontjoie (47133) # Lannes (47134) # Lasserre (47139) # Lavardac (47143) # Leyritz-Moncassin (47148) # Moncaut (47172) # Moncrabeau (47174) # Mongaillard (47176) # Monheurt (47177) # Montagnac-sur-Auvignon (47180) # Montesquieu (47186) # Mézin (47167) # Nomdieu (47197) # Nérac (47195) # Pindères (47205) # Pompiey (47207) # Pompogne (47208) # Poudenas (47211) # Puch-d'Agenais (47214) # Razimet (47220) # Réaup-Lisse (47221) # Saint-Laurent (47249) # Saint-Léger (47250) # Saint-Léon (47251) # Saint- Martin-Curton (47254) # Saint-Pierre-de-Buzet (47267) # Saint-Pé-Saint-Simon (47266) # Saint-Vincent-de-Lamontjoie (47282) # Sainte-Maure-de-Peyriac (47258) # Saumont (47287) # Sauméjan (47286) # Sos (47302) # Thouars-sur- Garonne (47308) # Vianne (47318) # Villefranche-du-Queyran (47320) # Xaintrailles (47327) The communes in the arrondissement with more inhabitants are: INSEE code Commune Population (2014) Canton Intercommunality 47195 Nérac 7,085 L'Albret Albret Communauté 47052 Casteljaloux 4,638 Les Forêts de Gascogne Les Coteaux et Landes de Gascogne 47143 Lavardac 2,213 Lavardac Albret Communauté 47167 Mézin 1,578 L'Albret Albret Communauté 47021 Barbaste 1,502 Lavardac Albret Communauté 47043 Buzet-sur-Baïse 1,319 Lavardac Albret Communauté 47078 Damazan 1,308 Lavardac Le Confluent et des Coteaux de Prayssas 47318 Vianne 1,035 Lavardac Albret Communauté ==Related pages== * Arrondissements of the Lot-et-Garonne department * Communes of the Lot-et-Garonne department ==References== Nerac",
 "title": "Arrondissement of Nérac"
}