{
 "id": "497696",
 "text": "{{Infobox writer | name = Rita Williams-Garcia | honorific_prefix = | honorific_suffix = | image = Rita Williams-Garcia.JPG | image_size = 250px | alt = Picture of Rita Williams-Garcia | caption = Williams-Garcia in 2014. | birth_date = | birth_place = | death_date = | death_place = | period = 1980–2016 | website = }} Rita Williams-Garcia (born 1957) is an American writer of novels for children and young adults. In 2010, her novel Jumped was a National Book Award finalist. She won the 2011 Newbery Honor Award, Coretta Scott King Award, and Scott O'Dell Award for Historical Fiction for her book One Crazy Summer. She has won the PEN/Norma Klein Award.\"Rita Williams-Garcia\", PEN American Center, Her 2013 book, P.S. Be Eleven, was a Junior Literary Guild selection, a New York Times Editors Choice Book, and won the Coretta Scott King Award in 2014.And the Newbery, Caldecott award winners are ..., Ashley Strickland, CNN, January 27, 2014 In 2016 her book Gone Crazy in Alabama won the Coretta Scott King Award. In 2017, her book Clayton Byrd Goes Underground was a finalist for the National Book Award for young people's literature. ==Life== Williams-Garcia was born in Queens, New York. Her father was in the military. She graduated from Hofstra University in 1980. At Hofstra, she studied with Richard Price and Sonya Pilcer. She lives in Jamaica, New York. She taught for many years at Vermont College of Fine Arts. == Awards and accomplishments == Book Date Published Awards One Crazy Summer 2011 2011 Coretta Scott King Award Winner 2011 Newbery Honor Book 2011 Scott O’Dell Prize for Historical Fiction 2010 National Book Award Finalist Junior Library Guild Selection Texas Library Association Best Book for 2010 No Laughter Here 2004 2004-BOOKLIST’s Top 10 Black History Titles for Youth Jumped 2009 Booklist Youth Editors’ Choice National Book Award Finalist Every Time a Rainbow Dies 2001 2003 Silver Kiss (Bologna Children's Book Fair) 2003-4 Kentucky Blue Grass List 2003-4 Tennessee Volunteer State Book Award Master List 2002-3 Texas Library Assoc. YA Roundtable List 2002 ALA Best Books 2002 ALA Top 10 Best Books for Young Adults 2002 Children’s Literature Choice List 2002 New York Public Library Book for the Teen Age Blue Tights 1987 1991 PEN/Norma Klein Citation (w/FastTalk on a Slow Track) 1989 Youth Advisory Board “A List for Imagination and Survival” 1989 New York Public Library Books for the Teen Age 1988 Recommended list for the National Conference of Christians and Jews 1988 Recommended Books for Reluctant Young Adult Readers (YALSA) 1988 Cooperative Children’s Book Center Choices Catching the Wild Waiyuuzee 2000 2001 Bank Street College Best Children’s Books for the Year Fast Talk on a Slow Track 1991 1991 PEN/Norma Klein Citation 1991 Best Book for Young Adults (American Library Association) 1991 Parents’ Choice Honors for Storytelling 1992 Recommended list for the National Conference of Christians and Jews 1992 Recommended Books for Reluctant Young Adult Readers (YALSA) Like Sisters on the Homefront 1995 LA Best Book of the Decade 1997 PEN\\Norma Klein Honor 1997 Texas Library Assoc. YA Roundtable List 1996 Coretta Scott King Honor Book 1995 Best Books – School Library Journal 1995 Best Books – Publishers Weekly 1995 Best Books – American Library Association 1995 Books Recommended for Reluctant Readers – ALA 1995 Horn Books Fanfare Award 1996 CBC Notable in the Field of Social Studies- NCSS ==References== Category:1957 births Category:Living people Category:Writers from New York (state) Category:American children's writers",
 "title": "Rita Williams-Garcia"
}