{
 "id": "497694",
 "text": "Katherine Alice Applegate (born October 9, 1956) is an American author. == Early life == Applegate was born in Ann Arbor, Michigan, on October 9, 1956. She grew up in Grand Rapids, a large city in Michigan. Applegate went to the University of Texas in Austin. She graduated from college in 1979. \"Katherine Applegate.\" Contemporary Authors Online. Detroit: Gale, 2013. Biography in Context. Web. 23 Mar. 2015. == Career == Applegate is known for writing children's books. She wrote many of them for Disney Press and contain Disney characters. Her husband, Michael Grant, helped her write many of her 150 books. Applegate is best known for science fiction and fantasy, which is reflected in her famous series: Animorphs. She has also written many realistic fiction novels, especially about girls in high school.Pavonetti, Linda M. \"Applegate, Katherine.\" World Book Advanced. World Book, 2015. Web. 23 Mar. 2015. == Accomplishments == Applegate has written mostly children's books. Her most famous is The One and Only Ivan, the story of a gorilla who lives caged in a shopping mall. This book won a Newbery Medal in 2013, which is given to America's best children's book.Kaufman, Leslie. \"The Newbery Medal Honors A Tale Told By a Gorilla.\" New York Times 28 Jan. 2013: C1(L).Biography in Context. Web. 23 Mar. 2015. Another popular series she created, Animorphs has been turned into a Nickelodeon television show. In 2012 Eve and Adam was recorded to be an audio book with Macmillan Audio. Along with her amazing books she also has a husband and two daughters.Minzesheimer, Bob. \"The One and Only Ivan' wins one and only Newbery.\" USA Today 29 Jan. 2013: 02D.Biography in Context. Web. 23 Mar. 2015. ==Written works== *(With L.E. Blair) Horse Fever (\"Girl Talk\" series), Western Publishing (Racine, WI), 1991. *(With L.E. Blair) Family Rules (\"Girl Talk\" series), Western Publishing (Racine, WI), 1991. *(With L.E. Blair) Randy's Big Dream, Western Publishing (Racine, WI), 1992. *(With L.E. Blair) Randy and the Great Canoe Race, Western Publishing (Racine, WI), 1992. *(With L.E. Blair) Randy and the Perfect Boy, Western Publishing (Racine, WI), 1992. *(With L.E. Blair) Randy's Big Chance, Western Publishing (Racine, WI), 1992. *The Story of Two American Generals: Benjamin O. Davis, Jr., and Colin L. Powell (nonfiction), Dell (New York, NY), 1992. *Disney's The Little Mermaid: The Haunted Palace, illustrated by Philo Barnhart, Disney Press (New York, NY), 1993. *Disney's The Little Mermaid: King Triton, Beware!, illustrated by Philo Barnhart, Disney Press (New York, NY), 1993. *Disney's Christmas with All the Trimmings: Original Stories and Crafts from Mickey Mouse and Friends, illustrated by Phil Wilson, Disney Press (New York, NY), 1994. *The Boyfriend Mix-up, illustrated by Philo Barnhart, Disney Press (New York, NY), 1994. *Sharing Sam (novel), Bantam (New York, NY), 1995. *Disney's Tales from Agrabah: Seven Original Stories of Aladdin and Jasmine, illustrated by Fred Marvin and Jose Cardona, Disney Press (New York, NY), 1995. ==References== Category:Writers from Grand Rapids, Michigan Category:People from Ann Arbor, Michigan Category:American children's writers Category:1956 births Category:Living people",
 "title": "Katherine Applegate"
}