{
 "id": "497675",
 "text": "Bound for Glory (2013) was a professional wrestling pay-per-view show made by Total Nonstop Action Wrestling (TNA). It was held on October 20, 2013 at the Viejas Arena in San Diego, California. It was the ninth Bound for Glory event that TNA held and was also the fourth event in TNA's 2013 pay-per-view schedule. This was the first time that TNA held an event in San Diego. There were eight matches on the card. The main event saw A.J. Styles defeat Bully Ray to win the TNA World Heavyweight Championship. ==Matches== # Results Stipulations Times 1P The BroMans (Jessie Godderz and Robbie E) (with Phil Heath) defeated Chavo Guerrero and Hernandez, Bad Influence (Christopher Daniels and Kazarian) and Eric Young and Joseph Park Tag team Gauntlet match for a TNA World Tag Team Championship match later in the night 22:14 2 Chris Sabin (with Velvet Sky) defeated Manik (c), Austin Aries, Jeff Hardy and Samoa Joe Ultimate X match for the TNA X Division Championship 11:58 3 The BroMans (Jessie Godderz and Robbie E) (with Phil Heath) defeated Gunner and James Storm (c) Tag team match for the TNA World Tag Team Championship 11:41 4 Gail Kim defeated ODB (c) and Brooke Three-Way match for the TNA Knockouts Championship 10:19 5 Bobby Roode defeated Kurt Angle Singles match 20:58 6 Ethan Carter III defeated Norv Fernum Singles match 3:26 7 Magnus defeated Sting Singles match 11:05 8 A.J. Styles defeated Bully Ray (c) (with Brooke) No Disqualification match for the TNA World Heavyweight Championship 10:56 (c) – refers to the champion(s) heading into the match P – indicates that the match happened on the pre-show ===Tag team gauntlet match=== Order Team Elimination Eliminated by 1 Bad Influence (Christopher Daniels and Kazarian) 2nd Young and Park 2 Chavo Guerrero Jr. and Hernandez 1st Bad Influence 3 Eric Young and Joseph Park 3rd BroMans 4 The BroMans (Robbie E and Jessie Godderz) Winners N/A ==References== Category:2013 in professional wrestling Category:Sports in San Diego Category:Total Nonstop Action Wrestling pay-per-view events Category:2013 in California Category:21st century in San Diego Category:October 2013 events",
 "title": "Bound for Glory (2013)"
}