{
 "id": "497764",
 "text": "Matthew \"Matt\" Staton Bomer (born October 11, 1977) is an American actor. He made his television debut with Guiding Light in 2001. He is known for his recurring role in the NBC television series Chuck as Bryce Larkin. He played the lead role of Neal Caffrey in the television series White Collar. The show ran from 2009 to 2014. In 2010 he won won the Breakthrough Male Television Performer award for his performance in White Collar. ==Filmography== Movies Year Title Role Notes 2005 Flightplan Eric 2006 The Texas Chainsaw Massacre: The Beginning Eric Hill 2011 In Time Henry Hamilton 2012 Magic Mike Ken 2013 Superman: Unbound Superman/Clark Kent Voice; direct-to-video 2014 Winter's Tale Young Man 2014 Space Station 76 Ted 2015 Magic Mike XXL Ken Post- production 2015 B.O.O.: Bureau of Otherworldly Operations Voice; filming 2016 The Nice Guys Filming Television Year Title Role Notes 2000 All My Children Ian Kipling Episode: \"#7485\" 2001–03 Guiding Light Benjamin \"Ben\" Reade 2002 Relic Hunter Driver agent Uncredited; episode: \"Fire in the Sky\" 2003–04 Tru Calling Luc Johnston Main cast (season 1); 14 episodes 2004 North Shore Ross Episode: \"Bellport\" 2007 Traveler Jay Burchell Main cast; 8 episodes 2007–09 Chuck Bryce Larkin 7 episodes 2009–14 White Collar Neal Caffrey Main cast; 81 episodes 2012 Glee Cooper Anderson Episode: \"Big Brother\" 2013 The New Normal Monty Episode: \"The Goldie Rush\" 2014 The Normal Heart Felix Turner Television film 2014 American Horror Story: Freak Show Andy Episode: \"Pink Cupcakes\" ==Theatre== Broadway Year Title Playwright Role Notes 2011 8 Dustin Lance Black Jeff Zarrillo * Broadway debut * Performances: Eugene O'Neill Theatre (September 19, 2011) Other stage credits Year Title Playwright Role Notes 1995 A Streetcar Named Desire Tennessee Williams Young Collector * Performances: The Alley Theatre in Houston, Texas (1995) 1998 Joseph and the Amazing Technicolor Dreamcoat Andrew Lloyd Webber, Tim Rice Issachar * Performances: Utah Shakespearean Festival in Cedar City, Utah (1998) 2003 Roulette Paul Weitz Jock * Performances: New York Stage and Film, Powerhouse Theater (August 1–3, 2003) 2007 Villa America Crispin Whittell Ernest Hemingway * Performances: Williamstown Theatre Festival, Nikos Stage (July 11–22, 2007) 2012 8 Dustin Lance Black Jeff Zarillo * Performances: Wilshire Ebell Theatre Los Angeles (March 3, 2012) == References == == Other websites == * Category:Actors from Missouri Category:1977 births Category:Living people Category:American movie actors Category:American stage actors Category:American television actors",
 "title": "Matt Bomer"
}