{
 "id": "497808",
 "text": "David Clayton Henrie (born July 11, 1989) is an American actor, television writer, director and producer. He is known for playing Ted Mosby's future son Luke Mosby on How I Met Your Mother, Justin Russo in Wizards of Waverly Place and Larry on That's So Raven. He also played Rudy Ising in Walt Before Mickey. == Filmography == === Movies === Year Title Role Notes 2003 Monster Makers Danny Burke Minor Role 2004 The Hollywood Mom's Mystery Oliver Palumbo Minor Role 2004 Arizona Summer Bad Minor Role 2009 Dadnapped Wheeze Main Role; Disney Channel Original Movie 2009 Wizards of Waverly Place: The Movie Justin Russo Main Role; Disney Channel Original Movie 2012 The Secret World of Arrietty Shawn (Voice) 2013 1000 to 1 Cory Weissman Main role 2013 Grown Ups 2 Frat Boy Zac Minor role 2013 Catch Short film - Writer/director/producer 2015 Walt Before Mickey Rudy Ising Main Role 2015 Little Boy London Busbee 2015 Paul Blart: Mall Cop 2 Lane Filming 2021 Reagan Young Ronald Reagan Post- production === Television === Year Title Role Notes 2002 Providence Mark Triedman (1 episode) \"Gotcha\" 2002 Without a Trace Gabe Freedman (1 episode) \"Birthday Boy\" 2003 The Pitts Petey Pitt Main Role 2003 The Mullets (1 episode) Grudge Match 2003 Judging Amy Jeremy (1 episode) \"Sex and the Single Mother\" 2004 The D.A. Alex Henry (1 episode) \"The People vs. Patricia Henry\" 2004 Method & Red Skyler Blaford Recurring 2004 Jack and Bobby Sniffly (1 episode) \"The Kindness of Strangers\" 2004 NCIS Willy Shields (1 episode) \"Terminal Leave\" 2004–2007 That's So Raven Larry Recurring; 12 episodes 2005 House Tommy (1 episode) \"Cursed\" 2005–2014 How I Met Your Mother Luke Mosby Recurring (stock footage used since Season 2), 64 episodes 2006 Cold Case Dale Wilson (1 episode) \"Fireflies\" 2007 Studio DC: Almost Live Himself Second Show 2007–2012 Wizards of Waverly Place Justin Russo Main Role 2008 Disney Channel Games Himself (Cyclone's Team Captain) Green Team 2009 The Suite Life on Deck Justin Russo (1 episode) \"Double Crossed\" 2009 Disney Channel's 3 Minute Game Show Himself (2 episodes) \"The Cheetah Girls: One World\" and \"Wizards of Waverly Place: The Movie\" 2010 JONAS L.A. Himself (2 episodes) \"Boat Trip\" and \"On the Radio\" 2010 Easy to Assemble Ethan (1 episode) \"Flying Solo\" 2011 Disney's Friends for Change Games Himself Green Team 2013 Arrested Development Himself TV Series 2014 Mind Games Unknown Role TV Series ==Awards and nominations== Year Award Category Work Result 2003 Young Artist Awards Best Performance in a TV Drama Series - Guest Starring Young Actor Without a Trace 2004 Young Artist Awards Best Performance in a Feature Film - Leading Young Actor Arizona Summer 2004 Young Artist Awards Best Performance in a TV Series (Comedy or Drama) - Leading Young Actor The Pitts 2008 Young Artist Awards Best Young Ensemble Performance in a TV Series Wizards of Waverly Place 2011 Kids' Choice Awards Favorite TV Sidekick Wizards of Waverly Place Nominees 2011. Nick.com. Retrieved 2012-03-03. ==References== ==Other websites== * Category:1989 births Category:Living people Category:American movie actors Category:American television actors",
 "title": "David Henrie"
}