{
 "id": "497891",
 "text": "Andrew James Clutterbuck (born 14 September 1973),BFI Film & TV Database – Andrew Lincoln . Ftvdb.bfi.org.uk. Retrieved on 25 August 2011. better known by his stage name Andrew Lincoln, is an English actor. He is best known for his portrayal of Rick Grimes in the AMC drama series The Walking Dead. He first came to public attention as Egg in the BBC drama This Life, followed by roles such as Simon in the Channel 4 sitcom Teachers and Mark in the romantic comedy movie Love Actually. == Early life == Lincoln was born in London. He is the son of a civil engineer father and a nurse mother. His family moved to Kingston upon Hull when he was 18 months old. Then they moved to Bath, Somerset when he was eight or nine. He attended Beechen Cliff School. He had his first acting role at the age of 14 as the Artful Dodger in a school production of Oliver!. He spent a summer at the National Youth Theatre in London. He became interested in acting as a career. After leaving school, he studied at the Royal Academy of Dramatic Arts (RADA). He began to use \"Andrew Lincoln\" as his stage name. ==Filmography== ===Film=== Year Film Role Notes 1995 Boston Kickout Ted 1998 Understanding Jane Party Stonehead 1 1999 A Man's Best Friend Man Short film Human Traffic Felix 2000 Gangster No. 1 Maxie King Offending Angels Sam 2003 Love Actually Mark 2004 Enduring Love TV Producer 2006 These Foolish Things Christopher Lovell Hey Good Looking! Paul Scenes of a Sexual Nature Jamie 2010 Heartbreaker Jonathan Made in Dagenham Mr Clarke 2020 Penguin Bloom Cameron Bloom ===Television=== Year Title Role Notes 1994 Drop the Dead Donkey Terry Episode: \"Births and Deaths\" 1995 N7 Andy Unaired pilot 1996 Over Here Cappy 2 episodes Bramwell Martin Fredericks Episode: \"The Return of the Betrayer\" 1996–1997 This Life Edgar \"Egg\" Cooke 32 episodes 1997 The Woman in White Walter Hartright 2 episodes 2000 Bomber Captain Willy Byrne Television film 2000–2001 Shipwrecked Narrator (voice) 27 episodes 2000 A Likeness in Stone Richard Kirschman Television film 2001–2003 Teachers Simon Casey 20 episodes; also directed 2 episodes 2003 Trevor's World of Sport Mark Boden Episode #1.1 State of Mind Julian Latimer 3 episodes The Canterbury Tales Alan King Episode: \"The Man of Law's Tale\" 2004 Lie with Me DI Will Tomlinson 2 episodes Whose Baby? Barry Flint Television film 2005–2006 Afterlife Robert Bridge 14 episodes 2007 This Life + 10 Edgar \"Egg\" Cooke Television special 2009 Wuthering Heights Edgar Linton 2 episodes The Things I Haven't Told You DC Rae Television film Moonshot Michael Collins 2010 Strike Back Hugh Collinson 6 episodes 2010–2018, 2020, 2022 The Walking Dead Rick Grimes 111 episodes 2014 Tigers About the House Narrator (voice) 4 episodes 2017 Red Nose Day Actually Mark Television short Robot Chicken Rick Grimes (voice) Episode: \"The Robot Chicken Walking Dead Special: Look Who's Walking\" 2018 Fear the Walking Dead Rick Grimes Episode: \"What's Your Story?\" 2022 Guillermo del Toro's Cabinet of Curiosities Edgar Bradley Episode: \"The Murmuring\" 2024 The Walking Dead: The Return Himself TV special The Walking Dead: The Ones Who Live Rick Grimes Lead role, also executive producer and co-creator TBA Cold Water John Filming ===Theatre=== Year Title Role Location Playwright 1998 Sugar Sugar Joe Bush Theatre Simon Bent 1999 Hushabye Mountain Danny Hampstead Theatre Jonathan Harvey 2000–2001 Blue/Orange Bruce Cottesloe Theatre (2000) Duchess Theatre (2001) Joe Penhall 2002 Free Alex Loft (Lyttelton Theatre) Simon Bowen 2006 The Late Henry Moss Ray Almeida Theatre Sam Shepard 2009 Parlour Song Dale Almeida Theatre Jez Butterworth 2020 A Christmas Carol Ebenezer Scrooge The Old Vic Jack Thorne ===Video games=== Year Title Role Notes 2021 Fortnite Battle Royale Rick Grimes Likeness 2024 Call of Duty: Modern Warfare III Playable Character (DLC); Voice and Likeness ===Audio=== Year Title Role Notes 2024 A Better Paradise Volume One: An Aftermath Dr Mark Tyborn == Awards and nominations == Year Award Category Result Work 2004 British Academy Television Awards Best New Director (Fiction) Teachers 2004 Phoenix Film Critics Society Award Best Ensemble Acting Love Actually 2004 Empire Awards Best Newcomer Love Actually 2007 Golden Nymph Award Outstanding Actor – Drama Series Afterlife 2010 IGN Summer Movie Award Best TV Hero The Walking Dead 2011 Saturn Awards Best Actor on Television The Walking Dead 2011 Scream Awards Best Horror Actor The Walking Dead 2012 Satellite Awards Best Ensemble – Television (Special Achievement Award) The Walking Dead 2013 Saturn Awards Best Actor on Television The Walking Dead 2013 Critics' Choice Television Award Best Actor in a Drama Series The Walking Dead 2013 TV Guide Award Favorite Actor The Walking Dead 2014 People's Choice Awards Favorite Sci-Fi/Fantasy TV Actor The Walking Dead 2014 People's Choice Awards Favorite TV Anti-Hero The Walking Dead 2015 Saturn Awards Best Actor on Television The Walking Dead 2015 Fangoria Chainsaw Awards Best TV Actor The Walking Dead 2016 Saturn Awards Best Actor on Television The Walking Dead 2016 Teen Choice Awards Choice TV Actor: Fantasy/Sci-Fi The Walking Dead 2017 People's Choice Awards Favorite Sci-Fi/Fantasy TV Actor The Walking Dead 2017 Saturn Awards Best Actor on Television The Walking Dead 2018 Saturn Awards Best Actor on Television The Walking Dead 2018 People's Choice Awards Best TV Actor The Walking Dead 2019 Saturn Awards Best Actor on Television The Walking Dead == References == == Other websites == * Category:1973 births Category:Living people Category:Actors from London Category:Actors from Somerset Category:English movie actors Category:English television actors Category:People from Bath, Somerset Category:People from Kingston upon Hull",
 "title": "Andrew Lincoln"
}