{
 "id": "497827",
 "text": "The Sherman Brothers were an American songwriting duo that wrote music for musical movies. They were Robert B. Sherman (December 19, 1925 – March 6, 2012) and Richard M. Sherman (June 12, 1928 – May 25, 2024). The Sherman Brothers wrote more motion-picture musical song scores than any other songwriting team in movie history.London Today on air interview with Robert B. Sherman, April 17, 2002 Movie scores of the Sherman Brothers include Mary Poppins, Chitty Chitty Bang Bang, The Jungle Book, Charlotte's Web and The Aristocats. ==Life and work== Sons of Russian Jewish immigrants, Robert and Richard Sherman began writing songs together in 1951 on a challenge from their father, Tin Pan Alley songwriter Al Sherman. The brothers wrote together and with different songwriting partners throughout the rest of the decade. In 1958 Robert founded the music publishing company Music World Corporation. It later had a relationship with Disney's BMI-affiliated publishing arm, Wonderland Music Company. That same year, the Sherman Brothers had their first top-ten hit with \"Tall Paul,\" sung by Mouseketeer Judy Harriet on the Surf Records label. It was also sung by Mouseketeer Annette Funicello. The success of this song got the attention of Walt Disney. He then hired the Sherman Brothers as Staff Songwriters for Walt Disney Studios. The first song they wrote on personal assignment by Walt Disney was \"Strummin' Song\" in 1961. It was used in the Annette Funicello made-for-television movie called The Horsemasters. While at Disney, the Sherman Brothers wrote more motion-picture musical scores than any other songwriters in the history of movies. They also wrote what is perhaps their best-known song, \"it's a small world (after all)\" for the 1964 New York World's Fair. Since then, some have claimed that this has become the most translated and performed song on Earth, although this is largely due to the fact that it is played at Disney's theme park \"it's a small world\" attractions of the same name. In 1965 the Sherman Brothers won two Academy Awards for Mary Poppins, which includes the songs \"Feed The Birds,\" \"Supercalifragilisticexpialidocious,\" and the Oscar-winning \"Chim Chim Cher- ee.\" Since Mary Poppins' first was shown, the Shermans have earned nine Academy Award nominations, two Grammy Awards, four Grammy Award nominations, and 23 gold- and platinum-certified albums. Robert and Richard Sherman worked directly for Walt Disney, completing the scores for the live-action musical movies The Happiest Millionaire and The One and Only, Genuine, Original Family Band until Disney's death in 1966. Since leaving the company, the brothers have worked freelance as songwriters on scores of motion pictures, television shows, theme-park exhibits, and stage musicals. Their first non-Disney assignment came with Albert R. Broccoli's motion picture production Chitty Chitty Bang Bang for United Artists in 1968. It got the brothers their third Academy Award nomination for Best Original Song for its particularly memorable titular song. In 1970, the Shermans returned to Disney for a brief stint where they completed work on The Aristocats and Bedknobs and Broomsticks. The latter movie got the brothers their fourth and fifth Oscar nominations. 1972 saw the release of Snoopy Come Home, for which the brothers received a Grammy nomination. In 1973 the Sherman Brothers also made history by becoming the only Americans ever to win First Prize at the Moscow Film Festival for Tom Sawyer, for which they also authored the screenplay. In 1976 “The Slipper and the Rose” was picked to be the Royal Command Performance of the year. The performance was attended by Queen Elizabeth, the Queen Mother. A modern musical version of the classic Cinderella story, \"Slipper\", also featured songs, score, and screenplay by the Sherman Brothers. Two further Academy Award nominations were gotten by the brothers for the movie. That same year the Sherman Brothers got their star on the Hollywood \"Walk of Fame\" directly across from Grauman's Chinese Theater. The Sherman Brothers' many other Disney and non-Disney top box office movie credits include The Jungle Book (1967), The Aristocats (1970), The Parent Trap (1961), The Parent Trap (1998), Charlotte's Web (1973), Huckleberry Finn (1974),The Many Adventures of Winnie the Pooh (1977), Snoopy, Come Home (1972), Bedknobs and Broomsticks (1971), and Little Nemo: Adventures in Slumberland (1989). Outside motion-pictures, their Tony Award-nominated smash hit Over Here! (1974) was the biggest- grossing original Broadway musical of that year. The Sherman Brothers have also written numerous top selling songs including \"You're Sixteen,\" which reached Billboard's Hot 100 top 10 twice: first with Johnny Burnette in 1960 and then at #1 with Ringo Starr more than thirteen years later. Other top-ten hits include \"Pineapple Princess,\" \"Let's Get Together,\" and more. In 2000 the Sherman Brothers wrote the song score for the Disney movie The Tigger Movie. This movie marked the brothers' first major motion picture for the Disney company in over 28 years. In 2003, four Sherman Brothers' musicals ranked in the Top 10 Favorite Children's Films of All Time in a British nationwide poll reported by the BBC. Most notably, Chitty Chitty Bang Bang 1968 topped the list at #1. In later years, with Robert's move to London, the brothers wrote many new songs for the stage musical presentations of Chitty Chitty Bang Bang and Mary Poppins, produced by Disney and Cameron Mackintosh. For their contributions to the motion picture industry, the Sherman brothers have a star on the Hollywood Walk of Fame at 6918 Hollywood Blvd. They were inducted into the Songwriters Hall of Fame on June 9, 2005. On November 16, 2006, Mary Poppins premiered at the New Amsterdam Theatre on Broadway. On November 17, 2008 the Sherman Brothers got the National Medal of Arts which is the highest honor given to artists by the United States Government. The award was presented by United States President George W. Bush in an East Room ceremony at The White House. On May 22, 2009, The Boys: the Sherman Brothers’ Story, a movie about the pair, was shown in theatres. The movie was directed and produced by their sons, Gregory V. Sherman and Jeff Sherman. It was put out by Walt Disney Pictures. In October 2009, Disney released a 59 track, two CD compendium of their work for the studio spanning forty-two years. The CD is titled \"The Sherman Brothers Songbook\". On March 11, 2010 the Sherman Brothers were presented with a Window on Mainstreet Disneyland in Anaheim, California, in honor of their contribution to Disney theme parks. On May 17, 2010, the Sherman Brothers received the \"Career Achievement Award\" at The Theatre Museum's 2010 Awards Gala in New York City. ==Later achievements== * In 2000 the Sherman Brothers wrote the award winning score to The Tigger Movie. It gained number-one status in both theatrical box office and video sales. They also composed a song for the movie called \"Your Heart Will Lead You Home\". It was co-written and performed by Kenny Loggins. * The Sherman Brothers' motion picture Chitty Chitty Bang Bang was adapted into a London West End Musical in 2002. It played at the London Palladium on April 16, 2002, featuring many new songs and a reworked score by both Sherman Brothers. It was nominated for a 2003 Laurence Olivier Theatre Award for Best New Musical. The Sherman Brothers each received the Musical Theatre Award from the Variety Club of Great Britain that year as well for Chitty. It finished a record breaking three-and-a-half- year run at the Palladium. It became the longest running show in the theater's century long history. In 2004, the premiere of Mary Poppins arrived on the stage. In 2005, Poppins was nominated for nine Olivier Awards. In 2005, Chitty went to Broadway and was nominated for nine Tonys and also began its nationwide (UK) tour. * On June 9, 2005, both Shermans were inducted into the Songwriters Hall of Fame alongside Bill Withers, Steve Cropper, John Fogerty, Isaac Hayes, and David Porter. * On November 16, 2006, the Cameron Mackintosh/Disney production of Mary Poppins made its Broadway premiere at the New Amsterdam Theater featuring the Sherman Brothers’ classic songs. * In 2007 during the 40th-anniversary DVD rerelease of The Jungle Book London press junket, the Sherman Brothers were witnessed by press working on a new song for Inkas (see below) in the same Brown's Hotel room where The Jungle Book was originally penned by British writer Rudyard Kipling over a hundred years earlier.http://dvd.monstersandcritics.com/features/article_1389042.php/A_Chat_with_The_Aristocats_composer_Richard_Sherman_of_the_Sherman_Brothers| A Chat with \"The Aristocats\" composer, Richard Sherman of the Sherman Brothers * In February 2008, Chitty Chitty Bang Bang began a second UK tour. In 2008 and 2009, Poppins premiered in numerous cities throughout the world including Stockholm, Copenhagen, Budapest, Toronto, Shanghai, Sydney, Johannesburg, Amsterdam, Buenos Aires, São Paulo, and Helsinki. Full UK and US tours of Poppins also commenced in 2008, 2009 and 2010 respectively. * On May 21, 2011, the Sherman Brothers were each awarded honorary doctorate degrees in Fine Arts from their alma mater, Bard College. This was Robert's second honorary doctorate. His first was granted by Lincoln College on May 12, 1990. Robert's critically acclaimed autobiography, Moose: Chapters From My Life was published after his death by AuthorHouse Publishers on November 27, 2013 in anticipation of the release of the Walt Disney Pictures movie Saving Mr. Banks. Set in 1961 and based on the stories behind the original development meetings for Disney's movie version of Mary Poppins, Saving Mr. Banks features actors BJ Novak as Robert Sherman and Jason Schwartzman as Richard Sherman. ==Collaboration from afar== From 2002, Robert Sherman lived in London, England. He moved from Beverly Hills, while Richard Sherman remained in California. Robert Sherman died in London on March 6, 2012. ==Major scores== * The Parent Trap, 1961 * A Symposium on Popular Songs, 1962 * In Search of the Castaways, 1962 * Summer Magic, 1963 * The Sword in the Stone, 1963 * Big Red, 1963 * Mary Poppins, 1964 * \"There's a Great Big Beautiful Tomorrow\", 1964 * Winnie the Pooh and the Honey Tree, 1966 * The Happiest Millionaire, 1967 * The Jungle Book, 1967 * The One and Only, Genuine, Original Family Band, 1968 * Chitty Chitty Bang Bang, 1968 * Winnie the Pooh and the Blustery Day, 1968 * The Aristocats, 1970 * Bedknobs and Broomsticks, 1971 * Snoopy, Come Home, 1972 * Charlotte's Web, 1973 * Tom Sawyer, 1973 * Huckleberry Finn, 1974 * Winnie the Pooh and Tigger Too, 1974 * The Slipper and the Rose, 1976 * The Many Adventures of Winnie the Pooh, 1977 * The Magic of Lassie, 1978 * Magic Journeys, 1982 * Welcome to Pooh Corner, 1983 * Winnie the Pooh and a Day for Eeyore, 1983 * Little Nemo: Adventures in Slumberland, 1992 * The Mighty Kong, 1998 * The Tigger Movie, 2000 * Winnie the Pooh, 2011 ==Motion picture screenplays== * A Symposium on Popular Songs, 1962 (uncredited) * Mary Poppins, 1964 (*treatment only, uncredited) * The Adventures of Tom Sawyer, 1973 * The Adventures of Huckleberry Finn, 1974 * The Slipper and the Rose, 1976 * The Magic of Lassie, 1978 * Ferdinand the Bull, 1986 (*TV screenplay) * Little Nemo: Adventures in Slumberland (one of the songwriters) * Inkas the Ramferinkas, 2015 (announced) ==Stage musicals== * Victory Canteen, 1971 (Ivar Theatre, L.A.) * Over Here!, 1974 (Broadway, NY) * Charlotte's Web, 1978 * Dawgs, 1983 (Variety Arts Center, L.A.) * Busker Alley, 1995 (U.S. Tour) * Chitty Chitty Bang Bang, 2002 (London) * Mary Poppins, 2004 (London) * On the Record 2004-5 (U.S. Tour) * Chitty Chitty Bang Bang, 2005 (Broadway, NY) * Chitty Chitty Bang Bang, 2005 (UK Tour) * Busker Alley, 2006 (Broadway, NY – *one night only) * Mary Poppins, 2006 (Broadway, NY) * Chitty Chitty Bang Bang, 2007 (Singapore) * Mary Poppins, 2008 (UK Tour) * Chitty Chitty Bang Bang, 2008 (Second UK Tour) * Mary Poppins, 2008 (Stockholm) * Mary Poppins, 2009 (First US Tour) * Mary Poppins, 2009 (Copenhagen) * Mary Poppins, 2009 (Budapest) * Mary Poppins, 2009 (Shanghai) * Mary Poppins, 2009 (Australia) * Mary Poppins, 2009 (South Africa) * Mary Poppins, 2009 (Scheveningen) * Mary Poppins, 2009 (Helsinki) * Mary Poppins, 2012-13 (Second US Tour) ==Theme park songs== *Adventure Thru Inner Space **\"Miracles from Molecules\" *America on Parade **\"The Glorious Fourth\" *CommuniCore **\"The Astuter Computer Revue\" (for the 1982 premiere of the pavilion at EPCOT Center) *Epcot Center Opening & Dedication **\"The World Showcase March\" *Pepsi Presents WALT DISNEY'S \"it's a small world\" – a Salute to UNICEF and the World's Children for the 1964 New York World's Fair **it's a small world (after all) then adapted to each Disney park \"it's a small world\" attraction installation. *Journey Into Imagination (and Journey Into Imagination With Figment) **\"One Little Spark\" *Magic Journeys **\"Magic Journeys\" **\"Makin' Memories\" *Meet the World in Tokyo Disneyland **\"Meet the World\" **\"We Meet the World with Love\" *Rocket Rods **\"Magic Highways\" *Walt Disney's Carousel of Progress **\"The Best Time of Your Life\" **\"There's a Great Big Beautiful Tomorrow\" *Walt Disney's Enchanted Tiki Room **\"The Tiki, Tiki, Tiki Room\" ==Other== *The Spectrum Song – for Walt Disney's The Wonderful World of Color. Sung by Paul Frees as Ludwig Von Drake. ==Professional awards== ===Academy Awards=== *1965 WON Academy Award in the category of \" Best Original Song\" for \"Chim Chim Cher-ee\" from Mary Poppins *1965 WON Academy Award in the category of \"Best Substantially Original Score\" for Mary Poppins *1969 Nominated Academy Award in the category of \"Best Original Song\" for \"Chitty Chitty Bang Bang\" from Chitty Chitty Bang Bang *1972 Nominated Academy Award in the category of \"Best Original Song\" for \"The Age of Not Believing\" from Bedknobs & Broomsticks *1972 Nominated Academy Award in the category of \"Best Scoring Adaptation and Original Song Score\" for Bedknobs & Broomsticks *1974 Nominated Academy Award in the category of \"Best Scoring Original Song Score And/Or Adaptation\" for Tom Sawyer *1978 Nominated Academy Award in the category of \"Best Original Song\" for \"The Slipper and the Rose Waltz\" from The Slipper and the Rose *1978 Nominated Academy Award in the category of \"Best Scoring Original Song Score And/Or Adaptation\" for The Slipper and the Rose *1979 Nominated Academy Award in the category of \"Best Original Song\" for \"When You're Loved\" from The Magic of Lassie ===Annie Awards=== *2000 Nominated Annie in the category of \"Outstanding Individual Achievement for Music in an Animated Feature Production\" for the song \"Round My Family Tree\" from The Tigger Movie *2003 \"Winsor McCay Award\" for lifetime achievement and contribution to animation ===BAFTA Awards=== *1977 Nominated \"Anthony Asquith Award for Film Music\" for The Slipper and the Rose ===BMI=== *1977 \"Pioneer Award\" awarded in Los Angeles, California. *1991 \"Lifetime Achievement Award\" awarded at the Beverly Wilshire Hotel in Los Angeles, California. ===Christopher Award=== *1964 \"Christopher Award\" for \"Best Original Song Score\" for Mary Poppins *1973 \"Christopher Award\" for \"Best Original Song Score\" for Tom Sawyer ===Disney=== *1985 \"Mousecar\" awarded at the Hollywood Bowl in Hollywood, California in front of 20 thousand people. *1990 \"Disney Legends\" awarded at the Walt Disney Studios in Burbank, California. *2010 Main Street, U.S.A. Window presented at Disneyland in Anaheim, California in honor of the Sherman Brothers' contribution to Disney theme parks. ===Golden Globes=== *1965 Nominated Golden Globe in the category of \"Best Original Score\" for Mary Poppins *1969Nominated Golden Globe in the category of \"Best Original Score\" for Chitty Chitty Bang Bang *1969 Nominated Golden Globe in the category of \"Best Original Song\" for Chitty Chitty Bang Bang *1974 Nominated Golden Globe in the category of \"Best Original Score\" for Tom Sawyer *1977 Nominated Golden Globe in the category of \"Best Original Score\" for The Slipper and the Rose ===Golden Videocassette Award=== *1984 Best Selling Video Cassette (of all time) for Mary Poppins ===Grammy Awards=== *1965 Won Grammy in the category of \"Best Original Score for a Motion Picture or Television Show\" for Mary Poppins *1965 Won Grammy in the category of \"Best Recording for Children\" for Mary Poppins *1966 Nominated Grammy in the category of \"Best Recording for Children\" for Winnie the Pooh and the Honey Tree *1968 Nominated Grammy in the category of \"Best Recording for Children\" for The Jungle Book *1970 Nominated Grammy in the category of \"Best Recording for Children\" for Chitty Chitty Bang Bang *1971 Nominated Grammy in the category of \"Best Recording for Children\" for The Aristocats *1973 Nominated Grammy in the category of \"Best Original Score for a Children's Show\" for Snoopy Come Home *1974 Nominated Grammy in the category of \"Best Original Score for a Musical Show\" for Over Here! *1975 Won Grammy in the category of \"Best Recording for Children\" for Winnie the Pooh and Tigger Too ===Laurel Awards=== *1965 Won \"Golden Laurel\" in the category of \"Best Song\" \"Chim Chim Cher-ee\" for Mary Poppins *1965 2nd Place \"Golden Laurel\" in the category of \"Music Men\" *19663rd place \"Golden Laurel\" in the category of \"Best Song\" \"That Darn Cat!\" for That Darn Cat! ===Moscow Film Festival=== *1973First Place Award in the category of \"Best Music\" for Tom Sawyer ===National Medal of Arts=== *2008National Medal of Arts awarded to Richard and Robert Sherman on November 17, 2008 at the White House by President George W. Bush. This is the highest honor the United States Government bestows on artists.Garreau, Joel.\"Stan Lee, Olivia de Havilland Win Medal of Arts Honors\",Washington Post, November 17, 2008 ===Olivier Awards=== *2002Nominated \"Best Musical\" for Chitty Chitty Bang Bang. ===Songwriters Hall of Fame=== *2005 induction at the Marriott Hotel on Times Square in New York City. ===Theatre Museum Award=== *2010 Career Achievement Award presented on May 17, 2010 at The Players Club in New York City. ===Variety Club Awards=== *2003 Won \"Best Musical\" for Chitty Chitty Bang Bang. ===Walk of Fame=== *1976 A Star on the Hollywood Walk of Fame awarded to \"Richard & Robert Sherman\" on November 17, 1976, at 6914 Hollywood Blvd. ==References== ==Other websites== * *Audio interview with Richard M. Sherman on the Sodajerker on Songwriting podcast * Robert Sherman Art * Internet Movie Database entries: ** Robert B. Sherman ** Richard M. Sherman * Internet Broadway Database entries: ** Robert B. Sherman ** Richard M. Sherman Category:American screenwriters Category:American Grammy Award winners Category:Best Original Song Academy Award-winning songwriters",
 "title": "Sherman Brothers"
}