{
 "id": "497970",
 "text": "Shane Steven Harper (born February 14, 1993) is an American actor, singer- songwriter, and dancer. He is known for playing Spencer on Good Luck Charlie as well as Josh Wheaton in the independent Christian movie God's Not Dead. His self-titled debut album was released on February 14, 2012. ==Filmography== Movies Year Movie Role Notes 2006 Re-Animated Dancer Television movie 2007 High School Musical 2 Dancer Television movie 2010 My Name Is Khan Tim Tompson Voice (US version) 2010 Flipped Matt Baker 2011 Game Time: Tackling the Past Sean Tate Television movie 2014 God's Not Dead Josh Wheaton 2014 Platinum the Dance Movie Brandon 2015 God's Not Dead 2 Josh Wheaton Pre-producing Television Year Show Role Notes 2006 Dance Revolution Himself / Supporting dancer 2007 Zoey 101 Tenth Grader \"Drippin' Episode\" (Season 3, Episode 17) 2008 Dance on Sunset Himself / Contestant 2009 So You Think You Can Dance Himself / Supporting dancer Season 6 2010–14 Good Luck Charlie Spencer Walsh Recurring role 2011 Wizards of Waverly Place Fidel \"Three Maxes and a Little Lady\" (Season 4, Episode 5) 2013–14 Awkward Austin Recurring role (Season 3–4) 2014 Happyland Ian Chandler Main role ==Discography== ===Studio albums=== List of studio albums, with selected chart positions Title Album details Peak chart Sales US Heat. Shane Harper * Released: April 12, 2011 * Formats: CD, digital download * Label: AMI, Deep Well 17 *US: 1,000 \"—\" denotes releases that did not chart or were not released in that territory. ===Extended plays=== List of studio albums, with selected chart positions Title Album details Peak chart US Heat. Dancin' in the Rain * Released: August 14, 2012 * Formats: Digital download * Label: Deep Well 49 \"—\" denotes releases that did not chart or were not released in that territory. ===Singles=== List of singles, with selected chart positions Title Year Peak chart positions Album US Christ. US Christ. Airplay US Christ. A/C \"Dance with Me\" 2010 — — — Shane Harper \"One Step Closer\" 2012 — — — Shane Harper \"Rocketship\" — — — Shane Harper \"Dancin' in the Rain\" — — — Dancin' in the Rain \"Hold You Up\" 2014 21 29 1 God's Not Dead \"—\" denotes releases that did not chart or were not released in that territory. ===Promotional singles=== Title Year Album \"We Need a Little Christmas\" 2011 ===Music videos=== Title Year Director \"Dance With Me\" 2011 Unknown \"Rocketship\" 2012 Unknown \"Dancing in the rain\" 2012 Unknown \"Flat World\" 2012 Unknown == Awards and nominations == Year Award Category Movie Result 2014 K-Love Fan Award Movie/ Television Impact Actor God's Not Dead ==Concert tours== ;Headlining *Shane Harper Tour (2012–13) ;Opening act * Dancing Crazy Tour (2011) * Summer Tour (2013) ==References== ==Other websites== * * Category:American television actors Category:Living people Category:1993 births",
 "title": "Shane Harper"
}