{
 "id": "497968",
 "text": "Sabrina Annlynn Carpenter (born May 11, 1999), nicknamed Ms. Sabrina, is an American singer, songwriter, actress, and record producer. She was born and raised in Quakertown, Pennsylvania, about an hour from Philadelphia; her parents are David and Elizabeth (a chiropractor). She has three older sisters. ==Career== After moving to Los Angeles at 13, Carpenter acted as Maya Hart, the best friend of Riley Matthews (portrayed by Rowan Blanchard) in the Disney Channel series Girl Meets World. Girl Meets World was let out on . She was signed to Hollywood Records before moving to Island Records. Sabrina Carpenter got more success in 2024 with the singles \"Espresso\" and \"Please Please Please\", from her fifth studio album, Short n' Sweet. \"Espresso\" became her first UK number-one hit and reached the top three in the US and Canada. \"Please Please Please\" became her first US and Canadian number-one song and second UK number-one. The third single from the album, \"Taste\", debuted at number two on the Hot 100 and topped the UK chart. It became both her third UK number-one and third US pop radio airplay number-one. The album entered at number one on the US Billboard 200 album chart, selling 362,000 copies there in its first week. In April 2024, Sabrina Carpenter released the single \"Espresso\". The next day, she performed at Coachella. \"Espresso\" was in the Billboard Global 200. Espresso was at number three on the Billboard Hot 100 chart. It went on to win the MTV Video Music Award for Song of the Year. Sabrina Carpenter followed with a second single, \"Please Please Please\" on June 6, 2024, which became Sabrina Carpenter's second global chart-topper and her first US Hot 100 number one single. With these songs, she became the first female artist to hold the number one and two positions on the UK singles chart for three weeks in a row. Carpenter became haircare brand Redken's first global ambassador. She also partnered with American coffee and donut chain Dunkin' for an exclusive coffee drink, the Brown Sugar Shakin' Espresso. Since 2024, she also serves as a record producer for herself and other artists under the pseudonym Rafael Goldstein. ==Discography== * Eyes Wide Open (2015) * Evolution (2016) * Singular: Act I (2018) * Singular: Act II (2019) * Emails I Can't Send (2022) * Short n' Sweet (2024) ==Tours== Headlining * Evolution Tour (2016–2017)Kuchik, Natalie (September 6, 2016). \"Sabrina Carpenter announces dates for EVOLution Tour\" . AXS. * The De-Tour (2017) * Singular Tour (2019) * Emails I Can't Send Tour (2022–2023) * Short n' Sweet Tour (2024–2025) Opening act * Ariana Grande – Dangerous Woman Tour (2017)Devoe, Noelle (June 7, 2017). \"Sabrina Carpenter on Ariana Grande's One Love Manchester Tribute: 'It Restored My Faith'\" .Seventeen. * The Vamps – Middle of the Night Tour (2017)Maldonado, Jennifer (June 29, 2017). \"The Vamps Spill All About Those Sabrina Carpenter Shipping Rumors and If She Ever Let Them Watch 'Girl Meets World'\" . J-14. * Taylor Swift – The Eras Tour (2023–2024) ==Filmography== ===Film=== Year Title Role Notes 2012 Noobz Brittney 2013 Horns Young Merrin 2018 The Hate U Give Hailey 2019 The Short History of the Long Road Nola Tall Girl Harper Kreyman 2020 Work It Quinn Ackerman Also executive producer Clouds Samantha \"Sammy\" Brown 2022 Tall Girl 2 Harper Kreyman Emergency Maddy 2024 A Nonsense Christmas with Sabrina Carpenter Herself Netflix special TBA Alice Pre-production TBA Fiona Pre-production \\--> ===Television=== Year Title Role Notes 2011 Law & Order: Special Victims Unit Paula Episode: \"Possessed\" 2012 Phineas and Ferb Girl Voice role; episode: \"What a Croc!/Ferb TV\" 2013–2018 Sofia the First Princess Vivian Recurring voice role; 16 episodes 2013 The Goodwin Games Young Chloe Goodwin Recurring role; 5 episodes Orange Is the New Black Jessica Wedge Episode: \"Fucksgiving\" Austin & Ally Lucy Gluckman Episode: \"Moon Week & Mentors\" 2014–2017 Girl Meets World Maya Hart Main role; 72 episodes 2016 Wander Over Yonder Melodie Voice role; episode: \"The Legend\" Walk the Prank Herself Episode: \"Adventures in Babysitting\" Adventures in Babysitting Jenny Parker Disney Channel Original Movie 2016–2019 Milo Murphy's Law Melissa Chase Main voice role; 40 episodes 2017 Soy Luna Herself 2 episodes 2018 Mickey and the Roadster Racers Nina Glitter Voice role; episode: \"Super-Charged: Pop Star Helpers\" 2020 Punk'd Herself Episode: \"Rat Trap with Sabrina Carpenter\" Royalties Bailey Rouge 3 episodes 2024 Saturday Night Live Herself (musical guest) Episode: \"Jake Gyllenhaal/Sabrina Carpenter\" 2025 Saturday Night Live 50th Anniversary Special Herself (musical guest), Sophie Television special, NBC ===Stage=== Year Production Role Location Category 2015 Peter Pan and Tinker Bell: A Pirate's Christmas Wendy Darling Pasadena Playhouse Regional 2020 Mean Girls Cady Heron August Wilson Theatre Broadway ===Video games=== Year Title Role Notes 2011 Just Dance Kids 2 Coach Video game 2025 Fortnite Skin Exclusive skins; Theme of Fortnite Festival Season 8; various music and emotes == Awards and nominations == Award Year Nominee(s) / Work(s) Category Result APRA Awards (Australia) 2025 \"Espresso\" Most Performed International Work Billboard Music Awards 2024 Herself Top Artist Top Female Artist Top Hot 100 Artist Top Streaming Songs Artist Top Radio Songs Artist Top Billboard Global 200 Artist Top Billboard Global (Excl. U.S.) Artist \"Espresso\" Top Billboard Global 200 Song Top Billboard Global (Excl. U.S.) Song BMI Pop Awards 2024 \"Cupid\" (Twin version) Most Performed Song of the Year \"Nonsense\" BreakTudo Awards 2018 Herself Artist on the Rise 2019 \"Pocket Show Universal\" International Performance 2020 \"Let Me Move You\" Best Soundtrack Brit Awards 2025 Herself International Artist of the Year \"Espresso\" International Song of the Year Herself Global Success Award Danish Music Awards 2024 \"Espresso\" International Hit of the Year Fragrance Foundation Awards 2024 \"Sweet Tooth\" Fragrance of the Year – Popular Grammy Awards 2025 Herself Best New Artist Short n' Sweet Album of the Year Best Pop Vocal Album \"Please Please Please\" Song of the Year \"Espresso\" Record of the Year Best Pop Solo Performance iHeartRadio Music Awards 2019 Goodwin Cutest Musician's Pet 2024 Herself Favorite Tour Style \"Nonsense\" Best Lyrics 2025 Herself Artist of the Year Pop Artist of the Year Favorite Tour Style \"Espresso\" Song of the Year Pop Song of the Year Best Lyrics Best Music Video \"Please Please Please\" “Juno” position Favorite Tour Tradition Los 40 Music Awards 2024 Herself Best International Artist \"Espresso\" Best International Song MTV Europe Music Awards 2023 Herself Biggest Fans 2024 Best Artist Best Pop Best US Act \"Espresso\" Best Song MTV Video Music Awards 2024 Song of the Year Best Editing \"Please Please Please\" Best Direction Best Art Direction Song of Summer Herself Artist of the Year Best Pop Myx Music Awards 2024 \"Espresso\" Global Video of the Year Nickelodeon Kids' Choice Awards 2024 Emails I Can't Send Tour Favorite Ticket of the Year \"Espresso\" Favorite Viral Song NRJ Music Award 2024 International Hit of the Year Radio Disney Music Awards 2015 \"Can't Blame a Girl for Trying\" Best Crush Song 2016 \"Eyes Wide Open\" Best Anthem 2017 \"On Purpose\" Best Crush Song 2018 \"Why\" SCAD Savannah Film Festival 2019 Herself Best Performance Variety Hitmakers 2023 Rising Star Award Webby Awards 2025 \"What a Girl Wants\" (with Christina Aguilera) Best Individual Performance – Performance & Craft ==Notes== ==References== ==Other websites== * * Category:1999 births Category:Living people Category:Actors from Pennsylvania Category:American YouTubers Category:American child actors Category:American child singers Category:American movie actors Category:Models from Pennsylvania Category:American pop singers Category:American television actors Category:American voice actors Category:Disney people Category:Musical theater actors Category:Musicians from Pennsylvania Category:Singers from Pennsylvania Category:21st-century American actors Category:21st-century American singer- songwriters Category:American electropop singers Category:American contemporary R&B; singers",
 "title": "Sabrina Carpenter"
}