{
 "id": "498365",
 "text": "SriLankan Airlines (marketed as SriLankan) is the flag carrier of Sri Lanka. It is a member of the Oneworld airline alliance. It is currently the largest airline in Sri Lanka by number of aircraft and destinations. It was launched in 1979 as Air Lanka. The launch was after the end of operations of the original Sri Lankan flag carrier Air Ceylon. Following its partial acquisition in 1998 by Emirates, it was re-branded. In 2008 the government of Sri Lanka acquired all the shares of the airline from Emirates. After ending the Emirates partnership, it retained its re-branded name and logo. Sri Lankan Airlines operates over 560 flights per week. The Airline operates to 113 destinations in 51 countries (including codeshare operations) from its main hub located at Bandaranaike International Airport near Colombo. SriLankan Airlines joined the oneworld airline alliance on 1 May 2014. == History == === Air Lanka === Air Lanka was established as the flag carrier of Sri Lanka once the Sri Lankan government shut down the bankrupt Air Ceylon. Air Lanka's first fleet had two Boeing 707. They were leased from Singapore Airlines. One Boeing 737 was leased from Maersk Air and maintained by Air Tara. On 24 April 1980, the lease ended; Air Lanka received a replacement Boeing 737 leased from Royal Brunei. On 1 November 1980, Air Lanka commenced wide-body operations with a leased Lockheed L1011-1 Tristar from Air Canada. === Rebranding === Air Lanka, which was state-owned, was partially privatized in 1998, with investment by Dubai-based Emirates Group, when Emirates and the Sri Lankan government signed an agreement for a ten-year strategic partnership. This agreement included exclusive rights for all aircraft ground handling and airline catering at Colombo-Bandaranaike airport for ten years. Emirates bought a 40% stake worth US$70 million (which it later increased to 43.6%) in Air Lanka and sought to refurbish the airline's image and fleet. The government retained a majority stake in the airline. Though they gave full control to Emirates for investment and management decisions. In 1998, the Air Lanka re-branded to SriLankan Airlines.\"World Airline Directory.\" Flight International. 14–20 March 1990 \"Airlift International\" 57. === 2000s === In 2008, Emirates notified the Sri Lankan Government that it would not renew its management contract, which then expired on 31 March 2008. It claimed that the Sri Lankan Government was seeking greater control over the day-to-day management of the airline.Management contract terminated January 2008, OAG, News briefing Emirates sold its 43.63% stake in the airline to the Government of Sri Lanka in a deal that was finalized in 2010, thus ending any affiliations the two airlines had with each other.Sri Lanka Buys Emirates’ Stake in SriLankan Airlines Anusha Ondaatjie and Asantha Sirimanne, BusinessWeek, 7 July 2010. In 2008 when Emirates pulled out, the profit of SriLankan was Rs. 9.288 billion in that financial year. From 2008 to 2015, when the government administration ran it, the loss for the seven years was Rs. 128.238 billion (US$875 million). === 2010s === Following the ownership transfer, SriLankan took the decision to promote Colombo as a hub for flights to Asia. The first destination of the expansion plan was Shanghai; the route started on 1 July 2010.Sri Lankan Airlines to fly to Shanghai , LBO, 10 May 2010 The airline started flights to Guangzhou on 28 January 2011.SriLankan Airlines expands fleet, plans new destinations LBO, 20 July 2010 SriLankan joined the Oneworld alliance on 1 May 2014. During 2014 it started to renew and increase its fleet, with purchases of Airbus A330 & A350 models. Currently, SriLankan operates an all-Airbus fleet except for its discontinued Air-Taxi services. SriLankan phased out their last Airbus A340-300 on 7 January 2016 with its last scheduled flight from Chennai to Colombo. The airline closed three European routes – Frankfurt, Paris and Rome – by end of 2016. In October 2017, SriLankan launched direct daily non-stop flights to Melbourne, Australia. Its their first new long haul route in over five years. The flights restore a regular direct air link between Australia and Sri Lanka after a hiatus of 16 years. == References == Category:Airlines of Asia Category:1979 establishments in Asia Category:1970s establishments in Sri Lanka Category:Companies of Sri Lanka",
 "title": "SriLankan Airlines"
}