{
 "id": "498436",
 "text": "Kimmo Samuel Timonen (born March 18, 1975) is a Finnish former professional ice hockey defenceman. He played a total of sixteen seasons in the National Hockey League (NHL). He played for the Nashville Predators, Philadelphia Flyers, and Chicago Blackhawks. He also played for KalPa, TPS, and HIFK of SM- liiga (SM-l), HC Lugano of National League A (NLA), and Brynäs IF of the Elitserien (SEL). ==Career== Before playing in the NHL, Timonen played parts of 7 years in the SM-liiga with KalPa, TPS, and HIFK. He was drafted 250th overall by the Los Angeles Kings in the 1993 NHL Entry Draft. He continued to play in the SM-liiga after the draft. He helped Finland win the bronze medal at the 1998 Winter Olympics in Nagano. A little while after the Olympics, the Kings traded Timonen along with Jan Vopat to the Nashville Predators (who did not begin playing yet) in agreement that the Predators would not draft Garry Galley in the 1998 NHL Expansion Draft. Timonen would spend time between the Predators and their IHL affiliate, the Milwaukee Admirals. He was called up to the Predators during 1999-2000 season. He played the next four seasons with the Predators before the 2004–05 NHL lockout. He decided to travel back to Finland and play for KalPa during the lockout. On October 3, 2006, the Predators named Timonen the captain for the 2006–07 season. On June 18, 2007, the Predators traded Timonen along with Scott Hartnell to the Philadelphia Flyers in exchange for Philadelphia's first round pick (Jonathon Blum) in the 2007 NHL Entry Draft. After he signed, he became the highest paid Finn in the NHL after he signed a six-year, $37.8 million contract extension. Timonen and the Flyers faced the Washington Capitals in the first round of the playoffs. Philadelphia was able to win the series 4–3. In the second round of the playoffs, the Flyers played against the Montreal Canadiens and won the series 4–1. On April 30, 2008, Timonen was hit by a wrist shot at his foot by Canadiens defenseman Andrei Markov. He said that he had felt numbness in his foot but he didn't think it was anything but a twisted nerve. On May 8, 2008, a doctor at the Hospital of the University of Pennsylvania who looked at Timonen's foot said that he had found a small blood clot. This stopped Timonen from playing indefinitely and he missed the first four games of the Eastern Conference Finals against the rival Pittsburgh Penguins. He returned in game 5 but the Flyers lost and they were eliminated from the playoffs. On March 5, 2011, Timonen scored his 100th career goal against Ryan Miller of the Buffalo Sabres in a 5–3 loss. On August 5, 2014, Timonen was diagnosed with blood clots in his right leg and both of his lungs. He was ruled out from playing indefinitely and missed the first 62 games of the season. On February 27, 2015, the Flyers traded Timonen to the Chicago Blackhawks in exchange for a 2015 second-round pick and 2016 fourth-round pick. On 5 March, Timonen announced that he was going to retire from professional ice hockey at the end of the season. On 15 June, Timonen played his final game in the NHL. In his final game, he was able to help the Blackhawks defeat the Tampa Bay Lightning and win his first Stanley Cup. Captain Jonathan Toews celebrated with the cup and choose Timonen as the first player to hand it off to. During their visit to the White House, President Barack Obama congratulated Timonen and applauded him for his career and ability to play through his blood clots. Timonen would be inducted into the IIHF Hall of Fame in 2020. ==References== == Other websites == * Category:1975 births Category:Living people Category:Chicago Blackhawks players Category:Finnish ice hockey defencemen Category:Nashville Predators players Category:Olympic bronze medalists for Finland Category:Olympic silver medalists for Finland Category:Philadelphia Flyers players Category:Stanley Cup champions Category:International Hockey League (1945–2001) players Category:Swedish Hockey League players",
 "title": "Kimmo Timonen"
}