{
 "id": "498498",
 "text": "Andreas Günter Lubitz (18 December 1987Fatal Descent of Germanwings Plane Was ‘Deliberate,’ French Authorities Say The New York Times, Retrieved 26 March 2015. – 24 March 2015) There is some disagreement in the sources as to the age of Lubitz. Some sources state that Lubitz was 28 years old, but the date of birth cited by The New York Times would indicate that he was 27 years old when he died. was a German pilot for the international airline Lufthansa. Marseille prosecutor Brice Robin, French and German authorities, as well as executives of Lufthansa, have issued statements that they believe that Lubitz intentionally crashed the Airbus A320 of Germanwings Flight 9525 (GWI18G & D-AIPX) into the French Alps, killing himself along with 149 others in a murder-suicide on 24 March 2015. == Early life == Lubitz grew up in Neuburg an der Donau until the age of six, where he lived with his parents at his maternal grandfather's house. The family then moved to Montabaur, where he attended the Mons-Tabor-Gymnasium, from which he graduated in 2007. At the age of 14, he became a member of the local gliding club LSC Westerwald e. V., where he obtained his gliding licence about two years later. In 2008, Lubitz began his pilot training at the Lufthansa Commercial Flight School in Bremen, which he interrupted for several months in 2009. Before continuing his training as a commercial pilot, he was \"in psychotherapeutic treatment for an extended period of time with noted suicidal tendencies.\" From 2011 to 2013, he ran the Lufthansa Frankfurt Half Marathon. After completing his training, Lubitz worked as a flight attendant for eleven months, then as a first officer (co-pilot) for Lufthansa subsidiary Germanwings from September 2013, completing around 630 flight hours on the Airbus A320. ==Notes== ==References== Category:1987 births Category:2015 deaths Category:Aviation deaths Category:German murderers Category:People from Bavaria",
 "title": "Andreas Lubitz"
}