{
 "id": "498440",
 "text": "Tomas Gösta Tranströmer (15 April 1931 - 26 March 2015) was a Swedish poet, psychologist and translator. He was awarded the 1990 Neustadt International Prize for Literature and the 2011 Nobel Prize in Literature.Tranströmer was born in Stockholm. He was married to Monica Bladh and had two daughters, Emma and Paula. In November 1990 he lost his speech and the use of his right hand as a result of a stroke. As if anticipating his own fate, in his longest poem Baltics (1974), he had referred to the story of a composer who became speechless and hemiplegic after a brain bleed: Then, cerebral hemorrhage: paralysis on the right side with aphasia,/ can grasp only short phrases, says the wrong words/ Beyond the reach of eulogy or execration./ But the music’s left, he goes on composing in his own style,/ for the rest of his days he becomes a medical sensation./ He wrote music to texts he no longer understood/ in the same way/ we express something through our lives/ in the humming chorus full of mistaken words. Himself a lifelong amateur pianist and a psychologist by trade, Tranströmer carried on playing the piano with his left hand after the stroke. What makes Tranströmer a medical sensation — as prophetically announced in Baltics, the poem he regarded as his ‘most consistent attempt to write music' Tranströmer’s career as prison psychologist also became a source of his poetry. He was nevertheless surprised not to have been asked more often about how his poetry may have affected his work. His first book after the stroke was inspired by Liszt’s utterly depressing La lugubre gondola, which the Hungarian composer had written while visiting his daughter and son-in-law Richard Wagner. Transtromër’s first lines after the stroke were those of the poem, April in silence: I am carried in my shadow/ like a violin/ in its black case.’ Before the stroke a non-prolific writer, after it Tranströmer became even more abbreviated in his writing. Nobel Prize in literature in 2011, was able to transform suffering into art and through music and poetry overcome the great communication barriers imposed by aphasia. A rare living prophet in his own homeland, in Memories look at me, Tranströmer produced some of the most illuminating autobiographical accounts ever written as well as poetry of the highest calibre. What makes Tranströmer a medical sensation—prophetically announced in Baltics— is the fact that he managed to continue translating his ideas and images into words, creating language in the absence of speech, in poetry written in accordance with his own prophetic (prestroke) and last verse of From March 1979 of his 1983 collection The Wild Market Square: Weary of all who come with words, words but no language/ I make my way to the snow-covered island./ The untamed has no words./ The unwritten pages spread out on every side!/ I come upon the tracks of deer in the snow./ Language but no words. Deprived from his speech, Transtro¨mer hardly had any correspondence or narrative poetry left after the stroke. A poet of concentration prior to the stroke, his poetry had become increasingly compressed since the 1980s, as Robert Bly has often pointed out, but only after the stroke did it become disproportionately brief compared to his prestroke production, confining most of his poetry to haikus: a Japanese poetic form referring to nature that is compressed into three lines and a total of 17 syllables (5-7-5) and often with cutting words. Like his last poem, written in spite of the loss of his speech, The great enimga: Birds in human shape./ The apple trees in blossom./ The great enigma..https://www.eanpages.org/2012/09/01/forum-tomas-transtromers- stroke-of-genius/ Tranströmer died after a short illness on 26 March 2015 at his home in Stockholm, aged 83. ==Related pages== *List of Swedish-language writers ==References== ==Other websites== * Category:1931 births Category:2015 deaths Category:Atheists Category:Disease-related deaths in Sweden Category:Humanists Category:Nobel Prize in Literature winners Category:Scientists from Stockholm Category:Swedish poets Category:Swedish psychologists Category:Socialists Category:Writers from Stockholm Category:European translators Category:Swedish Nobel Prize winners",
 "title": "Tomas Tranströmer"
}