{
 "id": "49887",
 "text": "is one of Japan's four main islands.Nussbaum, Louis-Frédéric. (2005). \"Kyūshū\" in It is the most southern of the main islands and the third largest.Nussbaum, Louis-Frédéric. (2002). \"Kyushu\" in Japan Encyclopedia, pp. 588-589. ==Regions== Kyūshū region is made up of the entire island.LOC, \"Kyushu\"; retrieved 2012-2-13. The name Kyūshū literally means \"nine countries\" in Japanese. Kyūshū was made of nine old \"countries\" or provinces that are now prefectures. Each prefecture has a modern name and sometimes more than one old provincial name. The old names are still used sometimes, especially for foods, music, or art. The original nine provinces in Kyushu were Chikuzen, Chikugo, Hizen, Higo, Buzen, Bungo, Hyūga, Ōsumi, and Satsuma. Today, Kyushu is made up of seven of the prefectures of Japan. * Fukuoka PrefectureNussbaum, \"Fukuoka-ken\" at p. 218; Japan External Trade Organization (JETRO), Fukuoka Prefecture, Regional Information ; retrieved 2012-4-6. * Kagoshima PrefectureNussbaum, \"Kagoshima prefecture\" at p. 447; JETRO, Kagoshima Prefecture, Regional Information; retrieved 2012-4-6. * Kumamoto PrefectureNussbaum, \"Kumamoto prefecture\" at p. 572; JETRO, Kumamoto Prefecture, Regional Information; retrieved 2012-4-6. * Miyazaki PrefectureNussbaum, \"Miyazaki prefecture\" at p. 651; JETRO, Miyaszaki Prefecture, Regional Information; retrieved 2012-4-6. * Nagasaki PrefectureNussbaum, \"Nagasaki prefecture\" at p. 683; JETRO, Nagasaki Prefecture, Regional Information; retrieved 2012-4-6. * Oita PrefectureNussbaum, \"Ōita-ken\" in Japan Encyclopedia, p. 742; JETRO, Oita Prefecture, Regional Information; retrieved 2012-4-6. * Saga PrefectureNussbaum, \"Saga prefecture\" at p. 804; JETRO, Saga Prefecture, Regional Information; retrieved 2012-4-6. Parts of Kyūshū have a warm climate, like the Miyazaki and Kagoshima regions. Major crops grown there are rice, tea, tobacco, sweet potatoes, and soy; silk is also made. The island is known for many types of porcelain like Arita, Imari, Satsuma and Karatsu. Under the Gokishichidō system, the island of Kyūshū was a part of the region known as Saikaidō. It was a part of this region from the 7th century until the middle of the 1800s. Around 1905, it was made into its own region. In the modern system, Kyūshū and the small islands around it are a part of the Kyūshū region. ==Related pages== * Provinces of Japan * Prefectures of Japan * List of regions of Japan * List of islands of Japan ==References== ==Other websites== * Murdoch's map of provinces, 1903 * Kyushu -Citizendium Category:Islands of Japan Category:Kyushu region",
 "title": "Kyūshū"
}