{
 "id": "499074",
 "text": "The Ashmolean Museum (in full the Ashmolean Museum of Art and Archaeology) on Beaumont Street, Oxford, is the world's first university museum. Its first building was built in 1678–1683 to house the cabinet of curiosities that Elias Ashmole gave to the University of Oxford in 1677. The museum reopened in 2009 after a major redevelopment. In November 2011 new galleries focusing on Egypt and Nubia were also unveiled. Ashmole's collection was based on the objects he got from the travellers and collectors John Tradescant the elder and his son of the same name. The museum opened on 24 May 1683, with naturalist Robert Plot as the first keeper. The present building dates from the 1840s, and the original building in Broad Street is now the Oxford Museum of the History of Science. That building is the world's first purpose-built museum. The interior of the Ashmolean has been extensively modernised in recent years. Between 2006 and 2009, the museum was expanded. The $98.2 millionCarol Vogel (20 June 2013), Director of Ashmolean Museum at Oxford to Step Down New York Times. rebuilding resulted in five floors instead of three, with a doubling of the display space. It has new conservation studios and an education centre. == Museum gallery == File:BrightonPierrotsWalterSickert.jpg|'The Brighton Pierrots', painted 1915 by Walter Sickert File:Alfred Jewel Ashmolean 2014.JPG|The Alfred Jewel File:Edward Burne-Jones, ‘Music’, 1877. Oil on canvas.jpg|'Music' by Edward Burne-Jones File:Ceremonial_Palette_from_Hierakonpolis-2.jpg|The \"Two Dog Palette\" from Hierakonpolis File:Van Gogh - Das Restaurant de la Sirène in Asnières.jpeg|'Restaurant de la Sirène, Asnières', by Vincent van Gogh File:Messiah Stradivarius.jpg|The Messiah Stradivarius violin File:Edouard Manet - Portrait of Mademoiselle Claus.jpg|'Portrait of Mademoiselle Claus', by Edouard Manet File:Narmer_Macehead.png|The Narmer Macehead File:Paolo Uccello - The Hunt in the Forest - WGA23239.jpg|'The Hunt in the Forest' by Paolo Uccello File:Sobek Oxford.jpg|Statue of Sobek, the crocodile god, from the pyramid temple of Amenemhat III File:Leighton, Frederic - Acme and Septimius - c. 1868.jpg|'Acme and Septimius', by Frederic Leighton, 1st Baron Leighton File:0 Gemma Tiberiana - Rubens - Ashmolean Museum - WA1989.74.JPG|The 'Apotheosis of Germanicus', a copy after an antique Cameo painted in 1626 by Peter Paul Rubens File:Millais - Die Rückkehr der Taube zur Arche Noah.jpg|The Return of the Dove to the Ark, by Sir John Everett Millais File:Tragic mask dating to the 1st century BC or 1st century AD, Ashmolean Museum (8400677139).jpg|A Greek tragic mask dating to the 1st century BC or 1st century AD. See Theatre of ancient Greece. File:3 A lady singing 1740-45 Ashmolean Museum, Oxford - копия.jpg|'A lady singing', gouache painting with gold on paper 1740-45, Rajasthan, artist unknown File:Jeanne Holding a Fan, c.1874, by Camille Pissarro. Oil on canvas, The Ashmolean Museum,.jpg|'Jeanne Holding a Fan', an oil on canvas painting by Camille Pissarro, c.1874 File:Heilige Familie mit dem Johannesknaben (Ashmolean Museum).jpg|'The Holy Family with St John the Baptist', brush and brown wash on panel by Michelangelo File:Tombstone, the doctor Claudius Agathemerus and his wife Myrtale, from Rome, about AD 100, Ashmolean Museum (8401778336).jpg|Tombstone, the doctor Claudius Agathemerus and his wife Myrtale, from Rome, about AD 100 File:Raffaello, studio per la trasfigurazione 02.jpg|'Studies of the Heads of two Apostles and of their Hands', by Raphael File:Oliver Cromwell death mask- Ashmolean Museum.jpg|A death mask of Oliver Cromwell File:Millais Ruskin.jpg|Portrait of John Ruskin by John Everett Millais File:Powhatan's mantle, lithography 1888.jpg|The ceremonial cloak of Chief Powhatan File:Abingdon_Sword_2014.JPG|The Abingdon Sword File:Paolo uccello, annunciazione, ashmolean.jpg|'The Annunciation', attributed to Paolo Uccello File:The_oldest_writing_in_the_world_-_The_Sumerian_Stone_Tablet.jpg|The Kish tablet: plaster caste File:Young Englishwoman, costume study by Hans Holbein the Younger.jpg|'Young Englishwoman', a costume study by Hans Holbein the Younger File:Samuel Palmer - Self-Portrait - WGA16951.jpg|A self-portrait by Samuel Palmer File:P._Oxy._LXVI_4499.jpg|Papyrus 115 (\\mathfrak{P}115): a fragmented manuscript of the New Testament == References == Category:Museums in England Category:University of Oxford Category:Art museums in the United Kingdom Category:Buildings and structures in Oxford",
 "title": "Ashmolean Museum"
}