{
 "id": "499079",
 "text": "Cementum is the hard outside layer of a tooth root.Nanci, Antonio. Ten Cate's Oral Histology: Development, Structure, and Function. 8th ed. St. Louis, MO: Mosby Elsevier,: Elsevier, 2013. 205-18. Print. It is not present in the crown (part above the gums) portion of a tooth. Cementum allows periodontal ligaments to attach onto it, allowing tooth to be connected to the maxilla or mandible. == Composition == Cementum is made up of * 45% to 50% hydroxyapatite (mineral found in teeth and bones) * 50% to 55% collagen (mostly Type I collagen) and non-collagen organic matter == Development == The process of creating cementum is called cementogenesis.Ireland, Robert. A Dictionary of Dentistry. Oxford: Oxford University Press, 2010. 69. Internet resource. It is made by special type of cells known as cementoblasts. Cementoblasts are found on the surface of the cementum. When a cementoblast is no longer on the surface, or when it is found surrounded by cementum, it is then known as a cementocyte. In contrast, cementoclasts are special cells that remove cementum instead of making cementum. == Cementoenamel junction == The cementoenamel junction, or the cervical line, is the where enamel and cementum meet. The cementum and enamel may meet in different ways. * As a butt joint: This is when the enamel meets and touches the cementum. * With a gap: The enamel and cementum do not meet and touch. The gap they leave exposes dentin underneath. * Overlapping: Cementum overlaps over the enamel. == Types == Cementum can be divided into two main types based on its location and whether it has cells or not. *Acellular cementum.Chandra, Satish, Shaleen Chandra, and Girish Chandra. Textbook of Operative Dentistry (with Mcqs). New Delhi: Jaypee Brothers Medical Publishers Ltd, 2007. 15. Print. The term acellular means that it does not have any cells in it. It can be found on the surface of the entire tooth root. It allows the tooth to anchor to the maxilla or mandible. Since acellular cementum does not have any cells, it cannot make any new cementum. *Cellular cementum. Unlike acellular cementum, cellular cementum contains cells. It can be found on the lower third of a tooth root. Since cellular cementum contains cells in it, it is able to make more cementum and repair damages. Cellular cementum is less hard than acellular cementum. == References == category:Teeth",
 "title": "Cementum"
}