{
 "id": "499333",
 "text": "The Division of Wakefield was an Australian electoral division in the state of South Australia. It covered an area from the northern suburbs of Adelaide to the Clare Valley, 135 km north of Adelaide. It includes the suburbs of Elizabeth, Craigmore, Munno Para, Virginia, and part of Salisbury, and the towns of Gawler, Balaklava, Clare, Kapunda, Riverton, Mallala, Freeling, Tarlee, Williamstown, and parts of Port Wakefield. The Division was named after Edward Gibbon Wakefield, who planned settlements in South Australia, Western Australia, New Zealand and Canada. It was set up in 1903. It was abolished in 2019 when a redistribution cut the number of divisions in South Australia to ten. ==Members== Image Member Party Term Notes Sir Frederick Holder Independent 1903–1909 Previously held the Division of South Australia. Served as Speaker during the Barton, Deakin, Watson, Reid and Fisher Governments. Died in office Richard Foster Commonwealth Liberal 1909–1917 Previously held the South Australian House of Assembly seat of Flinders. Served as minister under Hughes. Lost seat Richard Foster Nationalist 1917–1922 Previously held the South Australian House of Assembly seat of Flinders. Served as minister under Hughes. Lost seat Richard Foster Liberal Union 1922–1925 Previously held the South Australian House of Assembly seat of Flinders. Served as minister under Hughes. Lost seat Richard Foster Nationalist 1925–1928 Previously held the South Australian House of Assembly seat of Flinders. Served as minister under Hughes. Lost seat Maurice Collins Country 1928–1929 Lost seat Charles Hawker Nationalist 1929–1931 Served as minister under Lyons. Charles Hawker United Australia 1931–1938 Served as minister under Lyons. Died in office Sydney McHugh Labor 1938–1940 Previously held the South Australian House of Assembly seat of Burra Burra. Lost seat. Later elected to the South Australian House of Assembly seat of Light in 1941. Jack Duncan-Hughes United Australia 1940–1943 Previously a member of the Senate. Lost seat Albert Smith Labor 1943–1946 Previously a member of the Senate. Lost seat (Sir) Philip McBride Liberal 1946–1958 Previously a member of the Senate. Served as minister under Robert Menzies. Retired Bert Kelly Liberal 1958–1977 Previously a member of the Senate. Served as minister under Harold Holt, John McEwen and John Gorton. Lost preselection and retired Geoffrey Giles Liberal 1977–1983 Previously held the Division of Angas. Retired Neil Andrew Liberal 1983–2004 Served as Chief Government Whip under John Howard. Served as Speaker during the Howard Government. Retired David Fawcett Liberal 2004–2007 Lost seat. Later elected to the Senate in 2010. Nick Champion Labor 2007–2019 Sir Frederick Holder and Neil Andrew (1998-2004) were Speaker of the House. Holder was also Premier of South Australia on two occasions. Holder's death in 1909 caused a by- election. In 1938 the death of Charles Hawker also caused another by-election. ==Election results== * 2004 election results * 2007 election results * 2010 election results * 2013 election results * 2016 2016 election results ==References== * ABC profile for Wakefield: 2013 * AEC profile for Wakefield: 2013 * Poll Bludger profile for Wakefield: 2013 ==Other websites== * Wakefield boundary map, 2001: AEC * SA boundary map, 2001: AEC Category:Former electoral divisions of Australia Category:Electoral divisions of South Australia Category:1903 establishments in Australia",
 "title": "Division of Wakefield"
}