{
 "id": "499406",
 "text": "Scarecrow is the eighth studio album by American country music artist Garth Brooks. It was released on November 13, 2001, and debuted at #1 on the Billboard 200 chart, and the Top Country Albums chart. It has been certified 5× platinum RIAA and was named Best Selling Album at the 2002 Canadian Country Music Association Awards. It was the last album by Brooks before his thirteen- year hiatus. ==Background== Brooks commented on the album saying: \"At the end of last year I made a commitment to Capitol (Records) that I would try to bring them one more album. This is the result of that effort, a real labor of love, that I'm proud to hold up next to all of our previous releases. For the first time in my life I think I made a happy album. It's heavy on steel guitars, but you're not aware of it in some places because the musicians are so good at what they do.\" ==Content== Singles released from this album include \"Beer Run (B Double E Double Are You In?)\" (a duet with George Jones, also found on Jones's 2001 album The Rock: Stone Cold Country 2001), \"Wrapped Up in You\", \"Squeeze Me In\" (a duet with Trisha Yearwood), \"Thicker Than Blood\", and \"Why Ain't I Running\". Of these, \"Wrapped Up in You\" was the highest peaking, reaching #5 on the Hot Country Songs charts. Prior to the album's release, \"When You Come Back to Me Again\" had charted on the country charts as a selection from the soundtrack to the film Frequency. Several of the tracks on this album were originally recorded by other artists. \"Pushing Up Daisies\" was originally recorded by Kevin Welch on his 1995 album Life Down Here on Earth, while \"Big Money\" was originally recorded under the title \"It Pays Big Money\" by Mark Chesnutt on his 2000 album Lost in the Feeling. Additionally, \"Don't Cross the River\" was previously recorded by America on their 1972 album Homecoming. \"Squeeze Me In\" was previously recorded by Lee Roy Parnell on his 1995 album We All Get Lucky Sometimes. ==Track listing== # \"Why Ain't I Running\" (Kent Blazy, Tony Arata, Garth Brooks) – 4:32 # \"Beer Run (B Double E Double Are You In?)\" (Kim Williams, Amanda Williams, Keith Anderson, George Ducas, Blazy) – 2:28 #* duet with George Jones # \"Wrapped Up in You\" (Wayne Kirkpatrick) – 4:42 # \"The Storm\" (Blazy, K. Williams, Brooks) – 4:37 # \"Thicker Than Blood\" (Jenny Yates, Brooks) – 2:53 # \"Big Money\" (Shawn Camp, Randy Hardison, Wynn Varble) – 3:59 # \"Squeeze Me In\" (Delbert McClinton, Gary Nicholson) – 3:30 #* duet with Trisha Yearwood # \"Mr. Midnight\" (J.R. Cobb, Buddy Buie, Tom Douglas) – 4:03 # \"Pushing Up Daisies\" (John Hadley, Kevin Welch, Gary Scruggs) – 4:18 # \"Rodeo or Mexico\" (Bryan Kennedy, Paul Kennerley, Brooks) – 4:22 # \"Don't Cross the River\" (Dan Peek) – 4:05 # \"When You Come Back to Me Again\" (theme from the movie Frequency) (Yates, Brooks) – 4:44 ==Alternate track listing from 2014 re-release== # \"Why Ain't I Running\" (Kent Blazy, Tony Arata, Garth Brooks) – 4:32 # \"Beer Run (B Double E Double Are You In?)\" (Kim Williams, Amanda Williams, Keith Anderson, George Ducas, Blazy) – 2:28 #* duet with George Jones # \"More Than a Memory\" (Lee Brice, Billy Montana, Kyle Jacobs) – 3:25 # \"Thicker Than Blood\" (Jenny Yates, Brooks) – 2:53 # \"Wrapped Up in You\" (Wayne Kirkpatrick) – 4:42 # \"The Storm\" (Blazy, K. Williams, Brooks) – 4:37 # \"Big Money\" (Shawn Camp, Randy Hardison, Wynn Varble) – 3:59 # \"Squeeze Me In\" (Delbert McClinton, Gary Nicholson) – 3:30 #* duet with Trisha Yearwood # \"Mr. Midnight\" (J.R. Cobb, Buddy Buie, Tom Douglas) – 4:03 # \"Good Ride Cowboy\" (Jerrod Niemann, Bryan Kennedy, Richie Brown, Bob Doyle) – 3:26 # \"Pushing Up Daisies\" (John Hadley, Kevin Welch, Gary Scruggs) – 4:18 # \"Rodeo or Mexico\" (Bryan Kennedy, Paul Kennerley, Brooks) – 4:22 # \"Don't Cross the River\" (Dan Peek) – 4:05 # \"When You Come Back to Me Again\" (theme from the movie Frequency) (Yates, Brooks) – 4:44 ==Charts and sales performance== In the United States, Scarecrow debuted at No. 1 on the Billboard 200, becoming his eighth No. 1 album on the chart, and No. 1 on the Top Country Albums, becoming his eleventh No. 1 Country album. In January 2006, Scarecrow was certified 5× Platinum by the RIAA. ===Charts=== Charts (2001) Peak position Australian Albums Chart 71 Canadian Albums Chart 4 German Albums Chart 58 Irish Albums Chart 6 Norwegian Albums Chart 32 Swiss Albums Chart 77 U.S. Billboard 200 1 U.S. Billboard Top Country Albums 1 ===Sales and certifications=== Region Provider Certification Sales/Shipments Canada CRIA Platinum 100,000 United States RIAA 5× Platinum 5,000,000 Worldwide 11,000,000 ==Credits== Compiled from liner notes. ===Technical=== * Recorded and mixed by Mark Miller at Jack's Tracks Recording Studio * Additional recording by Keith Stegall at The Sound Station * Engineered by John Kelton * Mastered by Denny Purcell at Georgetown Masters * Digital editing by Eric Conn and Carlos Grier ===Musicians=== * Drums and percussion: Milton Sledge (\"Wrapped Up in You\": Sam Bacco; \"Thicker Than Blood\", \"Squeeze Me In\" and \"Don't Cross the River\" percussion: Sam Bacco; \"Rodeo or Mexico\" additional percussion: Sam Bacco) * Bass: Mike Chapman (\"Wrapped Up in You\": Jimmie Lee Sloas) * Acoustic guitar: Mark Casstevens (\"Wrapped Up In You\": Wayne Kirkpatrick, \"Don't Cross the River\": Pat Flynn) * Electric guitar: Chris Leuzinger * Keyboards: Bobby Wood * Steel and slide guitars: Bruce Bouton * Fiddle: Rob Hajacos (\"Wrapped Up in You\" and \"Don't Cross the River\": Jimmy Mattingly) * Accordion: Joey Miskulin * Harmonica: Terry McMillan * Banjo: Béla Fleck * Mandolin: Sam Bush * Dobro: Jerry Douglas * String arrangements: Dennis Burnside ===Art=== * Production: Carlton Davis * Production assistant: Denise Jarvis * Art direction: Virginia Team * Design: Chris Ferra * Photography: Bev Parker * Make-up: Mary Beth Felts * Digital imaging: Colourworks ==References== ==Other websites== * Category:2001 albums Category:Garth Brooks albums",
 "title": "Scarecrow (Garth Brooks album)"
}