{
 "id": "499403",
 "text": "In Pieces is the fifth studio album by American country music artist Garth Brooks. It was released on August 31, 1993. It debuted at #1 on the Billboard 200 and the Top Country Albums chart. It was also a huge hit outside the United States. In Great Britain it was Brooks' highest placed album on the charts. It reached the top ten of the country album charts before it was issued officially (due to imports from both the United States and Ireland). Critics felt that this would ruin the album's sales once it was issued. However, when it was eventually issued in Britain in early 1994 it went to #1 on the country charts and reached #2 in the pop charts and also produced two top 40 hit singles on the British pop charts. The track \"Callin' Baton Rouge\" was previously a #37 peaking single in 1987 for the New Grass Revival, whose members back Brooks on his rendition. It was the first time the group had recorded together since they disbanded in 1989. In an interview with BBC Radio DJ Richard Wooton, Brooks stated that the track \"The Cowboy Song\" (which was composed in 1987 by Roy Robinson) was found in a trash can by someone on his team who liked the song and played the track to him. ==Background== Brooks commented on the album saying: \"In Pieces was just time to smile. It was time to laugh, it was time to get loud. It's definitely the most live album that we've ever cut. I think the band went to a different level on this. They seemed to play more like a band that had been together for years than studio musicians that come together and play at time to time. So this one is all there for me. I like to listen to it loud, and I just love the stuff like Baton Rouge and Ain't Going Down Til The Sun Comes Up. From One Night A Day, all the way to the very last song, The Cowboy Song, which is definitely my favorite off In Pieces and it will stand up with anything that I have cut over the past five years. Like the other things, I'm very proud of this one and I hope you like it.'' ==Track listing== The track ordering has varied on different releases of this album. ===Original release=== #\"Standing Outside the Fire\" (Jenny Yates, Garth Brooks) – 3:52 #\"The Night I Called the Old Man Out\" (Pat Alger, Kim Williams, Brooks) – 3:12 #\"American Honky-Tonk Bar Association\" (Bryan Kennedy, Jim Rushing) – 3:33 #\"One Night a Day\" (Gary Burr, Pete Wasner) – 4:15 #\"Kickin' and Screamin'\" (Tony Arata) – 4:02 #\"Ain't Goin' Down ('Til the Sun Comes Up)\" (Kent Blazy, Williams, Brooks) – 4:33 #\"The Red Strokes\" (James Garver, Lisa Sanderson, Yates, Brooks) – 3:44 #\"Callin' Baton Rouge\" (Dennis Linde) – 2:38 #\"The Night Will Only Know\" (Stephanie Davis, Yates, Brooks) – 3:55 #\"The Cowboy Song\" (Roy Robinson) – 3:59 ===Limited series=== #\"Standing Outside the Fire\" #\"The Night I Called the Old Man Out\" #\"American Honky-Tonk Bar Association\" #\"One Night a Day\" #\"Kickin' and Screamin'\" #\"Anonymous\" (Tony Arata, Jon Schwabe) – 2:55 #\"Ain't Goin' Down ('Til The Sun Comes Up)\" #\"The Red Strokes\" #\"Callin' Baton Rouge\" #\"The Night Will Only Know\" #\"The Cowboy Song\" ===Subsequent releases (also known as The Remastered series)=== #\"Standing Outside the Fire\" #\"The Night I Called the Old Man Out\" #\"American Honky-Tonk Bar Association\" #\"One Night a Day\" #\"Ain't Goin' Down ('Til The Sun Comes Up)\" #\"Anonymous\" #\"Kickin' and Screamin'\" #\"The Red Strokes\" #\"Callin' Baton Rouge\" #\"The Night Will Only Know\" #\"The Cowboy Song\" ==Chart performance== In Pieces debuted at #1 on the U.S. Billboard 200, becoming his third, and #1 on the Top Country Albums, becoming his fourth #1 Country album. In July 1998, In Pieces was certified 8 x Platinum by the RIAA. ===Charts=== Charts (1993) Peak position Australian Albums Chart 1 Canadian RPM Top Albums 3 Canadian RPM Country Albums 1 Dutch Albums Chart 91 European Albums Chart 11 German Albums Chart 83 Irish Albums Chart 1 New Zealand Albums Chart 3 Norwegian Albums Chart 18 UK Albums Chart 2 U.S. Billboard 200 1 U.S. Billboard Top Country Albums 1 ===End of decade charts=== Chart (1990–1999) Position U.S. Billboard 200 85 ===Sales and certifications=== Region Provider Certification Sales/shipments Australia ARIA 2 x Platinum 140,000 Brazil ABPD Gold 100,000 Canada CRIA 5 x Platinum 500,000 Ireland IRMA 4 x Platinum 60,000 Japan Oricon N/A 10,000 New Zealand NZ Gold 7,500 Spain PROMUSICAE N/A 20,000 United Kingdom BPI Gold 100,000 United States RIAA 8 x Platinum 8,000,000 World-Wide 8,937,500 ===Singles=== Year Single Peak chart positions US Country CAN Country UK 1993 \"Ain't Going Down ('Til the Sun Comes Up)\" 1 1 13 \"American Honky-Tonk Bar Association\" 1 2 — \"Standing Outside the Fire\" 3 3 28 1994 \"One Night a Day\" 7 14 — \"Callin' Baton Rouge\" 2 1 — \"The Red Strokes\" 49 38 13 ===Chart Successions=== ==Personnel== *Garth Brooks - lead and backing vocals, guitar ===Additional musicians and staff=== *Sam Bacco - percussion *Bruce Bouton - pedal steel guitar *Sam Bush - mandolin , fiddle , backing vocals *Mark Casstevens - acoustic guitar *Mike Chapman - bass guitar, Synclavier programming *Kathy Chiavola - backing vocals *John Cowan - backing vocals *Helen Darling - backing vocals *Jerry Douglas - dobro *Bobby Emmons - Hammond B-3 organ *Ty England - acoustic guitar, backing vocals *Béla Fleck - banjo *Pat Flynn - acoustic guitar *Rob Hajacos - fiddle *Jim Horn - saxophone *Roy Huskey, Jr. - bass *Chris Leuzinger - acoustic guitar, electric guitar *Steve McClure - electric guitar, pedal steel guitar *Terry McMillan - harmonica *Ferrell Morris - percussion *Denny Purcell - digital remastering *Mike Palmer - drums, percussion *Allen Reynolds - producer *Milton Sledge - drums, percussion *Bobby Wood - piano, keyboards *Trisha Yearwood - background vocals ==References== Category:1993 albums Category:Garth Brooks albums",
 "title": "In Pieces"
}