{
 "id": "499400",
 "text": "Ropin' the Wind is the third studio album by American country music artist Garth Brooks. It was released on September 2, 1991 and was his first studio album to debut at No. 1 the Billboard 200 chart and the Top Country Albums chart. There it enjoyed four runs at No. 1 between September 28, 1991 - April 3, 1992, spending a combined 18 weeks at the top, eventually being certified 14x Platinum by the RIAA in 1998. In the UK it reached the Top 50 pop albums list and went to No. 1 for several months on the country charts. It has gone to sell 17 million copies world wide. The track \"Shameless\" is a cover of a Billy Joel song, previously recorded on his 1989 album Storm Front. According to music review website AllMusic, Ropin' the Wind is the first country album to debut at No. 1 on the Billboard 200. ==Background== Brooks commented on the album saying : \"Ropin' the Wind was what we called the son of Fences. Ropin' the Wind was made in this kind of tour that we were on from No Fences. We were gone, pretty much 250 days out of the year. And in that remaining 100 days, I elected to cut Ropin' The Wind, and try to write for it. This album became a lot bigger than I ever thought it could possibly be. And when I listen to the singles off of it like Rodeo, What She's Doing Now, The River, Papa Loved Mama, and Shameless, I look at it and stand very proud. And then when I also look at the cuts, Against The Grain, Cold Shoulder, these songs I am equally proud of.'\" ==Track listing== # \"Against the Grain\" (Bruce Bouton, Larry Cordle, Carl Jackson) – 2:22 # \"Rodeo\" (Larry Bastian) – 3:53 # \"What She's Doing Now\" (Pat Alger, Garth Brooks) – 3:26 # \"Burning Bridges\" (Stephanie C. Brown, Brooks) – 3:35 # \"Which One of Them\" (Brooks) - 2:39A # \"Papa Loved Mama\" (Kim Williams, Brooks) – 2:51 # \"Shameless\" (Billy Joel) – 4:19 # \"Cold Shoulder\" (Kent Blazy, Williams, Brooks) – 3:55 # \"We Bury the Hatchet\" (Royal Wade Kimes, Brooks) – 3:05 # \"In Lonesome Dove\" (Cynthia Limbaugh, Brooks) – 4:48 # \"The River\" (Victoria Shaw, Brooks) – 4:25 AThis track was not on the original release of the album. It first appeared when the album was re- released as part of Brooks' first Limited Series box set collection, and remained part of subsequent releases of the album until 2014, when it was released digitally for the first time. ==Chart performance== Ropin' the Wind debuted at No. 1 on the U.S. Billboard 200, becoming his first,and, Matthew Duayne Cochran's first write, and No. 1 on the Top Country Albums number-one album selling 400,000 copies, becoming his second No. 1 Country album. In September 1998, Ropin' the Wind was certified 14 x platinum by the RIAA. ===Charts=== Charts (1991) Peak position Australian Albums Chart 21 Canadian RPM Top Albums 22 Canadian RPM Country Albums 1 Dutch Albums Chart 69 European Albums Charthttps://books.google.com/books?id=jg8EAAAAMBAJ&lr;=&rview;=1|title=Hits of the World - Eurochart|work=Billboard|publisher=Nielsen Business Media, Inc.|date=23 May 1992|page=43 91 Irish Albums Chart 10 New Zealand Albums Chart 33 Norwegian Albums Chart 14 Spanish Albums Chart 31 UK Albums Chart 41 U.S. Billboard 200 1 U.S. Billboard Top Country Albums 1 ===Sales and certifications=== Region Provider Certification Sales/Shipments Australia ARIA Platinum 70,000+ Canada CRIA 5 x Platinum 500,000+ Ireland IRMA 3 x Platinum 45,000 Japan Oricon N/A 23,000 Spain PROMUSICAE N/A 40,000+ United States RIAA 14 x Platinum 14,800,000 World-Wide 15,478,000+ ===End of decade charts=== Chart (1990–1999) Position U.S. Billboard 200 12 ===Singles=== Year Single Peak chart positions US Country CAN Country CAN AC UK 1991 \"Rodeo\" 3 1 — — \"Shameless\" 1 1 26 71 \"What She's Doing Now\" 1 1 — — 1992 \"Papa Loved Mama\" 3 2 — — \"The River\" 1 1 — — ===Other charted songs=== Year Single Peak positions US Country 1992 \"Against the Grain\" 66 ===Chart successions=== ==Personnel== * Garth Brooks - lead and backing vocals ===Additional musicians=== * Susan Ashton - backing vocals * Bruce Bouton - lap and pedal steel guitars, dobro * Sam Bush - mandolin * Mark Casstevens - acoustic guitar * Mike Chapman - electric bass * Larry Cordle - backing vocals * Jerry Douglas - dobro * Carl Jackson - backing vocals * Chris Leuzinger - electric guitar * Rob Hajacos - fiddle * Edgar Meyer - acoustic bass * Milton Sledge - drums, percussion * Bobby Wood - keyboards * Trisha Yearwood - backing vocals ==References== Category:1991 albums Category:Garth Brooks albums",
 "title": "Ropin' the Wind"
}