{
 "id": "499405",
 "text": "Sevens is the seventh studio album by American country music artist Garth Brooks. It was released on November 25, 1997, and debuted at #1 on the Billboard 200, and on the Top Country Albums chart. The album also topped the Country album charts in Britain for several months and crossed over into the mainstream pop charts. His duet with Trisha Yearwood, \"In Another's Eyes\", won the Grammy Award for Best Country Collaboration with Vocals at the Grammy Awards of 1998. Sevens was nominated for the Best Country Album Grammy the following year. ==Background== Brooks commented on the album by saying: \"I'm proud, I'm excited, I'm nervous, and it feels good to be back in the game again. This is a very personal album. I only wrote six of the songs, but there are many that are so 'me' that people I work with every day thought I wrote them\". ==Track listing== #\"Longneck Bottle\" (Rick Carnes, Steve Wariner) – 2:15 #\"How You Ever Gonna Know\" (Kent Blazy, Garth Brooks) – 3:35 #\"She's Gonna Make It\" (Blazy, Kim Williams, Brooks) – 2:45 #\"I Don't Have to Wonder\" (Shawn Camp, Taylor Dunn) – 3:04 #\"Two Piña Coladas\" (Camp, Benita Hill, Sandy Manson) – 3:34 #\"Cowboy Cadillac\" (Bryan Kennedy, Brooks) – 2:50 #\"Fit for a King\" (Jim Rushing, Carl Jackson) – 3:58 #\"Do What You Gotta Do\" (Pat Flynn) – 2:57 #\"You Move Me\" (Gordon Kennedy, Pierce Pettis) – 4:34 #\"In Another's Eyes\" (Bobby Wood, John Peppard, Brooks) – 3:33 #*duet with Trisha Yearwood #\"When There's No One Around\" (Tim O'Brien, Darrell Scott) – 3:33 #\"A Friend to Me\" (Victoria Shaw, Brooks) – 3:05 #\"Take The Keys to My Heart\" (Hill, Pam Wolfe, Tommy Smith) – 2:31 #\"Belleau Wood\" (Joe Henry, Brooks) – 3:29 ==Chart performance== Sevens debuted at #1 on the U.S. Billboard 200, becoming his fifth, and #1 on the Top Country Albums, becoming his seventh #1 Country album. In November 2006, Sevens was certified 10 x Platinum by the RIAA. ===Charts=== Charts (1997) Peak position Australian Albums Chart 20 Canadian RPM Country Albums 1 Canadian RPM Top Albums 3 Danish Albums Chart 12 Dutch Albums Chart 80 European Albums Chart 33 German Albums Chart 41 Irish Albums Chart 4 Norwegian Albums Chart 8 Spanish Albums Chart 40 Swiss Albums Chart 38 UK Albums Chart 34 U.S. Billboard 200 1 U.S. Billboard Top Country Albums 1 ===Certifications=== Region Provider Certification Sales/Shipments Australia ARIA Platinum 70,000 Canada CRIA 5 x platinum 500,000 United Kingdom BPI Silver 60,000 United States RIAA 10 x Platinum 10,000,000 ===End of decade charts=== Chart (1990–1999) Position U.S. Billboard 200 42 ===Chart Successions=== ==Credits== ===Technical=== *Recorded and Mixed by Mark Miller *Recorded at Jack's Tracks Recording Studio *Assisted by Duke Duczer and Joe Hayden *Strings Recorded at Javelina Studios *Mastered at Georgetown Masters by Denny Purcell *Digital Editing by Carlos Grier ==Personnel== As listed in liner notes. *Susan Ashton – background vocals (\"She's Gonna Make It\", \"You Move Me\") *Sam Bacco – percussion (\"You Move Me\", \"Belleau Wood\"), congas (\"She's Gonna Make It\") *Bruce Bouton – steel guitar *Garth Brooks – lead vocals, background vocals *Sam Bush – background vocals (\"Do What You Gotta Do\"), mandolin (\"Do What You Gotta Do\", \"When There's No One Around\") *Shawn Camp – acoustic guitar (\"Two Piña Coladas\") *Mark Casstevens – acoustic guitar *Mike Chapman – bass guitar *John Cowan – background vocals (\"Do What You Gotta Do\") *Béla Fleck – banjo *Pat Flynn – acoustic guitar (\"Do What You Gotta Do\") *Kevin Grant – bass guitar (\"Fit for a King\") *Rob Hajacos – fiddle *Randy Hardison – drums (\"Fit for a King\") *Lona Heid – background vocals (\"Fit for a King\") *Randy Howard – fiddle (\"Fit for a King\") *Carl Jackson – acoustic guitar, background vocals (\"Fit for a King\") *Chris Leuzinger – electric guitar, nylon string guitar *Edgar Meyer – arco bass (\"Belleau Wood\") *Al Perkins – Dobro (\"Fit for a King\") *Milton Sledge – drums, percussion *Catherine Styron – piano (\"Fit for a King\") *Steve Wariner – acoustic guitar (\"Longneck Bottle\") *Bobby Wood – piano, keyboard Crowd vocals on \"Two Piña Coladas\": Dorothy \"The Birthday Girl\" Robinson, Charles Green, Mat Lindsey, Sandy Mason, Shawn Camp, Big Al, \"Double D\", Sam \"The Man\" Duczer, Garth Brooks All strings performed by the Nashville String Machine; conducted and arranged by Jim Ed Norman. ===Art=== *Production: Carlton Davis *Production Assistant: Denise Jarvis *Art Direction: Virginia Team *Design: Jerry Joyner *Photography: Beverly Parker *Additional Photographs: Henry Diltz, Virginia Team and Jerry Joyner *Make-Up: Mary Beth Felts *Digital Imager: Harris Graphics ==First editions== 777,777 copies of Sevens were marked as First Editions. These albums have a gold seal on the CD booklet and a similar mark on the CD itself. Canadian versions of the albums have a maple leaf shaped seal on the cover. First Editions were not released outside of North America. ==References== Category:1997 albums Category:Garth Brooks albums",
 "title": "Sevens (album)"
}