{
 "id": "499741",
 "text": "John Sherwood de Lancie, Jr. (born March 20, 1948) is an American actor, director, producer, writer, educator, sailor, voice artist, and comedian, best known for his role of Q in Star Trek: The Next Generation (1987–present) and as the voice of Discord in My Little Pony: Friendship Is Magic (2010–2019). He is also known for his quite deep, resonant voice. De Lancie performed in Days of Our Lives (1982–1986; 1989–1990) as Eugene Bradford. De Lancie was featured in several roles on television series, including Frank Simmons in Stargate SG-1 (2001–2002) and Donald Margolis in Breaking Bad (2009–2010). He is noted for his public support of bronies of the My Little Pony: Friendship Is Magic fandom. ==Early life== De Lancie was born John Sherwood de Lancie, Jr. in Philadelphia, Pennsylvania on March 20, 1948 to John and Andrea de Lancie.\"De Lancie, John 1948-.\" Contemporary Authors. Gale. 2004. HighBeam Research. 11 Apr. 2015 . ==Career== De Lancie attended Kent State University and the Juilliard School. He has appeared in several television series. These include L.A. Law, Days of Our Lives, Star Trek: The Next Generation, The Practice, and Picket Fences. He has also appeared in Stargate SG-1, Breaking Bad, and Torchwood: Miracle Day. ==Awards and nominations== Award Year Category Nominated work Result Ref. Viewers for Quality Television Awards 1993 Specialty Player Star Trek: The Next Generation Soap Opera Digest Awards 1984 Outstanding Actor in a Supporting Role in a Daytime Soap Opera Days of Our Lives 1985 Outstanding Actor in a Supporting Role in a Daytime Serial Days of Our Lives 1986 Outstanding Comic Relief Role on a Daytime Serial Days of Our Lives Online Film & Television Association 1998 Best Host or Performer of a Variety, Musical, or Comedy Special Best Guest Actor in a Comedy Series Fired Up NAVGTR Awards 2013 Performance in a Comedy, Lead Quantum Conundrum Behind the Voice Actors Awards 2012 Best Vocal Performance in a Television Series in a Guest Role My Little Pony: Friendship Is Magic 2015 Best Male Vocal Performance in a Television Series in a Supporting Role - Comedy/Musical 2016 Best Vocal Ensemble in a Video Game StarCraft II: Legacy of the Void ==References== ==Other websites== * Category:1948 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from Pennsylvania Category:People with dyslexia",
 "title": "John de Lancie"
}