{
 "id": "500181",
 "text": "Walter Bendix Schönflies Benjamin (; 15 July 1892 – 26 September 1940) was a German philosopher, cultural critic, and translator. Benjamin was born to a Jewish family in Berlin, then-German Empire. He worked in many subjects such as German idealism, Romanticism, historical materialism, and Jewish mysticism. He helped aesthetic theory and Western Marxism grow. Benjamin died by suicide by taking an overdose of morphine in Portbou at the French–Spanish border while attempting to escape from the Nazis at the age of 48. == Family == Jewish-East German judge and politician Hilde Benjamin was his brother's wife. ==References== ==Other websites== * Walter Benjamin, at the Stanford Encyclopedia of Philosophy * The Internationale Walter Benjamin Gesellschaft. In English and German. (Defunct) * Walter Benjamin at Marxists.org * Fragments of the Passagenwerk: The Arcades Project, Giles Peaker * Aufklärung für Kinder, by Walter Benjamin. 30 broadcasts for German Radio between 1929–1932 specifically for children, maybe 7–14 or so, each consisting of a 20 minute talk or monologue. * One Way Street: Fragments for Walter Benjamin (1993), by John Hughes. This documentary provides clear and accessible introductions to some of the central ideas in Benjamin's writings. * Protocols to the Experiments on Hashish, Opium and Mescaline Translated by Scott J. Thompson, copyright March 25, 1997 * From 'Rausch' to Rebellion An introductory essay by Scott J. Thompson * Paris, capitale du XIXe siècle In French * Walter Benjamin Research Syndicate * \"Walter Benjamin for Historians\", American Historical Review, Vol. 106, No. 5. December 2001. * \"Walter Benjamin on the idea of Progress\" ...and the law of \"uneven and combined development\" * Who Killed Walter Benjamin..., (Spain/The Netherlands/Germany, 2005, 73 min.) a documentary film about the circumstances of Benjamin's death by David Mauas Category:1892 births Category:1940 deaths Category:20th-century German philosophers Category:Cultural critics Category:Drug-related suicides Category:German critics Category:German people of World War II Category:19th- century German philosophers Category:Jewish German scientists Category:Jewish German writers Category:Marxists Category:Refugees from Nazism Category:German translators Category:Writers from Berlin Category:Writers who committed suicide",
 "title": "Walter Benjamin"
}