{
 "id": "500320",
 "text": "thumb|right|250px| Alien 3 (stylized as ALIEN3) is a British science fiction- horror movie. It was released on 22 May 1992. It was the debut feature movie of director David Fincher. Alien 3 movie stars Sigourney Weaver, Charles Dance, Charles S. Dutton and Lance Henriksen. It is a sequel to Alien (1979) and Aliens (1986). Alien 3 was by followed by Alien: Resurrection (1997). == Plot == The movie continues the plot of the 1986 movie Aliens. Heading back to Earth a spacecraft has flight difficulties. It crash lands on a planet called Fiorina 161. The crash kills everyone aboard except Lieutenant Ellen Ripley (Sigourney Weaver). Fiorina 161 is a planet where the temperature averages forty degrees below zero. It was a maximum security prison colony. A group of ex-prisoners chose to remain on the planet. They belong to a sect identified as \"an apocalyptic millennarian fundamentalist Christian sect.\" The first thing Ripley has to do is shave her head because of the lice there. She is threatened by being the only female on the planet. While waiting for a rescue ship it is discovered that one of the aliens Ripley and the others were fighting before has found its way to Fiorina 161. A pet dog is the first victim. Then ex-prisoners begin disappearing. They have no weapons to fight the alien monster, only fire. Then Ripley learns she has a little alien inside her. Worse, it's a queen capable of producing thousands of eggs. Ripley thinks it happened while she was asleep in her pod. The creature, called a Xenomorph, refuses to kill Ripley because of the embryo inside her. == Cast == * Sigourney Weaver: Ripley * Charles S. Dutton: Dillon * Charles Dance: Clemens * Paul McGann: Golic * Brian Glover: Andrews * Ralph Brown: Aaron * Danny Webb: Morse * Lance Henriksen: Bishop * Chris Fairbank: Murphy * Pete Postlethwaite: David * Danielle Edmond: Newt == Production == The movie had a difficult production, with various screenwriters and directors getting involved in the project. Shooting began without a finished script. The movie was the big-budget debut for the young David Fincher. He was brought into the project after a proposed version with Vincent Ward at the helm was cancelled well into pre-production. Fincher had little time to prepare. The experience of making the movie proved agonizing for him. == References == == Other websites == * Alien 3 at the Internet Movie Database Category:1992 science fiction movies Category:1992 horror movies Category:1990s science fiction horror movies Category:American monster movies Category:20th Century Fox movies Category:Alien movies Category:English-language movies Category:Sequel movies",
 "title": "Alien 3"
}