{
 "id": "50037",
 "text": "Air France is one of the largest airlines in the world. It is based in France. It is owned by Air France-KLM. Before it merged with KLM, it employed 71,654 people. Its headquarters are at Charles de Gaulle International Airport\"Head Office ,Air France. Retrieved on 18 May 2009. near Paris. Air France is a founding member of SkyTeam alongside Aeroméxico, Delta Air Lines and Korean Air. == History == The airline can be traced back to 1933, when four other French airlines were combined to create Air France. Air France hired its first flight attendants in 1946. The airline started flying between Paris and New York City on July 1, 1946. In 1957, the airline bought its first jet aircraft. http://corporate.airfrance.com/fileadmin/dossiers/documents/press_kits/new- york_2014.06-en.pdf Air France was one of 4 airlines that flew the Concorde. It used it from 1976 until 2003. In 1988, the airline became the first to fly the Airbus A320. In 2003, KLM Royal Dutch Airlines and Air France announced they were going to be combining. The combination ended in 2004. As of 2016, Air France is going through many financial problems. == Fleets == Aircraft In service Orders Notes A318-100 18 Largest operator of A318-100 A319-100 40 2 leased to Air Cote d'lvoire A320-200 46 6 2 operated for Transavia France 1 leased to Air Corsica A321-100 5 A321-200 18 A330-200 15 A340-300 13 Being retired in 2016 A350-900 18 A380-800 10 2 B777-200ER 25 B777-300ER 40 Launch customer B787-9 12 Orders under review == Gallery == File:Air France Caravelle Haafke.jpg|An Air France Sud Aviation Caravelle seen in 1979. File:145bc - Air France Boeing 767-300; F-GHGF@CDG;11.08.2001 (8082565393).jpg|An Air France Boeing 767 at Paris-Charles de Gaulle Airport. File:DL2A Salon première Air France PARIS CDG Roissy 1.jpg|An Air France airport lounge. File:F-GLZI (7145593261).jpg|Air France cabin on an Airbus A340. File:F-GNIF FLIGHT ATL-CDG (7202794448).jpg|Airline food on Air France. == References == Category:1933 establishments in France Category:Airlines of France Category:Companies based in Paris Category:IATA members",
 "title": "Air France"
}