{
 "id": "500408",
 "text": "A'Lelia Bundles (born June 7, 1952) is an African-American journalist and television executive. She is also an author and Emmy Award-winning producer. == Early life == Bundles was named after A'Lelia Walker (1885–1931). Walker was her great-grandmother. Walker was also the daughter of entrepreneur and philanthropist Madam C. J. Walker. She graduated in 1970 from North Central High School. In 1974 Bundles graduated magna cum laude from Radcliffe College. She was inducted into Harvard's Alpha Iota chapter of the Phi Beta Kappa Society. Bundles received a master's degree from the Columbia University Graduate School of Journalism in 1976. ==Career== During her senior year at Harvard, Bundles began working at as a news anchor for WTLC-FM. After completing her master's degree she went to work for NBC News as a producer. Bundles was assigned to the New York, Houston and Atlanta bureaus. Bundles produced The Today Show and NBC Nightly News with Tom Brokaw. She also was a producer in Washington, DC for two of NBC's magazine programs. They were co- anchored by Connie Chung and Roger Mudd during the 1980s. In 1989 Bundles went to work at ABC News. She was the bureau chief in Washington, DC. She was the producer of ABC's World News Tonight with Peter Jennings. Bundles was also the chair of a diversity council appointed to advise ABC News president David Westin. == Boards == * Trustee of Columbia University. * Board member of the Foundation for the National ArchivesFoundation for the National Archives Board of Directors * Board member for the Madame Walker Theatre Center in Indianapolis * Board member for the Friends of Woodlawn Cemetery in the Bronx. * Past member of the Radcliffe Institute for Advanced Study's advisory board * Past member of the Harvard Alumni Association nominating committee * Past member of the Harvard Club of Washington, DC board. * Past member of the Radcliffe College Trustees Board * Past member of the National Women's Hall of Fame board. * President of the Radcliffe College Alumnae Association from 1999 to 2001. * Chair of the Columbia University Graduate School of Journalism's alumni advisory committee to re-vamp the school's alumni organization in 2006. * Previously chaired (lead) the National Association of Black Journalists Authors Showcase * Chaired the ABWH's Letitia Woods Brown Book and Articles Prize Awards Committee. * She is a juror for the duPont Awards at Columbia's Journalism School. * Past juror for the Robert F. Kennedy Awards in Broadcast Journalism. ==List of works== * On Her Own Ground: The Life and Times of Madam C. J. Walker (Scribner, 2001) * Madam C. J. Walker: Entrepreneur (Chelsea House, 1991; revised 2008) * Madam Walker Theatre Center: An Indianapolis Treasure (Arcadia Publishing, 2013) * \"Madam C. J. Walker\" and \"A'Lelia Walker\" entries in Henry Louis Gates and Evelyn Higginbotham's African American National Biography * \"Madam C. J. Walker\" entry in Darlene Clark Hines's Black Women in America. ==Awards== * Emmy Award (NBC News) * duPont Gold Baton (ABC News 1994) * American Book Award 1992 for Madam C. J. Walker: Entrepreneur (Chelsea House, 1991) * New York Times Notable Book for On Her Own Ground: The Life and Times of Madam C. J. Walker 2001 * Black Caucus of the American Library Association Honor Book 2002 Black Caucus of the American Library Association Literary Awards Winners (1994–Present) — Infoplease.com * Letitia Woods Brown Book Prize from the Association of Black Women Historians 2001 * Hurston/Wright-Borders Books Legacy Award Finalist 2002 * Distinguished alumni awards from Harvard University, Radcliffe College (2004) and Columbia University (2007) * Honorary doctorate, Indiana University, 2003 * North Central High School Hall of Fame * Black Memorabilia Hall of Fame == References == Category:1952 births Category:Living people Category:African- American writers Category:Journalists from Chicago Category:American Emmy Award winners",
 "title": "A’Lelia Bundles"
}