{
 "id": "5008",
 "text": "An acronym is a word whose letters are the first letters of other words. People often create a short acronym that means the same thing as a much longer phrase (set of words). This is faster and shorter to say than the long phrase. ==Examples== * COBOL - COmmon Business Oriented Language * LASER - Light Amplification through Stimulated Emmission of Radiation * QUANGO - Quasi- autonomous non-governmental organisation * RADAR - RAdio Detecting And Ranging * SARS - Severe Acute Respiratory Syndrome * SCUBA - Self-Contained Underwater Breathing Apparatus * SNAFU - Situation Normal: All Fouled Up An acronym usually must be able to be spoken as word. Other abbreviations such as ASAP (as soon as possible), USA (the United States of America), ECU (European Currency Unit), FBI (Federal Bureau of Investigation), NBA (National Basketball Association) have combinations of letters that are not pronounced as a single word. People just say the letters, one after another. These three- letter acronyms, and some more obscure four-letter ones such as ISDN are more often called initialisms. The word \"acronym\" comes from the Greek acro \"extreme\" and onymous \"name\". ==Extremes== The world's longest acronym, according to the Guinness Book of World Records is NIIOMTPLABOPARMBETZHELBETRABSBOMONIMONKONOTDTEKHSTROMONT (). It is 56 letters long (54 in Cyrillic). It is from the Concise Dictionary of Soviet Terminology and means \"the Laboratory for Shuttering, Reinforcement, Concrete and Ferroconcrete Operations for Composite-monolithic and Monolithic Constructions of the Department of Technology of Building Assembly Operations of the Scientific Research Institute of the Organization for Building Mechanization and Technical Aid of the Academy of Building and Architecture of the USSR.\" ==Related pages== *Initialism *Abbreviation *List of acronyms and initialisms ==References== == Other websites == * *Acronym Finder - an acronym website with many ways to search for acronyms. *All Acronyms - a website with many acronyms",
 "title": "Acronym"
}