{
 "id": "50084",
 "text": "A smart card is a card with a microchip in it. Such cards are used as a method of identification and authentication. Plastic cards that allow to take out money from a automated teller machine (ATM) often are smart cards nowadays (Some of them still have a magnetic stripe which holds the same information). Very often the user is identified with a PIN. If the PIN is entered correctly, money can be withdrawn. If the PIN is not entered correctly, the card is blocked (after a number of false attempts). At first, smart cards were used in public telephones in France, in 1983. There, the card simply stored a pre-paid credit. This credit was reduced when calls were made. Another way to solve the problem is that the balance is stored in a remote database. To make calls, a (usually toll-free number) is first called. From there, additional calls can be made. This eliminates the need for cards with chips on them. Smart cards also have many other uses, such as for making payments. These kinds of cards are used a lot in Japan, Singapore, and the Octopus card in Hong Kong. ==Kinds== There are two basic kinds of smart cards: * Simple cards only contain memory that can be read and written to. Examples of this model are phone cards, or cards for health insurance. All the processing of the data is done outside the cards * Complex cards contain an integrated microchip. In addition to being able to store data, they can also do some of the data processing. Unlike with the simple cards, there is generally no way to directly access the memory of the card. Examples of such cards include the bank cards that can be used for withdrawing money, or the SIM cards used in mobile phones. Both kind of cards contain a controller for managing the I/O. Many smart cards have RFID technology that allows them to be used without inserting them into a machine. They just need to be placed on a reader. These are called \"contactless smart cards\" and many credit and debit cards in the 21st century are this kind. ==References== ==Other websites== *What is a smart card? (from HowStuffWorks) Category:Money Category:Authentication methods",
 "title": "Smart card"
}