{
 "id": "50109",
 "text": "The Sámi (also spelled as Saami or Sami) are an ethnic group of people. Their homeland is Sápmi, which is in far northern Europe: Norway, Sweden, Finland and west Russia. There are from 80,000 to 135,000 Sami people in the world. The Sami are sometimes called Lapps, but this is insulting and has a negative meaning. In English the area is sometimes still called Lapland. There are 10 different Sámi languages. Six of the languages can be written. The other four have very few speakers. \"Archaeological research indicates that a culture identified as Sami arose in the Scandinavian peninsula between 1500 and 1000 B.C.\" ==History== The first writing that includes the Sámi is from about 98 A.D. by Tacitus.Odd Mathis Hætta. \"The Sami - Before and Now\". March 2002; number 2. The Norseman. p. 5\"... Tacitus ... in his De origine et situ Germanorum ... Hætta is assistant professor at the University College in Finnmark\" One description from 896 was told to Alfred the Great by Ohthere of Hålogaland, who was a Norwegian chieftain.Odd Mathis Hætta. \"The Sami - Before and Now\". March 2002; number 2. The Norseman. p. 5-9 Old Norse stories, such as the Icelandic sagas, talk about the Sami. \"Olav Tryggvason's Saga says \"that the king killed a big man who was \"troll-wise\" and \"there followed him a great number of Finns whenever he had need of them\". (\"Finns\" is a name that sometimes meant \"Sami people\".) In the 19th century, Russia stopped allowing reindeer farmers and their reindeer herds to come travel over the Norway- Russia border. Some of the Sami reindeer farmers, moved to another Nordic country, and took their reindeer herds into Russia (but not through the Norway-Russia border); later another country's border with Russia, was closed to herds from reindeer farming (coming into Russia). ===Finland=== During the 16th century there was more farms in Finland. Farmers from the province of Savonia went to Middle Finland, and the original Sámi people often had to leave this land. ===Norway=== At Dovrefjell when Harald Hardrada was king, there was profit from the keeping of herds of reindeer, and the business was very popular. In regard to Sámi (in Norway) that had reindeer herds; when these Sami moved their herds (every year), then they would interact with people who lived permanently on the coast; the interaction also included verdde: a friendship of convenience; for example, Sami needed milk and fish after having been on a plateau (or highland) for some weeks; Sami might need repair of equipment; trade was done: People from the coast traded fish for meat from reindeer.Ole Magnus Rapp (2017-07-27). \"Konfliktløsning via vennskapelig fotball. Nyttevennskap\". Klassekampen. p. 9. Regarding getting the Sámi to change their religion to Christianity: In the 18th century Thomas von Westen (no), a pietist, led missionary work (among the Sami), that has been called a concerted (or special) effort. \"About a century later, Niels Vibe Stockfleth (no) worked among the Sami and translated [the Bible's] New Testament into\" [one of the Sami languages]. People living permanently on the coast in North Norway, were [largely] Sámi; these Sámi had permanent housing, and it became easier for these Sámi to stop behaving like Sámi; in some areas one was not allowed to own land, if one was Sámi; some Sámi changed names, to names that might sound more Norwegian (and family names such as Sæter, Strømeng, and Kalvemo became new family names). Sámi language [largely] disappeared among the Coastal Sámi. Sami that did reindeer farming, and Coastal Sámi slowly lost the close contact [between the two groups]. Discriminiation against Sami people was still a big problem in 2024, according to the Institute of Public Health (a government agency and research organisation). The agency has published information about research that has been made known between 2014 and 2024.https://klassekampen.no/utgave/2024-08-24/flere-skjuler-sin-samiske- identitet. [ Press agency:] NTB. Retrieved 2024-08-26https://www.bufdir.no/nasak/samer-og-identitet. Retrieved 2024-08-26 ====Policies to \"Norwegianize\" the Sámi==== \"There were organized attempts to eradicate [or make to disappear ] the Sámi language and culture[,] as a step in assimilating the Sámi into Norwegian society\".Kjetil A. Flatin. \"The view from here\". March 2002; number 2. The Norseman. p. 3 Policies to \"Norwegianize\", Samis - were in place from the late 1840s, into the 1980s. \"From the late 1840s to the 1950s, missionaries, agricultural experts and schoolteachers\" tried \"to Norwegianize the Sami\"; the \"first formal act of Parliament regarding the Norwegianization of the Sami people was made in 1848: 'The government is requested to investigate ... [find out if, and how far] there should be opportunity to bring the Norwegian Lapps, especially those living in coastal areas , instruction in the Norwegian language for the enlightenment of these people, and that the result of their findings be reported to the next Parliament'\". Norway's authorities made \"a language directive (or rule) in 1880, which\" was \"made more forceful in 1898. It\" said \"that 'Teachers in those districts where the Lappish ... and Finnish (kvænsk) languages are permitted for the sake of facilitating instruction in the public schools shall do their utmost to spread knowledge of the Norwegian language and seek to promote its use in the circles where they work'\". Furthermore, the \"government had a major objective for the schools: Not a single Sami word was to be heard on the school grounds\" or in school buildings. \"The authorities also\" used \"economic measures to carry out the work of Norwegianization, including the Land Act. A regulation [or part of the law] from 1902\" says that \"Sale [of land] may only be made to Norwegian citizens ... who can speak, read, and write the Norwegian language and use it on a day-to-day basis\". A report by the \"Parliamentary School Commission, appointed in 1922\" said, without being able to show [ evidence], \"that that the Sami are less educable [or able to learn] than others\"; the report also said that the Sami population is less gifted and the \"Sami culture does not lend itself to development\". From around 1850, a government policy of Fornorskning [tried to remove Sami culture]. An article in Klassekampen said that the policy was very rough [to Sami persons]. Into the 1980s, the policy of Fornorskning lasted in some places. ====Creation of associations==== [Possibly the first] Sami association (in Norway) was started during the New Year's weekend in 1911: Buolbmag Same Særvve, in Polmak municipality.Hans J. Henriksen. \"Sameforeninger i første del av 1900-tallet\". (January 1976) Ottar. Volume 88. p. 14-5. Published by University of Tromsø (Polmak is now part of Tana (municipality).) ===Sweden=== The first Sami association in Sweden, seems to have been started in 1903: Tärnaby lappeforening. ===Russia=== In 1826, Russia has not allowed reindeer herds and their Sami owners, to travel from Norway to Russia. Since 1852, Russia has not allowed reindeer herds and their Sami owners, to travel from Norway to Russia ==Reindeer farming == Reindeer farming, which is a type of animal husbandry, is done by Sami, between the White Sea and towards the west and the south, across Russia's Kola peninsula, Finland, Sweden and Norway, into the Hedmark area of Norway's county of Innlandet. In reindeer farming, \"the Sami travel with their flocks (of reindeer) according to an established cycle\"; the cycle makes sure \"that the\" [reindeer] can eat properly during the various [or different] seasons of the year. For example, the spring migration to summer pastures, which have a rich variety of grasses and herbs, takes place just before new calves are born in May. Summer is a time when the calves grow and the adult animals regain their strength following a long, hard winter\". Among the Sami people are nomads that do reindeer farming. They lived in their cold environment by domesticating the reindeer. They were able to get everything they needed from the deer. They ate mostly meat, milk, and cheese. Their clothing was made from reindeer skins and wool. Their tents were also made from raindeer skins. The wool clothes were beautifully decorated. The Sami protected the herds, moving with them as they migrated from summer to winter pastures. They used reindeer to pull sleds carrying their supplies. During the winter, the herds moved south of where the trees grew. The Sami lived nearby in homes made of logs or sod. Winter clothing was made from layers of reindeer skin. The inside layer would be worn with the fur facing in toward the person's skin. The second layer was worn with the fur facing out. Boots were also made of fur and lined with grass that had been gathered during the short summer. Every evening the grass would be taken out and dried by the fire, so it would be ready to use again the next day. This way, a Sámi could be warm and comfortable in even the coldest weather. Today only a few of the Sámi people still follow the herds. Those few use modern tools on their ancient migration. They use snowmobiles to herd the reindeer and rifles to kill the wolves that chase them. Even helicopters and radios are used to locate and move the reindeer. Most of the Sámi now live on small farms in one of the four nations of Lapland. They raise crops and animals, including a few reindeer, to meet their needs. The sale of reindeer meat is an important source of income for the Sámi people. The Sámi did not waste anything they got from the reindeer. The milk was used to drink or make cheese. Meat was taken for food. The blood was frozen and later used for soup and pancakes, called Blodplättar. Knives and belt buckles were carved from the bones and antlers. The sinews (tendons) were used as sewing thread. Cleaned-out stomachs were used to carry milk or cheese. Every part of a dead reindeer was used. == Sámi Crafts == Sámi crafts are called duodji (en:). The men make knives, drums and 'guksi' (burl cups) from wood, bone, and antlers. The women use leather and roots to make 'gakti' (clothing). Women also use birch and spruce to weave baskets. == Sámi clothing == Sámi clothing is called 'gakti' and was originally made from reindeer leather, but now it is usually made from wool, cotton, or silk. Usually, there are different types of clothing for men and women. == Religion and spirituality == Sámi shamanism is the main religion of the Sami people. These beliefs are connected to the land, animism, and the supernatural. A scholarship has been given (as of 2024) so that a PhD student can do her research regarding holy mountains and activism in Sapmi; The scholarship is given by the largest university in Norway.https://www.sagat.no/nyheter/skal-ta-doktorgrad-i-hoyaktuell-samisk- tematikk/19.45963. Retrieved 2024-08-28 There is some practice of bear worship. It is a polytheistic religion with many gods. The Sami shaman are called the 'Noadi'. There are some 'wise men' and 'wise women' who try to heal people who are sick. They use rituals and herbal medicine. Some Sami people have changed their beliefs to Christianity and joined either the Russian Orthodox Church or the Lutheran. ==In popular culture== Publications by Snorri Sturluson (1178-1241) say that a Sami woman, Snøfrid, married Harald Fairhair. It also said that none of her children or grandchildren became kings; first when Harald Hardrada became a king, then her blood became part of the blood of the royal family.Frode Korslund. \"Stammor Snøfrid?\" [\"ancestress Snøfrid?] (2017-July-24) Klassekampen. p. 16. \"Frode Korslund, cand. philol.\" The character Kristoff in the 2013 Disney film Frozen is Sámi. The song that plays in the movie's first scene, Frozen Heart, was written by the South Sámi composer Frode Fjellheim. It is in a traditional Sámi style called Vuelie. Some people said that Kristoff was not a good way to show Sami because he is light-skinned and blond. This is called whitewashing. Although some Sami look like Kristoff, most have darker skin and hair. When making the 2019 sequel, Frozen II, Disney signed a contract with Sámi leaders and hired Sami experts to make sure the culture would be shown respectfully. == Related pages == * Nomads * Fosen conflict * Sami people in Norway ==References== ==Other websites== *A recent genetic link between Sami and the Volga-Ural region of Russia. 20 September 2006 Category:Nordic people Category:Arctic Category:Finland Category:Lapland Category:Norway Category:Ethnic groups in Russia Category:Sweden",
 "title": "Sámi"
}