{
 "id": "501326",
 "text": "The arrondissement of Blaye is an arrondissement of France. It is part of the Gironde département in the Nouvelle-Aquitaine region. Its capital is the city of Blaye. ==History== When the Gironde department was created on 17 February 1800, the arrondissement of Blaye was part of that original department. ==Geography== The arrondissement of Blaye is the smallest of the arrondissements of the Gironde department, with an area of . It is in northern part of the department and it has 88,115 inhabitants and a population density of inhabitants/km². The arrondissement of Blaye is bordered to the north and northeast by the Charente-Maritime department, to the southeast by the arrondissement of Libourne, to the south by the arrondissement of Bordeaux and to the west by the arrondissement of Lesparre-Médoc. The Gironde estuary is to northwest of the arrondissement. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Blaye, there are only two cantons: # L'Estuaire, with 39 communes, all in the arrondissement of Blaye; # Le Nord- Gironde, with 26 communes in the arrondissement of Blaye and 2 communes in the arrondissement of Bordeaux. ===Communes=== The arrondissement of Blaye has 63 communes; they are (with their INSEE codes): # Anglade (33006) # Val-de-Virvée (33018) # Bayon-sur-Gironde (33035) # Berson (33047) # Blaye (33058) # Bourg (33067) # Braud-et-Saint-Louis (33073) # Campugnan (33089) # Cars (33100) # Cartelègue (33101) # Cavignac (33114) # Cézac (33123) # Civrac-de-Blaye (33126) # Comps (33132) # Cubnezais (33142) # Cubzac-les-Ponts (33143) # Donnezac (33151) # Étauliers (33159) # Eyrans (33161) # Fours (33172) # Gauriac (33182) # Gauriaguet (33183) # Générac (33184) # Lansac (33228) # Laruscade (33233) # Marcenais (33266) # Marcillac (33267) # Marsas (33272) # Mazion (33280) # Mombrier (33285) # Peujard (33321) # Plassac (33325) # Pleine-Selve (33326) # Prignac-et-Marcamps (33339) # Pugnac (33341) # Reignac (33351) # Saint-André-de-Cubzac (33366) # Saint-Androny (33370) # Saint-Aubin- de-Blaye (33374) # Saint-Caprais-de-Blaye (33380) # Saint-Christoly-de-Blaye (33382) # Saint-Ciers-de-Canesse (33388) # Saint-Ciers-sur-Gironde (33389) # Saint-Genès-de-Blaye (33405) # Saint-Gervais (33415) # Saint- Girons-d'Aiguevives (33416) # Saint-Laurent-d'Arce (33425) # Saint-Mariens (33439) # Saint-Martin-Lacaussade (33441) # Saint-Palais (33456) # Saint-Paul (33458) # Saint-Savin (33473) # Saint-Seurin-de-Bourg (33475) # Saint-Seurin- de-Cursac (33477) # Saint-Trojan (33486) # Saint-Vivien-de-Blaye (33489) # Saint-Yzan-de-Soudiac (33492) # Samonac (33500) # Saugon (33502) # Tauriac (33525) # Teuillac (33530) # Villeneuve (33551) # Virsac (33553) The communes in the arrondissement with more inhabitants are: INSEE code Commune Population (2014) Canton Intercommunality 33366 Saint-André-de-Cubzac 10,422 Le Nord- Gironde Le Cubzaguais 33058 Blaye 4,769 L'Estuaire Blaye 33018 Val de Virvée 3,366 Le Nord-Gironde Le Cubzaguais 33473 Saint-Savin 3,088 Le Nord-Gironde Latitude Nord Gironde 33389 Saint-Ciers-sur-Gironde 3,068 L'Estuaire L'Estuaire - Canton de Saint-Ciers-sur-Gironde 33233 Laruscade 2,602 Le Nord- Gironde Latitude Nord Gironde 33123 Cézac 2,503 Le Nord-Gironde Latitude Nord Gironde 33143 Cubzac-les-Ponts 2,346 Le Nord-Gironde Le Cubzaguais 33492 Saint-Yzan-de-Soudiac 2,319 Le Nord-Gironde Latitude Nord Gironde 33341 Pugnac 2,297 L'Estuaire Le Cubzaguais ==Related pages== * Arrondissements of the Gironde department * Communes of the Gironde department ==References== Blaye",
 "title": "Arrondissement of Blaye"
}