{
 "id": "501501",
 "text": "Bill Farmer (born November 14, 1952) is an American voice actor, comedian and impressionist. He is best known for being the current voice of the Disney character Goofy, since 1986. He also voices Pluto, Horace Horsecollar and many other Disney characters. He was born in Pratt, Kansas. At age 10 he was already doing voice impressions. While in college he worked in radio and television. He worked as a stand-up comedian. In late 1986 he was one of hundreds of voice actors competing for a few roles at Disney studios. He got the voice acting job for Goofy, one of his favorite characters growing up. He has been the voice of Goofy ever since. In 2009 Farmer was named a Disney Legend. ==Filmography== ===Films=== List of voice performances in feature films Year Title Role Notes 1989 The Little Mermaid Additional voices 1991 Rover Dangerfield Farm voices 1991 Beauty and the Beast Additional voices 1992 Yakety Yak, Take it Another Again Goofy Music video 1992 Aladdin Additional voices 1994 The Lion King Additional voices 1995 Theodore Rex Additional voices 1995 A Goofy Movie Goofy Nominated - Annie Award for Voice Acting by a Male Performer in an Animated Feature Production 1995 Pocahontas Additional voices 1995 Toy Story Additional voices 1996 Space Jam Sylvester the Cat, Foghorn Leghorn, Yosemite Sam 1996 The Hunchback of Notre Dame Additional voices 1997 Cats Don't Dance Additional voices 1997 Hercules Additional voices 1998 Mulan Additional voices 1998 A Bug's Life Additional voices 1998 Tarzan Additional voices 1999 The Iron Giant Additional voices 1999 Toy Story 2 Additional voices 2000 The Emperor's New Groove Additional voices 2001 Monsters, Inc. Additional voices 2002 Lilo & Stitch Additional voices 2002 Treasure Planet Additional voices 2003 Brother Bear Additional voices 2004 Home on the Range Additional voices 2005 Chicken Little Additional voices 2006 Ice Age: The Meltdown Additional voices 2006 Cars Additional voices 2007 Happily N'Ever After Additional voices 2007 Surf's Up Additional voices 2008 Horton Hears a Who Willie the Bear 2009 The Princess and the Frog Additional voices 2010 I Want Your Money George H.W. Bush, George W. Bush 2012 The Lorax Additional voices 2013 Monsters University Additional voices 2015 Minions Additional voices 2016 The Secret Life of Pets Additional voices 2016 Sing Bob the News Reporter Dog 2017 Despicable Me 3 Additional voices 2018 The Grinch Additional voices 2020 Phineas and Ferb the Movie: Candace Against the Universe Hermellivue List of voice roles in direct-to-video and television films Year Title Role Notes 1990 The Prince and the Pauper Goofy, Pluto, Horace Horsecollar, Weasels #1 1990 Disney Sing-Along-Songs: Disneyland Fun Goofy, Pluto 1993 Disney Sing-Along-Songs: The Twelve Days of Christmas Goofy 1994–95 Mickey's Fun Songs series Goofy, Pluto 1995 Runaway Brain Pluto 1997 Casper: A Spirited Beginning Stinkie 1998 Casper Meets Wendy Stinkie 1998 The Wacky Adventures of Ronald McDonald Knight #2, Mob Leader (ep. 5) 1998 The Spirit of Mickey Goofy 1999 Mickey's Once Upon a Christmas Goofy, Pluto 2000 An Extremely Goofy Movie Goofy 2001 Mickey's Magical Christmas: Snowed in at the House of Mouse Goofy, Pluto, Practical Pig 2002 Mickey's House of Villains Goofy 2004 The Lion King 1½ Goofy, Sleepy 2004 Mickey, Donald, Goofy: The Three Musketeers Goofy 2004 Mickey's Twice Upon a Christmas Goofy, Pluto 2005 Son of the Mask Masked Otis 2007 Mickey's Great Clubhouse Hunt Goofy, Pluto 2009 Mickey's Adventures in Wonderland Goofy, Pluto 2009 Mickey Mouse Clubhouse: Choo-Choo Express Goofy, Pluto 2010 Mickey Mouse Clubhouse: Road Rally Goofy, Pluto 2011 Mickey Mouse Clubhouse: Space Adventure Goofy, Pluto ===Television=== Year Title Role Notes 1987 D-TV Doggone Valantine Goofy 1987 D-TV Monster Hits Goofy 1989 Goofy About Health Goofy 1989 Betty Boop's Hollywood Mystery Fergie Furbelow 1992 Raw Toonage Goofy 1992–93 Goof Troop Goofy 1992 Goof Troop Christmas Goofy 1993 Bonkers Goofy 1996 Quack Pack Pluto 1998 Paracycling Goofy 1999 Disney's Mouseworks Spaceship Pluto 1999–2000 Mickey Mouse Works Goofy, Pluto, Horace Horsecollar 1999–2003 Mona the Vampire Additional voices 2000 Harvey Birdman: Attorney at Law Secret Squirrel 2001–03 Disney's House of Mouse Goofy, Pluto, Horace Horsecollar, Practical Pig 2003–06 The Grim Adventures of Billy & Mandy Stank Williams, Blort Sportscaster 2004 Astro Boy Tawashi 2004 Game Over Race Announcer 2005 Loonatics Unleashed Mr. Leghorn 2006–16 Mickey Mouse Clubhouse Goofy, Pluto 2006–12 Robot Chicken Bugs Bunny, Daffy Duck, Pubertis 2007 Higglytown Heroes Janitor Jay 2008 The Banana Splits Fleegle 2010 'Til Death George Bush, Minister 2012–present Minnie's Bow-Toons Goofy, Pluto, others 2013 Wheel of Fortune: Making Disney Memories Week Goofy 2013-19 Mickey Mouse Goofy, Pluto 2014–present The 7D Doc, Sir Yips-A-Lot 2015 Jake and the Never Land Pirates Ghostly Bob 2017–19 Mickey and the Roadster Racers Goofy, Pluto 2019-21 Mickey Mouse: Mixed Up Adventures Goofy, Pluto 2021-present Mickey Mouse Funhouse Goofy, Pluto ===Video games=== Year Title Role Notes 1993 Sam and Max Hit the Road Sam, Psychic, Flambe 1994 Quest for Glory IV: Shadows of Darkness Leshy 1995 Full Throttle Horrace, Corley Motors Merchandise Salesman, Gas Guard Pilot, News Anchorman 1996 Mortimer and the Riddles of the Medallion Bald Eagle, Coyote, Gila Monster, Additional vocies 1998 Disney's Hades Challenge Goofy 1998 King's Quest VIII: Mask of Eternity King Gryph, Weirdling Tradesman 1998 Baldur's Gate Brunos, Irlentree, Yeslick Orothiar 2000 Mickey's Speedway USA Goofy 2000 Looney Tunes Racing Foghorn Leghorn 2000 Looney Tunes: Space Race Foghorn Leghorn 2000 Mickey Mouse Kindergarten Goofy, Pluto, Bellhop #1, Bellhop #2 2000 The Flintstones: Bedrock Bowling Bamm-Bamm Rubble, Dino Bridge 2000 The Emperor's New Groove Pacha 2001 Disney Learning: Phonics Quest Goofy, Horace Horsecollar 2001 Goofy's Fun House Goofy 2002 Ty the Tasmanian Tiger Wedgwood the Pirate, The Frill Necked Lizard 2002–present Kingdom Hearts series Goofy 2002 Disney Golf Goofy 2002 Disney Sports Soccer Goofy 2002 Disney Sports Skateboarding Goofy 2002 Disney Sports Football Goofy 2002 Disney Sports Basketball Goofy 2003 Disney's Party Goofy 2003 Toontown Online Goofy 2003 Tales of Symphonia Governor-General Dorr 2004 Ty the Tasmanian Tiger 2 Parrotbeard, Squeaver, Johno 2005 Destroy All Humans! Narrator, Rural Male 2005 Ty the Tasmanian Tiger 3: Night of the Quinkan Parrotbeard 2006 Over the Hedge Lou, Rottweiler 2006 Dead Rising Cletus Samson 2006 Yakuza Date (English version) 2006 Flushed Away Spike 2006 Nicktoons: Battle for Volcano Island Old Hermit Crab, Plant King, Crab Refugee #4, Plant Guard 2007 Meet the Robinsons Ice Cream Vendor 2008 Harvey Birdman: Attorney at Law Secret Squirrel, Cameraman, Prison Guard #2 2008 Disney Think Fast Goofy, Horace Horsecollar 2010 Epic Mickey Goofy, Horace Horsecollar 2011 Kinect Disneyland Adventures Goofy, Pluto 2012 Epic Mickey 2: The Power of Two Goofy, Horace Horsecollar, Practical Pig 2012 Epic Mickey: Power of Illusion Goofy 2014 Disney Magical World Goofy, Pluto, Sleepy ===Production credits=== Year Title Position 1992 Death Becomes Her ADR loop group 2004 Shrek 2 ADR group 2004 Bommerang Editor 2015 With Lee in Virginia Cinematographer == References == Category:1952 births Category:Living people Category:Actors from Kansas Category:Comedians from Kansas Category:American movie actors Category:American television actors Category:American video game actors Category:American voice actors",
 "title": "Bill Farmer"
}