{
 "id": "50160",
 "text": "Bede ( ; , ; 672/326 May 735), also known as Saint Bede, The Venerable Bede, and Bede the Venerable (), was a monk and an early historian of the church in England. He was a member of the sister Northumbrian monasteries of Monkwearmouth-Jarrow. He spent a great deal of time at Jarrow with its large library. Both were in the English county of Durham (now Tyne and Wear). He is well known as an author and scholar, whose best-known work, Historia ecclesiastica gentis Anglorum (The Ecclesiastical History of the English People) gained him the title \"The father of English history\". == Life == Bede became respectfully known as Venerable Bede soon after his death, but this was not linked to consideration for sainthood by the Roman Catholic Church. Bede himself said he was born in 673 and on the lands of the monastery of Wearmouth.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R.E. Latham (London; New York: Penguin Books, 1990), pp. 19–20 At age seven he was presented by his family to the Abbot of Wearmouth, Benedict Biscop, to be educated.Patrick Wormald, Times of Bede: Studies in Early English Christian Society and its Historian (Malden, MA: Blackwell Publishing, 2006), p. 62 Bede does not say if his family was noble or not. Bede was ordained a deacon when he was nineteen and at age thirty he was ordained a priest.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin Books, 1990), p. 20 While he was active in his community Bede found study, writing and teaching his favorite activities. He studied the Bible and Latin. He learnt Latin because that was the language of the Bible and other books in the monastery library. His teaching would have been very basic and his opinions were very conventional (not radical in any way).Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin Books, 1990), p. 21 At the end of his life, Bede became ill and had difficulty breathing. He went about the tasks of finishing some writings and giving away the few things that he owned.N.J. Higham, (Re-)Reading Bede: The Ecclesiastical History in Context (London; New York: Routledge, 2006), p. 18 Bede died on Ascension Day, 26 May 735.Peter Darby, Bede and the End of Time (Burlington, VT; Farnham, Surrey: Ashgate, 2012), p. 127 & n. 14 ==Historia Ecclesiastica== Bede wrote many scientific, historical and theological works in his time. Many were copied and used by other monasteries in England and Western Europe. He had one work in particular that he is famous for. One of the most valuable and important sources on Anglo- Saxon history is Bede's Ecclesiastical History of the English Nation.Peter Hunter Blair, Roman Britain and Early England; 55 B.C.–A.D. 871 (New York; London: W. W. Norton & Company, 1966), p. 10 Beda follows the pattern of Eusebius of Caesarea, who believes that history is guided by Providence. But in contrast to the bishop of Caesarea, he does not change history into defense or apology, nor into hagiography as other writers of the Middle Ages will do. Bede spent most of his life at Jarrow and this is where he wrote his history. The Ecclesiastical History is made up of five books and about 400 pages written in Latin.Stephen Batchelor, Medieval History For Dummies (Hoboken, NJ: Wiley, 2010), p. 39 It contains 800 years of the history of England from the time of Caesar to the date of its completion (731). The last chapter is about Bede himself.Bede, Ecclesiastical History of the English People, trans. Leo Sherley Price, revsd. R. E. Latham (London; New York: Penguin Books, 1990), p. 19 One man who made Bede's work possible was Benedict Biscop.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 184 He founded the Wearmouth and Jarrow monasteries. More importantly he created the library that Bede's got most of his information from.Frank Stenton, Anglo-Saxon England (Oxford University Press, 1971), p. 185 By the time of his death in 689 he had completed four trips to Rome and the south and brought back large collections of books each time. Bede's work would still not be possible if not for Ceolfrid, the fourth abbot. He doubled the size of the library left by Benedict Biscop.Abbeys and Churches, of England and Wales; Descriptive, Historical, Pictorial, ed. T. G. Bonney (London: Cassel, 1887), p. 86 Bede himself traveled no farther than York and Lindisfarne. There is no record of his ever visiting libraries in distant places. Bede says the following about his sources: == Notes == == References == == Other websites == *Ecclesiastical History of the English People , Books 1-5, L. C. Jane's 1903 Temple Classics translation. From the Internet Medieval Sourcebook. *Bede's Ecclesiastical History and the Continuation of Bede (pdf), at CCEL, edited & translated by A.M. Sellar. *Bede's World: the museum of early medieval Northumbria at Jarrow *Bede’s Ecclesiastical History commentary from The Cambridge History of English and American Literature, Volume I, 1907–21. *The Venerable Bede at Catholic Encyclopedia *The Venerable Bede from In Our Time (BBC Radio 4) Category:670s births Category:735 deaths Category:Christian saints Category:English historians Category:English poets Category:English theologians Category:Christian monks Category:People from County Durham Category:English translators",
 "title": "Bede"
}