{
 "id": "501862",
 "text": "The following is a list of notable deaths in May 2015. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==May 2015== * May 1 - David Day, 63, Australian radio broadcaster (5KA, Triple M).David Day, Adelaide radio legend, dies aged 63 * May 1 - María Elena Velasco, 74, Mexican actress, comedienne and movie producer (La India María), stomach cancer.Mexican Slapstick Comedy Icon 'La India Maria' Dies at 74 * May 1 - Pete Brown, 80, American professional golfer, heart failure and stroke. * May 1 - Stephen Milburn Anderson, 67, American movie director, writer and producer, throat cancer.Steve Anderson Dies at 67; Director of 'South Central,' 'Cash' * May 1 - Grace Lee Whitney, 85, American actress (Star Trek, Some Like It Hot, Irma la Douce). * May 1 - Gary Liddell, 60, Scottish footballer (Grimsby Town, Heart of Midlothian). (death announced on this date) * May 1 - Geoff Duke, 92, British motorcycle racer.Grand Prix and TT legend Geoff Duke has died * May 1 - Vafa Guluzade, 74, Azerbaijani diplomat and political scientist. * May 1 - Beth Whittall, 78, Canadian Olympic swimmer, double Pan American champion (1955). * May 1 - Harry Geisinger, 81, American politician, member of the Georgia House of Representatives (1969–1974, since 2005), leukemia. * May 1 - Ray Ceresino, 86, Canadian ice hockey player (Toronto Maple Leafs).Ray Ceresino's obituary * May 2 - Ruth Rendell, 85, English crime novelist (Inspector Wexford series), stroke.Author Ruth Rendell dies aged 85 * May 2 - Maya Plisetskaya, 89, Russian ballet dancer, heat attack.Умерла балерина Майя Плисецкая * May 2 - Guy Carawan, 87, American folk singer and civil rights activist.Guy Carawan obituary * May 2 - Dave Goldberg, 47, American executive (SurveyMonkey, LAUNCH Media).Silicon Valley's Dave Goldberg dies * May 2 - Sarah Correa, 22, Brazilian swimmer, South American Games champion (2010), hit by car.22 year- old Pan Ams silver medalist Sarah Correa dies after being hit by car * May 2 - Michael Blake, 69, American author and screenwriter (Dances with Wolves).Michael Blake, Oscar-Winning Screenwriter of 'Dances With Wolves,' Dies at 69 * May 2 - Konstantin K. Kuzminsky, 75, Russian performance poet.Патриарх, поэт, актер * May 2 - Stuart Archer, 100, British recipient of the George Cross.Colonel Stuart Archer, GC – obituary * May 2 - Philip S. Goodman, 89, American director, screenwriter and producer (We Shall Return, Profiles in Courage).Philip S. Goodman, Writer & Director for Film, TV, Dies at 89 * May 2 - Ryan McHenry, 27, Scottish movie director and social media personality, bone cancer.Vanity Fair on Ryan McHenry * May 2 - Norman Thaddeus Vane, 86, American screenwriter and movie director (Frightmare).Writer- Director Norman Thaddeus Vane Dies at 86 * May 2 - John Mahaffy, 96, Canadian ice hockey player (Montreal Canadiens, New York Rangers).Hockey deaths - May 2015 * May 3 - Abdul Wahid Aresar, 65, Pakistani politician.Sindhi nationalist leader Arisar dies at 65 * May 3 - Revaz Chkheidze, 88, Georgian movie director (Father of a Soldier, The Saplings).კინორეჟისორი რეზო ჩხეიძე გარდაიცვალა * May 3 - Danny Jones, 29, Welsh international rugby league player, cardiac arrest.Danny Jones dies after heart attack during rugby league match * May 3 - Abdul Basit Usman, 40–41, Filipino fugitive, shot.Palace confirms terrorist Basit Usman killed in Maguindanao * May 3 - Harry Martin, 95, American judge.Harry Martin (1920 - 2015) Obituary * May 3 - John Elders, 84, English rugby union player (Leicester).Ex-captain John Elders dies aged 84 * May 4 - Ellen Albertini Dow, 101, American actress (The Wedding Singer, Wedding Crashers, Patch Adams).Ellen Albertini Dow Dies: ‘Wedding Singer’s’ Rapping Granny Was 101 * May 4 - Jesús Hermida, 77, Spanish journalist and broadcaster, stroke.Fallece el periodista Jesús Hermida a los 77 años de edad * May 4 - Andrew Lewis, 44, Guyanese boxer, traffic accident.Former WBA welterweight champ Andrew Lewis dies in Guyana * May 4 - Joshua Ozersky, 47, American food writer.Joshua Ozersky, Prolific Food Writer, Is Dead * May 4 - Zhivko Gospodinov, 57, Bulgarian footballer.IN MEMORIAM Това бе Живко Господинов * May 5 - Jon Castañares, 90, Spanish economist and politician, Mayor of Bilbao (1979-1983).Fallece Castañares, primer alcalde del PNV de Bilbao en democracia. * May 5 - Hans Jansen, 72, Dutch politician, Member of the European Parliament (since 2014), stroke.Arabist en PVV'er Hans Jansen overleden * May 5 - Oscar Holderer, 95, American engineer, worked on Saturn V project.Oscar Holderer dies, last of Wernher von Braun's original 'Operation Paperclip' moon rocket team * May 5 - Craig Gruber, 63, American rock musician (Rainbow, Elf), prostate cancer.Rainbow bassist Craig Gruber dead at 63 * May 5 - Brian Sedgemore, 78, British politician, MP (1974–1979, 1983–2005), fall.Former Labour MP Brian Sedgemore who quit for the Lib Dems dies after a hospital fall * May 6 - Errol Brown, 71, British singer (Hot Chocolate), liver cancer.Errol Brown dead: Friends of the Hot Chocolate singer say 'he was a gentleman' * May 6 - Jerome Cooper, 68, American jazz drummer, multiple myeloma.RIP Jerome Cooper * May 6 - Jim Wright, 92, American politician, Speaker of the United States House of Representatives (1987–1989).Former U.S. House Speaker Jim Wright dies at 92 * May 7 - Józef Pazdur, 90, Polish Roman Catholic prelate, Auxiliary Bishop of Wrocław (1984–2000).Wrocław Nie żyje biskup Józef Pazdur * May 7 - John Dixon, 86, Australian cartoonist (Air Hawk and the Flying Doctors), stroke.John Dangar Dixon 1929 - 1915 * May 7 - Maurice Flanagan, 86, British businessman (Emirates).Maurice Flanagan, who helped launch Emirates airline, dies * May 7 - Frank DiPascali, 58, American financier and fraudster, lung cancer.Ex-employee who ratted out Bernie Madoff dies * May 8 - Zeki Alasya, 72, Turkish actor and director (From the Village to the City), liver disease. * May 8 - Atanas Semerdzhiev, 90, Bulgarian politician, Vice President (1990–1992).Bulgaria's Former Vice President Atanas Semerdzhiev Dies at 90 * May 8 - Martin Nag, 88, Norwegian writer, stroke.Nekrolog: Martin Nag * May 8 - Menashe Kadishman, 82, Israeli artist, winner of the Israel Prize (1995).Menashe Kadishman, famed Israeli artist, dies at 82 * May 8 - Phil Skoglund, 77, New Zealand lawn bowls player, triple world champion (1988).Bowls legend Phil Skoglund dies, aged 77 * May 8 - Rutger Gunnarsson, 69, Swedish bassist (ABBA, Elton John).ABBA:s basist Rutger Gunnarsson död (death announced on this date) * May 8 - Joanne Carson, 84, American television talk show host and model.Joanne Carson dies at 84; ex-wife of 'Tonight Show' host * May 8 - Notable people killed in the 2015 Pakistan Army Mil Mi-17 crash:Pakistan helicopter crash kills foreign diplomats **Leif Holger Larsen, 61, Norwegian diplomat, Ambassador to Pakistan (since 2014). **Domingo Lucenario, Jr., 54, Filipino diplomat, Ambassador to Pakistan (since 2013). * May 9 - Lo Wing-lok, 60, Hong Kong politician, member of the Legislative Council for Medical (2000–2004), lung cancer.勞永樂據報今早病逝 終年60歲 * May 9 - Odo Marquard, 87, German philosopher. Universität Gießen trauert um Prof. Odo Marquard * May 9 - Michael MacKellar, 76, Australian politician, MP for Warringah (1969–1994).Fraser govt minister MacKellar dies * May 9 - Igor Gorynin, 89, Russian metallurgist.Телеканал «Санкт-Петербург» * May 9 - Kenan Evren, 97, Turkish military officer, President of Turkey (1980–1989), gastrointestinal hemorrhage.Head of 1980 Turkish coup, Kenan Evren dies * May 9 - Johnny Gimble, 88, American country music fiddler.Legendary fiddler Johnny Gimble dies at 88 * May 9 - Ragne Tangen, 88, Norwegian children's television presenter.Barne-tvs Ragne Tangen er død (death announced on this date) * May 9 - Elizabeth Wilson, 94, American actress (The Birds, The Graduate, 9 to 5), Tony Award winner (1972).Elizabeth Wilson, a Character Actress of Stage, Screen and TV, Dies at 94 * May 10 - Ninad Bedekar, 65, Indian historian and writer.Eminent historian Ninad Bedekar no more * May 10 - Luiz Henrique da Silveira, 75, Brazilian politician, Senator (since 2011), Governor of Santa Catarina (2003–2006, 2007–2010), Minister of Science, Technology and Innovation (1987–1988), heart attack.Senador Luiz Henrique da Silveira morre em Joinville * May 10 - Kim Kyok-sik, 76, North Korean military officer, Defence Minister (2012–13), acute respiratory failure.Kim Kyok-sik, Hard-Line North Korean General, Dies at 77 * May 11 - Jef Geeraerts, 85, Belgian author, heart attack.Schrijver Jef Geeraerts is overleden * May 11 - Stan Cornyn, 81, American record label executive and writer.Stan Cornyn, Legendary Warner Bros. Records Creative Head, Dies At 81 * May 11 - Sir John Watts, 93, Grenadian politician, President of the Senate (1988–1990, 1995–2004).Sir John Watts, KCMG, Passes on * May 12 - William Zinsser, 92, American writer (On Writing Well).William Zinsser, Author of ‘On Writing Well,’ Dies at 92 * May 12 - Suchitra Bhattacharya, 65, Indian novelist, cardiac arrest.Bengali Writer Suchitra Bhattacharya Dies at 65 * May 12 - Bill Guthridge, 77, American college basketball coach (University of North Carolina). * May 12 - Peter Gay, 91, American psychohistorian and writer.Peter Gay, Historian Who Explored Social History of Ideas, Dies at 91 * May 12 - William MacDonald, 90, Australian serial killer, natural causes.The Mutilator: Sydney serial killer William Macdonald dies as NSW's oldest, longest-serving prisoner * May 13 - Derek Davis, 67, Irish broadcaster (Live at 3). * May 13 - Gainan Saidkhuzhin, 77, Russian Soviet Olympic cyclist (1960, 1964), heart attack.Скончался 10-кратный чемпион СССР по велоспорту Гайнан Сайдхужин * May 13 - Anna Levinson, 76, German zoologist.Traueranzeigen * May 14 - Zdzisław Żygulski, Jr., 93, Polish art historian.ZMARŁ PROF. ZDZISŁAW ŻYGULSKI * May 14 - B.B. King, 89, American Hall of Fame blues guitarist, singer and songwriter (\"The Thrill Is Gone\"), complications from Alzheimer's disease. * May 15 - John Stephenson, 91, American actor (The Flintstones, Dragnet), Alzheimer's disease. NEWS - John Stephenson: Death of a Voice Acting Icon * May 15 - Garo Yepremian, 70, American football player (Miami Dolphins), brain cancer.Former Dolphins kicker Garo Yepremian dies at 70 * May 15 - Donald Wrye, 77, American movie director (Ice Castles).Donald Wrye - Director Donald Wrye Dies Aged 77 * May 15 - Jackie Brookner, 69, American artist, cancer.In Memoriam Jackie Brookner (1945-2015) * May 16 - Yeung Kwong, 89, Hong Kong pro-communist activist, heart failure.Veteran unionist Yeung Kwong, ringleader in 1967 Hong Kong riots, dies at 89 * May 16 - Jackie Basehart, 63, American-born Italian actor (The Inglorious Bastards).Jackie Basehart, addio al figlio di Valentina Cortese. Il dolore muto di una madre * May 16 - Dean Potter, 43, American rock climber, BASE-jumping accident.Dean Potter, Extreme Climber, Dies in BASE-Jumping Accident at Yosemite * May 16 - Moshe Levinger, 80, Israeli Orthodox rabbi.Rabbi Moshe Levinger, ideological force behind Jewish settlement in Hebron, dies * May 16 - Flora MacNeil, 86, Scottish Gaelic singer (Mo Run Geal Og).Flora MacNeil, the \"Queen of Gaelic singers\", dies at the age of 86 * May 16 - John Templeton Jr., 75, American physician and philanthropist, brain cancer.Jack Templeton dies at age 75 * May 16 - Elias Gleizer, 81, Brazilian actor, heart failure and bronchopneumonia complicated by a fall.Morre o ator Elias Gleizer, aos 81 anos * May 17 - Chinx, 31, American rapper, shot.Up-and-coming rapper Chinx shot and killed * May 17 - Margaret Dunning, 104, American philanthropist, complications from a fall.Plymouth's Margaret Dunning, 104, dies on California visit * May 17 - Michael Alfred Peszke, 83, Polish-born American psychiatrist and historian.Michael A. Peszke M.D. * May 18 - Raymond Gosling, 88, British scientist.Professor Raymond Gosling * May 18 - Halldór Ásgrímsson, 67, Icelandic politician, Prime Minister (2004–2006), heart attack.Former Prime Minister of Iceland Passes Away * May 18 - Aruna Shanbaug, 66, Indian nurse, comatose rape victim, pneumonia.After 42 years in coma, nurse Aruna Shanbaug dies * May 19 - Happy Rockefeller, 88, American socialite and philanthropist, Second Lady of the United States (1974–1977).Happy Rockefeller, Whose Marriage to Governor Scandalized Voters, Dies at 88 * May 19 - Edmond J. Gong, 84, American politician, member of the Florida House of Representatives (1963–1966) and Senate (1967–1971).Former state senator Edmond Gong dies at 84 * May 19 - Robert S. Wistrich, 70, British-Israeli history professor, heart attack.Robert Wistrich, leading scholar of anti-Semitism, dies of heart attack * May 19 - Ahmad Alasgarov, 79, Azerbaijani footballer and manager.Əhməd Ələsgərov dünyasını dəyişib * May 19 - Burhan Muhammad, 57, Indonesian diplomat, Ambassador to Pakistan (since 2012), burns from helicopter crash.Indonesian Envoy Injured in Naltar Dies * May 19 - Dale D. Myers, 93, American aerospace engineer, Deputy Administrator of NASA (1986–1989).NASA Legend Dale Myers Dies at 93; Helped Save Apollo 13 * May 19 - Gerald Götting, 91, German politician, President of the East German People's Chamber (1969–1976).Langjähriger Chef der DDR-CDU Gerald Götting tot * May 20 - Sudha Shivpuri, 77, Indian actress (Kyunki Saas Bhi Kabhi Bahu Thi), multiple organ failure.'Baa' of 'Kyunki', Sudha Shivpuri, passes away * May 20 - Bob Belden, 58, American musician, heart attack.Jazz suffers two heavy losses * May 21 - Joaquim Durão, 84, Portuguese chess player.Morreu o mestre internacional de xadrez Joaquim Durão * May 21 - Twinkle, 66, British singer-songwriter (\"Terry\"), cancer. * May 21 - Louis Johnson, 60, American bassist (The Brothers Johnson, Michael Jackson). Louis Johnson, Legendary Bassist, Dead at 60 * May 21 - Annarita Sidoti, 44, Italian race walker, world champion (1997), breast cancer.Former Italian race walking world champion Sidoti dies at 44 * May 22 - Marques Haynes, 89, American basketball player (Harlem Globetrotters).Harlem Globetrotter Great Marques Haynes Dies at 89 * May 22 - Aminah Robinson, 75, American artist, heart failure. * May 22 - Terry Sue- Patt, 50, British actor (Grange Hill).Terry Sue-Patt found dead: Grange Hill's Benny Green dies aged 50 (body found on this date) * May 22 - Radomir Naumov, 68, Serbian politician, Minister of Energy and Mining (2004–2007), Minister of Religion (2007–2008).Preminuo Radomir Naumov * May 23 - Aleksey Mozgovoy, 40, Ukrainian pro-Russian separatist.Командир бригады «Призрак» Мозговой убит под Луганском * May 23 - John Forbes Nash, Jr., 86, American Nobel Prize-winning mathematician, car accident.Famed 'A Beautiful Mind' mathematician John Nash, wife killed in taxi crash, police say * May 23 - Anne Meara, 85, American comedian (Stiller and Meara) and actress (Archie Bunker's Place, Sex and the City, Like Mike).Actress, comedian Anne Meara, mom of Ben Stiller, dies at 85 * May 23 - Ali Raymi, 41, Yemeni boxer, bombing. * May 24 - Tanith Lee, 67, British science fiction, horror and fantasy writer (Blake's 7).Tanith Lee Dead: 5 Fast Facts You Need to Know * May 24 - Marcus Belgrave, 78, American jazz trumpeter, heart failure. * May 24 - Bharat Raj Upreti, 63, Nepali judge, justice of the Supreme Court (2009–2013), suicide by hanging. * May 25 - John M. Murphy, 88, American politician, member of the U.S. House of Representatives from New York's 16th (1963–1973) and 17th (1973–1981) districts.John Murphy, Staten Island Congressman Convicted in Abscam Sting, Dies at 88 * May 25 - Mary Ellen Mark, 75, American photographer, myelodysplastic syndrome.Legendary Philadelphia-born photographer Mary Ellen Mark, 75, dies * May 25 - Bill O'Herlihy, 76, Irish sports broadcaster (RTÉ Sport).Broadcasting legend Bill O'Herlihy dies aged 76 * May 26 - Vicente Aranda, 88, Spanish movie director (Amantes).Spanish director Vicente Aranda dies aged 88 * May 26 - Les Johnson, 90, Australian politician, MP for Hughes (1955–1966, 1969–1983).Whitlam minister Les Johnson dies at 90 * May 26 - Dayton Waller, 90, American politician, member of the Louisiana House of Representatives for Shreveport (1968–1972).Dayton Hollis Waller, Jr. * May 26 - Rocky Frisco, 77, American pianist (JJ Cale Band).Tulsa musician Rocky Frisco has died * May 26 - Bob Hornery, 83, Australian stage, movie and television actor (Neighbours, Mad Max Beyond Thunderdome, The Importance of Being Earnest).Performing arts community mourns Neighbours actor and Melbourne Theatre Company actor Bob Hornery * May 26 - Robert Kraft, 87, American astronomer.Robert P. Kraft, eminent astronomer and former director of UC Observatories, dies at age 87 * May 27 - Erik Carlsson, 86, Swedish rally driver.Erik Carlsson \"Carlsson på taket\" är död * May 27 - Nils Christie, 87, Norwegian criminologist.Professor Nils Christie er død * May 28 - Reynaldo Rey, 75, American actor and comedian (227, Friday, White Men Can't Jump), stroke.Rey, ‘Friday’ and ‘White Men Can’t Jump’ Actor, Dies at 75 * May 29 - Betsy Palmer, 88, American actress (I've Got a Secret, Mister Roberts, Friday the 13th). * May 29 - Ed Gilligan, 55, American financial executive, President of American Express (since 2013).American Express president Ed Gilligan dies at 55 * May 29 - Doris Hart, 89, American tennis player. * May 30 - L. Tom Perry, 92, American apostle of The Church of Jesus Christ of Latter-day Saints, thyroid cancer.L. Tom Perry, Mormon apostle, dies at 92 * May 30 - Lennie Merullo, 98, American baseball player (Chicago Cubs).Lennie Merullo Passes Away, Aged 98 * May 30 - Beau Biden, 46, American politician, Attorney General of Delaware (2007–2015), brain cancer. * May 30 - Julie Harris, 94, British costume designer.Designer Julie Harris dies at 94 * May 30 - Tony McNamara, 85, English footballer (Everton, Liverpool).Former Liverpool and Everton player Tony McNamara dies aged 85 * May 31 - Rochelle Shoretz, 42, American civil servant, founder of Sharsheret, complications from breast cancer.Rochelle Shoretz, Founder of Sharsheret and Cancer Advocate, Dies at 42 * May 31 - Karl Wlaschek, 97, Austrian executive, founder of Billa.Unternehmer Karl Wlaschek ist tot * May 31 - Mario Saliwa, 31, South African first-class cricketer.Mario Saliwa dies aged 31 * May 31 - Slim Richey, 77, American guitarist, lymphoma. ==Previous months== * January 2015 * February 2015 * March 2015 * April 2015 ==References== *05",
 "title": "Deaths in May 2015"
}