{
 "id": "50187",
 "text": "David II (5 March 1324 – 22 February 1371) King of Scots, son of King Robert the Bruce by his second wife, Elizabeth de Burgh (d. 1327), was born at Dunfermline Palace, Fife. He was married on 17 July 1328, aged only four, to Joan of the Tower (d. 1362), daughter of Edward II of England and Isabella of France. Joan was only seven years old. At the age of five, David became King of Scotland after the death of his father on 7 June 1329. He was crowned at Scone in November 1331. Edward Balliol, with support from Edward III of England fought against David, so that he could become king. He defeated David at the Battle of Dupplin on 12 August 1332. Balliol was crowned king, and in July 1333, the nine year old David and his queen were sent to France for their safety. In June 1341 he came back and began to rule. In 1346 he invaded England, but was defeated and taken prisoner at the Battle of Neville's Cross on 17 October 1346, and remained in England for eleven years, living mainly in London and at Odiham in Hampshire. In October 1357 he was allowed to go back to Scotland for a payment of 100,000 marks. The money was never paid completely. In 1371 David died in Edinburgh Castle. ==References== * Andrew of Wyntoun, The orygynale cronykil of Scotland, edited by D. Laing (Edinburgh, 1872–1879) * John of Fordun, Chronica gentis Scotorum, edited by W. F. Skene (Edinburgh, 1871–1872) * J. H. Burton, History of Scotland, vol. ii. (Edinburgh, 1905) * Andrew Lang, History of Scotland, vol. i. (Edinburgh, 1900) * ==Further reading== * Michael Brown, The Wars of Scotland, 1214–1371. The New Edinburgh History of Scotland, volume 4. Edinburgh: Edinburgh University Press, 2004. * Ranald Nicholson, Scotland. The Later Middle Ages. Edinburgh: Mercat Press, 1975. * Michael Penman, David II, 1329–71: The Bruce Dynasty in Scotland. East Linton: Tuckwell Press, 2003. Category:1324 births Category:1371 deaths Category:Kings and Queens of Scotland Category:14th century in Scotland",
 "title": "David II of Scotland"
}