{
 "id": "501921",
 "text": "St. Clement Parish is a bilingual Roman Catholic parish community in Ottawa, Canada. It is within the Archdiocese of Ottawa. St. Clement is run by the Priestly Fraternity of Saint Peter. It was the first parish in the world to be authorized to celebrate the Mass and other sacraments in Latin only. This is according to the liturgical norms of the 1962 Roman Missal. These norms were ended in the 1960s. Since June 3, 2012, St. Clement Parish operates out of St. Anne Church in Lowertown. ==History== Before the 1960s, Catholics all over the world prayed together in Latin. In the 1960s, the leaders of the Catholic Church decided that Catholics should pray together using their mother tongue instead of using Latin. Some Catholics still wanted to use Latin when they prayed together. A group of these Catholics were in Ottawa and asked Bishop Joseph-Aurèle Plourde to let them pray together in Latin. He said that they could. The group started to meet together in 1968. When these Catholics started to meet together, they met at Precious Blood Sisters' Monastery. This was a large home for nuns. In 1984, the nuns could not share their home with them anymore. The group moved to a small building and called themselves St. Clement Latin Community. They stayed in the new building until 1993. At that time they were able to get a church building of their own. The new church was on Mann Avenue in the Sandy Hill neighborhood. In 2011, Bishop Terrence Prendergast asked St. Clement Parish if they wanted to move into Ste-Anne Church. Ste-Anne Church was an old church building that was important to the history of Ottawa. The parish started to meet at Ste-Anne Church on June 3, 2012.Phil Gaudreau, St Clement's Parishioners Will Move To Ste-Anne Church, CFRA News, April 23, 2012L'église Sainte-Anne d'Ottawa restera ouverte grâce à de nouveaux fidèles, Radio-Canada, 23 avril 2012 ==Marie Reine du Canada Pilgrimage== The St. Clement Parish also runs an event called Marie Reine du Canada Pilgrimage. During this pilgrimage, people walk 100 km from Saint- Joseph-de-Lanoraie to the church of Notre-Dame du Cap in Trois-Rivières. It is based on a similar pilgrimage from Notre-Dame de Paris to Chartres Cathedral in France. ==References== ==Other websites== *St. Clement parish website *Marie Reine du Canada Pilgrimage Category:Organizations based in Ottawa Category:Religion in Canada",
 "title": "St. Clement Parish (Ottawa)"
}