{
 "id": "502058",
 "text": "Casey Bailey (born October 27, 1991) is an American professional ice hockey center. He currently plays for the ERC Ingolstadt of the Deutsche Eishockey Liga (DEL). He has played for the Toronto Maple Leafs and Ottawa Senators teams in the National Hockey League (NHL). ==Career== Before playing in the NHL, Bailey played parts of 2 seasons with the Alberni Valley Bulldogs of the British Columbia Hockey League (BCHL) and 1 season with the Omaha Lancers of the United States Hockey League (USHL). Bailey decided to play college hockey with the Penn State Nittany Lions. He played parts of 3 years with them and was named to the Big Ten Conference First All-Star Team in 2015. Bailey was not drafted but signed a two-year entry-level contract with the Toronto Maple Leafs on March 21, 2015. The outcome for Bailey and fans was good in this trade. Bailey became the first played from Penn State to sign a contract in the NHL, and also the first to play in the NHL. On April 11, 2015, Bailey scored his first NHL goal against Carey Price of the Montreal Canadiens in a 4-3 shootout loss. On February 9, 2016, Bailey was traded along with Cody Donaghey, Matt Frattin and Ryan Rupert to the Ottawa Senators in exchange for Dion Phaneuf, Milan Michalek, Colin Greening, Tobias Lindberg, Jared Cowen and a second round pick in the 2017 NHL Entry Draft. Bailey would play 7 games with the Senators and mainly spend time with the Binghamton Senators, Ottawa's AHL affiliate. On September 21, 2018, in Russia, he played for HC Slovan Bratislava of the Kontinental Hockey League (KHL). The year before, Casey Bailey (said to be a right-handed player with a good shot) was the second most productive player on the New York Islanders farm, the Bridgeport Sound Tigers team. In that year he scored 41 points. Afterwards he played more in North America in the AHL and back with the Hershey Bears and Charlotte Checkers. He played in the ECHL with the South Carolina Stingrays before returning to Europe. On September 4, 2020, he signed with the Iserlohn Roosters of the Deutsche Eishockey Liga (DEL). On May 22, 2023, he signed with ERC Ingolstadt. ==References== == Other websites == * * Category:1991 births Category:Living people Category:American ice hockey forwards Category:Binghamton Senators players Category:Bridgeport Sound Tigers players Category:Charlotte Checkers (2010–) players Category:Ottawa Senators players Category:Sportspeople from Anchorage, Alaska Category:Toronto Maple Leafs players Category:Toronto Marlies players Category:United States Hockey League players",
 "title": "Casey Bailey"
}