{
 "id": "502213",
 "text": "Russell \"Russi\" Taylor (May 4, 1944 - July 26, 2019) was an American voice actress. She was best known for being the voice of Disney's Minnie Mouse since 1986. She also voiced numerous other Disney characters. Taylor was the wife of the late voice actor Wayne Allwine. He was the third voice of Mickey Mouse from 1991 up until his death in 2009. In 2008, she received a Disney Legends award. She died from colon cancer on July 26, 2019, at her home in Glendale, California, at the age of 75. ==Filmography== ===Film=== Year Film Voice Notes 1980 The Private Eyes Doll 1986 My Little Pony: The Movie Morning Glory, Rosedust, Skunk, Bushwoolie 1986 The Adventures of the American Rabbit Mother, Lamb 1988 Scooby-Doo and the Ghoul School Phantasma 1988 Who Framed Roger Rabbit Minnie Mouse, Birds 1989 The Adventures of Ronald McDonald: McTreasure Island Birdie, Parrot 1990 Jetsons: The Movie Fergie Furbelow 1990 DuckTales the Movie: Treasure of the Lost Lamp Huey, Dewey, Louie, Webby 1990 The Rescuers Down Under Nurse Mouse 1993 Hollyrock-a-Bye Baby Pebbles Flintsone 1994 Pom Poko Otama 1994 A Flintstones Christmas Carol Pebbles Flintsone 1995 Babe Duchess the Cat 1995 The Tale of Tillie's Dragon Pie Lady 1998 The Brave Little Toaster Goes to Mars Robbie 1998 Babe: Pig in the City The Pink Poodle, Choir Cat 2004 Nine Dog Christmas Little Girl, Agnes Anne 2007 Mickey's Great Clubhouse Hunt Minnie Mouse Season 1, episode 15 2007 The Simpsons Movie Martin Prince 2009 Mickey's Adventures in Wonderland Minnie Mouse Season 2, episode 66 2009 Mickey Mouse Clubhouse: Choo-Choo Express Minnie Mouse Season 2, episode 60 2010 Mickey Mouse Clubhouse: Road Rally Minnie Mouse Season 3, episode 77 2011 Mickey Mouse Clubhouse: Space Adventure Minnie Mouse Season 3, episode 78 ===Television=== Year Television Voice Notes 1980 The World of Strawberry Shortcake Strawberry Shortcake 1980–81 The Flintstone Comedy Show Pebbles Flintstone, Cavemouse 1980–81 Heathcliff Barbie Winslow 1981–89 The Smurfs Smoogle 1981 Strawberry Shortcake in Big Apple City Strawberry Shortcake 1982 Strawberry Shortcake: Pets on Parade Strawberry Shortcake 1982 The Little Rascals Dolly 1982 Christmas Comes to Pac-Land Pac-Baby 1982–83 Pac-Man Pac-Baby 1983 Peter and the Magic Egg Lollichop 1983 Strawberry Shortcake: Housewarming Surprise Strawberry Shortcake 1983 Dungeons and Dragons Amber the Fairie Dragon 1984 Strawberry Shortcake and the Baby Without a Name Strawberry Shortcake 1984 Strawberry Shortcake Meets the Berrykins Strawberry Shortcake, Strawberrykin 1984–91 Muppet Babies Gonzo, Camilla, Robin 1985, 1994 ABC Weekend Special Hasy, Leota Episode: \"The Adventures of Teddy Ruxpin\" Episode: \"The Magic Flute\" 1985 Kissyfur Miss Emmy Lou, Beehonie, Toot, Cackle Sister, Donna 1985 Disney's Adventures of the Gummi Bears Madame Placebo 1986 My Little Pony Rosedust, Cupcake, Morning Glory 1986 Glo Friends Glo Cappy 1987 Sport Goofy in Soccermania Huey, Dewey, Louie, Grandma Duck 1987 Blondie and Dagwood Cora Dithers, Mrs. Hannon 1987 D-TV series Minnie Mouse, Dalmatian Puppies 1987–88 Yogi's Treasure Hunt Penelope Pitstop and Candy Girl Episode: \"Snow White & The Seven Treasure Hunters\" Episode: \"The Greed Monster\" 1987–90 DuckTales Huey, Dewey, Louie, Webby 1988 Totally Minnie Minnie Mouse 1988 Superman Lana Lang (young) 1988 Mickey's 60th Birthday Minnie Mouse 1989–90 Dink the Little Dinosaur Squirt 1989 Blondie & Dagwood: Second Wedding Workout Cora Dithers 1989–2019 The Simpsons Lewis, Sherri, Terri, Wendell Borton, Martha Prince, Martin Prince, Uter Zorker, Dr. Hibbert's daughter, Sydney Swift 1990–91 Widget the World Watcher Widget 1990 Cartoon All-Stars to the Rescue Gonzo, Huey, Dewey, and Louie 1990–96 What-A- Mess Esmeralda 1991–93 Mr. Bogus Brattus, Dust Bullies 1992 Capitol Critters Bluebird 1992–94 The Little Mermaid Pearl's Mom 1992–93 Twinkle, the Dream Being Nova 1993–94 Bonkers Missing Toon Kid 1993 The Magic Paintbrush Haley 1994–95 The Critic Penny Tompkins, Effeminate Kid 1994 Aladdin Woman 1995 The Baby Huey Show Momma 1995–99 Timon and Pumbaa Fairy 1995–97 What a Cartoon! Baby, Hard Luck Duck 1995–96 The Hot Rod Dogs and Cool Car Cats Carbs, Jag 1996 Quack Pack Helga Needlehofer Episode: \"Take My Duck, Please\" 1999 The Wild Thornberrys Inga 1999–2000 Mickey Mouse Works Minnie Mouse, Clara Cluck 1999–2000 Tom and Jerry Works Toodles Galore 2000–01 Buzz Lightyear of Star Command Becky, Old Lady 2001–03 Disney's House of Mouse Minnie Mouse, Clara Cluck, Fairy Godmother, Duchess, Fauna, Toothpaste Commercial Boy 2002 Shin Chan Various characters Vitello dub 2003 Kim Possible Rocket Booster #2 2003–04 Clifford's Puppy Days Mrs. Zablione, Tricsie 2003 Pizza Herself 2003–07 Jakers! The Adventures of Piggley Winks Fernando \"Ferny\" Toro, Annie Winks, Mom 2005 Teen Titans Melvin, Timmy 2006–16 Mickey Mouse Clubhouse Minnie Mouse, Quoodles 2011–16 Minnie's Bow-Toons Minnie Mouse 2011–16 Jake and the Never Land Pirates Never Bird, Gilly, Hermit Crab 2012 Sofia the First: Once Upon a Princess Fauna 2013 Sofia the First Fauna, Cedric's Mother, Mrs. Higgins 2013 Wheel of Fortune: Making Disney Memories Week Minnie Mouse 2013–19 Mickey Mouse Minnie Mouse, Huey, Dewey, Louie 2016 The Powerpuff Girls Lava Monster (Uncredited) 2017–19 Mickey and the Roadster Racers Minnie Mouse ===Direct-to-video=== Year Films Voice Notes 1990 Disney Sing-Along Songs: Disneyland Fun Minnie Mouse 1994–95 Mickey's Fun Songs series Minnie Mouse 1998 The Spirit of Mickey Minnie Mouse 1999 Mickey's Once Upon a Christmas Minnie Mouse, Huey, Dewey, Louie 1999 Fantasia 2000 Daisy Duck (Screaming Only) Home Media Release Date: 2000 2001 Mickey's Magical Christmas: Snowed in at the House of Mouse Minnie Mouse 2002 Cinderella II: Dreams Come True Fairy Godmother, Mary, Beatrice, Daphne, Countess Le Grande, Drizella Tremaine 2002 Mickey's House of Villains Minnie Mouse 2004 Mickey, Donald, Goofy: The Three Musketeers Minnie Mouse 2004 Mickey's Twice Upon a Christmas Minnie Mouse, Huey, Dewey, Louie 2006 The Fox and the Hound 2 Widow Tweed 2007 Cinderella III: A Twist in Time Fairy Godmother, Drizella Tremaine 2007 Disney Princess Enchanted Tales: Follow Your Dreams Fauna 2008 Scooby-Doo! and the Goblin King The Owl Witch, Tiddlywink 2015 The Flintstones & WWE: Stone Age SmackDown! Pebbles FlintstoneThe Flintstones & WWE: Stone Age SmackDown! Closing Credits ===Video games=== Year Video Game Voice Notes 1990 DuckTales: The Quest for Gold Huey, Dewey and Louie, Webby Vanderquack 1992 King's Quest VI: Heir Today, Gone Tomorrow Celeste 1996 The Simpsons Cartoon Studio Martin Price 1997 The Simpsons: Virtual Springfield Martin Price 1997 101 Dalmatians Animated StoryBook Lucky, Nanny 1998 My Disney Kitchen Minnie Mouse 2000 Mickey Mouse Preschool Minnie Mouse, Huey, Dewey, Louie 2000 Mickey Mouse Kindergarten Minnie Mouse 2000 Mickey Mouse Toddler Minnie Mouse 2000 The Flintstones: Bedrock Bowling Pebbles Flintstone 2000 Donald Duck Goin' Quackers Heuy, Dewey and Louie 2001 Disney Learning: Phonics Quest Minnie Mouse 2002 Disney Learning Adventure: Search for the Secret Keys Minnie Mouse 2002–12 Kingdom Hearts series Minnie Mouse, Fauna 2002 Disney Golf Minnie Mouse 2002 Disney's PK: Out of the Shadows Huey, Dewey and Louie 2002 Disney Sports Soccer Minnie Mouse, Huey, Dewey, Louie 2002 Disney Sports Skateboarding Minnie Mouse 2002 Disney Sports Football Minnie Mouse, Huey, Dewey, Louie 2002 Disney Sports Basketball Minnie Mouse, Huey, Dewey, Louie 2003 Disney's Party Minnie Mouse 2003 Disney's Hide and Sneak Minnie Mouse 2007 Disney Princess: Enchanted Journey Fairy Godmother, Student Crab 2007 The Simpsons Game Martin Price, Sherri, Terri, Uter Zorker 2008 Disney Think Fast Minnie Mouse 2011 Kinect Disneyland Adventures Minnie Mouse 2013 DuckTales: Remastered Huey, Dewey, Louie and Webby 2013 Castle of Illusion Starring Mickey Mouse Minnie Mouse 2014 Disney Magical World Minnie Mouse 2015 Disney Infinity 3.0 Minnie Mouse ===Park attractions=== * Mickey's PhilharMagic - Minnie Mouse ==Awards== Awards and nominations Year Award Category Title Result 2005 Annie Awards Outstanding Performer in an Animated Program Jakers! The Adventures of Piggley Winks 2006 Emmy Award Outstanding Performer in an Animated Program Jakers! The Adventures of Piggley Winks 2007 Emmy Award Outstanding Performer in an Animated Program Jakers! The Adventures of Piggley Winks 2007 Annie Awards Best Voice Acting in an Animated Television Production Jakers! The Adventures of Piggley Winks 2008 Disney Legend Award Animation (voice) ==References== Category:1944 births Category:2019 deaths Category:American movie actors Category:American television actors Category:American video game actors Category:Deaths from colorectal cancer Category:Cancer deaths in California Category:Actors from Cambridge, Massachusetts Category:American voice actors",
 "title": "Russi Taylor"
}