{
 "id": "502315",
 "text": "Treehouses are platforms or buildings built into a tree. They are constructed around, next to, or in mature trees. They are usually above ground level. Tree houses can be used for recreation, work space or as an observation deck. A tree house can be a peaceful quiet place for seclusion or solitude. ==Practical uses== Treehouses are often built for children to play.John Harris, Treehouses: View from the Top (Guilford, CT: Lyons Press, 2003), p. 6 They are a natural extension of children's love of climbing trees. Treehouses can also be a casual retreat or working space, especially if provided with electricity. In many parts of the world guests can rent a treehouse. They can also stay in a treehouse hotel. Sometimes they are built for protection against wild animals. In some parts of the tropics, houses are either fastened to treesLon Levin, Knack Treehouses (Guilford, CT: Morris Book Publishing, 2010), pp. 132–133 or elevated on stilts.David Clark, Ultimate Treehouses (Philadelphia: Courage Books, 2003), p. 18 This is to keep the living quarters above the ground to protect occupants. A tree house can also be a place to store food from scavenging animals. The Korowai, a Papuan tribe in the southeast of Irian Jaya, live in tree houses.Candida Collins, The Treehouse Book (New York, NY: Skyhorse Publishing, 2009), p. 6 Some are nearly high (see image below). They are used as protection against a tribe of neighbouring head-hunters, the Citak.Head-Hunters Drove Papuan Tribe Into Tree-Houses Tree houses are an option for building eco-friendly houses in remote forest areas. They do not require a clearing of a certain area of forest. Because they are elevated or built into forested areas, they are not desirable to some people. == Gallery == File:DisneylandTarzanTreehouse wb.jpg| File:Bewilderwood.JPG| File:Korowai treehouse.JPG| File:Treehouse access and roundwalk.jpg| File:Treehouse - geograph.org.uk - 153124.jpg| File:BH-Hotel Bergamo Wohnraum II.jpg| == References == ==More reading== * == Other websites == * Amazing Treehouses * Sphere Tree House * Short documentary * Map of tree houses & treehouse hotels from around the world Category:Habitats Category:Woodworking",
 "title": "Treehouse"
}