{
 "id": "502482",
 "text": "Cara Carleton \"Carly\" Fiorina (née Sneed; born September 6, 1954) is an American businesswoman. Fiorina is known for being Chief Executive Officer (CEO) of Hewlett-Packard (HP) and Chair of the philanthropic organization Good360. She ran for the Republican Party's nomination of President of the United States in 2016. In March 2016, Fiorina endorsed Ted Cruz for the nomination. On April 27, 2016, Cruz named Fiorina as his running mate. Cruz dropped out of the race on May 3. On December 19, 2016, after Trump's victory in the election, the Electoral College convened; Fiorina received one electoral vote for Vice President of the United States. As Chief Executive Officer of HP from 1999 to 2005, Fiorina was the first woman to lead a Top-20 company as ranked by Fortune Magazine. In 2002, Fiorina oversaw what was then the largest technology sector merger in history, in which HP acquired rival personal computer manufacturer, Compaq. The transaction made HP the world's largest seller of personal computers. HP subsequently laid off 30,000 U.S. employees in order to save 80,000 jobs. The company then grew to 150,000. In February 2005, she had to resign as CEO and Chair, following a boardroom disagreement. ==Early life== Fiorina was born in Austin, Texas. Her parents were Joseph Tyree Sneed, III and Madelon Montross. She studied at Stanford University, at the University of Maryland, and at the Massachusetts Institute of Technology. Fiorina was raised Episcopalian. ==Career== In 2002, Fiorina undertook the biggest high-tech merger in history with rival computer company Compaq, which made HP the world's largest personal computer manufacturer.Bagley, Constance. Managers and the Legal Environment: Strategies for the 21st Century, p. 599 (Cengage Learning 2015). Fiorina performed unpaid service on the Defense Business Board, which looked at staffing issues, among others, at The Pentagon. Fiorina spent two years leading the Central Intelligence Agency's External Advisory Board, from 2007 to 2009. She became chair of that board, when the board was first created in 2007 by then-CIA director Michael Hayden. After resigning as CEO of HP, Fiorina served on the boards of several organizations and as an advisor to Republican John McCain's 2008 presidential campaign. She won the Republican nomination for the United States Senate from California in 2010. However, she lost the general election to incumbent Democratic Senator Barbara Boxer. == U.S. Senate candidacy for California, 2010 == On November 4, 2009, Fiorina said she wanted to run in the 2010 Senate election. She wanted to remove Democrat Barbara Boxer from her spot as a senator. On June 8, 2010, Fiorina won the Republican primary election for the Senate with over 50 percent of the vote. She beat Tom Campbell and State Assemblyman Chuck DeVore. On November 4, 2010, Boxer won the general election with 52.2% to Fiorina's 42.2%. This was a good margin because a lot of Democrats were showing up to vote, especially in Los Angeles. ==2016 presidential campaign== In May 2015, Fiorina announced she was running for President. She withdrew on February 10, 2016. ==Personal life== Fiorina was married to Todd Bartlem from 1977 until they divorced in 1984.Fiorina, Tough Choices, Ch. 6, Choices of the Heart. She then married Frank Fiorina in 1985. Fiorina has said that she wanted to have children with Frank but \"that wasn't God's plan\".Fiorina, Tough Choices, pp. 88, 93–96, Chapter 12: Confrontation and Understanding. Fiorina was diagnosed with stage II breast cancer in February 2009. She underwent a double mastectomy in March. It was followed by chemotherapy, which got rid of her hair for a while. She also later had radiation therapy. She was said to have a good chance to recover. Fiorina is a Christian who believes that everyone is \"equal in the eyes of God.\" ==References== ==Other websites== *Carly for President - official website *Campaign contributions at OpenSecrets.org Category:2016 United States presidential candidates Category:2016 United States vice-presidential candidates Category:American chief executives Category:Businesspeople from Texas Category:Politicians from Virginia Category:Massachusetts Institute of Technology alumni Category:Politicians from Austin, Texas Category:Republican Party (United States) politicians Category:Stanford University alumni Category:1954 births Category:Living people",
 "title": "Carly Fiorina"
}