{
 "id": "503044",
 "text": "Mark Edward Fischbach (born June 28, 1989), known by his YouTube username Markiplier, is an American internet personality, video game commentator and charity fundraiser. ==Early life== Born in Honolulu, Hawaii, Fischbach began his career in Cincinnati, Ohio. His father, Cliffton M. Fischbach, was of German descent, while his mother is Korean. He studied Civil Engineering at the University of Cincinnati, later changing his degree to Biomedical Engineering. He later left college and started his YouTube career. ==Career== Fischbach moved to Los Angeles, California in 2014, wanting to be closer to the YouTube scene. , his channel has over 9 billion total video views and 22 million subscribers, and is currently the 36th most-subscribed channel on YouTube. Fischbach plays in Let's Play videos, commonly of survival horror video games. In 2017, Fischbach began his first improv tour, known as the \"You're Welcome Tour\", which spanned from North America to Europe and Australia. Fischbach has done multiple charity streams and fundraisers with other YouTubers. Forbes reported in 2017 that Fischbach and his fans had helped raise roughly $3 million for charity in past fundraising streams. In April 2018, he raised $1,506,793.81 in charities. ===Unus Annus=== On November 15, 2019, Fischbach created a new channel with YouTuber Ethan Nestor (known online as CrankGameplays) called Unus Annus, a channel which planned to upload a video every day for one year, after which the channel would be deleted along with its videos. The channel had 1 million subscribers in its first 5 days and 4.56 million in its last few minutes. The channel was deleted on November 14, 2020. The channel was meant to remind viewers about life and death and how quickly both can come and go. ===Podcasts=== Fischbach, along with Wade Barnes (LordMinion777) and Bob Muyskens (Muyskerm) has streamed a podcast on Twitch called 3 Peens in a Podcast since 2018.Bonercast Season 2 Announcement | Drunk Minecraft, Weddings and The Tour muyskerm. November 23, 2018. Retrieved May 17, 2021. In 2019, Fischbach co-produced and starred in Edge of Sleep, an audio drama released on iTunes. In May 2021, Fischbach announced that he, Barnes, and Muyskens would be starting a podcast called Distractible. ===OnlyFans=== Fischbach created an OnlyFans account where any money he would get from subscribers would be split evenly between the Cincinnati Children's Hospital and the World Food Programme. He promised to post \"tasteful nudes\" on his Only Fans account. He officially created the account on December 9, 2022, and the increase of people going to the website caused the site to crash on the same day. ==Philanthropy works== Charity LiveStreams/Videos and Totals Date Charity Total Funds Others With Him July 2012 Child's Play $1,000.00 February 2013 Cancer Research Institute $8,047.00 February 2015 Depression and Bipolar Support Association $82,003.00 February 2017 St. Jude Children's Research Hospital $115,717.00 March 2017 Charity: Water $254,649.00 April 2017 Environmental Defense Fund $123,111.00 May 2017 Game Changer $198,378.00 August 2017 Joyful Heart Foundation $108,585.00 September 2017 Direct Relief $74,421.00 October 2017 National MPS Society $107,878.00 November 2017 Save The Children $422,773.81 == Awards and nominations == Year Nominated Award Result 2016 Streamy Awards Gaming Shorty Awards Tech and Innovation: Gaming Make-A-Wish Foundation Award Ceremony Celebrity of the Year 2017 Golden Joystick Awards Best Streamer/Broadcaster 2018 Kids Choice Awards Favorite Funny YouTube Creator 2020 Streamy Awards Show of the Year (A Heist with Markiplier) Scripted Series (A Heist with Markiplier) Cancer Research Institute Oliver R. Grace Award for Distinguished Service in Advancing Cancer Research 2021 Streamy Awards Best Collaboration (Markiplier and CrankGameplays for Unus Annus) ==References== ==Other websites== * * Category:1989 births Category:Living people Category:American Internet celebrities Category:American YouTubers Category:Entertainers from Hawaii Category:Entertainers from Los Angeles Category:Entertainers from Ohio Category:People from Cincinnati Category:Philanthropists from Ohio Category:Podcasters Category:Twitch (service) streamers",
 "title": "Markiplier"
}