{
 "id": "503010",
 "text": "\"Everybody's Fool\" is the fourth and last single from American rock band Evanescence's first studio album Fallen. The song was released in April 19, 2004. Amy Lee wrote the song in 1999 about the promotion of unrealistic, sexualized images in the industry and the negative influence on the youth. She said it was not about a specific person, and the marketed imagery was deceptive and harmful as \"nobody looks like that ... and it's really hurting a lot of girls' and women's self images.\" \"Everybody's Fool\" peaked at #36 on the Billboard Alternative Songs chart. ==Music video== The music video for \"Everybody's Fool\" was directed by Philipp Stölzl and filmed in Los Angeles, California in 5-7 April 2004. The video features Lee in different characters, including a wholesome teenager, a biker chick, a pop idol, and a glamorous spokesmodel. Talking about the filming, Lee said: \"There's this one scene with everybody on motorbikes that every time I see it I just crack up. It's the slow-mo scene where I take off the helmet and swoosh my hair and look at the camera, and it kills me. It's so hilarious, it's ridiculous. [...] It's a really different thing for us to do because it's not performance at all. Everybody was laughing at me the whole time. I was just like, 'Please don't laugh at me. Just give me five minutes so I can do this. Before the song begins, Lee appears in a TV commercial with blonde hair, a blue blouse, and a long white skirt, and comes out of the kitchen holding a frozen pizza straight from the oven. She introduces the pizza to her family, and as the camera zooms in to show the makeup artists fixing her makeup, the brand name on the pizza box is visible and is called Lies. \"There's nothing better than a good lie,\" says Lee cheerfully with a smile. Scenes where Lee cries in a hotel room and demonstrates his unhappiness as he removes his makeup. These scenes are followed by a scene where Lee appears with \"luxury wigs and dangling diamond earrings.\" He also appears on a motorcycle in an advertisement for the soda brand \"Lies\", which offers the consumer the opportunity to \"be someone\". In a Japanese-style ad with both Japanese and English lyrics, she plays a doll with pink hair in another ad. Every scene ends with Lee crying. During the chorus, two girls in the elevator laugh at the model's appearance, claiming that she looks much older than they thought. In the next scene, she is shown in the bathtub singing a song to herself. Another segment shows him breaking a mirror with his hand due to the immense anguish that begins to bleed uncontrollably. In the final scene, he is standing on the building's balcony crying and screaming as he sees a huge billboard with one of his advertisements saying that \"You're not real so you can't save me\" and that the audience is unaware of how he really lives.The message of the video is in the name of the products her character advertises, \"Lies\". Lee conceptualized the video around the lyrics to the song. She said the video is \"more along the lines of exposing the real behind-the-scenes [lives] of some of these people. It's basically showing the glamorous lifestyle and the depressed, selfish misery behind it.\" She added that the topic was \"like beating a dead horse at this point, but at the time [of writing the song] Britney Spears was just coming out. But I still think it's relevant. Lee said a lot of scenes were cut from the video by music-video stations, including a pill-popping scene, and she was happy that at least \"the blood stayed in\". Joe D'Angelo of MTV News wrote that the video \"comments on the correlation between a phony facade and corroded self-esteem.\" The scenes end with Lee \"contemplating her deeds on the verge of tears\", and she \"realizes that besides the products, her advertisements were also selling negative self-images\". The Montreal Gazette's Jordan Zivitz said it is \"both an effective statement on impossible ideals of beauty (scenes in which the haggard singer rages in a dingy apartment are contrasted with fake commercials in which she's made up to the nines), and a great satire on picture-perfect videos\", while Lee's portrayal has \"a ring of truth to it\" as she \"doesn't have much love for the widely embraced model of human perfection. ==References== ==Other websites== *\"Everybody's Fool\" on YouTube * Category:2004 songs Category:Evanescence songs Category:Diss tracks",
 "title": "Everybody's Fool"
}