{
 "id": "503439",
 "text": "Internet of things is an idea from computer science: connecting ordinary things like lights and doors to a computer network to make them \"intelligent\". An embedded system or a computer connects each thing together in a network and to the internet. Some technologies used for the internet of things are RFID and mesh nets. The connections allow each thing to collect and exchange data, and we can control them remotely or by setting rules or chains of actions. IoT improves the ease of life of humans and their daily activities. Experts estimate that the IoT will consist of almost 50 billion objects by 2020. ==Examples== Examples where the internet of things has become reality: *Many postal companies offer tracking codes that offer customers the ability to check the status of their package in real-time. *Modern printers offer the option to order new ink cartridges when it runs out. The printer can easily query how much ink or toner is left in a cartridge and order a new one once it starts to run out or becomes empty. *Smart doorbells that offer a real-time video feed of your front door to prevent trespassing and provides an extra layer of security for residents when or when they are not at home. *Smart thermometers like Nest, that uses AI to learn your personal habits at home to monitor and control the temperature to make your living as comfortable as possible while also keeping the electricity cost low. *One of the most popular \"Internet of things\" devices known as Amazon Echo is a small device where you are able to interact to help improve your living conditions. It is able to help turn on your coffee machine, play songs, turn on lights, and much more. *Smart home appliances can be managed long distance, allowing you to turn them on and off anywhere. *Motion detection lights can turn on only when they sense someone at the door, reducing the need to have pathway lighting and lights on all night long. *Home security systems can include night vision, motion detection, and loud sirens to help you to get people off your property. == History == M2M, or Machine to Machine communication, was the first iteration of the IoT back in the 1980s. Early traces of this technology are also found in SCADA, (also known as Supervisory Control and Data Acquisition). As technology has continued to develop and new devices emerged, the M2M and SCADA technology gave way to IoT and a new age of data collection and transmission.When Was IoT Created? == Criticism == These ideas have also been criticized. The main points of criticism are the following: * Different people use different words to describe what the thing does. *There are many different kinds of devices, each has its own standard, but making the devices interact with each other or follow a common standard is difficult. * The devices involved are usually simple, and only offer a limited functionality. By design they should be easy to use. Unfortunately, they are often insecure (for example, because there's an easy to guess password for administrating the device) * Very often, there are concerns about privacy: An intelligent light switch that listens to a clap, or to a phrase will put the user under constant surveillance. The user doesn't know what kind of information/data is gathered, and how it is used. * There may be issues with planned obsolescence: A device without a changeable battery will stop operating when the battery is old (and almost empty). Similarly, companies may choose to make a device unusable, by providing a new software, which also disables some of its features. *Because of its use in essential industries like infrastructure and healthcare, there are risks with using an IoT. Hackers may attempt to access the wealth of personal data being shared within the network. In this case, individuals, businesses, and even hospitals could be left vulnerable. ==References== Category:Computing",
 "title": "Internet of things"
}