{
 "id": "50346",
 "text": "This is a list of traditional abbreviations for U.S. states and territories. These abbreviations (short names) were used in mailing addresses before the introduction of two-letter U.S. postal abbreviations. The traditional abbreviations are still commonly used in other ways besides mailing addresses. For example, they can be used in writing after a city (like in \"Miami, Fla.\"). In 1987 the Secretary of Commerce switched to the two-letter State Alpha Code for state abbreviations. ==States== State Traditional abbreviation Other abbreviations Alabama Ala. AL Alaska Alaska AK Arizona Ariz. AZ Arkansas Ark. AR California Calif. CA Colorado Colo. CO Connecticut Conn. CT Delaware Del. DE District of Columbia D.C. DC Florida Fla. FL Georgia Ga. GA Hawaii Hawaii HI Idaho Idaho ID Illinois Ill. IL Indiana Ind. IN Iowa Iowa IA Kansas Kans. KS Kentucky Ky. KY Louisiana La. LA Maine Maine ME Maryland Md. MD Massachusetts Mass. MA Michigan Mich. MI Minnesota Minn. MN Mississippi Miss. MS Missouri Mo. MO Montana Mont. MT Nebraska Nebr. NE Nevada Nev. NV New Hampshire N.H. NH New Jersey N.J. NJ New Mexico N. Mex. NM New York N.Y. NY North Carolina N.C. NC North Dakota N. Dak. ND Ohio Ohio OH Oklahoma Okla. OK Oregon Ore. OR Pennsylvania Pa. PA Rhode Island R.I. RI South Carolina S.C. SC South Dakota S. Dak. SD Tennessee Tenn. TN Texas Tex. TX Utah Utah UT Vermont Vt. VT Virginia Va. VA Washington Wash. WA West Virginia W. Va. WV Wisconsin Wis. WI Wyoming Wyo. WY ==Territories== Territory Traditional abbreviation Other abbreviations American Samoa A.S. Guam Guam GU Northern Mariana Islands M.P. Panama Canal Zone C.Z. Puerto Rico P.R. PUR Virgin Islands V.I. == References == * The Riverside Publishing Company. (1984). Webster's II New Riverside University Dictionary. * Chicago Manual of Style and AP Style Manual state abbreviations * FIPS State Codes of the US and Outlying Areas Traditional abbreviation, List of U.S. states by",
 "title": "List of U.S. states by traditional abbreviation"
}