{
 "id": "503576",
 "text": "Fleet Foxes is an American indie folk band that started in Seattle, Washington.Matson, Andrew \"Seattle's Fleet Foxes poised to sprint with new album\", The Seattle Times, 30 April 2011, accessed 19 June 2011. It is signed to the Sub Pop and Bella Union record labels. The band became well-known in 2008 for their second EP, Sun Giant, and their first album Fleet Foxes. Fleet Foxes' second studio album, Helplessness Blues, was released on 3 May 2011. ==History== ===Formation and early years=== Robin Pecknold and Skyler Skjelset both went to Lake Washington High School in Kirkland, Washington, and became friends. They listened to Bob Dylan and Neil Young and began making music together. First they took the name \"The Pineapples\", but another band in the area had the same name. Pecknold then decided upon \"Fleet Foxes\". Pecknold became the principal songwriter, both singing and playing guitar, while Skjelset played lead guitar.\"Fleet Foxes Expand Seattle Sound\", Seattle magazine The producer Phil Ek and he helped them record their first demo in 2006, the Fleet Foxes EP. By late 2006, Seattle journalists began to notice the band. They became popular by doing local concerts. They started making their first album in early 2007. They recorded in the studio with producer Ek. They recorded most of their tracks at home because they did not have a lot of money. ===Rise to prominence=== Fleet Foxes became popular through word of mouth exposure. By late 2007, their songs had been played over 250,000 times on their Myspace site. They got a record deal with Sub Pop (a subsidiary record label of Warner Music) on 18 January 2008. Robin's sister, Aja Pecknold, became band manager.\"Interview With Fleet Foxes A&R; Sue Busch\", HitQuarters, 4 May 2009. The band's frontman, Robin Pecknold, says that they got most of their success and popularity from people sharing their music illegally online. The band recorded their second EP, Sun Giant, at Bear Creek Studio and performed overdubs and mixed at Seattle's Avast! Recording Co. Fleet Foxes began a tour with the band Blitzen Trapper on 28 February 2008. The band's performances, first at the SXSW festival in March 2008, and then the Sasquatch! festival in May 2008, got them the most attention from the public. Sun Giant was released internationally on 8 April 2008. It was well received by the press. After this, Christian Wargo joined the band on guitar and J. Tillman joined the band on drums. Their first full length album, Fleet Foxes, was released on 3 June 2008. The album achieved similar critical success as the previous EP. On 24 June 2008, Fleet Foxes went to No. 1 on the College Music Journal Radio 200 Chart. In Europe, Fleet Foxes sold over 200,000 copies in the five months following its release. The album received good reviews from critics. In Australia, New Zealand, and the United Kingdom, tickets for their concerts sold out.Sauma, Luiza (7 December 2008). \"Fleet Foxes: Are a hairy bunch of young folk-rockers inventing a new sound of Seattle?\", The Independent. Retrieved on 19 January 2009. By the end of 2008, it had sold over 408,000 copies in North America and over 100,000 copies in the United Kingdom.Paine, Andre (23 December 2008). \"Fleet Foxes Go Gold In United Kingdom\". Billboard. Retrieved on 29 January 2009. They went on a worldwide tour in 2008 and 2009. ===Second album=== The band started practicing their new songs in February 2009. Recording did not start until April 2010. Many of the vocal tracks were recorded in one take. The album, Helplessness Blues, was released on 3 May 2011. The cover was illustrated by the Seattle artist Toby Liebowitz and painted by Christopher Alderson. The album features new band member Morgan Henderson on upright bass and woodwind instruments.Hay, Travis \"Fleet Foxes add a Blood Brother for sixth member\" Guerilla Candy, 17 April 2011 On 18 January 2012, drummer J. Tillman announced that he had left the band.Pelly, Jenn \"J. Tillman Leaves Fleet Foxes, Other Members Form New Band Poor Moon\" Pitchfork, 19 January 2012 Helplessness Blues was nominated for Best Folk Album at the 2012 Grammy Awards, on 12 February 2012. The band went on hiatus from 2013 to 2016. ==Third album== On May 18, 2016, Robin Pecknold said on his Instagram account that Fleet Foxes were working on new music. Their third album, called Crack-Up, was released on June 16, 2017. It was released on Nonesuch Records, a new label for the band. They started playing concerts again on May 15, 2017. ==Members== *Robin Pecknold - lead vocals, guitar (2006–present) *Skyler Skjelset - guitar, mandolin, vocals (2006–present) *Casey Wescott - keyboards, mandolin, vocals (2006–present) *Christian Wargo - bass guitar, guitar, vocals (2008–present) *Morgan Henderson - upright bass, guitar, woodwinds, violin, percussion, saxophone (2010–present) ===Former members=== * Craig Curran - bass guitar (2006-2008) * Nicholas Peterson - drums, percussion, vocals (2006–2008) *Joshua Tillman - drums, percussion, vocals (2008–2012) ==Discography== ===Studio albums=== List of studio albums, with selected chart positions, sales, and certifications Title Album details Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Sales Certifications US AUS Peak chart positions for singles in Australia, Belgium, France, Germany, Netherlands, Norway, and Sweden: * Fleet Foxes: * Helplessness Blues: BEL (FL) CAN FRA GER NLD NOR SWE UK Fleet Foxes * Released: June 3, 2008 * Labels: Bella Union, Sub Pop * Format: CD, CS, LP, digital download 36 90 12 — 78 51 39 14 16 3 *US: 500,000 *UK: 400,000 *BPI: Platinum *RIAA: Gold Helplessness Blues * Released: May 3, 2011 * Labels: Bella Union, Sub Pop * Format: CD, CS, LP, digital download 4 6 2 8 54 11 5 1 3 2 *US: 348,000 *UK: 134,000 *BPI: Gold Crack-Up * Released: June 16, 2017 * Labels: Nonesuch * Format: CD, LP, digital download 9 10 9 16 144 25 11 21 18 Click on \"Veckans albumlista\". 9 *US: 32,000 \"—\" denotes releases that did not chart. ===Extended plays=== List of extended plays, with selected chart positions, sales, and certifications Title EP details Chart peak positions US The Fleet Foxes * Released: September 5, 2006 * Format: CD-R — Sun Giant *Released: April 8, 2008 *Labels: Bella Union, Sub Pop *Formats: CD, CS, LP, digital download 174 The Shrine / An Argument – Live at the BBC *Released: December 13, 2011 *Label: Bella Union *Format: 12-inch vinyl — \"—\" denotes releases that did not chart. ===Singles=== List of singles as lead artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Album US AAA US Rock BEL JPN SCO Peaks in Scotland: * \"White Winter Hymnal\": * \"Mykonos\": * \"Your Protector\": UK UK Indie Peaks on the UK Indie chart: * \"White Winter Hymnal\": * \"Mykonos\": * \"Your Protector\": \"White Winter Hymnal\" 2008 — — 62 — 35 77 4 Fleet Foxes \"He Doesn't Know Why\" — — 74 — — — — \"Mykonos\" 2009 30 — 18 — 12 51 28 Sun Giant (EP) \"Your Protector\" — — — — 31 — 45 Fleet Foxes \"Helplessness Blues\"/\"Grown Ocean\" 2011 — — 63 76 — — — Helplessness Blues \"Battery Kinzie\" — — 75 — — — — \"Lorelai\" — — 68 — — — — \"Third of May / Ōdaigahara\" 2017 26 45 — — — — — Crack-Up \"Fool's Errand\" — — 96 — — — — \"If You Need To, Keep Time on Me\" — — — — — — — ===Music videos=== Year Song 2008 \"White Winter Hymnal\" \"He Doesn't Know Why\" 2009 \"Mykonos\" 2011 \"Grown Ocean\" \"The Shrine / An Argument\" 2017 \"Fool's Errand\" ==References== ==Notes== ==Other websites== *Official band website Category:Indie rock bands Category:Musical groups from Seattle Category:Musical quintets Category:2006 establishments in the United States Category:Musical groups established in 2006 Category:2000s establishments in Washington (state) Category:Musical groups disestablished in 2012 Category:2012 disestablishments in the United States Category:21st-century disestablishments in Washington (state)",
 "title": "Fleet Foxes"
}