{
 "id": "503661",
 "text": "Catholic Christian Outreach Canada (CCO) is a group of Catholics who do missionary work at universities in Canada. They try to teach students three things: * How to have a close friendship with Jesus * How to be good Catholics * How to be leaders and missionaries. == History == André and Angèle Regnier started CCO in 1988 at the University of Saskatchewan. The Regniers were part of an Evangelical Protestant group called Campus Crusade for Christ. They saw that other people in this group were excited about being Christians. They wanted Catholics to be excited about their religion too. They found a group of Catholics called the Catholic Charismatic Renewal who were already trying to do this. This group showed them how to get Catholics to be excited about their religion. The Regniers and their parish priest started CCO so that they could teach university students at the University of Saskatchewan about their religion and how to teach others about it too. === Expansion of CCO === CCO began with only four missionaries at the University of Saskatchewan. As of August 2013, it had more than 70 missionaries at eleven universities. CCO plans to start doing missionary work on 20 new universities between 2008 and 2028. Year University City 1988 University of Saskatchewan Saskatoon, Saskatchewan 1994 University of Regina Regina, Saskatchewan 1997 Carleton University Ottawa, Ontario 1998 Simon Fraser University Vancouver, British Columbia 2000 University of Ottawa Ottawa, Ontario 2003 Douglas College Vancouver, British Columbia 2004 Capilano College Vancouver, British Columbia 2004 Dalhousie University Halifax, Nova Scotia 2007 Queen's University Kingston, Ontario 2008 University of British Columbia Vancouver, British Columbia 2009 Laval University Quebec City, Quebec 2010 University of Calgary Calgary, Alberta 2010 Saint Mary's University Halifax, Nova Scotia 2013 Ryerson University Toronto, Ontario 2014 University of Victoria Victoria, British Columbia 2014 Mount Royal University Calgary, Alberta 2015 Memorial University St. John's, Newfoundland and Labrador 2016 Concordia University Montreal, Quebec 2017 University of Winnipeg Winnipeg, Manitoba 2018 Trent University Peterborough, Ontario CCO does not work at these universities any more. == Rise Up == CCO runs a conference called \"Rise Up\" every year. It is one of the largest conferences for young Catholics in Canada. The largest Rise Up was in Ottawa in 2013. There were 850 people there. The conference happens every year from December 28 to January 1. At Rise Up, there are presentations, workshops, songs, prayers in front of the Eucharist, confession, and a big dinner and dance on New Year's Eve. CCO runs Rise Up because they want people to become closer to Jesus. They also want to help people become excited about telling other people about their religion. == Mission Projects == CCO runs many missions. Some of them are in Canada and some of them are in other countries. CCO often sends students and missionaries to World Youth Day. === IMPACT Canada === There is a mission that happens every year called IMPACT. Students from across Canada go to one city for a summer of missionary work. They live together and work in teams at various parishes, where they lead faith studies and run retreats and special events. IMPACT also has a weekly event called Cornerstone that involves skits, songs, testimonies, and Catholic teaching, a Courageous Catholic program that teaches people how to share their faith, and a monthly Summit event involving songs, prayers in front of the Eucharist, and confession. IMPACT has happened in the following Year City 2002 Ottawa, Ontario 2004 Halifax, Nova Scotia 2007 Vancouver, British Columbia 2009 Saskatoon, Saskatchewan 2010 Calgary, Alberta 2011 Ottawa, Ontario 2012 Halifax, Nova Scotia 2014 Victoria, British Columbia 2015 Vancouver, British Columbia 2018 Vancouver, British Columbia == Methods and Materials == Students involved with CCO lead and attend weekly faith studies at the university. These faith studies help students learn more about their religion and how they can live it out. The studies are based on the Bible, the Catechism of the Catholic Church, and other Christian writings. They also use many analogies, a way of explaining things simply. There are five studies called Discovery, Source, Growth, Obedience, and Commission. CCO wrote a small book The Ultimate Relationship to teach people the basic parts of the Christian religion. == References == == Other websites == * Official website Category:1988 establishments in Canada Category:Roman Catholicism Category:Religious organizations based in Canada",
 "title": "Catholic Christian Outreach"
}