{
 "id": "503849",
 "text": "In geometry, an Archimedean solid is a convex shape which is composed of polygons. It is a polyhedron, with the following properties: * Each face is made of a regular polygon * All the corners of the shape look the same * The shape is neither a platonic solid, nor a prism, nor an antiprism. Depending on the way there are counted, there are thirteen or fifteen such shapes. Of two of these shapes, there are two versions, which cannot be made congruent using rotation. The Archimedean solids are named after the Ancient Greek mathematician Archimedes, who probably discovered them in the 3rd century BC. The writings of Archimedes have been lost, but Pappus of Alexandria summarized them in the 4th century.Grünbaum, Branko 2009. An enduring error. Elemente der Mathematik 64 (3): 89–101. Reprinted in Pitici, Mircea, ed. 2011. The best writing on mathematics, 2010. Princeton University Press, pp. 18–31. During the Renaissance, artists and mathematicians valued pure forms and rediscovered all of these forms. Johannes Kepler probably completed this search around 1620.Field J. 1997. Rediscovering the Archimedean Polyhedra: Piero della Francesca, Luca Pacioli, Leonardo da Vinci, Albrecht Dürer, Daniele Barbaro, and Johannes Kepler. Archive for History of Exact Sciences. 50, 227. Constructing an Archimedean solid takes at least two different polygons. == Properties == * Archimedean solids are made of regular polygons, therefore all edges have the same length. * All Archimedean solids can be produced from Platonic solids, by \"cutting the edges\" of the platonic solid. * The type of polygons meting at a corner (\"vertex\") characterizes both the archimedean and platonic solid == Relationship with Platonic solids == Platonic solids can be turned into Archimedean solids by following a series of rules for their construction. == Listing of Archimedean solids == The following is a listing of all Archimedean solids Image Name Faces Type Edges Vertices Truncated tetrahedron 8 4 triangles 4 hexagons 18 12 Cuboctahedron 14 8 triangles 6 squares 24 12 Truncated cube 14 8 triangles 6 octagons 36 24 Truncated octahedron 14 6 squares 8 hexagons 36 24 Rhombicuboctahedron 26 8 triangles 18 squares 48 24 Truncated cuboctahedron 26 12 squares 8 hexagons 6 octagons 72 48 Snub cube (2 mirrored versions) 38 32 triangles 6 squares 60 24 Icosidodecahedron 32 20 triangles 12 pentagons 60 30 Truncated dodecahedron 32 20 triangles 12 decagons 90 60 Truncated icosahedron 32 12 pentagons 20 hexagons 90 60 Rhombicosidodecahedron 62 20 triangles 30 squares 12 pentagons 120 60 Truncated icosidodecahedron 62 30 squares 20 hexagons 12 decagons 180 120 Snub dodecahedron (2 mirrored versions) 92 80 triangles 12 pentagons 150 60 == References == Category:Archimedes",
 "title": "Archimedean solid"
}