{
 "id": "503899",
 "text": "Philatelic International (Filintern) was an international philatelic society of collector-workers in the 1920s to 1940s. == History == The creation of the Filintern was set up at a conference in Moscow in 22 to 30 June 1924. Its formation was greeted by all branches of the All-Russian Society of Philatelists and at the same time by the Soviet Esperantists. At the conference opening, Feodor Chuchin, Commissioner for Philately and Scripophily, declared: A program for the Filintern's central organ was developed that included: * \"propaganda of the international union of philatelist-workers of all nations for the struggle against organised philatelist-dealers\", * \"wide popularisation of ideological philately\", * \"introducing Esperanto into philately and thus the establishment of lively communication between philatelists around the world.\" Filintern facilitates the goals of philatelists, scripophilists and Esperantists. Within Filintern, they could: * collect stamps and paper money, * publish philatelic bulletins, journals and catalogues, * most importantly, conduct foreign exchange. Using philately, scripophily and Esperanto, the Soviet authorities also hoped for promoting communist propaganda among the foreign proletariat. The Philatelic International's organ was the journal . Its Editor was a prominent Russian philatelist L. K. Eichfuss. The first issue of the journal appeared in January 1925. == Related pages == * All-Russian Society of Philatelists * First All- Union Philatelic Exhibition * Leniniana * Organisation of the Commissioner for Philately and Scripophily * Philately * Soviet Philatelic Association * Soviet Philatelist == Notes == == References == == Further reading == * == Other websites == * Category:Philately organizations Category:Esperanto Category:Philately of the Soviet Union Category:1924 establishments Category:International organizations Category:1920s establishments in the Soviet Union Category:1940s disestablishments Category:Disestablishments in the Soviet Union Category:Organizations based in the Soviet Union",
 "title": "Philatelic International"
}