{
 "id": "504033",
 "text": "The National School Lunch Program (NSLP) is a government-funded program that helps provide free and reduced-price lunches to students in American schools. == History == The National School Lunch Program was created to fight hunger and bad nutrition that existed during World War I.Janet Poppendieck, Free For All: Fixing School Food in America (Berkeley: University of California Press, 2010). One-third of the young men called to be soldiers in World War I were turned down from service. This was due to poor nutrition-related problems such as being underweight.Susan Levine, School Lunch Politics: The Surprising History of America’s Favorite Welfare Program (Princeton: Princeton University Press, 2008) After the war, teachers, parents, doctors, and scientists began to fight poor nutrition in children. ‘Hot Lunch Clubs’ opened up all over the country to give healthy meals to schoolchildren. This program started as a volunteer-run school lunch program in the 1920s. However, in the 1930s, this program received public support and some state funding. During the Great Depression, many farmers were paid record low prices for their food. This was because there was more farm-grown food than people needed. The United States Department of Agriculture (USDA) tried to solve the problem by giving the extra food to schools. The USDA was allowed to use government money to buy extra food and give it to the schools. In order to receive the food donations, school lunch programs had to run on a non-profit basis. This meant that the meals needed to be served to poor students at free or reduced rates. School cafeterias began to pop up around the country. Both the schools and the USDA began to depend on the relationship. As World War II began, the government wanted to focus on good health so that the soldiers would be ready for war. Government officials asked health professionals to create standards (rules) for the amount of vitamins, calories and other things needed to stay healthy. These became known as the Recommended Daily Allowances (RDAs). School lunch programs had to use the standards when planning their menus. In 1946, President Truman signed the law that would provide long-term funding to the National School Lunch Program. The USDA continued to manage the school lunch program. == Budget and funding == Today the National School Lunch Program serves more than 31 billion meals a day. In 2012 this equaled more than $11 billion dollars spent on the program. Additionally, more than 100,000 schools participated in the program nationwide in 2012. Although the National School Lunch Program (NSLP) is federally funded, it is managed at the state level. In order to receive money, schools in the program must serve meals that meet the federal nutrition standards.Fact Sheet: National School Lunch Program. US Department of Agriculture, Food and Nutrition Service. Accessed on February 6, 2014. http://www.fns.usda.gov/cnd/lunch/AboutLunch/NSLPFactSheet.pdf. The amount of money the school gets depends on the number of meals served. Students can buy lunch at three cost levels—free, reduced-price, or paid lunch. The amount the student pays for lunch depends on the family income. The amount of money that the school receives depends on how closely they follow the federal nutrition standards. Meal planning is done by each school district, which are also called “School Food Authorities” (SFAs).Fact Sheet: USDA Commodity Foods in School Lunch, School Food FOCUS, Accessed on February 24, 2014, www.schoolfoodfocus.org The SFAs decide what food to buy, and how to create a menu that meets the NSLP nutrition standards. == Healthy Hunger-Free Kids Act & Nutrition Standards == In 2010 Congress passed the Healthy, Hunger- Free Kids Act, which was the first update to the nutrition standards in schools since 1995.Fact Sheet: The School Day Just Got Healthier. US Department of Agriculture, Food and Nutrition Service. Accessed on February 13, 2014, http://www.fns.usda.gov/healthierschoolday It helped create new nutritional rules for the National School Lunch Program. These changes were to start in schools beginning in the 2012-2013 school year.Carmen J. Byker, Courtney A. Pinard, Amy L. Yaroch, and Elena L. Serrano, “New NSLP Guidelines: Challenges and Opportunities for Nutrition Education Practitioners and Researchers, Journal of Nutrition Education and Behavior 45 no. 6 (2013). Accessed on March 4, 2014 Meal planning is left up to each school—but in order to receive federal money participating schools must follow the nutritional standards. The new standards in the HHFKA created the most strict standards for child nutrition programs in over 30 years.US Department of Agriculture, Food and Nutrition Service, “Healthy Hunger Free Kids Act of 2010,” Last modified August 8, 2013, http://www.fns.usda.gov/cnd/Governance/Legislation/CNR_2010.htm New HHFKA Nutrition Standards Old Nutrition Standards Sets a maximum calorie requirement per meal Only had a minimum calorie requirement Every meal must offer 5 parts: Fruits, Vegetables, Grains, Meat/Meat Alternative, and Milk Fruits and vegetables were one category Every student must take at least ½ cup of fruits or veggies as part of their meal No requirement that students take a fruit or vegetable Sets maximums for meat/meat alternatives *Postponed until 2014-2015 school year No maximums Requires that at least 50% of grains served be “whole- grain rich” No requirement for whole grains Milk must be either: unflavored 1% low-fat; or fat-free skim, flavored or unflavored No limits on fat content of milk, and no rules about the flavor of milk Severely lowered sodium and banned trans fats (except when naturally occurring in meat) No salt or trans fat requirements Byker, Carmen J., Courtney A. Pinard, Amy L. Yaroch, and Elena L. Serrano. “New NSLP Guidelines: Challenges and Opportunities for Nutrition Education Practitioners and Researchers. Journal of Nutrition Education and Behavior 45 no. 6 (2013). Accessed on March 4, 2014New Meal Pattern Requirements and Nutrition Standards. Online Presentation. US Department of Agriculture, Food and Nutrition Service. Accessed on March 4, 2014, http://www.fns.usda.gov/cnd/Governance/Legislation/LAC_03-06-12.pdf Melissa A. Rothstein, Salad Bars in the National School Lunch Program, Memo Code: SP 31-2013, released March 27, 2013 on behalf of the US Department of Agriculture, Food and Nutrition Service, Accessed March 6, 2014. http://www.fns.usda.gov/cnd/Governance/Policy-Memos/2013/SP31-2013os.pdf == References == Category:Education in the United States Category:1946 establishments in the United States",
 "title": "National School Lunch Program"
}