{
 "id": "50412",
 "text": "The Second War of Scottish Independence began in 1333 when Edward III of England did not accept the 1328 Treaty of Northampton any more, under which England recognised the legitimacy of the dynasty established by Robert Bruce. Edward was determined to support the claim of Edward Balliol, the son of the former king, John Balliol, over David II, Bruce's son and heir. Balliol had ruled in Scotland for a short time in the autumn of 1332, but was thrown out of the country later in the year. The war itself lasted until 1357, when David II was released from English captivity. English involvement in Scotland was also one of the factors that lead to the outbreak of the Hundred Years' War with France in 1337. ==Related pages== *Wars of Scottish Independence *First War of Scottish Independence ==References== PRIMARY * Anonimalle Chronicle, 1333-81, ed. V. H. Galbraith, 1927. * Bower, Walter, Scotichronicon, ed. D. E. R. Watt, 1987-96. * Brut, or the Chronicles of England, ed. F. W. D. Brie, 1906. * Capgrave, John, The Book of the Illustrious Henries, ed. F. Hingeston, 1858. * Calendar of Documents Relating to Scotland, ed. J. Bain, 1857. * Fordun, John, Chronicles of the Scottish Nation, ed. W. F. Skene, 1872. * Gray, Thomas, Scalicronica, ed. H. Maxwell, 1913. * The Lanercost Chronicle, ed. H. Maxwell, 1913. * Wyntoun, Andrew, The Original Chronicle of Scotland, ed. F. J. Amours, 1907. SECONDARY * Balfour-Melville, E. W. M, Edward III and David II, 1954. * Campbell, T., England, Scotland and the Hundred Years War, in Europe in the Late Middle Ages, ed. J. Hale et al., 1970. * Duncan, A. A. M., Honi soit qui mal y pense: David II and Edward III, in the Scottish Historical Review, vol. 67, 1988. * Nicholson, R., Edward III and the Scots, 1965. * Nicholson, R., Scotland: the Later Middle Ages, 1974. * Brown, C.K., \"The Second Scottish War of Independence\", 2001 * Paterson, R. C., Edward Balliol, in Military History, April 2003. * Reid, R. C., Edward de Balliol, in Transactions of the Dumfriesshire and Galloway Antiquarian and Natural History Society, vol. 35 1956-7. Category:Wars of independence Category:History of the British Isles Category:Wars involving England Category:14th century in Scotland",
 "title": "Second War of Scottish Independence"
}