{
 "id": "504322",
 "text": "The striped hyaena (Hyaena hyaena) is a widespread small carnivore. It is native to North and East Africa, the Middle East, the Caucasus, Central Asia and the Indian subcontinent. It is listed by the IUCN as near threatened, and the global population may be under 10,000 mature individuals. It is persecuted, and its prey base is declining. It is the smallest of its genus and has many primitive viverrid characteristics which are lost in the larger species.Kurtén, Björn 1968. Pleistocene mammals of Europe. London: Weidenfeld and Nicolson, 66–68. For example, it has a smaller and less specialised skull.Rosevear, Donovan Reginald 1974. The carnivores of West Africa. London: British Museum (Natural History), p348. Heptner V.G. & Sludskii A.A. 1992. Mammals of the Soviet Union: Carnivora (hyaenas and cats). vol 2, Smithsonian Institution Libraries and National Science Foundation, p16. It is mainly a scavenger, but large individuals may kill their own prey.Mills, Gus & Hofer, Heribert 1998. Hyaenas: status survey and conservation action plan. IUCN/SSC Hyaena Specialist Group, p22. Attacks on humans are rare, but do happen. The striped hyena is a monogamous animal, with both males and females assisting one another in raising their cubs. A nocturnal animal, the striped hyena only comes out in complete darkness, and is quick to return to its lair before sunrise. It has a habit of feigning death when attacked. boars, tortoises, Mongolian wild ass, porcupines, It has also been known to stand its ground against larger predators such as leopards in disputes over food.Pocock R. I. 1941. Fauna of British India: Mammals. vol 2, London: Taylor and Francis, p72. The striped hyaena features prominently in Middle Eastern and Asian folklore. It is mentioned in the Hebrew Bible, where it is referred to as tzebua or zevoa, though the species is absent in some English translations.Bright, Michael 2006. Beasts of the Field: the revealing natural history of animals in the Bible, 127–129. == References == Category:Hyaenas Category:Mammals of Asia Category:Mammals of Africa",
 "title": "Striped hyaena"
}