{
 "id": "504319",
 "text": "An arch bridge is a bridge with abutments at each end shaped as a curved arch. Arch bridges work by transferring the weight of the bridge and its loads partially into a horizontal thrust held by the abutments at either side. A viaduct (long bridge) may be made from a long arcade of arches. However other less expensive structures are typically used today. == History == The oldest existing arch bridge may be the Mycenaean Arkadiko bridge in Greece. It was built in about 1300 BC. The stone corbel arch bridge is still used. The well- preserved Hellenistic Eleutherna Bridge has a triangular corbel arch.Nakassis, Athanassios (2000): \"The Bridges of Ancient Eleutherna\", The Annual of the British School at Athens, Vol. 95, pp. 353–365 The 4th century BC Rhodes Footbridge rests on an early voussoir arch.; Both the Etruscans and ancient Greeks knew about arches. But the Romans were the first to use arches for bridge construction.Robertson, D.S.: Greek and Roman Architecture, 2nd edn., Cambridge 1943, p.231 Roman arch bridges were usually semicircular. A number were also segmental arch bridges (such as Alconétar Bridge), meaning it has a curved arch that is less than a semicircle. Such a segmental arch bridge allowed great amounts of flood water to pass under it.Temple, Robert. The Genius of China: 3,000 Years of Science, Discovery, and Invention. New York: Touchstone, 1986. This would prevent the bridge from being swept away during floods. Also the bridge itself could be more lightweight. Generally, Roman bridges had wedge-shaped primary arch stones (called voussoirs) of the same in size and shape. The Romans built both single spans and lengthy multiple arch aqueducts. Their bridges featured flood openings in the piers. In medieval Europe, bridge builders improved on the Roman structures by using narrower piers. They used thinner arch barrels and lower span-rise ratios on bridges. Gothic pointed arches were also introduced reducing lateral thrust. In particular the 14th century saw bridge construction reaching new heights. Spans of up to were previously unheard of in masonry arch construction. In the 19th century steel became cheaper and allowed even longer bridges. Tied arch bridges became commonplace because they don't need such large, expensive foundations. Some in the late 20th century were made over . == Simple compression arch bridges == === Advantages of simple materials === Stone, brick and other similar materials are strong in compression. They are fairly strong in shear. But they cannot resist much force in tension. As a result, masonry arch bridges are designed to be constantly under compression. Each arch is constructed over a temporary falsework frame, known as a centring. In the first compression arch bridges, a keystone in the middle of the bridge bore the weight of the rest of the bridge. The more weight that was put onto the bridge, the stronger its structure became. Masonry arch bridges use fill material (typically compacted rubble) above the arch in order to increase this dead-weight on the bridge. This also prevents tension from occurring in the arch ring as loads move across the bridge. Unreinforced concrete was also used. When masonry (cut stone) is used, the angles of the faces are cut to minimize shear forces. Where random masonry (uncut and unprepared stones) is used they are mortared together. The mortar is allowed to set before the falsework is removed. ===Construction sequence=== * Where the arches are placed in a watercourse bed (on piers or banks) the water is diverted. This is so the gravel can first be excavated and replaced with a good footing (of strong material). From these, the foundation piers are erected or raised to the height of the intended base of the arches. This is a point known as the springing. * Falsework centering (in British English: arch frame) is built, typically from lumber. Each arch of a multi-arch bridge will create a thrust upon the arches next to it. For that reason it is necessary either that all arches of the bridge be raised at the same time, or that very wide piers be used. The thrust from the end arches is taken into the earth by substantial (vertical) footings at the canyon walls. * The several arches are (or single arch is) constructed over the centering. Once each basic arch barrel is constructed. The arches are (or arch is) stabilized with infilled masonry. These may be laid in horizontal running bond courses (layers). They may form two outer walls, known as the spandrels, which are then infilled with appropriate loose material and rubble. * The road is paved and parapet walls direct traffic to the bridge. Arch bridges are one of the oldest types of bridges and have been aroundd for thousands of years. Arch bridges have great natural strength. They were originally built of stone or brick but these days are built of reinforced concrete or steel. The introduction of these new materials allow arch bridges to be longer with lower spans. Instead of pushing straight down, the load of an arch bridge is carried outward along the curve of the arch to the supports at each end. The weight is transferred to the supports at either end. These supports, called the abutments, carry the load and keep the ends of the bridge from spreading out. ==Gallery== File:Puente del Diablo, Martorell, Catalonia, Spain. Pic 01.jpg|Pointed arch of the Puente del Diablo in Spain File:Ponte Vecchio august 2006.JPG|Ponte Vecchio, a medieval shop bridge File:KraemerbrueckeOben.jpg|Late medieval Krämerbrücke supporting two rows of houses File:Ponte Santa Trinita a Firenze.jpg|Ponte Santa Trinita. First bridge with elliptic arches File:Gaoliang_Bridge.JPG|A masonry Chinese moon bridge showing the buttressing approach ramps that take the horizontal thrust of the arch File:Fredrikstad BridgeacrossGlomma01.JPG|Fredrikstad bridge in Fredrikstad, Norway |Bridgeport Lamp Chimney Company Bowstring Concrete Arch Bridge located in Bridgeport, West Virginia File:Main Street Bridge at night (Columbus, OH).JPG|The Main Street Bridge in Columbus, OH is the only inclined-arch suspension bridge in North America. File:Chaotianmen Yangtze River Bridge.JPG| The Chaotianmen Bridge in Chongqing, China, is the world's longest arch bridge. File:Το Γεφύρι της Άρτας.JPG|Bridge of Arta in Arta, Greece File:Feccia Culvert 2011 SE.jpg|By US legal standardsQuestions and Answers on National Bridge Inspection Standards, FHWA, \"What is a bridge?\", June 21, 2005. this Italian culvert is an arch bridge File:Garabit.jpg|The Garabit Viaduct is a wrought iron truss arch bridge. == References ==",
 "title": "Arch bridge"
}