{
 "id": "504441",
 "text": "Winter's Tale is a 2014 supernatural fantasy, mystery and romantic drama movie. It was based on a 1983 novel with the same name. Jennifer Connelly plays Virginia. Eva Marie Saint plays Willa Penn. Russell Crowe plays Pearly. ==Cast== * Colin Farrell as Peter Lake * Jessica Brown Findlay as Beverly Penn * Jennifer Connelly as Virginia Gamely * Russell Crowe as Pearly Soames * William Hurt as Isaac Penn * Mckayla Twiggs as Young Willa Penn * Eva Marie Saint as Adult Willa Penn * Will Smith as Judge / Lucifer * Ripley Sobo as Abby * Matt Bomer as Peter's father * Lucy Griffiths as Peter's mother * Finn Wittrock as Gabriel * Listo as The Horse * Kevin Corrigan as Romeo Tan * Kevin Durand as Cesar Tan * Graham Greene as Humpstone John ==Production== ===Development=== Initially Warner Bros. attempted to sign Martin Scorsese in 2002. He turned down the chance to direct the movie, calling it \"unfilmable\". Later on, the movie became a \"passion project\" for director Akiva Goldsman. He was given the go-ahead by Warner Bros. in February 2011 with a budget of $75 million. The budget was later dropped to $60 million in February of 2012. Will Smith and Russell Crowe were linked to the project in supporting roles. ===Filming=== Principal photography began in October 2012, though was delayed due to Hurricane Sandy. Shooting took place at locations across New York City, including Grand Central Terminal, Red Hook, Brooklyn, East Village, Manhattan and Central Park. ==Release== The movie was released on 14 February 2014 in the United States. ===Reception=== It got negative reviews from movie critics. On Rotten Tomatoes, the movie has a rating of 13%. ===Box office=== The movie performed poor in the box office. Its intake was only $12.6 million in the United States. It took in $30 million worldwide. ==References== ==Other websites== * * * * Category:2014 romantic drama movies Category:2014 fantasy movies Category:American romantic drama movies Category:2010s American fantasy movies Category:Movies composed by Hans Zimmer",
 "title": "Winter's Tale"
}