{
 "id": "505166",
 "text": "The following is a list of notable deaths in June 2015. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==June 2015== * June 1 - Shone An, 31, Taiwanese singer (Comic Boyz) and actor, liver cancer.Taiwanese actor Shone An succumbs to cancer * June 1 - Joan Kirner, 76, Australian politician, Premier of Victoria (1990–1992), oesophageal cancer.Joan Kirner: Former Victorian premier dies aged 76 * June 1 - Nobutaka Machimura, 70, Japanese politician, Speaker of the House of Representatives (2014–2015), cerebral infarction.Ex-lower house Speaker Machimura dies at 70 * June 1 - Charles Kennedy, 55, British politician, Leader of the Liberal Democrats (1999–2006), MP (1983–2015), haemorrhage.Charles Kennedy, Aged 55, Dies At Home * June 1 - Jacques Parizeau, 84, Canadian politician, Premier of Quebec (1994–1996).Jacques Parizeau, former Quebec premier, dead at 84 * June 1 - Nicholas Liverpool, 80, Dominican politician, President (2003–2012), heart attack. * June 1 - Jean Ritchie, 92, American folk singer and song collector.Jean Ritchie, Who Revived Appalachian Folk Songs, Dies at 92 * June 1 - Kirill Pokrovsky, 53, Russian composer.Divinity composer Kirill Pokrovsky has died * June 2 - Alberto De Martino, 85, Italian movie director (O.K. Connery, Holocaust 2000, The Pumaman).Addio a Alberto De Martino, regista culto tra peplum e horror * June 2 - Irwin Rose, 88, American biologist, Nobel Prize in Chemistry (2004).Irwin A. Rose, Nobel-Winning Biochemist, Dies at 88 * June 2 - Theo Saat, 87, Dutch Olympic sprinter (1952).Olympier Theo Saat (87) overleden * June 2 - Fernando de Araújo, 52, East Timorese politician, President of the National Parliament (2007-2012), Acting President (2008).Fernando de Araújo (1962-2015) * June 2 - Miguel-Ángel Cárdenas, 80, Colombian-born Dutch artist.Adiós a Miguel Ángel Cárdenas * June 3 - Avi Beker, 64, Israeli academic, secretary-general of the World Jewish Congress (2001–2003), cancer.Avi Beker, former World Jewish Congress secretary-general, dies * June 3 - Margaret Juntwait, 58, American radio host, host of Metropolitan Opera radio broadcasts (since 2014), ovarian cancer.Sadness: Met Radio Host Dies At 58 * June 4 - Kurt Weber, 87, Polish cinematographer (Salto). * June 4 - Bengt Berndtsson, 82, Swedish footballer (IFK Göteborg).Bengt Berndtsson har gått bort – blev 82 år * June 4 - Leonid Plyushch, 77, Ukrainian Soviet dissident and mathematician.Умер правозащитник, советский диссидент Леонид Плющ * June 4 - Hermann Zapf, 96, German typeface designer.Hermann Zapf: 8 November 1918 – 4 June 2015 * June 4 - Albert West, 65, Dutch singer (The Shuffles) and record producer.Albert West overleden * June 5 - Alan Bond, 77, Australian businessman, figure of the WA Inc scandals, complications from heart surgery.Alan Bond Dies in Pert After Heart Surgical Complications * June 5 - Roger Vergé, 85, French chef, co-founder of Nouvelle Cuisine, complications of diabetes.Roger Vergé, a Founder of Nouvelle Cuisine, Dies at 85 * June 5 - Jerry Collins, 34, New Zealand rugby union player (national team), car accident.Jerry Collins and wife die in car crash * June 5 - Jane Briggs Hart, 93, American aviator, member of the Mercury 13, Alzheimer's disease.Jane B. Hart, strong-minded wife of senator, dies at 93 * June 5 - Sadun Boro, 87, Turkish sailor, bladder cancer.First Turk to sail around the world dies at 87 * June 5 - Tariq Aziz, 79, Iraqi politician, Foreign Affairs Minister (1983–1991), heart attack.Iraq's Tariq Aziz 'dies in prison' * June 5 - Giacomo Furia, 90, Italian actor (The Band of Honest Men, The Gold of Naples).Addio a Giacomo Furia, l'ultimo dei grandi caratteristi. Recitò con Totò e la Loren * June 5 - Kazuo Chiba, 75, Japanese Aikido teacher.Birankai North America * June 6 - Pierre Brice, 86, French actor (Old Shatterhand, Mill of the Stone Women), pneumonia.Pierre Brice ist tot Ein Leben als Winnetou * June 6 - Ludvík Vaculík, 88, Czech writer and journalist.Zemřel spisovatel a fejetonista Ludvík Vaculík. Bylo mu 89 let * June 6 - Richard Johnson, 87, English actor (The Amorous Adventures of Moll Flanders, The Boy in the Striped Pyjamas, The Haunting).Actor Richard Johnson dies, aged 87 * June 6 - Ronnie Gilbert, 88, American singer-songwriter (The Weavers) and activist, natural causes.Ronnie Gilbert, Folk Singer for the Weavers, Dies at 88 * June 6 - Aarthi Agarwal, 31, American Telugu cinema actress, cardiac arrest.Telugu Actor Aarthi Agarwal Dies at 31 * June 7 - Vasili Zhupikov, 61, Russian footballer.СКОНЧАЛСЯ Василий Жупиков * June 7 - Sir Christopher Lee, 93, British actor and singer (Dracula, The Lord of the Rings, Star Wars), heart failure.Sir Christopher Lee dies at 93 - latest reaction and tributes * June 8 - Chea Sim, 82, Cambodian politician, president Cambodian People's Party. * June 8 - David Rotem, 66, Israeli politician, Member of the Knesset for Yisrael Beiteinu (2007–2015), cardiac arrest.David Rotem, retired Yisrael Beytenu lawmaker, dies at 66 * June 8 - Frank Cappuccino, 86, American boxing referee, Alzheimer's disease.Frank Cappuccino, legendary boxing referee, dies at 86 * June 9 - James Last, 86, German composer.James Last, German-born composer, dies aged 86 * June 9 - Fred Anton Maier, 76, Norwegian Olympic champion speed skater, cancer.Fred Anton Maier er død * June 9 - Douglas Danforth, 92, American businessman, CEO of the Pittsburgh Pirates.Douglas Danforth, former head of Pittsburgh Pirates and Westinghouse, dies at 92 * June 9 - Pedro Zerolo, 54, Venezuelan-born Spanish politician, pancreatic cancer.Muere Pedro Zerolo * June 10 - Wolfgang Jeschke, 78, German science fiction author (The Last Day of Creation).Wolfgang Jeschke (1936–2015) * June 10 - Robert Chartoff, 81, American movie producer (Rocky, Raging Bull, Ender's Game), Oscar winner (1977), pancreatic cancer.Robert Chartoff, Producer of 'Rocky' and 'Raging Bull,' Dies at 81 * June 11 - Ornette Coleman, 85, American saxophonist and free jazz pioneer, cardiac arrest.Ornette Coleman, Jazz Innovator, Dies at 85 * June 11 - Jack King, 84, American public affairs officer (NASA), congestive heart failure.Jack King, NASA's 'Voice of Apollo,' dies at 84 * June 11 - Ron Moody, 91, British actor (Oliver!, The Animals of Farthing Wood, EastEnders).Oliver! actor Ron Moody dies aged 91 * June 11 - Dusty Rhodes, 69, American professional wrestler (NWA, WCW, WWE), kidney failure. * June 11 - Jim Ed Brown, 81, American country singer (The Browns), cancer.Country singer Jim Ed Brown dies at 81 * June 11 - Sebastiano Mannironi, 84, Italian Olympic weightlifter (1956, 1960, 1964).E' morto il grande Sebastiano Mannironi * June 12 - Monica Lewis, 93, American singer and actress (Earthquake).Monica Lewis obituary * June 12 - Fernando Brant, 68, Brazilian poet and composer, surgical complications.Morre Fernando Brant, escritor e compositor mineiro * June 13 - Magnus Härenstam, 73, Swedish actor (Sällskapsresan, Göta kanal eller Vem drog ur proppen?) and comedian (Fem myror är fler än fyra elefanter), spinal cancer.Magnus Härenstam är död – blev 73 år * June 13 - Sergio Renán, 82, Argentine actor, director and screenwriter (The Truce), pneumonia.'La Tregua' director Sergio Renán dies * June 13 - Drs. P, 95, Dutch singer-writer, composer and poet.Zanger en tekstdichter Drs. P overleden * June 13 - Buddy Boudreaux, 97, American jazz saxophonist and band leader. * June 14 - Hugo Blanco, 74, Venezuelan musician and composer.Falleció el músico y compositor venezolano Hugo Blanco . * June 14 - Anne Nicol Gaylor, 88, American atheism and reproductive rights advocate; co-founder of the Freedom from Religion Foundation, complications from a fall.Anne Nicol Gaylor, prominent feminist and atheist, dies at 88 * June 14 - Zito, 82, Brazilian footballer, World Cup-winning team member (1958, 1962), complications of a stroke.Football - World Cup winner Zito dies * June 14 - Qiao Shi, 90, Chinese politician, Chairman of the National People's Congress.Former China Communist Party senior official Qiao Shi dies at 91 * June 15 - Jean Doré, 70, Canadian politician, Mayor of Montreal (1986–1994), pancreatic cancer.Jean Doré est décédé * June 15 - Blaze Starr, 83, American stripper, burlesque comedienne and club owner, subject of Blaze.Burlesque dancer Blaze Starr dies at 83 * June 15 - Jeanna Friske, 40, Russian singer (Blestyaschie), glioblastoma.Ушла из жизни певица Жанна Фриске * June 15 - Harry Rowohlt, 70, German author.German author and Winnie-the-Pooh translator Harry Rowohlt dies * June 15 - Kirk Kerkorian, 98, American businessman.Las Vegas billionaire Kirk Kerkorian dies: report * June 15 - Mighty Sam McClain, 72, American soul blues singer, stroke.‘Mighty’ Sam McClain, Grammy-nominated blues singer from NH, dies * June 16 - Charles Correa, 84, Indian architect.Architect Charles Correa dies at 84 * June 16 - Tony Ranasinghe, 77, Sri Lankan actor (Hanthane Kathawa, Duhulu Malak, Ahasin Polawata) and writer.Tony Ranasinghe is no more. * June 17 - Süleyman Demirel, 90, Turkish politician, President (1993–2000), lung infection. * June 17 - Ron Clarke, 78, Australian long distance runner, Olympic bronze medalist (1964), Mayor of the Gold Coast, Queensland (2004–2012), kidney failure.Olympian and former Gold Coast mayor Ron Clarke dies * June 17 - Clementa C. Pinckney, 41, American politician and pastor, member of the South Carolina House of Representatives (1997–2000) and Senate (since 2000), shot.SC Senator Clementa Pinckney Among Shooting Victims * June 17 - Nelson Doubleday, Jr., 81, American publisher (Doubleday) and Major League Baseball team owner (New York Mets), pneumonia.Nelson Doubleday Jr., Publisher and Mets Buyer, Dies at 81 * June 17 - Roberto M. Levingston, 95, Argentine politician, President (1970–1971).Murió Roberto Marcelo Levingston * June 17 - John David Crow, 79, American Heisman Trophy-winning football player (Chicago/St. Louis Cardinals) and coach (Northeast Louisiana). * June 17 - Jeralean Talley, 116, American supercentenarian, world's oldest person.World's Oldest Person, Inkster's Jeralean Talley, dies at 116 * June 17 - Nicola Badalucco, 86, Italian screenwriter (The Damned) and journalist.Scomparso lo sceneggiatore e giornalista Nicola Badalucco * June 17 - Chang Ch'ung-ho, 101, Chinese-American poet, calligrapher, and Kunqu opera singer.民国最后一位才女张充和逝世 * June 18 - Phil Austin, 74, American comedian, writer, and musician (Firesign Theatre). * June 18 - Ralph J. Roberts, 95, American businessman, founder of Comcast.Comcast founder Ralph Roberts dies at 95 * June 18 - Jack Rollins, 100, American movie producer (Midnight in Paris, The Purple Rose of Cairo, Irrational Man).Jack Rollins Dies at 100; Produced Comedy Greats Like Woody Allen * June 18 - Allen Weinstein, 77, American historian, Archivist of the United States (2005–2008), pneumonia.Allen Weinstein, provocative historian and former U.S. archivist, dies at 77 * June 18 - Sir Patrick Eisdell Moore, 97, New Zealand surgeon.Death Notice: Sir Patrick Eisdell Moore * June 19 - Harold Battiste, 83, American jazz and R&B; composer, arranger and musician (Sam Cooke, Sonny & Cher, Dr. John).Harold Battiste Passes Away At 83 * June 19 - Fredrik Fasting Torgersen, 80, Norwegian convicted murderer, complications of pneumonia.Fredrik Fasting Torgersen er død * June 19 - Wendell Holmes, 71, American musician (The Holmes Brothers), complications from pulmonary embolism. * June 19 - Jack Aeby, 91, American photographer. * June 19 - James Salter, 90, American novelist.James Salter, a ‘Writer’s Writer’ Short on Sales but Long on Acclaim, Dies at 90 * June 20 - François Delapierre, 44, French politician, brain tumour.Décès de François Delapierre, proche de Mélenchon * June 20 - Elson Floyd, 59, American educator, President of Washington State University (since 2007), complications from colon cancer.Elson Floyd, WSU president, dies at 59 * June 20 - Angelo Niculescu, 93, Romanian football manager.Fotbalul românesc este în doliu » A murit marele Angelo Niculescu! * June 20 - Takanonami Sadahiro, 43, Japanese sumo wrestler and coach, heart failure.元大関貴ノ浪 音羽山親方が死去 * June 20 - Esther Brand, 92, South African athlete, complications of a fall.Death notice of Esther Brand * June 20 - William Brantley Aycock, 99, American educator.Former Chancellor William B. Aycock Dies at 99 * June 21 - Veijo Meri, 86, Finnish author.Finland mourns author Veijo Meri * June 21 - James Carnegie, 3rd Duke of Fife, 85, Scottish nobleman.The Duke of Fife obituary * June 21 - Gunther Schuller, 89, American composer, conductor, historian and jazz musician, leukemia.Gunther Schuller Dies at 89; Composer Synthesized Classical and Jazz * June 21 - Alexander Schalck-Golodkowski, 82, East German politician.Alexander Schalck-Golodkowski ist tot * June 22 - Laura Antonelli, 73, Italian actress (Malicious, Till Marriage Do Us Part, The Innocent), heart attack.Italian actress Laura Antonelli dead * June 22 - Norm Berryman, 42, New Zealand rugby union player (national team), heart attack.Norman Berryman dies of heart attack aged 42 * June 22 - James Horner, 61, American composer (Titanic, Field of Dreams, Apollo 13), Oscar winner (1998), plane crash.James Horner, Film Composer for 'Titanic' and 'Braveheart,' Dies in Plane Crash * June 23 - Helmuth Lohner, 82, Austrian actor and theatre director.Schauspieler Helmuth Lohner gestorben * June 23 - Magali Noël, 84, French actress (La Dolce Vita) and singer (\"Fais-moi mal, Johnny\").Mort de Magali Noël, égérie de Vian et de Fellini * June 23 - Marujita Díaz, 83, Spanish singer and actress (Música y estrellas), complications from colon cancer.Muere Marujita Díaz * June 23 - Dick Van Patten, 86, American actor (Eight is Enough, The Love Boat, Charly), complications from diabetes.Dick Van Patten, Who Starred in Eight Is Enough and The Love Boat, Dies at 86 * June 23 - Harvey Pollack, 93, American sport statistician, last surviving employee in first NBA season.Harvey Pollack, last original employee of NBA's 1st season, dies * June 23 - Sir Chris Woodhead, 68, British educationalist, Chief Inspector for Ofsted (1994–2000), motor neurone disease.Former school inspector Woodhead dies * June 23 - Thé Lau, 62, Dutch singer and guitarist (The Scene), lung cancer.Zanger Thé Lau (62) overleden * June 24 - Walter Browne, 66, Australian-born American chess Grandmaster, six-time U.S. champion.Walter Browne dies in his sleep at 66 * June 24 - Cristiano Araújo, 29, Brazilian singer and songwriter, traffic collision.Cantor Cristiano Araújo morre após acidente de carro em GO, diz hospital * June 24 - Mario Biaggi, 97, American politician, U.S. House of Representatives from New York (1969–1988).Mario Biaggi, 97, Dies; 10-Term Bronx Congressman Who Went to Prison * June 24 - Marva Collins, 78, American educator.Chicago Education Pioneer Marva Collins, 78, dies * June 25 - Patrick Macnee, 93, English-American actor (The Avengers, This Is Spinal Tap, A View to a Kill).Patrick Macnee, actor - obituary * June 26 - Yevgeny Primakov, 85, Russian politician and diplomat, Prime Minister (1998–1999).Yevgeny Primakov, Russian Premier Under Yeltsin, Dies at 85 * June 26 - Richard Matt, 49, American convicted murderer and prison escapee, shot.One of the New York Prison Escapees, Richard Matt, Is Fatally Shot * June 26 - Kája Saudek, 80, Czech comics illustrator.Zemřel kreslíř Kája Saudek * June 27 - Zvi Elpeleg, 89, Polish-born Israeli diplomat and academic. * June 27 - Don McNeill, 80, Canadian journalist (Canadian Broadcasting Corporation, CBS News).N.L. native broke news from around the world * June 27 - Chris Squire, 67, English bass guitarist (Yes), acute erythroid leukemia.Yes Bassist Chris Squire Has Died * June 28 - Jack Carter, 93, American comedian and actor (Viva Las Vegas, Alligator), respiratory failure.Comedian Jack Carter Dies at 93 * June 28 - Todor Slavov, 31, Bulgarian rally driver, rally accident.Rally Driver Dies, Co-Driver Injured after Heavy Crash Near Bulgaria's Tvarditsa * June 28 - Wally Stanowski, 96, Canadian ice hockey player (Toronto Maple Leafs, New York Rangers).Wally Stanowski, last link to Leafs’ 1940s Stanley Cup wins, dies at 96 * June 29 - Charles Pasqua, 88, French politician, Minister of the Interior (1986–1988, 1993–1995).L'ancien ministre gaulliste Charles Pasqua est mort * June 29 - Josef Masopust, 84, Czech football player and manager (Dukla Prague, national team). * June 29 - Jackson Vroman, 34, American-born Lebanese basketball player (Phoenix Suns, New Orleans Hornets). * June 30 - Eddy Louiss, 74, French jazz organist.Mort de l'organiste de jazz Eddy Louiss * June 30 - Leonard Starr, 89, American cartoonist (ThunderCats, Little Orphan Annie).Leonard Starr, R.I.P. ==Previous months== * January 2015 * February 2015 * March 2015 * April 2015 * May 2015 ==References== *06 Category:June 2015 events",
 "title": "Deaths in June 2015"
}