{
 "id": "50515",
 "text": "SWOT Analysis is a tool to find out the Strengths, Weaknesses, Opportunities, and Threats that are to be expected in a project or in a business venture or in something similar. It means that the situation (internal and external to the organization or individual) is looked at. It is one of the best tools to conduct the internal and external analysis for any company. == Internal and external factors == Internal factors may include employment, finance, manufacturing opportunities, and all of the marketing mix's 4Ps. External factors include macroeconomics, technological change, legislation, and sociocultural changes, as well as changes in the marketplace. == Use == SWOT analysis can be used in any decision-making situation. SWOT analysis can be used: * to build organizational or personal strategy; * for matching and converting; * allow organizations to achieve their goals; * as a basis for the analysis of business and environmental factors; * in marketing — analyzing competitors. == In community organizations == The SWOT analysis has been used in community work as a tool to identify positive and negative factors within organizations. Although SWOT analysis is a part of the planning, it will not provide a strategic plan if used by itself, but a SWOT list can becomes a series of recommendations. Strengths and weaknesses (internal factors within an organization): *Human resources — staff, volunteers, board members, target population; *Physical resources — your location, building, equipment; *Financial — grants, funding agencies, other sources of income; *Activities and processes — programs you run, systems you employ; *Past experiences — building blocks for learning and success, your reputation in the community. Opportunities and threats (external factors from community or societal forces): *Future trends in your field or the culture; *The economy — local, national, or international; *Funding sources — foundations, donors, legislatures; *Demographics — changes in the age, race, gender, culture of those you serve or in your area; *The physical environment — is your building in a growing part of town? Is the bus company cutting routes?; *Legislation — do new federal requirements make your job harder...or easier?; *Local, national, or international events. ==References== Category:Management Category:Planning",
 "title": "SWOT Analysis"
}