{
 "id": "505214",
 "text": "Ice fishing is the practice of catching fish through an opening in the ice on a frozen body of water. The methods include fishing with fishing rods, lines and hooks or spears. Ice fishermen may fish in the open or in heated enclosures called ice shacks. == Equipment == Basic ice fishing equipment is fairly simple. A short fishing rod, some bait, hooks and a way to drill or chop a hole in the ice. The right clothing is also important to keep warm on the ice. Or, you could get into highly specialized ice fishing gear. *Ice fishing rods are small light fishing rods designed just for ice fishing. One is type called a jigging rod. They are short and designed for moving the bait up and down in a jigging motion. *Ice augers and drills are for cutting a hole in the ice. A basic ice auger is cranked by hand. A power auger may be gas or battery powered. They are for drilling multiple holes. Fairly new to ice fishing is using a battery-powered drill with an auger attached. An ice chisel may also be used to chop through the ice. *Fishing lures are brightly colored fishing lures designed for jigging vertically. They are specific to the species of fish the fisherman is after. *Bait ranges from wax worms to minnows, from corn (fish will eat corn but can't digest it) to salmon eggs. *Tip-ups are made of wood or plastic. They have a spool of fishing line attached. When a fish takes the bait it trips a small flag to tell the fisherman he has a fish on the line. Fishermen may have several holes each with a tip-up. How many depends on the fishing laws of the state or jurisdiction. *Spear fishing is done with the fisherman, usually from a darkened ice shack or enclosure, watches the water carefully through the hole. When a fish appears a multi-tipped fishing spear is thrown. Then it is retrieved by the attached line, with or without a fish. A decoy is used to attract the fish to the area under the hole. File:Isborr.jpg| File:Angeldon.JPG| File:Mormyschkas.jpg| File:Pilkkitoukat.jpg| File:IceShantiesForSturgeonSpearingLakeWinnebago.jpg| File:Festival de la pêche blanche à Saint-Fulgence2.JPG| == Ice shacks == An important part of ice fishing in the northern parts of North America is the ice shack (ice house, ice shanty, dark house). These are dragged or towed onto the lake using a vehicle such as a snowmobile, ATV or truck. Most portable ice houses which are often made of anything from light tent-like structures to heavy material that designed to shelter fishermen from cold and wind. They can take many different forms. Some are simple structures that are just a place to get in out of the cold. Others are elaborate expensive shelters, warm and safe enough to withstand any weather. They are also loaded with electronics. Modern ice shacks can have equipment like underwater cameras, sonar fish-finders and lake-mapping apps for their smartphones. Some have all the comforts of home such as big-screen TVs, poker tables, king-size beds and stereo systems. They can have refrigerators, fireplaces and bathrooms with hot showers. Many ice fishermen spend weekends in their comfortable ice shack retreats all winter. In the northern parts of North America, ice fishing is often a social activity. Some resorts have fish houses that are rented out by the day; often, shuttle service by Snow Track or other vehicles modified to drive on ice is provided. They can appear to a city on the ice where fishing is best. Some even elect a mayor. Most municipalities have requirements to remove ice houses by a certain date before the ice melts. In Finland, peace and quiet in isolation is often the object of the pastime. In Finland, fish houses are a rare. But wearing a sealed and insulated dry suit designed with space age fabric is not. == References == Category:Fishing Category:Ice sports Category:Survival skills",
 "title": "Ice fishing"
}