{
 "id": "505384",
 "text": "Geraldine Leigh Chaplin (born 31 July 1944) is an American-born British actress. She is the daughter of Charlie Chaplin and Oona O'Neill. She is best known for her 1965 Golden Globe nominated role of Tonya in David Lean's movie, Doctor Zhivago. She received her second Golden Globe nomination for Robert Altman's Nashville in 1975. She also acted in his other movies, Buffalo Bill and the Indians, or Sitting Bull's History Lesson in 1976 and A Wedding in 1978. She received a BAFTA nomination for her role in Welcome to L.A. in 1976. She played her grandmother, Hannah Chaplin in the movie, Chaplin in 1992 and received her third Golden Globe nomination. She has also acted in The Age of Innocence in 1993, Home for the Holidays in 1995, and Jane Eyre in 1996. == Career == When Chaplin was eight years old, she acted in her father's movie Limelight. She studied at the Royal Ballet School, in hopes of becoming a ballet dancer.\"Women In the News\". The New York Times. 25 November 1962. pp. 272 When that did not work out, she became an actress instead. David Lean chose her to play Tonya,\"Geraldine Chaplin to Make American debut in 'Tonia'\". The New York Times. 21 November 1964. pp. 26 the wife of the leading role, in his movie Doctor Zhivago. In an interview about the movie, she said \"Because of my name, the right doors opened.\"Reed, Rex \"If My Name Was Annie Smith\". The New York Times. 10 December 1967. pp. x7. In 1967, she acted in a famous play in the Broadway theatre, Lillian Hellman's The Little Foxes.Zolotow, Sam. \"'Changes coming in \"The Little Foxes\"\". The New York Times. 2 November 1967 Her performance was praised in a review in The New York Times. Cliff Barnes wrote that Chaplin \"acts with spirit and force,\" all the while \"acting with a magnificently raw-voiced sincerity\" in what was a performance of \"surprising power.\"Barnes, Clive. \"Theater: 'The Little Foxes' Revisited\". The New York Times. 6 January 1968. pp. 24 Chaplin has also acted in several Spanish and French films. She received a Goya Award for Best Supporting Actress for her role in a Spanish-Argentine movie, In the City Without Limits in 2001.CINE- PREMIOS GOYA Geraldine Chaplin recibe Goya Mejor Actriz de Reparto. Spanish Newswire Services. 1 February 2003. In 2018, she starred as Iris in Jurassic World: Fallen Kingdom. == Personal life == Geraldine Chaplin was born in Santa Monica, California. She was the fourth child of the movie star Charlie Chaplin. She was the first of his eight children with his fourth and last wife, Oona O'Neill. Her grandfather was the Nobel Prize and Pulitzer Prize winning American playwright Eugene O'Neill. When Geraldine was eight years old, the family moved to Switzerland, where she went to school. This is where she learned to speak both French and Spanish. In 1978 the Chaplin family were the victims of a plot by kidnappers who had stolen the body of Charlie Chaplin for ransom. Geraldine negotiated with the kidnappers, who threatened to shoot her baby son in the knees.Kennedy, Dana. \"Geraldine Chaplin: Living Among Ghosts in the Eye of the Storm\". Associated Press. 20 December 1992 After living in Spain for over 25 years, Chaplin left in 1992 because of personal difficulties. She moved back to her family home in Vevey, Switzerland.Middlehurst, Lester. \"Charlie's Girl, Happy to Trade on Daddy's Name; as Geraldine Goes Home, New Life Fills the Tramp's Swiss Retreat\". Daily Mail, 17 September 1993. pp. 48 She married Patricio Castilla in 2006. She has two children and a godson:\"Oona Chaplin: The Chaplin kid\" Evening Standard. 12 February 2010 She has a home beside the beach in Miami and also spends time living in Madrid and Switzerland.Your instrument is your sensitivity – Geraldine Chaplin RT. 8 July 2011 == References == == Other websites == * *Geraldine Chaplin at the Internet Broadway Database *Geraldine Chaplin at AllMovie Category:1944 births Category:Living people Category:American movie actors Category:Actors from Santa Monica, California Geraldine",
 "title": "Geraldine Chaplin"
}