{
 "id": "505650",
 "text": "Molly Pitcher is a legend from the Revolutionary War. She was bringing pitchers of water to men working a cannon. When one of the men fell down, she fired the cannon herself. Historians do not think there was a real person named \"Molly Pitcher\" in the Revolutionary War. Most historians agree it was a nickname. They think the story of Molly Pitcher may have come from more than one real woman who fired a cannon. Many of the battles were fought on hot days, and soldiers would ask for a pitcher of water to drink or to cool the cannons. Molly was a common woman's nickname at the time. == History of the legend == Stories about the American Revolution were first told by talking out loud instead of writing them down.Ray Raphael, Founding Myths: Stories That Hide Our Patriotic Past (New York: New Press: Distributed by W.W. Norton, 2004), pp. 1–5 This allowed the storyteller to make things sound bigger than they were or even make up things that did not happen at all. Some stories are still told, long after professional historians prove they are not true. The story of Molly Pitcher may have come from more than one real person.Patricia Cleary; David Neumann, 'The Challenges of Primary Sources, Collaboration, and the K-16 Elizabeth Murray Project', The History Teacher, Vol. 43, No. 1 (Nov., 2009), p. 71 Many women helped soldiers on the battlefields during the Revolutionary war. Most were wives and daughters of soldiers. According to the legend, \"Molly Pitcher\" brought water to a group of soldiers firing a cannon during a battle. One of those soldiers was her husband. She brought water many times. When she came to bring water one time, she saw her husband had been shot. Molly took his place and helped fire the cannon.Sarah Buttsworth, 'Who's Afraid of Jessica Lynch? Or One Girl in All the World? Gendered Heroism and The Iraq War', Australasian Journal of American Studies, Vol. 24, No. 2 (December 2005), p. 48 The Battle of Monmouth is probably where the legend started.Rachel Hope Cleves, '“Heedless Youth”: The Revolutionary War Poetry of Ruth Bryant (1760-83)', The William and Mary Quarterly, Vol. 67, No. 3 (July 2010), p. 537 Her story was started many years after the war by writers and artists.Laura Browder, Her Best Shot: Women and Guns in America (Chapel Hill: University of North Carolina Press, 2006), p. 16 A Currier and Ives print of a \"Captain Molly\" appeared in 1848. The first writing about Molly Pitcher was in 1859. It wasn't until 1876 that someone published a genealogy claiming a local woman was the real Molly Pitcher. After that, the idea of Molly Pitcher grew and grew. Today, Molly Pitcher is famous. She is in grade-school and high- school textbooks. Internet sources even argue whether Molly Pitcher was a feminist. == The real women == Most legends start with some small truth. Molly Pitcher is no exception. There are several women who might have been the real Molly Pitcher, or it might have been all of them together: *Mary Ludwig Hayes (also called Mary Ludwig Hayes McCauley) is in records on June 28, 1778. This is when she signed up to serve with the Pennsylvania Artillery. She may have earned the nickname \"Molly Pitcher\" by bringing drinking water to soldiers in the heat at the Battle of Monmouth. When her husband had heat stroke or was wounded, Mary took his place on the artillery piece. The legend says she was personally thanked by George Washington after the battle, but this might not be true. Washington made a comment during the battle, recorded by Dr. William Read. Washington said that he was admiring the manner in which Proctor was handling their right. He was referring to Captain Francis Proctor's artillery company. Mary Hays was the wife of a gunner in that company. The Battle of Monmouth started the myth of Mary Pitcher. The state of Pennsylvania gave her a pension of forty dollars forty years after the battle for her heroism. *Margaret Corbin was serving with her husband at Fort Washington in present day New York City.Dorothy A. Mays, Women in Early America: Struggle, Survival, and Freedom in a New World (Santa Barbara, CA: ABC-CLIO, 2004), pp. 270–271 Her husband John fell wounded and later died, and she took his place at the cannon. She was hit by three rounds of grapeshot in her arm. She was captured by the British but returned to the Americans at a Philadelphia hospital. She continued to serve, doing whatever she could even though she was injured. Her arm never healed and she was given a half-soldier's pension in 1779 for the rest of her life. *Deborah Sampson at 5 feet 8 inches was a tall woman. She dressed as a man and served with the 4th Massachusetts Regiment. Because she had a good-looking face, the other men (thinking she was also a man) called her \"Molly\" as a joke.An Encyclopedia of American Women at War: From the Home Front to the Battlefields, ed. Lisa Tendrich Frank (Santa Barbara, CA: ABC- CLIO, 2013), p. 447 She served for the rest of the war. Sampson was the only other woman who received a federal pension for military service. She had tried once before to join the army in 1782 by disguising herself as a man. She collected a bounty for enlisting as \"Timmothy Thayer.\" She was caught the following day and had to return the money.Dorothy A. Mays, Women in Early America: Struggle, Survival, and Freedom in a New World (Santa Barbara, CA: ABC-CLIO, 2004), p. 344 The Revolutionary war had many small fights and only a few large battles. It was not unusual for women to be fight. Women filled many roles that most people thought were only done by men. == A written account == Joseph Plumb Martin was a soldier in the Continental Army. He wrote down of his experiences. This came to the attention of historians in the 1950s. Martin describes a woman at the Battle of Monmouth: This account has been changed in other sources to show he gave her a name when in fact he did not. == References == == Other websites == * Will the Real Molly Pitcher Stand Up?, Daughters of the American Revolution (DAR) * Historian examines the legend of Molly Pitcher * Everything You’ve Heard About Molly Pitcher Is A Myth Category:American Revolutionary War Category:Legendary people Category:Fictional American people",
 "title": "Molly Pitcher"
}