{
 "id": "505861",
 "text": "Coronaviruses are a group of RNA viruses. They cause diseases in birds and mammals, including humans. These diseases can be mild, or they can be fatal. In humans and birds, they cause respiratory tract infections. Mild illnesses in humans include some cases of the common cold (which is also caused by other viruses, for example rhinoviruses). More lethal varieties can cause SARS, MERS, and COVID-19. They are enveloped viruses with a positive-sense RNA genome.enveloped = has viral envelopes covering their protective protein capsids; positive sense = the RNA sequence may be directly translated into the desired viral proteins. The genome size of coronaviruses is about 26 to 32 kilobases,One kilobase = 1000 base pairs which is extraordinarily large for an RNA virus. There are four major groups of coronaviruses, called alpha, beta, gamma, and delta. The most famous coronavirus is one of the betas, the kind that causes Coronavirus disease 2019 (COVID-19) in humans. The name \"coronavirus\" comes from the Latin word corona, meaning \"crown\" or \"halo\", and refers to how virions look under an electron microscopy (E.M.).virion = complete virus particle. They have a fringe of large, bulbous surface projections looking like a crown. This morphology is created by the viral spike (S) peplomer, which are proteins on the surface of the virus. They decide which cells the virus can infect. Proteins of coronaviruses are the spike (S), envelope (E), membrane (M), and nucleocapsid (N). == Diseases == Coronaviruses infect the upper respiratory and gastrointestinal tracts of mammals and birds. Six different strains of coronaviruses infect humans. These include: *MERS-CoV *SARS-CoV *Severe acute respiratory syndrome coronavirus 2, which causes the disease coronavirus disease 2019 and is the cause of the COVID-19 pandemic (formerly referred as the \"2019–20 coronavirus outbreak\") Coronaviruses are believed to cause many common colds in human adults. The significance and economic impact of coronaviruses is hard to assess. Unlike rhinoviruses (another common cold virus), human coronaviruses are easy to grow in the laboratory. == Structure == Coronaviruses are large, spherical particles with unique surface projections. Their size is variable, averageing 80 to 120 nms. The total molecular weight is on average 40,000 kDa. They are enclosed in an envelope studded with projecting protein molecules. These layers protect the virus when it is outside the host cell. The viral envelope is made up of a lipid bilayer in which the membrane (M), envelope (E), and spike (S) structural proteins are anchored. The ratio of E:S:M in the lipid bilayer is approximately 1:20:300. The E and M protein are the structural proteins that combined with the lipid bilayer to shape the viral envelope and maintain its size. S proteins are needed for interaction with the host cells. But human coronavirus NL63 is peculiar in that its M protein has the binding site for the host cell, and not its S protein. The diameter of the envelope is 85 nm. == History == The earliest reports of a coronavirus infection in animals occurred in the late 1920s, when an acute respiratory infection of domesticated chickens happened in North America. Arthur Schalk and M.C. Hawn in 1931 made the first detailed report which described a new respiratory infection of chickens in North Dakota. It was not realized at the time that three related viruses were involved. Human coronaviruses were discovered in the 1960's using two different methods. E.C. Kendall, Malcolm Bynoe, and David Tyrrel, working at the Common Cold Unit of the British Medical Research Council, collected a unique common cold virus B814 in 1961. The virus could not be cultivated using the techniques which had successfully cultivated rhinoviruses, adenoviruses, and other known common cold viruses. Eventually, this was solved. The new cultivating method was introduced to the lab by Bertil Hoorn. The isolated virus, when put into the noses of volunteers, caused a cold. The virus was inactivated by ether which showed it had a lipid envelope. The novel virus caused a cold in volunteers and, like B814, was inactivated by ether. Scottish virologist June Almeida at St Thomas' Hospital, London, compared the structures of IBV, B814, and 229E in 1967. Using transmission electron microscopy,the three viruses were shown to be similar in shape and have club-like spikes. A research group at the National Institute of Health the same year isolated another member of this group of viruses. Like B814, 229E, and IBV, the novel cold virus OC43 had distinctive club-like spikes when observed with the electron microscope. The IBV-like novel cold viruses looked like the mouse hepatitis virus. This new group of viruses were called \"coronaviruses\" from their crown-like appearance. The coronavirus strain B814 was lost. It is not known which present human coronavirus it was. Other human coronaviruses have since been identified, including SARS-CoV in 2003, HCoV NL63 in 2003, HCoV HKU1 in 2004, MERS-CoV in 2013, and SARS-CoV-2 in 2019. There have been a large number of animal coronaviruses identified since the 1960s. ==Related pages== *Zoonosis ==References==",
 "title": "Coronavirus"
}