{
 "id": "50586",
 "text": "Maurice Harold Macmillan, 1st Earl of Stockton, OM, PC (10 February 1894 – 29 December 1986), was a Conservative politician. He was Prime Minister of the United Kingdom from 1957 to 1963. Macmillan was in the Grenadier Guards during the First World War. After the war he joined his family publishing company. He entered Parliament at the 1924 general election. After losing his seat in 1929, he won it again in 1931. During World War II, Churchill made Macmillan Minister Resident in the Mediterranean. This made him the go-between for Churchill and the British forces in North Africa and the Middle East. The Mediterranean was a major theatre of war, and Macmillan's work made his name as a serious politician. Macmillan became Foreign Secretary and then Chancellor of the Exchequer under Churchill's successor Sir Anthony Eden. When Eden resigned in 1957 after the Suez Crisis, Macmillan succeeded him as Prime Minister and Leader of the Conservative Party.Horne, Alistair 2008. Macmillan: The Official Biography. (twentieth anniversary ed) London: Macmillan. ISBN 978-0-230-71083-2 Macmillan presided over a country becoming richer, with low unemployment and high (but uneven) economic growth. In his Bedford speech of July 1957 he told the nation they had 'never had it so good'.Sandbrook, Dominic 2005. Never Had It So Good. London: Little, Brown. ISBN 978-0-349-11530-6 Macmillan was granted the last hereditary peerage given to a prime minister when he became the Earl of Stockton and Viscount Macmillan of Ovenden. ==References== Category:1894 births Category:1986 deaths Category:Alumni of the University of Oxford Category:British military personnel of World War I Category:Chancellors of the Exchequer Category:English Anglicans Category:Conservative Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:Leaders of the Conservative Party (UK) Category:Conservative members of the House of Lords Category:Order of Merit Category:People educated at Eton College Category:Politicians from London Category:Members of the Privy Council of the United Kingdom Category:Secretaries of State of the United Kingdom Category:UK MPs 1931–1935 Category:UK MPs 1935–1945 Category:UK MPs 1945–1950 Category:UK MPs 1950–1951 Category:UK MPs 1951–1955 Category:UK MPs 1955–1959 Category:UK MPs 1959–1964 Category:United Kingdom Earls",
 "title": "Harold Macmillan"
}