{
 "id": "50618",
 "text": "A national park is a park or an area of land officially recognized and protected by a nation's government. National parks are often made to protect the animals that live inside them or the land itself. There are many National Parks in the world. The first one established (in 1872) was the United States Yellowstone National Park. It was the first national park in the world. But the idea of protecting areas from human development was proposed years earlier. American painter George Catlin offered the idea during the 1830s. An international organization, the International Union for Conservation of Nature (IUCN), and its World Commission on Protected Areas, has defined National Parks as its category II type of protected areas. The largest national park in the world meeting the IUCN definition is the Northeast Greenland National Park, which was established in 1974. According to the IUCN, there are about 7000 national parks worldwide (2010 figure). ==Definitions== In 1969 the IUCN (International Union for the Conservation of Nature and Natural Resources) declared a national park to be a relatively large area with:Gulez, Sumer (1992). A method of evaluating areas for national park status. *with one or more ecosystems (or ecological system) not much altered by humans. It should have plant and animal species, geology sites and habitats. These should be of special scientific, educative and recreative interest, or contain a natural landscape of great beauty. *the country has taken steps to prevent or eliminate exploitation or occupation in the area. They must enforce respect for its ecological, geomorphological or aesthetic features. *visitors are allowed to enter, under special conditions, for inspirational, educative, cultural and recreative purposes. *a minimum size of 1,000 hectares within zones where nature is protected *statutory (or legal) protection *a budget and staff to provide sufficient effective protection *no business use of natural resources (including the development of dams) except such activities as sport, fishing, the need for management, facilities, etc. While national parks are generally understood to be administered by national governments (hence the name), in Australia national parks are run by State Governments and predate the Federation of Australia. Also in Japan, some of them called \"Quasi- national Parks\" (国定公園) are recognized by the government and managed by local governments. == Examples == *Manú National Park, Peru *Everglades, Florida *Hawaii Volcanoes National Park *Yosemite National Park, California *Grand Canyon, Colorado River, Arizona *Yellowstone National Park, United States *Great Barrier Reef, Queensland, Australia *Dartmoor, Devon, England *Galapagos National Park, Ecuador *Teide National Park, Spain == Other websites == * UNESCO — Man and the Biosphere Programme (Biosphere Reserves) * World Heritage Sites * UN Protected Areas database * EUROPARC federation — Europe's protected areas * United States National Park Service * National Parks of Japan by Ministry of the Environment, Japan * South Korea- Korea National Park Service * European National Parks Centre (ENPC) * TeddyRoosevelt.com: \"The National Parks President\" == References ==",
 "title": "National park"
}