{
 "id": "50617",
 "text": "Yellowstone National Park is a national park in the United States. It was the world's first national park. United States President Ulysses S. Grant signed a law to create it in 1872. The name comes from the Yellowstone River, which flows through the park. Yellowstone became a UNESCO World Heritage Site in 1978. Yellowstone National Park is famous for its geysers and hot springs. About half the world's geysers are in the park. The world's most famous geyser is the Old Faithful Geyser. It is in Yellowstone National Park. Large animals such as grizzly bears, wolves, bison and elk live in Yellowstone. Many tourists visit the park each year to see the geysers and animals. The park is the main part of the Greater Yellowstone Ecosystem. This is the largest, almost complete ecosystem in the Earth's northern temperate zone. It has many regions; the subalpine forest covers the largest area. == History == People have lived in the Yellowstone area for at least 11,000 years.Lahren, Larry 2006. Homeland: An archaeologist's view of Yellowstone Country's past. Cayuse Press, p161. ISBN 978-0-9789251-0-9 Some Native Americans still lived there when the first people came from Europe in 1807/1808. John Colter, a trapper, came with the Lewis and Clark Expedition. They visited a big area which was unknown to the world at that time. Colter came back to St. Louis and told the people there that he had found a beautiful place of hot springs and geysers. This area was Yellowstone, but nobody believed him. Yellowstone was not famous at that time. For the next sixty years, only a few other trappers traveled through the area, and the same thing happened to them. When they reported that Colter had been right, nobody listened to their stories. Then three trips between 1868 and 1871 visited Yellowstone, and they told the news of its beauty to the people in the East. One year later, on March 1, 1872, United States President Ulysses S. Grant signed a law to make the first National Park in the world. For the first sixteen years, the Interior Department managed the park. But Congress did not give them any money. So from 1886 to 1917, the US Army managed it. Then the new National Park Service took over, and they have managed Yellowstone since then. === UNESCO World Heritage Site === Yellowstone was proposed as a UNESCO World Heritage Site in 1978. The UNESCO committee chose Yellowstone because of its special geology, natural beauty, and natural environment with rare and endangered species. * Yellowstone contains fine landscapes: the world's biggest collection of geysers, the Grand Canyon of the Yellowstone and the Yellowstone River, many waterfalls, and great wildlife. * Yellowstone has a supervolcano: the Yellowstone Caldera. * Yellowstone is one of the few remaining untouched ecosystems in the northern temperate zone of the Earth. * Yellowstone has become one of North America's biggest \"collections\" of plant and animal species. == Geography == About 96 percent of the park is in Wyoming. Three percent is in Montana and only one percent is in Idaho. The area of the park is about . It is bigger than Rhode Island or Delaware. The park is on the Yellowstone Plateau, at an average elevation of above sea level. There are mountain ranges on most sides of the plateau. These are mountain ranges of the Middle Rocky Mountains, which range from to in elevation. Three deep canyons are in the park. They were cut through the volcanic tuff of the Yellowstone Plateau by rivers over the last 640,000 years (since the last eruption). The most famous is called the Grand Canyon of the Yellowstone. === Continental divide === The continental divide of North America goes diagonally through the southwestern part of the park. This separates the Pacific from Atlantic water drainage areas. The start of the Yellowstone and Snake Rivers are near each other but on opposite sides of the divide. So, the waters of the Snake River flow to the Pacific Ocean, and the Yellowstone goes to the Atlantic Ocean through the Gulf of Mexico. The following diagram shows the movement of the caldera over time. == Geology == Yellowstone is the place of a huge ancient volcano. Its remains are called the Yellowstone Caldera. The caldera is the biggest volcanic system in North America. The cause of the volcano was a \"hotspot\" in the Earth's mantle, over which the American continental plate moved. 640,000 years ago a huge volcanic explosion blew of rock and lava into the air. It was 1000 times bigger than the Mount St. Helens eruption in 1980. Yellowstone is a dormant volcano at present. Another eruption may happen in the future. The U.S. Geological Survey watches the volcano activity. There is ground movement, geysers, and small earthquakes. The caldera floor has been rising, but experts say there is no immediate danger of eruption. For three months in 1985, 3,000 minor earthquakes happened in the northwest part of the park. Beginning on April 30, 2007, sixteen small earthquakes with magnitudes up to 2.7 happened in the Yellowstone Caldera for several days. These groups of earthquakes are common. There have been 70 groups of earthquakes in the park between 1983 and 2008. In January 2010, there were more than 250 earthquakes in two days. Seismic activity in Yellowstone National Park still happens. It is reported hourly by the Earthquake Hazards Program of the U.S. Geological Survey. === Geysers and the hydrothermal system === A study that was completed in 2011 found that at least 1283 geysers have erupted in Yellowstone. Of these, an average of 465 are active in a given year. Yellowstone contains at least 10,000 thermal features altogether, including geysers, hot springs, mudpots, and fumaroles. Over half of the world's geysers and hydrothermal features are concentrated in Yellowstone. == Animals == Yellowstone has the finest megafauna wildlife (big animals) in the United States. There are almost 60 species of mammals in the park, including the gray wolf, threatened lynx, and grizzly bear. Other big mammals are the bison (buffalo), black bear, elk, moose, mule deer, white- tailed deer, mountain goat, pronghorn, bighorn sheep and mountain lion. === Bison === There were between 30 and 60 million bison in North America. They almost became extinct. Yellowstone is one of their last homes. In 1902, there were less than 50 bison. By 2003, there were more than 4,000. The highest number of bison in the park was 4,900, in 2005. However, there were only 3,000 in 2008. That was after a very cold winter. Hundreds were also killed so that they did not spread brucellosis. Brucellosis is a very infectious bacterial disease. Cattle ranchers worry that brucellosis will spread to their cattle. Every year, park workers and members of Native American tribes kill some bison. This stops the herd from getting too big and spreading the disease. The Animal and Plant Health Inspection Service (APHIS) said that vaccinations and other work could remove all brucellosis from the bison and elk in Yellowstone. === Wolves === Starting in 1914, the U.S. Congress gave money to people for \"destroying wolves, prairie dogs, and other animals\" that harmed agriculture or livestock on public lands. After the wolves were gone from Yellowstone, the coyote became the park's top canine predator. However, the coyote cannot easily kill large animals. The result was a big increase in hurt and sick megafauna (mainly meaning bison). By the 1990s, the Federal government had changed its mind about wolves. In a controversial decision by the U.S. Fish and Wildlife Service, wolves were brought into the park from Canada. Scientists studied the wolves in 2005. They found 118 wolves in 13 wolf packs in Yellowstone Park and 326 wolves in the whole ecosystem. The increase in the number of wolves in the states of Wyoming, Montana and Idaho has been so successful that they are no longer on the endangered species list. === Bears === About 600 grizzly bears live in the Greater Yellowstone Ecosystem. More than half live in Yellowstone Park. === Elk === There are over 30,000 elk; this is the largest number of any big mammal species in Yellowstone. The northern herd has become much smaller since the mid-1990s. Wolves may cause this. Also, elk use more forested areas to hide from the wolves. This makes it harder for researchers to count them. The northern herd migrates west into southwestern Montana in the winter. The southern herd migrates south, and most of these elk stay on the National Elk Refuge during winter, southeast of Grand Teton National Park. The southern herd migration is the biggest migration of mammals in the U.S. outside of Alaska. === Other predators === In 2003, the footprints of one female lynx and her child were found and followed for over . Feces and other material was tested and confirmed to belong to a lynx (no one actually saw a lynx). Lynx have not been seen in Yellowstone since 1998, though DNA taken from hair samples showed that lynx were going through the park. Other mammals that are seen less often are the mountain lion and very few wolverines. There are about 25 mountain lions in the park. Yellowstone is home to six species of reptiles, such as the painted turtle and prairie rattlesnake, and four species of amphibians, including the boreal chorus frog. === Fish === Eighteen species of fish live in Yellowstone, including the Yellowstone cutthroat trout. Many anglers want this fish, and most of the fish live in Yellowstone. The Yellowstone cutthroat trout has faced several threats since the 1980s. Someone may have illegally added lake trout, an invasive species, to Yellowstone Lake. They eat the smaller cutthroat trout. An ongoing drought has caused problems for the cutthroat. A parasite called whirling disease kills younger fish. Since 2001, a \"catch and release\" law applies to all native sport fish species caught in Yellowstone waters. === Birds === 311 species of birds have been found. Almost half of them nest in Yellowstone. As of 1999, twenty-six pairs of nesting bald eagles have been counted. Very rarely, whooping cranes have been seen; only three are known to live in the Rocky Mountains, out of 385 known worldwide. Other birds, which are at risk because they are rare in Yellowstone, include the common loon, harlequin duck, osprey, peregrine falcon and the trumpeter swan. == Climate == One reason for the strange climate in Yellowstone is its position in the Rocky Mountains. The temperature at the Mammoth Hot Springs is between in January and in July. Sudden temperature increases or decreases in the middle of a year are not rare. However, the main reason (as explained above) is that the caldera is the biggest volcanic system in North America. It sits on top of a hotspot in the Earth's crust. In summer, there are temperatures of about in the lower areas, but they can go up to sometimes. There are many thunderstorms during the afternoons. There are relatively low temperatures during the night; they can get below zero in the mountains. Normal temperatures in winter are between . The highest temperature recorded was in 1936, while the lowest temperature was in 1933 in Mason. == Tourism == Yellowstone has many tourists each year. Many come for the natural beauty of Yellowstone Park. Year Visitors 1930 0.23 million 1950 1.1 million 1970 2.3 million 1990 2.8 million 2010 3.6 million 2023 4.5 million The park has five entrances: * from the North through Livingston and Gardiner (Montana) * from the Northeast through the Beartooth Highway (Wyoming) * from the East through Cody, Wyoming * from the South from Jackson * by going around Grand Teton National Park from the West from Idaho Falls (Idaho). Yellowstone has many things to see, such as geysers, hot springs, a deep canyon, a river with many falls, forests, seas, mountains, wilderness, and wildlife. Many visitors say these attractions are beautiful. More than 2.8 million tourists have been to Yellowstone since 1990. In 2010, 3.64 million people went to it. About 140,000 people come in the winter to see snow attractions, for example driving snowmobiles. More than 4,500 people work in the hotels, parks and shops. == Conservation == Conservation of the environment and life was the main reason for creating the national parks. Even before the creation of Yellowstone, the naturalist Henry David Thoreau and other supporters asked the government to protect nature and animals in that place. However, when the park was finally made, there was no such law. A law to stop most of the animals from being shot was not made until 1883, nearly 10 years after making the park. Hunting \"protected\" animals were not allowed because of that law. Even so, poachers could still operate. So in 1894, a new law called the National Park Protection Act was made. The US Congress protected nature, wildlife and other natural resources. The new law did not allow the killing or destroying of them, and only fishing was allowed. Nature, such as trees, mineral resources, and other things, were not allowed to be hurt. Because Yellowstone has many forests, some fires happen. The last big fires were the \"Yellowstone fires of 1988\". They damaged more than of forest area and burned out more than of trees and forest. Also, of bush and grass were damaged. The effect of the fire can still be seen in some places, even after more than 30 years. After 1988, new fire management plans were started: people are now not allowed to fight the fire, but let them burn and observe them. This was to keep the fire controlled. According to the 2004 plan, natural wildfires are allowed to burn so long as fire size, weather, and potential danger are within limits.Fire management: Yellowstone. == Related pages == * List of World Heritage Sites in the United States * UNESCO * Greater Yellowstone Ecosystem * Yellowstone Caldera == References == == Other websites == * Yellowstone National Park Official site * An extensive Yellowstone photographic gallery on the official NPS.gov site * USGS: Volcanic History of the Yellowstone Plateau Volcanic Field * Life at high temperatures - An introduction to Yellowstone's thermophilic bacteria. * Tracking Changes in Yellowstone's Restless Volcanic System, U.S. Geological Survey, Fact Sheet 100-03, 2004 * Scientific American Magazine (June 2004 Issue) Lessons from the Wolf Category:Biosphere reserves Category:Calderas Category:National parks in the United States Category:Volcanoes of the United States Category:World Heritage Sites in the United States Category:Western United States Category:Geography of Idaho Category:Geography of Montana Category:Geography of Wyoming",
 "title": "Yellowstone National Park"
}