{
 "id": "506235",
 "text": "Renata Notni (born January 2, 1995 in Cuernavaca, Morelos, Mexico) is a Mexican actress and model. ==Early life== Notni was born in Cuernavaca, Morelos, Mexico. As a child, she attended acting lessons at Centro de Educación Artística, the children's version of drama school. Centro de Educación Artística is run by Televisa in Mexico City. ==Personal life== Notni had a relationship with Diego Amozurrutia. The relationship ended but they remain friends. She currently resides in Mexico City. ==Filmography== Year Title Role Notes 2006-07 Código postal Andrea Garza Durán Supporting Role 2008-09 Un gancho al corazón Luisa Hernández/Luisa Sermeño Lerdo de Tejada Supporting Role 2009-10 Mar de amor Carmen \"Carmita\" Bracho Supporting Role 2011 La fuerza del destino Lucía Lomelí Curiel (young) Special Appearance 2011-12 Amorcito corazón María Soledad \"Marisol\" Lobo Ballesteros Supporting Role 2012-13 Qué Bonito Amor Paloma Mendoza García Supporting Role 2013-14 Quiero amarte Mariana Valdez Morales de Fonseca Supporting Role 2015 Yo quisiera Camila Television series 2015 Amor de barrio Paloma Madrigal Nava Telenovela (Leading Role) 2016 Sueño de amor Patricia \"Pato\" Guerrero Díaz Television series 2017 Mi adorable maldición Aurora Sánchez Ruiz/ Carmen Ruiz Campos Television series Érase una vez Blanca Valle Television series 2018 Por amar sin ley Sol García Castillo Television series == Television == Year Title Role 2005-2008 Vecinos Camila Vival 2008 La rosa de Guadalupe El juramento - Nora 2010 La rosa de Guadalupe Camara Web - Nayeli 2011 Como dice el dicho Nadie sabe lo que tiene, hasta que lo pierde - Sofía 2012 Vecinos Camila Vival 2015 Yo quisiera Camila 2017- presente Vecinos Camila Vival == Music videos == Year Title Artist 2018 Eso no va a suceder Ha*Ash ==References== == Other websites == * *Renata Notni Relationships and Family and Awards Category:1995 births Category:Living people Category:Mexican television actors Category:Mexican models Category:People from Morelos",
 "title": "Renata Notni"
}