{
 "id": "506540",
 "text": "Adam Paul Nielson Hicks (born November 28, 1992) is an American actor, rapper, singer, and songwriter. His first leading role was in How to Eat Fried Worms. Hicks is best known for playing Luther in the Disney XD series Zeke and Luther. He also played Wendell \"Wen\" Gifford in the film Lemonade Mouth. Hicks had a recurring role in the second season of Jonas L.A. as DZ. Hicks also played Boz in the Disney XD Original Series Pair of Kings. In addition to acting, Hicks was a rapper, singer, and songwriter. On April 12, 2011 Hicks released his first album Lemonade Mouth a soundtrack album. == Early life == He was born in Las Vegas, Nevada to Ronald Hicks and Lucy Hicks. He has a younger brother, Tristan Hicks (born April 16, 1997). == Legal issues == === Armed robbery arrest === On January 25, 2018, Adam Hicks was arrested in Burbank, California for armed robbery. He said he was not guilty to all charges. On July 8, 2021, Hicks was found Guilty for the armed robbery charges, he was sentenced to five years in state prison and received 3 years probation. == Filmography == === Film === Year Title Role Notes 2005 Down and Derby Brady Davis 2005 The 12 Dogs of Christmas Mike Stevens 2006 The Shaggy Dog Quarterback Voice 2006 How to Eat Fried Worms Joseph \"Joe\" Guire 2008 Mostly Ghostly Colin Doyle 2011 Lemonade Mouth Wen TV Movie 2015 Up on the Wooftop Toby Voice 2015 The Boy Next Door Jason Zimmer 2016 Little Savages Billy 2017 Windsor Clint 2018 Shifting Gears Jeremy Williamson === Television === Year Title Role Notes 2000–02 Titus Dave Titus (young) Recurring role 2002 The Funkhousers Robbie Funkhouser Television film 2002 That Was Then Joshua Harrison Episode: \"Pilot\" 2009–12 Zeke and Luther Luther Waffles Lead role 2010-16 The Hive Buzzbee the USA Version Episode 1-present 2010 Jonas Dennis \"DZ\" Zimmer Recurring role (Season 2) 2011 Lemonade Mouth Wendell \"Wen\" Gifford Television film 2011 Peter Punk Luthisour \"Luther\" Waffles Episode: \"El Duelo\" 2011 PrankStars Himself Episode: \"Game Showed Up\" 2011 So Random Episode: \"Bridgit Mendler, Adam Hicks and Hayley Kiyoko\" 2012–13 Pair of Kings King Boz Lead Role (Season 3); 22 episodes 2012 Southland Mike Episode: \"Legacy\" 2013 CSI: Crime Scene Investigation Tyler Episode: \"Helpless\" 2015 Texas Rising Truett Fincham Main role, miniseries 2016–2017 Freakish Diesel Turner Main role == Discography == === Soundtrack albums === * Lemonade Mouth == References == Category:1992 births Category:American child actors Category:American movie actors Category:American television actors Category:American rappers Category:American rock singers Category:American movie directors Category:American movie producers Category:American singer- songwriters Category:American screenwriters Category:American voice actors Category:Singers from Nevada Category:Writers from Nevada Category:Actors from Las Vegas",
 "title": "Adam Hicks"
}