{
 "id": "506755",
 "text": "The 2016 presidential campaign of George Pataki, the 53rd Governor of New York, was formally launched on May 28, 2015. After having considered a candidacy in previous cycles, his campaign for the Republican nomination for President of the United States in the 2016 election is his first bid for the presidency. On December 29, 2015, Pataki announced that he would be ending his Presidential campaign.Former NY Gov. George Pataki says he's planning to drop White House bid , ABC-TV 13 KTRK-TV, December 29, 2015. ==Background== In an August 2014 interview with Newsmax TV, Pataki once again expressed interest in a possible presidential bid, this time for the 2016 Republican nomination.Chumley, Cheryl K. (August 8, 2014) \"George Pataki cites Obama’s ‘hideous’ hits at Constitution as reason for possible 2016 run\", The Washington Times. Retrieved May 28, 2015. In January 2015, he revealed to ABC News that he had launched a political action committee (PAC) for the purpose of exploring, and making preparations for, a possible presidential candidacy. On May 14, 2015, Pataki stated on MSNBC's Morning Joe that he would announce his decision regarding his potential candidacy on May 28 at an event in New Hampshire.Gass, Nick (May 14, 2015) \"George Pataki will have announcement on White House run on May 28\", Politico. Retrieved May , 2015. He later confirmed to the New York Post that he intended to announce his candidacy for the 2016 Republican presidential nominination at the aforementioned event. ==Campaign== Pataki officially launched his presidential campaign on May 28, 2015. He initially confirmed his candidacy via a video message which appeared on his website, before making a formal announcement before a gathering of supporters and members of the media in Exeter, New Hampshire. ==Polling== As of late July 2015, Pataki has been polling at less than 1 % of the Republican primary voters. ==References== Pataki",
 "title": "George Pataki 2016 presidential campaign"
}