{
 "id": "506764",
 "text": "The 2016 presidential campaign of Donald Trump was a successful presidential campaign of Donald Trump. He announced and launched his campaign on June 16, 2015, at Trump Tower in New York City. Trump was the Republican nominee for president of the United States. He became the presumptive nominee on May 4, 2016. He won the Republican nomination for president on July 19, 2016 at the 2016 Republican National Convention. He chose Mike Pence, the 50th governor of Indiana, as his vice presidential running mate. On November 8, 2016, Trump and Pence had defeated former U.S. secretary of state Hillary Clinton and U.S. senator Tim Kaine in the Electoral College and was elected the president and vice president of the United States. ==Campaign slogan== Trump declared, \"We are going to make our country great again\" and he made a commitment to become the \"greatest jobs president.\" Trump's official campaign slogan is \"Make America Great Again.\" (which was Ronald Reagan's campaign slogan, but Trump trademarked it). == Policies == Trump is opposed to illegal immigration and has promised to build a wall on the US-Mexico border, and believes that illegal immigrants already in this country should be deported. He is against the Trans Pacific Partnership trade agreement. Trump also proposed banning Muslims from entering the United States, an idea that many Republicans criticized as unconstitutional. He also supports reforming the tax code. ==Front runner status== A survey conducted by The Economist / YouGov released July 9, 2015 became significant as the first major nationwide poll to show Trump as the 2016 Republican presidential front-runner.Colin Campbell (July 9, 2015).Donald Trump has surged to the top of 2 new 2016 polls. Business Insider. A Suffolk/USA Today poll released on July 14, 2015, showed Trump with 17% support among Republican voters, with Jeb Bush at 14%. A Washington Post/ABC News poll taken on July 16–19, showed Trump had 24% Republican support, over Scott Walker at 13%. A CNN/ORC poll showed Trump in the lead at 18% support among Republican voters, over Jeb Bush at 15%, and a CBS News poll from August 4 showed Trump with 24% support, Bush second at 13%, and Walker third at 10%. ==Nomination== On May 4, 2016, Trump became the presumptive nominee after his only challengers Texas United States senator Ted Cruz and Governor of Ohio John Kasich dropped out. Trump has been opposed by other Republicans. Several prominent Republican politicians have refused to endorse him, and his candidacy has been protested by many people. ==Supporters== ==Notes== ==References== ==Other websites== *Official campaign website *Donald Trump Presidential Campaign Announcement, June 16, 2015 *Donald Trump at the Family Leadership Summit, July 18, 2015 Trump Presidential campaign 2016",
 "title": "Donald Trump 2016 presidential campaign"
}