{
 "id": "506874",
 "text": "On the evening of June 17, 2015, a mass shooting took place at Emanuel African Methodist Episcopal Church, the first church for black people ever in America. It is in Charleston, South Carolina, United States. Nine people at the church were killed and another was injured. Among the dead was minister and state senator, Clementa C. Pinckney. ==Suspect== Police arrested a white youth, later identified as 21-year-old Dylann Roof, in Shelby, North Carolina, the morning after the attack. Dylann Storm Roof was named by the Federal Bureau of Investigation (FBI) as the suspected killer after his father and uncle got in touch with police. They identified Roof after seeing security photos of him in the news. Roof was born in Columbia, South Carolina. He was living in a mostly African-American neighborhood near Columbia at the time of the shooting. Roof already had a police record of two arrests, both made in the months leading up to the attack. ==Victims== The victims, six women and three men, were all African-American members of the AME Church. Eight died at the scene; the ninth, Daniel Simmons, died at MUSC Medical Center. They were all killed by multiple gunshots fired at close range.Five persons survived the shooting unharmed, including Felicia Sanders, mother of slain victim Tywanza Sanders, and her five-year-old granddaughter, as well as Polly Sheppard, a Bible study member. Pinckney's wife and two daughters were inside the building during the shooting, but were in the pastor's office with the door locked. Those killed were identified as: * Clementa C. Pinckney (41) – the church's pastor and a South Carolina state senator. * Cynthia Marie Graham Hurd (54) – a Bible study member and manager for the Charleston County Public Library system; sister of former state senator Malcolm Graham. * Susie Jackson (87) – the oldest victim who was a Bible study and church choir member. * Ethel Lee Lance (70) – the church's sexton. * Depayne Middleton-Doctor (49) – a pastor who was also employed as a school administrator and admissions coordinator at Southern Wesleyan University. * Tywanza Sanders (26) – the youngest victim who was a graduate of Allen University; grandnephew of victim Susie Jackson. * Daniel L. Simmons (74) – a pastor who also served at Greater Zion AME Church in Awendaw. * Sharonda Coleman-Singleton (45) – a pastor; also a speech therapist and track coach at Goose Creek High School; mother of MLB prospect Chris Singleton. * Myra Thompson (59) – a Bible study teacher. The victims were later collectively referred to as \"The Emanuel Nine\". ==References== Category:2015 mass shootings Category:2015 murders in the United States Category:2010s mass shootings in the United States Category:2010s in South Carolina Category:African-American history Category:Attacks on buildings and structures in 2015 Category:Attacks on religious buildings and structures in the United States Category:Attacks on churches Church shooting Category:June 2015 events Category:Massacres in the United States Category:Murders by firearm in the United States Category:Racially-motivated violence in the United States Category:Religious building shootings",
 "title": "Charleston church shooting"
}