{
 "id": "506897",
 "text": "An anti-tank gun is a light artillery gun used to destroy tanks. The shells they fire are usually between 25 and 90 mm caliber (1 to 3.6 inches). They were used a lot in World War II. Later wars used them less, because smaller anti-tank weapons had been invented. The first anti-tank weapon was used in WWI. This was the Mauser 1918 T-Gewehr, a heavy, handheld rifle used by German troops to pierce through the thin armor of the time. Although not an artillery piece, this paved the way for the first anti-tank gun being made. The 3.7 cm PaK made by Germany was the first artillery piece to be designed specifically for tanks. This was made after WWI. Category:Firearms During the Second World War, many anti-tank weapons were made. Germany started the war with the 3.7 cm gun which had worked very well in the Spanish Civil War but was not powerful enough to destroy new enemy tanks. The 8.8 cm flak gun, designed for anti- aircraft warfare, was powerful enough to use against new tanks such as the British Valentine II and Soviet T-34. It could still be used as anti-air but in the early part of WWII it often fought tanks. When fighting against tanks it was too tall to hide easily, and too heavy to move as easily as a real anti-tank gun, but it was powerful and versatile. It was also too expensive; German factories could not make enough of them to do both kinds of fighting. The German 7.5 cm anti-tank gun was powerful enough to destroy most tanks, and enough were made to let them become the main German anti-tank gun late in the war. In the same era, rocket launchers were being produced as well. Items like the M1 Bazooka, the Panzerfaust, and Panzerschreck, were being produced to counter tanks, as well as give infantry the ability to fight against tanks. The Anti-Tank gun has outlived its usage in wartime, due to the fact that they can't compete with the changing tanks in this time period. Years after WW2, many new and improved anti-tank guns were being used. But, instead of being artillery pieces, it was shifted into being infantry use. The Cold War was a root cause for all of these new weapons, as the Soviet Union and the United States of America, were in constant back and fourths with their technology. They would supply their allied countries with these weapons whenever they went to war, weapons like the M20 or the RPG-7 were commonly distributed . At this point of history, anti-tank guns have begun to become infantry held weapons rather than artillery pieces. In modern warfare anti-tank weapons would be mostly infantry held, some would be artillery pieces. But, due to the shift of the weapons and tanks, it began to become more infantry dependent, instead of being artillery dependent. Anti-tank warfare in the 21st century uses other weapons including drones, FGM-148 Javelin, etc. These weapons have become infantry dependent, however, there are still artillery pieces designated for use against tanks like the 2S25 Sprut-SD. This is a tank destroyer used by the Russian military, another is the M1128 Mobile Gun System. This is a multi-use weapon can be used an assault gun, Armored Fighting Vehicle, and tank destroyer. As technology becomes more developed, soldiers are less reliant on stationary cannons to take out enemy tanks. Tank destroying capabilities become more versatile, been used be basic infantry, and been put on wheels.",
 "title": "Anti-tank gun"
}