{
 "id": "506925",
 "text": "Nicolas Wadimoff is a Swiss director and producer. He was born in 1964 in Geneva, Switzerland. == Biography == Wadimoff was born in 1964 in Geneva, Switzerland. 1983: Graduated from the Collège de Genève 1987: Degree in Communication from the University of Quebec, Montreal (UQAM, specialisation in cinema). 1983-1990: Guitarist in an alternative rock group and toured round Europe. 1985-1990: founding member of the association État d'Urgences (State of Emergency), alternative cultural action group, and management of USINE, cultural centre. Between 1992 and 1996, worked at TSR (French language TV network in Switzerland) as a director for different news magazines, including the programme Temps Présent. During this time, he filmed in Libya, Algeria, Palestine and Israel, Yemen, Rwanda, Chiapas, etc… 1994: Actor directing class with Judith Weston 1996: Directed his first feature length fiction movie, \"Clandestins\", winner of more than fifteen awards at international festivals. 1997-2002: Co-founder of the movie production company Caravan prod. for which he produces and directs adverts and movies to order, documentaries and fiction movies, including the TV movie “15, rue des Bains”, the feature length cinema movie “Mondialito” then in 2002 the TV movie “Kadogo, l’enfant-soldat” for France 2 and TSR. In 2002, he left his role at caravan prod. to dedicate himself exclusively to being a writer-director. Through Akka Films, Nicolas Wadimoff started up and developed the project “Swiss Palestinian Encounters”: five short documentaries were borne out of a documentary workshop in which young aspiring Palestinian movie directors took part. The world premieres of the movies, presented under the title “My Home”, took place at the Visions du Réel Festival in April 2005 before being shown at international festivals. In 2005, he brought out “L’Accord”, a feature length documentary that tells the behind the scenes story of the Geneva Initiative; the movie had its world premiere at the Locarno festival. In 2006, together with the Palestinian Filmmaker’s Colllective, Nicolas Wadimoff co-produced “Summer 2006 in Palestine”, a collection a 13 short 3 minute movies by Palestinian filmmakers. In autumn 2006, Nicolas Wadimoff directed the fictional part of a docudrama for the Franco-German TV network Arte, “Les Mystères de Monte Sana”, a science-fiction movie on stem cell treatments. Between November 2006 and May 2007, he also directed two 26 minute episodes for the “Toutes les Télés du Monde” series, again for Arte. In 2007, he produced “5 minutes from Home”, a documentary by Nahed Awwad, which had its international competition premiere at the Visions du Réel festival in Nyon, Switzerland. In 2008, while still developing his own projects, Nicolas Wadimoff produced the 13 episode 6 minute “Futurofoot” series for TSR, Direct 8 (France) and Orange TV, then the movie “Dowaha” (The Secrets) by Raja Amari, shortlisted at the 2009 Venice Film Festival and “Fix Me” by Raed Andoni, shortlisted at the 2010 Sundance Festival. In February 2009, following the War in Gaza, he shot the documentary “Aisheen” (Still Alive in Gaza), shortlisted at the 2010 Berlin Festival, then entered at the Visions du Réel festival in Nyon in April 2010. His next feature length fiction movie, “Libertad”, based on a script written with Jacob Berger, was premiered in Director’s Fortnight in Cannes Film Festival in 2012. In 2015, he won the prestigious \"Prix de Soleure\" award with \"Spartans\". Documentary about Yvan Sorel, who runs a MMA (Mixed Martial Arts) club in Marseille's “Quartier nord”, a district of the city mainly known in the media for its drug trafficking, gang shootings and kalashnikovs. == Filmography == * 1989: Yehudi, Arabi, Yemeni, with Naïma Bachiri, documentary * 1990: Arménie- Jerusalem, documentary * 1992: Le Bol, documentary * 1992: Les Gants d'or d'Akka, documentary * 1992: Le temps des clandestins, documentary Temps Présent * 1994: Silence, on développe, documentary Temps Présent * 1995: Quand on allait voir Carlos, documentary Temps Présent * 1996: Cyber-Guerilla, documentary * 1997: Clandestins, with Denis Chouinard * 2000: Mondialito * 2000: 15, rue des Bains * 2002: Kadogo, l'enfant soldat * 2003: Alinghi, the Inside Story, documentary * 2005: L'Accord, with Béatrice Guelpa, documentary * 2005: Last Supper, with Issa Freij * 2007: Les mystères de Monte Sana, with Leo Singer * 2007: Toutes les télés du monde, documentary * 2009: Aisheen (still Alive in Gaza), with Béatrice Guelpa, documentary * 2012: Opération Libertad * 2013: Chasseurs de crimes, documentary * 2014: Spartans , documentary *2016: Jean Ziegler, the Optimism of Willpower, documentary *2018: The Apollo of Gaza, documentary == Awards == * 1997 : Winner at the Locarno film Festival (Jury des Jeunes award, FIPRECI award), Clandestins. * 1997 : Namur film festival. Bayard d’Or (award for best film), Public Award, Award for Best Screenplay and Jury des Jeunes award, Clandestins. * 1997 : Quebecois Film Festival. Award for Best Screenplay and Best Direction-Photography, Clandestins. * 1999 : Tokyo International Festival. Best Actor Award for Moussa Maaskri, Mondialito. * 2000 : Vues d’Afrique Festival. Special mention from the Jury, Mondialito. * 2000 : Tbilisi International Film Festival. Award for Best Director, Mondialito. * 2010 : Festival International de Berlin, Forum. Prix du Jury Œcuménique pour Aisheen (still alive in Gaza) * 2010 : Festival Visions du Réel. \"Buyens-Chagoll award and Special mention from the Jury des Jeunes, Aisheen (still alive in Gaza) * 2010 : Moqavemat International Film Festival of Téhéran . Award for Best film in Gaza category, Aisheen (still alive in Gaza) * 2012 : 44th Director’s Fortnight, in Cannes. World première, Opération Libertad. * 2013 : Swiss film award. Nomination (Best Fiction Film, Best Screenplay and Best Performance in a Supporting Role) for Opération Libertad. Quartz of the Best Performance in a Supporting Role to Antonio Buil. * 2013 : 7th Festival international du film policier de Liège. Insigne de Crystal, and public award, Opération LIbertad. * 2015. Solothurner Filmtage. Prix de Soleure, Spartans. * 2015 : Festival AMDOCS. Drew-Vérité Award, Spartans s. * 2015: Plein les Yeux, Frans Film Festival. Best french speaking film, Spartans . Category:Living people Category:1964 births Category:Swiss movie directors Category:Swiss movie producers Category:Movie people from Geneva *[44th]: Quarante-quatrième *[7th]: Septième",
 "title": "Nicolas Wadimoff"
}