{
 "id": "50700",
 "text": "The Trans-Asian Railway (TAR) is a project to build a freight railway across Europe and Asia. The TAR is a project of the United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP). The project was started in the 1950s. The idea then was to have 8750 miles (14,000km) of rail link between Singapore and Istanbul, Turkey. Further connections to Europe and Africa were also considered. At that time, there was not as much shipping and air travel as today, and the project promised to make shipping faster and cheaper between Europe and Asia. Progress in developing the TAR was slowed by political and economic problems during the 1960s, 1970s and early 1980s. By the 1990s, the end of the Cold war, and normal relations between some countries, made it seem more possible to create a rail network across the Asian continent. The TAR was seen as a way to handle the huge increases in international trade between Eurasian nations, with easier shipping. It was seen as a way to improve the economies of landlocked countries like Laos, Afghanistan, Mongolia, and the Central Asian republics, and make them easier to reach. Much of the railway network already exists, but there are still some major gaps. A big challenge is the differences in rail gauge across Eurasia. There are four different major rail gauges (to measure the distance between rails) across the continent: most of Europe, as well as Turkey, Iran, China, and the Koreas use the 1435 mm gauge, known as Standard gauge; Finland, Russia, and the former Soviet republics use a 1520 mm gauge; most of the railways in India, Pakistan, Bangladesh and Sri Lanka use a 1676 mm gauge, and most of Southeast Asia has metre-gauge. For the most part, the TAR would not change national gauges; large machines would be built to move shipping containers from train to train at the breaks of gauge. By 2001, the four corridors had been studied as part of the plan: * The Northern Corridor will link Europe and the Pacific, via Germany, Poland, Belarus, Russia, Kazakhstan, Mongolia, China, and the Koreas, with breaks of gauge at the Polish-Belarusian border (1435 mm to 1520 mm), the Kazakhstan-Chinese border (1520 mm to 1435 mm), and the Mongolian-Chinese border (1520 mm to 1435 mm). The 5750 miles (9,200km) Trans-Siberian Railway covers much of this route and already carries large amounts of freight from East-Asia to Moscow, and on to the rest of Europe. Due to political problems with North Korea, freight from South Korea must be shipped by sea to the port of Vladivostok to reach the route. * The Southern Corridor will go from Europe to Southeast Asia, connecting Turkey, Iran, Pakistan, India, Bangladesh, Myanmar, and Thailand, with links to China's Yunnan Province and, through Malaysia, to Singapore. There are gaps in eastern Iran, between India and Myanmar, between Myanmar and Thailand, between Thailand and Cambodia, between Cambodia and Vietnam and between Thailand and Yunnan. Breaks of gauge occur, or will occur, at the Iran-Pakistan border (1435 mm to 1676 mm), the India-Myanmar border (1676 mm to 1000 mm), and to China (1000 mm to 1435 mm). * A Southeast Asian network * The North-South Corridor will link Northern Europe to the Persian Gulf. The main route starts in Helsinki, Finland, and continues through Russia to the Caspian Sea, where it splits into three routes: a western route through Azerbaijan, Armenia, and western Iran; a central route across the Caspian Sea to Iran by ferry; and an eastern route through Kazakhstan, Uzbekistan and Turkmenia to eastern Iran. The routes meet in the Iranian capital of Tehran and continue to the Iranian port of Bandar Abbas. ==Related pages== *Asian Highway Network ==Other websites== * The Trans-Asian Railway Category:Rail transport in Asia Category:Rail transport in Europe",
 "title": "Trans-Asian Railway"
}