{
 "id": "507264",
 "text": "Võ Nguyên Giáp (25 August 1911 – 4 October 2013) was a general in the Vietnam People's Army and a politician. He fought during World War II, where he served as the military leader of the Viet Minh resistance against the Japanese occupation of Vietnam. Giap was a principal commander in two wars: the First Indochina War (1946–54) and the Vietnam War (1960–75). He fought in the following historically significant battles: Lạng Sơn (1950), Hòa Bình (1951–52), Điện Biên Phủ (1954), the Tết Offensive (1968), the Easter Offensive (1972), and the final Ho Chi Minh Campaign (1975). Võ Nguyên Giáp was also a teacher and a journalist, an interior minister in President Hồ Chí Minh's Việt Minh government, the military commander of the Viet Minh, the commander of the People's Army of Vietnam (PAVN), and defense minister. He also served as a member of the Politburo of the Vietnam Workers' Party, which in 1976 became the Communist Party of Vietnam. On 4 October 2013, Võ Nguyên Giáp died in Hanoi at the age of 102. He was given a state funeral on 12 and 13 October 2013 and his body lay in state at the national morgue in Hanoi until his burial at the Vũng Chùa - Đảo Yến in his home province of Quảng Bình. On 8 February 2015, Nhat Tan - Noi Bai freeway renamed to Vo Nguyen Giap street in Dong Anh and Soc Son, Hanoi. On 9 March 2021, Ho Chi Minh City named Vo Nguyen Giap street in Thu Duc city. ==References== ==Other websites== * General Giap Biography * National Liberation Front * General Vo Nguyen Giap – Asian Hero * Vo Nguyen Giap's interview – PBS * Bibliography: Writings of Vo Nguyen Giap, and Books about Him * Vo Nguyen Giap on Britannica * General History *Booknotes interview with Peter MacDonald on Giap: The Victor in Vietnam, 29 August 1993. * Brief tribute with 5 selected photos Category:1911 births Category:2013 deaths Category:Centenarians Category:Vietnamese communist politicians Category:Vietnamese generals Category:Government ministers Category:Journalists Category:Military personnel of the Vietnam War Category:Military personnel of World War II Category:Teachers",
 "title": "Võ Nguyên Giáp"
}