{
 "id": "507396",
 "text": "Douglas Alexander Spalding (1841–1877) was an English biologist. He was one of the founders of ethology (animal behaviour), but it took a long time before this was appreciated.Thorpe W.H. 1979. The origins and rise of ethology: the science of the natural behaviour of animals. Heinemann Praeger, London 1979. Chapter 3: The British contribution to the development of ethology through the nineteenth into the twentieth century. ISBN He was born in Islington in London in 1841, and began life as a workman. Later, when he lived near Aberdeen, he attended courses without charge.One of the professors arranged this. He studied philosophy and literature, but after a year he returned to London. Spalding trained to be a lawyer, but contracted tuberculosis. He travelled in Europe in hopes of finding a cure. In Avignon he met John Stuart Mill, and through Mill he met John Russell, Viscount Amberley. Russell was the son of the former British Prime Minister Lord John Russell.Russell was by then the 1st Earl Russell. Spalding became tutor to Viscount Amberley's children, including perhaps the very young Bertrand Russell. He also carried on an intermittent affair with Katharine Russell, Lord Amberley's wife. After Lord Amberley's death in 1876, Spalding returned to the continent and died there the following year. == Ethology == Spalding carried out some remarkable experiments on animal behaviour, and discovered the phenomenon now known as imprinting.Spalding D.A. 1872. On instinct. Nature, 6, 485-486.Spalding D.A. 1873. Instinct, with original observations on young animals. Macmillan's Magazine, 27, 282-293. This was later rediscovered by Oskar Heinroth, then studied and popularised by Konrad Lorenz and Niko Tinbergen.Tinbergen, Niko 1951. The study of instinct. Oxford University Press. Instinct and imprinting were the first scientific concepts in ethology. Spalding was able to prove that the behaviour of chicks after hatching from the egg happened even when they had no experience, practice or even information from the senses.Spalding D.A. 1873. Instinct in young birds. Popular Science Monthly. Therefore the capacity was inherited.Thorpe W.H. 1979. The origins and rise of ethology: the science of the natural behaviour of animals. Heinneman, London, 18-27. Gray P.H. 1967. Spalding and his influence on research in developmental behavior. Journal of the History of the Behavioral Sciences. 3, 168-179. J.B.S. Haldane reprinted Spalding's essay On Instinct in 1954 to show how important it was for the history of ethology.Haldane J.B.S. 1954. Introducing Douglas Spalding. British Journal for Animal Behaviour, 2, 1. == Birds v. mammals == If we realise that birds are descendants of dinosaurs, and (say) cats are mammals, the we can understand the effects of their births. A bird comes out of the shell ready-made. After an initial feeding that's it as far as the parents are concerned. On the other hand, cats have quite a long period when the mother looks after them. They are initially almost helpless. The role of play is very much another mammalian learning device. On the other hand, birds do not learn to fly. They fly when their anatomy is developed. This is what Spalding proved. == References == Category:English biologists Category:1841 births Category:1877 deaths Category:Ethologists",
 "title": "Douglas Spalding"
}