{
 "id": "507349",
 "text": "Universidade Estadual de Londrina (abbreviated UEL; State University of Londrina) is one of the public universities of the State of Paraná, Brazil. UEL was created in 1970, being recognized officially by Federal Ordinance 69.234/71. In 1987 'free teaching' was implemented at the Institution, and in 1991 it gained autonomy from the State. Since the 2005 admission exam, UEL adopted an official system of quotas for black students, as well as quotas for applicants originating from public schools, in order to attend to social and minority support policies. It is located in the city of Londrina, second largest city in the state and fourth largest in the southern region of the country. == Admissions == Students are admitted by an entrance exam, also known as vestibular exam, composed by two steps: *First Phase is composed of 60 multiple-choice questions (Chemistry, Math, Physics, Geography, History and Biology, Philosophy, Sociology, Art History). *Second Phase is performed in two days and consists of 30 questions lenses (first day), and 12 essay questions and the composition (which may be 2 to 6) (the second day). The 30 consist of 20 objective questions related to Portuguese Literature and 10 related to foreign language (English, Spanish or French). The other 12 essay questions (second day), three related themes (can be: Portuguese, Chemistry, Mathematics, Physics, Geography, History and Biology, Philosophy, Sociology, History of Art) with career choice. == Academic career == * Teaching Assistant (Auxiliar de Ensino) - MS-2 (must have a Master degree and be enrolled in the PhD graduation program) * Professor - MS-3 (must have a PhD or equivalent title) * Associate Professor - MS-4 (must have a Livre Docente title or recognition by the academic community) * Professoral Dean - MS-5 (top rank, only MS-5 is allowed to be conducted to main positions in the University such as Director or Rector) == Departments/Programs == * Cabinet of the Rectory * For-rectory of Graduation * For-rectory of Research and Masters degree * For- rectory of Extension * For-rectory of Administration and Finances * For- rectory of Human resources * For-rectory of Planning * Coordenadoria of Selective Processes * Coordenadoria of Communication * City hall of the Academical Campus * Consultantship Auditing Interns * Consultantship of International Relationships == Supplemental Departments == * Historical museum of Londrina * Office of Application of Juridical Subjects * Academical hospital (Hospital Universitário Regional Norte do Paraná) * Odontological and Academical Clinic * School of Application (Colégio de Aplicação - Professor José Aloísio de Aragão) * House of Culture * Veterinary hospital * School Farm * Laboratory of Production of Medicines * Cine Theater Green Gold (Cine teatro Ouro Verde) == University Services and Resources == * Consultantship of Technology of Information * Central Library * Laboratory of Education Technology * Service of Well-being to the Community * Publishing * Educational broadcasting * System of Files == Centers of Study == === Center of Humanities and Languages (CCH) === The Center of Humanities and Languages occupies an area of 9.079,17 m2. The department employs 180 instructors, 50 ancillary employees, and consists of the following sub-faculties: * Department of Modern Foreign Languages (LEM) * Department of Vernacular and Classic Letters (LET) * Department of Philosophy (FIL) * Department of Social sciences (SOC) * Department of History (HIS) === Center of Biological Sciences (CCB) === The Center of Sciences Biological contains 10 departments: * Department of Anatomy * Department of Animal and Vegetable Biology * Department of General Biology * Department of Physiologic Sciences * Department of Pathological Sciences * Department of Foundations of Psychology and Psychoanalysis * Department of Histology * Department of Microbiology * Department of General Psychology and Analysis of the Behavior * Department of Social and Institutional Psychology === Center of Exact Sciences (CCE) === The Center of Exact Sciences has 7 departments: * Department of Biochemistry * Department of Computation * Department of Physics * Department of Geosciences * Department of Mathematics * Department of Applied Mathematics * Department of Chemistry === Center of Applied Social Studies (CESA) === The Center of Applied Social Studies has 6 departments: * Department of Administration * Department of Accounting Sciences * Department of Private Law * Department of Public Law * Department of Economic Science * Department of Social Service === Center of Health Sciences (CCS) === The Center of Health Sciences has 11 departments: * Department of Surgical Clinic * Department of Medical Clinic * Department of Nursing * Department of Physiotherapy * Department of Gynecology and Obstetrics * Department of Maternal-infantile and Community Health * Department of Oral Medicine and Infantile Dentistry * Department of Restoring Dentistry * Department of Applied Pathology, Legislation and Deontologia * Department of Pediatrics and Pediatric Surgery * Department of Collective Health === Center of Education, Communication and Arts (CECA) === The Center of Education, Communication and Arts are composed of 6 departments: * Department of Visual Art * Department of Sciences of the Information * Department of Communication * Department of Design * Department of Education * Department of Music and Theater === Center of Agrarian Sciences (CCA) === The Center of Agrarian Sciences is composed of 5 departments: * Department of Agronomy * Department of you Practice medicine Veterinary * Department of Preventive Veterinary Medicine * Department of Technology of Foods and Medicines * Department of Zootechny === Center of Technology and Urbanization (CTU) === The Center of Technology and Urbanization is composed of 4 departments: * Department of Architecture and Urbanization * Department of Building site * Department of Electric Engineering * Department of Structures === Center of Physical education and Sports (CEF) === The Center of Physical education and Sports are composed of 3 departments: Department of Sport Science Department of Physical Education Department of Human Movement Studies == Other websites == * Official Page of the State University of Londrina (in Portuguese) * Page about Admissions at the State University of Londrina (in Portuguese) Category:Colleges and universities in Brazil Category:Paraná State Category:1970 establishments Category:1970s establishments in Brazil",
 "title": "State University of Londrina"
}