{
 "id": "50780",
 "text": "A G-string or thong is a narrow piece of cloth or leather, or plastic that passes between the buttocks. It is attached to a band around the hips. It can be worn as a swimwear or underwear by both men and women. The difference between a G-string and a thong is that a G-string has less material between the legs. This makes it look like a string. Variants of the thong or G-string include the \"V-string\" and the \"T-string\". == Origin of the G-string == The G-string or thong is probably the earliest form of clothing known to mankind. It originated in the warmer climates of sub-Saharan Africa where clothing was first worn almost 75,000 years ago. Many tribal peoples, like some of the Khoisan people of southern Africa, wore thongs for many centuries. These early pieces of clothes were made to fit the male genitalia. The G-string was first developed for men by primitive peoples. However, in modern days, Western thongs are usually worn by females. They first became popular in South America in the 1970s. In Brazil, it was originally a style of swimsuit that had a rear area that became so narrow, that it would disappear between the buttocks. The origin of the term \"G-string\" is not fully known. The term was first written about by Americans in the late 1800s. They described the loincloth of Philippine natives. Others say the term came from the G-string on an instrument. The origin of the word \"thong\" is from the Old English thwong, which is a flexible leather cord. ==In other languages== *In Lithuania, the G-string is often called stringai or siaurikės. *In Portugal and Brazil, the G-string is often referred called fio dental. This means \"dental floss\". *In Italy, the G-string is called perizoma. *In Turkey, the G-string is called ipli külot (ipli means \"stringed\" and külot means \"underpants\"). *In French, German and Dutch, the G-string is usually called \"string\", a loanword from English. *In Puerto Rico, a Spanish slang term often used for G-string is gistro. This is most commonly used by Reggaeton artists to refer to the underwear style. *In Argentina and Chile, G-string is widely known as colaless. In those countries, cola means buttocks. Colaless means \"buttocks- less\". *In the Japanese language and in Cantonese, the G-string is widely known as T-back. This is because of its shape when seen from behind. The word is sometimes confused with \"tea bag\". The term T-back is also commonly used in the Philippines. However, there are also several usages of the term \"T-back\" in English as well. These include Children's literature author E.L. Konigsburg's T-backs, T-shirts, Coat and Suit. In other kinds of the Chinese language, the G-string is commonly called dingziku (丁字裤). It means \"character pants\". *In Czech, Estonian, Finnish, German, Hungarian and Spanish the G-string is often called tanga. In Finnish, the plural stringit, \"strings\", is used, as they are pants, not a \"pant\". *In Polish the G-string is usually called stringi, which is a pluralized loanword from English (literally: \"strings\"). *In Australia, only the term G-string is used. Thongs are a type of rubber footwear. *In Hebrew, the G-string is called a hutini, a blend word of the Hebrew word hut (meaning \"string\") and bikini. ==References== Category:Underwear Category:Bottoms (clothing) Category:Swimwear",
 "title": "G-string"
}