{
 "id": "507967",
 "text": "Timothy Eugene Scott (born September 19, 1965) is an American politician. On January 3, 2013, he became the junior U.S. Senator from South Carolina. He was in the U.S. House of Representatives from 2009 to 2013. He is the only African-American senator as of the 115th United States Congress. More specifically, he is the first Republican African-American senator since Edward Brooke, of Massachusetts, in the 1970s. Scott was a candidate for President of the United States in the 2024 election and latest African-American senator to run as president. ==Personal life== Scott was born on September 19, 1965 in North Charleston, South Carolina. He attended Presbyterian College. Scott graduated from Charleston Southern University. In August 2024, Scott married interior designer Mindy Noce. == Political Positions == === Civil Rights === Scott is a Republican, and conservative overall, but has a liberal stance on civil rights for African-Americans. ==== George Floyd Protests ==== Scott criticized President Donald Trump when he controversially tweeted: When the looting starts, the shooting starts. This was about the protests of the death of George Floyd. Scott had spoken out against Floyd's murder. === Environment === Scott was in 2017 one of 22 senators sending a letter to Donald Trump asking him to withdraw from the Paris Agreement. He is a lobbyist for oil/gas/coal interests, having received over $54,000 from them since 2012. ==2024 presidential campaign== In late 2022, it was reported that several United States senators such as John Barrasso, John Cornyn, and Joni Ernst had encouraged Scott to run for President of the United States in the 2024 election. In February 2023, it was reported that Scott was preparing for a presidential run. Two months later in April, he created an exploratory committee to see if he should run for president. On May 19, 2023, Scott officially filed to run for president. Scott ended his campaign on November 12, 2023, due to low poll numbers. ==References== ==Other websites== Category:1965 births Category:Living people Category:African-American politicians Category:2024 United States presidential candidates Category:United States representatives from South Carolina Category:United States senators from South Carolina Category:Republican Party (United States) politicians Category:South Carolina Republicans",
 "title": "Tim Scott"
}