{
 "id": "508089",
 "text": "The National Rifle Association of America (NRA) is an American nonprofit organization. It works for gun rights. It was founded in 1871. The leader changed in 2024 when Wayne LaPierre resigned. He had been the chief executive since 1991. The movie star Charlton Heston was president of the NRA from 1998 to 2003. In the United States, attitudes and thoughts about guns have changed over time, and the NRA changed too. ==Origins== The NRA began after the American Civil War. Leaders of the Union army were upset because the Union recruits could not shoot guns well. They would fire and miss many times, and this wasted ammunition. They started the NRA to teach men how to use guns. For most of the 20th century, the NRA was mostly about teaching people how to use guns. The NRA cooperated with the government. For example, the State of New York helped the NRA buy land and build a gun range. At first, the NRA supported laws limiting gun ownership. It agreed with the government that criminals and the mentally ill should not own guns. When there were many handguns in the United States, the NRA supported laws saying people should need a permit to buy one. When the first automatic guns came out, the NRA supported laws requiring permits for them too. The NRA helped Congress develop the National Firearms Act of 1934, the Gun Control Act of 1938, and other gun laws in the 1960s. ==Political action== In the late 20th century, the NRA began to change. There was civil unrest in the 1960s in America, and President John F. Kennedy was killed with a firearm. Many people began to want guns to protect their own households. In 1971, federal agents from the government's Bureau of Alcohol, Tobacco, and Firearms killed an NRA member because he had illegal guns. In 1975, the NRA started its political lobbying group, the Institute for Legislative Action. Lobbying is when an organization sends lawyers and other people to talk to politicians so they will write laws the organization wants and talk to voters so they will elect politicians who will do what the organization wants. Around this time, the United States Supreme Court made it much easier for organizations to make campaign contributions. Politicians use campaign contribution money to pay for TV ads and posters and other ways of talking to voters. Politicians with lots of campaign contributions have an easier time winning elections. The NRA began fundraising so it could give money to politicians who promised to oppose gun control laws and let people own as many guns as they wanted to buy. Slowly, the NRA became more about politics than about gun education. By 2020, the NRA had become one of the most powerful lobbying organizations in America. The NRA writes \"report cards\" on politicians and sends them to voters, giving the candidates \"grades\" based on how many times they voted for or against gun rights or gun control. The NRA began endorsing, or recommending, presidential candidates with Ronald Reagan in the 1980 United States presidential election. ==2020 lawsuit== In 2020, the Attorney General of New York Letitia James moved to end the NRA. Jones said NRA officials had taken donated money and used it on themselves and given special contracts to their family and friends. American nonprofits are not allowed to do this. If someone donates money to a nonprofit, the nonprofit must use the money the way it promises to use it. In 2024, a jury decided the chief executive Wayne LaPierre and two other executives were corrupt and had used NRA money for themselves. They were ordered to pay $6.5m back to the NRA. He resigned in January 2024. ==References== Category:Non-profit organizations of the United States Category:1871 establishments in the United States Category:Rifle associations",
 "title": "National Rifle Association of America"
}