{
 "id": "508184",
 "text": "How to Eat Fried Worms is an American comedy movie. It was based on the children's book of the same name written by Thomas Rockwell. Parents were warned the movie was \"gross\" but had a worthwhile moral. The movie was rated PG. They also hard to eat worms == Plot == The movie centers around an 11-year-old male friends dare. Billy Forrester has to eat 15 worms in 15 days for $50. == Critical reception == Rotten Tomatoes gave the film a mild 61%. They said only 47% of audiences liked the movie. Gregory Kirschling of Entertainment Weekly gave it a score of 75. He commented \"Worms goes light (but not too light) on the gore and the goo.\" Joanne Kaufman of The Wall Street Journal said \"After the first bit of fish bait is consumed, actually even before, this one-trick movie is a tough slog.\" ==Cast== * Luke Benward as Billy \"Wormboy\" Forrester * Hallie Kate Eisenberg as Erika \"Erk\" Tansy * Adam Hicks as Joe Guire * Tom Cavanagh as Mitch Forrester * Kimberly Williams- Paisley as Helen Forrester * Austin Rogers as Adam * Alexander Gould as Twitch * Ryan Malgarini as Benjamin \"Benjy\" Renfro * Philip Daniel Bolden as Bradley * Clint Howard as Uncle Ed * Ty Panitz as Woody Forrester * James Rebhorn as Principal Nelson \"Boilerhead\" Burdock * Andrew Gillingham as Techno Mouth * Blake Garrett as Plug * Alexander Agate as Donny * Nick Krause as Nigel Guire * Andrea Martin as Mrs. Bommley * David Bewley as Rob Simon * Karen Wacker as Mrs. Simon * Simone White as Woody's teacher ==Awards== Award Category Nominee Result Young Artist Awards 2007 – Young Artist Award Best Young Ensemble in a Feature Film Luke Benward, Hallie Kate Eisenberg, Alexander Gould, Adam Hicks, Ryan Malgarini, Ty Panitz, Philip Bolden, Blake Garrett, Andrew Gillingham, Austin Rogers, Nick Krause, Stephan Bender and Alexander Agate Best Performance in a Feature Film – Supporting Young Actress – Best Family Feature Film (Comedy or Musical) Hallie Kate Eisenberg == References == ==Other websites== * * * * Category:2006 movies Category:American comedy movies",
 "title": "How to Eat Fried Worms (movie)"
}