{
 "id": "508366",
 "text": "The Pontiac Montana was a minivan sold by the Pontiac Motor Division of General Motors. Before the 1999 model year, it was known as The Pontiac Trans Sport. Since 1997, its most popular trim package had been the 'Montana sport package'. It gave the minivan more SUV-like features. In 1999 Pontiac changed the name of the car line to the 'Pontiac Montana'. Pontiac wanted to change to a more sporty performance image. But the change put it in direct competition with the Oldsmobile Silhouette and the Chevrolet Venture. For 2005, the van was redesigned. It had a higher, less aerodynamic nose to resemble an SUV. The Montana name was changed to Montana SV6 in 2006. No more improvements were made to the Montana models after the 2005 model year. Pontiac stopped selling them after the 2006 model year in the United States. They continued to be sold in Canada and Mexico until the 2009 model year. GM discontinued the Pontiac division after the 2010 model year. The Pontiac minivans were General Motors' most popular minivans in Canada. The Doraville, Georgia assembly plant which produced the Montana closed on September 26, 2009. The Montana was replaced by GM's Lambda crossover SUVS . Strangely it wasn't replaced by a Pontiac version of the crossovers. == Model year changes == *1999, name change to Montana. Seven passenger minivan had a 25 mpg EPA rated highway mileage. It was available with front-wheel drive. There are two wheelbase models. The regular wheelbase is and the extended wheelbase version at . *2000, engine upgrade to a 3.4L V6 engine and 26 mpg EPA rated highway mileage. It received a few new options like heated leather seats. *2001, improvements include a new grille, OnStar, and 3rd row flat-folding seats. *2002, models now have 'Versatrak' all-wheel-drive in the extended models. The short wheelbase models still come with front-wheel-drive only. ABS brakes are now standard (except the value trim model). Introduction of a new 'Thunder Sport' package with dual hood scoops, 16-inch wheels and leather seats. *2003, the 'Special Value' model gets some upgrades. The package now has 60/40 split second-row seats and other features standard that were optional before. *2004, drops the 'Special Value' model. Versatrak all-wheel drive is now available on all Montana models. Other new options include MP3 players and XM Satellite Radio. *2005, sees the regular wheelbase models gone. All-wheel-drive is gone and ABS is no longer standard. Only front-wheel drive is available this year. *2006, the SUV-like Montana SV6 is the only model available. It has front-wheel drove or can be ordered with VersaTrack all-wheel drive. A new engine is available on the front-wheel drive models; a 3.9-liter, 240 horsepower (hp) V6. == Safety criticism == A crash test on the 1997-2004 Montana resulted in criticism because of severe damage at the speed of 40 mph (64 km/h). The minivan received a \"Poor\" Rating by the Insurance Institute for Highway Safety (IIHS) some comments made by the IIHS where * Major collapse of the occupant compartment left little survival space for the driver * Extreme steering wheel movement snapped the dummy's head backward. * The unnatural position of the dummy's left foot indicates that an occupant's left leg would have been seriously injured in a real-world crash of this severity. * The forces on the left lower leg were so high that the dummy's metal foot broke off at the ankle. === References === Category:Pontiac automobiles Category:Minivans",
 "title": "Pontiac Montana"
}