{
 "id": "508408",
 "text": "Jessie is an American sitcom that originally aired on Disney Channel from September 30, 2011 to October 16, 2015. The series was created and executive produced by Pamela Eells O'Connell. It stars Debby Ryan, Peyton List, Cameron Boyce, Karan Brar, Skai Jackson and Kevin Chamberlin. In 2013, an Indian adaption of the show was made and it was called Oye Jassie. ==Plot== The series follows Jessie Prescott, a young woman from a small town in Texas. She has big dreams. She moves to New York City to be an actress. She becomes a nanny for the Ross kids: Emma, Luke, Ravi and Zuri. They live in a multi- million dollar penthouse on the Upper West Side. With Bertram the butler, Tony the doorman, and the Ross kids, she has a lot of adventures. ==Production== The show went straight to series. There was no pilot. The show is taped at Hollywood Centre Studios in Los Angeles. Season 4 began production in the summer of 2014 and ended in March 2015. ==Series overview== Season Episodes Originally aired (U.S. dates) First aired Last aired 1 26 2 26 3 26 4 20 ==Cast and characters== * Debby Ryan as Jessie Prescott - the nanny of the crazy Ross kids. * Peyton List as Emma Ross - the older Ross kid, and only the biological child, she loves fashion. * Cameron Boyce as Luke Ross - He was born in Detroit, he is lazy and likes to be cool. * Karan Brar as Ravi Ross - He is from India, smart and he doesn't have freinds. * Skai Jackson as Zuri Ross - Cute and small girl who was brought to NYC from her birth country, Uganda, Africa. * Kevin Chamberlin as Bertram Winkle - The lazy butler, he really works when the Ross parents come home. ==Soundtrack== List of songs in Jessie Title Performer Premiere episode \"Hey Jessie\" Debby Ryan New York, New Nanny \"Hey Jessie and Can't Do It Without You (remix)\" Debby Ryan and Ross Lynch Austin & Jessie & Ally All Star New Year \"Hey Jessie and Hang In There Baby (remix)\" Debby Ryan and Bridgit Mendler Good Luck Jessie: NYC Christmas \"Face to Face\" Debby Ryan and Ross Lynch Austin & Jessie & Ally All Star New Year \"Those Texas Guys\" Debby Ryan One Day Wonders \"Best Year\" Debby Ryan Why Do Foils Fall in Love? \"We're Burning Up\" Jessie J Punch Dumped Love ==Awards and nominations== Year Award Category Nominee(s) Result Source(s) 2012 Young Artist Award Best Performance in a TV Series – Supporting Young Actor Karan Brar 2013 Young Artist Award Best Performance in a TV Series – Supporting Young Actor Karan Brar BAFTA Awards Kid's Vote – Television Jessie 2014 NAACP Image Award Outstanding Performance in a Youth/Children's Program (Series or Special) Karan Brar rowspan=4 2014 Kids' Choice Awards Favorite TV Show Jessie Favorite TV Actress Debby Ryan 2014 Teen Choice Awards Choice TV Actress: Comedy British Academy Children's Awards Kid's Vote – Television Jessie 2015 Young Artist Award Best Supporting Actor in a Television Series JJ. Totah 2015 Kids' Choice Awards Kid's Vote – Television Jessie ==References== ==Other websites== * * * Category:2010s American television series Category:2011 American television series debuts Category:2015 American television series endings Category:American sitcoms Category:Disney Channel television series Category:Manhattan in fiction Category:Television series by Disney Category:Television series set in New York City Category:English- language television programs",
 "title": "Jessie (2011 TV series)"
}