{
 "id": "50869",
 "text": "The House of Lords is one of the two Houses of Parliament of the United Kingdom (UK). It is in London, the capital city of the UK. The other house is the House of Commons. Together, the two houses form the government and parliament of the UK. The House of Lords is not elected (voted for), except in the case of the holders of the seats reserved for hereditary peers (who are chosen by the House or by other hereditary peers in their parties). * 2 people are members because of their job (The Duke of Norfolk, who is the Earl Marshal, and the Marquess of Lord Great Chamberlain, who both help to organise royal events). * 90 people are hereditary peers. These are members of the House of Lords because one of their ancestors was made a member and (since 1999) have been elected from among other such people. * The other members were made members for life, either life peers, who have existed since 1958 or as law lords. Law lords were senior judges made members of the House to help when the House of Lords was also the highest court in England and Wales (before the foundation of the Supreme Court in 2009). * The twenty-six most senior Bishops of the Church of England also sit in the House of Lords, they are called the Lords Spiritual. == Crossbenchers == Many members of the House of Lords sit as Crossbenchers. This means they do not support either the government or opposition parties, but instead are independent of party politics. They got their name because the benches where they sit are placed across the aisle which separates the government and opposition supporters. ==Criticisms== There are several criticisms of the House of Lords, including: * How people are \"appointed\" as lords, which has often been described as undemocratic. The House of Lords is fully unelected and allows peers to hold their seats until death. * The makeup of the Lords does not reflect the diversity of the UK, with under-representation of ethnic minorities and women when compared with the House of Commons, and relative over-representation of people from South East England and people over 50. * The House of Lords is often criticised for being too large, and too expensive. With almost 800 members it is the second- largest house of government in the world, second only to the National People's Congress of China, and is much larger than Upper Houses in comparable countries. These criticisms have led some to question whether there is a need for a second/upper house at all, and whether the two house system in British politics is still useful. People such as Tony Benn and Rebecca Long-Bailey, have said the House of Lords should be gotten rid of. This is also supported by the Scottish National Party (SNP). This would mean the United Kingdom would have one level of government, which is called unicameralism and is present in many other countries. == References == == Other websites == *Parliament UK Category:House of Lords",
 "title": "House of Lords"
}