{
 "id": "50884",
 "text": "Amnesty International (also called AI or AmnestyThe origine of name comes from \"amnesty\" demanding parole movement for political prisoner.) is an international organization founded in London in 1961. They promote human rights in accordance with Universal Declaration of Human Rights and international human rights law. This organization was the recipient of the Nobel Peace Prize in 1977 for its defense of human dignity against torture. It is one of the most widely-known human rights groups in the world. The six key areas that Amnesty International focuses on are refugee rights, the rights of women, children, and of minorities, ending torture, stopping the death penalty, the rights of people imprisoned because of what they believe, and protection of human dignity. == What they believe in == Amnesty International is based on these central ideas: * Every person has human rights. Human rights cannot be taken away from a person. They are natural laws that are the right of all human beings from their birth on. * Human rights cannot be divided. When one right is taken away, this is also bad for other rights. When one right is protected, other rights are in a better position as well. * Human rights will not be protected by governments alone. Governments have said they will protect human rights, and then not acted upon it. Human rights organizations have to influence the governments. * To protect human rights, people must help other people. Danger for human rights starts at the level of single persons. To help one person means to stop the danger from growing. One person alone can do this. * To defend human rights, an organization must be independent and impartial. It should not be for or against any one ideology. An ideology is a certain point of view. It can be political, economic, or religious. Also, the organization should not say one country is the \"worst\". It should focus on the individual and all individuals. == References == == Literature == * Jürgen Wüst: «Imperialistisches Menschenrechtsgeschrei». Der Kampf des MfS gegen die Internationale Gesellschaft für Menschenrechte (IGFM) und Amnesty International (AI), in: Deutschland Archiv, Nr. 3/1998, S. 418—427 == Other websites == * Category:1960s establishments in England Category:1961 establishments in the United Kingdom Category:Capital punishment Category:Charities of the United Kingdom Category:Human rights organisations in the United Kingdom Category:Imprisonment and detention Category:International organizations",
 "title": "Amnesty International"
}