{
 "id": "508970",
 "text": "Hybrid vigour (or hybrid vigor), also known as heterosis in genetics, happens when the child of two different varieties of organism is more fit or vigorous than either of its parents. The causes of this effect are not well known and there are several proposed causes. Heterosis is important to modern agriculture and the production of \"F1 Hybrid cultivars\", which are the first generation of a cross of 2 carefully selected varieties. Despite these varieties being more expensive to produce, the cost is often outweighed by the increased vigour of the variety. By keeping the two parents secret, or by patenting the combination, private crop breeding companies have an easy way to make money off their efforts. A complementary idea, Inbreeding depression, is when an inbred population is less fit and/or less fertile as compared to the individual parents. Some amount of Hybrid Vigour is the result of the suppression of inbreeding depression, but not all. Animal breeders have known about this phenomenon since the 18th century, and Darwin investigated it in detail with plants.Ashby E. 1948. Hybrid vigour. In New Biology 4, 925.Darwin C.D. 1876. The effects of cross and self fertilisation in the vegetable kingdom. London: Murray. On the other hand, when two parents are from widely different populations, such as different closely related species or subspecies, the child may be less fit than either of its parents, known as outbreeding depression. Both effects can occur at the same time, for example, Mules, the hybrid child of a father donkey and mother horse, are infertile due to an inability to evenly split its chromosomes into gamates (Mules have 63 chromosomes, an odd number), but exhibit greater strength and endurance than either parent, making mules completely unfit in the wild but highly valued (arguably \"fit\") in some human societies. When a population is small or inbred, it tends to lose genetic diversity, giving the population a more limited ability to adapt to a changing enviroment through natural selection. This is usually caused either by a population bottleneck or by poor species fitness causing a diminishing population size. Diverse populations as a group generally have more \"potential\" to survive selection events than less diverse populations as there are more phenotypes that may be more fit in the new enviroment compared to the overall population, but this is NOT what is meant by \"Hybrid Vigour\". However, these less diverse populations may express Inbreeding depression, and the mating of one of its members with a member of a different compatible group can reverse this depression, which is an example of hybrid vigour. == Genetic theories == Inbreeding depression was noticed by humans many thousands of years ago, and so already by Darwin's theories of evolution there were attempts to explain the phenomenon, and its complement Hybrid Vigour. The relation between Incest Taboo and awareness of inbreeding depression is controversial. Since Darwins first studies of heterosis and inbreeding in plants, several theories have emerged to explain the effect. * Dominance hypothesis. Less-fit recessive alleles from one parent are suppressed by dominant alleles from the other. Inbred strains will become more homozygous over multiple generations, leading to more recessive less-fit genes present in the population becoming homozygous and being expressed. Even \"inbred\" strains are rarely completely homozygous and total homozygosity may only be achieved after dozens to hundreds of generations if ever. * Overdominance (non-Mendelian) hypothesis. Certain combinations of alleles that can be obtained by crossing two inbred strains are advantageous in the heterozygote by expressing co-dominance (both alleles are expressed), incomplete dominance (each allele is only partially expressed compared to the homozygote) or overdominance (the fitness of a single copy of the allele is superior to that of the homozygote). Cases such as sickle-cell anaemia are a classic example of incomplete dominance in humans. * Epistatic hypothesis. Certain alleles can either mask or complement the expression other alleles located at a different loci in the same region, known as Epistasis. Generalised, this is true of all expressed genes when the overall fitness of the individual is considered, and in the case of hybrid vigour it is true that fitness criteria depend on many different simultaneously expressed or suppressed genes. * Epigenetic hypothesis. An epigenetic heterotic effect has been found in plants, and also in animals. == Present status == Currently, the dominance hypothesis appears to be the major factor relevent to the heterotic effect in Hybrid seed production. Heterosis and Inbreeding depression is still an active area of study today. MicroRNAs (miRNAs) are small non-coding RNAs which repress the translation of messenger RNAs (mRNAs) or degrade mRNAs. The miRNAs may also have an effect on hybrid vigour. == References == Category:Hybrids",
 "title": "Hybrid vigour"
}