{
 "id": "509200",
 "text": "David Perdue (born December 10, 1949) is an American politician and businessman who has been the United States Ambassador to China since 2025. He was the United States Senator from Georgia from January 3, 2015 until January 3, 2021. He is a member of the U.S. Republican Party. Before becoming Senator, he was the CEO of Dollar General. ==Early life== Perdue was born on December 10, 1949 in Macon, Georgia. The Perdue family had been wealthy in Georgia for some time, owning land and slaves during the 19th century. Perdue graduated from the Georgia Institute of Technology. ==U.S. Senate== Perdue first ran for the U.S. Senate in 2014, defeating Democratic nominee Michelle Nunn, daughter of former U.S. senator Sam Nunn. During his time in the senate, Perdue was connected to the 2020 congressional insider trading scandal for allegations of STOCK Act violations. He was said to have sold some stocks before the 2020 stock market crash by using knowledge from a closed Senate meeting. The U.S. Department of Justice closed its inquiry in mid-2020 without bringing charges. He ran for re-election in 2020 against Democratic candidate Jon Ossoff. As neither candidate received more than 50% of the vote in the November 3 election, they face each other on the January 5, 2021 runoff election where Perdue lost to Ossoff. After the November 2020 presidential election, Perdue called for the resignation of Georgia's top elections official and claimed that there was fraud in the election. He later supported a lawsuit by Trump allies trying to overturn the election results, and falsely claimed during his 2022 gubernatorial election campaign that his 2020 Senate election was \"stolen.\" ==Post-Senate career== In February 2021 a month after losing to Warnock, Perdue filled to run against him in the 2022 election. However, a week later he announced that he would not run for the senate. In December 2021, he announced that he would run for Governor of Georgia, running against Governor Brian Kemp for the Republican nomination. He lost the Republican nomination to Kemp in May 2022. ==U.S. Ambassador to China== In December 2024, Trump named Perdue as his nominee for United States Ambassador to China for his second administration. His hearing was held at the United States Senate Committee on Foreign Relations on April 3, 2025. During the hearing, Purdue stated the \"two countries will naturally have areas of disagreement\" and \"we should seek areas where our interests align to develop a better and safer working relationship.\" On April 29, 2025, the United States Senate confirmed him with a vote of 67 to 29. ==Personal life== Perdue married Bonnie Dunn in 1972. They have two children. His cousin Sonny Perdue was the United States Secretary of Agriculture. ==References== ==Other websites== * David Perdue, U.S. Senator for Georgia, Home Page Category:1949 births Category:Living people Category:United States senators from Georgia Category:Republican Party (United States) politicians Category:Businesspeople from Georgia (U.S. state) Category:20th-century American people Category:21st-century American politicians Category:American Christians Category:American chief executives Category:People from Macon, Georgia Category:Ambassadors of the United States to China",
 "title": "David Perdue"
}