{
 "id": "50958",
 "text": "The My Lai Massacre (pronounced IPA: [mi.˧˩˥'lɐːj˧˧], Thảm sát Mỹ Lai, Thảm sát Sơn Mỹ) was the killing of hundreds of civilians by United States soldiers at the village of My Lai, Vietnam on March 16, 1968. A memorial in My Lai lists the names of 504 victims. Before the massacre, U.S. soldiers were told that all of the \"true\" civilians would be at the market and the remaining people would be members of the National Front for the Liberation of South Vietnam. When the soldiers got to the village they did not find any NLF troops. Despite this, many soldiers began to kill the villagers, mainly elderly people, women, and children. The crew of a U.S. Army helicopter, intervened. That crew saved the lives of some of the (Vietnamese) civilians. They were able to save 11 people. The killings were covered up by the United States Army, but eventually 26 soldiers were charged with being involved in the killings. However, only one, Lieutenant William Calley was found guilty. The massacre caused public opinion in the United States to shift further towards wanting peace and wanting to get American soldiers out of Vietnam. ==The intervention by the crew from a U.S. Army helicopter == The crew of a U.S. Army helicopter, intervened. That crew saved the lives of some of the (Vietnamese) civilians. The pilot of the helicopter, Warrant Officer Hugh Thompson Jr., saw dead and wounded civilians as he was flying over the village of Sơn Mỹ. The helicopter was providing close-air support for U.S. soldiers (on the ground). The crew used two-way radio to call for help for the wounded civilians. The crew landed their helicopter next to a ditch, which they saw was full of bodies. They could see movement by survivors (in the ditch). Thompson spoke with two (American) soldiers next to the ditch. When Thompson was lifting-off with the helicopter, he saw that Sergeant Mitchell was shooting into the ditch. Thompson and his crew were witnesses to an unarmed woman being kicked and shot (, up close or) at point-blank range by officer Medina. Medina later claimed that he thought she had a hand grenade. Thompson then saw a group of civilians at a bunker, and soldiers were moving towards the civilians. Thompson landed, and told his crew that if the soldiers shot at the villagers while he was trying to get them out of the bunker, then his crew was to open fire on the soldiers. Years after the event, the crew of the U.S. Army helicopter were awarded the Soldier's medal for bravery. This is the highest award for a soldier who doesn't have contact with the enemy. The three were Hugh Thompson Jr., Glenn Andreotta, and Lawrence Colburn. Andreotta received it posthumously. He died in the Vietnam war. Category:Massacres in Asia Category:Vietnam War Category:War crimes",
 "title": "My Lai Massacre"
}