{
 "id": "509767",
 "text": "The Pschent was the name of the Double Crown of Ancient Egypt. The Ancient Egyptians called it sekhemti meaning the Two Powerful Ones.Griffith, Francis Llewellyn, A Collection of Hieroglyphs: A Contribution to the History of Egyptian Writing, the Egypt Exploration Fund 1898, p.56 The Pschent was made from the Red Deshret Crown of Lower Egypt and the White Hedjet Crown of Upper Egypt. The Pschent was a symbol of the pharaoh's power over all Egypt.Dunand, Françoise; Christiane Zivie-Coche, Gods and Men in Egypt: 3000 BCE to 395 CE, Cornell University Press 2004, pp.32f. The design used two animals, a cobra and a vulture. The Egyptian cobra, known as the uraeus, ready to strike, was a symbol for the Lower Egyptian goddess Wadjet. The Egyptian vulture was a symbol for the Upper Egyptian goddess Nekhbet. These were placed on the front of the Pschent and called the Two Ladies. ==History== The First Dynasty pharaoh Menes is said to have invented the Pschent. The first pharoah to be shown wearing the Double Crown was Djet, in a rock inscription showing his Horus wearing it.Wilkinson, Toby A. H., Early Dynastic Egypt, Routledge 1999, p.196 The list of kings on the Palermo Stone shows the Lower Egyptian pharaohs wearing the Red Crown. After Egypt is unified, the list shows all First Dynasty and later pharaohs wearing the Pschent.Fage, John Donnelly; Desmond J. Clark, Roland Anthony Oliver, A. D. Roberts, The Cambridge History of Africa\", Cambridge University Press 1974, p.521 But the Cairo fragment, shows Lower Egyptian rulers wearing the Pschent.Kemp, Barry John, Ancient Egypt: Anatomy Of A Civilization, Routledge 2006, p.92 ==Archaeology== None of the Egyptian crowns have survived (or been found yet). Like the Deshret and the Hedjet Crowns, the Pschent is known only from statues, paintings, inscriptions, and ancient stories. ==Mythology== Among the gods shown wearing the Double Crown are HorusZandee, Jan, Studies in Egyptian Religion: Dedicated to Professor Jan Zandee, Brill 1982, p.74 and Atum. These both represented the pharaoh or had a special relationship to the pharaoh.The New Encyclopaedia Britannica, Encyclopaedia Britannica, Inc. 2005, p. 689 Image:Statuette of Horus as a falcon-E 10659-IMG 0529-gradient.jpg|Horus falcon with Double Crown Image:RamessesIV-SmitingHisEnemiesOnAnOstracon MuseumOfFineArtsBoston.png|Ramesses IV wearing a pschent File:Granite head of Amenhotep III.jpg|Statue of Amenhotep III wearing a pschent ==References== Category:Ancient Egypt",
 "title": "Pschent"
}