{
 "id": "509752",
 "text": "In economics, the price elasticity of demand (PED or Ed) is a measure to show the responsiveness (or elasticity) of the quantity demanded for a good or service to a change in its price, ceteris paribus (\"all other things being equal\"). It is also known as the percentage change in quantity demanded for a good or service for a percentage change in the price of the same good or service. In short, the price elasticity of demand is given by the following formula: Price\\ elasticity\\ of\\ demand = \\frac {Percentage\\ change\\ in\\ quantity\\ demanded}{Percentage\\ change\\ in\\ price} As the price and the quantity demanded of a good are inversely related (i.e. an increase in price will always cause a decrease in quantity demanded and vice versa), the sign of PED is always negative. Hence, economists tend to just ignore the sign and compare the absolute values instead. In absolute terms, if the percentage change in the price is more than proportionate than the percentage change in the quantity demanded, the elasticity value is greater than one and the demand for the good is price elastic. Likewise, if the percentage change in the price is less than proportionate than the percentage change in the quantity demanded, the elasticity value is smaller than one and the demand for the good is price inelastic. In diagrams, the price elasticity of demand is shown by the gradient of the demand curve. A steeper curve refers to a more price inelastic demand whereas a gentler curve refers to a more price elastic demand. == Factors affecting price elasticity of demand == Factors that affect the price elasticity of demand for a good include: * Availability of substitutes: When substitutes of a good is more available, consumers would be able to choose between the different types of goods available. Hence, a good with more substitutes available would be more price elastic as an increase in price would cause many consumers to change to one of the substitutes. * Closeness of substitutes: If the substitutes of a good is very similar to the original good, consumers are able to change between the different types of goods easily as it makes no difference in using either good. For example, the demand for a specific brand of sugar is likely to be price elastic as the taste of sugar is largely the same for different types of brands. Hence, a good with more similar substitutes would be more price elastic than one with less similar substitutes. * Degree of necessity: When a good has a high degree of necessity (i.e. the good is more of a need than a want), a change in the price would not have much difference in the quantity demanded for the good, thus having a price inelastic demand. For example, the demand for necessities like food would be more price inelastic compared to the demand for luxuries such as jewellery as consumers are more likely to reduce their demand for luxuries than for necessities. However, goods that are addictive (such as cigarettes and drugs) would be considered as necessities by addicts, thus causing them to have price inelastic demands. * Proportion of income: If a large part of income is used to buy the good, it would have a more price elastic demand. As the percentage change in the price of an expensive good would cause a large change in the absolute cost of buying the good, consumers would thus prefer to find for a cheaper substitute for expensive goods than for cheaper goods. Hence, the demand for expensive goods would tend to be more price elastic. * Time period: Over time, the demand for goods would tend to become more price elastic. For example, when the prices of oil increases, the quantity demanded for oil would not fall by a lot in the beginning, but in the long run, consumers would tend to change to more fuel efficient cars or cut down their travelling. * Advertising: Promotional or persuasive advertising may make demand price inelastic as consumers may be made to buy a good at a high price. Category:Commerce",
 "title": "Price elasticity of demand"
}