{
 "id": "509793",
 "text": "Armando Christian Pérez (born January 15, 1981), better known by his stage name Pitbull (also known as Mr. 305 and Mr. Worldwide), is an American rapper, singer and actor. He was born in Miami, Florida, to parents who are Cuban. In 2002, he was featured on the album \"Big Men\" by Lil Jon. In 2004, he released his first album M.I.A.M.I. under TVT Records. Pitbull later released his second album, El Mariel, in 2006. His third album, The Boatlift, followed in 2007. His fourth album, Rebelution (2009), included the hit single \"I Know You Want Me (Calle Ocho)\". It was his first internationally popular song. \"I Know You Want Me\" peaked at number two on the Billboard Hot 100. == Product Endorsement == In 2012, Pitbull was in an advertising campaign with Walmart. The advertising campaign would have Pitbull visit, and put on a show, in the location of the Walmart store that received the most Facebook \"likes\" from June 18 to July 15, 2012, . An online campaign entitled \"#exilepitbull\" started by journalist David Thorpe of The Boston Phoenix, The Big Hurt: Help us help Wal-Mart exile Pitbull to Alaska – Big Hurt. The Phoenix (July 11, 2012). Retrieved on July 11, 2013. and Jon Hendren, writer for the comedy website SomethingAwful.com. The campaign urged people to vote for a remote location, this location being Kodiak, Alaska. In an email to the Associated Press, Walmart confirmed that Kodiak was the winning location. Walmart did not go ahead with the visit, regardless Pitbull decided to visit Kodiak and thier Walmart on July 30. He did a performance for the city, and received a key to the city from Mayor Patricia Branson. David Thorpe, who had started the \"#exilepitbull\" campaign, was invited to attend, and showed up. ==Discography== * M.I.A.M.I. (2004) * El Mariel (2006) * The Boatlift (2007) * Pitbull Starring in Rebelution (2009) * Armando (2010) * Planet Pit (2011) * Global Warming (2012) * Globalization (2014) * Dale (2015) * Climate Change (2017) * Libertad 548 (2019) * Trackhouse (2023) ==Concert tours== * 2009–2011: Rebelution Tour * 2012: Planet Pit World Tour * 2013: North American Tour 2013 (with Kesha) * 2015: Pitbull Live in Hong Kong * 2016: The Bad Man Tour (with Prince Royce and Farruko) * 2017: Enrique Iglesias and Pitbull Live! (with Enrique Iglesias) * 2021: I Feel Good Tour (with Iggy Azalea) * 2022: Can't Stop Us Now Tour (with Iggy Azalea and Sean Paul) * 2023: The Trilogy Tour (with Enrique Iglesias and Ricky Martin) * 2024: The Trilogy Tour 'The Party Continues' (with Enrique Iglesias and Ricky Martin) * 2024: Party After Dark Tour ===Opening act=== * 2014–2015: Enrique Iglesias – Sex and Love Tour * 2018: Britney Spears – Piece of Me Tour ===Residencies=== * 2015–2019: Pitbull: Time of Our Lives * 2020 PPD: Pitbull: Get Ready Vegas ===LiveXLive Virtual Concert Series=== * 2020: Pitbull: Live & Timeless ==Filmography== ===Film=== Year Film Role Notes 2012 La Gasolina: Reggaeton Explosion Himself Documentary 2012 Blood Money Feature film directed by Gregory McQualter 2013 Epic Bufo Voice 2019 UglyDolls Ugly Dog Voice (original English and Spanish dubs) 2021 Get Ready - Trackhouse Documentary Team Owner Documentary ===Television=== Year Title Role Notes 2006 South Beach Himself 2 episodes 2007 Punk'd Episode: \"Episode #8.7\" 2007–2008 La Esquina 2 episodes; executive producer and writer 2010 When I Was 17 1 episode; with Vanessa Minnillo & Chris Paul 2012 Shark Tank Special guest star 2012–2019 Dancing with the Stars 6 episodes; Guest Judge and Musical guest 2014–2017 Pitbull's New Year's Revolution TV special; Host 2015 Empire Episode: \"Fires of Heaven\" 2023 Superfan 1 episode; Musical guest ==Awards and nominations== == References == ==Other websites== * * Pitbull on Vevo * Pitbull on YouTube * Pitbull on Spotify * Category:1981 births Category:Living people Category:21st-century American singer-songwriters Category:21st-century American rappers Category:American hip hop singers Category:American pop singers Category:American reggae musicians Category:Cuban musicians Category:American Grammy Award winners Category:Latin Grammy Award winners Category:American pop rappers Category:Rappers from Florida Category:Singers from Miami",
 "title": "Pitbull (rapper)"
}