{
 "id": "51037",
 "text": "Statistics Capital: Holguín Area: 9,292.83 km² Inhabitants: 1,021,321 Population Density: 109.90 per km² Map Holguín is one of the provinces of Cuba, the second most populous after Ciudad de la Habana. It lies in the southeast of the country. Its major cities include Holguín (the capital), Banes, Antilla, Mayarí, and Moa. The province has a population of slightly over one million people. Its territory extends over more than 9300 km², 25 percent of which are covered by forest. == History == Christopher Columbus landed in what is believed to have been today's Holguín province on October 27, 1492. He declared that it was \"the most beautiful country human eyes had ever seen\". The Holguín province was established in 1978, when it was split from the Oriente region. == Illustrious Sons == General Calixto García (1839-1898), 19th century patriot. Wars of independence from Spain. Fulgencio Batista (1901–1973), General, President, Dictator of Cuba. Commander in Chief Fidel Castro (1926–2016), lawyer, revolutionary, ex- President of Cuba. Army General Raúl Castro (1931), minister of the Revolutionary Army Forces, Vice-President and President of Cuba. == Economy == Like much of Cuba, Holguín's economy is based around sugarcane, though mining, corn and coffee are also large earners for the province. At Moa, there is a huge cobalt processing plant with shipping facilities, that was constructed with the help of foreign aid , much of it from Canada. There are chrome, nickel, iron and steel plants dotted throughout the province as well. Tourism has only recently begun to be experimented with by the Fidel Castro government, and in Holguín, there are numerous hotels around the Guardalavaca area. == Municipalities == Holguín is divided into 14 municipalities: # Antilla # Báguanos # Banes # Cacocum # Buenaventura # Cueto # Frank País (Cayo Mambí) # Gibara # Holguín # Mayarí # Moa # Rafael Freyre # Sagua de Tánamo # Urbano Noris == Other websites == * Holguín.cu * Holguín Hotels Category:Provinces of Cuba Category:1978 establishments in North America Category:20th-century establishments in Cuba",
 "title": "Holguín Province"
}