{
 "id": "510385",
 "text": "Bełżec (, in ), was a Nazi extermination camp (a death camp) during the Holocaust. It operated during World War II, from to the end of . In those eight months, around 450,000 Jews were murdered at the camp by the Schutzstaffel (SS), the Nazis' paramilitary organization. The SS also killed an unknown number of Christian Poles and Roma people at Bełżec. Bełżec was the first Nazi camp that used permanent gas chambers to kill prisoners. == History == As part of Adolf Hitler's \"Final Solution\", the Nazis made plans to kill every one of Europe's 11 million Jews.Michael Bryant, Eyewitness to Genocide: The Operation Reinhard Death Camp Trials, 1955-1966 (Knoxville: The University of Tennessee Press, 2014), pp. 1—4 In 1941 they created the first death camp at Chelmno in Poland. It was a killing center designed to mass-murder Jews. Then, in 1942, the Nazis launched Operation Reinhard. This was a plan to kill every Jew in the General Government (a part of German-occupied Poland) - around 2 million people. The plan called for three more killing centers to be built. Bełżec was the first new death camp the Nazis built. == Location == The camp was located in the village of Bełżec in German-occupied Poland. It was about south of the local railroad station, which made it easy to transport large numbers of deported Jews there. == Legacy == Only seven Jews who worked as slave laborers in Bełżec's Sonderkommando survived World War II. Just one of them submitted postwar testimony officially. Because there are so few witnesses who can testify about the camp's operation, very little is known about Bełżec. ==Notable people== * Elsa Binder ( 1920 1942), a Polish-born Jewish diarist, may have lived and died at Bełżec == Related pages == * Extermination camps * Nazi concentration camps * Nazi Germany * The Final Solution * The Holocaust * Antisemitism == References == Category:Nazi concentration camps in Poland Category:1942 in Europe Category:1940s in Germany Category:1940s in Poland",
 "title": "Bełżec extermination camp"
}