{
 "id": "510508",
 "text": "Universal Parks & Resorts is the theme park division of NBCUniversal (a subsidiary of Comcast).Lieberman, David. \"Comcast Completes Acquisition Of GE’s 49% Stake In NBCUniversal.\" Deadline.com (March 19, 2013) The division is responsible for the operation and maintenance of Universal theme parks and resort properties around the world. It is best known for attractions that are based on famous pop culture properties (movies, television, literature, cartoons, comics, video games, music, etc.) from Universal Studios and NBC, as well as from other companies. ==Theme parks and resorts== ===Current=== *Universal Studios Hollywood (Los Angeles, United States; wholly owned) **Universal CityWalk *Universal Orlando Resort (Orlando, Florida, United States; wholly owned) **Universal Studios Florida **Islands of Adventure **Universal CityWalk **Wet 'n Wild *Universal Studios Japan (Osaka, Japan licensed to USJ Co., Ltd.) **Universal CityWalk *Universal Studios Singapore (Resorts World Sentosa, Singapore; run by Genting Group) ===Former=== *Universal PortAventura, Salou, Spain (1997–2004) **Costa Caribe Aquatic Park, Salou, Spain (2002–2004) ===Future=== These projects have been announced or are currently under construction. This information may change as the projects move forward. *Universal Studios America, Darien, New York (Opens 2024) *Universal Studios Idaho, Boise, Idaho, United States (Opens 2023) *Universal Studios South Korea, Hwaseong, Gyeonggi-do, South Korea (Put on-hold) *Universal Studios Dubailand, Dubai, United Arab Emirates (Put on-hold) (Broke ground on 2008/No construction since 2009) *Universal Studios Moscow, Moscow, Russia (Put-on-hold, due to economic sanctions against Russia by the U.S.) *Universal Studios Beijing, Beijing, People's Republic of China (Opens 2019) *Universal Studios Michigan, Traverse City, Michigan, United States (Opens 2016) *Universal Studios St. Louis, St. Louis, Missouri, United States (Opens 2020) *Universal Studios Texas, Dallas Texas, United States (Opens 2021) *Universal Studios Canada, Vancouver, British Columbia, Canada (Opens 2019) *Universal Studios New England, Boston, Massachusetts, United States (Opens 2018) *Universal Studios New Jersey, Marlboro Township, New Jersey, United States (Opens 2019) *Universal Studios Las Vegas, Las Vegas, Nevada, United States (Opens 2019) *Volcano Bay, Orlando, Florida, United States (Opens 2017) ==References== Category:Theme park companies",
 "title": "Universal Parks & Resorts"
}