{
 "id": "510531",
 "text": "Marlboro Township, New Jersey is a township of Monmouth County, New Jersey. ==Notable people== People who were born in, residents of, or otherwise closely associated with Marlboro Township include: * Chris Carrino, sports play-by- play announcer.Davis, Gayle. \"Calling The Shots\" , livinginmedia.com, June 27, 2008. Accessed July 1, 2010. * Frank Dicopoulos (born 1957), actor (Guiding Light).Event helps conservation foundation raise $150,000 , Atlanticville, October 27, 2005. \"Frank Dicopoulos, a Marlboro resident who for 19 years has played Frank Cooper on the soap opera \"The Guiding Light,\" also attended the event.\" * Max Ehrich (born 1991), actor from High School Musical 3: Senior Year.Rapkin, Mickey. \"Auditioning Round the Campfire\", The New York Times, July 27, 2008. Accessed November 23, 2008. \"And what they want, it seems, is intensity. Max Ehrich, 17, of Marlboro, N.J., spent seven summers at French Woods. In November he will be seen as a principal dancer in the feature film High School Musical 3.\" * Jeff Feuerzeig (born 1964), film screenwriter and director.Falkenstein, Michelle. \"From Maplewood To Sundance\", The New York Times, January 30, 2005. Accessed August 10, 2012. \"In 1988, Daniel Johnston, a songwriter, gave a legendary concert in Pier Platters, an independent Hoboken record store. He had a mental breakdown during the concert and ran amok for two weeks, said Jeff Feuerzeig, who grew up in Hazlet and Morganville and attended Trenton State College.\" * Josh Flitter (born 1994), actor most noted for starring in the movies The Greatest Game Ever Played and Nancy Drew.Israeli, Tali. \"'Greatest Game' is next step in actor's career: Josh Flitter of Marlboro plays key role of caddy in true story of golfer\" , News Transcript, September 28, 2005. Accessed November 9, 2007. \"Hollywood may have found its next child star in Marlboro resident Josh Flitter.\" * Ronald \"Monkey Man\" Filocomo, Bonanno crime family associate, convicted murderer of Bonanno capo Dominick \"Sonny Black\" Napolitano.Charges Target Reputed Soldier In Bonanno Crime Family, New Jersey Attorney General's office press release, dated December 19, 2002 * Garret Hobart (1844–1899), 24th Vice President of the United States.Garret Hobart, Vice Pres. of US - Owing Stone Family , Owingsstone.com. Accessed November 30, 2006. * Mike Kamerman, guitar player for the indie pop band Smallpools.Payne, Chris. \"Smallpools Talks 'Ridiculously Quick' Ascent and 'Dreaming' Single\", Billboard (magazine), July 9, 2013. Accessed January 8, 2015. \"Kamerman and frontman Sean Scanlon -- natives of Marlboro, N.J. and Westchester, N.J., respectively -- have been collaborating since 2007 and playing in various bands.\" * Ellen Karcher (born 1964), New Jersey state senator from 2004 to 2008.Senator Karcher's legislative web page, New Jersey Legislature, copy from Internet Archive dated January 25, 2008. Accessed November 23, 2008. * Dan Klecko (born 1981), NFL Fullback for the Philadelphia Eagles.Dan Klecko, Philadelphia Eagles, backed up by the Internet Archive as of August 28, 2008. Accessed June 12, 2015. * Jeff Kwatinetz (born 1965), Hollywood talent manager.Waxman, Sharon. \"Firm Believer: With His Hollywood Management Company, Jeff Kwatinetz Is Reaching for the Stars\" , The Washington Post, July 8, 2002. Accessed September 9, 2013. \"Kwatinetz was born and raised in Brooklyn, his father an accountant in the garment industry and his mother a homemaker. When Jeff was in third grade, the family, which included a younger brother, moved to Marlboro, N.J.\" * Craig Mazin (born 1971), screenwriter of Scary Movie 3 and Scary Movie 4.Celano, Clare Marie. \"Freehold Hall of Fame inductees to be feted\" , News Transcript, March 3, 2010. Accessed February 5, 2011. \"Screenwriter and author Craig Mazin, a native of Staten Island, N.Y., was 13 when he moved to Marlboro.\" * Idina Menzel (born 1971 as Idina Kim Mentzel), lived in Marlboro from kindergarten to third grade.Staff. \"Intimate Evening with Idina Menzel\", George Street Playhouse, April 2, 2008. Accessed February 6, 2011. \"Last night, Idina Menzel launched her tour at George Street Playhouse promoting her new album \"I Stand.\" In a truly intimate setting, Idina shared stories of growing up as a jewish girl in Marlboro and Somerset and thinks she probably lived in New Brunswick before moving to Long Island.\" * Adam Mesh (born 1975), television reality show contestant on NBC's Average Joe and Average Joe: Adam Returns.'Average Joe' returns for new reality show , News Transcript, August 17, 2005. Accessed September 9, 2013. \"Marlboro native Adam Mesh, who made his mark on NBC’s Average Joe and then starred on his own show Average Joe: Adam Returns, will take part in the Battle of the Network Reality Stars.\" * Jim Nantz (born 1959), sportscaster.Craig, Jack. \"CBS' Nantz a Smoothie from Start\" , Boston Globe, November 11, 1988. Accessed September 9, 2013. \"'It took me one-tenth of a second to answer. My wife and I grew up in Marlboro, New Jersey. We were coming home,' he said. Three years later, Nantz and his wife are living in Westport, Conn.\"Gottlieb, Nat. \"CBS touting Sheridan as sure thing in NCAA studio.\", The Star-Ledger, August 14, 1996. \"In addition to the highly-respected Nantz a Marlboro native who anchors CBS' golf and is lead play-by-play announcer for NCAA basketball Sean McDonough and former Giants defensive back Mike Maycock will form the second team.\" * Kal Penn (born 1977), actor (Harold & Kumar Go to White Castle, House).Amdur, Neil. \"Still in Touch With His Jersey Roots, an Actor Mines His Talent\", The New York Times, March 18, 2007. Accessed July 30, 2008. * Melissa Rauch (born 1980), actress (The Big Bang Theory, Best Week Ever).Sommers, Michael. \"Fringe characters - Four with Jersey attitudes aim to amuse festival audiences\", The Star-Ledger, August 12, 2005.Considine, Bob. \"Take Five with melissa Rauch\", The Star- Ledger/Inside Jersey, May 2011. Accessed December 5, 2012. \"2. Growing up in Marlboro, did you know from an early age that you wanted to go into comedy and comedic acting? [A.] Marlboro was a great place to grow up!\" * Tony Reali (born 1978), television personality and host (Around the Horn).Toni Reali, Athlete Promotions. Accessed December 5, 2012. \"He is a Marlboro Township, New Jersey native and graduated from Christian Brothers Academy in Lincroft, New Jersey.\" * Howie Roseman (born 1975), General Manager of the Philadelphia Eagles.Schwartz, Andy. \"Fulfilled: For Eagles' Roseman, Persistence Paid Off\" , Comcast SportsNet Philadelphia, January 29, 2010. Accessed February 6, 2011. \"A native of Marlboro, N.J., Roseman didn't send letters to only the Eagles and Jets.\" * David Stone (born 1966), Broadway producer (Wicked and The 25th Annual Putnam County Spelling Bee).Grossman, Gary. \"A 'Wicked' journey through the land of Oz\", South Jersey Life, July 22, 2007. Accessed August 12, 2011. \"Stone -- a native of Marlboro in central New Jersey -- learned theater at one of the most unlikely of theater schools -- the University of Pennsylvania.\" * Felicia Stoler, host of TLC's Honey, We're Killing the Kids.Tesoriero, Tobi Drucker. 'Felicia Stoler: Spreading Health With A Little TLC\" , living Marlboro, July 1, 2007. Accessed November 15, 2008. \"Stoler calls both Holmdel and Marlboro home. She grew up in Marlboro, where she attended the Delfino (Central School), Marlboro Middle School, and Marlboro High School (her family still owns a home in town). Now she, along with her 9-year-old daughter Isabella and 6-year- old son Zachary, live in Holmdel.\" * Paul Wesley, actor (The Vampire Diaries).Morton, Rebecca. \"'Vampire Diaries' to give Marlboro native star turn\" , Sentinel, September 10, 2009. Accessed August 11, 2014. \"You never know what to expect as an actor, but Marlboro native Paul Wesley can expect to have audiences watching him on the CW's The Vampire Diaries on Thursdays this fall.\" ==References== ==Other websitess== * Marlboro Township official website Category:Townships in New Jersey Category:Monmouth County, New Jersey",
 "title": "Marlboro Township, New Jersey"
}