{
 "id": "510598",
 "text": "Melanija Knavs Trump (born April 26, 1970) is a Slovenian-American former model serving as the first lady of the United States since 2025 as the wife of President Donald Trump. She was the first lady from 2017 to 2021 during her husband's first presidency. She is the second woman since Frances Cleveland to serve two-nonconsecutive terms as first lady. Melania grew up in Slovenia (then Yugoslavia). She worked as a fashion model through agencies in the European fashion capitals of Milan and Paris. She moved to New York City in 1996. She was associated with Irene Marie Models and Trump Model Management. In 2005, she married the real estate developer and TV personality Donald Trump and have a son together named Barron, who was born in 2006. Later that year, she became a naturalized American citizen. She is the second immigrant woman after former Louisa Adams and the first non-native English speaker to become first lady. == Biography == === Early life, family and education === Melanija Knavs was born in Novo Mesto, Slovenia on April 26, 1970. Her father, Viktor Knavs was from the nearby town of Radeče. He managed car and motorcycle dealerships for a state-owned vehicle manufacturer. Her mother Amalija Ulčnik Knavs, came from the village of Raka. She worked as a patternmaker at the children's clothing manufacturer Jutranjka in Sevnica. As a child, Knavs and other children of workers at the factory participated in fashion shows that featured children's clothing. She has an older sister, Ines Knauss, who is an artist. She has an older half-brother who she reportedly has never met from her father's previous relationship. When Knavs was a teenager, she moved with her family to a two-story house in Sevnica. As a high-school student, she lived in a high-rise apartment in Ljubljana. She attended the Secondary School of Design and Photography in the city. She studied architecture and design at the University of Ljubljana for one year before she dropped out. === Marriage and family === In September 1998, Melania met real estate mogul Donald Trump at a party. The couple began dating while the latter was in the process of divorcing his second wife, Marla Maples. The divorce was finalized in 1999. In 1999, the couple gained attention after a lewd interview with shock jock Howard Stern on his show. The two became engaged in 2004. On January 22, 2005, they married in an Anglican service at the Episcopal Church of Bethesda-by- the-Sea in Palm Beach, Florida. There was a reception in the ballroom at her husband's Mar-a-Lago estate. On March 20, 2006, she gave birth to their son, Barron William. She chose his middle name and her husband chose his first name. She is also a stepmother to her husband's four children, Donald Jr., Eric, Ivanka and Tiffany. When Melania and her husband visited Vatican City in May 2017, she identified as Roman Catholic. She was the first Roman Catholic to live in the White House since John F. Kennedy. She is the second Roman Catholic first lady after Jacqueline Kennedy. === 2016 presidential election === In 2016, Trump told CNN her focus as first lady would be to help women and children. She also said she would combat cyberbullying, especially among children. On July 18, 2016, Trump gave a speech at the 2016 Republican National Convention. Trump was later accused of plagiarizing Michelle Obama's speech at the 2008 Democratic National Convention. == First lady of the United States (2017–2021) == === First term === Trump became the first lady of the United States when her husband was sworn-in as the 45th U.S. president on January 20, 2017. Melania said that she would not move to Washington, D.C. with him. She instead chose to stay in Manhattan so her son Barron could finish the 2016-2017 school year. This also allowed her to introduce her son to the White House gradually so as not to overwhelm him. Melania was the second foreign-born woman to hold the title of first lady after Louisa Adams, who was born in England, and Melania was the first naturalized citizen to hold the title. She has said that she can speak English, Italian, French, and German in addition to her native Slovene, but in public she has only spoken English and Slovene. She is also the first Slovene-American first lady in U.S. history On March 8, 2017, Melania hosted her first White House event, a luncheon for International Women's Day. She spoke to an audience of women about her life as a female immigrant and about working towards gender equality both domestic and abroad, noting the role of education as a tool against gender inequality. The Trumps visited Vatican City in May 2017. As Melania was visiting as a Roman Catholic, Pope Francis blessed her rosary beads, and she placed flowers at the feet of a statue of the Madonna at the Vatican's Bambino Gesù children's hospital. Melania and her son, Barron, moved into the White House on June 11, 2017. In her first year, Melania gave only eight speeches, compared to 74 by Michelle Obama and 42 by Laura Bush. Instead of frequent public appearances, she communicated her activities through video. Most of Melania's appearances as first lady in 2017 were in Manhattan and Washington, and she typically spoke about women's and children's issues. After moving to the White House, Melania opted to spend most of her time in the private quarters, running the White House staff from there instead of the first lady's East Wing offices. She oversaw restorations of several rooms in the building, including the bowling alley in the White House basement and the first lady's hairdresser's room. Barron remained Melania's top priority when she was first lady, and she worked to keep him free from politics to the point that staffers referred to her as \"The Protector\". Even after arriving at the White House, Melania spent extensive time away each year, visiting Mar-a-Lago on major holidays and over many weekends. Melania personally involved herself in decorations and planning within the White House. She was particular about how things were designed and arranged whenever events were planned, but she would take on a calm and relaxed demeanor once the event began. Whenever a foreign dignitary arrived at the White House, Melania had the Blue Room set aside where she ate lunch or drank tea with the spouse. When choosing which presidential china set to use, Melania often chose the Clinton administration china with its gold embroidery. She held events less frequently than her predecessors, with a typical week featuring three or fewer events, all under one hour long. Among her most ambitious projects was planning the White House Christmas decorations in 2018. Moving away from traditional designs, she filled the East Collonnade with red cranberry-laden trees set atop a green carpet. The design was widely derided, which Melania ascribed to personal taste. Trump was the honorary chair of the John F. Kennedy Center for the Performing Arts, Though he was not active in the role. She made her first appearances at the Kennedy Center in 2019. === 2018 Africa tour === In October 2018, Melania took a tour of Africa without Donald, visiting Ghana, Malawi, Kenya and Egypt. She spent much of her time with children in schools, orphanages, and hospitals. She used the trip to tout relief work being carried out by the United States Agency for International Development, which raised questions about her husband's intention to cut its funding. Melania also received criticism for her fashion choices, where a photo opportunity in front of the Great Sphinx of Giza was seen as exploitive and a pith helmet she wore in Kenya was criticized for its association with colonialism in Africa. She responded that people should pay more attention to her actions instead of her outfits. === Be Best campaign === On May 7, 2018, Melania held a press conference in the White House Rose Garden to announce her official public initiative as first lady, the Be Best awareness campaign. The initiative was created to support the welfare of children, advocate against cyberbullying, and prevent opioid abuse. Be Best promoted existing initiatives and organizations that worked toward the cause. Public awareness of the initiative remained low, and it was often regarded as an anti-cyberbullying campaign. The Be Best campaign drew criticism for its perceived hypocrisy, challenging cyberbullying when her husband was well known for attacking people online. Even Donald had warned her before the campaign's launch that the contrast may provoke criticism. She acknowledged the criticism but insisted that she would continue because she felt it was a good cause. === COVID-19 and 2020 presidential election === Melania became an active campaigner for her husband during the 2020 presidential election, which she was seen campaigning more for him than her 2016 activity. When the COVID-19 pandemic began, Melania was criticized for promoting a White House renovation project. She took the topic more seriously after the COVID-19 lockdowns began, using her Twitter account to encourage social distancing during the pandemic and promote official medical advice. When her husband lost the 2020 election, Melania ended her tenure by endorsing his false statement that he had been the actual winner. For her final months in the White House, she stopped visiting her office in the East Wing and remained in the White House residence. Her focus at this time was on compiling photo albums of the decorations and renovations she had overseen through her tenure. Melania was managing photography at the White House when the Capitol attack took place and gave no comment at the time. Her communications director Stephanie Grisham later stated she had sent Melania a text message asking her to make a statement condemning the violence and resigned when that did not happen. On January 18, Melania released a farewell video asking the American people to uphold the principles of her Be Best campaign. She did not contact incoming first lady Jill Biden to make transition arrangements or provide her the traditional tour of the White House, but instead left a letter for the incoming first lady. == First Post- White House activities (2021–2025) == After the Trumps left the White House, Melania returned to Mar-a-Lago. She lived there while avoiding public attention. Melania kept in contact with her successor Jill Biden. The two have shared birthday cards. Trump founded a scholarship program for foster children. In November 2023, Melania attended the memorial service for former First Lady Rosalynn Carter. Melania remained out of public view during her husband's court appearances and his candidacy in the 2024 presidential election. In July 2024, she released a statement after the attempted assassination of her husband and appearing at the 2024 Republican National Convention. She did not speak at the convention, making her the first candidate's spouse not to speak at the convention since Barbara Bush began the tradition. In the same month, Melania announced her plan to publish a memoir, titled Melania. Some Republicans were upset with her before the memoir was released because she announced her support for abortion. == First lady of the United States (2025–present) == === Second term === Trump's husband was elected as president again in the 2024 presidential election. Trump became the first lady of the United States again when her husband was sworn-in as the 47th U.S. president on January 20, 2025. She is the second first lady to be first lady two times non-consecutively, after Frances Cleveland. During the first few days of her second term as first lady, Melania traveled with her husband to parts of North Carolina that were hit by Hurricane Helene in September 2024 and to Southern California to monitor the progress of fire rescue services for the January 2025 Southern California wildfires. In February 2025, she announced that public tours of the White House would reopen at the end of the month. On March 3, 2025, Melania made her first solo appearance as first lady attending a roundtable discussion at Capitol Hill on the \"Take It Down Act\", a bill that could speed the removal of intimate imagery posted online without a person's consent that consisted of revenge porn. == References == == Official websites == *https://www.whitehouse.gov/melania-trump/ *https://melaniatrump.com/ Category:1970 births Category:Trump family Category:Living people Category:Slovenian people Category:American models Category:American Roman Catholics Category:People from New York City Category:American philanthropists Category:American activists Category:First Ladies of the United States Category:Naturalized citizens of the United States",
 "title": "Melania Trump"
}