{
 "id": "510648",
 "text": "This is a list of movies of all of Ronald Reagan's most prominent onscreen acting roles as well as narrating roles. Also, included in this list are some of Reagan's special cameo appearances. He retired from acting so that he could be active in politics. He was elected Governor of California and soon President of the United States. ==Movies== Films of Ronald Reagan Year Title Role Notes/Reference 1937 Love Is on the Air Andy McCaine 1937 Hollywood Hotel Radio announcer (uncredited) voice 1938 Sergeant Murphy Private Dennis Reilley 1938 Swing Your Lady Jack Miller 1938 Accidents Will Happen Eric Gregg 1938 Cowboy from Brooklyn Pat Dunn 1938 The Amazing Dr. Clitterhouse Radio announcer (uncredited) voice 1938 Boy Meets Girl Radio announcer at premiere voice 1938 Girls on Probation Neil Dillon 1938 Brother Rat Dan Crawford Co- starring Jane Wyman 1938 Going Places Jack Withering 1939 Secret Service of the Air Lieutenant \"Brass\" Bancroft First of the Bancroft series 1939 Dark Victory Alec Hamm 1939 Code of the Secret Service Lieutenant \"Brass\" Bancroft Second in Bancroft series 1939 Naughty but Nice Ed \"Eddie\" Clark 1939 Hell's Kitchen Jim Donohue 1939 The Angels Wash Their Faces Deputy District Attorney Patrick \"Pat\" Remson 1939 Smashing the Money Ring Lieutenant \"Brass\" Bancroft Third in the Bancroft series 1939 Sword Fishing Narrator voice; Academy Award Nomination-Best Short 1940 Brother Rat and a Baby Dan Crawford Co-starring Jane Wyman 1940 An Angel from Texas Marty Allen With Jane Wyman 1940 Murder in the Air Lieutenant \"Brass\" Bancroft Fourth film in the Bancroft series 1940 Knute Rockne, All American George \"The Gipper\" Gipp 1940 Tugboat Annie Sails Again Eddie Kent With Jane Wyman 1940 Alice in Movieland Himself (uncredited) 1940 Santa Fe Trail George Armstrong Custer 1941 The Bad Man Gilbert \"Gil\" Jones 1941 Million Dollar Baby Peter \"Pete\" Rowan 1941 International Squadron Jimmy Grant 1941 Nine Lives Are Not Enough Matt Saywer 1942 Recognition of the Japanese Zero Fighter Lt. Saunders Short 1942 Kings Row Drake McHugh Academy Award Nomination-Best Picture 1942 Juke Girl Steve Talbo 1942 Mister Gardenia Jones Gardenia Jones Academy Award Nomination-Best Short 1942 Desperate Journey Johnny Hammond 1942 Beyond the Line of DutyHelfer, Andrew (author), Steve Buccatello (artist), and Joe Station (artist). Ronald Reagan: A Graphic Biography. Hill and Wang. 25. Narrator voice; Academy Award Win-Best Short 1943 Cadet Classification Narrator Short 1943 The Rear Gunner Lieutenant Ames Academy Award Nomination-Best Short 1943 For God and Country Father Michael O'Keefe Short 1943 This Is the Army Cpl. Johnny Jones Academy Award Win- Scoring of a Musical Picture; Academy Award Nomination-Best Sound 1945 Target Tokyo Narrator (voice)\"Target Tokyo .\" Victory in the Pacific. PBS. Accessed October 9, 2008. 1945 The Fight for the Sky Narrator voice; Short 1945 The Stilwell Road Narrator voice 1945 Wings for This Man Narrator voice 1947 Stallion Road Larry Hanrahan 1947 That Hagen Girl Tom Bates 1947 The Voice of the Turtle Sergeant Bill Page Reissued as One for the Book 1949 John Loves Mary John Lawrence 1949 Night Unto Night John Galen 1949 The Girl from Jones Beach Bob Randolph 1949 The Hasty Heart Yank 1949 It's a Great Feeling Cameo 1950 Louisa Harold \"Hal\" Norton 1951 The Big Truth Narrator/Host voice 1951 Storm Warning Burt Rainey 1951 The Last Outpost Captain Vance Britten aka Cavalry Charge 1951 Bedtime for Bonzo Professor Peter Boyd 1952 Hong Kong Jeff Williams 1952 The Winning Team Grover Cleveland Alexander 1952 She's Working Her Way Through College Professor John Palmer 1953 Tropic Zone Dan McCloud 1953 Law and Order Frame Johnson 1954 Prisoner of War Webb Sloane 1954 Cattle Queen of Montana Farrell 1955 Tennessee's Partner Cowpoke 1957 Hellcats of the Navy Commander Casey Abbott Co-starring Nancy Davis 1961 The Young Doctors Narrator voice 1963 Heritage of Splendor Narrator voice; Short 1964 The Killers Jack Browning ==References== ==Other websites== * *\"Life and Times\" , flash presentation chronicles Reagan's Hollywood years, from the Reagan Library *General Electric Theatre \"The Dark, Dark Hours\", rare 1954 video starring Ronald Reagan and James Dean. Edited to 6 minutes in length. *\"Ronald Reagan on TV\" by Billy Ingram, at TVParty.com. *Ronald Reagan at the Internet Archive, collection of television programs Category:Filmographies Category:Ronald Reagan",
 "title": "Ronald Reagan filmography"
}