{
 "id": "510603",
 "text": "Corey Gregg Weinberg (born August 3, 1955), known professionally as Corey Burton, is an American voice actor. He is known as the current voice of Ludwig Von Drake and Captain Hook. He voices many other characters for Disney projects. ==Filmography== ===Film=== Year Title Role Notes 1980 Closet Cases of the Nerd Kind Narrator Short film 1981 Wolfen ESS Voice 1982 The Sword and the Sorcerer Additional Voices The Adventures of Curious George The Man in the Yellow Hat, Additional Voices 1983 Good-bye, Cruel World Additional Voices 1986 Critters Critters (voices) The Great Mouse Detective Thug Guards (voice) The Transformers: The Movie Brawn, Shockwave, Spike Witwicky (voices) Poltergeist II: The Other Side Reverend Henry Kane Uncredited Flight of the Navigator R.A.L.F. (voice) Disney Sing-Along Songs: Zip-a-Dee-Doo-Dah Professor Owl, Bertie Birdbrain (voices) Direct-to-video I Am Joe's Ear Joe's Ear (voice) Castle in the Sky Additional Voices 2003 English dub 1987 Disney Sing-Along Songs: Heigh-Ho Professor Owl, Bertie Birdbrain (voices) Direct-to- video G.I. Joe: The Movie Tomax (voice) Spaceballs Dinks (voices) Uncredited The Brave Little Toaster Rob Amazon Women on the Moon Anchorman Disney Sing- Along Songs: The Bare Necessities Professor Owl, Bertie Birdbrain, Jiminy Cricket (voices) Direct-to-video 1988 Invasion Earth: The Aliens Are Here Alien Voice Disney Sing-Along Songs: You Can Fly! Professor Owl, Ludwig Von Drake, Bertie Birdbrain (voices) Direct-to-video Poltergeist III Reverend Henry Kane Uncredited 1989 Kiki's Delivery Service Radio Announcer (voice) 1998 English dub Disney Sing-Along Songs: Fun with Music Professor Owl, Ludwig Von Drake, Bertie Birdbrain (voices) Direct-to-video Goofy About Health Narrator Wonders of Life General Knowledge, Chicken (voices) Stanley and the Dinosaurs Stanley (voice) 1990 Roller Coaster Rabbit Droopy (voice) Short film Disney Sing-Along Songs: Under the Sea Professor Owl, Ludwig Von Drake, Bertie Birdbrain (voices) Direct-to-video Disney Sing-Along Songs: Disneyland Fun Professor Owl, White Rabbit, Dale, Bertie Birdbrain (voices) Uncredited Direct-to-video Disney Sing-Along Songs: Supercalifragilisticexpialidocious Professor Owl, Ludwig Von Drake, Bertie Birdbrain (voices) Direct-to-video 1992 Disney Sing-Along Songs: Be Our Guest Professor Owl, Bertie Birdbrain (voices) Direct-to-video Aladdin Prince Achmed, Necklace Merchant (voices) 1993 Trail Mix-Up Droopy (voice) Short film Disney Sing-Along Songs: Friend Like Me Professor Owl, Bertie Birdbrain (voices) Direct-to-video 1994 Mickey's Fun Songs: Campout at Walt Disney World Dale (voice) Disney Sing-Along Songs: Circle of Life Professor Owl, Bertie Birdbrain (voices) 1995 A Goofy Movie Wendall (voice) Disney Sing-Along Songs: Colors of the Wind Professor Owl, Ludwig Von Drake, Bertie Birdbrain (voices) Direct-to-video Mickey's Fun Songs: Beach Party at Walt Disney World Dale, Captain Hook, Mr. Smee (voices) 1996 The Best of Roger Rabbit Droopy (voice) Short film The Hunchback of Notre Dame Brutish Guard (voice) Black Mask Commissioner (voice) Disney's Greatest Video, Volume 1 Dale the Chipmunk, Ludwig Von Drake (voices) Direct-to-video Aladdin and the King of Thieves Additional Voices 1997 Hercules Additional Voices Disney Sing-Along Songs: Zero to Hero Professor Owl, Bertie Birdbrain (voices) Direct-to-video 1998 Mulan Additional Voices The Spirit of Mickey Ludwig Von Drake (voice) Disney Sing-Along Songs: Honor to Us All Professor Owl, Bertie Birdbrain (voices) Direct-to-video Skating the Half Pipe Narrator Paracycling Narrator 1999 Hercules: Zero to Hero Zeus (voice) Direct-to-video Dudley Do-Right The Announcer Mickey's Once Upon a Christmas Dale (voice) Direct-to-video Toy Story 2 Woody's Roundup Announcer (voice) 2001 The Trumpet of the Swan Senator (voice) Atlantis: The Lost Empire Gaëtan \"Mole\" Molière (voice) Mickey's Magical Christmas: Snowed in at the House of Mouse Ludwig Von Drake, Gus, Grumpy, Captain Hook, Mad Hatter (voices) Direct-to-video 2002 Return to Never Land Captain Hook (voice) The Wacky Adventures of Ronald McDonald: Have Time, Will Travel Additional Voices Direct-to-video Cinderella II: Dreams Come True Gus, Stable Hand, Mert (voices) Mickey's House of Villains Captain Hook, Chernabog, \"How to\" Narrator, Chief O'Hara (voices) Treasure Planet Onus (voice) 2003 101 Dalmatians II: Patch's London Adventure The Thunderbolt Adventure Hour Narrator Direct-to-video Atlantis: Milo's Return Gaëtan \"Mole\" Molière (voice) Stitch! The Movie Hawaiian Man (voice) 2004 The Lion King 1½ Grumpy (voice) Mickey's Twice Upon a Christmas Elf #4 (voice) Direct-to-video The Incredibles Phylange (voice) The SpongeBob SquarePants Movie King Neptune's Guards (voice) 2005 Tom and Jerry: Blast Off to Mars Additional Voices Direct-to-video 2006 Asterix and the Vikings Doublehelix (voice) English dub 2007 Cinderella III: A Twist in Time Gus (voice) Direct-to-video Planet Terror Additional Narrator Disney Princess Enchanted Tales: Follow Your Dreams King Stefan (voice) Direct-to-video How to Hook Up Your Home Theater Narrator 2008 Justice League: The New Frontier Abin Sur, Ray Palmer (voices) Direct-to-video Batman: Gotham Knight The Scarecrow, Ronald Marshall, Yuri Dimitrov (voices) Starship Troopers 3: Marauder Official Voice Star Wars: The Clone Wars Whorm Loathsom, Ziro the Hutt, Kronos-327 (voices) 2009 Superman/Batman: Public Enemies Captain Marvel, Solomon Grundy (voices) Direct-to-video The Princess and the Frog Mr. Harvey Fenner (voice) 2010 The A-Team Narrator 2012 Hotel Transylvania Mr. Bigfoot (voice) Goodnight Mr. Foot Mr. Bigfoot (voice) Short film Partysaurus Rex Captain Suds (voice) 2013 Zambezia Neville (voice) Machete Kills Trailer Voice Guy I Know That Voice Himself Documentary 2014 JLA Adventures: Trapped in Time Captain Cold, Time Trapper (voices) Direct-to-video Scooby-Doo! WrestleMania Mystery Bayard, Announcer (voices) Scooby-Doo! Frankencreepy Baron Basil, Ghost of the Baron (voices) Rocky and Bullwinkle Snidely Whiplash, Mayor (voices) Short film 2018 Ralph Breaks the Internet Grumpy (voice) 2019 Once Upon a Time in Hollywood Bounty Law Promo Announcer ===Television=== Year Title Role Notes 1984–1987 The Transformers Brawn, Shockwave, Sunstreaker, Spike Witwicky, Alpha Trion, Quintesson Scientist Mara Al Utha, Wideload, Sluxxoid, Dion, Additional Voices 1985 Robotix Tauron, Goon, Kanawk 1985–1986 G.I. Joe: A Real American Hero Tomax, Lt. Clay Moore, Owen Van Mark, Gerky Potemkin 1986 DTV Valentine Gruffi Gummi 1986–1991 Disney's Adventures of the Gummi Bears Gruffi Gummi, Toadwart, Additional Voices Replaced Bill Scott in Season 2 1987–1989 DuckTales Ludwig Von Drake, Phil Barker, Additional Voices Episode: \"The Golden Fleecing\" Episode: \"Dime Enough for Luck\" Episode: \"Yuppy Ducks\" 1989–1990 Chip 'n Dale Rescue Rangers Dale, Zipper, Mole, Snout, Additional Voices 1990 The Magical World of Disney Ludwig Von Drake Episode: \"A DuckTales Valentine\" 1991 James Bond Jr. James Bond Jr. 1992 Goof Troop 'How to' Narrator, Circus Ringmaster Raw Toonage Ludwig Von Drake, Captain Hook Episode: \"Spatula Party/Doggie Schnauzer/Marsupilami Meets Dr. Normanstein\" Episode: \"Sheerluck Bonkers/All Potato Network/The Puck Stops Here\" 1993–1994 Bonkers Felix, Osiris 1993–1994 Mighty Max Ludwig Von Drake, Mad Hatter, Additional Voices 1995–1999 The Lion King's Timon & Pumbaa Quint, Speedy the Snail, Fronk, Creepy Fortune Teller 1995–1996 Phantom 2040 Kit Walker, 23rd Phantom, Biot, Security Biot, 20th Phantom, Thin Man 1996 Quack Pack Ludwig Von Drake 1996–1998 Superman: The Animated Series Brainiac, Binko, Stand Owner, Tribunal, Additional Voices 1997 Freakazoid! Invisibo Episode: \"Normadeus\" 1998–1999 Disney's Hercules: The Animated Series Zeus 1999–2001 Batman Beyond Istivan Hegedesh, Vilmos Egans, Barge Captain, Captain, Kobra Op 1 1999–2001 Mickey Mouse Works Ludwig Von Drake, J. Audubon Woodlore, Chief O'Hara, Narrator 1999 Boo Boo Runs Wild Ranger Smith, Moose A Day in the Life of Ranger Smith Ranger Smith 2001–2002 Disney's House of Mouse Ludwig Von Drake, J. Audubon Woodlore, Grumpy, Timothy Mouse, Cards, Tweedledee and Tweedledum, White Rabbit, Mad Hatter, Captain Hook, Maurice, Zeus, Chernabog, Female Von Drake, Doorknob, Santa Claus, Caterpillar 2001–2003 Justice League Brainiac, Forager, Metallo, Toyman, Weather Wizard 2002 Samurai Jack Monk #1, Goatman Episode: \"Jack and the Monks\" 2003 Static Shock Brainiac Episode: \"A League of Their Own: Part 1\" Episode: \"A League of Their Own: Part 2\" 2003–2005 Star Wars: Clone Wars Count Dooku, San Hill, Warrior 2 2005 Duck Dodgers Martian Commander Z-9 Episode: \"Of Course You Know, This Means War and Peace: Part 1\" Episode: \"Of Course You Know, This Means War and Peace: Part 2\" 2005–2006 Justice League Unlimited Brainiac, Key, Sonar (Bito Wladon) ,Toyman (Winslow Percival Schott), Weather Wizard (Mark Mardon) 2006–2015 Mickey Mouse Clubhouse Ludwig Von Drake, Dale 2007–2009 Transformers: Animated Ratchet, Megatron, Shockwave, Ironhide, Spike Witwicky, Cyrus \"The Colossus\" Rhodes, Cyclonus, Brawn 2007–2008 Legion of Super Heroes Brainiac 2008–2014 Star Wars: The Clone Wars Count Dooku/Darth Tyranus, Cad Bane, Ziro the Hutt, Chairman Papanoida, Additional voices 2008–2010 The Secret Saturdays V.V. Argost, Leonidas Van Rook 2008–2011 Batman: The Brave and the Bold Red Tornado, Silver Cyclone, Thomas Wayne (in \"Invasion of the Secret Santas!\"), False-Face, Doctor Mid-Nite, Dr. William Milton Magnus, Mercury, Chancellor Gor-Zonn, General Zahl, Killer Moth, Batman (Bat-Manga version), Joker (Scooby-Doo version), Green Lantern (Alan Scott) 2009 Disney's Haunted Holidays; Tales of Two Cities Hatbox Ghost 2010 Freaknik: The Musical Newscaster, Dukes of Hazzard Announcer 2010–2013 Ultimate Smash Brawl Wolfgang Amadeus Mozart, Hamm, Officer Williams, Airline Rep, Barack Obama, Francis 2011 G.I. Joe: Renegades Law, Granger, Crippled Convict Episode: \"Busted\" Episode: \"Fire Fight\" 2011–2015 Jake and the Never Land Pirates Captain Hook 2011–2012 ThunderCats Jaga, Tygus, 2011–2012 Young Justice Brain, Dudley H Dudley, Hamilton Hill, Wizard, Commissioner James Gordon Episode: \"Alpha Male\" Episode: \"Misplaced\" 2012 Black Dynamite Dennis Flynn Episode: \"Just Beat It or Jackson Five Across Yo' Eyes\" Green Lantern: The Animated Series Cleric Loran, Leph, Bleez Episode: \"Reckoning\" Episode: \"Fear Itself\" 2012–2014 Ben 10: Omniverse Malware, Mr. Baumann, Brainstorm, Seebik, Fiskerton, V.V. Argost, Albedo Brainstorm, Kane North/Kangaroo Kommando 2014–2015 Wander Over Yonder Captain, Additional Voices 2015 Star Wars Rebels Quarrie, Eesh Fahm, Imperial Officer Episode: \"Wings of the Master\" 2017–present Mickey and the Roadster Racers Dale ===Video games=== * Disney's Cartoon Arcade - Ludwig Von Drake * Rocky & Bullwinkle's Know-It-All Quiz Game - Narrator, Snidely Whiplash * Superman: The New Adventures - Brainiac * Disney's Villains' Revenge - Captain Hook, Smee, White Rabbit, Ringmaster * Walt Disney World Quest: Magical Racing Tour - Dale, Moe Whiplash, Bruno Biggs * Mickey's Speedway USA - Professor Ludwig Von Drake * Donald Duck: Goin' Qu@ckers - Merlock, Gladstone Gander, Gyro Gearloose * Atlantis: The Lost Empire - Molière * Disney Learning: Phonics Quest - Yen Sid * Crash Bandicoot: The Wrath of Cortex - N.Gin, N. Tropy * Star Wars: Galactic Battlegrounds - Count Dooku, Jedi Starfighter Pilot, Gen. Tal Ashen * Kingdom Hearts - Captain Hook, The White Rabbit, The Doorknob, Floatsam, Jetsam * Disney Golf - Ludwig Von Drake * Star Wars: The Clone Wars - Battle Droid Scout, Count Dooku * Star Wars: Bounty Hunter - Count Dooku, Darth Tyranus, Prison Guard #1 * The Nightmare Before Christmas: Oogie's Revenge - Santa Claus * Kingdom Hearts: Chain of Memories - Captain Hook (archive sound) * Star Wars Episode III: Revenge of the Sith - Count Dooku, Darth Tyranus, Flying Battle Droids, Jedi Sniper, Rune Haako, Jedi Brute, Jedi Pilot * Star Wars: Battlefront II - Count Dooku, Imperial Officer #2, Ki Adi Mundi * Kingdom Hearts II - Dale, MCP, Santa Claus, Sark, Shan-Yu, The Peddler, Yen Sid * The Legend of Spyro: A New Beginning - Volteer, Exhumor * The Legend of Spyro: The Eternal Night - Volteer, Exhumor * Kingdom Hearts II Final Mix+ - Yen Sid, Dale, Sark, MCP, Santa Claus, Shan-Yu, The Peddler * Kingdom Hearts Re:Chain of Memories - DiZ, Captain Hook * Disney Princess: Enchanted Journey - Gus, Grumpy * Cars Mater-National Championship - Doc Hudson * The Legend of Spyro: Dawn of the Dragon - Volteer, Mason * Grand Chase - Dungeon of Monsters * Transformers Animated: The Game - Megatron, Ratchet, Shockwave * Star Wars: The Clone Wars – Republic Heroes - Count Dooku, Darth Tyranus, Cad Bane * Cars Race-O-Rama - Doc Hudson * Kingdom Hearts Birth by Sleep - Ansem the Wise, Captain Hook, The Magic Mirror, Yen Sid, Dale, Grumpy * Batman: The Brave and the Bold – The Videogame - Red Tornado, Museum Guide, Weather Wizard * Kingdom Hearts Re:coded - Dale, Yen Sid * Epic Mickey - Yen Sid, Captain Hook * DC Universe Online - Brainiac * Lego Star Wars III: The Clone Wars - Count Dooku * Batman: Arkham City - Hugo Strange * Kinect: Disneyland Adventures - Dale, Mad Hatter, Captain Hook, Ghost Host * Batman: Arkham City Lockdown - Hugo Strange * Kingdom Hearts 3D: Dream Drop Distance - Ansem the Wise, Yen Sid, Claude Frollo * Kinect Star Wars - Count Dooku, Darth Ror, Red 7, RedMaID * Epic Mickey 2: The Power of Two - Yen Sid * Epic Mickey: Power of Illusion - Captain Hook * Ben 10: Omniverse - Malware * Disney Magic Castle: My Happy Life - Dale, Grumpy, Yen Sid, The Doorknob, Mad Hatter, Captain Hook * Kingdom Hearts HD 2.5 Remix - Ansem the Wise, Dale, Yen Sid, MCP, Santa Claus, Sark, Shan-Yu, The Peddler, Captain Hook, The Magic Mirror * Fantasia: Music Evolved - Ven Sid * Disney Infinity 3.0 - Cad Bane ===Theme parks=== * Seven Dwarfs Mine Train – Grumpy * Radiator Springs Racers – Doc Hudson * Haunted Mansion Holiday – Ghost Host * Journey into YOUR Imagination – Figment * Dudley Do-Right's Ripsaw Falls – Snidley Whiplash, Narrator * Fantasmic! – Chernabog, Captain Hook, Pirates * Cranium Command – General Knowledge, Chicken * Goofy About Health – Narrator * Horizons – Futureport 'Brava Centauri' Announcer * Pirates of the Caribbean – Stuffed Pirate * Alice in Wonderland – The White Rabbit/Cards * Peter Pan's Flight – Captain Hook, Mr. Smee * Mr. Toad's Wild Ride – Judge, Cop, Farmer * The Cat in the Hat – Fish == References == Category:1955 births Category:Living people Category:Actors from Los Angeles Category:American voice actors",
 "title": "Corey Burton"
}