{
 "id": "51070",
 "text": "Anthrax is an American thrash metal band from New York City. Anthrax was one of the most popular bands of the 1980s thrash metal scene. The band is part of the \"Big Four\" of thrash metal, along with Metallica, Megadeth and Slayer. They have sold over 10 million albums as of 2022. Anthrax released their first album in 1984. The band has made eleven albums. Four of them are certified gold by the RIAA. Their most popular and successful album is Among the Living, released in 1987. Among the Living made Anthrax a very popular band. == Career == === Beginning === Anthrax was formed by guitarists Scott Ian and Danny Lilker in 1981. Scott Ian named the band after the disease after he saw it in a biology textbook, as he thought it sounded \"sufficiently evil\" (evil enough). For Anthrax's first few years they went through a number of singers, bassists, and drummers, and finally settled on singer Neil Turbin, lead guitarist Dan Spitz (when Danny Lilker switched to bass) and drummer Charlie Benante before releasing their first album Fistful Of Metal. === 1984–1992 === Danny Lilker was fired by Neil Turbin without speaking to other band members (Turbin thought Lilker was too relaxed). Turbin was later fired himself as he was trying to take full control of the band. Lilker did not come back to the band and he replaced with Frank Bello (Charlie Benante's nephew) and Turbin was replaced with Joey Belladonna. This lineup recorded four albums; Spreading the Disease, Among The Living, State Of Euphoria and Persistence Of Time. Among The Living was a different type of album from the previous two, introducing humour and references to comic books to the band's music. It is thought by many to be their best album, featuring songs like \"Caught In A Mosh\", \"Indians\", and \"I Am The Law\" (which is about the character Judge Dredd). The next album, State Of Euphoria, was a similar kind of album but wasn't as successful, but had some more well known Anthrax songs such as \"Be All, End All and Antisocial\" (an English language cover of a song by the French band Trust). Persistence Of Time was a more serious album, due to arguments between band members and many of their personal possessions being lost in a fire. There were no references to comic books, and more serious themes were included in the lyrics (such as the need for peace, shown in \"Keep it in the Family\"). However, it did have a fast-paced cover of the Joe Jackson song \"Got The Time\" which has become a well known Anthrax song. During this period of time in the band's career, Anthrax also released a successful rap- metal song called \"I'm The Man\", and a few years later, they released another rap metal song with hip hop group Public Enemy, a cover of their song \"Bring The Noise\". With the release of this song, the two groups have been credited for creating and popularizing the rap metal genre. === 1992–2001 === Due to the band becoming more popular they signed to a record label named Elektra. However, Joey Belladonna was fired from Anthrax in 1992 and was replaced with John Bush, who was in a band called Armored Saint that had recently broke up. The band's first album with this singer, called Sound Of White Noise, was also successful, and was dark like Persistence Of Time, but also sounded a little bit like the grunge bands that were popular in the early 90s. Dan Spitz left the band in 1995. Charlie Benante played guitar on the band's next album, Stomp 442, as well as drums, with Paul Crook playing guitar on the album too. Pantera's guitarist Dimebag Darrell played solos on two of the songs. This album was not as successful as Sound Of White Noise, and Elektra was blamed by Anthrax for not promoting it properly. They re-signed to an independent label called Ignition and released Volume 8: The Threat Is Real, which again had Charlie Benante and Paul Crook playing guitar with solos from Dimebag Darrell (Pantera's singer Phil Anselmo did backup vocals on one song too). The album did less successfully than Stomp 442, and not long after the album came out, Ignition ceased to exist due to lack of success. Anthrax took a short break, and John Bush reunited with Armored Saint and released another album with them. === 2001–2009 === In 2001, the band hired lead guitarist Rob Caggiano and they played shows again. After 9/11 and the Anthrax attacks that came after that, the band wondered if they should change their name. Scott Ian jokingly said that they were thinking about the name \"Basket Full Of Puppies\". They decided to keep the name Anthrax. They released the album We've Come For You All in 2003, and whilst unsuccessful like the previous two albums, it was considered their best album in years. Whilst touring, Frank Bello left and was replaced by Armored Saint member Joey Vera. However, Frank Bello returned to the band as well as Joey Belladonna and Dan Spitz in 2005, when Anthrax announced a reunion tour. This successful tour ended in 2007, and Joey and Dan left once again. New singer Dan Nelson was announced and Rob Caggiano returned. They started making a new album called Worship Music, which was supposed to be released in 2009. However, Dan Nelson left the band during that year, and the album was put on hold. John Bush made a return to the band, who considered releasing Worship Music with this singer. === Current period === However, Joey Belladonna once again returned to Anthrax in 2010 on a permanent basis. The band played several shows (including the \"Big 4\" concerts with Metallica, Megadeth and Slayer) and work continued on the new album, which was finally finished and released in 2011. The album was their most successful since Sound Of White Noise. The band released an extended play of covers of rock songs from the 1970s in March 2013. Guitar player Rob Caggiano left Anthrax at the beginning of 2013 to play with Volbeat, and the band hired Jon Donais (from the band Shadows Fall) to replace him. In 2016, they released their eleventh album, For All Kings. == Band members == * Joey Belladonna, vocals * Scott Ian, guitar * Frank Bello, bass * Charlie Benante, drums/guitar in mid-late 90s Past members include: * Neil Turbin, original vocalist * John Bush, Joey Belladonna's replacement in 1992 * Dan Nelson, Joey's second replacement in 2007 * Danny Lilker, founding member, started off as lead guitarist before moving to bass * Joey Vera, replaced Frank Bello temporarily in 2004 * Dan Spitz, long time lead guitarist * Rob Caggiano, first official lead guitarist since Dan Spitz == Albums == * Fistful of Metal (1984) * Spreading the Disease (1985) * Among the Living (1987) * State of Euphoria (1988) * Persistence of Time (1990) * Sound of White Noise (1993) * Stomp 442 (1995) * Volume 8: The Threat Is Real (1998) * We've Come for You All (2003) * Worship Music (2011) == Other websites == * Official Anthrax Website * Official Anthrax Fan Club == References == Category:1980s American music groups Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American heavy metal bands Category:Thrash metal bands Category:Speed metal bands Category:Heavy metal bands Category:Groove metal bands Category:Musical groups from New York City Category:Elektra Records artists",
 "title": "Anthrax (American band)"
}