{
 "id": "511050",
 "text": "Air Florida Flight 90 was a scheduled U.S. domestic passenger flight from Washington National Airport to Fort Lauderdale – Hollywood International Airport. On January 13, 1982, the Boeing 737-200 registered as N62AF, crashed into the 14th Street Bridge over the Potomac River. == Background == The aircraft had originally been purchased by United Air Lines (later United Airlines) in 1969 and flown with the registration number of N9050U. It was sold to Air Florida in 1980. == Accident == While the 737 was still at the airport, it had been deiced at the gate and tried to pushback with reverse thrust when the pushback tug became stuck without proper snow equipment. After pushback and taxi to the departure runway, Captain Larry Wheaton began to grow worried about ice accumulating on the wings as the plane waited in line for departure behind a New York Air DC-9. Captain Wheaton then taxied his plane into the exhaust of the DC-9 ahead of him, successfully temporarily deicing the wings of the plane. The melted ice then refroze around the EPR sensors of the engines. When the flight was clear for departure, the EPR settings were showing usually high and the First Officer replied to this saying \"that's not right\", and the captain replied saying \"yes it is, there's eighty knots\". Upon rotation of the aircraft and the plane becoming airborne, the aircraft's stick shaker stall warning immediately activated as the airplane harshly and quickly pitched up into the air, with the wings contaminated with ice. The first officer was pilot flying. The captain urges the first officer to push forward on the yoke and that they only wanted to climb to 500 feet as the airspeed was dangerously low, and the aircraft was at a high angle of attack. The 737 then began to descend towards the 14th Street Bridge in a fully developed aerodynamic stall. The first officer then exclaimed \"stalling, we're falling\", and then \"Larry, we're going down, Larry\", to which where the captain said it's last reply, \"I know\". The aircraft struck the 14th Street Bridge, which carries Interstate 395 between Washington, D.C. and Arlington County, Virginia. It crushed seven occupied vehicles on the bridge and destroyed of guard rail before it plunged through the ice into the Potomac River and broke apart. In less than two miles (3 km) away from the White House, in plain view of both the Jefferson Memorial and The Pentagon. The plane was carrying 74 passengers and five crew members. Only four passengers and one flight attendant survived and were rescued from the crash. Arland D. Williams, Jr. was another passenger who helped to rescue the survivors but unfortunately drowned before he could be rescued. In addition to this, four motorists on the bridge also lost their lives. The survivors were rescued from the icy river by both civilians and professionals. == The Cause == President Ronald Reagan commended these acts during his State of the Union speech a few days later, and the bridge was renamed after Arland D. Williams. The cause of the crash was pilot error. ==References== ==Other websites== * Executive Summary - NTSB Report AAR-82/08 Air Florida, Inc., Boeing 737-222, N62AF, Collision with 14th Street Bridge near Washington National Airport Washington, D.C. January 13, 1982 * Aircraft Accident Report: Air Florida, Inc., Boeing 737-222, N62AF, Collision with 14th Street Bridge, Near Washington National Airport, Washington, D.C., January 13, 1982 National Transportation Safety Board report (PDF, 140 pages) * Pre-crash photos of N62AF * Category:1982 in the United States Category:Aviation accidents and incidents in the 1980s Category:20th century in Virginia Category:1980s in Washington, D.C. Category:Aviation accidents and incidents in the United States",
 "title": "Air Florida Flight 90"
}