{
 "id": "511062",
 "text": "The 2010 Polish Air Force Tu-154 crash occurred on 10 April 2010 when a Tupolev Tu-154M aircraft of the Polish Air Force crashed in the city of Smolensk, Russia, killing all 96 people on board. These included the President of Poland Lech Kaczyński and his wife Maria; the former President of Poland in exile Ryszard Kaczorowski, 18 members of the Polish parliament, and relatives of victims of the Katyn massacre. == Accident == They were en route from Warsaw to attend an event marking the 70th anniversary of the massacre. The site is about west of Smolensk. The pilots attempted to land at Smolensk North Airport, a former military airbase, in thick fog that reduced visibility to about . The aircraft was too low as it approached the runway as a result of confusing instructions from the traffic controler. Striking trees in the fog, it rolled upside down, struck the ground, broke apart, engulfed in flames and eventually came to rest short of the runway in a wooded area. The crash killed everyone on board. == References == ==Other websites== * \"Findings of the Interstate Aviation Committee Safety Investigation of the Accident involving Tu-154M aircraft tail number 101 of the Republic of Poland on April 2010 near Smolensk \"Severny\" aerodrome.\" ( ) Interstate Aviation Committee \\- Comprehensive link with reports and updates * \"Об окончательных результатах работы Технической комиссии Межгосударственного авиационного комитета по расследованию катастрофы самолета Ту-154М бортовой номер 101 Республики Польша, произошедшей 10 апреля 2010 г. в районе аэродрома Смоленск \"Северный\".\" ( ) Interstate Aviation Committee - Comprehensive link with reports and updates * Final report in English, Polish, and Russian - Committee for Investigation of National Aviation Accidents * Video reconstruction of flight (simulation, 36 min., rus) direct link (mp4) Category:Aviation accidents and incidents in Europe Category:Aviation accidents and incidents in 2010 Category:Smolensk Oblast Category:2010 in Europe Category:2010s in Russia Category:April 2010 events",
 "title": "Smolensk air disaster"
}