{
 "id": "511059",
 "text": "United Airlines Flight 232 was a scheduled flight from Stapleton International Airport in Denver, Colorado, to O'Hare International Airport in Chicago. On July 19, 1989, the DC-10 (registered N1819U) operating the route crash-landed in Sioux City, Iowa, after suffering a big failure in its tail-mounted engine, leading to the loss of all flight controls. Of the 296 people on board, 112 died in the accident while 184 survived. At 14:09 Central Daylight Time (CDT), Flight 232 departed Denver with 285 passengers and 11 crewmembers on board. About 1 hour and 7 minutes after takeoff (at approximately 15:16 CDT) the flight crew heard a loud bang followed by vibration and shuddering of the airframe. While the DC-10 was in cruise at 37,000 feet, the fan blade inside the number 2 engine cowling shattered, exploded, and broke through the side of the engine. Pieces of the fan blade cut through the horizontal stabilizers in the tail and cut through all three hydraulic lines for the control surfaces, ultimately (and quickly) leaving the aircraft without any flight controls. The aircraft began to bank right and descend. Captain Al Haynes took control of the airplane and attempted to regain altitude and level out, finding that his yoke had no effect on the attitude or roll angle of the aircraft. First Officer Records also tried his controls, but he could not control the aircraft either. The flight crew then used the throttles to fly the plane. Flight Instructor Denny Fitch offered his assistance in the cockpit and was put in charge of the throttles. The flight crew then circled multiple times to lose altitude and decided to land in Sioux City, Iowa. On approach to the runway, the aircraft began to dip below the horizon while travelling almost twice the normal landing speed. No pilot had ever successfully landed a DC-10 at this speed, with or without flight controls. Captain Al Haynes then urges Fitch to \"close the throttles,\" to which Fitch replied, saying \"I can't cut them off or you'll lose it, that's what's turning ya\". As the aircraft rapidly began to bank right and lose altitude, Fitch said \"Right, Al,\" and Captain Haynes replied \"right,\" then \"left left left left left left left, left left left\". The ground proximity warning system then activates, and the aircraft crashes into the ground, exploding, and flipping over. The fuselage breaks into five main parts. Of the 296 people on board, 111 are killed. ==Other websites== * NTSB Accident report of United Airlines Flight 232 * Cockpit voice-recorder transcript (pdf) (NB contains error) * A talk given by the pilot describing the crash at NASA Dryden in 1991 * Siouxland Chamber Of Commerce: Remembering Flight 232 (Picture of memorial depicting Lt. Colonel Dennis Nielsen carrying Spencer Bailey) * \"17th Anniversary Tribute of Flight 232\" * News report with video of crash landing of Flight 232, ABC News, July 19, 1989 * Pre-crash landing photos from Airliners.net Category:1989 disasters Category:1989 in the United States Category:Aviation accidents and incidents in the 1980s Category:Aviation accidents and incidents in the United States Category:20th century in Iowa",
 "title": "United Airlines Flight 232"
}