{
 "id": "511177",
 "text": "The 2015–16 Premier League was the 24th Premier League that took place from 8 August 2015 to 17 May 2016. It was won by Leicester City who, guided by Claudio Ranieri, upset bookmakers odds of 5000/1 at the start of the season by finishing 10 points clear of 2nd place Arsenal to win their 1st ever top flight English league title. The season was supposed to end on Sunday 15th May, but instead ended on Tuesday 17th May due to the abandonment and subsequent rearrangement of Manchester United's last home game against A.F.C. Bournemouth after a bomb scare. == League Table == === Top 4 === Team 1 Leicester City (C) 38 23 12 3 68 36 +32 81 Qualification for the 2016-17 UEFA Champions League group stage 2 Arsenal (Q) 38 20 11 7 65 36 +29 71 3 Tottenham Hotspur (Q) 38 19 13 6 69 35 +34 70 4 Manchester City (Q) 38 19 9 10 68 38 +30 66 Qualification for the 2016-17 UEFA Champions League play-off round === Bottom 4 === Team 17 Sunderland 38 9 12 17 48 62 −14 39 18 Newcastle United (R) 38 9 10 19 44 65 −21 37 Relegation to the 2016-17 Football League Championship 19 Norwich City (R) 38 9 7 20 35 61 −28 34 20 Aston Villa (R) 38 3 8 27 27 76 −49 17 * A win will give the team 3 points, a draw will give them 1 point, and a loss will give them no points. === Stadia and locations === Team Stadium Capacity AFC Bournemouth Dean Court 11,464 Arsenal Emirates Stadium Aston Villa Villa Park Chelsea Stamford Bridge Crystal Palace Selhurst Park Everton Goodison Park Leicester City King Power Stadium Liverpool Anfield Manchester City Etihad Stadium Manchester United Old Trafford Newcastle United St James' Park Norwich City Carrow Road 27,010 Southampton St Mary's Stadium Stoke City Britannia Stadium Sunderland Stadium of Light Swansea City Liberty Stadium 20,909 Tottenham Hotspur White Hart Lane Watford Vicarage Road 21,500 West Bromwich Albion The Hawthorns West Ham United Boleyn Ground === Personnel and kits === Team Manager Captain Kit Manufacturer Shirt sponsor AFC Bournemouth Eddie Howe Tommy Elphick JD Sports Mansion Group Mikel Arteta Puma Emirates Eric Black (caretaker) Micah Richards Macron Intuit QuickBooks Guus Hiddink (caretaker) John Terry Adidas Yokohama Tyres Alan Pardew Mile Jedinak Macron Mansion Group David Unsworth Joe Royle (caretakers) Phil Jagielka Umbro Chang Beer Claudio Ranieri Wes Morgan Puma King Power Jürgen Klopp Jordan Henderson New Balance Standard Chartered Vincent Kompany Nike Etihad Airways Wayne Rooney Nike Chevrolet Rafael Benitez Fabricio Coloccini Puma Wonga Norwich City Alex Neil Russell Martin Erreà Aviva Jose Fonté Adidas Veho Ryan Shawcross New Balance Bet365 Sam Allardyce John O'Shea Adidas Dafabet Ashley Williams Adidas GWFX Hugo Lloris Under Armour AIA Watford Quique Sanchez Flores Troy Deeney Puma 138.com Darren Fletcher Adidas Tlcbet Slaven Bilić Mark Noble Umbro Betway === Top scorers === Rank Player Club Goals 1 Harry Kane Tottenham Hotspur 25 2 Sergio Agüero Manchester City 24 Jamie Vardy Leicester City 4 Romelu Lukaku Everton 18 5 Riyad Mahrez Leicester City 17 6 Olivier Giroud Arsenal 16 7 Jermain Defoe Sunderland 15 Odion Ighalo Watford 9 Troy Deeney Watford 13 Alexis Sanchez Arsenal == References == Category:Premier League seasons Category:2015 in association football",
 "title": "2015–16 Premier League"
}