{
 "id": "511224",
 "text": "Rebbeca Marie Gomez (born March 2, 1997), better known by her stage name Becky G, is an American singer, songwriter and rapper. She became popular in 2011, after she posted several videos of herself performing cover versions of popular songs on to YouTube. In 2014, Gomez had her first Billboard Hot 100 entry, with \"Shower\", peaking at 16. ==Personal life== Rebbeca Marie Gomez was born on March 2, 1997, in Inglewood, California, to Mexican-American parents Alejandra \"Alex\" Esquivias and Francisco \"Frank\" Gomez. Her four grandparents are from Jalisco, Mexico, and her parents were born in the United States.Mendizaba, Amaya (May 29, 2014) Becky G, Dr. Luke Land First Latin No. 1 With 'Can't Get Enough' . Billboard.com Gomez has two brothers and a younger sister. In December 2017, she revealed she has a half-sister from her father's side. Gomez grew up in Moreno Valley, when she was nine years old her family lost their home and they moved into a converted garage at her grandparents' house because of financial problems. Gomez started doing part-time jobs to help support her family, doing commercials and voice over work. After doing commercials and voice over work, she decided she wanted a music career. She attended a public school, but changed to home schooling because of bullying. === Relationships === Gomez dated American singer Austin Mahone from February 2015 to August 2015. In June 2016, Gomez was in a relationship with American professional soccer player Sebastian Lletget. The couple announced their engagement on December 9, 2022. Lletget apologized for cheating allegations in late March 2023. While on tour with Fifth Harmony in October 2017, Gomez suffered an \"out-of-control fan attack\" while in Mexico City. Gomez took to Snapchat to speak about the incident and also revealed that she had been dealing with anxiety issues. == Filmography == ==Discography== * Mala Santa (2019) * Esquemas (2022) * Esquinas (2023) * Encuentros (2024) ==Tours== Headlining * Mi Casa, Tu Casa Tour (2023) * Casa Gomez: Otro Capítulo Tour (2024) Co-headlining tours * La Familia Tour with J Balvin (2015) Opening act * Demi Lovato – Demi World Tour (2014) * Katy Perry – Prismatic World Tour (2014) * Fifth Harmony – PSA Tour (2017) * Enrique Iglesias – Enrique Iglesias and Pitbull Live! (2017) ==References== ==Other websites== * * Category:1997 births Category:Rappers from California Category:American pop rappers Category:Singers from Los Angeles County, California Category:Singer- songwriters from California Category:People from Inglewood, California Category:21st-century American actors Category:American child singers Category:American hip hop musicians Category:American movie actors Category:American television actors Category:21st-century American singer- songwriters Category:American pop musicians Category:American voice actors Category:Living people Category:Actors from Los Angeles County, California",
 "title": "Becky G"
}