{
 "id": "511325",
 "text": "Sesugh Uhaa (born August 22, 1987), better known by his ring name Apollo Crews, is a Nigerian-American professional wrestler. He is currently signed to the WWE and works on their SmackDown brand. Uhaa, under the ring name Uhaa Nation, is also known for his work in Dragon Gate USA, as well as the Japanese promotion Dragon Gate. During his time in Dragon Gate, he won the Open the Twin Gate Championship with BxB Hulk. He was also named the Best Newcomer by Dragon Gate USA in 2011. During his time in WWE he won the Intercontinental and United States Championships once. ==WWE== In October 2014, Uhaa entered a WWE tryout camp and he was given a developmental contract. On April 6, 2015, he started at the WWE Performance Center. In a press release on April 13, the company announced that Uhaa was a member of their new NXT wrestlers. Uhaa made his first television appearance on the May 6 episode of NXT and signed his NXT contract during a segment with William Regal. On August 5, it was announced that Uhaa would make his televised NXT debut on August 22 at the NXT TakeOver: Brooklyn event. It was also announced that his new ring name would be Apollo Crews. == In wrestling == *Finishing moves **Standing shooting star press **Uhaa Combination (Gorilla press drop followed up by Uhaa performing a standing moonsault and then a standing shooting star press) **Spinout Powerbomb *Signature moves **All Out Assault (Triple powerbomb) **Over the top rope dive **Standing moonsault **Tombstone piledriver *Nicknames **\"One Man Nation\" ==Championships and accomplishments== *Dragon Gate **Open the Twin Gate Championship (1 time) – with BxB Hulk *Dragon Gate USA **Best Newcomer (2011) *Full Impact Pro **FIP Florida Heritage Championship (1 time) *Great Championship Wrestling **GCW Heavyweight Championship (1 time) *Preston City Wrestling **PCW Heavyweight Championship (1 time) *Pro Wrestling Illustrated **Ranked No. 65 of the top 500 singles wrestlers in the PWI 500 in 2021 *World Wrestling Alliance 4 **WW4A Tag Team Championship (1 time) - with Magic **WW4A Internet Championship (1 time) *WWE **WWE Intercontinental Championship (1 time) **WWE United States Championship (1 time) == References == ==Other websites== *WWE profile *Dragon Gate profile *Dragon Gate USA profile Category:1987 births Category:American professional wrestlers Category:African-American wrestlers Category:Living people Category:Sportspeople from Oakland, California Category:WWE wrestlers",
 "title": "Apollo Crews"
}