{
 "id": "511471",
 "text": "The A, C, E, H and K logos for the subway routes The IND 8th Avenue Line is a subway line in New York City. It carries the A, C and E services. It opened in 1932. About 1 million people ride on it every day. The line is 23 km (14 mi) long. Services that use the line are colored dark blue. ==Services== The line carries three of the 27 services of the New York City Subway services. They are: * A: The A 8th Avenue Express runs from Inwood-207th Street in upper Manhattan to Far Rockaway in Queens. It is the longest service on the New York City Subway. It is 50 km (31 mi) long. A famous jazz song called Take the 'A' Train was written about this service. * C: The C Eighth Avenue Local line travels on this line between 168 Street and West 4th Street. It runs from 168th Street to Euclid Avenue. It makes all stops (except late nights). * E: The E 8th Avenue Local runs from World Trade Center to Jamaica Center. It is fully underground for its whole route. It runs as an express service during the day, but makes all stops at night. *The K 8th Avenue Local used to run on the 8th Ave Line between 168 Street and World Trade Center. This service was discontinued in 1987. * Train yards and layups used by the IND 8th Avenue The Rockaway Park Yard = Used By The (A)(Blue Shuttle Rockaway Shuttle)(H) The H is now discontinued but that’s the yard it ran from. Pitkin Avenue Yard = Used By The (A)(C)(Rockaway Shuttle) Is An Yard In East New York Near The Terminating Station Of Euclid Avenue. This Yard Was Also Used By The Now Discontinued (K) Train. Also The (K) Train is now know as the todays IND 8th Avenue Local (C) Train. Jamaica Yard = Jamaica Yard Is Only Used By The (E) Train for 8th Avenue As It Stores E Trains Near Its Terminating Jamaica Center / Jamaica 179th St / And Forest Hills 71 St Continental. This Yard Is Also Used By The Terminating (M) And (R) Trains At The Nearby Forest Hills Station On The (F) Train Terminating At Jamaica 179th St. 174th St Layup = This Layup Is Only Used By The Terminating (C) Trains At 168th St Just North Of Harlem. It Is An Underground Yard So It Can Not Be Seen from The Outside. (A) Trains do not use this yard as they continue to Inwood using the 207 St yard. 207 St Yard = Used By The IND (A) Train Where It Terminates By Inwood 207 St. This yard is important because the IND And IRT shares this Yard This Yard Is Operated By The (A) And (1) Trains. This is the only yard in Manhattan besides the layups and it is the closest to water as it sits on the river. It is also the closest yard to the Manhattan/Bronx Border Line. Category:1932 establishments in the United States Category:1930s establishments in New York (state)",
 "title": "IND Eighth Avenue Line"
}