{
 "id": "511728",
 "text": "The Azerbaijan Supercup () is a football competition. It is held at the beginning of each football season. It is between the winners of the Azerbaijani Premier League and the winners of the Azerbaijan Cup. ==History== Neftchi Baku holds the record for winning the Supercup the most times. They have won it two times since the competition began in 1993. In 1994, Qarabağ were awarded automatically with the Supercup after the team won both the domestic title and the Azerbaijan Cup. In 2013, the Professional Football League of Azerbaijan decided to restore the Azerbaijan Supercup. Khazar Lankaran were the first winners of the restored Supercup. ==Winners== Year Winner Score Finalist 1993 Neftchi Baku 4:1 Inshaatchi Baku 1994 Qarabağ No competition. 一 1995 Neftchi Baku 1:1 (p.10–9) Turan ~~1996~~ No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) ~~1998~~ No competition. Kapaz (Premier League and Azerbaijan Cup) No competition. Kapaz (Premier League and Azerbaijan Cup) No competition. Kapaz (Premier League and Azerbaijan Cup) No competition. Kapaz (Premier League and Azerbaijan Cup) No competition. Kapaz (Premier League and Azerbaijan Cup) ~~2004~~ No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) No competition. Neftchi Baku (Premier League and Azerbaijan Cup) ~~2007~~ No competition. Khazar Lankaran (Premier League and Azerbaijan Cup) No competition. Khazar Lankaran (Premier League and Azerbaijan Cup) No competition. Khazar Lankaran (Premier League and Azerbaijan Cup) No competition. Khazar Lankaran (Premier League and Azerbaijan Cup) No competition. Khazar Lankaran (Premier League and Azerbaijan Cup) 2013 Khazar Lankaran 2:1 Neftchi Baku 2014 Qarabağ Neftchi Baku ==Total Titles== Club Titles Neftchi Baku 2 Qarabağ 1 Khazar Lankaran 1 ==Related pages== *Association of Football Federations of Azerbaijan *Azerbaijan national football team *Azerbaijani Premier League ==References== Category:Football in Azerbaijan Category:1993 establishments in Asia Category:Football competitions in Asia Category:1990s establishments in Azerbaijan",
 "title": "Azerbaijan Supercup"
}