{
 "id": "511710",
 "text": "Ian Douglas Smith was a politician from the United Kingdom. He was the Prime Minister of Rhodesia (today called Zimbabwe) from 1964 to 1979. Smith was the first Prime Minister to be born in Rhodesia. Smith was White British while most people in Rhodesia were locals, Smith didn't give the Rhodesians equal rights and this led to a war between Rhodesia and Rhodesian rebels which ended when Smith made a treaty and Rhodesia was replaced with Zimbabwe. Smith was a complicated man and some say he was a good and brave Prime Minister while others see him as racist and destructive. == Early life and Second World War == Ian Douglas Smith was born on the 8th April 1919 in the town of Selukwe to Jock and Agnes Smith, they were both farmers who had moved to Rhodesia from the United Kingdom. Jock and Agnes were important and both were given the Order of the British Empire for their efforts to provide for the people of Selukwe. Ian was very good as sports and wanted to be an athlete, his grades were also good and so he was able to pass to Rhodes University College in South Africa. When the Second World War happened, Smith broke a law which made it illegal for university students to fight in order to go to the war for the United Kingdom. He joined the Royal Air Force in 1942 and flew Spitfire planes. In October 1943, Smith's plane stopped working and crashed while setting off in Egypt and Smith was badly injured, his face was partially destroyed and doctors had to use plastic surgery to put it together, leaving his face noticeably disfigured. Smith still fought and was shot down over Italy in June 1944, Smith joined the Italian resistance who were fighting the Germans and had to walk across the mountainous Alps to be able to return to safety, he then ended up a Flight Lieutenant for his skills. == Early time in politics == Ian Smith returned to South Africa to Rhodes University to carry on studying and graduated, he then went back to Rhodesia where his father was ill and wanted him to go to the United States like his uncle Elijah to make money but Smith didn't want to. Smith married his wife Janet in 1948 and adopted her children, Janet was seen as courageous and hard-working like Ian and bought a farm with her called Gwenoro to start a family. Smith decided to run in the 1948 Southern Rhodesian general election as a member of the right- wing Liberal Party, the Liberal Party lost the election by a lot but Smith was able to be elected and became Southern Rhodesia's youngest MP as he was only 29. Smith did not do much in his early time in politics and was ordinary, he switched to becoming a member of the United Federal Party (UFP) that was the party in power. When Southern Rhodesia became a part of the Federation of Rhodesia and Nyasaland in 1953, Smith was unsure but left Parliament in Southern Rhodesia to be a part of the new Parliament in the Federation and he was elected. Smith's time in the federal Parliament was also ordinary and he did not do much, in 1958 the UFP appointed Smith to be the Chief Whip (meaning he had to convince MPs in his party to vote how the party wanted). African nationalism against the white rule began to appear and many white Rhodesians were afraid they might take over and that the government in the United Kingdom would support the Africans. When a new constitution was set up in 1961, Smith was the only MP to oppose it because he thought it was racialist and would cause even more problems and left the party. The British government started saying that Africans should be in charge and this created more fear, Smith and a few others started their own party - the Rhodesian Front - to say they wanted independence so this could not happen. Winston Field was the leader of the party and made Smith his second-in-command, and the Rhodesian Front won the 1962 Southern Rhodesian general election and Smith became the deputy Prime Minister because he returned to Southern Rhodesia's Parliament. Many new MPs for the Rhodesian Front wanted whites ruling only and an immediate and illegal independence (called UDI meaning \"Unilateral Declaration of Independence\"). Field was more moderate and wanted Southern Rhodesia (now called Rhodesia after Northern Rhodesia was made independent African-ruled Zambia) and the United Kingdom to make a deal where Rhodesia was given independence. But Field could not make a deal and the whites became even more nervous and so in June 1964, the Rhodesian Front voted to remove Field and make Smith the new Prime Minister. == Becoming Prime Minister and UDI == Since Ian Smith was barely known, many believed that he would be only Prime Minister for a short time and the British didn't like how Field had been removed and thought Smith was too old-fashioned and was not born in the United Kingdom. Smith was more demanding of independence, and did not want to say when he would give Africans control over Rhodesia and instead said he wanted both with whites mostly in charge. When Alec Douglas-Home, the Conservative Prime Minister of the United Kingdom, lost the elections and the new Prime Minister was Harold Wilson of the Labour Party, this made things worse as Wilson and his party believed in African rule and would not agree. Smith also began ruling Rhodesia as he wanted, he banned the Zimbabwe African People's Union (ZAPU), who wanted to fight the white Rhodesian government to have Africans in charge, and also made a new constitution. In May 1965, Smith lost his patience and had a general election to strengthen his rule and give him more power in negotiations, he won the election with all white seats and only had one white opposition MP (Ahrn Palley). In October 1965, the talks stopped as both sides could not agree and most people thought that Rhodesia would declare UDI, Smith tried to have a last minute deal but Wilson refused because he did not believe he really would declare independence. On the 11th November 1965, Ian Smith and the Rhodesian cabinet declared independence (UDI) illegally, no other country recognised Rhodesia and the United Nations called Rhodesia racist and stopped countries from trading with it, although some would secretly or people would illegally or despite. == First years of independent Rhodesia == Most people believed landlocked Rhodesia would not survive other country's not trading and would soon run out of goods and be forced to go back to the United Kingdom, but surprisingly the situation was calm and nothing major happened. Rhodesia still received its goods from Mozambique (then a part of Portugal) and South Africa with the only problems being oil, which was still coming in but in small amounts. Life in Rhodesia remained the same. ZAPU and ZANU (Zimbabwe African National Union) said that it was an open admission of war and began to revolt but did not have the strength to do anything and so mainly operated in Zambia or Tanzania. Wilson and the British government at first refused to make a deal to recognise Rhodesia, but as time went on they realised Rhodesia was not being affected and began preparing to talk again. In December 1966, Smith and Wilson went on a ship, the HMS Tiger, in Gibraltar, the negotiations were going well despite the British and Rhodesian delegates not liking each other until Wilson wanted Smith remove his 1965 constitution, Smith refused and the talks stopped except for a list of agreements signed which both the British and Rhodesian cabinets refused. In 1967, Smith and his more republicanist MPs in the Rhodesian Front began to prepare for Rhodesia being a republic because the Queen Elizabeth II did not recognise Rhodesia's independence. They created a new flag which did not include the British flag, and a new coat of arms. In April 1968, Wilson and Smith started talking again on the HMS Fearless again in Gibraltar, Wilson treated Smith much better, but when Wilson offered that the Privy Council be involved in overseeing Rhodesia, Smith refused and talks ended. In 1969, Smith openly began supporting a republic and made a vote of qualified (nearly all white) voters to see who wanted it, the pro-republic side won and a republic was declared in 1970 with the deputy Prime Minister Clifford Dupont becoming the President. The President had no real power and was selected by the government to do ceremonies and act as the head of state. In 1970, a general election in the United Kingdom had Labour led by Harold Wilson be defeated by the Conservatives led by Edward Heath. Heath wanted to make a deal with Rhodesia and made Alec Douglas-Home the Foreign Secretary. In 1971, Douglas-Home flew to Rhodesia to talk with Smith and make a deal, the talks were a success and they made a deal for more Africans in government but the whites remaining in charge, in 1972, the British made a referendum to see whether every ethnic group supported it, the whites, coloureds, and Asians all did, except the Africans didn't, Smith then blamed this on intimidation by nationalists. == The war becoming worse and more troubles == In Portuguese Mozambique and Angola, the situation was more tense as the African insurgency grew, this was compounded in Rhodesia by the failure of the 1971 plan. African militants went into Rhodesia in small bands in 1966 to 1968, but they were all easily tracked down just miles inside killed by the Rhodesian Security Forces. So they decided to train in countries that supported them and trained for a guerrilla war. In December 1972, this was by two attacks on white farmers in one day. The militants were able to go into African areas and won over the people to their side and recruited, however Mozambique and South Africa were supporting Rhodesia so they did not have much of an effect. However, as Mozambique became weaker in 1973 and into 1974 they were able to get into Rhodesia and recruit more often and attacks slowly happened more and more. Rhodesia then started a counter-insurgency which was successful. Meanwhile, Abel Muzorewa - who didn't like Smith's deal with Douglas-Home and created the African National Council to try and go against it - made a deal with Smith and started talking together with a British delegation and met in July 1973. Although Rhodesia was stopping the militants in 1974, things in other countries would make Rhodesia worse off. In October 1973, OPEC (Organisation of Petroleum Exporting Countries) stopped selling oil to pro-Israeli countries and later to Portugal and South Africa. In April 1974, the Portuguese government was overthrown in the Carnation Revolution, the new government began sending its soldiers out of Mozambique and Angola and Mozambique became overrun with FRELIMO rebels who aided the African militants, adding 1,426 kilometres of hostile border. Despite this, Smith continued saying Rhodesia could survive and nothing was really wrong as the militants entered Rhodesia in larger numbers. South Africa was losing lots of money due to a boycott of its own, together with its own militant insurgency, and OPEC sanctions, and so Rhodesia became a strain on South Africa's economy. In December 1974, South Africa under John Vorster started to threaten Rhodesia with cuts to imports and the end of special privileges if they did not make a deal with the other African nationalist leaders of the Frontline States (Zambia, Tanzania, and Botswana, later followed by Angola and Mozambique when they became independent the next year), they came up with a deal involving them with Smith and Muzorewa were a ceasefire happened. The ceasefire would not last long and would only allow imprisoned nationalists who were freed to escape and the militants to recoup losses and mobilise. In January 1975, Smith and the Rhodesian government noticed this and stopped the ceasefire, leading to South Africa withdrawing its police and making the situation even worse. The war continued to steadily get worse as Mozambique became officially independent on the 25th June 1975. In August 1975, == References == Category:1919 births Category:2007 deaths Category:Anti-communists Category:Military personnel of World War II Category:Rhodesia",
 "title": "Ian Smith"
}