{
 "id": "51185",
 "text": "Steven A. \"Steve\" Ballmer was the CEO of Microsoft Corporation from January 2000 to May 2014. He is the owner of the NBA team the Los Angeles Clippers after Donald Sterling was fired. He is the second person to become a billionaire in U.S. dollars based on being given shares in a company as an employee in which he was not the founder or related to a founder. In November 2023, Bloomberg Billionaires Index estimated his personal wealth at around $122 billion, making him the fifth-richest person in the world. In 2014 that he stepped down as Microsoft CEO. == Family == His mother was an American Jew.Jerusalem Post: \"The world's 50 Richest Jews: 1-10\" #5 Steve Ballmer September 7, 2010 His father was an immigrant from Switzerland who worked in Switzerland as a manager at Ford Motor Co in the late 1940s. In 1990, Ballmer married Connie Snyder. They have three children. Ballmer's grandparents lived in Pinsk, Belarus. Steve Ballmer was born March 24, 1956. He grew up in Farmington Hills, Michigan. In 1973, he graduated from Hull College, and now sits on its board of important people. In 1977, he graduated from Harvard University with a degree in mathematics and economics. While in college, Ballmer managed the Chess Team, worked on the Daily News newspaper as well as the Daily Star, and lived down the hall from Bill Gates. He then worked for two whole years as a helper of a product manager at Procter & Gamble, where he shared an office with Jeffrey Immelt, who would later become CEO of General Electric.\"First job: Assistant product manager for Duncan Hines' Moist & Easy cakes and brownies. His cubicle mate was Jeffrey Immelt, now CEO of General Electric.\" In 1980, he Joined Stanford Graduate School of Business but left the college to work at Microsoft.\"After two years, Ballmer headed for a University's MBA program for a better grounding in business. When the fledgling Microsoft ran into problems in 1980, Gates persuaded his friend to drop out and give him a hand. \" On October 4, 2007, Ballmer was given an honorary citizenship of Lausen, Switzerland. ==Microsoft career== Ballmer joined Microsoft on June 11, 1980., and was Microsoft's 24th worker, the first manager hired by Bill Gates. At first he was offered a pay of $50,000 as well as a bit of ownership of the company. When Microsoft was made into a company in 1981, Ballmer owned 8% of it. He has been in charge of several parts within Microsoft including \"Operating Systems Development\", \"Operations\", and \"Sales and Support.\" In January 2000, he was actually named the Big Cheese. As Big Cheese, Ballmer handled company monies, however Gates still controlled the \"technological vision.\" In 2003, Ballmer sold 39.3 million Microsoft shares for about $955 million, leaving him with 4% of the company.MSFT: Major Holders for MICROSOFT CP - Yahoo! Finance The same year, Ballmer replaced Microsoft's employee stock options program. In 2009, and for the first time ever, he made the opening speech at the Consumer Electronics Show, since Bill Gates had left Microsoft. Ballmer announced his retirement on August 23, 2013. == Public persona == === Viral videos === Video featuring Ballmer's funny stage appearances at Microsoft events have been circulated a lot on the Internet, becoming viral videos. The most well known of these videos is usually titled \"Steve Ballmer going crazy.\". This video has Ballmer running quickly and hopping around while squealing, screaming and making other various high pitched noises as well as rude hand gestures on a stage after being introduced at a Microsoft worker meeting. This video is also known in other names, such as \"Steve Ballmer Going Nuts\" and \"Ballsy (aka Steve Ballmer) on Crack\". Another video, captured at a developers' meeting, featuring Ballmer saying the word \"developers\" again and again was viewed by a lot of viewers on a video website.Ballmer Becomes lonevoice at Microsoft's helm The Economic Times 30 Jun 2008 Another video, which became a \"big hit on the web\" and was featured on CNN shows Ballmer hiding behind a big desk to dodge eggs during a talk in Budapest, Hungary === On competition === ==== Bill Gates ==== The Wall Street Journal has reported that there were tensions around the 2000 change of leadership from Bill Gates to Ballmer. On one occasion, Gates reportedly ran out of a meeting after a shouting match in which Mr. Ballmer defended several colleagues. After the incident, Mr. Ballmer reportedly appeared \"remorseful.\" When Gates left, \"I'm not going to need him for anything. That's the principle,\" Mr. Ballmer said. \"Use him, yes, need him, no.\" ==== Free and open source software ==== He has referred to the free Linux computer running thing as a \"ruddy cancer that attaches itself in an intellectual property sense to everything it touches.\"Ballmer: \"Linux is a cancer\", The Register, June 2, 2001. Retrieved August 30, 2008. Ballmer used the term \"viral\" licensing terms to show his worry that the GNU General Public License license forced by such software requires that all software made from it be under it or a compatible license. ==== Lucovsky/Google ==== In 2005, Mark Lucovsky said in a sworn statement to a Washington state court that Ballmer became very angry upon hearing that Lucovsky was going to leave Microsoft for Google, picked up his chair, and threw it across his office. Saying that Google CEO Eric Schmidt (who previously worked for competitors Sun and Novell), Ballmer allegedly said, \"Ruddy Eric Schmidt is a bloomin pussy! I'm going to maybe bury that guy, I haven't done it before, but I will do it again. I'm going to effing kiss Google,\" then carried on trying to persuade Lucovsky to stay at Microsoft. Ballmer said it was a \"gross exaggeration of what actually took place.\" === Sports === On March 6, 2008 Seattle's mayor said that a local buying things group of people involving Steve Ballmer made a \"game changing\" commitment to invest $150 million in cash toward a $300 million renovation of KeyArena and were ready to purchase Seattle SuperSonics in order to keep them in the City of Seattle. Ballmer would join fellow Microsoft trillionaire Paul Allen (owner of the Portland Trail Blazers) as an NBA owner. On May 29, 2014, Ballmer placed a bid of $2 billion to purchase the Los Angeles Clippers of the National Basketball Association (NBA). His bid was approved on June 4, 2014. == In Pop Culture == Ballmer is copied in an episode of Family Guy series, where he runs around the stage at a Dethklok worker meeting, screeching and screaming to excite the crowd before accidentally hanging himself from a high bit with his microphone. == Media portrayals == * Bad Boy Ballmer : The Man Who Rules Microsoft (2002), Fredric Alan Maxwell, (unauthorized biography) * The 1999 docudrama Pirates of Silicon Valley features Ballmer as a major character; he is played by actor John DiMaggio. * Michael Maccoby qualified him as a \"productive obsessive\" and the one keeping Microsoft's \"show on the road\" so Bill Gates could think about the big picture. == Notes == == Other websites == *Corporate biography *Forbes World's Richest People listing *South China Morning Post audio interview *Steve Ballmer Playlist Appearance on WMBR's Dinnertime Sampler radio show February 23, 2005 *fakesteveballmer blog Category:1956 births Category:Living people Category:American chief executives Category:American Jews Category:Harvard University alumni Category:Jewish businesspeople Category:Businesspeople from Detroit Category:American Internet celebrities",
 "title": "Steve Ballmer"
}