{
 "id": "5118",
 "text": "Sir Edmund Percival Hillary , (born 20 July 1919, died 11 January 2008) was a New Zealand mountaineer and explorer. He and Sherpa guide Tenzing Norgay were the first people to climb Mount Everest. They got to the top on 29 May 1953. Mount Everest is the tallest mountain on Earth. During his teenage years, Hillary had attended Auckland Grammar School. Sir Edmund Hillary's fame came as a result of being the first New Zealander in the world to conquer Mt. Everest in Nepal. He is on the New Zealand five dollar note. He also climbed ten other mountains after Mount Everest, all of which are also in the Himalayas. == Early life == Hillary was born to Percival Augustus Hillary and Gertrude Hillary, née Clark, in Auckland, New Zealand, on 20 July 1919.Christchurch City Libraries, Famous New Zealanders. Retrieved January 23, 2007. His family moved to Tuakau (south of Auckland) in 1920, after his father (who served at Gallipoli) had gotten land there.The early years - Ed Hillary, New Zealand History online - Nga korero aipurangi o Aotearoa, Ministry for Culture and Heritage, Wellington, New Zealand. Updated 2008-01-11. Accessed 2008-01-12. His grandparents were early settlers in northern Wairoa in the mid 19th century after moving from Yorkshire, England.Tyler, Heather Tyler Authorised Hillary biography reveals private touches . NZ Herald. October 8, 2005. Hillary learned at Tuakau Primary School and then Auckland Grammar School. He finished primary school two years early, but he did not do very well at high school.Simon Robinson, Sir Edmund Hillary: Top of the World , Time Magazine, 2008-01-10. Accessed 2008-01-14. At first, he was smaller than other students there and very shy so he felt safe with his books and often thought of a life filled with adventure. Every day, he rode a train to and from high school, and he often used this time to read. Learning how to box helped him become more confident. At age 16 his interest in climbing started during a school trip to Mount Ruapehu. Although very tall at 6 ft 5 in (195 cm), he was stronger than many of his fellow hikers. He learned about mathematics and science at The University of Auckland, and in 1939 he completed his first important climb, which was reaching the top of a mountain called Mount Ollivier. With his brother Rex, Hillary became a beekeeperRobert Sullivan, Time Magazine, Sir Edmund Hillary—A visit with the world's greatest living adventurer , 12 September, 2003. Retrieved 22 January, 2007. during summertime, which allowed him to do climbing in the winter.National Geographic, Everest: 50 Years and Counting . Retrieved 22 January, 2007. == Personal life == Hillary married Louise Mary Rose in 1953, by whom he had a son and two daughters. In 1975, his wife and their younger daughter were killed in a plane crash. Hillary married June Mulgrew in 1989; they remained married until he died. == Death == Hillary died of a heart attack in Auckland, at the age of 88. ==Gallery== == References == Category:1919 births Category:2008 deaths Category:Beekeepers Category:Deaths from myocardial infarction Category:Explorers Category:Mountain climbers Category:People from Auckland",
 "title": "Edmund Hillary"
}