{
 "id": "511940",
 "text": "Hotter Than July is the nineteenth album by American recording artist Stevie Wonder. It was released on Motown's Tamla label on September 29, 1980. It was certified platinum, which means it sold more than 1,000,000 copies in the US. It reached number three on the US Billboard chart. This was Stevie Wonder's most successful album in the UK, where it reached number two on the sales charts, and produced four top ten singles. Hotter Than July was nominated for Favorite Soul/R&B; Album at the American Music Awards in 1982. ==Track listing== All songs written, produced and arranged by Stevie Wonder except where noted. ;Side one #\"Did I Hear You Say You Love Me\" – 4:07 #\"All I Do\" (music: Wonder; lyrics: Wonder, Clarence Paul, Morris Broadnax) – 5:06 #\"Rocket Love\" – 4:39 #\"I Ain't Gonna Stand for It\" – 4:39 #\"As If You Read My Mind\" – 3:37 ;Side two # * \"Master Blaster (Jammin')\" – 5:07 #\"Do Like You\" – 4:25 #\"Cash in Your Face\" – 3:59 #\"Lately\" – 4:05 #\"Happy Birthday\" – 5:57 ==Charts== ===Weekly charts=== Chart Position Australian Kent Music Report 3 Austrian Albums Chart 2 Canadian RPM Albums ChartLibrary and Archives Canada. Retrieved February 20, 2013 18 Dutch Albums Chart 4 French SNEP Albums Chart 1 Italian Albums Chart 2 Japanese Oricon Albums Chart 29 New Zealand Albums Chart 2 Norwegian VG-lista Albums Chart 5 Swedish Albums Chart 3 UK Albums Chart 2 U.S. Billboard 200 3 West German Media Control Albums Chart 12 ===Year-end charts=== Chart (1980) Position Australian Kent Music Report 54 French Albums Chart 39 Italian Albums Chart 14 UK Albums Chart 43 Chart (1981) Position Australian Kent Music Report 8 UK Albums Chart 11 U.S. Billboard Year-End 21 ===Decade-end charts=== Chart (1980–89) Position Austrian Albums Chart 28 ==Certifications== Region Certification Sales Canada 2 X Platinum 200,000 France Gold 962,300 Japan (Oricon charts) Example 73,000 United Kingdom (BPI) Platinum 300,000 United States (RIAA) Platinum 1,000,000 ==References== Category:1980 albums Category:R&B; albums Category:Soul albums Category:Funk albums Category:Stevie Wonder albums",
 "title": "Hotter than July"
}