{
 "id": "512118",
 "text": "Santa Clarita, officially the City of Santa Clarita, is the third largest city in Los Angeles County, California. It is the 17th largest city in the state of California. The city has annexed unincorporated areas, which has made the population higher. Santa Clarita is about 35 miles (56 km) northwest of downtown Los Angeles. It takes up most of Santa Clarita Valley. It is a good example of a U.S. edge city or boomburb. Santa Clarita was ranked by Money magazine in 2006 as 18th of the top 100 places to live.MONEY Magazine: Best places to live 2006 There are four smaller communities in Santa Clarita. They are called Valencia, Saugus, Newhall, and Canyon Country. Santa Clarita is well known for the amusement park Six Flags Magic Mountain as well as the TV program Santa Clarita Diet. == History == Santa Clarita became a city in December 1987, but its history stretches back many hundreds of years. In the year 450, a group of Native Americans called the Tataviam arrived in the valley, and as many as 2,000 lived there at their height. In 1842, Francisco Lopez found gold in the area. It was the first recorded gold in the state. It is marked in an area called Placerita Canyon, which was also the original \"back lot\" area for Hollywood movie makers. The town of Newhall is named after Henry Mayo Newhall, a businessman who became rich during the California Gold Rush. At first, he founded H.M. Newhall & Company, an auction house in San Francisco. Then, he got into the railroad business. He put money into companies that would join San Francisco to other cities and was in charge of the San Francisco and San Jose Railroad. He sold the business to the Southern Pacific Railroad in 1870, and was one of the people in charge of it. After railroads, Newhall started focusing on real estate and ranching. He bought 143,000 acres of land between Los Angeles and Monterey counties. The largest piece of land was the 46,460 acres of land in northern Los Angeles County which was called the Rancho San Francisco, later called Newhall Ranch. He sold some of his property to the Southern Pacific Railroad which built a train line through the present-day Newhall Pass. They also built a town and named it after Newhall. The first station North on the new line was named Saugus by Newhall, after his hometown of Saugus, Massachusetts. His children created the Newhall Land and Farming Company that helped build the rest of Santa Clarita. On September 5, 1876, Charles Crocker and Leland Stanford (en) joined their railroads together in Canyon Country, linking Los Angeles with the rest of the country for the first time. A couple of weeks later, on September 26, Charles Alexander Mentry built California's first useful oil well in Mentryville, helping kickstart the Southern California oil industry. The oil was cleaned in Newhall, in what is now the oldest existing oil cleaner in the world. It was open between 1874 and 1888. The Saugus Cafe on Railroad Avenue in Saugus was opened in 1887. It is far and away the oldest open restaurant in Los Angeles County and the 16th oldest open restaurant in the state. Filming in Santa Clarita began at the turn of the century and featured actors including William S. Hart and John Wayne. Hart and actor Harry Carey both have parks named after them in the county. The Santa Clarita Valley was the scene of the second most deadly disaster in Californian history, behind the 1906 San Francisco earthquake. It was known as the \"worst civil engineering failure of the 20th century\". Before midnight on March 12, 1928, the St. Francis Dam collapsed. It caused a flood to rush all the way West to the Pacific Ocean near Ventura. An estimated 431 people were killed, and the site of the present-day Westfield Valencia Town Center was buried in muck. The disaster resulted in the end of the career of engineer William Mulholland. After many attempts to form a city or a county, the four communities of Canyon Country, Newhall, Saugus, and Valencia finally joined to become the City of Santa Clarita at 4:30 PM on December 15, 1987. == Geography == Santa Clarita is located in the Santa Clarita Valley, a valley in northern Los Angeles County, just north of the San Fernando Valley and southwest of the Antelope Valley. The Santa Clara River runs east–west through the valley. Freeways Interstate 5 and State Route 14 also run across the valley. Six Flags Magic Mountain is located just west of Interstate 5, in Stevenson Ranch. Smaller hills also cross the valley. Hiking trails are common in the hills, including Central Park, Quigley Canyon, East Canyon, Rice Canyon, and Towsley Canyon. === Climate === Santa Clarita has a Mediterranean climate with warm and dry days throughout the year. This, along with the Chaparral ecosystem in the area, makes wildfires common in the summer. == References == Category:Cities in California Category:Settlements in Los Angeles County, California Category:1987 establishments in California",
 "title": "Santa Clarita, California"
}