{
 "id": "512270",
 "text": "Studio City is a neighborhood in the city of Los Angeles, California, in the San Fernando Valley. It is named after the studio lot that was established in the area by film producer Mack Sennett in 1927, now known as CBS Studio Center. ==Notable residents== ===Film and television=== ===Music=== ===Other=== ==Education== Almost half of Studio City residents aged 25 and older (49.4%) had earned a four-year degree by 2000, a high percentage for both the city and the county. The percentages of those residents with a master's degree was also high for the county. \"Studio City,\" Mapping L.A., Los Angeles Times ===Schools=== Schools within the Studio City boundaries are: \"Studio City: Schools,\" Mapping L.A., Los Angeles Times * Harvard-Westlake School, private, grades 10-12, 3700 Coldwater Canyon. * Campbell Hall School, private K-12, 4533 Laurel Canyon Boulevard, Founded in 1944 by Alexander Campbell, the school is home to approximately a thousand students from kindergarten through high school. * Walter Reed Middle School, LAUSD, 4525 Irvine Avenue * Bridges Academy, private, 3921 Laurel Canyon Boulevard. It is a grade 5-12 middle and college preparatory high school dedicated to educating students who are twice exceptional, or \"2e,\" (gifted and highly gifted with learning disabilities). * ABC Little School, private elementary, 11728 Moorpark Street * Oakwood Elementary School, private, 11230 Moorpark Street * St. Charles Borromeo, private elementary, 10850 Moorpark Street * Berenece Carlson Home Hospital, LAUSD special education, 10952 Whipple Street * Rio Vista Elementary School, LAUSD, 4243 Satsuma Avenue * Carpenter Community Charter, 3909 Carpenter Avenue * Morning Star Christian Academy, private, 11000 Ventura Boulevard ===Public library=== *Los Angeles Public Library operates the Studio City branch.\"Studio City Branch Library.\" Los Angeles Public Library. Retrieved on March 19, 2010. ==References== ==Other websites== * Map of Los Angeles neighborhoods Category:Neighborhoods of Los Angeles",
 "title": "Studio City, Los Angeles"
}