{
 "id": "512287",
 "text": "\"No Me Ames\" (English: \"Don't Love Me\") is a song by Jennifer Lopez and Marc Anthony. It is a Spanish cover version of an Italian song called \"\", written by Giancarlo Bigazzi, Marco Falagiani and Aleandro Baldi and recorded by Baldi and Francesca Alotta. While Lopez and Anthony were recording the song, Lopez came up with the idea for the music video. Lopez recalled the events, stating, \"And I asked him [Anthony] if he liked it. And I actually explained it to Tommy and him at the same time the other day in the studio after we recorded the song and they both loved it.\"[12] The music video for \"No Me Ames\" was directed by Kevin Bray in May 1999 in Los Angeles, California, the day after she shot the music video for \"If You Had My Love\".[12][41] The music video features Lopez and Anthony as two lovers. Anthony is dying from an unnamed illness. His spirit watches over the grieving Lopez. Of the music video, Lopez stated that it is \"like a foreign film, like 'Life Is Beautiful'\". [ 42 ] The music video received a Latin Grammy Award nomination for Best Short Form Music Video. [ 38 ] The music video was included on the DVD set of Lopez's compilation album The Reel Me (2003). [ 43 ] The song was scheduled to be performed at the first annual Latin Grammy Awards, but Anthony was unable to attend due to complications with his wife's pregnancy. [ 44 ] On their 2007 tour, in which they performed the song together, it was performed as an encore along with \"Por Arriesgarnos\" after each show. [ 45 ] Lopez and Anthony performed the song at the final show of Lopez's Dance Again World Tour. [ citation needed] == Formats and track listings == == Charts == === Weekly charts === Chart (1999) Position scope=\"row\" scope=\"row\" US Tropical Songs (Billboard) 1 === Year-end charts === Chart (1999) Position US Latin Songs (Billboard) 3 US Latin Pop Songs (Billboard) 8 US Tropical Songs (Billboard) 2 == Credits and personnel == The credits are adapted from the On the 6 liner notes. *Giancarlo Bigazzi – songwriter *Aleandro Baldi – songwriter *Marco Falagiani – songwriter *Ignacio Ballesteros – songwriter (Spanish adaption) *Jennifer Lopez – lead vocals *Marc Anthony – lead vocals ;Ballad version *Konesha Owens – background vocals *Claytoven Richardson – background vocals *Dan Shea – keyboard, programming, vocal recording engineer, pro-tools editing *Dean Parks – nylon & Steel String Guitar *Michaal Landau – electric guitar ;Tropical remix *Emilio Estefan – executive producer *Dan Shea – vocal producer, keyboard, rhythm programming *Juan Vincente Zambrano – producer, arrangement, programming, keyboard *Jose Miguel Velasquez – background vocals *Lena Perez – background vocals *Ximera DePombo – background vocals *Jorges Velaro – background vocals *Manual Lopez – guitar *Salvador Cuevas – bass *Edwin Bonilla – percussion *Archie Peña – percussion *Douglas Guevara – bongo, Congo *Herman \"Teddy\" Mulet – Trombone == References == Category:1999 songs Category:1990s ballads Category:Jennifer Lopez songs Category:Marc Anthony songs Category:Latin music songs Category:R&B; songs Category:R&B; ballads",
 "title": "No Me Ames"
}