{
 "id": "512395",
 "text": "The American Academy of Dramatic Arts (AADA) is a two-year performing arts school. It has two locations. The first is at 120 Madison Avenue, Manhattan, New York City. The second is at 1336 North La Brea Avenue, Hollywood, California. AADA is the oldest acting school in the English-speaking world. The 2015 tuition is $30,650. About 81% of those who apply are accepted. AADA is a private non-profit institution. == History == The academy in New York City was founded in 1884. Its purpose was to train actors for the stage. The landmark building was designed by noted architect Stanford White as the original Colony Club. In 1974, the academy opened another campus in Pasadena, California. This made AADA the only professional actor training school in both major theatrical centers in the US. The Los Angeles campus moved from Pasadena to Hollywood in 2001. ==Program== The academy remains dedicated to training professional actors. It offers a two-year program. Students have to be invited back for the second year. Auditions are held at the end of the second year for the third year company.\"The Academy's Approach\" on the AADA website As well as training for the theatre, it now offers courses in the movies and television. Students who graduate in New York receive an Associate of Occupational Studies degree. Students who graduate in Hollywood receive a Certificate of Completion or an Associate of Arts degree in acting. Students from New York and Los Angeles can get a Bachelor of Arts degree from selected universities. == Notable alumni == Notable alumni include: * Hank Azaria * Lauren Bacall * Conrad Bain * Anne Bancroft * Diana Barrymore * Laura Branigan * Adrien Brody * John Cassavetes * Kim Cattrall * Jennifer Coolidge * Hume Cronyn * Bob Cummings * Cecil B. DeMille * William Devane * Danny DeVito * Colleen Dewhurst * Kirk Douglas * Julia Duffy * Christine Ebersole * James Farentino * Nina Foch * Ruth Gordon * Bruce Greenwood * Anne Hathaway * Dennis Haysbert * Florence Henderson * Judd Hirsch * Kate Jackson * Grace Kelly * Johnny Knoxville * Dina Merrill * Elizabeth Montgomery * Carrie-Anne Moss * Sarah Paulson * Tom Poston * William Powell * Robert Redford * Don Rickles * Thelma Ritter * Jason Robards * Eric Roberts * Edward G. Robinson * Gena Rowlands * Paul Rudd * Rosalind Russell * Jaclyn Smith * Loretta Swit * Gene Tierney * Spencer Tracy * Claire Trevor * Peter Weller == References == Category:Schools in Manhattan Category:1884 establishments in the United States Category:Schools in California Category:Performing arts Category:1880s establishments in New York (state) Category:1880s establishments in California",
 "title": "American Academy of Dramatic Arts"
}