{
 "id": "51246",
 "text": "The pulmonary artery is a short and wide blood vessel that connects the heart to the lungs. The pulmonary artery carries blood without its oxygen (the blood is unaerated) into capillaries in the lungs. The heart contains blood that is taken into into the right ventricle by the right atrium. Blood goes from the body to the atrium. Afterwards, blood is pumped into the pulmonary artery and into the lung capillaries. When the blood passes through the capillaries they go slowly to absorb the oxygen from the lungs. The oxygenated blood is taken through the pulmonary vein back into the heart through the left atrium and the left ventricle. == Anatomy == The pulmonary artery is an extension of the pulmonary trunk (Latin truncus pulmonaris). It extends from the right ventricle. It is located in front and to the left of all the vessels that flow in and out of the heart, and brings venous blood to the lungs (the only one of the human arteries, except for the umbilical arteries of the fetus). Afterwards, it brings the oxygenated back to the heart to be pumped throughout the body. The initial lobe of the pulmonary artery goes up and back and somewhat covers the beginning of the aorta. Next, lying to the left of the ascending aorta and in front of the left atrium, the pulmonary artery lies at the level of the IV thoracic vertebra under the concavity of the aortic arch. Here the pulmonary trunk is divided into: * right branch, right pulmonary artery (lat. arteria pulmonaris dextra); * left branch, left pulmonary artery (lat. arteria pulmonaris sinistra). Between the initial lobe of the left branch of the pulmonary artery and the concavity of the aortic arch is the connecting tissue cord - the arterial ligament (Latin ligamentum arteriosum). This is the remnant of the Botal duct (Latin ductus arteriosus (Botalli)), through which the fetus and blood entering the right ventricle are redirected from the pulmonary artery to the aorta: a small circle in the fetal stage of development does not function. In the future, the duct is obliterated (parallel overgrowth of the oval hole in the atrial septum). References Category:Blood vessels Category:Respiratory system Category:Anatomy of the respiratory system Category:Anatomy of the cardiovascular system Category:Cardiovascular system Category:Heart Category:Lungs",
 "title": "Pulmonary artery"
}