{
 "id": "512457",
 "text": "\"I'm Real\" is a song by American entertainer Jennifer Lopez from her second album J.Lo. It is an electropop and R&B; song. It samples the 1978 song \"Firecracker\" by Yellow Magic Orchestra. Fellow singer Mariah Carey was going to use this sample for her single \"Loverboy\", but \"I'm Real\" was released first. The song was later released as a remix featuring rapper Ja Rule, called \"I'm Real (Murder Remix)\". It reached number one on the Billboard Hot 100 and the top ten in the UK and Canada. == I'm Real (Murder Remix) == \"I'm Real (Murder Remix)\" is a remix of \"I'm Real\" featuring rapper Ja Rule. It is featured on the J.Lo album and her first remix album, J to tha L-O!: The Remixes. The song samples \"All Night Long\" by R&B; girl group The Mary Jane Girls and \"Mary Jane\" by R&B; singer Rick James. It is different from the original version because it is slower and has a more hip hop-sounding style. The song also got some bad press with Lopez saying the word \"niggas\" doing the third verse. ==Charts== Chart (2001) Peak position Australian Singles Chart 3 Austrian Singles Chart 25 Belgian Singles Chart (Flanders) 8 Belgian Singles Chart (Wallonia) 5 Brazil Top 20 Singles 9 Canadian Hot 100 6 Danish Singles Chart 8 Dutch Singles Chart 2 scope=\"row\" Finnish Singles Chart 16 French Singles Chart 3 German Singles Chart 11 Irish Singles Chart 13 Italian Singles Chart 16 New Zealand Singles Chart 3 Norwegian Singles Chart 4 Polish Singles Chart 27 Romanian Singles Chart 20 Swedish Singles Chart\"Swedishcharts.com – Jennifer Lopez – I'm Real\". Singles Top 60. Hung Medien. 8 Swiss Singles Chart\"Jennifer Lopez – I'm Real – swisscharts.com\" Swiss Singles Chart. Hung Medien. 6 U.K. Singles ChartOfficial Charts Company – Jennifer Lopez UK Singles Chart. The Official Charts Company. 4 U.S. Billboard Hot 100 1 U.S. Latin Pop Songs 28 U.S. Mainstream Top 40 1 U.S. Hot R&B;/Hip-Hop Songs[ Jennifer Lopez featuring Ja Rule - I'm Real]. Billboard. (Nielsen Business Media, Inc.). Retrieved 5-5-12. 2 ===Year-end charts=== Chart (2001) Position Australian Singles Chart 53 Belgium Singles Chart (Flanders) 82 Belgium Singles Chart (Wallonia) 62 Germany Singles Chart 80 Netherlands Mega Single Top 100 29 Sweden (Sverigetopplistan) 75 Switzerland Singles Chart 57 US Billboard Hot 100 5 Chart (2002) Position Australian Singles Chart 41 French Singles Chart 44 ===Decade-end charts=== Chart (2000s) Position Dutch Singles Chart 80 US Billboard Hot 100 30 ===Certifications=== |} ==References== ==Other websites== * * Category:2001 songs Category:Jennifer Lopez songs Category:Ja Rule songs Category:Dance-pop songs Category:Hip hop songs Category:R&B; songs Category:Billboard Hot 100 number one songs Category:Billboard Rhythmic Songs number-one singles",
 "title": "I'm Real (Jennifer Lopez song)"
}