{
 "id": "512487",
 "text": "Hard Core is the debut studio album by American rapper Lil' Kim. It was released on November 12, 1996 by Undeas Recordings and Big Beat Records.Vladimir Bogdanov, All Music Guide to Hip-hop: The Definitive Guide to Rap & Hip-hop (San Francisco, CA: Backbeat Books, 2003), p. 283 ==Track listing== ===Sample credits=== *\"Big Momma Thang\" contains a sample of Sylvester's \"Was It Something I Said\". *\"No Time\" contains a sample of Vicki Anderson's \"Message from the Soul Sisters\" and Lyn Collins's \"Take Me Just As I Am\" and The Notorious B.I.G. *\"Crush On You\" contains excerpts and a sample of Jeff Lorber's \"Rain Dance\" and Average White Band's \"If I Ever Lose This Heaven\" *\"Drugs\" contains a sample of Soul Mann & The Brothers \"Bumpy's Lament\". *\"Queen Bitch\" contains a sample of Roberta Flack's \"Hey, That's No Way to Say Goodbye\". *\"Dreams\" contains a sample of Lyn Collins's \"Think (About It)\" and Jimi Hendrix's \"Who Knows\". *\"M.A.F.I.A. Land\" contains a sample of Bert Kaempfert's \"Only a Fool\". *\"We Don't Need It\" contains a sample of Lou Donaldson's \"Ode to Billie Joe\" and Shirley Murdock's \"The One I Need\". *\"Not Tonight\" contains a sample of George Benson's \"Turn Your Love Around\". *\"Not Tonight (Ladies Night Remix)\" contains a sample of Kool & the Gang's \"Ladies Night\". ==Charts and certifications== ===Chart=== Chart (1996) Peak position Canadian Albums Chart 9 U.S. Billboard 200 11 U.S. Billboard Top R&B;/Hip-Hop Albums 1 ===Certifications=== Country Certification (sales thresholds) United States 2x Platinum (RIAA) ==Personnel== *Lil' Kim - vocals, rapping ;Technical personnel *Stretch Armstrong, Corn Bread, Andraeo \"Fanatic\" Heard, Carlos Broady, Stevie J., Fabian Hamilton, Ski - producer *Sean Combs, Christopher Wallace - executive producer, additional vocals *Kenny Ortiz, Phil Tan - engineer *Jermaine Dupri - producer, engineer *Tony Black - engineer, mixing *James Cruz, Herb Powers, Jr. - mastering *Junior M.A.F.I.A., Jay-Z - additional vocals *LaMarquis Mark Jefferson - bass ;Art personnel *Michael Lavine - photography ==Certifications== ==References== Category:1996 albums Category:Debut albums Category:Hip hop albums Category:Lil' Kim albums",
 "title": "Hard Core (Lil' Kim album)"
}