{
 "id": "512798",
 "text": "Sayreville, New Jersey is a borough on the Raritan River near Raritan Bay in New Jersey. ==Notable people== People who were born in, residents of, or otherwise closely associated with Sayreville include: * Barry T. Albin (born 1952), Justice of the New Jersey Supreme Court.Becker, Arielle Levin. \"Graduated in Borough: Sayreville honors 5 in H.S. hall of fame\" , Home News Tribune, May 21, 2005. Accessed December 18, 2014. \"After graduating from high school in 1970, inductee Barry T. Albin went on to earn a law degree, serving as an assistant prosecutor...\" * Jon Bon Jovi (born 1962), lead singer of the rock band Bon Jovi.Goodnough, Abby. \"In Brief: A Town Bids for Recognition By Renaming Highway Stops\", The New York Times, October 15, 1995. Accessed May 8, 2012. \"It used to be enough that the rock star Jon Bon Jovi hailed from Sayreville. Lately, though, the Middlesex County town is yearning for more recognition.\" * Randy Corman (born 1960), Sayreville councilmember who served in the New Jersey Senate.King, Wayne. \"Trenton Aims at Dinkins In Commuter-Tax Battle\", The New York Times, December 18, 1992. Accessed May 8, 2012. \"A New Jersey State Senator, Randy Corman, Republican of Sayreville, has introduced a bill he says will protect shoppers in New Jersey malls from being 'stalked' and 'spied upon.'\" * Patrick Crosby (born 1985), professional indoor lacrosse player.InLacrosseWeTrust. \"Meet a NALL Player\", InLacrosseWeTrust.com, November 4, 2012. Accessed April 3, 2014. \"Originally from Sayreville, New Jersey I grew up playing ice hockey my entire life.\" * Bob Dustal (born 1935), former pitcher for the Detroit Tigers.\"Bob Dustal\", Baseball-Reference.com, Accessed October 24, 2014. * Greg Evigan (born 1953), actor who appeared in B.J. and the Bear and My Two Dads.Dencker, Martha. \"Picking berries, making bricks: Memories of old-time Sayreville.\", The Star-Ledger, April 15, 1999. \"Among other indigenous pieces of Sayreville in the museum are memorabilia from two native sons: the rock star Jon Bon Jovi and actor Greg Evigan, who had leads in the television shows 'BJ and the Bear' and 'My Two Dads'.\" * Marilyn Ghigliotti (born 1961), actress who played the character Veronica Loughran in Kevin Smith's cult hit Clerks.Beckerman, Jim. \"It Was Slow Going at the Quick Stop: 'Clerks' Stars Kept Waiting\", The Record (Bergen County), November 4, 1994. Accessed August 15, 2007. \"A 20-year Sayreville resident, she plays Veronica, girlfriend of the hapless clerk Dante (O'Halloran).... A graduate of Sayreville High School and a friend of O'Halloran's for several years, Ghigliotti has acted opposite him in theater productions of Wait Until Dark and the off-off Broadway production Sabona.\" * Dulé Hill (born 1975), actor who has appeared in The West Wing and Psych.Granieri, Laurie. \"Sayreville native Dule Hill gears up for show's new season\" , Home News Tribune, August 7, 2009. Accessed December 18, 2014. \"The biggest challenge for me is not making Gus too nerdy or too cool. Because Gus is a nerd, says Hill, 34, who grew up in Sayreville and is a 1993 graduate of Sayreville War Memorial High School. \" * Tom Kelly (born 1950), former manager for the Minnesota Twins.Staff. \"Experts: Twins Will Play in 2002, But...\", St. Paul Pioneer Press, December 27, 2001. Accessed October 24, 2014. \"Former Twins manager Tom Kelly, who is from Sayreville, NJ, and attended St. Mary's High School in South Amboy, NJ, will be honored...\" * Bill Loguidice (born 1972), video game collector, producer, and technology book author.Slaughter, Sam. \"Video-game nirvana: Sayreville man’s passion for gaming systems yields two books, film in the making\" , North Brunswick Sentinel, November 25, 2010. Accessed February 15, 2011. \"Loguidice, a graduate of Sayreville War Memorial High School, has since spent his life collecting and playing video games.\" * Kevin Mulvey (born 1985), former pitcher for the Minnesota Twins and Arizona Diamondbacks.Burkard, Tom. \"Mulvey Promoted To Twins\", The South Amboy – Sayreville Times, July 25, 2009. Accessed April 30, 2015. \"On July 15th, Parlin’s Kevin Mulvey got the biggest call in his lifetime when he was promoted to the Minnesota Twins Major League Baseball Club.\"\"Kevin Mulvey\", Baseball-Reference.com. Accessed October 24, 2014. * Eddie Popowski (1913–2001), coach and two-time interim manager of the Boston Red Sox.Staff. \"Red Sox Shift Minor Pilots\", The New York Times, December 13, 1947. Accessed February 15, 2011. \"The signing of Eddie Popowski of Sayreville, NJ, as 1948 manager was announced today by the Lynn Red Sox of the Class B New England League.\" * Lea Bayers Rapp (born 1946), writer of non-fiction and children's fiction.Olivio, Andrea. \"Public invited to meet local authors at library\" , Old Bridge Suburban, April 7, 2005. Accessed February 15, 2011. \"Expected to attend are Sayreville authors Daniel Gary Holderman, Lea Bayers Rapp and Helen Boehm, as well as South Amboy authors Jerry Smith, Chelle Martin, Flo Fitzpatrick, Jim Carney, George Francy and Tom Burkard.\" * Rhonda Rompola (born 1960), coach of the Southern Methodist University women's basketball team since 1991.SMU Team Profile. * Dave Sabo (born 1964), rock guitarist who plays in the heavy metal band Skid Row.Makin, Robert. \"Kiss it Goodbye\" , Courier News (New Jersey), June 8, 2000. Accessed December 18, 2014. \"Lifelong members of the Kiss Army, such as guitarist Dave 'Snake' Sabo of Sayreville and music writer Jeff Kitts of Scotch Plains...\" * Mohamed Sanu (born 1989), wide receiver for the Cincinnati Bengals.Mohamed Sanu, WR for the Cincinnati Bengals, NFL.com. Accessed April 30, 2015. \"Born: 8/22/1989 Sayreville, NJ\" * James R. Sayre, Jr., and Peter Fisher, co-founders of Sayre and Fisher Brick Company in the 1850s, for which the town was named in 1876.Cheslow, Jerry. \"If You're Thinking of Living in Sayreville\", The New York Times, August 16, 1992. Accessed April 30, 2015. \"Named for James Sayre Jr. who, together with Peter Fisher, built the Sayre & Fisher Brick Works along the Raritan River in the 1850s, the Middlesex County borough remains primarily a blue collar community, although its white collar population has been growing recently, according to Mayor John B. McCormack.\"A Timeline of Sayreville History, Sayreville Historical Society. Accessed October 12, 2014. * Edward D. Thalmann (1945–2004), leading expert in diving medicine. * John S. Wisniewski (born 1962), New Jersey General Assemblyman, Deputy Speaker since 2004.Assembly Member John S. Wisniewski, Project Vote Smart. Accessed August 12, 2007. * Victor J. Wolski (born 1962), federal judge. ==References== ==Other websites== * Official Sayreville website * Sayreville Historical Society website Category:Boroughs in New Jersey Category:Middlesex County, New Jersey Category:1876 establishments in the United States Category:19th-century establishments in New Jersey",
 "title": "Sayreville, New Jersey"
}