{
 "id": "513020",
 "text": "\"Super Bass\" is a song by Trinidadian-American rapper Nicki Minaj. It is from her 2010 debut album Pink Friday. The song is listed as a bonus track on the deluxe edition of the album. It was released as a single from Pink Friday in 2011. This hip-hop and rap song contains electronic influences. While this happens, Minaj raps over a hip hop beat. The song was able to cross over into many genres on radio, such as pop, urban, and rhythmic. \"Super Bass\" was written by Minaj, Daniel Johnson, and Ester Dean, who also helps write songs for other recording artists such as Rihanna. The song was produced by Kane Beatz. The song's lyrics are about a playful romance between a man and a woman, according to Minaj. The song reached number three on the U.S. Billboard Hot 100 in 2011, as well as on the Mainstream Top 40/Pop Songs airplay chart. It topped the US Rhythmic Songs chart and reached number two on the Rap Songs chart. In Australia and Canada, the song reached number six, while it peaked at number eight in the United Kingdom. \"Super Bass\" finished as the eighth- best performing song of 2011 in the United States. On November 9, 2021, the song was certified Diamond by the RIAA for consumption of 10 million copies in the United States alone. ==Music video== The music video starts with Minaj with her eyes closed. As the song starts, she begins to open them. As Minaj raps through the verse of the song, she is shown with Barbie props. Later on in the song, Minaj starts to tease men. The props used proposed ice cream and a motorcycle that were made of ice. As the chorus begins, she and her five clones of her are performing choreography. After that, Minaj later dances in the dark lights. She also uses glow-in-the-dark accessories. Many critics have praised the music video. It is because of its vibrant, catchy looks. The song was nominated for \"Best Female Video\" and \"Best Hip-Hop Video\" categories at the 2011 MTV Video Music Awards. Later on, it won those awards. == Certifications == ==References== Category:2011 songs Category:Nicki Minaj songs Category:Pop songs Category:Dance songs Category:Hip hop songs",
 "title": "Super Bass"
}