{
 "id": "513231",
 "text": "This is a list of the kings, queens, and other rulers (\"monarchs\") of Russia, from 862 to 917. The list starts with Rurik, the ruler (Prince) of a state called Novgorod in 862. It ends with Nicholas the Second, who stopped ruling in 1917. Nicholas the Second and his family were killed in 1918. == Princes of Novgorod == Monarch Portrait Born-Died Relationship with Predecessor(s) Ruled from Ruled until Rurik 830-879 none 862 879 Oleg of Novgorod (regent) 855-912 Relative of Rurik and regent of Rurik's son, Prince Igor of Kiev 879 882 == Grand Princes of Kiev == Monarch Portrait Born-Died Relationship with Predecessor(s) Ruled from Ruled until Askold and Dir (non-Rurikids) ?-882 none 842Suszko, Henryk (2003). Latopis hustyński. Opracowanie, przekład i komentarze. Slavica Wratislaviensia CXXIV. Wydawnictwo Uniwersytetu Wrocławskiego. ; Tolochko, Oleksiy (2010). The Hustyn' Chronicle. (Harvard Library of Early Ukrainian Literature: Texts) according to the Tale of Bygone Years, the date is not clearly identified or 862 882 Oleg of Novgorod (regent) 855-912 Relative of Rurik and regent of Rurik's son, Prince Igor of Kiev 882 Autumn 912 Igor I 878-945 Son of Rurik 879 (in Novgorod, as an heir of Rurik); 913officially Autumn 945 Saint Olga of Kiev (regent) 890-969 Igor I's wife and regent of Sviatoslav I of Kiev 945 962 Sviatoslav I the Great 942–972 Son of Igor I and Olga of Kiev Autumn 945 March 972 Yaropolk I 950-980 Son of Sviatoslav I March 972 11 June 980 Saint Vladimir I the Great 958–1015 Younger son of Sviatoslav I, brother of Yaropolk I 11 June 980 15 July 1015 Sviatopolk I the Accursed 980–1019 Son of Vladimir I 15 July 1015 Autumn 1016 Yaroslav I the Wise 978–1054 Younger son of Vladimir I, brother of Sviatopolk I Autumn 1016 Summer 1018 Sviatopolk I the Accursed 980–1019 Son of Vladimir I 14 August 1018 27 July 1019 Yaroslav I the Wise 978–1054 Younger son of Vladimir I, Younger brother of Sviatopolk I 27 July 1019 20 February 1054 Iziaslav I 1024–1078 First son of Yaroslav I 20 February 1054 15 September 1068 Vseslav of Polotsk 1039–1101 Great-Grandson of Vladimir I. Usurped the Kievan Throne 15 September 1068 29 April 1069 Iziaslav I 1024–1078 First son of Yaroslav I 2 May 1069 22 March 1073 Sviatoslav II 1027–1076 Third son of Yaroslav I 22 March 1073 27 December 1076 Vsevolod I 1030–1093 Fourth son of Yaroslav I 1 January 1077 15 July 1077 Iziaslav I 1024–1078 First son of Yaroslav I 15 July 1077 3 October 1078 Vsevolod I 1030–1093 Fourth son of Yaroslav I 3 October 1078 13 April 1093 Sviatopolk II 1050–1113 Son of Iziaslav I 24 April 1093 16 April 1113 Vladimir II Monomakh 1053–1125 Son of Vsevolod I 20 April 1113 19 May 1125 Mstislav the Great 1076–1132 Son of Vladimir II 20 May 1125 15 April 1132 Yaropolk II 1082–1139 Son of Vladimir II, Younger brother of Mstislav 17 April 1132 18 February 1139 Viacheslav I 1083-2 February 1154 Son of Vladimir II 22 February 1139 4 March 1139 Vsevolod II 1084-1146 Grandson of Sviatoslav II 5 March 1139 30 July 1146 Igor II 1096-19 September 1146 Grandson of Sviatoslav II 1 August 1146 13 August 1146 Iziaslav II Panteleimon 1097–1154 Older son of Mstislav 13 August 1146 23 August 1149 Yuri I the Long Arms 1099–1157 Younger brother of Mstislav 28 August 1149 Summer 1150 Viacheslav I 1083-2 February 1154 Son of Vladimir II Summer 1150 Summer 1150 Iziaslav II Panteleimon 1097–1154 Older son of Mstislav Summer 1150 Summer 1150 Yuri I the Long Arms 1099–1157 Younger brother of Mstislav August 1150 Winter 1151 Iziaslav II Panteleimon 1097–1154 Older son of Mstislav Winter 1151 13 November 1154 Viacheslav I 1083-2 February 1154 Son of Vladimir II Spring 1151 6 February 1154 Rostislav I 1110–1165 Second son of Mstislav 1154 January 1155 Iziaslav III ?-1162 Grandson of Sviatoslav II January 1155 1155 Yuri I the Long Arms 1099–1157 Younger brother of Mstislav 20 March 1155 15 May 1157 Iziaslav III ?-1162 Grandson of Sviatoslav II 19 May 1157 December 1158 Mstislav II 1125–1170 Son of Iziaslav III 22 December 1158 Spring 1159 Rostislav I 1110–1167 Second son of Mstislav 12 April 1159 8 February 1161 Iziaslav III ?-1162 Grandson of Sviatoslav II 12 February 1161 6 March 1161 Rostislav I 1110–1167 Second son of Mstislav March 1161 14 March 1167 Vladimir III 1132–1173 Younger son of Mstislav Spring 1167 Spring 1167 Mstislav II 1125–1170 Son of Iziaslav III 19 May 1167 12 March 1169 == Grand Princes of Vladimir == Monarch Portrait Born-Died Relationship with Predecessor(s) Ruled from Ruled until Saint Andrei I Bogolyubsky 1110–1174 Son of Yuri I 15 May 1157 29 June 1174 Mikhail I ?-1176 Brother of Andrei I 1174 September 1174 Yaropolk ?-after 1196 Grandson of Vladimir II 1174 15 June 1175 Mikhail I ?-1176 Brother of Andrei I 15 June 1175 20 June 1176 Vsevolod III the Big Nest 1154–1212 Brother of Andrei I and Mikhail I June 1176 15 April 1212 Yuri II 1189–1238 Son of Vsevolod III 1212 27 April 1216 Konstantin of Rostov 1186–1218 Son of Vsevolod III Spring 1216 2 February 1218 Yuri II 1189–1238 Son of Vsevolod III February 1218 4 March 1238 Yaroslav II 1191–1246 Son of Vsevolod III 1238 30 September 1246 Sviatoslav III 1196–3 February 1252 Son of Vsevolod III 1246 1248 Mikhail Khorobrit 1229–15 January 1248 Son of Yaroslav II 1248 15 January 1248 Sviatoslav III 1196– 3 February 1252 Son of Vsevolod III 1248 1249 Andrey II 1221–1264 Son of Yaroslav II December 1249 24 July 1252 Saint Alexander I Nevsky 1220–1263 Son of Yaroslav II 1252 14 November 1263 Yaroslav III 1230–1272 Son of Yaroslav II 1264 1271 Vasily of Kostroma 1241–1276 Son of Yaroslav II 1272 January 1277 Dmitry of Pereslavl 1250–1294 Son of St. Alexander 1277 1281 Andrey III 1255–1304 Son of St. Alexander 1281 December 1283 Dmitry of Pereslavl 1250–1294 Son of St. Alexander December 1283 1293 Andrey III 1255–1304 Son of St. Alexander 1293 1304 Saint Michael of Tver 1271–1318 Son of Yaroslav III Autumn 1304 22 November 1318 Yuri (III) of Moscow 1281–1325 Grandson of St. Alexander 1318 2 November 1322 Dmitry I the Terrible Eyes 1299–1326 Son of St. Michael 1322 15 September 1326 Alexander of Tver 1281–1339 Son of St. Michael 1326 1327 Alexander of Suzdal ?–1331 Grandson of Andrey II 1328 1331 Ivan I of Moscow Kalita 1288–1340 Grandson of St. Alexander 1332 31 March 1340 Since 1331 the title of the Grand Princes of Vladimir was assigned to the Princes of Moscow. == Grand Princes of Moscow == Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Daniel Son of St. Alexander 1261 unknown 1283 4 March 1303 4 March 1303, Moscow, Russia Yury Son of Daniel 1281 unknown 4 March 1303 21 November 1325 21 November 1325, Moscow, Russia Ivan I Kalita Son of Daniel 1288 Helena 9 children 21 November 1325 31 March 1340 31 March 1340, Moscow, Russia Simeon the Proud Son of Ivan I 7 November 1316 Anastasia of Lithuania no children Euphraxia of Smolensk no children Maria of Tver 4 sons (died young) 31 March 1340 27 April 1353 27 April 1353, Moscow, Russia Ivan II the Handsome Son of Ivan I 30 March 1326 Fedosia Dmitrievna of Bryansk no children Alexandra Ivanovna Velyaminova 4 children 27 April 1353 13 November 1359 13 November 1359, Moscow, Russia Saint Dmitry I Donskoy Son of Ivan II 12 October 1350 Eudoxia Dmitrievna of Nizhny Novgorod 12 children 13 November 1359 19 May 1389 19 May 1389, Moscow, Russia Vasily I Son of Dmitry I 30 December 1371 Sophia of Lithuania 9 children 19 May 1389 27 February 1425 27 February 1425, Moscow, Russia Vasily II the Blind Son of Vasily I 10 March 1415 Maria Yaroslavna of Borovsk 3 children 27 February 1425 30 March 1434 27 March 1462, Moscow, Russia Yury of Zvenigorod no image Son of Dmitry I 26 November 1374 Anastasia Yurynovna 3 children 31 March 1434 5 June 1434 5 June 1434, Moscow, Russia Vasily Kosoy no image Son of Yury of Zvenigorod 1421 5 June 1434 1435 1435, Moscow, Russia Vasily II the Blind Son of Vasily I 10 March 1415 Maria Yaroslavna of Borovsk 3 children 1435 1446 27 March 1462, Moscow, Russia Dmitry Shemyaka no image Son of Yury of Zvenigorod 1446 26 March 1447 1453, Moscow, Russia Vasily II the Blind Son of Vasily I 10 March 1415 Maria Yaroslavna of Borovsk 3 children 27 February 1447 27 March 1462 27 March 1462, Moscow, Russia Ivan III the Great Son of Vasily II 22 January 1440 Maria Borisovna of Tver one son Sophia Palaiologina 8 children 5 April 1462 6 November 1505 6 November 1505, Moscow, Russia Vasily III Son of Ivan III 25 March 1479 Solomonia Yuryevna Saburova no children Elana Vasilyevna Glinskaya 2 sons 6 November 1505 13 December 1533 13 December 1533, Moscow, Russia Ivan IV the Terrible Son of Vasily III 25 August 1530 unmarried as Prince 13 December 1533 26 January 1547 28 March 1584 ==Tsars of Russia== Dates are listed in the Old Style, which continued to be used in Russia. ===House of Rurikovich=== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Ivan IV the Terrible Son of Vasily III 25 August 1530, Kolomenskoye, Russia Anastasia Romanovna Zakharyina-Yurieva 6 children Maria Temryukovna one son (died young) Marfa Vasilevna Sobakina Anna Alexeievna Koltovskaya Anna Vasilchikova Vasilisa Melentyeva Maria Dolgorukaya Maria Feodorovna Nagaya 26 January 1547 28 March 1584 28 March 1584, Moscow, Russia Simeon II no image None Anastasia Mstislavskaya (great great granddaughter of Ivan III) 1575 1576 5 January 1616, Moscow, Russia Feodor I Son of Ivan IV 31 May 1557, Moscow, Russia Irina Feodorovna Godunova one daughter 28 March 1584 17 January 1598 17 January 1598, Moscow, Russia ===Time of Troubles=== ====House of Godunov==== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Irina (disputed) Wife of Feodor I c.1557 Feodor I of Russia a daughter 7 January 1598 15 January 1598 29 October 1603, Moscow, Russia Boris I Brother of Irina c.1551, Vyazma, Russia Maria Grigorievna Skuratova- Belskaya 2 children 21 February 1598 13 April 1605 13 April 1605, Moscow, Russia Feodor II Son of Boris I 1589, Moscow, Russia unmarried, no children 13 April 1605 1 June 1605 1 June 1605, Moscow, Russia ====Pseudo-Rurikovich usurpers==== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death False Dmitry I (Grigory Bogdanovich Otrepyev) None c. 1581 Marina Mniszech no children 1 June 1605 17 May 1606 17 May 1606, Moscow, Russia False Dmitry II None c. 1582 Marina Mniszech one son (posthumous) 10 July 1607 11 December 1610 11 December 1610, Kaluga, Russia False Dmitry III (Sidorka) no image None unknown unknown 28 March 1611 18 May 1612 July 1612 ====House of Shuysky==== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Vasiliy IV Ninth generation descendant of Andrei II in the male line 22 September 1552, Nizhny Novgorod, Russia Elena Mikhailovna Repnina no children Maria Buynosova-Rostovskaya 2 children 19 May 1606 17 July 1610 (deposed) 12 September 1612, Gostynin, Poland ====House of Vasa==== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Vladislav I None 9 June 1595, Łobzów, Poland Cecilia Renata of Austria a daughter and a son, Sigismund Casimir Marie Louise Gonzaga no children 6 September 1610 November 1612 (deposed) 14 June 1634 (resigned his claim) 20 May 1648, Merkinė, Lithuania ===House of Romanov=== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Michael I First cousin once removed of Feodor I 12 July 1596 Moscow, Tsardom of Muscovy Maria Vladimirovna Dolgorukova 1624 one stillborn child Eudoxia Lukyanovna Streshneva 5 February 1626 ten children 26 July 1613 12 July 1645 12 July 1645, Moscow, Tsardom of Muscovy Alexis I the Quietest Son of Michael I 9 May 1629 Moscow, Tsardom of Muscovy Maria Ilyinichna Miloslavskaya 17 January 1648 13 children Natalia Kirillovna Naryshkina 1 February 1671 3 children 12 July 1645 29 January 1676 29 January 1676, Moscow, Tsardom of Muscovy Feodor III Son of Alexis I 9 June 1661 Moscow, Tsardom of Muscovy Agaphia Simeonovna Grushevskaya 28 July 1680 one son Marfa Matveievna Apraksina 24 February 1682 no children 29 January 1676 7 May 1682 7 May 1682, Moscow, Tsardom of Muscovy Sophia (regent) Daughter of Alexis I 17 September 1657 Moscow, Tsardom of Muscovy unmarried, no children 17 May 1682 27 August 1689 3 July 1704, Moscow, Tsardom of Muscovy Ivan V jointly with Peter I Son of Alexis I 6 September 1666 Moscow, Tsardom of Muscovy Praskovia Feodorovna Saltykova 1684 5 daughters 2 June 1682 8 February 1696 8 February 1696, Moscow, Tsardom of Muscovy Peter I the Great jointly with Ivan V 1682–1696 Son of Alexis I 9 June 1672 Moscow, Tsardom of Muscovy Eudoxia Feodorovna Lopukhina 1689 3 children Marta Helena Skowrońska 1707 9 children 2 June 1682 2 November 1721 8 February 1725, St. Petersburg, Russian Empire ==Emperors of Russia== Monarch Portrait Relationship with Predecessor(s) Birth Marriage Ruled from Ruled until Death Peter I the Great Son of Alexis I 9 June 1672 Moscow, Tsardom of Russia Eudoxia Feodorovna Lopukhina 1689 3 children Marta Helena Skowrońska 1707 9 children 2 November 1721 8 February 1725 8 February 1725, St. Petersburg, Russian Empire Catherine I Wife of Peter I 15 April 1684 Ringen (Rõngu), Duchy of Livonia, Sweden Peter I of Russia 1707 9 children 8 February 1725 17 May 1727 17 May 1727, St. Petersburg, Russian Empire Peter II Grandson of Peter I 23 October 1715 St. Petersburg, Tsardom of Russia unmarried 18 May 1727 30 January 1730 30 January 1730, Moscow, Russian Empire Anna Daughter of Ivan V 7 February 1693 Moscow, Tsardom of Russia Frederick Wilhelm, Duke of Courland November 1710 no children 13 February 1730 28 October 1740 28 October 1740, St. Petersburg, Russian Empire Ivan VI Great-grandson of Ivan V 23 August 1740 St. Petersburg, Russian Empire unmarried 28 October 1740 6 December 1741 16 July 1764 (murdered) Shlisselburg, Russian Empire Elizabeth Daughter of Peter I 29 December 1709 Kolomenskoye, Tsardom of Russia Alexey Razumovsky 1742 no children 6 December 1741 5 January 1762 5 January 1762, St. Petersburg, Russian Empire Peter III Grandson of Peter I 21 February 1728 Kiel, Schleswig-Holstein Princess Sophie Friederike Auguste of Anhalt-Zerbst 16 August 1745 one son 9 January 1762 9 July 1762 17 July 1762 (murdered), Ropsha, Russian Empire Catherine II the Great Wife of Peter III 2 May 1729 Stettin, Kingdom of Prussia Peter III of Russia 16 August 1745 one son 9 July 1762 17 November 1796 17 November 1796, St. Petersburg, Russian Empire Paul I Son of Peter III 1 October 1754 St. Petersburg, Russian Empire Princess Wilhelmina Louisa of Hesse-Darmstadt 29 September 1773 one stillborn son Princess Sophie Dorothea of Württemberg 26 September 1776 ten children 17 November 1796 23 March 1801 23 March 1801 (assassinated) St. Petersburg, Russian Empire Alexander I the Blessed Son of Paul I 23 December 1777 St. Petersburg, Russian Empire Princess Louise of Baden 28 September 1793 2 daughters 23 March 1801 1 December 1825 1 December 1825, Taganrog, Russian Empire Constantine I (disputed) Son of Paul I 27 April 1779 Tsarskoye Selo, Russian Empire Princess Juliane of Saxe-Coburg-Saalfeld 26 February no children 1 December 1825 26 December 1825 27 June 1831 Vitebsk, Russian Empire Nicholas I Son of Paul I 6 July 1796 Gatchina, Russian Empire Princess Charlotte of Prussia 13 July 1817 7 children 1 December 1825 2 March 1855 2 March 1855, St. Petersburg, Russian Empire Alexander II the Liberator Son of Nicholas I 29 April 1818 Moscow, Russian Empire Princess Marie of Hesse and by Rhine 16 April 1841 8 children 2 March 1855 13 March 1881 13 March 1881 (assassinated) St. Petersburg, Russian Empire Alexander III the Peace-Maker Son of Alexander II 10 March 1845 St. Petersburg, Russian Empire Princess Dagmar of Denmark 9 November 1866 6 children 13 March 1881 1 November 1894 1 November 1894 Livadiya, Russian Empire Saint Nicholas II Son of Alexander III 6 May 1868 Tsarskoye Selo, Russian Empire Princess Alix of Hesse and by Rhine 26 November 1894 5 children 1 November 1894 15 March 1917 17 July 1918 (executed) Yekaterinburg, Russian SFSR Michael II (disputed) Son of Alexander III 22 November 1878 Tsarskoye Selo, Russian Empire Natalia Brassova 15 October 1911 one son (born before his parents' marriage) 15 March 1917 16 March 1917 (formally, 1 September 1917, the formal abolishment of monarchy) 12 June 1918 (murdered) Perm, Russian SFSR ==References== Category:Lists of monarchs Russ Category:Russian royalty",
 "title": "List of Russian monarchs"
}