{
 "id": "513236",
 "text": "Dream Street is the second studio album by American recording artist Janet Jackson. It was released in September 1984 by A&M; Records. The album was produced by her brother, Marlon Jackson. Her brother Michael Jackson added vocal ad-libs. During the summer of 1984 it was a top ten R&B; hit. ==Track listing== ==Charts== Chart (1984) Peak position U.S. Billboard 200 147 U.S. Billboard Top R&B;/Hip-Hop Albums 19 ==Personnel and production== *\"Don't Stand Another Chance\" & \"All My Love to You\" produced by Marlon Jackson for V.B.M. Productions; associate producer on track 1: John Barnes. Track 1 arranged by Marlon Jackson & John Barnes; track 2 arranged by Marlon Jackson & Tony Patler. \"Don't Stand Another Chance\" recorded & mixed by Bill Botrill. \"All My Love To You\" recorded & mixed by Jeremy Smith. John Barnes: Keyboards, Moog Bass, Fairlight Programming & Drum Programming (track 1); Jonathan Moffat: Simmons Drums (track 1); Jackie/Michael/Tito Jackson, Dino Espinosa: Vocal Backing (track 1); Marlon Jackson: Drum Programming & Vocal Backing (track 2); Greg Phillinganes: Keyboards, Moog Bass; Tony Patler: Keyboards; Maxine & Julia Waters, Marva King: Vocal Backing (track 2) *\"Fast Girls\" & \"Pretty Boy\" arranged & produced by Jesse Johnson. Recorded by Peter Martinsen. Mixed by Peggy McCreery. Remixed by Peter Martinsen. *\"Communication\", \"If It Takes All Night\", \"Dream Street\", \"Hold Back the Tears\" & \"Two to the Power of Love\" produced by Giorgio Moroder & Pete Bellotte. All tracks arranged by Phil Shenale & Arthur Barrow, except \"Hold Back the Tears\" (arranged by Mitchell Froom). Recorded by Steve Bates & Steve Hodge; Mixed by Brian Reeves. Mitchell Froom, Phil Shenale: Keyboards; Arthur Barrow: Bass & Keyboards; Richie Zito: Guitars **Mastered by Brian Gardner at Bernie Grundman Mastering. ==References== Category:1984 albums Category:Janet Jackson albums Category:Pop albums Category:Synth-pop albums Category:R&B; albums",
 "title": "Dream Street (Janet Jackson album)"
}