{
 "id": "51347",
 "text": "The Nanjing Massacre was a massacre (an unjust killing of many people) that happened in Nanjing, China, in December of 1937 and January of 1938. It was part of the Second Sino-Japanese War, which was the part of World War II between China and Japan. At the time, Japan was trying to take over China and Nanjing was the Chinese capital. The Japanese Army reached Nanjing on 13 December 1937 and began killing and raping thousands upon thousands of people. Some Japanese claim the fighting in Nanjing was the same or not much worse than fighting in other places and in other wars. That is simply untrue. There is a lot of evidence from the Chinese, from outsiders who were there, from outsiders who have studied it, and from the Japanese themselves that things were much worse. There were many, many war crimes: soldiers without weapons were killed; people who were not soldiers were killed; many were tortured (hurt very badly), mutilated (hurt in ways that can never be fixed), or killed in very cruel ways; many were raped (forced to have sex) or forced to work and treated like things. We have the orders from the soldier's leaders telling them to do these kinds of things and not to follow rules against them. The Nanjing Massacre was so bad that some even think of it as a kind of genocide (trying to wipe out an entire group of people). The memory of the Nanjing Massacre—and anger at attempts to deny that it happened or to honor the soldiers who led it at the Yasukuni Shrine in Tokyo—still cause difficulty between the Chinese and Japanese governments and between Chinese and Japanese people. ==Names== The Nanjing Massacre is also known as the . It was known at the time as the or the . The name of Nanjing has not changed: it was then and now, but people have changed the way they spell the sounds of Chinese names using the Latin alphabet. \"Nanking\" was the Postal Map spelling, which usually tried to spell words the way local people said them around the year 1900. \"Nanjing\" is the pinyin spelling, which spells words the way they should sound in Mandarin Chinese. The Mandarin Chinese name for the Nanjing Massacre is the Nánjīng Dàtúshā, which means the same thing. (Part-by-part, dàtúshā could mean \"a big butchering and killing\" but, taken all together, it is just the Chinese word for \"massacre\".) It is written in traditional Chinese writing and in the easier Chinese writing now used by mainland China and Singapore. The Japanese can use similar names but often prefer to call it the Nankin Jiken, which just means \"The Thing that Happened in Nanjing\". It is written in Japanese writing. == The massacre == The Nanjing Massacre lasted over six weeks. During this time, soldiers of the Imperial Japanese ArmyLevene, Mark; Roberts, Penny (1999). The Massacre in History. Berghahn Books. pp. 223–224. .Totten, Samuel; Bartrop, Paul R. (2008). Dictionary of Genocide. Greenwood. pp. 298–299. .Chang, Iris (2007). The Rape of Nanking: The Forgotten Holocaust of World War II. Penguin Books. p. 6. . * murdered Chinese civilians; * murdered Chinese soldiers who had given up their weapons; * stole and looted whatever they wanted; * set buildings on fire to destroy them; and * raped and tortured children and adults. ===Mass murder of civilians=== During the six weeks of the Nanjing massacre, the Imperial Japanese Army (IJA) massacred between 40,000 and 300,000 people. It is difficult to know exactly how many people were killed in this mass murder, because the IJA burnt many bodies, buried others in mass graves, and dumped others in the Yangtze River. Because of this, scholars and historians do not agree on exactly how many civilians were killed.Judgment (English Translation): Chapter VIII, Conventional War Crimes (Atrocities). International Military Tribunal for the Far East. November 1, 1948. Retrieved April 14, 2016.Marquand, Robert (August 20, 2001). \"Why the Past Still Separates China and Japan\". Christian Science Monitor. Retrieved April 14, 2016.p. 1015 However, historians agree that the Imperial Japanese Army began massacring Chinese civilians the day they entered Nanjing. On that day, John Rabe, a German businessman and Nazi Party member, wrote in his diary: \"We come across corpses every 100 to 200 yards. The bodies of civilians that I examined had bullet holes in their backs. These people had ... been [running away] and were shot from behind.\"p. 67 In another massacre, Japanese soldiers shot thousands of Chinese people with machine guns. They left their bodies in a trench they named the \"Ten-Thousand-Corpse Ditch.\" Most historians think that more than 12,000 people were killed in this massacre.Yin, James (1996). The Rape of Nanking: An Undeniable History in Photographs. Chicago: Innovative Publishing Group. p. 103. . The IJA also massacred about 100 Hui people (a minority group in China who are mostly Muslim). ===Torture of civilians=== For the entire six weeks of the Massacre, the Imperial Japanese Army kept killing Chinese civilians. They killed in cruel, brutal ways and often tortured their victims before killing them. For example, in 1984, ex-IJA soldier Kozo Tadokoro admitted: Another ex-soldier named Nagatoni admitted that Japanese soldiers tortured people to death by doing things like: * Throwing them into pots of boiling water * Burying them while they were still alive so they would suffocate * Burying them with only their heads above ground so they would starve * Throwing infants into the air and catching them on bayonets In 2010, a Japanese woman named Tamaki Matsuoka made a documentary film about the Nanjing Massacre. In the film, former IJA soldiers admit that they often raped Chinese women and massacred Chinese civilians. However, out of the 250 former soldiers that Matsuoka interviewed, only three felt bad about what they had done. One former solder, Sho Mitani, said: ===Rape=== During the Massacre, the Japanese soldiers raped about 20,000 women including children and the elderly.p. 1012 Soldiers would go from door to door, searching for girls. When they found one, they would take her and rape her as a group. If anyone tried to stop the soldiers, the soldiers would shoot them.p. 77 Right after they raped the women, the Japanese soldiers would often kill them, sometimes by mutilating their sex organs. One survivor of the massacre said that sons were forced to rape their mothers, and fathers were forced to rape their daughters.Qi, Gio (August 1938). Shendu xueluilu. Xining Pingbao. Quoted in Chang, Iris (1997). The Rape of Nanking: The Forgotten Holocaust of World War II. Penguin Books. p. 95. . One group of soldiers gang- raped a pregnant woman, who gave birth only a few hours later (the baby did not seem to be hurt).Edgerton, Robert B. (1999). Warriors of the Rising Sun: A History of the Japanese Military. Basic Books. pp. 247-8. . Japanese soldiers also raped Buddhist nuns and forced monks to rape women. ====Witnesses' stories==== On 19 December 1937, the Reverend James M. McCallum wrote in his diary: Another witness to the rapes in Nanjing was Robert O. Wilson. He was a surgeon at an American hospital in Nanjing. On December 15 and 18, 1937, he wrote to his family: ===Killing of prisoners of war=== Starting in 1931, an international law called the Third Geneva Convention said it was illegal to treat prisoners of war in certain ways. It said these prisoners had rights for example, the right to have a trial before being executed. However, in August 1937, Hirohito, the Emperor of Japan, had decided that neither he nor the army would follow any international laws about how Chinese prisoners of war had to be treated. Right after the IJA took over Nanjing, they started searching for ex-Chinese soldiers. They took thousands of young men as prisoners. Some of these men were never soldiers; the IJA just assumed they were. Without any trials, the IJA took many of these young men to the Yangtze River and killed them with machine guns. According to confessions made by former IJA soldiers, on December 13 and 14, 1937, a unit of IJA soldiers had taken 14,777 Chinese prisoners of war. In the next few days, they took another 2,0003,000 prisoners. In two days, the IJA massacred every one of these prisoners of warover 15,000 people. In their confessions, the former IJA soldiers said their military leaders had ordered them to do this. Over the six weeks of the massacre, the IJA killed a total of about 30,000 Chinese prisoners of war.p. 1015 ===Theft and arson=== The Japanese Army left most of the buildings in Nanjing destroyed by looting and arson. They destroyed newly built government buildings as well as many civilians' homes. Soldiers also stole whatever they wanted. Because the Imperial Japanese Army was so much stronger than the Chinese soldiers and civilians in Nanjing, the Chinese could not fight back. This meant the Japanese could take all of the city's valuable things for themselves. ==End of the massacre== In January 1938, the Imperial Japanese Army announced that Nanjing was in \"order\" again. In the first week of February, it created a government that would obey all of Japan's needs. After that, the IJA left. The massacre was over. ==Trial and punishment== On September 2, 1945, Japan surrendered to the Allied Powers. This ended World War II.Donnelly, Mark (1999). Britain in the Second World War. Routledge. p. xiv. . Soon after this, the Allied Powers began creating international military courts. To try Japan's leaders for war crimes and crimes against humanity, they created the International Military Tribunal for the Far East (IMTFE). ===International Military Tribunal for the Far East=== Three of the Japanese Imperial Army's leaders in Nanjing were put on trial at the IMTFE: * General Iwane Matsui, who was in charge of all of the Japanese soldiers at Nanjing * General Akira Muto, who led soldiers during the worst part of the massacre * Kōki Hirota, who was the Foreign Minister during the massacre. He was accused of helping plan the massacre, and not doing anything to stop it All three of these men were found guilty of \"Class A\" war crimes. This meant they had been found guilty of planning and being in charge of the war. All three were sentenced to death and were executed. ===The Nanjing War Crimes Tribunal=== In 1946, the Chinese government created the Nanjing War Crimes Tribunal. This court tried General Matsui's lieutenant, Hisao Tani, for his part in the Nanjing Massacre. It found him guilty and sentenced him to death. ==Denial== The Nanjing Massacre is still very controversial in Japan. Only a small number of Japanese writers say the Massacre never happened at all.Yoshida, Takashi (2006). The Making of the \"Rape of Nanking\": History and Memory in Japan, China, and the United States. pp. 157–58. . Most of the argument over the massacre has to do with how many Chinese people died. Some scholars say that many fewer Chinese people died than most historians say.Fogel, Joshua A. (2008). The Nanjing Massacre in History and Historiography. University of California Press. pp. 46-8. .Dillon, Dana R. (2007). The China Challenge: Standing Strong Against the Military, Economic and Political Threats that Imperil America. Roman & Littlefield Publishers. pp. 9–10. . For example, Japanese writer Tanaka Masaaki says that only a few hundred civilians died in Nanjing. As of 2014, Japan still honored fourteen \"Class A\" war criminalsincluding the three who were in charge of the Nanjing Massacreat a national shrine. ===Evidence=== There is a lot of proof that the Nanjing Massacre happened the way most historians and survivors say it did. This proof includes: * The memories of people who survived the massacre. * The diaries and confessions of Japanese soldiers who took part in the massacre. * Letters, diaries, and memories from people, like doctors and missionaries, who stayed to try to help. * Photographs and movies. ** For example, American missionary John Magee stayed in Nanjing so he could record what was happening on film and with photographs. * Mass graves of people who were all killed in the same way. ==Photo gallery== ===During the massacre=== File:Iwane Matsui rides into Nanjing.jpg|General Matsui leads IJA troops into Nanjing on December 13, 1937 File:Japanese looting near a gate, Nanking massacre.JPG|Japanese soldiers looting from stores and dead Chinese people File:Bodies piled on the shore of Yangtze River, Nanking Massacre.jpg|Bodies piled at the Yangtze River File:Chinese to be beheaded in Nanking Massacre.jpg|A man who refused to get women for soldiers to rape is being executed File:Photo 13 (The \"Shame\" Album).jpg|A photo taken and saved by a Chinese person working in a photo shop in Nanjing ===Trial and punishment=== File:IMTFE court chamber.jpg|The International Military Tribunal for the Far East at work (1946) File:Nanjing Tribunal investigates remains of Nanjing Massacre victims 3.jpg|The Nanjing Tribunal looks at the skeletons of massacre victims (1946) File:Tani Hisao on trial 1.jpg|Hisao Tani on trial in Nanjing (1947) File:Execution of Tani Hisao 1.jpg|Hisao Tani being taken to his execution (1947) ===Memorials: The Nanjing Massacre Museum=== File:The monument in the front of Nanjing Massacre Memorial Hall (20090614 9921).jpg|Memorial statue in front of the Museum File:Skeletons, Nanjing Massacre.jpg|A mass grave of massacre victims that was found underground when the Museum was being built File:Nanjing massacre low relief1.jpg|Memorial sculpture at the Museum File:Eternal flame, Nanjing massacre memorial.jpg|\"Eternal (always-burning) flame\" honoring the dead File:Nanjing massacre footprints of survivors.jpg|\"Footprints of massacre survivors\" memorial == Related pages == * World War II ** Second Sino-Japanese War * Empire of Japan ** Imperial Japanese Army * War crimes * Crimes against humanity ==Notes== == References == Category:1937 Category:1938 in Asia Category:1930s in China Category:20th-century crimes Category:Crimes against humanity Category:Second Sino-Japanese War Category:War crimes Massacre Category:Genocides in Asia Category:Human rights abuses in Asia Category:Incidents of violence against women",
 "title": "Nanjing Massacre"
}