{
 "id": "513469",
 "text": "Daniel Jackson Evans (October 16, 1925 – September 20, 2024) was an American politician. He was the Governor of the state of Washington for three terms from 1965 to 1977. He represented Washington in the United States Senate from 1983 to 1989.Congressional Biography, accessed online 13 August 2007. ==Early life== Evans was born in Seattle, Washington. He was in the United States Navy during the later years of World War II. Evans studied at the University of Washington. He originally studied to be a structural engineer. ==Political career== ===Governor of Washington (1965-1977)=== Evans was the 16th governor from 1965 until 1977. He is the only governor to serve three four-year terms in a row. A 1981 University of Michigan study named him one of the ten outstanding American governors of the 20th century. He chose not to run for a fourth term. Serial killer Ted Bundy served as a campaign aide for Evans and maintained a close relationship with the Governor. During the 1972 campaign, Bundy followed Evans' Democratic opponent around the state, tape recording his speeches and reported back to Evans personally. ===United States senator (1983-1989)=== In 1983, Governor John Spellman appointed Evans to the United States Senate to fill a seat left vacant by the death of longtime senator Henry M. Jackson. Evans won a special election later that year against Mike Lowry and filled the remainder of Jackson's unexpired term, retiring from politics after the 1988 elections. He was not happy as a U.S. Senator; he wrote an April 1988 piece in The New York Times Magazine, \"Why I'm Quitting the Senate\", in which he complained of fighting and lack of action. ==Failed vice presidential bids== Evans was seriously considered for the Republican vice presidential nomination on the ticket with Gerald Ford in 1976 (but lost out to Bob Dole). Richard Nixon in 1968 had also hinted at a possible Evans nomination for the vice presidency. At the 1968 Republican National Convention (where he gave the keynote address) Evans refused to endorse Nixon for the presidential nomination, remaining a supporter of the unsuccessful candidacy of Nelson Rockefeller.McHenry 2007, p. 24–25. ==Personal life== Evans married Nancy Bell in 1959. Together, they had three sons, Daniel Jr., Mark and Bruce. Nancy Evans, died on January 26, 2024 from breast cancer at age 90. Evans died on September 20, 2024 in Seattle, at the age of 98. He was the last living former U.S. senator born in the 1920s. ==References== ==Other websites== *Congressional Biography *The Daniel J. Evans School of Public Affairs Category:1925 births Category:2024 deaths Category:American Calvinists Category:Congregationalists Category:Governors of Washington (state) Category:Politicians from Seattle Category:United States senators from Washington (state) Category:Republican Party (United States) politicians",
 "title": "Daniel J. Evans"
}