{
 "id": "513584",
 "text": ":This list is now maintained through the Category People from Kansas City, Missouri. To add to that list, add the tag (in brackets) \"Category: People from Kansas City\" to the page you wish listed. This is a list of people who were born or lived a significant part of their lives in Kansas City, Missouri or the Kansas City Metropolitan Area. *Bud Abell - linebacker in the American Football League; born in Kansas City *Oleta Adams – singer *Amy Alcott – professional golfer; born in Kansas City *M.A. Alford - multimedia artist *Henry Wilson Allen - Western author and screenwriter *Robert Altman – film director *Raleigh DeGeer Amyx - collector of Olympic and Presidential memorabilia *Nate Archibald – basketball player with Kansas City Kings * Stewart Ashby, Jr. - rapper *Brooke Ashley – adult actress and Miss Teen Kansas City runner-up *Edward Asner – actor, born in Kansas City *Ashley Aull – 2006 Miss Kansas USA *Burt Bacharach – pianist and composer *Parrish Baker - cartoonist *Kay Barnes – mayor of Kansas City 1999–2007 *H. Roe Bartle – mayor of Kansas City and namesake of Kansas City Chiefs *Count Basie – jazz musician and bandleader *Noah Beery – actor *Wallace Beery – Oscar-winning actor *Thomas Hart Benton – artist *Richard L. Berkley – politician, former mayor *Ken Berry - baseball player *Danni Boatwright - Survivor: Guatemala winner; Miss Kansas *George Brett – Hall of Fame baseball player *Diane Brewster - actress *Walter Brown – blues musician *Sylvia Browne – psychic and medium * Melvin Calhoun - rapper *John D. Carmack – game programmer *Joe Carter – baseball player with Cleveland Indians and Toronto Blue Jays, lives in the city *Don Cheadle – actor, Hotel Rwanda, Ocean's Eleven, Crash *Andrea Ciliberti – 2005 Miss Missouri USA *Anthony Civella - mobster *Emanuel Cleaver – politician, U.S. Representative for Fifth District in Missouri *Jonathan Coachman – ESPN sportscaster, wrestling commentator, college basketball player *Jennifer Jo Cobb – NASCAR Camping World Truck Series driver *Robert Coldsnow - Kansas legislator and lawyer *Evan S. Connell – author *Chris Cooper – Oscar-winning actor *John Coughlin – figure skater, 2011 U.S. pairs champion *Joan Crawford – Oscar-winning actress *Walter Cronkite – CBS television journalist, news anchor *Len Dawson – Kansas City Chiefs quarterback, Pro Football Hall of Famer, broadcaster, KMBC sports director * Marcus Denmon - NBA player * Bob Dernier - MLB outfielder *Walt Disney – film producer, director, screenwriter, voice actor, and animator *James T. Draper, Jr. - president of Southern Baptist Convention 1982-1984; pastor of Red Bridge Baptist Church in Kansas City 1965-1970 *Carol Duboc – singer, composer, arranger, and actress * Amelia Earhart - iconic aviator *James E. Edmondson - Oklahoma Supreme Court Justice *Eminem – rapper *Melissa Etheridge – singer *Harris Faulkner - newscaster *Scott Foley – actor * Lisa Forbes - Miss Kansas and Miss Earth USA 2007 *William P. Foster - band director *Thomas Frank – writer, editor *Josh Freeman - NFL quarterback *Matt Freije – NBA player *Friz Freleng – film producer, director, animator, and cartoonist *Caroline Glaser - The Voice contestant *Trent Green – NFL quarterback *Maurice Greene - sprinter, gold-medalist Olympian in track and field *Masten Gregory – auto racing *Eddie Griffin – comedian and actor, Deuce Bigalow, Undercover Brother *Karolyn Grimes – actress, Zu-Zu in the Frank Capra classic It's a Wonderful Life, lived in town for many years *Donald J. Hall, Sr. – businessman *Joyce Hall – businessman, founder of Hallmark Cards *Leon Harden – football player for Green Bay Packers *Jean Harlow – actress *Jessica Harp – country music singer-songwriter, former member of The Wreckers with Michelle Branch *Thomas Hayward - leading tenor of Metropolitan Opera *Robert A. Heinlein – science fiction author; his stories are frequently set in or reference Kansas City *Ernest Hemingway – iconic novelist and short story author *Shauntay Henderson – FBI Ten Most Wanted fugitive, convicted criminal *Paul Henning – writer, producer of The Beverly Hillbillies TV series *Opal Hill - golfer and LPGA co- founder *Jerry Hines – Emmy Award-winning photographer, voted cutest baby of Kansas City 1975 *Ralph F. Hirschmann (1922–2009) - biochemist who led synthesis of first enzymeHevesi, Dennis \"Ralph F. Hirschmann, Leading Scientist on Early Enzyme Research, Dies at 87\", The New York Times, July 18, 2009. Accessed July 19, 2009. *Mabel Hite - vaudeville and musical comedy performer, father worked at Owl Drug Store *Bob Holden - 53rd Governor of Missouri *Priest Holmes – professional football player for Kansas City Chiefs *Dick Howser – baseball player and manager of Kansas City Royals *Dorothy B. Hughes - novelist *Jim Humphreys – prominent Texas rancher *Lamar Hunt – owner and founder of Kansas City Chiefs *Ub Iwerks – animator and cartoonist *Pete Johnson – blues and jazz pianist *Elaine Joyce - actress *John Kander - composer *Ewing Kauffman – pharmaceutical magnate, philanthropist, and Major League Baseball owner *Ellie Kemper - actress, The Office *Vern Kennedy - baseball pitcher *Bill Kenney – politician, ex-Chiefs player *Edward Kerr – actor, Above Suspicion, Confessions of a Sexist Pig, The Astronaut's Wife *Craig Kilborn – actor, sportscaster, talk show host *Philip Klutznick - U.S. Secretary of Commerce to President Jimmy Carter *Evalyn Knapp - actress *Krizz Kaliko (born Samuel Watson, Jr.) - rapper *Sarah Lancaster – actress *Frank Sherman Land - Freemason and founder of Order of DeMolay, international organization for young men *William Least Heat-Moon – author *Muna Lee - 3 time Track and Field Olympic finalist *Jeff Leiding – football player *Lesa Lewis – IFBB professional bodybuilder *Suzanne Lieurance – freelance writer *Ryan Lilja – NFL player for Indianapolis Colts and Kansas City Chiefs, Shawnee Mission Northwest High School graduate *Bill Maas – NFL player *Arthur Mag – lawyer, legal counsel to Harry S. Truman *Sean Malto - professional skateboarder *Amanda Marsh – first winner of The Bachelor *Denny Matthews – sportscaster, author *John Mayberry, Jr. – baseball outfielder with Philadelphia Phillies *Claire McCaskill – politician and senator *Edie McClurg – actress *Courtney McCool – athlete and Olympian *Glenn McGee – bioethicist and philosopher *Phil McGraw – psychologist and talk show host, lived in the area as a teen *Hal McRae – baseball player and manager with Kansas City Royals *Jay McShann – blues musician *Pat Metheny – jazz guitarist *Frederick H. Michaelis – U.S. Navy Admiral *Janelle Monae – singer *Wendy Moniz – actress *Julia Montgomery - actress in Revenge of the Nerds and One Life to Live *Dennis Moore – Congressman, politician *Logan Morrison - baseball player *Paul Morrison – politician *Tommy Morrison – heavyweight boxer *Bennie Moten – pianist, bandleader *Mancow Muller – radio personality *Richard B. Myers – United States Air Force General and former Chairman of the Joint Chiefs of Staff *John Jordan \"Buck\" O'Neil – professional baseball player for Negro American League with Kansas City Monarchs *Jesse Clyde Nichols – developer of commercial and residential real estate *William F. Nolan – author *Satchel Paige – baseball pitcher *Charlie Parker - jazz saxophonist and composer *Gordon Parks – screenwriter, director, actor, photographer *Jamie Paulin- Ramirez – American Muslim convert arrested in Jihad Jane plot to kill a Danish artist *Rodney Peete – NFL quarterback, Fox Sports TV host *Tom Pernice, Jr. – professional golfer *Darrell Porter – professional baseball player, author *Joe Posnanski - sports writer, author *Albert Pujols – baseball player, lives in Kansas City, plays for Los Angeles Angels *Joe Randa – baseball player *Rob Riggle - actor and comedian *Bullet Rogan – baseball player *Ginger Rogers - dancer, Academy Award-winning actress, Broadway performer *Paul Rudd – actor, Clueless, The 40 Year-Old Virgin, Anchorman: The Legend of Ron Burgundy *Karl L. Rundberg (1899–1969) - Los Angeles City Council member *Brandon Rush – NBA player *Kareem Rush – NBA player *Pierre Russell - basketball player *Ray Sadecki - Major League Baseball pitcher *Lori Saunders - actress, Petticoat Junction *Rachel Saunders – 2005 Miss Kansas USA *Melana Scantlin – Miss Missouri USA and Average Joe star, co-host of World Series of Blackjack *Wes Scantlin – lead singer and rhythm guitarist of rock band Puddle of Mudd, cousin of Melana Scantlin *Ted Shawn - modern dance pioneer *Columbus Short - choreographer, actor, singer *Sam Simmons – former NFL and Arena Football League player *Crystal Smith – model *Jack Sock - professional tennis player *Kate Spade – fashion designer *Alexis Spight – gospel musician *Darren Sproles - NFL running back *Casey Stengel – baseball player and Hall of Fame manager Darrell Stuckey - NFL - San Diego Chargers *Jason Sudeikis - actor, Saturday Night Live *Mike Sweeney – baseball player with Oakland Athletics *Justin Swift – football player with NFL's Detroit Lions *Myra Taylor – blues singer, solo career and member of The Wild Women of Kansas City *Tech N9ne, born Aaron Yates - rapper and record label president *Tony Temple – Cleveland Browns football player, leading rusher (281 yards) in Cotton Bowl Classic for Missouri Tigers *Derrick Thomas – football player for Kansas City Chiefs *Bobb'e J. Thompson – child actor *Virgil Thomson– Pulitzer Prize-winning composer *Calvin Trillin – food writer, journalist, humorist *Marion A. Trozzolo – businessman, River Quay *Harry S. Truman – 33rd President of the United States (from Independence, Missouri) *Lisa Tucker – writer *Big Joe Turner – blues singer *Henry Clay Van Noy – owner of Van Noy Railway News and Hotel Company (today known as HMSHost) *Janie Wagstaff – 1992 olympic swimmer *Dee Wallace – actress, E.T. the Extra-Terrestrial *Earl Watson – basketball player *Orla Watson - inventor *Tom Watson – professional golfer, twice Masters champion, five-time British Open winner, World Golf Hall of Fame *Ben Webster – jazz saxophonist *Jason Whitlock – sports journalist *Charles Wheeler - Kansas City Mayor *Frank White – professional baseball player *Dianne Wiest – two-time Oscar-winning actress *Jason Wiles – actor, played Maurice 'Bosco' Boscorelli in TV series Third Watch *Barry Winchell – Private First Class, murdered by a fellow soldier for his sexual orientation *Smoky Joe Wood – a.k.a. The Kansas Cyclone; professional baseball player for Boston Red Sox and Cleveland Indians *Chely Wright – country music singer *Katie Wright – actress married to Hank Azaria *Jack Wyatt – host of ABC's Confession (1958–1959); Episcopalian priest ==Related pages== * List of people from Missouri ==References== Kansas City# *",
 "title": "List of people from Kansas City, Missouri"
}