{
 "id": "513571",
 "text": "This is a list of notable people born in, residents of, or otherwise closely associated with the city of Springfield, Missouri and its surrounding metropolitan area. ==Politics== * John Ashcroft, former U.S. attorney general * Matt Blunt, former governor of Missouri * Melanie Blunt, former first lady of Missouri * Roy Blunt, U.S. Senator * Sempronius H. Boyd, former U.S. representative and ambassador to Siam * Charlie Brown, former U.S. representative * Jim Keet (born 1949), former member of both houses of the Arkansas legislature; the 2010 Republican gubernatorial nominee in Arkansas *Billy Long, U.S. Representative * Roscoe Patterson, former U.S. senator and representative ==Arts, literature, humanities and entertainment== * Lennie Aleshire, vaudeville and country music performer * Bob Barker, former host of The Price Is Right * Julie Blackmon, photographer * Aaron Buerge, star of ABC's The Bachelor, season 2 * Kim Crosby, Broadway performer * Ian Eskelin, lead singer of All Star United * Ralph D. Foster, broadcasting pioneer * William Garwood, actor * John Goodman, actor (born in Affton and attended Missouri State University) * Lucas Grabeel, actor, singer (High School Musical, HSM2, and HSM 3: Senior Year) * Sara Groves, Christian contemporary recording artist * Speedy Haworth, guitarist and singer * Joe Haymes, swing era bandleader-arranger (born in Marshfield; grew up and began his band in Springfield) * Tess Harper, actress (graduated from Missouri State University) * Josh Heinrichs, reggae singer * Jah Roots, reggae band * Jay Kenneth Johnson, actor * The Jordanaires, singing group * King's X, musical group * Chandler Lawson, beauty pageant titleholder, Miss Tennessee 2012 * Brenda Lee, singer (moved to Springfield in 1956 at age 11) * Shelby Lindrose, Miss USA contender * Jim Lowe, country music singer * Robin Luke, musician * The Marksmen, singing quartet (originally The Foggy River Boys) * The Ozark Mountain Daredevils, musical group * The Philharmonics, singing quintet * Brad Pitt, actor * Dana Powell, actress, Modern Family, The Office, Arrested Development, Suburgatory, Bridesmaids * Ronnie Self, singer/songwriter * Brittany Sicard, artist * Scott Siman, music producer and executive * Si Siman, music producer and broadcast executive * Someone Still Loves You Boris Yeltsin, musical group * Speakeasy, rock and roll band * Patti Suarez newscaster, TV host, film and stage actress * Terre Thaemlitz, musician, cultural producer * Tony Tost, poet * Kathleen Turner, actress * Speedy West, steel guitarist and record producer * Robert Westenberg, Broadway performer * Adrienne Wilkinson, actress (graduated from Kickapoo High School) * Slim Wilson, musician, radio and TV personality * Daniel Woodrell, author ==Sports== * Scott Bailes, former American League pitcher in the 1980s and 1990s; now the color commentator for the Springfield Cardinals baseball franchise * Tyler Blaylock, NFL wide receiver * Lori Endicott, 1996 Olympic volleyball player * Gracie Gold, Olympic figure skater * Ryan Howard, current MLB player, 2005 NL Rookie of the Year, 2006 Home Run Derby Champion, 2006 NL Most Valuable Player * Jack Jewsbury, MLS player for the Portland Timbers * Josh Kinney, first Springfield Cardinal (AA) to make the St. Louis Cardinals major league roster * Stan Musial, Hall of Fame baseball player for the St. Louis Cardinals, played for the original Springfield Cardinals minor league baseball team in the late 1930s * Larry Nemmers, NFL referee * Steve Rogers, former MLB starting pitcher with Montréal Expos; most successful pitcher in Expos history *Emily Scott, Olympian speed skater * Payne Stewart, professional golfer * Jackie Stiles, NCAA all-time leading scorer in women's basketball * Anthony Tolliver, NBA basketball player for the Minnesota Timberwolves * Paul Walker, football player ==Business== *John Morris, founder and majority owner, Bass Pro Shops * Jack Gentry, World War II and Korean War veteran; founder of Positronic *David Glass, former CEO of Wal-Mart; owner of the Kansas City Royals *John Q. Hammons, founder of John Q. Hammons Hotels & Resorts * Ryan Handy, 2010 Mr. Universe contestant; Playgirl magazine centerfold * Charles F. O'Reilly (father) and Charles H. O'Reilly (son), founders of O'Reilly Auto Parts in 1957 * Jack Stack, founder of SRC Holdings * Roy E. Winegardner, former CEO of Holiday Inns, partner with John Q. Hammons in Winegardner and Hammons ==Other== * Jimmie Angel, aviator, discoverer of Angel Falls, the ighest free-falling waterfall in the world * J. Alan Groves, Biblical Hebrew scholar; editor of Groves-Wheeler Hebrew morphology database * Edwin P. Hubble, of Hubble Space Telescope fame (born in Marshfield) *Virginia E. Johnson, sexologist; junior member of the Masters and Johnson sexuality research team * Janet Kavandi, NASA astronaut * Ryan P. Walsh, founder and Chief Technology Officer of the Walsh Foundations == Notes == * Category:Lists of people from Missouri",
 "title": "List of people from Springfield, Missouri"
}