{
 "id": "513582",
 "text": "This is a list of notable people born in, residents of, or otherwise closely associated with the city of St. Joseph, Missouri. *Kay Barnes, mayor of Kansas City *Dwayne Blakley, football player, born in St.Joseph. *Ryan Bradley, figure skater *Jerry Brady *Norbert Brodine, cinematographer *Charles Francis Buddy, bishop, attended Christian Brothers School *Rob Calloway, boxer *Walter Cronkite, iconic television journalist, born in St. Joseph and his father was a dentist there *Fred Harman, artist, drew the Red Ryder cartoons and worked with Walt Disney, born in St. Joseph and worked at Artcrafts Engraving Company in St. Joseph *Paul Crouch, founder of Trinity Broadcasting Network *Katherine Kennicott Davis, composer of \"The Little Drummer Boy\" *Eminem, rapper and recording artist, born in St. Joseph *Ralph D. Foster, broadcasting pioneer *Betty Garrett, actress, born in St. Joseph *Elijah Gates, State Treasurer of Missouri *Anthony Glise, guitarist *Jody Hamilton, wrestler *Larry Hamilton, wrestler *Coleman Hawkins, jazz saxophonistColeman Hawkins Biography, biography.com Retrieved October 27, 2012 *Shere Hite, sex educator *Edie Huggins, television journalist *Jesse James, iconic outlaw, murdered in St. Joseph *Kagney Linn Karter, porn actress *Brian McDonald, writer *Timothy Omundson, actor *Issac Parker, judge *Travis Partridge, football player *Forrest E. Peden, decorated World War II soldier *Tom Pendergast, political boss *Arthur Pryor, trombonist *Nellie Tayloe Ross, first woman elected governor of a U.S. state; governor of Wyoming from 1925-1927 *Martin Rucker, football player *Martin T. Rucker, politician *Mike Rucker, football player *Jay Sarno, hotel mogul, founder of Caesar's Palace *Bill Snyder, Kansas State football coach *Steve Walsh, musician of band Kansas *Ruth Warrick, actress *James H. Webb, U.S. Senator of Virginia, born in St. Joseph *Huston Wyeth, industrialist *Jane Wyman, Oscar-winning actress and first wife of Ronald Reagan, born in St. Joseph *Eugene Field, popular poet in his day, worked for the St. Joseph Gazette and wrote a famous poem about Lover's Lane, St. Joseph *Delmer J. Yoakum, artist ==References== * St. Joseph",
 "title": "List of people from St. Joseph, Missouri"
}