{
 "id": "513585",
 "text": "The following is a list of people who were born in, have lived in, or are otherwise associated with American city of Sedalia, Missouri; they are known as Sedalians. In addition to what follows, a list of more than fifty Sedalia \"Old Timers\", who had met at the Sedalia Courthouse on the previous evening, was published in the December 12, 1893, issue of the Sedalia Bazoo; the list indicated when they had arrived in Sedalia, and from whence they had come.Sedalia OLD TIMERS in 1893 (Sedalia Bazoo, December 12, 1893) == Arts == === Acting === * Dorothy Dwan (1906–1981) – film actress * Lucille McVey (1890–1925) – film screenwriter and silent film actress; married to Sidney Drew in 1914; often credited under married name of Mrs. Sidney Drew; through marriage, aunt to John, Lionel and Ethel BarrymoreAppears in a list of twenty- six of \"Sedalia's Famous Sons\" at Ihrig, B.B. et al. (1960), p. 118. * Jack Oakie, born Lewis Delaney Offield (1903–1978) – film, stage, radio, and television actor === Art === * Russell M. Glenn (born 1951) – artist and designer * LeRoy Daniel MacMorris (1893–1981) – portrait painter, muralist, illustrator, decorator and designerWestern Historical Manuscript Collection- Kansas City Biography: (Leroy) Daniel MacMorris (1893–1981) . === Comedy === * Will Franken (born 1973) - comedian === Literature === * Joel Townsley Rogers (1896–1984) – short-story writer; mystery novelist * June Rae Wood (born 1946) – children's and young adult's authorPenguin Group (USA) Author Biography: June Rae Wood . === Music === * Andrew Berenyi (born 1963) – musician and glam-rock composer * Bill Booth – musician, former member of The Airmen of Note, principal trombone in the Los Angeles Opera Company, the Hollywood Bowl Orchestra, and the Pasadena Symphony; adjunct associate professor (trombone), University of California, Los AngelesUniversity of California, Los Angeles, Department of Music Biography: Bill Booth . * Scott Hayden (1882–1915) – composer of ragtime music * George Thomas Ireland (1866–1963) – ragtime clarinet player; journalist in Sedalia for almost 50 yearsObituary: The New York Times, (September 1, 1963), p. 56. * Scott Joplin (1867/1868–1917) – musician and composer of ragtime music * Arthur Marshall (1881–1968) – composer and performer of ragtime music * Etilmon Justus Stark (1868–1962) – ragtime composer and arranger * John Stillwell Stark (1841–1927) – piano dealer; publisher of ragtime music; promoter of Scott Joplin * Leroy Frank Van Dyke (born 1929) – country music performer; wrote \"The Auctioneer\" and recorded \"Walk on By\"; recorded over 500 songs === Photography === * Wilson L. Hicks (1897–1970) – photographer; picture editor, Kansas City Star; photographic editor Life magazine (1937–1950); professor of photojournalism at the University of Miami (1955–1970)Obituary: The New York Times, (July 7, 1970), p. 38. Also appears in a list of twenty-six of \"Sedalia's Famous Sons\" at Ihrig, B.B. et al. (1960), p. 118. == Business == * T. B. Anderson – founder of the Sedalia Telephone Company in 1880Ihrig, B.B. et al. (1960), p. 43. * William E. Franklin – president of Weyerhaeuser Far East, American Chamber of Commerce in Japan, International Timber Company of Indonesia, and Kenneday Bay Timber Company (Malaysia) * Allen Percival Green (1875–1956) – engineer; founder, A. P. Green Fire Brick Company; philanthropist (donated A. P. Green Chapel to the University of Missouri) * John W. Hicks, Jr. (1888–1945) – president, Paramount International Films; vice-president, Paramount PicturesObituary: The New York Times, (June 2, 1945), p. 15. Also appears in a list of twenty-six of \"Sedalia's Famous Sons\" at Ihrig, B.B. et al. (1960), p. 118. * Cyrus N. Johns – president, American Chain and Cable Company * E. Virgil Neal (1868–1949) – manufacturerConroy, M.S., The Cosmetics Baron You've Never Heard Of: E. Virgil Neal and Tokalon, Altus History LLC, (Englewood), 2009. . * Samuel Lee Stedman (1916–1961) – MBA Harvard Business School (1937); New York merchant banker, Wall Street financial analystObituary: The New York Times, (September 3, 1961), p. 61. == Education == * Winona Cargile Alexander (1893–1894) – founder, Delta Sigma Theta sorority; high-school teacher; social worker * James V. Mehl PhD (1941–1998) – historian; professor of humanities, Missouri Western State CollegeObituary: Nauert, C.G., \"James V. Mehl (1941–1998)\", Sixteenth Century Journal, Vol.29, No.4, (Winter 1998), p. 1,086. === Sedalia School Superintendents === * 1867–1872: George O. BrownAppears on the list of \"Sedalia School Superintendents\" at Ihrig, B.B. et al. (1960), p. 120. * 1872–1876 – G. W. Ready * 1876–1884 – D. R. Cully * 1884–1888 – William Richardson * 1888–1893 – A. J. Smith * 1893–1908 – G. V. Buchanan * 1908–1920 – John P. Gass * 1920–1924 – C. A. Greene * 1924–1927 – John N. Crocker * 1927–1958 – Heber U. Hunt (1897- )Scotten, (1974), p. 142. * 1958–1973 – T. J. NorrisScotten, (1974), p. 136. * 1973–1974 – A Henningson == Engineering == * Daniel C. Jackling (1869–1956) – mining and metallurgical engineer; founder, Utah Copper Company; known as \"the father of open-pit mining\" * Walter Rautenstrauch (1880–1951) – mechanical engineer; first chairman of Columbia University's Department of Industrial Engineering; adviser to the Mexican Government; co- founder of Committee on Technocracy (1932) == Historical figures == * Clay Allison (1840–1887) – gunfighter, American Old West == Journalism == * Raymond Peter Brandt (1896–1974) – Rhodes Scholar; O.I.C. Office of Finances, American Relief Administration, Vienna, Austria, 1920; District Supervisor, American Relief Administration, Vitebsk, Russia, (1922–1923); reporter, St. Louis Post- Dispatch (1917–1919), and Washington, D.C. correspondent for the St. Louis Post-Dispatch (1923–1967)Harry S. Library & Museum: Oral History Interview with Raymond P. Brandt on 28 September 1970 Appears in a list of twenty-six of \"Sedalia's Famous Sons\" at Ihrig, B.B. et al. (1960), p. 118. * Elizabeth Williams Cosgrove (1878–1975), journalist; writer; poetElizabeth Williams Cosgrove, Muskogee Writer and Poet . * Elizabeth Jane Dugan (?1848–1911) – also known as \"Rosa Pearle\"; poet; journalist (started with the Sedalia Bazoo; founder and editor of the Saturday-evening society weekly Rosa Pearle's Paper (1894–1911)Chalfant, R., \"Dugan, Elizabeth Jane (Rosa Pearle) (1848?–1911)\", pp. 263–264 in Christensen, L.O.(ed), Dictionary of Missouri Biography, University of Missouri Press, (Columbia), 1999. . * Mary Frances \"Murry\" Engle (1930–2005) – journalist, Sedalia Democrat (1950–1966), Boeing News and Boeing Magazine (1967–1970); Honolulu Star-Bulletin (1970–1993)\"Obituary: Murry Engle (1930–2005); Isle journalist had a love for adventurous reporting\". Honolulu Star-Bulletin. June 10, 2005. * Charles Grandison Finney (1905–1984) – journalist; writer; part-time night club owner; author, The Circus of Dr. Lao, which adapted as the film 7 Faces of Dr. Lao (1964) * J. West Goodwin – editor of Sedalia Bazoo; president of Missouri Press Association (1891); organizer of the Sedalia Citizen’s Alliance (1902) * Hazel Norinne Lang (1903–1996) – journalist, reporter and feature writer with the Sedalia Democrat (1925–1970); poet; historian (author of Only Human; Poems of Everyday Life, Exposition Press, (New York), 1955, and the 1,112-page Life in Pettis County, 1815–1873, published in Sedalia, in 1975)Imhauser, (2007), p. 29. * Casper Salathiel Yost (1863–1941) – editor of St. Louis Globe-Democrat; founder of American Society of Newspaper Editors (1922) == Medicine == * Walter Edward Dandy (1886–1946) – scientist and neurosurgeon * Willis P. King – president, Missouri State Medical Association (1881)Ihrig, B.B. et al. (1960), p. 41. * Thomas J. Montgomery – vice-president, Missouri State Medical Association (1874) * John W. Trader – president, Missouri State Medical Association (1876) == Military == === United States Army === * Richard D. Dean (born 1929) – United States Army Brigadier General and Deputy Director of the Army National Guard * Rufus Estes Longan (1879–1936) – Brigadier General, United States Army * John C. McLaughlin (1903–1967) – Major General, United States Army, 35th Infantry DivisionFind a Grave Memorial: John C. McLaughlin, III. * John Henry Parker – Brigadier General, United States Army; West Point Graduate; war hero; first to recognize the tactical advantages of machine guns to continuously support advancing infantry and protect artillery trains (carriages pulled by draft animals); awarded the Distinguished Service Cross four times, for valor displayed on four separate occasions, during 1918Full Text Citations For Award of The Distinguished Service Cross, World War I, To Members of the U.S. Army (N-P) The list of twenty-six of \"Sedalia's Famous Sons\" at Ihrig, B.B. et al. (1960), p. 118 refers to him as \"'Gatling Gun Parker', inventor of machine gun\". * Edgar Frank Thelen (born 1906) – University of Missouri graduate; associate of Harry S. Truman in the Reserve Officers' Training Corps (1930–1940); US Army officer (1942–1961); staff member, University of MissouriHarry S. Library & Museum: Oral History Interview with Col. Edward F. Thelen on 6 June 1968 . * William S. Triplet (1900–1994) – Colonel United States Army; professional soldier; West Point graduate (1924); served in both World War I and World War IITriplet, W.S. (Ferrell, R.H. ed.), A Youth in the Meuse-Argonne: A Memoir, 1917–1918, University of Missouri Press, (Columbia), 2000. ; Triplet, W.S. (Ferrell, R.H. ed.), A Colonel in the Armored Divisions: A Memoir, 1941–1945, University of Missouri Press, (Columbia), 2001. ; Triplet, W.S. (Ferrell, R.H. ed.), In the Philippines and Okinawa: A Memoir, 1945–1948, University of Missouri Press, (Columbia), 2001. . === United States Navy === * Floyd Ewing Hall (1920–1945) – naval aviator shot down over the island of Chichi Jima in the Pacific theater of World War II on February 18, 1945; after a month spent captured on the island, was executed and cannibalized by Japanese commanders; his capture and execution is one of the subjects of James Bradley's 2003 novel Flyboys: A True Story of Courage * John James Housel (1911–1941) – SK1c USN; killed in action on December 7, 1941, on the U.S.S. Arizona in the first wave of the Japanese attack on Pearl Harbor, Hawaii === United States Air Force === * James Phillip Fleming (born 1943) – United States Air Force pilot in the Vietnam War; awarded Medal of Honor for bravery * Arthur G. Salisbury (1916–2005) – Major General, USAFAir Force Link Biography: Major General Arthur G. Salisbury * George Allison Whiteman – first USAF airman killed in World War II; killed when attempting to get his plane off the ground at Pearl Harbor on December 7, 1941; in 1955, Sedalia Air Force Base was renamed Whiteman Air Force Base in his honor === Other === * David Thomson (1775–1861) – General, third-division Kentucky militia (1814); politician; father-in-law of General George R. Smith; thought by many to be the killer of TecumsehBiography: General David Thomson. * William Gentry (1818–1890) – Major in the 40th Enrolled Missouri Militia; livestock farmer; railroad executive; candidate for Governor (1874)Claycomb, W.B., \"Gentry, William (1818–1890)\", pp. 334–335 in Christensen, L.O.(ed), Dictionary of Missouri Biography, University of Missouri Press, (Columbia), 1999. . == Politics and government == === Heads of state and heads of government === * Emmet Montgomery Reily (1866–1954) – journalist; politician; Governor of Puerto Rico (1921–1923) * Charles Emmett Yeater (1861–1943) – graduate of the University of Missouri; acting Governor-General of the Philippines (March 5, 1921 – October 14, 1921) === Diplomats === * John Flournoy Montgomery (1878–1954) – U.S Ambassador to Hungary (1933–1941)Notable Names Database: US Ambassador to Hungary (List). === Politicians === * John Homer Bothwell (1849–1929) – lawyer; politician; member of the 35th and 38th General Assemblies of the Missouri legislature (1889 and 1895)Chalfant, R., \"Bothwell, John Homer (1848–1929)\", pp. 106–107 in Christensen, L.O. (ed), Dictionary of Missouri Biography, University of Missouri Press, (Columbia), 1999. . * John Morgan Evans (1863–1946) – U.S. Congressman (1913–1921; 1923–1933) * Thomas Jefferson Halsey (1863–1951) – teacher; businessman; U.S. Congressman (1929–1931) * Judith K. Moriarty (born 1942) – politician; Missouri Secretary of State (1993–1994) * John William Palmer (1866–1958) – physician; lawyer; U.S. Congressman (1929–1931) * John Berchmans Sullivan (1897–1951) – lawyer; politician; U.S. Congressman (1941–1943; 1945–1947; 1949–1951) * George Graham Vest (1830–1904) – orator; lawyer; politician; at his death, the last living Confederate States Senator; known for his \"Eulogy on the Dog\" * Xenophon Pierce Wilfley (1871–1931) – teacher; lawyer; U.S. Senator (1918); president, Missouri Bar Association (1925) === Judiciary === * Walter Henry Bohling (1888–1968) – Commissioner of the Supreme Court of Missouri (1934–1963) * Brown Harris (1876–1948) – Jackson County circuit court judge for 24 years * Henry Lamm (1846–1926) – lawyer; jurist; poet; Associate and Chief Justice of the Supreme Court of Missouri (1905–1916)List of judges of the Supreme Court of MissouriLawyers and Poetry: Henry Lamm (1846–1926) Missouri . * Hazel Palmer – first female assistant prosecuting attorney in Sedalia, the first female county collector, and the first female magistrate judge of Pettis County; unsuccessful Republican candidate for the U.S. Senate in 1958; president, National Federation of Business and Professional Women (1956–1958) * John Finis Philips (1834–1919) – lawyer; politician; colonel 7th Missouri Volunteer Cavalry; president, Missouri Press Association (1891); US Congressman; federal judge === Mayors of Sedalia === The following have been mayors of Sedalia: * 1864 – George Rappeen Smith (1804–1879)Cassity, M., \" Smith, George Rappeen (1804–1879)\", p. 702 in Christensen, L.O.(ed), Dictionary of Missouri Biography, University of Missouri Press, (Columbia), 1999. Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1865 – E.W. Warsburn (resigned)Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1865 – F.L. Parker * 1866 – John Finis Philips (1834–1919) * 1867 – Henry Suess (1837–1891)Mardos Memorial Library Biography: Hon. Henry Suess Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1868 – General Bacon Montgomery (1840–1888) Archie Clement#Death Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1869 – Albert Parker * 1870 – William P. Jackson * 1871 – Thomas J. Montgomery * 1872 – George W. Cummings * 1873 – Dr. R. T. Miller * 1874 – William H. H. HillMissouri State Archives: Certificate of Election: (14/A/6/1, 2, 3, 1876: Certificates of Election: Judge of 6th Circuit Court (William H. H. Hill) Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1875 – Norman Maltby (1841–1876) * 1876 – David Blocher * 1877 – Logan Clark * 1878–1879 – George L. Faulgaber (1838-) * 1880 – E. C. Evans * 1881 – Frank Cravcroft * 1882–1883 – Charles E.Messerly * 1884–1885 – John B. Rickman * 1886–1887 – E. W.Stevens * 1888–1889 – John D. Crawford * 1890–1893 – E. W.Stevens * 1894–1898 – Pleasant Dawson Hastain (1854-) * 1898–1899 – W. C. Overstreet * 1900–1901 – Samuel K. Crawford * 1902–1905 – J. L. Babcock (?–1935) * 1906–1907 – John A. Collins * 1908–1910 – J. L. Babcock (?–1935) * 1910–1911 – J. W. Mellor * 1912–1913 – F. L. Ludemann * 1914–1917 – J. L. Babcock (?–1935) * 1918–1919 – A. L. Baumgartner * 1920–1923 – Frank F. Hatton * 1924–1927 – J. L. Babcock (?–1935) * 1928–1929 – O. B. PoundstoneThe Political Graveyard: Index to Politicians: Potterton to Powel Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1930–1931 – S. B. Kennon * 1932–1933 – Wilmer Steeples (1891–1946)certificate of Wilmer Steeples Appears in a list of \"Mayors of Sedalia\" at Ihrig, B.B. et al. (1960), p. 119. * 1934–1935: O. B. Poundstone; Julian H. Bagby (1899–1990) * 1936–1941 – Julian H. Bagby (1899–1990) * 1942–1945 – Alonzo H. Wilks * 1946–1949 – Julian H. Bagby (1899–1990) * 1950–1953 – Herbert E. Studer * 1954–1957 – Julian H. Bagby (1899–1990) * 1958–1961 – Abe Silverman (1899–1990) * 1970–1976 – Jerry N. Jones * 1976–1982 – Allen L. Hawkins * 1982–1989 – Larry Foster * 1989–1992 – Steven J. Dust * 1994–2001 – Jane Gray * 2002–2009 – Bob Wasson (1933–2009) * since 2009 – Elaine Horn == Sport == === Baseball === * Allen Howard \"Red\" Conkwright (1896–1991) – fourth cousin of Oakland Raiders' coach Red Conkright; pitcher with the Detroit Tigers in the 1920 seasonBaseball Almanac: 1920 Detroit Tigers Roster. * Bill Drake (1895–1977) – pitcher in various Negro league baseball teams (1914–1927) * John Tillman \"Bud\" Thomas (born 1929) – baseballer; infielder for the St. Louis Browns for the 1951 seasonBaseball Almanac: 1951 St. Louis Browns Roster. * Clarence LeRoy \"Roy\" Vaughn (born 1911) – baseballer; pitcher for the Philadelphia Athletics for the 1934 seasonBaseball Almanac: 1934 Philadelphia Athletics Roster. === Basketball === * Kim Anderson (born 1955) – basketball player and coach === Billiards === * Johnny Layton (1896–1956) – billiards champion; known as the \"Diamond King\"; won National Three-Cushion Championship 12 times (1919–1925); world champion (1928–1930); member of the Billiard Congress of America's Hall of Fame (inducted 1974)Billiard Congress of America: Hall of Fame Inductees: 1969–1976 . === Football === * Richard William \"Dick\" Barker, Jr. (1897-) – American footballer; attended Iowa State College of Agriculture and Mechanic Arts; played in the American Professional Football Association; played two games for the Chicago Staleys and two games for the Rock Island Independents in 1921databaseFootball.com Statistics: Dick Barker . * Douglas Claydon Van Horn (born 1944) – football offensive lineman in the National Football League (1966–1979) === Softball === * Joey Rich (born 1956) – softballer, softball umpire, Amateur Softball Association Commissioner for the state of Missouri; president, American Amateur Softball Association (since 2007Anon, \"Missouri's Joey Rich Elected President-Elect\", The Inside Pitch: The Official Newsletter of the Amateur Softball Association, Vol.8, No.11, (December 2005), p. 1. === Wrestling === * Douglas A. \"Ox\" Baker (born 1934) – professional wrestler == Miscellaneous == * Bernard Adolphus McFadden (later Macfadden) (1868–1955) – promoter of physical culture; advocate of fasting * Francis Asbury Sampson (1842–1918) – author; Missouriana collectorFrancis Asbury Sampson Collection Inventory: includes Biography of Francis Asbury Sampson (1842–1918) . ==Related pages== * List of people from Missouri == References == == Further reading == * Christensen, L.O.(ed), Dictionary of Missouri Biography, University of Missouri Press, (Columbia), 1999. * Ihrig, B.B. et al. (eds), The First One Hundred Years, A History of the City of Sedalia, Missouri, 1860–1960, Centennial History Committee, Sedalia, 1960. * Imhauser, R.C., Images of America: Sedalia, Arcadia Publishing, (Charleston), 2007. * Scotten, F.C., History of the Schools of Pettis County, Missouri, 1974; Prepared under the Direction of C. F. Scotten, C.F. Scotton, (Sedalia) 1974. * Bird, Kenneth L. \"Rail to The Osage\" The story of the Sedalia Warsaw & Southern Railroad, Menwith Publications,(Lincoln, Mo), 2009. ==Other websites== * City of Sedalia official website * Sedalia Convention and Visitors Bureau * Sedalia Chamber of Commerce * The Political Graveyard: A Database of Historic Cemeteries Sedalia",
 "title": "List of people from Sedalia, Missouri"
}