{
 "id": "513638",
 "text": "Playtime Is Over is the debut mixtape by Trinidan-American rapper Nicki Minaj. It was released on July 5, 2007 by Young Money Entertainment and Dirty Money Entertainment. The mixtape includes guest appearances from Hell Red, Red Café, Murda Mook, Ransom, Gravy, Lil Wayne, Angel De-mar, and Ru Spits. Before releasing the mixtape, Minaj released five songs with rap group the Hoodstars. She left the group to start up a solo career. She used to upload songs on her Myspace page. With that she met Fendi, CEO for Brooklyn label Dirty Money Entertainment. Through that she met Lil Wayne who saw her appearance on the DVD The Come Up. == Track listing == No. Title Original Instrumental Length 1 \"1-900-Ms-Minaj\" (featuring Hell Rell, Red Café, Murda Mook, Ransom and Gravy) 4:48 2 \"Dreams '07\" \"Just Playing (Dreams)\" by The Notorious B.I.G 2:39 3 \"Wuchoo Know\" \"Lip Gloss\" by Lil Mama 2:18 4 \"Interlude\" (Lil Wayne only) \"Upgrade U\" by Beyoncé and Jay-Z 1:50 5 \"Can't Stop Won't Stop\" (featuring Lil Wayne) \"Can't Stop, Won't Stop\" by Young Gunz 2:26 6 \"Playtime Is Over\" \"We Takin' Over\" by DJ Khaled, Akon, T.I., Rick Ross, Fat Joe, Birdman and Lil Wayne 1:46 7 \"Jump Off '07\" \"Jump Off\" by Lil' Kim and Mr. Cheecks 2:24 8 \"Click Clack\" \"Click Clack\" by Slim Thug and Pusha T. 4:02 9 \"40 Bars\" \"Banned from T.V.\" by Noreaga, Nature, Cam'ron and The Lox. 2:09 10 \"Dilly Dally\" \"Kingdom Come\" by Jay-Z 3:03 11 \"Warning\" \"Warning\" by The Notorious B.I.G. 2:52 12 \"N.I.G.G.A.S.\" (featuring Angel De-mar) 3:48 13 \"Sunshine\" (featuring Gravy) \"Sunshine\" by Jay-Z featuring Foxy Brown 2:39 14 \"Letcha Go\" \"Can't Let You Go\" by Fabolous, Lil Mo and Mike Shorey 2:37 15 \"Sticks In My Bun\" 2:46 16 \"I'm Cumin\" \"Mo Money Mo Problems\" by The Notorious B.I.G., Diddy and Mase 2:03 17 \"Freestyle\" \"Yeah Yeah Yeah\" by Terror Squad 1:01 18 \"Hood Story\" 1:59 19 \"Ease Up\" (featuring Ru Spits) 3:39 20 \"Encore '07\" \"Numb/Encore\" by Jay-Z and Linkin Park 4:10 ==References== Category:2007 albums Category:Hip hop albums Category:Hip hop soul albums Category:R&B; albums Category:Mixtape albums Category:Nicki Minaj albums",
 "title": "Playtime Is Over (mixtape)"
}