{
 "id": "51373",
 "text": "In economics, perfect competition is a type of market form in which there are many companies that sell the same product or service and no one has enough market power to be able to set prices on the product or service without losing business. As the conditions for perfect competition are strict, there are only a few markets that are considered to be perfectly competitive and this market form only exists to compare with the other market forms. == Characteristics == Generally, a perfectly competitive market exists when every firm in the market are price takers and no one is able to charge a different price without losing business. Specific characteristics of perfect competition includes: * Large number of buyers and sellers: There are many buyers who are willing to buy the product at a certain price and there are many sellers who are willing to sell the product at a certain price. * No barriers to entry and exit: There are no barriers to entry and exit for firms and firms are able to enter or leave the market without any issues. * Perfect information: All buyers are assumed to know the price of the product set by all sellers and sellers are assumed to know the production methods of their competitors. These characteristics are largely impossible to achieve in reality and there are not many markets that are perfectly competitive. For example, it is unlikely that there are absolutely no barriers to entry and exit as there are always costs involved in setting up a new firm. Also, information is always imperfect and it is not possible for buyers to know exactly the price set by all sellers, and sellers are not willing to share their production methods with their competitors. However, the study of perfect competition is important as it is used to compare with the other market forms. In the short run, a perfectly competitive firm is not productively efficient as the output will not be at where the marginal cost equals to the average cost (MC = AC). However, a perfectly competitive firm will be allocatively efficient as the firm will be producing at the profit-maximising output where MC = MR, which is coincidentally the allocatively efficient point. In the long run, a perfectly competitive firm will be both allocatively and productively efficient. == Model == A model can be used to show the perfectly competitive firm's price and output level for a given product. In the diagram shown, the cost curves of a perfectly competitive market is shown in its long run equilibrium. For a perfectly competitive firm, the marginal cost of producing an extra unit of output is shown using the MC curve (in blue) whereas the average total cost of producing an extra unit of output is shown using the ATC curve (in red). As stated above, a perfectly competitive market has a large number of buyers and sellers and the demand does not change with output. Hence, the demand curve, the average revenue and marginal revenue curves are horizontal (in green). The point in which the demand curve intersects the vertical axis is the price of the product sold by the firm. As firms are assumed to be profit-maximising, the firm will thus produce at the output level where the marginal cost equals to the marginal revenue (MC = MR). Hence, the firm will be producing an output of Q in the diagram. As the average total cost curve also meets at this point, the firm is thus earning normal profits in the long run. == Criticism == A market where there's perfect competition is difficult to find in the real world, mainly because of the restrictions. * The model totally neglects dynamic effects in a market * In reality, there are many barriers to enter a market. These barriers may be that some companies have technologies that are more advanced. * There is perfect information. There's no pioneering advantage, there's also no reason for innovation * There's no transaction cost. * Because of the large number of market players, a bigger company has no benefits over a smaller one. * In the real world, buyers do not want products that are all the same. They want small differences, so that choosing one product over another actually has some sense. Category:Market forms",
 "title": "Perfect competition"
}