{
 "id": "513793",
 "text": "Dean Carroll Jones (January 25, 1931 – September 1, 2015) was an American actor. He was born in Decatur, Alabama. Jones was best known for his light- hearted leading roles in several Walt Disney movies between 1965 and 1977. He was known for his roles in The Love Bug and in Beethoven. Jones died from Parkinson's disease in Los Angeles, California, aged 84. ==Filmography== ===Film=== Year Title Role Notes 1956 Somebody Up There Likes Me Private in Rocky's Tent Uncredited 1956 These Wilder Years Hardware Clerk 1956 Tea and Sympathy Ollie 1956 The Opposite Sex Assistant Stage Manager Uncredited 1956 The Rack Lieutenant Uncredited 1956 The Great American Pastime Buck Rivers 1957 Slander Newscaster Uncredited 1957 Ten Thousand Bedrooms Dan 1957 Designing Woman Assistant Stage Manager (Boston) Uncredited 1957 Until They Sail US Marine Lt. Uncredited 1957 Jailhouse Rock Teddy Talbot 1958 Handle with Care Zachary Davis 1958 Imitation General Cpl. Terry Sellers 1958 Torpedo Run Lt. Jake \"Fuzz\" Foley 1959 Night of the Quarter Moon Lexington Nelson 1959 Never So Few Sgt. Jim Norby 1963 Under the Yum Yum Tree Dave Manning 1964 The New Interns Dr. Lew Worship 1965 Two on a Guillotine Val Henderson 1965 That Darn Cat! FBI Agent Zeke Kelso 1966 The Ugly Dachshund Mark Garrison 1966 Any Wednesday Cass Henderson 1967 Monkeys, Go Home! Hank Dussard 1968 Blackbeard's Ghost Steve Walker 1968 The Horse in the Gray Flannel Suit Fred Bolton 1968 The Love Bug Jim Douglas 1970 Mr. Superinvisible Peter Denwell 1971 The $1,000,000 Duck Professor Albert Dooley 1972 Snowball Express Johnny Baxter 1974 The Sugarland Express Policeman at Football Game Uncredited 1976 The Shaggy D.A. Wilby Daniels 1977 Herbie Goes to Monte Carlo Jim Douglas 1978 Born Again Charles W. Colson 1986 St. John in Exile St. John 1991 Other People's Money Bill Coles 1992 The Greatest Adventure: Stories from the Bible King Ahasuerus (voice) Direct-to-video (\"Queen Esther\" segment) 1992 Beethoven Dr. Herman Varnick 1994 Clear and Present Danger Judge Moore 1994 The Visual Bible: Acts Luke the Evangelist Direct-to-video 1996 Getting Around in Time Professor Mortimer 1997 That Darn Cat Mr. Flint 1998 Batman & Mr. Freeze: SubZero Dean Arbagast (voice) Direct-to-video 2007 Lavinia's Heist Tony Cavaletti Short film 2009 Mandie and the Secret Tunnel Jason Bond 2009 God Provides Abraham Direct-to-video (final film role) ===Television=== Year Title Role Notes 1960 Zane Grey Theatre Deputy Bill Devlin Episode: \"The Sunday Man\" 1960 The Aquanauts John Anderson Episode: \"The Stowaway\" 1960 Outlaws Danny Cannon Episode: \"Beat the Drum Slowly\" 1960 Stagecoach West Joe Brady Episode: \"Red Sand\" 1961 The Dick Powell Show Detective Phil Winslow Episode: \"Who Killed Julie Greer?\" 1961 Bonanza Danny Kidd Episode: \"The Friendship\" 1961 Tales of Wells Fargo Jamie Coburn Episode: \"A Killing in Calico\" 1962 Target: The Corruptors! Barry Steele Episode: \"Play It Blue\" 1962 Wagon Train Lt. Burton Episode: \"The Lieutenant Burton Story\" 1962–63 Ensign O'Toole Ensign O'Toole Main role (32 episodes) 1963 Ben Casey Dr. Richard Connell Episode: \"Fire in a Sacred Fruit Tree\" 1963 Burke's Law Rudy Davis Episode: \"Who Killed Eleanora Davis?\" 1965 Kraft Suspense Theatre Eddie Carew Episode: \"The Rise and Fall of Eddie Carew\" 1965 Vacation Playhouse Alec Tate Episode: \"Alec Tate\" 1968 Walt Disney's Wonderful World of Color Narrator (voice) Episode: \"The Mickey Mouse Anniversary Show\" 1969 What's It All About, World? Himself Host (13 episodes) 1971 The Chicago Teddy Bears Linc McCray Main role (13 episodes) 1972 The Great Man's Whiskers James E. Cooper Television film 1973 Guess Who's Sleeping in My Bed? George Gregory Television film 1974 Medical Center Dr. Ronston Episode: \"Spectre\" 1976 Good Heavens Brad Episode: \"Coffee, Tea, or Gloria\" 1977 Once Upon a Brothers Grimm Jacob Grimm, Grandmother Television film 1978 When Every Day Was the Fourth of July Ed Cooper Television film 1980 The Long Days of Summer Ed Cooper Television film 1981 Aloha Paradise Alex Episode: \"Alex and Annie\" 1982 Herbie, the Love Bug Jim Douglas Main role (5 episodes) 1983 The Gospel According to Scrooge Narrator (voice) Television film 1984 Don't Ask Me, Ask God Future Father Television special 1984 The Love Boat Marty Chenault Episode: \"Julie and the Producer\" (Parts 1 & 2) 1984 Finder of Lost Loves Steve Marsh Episode: \"Yesterday's Child\" 1984 Murder, She Wrote Marcus Boswell Episode: \"It's a Dog's Life\" 1988 Murder, She Wrote Leonard Palmer Episode: \"Harbinger of Death\" 1989 Fire and Rain Jack Ayers Television film 1992 Saved by the Bell: Hawaiian Style Harry Bannister Television film 1994 Beethoven George Newton (voice) Main role (26 episodes) 1995 Nowhere Man Jonathan Crane Episode: \"Father\" 1995 The Computer Wore Tennis Shoes Dean Webster Carlson Television film 1996 Special Report: Journey to Mars Dr. Scott Berlin Television film 1996 The Real Adventures of Jonny Quest Dr. Karel (voice) Episode: \"DNA Doomsday\" 1996 Superman: The Animated Series Col. Sam Lane (voice) Episode: \"Monkey Fun\" 1997 The Love Bug Jim Douglas Television film 1998 Adventures from the Book of Virtues Chauncey (voice) Episode: \"Trustworthiness\" 2001 Scrooge & Marley Ebenezer Scrooge Television special ==Broadway appearances== Title Role Dates Theatre There Was a Little Girl Stan Walters February 29 – March 12, 1960 Cort Theatre Under the Yum Yum Tree Dave Manning November 16, 1960 – April 15, 1961 Henry Miller's Theatre Company Robert April 26 – May 28, 1970 Alvin Theatre Into the Light James Prescott October 22 – October 26, 1986 Neil Simon Theatre Company Robert April 11 – April 12, 1993 Vivian Beaumont Theater ==References== ==Other websites== * * * * Category:1931 births Category:2015 deaths Category:Actors from Alabama Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:Deaths from Parkinson's disease Category:Disease-related deaths in Los Angeles Category:Singers from Alabama",
 "title": "Dean Jones (actor)"
}