{
 "id": "514059",
 "text": "Gliese 667 Cc is an extrasolar planet 22.18 light years away. It orbits around the red dwarf star Gliese 667 C, one of the Gliese 667 triple star system. The system is in the constellation of Scorpius. It is the most Earth-like planet in 50 light years. Its ESI (Earth Similarity Index) is 0.85. It is present in the hot inner edge of the habitable zone than the Earth. It absorbs 90% of light from it's star, as the Earth does but it is tidally locked. Gliese 667 Cc was first found by the European Southern Observatory on 21 November 2011. They used the wobble method (also known as radial velocity). They watched how the star \"wobbled\" as Gliese 667 Cc circled around its star.European Southern Observatory. Press information: The HARPS search for southern extra-solar planets. 11.24.2011. On 2 February 2012 researchers at the University of Göttingen and the Carnegie Institution for Science confirmed the planet's existence.University of Göttingen. Presseinformation: Wissenschaftler entdecken möglicherweise bewohnbare Super-Erde - Göttinger Astrophysiker untersucht Planeten in 22 Lichtjahren Entfernung. Nr. 17/2012 - 02.02.2012. Announcement on university homepage, retrieved 2012-02-02 == Physical characteristics == Gliese 667 Cc circles its star every 28 days, and is 0.125 AU away from its star. It fits within the habitable zone. Its mass is 3.8 times that of the Earth. Its size is probably about 50% larger than Earth. == Tidal locking == Because of Gliese 667 Cc's distance from its star, it is predicted to be tidally locked to its star. Just as Earth's Moon always shows the same face to the Earth, the length of Gliese 667 Cc's day would then match the length of its year. This means it would be permanently light on one half and permanently dark on the other half of its surface. Tidal locking also means the planet would have no axial tilt and that means the planet would not experience any seasons. == References == Category:Exoplanets",
 "title": "Gliese 667 Cc"
}