{
 "id": "514078",
 "text": "Eric Stuart (born October 18, 1967) is an American voice actor, voice director, singer, songwriter and guitarist who worked for 4Kids Entertainment, NYAV Post, and Central Park Media. He is perhaps best known for his roles as Brock and James in the long-running TV series Pokémon from Seasons 1 to 8. He is also the lead singer of his rock band The Eric Stuart Band. ==Filmography== ===Anime roles=== * Animation Runner Kuromi - Mizuho Tanonaka, Shin Kumegawa * Art of Fighting - Jack Turner and John Crawley * Dinosaur King - Dr. Z, Spartacus * Descendants of Darkness - Watari Yutaka * Fighting Foodons - Burnt Meatballs, Cole Slaughter * F-Zero: GP Legend - Samurai Goroh * Giant Robo: The Animation (NYAV Post dub) - Hanzui * Here is Greenwood (CPM dub) - No. 1, Lupin, Tochizawa * Kirby: Right Back at Ya! - Meta Knight, Blade Knight, Gus * Labyrinth of Flames - Galan * Magical DoReMi - Vice-Principal Shoople * One Piece (4Kids dub) - Narrator, Siam and Henzo * Phoenix - Rock (The Future Chapter) * Pokémon - Brock, James, Butch, Torkoal, Pokédex, Additional Voices (Seasons 1-8) * RG Veda - Bishamoten * Shaman King - Marco * Slayers - Gourry Gabriev * Tama and Friends - Rockney (Nora) * Ultimate Muscle - Mac Metaphor, DikDik Van Dik, Dial Bolic, Hanzo, The Protector, King Muscle, and Sgt. Muscle * Yu-Gi-Oh! - Seto Kaiba, Kemo * Yu-Gi-Oh! GX - Bastion Misawa, Ojama Black, Kaibaman, Seto Kaiba * Yu-Gi-Oh! 5D's - Gill de Randsborg, Lug, Mr. Pitts, Elsworth * Yu-Gi-Oh! Zexal - Scorch ===Non-anime roles=== * Darkwing Duck - Spike * Chaotic - Magmon * Cubix: Robots for Everyone - Sewwix, Heroix, Ixmo, The Alien * Funky Cops - Goldilocks, Chopsticks, Paolo Alto, Chucky, Aaron King * Freedom Force - Additional Voices * G.I. Joe: Sigma Six - Hi-Tech, Machette * GoGoRiki - Shadow Prince Lovermore * Magi-Nation - Strag * Teenage Mutant Ninja Turtles (2003 series) - Harry Parker, Phil, Quarry, Hamato Yoshi, Murakami Gennosuke, D'Jinn, Leader of the Purple Dragons * Tara Duncan - Luke the Werewolf * Ultraman Tiga - Additional Voices, Theme Song Performance * Viva Piñata - Les Galagoogoo, Pecky Pudgeon, Sour Mongo, Pierce Profitamole, Francine, the Ruffians ===Movie roles=== *Gall Force - Eternal Story - Ail, Ox-11, Toil *Movie 43 - Narrator (Victory's Glory) *Night on the Galactic Railroad - Lighthouse Keeper *Pokémon: The First Movie - Brock, James, Squirtle, Weezing, Scyther, Hitmonlee, Magneton *Pokémon: The Movie 2000 - James *Pokémon 3: The Movie - Brock, James *Pokémon 4Ever - Brock, James, Charmeleon, Scizor, Stantler, Sandshrew *Pokémon Heroes - Brock, James, Politoed *Pokémon: Jirachi Wish Maker - Brock, James, Absol, Hippie, Breloom, Nuzleaf, Linoone, Magma Scientist #1 *Pokémon: Destiny Deoxys - Brock, James *Pokémon: Lucario and the Mystery of Mew - Brock, James, Squirtle, Forretress, Weavile, Bonsly, Omanyte, Omastar *Tom and Jerry: Spy Quest- Race Bannon *Yu- Gi-Oh! The Movie: Pyramid of Light - Seto Kaiba *Yu Yu Hakusho: Poltergeist Report - Koenma, Kuronue *Kirby: Fright to the Finish!! - Meta Knight, Gus, Blade Knight, Additional Voices ===Video games=== * Pokémon Puzzle League - Brock, James, Squirtle and Weezing. * Shadow Hearts - Yuri Hyuga * Super Smash Bros. Melee - Weezing, Blastoise, Venusaur and Scizor * Valkyrie Profile - Grey and Lucian * Shaman King Power Of Spirit - Vineuvall ===Documentaries=== * Adventures in Voice Acting - Himself ==Production Credits== ===Voice Director=== *Funky Cops *G.I. Joe: Sigma Six *Karaoke Revolution Presents: American Idol *Karaoke Revolution Presents: American Idol Encore *Pokémon: Jirachi Wish Maker (sixth Pokémon movie) *Turtles Forever *Ultimate Muscle *Viva Piñata *Yu-Gi-Oh! *Yu-Gi-Oh! GX (first season) *Yu-Gi-Oh! The Movie: Pyramid of Light ==References== ==Other websites== * Ericstuart.com * Eric Stuart at MySpace * Ericstuart.webs.com * * Category:1967 births Category:Living people Category:American voice actors Category:American guitarists Category:Singers from New York City Category:American singer- songwriters Category:Actors from Brooklyn Category:Musicians from Brooklyn",
 "title": "Eric Stuart"
}