{
 "id": "51405",
 "text": "Cadillac, officially the Cadillac Division of the General Motors Company, is a luxury car maker, owned by General Motors. During the 20th century, Cadillacs were so highly thought of that the phrase \"the Cadillac of x\" was coined, meaning that something of excellent quality and better than everything else in its category. 1902 The company is one of the oldest car companies and was founded in 1902. By the 1950s and 1960s, it had become famous for making high- quality and luxurious cars, often setting the standard for automotive styling. Cadillac had largely declined by the 1980s and lost much of its market to other companies. Since the early 2000s, Cadillac has regained some of its lost reputation. However, it is not the same company it once was. Cadillac is based in Detroit, Michigan. Many of its cars are available as a V-model, which is a sports package. == Current production vehicles == Model Calendar year introduced Current model Current model Vehicle Description Image Name(s) Introduction Update/facelift Sedans Sedans Sedans Sedans Sedans Sedans Sedans CT4 2019 2019 – Compact executive sedan. It is also marketed in a high- performance version called CT4-V. CT5 2019 2019 2024 Executive sedan. It is also marketed in a high-performance version called CT5-V. CT6 2016 2023 – Full-size luxury sedan. Discontinued in North America and Europe after 2020, continued production in China. Replaced by Celestiq in North America. Celestiq 2023 2023 – Electric full-size luxury sedan. Replacing CT6 in North America and serving as an electric derivative. SUVs/Crossovers SUVs/Crossovers SUVs/Crossovers SUVs/Crossovers SUVs/Crossovers SUVs/Crossovers SUVs/Crossovers Escalade 1998 2021 – Full-size luxury SUV. Related to the Chevrolet Tahoe, Chevrolet Suburban and GMC Yukon. Escalade IQ 2023 2023 – Electric derivative of the Escalade. Closely related to GMC Hummer EV and Chevrolet Silverado EV. GT4 2023 2023 - Compact luxury crossover SUV. Related to the XT4. Currently manufactured for the Chinese market. Vistiq 2024 2024 – Fully electric three-row mid-size luxury crossover SUV served as an electric deriative of Cadillac XT6. Lyriq 2022 2022 – Fully electric mid-size luxury crossover SUV served as an electric derivative of XT5. Optiq 2023 2023 – Fully electric compact luxury crossover SUV served as an electric derivative of XT4. XT4 2018 2018 2024 Subcompact luxury crossover SUV. It is related to the latest model Buick Envision. XT5 2016 2024 – Compact luxury crossover SUV. Related to the GMC Terrain and Chevrolet Equinox. XT6 2019 2019 – Three-row mid-size luxury crossover SUV. Related to the GMC Acadia and Chevrolet Traverse. == Former production vehicles == Exterior Name Platforms Information / notes Runabout / Tonneau 1902 1908 9 Model D 1905 1905 1 Model Thirty 1909 1911 1 V8 Type 51 1915 1923 1 Type V-63 1924 1930 C-body 1 V-16 1930 1940 D-body 2 V-12 1930 1937 D-body 2 Series 355 1931 1935 C-body 1 Series 70 1936 1987 D-body 11 Series 60 1936 1938 B-body 1 Series 65 1937 1938 C-body 1 Sixty Special 1938 1993 C-body 11 Series 61 1938 1951 B-body 4 Series 62 1940 1964 C-body 7 Eldorado 1952 2002 12 de Ville 1959 2005 8 Calais 1965 1976 C-body 2 Full-size luxury sedan, hardtop and coupe Seville 1975 2004 K-body (1975-97) G-body (1997-2004) 5 Fleetwood 1976 1996 D-body 3 Fleetwood Brougham 1977 1986 D-body 1 Cimarron 1981 1988 J-body 1 Brougham 1986 1992 D-body 1 Allanté 1987 1993 V-body 1 Catera 1996 2001 V-body 1 CTS 2002 2019 Sigma (2002–14) Alpha (2014–19) 3 SRX 2003 2016 Sigma (2003–09) Theta (2010–16) 2 XLR 2003 2009 Y-body 1 DTS 2005 2011 G-body 1 BLS 2005 2009 Epsilon 1 STS 2005 2011 Sigma 1 ATS 2012 2019 Alpha 1 XTS 2013 2019 Epsilon II 1 ELR 2013 2016 Delta II 1 ;Notes === Brands === Exterior Name Platforms Information / notes LaSalle 1927 1940 GM B 3 ==Gallery== File:Cadillac 6.5 HP Tonneau 1903 07-11-2010 13-54-25.JPG|Cadillac 6 1/2HP Tonneau 1903 File:Cadillac 8.25 HP Surrey 1904 03-11-2013 09-13-28.jpg|Cadillac 8 1/4HP Surrey 1904 File:Cadillac 10HP Tonneau 1904 03-11-2013 08-32-24.jpg|Cadillac 10HP Tonneau 1904 File:Cadillac 1904 6.5 HP Rear-entrance tonneau on London to Brighton VCR 2010.jpg|Cadillac 6 1/2HP Rear-Entrance Tonneau 1904 File:Cadillac 1904 8.25 HP Detachable-Top Limousine on London to Brighton VCR 2010 15-39-05.jpg| Cadillac 8 1/4HP Detachable-Top Limousine 1904 File:Cadillac 8.25 HP Tonneau 1904 07-11-2010 14-17-57.JPG|Cadillac 8 1/4HP Tonneau 1904 File:Cadillac 8.25 HP Tonneau 1904 07-11-2010 14-52-04.jpg|Cadillac 8 1/4HP Tonneau 1904 File:Cadillac 1904 8.25 HP tonneau on London to Brighton VCR 2010.jpg| Cadillac 8 1/2HP Tonneau 1904 File:Cadillac 1904 Rear Entrance Tonneau on London to Brighton 2010.jpg|Cadillac 10HP Tonneau 1904 File:Cadillac 1904 9HP Limousine on London to Brighton VCR 2010 15-52-37.jpg|Cadillac 9HP Limousine ==Other websites== * Cadillac.com – Official site * Cadillac.GM.ca – Official site of Cadillac in Canada * CadillacEurope.com – Official site of Cadillac in Europe * CadillacOwners.com – Community of Cadillac owners and enthusiasts with pictures, classifieds, auctions, discussions, tech tips and more. * History and Picture Cadillac in Russian Category:General Motors Category:Automobile brands",
 "title": "Cadillac"
}