{
 "id": "51415",
 "text": "Vauxhall is a car manufacturer. The company was founded in London in 1903 and was named after the area of the city where it was created. The company is based in Luton, Bedfordshire. They have 2 factories, 1 in Luton for the production of the Vivaro van and 1 in Ellesmere Port for the production of the Astra family car. In March 2017, Vauxhall and parent brand Opel were bought by PSA, the company that owns Peugeot and Citroen. The brand would become a part of Stellantis after a merger between PSA and Fiat Chrysler Automobiles in January 2021. ==Current products== ===Passenger cars=== The following tables list current and announced Vauxhall production vehicles as of 2022: Model Image Class Body style Astra (A Opel Astra with a Vauxhall badge) (Was previously a Opel Kadett with a Vauxhall badge from 1980 to 1991) (Made: 1980–present) *Hatchback *Sports Tourer (Estate) Corsa (A Opel Corsa with a Vauxhall badge) (Made: 1993–present) *Hatchback Mokka (A Opel Mokka with a Vauxhall badge) (Made: 2012–present) *Crossover SUV Grandland (A Opel Grandland with a Vauxhall badge) (Made: 2017–present) *Crossover SUV Combo Life (A Peugeot Rifter/Citroën Berlingo with a Vauxhall badge) (Made: 2018–present) *MPV Vivaro Life (A Peugeot Traveller/Citroën SpaceTourer with a Vauxhall badge) (Made: 2019–present) *MPV Frontera (A Citroën C3 Aircross with a Vauxhall badge) (Made: 2024–present) *Crossover SUV ===Commercial vehicles=== Model Image Class Body style Combo (A Peugeot Partner/Citroën Berlingo with a Vauxhall badge) (Was previously a Opel Combo with a Vauxhall badge from 1993 to 2012) (Was previously Fiat Doblò with a Vauxhall badge from 2012 to 2018) (Production: 1993–present) *Van Movano (A Fiat Ducato with a Vauxhall badge) (Was previously a Renault Master with a Vauxhall badge from 1998 to 2021) (Production: 1998–present) *Van *Chassis cab *Crew cab Vivaro (A Peugeot Expert/Citroën Jumpy with a Vauxhall badge) (Was previously a Renault Trafic with a Vauxhall badge from 2001 to 2019) (Production: 2001–present) *Van *Chassis cab ===VXR models=== Corsa VXR *Hatchback Astra VXR *Hatchback Coupé Vectra VXR *Saloon *Hatchback *Sports Tourer (Estate) Insignia VXR *Saloon *Hatchback *Sports Tourer (Estate) VXR8 *Saloon Meriva VXR *MPV Zafira VXR *MPV VX220 *Coupé *Convertible Monaro VXR *Coupé VXR8 Maloo *Pick-up == Notes == == References == == Other websites == * Vauxhall Heritage * Vauxhall UK Website Category:Opel automobiles Category:Stellantis Category:British automobile companies",
 "title": "Vauxhall Motors"
}