{
 "id": "514250",
 "text": "Fraggle Rock is a British/American/Canadian children's live action puppet television series. It was created by Jim Henson. Fraggle Rock is about a society of Muppet creatures called Fraggles. It was shown from 1983–1987. Down at Fraggle Rock (Down in Fraggle Rock) is an opening and ending song. In 1993 versions of some episodes, at the end of some scenes of some episodes and some episodes, the 1993 Fraggle Rock \"Stay tuned\" screen/logo plastered/replaced the 1982–1987 Fraggle Rock ending credits and at the end of 1993 versions of some episodes, 1993 Fraggle Rock ending credits replace/plastered 1982–1987 Fraggle Rock ending credits. The intro was shortened on The Hub in 2010–2013, and Hub Network in 2013–2014 and Discovery Family since 2014. In the cartoonish/animated intro, the Roland D-50 patch \"Piano-Fifty\" was heard. In some versions of the theme, the Yamaha DX7 internal factory patch \"Electric Bass 1\" was heard in 1983–1987. It got cartoonish/animated in season 6 (1987). Fraggle Rock was co-produced by British television company Television South (TVS), the Canadian Broadcasting Corporation, U.S. pay television service Home Box Office and Henson Associates. Unlike Sesame Street, it was intended from the start to be an international production. Henson described the Fraggle Rock series as \"a high-energy, raucous musical romp. It's a lot of silliness. It's wonderful.\"Random House, 1993. Jim Henson The Works: The Art, The Magic, The Imagination While the program proved accessible to audiences of all ages, it used the fantasy creatures as examples to deal with serious issues. These included prejudice, spirituality, personal identity, the environment, and social conflict.Down at Fraggle Rock documentary; 1987, HBO and Jim Henson Productions Fraggle Rock features many original songs. ==Characters== ===The Workshop/Lighthouse=== The Fraggles call the human world \"outer space\" and humans \"silly creatures from outer space.\" *Doc/The Captain is the only human character in the story. In the American version, he is an old man who lives in a workshop. In the British version, he is an old man who lives in a lighthouse. *Sprocket is Doc's/the Captain's dog. He is a puppet. ===Fraggles=== *Gobo is a male Fraggle who wants to be an explorer. He is named after the cover for a lens cap. *Mokey is a female Fraggle who likes art, history and spiritual things. *Red is a female Fraggle with an aggressive personality who likes to organize swim meets and other events. *Boober is a male Fraggle who likes to do laundry and keep things clean. He is afraid of germs and many other things. *Wembley is a male Fraggle who has trouble making decisions. *Traveling Matt is Gobo's uncle who went out into \"outer space,\" the human world, to explore. He sends Gobo post cards describing the things he sees. He watches humans, which Fraggles call \"silly creatures\" and often misunderstands the things they do. He is named after a special effect called \"traveling matte.\" *Unparodys The Mickeys ===Doozers=== Doozers are people smaller than Fraggles. Doozers have green skin and small eyes. They almost always wear hard hats. They spend most of their time building clear structures using cranes and other construction tools. The Fraggles like to eat these structures. *Cottar Pin is a young Doozer who makes friends with the Fraggles. ===Gorgs=== Gorgs are people much bigger than Fraggles. They call their house \"the castle\" and the rest of their land \"the universe.\" The show never says whether they really are rulers or whether they are poor farmers who like to pretend they are rulers. *The Emperor of the Universe *The Empress of the Universe *Junior, the Emperor and Empress' son. Junior likes to catch Fraggles when they cross the Gorg's lands to reach the Trash Heap. *Trash Heap is a talking pile of rubbish. The Fraggles think of her as an oracle and ask her for advice and help. == References == Category:1983 American television series debuts Category:1987 American television series endings Category:1983 British television series debuts Category:1980s Canadian television series Category:American children's television series Category:British children's television series Category:Canadian children's television series Category:English-language television programs",
 "title": "Fraggle Rock"
}