{
 "id": "514488",
 "text": "Queen Rania of Jordan (; born Rania al-Yassin and sometimes called Rania al- Abdullah; born on 31 August 1970 in Kuwait City, Kuwait) is the Queen consort of Jordan. After she married Abdullah II of Jordan, she became known for her work in education, health, community empowerment and micro-finance. She also uses social media often (Facebook, Twitter and YouTube). She has two daughters and two sons. She has been given many awards by governments. == Personal life == Rania al-Yassin was born in Kuwait City to Palestinian parents. She went to the New English School in Jabriya, Kuwait. She got a degree in business administration at the American University in Cairo. Before graduating from the American University, she worked with Citibank and Apple, Inc..\"Profile: Jordan's Queen Rania\", BBC 7 November 2001. == Work == === Work in Jordan === ==== Education and health ==== Queen Rania of Jordan has launched and fought for many initiatives in education and learning. In July 2005, in partnership with the Ministry of Education, the King and Queen created the Queen Rania Award for Excellence in Education.Queen Rania Award for Excellence in Education .Queen launches award to honor school principals , 15 April 2009. It is an annual award for teachers. Queen Rania is the chairperson of Jordan's first children's museum. It was opened in May of 2007. It encourages lifelong learning for children and their families.King, Queen join Jordanian children at opening of children's museum, Jordan Times, 23 May 2007. In 2007, Queen Rania began a program to renovate 500 of Jordan's schools in a period of five years. Queen Rania is also chairpersonQueen Rania chairs first meeting of Royal Health Awareness Society, 7 September 2005. of the Royal Health Awareness Society (RHAS). ==== Community empowerment ==== Queen Rania created the Jordan River Foundation in 1995. This foundation works to empower society, especially women and children, to improve the quality of life and make a better future for all Jordanians. She also created the Jordan River Children Program (JRCP). This program wants to place children’s well-being above politics and cultural taboos.Interview with Il Messaggero, 13 May 2008. After two children were killed in Jordan because of child abuse, Queen Rania called for an emergency meeting to discuss where the system was failing.Queen calls emergency meeting to discuss child abuse cases, Jordan Times, 24 July 2009 === Online === ==== YouTube ==== On 30 March 2008, Queen Rania launched her own YouTube channel. It was originally to invite viewers to give their opinions on the Middle East and talk about the stereotypes they may have of Arabs and Muslims.Queen Rania Launched YouTube Channel, USA Today, 31 March 2008. Titles 10 June 1993-22 March 1999 Her Royal Highness Princess Rania Al Abdullah of Jordan 22 March 1999 Her Majesty The Queen of the Hashemite Kingdom of Jordan National Honor Jordan -Grand Cordon with Collar of the Order of Al-Hussein bin Ali (9 June 1999) -Knight Grand Cordon, Special Class of the Supreme Order of the Renaissance (6 March 2024) Foreign Honors -Belgium: Grand Cordon of the Order of Leopold (18 May 2016) -Germany: Grand Cross Special Class of the Order of Merit of the Federal Republic of Germany (21 October 2002) -Italy: Knight Grand Cross of the Order of Merit of the Italian Republic (19 October 2009) -Japan: Grand Cordon (Paulownia) 1st Class of the Order of the Precious Crown (4 December 1999) -Portugal: Grand Cross (GCSE) of the Order of Saint James of the Sword (16 March 2009), Grand Cross (GCIH) of the Order of Infante Henry (5 March 2008) -Spain: Dame Grand Cross of the Order of Charles III (21 April 2006), Dame Grand Cross of the Royal Order of Isabella the Catholic (18 October 1999) ==Related pages== *List of Jordanian consorts == References == == Other websites == *Official website *Madrasati *Jordan Education Initiative *Global Campaign for Education *Education for All: Class of 2015 *National Council for Family Affairs Category:1970 births Category:Living people Category:Kings and Queens consort of Jordan Category:Recipients of the Decoration for Services to the Republic of Austria Category:Dames Grand Cross of the Order of the Lion of the Netherlands Category:People from Tulkarm",
 "title": "Queen Rania of Jordan"
}