{
 "id": "514573",
 "text": "Wrangel Island () is a small island in the Arctic Ocean belonging to Russia. It lies between the Chukchi Sea and East Siberian Sea. Wrangel Island lies across the 180° meridian. The International Date Line is displaced eastwards at this latitude to avoid the island and the Chukchi Peninsula on the Russian mainland. It is roughly in area. The closest land to Wrangel Island is tiny and rocky Herald Island located to the east.M.K. Kos'ko; M.P. Cecile; J.C. Harrison; et al., Geology of Wrangel Island Between Chukchi and East Siberian Seas, Northeastern Russia, Bulletin 461 (Ottawa Ontario: Geological Survey of Canada, 1993), p. 101 The distance to the closest point on the Siberian mainland is .S.L. Vartanyan; K.A. Arslanov; T.V. Tertychnaya; et al., 'Radiocarbon Dating Evidence for Mammoths on Wrangel Island, Arctic Ocean, until 2000 BC', Radiocarbon, Vol 37, Issue 1 (1995), pp. 1–6 Wrangel Island may have been the last place on earth where Woolly Mammoth survived. It is home to many arctic animals including polar bears. Since 1976 it has been a nature reserve. == History == Baron Ferdinand von Wrangel (1796–1870) was a German explorer and seaman in the service of the Russian Empire.Lutz D. Schmadel, Dictionary of Minor Planet Names (Berlin; New York: Springer, 2012), p. 1194 He noticed birds flying north near the Kolyma river. From this he correctly deduced there was an island in the Arctic ocean. He searched for the island in the 1820s but never found it. In 1881 an American steamship, the Thomas L. Corwin, searching for a lost expedition found themselves off Wrangel island. They searched the island for survivors but found none. They raised an American flag on the and claimed it for the United States. They named it \"New Columbia\", but the name never stuck. Nothing was done about the discovery for the next 30 years. In 1913, Vilhjalmur Stefansson led a large expedition to discover a lost continent he believed was under the Arctic ice cap. They sailed from Victoria, British Columbia on June 17, 1913. Six weeks later their ship was caught in the ice. Stefansson and several companions left the expedition and returned to safety. When the ship was crushed, the crew set up camp on the ice. In March of 1914, Captain Bartlett led what was left of his crew 80 miles across the ice to Wrangel Island. Twelve survivors were picked up by a small whaling schooner in September of 1914. In 1921, Stefansson claimed Wrangel island for Canada. An expedition from Canada to colonize the island failed. By 1926 Russia re-established their claim to the island by setting up a colony there. Eventually the colonists returned to the mainland leaving the island deserted. In 1976 the Soviet Union declared the island a zapovednika, a federally protected nature reserve. In English it is called the Wrangel Island Nature Reserve. It protects large colonies of snow geese, polar bears, and walrus that live here. Only official Russian government personnel and invited guests can visit the reserve. == Galápagos of the far north == Wrangel island was never covered by glaciers during the last ice ages and it was never covered by water when the ice retreated. The soil and plants on Wrangel have been undisturbed by time. The interior valleys are mainly ancient Pleistocene tundra. They boast over 400 unique plant species. === Wildlife === Even though it is a very harsh climate Wrangel island has a large and diverse wildlife population. It is the world's largest Polar Bear denning ground. There are about 400 female bears who raise their young here. It has the world's largest population of Pacific Walrus. The island has large populations of Snow Geese, Snowy Owls, seals, Arctic wolves, Arctic fox and lemmings. One thing the island seems to be missing is mosquitoes. === Woolly Mammoths === Wrangel island may have been the last place Woolly Mammoths (Mammuthus primigenius) existed before becoming extinct. The island is littered with mammoth tusks. A population of mammoths existed here some 6,000 years after they went extinct on the mainland. They survived until about 1650 BCE. Archaeological evidence on the island shows them to be a smaller subspecies, Mammuth primigenius wrangelensis. == References == Category:Arctic islands Category:Islands of Russia Category:World Heritage Sites in Russia",
 "title": "Wrangel Island"
}