{
 "id": "514934",
 "text": "Andrew Stephen \"Andy\" Grove (born András István Gróf; 2 September 1936 - 21 March 2016) was a Hungarian-born American businessman, engineer, and author. He was a science pioneer in the semiconductor industry. He escaped from Communist-controlled Hungary at the age of 20 and moved to the United States where he finished his education. He later became CEO of Intel Corporation and helped transform the company into the world's largest manufacturer of semiconductors. As a result of his work at Intel, along with his books and professional articles, Grove had a considerable influence on electronics manufacturing industries worldwide. Andrew Grove has been called the \"guy who drove the growth phase\" of Silicon Valley. == Biography == Andrew Grove was born in Budapest (Hungary) in 1936 to a Jewish family.Movers and Shakers: the 100 Most Influential Figures in Modern Business, Basic Books (2003), pp. 205–207. When he was eight, the Nazis occupied Hungary and deported nearly 500,000 Jews to concentration camps. To avoid being arrested, Grove and his mother took on false identities and were sheltered by friends. During the Hungarian Revolution of 1956, when he was 20, Andrew emigrated to the United States. In 1960 he received a bachelor's degree in chemical technology from the City College, New York. . In 1963, Grove received his Ph.D. from the University of California, Berkeley. == Career == In 1968, Robert Noyce and Gordon Moore co-founded Intel, after they and Grove left Fairchild Semiconductor. Grove joined on the day of its incorporation, although it was not a founder according to the company. In 1979 he became Intel president, in 1987 its executive director, and in 1997 its executive director and chairman of the board of directors. In May 1998, Grove resigned as CEO, remaining chairman of the board. == Honors and awards == * Grove received honorary degrees from the City College of New York (1985), Worcester Polytechnic Institute (1989) and Harvard University (2000). * In 2004, the Wharton School of Business recognized him as the \"Most Influential Business Person of the Last 25 Years.\"Koven, Steven G.; Gotzke, Frank. American Immigration Policy: Confronting the Nation's Challenges, Springer Science (2010), p. 81. * Strategic Management Society's Lifetime Achievement Award (2001)Strategic Management Society – Home * IEEE Medal of Honor (2000) * Time Magazine's Man of the Year (1997) * \"1997 Technology Leader of the Year\", IndustryWeek.com, December 15, 1997\"1997 Technology Leader of the Year\", IndustryWeek.com, December 15, 1997. * Chief Executive's CEO of the Year (1997)CEO of the year 1997 . * Medal of Achievement from the American Electronics Association (1993) * IEEE Engineering Leadership Recognition Award (1987) * Franklin Institute Certificate of Merit (1975) == References == == Other websites == * Biography from Intel.com * Biography at IEEE * Book homepages - Swimming Across , High Output Management , Only the Paranoid Survive , * The Life and Times of an American * TIME: Man of the year * Andy Grove's Ambitious Conversions Goals at Plug-In 2008. * Andrew Grove: High Output Management . Category:1936 births Category:2016 deaths Category:American chief executives Category:Engineers from New York (state) Category:Businesspeople from New York City Category:Deaths from Parkinson's disease Category:Disease-related deaths in California Category:Scientists from Budapest Category:Naturalized citizens of the United States Category:Writers from Budapest Category:Writers from New York City Category:Intel",
 "title": "Andrew Grove"
}