{
 "id": "51517",
 "text": "Camouflage is a visual disguise. Without it, an animal would be recognised easily. If the natural color of an animal makes it look like its surroundings, that is camouflage. One example is a tiger's stripes in the long grass. Camouflage is a form of deception. The word camouflage comes from the French word camoufler, which means \"to disguise\". == Natural camouflage == In nature, most animals blend into their environment or conceal their shape. They are very hard to see. This way they survive, and if they survive, then they can reproduce. There are exceptions: animals which are dangerous to eat (e.g. wasps) advertise with warning coloration.Wickler W. 1968. Mimicry in plants and animals. McGraw-Hill, New York Prey animals hide from predators. Predators must search for prey without being seen. Natural camouflage is one way to do this: an animal can blend in with its surroundings. Another way is for the animal to disguise itself as something harmless.Owen, Dennis1980. Camouflage and mimicry. Oxford.Cott, Hugh B. 1940. Adaptive colouration [sic] in animals. Methuen, London. Some camouflaged animals also copy movements in nature, e.g., of a leaf blowing in the wind. Other animals attach natural materials to their body for concealment. A few animals change color in changing environments. Seasonally: (many Arctic animals, such as the arctic fox, or arctic hare). Or quickly, like the chameleon and the cuttlefish. Some herd animals, like zebra, have a pattern which makes it difficult for the predator when they are running. Mimicry is a special kind of camouflage, where an animal or plant looks like another, usually one which is unpleasant to eat or dangerous. === Countershading === Most animals are dark on top and light underneath. With light coming from the sky, this countershading makes them less visible. That this is the correct explanation is proved by cases where the animal lives upside down. A famous example is the Nile catfish, which swims belly uppermost. In this case, the belly is dark, and the back is light in color.p43 == Transparency and silvering == Transparent or partly transparent animals are common in the pelagic layer of the sea.McFall-Ngai, Margaret J. 1990. Crypsis in the pelagic environment. American Zoologist. 30, 1 175–188.Johnsen, Sönke 2001. Hidden in plain sight: the ecology and physiology of organismal transparency. Biological Bulletin 201, 3, 301–318. Herring, Peter 2002. The biology of the deep ocean. Oxford University Press, 190–195. Ruxton G.D. Sherratt T.N. and Speed M.P. 2004. Chapter 4 Transparency and silvering, in Avoiding attack: the evolutionary ecology of crypsis, warning signals & mimicry. Oxford. These are the layers into which light penetrates. The effect of transparency or silvering works is better under water than above it. This is because the amount of light which penetrates is less and less as the depth increases. Also, the proportion of the light reflected is much less under water (0.001–0.6%) than in air (2–5%). == Related pages == *Military camouflage *Mimicry *Warning coloration: the opposite of camouflage == References == == Further reading == *Ferrari, Mareo 1992. Colors for survival: mimicry and camouflage in nature. NY: Barnes & Noble. *Behrens, Roy R. 2002. False colors: art, design and modern camouflage. Bobolink Books. *Wolf, Art 2005. Vanishing act. Text by Barbara Sleeper. NY: Bullfinch Press. *Purser, Bruce 2003. Jungle bugs: masters of camouflage & mimicry. Toronto: Firefly. *Forbes, Peter 2009. Dazzled and deceived: mimicry and camouflage. Yale University Press. == Other websites == *Harris, Tom. 2006. How animal camouflage works. How Stuff Works. * *Roy R. Behrens. Art and camouflage: an annotated bibliography *Roy R. Behrens 2006. The thinking eye: a chronology of camouflage *An informal study into camoflage * BBC/Attenborough: Octopus hides in shells, from Blue Planet II. == Gallery == Image:African Scops owl.jpg|Scops owl in tree: feathers camouflage the owl during daytime Image:bristol.zoo.dead.leaf.mantis.arp.jpg| A mantis from Madagascar looks like a dead leaf. Image:Kareius bicoloratus Camouflage.JPG|Two flatfish blending in! Image:LeafInsect.jpg|A leaf insect at home Image:Tiger - melbourne zoo.jpg|Tiger in zoo easily seen: but at home it blends with the long grass. Image:Obscured jaguar.jpg|The more real the surroundings, the better the camouflage. Image:Tawny Frogmouth (Coverdale).jpg|Tawny frogmouth blends in with color and texture of tree bark. Sydney, New South Wales. Image:Mimicry by spider.JPG|Spider hides in flower Image:2005-Draco- dussumieri.jpg|Draco indochinensis uses disruptive coloration, and lying flat to avoid shadow. Category:Coevolution Category:Mimicry Category:Ethology",
 "title": "Camouflage"
}