{
 "id": "515790",
 "text": "#1 to Infinity is the sixth compilation album by American singer and songwriter Mariah Carey. It was released by Sony Music Entertainment on May 15, 2015. It features Carey's eighteen U.S. number-one singles on the Billboard Hot 100. It also includes \"Infinity\", a new song written for the album. ==Track listing== ;Notes *\"I'll Be There\" featuring Trey Lorenz is a cover originally performed by The Jackson 5 *\"Without You\" is a cover originally performed by Badfinger *\"Endless Love\" with Luther Vandross is a cover originally performed by Lionel Richie and Diana Ross *\"Against All Odds\" with Westlife is a cover originally performed by Phil Collins *\"Fantasy\" is the Bad Boy Fantasy version. It also contains a sample of the Tom Tom Club's song \"Genius of Love\", written by Chris Frantz, Tina Weymouth, Adrian Belew and Steven Stanley *\"Honey\" contains samples of \"Hey DJ\" by the World's Famous Supreme Team, written by Stephen Hague, and \"The Body Rock\" by the Treacherous Three, written by Bobby Robinson, Larry Price and Malcolm McLaren *\"Heartbreaker\" contains a sample of \"Attack of the Name Game\" by Stacy Lattisaw, written by Shirley Ellis and Lincoln Chase *\"We Belong Together\" contains samples of Bobby Womack's \"If You Think You're Lonely Now\", written by Bobby Womack, Patrick Moten and Sandra Sully, and The Deele's \"Two Occasions\", written by Darnell Bristol and Kenneth Edmonds ==Charts== Chart (2015) Peak position Australian Albums (ARIA Urban) 2 ==Release history== Country Date Format Label Germany May 15, 2015 Sony United Kingdom Digital download France May 18, 2015 Spain Digital download United Kingdom CD United States Italy May 19, 2015 Sony Spain CD Australia May 22, 2015 United States August 28, 2015 Vinyl ==References== Category:2015 albums Category:Mariah Carey albums Category:Pop albums Category:Gospel albums Category:R&B; albums Category:Greatest hits albums Category:Epic Records albums Category:Columbia Records albums",
 "title": "Number 1 to Infinity"
}