{
 "id": "516346",
 "text": "Peter Kelamis (born December 11, 1967) is an Australian-born-Canadian actor, voice actor, comedian and impressionist. He was born in Sydney, Australia and raised in Vancouver, British Columbia, Canada. He is best known for playing Dr. Adam Brody in Stargate Universe, Goku in the Ocean Group English dub of the animated series Dragon Ball Z and Rolf from Ed, Edd n Eddy. ==Personal life== Kelamis has been married to Canadian actress Alannah Stewartt since 2004 and they currently reside in Vancouver, British Columbia, Canada. ==Filmography== ===Film and television=== Year Title Role Notes 1991-1995 The Commish Clerk, Bellman Episodes: \"Behind the Storm Door\", \"The Golden Years\" 1993 Sherlock Holmes Returns Respiratory Therapist 1994 Sleeping with Strangers Photographer 1994 Hawkeye Yves Episode: \"The Siege\" 1994-1996 Hurricanes Additional Voices 1994-1998 The X-Files Assistant D.A. Daniel Costa, Additional Roles 1995 Madison Mr. Stand Up Episode: \"House of Cards\" 1995 Suspicious Agenda Police Photographer 1995 Sliders Glenn Episode: \"The Weaker Sex\" 1995 The New Adventures of Madeline Additional Voices 1995-1996 Strange Luck David Benton 1996 Key the Metal Idol Shuichi Tataki (voice) (English version) 1996 Happy Gilmore Potter's Caddy 1996 Bliss Neighbor 1996 For Hope Writer One 1997 Jitters Angelo 1997 The Right Connections Sales Guy 1997-2000 Dragon Ball Z Goku (voice) (English Canadian/Europe TV version) 1998 Dragon Ball Z: Dead Zone Goku (voice) (English version - Pioneer/Geneon & FUNimation) 1998 Dragon Ball Z: The World's Strongest Goku (voice) (English version - Pioneer/Geneon & FUNimation) 1998 Dragon Ball Z: The Tree of Might Goku (voice) (English version - Pioneer/Geneon & FUNimation) 1998 The Sentinel Ed Warner Episode: \"Neighborhood Watch\" 1998 Voyage of Terror Purser Jennings 1998 The Net Bobby Episode: \"Deleted\" 1998 I'll Be Home for Christmas Conway the Bus Driver 1999 Can of Worms Intergalactic Cop (voice) 1999 Roswell Conspiracies: Aliens, Myths and Legends Simon \"Fitz\" Fitzpatrick 1999-2009 Ed, Edd n Eddy Rolf (voice) 2000 Lion of Oz Tog (voice) 2000 Key the Metal Idol Shuichi Tataki (voice) 2000-2002 Action Man Ricky Singh-Baines (voice) 2000-2002 What About Mimi? Herbert Finkle (voice) Lodeman (voice) Mr. Greely (voice) Additional Voices 2001 Rudolph the Red-Nosed Reindeer and the Island of Misfit Toys Foreman Elf (voice) 2001 Barbie in the Nutcracker Pimm (voice) 2002 Stargate SG-1 Dr. Brent Langham 2002 Barbie as Rapunzel Otto (voice) Skinny Swordsman (voice) 2002 Super Duper Sumos Dr. Stinger (voice) 2003 Transformers: Go-Bots Mototron (voice) 2003 G.I. Joe Spy Troops Polly (voice) 2003 Stargate SG-1 Coyle Boron 2004 ToddWorld Pickle & Vark 2005 Transformers Cybertron Wing Saber (voice) 2005-2006 Krypto the Superdog Tail Terrier (voice) 2005-2008 Being Ian Mr. Greeble (voice) 2005-2009 Class of the Titans Granny Hercules (voice) Old Timer (voice) Orpheus (voice) Melampus (voice) 2006 Barbie in the 12 Dancing Princesses Brutus (voice) Sentry #4 (voice) 2007 George of the Jungle Narrator, Cousin Larry (voice) 2008 Bratz Baby Save Christmas Max (voice) Dad (voice) 2009 Ed, Edd n Eddy's Big Picture Show Rolf (voice) 2009 League of Super Evil Magenta (voice) Miss Johnson (voice) Mysterio Villaino (voice) Mr. Lee (voice) 2009 Iron Man: Armored Adventures Whiplash/Marc Scarlotti (voice) 2009-2011 Stargate Universe Dr. Adam Brody 2010 Dreamkix Byrne (voice) Pierre Pierre (voice) Gazelle Captain (voice) 2010 Barbie: A Fashion Fairytale Spencer (voice) 2010 The Twisted Whiskers Show Dine (voice) 2011 50/50 Phil 2012 Action Dad Shortcut (voice) Prince Eyeball (voice) H.Q. Voice (voice) Alam Voice (voice) Director (voice) Computor (voice) 2012 Barbie: The Princess & the Popstar Seymour Crider (voice) 2012 The Cabin in the Woods Demo Guy #1 2012-2013 Slugterra Primo Pesto (voice) 2013 Barbie & Her Sisters in A Pony Tale Monsiur Philippe (voice) 2014 Big Eyes Real Estate Guy 2014 Barbie and the Secret Door Sniff (voice) 2015 My Little Pony: Friendship Is Magic Fashion Plate (voice) Episode: \"Canterlot Boutique\" 2015 Barbie in Rock 'N Royals Eddie (voice) ===Video games=== Year Title Role Notes 2005 Devil Kings Akechi Mitsuhide / Reaper Voice role 2005 Ed, Edd n Eddy: The Mis-Edventures Rolf Voice role 2013 Grand Theft Auto V Local Population 2013 Disney Infinity Randall Boggs Voice role 2015 Disney Infinity 3.0 Randall Boggs Voice role ==References== Category:1967 births Category:Living people Category:Actors from Sydney Category:Actors from Vancouver Category:Australian comedians Category:Australian movie actors Category:Australian television actors Category:Australian voice actors Category:Canadian comedians Category:Canadian movie actors Category:Canadian television actors Category:Canadian voice actors",
 "title": "Peter Kelamis"
}