{
 "id": "516718",
 "text": "\"Lofsöngur\" (, meaning \"Hymn\") is the national anthem of Iceland. It was written for the celebration of the thousandth anniversary of the first Norse settlement of the Nordic country, though it had not been considered a national anthem for another forty years. It was adopted in 1944, when Iceland became a republic and wanted to end being in a personal union with Denmark. Previously, in 1874, the music of the hymn composed by Sveinbjörn Sveinbjörnsson, and the words to his music were written by Matthías Jochumsson.Iceland’s national anthem was written in an Edinburgh house (2016-06-27). The Scotsman. ==Lyrics== Only the first stanza is regularly used as the national anthem. Words of the song in Icelandic Pronunciation of these words using the IPA Words of the song in English Ó, guð vors lands! Ó, lands vors guð! Vér lofum þitt heilaga, heilaga nafn! Úr sólkerfum himnanna hnýta þér krans þínir herskarar, tímanna safn. Fyrir þér er einn dagur sem þúsund ár og þúsund ár dagur, ei meir: eitt eilífðar smáblóm með titrandi tár, sem tilbiður guð sinn og deyr. Íslands þúsund ár, Íslands þúsund ár, eitt eilífðar smáblóm með titrandi tár, sem tilbiður guð sinn og deyr. Ó guð, ó guð! Vér föllum fram og fórnum þér brennandi, brennandi sál, guð faðir, vor drottinn frá kyni til kyns, og vér kvökum vort helgasta mál. Vér kvökum og þökkum í þúsund ár, því þú ert vort einasta skjól. Vér kvökum og þökkum með titrandi tár, því þú tilbjóst vort forlagahjól. Íslands þúsund ár, Íslands þúsund ár! Voru morgunsins húmköldu, hrynjandi tár, sem hitna við skínandi sól. Ó, guð vors lands! Ó, lands vors guð! Vér lifum sem blaktandi, blaktandi strá. Vér deyjum, ef þú ert ei ljós það og líf, sem að lyftir oss duftinu frá. Ó, vert þú hvern morgun vort ljúfasta líf, vor leiðtogi í daganna þraut og á kvöldin vor himneska hvíld og vor hlíf og vor hertogi á þjóðlífsins braut. Íslands þúsund ár, Íslands þúsund ár! verði gróandi þjóðlíf með þverrandi tár, sem þroskast á guðsríkis braut. [ou̯ː ǀ kʋʏːð̠˕ ʋɔ̝r̥s̺ läns̺ ‖ ou̯ː ǀ läns̺ ʋɔ̝r̥s̺ kʋʏːð̠˕ ‖] [ʋjɛ̝ːr lɔ̝ː.ʋʏ̈m θ̠ɪʰt̪ hei̯ː.lä.ɣ̞ä ǀ hei̯ː.lä.ɣ̞ä näpn̥ ‖] [uːr s̺ou̯ːl.cʰɛ̝r.ʋʏ̈m hɪm.nän.nä n̥iː.t̪ʰä θ̠jɛ̝ːr kʰr̥äns̺] [θ̠iː.nɪr hɛ̝r.s̺kä.rär ǀ t̪ʰiː.män.nä s̺äpn̥ ‖] [fiː.rɪr θ̠jɛ̝r ɛ̝ːr ei̯t̪n̥ t̪äː.ɣ̞ʏ̈r s̺ɛ̝m θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥] [ɔ̝ɣ̞ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr t̪äː.ɣ̞ʏ̈r ǀ ei̯ː mei̯ːr̥ ‖] [ei̯ʰt̪ ei̯ː.liʋ.ð̠˕är s̺mɑu̯.plou̯m mɛ̝ð̠˕ t̪ʰɪːt̪.rän.t̪ɪ t̪ʰɑu̯ːr̥ ǀ] [s̺ɛ̝m t̪ʰɪːl.pɪ.ð̠˕ʏ̈r kʋʏːð̠˕ s̺ɪnː ɔ̝ɣ̞ t̪ei̯ːr̥ ‖] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ǀ] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ǀ] [ei̯ʰt̪ ei̯ː.liʋ.ð̠˕är s̺mɑu̯.plou̯m mɛ̝ð̠˕ t̪ʰɪːt̪.rän.t̪ɪ t̪ʰɑu̯ːr̥ ǀ] [s̺ɛ̝m t̪ʰɪːl.pɪ.ð̠˕ʏr kʋʏːð̠˕ s̺ɪnː ɔ̝ɣ̞ t̪ei̯ːr̥ ‖] [ou̯ː kʋʏːð̠˕ ǀ ou̯ː kʋʏːð̠˕ ‖ ʋjɛ̝ːr fœ̽t̪.lʏm främ] [ɔ̝ɣ̞ fou̯rt̪.nʏ̈m θ̠jɛ̝ːr prɛ̝n.nän.t̪ɪ ǀ prɛ̝n.nän.t̪ɪ s̺ɑu̯ːɬ ǀ] [kʋʏːð̠˕ fäː.ð̠˕ɪr ǀ ʋɔ̝ːr t̪rɔ̝ʰ.t̪ɪnː frɑu̯ cɪː.nɪ t̪ʰɪl cɪns̺ ǀ] [ɔ̝ɣ̞ ʋjɛ̝ːr kʰʋœ̝ː.kʏ̈m ʋɔ̝r̥t̪ hɛ̝l.käs̺.t̪ä mɑu̯ːɬ ‖] [ʋjɛ̝ːr kʰʋœ̝ː.kʏ̈m ɔ̝ɣ̞ θ̠œ̽ʰ.kʏ̈m iː θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ǀ] [θ̠ʋiː θ̠uː ɛ̝r̥t̪ ʋɔ̝r̥t̪ ei̯ː.näs̺.t̪ä s̺cou̯ːɬ ‖] [ʋjɛ̝ːr̥ kʰʋœ̝ː.kʏ̈m ɔ̝ɣ̞ θ̠œ̽ʰ.kʏ̈m mɛ̝ð̠˕ t̪ʰɪːt̪.rän.t̪ɪ t̪ʰɑu̯ːr̥ ǀ] [θ̠ʋiː θ̠uː t̪ʰɪl.pjou̯s̺t̪ ʋɔ̝r̥t̪ fɔ̝r.lä.ɣ̞ä.çou̯ːɬ ‖] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ǀ] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ‖] [ʋɔ̝ː.rʏ̈ mɔ̝r.kʏ̈n.s̺ɪns̺ huːm.kʰœ̽l.t̪ʏ̈ r̥ɪn.jän.t̪ɪ t̪ʰɑu̯ːr̥ ǀ] [s̺ɛ̝m hɪʰt̪.nä ʋɪð̠˕ s̺ciː.nän.t̪ɪ s̺ou̯ːɬ ‖] [ou̯ː ǀ kʋʏːð̠˕ ʋɔ̝r̥s̺ läns̺ ‖ ou̯ː ǀ läns̺ ʋɔ̝r̥s̺ kʋʏːð̠˕ ‖] [ʋjɛ̝ːr lɪː.ʋʏ̈m s̺ɛ̝m pläx.t̪än.t̪ɪ ǀ pläx.tän.tɪ s̺t̪rɑu̯ː ‖] [ʋjɛ̝ːr t̪ei̯ː.jʏ̈m ǀ ɛ̝ʋ θ̠uː ɛ̝r̥t̪ eiː ljou̯ːs̺ θ̠äːð̠˕ ɔ̝ɣ̞ liːf ǀ] [s̺ɛ̝m äð̠˕ lɪf.tɪr ɔ̝s̺ː t̪ʏ̈f.t̪ɪ.nʏ̈ frɑu̯ː ‖] [ou̯ː ǀ vɛ̝r̥t̪ θ̠uː kʰʋɛ̝rt̪n̥ mɔ̝r.kʏ̈n ʋɔ̝r̥t ljuː.ʋäs̺.t̪ä liːf ǀ] [ʋɔ̝ːr lei̯ð̠˕.t̪ɔ̝.jɪ‿iː t̪äː.ɣ̞än.nä θ̠rœ̽y̯ːt̪] [ɔ̝ɣ̞ au̯ kʰʋœ̽l.t̪ɪn ʋɔ̝ːr hɪm.nɛ̝s̺.kä kʰʋilt̪ ɔ̝ɣ̞ ʋɔ̝ːr ɬiːf] [ɔ̝ɣ̞ ʋɔ̝ːr hɛ̝r̥.t̪ɔ̝.jɪ‿ɑu̯ θ̠jou̯ð̠˕.lif.s̺ɪns̺ prœ̽y̯ːt̪ ‖] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ǀ] [is̺t̪.läns̺ θ̠uː.s̺ʏ̈nt̪ ɑu̯ːr̥ ‖] [ʋɛ̝r.ð̠˕ɪ krou̯ː.än.t̪ɪ θ̠jou̯ð̠˕.lif mɛ̝ð̠˕ θ̠ʋɛ̝r.rän.t̪ɪ t̪ʰɑu̯ːr̥ ǀ] [s̺ɛ̝m θ̠rɔ̝s̺.käs̺t̪ ɑu̯ kʋʏːð̠˕.ri.cɪs̺ prœ̽y̯ːt̪ ‖] Our country's God! Our country's God! We worship Thy name in its wonder sublime. The suns of the heavens are set in Thy crown By Thy legions, the ages of time! With Thee is each day as a thousand years, Each thousand of years, but a day, Eternity's flow'r, with its homage of tears, That reverently passes away. Iceland's thousand years, Iceland's thousand years! Eternity's flow'r, with its homage of tears, That reverently passes away. Our God, our God, we bow to Thee, Our spirits most fervent we place in thy care. Lord, God of our fathers from age unto age, We are breathing our holiest prayer. We pray and we thank Thee a thousand years For safely protected we stand; We pray and we bring Thee our homage of tears Our destiny rest in Thy hand. Iceland’s thousand years, Iceland's thousand years! The hoarfrost of morning which tinted those years, Thy sun rising high, shall command! Our country’s God! Our country’s God! Our life is a feeble and quivering reed; We perish, deprived of Thy spirit and light To redeem and uphold in our need. Inspire us at morn with Thy courage and love, And lead through the days of our strife! At evening send peace from Thy heaven above, And safeguard our nation through life. Iceland’s thousand years, Iceland's thousand years! O, prosper our people, diminish our tears And guide, in Thy wisdom, through life! ==Controversies== This anthem has been criticized for being outdated and at times \"unsingable.\" It's often thought to be difficult to sing due to having vocal range of high and low registers.Things you never knew about national anthems (2010-03-04). Taylor, Lesley Ciarula. Toronto Star. Not only that, it has too many mentions to religion, despite the country becoming less religious. (As such, the national anthem of Iceland can be considered a religious hymn.) It has been suggested that the anthem be replaced with a more modern, less religious anthem.Go Iceland! (2016-07-01). Silk, Mark. The Gazette. Colorado Springs. Religion News Service.The Un-Singable National Anthem of Iceland (2011-01-11). Hauptmann, Katharina. Iceland Review. == References == == Other websites == * The Icelandic National Anthem * Audio of the national anthem of Iceland, with information and lyrics Category:National symbols of Iceland Category:European anthems",
 "title": "Lofsöngur"
}