{
 "id": "516888",
 "text": "Cape Fear is a 1991 American psychological thriller movie. It was directed by Martin Scorsese and it was produced by Barbara De Fina. Cape Fear was released on November 13, 1991. It is adapted from the John D. MacDonald novel The Executioners. It is a remake of the 1962 movie directed by J. Lee Thompson. The movie is about an attorney who is stalked along with his family by a vengeful criminal he had defended in court against rape charges, but was sent to jail for eight years. ==Reviews== The movie got positive reviews from critics. It has a 76% rating on Rotten Tomatoes. Movie critic Roger Ebert of the Chicago Sun-Times gave the movie 3 out of 4 stars and said that he liked the \"Cape Fear is impressive moviemaking, showing Scorsese as a master of a traditional Hollywood genre who is able to mold it to his own themes and obsessions. But as I look at this $35 million movie with big stars, special effects and production values, I wonder whether it represents a good omen from the finest director now at work.\" ==Awards== At the 64th Academy Awards, Robert De Niro was nominated in the category of Best Actor and Juliette Lewis was nominated in the category of Best Supporting Actress but neither of them won. At the 49th Golden Globe Awards, De Niro was nominated for Best Actor – Drama and Lewis was nominated for Best Supporting Actress – Motion Picture. == Cast == *Robert De Niro as Max Cady *Nick Nolte as Sam Bowden *Jessica Lange as Leigh Bowden *Juliette Lewis as Danielle Bowden *Joe Don Baker as Claude Kersek *Robert Mitchum as Lt. Elgart *Gregory Peck as Lee Heller *Illeana Douglas as Lori Davis *Fred Dalton Thompson as Tom Broadbent *Zully Montero as Graciella *Martin Balsam as Judge *Charles Scorsese as Fruitstand Customer ==References== ==Other websites== * Category:1991 crime thriller movies Category:1990s legal movies Category:American crime thriller movies Category:American legal movies Category:American movie remakes Category:Antisocial personality disorder in fiction Category:1990s English- language movies Category:Movies about lawyers Category:Movies about murderers Category:Movies about revenge Category:Movies about stalking Category:Movies based on books Category:Movies directed by Martin Scorsese Category:Rape in movies Category:Universal Pictures movies Category:Movies set in North Carolina",
 "title": "Cape Fear (1991 movie)"
}