{
 "id": "516887",
 "text": "Vance DeBar \"Pinto\" Colvig (September 11, 1892 - October 3, 1967) was an American actor, voice actor, newspaper cartoonist, circus performer, vaudeville performer, animator, and writer. He was best known as the original Bozo the Clown. He was the voice of Disney's Goofy. In 1993 he was honored with a Disney Legends award. == Life and career == Colvig was born in 1892 in Jacksonville, Oregon. His parents were Addie and William Colvig. His father was the Jackson County attorney. He was the youngest of seven children. He was nicknamed \"Pinto\" because of all his freckles. Colvig grew up in Jacksonville and nearby Medford. He spend a good deal of time mimicking the sounds he heard all around him. He could mimic the sound of farm animals, a rusty gate and noises from around the village. He studied art at Oregon Agricultural College (OAC) (later Oregon State University) in Corvallis, Oregon. in 1916 he married Margaret Slaven. They moved to San Francisco where Colvig worked as a cartoonist for the San Francisco Bulletin and the San Francisco Chronicle. === Silent films === In the 1920s Colvig began working in Hollywood in silent movies.Margaret LaPlante, Jacksonville (Charleston, SC: Arcadia Publishing, 2010), p. 119 He was a comedy writer and played bit parts for Mack Sennett. He then moved to the Disney studios where he became one of their top artists. === Talking pictures === When movies changed to sound he began doing voices for characters. He is also known for his Disney work as the voice of Goofy from 1932 until his death in 1967. He was the voice of Bluto in Popeye cartoons. He was Grumpy and Sleepy in Snow White and the Seven Dwarfs. In The Three Little Pigs he was the voice of the Practical Pig. He was also the co-writer of the song \"Who's Afraid of the Big Bad Wolf?\" in the same movie. === Sound artist === From the 1920s he provided sound effects on programs such as the Jack Benny Program and Amos 'n' Andy. He invented most of his own sound effects. He was known for making a funny line even funnier. Colvig is a legend among foley sound technicians. === Bozo the clown === As a teenager Colvig ran away to join the circus. He eventually performed as a circus clown. In 1946 he was hired by Capitol Records to work on the world's first read-along book “Bozo at the Circus.” The book and record were a tremendous success and there were demands by children to see Bozo. Drawing on his circus background, Colvig created a clown character to match the books and records. Station KTTV in Los Angeles created a television series for Bozo the clown starring Pinto Colvig. After Bozo, Colvig returned to doing voice work. ==Death== Colvig died of lung cancer on October 3, 1967, in Woodland Hills, California. He was 75 years old. ==Filmography== Year Title Role Notes 1925 Hey Fever Time After a Reputation Buster be Good Oh! Buster! The Butler Buster's Nightmare 1928 The Cockeyed Family Orange Farmer (uncredited) 1930 Spooks Hippo (voice, uncredited) Henpecked Oswald the Lucky Rabbit (voice, uncredited) The Chain Gang Hounds (voice, uncredited) Snappy Salesman Oswald the Lucky Rabbit (voice, uncredited) Cold Feet Oswald the Lucky Rabbit (voice, uncredited) The Navy Oswald the Lucky Rabbit (voice, uncredited) Africa Oswald the Lucky Rabbit (voice, uncredited) Alaska Oswald the Lucky Rabbit (voice, uncredited) 1931 What a Doctor Oswald the Lucky Rabbit (voice, uncredited) The Moose Hunt Pluto (voice) Mickey Steps Out Pluto (voice) Mickey's Orphans Pluto (voice, uncredited) 1932 The Duck Hunt Pluto (voice, uncredited) The Mad Dog Pluto (voice, uncredited) Barnyard Olympics Pluto (voice, uncredited) Mickey's Revue Dippy Dog, Pluto (voice, uncredited) Just Dogs Pluto (voice, uncredited) Mickey's Nightmare Pluto (voice) Trader Mickey Pluto (voice, uncredited) The Whoopee Party Goofy (voice, uncredited) Touchdown Mickey Goofy (voice, uncredited) 1933 Building a Building Pegleg Pete (voice, uncredited) The Mad Doctor Pluto (voice, uncredited) Mickey's Pal Pluto Pluto (voice, uncredited) Mickey's Mellerdrammer Goofy (voice, uncredited) Ye Olden Days Goofy (voice, uncredited) The Three Little Pigs Practical Pig (voice, uncredited) I Like Mountain Music Yodeler, various (voice, uncredited) The Steeplechase Colonel (voice, uncredited) 1934 The Grasshopper and the Ants Grasshopper (voice, uncredited) Playful Pluto Pluto (voice, uncredited) Big Bad Wolf Practical Pig (voice, uncredited) The Wise Little Hen Peter Pig (voice, uncredited) Orphan's Benefit Goofy (voice, uncredited) Servants' Entrance Mustard Pot (uncredited) 1935 Mickey's Service Station Goofy (voice, uncredited) The Cookie Carnival Cookie Boy (voice, uncredited) Mickey's Garden Pluto, Grasshopper (voice, uncredited) Mickey's Fire Brigade Goofy (voice, uncredited) Pluto's Judgement Day Pluto (voice, uncredited) On Ice Goofy, Pluto (voice, uncredited) Broken Toys W.C. Fields Doll, Various (voice, uncredited) 1936 Mickey's Grand Opera Goofy (voice, uncredited) Three Little Wolves Practical Pig (voice, uncredited) Moving Day Goofy (voice, uncredited) Mickey's Rival Mortimer Mouse (voice) Alpine Climbers Pluto (voice, uncredited) Donald and Pluto Pluto (voice, uncredited) Three Blind Musketeers Tall thin mouseketeer (voice, uncredited) Donald and Pluto Pluto (voice, uncredited) Mother Pluto Pluto (voice, uncredited) ==References== Category:1892 births Category:1967 deaths Category:Actors from Oregon Category:American voice actors Category:Cancer deaths in Los Angeles Category:Deaths from lung cancer Category:Vaudeville performers Category:Comedians from Oregon",
 "title": "Pinto Colvig"
}