{
 "id": "51715",
 "text": "Tilia is a genus of about 30 species of trees in the Northern Hemisphere, in Asia (where the greatest species diversity is found), Europe and eastern North America; it is absent from western North America. The trees are generally called linden in North America, and lime in Britain. Both names are from the Germanic root lind. The modern forms in English went from linde or linne in Anglo Saxon and old Norse, and in Britain the word transformed more recently to the modern British form lime. In the United States, the modern German name Linde, from the same root, became more common, partly to avoid confusion with any other uses of the name. Tilia species are large deciduous trees, reaching typically between 20m and 40m tall, some species grow as shrubs. Plants of this genus are found through the north temperate regions. ==History== The Germanic tribes associated the Linden tree with the goddess Freya. Very often, these tribes held their assemblies, called Thing near or under such a tree. Often, trees that were standing alone somewhere were chosen. These assemblies were used to make laws. They usually lasted three days. ==Species== * Tilia americana * Tilia amurensis * Tilia begoniifolia * Tilia caroliniana * Tilia chinensis * Tilia chingiana * Tilia cordata * Tilia dasystyla * Tilia henryana * Tilia heterophylla * Tilia hupehensis * Tilia insularis * Tilia intonsa * Tilia japonica * Tilia kiusiana * Tilia mandshurica * Tilia maximowicziana * Tilia mexicana * Tilia miqueliana * Tilia mongolica * Tilia nasczokinii * Tilia nobilis * Tilia occidentalis * Tilia oliveri * Tilia paucicostata * Tilia platyphyllos * Tilia rubra * Tilia tomentosa * Tilia tuan ===Hybrids and cultivars=== *Tilia × euchlora (T. dasystyla × T. cordata) *Tilia × europaea Common Lime (T. cordata × T. platyphyllos; syn. T. × vulgaris) *Tilia × petiolaris (T. tomentosa × T. ?) *Tilia 'Flavescens' (T. americana × T. cordata) *Tilia 'Moltkei' (hybrid, unknown origin) *Tilia 'Orbicularis' (hybrid, unknown origin) *Tilia 'Spectabilis' (hybrid, unknown origin) ==Uses== The tree produces fragrant and nectar-producing flowers, the medicinal herb lime blossom. They are very important honey plants for beekeepers, producing a very pale but richly flavoured monofloral honey. The flowers are also used for herbal tea, and this infusion is particularly popular in Europe. == Other websites == * GRIN: Tilia Category:Trees Category:Malvaceae",
 "title": "Tilia"
}