{
 "id": "517158",
 "text": "Co-education is the education of males and females in the same schools. The practice has been different in different countries and at different times. Most primary schools have been co-educational for a long time since it was believed that there is no reason to educate females separately from males before the age of puberty. Also, the curriculum in primary schools is not controversial since it emphasizes reading, writing, and arithmetic, with some elementary knowledge of geography and history. In some countries, it includes some religious and cultural education. However, before the mid-19th century, girls were often educated at home or not educated at all. On that point, there were great differences in different parts of the world. In England and Wales, universal primary education was set up by the Elementary Education Act of 1870, and attendance from the ages of 5 to 10 was compulsory. That was extended in another Act of 1880. Since then. almost all primary education in the United Kingdom has been co-educational, as it is in many other countries. With secondary education, children go through the process of puberty, and there is no general agreement as to whether both sexes should be educated together. People make arguments both for and against the idea.Gurian, Michael 2001. Boys and girls learn differently! Jossey-Bass. At one extreme is the United States in which both sexes are usually educated together at all stages. At the other extreme are certain traditional societies in which girls do not get a secondary education at all. The tendency has been for more countries to move to co-education as the standard at every level of education.Goodman, Joyce; James C. Albisetti J.C. & and Rogers R. (eds) 2010. Girls' secondary education in the western world: from the 18th to the 20th century. Palgrave Macmillan. An exception would be the Islamic world, where girls are educated separately from boys or even not educated at all.Alkanderi, Latefah 2001. Exploring Education in Islam: Al-Ghazali's model of the master-pupil relationship applied to educational relationships within the Islamic family. Pennsylvania State University. The world's oldest co-educational school may be Archbishop Tenison's Church of England High School, Croydon. It was established in 1714 in what in Surrey but is now in South London. It has admitted both boys and girls since its opening. It has always been a day school only and is thought that to be the oldest surviving mixed-sex school in the world. == References == == Related pages == *Gender equality Category:Education",
 "title": "Co-education"
}