{
 "id": "51748",
 "text": "The Amish are a group of people who live according to the Anabaptist tradition. They have a common history with other Baptist movements, such as the Mennonites. The Amish are known for dressing plainly and living simply, without many conveniences of modern technology. == History == The Amish church began in 1693 with a schism in Switzerland within a group of Swiss and Alsatian Anabaptists led by Jakob Ammann. Ammann's followers became known as Amish. In the second half of the 19th century, the Amish divided into Old Order Amish and Amish Mennonites. During the 20th century, the Amish Mennonites assimilated into mainstream society, and accepted several of the conveniences modern technology has to offer. The Old Order Amish, on the other hand, kept much of their traditional culture. When people speak of Amish today, they usually mean the Old Order Amish. There were other, smaller splits as well. At the end of the 20th century, there were about 18 bigger groups of Amish. Many of them emigrated to the United States. Today, most Amish live in Pennsylvania (Lancaster County), Indiana and Ohio, in the United States. In Lancaster County, almost 25 percent of the Amish have the name Stoltzfus (or Stoltzfoos). Other common Amish names are Byler, Fisher, Petersheim, Lapp and King. In LaGrange, Indiana, most are named Borntrager, Miller or Schrock. In Adams County, Indiana, the names Graber, Grabill/Kraybill and Schwartz are common. == Lifestyle == Many Amish people prefer simple lifestyles. They are usually farmers living in rural Amish communities. While their communities are separate from mainstream American society, Amish often live alongside non- Amish (\"English\") people. Many groups, particularly Old Order Amish, forbid car ownership. From their perspective, owning a car is a way to stand out from the community, and the automatic mobility that cars provide weakens the sense of belonging together. However, riding in cars is not forbidden. In areas where there are many Amish, there are taxi services which will drive Amish people around. Many Amish settlements are not connected to any electricity network. When they need electricity, they usually produce it themselves, often with diesel-powered engines. Many Amish groups do not allow posing for photographs, because doing so makes a person stand out from others and is not humble. Often Amish people will turn their head down and to the side if someone aims a camera in their direction. They are usually less strict about an Amish person appearing on a photograph if they are not the subject of the picture. Married men are not allowed to shave their beards or to have moustaches. Only unmarried men shave their faces. The movie Witness, starring Harrison Ford and Kelly McGillis, includes Amish characters. == Education and language == Many Amish people who emigrated to the United States kept their language: a dialect of German called Pennsylvania German or Pennsylvania Dutch. As of 2012, there were between 350.000 and 420.000 speakers of Pennsylvania German in the United States. Before the Second World War, Pennsylvania German was much more common and had around 800.000 speakers. However, during the war, people frowned upon German speakers, so many speakers did not teach the language to their children. Only conservative Baptists, such as Amish and Mennonites, withstood the pressure and still taught the language to their children. After the Second World War, the Amish started to run their own schools, where they teach their children, how to read, write, and calculate. Very often, they also learn German so they can read religious texts. Amish schools do not teach biology or other natural sciences. ==Related pages== *Amish friendship bread == References == == Bibliography == * . * Kraybill, Donald B., Karen M. Johnson-Weiner, and Steven M. Nolt, The Amish (Johns Hopkins University Press, 2013), 500 pp. * . * . * . * . * Mackall, Joe: Plain Secrets: An Outsider among the Amish, Boston, Mass. 2007. * . * . Category:Anabaptism Category:Ethnic groups in the United States Category:Ohio Category:Pennsylvania Category:Simple living",
 "title": "Amish"
}