{
 "id": "517613",
 "text": "Elimination Chamber (2015) (also known as No Escape (2015) in Germany) was a professional wrestling pay-per-view show made by WWE. It took place on May 31, 2015 at American Bank Center in Corpus Christi, Texas. It was the sixth Elimination Chamber event held by WWE. 20,000 fans bought tickets for the event. The main event saw Dean Ambrose defeat WWE World Heavyweight Champion Seth Rollins by disqualification. This was also the first event to have a tag team Elimination Chamber match. In the match, The New Day kept their WWE Tag Team Championship. ==Matches== No. Results Stipulations Times 1P Stardust defeated Zack Ryder Singles match 6:12 2 The New Day (Big E, Kofi Kingston and Xavier Woods) (c) defeated The Lucha Dragons (Kalisto and Sin Cara), Tyson Kidd and Cesaro (with Natalya), The Prime Time Players (Darren Young and Titus O'Neil), The Ascension (Konnor and Viktor) and Los Matadores (Diego and Fernando) (with El Torito) Tag team Elimination Chamber match for the WWE Tag Team Championship 23:40 3 Nikki Bella (c) defeated Paige and Naomi Triple Threat match for the WWE Divas Championship Brie Bella and Tamina were banned from the match. 6:04 4 Kevin Owens (NXT Champion) defeated John Cena (United States Champion) Non-title Champion vs Champion match 19:57 5 Neville defeated Bo Dallas Singles match 8:54 6 Ryback defeated Sheamus, R-Truth, King Barrett, Dolph Ziggler and Mark Henry Elimination Chamber match for the vacant WWE Intercontinental Championship 25:12 7 Dean Ambrose defeated Seth Rollins (c) (with Jamie Noble, Joey Mercury and Kane) by disqualification Singles match for the WWE World Heavyweight Championship 21:49 (c) – is the champion(s) going into the match P – This match took place on the pre-show === Tag Team Championship Elimination Chamber details === Eliminated Wrestler (Team) Entered Eliminated by Method Time Diego (Los Matadores) 4 Konnor and Viktor (The Ascension) Pinfall 10:22 Kalisto (The Lucha Dragons) 2 11:20 Viktor (The Ascension) 1 Darren Young (The Prime Time Players) 13:30 Cesaro (Tyson Kidd and Cesaro) 3 18:28 Titus O'Neil (The Prime Time Players) 5 Big E, Kofi Kingston, and Xavier Woods (The New Day) 23:40 Big E, Kofi Kingston, and Xavier Woods (The New Day) (c) 6 === Intercontinental Championship Elimination Chamber details === Eliminated Wrestler Entered Eliminated by Method Times King Barrett 1 R-Truth Pinfall 11:05 R-Truth 3 Ryback 14:00 Mark Henry 4 Sheamus 17:20 Dolph Ziggler 2 20:25 Sheamus 6 Ryback 25:12 Ryback 5 == References == ==Other websites== *Official Elimination Chamber 2015 website Category:2015 in professional wrestling Category:2015 in the United States Category:Corpus Christi, Texas Category:Elimination Chamber Category:2010s in Texas Category:May 2015 events",
 "title": "Elimination Chamber (2015)"
}