{
 "id": "517658",
 "text": "Tomas Robert Lindahl FRS FMedSci (born 28January 1938) is a Swedish scientist specialising in cancer research. In 2015, he was awarded the Nobel Prize in Chemistry jointly with American chemist Paul Modrich and Turkish chemist Aziz Sancar for mechanistic studies of DNA repair. Lindahl was professor of medical chemistry at the University of Gothenburg 1978-82. He moved to England and joined the Imperial Cancer Research Fund (now Cancer Research UK) as a researcher in 1981. From 1986 he was the first Director of Cancer Research UK's Clare Hall research institute in Hertfordshire. Since 2015 this has been part of the Francis Crick Institute.\"4 ways that Tomas Lindahl’s Nobel Prize for Chemistry revolutionised cancer research\" , by Emma Smith, CRUK Science blog, October 7, 2015 When the Royal Society elected him as a Fellow, his achievements were extraordinary (though rather technical): :\"Dr. Tomas Lindahl is noted for his contributions to the comprehension of DNA repair at the molecular level in bacterial and mammalian cells. He was the first to isolate a mammalian DNA ligase and to describe a totally unanticipated novel group of DNA glycosylases as mediators of DNA excision repair. He has also discovered a unique class of enzymes in mammalian cells, namely the methyltransferases, which mediate the adaptive response to alkylation of DNA and has shown that the expression of these enzymes is regulated by the ada gene... Apart from providing profound insights into the nature of the DNA repair process his very important contributions promise to facilitate the design of more selective chemotherapeutic drugs for the treatment of cancer. Lindahl has also made a number of significant contributions to understanding at the DNA level the mechanism of transformation of B-lymphocytes by the Epstein-Barr virus. The most notable of these was the first description of the occurrence in lymphoid cells of closed circular duplex viral DNA\". He was elected a member of the Academia Europaea in 1989. == References == Category:1938 births Category:Living people Category:Swedish Nobel Prize winners Category:Scientists from Stockholm Category:Members of Academia Europaea",
 "title": "Tomas Lindahl"
}