{
 "id": "517998",
 "text": "The United States House of Representatives was a scheduled election for Speaker of the House for October 29, 2015, during the 114th U.S. Congress. The election was caused by the announcement of Speaker John Boehner's resignation, set for October 30. The Speaker of the House follows the Vice President in line of succession to the presidency of the United States in accordance with the Presidential Succession Act. Paul Ryan was elected speaker and took office on October 29, 2015. ==Background== Kevin McCarthy, the House Majority Leader and second-in-command to the Speaker, was initially viewed as the front runner to win the Speakership. However, due to the opposition of the Freedom Caucus, McCarthy dropped out of the race on October 8, and the caucus vote was postponed. Paul Ryan and Daniel Webster of the Republican Party and Nancy Pelosi of the Democratic Party remain declared candidates. ==Candidates== ===Declared=== These are the official declared candidates: * Nancy Pelosi, (Democratic Party), Minority Leader of the United States House of Representatives (since 2011; 2003–2007), United States representative for (since 2013), and Speaker of the United States House of Representatives (2007–2011). * Paul Ryan, (Republican Party), United States representative for (since 1999), Chairman of the Ways and Means Committee (since 2015), Republican Party nominee for Vice President of the United States in the 2012 election. * Daniel Webster, (Republican Party), United States representative for (since 2013). File:Nancy_Pelosi 113th Congress 2013.jpg|Minority Leader Nancy Pelosi of California File:Paul Ryan, official portrait, 111th Congress.jpg|Representative Paul Ryan of Wisconsin File:Daniel_Webster 113th_Congress.jpg|Representative Daniel Webster of Florida === Publicly expressed interest === The following potential candidates has expressed interest in running for speaker within the past month: * Darrell Issa, (Republican Party), United States representative for (since 2003), Chairman of the House Oversight Committee (2011–2015). * Michael McCaul, (Republican Party), United States representative for (since 2005), Chairman of the House Homeland Security Committee (since 2013). * Lynn Westmoreland, (Republican Party), United States representative for (since 2007). * Ryan Zinke, (Republican Party), United States representative for Montana's at-large congressional district (since 2015). File:Darrell Issa 113th Congress.jpg|Representative Darrell Issa of California File:Michael T. McCaul 113th Congress.jpg|Representative Michael McCaul of Texas File:Lynn Westmoreland 113th Congress.jpg|Representative Lynn Westmoreland of Georgia File:Ryan Zinke.jpg|Representative Ryan Zinke of Montana === Potential candidates=== The following received speculation about a possible candidacy in at least two reliable sources: * Diane Black, (Republican Party), United States representative for (since 2011). * Marsha Blackburn, (Republican Party), United States representative for (since 2003). * Mike Conaway, (Republican Party), United States representative for (since 2005). * Newt Gingrich, (Republican Party), Speaker of the United States House of Representatives (1995–1999), House Minority Whip (1989–1995), United States representative for (1979–1999). * Mike Kelly, (Republican Party), United States representative for (since 2011). * John Kline, (Republican Party), United States representative for (since 2003), Chairman of the House Education Committee (since 2011). * Mike Pompeo, (Republican Party), United States representative for (since 2011). * Peter Roskam, (Republican Party), United States representative for (since 2007). File:Diane Black 113th Congress.jpg|Representative Diane Black of Tennessee File:Marsha Blackburn 8.jpg|Representative Marsha Blackburn of Tennessee File:Kenneth Michael Conaway 113th Congress.jpg|Representative Mike Conaway of Texas File:Newt Gingrich (6238567189) (cropped).jpg|Fmr. Speaker Newt Gingrich of Georgia File:Mike Kelly 113th Congress.jpg|Representative Mike Kelly of Pennsylvania File:Johnkline.jpg|Representative John Kline of Minnesota File:Mike Pompeo 113th Congress.jpg|Representative Mike Pompeo of Kansas File:Peter J. Roskam 113th Congress.jpg|Representative Peter Roskam of Illinois ===Withdrawn=== The following individual did initially run for the position, but withdrew some time later: * Jason Chaffetz, (Republican Party), United States representative for (since 2008), Chairman of the United States House Committee on Oversight and Government Reform (since 2015) (Withdrew on October 20, 2015; endorsed Paul Ryan). * Bill Flores, (Republican Party), United States representative for since 2011. (Withdrew on October 22, 2015; endorsed Paul Ryan). * Kevin McCarthy (Republican Party), United States representative for (since 2013), Majority Leader of the United States House of Representatives (since 2014). (Withdrew on October 8, 2015). File:Jason Chaffetz 113th Congress.jpg|Representative Jason Chaffetz of Utah File:Bill Flores 113th Congress.jpg|Representative Bill Flores of Texas File:Kevin McCarthy 113th Congress.jpg|Majority Leader Kevin McCarthy of California ===Declined to run=== The following noteworthy individuals received some speculation to a possible run, but ultimately ruled themselves out: *Trey Gowdy (Republican Party), United States representative for (since 2011), Chairman of the House Benghazi Committee (since 2014) (Endorsed Paul Ryan). *Jeb Hensarling (Republican Party), United States representative for (since 2003), Chairman of the House Committee on Financial Services (since 2013). *Cathy McMorris Rodgers (Republican Party), United States representative for (since 2005), Chairman of the House Republican Conference (since 2013). *Steve Scalise (Republican Party), United States representative for (since 2008), Majority Whip of the United States House of Representatives (since 2014) (Endorsed Paul Ryan). ==References== Category:2015 elections in North America Category:2015 in the United States Category:2010s elections in the United States Category:October 2015 events",
 "title": "October 2015 Speaker of the United States House of Representatives election"
}