{
 "id": "51826",
 "text": "Harald Sigurdsson (; – 25 September 1066) was also known as Harald of Norway and as Hardrada (, Modern Norwegian: , \"stern counsel\" or \"hard ruler\") in the sagas.\"Det store norske leksikon\" (The Great Norwegian Encyclopedia) Harald was King of Norway (as Harald III) from 1046 to 1066. Also, he unsuccessfully claimed the Danish throne until 1064 and the English throne in 1066. Before becoming king, Harald had spent about fifteen years in exile as a mercenary and military commander in Kievan Rus' and in the Varangian Guard in the Byzantine Empire. When he was fifteen years old, in 1030, Harald fought with his half-brother Olaf against Cnut (Canute). Olaf sought to reclaim the Norwegian throne, which he had lost two years earlier to Danish King Canute. In the battle, Olaf and Harald were defeated by forces loyal to Canute. Harald was forced into exile to Kievan Rus'. After some time in the army of Grand Prince Yaroslav the Wise, Harald moved on to Constantinople with his companions around 1034.There, he commanded the Byzantine Varangian Guard. Harald became wealthy during his time in the Byzantine Empire. He shipped the money to Yaroslav in Kievan Rus' for safekeeping. He finally left the Byzantines in 1042 and returned to Kievan Rus' to prepare his campaign to reclaim the Norwegian throne. In his absence, Olaf's illegitimate son Magnus the Good had taken the throne and become king of Denmark. In 1046, Harald joined forces with Magnus's rival in Denmark, the pretender Sweyn II of Denmark, and started raiding the Danish coast. Magnus, unwilling to fight his uncle, agreed to share the kingship with Harald, who would in turn share his wealth. The co-rule ended abruptly the next year, when Magnus died, and so Harald became the sole ruler of Norway. Domestically, Harald crushed all opposition and outlined the union of Norway under a national rule. Harald's reign was probably one of relative peace and stability, and he set up a viable coin economy and foreign trade. Probably seeking to restore Canute's North Sea Empire, Harald also claimed the Danish throne and spent nearly every year until 1064 by raiding the Danish coast and fighting his former ally, Sweyn. Although the campaigns were successful, he was never able to conquer Denmark. Not long after Harald had renounced his claim to Denmark, the former Earl of Northumbria, Tostig Godwinson, the brother of the English king, Harold Godwinson, pledged his allegiance to Harald and invited him to claim the English throne.Stenton, F. M. (1971). Anglo-Saxon England. Oxford History of England. II (3rd ed.). Oxford: Clarendon Press-Oxford University Press. ISBN 978-0-19-821716-9. Harald invaded northern England with 10,000 troops and 300 longships in September 1066 and raided the coast and defeated English regional forces of Northumbria and Mercia in the Battle of Fulford, near York.DeVries, Kelly 1999. The Norwegian invasion of England in 1066. Boydell & Brewer. ISBN 978-0-85115-763-4 Although initially successful, Harald was defeated and killed in an attack by Harold's forces at the Battle of Stamford Bridge, which wiped out almost all of entire army. Modern historians have often considered Harald's death, which brought an end to his invasion, as the end of the Viking Age. The famous Anglo-Saxon Chronicle records those events.Manuscript D of the Anglo-Saxon Chronicle ('Harold Harfagera', under the year 1066) and the related histories by Orderic Vitalis ('Harafagh', re events in 1066), John of Worcester ('Harvagra', s.aa. 1066 and 1098), and William of Malmesbury (Gesta regum Anglorum, 'Harvagre', regarding 1066). ==References== Category:1015 births Category:1066 deaths Category:Kings and Queens of Norway",
 "title": "Harald Hardrada"
}