{
 "id": "518685",
 "text": "Edward the Exile (17 January 1016 — 19 April 1057) also known as Edward the Atheling was the heir apparent to the Kingdom of England. He was the oldest child of King Edmund II of England and Ealdgyth. He spent most of his life in exile in Hungary following his father being killed at the Battle of Assandun during Cnut the Great's invasion of England in 1016. ==Life in exile== After the Danish conquest of England in 1016, Canute had Edward and his brother, Edmund, sent to the Swedish court of Olof Skötkonung. Edward was a baby at the time.John Cannon; Anne Hargreaves, The Kings and Queens of Britain (Oxford: Oxford University Press, 2009), p. 80 Canute's agents apparently had orders to have the children murdered. But they were quickly taken to Hungary where neither Canut or his agents could reach them.Frank Stenton, Anglo-Saxon England, Third Edition (Oxford; New York: Oxford University Press, 1971), p. 397 He was brought up at the Hungarian court. Edward married Agatha, a relative of Emperor Henry II. Edward the Confessor, King of England, had no children. Edward, his nephew, was his nearest living relative. The King wanted to make Edward his heir.Martin Collier, Changing Times 1066-1500 (Oxford: Heinemann, 2003), p. 20 In 1057, the king's messengers reached Edward living in Hungary.David Hughes, The British Chronicles, Volume 1 (Westminster, MD: Heritage Books, 2007), p. 299 Edward agreed to return to England and in 1057 arrived in London with his family. But a few days after their arrival Edward was killed. == Family == He and Agatha had three children, Edgar the Atheling, Margaret of Scotland and Cristina, Abbess of Romsey Abbey.Florence (of Worcester, The Anglo-Saxon Chronicle: The Chronicle of Florence of Worcester ([London: Seeleys, 1853), p. 121 In the summer of 1068 his son Edgar took his mother and sisters and escaped to Scotland.Frank Stenton, Anglo-Saxon England, Third Edition (Oxford; New York: Oxford University Press, 1971), p. 601 == Notes == == References == Category:1016 births Category:1050s deaths Category:Kings and Queens of England",
 "title": "Edward the Exile"
}