{
 "id": "51880",
 "text": "A pharmacist is a person who supplies drugs to people, often prescriptions from a doctor but sometimes on their own. Pharmacists have to be trained and have knowledge about the drugs package. Many work in a pharmacy.Pharmacists interact with customers, give the prescribed medication and telling them about the drugs. Some work in hospitals where they may deliver the drugs to the different parts of the hospital and give people the drugs they need to take home. Some work with general practitioners where they may check that people are getting the right drugs. Pharmacists is the one who checks the works of the pharmacy technician. Pharmacy Technician works under the supervise of the Pharmacists, Pharmacy Technician are the one who pulls out the medicines according to the prescription written and they are the one who counts the medicine, after they finish counting and putting it inside a container for medicines purpose only. Once the Pharmacy Technician finished counting the medicine and putting it inside a container then, the Pharmacist will check the medicine in the computer to make sure the medicine that is dispensed is correct. Pharmacists can also help with recommending over the counter medication like when someone has sore throats or a common cold they can recommend medications that anyone can buy with a prescription from the doctor. Pharmacists may also give vaccines, shots that protect you from diseases like the flu or shingles. During the COVID-19 pandemic, they helped with giving vaccines to those who did not want to go to the hospitals. Pharmacists can also help people taking a new medication by giving them instructions for the prescription. The pharmacist also helps by telling the patient the side effects of the new medication. Pharmacists help by calling the doctor if the patient has concerns about the new medication. In the COVID-19 pandemic in the United Kingdom many pharmacists were vaccinating people. They have also been doing Influenza vaccines for several years. There are plans for them to do more of this work. ==Related pages== * Pharmaconomist * Pharmacy * Pharmacologist ==References== Category:Healthcare occupations",
 "title": "Pharmacist"
}