{
 "id": "519037",
 "text": "Between 1519 and 1521, Spanish conquistadors, led by Hernán Cortés, overthrew the Aztec Empire. This event is called the Spanish conquest of the Aztec Empire. Cortés helped old enemies of the Aztecs defeat them in one of the most important events in the Spanish colonization of the Americas. The Spanish conquest was devastating to the Aztec people. By 1680, 94% of the Aztec population had died (due to diseases and viruses). ==End of the Empire== In 1515, two of the states in the Aztec Empire rebelled. This was nothing new for the Aztecs. However, this time, the Tlaxcala and Huexotzingo rebels beat the Aztec military. Then, in April 1519, Spanish conquistadors, led by Cortés, arrived on the coast of Mexico. In August they marched to Tenochtitlan, the capital of the Aztec Empire. At first, Montezuma II, the Aztecs' ruler, invited the Spanish into Tenochtitlan, and things were friendly. Even when the Spanish made Montezuma II a prisoner, the Aztecs stayed friendly. However, soon, while Cortés was away, Spanish soldiers attacked and killed many Aztecs during a festival. When Cortés got back, he got Montezuma II to tell the Aztecs to stop fighting the conquistadors. By this time, though, the Aztecs had made Montezuma II's brother, Cuauthemoc, the king. Nobody did what Montezuma II said. They kept fighting the conquistadors, and they killed two out of every three Spanish soldiers. In July 1520 the Spanish survivors fled to Tlaxcala, where enemies of the Aztecs protected them. Ten months later, Cortés came back to Tenochtitlan with more Spanish soldiers but mostly Tlaxcaltecas and other indigenous enemies of the Aztecs. They started a siege of Tenochtitlan, so that no food or supplies could get in. After 91 days, without any food, and with disease throughout the city, Cuauhtemoc finally surrendered to the Spanish on August 13, 1521. The Spanish destroyed Tenochtitlan. They started a Spanish colony that they named New Spain. The Aztec Empire had ended. ===Weapons=== There were many different reasons why the Spanish were able to take over the Aztec Empire. Different weapons were used through the battle to help Cortes overrule the aztecs. First, their weapons and armor were better than the Aztecs'. Aztec warriors had only cotton armour and shields made of wood or reeds to protect them. The Spanish had metal armor and shields. For weapons, Aztec warriors had a few choices: * Macuahuitl: A very sharp sword, with a point made of obsidian, which can be sharpened like glass. This sword could also be used as a club * Atlatl: A weapon used to throw spears or darts * Bows and arrows None of these weapons could compare to the conquistadors' guns and steel swords. Their horses and war dogs gave them even more of an advantage against the Aztecs. ===Religion=== As early as the 1520s, many writings have propagated the politically productive and widely repeated colonial narrative that the Aztecs and Montezuma II thought Hernán Cortés was the Aztec god Quetzalcoatl who had been prophesied to return. However, more recent scholarship has called into question the authenticity of this narrative. According to Encyclopedia Britannica: > Some 21st- century historians, however, questioned not only whether the > Aztecs thought Cortés was a god but whether the legend of Quetzalcóatl was > really a part of the Aztecs’ belief system. They suggested the well-known > version of this story was a Spanish creation that was subsequently > incorporated into Aztec lore. This reframing acknowledges the \"white gods\" story as \"a dehumanizing narrative that equates technological with intellectual and moral superiority\". ===Other causes=== Some historians say that the Spanish conquistadors were not the only reason the Aztec Empire fell apart. By 1519, the Empire had other problems that made it easier for Spain to take it over. For example: * More and more, nobles were being allowed to marry commoners. Their children automatically became nobles. This meant there were too many nobles and not enough commoners to do the everyday work in the Empire. Since the commoners were the ones that grew the food for the Empire, this meant there was not enough food for everyone. * The Aztec government had started to use terror to keep control over the land it had taken over. When the Spanish conquistadors got to Tenochtitlan, they said the Aztecs often held public ceremonies. They would invite the leaders of the states they took over to come. Then they would do many human sacrifices. The conquistadors said that the Empire sacrificed 20,000 people every year an average of 55 people a day. * The Aztec government was making the states they took over and regular people in Tenochtitlan pay more and more money in tributes (which were like taxes). * When Cortés and his conquistadors came to Tenochtitlan, they brought smallpox. This very contagious disease killed a huge number of Aztecs. Cortes wanted to conquer the aztecs for gold,glory and God. Because of these things, many people in the Aztec Empire were unhappy. Some of them helped the Spanish conquistadors take over the Empire. Some historians, like Brian Fagan and Nadia Durrani, say that the Empire would have fallen apart even if the Spanish had never come. However, because so many people had died of smallpox, there were also not enough people left to fight against the conquistadors when they did come. File:Cortez & La Malinche.jpg|Aztec drawing of Cortés's first meeting with Motecuhzoma II File:Matanza templo2.jpg|Aztec drawing of the Spanish massacring them in the Great Temple File:Antoni Gómez i Cros - Hernan Cortés lluita amb dos indis - 876.jpg|Spanish painting of Cortés killing Aztecs File:ROHM D237 Conquistadors exhort their supporters.jpg|Conquistadors' metal armor, better weapons, and horses helped them beat the Aztecs File:LastDaysofTenochtitlanB.jpg|\"The Last Days of Tenochtitlan\" (1899 painting) File:Tlaxcala - Palacio de Gobierno - Brennende Tempel.jpg|Painting of Aztec temples burning after the Spanish took over ==After the Empire== Under Spanish control, the Aztec Empire did not exist any more. The Spanish tried to change the Aztecs into Catholics and make them act like Spanish people.Schwaller, John F. (July 24, 2013). Post-Conquest Aztecs. (Oxford Bibliographies): Latin American Studies. . Accessed July 17, 2016. They made it easier to change from Aztec rule to Spanish rule by letting many Aztec nobles become Spanish nobles.Lockhart, James (1991). Nahuas and Spaniards: Postconquest Central Mexican History and Philology. Stanford: Stanford University Press. p. 40. . The conquistadors rewarded people who had helped them defeat the Aztecs. Many received an Encomienda, a village full of Aztecs who were forced to work for them. This was not much different from what many serfs had done during the Aztec Empire. However, workers were badly abused, and many died. Because of this, a Spanish bishop named Bartolomé de las Casas suggested using African slaves to work in New Spain instead. Later, when he saw how much worse African slaves were treated, las Casas changed his mind about this. By 1680, 94% of the Aztec population had died. This happened for a few reasons: * Disease, especially smallpox, which the conquistadors had brought from Europe * Being forced to work too hard with too little food, which caused malnutrition * Famine (not being able to grow enough food for themselves, because they were being forced to grow food for other people) * Abuse from the people who were forcing them to work After taking over the Aztec Empire, the Spanish conquistadors moved on to take over other parts of Mesoamerica. During the same 160 years from 1520 to 1680 between 85% and 95% of Mesoamerica's native population died. File:Aztec smallpox victims.jpg|Aztec drawing of smallpox victims. This disease killed many Aztecs File:Cultivo con uictli Códice Florentino libro X f.28.jpg|Aztecs being forced to work under the Encomienda system File:Spanish genocide1.jpg|The Spanish burn Aztecs at the stake File:Aztec fire dance recreation.jpg|Aztec culture continues today. This woman is doing a fire dance in Aztec clothing File:DrummerAmeca.JPG|A modern Aztec drumming in traditional Aztec clothing File:AzDanceMusDoc.JPG|Aztecs celebrate a festival in Mexico City in traditional clothing == Related pages == * Aztec * Aztec Empire * Spanish Empire ** Conquistadors ==References== Category:Aztec Category:Colonialism Category:16th century in Spain Category:History of North America Category:Spanish Empire",
 "title": "Spanish conquest of the Aztec Empire"
}