{
 "id": "51912",
 "text": "Nero (Nerō Claudius Caesar Augustus Germanicus; 15 December 37 AD-9 June 68 AD)was the fifth and last Roman Emperor of the Julio-Claudian dynasty. He was born Lucius Domitius Ahenobarbus. Nero was the adopted son of his grand-uncle Claudius. He became emperor on 13 October 54, after Claudius died. Claudius was probably assassinated by Nero's mother Agrippina the Younger. Agrippina had motive in ensuring the succession of Nero before Britannicus (Claudius' natural son) could gain power.Levick, Barbara. 1990. Claudius. Yale University Press. New Haven. p194 == Nero as Emperor == During his reign, Nero focused much of his attention on diplomacy, trade, and improving the cultural capital of the empire. He ordered the building of theatres and promoted athletic games. His reign included a successful war and negotiated peace with the Parthian Empire; the suppression of a revolt in Britain; and the beginning of the First Roman–Jewish War. In 64, most of Rome was destroyed in the Great Fire of Rome. In 68, the rebellion of Vindex in Gaul and later the acclamation of Galba in Hispania (Spain) drove Nero from the throne. Facing assassination, he died by suicide on 9 June 68.Suetonius states that Nero committed suicide in Suetonius: The Lives of Twelve Caesars, Life of Nero 49; Sulpicius Severus, who possibly used Tacitus' lost fragments as a source, reports that it is uncertain whether Nero committed suicide: Sulpicius Severus, Chronica II.29, also see T.D. Barnes, \"The Fragments of Tacitus' Histories\", Classical Philology (1977), p. 228. Nero's rule is associated with tyranny and extravagance.Galba, during his rebellion, criticized Nero's luxuria, both his public and private excessive spending: Tacitus, Annals I.16; Kragelund, Patrick, \"Nero's Luxuria, in Tacitus and in the Octavia\", The Classical Quarterly, 2000, pp. 494–515. He is known for a number of executions, including those of his mother,References to Nero's matricide appear in the Sibylline Oracles 5.49—520, Geoffrey Chaucer's Canterbury Tales The Monk's Tale, and William Shakespeare's Hamlet 3.ii. wife (Claudia Octavia) and stepbrother. Nero is known as the Emperor who played a fiddle while Rome burned. In reality, the violin had not yet been invented, Nero wasn't in Rome at the time, and when he heard of the fire he returned to direct relief efforts. He also persecuted Christians. However, some ancient sources show that Nero was popular with the common people during and after his reign. ==Nero Caesar in Jewish sources== In Midrash Icha Rabbah 1, Nero Caesar is not briefly mentioned as the one who ruled Rome during the Great Rebellion and died in the middle of the rebellion, while Vespasian was engaged in his attempts to conquer Jerusalem, and thus the prophecy of Rabbi Yochanan ben Zakai was fulfilled that Vespasian would reign over Caesar: After three days, Vespasian ran out of prayers in Hada Gafna, From Dascha and Labshe Had from San Didia, you brought the news that Nero and Amelichonia, the sons of Rome, died (translation: After three days, Vespasian went to swim in the Gofna. After he swam and put on one of his shoes, the news arrived that told him: Nero and Malichuch, the sons of Rome, had died). The coin with the image of Nero Caesar is mentioned several times in the Mishnah and in the Tosefta under the name \"Sela Neronit\" or \"Nironit\" for short.For example, Mishna , Tractate of Tools , Chapter 17 , Mishna 1 In addition, there is an article by a Sage in the Babylonian Talmud , which describes a man named Nero Caesar as the emissary of the emperor who reigned in those days, and not as the emperor himself. According to the same article, a Roman emperor sent Nero Caesar to conquer Jerusalem following a rumor from a man named Bar Kamtza , according to which the people of Judah were betraying him When Nero Caesar arrived in the Land of Israel , he shot arrows at the four winds of heaven to check which place to conquer, and all the arrows finally landed in Jerusalem . Nero concluded from this that he would win his war against Jerusalem. Later he saw a boy passing nearby and asked him about his studies, and the boy quoted He had the verse \"And I gave my vengeance on Edom by the hand of my people Israel\" ( Ezekiel , 25:14 ). Nero saw this as a prophecy that God would take revenge on him for the conquest of Jerusalem. Following this, Nero fled, became a convert , and one of his descendants was the Tana Rabi Meir.Babylonian Talmud , tractate Gitin , page 15, page 1 . His wife Poppea was presented in the sources as a sympathizer of the Jews, and in the Talmud she was even presented as MatroniaSee also Bezalel Ruth, page 26 ==Sources== *Tacitus, Histories, I-IV (c. 105) *Tacitus, Annals, XIII–XVI (c. 117) *Josephus, War of the Jews, Books II-VI (c. 94) *Josephus, Antiquities of the Jews, Book XX (c. 94) *Cassius Dio, Roman History, Books 61–63 (c. 229) *Plutarch, The Parallel Lives, The Life of Galba (c. 110) *Philostratus II, Life of Apollonius Tyana, Books 4–5, (c. 220) *Suetonius, The Lives of Twelve Caesars, the Life of Nero (c. 121) ===Other sources=== * Nero Nero:The Actor- Emperor * Nero entry in historical sourcebook by Mahlon H. Smith * Nero basic data & select quotes posted by Romans On Line * Nero Caesar biographical sketch archived in Bible History Online * Nero biography by Herbert W. Benario in De Imperatoribus Romanis * Grant, Michael. Nero. New York: Dorset Press, 1989 (). * Nero Claudius Drusus Germanicus entry in the Illustrated History of the Roman Empire * Griffin, Miriam T. Nero: The End of a Dynasty. New Heaven, CT; London: Yale University Press, 1985 (hardcover, ); London; New York: Routledge, 1987 (paperback, ). * Warmington, Brian Herbert. Nero: Reality and Legend (Ancient Culture and Society). London, Chatto & Windus, 1969 (hardcover, ); New York: W.W Norton & Company, 1970 (paperback, ); New York: Vintage, 1981 (paperback, ). ==References== Category:37 births Category:68 deaths Category:1st-century Roman emperors",
 "title": "Nero"
}