{
 "id": "519395",
 "text": "Garfield is a fictional cartoon cat created in 1978 by Jim Davis. He is known for his love of lasagna and sleeping, and his dislike of Mondays and diets. He lives with his best friend, Odie, and Jon, his owner. In addition to Davis's newspaper cartoon, an animated television show called Garfield and Friends ran in the United States from 1988-1994.. In 2004, a live-action adaptation of Garfield was released in cinemas. An animated Garfield movie, starring Chris Pratt, is coming in 2024. Garfield is one of the most famous animated characters of all time and makes over $1 billion dollars annually from merchandise. == Voiceover timeline == * Scott Beach (1980; segment on The Fantastic Funnies) * Lorenzo Music (1982–2001; TV specials, Garfield and Friends, Garfield’s Mad About Cats) * Lou Rawls (1982–1991, occasional singing voice, TV specials) * Tom Smothers (1991; Alpo commercials) * Bill Murray (2004–2006; Garfield: The Movie, Garfield: A Tail of Two Kitties) * Jeff Bergman (2004; Boomerang UK bumper) * Jon Barnard (2004–2016; Garfield's Nightmare, Garfield, Garfield: Saving Arlene, Garfield: Lasagna Tour, The Garfield Show: Threat of the Space Lasagna, Garfield Cat Litter commercial, Garfield Pinball) * Frank Welker (2007–present; Garfield Gets Real, Garfield's Fun Fest, Garfield's Pet Force, The Garfield Show, Mad, Nickelodeon All-Star Brawl, Nickelodeon Extreme Tennis, Nickelodeon Kart Racers 3: Slime Speedway, Nickelodeon All-Star Brawl 2) * Chris Pratt (2024; The Garfield Movie) Voiced by in unofficial material: * Fred Tatasciore (2006; Robot Chicken) * Seth Green (2011–2012; Robot Chicken) * Kevin Shinick (2011–2012; Mad) * Matthew Lillard (2014; Robot Chicken) * Dan Castellaneta (2017; The Simpsons) * Dan Milano (2020; Robot Chicken) ==Character== ===Fictional biography=== Garfield was born on June 19, 1978. His first owner, Mamma Leoni, got rid of him because of his appetite. From the moment he was born, he has loved lasagna. In almost every cartoon appearance, Garfield causes mischief. He did that in almost every episode of Garfield and Friends (1988-1994). ==Name== Garfield was named after Jim Davis' grandfather, James Garfield Davis, who in turn was named after US President James A. Garfield. ==References== Category:Garfield Category:Animated characters Category:Comics characters Category:Fictional cats",
 "title": "Garfield (character)"
}