{
 "id": "51956",
 "text": "Lake Sevan (Armenian: Սևանա լիճ, romanized: Sevana lich) is a large lake in Armenia. It is the largest body of water in both Armenia and the Caucasus region. Sevan is one of the largest freshwater high-altitude (alpine) lakes in Eurasia. The lake is in Gegharkunik Province. It is above sea level. The surface area of the basin of lake is about . It covers about one sixth of Armenia's total area. The lake itself is . Its volume is . Sevan is fed by 28 rivers and streams. Only 10% of the water that enters the lake is drained by the Hrazdan River. The remaining 90% evaporates. The lake is the source of about 90% of the fish and 80% of the crayfish caught in Armenia. Sevan is very important to the economy and culture of the area. The only large island (now a peninsula) is home to a medieval monastery. Sevan was used for irrigation of the Ararat plain and creating hydroelectric power during the Soviet period. This causes the level of water to decrease by around . Its volume was reduced by more than 40%. Later two tunnels were built to move water from highland rivers. This stopped the decrease and its level began rising. Before people begane changing the lake's ecosystem, the lake was at an altitude of 1,916 m (6,286 ft) above sea level, 95 m (312 ft) deep, covered an area of 1,416 km2 (547 sq mi) (5% of Armenia's entire area), and had a volume of 58.5 km3 (14.0 cu mi). == History == Sevan was one of the three great lakes of the historical Safavid Empire. These three lakes were called the Seas of Armenia. Sevan is the only one within the modern day Republic of Armenia. Lake Van and Lake Urmia are the other two great \"seas\" of historic Armenia. They are located in Turkey and Iran. Lake Sevan is considered the \"jewel\" of Armenia. It is \"recognized as a national treasure\" in the country. The 2001 Law on Lake Sevan defines the lake as \"a strategic ecosystem valuable for its environmental, economical, social, scientific, cultural, aesthetic, medical, climatic, recreational, and spiritual value.\" In 1673, Chardin wrote of the \"extraordinary sweetness of the Water\", the \"small Island in the middle of it; where stands a Monastery built about 600 years ago, of which the Prior is an Archbishop\", and \"nine sorts of fish which are there taken; the fairest trouts and carps which are eaten at Erivan being caught in this Lake\". Naturalist and traveler Friedrich Parrot, best known for climbing Mount Ararat in 1829, wrote that, It is important for the Armenian economy: being the main source of irrigation water, Sevan provides low-cost electricity, fish, recreation, and tourism. Category:Geography of Armenia Category:Lakes of Asia",
 "title": "Lake Sevan"
}