{
 "id": "51957",
 "text": "The Armenian Kingdom of Cilicia, (Armenian: Կիլիկիայի հայկական թագավորություն, Kilikiayi haykakan t’agavorut’yun) was an Armenian state formed during the High Middle Ages by Armenian refugees fleeing the Seljuk invasion of Armenia. == History == The kingdom had its origins in the principality founded c. 1080 by the Rubenid dynasty, an alleged offshoot of the larger Bagratuni dynasty, which at various times had held the throne of Armenia. Their capital was originally at Tarsus, and later became Sis. The Armenian Kingdom of Cilicia was a strong ally of the European Crusaders, and saw itself as a bastion of Christendom in the East. It also served as a focus for Armenian nationalism and culture, since mainland Armenia was under foreign occupation at the time. Cilicia's significance in Armenian history and statehood is also attested by the transfer of the seat of the Catholicos of the Armenian Apostolic Church, spiritual leader of the Armenian people, to the region of Cilicia. In 1198, with the crowning of Leo I, King of Armenia of the Rubenid dynasty, Cilician Armenia became a kingdom. In 1226, the crown was passed to rival Hethumids through Leo's daughter Isabella's second husband, Hethum I. As the Mongols conquered vast regions of Central Asia and the Middle East, Hethum and succeeding Hethumid rulers sought to create an Armenian-Mongol alliance against common Muslim foes, most notably the Mamluks. In the thirteenth and fourteenth centuries, the Crusader states in the Levant began falling to the Mamluk Sultanate and the Mongol Ilkhanate disintegrated, leaving the Armenian Kingdom without any regional allies. After relentless attacks by the Mamluk Sultanate of Egypt in the fourteenth century, the Cilician Armenia of the Lusignan dynasty, mired in an internal religious conflict, finally fell in 1375 following the conquest of its capital Sis by the Mamluk Sultanate. Commercial and military interactions with Europeans brought new Western influences to the Cilician Armenian society. Many aspects of Western European life were adopted by the nobility including chivalry, fashions in clothing, and the use of French titles, names, and language. Moreover, the organization of the Cilician society shifted from its traditional system to become closer to Western feudalism. The European Crusaders themselves borrowed know-how, such as elements of Armenian castle-building and church architecture. Cilician Armenia thrived economically, with the port of Ayas serving as a center for East–West trade. == References == ==Sources== * * * * * == Notes == Category:History of Armenia Category:1375 disestablishments Category:1190s establishments in Asia Category:14th-century disestablishments in Asia Category:1190s establishments in Europe Category:14th-century disestablishments in Europe Category:Former countries in the Middle East",
 "title": "Armenian Kingdom of Cilicia"
}