{
 "id": "519720",
 "text": "In law, evidence is an object of some kind, a document of some kind, or the testimony of a person in a court of law.Jonathan Wallace; Susan Ellis Wild, Webster's New World Law Dictionary (Boston: Houghton Mifflin Harcourt, 2010), p. 136 Evidence is used to show something is either true or false. Evidence has to follow rules in most jurisdictions. In the United States, for example, evidence was based on legal precedent until 1975. In that year Congress created the Federal Rules of Evidence. They became the official rules that all forms of evidence must follow in federal courts. Most states in the US use rules based on the federal rules. China, while a civil law country, has followed much of the US Federal Rules of Evidence in their \" Uniform Provisions of Evidence\".John J. Capowski, 'China’s Evidentiary and Procedural Reforms, the Federal Rules of Evidence, and the Harmonization of Civil and Common Law', Texas International Law Journal, Vol. 47, Issue 3 (Spring 2012), p. 455 A subpoena can be used to require a person or organization to provide documents used for evidence. == Admissibility of evidence == In most jurisdictions there are exclusionary rules that automatically suppress certain kinds of evidence. For example, in the US, this may be evidence that violates the constitutional rights of a defendant. To be admissible in most jurisdictions, evidence must be relevant and it must be reliable. In most cases evidence that may prejudice a jury or judge against a defendant is inadmissible. == Kinds of evidence == *Testimony is a statement made by a witness in a court. It is accepted as true or false based on other evidence. *Real evidence (also called Physical evidence). Real evidence is a thing, an object of some kind, that can be inspected. This may to be to see it actually exists or that it makes an inference of some kind. *Hearsay evidence is when a witness or other person makes a statement outside of court. It is a statement by a witness in court regarding something not of the person's own knowledge but that they heard from someone else. Generally, hearsay evidence is rarely admitted in court. *Documentary evidence is any document presented as evidence so it may be inspected in court. *Demonstrative evidence can be a model or demonstration of what happened at a particular time or place. *Eyewitness testimony is an account given under oath to events the person witnessed. It depends on human memory and can be affected by a number of factors which may make the accounts inaccurate. *Circumstantial evidence (also called Indirect evidence) is evidence that does not directly prove a fact of a case but may be inferred or presumed to have a bearing on a case. Circumstantial evidence can make a defendant appear to be guilty without directly proving guilt. Many courts consider circumstantial evidence to be more powerful than eyewitness testimony.Louis Blom-Cooper, Power of Persuasion: Essays by a Very Public Lawyer (Oxford: Hart Publishing, 2015), p. 280 *Corroborating Evidence is evidence used to strengthen other pieces of evidence already given. *Expert testimony is evidence given by experts in their fields. This may include \"skilled witnesses\" who by their experience may testify. Examples include bankers or landowners testifying to the value of a piece of land. == References == Category:Legal terms",
 "title": "Evidence (law)"
}