{
 "id": "520126",
 "text": "In international law, civil and political rights are those rights a person has over their own autonomy (civil) and their right to have a part in their government (political). Civil and political rights are guaranteed to every person by the Universal Declaration of Human Rights (UDHR) and the International Covenant on Civil and Political Rights (ICCPR).Berta E. Hernandez-Truyol, 'Civil and Political Rights – An Introduction', University of Miami Inter-American Law Review, Vol. 28-1 (January 1, 1997), p. 235 == Civil rights == Universal civil rights include: *The right to life - Every human being has right to their life. It is protected by law and no one has a right to take another person's life arbitrarily. This means without a legal reason. *The right to a fair trial - Every person has a right to a fair trial.Jixi Zhang, 'Fair Trial Rights in ICCPR', Journal of Politics and Law, Vol. 2, No. 4 (December 2009), p. 39 They have the right to be equal before courts and tribunals. They have a right to a fair and public trial before a competent and impartial court. *The freedom from torture - Every person has the right to be free from torture. They have the right to be free of cruel, inhuman or degrading treatment or punishment. *The freedom of speech - Article 19 of the ICCPR guarantees the right to free expression. But it is a derogable right, meaning it can be regulated if that regulation serves a vital public interest. An example is the US Supreme Court Justice Oliver Wendell Holmes, Jr. in the case Schenck v. United States (1919). The case was about limiting free speech during wartime to serve the greater good. He is famously quoted as saying: \"The most stringent protection of free speech would not protect a man in falsely shouting fire in a theatre and causing a panic.\" *The right to privacy - Article 17 of the ICCPR protects all persons from any interference, unlawful or arbitrary, with their \"privacy, family, home or correspondence.\" *The rights of liberty and security - Article 9(1) of the ICCPR uses the expression \"Liberty and security of the person.\" Dr Alex Conte; Dr Richard Burchill, Defining Civil and Political Rights: The Jurisprudence of the United Nations Human Rights Committee, Second Edition (Surrey, UK; Burlington, VT: Ashgate Publishing, 1971), p. 111 It says no one may be arbitrarily arrested or detained. No one may have their liberty taken away except by lawful process. *The right of asylum - When the UDHR was first drafted, one of the rights granted was the right to enjoy asylum. This status right was included with the right to a nationality and the right to be recognized before the law.Annemarie Devereux, Australia and the Birth of the International Bill of Human Rights, 1946-1966 (Annandale, N.S.W.: Federation Press, 2005), p. 59 *The rights were made in 1964 by President Lyndon B. Johnson. == Political rights == Political rights include: *The right to natural justice - Includes the principals of a fair hearing. It is also called Audi alteram partem. Dr Alex Conte; Dr Richard Burchill, Defining Civil and Political Rights: The Jurisprudence of the United Nations Human Rights Committee, Second Edition (Surrey, UK; Burlington, VT: Ashgate Publishing, 1971), p. 174 Latin for \"hear the other side\". *The right to due process - The right to due process in criminal proceedings under the law.Roza Pati, Due Process and International Terrorism (Leiden; Boston: Martinus Nijhoff Publishers, 2009), p. 31 Currently it is not a derogable right (see freedom of speech above). *The right to seek legal redress - This is a right all people have to the court system. It is the right to bring a lawsuit against another person, organization or government. *The right to Political participation - A right granted UDHR. It states: \"Everyone has the right to take part in the government of his country, directly or through freely chosen representatives.\" *The right to assemble - The right of assembly is provided by the UDHR. It says: \"Everyone has the right to freedom of peaceful assembly and association\". It adds: \"No one may be compelled to belong to an association\". *The right to petition - This is a right to complain about injustices and to have those complaints heard. Several international conventions provide the right to petition to individuals. P Sukumar Nair, Human Rights In A Changing World (Delhi: Kalpaz Publications, 2011), p. 289 *The right of self-defense - This applies to persons and is a right to defend themselves against immediate harm. It applies when a person is charged with a crime.Connie de la Vega, Dictionary of International Human Rights Law (Cheltenham, UK: Edward Elgar, 2013), p. 131 It also applies to collective self-defense against attack. *The right to vote - This was first granted by the UDHR. The ICCPR expanded this right to include the rights to vote, to be elected, to vote by secret ballot and universal suffrage (the right for all adults to vote regardless of race or sex). == References == == Other page == *Civil rights movement (worldwide) *Civil Rights Movement (in case of United States) Category:Human rights",
 "title": "Civil and political rights"
}