{
 "id": "520284",
 "text": "Jean Louis Rodolphe Agassiz (May 28, 1807 – December 14, 1873) was a Swiss- born and European-trained biologist and geologist. His work on natural history in Europe and the Americas was important.Lurie, Edward 1988. Louis Agassiz: a life in science. Johns Hopkins University Press. His reputation now is less good, because he fought against the theory of evolution, and held wrong ideas about human races. He thought the different human races were of different origins. This idea is called \"polygenism\".Lurie E. 1954. Louis Agassiz and the races of Man. Isis 45 (141) 227–242.Darwin's argument against the idea of different races being different species is here: Darwin, Charles 1871. The descent of man, volume 1 Chapter 7 On the races of Man, p166 et seq, especially p174, where Agassiz is mentioned. London: Murray. In the second edition of 1874, the discussion is also in Chapter 7. Darwin's comment at the end is interesting: :\"...when the principle of evolution is generally accepted, as it surely will be before long, the dispute between the monogenists and the polygenists will die a silent and unobserved death\".The Descent of Man, 2d ed. p. 180. This is indeed what happened, because there are now no expert zoologists who think that the different human races are different species. After visiting Harvard University in mid-career, he emigrated to the U.S. in 1847 and became a professor of zoology and geology at Harvard. He founded its Museum of Comparative Zoology. Agassiz made extensive contributions to ichthyology (including extinct species). He founded glaciology, the study of ice fields and ice ages. File:Agassiz, Louis – Nouvelles études et expériences sur les glaciers actuels, 1847 – BEIC 12025435.jpg|Nouvelles études et expériences sur les glaciers actuels, 1847 == References == Category:1807 births Category:1873 deaths Category:Swiss biologists Category:American zoologists Category:American geologists Category:People from the canton of Fribourg",
 "title": "Louis Agassiz"
}