{
 "id": "52029",
 "text": "Leonhard Euler (pronounced Oiler) (April 15, 1707 – September 7, 1783) was a Swiss mathematician and physicist. He spent most of his adult life in Russia and Germany. Euler made important discoveries in calculus and topology. He also created many of the words used in math today. He introduced the notation we use to write mathematical functions. He is also known for his works in mechanics, optics, fluid mechanics, astronomy and music theory. Euler is considered to be the most important mathematician of the 18th century, one of the greatest mathematicians of all time and one of the most prolific writing mathematicians. His collected works fill around 80 volumes. The famous mathematician Pierre-Simon Laplace advised, \"Read Euler, read Euler, he is a master for us all.” Euler was featured on the sixth series of the Swiss 10-franc bill and on numerous Swiss, German, and Russian postage stamps. The asteroid 2002 Euler was named in his honor. He is also celebrated by the Lutheran Church on their Calendar of Saints on May 24. == Early years == Euler was born in Basel to Paul Euler, a pastor of the Reformed Church. His mother was Marguerite Brucker, a pastor's daughter. He had two younger sisters, Anna- Maria and Maria Magdalena. Soon after the birth of Leonhard, the Eulers moved from Basel to the town of Riehen, where Euler spent most of his childhood. Euler started school back in Basel, where he lived with his grandmother. At the age of thirteen he went to the University of Basel. In 1723, he received his Master of Philosophy. At this time, he was receiving Saturday afternoon lessons from Johann Bernoulli, who quickly discovered his new pupil's extraordinary talent for mathematics. == Related pages == * Euler-Bernoulli Beam Theory * Euler–Mascheroni constant * Euler characteristic * Euler diagram * Euler's homogeneous function theorem * Euler's identity * Euler's number * Euler's polyhedron formula * Euler's totient function * Euler's totient theorem * Eulerian path * * * == References == Category:1707 births Category:1783 deaths Category:Number theorists Category:Swiss mathematicians Category:Music theorists Category:Theoretical physicists Category:Scientists from Basel",
 "title": "Leonhard Euler"
}