{
 "id": "520327",
 "text": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage. Below is the list of sites in Chile.UNESCO Official page for main list ==History== UNESCO was created for the \"conservation and protection of the world’s inheritance of books, works of art and monuments of history and science\". The constitution of UNESCO was ratified in 1946 by 26 countries.UNESCO, \"Constitution\"; retrieved 2015-10-31. Chile agreed to take part in the World Heritage Convention in 1980.UNESCO, \"States Parties: Ratification Status\"; retrieved 2015-10-31. ==List== The World Heritage Site (WHS)WHS is an acronym. WHS stands for \"World Heritage Site\". list has developed over time. It is part of a process; and the list continues to grow. As of 2014, there are 17 places in Chile which are on the World Heritage List.UNESCO, \"Chile\"; retrieved 2015-10-31. * 15 cultural sites * 2 natural sites There are 17 sites which are on a tentative list. ===Table=== Name Region Type Date Area (ha) Link Notes Location Image Churches of Chiloé Los Lagos Cultural (ii), (iii) 2000 971 16 sites 42º30'S 73º46'07'W Rapa Nui National Park Easter Island Cultural (i), (iii), (v) 1995 715 27º09'S 109º27'W Qhapaq Ñan, Incasic road system Cultural (ii)(iii)(iv)(vi) 2014 1459 18º16'33S 69º35'35W Historic Quarter of the Seaport City of Valparaíso Valparaíso Cultural (iii) 2003 959 33º02'28S 71º37'41W Humberstone and Santa Laura Saltpeter Works Tarapacá Cultural (ii), (iii), (iv) 2005 1178 In danger 20º12'22S 69º47'38W Sewell Mining Town O'Higgins Cultural (ii) 2006 1214 34º05'22S 70º22'59W === Tentative List=== The Tentative List consists of sites which have been nominated. The evaluation process is not yet completed. Here is the list. ==Related pages== * World Heritage Committee * UNESCO World Heritage Site * Table of World Heritage Sites by country * List of World Heritage Sites in South America ==References== ==Other websites== * UNESCO, World Heritage Sites *Chile Category:Chile Chile Category:Chile- related lists",
 "title": "List of World Heritage Sites in Chile"
}