{
 "id": "520493",
 "text": "Abner Joseph Mikva (January 21, 1926 - July 4, 2016) was an American judge, lawyer, academic and politician. He was a Democrat and of Jewish descent. He was known by many as an important liberal figure in Chicago and American politics. In later years, he was known for being a mentor to Barack Obama. Mikva served as a U.S. Representative representing Illinois from 1969 through 1979. He was also a federal judge appointed by Jimmy Carter. He served as judge from 1979 through 1994. He later served as the White House Counsel for Bill Clinton serving from 1994 through 1995. He has also served as a law professor at Northwestern University, the University of Chicago, and the University of Illinois. Mikva was born in Milwaukee, Wisconsin. He was raised in Chicago, Illinois. Mikva studied at the University of Chicago. He received the Presidential Medal of Freedom from President Barack Obama on November 24, 2014. Mikva was married to Zorita Wise from 1948 until his death in 2016. They had three daughters. Mikva died under hospice care in Chicago, Illinois from complications of bladder cancer on July 4, 2016, aged 90. He was also suffering from chronic obstructive pulmonary disease at the time of his death. ==References== ==Other websites== * * Chicago Sun-Times: \"Ukraine election shenanigans an eye-opener for Mikva\" * Mikva Challenge * NYTimes 2010 feature article Category:1926 births Category:2016 deaths Category:American judges Category:Lawyers from Chicago Category:Jewish American academics Category:Jewish American politicians Category:Jewish judges Category:Jewish lawyers Category:Politicians from Chicago Category:Businesspeople from Chicago Category:Businesspeople from Milwaukee Category:Politicians from Milwaukee Category:Presidential Medal of Freedom recipients Category:United States representatives from Illinois Category:University of Chicago alumni Category:Democratic Party (United States) politicians Category:Lawyers from Milwaukee Category:Educators from Milwaukee Category:University of Chicago faculty Category:University of Illinois faculty",
 "title": "Abner J. Mikva"
}