{
 "id": "520457",
 "text": "The following is a list of notable deaths in November 2015. For notable deaths before the current month, please see \"Previous months\". *Name, age, country of citizenship and reason for notability, cause of death, reference (must be added) are added. __TOC__ ==November 2015== * November 1 - Fred Thompson, 73, American politician and actor (Die Hard 2, Law & Order, Sinister), U.S. Senator from Tennessee (19942003), prosecutor who discovered Watergate tapes, lymphoma.Former US Senator Fred Thompson Dies at 73 * November 1 - Günter Schabowski, 86, German politician, editor-in-chief of Neues Deutschland (19781985), prematurely announced fall of the Berlin Wall, complications of a stroke.Guenter Schabowski, East German official who announced opening of Berlin Wall, dies at 86 * November 1 - Charles Duncan Michener, 97, American entomologist.Charles Michener, ‘patriarch’ of bee research, dies at 97 * November 2 - Andrzej Ciechanowiecki, 91, Polish art historian. * November 3 - Adriana Campos, 36, Colombian actress (Vecinos), traffic collision.Actress Adriana Campos Dead At 36: Mauricio Ochmann's Ex Dies In Car Accident In Colombia * November 3 - Tom Graveney, 88, English cricketer (Gloucestershire, Worcestershire, England), Parkinson's disease.Tom Graveney: Former England cricketer dies, aged 88 * November 3 - Ahmed Chalabi, 71, Iraqi politician, Deputy Prime Minister (20052006), President of the Governing Council (2003), heart attack. * November 3 - Howard Coble, 84, American politician, member of the U.S. House of Representatives from (1985–2015), complications from surgery.Former North Carolina Congressman, Howard Coble, dies at 84 * November 4 - Piotr Domaradzki, 69, Polish-born American journalist (Dziennik Związkowy), essayist and historian, injuries sustained from a house fire.Red. Piotr Domaradzki nie żyje * November 4 - Melissa Mathison, 65, American screenwriter (E.T. the Extra-Terrestrial, The Black Stallion, Kundun), neuroendocrine cancer.Melissa Mathison dies at 65; screenwriter of 'E.T.,' 'Black Stallion,' 'Kundun' * November 4 - René Girard, 91, French-American historian, literary critic, and philosopher of social science.Critic René Girard Is Dead at 91 * November 4 -Ole Knapp, 83, Norwegian politician.Tidligere industriminister Ole Knapp er død * November 5 - Nora Brockstedt, 92, Norwegian singer.Nora Brockstedt Dies at 92 * November 5 - Czesław Kiszczak, 90, Polish communist-era politician, Prime Minister (1989) and Minister of Interior and Administration (1981–1990).Nie żyje gen. Czesław Kiszczak. Miał 90 lat * November 5 - George Barris, 89, American custom car designer (Batmobile, Wagon Queen Family Truckster), cancer.George Barris, Creator of the Batmobile, Dies at 89 * November 5 - Hans Mommsen, 85, German historian of Nazism and The Holocaust.Hans Mommsen ist tot * November 6 - José Ángel Espinoza, 96, Mexican singer, composer and actor (House of Evil, Two Mules for Sister Sara), pneumonia.Muere el compositor y actor José Ángel Espinoza 'Ferrusquilla' * November 6 - Yitzhak Navon, 94, Israeli politician, President (1978–1983).Yitzhak Navon, Israel's fifth president, dies at the age of 94 * November 7 - Gunnar Hansen, 68, Icelandic-born American actor (The Texas Chainsaw Massacre), pancreatic cancer.'Texas Chainsaw Massacre' Actor Gunnar Hansen Dies at 68 * November 8 - Rhea Chiles, 84, American philanthropist, First Lady of Florida (19911998). * November 8 - Maduluwawe Sobitha Thero, 73, Sri Lankan Buddhist monk and Socialist activist, multiple organ failure.Influential Buddhist monk Maduluwave Sobhitha in Sri Lanka dies at 73 * November 9 - Ernst Fuchs, 85, Austrian painter, co-founder of the Vienna School of Fantastic Realism.Austrian painter Ernst Fuchs dies at 85 * November 9 - Tommy Hanson, 29, American baseball player (Atlanta Braves, Los Angeles Angels), multiple organ failure. * November 10 - Allen Toussaint, 77, American musician, producer, songwriter (\"Fortune Teller\", \"Working in the Coal Mine\") and arranger, heart attack. * November 10 - Pat Eddery, 63, Irish jockey, eleven-time Champion Jockey, four-time Prix de l'Arc de Triomphe winner, three-time Lester Award and Epsom Derby winner, cirrhosis.Jockey Pat Eddery has died aged 63 * November 10 - André Glucksmann, 78, French philosopher and writer.André Glucksmann è morto, addio al filosofo francese * November 10 - Laurent Vidal, 31, French Olympic triathlete (2008, 2012), heart attack. * November 10 - Helmut Schmidt, 96, German politician, Chancellor of West Germany (1974-1982), complications from surgery.German ex-Chancellor Schmidt dies at 96 * November 10 - Tim Valentine, 89, American politician, member of the U.S. House of Representatives from (1983–1995), heart failure.Former Congressman Tim Valentine dies * November 10 - Gene Amdahl, 92, American computer architect and high-tech entrepreneur, pneumonia. * November 10 - David Atlas, 91, American meteorologist, complications from a stroke.David Atlas Notice * November 10 - Klaus Roth, 90, German-born British mathematician, recipient of the Fields Medal (1958).Klaus Roth * November 11 - Phil Taylor, 61, English drummer (Motörhead).Former Motörhead Drummer Phil 'Philthy Animal' Taylor Dies At 61 * November 12 - Márton Fülöp, 32, Hungarian football player (Sunderland), cancer.Marton Fulop dead: Former Sunderland goalkeeper dies age 32 * November 12 - Aaron Shikler, 93, American artist, kidney failure.Aaron Shikler, artist who portrayed America’s elite, dies * November 12 - Jihadi John, 27, Kuwaiti-born British terrorist, member of the Islamic State, reported killed in drone strike.'Jihadi John': high degree of certainty US airstrike killed Mohammed Emwazi, sources say * November 13 - Notable French people killed in the November 2015 Paris attacks: **Thomas Ayad, music executive (Mercury Records France).Paris Attack at Bataclan Claims Life of Mercury Records Executive Thomas Ayad **Guillaume B. Decherf, 43, music critic and journalist (Les Inrockuptibles).Guillaume B. Decherf a été tué hier au Bataclan **Alban Denuit, 32, visual artist.Attentats à Paris: Un artiste bordelais parmi les tués du Bataclan **Matthieu Giroud, 39, geographer (University of Marne-la-Vallée).Attentats à Paris: Matthieu, un Isérois de 39 ans parmi les victimes du Bataclan * November 14 - Warren Mitchell, 89, British actor (Till Death Us Do Part, Death of a Salesman) and comedian.Alf Garnett star Warren Mitchell dies aged 89 - family say comedy actor was 'cracking jokes to the last' * November 14 - Nick Bockwinkel, 80, American professional wrestler (AWA). * November 14 - Berugo Carámbula, 70, Uruguayan actor (Son Amores) and comedian, complications from Parkinson's disease. * November 15 - Saeed Jaffrey, 86, Indian-British actor (The Man Who Would Be King, Shatranj Ke Khilari, My Beautiful Laundrette), brain hemorrhage.Saeed Jaffery dies * November 15 - Herbert Scarf, 85, American mathematician, heart failure.Herbert Scarf, an Economist's Mathematician, Dies at 85 * November 15 - Dora Doll, 93, French actress (Manon, French Cancan, Julia), complications from Alzheimer's disease.La comédienne Dora Doll est décédée * November 15 - Vincent Margera, 59, American reality television personality (Viva La Bam, Jackass), kidney and liver failure.Rest In Peace: “Jackass” Star Vincent “Don Vito” Margera Dead At 59 * November 15 - Nicoletta Machiavelli, 71, Italian actress (Navajo Joe, The Hills Run Red, Bawdy Tales), cancer.RIP Nicoletta Machiavelli * November 15 - Moira Orfei, 83, Italian circus artist and actress (Scent of a Woman, The Birds, the Bees and the Italians), complications from a stroke.Addio a Moira Orfei, signora del circo italiano * November 16 - Nando Gazzolo, 87, Italian actor (The Hills Run Red, Django Shoots First), complications from pneumonia.Addio a Nando Gazzolo, grande voce del teatro e della tv * November 16 - David Canary, 77, American actor (All My Children, Bonanza), complications from Alzheimer's disease.David Canary, Star of 'All My Children' for Decades, Dies at 77 * November 16 - Michael C. Gross, 70, American graphic designer (Ghostbusters logo), cancer. * November 16 - Bert Olmstead, 89, Canadian Hall of Fame ice hockey player (Montreal Canadiens, Chicago Black Hawks, Toronto Maple Leafs), complications from a stroke.Bert Olmstead est décédé * November 17 - Rahim Moeini Kermanshahi, 89, Iranian poet.Poet Rahim Moini Kermanshahi dies at 89 * November 18 - Jonah Lomu, 40, New Zealand rugby union player (All Blacks), kidney failure. * November 18 - Abdelhamid Abaaoud, 27, Belgian terrorist, suspected ringleader of the November 2015 Paris attacks, shot.Paris attacks ringleader dead - prosecutor * November 18 - Mal Whitfield, 91, American middle-distance runner, Olympic champion (1948, 1952) and aviator (Tuskegee Airmen), heart failure.Three-Time Olympic Track Champion Mal Whitfield Dies At 91 * November 19 - Armand, 69, Dutch protest singer, pneumonia.Protestzanger Armand (69) overleden * November 19 - Allen E. Ertel, 79, American politician, member of the U.S. House of Representatives from Pennsylvania's 17th district (1977–1983), heart attack.Allen Ertel, former congressman, gubernatorial candidate, dies * November 20 - Carlos Oroza, 92, Spanish poet, heart failure.Fallece a los 92 años Carlos Oroza, el poeta heterodoxo * November 20 - Kitanoumi Toshimitsu, 62, Japanese sumo wrestler, multiple organ failure.JSA chairman Kitanoumi dies at 62 * November 20 - Keith Michell, 88, Australian actor (The Six Wives of Henry VIII) and director, heart attack.\"Keith Michell obituary\" * November 21 - Ameen Faheem, 76, Indian-born Pakistani politician, Commerce Minister (2008–2013) and poet, leukemia.Senior PPP leader Makhdoom Amin Fahim dies * November 21 - Bob Foster, 76, American boxer, world light-heavyweight champion (1968–1974).World champ boxer Bob Foster dies at 76 * November 21 - Linda Haglund, 59, Swedish Olympic sprinter (1972, 1976, 1980), cancer.Linda Haglund död * November 21 - Cavit Şadi Pehlivanoğlu, 88, Turkish politician, member of the Grand National Assembly of Turkey (1961-1996), complications from pneumonia.Cavit Şadi Pehlivanoğlu Öldü * November 22 - Kim Young-sam, 87, South Korean politician, President (1993–1998), heart failure.Former President Kim Young-sam dies at age 87 * November 22 - Joseph Silverstein, 83, American violinist and conductor, heart attack.Word of the death of a great American concertmaster * November 23 - Yoram Tsafrir, 77, Israeli archaeologist, heart attack.Prominent Israeli Archaeologist Yoram Tsafrir Dies * November 23 - Manmeet Bhullar, 35, Canadian politician, Alberta MLA (Calgary-Greenway) and cabinet minister, traffic collision.Alberta Conservative MLA Manmeet Bhullar killed in highway crash * November 23 - Dan Fante, 71, American author and playwright, cancer.Morto Dan Fante, figlio di John * November 23 - Douglass North, 95, American economist and laureate of the Nobel Memorial Prize in Economic Sciences (1993), esophageal cancer.Douglass C. North, Maverick Economist and Nobel Laureate, Dies at 95 * November 24 - Varduhi Varderesyan, 87, Romanian-born Armenian actress.Մահացել է Վարդուհի Վարդերեսյանը (Arm) * November 24 - Heinz Oberhummer, 74, Austrian physicist, pneumonia.\"Science Buster\" Oberhummer tot * November 25 - Lennart Hellsing, 96, Swedish author and translator, pneumonia.Hellsing lämnade dörren till sagan på glänt * November 25 - Elmo Williams, 102, American editor and producer (High Noon, The Longest Day, Tora! Tora! Tora!), Oscar winner (1952). * November 26 - Guy Lewis, 93, American Hall of Fame college basketball coach (Houston Cougars), complications from a stroke. * November 26 - Norbert Gastell, 86, German actor and voice actor (Homer Simpson), complications from a stroke.Simpsons – Synchronsprecher Norbert Gastell verstorben * November 27 - Philippe Washer, 91, Belgian tennis player, heart failure.Belgisch Davis Cup-icoon Philippe Washer overleden * November 28 - Luc Bondy, 67, Swiss theater and opera director, heart attack.Décès du grand metteur en scène Luc Bondy * November 28 - Gerry Byrne, 77, English footballer (Liverpool and national team), Alzheimer's disease.Liverpool FC FA Cup final hero Gerry Byrne passes away aged 77 * November 28 - Barbro Hiort af Ornäs, 94, Swedish actress.Barbro Hiort af Ornäs död (death announced on this date) * November 28 - Maurice Strong, 86, Canadian businessman and diplomat. (death announced on this date) * November 28 - Yoka Berretty, 87, Dutch actress (Makkers Staakt uw Wild Geraas, The Silent Raid, Punk Lawyer), stroke.Actrice Yoka Berretty overleden * November 28 - Tomasz Tomczykiewicz, 54, Polish politician, member of Sejm (2001-2015), chronic kidney disease.Zmarł Tomasz Tomczykiewicz, szef śląskiej Platformy Obywatelskiej * November 28 - Olene S. Walker, 85, American politician, Governor of Utah (2003—2005), stroke.Olene Smith Walker, Utah’s first female governor, dies at age 85 * November 28 - Jean Joubert, 87, French author, heart attack.Hérault Jean Joubert, le poète et romancier montpelliérain est mort * November 29 - Oʻtkir Sultonov, 76, Uzbek politician, Prime Minister (1995–2003).Экс-премьер Узбекистана Уткир Султанов скончался на 76-м году жизни * November 29 - Claire Aho, 90, Finnish-born Swedish photographer, fire.Känd fotograf dog i Stockholmsbrand * November 29 - Joe Marston, 89, Australian soccer player (Preston North End) and manager (national team). (death announced on this date) * November 30 - Eldar Ryazanov, 88, Russian movie director (Carnival Night, The Irony of Fate, Promised Heaven), respiratory and heart failure.Умер Эльдар Рязанов * November 30 - Shigeru Mizuki, 93, Japanese manga author (GeGeGe no Kitarō, Onward Towards Our Noble Deaths, Showa: A History of Japan), heart attack.Kitaro, NonNonBâ Manga Creator Shigeru Mizuki Passes Away * November 30 - Gerrit Holdijk, 71, Dutch politician, Senator (1986–1987, 1991–2015), lung cancer.Oud-senator Holdijk (SGP) overleden * November 30 - Greg Fisk, 70, American politician, Mayor of Juneau, Alaska (2015), complications from a fall.Mayor of Juneau found dead, police say ==Previous months== * January 2015 * February 2015 * March 2015 * April 2015 * May 2015 * June 2015 * July 2015 * August 2015 * September 2015 * October 2015 ==References== *11",
 "title": "Deaths in November 2015"
}