{
 "id": "52057",
 "text": "\"Anarchy in the U.K.\" is a punk rock song by the Sex Pistols. It was first released as a single in 1976. In 1977, it was released as part of the album Never Mind the Bollocks Here's the Sex Pistols. The song's lyrics espouse a nihilistic and violent concept of anarchy. It has been covered by various other bands, including Megadeth. This song was in the video game Guitar Hero III: Legends of Rock. ==Megadeth cover== \"Anarchy in the U.K.\" was covered by American heavy metal band Megadeth for their third album So Far, So Good... So What!, released in 1988. Megadeth's version has altered lyrics. Dave Mustaine explained that he could not understand Johnny Rotten's singing, so he made up the parts he could not understand (in a notable example, the line \"another council tenancy\" is changed to \"and other cunt-like tendencies\"). In addition, the country is changed to \"USA\", though the title is kept unchanged. The song's music video is a montage of live footage of the band, cartoon political figures, which were designed and animated by Mike Smith, Uli Meyer, Tim Watts, Jonathan Webber, Rob Stevenhagen, Jonathan Hodgson, Roxanne Ducharme and Tracy Shaw and animated at Felix Films studio in London, England, various stock footages, and of a man being forced to watch (much like Alex's therapy in A Clockwork Orange). Steve Jones played the second solo. Mustaine now refuses to play the song live due to lyrics referring to the Anti-Christ, and he believes he's \"better for it\". ===Track listing versions=== ;United States 7\" # \"Anarchy in the U.K.\" # \"Liar\" ;United Kingdom 12\" # \"Anarchy in the U.K.\" # \"Liar\" # \"502\" ;Germany 12\" # \"Anarchy in the U.K.\" # \"Good Mourning/Black Friday\" (live) # \"Devil's Island\" (live) ===Megadeth's chart positions=== Chart (1988) Peak position == References == Category:1976 songs Category:Sex Pistols songs Category:1988 songs Category:Megadeth songs Category:Mötley Crüe songs",
 "title": "Anarchy in the U.K."
}