{
 "id": "520645",
 "text": "Kepler's laws of planetary motion are three laws that describe the motion of planets around the sun: #Planets move around the sun in elliptic orbits. The sun is in one of the two foci of the orbit. #A line segment joining a planet and the Sun sweeps out equal areas during equal intervals of time. #The square of the orbital period of a planet is proportional to the cube of the semi- major axis of its orbit. Johannes Kepler found these laws, between 1609 and 1619. == Comparison to Copernicus == Kepler's laws improve the model of Copernicus. If the eccentricities of the planetary orbits are taken as zero, then Kepler basically agrees with Copernicus: #The planetary orbit is a circle #The Sun at the center of the orbit #The speed of the planet in the orbit is constant The eccentricities of the orbits of those planets known to Copernicus and Kepler are small, so the rules above give good approximations of planetary motion; but Kepler's laws fit the observations better than Copernicus's. Kepler's corrections are not at all obvious: #The planetary orbit is not a circle, but an ellipse. #The Sun is not at the center but at a focal point of the elliptical orbit. #Neither the linear speed nor the angular speed of the planet in the orbit is constant, but the area speed is constant. The eccentricity of the orbit of the Earth makes the time from the March equinox to the September equinox, around 186 days, unequal to the time from the September equinox to the March equinox, around 179 days. A diameter would cut the orbit into equal parts, but the plane through the sun parallel to the equator of the earth cuts the orbit into two parts with areas in a 186 to 179 ratio, so the eccentricity of the orbit of the Earth is approximately :\\varepsilon\\approx\\frac \\pi 4 \\frac {186-179}{186+179}\\approx 0.015, which is close to the correct value (0.016710219) (see Earth's orbit). The calculation is correct when perihelion, the date the Earth is closest to the Sun, falls on a solstice. The current perihelion, near January 4, is fairly close to the solstice of December 21 Category:Astronomy",
 "title": "Kepler's laws"
}