{
 "id": "520889",
 "text": "Adam Augustus Wylie (born May 23, 1984) is an American actor, voice actor, singer, Broadway musical performer and a former Crayola spokesman. He's known for voicing Peter Pan in Jake and the Never Land Pirates. ==Filmography== ===Film=== Year Title Role Notes 1990 Child's Play 2 Sammy 1990 Kindergarten Cop Larry 1991 The Doctor Joey 1992 Out on a Limb Bob 1993 Reckless Kelly Pop Corn Boy 1994 Pom Poko Voice - English dubbed version 1994 The Swan Princess Young Prince Derek Voice Nominated - Young Artist Award for Best Performance by a Young Actor in a Voiceover - TV or Movie 1995 Napoleon Napoleon Voice - English dubbed version 1995 Breaking Free Billy Rankin 1996 All Dogs Go to Heaven 2 David Voice Nominated - Young Artist Award for Best Performance in a Voiceover - Young Artist 1996 Santa with Muscles Taylor 1997 The Ugly Duckling Young Ugly Voice 1998 Children of the Corn V: Fields of Terror Ezeekial Direct-to-video 1998 Sandman Easter Bunny 1999 The King and I Louis Leonowens Voice Nominated - YoungStar Award for Best Performance in a Voice Over Talent 2000 Lost in the Pershing Point Hotel Duane Striker 2000 Day Break Newton Warner 2001 Flying Virus Adam 2002 The Biggest Fan Garfield 2004 Wild Roomies Mr. Asher 2005 American Pie Presents: Band Camp Trading Card Bandy Direct-to-video 2007 Superman: Doomsday Jimmy Olsen Voice; direct-to-video 2007 Species – The Awakening Jared Uncredited role; direct-to-video 2008 Return to Sleepaway Camp Weed Direct-to-video 2009 Pimpin' Pee Wee Pee Wee Sequel to Porky's 2009 Street Dreams Mikey Robbins 2011 1320 Little Jim 2013 Dark Powers Neil Roberts 2013 The Smurfs 2 Panicky Smurf Voice 2013 'Til Morning Mr. Smee 2016 The Smurfs 3 Panicky Smurf Voice ===Television=== Year Title Role Notes 1990 Empty Nest Boy Season 2, episode 16 \"Everything But Love\" 1991 Who's the Boss? Child Season 7, episode 22 \"Tony and the Princess\" 1991 Home Improvement Jimmy Wagner Season 1, episode 5 \"Wild Kingdom\" 1991 Seinfeld The Kid Season 3, episode 6 \"The Parking Garage\" 1992 The Torkelsons Young Kirby Season 1, episode 16 \"Say Uncle\" 1993 The Adventures of Brisco County Jr. Charlie Sims Season 1, episode 7 \"Pirates!\" Young Artist Award for Best Youth Actor Guest Starring in a Television Show 1993 All-New Dennis the Menace Dennis Mitchell Leading role; voice Season 1: \"Caution: Boy at Work\" \"Fortune Fix\" \"Like Master, Like Mutt\" \"Lock, Stock & Grumble\" \"Brother Rats\" \"Hospitality\" \"It's a Guy Thing\" \"Pains, Trains & Automobiles\" \"Navy Destroyer\" \"Wish You Weren't Here\" \"Dennis the Genius\" \"Yankee Doodle Dennis/Mom's Helper\" \"Pig Out/Battle of the Bonding\" Young Artist Award for Best Youth Actor in a Voiceover Role - TV or Movie 1995 The Crew Season 1, episode 6 \"Bar Mitzvah Boy\" 1996 Boy Meets World Robert Season 3, episode 13 \"New Friends and Old\" 1996 Weird Science Trevor Season 4, episode 6 \"Grumpy Old Genie\" 1996 Phantom 2040 Hamid Season 2, episode 14 \"The Second Time Around\" 1996 Murder, She Wrote Boy Season 12, episode 20 \"Southern Double-Cross\" 1992-1996 Picket Fences Zachary Brock Leading role; 4 seasons - 87 episodes Young Artist Award for Best Youth Actor Recurring or Regular in a TV Series YoungStar Award for Best Young Actor in a Drama TV Series Young Artist Award for Best Performance by a Youth Actor in a Drama Series Nominated - Young Artist Award for Best Performance by a Youth Actor in a Drama Series Nominated - Young Artist Award for Outstanding Youth Ensemble in a Television Series (shared with Holly Marie Combs & Justin Shenkarow) Nominated - Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series (shared with Kathy Baker, Don Cheadle, Holly Marie Combs, Kelly Connell, Robert O. Cornthwaite, Fyvush Finkel, Lauren Holly, Costas Mandylor, Justin Shenkarow, Tom Skerritt, Leigh Taylor-Young & Ray Walston) Nominated - Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series (shared with Amy Aquino, Kathy Baker, Don Cheadle, Kelly Connell, Fyvush Finkel, Lauren Holly, Costas Mandylor, Marlee Matlin, Justin Shenkarow, Tom Skerritt & Ray Walston) 1996 Love and Marriage Max Begg Season 1, episode 1 \"Pilot\" 1996 Gargoyles: The Goliath Chronicles Matthew Season 1, episode 5 \"A Bronx Tail\" 1996 Jungle Cubs Mungo Voice; season 1, episode 4 \"Mondo Mungo / Bare Necessities\" 1997 Sliders Trevor Season 3, episode 13 \"Murder Most Foul\" 1997 Living Single Curly Season 4, episode 14 \"The Clown That Roared\" 1997 High Incident Timmy Martin Season 2, episode 14 \"Knock, Knock\" 1997 Adventures from the Book of Virtues Courtier / Croseus Season 1, episode 11 \"Humility\" 1997 Oddville, MTV Episode aired July 9, 1997 1995-1997 Hey Arnold Thaddeus (Curly) Season 1 (made in 1995 and released in 1996-1997) 1998 Beyond Belief: Fact or Fiction Anthony Shaw Season 2, episode 3 \"The Wall, The Chalkboard, The Getaway, The Prescription & Summer Camp\" 1998 Touched by an Angel Andy Erskine Season 4, episode 15 \"Doodlebugs\" 1998 Pensacola: Wings of Gold Casey Hunt Season 1, episode 18 \"We Are Not Alone\" 1998 Kelly Kelly Kid #1 Season 1, episode 3 \"Junior Firefighters\" 1998 7th Heaven (TV series) Marvin Season 3, episode 5 \"... And a Nice Chianti\" 1999 Chicken Soup for the Soul Nate Episode: \"Blind Date with Belinda\" 1999 Walker, Texas Ranger Thomas Season 7, episode 10 \"Rise to the Occasion\" 2000 The Wild Thornberrys Todd Season 2, episode 22 \"Luck Be an Aye-Aye\" 2000 Undressed Owen Season 2, episode 5 \"Inflatable Girlfriend\" Season 2, episode 6 \"Zit\" Season 2, episode 7 \"Gonorrhea\" 2000 Movie Stars Smithers Season 2, episode 3 \"The Seduction of Reese Hardin\" 2000 Batman Beyond Boy Kenny Season 2, episode 16 \"The Last Resort\" Season 2, episode 23 \"Payback\" 1999-2000 Pepper Ann Crash: Moose's Best Friend Season 3, episode 3 \"Beyond Good and Evel / One of the Guys\" Season 5, episode 11 \"\"Unhappy Campers / The Search for Pepper Ann Pearson\" Season 5, episode 13 \"The Finale\" 2001 Kate Brasher Sincere Boy Season 1, episode 2 \"Simon\" 2001 18 Wheels of Justice Matthew Season 2, episode 12 \"A Place Called Defiance\" 2001 Spin City Kid Season 5, episode 22 \"A Shot in the Dark: Part 1\" 2001 The Huntress Zack Season 1, episode 27 \"The Quest: Part 2\" 2001 Dead Last Buzz Season 1, episode 3 \"Death is in the Air\" 2001 Ed David Mirsky Season 1, episode 22 \"Prom Night\" Season 2, episode 1 \"The Stars Align\" 2000-2001 As Told by Ginger Ian Richton Voice Season 1, episode 3 \"Stealing First\" Season 1, episode 6 \"Dare I, Darren?\" Season 1, episode 11 \"The 'A' Ticket\" Season 1, episode 17 \"Piece of My Heart\" 2002 Judging Amy Nicholas Binkow Season 3, episode 13 \"The Cook of the Money Pot\" 2002 So Little Time Todd Season 1, episode 17 \"Riley's New Guy\" 2002 The Division Rory Kyle Season 2, episode 7 \"A Priori\" 1996-2002 Hey Arnold! Curly Gammelthorpe Season 1, episode 2 \"The Little Pink Book / Field Trip\" Season 1, episode 18 \"False Alarm / World Records\" Season 2, episode 1 \"Save the Tree / New Teacher\" Season 2, episode 6 \"Ransom / Ms. Perfect\" Season 2, episode 7 \"Arnold's Halloween\" Season 2, episode 17 \"Eugene Goes Bad / What's Opera, Arnold?\" Season 3, episode 1 \"Helga Blabs It All / Harold the Butcher\" Season 3, episode 6 \"Curly Snaps / Preteen Scream\" Season 3, episode 12 \"Best Man / Cool Party\" Season 3, episode 15 \"Helga's Show / The Flood\" Season 3, episode 20 \"School Play\" Season 5, episode 4 \"Bag of Money / Principal Simmons\" Season 5, episode 5 \"New Bully on the Block / Phoebe Breaks a Leg\" Season 5, episode 14 \"April Fool's Day\" 2001-2003 Gilmore Girls Brad Landford Season 2, episode 9 \"Run Away, Little Boy\" Season 2, episode 14 \"Should Have Been Lorelai\" Season 2, episode 18 \"Back in the Saddle Again\" Season 3, episode 16 \"The Big One\" Season 3, episode 21 \"Here Comes the Sun\" Season 3, episode 22 \"Those Are Strings, Pinocchio\" 2003 Fillmore! Winston Cotter Geek Brute #1 Voice Season 2, episode 5 \"Immune to All But Justice\" Season 2, episode 6 \"The Nineteenth Hole Is a Shallow Grave\" 2004 Switched! Himself Season 2, episode 13 \"Adam and Julia\" 2004 NCIS Darin Spotnitz Season 1, episode 17 \"The Truth is Out There\" 2004 Malcolm in the Middle Scott Season 5, episode 20 \"Victor's Other Family\" 2004 Veronica Mars Grant Winters Season 1, episode 4 \"The Wrath of Con\" 2005 Monk Pet Store Owner Season 3, episode 10 \"Mr. Monk and the Red Herring\" 2005 Joan of Arcadia Skinny Kid God Season 2, episode 19 \"Trial and Error\" 2005 The Life and Times of Juniper Lee Deputy Minion / Zombie #1 Season 1, episode 2 \"I've Got My Mind on My Mummy and My Mummy on My Mind\" 2006 Zoey 101 Dorm Advisor Season 2, episode 7 \"Girls Will Be Boys\" 2006 Avatar: The Last Airbender Academy Student Season 2, episode 6 \"The Blind Bandit\" 2006 Entourage Jay Season 3, episode 2 \"One Day in the Valley\" 2006 Finley the Fire Engine Miguel TV series 2005-2007 American Dragon: Jake Long Various (Fred /Nigel Thrall / Bananas B) Voice 2007 The Boondocks Theater Employee #1 Voice 2005-2008 Ben 10 Various 2006-2008 Legion of Super Heroes Brainiac 5 Leading role - 20 episodes 2008 Masters of Illusion: Impossible Magic Himself TV series 2008 Numb3rs Oliver Mayo Season 5, episode 10 \"Frienemies\" 2009 Terminator: The Sarah Connor Chronicles Henry Douglas Jr. Season 2, episode 15 \"Desert Cantos\" 2009 Life Pete Magnus season 2, episode 17 \"Shelf life'' 2008-2010 The Secret Saturdays Ulraj Season 1, episode 6 2010 General Hospital Officer Church Season 28 (episode 11986) 2010 Phineas and Ferb Season 2, episode 24 2010 CSI: Miami Teddy Enwald Season 8, episode 17 2008-2010 Ben 10: Alien Force\" Pierce Season 1, episode 12 \"Plumber's Helpers\" Season 2, episode 8 \"Voided\" Season 3, episode 17 \"Above and Beyond\" 2011 Ben 10: Ultimate Alien Pierce Season 2, episode 13 \"The Purge\" 2012 The Rules of Unemployment Adam TV series short 2013 Dark Things Reggie Season 1, episode 4 \"Guilt\" 2013 Anger Management Winger Season 2. episode 25 \"Charlie and the Airport Sext\" 2012-2013 Winx Club: Beyond Believix Tritannus Voice; 23 episodes 2012-2013 Jake and the Never Land Pirates Peter Pan Voice; 3 episodes 2013 Mad Season 4, episode 22 \"MAD's 100th Episode Special\" 2014 He Don't Got Game Austin TV series 2014 Perception Tyler Woolf Season 2, episode 14 \"Obsession\" 2015 Galaxy World of Alisa Talgut (voice) American English dub ===Television films=== Year Title Role Notes 1990 Without Her Consent Loren NBC film 1992 Stepfather III Easter Party Boy 1997 Under Wraps Gilbert 1999 Balloon Farm Charles 1999 Can of Worms Nick 1999 Michael Landon, the Father I Knew Teenage Jack 2000 Cutaway Cal 2004 Tales of a Fly on the Wall Bud 2005 Kitty's Dish Josh Voice 2009 Natalee Holloway Voice; Lifetime Movie Network film 2012 Ben 10: Destroy All Aliens JT Voice; Cartoon Network film 2014 Up in Smoke El Chupacabra Post-production ===Other appearances=== Year Title Role Notes 1996 Goosebumps: Escape from Horrorland Luke Morris Voice; video game 1996 Dot and Spot's Magical Christmas Adventure Ryan Voice; video short 1997 Adventures in Odyssey: In Harm's Way Voice; video short 1997 Sitting in Limbo Joey Viola Short film 1997 Crayola Kids Adventures: The Trojan Horse Odysseus Film; video special 1997 Crayola Kids Adventures: Tales of Gulliver's Travels Gulliver Film; video special 1997 Crayola Kids Adventures: 20,000 Leagues Under the Sea Captain Nemo Film; video special 1997 The Easter Story Keepers Justin Film; voice; video special 1999 Pirates: 3D Show Davey Short film 1999 Our Friend, Martin Sam Dale Film; voice; video special 2003 Midnight Club II Angel Voice; video game 2005 Tony Hawk's American Wasteland Voice; video game 2006 Toot & Puddle: I'll Be Home for Christmas Puddle Film; voice; video special 2008 Booth Girls Wil / Convention Worker Short film 2013 The Smurfs: The Legend of Smurfy Hollow Panicky Smurf Short film; voice 2014 WildStar Arwick Redleaf, Freebot Voice; video game Category:1984 births Category:American child actors Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:Living people Category:Actors from Los Angeles County, California",
 "title": "Adam Wylie"
}