{
 "id": "520905",
 "text": "We Bare Bears is a children's TV show created by Daniel Chong. It premiered on Cartoon Network. It is about 3 bear brothers: Grizzly, Panda, and Ice Bear (voiced by Eric Edelstein, Bobby Moynihan, and Demetri Martin), and their awkward attempts at communication with the human world in the San Francisco Bay Area. The series premiered on July 27, 2015. This series is Cartoon Network's first original series based on a comic. On August 12, 2015, Cartoon Network renewed the series for a second season. == Grizzly == Grizzly \"Grizz\" Bear is a fictional character. Grizzly is an anthropomorphic grizzly bear. His entire body is completely covered in brown fur. Grizzly is has a bubbly and hyperactive personality His is loud and talkative. He is an older brother of Panda Bear and Ice Bear. He is voiced by Eric Edelstein. ===Appearance=== His entire body is covered in brown fur. Grizz is in the middle in terms of height, he is taller than Panda but shorter than Ice Bear. === History === Not much is known about Grizzly's past, though what is known is he was parentless from a very young age. It is unknown what happened to his parents or who they were. ===Personality=== Grizzly is characterized as bubbly, hyperactive, loud, and talkative. ===Reception=== The character recived mixed to negative reception. https://www.thetoptens.com/worst-things-about-grizzly-we-bare- bears/ == Panda == Panda Bear or Pan Pan is one of the protagonists of We Bare Bears created by Daniel Chong. Panda is voiced by Bobby Moynihan. He is a middle brother of Grizzly Bear and Ice Bear. ===Appearance=== Being a panda, his body is covered in black and white fur on his head (excluding the ears) and a stripe across his belly. He is shorter than his brothers, with a wider frame than both. He is shown to have small black eyes surrounded by black fur. ===History=== === Personality === Panda is characterized as neurotic, artistic, and something of a drama queen. ===Reception=== Panda’s characterisim receive positive reviews from Fans who considered him an icon. ==Ice Bear== Ice Bear is one of the protagonist of the show We Bare Bears created by Daniel Chong. Ice Bear is voiced by Demetri Martin. He is a younger brother of Grizzly and Panda. ===Appearance=== ===History=== ===Personality=== ===Reception=== Ice Bear’s Character received Universal Acclaim ==References== Category:2015 American television series debuts Category:English-language television programs Category:Cartoon Network series Category:Television shows about bears Category:Television series about brothers Category:Television series set in San Francisco",
 "title": "We Bare Bears"
}