{
 "id": "521191",
 "text": "List of Hugh Jackman awards Award Wins Nominations ;Academy Awards ;Golden Globe Awards ;Grammy Awards ;Primetime Emmy Awards ;Tony Awards Australian actor and singer Hugh Jackman has won international recognition for his roles in major films, notably as superhero, period, and romance characters. ==Film awards== === Academy Awards === Year Nominated work Category Result Ref 2013 Les Misérables Best Performance by an Actor in a Leading Role ===Australian Film Institute Award=== Year Nominated work Category Result 1999 Erskineville Kings Best Performance by an Actor in a Leading Role 2007 The Prestige Best Actor === BAFTA Awards === Year Nominated work Category Result Ref. 2013 Les Misérables Best Actor in a Leading Role === Broadcast Film Critics Association Award === Year Nominated work Category Result Ref. 2013 Les Misérables Best Performance by an Actor in a Leading Role 2013 Les Misérables Best Ensemble === Golden Globe Awards === Year Nominated work Category Result Ref. 2002 Kate & Leopold Best Actor – Motion Picture Musical or Comedy 2013 Les Misérables Best Actor – Motion Picture Musical or Comedy === MTV Movie Awards === Year Nominated work Category Result 2001 X-Men Best On-Screen Team 2001 X-Men Best Breakthrough Male Performance 2004 X-Men 2 Best Fight 2010 X-Men Origins: Wolverine Best Fight ===Kids' Choice Award=== Year Nominated work Category Result 2014 The Wolverine (film) Favorite Male Butt Kicker 2015 X-Men: Days of Future Past Favorite Movie Actor 2015 X-Men: Days of Future Past Favorite Male Action Star ===Teen Choice Awards=== Year Nominated work Category Result Ref. 2003 X-Men 2 Choice Movie Actor 2004 Van Helsing Choice Movie Actor 2004 Van Helsing Choice Movie Chemistry 2006 X-Men: The Last Stand Choice Actor 2006 X-Men: The Last Stand Choice Liplock 2008 X-Men Origins: Wolverine Choice Actor in an Action Adventure 2009 Australia Choice Movie Drama Actor 2009 X-Men Origins: Wolverine Choice Movie Hissy Fit 2009 X-Men Origins: Wolverine Choice Movie Rumble 2013 Les Miserables Choice Movie Drama Actor ===People's Choice Awards=== Year Nominated work Category Result 2010 X-Men Origins: Wolverine Favorite Action Star 2010 Favorite Movie Actor 2010 X-Men Origins: Wolverine Favorite On-Screen Team 2012 Real Steel Favorite Action Movie Actor 2012 Favorite Movie Actor 2014 Favorite Movie Actor 2014 Favorite Dramatic Movie Actor 2013 Favorite Action Movie Actor ===Saturn Award=== Year Nominated work Category Result 2001 X-Men Best Actor 2007 The Fountain Best Actor 2013 Les Misérables Best Actor === Screen Actors Guild Awards === Year Nominated work Category Result Ref 2013 Les Misérables Outstanding Performance by a Cast in a Motion Picture 2013 Les Misérables Outstanding Performance by a Male Actor in a Leading Role ===Empire Awards=== Year Film Award Result Ref 2004 X2 Best Actor 2014 Empire Icon Award http://www.empireonline.com/awards2014/winners/icon.asp ===Miscellaneous awards=== Year Nominated work Category Result 2000 Erskineville Kings Film Critics Circle of Australia Awards for Best Actor 2001 CFCA Award for Most Promising Actor 2004 Making the Grade New York International Independent Film & Video Festival – Short Film Award for Best Actor 2010 X-Men Origins: Wolverine SFX Awards for Best Actor 2011 X-Men: First Class Scream Award for Best Cameo 2013 San Sebastián International Film Festival Donostia Award 2014 Slammy Award for Guest Star of the Year == Music awards == === Grammy Awards === Year Nominated work Category Result Ref 2014 Les Misérables Best Compilation Soundtrack for Visual Media 2019 The Greatest Showman Best Compilation Soundtrack for Visual Media ==Television awards== === Primetime Emmy Awards === Year Nominated work Category Result Ref 2005 58th Tony Awards Outstanding Individual Performance in a Variety or Music Program 2006 59th Tony Awards Outstanding Individual Performance in a Variety or Music Program 2009 81st Academy Awards Outstanding Special Class Program 2015 68th Tony Awards Outstanding Special Class Program === Slammy Awards === Year Nominated work Category Result Ref 2014 2014 Slammy Awards Raw Guest Star of the Year ==Theatre awards== ===Drama Desk Award=== Year Nominated work Category Result Ref. 2004 The Boy from Oz Outstanding Actor in a Musical ===Laurence Olivier Award=== Year Nominated work Category Result Ref 1998 Oklahoma! Best Actor in a Musical ===Tony Awards=== Year Nominated work Category Result Ref 2004 The Boy from Oz Best Actor in a Musical 2012 Special Tony Award ===Miscellaneous awards=== Year Nominated work Category Result Ref. 2004 The Boy from Oz Theatre World Award 2004 The Boy from Oz Drama League Award for Distinguished Performance of the Year 2004 The Boy from Oz Outer Critics Circle Award for Best Actor in a Musical ==Other accolades== In November 2008, People magazine named Jackman that year's \"Sexiest Man Alive.\" On 21 April 2009, Jackman had his hand and footprint ceremony at the Grauman's Chinese Theatre. He was awarded Best Performance By A Human Male award as Wolverine and a joint award for Best Cast award during the 2009 Spike Video Game Awards for the game X-Men Origins: Wolverine. In December 2012, Jackman received a star on Hollywood's Walk of Fame. ==References== [hugh jackman won the golden globe awards in 2013] Jackman, Hugh",
 "title": "List of awards and nominations received by Hugh Jackman"
}