{
 "id": "521212",
 "text": "Dylan O'Brien (born August 26, 1991) is an American actor and musician. He is best know for his role as \"Stiles\" Stilinski in the MTV series Teen Wolf. O'Brien also plays Thomas in the science fiction adventures Maze Runner Series. == Early life == O'Brien was born in New York City. His parents are Lisa O'Brien, a former actress and Patrick O'Brien, a camera operator. He grew up in Springfield Township, New Jersey. When he was twelve his family moved to Hermosa Beach, California. His father has Irish ancestry. His mother has Italian, English and Spanish ancestry. When he graduated from Mira Costa High School in 2009, he planned to attend Syracuse University as a sport broadcasting major, but he decided to move to Los Angeles to pursue an acting career. At fourteen, O'Brien began to post videos on his Youtube channel. Because of that, a local producer and director discovered him. == Career == He went to several auditions. After meeting a manager he got one of the main roles in MTV's Teen Wolf, a series based on the 1985 movie of the same name. He was originally planning to audition for the role of Scott, but after reading the script, O'Brien decided to audition for the role of Stiles. In 2013, O'Brien co-starred in the comedy movie The Internship, with Vince Vaughn and Owen Wilson. O'Brien played the lead role as Thomas in The Maze Runner, a movie adaptation of the novel of the same name. They began filming in the summer of 2013. At the end of October 2014, he started filming the sequel Maze Runner: The Scorch Trials in New Mexico. It was released on September 18, 2015 in the United States. == Personal life == O'Brien had previously been in a long-term relationship with actress Britt Robertson, whom he met on the set of The First Time in 2011. In October of 2018, it was reported that the couple had split.O'brien was seen in January 2023 at Paris Fashion Week with model and current girlfriend, Rachael Lange. O’Brien tends to keep his personal life private. == Filmography == ===Film=== Year Title Role Notes 2011 Charlie Brown: Blockhead's Revenge Charlie Brown Short 2011 High Road Jimmy 2012 The First Time Dave Hodgman 2013 The Internship Stuart Twombly 2014 The Maze Runner Thomas 2015 Maze Runner: The Scorch Trials Thomas 2016 Deepwater Horizon Caleb Holloway 2017 American Assassin Mitch Rapp 2018 Maze Runner: The Death Cure Thomas Post-Production ===Television=== Year Title Role Notes 2011–2017 Teen Wolf \"Stiles\" Stilinski Main role 2013 First Dates with Toby Harris Peter Episode: \"Roommates\" 2013 New Girl The Guy Episode: \"Virgins\" == References == == Other websites == * * * Dylan O'Brien profile on MTV Category:1991 births Category:Living people Category:Actors from New York City Category:American movie actors Category:American television actors",
 "title": "Dylan O'Brien"
}