{
 "id": "521264",
 "text": "Spectre is a 2015 British-American spy movie and the twenty-fourth James Bond series produced by Eon Productions for Metro-Goldwyn-Mayer and Columbia Pictures. It is the fourth movie to feature Daniel Craig as the fictional MI6 agent James Bond and the second movie in the series directed by Sam Mendes following Skyfall, and was written by John Logan, Neal Purvis, Robert Wade and Jez Butterworth. It is the last James Bond movie to be distributed by Columbia Pictures, as Universal Pictures will internationally distribute the next movie in the series, No Time to Die. The story sees Bond pitted against the global criminal organisation Spectre and their enigmatic leader Ernst Stavro Blofeld (Christoph Waltz), who plans to launch a national surveillance network to mastermind criminal activities across the globe. The movie marks Spectre and Blofeld's first appearance in an Eon Productions movie since 1971's Diamonds Are Forever; a character resembling Blofeld had previously appeared in the 1981 movie, For Your Eyes Only, but, because of the Thunderball controversy, he is not named, nor is his face shown. Several James Bond characters, including M, Q and Eve Moneypenny, return, with new additions Léa Seydoux as Dr. Madeleine Swann, Dave Bautista as Mr. Hinx, Andrew Scott as Max Denbigh and Monica Bellucci as Lucia Sciarra. Spectre was filmed from December 2014 to July 2015 in Austria, the United Kingdom, Italy, Morocco and Mexico. The action scenes prioritised practical effects and stunts, while employing computer-generated imagery made by five different companies. Spectre was estimated to have cost around $245 million—with some sources listing it as high as $300 million—making it the most expensive Bond movie and one of the most expensive movies ever made. Spectre was released on 26 October 2015 in the United Kingdom on the same night of the world premiere at the London Royal Albert Hall. It was followed by a worldwide release, including IMAX screenings. It was released in the United States and Canada on 6 November, and received fairly positive reviews from critics who praised the movie's action sequences, cinematography, acting and musical score, but criticized the screenplay and pacing. The theme song \"Writing's on the Wall\", performed and co-written by Sam Smith, won an Academy Award and Golden Globe for Best Original Song. Spectre grossed over $880 million worldwide, making it the sixth-highest-grossing movie of 2015 and the second-largest unadjusted total for the series after Skyfall. The next movie in the series, No Time to Die, was released in 2021, with Craig reprising his role for the fifth and last time. It was directed by Cary Joji Fukunaga. == Cast == * Daniel Craig as James Bond * Christoph Waltz as Franz Oberhauser / Ernst Stavro Blofeld * Léa Seydoux as Dr. Madeleine Swann * Ben Whishaw as Q * Naomie Harris as Eve Moneypenny * Dave Bautista as Mr. Hinx * Andrew Scott as Max Denbigh / C * Rory Kinnear as Bill Tanner * Jesper Christensen as Mr. White * Monica Bellucci as Lucia Sciarra * Ralph Fiennes as M ==References== ==Other websites== * – official site * Category:2015 action movies Category:2010s spy movies Category:James Bond movies Category:2010s American action movies Category:American spy movies Category:Movies that won the Best Original Song Academy Award Category:Movies set in Rome Category:Movies set in Austria Category:Movies set in Morocco Category:Movies set in England Category:Movies directed by Sam Mendes",
 "title": "Spectre (2015 movie)"
}