{
 "id": "52139",
 "text": "The Inca road system (El Camino Inca) of Peru was the most extensive of many roads and trails that were constructed in pre-Columbian South America. It went across the Andes mountains and reached heights of over 5,000 metres (16,500 feet) above sea level. It covered approximately 22,500 kilometres (14,000 miles) and provided access to over three million square kilometres of territory. The Incas did not use the wheel for transportation, and did not have horses until Spanish conquistadors arrived in Peru in the 16th century. As a result, the trails were used almost exclusively by people walking, sometimes accompanied by pack animals, usually llamas. The Inca people used the trails to transport goods and to relay messages, carried via knotted-cord quipu and by memory. Runners could carry messages over as much as 240 km (150 mi) per day, working in relay fashion much like the Pony Express of the 1860s in North America. There were approximately 2,000 inns, or tambos, placed at even intervals along the trails. The inns provided food, shelter and military supplies to the tens of thousands who traveled the roads. == Main routes == The most important Inca road was the Camino Real, as it is known in Spanish. It is 5,200 km (3,230 mi) long. It began in Quito, Ecuador, passed through Cusco, and ended in what is now Tucumán, Argentina. By land, the Camino Real went across the Andes mountain range. At its highest, it reaches altitudes of more than 5,000 m. El Camino de la Costa, the coastal trail, is 4,000 km (2,420 mi) long and ran parallel to the sea. It was linked with the Camino Real by many smaller routes. == Inca trail to Machu Picchu == Today, the most popular of the Inca trails for trekking is the Capaq Nan trail, which leads from the village of Ollantaytambo to Machu Picchu, the so-called \"Lost City of the Incas\". There are many well-preserved ruins along the way, and hundreds of thousands of tourists from around the world make the three- or four-day trek each year, accompanied by guides. The Inca Trail to Machu Picchu is actually three routes, which all meet up near Inti-Pata, the 'Sun Gate' and entrance to Machu Picchu. The three trails are known as the Mollepata, Classic and One Day trails, with Mollepata being the longest of the three. Passing through the Andes mountain range and sections of the Amazon rainforest, the Trail passes several well-preserved Inca ruins and settlements before ending at the Sun Gate on Machu Picchu mountain. The two longer routes require an ascent to beyond 12,000 ft (3,660 m) above sea level, which can result in altitude sickness. == Further reading == * Inca: Lords of Gold and Glory. Virginia: Time-Life Books, 1992. * Andean World: Indigenous History: Culture and Consciousness by Kenneth Adrien. == References == == Other websites == * Inca trail map * Inca trail tour * Interactive Map Interactive Map * Inca Trail to Machu Picchu Interactive Map * Inca Trail to Machu Picchu Information Category:Inca",
 "title": "Inca road system"
}