{
 "id": "52136",
 "text": "Inca rope bridges were simple suspension bridges over canyons and gorges to provide access for the Inca Empire. Bridges of this type were suitable for use since the Inca people did not use wheeled transport - traffic was limited to pedestrians and livestock. These bridges were an important part on the Inca road system and are an excellent example of Inca innovation in engineering. They were frequently used by runners delivering messages throughout the Incan empire. == Other websites == *The Last Inca Suspension Bridge: A Photo Album (various images of amazing Inca Bridges and pathways, old and new.) *Boston University, Inca Bridge to the past This bridge was also in use of crossing when they were at war. ==References== * Incas: Lords of Gold and Glory, 1992, Virginia: Time-Life Books. *Finch, Ric, 2002, Keshwa Chaca: Straw Bridge of the Incas: Ithaca, N.Y., South American Explorer, n. 69, fall/winter 2002, p. 6-13. Copies of this issue may still be available for purchase from the South American Explorer. *Gade, D.W., 1972, Bridge types in the central Andes: Annals of the Association of American Geographers, v. 62 (1), p. 94-109. [Shows the bridge at Huinchiri and predicts the art of building it will be lost within another generation; fortunately, this prediction has proven untrue, and ethnic/adventure tourism may help save this bridge for posterity.] *Malaga Miglio, Patricia, and Gutierrez, Alberto, (pub. date unknown), Qishwachaca: Rumbos (magazine published in Peru), p. 30-34. *McIntyre, Loren, 1973, The Lost Empire of the Incas: National Geographic Magazine, v. 144, n. 6, p. 729-787. *McIntyre, Loren, 1975, The Incredible Incas and Their Timeless Land: Washington D.C., National Geographic Society, 199 p. *Roca Basadre, David and Coaguila, Jorge, eds., 2001, Cañon delApurimac, La Ruta Sagrada del Dios Hablador: Lima, Empresa Editora ElComercio, S.A., 78 p. *Secrets of Lost Empires: Inca, 1995, NOVA program, available on video. *Squier, Ephraim George, 1877, Peru: Incidents of Travel and Exploration in the Land of the Incas: New York, Harper Bros., 577 p. * Von Hagen, Victor, 1955, Highway of the Sun: New York, Duell, Sloan and Pearce, 120 p. * Chmielinski, Piotr, 1987, Kayaking the Amazon: National Geographic Magazine, v. 171, n. 4, p. 460 - 473. Category:Suspension bridges Category:Inca Category:Ropework",
 "title": "Inca rope bridge"
}