{
 "id": "521739",
 "text": "Phil \"Philthy Animal\" Taylor (21 September 1954 – 11 November 2015) was a English rock drummer in the British heavy metal band Motörhead from 1975–1984 and 1987-1992 recording ten studio albums and the live album No Sleep 'til Hammersmith. The classic mark IV Motörhead line-up consisted of Lemmy, Philthy Animal Taylor and Fast Eddie Clarke. Taylor died in London of liver failure on 11 November 2015 at the age of 61. ==Discography== ===Motörhead=== *On Parole (1975/1979) *Motörhead (1977) *Overkill (1979) *Bomber (1979) *Ace of Spades (1980) *No Sleep 'til Hammersmith (1981) *Iron Fist (1982) *Another Perfect Day (1983) *Rock 'n' Roll (1987) *1916 (1991) *March ör Die (1992) ===Other recordings=== *The Muggers (album) The Muggers Tapes Live recording from a brief spell of about 4 gigs Phil drummed with Fast Eddie Clarke on guitar, John 'Speedy' Keen, also on guitar, and Billy Wrath on bass. The album was released as a 'bonus' to a 'Best of Motorhead' release. *Philthy Phil & Fast Eddie (album) Naughty Old Santa's Christmas Classics (1989) *GMT One By One 12\" single (1989) *GMT War Games CD release of same tracks + one other (1991) *The Deviants Have Left The Planet (album) drummed with Ladbroke Grove pals Mick Farren on vocals, Larry Wallis on guitar, etc. (1999) *Sheep In Wolves' Clothing Motorheadbangers fan club tribute CD. The Deviants Mick Farren vocals, Andy Colquhoun, guitar, David Ito, bass and Philthy, drums; re- recorded the Motorhead / Farren song 'Lost Johnny' for the CD - released 7 April 2008. ===Other appearances=== *Taylor appears, dressed in drag, part way through the Girlschool promotional video for their song \"Yeah, Right\". video *Classic Albums - Ace Of Spades DVD. Taylor is in interview and playing drums on several of the Ace Of Spades albums classic tracks. ==References== ==Other websites== * Phil Taylor at MySpace * The Web of Spider at MySpace Category:1954 births Category:2015 deaths Category:Deaths from liver failure Category:Disease-related deaths in London Category:English rock drummers Category:People from Derbyshire",
 "title": "Phil Taylor (musician)"
}