{
 "id": "521879",
 "text": "On 13-14 November 2015, a series of mass shooting and suicide bombings happened in Paris and Stade de France at Saint-Denis, Seine-Saint-Denis, France at the Bataclan concert venue, and at other sites. 130 people were killed. Because of this, French President François Hollande announced a national state of emergency. In his speech of 14 November, Hollande said that 128 people were killed and another 128 were gravely injured. ==Overview== In total, over 350 people were injured during the attacks, about 100 of them are gravely injured. One of the attacks was at the Paris stadium, one of the others was at a theatre. The others six were at well known places in the city. At least seven people were involved in the attacks: seven were suicide bombers, one was shot by police. ISIS claimed responsibility for the attacks on the following day. The leader of the attacks was Belgian terrorist Abdelhamid Abaaoud. He was killed in a police raid on 18 November. ==Background== ===Charlie Hebdo shooting=== France had been on high alert for terrorist threats since the Charlie Hebdo shooting in early January 2015 and other related incidents during the January 2015 Île-de-France attacks. France had also increased security in anticipation of the 2015 United Nations Climate Change Conference, scheduled to be held in Paris from 30 November to 11 December 2015, and had restored border checks the week before the attacks. The Charlie Hebdo shooting in January 2015 occurred in the 11th arrondissement of the city, where the Bataclan theatre is situated. Other attacks in France also took place, such as the stabbing of three soldiers in Nice who were guarding a Jewish community center, the Saint-Quentin Fallavier attack and the 2015 Thalys train attack. ===Islamic State of Iraq and the Levant=== The Islamic State and their branches have claimed responsibility for numerous deadly attacks within the weeks leading up to the attacks. On 31 October 2015, Metrojet Flight 9268, carrying mostly Russian passengers crashed in the Sinai in Egypt, killing 224 people. Islamic State's Sinai branch claimed responsibility. On 12 November 2015, twin suicide bombings took place in Beirut, Lebanon, killing 43 people. ISIL's lead executioner Jihadi John was reportedly killed by a U.S. drone strike, and had lost the Battle of Sinjar to Kurdish forces, on the day of the Paris attacks. ==Attacks== Seven distinct attacks took place, comprising six shootings and three explosions. The explosions occurred near the Stade de France, while shootings were reported in the vicinity of Rue Alibert, Rue de la Fontaine-au-Roi, Rue de Charonne, the Bataclan theatre in Boulevard Voltaire, Avenue de la République, and the Boulevard Beaumarchais. It is likely that three teams carried out the coordinated series of attacks. ===Perpetrators=== The Islamic State officially claimed responsibility for the attacks on the morning of 14 November, praising their \"eight brothers\" led by Abdelhamid Abaaoud on the death of \"at least 200 'crusaders'\" and claiming that \"this was only the beginning of the storm.\"Attentats à Paris : Le groupe Etat islamique revendique les attaques de vendredi à Paris, on 20 Minutes Accessed 14 November 2015 L'Etat islamique revendique les attentats de vendredi à Paris, on liberation.fr Accessed 14 November 2015 The people who committed the crime were: * Four attacked the Bataclan theatre wearing black clothing and using AK-47 assault rifles. Three killed themselves with their suicide vests during the police raid on the theatre. The fourth was killed by police gunfire just before his vest detonated. * Three suicide bombers detonated their vests near the Stade de France. A Syrian passport has been found on one of the suicide bombers according to the French Police. The authenticity of the passport was put into question and many analysts pointed out that false Syrian passports can be easily obtained. Minister of Citizen Protection in Greece Nikos Toskas confirmed that one of the Syrian passport-holders had been registered as a refugee on Leros in October. It was also reported that an Egyptian passport was found close to the body of another bomber. * The eighth attacker detonated his vest on the Boulevard Voltaire near the Bataclan theatre. ==Death toll== The exact number of attackers is currently unclear; certain media speak of seven, others of eight attackers. Police think there might be 3–5 attackers who survived, and are on the run. About ten people were taken in police custody in Brussels, as they might have connections to the attacks. The ringleader of the attack, Abdelhamid Abaaoud, was killed in a police raid in France on 18 November. ==Aftermath== President François Hollande issued a statement asking the French people to remain strong in the face of such incidents. Hollande also visited the Bataclan theatre and vowed to \"mercilessly\" fight against terrorism. Hollande also chaired an emergency meeting of the French Cabinet that night, and organized his national security council to meet the next morning. The authorities urged the residents of Paris to stay indoors for their own safety. Hollande also cancelled his trip to the ensuing G-20 Antalya summit because of the attacks, instead sending Foreign Minister Laurent Fabius and Finance Minister Michel Sapin as his representatives. On 14 November, President Hollande announced three national days of mourning.Attentats : Hollande décrète \"trois jours de deuil national\", on europe1.fr (accessed on 14 November 2015) Later that day, some of the names of the dead were released: * Thomas Ayad, music executive of the Mercury Records France).Paris Attack at Bataclan Claims Life of Mercury Records Executive Thomas Ayad * Guillaume B. Decherf, 43, music critic and journalist of the Les Inrockuptibles.Guillaume B. Decherf a été tué hier au Bataclan * Alban Denuit, 32, visual artist.Attentats à Paris: Un artiste bordelais parmi les tués du Bataclan * Matthieu Giroud, 39, geographer at the University of Marne-la-Vallée.Attentats à Paris: Matthieu, un Isérois de 39 ans parmi les victimes du Bataclan ==Reactions== Pope Francis has condemned the attacks. He said that violence would not solve problems, and that the attacks could not be justified from a religious or humanitarian point of view. Representatives of different religions also condemned the attacks. ==Related pages== * September 11 attacks * * * * * * Charlie Hebdo shooting * * * * * * * 2025 Pahalgam Massacre * * * * * Pittsburgh synagogue shooting * * * * 2025 D.C. Jewish museum shooting * * * * * ==References== Category:Islamic State Category:Massacres in Europe Category:Crimes against humanity Category:Islamic terrorist incidents in 2015 Category:Attacks on buildings and structures in 2015",
 "title": "November 2015 Paris attacks"
}