{
 "id": "521960",
 "text": "Odo, Earl of Kent (ca 1030 – 1097) and Bishop of Bayeux, was the half-brother of William the Conqueror. For a time he was second in power after William became King of England. == Career == === Early life === Odo was born about 1030.George Edward Cokayne, The Complete Peerage; or a History of the House of Lords and all its Members from the Earliest Times, Vol. VII (London: The St. Catherine Press, Ltd., 1929), p. 124Detlev Schwennicke, Europäische Stammtafeln: Stammtafeln zur Geschichte der Europäischen Staaten, Neue Folge, Band III Teilband 4 (Marburg, Germany: J. A. Stargardt, 1989), Tafel 694B He was the son of William the Conqueror's mother Herleva and Herluin de Conteville. Count Robert of Mortain was his younger brother. === Norman Conquest and after === Although he was an ordained Christian cleric, he is best known as a warrior and greedy nobleman. He provided 100 ships for his brother's invasion of England.Anglo-Norman Studies X, Proceedings of the Battle Conference 1987, ed. R. Allen Brown (Woodbridge, UK: The Boydell Press, 1988), Appendix 4 \"Ships List of William the Conqueror\" Odo is one of the very few proven companions of William the Conqueror, known to have fought at the Battle of Hastings in 1066.Judith A. Green, The Aristocracy of Norman England (Cambridge: Cambridge University Press, 1997), pp. 25–26 He probably commissioned the Bayeux Tapestry. In 1067, Odo became the Earl of Kent. For several years he was a trusted royal minister. On some occasions when William was absent (back in Normandy), he served as the de facto regent of England. At times he led the royal forces against rebellions. There are also other occasions when he accompanied William back to Normandy. During this time Odo acquired vast estates in England. He held land in twenty-three counties, mainly in the southeast and in East Anglia. === Character === As the Earl of Kent he became infamous for being greedy, ruthless and a tyrant. Odo obtained a large fortune in land and gold by plundering the landowners of Kent. One chronicler, Thomas of Marlborough, called him a \"ravening wolf\".Thomas (of Marlborough, Abbot of Evesham); Jane E. Sayers; Leslie Watkiss, History of the Abbey of Evesham (Oxford: Clarendon Press, 2003), p. 177 Orderic Vitalis, writing nearly a century after Odo's death, he showed him to be a very complex man.David R. Bates, 'The Character and Career of Odo, Bishop of Bayeux (1049/50-1097)', Speculum, Vol. 50, No. 1 (January 1975), pp. 1–2 On the one hand Odo had great ambition. He was the perfect example of Norman oppression on a conquered England. Yet he was deeply religious and contributed to the ecclesiastical growth of England. Orderic wrote of him: == Fall from grace == In 1076 Odo was placed on trial. He was accused of defrauding the Crown and the Diocese of Canterbury. At the conclusion of the trial he was forced to return a number of properties he had taken. Most of his wealth was redistributed. In 1082, he was suddenly disgraced and put in prison. This time it was for having planned a military expedition to Italy. He wanted to crown himself the Pope.David Bates, The Normans and Empire (Oxford: Oxford University Press, 2013), p. 85 His brother, the king, disapproved of the plan and put a stop to it. Odo spent the next five years in prison in Rouen. His English estates were taken back by the king, as was his office as Earl of Kent.Shirley Ann Brown, 'The Bayeux Tapestry: Why Eustace, Odo and William?', Anglo-Norman Studies XII: Proceedings of the Battle Conference 1989, ed: Marjorie Chibnall (Woodbridge, Suffolk; Wolfeboro, NH: Boydell Press, 1990), p. 24 He was allowed to remain the Bishop of Bayeux, however. Odo was released from prison after William died. In 1096 Odo set off on the First Crusade with his nephew, Robert Curthose. He died in Palermo while wintering there in early 1097. He was buried in the Cathedral there. == References == Category:1030s births Category:1097 deaths Category:Crusaders Category:Earls and countesses Category:Normans Category:French Roman Catholic bishops",
 "title": "Odo, Earl of Kent"
}