{
 "id": "521944",
 "text": "A schnauzer is a type of dog breed that originated in Germany in about the 14th century. The Standard Schnauzer is the oldest of the three Schnauzer varieties: Miniature, Standard, and Giant. All three varieties have the distinctive whiskers, mustache and eyebrows, which is where they take their name from as in German schnauzer means moustache. == History == The Standard Schnauzer is the prototype from which the other two were bred. From the middle ages on they guarded the livestock and family members. They are descended from European herding and guard dogs. As a distinctive breed, they appear in pictures of the 14th and 15th centuries. As far as can be determined they were bred from the Gray Wolf Spitz, the German poodle (pudel) and the Wirehaired Pinscher. About the middle of the 19th century German dog enthusiasts took an interest in the Schnauzer. Dog breeders experimented by crossing them with other breeds. First the Miniature Schnauzer was developed, then the Giant Schnauzer. == Three varieties == * A Miniature Schnauzer is an energetic and sturdy little dog. Miniature Schnauzers are also very intelligent dogs. They stand between tall at the shoulder. They normally weigh between . The normal colors are salt and pepper (a mix of off-white, gray and black), all black, and black and silver. They resemble the Standard Schnauzer from which they were bred. They were first shown as early as 1889. * The Standard Schnauzer is the original breed of Schnauzer. German farmers in kept them as hunting dogs, rat catchers and watchdogs. They are a medium-sized dog with a hard, wire-like coat. It is a strong and very quick dog for its size. It is able to cover distances easily. Like all Schnauzers they have the same whiskers, eyebrows and mustache. They stand between tall at the shoulder. Standard Schnauzers normally weigh between . The colors are usually salt and pepper or solid black. * The Giant Schnauzer resembles the Standard Schnauzer, only they are bigger and stronger. They are very muscular dogs. They stand as much as tall at the shoulder. They can weigh about . The double coat is either solid black or “pepper and salt.” Much the same as their two smaller cousins they have the distinctive whiskers, eyebrows and mustache. The breed was developed in the areas around Württemberg and Bavaria as a farm dog.American Kennel Club, The New Complete Dog Book, 20th Edition (Irvine, CA: I-5 Press, 2015), p. 352 They were used to drive livestock to market. During World War I they were used as military guard dogs and as police dogs. They still work with police today and also as Search and rescue dogs. They are also popular as guard dogs. == References == == Other websites == * *The Three Varieties of the Schnauzer Dog Breed *The Behavioral Differences Between a Miniature, Standard & Giant Schnauzer Category:Dog breeds originating in Germany",
 "title": "Schnauzer"
}