{
 "id": "522234",
 "text": "Marie Jean Pierre Flourens (13 April 1794 – 6 December 1867) proved that the effects of \"the mind\" were caused by the brain, not the heart. He was a French physiologist, the founder of experimental brain science and a pioneer in anesthesia. He use brain surgery on animals, and studied their effects. His kind of surgery is called \"ablative surgery\": in most cases ablative brain surgery does not mean removing brain tissue, but rather destroying tissue and leaving it in place. In 1825, Flourens pioneered the experimental method of ablating parts of the brain in living rabbits and pigeons. He carefully observed their effects. His intention was to find out whether different parts of the brain had different functions. Flourens was able to show for the first time that the main parts of the brain were responsible for largely different functions. By removing the cerebral hemispheres, for instance, all perceptions, voluntary action,reflex actions still work because they are done by spinal cord circuits. and judgment were abolished. The removal of the cerebellum affected the animal's equilibrium and motor coordination, while the destruction of the brainstem (medulla oblongata) caused death. These experiments led Flourens to conclude that: * the cerebral hemispheres are responsible for higher cognitive functions, * the cerebellum regulates and integrates movements, * that the medulla controls vital functions, such as circulation, respiration and general bodily stability.Flourens M.J.P. 1824. Recherches expérimentales sur les propriétés et les fonctions du système nerveux, dans les animaux vertébrés. 1st ed, Paris, Chez Crevot. https://books.google.com/books?id=b-NiqvJXS4UC&q;=flourens+%22Recherches+exp%C3%A9rimentales+Pearce J.M.S. 2009. Marie-Jean-Pierre Flourens (1794-1867) and cortical localization. Eur. Neurol. 61 (5): 311–4. == References == Category:1794 births Category:1867 deaths Category:French neuroscientists Category:Members of the Académie française Category:Foreign Members of the Royal Society Category:Burials at Père Lachaise Cemetery Category:Physiologists",
 "title": "Jean Pierre Flourens"
}