{
 "id": "522314",
 "text": "Solange Pierre or Sonia Pierre, (1963 – December 4, 2011), was a human rights activist in the Dominican Republic. \"A Rights Advocate's Work Divides Dominicans\" by Marc Lacey, The New York Times, September 29, 2007. She worked to end antihaitianismo, which is discrimination against people of Haitian origin either born in Haiti or in the Dominican Republic. For this work, she won the 2006 Robert F. Kennedy Human Rights Award.\"DOMINICAN BORN HAITIAN RIGHTS ACTIVIST WINS 2006 RFK HUMAN RIGHTS AWARD\" Press Release, RFK Memorial Center, accessed Sept. 28, 2007. In 2010 she received the International Women of Courage Award from the United States Department of State. == Life == Pierre was born in Villa Altagracia, San Cristóbal, Dominican Republic, in 1963. Her parents were from Haiti. Her mother came to the Dominican Republic in 1957 with a temporary work permit. Her father came to the Dominican territory illegally). There were twelve children in Pierre's family\"Activist Sonia Pierre Receives RFK Award\" by Andrew Miga, The Associated Press, printed in the Washington Post, Nov. 17, 2006. The family lived in a migrant worker camp. The name of the camp is batey. Many people from Haiti live here. Pierre's birth certificate said her name was Solain Pie. Pierre said that was a mistake by a government clerk.\" On December 4, 2011, Pierre died at the age of 48. She had a heart attack on the way to the hospital in Villa Altagracia. == Work == At the age of 14, Pierre started a protest by sugar cane workers. Pierre went to jail, but the protest received some attention. After the protest, the workers got better tools and more money. \"Dominican-born Sonia Pierre Wins Amnesty International's 2003 Human Rights Award for Working for Her People\" by Tequila Minsky, April 2003, Haitian Support Group website, accessed Sept. 29, 2007. Pierre worked as director of the non-governmental organization Movement for Dominican Women of Haitian Descent (MUDHA). The goal of the group is to stop \"antihaitianism\", or discrimination against people from Haiti in the Dominican Republic. In 2005, Pierre went to the Inter-American Court of Human Rights in the case of two ethnic Haitian children who did not receive Dominican birth certificates. The name of the case was Yean and Bosico v. Dominican Republic. The court told the Dominican government to give birth certificates to the children. However, later, the Dominican Supreme Court later said the Haitian workers were 'in transit,' so their children could not be citizens. \" == Awards == * For her work, Pierre received the 2006 Robert F. Kennedy Human Rights Award from Senator Edward Kennedy. * Pierre also received Amnesty International's 2003 Human Rights Ginetta Sagan Fund Award. * She and MUDHA were nominated for the UNESCO Prize for Human Rights Education in 2002.\"Interview: Solange Pierre, focusing on Dominican-Haitian immigration\" by Charles Arthur, Latin American Press, Oct 16, 2002. * In 2008, she received the Giuseppe Motta Meda] for working for human rights.http://motta.gidd.eu.org/#!medal-winners-2008/cypa Giuseppe Motta Medal Website * She was also honored by the United States Department of State with a 2010 International Women of Courage Award. == References == == Other websites == * 2010 International Women of Courage Awards, U.S. State Department photostream on Flickr *Secretary's International Women of Courage Award (U.S. Department of State) Category:Women who received the International Women of Courage Award Category:Human rights activists Category:Haitian people Category:1963 births Category:2011 deaths",
 "title": "Sonia Pierre"
}