{
 "id": "522672",
 "text": "The Nuremberg principles were a set of guidelines for determining what constitutes a war crime. The document was created by the International Law Commission of the United Nations to codify the legal principles underlying the Nuremberg Trials of Nazi party members following World War II. == The principles == === Principle I === \"Any person who commits an act which constitutes a crime under international law is responsible therefor and liable to punishment.\" === Principle II === \"The fact that internal law does not impose a penalty for an act which constitutes a crime under international law does not relieve the person who committed the act from responsibility under international law.\" === Principle III === \"The fact that a person who committed an act which constitutes a crime under international law acted as Head of State or responsible government official does not relieve him from responsibility under international law.\" === Principle IV === \"The fact that a person acted pursuant to (an) order of his government or of a superior does not relieve him from responsibility under international law, provided a moral choice was in fact possible to him\". Before the time of the Nuremberg Trials, this defense was called \"Superior Orders\".Transitional Justice: How Emerging Democracies Reckon with Former , ed. Neil J. Kritz (Washington, DC: United States Institute of Peace Press, 1995), p. 16 After the Nuremberg Trials, that defense is now referred to by many as the \"Nuremberg Defense\".Orie L. Philips; Eberhard P. Deutsch, 'Pitfalls of the Genocide Convention', American Bar Association Journal, Vol 56 (July 1970), p. 644 More recently a third term, \"lawful orders\", has been used for the same defense. === Principle V === \"Any person charged with a crime under international law has the right to a fair trial on the facts and law.\" === Principle VI === \"The crimes hereinafter set out are punishable as crimes under international law: :(a) Crimes against peace: ::(i) Planning, preparation, initiation or waging of a war of aggression or a war in violation of international treaties, agreements or assurances; ::(ii) Participation in a common plan or conspiracy for the accomplishment of any of the acts mentioned under (i). :(b) War crimes: :Violations of the laws or customs of war which include, but are not limited to, murder, ill-treatment or deportation to slave labor or for any other purpose of civilian population of or in occupied territory; murder or ill- treatment of prisoners of war or persons on the Seas, killing of hostages, plunder of public or private property, wanton destruction of cities, towns, or villages, or devastation not justified by military necessity. :(c) Crimes against humanity: :Murder, extermination, enslavement, deportation and other inhumane acts| done against any civilian population, or persecutions on political, racial, or religious grounds, when such acts are done or such persecutions are carried on in execution of or in connection with any crime against peace or any war crime.\" === Principle VII === \"Complicity in the commission of a crime against peace, a war crime, or a crime against humanity as set forth in Principle VI is a crime under international law.\" == Related pages == *Command responsibility *Geneva Conventions *International Criminal Court *International legal theory *Laws of war *London Charter of the International Military Tribunal *Nuremberg Code *Nuremberg Trials *Rule of Law in Armed Conflicts Project *Rule of law *Rule According to Higher Law *Sources of international law == Notes == == References == == Other websites == * NUREMBERG PRINCIPLES * István Deák, Retribution against Heads of State and Prime Ministers Category:International law Category:Nuremberg trials",
 "title": "Nuremberg principles"
}