{
 "id": "522665",
 "text": "Fred Tatasciore (born June 15, 1967) is an American voice actor who has done many voice over works in films, shows and video games. ==Filmography== ===Animation=== List of voice performances in animation Year Series Role Notes Source 1999–15 Family Guy Various voices 2001 Constant Payne Welton Payne- Smythe, Skyjacker #2 2001–06 Invader Zim Various voices 2003–05 What's New, Scooby-Doo? Toxic Terror, additional voices 2004 Harvey Birdman, Attorney at Law Nikos, Lawyer Episode: \"Gone Efficien...t\" 2004 ¡Mucha Lucha! Rudo Claws, Santo Claus, MC Goatlover Episode: \"A Mucha Lucha Christmas\" 2005 Star Wars: Clone Wars Qui-Gon Jinn, Oppo Rancisis Episode: \"Chapter 21\" 2005–07 The Grim Adventures of Billy and Mandy Various voices 2005–14 Robot Chicken Garfield, Jon Arbuckle, William Shatner, James T. Kirk, Mr. T, B.A. Baracus, Sean Connery, Tray-Norr, Spock, Christopher Walken, Dr. McCoy, Scotty, others 2005–15 American Dad! Additional voices 2005 The Buzz on Maggie Little Boy, additional voices 2 episodes 2006 The Emperor's New School Pacha Season one 2006 Avatar: The Last Airbender Yung, the Resistance Leader Ep. \"Return to Omashu\" 2006–08 Ben 10 Ripjaws, Cannonbolt, Way Big, Future Ben, others The Complete Directory to Prime Time Network and Cable TV Shows, Page 1713 by Tim Brooks, Earle Marsh, 2007 2007 The Replacements Venzor the Aliynoc 2007 Tim and Eric Awesome Show, Great Job! Hacky Sack Extreme Announcer (in \"Dads\"), Man in Gibbons Cartoon (in \"Friends\") 2007–09 Back at the Barnyard Farmer 2008 Camp Lazlo Bear 2008 Making Fiends Toupee Fiend 2008–09 Wolverine and the X-Men Beast, Hulk, Juggernaut 2008–10 The Secret Saturdays Zon, Komodo, Munya 2009 Random! Cartoons Mr. Papier 2009 Masha and the Bear Sports Commentator, Santa Claus 2009 Chowder Florentine, Pretzelface, Pig Creature, Beardo, Norm, Tooth King, Bear 2009 Uncharted: Eye of Indra Daniel Pinkerton 2009 The Marvelous Misadventures of Flapjack Additional voices 3 episodes 2009–11 The Cleveland Show Fan #1, Vinnie, 8-Bit Dustin Hoffman, Butterfly, Bill Cosby 2010 Hot Wheels Battle Force 5 Claw'Rok 2010 Pound Puppies Various voices 2010–13 Scooby-Doo! Mystery Incorporated Gluten Monster, A.J. Schwartz, Demon Dog, Phantom 2010 Adventure Time Mannish Man the Manly Minotaur Episode: \"The Enchiridion!\" 2010–11 Ben 10: Ultimate Alien Hammer, Surgeon, Quince, Robot Guard, Strabismus, others 2010–11 Generator Rex NoFace 2010–12 LEGO Hero Factory Thunder, Frantic Citizen, Drilldozer, Witch Doctor (Aldous Witch) 2010 Sym-Bionic Titan Realtor, Beast Soldier, Rebel #1 Episode: \"Neighbors in Disguise\" 2010–13 Planet Sheen Emperor 2010–11 Batman: The Brave and the Bold Mutant Master, Arsenal, Sgt. Rock, Major Force 2010 Fish Hooks Worker, Cabbie Episode: \"Bea Becomes an Adult Fish\" 2010–12 The Avengers: Earth's Mightiest Heroes The Incredible Hulk, Graviton, Mandrill, Yon-Rogg, Thing, Volstagg, Fenris Wolf, Hoarfen, Red Hulk, Griffin, others 2010–12 The Penguins of Madagascar Gus (in \"Work Order and Kanga Management\"), Toy Christmas Tree, Streetcorner Santa #1, Cameraman (in \"The All Nighter Before Christmas\") 2010–13 MAD Various voices 2011–12 Dan Vs. Hippie Captain, various voices 2011–14 Kung Fu Panda: Legends of Awesomeness Master Shifu 2011 Star Wars: The Clone Wars Roos Tarpals Episode: \"Shadow Warriors\" 2012–15 Gravity Falls Pituitor 2012 Thundercats Dobo, Tookit, Dog 2012 Scooby-Doo! Haunted Holidays Santa Claus, Sinister Snowman 2012–present Ultimate Spider-Man Hulk, Phalanx, Karnak, Black Bolt, others 2012 Tron: Uprising Kevin Flynn/CLU 2012–15 Regular Show Muscle Dad 2012 Robot and Monster Punch Morly, various voices 2012–13 Randy Cunningham: 9th Grade Ninja Sundown 2012 Motorcity Antonio, Gang Member Episode: \"Julie and the Amazons\" 2013 Young Justice Slade Wilson/Deathstroke, Ubu 2013–present Teenage Mutant Ninja Turtles Ivan Steranko/Rocksteady, Fungus Humongous, others 2013–present Avengers Assemble Hulk, Thunderball, Volstagg, Ringmaster, Crimson Dynamo, Nightmare Ultron, others 2013 Sanjay and Craig Barfy, others 2013–14 Monsters vs. Aliens Vornicarn, others 2013–14 Mickey Mouse Additional voices 2013–15 Hulk and the Agents of S.M.A.S.H. Hulk, Thunderball (Season 1), Volstagg, Karnak, Hiroim, Xemnu, Wrecker (Season 2), Ghost Rider, others 2013 Phineas and Ferb Hulk, Bango-Ru Guard #1 Ep. \"Mission Marvel\" 2013–15 Wander Over Yonder Lord Dominator (disguised form), Captain Tim, King Draykor, Destructor, others 2013 TripTank Various characters 2014–15 Breadwinners Bread Maker, others 2014 Mixels Major Nixel (Season 1), Nixels, Slumbo, Jawg, Murps (Season 1) 2014 Turbo FAST Orangutan Episode: \"A Tale of Two Turbos/The Escargot Affair\" 2014 BoJack Horseman Additional voices Episode: \"BoJack Horseman: The BoJack Horseman Story, Chapter One\" 2014–15 Penn Zero: Part-Time Hero Additional voices 2014 We Wish You a Merry Walrus Captain Rockhopper 2015 Star vs. the Forces of Evil Buff Frog, Additional voices 2015 Harvey Beaks Monster Episode: \"The Sleepover's Over/Certified Babysitter\" 2015 Fresh Beat Band of Spies Various characters 2015 Vixen Additional voices 2015 Club Penguin: Monster Beach Party Captain Rockhopper 2015 Club Penguin: Halloween Panic! Blooky ===Anime=== List of voice performances in anime Year Series Role Notes Source 2005–06 Naruto Gato 2006 Zatch Bell! Dalmos, Demolt 2007 Afro Samurai Juzo, Patron 5, Shuzo 2008 Slayers Revolution Zanaffar 2010–11, 2014–15 Naruto Shippuden Kakuzu 2011 Marvel Anime: Wolverine Shigen Yoshida 2011 Marvel Anime: X-Men Beast ===Films=== List of voice performances or live- action performances in direct-to-video films, television films and feature films Year Series Role Notes Source 1982 Dragon Lord Additional voices DVD English dub 1983 Project A Additional voices DVD English dub 1986 Born to Defence Additional voices DVD English dub 1992 Swordsman II Additional voices DVD English dub 1993 The Heroic Trio Kau DVD English dub 1993 The Legend Additional voices DVD English dub 1993 The Legend II Additional voices DVD English dub 1994 The Bodyguard from Beijing Additional voices DVD English dub 1994 Fist of Legend Additional voices DVD English dub 1995 The Enforcer Additional voices DVD English dub 1995 High Risk Kong DVD English dub 1996 Iron Monkey 2 Additional voices DVD English dub 1999 Foolish Sammy Davis 1999 American Civ. -1 Grandpa 2000 Project A Additional voices DVD English dub 2002 Backstage with Little Lorenzo Little Lorenzo 2003 Heavy Additional voices 2003 Little Lorenzo Gets Rescued Little Lorenzo 2004 Team America: World Police Samuel L. Jackson 2005 Whole Additional voices 2005 Stewie Griffin: The Untold Story Additional voices 2006 Curious George Additional voices 2006 Ultimate Avengers Hulk, additional voices 2006 The Wild Additional voices 2006 Final Fantasy VII Advent Children Loz English version 2006 The Ant Bully Ant Council Member #2, Ant Council Member #5 2006 Barnyard Farmer 2006 Ultimate Avengers 2 Hulk 2006 Wrestlemaniac El Mascarado 2006 Charlotte's Web Sheep Group 2006 The Invincible Iron Man Mandarin, additional voices 2006 Dead Silence Clown 2006 TMNT General Gato 2006 Meet the Robinsons Additional voices 2007 Camp Lazlo: Where's Lazlo? Big Bear 2007 Garfield Gets Real Billy Bear, Waldo, Eric 2007 Ben 10: Secret of the Omnitrix Cannonbolt, Way Big 2007 Doctor Strange: The Sorcerer Supreme Oliver 2007 Beowulf Additional voices 2007 Enchanted Troll 2008 Dragonlance: Dragons of Autumn Twilight Flint Fireforge, Fewmaster Toede 2008 The Spiderwick Chronicles Goblin Vocals 2008 Her Lion's Jump Fred 2008 Garfield's Fun Fest Billy Bear, Junior Bear 2008 Next Avengers: Heroes of Tomorrow Hulk 2008 Madagascar: Escape 2 Africa Teetsi, Poacher #1, Elephant 2008 Orlando's Joint The Bugman 2009 Hulk Vs Hulk 2009 Garfield's Pet Force Billy Bear, Horned Guard 2009 9 8, Radio Announcer 2009 Bionicle: The Legend Reborn Tuma 2009 The Princess and the Frog Additional voices 2009 Made by Molly Galoot 2010 Curious George 2: Follow That Monkey! Mr. Bloomsberry 2010 Batman: Under the Red Hood Mercenary #1, Amazo, Guard 2010 Alpha and Omega Garn 2010 Tangled Additional voices 2011 All-Star Superman Krull, Robots, Astronaut #2 2011 Hellraiser: Revelations Pinhead, 'Faceless' Steven 2011 Sucker Punch Voice Over Performer 2011 Kung Fu Panda 2 Po's Dad, Gorilla Guard #2 2011 Phineas and Ferb the Movie: Across the 2nd Dimension Additional voices 2011 Scooby-Doo! Legend of the Phantosaur Phantosaur 2011 Batman: Year One Detective Flass 2011 The Outback Cutter 2012 Back to the Sea Fat Seagull 2012 Ben 10: Destroy All Aliens Way Big, Evil Way Big 2012 Top Cat: The Movie Gorilla, Robot 2012 Superman vs. The Elite Perry White 2012 Wreck-It Ralph Additional voices 2012 Dino Time Dr. Santiago 2013 Scooby-Doo! Mask of the Blue Falcon Jack Rabble, Dynomutt II 2013 Jack the Giant Slayer Loop Group 2013 Star Trek Into Darkness Additional voices 2013 Planes Additional voices 2013 Lego Marvel Super Heroes: Maximum Overload Hulk, S.H.I.E.L.D. Sentry 2013 Frozen Additional voices 2013 Iron Man & Hulk: Heroes United Hulk 2014 JLA Adventures: Trapped in Time Lex Luthor 2014 Avengers Confidential: Black Widow & Punisher Hulk, Ren English version 2014 Scooby-Doo! WrestleMania Mystery The Bear 2014 Son of Batman Killer Croc 2014 Planes: Fire & Rescue Additional voices 2014 Road to Ninja: Naruto the Movie Kakuzu English version 2014 Iron Man & Captain America: Heroes United Hulk, S.H.I.E.L.D. Agent 2014 Scooby-Doo! Frankencreepy Frankencreep 2014 The Boxtrolls Additional voices 2014 A Letter to Momo Iwa English version 2015 Scooby-Doo! Moon Monster Madness Hudson Baron, Alien 2015 Jungle Shuffle Cusumba, Chimera 2015 Batman Unlimited: Monster Mayhem Solomon Grundy 2021 Space Jam: A New Legacy Taz ===Video games=== List of voice performances in video games Year Series Role Notes Source 1994 Storybook Weaver Himself, Sneetches, Rick, Mr. Knox, Other Honeybee, Hoobub, Dinosaurs Announcer 2002 X-Men: Next Dimension Magneto, Sabretooth, Juggernaut 2003 X2: Wolverine's Revenge Magneto, Sabretooth, Juggernaut 2003 The Cat in the Hat Quinn 2003 Terminator 3: Rise of the Machines Additional voices 2004 Storybook Weaver Deluxe Himself, Sneetches, Rick, Mr. Knox, Other Honeybee, Hoobub, Dinosaurs Announcer 2004 Jet Li: Rise to Honor Additional voices 2004 Lineage II Male Orc 2004 Van Helsing Valerious 2004 Tales of Symphonia Abyssion 2004 Ghosthunter Warden McCarthy, Priest, Redneck Sniper 2004 The Bard's Tale Additional voices 2004 The SpongeBob SquarePants Movie Dennis, additional voices 2004 Ratchet & Clank: Up Your Arsenal Joe 2004 Spyro: A Hero's Tail Bentley, Wally the Walrus 2004 Vampire: The Masquerade – Bloodlines Hatter, Gargoyle, Tommy 2004 Metal Gear Solid 3: Snake Eater DOD Official 2004 Viewtiful Joe 2 Frost Tiger 2004 The Lord of the Rings: The Battle for Middle-earth Haradrim Warriors 2005 NARC Fish, Weapons Dealer, Thug, Civilian, Eddie Jackson, Cop 2005 God of War Poseidon, Greek Soldier, Fisherman 2005 Twisted Metal: Head-On Sweet Tooth 2005 S.W.A.T. 4 Andrew Taroone, Male Suspect 4, Allen Kruse 2005 Jade Empire Captain Sen, Iron Soldier, Captain Ing, additional voices 2005 Predator: Concrete Jungle Bruno Borgia 2005 Madagascar Darnell the Elephant, Foosa, Sailor #2 2005 Batman Begins Lt. James Gordon 2005 Conker: Live & Reloaded The Squirrels, Squirrel High Command, Tediz 2005 Destroy All Humans! Cop, Navy Admiral, Male Vocalizations 2005 The Incredible Hulk: Ultimate Destruction Additional voices 2005 Scooby- Doo! Unmasked Zen Tuo, Black Knight, Cave Man, Joe Grimm, Chinese Zombie, Circus Strongman, Ho Fong 2005 Tom Clancy's Rainbow Six: Lockdown Additional voices 2005 Evil Dead: Regeneration Deadites, Bloated Corpse, Rail Boss 2005 Dungeons & Dragons: Dragonshard Additional voices 2005 The Matrix: Path of Neo Agent Johnson, Roland, SWAT Soldier 2005 Neopets: The Darkest Faerie King Skarl, Hubert, Torakar, Master Torak 2005 True Crime: New York City Additional voices 2005 Age of Empires III Ivan the Terrible 2006 Marc Eckō's Getting Up: Contents Under Pressure Additional voices 2006 The Lord of the Rings: The Battle for Middle-earth II Haradrim Warriors 2006 Neopets: Petpet Adventures: The Wand of Wishing Werhond 2006 Guild Wars: Factions Baron Mirek Vasburg, additional voices 2006 Over the Hedge Dwayne the Exterminator, Rat #2 2006 Pirates of the Caribbean: The Legend of Jack Sparrow Bosun, Koehler, Spanish Guard 2006 Ninety-Nine Nights Additional voices 2006 Zatch Bell! Mamodo Fury Demolt 2006 Baten Kaitos Origins Baelheit 2006 Just Cause El Presidente Salvador Mendoza 2006 God Hand Felix, Debussy 2006 Destroy All Humans! 2 KGB Agent, Furon General Cyclosparasis, additional voices 2006 Microsoft Flight Simulator X Additional voices 2006 Flushed Away The Toad 2006 Marvel: Ultimate Alliance Mephisto, Ulik, Krang, Thunderball 2006 Nicktoons: Battle for Volcano Island Mawgu 2006 Gears of War Damon Baird, Locust Drone B, Victim #2 Stranded, Berserker 2006 Happy Feet Lovelace, Elder Penguin #2, additional voices 2006 Resistance: Fall of Man Chimera 2007 World of Warcraft: The Burning Crusade Jan'alai, Kil'jaeden 2007 Rogue Galaxy Captain Dorgengoa, Sherio, King Albioth 2007 Ghost Rider Blade, Caretaker 2007 Virtua Fighter 5 Commentator 2007 300: March to Glory Captain, Mardonius, Ephialtes 2007 Tom Clancy's Ghost Recon Advanced Warfighter 2 Additional voices 2007 God of War II Typhon 2007 Fantastic Four: Rise of the Silver Surfer Additional voices 2007 The Darkness Kamikaze Darkling 2007 Transformers: The Game Ratchet, Autobot Drones 2007 BioShock Additional voices 2007 Jeanne d'Arc La Hire 2007 Blue Dragon General Szabo, Elder of Pachess Town, Guard, Soldie 2007 Guild Wars: Eye of the North Ogden Stonehealer 2007 Lair General Atta Kai, Prisoner, Farmer, Burner 2007 Halo 3 Brutes 2007 Spider-Man: Friend or Foe Scorpion, Carnage 2007 Ben 10: Protector of Earth Cannonbolt, Forever Knight 2007 Assassin's Creed Jubair Al-Hakim, Abu'l Nuooud 2007 Uncharted: Drake's Fortune Descendants #1 2007 Unreal Tournament 3 Reward Announcer 2007 Mass Effect Saren Arterius, Balak, additional voices 2007 The Golden Compass Iorek Byrnison 2008 No More Heroes Dr. Shake, Randall Lovikov 2008 Pursuit Force: Extreme Justice Various characters 2008 Lost Odyssey Technician 2008 God of War: Chains of Olympus Atlas, Persian King, Soldier 2008 Iron Man Obediah Stane/Iron Monger, Maggia Soldier, Afghan Soldier, AIM President 2008 Kung Fu Panda Shifu 2008 Ninja Gaiden 2 Marbus, Tengu 2008 The Incredible Hulk Hulk 2008 Metal Gear Solid 4: Guns of the Patriots \"Beast\" Voices of the Beauty and the Beast Unit 2008 Line Rider 2: Unbound Chaz 2008 Lego Batman: The Video Game Bane 2008 Golden Axe: Beast Rider Additional voices 2008 Saints Row 2 Additional voices 2008 Spider-Man: Web of Shadows Rhino 2008 The Legend of Spyro: Dawn of the Dragon Meadow, additional voices 2008 Call of Duty: World at War Nikolai Belinski, Dr. Ludvig Maxis 2008 007: Quantum of Solace Additional voices 2008 Madagascar: Escape 2 Africa Maurice, Zuba 2008 Valkyria Chronicles Largo Potter 2008 Kung Fu Panda: Legendary Warriors Shifu, King Gong, Yak Goon #2 2008 Gears of War 2 Damon Baird, Tai Kaliso, Locust Drone, Boomer 2008 World of Warcraft: Wrath of the Lich King Kologarn, Hodir 2008 Left 4 Dead Infected Sounds, Tank, Boomer 2008 Prince of Persia Mourning King 2009 Skate 2 Additional voices 2009 Warhammer 40,000: Dawn of War II Captain Davian Thule, Eldar Warlock, Araghast the Pillager, Bloodletters, Ulkair the Great Unclean One, Veldoran the Warlock Also in Chaos Rising and Retribution 2009 Eat Lead: the Return of Matt Hazard Tentacle Beast of Tramm, Zombie, Bandit, Employee Suit, Space Marine 2009 Watchmen: The End is Nigh Additional voices 2009 MadWorld Von Twirlenkiller, Shamans, Big Long Driller 2009 Monsters vs. Aliens General W.R. Monger 2009 Ninja Blade Businessman 2009 Company of Heroes: Tales of Valor Wilson, Pilot 2009 X-Men Origins: Wolverine Additional voices 2009 Bionic Commando Grunt1, Overwatch 2009 Terminator Salvation Resistance Soldiers 2009 Prototype Blackwatch Officer 2009 Ghostbusters: The Video Game Additional Voice Talent 2009 Transformers: Revenge of the Fallen Demolishor, Devastator, Grindor, additional voices 2009 Shadow Complex Paramilitaries 2009 Batman: Arkham Asylum Bane, Henchman #2, Carl Todd 2009 Marvel: Ultimate Alliance 2 Hulk, Thing, Carnage 2009 Cloudy with a Chance of Meatballs Tim Lockwood 2009 Halo 3: ODST Brutes 2009 Ninja Gaiden Sigma 2 Marbus, Tengu 2009 Undead Knights Gloucester 2009 Uncharted 2: Among Thieves Guardian, Daniel Pinkerton 2009 Ratchet & Clank Future: A Crack in Time Libra, Agorian #1, Snowball 2009 Dragon Age: Origins Grand Oak, Swiftrunner, Cyrion, Wise Dwarf Male, Lothering Bandit 2009 Call of Duty: Modern Warfare 2 Additional voices 2009 Assassin's Creed II Mario Auditore 2009 Left 4 Dead 2 Infected Sounds, Tank, Boomer 2009 Naruto Shippūden: Clash of Ninja Revolution 3 Kakuzu 2010 Darksiders Charred Council, additional voices 2010 Dark Void Sarpa 2010 Mass Effect 2 Warden Kuril, Maelon, Aresh, additional voices 2010 No More Heroes 2: Desperate Struggle Dr. Letz Shake 2010 Final Fantasy XIII Additional voices 2010 God of War III Ares, Barbarian King, Typhon 2010 Resonance of Fate Additional voices 2010 Naruto Shippuden: Ultimate Ninja Heroes 3 Kakuzu 2010 Prince of Persia: The Forgotten Sands Ratash 2010 Alpha Protocol Henry Leland, Ali Shaheed, Terrorists 2010 Transformers: War for Cybertron Megatron, Ratchet, Omega Supreme, Trypticon, Motormaster 2010 Crackdown 2 Additional voices 2010 Clash of the Titans King Kepheus, King Satyros, Soldiers 2010 StarCraft II: Wings of Liberty Zeratul, Rory Swann, additional voices 2010 Valkyria Chronicles II Largo Potter, Jean Townshend 2010 Spider- Man: Shattered Dimensions Ultimate Carnage 2010 Ben 10 Ultimate Alien: Cosmic Destruction Enhanced Terracotta General, Dragon 2010 Fallout: New Vegas Tabitha, Rhonda 2010 Naruto Shippuden: Ultimate Ninja Storm 2 Kakuzu 2010 Vanquish Daniel Grassi 2010 Star Wars: The Force Unleashed II Riot Trooper, Jumptrooper, additional voices 2010 God of War: Ghost of Sparta King Midas, Lanaeus, Zeus 2010 Call of Duty: Black Ops Nikolai Belinski, Dr. Ludvig Maxis 2010 Assassin's Creed: Brotherhood Mario Auditore 2010 Splatterhouse Miscellaneous Monsters 2010 Tron: Evolution Kevin Flynn/CLU 2011 Marvel vs. Capcom 3: Fate of Two Worlds Hulk 2011 Bulletstorm Skulls, Flytrap 2011 Rango Bad Bill, Zombies, Mr. Timms 2011 Kung Fu Panda 2 Master Shifu 2011 Cartoon Network: Punch Time Explosion Aku, Vilgax 2011 Green Lantern: Rise of the Manhunters Manhunter 2011 Transformers: Dark of the Moon Megatron, Ratchet, Bumblebee, Sideswipe, additional voices 2011 Shadows of the Damned Demons 2011 Resistance 3 Brawler Chimera 2011 Rise of Nightmares Gregor 2011 Gears of War 3 Damon Baird 2011 X-Men: Destiny Juggernaut, additional voices 2011 Spider-Man: Edge of Time J. Jonah Jameson, Atrocity 2011 Skylanders: Spyro's Adventure Additional voices 2011 Batman: Arkham City Bane, Solomon Grundy 2011 Naruto Shippuden: Ultimate Ninja Impact Kakuzu 2011 The Lord of the Rings: War in the North Agandaur 2011 Uncharted 3: Drake's Deception Lt. Draza, Hired Thugs, Brute 2011 Halo: Combat Evolved Anniversary CCS-Class Battlecruiser Truth and Reconciliation Artificial Intelligence, 049 Abject Testament 2011 Kinect Disneyland Adventures Fortune Red 2011 Ultimate Marvel vs. Capcom 3 Hulk 2011 Star Wars: The Old Republic Additional voices 2012 Final Fantasy XIII-2 Additional voices 2012 Syndicate Additional voices 2012 Mass Effect 3 Captain Ka'hairal Balak, General Septimus Oraka, Jorgal Thurak 2012 Naruto Shippuden: Ultimate Ninja Storm Generations Kakuzu, Gato 2012 Kid Icarus: Uprising Magnus, Poseidon 2012 Kinect Star Wars Red 4, Dud Bolt, Sun Guard 2 2012 Prototype 2 Additional voices 2012 Starhawk Rifters, Outcast, Mayor Jonas Clayton, additional voices 2012 Diablo III Monster Voice Effects, additional voices 2012 Madagascar 3: The Video Game Maurice, Animal Control Officers, People of London 2012 Lollipop Chainsaw Additional voices 2012 Lego Batman 2: DC Super Heroes Clayface, Killer Croc, Man-Bat 2012 The Amazing Spider-Man Rhino, additional voices 2012 Kingdom Hearts 3D: Dream Drop Distance Kevin Flynn/CLU 2012 Darksiders II Basileus, Frostbane, Belial, Blackroot, Soul Arbiter, Undead General, Wailing Host 2012 Transformers: Fall of Cybertron Megatron, Ratchet, Metroplex 2012 Guild Wars 2 Mad King Thorn, Ogden Stonehealer, Turai Ossa 2012 World of Warcraft: Mists of Pandaria Xin the Weaponmaster, Rak'gor Bloodrazor, Eitrigg 2012 Resident Evil 6 Enemies 2012 Skylanders: Giants Slam Bam, Zook, Warnado, additional voices 2012 Assassin's Creed III Additional voices 2012 Marvel Avengers: Battle for Earth Hulk, Doctor Doom 2012 Transformers: Prime – The Game Dreadwing, Vehicons 2012 Halo 4 Additional voices 2012 Call of Duty: Black Ops II Dr. Ludvig Maxis, Nikolai Belinski 2012 Epic Mickey 2: The Power of Two Additional voices 2012 Family Guy: Back to the Multiverse Additional voices 2013 Sly Cooper: Thieves in Time Grizz 2013 God of War: Ascension Hades 2013 Starcraft II: Heart of the Swarm Zeratul, Rory Swann, additional voices 2013 Gears of War: Judgment Damon Baird 2013 Naruto Shippuden: Ultimate Ninja Storm 3 Kakuzu, Gyūki 2013 Injustice: Gods Among Us Bane, Solomon Grundy 2013 Fuse Guards 2013 Marvel Heroes Bruce Banner/Hulk, Juggernaut, Blob, Mandarin, Beast 2013 The Last of Us Additional voices 2013 Deadpool Cable, Blockbuster, Earthquaker 2013 Dota 2 Disruptor, Spirit Breaker, Treant Protector, Undying, Ursa, Warlock's Golem 2013 The Wonderful 101 James Shirogane, Chewgi 2013 Skylanders: Swap Force Slam Bam, Zook, Warnado, additional voices 2013 Lego Marvel Super Heroes Bruce Banner/Hulk, Doctor Doom, Beast, Mysterio, Red Hulk, Volstagg 2013 Teenage Mutant Ninja Turtles Dogpound 2013 Ratchet & Clank: Into the Nexus Neftin, Mr. Eye 2013 Knack Morgack 2014 Lightning Returns: Final Fantasy XIII Additional voices 2014 Infamous Second Son Angel, Demon 2014 The Elder Scrolls Online Additional voices 2014 The Amazing Spider-Man 2 J. Jonah Jameson 2014 WildStar Jariel the Archon, Drokk, Megalith 2014 Transformers: Rise of the Dark Spark Megatron 2014 Diablo III: Reaper of Souls Monster Voice Effects, additional voices 2014 The Sims 4 Sim 2014 Destiny City Civilian, Xûr, Ancient Firewall 2014 Naruto Shippuden: Ultimate Ninja Storm Revolution Kakuzu 2014 Disney Infinity: Marvel Super Heroes The Hulk 2014 Middle-earth: Shadow of Mordor Nemesis Orcs 2014 Skylanders: Trap Team Snap Shot, Cuckoo Clocker, Slam Bam, Zook, Warnado 2014 Bayonetta 2 Valiance 2014 Sunset Overdrive Additional voices 2014 Call of Duty: Advanced Warfare Additional voices 2014 Lego Batman 3: Beyond Gotham Solomon Grundy, Black Adam, Black Manta, Killer Croc, Frankenstein 2015 Code Name: S.T.E.A.M. Lion, Narrator 2015 Battlefield Hardline Tony Alpert 2015 Infinite Crisis Doomsday, Gaslight Joker 2015 Mortal Kombat X Torr, Tremor 2015 Lego Jurassic World Additional voices 2015 Batman: Arkham Knight Militia 2015 King's Quest Olfie, Stone Goblin 2015 Disney Infinity 3.0 Hulk, additional voices 2015 Mad Max Abdominous 2015 Skylanders: SuperChargers Snap Shot, Slam Bam, Warnado, Zook 2015 Call of Duty: Black Ops III Nikolai Belinski, Ludvig Maxis 2016 Mighty No. 9 Seismic ===Theme park roles=== * Space Mountain – Safety Narrator * Expedition Everest – Yeti * Star Tours: The Adventures Continue – Gungan Pilot ==References== ==Other websites== * Category:1967 births Category:Living people Category:Actors from New York City Category:American stand-up comedians Category:American voice actors Category:Comedians from New York City",
 "title": "Fred Tatasciore"
}