{
 "id": "52295",
 "text": "The Assyrian genocide was a genocide conducted by the Ottoman Empire's Muslim ruling class and associated Kurdish tribes, where 275,000–300,000 * 2014, p. 142 * 2016, p. 51 * 2017, p. 35 * 2019, p. 11 Assyrians were killed. * * * * * * Bat Ye’or, Islam and Dhimmitude: Where Civilizations Collide (Madison: Fairleigh Dickinson University Press, 2002), p. 169. * * * * ==Etymology== The Assyrians call the Assyrian genocide Sayfo, the Aramaic word for sword. ==Background== ===History of Assyrians=== ====Ancient times==== Since ancient times, during their conquest by the Babylonians, the Assyrians have not have had their own nation and have had a diaspora that has spread over the world to many different countries. ====Ottoman Empire==== The Ottomans oppressed the Assyrians, took away their independence and forced them to assimilate to their empire. Those who have survived keep their common unity, especially in their deep Christian faith. Many Assyrians were considered \"impure\" by the Ottoman Turks and were massacred for refusing to renounce Christianity to become Muslims. Assyrians lost their homes and possessions to the Red Sultan, Abdul Hamid II. Even before the genocide, they had been persecuted and forced to pay high taxes. Most killings happened between 1915 and 1917. ==Assyrian experiences from the Assyrian Voice== ==Events== The genocide was committed against Assyrians within the Ottoman Empire during the First World War by the Young Turks.Aprim, Frederick A. Syriacs: The Continuous Saga, page 40 The Assyrian population of northern Mesopotamia included the Van, Siirt, Tur Abdin and Hakkari regions of present-day southeastern Turkey and the Urmia region of present-day northwestern Iran. The Assyrians were forcibly relocated and massacred by Ottoman and Kurdish forces between 1914 and 1920 under the regime of the Young Turks. Under leadership of Djevdet Bey, the Ottoman governor, at least 55,000 Assyrian Christians were martyred. He is considered responsible for the massacres of Armenians and Assyrians in and around Vilayet of Van province. ==Death toll== Scholars have placed the number of Assyrian victims from 300,000 * The plight of religious minorities: can religious pluralism survive? - Page 51 by United States Congress * The Armenian genocide: wartime radicalization or premeditated continuum - Page 272 edited by Richard Hovannisian * Not even my name: a true story - Page 131 by Thea Halo * The political dictionary of modern Middle East by Agnes G. Korbani. to 750,000. ==Concurrent genocides== The Assyrian genocide took place in the same context and period as the Armenian and Greek genocides. But unlike the last two, no official national or international recognition of the Assyrian genocide has been made, and many accounts discuss the Assyrian genocide only as a part of the larger events subsumed under the Armenian genocide. ==Related pages== * The Holocaust * Bosnian genocide * Assyrian continuity * Rwandan genocide * Cambodian genocide ==Footnotes== ==References== Category:Racism Category:Islamism Category:Genocide Category:World War I Category:Ottoman Empire Category:Genocides in Asia Category:Crimes against humanity Category:History of the Middle East",
 "title": "Assyrian genocide"
}