{
 "id": "522913",
 "text": "Douglas Richard Hurd, Baron Hurd of Westwell (born 8 March 1930) is a British Conservative politician. He served in the governments of Margaret Thatcher and John Major from 1979 to 1995. He was born in the market town of Marlborough in Wiltshire. Hurd first entered Parliament in February 1974 as MP for the Mid Oxfordshire constituency (Witney from 1983). His first government post was as Minister for Europe from 1979 to 1983 (being that office's inaugural holder) and he served in several Cabinet roles since 1984. His jobs include Secretary of State for Northern Ireland (1984–85), Home Secretary (1985–89) and Foreign Secretary (1989–95). He stood unsuccessfully for the Conservative Party leadership in 1990, but retired from frontline politics during a Cabinet reshuffle in 1995. In 1997, Hurd was elevated to the House of Lords and is one of the Conservative Party's most senior elder statesmen. He is a patron of the Tory Reform Group and remains an active figure in public life. ==Other websites== *Hurd's memories of his assignment Beijing in the 1950s *Hurd intervenes in the 2001 General Election campaign on European policy *BBC reports on the findings of Hurd's commission into the role of the Archbishop of Canterbury *An article by Douglas Hurd on peace in the Middle East *Speech by Hurd on Britain and Europe * Daily Telegraph review of Robert Peel, a Biography *Economist Review of \"Robert Peel, a Biography\" *Daily Mail Review of \"Robert Peel, A Biography\" *Patron, Witney History Society Category:1930 births Category:Living people Category:Alumni of the University of Cambridge Category:Secretaries of State for the Home Department Category:Members of the British House of Commons for English constituencies Category:People educated at Eton College Category:People from Wiltshire Category:UK MPs 1974 Category:UK MPs 1974–1979 Category:UK MPs 1979–1983 Category:UK MPs 1983–1987 Category:UK MPs 1987–1992 Category:UK MPs 1992–1997 Category:Secretaries of State for Northern Ireland Category:Conservative Party (UK) MPs Category:Conservative Life Peers",
 "title": "Douglas Hurd"
}