{
 "id": "5230",
 "text": "Gwyneth Kate Paltrow (born September 28, 1972) is an American actress and singer. She was born in Los Angeles, California. Her father was movie director Bruce Paltrow. Her mother is actress Blythe Danner; her parents are second cousins. Her brother is director Jake Paltrow. Her uncle is singer-actor Harry Danner. Her half-cousin is actress Katherine Moennig. She studied Spanish in Talavera of the Queen, Spain. Paltrow married Coldplay singer Chris Martin on December 5, 2003. The couple separated in 2014. They have a daughter, Apple (born May 14, 2004) and son, Moses (born April 8, 2006). Since 2008, she plays Pepper Potts in the Marvel Cinematic Universe which is her most famous role. ==Filmography== Film Title Year Role Notes Shout 1991 Rebecca Hook 1991 Young Wendy Darling Deadly Relations 1993 Carol Ann Fagot Malice 1993 Paula Bell Flesh and Bone 1993 Ginny Mrs. Parker and the Vicious Circle 1994 Paula Hunt Higher Learning 1995 Student Uncredited Jefferson in Paris 1995 Patsy Jefferson Se7en 1995 Tracy Mills Nominated—Saturn Award for Best Supporting Actress Moonlight and Valentino 1995 Lucy Trager Hard Eight 1996 Clementine 1996 Julie DeMarco Emma 1996 Emma Woodhouse Satellite Award for Best Actress – Motion Picture Musical or Comedy Hard Eight 1996 Clementine Out of the Past 1998 Sarah Orne Jewett Voice Sliding Doors 1998 Helen Quilley Florida Film Critics Circle Award for Best Actress (also for Shakespeare in Love) Russian Guild of Film Critics – Best Foreign Actress San Diego Film Critics Society Award for Best Actress (also for Shakespeare in Love) Great Expectations 1998 Estella Hush 1998 Helen Baring 1998 Emily Bradford Taylor Blockbuster Entertainment Award for Favorite Actress Shakespeare in Love 1998 Viola De Lesseps Academy Award for Best Actress Empire Award for Best Actress Florida Film Critics Circle Award for Best Actress (also for Sliding Doors) Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Kansas City Film Critics Circle Award for Best Actress Las Vegas Film Critics Society Award for Best Actress MTV Movie Award for Best Kiss (shared with Joseph Fiennes) San Diego Film Critics Society Award for Best Actress (also for Sliding Doors) Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role – Motion Picture Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Nominated—BAFTA Award for Best Actress in a Leading Role Nominated—Blockbuster Entertainment Award for Favorite Actress Nominated—Chicago Film Critics Association Award for Best Actress Nominated—MTV Movie Award for Best Female Performance Nominated—Online Film Critics Society Award for Best Actress Nominated—Satellite Award for Best Actress – Motion Picture Musical or Comedy Nominated—Teen Choice Award for Choice Actress Nominated—Teen Choice Award for Sexiest Love Scene (shared with Joseph Fiennes) 1999 Marge Sherwood Nominated—Blockbuster Entertainment Award for Favorite Actress 2000 Herself Uncredited Duets 2000 Liv Bounce 2000 Abby Janello Blockbuster Entertainment Award for Favorite Actress Nominated—MTV Movie Award for Best Kiss (shared with Ben Affleck) 2001 Skye Davidson 2001 Margot Tenenbaum Nominated—Phoenix Film Critics Society Award for Best Cast Nominated—Satellite Award for Best Actress – Motion Picture Musical or Comedy Shallow Hal 2001 Rosemary Shanahan Nominated—Teen Choice Award for Choice Actress Searching for Debra Winger 2002 Herself Documentary Austin Powers in Goldmember 2002 Gwyneth Paltrow as Dixie Normous in 'Austinpussy' Possession 2002 Maud Bailey View from the Top 2003 Donna Jensen Sylvia 2003 Sylvia Plath Sky Captain and the World of Tomorrow 2004 Polly Perkins Nominated—MTV Movie Award for Best Kiss (shared with Jude Law) Proof 2005 Catherine Nominated—Golden Globe Award for Best Actress – Motion Picture Drama Infamous 2006 Kitty Dean Love and Other Disasters 2006 Hollywood Jacks Cameo appearance Running with Scissors 2006 Hope Finch 2007 Dora Iron Man 2008 Virginia \"Pepper\" Potts Nominated—Saturn Award for Best Actress Nominated—Teen Choice Award for Choice Actress Two Lovers 2008 Michelle Nominated—Independent Spirit Award for Best Lead Female Iron Man 2 2010 Virginia \"Pepper\" Potts Nominated—Teen Choice Award for Choice Science Fiction Actress Nominated—Scream Award for Best Science Fiction Actress Country Strong 2010 Kelly Canter Contagion 2011 Beth Emhoff Post-production Glee: The 3D Concert Movie 2011 Herself/Holly Holiday The Avengers 2012 Virginia \"Pepper\" Potts Cameo appearance Iron Man 3 2013 Pepper Potts Television Title Year Role Notes Saturday Night Live 1999 Host Hosted episodes in 1999, 2001, and 2011 Spain... on the road Again 2008 Herself 2010 Herself Glee 2010–present Holly Holliday Pending—Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series (2011) Season 2 Episode 7 \"The Substitute\" Season 2 Episode 15 \"Sexy\" Season 2 Episode 17 \"A Night Of Neglect\" Who Do You Think You Are? 2011 Herself Season 2 Episode 6 \"Gwyneth Paltrow\" ==Discography== ===Singles=== Single Year Peak chart positions Certifications (sales threshold) Album US US AC US Country AUS NZ UK \"Cruisin' (with Huey Lewis) 2000 — 1 — 1 1 — * AUS: 2× Platinum Duets \"Bette Davis Eyes\" — — — 3 — — * AUS: Platinum \"Country Strong\" 2010 81 — 30 — — — Country Strong \"Me and Tennessee\" (with Tim McGraw) 2011 — — 34 — — 63 \"—\" denotes releases that did not chart ===Featured singles=== Single Year Peak chart positions Album US AUS CAN IRL UK \"Forget You\" (with Glee Cast) 2010 11 24 12 20 31 Glee: The Music, Volume 4 \"Nowadays / Hot Honey Rag\" (with Glee Cast) — — — — — Non-album singles \"Singing in the Rain / Umbrella\" (with Glee Cast) 18 23 20 10 22 \"Do You Wanna Touch Me (Oh Yeah)\" (with Glee Cast) 2011 57 — 63 — 95 Glee: The Music, Volume 5 \"Kiss\" (with Glee Cast) 83 98 80 — — \"Landslide\" (with Glee Cast) 23 38 35 36 52 \"Turning Tables\" (with Glee Cast) 66 — 66 — 75 Glee: The Music, Volume 6 \"—\" denotes releases that did not chart. ===Album appearances=== Song Year Album \"Just My Imagination (Running Away with Me)\" (with Babyface) 2000 Duets \"Shake That Thing\" 2010 Country Strong \"Coming Home\" \"A Fighter\" \"Travis\" \"Somewhere Over The Rainbow\" (with Matthew Morrison) 2011 Matthew Morrison ===Music videos=== Video Year Director \"Country Strong\" 2010 Kristin Barlowe, Christoper Sims \"Me and Tennessee\" (with Tim McGraw) 2011 Roger Pistole ==References== ==Other websites== * * * Gwyneth Paltrow's Newsletter, Goop ==References== Category:Actors from Los Angeles Category:American movie actors Category:American stage actors Category:American television actors Category:Screen Actors Guild Award winners Category:1972 births Category:Living people",
 "title": "Gwyneth Paltrow"
}