{
 "id": "523033",
 "text": "Mail, or chain mail,\"chain mail\" Cambridge dictionaries online is a type of armour. It is made of small metal rings linked together in a pattern to form a mesh. The Celts are usually credited with inventing mail armour.Hazel Richardson, Life of the Ancient Celts (New York: Crabtree Publishing Co., 2005), p. 28 Celtic mail was usually made in the form of a vest. ==Etymology== The origins* of the word \"mail\" are not fully known. One theory is that it originally comes from the Latin word macula, meaning \"spot\" or \"opacity\".\"mail, n.3\". OED Online. December 2011. Oxford University Press. Another theory relates the word to the Old French \"maillier\", meaning “to hammer” (related to the modern English word \"malleable\"). A mail shirt is a called a hauberk (haubergeon or byrnie). Mail leggings were called chausses. A mail Hood is called a coif and covered the head, neck and shoulders. *Another possible source is Italian. The word for jersey or sweater, and sometimes shirt, in modern Italian is maglia or, in French, maillot. == History == Many scholars think mail was invented by ancient Celts about the 3rd century BC.Richard A. Gabriel, The Great Armies of Antiquity (Westport, CT: Praeger, 2002), p. 21 At that time their iron work was probably the best in Europe.Richard A. Gabriel, The Ancient World (Westport, CT: Greenwood Press, 2006), p. 79 The Romans quickly adopted it for their own army. A shirt of mail armour weighed about . After a battle it was common practice to strip weapons and armour from the dead.Encyclopedia of Military Science, ed. G. Kurt Piehler (Thousand Oaks, CA: SAGE Publications, Inc., 2013). p. 270 Vikings were known to wear mail armor whenever they could get their hands on it. Mail was expensive, time-consuming to make, and required a supply of iron. It became more expensive as improvements were made in materials and workmanship.Ballistic Materials and Penetration Mechanics, ed. Roy Laible (Amsterdam; New York: Elsevier Scientific Pub. Co., 1980), p. 16 Mail armour was in use in Europe until the 15th century.Michèle Byam, Arms and Armor (New York, NY: DK Publishers, 2011), p. 24 == Modern uses == Mail is today used in gloves to prevent cuts by butchers and firefighters.Gavriel Salvendy, Handbook of Human Factors and Ergonomics (Hoboken, NJ: Wiley, 2012), p. 904 Some divers wear mail suits when swimming around sharks and particularly when feeding sharks.Catherine Veitch, A Daredevil's Guide to Swimming with Sharks (North Mankato, MN: Capstone Press, 2013), p. 25 But mail is heavy and it makes moving around more difficult. Mail is very popular with history reenactors.Michael A. Cramer, Medieval Fantasy as Performance: The Society for Creative Anachronism and the Current Middle Ages (Lanham, MD: Scarecrow Press, 2010). p. 123 It is also popular in live action role playing.Lizzie Stark, Leaving Mundania: Inside the Transformative World of Live Action Role-Playing Games (Chicago: Chicago Review Press, 2012), p. 113 == Gallery == File:Verschiedene Kettenhemden.jpg|. File:Bayeux haubert.JPG|. File:Woman wearing chainmail.jpg|. File:Neptunic shark suit 1.jpg|Shark-protective mail suit File:Messe Slow Food 2012 by-RaBoe-219.jpg|Modern cut resistant glove ==References== Category:Armour",
 "title": "Chain mail"
}