{
 "id": "523095",
 "text": "Stabat Mater Dolorosa, often referred to as Stabat Mater, is a 13th-century Catholic hymn to Mary. It has been attributed to the Franciscan Jacopone da Todi and to Innocent III. It is about the Sorrows of Mary.Sabatier, Paul Life of St. Francis Assisi Charles Scribner Press, NY, 1919, page 286The seven great hymns of the Mediaeval Church by Charles Cooper Nott 1868 ASIN: B003KCW2LA page 96p. 574, Alighieri, Durling, Martinez (2003) Dante, Robert M., Ronald L. Oxford The Divine Comedy of Dante Alighieri: Purgatorio Volume 2 of The Divine Comedy of Dante Alighieri Oxford University Press. \"The Stabat Mater by the Franciscan Jacopone da Todi.\" Like so many other hymns the name of the hymn is made of the first few words. This is called an incipit. The first line reads Stabat mater dolorosa (\"The sorrowful mother stood\").Stabat Mater, Volume 68 by Girolamo Abos, Joseph Vella Bondin 2003 page xviii The Stabat Mater hymn is about the suffering of Mary, Jesus Christ's mother, during his crucifixion. It is sung at the liturgy on the memorial of Our Lady of Sorrows. The Stabat Mater has been set to music by many composers, among them Palestrina, Pergolesi, Alessandro Scarlatti and Domenico Scarlatti, Vivaldi, Haydn, Rossini, Dvořák, George Henschel, Karol Szymanowski, Poulenc and Arvo Pärt. The hymn was very popular all across Europe, especially with the mendicant orders. Pope Benedict XIII finally extended it to the whole of the Roman Rite in 1727. The commemoration of Our Lady of Sorrows was eventually fixed to September 15, the day after the Exaltation of the Cross on September 14, where it is found in both the 1962 Missale Romanum and the 1969 missal of Paul VI and its subsequent editions. There is also a different melody for the same text in the Roman Breviary: \"In the Roman liturgical tradition, it is sung as a hymn in the Divine Office in one melody of the sixth Gregorian mode, and in another of the second mode as a Sequence at Mass, between the Alleluia and the Gospel.\" == References == Category:Christian hymns",
 "title": "Stabat mater"
}