{
 "id": "523210",
 "text": "In Square Circle is the twentieth studio album by American singer-songwriter Stevie Wonder. It was released on September 13, 1985 by Tamla. It is his first studio since 1980's Hotter Than July. ==Track listing== All songs written, produced and arranged by Stevie Wonder. ;Side one #\"Part-Time Lover\" – 4:09 #*Stevie Wonder – lead vocal, synthesizers, drums #*Luther Vandross – lead vocal, background vocal #*Syreeta Wright – background vocal #*Philip Bailey - background vocal #*Keith John - background vocal #*Melody McCully, Billy Durham, Peter Byrne, Renee Hardaway, Darryl Phinnessee - background vocal #\"I Love You Too Much\" – 5:30 #*Stevie Wonder – lead vocal, background vocal, synthesizers, drums, percussion #\"Whereabouts\" – 4:17 #*Stevie Wonder – lead vocal, synthesizers, drums, percussion #*Keith John - background vocal #*Darryl Phinnessee - background vocal #*Deniece Williams - background vocal #*Howard Smith - background vocal #\"Stranger on the Shore of Love\" – 5:01 #*Stevie Wonder – lead vocal, background vocal, synthesizers, drums, harpsichord, accordion #\"Never in Your Sun\" – 4:07 #*Stevie Wonder – lead vocal, background vocal, synthesizers, drums, percussion, harmonica ;Side two #\"Spiritual Walkers\" – 5:12 #*Stevie Wonder – lead vocal, Yamaha CS-80 synthesizer, drums, percussion #*Edwin Birdsong - Yamaha CS-80 synthesizer #*Larry Gittens - trumpet #*Bob Malach - saxophone #*Janice Moore, Cheta Akins, Carolyn Garrett, Ruthell Holmes, Kay Gibbs, Valencia Cox - background vocal #\"Land of La La\" – 5:14 #*Stevie Wonder – lead vocal, background vocal, synthesizers, electric piano, percussion, drums #*Ben Bridges – guitar #*Rick Zunigar - guitar #*Renee Hardaway - background vocal #\"Go Home\" – 5:18 #*Stevie Wonder – lead vocal, background vocal, synthesizers, drums, vocoder #*Bob Malach – saxophone #*Larry Gittens - trumpet #\"Overjoyed\" – 3:42 #*Stevie Wonder – lead vocal, background vocal, acoustic piano, environmental percussion (incl.: crickets, bird sounds, ocean, pebbles in pond, stone dropped, crushing leaves), Yamaha CS-80 synthesizer #*Earl Klugh - guitar #*Paul Riser - string arrangement #\"It's Wrong (Apartheid)\" – 6:52 #*Stevie Wonder – lead vocal, synthesizers, drums, percussion, kora #*Musa Dludla, Thandeka Ngono-Raasch, Linda Bottoman-Tshabalala, Muntu Myuyana, Lorraine Mahlangu-Richards, Fana Kekana, Tsepo Mokone - background vocal ==References== Category:1985 albums Category:R&B; albums Category:Soul albums Category:Funk albums",
 "title": "In Square Circle"
}