{
 "id": "523202",
 "text": "Stevie Wonder's Original Musiquarium I is a greatest hits album by American musician Stevie Wonder. It was released on May 4, 1982 by Tamla. It is Wonder's second greatest hits album as his first one Looking Back had been released five years before it. ==Track listing and personnel== All songs written by Stevie Wonder except \"Front Line\" by Wonder and Gary Byrd. Arrangements and all vocals and instruments by Wonder except as indicated. ===Side one=== #\"Superstition\" (from Talking Book) — 4:25 #* Trevor Laurence - saxophone; Steve Madaio - trumpet #\"You Haven't Done Nothin'\" (from Fulfillingness' First Finale) — 3:29 #* Reggie McBride - bass; The Jackson 5 - vocals #\"Living for the City\" (different version as the one from Innervisions) — 7:26 #\"Front Line\" — 5:52 #* Benjamin Bridges - electric guitar; Nathan Watts - bass ===Side two=== #\"Superwoman (Where Were You When I Needed You)\" (from Music of My Mind) — 7:57 #* Buzzy Feiten - electric guitar #\"Send One Your Love\" (from Stevie Wonder's Journey through the Secret Life of Plants) — 4:02 #* Benjamin Bridges, Rick Zunigar - electric guitar #\"You Are the Sunshine of My Life\" (single version; original version from Talking Book) — 2:51 #* Gloria Barley, Lani Groves, Jim Gilstrap - vocals; Scott Edwards - bass; Daniel Ben Zebulon - congas #\"Ribbon in the Sky\" — 5:35 #* Benjamin Bridges - acoustic guitar ===Side three=== #\"Higher Ground\" (from Innervisions) — 3:46 #\"Sir Duke\" (from Songs in the Key of Life) — 3:52 #* Steve Madaio, Raymond Maldonado - trumpets; Trevor Laurence, Hank Redd - saxophones; Michael Sembello - lead guitar; Benjamin Bridges - rhythm guitar; Nathan Watts - bass; Raymond Pounds - drums #\"Master Blaster (Jammin')\" (from Hotter Than July) — 5:08 #* Larry Gittens - trumpet; Trevor Laurence - saxophone; Isaiah Sanders - organ; Benjamin Bridges, Rick Zunigar - electric guitars; Nathan Watts - bass; Dennis Davis - drums; Earl DeRouen - percussion; Shirley Brewer, Alexandra Brown Evans, Marva Holcom, Angela Winbush - vocals #\"Boogie On Reggae Woman\" (with intro not included on Fulfillingness' First Finale) — 4:55 #* Rocky Dzidzornu] - congas #\"That Girl\" — 5:15 ===Side four=== #\"I Wish\" (from Songs in the Key of Life) — 4:12 #* Steve Madaio, Raymond Maldonado - trumpets; Trevor Laurence, Hank Redd - saxophones; Nathan Watts - bass; Raymond Pounds - drums; Renee Hardaway - vocals #\"Isn't She Lovely\" (from Songs in the Key of Life) — 6:32 #* Greg Phillinganes - keyboards; Brenda Barrett, Shirley Brewer, Colleen Carleton, Carole Cole, Nelson Hayes, Dave Henson, Artece May, Edna Orso, Josette Valentino - handclaps #\"Do I Do\" — 10:27 #* Clifton Anderson, Robert Eldgridge, Eugene Ghee, Larry Gittens, Virgil Jones, Earl McIntyre, J.D. Parran, Victor Paz, Janice Robinson, Robert Rutledge, Anthony Tooley, Frank Wess, Alfred Wilson, Britt Woodman, Lorenzo Wyche - horns; Dizzy Gillespie - trumpet; Isaiah Sanders - fender rhodes; Benjamin Bridges, Rick Zunigar - electric guitars; Nathan Watts - bass; Dennis Davis - drums; Earl DeRouen - percussion; Wendy Barnes, Shirley Brewer, Alexandra Brown, Melody McCully - vocals; Paul Riser - string section arrangements ==References== Category:1982 albums Category:Greatest hits albums Category:R&B; albums Category:Soul albums Category:Funk albums",
 "title": "Stevie Wonder's Original Musiquarium"
}