{
 "id": "523441",
 "text": "Edward Walter \"Ed\" Gillespie (born August 1, 1961) is an American Republican politician. He served as the 61st Chairman of the Republican National Committee and Counselor to the President during George W. Bush's administration. Gillespie, along with Democrat Jack Quinn, founded Quinn Gillespie & Associates, a bipartisan lobbying firm. In January 2014, Gillespie announced he was running for Virginia's U.S. Senate seat currently held by Mark Warner in the 2014 election, and on June 7, 2014, he received the Republican nomination.At GOP convention in Roanoke, Republicans pick Gillespie to face Warner in Senate race In October 2015, Gillespie announced his plans to run for Governor of Virginia in 2017.https://www.washingtonpost.com/local/virginia-politics/gillespie- confirms-he-is-running-for-va- governor/2015/10/02/26a6d3f2-6912-11e5-9223-70cb36460919_story.html In June 2017, he became the Republican Party's candidate for governor in Virginia's 2017 election, facing Democratic nominee Ralph Northam who later won the election. ==References== ==Other websites== * Official Senate Campaign Website * Quinn & Gillespie * * Chris Oakes, \"Selling America on Crypto,\" Wired, March 4, 1998. * The United States Needs a Clear and Realistic Encryption Policy , Statement of Edward Gillespie, executive director, Americans for Computer Privacy, March 4, 1999. * Jim VandeHei, \"Bush Policies Ease Transition For Aides Into Lobbyist Jobs,\" Wall Street Journal, March 19, 2001. https://web.archive.org/web/20030226013426/http://www.counterpunch.org/pipermail/counterpunch- list/2001-March/007364.html * Ryan Lizza, \"The Insider,\" New Republic, June 19, 2001. https://web.archive.org/web/20021030041000/http://www.tnr.com/073001/lizza073001_print.html * A look at the 2004 presidential field , CNN.com, January 1, 2003: Ed Gillespie joined \"Crossfire\" hosts James Carville and Tucker Carlson. * Robert Novak, \"Bush on the Hill ,\" Creators Syndicate, May 24, 2003. * Mike Allen, \"Bush Picks Campaign Chief, RNC Chairman ,\" Washington Post, June 17, 2003. * Elisabeth Bumiller, \"Fierce Defender of President to Lead Campaign for Court\", New York Times, July 6, 2005. * Thomas B. Edsall, \"Lobbyist to Campaign For Bush Court Nominee: Gillespie Choice Marks Bid to Use GOP Muscle\", Washington Post, July 8, 2005. * Category:1961 births Category:Living people Category:American lobbyists Category:American Roman Catholics Category:Politicians from New Jersey Category:Politicians from Virginia Category:Republican Party (United States) politicians",
 "title": "Ed Gillespie"
}