{
 "id": "52361",
 "text": "{{Infobox settlement | official_name = Auvergne | native_name = / | native_name_lang = | settlement_type = Region of France | image_skyline = | image_caption = | image_flag = Flag of Auvergne.svg | flag_size = 120px | image_shield = Blason de l'Auvergne.svg | shield_size = | image_blank_emblem = | blank_emblem_size = 75px | image_map = Auvergne in France.svg | map_caption = | motto = | coordinates = | subdivision_type = Country | subdivision_name = | extinct_title = Dissolved | extinct_date = 1 January 2016 | seat_type = Prefecture | seat = Clermont-Ferrand | parts_type = Departments | parts_style = list | parts = 4 | p1 = Allier | p2 = Cantal | p3 = Haute-Loire | p4 = Puy-de-Dôme | leader_party = PS | leader_title = President | leader_name = René Souchon | area_footnotes = | area_total_km2 = 26013 | area_land_km2 = | area_water_km2 = | population_footnotes = | population_total = 1357668 | population_as_of = 2013-01-01 | population_density_km2 = auto | population_demonym = | timezone1 = CET | utc_offset1 = +1 | timezone1_DST = CEST | utc_offset1_DST = +2 | blank_name_sec1 = GDP (2012) | blank_info_sec1 = Ranked 19th | blank1_name_sec1 = Total | blank1_info_sec1 = €33.8 billion (US$47.29 bn) | blank2_name_sec1 = Per capita | blank2_info_sec1 = €24,920 (US$34,868) | blank_name_sec2 = NUTS Region | blank_info_sec2 = FR7 | website = auvergne.fr | iso_code = FR-C | footnotes = }} Auvergne () is a former administrative region of France. It is now part of the administrative region of Auvergne-Rhône-Alpes. It is in the Massif Central in south-central France. The inhabitants of the region are known as Auvergnats. The four departments in Auvergne were Allier, Cantal, Haute-Loire, and Puy-de-Dôme. Its capital was Clermont-Ferrand. ==History== The region of Auvergne was named after the Arverni, one of the most powerful Gallic tribes. The administrative region of Auvergne was formed with the territory of the old province of Auvergne, most of the territory of the Bourbonnais and small parts of Languedoc and Lyonnais. During World War II, Vichy (a city in the department of Allier) was the headquarters of the government of the French State. ==Geography== The Auvergne region has an area of , 4.8% of France's total surface area. It was surrounded by six other former regions: Burgundy to the northeast, Rhône-Alpes to the east and to the southeast, Languedoc-Roussillon to the south, Midi-Pyrénées to the southwest, Limousin to the west and Centre-Val de Loire to the northwest. The landscape of the region varies greatly, with valleys, mountain, meadows and forests. Much of the regions is in the Massif Central, a high region in south-central France with mountains and plateaus. There are many dormant volcanoes (volcanoes that are not active) in Auvergne, mainly in the Monts Dore and in the Chaîne des Puys. The highest point in Auvergne is the Puy de Sancy (), at high. The northern part of the region (in the Allier department) is a land of small hills cut in two parts by a plain, the valley of the Allier river. Auvergne has about 50 freshwater ponds and lakes. Some are high in the mountains and have volcanic origins. The Guéry Lake is, at high in the Puy-de-Dôme department, the highest lake in Auvergne. The main rivers of the region are the: * Loire, that runs through the Haute-Loire in the southeast and then, after returning from the Rhône-Alpes region, makes the northeastern border of the Allier department; and * Allier, that runs though the centre of the region. ==Departments== The Auvergne region was formed by four departments: Département Préfecture ISO 3166-2 Population (2012) Area (km²) Density (Inh./km²) Allier Moulins FR-03 342,911 7,340 Cantal Aurillac FR-15 147,415 5,726 Haute-Loire Le Puy-en-Velay FR-43 225,686 4,977 Puy-de-Dôme Clermont- Ferrand FR-63 638,092 7,970 ==Demographics== The Auvergne region had a population, in 2012, of 1,354,104, for a population density of inhabitants/km2. The ten main cities in the department are: City Population (2012) Départment Clermont-Ferrand 141,569 Puy-de-Dôme Montluçon 38,072 Allier Aurillac 27,074 Cantal Vichy 25,315 Allier Cournon-d'Auvergne 19,223 Puy-de- Dôme Moulins 18,959 Allier Le Puy-en-Velay 18,599 Haute-Loire Riom 18,484 Puy- de-Dôme Chamalières 17,480 Puy-de-Dôme Issoire 14,296 Puy-de-Dôme ==Economy== The region is predominantly agricultural. Cattle are common and are used both for meat (beef) and for milk, which is made into a number of well-known cheeses such as Bleu d'Auvergne, Cantal, Fourme d'Ambert and Saint-Nectaire. 4 fromages d'auvergne.jpg|Four cheeses from Auvergne: Cantal, Bleu d'Auvergne, Fourme d'Ambert, Saint-Nectaire. The main industry in Auvergne is the tyre industry, represented by Michelin, with headquarters and history in Clermont- Ferrand, and Dunlop in Montluçon. ==Gallery== File:NOYANT Vallée à l'est du village..jpg|Valley to the east of Noyant-d'Allier. File:Vallée de la Maronne, fenaison.jpg|Making hay, Vallée de la Maronne, Cantal. File:France-lac du bouchet.jpg|Bouchet lake, Haute-Loire. File:Lac de Guéry6.JPG|Guéry Lake, Puy- de-Dôme. File:Panorama puy de dome sud.jpg|Panoramic view from the Puy de Dôme. ==References== ==Other websites== * Regional Council of Auvergne official website * Visit Auvergne: Cultural, gastronomic, and literary history of Auvergne * About-France.com: Auvergne guide and tourist attractions Category:Former administrative regions of France *",
 "title": "Auvergne"
}