{
 "id": "5237",
 "text": "Angelina Jolie (pronounced as Djole; née Voight, formerly Jolie Pitt, born June 4, 1975) is an American actress, movie producer, screenwriter, and author. She began acting at about 12 years old, and since then has starred in many movies. She is the daughter of Jon Voight, who is also an actor and former actress/model Marcheline Bertrand. Her full name is Angelina Jolie Voight, but she decided to go by Angelina Jolie. She grew up in Los Angeles and attended the Lee Strasberg Theatre Institute. ==Early life== She was born in Los Angeles, California. She is the daughter of actors Jon Voight and Marcheline Bertrand. She is the sister of actor James Haven, niece of singer- songwriter Chip Taylor, and goddaughter of actors Jacqueline Bisset and Maximilian Schell. On her father's side, Jolie is of German and Slovak descent,Reitwiesner, William Addams. \"Ancestry of Angelina Jolie\". William Addams Reitwiesner Genealogical Services. Retrieved January 8, 2014.\"Is Jon Voight Slovak?\" . University of Pittsburgh. Retrieved January 8, 2014. and on her mother's side, she is of primarily French, Canadian, Dutch, and German ancestry. Like her mother, Jolie has stated that she is part Iroquois,\"Angie overdoes the bad girl act\". The Daily Telegraph. October 2, 2001. Retrieved January 8, 2014. although her only known Native American ancestor was a Huron woman born in 1649. ==Career== Jolie played her first leading role in the 1993 movie Cyborg 2. In 1999 Jolie played Lisa Rowe in Girl, Interrupted. She was awarded an honorary damehood by the British government in 2014 in recognition of her work in preventing sexual violence. She was presented with the award by Queen Elizabeth II. As an American citizen, she cannot be called \"Dame Angelina\", but she can use the letters \"DCMG\" after her name. ==Awards== She won an Academy Award for Best Supporting Actress for her performance in Girl, Interrupted. ==Marriage and family== Jolie self-identifies as bisexual. She has been married to Jonny Lee Miller and Billy Bob Thornton. She has three adopted children. She lives with actor Brad Pitt. Pitt and Angelina are called 'Brangelina' by the media. They have three biological children. On May 27, 2006, Jolie gave birth to a girl, Shiloh. In 2008, she also gave birth to twins, Vivienne Marcheline and Knox Leon.AP. It's a boy and a girl for Jolie and Pitt. MSNBC.com. July 13, 2008. Accessed September 8, 2008. On August 28, 2014, Jolie married Pitt in France. In September 2016, they separated and she filed for divorce. Jolie is currently battling for full custody of her six children. ==Health== She said in May 2013 that she had undergone a preventive double mastectomy after learning she had an 87% risk of getting breast cancer. Jolie has a defective BRCA1 gene resulting in a very high risk of breast cancer and ovarian cancer. Jolie said she might have her ovaries removed to prevent cancer. ==Movies== Title Year Actress Producer Director Writer Role Notes Lookin' to Get Out 1982 Tosh Credited as Angelina Jolie Voight Cyborg 2 1993 Angela & Viril 1993 Short film Alice & Viril 1993 Short film Hackers 1995 Without Evidence 1996 Love Is All There Is 1996 Mojave Moon 1996 Ellie Foxfire 1996 Legs Sadovsky Playing God 1997 Claire Hell's Kitchen 1998 Playing by Heart 1998 Joan Pushing Tin 1999 1999 Girl, Interrupted 1999 Lisa Rowe Gone in 60 Seconds 2000 Lara Croft: Tomb Raider 2001 Original Sin 2001 Life or Something Like It 2002 Lara Croft: Tomb Raider – The Cradle of Life 2003 Beyond Borders 2003 Taking Lives 2004 Shark Tale 2004 Lola (voice) Sky Captain and the World of Tomorrow 2004 The Fever 2004 Revolutionary Cameo Alexander 2004 Olympias Trudell 2005 — Confessions of an Action Star 2005 — Cameo Mr. & Mrs. Smith 2005 2006 Margaret \"Clover\" Russell Wilson A Place in Time 2007 — 2007 Beowulf 2007 Grendel's mother Kung Fu Panda 2008 Master Tigress (voice) Wanted 2008 Fox Changeling 2008 Salt 2010 The Tourist 2010 Kung Fu Panda 2 2011 Master Tigress (voice) Kung Fu Panda: Secrets of the Masters 2011 Master Tigress (voice) In the Land of Blood and Honey 2011 — Difret 2014 — Maleficent 2014 Maleficent Unbroken 2014 — By the Sea 2015 Vanessa Credited as Angelina Jolie Pitt Kung Fu Panda 3 2016 Master Tigress (voice) First They Killed My Father 2017 — The Breadwinner 2017 — Serendipity 2019 — Maleficent: Mistress of Evil 2019 Maleficent The One and Only Ivan 2020 Stella (voice) Post- production The Eternals 2020 Thena Filming Those Who Wish Me Dead 2020 Hannah Faber Post-production Come Away TBA Rose Post-production ==References== ==Other websites== * Category:1975 births Category:Living people Category:American Academy Award winning actors Category:Satellite Award winners Category:Actors from Los Angeles Category:American movie actors Category:Bisexual people Category:LGBT actors Category:LGBT people from California Category:LGBT producers Category:Movie producers from Los Angeles Category:Saturn Award winners Category:People with anorexia",
 "title": "Angelina Jolie"
}