{
 "id": "52376",
 "text": "Languedoc-Roussillon (; ) is a former administrative region of France. It is now part of the administrative region of Occitanie. It is the southernmost region of mainland France and borders to the south with Spain and Andorra. The five departments in the region were Aude, Gard, Hérault, Lozère, and Pyrénées- Orientales. Its capital was Montpellier, the largest city. In French, the name of the inhabitants of the region is Languedocien-Roussillonnais. ==Etymology== The name of the province of Languedoc originates from the language spoken in southern France, langue d'oc, also known as Occitan, and Roussillon, an area in the South of present-day Languedoc-Roussillon. ==Geography== The Languedoc- Roussillon region has an area of . It bordered to the south with Spain and Andorra; to the east is the Mediterranean Sea (the Gulf of Lion). It also bordered four French regions: Midi-Pyrénées to the west, Auvergne and Rhône- Alpes to the north, and Provence-Alpes-Côte d'Azur (PACA) to the northeast. The highest point in Languedoc-Roussillon is Pic Carlit () in the Pyrénées- Orientales department; it is high. ==Departments== The Languedoc-Roussillon region is formed by five departments: Département Préfecture ISO 3166-2 Population (2012) Area (km²) Density (Inh./km²) Aude Carcassonne FR-11 362,339 6,139 Gard Nîmes FR-30 725,618 5,853 Hérault Montpellier FR-34 1,077,627 6,101 Lozère Mende FR-48 76,889 5,167 Pyrénées-Orientales Perpignan FR-66 457,793 4,116 ==Demographics== The Languedoc-Roussillon region has a population, in 2012, of 2,700,266, for a population density of inhabitants/km2. The 10 most important cities in the region are: thumb|360px|Saint-Pierre cathedral, Montpellier City Population (2012) Départment Montpellier 268456 Hérault Nîmes 146,709 Gard Perpignan 120,489 Pyrénées-Orientales Béziers 72,970 Hérault Narbonne 51,869 Aude Carcassonne 47,068 Aude Sète 44,558 Hérault Alès 41,031 Gard Lunel 25,405 Hérault Agde 24,651 Hérault ==Gallery== Vinça, le lac et le Canigou.jpg|Vinça and the Canigou mountain Stlouis2005 7.jpg|Les Joutes de la Saint-Louis 2005, Sète Pontdugard.jpg|Pont du Gard Extérieur de l'Abbaye de Gellone à Saint guilhem le désert.jpg|Saint-Guilhem-le-Désert abbey ==References== ==Other websites== * Regional Council of Languedoc-Roussillon official website * Tourism in Languedoc-Roussillon Category:Former administrative regions of France Category:2015 disestablishments Category:History of France Category:Montpellier Category:Provinces Category:Wine regions of France",
 "title": "Languedoc-Roussillon"
}