{
 "id": "52422",
 "text": "South Yorkshire is a metropolitan county in the Yorkshire and the Humber region of England, in the north. The county was created in 1974 by the Local Government Act 1972Arnold-Baker, C., Local Government Act 1972, (1973) and in 2001 covered an area of 155,205 hectares.Vision of Britain - South Yorkshire area == Divisions and Environs == South Yorkshire is divided into four local government districts; they are the City of Sheffield, the Metropolitan Borough of Doncaster, the Metropolitan Borough of Barnsley and the Metropolitan Borough of Rotherham.Vision of Britain - Components of South Yorkshire The county borders Derbyshire, West Yorkshire, North Yorkshire, East Riding of Yorkshire, Lincolnshire and Nottinghamshire. == History == The main settlements of South Yorkshire developed around the industries of mining and steel manufacturing. The main mining industry was coal which was concentrated to the north and east of the county. There were also iron mines in the area. The rivers running off the Pennines to the west of the county supported the steel industry that is concentrated in the city of Sheffield. South Yorkshire was created as a metropolitan county in 1974, by the Local Government Act 1972, from the southern part of the West Riding of Yorkshire and the former county boroughs of Barnsley, Doncaster, Rotherham and Sheffield. == Economy == South Yorkshire is one of the least prosperous areas in Western Europe. Year Regional Gross Value AddedComponents may not sum to totals due to rounding Agricultureincludes hunting and forestry Industryincludes energy and construction Servicesincludes financial intermediation services indirectly measured 1995 10,453 67 3,690 6,696 2000 13,187 53 4,181 8,954 2003 15,799 57 4,772 10,971 == Towns and villages == === Main settlements === The principal settlements of South Yorkshire are: * Sheffield, an industrial city known for steel and cutlery * Doncaster, an old Roman town known for railways and horse racing; * Rotherham, an industrial town bordering Sheffield on the River Don; * Barnsley, a market town on the River Dearne, the former administrative centre of the metropolitan county. === Urban areas === South Yorkshire is made up of three main urban areas. Dearne Valley is made up of Barnsley and a number of villages and towns. The Sheffield urban area is made up of Sheffield and Rotherham and the Doncaster urban area is Doncaster and surrounding areas. ==== Dearne Valley ==== Area Metropolitan borough Population Barnsley Barnsley 71,599 Conisbrough Doncaster 15,361 Cudworth Barnsley 11,644 Darfield Barnsley 8,066 Darton Barnsley 14,927 Dodworth Barnsley 5,742 Hoyland Nether Barnsley 15,497 Mexborough Doncaster 14,750 Royston Barnsley 9,375 Swinton, South Yorkshire Rotherham 14,643 Wath upon Dearne Rotherham 16,787 Wombwell Barnsley 15,180 Worsbrough Barnsley 9,516 Total population 207,726 [bolton on Dearne] |barnsley | ==== Doncaster ==== Area Metropolitan borough Population Armthorpe Doncaster 12,630 Bentley Doncaster 33,968 Doncaster Doncaster 67,977 Kirk Sandall Doncaster 13,276 Total population 127,851 ==== Sheffield ==== Area Metropolitan borough Population Aughton Rotherham 13,456 Beighton Sheffield 10,676 Chapeltown Sheffield 22,665 Mosborough/Highlane Sheffield 18,585 Rawmarsh Rotherham 18,210 Rotherham Rotherham 117,262 Sheffield Sheffield 439,866 Total population 640,720 === Other towns and villages === Area Metropolitan borough Population Adwick le Street Doncaster 16,142 Anston/Dinnington Rotherham 19,086 Askern Doncaster 5,434 Bawt Doncaster 3,775 Birdwell Barnsley 2,989 Conisbrough Doncaster 15,361 Dinnington Rotherham 1,572 Finningley Doncaster 4,048 Great Houghton Barnsley 2,216 Grimethorpe Barnsley 1,873 Harthill Rotherham 1,728 Hatfield/Stainforth Doncaster 20,232 (13,890/6,342) Maltby Rotherham 11,966 Rossington Doncaster 13,255 Norton Doncaster 2,111 Oughtibridge/Wharncliffe Side Sheffield 4,602 (3,227/1,375) Scholes Rotherham 2,403 Stocksbridge Sheffield 13,316 Thorne/Moorends Doncaster 16,338 Thorpe Hesley Rotherham 4,609 Tickhill Doncaster 5,112 Todwick Rotherham 1,637 Treeton Rotherham 2,514 Thurcroft Rotherham 4,702 Thurnscoe Barnsley 9,122 Wales Rotherham 5,826 Woodsetts Rotherham 1,802 == Places of interest == * Abbeydale Industrial Hamlet, Sheffield * Barnsley Town Hall * Cannon Hall Museum, Park & Gardens, Barnsley * Chapel of Our Lady of Rotherham Bridge (\"Chapel on the Bridge\"), Rotherham * Clifton Park Museum, Rotherham * Conisbrough Castle * Cusworth Hall * Doncaster Mansion House * Kelham Island Museum, Sheffield * Monk Bretton Priory * Sheffield Winter Gardens * Roche Abbey * Rother Valley Country Park * Howden Moors * St Lawrence Church, Adwick le Street * Wentworth Castle & Gardens, Barnsley * Wentworth Woodhouse * Weston Park Museum & Mappin Art Gallery, Sheffield * Woodlands model village * Worsborough Mill and Country Park == Notes == Category:Ceremonial counties of England",
 "title": "South Yorkshire"
}