{
 "id": "52428",
 "text": "The Lake District, also known as The Lakes or Lakeland, is a rural area in north west England. It is a popular vacation area, famous for its lakes and its mountains and its associations with the early 19th century poetry and writings of William Wordsworth and the Lake Poets. It is on a tentative list of UNESCO World Heritage Sites.UNESCO, \"England's Lake District\"; retrieved 2012-4-19. ==History== Lake District National Park (created in 1951) is one of the fifteen National parks in the United Kingdom. ==Geography== The Lake District is about 34 miles (55 km) across (north-to-south or west-to-east). It is entirely within Cumbria, and is one of England's few mountainous regions. All the land in England higher than three thousand feet above sea level is in the Park. ===25 highest fells=== The 25 highest fells (of those given an individual chapter in the Pictorial Guides by Alfred Wainwright) are: # Scafell Pike, 978 m / 3210 ft # Scafell, 965 m / 3162 ft # Helvellyn, 951 m / 3118 ft # Skiddaw, 931 m / 3054 ft # Great End, 910 m / 2986 ft # Bowfell, 902 m / 2960 ft # Great Gable, 899 m / 2949 ft # Pillar, 892 m / 2926 ft # Nethermost Pike, 891 m / 2923 ft # Catstycam, 889 m / 2917 ft # Esk Pike, 885 m / 2903 ft # Raise (Lake District), 883 m / 2896 ft # Fairfield, 873 m / 2863 ft # Blencathra, 868 m / 2847 ft # Skiddaw Little Man, 865 m / 2837 ft # White Side, 863 m / 2831 ft # Crinkle Crags, 859 m / 2818 ft # Dollywaggon Pike, 858 m / 2815 ft # Great Dodd, 857 m / 2807 ft # Grasmoor, 852 m / 2795 ft # Stybarrow Dodd, 843 m / 2772 ft # St Sunday Crag, 841 m / 2759 ft # Scoat Fell, 841 m / 2759 ft # Crag Hill, 839 m / 2753 ft # High Street, 828 m / 2717 ft ===Lakes=== Only one lake in the National Park has the word 'Lake' in its name, namely Bassenthwaite Lake. All the others such as Windermere, Coniston Water, Ullswater and Buttermere use other forms, such as 'mere' and 'water'. The major lakes and reservoirs in the park are given below. The word 'tarn' is a local word used to describe any small lake that may otherwise be called a pond. ==Nomenclature== A number of words/phrases are local to the Lake District and are part of the Cumbrian dialect. These include: *fell - brought to England by Viking invaders and close to modern Norwegian 'Fjell' meaning mountain *tarn - a word that has been taken to mean a small lake in a corrie, it is a local phrase for any small pool of water *Yan Tan Tethera - the name for a system of sheep counting which was traditionally used in the Lake District. Though now rare, it is still used by some and taught in local schools. == Related pages == * List of World Heritage Sites of the United Kingdom * Yorkshire Dales ==References== ==Other websites== *Lake District official website *Lake District Walks *Illustrated Guide to the Lake District ==More reading== *Hollingsworth, S. 'The Geology of the Lake District: a review', Proc. Geologists Assoc., 65 (Part 4) 1954 *Moseley, F. Geology of the Lake District, Yorkshire Geologic Category:Geography of Cumbria Category:World Heritage Sites in the United Kingdom",
 "title": "Lake District"
}