{
 "id": "524625",
 "text": "Religious law comes from the sacred texts of various religions. They cover most parts of personal and contract law. Most religious law systems are either based on Islamic law (Sharia) or Judaic law (Halakha).Marci Hoffman; Mary Rumsey, International and Foreign Legal Research: A Coursebook, Second Edition (Leiden; Boston: Martinus Nijhoff Publishers, 2012), p. 4 Religious laws generally are used in countries that also have other legal systems such as civil or common law. == Comparisons == Religious laws are seen to be eternal and do not change over time. Secular laws (non-religious) can be changed by their lawmakers. Religious laws govern people's behaviors and their beliefs. Secular laws deal with people's actions and how they affect other people. In religious law, disputes are settled by officials of that religion combining the actions of a judge and a priest. In secular systems the judiciary is independent. == Religious legal systems == === Sharia === Sharia deals with many topics, including crime, politics, marriage contracts, trade regulations, religious instructions, and economics. It also covers personal matters such as sexual intercourse, hygiene, diet, prayer, everyday etiquette and fasting. Adherence to sharia is an important part of the Muslim faith. Natana J. DeLong-Bas, Wahhabi Islam: From Revival and Reform to Global Jihad (New York: Oxford University Press, 2004, p. 93 In the strictest sense, sharia is considered in Islam as the infallible law of God.Noel J Coulson, A history of Islamic law (Piscataway, NJ: Transaction Publishers, 2011), p. 4 There are two primary sharia: the Quran, and the Hadiths (opinions and life example of Muhammad). For issues not directly covered in these primary sources, sharia is used. The sources differ between the various sects of Islam (Sunni and Shia are the majority). They also differ by the various jurisprudence schools such as Hanafi, Maliki and Shafi'i.Global issues : selections from CQ Researcher (Washington, DC: CQ Press, 2013), p. 229 === Haleakala === Historically, in the diaspora, halakha served many Jewish communities as both civil and religious law. There was no difference in classical Judaism. Modern religious leaders have come to view the halakha as less binding in day-to-day life. This is because it relies on Rabbinic interpretation instead of the pure, written words written in the Hebrew Bible. Under contemporary Israeli law certain areas of Israeli family and personal law are under the authority of the rabbinic courts. This means they are treated according to halakha. Some differences in halakha itself are found among Ashkenazi, Mizrahi, Sephardi, Yemenite and other Jews who historically lived in isolated communities. == Reference == Category:Types of law",
 "title": "Religious law"
}