{
 "id": "52479",
 "text": "The history of Armenia and Armenians is very ancient and can go back at least 2000 BC. Archaeologists say the Shulaveri-Shomu culture of the central Transcaucasus region, and Armenia today, as the earliest known prehistoric culture in the area, carbon-dated to around 6000 - 4000 BC. But, a newer discovered tomb has been dated to 9000 BC. Another early culture in the Armenian Highlands and surrounding areas—the Kura-Araxes culture is in the period of ca. 4000 - 2200 BC, and is believed to have to go into the Trialeti culture (ca. 2200 - 1500 BC), and meaning Armenians are one of the oldest Indo-European subgroups. == Urartu == Urartu was an ancient kingdom in the Armenian Highlands. Some experts say that the Armenians started as a mixture of the different peoples to move through the area in history: The Hurrians, Urarteans, Luvians and Mushki. This last group, also knowns as Phrygians may have brought their Indo-European language to Armenia. The Armenian language today is Indo-European, but shows a lot of influence from the earlier pre- Indo-European languages, especially Urartean. “Armenians” in Encyclopedia of Indo-European Culture or EIEC, edited by J. P. Mallory and Douglas Q. Adams, published in 1997 by Fitzroy Dearborn. == Ancient period == The Armenians had friendly relations with the Parthian empire.The New Englander - Page 524 by William Lathrop Kingsley The fighting between the Roman Empire and Parthia was centered in Armenia. Armenia was in between Parthian and the Roman Empire. The Armenians had already played a role in the early history of the Roman- Parthian relations. Tigranes put military and political relations with Rome and Parthia on an international legal foundation.Armenian Perspectives - Page 282 by Nicholas Awde The Parthians were allies to Armenians in many times. Many Parthian noble families had moved out and they went to Armenia. In the year 301 AD, the Kingdom of Armenia adopted Christianity as its official state religion and Armenia went through a rapid period of Christianization and throughout the 4th century AD the whole of Armenia was Christianized and the Armenians all became Christian.King of Kings by Gevork NazaryanAufstieg und Niedergang der römischen Welt Page 913 by Wolfgang Haase, Hildegard Temporini == Related pages == *Hayasa-Azzi *Battle of Rhandeia == References == == Other websites == * Armenia at Livius.Org (ancient history) * All about Armenia by www.haias.net * Rulers.org — Armenia list of rulers for Armenia * History of Armenia * A book about the history of Armenia from 1827. It was written by a priest.",
 "title": "History of Armenia"
}