{
 "id": "525388",
 "text": "Ritornello is an Italian word meaning \"little return\".Talbot, Michael. \"Ritornello.\" Grove Music Online. Oxford Music Online. Oxford University Press, accessed December 15, 2015, , http://www.oxfordmusiconline.com/subscriber/article/grove/music/23526. At first in music ritornello was used as an instruction to repeat a part. By the 1600's the word was used to describe a part of the music played by instruments in a vocal piece. These instrumental sections could be at the start (a prelude), in the middle (an interlude), or at the end (a postlude). In dramatic music, the ritornello provided an opportunity for dancing, or for a scene change. In the Baroque period, a common way to write a song, called an aria, was in da capo form. The aria would be written as two contrasting sections, A and B. By adding an instrumental ritornello (R), the aria could be developed further, forming the scheme R–A–R–B–R–A–R. In the early 1700's composers began using the ritornello form in concertos, the solo instrument replacing the voice. This gave the composer the chance to develop music during the solos with new material and key changes, between repeated sections of full orchestra. Guiseppe Torelli began using this form, which was then developed and extended by Antonio Vivaldi. Vivaldi's way of using this form has the following features: *Ritornellos for the full orchestra alternate with sections for the soloist or soloists. *The opening ritornello is composed of several small sections. These are usually two to four bars in length, which may be repeated or varied. These sections can be separated from each other or combined in new ways but are still the ritornello. *When the ritornello is used again, it may be only a part, using only one or some of the sections, sometimes varied. *The ritornellos guide the tonal structure of the music. They establish the new key if the music changes keys. The first and last use of the ritornello is in the tonic. One (usually the first to be in a new key) is in the dominant; and others are in closely related keys. Later composers such as Bach and Telemann used Vivaldi's form in their works. ==References== Category:Musical forms",
 "title": "Ritornello"
}