{
 "id": "526129",
 "text": "Duolingo is a free language-learning program. Its website and mobile apps can be used on iOS, Android, Windows 8 and 10 operating systems. Duolingo allows people to learn over 106 different language courses in 43 languages. ==History== The project was started by Professor Luis von Ahn and graduate student Severin Hacker. The main development language used was Python. == Products and services == === Courses === ==== Language courses ==== Duolingo has 184 language courses teaching 42 languages. Duolingo languages For speakers of Language course Arabic English, French, German, Italian, Spanish, Swedish Bengali English, French, German, Italian, Spanish Chinese (Mandarin) Chinese (Cantonese), English, French, German, Italian, Japanese, Korean, Spanish Czech English, French, German, Italian, Spanish Dutch English, French, German, Italian, Spanish English Arabic, Chinese (Mandarin), Czech, Danish, Dutch, English (Intermediate), Esperanto, Finnish, French, German, Greek, Haitian Creole, Hawaiian, Hebrew, High Valyrian, Hindi, Hungarian, Indonesian, Irish, Italian, Japanese, Klingon, Korean, Latin, Navajo, Norwegian, Polish, Portuguese, Romanian, Russian, Scottish Gaelic, Spanish, Swahili, Swedish, Turkish, Ukrainian, Vietnamese, Welsh, Yiddish, Zulu French English, German, Italian, Portuguese, Spanish German English, French, Italian, Spanish Greek English, French, German, Italian, Spanish Hindi English, French, German, Italian, Spanish Hungarian English, French, German, Italian, Spanish Indonesian English, French, German, Italian, Spanish Italian English, French, German, Spanish Japanese Chinese (Mandarin), English, French, German, Italian, Korean, Spanish Korean English, French, German, Italian, Spanish Polish English, French, German, Italian, Spanish Portuguese English, French, German, Italian, Spanish Romanian English, French, German, Italian, Spanish Russian English, French, German, Italian, Spanish Spanish Catalan, English, French, German, Italian, Portuguese, Russian, Swedish Swedish English, French, German, Italian, Spanish Tagalog English, French, German, Italian, Spanish Tamil English, French, German, Italian, Spanish Telugu English, French, German, Italian, Spanish Thai English, French, German, Italian, Spanish Turkish English, French, German, Italian, Russian, Spanish Ukrainian English, French, German, Italian, Spanish Vietnamese Chinese (Mandarin), English, French, German, Italian, Spanish ==Offices and workforce== Duolingo is headquartered in Pittsburgh, Pennsylvania, and has offices in Seattle, New York, Detroit, Beijing, and Berlin. Duolingo employs around 830 people. == References == ==Other websites== * Category:American websites Category:Learning",
 "title": "Duolingo"
}