{
 "id": "526417",
 "text": "Fetal alcohol syndrome (FAS) is a group of mental and physical problems that can happen when a mother drinks alcohol while she is pregnant. A \"syndrome\" is a group of symptoms. \"Fetal\" means anything that has to do with a fetus. Fetal alcohol syndrome includes ways a fetus is hurt by alcohol while it is still in its mother's womb. ==Cause== Fetal alcohol syndrome is caused by a mother drinking alcohol while she is pregnant. When a mother drinks while she is pregnant, the alcohol goes through the umbilical cord to the fetus. This is why doctors say \"when a [pregnant] woman drinks alcohol, so does her baby.\" Alcohol is poisonous to a fetus and can cause brain damage. This can cause many other problems once the baby is born. Alcohol can cause problems with the way the fetus develops at any time during a pregnancy. This includes the earliest part of pregnancy, when the mother might not even know she is pregnant. A fetus is most likely to develop fetal alcohol syndrome if its mother: * Binge drinks (has four or more drinks in a short time), even once; and/or * Drinks a lot, regularly It does not matter whether the mother drinks beer, wine, vodka, tequila, hard liquor, or any other kind of alcohol. One kind is not safer than any other. They are all equally likely to cause FAS. ==Diagnosis== To be diagnosed with fetal alcohol syndrome, a child must have problems in three different areas. ===Abnormal facial features=== Having \"abnormal facial features\" means that parts of the child's face look different than a child without FAS. To be diagnosed with FAS, a child must have: ** A smooth space between the nose and upper lip ** A thin upper lip ** Eyes that are wide apart ===Growth problems=== Children with FAS do not grow as well as children without FAS. These growth problems can start even before birth, so many babies with FAS are born weighing less than other babies. To be diagnosed with FAS, a child must have a height, weight, or both that are lower than normal. Their height or weight must be in the 10th percentile or lower, meaning 90% of all other children are taller or heavier. ===Central nervous system problems=== The central nervous system controls everything in the body. When it is damaged by alcohol during pregnancy, the damage can cause many different problems. To be diagnosed with FAS, a child must have three different kinds of central nervous system problems: ====Structural problems==== \"Structural\" problems are problems with the shape of the head or the brain. For example: * The child's head may be smaller than what would be normal for their height and weight * Brain scans (like MRIs) may show changes in the shape of the child's brain ====Neurological problems==== Neurological problems are problems with the way the brain and nerves control the body. For example: * Problems with coordination (using different parts of the body together) * Problems controlling muscles * Problems with sucking as a baby ====Functional problems==== \"Functional\" problems are problems doing everyday tasks. To be diagnosed with FAS, a child has to have a lot more trouble doing everyday things than other children his age. The child has to have a low IQ or developmental delay, or problems in three of these areas: * Cognitive deficits (thinking problems), like trouble learning in school * Executive functioning deficits (problems with the type of thinking that helps us plan, organize, and solve problems) * Motor functioning delays (problems with how a person controls their muscles), like: ** Having trouble walking (this is an example of a gross motor skill) ** Having trouble writing (this is a fine motor skill) ** Having trouble with balance and coordination (using different parts of the body together) * Attention problems or hyperactivity (having trouble paying attention and having lots of energy) * Problems with social skills, like making friends * Other problems with daily tasks == Prevention == In the United States, alcohol is the most common cause of birth defects that can be prevented. Fetal alcohol syndrome can be prevented in every pregnancy if the mother drinks no alcohol while she is pregnant. Doctors suggest that women who are trying to get pregnant should also drink no alcohol. This is because a woman may not know she is pregnant for the first 4–6 weeks of her pregnancy. Some women drink alcohol during this time, since they do not realize they are pregnant. But drinking during the earliest part of a pregnancy can cause severe FAS because the earliest part of the pregnancy is when the fetus's brain starts developing. This is why it is safest not to drink any alcohol if a woman thinks she might get pregnant. ==References== Category:Birth defects Category:Alcohol drinking habits",
 "title": "Fetal alcohol syndrome"
}