{
 "id": "526694",
 "text": "The Clinical Institute Withdrawal Assessment for Alcohol (often called CIWA or CIWA-Ar (an updated version)), is a scale used to measure alcohol withdrawal symptoms.Assessment of alcohol withdrawal: the revised Clinical Institute Withdrawal Assessment for Alcohol Scale (CIWA-Ar). Br J Addict 1989;84:1353–7 The scale lists ten common symptoms of alcohol withdrawal. Based on how bad a person's symptoms are, each of these is assigned a number. All ten numbers are added up to make one final score. The highest possible score is 67. Higher scores are a sign of more severe alcohol withdrawal: * Scores of 15 or less usually mean a person is having mild alcohol withdrawal; * Scores of 16-20 usually mean moderate alcohol withdrawal; and * Scores over 20 usually mean severe alcohol withdrawal. The CIWA is used not just to measure how bad withdrawal symptoms are, but also to guide decisions about what treatments to give, like when to give benzodiazepines. ==The CIWA Scale== The CIWA measures ten of the most common signs and symptoms of alcohol withdrawal: *Nausea and vomiting *Tremor *Paroxysmal sweats (sweats that come and go) *Anxiety *Agitation (like not being able to stay still) *Tactile disturbances (like feeling burning, itching, or bugs crawling on the skin) *Auditory disturbances (like hearing things louder than usual, hearing scary things, or hearing things that are not there) *Visual disturbances (like lights being too bright, seeing different colors, or seeing things that are not there) *Headache *Orientation and clouded sensorium (for example, if a person does not know who he is, where he is, or what is happening) ==Uses== The CIWA scale is validated, which means it is proven to measure what it means to measure - alcohol withdrawal symptoms. It also has high inter-rater reliability. This means that if more than one medical professional used the CIWA on the same patient, they would get very similar results. Validation and inter-rater reliability are signs of good, accurate tests. Studies have shown that when the CIWA scale is used to guide treatment:Mayo-Smith MF. Pharmacological management of alcohol withdrawal. A meta-analysis and evidence-based practice guideline. American Society of Addiction Medicine Working Group on Pharmacological Management of Alcohol Withdrawal. JAMA. 1997 Jul 9;278(2):144-51. PubMed PMID 9214531. *Medical professionals can identify which patients are having milder withdrawal symptoms, and which are having more severe symptoms. The CIWA helps them do this much more accurately than they might be able to without the scale. *Patients having milder withdrawal are less likely to be given benzodiazepines that they do not need (this is important because benzodiazepines are addictive) *Patients having very bad withdrawal are less likely to be under-treated (not be given enough treatment) ==Related pages== *Alcohol withdrawal *Alcoholism ==References== ==Other websites== *CIWA Score for Alcohol Withdrawal *The Essential Handbook of Treatment and Prevention of Alcohol Problems Category:Alcoholism tests",
 "title": "Clinical Institute Withdrawal Assessment for Alcohol"
}