{
 "id": "526790",
 "text": "The 2015 Campeonato Brasileiro Série A (officially the Brasileirão Chevrolet 2015 for sponsorship reasons) was the 59th edition of the Campeonato Brasileiro Série A, the top-level of professional football in Brazil. After winning twice in a row in the 2013 and 2014 seasons, Cruzeiro came in defending their title as the Brazilian football champions. Corinthians won the title. == Teams == === Stadia and locations === Team Location State Stadium Capacity Atlético Mineiro Belo Horizonte Independência Mineirão 23,018 62,547 Atlético Paranaense Curitiba Arena da Baixada 42,372 Avaí Florianópolis Ressacada 17,826 Chapecoense Chapecó Arena Condá 22,600 Corinthians São Paulo Arena Corinthians 47,605 Coritiba Curitiba Couto Pereira 40,310 Cruzeiro Belo Horizonte Mineirão 62,547 Figueirense Florianópolis Orlando Scarpelli 19,584 Flamengo Rio de Janeiro Maracanã 78,838 Fluminense Rio de Janeiro Maracanã 78,838 Goiás Goiânia Serra Dourada 41,574 Grêmio Porto Alegre Arena do Grêmio 56,500 Internacional Porto Alegre Beira-Rio 50,128 Joinville Joinville Arena Joinville 22,400 Palmeiras São Paulo Allianz Parque 43,713 Ponte Preta Campinas Moisés Lucarelli 19,728 Santos Santos Vila Belmiro 16,798 São Paulo São Paulo Morumbi 67,052 Sport Recife Ilha do Retiro Arena Pernambuco 35,020 46,154 Vasco Rio de Janeiro São Januário Maracanã 24,584 78,838 == Results == * 2015 Campeonato Brasileiro Série A - Results of first round * 2015 Campeonato Brasileiro Série A - Results of second round == Season statistics == === Top scorers === Rank Player Club Goals 1 Ricardo Oliveira Santos 20 2 Vágner Love Corinthians 14 3 André Sport 13 3 Jádson Corinthians 13 3 Lucas Pratto Atlético Mineiro 13 6 Henrique Almeida Coritiba 12 7 Vitinho Internacional 11 7 Willian Cruzeiro 11 9 Alexandre Pato São Paulo 10 9 André Lima Avaí 10 9 Dudu Palmeiras 10 9 Erik Goiás 10 9 Gabriel Santos 10 9 Luan Grêmio 10 === Top assists === Rank Player Club Assists 1 Jádson Corinthians 12 2 Paulo Henrique Ganso São Paulo 9 2 Diego Souza Sport 9 4 Dudu Palmeiras 7 4 Giovanni Augusto Atlético Mineiro 7 4 Giuliano Grêmio 7 4 Victor Ferraz Santos 7 4 Elias Corinthians 7 4 Luan Grêmio 7 10 Lucas Lima Santos 6 10 Patric Atlético Mineiro 6 10 Douglas Grêmio 6 10 Bruno Henrique Goiás 6 10 André Sport 6 10 Marlone Azevedo Sport 6 10 Cleitinho Figueirense 6 === Hat-tricks === Player For Against Result Date Ref Lucas Pratto Atlético Mineiro São Paulo 3–1 (H) 29 July Willian4 Cruzeiro Figueirense 5–1 (H) 6 September Lucas Barrios Palmeiras Fluminense 4–1 (A) 16 September 4 Player scored 4 goals. ==References== * Source: ESPN FC & Globo Category:2015 in association football Category:Campeonato Brasileiro Série A \\-->",
 "title": "2015 Campeonato Brasileiro Série A"
}