{
 "id": "526867",
 "text": "Peruvudaiyār Kōvil is a Hindu temple dedicated to Shiva, also called as Brihadeshwar Kōvil temple. It is located on the south side of Kaveri river in Thanjavur in the Indian state of Tamil Nadu. It is also known as Periya Kovil, amarnath RP Temple and Rajarajeswaram.South Indian Inscriptions – Vol II, Part I & II It is one of the largest temples in India. Peruvudaiyaar Kovil is an example of Tamil architecture from the Chola period. It was built by Tamil King Raja Raja Chola I and main architect of the temple Kunjara Mallan Raja Raja perumatchan completed in 1010 AD. The temple turned 1000 years old in 2010. The temple is part of the UNESCO World Heritage Site known as the \"Great Living Chola Temples\", along with Brihadeeswara Temple, Gangaikonda Cholapuram and Airavatesvara temple. == History == The temple has fortified walls that were probably added in the 16th century. The vimanam (temple tower) is high and is the tallest in the world. The Kumbam (the apex or the bulbous structure on the top) of the temple is carved out of a single rock and weighs around 80 tons. There is a big statue of Nandi (sacred bull), carved out of a single rock measuring about long and high at the entrance. The entire temple structure is made out of granite. The nearest sources of which are about 60 km to the west of temple. The temple is one of the most visited tourist attractions in Tamil Nadu. the temple consists of nandi mandapa, a pillared potico and an assembly hall, all interconnected. A study in Oriental architecture or history is certainly incomplete without a mention of the Tanjore Brihadeeshwara Temple or the Tanjore Periya Kovil (Big Temple). This imposing structure was built by Raja Raja Cholan and his sister Kundavai, both ardent devotees of Lord Shiva. It was constructed by the King at the height of the Chola reign to signify his power and strength. Here are a few facts not known about this Chola temple of Thanjavur: a) The original name of the deity was Rajarajeshwar. It was the Marathas who gave it the name Brihadeeshwara or the Great Ishwara. b) The main temple is entirely built of granite. More than 130,000 tons of granite is said to have been used to build it. c) A long associated myth with this temple temple is that the shadow of the main structure does not fall on the ground. However, this has been proven wrong by scientists. d) The statue of Nandi at the entrance of the temple is carved out of a single stone. e) The main Vimanam, which is at about 200 feet is often called Dakshin Meru or Southern Meru. f) The inspiration to build the temple came to Raja Raja Cholan during his visit to Sri Lanka and is a result of a dream he had. g) The temple has a portrait of Raja Raja Cholan paying obeisance to Lord Natarajar. This is undoubtedly, the first ever instance of a royal portrait. h) Inscriptions in the temple point towards Kunjara Mallan Raja Raja Perunthachan as the chief architect of the temple. His successors survive to this day and practice the art of Vastu or Vastu Shastra. i) Depictions of nartakis or dancers showing eighty one of hundred and eight karanas (synchronised movements of hands and feet) in Bharata Natyam are carved here. These karanas are a part of karanas mentioned in the Natya Shastra of Bharata Muni or Sage Bharata. There is also evidence that the temple was a platform for talented dancers to showcase their talent. These depictions are first of their kind. j) The inscriptions also mention the different kinds of jewels used in the period. Each of these jewels are mentioned in detail. A total of twenty three different types of pearls, eleven varieties of diamonds and rubies are mentioned in these inscriptions. k)The earliest design plan of the temple date back to 921 AD indicating this took multiple generations to complete. What astounds historians is that there was not a single granite quarry in about 100 km radius of the temple. This means that transporting these stones would have been a herculean task. But Raja Raja Cholan insisted on the use of these stones. All of these features make this Chola temple of Tanjore, a magnum opus of the Chola reign. Brihadeeswarar temple is one of the few temples that have Ashta-dikpaalakas (Guardians of the directions) idols. Chola frescoes adorn the wall of the temple and these frescoes depict Shiva in different poses. Brihadeeswarar temple is the first complete granite temple in the world. Around 60,000 tons of granite is said to be used to build the temple. Brihadeeswarar temple, also known as the Tanjore big temple expounds the number of alphabets in Tamil by the distance and height it is designed. Tamil is a language that has totally 247 Tamil letters which are assorted as Uyir Ezhuthu(Soul Letters) - 12 Mei Ezhuthu(Body Letters) - 18 Uyir-Mei Ezhuthu(Soul-Body Letters) - 216 Ayutha Ezhuthu - 1 The height of Gopuram is 216 feet = The number of letters in Uyir Mei Ezhuthu(216) The height of Lord Shiva in the form of Lingam* inside the temple is 12 feet = The number of letters in Uyir Ezhuthu(12) The height of Sivalinga peedam** is 18 feet = The number of letters in Mei Ezhuthu (18) The distance between the Sivalingam and the Nandhi is 247 feet = The total number of Tamil letters present that includes Ayutha Ezhuthu(247) * The lingam is often represented as resting on disc shaped platform called a linga on a peetham. ** An elliptical figure placed atop a circular base called 'peedam' also called as “Peetham” in 2021 narendran also visited this temple ** Brihadeeswara Temple (brihadeeswara.temple-mandir.in) == References == Category:Temples in India Category:Hindu temples Category:11th-century establishments in Asia Category:Establishments in India",
 "title": "Brihadeshwara Temple"
}