{
 "id": "527005",
 "text": "Oscar Isaac (born Óscar Isaac Hernández Estrada; March 9, 1979) is a Guatemalan - American actor. He is known for his lead film roles in the comedy-drama Inside Llewyn Davis (2013), for which he received a Golden Globe Award nomination, the crime drama A Most Violent Year (2014) and the science fiction thriller Ex Machina (2015). He had a role in the 2015 film Star Wars: The Force Awakens. He has also recorded music in Guatemala. He won a Golden Globe Award in 2016. ==Filmography== ===Film=== Year Title Role Director Notes 1998 Illtown Pool Boy Nick Gomez 2002 All About the Benjamins Francesco Kevin Bray 2004 Lenny the Wonder Dog Detective Fartman Oren Goldman & Stav Ozdoba 2006 Pu-239 Shiv Scott Z. Burns The Nativity Story Saint Joseph Catherine Hardwicke 2007 The Life Before Her Eyes Marcus Vadim Perelman 2008 Che: Part One Interpreter Steven Soderbergh Body of Lies Bassam Ridley Scott 2009 Agora Orestes Alejandro Amenábar Balibo José Ramos-Horta Robert Connolly AACTA Award for Best Actor in a Supporting Role Nominated - Film Critics Circle of Australia Award for Best Supporting Actor 2010 Robin Hood John, King of England Ridley Scott 2011 Sucker Punch Blue Jones Zack Snyder W.E. Evgeni Madonna 10 Years Reeves Jamie Linden Drive Standard Gabriel Nicolas Winding Refn 2012 For Greater Glory Victoriano \"El Catorce\" Ramírez Dean Wright Nominated - ALMA Award for Favorite Movie Actor: Supporting Role Revenge for Jolly! Cecil Chadd Harbold The Bourne Legacy Outcome #3 Tony Gilroy Won't Back Down Michael Perry Daniel Barnz 2013 Inside Llewyn Davis Llewyn Davis Joel Coen Ethan Coen Gotham Independent Film Award for Best Actor Hamptons International Film Festival Award for Breakthrough Performer International Cinephile Society Award for Best Actor International Cinephile Society Award for Best Ensemble National Society of Film Critics Award for Best Actor Phoenix Film Critics Society Award for Breakthrough Performance on Camera San Diego Film Critics Society Award for Best Actor Santa Barbara International Film Festival – Virtuoso Award Toronto Film Critics Association Award for Best Actor Vancouver Film Critics Circle Award for Best Actor Nominated - Empire Award for Best Male Newcomer Nominated - Chicago Film Critics Association Award for Best Actor Nominated - Georgia Film Critics Association Award for Best Actor Nominated - Golden Globe Award for Best Actor – Motion Picture Musical or Comedy Nominated - Independent Spirit Award for Best Lead Male Nominated - Iowa Film Critics Association Award for Best Actor Nominated - New York Film Critics Circle Award for Best Actor (3rd place) Nominated - Online Film Critics Society Award for Best Actor Nominated - Saturn Award for Best Actor In Secret Laurent LeClaire Charlie Stratton 2014 The Two Faces of January Rydal Keener Hossein Amini Ticky Tacky Lucien Brian Petsos Short film A Most Violent Year Abel Morales J. C. Chandor National Board of Review Award for Best Actor (Tied with Michael Keaton) Nominated - Gotham Independent Film Award for Best Actor Nominated - Washington D.C. Area Film Critics Association Award for Best Actor 2015 Ex Machina Nathan Bateman Alex Garland Florida Film Critics Circle Award for Best Supporting Actor Online Film Critics Society Award for Best Supporting Actor San Diego Film Critics Society Award for Best Supporting Actor (2nd place) Nominated - Austin Film Critics Association Award for Best Supporting Actor Nominated - Detroit Film Critics Society Award for Best Supporting Actor Nominated - London Film Critics' Circle Award for Supporting Actor of the Year Mojave John \"Jack\" Jackson William Monahan Star Wars: The Force Awakens Poe Dameron J. J. Abrams 2016 X-Men: Apocalypse En Sabah Nur / Apocalypse Bryan Singer The Promise Mikael Boghosian Terry George 2017 Lightningface Basil Stitt Brian Petsos Short film, also executive producer Suburbicon Bud Cooper George Clooney Nominated - San Diego Film Critics Society Award for Best Supporting Actor Star Wars: The Last Jedi Poe Dameron Rian Johnson 2018 Annihilation Alex Garland Completed Operation Finale Peter Malkin Chris Weitz Post-production; also producer Life Itself Dan Fogelman Post-production 2022 Moon Knight Moon Knight, Marc Spector, Steven Grant, and Jake Lockley Mohamed Diab ===Television=== Year Title Role Notes 2006 Law & Order: Criminal Intent Robbie Paulson Episode: \"The Healer\" 2015 Show Me a Hero Nick Wasicsko HBO miniseries; 6 episodes Golden Globe Award for Best Actor – Miniseries or Television Film Nominated - Satellite Award for Best Actor – Miniseries or Television Film Nominated - Critics' Choice Television Award for Best Actor in a Movie/Miniseries ===Video games=== Year Title Voice role 2015 Disney Infinity 3.0 Poe Dameron 2016 Lego Star Wars: The Force Awakens Poe Dameron ===Podcasts=== Year Title Role 2016 Homecoming Walter Cruz ==Theatre== Year Title Role Theatre Notes 2005 The Two Gentlemen of Verona Proteus Shakespeare in the Park 2006 Beauty of the Father Federico García Lorca Manhattan Theatre Club 2007 Romeo and Juliet Romeo Montague Shakespeare in the Park 2008 Grace Tom Manhattan Theatre Club 2011 We Live Here Daniel Manhattan Theatre Club 2017 Hamlet Prince Hamlet The Public Theater ==New Japan Pro Wrestling (1989 - 1995)== Vsto debuted in 1989 at the PvP (NjPW Crash) and carried on his career at NjPW. ==Visto (1996)== Visto made a impact on showing up at WCW Monday Nitro in a battle royal. ==Mincho (1997)== Visto disappeared on WCW Monday Nitro and appeared on WCW Monday Nitro as Mincho . ==References== ==Other websites== * * Category:Golden Globe Award winning actors Category:1979 births Category:Living people Category:American movie actors Category:American television actors Category:Guatemalan people",
 "title": "Oscar Isaac"
}