{
 "id": "527389",
 "text": "The Sonderkommando photographs are four blurry pictures, taken secretly on 4 August 1944 inside the Auschwitz concentration camp during World War II.Georges Didi-Huberman, Images in Spite of All: Four Photographs from Auschwitz, University of Chicago Press, 2008; first published as Images malgré tout, Les Éditions de Minuit, 2003. The photographs were taken by a prisoner in Auschwitz II-Birkenau. This was Auschwitz's extermination camp - a place where people were sent to be killed in gas chambers. These are some of the only known photos that show what happened around the gas chambers.Franziska Reiniger, \"Inside the Epicenter of the Horror – Photographs of the Sonderkommando\" , Yad Vashem: \"Among the millions of photographs that are related to Nazi death camps, only four depict the actual process of mass killing perpetrated at the gas chambers in Auschwitz-Birkenau.\" The photographer was a member of the Sonderkommando, a group of inmates forced to work in and around the gas chambers. He took two photos from inside one of the gas chambers and two from outside. To keep from being caught, he had to aim the camera from his hip and was not able to focus the camera. The Polish resistance (a movement of Polish people fighting against the Nazis) snuck the camera film out of the camp in a toothpaste tube.Didi-Huberman 2008, p. 16. The photographs were numbered 280–283 by the Auschwitz-Birkenau State Museum.Dan Stone, \"The Sonderkommando Photographs\", Jewish Social Studies, 7(3), Spring/Summer 2001, (pp. 132–148), p. 143, n. 3. Numbers 280 and 281 show the cremation of dead bodies in a fire pit. Number 283 just shows trees (since the photographer could not see where he was aiming the camera, he aimed too high for this photo). Number 282 shows a group of naked women just before they went into the gas chamber.Didi-Huberman 2008, p. 117. ==Taking the photographs== Nobody knows for sure who took the photographs. Many records say he was called \"Alex,\" and was a Jewish inmate from Greece. \"Alex\" may have been Alberto Errera, an officer from the Greek navy; he was shot and killed after hitting an SS officer.Dan Stone, History, Memory and Mass Atrocity, Vallentine Mitchell, 2006, p. 16.For Errera's details, Greif 2005, p. 375, n. 2; Steven B. Bowman, The Agony of Greek Jews, 1940–1945, Stanford University Press, 2009, p. 95; Shlomo Venezia, Inside the Gas Chambers: Eight Months in the Sonderkommando of Auschwitz, John Wiley & Sons, 2013, p. 90ff. (The SS - Schutzstaffel - were the Nazi military organization that ran the concentration camps.) Other members of the Sonderkommando in the camp's crematorium helped get and hide the camera Alex used. They were also look-outs (they watched the SS to find the safest time for Alex to take the pictures.)Stone 2001, p. 132. One of these men was Alter Fajnzylberg, who had worked the camp's crematoria since July 1943.Jean-Claude Pressac, Auschwitz: Technique and Operation of the Gas Chambers, Beate Klarsfeld Foundation, 1989, p. 124. He once described how the photos were taken: [S]omewhere about midway through 1944, we decided to take pictures secretly to record our work ... In order to do that, [we needed] to get a good camera and film ... From the very beginning, several prisoners from our Sonderkommando were in on my secret: Szlomo Dragon, his brother Josek Dragon, and Alex, a Greek Jew whose surname I do not remember. On the day on which the pictures were taken ... Some of us were to guard the person taking the pictures. In other words, we were to keep a careful watch for the approach of anyone who did not know the secret, and above all for any SS men moving about in the area. At last the moment came. We all gathered at the western entrance leading from the outside to the gas-chamber of Crematorium V: we could not see any SS men in the watchtower overlooking the door from the barbed wire, nor near the place where the pictures were to be taken. Alex, the Greek Jew, quickly took out his camera, pointed it towards a heap of burning bodies, and pressed the shutter. This is why the photograph shows prisoners from the Sonderkommando working at the heap. One of the SS was standing beside them, but his back was turned towards the crematorium building. Another picture was taken from the other side of the building, where women and men were undressing among the trees. They [were going] to be murdered in the gas-chamber of Crematorium V.Janina Struk, Photographing the Holocaust: Interpretations of the Evidence, I. B. Tauris, 2004, p. 114. The film was snuck out of the camp by the Polish resistance. It was hidden inside a tube of toothpaste by Helena Dantón, who worked in the SS canteen (camp store). Attached to the film was a note dated 4 September 1944, asking that the film be developed right away. The Sonderkommando photographs were one in many acts of resistance against the Nazis and the war crimes they committed during the Holocaust. ==Related pages== * Sonderkommando * The Holocaust * Auschwitz concentration camp ==References== ==Other websites== *Nathan Cohen, \"Diaries of the Sonderkommando,\" in Yisrael Gutman, Michael Berenbaum (eds.), Anatomy of the Auschwitz Death Camp, Indiana University Press, 1998, p. 522ff. Category:Photographs * Category:1944 works Category:20th century in art",
 "title": "Sonderkommando photographs"
}