{
 "id": "527637",
 "text": "The lighting system of a motor vehicle consists of lighting and signalling devices mounted on the front, rear, sides, and in some cases on the top of a motor vehicle, and lights the roadway for the driver. The lighting system also makes the vehicle more visible, especially in low light conditions. It gives warning to other drivers and pedestrians of a vehicle's presence and direction of travel. Emergency vehicles usually carry distinctive lighting equipment to alert drivers and pedestrians of their rapid movement during an emergency. == History == Vehicles have had lights for well over a hundred years. Candles lit Horse-drawn carriages.Burkard Wördenweber, Automotive Lighting and Human Vision (Berlin; New York: Springer, 2007), pp. 95–96 The first cars, then called horseless-carriages were lit by gas lights. By 1908 electric lighting began to be used on motor vehicles. Red tail lights and yellow brake lights were in use by 1915. Sealed beam headlights were used starting in 1936. By 1940 turn signals were used. Before 1939, headlight design was not standardised. Between 1940 and 1956, all vehicles built in the U.S. were required to have 7’’ round headlights (sealed beams). As of 1956 and up, it became possible to install 4 headlights on 1 vehicle (2 lights per 1 side). In 1960 the first halogen lights were used on European cars and the technology came to the US by 1979. Replaceable car light bulbs were in use in the US beginning in 1983. == Lights == *Headlights are for lighting the space in front of the vehicle. Headlights are designed to see as far forward as possible, without \"blinding\" oncoming cars. Most drivers learn not to \"overdrive their headlights\". This means not going too fast so your stopping distance is farther than the area lit by the headlights. *Tail lights are red (only) and are lit when the headlights are lit. Modern vehicles are required to have two tail lights. Most tail light assemblies stop lights which warn other drivers that a vehicle is slowing or stopping. They also include the rear *Marker lights and often the turn signals. *Third brake light. Since 1986 in the US and Canada, 1990 in Australia and New Zealand, and in most of Europe since 1998 a third brake lamp mounted higher than the vehicle's two regular stop lights is required. In the United States and Canada since 1986, in Australia and New Zealand since 1990, and in Europe and other countries applying UN Regulation 48 since 1998, a central stop (brake) lamp mounted higher than the vehicle's left and right stop lamps is also required. *Fog lights are optional on many vehicles. Regular headlights reflect light and cause glare when the vehicle is operating in fog. Fog lights are aimed lower to better see the road. They also spread the light out in a wider pattern to aid the headlights in fog, rain, snow or dust. *Driving lights are auxiliary lights designed to help the headlights see farther. They project a narrow beam much farther than headlights usually do. == References == == Other websites == * Dashboard Warning Lights * Emergency vehicle lighting explained Category:Auto parts Category:Automotive technologies Category:Lighting",
 "title": "Automotive lighting"
}