{
 "id": "527827",
 "text": "Woman on top is any sex position in which the woman is on top of her sexual partner during sexual activity. The position most commonly associated with the woman on top is often called the cowgirl or riding position, which derives its name from the image of the woman \"riding\" the man as a cowgirl rides a bucking horse. In that position, a man typically lies on his back with his legs closed, while the female partner straddles him, usually in a kneeling position facing either forward or back, and either the man or woman inserts the man's erect penis into the woman's vagina or anus.\"Discovery Health Sexual Positions\" (web archive). healthguide.howstuffworks.com. Retrieved 22 October 2010. The cowgirl position is commonly cited as one of the more popular sex positions, especially by women, because it gives them control over the rhythm and pace of vaginal stimulation and the extent and duration of penetration and because of its ability to adequately stimulate the clitoris. There are other positions in which the woman may be on top, including the 69 position and the pompoir sex position. In any of the woman on top positions, the woman is usually the active partner during sexual activity, and in addition to satisfying herself can stimulate or massage the man's scrotum, especially if his legs are spread. The woman may take the position in the course of sexual activity, especially if the man has attained orgasm while she has not; and in this position she or her partner may perform fingering for her to achieve orgasm. ==Gallery== File:Wiki-cowgirl.png|A couple engaged in sexual intercourse in the cowgirl position File:Paul Avril - Les Sonnetts Luxurieux (1892) de Pietro Aretino, 4.jpg|Édouard-Henri Avril - Les Sonnetts Luxurieux (1892) - depiction of reverse cowgirl position File:Carracci Angelique et Medor.jpg|Agostino Carracci (1557 - 1602), Angelique et Medor, two characters from the opera Roland File:Michael Zichy-love1.jpg|Depiction of reverse cowgirl position by Mihály Zichy (c. 1911) ==References== Category:Sexual acts",
 "title": "Woman on top"
}