{
 "id": "527994",
 "text": "In electronics, doping is the process of adding certain chemical elements to a semiconductor in order to change its electrical conductivity. These elements are tiny impurities. This is done to create diodes that make electricity go in one direction, or to make transistors and semiconductor switches. When the element boron is added to silicon, the boron \"dopant\" is called an \"acceptor\" because it likes accepting electrons. When the element phosphorous is added to silicon, the phosphorous is called a \"donor\" because it does not like electrons. There are two types of doping: n-type (negative type) doping and p-type (positive type) doping # n–type doping: In this, elements with five valence electrons are added as impurities (\"pentavalent\" or \"donor\") in the semiconductor. The semiconductor has four valence electrons, so when it is doped with pentavalent impurities, the four valence electrons make covalent bonds, and the remaining one becomes free to move. This is how n-type doping increases conductivity of the semiconductor. The excess of electrons (e-) in the n-type semiconductor generates an overall negative charge, hence the name \"n-type\". # p-type doping: In this, elements with three valence electron are added as impurities (\"trivalent\" or \"acceptor\") in the semiconductor. Three of the four electrons in the semiconductor bond with the three electrons of the dopant. The remaining electrons cannot form bonds, and thus the vacant space left behind are known as holes. Then, electrons from other atoms jump in the holes to fill them, again causing different holes to appear. This process repeats over and over, increasing conductivity. The impurities are added to the silicon through multiple processes, including \"spin coating\". A thin layer of phosphorus or boron, usually mixed with a liquid to help it spread out, is spun at high speeds on the silicon. The mixture spreads out the phosphorous or boron, and then is baked. Another process called \"ion implantation\" involves a scaled down particle accelerator that smashes atoms of the chosen dopant into the silicon, which adds the impurity. Category:Electrical engineering Category:Chemistry",
 "title": "Doping (semiconductor)"
}