{
 "id": "52793",
 "text": "Field Marshal Arthur Wellesley, 1st Duke of Wellington, KG, GCB, GCH, PC, FRS (1 May 1769–14 September 1852) was a soldier and statesman. He was one of the leading military and political figures of 19th-century Britain. His defeat of Napoleon at the Battle of Waterloo in 1815 put him in the top rank of Britain's military heroes. In 2002 he was number 15 in the BBC's poll of the 100 Greatest Britons. He defeated Tipu Sultan in 1799. Wellesley was born in Dublin, Ireland, into a wealthy Anglo-Irish aristocratic Protestant family. Starting as an ensign in the British Army, he served well in British India and in the Napoleonic Wars, mostly in the Peninsular War, in which he reached the rank of Field Marshal. He became a duke when Napoleon was exiled to Elba. Wellington is often compared to the 1st Duke of Marlborough. They had many things in common, including being in politics after a highly successful military career. Wellington was twice a Prime Minister of the United Kingdom. A Tory, he was one of the leading figures in the House of Lords until his retirement in 1846. He remained commander-in-chief of the British Army until his death. == Titles == * The Honourable Arthur Wesley (birth–7 March 1787) * Ensign The Hon. Arthur Wesley (7 March 1787–25 December 1787) * Lieutenant The Hon. Arthur Wesley (25 December 1787–30 June 1791) * Captain The Hon. Arthur Wesley (30 June 1791–30 April 1793) * Major The Hon. Arthur Wesley (30 April 1793–30 September 1793) * Lieutenant-Colonel The Hon. Arthur Wesley (30 September 1793–3 May 1796) * Colonel The Hon. Arthur Wesley (3 May 1796–19 May 1798) * Colonel The Hon. Arthur Wellesley (19 May 1798–29 April 1802) * Major- General The Hon. Arthur Wellesley (29 April 1802–1 September 1804) * Major- General The Hon. Sir Arthur Wellesley, KB (1 September 1804–8 April 1807) * Major-General The Right Honourable Sir Arthur Wellesley, KB (8 April 1807–25 April 1808) * Lieutenant-General The Rt Hon. Sir Arthur Wellesley, KB (25 April 1808–4 September 1809) * Lieutenant-General The Rt Hon. The Viscount Wellington, KB, PC (4 September 1809–May 1811) * General The Rt Hon. The Viscount Wellington, KB, PC (May 1811–28 February 1812) * General The Rt Hon. The Earl of Wellington, KB, PC (28 February 1812–3 October 1812) * General The Most Honourable The Marquess of Wellington, KB, PC (3 October 1812–4 March 1813) * General The Most Hon. The Marquess of Wellington, KG, KB, PC (4 March 1813–21 June 1813) * Field Marshal The Most Hon. The Marquess of Wellington, KG, KB, PC (21 June 1813–11 May 1814) * Field Marshal His Grace The Duke of Wellington, KG, KB, PC (11 May 1814–2 January 1815) * Field Marshal His Grace The Duke of Wellington, KG, GCB, PC (2 January 1815–14 September 1852) Category:1769 births Category:1852 deaths Category:British military people Category:United Kingdom Barons Category:United Kingdom Viscounts Category:United Kingdom Earls Category:United Kingdom Marquesses Category:United Kingdom Dukes Category:Knights of the Garter Category:Knights Grand Cross of the Order of the Bath Category:Members of the Privy Council of the United Kingdom Category:Fellows of the Royal Society Category:Knights of the Bath Category:Politicians from Dublin Category:Members of the House of Lords Wellesley, Arthur Wellesley, Arthur",
 "title": "Arthur Wellesley, 1st Duke of Wellington"
}