{
 "id": "52805",
 "text": "Archibald Philip Primrose, 5th Earl of Rosebery (7 May 184721 May 1929) was a British Liberal politician and Prime Minister of the United Kingdom, also known as Archibald Primrose (1847-1851), Lord Dalmeny (1851-1868). After an education at Eton and Oxford, Dalmeny succeeded to his grandfather's Scottish earldom in 1868. == Political career == Becoming involved in politics, he became a Liberal, and was involved in Gladstone's Midlothian campaign, which brought the Liberals back into power in 1880. In the Liberal administration that followed, Rosebery served in junior offices, including that of Under- Secretary of State for the Home Department, before entering the Cabinet as Lord Privy Seal in March 1885. Rosebery became a leader of the Liberal Imperialist faction of the Liberal Party, and in Gladstone's third (1886) and fourth (1892-1894) administrations, Rosebery served as Foreign Secretary. When Gladstone retired in 1894, Rosebery became his successor as Prime Minister, much to the disgust of the more left-wing Liberals. Rosebery's government was largely unsuccessful--his designs in foreign policy, such as expansion of the fleet, were defeated by disagreements within the Liberal Party, while the Tory-dominated House of Lords stopped the whole of the Liberals' domestic legislation. In 1895, Rosebery resigned, and a Conservative government under Lord Salisbury took his place. Rosebery resigned as leader of the Liberal Party in 1896, and gradually moved further and further from the mainstream of the party, supporting the Boer War and opposing Irish Home Rule, a position which prevented him from taking part in the Liberal government that returned to power in 1905. In his later years, Rosebery turned to writing, including biographies of Lord Chatham, Pitt the Younger, Napoleon, and Lord Randolph Churchill. He was also famous for his champion racehorses. == Roseberry's landholdings == Roseberry was extremely wealthy, even by the standards of the aristocracy before the First World War. He owned 12 houses, all of them grand, and some of huge size. By marriage, he acquired: *Mentmore Towers in Buckinghamshire, a huge neo-Renaissance stately home, sold in the 1970s *Number 40, Piccadilly, in London. With his fortune, he bought: *a shooting lodge at Carrington in Midlothian *a Georgian villa at Postwick in Norfolk *In 1897, he bought Villa Delahente in Posillipo, overlooking the Bay of Naples, currently an official residence of the President of the Italian Republic, still known as Villa Rosebery *38 Berkeley Square, London *The Durdans, Epsom, where he died in 1929. As Earl of Rosebery, he was laird of: *Dalmeny House on the banks of the Firth of Forth (pictured) *Barnbougle Castle in the grounds of Dalmeny Estate, used by Rosebery (an insomniac) for privacy. He rented: *a home in Randolph Crescent, Edinburgh, during World War I *Lansdowne House, in London, from the Marquess of Lansdowne. == Rumours == It was rumoured that Rosebery was homosexual or bisexual. Like Oscar Wilde, he was hounded by Queensbury for his association with one of Queensberry's sons.Murray, Douglas Bosie: a biography of Lord Alfred Douglas It was Francis Douglas, who was Roseberry's private secretary.McKenna, Neil: The Secret Life of Oscar Wilde 2003. The suggestion was that Queensberry had threatened to expose the Prime Minister if his government did not vigorously prosecute Wilde for Wilde's relationship with Francis Douglas's younger brother, Lord Alfred Douglas. Queensberry believed, as he put it in a letter, that \"Snob Queers like Rosebery\" had corrupted his sons, and he held Rosebery indirectly responsible for Drumlanrig's death. Lord Queensberry to Alfred Montgomery, 1 November 1894. Quoted in ==References== ==Other websites== * * * Category:1847 births Category:1929 deaths Category:Scottish Earls Category:United Kingdom Earls Category:United Kingdom Barons Category:Conservative members of the House of Lords",
 "title": "Archibald Primrose, 5th Earl of Rosebery"
}