{
 "id": "528094",
 "text": "George Bernard \"Bernie\" Worrell, Jr. (April 19, 1944 - June 24, 2016) was an American keyboardist and composer. He was best known as a founding member of Parliament-Funkadelic and for his work with Talking Heads. He was a member of the Rock and Roll Hall of Fame, inducted in 1997 with fifteen other members of Parliament-Funkadelic. ==Personal life== Worrell was born in Long Branch, New Jersey. He was raised in Plainfield, New Jersey. Worrell studied at Juilliard School. He lives in Hampton, New Jersey. In January 2016, Worrell was diagnosed with stage-4 lung cancer. Worrell died of the disease on June 24, 2016 in Everson, Washington, aged 72. ==Albums== *1982: The Name of This Band Is Talking Heads by Talking Heads *1983: Speaking in Tongues by Talking Heads *1984: Stop Making Sense by Talking Heads *1984: Fred Schneider and the Shake Society by Fred Schneider *1985: Army Arrangement by Fela Kuti *1986: Horses & Trees by Ginger Baker *1992: Transmutation (Mutatis Mutandis) by Praxis *1993: Every Silver Lining Has a Cloud by Julian Schnabel *1999: Unison by Shin Terai *2004: The Big Eyeball in the Sky by Colonel Claypool's Bucket of Bernie Brains *2004: The New Danger by Mos Def *2005: BananAtomic Mass by Munkeez Strikin' Matchiz *2006: Gold & Wax by Gigi *2007: Lightyears by Shin Terai *2007: Tennessee 2004 by Praxis *2007: Turn My Teeth Up! by Baby Elephant *2008: Profanation (Preparation for a Coming Darkness) by Praxis *2008: Living on Another Frequency by Science Faxtion *2008: A New Mind by Activities of Dust *2008 Delicate Thing by Eric McFadden Trio *2010: For You, For Us, For All by Socialybrium *2013: \"BWO Is Landing\" by The Bernie Worrell Orchestra ==Awards== * Independent Music Awards 2013: \"Get Your Hands Off\" - Best Funk/Fusion/Jam Song ==References== ==Other websites== *The official website of Bernie Worrell *Stranger: Bernie Worrell on Earth - the official documentary on Bernie Worrell *Bernie Worrell collection at the Internet Archive's live music archive (currently empty) *Bernie Worrell and the WOO Warriors collection at the Internet Archive's live music archive *Artist Connection Podcast Interview Category:1944 births Category:2016 deaths Category:Deaths from lung cancer Category:American composers Category:Musicians from New Jersey Category:People from Plainfield, New Jersey",
 "title": "Bernie Worrell"
}