{
 "id": "528252",
 "text": "Gender dysphoria is a term used by psychologists and physicians. It describes people who strongly feel they are not the gender they were born with. It used to be called \"gender identity disorder.\" It is a condition accompanied by stress, anxiety, and depression. To be diagnosed with gender dysphoria now, patients must show strong cross-gender feelings that persist over time. It is not just a desire to change sex for some advantage they might think exists. People with gender dysphoria are often transgender. They take steps to help their gender dysphoria. A step they could take is to take testosterone or estrogen (this is often called hormone replacement therapy, or \"HRT\"). Transgender women take estrogen. Transgender men take testosterone. For children, puberty blockers may be taken instead. They can also get surgery. One surgery for transgender men is removal (to get rid of) breasts. This makes the chest flat. The flat chest makes them happy because they look more like a man. Another surgery for both transgender men and transgender women is Genital Reconstruction Surgery. This means they can get a penis or a vulva. Gender dysphoria may cause many to become alone but not by choice. It often leads to avoiding or dropping out of school. Feminine speech patterns and ways of acting are common in people who were born male with gender dysphoria. Teenagers in particular are at risk of suicide. The World Health Organization (WHO) renamed Gender Identity Disorder to Gender Dysphoria in 2019. The DSM-5 renamed it in 2013. == Diagnosis == The American Psychiatric Association gives a diagnosis of gender dysphoria in teenagers or adults if they feel two or more of these feelings. * A strong desire to be of a gender other than the one they were born with. * A strong desire to be treated as a gender other than one they were born with. * A note-worthy mismatch between the gender they feel they should be and the one that they were born with. * A strong desire for the sexual characteristics of a gender other than one they were born with. * A strong desire to be rid of one's sexual characteristics. * Feeling that they react like a different gender than the one they were born with. To be diagnosed, the person must have enough distress about their feelings. == Causes == Scientists have theories that gender dysphoria is related to genetic and hormone levels during pregnancy. At the early stages of pregnancy, all babies begin with a female brain structure. Later in pregnancy, male babies have their body and brain masculinized by hormones like testosterone. It is theorised that less or extra testosterone during important times of the pregnancy may be related to gender dysphoria A 2020 review of several studies reported that transwomen had female-typical digit ratios (finger lengths on the right hand) while transmen had more male-typical finger lengths. Digit ratio is related to the level of testosterone exposure while a baby is growing during pregnancy. This supports the idea that hormones in the womb are related to gender dysphoria and transgender identity. == Occurrence == Different studies find different numbers of people with gender dysphoria. In a New Zealand study, 1.2% of people responded \"yes\" to a question asking if they thought they were transgender. A study in Massachusetts found that 0.5% of adults say they are transgender. == References == == Related pages == *Gender identity *Transgender *Trans woman *Trans man *Non-binary *Gender euphoria Category:Psychology Category:Gender",
 "title": "Gender dysphoria"
}