{
 "id": "528296",
 "text": "The Lamborghini Huracán is a sports car built by Lamborghini. It replaced the Lamborghini Gallardo. It has been produced from 2014 to 2024. The name Huracán comes from the Spanish language. It means Hurricane. Huracán was also the name of a brave fighting bull. And the Mayan god of wind, storm and fire. ==Huracán LP610-4 Coupé (2014-)== The LP610-4 is the base model of the Huracán. It is a coupe with two doors and two seats. The name LP610-4 means that the car has a longitudinal engine with 449 kW and all-wheel drive. ==Huracán LP620-2 Super Trofeo (2014-)== The 'LP620-2 is a rear-wheel drive version of the LP610-4 coupé. It is built especially for the Lamborghini Blancpain Super Trofeo Series, a race series for Lamborghini only. ==Huracán LP610-4 Spyder (2016-)== The LP610-4 Spyder is a convertible version of the LP610-4 coupé. It was first shown at the 2015 International Motor Show Germany in Frankfurt. It has the same engine as the LP610-4 coupé. ==Huracán LP580-2== The LP580-2 is also a coupé on the basis of the LP610-4, but instead has 427 kW and rear-wheel drive. This is to decrease the cost. ==Specifications== ===Engine=== The Huracán has the same mid-engine V10 as the Lamborghini Gallardo. It has 449 kW. The displacement of the engine is 5,204 cm3. ===Performance=== The top speed of the Huracán is 325 km/h. It can accelerate to 100 km/h in 2.5 seconds. The Huracán weighs 1,422 kg, which means it has a power-to-mass ratio of 0.32 kW per kg. The maximum torque is 560 N⋅m at 6,500 rpm. The CO2 emissions are 290g/km. ==Gallery== File:2015-03-03 Geneva Motor Show 3268.JPG|Rear view of a Huracán LP610-4 File:Lamborghini Huracan Performante Monaco IMG 1013.jpg|Lamborghini Huracán Performante File:Lamborghini Huracan Evo Spyder Genf 2019 1Y7A5556.jpg|Lamborghini Huracán Evo Spyder File:Huracan center console.JPG|Centre console of a Huracán LP610-4 File:Lamborghini Huracan Super Trofeo (15383668411).jpg|Huracán LP620-2 Super Trofeo ==References== ==Other websites== * Lamborghini Huracán LP610-4 at the official website of Lamborghini * Lamborghini Huracán LP610-4 Spyder at the official website of Lamborghini Huracan Category:Sports cars Category:2010s automobiles Category:2020s automobiles Category:Coupes Category:Roadsters",
 "title": "Lamborghini Huracán"
}