{
 "id": "528383",
 "text": "The PDSA Dickin Medal is an award for animals. It was created in the United Kingdom, by Maria Dickin, in 1943. At first, the award's goal was to honor the work of animals during World War II. The award is often called \"the animals' Victoria Cross.\" Maria Dickin was the creator of the People's Dispensary for Sick Animals (PDSA), a British veterinary charity. She created the award for any animal who showed \"conspicuous gallantry [obvious bravery]\" and devotion to its job while serving with the United Kingdom's armed forces or their allies. The Medal was awarded 54 times between 1943 and 1949 – to 32 pigeons, 18 dogs, three horses, and one cat. The PDSA started awarding the Dickin Medal again in 2000. In that year, they honored a Newfoundland dog named Gander. The award was given posthumously - after Gander's death. During the Battle of Hong Kong in World War II, Gander had saved the lives of Canadian soldiers. In early 2002, three dogs were awarded the Dickin Medal for their work in responding to the September 11 attacks. The PDSA also awarded the Medal to two dogs serving with the British military in Bosnia-Herzegovina and Iraq. In December 2007, 12 animals who had received the Dickin Medal and were buried at the PDSA Animal Cemetery in Ilford, Essex, were given full military honors. This marked the end of a project to restore the cemetery, which was aided by the United Kingdom's National Lottery. The first recipients of the Medal, in December 1943, were three pigeons. Serving with the Royal Air Force, all three helped make it possible to rescue air crew from ditched planes during the Second World War. The most recent animal to receive the Medal was Diesel, a dog who was killed while serving with the French police during the November 2015 Paris attacks. Diesel's award will be presented in a ceremony in 2016. As of December 2015, the Dickin Medal has been awarded 66 times. ==Medal recipients== ===Pigeons=== Throughout history, homing pigeons have been used to carry messages over long distances. Homing pigeons can find their way home over very long distances. Because of this special ability, homing pigeons have often been used in wars to carry messages. For example, air force flyers could carry homing pigeons in their planes. If a plane started to crash, the airmen could throw the pigeon out of the plane with a message attached to its leg saying where the plane was crashing. The pigeon would find its way back \"home\" - to a military base - where the message would tell the military where to look for their stranded pilots. The United Kingdom used about 250,000 homing pigeons in World War II. Of these, 32 were awarded the Dickin Medal for carrying messages that helped save lives: Recipient(s) Date of award Notes Ref(s) White Vision Delivered a message that helped rescue a ditched aircrew in October 1943 Winkie Delivered a message that helped rescue a ditched aircrew in February 1942 Tyke Delivered a message that helped rescue a ditched aircrew in June 1943 Beach Comber Brought the first news of the Allied raid on enemy-occupied Dieppe, France, in 1942; served with the Canadian Army Gustav Brought the first message from the Normandy invasion on 6 June 1944 Paddy Brought a message from the Normandy invasion quicker than any other pigeon in history, in June 1944 Kenley Lass First pigeon to deliver military intelligence from an agent in enemy-occupied France in October 1940; served with the National Pigeon Service Navy Blue Delivered a message from a raiding party in France in June 1944, even though he was injured Flying Dutchman Delivered three messages from agents in the Netherlands; went missing in action on the fourth mission in 1944 Dutch Coast Delivered an SOS message from a ditched aircrew in April 1942, flying 288 miles in 7.5 hours Commando Delivered three messages from agents in occupied France; served with the National Pigeon Service Royal Blue First pigeon of the war to deliver a message from a plane that crashed in Europe, in October 1940 Ruhr Express Carried an important message from the Ruhr Pocket, a major battle in Germany, in April 1945 William of Orange The fastest pigeon ever to deliver a message from Operation Market Garden, a major Allied operation in the Netherlands and Germany; served with the National Pigeon Service (Army) Scotch Lass Brought 38 small photographs across the North Sea from the Netherlands in September 1944, even though she was injured Billy Delivered a message from a bomber which had been forced to land his plane in 1942 Broad Arrow Brought three important messages from Europe to the United Kingdom in 1943; served with the National Pigeon Service (Special Section) NPS.42.NS.2780 Brought three important messages from Europe to the U.K. in 1942 and 1943; served with the National Pigeon Service (Special Section) NPS.42.NS.7524 Brought three important messages from Europe to the U.K. in 1942 and 1943; served with the National Pigeon Service (Special Section) Maquis Brought three important messages from Europe to the U.K. in 1943 and 1944; served with the National Pigeon Service (Special Section) Mary of Exeter Showed \"outstanding endurance [in] war service\" even though she was injured Tommy Delivered a message from the Netherlands to Lancashire in July 1942; served with the National Pigeon Service All Alone Delivered an important message, flying over 400 miles in one day in August 1943; served with the National Pigeon Service Princess Flew a special mission bringing important information to Crete, flying more than 500 miles over sea Mercury Did a special job that required a 480-mile flight from Northern Denmark in 1942; served with the National Pigeon Service (Special Section) NURP.38.BPC.6 Made three flights in 1941; served with the National Pigeon Service (Special Section) G.I. Joe Flew 20 miles in 20 minutes to deliver a message which saved over 100 lives; served with the United States Army Pigeon Service Cologne Flew \"home\" to deliver a message from a crashed airplane over Cologne in 1943, even though he was injured Duke of Normandy The first pigeon to bring a message from Paratroops of the British 21st Army Group on D-Day (6 June 1944); served with the National Pigeon Service NURP.43.CC.1418 The fastest pigeon ever to carry a message to the U.K. from the British 6th Airborne Division at Normandy, 7 June 1944; served with the National Pigeon Service DD.43.T.139 Brought a message from a sinking ship in the Huon Gulf in time to save it and its cargo; served with the Royal Australian Corps of Signals DD.43.Q.879 The only survivor of three pigeons released to warn of a coming counter-attack on Manus Island in Papua New Guinea. The pigeon reached headquarters in time for a U.S. Marine Corps patrol to get to safety. Also served with the Royal Australian Corps of Signals ===Horses=== Horses have been used in wars for over 5,000 years. By World War II, they were usually not used in battle. However, they were used for scout units, and also to carry soldiers and supplies. Recipient(s) Date of award Notes Ref(s) Olga Controlled traffic and helped with rescue operations after a flying bomb exploded in South London; served with the U.K. police Upstart Controlled traffic after a flying bomb exploded in Bethnal Green, Greater London; served with the U.K. police Regal Stayed calm in stable fires caused by fire bombs, on two separate occasions Warrior Honorary award to a World War I warhorse to honor the contributions of all animals during that war ===Dogs=== Recipient(s) Date of award Notes Ref(s) Bob A mongrel who worked on patrol at Green Hill, North Africa; served with the 6th Battalion Queen's Own Royal West Kent Regiment Rip A mongrel who found many trapped victims of The Blitz, when Nazi Germany bombed the United Kingdom badly Jet A German Shepherd who helped rescue people trapped under bombed buildings; served with the Civil Defence Service Irma A German Shepherd who helped rescue people trapped under bombed buildings; served with the Civil Defence Service Beauty A Wire-haired Terrier who helped find buried victims of The Blitz; served with a PDSA Rescue Squad Rob A Collie who made over 20 parachute jumps during fighting in North Africa; served with the Special Air Service (SAS) Thorn A German Shepherd who found bombing victims in a burning building; served with the Civil Defence Service Rifleman Khan A German Shepherd who rescued a soldier from drowning while under heavy shell fire during an attack on Walcheren, an island in the Netherlands, in November 1944; served with the 6th Battalion Cameronians, a regiment of Scottish riflemen in the British Army Rex A German Shepherd who found bombing victims in burning buildings; served with the Civil Defence Service Sheila A Collie who helped rescue four American airmen lost on the Cheviot Hills (on the border between England and Scotland). They got lost in a blizzard after their plane crashed in December 1944 Peter A Collie who found bombing victims trapped in burning buildings; served with the Civil Defence Service Judy A pedigree Pointer who helped keep morale high among fellow prisoners in a Japanese prisoner of war camp Punch and Judy Two Boxers who saved two British officers in Palestine by attacking a nationalist who wanted to kill the officers Ricky A Welsh Collie who found mines along a canal bank at Nederweert in the Netherlands, even though he was injured by one Bing (Brian) A German Shepherd who parachuted into Normandy with the U.K.'s 13th Battalion, 6th Airborne Division Antis A German Shepherd who served with a Czech airman in the French Air Force in North Africa. Antis helped his master escape after the death of Czech diplomat Jan Masaryk Tich A mongrel who was awarded for his \"courage and devotion between 1941–45. He served with the 1st Battalion King's Royal Rifle Corps Gander A Newfoundland who saved Canadian soldiers on at least three separate occasions during the Battle of Hong Kong in December 1941. Gander was killed in action gathering a grenade Appollo A German Shepherd who received the Dickin Medal in honor of all of the search and rescue dogs who tried to find victims of the September 11, 2001, terrorist attacks Salty and Roselle Two Labrador Retriever guide dogs who led their blind owners down more than 70 flights of stairs to escape from the damaged World Trade Center after the September 11 attacks Sam A German Shepherd who brought down an armed man and held back rioters while serving in Bosnia and Herzegovina in April 1998; served with The Royal Canadian Regiment on assignment from the Royal Army Veterinary Corps Buster An English Springer Spaniel who found a weapons arsenal in Southern Iraq in March 2003; served with the Duke of Wellington's Regiment Lucky A German Shepherd who was the only member of a four-dog team to survive tracking nationalists in Malaya from 1949 to 1952. He served with the Royal Air Force Police Sadie A Labrador Retriever who found bombs, which soldiers then were able to disarm, while serving in Kabul, Afghanistan, in November 2005. Served with the Royal Gloucestershire, Berkshire and Wiltshire Regiment Treo A Labrador-Spaniel mix who found improvised explosive devices (IEDs) while serving in Afghanistan in August and September 2008; served with the Royal Army Veterinary Corps Theo A Springer Spaniel who found improvised explosive devices while serving in Afghanistan. He found a total of 14 IEDs, which is the most ever to be found by an arms and explosives search dog. He died from an apparent seizure after his handler was killed by enemy fire earlier that day. Sasha A Labrador who found 15 mortars, mines, IEDs, and weapons while serving in Afghanistan, with the Royal Army Veterinary Corps. In July 2008, Sasha and her handler were killed by a rocket-propelled grenade in an attack by the Taliban. Diesel TBC A Belgian Malinois Research, Assistance, Intervention, Deterrence (RAID) assault dog that worked with the French police. Diesel was killed by suspected terrorists while serving with the police during the November 2015 terrorist attacks on Paris. ===Cat=== See also: Famous Ship's Cats: Simon Recipient(s) Date of award Notes Ref(s) Simon Simon was the HMS Amethyst's ship's cat. He received the Dickin Medal posthumously (after his death) for \"gallantry [bravery] under fire\" during the Yangtze Incident in 1949. Even though he was injured, Simon kept up the morale of fellow sailors, and killed many rats who were destroying the remains of the Amethyst. ==Related pages== * Homing pigeon * Police dog * Ship's cat ==References== Category:Military honors Category:Military animals",
 "title": "Dickin Medal"
}