{
 "id": "528303",
 "text": "Extermination camps (also known as death camps) were built by Nazi Germany during World War II. The goal of the death camps was to kill millions of people as quickly as possible. At the death camps, people were murdered mostly by being given poison gas in gas chambers. However, the Nazis also killed many people in other ways at the death camps. They killed some in mass executions (for example, by shooting many people at once). They killed others through \"extermination through labor.\" This was by making prisoners do very hard forced labor without giving them the food, medical care, or other basic things they needed to survive. Many other people died at the death camps from starvation, illness, and freezing to death. The Nazis sent many different kinds of people to the death camps. However, about 90% of the people killed in the death camps were Jewish. Nazi Germany wanted to 'exterminate' the Jewish people (they wanted to kill all of the Jews, so they would not exist any more). This plan was called the Final Solution.\"Die Endlösung der Judenfrage\" – Adolf Hitler (In English, \"The final solution of the Jewish problem\"). Furet, François. Unanswered Questions: Nazi Germany and the Genocide of the Jews. Schocken Books (1989), p. 182; It is now called the Holocaust.Doris Bergen, Germany and the Camp System, part of Auschwitz: Inside the Nazi State, Community Television of Southern California, 2004–2005 The fascist Ustaše government in the Independent State of Croatia also set up death camps during World War II. At death camps like Jasenovac, they murdered many Serbs, Jews, and other people. As many as 750,000 Serbs may have been killed at these death camps. == Background == The Nazis believed that some groups of people were better than others. They thought that the Aryan race was the best of all. They believed that people who were not \"Aryan\" were \"inferior\". They also believed that non-Ayrans were the cause of Germany's problems. They thought that some groups of people did not even deserve to live. These groups included people with disabilities. The Nazis called these people Lebensunwertes Leben - \"life unworthy of life.\" In 1939, the Nazi Schutzstaffel (SS) started a program to kill everyone who was \"unworthy of life.\" They called this secret program the Action T4 euthanasia program. As part of this program, they killed 70,000 people with disabilities, using carbon monoxide gas. This was the first time the Nazis had used poison gas to kill people. Two years later, the Nazis built the first death camps. Using the things they learned by gassing people with disabilities, the Nazis had decided to start the Final Solution - killing all of the Jewish people, mostly by gassing them. Before the Nazis were ready to kill large numbers of people in gas chambers, the SS Einsatzgruppen started killing many people at a time by shooting them. At the Wannsee Conference in January 1942, the Nazis made it clear that they planned to kill all the Jews in Europe. Adolf Eichmann was put in charge of this program. After this, the Nazis built more death camps, with the goal of killing millions of Jewish people with poison gas. == Definition == The Nazis used death camps and concentration camps for different things. The goal of the death camps was genocide. Their purpose was to kill people who were sent to the camps on trains, thousands at a time. At death camps like Bełżec, Sobibór, and Treblinka, people were usually killed within a few hours after they got to the camps. Concentration camps were different from death camps. Some of the more infamous concentration camps were Buchenwald, Bergen-Belsen, Dachau, and Ravensbrück. These were prison camps which the Nazis set up before World War II started. The Nazis sent people who they did not want in their society to these concentration camps. The Nazis forced millions of people to do forced labor in the concentration camps. Prisoners in concentration camps made up about 25% of the workers in Nazi Germany. Even though the concentration camps were not designed for mass murder, over 75% of the people sent to these camps died because of starvation, illness, exhaustion, executions, and physical abuse. == History == In the early years of World War II, the Jews were mostly sent to concentration camps. However, from 1942 onward, they were mostly deported to the death camps. They were told they were being \"resettled\" - sent to other places to live. The Nazis built many of the death camps in Poland, which the Nazis controlled. They did this because most of the people they wanted to kill lived in Poland. Poland had the most Jewish people in the parts of Europe that the Nazis controlled.\"The evacuation of Jews to Poland\", Jewish Virtual Library.'.' Retrieved 28 July 2009. Also, since these death camps were not in Germany, the Nazis could hide what they were doing from the German people.Ellen Land-Weber, \"Conditions for Polish Jews During WWII \" in To Save a Life: Stories of Holocaust Rescue.'.' Retrieved 28 July 2009. The Nazis created two types of death camps. Some were \"pure extermination camps.\" Their only purpose was to kill people. Others were a combination of concentration camps and death camps. At these camps, the Nazis would kill some people right away. They would force others to work as slaves until they died. ===Pure extermination camps=== The first death camps were Treblinka, Bełżec, and Sobibór. They were built during Operation Reinhard (October 1941 – November 1943), whose goal was to kill all of Poland's Jews. Trains full of people were sent to these camps, and were murdered as soon as they got there. At first, the camp's guards used carbon monoxide to kill the prisoners. They then buried their bodies in mass graves. Later, when there were too many bodies to bury, they started burning the bodies. So they could kill people and get rid of their bodies more quickly, the Nazis built gas chambers and crematoria in Treblinka and Bełżec. At Bełżec, they also started using Zyklon-B poison gas to kill people.See: M. Lifshitz, \"Zionism\" (משה ליפשיץ, \"ציונות\") p. 304. Compare with H. Abraham, \"History of Israel and the nations in the era of Holocaust and uprising (חדד אברהם, \"תולדות ישראל והעמים בתקופת השואה והתקומה\")\" On December 8, 1941, the Nazis opened another death camp called Chełmno.Aktion Reinhard: Belzec, Sobibór & Treblinka , Nizkor Project At first, they killed prisoners at Chelmno inside vans, using carbon monoxide exhaust fumes.Lifshitz, pp. 101–102 Later, like at the other death camps, the Nazis built gas chambers so they could kill more people at a time. Almost all of the prisoners sent to Chelmno were killed right away. However, the Nazis forced a few strong men into work units called Sonderkommando. These prisoners were forced to help take dead bodies out of the gas chambers and burn them. The death camps were small (only several hundred meters long and wide). They also had very little housing or other buildings. Because of this, the Nazis were able to trick the prisoners when they arrived. The Nazis told them they would only be staying at the camp for a short time, before continuing to a work camp farther east. This kept the prisoners from panicking or fighting back. ===Concentration and extermination camps=== After they decided to start the \"Final Solution,\" the Nazis built gas chambers and crematoria inside some of the concentration camps that already existed, like Auschwitz and Majdanek. When people arrived at these camps, they would go through a process called \"selection.\" Nazi guards would choose which prisoners would be kept to work as slaves, and which would be sent right to the gas chambers to be killed. Usually, the Nazis sent elderly people, sick people, and very young children right to the gas chambers. Healthy people were often kept for slave labor, and were forced to work until they were too sick or starved to work as fast as the Nazis wanted. Then the Nazis would \"select\" them for the gas chambers. ===Camps in the Independent State of Croatia=== With the support of Nazi Germany and fascist Italy, the Independent State of Croatia (ISC) was created on 10 April 1941. It was ruled by the fascist Ustaše government, which agreed with the Nazis' ideas about race and politics. The Ustaše agreed with the idea that all Jews and Roma people should be killed. They also agreed with the Nazis that socialists and communists were political enemies. The Ustaše built death camps in the Independent State of Croatia and helped with the Nazis' \"Final Solution\" by killing many Jews and Roma. However, their main goal was to kill all of the Serbian people in the ISC. Also in: Genocide and Fascism; The Eliminationist Drive in Fascist Europe by Aristotle Kallis, Routledge, New York, NY 2009, pages 236-244.M. Shelach (ed.), \"History of the holocaust: Yugoslavia\". The Ustaše treated the Serbian people so cruelly that even the Germans were shocked.\"Nazi Collaborators\", Yesterday TV, UK, 12.00, 11 Jan 2014. The first Ustaše camp was Jadovno concentration camp. It held thousands of Serbs and Jews from May to August 1941. Prisoners were usually killed by being pushed into deep ravines near the camp. The Jasenovac concentration camp replaced Jadovno. Jasenovac was a very large group of many camps. Many prisoners who arrived at Jasenovac were immediately scheduled to be killed. Strong men who could work, and were sentenced to less than three years in the camp, were allowed to live. However, all prisoners sentenced to three years or more were immediately scheduled for execution.State Commission, 1946, pp. 9-11, 46-47 Some prisoners at Jasenovac were killed with poison gas or in mass shootings. However, the Ustaše guards killed many prisoners using their hands, or tools like knives and hammers. == How prisoners were killed == In 1941, top Nazi official Heinrich Himmler went to see a group of Einsatzgruppen perform a mass shooting. The group's commanding officer told him that shooting so many people was psychologically harming the soldiers doing the shootings. Himmler decided the Nazis needed to find another way of killing people.\"Auschwitz: The Nazis and the Final Solution\" Yesterday television channel, 18:00, 18 November 2013 After the war, the diary of Auschwitz's Commandant, Rudolf Höss, showed that many Einsatzkommandos – the killers – either went mad or killed themselves. He wrote that they did this because they were psychologically \"unable to endure wading through blood any longer.\"Hoss , Rudolf (2005). \"I, the Commandant of Auschwitz,\" in Lewis, Jon E. (ed.), True War Stories, p. 321. Carroll & Graf Publishers. . The Nazis had learned from their T-4 program that they could kill people using carbon monoxide. However, they thought sending carbon monoxide to the death camps would be too expensive. In August 1941, Höss' deputy, Karl Fritzsch, tested out an idea. At Auschwitz, clothes infected with lice were treated with crystals of prussic acid (hydrogen cyanide). The crystals' brand name was Zyklon-B. They were made to order by the IG Farben chemicals company. Once their container was opened, the Zyklon-B crystals in the air released a deadly cyanide gas. Fritzch thought this gas could be used to kill prisoners. To try out the effects, he locked some Soviet prisoners of war in the basement of a bunker and gassed them. They died. Gassing with Zyklon-B became Auschwitz's way to exterminate people. It would also be used at Majdanek and other camps. Besides gassing, the camp guards continued to kill prisoners through mass shootings, starvation, torture, and abuse. === Gassings === During the war, Nazi official Kurt Gerstein told a Swedish diplomat about life in a death camp. On 19 August 1942, Gerstein arrived at Bełżec extermination camp, which had carbon monoxide gas chamber. At the time 45 railroad cars, filled with 6,700 Jews, were being unloaded. Many of the Jews had died on the trip. The rest were marched naked to the gas chambers. There Gerstein said: > [The Nazi guards were] making great efforts to get the engine running. But > it doesn't go. ... My stopwatch showed it all, 50 minutes, 70 minutes, and > the diesel engine did not start. The people wait inside the gas chambers. In > vain. They can be heard weeping, \"like in the synagogue,\" says Professor > Pfannenstiel, his eyes glued to a window in the wooden door. Furious, > Captain Wirth whips the Ukrainian [prisoner being forced to help] twelve, > thirteen times, in the face. After 2 hours and 49 minutes – the stopwatch > recorded it all – the diesel started. Up to that moment, the people shut up > in those four crowded chambers were still alive, four times 750 persons, in > four times 45 cubic meters. Another 25 minutes elapsed. Many were already > dead, that could be seen through the small window, because an electric lamp > inside lit up the chamber for a few moments. After 28 minutes, only a few > were still alive. Finally, after 32 minutes, all were dead ... Dentists > [then] hammered out gold teeth, bridges, and crowns. In the midst of them > stood Captain Wirth. He was in his element, and, showing me a large can full > of teeth, he said: \"See, for yourself, the weight of that gold! It's only > from yesterday, and the day before. You can't imagine what we find every day > – dollars, diamonds, gold. You'll see for yourself!\" — Kurt Gerstein To keep people from panicking and fighting back, the Nazis told the prisoners they were going to shower and get deloused (get lice removed). Prisoner Sonderkommando were forced to help in and around the gas chambers. They encouraged the Jews to undress without a hint of what was about to happen. (If the Sonderkommando warned the prisoners, they too would be killed.) The gas chambers were designed to look like shower rooms (with fake water nozzles, and tile walls). The Sonderkommando talked to the victims about life in the camp to keep people from getting suspicious. They also helped the elderly and the very young to undress.Höss, pp. 164-165, 321–322. The Sonderkommando also comforted older children who might cry \"because of the strangeness of being undressed in this fashion\".Höss, pp. 164-165, 322–323. Once the gas chamber was full of people and the door was sealed, Nazi guards dropped Zyklon B through special holes in the roof.Höss, pp. 320, 328. As part of their training, some high-ranked Nazi Party leaders and SS officers were sent to Auschwitz–Birkenau to watch the gassings. Höss reported that \"all were deeply impressed by what they saw ... [but some] ... who had previously spoken most loudly, about the [need] for this extermination, fell silent once they had actually seen the 'final solution of the Jewish problem'.\"Höss, p. 328. === Destroying corpses=== After the gassings, the Sonderkommando removed the corpses from the gas chambers, then took gold teeth out of the bodies. At first, the victims were buried in mass graves. Later, victims' bodies were cremated. The ashes were either buried, scattered, or dumped in a nearby river. In his memoir, Auschwitz Commandant Höss wrote that the Sonderkommando had to: * Burn the corpses in pits of fire * Keep the fires going * Drain extra body fat from the corpses, and * Turn over the \"mountain of burning corpses... so that the draught [air] might fan the flames\" Höss 1959, p. 168. Hess wrote that he was impressed by how hard the Sonderkommando worked, even though they knew they would also be killed eventually. Eventually, the Nazis were killing so many people at Auschwitz-Birkenau that they had three buildings with crematoria designed by specialists from Topf und Söhne. At Auschwitz, prisoners worked every hour of the day to destroy corpses. However, people were being gassed so quickly that not every body could be destroyed in the crematoria. Some corpses were also burned in an open air fire pit. At Sobibór, Treblinka, Bełżec, and Chełmno, the corpses were burned on pyres. == Death toll == Historians estimate that the Nazis murdered over three million people in these camps: Camp Estimated deaths Operational Occupied territory Current country of location Primary means for mass killings 1,100,000 May 1940 – January 1945 Province of Upper Silesia Poland Zyklon B gas chambers Bełżec 600,000 Between March and December 1942, the Germans deported some 434,500 Jews, and an indeterminate number of Poles and Roma (Gypsies) to Belzec, to be killed. http://www.ushmm.org/wlc/article.php?lang=en&ModuleId;=10005191 17 March 1942 – end of June 1943 Nazi-occupied Poland Poland Carbon monoxide gas chambers Chełmno 320,000 In total, the SS and the police killed some 152,000 people in Chełmno. http://www.ushmm.org/wlc/en/article.php?ModuleId=10005194 8 December 1941 – March 1943, June 1944 – 18 January 1945 District of Reichsgau Wartheland Poland Carbon monoxide vans Majdanek 80,000 A recent study reduced the estimated number of deaths at Majdanek, in \"Majdanek Victims Enumerated\", by Pawel P. Reszka, Lublin, in the Gazeta Wyborcza 12 December 2005, reproduced on the site of the Auschwitz–Birkenau Museum, Lublin scholar Tomasz Kranz established that figure, which the Majdanek museum staff consider authoritative. Earlier calculations were greater: ca. 360,000, in a much-cited 1948 publication by Judge Zdzisław Łukaszkiewicz, of the Main Commission for the Investigation of Nazi Crimes in Poland; and ca. 235,000, in a 1992 article by Dr. Czesaw Rajca, formerly of the Majdanek museum. October 1, 1941 – July 22, 1944 Nazi-occupied Poland Poland Zyklon B gas chambers Maly Trostinets 200,000 Yad Vashem, Summer of 1941 to 28 June 1944 Belarus Mass shootings, gas van At the Maly Trostenets extermination camp in Belarus, USSR, some 65,000 Jews were murdered according to Yad Vashem (PDF file, direct download) whilst the estimated number of 200,000 people perished in the Trostenets area. See also: Yad Vashem overview. Internet Archive. Sajmište 23,000– 47,000 28 October 1941 – July 1944 Independent State of Croatia Serbia Carbon monoxide van Sobibór 250,000 In all, the Germans and their auxiliaries killed at least 170,000 people at Sobibór. Holocaust Encyclopedia. 16 May 1942 – 17 October 1943 Nazi-occupied Poland Poland Carbon monoxide gas chambers Treblinka 800,000 The Höfle Telegram indicates some 700,000 killed by 31 December 1942, yet the camp functioned until 1943, hence the true deaths total likely is greater. 22 July 1942 – 19 October 1943 Nazi-occupied Poland Poland Carbon monoxide gas chambers Total 3,115,000–3,215,000 Holocaust Encyclopedia, NAZI CAMPS. United States Holocaust Memorial Museum.Terese Pencak Schwartz, The Holocaust: Non-Jewish Victims. Jewish Virtual Library. ==Camps are destroyed== When they realized they were going to lose World War II, the Nazis tried to destroy the death camps in order to hide the evidence of what they had done. They wanted to hide evidence that so many people had been killed. This meant they needed to destroy the camps, and also hide the corpses of their many victims. The Nazis forced prisoners to destroy the camps and their records, and to dig up mass graves. Some extermination camps were liberated (taken over and freed) by Soviet soldiers before the Nazis could destroy evidence of their war crimes. For example, Majdanek was captured nearly intact before the Nazis were able to destroy very much. This happened because the Soviet Red Army got to the camp very quickly, which prevented the SS from destroying most of the camp. ==Related pages== * The Holocaust * The Final Solution * Nazi concentration camps * World War II * War crimes ==References== Category:History * Category:The Holocaust Category:World War II Category:Nazi Germany Category:Genocide Category:War crimes Category:Crimes against humanity Category:Crimes against prisoners of war",
 "title": "Extermination camp"
}