{
 "id": "528777",
 "text": "Crispus Attucks (circa 1723 – March 5, 1770) was the first person to die in the Boston Massacre.Lowery, Malinda Maynor. \"African and Native Americans in Colonial and Revolutionary Times .\" Teachinghistory.org . Accessed 13 July 2011. This made him the first American to die in the American Revolutionary War. After being killed at the Boston Massacre, Attucks became a martyr of the American Revolution. He also became a symbol for the abolitionist (anti- slavery) movement, both in the 18th century and the 19th century. Attucks had a big impact on important historical events like the American Revolution and the abolitionist movement. However, he continues to have an impact on American culture today. Even 250 years after his death, modern songs, stories, and television shows still talk about Attucks. Children go to schools that are named after him. In 2002, Attucks was named one of the \"100 Greatest African Americans\" in United States History. == Early life == Aside from how he died, historians do not know much about Attucks' life. His father, Prince Yonger, was a slave who had been born in Africa; his mother, Nancy Attucks, was a Wampanoag Native American. One of Crispus Attucks' ancestors was John Attucks of Massachusetts, who was hanged during King Philip's War. Attucks himself may have been a freeman, or may have escaped slavery. Some evidence suggests that he was born a slave in Framingham, Massachusetts, but escaped from slavery. In 1750, William Brown, a slave-owner in Framingham, put out an advertisement about a runaway slave named Crispus. In the advertisement, Brown offered a reward of 10 pounds to whoever found and returned Attucks to him. The description in the advertisement fit Crispus Attucks, suggesting that Attucks was the runaway slave. Still, people have argued for decades about whether Attucks was a free black man or a runaway slave. Attucks may have worked as a dockworker or a merchant seaman. He definitely became a sailor and spent most of the rest of his life at sea. He often worked on whalers, which involved long trips at sea. Many historians also believe that he went by the alias \"Michael Johnson\" in order to avoid being caught and sent back to slavery. He may only have been temporarily in Boston in early 1770, having recently returned from a voyage to the Bahamas. He was due to leave shortly afterwards on a ship for North Carolina. == Reaction and trials == John Adams successfully argued that most of the accused British soldiers fired their guns in self-defense. He got all but two of the soldiers acquitted of murder (found not guilty). Two of the soldiers were found guilty of manslaughter and were punished by being branded (burned) on their thumbs. While defending the British soldiers, Adams called the crowd \"a motley rabble of saucy boys, negros and molattoes, Irish teagues and outlandish Jack Tarrs.\" In particular, he accused Attucks of having decided \"to be the hero of the night,\" and of having started a conflict with his \"mad behavior.\"Wilson, James Grant; Fiske, John, eds. (1900). \"Attucks, Crispus\". Appletons' Cyclopædia of American Biography. New York: D. Appleton. The five people killed in the Massacre were buried as heroes in the Granary Burying Ground, which also contains the graves of Samuel Adams, John Hancock, and other important people. ==Importance in history== After being killed in the Boston Massacre, Attucks was held up as the first martyr of the American Revolution. The deaths of Attucks and four other Americans enraged the American people and helped trigger the start of the American Revolution. Attucks also became a symbol of the abolitionist (anti-slavery) movement in the 18th century. In the early 19th century, as the abolitionist movement gained strength in Boston, supporters praised Attucks as an African American who played a heroic role in the history of the United States.Margot Minardi, The Inevitable Negro: Making Slavery History in Massachusetts, 1770–1863 (Harvard University: PhD Dissertation, 2007.) Because Attucks was of mixed African and Native American heritage, he also became an important figure in Native American history. == Legacy and honors == * 1858: Boston-area abolitionists, including William Cooper Nell, created \"Crispus Attucks Day\" to honor Attucks. * 1888: A monument honoring Attucks and the other victims of the Boston Massacre was created on Boston Common. It is over 25 feet high and about 10 feet wide. It shows the Boston Massacre, with Attucks lying in the foreground. Under the scene is the date: March 5, 1770. Above the scene stands a female figure, Free America, holding the broken chain of oppression in her right hand. Beneath her right foot, she crushes the royal crown of England. At the left of the figure is an eagle. Thirteen stars are cut into one of the faces of the monument. Beneath these stars in raised letters are the names of the five men who were killed that day: Crispus Attucks, Samuel Gray, James Caldwell, Samuel Maverick, and Patrick Carr. Some men died a day later. * In 1888, the Massachusetts Historical Society and the New England Historic Genealogical Society did not want the Attucks memorial to be created. However, since the 20th century, both organizations have acknowledged his importance in history, and have created museum exhibits about black history and genealogy. * 1998: The United States Treasury released \"The Black Revolutionary War Patriots Silver Dollar\" featuring Attucks' image. Funds from sales of the coin were intended for a proposed Black Revolutionary War Patriots Memorial in Washington, DC. * 2002: The Afrocentrist scholar Molefi Kete Asante listed Crispus Attucks as among the 100 Greatest African Americans. * Places named for Attucks include the Crispus Attucks High School in Indianapolis, Indiana; Attucks Middle School in Sunnyside, Houston, Texas; the Crispus Attucks Elementary School in Kansas City, Missouri; the Attucks Theatre in Norfolk, Virginia; the Crispus Attucks Association in York, Pennsylvania; Crispus Attucks Road in Spring Valley, New York; Crispus Attucks Elementary School in Bedford-Stuyvesant, Brooklyn; Crispus Attucks Park in Carbondale, Illinois; Crispus Attucks Elementary School in East St. Louis, Illinois; Crispus Attucks Park in Washington, D.C.; the Crispus Attucks Center in Dorchester, Massachusetts; and the Crispus Attucks Bridge in Framingham, Massachusetts. == In popular culture == * \"First man to die for the flag we now hold high was a black man\" is a line from Stevie Wonder's song \"Black Man\". * \"Crispus Attucks, the first blasted\" is a line from Nas's song \"You Can't Stop Us Now\". * The poet John Boyle O'Reilly wrote the following poem when the monument was finally unveiled: :And to honor Crispus Attucks who was the leader and voice that day: The first to defy, and the first to die, with Maverick, Carr, and Gray. Call it riot or revolution, or mob or crowd as you may, such deaths have been seeds of nations, such lives shall be honored for aye... * Melvin Tolson begins his poem \"Dark Symphony\" with the lines: : \"Black Crispus Attucks taught / Us how to die / Before white Patrick Henry’s bugle breath / Uttered the Vertical / Transmitting cry: / 'Yea, give me liberty or give me death.'” * Martin Luther King, Jr. spoke about Attucks in the introduction of Why We Can't Wait (1964), as an example of a man whose contribution to history provided a strong message of moral courage. * In an unsourced, popular book about Attucks, James Neyland wrote his appraisal of the man's significance: :He is one of the most important figures in African- American history, not for what he did for his own race but for what he did for all oppressed people everywhere. He is a reminder that the African-American heritage is not only African but American and it is a heritage that begins with the beginning of America. * Attucks is discussed at length in the book \"Rush Revere and the First Patriots\" by Rush Limbaugh. The book is second in a series celebrating \"Exceptional Americans.\" * Nat King Cole mentions Crispus Attucks in the spoken introduction to his Capitol Records recording of \"We Are Americans, Too\". ==References== Category:1723 births Category:1770 deaths Category:People from Massachusetts Category:African-American people Category:Murdered African-American people Category:American revolutionaries Category:Slaves Category:Native American people Category:Murdered Native American people Category:Deaths by firearm in the United States",
 "title": "Crispus Attucks"
}