{
 "id": "528866",
 "text": "The law of the United States is made up of many levelsSee Stephen Elias and Susan Levinkind, Legal Research: How to Find & Understand The Law, 14th ed. (Berkeley: Nolo, 2005), 22. of codified and uncodified forms of law. The most important these is the United States Constitution. This established the federal government of the United States. The Constitution sets out the boundaries of federal law. This consists of acts of Congress, treaties ratified by the Senate, regulations promoted by the executive branch, and case law originating from the federal judiciary. The United States Code is the official compilation and codification of general and permanent federal statutory law. Federal law and treaties, so long as they are in accordance with the Constitution, preempt conflicting state and territorial laws in the 50 U.S. states and in the territories.William Burnham, Introduction to the Law and Legal System of the United States, 4th ed. (St. Paul, MN: Thomson West, 2006), p. 41. However, the scope of federal preemption is limited because the scope of federal power is not universal. In the dual-sovereign system of American federalism states are the plenary sovereigns. Each state has its own constitution, while the federal sovereign possesses only the limited supreme authority given by the Constitution. States may grant their citizens broader rights than the federal Constitution as long as they do not infringe on any federal constitutional rights. Most U.S. law (especially the actual \"living law\" of contract, tort, property, criminal, and family law) experienced by the majority of citizens on a day-to-day basis consists primarily of state law, which can and does vary greatly from one state to the next.Lawrence M. Friedman, A History of American Law, 3rd ed. (New York: Touchstone, 2005), pp. 307, 504-505.Graham Hughes, \"Common Law Systems,\" in Fundamentals of American Law, ed. Alan B. Morisson, 9-26 (New York: Oxford University Press, 1996), 33. At both the federal and state levels, the law of the United States is largely based on the common law system of English law. This was the system of law that was in force at the time of the Revolutionary War. However, American law has changed from its English ancestor both in terms of substance and procedure.G. Edward White, Law in American History, Volume 1: From the Colonial Years Through the Civil War (Oxford: Oxford University Press, 2012), pp. 48-51. American law also borrows ideas from civil law. == References == Category:United States Constitution",
 "title": "Law of the United States"
}