{
 "id": "528969",
 "text": "The Hartheim Killing Facility () was a killing centre that Nazi Germany used to kill people with disabilities during World War II. The Nazis' ideas about eugenics said that people with disabilities were \"life unworthy of life\" - meaning they did not deserve to live. Hartheim was one of six \"euthanasia centres\" the Nazis set up for Aktion T4, their secret \"euthanasia\" program. Their goal was to get rid of all of Germany's people with disabilities. The killing centre was housed in Hartheim Castle in Alkoven, near Linz, Austria. == Hartheim statistics == In June 1945, after the United States took over Austria, an American soldier found the Hartheim statistics in the Castle. This was a 39-page report written about Aktion T4. It was meant to be seen only by other Nazis in the program. In the report were monthly counts of how many people with mental and physical disabilities were \"disinfected\" (gassed to death) in the Nazis' six euthanasia centres.Page from the Hartheim Statistics (accessed on 22 November 2010) In 1968 and 1970, an ex-employee said that he had to put together the material at the end of 1942.Zur Fundgeschichte siehe: Klee: Euthanasie im NS-Staat, p. 478 and note 23\\. For the location of the originals see also: Friedlander: Der Weg zum NS-Genozid, p. 518 f. in note 99. The Hartheim statistics included a page that said that \"disinfecting [killing] 70,273 people with a life expectation of 10 years\" had saved food in the value of 141,775,573.80 Reichsmarks.Klee: Euthanasie im NS-Staat, p. 24. === Numbers killed in the first extermination phase in Hartheim === According to the Hartheim statistics, between May 1940 and 1 September, 1941, a total of 18,269 people were killed in the gas chamber at Hartheim:Klee: Dokumente zur Euthanasie, p. 232 f. Year 1940 1941 Total killed Month May Jun Jul Aug Sep Oct Nov Dec Jan Feb Mar Apr May Jun Jul Aug Deaths 633 982 1,449 1,740 1,123 1,400 1,396 947 943 1,178 974 1,123 1,106 1,364 735 1,176 18,269 These statistics only cover the first extermination phase of the Nazi's euthanasia programme, Aktion T4. Hitler officially ended that program because of protests, but secretly he kept killing people with disabilities (and others he did not like). In all, it is estimated that a total of 30,000 people were executed at Hartheim. The victims included sick prisoners, prisoners with disabilities, and prisoners from concentration camps. The killings were carried out by carbon monoxide poisoning. === 14 f 13 \"Special Treatment\" programme === The Hartheim killing centre achieved a special reputation, because it was where the largest number of patients, and the most concentration prisoners, were gassed. The Nazis murdered an estimated 12,000 people there.Klee: Euthanasie im Dritten Reich, p. 290. Just three days after the formal end of Aktion T4, a lorry arrived at Hartheim with 70 Jewish inmates from Mauthausen concentration camp. The inmates were killed at Hartheim.Klee: Euthanasie“ im Dritten Reich, p. 266. After this, prisoners at Mauthausen who were no longer able to work (especially in the quarries) and \"politically undesirable\" prisoners were brought to Hartheim to be executed. These victims included: * \"German-haters\" (people who did not agree with what the Nazis were doing) * \"Communists * \"Polish fanatics\" From 1944 on, T4 doctors no longer picked out sick, elderly, or disabled prisoners to be killed. Instead, the Nazis' new goal was to free up space in the Mauthausen camp quickly, so they would send groups of women to Hartheim to be killed.Klee: Euthanasie im Dritten Reich, p. 292. Other transports came from the concentration camp of Gusen, and probably also from Ravensbrück, during 1944. These transports were made most of women with tuberculosis and women who had been labeled mentally ill. ==Doctors== Adolf Hitler's order from 1 September 1939 approving the start of the T4 Programme only mentioned doctors. Because of this, the Aktion T4 organisers, Viktor Brack and Karl Brandt, ordered that only medical doctors could execute sick patients. Doctors controlled the poison gas in the euthanasia centres. Many doctors used fake names in records about the people they killed. From 1940 to 1945, Rudolf Lonauer was the head doctor at Hartheim, and Georg Renno was his deputy. == Niedernhart holding station == The Aktion T4 Euthanasia Centres had temporary holding stations for victims. For example, many trucks carrying victims to Hartheim would stop at the Niedernhart Mental Institute in Linz, where Rudolf Lonauer was the senior doctor, as he was at Hartheim. At Niedernhart, victims were put into categories. Usually, they were killed by starvation or overdose (by giving deadly amounts of medicine). Others were taken to Hartheim to be killed. ==Victims== ===People with disabilities=== The Nazis thought that many different groups of people, but especially people with disabilities, were \"life unworthy of life.\" They killed children and adults in their Euthanasia Centers. These victims included: * People with medical problems, like epilepsy and muscular dystrophy * People with physical disabilities * People with mental illnesses, like schizophrenia and bipolar disorder * People with intellectual disabilities (what was then called mental retardation or \"feeble- mindedness\") * People who were deaf or blind ===Clergy=== Almost 350 priests were killed at Hartheim. These victims included 310 Polish priests, seven Germans, six Czechs, four Luxemburgians, three Dutch, and two Belgians. Many of them were taken from the Priest's Block in Dachau concentration camp. Dachau's chaplain, Hermann Scheipers, was also moved to the camp's invalid's block so he could be taken to Hartheim as well. Scheipers' sister—who had kept in touch with Schiepers by mail—tracked down Dr. Bernsdorf, who was in charge of the clergy imprisoned in the Priest's Block. She told him that, in Münsterland, many people knew that imprisoned priests were sent to the gas chambers. After the conversation, Bernsdorf telephoned the commandant's office at Dachau. Scheipers reported that on that same day, 13 August 1942, he and three other German clergymen were saved from being sent to Hartheim. They were moved from the invalid's block, where the Schutzstaffel (SS) sent prisoners when they were going to be sent to another camp. The four clergymen were sent back to the priest's block. ==Related pages== * Nazi eugenics * The Holocaust * Nazi Germany ==References== Category:The Holocaust Category:Euthanasia Category:Upper Austria Category:20th-century establishments in Austria",
 "title": "Hartheim Killing Facility"
}