{
 "id": "529053",
 "text": "In humans, the respiratory tract is the parts of the body that help with respiration (getting oxygen into the body and getting rid of carbon dioxide). ==Structure== The respiratory tract is divided into two sections: the upper airways and the lower airways. These two sections are separated by the vocal cords. ===Upper airways=== ==== The nose and nasal cavity ==== The upper respiratory tract starts with the nose and the nasal cavity. When a person breathes in through the nose, the air goes into the nasal cavity. The nasal cavity is lined with mucous and little hairs called cilia. These help filter things like dust out of the air a person breathes. The nasal cavity also warms the air. ==== The pharynx ==== Next is the pharynx. The pharynx is a common pathway for air and food. When a person breathes in, air goes through the pharynx on its way to the lungs. When a person eats, food passes through the pharynx on its way to the digestive system. There are three parts to the pharynx: # The nasopharynx ends around the uvula. # The oropharynx goes from the uvula to the base of the tongue. # The laryngopharynx (or hypopharynx) ends by splitting off into two tubes. These are the trachea and the esophagus. The trachea is in the front of the throat, and carries air toward the lungs. The esophagus is in the back of the throat, and carries food toward the digestive system. ==== The larynx ==== The next part of the upper airways is the larynx. The larynx is sometimes called the \"voice box\" because it has the vocal cords in it, making it possible to speak. The larynx also protects the trachea. Important parts of the larynx include: * The epiglottis: This is a leaf-shaped piece of cartilage which drops to protect the trachea when a person swallows food. This keeps the food from going down the trachea and into the lungs. * The thyroid cartilage (Adam's apple) * The vocal cords The vocal cords mark the end of the upper airways. ===Lower airways=== ==== The larynx continues ==== The larynx continues in the lower airways. Important parts of the larynx that are in the lower airways include: * The cricoid cartilage: This is a ring of cartilage which anchors the trachea. The trachea begins at the cricoid cartilage. * The trachea: This is a tube made of smooth muscle which brings air to the lungs. Because it is made of muscle, the trachea needs cartilage, which is stronger than muscle, to protect it. After the cricoid cartilage, many C-shaped pieces of cartilage surround the trachea to protect it and anchor it. ==== The bronchi ==== The trachea then splits into the two main bronchi. This split happens at a place called the carina, which is behind the middle of the sternum (breastbone). The bronchi are two tubes which carry air into the lungs. The main bronchi then split into smaller and smaller bronchi, which reach out into all the parts of the lungs like tree branches. Finally, the smallest bronchi, called bronchioles, end in the alveoli. ==Function== The airways' job is to bring air to the lungs, so it can get to the alveoli. At the alveoli, a very important process called \"gas exchange\" takes place. Oxygen from the air breathed into the lungs goes into the blood. The blood can then carry oxygen to every part of the body through the bloodstream. During gas exchange, carbon dioxide goes from the blood into the lungs, so it can be breathed out. If this exchange of gases did not happen, the body would not get enough oxygen to stay alive, and would also get poisoned by carbon dioxide. ==Related pages== * Respiratory system * Respiration * Gas exchange * Breathing ==References== Category:Anatomy of the respiratory system",
 "title": "Respiratory tract"
}