{
 "id": "52906",
 "text": "Alexandre Dumas, fils (fils is French for son), (27 July 1824 – 27 November 1895) was the son of Alexandre Dumas, père (père is French for father). Like his father, Alexandre Dumas, fils was a celebrated author and playwright. Alexandre Dumas fils was born in Paris, France, the illegitimate child of Marie-Catherine Labay, a dressmaker, and novelist Alexandre Dumas. In 1831 his father legally recognized him (he adopted him) and ensured the young Dumas received the best education possible at the Institution Goubaux and the College Bourbon. At that time, the law allowed the elder Dumas to take the child away from his mother. Her agony inspired Dumas fils to write about tragic female characters. In almost all of his writings, he emphasized the moral purpose of literature and in his 1858 play, Le fils naturel (The Illegitimate Son), he wrote about the belief that if a man fathers an illegitimate child, then he has an obligation to legitimize the child and marry the woman. Dumas' paternal great-grandparents were a white French nobleman and a young black Haitian woman. In the boarding schools, Dumas fils was constantly taunted by his classmates. These issues all profoundly influenced his thoughts, behaviour, and writing. In 1844, Dumas fils moved to Saint-Germain-en-Laye to live with his father. There, he met Marie Duplessis, a young courtesan who would be the inspiration for his romantic novel, La dame aux camélias (The Lady of the Camellias). Adapted into a play, it was titled in English (especially in the United States) as Camille and is the basis for Verdi's 1853 opera, La Traviata. Although he admitted that he had done the adaptation because he needed the money, he had a huge success with the play. With this work began the playwriting career of Dumas fils which not only eclipsed that of his father during his lifetime but also dominated the serious French stage for most of the second half of the nineteenth century. After this, he virtually abandoned the novel (though his semi-autobiographical L'Affaire Clemenceau (1867) achieved some success). In 1864, Dumas married Nadeja Naryschkine, with whom he had a daughter. After Naryschkine's death, he married Henriette Regnier. In 1874, he was admitted to the Académie française and in 1894 he was awarded the Légion d'Honneur. Alexandre Dumas the son died at Marly-le-Roi, Yvelines, on 27 November 1895 and was interred in the Cimetière de Montmartre in Paris. It was, perhaps coincidentally, only some 100 metres away from Marie Duplessis. == Books == * La dame aux camélias (Camille or The Lady of the Camellias, 1848) * L'affaire Clemenceau (The Clemenceau Case, 1867) == Opera == * Verdi's La Traviata was based on the novel The Lady of the Camellias == Plays == * Atala (1848) * La Dame aux camélias (1852) * Diane de Lys (1853) * Le Bijou de la reine (1855) * Le Demi- monde (1855) * La Question d'argent (1857) * Le Fils naturel (The Illegitimate Son or The Natural Son, 1858) * Un Père prodigue (1859) * Un Marriage dans un chapeau (1859) coll. Vivier * L'Ami des femmes (1864) * Le Supplice d'une femme (1865) coll. Emile de Girardin * Heloise Paranquet (1866) coll. Durentin * Les Idees de Madame Aubray (1867) * Le Filleul de Pompignac (1869) coll. Francois * Une Visite de noces (1871) * La Princesse Georges (1871) * La Femme de Claude (1873) * Monsieur Alphonse (1873) * L'étrangère (1876) * Les Danicheff (1876) coll. de Corvin * La Comtesse Romani (1876) coll. Gustave Fould * La Princesse de Bagdad (1881) * Denise (1885) * Francillon (1887) == Other websites == * Category:1824 births Category:1895 deaths Category:French playwrights Category:French novelists Category:Burials at Montmartre Cemetery, Paris Category:Members of the Académie française",
 "title": "Alexandre Dumas, fils"
}