{
 "id": "529986",
 "text": "The Middle Passage was the part of the Atlantic slave trade where African slaves were brought to the Americas on slave ships. Millions of African people were shipped to the Americas over the Middle Passage. This was a type of human trafficking. ==Overview== According to the Slave Voyage Database hosted by Rice University, more than 36,000 voyages forcibly transported enslaved Africans across the Middle Passage between 1514 and 1866. Enslaved people were treated so badly on the slave ships that about 15% of them died during the Middle Passage. Even more were killed before they left West and Central Africa, when slave traders were trying to kidnap them and force them onto the slave ships. Historians think that up to two million African people died during the Middle Passage. However, somewhere between 9.4 million and 12 million African people survived and arrived in the Americas as slaves. ==The triangular trade== The transatlantic trade of African people had three different parts. Because of this, it was called \"the triangular trade.\" The Middle Passage got its name because it was the middle part of the triangular trade. The three parts of the Atlantic slave trade are described below. The three parts of the Atlantic slave trade were: ===Part 1: Europe to West and Central Africa=== This step involved bringing goods from Europe to West and Central Africa. Ships brought weapons, gunpowder, cloth, rum, and manufactured goods. They traded these things for African people who had been bought as slaves or kidnapped. ===Part 2: Africa to the Americas=== During this part of the slave trade, slave ships brought people from West and Central Africa over the Middle Passage to the Americas. There they were sold as slaves, or traded for raw materials that other enslaved people had made (like sugar, tobacco, and cotton). ===Part 3: The Americas to Europe=== These raw materials would be sent to Europe, where they were used to make things. Then the triangular trade would start all over again. For example, cotton would be used to make cloth. That cloth could then be sent to West and Central Africa to trade for more enslaved people. ==Journey== Sailing through the Middle Passage could take anywhere from one to six months, depending on the weather. Over time, human trafficking ships got better at making the trip more quickly. In the early 16th century, the average trip took a few months. However, by the 19th century, many slave ships crossed the Middle Passage in fewer than six weeks. ===Before the ships=== After being kidnapped, enslaved African people were usually forced to march to forts along the western coast of Africa. There they were sold to European, European American and European Brazilian human traffickers. They might have to wait in these forts, which were like prisons, for months before slave ships arrived. ===Forced onto slave ships=== Enslaved people were then packed onto the slave ships. Often, they were packed together as closely as possible. (The famous drawing on the right shows how closely enslaved people were packed together on some slave ships.) Enslaved men were often chained together at the ankles. Sometimes, slaves were allowed to move around during the day, but many ships kept enslaved people chained up for the entire trip. ===Crossing the Middle Passage=== Enslaved people were treated barbarically and wickedly during the Middle Passage because they were not viewed as human. Instead, they were viewed as \"cargo\" or \"goods\" to be bought and sold: property instead of people. In this view, enslaved people did not have any rights or deserve respect because they were less than human. ==Living conditions== ===Starvation and dehydration=== Many enslaved people died during the Middle Passage because they were not given enough food or enough water to survive. At \"best\", they were fed beans, corn, yams, rice, and palm oil. However, enslavers did not always feed the enslaved people every day. If there was not enough food for the sailors and the slaves, the enslavers would eat first, and the enslaved might not get any food. On some slave ships, slaves who looked sick were not given any food. ===Disease=== Diseases spread very quickly on slave ships because the enslaved people were so crowded together and did not have sanitation. The most common diseases were dysentery, scurvy, smallpox, syphilis, and measles. Many enslaved African people were killed by disease during the Middle Passage. On longer trips, even more enslaved people died, because there was less food and water (which made dysentery and scurvy more common). Also, many slaves became too depressed to eat. ===Torture=== Slaves were often tortured as punishment if they did not follow the human traffickers' orders or if they seemed disobedient in any way. For example, enslaved people who were too depressed or sick to eat might be beaten or whipped. The worst forms of torture were for enslaved people who tried to rebel (fight back). For example, when one enslaved person tried to revolt, the ship's captain murdered him, then forced two other slaves to eat his heart and liver. ===Sexual violence=== Enslaved women and enslaved children were often raped or sexually abused by the sailors. ==Participants== Different groups participated in the Middle Passage and the triangular trade. ===Great powers=== Powerful European countries controlled most of the slave trade. These countries included: * Spain * France * Sweden * Denmark * Portugal * Great Britain * The Netherlands * Brandenburg (now a state of Germany) Slave traders in the United States (US), South America, especially Brazil, and the Caribbean also took part in the slave trade. Different countries had more power over the slave trade at different times. For example, for two hundred years (c. 1440–1640), Portugal controlled most of the slave trade. However, over time, the balance of power in Europe changed. By the 18th century, the British Empire was much more powerful. Back then, 6 million Africans were brought over the Middle Passage, and British slavers carried almost 2.5 million of them. ===Enslaved Africans=== Most of the African slaves came from eight different areas: * Gold Coast * Senegambia * Bight of Benin * Upper Guinea * Bight of Biafra * Windward Coast * Southeastern Africa * West and Central Africa ===Slave traders=== The slave trade was very profitable for slave traders. By the late 18th century, a strong male slave could be sold for about $600 to $1500 (which is about $9,000 to $15,000 in United States dollars today). Kidnapping people in West and Central Africa and selling them into slavery became more and more popular, and the slave trade grew. ===Others=== Historians think that some African warlords, African kings, African queens and private kidnappers (Europeans, European Americans, European Brazilians and Africans alike) participated in kidnapping people into slavery. ==Gallery== File:Slave baracoon, Sierra Leone, 1849.jpg|In slave barracoons, like this one in 1849 Sierra Leone, enslaved Africans were jailed until slave ships were ready. File:The Slave Trade by Auguste Francois Biard.jpg|The Slave Trade (Slaves on the West coast of Africa) by Auguste François Biard. File:Slaveshipposter.jpg|Plan of the slave ship Brookes, showing how tightly slaves were packed into the ship. File:NavioNegreiro.gif|Illustration of how crowded it was on many slave ships. File:Thomas-Clarkson-De-kreet-der- Afrikanen MG 1315.tif|Drawing of a large, four-level slave ship. File:Slave- ship.jpg|Painting of dead and dying slaves being thrown into the sea, by J.M.W. Turner. ==References== Category:Historic slave trade",
 "title": "Middle Passage"
}