{
 "id": "530049",
 "text": "Slave ships were large cargo ships that had been changed so they could transport slaves. They were key to the triangular trade. Slave ships brought newly enslaved African people to the Americas. This trip across the Atlantic Ocean was called the Middle Passage. Between 1526 and 1867, slave ships brought around 12.5 million slaves from Sub-Saharan Africa to the Americas. Conditions were horrible, and around 1.8 million slaves died along the way. This was the deadliest migration in human history. == Conditions == Living conditions for slaves on these ships were awful. Men, women and children were crowded into every possible space, leaving no room to move or even breathe. There was little food, fresh water, or fresh air, and the smell was terrible. Sickness was widespread. Sometimes Africans were kept on deck, chained together with long chains. Sometimes they would jump overboard, taking every other chained slave with them, to avoid their unknown fate. Many ships kept extra crew members on deck to prevent this from happening. Sometimes crew members threw slaves overboard as a warning to other slaves. If the ship was running out of food or water, all the slaves would be killed to save the crew from starving. On average, it took 60 to 90 days to sail across the Atlantic. However, some journeys took up to four months. === \"Saleable\" slaves === Slavers ordered ship captains to deliver only those slaves who could be sold.Toyin Falola, Encyclopedia of the Middle Passage (Westport, CT: Greenwood Press, 2007), p. 145 If a slave was starving, sick, or troublesome they were often thrown overboard into the ocean to drown. === Zong massacre === Sometimes, slave ships could get insurance on their slave cargos . Insurance would not pay out for sick or starving slaves - but they would pay if the slaves drowned. In 1781 the slave ship Zong was hauling 470 slaves—more than the ship could handle. Many people on the ship got sick. By the time the ship reached the Doldrums (a mid-Atlantic region that sometimes had no wind), several of the crew had died from diseases. To save themselves, the remaining crew threw 132 dying and sick slaves into the ocean. Another 10 slaves jumped with them. When the ship's owners tried to collect the insurance, the insurance company refused to pay. In 1782 a Jamaican court ruled in favor of the owners. The insurance company appealed the decision, and this brought a good deal of public attention. The revolt came to be called the Zong massacre. No member crew member or owner was ever charged with murder. == Slave ship takeovers == About 15% to 20% of the ships leaving Africa never arrived in the Americas. In thousands of cases the crews were overtaken by captured slaves, some of them warriors. Often the crew was killed and the Africans managed to sail back to Africa. In other cases the ships were lost at sea. Several documented slave ship revolts are listed below. === The Little George ship revolt (1730) === This revolt happened after the ship Little George left Guinea in June of 1730. It was carrying 96 slaves to Rhode Island. Several of the African men slipped out of their shackles and overpowered the crew. They killed three crew members who were on deck at the time. The rest were taken prisoner. The Africans sailed the Little George back to the Sierra Leone River, where they abandoned the ship and still imprisoned crew. === The Amistad revolt (1839) === In 1839 the Spanish ship La Amistad was sailing off the coast of Cuba in the process of smuggling slaves. By this time slave trading was illegal except in Cuba. Joseph Cinqué, who had been captured as a slave in Sierra Leone, led a revolt that had far-reaching consequences. It resulted in a court case in Connecticut, which was appealed to the Supreme Court of the United States. The Supreme Court upheld the Connecticut verdict. Cinqué and the surviving Africans returned to Sierra Leone in 1842. === The Creole uprising (1841) === The ship Creole sailed from Richmond, Virginia on Oct. 27, 1841. It was bound for New Orleans with a cargo of 135 slaves. The slaves revolted, killed some of the crew, and took the rest of them captive. The ship arrived at Nassau, Bahamas, where the slaves were set free by the British. === Unnamed British ships === In 1732 a ship out of Portsmouth, New Hampshire, Thirteen Colonies (now the United States) captained by John Major had just loaded hundreds of slaves and was leaving when about 50 Africans took over the ship. They killed the crew with guns, axes, swords and other weapons taken from the crew members. In 1747 a British ship with a captain named Beers was taken over by hundreds of captive Africans in West Africa. All but two of the crew were killed with their own weapons. There was no record of how many Africans died during the short battle. In 1764, an unnamed ship from New London, Connecticut, Thirteen Colonies had just taken on a load of slaves in Senegal. That night, while the ship was still in port, the Africans freed themselves. Using clubs, they killed the ship's captain and the entire crew. The Africans then disappeared back into Senegal. == References == Category:Historic slave trade Category:Ship types",
 "title": "Slave ship"
}