{
 "id": "530318",
 "text": "The following is a list of notable deaths in February 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==February== ===1=== * Óscar Humberto Mejía Victores, 85, Guatemalan military officer and politician, President (1983–1986), Parkinson's disease.Guatemalan Gen. Mejia Victores Dies * Paul Pholeros, 62, Australian architect, cancer.Paul Pholeros, architect who helped reduce Indigenous poverty, dies at 62 ===2=== * Bob Elliott, 92, American comedian (Bob and Ray) and actor (Get a Life), throat cancer.Bob Elliott, of Bob and Ray Comedy Fame, Dies at 92 * Luiz Felipe Lampreia, 74, Brazilian sociologist and diplomat, heart attack.El excanciller brasileño Luiz Felipe Lampreia fallece a los 74 años ===3=== *Joe Alaskey, 63, American voice actor (Looney Tunes, Rugrats, Casper), cancer.Bugs Bunny, Daffy Duck Voice Actor Dead *Big Kap, 45, American hip hop DJ (Tunnel), heart attack.DJ Big Kap Dies of Heart Attack *Mark Farren, 33, Irish football player (Derry City), cancer. *Balram Jakhar, 92, Indian politician, Speaker of the Lok Sabha (1980–1989), complications from pneumonia.Former Lok Sabha speaker Balram Jakhar passes away *Alba Solís, 88, Argentine singer and actress, heart failure.Murió la cantante Alba Solís *Saulius Sondeckis, 87, Lithuanian violinist and conductor, stroke.Mirė dirigentas Saulius Sondeckis ===4=== * Marlow Cook, 89, American politician, Senator from Kentucky (1968–1974), complications from a heart attack.Marlow Cook, a former GOP Senator Kentucky, dies at 89 * Kristine Miller, 90, American actress (I Walk Alone, Jungle Patrol, Too Late for Tears), congestive heart failure.Kristine Miller, Hollywood Starlet of the 1940s, Dies at 90 (death announced on this date) * Dave Mirra, 41, American BMX rider, suicide by gunshot. * Edgar Mitchell, 85, American astronaut (Apollo 14), sixth person to walk on the moon, complications from kidney cancer. * Axl Rotten, 44, American professional wrestler (Extreme Championship Wrestling), cardiac arrest.Axl Rotten passes away at 44 (body found on this date) * Edgar Whitcomb, 98, American politician, Governor of Indiana (1969–1973), heart failure. *Maurice White, 74, American singer-songwriter (\"September\") and musician (Earth, Wind & Fire), complications from Parkinson's disease.Earth, Wind & Fire Founder Maurice White Dead at 74. ===5=== * Bill Birchfield, 80, American politician, member of Florida House of Representatives for the 21st district (1971-1974), heart attack.William O. 'Bill' Birchfield, 1935-2016 Advocate for Dames Point bridge, Skyway * Ciriaco Cañete, 96, Filipino martial artist, prostate cancer.Martial arts supreme grandmaster Cacoy Cañete dies at 96 * Bodil Malmsten, 71, Swedish poet and novelist, cancer.Författaren Bodil Malmsten död ===6=== * Robin Chandler Duke, 92, American social advocate and diplomat, Ambassador to Norway (2000–2001), respiratory failure.Robin Chandler Duke, a Champion of Women’s Rights, Dies at 92 * Dan Hicks, 74, American singer- songwriter and musician (Dan Hicks and His Hot Licks), throat and liver cancer.Daniel Ivan Hicks * Eddy Wally, 83, Belgian singer, cerebral hemorrhage.Eddy Wally overleden ===7=== * Roger Willemsen, 60, German writer, essayist and TV presenter, pancreatic cancer.Publizist und Moderator: Roger Willemsen ist tot ===8=== * Amelia Bence, 101, Argentine actress (The Gaucho War, A Sangre Fría, Alfonsina), congestive heart failure. * Charles C. Campbell, 68, American army general, heart attack.Former Eighth Army commander Campbell dies * Johnny Duncan, 92, American actor (Batman and Robin, Bedtime for Bonzo, Plan 9 from Outer Space), complications from dementia. * Nida Fazli, 78, Indian poet, respiratory failure.Acclaimed Poet-Lyricist Nida Fazli Dies In Mumbai * August P. Mardesich, 95, American politician, member of the Washington House of Representatives (1950–1963) and Senate (1963–1978), dementia.Augie Mardesich, former Everett master politician, dies at 95 * Viggo Rivad, 93, Danish photographer, complications from a stroke.Fotografen Viggo Rivad er død * Violette Verdy, 82, French ballerina, heart failure. ===9=== * André van den Heuvel, 88, Dutch actor (Hamelen, De rode zwaan), two-time winner of the Louis d'Or, complications from a stroke.Acteur André van den Heuvel (88) overladen * Sushil Koirala, 76, Nepalese politician, Prime Minister (2014–2015), President of Nepali Congress (since 2010), pneumonia.Nepali Congress President Sushil Koirala dies at the age of 77 years ===10=== * Leo Ehlen, 62, Dutch footballer (Roda JC), kidney disease.Oud- speler van Roda en Fortuna Leo Ehlen (62) overleden * Phil Gartside, 63, English businessman and football chairman (Bolton Wanderers), cancer.Phil Gartside: Bolton chairman dies of cancer aged 63 * Andrew L. Lewis, Jr., 84, American business executive and politician, Secretary of Transportation (1981–1983), complications of pneumonia.Drew Lewis, Transportation Secretary During Air Controllers’ Strike, Dies at 84 * Eliseo Prado, 86, Argentine footballer (national team, Club Atlético River Plate), complications from Alzheimer's disease.Falleció Eliseo Prado * Günter Schröter, 88, German football player (Dynamo Dresden, East Germany national football team, SC Dynamo Berlin) and coach (Berliner FC Dynamo), complications from Parkinson's disease.Der Dribbelkönig ist tot ===11=== * Kevin Randleman, 44, American mixed martial artist, UFC Heavyweight Champion (1999–2000), pneumonia and heart failure. ===12=== * Eddie Barry, 96, American ice hockey player (Boston Bruins), complications from Alzheimer's disease.Edward T. \"Eddie\" Barry * Dominique D'Onofrio, 62, Belgian football coach (Standard de Liège), heart attack.Ex-standardtrainer Dominique D'Onofrio (62) overleden * Robert Frederick Froehlke, 93, American lawyer, Secretary of the Army (1971–1973), complications from a stroke.Robert Froehlke served as secretary of Army during Vietnam War * Johnny Lattner, 83, American football player (Notre Dame, Pittsburgh Steelers), lung cancer. ===13=== * Trifon Ivanov, 50, Bulgarian footballer (national team), heart attack.90s football legend Trifon Ivanov passes away, aged 50 * O. N. V. Kurup, 84, Indian poet, lyricist and politician, recipient of the Jnanpith Award (2007), respiratory failure.Jnanpith-winning poet O.N.V Kurup no more * Slobodan Santrač, 69, Serbian football player (Yugoslavia) and manager, heart attack.ODLAZAK FUDBALSKE LEGENDE Preminuo Slobodan Santrač! * Antonin Scalia, 79, American judge, Associate Justice of the Supreme Court (since 1986), heart attack. * Bořek Šípek, 66, Czech architect and designer, cancer.Czech artist, designer, architect Borek Sipek dies aged 66 * Sir Christopher Zeeman, 91, British mathematician, respiratory failure.Sir Christopher Zeeman FRS (1925-2016) ===14=== * Ali Brownlee, 56, English radio sports broadcaster (Middlesbrough F.C. on BBC Tees), bowel cancer.Voice of the Boro Ali Brownlee of BBC Tees dies * Muriel Casals i Couturier, 70, Spanish economist, complications from injuries sustained in a bike accident.Muere Muriel Casals * Hein Kröher, 88, German folk singer-songwriter.Liedermacher Hein Kröher gestorben * Eric Lubbock, 4th Baron Avebury, 87, British politician, MP for Orpington (1962–1970), acute myeloid leukemia.Lord Avebury * Wiesław Rudkowski, 69, Polish boxer and Olympic silver medalist (1972), heart attack.Nie żyje wicemistrz olimpijski z Monachium ===15=== * George Gaynes, 98, American actor (Police Academy, Punky Brewster, Tootsie).George Gaynes, ‘Punky Brewster’ and ‘Police Academy’ Star, Dies at 98 * Salman Natour, 67, Israeli- born Palestinian author, heart attack.a Salman Natour, lo scrittore senza confini * Hans Posthumus, 68, Dutch footballer (Feyenoord, N.E.C.), cerebral hemorrhage.Oud-Feyenoorder Hans Posthumus overleden * Fighton Simukonda, 58, Zambian football player (Nkana Red Devils) and manager (national team), complications from diabetes.Coach Fighton Simukonda dies ===16=== * Boutros Boutros-Ghali, 93, Egyptian politician and diplomat, Secretary-General of the United Nations (1992–1996), complications from a broken pelvis.Boutros Boutros-Ghali, Former U.N. Secretary General, Dies at 93 * Belinda Nash, 69, American historian, cancer. * Charles Caldwell Ryrie, 90, American theologian, pneumonia. * Robert J. Walker, 87, American sailor, Master Chief Petty Officer of the Navy (1975–1979), complications from pneumonia. ===17=== * Alexander Gutman, 71, Russian movie director (Journey Back to Youth), heart failure.В Петербурге ушел из жизни режиссер Александр Гутман * Mohamed Hassanein Heikal, 92, Egyptian journalist, renal failure.Leading Arab journalist Mohamed Hassanein Heikal dies at 92 * Claude Jeancolas, 66, French writer, cancer.Avec la mort de Claude Jeancolas, Arthur Rimbaud perd un de ses plus grands connaisseurs * Akbar Kakkattil, 62, Indian writer, lung cancer.Malayalam writer Akbar Kakkattil dies at 62 * Andrzej Żuławski, 75, Polish movie director (The Devil, That Most Important Thing: Love, On the Silver Globe) and writer, pancreatic cancer.Andrzej Żuławski nie żyje. Reżyser miał 75 lat ===18=== * Abdul Rashid Khan, 107, Indian Hindustani musician, multiple organ failure.Ustad Abdul Rashid Khan’s Tragic Demise * Pantelis Pantelidis, 32, Greek singer-songwriter, traffic collision.Greek Singer Pantelis Pantelidis Dies in Car Accident (video) * John Reinhardt, 95, American diplomat, United States Ambassador to Nigeria (1971—1975), stroke.John E. Reinhardt, Ambassador and Head of U.S. Information Agency, Dies at 95 ===19=== *Tamerlan Aguzarov, 52, Russian politician, Head of North Ossetia-Alania (since 2015), complications from pneumonia.В Москве умер глава Северной Осетии Тамерлан Агузаров *Umberto Eco, 84, Italian philosopher and novelist (The Name of the Rose, Foucault's Pendulum), pancreatic cancer.Morto lo scrittore Umberto Eco. Ci mancherà il suo sguardo sul mondo *Harper Lee, 89, American writer (To Kill a Mockingbird, Go Set a Watchman).Harper Lee, Author of ‘To Kill a Mockingbird,’ Dies at 89 * Sir William O'Brien, 99, British admiral, Naval Secretary (1964–1966), complications from pneumonia. *Vi Subversa, 80, British musician (Poison Girls), cancer.Vi Subversa: 20th June 1935 – 19th February 2016: Flesh and blood is what we are *Samuel Willenberg, 93, Israeli sculptor and painter, last surviving member of the Treblinka extermination camp revolt, complications from a stroke.Samuel Willenberg, the last surviving Treblinka prisoner, dies at 93 *Bruno Zuppiger, 63, Swiss politician, cancer.Bruno Zuppiger ist tot ===20=== * Fernando Cardenal, 82, Nicaraguan priest and politician, Minister of Education (1984–1990), heart failure.Priest who defied pope, Fernando Cardenal, dies at 82 * Ove Verner Hansen, 83, Danish actor and opera singer, heart attack.Skuespiller Ove Verner Hansen er død * Nando Yosu, 76, Spanish football player and manager (Racing de Santander), Alzheimer's disease.Fallece Nando Yosu, histórico entrenador del Racing ===21=== * María Luisa Alcalá, 72, Mexican actress (El Chavo del Ocho, Dr. Cándido Pérez, Esmeralda), heart attack.Muere María Luisa Alcalá, actriz de \"Cándido Pérez\" y \"El Chavo\" * Eric Brown, 97, Scottish World War II-test pilot, world record for most aircraft carrier landings performed, pneumonia.‘World’s greatest’ aviator Eric Winkle Brown dies at 97 ===22=== * Wesley A. Clark, 88, American computer engineer, created the first minicomputer, complications from heart disease.Wesley A. Clark, legendary computer engineer, dies at 88 * Cristiana Corsi, 39, Italian taekwondo martial artist, European champion (2002), cardiac arrest.Taekwondo: morta Cristiana Corsi, ex campionessa europea * Yolande Fox, 87, American beauty queen (Miss America 1951), singer and activist, lung cancer.Alabama's first Miss America, who changed the rules on swimsuits, dies * Sonny James, 86, American country singer-songwriter (\"Young Love\").Sonny James, Country Music Hall of Fame Member, Dies at Age 86 * Cara McCollum, 24, American journalist and beauty queen, Miss New Jersey (2013), traffic collision.Former Miss New Jersey dies from crash injuries * Hans Reffert, 69, German musician, composer and artist, cancer.Mannheim: Rockgitarrist Hans Reffert gestorben * Douglas Slocombe, 103, British cinematographer (Indiana Jones, The Lion in Winter, Jesus Christ Superstar), complications from a fall.'Indiana Jones' Cinematographer Douglas Slocombe Dies at 103 * Yochanan Sofer, 93, Israeli rabbi, Rebbe of Erlau, pneumonia.Erlau Rebbe passes away ===23=== * Ramón Castro Ruz, 91, Cuban revolutionary figure and politician, brother of Fidel and Raúl Castro.Ramon Castro Ruz, Cuban president's older brother, dies (Death announced on this date) * Peter Lustig, 78, German television presenter (Löwenzahn) and author, stomach cancer.Der Welterklärer mit der Latzhose ist tot * Francisco Rubio Llorente, 85, Spanish judge, President of the Council of State (2004-2012), heart failure.Fallece Francisco Rubio Llorente, expresidente del Consejo de Estado * Donald E. Williams, 74, American astronaut, led mission to Jupiter probe, complications from a stroke.NASA astronaut Don Williams, led mission to launch Jupiter probe, dies at 74 ===24=== * Ryszard Bender, 84, Polish politician and historian, Senator (2007-2011), stroke.Zmarł prof. Ryszard Bender - były poseł i senator * Adriana Benetti, 96, Italian actress (Four Steps in the Clouds, Teresa Venerdì, Before the Postman), complications from pneumonia.La morte di Adriana Benetti, diva dimenticata degli anni '40 e '50 * Rafael Iriondo, 97, Spanish international football player (national team, Athletic Bilbao, Real Sociedad) and manager, respiratory failure. * Peter Kenilorea, 72, Solomon Islands politician, Prime Minister (1978–1981, 1984–1986).Solomons first PM Sir Peter Kenilorea dies * Peter van der Merwe, 74, Dutch footballer (national team), mesothelioma.Oud-doelman Van de Merwe overleden ===25=== * Tony Burton, 78, American actor (Rocky, Assault on Precinct 13, The Shining), comedian and boxer, complications from pneumonia.Tony Burton, Flint native and actor from 'Rocky' films, dies in California * Jim Clark, 84, British movie editor (The World Is Not Enough, The Killing Fields, Marathon Man), Oscar winner (1985).Oscar-winning editor Jim Clark dies aged 85 * François Dupeyron, 65, French movie director and screenwriter (The Officers' Ward), heart attack.Décès de François Dupeyron, réalisateur de \"La Chambre des officiers\" * Alfred E. Mann, 90, American entrepreneur (Spectrolab, Heliotek), heart attack.Biotech entrepreneur Alfred E. Mann dies at 90 ===26=== * Andy Bathgate, 83, Canadian ice hockey player (New York Rangers, Toronto Maple Leafs, Detroit Red Wings), complications from Alzheimer's disease.CP NewsAlert: Hall of Famer Bathgate dies * Karl Dedecius, 94, Polish-born German translator, Director of the German Institute of Polish Studies (1980-1997).Übersetzer Karl Dedecius 94-jährig verstorben * Don Getty, 82, Canadian politician, Premier of Alberta (1985–1992), and football player (Edmonton Eskimos), heart failure.Former Alberta Premier Don Getty dies at 82 * Eri Klas, 76, Estonian conductor, retired boxer and educator, member of the Estonian Olympic Committee, heart attack.Ушел из жизни дирижер Эри Клас ===27=== * Rajesh Pillai, 41, Indian movie director (Traffic), liver disease.Rajesh Pillai, Malayalam filmmaker passes away at 41 ===28=== * Frank Kelly, 77, Irish actor (Father Ted, Emmerdale, Evelyn), heart attack.Fr Ted star Frank Kelly passes away * George Kennedy, 91, American actor (Cool Hand Luke, The Naked Gun, Airport), Oscar winner (1968), heart disease.Actor George Kennedy dies at 91 ===29=== * Gil Hill, 84, American police officer and actor (Beverly Hills Cop), pneumonia. * Louise Rennison, 64, British author (Angus, Thongs and Full-Frontal Snogging), cancer.Angus, Thongs author Louise Rennison dies ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *02 Category:February 2016 events",
 "title": "Deaths in February 2016"
}