{
 "id": "530554",
 "text": "Hilda Cathy Heine (born 6 April 1951) is a Marshallese politician and former teacher who has served as the tenth president of the Marshall Islands since 2024. She previously served as the country's eighth president from 2016 to 2020. She also previously served as a member of the Nitijeļā (the Marshall Islands' legislative branch) and as the Minister of Education of the Marshall Islands. == Early life and education career == Heine was born on 6 April 1951 on the the Jaluit Atoll. At the time, the atoll was a part of a United States territory called the Trust Territory of the Pacific Islands. Heine went to college in the United States. She first earned an undergraduate degree at the University of Oregon in 1970, then a master's degree at the University of Hawai'i at Mānoa in 1975 and an educational doctorate at the University of South Carolina in 2004. Heine is the first person from the Marshall Islands to receive a doctorate degree. Heine was a teacher at Marshall Islands High School in Majuro, the capital of the Marshall Islands, from 1975 to 1980. She worked as a counselor there from 1980 to 1982. She was the president of the College of the Marshall Islands from 1990 to 1992. She also was active with the Pacific Resources for Education and Learning, a non-profit organization in Hawaii, from 1995 to 2012. == Political career == Heine's family has a long history of being involved in politics. She formed the women's rights group Women United Together Marshall Islands (WUTMI) to encourage president Jurelang Zedkaia to campaign against domestic violence. She was also a member of the Teacher Standards and Licensing Board, the Commission on Education in Micronesia, and the Human Resources in Health Task Force. In the 2011 general election, Heine was elected to the Nitijeļā (the Marshall Islands' legislative branch). She represented the Aur Atoll. President Litokwa Tomeing chose Heine to be his Minister of Education. In 2014, her goal was for an annual increase of five percent improvement in testing scores. In the 2015 general election, Heine was re-elected. Heine chose to not be the Minister of Education under the new presidency of Casten Nemra. On 26 January 2016, Nemra and his government had to quit because of a motion of no confidence. Heine formed a coalition so she could run as president and replace Nemra. On 28 January, she became president. Of the 30 members of the Nitijeļā, 24 voted for Heine. The other 6 did not vote. She became the first woman to be the president of the Marshall Islands and the first female head of government of any Pacific Island country. Heine formed her cabinet after becoming president. She kept no members of Nemra's cabinet except for Mike Halferty. Heine chose for problems in the country to be addressed by her whole cabinet instead of by one member who specialized in the problem. She also decided for decisions to be made on data instead of public opinion. During the 2015–16 Zika virus epidemic, a case of the Zika virus was found in the Marshall Islands. Heine decided to declare a state of health emergency. She declared another state emergency in April 2016 when the Marshall Islands faced a severe drought. Heine helped create the Pacific Women Leaders Coalition in 2017 to help female politicians in the Pacific collaborate with each other. She supported the creation of the Miss Marshall Islands pageant. She believed this would help women become leaders. She created a program to give loans to women who started small businesses. In 2017, Heine asked the World Bank for a loan to help fund a development program for children. This was because a study found that poverty and stunted growth in children in the Marshall Islands were connected. The program began in 2022. In 2018, members of the Nitijeļā argued about if the Rongleap Atoll should be considered a special administrative region of the Marshall Islands or not. Heine was against doing this and thought that it went against the constitution. The members of the Nitijeļā who thought that the atoll should be a special region began a motion of no confidence against Heine. If this passed, then Heine would have to quit being president. On 12 November 2018, 16 members of the Nitijeļā voted for the motion while 16 voted against it. Because there needs to be at least 17 people who voted for a motion of no confidence for it to work, Heine got to continue being president. She believed that the motion was funded by China and that members of the government were bribed to vote for the motion. In the 2019 general election, Heine was re- elected to the Nitijeļā. However, many of her allies in the Nitijeļā were not re-elected. Because of this, the government had more people who opposed Heine than people who supported her. The new government decided to elect David Kabua as president to replace Heine. Of the 32 members of the Nitijeļā, 20 voted for Kabua while 12 voted for Heine. Heine became one of the five foreign members of the East–West Center in May 2021. On 12 November 2021, the USP Council elected her as Pro-Chancellor and Chair of Council for a three-year term, beginning 1 January 2022. In 2023, Heine became an advisor of the 2023 United Nations Climate Change Conference. However, she left because she believed the president of the conference, Sultan Al Jabar, would use the conference to make oil and gas deals. In the 2023 general election, Heine was re-elected to the Nitijeļā. She ran again as president and won while Kabua lost. Heine got 17 votes while Kabua got 16. Because the election was so close, Heine decided to include people who supported Kabua instead of her in her own cabinet to win their support. Heine said that her biggest priority in her second presidency was energy. She declared two states of emergencies, one for limited food and fuel on the Kili Island and one for an energy crisis in Majuro. == Political views == Because the Marshall Islands is composed of very small atolls, the country is more affected by climate change. Because of this, Heine pushes methods to make the effects of climate change smaller for countries in the Pacific like the Marshall Islands. She is against illegal fishing, deep sea mining, and programs that would move citizens of the Marshall Islands to other islands. Heine is active in increasing women's rights in the Marshall Islands. She believes that the climate crisis and gender equality are connected to each other. She believes that violence against women is one of the Marshall Islands' biggest problems and supports building houses for victims of violence. She also supports increasing social service programs for women. Heine supports increasing the minimum wage. She also supports universal basic income, a government program that would give monthly checks to all citizens. Heine has shown that she is upset with the Marshall Islands' relations with the United States because of their delayed funding to the country. She believes the United States should be responsible for their testing of nuclear bombs around the Marshall Islands during the 1950s and 1960s. She supports Taiwan being in the United Nations and Ukraine in the Russo-Ukrainian War. Heine is against the high prices for travel of other countries to go to Pacific countries like the Marshall Islands. == Personal life == Heine's brother Carl Heine was also a member of the Nitijeļā and her cousin Dwight Heine was the Trust Territory of the Pacific Islands District Commissioner. Her other brother, Clyde Heine, was a businessman. Heine's grandfather, Carl Heine, was an Australian Christian missionary and was killed by the Japanese during World War II. Heine's husband is Thomas Kijiner Jr. Their daughter, Kathy Jetn̄il-Kijiner, is a poet and climate change activist. Heine chose not to move to a different house or drive a government car after becoming president in 2016. == References == Category:1951 births Category:Living people Category:Presidents of the Marshall Islands Category:Current national leaders",
 "title": "Hilda Heine"
}