{
 "id": "530512",
 "text": "Lewis V. Baldwin (born 1949) is a professor of religious studies at Vanderbilt University in Nashville, Tennessee. He is an award-winning historian and author of a number of books on Martin Luther King, Jr. == Education == He was born and raised in Camden, Alabama. In 1971 he received a Bachelor of Arts degree in History. Baldwin studied at Colgate Rochester Crozer Divinity School from 1971 to 1975. He received his Master of Arts degree in 1973. In 1975 he received his Master of Divinity degree in Theology. In the autumn of 1975 he entered the Ph.D. program at Northwestern University. He completed his degree in 1980. In 1978 he was ordained a minister in Greenville Alabama by his father, Pastor L. V. Baldwin, Sr. On June 16, 1987, Baldwin became a deacon in the United Methodist Church. == Teaching career == Dr. Baldwin taught at the College of Wooster in Wooster, Ohio. He has also taught at Colgate University and Colgate Rochester Crozer Divinity School in New York. He was a professor at Fisk University and American Baptist College in Nashville before coming to Vanderbilt University. He lives in Nashville, Tennessee. == Bibliography == Dr. Baldwin is the author of over 60 articles and several books. These include: * \"Invisible\" Strands in African Methodism: A History of the African Union(1983) * Union American Methodist Episcopal Churches, 1805-1980(1983) * The Mark of a Man: Peter Spencer and the African Union Methodist Tradition (1987) * There Is a Balm in Gilead: The Cultural Roots of Martin Luther King, Jr. (1991) * To Make the Wounded Whole: The Cultural Legacy of Martin Luther King, Jr. (1992) * The legacy of Martin Luther King, Jr.: the boundaries of law, politics, and religion (1992) * Freedom is Never Free: A Biographical Portrait of E.D. Nixon, Sr. (1992) * Toward the Beloved Community: Martin Luther King, Jr. and South Africa (1995) * (co-author with Amiri YaSin Al- Hadid) Between Cross and Crescent: Christian and Muslim Perspectives on Malcolm and Martin (2002) * The Voice of Conscience: The Church in the Mind of Martin Luther King, Jr. (2010) * Never to Leave Us Alone: The Prayer Life of Martin Luther King, Jr. (2010) * \"Thou, dear God\" : prayers that open hearts and spirits, Martin Luther King, edited by Lewis V. Baldwin (2012) * \"In a single garment of destiny\" : a global vision of justice, Martin Luther King, edited by Lewis V. Baldwin (2012) == Awards == He received the \"American Theological Library Association Award\" for his book \"Invisible\" Strands. Baldwin won the \"Midwest Book Achievement Award\" of the Midwest Independent Publishers Association. This was for his book A Balm in Gilead. == References == ==Other websites== *Vanderbilt's webpage about Dr. Baldwin Category:1949 births Category:Writers from Alabama Category:American historians Category:Living people",
 "title": "Lewis V. Baldwin"
}