{
 "id": "530636",
 "text": "Word of mouth is the passing of information from a person to one or more people in conversation. In the past, it referred only to speech, but now, it can sometimes include online communication. It can be as simple as telling someone what time it is, or it can involve longer stories and news. It is a good way to share information about things that are of interest to a local community, such as businesses, other people, and things that happened in the past. ==Oral tradition== Oral tradition (also called \"oral culture\" or \"oral lore\") is when cultural material is transmitted orally from older people to younger people.Vansina, Jan: \"Oral Tradition as History\", 1985, James Currey Publishers, , ; at page 27 and 28, where Vasina defines oral tradition as \"verbal messages which are reported statements from the past beyond the present generation\" which \"specifies that the message must be oral statements spoken sung or called out on musical instruments only\"; \"There must be transmission by word of mouth over at least a generation\". He points out that \"Our definition is a working definition for the use of historians. Sociologists, linguists or scholars of the verbal arts propose their own, which in, e.g., sociology, stresses common knowledge. In linguistics, features that distinguish the language from common dialogue (linguists), and in the verbal arts features of form and content that define art (folklorists)\".Ki- Zerbo, Joseph: \"Methodology and African Prehistory\", 1990, UNESCO International Scientific Committee for the Drafting of a General History of Africa; James Currey Publishers, , 9780852550915; see Ch. 7; \"Oral tradition and its methodology\" at pages 54-61; at page 54: \"Oral tradition may be defined as being a testimony transmitted verbally from one generation to another. Its special characteristics are that it is verbal and the manner in which it is transmitted.\" This material may include folktales, sayings, songs, or chants. It is a way for things like history, literature, and law to be passed down from generation to generation without a writing system. ==Oral history== Oral history is history that is given by people who lived through historical eras or events. Often, they are interviewed, and it is recorded. Usually, they talk about things that are not part of written history, such as what everyday life was like. ==Marketing== Consumers often talk to their friends about their experiences with a product or a service. This is important for businesses because people are more likely to trust someone they know well.Entrepreneur. Word-of-Mouth Advertising. \"Word-of-mouth marketing\" happens when a business tries to encourage people to talk about their product. For example, they can offer rewards or suggest that they make posts on social media. A lot of people think that a lot of word of mouth now happens on the internet. However, studies show that most word of mouth actually happens in spoken conversation. == References== Category:Communication Category:Oral tradition",
 "title": "Word of mouth"
}