{
 "id": "530653",
 "text": "Ida Bell Wells-Barnett (July 16, 1862 – March 25, 1931), also known as Ida B. Wells, was an African-American journalist, suffragist and women's rights advocate. She was born a slave in Holly Springs, Mississippi during the American Civil War. Wells grew up to become a teacher in Memphis, Tennessee. She became co-owner of a local newspaper \"The Free Speech and Headlight\". She wrote editorials using the pen name \"Iola\". Many of her editorials were about the problems of African-Americans in the era of Jim Crow laws. She became a full-time journalist after being dismissed from her teaching job. Wells was an early pioneer in the civil rights movement. In 1909, Wells was one of the founders of the National Association for the Advancement of Colored People (NAACP). Wells is buried at Oak Woods Cemetery in Greater Grand Crossing, Chicago, Illinois. == Early career == On May 4, 1884, a train conductor ordered Wells to give up her seat in a nice car and move to a crowded car. At the time, railroad companies were allowed to separate their passengers by race. Wells refused to give up her seat. The conductor and two men dragged her out of the car. Wells fought back and even bit the conductor on the hand. Wells wrote a newspaper article for The Living Way, an article for black people, about her treatment on the train. She hired a black lawyer to sue the railroad. The railroad paid her lawyer to not work for her, so Wells hired a white lawyer. She won her case on December 24, 1884. The local court granted her a $500 award. The railroad company then took the case to the Tennessee Supreme Court. That court decided against Wells in 1887. Wells was ordered to pay money to the court. She responded saying she felt sad and disappointed because she had hoped that her lawsuit would help her fellow black Americans: \"I felt so disappointed because I had hoped such great things from my suit for my people...O God, is there no...justice in this land for us?\" While teaching elementary school, the Evening Star, a newspaper in Washington, D.C., offered Wells an editorial job. She also wrote weekly articles for The Living Way weekly newspaper under the pen name \"Iola.\" She became recognized for writing about the problems black people faced. In 1889, she became co-owner and editor of Free Speech and Headlight, a newspaper against separation by ethnicity. This newspaper published articles about injustices against black Americans. In 1891, Wells was dismissed from her teaching post by the Memphis Board of Education because of her articles that complained about conditions in the local schools for black students. Wells was sad but she didn't give up. She focused on writing articles for The Living Way and Free Speech and Headlight. In 1889, Thomas Moss, a friend of Wells, opened the Peoples Grocery. The grocery store did well and competed with a grocery store across the street that was owned by a white man. In 1892, Wells went out of town. While she was gone, a mob of white people invaded her friend's store. During the fight, three white men were shot and injured. Moss and two other black men, named McDowell and Stewart, were arrested and jailed, waiting for their trial. A large mob of white people stormed the jail and killed the three men. After the murder of her friends, Wells wrote in Free Speech and Headlight, suggesting that blacks leave Memphis altogether: Wells talked about the public nature of the murders. More than 6,000 black people did leave Memphis. Other people decided not to use businesses owned by white people. Some people said they would hurt Wells, so she bought a pistol. She later said that the people who bullied her were mad because she told just a little bit of the truth: \"They had made me an exile and threatened my life for hinting at the truth.\" ==References== ==Other websites== * Ida B. Wells-Barnett House * Ida B. Wells: 5 Fast Facts You Need to Know Category:1862 births Category:1931 deaths Category:Burials at Oak Woods Cemetery Category:Journalists from Mississippi Category:People from Holly Springs, Mississippi Category:National Association for the Advancement of Colored People Category:African-American writers Category:Slaves Category:19th-century journalists Category:20th-century journalists",
 "title": "Ida B. Wells"
}