{
 "id": "530774",
 "text": "CBRNE is an acronym for Chemical, Biological, Radiological, Nuclear, and Explosive materials. These materials are very dangerous, and can hurt many people. When they are used on purpose, CBRNE materials are weapons of mass destruction. However, CBRNE events can also happen accidentally. A report from the White House in 2011 said \"there is no greater danger to the [United States] than a terrorist attack with a weapon of mass destruction.\" Because CBRNE weapons are so dangerous, countries around the world are working on preventing CBRNE attacks, and learning how to react to them if they do happen. ==Types of CBRNE weapons== ===Chemical=== The main types of chemical weapons are: * Nerve agents, which attack the central nervous system. Examples include types of pesticides called organophosphates; sarin; and VX. * Blister agents, which cause burns and blisters both inside and outside of the body. Examples include the mustard gases. * Blood agents, which make it impossible for the blood to carry oxygen to the body. The most common blood agents are made with cyanide. * Choking agents, which attack the lungs and make them fill with fluid. This makes breathing impossible. Examples include chlorine gas and phosgene. * Incapacitating agents, which are designed to hurt a large number of people, and make it impossible for them to fight back, but without killing them. Examples include tear gas and pepper spray. International laws make it illegal to use chemical weapons. However, terrorists have ignored these laws. For example, in 1995, terrorists attacked the subway in Tokyo, Japan, with sarin. ===Biological=== The goal of biological weapons is to get as many people sick with infectious diseases as possible. Types of biological weapons include: * Bacteria, like the bacteria that cause anthrax and plague * Viruses, like the ones that cause smallpox, Ebola, and the flu * Toxins (poisons made by living things), like ricin, botulism toxin, and aflatoxin In 2001, a terrorist used a biological weapon against the United States by sending letters filled with anthrax through the mail to many different people. Ricin has also been sent through the mail as a biological attack. ===Radiological=== A radiological weapon is any kind of weapon that spreads radiation. For example: * A dirty bomb which uses radioactive material to cause lasting effect on the environment * Contaminating food or water supplies with radioactive contamination In 2006, Alexander Litvinenko, a former Russian spy, was murdered when someone put polonium-210, a radioactive material, in his food. The White House's report says that there is radiological material all around the world that is not guarded. ===Nuclear=== N is for Nuclear explosion. This can occur one of two ways Fissure and Fusion. Fissure occurs when an atom is spliced apart forming two new atoms. This causes a discharge of energy. Fusion on the other hand forces two atoms together. The process breaks apart the atoms and fuses them together. The reaction discharges energy. Many countries have tested nuclear weapons. World War II, the United States dropped two nuclear bombs on the Japanese cities of Hiroshima and Nagasaki. In Hiroshima, the nuclear bomb destroyed of the city, and killed 60,000 to 80,000 people right away. More people later died from radiation sickness and cancer caused by radiation, so historians think about 135,000 people were killed by the one nuclear bomb that hit Hiroshima. In Nagasaki, the nuclear bomb created about of heat, and winds as fast as . It killed somewhere between 39,000 and 80,000 people. The United Nations later made the use of Nuclear weapons illegal which is largely due to the radiation that is brought along with as well as earthquakes and other natural disasters. While true to this day many countries still manufacture these weapons today. ===Explosives=== E as in explosives stands for high-yield explosive. High- yield explosive is materials that rapidly release large amounts of energy and produce a pressure shock wave during detonation. High-Yield Explosions can occur in labs and hospitals that contain compressed gas. One highly explosive gas is Acetylene which is commonly found under pressure to containment and later use. There are types of liquids like Nitroglycerin that can be subjected to pressure explosion as well. ==Accidental CBRNE events== Examples of accidental CBRNE events include: * Chemical: Accidental chemical spills (like an oil spill, or a dangerous chemical leaking out of a laboratory) * Biological: Outbreaks of infectious disease (like a flu epidemic) * Radiological: Accidental spills of radioactive chemicals in laboratories or hospitals (like a spill of uranyl nitrate, which is used to look at viruses under electron microscopes); accidents during radiation therapy * Nuclear: Accidents at nuclear power plants like Chernobyl and Three Mile Island * Explosive: A person who is on oxygen for breathing problems lights a cigarette and accidentally blows up their entire apartment building ==Photo gallery== File:British 55th Division gas casualties 10 April 1918.jpg|British soldiers who were blinded by tear gas in World War I Image:Bundesarchiv Bild 183-F0313-0208-007, Gaskrieg (Luftbild).jpg|A German gas attack during World War I File:Ghouta massacre1.JPG|Victims of a sarin gas attack in 2013, during the Syrian Civil War File:Anthraxnote2.jpg|A letter sent to two U.S. Senators in 2001 with anthrax inside File:Hiroshima aftermath.jpg|Hiroshima after being bombed with one nuclear weapon during World War II File:2013 Boston Marathon aftermath people.jpg|Photo from right after the Boston Marathon bombings ==References== Category:Terrorism Category:Chemical warfare Category:Explosives Category:Infectious diseases Category:Nuclear weapons",
 "title": "CBRNE"
}