{
 "id": "530875",
 "text": "Melody Ann Thomas Scott (b. April 18, 1956) is an American actress who acts in soap operas. She played Nikki Newman on the soap opera The Young and the Restless. She also played Darlene Jarvis in The Waltons in the 1970s. She won awards for Outstanding Actress from the 17th Soap Opera Digest Awards for her act as Nikki Newman. Thomas Scott started her career as a child actress. Thomas Scott was born in Los Angeles, California. ==Acting roles== Year Title Role Notes 1964 Marnie Young Marnie Movie (uncredited) 1965 Wagon Train Samantha Episode: \"The Katy Piper Story\" (as Melody Thomas) 1969 Ironside Leslie Richards Episode: \"Goodbye to Yesterday\" (as Melody Thomas) 1971 The Beguiled Abigail Movie (as Melody Thomas) 1975 Posse Laurie Movie (as Melody Thomas) 1976 The Shootist Girl on streetcar Movie (as Melody Thomas) 1977 Secrets Laura Fleming TV Movie (as Melody Thomas) 1977 Code R Linda Episode: \"The Firebug\" (as Melody Thomas) 1977 Fish Joanie Kellen Episode: \"The Neighbors\" (as Melody Thomas) 1977 The Car Suzie Pullbrook Movie (as Melody Thomas) 1977 The Waltons Darlene Jarvis Episodes: \"The Go-Getter\" and \"The Seashore\" (as Melody Thomas) 1978 Charlie's Angels Betsy Harper Episodes: \"The Sandcastle Murders\" (as Melody Thomas) 1978 The Fury LaRue Movie (as Melody Thomas) 1978 Piranha Laura Dickinson Movie (as Melody Thomas) 1979 Makin' It Carol / Paula Episodes: \"Stayin' Alive\" and \"Tony's Homecoming\" (as Melody Thomas) 1979 Billy Shirley Episode: \"Computer Dating\" (as Melody Thomas) 1979 The Rockford Files Sherry Episode: \"Lions, Tigers, Monkeys and Dogs, Part 1\" (as Melody Thomas) 1979–present The Young and the Restless Nikki Newman Series regular 1980 The Scarlett O'Hara War Laurie Lee TV Movie (as Melody Thomas) 1985 Hotel Mandy Vinning Episode: \"Sleeping Dogs\" (as Melody Thomas) 2001 The King of Queens Nikki Newman Episode: \"Inner Tube\" 2003 The Paradise Virus Linda Flemming TV movie 2005 Freezerburn Jill Renzie the Moviestar Movie 2007 My Name is Earl Pill Popping Mom Episode: \"The Birthday Party\" 2011 Castle Tonya Wellington Episode: \"Nikki Heat\" 2014 The Crazy Ones Flora Episode: \"The Monster\" ==Awards and nominations== Year Award Category Work Result 1991 8th Telegatto Awards Best Actress The Young and the Restless 1995 11th Soap Opera Digest Awards Outstanding Actress The Young and the Restless 1999 26th Daytime Emmy Awards Outstanding Lead Actress The Young and the Restless 2001 17th Soap Opera Digest Awards Outstanding Actress The Young and the Restless ==References== Category:1956 births Category:Living people Category:Actors from Los Angeles Category:American child actors Category:American movie actors Category:American television actors",
 "title": "Melody Thomas Scott"
}