{
 "id": "531100",
 "text": "The Hui people (, Xiao'erjing: , , ) are an East Asian ethnoreligious group. They are mostly Chinese-speaking muslims who live in China. They live mostly in the northwestern provinces of the country and in the Zhongyuan region. As of the 2011 census, China is home to about 10.5 million Hui people. Most of Hui people are Chinese-speaking Muslims. The 110,000 Dungan people of Kazakhstan and Kyrgyzstan are also part of the Hui ethnicity. They have a connection with Islamic culture. For example, as Muslims, they follow Islamic dietary laws and do not eat pork. Pork is the most commonly eaten meat in China. Quote: \"In China, pork has been the most basic source of animal protein for centuries and Chairman Mao considered it 'a national treasure'\" They hve created their own version of Chinese cuisine. Hui clothing is different from that of the Han Chinese. Some men wear white caps (taqiyah) and some women wear headscarves, This is the case in many Islamic cultures. The Hui people are one of 56 ethnic groups recognized by China. The government says the Hui people include all Muslim communities that are not included in China's other ethnic groups. They are seperate from other Muslim groups such as the Uyghurs. or Besides the Hui people, nine other ethnic groups of PRC are considered mostly Muslim. Those nine groups are defined by language. Six groups speak Turkic languages, they are the Kazakhs, Kyrgyz, Salars, Tatars, Uyghurs and Uzbeks). There are two Mongolic-speaking groups (Bonan and Dongxiang) and one Iranian-speaking group (Tajiks). The Hui mostly speak Chinese. There are some Arabic and Persian phrases in their speach. The Hui ethnic group is not associated with a non-Sinitic language. The ancestors of today's Hui people are thought to have been native Chinese speakers of Islamic religion since no later than the mid or early Ming Dynasty. [i.e. the late 14th to late 16th centuries] The Hui people are more concentrated in Ningxia, Gansu, Qinghai and Xinjiang) in Northwestern China. Communities exist across the country. Many Hui are clerics, interpreters, jewelers, tea traders, tanners, butchers, caravaneers, cavalrymen, shepherd, innkeeper, restauranteers Quote:... to their Islamic restrictions in diet and hygiene , leading them to take up such occupations as restauranteur , innkeeper , shepherd , cavalryman , caravaneer , butcher , tanner , tea trader , jeweler , interpreter , and clergyman . and jade carvers. Quote: Knowing - jade Hui ” ( shiyu Huihui ) have ... Du Wenxiu's father was Han. ==References== ===Sources=== * (1st edition appeared in 1991) * * Category:Ethnic groups in China",
 "title": "Hui people"
}