{
 "id": "531388",
 "text": "John Caldwell Holt was an American educator and author. He supported homeschooling and unschooling.Farenga P. 1999. John Holt and the origins of contemporary homeschooling. Paths of learning: options for families and communities. == Homeschooling to deschooling == Holt became disappointed with the United States school system after several years of working in it. He became convinced that improving the school system was not possible, and began to support homeschooling. Holt believed that children did not need to be pressured into learning. They would learn naturally if they had a variety of resources, and could follow their own interests. Holt's Growing Without Schooling, founded in 1977, was the nation's first home education newsletter. Holt, in his 1964 best-seller How Children Fail (2nd ed 1982), said schooling does more harm than good to a child's desire to truly learn. The book was followed by How Children Learn, which explained his positive ideas (1967, 2nd ed 1983. Holt's sole book on homeschooling, Teach Your Own, was published in 1981. It was revised by his colleague Patrick Farenga and republished in 2003.Holt J. & Farenga, Patrick 2003. Teach your own: the John Holt book of homeschooling. Perseus Books and Da Capo Press. In his 1974 book, Escape from Childhood: the needs and rights of children, Holt said that children should have the same independence as adults. These included the right to work for money, sign contracts and be allowed to vote in elections. ==Bibliography== * How Children Fail (1964). * How Children Learn (1967). * The Underachieving School (1969) * What Do I Do Monday? (1970) * Freedom and Beyond (1972) * Escape from Childhood (1974) * Instead of Education (1976) * Never too late: my musical life story (1979) * Teach Your Own (1981) * Learning all the Time (1989) * A Life Worth Living (1990) == More reading == * Holt, J. (1967). How Children Learn. New York: Pitman. * * ==References== Category:1923 births Category:1985 deaths Category:Educators from New York City",
 "title": "John Holt (educator)"
}