{
 "id": "531493",
 "text": "Vertical transmission (also called mother-to-child transmission, or MTCT) means that an infection is spread from a mother to her fetus during pregnancy or childbirth. Vertically transmitted infections are usually caused by bacteria or viruses. If the baby still has the infection after he or she is born, the infection may be called a congenital infection. ==Examples== Here are some examples of infections that can be vertically transmitted. ===Sexually transmitted infections=== Many (but not all) sexually transmitted infections (STIs) can be vertically transmitted. STIs that can be spread from mother to fetus include: * HIV (the virus that causes AIDS) * Syphilis ** Syphilis can cause miscarriage, stillbirths, infant death, and problems with many different organs in infants who do survive * Chlamydia ** If it is not treated, chlamydia can cause premature birth, low birth weight, and infections in the baby's lungs and eyes * Herpes simplex virus ** This virus is easily spread if the mother is first infected late in her pregnancy, or has herpes blisters on her genitals during childbirth * Gonorrhea ** If untreated, gonorrhea can cause miscarriage, premature birth, infections in the fluid that surrounds the fetus in the womb, and serious eye infections once the baby is born * Human papillomavirus (HPV) ** HPV is most likely to spread during childbirth if the mother has genital warts during childbirth ===Hepatitis=== Almost every type of hepatitis can be vertically transmitted. Hepatitis C, D, and E can be spread during pregnancy or childbirth. Hepatitis B cannot be spread during pregnancy. However, it can be spread during childbirth if the infant touches its mother's blood or other body fluids. ===Group B streptococcal infection=== In developed countries, Group B streptococcal infection is the most common cause of bacterial infections in newborns. It can cause infections that are very dangerous to newborns, like meningitis, septicaemia, and pneumonia. These infections can kill a newborn or cause serious long-term health problems. ===Other examples=== * Toxoplasmosis ** This disease is caused by a parasite. It can cause miscarriage and stillbirth. In newborns, it can cause intellectual disability and problems with the central nervous system * Chickenpox ** Especially if the mother gets chickenpox in the first 7 months of her pregnancy, chickenpox can cause birth defects * Measles * Rubella (German measles) ** Especially if the mother gets rubella early in her pregnancy, rubella can cause deafness, heart problems, intellectual disability, and many other problems in her baby * Listeriosis ** This infection is usually spread by contaminated food and dairy products. It can cause miscarriage, stillbirth, premature birth, and infections of the central nervous system in newborns * Dengue fever * Zika fever ** Scientists think Zika fever causes microcephaly (a smaller head than usual) in newborns ==How these infections spread== There are two main ways that infections can be spread during pregnancy or childbirth. ===Through the placenta=== The placenta surrounds and protects the fetus during pregnancy. It keeps the mother's blood from mixing with the fetus's. However, some infections can cross the placenta and infect the fetus. This is called perinatal infection. These infections are especially dangerous because they affect the fetus while it is still developing. This is why many vertically transmitted infections are most dangerous to the fetus early on in a pregnancy. All of the fetus's important organs start to grow by the time the fetus is nine weeks old, and they grow the most early on in the pregnancy. If the fetus gets an infection while important parts of its body are developing, the infection can cause problems in the way those parts of the body grow. These infections are also dangerous because a fetus does not have an immune system of its own. It depends on its mother's immune system. If the mother has an infection that has not been treated, and her immune system cannot fight off the infection, the fetus will not be able to fight off the infection either. ===During childbirth=== During pregnancy, the placenta protects the fetus from its mother's blood. However, during childbirth, the placenta stays in the womb while the baby travels through the birth canal. While it is being born, the mother's blood and other body fluids get on the baby, and the baby also touches its mother's genitals. Because of this, infections that are carried in the blood, in body fluids, or in sores on the mother's genitals can infect the baby. Infections are usually more dangerous for newborns and infants than for adults. This is because it takes about six months for an infant's immune system to develop completely. Until the infant's immune system is fully grown, it will not be able to fight off infections as well as an adult could. Sometimes, medical treatment, like antibiotics, can prevent a baby from getting infections that spread during childbirth. ==Prevention== Some vertically transmitted infections can be prevented if the mother gets vaccines before getting pregnant. These infections include HPV, chickenpox, measles, and rubella. However, while these vaccines are common in developed countries, many people in developing countries do not have good medical care and cannot get vaccines. Other vertically transmitted infections, like syphilis, can be cured with antibiotics before the mother gets pregnant. Sexually transmitted infections can often be prevented by having safer sex. The United States Centers for Disease Control and Prevention (CDC) suggests these ways of preventing vertically transmitted infections: * Before getting pregnant, a woman should get tested for chlamydia, gonorrhea, HIV, and other sexually transmitted infections * A woman's doctor should teach her how to eat safely to prevent getting listeriosis or toxoplasmosis * To avoid getting toxoplasmosis, pregnant women should not clean cat litter boxes and should wear gloves when gardening (the parasite that causes toxoplasmosis can be spread through cat feces) The World Health Organization says that mothers with HIV can lower their baby's risk of getting vertically transmitted HIV to 2% if: * The mother takes HIV medications during pregnancy * The infant gets HIV medications for 4–6 weeks after being born * The mother does not breastfeed her baby (HIV can spread through breast milk) ==Related pages== * Infectious diseases * Sexually transmitted infections * Congenital disability ==References== Category:Infectious diseases",
 "title": "Vertical transmission"
}