{
 "id": "531760",
 "text": "Undertale is a role-playing video game made by Toby Fox, an independent artist. In the game, players control a human child who has fallen into the Underground, a large and out-of-the-way place under a mountain, separated from the rest of the world by a magic wall called the Barrier. The player meets many kinds of monsters as they try to return to the surface, mainly through the fighting system; the player takes turns selecting actions and avoiding attacks made of many bullets, and can choose to befriend or subdue monsters so that they won't get killed. The player's choices change many things in the game, including how characters act, and what kind of story it is. Fox developed almost the whole game by himself. He wrote the words and made the music by himself, and only used a few pieces of extra art given to him by other artists. The game was inspired by the Mother and Mario & Luigi role- playing series, the \"bullet hell\" shooter series Touhou Project, and the British comedy show Mr. Bean. Undertale was originally meant to be two hours long and released in mid-2014, but creating the game took over three years, making the story longer and not making the game available until much later. The game was released on Steam for Microsoft Windows and OS X on September 15, 2015. When it was released, the game was praised for its writing, themes, easy-to-learn fighting system, music, and original ideas; with praise directed towards its story, dialogue, and characters. The game sold over a million copies, and was nominated for many honors and awards, including Game of the Year from many gaming news sources, winning others from conventions including South by Southwest. == Gameplay == Undertale is a role-playing game that shows everything from above. In the game, players play as a child and finish tasks in order to go forward in the story. Players explore an underground world of towns and areas, and must solve many puzzles on the way. The underground world is the home of monsters, many of whom fight the player; players decide to fight, run away, act, or make friends with them. When players meet enemies in either scripted events or random encounters, they enter a battle mode. During battles, players control a small red heart which represents their soul, and must avoid attacks shot by the monster(s) in a way much like a bullet hell shooter. Later the game, new types of gameplay are shown. These include blue- colored bullets that only hurt when the player is moving, or orange bullets that only hurt when staying still. Boss battles often introduce these coloured bullet mechanics. Players can use the FIGHT option to attack, which involves timed button presses. Players can also use the ACT option to do many different actions, which are different for each enemy, usually for a peaceful resolution. Players can also use the ITEM option to eat food to heal, or to put on weapons or armor. Players can also use the MERCY option to spare enemies or run away. Monsters can be spared only if they have been beaten up enough to make them weak and unable to fight, or if they have been pleased by the right actions. In order for some boss battles to be completed without involving murder, the player must survive until the character they are facing has finished their dialogue. The game has many story branches and endings depending on whether players choose to murder or spare their enemies; and as such, it is possible to clear the game without murdering a single enemy. Players earn EXP and gold for killing monsters. Monsters will talk with players during the battles, and the game will often tell the players what the monster's feelings and actions are. Enemy attacks can change based on how players interact with them: if the player chooses non-violent options, enemy attacks are easy, but they become harder if players choose violent options. The game uses many metafictional elements in both its gameplay and story. When players play in a boss battle more than once, the dialogue will change depending on actions from the times they played the battle before. == Characters == Character Role in game Route where fight occurs Description Frisk Player character N/A * The protagonist of the game * Human child who fell into the underground * Has the power of DETERMINATION, which allows them to reset and come back alive again after dying Flowey Final Boss Neutral (as Photoshop Flowey) / Pacifist (as Asriel) * Asriel, accidentally revived as a flower after his death * Believes it's \"kill or be killed\" due to his death when he was a pacifist * Has Determination * Has no soul, so cannot feel any emotion Toriel Area Boss All routes * Used to be the Queen of Monsters and of the Underground, and Asgore's ex-wife * Motherly figure * Abandoned Asgore and moved to the Ruins after he declared any humans must die Napstablook Mini-boss Neutral and Pacifist * Mettaton's cousin * Quiet and depressed * Informs the player that standard attacks cannot hurt ghosts * Loves making music *Operates the Thundersnail mini-game in Waterfall Sans Final Boss Genocide * Papyrus' brother * Short skeleton who enjoys telling puns * Wears blue jacket and shorts * Has knowledge of the concept of timelines * Likes to drink ketchup Papyrus Area Boss All routes * Sans' brother * Wants to be part of the Royal Guard * Friends with Undyne * Enjoys cooking spaghetti Undyne Area Boss Genocide (as Undyne the Undying) / Neutral and Pacifist (as Undyne) * Head of the Royal Guard * Determined to kill the player to get the last human soul * Friends with Papyrus * In love with Alphys * Shows ability to generate DETERMINATION, which allows her to persevere after death before melting Alphys Active participant N/A (Appears during some fights in Neutral and Pacifist) * Current Royal Scientist * Tried to find a way out of the Underground using extracted Determination * In love with Undyne * Built Mettaton to be her friend * Low confidence; repeatedly refers to herself as \"garbage\" * Loves anime Mettaton Area Boss Genocide (as Mettaton NEO) / Neutral and Pacifist (as Mettaton and Mettaton EX) * Robot built by Alphys * Originally created to kill humans, but turned to TV stardom * Used to be a ghost * TV star in the Underground Muffet Mini-boss (or area boss by fans) All routes *Leader of the spiders of the Underground *Runs a spider bake sale in Hotland *Added into the game because of a Kickstarter donator Asgore Area Boss Neutral and Pacifist * The King of Monsters and of the Underground * Toriel's ex-husband * Said that all humans who fell into the Underground must be killed to obtain their souls (seven human souls will break the Barrier) * Doesn't actually want to kill the player, but is fated to fight them. Asriel Final Boss Pacifist * The son of Asgore and Toriel * Killed by humans on the surface after taking Chara's body up * Transforms from Flowey when he absorbs all human souls and monster souls Chara Extra character N/A * The very first human that fell into the Underground, before Asgore declared war on humans * Made a plan to kill themself so their soul could fuse with Asriel's, in order to kill 6 humans so they could free the monsters * Returns after the player has completed a Genocide run; they ask for the player's soul and take it by force before deleting the world W. D. Gaster Extra character N/A *Appearance depends on in- game \"fun values\" *The royal scientist before Alphys *Has various follower characters (called \"Goners\") that reference him and his presence *Created the CORE, a power plant in Hotland *Died in an accident involving the CORE *Speaks in Wingdings == Deltarune == In late October 2018, Toby fox hinted at the release of a new game called Deltarune, which was released on 31 October, on his Twitter page. This new game is set in a similar world to Undertale and is familiar to previous players of Undertale. It follows the story of a human, a monster and a \"darkner\" to bring balance to the world. Currently, only Chapter 1 and 2 have been released; Fox plans to create a development team and release the full game, with one ending only, when it is complete. ==Notes== == References == Category:2015 video games Category:Indie video games Category:Linux games Category:MacOS games Category:Metafictional video games Category:Nintendo Switch games Category:PlayStation 4 games Category:PlayStation Vita games Category:Puzzle video games Category:Role- playing video games Category:Single-player video games Category:Steam Greenlight games Category:Video games developed in the United States Category:Windows games Category:Xbox One games",
 "title": "Undertale"
}