{
 "id": "531918",
 "text": "Judicial interpretation is an explanation of how the judiciary interprets the law. In Common law, judicial interpretation is made up of guidelines that come from case law rather than from a legislature. These represent all previous judicial decisions. In constitutional law, there are different methods of judicial interpretation. These include: * Textualism is when judges look at the actual language of more than anything else. This method can be hampered when the language of the Constitution itself is ambiguous. This is also called literalism. * Strict constructionism is when a judge interprets the text only as it is spoken. Once a clear meaning has been established, there is no need for further analysis. Judges should avoid drawing inferences from previous statutes or the constitution and instead focus on exactly what was written.The Judiciary: The Power of the Federal Judiciary, The Social Studies Help Center * Founders' Intent is when judges try to gauge the intentions of the authors of the Constitution. Problems can arise when judges try to determine which particular Founders or Framers to consult. It is also a problem to try to determine what they meant based on often sparse and incomplete documentation. This is also called original intent. * Originalism is when judges try to apply the \"original\" meanings of various constitutional provisions. * Balancing happens when judges weigh one set of interests or rights against an opposing set. They typically used to make rulings in First Amendment cases. * Prudentialism discourages judges from setting broad rules for possible future cases. It advises courts to play a limited role. * Doctrinalism considers how various parts of the Constitution have been \"shaped by the Court's own jurisprudence\". * Precedent is when judges decide a case by looking to the decision of a previous and similar case. They find a rule or principle in the earlier case to guide the current case. * Structuralism is a method judges use by finding the meaning of a particular constitutional principle only by \"reading it against the larger constitutional document or context.\" == References == == Related pages == *Jurisprudence Category:Legal terms Category:United States Constitution",
 "title": "Judicial interpretation"
}