{
 "id": "532036",
 "text": "Giambattista Pittoni (or Giovanni Battista Pittoni; 6 June 1687 – 6 November 1767) was an Italian painter. His paintings are from the late Baroque or Rococo period. He was among the people who started the Academy of Fine Arts of Venice. Pittoni was born in Venice on 6 June 1687. He worked there for most of his life. He travelled to France in 1720. It was around this time that his style of painting changed. His style became influenced by French styles. Pittoni joined a Venetian guild of painters in 1716. He served as president of the Academy of Fine Arts of Venice from 1758 to 1760 and from 1763 to 1764. He was in high demand all across Italy during his life. == Loaves and fishes == The miracle of the loaves and fishes is a 1725 painting by Pittoni. It is in the collection of the National Gallery of Victoria, Victoria, Australia. The story is recorded in all four gospels. Pittoni’s depiction is of the gospel of John (6:3–13): ‘Jesus went into the mountains … a great multitude followed him, He bade them sit down, took five loaves and two fishes and, giving thanks, broke them and the disciples distributed them’. ==Works== * Bacchus and Ariadne of the Senate (1730s), Senate of the Republic (Italy), Palazzo Madama, Sala Cavour, Rome * In the Louvre Museum, Paris: ** Christ grants Keys of Paradise to St Peter ** Continence of Scipio (1733–1735) ** Susanna and the Elders (1723–1725) ** Tombeau allégorique de l'archevêque John Tillotson (1630–1694) (1726–1727) ** Bacchus and Ariadne (1720–1725) ** Venus and Mars (1720–1725) ** Sacrifice of Polyxena at the Tomb of Achilles ** Dido founds Carthage * Holy family, Metropolitan Museum of Art, New York * The Annunciation, Gallerie dell'Accademia, Venice; Oil on Canvas * Hagar in Desert, Church of Frari, Venice; Oil on Canvas * Justice and Peace, Palazzo Pesaro, Venice; fresco * Nativity (1740), National Gallery, London * Susanna and the Elders (1720), Metropolitan Museum of Art, New York City * St Elizabeth distributing Alms (1734), Szépmûvészeti Múzeum, Budapest; Oil on canvas, 72 x 43 cm * The family (1720), Oil on canvas, 60 x 73 cm, private collection * Sacrifice of Isaac (1720), Church of San Francesco della Vigna, Venice; Oil on Canvas, 118 x 155 cm * Descent from the Cross (c. 1750), Palace of Legion of Honor, San Francisco, California * Sacrifice of Polyxena (1733–1734), Getty Museum, Los Angeles * Christ and St Peter, Ashmolean Museum, Oxford * Annunciation (1758), Accademia, Venice * Death of Joseph, Berggruen Museum in Charlottenburg Palace, National Gallery (Berlin), Berlin; Oil on canvas, 97 x 79 cm * St Jerome and St Peter of Alcantara (1725), National Gallery of Scotland, Edinburgh; Oil on canvas, 275 x 143 cm * Penitent Magdalene (1740) Accademia, Venice, Oil on canvas, 48 x 38 cm * Sacrifice of Polyxena, Hermitage Museum, St Petersburg; Oil on canvas, 129 x 94 cm * Vision of St Anthony of Padua (1730), San Diego Museum of Art, Balboa Park, California; 35 1/2 in. x 23 1/4 in. * David and Bathsheba, 74x64 cm * Finding of Moses (c. 1730), Portland Art Museum, Oregon * Miracle of the loaves and fishes (1725), National Gallery of Victoria, Melbourne; oil on canvas, 120.1x178.5 cm * Martyrdom of St Thomas, Church of San Stae, Venice * Death of Sophonisba, Pushkin Museum, Moscow; oil on canvas, 165 x 214 cm * Rest on the Flight into Egypt (1725), Thyssen-Bornemisza Museum, Madrid; oil on canvas, 108 x 135 cm * St Roch (1727), Szépmûvészeti Múzeum, Budapest; oil on canvas, 42 x 32 cm * Allegorical monument to the glory of Isaac Newton (c. 1727–29), Fitzwilliam Museum, Cambridge * Nativity, Musée des Beaux-Arts, Quimper; oil on canvas, 74 × 56 cm * Stoning of St Stephen, 2nd left picture of the Church's altar of S. Maria Diessen * Death of Agripina and Death of Seneca, Dresden Gallery * Eliezer and Rebecca (c. 1725), Musée des Beaux-arts, Bordeaux * Enthroned Madonna and Child venerated by Saints Peter and Pius V (1723–1724), Church of Santa Corona, Vicenza * Madonna with Saints, Church of San Germano dei Berici * Diane and Acteon (c. 1725), Palazzo Chiericati, Vicenza; oil on canvas, 147 x 197.5 cm * Sacrifice by Jephthah, Museo di Palazzo Reale, Genoa * Portrait of Cardinal Bartolomeo Roverella, Accademia dei Concordi, Rovigo * Jupiter protect Justice, The Peace and the Science, Plafonds decoration, Ca' Pesaro, Venice * Saints presenting a devout Woman to Virgin and Child, Cleveland Museum of Art * Allegory of Painting and Sculpture, Gallerie dell'Accademia, Venice * Annunciation, Städelsches Kunstinstitut * Madonna of Sorrows, Museum Gemäldegalerie (Stiftung Preussischer Kulturbesitz) * Martyrdom of St Clement: Sketch for Altar at Clemenskirche, Muenster, displayed at Uppsala Universitet Konstsamling * St Peter, Kunsthalle ==Death== Pittoni died in Venice on 6 November 1767. He is buried in the church of San Giacomo dell'Orio. His reputation quickly faded after his death. Interest in him was revived in the 20th century. ==Related pages== * List of Italian painters ==References== Category:1687 births Category:1767 deaths Category:Italian painters Category:People from Venice",
 "title": "Giambattista Pittoni"
}