{
 "id": "532017",
 "text": "An Investment Bank is a business that helps other businesses (and also governments) borrow money and/or allow businesses to partially or fully sell themselves to other people and businesses. Unlike a regular bank, they do not typically lend their own money or use their own money to buy part or all of a business. They help to match the business financing need to investors who are seeking to earn money by either lending to the business or owning part of the business. In the mid 20th century, certain investment banks started to help their business clients to sell their business entirely to other businesses instead of to investors, as well as to help businesses decide what other business they should buy, with a fee based on the sale price of the business. This is called Mergers and Acquisitions. There are many small investment banks that only offer this activity, and do not help businesses to borrow money or sell ownership in the business. An investment bank helps businesses to borrow money using a contract known as a bond, and to sell ownership in the company using a contract known as stock. Most countries have government rules about these processes. The business must operate and disclose their financial results in a certain manner. They can then borrow money using bonds and sell ownership using stock to the public. People can sell bonds and stock without being responsible for the operation and financial disclosures of the business. Some reasons that a business might choose to borrow money from investors instead of a bank may include: * The for lower interest rates * An interest rate that is fixed (cannot changed) for a longer time than most banks would normally allow * Investors might be more willing to lend to a company more at risk at not being able to pay than a bank would be willing to do Some reasons that a business owner would agree to use an investment bank to sell part or all of their business to other investors include: * To earn a profit on the amount they initially invested in the business (because there might be a larger number of buyers willing to buy businesses that are publicly traded, the price received for the business might be higher than if the owner sold the business to another individual) * To raise money that the business can use to further grow * To raise funds to pay back money that was borrowed for the business that the business owner might not be able to otherwise pay back Investment Banks work with two kinds of customers, one being the businesses/governments which desire to borrow funds or sell ownership, and the individuals and other businesses who want to earn a profit on their money by lending to or owning other businesses. Category:Banks",
 "title": "Investment bank"
}