{
 "id": "532197",
 "text": "Exsanguination is losing enough blood to cause death. A person does not have to lose all of their blood to exsanguinate. People can die from losing half to two-thirds of their blood. ==Overview== The average adult has about 4 to 6 liters of blood (9 to 12 US pints) in their body. The average man has more blood than the average woman (who has 4 to 5 liters), and people who weigh more or are taller than others have more blood. This means a person can die from losing 2 1/2 to 4 liters of blood. To compare, this is five to eight times as much blood as people usually give in a blood donation. Babies (have about one cup of blood) and children have much less blood than adults, and can exsanguinate much easier by losing less blood than adults. The liver can and does store up to one pint of blood. Exsanguination is often called bleeding to death or bleeding out. It is a medical emergency. ==Definition== Doctors define exsanguination this way: * The patient is still losing blood * The bleeding is so bad that if it is not stopped quickly, the patient will die * The patient has lost over 40% of their blood (2 to 2.4 liters in an average adult) ==Types== Bleeding can be external or internal. ===External=== External means \"outside the body.\" External bleeding is visible - it can be seen outside the body. For instance, a person who cuts their hand and has blood on their hand is having external bleeding. ===Internal=== Internal means \"inside the body\". Internal bleeding cannot be seen, because it is inside the body. For instance, a person who is bleeding into their brain because of a stroke is having internal bleeding. Sometimes, bleeding can be both internal and external. A person can exsanguinate from internal bleeding, external bleeding, or both. ==Causes== Exsanguination is usually caused by major blood vessels getting injured or breaking open. Smaller blood vessels bleed less, and bleed slower, so it is harder to exsanguinate if they are injured. ===Injuries=== Exsanguination can be caused by trauma (injuries). Out of all people who die from injuries, 30‒40% die from exsanguination. Up to half of these people (33-56%) die before they even get to the hospital. Penetrating trauma is one of the most common causes of exsanguination. This is especially true for gunshot wounds to places like the heart, chest, or head, which all have major blood vessels in them. Other injuries that can cause exsanguination include: * Car accident * Amputation of an arm or leg * Injuries which cut major arteries, such as the aorta, carotid artery, or femoral artery A person can exsanguinate from internal bleeding if: * They break their pelvis * They break both of their femurs * They are bleeding into their chest or abdomen Exsanguination is one of the most common causes of death in soldiers at war. It is usually caused by gunshot wounds, motor vehicle accidents, or explosions. ===Medical problems=== Some medical problems can make a person exsanguinate by bleeding internally. These problems include: * A very bad peptic ulcer * Bleeding from the spleen, liver, or intestines * An aneurysm in the aorta that breaks. This can cause a person to exsanguinate in just a few minutes * A tumor that eats into a major blood vessel, like a tumor in the neck that eats into the carotid artery and makes it start bleeding * Sepsis, which can cause the infection to eat away at the walls of the blood vessels. Eventually the walls break and the blood vessels start to bleed * Bleeding after childbirth. Around the world, one woman dies every two minutes from exsanguination after childbirth. Most of these deaths happen in developing countries, which is commonly caused by Von Willebrand disease ==Effects== If a person is losing blood very quickly, they will only be conscious for 20 seconds to a few minutes. If blood loss is slower, and the person does not get medical treatment, they may be conscious for a few hours. However, they will get more and more confused and tired as they lose more blood. Eventually the person will go into a coma because there is not enough blood left in their body to bring oxygen to their brain. Finally their heart will stop and they will die. ===Exsanguination as a syndrome=== Doctors call exsanguination a syndrome, because it causes so many problems in the body. ====Hypothermia==== Blood helps keep us warm. Because of this, losing a lot of blood causes hypothermia. ====Coagulopathy==== Coagulopathy means that the blood no longer clots normally. When a person loses blood, they also lose the platelets and blood-clotting proteins the blood carried. These platelets and proteins make the blood clot. If a person loses too much blood, they will not have enough platelets or proteins left to make the blood clot. ====Acidosis==== Acidosis means that the body makes too much acid. Usually, the body makes energy out of oxygen carried in the blood and glucose; this is called aerobic respiration. If a person loses a lot of blood, there will not be enough oxygen in the blood that is left to make energy this way. The body switches to anaerobic respiration and makes energy out of glucose without needing oxygen. However, this creates many acidic waste products (chemicals that the body does not need, which are left over after the body does chemical reactions). Eventually, these waste products can build up so much that they poison the body. This is called acidosis. ====Arrhythmia==== When the heart does not get enough blood, it can start beating in ways that are not normal. When this happens because of exsanguination, it usually means that the patient is close to dying. ====Shock==== If a person loses enough blood, they will go into shock. This means the body's most important organs are not getting the blood, oxygen, and nutrients they need to survive. It also means that the body is not able to get rid of waste products, like acids. If shock gets bad enough, it will kill the person. ==Treatment== ===First aid=== First aid is an important first step in treating exsanguination. Things that regular people can do to help include: * Calling 9-1-1 (in the US), 9-9-9 (in the UK), or another local emergency telephone number immediately * Trying stopping the bleeding by: ** Pressing against the place that is bleeding ** If the person is bleeding from an arm or leg, lifting the arm or leg above the level of the person's heart ** Making a tourniquet and wrapping it tightly above where the person is bleeding * Keeping the person warm * Trying to help the person stay calm * Laying the person down and raising their legs, if possible * If the person is coughing or vomiting blood, turning them on their side so they do not choke If possible, a person giving first aid should wear gloves any time they touch another person's blood. The sick or injured person may have an infection that can be spread through blood, such as HIV or hepatitis. Wearing gloves protects the person giving first aid from getting these infections. First aid saved many lives during the Boston Marathon bombings, when individuals used belts for tourniquets or used their own hands to press against bleeding wounds. The three people who died in the bombings died right away. There were many other people who were hurt badly enough that they could have exsanguinated. For example, some people's legs were blown off by the bombs. However, because of the help of ordinary people giving first aid (and because of emergency medical services), everyone who did not die right away survived. ===Emergency medical treatments=== Emergency medical treatments for exsanguination include: * Blood transfusions * Treatments to warm the body up * Surgery to fix the cause of the bleeding * Giving medications to decrease acidosis * Tests, like ultrasounds or CT scans, to find the cause of bleeding if it is internal * Giving fluids, like saline, through a needle into a vein to add to the amount of fluid that is in the person's body ==Risk factors== ===Risk factors for exsanguination=== There are some risk factors which make a person more likely to exsanguinate. A few examples are: * Having a blood clotting disorder, like hemophilia * Being on anticoagulants. These can make even a small wound bleed dangerously * Advanced cancer Of everyone who has advanced cancer and is not getting treated for their cancer, up to one in 10 people have dangerous bleeding * Alcoholism. Drinking too much alcohol can damage the liver and also cause alcoholic hepatitis. If the liver is damaged, it cannot make blood- clotting proteins such as fibrinogens, as well as a healthy liver does This makes alcoholics more likely to bleed dangerously if they get hurt. Liver damage can also lead to a problem called esophageal varices, which can cause a person to exsanguinate by throwing up blood. ===Risk factors for death from exsanguination=== When a person is exsanguinating, they are more likely to die if: * They are elderly * They do not get into surgery quickly enough * They have hypothermia, with a temperature under 34° C * Their blood is more acidic because of acidosis * They have lower numbers of platelets when they first get to the hospital * They needed to be given more than 4 liters of blood, or over 10 liters of fluids, to replace the blood they lost * They lost more than 15 mL of blood per minute (losing blood this fast, the person would exsanguinate in less than 30–40 minutes) ==Related pages== * Tourniquet * NSAID ==References== Category:Blood disorders Category:Medical emergencies",
 "title": "Exsanguination"
}