{
 "id": "532318",
 "text": "Corazón que miente (English: Lying Heart) is a Mexican telenovela. It is produced by Mapat L. de Zatarain for Televisa. It is a remake of the Mexican telenovela Laberintos de pasión, produced in 1999 by Ernesto Alonso. It is created by Cuauhtémoc Blanco and Maria del Carmen Peña. The series stars Thelma Madrigal as Mariela, Pablo Lyle as Alonso, Diego Olivera as Leonardo and Dulce María as Renata. The series was first shown on Februaury 8, 2016, in Mexico on Canal de las Estrellas. == Cast == * Thelma Madrigal - Mariela Salvatierra Morán (main protagonist, granddaughter of Manuel, in love with Alonso, Leonardo's love interest) * Pablo Lyle - Alonso Ferrer Castellanos (main protagonist, son of Demián and Lucia, grandson of Sara, cousin of Renata, uncle of Rafaela and Padre Daniel, brother of Santiago and in love with Mariela) * Diego Olivera - Leonardo Del Río Solórzano (co-lead protagonist, godson of Carmen and in love with Lucia, then with Mariela), killed by Demián, caused an accident. * Dulce María - Renata Ferrer Jáuregui (antagonist, cousin of Alonso and Santiago, friend of Florencia, step niece of Rafaela, niece of Demián and Lucia, great granddaughter of Sara, in love with Santiago) ends up with both of her legs amputated, caused an car accident * Alexis Ayala - Padre Daniel Ferrer Bilbatúa (priest, nephew of Alonso and Santiago, son in law of Sara, brother in law of Lucia and Rafaela, brother of Demián) * Alejandro Tommasi - Demián Ferrer Bilbatúa (main antagonist, father of Alonso and Santiago, husband of Lucia and then with Rafaela, uncle of Renata, brother of Padre Daniel, son in law of Sara), responsible for the death of Manuel, Leonardo and Lucía. Commits suicide in jail with Rogelio * María Sorté - Carmen Oceguera Domínguez (godmother of Leonardo) * Lourdes Reyes - Rafaela Del Moral Sáenz de Ferrer (main antagonist, stepmother of Alonso, Santiago and Renata, cousin of Lucia, husband of Demián and niece of Sara) * Alejandro Ávila - Rogelio Medina Sánchez (villain, father of Cirilia), responsible of the death of Manuel and Florencia. Commits suicide in jail with Demián * Gerardo Murguía - Eduardo Moliner Arredondo (husband of Karla, father of Lisandro and Florencia) responsible for the death of Rogelio. * Arturo Muñoz - Lic. Céfiro Hidalgo (an attorney) * Ricardo Margaleff - Cristian Mena Souza * Alejandra Procuna - Elena Solís Saldívar (mother of Julio) * Vanesa Restrepo - Denise Shapiro Berlanga * Alejandra Jurado - Amalia González de Valdivia (mother of Lety, wife of Noe) * Jorge Ortín - Noé Valdivia Pérez (father of Lety, husband of Amalia) * Fátima Torre - Leticia Valdivia González \"Lety\" (daughter of Noé and Amalia, in love with Santiago and Julio's love interest) * Federico Ayos - Santiago Ferrer Castellanos (son of Demián and Lucia, grandson of Sara, cousin of Renata, uncle of Rafaela and Padre Daniel, brother of Alonso, lover of Florencia and in love with Renata and then with Lety) * Emmanuel Palomares - Lisandro Moliner Bustos (son of Eduardo and Karla, brother of Florencia) * David Palacio - Julio Solís Saldívar (son of Elena) * Jessica Mas - Karla Bustos de Moliner (wife of Eduardo, mother of Lisandro and Florencia) * Jessica Decote - Florencia Moliner Bustos (daughter of Eduardo and Karla, sister of Lisandro) killed by Rogelio * Mónica Zorti - Marcia * Jéssica Segura - Cirila Reyes * Benjamín Islas - Mario Preciado * Ricardo Vera - Dr. Fausto Ovalle * Iliana de la Garza - Eva * Ricardo Guerra - Sanabria * Vicente Torres - Ponciano * Lorena Álvarez - Martha * Helena Rojo - Sara Sáenz Vda. de Castellanos (mother of Lucia, mother in law of Demián and Padre Daniel, grandmother of Alonso and Santiago, great grandmother of Renata, aunt of Rafaela) * Ricardo Crespo - Fabricio Orive * Rubén Cerda - Antonio Miranda * Eric del Castillo - Manuel Salvatierra Neri (Actuación especial) (grandfather of Mariela), dies from smoke inhalation after trapped in a burning house by Rogelio (caused by Demián) * Mayrín Villanueva - Lucia Castellanos Sáenz de Ferrer (mother of Alonso and Santiago, wife of Demián, cousin of Rafaela, aunt of Renata, brother in law of Padre Daniel, daughter of Sara and love interest of Leonardo), accidentally shot and killed by Demián * Valentina Hazouri - Mariela Salvatierra Morán (niña) * Nikolas Caballero - Alonso Ferrer Castellanos (niño) * Santiago Torres Jaimes - Santiago Ferrer Castellanos (niño) * Montserrat Grm - Leticia Valdivia González \"Lety\" (niña) == References == Category:Telenovelas by Televisa Category:2016 television series debuts Category:2010s Mexican television series debuts",
 "title": "Corazón que miente"
}