{
 "id": "532379",
 "text": "April Winchell Foley (born January 4, 1960) is an American voice actress, writer, talk radio host, commentator and comedian. She is best known for voicing Clarabelle Cow in Mickey Mouse ClubHouse and various other Disney projects. She is the daughter of comedian and ventriloquist, Paul Winchell. She was married Mick Kuisel until they divorced. She has been married to John Foley since 2013. ==Filmography== Roles in television Year Title Role Notes 1972–1973 Kid Power Connie Voice role Animated series 1992 Defenders of Dynatron City Additional voices Voice role TV special 1992 Monster in My Pocket: The Big Scream Helga Voice role TV special 1992 Darkwing Duck Bianca Beaksley Voice role Animated series 1992–1993 Goof Troop Peg Pete / Various Characters Voice role Animated series 1993 Tom & Jerry Kids Additional voices Voice role Animated series 1993 Marsupilami Additional voices Voice role Animated series 1993 Problem Child Additional voices Voice role Animated series 1993–1994 Bonkers Dyl Piquel Voice role Animated series 1993–1994 SWAT Kats: The Radical Squadron Molly Mange Voice role Animated series 1994 Limboland Various 1994 Aladdin Woman Voice role Animated series 1994 Sonic the Hedgehog Additional voices Voice role Animated series 1995 Bump in the Night Auntie Matta The Princess The Cute Dolls Voice role Animated series 1995 The Shnookums and Meat Funny Cartoon Show Various Characters Voice role Animated series 1995–1999 Timon & Pumbaa Additional voices Voice role Animated series 1996 Gargoyles Shauna Coyle Voice role Animated series 1996 Earthworm Jim Ilene Voice role Animated series 1996 Grace Under Fire Ms. Salem 1996–1997 Mighty Ducks Tanya Voice role Animated series 1996–1997 Quack Pack Female Viking Various Characters Voice role Animated series 1996–1997 Jungle Cubs Various Characters Voice role Animated series 1996–1998 The Spooktacular New Adventures of Casper Miss C. / Baby Casper Voice role Animated series 1997 The Blues Brothers: The Animated Series Various Characters Voice role Animated series 1997 Johnny Bravo Various Characters Voice role Animated series 1997 Extreme Ghostbusters The Waitress Voice role Animated series 1997–1998 101 Dalmatians: The Series Cruella De Vil Voice role Animated series 1997–2001 Recess Muriel Finster Voice role Animated series 1998 Hercules Amazon Guard Voice role Animated series 1998 Men in Black: The Series Additional voices Voice role Animated series 1998 All Dogs Go to Heaven: The Series Tiffany Voice role Animated series 1998–1999 Mad Jack the Pirate Additional voices Voice role Animated series 1998–1999 CatDog Sadie / Space Grannies Voice role Animated series 1998–2000 Pepper Ann Lydia Pearson Voice role Animated series 1999 The Wild Thornberrys Gemsbok #2 Voice role Animated series 1999 Time of Your Life Karen 1999–2000 Mickey Mouse Works Clarabelle Cow Voice role Animated series 1999–2001 Kids from Room 402 Miss Gracie Graves / Various Characters Voice role Animated series 2000 Buzz Lightyear of Star Command Pwerta Voice role Animated series 2000 Rugrats Argenta Voice role Animated series 2000–2001 Clerks: The Animated Series Judge Voice role Animated series 2001–2002 House of Mouse Clarabelle Cow Voice role Animated series 2001–2003 The Legend of Tarzan Terk / Bibi's Mother Voice role Animated series 2001 Mona the Vampire Perdita Voice role Animated series 2002 Totally Spies! Ms. Brooks / Principal Vegan Voice role Animated series 2002 That '80s Show Mrs. Nealon 2002 Ozzy and Drix Lunchlady Voice role Animated series 2002–2003 Teamo Supremo Hypnotheria Voice role Animated series 2002–2003 Lloyd in Space Nora Nebulon Voice role Animated series 2003 The Mummy: The Animated Series Aglaophone #1 Voice role Animated series 2003 Rocket Power Announcer Voice role Animated series 2003–2006 Lilo & Stitch Mrs. Edmonds Voice role Animated series 2003–2007 Kim Possible Bernice Trisha Voice role Animated series 2004 Fatherhood Ms. Huffington Voice role Animated series 2006 Bratz Gertrude Voice role Animated series 2006 Catscratch Various Characters Voice role Animated series 2006 The X's Various Characters Voice role Animated series 2006–2007 Eloise: The Animated Series Various Characters Voice role Animated series 2006–2007 Legion of Super Heroes Winema Wazzo Voice role Animated series 2006–2011 Mickey Mouse Clubhouse Clarabelle Cow Voice role Animated series 2007 Mr. Slither Voice role Animated series 2007 Slacker Cats Additional voices Voice role Animated series 2007–2008 Tak & the Power of Juju Donna Voice role Animated series 2008–2014 Phineas and Ferb Blanca Dishob Bridgette Oshinomi Princess Leia Voice role Animated series 2009 As Told by Ginger Cleaning Lady Voice role Animated series 2009 King of the Hill Various Characters Voice role Animated series 2010–2011 Kick Buttowski: Suburban Daredevil Helga Voice role Animated series 2011 Curious George Chilla DeWinter Melanie Voice role Animated series 2011 Scooby-Doo! Mystery Incorporated Various Characters Voice role Animated series 2011 Fish Hooks Lady Eelbottom Voice role Animated series 2011–2014 Jake and the Never Land Pirates Singsong Bird Slippery Serpent Voice role Animated series 2012 Robot and Monster Grandma Arpa Voice role Animated series 2012–2015 Gravity Falls Ma Duskerton Voice role Animated series 2013 Ben 10: Omniverse Queen Voratia Rumbletum Voice role Animated series 2013 Kung Fu Panda: Legends of Awesomeness Mistress Mugan Voice role Animated series 2013 Monsters vs. Aliens Soap Opera Alien Educational Television Voice role Animated series 2013–present Wander Over Yonder Sylvia Voice role Animated series 2014–2015 Breadwinners Mama Monster Voice role Animated series 2015 Star vs. the Forces of Evil Riddle Sphinx Voice role Animated series Roles in film Year Title Role Notes 1988 Who Framed Roger Rabbit Mrs. Herman Baby Herman (on-camera) Voice role 1990 Jetsons: The Movie Additional Voices Voice role 1993 Hollyrock-a-Bye Baby Additional voices Voice role Television film 1997 Mighty Ducks the Movie: The First Face-Off Tanya Voice role Direct-to-video 1998 Beauty and the Beast: Belle's Magical World Chandeleria Voice role Direct-to-video 1998 Pocahontas II: Journey to a New World Additional voices Voice role Direct-to-video 1998 Antz Additional voices Voice role 1999 Mickey's Once Upon a Christmas Firefighter Mother Voice role Direct-to-video 2000 Alvin and the Chipmunks Meet the Wolfman Madame Raya Voice role Direct-to-video 2001 Recess: School's Out Miss Finster Mrs. Detweiller Voice role 2001 Lady and the Tramp II: Scamp's Adventure Mrs. Mahoney Voice role Direct-to-video 2001 Mickey's Magical Christmas: Snowed in at the House of Mouse Mother Von Drake Voice role Direct-to-video 2001 Recess Christmas: Miracle on Third Street Miss Finster Voice role Direct-to-video 2002 Lady DeBurne Voice role Direct-to-video 2002 Tarzan & Jane Terk Voice role Direct-to-video 2002 Mickey's House of Villains Clarabelle Cow Voice role Direct-to-video 2002 Rapsittie Street Kids: Believe in Santa Nana Voice role 2003 Recess: All Growed Down Miss Finster Voice role Direct-to-video 2003 Recess: Taking the Fifth Grade Miss Finster Voice role Direct-to-video 2004 Mickey, Donald, Goofy: The Three Musketeers Clarabelle Cow Additional voices Voice role Direct-to-video 2004 Mickey's Twice Upon a Christmas Additional voices Voice role Direct-to-video 2005 Mulan II Matchmaker Voice role Direct-to-video 2005 Kim Possible Movie: So the Drama Reporter Voice role Direct-to-video 2005 Tarzan II Additional voices Voice role Direct-to-video 2005 Kronk's New Groove Hildy Marge Tina Additional voices Voice role Direct-to-video 2006 Asterix and the Vikings Vikea Voice role 2006 Queer Duck: The Movie Additional voices Voice role Direct-to-video 2006 Additional voices Voice role Direct-to-video 2007 Happily N'Ever After Additional voices Voice role 2009 Dame Grace Appleton Liza Babs Dolly Joan Gloria Scripty Helga Strudel Voice role Direct-to-video 2010 Superman/Batman: Apocalypse Female Radio Caller #1 Tresha Voice role Direct-to-video 2012 Strange Frame Pawnbroker Voice role 2013 Monsters University Additional Voices Voice role 2013 Despicable Me 2 Additional Voices Voice role 2015 Lego DC Comics Super Heroes: Justice League vs. Bizarro League Giganta Voice role 2015 Home Boov Voice role ==References== ==Other websites== * Category:1960 births Category:Living people Category:Actors from New York City Category:American radio personalities Category:American television actors Category:American voice actors Category:Comedians from New York City",
 "title": "April Winchell"
}