{
 "id": "5324",
 "text": "Texas (, American Spanish: Wells, John C. (1982). Accents of English. Volume 3: Beyond the British Isles (pp. i–xx, 467–674). Cambridge University Press. p. 551. ISBN 0-52128541-0.), officially the State of Texas, is a state in the South Central Region of the United States. It is the second largest US state by total area (after Alaska) with 268,596 sq mi (695,662 km2) and population (after California) with nearly 29 million people as of 2019. Its largest cities are Houston, Dallas, Fort Worth, San Antonio, El Paso, and Austin, the capital city. Texas became the 28th state in the United States in 1845. Texas has been controlled by Spain, France, the Confederate States of America, and Mexico. It declared its independence from Mexico in 1836. It was its own country, the Republic of Texas, for almost ten years. It is called the \"Lone Star State\" and its flag has one star. There are many tourist attractions in Texas. Fort Worth is known for its stockyards. Amarillo is known for the cattle business and stockyards. In Dallas, industrial technology companies including Texas Instruments and EDS have their home offices. San Antonio has The Alamo. Houston has the Johnson Space Center. Austin has the University of Texas at Austin. Texas A&M; University in College Station, Texas Tech University in Lubbock, Baylor University in Waco and the University of North Texas in Denton are other important universities in the state. ==Name== The state's name derives from táyshay, a word in the Caddoan language of the Hasinai (a Native American tribe), which means \"allies\" or \"friends.\" ==History== Texas was first explored in 1528 by Spanish explorers on accident (they were shipwrecked on the coast). It did not become a colony until 1685, when France claimed it. In response, Spain started a rival colony in 1691 by setting up a religious outpost in the eastern part of Texas. Spain did not come back to Texas until 1716 to protect its colonies in the west from French forces. Two years later, San Antonio was founded. The pressure between the Spaniards and Native Americans in East Texas stopped many settlers from coming to Texas. To stop the violence and the increasing Native American raids, Spain called a truce between many tribes in 1745 and 1789. Tensions rose in Texas after the United States bought a large amount of nearby land from France in 1803. This was the Louisiana Purchase. People began wondering whether Spain or the United States could claim Texas. Mexico won the Mexican War of Independence in 1821. Mexico, including Texas, was free from the Spanish Empire. Americans and other settlers came into Texas when Mexico allowed non- Spanish settlers to settle here. After many settlers came to Texas, Mexico started taxing non-citizens. This outraged many settlers. Many were already angry because Mexico banned slavery. Politics in Mexico became violent. Antonio López de Santa Anna became President and several Mexican States declared independence. On March 2, 1836, Texas declared independence from Mexico and soon they were at war. Texas won, but Mexico refused to recognize Texas as an independent sovereign Republic. Texas requested entry to the United States. Years later, in 1845, the US added Texas as a state, and Mexico broke off diplomatic relations. Mexico resisted offers by the U.S. to buy land extending from Texas to the Pacific Ocean. In 1846, a dispute over the border between Texas and Mexico resulted in armed conflict, and the Mexican-American War began. The United States won the war, and by the Treaty of Guadalupe- Hidalgo, in 1848 won lands that later formed the states of California, Arizona, Nevada, Utah, New Mexico, southwestern Colorado, and southwestern Wyoming. Mexico received 15 million dollars and gave up its claims to Texas. After Abraham Lincoln was elected President of the United States, Texas joined the newly formed Confederate States of America in 1861 and fought in the American Civil War in an attempt to become independent from the United States. The Confederates lost to the Union (the United States) in 1865. Texas was restored to full representation in Congress on March 30, 1870. On January 10, 1901, oil was found in Texas, leading to the founding of a richer economy. During a time when the economy was poor, many people left Texas. Texas did not regain the population it had lost until the 1950s and 60s. In recent years, Texas has become a hub for technology and computers. ==Geography== Texas is the second biggest state in the Union (after Alaska) and is bigger than every European country except Russia. It has mountains, forests, deserts, plains, and coasts. The largest river in Texas is the Rio Grande, which forms the border between Mexico and the United States throughout south Texas. The highest mountain in Texas is Guadalupe Peak. Texas borders Oklahoma to the north, New Mexico to the west, Arkansas to the northeast, and Louisiana to the east. It also borders the Mexican states of Chihuahua, Coahuila, Nuevo León, and Tamaulipas. Texas has a lot of counties, divided into 254. Most of Texas is in Central Time, but El Paso in Western Texas is in Mountain Time. == Economy == Texas has the second largest economy in the United States after the economy of California. It had a gross state product of US$1.887 trillion in 2019. Texas was home to six of the top 50 companies on the Fortune 500 list in 2015 (third most after New York and California). In 2017, Texas grossed more than US$264.5 billion a year in exports—more than the exports of California (US$172 billion) and New York (US$77.9 billion) combined. As a sovereign country, in 2016, Texas would be the 10th largest economy in the world by gross domestic product (GDP), ahead of South Korea and Canada and behind Brazil. ==List of counties in Texas== ===A=== Counties Seat Image Map A Anderson Palestine Andrews Andrews Angelina Lufkin Aransas Rockport Archer Archer City Armstrong Claude Austin Bellville B Bailey Muleshoe Bandera Bandera Bastrop Bastrop Baylor Seymour Bee Beeville Bell Belton Bexar San Antonio Blanco Johnson City Borden Gail Bosque Meridian Bowie New Boston Brazoria Angleton Brewster Alpine Briscoe Silverton Brooks Falfurrias Brown Brownwood Burleson Caldwell Burnet Burnet C Caldwell Lockhart Calhoun Port Lavaca Callahan Baird Cameron Brownsville Camp Pittsburg Carson Pandhandle Cass Linden Castro Dimmit Chambers Anahauc Cherokee Rusk Childress Childress Clay Henrietta Cochran Morton Coke Robert Lee Coleman Coleman Collin McKinney Collingsworth Wellington Colorado Columbus Comal New Braunfels Comanche Comanche Concho Paint Rock Cooke Gainesville Coryell Gatesville Cottle Paducah Crance Crane Crockett Ozona Crosby Crosbyton Culberson Van Horn D Dallam Dalhart Dallas Dallas Dawson Lamesa Deaf Smith Hereford Delta Cooper Denton Denton DeWitt Cuero Dickens Dickens Dimmit Carrizo Springs Donley Clarendon Duval San Diego E Eastland Eastland Ector Odessa Edwards Rocksprings Ellis Waxahachie El Paso El Paso Erath Stephenville F Falls Marlin Fannin Bonham Fayette La Grange Fisher Roby Floyd Floydada Foard Crowell Fort Bend Richmond Franklin Mt. Vernon Freestone Fairfield Frio Pearsall G Gaines Seminole Galveston Galveston Garza Post Gillespie Fredericksburg Glasscock Garden City Goliad Goliad Gonzales Gonzales Gray Pampa Grayson Sherman Gregg Longview Grimes Anderson Guadalupe Seguin H Hale Plainview Hall Memphis Hamilton Hamilton Hansford Spearman Hardeman Quanah Hardin Kountze Harris Houston Harrison Marshall Hartley Channing Haskell Haskell Hays San Marcos Hemphill Canadian Henderson Athens Hidalgo Edinburg Hill Hillsboro Hockley Levelland Hood Granbury Hopkins Sulphur Springs Houston Crockett Howard Big Spring Hudspeth Sierra Blanca Hunt Greenville Hutchinson Stinnett I Irion Mertzon J Jack Jacksboro Jackson Edna Jasper Jasper Jeff Fort Davis Jefferson Beaumont Jim Hogg Hebbronville Jim Wells Alice Johnson Cleburne Jones Anson K Karnes Karnes City Kaufman Kaufman Kendall Boerne Kenedy Sarita 190px Kent Jayton Kerr Kerrville Kimble Junction King Guthrie Kinney Brackettville Kleberg Kingsville Knox Benjamin L Lamar Paris Lamb Littlefield Lampasas Lampasas La Salle Cotulla Lavaca Hallettsville Lee Giddings Leon Centerville Liberty Liberty Limestone Groesbeck Lipscomb Lipscomb Live Oak George West Llano Llano Loving Mentone Lubbock Lubbock Lynn Tahoka M McCulloch Brady McLennan Waco McMullen Tilden Madison Madisonville Marion Jefferson Martin Stanton Mason Mason Matagorda Bay City Maverick Eagle Pass Medina Hondo Menard Menard Midland Midland Milam Cameroon Mills Goldthwaite Mitchell Colorado City Montague Montague Montgomery Conroe Moore Dumas Morris Daingerfield Motley Matador N Nacogdoches Nacogdoches Navarro Corsicana Newton Newton Nolan Sweetwater Nueces Corpus Christi O Ochiltree Perryton Oldham Vega Orange Orange P Palo Pinto Palo Pinto Panola Carthage Parker Weatherford Parmer Farwell Pecos Fort Stockton Polk Livingston Potter Amarillo Presidio Marfa R Rains Emory Randall Canyon Reagan Big Lake Real Leakey Red Clarksville Reeves Pecos Refugio Refugio Roberts Miami Robertson Franklin Rockwall Rockwall Runnels Ballinger Rusk Henderson S Sabine Hemphill San Augustine San Augustine San Jacinto Coldspring San Patricio Sinton San Saba San Saba Schleicher Eldorado Scurry Snyder Shackelford Albany Shelby Center Sherman Stratford Smith Tyler Sowervell Glen Rose Starr Rio Grande Stephens Breckenridge Sterling Sterling City Stonewall Aspermont Sutton Sonora Swisher Tulia T Tarrant Fort Worth Taylor Abilene Terrell Sanderson Terry Brownfield Throckmorton Throckmorton Titus Mt. Pleasant Tom Green San Angelo Travis Austin Trinity Groveton Tyler Woodville U Upshur Gilmer Upton Rankin Uvalde Uvalde V Val Verde Del Rio Van Zandt Canton Victoria Victoria W Walker Huntsville Waller Hempstead Ward Monahans Washington Brenham Webb Laredo Wharton Wharton Wheeler Wheeler Wichita Wichita Falls Wilbarger Vernon Willacy Raymondville Williamson Georgestown Wilson Floresville Winkler Kermit Wise Decatur Wood Quitman Y Yoakum Plains Young Graham Z Zapata Zapata Zavala Crystal City ==Related pages== * Colleges and universities in Texas * List of cities in Texas * List of towns in Texas ==References== Category:1845 establishments in the United States",
 "title": "Texas"
}