{
 "id": "532475",
 "text": "A jury trial or trial by jury is a legal proceeding in which a jury either makes a decision or makes findings of fact, which is called a verdict. The judge usually follows the jury's verdict in his ruling. It is distinguished from a bench trial in which a judge or panel of judges makes all of the decisions. == History == William the Conqueror brought to to England a system of having witnesses who had any knowledge of a crime tell the court what they knew after they had first sworn an oath. The English word \"juror\" comes from the French word jurer (to swear). In the 12th century, juries were used by the king to discover and present facts, usually in answer to questions from the king or his ministers, who made the final decision in the case. Eventually, that led to a system in which the jury made a verdict based on evidence. In the late colonial period, juries became a tool used to express American discontent with British rule. A series of Navigation Acts prohibited the American colonies from trading directly with the Netherlands, Spain, France, and their colonies. As more and more trade restrictions were imposed, the American colonists turned to smuggling. When smugglers were caught, they were brought before juries made up of other colonists. The sympathetic juries often acquitted their fellow colonists. The British government, angered at the lawbreakers going free, created new courts, whhich did not allow juries. That was a breach of common law practice and infringed on the colonists' rights as British citizens. After the American Revolutionary War, the Seventh Amendment declared the right to a jury to limit the powers of the executive and the judicial branches of the new federal government. == Criminal trials == Jury trials are changing worldwide. In 2008, Russia abolished jury trials in cases of treason and terrorism. Even in England, where juries started, is using them less in cases of serious fraud and may ban them from some inquests. In the United States, jury trials are on the decline. However, many Asian countries have legal systems that are moving towards using jury trials more often. == Civil trials == The right to a jury trial in civil cases is found in the United States but very few other countries. England, Canada, Australia, and New Zealand have all but replaced with civil jury trials with bench trials. Less than 1% of US civil trials are jury trials. The Seventh Amendment prevents judges from overturning a jury verdict in federal cases if the finding of fact is reasonably supported by the evidence. Also, the Sixth Amendment guarantees the right to a speedy trial by an impartial jury in criminal cases. == References == == Other websites == * US Jury System * The Good, The Bad and the Ugly of a Jury Trial * Why Trial by Jury is Usually a Better Choice than a Bench Trial * Should I Waive a Jury Trial and Instead Have a Bench Trial? Category:Trials",
 "title": "Jury trial"
}