{
 "id": "53306",
 "text": "The Fairly OddParents is an American children's animated television series. It was created by Butch Hartman in 2001 for the Nickelodeon cable television network. The show is about a 10-year-old boy named Timmy Turner who has 2 fairy godparents named Cosmo and Wanda. He also has a fairy godbrother named Poof. The fairies have the power to grant wishes to Timmy. When granting his wishes, they must still following \"Da Rules\", the fairy rule book. The Fairly OddParents was the fourth longest-running Nicktoons series. In 2017, it ended with the half-hour episode \"Hare Raiser / The Kale Patch Caper\". The series was originally set to continue, but ended with the tenth season. The series was cancelled by Nickelodeon in 2018. A live-action-animation hybrid reboot by Paramount+ and Nickelodeon Productions was announced to be in development in February 2021. The series The Fairly OddParents: Fairly Odder premiered on March 31, 2022. and an upcoming untitled computer-animated series by Nickelodeon Animation Studio, this version features an African-American character named Hazel. The show premiered on TeenNick in May 18, 2024! And reaired on March 2025! ==Cast== * * Tara Strong as Timmy Turner, Poof * Daran Norris as Cosmo, Mr. Turner, Jorgen Von Strangle * Susanne Blakeslee as Wanda Mrs. Turner * Grey DeLisle as Vicky, Tootie * Matthew W. Taylor as Sparky * Kari Wahlgren as Chloe Carmichael Recurring voice actors include Jim Ward, Rob Paulsen, Dee Bradley Baker, Tom Kenny, Eric Bauza, Jason Marsden, Jeff Bennett, Dionne Quan, Gary LeRoi Gray, Kevin Michael Richardson, Frankie Muniz, and Ibrahim Haneef Muhammad. ==Episodes== == TV Movies == The Fairly OddParents had some Made for TV Movies including Abracatastrophe, Channel Chasers, School’s Out: The Musical, Fairy Idol, A Fairly OddBaby and Wishology. It also had three live action movies with Drake Bell as Timmy Turner. ==References== Category:American children's television series Category:2000s American animated television series Category:2010s American animated television series Category:American television series revived after cancellation Category:2001 American television series debuts Category:2017 American television series endings Category:Television series created by Butch Hartman Category:English-language television programs Category:The Fairly OddParents Category:Traditional animation",
 "title": "The Fairly OddParents"
}