{
 "id": "533074",
 "text": "Wesley Allison Clark (April 27, 1927 – February 22, 2016) was an American computer designer. He created the LINC computer, which was the first mini- computer and shares with a number of other computers (such as the PDP-1) the claim to be the inspiration for the personal computer. ==Early life== Clark was born in New Haven, Connecticut. He grew up in Kinderhook, New York and northern California. He graduated from the University of California, Berkeley in 1947 with an A.B. in Physics. Clark began his career as a physicist at the Hanford Site. ==Career== In 1981 Clark received the Eckert-Mauchly Award for his work on computer architecture. He was awarded an honorary degree by Washington University in 1984. He was elected to the National Academy of Engineering in 1999. Clark was a charter recipient of the IEEE Computer Society Computer Pioneer Award for \"First Personal Computer.\" ==Death== Clark died on February 22, 2016 in New York City from heart disease at the age of 88. ==References== ==Other websites== *Wesley Clark article in Smart Computing Encyclopedia *Oral history interview with Wesley Clark. Charles Babbage Institute, University of Minnesota. Clark describes his research at Lincoln Laboratory and interaction with the Information Processing Techniques Office (IPTO) of the Advanced Research Projects Agency (ARPA). Topics include various custom computers built at MIT, including the LINC computer; timesharing and network research; artificial intelligence research; ARPA contracting; interaction with IPTO directors; the work of Larry Roberts at IPTO. *Functional Description of the L1 Computer, March 1960 at bitsavers.org *The Logical Structure of Digital Computers, October 1955 at bitsavers.org *Multi- Sequence Program Concept, November, 1954 at bitsavers.org Category:1927 births Category:2016 deaths Category:Deaths from heart disease Category:American computer scientists Category:Scientists from New Haven, Connecticut",
 "title": "Wesley A. Clark"
}