{
 "id": "533095",
 "text": "During the Holocaust, at least 6,000,000 Jews were killed by Nazi Germany, other Axis powers and their local collaborators. * * * * * * The Jewish victims of the Holocaust were killed in Nazi extermination camps. Many others died in camps and ghettoes from diseases, man-made starvation, and freezing to death, caused by the terrible living conditions. Others in areas that Nazi Germany took over died from famine and other causes. ==Motives== ===Racialism=== The Nazis believed that some races and ethnic groups were not as good as others. They thought the \"Aryan race\" was the best of all. They wanted Nazi Germany to be filled only with \"Aryan\" people. The Nazis thought that there were some ethnic groups that were not even human. Two of these groups were the Jews and the Sinti and Roma People. The Nazis decided to kill all of the Jews and Sinti and Roma People in Nazi Germany. The Nazis also thought that Slavic peoples were less than human, and they killed millions of Slavs because of their ethnicity. ==Jewish victims of the Holocaust== The Nazis thought of the Jewish people as an ethnic group. This meant that even if a person did not practice the Jewish religion, the Nazis still thought of them as Jewish. Early on in World War II, the Nazis made Jewish people leave their homes and forced them to live in ghettos. However, by 1941, Adolf Hitler had decided to kill all of the Jews in Europe. This plan was called the Final Solution. Starting in 1942, the Nazis deported the Jews from the ghettos to death camps like Auschwitz. At these camps, people were killed in gas chambers as soon as they arrived. By the end of The Holocaust, one out of every three Jewish people in the world had died or been killed by the Nazis.American Jewish Committee, Harry Schneiderman and Julius B. Maller, eds. , American Jewish Year Book, Vol. 48 (1946–1947) , Press of Jewish Publication Society of America, Philadelphia, 1946, page 599 In Europe, only one out of every three Jews survived The Holocaust. Many countries lost most of their Jewish populations. For example: * 3 million Polish Jews died or were killed (this was 90% of the Jews in Poland) * 2.1 million Jews died or were killed in the Soviet Union * Estonia, Latvia, Lithuania, Germany, and Austria all lost 90% of their Jewish populations * Another eight countries lost over half of their Jewish populations: Bohemia and Moravia (89%); Slovakia (83%); Greece (77%); Netherlands (75%); Hungary (70%); Belgium (60%); and Yugoslavia (60%) Over one million Jewish children died or were killed during the Holocaust. ==Other victims of Nazi aggression== ===Slavs=== The Nazis also caused the death of millions of Slavic people, including Poles, Serbs and Russians, Ukrainians, Czechs, Bosniaks, and Sorbs. The Nazis thought Slavs were an inferior race. However, they also wanted to clear out the people in the Slavic countries, so there would be plenty of Lebensraum (\"living space\") for \"Aryan\" people. ====Poles==== Poles were one of the groups whose population Hitler sought to reduce. He first shared this idea in 1939. On August 22, 1939, Hitler said: > [T]he [goal] of the war is ... to destroy the enemy. That is why I have > prepared ... my 'Death's Head' [groups of soldiers] with orders to kill > without pity or mercy all men, women, and children of Polish descent or > language. Only in this way can we [get] the living space we need.p.115 Before World War II, Poland had the largest population of Jews in Europe. By the end of the Holocaust, three million Polish Jews had died or been killed.p. 403 So had 1.8 million to three million Poles who were not Jewish.Polska 1939–1945. Straty osobowe i ofiary represji pod dwiema okupacjami, ed. Tomasz Szarota and , Warszawa, IPN 2009, (Introduction reproduced here )p. 305 These victims included: * Hundreds of thousands of Roman Catholic and Orthodox Poles, who were sent to Auschwitz and other concentration camps * Scholars and other important people * Children of all ages Almost 17% of Poland's entire population died or was killed in The Holocaust. ====Ukrainians==== Originally, the Nazis reportedly planned to reduce the 23.2 million people in Ukraine by 65% (about 15 million Ukrainians).Hans-Walter Schmuhl. The Kaiser Wilhelm Institute for Anthropology, Human Heredity, and Eugenics, 1927–1945: crossing boundaries. Volume 259 of Boston studies in the philosophy of science. Coutts MyiLibrary. SpringerLink Humanities, Social Science & LawAuthor. Springer, 2008. , 9781402065996, p. 348–349 They planned to make the survivors work as slaves.Robert Gellately. Revieved works: Vom Generalplan Ost zum Generalsiedlungsplan by Czeslaw Madajczyk. Der \"Generalplan Ost.\" Hauptlinien der nationalsozialistischen Planungs- und Vernichtungspolitik by Mechtild Rössler; Sabine Schleiermacher. Central European History, Vol. 29, No. 2 (1996), pp. 270–274 Between 1941 and 1945, the Nazis killed about three million Ukrainians.p. 403 They also deported over two million Ukrainians to Germany to be used as slave workers. More Ukrainians were killed fighting the Wehrmacht in the Soviet Red Army than American, British and French soldiers all put together. ====Soviets==== Many Soviet prisoners of war (POWs) and civilians died during Operation Barbarossa (the Axis countries' invasion of the Soviet Union). The Nazis killed many adult civilians and children in the lands they took over. The Nazis killed millions of Red Army prisoners of war in many ways: * German soldiers (especially the Waffen-SS) executed them after they were captured * Many Soviet POWs died because of terrible conditions in German prisoner of war camps, or on death marches * The Nazis sent many Soviet POWs to concentration camps to be killed In eight months between 1941-1942, the Nazis killed about 2.8 million Soviet POWs by execution, starvation, and freezing to death.Case Study: Soviet Prisoners-of-War, Gendercide Watch. After the Nazis occupied parts of the Soviet Union, they treated Soviet civilians terribly. During the siege of Leningrad, more than 1.2 million civilians died. Nazi soldiers destroyed thousands of peasant villages across Russia, Belarus, and Ukraine. In 1995, the Russian Academy of Sciences reported that the Nazis caused 13.7 million civilian deaths in the occupied Soviet Union, including Jews. This was 20% of the area's population. These deaths included: * 7.4 million victims of Nazi genocide and reprisals * 2.2 million deaths of persons deported to Germany as forced labor * 4.1 million deaths from famine and disease About three million people also died of starvation in areas that the Nazis had not taken over.The Russian Academy of Science Rossiiskaia Akademiia nauk. Liudskie poteri SSSR v period vtoroi mirovoi voiny:sbornik statei. Sankt-Peterburg 1995 ===Roma and Sinti people=== Under the Nazis' Nuremberg Laws, the Sinti and Roma people were called \"enemies of the race-based [Germany],\" just like Jews. Like with the Jews, the Nazis wanted to kill all of the Roma and Sinti people in Europe. In 1936, the Nazis began deporting Roma and Sinti people, first to areas on the outside edges of cities, and later to the same ghettoes that Jews were sent to. In 1942, Heinrich Himmler ordered that the Roma and Sinti people (including children) should be sent to Auschwitz concentration camp. The Nazis also sent many Roma and Sinti adults and children to other death camps, like Bełżec, and to other concentration camps, like Ravensbrück. Historians estimate that 220,000 to 500,000 Roma and Sinti were killed by the Nazis. This was about one in every four Roma and Sinti people who lived in Europe at the time. However, one researcher says that as many as 1.5 million Roma and Sinti may have died during The Holocaust. After World War II, it took a long time for countries to admit that Nazi Germany had committed a genocide against the Roma and Sinti people. In 1982, West Germany admitted that a genocide of the Roma had happened. In 2011, the Polish Government ruled that Poland would honor the Roma genocide every year on the 2nd of August. ===Disabilities=== The Nazis believed that people with disabilities were \"life unworthy of life,\" and that they did not deserve to live. People with disabilities also did not fit into the Nazis' ideas about having a race of perfect \"Aryans.\" The Nazis forced about 375,000 people to be sterilized so they could not have children with disabilities. These people included people with physical disabilities, mental illnesses, intellectual disabilities, and the Deaf. People with disabilities were the first people the Nazis killed in gas chambers. In 1939, the Nazis set up a \"euthanasia\" program called Aktion T4. As part of this program, the Nazis sent children and adults with disabilities to hospitals like Hartheim Euthanasia Centre, where they were killed with poison gas. They also killed some children with disabilities right after they were born. By the end of World War II, the Nazis had killed about 275,000 people with disabilities. About 5,000 to 7,000 of these victims were children. ===Homosexuality=== Lesbian, gay, bisexual, and transgender people were also victims of The Holocaust. The Nazis were especially cruel to gay men. They thought that homosexual people hurt Nazi Germany in a few ways: * The Nazis thought gay men were too weak and too much like women to be able to fight for Nazi Germany * The Nazis wanted \"Aryan\" Germans to have as many children as possible, but gay men would not be creating children * The Nazis thought homosexuality was contagious, and that other Germans would become homosexual just by being around gay people By 1936, Heinrich Himmler was trying to use Germany's laws, and make new laws, to persecute gay men. At least 100,000 gay German men were arrested, and 50,000 were convicted and put in prison. Some were forced into state-run psychiatric hospitals. Courts ordered hundreds of European gay men living in Nazi-controlled areas to be castrated with chemicals. Between 5,000 and 15,000 gay men were imprisoned in concentration camps. They were often treated even worse than other prisoners.Heinz Heger, Men with the Pink Triangle, Alyson Publishing: 1994 They had to wear a pink triangle on their shirts, just like men convicted of sexually abusing children and having sex with animals.Plant, The Pink Triangle. Lesbians were not usually treated as badly as gay men. They were usually not put in prison just because they were lesbians. In the concentration camps, they usually wore a black triangle. According to the United States Holocaust Memorial Museum, \"Nazi Germany did not seek to kill all homosexuals. Nevertheless, the Nazi state, through active persecution, attempted to terrorise German homosexuals into sexual and social conformity, leaving thousands dead and shattering the lives of many more.\" They wanted to scare German homosexuals into conforming, or acting like the rest of society. After World War II, many homosexuals who were liberated from the concentration camps were still persecuted in Germany. They could be charged under Paragraph 175, a law which made \"lewdness between men\" illegal. If they were convicted, they would be sent to prison. (The time they spent in the concentration camps would be subtracted from their sentences.) This was very different from how other Holocaust victims were treated. Other victims were compensated (given money) for the loss of family members and educational opportunities. Gay victims were treated like criminals. ===Political prisoners=== The Nazis also killed many people who did not agree with the Nazis' political beliefs. They thought of these people as political enemies of Nazi Germany. The Nazis were especially cruel to people who spoke out or fought against the Nazi government. When they arrested these people, the Nazis often killed them right after questioning them. Sometimes, the Nazis killed their families too. People who were not killed right away were sent to the political People's Court. This court was famous for the number of death sentences it gave. ====Leftists==== The Nazis thought of leftists as political enemies. Leftists included anarchists, communists, socialists, liberals, libertarians and Social Democrats. German communists and Social Democrats were some of the first people to be sent to Dachau concentration camp. The Nazi Party hated communism, and was worried that German communists would be loyal to the Soviet Union, a communist country. The Nazis spread rumors about communist violence to get the Enabling Act of 1933 passed. This law gave Adolf Hitler his first powers as a dictator. Hitler and the Nazis also hated German leftists because they did not agree with the Nazis' racism. When the Nazis took over a place, communists, socialists, liberals and social democrats were usually some of the first people they abused. Sometimes they would murder leftists right away.\"Commissar Order\". ushmm.org. Retrieved on 27 September 2015. ===Religion=== ====Jehovah's Witnesses==== As part of their religious beliefs, Jehovah's Witnesses refused to serve in the German Army, salute the Nazi flag, or say \"Heil Hitler\" (\"Hail Hitler\"). They refused to go along with Nazi beliefs and laws that went against their religious beliefs.Garbe, Detlef (2001). In Hans Hesse. Persecution and Resistance of Jehovah's Witnesses During the Nazi-Regime 1933–1945. Bremen: Edition Temmen. p.251 Because of this, many Jehovah's Witnesses were sent to concentration camps. Between 2,500 and 5,000 Witnesses died in the concentration camps.Shulman, William L. A State of Terror: Germany 1933–1939. Bayside, New York: Holocaust Resource Center and Archives. ====Roman Catholics==== The Nazis also attacked the Catholic Church during The Holocaust.Theodore S. Hamerow; On the Road to the Wolf's Lair - German Resistance to Hitler; Belknap Press of Harvard University Press; 1997; ; p. 136 Hitler wanted to destroy Catholicism and Christianity in Nazi Germany, and make Nazi Germany pagan instead.* Alan Bullock; Hitler: A Study in Tyranny; HarperPerennial Edition 1991; p 219: \"Once the war was over, [Hitler] promised himself, he would root out and destroy the influence of the Christian Churches, but until then he would be circumspect\" * Michael Phayer; The Response of the German Catholic Church to National Socialism , published by Yad Vashem: \"By the latter part of the decade of the Thirties church officials were well aware that the ultimate aim of Hitler and other Nazis was the total elimination of Catholicism and of the Christian religion. Since the overwhelming majority of Germans were either Catholic or Protestant this goal had to be a long-term rather than a short-term Nazi objective.\" * Shirer, William L., Rise and Fall of the Third Reich: A History of Nazi Germany, p. 240, Simon and Schuster, 1990: \"under the leadership of Rosenberg, Bormann and Himmler—backed by Hitler—the Nazi regime intended to destroy Christianity in Germany, if it could, and substitute the old paganism of the early tribal Germanic gods and the new paganism of the Nazi extremists\". * Gill, Anton (1994). An Honourable Defeat; A History of the German Resistance to Hitler. Heinemann Mandarin. 1995 paperback , pp. 14–15: \"[the Nazis planned to] de- Christianise Germany after the final victory\". * Richard J. Evans; The Third Reich at War; Penguin Press; New York 2009, p. 547 * Ian Kershaw; Hitler a Biography; 2008 Edn; WW Norton & Company; London p.661 * Ian Kershaw; The Nazi Dictatorship: Problems and Perspectives of Interpretation; 4th Edn; Oxford University Press; New York; 2000\"; pp. 173–74 * Sharkey, Word for Word/The Case Against the Nazis; How Hitler's Forces Planned To Destroy German Christianity, New York Times, 13 January 2002 * Griffin, Roger Fascism's relation to religion in Blamires, Cyprian, World fascism: a historical encyclopedia, Volume 1, p. 10, ABC-CLIO, 2006: \"There is no doubt that in the long run Nazi leaders such as Hitler and Himmler intended to eradicate Christianity just as ruthlessly as any other rival ideology, even if in the short term they had to be content to make compromises with it.\" * Mosse, George Lachmann, Nazi culture: intellectual, cultural and social life in the Third Reich, p. 240, Univ of Wisconsin Press, 2003: \"Had the Nazis won the war their ecclesiastical policies would have gone beyond those of the German Christians, to the utter destruction of both the Protestant and the Catholic Church.\" * Fischel, Jack R., Historical Dictionary of the Holocaust , p. 123, Scarecrow Press, 2010: \"The objective was to either destroy Christianity and restore the German gods of antiquity or to turn Jesus into an Aryan.\" * Dill, Marshall, Germany: a modern history , p. 365, University of Michigan Press, 1970: \"It seems no exaggeration to insist that the greatest challenge the Nazis had to face was their effort to eradicate Christianity in Germany or at least to subjugate it to their general world outlook.\" * Wheaton, Eliot Barculo The Nazi revolution, 1933–1935: prelude to calamity:with a background survey of the Weimar era, p. 290, 363, Doubleday 1968: The Nazis sought \"to eradicate Christianity in Germany root and branch.\" * Bendersky, Joseph W., A concise history of Nazi Germany, p. 147, Rowman & Littlefield, 2007: \"Consequently, it was Hitler's long range goal to eliminate the churches once he had consolidated control over his European empire.\" Thousands of German clergy, nuns, and Catholic leaders were arrested after the Nazis took over.Shirer, William L., Rise and Fall of the Third Reich: A History of Nazi Germany, pp. 234–235, Simon and Schuster, 1990 In 1939, Hitler invaded Poland, beginning World War II. Poland was mostly Catholic. The Nazis wanted to destroy Poland. They started by destroying the Catholic Church in Poland. They arrested the Church's leaders and closed churches and monasteries. In 1940, the Nazis created a special barracks just for priests at Dachau concentration camp.Paul Berben; Dachau: The Official History 1933–1945; Norfolk Press; London; 1975; ; p.143 Of 2,720 clergy imprisoned at Dachau, almost all (94.88 percent) were Catholic.Paul Berben; Dachau: The Official History 1933–1945; Norfolk Press; London; 1975; ; pp.276–277 About 1,700 were Polish priests; half of them died or were killed at Dachau.Richard J. Evans; The Third Reich at War; Penguin Press New York; 2009; p. 33–34 The Nazis even made it illegal for priests anywhere to give Catholic sacraments to Polish people. At least one German priest was sent to Dachau for taking a confession from a Polish Catholic. In 1933, Germany had made an agreement with the Holy See to protect Catholicism in Nazi Germany. However, the Nazis often broke this agreement.* Evans, 2008, pp. 245–246 * Shirer, 1990, pp. 234–35 * Hamerow, 1997, p. 136 * Gill, 1994, p. 57 * Kershaw, 2008, p. 332 * Paul O'Shea; A Cross Too Heavy; Rosenberg Publishing; p. 234–5 * Ian Kershaw; The Nazi Dictatorship: Problems and Perspectives of Interpretation; 4th ed.; Oxford University Press; New York; 2000; pp. 210–11 * Peter Hoffmann; The History of the German Resistance 1933–1945; 3rd ed. (first English ed.); McDonald & Jane's; London; 1977; p. 14 They shut down the Catholic press, schools, political parties and youth groups in Germany amid murder and mass arrests.Fred Taylor; The Goebbells Diaries 1939–1941; Hamish Hamilton Ltd; London; 1982 pp. 278 & 294Evans, Richard J. (2005). The Third Reich in Power. New York: Penguin. ; pp. 245–246William L. Shirer; The Rise and Fall of the Third Reich; Secker & Warburg; London; 1960; p. 201 The Church was treated especially badly in lands that Germany took over. In Austria, Catholic property was taken, Catholic organizations were closed, and many priests were sent to Dachau. In Czechoslovakia, the Nazis refused to let people follow religious orders; closed schools; made religious teachings illegal; and sent priests to concentration camps.Mark Mazower; Hitler's Empire - Nazi Rule in Occupied Europe; Penguin; 2008; ; pp. 51–52 Catholic people, bishops, clergy, and nuns protested and attacked Nazi policies. In 1942, Dutch bishops protested the mistreatment of the Jews. When the Dutch Archbishop refused to obey the Nazis, the Gestapo rounded up Catholic \"Jews\" and sent 92 to AuschwitzRichard J. Evans; The Third Reich at War; Penguin Press; New York 2009, p.385 A Dutch Catholic nun named Edith Stein was murdered at Auschwitz. So was Maximilian Kolbe, a Polish priest. Both were eventually made into Catholic saints by Pope John Paul II in the 1980s. Other Catholic victims of the Holocaust have also been beatified, including some of the Polish priests who died at Dachau. ====Protestants==== Some Protestant Churches agreed with Nazi ideas. Others did not. Trying to take over Protestantism in Germany, the Nazis formed the National Reich Church: an official state church that taught a state religion based on Nazism. The Reich Church: * Took away all Christian crosses and replaced them with the Nazi swastika * Fired all clergy members and replaced them with Nazi speakers * Demanded that the Bible never be printed in Germany again * Put Hitler's book Mein Kampf on the altars of all its churches They fired all clergy members who were not \"Aryan.\" Church members called themselves \"German Christians\" and said they had \"the swastika on their chest and the cross in their heart.\" Protestant groups that disagreed with Nazi ideas formed the Confessing Church, a group of German churches. Martin Niemöller was one or their leaders. Nazis persecuted the Confessing Church. See drop-down essay on \"Unification, World Wars, and Nazism\" In May 1936, the Confessing Church sent a letter to Hitler criticizing his actions. The Nazis reacted by: * Arresting hundreds of pastors * Sending some of the Confessing Church's leaders to concentration camps * Taking all of the Confessing Church's money * Making it illegal for the Confessing Church's members to give money to the Church Most pastors and churches were not members of either the Reich Church or the Confessing Church. Pastors who spoke out against what the Nazis were doing were threatened, arrested, and sometimes sent to concentration camps. ====Bahá'í Faith==== In 1937, the Nazis made it illegal to practice the Bahá'í Faith. The Nazis closed all Bahá'í organizations in Germany. The Nazis did not like the Bahá'í Faith because it taught pacifism. Throughout the Holocaust, Bahá'ís were arrested and given very expensive fines. The Nazis also continued to close their organizations. ====Freemasons==== The Nazis blamed Freemasonry for Germany losing World War I. They said the Freemasons' leaders were part of a conspiracy with Jewish people to take over Germany. In 1941, Adolf Hitler decided that Masons were political enemies. The Nazis sent tens of thousands of Masons to concentration camps. Between 80,000 to 200,000 Freemasons were killed. ==Total deaths of Nazi genocides== This table estimates the total number of victims of Nazi genocides. Victims Number of Deaths Source(s) Jews 5.93 million Dawidowicz, Lucy. The War Against the Jews, Bantam, 1986. p. 403. Soviet civilians (not including Soviet Jews) 5.7 million Ukrainians 3 million Soviet POWs 2 million–3 million . Ethnic Poles (not including Polish Jews) 1.8 million–3 million 1.8–1.9 million non-Jewish Polish citizens are estimated to have died as a result of the Nazi occupation and the war. Estimates are from Polish scholar, Franciszek Piper, the chief historian at Auschwitz. Poles: Victims of the Nazi Era at the United States Holocaust Memorial Museum.Łuczak, Czesław. \"Szanse i trudności bilansu demograficznego Polski w latach 1939–1945\", Dzieje Najnowsze, issue 1994/2. Serbs 300,000–500,000 People with disabilities 275,000 Roma 90,000–500,000 \"Genocide of European Roma (Gypsies)\". Holocaust Encyclopedia. United States Holocaust Memorial Museum. Retrieved 27 September 2012. The USHMM places the scholarly estimates at 220,000–500,000. According to Berenbaum 2005, p. 126, \"serious scholars estimate that between 90,000 and 220,000 were killed under German rule.\" Freemasons 80,000–200,000 Freemasons for Dummies, by Christopher Hodapp , Wiley Publishing Inc., Indianapolis, 2005, page 85, sec. Hitler and the Nazis Slovenes 20,000–25,000 The number of Slovenes estimated to have died as a result of the Nazi occupation (not including those killed by Slovene collaboration forces and other Nazi allies) is estimated between 20,000 and 25,000 people. This number only includes civilians: Slovene partisan POWs who died and resistance fighters killed in action are not included (their number is estimated at 27,000). These numbers however include only Slovenes from present-day Slovenia: it does not include Carinthian Slovene victims, nor Slovene victims from areas in present-day Italy and Croatia. These numbers are result of a 10-year-long research by the Institute for Contemporary History (Inštitut za novejšo zgodovino) from Ljubljana, Slovenia. The partial results of the research have been released in 2008 in the volume Žrtve vojne in revolucije v Sloveniji (Ljubljana: Institute for Contemporary History, 2008), and officially presented at the Slovenian National Council ( Homosexuals 5,000–15,000 The Holocaust Chronicle, Publications International Ltd., p. 108. Spanish Republicans 7,000 Pike, David Wingeate. Spaniards in the Holocaust: Mauthausen, the horror on the Danube; Editorial: Routledge Chapman & Hall . London, 2000. Jehovah's Witnesses 2,500–5,000 TOTAL 19.2 million - 22.2 million ==Gallery== File:Bundesarchiv Bild 152-04-28, Heilanstalt Schönbrunn, Kinder.jpg|Disabled children who will be killed by the Nazis (1934) File:0254 HM Monson Collection Vienna 1938 01 49 45 00.webm|Home movie from Vienna, taken after Kristallnacht (1938) File:Bundesarchiv Bild 183-L28726, Sowjetische Kriegsgefangene bei Smolensk.jpg|Camp overcrowded with Soviet POWs (1941) File:Bundesarchiv Bild 101I-166-0527-04, Kreta, Kondomari, Erschießung von Zivilisten.jpg|Greek civilians killed by Nazis (1941) File:Bundesarchiv Bild 183-L19427, Litauen, brennende Synagoge.jpg|Nazis burn a Lithuanian synagogue (1941) File:Дистрофия алиментарная.jpg|A Soviet civilian starving to death because of the Nazis' siege of Leningrad File:WWII Krakow - 04.jpg|Public execution of Polish civilians (1942) File:Children headed for deportation.JPG|Jewish children being deported to a death camp, where they will be killed (1942) File:DeadBelgiumcivilians1944.jpg|Belgian civilians killed during the Nazi invasion of Belgium (1944) File:Bodies of U.S. officers and soldiers slain by the Nazis after capture near Malmedy, Belgium. - NARA - 196544.jpg|American POWs killed by the Nazis in Belgium (1944) File:Nazi Holocaust by bullets - Jewish mass grave near Zolochiv, west Ukraine.jpg|Ukrainian Jews shot by the Nazis File:Ustaše militia execute prisoners near the Jasenovac concentration camp.jpg|Serbs being executed at Jasenovac concentration camp ==References== Category:Nazi Germany Category:World War II Category:The Holocaust Category:Crimes against humanity",
 "title": "Holocaust victims"
}