{
 "id": "533129",
 "text": "École Centrale de Nantes (or Centrale Nantes) is a graduate engineering school in France.Centrale Nantes Its campus is in Nantes. It awards the following degrees: * Bachelor of Science (Hons) in Engineering *Diplôme d'ingénieur - equivalent to a Master of Science and Engineering *Masters of Science, Technology and Health *Erasmus Mundus Joint Master Degrees *Advanced Masters (Mastères Spécialisés) *PhD Centrale Nantes is a member of the Ecoles Centrale Group, (with CentraleSupélec, Centrale Lille, Centrale Lyon, Centrale Marseille, and Centrale Beijing). The school also takes part in international networks: T.I.M.E (Top Industrial Managers for Europe), RMEI , Magalhaes, and Heritage Network. In 2014, the Alliance Centrale - Audencia - ensa Nantes was created, bringing together Centrale Nantes, Audencia Business School, and l'Ecole Nationale Supérieure d'Architecture de Nantes. As part of this alliance, the Centrale-Audencia-ensa business incubator was created. Classes are taught in French and English languages. The school has students from over 70 nationalities. == Admission == Admission to courses at Master's level is possible after two- or three-year scientific undergraduate studies. The main admission routes are via: * a Bachelor degree in science (for the 2-year curriculum), or * the French nationwide selective examination with numerus clausus : concours Centrale-SupelecConcours Centrale-Supelec (for the 3-year curriculum) * selection by a partner institution (e.g. Top Industrial Managers for Europe (TIME) double degrees procedures applicable in Europe (2+2-year curriculum, including 2 years in France) The engineering programme, which leads to the award of diplôme d'ingénieur, typically lasts three years. It involves work experience and time spent abroad. Students who successfully completed Master's level courses earn 300 ECTS credits in the European education system. Students enrolled in a double degree programme spend two years at Centrale Nantes and two years in the partner institution. After these four years a double master's degree is awarded. == Research labs == Research at Centrale Nantes is centred on three main priorities: factory of the future, energy transition and engineering for health. The main research topics are: * Ocean engineering and MRE * Computer science and automation * Robotics *Energy and engines *Manufacturing and Additive Manufacturing *Engineering for health * Civil engineering and innovative concrete * Numerical simulation and high performance computing *Materials science and composites * Urban environment == References == == More reading == * Official website Category:Technical colleges and universities in France Category:1919 establishments in France Category:Nantes",
 "title": "École Centrale de Nantes"
}