{
 "id": "533585",
 "text": "Distance education (or distance learning) is a form of education where the teacher and the student(s) are not at the same physical location. In this mode of education, students get their course materials delivered to their homes, including lecture notes and assignments, via mail or any other online portal. It follows that the teaching must be done via some kind of medium or a collection of media. Print, movie, television, radio, video chat and computer web sources have been used. In 1840 Isaac Pitman began teaching his shorthand by sending and receiving postcards. His success led to the establishment of correspondence schools. Distance learning technologies using the Internet are used both for mastering individual advanced training courses for users, taking online courses and for obtaining higher education. == Types of Distance education == There are two types of distance education (or distance learning). === Synchronous (Paced) === It involves real-time delivery of lectures, allowing for live communication with teachers. This model requires teleconferencing and similar technologies, enabling face-to-face contact with instructors and classmates. However, it lacks flexibility as learners must adhere to scheduled class times. Asynchronous (Self-paced) This type of learning allows learners to progress through the curriculum at their own pace. Weekly deadlines are provided, allowing individuals to work according to their preferred speed and schedule. Course content can be accessed at any time, and interaction may occur through video comments, quizzes, and discussions. == Advantages == * Flexibility — students can get an education at the right time and in a convenient place; * Extended reach - students are not limited by distance and can study regardless of their place of residence; * Cost—effectiveness - the costs of long-distance trips to the place of study are significantly reduced. * Adaptability - Some instructors customise distance education programmes to serve their academic needs. Learners will get the chance to learn the course in any way. * Work and study can be combined – a distance learning program is often compatible with a full-time job. == Disadvantages == Some learners find remote learning distracting and may miss deadlines without direct interactions. Reliable computer and internet access are essential, and some instructors may require a webcam. Slow internet can cause frustration with long load times and frozen videos. == Related pages == *Open University *E-learning == References == Category:Education",
 "title": "Distance education"
}