{
 "id": "533504",
 "text": "The Birmingham Children's Crusade was a nonviolent protest in Birmingham, Alabama from May 2–5, 1963.Levinson, C. Y. (2012). We’ve Got a Job at The 1963 Birmingham Children’s March. Peachtree Publishers. This moment in history resulted in the desegregation of public facilities in Birmingham. It also became a launching point for March on Washington for Jobs and Freedom in August 1963. However, this was not a quickly put together march to demand desegregation of the most city in America.Birmingham campaign. (2019, December 17). Retrieved from Birmingham campaign The building tension of lunch counter sit-ins, boycotts, and protests nationwide called Dr. Martin Luther King Jr. to return to Birmingham in April 1963 to begin the launch of “Project C.” C represented confrontation, but as always, nonviolent confrontation; ordering food at segregated lunch counters, praying in parks and steps of city halls, boycotting segregated stores, etc. Knowing that scores of the protesters would be arrested, King hoped to overwhelm Birmingham's jails, thus forcing Eugene \"Bull\" Connor, Birmingham's Police CommissionerBull Connor. (2020, January 12). Retrieved from Bull Connor to desegregate the city. ==James L. Bevel: King's right hand man== King's head advisor for the Children's Crusade was Reverend James L. Bevel.Weber, B. (2008, Dec 23). James L. bevel, 72, an adviser to dr. king. New York Times (1923-Current File) Retrieved from https://www.proquest.com/docview/897167572 Bevel, a Navy veteran who became a minister from Itta Bena, Mississippi, found deep roots in Old Testament prophets and often wore a Jewish skullcap. After attending a seminar led by James Lawson, a fierce pacifist who firmly believed in training students in “the struggle of racial injustice,” Bevel saw the distinction between white oppression and blacks “accepting the status quo.” Interestingly, Diane Nash and Gloria Johnson also attended this workshop. As cited in David Oshinsky's article, Lawson taught, “The time had come for young people to move beyond the passivity of their elders. Segregation would end when devoted Christians, doing God’s work on earth, led a nonviolent crusade to destroy it. The struggle required physical courage, unshakable conviction and a willingness to forgive those who would beat and even murder them out of ignorance and fear… they were going to love segregation to death”., David M. Oshinsky. (1998, Mar 15). Freedom riders: David Halberstam's account of the civil rights movement, from the sit-ins to the buses, and those who led it. THE CHILDREN by David Halberstam. illustrated. 783 pp. New York: Random House. $29.95. freedom riders. New York Times (1923-Current File) Retrieved from https://www.proquest.com/docview/110036425 Approaching the Birmingham Children's Crusade with this background, Bevel spoke to the young students at Saturday nonviolent training sessions, “You are responsible for segregation, you and your parents because you have not stood up… no one has the power to oppress you if you don’t cooperate. So, if you say you are oppressed, then you are… in league with the oppressor; now, it’s your responsibility to break the league with him”. The power of introducing youth into the Civil Rights Movement became a turning point and showed the vast expanse of racism and systemic segregation that had become entrenched in the culture. == Involving children == Among the black community, involving children in the front lines of the national Civil Rights Movement raised a controversial topic. As most parents intend to do, African American parents, particularly in the South, were very protective of their children and had to educate them on the realities of racism from an early age. Thus, allowing their children to be in the front lines of the Birmingham Children's Crusade was certainly a barrier for young people to overcome. Despite this familial challenge, thousands turned out over the next week in protest.Sherman, R. (2017). The Emmett Till Generation: The Birmingham Children's Crusade and the Renewed Civil Rights Movement. Pell Scholars and Senior Theses. Retrieved from https://digitalcommons.salve.edu/cgi/viewcontent.cgi?article=1120&context;=pell_theses == Day 1: \"D-Day\" == Day 1 of the march was May 2, 1963. Bevel dubbed it “D-Day,” a direct reference to the Normandy Invasion that led to the Allied victory in World War II. The morning of the movement, some children went directly to the 16th Street Baptist Church located in downtown Birmingham, but many went to school and later in the morning walked out of class; thus making more of a point in their protest. Eventually almost a thousand school children, ages six to eighteen,Cook, E., & Racine, L. (2005). The Children’s Crusade and the Role of Youth in the African American Freedom Struggle. OAH Magazine of History, 19(1), 31–36. https://doi.org/10.1093/maghis/19.1.31 congregated in Kelly Ingram Park, 16th Street Baptist Church, and Metropolitan AME Zion Church to begin their march to city hall. The youth were organized into groups and as each group was confronted with barricades and policemen, and subsequently arrested, another “platoon” would emerge from the church. This phenomenon of the seemingly countless droves of students exiting the church puzzled an officer who asked how many more children were in the church and upon hearing, “at least a thousand,” uttered, “God A’mighty.” By the end of the first day, over 900 students had been arrested, and parents were discouraged from paying bail. As stated in OAH Magazine of History, “King was criticized for using children in the demonstrations. One of the most vocal criticisms came from Malcolm X who stated, ‘Real men don't put their children on the firing line.’ King responded by saying that the demonstrations allowed children to develop “a sense of their own stake in freedom and justice”. Also, not coincidentally, the 16th Street Baptist Church was the church that was bombed on September 15, 1963, just four months later.16th Street Baptist Church bombing. (2020, January 30). Retrieved from 16th Street Baptist Church bombing == Day 2: \"Double D-Day\" == Day 2: “Double D-Day.” Bull Connor authorized the use of high power fire hoses and attack dogs on the children as they again flooded the streets of downtown Birmingham. The fire hoses tore through the ranks of peaceful protesters, and the attack dogs dispersed the organized groups into a frenzied crowd. At one point during the afternoon, Connor locked the remaining 500-1000 marchers inside the 16th Street Baptist Church, mostly due to the fact that he was running out of space in the jail; precisely the goal of King and Bevel. Eventually, organizers ordered everyone to go home, and an additional 500-800 students were jailed. “Double D-Day” is said to be the event that no other effort could do, and that unites black Birmingham to raise their voice in protest of the systemic and oppressive segregation enforced upon them by the white supremacy. King's words to worried parents summed up the overall attitude of the protesters and the seriousness in which they took their task. “Your daughters and sons are in jail… don’t worry about them. They are suffering for what they believe, and they are suffering to make this nation a better nation”. == Aftermath == On May 10, 1963, the protesters and the Birmingham city officials reached a settlement that desegregated all public facilities in Birmingham. This march of thousands of elementary, middle, and high school students was one of the largest nationwide, ultimately leading to the March on Washington for Jobs and Freedom in August in 1963. ==References== Category:1963 in the United States Category:American civil rights Category:Birmingham, Alabama Category:1960s in Alabama Category:1960s protests Category:Martin Luther King Jr.",
 "title": "Birmingham Children's Crusade"
}