{
 "id": "533671",
 "text": "The United States Immigration and Naturalization Service (INS) was an agency of the Department of Justice from 1933 to 2003. The agency ceased to exist under that name on March 1, 2003. This is when most of its responsibilities were transferred to three new agencies. These were the U.S. Citizenship and Immigration Services (USCIS), U.S. Immigration and Customs Enforcement (ICE), and U.S. Customs and Border Protection (CBP). All were within the newly created Department of Homeland Security, as part of a major government reorganization following the September 11 attacks of 2001. == History == In 1890, the federal government, rather than the individual states, regulated immigration into the United States.Ellis Island, National Park Service, United States Department of the Interior The Immigration Act of 1891 established a Commissioner of Immigration in the Treasury Department. Immigration was transferred to the United States Department of Commerce and Labor after 1903 and the Department of Labor after 1913.Darrell Hevenor Smith and H. Guy Herring, The Bureau of Immigration: Its History, Activities, and Organization (Baltimore, Md.: Johns Hopkins University Press, 1924). In 1940, with increasing concern about national security, immigration and naturalization was organized under the authority of the Department of Justice.Sharon D. Masanz, History of the Immigration and Naturalization Service: A Congressional Research Service Report (Washington, D.C.: GPO, 1980) In 2003 the administration of immigration services became the responsibility of the Bureau of Citizenship and Immigration Services (BCIS), which existed only for a short time before changing to its current name, the United States Citizenship and Immigration Services (USCIS). == References == Category:United States government agencies Category:United States Department of Justice Category:1933 establishments in the United States Category:2003 disestablishments in the United States",
 "title": "Immigration and Naturalization Service"
}