{
 "id": "533815",
 "text": "The following is a list of notable deaths in March 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==March== ===1=== *Stuart Beck, 69, American diplomat, Ambassador to the United Nations for Palau (20032013), kidney cancer.Stuart J. Beck, American Champion of a Pacific Island Nation, Dies at 69 *Jean Miotte, 90, French abstract painter.Jean MIOTTE *Martha Wright, 92, American actress (South Pacific, The Sound of Music) and singer.Martha Wright, Who Played Leading Roles in Beloved Musicals, Dies at 92 ===2=== *Janusz Bolonek, 77, Polish Roman Catholic prelate and diplomat, Apostolic nuncio (1989–2013), cancer.Nie żyje arcybiskup Janusz Bolonek *Prince Johann Georg of Hohenzollern, 83, German royal and art historian.Prinsessan Birgittas make Prins Johann Georg av Hohenzollern har avlidit *Marion Patrick Jones, 85, Trinidadian writer, heart failure. *Benoît Lacroix, 100, Canadian Dominican priest and historian, complications from pneumonia.Le père Benoît Lacroix est mort *Aubrey McClendon, 56, American energy and basketball executive, CEO of Chesapeake Energy, part-owner of the Oklahoma City Thunder, traffic collision.Former Chesapeake CEO Aubrey McClendon has died in a car crash a day after being indicted for conspiracy *Paul Webley, 62, British educator, president of SOAS, University of London (20062015), cancer.Former Soas director Paul Webley dies ===3=== *Berta Cáceres, 42, Honduran indigenous leader, shot.Berta Cáceres, Indigenous Activist, Is Killed in Honduras *Martin Crowe, 53, New Zealand cricketer (national team, Wellington Firebirds, Central Districts Stags), complications from lymphoma.Martin Crowe dies in Auckland after battle with cancer *Sophie Dessus, 60, French politician, member of the National Assembly for Corrèze's 1st Constituency (since 2012), cancer.Mort de Sophie Dessus, députée de Corrèze *Ashok Ghosh, 94, Indian politician, General Secretary of All India Forward Bloc (since 1946), multiple organ failure.Veteran Forward Bloc leader Ashok Ghosh dies *Hayabusa, 47, Japanese professional wrestler (Frontier Martial-Arts Wrestling), brain hemorrhage.FMW star Hayabusa passed away at 47 *Thanat Khoman, 102, Thai politician, Foreign Minister (1959–1971), respiratory failure.Thailand's Asean co-founder Thanat Khoman dies aged 101 *Natalia Krachkovskaya, 77, Russian actress (Ivan Vasilievich: Back to the Future), heart attack.Natalya Krachkovskaya dies in Moscow ===4=== *Bud Collins, 86, American sports journalist.Bud Collins, famed tennis historian and journalist, dies at 86 *Pat Conroy, 70, American author (The Prince of Tides, The Great Santini), pancreatic cancer.Pat Conroy dies after short battle with pancreatic cancer *Thomas G. Morris, 96, American politician, member of the U.S. House of Representatives for New Mexico's at-large district (1959–1969); New Mexico House of Representatives (1953–1958).Thomas G Morris (1919–2016) Obituary *Morgan F. Murphy, 83, American politician, member of the U.S. House of Representatives from Illinois's 3rd congressional district (1971–1981), prostate cancer.Morgan Murphy Jr., former congressman, dies at 83 *P. A. Sangma, 68, Indian politician, Speaker of the Lok Sabha (1996–1998), heart attack. *Abbas Vaez-Tabasi, 80, Iranian cleric, Grand Imam of Ali al-Ridha mosque (since 1979), respiratory failure.Iranian Cleric Ayatollah Vaez Tabasi Passes Away ===5=== *Hassan al-Turabi, 84, Sudanese Islamic spiritual leader, Secretary of the Popular Congress Party (1999-2016), figure in 1989 Sudanese coup d'état. *James Douglas, 86, American actor (As the World Turns, Another World, One Life to Live).James Douglas *Nikolaus Harnoncourt, 86, Austrian conductor.Austrian conductor Nikolaus Harnoncourt dies aged 86 *Lester Menke, 97, American politician, member of the Iowa House of Representatives (19731985), dementia.Lester D. Menke: 1918 - 2016 | Obituary *Ray Tomlinson, 74, American Hall of Fame computer programmer, invented email and chose @ symbol for usage, heart attack.Email inventor Ray Tomlinson Dies at 74 *Al Wistert, 95, American football player (Philadelphia Eagles, Michigan Wolverines), NFL Champion (1948, 1949).Michigan Football Legend Albert Wistert Dies at 95 ===6=== *Elizabeth Garrett, 52, American educator, president of Cornell University (20152016), colon cancer. *Znaur Gassiev, 90, South Ossetian politician, Head of State (1991-1992).Скончался патриарх югоосетинской политики Знаур Гассиев (death announced on this date) *Kalabhavan Mani, 45, Indian actor (Vasanthiyum Lakshmiyum Pinne Njaanum) and singer, liver disease.Malayalam actor Kalabhavan Mani passes away *Nancy Reagan, 94, American actress (The Next Voice You Hear..., Hellcats of the Navy, Donovan's Brain), social activist (Just Say No), and First Lady (1981–1989), congestive heart failure.Nancy Reagan, a Stylish and Influential First Lady, Dies at 94 *Paul Ryan, 66, American comic artist (Fantastic Four, Superman, Iron Man), cancer.Paul Ryan, Artist For The Fantastic Four And The Phantom, Has Died Aged 66 *Sheila Varian, 79, American horse breeder (Arabian horses), cancer. ===7=== *Adrian Hardiman, 65, Irish judge, member of the Supreme Court (since 2000), heart attack.Supreme Court judge Adrian Hardiman has died - Newstalk *Jean-Bernard Raimond, 90, French politician, Minister of Foreign Affairs (1986–1988).Décès de l'ancien ministre des Affaires étrangères Jean-Bernard Raimond *Michael White, 80, Scottish movie and theatre producer (Monty Python and the Holy Grail, The Rocky Horror Picture Show), Tony Award-winner (1971, 1973), heart failure.Veteran British producer Michael White Dies At 80 ===8=== *Richard Davalos, 85, American actor (Cool Hand Luke, East of Eden, Kelly's Heroes).Richard Davalos, 'East of Eden' and 'Cool Hand Luke' Actor, Dies at 85 *Aldo Ferrer, 88, Argentine economist, Minister of the Economy (1970-1971). *David S. Johnson, 70, American computer scientist. *George Martin, 90, British record producer (The Beatles), composer, arranger and engineer.George Martin, Producer and Arranger for The Beatles, Dies at 90 *Alfred E. Senn, 83, American historian and academic, awarded Order of Vytautas the Great for service to Lithuania.Senn, Professor Emeritus Alfred Erich ===9=== *Sergio Arellano Stark, 94, Chilean military officer, leader of the Caravan of Death, complications from Alzheimer's disease. *Jon English, 66, Australian musician and actor (Against the Wind), complications from surgery.Jon English, Australian singer-songwriter and All Together Now star, dies age 66 *Ray Griff, 75, Canadian country music singer (\"If I Let Her Come In\") and songwriter (\"Canadian Pacific\"), pneumonia.Legendary Calgary ‘country gentleman’ Ray Griff dies at the age of 75 *Robert Horton, 91, American actor (Wagon Train).Western Clippings *Naná Vasconcelos, 71, Brazilian jazz percussionist and vocalist, eight-time Grammy Award winner, lung cancer.Lenda da percussão brasileira, Naná Vasconcelos morre aos 71 anos *Bill Wade, 85, American football player (Los Angeles Rams, Chicago Bears), NFL Champion (1963).Vanderbilt, NFL great Bill Wade dies ===10=== *Sir Ken Adam, 95, British production designer (Dr. Strangelove, James Bond, The Madness of King George), Oscar winner (1975, 1994).Sir Ken Adam, James Bond production designer, dies aged 95 *Ernestine Anderson, 87, American jazz and blues singer.Jazz great Ernestine Anderson dies *Anita Brookner, 87, British novelist (Hotel du Lac) and art historian, Man Booker Prize winner (1984).Anita Brookner, Booker Prize-winning author, dies age 87, Times announces *Keith Emerson, 71, English progressive rock and rock keyboardist (The Nice, Emerson, Lake & Palmer), suicide by gunshot.Keith Emerson of Emerson, Lake & Palmer Dead at 71 of Suicide *Claude Estier, 90, French politician and journalist, member of the National Assembly for Paris (19671968, 19811986), MEP for France (19791981).L’ancien sénateur Claude Estier est mort à 90 ans *Bill Gadsby, 88, Canadian Hall of Fame ice hockey player (Detroit Red Wings, Chicago Blackhawks, New York Rangers).Wings Hall of Famer Bill Gadsby dies at 88 *Gogi Grant, 91, American pop singer (\"The Wayward Wind\").Gogi Grant, The Queen of “The Wayward Wind,” Has Passed Away *Roberto Perfumo, 73, Argentine footballer (Racing Club, Cruzeiro, national team), fall.Roberto Perfumo passes away *Jovito Salonga, 95, Filipino politician, Senate President (1987–1992), cardiac arrest. ===11=== *Iolanda Balaș, 79, Romanian high jumper, Olympic champion (1960, 1964), director of the FRA (19882005), complications from a gastric disorder.Romanian High Jumper Iolanda Balas Dies at 79 *Rómulo Macció, 84, Argentine painter.Falleció el pintor Rómulo Macció, referente del movimiento Neo Figuración *Doreen Massey, 72, British geographer, pancreatic cancer.Tributes after the death of geographer and acclaimed social scientist Professor Doreen Massey *Louis Meyers, 60, American festival organizer, co-founder of South by Southwest, director of Folk Alliance International, suspected heart attack.SXSW Cofounder Louis Meyers Has Died, According to ‘Austin Statesman’ *Dragan Nikolić, 72, Serbian actor (Kad budem mrtav i beo), cancer.Legendary Serbian actor Dragan Nikolic dies *Lawrence Van Gelder, 83, American newspaper journalist (The New York Times), cancer.Lawrence Van Gelder, Critic and Editor at The Times, Dies at 83 ===12=== *Rafiq Azad, 74, Bangladeshi poet, stroke.Poet Rafiq Azad dies at the age of 74 *Erik Duval, 50, Belgian computer scientist, lymphoma.In memoriam Prof. dr. ir. Erik Duval *Lloyd Shapley, 92, American mathematician and economist, Nobel Prize in Economics (2012), complications of a broken hip.Lloyd Shapley, a Nobel laureate in economics, has died ===13=== *Adrienne Corri, 84, British actress (A Clockwork Orange), coronary artery disease.Obituaries: Adrienne Corri *Hilary Putnam, 89, American philosopher, mathematician and computer scientist, mesothelioma.Hilary Putnam Ph.D. Obiuary *Martin Olav Sabo, 78, American politician, U.S. Representative from Minnesota (1979–2007), respiratory failure.Former Minnesota congressman Martin Sabo dies at 78 *József Verebes, 74, Hungarian football player (Ferencvárosi TC) and coach (Győri ETO FC, MTK Budapest FC, national team), complications from a stroke.Gyász: nincs többé mágia, elhunyt Verebes József ===14=== *John W. Cahn, 88, American metallurgist, awarded National Medal of Science (1998), namesake of Cahn–Hilliard equation, leukemia.John W. Cahn, Who Fled Nazi Germany and Became a Foremost Materials Scientist, Dies ar 88 *Sir Peter Maxwell Davies, 81, English composer and conductor, Master of the Queen's Music (2004–2014), leukemia.British composer Sir Peter Maxwell Davies dies aged 81 *Riccardo Garrone, 89, Italian actor (La Dolce Vita, The Yellow Rolls-Royce, Swordsman of Siena), heart failure.Morto Riccardo Garrone, il San Pietro della pubblicità *Suranimala Rajapaksha, 67, Sri Lankan politician and minister, MP (19942004), renal failure. *Davy Walsh, 92, Irish footballer (Limerick F.C., Aston Villa F.C., national team), pneumonia. (death announced on this date) ===15=== *Asa Briggs, Baron Briggs, 94, British historian, codebreaker and life peer.Asa Briggs, Lord Briggs of Lewes, passes: 07 May 1921 – 15 March 2016 *Tamara Grigsby, 41, American politician, member of the Wisconsin State Assembly (20042012), cancer.Former state Rep. Tamara Grigsby, aide to Joe Parisi, dead at 41 (death announced on this date) *Ralph C. Johnson, 62, American politician, member of the North Carolina House of Representatives (since 2015), complications from a stroke.Guilford County state Rep. Ralph Johnson dies *Earline W. Parmon, 72, American politician, member of the North Carolina House of Representatives (20022012) and Senate (20122015).Former Sen. Parmon dies after brief illness *Seru Rabeni, 37, Fijian rugby union player (national team), heart attack.Seru Rabeni passes away *Lyubka Rondova, 79, Bulgarian folk singer.Почина народната певица Любка Рондова ===16=== *Sylvia Anderson, 88, British television producer and voice actress (Thunderbirds).Sylvia Anderson, voice of Thunderbirds' Lady Penelope, dies (death announced on this date) *Alexander Esenin-Volpin, 91, American poet and mathematician.Aleksandr Yesenin-Volpin, Prominent Soviet-Era Dissident, Dies Aged 91 *Cliff Michelmore, 96, British television presenter (BBC) and producer.Cliff Michelmore: BBC radio and TV broadcaster dies aged 96 *Frank Sinatra, Jr., 72, American singer (\"That Face!\") and actor (The Dean Martin Show, Hollywood Homicide, Family Guy), cardiac arrest.Frank Sinatra Jr. dies in Daytona Beach ===17=== *Shozo Awazu, 92, Japanese judoka.Judo Maître Shozo Awazu nous a quittés *Meir Dagan, 71, Israeli military officer and intelligence official, Director of the Mossad (2002–2011), liver cancer.Former Mossad chief Meir Dagan dies at 71 *Paul Daniels, 77, British magician (The Paul Daniels Magic Show), brain tumour.Magician Paul Daniels dies aged 77 *Larry Drake, 66, American actor (L.A. Law, Johnny Bravo, Darkman), Emmy winner (1988, 1989), heart attack.L.A. Law Star Larry Drake Dead at 66 *Zoltán Kamondi, 55, Hungarian movie director (Paths of Death and Angels).Meghalt Kamondi Zoltán *Marian Kociniak, 80, Polish actor (How I Unleashed World War II), heart attack.Marian Kociniak nie żyje. Aktor miał 80 lat *Solomon Marcus, 91, Romanian mathematician, heart failure. ===18=== *Miguel Hernández Agosto, 88, Puerto Rican politician, President of the Senate (1981-1992).Fallece ex presidente del Senado, Miguel Hernández Agosto *Jan Němec, 79, Czech movie director (A Report on the Party and the Guests) and screenwriter, heart attack.Zemřel režisér Jan Němec, nebroušený diamant české nové vlny *Joe Santos, 84, American actor (The Rockford Files, The Friends of Eddie Coyle, The Last Boy Scout), heart attack.The Rockford Files Actor Joe Santos Dies at 84 *Lothar Späth, 78, German politician, Minister President of Baden-Württemberg (19781991), Alzheimer's disease.Lothar Späth ist tot *Les Tanyuk, 77, Ukrainian theatre and movie director and politician, MP (1990–2012).Died outstanding director and politician Les Tanyuk *Tray Walker, 23, American football player (Baltimore Ravens), dirt bike accident.Ravens' Tray Walker dies from injuries in dirt bike crash *Guido Westerwelle, 54, German politician, Foreign Minister (20092013) and Vice-Chancellor (20092011), leukemia. ===19=== *Roger Agnelli, 56, Brazilian businessman, CEO of Vale S.A. (2001–2011), plane crash.Brazil's Agnelli, who turned Vale into top miner, dies in crash *José Artetxe, 85, Spanish footballer (Athletic Bilbao, national team), complications from Alzheimer's disease.Fallece el exjugador del Athletic José Luis Artetxe *Léonie Geisendorf, 101, Swedish architect.Arkitekten Léonie Geisendorf död *Jack Mansell, 88, British football player (England B, Brighton, Portsmouth) and coach (Israel, Reading, Rotherham United).Jack Mansell 1927 – 2016 ===20=== *Robert J. Healey, 58, American politician, political activist and attorney, suspected heart attack. (body found on this date) *Anker Jørgensen, 93, Danish politician, Prime Minister (1972–1973, 1975–1982).Anker Joergensen, Danish Premier During Oil Crises, Dies at 93 ===21=== *Peter Brown, 80, American actor (Lawman, Laredo, Foxy Brown), complications from Parkinson's disease.“Summer Magic” Star Peter Brown Passes Away at 80 *Andrew Grove, 79, American business executive, CEO and Chairman of Intel Corporation, complications from Parkinson's disease.Andrew S. Grove 1936 – 2016 *Joseph Mercieca, 87, Maltese Roman Catholic prelate, Archbishop of Malta (1976–2006).Archbishop Guzeppi Mercieca passes away *Carolyn Squires, 75, American politician, member of the Montana Senate (2002–2010) and House of Representatives (since 2010), colorectal cancer. ===22=== *Richard Bradford, 82, American actor (Man in a Suitcase, The Untouchables, Cagney & Lacey).Richard Bradford obituary *Leon Charney, 77, American real estate tycoon and talk show host.Leon Charney, Jewish TV show host and property tycoon, dies (death announced on this date) *Glen Dawson, 103, American rock climber and mountaineer.Legendary American Climber Glen Dawson Lives to 103 *Phife Dawg, 45, American rap musician (A Tribe Called Quest), complications from diabetes. *Santiago J. Erevia, 70, American soldier (Vietnam War), Medal of Honor recipient.Medal of Honor recipient Erevia dies in San Antonio *Rob Ford, 46, Canadian politician, Mayor of Toronto (2010–2014), liposarcoma.Rob Ford, former Toronto mayor, dies at 46 *Rita Gam, 88, American actress (The Thief, King of Kings, No Exit) and filmmaker, respiratory failure.Rita Gam, Glamorous Actress in 1950s Films, Dies at 88 ===23=== *Joe Garagiola, Sr., 90, American baseball player (St. Louis Cardinals, Chicago Cubs, Pittsburgh Pirates) and sportscaster (MLB GOTW), World Series Champion (1946).Baseball legend, former Arizona Diamondbacks broadcaster Joe Garagiola, Sr. dies *Ken Howard, 71, American actor (1776, The White Shadow) and union executive, president of the SAG/SAG-AFTRA (20092016), Emmy Award winner (2009), Tony Award winner (1970). *Jimmy Riley, 61, Jamaican reggae musician (The Uniques), cancer. ===24=== *Maggie Blye, 73, American actress (The Italian Job), cancer.Actress Margaret Blye, star of the original 'The Italian Job,' dies at 73 *Roger Cicero, 45, German jazz and pop musician, stroke.Hirnschlag mit 45 Jahren: Roger Cicero ist tot *Johan Cruyff, 68, Dutch football player and manager (AFC Ajax, FC Barcelona, national team), lung cancer.Johan Cruyff 1947-2016 *Earl Hamner, Jr., 92, American television writer and producer (Falcon Crest, The Waltons, The Twilight Zone), cancer.Earl Hamner Passes Away at 92 *Esther Herlitz, 94, Israeli diplomat and politician.Member of Knesset Esther Herlitz *Marie-Claire Kirkland, 91, Canadian politician and judge, first woman elected to the Legislative Assembly of Quebec.Claire Kirkland-Casgrain, Quebec feminist pioneer, dead at 91 *Tibor R. Machan, 77, Hungarian-born American philosopher and journalist.Obituary of Tibor R. Machan *Garry Shandling, 66, American comedian, actor (The Larry Sanders Show, It's Garry Shandling's Show, Captain America: The Winter Soldier) and Emmy Award-winning television writer (Sanford and Son, Welcome Back, Kotter), heart attack.Garry Shandling Dies at 66 *Leonard L. Northrup Jr., 98, American engineer.Mr Leonard \"Len\" Nothrup ===25=== *Abu Ala al-Afri, 57/58, Iraqi militant, leading member of the Islamic State of Iraq and the Levant, bombing.U.S. Attack Kills a Top ISIS Leader in Syria, Pentagon Says *Clodomir Santos de Morais, 87, Brazilian sociologist, heart failure.MST lamenta e morte de Clodomir Santos de Moraes *Paolo Poli, 86, Italian theater actor (Gulliver's Travels).Morto a Roma Paolo Poli, artista brillante e delicato *Imre Pozsgay, 82, Hungarian Communist politician, Minister of Education (1980-1982).В Венгрии скончался один из реформаторов-коммунистов Имре Пожгаи *David Snellgrove, 95, British Tibetologist. *Adam Żurowski, 86, Polish geodesist.Zmarł Kolega Adam Żurowski ===26=== *David Baker, 84, American jazz musician.David Baker, jazz teacher and musician, dies at 84 *Norm Hadley, 51, Canadian rugby union player (London Wasps).Former Canadian rugby standout Norman Hadley dies at age 51⋅ *Jim Harrison, 78, American author and screenwriter (Legends of the Fall, Wolf), heart attack.'Legends of the Fall' Author Jim Harrison Dead at 78 *Igor Pashkevich, 44, Soviet-born Russian Olympic figure skater (1994, 1998), World Juniors champion (1990).В Майами трагически погиб тренер Игорь Пашкевич ===27=== *Mother Angelica, 92, American Franciscan nun, founder of the Eternal Word Television Network, complications from a stroke. *Vince Boryla, 89, American basketball player and coach (New York Knicks), and general manager (Denver Nuggets), Olympic champion (1948), complications from pneumonia.Former NBA player, coach and GM Vince Boryla dies *Alain Decaux, 90, French historian, member of the Académie française.L’écrivain et académicien Alain Ducaux est mort *Antoine Demoitié, 25, Belgian cyclist, race collision. *Anatoly Savin, 95, Soviet-born Russian weapons designer, Hero of Socialist Labour.Умер научный руководитель концерна ВКО «Алмаз-Антей» Анатолий Савин ===28=== *Daan Myngheer, 22, Belgian professional cyclist, heart attack.Daan Myngheer dies from heart attack *James Noble, 94, American actor (Benson, 10, Archie: To Riverdale and Back Again), complications from a stroke.James Noble, Absent-Minded Governor on ‘Benson,’ Dies at 94 ===29=== *Jean-Pierre Coffe, 78, French television presenter and food critic.Jean-Pierre Coffe est mort à l'âge de 78 ans *Patty Duke, 69, American actress (The Miracle Worker, The Patty Duke Show, Valley of the Dolls), President of SAG (19851988), Oscar winner (1963), sepsis.KNTV Former Child Star Patty Duke Dies at 69 ===30=== *Anne Aasheim, 53, Norwegian newspaper editor (Dagbladet), lung cancer.Anne Aasheim er død *Howard Cable, 95, Canadian conductor, composer and arranger, complications from pneumonia.Howard Cable, composer, conductor, arranger, dies at 95 *Shirley Hufstedler, 90, American lawyer and judge, Secretary of Education (1979–1981), cerebrovascular disease.Shirley Hufstedler, First U.S. Education Secretary, Dies at 90 *Bernard Lamarre, 84, Canadian soil mechanics engineer and businessman, CEO of Lavalin (1962–1991).Bernard Lamarre, un grand du génie québécois, s'éteint *Bill Rosendahl, 70, American politician, member of the Los Angeles City Council (2005–2013), ureteral cancer. *Gianmaria Testa, 57, Italian singer-songwriter.Morto Gianmaria Testa, lo chansonnier piemontese ===31=== *Béla Biszku, 94, Hungarian politician, Minister of the Interior (1957–1961).Meghalt Biszku Béla *Ronnie Corbett, 85, British comedian (The Two Ronnies, The Frost Report) and actor (Casino Royale), motor neurone disease.Entertainer Ronnie Corbett dies, aged 85 *Georges Cottier, 93, Swiss Roman Catholic cardinal.Santa Sede: è morto il cardinale Georges Marie Martin Cottier, teologo emerito della Casa Pontificia *Hans-Dietrich Genscher, 89, German politician, Minister of the Interior (1969–1974), Minister for Foreign Affairs (1974–1982; 1982–1992) and Vice Chancellor (1974–1982; 1982–1992), heart failure.Germany's longest-serving foreign minister, Hans-Dietrich Genscher, dies at 89 *Dame Zaha Hadid, 65, Iraqi-born British architect, heart attack.\"Architect Dame Zaha Hadid dies at 65\" *Imre Kertész, 86, Hungarian writer, laureate of the Nobel Prize in Literature (2002), complications from Parkinson's disease.Nobel Prize-winning author Imre Kertesz dies at 86 *Denise Robertson, 83, British writer and television broadcaster (This Morning), pancreatic cancer.This Morning agony aunt Denise Robertson dies following cancer battle *Khuzaima Qutbuddin, 75, Indian Islamic leader, cancer. *Douglas Wilmer, 96, English actor (Sherlock Holmes, Octopussy, Jason and the Argonauts).Douglas Wilmer Dies: Stage & Screen Actor Long Associated With Sherlock Holmes Was 96 ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *03 Category:March 2016 events",
 "title": "Deaths in March 2016"
}