{
 "id": "533849",
 "text": "Tulsi Gabbard (; born April 12, 1981) is an American politician and military officer serving as the 8th director of national intelligence since 2025. Before becoming DNI, she was the U.S. representative for Hawaii's 2nd congressional district from 2013 to 2021. A former Democrat, she became a Republican in 2024. Gabbard worked with Hawaii Army National Guard for 17 years, from 2003 to 2020, before transferring to U.S. Army Reserve. While in US Congress, she was a member of the Democratic Party. After leaving Congress, she left the party to become an Independent. She was the first American Samoan and the first Hindu member of the United States Congress. She was also one of its first female combat veterans to serve in US Congress. In 2003, she was deployed in Iraq from 2004 to 2005, where she served in a medical unit. In 2007, Gabbard completed the Officer training program at the Alabama Military Academy as a distinguished honor graduate. She was stationed in Kuwait from 2008 to 2009 as an Army Military Police platoon leader. In 2015, she became a Major with the National Guard.US Rep. Tulsi Gabbard promoted to Army major West Hawaii Today; October 13, 2015 In 2020, she transferred to U.S. Army Reserve and was promoted to the rank of lieutenant colonel in 2021. In January 2019, Gabbard announced her plans to run for president in the 2020 presidential election. On October 25, 2019, Gabbard announced that she would not seek another term in Congress. She dropped out from the primaries on March 19, 2020 and announced her support for Joe Biden. After leaving the U.S. House in 2021, she became more conservative on social issues such as abortion and transgender rights and even spoke at the 2022 CPAC. Gabbard joined the Republican Party in October 2024. A month later, President-elect Donald Trump nominated Gabbard to serve as the Director of National Intelligence during his second administration. She was confirmed by the U.S. Senate in February 2025. ==Early life== Gabbard was born on April 12, 1981, in Leloaloa, American Samoa, the fourth of five children. Her father, Mike Gabbard, is of American Samoan descent. She graduated from Hawaii Pacific University with a Bachelor of Science degree in Business Administration in 2009. ==Hawaii House of Representatives (2002–2004)== In 2002, Gabbard ran to represent the 42nd House District of the Hawaii House of Representatives. She won the four-candidate Democratic primary with a plurality of 48% of the vote over Rida Cabanilla (30%), Dolfo Ramos (18%), and Gerald Vidal (4%). Gabbard then defeated Republican Alfonso Jimenez in the general election, 65%–35%. In 2002, at the age of 21, Gabbard had become the youngest legislator ever elected in Hawaii's history and the youngest woman ever elected to a U.S. state legislature. She represented the Oahu 42nd District, which covers Waipahu, Honolulu, and Ewa Beach. Gabbard strongly supported legislation to promote clean energy. Regarding the environment, Gabbard supported legislation to better protect air quality and the water supply. ==Honolulu City Council (2011–2012)== After returning home from her second deployment to the Middle East in 2009, Gabbard ran for a seat on the Honolulu City Council. Gabbard finished first with 33% of the vote in the primary. In the November 2 runoff election, she defeated Sesnita Moepono, 58%–42%, to win the seat. Gabbard introduced a measure to help food truck vendors by loosening parking restrictions. She also introduced Bill 54, a measure that authorized city workers to confiscate personal belongings stored on public property with 24 hours' notice to its owner. ==United States House of Representatives (2013–2021)== In early 2011, Mazie Hirono, the incumbent Congresswoman in Hawaii's second congressional district, announced that she would run for a U.S. Senate seat. Soon after that, in May 2011, Gabbard announced her candidacy for the House seat. Gabbard won with 62,882 votes or 55% of the total. The Honolulu Star-Advertiser described her win as an \"improbable rise from a distant underdog to victory.\" Gabbard resigned from the City Council on August 16 to prevent the cost of holding a special election. Gabbard traveled to Charlotte, North Carolina and spoke at the 2012 Democratic National Convention. In December 2012, Gabbard was highly thought to be the frontrunner replaced for the U.S. Senator from Hawaii after Daniel Inouye died. Gabbard was reelected on November 8, 2016, defeating her Republican opponent, Angela Kaaihue, by about 130,000 votes, or 170,848 to 39,668 votes (81.2%–18.8%). Gabbard was overwhelmingly reelected in 2018. She defeated her Republican opponent, Brian Evans, by around 110,000 votes, or 153,271 to 44,850 votes (77.4%–22.6%). Gabbard is the first Samoan American member of the United States Congress and the first Hindu member of the United States Congress. In October 2019, Gabbard announced her retirement from congress. ==Democratic National Committee== Gabbard, a vice-chair of the Democratic National Committee, was critical of the decision by DNC chairwoman Debbie Wasserman Schultz to hold only six debates during the 2016 Democratic Party primary season, compared with 26 in 2008 and 15 in 2004. Gabbard resigned as DNC vice-chair on February 28, 2016, in order to endorse Senator Bernie Sanders for the Democratic presidential nomination. She was the first female U.S. Representative to endorse Sanders. At the 2016 Democratic National Convention, Gabbard gave the nominating speech putting his name forward. ==2020 presidential campaign== On October 19, 2018, Politico announced that Gabbard was \"weighing a 2020 presidential bid\", and would wait until after the 2018 midterms for an official announcement. On January 11, 2019 interview with CNN, Gabbard confirmed her plans to seek the Democratic nomination and officially announced her candidacy the following week. After failing to qualify in recent debates or winning any primary contests, Gabbard left the race on March 19, 2020 and supported Joe Biden. ==Post-congressional career== Since leaving the House of Representatives on January 3, 2021, Gabbard has become more conservative about issues such as abortion, foreign policy, transgender rights, and border security.Multiple sources: * * * * * She has appeared on Fox News, including serving as a fill-in host for Tucker Carlson Tonight. In October 2022, Gabbard announced that she had left the Democratic Party altogether. Gabbard campaigned for several Republican candidates in the 2022 midterm elections. She later endorsed former President Donald Trump for the 2024 United States presidential election. Gabbard joined the Republican Party in October 2024 while campaigning for Trump in North Carolina. ==Director of National Intelligence (2025–present)== In November 2024, President-elect Donald Trump announced his plans to nominate Gabbard as the Director of National Intelligence for his second administration. Gabbard testified before the Senate Select Committee on Intelligence on January 30, 2025. She promised to separate her political views from her official duties. On February 4, 2025, the Senate Intelligence Committee advanced her nomination in a 9-8 party-line vote. The Senate confirmed her nomination on February 12, in a 52-48 vote, with only Senator Mitch McConnell among Republicans voting no. Gabbard was sworn in as the 8th director of national intelligence on February 12, 2025, by Attorney General Pam Bondi, becoming the first Pacific Islander American and first Hindu American to hold a Cabinet-level position. ==Personal life== In 2002, Gabbard was a martial arts instructor. In 2002, Gabbard married Eduardo Tamayo. The couple divorced in 2006. In February 2015, Gabbard got engaged to Abraham Williams, and the two married on April 9, 2015. While on Meghan McCain's podcast in 2024, Gabbard mentioned that she and Williams had tried to start a family and had undergone several in-vitro fertilization (IVF) procedures, without success. ==References== ==Other websites== * Congresswoman Tulsi Gabbard official U.S. House website * Tulsi Gabbard for Congress * Healthy Hawai'i Coalition (HHC) * * * Tulsi Gabbard Video produced by Makers: Women Who Make America * Tulsi Gabbard Marriage Tulsi Gabbard's marriage in Vedic tradition Category:1981 births Category:Living people Category:2020 United States presidential candidates Category:State legislators of the United States Category:Military people from Hawaii Category:American Samoan politicians Category:Hindus Category:Iraq War Category:Majors in the United States Army Category:United States representatives from Hawaii Category:Republican Party (United States) politicians Category:United States Directors of National Intelligence",
 "title": "Tulsi Gabbard"
}