{
 "id": "534199",
 "text": "John Singer Sargent (January 12, 1856 – April 14, 1925) was an American artist. He was the leading portrait painter of his day.\"Sargent came into his own in the 1890s as the leading portrait painter of his generation\". Ormond, Richard 1998. \"Sargent's Art\" in John Singer Sargent. Tate Gallery, p. 34.\"At the time of the Wertheimer commission Sargent was the most celebrated, sought- after and expensive portrait painter in the world\". New Orleans Museum of Art During his career, he created about 900 oil paintings and more than 2,000 watercolors, as well as many sketches and charcoal drawings. He travelled worldwide. His parents were American, but he was trained in Paris, and then moved to London. His \"Portrait of Madame X\" resulted in scandal, though today it is hard to see why. She was thought to be somewhat loose sexually. In the original portrait as exhibited, one strap of her gown had fallen down her right shoulder. This suggested to some the possibility of further revelation; \"One more struggle\", wrote a critic in Le Figaro, \"and the lady will be free\". Sargent visited Spain, studied Diego Velázquez, and was entranced with Spanish music and dance. He understood what the Impressionists were doing, and adopted their habit of painting en plein-air. He was a big fan of Monet, and bought four of his works. His portrait of Monet shows he understood what was going on in French art at the time. Sergent kept his American citizenship, and went back there four times. However, he remained living in London to the end of his life. ==Gallery== Study of Mme Gautreau by John Singer Sargent c1884.jpg|Madame X (Virginie Gautreau) A study done while Sargent was thinking about the strap Sargent - Rosina.jpg|His favourite model: Rosina Ferrara. She was described by another artist as \"the tawney skinned, panther eyed, elf-like Rosina, wildest and lithest of all the savage creatures on the savage isle of Capri\". Sargent painted her ten times in 1878.Adelson, Warren; Davis, Deborah; Kilmurray,Elaine; Ormond, Richard 2003. Sargent's Women. New York: Adelson Galleries. Nancy Viscountess Astor by John Singer Sargent.jpeg|Nancy Viscountess Astor, 1884 Sargent MonetPainting.jpg|Claude Monet Painting at the Edge of a Wood, by Sargent, 1885 == References == Category:American painters Category:1856 births Category:1925 deaths Category:People from Florence Category:Royal Academicians",
 "title": "John Singer Sargent"
}