{
 "id": "534416",
 "text": "Asta Sofie Amalie Nielsen (11 September 1881 – 24 May 1972) was a Danish silent movie actress. She was very popular in the 1910s. She was one of the first international movie stars. Nielsen was in 74 movies. 70 were in Germany where she was known simply as Die Asta (The Asta). She had large dark eyes, a face like a mask and a figure like a boy. Nielsen most often played strong and passionate women trapped by tragic lives. Her performances were erotic so Nielsen's movies were heavily censored in the United States. Therefore, she was not very famous there. Nielsen started her own movie studio in Berlin in the 1920s. She went back to Denmark in 1937 after Nazism became a problem. Later in life, Nielsen became a collage artist and an author. == Movies == Year Film Role Notes 1910 The Abyss Magda Vang 1911 Gipsy Blood Jonna Lost film The Moth Olga / Mademoiselle Yvonne Lost film Stella Annie Camille Flavier Miss May The Traitress Yvonne Fragments preserved 1912 Creszenz Fitzinger Lost film Paula Müller Lost film Poor Jenny Jenny The Dance of Death Bella Fragments preserved Thekla Lost film Sanna Fragments preserved Zidra Fragments preserved Jugend und Tollheit Jesta Müller Lost film 1913 Kamma Dieser Lost film Hanna Meyer Juanita Lost film Nelly Panburne Fragments preserved Gertrud von Hessendorf The Film Primadonna Ruth Breton Fragments preserved 1914 Little Angel Jesta Schneider Elena Lost film Zapata's Gang Wanda Petri Lost film 1915 Zirzi Lost film The False Asta Nielsen Bolette / Asta Nielsen Lost film 1916 Martha Lost film Jesta Schneider Lost film Frontstairs and Backstairs Sabine Schulze Dora Brandes Dora Brandes The ABC of Love Lis Cinderella Lotte Lost film Das Versuchskaninchen Jesta 1917 The White Roses Thilda Wardier Esther Lost film 1918 Margit Rose of the Wilderness Wanda Lost film The Eskimo Baby Ivigtut The Queen of the Stock Exchange Helene Netzler 1919 So Ends My Song Dora Intoxication Henriette Fragments preserved Towards the Light Countess Ysabel According to Law Sonja Waler 1920 The Merry- Go-Round Elena Helmsman Holk Isabella Bouflon Fragments preserved Kurfürstendamm Lissy / Marie Lost film 1921 Hamlet: The Drama of Vengeance Hamlet Roswolsky's Mistress Mary Verhag Wandering Souls Nastassja Baraschkowa 1922 Miss Julie Miss Julie Lost film Brigantenrache Anica, a Bandit's Bride Lost film Vanina Vanina Navarro the Dancer Carmencita Navarro Lost film 1923 Earth Spirit Lulu Downfall Kaja Falk Fragments preserved I.N.R.I. Maria Magdalene Fragments preserved 1924 The House by the Sea Teresa The Woman in Flames Josefine Lost film Athletes Princess Wanda Hoheneck Lost film Rosi Hergentheim Fragments preserved 1925 Hedda Gabler Hedda Gabler Lost film Living Buddhas Tibetan girl Fragments preserved Joyless Street Marie Lechner 1926 The Fallen Anna Grosser Lost film 1927 The Vice of Humanity Tamara Tragedy of the Street Auguste Agitated Women Clarina Lost film Small Town Sinners Selma Karchow Fragments preserved That Dangerous Age Elsie Lindtner 1932 Impossible Love Vera Holgk Category:1881 births Category:1972 deaths Category:Danish movie actors Category:Silent movie actors Category:Danish stage actors",
 "title": "Asta Nielsen"
}