{
 "id": "534572",
 "text": "The atmosphere of Mars is the layer of gases surrounding Mars. It is mainly made up of carbon dioxide. The average atmospheric pressure of the Martian surface (6.0 mbar) is much lower than that of the Earth (1,013 mbar). The pressure is well below the Armstrong limit, meaning that water boils at the normal temperature of the human body: 98.6 °F (36.6 °C). The Martian atmosphere contains 96% carbon dioxide, 1.9% argon, 1.9% nitrogen, and traces of oxygen, carbon monoxide, water and methane, and so on.Abundance and Isotopic Composition of Gases in the Martian Atmosphere from the Curiosity Rover. Sciencemag.org (2013-07-19). Retrieved 5 October 2013. Ever since the discovery of methane in 2003,Interplanetary Whodunit – Methane on Mars, David Tenenbaum, Astrobiology Magazine, NASA, July 20, 2005. (Note: part one of a four-part series.)Mumma, M. J.; Novak, R. E.; DiSanti, M. A.; Bonev, B. P., \"A Sensitive Search for Methane on Mars\" (abstract only). American Astronomical Society, DPS meeting #35, #14.18. scientists say that this might indicate life. It has also been suggested that is may be caused by geochemical processes, volcanic or hydrothermal activity. The atmosphere of Mars is quite dusty, giving the Martian sky a light brown or orange-red color when seen from the surface. Data from NASA pointed out that the dust particles are 1.5 micrometres diameter.Lemmon et al., \"Atmospheric Imaging Results from the Mars Exploration Rovers: Spirit and Opportunity\" On 18 March 2015, NASA found an aurora that is not fully understood and an unexplained dust cloud in the atmosphere of Mars. Liquid water on Mars was once commonplace, which means the atmosphere was thicker. Many studies have found that the atmosphere of Mars has been weakened over time due to solar winds. On Earth, the magnetic field protects us from most of the wind. Mars used to have a magnetic field, but cooling of the core has resulted in the magnetic field being lost. == References == Category:Mars Category:Atmosphere",
 "title": "Atmosphere of Mars"
}