{
 "id": "534651",
 "text": "Victory Day (also shortened as V-Day) is a common name of many different public holidays in various countries. In most cases it is to commemorate victories in important battles or wars in the countries' history. For example, in Russia, it is celebrated on May 9th for the defeat of Nazi Germany in what Russia calls \"The Great Patriotic War\" (World War II). For the United States and Britain, the victory in Europe (celebrated as Victory in Europe Day or V-E Day) was only part of the victory. It is celebrated on May 8th (May 7th in the United Kingdom). The war in the Pacific did not end for the US and Britain until the Japanese surrender on Sept. 2, 1945. This is celebrated as Victory over Japan Day or V-J Day. This part of the war is usually not studied by Russians. In France, their Victory Day also celebrated the end of World War II and is celebrated on May 8, 1945, when Charles de Gaulle announced the end of the war. == List of countries with a Victory Day == Country/Territory Date Details January 7 This national holiday was established to commemorate the end of the Khmer Rouge regime in 1979. March 27 Victory Day in Angola is on March 27. April 30 Reunification Day - April 30 is an annual holiday in Vietnam to commemorate the fall of Saigon in 1975 at the end of the Vietnam War. It is commonly known as Victory Day (Ngày Chiến thắng), Reunification Day (Ngày Thống nhất), or Liberation Day (Ngày Giải phóng). May 7 In Vietnam, May 7, 1954 marks the victory of Vietnam over French forces at the battle of Dien Bien Phu. This victory ended 80 years of French colonization and began the time of independence for Vietnam. May 8 Victory in Europe Day - Victory Day marks the end of World War II in Europe, specifically the capitulation of Nazi forces to the Allies (the Soviet Union, Canada, France, United Kingdom, United States and other principal Allied nations) on May 8, 1945. The British Channel Islands were not liberated from German Occupation until May 9 (Jersey and Guernsey), May 10 (Sark), and May 16 (Alderney). May 9 Victory Day (May 9) - In Russia, Kazakhstan, Belarus and other countries of the former Soviet Union, the day of Victory over Nazi Germany was celebrated on May 9. When the German Instrument of Surrender actually entered into force in the West (May 8, 1945 at 23:01 CET) a similar but entirely separate document had not been signed with the Soviet Union, and it was not signed until the following day. Some post-Soviet countries, most notably the Russian Federation, have continued the tradition. Serbians celebrate May 9 as a national holiday as well. In many cities people gather on the main square with the Serbian army to celebrate the anniversary with war veterans. May 9 Victory Day over Nazism in World War II May 18 Victory Day - Victory Day marks the end of LTTE in Sri Lanka, specifically the capitulation of LTTE forces to the SL ARMY on May 18, 2009. June 23 Võidupüha or Victory Day is a public holiday in Estonia, which has been celebrated on 23 June every year since 1934. The date recalls the victory in the 1919 Battle of Võnnu (near Cēsis, Latvia) of the Estonian military forces (and Latvian North brigade) and their allies over German forces (Baltische Landeswehr) who sought to re-assert Baltic-German control over the region. The battle was part of the 1918-1920 Estonian War of Independence, where the main adversary of the newly independent Estonia was Communist Russia. Today, Võidupüha also marks the contributions of all Estonians in their fight to regain and retain their independence. The celebration is ceremonially tied to the Midsummer celebrations on June 24. According to Estonian laws, the state flags are not to be lowered during the night between these two days. July 26 Kargil vijay diwas (Kargil Victory Day) commemorates the 1999 Kargil War between India And Pakistan. July 27 Day of Victory in the Great Fatherland Liberation War - July 27, 1953, North Korea celebrates the Day of Victory in the Great Fatherland Liberation War to commemorate the end of the Korean War. August 1 Vietnam (then divided between the north and south) along with Cambodia and Laos claim their independence from the French colonial empire after the withdraw of the French Army on August 1, 1954. August 5 Victory Day (Croatia) - Croatia celebrates the Victory and Homeland Thanksgiving Day and the Day of Croatian defenders on August 5, commemorating the Croatian War of Independence, specifically the liberation of Knin on August 5, 1995. August 9 Victory Day is usually observed in Hawaii and Rhode Island on the second Monday of August. It celebrates the conclusion of World War II, see also Victory over Japan Day. It was a nationally recognized holiday, but it has since been removed because of the nature of the war's ending (i.e. dropping the atomic bomb on Nagasaki on August 9, 1945). Rhode Island retains the holiday in tribute to the disproportionate number of sailors it sent and lost in the Pacific front. August 30 Victory Day (local name: Zafer Bayramı) on August 30 is a national holiday in Turkey to commemorate the victory in the Battle of Dumlupınar, one of the final and the most decisive battles in the Turkish War of Independence in 1922. September 2 Victory over Japan Day (also known as Victory in the Pacific Day, V-J Day, or V-P Day) is a name chosen for the day on which Japan surrendered, effectively ending World War II, and subsequent anniversaries of that event. The term has been applied to both of the days on which the initial announcement of Japan's surrender was made – to the afternoon of August 15, 1945, in Japan, and, because of time zone differences, to August 14, 1945 (when it was announced in the United States and the rest of the Americas and Eastern Pacific Islands) – as well as to September 2, 1945, when the signing of the surrender document occurred, officially ending World War II. September 3 Victory over Japan Day (also known as Victory in the Pacific Day, V-J Day, or V-P Day) is a name chosen for the day on which Japan surrendered, effectively ending World War II, and subsequent anniversaries of that event. September 7 Victory Day on September 7 is a national holiday in Mozambique to commemorate the signing of the agreement to end the Mozambican War of Independence. The agreement was signed between Portugal and Mozambique in 1974, with independence granted in 1975. In Portuguese, the official language of Mozambique, the holiday is known as Dia da Vitória. September 8 Victory Day on September 8 is a national holiday in Malta to commemorate the victory of the Knights Hospitaller over the Ottoman Turks in the Great Siege of 1565, as well as the capitulation of Italy in 1943, turning against its former Nazi German ally during World War II thus ending the Second Siege of Malta. September 8 is also the feast day of the birth of Mary, the mother of Jesus, which is popularly celebrated in Xagħra, Naxxar, Senglea, and Mellieħa on the same day. The traditional regatta featuring boat races in the Grand Harbour is also held on this day. September 8 Operation Dwarka - Pakistan celebrates Victory day for Pakistan Navy on September 8 on the occasion of the acclaimed success of Operation Dwarka during Indo-Pakistani war of 1965. November 4 Italy celebrates it commemorating victory over Austria-Hungary in World War I on November 4, 1918. December 2 The Pathet Lao's capture of Laos's capital Vientiane which ended the Laotian Civil War on December 2, 1975. December 16 Victory Day on December 16 is a national holiday in Bangladesh to commemorate the surrender of Pakistani forces to allied Indian and Bangladeshi forces in the Bangladesh Liberation War in 1971. This holiday is known as Bijoy Dibosh () in Bangladesh, and it is also commemorated as Vijay Diwas in India to mark the victory. In India, the day is primarily of military significance. October 6th The day of Egypt's victory over Israel, which caused the failure of Bar Lev Line and liberation of Sinai == Related pages == * November 11: Remembrance Day, Veterans Day, Armistice Day * Liberation Day: List of dates on which countries were liberated from occupiers * National Day: A day marking the founding of a nation which can be related to a key victory == References == == Other websites == * Victory Day in Egypt, February 11, 2011 * Victory Parade, Russia, Moscow, 2015 Category:Holidays",
 "title": "Victory Day"
}