{
 "id": "53480",
 "text": "The European/South American Cup, commonly called the Intercontinental Cup or Toyota Cup, was a football competition by UEFA and CONMEBOL. The competition was between the winners of the European Champions League and the South American Copa Libertadores in a match played each year. The Cup was called the World Club Championship until the first FIFA Club World Cup was held in 2000. It was played by representatives clubs of most developed continents in the football world. From 2005, the Intercontinental Cup was replaced by the FIFA Club World Cup. The FIFA Club World Cup also includes North American, Asian, African and Oceanian winners. In 2017 FIFA officially recognized all of them as club world champions (de jure) with the same status to the FIFA Club World Cup winners or official\"Official (plural officials), from the Latin officiālis.1. The official word is also used to refer to what is recognized or derives from an authority. cfr. 2. Approved by the government or someone in power. cfr. It is synonymous with legal, legitimate, approved. cfr. For FIFA statute, official competitions are those for representative teams organized by FIFA or any confederation. Representative teams are usually national teams but also club teams that represent a confederation or a member association in a continental competition. cfr. cfr. cfr. world champions FIFA. In synthesis FIFA has two types of world champions, those deriving from the Intercontinental Cup and those deriving from the Club World Cup, the two competitions confer the same title.While it does not promote the statistical unification of tournaments, that is, it has not changed its name to the Intercontinental Cup, FIFA is the only organization with worldwide jurisdiction over continental confederations and, then, the only one that can confer a title on that level, indeed the title was assigned by FIFA and therefore, the title awarded by the same world federation to the winners of the Intercontinental Cup is legally a FIFA world title. cfr. cfr.FIFA Council approves key organisational elements of the FIFA World Cup - Recognition of all European and South American teams that won the Intercontinental Cup – played between 1960 and 2004 – as club world champions./ www.fifa.com The football experts agree that the intercontinental cup is the most fascinating football competition ever existed thanks to the great balance in the field given by the lower economic gap of the time and rules on foreign players who gradually favored the European teams and weakened the South American teams; also the statistics confirm this. == Champions == See also: Clubs of football world champions {| class=wikitable Year Winner 1960 Real Madrid 1961 Peñarol 1962 Santos 1963 Santos 1964 Internazionale 1965 Internazionale 1966 Peñarol 1967 Racing Club 1968 Estudiantes 1969 Milan 1970 Feyenoord 1971 Nacional 1972 Ajax 1973 Independiente 1974 Atlético Madrid Since 2005: FIFA Club World Cup ==Performances== The performance of various clubs is shown in the following tables: ===Performance by club=== Club Winners Runners-up Winning years Runner-up years Milan 3 4 1969, 1989, 1990 1963, 1993, 1994, 2003 Peñarol 3 2 1961, 1966, 1982 1960, 1987 Real Madrid 3 2 1960, 1998, 2002 1966, 2000 Boca Juniors 3 1 1977, 2000, 2003 2001 Nacional 3 — 1971, 1980, 1988 — Independiente 2 4 1973, 1984 1964, 1965, 1972, 1974 Juventus 2 1 1985, 1996 1973 Santos 2 — 1962, 1963 — Internazionale 2 — 1964, 1965 — São Paulo 2 — 1992, 1993 — Ajax 2 — 1972, 1995 — Bayern Munich 2 — 1976, 2001 — Porto 2 — 1987, 2004 — Estudiantes 1 2 1968 1969, 1970 Olimpia 1 2 1979 1990, 2002 Grêmio 1 1 1983 1995 River Plate 1 1 1986 1996 Manchester United 1 1 1999 1968 Racing 1 — 1967 — Feyenoord 1 — 1970 — Atlético Madrid 1 — 1974 — Flamengo 1 — 1981 — Red Star Belgrade 1 — 1991 — Vélez Sarsfield 1 — 1994 — Borussia Dortmund 1 — 1997 — Benfica — 2 — 1961, 1962 Liverpool — 2 — 1981, 1984 Cruzeiro — 2 — 1976, 1997 Celtic — 1 — 1967 Panathinaikos — 1 — 1971 Borussia Mönchengladbach — 1 — 1977 Malmö FF — 1 — 1979 Nottingham Forest — 1 — 1980 Aston Villa — 1 — 1982 Hamburger SV — 1 — 1983 Argentinos Juniors — 1 — 1985 Steaua București — 1 — 1986 PSV Eindhoven — 1 — 1988 Atlético Nacional — 1 — 1989 Colo-Colo — 1 — 1991 Barcelona — 1 — 1992 Vasco da Gama — 1 — 1998 Palmeiras — 1 — 1999 Once Caldas — 1 — 2004 ===Performance by country=== Country Winners Runners-up Winning clubs Winning years 9 9 Boca, Independiente, Estudiantes, River Plate, Racing Club, Vélez Sarsfield 1967, 1968, 1973, 1977, 1984, 1986, 1994, 2000, 2003 7 5 Milan, Juventus, Internazionale 1964, 1965, 1969, 1985, 1989, 1990, 1996 6 5 Santos, São Paulo, Grêmio, Flamengo 1962, 1963, 1981, 1983, 1992, 1993 6 2 Peñarol, Nacional 1961, 1966, 1971, 1980, 1982, 1988 4 3 Real Madrid, Atlético Madrid 1960, 1974, 1998, 2002 3 2 Bayern Munich, Borussia Dortmund 1976, 1997, 2001 3 1 Ajax, Feyenoord 1970, 1972, 1995 2 2 Porto 1987, 2004 1 5 Manchester United 1999 1 2 Olimpia 1979 1 — Red Star Belgrade 1991 — 2 — — — 1 — — — 1 — — — 1 — — — 1 — — — 1 — — ===Performance by confederation=== Confederation Winners Runners-up Winning clubs Winning countries CONMEBOL 22 21 13 4 UEFA 21 22 12 7 ===Coaches=== *Carlos Bianchi won three times as a coach: once with Vélez Sársfield in 1994, and twice with Boca Juniors in 2000 and 2003. *Luis Cubilla and Juan Mujica won cups both as players and coaches: **Luis Cubilla (played for Peñarol in 1961 and for Nacional in 1971, then coached Olimpia in 1979) **Juan Mujica (played for Nacional in 1971, and coached it in 1980) ===Players=== *Alessandro Costacurta and Paolo Maldini played five times in the competition, all with Milan (1989, 1990, 1993, 1994, 2003). * Estudiantes (1968, 1969 and 1970) and Independiente (1972, 1973 and 1974) played in three consecutive years. A few players in those teams played in all three, including Carlos Bilardo and Juan Ramón Verón. == All-time top scorers == * Pelé is the all-time top scorer in the competition. He scored seven goals in three matches. ** In 1962, he scored five goals in two matches against Benfica. This included a hat-trick (three goals) in the second match played in Lisbon (the only hat trick in competition's history). ** In 1963, he scored two goals in one match (against Milan). * Only six players scored at least three goals in the Intercontinental Cup. Player Club Goals Apps Years Pelé Santos 7 3 1962, 1963 Alberto Spencer Peñarol 6 6 1960, 1961, 1966 Luis Artime Nacional 3 2 1971 José Sasía Peñarol 3 3 1961 Santana Benfica 3 4 1961, 1962 Sandro Mazzola Internazionale 3 4 1964, 1965 == Hat-tricks == * Pelé is the only player in the history of the competition to score a hat-trick (Lisbon, 1962, second leg, against Benfica). Player Nation Club Opponent Goals Goal Times Score Tournament Round Date Pelé Brazil Santos Benfica 3 15'; 25'; 64' 5–2 1962 Intercontinental Cup Second leg 11 October 1962 == Man of the Match == The man of the match was selected from 1980. Here is the list of the winners. Year Player Club 1980 Waldemar Victorino Nacional 1981 Zico Flamengo 1982 Jair Peñarol 1983 Renato Gaúcho Grêmio 1984 José Percudani Independiente 1985 Michel Platini Juventus 1986 Antonio Alzamendi River Plate 1987 Rabah Madjer Porto 1988 Santiago Ostolaza Nacional 1989 Alberigo Evani Milan 1990 Frank Rijkaard Milan 1991 Vladimir Jugović Red Star Belgrade 1992 Raí São Paulo 1993 Toninho Cerezo São Paulo 1994 Omar Asad Vélez Sársfield 1995 Danny Blind Ajax 1996 Alessandro Del Piero Juventus 1997 Andreas Möller Borussia Dortmund 1998 Raúl Real Madrid 1999 Ryan Giggs Manchester United 2000 Martín Palermo Boca Juniors 2001 Samuel Kuffour Bayern Munich 2002 Ronaldo Real Madrid 2003 Matías Donnet Boca Juniors 2004 Maniche Porto ==Related pages== *FIFA Club World Championship *Copa Toyota Libertadores *UEFA Champions League *Clubs of football world champions ==Bibliography== * * ==References== == Other websites == *International Clubs Cup - The Rec.Sport.Soccer Statistics Foundation *http://www.fifa.com/ Category:Football competitions Category:UEFA Category:CONMEBOL Category:FIFA Category:2000 establishments",
 "title": "Intercontinental Cup"
}