{
 "id": "53535",
 "text": "A swimming pool is a tank or large basin that is filled with water and intended for recreational or competitive swimming or diving. Pools are also used for other bathing activities, such as playing, wading, water exercise, floating on inner tubes, or cooling off on hot days. Various methods are used to keep algae, germs, and other bad things out of the pool. The chemical chlorine kills germs and algae. Sometimes sea water is also used for this. The filtration system is also used for this. Pump and Filter are two main components of a swimming pool filtration system. ==Types of pools== Some pools are indoor so they can be used when weather is bad. Most are outdoor. There are different types of swimming pools. *The competition pool. Swimming competitions can be held there. Competition pools are usually very large, and usually either 25 or 50 m long and their deep end is 2 to 5 m deep. They have usually 4 to 8 lanes. *A play pool is made for children, and quite shallow, typically no deeper than five feet (1.5m). Play pools can have a decorative shape. *A freeform pool is built generally to imitate a natural lagoon pool or small oasis. It will have a natural uneven shape, and will often have features around it like rocks and waterfalls to compliment the naturalistic style. *A geometric pool has even lines and features. Usually built in a rectangular shape, this pool is considered the “traditional swimming pool” style. *Lap pools are built so that people can swim laps for health and fitness. They tend to be long and narrow, usually over fifty feet (15m) long. *Diving pools are built deep; most are 3 to 6 m deep with a diving board or a platform, or a jump tower. The Olympic diving tower has platforms at 1 m, 3 m, 5 m and 10 m height. *Infinity swimming pools (also referred to as infinity edge swimming pools, or negative edge pools) give the illusion that the edge of the pool extends to the horizon. This gives an optical illusion that the pool “has no edge”, and looks as if the pool goes on to infinity. *The spool: The word \"spool\" is a combination of the two words spa and pool. The spool is a smaller pool, more commonly seen as a large spa. Spools are often around 12 to 14 feet squared. *The perimeter overflow pool: This pool is created by having the pool surface’s water level at the same level as the surround of the pool. The water of the pool drains into a notched perimeter around the pool. Category:Water Category:Swimming",
 "title": "Swimming pool"
}