{
 "id": "535582",
 "text": "A least developed country (LDC) is a country that the United Nations considers to be the least developed out of all the countries in the world. They normally have the lowest ratings on the Human Development Index. The idea to name LDCs started in the late 1960s. The first group of LDCs was listed by the UN in November 1971.General Assembly resolution 2768 (XXVI) (PDF) ==Classification process== Indicators are used to determine whether a country is a least devleoped country. #The gross domestic product, per person, is low. Currently, the average over three years is considered. #An index measuring social factors, such as health, education and literacy among adults. Currently, the Human Assets Index is used for this purpose. #A third index looks at how vulnerable the economy is as a whole. Currently, the Economic Vulnerability Index is used. To be considered a least developed country, a country must have high levels of poverty and infant mortality, low human resources and a vulnerable economy.UN-OHRLLS Criteria for Identification and Graduation of LDCs . The UN looks at indicators, such as gross national income, nutrition, health, education and literacy. Economic vulnerability is recorded on the Economic Vulnerability Index. LDC criteria are reviewed every three years. Countries may stop being considered an LDC when indicators show that they have become developed enough. Since the LDC category was created, four countries have graduated to developing country status. The first country to do this was Botswana in 1994. The second was Cape Verde, in 2007.\"UN advocate salutes Cape Verde’s graduation from category of poorest States\", UN News Centre, 14 June 2007. Then Maldives in 2011, and Samoa in 2014.\"Maldives identifies challenges in graduating to a developing country\" , UN-OHRLLS, 23 December 2010 It is expected that Equatorial Guinea and Vanuatu will be the next countries to be promoted from LDC status. , there are 48 least developed countries. There are also three countries which meet the criteria for LDC status, but have asked to not be included in the index: Ghana, Papua New Guinea and Zimbabwe. ==Current list== The \"least developed countries\" according to the United Nations: ;Africa (32 countries) * * *Also a landlocked developing country * * * *Also a Small Island Developing State * * * * * * * * * * * * * * * * * * * * * * * * * * ;Asia (8 countries) * *UN-OHRLLS About LDCs . Retrieved 2015-12-12. * * * * * * ;Oceania (3 countries) * * * ;Americas (1 country) * ==Related pages== * Developed country * Developing country * Global Hunger Index * Third world * List of countries by Human Development Index * Poverty line * Small Island Developing States ==References== ==More reading== * United Nations, \"LDCs: Least Developed Countries, Landlocked Developing Countries, and Small Island Developing States\" * World Trade Organisation, \"\"WTO Launches Trade Initiative for Least Developed Countries\", FOCUS newsletter, WTO, Geneva, Switzerland, November 1997 issue 24. ==Other websites== * Office of the High Representative for the Least Developed Countries, United Nations * United Nations List of LDCs Category:Economic geography",
 "title": "Least developed country"
}