{
 "id": "535708",
 "text": "Iss Pyaar Ko Kya Naam Doon? (; ) is an Indian soap opera. It is shown during the daytime on weekdays, on Star Plus. It originally ran from 6 June 2011 until 30 November 2012. The show is mainly about the romance between Arnav Singh Raizada (Barun Sobti) and Khushi Kumari Gupta (Sanaya Irani). The series is done in Hindi. The actors' voices have been recorded over (dubbing) in Tamil (as Idhu Kadhala), Telugu (as Chuppulu Kalisina Shubhavela), Malayalam (as Mounam Sammadham), Turkish (as Bir Garip Ask) and Arabic (as Men Nazra Thanya). The show stopped being made in 2012. This was because Sobti, who plays the main character, quit the show. Three years later, in November 2015, a web series of eight episodes was released. It continued the story, and Sobti returned to play Arnav. The web series was successful. Because of its success, the television series was renewed for another 30 episodes. It is to be shown on Star Plus in March 2016. For his role as Arnav, Sobti won \"Favorite TV Drama Actor\" at the People's Choice Awards in 2012, and \"Best Actor Popular\" at the Indian Television Academy Awards in 2012. Sobti and Irani also won the Indian Telly Award for \"Best Onscreen Couple\" in 2012. ==Plot== Arnav Singh Raizada (Barun Sobti) is a successful businessman in India. He is the owner of AR Designs. He is popularly known as ASR in the business world. He is ruthless and egoistic though sophisticated in his behaviour. He believes that money is the most important thing in the world. He is an atheist and does not believe in rituals, customs and traditions. He does not believe in marriage and wanted to maintain a living relationship with his ex-girlfriend Lavanya Kashyap. Besides this, he loves his elder sister Anjali (Daljeet Kaur Bhanot) and respects his elders. He suffers from diabetes from an early age. He has hobbies of planting and gardening. However his arrogant and ruthless attitude changes when he falls in love with Khushi Kumari Gupta (Sanaya Irani). Khushi is hired as Arnav's assistant. She is a simple, traditional girl. She is also an orphan, but she believes in the power of love and maintains a strong faith in God. Despite their differences, they are attracted to each other. They eventually get married. ==Cast== ===Main=== * Barun Sobti as Arnav Singh Raizada: Khushi's husband, Anjali's younger brother, Akash's paternal cousin, Aarav's adoptive father (2011–2012) * Sanaya Irani as Khushi Arnav Singh Raizada (née Kumari Gupta): Arnav's wife, Garima's sister's daughter, Garima and Shashi's adopted daughter, Payal's younger sister, Aarav's adoptive mother (2011–2012) ===Recurring=== * Dalljiet Kaur as Anjali Singh Raizada : Shyam's ex wife, Arnav's elder sister, Akash's paternal cousin (2011–2012) * Abhaas Mehta as Shyam Jha: Anjali's husband, Arnav's brother-in-law, Khushi's former fiancé (2011–2012) * Deepali Pansare as Payal Singh Raizada (née Kumari Gupta): Akash's wife, Shashi's daughter, Garima's daughter, Khushi's elder sister (2011–2012) * Akshay Dogra as Akash Singh Raizada: Payals' husband, Manorama and Manohar's son, Anjali and Arnav's maternal cousin (2011–2012) * Sanjay Batra as Shashi Gupta: Garima's husband, Payal's father, Khushi's adopted father and maternal uncle, Madumati's younger brother (2011–2012) * Tuhinaa Vohra/Pyumori Mehta as Garima Gupta: Shashi's 2nd wife, Payal's mother and Khushi's adopted mother, Khushi's maternal aunt (2011–2012) * Abha Parmar as Madhumati Gupta: Shashi's elder sister, Payal's paternal aunt, Khushi's adopted paternal aunt (2011–2012) * Jayshree T. as Devyani Devi: Anjali and Arnav's maternal grandmother and Akash's paternal grandmother, Manorama's mother-in-law, Khushi's maternal grandmother-in-law, Payal's paternal grandmother-in-law, Subhadra's childhood friend (2011–2012) * Utkarsha Naik as Manorama Singh Raizada: Manohar's wife, Akash's mother, Payal's mother-in-law, NK's maternal aunt, Anjali and Arnav's maternal aunt (2011–2012) * Rajesh Jais as Manohar Singh Raizada: Manorama's husband, Devyani's son, Akash's father, Anjali and Arnav's maternal uncle, Payal's father-in-law. (2011–2012) * Karan Goddwani as Nand Kishore aka NK: Manorama's sister's son, Akash's maternal cousin. (2011–2012) * Dinesh Nag as Hari Prasad \"HP\" Yadav (2011) * Sana Makbul as Lavanya Kashyap, Arnav's ex-girlfriend. (2011) * Roshni Rastogi as Aradhya Naveli (2011) * Zuber Khan as Rahim Mirza (2011) * Amit Dua as Vikrant, co-organizer of the Ms. India Contest (2012) * Gaurav Muskesh as reporter * Yogesh Tripathi as Kamlesh Khabari (2011) * Swati Chitnis as Subhadra Devi: Anjali and Arnav's paternal grandmother, Khushi's paternal grandmother-in-law, Devyani's childhood friend (2012) * Dhriti Bhatia as Bubbly (2012) * Madhura Naik as Sheetal Kapoor (2012) * Vishesh Bansal as Aarav Singh Raizada, Arnav and Khushi's adopted son. (2012) ===Guest appearances=== * Manasi Parekh as Gulaal, Guest (2010) *Hanif Hilal as Guest (Dance performance to Character Dheela for Anjali-Shyam's anniversary) (2010) *Nicole Alvares as Guest (Dance performance to Character Dheela for Anjali- Shyam's anniversary) (2010) *Krystle D'Souza as Jeevika, Guest (2010) *Nia Sharma as Manvi, Guest (2010) *Karan Tacker as Viren, Guest (2010) *Deepika Singh as Sandhya, Guest (2010) *Pooja Gor as Pratigya, Guest (2010) *Devoleena Bhattacharjee as Gopi, Guest (2012) *Disha Parmar as Pankhuri, Guest (2012) ==References== ==Other websites== * Official website * Category:2010s Indian television series Category:2010s soap operas Category:2011 Indian television series debuts Category:2012 Indian television series endings Category:Hindi- language television series",
 "title": "Iss Pyaar Ko Kya Naam Doon?"
}