{
 "id": "535921",
 "text": "The Twenty-seventh Amendment to the United States Constitution (Amendment XXVII) has to do with the salaries paid to members of the United States Congress. Congress is made of two \"Houses,\" and the members of each House serve different terms (amounts of time in office). Members of the United States Senate serve six-year terms, and members of the United States House of Representatives serve two years each. The Twenty-seventh Amendment says that no law can change Congresspeople's salaries until a new two-year term for Representatives starts. As of 2024, the Twenty-seventh amendment is the last amendment that has been added to the Constitution. It took longer for the states to ratify this amendment than any other in history. The 1st United States Congress sent the suggested amendment to the states for their approval on September 25, 1789. It was not until May 7, 1992, that enough states ratified the amendment for it to be added to the Constitution. The ratification process had taken 202 years, 7 months, and 12 days the longest in United States history. ==Text== When Congress first proposed the amendment in 1789, this is the text they suggested: ==History== On September 25, 1789, the first United States Congress gave a group of 12 amendments to the states for their approval. Written by James Madison, these were the first 12 Constitutional amendments ever written. One of them was an amendment about salaries for Members of Congress. Madison wanted to protect against Congresspeople being able to give themselves raises whenever they wanted to, while they were in the middle of their terms and the people could not vote them out. In 1791, the states ratified ten of the 12 suggested amendments. These ten amendments became the Bill of Rights. However, the states did not ratify the other two amendments out of the 12 including the one on limiting pay for Congresspeople. == Proposal and ratification == === Proposal by Congress === James Madison first proposed this amendment in the United States House of Representatives on June 8, 1789. On August 24, 1789, the House passed the suggested amendment and sixteen others. The proposals went next to the United States Senate, which made 26 different changes to the House's suggested amendments. After taking out some parts of the House amendments, and combining others, the Senate approved a package of twelve suggested amendments on September 9, 1789. Now a committee of House and Senate members had to meet to figure out a compromise and come up with amendments that they could all agree on. After three days, they had come up with 12 suggested amendments, which they brought back to the full House and Senate. That same day September 24, 1789 the House agreed on the 12 proposed amendments. The next day, the Senate agreed too. The 12 amendments included the one on Congressional pay. ===Ratification by the states=== Congress sent the package of 12 amendments to the states on September 25, 1789. For these amendments to be added to the Constitution, three-fourths of the state legislatures would have to ratify (approve) the amendments. At the time, there were only 11 states (North Carolina and Rhode Island had not ratified the Constitution yet). This meant just nine states would have to approve the amendments to add them to the Constitution. On December 15, 1791, the states ratified ten of the twelve suggested amendments. These got added to the Constitution together as the Bill of Rights. However, at this time, only six states had ratified the Congressional pay amendment. Over the next 186 years, only two more states ratified the Amendment. Meanwhile, many more states joined the United States. This meant that a larger number of states would need to ratify the amendment to get it added to the Constitution, since three-fourths of the state legislatures needed to ratify it, and there were more and more states as time went on. The states ratified the Amendment in this order: Order State Date Years Since 1789 Notes 1 Maryland December 19, 1789 0 2 North Carolina December 22, 1789 0 Reaffirmed (re-signed) July 4, 1989 3 South Carolina January 19, 1790 1 4 Delaware January 28, 1790 1 5 Vermont November 3, 1791 2 6 Virginia December 15, 1791 2 Kentucky June 27, 1792 3 Ratification was unknown until 1992; Reaffirmed March 21, 1996 7 Ohio May 6, 1873 84 Ratified as a protest against the 1873 \"Salary Grab Act\" 8 Wyoming March 6, 1978 189 Ratified as a protest against a Congressional pay raise 9 Maine April 27, 1983 194 10 Colorado April 22, 1984 195 11 South Dakota February 21, 1985 196 12 New Hampshire March 7, 1985 196 State had rejected ratification in 1790 13 Arizona April 3, 1985 196 14 Tennessee May 28, 1985 196 15 Oklahoma July 1, 1985 196 16 New Mexico February 14, 1986 197 17 Indiana February 24, 1986 197 18 Utah February 25, 1986 197 19 Arkansas March 13, 1987 198 20 Montana March 17, 1987 198 21 Connecticut May 13, 1987 198 22 Wisconsin July 15, 1987 198 23 Georgia February 2, 1988 199 24 West Virginia March 10, 1988 199 25 Louisiana July 7, 1988 199 26 Iowa February 9, 1989 199 27 Idaho March 23, 1989 199 28 Nevada April 26, 1989 199 29 Alaska May 6, 1989 199 30 Oregon May 19, 1989 199 31 Minnesota May 22, 1989 199 32 Texas May 25, 1989 199 33 Kansas April 5, 1990 200 34 Florida May 31, 1990 200 35 North Dakota March 25, 1991 201 36 Alabama May 5, 1992 202 37 Missouri May 5, 1992 202 38 Michigan May 7, 1992 202 Amendment added to the Constitution: May 7, 1992 New Jersey May 7, 1992 202 State rejected the Amendment in 1789 Illinois May 12, 1992 202 California June 26, 1992 202 Rhode Island June 10, 1993 203 State rejected the Amendment in 1790 Hawaii April 29, 1994 204 Washington April 6, 1995 205 Never ratified the Amendment Massachusetts, Mississippi, Nebraska, New York, and Pennsylvania ==Notes== ==Reference== *27 Category:1992 in the United States Category:1990s in law Category:1789 in the United States",
 "title": "Twenty-seventh Amendment to the United States Constitution"
}