{
 "id": "536051",
 "text": "The Corwin Amendment is a proposed amendment to the United States Constitution. It was passed by the Congress on March 2, 1861 and sent to the state legislatures for ratification. Senator William H. Seward of New York introduced the amendment in the Senate. Representative Thomas Corwin of Ohio introduced it in the House of Representatives. It was one of several bills considered by Congress in an unsuccessful attempt to attract the seceding states back into the Union and to convince border slave states to stay. Technically still pending before the states, it would, if ratified, shield \"domestic institutions\" of the states (which in 1861 included slavery) from the constitutional amendment process and from interference by Congress.Foner, 2010, p. 158 ==Text== ==Ratification history== The Corwin Amendment was ratified by: * Ohio — May 13, 186158 Ohio Laws 190 (Rescinded ratification – March 31, 186461 Ohio Laws 182) * Maryland — January 10, 1862Harold Holzer, Lincoln President-Elect: Abraham Lincoln and the Great Secession Winter 1860-1861 (NY: Simon & Schuster, 2008), 429Laws of the State of Maryland, Made and Passed At a Session of the General Assembly begun and held at the City of Annapolis on the third day of December, 1861, and ended on the tenth day of March, 1862. (Chapter 21, pages 21 and 22) (Rescinded ratification – April 7, 2014) * Illinois — February 14, 1862 (questionable validity)Harold Holzer, Lincoln President-Elect: Abraham Lincoln and the Great Secession Winter 1860-1861 (NY: Simon & Schuster, 2008), 429 In 1963, more than a century after the Corwin Amendment was sent to the state legislatures by the Congress, a joint resolution to ratify it was introduced in the Texas House of Representatives by Dallas Republican Henry Stollenwerck. The joint resolution was sent to the House's Committee on Constitutional Amendments on March 7, 1963, but received no further consideration. ==Possible impact if adopted== The Corwin Amendment, when viewed through the lens of the plain meaning rule (literal rule), would have made institutionalized slavery unable to be affected by the amendment process. As a result, the later Reconstruction Amendments (Thirteenth, Fourteenth and Fifteenth) would not have been allowed, as they abolish or interfere with the domestic institution of the states. A competing theory, however, suggests that a later amendment conflicting with an already-ratified Corwin Amendment could either explicitly repeal the Corwin Amendment (as the Twenty-first Amendment explicitly repealed the Eighteenth Amendment) or be inferred to have partially or completely repealed any conflicting provisions of an already-adopted Corwin Amendment. == Notes == ==References== == Other websites == * The ‘Ghost Amendment’ That Haunts Lincoln’s Legacy * A proposed Thirteenth Amendment to prevent secession, 1861 Category:Proposed amendments to the United States Constitution",
 "title": "Corwin Amendment"
}