{
 "id": "536019",
 "text": "Republicanism in the United States is a set of ideas that guides the government and politics. These ideas have shaped the government, and the way people in the United States think about politics, since the American Revolution. The American Revolution, the Declaration of Independence (1776), the Constitution (1787), and even the Gettysburg Address (1863) were based on ideas from American republicanism. \"Republicanism\" comes from the word \"republic.\" However, they are not the same thing. A republic is a type of government (one where the people can choose their leaders). Republicanism is an ideology set of beliefs that people in a republic have about what is most important to them.Hart, Gary (2002). \"The Republic for Which it Stands.\" In Restoration of the Republic: The Jeffersonian Ideal in 21st-Century America. Oxford University Press. pp. 3-24. . ==Definition== Republicanism in the United States grew out of some very old ideas. It includes ideas from ancient Greece, ancient Rome, the Renaissance, and England.Vierhaus, Rudolf (2002). \"Wir pennon's Gemeinsinn (We Call It Public Spirit): Republic and Republicanism in the German Political Discussion of the Nineteenth Century.\" In Peter Becker, Jürgen Heideking, and James A. Henrietta (eds.). Republicanism and Liberalism in America and the German States, 1750-1850. Cambridge University Press. pp. 21-34. . Some of the most important ideas of republicanism are that:Buel, Richard (1972). Securing the Revolution: Ideology in American Politics, 1789–1815. Cornell University Press. . * Liberty and \"unalienable\" rights (natural rights) are some of the most important things in a society * Government should exist to protect these rights * The people who live in a country, as a whole, should be sovereign (they should be able to choose who leads them and have a say in how their government is run) * Power must always be given by the people, never inherited (like in a monarchy) * People must all play a role in their government by doing things like voting * Political corruption is terrible and has no place in a republic Republicanism is different than other forms of democracy. In a \"pure\" democracy, the majority rules. If a majority of the people voted to take rights away from a certain group, that is what would happen.Volk, Kyle G. (2009). \"The Perils of 'Pure Democracy': Minority Rights, Liquor Politics, and Popular Sovereignty in Antebellum America.\" Journal of the Early Republic 29 (4): 641-679. Volk, Kyle G. (2014). Moral Minorities and the Making of American Democracy. New York: Oxford University Press. . Alexis de Tocqueville, a famous French political thinker, called this the \"tyranny of the majority.\"de Tocqueville, Alexis (1835). Chapter 15: Unlimited Power of the Majority in the United States, and its Consequences. In Democracy in America (online version) . Published online by the University of Virginia. He meant that a pure democracy could still turn into an unfair, unequal, corrupt society if the majority of the people decided to take away others' rights. However, republicanism says that people have \"unalienable\" rights that cannot be voted away. Republican governments are different than \"pure\" democracies, because they include protections to make sure people's rights are not taken away. In a true republican government, one group - even if it is a majority - cannot take another group's unalienable rights away.Reid, John Phillip (2003). Constitutional History of the American Revolution. University of Wisconsin Press. p. 76. . ==The American Revolution== American republicanism was created and first practiced by the Founding Fathers in the 18th century. For them, \"republicanism represented more than a particular form of government. It was a way of life, a core ideology, an uncompromising commitment to liberty, and a total rejection of aristocracy.\"Divine, Robert A.; Breen, T.H.; Fredrickson, George M.; et al. (2007). The American Story (3rd ed.). Longman. p. 147. . Republicanism shaped what the Founders thought and did during the American Revolution, and after. ===Creating American republicanism=== The leaders of colonial America in the 1760s and 1770s read history carefully. Their goal was to compare governments and how well different types of governments worked.Colbourn, Trevor (1965). The Lamp of Experience: Whig History and the Intellectual Origins of the American Revolution (online version) . Liberty Fund. Original hardcover published by Alpine Fine Arts Collection. ASIN B00ZVIX5US. They were especially interested in the history of liberty in England. They modeled American republicanism partly after the English \"Country Party.\" This was a political party which opposed the Court Party, which held power in England. The Country Party was based on ancient Greek and Roman republicanism.Dickinson, H.T. (ed.) (2002). A Companion to Eighteenth-Century Britain. Wiley-Blackwell. p. 300. . The Party criticized the corruption in the \"Court\" Party, which focused mostly on the King's court in London. It did not focus on the needs of regular people in England, or on areas outside of the capital city.Hoppit, Julian (2000). A Land of Liberty?: England, 1689-1727. Oxford University Press. p. 159. . By reading history, The Founders came up with a set of political ideas that they called \"republicanism.\" By 1775, these ideas were common in colonial America.Sellers, Mortimer N.S. (1994). American Republicanism: Roman Ideology in the United States Constitution. NYU Press. p. 3. . One historian writes: \"Republicanism was the distinctive political [way of thinking] of the entire Revolutionary generation.\"Kelley, Robert (June 1977). \"Ideology and Political Culture from Jefferson to Nixon.\" American Historical Review 82 (3): 531-562. . Another historian explains that believers of American republicanism saw government as a threat. He writes that colonists felt constantly \"threatened by corruption.\" Government, to them, was \"the [biggest] source of corruption and operat[ed] through such means as patronage, faction, standing armies ( [instead of] the ideal of the militia); [and] established churches\" which people would have to belong to.Pocock, J.G.A. (May 1, 1975). The Machiavellian Moment: Florentine Political Thought and the Atlantic Republican Tradition. Princeton University Press. p. 507. . ===Cause of Revolution=== By the 1770s, most Americans were dedicated to republican values and to their property rights. This helped cause the American Revolution. More and more, Americans saw Britain as corrupt; hostile; and a threat to republicanism, freedom, and property rights. Many people thought that the greatest threat to liberty was corruption not just in London, but at home too. They thought corruption went along with inherited aristocracy, which they hated. During the Revolution, many Christians connected republicanism with their religion. When the Revolution started, there was a major change in thinking that \"convinced Americans ... that God was raising up America for some special purpose,\" according to one historian.Kidd, Thomas S. (2012). God of Liberty: A Religious History of the American Revolution. Basic Books. p. 9. . This made the Revolutionists believe that they had a moral and religious duty to get rid of the corruption in the monarchy.Bailyn, Bernard (1967). The Ideological Origins of the American Revolution. Belknap Press. pp. 92, 595. . Another historian, Gordon Wood, writes that republicanism led to American Exceptionalism: \"Our beliefs in liberty, equality, constitutionalism, and the well-being of ordinary people came out of the Revolutionary era. So too did our idea that we Americans are a special people with a special destiny to lead the world toward liberty and democracy.\"Wood, Gordon (2011). Idea of America: Reflections on the Birth of the United States. Penguin. p. 1. . In his Discourse of 1759, Revolutionist Jonathan Mayhew argued that people should only obey their governments if they \"actually perform the duty of rulers by exercising a reasonable and [fair] authority for the good of human society.\" Many American colonists were convinced that British rulers were not using their power \"for the good of human society.\" This made them want to form a new government which would be based on republicanism. They thought a republican government would protect not threaten freedom and democracy. ===Founding Fathers=== The \"Founding Fathers\" were strong supporters of republican values, especially Samuel Adams, Patrick Henry, George Washington, Thomas Paine, Benjamin Franklin, John Adams, Thomas Jefferson, James Madison, and Alexander Hamilton. For example, Thomas Jefferson once wrote that a government that had the most possible participation by \"its citizens in mass\" (all the people together) was the safest kind. He said a republic is: The Founding Fathers often talked about what \"republicanism\" meant. In 1787, John Adams defined it as \"a government, in which all men, rich and poor, magistrates and subjects, officers and people, masters and servants, the first citizen and the last, are equally subject to the laws.\"Kerland, Philip; Lerner, Ralph (eds.) (May 1, 2000). Chapter 4: Republican Government.\" In The Founders' Constitution, Volume I (Web Edition). University of Chicago Press and Liberty Press. Retrieved on March 20, 2016. Original hardcover published by Liberty Press. . ===Other ideas=== Some other ideas also affected the Founding Fathers. For example, in the 1600s, John Locke, an English philosopher, had created the idea of the \"social contract.\" This idea said that people agree to obey governments, and in return, those governments agree to protect the people and their rights. This is like a contract made between the people and the government. If the government breaks this contract, and does not protect the people's rights, then the people have the right to overthrow their leaders. This idea was important to the Revolutionists. When they were writing state and national constitutions, the Americans used ideas from Montesquieu, an 18th-century French political thinker. Montesquieu wrote about how the perfect British constitution would be \"balanced.\" The idea of a balance of power (also called \"checks and balances\") is a very important part of the Constitution. It is one of the strategies the Founders used to make sure their government would be republican and protect the people from government corruption. ==The Constitution== The Founding Fathers wanted republicanism because its ideas guaranteed liberty, with limited powers checking and balancing each other. However, they also wanted change to happen slowly. They worried that in a democracy, the majority of voters could vote away rights and freedoms.Madison, James (1834). James Madison. Majority Government. 1834. American Memory: The James Madison Papers. United States Library of Congress. Retrieved March 20, 2016. They were most worried about poor Americans (who made up most of the United States) turning against the rich.Wood, Gordon S. (2009). Empire of Liberty: A History of the Early Republic, 1789-1815. Oxford University Press. p. 214. ASIN B00POFD06W. They worried that democracy could turn into \"mob rule.\"Brown, Mark B. (2009). Science in Democracy: Expertise, Institutions, and Representation. Cambridge, Massachusetts: MIT Press. p. 83. ASIN B012YSQT00. To guard against this, the Founders wrote many protections into the Constitution. For example:Adams, Willi Paul (2002). \"The Liberalism and Democratic Republicanism of the First American State Constitutions.\" In Peter Becker, Jürgen Heideking, and James A. Henrietta (eds.). Republicanism and Liberalism in America and the German States, 1750-1850. Cambridge University Press. pp. 127-146. . * They made sure the Constitution can only be changed by a \"supermajority\": two-thirds of the United States Congress and three-fourths of the state legislatures * They set up a court system that could help protect people's rights if the majority of Americans decided to take a group's rights away * They created an Electoral College, where a small number of elite people would select the President ** Soon, political parties controlled elections more than the Electoral College did * They gave the states control of the United States Senate by letting state legislatures choose Senators (this changed over time) * They set up a House of Representatives to represent the people Most adult white males were able to vote. In 1776, most states required people to own property to be able to vote. However, at that time, America was 90% rural, and most people owned farms. As cities grew bigger and people started doing work in the cities, most states dropped the property requirement. By 1850, this requirement was gone in every state.Keyssar, Alexander (August 15, 2001). The Right to Vote: The Contested History of Democracy in the United States. Basic Books. . ===Republican motherhood=== Under the new government after the Revolution, \"republican motherhood\" became an ideal. Abigail Adams and Mercy Otis Warren were held up as the perfect \"republican mothers.\" This idea said that a republican mother's first duty was to teach her children republican values. Her second job was to live simply and avoid luxury, which the Founders linked with corruption.Zagarri, Rosemarie (2002). \"Between Liberalism and Republicanism: \"Manners\" in the Political Thought of Mercy Otis Warren.\" In Peter Becker, Jürgen Heideking, and James A. Henrietta (eds.). Republicanism and Liberalism in America and the German States, 1750-1850. Cambridge University Press. pp. 113-127. .Kerber, Linda K. (1976). \"The Republican Mother: Women and the Enlightenment An American Perspective.\" American Quarterly. 28 (2): 187–205. . ===Democracy=== Many of the Founders did not think \"democracy\" was a good idea. Their idea of \"democracy\" was the \"pure democracy\" that de Tocqueville had described. They worried often about the problem of 'tyranny of the majority' that de Tocqueville had warned about. They wrote many protections into the Constitution to prevent this from happening. As historians Richard Ellis and Michael Nelson write: \"The principles of republican government embedded in the Constitution represent an effort by the framers to [make sure] that the inalienable rights of life, liberty, and the pursuit of happiness would not be [destroyed] by majorities.\"Ellis, Richard J.; Nelson, Nelson (2009). Debating the Presidency: Conflicting Perspectives on the American Executive. CQ Press. p. 211. . Thomas Jefferson warned that \"an elect[ed] despotism is not the government we fought for.\"Tucker, David (April 28, 2008). Enlightened Republicanism: A Study of Jefferson's Notes on the State of Virginia. Lexington Books. p. 109. . James Madison, in particular, worried about this, and wrote about it in The Federalist Papers. The Federalist Papers talk about democracy as being dangerous, because it allows a majority to take away the rights of a smaller group.Boyer, Paul S.; Clark, Clifford E.; Halttunen, Karen; et al. (2010). The Enduring Vision: A History of the American People, Volume I: To 1877. Wadsworth Publishing. p. 191. . However, Madison thought that as more people came to the United States, the country would get more diverse, and it would be harder to form a majority big enough to do this.Bourke, Paul F. (1975). \"The Pluralist Reading of James Madison's Tenth Federalist.\" Perspectives in American History 9 271-299. In Federalist No. 10, Madison also argued that a strong federal government would help protect republicanism. The United States' first constitution, the Articles of Confederation, gave most power to the states and had a very weak federal government that could not get anything done. In Federalist No. 10, Madison argued that a small but powerful group might be able to take control of a small area, like a state. However, it would be much harder to take over an entire country. The bigger the country, he argued, the safer republicanism would be. As late as 1800, the word \"democrat\" still had a very bad meaning to most Americans. It was mostly used to attack an opponent of the Federalist party. In 1798, George Washington complained that a \"Democrat ... will leave nothing unattempted to overturn the Government of this Country.\" Transcript archived from the original on December 5, 2014. This changed over the next few decades. ===Property rights=== United States Supreme Court Justice Joseph Story (1779–1845) made the protection of property rights by the courts a major part of American republicanism. James Madison appointed Story to the Court in 1811. Story and Chief Justice John Marshall made the Court a protector of the rights of property against runaway democracy.Davis, David Brion (1997), Antebellum American Culture: An Interpretive Anthology. Penn State University Press. pp. 14-15. . Story believed that \"the right of the citizens to the free enjoyment of their property\" (if they got it legally) was \"a great and fundamental principle of a republican government.\"Graber, Mark A. (2005). \"From Republic to Democracy: The Judiciary and the Political Process.\" In Kermit L. Hall and Kevin T. McGuire (eds.). Institutions of American Democracy: The Judicial Branch. Oxford University Press. p. 404. . Historians agree that Story—as much or more than Marshall or anyone else—reshaped American law in a conservative direction that protected property rights.Presser, Stephen B. (December 1985). \"Resurrecting the Conservative Tradition in American Legal History.\" Reviews in American History 13 (4): 526-533. . ===Military service=== Republicanism saw military service as one of a citizen's most important duties.Cress, Lawrence D. (1981). \"Republican Liberty and National Security: American Military Policy as an Ideological Problem, 1783 to 1789.\" William and Mary Quarterly 38 (1): 73–96. ISSN 0043-5597. . John Randolph, a Congressman from Virginia, once said: \"When citizen and soldier shall be synonymous terms, then you will be safe.\"Banning, Lance (1980). The Jeffersonian Persuasion: Evolution of a Party Ideology. Cornell University Press. p. 262. . However, at this time, the word \"army\" meant \"foreign mercenaries.\" After the Revolutionary War, Americans did not trust mercenaries.Scott, Samuel F. (1984). \"Foreign Mercenaries, Revolutionary War, and Citizen-Soldiers in the Late Eighteenth Century.\" War & Society 2 (2): 41–58. ISSN 0729-2473. . Instead, they came up with the idea of a national army, made of citizens. They changed their definition of military service from a choice of careers to a civic duty something every good republican should do. Before the Civil War, people saw military service as an important show of patriotism, and a necessary part of citizenship. To soldiers, military service was something they chose to do, something they had a say in, and it showed that they were good citizens.Herrera, Ricardo A. (2001). \"Self-Governance and the American Citizen as Soldier, 1775–1861.\" Journal of Military History 65 (1): 21–52. ==Legal terms== ===Republic=== The term republic is not used in the Declaration of Independence. However, it does appear in Article Four of the Constitution, which \"guarantee[s] to every State in this Union a Republican form of Government.\" The United States Supreme Court has created a basic definition of what a \"republic\" is. In United States v. Cruikshank (1875), the court ruled that the \"equal rights of citizens\" were inherent to the idea of a republic. Later, the Court's decision from In re Duncan (1891) ruled that the \"right of the people to choose their government\" is also part of the definition of a republic. ===Democracy=== Over time, most Americans changed their opinion about the word \"democracy.\" By the 1830s, most Americans saw democracy as a great thing, and members of the new Democratic Party proudly called themselves \"Democrats.\"Safire, William (2008). Safire's Political Dictionary. Oxford University Press. pp. 175–76. .Eyal, Yonatan (2007). The Young America Movement and the Transformation of the Democratic Party, 1828–1861. Cambridge University Press. p. 27. . After 1800, the limitations on democracy (like rules that limited who could vote) were removed one by one: * By the 1820s, most states had ended rules saying that people had to own property in order to vote.Boyer, Paul S. (2001). The Oxford Companion to United States History. Oxford University Press. p. 754. . By 1850, all of them had. * In 1870, the Fifteenth Amendment gave all men in the United States the right to vote, including ex-slaves. * In 1913, the Seventeenth Amendment allowed the people to elect their own United States Senators (before this, the state legislatures had chosen U.S. Senators). * The Nineteenth Amendment, passed in 1920, gave women the right to vote. * The Voting Rights Act of 1965 made the last rules that kept black people from voting illegal. * Finally, in 1971, the Twenty-sixth Amendment gave adults ages 18 to 20 the right to vote. ==Notes== ==References== Category:18th century in the United States Category:American Revolutionary War Category:Political philosophy Category:United States Constitution",
 "title": "Republicanism in the United States"
}