{
 "id": "536054",
 "text": "The Child Labor Amendment is a proposed and still-pending amendment to the United States Constitution that would specifically authorize Congress to regulate \"labor of persons under eighteen years of age\". The amendment was proposed in 1924 following Supreme Court rulings in 1918 and 1922 that federal laws regulating and taxing goods produced by employees under the ages of 14 and 16 were unconstitutional. The majority of the state governments ratified the amendment by the mid-1930s. However, it has not been ratified by the required three-fourths of the states according to Article V of the Constitution. None of the states have ratified it since 1937. There was not much interest in the amendment after the passage of the Fair Labor Standards Act of 1938, which implemented federal regulation of child labor with the Supreme Court's approval in 1941. Because Congress did not set a time limit for its ratification, the amendment is still technically pending before the states. Currently, ratification by an additional ten states would be necessary for this amendment to become law. ==Text== ==Background== With the Keating–Owen Act of 1916, Congress had attempted to control interstate commerce involving goods produced by employees under the ages of 14 or 16, depending on the type of work. The Supreme Court found this law unconstitutional in Hammer v. Dagenhart (1918). Later that year, Congress attempted to levy a tax on businesses with employees under the ages of 14 or 16 (again depending on the type of work), which was struck down by the Supreme Court in Bailey v. Drexel Furniture. It became apparent that a constitutional amendment would be necessary for such legislation to overcome the Court's objections. ==Legislative history== The amendment was offered by Ohio Republican Congressman Israel Moore Foster on April 26, 1924, during the 68th Congress, in the form of House Joint Resolution No. 184. The text of the proposed amendment reads: ==Ratification history== Having been approved by Congress, the proposed amendment was sent to the state legislatures for ratification. It was ratified by the following states: # Arkansas — June 28, 1924 # California — January 8, 1925 # Arizona — January 29, 1925 # Wisconsin — February 25, 1925 # Montana — February 11, 1927 # Colorado — April 28, 1931 # Oregon — January 31, 1933 # Washington — February 3, 1933 # North Dakota — March 4, 1933 (After State Senate rejection – January 28, 1925) # Ohio — March 22, 1933 # Michigan — May 10, 1933 # New Hampshire — May 17, 1933 (After rejection – March 18, 1925) # New Jersey — June 12, 1933 # Illinois — June 30, 1933 # Oklahoma — July 5, 1933 # Iowa — December 5, 1933 (After State House rejection – March 11, 1925) # West Virginia — December 12, 1933 # Minnesota — December 14, 1933 (After rejection – April 14, 1925) # Maine — December 16, 1933 (After rejection – April 10, 1925) # Pennsylvania — December 21, 1933 (After rejection – April 16, 1925) # Wyoming — January 31, 1935 # Utah — February 5, 1935 (After rejection – February 4, 1925) # Idaho — February 7, 1935 (After State House rejection – February 7, 1925) # Indiana — February 8, 1935 (After State Senate rejection – February 5, 1925 and State House rejection - March 5, 1925) # Kentucky — January 13, 1937 (After rejection – March 24, 1926) # Nevada — January 29, 1937 # New Mexico — February 12, 1937 (After rejection – 1935) # Kansas — February 25, 1937 (After rejection – January 30, 1925) no other states have ratified the Child Labor Amendment. The following fifteen state legislatures rejected the Child Labor Amendment and did not ratify it: Connecticut (1925), Delaware (1925), Florida (1925), Georgia (1924), Louisiana (1924), Maryland (1927), Massachusetts (1925), Missouri (1925), North Carolina (1924), South Carolina (1925), South Dakota (1925, 1933 and 1937), Tennessee (1925), Texas (1925), Vermont (1925), and Virginia (1926). Although the act, on the part of state legislatures, of \"rejecting\" a proposed constitutional amendment has no legal recognition, such action does have political implications. Of the 48 states in the Union in 1924, five have taken no action of record on the amendment: Alabama, Mississippi, Nebraska, New York and Rhode Island. Neither have Alaska or Hawaii, which became states in 1959. Because there are now 50 states in the Union, it cannot become law unless it is ratified by 38 states (an additional 10), although when it was submitted to the states 36 ratifications were enough. ==Judicial history== If ever ratified by the required number of U.S. state legislatures, the Child Labor Amendment would give the Congress of the United States jurisdiction concurrent with that of the states to legislate on the subject of child labor. In this case, child labor laws would no longer only fall under the jurisdiction of the states under the 10th Amendment. The states would have to yield to federal law where the two conflict—which is normal procedure anyway. After several state legislatures initially objected to the proposal during the 1920s, a number of them re-examined their position during the 1930s and decided to ratify. Those delayed actions resulted in much controversy. They also resulted in the 1939 decision of the United States Supreme Court in the landmark case of Coleman v. Miller. In this case it was determined that the Child Labor Amendment remains pending business before the state legislatures because the 68th Congress did not specify a deadline within which the state legislatures must act upon the Child Labor Amendment. The Coleman v. Miller ruling formed the basis of the unusual and belated ratification of the 27th Amendment which was proposed by Congress in 1789 and ratified more than two centuries later in 1992 by the legislatures of at least three-fourths of the 50 states. The common legal opinion of federal child labor regulation reversed in the 1930s. Congress passed the Fair Labor Standards Act in 1938 regulating the employment of those under 16 or 18 years of age. The Supreme Court ruled unanimously in favor of that law in United States v. Darby Lumber Co. (1941), which overturned Hammer v. Dagenhart (one of the key decisions that had motivated those in favor of the Child Labor Amendment). After this shift, the amendment has been described as \"moot\" and effectively part of the Constitution; the movement for it had concluded. == Notes == ==References== == Other websites == *The Child Labor Amendment Debate of the 1920s , Bill Kaufmann, Ludwig Von Mises Institute, November 1992 *Labor: Children , a 1924 Time magazine article on the subject *Labor: A 20th Amendment? , a 1925 Time magazine article discussing 1920s attempts to ratify the Amendment Category:Proposed amendments to the United States Constitution Category:Child labour",
 "title": "Child Labor Amendment"
}