{
 "id": "536202",
 "text": "Valproate (VPA) is a drug. It has different forms, such as valproic acid, sodium valproate and valproate semisodium. It is mostly used to treat epilepsy and bipolar disorder. It is also used to stop migraines. It is useful to stop some types of seizures. It can be given intravenously or by mouth. Common side effects of this medication are sleepiness, dry mouth, weakness, vomiting and nausea. Serious side effects can include liver problems, pancreatitis and an increased suicide risk. Overdose and poisoning can happen (see 'overdose and poisoning') Valproate is known to cause birth defects and miscarriages in pregnant women who use the medicine, so it is not recommended for women who are pregnant or able to become pregnant to take Valproate. ==Overdose and poisoning== Too much valproic acid can result in wanting to sleep, shaking, near unconsciousness, trouble breathing (dyspnoea), coma, metabolic acidosis, and death. Normal amounts of valproic acid levels in blood plasma are from 20–100 milligrams per liter. 150–1500 milligrams of valproic acid per liter of blood plasma is very dangerous. ==Brand names== Branded products include: * Absenor (Orion Corporation Finland) * Convulex (G.L. Pharma GmbH Austria) * Depakene (Abbott Laboratories in US and Canada) * Depakine (Sanofi Aventis France) * Depakine (Sanofi Synthelabo Romania) * Depalept (Sanofi Aventis Israel) * Deprakine (Sanofi Aventis Finland) * Encorate (Sun Pharmaceuticals India) * Epival (Abbott Laboratories US and Canada) * Epilim (Sanofi Synthelabo Australia and South Africa) * Stavzor (Noven Pharmaceuticals Inc.) * Valcote (Abbott Laboratories Argentina) * Valpakine (Sanofi Aventis Brazil) ===Brand names of sodium valproate=== ====Portugal==== * Tablets - Diplexil-R by Bial. ====United States==== * Intravenous injection - Depacon by Abbott Laboratories. * Syrup - Depakene by Abbott Laboratories. (Note Depakene capsules are valproic acid). * Depakote tablets are a mixture of sodium valproate and valproic acid. * Tablets - Eliaxim by Bial. ====Australia==== *Epilim Crushable Tablets Sanofi *Epilim Sugar Free Liquid Sanofi *Epilim Syrup Sanofi *Epilim Tablets Sanofi *Sodium Valproate Sandoz Tablets Sanofi *Valpro Tablets Alphapharm *Valproate Winthrop Tablets Sanofi *Valprease tablets Sigma ====New Zealand==== *Epilim by Sanofi-Aventis All the above formulations are Pharmac-subsidised. ====UK==== * Depakote Tablets (as in USA) * Tablets - Orlept by Wockhardt and Epilim by Sanofi * Oral solution - Orlept Sugar Free by Wockhardt and Epilim by Sanofi * Syrup - Epilim by Sanofi- Aventis * Intravenous injection - Epilim Intravenous by Sanofi * Extended release tablets - Epilim Chrono by Sanofi is a combination of sodium valproate and valproic acid in a 2.3:1 ratio. * Enteric-coated tablets - Epilim EC200 by Sanofi is a 200-mg sodium valproate enteric-coated tablet. =====UK only===== * Capsules - Episenta prolonged release by Beacon * Sachets - Episenta prolonged release by Beacon * Intravenous solution for injection - Episenta solution for injection by Beacon ====Germany, Switzerland, Norway, Finland, Sweden==== * Tablets - Orfiril by Desitin Pharmaceuticals * Intravenous injection - Orfiril IV by Desitin Pharmaceuticals ====South Africa==== * Syrup - Convulex by Byk Madaus * Tablets - Epilim by Sanofi-synthelabo ====Malaysia==== * Tablets - Epilim by Sanofi-Aventis ====Romania==== * Companies are SANOFI-AVENTIS FRANCE, GEROT PHARMAZEUTIKA GMBH and DESITIN ARZNEIMITTEL GMBH * Types are Syrup, Extended release mini tablets, Gastric resistant coated tablets, Gastric resistant soft capsules, Extended release capsules, Extended release tablets and Extended release coated tablets ====Canada==== * Intravenous injection - Epival or Epiject by Abbott Laboratories. * Syrup - Depakene by Abbott Laboratories its generic formulations include Apo-Valproic and ratio- Valproic . ====Japan==== * Tablets - Depakene by Kyowa Hakko Kirin * Extended release tablets - Depakene-R by Kyowa Hakko Kogyo and Selenica-R by Kowa * Syrup - Depakene by Kyowa Hakko Kogyo ====Europe==== In much of Europe, Dépakine and Depakine Chrono (tablets) are equivalent to Epilim and Epilim Chrono above. ====Taiwan==== *Tablets (white round tablet) – Depakine (帝拔癲 / di-ba-dian) by Sanofi Winthrop Industrie (France) ====Israel==== * Depalept (equivalent of Epilim) * Depalept Chrono (extended release tablets; equivalent of Epilim Chrono) ==== India, Russia and CIS countries ==== * Valprol CR by Intas Pharmaceutical (India) * Encorate Chrono by Sun Pharmaceutical (India) * Serven Chrono by Leeven APL Biotech (India) ====Brand names of valproate semisodium==== * Brazil - Depakote by Abbott Laboratories and Torval CR by Torrent do Brasil * Canada - Epival by Abbott Laboratories * Mexico - Epival and Epival ER (extended release) by Abbott Laboratories * United Kingdom - Depakote (for psychiatric conditions) and Epilim (for epilepsy) by Sanofi- Aventis and generics * United States - Depakote and Depakote ER (extended release) by Abbott Laboratories and generics * India - Valance and Valance OD by Abbott Healthcare Pvt Ltd, Divalid ER by Linux laboratories Pvt Ltd, Valex ER by Sigmund Promedica, Dicorate by Sun Pharma * Germany - Ergenyl Chrono by Sanofi-Aventis and generics * Chile - Valcote and Valcote ER by Abbott Laboratories * France and other European countries -- Depakote * Peru - Divalprax by AC Farma Laboratories * China - Diprate OD ==References== Category:Drugs used in psychiatry Category:Carboxylic acids",
 "title": "Valproate"
}