{
 "id": "536678",
 "text": "The Institut supérieur de l'aéronautique et de l'espace (ISAE-SUPAERO; ) is a renowned graduate engineering school in France.Ecoles d'ingénieurs : l'Enac et Isae-Supaero dans le top 10 It is in a campus of the University of Toulouse (South France). Its different curricula lead to the following French & European degrees : * Ingénieur SUPAERO (SUPAERO Graduate engineer Masters level program) * Master of Science & Doctorat (PhD doctorate studies ) * Mastères Spécialisés (MS) (In partnership with the French Civil Aviation University) * Massive Online Open Course Academic activities and industrial applied research are performed mainly in French and English languages. Students from a lot of nationalities participate to the different curricula at SUPAERO. Most of the 1600 graduate engineer students at ISAE-SUPAERO live in dedicated residential buildings nearby research labs and metro public transports. == History == The school results from the École nationale supérieure de l'aéronautique et de l'espace (created In 1909) and the École nationale supérieure d'ingénieurs de construction aéronautique (created in 1946).Supaero et l'Ensica fusionnent == Admission == Admission to the Supaero engineering Programme implemented at ISAE is possible after two/three year scientific undergraduate studies and requires success to either: * an admission exam for Bachelors of Sciences ; * a French nationwide selective exam with numerus clausus : concours Mines-Ponts (3-year curriculum including at least 2 years in France) * a selective application as per Top Industrial Managers for Europe (TIME) double degrees procedures applicable in Europe (2+2-year curriculum, including 2 years in France) The Supaero Programme typically lasts three years and results in a master's degree, augmented with international experience. Thus undergraduate studies + the Supaero Programme account for more than a cumulated 300 ECTS credits as applicable in the European education system. However, graduate students enrolled in the TIME double degree procedure are required to spend two-years at ISAE and spend two years in the TIME-partner institute for a total of four years resulting in a double master's degree. == Research labs == Research activities at ISAE relate to the following topics: * Aerodynamics, energetics, propulsion * Mechanics of structure and materials * Electronics, optronics and signal * Mathematics, computer science, automatics * Languages, arts, cultures, societies * Aeronautics and Space Centre == Notable graduate == * Guy du Merle, French aerospace engineer, pilot and writer == References == == Further reading == * Official website Category:Technical colleges and universities in Toulouse Category:1909 establishments in France",
 "title": "Institut supérieur de l'aéronautique et de l'espace"
}