{
 "id": "536905",
 "text": "Ryan Drummond (born January 10, 1973) is an American actor, voice actor, mime and comedian. He is best known for voicing Sonic the Hedgehog in several installments of the Sonic the Hedgehog series from 1998 to 2004. He is also known for being the bass vocalist in the A.Y.U. Quartet since 1991. He has been starring in a musical comedy in San Diego called \"Forever Plaid\". ==Personal life== Drummond married his wife, Lisa Drummond, on October 8, 2002. They live in San Francisco, California. He and his wife, Lisa Drummond, are divorced in 2019. ==Filmography== ===Film=== Year Title Role 2000 Bring it On Theatre Boy 2008 Based on a True Story Hunter ===Television=== Year Title Role Notes 1997 Baywatch DJ Johnny Jam Episode: \"Baywatch at Sea World\" 1998 Two Guys, a Girl and a Pizza Place Isaac Glickstein Episode: \"Two Guys, a Girl and an Elective\" 2001 The Chronicle Andy Episode: \"What Gobbles Beneath\" 2001 The Invisible Man Mime, Scientologist 2 Episodes: \"Money for Nothing: Part 2\", \"Immaterial Girl\" 2004 Veronica Mars Roger Episode: \"You Think You Know Somebody\" 2005 Point Pleasant Booth Vendor Episode: \"Hell Hath No Fury Like a Woman Choked\" 2009 Trauma Fair Patron Episode: \"All's Fair\" 2011 Dual Suspects Robert Evans Episode: \"Fast Food Fatality\" ===Video game roles=== Year Title Role Notes 1998–99 Sonic Adventure Sonic the Hedgehog/Super Sonic 1999 Nancy Drew: Stay Tuned for Danger Rick Arlen 1999 Blue Stinger Eliot Ballade 1999 Twisted Metal 4 Pizza Boy 2000 Danger Girl Additional Voices 2000 Evil Dead: Hail to the King Merchant 2000 The Mummy Additional Voices 2000 Sonic Shuffle Sonic the Hedgehog/Super Sonic Knuckles the Echidna The first Sonic party game since Mario Party 1-2 and Crash Bash 2001 Undying Various, Additional Voices 2001 Illbleed Kevin Kertsman 2001 Airblade Insider 2001 Zax: The Alien Hunter Zax, Korbo, Villager 2001 Sonic Adventure 2 Sonic the Hedgehog/Super Sonic, Shadow the Hedgehog/Super Shadow (few lines) Celebrating Sonic's 10th Anniversary 2001-02 Sonic Adventure 2: Battle Sonic the Hedgehog/Super Sonic, Shadow the Hedgehog/Super Shadow (few lines) Remake of the original Sonic Adventure 2 game 2003 Chrome Additional Voices 2003 Rogue Ops Additional Voices 2003 Sonic Battle Sonic the Hedgehog Emerl (usually) 2003–04 Sonic Adventure DX: Director's Cut Sonic the Hedgehog/Super Sonic Uncut remake of the original Sonic Adventure game 2003–04 Sonic Heroes Sonic the Hedgehog/Super Sonic Metal Sonic (Neo Metal Sonic)/Metal Madness/Metal Overlord The first three- character trio game 2003–04 Duel Masters Additional Voices 2004 Gangland Black Boss, Bouncer, Croupier, Civilian, Sniper, Cop, Ninja, Additional Voices 2004 Spy Fiction Michael Kwain 2004 Sonic Advance 3 Sonic the Hedgehog/Super Sonic 2004 SEGA Superstars Sonic the Hedgehog/Super Sonic 2005 Call of Cthulhu: Dark Corners of the Earth J. Edgar Hoover, Seaman Willie Thompson, Experiment, Poorhouse Resident, Cutter Urania Seaman, Yithian, Additional Voices 2005 Cold War Carter, Scientist, Civilian 2006 Scared Rings Additional Voices 2008 The Godfather II: Crime Rings Bill Bardi 2009 The Godfather II Bill Bardi, Additional Voices 2009–10 Guitar Hero: Van Halen Additional Voices ==Albums== * S.C.R.A.M., 1994 studio album by the A.Y.U. Quartet - Harmony & Lead Vocals * Atomic Young Ultrasonics, 1996 studio album by The A.Y.U. Quartet - Harmony & Lead Vocals * Acappella Yuletide Uproar, 2010 studio album by The A.Y.U. Quartet - Harmony & Lead Vocals ==References== Category:American voice actors Category:1973 births Category:Living people Category:People from Lima, Ohio Category:Actors from Ohio",
 "title": "Ryan Drummond"
}