{
 "id": "537116",
 "text": "The following is a list of notable deaths in April 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==April== ===1=== *Pratyusha Banerjee, 24, Indian actress (Balika Vadhu, Bigg Boss 7, Hum Hain Na), suicide by hanging. *Artur Górski, 46, Polish politician, member of Sejm (since 2005), leukemia.Zmarł Artur Górski. Poseł PiS miał 46 lat *Emil Keres, 90, Hungarian actor (Twenty Hours) and theatre director.Meghalt Keres Emil ===2=== *Gato Barbieri, 83, Argentine jazz saxophonist, pneumonia. *Gallieno Ferri, 87, Italian comic book artist (Zagor, Mister No).Piange Zagor, lo ha lasciato il suo disegnatore Gallieno Ferri *Boris Hybner, 74, Czech actor (I'm All Good, Toys in the Attic, Marguerite) and mime artist. *László Sárosi, 84, Hungarian football player (national team) and coach.Gyász: elhunyt a Vasas ötszörös bajnoka, aki bent tartotta a Fradit ===3=== *Erik Bauersfeld, 93, American radio dramatist (KPFA) and voice actor (Star Wars, A.I. Artificial Intelligence, Crimson Peak). *Don Francks, 84, Canadian jazz vocalist and actor (La Femme Nikita, Inspector Gadget, I'm Not There), lung cancer. *Lars Gustafsson, 79, Swedish writer and scholar.Kulturpersonligheten Lars Gustafsson är död *Rowley Habib, 83, New Zealand writer. *Martin Lampkin, 65, English motorcycle trials rider, cancer. *Cesare Maldini, 84, Italian football player (national team) and manager (Foggia, Milan, national team).Morto a 84 anni Cesare Maldini, ex ct della nazionale *Joe Medicine Crow, 102, American Crow historian. *Lola Novaković, 80, Serbian singer.Preminula legendarna pevačica Lola Novaković *Amber Rayne, 31, American pornographic actress. *Jules Schelvis, 95, Dutch historian and Holocaust survivor.Sobibor- overlevende Jules Schelvis (95) overleden *Clarence Clifton Young, 93, American politician, member of the U.S. House of Representatives (1953–1957), Nevada Senate (1966–1980) and Nevada Supreme Court (1985–2002). ===4=== *Getatchew Mekurya, 81, Ethiopian jazz saxophonist, complications from diabetes. *Royston Nash, 82, English conductor (D'Oyly Carte Opera Company). *George Radosevich, 88, American football player (Baltimore Colts), congestive heart failure. *Mike Sandlock, 100, American baseball player (Brooklyn Dodgers). *Abe Segal, 85, South African tennis player, cancer. ===5=== *Zyta Gilowska, 66, Polish politician, Minister of Finance (2006, 2007), Deputy Prime Minister (2006, 2007). *Roman Gribbs, 90, American politician, Mayor of Detroit (1970–1974), cancer. *Zena Latto, 90, American jazz saxophonist. *E. M. Nathanson, 88, American author (The Dirty Dozen), heart failure. ===6=== *Merle Haggard, 79, American country music singer-songwriter (\"Okie from Muskogee\", \"The Fightin' Side of Me\", \"Carolyn\"), complications from pneumonia. *Darrell Hogan, 89, American football player (Pittsburgh Steelers), heart failure. ===7=== *László Bárczay, 80, Hungarian chess Grandmaster.Bárczay László (1936–2016) *Frank E. Denholm, 92, American politician, member of the House of Representatives from South Dakota (1971–1975). *Carlo Monti, 96, Italian athlete, Olympic bronze medalist (1948).Atletica, addio a Carlo Monti, sprinter elegante e scrittore ===8=== *Dick Alban, 87, American football player (Washington Redskins, Pittsburgh Steelers). *Mircea Albulescu, 81, Romanian actor (Michael the Brave, Capcana mercenarilor, Semne în pustiu) and writer, member of the Writers' Union of Romania, heart failure.A murit Mircea Albulescu *Wei Chueh, 88, Taiwanese Buddhist monk, founder of the Chung Tai Shan. ===9=== *Arthur Anderson, 93, American voice actor (Courage the Cowardly Dog), congestive heart failure. *Duane Clarridge, 83, American spy (CIA, Eclipse Group), complications from esophageal cancer. *Tony Conrad, 76, American avant-garde musician, composer, video artist and professor (University at Buffalo), prostate cancer. * Juris Ekmanis, 74, Latvian academic, President of Latvian Academy of Sciences (2004–2012), complications from a stroke. *Will Smith, 34, American football player (New Orleans Saints), Super Bowl champion (2010), shot. ===10=== *Louis Gladstone, 88, American politician. *Howard Marks, 70, Welsh cannabis smuggler, writer and legalisation campaigner, colorectal cancer. *Henryk Średnicki, 61, Polish boxer, amateur World Champion (1978). Henryk Średnicki, polski mistrz świata w boksie nie żyje ===11=== *Emile Ford, 78, Saint Lucian singer (\"What Do You Want to Make Those Eyes at Me For?\") and sound engineer. *Anne Gould Hauberg, 98, American arts patroness, founder of the Pilchuck Glass School. *Ed Snider, 83, American sports executive (Comcast Spectacor, Philadelphia Flyers, Philadelphia 76ers), bladder cancer. ===12=== *Hector A. Cafferata, Jr., 86, American soldier, Medal of Honor recipient. *Paul Carey, 88, American radio broadcaster (Detroit Tigers), complications from COPD. *Gianroberto Casaleggio, 61, Italian entrepreneur, co-founder of Five Star Movement.M5s, è morto Gianroberto Casaleggio *Pedro de Felipe, 71, Spanish footballer (Real Madrid, Espanyol).Muere Pedro de Felipe, uno de los héroes de la sexta Champions del Real Madrid *David Gest, 62, American producer and reality TV contestant (I'm a Celebrity...Get Me Out of Here!). *Anne Jackson, 90, American actress (Middle of the Night, The Shining, Blinded by the Light). *Balls Mahoney, 44, American professional wrestler (ECW), cardiac arrest. *Arnold Wesker, 83, British playwright, complications from Parkinson's disease. ===13=== *Mariano Mores, 98, Argentine tango composer and pianist. *Manouchehr Sotodeh, 102, Iranian geographer, respiratory failure. *Gareth Thomas, 71, Welsh actor (Blake's 7), heart failure. *Ray Thornton, 87, American attorney and politician, member of the United States House of Representatives from Arkansas (1973–1979, 1991–1997). *Nera White, 80, American Hall of Fame basketball player, complications from pneumonia. ===14=== *Nguyen Anh 9, 76, Vietnamese songwriter and pianist, pneumonia and heart failure.Tuấn Ngọc, Khánh Hà hát tưởng nhớ nhạc sĩ Nguyễn Ánh 9 *Ahmed Brahim, 69, Tunisian politician.Ahmed Brahim n’est plus *Ilija Ivezić, 89, Croatian movie actor (Last of the Renegades, The Golden Years, Marshal Tito's Spirit).U 90. godini umro je hrvatski legendarni glumac Ilija Ivezić *Malick Sidibé, 80, Malian photographer, complications of diabetes. *Liang Sili, 91, Chinese missile control scientist and academician (Chinese Academy of Sciences), vice-president of the International Astronautical Federation.梁启超之子中国火箭与导弹控制系统专家梁思礼逝世 *Sir David MacKay, 48, British author, physicist and professor (University of Cambridge), stomach cancer. ===15=== *Anne Grommerch, 45, French politician, member of the National Assembly (since 2008), Mayor of Thionville (since 2014), breast cancer.Anne Grommerch, députée et maire de Thionville, est morte ===16=== *Rubén Mendoza Ayala, 55, Mexican politician, cardiac arrest.Muere Rubén Mendoza Ayala a los 55 años víctima de un paro cardíaco *Jeanette Bonnier, 82, Swedish media proprietor (Bonnier Group), journalist (Expressen) and author, heart failure.Vi är för alltid din tidning, Jeanette *Rod Daniel, 73, American movie director (Teen Wolf), Parkinson's disease.Rod Daniel, Director of Michael J. Fox's Teen Wolf, Dies at 73 *William M. Gray, 86, American meteorologist. *Charlie Hodge, 82, Canadian ice hockey player (Montreal Canadiens, Oakland Seals, Vancouver Canucks) and scout, NHL champion (1956, 1958, 1959, 1960, 1965, 1966), complications from a stroke. *Louis Pilot, 75, Luxembourgian football player (Fola Esch, Standard Liège, Royal Antwerp) and manager (national team).Louis Pilot, ancien joueur et entraîneur du Standard, est décédé *Helmut Rohde, 90, German politician, Federal Minister of Education and Science (1974–1978).Helmut Rohde Unternehmensnachruf *Peter Rock, 70, Chilean rock musician and actor (Blood Sugar Baby), complications from ALS.Fallece a los 70 años el artista nacional Peter Rock *Kit West, 79, British special effects artist (Raiders of the Lost Ark, Dragonheart, Enemy at the Gates), Oscar winner (1982).Special Effects maestro Kit West overleden ===17=== *Cyril Leonoff, 91, Canadian civil engineer and historian. *Doris Roberts, 90, American actress (Everybody Loves Raymond, Remington Steele, Christmas Vacation). ===18=== *Yuri Bychkov, 84, Russian art historian.Ушел из жизни основатель маршрута «Золотое кольцо России» *Cox Habbema, 72, Dutch actress (To Grab A Ring, The Incorrigible Barbara, A Question of Silence), cancer.Actrice Cox Habbema (72) overleden *Eva Henning, 95, Swedish actress (Elvira Madigan, Flickan från tredje raden, The Firebird). *Sir John Leslie, 4th Baronet, 99, Irish aristocrat and media personality. *Johan van Minnen, 83, Dutch journalist and politician, member of the European Parliament (1979–1984).Oud-journalist Johan van Minnen overleden ===19=== *Patricio Aylwin, 97, Chilean politician, President (1990–1994), respiratory failure complicated from a fall. *Estelle Balet, 21, Swiss snowboarder, world champion (2015, 2016), avalanche. *Ronit Elkabetz, 51, Israeli actress and movie director (Gett: The Trial of Viviane Amsalem), cancer. *Walter Kohn, 93, American theoretical physicist, Nobel Prize in Physics laureate (1998), jaw cancer. *Mehrdad Oladi, 30, Iranian footballer (Malavan), heart attack.Iranian footballer dies at 30 *Milt Pappas, 76, American baseball player (Baltimore Orioles, Cincinnati Reds, Atlanta Braves, Chicago Cubs). *Billy Redmayne, 25, Manx motorcycle racer, race collision. ===20=== *Chyna, 45, American professional wrestler (WWF, NJPW, TNA) and actress (1 Night in China, 3rd Rock from the Sun, Illegal Aliens). *Guy Hamilton, 93, British movie director (James Bond, Battle of Britain, Evil Under the Sun). *Avril Henry, 81, British academic, suicide by euthanasia. *Dame Leonie Kramer, 91, Australian academic, author and university administrator, complications from Alzheimer's disease. *Harry Perkowski, 93, American baseball player (Chicago Cubs, Cincinnati Reds). *Victoria Wood, 62, British comedienne and actress (New Faces, Victoria Wood As Seen on TV, Dinnerladies), cancer. ===21=== *Hans Koschnick, 87, German politician and diplomat, Bremen Senate president and mayor (1967–1985), President of the Bundesrat (1970–1971, 1981–1982), MP (1987–1998), complications from pneumonia.Zum Tod von Hans Koschnick: Volkstribun und Friedensstifter *Marco Leto, 85, Italian movie and television director (Black Holiday, Al piacere di rivederla) and screenwriter.E’ morto il regista Marco Leto *Lonnie Mack, 74, American singer-guitarist (The Wham of that Memphis Man). *Michelle McNamara, 46, American writer.Michelle McNamara, Writer & Wife of Patton Oswalt, Dies at 46 *Prince, 57, American musician (\"Purple Rain\", \"Little Red Corvette\", \"When Doves Cry\") and actor (Purple Rain, Under the Cherry Moon, Sign o' the Times), Oscar (1984) and Grammy winner (1984, 1986, 2004, 2007). *Dene Smuts, 66, South African politician, MP (1989–2014). ===22=== *Jory Prum, 41, American audio engineer and video game developer (The Walking Dead, The Wolf Among Us, Brütal Legend), traffic collision.En av Norges mest sentrale spillutviklere er død *Peter Sellers, 94, New Zealand sports broadcaster. ===23=== *Ron Brace, 29, American football player (Boston College, New England Patriots), heart attack. *Miguel Picazo, 89, Spanish movie director (La Tía Tula), screenwriter and actor (The Spirit of the Beehive, Tesis).Muere el director Miguel Picazo, retratista del dolor de ‘La tía Tula’ *Madeleine Sherwood, 93, Canadian actress (Cat on a Hot Tin Roof, The Flying Nun). *Banharn Silpa-archa, 83, Thai politician, Prime Minister (1995–1996), asthma attack.Former PM Banharn dies at Sirira ===24=== *Nina Arkhipova, 94, Russian actress (Bountiful Summer, Prosnis i poy, Burnt by the Summer), complications from pneumonia. *Robert Dolan, 87, American marine geologist. *Manuel de la Torre, 94, American golf instructor, complications from a stroke. *Walter Jackson Freeman III, 89, American biologist, neuroscientist and philosopher, pulmonary fibrosis. *Perry O. Hooper, Sr., 91, American jurist, Chief Justice of the Supreme Court of Alabama (1995–2001). *Inge King, 100, Australian sculptor. *Tommy Kono, 85, American weightlifter, Olympic champion (1952, 1956), complications from liver disease. *Thinle Lhondup, 72, Nepalese actor (Himalaya), stomach cancer. *Benjamin Manglona, 78, Northern Mariana Islands politician, Lieutenant Governor (1990–1994), stroke. *Billy Paul, 81, American R&B; singer (\"Me and Mrs. Jones\"), pancreatic cancer. *Klaus Siebert, 60, German biathlon athlete and coach, world champion (1978, 1979), Olympic silver medalist (1980), lymphoma.Biathlon-Erfolgstrainer Klaus Siebert gestorben *Papa Wemba, 66, Congolese singer and musician, seizure. ===25=== *Martin Gray, 93, Polish Holocaust survivor and writer, heart attack.Shoah : mort à 93 ans de Martin Gray, le rescapé des camps et l’auteur d' »Au nom de tous les miens » *Michal Hornstein, 95, Canadian businessman and philanthropist.Décès du mécène Michal Hornstein *Tom Lewis, 94, Australian politician, Premier of New South Wales (1975–1976). *Mei Baojiu, 82, Chinese Peking opera artist, bronchospasm.京剧大师梅葆玖病逝 享年82岁 ===26=== *Vincent Darius, 60, Grenadian Roman Catholic prelate, Bishop of Saint George’s in Grenada (since 2002), cancer. *Amanullah Khan, 82, Pakistani Kashmir separatism activist (JKLF) and writer, COPD. *Lucy Kibaki, 75, Kenyan teacher and socialite, First Lady (2002–2013), heart attack. *Martin Szipál, 91, Hungarian photographer, prostate cancer.Meghalt Szipál Márton fotóművész *Harry Wu, 79, American human rights activist, founded the Laogai Research Foundation, heart attack. ===27=== *Toms, 87, Indian cartoonist (Boban and Molly). ===28=== *Óscar Marcelino Álvarez, 67, Argentine footballer (Panathinaikos).Πέθανε ο Όσκαρ Αλβαρέζ *Sir Edward Ashmore, 96, British officer in the Royal Navy, First Sea Lord (1974–1977). *Conrad Burns, 81, American politician, Senator from Montana (1989–2007), complications from a stroke. *Jenny Diski, 68, English writer (Nothing Natural, Rainforest), lung cancer. *Igor Fesunenko, 83, Russian journalist, foreign affairs writer and teacher (MGIMO).Умер международный обозреватель Игорь Фесуненко *René Hausman, 80, Belgian author and artist, heart failure. *Barry Howard, 78, English actor (Hi-de-Hi!), blood cancer. *Ingram Olkin, 91, American professor of statistics (Stanford University), complications from colon cancer. ===29=== *Alyson Bailes, 67, British diplomat, Ambassador to Finland (2000–2002), pancreatic cancer. *Renato Corona, 67, Filipino jurist, Chief Justice of the Supreme Court (2010–2012), complications from a heart attack. *Jok Church, 66, American cartoonist (You Can with Beakman and Jax), heart attack. *Dmytro Hnatyuk, 91, Ukrainian baritone opera singer.У Києві помер відомий оперний співак Дмитро Гнатюк *Chen Zhongshi, 73, Chinese writer (White Deer Plain), oral cancer. ===30=== *Daniel Aaron, 103, American writer and academic (Harvard University), co- founder of the Library of America, complications from pneumonia. *Daniel Berrigan, 94, American Roman Catholic priest, poet, peace activist, and ex- convict (Catonsville Nine). *Marisol Escobar, 85, American sculptor, pneumonia. *Uwe Friedrichsen, 81, German actor (Faust, Schwarz Rot Gold, Sesamstraße), complications from pneumonia.Uwe Friedrichsen ist tot *Sir Harry Kroto, 76, British chemist, laureate of the Nobel Prize in Chemistry (1996), complications from ALS. *Peter Thomas, 91, American narrator (Nova, Forensic Files). *Vasily Zvyagintsev, 71, Russian science fiction author, heart attack.Умер писатель Василий Звягинцев ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *04 Category:April 2016 events",
 "title": "Deaths in April 2016"
}