{
 "id": "537198",
 "text": "In the United States, each of the 50 states has its own state government. This means there are 50 separate state governments of the United States. ==Federal vs. state governments== The state governments are mostly set up in the same way as the federal government of the United States. However, the state and federal governments are not the same. Mostly, each state government controls things that have to do with its own state. The federal government controls things that affect the whole country. The United States Constitution divides power between the state governments and the federal government. The Founding Fathers of the United States wrote the Constitution this way to make sure that neither the federal government or the states could get too powerful.Adams, Willi Paul (2002). \"The Liberalism and Democratic Republicanism of the First American State Constitutions.\" In Peter Becker, Jürgen Heideking, and James A. Henrietta (eds.). Republicanism and Liberalism in America and the German States, 1750-1850. Cambridge University Press. pp. 127-146. . ==Legislature== Every state has its own state legislature, which makes laws that affect that state only. Each of the 50 states, except Nebraska, has a \"bicameral\" legislature. This means there are two different parts, called \"houses,\" to the legislature. Usually, the two houses are called the Senate and the House of Representatives. Nebraska has a \"unicameral legislature, meaning it only has one house: the Senate. Different states have different names for their legislatures: * 26 states call their legislatures \"the Legislature\" * 19 states call their legislatures \"the General Assembly\" * North Dakota and Oregon use the name \"Legislative Assembly * Massachusetts and New Hampshire use the name \"General Court\" * Nebraska calls its entire unicameral legislature \"the Senate\" These next two sections will talk about the bicameral state legislatures (the ones with two different parts (unlike Nebraska). ===The Senate=== One of the two different houses of the state legislatures is called the Senate. Sometimes it is called the State Senate, to make it clear that it is different from the federal government's United States Senate. Until 1964, state senators were often elected from districts that were based on county lines. Sometimes, many more people would live in one district than another. In almost all of the states, people in rural areas got much greater representation from their senators. In other words, an urban county and a rural county would have the same number of senators. However, the rural county would have far fewer people. This meant it was easier for these people to get attention from their senators, and get their senators to do what they wanted. However, in the 1964 decision Reynolds v. Sims, , the United States Supreme Court ruled that state senators had to cover districts that had about the same number of people in them. This is different than the United States Senate, where every state gets two United States Senators, no matter how many people live there. ===The House of Representatives=== The second house in the state legislatures is usually called the House of Representatives. However, nine states use different names for this house: * Maryland, Virginia, and West Virginia call it \"the House of Delegates\" * California and Wisconsin call it \"the State Assembly\" * New Jersey uses the name \"the General Assembly\" * Nevada and New York just call it the \"Assembly\" ==Executive== Every state has a Governor, who is in charge of the state's executive branch of government. The people in that state elect the Governor. In most states, the people also elect other important members of the executive branch. These people work for the Governor. For example, they may include: * A Lieutenant Governor. This person and the Governor are often elected as a team (like the President and the Vice President) * A state Attorney General * A state Secretary of State In most state governments, \"departments\" are the most powerful part of the executive branch. The secretary of a department is usually a member of the Governor's cabinet (a group of people who give the Governor advice). The members of the cabinet also keep the Governor up to date on whatever is happening in all the different executive agencies. Each department may include divisions, offices, and/or agencies. Every state government is allowed to organize its executive departments and agencies any way it wants. Because of this, each state government is organized in a different way. The executive branch may also include many other organizations. These may include commissions, councils, offices, corporations, or many other things. A department or division might be in charge of these organizations, or they might be independent. ===Example: Arizona=== Arizona's government gives an example of how all these people, departments, commissions, and other options might be organized. Here is a very basic summary of Arizona's executive branch: * Governor ** Secretary of State, Attorney General, Treasurer, and seven other elected officials *** State agencies (some of the largest are the Department of Corrections; Department of Health Services; Juvenile Corrections; and Department of Transportation) **** Boards and commissions (like the Board of Nursing; Board of Education; and the Commission of Parks) ==Judiciary== Each state has a few different kinds of state courts. Trial courts are the first level of state courts. Here, people can file lawsuits. People charged with crimes are also tried here and found guilty or not guilty. There are also special kinds of trial courts, like: * Juvenile courts (for children who have committed crimes or often behave badly) * Divorce courts * Family courts (which deal with problems like child abuse and neglect, and also do adoptions) In most states, appeals courts (also called \"appellate courts\") are the next level of state courts. If someone who went to a trial court thinks that court made the wrong decision, they can appeal to an appellate court. That court can decide to reverse the lower (less powerful) trial court's decision. The appeals courts can do this if the trial court made a legal mistake. Finally, most states have a supreme court. This is the most powerful court in the state. If a person has already appealed to the appellate courts, and they still think the court's decision was wrong, they can appeal to the state supreme court. Once the state supreme court makes a decision, that decision becomes state law. The decision can only be changed or reversed by federal courts. That can only happen if the federal courts think the state supreme court made a decision that violated the Constitution. Each state's constitution or legislature spells out what type of courts the state will have, how they will work, and how judges will be chosen. Like with state executive departments, state courts can be very different from state to state. ==References== ==Other websites== * Learn more about state courts and what they do Category:State government in the United States",
 "title": "State governments of the United States"
}