{
 "id": "537201",
 "text": "This page is a list of the amendments to the United States Constitution. Since the Constitution went into effect on March 4, 1789, twenty-seven amendments have been added to the Constitution. This page gives just a short summary of each of these amendments. For more information about each amendment, click on the links in the box at the right of this page. The amendments are numbered in Roman numerals from I (One) to XXVII (Twenty-seven). ==Background== Usually, for an amendment to be approved and added to the Constitution, there are two steps: * Two-thirds of both the United States Senate and the United States House of Representatives approve the amendment. They \"propose\" the amendment to the states (they send the amendment to the states to be ratified) * The legislatures of three-fourths of the states must ratify the amendment Once this happens, the amendment becomes part of the Constitution. The first ten amendments to the Constitution were all approved together. As a group, they are called the Bill of Rights. ===Unratified amendments=== Between 1789 and December 2014, about 11,623 amendments were proposed in Congress. However, most of these suggested amendments \"die\" in the committees that suggest them. In total, in the past 227 years, Congress has sent only 33 amendments to the states for ratification just about one out of every 500 suggested amendments. Of these 33, the states have set 27. Out of the six unratified amendments, two failed when they were not ratified by a set deadline. The other four are still officially \"pending\"; they do not have enough votes to pass or fail, but they also do not have deadlines written into them. ==Ratified amendments== ===The Bill of Rights (Amendments IX)=== Congress sent twelve amendments to the states for ratification on September 25, 1789.U.S. Congress, House. The Constitution of the United States of America, As Amended, H. Doc. 102-188, 102nd Cong., 2nd sess., (Washington: GPO, 1992). Ten of these were officially ratified on December 15, 1791: two years, two months, and 20 days after Congress proposed them. Here is a summary of what those amendments say. # What Does it Mean? 1st The government may not set an official state religion. It also may not keep people from having freedom of religion, freedom of speech, freedom of the press, freedom of assembly, or the right to petition the government to fix problems. 2nd A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear arms, shall not be infringed. 3rd Makes it illegal for soldiers to stay in private homes during peace times without the owners' permission. 4th The government cannot search your house or seize things you own without being fairly sure you are doing something illegal 5th The government may not just take a person's home or land without paying them. Before a person is charged with a crime, a grand jury must agree that there is enough evidence to send him to trial. The person has due process rights. He does not have to say anything that would make him seem guilty. If he is found not guilty once, he cannot be tried again for the same crime. 6th When a person is charged with a crime, they have a right to a fair, quick trial, decided by a jury. The trial must be public (not secret). They have the right to be told what they are being charged with; ask their accuser questions; call witnesses to testify for them; and get a lawyer. 7th People have the right to a trial by jury in some lawsuits. 8th Makes it illegal to give people cruel and unusual punishments, or very large fines or bail 9th Says that the Constitution did not include every right that Americans have. If rights were not listed in the Constitution, that does not mean that Americans do not have those rights. 10th Says that the federal government only has the powers that the states or the Constitution gave to it. The states have power over everything that was not assigned to the federal government in the Constitution. ===Amendments 1127 (XIXXVII)=== # What Does it Mean? Ratification Proposed: Ratified On: Ratification Took: 11th The states cannot be sued by people who live in other states or countries; the states can only be sued by their own citizens. Passed because the states were angry about the Supreme Court's decision in Chisholm v. Georgia. Overturned Chisholm v. Georgia March 4, 1794 February 7, 1795 11 months 3 days 12th Changed the way the President and the Vice President are elected December 9, 1803 June 15, 1804 6 months 6 days 13th Made slavery illegal in the United States. Also made involuntary servitude (being forced to work, often for very little pay) illegal, except as punishment for a crime. January 31, 1865 December 6, 1865 10 months 6 days 14th Promises due process rights before taking away \"life, liberty, or property\" (the Due Process Clause). Promises the country will give everyone \"the equal protection of the laws\" (the Equal Protection Clause). Says that all people born in the U.S. or naturalized here are citizens. Also deals with post-Civil War issues. June 13, 1866 July 9, 1868 2 years 0 months 26 days 15th Gave African-Americans and ex-slaves the right to vote. Orders that no one should be unable to vote because of their race, skin color, or having been a slave in the past. February 26, 1869 February 3, 1870 11 months 8 days 16th Allows Congress to start and collect an income tax without basing taxes on the states' populations July 12, 1909 February 3, 1913 3 years 6 months 22 days 17th Allows the people to elect United States Senators by voting. May 13, 1912 April 8, 1913 10 months 26 days 18th Made it illegal to make or sell alcohol in the United States. Repealed on December 5, 1933 December 18, 1917 January 16, 1919 1 year 0 months 29 days 19th Gives women the right to vote June 4, 1919 August 18, 1920 1 year 2 months 14 days 20th Changes the date when the terms (times in office) begin, for the President and Vice President (to January 20), and United States Senators and Representatives (to January 3). March 2, 1932 January 23, 1933 10 months 21 days 21st Repeals the Eighteenth Amendment, making alcohol legal in the U.S. again. Allows each state to decide for itself whether to make alcohol illegal or make rules to control it. February 20, 1933 December 5, 1933 9 months 15 days 22nd Limits the number of times that a person can be elected president. A person cannot be elected president more than twice. If a person has served more than two years of a term to which someone else was elected (for example, if the President died and the Vice President took over for him), that person cannot be elected more than once. March 24, 1947 February 27, 1951 3 years 11 months 6 days 23rd Gives Washington, D.C. electors in the Electoral College. D.C. gets as many electors as the state with the least number of people. June 16, 1960 March 29, 1961 9 months 12 days 24th Makes it illegal to keep people from voting because they have not paid a poll tax or any other tax. September 14, 1962 January 23, 1964 1 year 4 months 27 days 25th Makes rules about who would become president if the President became disabled or died. Also makes rules about who would become Vice President if he had to take over for the President or died. July 6, 1965 February 10, 1967 1 year 7 months 4 days 26th Lowers the legal voting age to 18, allowing 18- to 20-year-old United States citizens to vote. March 23, 1971 July 1, 1971 3 months 8 days 27th Says that if there are changes to Congress's salaries, they will not take effect until the next election of Representatives. September 25, 1789 May 7, 1992 202 years 7 months 12 days ==Unratified amendments== Title Subject Status Congressional Apportionment Amendment Would strictly control the size of congressional districts that United States Congressmen could cover. Pending since September 25, 1789 Titles of Nobility Amendment Would take away citizenship from any United States citizen who accepts a title of nobility from another country. Pending since May 1, 1810 Corwin Amendment Would make it impossible for Article Five of the Constitution, which allows for amendments, to affect or change the states' \"domestic institutions\" (slavery). Would make it impossible for Congress to end slavery by using a constitutional amendment. Pending since March 2, 1861 Child Labor Amendment Would give the federal government the power to limit, control, and ban child labor. Pending since June 2, 1924 Equal Rights Amendment Would have made it illegal for the federal or state governments to refuse equal rights to men and women. Initial ratification period ended March 22, 1979 and extension period ended June 30, 1982; amendment failed. District of Columbia Voting Rights Amendment Would have given Washington, D.C., the same representation as a state in Congress, the Electoral College, and constitutional amendments. This would have included repealing the 23rd Amendment. Ratification period ended August 22, 1985; Amendment failed. ==Notes== ==References== Category:United States Constitution",
 "title": "List of amendments to the United States Constitution"
}