{
 "id": "537382",
 "text": "Convict leasing was a form of forced labor used by prisons in the Southern United States. (\"Convict\" is a rude word for \"prisoner\"; leasing is like renting something.) Under the system, prisons leased prisoners out as free workers to corporations, business owners, and plantation owners. Basically, the prisons were selling prisoners like slaves, except that they were not sold forever. This system made a lot of money for prisons and the contractors. The contractors got workers who they did not have to pay, and who they could treat however they wanted. The prisons got payments from the contractors. Also, they no longer had to pay for food, clothing, or housing for the prisoners who they leased out; the contractors did. In 1898, for example, about 73% of Alabama's entire yearly state revenue came from convict leasing.Perkinson, Robert. Texas Tough: The Rise of America's Prison Empire, (2010) , p. 105 For this reason, convict leasing lasted almost 100 years in the South. ==Beginnings== The state of Louisiana leased out convicts as early as 1844.Banks, Cyndi (2005). Punishment in America: A Reference Handbook. ABC-CLIO. p. 58. . However, convict leasing began to spread throughout the South during the Reconstruction Era (1865–1877). This was just after the end of the American Civil War, which ended slavery. With no more slaves to work for them, Southern farmers and businessmen needed to find new workers. Southern legislatures passed laws called Black Codes to keep blacks from moving freely and to force them to work for whites. As historian Douglas Blackmon explains: At this time, the Southern states did not have much money, and they found that convict labor gave them a big source of revenue. Contractors also made money off the system because they did not have to pay the prisoners the wages they would have to pay to white workers. The Thirteenth Amendment to the United States Constitution had made slavery illegal except as punishment for a crime. So the states passed laws that would make it easy to convict innocent black people of crimes. Once they were prisoners, they could be treated like slaves. The states basically used this process as a way to continue slavery in the South. ==Conditions== Northern states sometimes contracted for prison labor. However, in the South, the state gave complete control of prisoners to contractors.Lichtenstein, Alex (1996). Twice the Work of Free Labor: The Political Economy of Convict Labor in the New South. Verso Press. p. 3. . Also, according to historian Matthew Mancini, the Southern convict labor system was \"one of the harshest and most exploitative labor systems known in American history.\"Mancini, Matthew J. (1996). 'One Dies, Get Another': Convict Leasing in the American South, 1866-1928. South Carolina University Press. p. 1. . 'If one [prisoner] dies, get another' was the attitude of many contractors, Mancini writes. He says this was caused by corruption, racism, racial violence, and the fact that contractors could do whatever they wanted without getting into trouble. Prisoners were often treated very badly. Unlike during slavery, the contractors had not paid very much for the prisoners, and they would not have them forever. For these reasons, contractors had very little Prisoners could be beaten or whipped if their bosses did not think they were working hard enough. They were abused by guards. One source says: \"Mines and plantations that used convict laborers commonly had secret graveyards containing the bodies of prisoners who had been beaten and/or tortured to death. Convicts would be made to fight each other, sometimes to the death, for the amusement of the guards and wardens.\" Almost all of the prisoners who were leased out were African Americans, mostly adult males. This was because laws were enforced much more against black people, and blacks usually got much more severe sentences for \"crimes\" because of racism.Litwack, Leon F. (1998). Trouble in Mind: Black Southerners in the Age of Jim Crow. Knopf. p. 271. . U.S. Steel is one of the American companies which have admitted using African- American leased convict labor. Convict leasing was most common around 1880. It was formally outlawed by the last state (Alabama) in 1928. However, it continued in different forms until President Franklin D. Roosevelt made it illegal on December 12, 1941. ==The system in different states== Here are some examples of different states' convict leasing systems. State Started Ended Notes Source Alabama 1846 1928 Death rates of leased prisoners in Alabama were 10 times higher than death rates of prisoners in states that did not lease their prisoners Georgia 1868 1908 Prisoners worked mostly on railroads Florida 1877 1923 Prisoners usually worked in turpentine factories and lumber camps. System ended in 1923 after the Martin Tabert case. He was sentenced to one year of hard labor for riding a train without a ticket. He got sick working in the swamps, was whipped 50 times for not doing his work, and died that day. Tennessee 1866 1894 In the Coal Creek War of 1891, free mine workers burned down prison stockades, freeing hundreds of black convict laborers The state reacted by creating a mine at one of its prisons and ran it using prisoner labor until 1966 Texas 1883 1910 Texas leased an entire prison to three businessmen. after, it leased out prisoners mostly to large plantations. It ended the convict lease system when it realized buying its own farmland and making the inmates work that would bring in more money. Once they stopped using the convict labor system, many states switched to the trusty system. This was also a way to save money, but it caused abuses just like the convict labor system did. Finally, in a landmark case called Gates v. Collier, 501 F.2d 1291 (5th Cir. 1974), a federal court forced the states using the trusty system to stop.Gates v. Collier, 501 F.2d 1291 (5th Cir. 1974). ==Effects on the prison population== Scholar Randall Shelden argues that the convict lease system created an incentive to convict black people. Because the convict lease system brought in so much money, the states and counties had a reason to want to convict African-Americans. This is why the people in Southern prisons became mostly African-American after the Civil War, Sheldon writes. For example, in Louisiana's main prison in Nashville: * On October 1, 1865, African-Americans made up 33% of the prison's population (at this time, the Civil War had just ended five months before) * On November 29, 1867, African- Americans had increased to 58.3% of the prison's population * By 1869 they made up 64% * Between 1877 and 1879, they made up 67% During the times when Southern states used the convict leasing system, their prison populations grew across the South. For example: In This State: In This Year: Prisoner Population Was: 'By This Year: Prison Population Was: Percent Increase Alabama 1869 374 1903 1,878 504% Alabama 1903 1,878 1919 2,453 130.6% Florida 1881 125 1904 1,071 860% North Carolina 1870 121 1890 1302 1076% Georgia 1868 * 1908 * 1000% Mississippi 1871 * 1879 * 400% * Numbers not available ==Photo gallery== File:Convicts (1903).jpg|Child \"convicts\" at work in the fields (1903) File:Chain Gang Street Sweepers, 1909.jpg|A photo postcard of prisoners sweeping the streets (1909) File:Parchman prison convict labor 1911.jpeg|Prisoners working at the Mississippi State Penitentiary at Parchman in 1911. File:Prisonlabor1.jpg|Prisoners cut wood in South Carolina ==Notes== ==Related pages== * Slavery * Reconstruction Era * Trusty system ==References== Category:19th century in the United States Category:20th century in the United States Category:African-American history Category:Human rights abuses Category:Imprisonment and detention",
 "title": "Convict lease"
}