{
 "id": "537579",
 "text": "Sagas are stories mostly about ancient Nordic and Germanic life. Some are entirely invented, and some have an historical basis. They tell about early Viking voyages, the battles that took place during the voyages, about migration to Iceland and of feuds between Icelandic families. They were written in the Old Norse language, mainly in Iceland.Old Norse saga, class of heroic prose narratives (Merriam-Webster) The texts are tales in prose which share some similarities with the epic, often with stanzas or whole poems in alliterative verse embedded in the text, of heroic deeds of days long gone, \"tales of worthy men,\" who were often Vikings, sometimes pagan, sometimes Christian. They are sometimes romanticised and fantastic, but always dealing with human beings one can understand. De islandske sagaer by Peter Hallberg, Stockholm: Svenska bokförlaget, BonniersVésteinn Ólason 1998. Dialogues with the Viking age: narration and representation in the sagas of the Icelanders. Heimskringla. The best sagas are recognised as fine literature. Njál's Saga, or the Saga of Burnt Njál, is one of the most famous.Magnusson, Magnus. 1987 [1960]. Introduction, Njal's Saga. Penguin Classics. Thorsteinn Gylfason. 1998. Introduction, Njál's Saga. Wordsworth Classics. In Old English (Anglo- Saxon), Beowulf is a saga written in England, and so is the later Gawain and the Green Knight, written in a West Midlands dialect. These are both works of the imagination, but Layamon's Brut (about 1200 AD) is based on English history since the Anglo-Saxon Chronicle. ==Sagas of Icelanders== \"The Icelandic sagas are the backbone of all ... literature\" from the Nordic countries, says Roy Jacobsen (en), a translator of Sagas of Icelanders, and author.Roy Jacobsen. \"Gersimi Mikla: Sagaene er realisme av edleste vare. De er paradoksale, tvetydige, klassiske, moderne. Den store veven\" Gersimi Mikla: the sagas are realism, as pure as it comes. The sagas have paradoxes, the sagas can be interpreted in more than one way; they are classic and modern. The large web. 2016-02-20. Klassekampen. p. 5. http://www.klassekampen.no/article/20160220/PLUSS/160229955, ===List of the Sagas of Icelandic’s === *The saga of Gísli Súrsson; or Gísla saga - (two versions) of an outlaw poet – Gísla saga *The saga of the people of Eyri;Byock, Jesse. Viking Age Iceland. Penguin Books Ltd; London, 2009. Page 99. or Eyrbyggja saga *Ljósvetninga saga *Vatnsdøla *The Saga of the People of Laxárdalr; or Laxdøla saga *Valla-Ljóts saga *The Saga of Hen-Thorir; or Hænsna-Þóris saga *The saga of Gunnlaugr Snake-tongue; or Saga of Gunnlaugr Serpent-Tongue *Bandamanna saga *Egil's Saga *Hardar saga; or Harðar saga ok Hólmverja *Rankel saga * Bárðar saga Snæfellsáss * Bjarnar saga Hítdœlakappa * Droplaugarsona saga * Eiríks saga rauða – Saga of Erik the Red * Færeyinga saga * Finnboga saga ramma * Fljótsdæla saga * Flóamanna saga * Fóstbrœðra saga (two versions) * Grettis saga - Saga of Grettir the Strong * Grœnlendinga saga – Greenland saga * Gull-Þóris saga * Gunnars saga Keldugnúpsfífls * Hallfreðar saga (two versions) * Harðar saga ok Hólmverja * Hávarðar saga Ísfirðings – The saga of Hávarður of Ísafjörður * Heiðarvíga saga * Hrafnkels saga * Hrana saga hrings (post-medieval) * Kjalnesinga saga * Kormáks saga * Króka-Refs saga * Laurentius Saga * Ljósvetninga saga (three versions) * Njáls saga * Reykdœla saga ok Víga-Skútu * Svarfdœla saga * Valla-Ljóts saga * Víga- Glúms saga * Víglundar saga * Vápnfirðinga saga * Þorsteins saga hvíta * Þorsteins saga Síðu-Hallssonar * Þórðar saga hreðu * Ölkofra saga == References == Category:Norse mythology",
 "title": "Saga"
}