{
 "id": "53763",
 "text": "Falun Gong (also known as Falun Dafa) is a spiritual discipline from China founded in 1992.Statement of Professor David Ownby , Unofficial Religions in China: Beyond the Party's Rules, 2005. Quote: \"The history of Falun Gong, and of the larger qigong movement from which Falun Gong emerged (...) The Falun Gong emerged in 1992, toward the end of the boom, and was in fact one of the least flamboyant of the schools of qigong\" People who follow Falun Gong do five exercises similar to Tai chi chuan, which they believe will make them healthier and better people. They also read books written by Li Hongzhi, the movement's founder. They believe in \"Truthfulness, Compassion and Forbearance\". It is not known how many people practice Falun Gong today. The Chinese government suggests there were 70 million practitioners in China in 1998.Notoriety Now for Movement's Leader A Falun Gong website claims there are 100 million practitioners in more than 80 countries.\"Answers to Commonly Asked Questions about Falun Gong\", Falun Dafa Clearwisdom.net, retrieved June 10, 2006 == Made illegal in China == Also see: Religious persecution and Organ trade In 1999, the Communist Party of China (CCP) made it illegal to practice Falun Gong.\"China Bans Falun Gong\", (July 22, 1999) People's Daily Online, retrieved June 14, 2006 This ruling came after a big Falun Gong gathering in front of a Chinese government building. The government claimed the group spread superstitions, but others have suggested that Falun Gong's popularity challenges the CCP's power.Julia Ching, \"The Falun Gong: Religious and Political Implications,\" American Asian Review, Vol. XIX, no. 4, Winter 2001, p. 12 As of 2008, according to some human rights organizations, over 3000 Falun Gong followers were jailed and tortured to death.Mary-Anne Toy, Underground existence for Falun Gong faithful, The Age, July 26, 2008. Reporter Ethan Gutmann said about 65,000 Falun Gong people were killed for their body parts from 2000 to 2008.Ethan Gutmann (10 March 2011) \"How many harvested?\" revisited eastofethan.com Many people and organizations outside of China have called for the Chinese government to stop jailing and killing Falun Gong people.The crackdown on Falun Gong and other so-called heretical organizations , Amnesty International, 23 March 2000U.S. Congress Unanimously Passes (with no disagreement among the voting) Resolution Calling on Jiang Zemin Regime to Cease Persecution of Falun Gong , Falun Dafa Information Center, July 25, 2002 ==References== ==Other websites== * Falun Dafa Website Category:Politics of the People's Republic of China Category:Religion in China Category:New religious movements",
 "title": "Falun Gong"
}