{
 "id": "538107",
 "text": "Electromagnetic hypersensitivity (EHS) is a condition where a person feels unwell, which people who have it believe it to be due to being near electromagnetic fields. Other names for it include electrohypersensitivity, electro-sensitivity, and electrical sensitivity (ES). Wi-Fi allergy is a form of EHS.Mindy Weisberger; Wi-Fi 'Allergies': Is Electromagnetic Hypersensitivity Real?, Livescience, 3 December 2015. (Retrieved 15 March 2016). According to the World Health Organization, EHS is described by vague symptoms that are different in each person. The symptoms are real and can be weak or strong and can make some disabled. There is no specific list of features to diagnose someone, and there is no scientific link between electromagnetic fields and how people feel. EHS is not a medical diagnosis. People who claim to have EHS blame it for headaches, fatigue, stress, sleep disturbances, skin symptoms like prickling, burning sensations and rashes, pain and aches in muscles, and many other health problems. Although electromagnetic fields can make the body hot, people who say they have EHS say they feel sick at very low levels. Most experiments show that people who claim to have EHS can't correctly tell if they are near EM radiation or not, and the medical and scientific communities don't think its a real illness. Several double-blind experiments suggest that people who say they have EHS can't detect if electromagnetic fields are present, and are just as likely to report feeling sick after a phony exposure as they are after real exposure, making scientists think it is the nocebo effect. ==Popular culture== In the TV show Better Call Saul, Jimmy McGill's brother Chuck stays at home and believes he suffers from electromagnetic hypersensitivity.Better Call Saul: is electromagnetic hypersensitivity a real health risk? , The Guardian (retrieved 7 Oct 2015).Better Call Saul's Michael McKean talks Chuck's condition and warns: do not know me too quickly , Radio Times (retrieved 7 Oct 2015).Kayla Cobb, You Catch-Up Guide To ‘Better Call Saul’ Season One, Decider, 4 February 2016. Quote; \"...but the doctor does prove to Jimmy that Chuck’s disease is all in his head.\" (retrieved 13 March 2016)Geoff Berkshire; ‘Better Call Saul’ Q&A;: Michael McKean Talks Chuck and Jimmy’s Parents, Mike’s Past, Variety. (Retrieved 13 March 2016) ==Related pages== * Wi-Fi Safety ==References== Category:Electromagnetism Category:Health problems",
 "title": "Electromagnetic hypersensitivity"
}