{
 "id": "538282",
 "text": "École nationale supérieure de techniques avancées (ENSTA ParisTech) is a engineering graduate school in France. It is in a campus of the University of Paris-Saclay.Ensta ParisTech Its different curricula lead to the following French & European degrees : * Ingénieur ENSTA ParisTech (ENSTA ParisTech Graduate engineer Masters level program) * Master of Science * Mastères Spécialisés (MS) * Massive Online Open Course.ENSTA Paristech Academic activities and industrial applied research are performed mainly in French and English languages. Students from a dozen of nationalities participate to the different curricula at ENSTA ParisTech. Most of the 600 graduate engineer students at ENSTA ParisTech live in dedicated residential buildings nearby research labs and metro public transports. == Admission == Admission to the \"ENSTA ParisTech engineering Programme\" implemented at ENSTA ParisTech is possible after two/three year scientific undergraduate studies and requires success to either: * an admission exam for Bachelors of Sciences ; * a French nationwide selective exam with numerus clausus : concours Mines-Ponts (3-year curriculum including at least 2 years in France) * a selective application as per Top Industrial Managers for Europe (TIME) double degrees procedures applicable in Europe (2+2-year curriculum, including 2 years in France) The \"ENSTA Programme\" typically lasts three years and results in a master's degree, augmented with international experience. Thus undergraduate studies + the ENSTA Programme account for more than a cumulated 300 ECTS credits as applicable in the European education system. However, graduate students enrolled in the TIME double degree procedure are required to spend two-years at ENSTA ParisTech and spend two years in the TIME-partner institute for a total of four years resulting in a double master's degree. == Research labs == Research activities at ENSTA ParisTech relate to the following topics: *Chemistry and Processes Unit (UCP) *Electronics-IT-robotics Unit (U2IS) *Applied Mathematics Unit (UMA) *Mechanics Unit (UME) *Applied Optics Unit (UOA) *Applied Economics Unit == Notable alumni == * Valérie Cornetet, head of the Institut Polytechnique des Sciences Avancées == References == == Further reading == * Official website Category:Technical colleges and universities Category:Universities in Paris Category:1741 establishments Category:18th- century establishments in France Category:1740s establishments in Europe",
 "title": "ENSTA Paris"
}