{
 "id": "538387",
 "text": "In the United States, people have to pay income taxes to the United States government, most state governments, and many local governments. This means that people have to pay taxes to these governments, based on how much money they earn. ==Introduction== Income taxes are based on what a person earns in one calendar year between January 1 and December 31. When it takes income taxes, the government takes a percentage of a person's income. This percentage is called an income tax rate. In other words, the income tax rate is the part, or portion, of a person's income that the government takes. The United States government, and most states, use progressive tax rates. This means that as a person earns more income, their income tax rate gets higher. In other words, as a person earns more money, they have to pay more taxes. Every year, the government divides incomes into categories. These categories are called tax brackets. Each tax bracket includes a range of incomes the lowest and highest amounts a person could earn to be in that tax bracket. Tax brackets are important because each one is taxed at a different tax rate. In other words, a person in a higher income category has to pay a larger percentage of their income in taxes. The tax rates for each different tax bracket are called marginal tax rates. For example, in 2016, these are the tax brackets and marginal tax rates for single people: If a person earns this much income (They are in this tax bracket): The government can take this percentage of their income (This is their marginal tax rate): $0 $9,275 10% $9,276 $37,650 15% $37,651 $91,150 25% $91,151 $190,150 28% $190,151 $413,350 33% $413,351 $415,050 35% $415,051 and above 39.6% ===Not all income is taxed at the same rate=== However, this does not mean that a person making $415,051 is paying 39.6% of that entire $415,051 in income taxes. Tax rates in the United States are marginal. This means that different portions of a person's income get taxed at different rates. For example, if a person earns $9,276 in a year, they do not have to pay 15% of that whole amount. The first $9,275 that they earned falls into the first tax bracket ($0 $9275, which has a 10% tax rate). The person pays the 10% tax rate for all of their income that fell into that tax bracket. The person has only $1 left in income that falls into the next tax bracket ($9,276 $37,650). They only have to pay that tax bracket's tax rate of 15% on that one dollar. In other words, what the chart above really means is that in 2016, for a single person: A person will have to pay this tax rate: For this part of their income ONLY: 10% Anything between $0 $9,275 15% Anything above $9,275, up to $37,650 25% Anything above $37,650, up to $91,150 28% Anything above $91,150, up to $190,150 33% Anything above $190,150, up to $413,350 35% Anything above $413,350, up to $415,050 39.6% Anything above $415,050 ==Not all income is taxable== Usually, the government uses a person's gross income to decide how much they should be taxed. A person's gross income is every dollar they have earned in a year. However, there are some types of income that the government cannot take as part of income taxes. ===Deductions=== Deductions are certain kinds of costs that the government does not tax. The government will decrease (or \"deduct\") these costs from a person's gross income. This means the government will be taxing the person on less income. There are many kinds of deductions. There are some deductions that anyone who pays taxes can take. For example, if a person has paid to move, paid into a retirement fund, or paid student loan interest, they can take these costs off their gross income. The government will not tax these costs. The federal government also gives a standard deduction to most people who are paying income taxes. For example, in 2015, the standard deduction for a single person was $6,300. The government does not tax this amount. Sometimes people have other deductions that will add up to more than the standard deduction. These can also be used to decrease the amount of income the government can tax a person on. ====Personal exemptions==== The federal government allows each person who files taxes to take a tax deduction called a \"personal exemption.\" When the United States Congress created tax rules in 1954, they thought a certain amount of money should not be taxed so that a person could spend that money on food, housing, and other basic needs. In 2015, the personal exemption for one person was $4,000. Most people can take another exemption for their spouse, and another for each child in their home. ====State deductions==== Many states have their own deductions. For example, if a person in Massachusetts pays rent to a landlord, they can deduct half of their rent (up to $3,000) from the amount of income the government can tax them on. ===Credits=== The federal government also offers tax credits. This means that if a person spends money on certain things, and meets all the rules of the credit program, the credit can be up to 35 percent of your qualifying expenses, depending upon your adjusted gross income. For example, the Child and Dependent Care Credit is for parents who work, but have to pay over $3,000 a year for someone to take care of their children while they are working. Each credit has many different rules that people must meet. However, if they do meet them, the federal government will take $3,000 off of their taxes, to help the parents continue to work. ==Filing taxes== Every year, most people in the United States must file a report of their income from the year, their deductions, credits, and any other special tax issues. This report is called a tax return. The tax return helps work out what a person might owe the government in taxes. On the other hand, if a person has been paying their taxes bit by bit, the government may owe them money. This is called a tax refund. Usually, all tax returns are due by April 15. However, because of holidays in Washington, D.C., sometimes \"Tax Day\" comes a few days later. ===Filing status=== There are a five different ways that a person, or a couple, can file their tax returns: # Single: People file this way if they are not married and do not fit under any of the other five categories # Married Filing Jointly: A married couple can file just one tax return if they want to. Both people put their income and other information on the same tax form. This is usually called a \"joint return.\" # Married Filing Separately: A married couple can file two different tax returns, one for each person, if they want to pay their taxes separately # Head of Household: A person can file this way if they are not married; they pay most of the costs for their home; and a certain type of relative lived with them for more than half of the past year # Qualified Widower with Dependent Child: If a person's spouse died during the tax year, the person can still file a joint return, as if their spouse was still alive. A widower can only do this in the year that their spouse died. Sometimes a person fits into more than one of these categories. If this happens, they are allowed to file their taxes using the category that will let them pay the least amount of taxes. ====Importance==== Filing status is important because many things change based on what filing status a person files their taxes under. For example: * Tax brackets and marginal income tax rates are different for every filing status * The standard deduction is different for different filing statuses * People in some tax brackets may not be eligible for certain deductions and tax credits * A person's filing status may affect whether they have to file a tax return at all ==Example of a tax calculation== Here is a basic example of how a person would work out what they have to pay in taxes, based on their income, filing status, and deductions. * Gross (total) income: $20,000 * Filing Status: Single * Deductions: Standard deduction ($6,300) and one personal exemption ($4,000) First the person needs to work out their taxable income. This is the amount of income the government can tax. It does not include deductions, since the government does not tax those. So, to get their taxable income, the person needs to subtract their deductions from their gross income. In other words: $20,000 (gross income) $6,300 (standard deduction) $4,000 (personal exemption) = $9,700 taxable income Now the person can use lists of tax brackets and marginal tax rates to figure out what they owe in taxes. Here are the tax brackets and marginal tax rates that apply to this person: Tax bracket Marginal tax rate Which means... A person will have to pay this tax rate: For this part of their income ONLY: $0 $9,275 10% 10% Anything between $0 $9,275 $9,276 $37,650 15% 15% Anything above $9,275, up to $37,650 * Out of $9,700 in taxable income: ** The first $9,275 will always be taxed at 10%. $9,275 x 10% = $927.50. ** The person has $425 of income above $9,275. This $425 will be taxed at 15%. $425 x 15% = $63.75 * Total income tax is $927.50 + $63.75 = $991.25 This person is paying only 4.9% of their gross (total) income to the government in income taxes. ==What federal income taxes pay for== According to the White House, in 2014, the United States government spent people's federal income taxes on these things: Percentage of Taxes Spent On For Example 27.49% Health care Medicare and Medicaid (help paying medical costs for elderly ex-workers and for very poor, often disabled people 23.91% National defense Defending the country; paying soldiers' salaries; paying for new weapons for the U.S. military 18.17% Job and family security Programs to give free food, tax credits, and other help poor families 9.07% Net interest The total amount of interest the U.S. had to pay to other countries who have given the U.S. loans 5.93% Veterans' benefits Pays for health care, home loans, pensions, education, and help with disabilities for veterans 3.59% Education and job training Financial aid (which helps students pay for university); job training programs; special education 2.00% Immigration, law enforcement, and administration of justice Making the borders secure, paying for lawsuits, other court-related costs 1.85% International affairs Spending on humanitarian aid for other countries; spending on U.S. Embassies across the world 1.64% Natural resources, energy, and environment Controlling pollution, making energy, making the environment cleaner 1.13% Science, space, and technology programs Spending on science, scientific research, and the space program 0.97% Agriculture Money paid to farmers to help them grow crops; agricultural research; crop insurance 0.43% Community, area, and regional development Spending on things to make communities stronger, like building housing and community centers 0.39% Responding to natural disasters Costs of helping Americans (and American businesses) who have survived a major natural disaster 3.42% Other government programs All other government programs, like controlling trade and making the government work File:Doctor uses a stethoscope to examine a young patient.JPEG|Federal income taxes help pay for poor children to get health care through Medicaid File:Aircraft Rescue Firefighting training.jpg|They help pay soldiers like these Marine Corps firefighters File:FBI Evidence Response Team.jpg|They help pay the FBI and other federal law enforcement agencies File:RPG wounded Iraq veteran exercising Army-dot-mil-2007-02-07-103140.jpg|They pay for benefits for veterans like this Iraq War vet File:ACID WATER, OIL AND ACID CLAY SLUDGE ARE EVIDENT IN THIS FIVE ACRE POND ALSO CLUTTERED WITH JUNKED CARS AND OTHER... - NARA - 555852.jpg|They pay for the EPA to clean up pollution like this ==What state and local income taxes pay for== Every state gets to decide where to spend the income tax it collects (its income tax revenue). Different states use this money for different things, at different times. ===Education and health care=== In 2015, a report looked at what every state spent its income tax revenue on. It found that most of state income tax dollars went to pay for education and health care. Specifically, states spent over half of their income tax revenues on three different things: * Public elementary and secondary schools. Together, state and local governments have to pay 90% of public school costs. These include things like paying teachers, buying books, and paying for all the other things schools need. On average, the states paid one-fourth of their income tax revenues toward public education. * Higher education. States paid about 13% of their income tax revenues to support community colleges, state (public) universities, and vocational schools. * Health care. The states have to help the federal government pay for some health care programs, like Medicaid. These programs help pay for health care for poor people, the elderly, and people with disabilities. States spent about 16% of their income tax revenues on these programs. ===Other things=== The 2015 report found that the states spent the other half of their income tax revenues on many different things. Here are some examples. Transportation makes up about 5% of the states' spending. Income taxes pay for many things, like: * Building roads, highways, and bridges * Making sure roads and bridges are safe, and fixing them * Public transportation * Cleaning snow and ice off the roads during the winter to make them safe to drive on States spend about 4% of their income tax revenue on corrections. These income taxes pay for things like: * Prisons (including paying guards, and paying the costs of keeping prisoners locked up safely) * Treatment programs in prison (for example, for people with addictions) * Educational and job training programs in prison * Programs for children who commit crimes ===Other \"public services\"=== Many states also use income tax revenues to pay for important \"public services,\" like: * Public safety ** Police departments, and certain fire departments and emergency medical services ** Equipment for these departments, like ambulances ** Salaries for police officers, firefighters, and Emergency Medical Technicians (EMTs) * Trash collection and street lighting * Free public libraries and public parks * Paying the costs needed to keep the state government working, including paying the salaries of government workers ==Graphs== File:Income tax rate in develop nation.png|Graph showing how the United States's average income tax rates (in green) compare to other countries' File:US Income Tax Rate.png|Graph showing how the tax rate for the highest income bracket has changed from 19132013 File:State and Local Income Tax in the United States.png|Graph showing average state income tax rates (in dark blue), and local tax rates in those states (in light blue) (2014) File:Map of USA highlighting states with no income tax on wages.PNG|States with no personal income taxes ==Notes== ==References== ==Other websites== * The Internal Revenue Service (IRS) Official website ** IRS Help and Resource Center ** Find Answers to Your Tax Questions IRS Online Tax Assistant ** Get Free Help Filing Your Taxes * Your Tax Receipt: Understand Where and How Your Tax Dollars Are Being Spent (from WhiteHouse.gov based on 2014 taxes) Category:United States federal legislation Category:Taxation in the United States",
 "title": "Income tax in the United States"
}