{
 "id": "538494",
 "text": "Carteret is a borough in Middlesex County, New Jersey, United States. As of the 2020 United States census, the borough's population was 25,326, an increase of 2,482 (+10.9%) from the 2010 census count of 22,844, which in turn reflected an increase of 2,135 (+10.3%) from the 20,709 counted in the 2000 census.Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010 , New Jersey Department of Labor and Workforce Development, February 2011. Accessed May 1, 2023. According to the United States Census Bureau, Carteret had a total area of , including of land and of water (11.0%). ==Education== The Carteret School District serves students in pre-Kindergarten through twelfth grade. As of the 2021-2022 school year, the district's five schools had an enrollment of 3,882 students and 305.42 classroom teachers. The student/teacher ratio is 12.71. == Government == The government has a town council with 6 members and a mayor. They all are elected.2012 New Jersey Legislative District Data Book, Rutgers University Edward J. Bloustein School of Planning and Public Policy, March 2013, p. 87. ==Notable people== People who were born in, residents of, or otherwise closely associated with Carteret include: * Jim Babjak (born 1957), Dennis Diken (born 1957) and Mike Mesaros of the pop/rock group The Smithereens are former Carteret residents who met in school there.Cahillane, Kevin. \"Not Fade Away: The Smithereens' Monument to Persistence\", The New York Times, October 10, 2004. Accessed November 3, 2007. \"The band formed in 1980 when three Carteret High School graduates (class of 1975) and childhood friends (Mr. Babjak, Dennis Diken on drums and Mike Mesaros on bass) met Pat DiNizio, a Scotch Plains singer-songwriter-garbage man.\" * Lori Baratta, artist; her portraits of past and present mayors and other famous people from Carteret hang on the walls in City Hall. * Joseph A. Cafasso (born 1956), former Fox News consultant on military and counterterrorism issues who left the network after allegations surfaced that he misrepresented his military record.Rutenberg, Jim. \"At Fox News, the Colonel Who Wasn't\", The New York Times, April 29, 2002. Accessed June 17, 2012. \"Born in 1956, he graduated from Carteret High School in Carteret, N.J., military records show.\" * Jim Conti of the ska band Streetlight Manifesto.Jordan, Chris. \"Streetlight Manifesto set to shred\" , Asbury Park Press, June 18, 2005. Accessed February 6, 2011. \"Carteret's Jim Conti, tenor sax, had to return to the States because of an illness in his family, and new trumpet player, Delano Bonner, a native of Jamaica, had problems entering Europe because of visa problems.\" * Thomas Deverin (1921–2010), former mayor of Carteret who served 22 years in the New Jersey General Assembly.Malwitz, Rick. \"Longtime Carteret political figure Deverin dies at age 89\", The Daily Journal (New Jersey), December 27, 2010. Accessed February 28, 2011. \"State Assemblyman Thomas Deverin of Carteret (right) takes the oath of office in 1979, administered by state Supreme Court Chief Justice Richard Hughes. Deverin, who was also a former mayor of the borough, died Dec. 23 at the age of 89.\" * Keith Hughes (1968-2014), basketball player at Syracuse University and Rutgers who was selected by the Houston Rockets in the 1991 NBA Draft, but never played in the NBA.Haley, John. \"NJ HOOPS: MIDDLESEX COUNTY: A look back at the season A to Z; Scoring leaders and more\", The Star- Ledger, April 3, 2010. Accessed February 23, 2011. \"Keith Hughes is the son of former Carteret and Rutgers great Keith Hughes.\" * Chad Kinch (1958–1994), shooting guard who played in the NBA for the Cleveland Cavaliers and Dallas Mavericks.Staff. Chad Kinch, 35, Ex-Basketball Star, The New York Times, April 8, 1994. Accessed June 17, 2012. \"CARTERET, N.J., April 7— Chad Kinch, a former basketball star at Perth Amboy High School in New Jersey and the Cleveland Cavaliers' No. 1 draft choice in 1980, died at home on Sunday. He was 35.\" * Jim McGreevey (born 1957), former Governor of New Jersey, grew up in Carteret.Slackman, Michael; and Jacons, Andrew. \"THE GOVERNOR RESIGNS: THE CONFLICT; Sex, Ambition and the Politics of the Closet: A Double Life\" , The New York Times, August 15, 2004. Accessed July 25, 2013. \"Mr. McGreevey was molded both by the stern expectations of his father, who believed that discipline was best dispensed with a firm hand, and the Catholic, working- class ethos of his hometown, Carteret.\" * Art McMahon, defensive back for the New England Patriots football team from 1968-1972.Art McMahon, databaseFootball.com. Accessed August 29, 2011. * Joe \"Ducky\" Medwick (1911–1975), left fielder for the St. Louis Cardinals during the \"Gashouse Gang\" era of the 1930s, elected to the Baseball Hall of Fame in 1968, by the Veterans Committee.via United Press International. \"Ducky Medwick, Slugger For Gas House Gang, Dies; A Controversial Player\", The New York Times, March 22, 1975. Accessed September 5, 2011. \"Medwick was born in Carteret, N. J., on Nov. 24, 1911, and went on to star at Carteret High School in track, football, basketball and baseball.\"Joe Medwick at Baseball Almanac, accessed December 7, 2006. Ranked #7 on the Sports Illustrated list of The 50 Greatest New Jersey Sports Figures.The 50 Kdet New Jersey Sports Figures , Sports Illustrated, December 27, 1999. * Nicholas Minue (d. 1943) United States Army Private who received the Medal of Honor for military service in World War II. An elementary school on Post Boulevard in Carteret is named in his honor.Staff. \"SLAIN SOLDIER HERO WON HIGHEST HONOR; Jersey Private in Regular Army Charged Foe Alone in Africa\", The New York Times, April 2, 1944. Accessed February 6, 2011. * Paul J. Pluta, Rear Admiral, United States Coast Guard (Ret.)Staff. \"Rear Admiral Paul Pluta Redefines Maritime Security\", MarineLink.com, June 7, 2002. Accessed September 5, 2011. \"As a young man growing up in the New York City suburb of Carteret, N.J., Pluta knew that he wanted to be involved with some branch of the military, but the decision that loomed over him throughout high school was a tough one. Upon graduation from high school, he weighed his options, singling out the U.S. Merchant Marine Academy in Kings Point, N.Y. and the U.S. Coast Guard Academy in New London, Conn.\" * Joel Weisman (1943-2009), physician who was one of the first to identify a pattern of illnesses that was ultimately diagnosed as AIDS.Colvin, Richard. \"Merciful M. D. Pioneering Physician Also Political Advocate for AIDS Victims\", Los Angeles Times, May 1, 1988. Accessed July 1, 2013. \"Weisman teamed up with Rogolsky in 1975 after three years in private practice in Carteret, NJ, his hometown.\" * Laurence S. Weiss (c. 1919 - 2003), business executive and politician wh served in the New Jersey Senate from 1978 to 1992.Pallone, Frank. \"TRIBUTE TO LAURENCE WEISS\", Congressional Record, Volume 140, Number 139 (September 29, 1994). Accessed September 24, 2015. \"Mr. Speaker, the story of Larry Weiss is one of the great American success stories. Born in Hungary, he immigrated to the United States with his parents at the age of 3. The Weiss family settled first in Jersey City, then Carteret, where Larry went through the public schools and graduated from the high school.\" * Jason Worilds (born 1988), football player selected by the Pittsburgh Steelers in the 2010 NFL Draft.Vrentas, Jenny. \"Steelers draft Carteret product Jason Worilds in second round of NFL Draft\" , The Star-Ledger, April 23, 2010. Accessed July 15, 2010. ==References== Category:Boroughs in New Jersey Category:Middlesex County, New Jersey Category:1906 establishments in the United States Category:20th-century establishments in New Jersey Category:1922 establishments in the United States",
 "title": "Carteret, New Jersey"
}