{
 "id": "538720",
 "text": "The Mauryan Empire was an empire of South Asia, founded by Chandragupta Maurya in 322 BCE and lasting until 185 BCE. It was centralized mainly through the conquest of the Indo-Gangetic Plain, with its capital in Pataliputra (modern Patna). The empire covered regions that are now part of Afghanistan, Nepal, Pakistan, India, and Bangladesh. Chandragupta Maurya, assisted by Chanakya, overthrew the Nanda empire around 322 BCE. Expanding westward, he conquered territories left by Alexander the Great in modern-day Pakistan. By 317 BCE, the empire fully occupied the northwestern subcontinent. The Mauryan Empire also defeated Seleucus I, acquiring land west of the Indus River (modern-day Pakistan), during the Seleucid–Mauryan war. == Etymology == The name \"Maurya\" does not occur in Ashoka's inscriptions, or the contemporary Greek accounts such as Megasthenes's Indica, but it is attested by the following sources: *The Junagadh rock inscription of Rudradaman (c. 150 CE) prefixes \"Maurya\" to the names Chandragupta and Ashoka. * The Puranas (c. 4th century CE or earlier) use Maurya as a dynastic appellation. *Tamil Sangam literature also designate them as '' and mention them after the Nandas *Kuntala inscription (from the town of Bandanikke, North Mysore) of 12th century AD chronologically mention Mauryya as one of the dynasties which ruled the region. According to some scholars, Kharavela' Hathigumpha inscription (2nd-1st century BC) mentions era of Maurya Empire as Muriya Kala (Mauryan era), but this reading is disputed: other scholars—such as epigraphist D. C. Sircar—read the phrase as mukhiya-kala (\"the principal art\"). According to the Buddhist tradition, the ancestors of the Maurya kings had settled in a region where peacocks (mora in Pali) were abundant. Therefore, they came to be known as \"Moriyas\", literally meaning, \"belonging to the place of peacocks\". According to another Buddhist account, these ancestors built a city called Moriya-nagara (\"Moriya- city\"), which was so called, because it was built with the \"bricks coloured like peacocks' necks\". The dynasty's connection to the peacocks, as mentioned in the Buddhist and Jain traditions, seems to be corroborated by archaeological evidence. For example, peacock figures are found on the Ashoka pillar at Nandangarh and several sculptures on the Great Stupa of Sanchi. Based on this evidence, modern scholars theorize that the peacock may have been the dynasty's emblem. Some later authors, such as Dhundhi-raja (an 18th- century commentator on the Mudrarakshasa and an annotator of the Vishnu Purana), state that the word \"Maurya\" is derived from Mura and the mother of the first Maurya king. However, the Puranas themselves make no mention of Mura and do not talk of any relation between the Nanda and the Maurya dynasties. Dhundiraja's derivation of the word seems to be his own invention: according to the Sanskrit rules, the derivative of the feminine name Mura (IAST: Murā) would be \"Maureya\"; the term \"Maurya\" can only be derived from the masculine \"Mura\". ==Administration== The Empire was divided into four provinces, with the imperial capital at Pataliputra From Ashokan edicts, the names of the four provincial capitals are Tosali (in the east), Ujjain (in the west), Suvarnagiri (in the south), and Taxila (in the north). The head of the provincial administration was the Kumara (royal prince), who governed the provinces as king's representative. The kumara was assisted by Mahamatyas and council of ministers. This organizational structure was reflected at the imperial level with the Emperor and his Mantriparishad (Council of Ministers).. The mauryans established a well developed coin minting system. Coins were mostly made of silver and copper. Certain gold coins were in circulation as well. The coins were widely used for trade and commerce Historians theorise that the organisation of the Empire was in line with the extensive bureaucracy described by Chanakya in the Arthashastra: a sophisticated civil service governed everything from municipal hygiene to international trade. The expansion and defense of the empire was made possible by what appears to have been one of the largest armies in the world during the Iron Age. According to Megasthenes, the empire wielded a military of 600,000 infantry, 30,000 cavalry, 8,000 chariots and 9,000 war elephants besides followers and attendants. A vast espionage system collected intelligence for both internal and external security purposes. Having renounced offensive warfare and expansionism, Ashoka nevertheless continued to maintain this large army, to protect the Empire and instil stability and peace across West and South Asia..Even though large parts were under the control of Mauryan empire the spread of information and imperial message was limited since many parts were inaccessible and were situated far away from capital of empire. The economy of the empire has been described as, \"a socialized monarchy\", \"a sort of state socialism\", and the world's first welfare state. Under the Mauryan system there was no private ownership of land as all land was owned by the king to whom tribute was paid by the by the laboring class. In return the emperor supplied the laborers with agricultural products, animals, seeds, tools, public infrastructure, and stored food in reserve for times of crisis. === Local government === Arthashastra and Megasthenes accounts of Pataliputra describe the intricate municipal system formed by Maurya empire to govern its cities. A city counsel made up of thirty commissioners was divided into six committees or boards which governed the city. The first board fixed wages and looked after provided goods, second board made arrangement for foreign dignitaries, tourists and businessmen, third board made records and registrations, fourth looked after manufactured goods and sale of commodities, fifth board regulated trade, issued licenses and checked weights and measurements, sixth board collected sales taxes. Some cities such as Taxila had autonomy to issue their own coins. The city counsel had officers who looked after public welfare such as maintenance of roads, public buildings, markets, hospitals, educational institutions etc. The official head of the village was Gramika (in towns Nagarika). The city counsel also had some magisterial powers. The taking of Census was regular process in the Mauryan administration. The village officials (Gramika) and municipal officials (Nagarika) were responsible enumerating different classes of people in the Mauryan empire such as traders, agriculturists, smiths, potters, carpenters etc. and also cattle, mostly for taxation purposes. These vocations consolidated as castes, a feature of Indian society that continues to influence the Indian politics till today. ==Empire Expansion== ===Conquest of the Nanda Empire=== Some Buddhist, Jain, and Hindu texts claim Magadha was ruled by the Nanda dynasty, which, with Chanakya's counsel, Chandragupta conquered Nanda Empire. The army of Chandragupta and Chanakya first conquered the Nanda outer territories, and finally besieged the Nanda capital Pataliputra. In contrast to the easy victory in Buddhist sources, the Hindu and Jain texts state that the campaign was bitterly fought because the Nanda dynasty had a powerful and well-trained army. ===Conquest of the Eastern Seleucid Empire=== Greek historians mentioned the result of Seleucid–Mauryan war where Seleucid Empire's eastern satrapies( Gedrosia,Arachosia, Aria, and Paropamisadae) ceded to Mauryan Empire : Greecian historian Pliny also quoted a passage from Megasthanes work about Chandragupta Empire boundaries: > Most geographers, in fact, do not look upon India as bounded by the river > Indus, but add to it the four satrapies of the Gedrose, the Arachotë, the > Aria, and the Paropamisadë, the River Cophes thus forming the extreme > boundary of India. According to other writers, however, all these > territories, are reckoned as belonging to the country of the Aria. — Pliny, > Natural History VI, 23Pliny, Natural History VI, 23Pliny, Natural History > VI, 23 The conquest of the south by Chandragupta Maurya may also perhaps be inferred from the following statement of Plutarch. \"The throne\" in the context is the Magadhan throne, the occupation of which by Chandragupta is thus followed by two other events, viz., the defeat of Selucus, and the conquest of the remaining part of India not included in the Magadhan empire of the Nandas: > \"Not long afterwards Androkottos, who had by that time mounted the throne, > presented Selukos with 500 elephants, and overran and subdued the whole of > India with an army of 600,000.\" > — Chapter LXII ,Life of Alexander, PlutarchChapter LXII ,Life of Alexander, > Plutarch Megasthenes defined the region that Chandragupta won from Seleucus as likely western side Gedrosia which shares boundaries with the Euphrates River, and eastern side Arachosia shares boundaries with the Indus. The northern frontier boundary formed by Hindukush mountain range: > India, which is in shape quadrilateral, has its eastern as well as its > western side bounded by the great sea, but on the northern side it is > divided by Mount Hemôdos from that part of Skythia which is inhabited by > those Skythians who are called the Sakai, while the fourth or western side > is bounded by the river called the Indus. > — Book I Fragment I , Indica, MegasthanesBook I Fragment I , Indica, > Megasthanes by Mccrindle, J. W > Sandrokottos the king of the Indians, India forms the largest of the four > parts into which Southern Asia is divided, while the smallest part is that > region which is included between the Euphrates and our own sea. The two > remaining parts, which are separated from the others by the Euphrates and > the Indus, and lie between these rivers... India is bounded on its eastern > side, right onwards to the south, by the great ocean; that its northern > frontier is formed by the Kaukasos range(Hindukush Range) as far as the > junction of that range with Tauros; and that the boundary. — Book I Fragment > II , Indica, MegasthanesBook I Fragment II , Indica, Megasthanes ====Treaty of the Indus==== The ancient historians Justin, Appian, and Strabo preserve the three main terms of the Treaty of the Indus: (i) Seleucus transferred to Chandragupta's kingdom the easternmost satrapies of his empire, certainly Gandhara, Parapamisadae, and the eastern parts of Gedrosia, Arachosia and Aria as far as Herat. (ii) Chandragupta gave Seleucus 500 Indian war elephants. (iii) The two kings were joined by some kind of marriage alliance (ἐπιγαμία οι κῆδος); most likely Chandragupta wed a female relative of Seleucus. ====Other account==== *Tibbetan Lama Taranatha (1575–1634) > Ashoka brought under his rule without bloodshed all the countries including > those to the south of the Vindhya. And he conquered the northern Himalayas, > the snowy ranges beyond Li-yul (Khotan),\" the entire land of Jambudvipa > bounded by seas on east, south and west, and also fifty small islands. — > History Of Buddhism In India ,TaranathaHistory Of Buddhism In India > ,Taranatha > Ashoka served as a viceroy during the rule of his father Bindusara. > According to established constitutional usage, Asoka as Prince served as > viceroy in one of the remoter provinces of the Empire. This was the province > of Western India called Avantirattham or province of Avanti with headquarter > at Ujjain. > — Mahabodhivamsa, pg.98 ===Conquest of the Saurashtra=== Chandragupta conquered Southern-Western part of India. Especially his conquest over Saurashtra and Sudarshana lake construction is preseved in later Satrapian king Rudradaman inscription: > 8\\. mauryasya rājyaḥ candra-guptasya rāṣṭriyena vaiśyena puṣpa-guptena > kāritam śokasya mauryasya kṛte yavana-raj tuṣāra-saphenādhāyā —Junagadh rock > inscription of Rudradaman \"Junagadh Rock Inscription of Rudradaman\", Project > South Asia. Translation : for the sake of ordered to be made by the Vaishya > Pushyagupta, the provincial governor of the Maurya king Chandragupta; > adorned with conduits for Ashoka the Maurya by the Yavana king Tushaspha > while governing; and by the conduit ordered to be made by him, constructed > in a manner worthy of a king (and) seen in that breach. ===Rule over territories of Yonas , Kambojas, Nabhakas, Nabhapamktis, Bhojas, Pitinikas, Andhras and Palidas=== The Kambojas are a people of Central Asian origin who had settled first in Arachosia and Drangiana (today's southern Afghanistan), and in some of the other areas in the northwestern Indian subcontinent in Sindhu, Gujarat and Sauvira. The Nabhakas, the Nabhapamkits, the Bhojas, the Pitinikas, the Andhras and the Palidas were other people under Ashoka's rule: > 9\\. hidā laja viśavashi Yona Kambojeshu Nabhaka Nabhapamtishu Bhoja > Pitinikyeshu 10\\. Adha Paladeshu shavata Devānampiyashā dhammanushathi > anuvatamti[] yata pi dutā — Ashoka, Rock Edict 13 , Kalsi Rock, South > Portion.Ashoka, Rock Edict 13 , Kalsi Rock, South Portion by E. Hultzsch > Translation : Likewise here in the king's (Ashoka ) territory, among the > Yonas and Kambojas, among the Nabhakas and Nabhapamkits, among the Bhojas > and the Pitinikas, among the Andhras and the Palidas, everywhere (people) > are conforming to Beloved-Of-God (Ashoka) instruction in morality. ===Conquest of the Kalinga=== Kalinga War plays a very important role in Mauryan history which changes a cruel Emperor Chanda-Ashoka to Priyadarshi Ashoka. > \"Beloved-of-the-Gods, King Priyadarsi(Ashoka)conquered the Kalingas eight > years after his coronation. One hundred and fifty thousand were deported, > one hundred thousand were killed and many more died (from other causes). > After the Kalingas had been conquered, Beloved-of-the-Gods came to feel a > strong inclination towards the Dharma, a love for the Dharma and for > instruction in Dharma. Now Beloved-of-the-Gods feels deep remorse for having > conquered the Kalingas. \" — Ashoka, Major Rock Edict 13Ashoka, Major Rock > Edict 13 ===Conquest of the Kuntala=== Shikarpur Taluq inscription mentioned about Mauryan ruling in the region of Kuntala .The Kuntala country is an ancient Indian political region included the western Deccan and some parts of central,south Karnataka and north Mysore. > Kuntala-kshôpiyam pesarvett â-nava-Nanda-Gupta-kula-Mauryya-kshmâpar aldar > llasaj-jasad — Shikarpur Taluq, inscription 225Shikarpur Taluq inscription > 225, Epigraphia Carnatica, Volume 17Shikarpur Taluq inscription 225, > Epigraphia Carnatica Volume 17 Translation : The Kuntala country, which is > like curls (kuntaja) to the lady Earth, was-ruled by the renowned nine > Nandas, the Gupta and Mauryan kings. ===Conquest of the Nepala=== According to the Asokavadana, it is stated that in his youth, Ashoka subdued the revolt in the of the Khasas (present day Nepala region) and Taksasila. Similarly, in contrast, according to a 15th- century Tibetan historian: > Meanwhile, peoples of the hilly countries like Nepal and Khasya revolted. > Asoka was sent with the army to subdue them. Without difficulty Asoka > subdued .the hilly races, imposed levy and annual tax on them, realised > ransom from them and offered these to the king. — History Of Buddhism In > India ,TaranathaHistory Of Buddhism In India ,Taranatha Apart from Taranath's account, it is noteworthy that Ashoka was responsible for the construction of several significant structures in Nepal. These include the Ramagrama Stupa,Gotihawa Pillar of Ashoka, Nigali-Sagar Ashoka Pillar inscription , and the Lumbini pillar inscription of Ashoka.The Chinese pilgrims Fa-Hien (337 CE – c. 422 CE) and Xuanzang (602–664 CE) describe the Kanakamuni Stupa and the Asoka Pillar of currently Nepal region in their travel accounts. Xuanzang speaks of a lion capital atop the pillar, now lost. A base of a Pillar of Ashoka has been discovered at Gotihawa, a few miles from Nigali Sagar, and it has been suggested that it is the original base of the Nigalar Sagar pillar fragments. ===Boundaries sharing territories=== Even though Ashoka defined the boundaries of his empire four times in various second rock inscriptions (with same lines) but he never mentioned any inner hole or unconquered region inside his empire.This suggests that Ashoka's empire was likely contiguous, with no significant unconquered regions within its borders : > 1\\. Sarvata vijitamhi Devānaṃpriyasa Piyadasino rāño 2\\. evamapi pracaṃtesu > yathā Coḍa Pāḍā Satiyaputo Ketalaputo ā Taṃba- 3\\. paṃṇī Aṃtiyako Yona-rājā > ye vā pi tasa Aṃtiy[a]kas[a] sāmīp[aṃ] 4\\. rājāno sarvatra Devānaṃpriyasa > Priyadasino rāño dve cikīcha katā 5 manusa-cīkichā ca pasu cikīchā ca > —Second Rock Edict :GirnarSecond Rock Edict, Girnar by E. Hultzsch \\---- — James Prinsep Translation : Everywhere within the conquered province of Raja Piyadasi (Ashoka), the beloved of the gods, as well as in the parts occupied by the faithful, such as Chola, Pandiya, Satiyaputra, and Keralaputra, even as fart as Tambapanni (Sri Lanka) and, moreover, within the dominions the Greek (of which Antiochus generals are the rulers ) everywhere the heaven-beloved Raja Piyadasi’s double system of medical aid is established— both medical aid for men, and medical aid for animals, together with the medicaments of all sorts, which are suitable for men, and suitable for animals. — E. Hultzsch Translation: Everywhere in the dominions of Dévanampriya Priyadarsina, and (of those) who (are his) borderers, such as the Cholas, the Pandyas, the Satiyaputra, the Kéralaputra, Tamaraparni, the Yona(Greek) king named Antiyoka , and the other kings who are the neighbours of this Antiyoka, everywhere two kinds of medical treatment were established by king Devanampriya Priyadarsin, (viz.) medical treatment for men and medical treatment for cattle. ==Chandragupta Maurya's rule== Chandragupta Maurya established the Maurya empire by overthrowing the Nanda Empire and expanded the empire with the help of Chanakya. By 316 BC , the Maurya empire fully occupied North-Western parts of the subcontinent, defeating and conquering the governors left by Alexander the Great. Chandragupta Maurya defeated Seleucus I Nicator and gained the territories beyond Indus River. After Chandragupta Maurya, his son Bindusara started to rule from 298 BC. He was called as \"Amitraghata\", the sanskrit word telling that Bindusara is the \"slayer of enemies\". He conquered the southern parts of India. After his death, only Kalinga (modern Orissa) and parts of Chola were left unconquered. ==Golden age of the empire== King Ashoka, son of Bindusara, became the emperor of Mauryan Empire in 268 BC. He is one of the greatest emperor of the Indian subcontinent. Ashoka conquered Kalinga in the violent and bloody war, which is known as the Kalinga War. This is the last war fought by King Ashoka. The casualities are more than 200,000. The region of Kalinga was destroyed and looked bloodshed. This changed the mind of Ashoka. He devoted the rest of his life to 'ahinsa' and 'dharma-vijaya'. He became a Buddhist after this war. King Ashoka made many Rock edicts and Stupas in his empire. The present emblem of India was taken from one of his rock pillars. He was commonly called as Ashoka the Great. ==Decline== After his death in 232 BC, the empire started to decline. The empire lasted just fifty years after his death. Brihadratha Maurya, the last Mauryan emperor was killed by his general Pushyamitra Sunga, who founded the Sunga Empire in 185 BC. ==References== Category:4th-century BC establishments Category:Former empires Category:Former countries in South Asia Category:Ancient history of Pakistan Category:Ancient India Category:Empires and kingdoms of Pakistan",
 "title": "Maurya Empire"
}