{
 "id": "539234",
 "text": "Choix des plus belles fleurs ('Selection of the most beautiful flowers') is a book of watercolour paintings by French botanical artist Pierre-Joseph Redouté (10 July 1759 – 19 June 1840). The full title is Choix des plus belles fleurs et de quelques branches des plus beaux fruits. Dédié à LL. AA. RR. les princesses Louise et Marie d'Orléans (1827) in French. English translation of the title is: \"Selection of the most beautiful flowers and some branches of the finest fruits\". A folio edition with colour pages was printed in Paris in 1827. From May 1827 to June 1833, 144 special pages with pictures were printed. The work was in 36 parts. Each part had four pictures of flowers, flowering trees, or fruit. == Printing colour images == The printing method for such works in the 18th and early 19th century was engraving on copperplate. It is a form of intaglio printing. Different colours could be got by running the plates through once for each colour, so building up the final picture. Fine colour works could also be hand-coloured by teams of women who were experts at the job. What this means is that every illustration in a book was coloured by hand. They had the artist's original in front of their eyes as they worked. The copper engraving gave the outline and any other black lines or areas.Twyman M. Printing 17701970: an illustrated history of its development and uses in England. London: Eyre & Spottiswoode. Chapter 6 Picures into print. In 1796, Redouté used a way to make prints which used both these methods. First, an engraver made an engraving from the painting, with small dots instead of lines. Then the colours were put on the engraved plate before each printing. After printing, each print was finished by hand with more colour. Redouté claimed to have invented this method. He was challenged in the courts, but he won the case.Blunt, Wilfred 1950. The art of botanical illustration. London: Collins, chapter 14 The age of Redouté. == Gallery == File:Choix des plus belles fleurs (Plate 96) (7851483838).jpg File:Choix des plus belles fleurs (Plate 91) (7851479456).jpg File:Choix des plus belles fleurs (Plate 79) (7851468806).jpg File:Choix des plus belles fleurs (Plate 82) (7851471302).jpg File:Choix des plus belles fleurs (Plate 20) (7851414668).jpg File:Choix des plus belles fleurs (Plate 37) (7851431718).jpg File:Choix des plus belles fleurs (Plate 42) (7851436944).jpg File:Choix des plus belles fleurs (Plate 62) (7851455158).jpg File:Choix des plus belles fleurs (Plate 75) (7851465476).jpg File:Redouté, P.J., Choix des plus belles fleurs et des plus beaux fruits, t. 99 (1827).png File:Choix des plus belles fleurs (Plate 7) (7851402370).jpg File:Choix des plus belles fleurs (Plate 35) (7851429834).jpg == References == == Other websites == *Full text on Internet Archive *Full text on Biodiversity Heritage Library *Rare Book Room (photographed in very high resolution) Category:Biology books Category:19th-century paintings Category:1820s books",
 "title": "Choix des plus belles fleurs"
}