{
 "id": "539368",
 "text": "Ben Roy Mottelson (July 9, 1926 - May 13, 2022) was an American-born Danish nuclear physicist. He won the 1975 Nobel Prize in Physics for his work on the non-spherical geometry of atomic nuclei. ==Early life== Mottelson was born in Chicago, Illinois. He graduated from Lyons Township High School in LaGrange, Illinois. He received a Bachelor's degree from Purdue University in 1947, and a Ph.D. in nuclear physics from Harvard University in 1950. ==Career== In 1950–51, James Rainwater (1917 - 1986) and Aage Bohr (1922 - 2009) had developed models of the atomic nucleus. It began learn the behaviour of the individual nucleons. Mottelson worked with Aage Bohr to share the theoretical models with experimental data. In three papers which were published in 1952–53, Bohr and Mottelson demonstrated close agreement between theory and experiment, for example showing that the energy levels of certain nuclei could be described by a rotation spectrum. This work stimulated new theoretical and experimental studies. ===Nobel Prize (1975)=== Rainwater, Bohr and Mottelson were jointly awarded the 1975 Nobel Prize in Physics \"for the discovery of the connection between collective motion and particle motion in atomic nuclei and the development of the theory of the structure of the atomic nucleus based on this connection\".Nobel prize citation. Nobelprize.org. Retrieved on 2012-02-18. ===Later career=== Bohr and Mottelson continued to work together, publishing a two-volume monograph, Nuclear Structure. The first volume, Single-Particle Motion, appeared in 1969, and the second volume, Nuclear Deformations, in 1975. Professor Mottelson was a member of the Board of Sponsors of The Bulletin of the Atomic Scientists.Bulletin of the Atomic Scientists – Board of Sponsors . Thebulletin.org. Retrieved on 2012-02-18. He was a foreign fellow of Bangladesh Academy of Sciences and the Norwegian Academy of Science and Letters. In 1969, he won the Atoms for Peace Award. ==Personal life== Mottelson had dual citizenship. He had both Danish and American citizenship. He lived in Copenhagen, Denmark. Mottelson was married to Nancy Jane Reno from 1948 until her death in 1975. They had two sons and one daughter. Mottelson then married Britta Marger Siegumfeldt in 1983. Mottelson died on May 13, 2022 in Copenhagen at the age of 95.Ben Roy Mottelson er død ==References== ==Other websites== * Nobel prize press release * Autobiography from the Nobel foundation website * Ben Roy Mottelson Category:1926 births Category:2022 deaths Category:American Nobel Prize winners Category:American physicists Category:Danish academics Category:Danish physicists Category:Harvard University alumni Category:Scientists from Chicago Category:Danish Nobel Prize winners Category:People from La Grange, Illinois",
 "title": "Ben Roy Mottelson"
}