{
 "id": "539411",
 "text": "Pierre-Joseph Redouté (10 July 1759 in Saint-Hubert – 19 June 1840 in Paris) was a painter and botanist from the Southern Netherlands. He is known for his watercolours of roses, lilies and other flowers.Blunt, Wilfred 1950. The art of botanical illustration. London: Collins, chapter 14 The age of Redouté. Later edition: Blunt, Wilfred, rev. by Stearn, William T. 1994. The art of botanical illustration. Woodbridge, Suffolk: Antique Collectors Club. He was nicknamed \"the Raphael of flowers\" and has been called the greatest botanical illustrator of all time.Schmidt, Alesandra M; and Trudy B. Jacoby. 1996. Herbs to orchids: botanical illustration in the nineteenth century. Watkinson Exhibition Catalogs, paper 3. Many of the species he painted had never been illustrated before. He was an official court artist of Queen Marie Antoinette, and he continued painting through the French Revolution and Reign of Terror. For fifty years, Redouté was the drawing teacher to French queens and princesses. He dedicated Choix des plus belles fleurs to two of his students, Louise and Marie d’Orléans. Later, Marie d’Orléans became the first queen of the Belgians. == Principal works == * Geraniologia, ed. Petri-Francisci Didot (1787-88) * Traité des arbres et arbustes que l'on cultive en France, par Duhamel. Nouvelle édition, avec des figures, d'après les dessins de P. J. Redouté, 7 vols. (1800-1819) * Les Liliacées, 8 vols. (1802-1816); Taschen America (2000) ; SCD, University of Strasbourg. (1802-1816) On line. * Les Roses, 3 vols. (1817-1824); French & European Pubns (1954) ; Pierre-Joseph Redoute, Sandra Raphael (Narrator), Ian Jackson (Translator), CD-ROM Octavo (2002) ; NYPL On Line. or Rare Book Room (1817-1824 from Library of Congress) or Rare Book Room (1817 from The Warnock Library). Taschen has also published this as part of its 25th Anniversary series. * *Choix des plus belles fleurs et de quelques branches des plus beaux fruits. Dédié à LL. AA. RR. les princesses Louise et Marie d'Orléans (1827) *Catalogue de 486 liliacées et de 168 roses peintes par P.-J. Redouté (1829) *Alphabet Flore (1835) Posthumously published, in 1989: * Champignons du Luxembourg. Planches inédites de Pierre- Joseph Redouté (1759–1840). Manuscrit de Louis Marchand (1807–1843). Ministère d'Etat. Government commission for the commemoration of the 150th anniversary of Independence of the Grand Duchy of Luxembourg; Musée national d'histoire naturelle; Société des naturalistes luxembourgeois, 1989. == References == Category:1759 births Category:1840 deaths Category:Belgian painters Category:Belgian botanists Category:People from Luxembourg (Belgium)",
 "title": "Pierre-Joseph Redouté"
}