{
 "id": "540193",
 "text": "The Golden Temple, or Golden Gurdwara is the holiest shrine of Sikhs. It was built during Mughal rule in late 16th century by Shri Guru Arjan Dev and a copy of the holy Sikh scripture Adi Guru Granth Sahib was placed inside the Gurdwara in 1604. Its sanctum walls were covered in marble and the dome was beautified with gold foil by Maharaja Ranjit Singh in the 19th century during the time of Sikh Empire. More than 100,000 people visit this monument every month Sri Harmandir Sahib (formerly known as Sri Hari Mandir Sahib) is the official and original name of the Golden Temple.[1] It is in the city of Amritsar, Punjab, India. The Gurudwara is surrounded by a sacred pool called \"sarover\"and group of buildings important to the Sikh religion. The complex is the most important pilgrimage site in Sikhism and it is also called Sri Darbar Sahib. One of these buildings in the complex is the Sri Akal Takht, the highest religious authority for Khalsa Sikhs. Another building is the langar, where a free simple vegetarian meal is served to all without any discrimination. The Gurudwara is a place of worship for men and women from all walks of life and all religions to come and worship God. The four entrances (representing the four directions) to get into the Harmandir Sahib also symbolise the openness of the Sikhs towards all people and religions. The present-day gurdwara was rebuilt in 1764 by Jassa Singh Ahluwalia with the help of other Sikh Misls. In the early nineteenth century, Maharaja Ranjit Singh founded the Sikh Empire and covered the upper floors of the gurdwara with gold, which gives it its distinctive appearance and its English name.[10] It contains the Sri Guru Granth Sahib ji, the Sikh scripture. On 4th July 1955, Indian Army entered the complex wearing shoes and caused destruction in the complex. Also, in June 1984 the Golden Temple complex was blown apart by tanks, snipers, grenades and rocket launchers by == Reference == Category:Sikhism Category:Punjab, India Category:2nd millennium BC buildings and structures Category:17th-century establishments in India Category:National symbols of India Category:Temples in India",
 "title": "Golden Temple"
}