{
 "id": "540808",
 "text": "The \"March of the Volunteers\" (, ) is the national anthem of the People's Republic of China. The words of the song were written by a playwright named Tian Han in 1934, and the melody to his words were composed by a composer named Nie Er a year later. It was first adopted in 1949Resolution on the Capital, Calendar, National Anthem, and National Flag of the People's Republic of China (1949-09-27). First Chinese People's Political Consultative Conference in Beijing. when the previous government was overthrown. It also became the national anthems of Hong Kong in 1997Basic Law of the Hong Kong Special Administrative Region, Annex III (1990-04-04). Seventh National People's Congress in Beijing. and Macao in 1999.Basic Law of the Macao Special Administrative Region, Annex III (1993-03-31). Eighth National People's Congress in Beijing. In 2004, this anthem became embedded in the Chinese Constitution.Constitution of the People's Republic of China, Amendment IV, §31 (2004-03-14). Tenth National People's Congress in Beijing. ==Lyrics== ===Current official version=== Words of the song in Chinese Words of the song in Traditional Chinese Words of the song using pinyin Words of the song using Yale romanisationhttps://lyricstranslate.com/en/guo-ge-yihyuhnggwan- jeunhahngkuk.html Pronunciation of these words using the IPA Words of the song in English http://www.gov.cn/guoqing/guoge/index.htm gov.cn. Héilòi! Bātyuhn jouh nòudaih dīk yànmùn! Bá ngóhmùn dīk hyutyuhk, jūksìng ngóhmùn sāndīk chèungsìng! Jūngwà mànjuhk doulíuh jeui ngàihím dīk sìhauh, Múihgoyàn beihbīkjeuk faatchēut jeuihauh dīk hausīng. Héilòi! Héilòi! Héilòi! Ngóhmùn maahnjungyātsām, Mouhjeuhk dihkyàn dīk paaufó, chìnjeun! Mouhjeuhk dihkyàn dīk paaufó, chìnjeun! Chìnjeun! Chìnjeun! Jeun! [tɕʰì.lǎɪ̯ ‖ pǔ.ʏ̯ɛ̂n tswô̞ nǔ.lî tɤ ɻə̌n.mən ‖] [pà̠ wò̞.mən tɤ ɕʏ̯ø̞̂.ɻô̞ʊ̯ ǀ ʈʂû.ʈʂʰɤ̞̌ŋ wò̞.mən ɕín tɤ ʈʂʰɑ̌ŋ.ʈʂʰɤ̞̌ŋ ‖] [ʈʂʊ́ŋ.xwǎ̠ mǐn.tsǔ tɑ̂ʊ̯.ljɑ̀ʊ̯ tswê̞ɪ̯ wé̞ɪ̯.ɕjɛ̀n tɤ ʂɻ̩̌.xô̞ʊ̯ ‖] [mè̞ɪ̯ kɤ ɻə̌n bê̞ɪ̯.pʰwô̞.ʈʂɤ fá̠.ʈʂʰú tswê̞ɪ̯.xô̞ʊ̯ tɤ xò̞ʊ̯.ʂɤ̞́ŋ ‖] [tɕʰì.lǎɪ̯ ‖ tɕʰì.lǎɪ̯ ‖ tɕʰì.lǎɪ̯ ‖] [wò̞.mən wân.ʈʂʊ̂ŋ.î.ɕín ǀ] [mɑ̂ʊ̯.ʈʂɤ tǐ.ɻə̌n tɤ pʰɑ̂ʊ̯.xwò̞ ǀ tɕʰjɛ̌n.tɕîn ‖] [mɑ̂ʊ̯.ʈʂɤ tǐ.ɻə̌n tɤ pʰɑ̂ʊ̯.xwò̞ ǀ tɕʰjɛ̌n.tɕîn ‖] [tɕʰjɛ̌n.tɕîn ‖ tɕʰjɛ̌n.tɕîn ‖ tɕîn ‖] Arise, you who refuse to be bond slaves, Let's stand up and fight for liberty and true democracy, All our world is facing the change of the tyrant! Everyone who works for freedom is now crying: Arise, Arise, Arise! All of us with one heart, With the torch of freedom, march on, With the torch of freedom, March on, March on! March on and on!Respect, the national anthem and the Basic Law (2018-03-25). Webb-site Reports. Translated by Paul Robeson. ===In local languages=== Uyghur translation Uyghur transliteration Lhasa Tibetan translationhttps://lyricstranslate.com/en/guo-ge-krung-hw-mi-dmngs-spyi-mthun- rgyl-khb-kyi-rgyl-glu.html Lhasa Tibetan transliteration Portuguese translation ===Previous version used between 1978 and 1982=== Words of the song in Chinese Words of the song using pinyin Translation of the words into English 前进！各民族英雄的人民！ 伟大的共产党领导我们继续长征。 万众一心奔向共产主义明天， 建设祖国保卫祖国英勇的斗争。 前进！前进！前进！ 我们千秋万代 高举毛泽东旗帜，前进！ 高举毛泽东旗帜，前进！ 前进！前进！进！https://web.archive.org/web/20070929123328/http://www.xdj.gov.cn/ShowArticle.asp?ArticleID=6675 存档副本. Retrieved 2007-04-12. Archived 2007-09-29.https://web.archive.org/web/20100901143054/http://baike.yp001.com/stamp_show.asp?id=160 邮币卡大百科 → 邮票 → J字邮票 → J.46：中华人民共和国成立三十周年(第三组). 邮票互动网. 2011-01-05. Archived 2010-09-01. Qiánjìn! Gè mínzǔ yīngxióngde rénmín, Wěidàde gòngchǎndǎng lǐngdǎo wǒmen jìxù chángzhēng. Wànzhòng yīxīn bēn xiàng gòngchǎnzhǔyì míngtiān, Jiànshè zǔgúo bǎowèi zǔgúo yīngyǒngde dòuzhēng. Qiánjìn! Qiánjìn! Qiánjìn! Wǒmen qiānqīu-wàndài Gāojǔ Máo Zédōng qízhì, qiánjìn! Gāojǔ Máo Zédōng qízhì, qiánjìn! Qiánjìn! Qiánjìn! Jìn! March on! Heroes of every races! The great Communist Party leads us in continuing the Long March! Millions with but one heart toward a communist tomorrow Bravely struggle to develop and protect the motherland. March on! March on! March on! We will for many generations Raise high Mao Zedong's banner! March on! Raise high Mao Zedong's banner! March on! March on! March on! On! ==Parodies== *In 1941, African American musician Paul Robeson recorded and sung both a Chinese and an English version of the song.https://politicalfolkmusic.org/wordpress/paul-robeson-march-of-the- volunteers Paul Robeson's album \"Chee Lai!\". Audio hosted at the Internet Archive. Lyrics and sheet music hosted at Political Folk Music. Retrieved 22 January 2015.Bonner, David. Revolutionizing Children's Records: 1946–1977, pp. 47 f. Scarecrow Press (Plymouth), 2008. *In 1944, an instrumental version recorded by the Army Air Force Orchestra was played as the theme song for film Why We Fight VI: The Battle of China. *The Slovenian avant-garde band Laibach recorded an electronic version of this song in both English and Mandarin.https://www.allmusic.com/album/volk-limited-edition-mw0000573590 Anderson, Rick. Laibach: Volk. AllMusic (San Francisco), 2015. Retrieved 22 January 2015. *British musician Damon Albarn created an upbeat version of this song.https://www.bbc.co.uk/music/reviews/3qp2 Jones, Chris. Monkey: Journey to the West Review. BBC Music (London), 2008. Retrieved 18 December 2011. *German musician Holger Czukay created a cut-up instrumental version of this song. *The third line of the first stanza in the lyrics of Glory to Hong Kong created during the 2019–20 Hong Kong protests makes a reference to the first line of March of the Volunteers. ==Notes== ==References== Category:1934 songs Category:Asian anthems Category:National symbols of the People's Republic of China",
 "title": "March of the Volunteers"
}