{
 "id": "540960",
 "text": "The University of Worcester is a university, in Worcester, England. It started in 1946. == History == In 1946, it started as a teaching college. It was on unused bases for the Royal Air Force. In 1997 the Privy Council renamed it iversity College Worcester. In 2005, the Privy Council let it become a university. The institution was renamed \"University of Worcester\" in September of that year.University history – University of Worcester. Worcester.ac.uk. Retrieved on 8 March 2014. == Locations == Since 2005, the University has got many new sites in the city of Worcester. === St John's Campus === St John's is the main campus. It is the central place for all courses, support departments and academic institutes. it does have any places that does business, computing, marketing or management. === City Campus === The university's second campus is known as City Campus. The Worcester Business School is here. === Riverside and Worcester Arena === In addition, the University occupies a large site adjacent to the River Severn, now known as \"Riverside\". This includes an Art Space & Exhibition building and a 2,000-seat capacity Sports Arena built as a new facility for sports, events, a base for the Worcester Wolves basketball team, a national centre of excellence for disability sports and as a further teaching and office space. The facility, known as Worcester Arena is also accessible to the local community. === The Hive === The Hive was opened in July 2012. It has a bunch of services for adults, children and adamic sections. It has 250,000 books, and huge archive collections. It also has meeting rooms, exhibition spaces and a studio theatre. == Environmental standing == The institution has been awarded the Carbon Trust Standard.Worcester University Retrieved 14 January 2010 The university has been recgonized for efficiency. == Academic profile == The University of Worcester is the UK's fastest growing University.News – University of Worcester . Worc.ac.uk (4 March 2014). Retrieved on 8 March 2014. Applications increased by 10.6% in 2009 and by 100% since 2004.The Guardian 10 May 2009 Retrieved 14 January 2010 The University has consistently recorded the largest increases in applications of any UK University for 7 years in a row. === Funding === As of April 2011, the University of Worcester has proposed to set its undergraduate Tuition Fees at £8,100 under the new regime announced by the Coalition Government. === Reputation and rankings === The university guide of the Times newspaper rates the university at place 81 out of 114 institutions.TimesOnline. Retrieved 14 January 23010 In the National Student Survey students from the University rated their overall satisfaction at 80% in 2008/09. A number of subject areas received excellent levels of satisfaction, with an overall student satisfaction of 92% in Sports Science and 89% in Initial Teacher Training. In March 2010, the University was ranked 54th of the top public sector places to work. The Complete University Guide 2015 says it the University is 104th out of 123 institutions. == Research == In August 2010, the University was granted Research Degree awarding powers, enabling it to confer the awards of MPhil and PhD. Before this the Coventry University assisted in the academic awarding of these degrees. The university includes eight national research centres: * The National Pollen and Aerobiology Research Unit from where all UK national pollen forecasts originate, * The Centre for Rural Research, which examined the psychological effects of the mass flooding in the UK in recent years.Centre for Rural Research – University of Worcester . Worc.ac.uk (22 November 2013). Retrieved on 8 March 2014. * The International Centre for Children's Literature, Literacy and Creativity is, with University of Cambridge and Roehampton University, one of the three UK university centres to employ full-time children's literature professors. * The Motion Performance Centre which looks at sports injuries, and rehabilitation techniques using motion capture technology. The Human Performance Laboratories work alongside to provide data on exercise and how it affects the body.Motion & Performance Centre – University of Worcester . Worcester.ac.uk (22 November 2013). Retrieved on 8 March 2014. * The Centre for People @ Work * The Centre for Applied Health Research * The Association for Dementia Studies was launched at the University in February 2010. It will work with people with dementia, their families, health professionals, care providers, commissioners, and government agencies to provide high quality research, training and education. * The Centre for Ethical Leadership, which will be officially launched in November 2010. The Centre will work with leaders at different levels and sectors to help them think about decision making within an ethical framework. This will enable them to reflect on decisions that acknowledge and respect contested values in areas such as the environment, social justice and governance. It provides sessions to enable leaders to develop their skills in this area, develops and supports networks of individuals to discuss ethical dilemmas and provide forums for discussion, engages with others debating this area, stimulates and conducts research in the area of ethical leadership, and draws together and makes available existing research. == Student life == Worcester Students' Union is the student government organization for students at the University of Worcester.Home. Worcsu.com. Retrieved on 8 March 2014. The Union a President, a Vice-President (Education), a Vice-President (Student Activities), and 7 other officers. === Sports activities === The University is home to the Worcester Wolves basketball team.University of Worcester students selected for GB blind football team – British Universities & Colleges Sport. Bucs.org.uk (29 June 2009). Retrieved on 8 March 2014. ==Notable alumni== *Waqar Azmi OBE, diplomat and former Chief Adviser to the Prime Minister, Cabinet OfficeGlittering prizes | General. Times Higher Education (2 November 2001). Retrieved on 8 March 2014. *Jacqui Smith (politician) *Daryl Mitchell (cricketer) *Swaroop Sampat (actress and Femina Miss India 1979) *Alan Dickens (rugby player) *John Shimmin (politician) *Rob Taylor (footballer, born 1985) *Adam Willis (footballer) *Imogen Thomas (model) *Kyle Pryor (actor, Home and Away) *Matthew Raggett (educationalist) *Rosie Spaughton (youtuber) *Crispin Boden-Tebbutt (Digital Marketer) == References == ==Other websites== * University of Worcester (official website) * Worcester Students' Union (official website) * Worcester Wolves (official website) * Guardian Newspaper Official University Guide * British Council website * What Uni review site Category:Worcester Category:Universities in England Category:1946 establishments in the United Kingdom Category:1940s establishments in England",
 "title": "University of Worcester"
}