{
 "id": "540958",
 "text": "Bedminster is a township in Somerset County, New Jersey, United States. The township's population was 8,272, according to the 2020 United States Census. Bedminster was the corporate headquarters of AT&T; Corporation, before its merger with SBC Communications (the combined company is now known as AT&T; Inc.).Dalton Jr., Richard J. \"SBC, spawn of AT&T;, now in talks to buy it\" , Newsday, January 28, 2005. Accessed May 8, 2012. \"AT&T;'s residential business, on the other hand, was once its core but has faced more competition amid lower profits as cellular service providers and cable companies edged their way into the phone business. So last year, AT&T;, based in Bedminster, N.J., discontinued marketing residential long-distance service to new customers.\" ==Geography== According to the United States Census Bureau, the township had a total area of 26.38 square miles (68.31 km2), including 26.12 square miles (67.66 km2) of land and 0.25 square miles (0.66 km2) of water (0.96%). ==Demographics== As of the 2020 United States Census, there were 8,272 people, 4,222 households, and 2,084 families residing in the township. The population density was 316.7 people per square mile (122.3/km²). ==Sports== Trump National Golf Course - owned by Donald Trump, the course features 36 holes designed by Tom Fazio, with fees to join of $350,000.Bertoni, Steven; and Pendleton, Devon. \"In Pictures: Millionaire Mega Toys\", Forbes, November 6, 2009. Accessed May 8, 2012. \"Trump National Bedminster sums up the billionaire himself: golf, luxury and real estate. The 36-hole, Tom Fazio-designed club costs $350,000 to join, plus $18,500 in annual dues.\" == Government == === Local government === Bedminster Township has a township government. The five-member Township Committee is elected by the voters serve three-year terms of office.2012 New Jersey Legislative District Data Book, Rutgers University Edward J. Bloustein School of Planning and Public Policy, March 2013, p. 77.\"Forms of Municipal Government in New Jersey\" , p. 7. Rutgers University Center for Government Studies. Accessed June 3, 2015. At an annual reorganization meeting held during the first week of January, the Township Committee selects one of its members to serve as mayor.Your Municipal Government , Bedminster Township. Accessed June 3, 2011. ===Politics=== As of March 23, 2011, there were a total of 6,183 registered voters in Bedminster Township. == Education == The Bedminster Township School District serves students in pre-Kindergarten through eighth grade at Bedminster Township Public School. As of the 2022-23 school year, the district's one school had an enrollment of 455 students and 53.9 classroom teachers (on an FTE basis), for a student–teacher ratio of 10.25:1.District information for Bedminster Township School District, National Center for Education Statistics. Accessed May 10, 2024. Public school students in ninth through twelfth grades attend Bernards High School. It is part of a sending/receiving relationship with the Somerset Hills Regional School District. It is a K - 12 district that serves students from Bernardsville, Far Hills and Peapack-Gladstone.Bedminster Township School District 2014 Report Card Narrative, New Jersey Department of Education. Accessed May 21, 2015. \"After graduation from the 8th grade, the majority of our students attend Bernards High School.\"Somerset County School Districts- Sending/Receiving/Regional , Somerset County Superintendent of Schools. Accessed August 6, 2014. ==Transportation== ===Roads and highways=== , the township had a total of of roadways. are maintained by the municipality, by Somerset County and by the New Jersey Department of Transportation.Somerset County Mileage by Municipality and Jurisdiction , New Jersey Department of Transportation, May 2010. Accessed November 13, 2013. Bedminster has Interstate 287 that which runs through the eastern section, while Interstate 78 runs mostly through the center of the township. U.S. Route 202 and U.S. Route 206 also pass through running parallel to I-287 from the Bridgewater area to Pluckemin. Major county roads that pass through include CR 512 and CR 523. ===Public transportation=== The closest New Jersey Transit service offered is at the Far Hills station on the Morris & Essex Lines., New Jersey Transit, backed up by the Internet Archive as of January 28, 2010. Accessed February 8, 2013. Somserset County operates bus service along Route 206.Transportation Services , Somerset County, New Jersey. Accessed August 6, 2014. ==Notable people== People who were born in, residents of, or otherwise closely associated with Bedminster Township include: * John DeLorean (1925–2005), founder of the De Lorean Motor Company.Staff. \"Festival celebrates the De Lorean\", BBC News, May 24, 2001. Accessed May 8, 2012. \"De Lorean was instructed to sell off the 434-acre estate in Bedminster for $15m to a golf course developer.\" * John H. Ewing (born 1918), member of the New Jersey General Assembly and the New Jersey Senate.King, Wayne. \"Bill to Cut Florio's Aid To Schools Is Gaining\", The New York Times, January 18, 1991. Accessed May 8, 2012. \"Senator John H. Ewing of Bedminster, a Republican member of the Senate Education Committee, was more pointed, attributing rising costs in some districts to 'waste and thievery.'\" * Steve Forbes (born 1947), editor-in-chief of Forbes magazine and president and chief executive officer of its publisher, Forbes Inc., and 2000 Presidential candidate.Hilzenrath, David S. \"No Blank Checks for Forbes\", The Washington Post, August 17, 1999. Accessed May 8, 2012. \"To match Bush's record $37 million haul, Forbes could have no choice but to sell part of the family business, liquidate real estate in his home town of Bedminster, N.J., or go heavily into debt.\" * John Honeyman (1729–1822), alleged \"spy of Washington\" during the American Revolutionary War, who lived the last 30 years of his life in the Lamington area and is buried in the Lamington Presbyterian Church Cemetery.Sadlouskos, Linda. \"Trump leads tribute to military, unfurls huge flag at golf course in Bedminster\" , Home News Tribune, September 21, 2008. Accessed May 8, 2012. \"John Honeyman, a township resident who was a spy for Gen. George Washington, is buried 'around the corner' at the Lamington Church, the mayor said.\" * Robert Wood Johnson IV (born 1947), owner of the New York Jets and great- grandson of the founder of the Johnson & Johnson Corporation.Sandomir, Richard. \"The Jets Fill One Opening: New Owner at $635 Million\", The New York Times, January 12, 2000. Accessed September 30, 2007. \"Johnson, who is 52 years old, has homes in Manhattan and Bedminster, N.J.\" * Thomas Kean (born 1935), former Governor of New Jersey and Chairman of the 9/11 Commission.\"WEDDINGS; Rhonda Norton, Thomas Kean Jr.\", The New York Times, November 13, 1994. Accessed May 8, 2012. \"Rhonda Lee Norton, the daughter of Mr. and Mrs. Robert L. Norton of Brecksville, Ohio, was married yesterday to Thomas H. Kean Jr., a son of former Governor Thomas H. Kean of New Jersey and Mrs. Kean, of Bedminster, N.J.\" * James Linn (1749–1821), represented in the United States House of Representatives from 1799 to 1801.James Linn, Biographical Directory of the United States Congress. Accessed December 3, 2007. * Zebulon Pike (1779-1813), American brigadier general and explorer for whom Pikes Peak in Colorado is named.PIKE, ZEBULON (1779-1813), Encyclopedia of the Great Plains. Accessed August 6, 2014. \"Son of an army officer, he was born at Lamberton (today Lamington), New Jersey, on January 5, 1779.\" * Mark Sanchez (born 1986), NFL quarterback who played for the New York Jets.Calder, Rich. \"It's showtime for B'way Mark Sanchez\", New York Post, January 21, 2010. Accessed February 2, 2010. \"Lives with his brother Brandon in Bedminster, NJ\" * Drew Sheneman (born c. 1975), editorial cartoonist whose work has appeared in The Star-Ledger since 1998.Sheneman's Sketchpad: About the Author , The Star-Ledger. Accessed November 13, 2013. \"He currently resides in Bedminster with his wife and daughter.\" * John Van Dyke (1807–1878), represented in the United States House of Representatives from 1847 to 1851.John Van Dyke, Biographical Directory of the United States Congress. Accessed September 1, 2007. * Harrison A. Williams (1919–2001), United States Senator involved in the Abscam scandal.Martin, Douglas. \"Ex-Senator Harrison A. Williams Jr., 81, Dies; Went to Prison Over Abscam Scandal\", The New York Times, November 20, 2001. Accessed May 8, 2012. \"Harrison A. Williams Jr., the Democratic senator from New Jersey who used his considerable power to further the interests of labor and education before being convicted of bribery and conspiracy in the Abscam scandal, died on Saturday. He was 81 and lived in Bedminster.\" ==References== ==Other websites== * Bedminster Township website * Bedminster Township Public School * * School Data for the Bedminster Township Public School, National Center for Education Statistics * The Vanderveer House and Knox Museum- See where General Henry Knox resided while building and managing the Pluckemin Artillery winter Cantonment of 1778-1779. * The history of the Pluckemin Artillery Academy- America's first military training academy * The Historical Society of the Somerset Hills - providing historic preservation and local history for Bedminster Township and the other townships that make up the Somerset Hills in Somerset County, New Jersey. * Somerset Hills School District * Hills List. Local information for Bedminster and Basking Ridge Category:Townships in New Jersey",
 "title": "Bedminster, New Jersey"
}