{
 "id": "540962",
 "text": "New Jersey Transit Corporation, known as NJ Transit (NJT), is a state-owned public transportation system that serves New Jersey. It operates bus, rail, and commuter rail services throughout the state. It connects New York and Philadelphia. NJT is the largest statewide system for public transporation and the third largest provider of bus and rail.Vantuono, William C. \"New Jersey's innovators: New Jersey Transit's billion-dollar capital budget is focused on creating a unified, statewide network of commuter and light rail lines. New technologies are a key part of that strategy\", Railway_Age, April 2004. Accessed August 22, 2007. \"In late 2003, 20 years after portions of the Pennsylvania, Erie-Lackawanna, Jersey Central, and Lehigh Valley railroads or their successors were combined to form the nation's third-largest commuter rail system, Secaucus Junction opened.\" ==History== NJT was founded on July 17, 1979 by the New Jersey Department of Transportation (NJDOT). It was to address many transportation issues. In 1983, NJT assumed operation of all commuter rail service in New Jersey from Conrail. It now operates most passenger and commuter rail lines in the state. The exceptions are Amtrak; the Port Authority Trans-Hudson (PATH), which is owned by the Port Authority of New York and New Jersey; the PATCO Speedline; two SEPTA Regional Rail lines, the West Trenton Line and the Trenton Line; and a handful of tourist trains in the southern and northwestern parts of New Jersey. Since inception, rail ridership has quadrupled. During Hurricane Sandy in October 2012, the rail operations center of NJ Transit was flooded by of water. == Governance == The Governor of New Jersey appoints a seven-member Board of Directors. ==Current operations== NJT's operations are divided into three classes: bus, rail, and light rail. ===Bus=== NJT operates 871 bus routes using 2,477 buses ===Light Rail=== NJT operates three light rail lines: *Hudson-Bergen Light Rail – a 24-stop multi-branch line along the Gold Coast from Bayonne to North Bergen, with a major stop at Hoboken Terminal, all in Hudson County. The fleet consists of 52 Kinki Sharyo electric light rail vehicles owned by NJT and operated under contract by 21st Century Rail. *Newark Light Rail – two segments serving Newark and the surrounding area. The Newark City Subway has 12 stops, is long, connecting Newark Penn Station to North Newark and Bloomfield. The Broad Street Extension has five stops, is long, and connects Newark Penn Station to Newark Broad Street Station. The fleet consists of 21 Kinki Sharyo electric light rail vehicles owned and operated by the Central Division of NJT Bus Operations. *River Line – a 21-stop line from Trenton to Camden along the Delaware River, mostly along the Bordentown Secondary line formerly owned by Conrail and CSX. The fleet consists of 20 Stadler GTW diesel light rail vehicles owned by NJT and operated under contract by Southern New Jersey Rail Group. ===Rail=== NJT has 11 commuter rail lines: *Atlantic City Line *Bergen County Line *Main Line *Meadowlands Rail Line *Montclair-Boonton Line *Morris & Essex Lines, consisting of: **Morristown Line **Gladstone Branch *North Jersey Coast Line *Northeast Corridor Line (includes the Princeton Branch) *Pascack Valley Line *Raritan Valley Line Their rolling stock consists of GE/Avco Arrow III EMUs, Bombardier/Alstom Comet series coaches and Bombardier multilevel coaches. Their electric locomotive fleet consists of Bombardier ALP-46 locomotives, while their diesel locomotive fleet consists of EMD GP40, EMD F40PH, Alstom PL42AC, and Bombardier ALP-45DP locomotives. thumb|A map of the NJ Transit rail system ==Security== The New Jersey Transit Police Department (NJTPD) is the transit police force for NJT. It is a general-powers police agency with statewide jurisdiction with the primary focus on policing the numerous bus depots, rail, and light-rail stations throughout New Jersey. It employs 240 sworn police officers. ==Projects== ===Ongoing projects=== ====Repair, recovery and resiliency projects==== Superstorm Sandy, on October 29, 2012, caused a 13-foot tidal surge that damaged many coastal communities.. The storm's aftermath left damaged tracks, moved bridge girders, and flooded rail stations. NJT has proposed the construction of a new generator in the Kearny Meadows that would be flood-proof. and support an electrical \"micro-grid\" that would be exclusively for train service.Meadows redevelopment ratables at risk. The Observer. Retrieved on 2014-06-23. ====Bus rapid transit==== Bus rapid transit in New Jersey is plentiful. ====Northern Branch==== NJT is planning to extend the Hudson-Bergen Light Rail to Englewood or Tenafly . ====Glassboro–Camden Line==== The Glassboro–Camden Line is a diesel multiple unit (DMU) light rail system planned for southwestern part of New Jersey in the United States. At its northern end in Camden it will connect with the River LINE with which its infrastructure and vehicles will be compatible. At the northern terminus, the Walter Rand Transportation Center, paid transfers will be possible to the PATCO Speedline. ===Proposed projects=== ====West Trenton==== The West Trenton Line is a proposed service connecting Trenton to Newark. NJT's estimate of the cost was $197 million.West Trenton Line , accessed December 21, 2006 To date, no money has been given. ====Passaic-Bergen Rail Line==== The Passaic-Bergen Passenger Rail Project would reintroduce passenger service on the New York, Susquehanna and Western Railway right-of-way between Hawthorne and Hackensack using new Diesel Multiple Unit rail cars. ====Monmouth-Ocean-Middlesex (MOM)==== The Monmouth-Ocean-MiddlesexPETOIA: It's time to fast-track MOM line | The Asbury Park Press NJ. app.com. Retrieved on 2014-06-23. line is a proposed south and central New Jersey commuter rail route to New Brunswick, Newark and New York's Penn Station. This would restore service previously provided by the Central Railroad of New Jersey. It would run on a 40.1-mile rail train line. It would providec service from Monmouth Junction (South Brunswick) to Lakehurst . From Monmouth Junction the line would continue southeast to Jamesburg, Monroe, Englishtown, Manalapan, Freehold Borough, Freehold Township, Howell and Farmingdale. Passengers for New York would transfer at Newark. Eight new stations and a train storage yard would be constructed. New Jersey News | The Asbury Park Press NJ. app.com. Retrieved on 2014-06-23. In August 2010, NJT received $534,375 in Federal Funds to see if there are possibilities of a MOM line. Since that time there has been no further advancement of the project.Once-proposed Monmouth-Ocean-Middlesex rail line gathers dust. NJ.com (2014-01-22). Retrieved on 2014-06-23. ====Lehigh Valley==== In November 2008, the Lehigh Valley Economic Development Corporation started a study to explore making the Raritan Valley Line to the Lehigh_Valley region of eastern Pennsylvania. It could lead to stops in Allentown, Bethlehem and Easton.\"County eyes N.J. rail extension to area,\" The Morning Call, November 7, 2008. These cities were last served in 1967.Joseph Corso, The Central Railroad of New Jersey http://www.jcrhs.org/cnj.html\"Jersey Central: Coal, Commuters, and a Comet\" Classic Trains, Winter 2011 http://ctr.trains.com/~/media/Files/PDF/CNJ-Winter2010.pdf \"The Central Railroad of New Jersey, The Big Little Railroad\" AmericanRails.com http://www.american-rails.com/central-railroad-of-new-jersey.html === Cancelled === ====Newark-Elizabeth Rail Link==== It was planned to connect the Downtown portion of Newark with Elizabeth via Newark Liberty International Airport. NJT is no longer pursuing the Newark-Elizabeth Rail Link. == References == == Other websites == * NJ Transit official site * NJ Transit daily rail operations visualized (Java applet, unofficial) Category:Transport in New Jersey Category:State-owned enterprises",
 "title": "New Jersey Transit"
}