{
 "id": "54106",
 "text": "The East Midlands is one of the regions of England and is the eastern half of the Midlands. The counties of Derbyshire, Leicestershire, Rutland, Northamptonshire, Nottinghamshire and most of Lincolnshire belong to this region. The highest point in the region is Kinder Scout, in Derbyshire at 2,088 ft (636 m). ==Population and settlement== Its main cities are Nottingham, Leicester, Lincoln, Derby, and Northampton. Leicester is officially the largest city in the region, although the largest area is the Nottingham Urban Area. East Midlands Airport is situated between the three main cities of Derby, Leicester and Nottingham. Midland Mainline and GNER trains go to London and to Birmingham and the South West. The M1 motorway serves the three largest cities. ==History== A historical basis for such an area exists in the Five Burghs of the Danelaw. The current government office region was created in 1994. ==Local government== The official region consists of the following subdivisions: Map Ceremonial county Shire county /unitary Districts Derbyshire 1. Derbyshire High Peak, Derbyshire Dales South Derbyshire, Erewash Amber Valley, North East Derbyshire Chesterfield, Bolsover 2\\. Derby Nottinghamshire 3. Nottinghamshire Rushcliffe, Broxtowe Ashfield, Gedling Newark and Sherwood, Mansfield Bassetlaw 4\\. Nottingham Lincolnshire 5\\. Lincolnshire Lincoln, North Kesteven South Kesteven, South Holland, Boston, East Lindsey, West Lindsey Leicestershire 6. Leicestershire Charnwood, Melton Harborough, Oadby and Wigston Blaby, Hinckley and Bosworth North West Leicestershire 7\\. Leicester 8\\. Rutland 9\\. Northamptonshire South Northamptonshire, Northampton Daventry, Wellingborough Kettering, Corby East Northamptonshire == Other websites == * East Midlands Development Agency * East Midland Directory * East Midlands Regional Assembly * Government Office for the East Midlands * Government's list of councils in the East Midlands * East Midland Network Exchange",
 "title": "East Midlands"
}