{
 "id": "541074",
 "text": "WWE Fastlane is a series of professional wrestling pay-per-view and livestreaming shows made by WWE. They are broadcast live and are also available on Peacock and the WWE Network. The first event took place in 2015, replacing Elimination Chamber in the February time slot of WWE's pay-per-view calendar. The name of the event is a reference to its position on the \"Road to WrestleMania\". In 2020 and 2022, no Fastlane events happened. The 2023 event, which took place in October, was the last Fastlane event so far. ==Dates and venues== Raw-branded event SmackDown-branded event # Event Date City Venue Main Event Ref. 1 Fastlane (2015) February 22, 2015 Memphis, Tennessee FedExForum Daniel Bryan vs. Roman Reigns for a WWE World Heavyweight Championship match at WrestleMania 31 2 Fastlane (2016) February 21, 2016 Cleveland, Ohio Quicken Loans Arena Brock Lesnar vs. Dean Ambrose vs. Roman Reigns in a triple Threat match for a WWE World Heavyweight Championship match at WrestleMania 32 3 Fastlane (2017) March 5, 2017 Milwaukee, Wisconsin Bradley Center Kevin Owens (c) vs. Goldberg for the WWE Universal Championship 4 Fastlane (2018) March 11, 2018 Columbus, Ohio Nationwide Arena AJ Styles (c) vs. Baron Corbin vs. Dolph Ziggler vs. John Cena vs. Kevin Owens vs. Sami Zayn in a Six-Pack Challenge for the WWE Championship 5 Fastlane (2019) March 10, 2019 Cleveland, Ohio Quicken Loans Arena The Shield (Dean Ambrose, Seth Rollins, and Roman Reigns) vs. Baron Corbin, Bobby Lashley, and Drew McIntyre in a six-man tag team match 6 Fastlane (2021) March 21, 2021 St. Petersburg, Florida WWE ThunderDome at Tropicana Field Roman Reigns (c) vs. Daniel Bryan for the WWE Universal Championship with Edge as the special guest enforcer 7 Fastlane (2023) October 7, 2023 Indianapolis, Indiana Gainbridge Fieldhouse Seth \"Freakin\" Rollins (c) vs. Shinsuke Nakamura in a Last Man Standing match for the World Heavyweight Championship == References == == Other websites == * Fastlane Category:2015 establishments in the United States",
 "title": "WWE Fastlane"
}