{
 "id": "541150",
 "text": "Bernards High School is a four-year high school in Somerset County, New Jersey, United States. It serves grades 1-12 and kindergarten. It has students from Bernardsville, Far Hills and Peapack-Gladstone. Students from Bedminster are sent to the district's high school for grades 9-12.Somerset County School Districts-Sending/Receiving/Regional , Somerset County Superintendent of Schools. Accessed June 28, 2011. The school is in Bernardsville. In 2012-13 school year, the school had 785 students and 60.7 classroom teachers.School Data for Bernards High School, National Center for Education Statistics. Accessed March 24, 2015. ==Awards, recognition and rankings== In its 2013 report on \"America's Best High Schools\", The Daily Beast said the school as 235th best in the nation .Streib, Lauren. \"America's Best High Schools\", The Daily Beast, May 6, 2013. Accessed May 8, 2013. In the 2011 \"Ranking America's High Schools\" issue by The Washington Post, the school was at 6th in New Jersey and 288th nationwide.Mathews, Jay. \"The High School Challenge 2011: Bernards High School\" , The Washington Post. Accessed July 22, 2011. ==Athletics== Bernards High School competes in the Skyland Conference. it is under the watch of the New Jersey State Interscholastic Athletic Association (NJSIAA).League Memberships – 2014-2015 , New Jersey State Interscholastic Athletic Association. Accessed September 8, 2014. ==History== From February of 2002 until the end of the 2008-2009 school year, the school offered students the to take part in the International Baccalaureate Diploma Program (IB). It is a comprehensive two-year curriculum taken by a few junior and senior students., NJ.com. Accessed May 3, 2016., The Bernardsville News. Accessed May 3, 2016.Find an IB World School—results, International Baccalaureate Organization. Accessed May 24, 2007. Advanced Placement (AP) courses are still offered, which may also lead to college credit. ==Administration== Core members of the school's administration are:Administration , Bernards High School. Accessed September 8, 2014. *Scott Neigel, Principal *Dr. Michael Corbett, Assistant Principal *Michael Hoppe, Assistant Principal / Athletic Director ==Notable alumni== * Roger Bart (born 1962, class of 1980), Tony award-winning actor.Hatala, Greg. \"Glimpse of History: Arm-in-arm at commencement\", The Star-Ledger, June 23, 2014. Accessed September 8, 2014. \"Some of the school’s notable alumni include Tony Award-winning actor Roger Bart (’80), John Geils Jr. of the J. Geils Band (’64) and Academy Award- winning actress Meryl Streep (’67).\" * Philip Capice (born 1931, class of 1948), Emmy award winning television producer. Producer of TV shows Dallas, Eight is Enough, TV movie Sybil and many others * John W. Geils Jr. (born 1946, class of 1964), musician, J. Geils of The J. Geils Band.Staff. \"Meryl Streep Before She Was Meryl Streep\", 20/20, February 26, 2010. Accessed June 28, 2011. \"'Funny story, she went out with J. Geils from the J. Geils Band,' said Castrilli. 'He was a senior at Bernards High School when we were freshmen. And it wasn't a serious dating relationship, but she hung around with him, and he -- seniors were allowed to drive to school. And he drove her. ... So you know, and it was kind of like a -- senior dating a freshman, whoa. It was almost scandalous, you know?'\" * Meryl Streep (born 1949, class of 1967), Academy Award-winning actress, attended BHS in the late 1960s.\"N.J. TEACHERS HONOR 6 GRADUATES\" , The Philadelphia Inquirer, November 12, 1983. Accessed July 20, 2007. * Ryan Scott Weber (born 1980, class of 1998), filmmaker.Zavalick, Charlie. \"B’ville filmmaker hopes to make horror classic here\", Bernardsville News, January 21, 2011. Accessed May 8, 2013. \"Weber, a 30-year-old Pine Street resident, can normally be found at the Bernardsville Library where he has worked part-time in technical services for about two years. But the 1998 Bernards High School graduate has aspirations to become a film director and hopes Mary Horror can help jump-start his career.\"Baratta, Amy. \"Zombies invading Bernardsville; Local filmmaker working on second horror flick\", Bernardsville News, August 24, 2012. Accessed May 8, 2013. \"Filmmaker Ryan Scott Weber is at it again. Just nine months after he premiered his first horror flick, locally filmed Mary Horror, at Bernards High School, the 32-year-old borough man has taken to the streets of Bernardsville to film a sequel.\" ==References== ==Other websites== *Bernards High School website *The Somerset Hills School District *Data for Bernards High School *Bernards High Alumni website Category:Schools in New Jersey Category:High schools in the United States",
 "title": "Bernards High School"
}