{
 "id": "54127",
 "text": "Nottingham Shown within England Geography Status Unitary Authority, City (1897) Ceremonial county Nottinghamshire Historic county Nottinghamshire Region East Midlands Constituent country England Sovereign state United Kingdom Area \\- Total Ranked 274th 74.61 km² Admin HQ Nottingham ISO 3166-2 GB-NGM ONS code 00FY OS grid reference Coordinates 52°57N 1°08W NUTS 3 UKF14 Demographics Population: Total (305,700) Density Ethnicity (2011 census) 64.4% White 13.1% S. Asian 16.9% Afro-Caribbean 29.8% other Politics Nottingham City Council http://www.nottinghamcity.gov.uk/ Leadership Leader & Cabinet Control Nottingham is a city (and county town of Nottinghamshire) in the East Midlands of England. The centre of Nottingham lies on the River Leen and its southern boundary follows the course of the River Trent, which flows from Stoke to the River Humber estuary. According to the 2011 census, Nottingham has a city population of 305,700. Nottingham is a member of the English Core Cities Group. It has been nicknamed \"Shottingham\" due to the high rate of gun crime. == History == The first evidence of settlement dates from pre-Roman times, and it is clear that the Romans also lived in the area. An early name for Nottingham was \"Tigguo Cobauc\" which means \"a place of caves.\" Founded by Anglo-Saxon invaders after 600 AD, parts of the settlement have included man- made caves, dug into soft sandstone. Nottingham was later captured by the Danes (Vikings) and in the 9th century became one of the five boroughs (fortified towns) of the Danelaw. The legend of Robin Hood developed in the Middle Ages. Robin Hood is said to have lived in Sherwood Forest, which extended from the north of Nottingham to the north side of Doncaster, Yorkshire. His main opponent was the Sheriff of Nottingham. While the legends are almost certainly untrue, particularly in their details, they have had a major impact on Nottingham, with Robin Hood imagery a popular choice for local businesses and many modern tourist attractions use the legend. The Robin Hood Statue in Nottingham is outside the Nottingham Castle within walking distance from the Old Market Square. Three pubs in Nottingham claim the title of England's Oldest Pub. The contenders are Ye Olde Trip To Jerusalem near the castle, The Bell on the Old Market Square, and The Salutation on Maid Marian Way. In the 18th and 19th centuries, much of Nottingham's wealth was founded on the textile industry. == Settlements within and around Nottingham == Districts within Nottinghamshire 1 Rushcliffe 2 Broxtowe 3 Ashfield 4 Gedling 5 Newark and Sherwood 6 Mansfield 7 Bassetlaw 8 Nottingham === Within the City of Nottingham === * Alexandra Park * The Arboretum * Aspley * Bakersfield * Beechdale * Bilborough * Bulwell * Basford * Bestwood Park * Carrington * Cinderhill * Clifton * Colwick * Dunkirk * Forest Fields * Hockley * Hyson Green * Lace Market * Lenton * Lenton Abbey * Mapperley * Mapperley Park * Mapperley Plains * The Meadows * Nottingham City Centre * The Park * Radford * Rise Park * Sherwood * Sneinton * St Anns * Strelley * Top Valley * Whitemoor * Wilford * Wollaton === Around the City of Nottingham === * Arnold * Beeston * Bulcote * Burton Joyce * Carlton * Chilwell * Daybrook * Eastwood * Edwalton * Gedling * Holme Pierrepont * Hucknall * Ilkeston (Derbyshire) * Kimberley * Kirkby-in-Ashfield * Long Eaton (Derbyshire) * Netherfield * Nuthall * Porchester * Redhill * Ruddington * Sandiacre (Derbyshire) * Stapleford * Thorneywood * Toton * Trowell * West Bridgford * Woodthorpe === Twin Cities === * - Ghent * - Harare * - Karlsruhe * - Ljubljana * - Minsk * - Ningbo * - Poznań === Famous people from Nottingham === Famous people born in or near Nottingham include (sorted by DOB): * (1763) George Africanus, noted Nottingham entrepreneur of African origin * (1793) George Green (of Green's Mill), mathematician and physicist, famed for Green's theorem * (1829) William Booth, founder of The Salvation Army * (1850) Jesse Boot, chairman and managing director of Boots the Chemists who transformed it into a national concern. Company was founded in Nottingham in 1849 by his father, (1815) John Boot * (1935) Stella Rimington, first female head of MI5, educated at Nottingham High School for Girls Novelists and poets * (1785) Henry Kirke White poet * (1788) The poet Lord Byron resided at Newstead Abbey and is buried at nearby Hucknall along with his mathematical daughter (1815) Ada Lovelace * (1885) D. H. Lawrence, internationally famous author, born in Eastwood and educated at Nottingham High School == References == == Other websites == * Nottingham in Pictures * Student guide to Nottingham * globalnet.co.uk * BBC Nottingham * The Open Guide to Nottingham * Nottinghamshire Independent Media Centre * Ye Olde Trip to Jerusalem Inn * The Park Estate * Nottingham Trent University * New College Nottingham * Nottingham Playhouse * Nottingham Theatre Royal and Concert Hall * History of Nottinghamshire * The University of Nottingham * Nottingham Web Resources - Nottingham directory and pictures * Weather For Nottingham * Nottingham business guide * A Brief History of Nottingham From \"Local and National Histories\" by Tim Lambert * Shoppingham a shopping guide of local shops - This is Nottinghams guide to local shops Category:Nottingham Category:Unitary authorities",
 "title": "Nottingham"
}