{
 "id": "54129",
 "text": "\"Little Red Riding Hood\" (or \"Little Red Cap\") is a French fairy tale for young children about a young girl and a wolf. The story comes from a folktale which means that it was a spoken story for a long time before it was a written story. It was first written down in the late 1600s, by Charles Perrault.Bottigheimer, Ruth. (2008). \"Before Contes du temps passe (1697): Charles Perrault's Griselidis, Souhaits and Peau\". The Romantic Review, Volume 99, Number 3. pp. 175-189 The best-known version (the way the story is told) is by the Brothers Grimm and dates from the 19th century (1800s). == Story == The most famous version of the story is the one written by the Brothers Grimm in the 19th century. The Brothers Grimm listened to many traditional stories from old people and wrote them into a book. They did not originally mean for their book to be read as children's stories; they were writing down German folklore for scholars to read. But their book became famous as a book of children's stories anyway. The title of the story is properly translated as \"Little Red Cap\" even though it is usually known in English as \"Little Red Riding Hood\".Jacob and Wilhelm Grimm, \"Little Red Cap\" A girl has been given red cap (or cloak and hood) to wear. Her mother sends her to take food to her sick grandmother. The mother tells her she must not stop on the way. A wolf sees the girl walking through the woods and makes a plan to eat her. The wolf politely asks the girl where she is going. The girl answers him, because he seems friendly. The wolf tells the girl to pick some flowers for her grandmother. While she is picking flowers, the wolf goes to grandmother's house and eats her. He puts on the grandmother's night-cap and gets into her bed. When the girl arrives at her grandmother's house, she gets into bed with the wolf. In the Perrault version, the girl is surprised to see what her \"grandmother\" looks like without her clothes. \"What big eyes you have!\" she cries. \"The better to see you with!\" the wolf responds. The dialogue continues, with the child remarking upon other body parts until she notes the wolf's big teeth. \"What big teeth you have!\" she cries. \"The better to eat you with!\" the wolf responds. The wolf leaps upon the child and eats the girl. In the Grimms' version, a woodcutter (lumberjack) comes and cuts open the wolf's body. He saves the grandmother and the girl who are still alive in the wolf's stomach. Then, stones are put in the wolf's body to kill the wolf. == History of the story == The story of Little Red Riding Hood seems to have been told for centuries in different countries, under different names. Anthropologist Dr. Jamie Tehrani said some versions of Little Red Riding Hood are 3000 years old. One of Aesop's Fables is a version of Little Red Riding Hood, according to Tehrani. In France, the story has probably been told for at least 700 years. In Italy, there are several versions. One is called The False Grandmother.Jack Zipes, In Hungarian folklore, the story is known as \"Piroska\" (Little Red), is still told in mostly the original version described above. The Great Fairy Tale Tradition: From Straparola and Basile to the Brothers Grimm, p 744, There is also a story from China which is like this, called The Grandmother Tiger.Alan Dundes, ed. (1989) Little Red Riding Hood: A Casebook. University of Wisconsin Press. , p. 21. There are also versions of the story from the Middle East and Africa. In the old versions of the story the wolf is sometimes a terrible monster or a werewolf. In one version of the story, the wolf gives the girl some food to eat. It is part of the body of her grandmother. The wolf tells the girl to throw all her clothes in the fire, and get into bed. She says that she needs to use the toilet first. The wolf ties her with a long string so that she cannot run away without him knowing. But the girl puts the rope around something else, and escapes. In these early versions of the story, Red Riding Hood escapes on her own. She uses her own intelligence and her own courage. The Brothers Grimm and other later authors added male heroes who save Red Riding Hood. === Charles Perrault === The story was first written and published in a book from 1697 by the French writer Charles Perrault. The name of the book, in English, is Tales and Stories of the Past with Morals: Tales of Mother Goose. The story is called The Little Red Cap (Le Petit Chaperon Rouge).Iona and Peter Opie, The Classic Fairy Tales. p. 93. Perrault's version of the tale is the original printed version, but it is likely based on an older oral tradition. It is uncertain if Perrault knew a folk tale from the south of France about a girl who cleverly escapes a werewolf occupying her grandmother's bed.Jacques Barchilon and Henry Pettit (1960) The Authentic Mother Goose Fairy Tales and Mursery Rhymes. Denver: Alan Swallow, p. 13. Perrault wanted to make a strong point about wise and foolish behaviour. He wanted to show that a beautiful young woman was in danger of having men with bad morals try to trick her into wrong behaviour. In Perrault's story the girl is eaten and there is no happy ending. ===Other versions=== The story has been changed many times in the centuries following its publication. It is a little different from the way that the Brothers Grimm tell it.Harry Velten, \"The Influences of Charles Perrault's Contes de ma Mère L'oie on German Folklore\", p 966, Jack Zipes, ed. The Great Fairy Tale Tradition: From Straparola and Basile to the Brothers Grimm, In their version, a huntsman slays the child-devouring wolf. He then frees the heroine from the animal's stomach. In some modern versions of the story, especially versions for very young children, the grandmother does not die. She hides in the closet or cupboard instead. === Telling the story for young children === Little Red Riding Hood often appears as a picture book or in collections of stories for very young children. An important part of the story is the questions and answers. In the story, the wolf knocks at the grandmother's door. The story goes: :\"Knock, knock!\" :\"Who's there?\" :\"Little Red Riding Hood!\" :\"Lift up the latch and walk in!\" The second section of repeating parts of the story happens when Red Riding Hood sees the wolf in her grandmother's bed. :Red Riding Hood says \"What big eyes you have!\" and the wolf replies \"The better to see you with!\" :Red Riding Hood says \"What big ears you have!\" and the wolf replies \"The better to hear you with!\" :Red Riding Hood says \"What big teeth you have!\" and the wolf replies \"The better to eat you with!\" These questions and answers also appear in older versions, for example Perrault's. === Stories with some of the same ideas === There are many stories in which a hungry wolf threatens a young person or animal. In most of these stories, the young one escapes by cunning (cleverness). One story is the Russian folktale Peter and the Wolf. The Brothers Grimm told the story of the Little Kids and the Wolf. Another story like this is The Three Little Pigs, first published by James Orchard Halliwell-Phillipps. == Meanings == As with many fairy tales, hidden messages can be found in Little Red Riding Hood. People have very different interpretations (ways of understanding the hidden meanings). There are two well-known ways that the story of Little Red Riding Hood can be interpreted. The first type of interpretation is about morality. It is about what is right and what is wrong. * The easiest message for children to understand is that it can be dangerous to trust strangers. * A more adult interpretation is about sexuality.Jane Yolen, Touch Magic p 25, Some people think that the story of the girl being \"eaten\" is really a symbol for rape. Susan Brownmiller wrote a book about it, called Against Our Will. Some of the other versions of the story seem to be more about rape than the way that the Brothers Grimm wrote it, which was for children.Catherine Orenstein, Little Red Riding Hood Uncloaked: Sex, Morality, and the Evolution of a Fairy Tale, p 145, * Charles Perrault makes his meaning quite clear. At the end of the story he writes: :\"From this story one learns that children, especially young lasses, pretty, courteous and well-bred, do very wrong to listen to strangers.... all wolves are not of the same sort.... there is one kind [that is not] noisy, nor hateful, nor angry, but tame, obliging and gentle, following the young maids in the streets, even into their homes. Alas! .... these gentle wolves are ... the most dangerous!\" :Some scholars say Perrault was not talking about rape but about sexual morality. At the time, there was an expression in French that is \"seen the wolf\" in English. If a girl had sex and was no longer a virgin, people would say she had \"seen the wolf.\" * Erich Fromm based his ideas only on the story the Brothers Grimm wrote. He sees the red cap of Little Red Riding Hood as a symbol for menstruation. * In old French and Italian versions of the story, the girl is independent and clever. She tricks the wolf and escapes without any help. The second way of seeing the stories has nothing to do with peoples' behaviour or feelings. These interpretations have to do with the cycle of the sun and the seasons, and with the cycle of life, with people dying and being born. * One interpretation is about night and day. In this interpretation, Red Riding Hood's bright red cap is a symbol for the sun. The sun is swallowed by the terrible night (the wolf). When she is cut out again, it represent the dawn.Maria Tatar, p 25, The Annotated Classic Fairy Tales, This bears a resemblance to the Norse Legend of the wolf Skoll (or Fenrir) who swallows the sun at Ragnarök.Alan Dundes, \"Intrepreting Little Red Riding Hood Psychoanalytically\", p 26-7, James M. McGlathery, ed. The Brothers Grimm and Folktale, * Another interpretation is that the tale is about the season of spring, or the month of May, escaping the winter.Alan Dundes, \"Intrepreting Little Red Riding Hood Psychoanalytically\", p 27, James M. McGlathery, ed. The Brothers Grimm and Folktale, The story could be seen as a description of the May Queen ritual that represents the coming of Spring, with the crown of flowers replaced by the red hood. == Adaptations == === Other re-tellings === François Adrien Boieldieu (1775 - 1834) made an opera from the story. The opera is called Le petit chaperon rouge. Its first performance was in Paris, in the year 1818. In 1927, Sir Compton MacKenzie used Little Red Riding Hood as the central character of a novel for children \"Santa Claus in Summer\". Red Riding Hood, in this re- telling, is the daughter of a highway man called Riding Hood. The story has been adapted to various media. Tex Avery made a cartoon out of it, Red Hot Riding Hood. He adapted the story to be more appealing to adults. Little Red Riding Hood works at a striptease club. The wolf, dressed in a suit, goes after the stripper (a stripper is a person who is paid to take off his or her clothes in public). Roald Dahl re-told the story in a funny poem about Little Red Riding Hood. It is in his collection Revolting Rhymes. Lon Po Po is an ancient Chinese version of Little Red Riding Hood which won the 1990 Randolph Caldecott Medal for its watercolour and pastel illustrations by Young. === Art === Many paintings have been done of Little Red Riding Hood. Artists who have painted pictures of this story are George Frederick Watts, Samuel Albrecht Anker, and François Richard Fleury. ==Other articles== * Big Bad Wolf == References == * Jack Zipes, ed. (2000) The Oxford Companion to Fairy Tales. Oxford University Press, pp. 302–3. == Other websites == * Fairyland Little Red Riding Hood. * SurLaLune Fairy Tale Pages: The Little Red Riding Hood story. ** meanings * Grimm's version of Little Red Riding Hood. * Different versions of Little Red Riding Hood. * Another collection of different versions of Little Red Riding Hood. * Abridged Version of Little Red Riding Hood. * Little Red Riding Hood, audio version Category:Works by Charles Perrault Category:Grimms' Fairy Tales Category:Former good articles",
 "title": "Little Red Riding Hood"
}