{
 "id": "541398",
 "text": "Phillip LaMarr (born January 24, 1967) is an American actor and comedian. He is best known for his voice roles in various animated series such Samurai Jack, Justice League, Justice League Unlimited, Futurama, Static Shock, and Foster's Home for Imaginary Friends. He was also best known as one of the original cast members on the sketch comedy series MADtv. ==Filmography== ===Film=== Year Title Role Notes Source A Cool Like That Christmas Harlan, Sockman Voice role Television film It's Pat Stage Manager Pulp Fiction Marvin Bio-Dome Assistant One Hand, Left Narrator Voice role Short film Zoomates Warren, Solicitor, Guy #1 Voice role Short film Suicide, the Comedy Erik Jimmy 'Licorice Whip' Wilson Free Enterprise Eric Second Pigeon, New Mayor Voice role Television film Kill the Man Marky Marx Eat Your Heart Out Stage manager Lost Cat Lost Cat A Man Is Mostly Water Testifier Gen¹³ Alex Fairchild Voice role Speaking of Sex Joel Johnson, Jr. Jane White Is Sick & Twisted Bert Cherish Yoga Instructor The Powerpuff Girls Movie I.P. Host, Local Anchor – green check mark indicates roles that have been verified by BTVA through closing credits Manna from Heaven Asst. Casino Manager Scooby-Doo! and the Legend of the Vampire Daniel Illiwara, King Voice role Direct-to-video animated film Creepy Freaks Assorted freaks Direct-to-video short film The Animatrix Duo Voice role Segment: \"Program\" Evil Alien Conquerors Vel-Dan Scooby-Doo! and the Loch Ness Monster Angus Haggart, Volunteer #2 Voice role Direct-to-video animated film Spider-Man 2 Train Passenger Uncredited Shark Tale Pawn shop owner Voice role Kangaroo Jack: G'Day U.S.A.! Rico, Mikey Voice role Direct-to-video animated film Back by Midnight Mile Away Kim Possible Movie: So the Drama Additional voices Voice role Animated television film Dr. Carver in Disguise, Board member Voice role Animated television film Stewie Griffin: The Untold Story Ollie Williams, additional voices Voice role Direct-to-video animated film Hellboy: Sword of Storms Bureau Member, Pilot, additional voices Voice role Direct-to-video animated film Brer Gator Voice role Direct-to-video animated film Choose Your Own Adventure: The Abominable Snowman Pasang Voice role Direct-to-video animated film Tekkonkinkreet Dusk Voice role TMNT Various voices Voice role Animated Futurama: Bender's Big Score Hermes Conrad, additional voices Voice role Direct-to-video animated film Billy & Mandy's Big Boogey Adventure Space Villain, Glacier of Evil, Dracula Voice role Dragonlance: Dragons of Autumn Twilight Riverwind, Gilthanas Voice role Animated Futurama: The Beast with a Billion Backs Hermes Conrad, additional voices Voice role Direct-to-video animated film Step Brothers Second Homebuyer Madagascar: Escape 2 Africa Guide Voice role Afro Samurai: Resurrection Teen Afro Samurai Voice role Futurama: Into the Wild Green Yonder Hermes Conrad, additional voices Voice role Direct-to-video animated film Battle for Terra Fabric Merchant Voice role Curious George 2: Follow That Monkey! Animal Park Attendant Voice role Batman: Under the Red Hood Rick Voice role Direct-to-video animated film Cats & Dogs: The Revenge of Kitty Galore Cat Spy Analyst #1, Paws Voice role Tom and Jerry Meet Sherlock Holmes Spike, Policeman Voice role Direct-to-video animated film Scooby-Doo! Camp Scare Darryl Voice role Direct-to-video animated film Hoodwinked Too! Hood vs. Evil Ernesto, Wood Voice role Real Steel ESPN Boxing Commentator Zambezia Announcer Bird Voice role Beverly Hills Chihuahua 3: Viva la Fiesta! Diego, Black Labbeth Bassist Voice role Direct-to-video film Tom and Jerry: Robin Hood and His Merry Mouse Spike Voice role Direct-to-video film Madly Madagascar Tour Guide Voice role Tom and Jerry's Giant Adventure Spike (characters) Voice role Direct-to-video animated film Scooby-Doo! Mecha Mutt Menace Stan, Mission Control Voice role Animated Khumba Elder #2 the Zebra Voice role Animated Men, Women & Children Shrink Batman Unlimited: Animal Instincts Man-Bat/Kirk Langstrom Voice role Direct-to-video animated film Curious George 3: Back to the Jungle Plane Mechanic, Dam Operator Voice role Cook-Off! Rev. Thaddeus Briggs, Esq. Lego DC Comics Super Heroes: Justice League: Cosmic Clash Brainiac Voice role Direct-to-video animated film 2018 Incredibles 2 Krushauer/Electrix Voice role Animated 2019 The Lion King (2019 movie) Impala Voice role ===Television=== Year Title Role Notes Source Mister T Woody Voice role Murphy Brown Ben Lawson Episode: \"Q & A on FYI\" The Royal Family Mr. Spencer Episode: \"Educating Al\" Jake and the Fatman Assistant Episode: \"There'll Be Some Changes Made\" Edward Episode: \"Robbing the Banks\" L.A. Law Reporter #3 Episode: \"Parent Trap\" Wings Gil the Mechanic Episode: \"Labor Pains\" Mad About You Marshall Episode: \"The Man Who Said Hello\" Sex, Shock & Censorship Butch Jones The Second Half Concierge Episode: \"Like Father, Like John\" Hangin' with Mr. Cooper Leonard Pickett Episode: \"For Whom the Heck the Bell Tolls\" Bob Brown Get Smart The Jazz Singer Episode: \"Shoot Up the Charts\" Living Single Joe Episode: \"If the Crew Fits\" Sawbones Stanley Johnson Television film –2000 MADtv Various characters Sketch comedy 112 episodes Happily Ever After: Fairy Tales for Every Child Various characters Voice role Johnny Bravo Various characters Voice role Himself Tuku, Steamboat Captain Voice role –2003 Hey Arnold! Jamie O. Johanssen Voice role –present Family Guy Ollie Williams, Judge, various characters Voice role 52 episodes –present Futurama Hermes Conrad, additional voices Voice role –2004 Carver Descartes, Bluke, Coach Coulson, Carver's Dad Voice role Clerks: The Animated Series Axel Foley Voice role Baby Blues Rex –01 Clifford the Big Red Dog Al the Brown Dog Voice role –04 Static Shock Virgil Ovid Hawkins/Static Voice role Buzz Lightyear of Star Command Rocket Crocket, Smeego, Patron Voice role –01 Yes, Dear Steve –01 Nikki Richard NYPD Blue Sidney Thompson –02 Invader Zim Poop Dawg, The Letter M, Noogums/shnooky Voice role The Legend of Tarzan Basuli Voice role –05 The Proud Family Michael, Coach Collins, additional voices Voice role –05 Harvey Birdman, Attorney at Law Black Vulcan Voice role –07 Hector Con Carne, Irwin's Dad, Dracula, Judge Roy Splean, various voices Voice role Philly Anthony –04 Samurai Jack Samurai Jack Voice role –06 Justice League/Justice League Unlimited John Stewart/Green Lantern, Steel Voice role The Zeta Project Schiz, Deputy Voice role Episode: \"Ro's Gift\" –04 Fillmore! Nelson Kelloch, MC, Elderly Man, Snooty Student Voice role –07 Kim Possible Vinnie Voice role –04 Ozzy & Drix Osmosis \"Ozzy\" Jones Voice role –06 Bolbi Stroganofsky Voice role Without a Trace Tom Lewis Jr. Episode: \"Kam Li\" A.U.S.A. Announcer Episode: \"Sullivan, Rakoff, & Associate\" –04 Evil Con Carne Hector Con Carne Voice role ChalkZone Boris, Mean Santa Voice role –05 What's New, Scooby-Doo? Toddy Stickfigger, Col. Henry Thomwald, Shaman Voice role –05 Eve Coleman The Bernie Mac Show Orlando Episode: \"That Old Mac Magic\" Reno 911! Craps guy The Powerpuff Girls Helmsman Voice role Episode: \"Crazy Mixed Up Puffs/Mizzen in Action\" Maya & Miguel Mr. Shue Episode: \"The Taming of Mr. Shue\" Burton Salt Dave the Barbarian Various voices –09 Foster's Home for Imaginary Friends Wilt, Jackie Kohnes, Red, Charlie Cell Phone Guy, Snooty Father, additional voices Voice role Megas XLR Rob, R.E.C.R., T-Bot Voice role Hi Hi Puffy AmiYumi Wacky Wally Voice role Mr. Phifer Voice role Episode: \"Fairy Friends and Neighbors/Just the Two of Us\" Cold Case Kiki Solis Episode: \"Discretion\" Second Time Around Myron Episode: \"You're Fired\" My Life as a Teenage Robot Orion, Boy Voice role Episode: \"Love 'Em or Leash 'Em/Teen Team Time\" Danny Phantom Tucker's Dad Episode: \"Public Enemies\" –08 Robot Chicken Ang Lee, Squirrel, Michael Jackson, Buddy Love Voice role Stop motion animated series Catscratch Squeakus – Mouse Voice role Episode: \"Bringing Down the Mouse/To the Moon\" Barbershop: The Series Derrick –06 Loonatics Unleashed Drake Sypher Voice role –08 My Gym Partner's a Monkey Virgil \"Bull\" Sharkowski, additional voices Voice role Maxie Zeus Voice role Episode: \"Thunder\" Totally Spies! Boogie Gus Voice role Episode: \"I Hate the Eighties\" The Jake Effect Marcus Episode: \"Don't Mess with Sloppy\" –07 Class of 3000 Philly Phil Voice role –08 Drawn Together Ray-Ray, UPS Man Voice role Avatar: The Last Airbender Earth King Voice role Afro Samurai Afro (teenager), Brother #1, Brother #3, Brother #5 Voice role Animated miniseries The Replacements M.C. McC Voice role Friday: The Animated Series Craig Jones Voice role Episode: \"Go with the Flow\" Curb Your Enthusiasm Pharmacist Episode: \"What Did Nick Do?\" According to Jim Kurt Episode: \"Any Man of Mine\" Afterworld Col. Nixon Voice role Web series Chowder Ancho, Muffintops, Star Hat Man, Old Teller Voice role –09 Randy Robertson, Joseph \"Robbie\" Robertson, Fancy Dan/Ricochet Voice role –09 Transformers Animated Jazz Oil Slick Jetstorm Alpha Trion Omega Supreme Voice role Phineas and Ferb Street Performer, Bango Ru Security Guard, additional voices Voice role Episode: \"Got Game?/Comet Kermilian\" Underfist: Halloween Bash Dracula, Grandmama, Bougersnatch Voice role Television special –09 Marcus Connor, additional voices Voice role –09 El Tigre: The Adventures of Manny Rivera Raheem, Captain Photon Voice role –14 Star Wars: The Clone Wars Kit Fisto, Bail Organa Orn Free Taa Voice role Wow! Wow! Wubbzy! Jam-Jam James Voice role –09 Wolverine and the X-Men Remy LeBeau/Gambit, Bolivar Trask Voice role The Goode Family Maffew, Principal Whitmore, Joaquim, Solosolo Voice role –11 Glenn Martin DDS Erasmus, Jersey Pete, Grandpa Bert Voice role The Super Hero Squad Show Captain Jamaica Episode: \"O, Captain, My Captain!\" –14 Castle Dr. Holloway Black Panther T'Shan Voice role DC Super Friends Cyborg, Gorilla Grodd Voice role Big Time Rush Hawk –12 J.A.R.V.I.S., Wonder Man Voice role –13 Young Justice Arthur Curry/Aquaman, Dubbilex, L-Ron, Green Beetle, Reach Ambassador Voice role G.I. Joe: Renegades Scrap- Iron, Doc Voice role Episode: \"Rage\" Curious George Dewey Freezum Voice role Night of the Hurricane Ollie Williams Voice role Television special Prep & Landing: Naughty vs. Nice Crumbles Voice role Television special Napoleon Dynamite Gorilla Lead Singer Voice role Happy Endings Phil Episode: \"Makin' Changes\" The High Fructose Adventures of Annoying Orange Various voices Scooby-Doo! Mystery Incorporated Melvin Keisterbaum Episode: \"Web of the Dreamweaver!\" Raising Hope Nolan Episode: \"Credit Where Credit Is Due\" Pound Puppies Steven, Doc, President Bigman, Copter Pilot –15 Ultimate Spider-Man J.A.R.V.I.S., Cloak, Dormammu Voice role –13 Kaijudo: Rise of the Duel Masters Gabriel Wallace, Cyber Lord Finbarr, Carny Voice role –15 Teenage Mutant Ninja Turtles Baxter Stockman Voice role Regular Show Puppy ManPuppy Man, Kyle Garrity, Cach Bankia, Judge, additional voices Voice role –14 Turbo FAST Smoove Move Voice role Hulk and the Agents of S.M.A.S.H. Dormammu Voice role TripTank Red Bird, Son, Jermaine, Doctor #2 Voice role Mixels Flurr, Chomly, Tentro Voice role –15 BoJack Horseman Judge Voice role –15 Star Wars Rebels Bail Organa Voice role Ben 10: Omniverse Jonesy, Bus Driver Voice role Episode: \"From Hedorium to Eternity\" The Simpsons Hermes Conrad Voice role Episode: \"Simpsorama\" Avengers Assemble Doctor Spectrum, Nuke Voice role The Millers Principal Walters Episode: \"Hero\" The Lion Guard Goigoi, additional voices Voice role The Real O'Neals Archie Episode: \"The Real Spring Fever\" Samurai Jack revival series Samurai Jack 2020-present Animaniacs (2020 TV series) Reporter/No-Name Voice role 2020-present Spitting Image Dwayne Johnson, Kevin Hart, LeBron James, RuPaul, Barack Obama, Kanye West, Tiger Woods, Jeff Bezos, the Flu Voice role Live-action television series ===Video games=== Year Title Role Notes Source Metal Gear Solid 2: Sons of Liberty Vamp Metal Gear Solid 2: Substance Vamp Star Wars: Knights of the Old Republic Gadon Jak II Sig, Krimzon Guards Terminator 3: Rise of the Machines Additional voices Samurai Jack: The Shadow of Aku Samurai Jack, Mad Jack, The Foreman, The Archeologist Fight Night 2004 Fight Commentator Uncredited Ground Control II: Operation Exodus Hervon Dreznor Doom 3 Additional voices Men of Valor Dean Shepard, Black Marine #2 Jak 3 Sig, Count Veger Vampire: The Masquerade – Bloodlines Malcolm, Skelter, Fat Larry, Dennis Star Wars Knights of the Old Republic II: The Sith Lords Captain Riiken, Patron, Peragus Administration Officer Mercenaries: Playground of Destruction Christopher Jacobs, News Correspondent 2 Madagascar Marty Samurai Western Donald, Thrower Quake 4 Marines Jak X: Combat Racing G.T. Blitz, Sig, Mizo, Kaeden, Thugs Operator, Ballard, SWAT Soldier True Crime: New York City Additional voices 50 Cent: Bulletproof Bugs Daxter Kaeden, Count Veger Scarface: The World Is Yours Drug dealer Kane Marvel: Ultimate Alliance T'Challa/Black Panther, Colossus, Moon Knight, Uatu the Watcher Final Fantasy XII Reddas Final Fantasy XII credits Spider-Man 3 Subway Worker #2, additional voices Shrek the Third Subway Worker #2, additional voices Final Fantasy Tactics: The War of the Lions Ramza Beoulve Condemned 2: Bloodshot LeRue, Bum Speed Racer: The Videogame Snake Oiler Metal Gear Solid 4: Guns of the Patriots Vamp Mercenaries 2: World in Flames Christopher Jacobs Saints Row 2 Mr. Sunshine Madagascar: Escape 2 Africa Tour Guide Cartoon Network Universe: FusionFall Samurai Jack, Wilt, Dracula Afro Samurai Brother #1, Brother #3, Teen Afro Samurai F.E.A.R. 2: Project Origin Cedric \"Top\" Griffin inFAMOUS John White [PROTOTYPE] Dr. Bradley Rangland Cloudy with a Chance of Meatballs Cal Devereaux, additional voices Star Wars: The Clone Wars – Republic Heroes Kit Fisto Jak and Daxter: The Lost Frontier Skyheed, Castaway Darksiders Vulgrim Mass Effect 2 Mouse, Rukar Iron Man 2 Additional War Machine Dialogue Toy Story 3: The Video Game Wheezy Monkey Island 2 Special Edition: LeChuck's Revenge Captain Dread, Woody the Woodsman, Governor Phatt's Guard, Skeleton The Secret of Monkey Island 2 Special Edition - Credits Lego Star Wars III: The Clone Wars Kit Fisto Marvel Super Hero Squad Online Luke Cage, Gambit, Nick Fury Thor: God of Thunder Heimdall inFAMOUS 2 John White Iron Brigade Morris Dead Island Sam B. X-Men: Destiny Gambit, Forge Kinect Disneyland Adventures Pirate #1 Star Wars: The Old Republic Master Syo Bakarn, Sanju Pyne, additional voices Diablo III King Leoric, additional voices Madagascar 3: The Video Game Marty Kingdom Hearts 3D: Dream Drop Distance Phoebus Darksiders II Vulgrim Metal Gear Rising: Revengeance Kevin Washington Injustice: Gods Among Us Aquaman, Green Lantern (John Stewart DLC Skin) Dead Island: Riptide Sam B. Far Cry 3: Blood Dragon Spider Saints Row IV Mr. Sunshine Lego Marvel Super Heroes Blade, Gambit, War Machine Teenage Mutant Ninja Turtles Baxter Stockman Young Justice: Legacy King Orin, Aquaman, Tourist, Villager Middle-earth: Shadow of Mordor Ratbag Mortal Kombat X Kotal Kahn Tales from the Borderlands Cassius Minecraft: Story Mode Gill ==References== Category:1967 births Category:Living people Category:African- American voice actors",
 "title": "Phil LaMarr"
}