{
 "id": "541476",
 "text": "The Western Wall Tunnel (, translit.: Minharat Hakotel) is a tunnel in Jerusalem. It expose part of the Western Wall where the prayer site ends and up to the northern end of the Wall. Most of the tunnel is located under buildings of the Muslim Quarter of the Old City of Jerusalem. The open-air portion of the Western Wall is about long. Most of its original length of is underground. The tunnel allows access to the morthern part of the Wall. ==History== In 19 BCE, King Herod doubled the area of the Temple Mount in Jerusalem. He did this by using part of the hill on the Northwest. To do this, four walls were built. The Temple Mount was expanded on top of these walls. These walls and the platform itself were still standing after the Temple was destroyed by the Romans in 70 CE. Since that time, much of the area next to the walls has been covered and built upon. Part of the Western Wall was still exposed after the destruction of the Temple. It became a place of Jewish prayer for a very long time. ==Excavation== British researchers started excavating the Western Wall in the 19th century. Charles Wilson began the excavations in 1864. This was followed by Charles Warren in 1867 - 70. Wilson found an arch. This arch is now named for him, \"Wilson's Arch\". It was wide. The arch is above present-day ground level. It is believed that the arch supported a bridge which connected the Temple Mount to the city during the Second Temple Period. After the Six-Day War, excavations began to expose more of the Western Wall. The excavations lasted almost twenty years. They found many facts about the history and geography of the Temple Mount that had not been known. The excavations were difficult. Tunnels ran below neighborhoods that were built on top of structures from the Second Temple Period. The excavations were done with the supervision of scientific and rabbinic experts. This was to ensure both the stability of the structures and to prevent damaging the historic artifacts. In 1988, the Western Wall Heritage Foundation was formed. It took over the excavation, maintenance and renovations of the Western Wall and Western Wall Plaza. == Gallery == file:PikiWiki Israel 29692 The Western Wall Tunnels.jpg| file:Hasmonian IMG 2687.JPG| file:Jerusalem 07-2012 (7550159966).jpg| file:Jerusalem P1080518 (5149804228).jpg| file:Western Wall Tunnels (4826016912).jpg| file:מוצלם תמונות אומנותיות (31).jpg ==References== == Other websites == * Information from the Kotel site in English * Jeremy Langford's glass sculptures in \"The Chain of Generations Center\" in the Western Wall Tunnels * Read the iTour Jerusalem review of the Western Wall Tunnel Category:Jerusalem Category:Archaeological sites in Israel Category:1st-century BC buildings and structures",
 "title": "Western Wall Tunnel"
}