{
 "id": "541810",
 "text": "A differential is a mechanical device made up of several gears. It is used in almost all mechanized four-wheel vehicles. It is used to transmit the power from the driveshaft to the drive wheels. Its main function is to allow the drive wheels to turn at different rpms allowing the wheels to go around corners while still receiving power from the engine. == Different types == * An open differential (OD) is the most common type. It is also the least expensive. An open differential allows the vehicle to go around corners without dragging the outside wheel. However, power is transferred to the wheel with the least amount of traction (grip on the road). If that wheel is on ice or other slippery surfaces, the vehicle will not move forward and the wheel with the power will simply spin. In vehicles with two-wheel drive, if they have an open differential in effect they have only a single drive wheel. In four-wheel drive vehicles using open differentials (usually standard from the factory), only one wheel on each axle powers the vehicle. Advantages include seldom breaking an axle, less tire wear, and they are free as most new vehicles come with open differentials. * A limited slip differential (LSD) overcomes this problem. Using a series of clutches (called a clutch pack), the LSD allows limited wheel slippage while maintaining power to both drive wheels. LSDs are popular in race cars, as there are oftentimes when they are coming out of turns and need to accelerate without losing power to one drive wheel. * A locking differential (locker) is able to lock the two drive wheels on an axle together. The advantage is that both wheels have power at all times. The disadvantage is that turning is much more difficult since both wheels must turn at the same rpms. So most lockers must be disengaged when making sharp turns. Lockers can also present the driver with some dangerous situations. For example, when traversing a slope (going crossways) if one drive wheel loses traction both lose traction and the vehicle may slide sideways down the slope. Drivers are often warned not to traverse a slope if the surface is loose or slippery. Lockers may be switched on or off mechanically, electronically (e-locker) or using compressed air (air locker). Lockers are desirable on off-road vehicles but are usually not useful on streets and highways. * A spool is an open differential in which the axles have been mechanically fastened together. This does not allow either wheel to go faster or slower around corners. It is cheap and adds little or no weight to the vehicle, but is usually limited to off-road competitions and trail driving. They are not desirable for driving on the street as they will \"chirp\" the tires when going around corners. == References == == Other websites == * How a Differential Works and Types of Differentials, YouTube * How an air- locker works, YouTube * Around The Corner - How Differential Steering Works (1937) Category:Auto parts",
 "title": "Differential (mechanical device)"
}