{
 "id": "541905",
 "text": "Grand County is a county located in the U.S. state of Utah. As of the 2020 census, the population was 9,669. Its county seat and largest city is Moab. The county was named for the Colorado River, which at the time of statehood was known as the Grand River. It is west from the Colorado state line. ==Geography== According to the U.S. Census Bureau, the county has a total area of , of which is land and (0.3%) is water. The Green River forms the western boundary and Colorado lies on the eastern boundary. The Colorado River flows through the southeast corner. Deserts, cliffs and plateaus make up the scenery, with few settlements apart from the city of Moab, a Colorado River oasis. Arches National Park lies in the southern part of the county, just north of Moab. Also, the northernmost extension of Canyonlands National Park lies in the southwest corner of the county. ===Adjacent counties=== * Uintah County (north) * Garfield County, Colorado (northeast) * Mesa County, Colorado (east) * San Juan County (south) * Emery County (west) * Carbon County (northwest) ===National protected areas=== * Arches National Park * Canyonlands National Park (part) * Manti-La Sal National Forest (part) * McInnis Canyons National Conservation Area (part) ==Demographics== In the 2020 census, there were 9,669 people, 4,006 households, and 2,416 families living in Grand County. The population density was 2.6 people per square mile (1.0/km²). There were 5,192 housing units. The breakdown by race was 80.8% White, 3.9% Native American, 0.8% Asian, 0.8% Black, 0.1% Pacific Islander, 4.9% from one other race, and 8.7% from two or more races. Hispanics and Latinos made up 12.7% of the people. The median (middle) age was 40.5 years. The age breakdown was 21.2% under age 18, 18.6% from 18 to 65, and 60.2% over 65. The gender breakdown was 49.7% male and 50.3% female. Of the households, 28.2% had children under age 18, 41.8% had a married couple, 9.1% had an unmarried couple, 27.2% had a woman with no partner, 21.8% had a man with no partner, and 30.1% had one person living alone. The average household size was 2.37 people. As of 2022, the median (middle) yearly income for a household was about $59,171, and the median income for a family was about $75,333. The per capita income was about $37,510. About 9.2% of families and 15.7% of all people lived below the poverty line. This includes 18.2% of children under 18 years old and 16.8% of people over 65 years old. == References == Category:Utah counties Category:19th-century establishments in Utah Category:1890 establishments in the United States",
 "title": "Grand County, Utah"
}