{
 "id": "542113",
 "text": "Francesco Filippini (18 September 1853 – 6 March 1895) was an Italian painter from Lombardy. Filippini is considered one of the most important landscape painters of the 1900s. == Life == Filippini was born in Brescia, in Lombardy in northern Italy, on 18 September 1853, into a poor family. His father Lorenzo was a carpenter, his mother Silvia Signoria a seamstress. He was soon sent to work, first as a waiter in a pastry shop, later as a clerk to a notary. Filippini attended the school of drawing at the Pinacoteca Tosio in Brescia, In 1872 he received a grant from the city council to continue his studies there. In 1875 he received an allowance to study under Giuseppe Bertini in Milan. In 1879 another grant allowed him to travel to Paris to visit the Salon, the official art exhibition of the French Fine Arts Academy. Filippini exhibited at the annual shows of the Accademia di Belle Arti di Brera in Milan from 1879, and from 1880 lived in that city. He made his living by teaching, both in schools and privately. He was made an honorary member of the Accademia di Brera in 1878. He died in Milan on 6 March 1895. == Works == When he was young, Filipinni painted mostly religious or historical subjects, as well as some portraits. In later life he painted mostly landscapes – of the Apennines, the Lombardy countryside and the Alps. He also made paintings of the sea near Genova, Naples and Venice. His work shows the influence of the Scapigliatura. Painting Year Details Image At the foot of the glacier c. 1875-1895 It is landscape painted in oil. The work portrays a refuge behind a glacier in the Italian mountains. Autumn 1875 It is 83 x 142 centimetres painted in oil. It was painted about 1875, in Milano, Italy. Is in the collection of the Museum Pinacoteca Tosio Martinengo in Brescia. Boats in Venice 1890 A 19th-century late impressionist painted 80 x 139 centimetres in oil. It was painted about 1890, in Venice, Italy. The Corn Harvesters 1887-1889 A 19th-century late impressionist painted in oil. It was painted about 1887, in Milano, Italy. It is in the collection of the Galleria d'Arte Moderna, Milan. Evening in November 1891 Painted 178 x 103 centimetres in oil. It was painted about 1891, in Milano, Italy. It is in the collection of the GAM-Gallery of Modern Art of Milan (inv. n. 195). Grandmother and children 1887 It was painted 37 x 60.5 centimetres in oil on 1887 at Milano, Italy. Is in the collection of the Civic Museums of Art and History of Brescia (inv. n. 1254, 302123487). Head of a Woman 1876 Oil painting painted about 1876, in Milano, Italy. Is in the collection of the Modern art gallery of Novara (inv. n. GG 555). Imminent thunderstorm c. 1890 Painted in oil. It is in the collection of the Gallery of Modern Art of Milan (inv. n. 7146). Impending storm 1890 Painted in oil. It is in the collection of the Gallery of Modern Art of Milan (inv. n. 268). In the mountain 1890 Painted in oil. It is in the collection of the Pinacoteca Nazionale di Bologna . Marina c. 1882 Painted in oil. It is in the collection of the Gallery of Modern Art of Milan since 1931 (inv. n. 4544). The market 1881 Painted in oil. It is in the collection of the Gallery of Modern Art of Milan (inv. n. 4725). November morning in Ligurno 1885 Painted in oil. It is in the collection of Brera Academy and subsequently bought by the Galleria d'arte moderna di Milano (inv. n. 265). Nude Study 1876 It was painted in Brescia, Italy. Is in the collection of the Civic Museums of Brescia (inv. n. 988). Portrait of the mother 1877 It is in the collection of the Civic Museums of Brescia (inv. n. 608). Reading 1881 It was painted 60 x 68 centimetres in oil. Scirocco in Venice Lagoon 1882 It was painted 75.5 x 45 centimetres in oil. It is in the collection of the Pinacoteca Nazionale di Bologna. Scutching of the canapa 1887 It is exhibited at the Pinacoteca di Brera. The Scutching of the canapa di Filippini won the art prize Premio Mylius in 1889. Seascape 1882 It is in the collection of the Gallery of Modern Art of Milan since 1931 (inv. n. 4543). Self-portrait as a young man 1873 It is in the collection of the Civic Museums of Brescia (inv. n. 1526). Made when the artist was twenty, while attending the drawing school in Brescia, it is one of the three self-portraits made by Filippini. Shepherdess at rest 1887 It is in the collection of the Gallery of Modern Art of Milan (inv. n. 193), from which it was bought in 1933. Sunset 1891 It is in the collection of the Civic Museums of Brescia (inv. n. 734). Sunset in Valtrompia 1883 It was painted about 1883, in Valtrompia, Italy. It is in the collection of the Civic Museums of Brescia The plain c. 1892 It is in the collection of the Province of Milano, which bought it on 22 January 1893, previously owned by the Museo della Permanente in Milan from 1892 to 1893. It is an oil painting that is 190 x 110 centimetres. The Trip hammer 1889 It was made around 1889, in Milano, Italy, exhibited in the collection of Pinacoteca di Brera (Reg. Cron. 6297). ==Related pages== * List of Italian painters ==References== == Further reading == *Editorial staff (4 November 2015). \"Francesco Filippini, il dossier. Uno splendido pittore morto a 42 anni di tisi\". StileArte * Vasco Frati (1999). Francesco Filippini: 1853-1895: un protagonista del naturalismo lombardo (exhibition catalogue, in Italian). Milan:Skira. . Category:1853 births Category:1895 deaths Category:19th-century Italian painters Category:People from Brescia",
 "title": "Francesco Filippini"
}