{
 "id": "542197",
 "text": "The following is a list of paintings by Italian Rococo painter Giambattista Pittoni, one of the most important artist of the eighteenth century in Europe. Giambattista Pittoni lists 247 extant and 117 lost, missing or destroyed works. Some of his works are listed below. The artist's works have never signed and dated. Image Title Year Technique Dimensions (cm) Gallery The Vision of Saint Anthony of Padua ca.1730 Oil on canvas 90.17 cm x 59.06 cm San Diego Museum of Art, California, United States Bacchus et Ariane 1720-1725 Oil on canvas 0,51 m. x 0,46 m. National Museum of Warsaw, Poland Mars et Vénus 1720-1725 Oil on canvas 0,62 m. x 0,46 m National Museum of Warsaw, Poland Le Christ donnant les clefs du Paradis à saint Pierr 1733-1735 Oil on canvas 0,56 m. x 0,96 m. The Louvre, Paris Polyxène devant le tombeau d'Achille 1733-1735 Oil on canvas 0,56 m. x 0,96 m. The Louvre, Paris Suzanne et les vieillards 1723-1725 Oil on canvas 0,42 m. x 0,36 m The Louvre, Paris Tombeau allégorique de l'archevêque John Tillotson 1730-1735 Oil on canvas 0,80 m. x 0,53 m The Louvre, Paris Bacco e Arianna Oval Oil on panel Palazzo Madama, Senate of the Republic (Italy), Rome Frescos in the Winter Palace of Hermitage Museum, Saint Petersburg (Pittoni) 1788 Oil on canvas Hermitage Museum, Saint Petersburg, Russia Diana and Endymion 1723 Oil on canvas 134 x 109 cm Hermitage Museum, Saint Petersburg, Russia Dido Founding Carthage Early 1720s Oil on canvas 161 x 200 cm Hermitage Museum, Saint Petersburg, Russia Death of King Candaules Early 1720s Oil on canvas 161 x 210 cm Hermitage Museum, Saint Petersburg, Russia Sacrifice of Polyxena Early 1730s Oil on canvas 129 x 94 cm Hermitage Museum, Saint Petersburg, Russia Susanna and the Elders about 1720 Drawing, red and black chalks 19.4 x 13.1 cm Metropolitan Museum of Art, New York The Nativity with God the Father and the Holy Ghost about 1740 Oil on canvas 222.7 x 153.5 cm The National Gallery, London San Francesco 1718 Oil on canvas 60 x 73 cm private collection The miracle of the loaves and fishes c. 1725 Oil on canvas 120.1 × 178.5 cm The National Gallery of Victoria, Melbourne, Australia Retour de Guerrier ou Le sacrifice de Polyxène au pied du tombeau d'Achille Oil on canvas Museum of Fine Arts, Dole, France Group of Figures from a Banquet Scene Drawing 34.92 x 21.43 cm, irregular Los Angeles County Museum of Art, Los Angeles Infant Moses Trampling on Pharaon`s Crown Early 1720s Drawing, red chalk, pen and Indian ink, grey wash over traces of black chalk 1 x 30,2 cm Hermitage Museum, Saint Petersburg, Russia Un saint recevant l'Enfant Jésus dans les bras sur un étoffe Drawing The Louvre, Paris Le Jugement dernier Drawing The Louvre, Paris Un saint recevant l'Enfant Jésus dans les bras sur un étoffe Drawing The Louvre, Paris Elie monte au ciel dans un char de feu et laisse tomber son manteau à Elisée Drawing The Louvre, Paris Femme et jeune homme à genoux : deux figures du Monument à Lord Dorset Drawing The Louvre, Paris Martyre de saint Thomas Drawing The Louvre, Paris Sujet allégorique Drawing The Louvre, Paris Tête de vieil homme, tournée vers la gauche, vue de profil Drawing The Louvre, Paris Un guerrier, un prêtre et deux hommes : figures du Monument à Lord Dorset Drawing The Louvre, Paris Un évêque à genoux lisant Drawing The Louvre, Paris ==Sources== * Official sites of the museums. * Franca Zava Boccazzi (1979). Pittoni: L'opera completa (in Italian). Venezia: Alfieri. Category:18th-century paintings Category:Lists",
 "title": "List of works by Giambattista Pittoni"
}