{
 "id": "542779",
 "text": "Walt Disney Studios Motion Pictures is an American movie company owned by The Walt Disney Company. The company began in 1953 as Buena Vista Distribution Company, to manage distribution, marketing and promotion for movies produced by the Walt Disney Studios. These include Walt Disney Pictures, Walt Disney Animation Studios, 20th Century Fox, Fox Searchlight Pictures, Pixar Animation Studios, Marvel Studios, Lucasfilm, Disneynature, and Touchstone Pictures. The division changed to its current name in 2007. Since 1987, the company name had been Buena Vista Pictures Distribution. == History == Before 1953, Walt Disney's productions were distributed by Columbia Pictures, United Artists and RKO. However, an argument led to Walt and his older brother Roy O. Disney beginning the Buena Vista Film Distribution Company, Inc. (BVDC), to handle North American distribution of their own products.The Disney Studio Story, by Richard Holliss and Brian Sibley, 1988. For the Toy Story premiere, Disney rented the Hollywood Masonic Temple for Totally Toy Story, as a multimedia funhouse and a promotional event for the movie. Because of its success as a venue, in July 1998, Buena Vista Pictures Distribution bought the Masonic Temple building. In April 2006, Buena Vista International agreed to a distribution deal with MegaStar Joint Venture Company Limited. This was to help them bring their most popular movies to be shown in Vietnam. In April 2007, Disney stopped using the Buena Vista nickname in its distribution branding. In 2009, Disney began a partnership with DreamWorks Studios. They agreed to make an estimated 30 movies over a five-year period from DreamWorks and release them under the Touchstone Pictures name. The distribution deal will end in August 2016. DreamWorks and Disney decided to not renew their agreement in December 2015; with Universal Pictures replacing Disney as DreamWorks' distributor. ==Distribution== Walt Disney Studios Motion Pictures has released the most movies that have earned more than $1-billion, (nine, in worldwide grosses), among major Hollywood studios, with eight of the twenty highest-grossing movies of all time being distributed by Disney. In 2015, Disney achieved its largest yearly box-office gross worldwide and in North America. In December 14, 2017, The Walt Disney Company has announced plan to buy 21st Century Fox for $52.4 billion as well as 20th Century Fox and other Fox Entertainment assets. Upcoming August 12, 2022 | Untitled Film September 16, 2022 | Untitled Film == Highest-grossing movies == {| class=\"wikitable sortable\" style=\"margin:auto; margin:auto;\" Rank Title Year Studio label Box office gross 1 Star Wars: The Force Awakens 2015 Lucasfilm $936,519,683 2 The Avengers 2012 Marvel $623,357,910 3 Avengers: Age of Ultron 2015 Marvel $459,005,868 4 Pirates of the Caribbean: Dead Man's Chest 2006 Disney $423,315,812 5 The Lion King ‡ 1994 Disney $422,783,777 6 Toy Story 3 2010 Disney/Pixar $415,004,880 7 Iron Man 3 2013 Marvel $409,013,994 8 Frozen 2013 Disney $400,738,009 9 Finding Nemo ‡ 2003 Disney/Pixar $380,843,261 10 Inside Out 2015 Disney/Pixar $356,002,827 11 Alice in Wonderland 2010 Disney $334,191,110 12 Guardians of the Galaxy 2014 Marvel $333,176,600 13 Zootopia 2016 Disney $332,515,562 14 The Jungle Book 2016 Disney $315,289,618 15 Captain America: Civil War 2016 Marvel $310,545,889 16 Pirates of the Caribbean: At World's End 2007 Disney $309,420,425 17 Pirates of the Caribbean: The Curse of the Black Pearl 2003 Disney $305,413,918 18 The Sixth Sense 1999 Hollywood $293,506,292 19 Up [2009 Disney/Pixar $293,004,164 20 The Chronicles of Narnia: The Lion, the Witch and the Wardrobe 2005 Disney $291,710,957 21 Monsters, Inc. ‡ 2001 Disney/Pixar $289,916,256 22 Toy Story 2 ‡ 1999 Disney/Pixar $276,554,625 23 Monsters University 2013 Disney/Pixar $268,492,764 24 The Incredibles 2004 Disney/Pixar $261,441,092 25 Captain America: The Winter Soldier 2014 Marvel $259,766,572 ‡—Includes theatrical reissue(s). == References == == Other websites == * Walt Disney Studios Motion Pictures Category:Disney companies",
 "title": "Walt Disney Studios Motion Pictures"
}