{
 "id": "543124",
 "text": "Alexander Van der Bellen (born 18 January 1944) is an Austrian politician and economist. He is the President of Austria since 2017. He won the 2016 election after multiple court battles and narrow victories. He was sworn into office on 26 January 2017 officially becoming the president. Van der Bellen is the country's second green president and the first to be directly elected by popular vote. He was re-elected in 2022. ==Early life== Van der Bellen was born in Vienna. His father was Russian and his mother was Estonian. He is the son of aristocratic refugees from Russia's Bolshevik Revolution. They first escaped from Pskov to Estonia. In 1962, he graduated from the Akademisches Gymnasium in Innsbruck. He studied economics at the University of Innsbruck. He received a doctorate in 1970. ==Political career== Van der Bellen is a retired professor of economics at the University of Vienna. He is a member of the Austrian Green Party. He served as a member of the National Council from 1994 to 2012. He was the chairman of the parliamentary club and federal spokesperson of his party from 1997 to 2008. ===Presidency (since 2017)=== He ran as a nominally independent candidate supported by the Green Party in the 2016 presidential election, and finished second in the first round before winning the second round against far-right candidate Norbert Hofer. A second election was ordered since the votes were too narrow. In December 2016, Van der Bellen won the election with more votes. He became the first Austrian president to be directly elected by popular vote. He took office on 26 January 2017. He was re-elected in October 2022 with almost 57% of the vote. ==Political views== Van der Bellen supports green and social liberal policies, and is supportive of the European Union. ==References== ==Other websites== Category:1944 births Category:Living people Category:Austrian academics Category:Current national leaders Category:Economists Category:Presidents of Austria Category:Scientists from Vienna Category:Politicians from Vienna",
 "title": "Alexander Van der Bellen"
}