{
 "id": "543180",
 "text": "Emergency medical services (EMS), also known as ambulance services or paramedic services, are agencies that deal with medical emergencies, mostly by sending ambulances or other vehicles to help people who are severely ill or injured. Their job is to treat these people at the incident and to take them to a hospital if needed. There are several types types of staffing. Most Ambulances and other medical vehicles have personnel who provide Advanced levels of Emergency Medical Care. This is called Advanced Life Support (ALS). Sometimes it is called Advanced Cardiac Life Support (ACLS). Some ambulances or other medical vehicles also have staff with more basic training,and they are known as Emergency Medical Technicians (EMTs). They provide Basic levels of Emergency Medical Care. This is called Basic Life Support (BLS). Sometimes there are both on Ambulances. Doctors sometimes assist with care. The exact role of the emergency medical services varies by country. In some countries like the US and UK, their job is seen as bringing the patients from an incident to treatment. Until the 1970s, their ambulances carried patients to hospital and gave them little medical care. Since then, paramedics have been trained to give some medical care before they get to hospital. Other countries like France and Germany run them in a different way, where their job is seen as bringing treatment to the patients. In those countries, doctors work on ambulances and they try to treat patients at the scene rather than take them to the hospital. The type of organization that provides emergency medical services also varies by country. This may be: *A government EMS agency *A fire department *A hospital *A business *A non-profit organization, such as Red Cross and St John Ambulance == Related pages == *Emergency medicine *First aid * Mass Gathering Medicine * Battlefield medicine * Wilderness medicine ==Further reading== *Planning Emergency Medical Communications: Volume 2, Local/Regional Level Planning Guide, (Washington, D.C.: National Highway Traffic Safety Administration, US Department of Transportation, 1995). * Prener, Christopher. Medicine at the Margins: EMS Workers in Urban America (Fordham University Press, 2022) online review ==External links== *\"Emergency Medical Services in the European Union: report of an assessment project co- ordinated by the European Union\" *World Health Organization: Department of Violence and Injury Prevention \"Prehospital Trauma Care Systems\" *Safety Guidelines: Emergency Response and Recovery Workers, by the National Institute for Occupational Safety and Health Category:Emergency services Category:Emergency medicine",
 "title": "Emergency medical services"
}