{
 "id": "54327",
 "text": "South West England is one of the regions of England. It has the largest area of all regions, and reaches from Gloucestershire and Wiltshire to Cornwall and the Isles of Scilly. This includes the area often known as the West Country, and much of Wessex. The size of the region is shown by the fact that the northern part of Gloucestershire, near Chipping Campden, is as close to the Scottish border as it is to the tip of Cornwall. Agriculture and tourism are the important industries of the region. Mining of tin and copper was also formerly very important in Devon and Cornwall. Traditionally, the South West of England has been well known for producing Cheddar cheese, named after Cheddar, Somerset in the Mendip Hills, for Devon cream teas, and for Somerset cider. It is now probably equally well known as the home of the Eden Project (in Cornwall), Aardman Animations, the Glastonbury festival (in Somerset), trip hop music, Cornwall's seafood restaurants, and surfing beaches. Two National Parks (Dartmoor and Exmoor) and four World Heritage Sites lie in this region. ==Local government== The official region consists of the following geographic counties and local government areas: Map Ceremonial county Shire county / unitary Districts Somerset 1. Bath and North East Somerset 2\\. North Somerset 11\\. Somerset South Somerset, Taunton Deane, West Somerset, Sedgemoor, Mendip 3\\. Bristol Gloucestershire 4. South Gloucestershire 5\\. Gloucestershire Gloucester, Tewkesbury, Cheltenham, Cotswold, Stroud, Forest of Dean Wiltshire 6. Swindon 7\\. Wiltshire Salisbury, West Wiltshire, Kennet, North Wiltshire Dorset 8. Dorset Weymouth and Portland, West Dorset, North Dorset, Purbeck, East Dorset, Christchurch 9\\. Poole 10\\. Bournemouth Devon 12. Devon Exeter, East Devon, Mid Devon, North Devon, Torridge, West Devon, South Hams, Teignbridge 13\\. Torbay 14\\. Plymouth Cornwall Isles of Scilly 15\\. Cornwall Penwith, Kerrier, Carrick, Restormel, Caradon, North Cornwall == Other websites == *Government Office for the South West *South West Regional Assembly *South West Regional Development Agency *Government's list of councils in the South West *Campaign for a Cornish Assembly *Attractions South West ;Photographs * Bristol * Cornwall: * Devon: * Dorset: * Somerset:",
 "title": "South West England"
}