{
 "id": "54345",
 "text": "Marcus Tullius Cicero, usually pronounced in English (3 January 106 BC – 7 December 43 BC) was a Roman statesman, consul, lawyer, political theorist and philosopher. He is often thought to be one of Rome's greatest orators and prose stylists.Rawson, E.: Cicero, a portrait (1975) p.303Haskell, H.J.: This was Cicero (1964)p.300-301 His Latin is thought to be the model of Classical Latin. He introduced Greek philosophy to the Romans. Cicero was heavily involved in the politics of the Roman Republic. After Julius Caesar's death, Cicero became an enemy of Mark Antony. In the power struggle, Cicero attacked Antony in a series of speeches. Cicero was proscribed as an enemy of the state by the Second Triumvirate. He was executed in 43 BC by soldiers working for the Triumvirate. == References == == Sources == * Everitt, Anthony 2001, Cicero: the life and times of Rome's greatest politician, Random House, hardback, 359 pages, * Haskell, H.J.: (1946) This was Cicero, Fawcett publications, Inc. Greenwich, Conn. USA * Rawson, Elizabeth (1975) Cicero, A portrait, Allen Lane, London * Taylor, H. (1918). Cicero: A sketch of his life and works. Chicago: A. C. McClurg & Co. == Other websites == === General === ** Links to Cicero resources ** University of Texas Cicero Homepage ** The Internet Encyclopædia of Philosophy === Works by Cicero === ** ** Perseus Project (Latin and English): Classics Collection (see: M. Tullius Cicero) ** The Latin Library (Latin): Works of Cicero ** UAH (Latin, with translation notes): Cicero Page ** De Officiis, translated by Walter Miller ** Cicero's works: text, concordances and frequency list * Biographies and descriptions of Cicero's time: ** At Project Gutenberg *** Plutarch's biography of Cicero contained in the Parallel Lives *** Life of Cicero by Anthony Trollope, Volume I – Volume II *** Cicero by Rev. W. Lucas Collins (Ancient Classics for English Readers) *** Roman life in the days of Cicero by Rev. Alfred J. Church *** Social life at Rome in the Age of Cicero by W. Warde Fowler ** At Heraklia website ** Dryden's translation of Cicero from Plutarch's Parallel Lives ** At Middlebury College website ** Prætor Brutus * News article on a museum-guide robot named after him Category:106 BC births Category:43 BC deaths Category:Ancient Roman writers Category:Ancient Roman philosophers Category:2nd-century BC writers Category:1st-century BC writers",
 "title": "Cicero"
}