{
 "id": "543519",
 "text": "Wallis Simpson (born Bessie Wallis Warfield; 19 June 1896 - 24 April 1986), who later became the Duchess of Windsor, caused a serious crisis in the mid-1930s when the heir to the throne of the United Kingdom, Prince Edward, fell in love with her. However, she was married to another man, and she had already gotten a divorce from her first husband to marry him. In 1936, she divorced her second husband.Wallis filed for divorce from her second husband on the grounds that he had committed adultery with her childhood friend Mary Kirk. The divorce was granted on 27 October 1936. Bloch, Michael 1996. The Duchess of Windsor. London: Weidenfeld and Nicolson, pp. 82, 92. ==Abdication of Edward VIII== On 20 January 1936, King George V died, and Edward became king. Edward VIII and Wallis had already started an affair. He wanted to marry her after she had divorced. The monarch is the head of the Church of England, which was strongly against the idea of divorce. Their affair was regarded as a sin. In November, King Edward consulted with British Prime Minister Stanley Baldwin on a way to both marry Wallis and keep the throne. Edward suggested a morganatic marriage in which he would remain king but Wallis would not be queen, and their children could not become the monarch. The idea was rejected by Baldwin and the prime ministers of Australia and South Africa.The monarch was also the king of the dominions, as they were called. If Edward married Wallis against Baldwin's advice, the government had decided to resign, which would cause a constitutional crisis.Beaverbrook, Lord (ed A.J.P. Taylor) 1966. The Abdication of King Edward VIII. London: Hamish Hamilton, p. 57. The King decided he had no choice but to abdicate so that he could marry Wallis. On 11 December 1936, Edward said in a radio broadcast, \"I have found it impossible to carry the heavy burden of responsibility, and to discharge my duties as King as I would wish to do, without the help and support of the woman I love\".Windsor, HRH The Duke of, 1951. A King's story. London: Cassellp413. ==Later life== After his abdication, Edward became the Duke of Windsor, and Wallis became the Duchess of Windsor. While Edward retained his style of \"Royal Highness\", King George VI declared Wallis would not be allowed to do the same but would be instead styled Her Grace The Duchess of Windsor, the same style given to a non-royal duchess. The couple lived abroad, mainly in France, for most of their lives. During the Second World War, they moved from France to Portugal and later to the Bahamas. They were widely suspected of being sympathetic to the German Nazis. Edward himself wrote in the New York Daily News of 13 December 1966: \"it was in Britain's interest and in Europe's too, that Germany be encouraged to strike east and smash Communism forever ... I thought the rest of us could be fence-sitters while the Nazis and the Reds slogged it out\".Higham, Charles 2005. Mrs Simpson. London: Pan Books, p 259–260. ; King, Greg 1999. The Duchess of Windsor. New York: Citadel Press, p 294–296. After her husband's death from cancer in 1972, Wallis travelled to the United Kingdom to attend his funeral. She stayed at Buckingham Palace during her visit. The Duchess of Windsor died on 24 April 1986 at her home in the Bois de Boulogne, Paris, at the age of 89. She was buried alongside her husband in the Royal Burial Ground. She wrote about her life in 1956.Windsor, The Duchess of 1956. The heart has its reasons: the memoirs of the Duchess of Windsor. London: Michael Joseph. == References == ==Other websites== * * The Duchess of Windsor at 212 East Biddle Street – Explore Baltimore Heritage * Category:1896 births Category:1986 deaths Category:House of Windsor Category:People from Baltimore",
 "title": "Wallis Simpson"
}