{
 "id": "543869",
 "text": "Damascus College is the only Catholic high school in Ballarat that teaches both males and females. The school started in 1995 when three different Catholic schools, St Martin's in the Pines, Sacred Heart College and St Paul's College joined. The school is in Mount Clear, 7 km from the heart of Ballarat. Damascus College is a school for high school children in years 7 to 12. == Origins == ===Sacred Heart College=== In 1881, the Sisters of Mercy started Sacred Heart College in Ballarat East for children from Prep to Year 12. The younger students were moved to St Francis Xavier College in 1906. ===St Paul's Technical College=== The Bishop of Ballarat James O'Collins started St Paul's Technical College in 1948. The Christian Brothers controlled the school. In 1987 the school moved from Lydiard Street to the old Ballarat Orphanage on Victoria Street. ===St Martin's in the Pines=== Miss Alice Fanning gave her land in Mt Clear to the Sisters of Mercy on her death in February 1960. The nuns used the land to farm vegetables and cows. In 1967 the land came to be a school for the Year 11 and 12 girls from Sacred Heart College. The school was named St Martin's in the Pines. In 1988 boys started at the school. Most of the boys were from St Paul's Technical College. ===Damascus College=== In 1995 Sacred Heart College, St Martin’s in the Pines and St Paul’s Technical College joined into the only male and female Catholic high school in Ballarat. Year 7 to 9 children studied in Victoria St at the old St Paul’s school and Year 10 to 12 children studied in Mt Clear at the old St Martin's in the Pines. In 2011 all children started studying in Mt Clear. Damascus College is jointly supported by the Sisters of Mercy and the parish priests of Ballarat, Ballarat East, Ballarat North, Bungaree, Cressy, Creswick, Daylesford, Gordon, Linton, Redan, Sebastopol, and Wendouree. == Education == The school's educational program is supported in the College Vision and Mission Statement, the Teaching and Learning Policy, the Australian Curriculum, the Victorian Essential Learning Standards (VELS), the Victorian Curriculum and Assessment Authority (VCAA) and the Victorian Registration and Qualifications Authority. The children can learn French or Indonesian from Year 7 to 12. Physical Education and Health are taught in years 7 to 10. Religious Education is taught in all years. Damascus College gives the Victorian Certificate of Education (VCE), Vocational education Training (VET) and the Victorian Certificate of Applied Learning (VCAL) to Year 10, 11 and 12 children. == Extracurricular activities == ===Mercy and Justice=== * Timor-Leste Immersion Program - pupils can to get money to help and visit the sister school Santa Maria in Ainaro, in Timor- Leste * Edmund Rice Camps - pupils can help with camps for poor children and families * Seeds of Justice - pupils learn about justice * Mercy Works - pupils help others from Australia and overseas * Justice Action Group (JAG) and Making A Difference (MAD) - social justice groups * Christian Personal Development Award (CPDA) ===Energy Breakthrough Team (EBT)=== Since 1998 Damascus College pupils have built Human Powered Vehicles (HPVs). The group trains and competes every year in the RACV Energy Breakthrough Challenge in Maryborough. EBT is a Year 9 subject. The school won the World Future Cycle Challenge in 2005 and 2007. The group drove 1200 km from Ceduna to Adelaide.http://www.heraldsun.com.au/news/special-features/place-in-the- sun/story-e6frf7nf-1225799664955 In March 2008 Damascus College rode 1009 km in under 24 hours from Sydney. In 2009, EBT drove 3775 km by solar vehicle from Darwin to the Victorian State Parliament in Melbourne. They helped raise awareness about climate change and how people can lower their environmental impact. ===Drama=== Students can join the senior or junior Drama Club, can participate in the annual production and the biannual Easter production the Final Hours. Year Production Year Production 1995 Children of Dust 1999 Animal Farm 2001 Sunrise Sunset 2002 Little Shop Of Horrors 2003 Foreigners From Home & Henry 2004 Fame 2005 Small Poppies 2006 Seussical 2007 Così 2008 The Wiz 2009 A Midsummer Night's Dream 2010 Footloose 2011 Beach 2012 Annie 2013 The Diary of Anne Frank 2014 Superman 2015 The 39 Steps 2016 Grease ===Sport=== Each year school swimming, athletics and ball sports carnivals are held for all pupils. Damascus College is a member of the Ballarat Associated Schools where students can choose to play for the school in: ===Other=== * Debating * SRC (Student Representative Council) * French and Indonesian language trips * Ski trips * Youth-Tutoring-Youth program * Green Group * Book Club == Buildings == Damascus College is divided into different school areas * Bishop Connors Wing – Year 9 and 10 classrooms named for Bishop of Ballarat Peter Connors * Catherine McAuley Wing – Year 7 and 8 classrooms named for Sister Catherine McAuley * Genevieve McDonald Wing – Science classrooms named for Sister Genevieve McDonald * John Shannon Centre – gymnasium named in for the first Damascus principal, Mr John Shannon * Mercy Wing – offices named for the Sisters of Mercy * Our Lady of Mercy Chapel * St Martin's Resource Centre – the library, named for St Martin's in the Pines * St Paul's Arts and Technology Wing – art, metal and woodwork rooms named for St Paul's Technical College * Valda Ward Auditorium – Drama rooms named for Sister Valda Ward == Houses == * McAuley – Sister Catherine McAuley started the Sisters of Mercy in Ireland in 1831. The Catherine McAuley and the sisters helped and educated poor girls and young women. * Rice – Brother Edmund Ignatius Rice started the Christian Brothers in Ireland in 1802. He helped educate the sons of poor Catholic families. * Xavier – Mother Xavier Flood helped start the Sisters of Mercy in Ballarat East and was the first principal of Scared Heart College. * O'Collins – Bishop James O'Collins was the Bishop of Ballarat and started St Paul's Technical College in 1948. == Principals == Period Name 1995-2004 Mr John Shannon 2005-2010 Mr Tony Duggan 2011- Mr Matthew Byrne == Notable alumni == ===Sacred Heart College=== * Karen Overington (1969), Member of the Victorian Parliament for Ballarat West * Judith Myrea Brewer (1979), Officer of the Order of Australia ===St Paul's Technical College=== * Mick Malthouse (1971), AFL footballer and coachRetrieved 30 June 2015 * Val Perovic (1971), AFL footballer Damascus College, The Road, Autumn 2010. Retrieved 30 June 2015 * Maurice O'Keefe (1972), AFL footballer * Geoff Cunningham (1977), AFL footballer * Daryl Cunningham (1978), AFL footballer * Sean Simpson (1987), AFL footballer * Anthony McDonald (1990), AFL footballer * James McDonald (1992), AFL footballer Damascus College, The Road, Summer 2010. Retrieved 12 April 2013 ===St Martin's In the Pines=== * Rachael Taylor (1994), olympic medalist for rowing ===Damascus College=== * Darren Jolly (1996), AFL footballer * Ash Lieb (2000) Artist, writer and comedian * Shayne Reese (2000), Olympic swimmer * Cameron Richardson (2005), AFL footballerDamascus College, The Road, April 2013. Retrieved 30 June 2015 * James Frawley (2006), AFL footballer * Jordan Roughead (2008 school captain), AFL footballer * Aislinn Prendergast (2009), orienteer for Australiahttp://www.unisport.com.au/HighPerformance/WUC/Pages/AislinnPrendergast.aspx. Retrieved 30 June 2015 * Shaun Reeves (2011), member of band Kuchi Kopi ==References== ==Other websites== * Damascus College website Category:Schools in Australia Category:Ballarat Category:1995 establishments in Oceania Category:1990s establishments in Australia",
 "title": "Damascus College"
}