{
 "id": "543848",
 "text": "Nathaniel Lyon (July 14, 1818 – August 10, 1861) was the first Union general that was killed in the American Civil War. He died while leading his men at the Battle of Wilson's Creek. He is noted for his military actions in the state of Missouri in 1861. == Early life == Lyon was born on July 14, 1818, in Ashford, Connecticut. He was the seventh out of nine children born to Amasa and Kezia Knowlton Lyon. His father was a farmer and also a justice of the peace. He grew up on their family farm. When his older brother died, Lyon became the object of his father's anger. Lyon hated farming and wanted to be like his ancestors who fought in the American Revolutionary War. == Military career == === Early career === On July 1, 1837, Lyon entered the United States Military Academy at West Point. William Tecumseh Sherman, who was a classmate and one year ahead of Lyon, described him as a \"lymphatic boy, who didn't seem to have energy enough to make a man.\" But Lyon did well at the academy. He graduated in 1841, 11th out of a class of 52. Lyon fought in the Second Seminole War in Florida and in the Mexican-American War. During the War with Mexico, he received several promotions for gallantry under fire at the battles of Mexico City, Contreras, and Churubusco. He was then sent to California where developed a reputation as an Indian fighter. Lyon was next sent to Fort Riley in Kansas. There he began to develop strong support for the Union as a result of the political climate developing in the state. === St. Louis arsenal === When the Civil War began on April 12, 1861, the entire state of Missouri was divided between pro-Confederate and pro-Union forces. Through political connections, and even though a Captain, Lyon was given command of the St. Louis arsenal. He sent almost all the gunpowder and weapons to safety in Illinois. The United States Secretary of War, Simon Cameron, had sent a letter to Lyon, the temporary commander of the arsenal, authorizing him to raise more companies of Union soldiers.Thomas Lowndes Snead, The Fight for Missouri (New York: Charles Scribner's Sons, 1886) pp. 164-166 It was endorsed by President Abraham Lincoln and Lieutenant general Winfield Scott. Lyon then recruited thousands of untrained volunteers from among the German community in St. Louis. Most German immigrants were against slavery which made them unpopular among many of the city's pro-Confederate citizens. Tensions grew between the Union soldiers stationed there and the secessionist governor of the state, Claiborne Jackson. When the Civil War broke out, Jackson refused to send volunteers from the state to fight for Abraham Lincoln. Instead, the governor had the state militia muster outside the city to begin training in preparation to join the Confederate forces. The governor knew the most important resource in the state was the federal arsenal at St. Louis.Louis S. Gerteis, The Civil War in Missouri: A Military History (Columbia, MO; London: University of Missouri Press, 2012), p. 9 Lyon realized what the governor was doing. On May 10, 1861, Lyon and his troops surrounded the pro-Confederate Missouri militia and forced them to surrender. While marching his captured prisoners through St. Louis, pro-Confederate citizens began to riot. When his German volunteers fired into the mob, 28 people were killed. The incident was called the Camp Jackson Affair.Camp Jackson Affair Missouri Civil War Sesquicentennial Retrieved 28 May 2016. On May 17, Lyon was promoted to brigadier general. He was given command of the Union Army of the West. === Missouri in the war === On June 13, 1861, after failed negotiations with Governor Jackson, Lyon quickly moved his army to attack the pro-confederate forces at Jefferson City, Missouri, the state capital.Albert Castel, General Sterling Price and the Civil War in the West (Baton Rouge; London: Louisiana State University Press, 1968), pp. 24–26 He moved quickly enough to catch them unprepared. On June 15, the Army of the West occupied Jefferson City. Lyon installed a pro-Union government after Jackson and most of his militia retreated to the southwest corner of Missouri. Lyon moved his army to go after the rebels. On June 17, both sides fought the Battle of Boonville which lasted only about 30 minutes. The Union forces completely routed the pro-confederates. He then lead his troops into a series of skirmishes with the Missouri State Guard and the Confederate Army. He next moved to Springfield, Missouri where the army camped. On August 10, Lyon's Army of the West was defeated by a combined force of the Missouri Militia and Confederate troops under the command of Benjamin McCulloch near Springfield, Missouri. This was called the first Battle of Wilson’s Creek. Lyon was killed while trying to rally his outnumbered soldiers. However, Lyon’s efforts prevented the State of Missouri from joining the Confederacy. == Burial == When the Union army retreated from Wilson's Creek, Lyon's body was mistakenly left behind on the battlefield. Confederate soldiers found him and took his body to Springfield. There he was examined by Dr. Melcher, a surgeon with the Confederate Missouri Militia. The doctor described Lyon: Lyon was then buried on a farm outside Springfield. Later Union forces recovered the body. It was sent home to Connecticut. He was buried in the family plot at Phoenixville, now Eastford, Connecticut. An estimated 15,000 people attended his funeral. As the first general killed in the war, he was considered a hero. == References == == Other websites == * General Lyons' funeral march, composed by George W. Hewitt; Library of Congress * General Lyon Cemetery; Eastford * From the State Historian: The Final Journey of Nathaniel Lyon Category:American Civil War generals Category:1818 births Category:1861 deaths Category:Military people from Connecticut",
 "title": "Nathaniel Lyon"
}