{
 "id": "543986",
 "text": "\"Juicy\" is the first single by American rapper the Notorious B.I.G. The song is from his first album Ready to Die (1994). Poke (of Trackmasters) and Sean \"Puffy\" Combs were the producers of the song. \"Juicy\" contains a sample of Mtume's 1983 song \"Juicy Fruit\". It is directly sampled from the song's \"Fruity Instrumental\" mix. The song is widely considered to be one of the greatest hip-hop songs of all time. The song charted at number 27 on the Billboard Hot 100. ==Content== The song is a \"rags to riches chronicle\". The Notorious B.I.G. talks about his childhood years living in poverty, his initial dreams of becoming a rapper, early musical influences, his time dealing drugs, criminal involvement, and his eventual success in the music industry and current lavish lifestyle. The song's lyrics refer to the February 26, 1993 bombing of the World Trade Center. ==Accolades== * Blender Magazine ranked the song #168 on its Top 500 Songs of the '80s–'00s list in 2005. *Bruce Pollock put it on his The 7,500 Most Important Songs of 1944–2000 list in 2005. * ego trip ranked it #1 on its Hip Hop's 40 Greatest Singles by Year 1980–98 list in 1999. * Pitchfork Media ranked the song at #14 on their Top 200 Tracks of the 1990s. * Pop ranked it #1 on their Singles of the Year list in 1994. * Q ranked \"Juicy\" the ninth greatest hip hop song of all time. * Rolling Stone ranked the song #424 in its list of the 500 Greatest Songs of All Time, moving to #32 in the 2021 revision. * Spex included it on The Best Singles of the Century list in 1999. * The Boston Phoenix included it on their 90 Best Songs of the 90s list in 1999. * The Source included it on their The 100 Best Rap Singles of All Time list in 1998. * VH1 ranked it #7 on its \"100 Greatest Hip Hop Songs Ever\" and #1 on its \"40 Greatest Hip Hop Songs of the 90s\". * BBC ranked it #1 on its \"Greatest hip-hop songs of all time\". ==Track listing== ===12-inch=== ====A-side==== # \"Juicy\" (Dirty Mix) (5:05) # \"Unbelievable\" (3:45) (produced by DJ Premier) # \"Juicy\" (Remix) (4:42) (produced by Pete Rock) ====B-side==== # \"Juicy\" (Instrumental) (5:05) # \"Unbelievable\" (instrumental) (3:45) # \"Juicy\" (remix instrumental) (4:43) ==Official versions== * \"Juicy\" (album version) * \"Juicy\" (instrumental) – 5:05 * \"Juicy\" (dirty mix) – 5:05 * \"Juicy\" (remix) – 3:42 * \"Juicy\" (remix instrumental) – 4:43 ==Charts== ===Weekly charts=== Chart (1994–95) Peak position US Hot Rap Singles (Billboard)[ Billboard Singles - AllMusic] 1 ==Certifications== ==References== Category:1994 songs Category:Debut singles Category:Songs about drugs Category:Poverty",
 "title": "Juicy (The Notorious B.I.G. song)"
}