{
 "id": "544191",
 "text": "The following is a list of notable deaths in June 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==June== ===1=== *Roger Enrico, 71, American businessman (PepsiCo, DreamWorks), heart attack.Former PepsiCo CEO Roger Enrico Dies at 71 *Razak Khan, 62, Indian actor (Baadshah, Hello Brother, Akhiyon Se Goli Maare), heart attack.Comedy actor Razak Khan dies of heart attack; Bollywood celebs mourn his death *Boyce F. Martin, Jr., 80, American judge, Chief Judge of the United States Court of Appeals for the Sixth Circuit (1996–2003), brain cancer.Boyce Martin Jr., giant of bench, has died ===2=== * Corry Brokken, 83, Dutch singer (\"Net als toen\", \"Voorgoed voorbij\", \"Heel de wereld\"), Eurovision Song Contest winner (1957).Corrie Brokken (83) overleden * Tom Kibble, 83, British physicist (Quantum field theory) and educator (Imperial College London).Tom Kibble, UK physicist who worked on Higgs boson dies, says university * Yevhen Lemeshko, 86, Ukrainian football coach (national team, Dynamo Khmelnytskyi, Metalist Kharkiv, stroke.Ушел из жизни Евгений Лемешко *Abderrahmane Meziani, 74, Algerian footballer (USM Alger), heart disease.Football : l'ancien international Abderrahmane Meziani n'est plus * Andrzej Niemczyk, 72, Polish volleyball player and coach (women's national team), European champion (2003, 2005), cancer.Andrzej Niemczyk nie żyje *Freddie Wadling, 64, Swedish singer- songwriter (Blue for Two).Freddie Wadling är död – blev 64 år ===3=== *Muhammad Ali, 74, American boxer, three-time WBC world heavyweight champion (1964, 1974, 1978), Olympic gold medalist (1960), septic shock.\"Muhammad Ali Died of Septic Shock, Will Be Honored at Public Funeral: Spokesman\", by Jon Shuppe, NBC News *Jocelyn Lovell, 65, Canadian cyclist, Commonwealth (1978) and Pan American Games (1971, 1975) gold medalist.Jocelyn Lovell, Canada's first cycling icon *Sten Lundin, 84, Swedish motocross racer, world champion (1959, 1961).Bragdguldvinnaren Sten Lundin är död *Luis Salom, 24, Spanish motorcycle rider, road collision.Luis Salom passes away *Dave Swarbrick, 75, British folk musician and singer-songwriter (Fairport Convention), emphysema.Fairport Convention's Dave Swarbrick dies at 75 (death announced on this date) *Adolph Cornelis van Bruggen, 86, Dutch malacologist.A.C. (Dolf) van Bruggen (1929-2016) ===4=== *Gil Bartosh, 86, American football player and coach.Gilbert \"Gil\" BARTOSH Sr. *Phyllis Curtin, 94, American soprano, non-communicable disease. *Sulabha Deshpande, 79, Indian actress (Bhumika, Arvind Desai Ki Ajeeb Dastaan, Gaman).Veteran actor, theatre person Sulabha Deshpande passes away *István Halász, 64, Hungarian footballer (Tatabánya, Vasas, national team).FOCI Meghalt Halász István, korábbi válogatott labdarúgó *Antti Hyry, 84, Finnish writer.Författaren Antti Hyry är död *Carmen Pereira, 79, Bissau-Guinean politician, acting President (1984).Combatente pela independência da Guiné-Bissau Carmen Pereira morre aos 79 anos ===5=== *Manohar Aich, 104, Indian bodybuilder.\"Manohar Aich: Top Indian bodybuilder dies, aged 104\". BBC (6 June 2016) *Gianluca Buonanno, 50, Italian politician, MEP (since 2014), traffic collision.Lega, Gianluca Buonanno morto in incidente stradale nel Varesotto *Jerome Bruner, 100, American psychologist.Addio a Jerome Bruner *Jarbas Passarinho, 96, Brazilian politician, President of the Senate (1981–1983), Governor of Pará (1964–1966).Morre aos 96 anos o ex- ministro Jarbas Passarinho ===6=== *Ayaz Jani, 48, Pakistani poet and journalist, heart attack.ثقافت کاتي کي به اڪبر لغاري وانگر اياز جاني جي سار لهڻ گهرجي *Viktor Korchnoi, 85, Russian-born Swiss chess player, complications from a stroke. *Steve Pisanos, 96, American air force officer, heart failure. *Theresa Saldana, 61, American actress (Raging Bull, The Commish, I Wanna Hold Your Hand).Theresa Saldana Dies: ‘Commish’ & ‘Raging Bull’ Actress Who Survived Stalker Knife Attack Was 61 *Sir Peter Shaffer, 90, British playwright (Black Comedy, Equus, Amadeus) and screenwriter.Equus and Amadeus playwright Peter Shaffer dies aged 90 *Kimbo Slice, 42, Bahamian-born American mixed martial artist (Bellator, UFC) and actor (Merry Christmas, Drake & Josh), heart failure.Kimbo Slice -- Dead at 42 ===7=== *Johnny Brooks, 84, English footballer (Tottenham Hotspur, Chelsea, Brentford), vascular dementia.Obituary- Johnny Brooks *Amber Gurung, 78, Nepalese musician and composer (national anthem), esophageal cancer.Nepal national anthem composer Amber Gurung dies at 78 *Thomas J. Perkins, 84, American businessman (Kleiner Perkins Caufield & Byers).Thomas Perkins, Tech Financier Who Funded Google, Dies at 84 *Sean Rooks, 46, American basketball player (Dallas Mavericks, Los Angeles Lakers, Los Angeles Clippers), and assistant coach (Philadelphia 76ers), heart disease.Former 76ers assistant, NBA center Sean Rooks dead at 46 ===8=== *Pierre Aubert, 89, Swiss politician, President (1983, 1987). *Stephen Keshi, 54, Nigerian football player (Anderlecht, Strasbourg) and manager (national team), heart attack.Stephen Keshi dies suddenly at 54 *Sascha Lewandowski, 44, German football manager (Bayer Leverkusen, Union Berlin).Sascha Lewandowski, Former Bayer Leverkusen Manager, Dies at Age 44 *Qahhor Mahkamov, 84, Tajik politician, President (1990–1991).Скончался первый президент Таджикистана Каххор Махкамов *Marina Malfatti, 83, Italian actress (The Night Evelyn Came Out of the Grave, The Red Queen Kills Seven Times, Black Killer).Addio a Marina Malfatti, una vita per il teatro. Fu la marchesina di 'Malombra' ===9=== *Hamza Ali, 20, English cricketer (Hampshire), drowning.Hamza Ali: Tributes to Hampshire cricketer after death at age of 20 ===10=== *Mary Feik, 92, American aviator, cancer.Mary Feik, noted aviation engineer, dies *Alexander Gorlov, 85, Russian mechanical engineer.In Memory Of Alexander M Gorlov *Alex Govan, 86, Scottish footballer (Plymouth Argyle, Birmingham City). (death announced on this date) *Habib, 63, Iranian singer, heart attack.حبیب محبیان درگذشت *Gopal Gurung, 80, Nepali politician and author. *Gordie Howe, 88, Canadian Hall of Fame ice hockey player (Detroit Red Wings), complications from a stroke.Gordie Howe Dies, Red Wings Confirm *Mimmo Palmara, 87, Italian actor (A Fistful of Dollars, Bullets Don't Argue, For One Thousand Dollars Per Day).Addio a Mimmo Palmara, villain del cinema italiano e storico direttore di doppiaggio *Alfred Oftedal Telhaug, 81, Norwegian educationalist.Nekrolog: Alfred Oftedal Telhaug *Giuseppe Virgili, 80, Italian footballer (Fiorentina, national team).Viiola in lutto, è morto Giuseppe Virgili ===11=== *Rudi Altig, 79, German cyclist, winner of the 1962 Vuelta a España, world champion (1966), cancer.Voormalig wielerkampioen Rudi Altig (79) is overleden *Shaibu Amodu, 58, Nigerian football manager (national team), heart attack. *Asghar Bichareh, 89, Iranian photographer and actor, laryngeal cancer.Asghar Bichareh Passes Away *Christina Grimmie, 22, American singer-songwriter (Find Me) and talent show participant (The Voice), shot.Singer Christina Grimmie is dead after being shot at Orlando concert *Bryan Robinson, 41, American football player (Chicago Bears, Cincinnati Bengals, Arizona Cardinals). *Lars Skytøen, 86, Norwegian politician, Minister of Industry (1979–1981).Lars Skytøen er død ===12=== *Donald Carr, 89, English cricketer (Derbyshire, Oxford, national team).Donald Carr, former TCCB secretary, dies aged 89 *Vladimir Dolgopolov, 54, Soviet- born Russian football player (FC Zenit Saint Petersburg).В Санкт-Петербурге умер бывший футболист «Зенита» Долгополов *Omar Mateen, 29, American mass shooter (2016 Orlando nightclub shooting), shot.Orlando shooting: 49 killed, shooter pledged ISIS allegiance *Alfonso Portugal, 82, Mexican footballer (national team).Fallece el ex futbolista Alfonso 'Pescado' Portugal *George Voinovich, 79, American politician, Senator from Ohio (1999–2011), Governor of Ohio (1991–1998), Mayor of Cleveland (1980–1989). *Janet Waldo, 96, American voice actress (The Jetsons, The Flintstones, Wacky Races), brain cancer.Janet Waldo, voice of Judy Jetson, dies at age 96 ===13=== *Ofelya Hambardzumyan, 91, Armenian folk singer.Մահացել է Օֆելյա Համբարձումյանը *Randy Jones, 72, British-born American jazz musician (Chet Baker, Dave Brubeck, Maynard Ferguson), heart failure.Randy Jones Obituary *Oleg Karavaychuk, 88, Soviet- born Russian composer.Bizarre Soviet composer has died *Chips Moman, 79, American songwriter (\"(Hey Won't You Play) Another Somebody Done Somebody Wrong Song\") and record producer (Elvis Presley, Bobby Womack), Grammy winner (1976), complications from emphysema.Legendary record producer Chips Moman dies at the age of 79 ===14=== *Ronnie Claire Edwards, 83, American actress (The Waltons).Ronnie Claire Edwards of 'The Waltons' dies *Anatoli Grishin, 76, Russian sprint canoeist, Olympic gold medalist (1964).Умер олимпийский чемпион по гребле Анатолий Гришин *Ann Morgan Guilbert, 87, American actress (The Dick Van Dyke Show), cancer of unknown primary origin.Ann Morgan Guilbert, co-star on 'The Dick Van Show,' dies *Gertrude Kerbis, 89, American architect (O'Hare International Airport), liver cancer.Gertrude Kerbis, groundbreaking architect, dies at 89 *Gilles Lamontagne, 97, Canadian politician, Lieutenant Governor of Quebec (1984–1990), MP (1977–1984).L'ancien maire de Québec Gilles Lamontagne est mort *Henry McCullough, 72, Northern Irish guitarist (Spooky Tooth, Paul McCartney & Wings, The Grease Band).Former Wings guitarist and Northern Ireland music legend Henry McCullough dies *Gregory Rabassa, 94, American literary translator (One Hundred Years of Solitude).Gregory Rabassa, 'One Hundred Years of Solitude' translator, dies *Irma Roy, 84, Argentine actress (Simplemente María, Mi marido y mi novio, Alguien como usted) and politician, member of the Argentine Chamber of Deputies (1995–2005), complications from a fall. * Robert T. Paine, 83, American ecologist (Keystone species), acute myeloid leukemia. ===15=== *Claude Confortès, 88, French actor (War of the Buttons).Mort de Claude Confortès, metteur en scène de Wolinski *Lois Duncan, 82, American writer (I Know What You Did Last Summer, Hotel for Dogs, Who Killed My Daughter?), complications from a stroke.Young-adult fiction writer Lois Duncan dies ===16=== *Bill Berkson, 76, American poet and art critic, heart attack.Bill Berkson, San Francisco poet, art critic and teacher, dies at 76 *Jo Cox, 41, British politician, MP for Batley and Spen (since 2015), shot and stabbed.Labour MP Jo Cox dies after being shot and stabbed in her constituency near Leeds *Irving Moskowitz, 88, American businessman and philanthropist.Irving Moskowitz, pro-settler American Jewish philanthropist, dies at 88 *Pat Suggate, 94, British-born New Zealand geologist.Richard Suggate death notice *Jerome Teasley, 67, American drummer (Junior Walker and the All Stars), complications from lung and liver cancer.Jerome Teasley, drummer for Motown, R&B; legends, dies in Phoenix at 67 ===17=== *Rubén Aguirre, 82, Mexican actor (El Chavo del Ocho, El Chapulín Colorado, Chespirito), complications from pneumonia.Professor Girafales de 'Chaves', morre aos 82 anos *Attrell Cordes, 46, American rhythm and blues singer (P.M. Dawn), kidney disease.Attrell Cordes, Known as 'Prince Be' of PM Dawn, Dies at 46 *Ron Lester, 45, American actor (Varsity Blues, Popular, Good Burger), liver and kidney failure.Ron Lester, Varsity Blues star, dies at 45 *David Morgenthaler, 96, American businessman (Morgenthaler Ventures).David Morgenthaler, One of Venture Capital’s Founding Fathers, Dies at 96 ===18=== *Paul Cox, 76, Dutch-born Australian movie director (My First Wife, A Woman's Tale, Exile), liver cancer. *William J. Livsey, 85, American army general, heart attack. *Vittorio Merloni, 83, Italian entrepreneur and industrialist, founder of Indesit Company.E' morto Vittorio Merloni, storico patron di Indesit *Wu Jianmin, 77, Chinese diplomat, Ambassador to France and the Netherlands (1998–2003), traffic collision.中国前驻法国大使吴建民在武汉遭遇车祸身亡 ===19=== *Nicolás García Uriburu, 78, Argentine artist and landscape architect.Murió el artista plástico Nicolás García Uriburu *Sverre Kjelsberg, 69, Norwegian musician (The Pussycats).Sverre Kjelsberg er død *Ricardo Obregón Cano, 99, Argentine politician, Governor of Córdoba (1973–1974).Falleció Ricardo Obregón Cano, ex gobernador de Córdoba *Götz George, 77, German actor (Tatort).Götz George (77) ist tot! Trauer um einen unserer größten Schauspieler *Victor Stănculescu, 88, Romanian general and politician, Minister of National Defence.Generalul Victor Atanasie Stănculescu a murit într-un azil *Anton Yelchin, 27, Soviet-born American actor (Star Trek, Alpha Dog, Fright Night), blunt traumatic asphyxia.'Star Trek' Actor Anton Yelchin Killed by Own Car at Age 27 ===20=== *Frank Chapot, 84, American equestrian, Olympic silver medalist (1960, 1972).6-time Olympic rider Frank Chapot of N.J. dead at 84 *Benoîte Groult, 96, French journalist, writer and feminist activist.French feminist author Benoite Groult dies at 96 *Ernesto Maceda, 81, Filipino politician, Senate President (1996–1998), Senator (1971–1972, 1987–1998) and columnist, multiple organ failure. *Rich Olive, 66, American politician, member of the Iowa Senate (2007–2011), cancer. *Edgard Pisani, 97, French politician, philosopher and writer.Mort d’Edgard Pisani, résistant et ancien ministre de De Gaulle et de Mitterrand *Chayito Valdez, 71, Mexican-born American folk singer and actress (Zacazonapan), complications from a cerebral hemorrhage.Murió Chayito Valdez a los 71 años ===21=== *Kunio Hatoyama, 67, Japanese politician.衆院議員の鳩山邦夫氏が死去 ６７歳、法相や総務相を歴任 *Henk Hofland, 88, Dutch journalist, columnist and writer.Journalist Henk Hofland (88) overleden *Al Howie, 70, Canadian long distance runner, complications from diabetes.Obituary: Ultra-marathoner Al Howie was always in the running ===22=== *Joan Acker, 92, American sociologist.In Memory of Joan Acker: 1924–2016 *John William Ashe, 61, Antiguan diplomat, President of the United Nations General Assembly (2013–2014), heart attack. *Vasily Bochkaryov, 67, Russian politician.Скончался экс-губернатор Пензенской области Василий Бочкарев *Jim Boyd, 60, American singer-songwriter.Jim Boyd, singer- songwriter and chairman of the Colville Tribes, dies *Marc Allan Feldman, 56, American physician and politician.Cleveland Clinic doc who sought Libertarian Party presidential bid found dead in Brook Park motel *David J. Hickson, 85, British organizational theorist. *Yaşar Nuri Öztürk, 71, Turkish theologian and politician, stomach cancer.Yaşar Nuri Öztürk hayatını kaybetti *Harry Rabinowitz, 100, British music composer (Reilly, Ace of Spies) and conductor (Chariots of Fire, Cats). *Samir Roychoudhury, 82, Indian writer (Hungry Generation).Samir Roychoudhury, co-founder of Hungry Generation, dead *Amjad Sabri, 45, Pakistani qawwali singer, shot.Pakistan Sufi singer Amjad Sabri shot dead in Karachi ===23=== *James Green, 71, American historian, leukemia.Jim Green, activist and historian, has died at age 71 *Stanley Mandelstam, 87, American theoretical physicist. *Ralph Stanley, 89, American bluegrass musician and member of The Stanley Brothers, Grammy winner (2002), skin cancer.Music legend Ralph Stanley dead at 89 ===24=== *Bernie Worrell, 72, American musician (Parliament-Funkadelic), lung cancer.Bernie Worrell, Masterful P-Funk Keyboardist, Dead at 72 ===25=== *Nicole Courcel, 84, French actress (Rendezvous in July, Sundays and Cybele).Mort de la comédienne de cinéma et de théâtre Nicole Courcel *Bill Cunningham, 87, American fashion photographer (The New York Times), complications from a stroke.Bill Cunningham, Legendary Times Fashion Photographer, Dies at 87 *Giuseppe Ferrara, 83, Italian movie director (The Moro Affair), cardiac arrest.È morto Giuseppe Ferrara, regista dell'impegno civile *Bur’i Mohamed Hamza, 70s, Somali politician, injuries sustained in Hotel Naso-Hablod attack.Somalia: State Minister Among 15 Killed in Mogadishu Hotel Attack *Patrick Mayhew, 86, Northern Irish-born British barrister and politician, Secretary of State for Northern Ireland (1992-1997), complications from Parkinson's disease.BREAKING: Former Northern Irish secretary Lord Mayhew dies *Mohapatra Nilamani Sahoo, 89, Indian writer (Akasha Patala, Abhisapta Gandharba), multiple organ failure. ===26=== *Austin Clarke, 81, Canadian novelist (The Polished Hoe).Tom Clarke passes *Barbara Goldsmith, 85, American author (Little Gloria), heart failure.Barbara Goldsmith, Author of ‘Little Gloria,’ Dies at 85 *Ryan Jimmo, 34, Canadian mixed martial artist (UFC, MFC), traffic collision.Seven-time UFC vet Ryan Jimmo dead at 34 after being struck in hit and run *Kim Sung-min, 43, South Korean actor (Miss Mermaid, Time, The Weight), suicide by hanging. *Kavalam Narayana Panicker, 88, Indian dramatist, theatre director and poet, respiratory failure.Malayalam dramatist Kavalam Narayana Panicker dies at 88 *Rostislav Yankovsky, 86, Belarusian actor, People's Artist of the USSR (1978).В Минске умер народный артист СССР Ростислав Янковский ===27=== *Elmer Cravalho, 90, American politician, Speaker of the Hawaii House of Representatives (1959–1967), Mayor of Maui (1969–1979).Elmer Cravalho, Maui's first mayor, dies *Pelle Gudmundsen-Holmgreen, 83, Danish composer, cancer.NEKROLOG: En stor original i dansk musik er død *Harry Halbreich, 85, Belgian musicologist.Mort d’Harry Halbreich, musicologue belge *Simon Ramo, 103, American engineer, businessman and author.Simon Ramo dies at 103; TRW co- founder shaped California aerospace *Mack Rice, 82, American songwriter (\"Mustang Sally\", \"Respect Yourself\") and singer, complications of Alzheimer's disease. ‘Mustang Sally’ author ‘Sir’ Mack Rice dies *Bud Spencer, 86, Italian actor (They Call Me Trinity, Watch Out, We're Mad!, A Friend Is a Treasure) and Olympic swimmer.È morto l’attore Bud Spencer, aveva 86 anni *Alvin Toffler, 87, American writer and futurist (Future Shock, The Third Wave).Alvin Toffler, author of best-selling ‘Future Shock’ and ‘The Third Wave,’ dies at 87 ===28=== *Scotty Moore, 84, American guitarist (Elvis Presley).Musical icon, Elvis’ guitarist Scotty Moore dies *Buddy Ryan, 85, American football head coach (Philadelphia Eagles, Arizona Cardinals) and defensive coordinator (Chicago Bears, Houston Oilers), cancer.Former NFL coach, defensive guru Buddy Ryan dies at age 82 *Pat Summitt, 64, American basketball coach (Tennessee Lady Volunteers), dementia.Pat Summitt, winningest coach in NCAA Division I basketball history, dead at 64 *Zurlon Tipton, 26, American football player (Indianapolis Colts), accidental gunshot wound. ===29=== *Inocente Carreño, 96, Venezuelan composer, complications from pneumonia.Falleció el maestro Inocente Carreño a sus 96 años de edad *Gunnar Garbo, 92, Norwegian politician, MP (1958–1973).Tidligere Venstre-leder Gunnar Garbo er død *Ojo Maduekwe, 71, Nigerian politician, Minister of Foreign Affairs (2007–2010).Nigeria: Former Minister, Ojo Maduekwe, Literary Icon, Elechi Amadi, Pass On *Vasyl Slipak, 42, Ukrainian opera singer, shot.Ukrainian Opera Singer Killed While Fighting In Eastern Ukraine *Xu Jiatun, 100, Chinese politician and dissident, Governor of Jiangsu (1977–1979).Xu Jiatun dies in exile, aged 100 ===30=== *Don Friedman, 81, American jazz pianist.Don Friedman (1935–2016) *Juan Habichuela, 83, Spanish flamenco guitarist.Muere Juan Carmona 'Habichuela' *Geoffrey Hill, 84, British poet.Geoffrey Hill, 'one of the greatest English poets', dies aged 84 *Martin Lundström, 98, Swedish cross-country skier, Olympic champion (1948).Martin Lundström död – blev 98 år gammal *Gordon Murray, 95, British puppeteer and television producer (Trumpton, Camberwick Green, Chigley).Trumpton creator Gordon Murray dies aged 96 ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *06 Category:June 2016 events",
 "title": "Deaths in June 2016"
}