{
 "id": "544153",
 "text": "The Missouri House of Representatives is the lower chamber of the Missouri General Assembly. It has 163 members, representing districts with an average size of 37,000 residents. Members of the House are elected for a two-year term during general elections held in even-numbered years. In 1992 Missouri approved a constitutional amendment providing term limits (before this there were no limits). No Representative may serve more than eight years in the House. Each candidate for the office must be at least twenty-four years old, a qualified registered voter in the state for at least two years, and a resident of his or her district for at least one year.http://www.house.mo.gov/billtracking/info/1821.pdf Missouri's house is the fourth largest in the United States although the state ranks 18th in population. Legislation was introduced in 2011 to cut its size to 103 members in 2020. States with larger legislatures in the United States are New Hampshire (400), Pennsylvania (203) and Georgia (180). ==Composition== Affiliation Party (Shading indicates majority caucus) Party (Shading indicates majority caucus) Party (Shading indicates majority caucus) Total Affiliation Total Affiliation Republican Democratic Independent Total Vacant BeginRepublican Noel Torpey (HD-29) resigned in December 2014, before the start of the session. 116 45 – 162 1 January 27, 2015Former Democrat Keith English of Florissant filed to be an Independent. 116 44 1 162 1 May 15, 2015Speaker John Diehl resigned. 116 44 1 161 2 June 23, 2015Democrat Kevin McManus resigned to take a seat on the Kansas City City Council. 116 43 1 160 3 November 3, 2015Democrats Rory Rowland and Daron McGee and Republican Dean Plocher succeeded Torpey, McManus, and Diehl, respectively. 117 45 1 163 0 February 17, 2016 116 45 1 163 1 Latest voting share == Term Limits == In 1992 Missouri voters approved a constitutional amendment placing term limits on the Missouri House of Representatives. A Representative can serve no more than four two-year terms in the house (a total of eight years). The first time term limits prevented someone from running again was in 2002. == Salary == As of March 2008, members of the Missouri House of Representatives receive an annual salary of $35,915.44. == Related pages == *Missouri General Assembly *Missouri Senate *Government of Missouri == References == == Other websites == * Missouri House of Representatives - Official Website * Missouri House of Representatives Member Roster, 2016 Category:Organizations based in Missouri Category:1821 establishments in Missouri Category:State lower houses in the United States Category:Missouri General Assembly",
 "title": "Missouri House of Representatives"
}