{
 "id": "54465",
 "text": "This timeline is to show the history of Christianity from the beginning to the present. Question marks on dates mean that dates are not exact. Western culture and Christian churches use the Gregorian calendar. The Gregorian calendar has been in use since 1582 when it replaced the less precise Julian Calendar. The Gregorian calendar began in Europe, in the reign of Pope Gregory XIII. The Gregorian calendar is now used almost everywhere in the world (except for calculating the holy days of other religions). The Gregorian calendar dates years from before or after the birth of Jesus. Years that are before the birth of Jesus have the initials BC (before Christ) and years that are after (traditionally) have the initials AD (anno Domini – \"in the year of our Lord\"). Nowadays these are often written BCE (\"before the Common Era\") and CE (\"Common Era\"). The \"year one\" is the first year in \"anno Domini\" (the Common Era). There is no year zero. When the Gregorian calendar was calculated, the scholars tried to work out exactly when the birth of Jesus happened. The exact date is not certain, but most agree that it was between 6 BC and 4 BC. ==Era of Jesus== This list tells only about the things that happened in the part of the world where Jesus was born. This region is now called Israel and Palestine. In the time of Jesus, it was under the rule of the Romans. *1 This year is sometimes celebrated as beginning near the time of Jesus' birth. People who study it now say that it was calculated wrongly and he was born in 4 BC. *6 Herod Archelaus was deposed (put off his throne) by Caesar Augustus. The Roman rulers brought together Samaria, Judea and Idumea as \"Iudaea Province\" with its capital at Caesarea. Quirinius became Governor of Syria. Quininus conducted a census and was opposed by a Jewish group called the Zealots (JA18, (, ) *7–26 Brief period of peace, relatively free of revolt and bloodshed in Iudaea and Galilee (John P. Meier's A Marginal Jew, v. 1, ch. 11) *9 Pharisee leader Hillel the Elder dies, temporary rise of Shammai *14–37 Tiberius, Roman Emperor *18–36 Caiaphas, appointed High Priest of Herod's Temple by Prefect Valerius Gratus, deposed by Syrian Legate Lucius Vitellius *19 Jews, Jewish proselytes, astrologers, expelled from Rome (Suetonius, Lives of the Twelve Caesars, Tiberius 36, Loeb Classics) *26–36 Pontius Pilate, Prefect (governor) of Judaea, recalled to Rome by Syrian Legate Vitellius on complaints of excess violence (JA18.4.2) *28 or 29 John the Baptist began his ministry in the \"15th year of Tiberius\" (), saying: \"Repent, for the kingdom of heaven is near\" (), a relative of Jesus (), a Nazirite (), baptized Jesus (), later arrested and beheaded by Herod Antipas (), it is possible that, according to Josephus' chronology, John was not killed until 36 (JA18.5.2) Jesus began his ministry after his baptism by John and during the rule of Pilate, preaching: \"Repent, for the kingdom of heaven is near\" (). While the historicity of the gospel accounts is questioned to some extent by most critical scholars and non-Christians, the traditional view states the following chronology for his ministry: Temptation, Sermon on the Mount, Appointment of the Twelve, Miracles, Temple Money Changers, Last Supper, Arrest, Trial, Passion, Crucifixion on Good Friday (, ), Nisan 14th (, , Gospel of Peter) or Nisan 15th (Synoptic Gospels), (7 Apr 30, 3 Apr 33, 30 Mar 36, possible Fri-14-Nisan dates – Meier), entombment by Pharisees Joseph of Arimathea and Nicodemus of the Sanhedrin, Resurrection by God on Easter Sunday, appearances to Paul of Tarsus (), Simon Peter (), Mary Magdalene (, ), and others, Great Commission, Ascension, Second Coming Prophecy to fulfill the rest of Messianic prophecy such as the Resurrection of the dead, the Last Judgment, and establishment of the Kingdom of God and the Messianic Age. See also Chronology of Jesus. ==Era of the Apostles== Shortly after the Crucifixion of Jesus (Nisan 14 or 15), the Jerusalem church was founded as the first Christian church with about 120 Jews and Jewish proselytes (), followed by Pentecost, the Ananias and Sapphira incident, Pharisee Gamaliel's defense of the Apostles (), the stoning of Saint Stephen (see also Persecution of Christians) and the subsequent dispersal of the church () which led to the baptism of Simon Magus in Samaria (), and also an Ethiopian eunuch (). Paul's conversion to \"Apostle to the Gentiles\" is first recorded in (, cf. ). Peter baptized the Centurion Cornelius, who is traditionally considered the first Gentile convert to Christianity (). The Antioch church was founded. It was there that the term Christian was first used (). Saint James was executed by Agrippa I (ruled 39–44) during a Passover (Nisan 15) (). *44 Death of Agrippa I (JA19.8.2, ) *44–46? Theudas beheaded by Procurator Cuspius Fadus for saying he would part the Jordan river (like Moses and the Red Sea) (JA20.5.1, places it before the Census of Quirinius) *45–49? Paul's first mission (), with Barnabas, to Cyprus, Pisidian Antioch, Iconium, Lystra and Derbe (there they were called \"gods ... in human form\"), then return to Syrian Antioch *47? The Church of the East is created by Saint Thomas *48–100 Herod Agrippa II appointed King of the Jews by Claudius, seventh and last of the Herodians *49 \"Since the Jews constantly made disturbances at the instigation of Chrestus,A. J. MAAS (2003). Origin of the Name of Jesus Christ. Retrieved January 23, 2006. Walter Bauer's et al. Greek-English Lexicon of the New Testament, 1979, under Christos notes: \"as a personal name; the Gentiles must have understood Christos in this way (to them it seemed very much like Chrestos [even in pronunciation ...], a name that is found in lit.\" he, Claudius, expelled them from Rome.\" (Suetonius, Lives of the Twelve Caesars, Claudius XXV.4, Loeb Classics) (referenced in ) *50 Passover riot in Jerusalem, 20–30,000 killed (JA20.5.3, JW2.12.1) *50? Council of Jerusalem and the \"Apostolic Decree\", , same as ?, which is followed by the \"Incident at Antioch\"Catholic Encyclopedia: Judaizers see section titled: \"THE INCIDENT AT ANTIOCH\" at which Paul publicly accused Peter of \"Judaizing\" () *50–53? Paul's second mission (), split with Barnabas, to Phrygia, Galatia, Macedonia, Philippi, Thessalonica, Berea, Athens, Corinth, \"he had his hair cut off at Cenchrea because of a vow he had taken\", then return to Antioch; 1 Thessalonians, Galatians written? *52? Saint Thomas Christians of India *53–57? Paul's third mission (), to Galatia, Phrygia, Corinth, Ephesus, Macedonia, Greece, and Jerusalem where James the Just challenged him about a rumor of teaching antinomianism (). He addressed a crowd in their language (most likely Aramaic), Romans, 1 Corinthians, 2 Corinthians, Philippians written? *55? \"Egyptian Prophet\" (allusion to Moses) and 30,000 unarmed Jews doing the Exodus reenactment massacred by Procurator Antonius Felix (JW2.13.5, JA20.8.6, ) *58? Paul arrested, accused of being a revolutionary, \"ringleader of the sect of the Nazarenes\", teaching resurrection of the dead, imprisoned in Caesarea () *59? Paul shipwrecked on Malta. There he was called a god. () *60? Paul in Rome: greeted by many \"brothers\" (NRSV: \"believers\"), three days later called together the Jewish leaders, who had not received any word from Judea about him, but were curious about \"this sect\", which everywhere is spoken against; he tried to convince them from the \"Law and Prophets\", with partial success, said the Gentiles would listen and spent two years proclaiming the Kingdom of God and teaching the \"Lord Jesus Christ\" (); Epistle to Philemon written? *62 James the Just stoned to death for law transgression by High Priest Ananus ben Artanus. Popular opinion against act results in Ananus being deposed by new procurator Clodius Albinus. (JA20.9.1) *63–107? Simeon, second Bishop of Jerusalem, crucified under Trajan *63? Glastonbury Abbey founded according to tradition, but date disputed *64–68 after July 18 Great Fire of Rome, Nero blamed and persecuted the Christians, earliest mention of Christians, by that name, in Rome, see also Tacitus on Jesus, Paul beheaded? (, , , 1Clem 5:5–7), Peter crucified upside down? (, , Tertullian's Prescription Against Heretics chapter XXXVI, Eusebius' Church History Book III chapter I), \"...a vast multitude, were convicted, not so much of the crime of incendiarism as of hatred of the human race. And in their deaths they were made the subjects of sport; for they were wrapped in the hides of wild beasts and torn to pieces by dogs, or nailed to crosses, or set on fire, and when day declined, were burned to serve for nocturnal lights.\" (Annals (Tacitus) XV.44) ==Early Christianity== *65? Q document, a hypothetical Greek text thought by many critical scholars to have been used in writing of Matthew and Luke *66–73 Great Jewish Revolt: destruction of Herod's Temple, Qumran community destroyed, site of Dead Sea Scrolls found in 1947 *68–107? Ignatius, third Bishop of Antioch, fed to the lions in the Roman Colosseum, advocated the Bishop (Eph 6:1, Mag 2:1,6:1,7:1,13:2, Tr 3:1, Smy 8:1,9:1), rejected Jewish Sabbath on Saturday in favor of The Lord's Day (Sunday). (Mag 9.1), rejected Judaizing (Mag 10.3), first use of term Christianity (Mag 10). *70(±10)? Gospel of Mark, written in Rome, by Peter's interpreter (1 Peter 5:13), original ending apparently lost, endings added c. 400, see Mark 16 *70? Signs Gospel written, hypothetical Greek text used in Gospel of John to prove Jesus is the Messiah *70–100? additional Pauline Epistles *70–200? Didache; Other Gospels: Unknown Berlin Gospel, Gospel of Peter, Gospel of Thomas, Oxyrhynchus Gospels, Egerton Gospel, Fayyum Fragment, Dialogue of the Saviour; Jewish Christian Gospels: Gospel of the Ebionites, Gospel of the Hebrews, Gospel of the Nazarenes *80(±20)? Gospel of Matthew, based on Mark and Q, most popular in Early Christianity *80(±20)? Gospel of Luke, based on Mark and Q, also Acts of the Apostles by same author *88–101? Clement, fourth Bishop of Rome, wrote Letter of the Romans to the Corinthians (Apostolic Fathers) *90? Council of Jamnia of Judaism (disputed) *90(±10)? 1 Peter *94 Testimonium Flavianum, disputed section of Jewish Antiquities by Josephus in Aramaic, translated to Koine Greek *95(±30)? Gospel of John and Epistles of John *95(±10)? Book of Revelation written, by John (son of Zebedee) and/or a disciple of his *100(±30)? Epistle of Barnabas (Apostolic Fathers) *100(±25)? Epistle of James *100(±10)? Epistle of Jude written, probably by doubting relative of Jesus (Mark 6:3), rejected by some early Christians due to its reference to apocryphal Book of Enoch (v14). Epistle to the Hebrews written. *100–150? Apocryphon of James, Gospel of Mary Magdalene, Gospel of James, Infancy Gospel of Thomas, Secret Gospel of Mark (Complete Gospels, published by Jesus Seminar) *110–130? Papias, bishop of Hierapolis, wrote: \"Expositions of the Sayings of the Lord\", lost, widely quoted (Apostolic Fathers) *110–160? Polycarp, bishop of Smyrna, Letter to the Philippians, (Apostolic Fathers) *125(±5)? 2 Peter written, not accepted into canon until early 400s, drew upon Epistle of Jude, \"catholic\" epistle, Pastoral Epistles written *125? Rylands Library Papyrus P52, oldest extant NT fragment, p. 1935, parts of Jn18:31–33,37–38 *130–250? \"Christian Apologists\" writings against Roman religion: Justin Martyr, Athenagoras, Apology of Aristides, Theophilus of Antioch, Tatian, Quadratus, Melito of Sardis, Apollinaris Claudius, Felix Marcus Minucius, Arnobius, Epistle to Diognetus *132–135 Bar Kokhba's revolt: final Jewish revolt, Judea and Jerusalem erased from maps, region renamed Syria Palæstina (the term Palestine was originally coined by Herodotus), Jerusalem renamed Aelia Capitolina *142–144? Marcion of Sinope, bishop according to Catholic Encyclopedia, went to Rome, possibly to buy the bishopric of Rome, upon rejection formed his own church in Rome, later called Marcionism, rejected Old Testament, decreed canon of one Gospel, one Apostolicon (10 Letters of Paul) and one Antithesis which contrasted the Old Testament with the New Testament, cited Western text-type, see also Expounding of the Law#Antithesis of the Law *150? \"Western Revisor\" adds/subtracts from original Acts to produce Western version which is 10% larger and found in Papyrus P29,38,48 and Codex Bezae (D) *150? Valentinius, most famous Christian Gnostic, according to Tertullian narrowly lost election for Bishop of Rome *150(±10)? Shepherd of Hermas, written in Rome (Apostolic Fathers) *155? Montanus, claimed to be the Paraclete (\"Counselor\") of *160? Martyrdom of Polycarp (Apostolic Fathers) *170? Dionysius , bishop of Corinth, claimed Christians were changing and faking his own letters just as [he knew] they had changed the Gospels (Eusebius' EH 4 c.23 v.12;Ante-Nicene Fathers, v.8) *170? Tatian produces \"Diatessaron\" (Harmony) by blending four \"Western\" text-type Gospels into one *170? Symmachus the Ebionite, new Greek translation of Hebrew Bible *180? Hegesippus *180–202? Irenaeus, Bishop of Lyon, combated heresies, cited \"Western\" Gospel text-type (Ante-Nicene Fathers) *185–350? Muratorian fragment, 1st extant canon for New Testament after Marcion?, written in Rome by Hippolytus?, excludes Hebrews, James, 1–2 Peter, 3 John; includes Wisdom of Solomon, Apocalypse of Peter *186? Saint Apollonius, used the term catholic in reference to 1 John *188–231 Saint Demetrius, bishop of Alexandria, condemned Origen *189–198 Pope Victor I, 1st Latin Pope, excommunicated Eastern churches that continued to observe Easter on Nisan 14 Quartodeciman *196? Polycrates, bishop of Ephesus (Ante-Nicene Fathers) *199–217? Caius , presbyter of Rome, wrote \"Dialogue against Proclus\" in Ante-Nicene Fathers, rejected Revelation, said to be by Gnostic Cerinthus *200? Papyrus 46: 2nd Chester Beatty, Alexandrian text-type; Papyrus 66: 2nd Bodmer, John, 1956, \"Alexandrian/Western\" text-types; Papyrus 75: Bodmer 14–15, Luke and John, earliest extant Luke, ~Vaticanus; 200? Papyrus 32: J. Rylands Library: Titus 1:11–15;2:3–8; Papyrus 64 (+67): Mt3:9,15; 5:20–22,25–28; 26:7–8,10,14–15,22–23,31–33 *200? Sextus Julius Africanus *200? Antipope Natalius , rival bishop of Rome, according to Eusebius's EH5.28.8–12, quoting the Little Labyrinth of Hippolytus, after being \"scourged all night by the holy angels\", covered in ash, dressed in sackcloth, and \"after some difficulty\", tearfully submitted to Pope Zephyrinus *217–236 Antipope Hippolytus, Logos sect? *218–258 Cyprian, Bishop of Carthage, cited \"Western\" NT text-type, claimed Christians were freely forging his letters to discredit him (Ante-Nicene Fathers) *220? Clement of Alexandria, cited \"Alexandrian\" NT text-type and Secret Gospel of Mark and Gospel of the Egyptians; wrote: \"Exhortations to the Greeks\"; \"Rich Man's Salutation\"; \"To the Newly Baptized\"; (Ante-Nicene Fathers) *220?–340? Codex Tchacos, manuscript containing a copy of the Gospel of Judas, has been written. *223? Tertullian, sometimes called \"father of the Latin Church\" because he coined trinitas, tres Personae, una Substantia, Vetus Testamentum, Novum Testamentum, convert to Montanism, cited \"Western\" Gospel text-type (Ante-Nicene Fathers) *225? Papyrus 45: 1st Chester Beatty, Gospels (Caesarean text-type), Acts (Alexandrian text-type) *235–238 Maximinus Thrax, emperor of Rome, ends Christian schism in Rome by deporting Pope Pontian and Antipope Hippolytus to Sardinia where they soon die *248–264 Dionysius, Patriarch of Alexandria see also List of Patriarchs of Alexandria *250? Apostolic Constitutions, Liturgy of St James, Old Roman Symbol, Clementine literature *250? Letters of Methodius, Pistis Sophia, Porphyry Tyrius, Commodianus (Ante-Nicene Fathers) *250? Papyrus 72: Bodmer 5–11+, pub. 1959, \"Alexandrian\" text-type: Nativity of Mary; 3Cor; Odes of Solomon 11; Jude 1–25; Melito's Homily on Passover; Hymn fragment; Apology of Phileas; Ps33,34; 1Pt1:1–5:14; 2Pt1:1–3:18 *250? Origen, Jesus and God one substance, adopted at First Council of Nicaea in 325, compiled Hexapla; cites Alexandrian, Caesarean text-type; Eusebius claimed Origen castrated himself for Christ due to Mt19:12 (EH6.8.1–3) *251–424? Synods of Carthage *251–258 Antipope Novatian, decreed no forgiveness for sins after baptism *254–257 Pope Stephen I; major schism over rebaptizing heretics and apostates *258 \"Valerian's Massacre\": Roman emperor issued edict to execute immediately all Christian bishops, presbyters, and deacons, including Pope Sixtus II, Antipope Novatian, Cyprian of Carthage (CE: Valerian, Schaff's History Vol 2 Chap 2 § 22) *264–269 Synods of Antioch, condemned Paul of Samosata, Bishop of Antioch, founder of adoptionism (Jesus was human until Holy Spirit descended at his baptism), also condemned term homoousios adopted at Nicaea *265 Gregory Thaumaturgus (Ante-Nicene Fathers) *270? Anthony begins monastic movement *275? Papyrus 47: 3rd Chester Beatty, ~Sinaiticus, Rev9:10–11:3,5–16:15,17–17:2 *276 Mani (prophet), crucified, founder of the dualistic Manichaean sect in Persia *282–300? Theonas, bishop of Alexandria (Ante-Nicene Fathers) *290–345? St Pachomius, founder of Christian monasticism *296–304 Pope Marcellinus, offered pagan sacrifices for Diocletian *301 Armenia, first to adopt Christianity as state religion *303–312 Diocletian's Massacre of Christians *303 Saint George, patron saint of England, and other states *304? Victorinus, bishop of Pettau *306 Synod of Elvira, prohibited relations between Christians and Jews *310 Maxentius deports Pope Eusebius and Heraclius to Sicily (relapse controversy) *312 Lucian of Antioch, founded School of Antioch, martyred *312 Vision of Constantine: while gazing into the sun he saw a cross with the words by this sign conquer. See also Labarum. He was later called the 13th Apostle and Equal-to-apostles. *313 Edict of Milan, Constantine and Licinius end persecution, establish toleration of Christianity *313? Lateran Palace given to Pope Miltiades for residence by Constantine *314 Council of Arles , called by Constantine against Donatist schism *314–340? Eusebius, bishop of Caesarea, church historian, cited Caesarean text-type, wrote Ecclesiastical History in 325 *317? Lactantius *321 Constantine decreed Sunday as state \"day of rest\" (CJ3.12.2), see also Sol Invictus ==Era of the Seven Ecumenical Councils== Constantine called the First Council of Nicaea in 325 to unify Christology, also called the first great Christian council by Jerome, the first ecumenical, decreed the Original Nicene Creed, but rejected by Nontrinitarianism such as Arius, Theonas, Secundus, Eusebius of Nicomedia, and Theognis who were excommunicated, also addressed Easter controversy and passed 20 Canon laws. *325 The Kingdom of Aksum (Modern Ethiopia) declares Christianity as the official state religion becoming the second country to do so *325 Church of the Nativity in Bethlehem, ordered by Constantine *326, November 18 Pope Sylvester consecrates the Basilica of St. Peter built by Constantine the Great over the tomb of the Apostle. *328–373 Athanasius, bishop of Alexandria, first cite of modern 27 book New Testament canon *330 Old Church of the Holy Apostles, dedicated by Constantine *330, May 11 Constantinople solemnly inaugurated. Constantine moves the capital of the Roman Empire to Byzantium, renaming it New Rome. *335 Council in Jerusalem, reversed Nicaea's condemnation of Arius, consecrated Jerusalem Church of the Holy Sepulchre *337 Mirian III of Georgia, second to adopt Christianity as state religion *May 22, 337: Constantine the Great dies. Baptized shortly before his death. *343? Council of Sardica *350? Julius Firmicus Maternus *350? Codex Sinaiticus(א), Codex Vaticanus(B): earliest Christian Bibles, Alexandrian text-type *350? Ulfilas, Arian, apostle to the Goths, translated Greek NT to Gothic *350? Comma Johanneum 1Jn5:7b–8a(KJV) *350? Aëtius, Arian, \"Syntagmation\": \"God is agennetos (unbegotten)\", (Anomoean) *350? School of Nisibis founded *351 2nd Council of Sirmium, Anomoean, condemned Council of Nicaea *353–367 Hilary, bishop of Poitiers *355–365 Antipope Felix II, Arian, supported by Constantius II, consecrated by Acacius of Caesarea *359 Council of Rimini, Dated Creed (Acacians) * 360: Julian the Apostate becomes the last non-Christian Roman Emperor. *363–364 Council of Laodicea, canon 29 decreed anathema for Christians who rest on the Sabbath, disputed canon 60 named 26 NT books (excluded Revelation) *366–367 Antipope Ursicinus, rival to Pope Damasus I *367–403 Epiphanius, bishop of Salamis, wrote Panarion against heresies *370–379 Basil the Great, Bishop of Caesarea *370? Doctrine of Addai at Edessa proclaims 17 book NT canon using Diatessaron (instead of the 4 Gospels) + Acts + 15 Pauline Epistles (inc. 3 Corinthians) Syriac Orthodox Church *372–394 Gregory, Bishop of Nyssa *373 Ephrem the Syrian, cited Western Acts *374–397 Ambrose, bishop and governor of Milan *375–395 Ausonius, Christian governor of Gaul *379–381 Gregory Nazianzus, Bishop of Constantinople *380, February 27 Emperor Theodosius issues the edict De Fide Catolica declaring Catholic Christianity as the official state religion of the Roman EmpireTheodosian Code XVI.1.2 Medieval Sourcebook: Banning of Other Religions by Paul Halsall, June 1997, Fordham University, retrieved September 25, 2006; IMPERATORIS THEODOSIANI CODEX Liber Decimus Sextus , Emperor Theodosius, George Mason University retrieved September 25, 2006; Theodosian Code XVI.1.2; Catholic Encyclopedia: Theodosius I: \"In February, 380, he and Gratian published the famous edict that all their subjects should profess the faith of the Bishops of Rome and Alexandria (Cod. Theod., XVI, I, 2; Sozomen, VII, 4).\" *November 24, 380: Emperor Theodosius I is baptised. *381 First Council of Constantinople, second ecumenical, Jesus had true human soul, Nicene Creed of 381 *382 Council of Rome under Pope Damasus I sets the Biblical Canon, listing the inspired books of the Old Testament and the New Testament (disputed) *383? Frumentius, Apostle of Ethiopia *385 Priscillian, first heretic to be executed? *390? Apollinaris, bishop of Laodicea, believed Jesus had human body but divine spirit *391: The Theodosian decrees outlaw most pagan rituals still practiced in Rome. *396–430 Augustine, bishop of Hippo, considered the founder of formalized Christian theology (Nicene and Post-Nicene Fathers) *397? Saint Ninian evangelizes Picts in Scotland *398–404 John Chrysostom Patriarch of Constantinople, (Nicene and Post-Nicene Fathers) *400: Jerome's Vulgate Latin edition and translation of the Bible is published. *400? Ethiopic Bible: in Ge'ez, 81 books, standard Ethiopian Orthodox Bible *400? Peshitta Bible in Syriac (Aramaic), Syr(p), OT + 22 NT, excludes: 2Pt, 2–3Jn, Jude, Rev; standard Syriac Orthodox Church Bible *406 Armenian Bible, translated by Saint Mesrob, standard Armenian Orthodox Bible *24 August 410: Sack of Rome by Alaric and the Visigoths. *412–444 Cyril, bishop of Alexandria, expelled Jews, killed Hypatia with oyster shells, coined Hypostatic union *418–419 Antipope Eulalius rival to Pope Boniface I *420 St. Jerome, Vulgate translations, Latin scholar, cited expanded ending in Mark after Mark 16:8, Pericope of the Adultress addition to John (John 7:53–8:11) (Nicene and Post-Nicene Fathers) *423–457 Theodoret, bishop of Cyrrhus, noted Tatian's Diatesseron in heavy use, wrote a Church History *431 Council of Ephesus, third ecumenical, repudiated Nestorianism, decreed Mary the Mother of God, forbid any changes to Nicene Creed of 381, rejected by Assyrian Church of the East *432 St Patrick begins mission in Ireland. Almost the entire nation is Christian by the time of his death in a conversion that is both incredibly successful and largely bloodless. *440–461 Pope Leo the Great, sometimes considered the first pope, stopped Attila the Hun at Rome, issued Tome in support of Hypostatic Union, approved Council of Chalcedon but rejected canons in 453 *447 Council of Toledo added Filioque clause to Nicene Creed of 381 *449 Second Council of Ephesus, Monophysite: Jesus was divine but not human *450? Codex Alexandrinus(A): Alexandrian text-type; Codex Bezae(D): Greek/Latin Gospels + Acts; Codex Washingtonianus(W): Greek Gospels; both of Western text-type *450? std. Aramaic Targums, Old Testament in Aramaic *450? Socrates Scholasticus Church History of 305–438; Sozomen Church History of 323–425 *451 Council of Chalcedon, fourth ecumenical, declared Jesus is a Hypostatic Union: both human and divine in one, Chalcedonian Creed, rejected by Oriental Orthodoxy *455: Sack of Rome by the Vandals. The spoils of the Temple of Jerusalem previously taken by Titus are allegedly among the treasures taken to Carthage. *456? Eutyches of Constantinople, Monophysite *452: Pope Leo I (the Great) dissuades Attila the Hun, the Scourge of God, from sacking Rome. *465? Prosper of Aquitaine *476, September 4 Emperor Romulus Augustus is deposed in Rome, marked by many as the fall of the Western Roman Empire *484–519 Acacian Schism, over Henoticon divides Eastern (Greek) and Western (Latin) churches *491 Armenian Orthodox split from East (Greek) and West (Latin) churches *495 May13 Vicar of Christ decreed a title of Bishop of Rome by Pope Gelasius I *496 Clovis I, King of the Franks, baptized *498–499,501–506 Antipope Laurentius, rival of Pope Symmachus, Laurentian schism *500? Incense introduced in Christian church service, first plans of Vatican *524 Boethius, Roman Christian philosopher, wrote: Theological Tractates, Consolation of Philosophy; *525 Dionysius Exiguus defines Christian calendar (AD) *527 Fabius Planciades Fulgentius *530 Antipope Dioscorus, possibly a legitimate Pope *530 Rule of St Benedict, St. Benedict founds the Benedictines *535–536 Unusual climate changes recorded *537–555 Pope Vigilius, involved in death of Pope Silverius, conspired with Justinian and Theodora, on April 11, 548, issued Judicatum supporting Justinian's anti-Hypostatic Union, excommunicated by bishops of Carthage in 550 *541–542 Plague of Justinian *543 Justinian condemns Origen, disastrous earthquakes hit the world *544 Justinian condemns the Three Chapters of Theodore of Mopsuestia (d.428) and other writings of Hypostatic Union Christology of Council of Chalcedon *550 St. David converts Wales, crucifix introduced *553 Second Council of Constantinople, fifth ecumenical, called by Justinian *556–561 Pope Pelagius I, selected by Justinian, endorsed Judicatum *563 Columba goes to Scotland to evangelize Picts, establishes monastery at Iona *567 Cassiodorus *589 Third Council of Toledo, Reccared and the Visigoths convert from Arianism to Catholicism *590–604 Pope Gregory the Great, whom many consider the greatest pope ever, reforms church structure and administration and establishes Gregorian chant, seven deadly sins ... *591–628 Theodelinda, Queen of the Lombards, began gradual conversion from Arianism to Catholicism *596 St. Augustine of Canterbury sent by Pope Gregory to evangelise the Jutes *600? Evagrius Scholasticus, Church History of AD 431–594 *604 St Paul's Cathedral in London *607 Pope Boniface III, first Bishop of Rome to be called \"Pope\" and \"Universal Bishop\" by decree of Emperor Phocas *609 Pantheon, Rome renamed Church of Santa Maria Rotonda *612? Bobbio monastery in northern Italy *613 Abbey of St. Gall in Switzerland *614 Khosrau II of Persia conquered Damascus, Jerusalem, took Holy Cross of Christ *624 Battle of Badr, considered beginning of Islamic Empire *625 Paulinus of York comes to convert Northumbria *628 Babai the Great, pillar of Assyrian Church of the East, died *628–629 Battle of Mut'ah, Heraclius recovered Cross of Christ and Jerusalem from Islam till 638 *632 Eorpwald of East Anglia baptized under influence of Edwin of Northumbria *634–644 Umar, second Sunni Islam Caliph, capital at Damascus, conquered Syria in 635, defeated Heraclius at Battle of Yarmuk in 636, conquered Egypt and Armenia in 639, Persia in 642 *635 Cynegils of Wessex baptized by Bishop Birinus *640 Library of Alexandria, \"The Center of Western Culture,\" with 300,000 ancient papyrus scrolls, is completely destroyed. *664 Synod of Whitby unites Celtic Christianity of British Isles with Roman Catholicism *680–681 Third Council of Constantinople, 6th ecumenical, against Monothelites, condemned Pope Honorius I, Patriarch Sergius I of Constantinople, Heraclius' Ecthesis *681–686 Wilfrid converts Sussex *687–691 Dome of the Rock built *690? Old English Bible translations *692 Orthodox Quinisext Council, convoked by Justinian II, approved Canons of the Apostles of Apostolic Constitutions, Clerical celibacy, rejected by Pope Constantine *698 Fall of Carthage *711–718 Umayyad conquest of Hispania *717–718 Second Arab siege of Constantinople *718–1492 Reconquista, Iberian Peninsula retaken by Christendom *718 Saint Boniface, an Englishman, given commission by Pope Gregory II to evangelize the Germans *720? Disentis Abbey of Switzerland *730–787 First Iconoclasm, Byzantine Emperor Leo III bans Christian icons, Pope Gregory II excommunicates him *731 English Church History written by Bede *750? Tower added to St Peter's Basilica at the front of the atrium *752? Donation of Constantine, granted Western Roman Empire to the Pope, later proved a forgery *756 Donation of Pepin recognizes Papal States *781 Nestorian Stele, Daqin Pagoda, Jesus Sutras, Christianity in China *787 Second Council of Nicaea, seventh ecumenical, ends first Iconoclasm *793 Sacking of the monastery of Lindisfarne marks the beginning of Viking raids on Christendom. ==Middle Ages== *800 King Charlemagne of the Franks is crowned first Holy Roman Emperor of the West by Pope Leo III. *849–865 Ansgar, Archbishop of Bremen, \"Apostle of the North\", began evangelisation of North Germany, Denmark, Sweden *855 Antipope Anastasius, Louis II, Holy Roman Emperor appointed him over Pope Benedict III but popular pressure caused withdrawal *863 Saint Cyril and Saint Methodius sent by the Patriarch of Constantinople to evangelise the Slavic peoples. They translate the Bible into Slavonic. *869–870 Catholic Fourth Council of Constantinople, condemned Patriarch Photius, rejected by Orthodox *879–880 Orthodox Fourth Council of Constantinople, restored Photius, condemned Pope Nicholas I and Filioque, rejected by Catholics *897, January Cadaver Synod, Pope Stephen VI conducts trial against dead Pope Formosus. Public uprising against Stephen led to his imprisonment and strangulation. *909 Abbey of Cluny, Benedictine monastery in France *948? Einsiedeln Abbey of Switzerland *966 Mieszko I duke of Poland baptised. Poland becomes a Christian country. *984 Antipope Boniface VII, murdered Pope John XIV, alleged to have murdered Pope Benedict VI in 974 *988 Baptism of Kievan Rus' *997–998 Antipope John XVI, deposed by Pope Gregory V and his cousin Holy Roman Emperor Otto III *999 Much speculation and fear regarding the approach of the millennium *1012 Antipope Gregory VI, removed by Henry II, Holy Roman Emperor *1030 Battle of Stiklestad, considered victory of Christianity over Norwegian paganism *1045 Sigfrid of Sweden, Benedictine evangelist *1046 Council of Sutri, Pope Silvester III exiled, Pope Gregory VI admitted to buying the papacy and resigned, Pope Benedict IX resigned, council appointed Pope Clement II *1054 East-West Schism split between Eastern (Orthodox Christianity) and Western (Roman Catholic) churches formalized *1058–1059 Antipope Benedict X, defeated in war with Pope Nicholas II and Normans *1061–1064 Antipope Honorius II rival of Pope Alexander II *1065 Westminster Abbey consecrated *1073–1085 Pope Gregory VII, Investiture Controversy with Henry IV, Holy Roman Emperor, proponent of clerical celibacy, opponent of simony, concubinage, Antipope Clement III *1079 Stanislaus of Szczepanów, patron saint of Poland *1082 Engelberg Abbey of Switzerland *1093–1109 Anselm, Archbishop of Canterbury, wrote Cur Deus Homo (Why God Became Man), a landmark exploration of the Atonement *1095–1291 Ten Crusades, first called by Pope Urban II at Council of Clermont against Islamic empire to reconquer the Holy Land for Christendom *1098 Foundation of the reforming monastery of Citeaux. Leads to the growth of the Cistercian order. *1101 Antipope Theodoric and Antipope Adalbert deposed by Pope Paschal II *1118 Knights Templar founded, to defend Holy Land *1123 Catholic First Lateran Council *1128 Holyrood Abbey in Scotland *1130 Peter of Bruys, burned at the stake *1131 Tintern Abbey in Wales *1131–1138 Antipope Anacletus II *1139 Catholic Second Lateran Council *1140? Decretum Gratiani, Catholic Canon law *1142 Peter Abélard, Letters of Abelard and Heloise *1144 The Saint Denis Basilica of Abbot Suger is the first major building in the style of Gothic architecture. *1154–1159 Pope Adrian IV, first (and to date only) English pope *1155 Theotokos of Vladimir arrives to Bogolyubovo *1155 Carmelites founded *1163 Notre Dame de Paris, construction begun *1173 Waldensians founded *1179 Catholic Third Lateran Council *1191 Teutonic Knights founded *1204–1261 Latin Empire of Constantinople *1205 Saint Francis of Assisi becomes a hermit, founding the Franciscan order of friars, renounces wealth and begins his ministry; the Rosary is reportedly given to St. Dominic (who founded Dominican Order) by an apparition of Mary *1215 Catholic Fourth Lateran Council, decreed special dress for Jews and Muslims *1220–1263 St Alexander Nevsky, holy patron of Russia *1231 Charter of the University of Paris granted by Pope Gregory IX. *1245 Catholic First Council of Lyon *1252 May 15, Ad exstirpanda, Pope Innocent IV authorized use of torture in Inquisitions *1260 Date which a 1988 Vatican-sponsored scientific study places the origin of the Shroud of Turin *1274 Summa Theologiae, written by Thomas Aquinas, theologian and philosopher, landmark systematic theology which later became official Catholic doctrine *1274 Catholic Second Council of Lyon ==Renaissance== *1305–1378 Avignon Papacy, Popes live in Avignon, France *1311 Divine Comedy, by Dante Alighieri *1311–1312 Catholic Council of Vienne, disbanded Knights Templar *1314 Jacques de Molay, last Grandmaster of Knights Templar, burned at the stake *1326 Metropolitan Peter moves his see from Kiev to Moscow *1341–1351 Orthodox Fifth Council of Constantinople *1342 Marsilius of Padua *1345 Sergii Radonezhskii founds a hermitage in the woods, which would grow into the Troitse-Sergiyeva Lavra *1378–1418 Western Schism in Roman Catholicism *1380–1382 Wyclif's Bible, by John Wycliffe, eminent theologian at Oxford, NT in 1380, OT (with help of Nicholas of Hereford) in 1382, translations into Middle English, first complete translation to English, included deuterocanonical books, preached against abuses, expressed anti-catholic views of the sacraments (Penance and Eucharist), the use of relics, and Clerical celibacy *1408 Council of Oxford forbids translations of the Scriptures into the vernacular unless and until they are fully approved by Church authority *1409 Council of Pisa, declared Roman Pope Gregory XII and Avignon Pope Benedict XIII deposed, elected Pope Alexander V (called the Pisan Pope) *1414–1418 Catholic Council of Constance, asked Gregory XII, Benedict XIII, Pisan Pope John XXIII to resign their papal claims, then elected Pope Martin V; condemned John Wycliffe and Jan Hus who was burned at the stake *1423–1424 Council of Siena *1425 Catholic University of Leuven *1430? Andrei Rublev, the greatest of medieval icon-painters *1431 St. Joan of Arc, French national heroine, burned at the stake *1431–1445 Catholic Council of Basel-Ferrara-Florence *1439 Notre-Dame de Strasbourg, highest building in the world till 1874 *1453 Fall of Constantinople, overrun by Ottoman Empire *1455 Gutenberg Bible, first printed Bible, by Johann Gutenberg *1473–1481 Sistine Chapel built *1478 Spanish Inquisition established by Pope Sixtus IV *1484 December 5, Summis desiderantes against witchcraft issued by Pope Innocent VIII *1498 Girolamo Savonarola, Dominican priest, Bonfire of the Vanities *1506 Pope Julius II orders the Old St. Peter's Basilica torn down and authorizes Donato Bramante to plan a new structure. Demolition completed in 1606. Vatican Swiss Guard founded. *1508–1512 Michelangelo frescoes the Sistine Chapel's vaulted ceiling *1512–1517 Catholic Fifth Council of the Lateran, condemned Conciliarism ==Reformation== *1517 95 Theses of Martin Luther begins German Protestant Reformation *1521 Diet of Worms condemns Luther *1521 Ferdinand Magellan claims the Philippines for Spain. First mass and subsequent conversion to Catholicism, first in East Asia. *1522 Luther's NT, German NT translation *1525 Anabaptist movement begins *1526 Tyndale's NT, English NT translation from 1516 Greek text of Erasmus, first printed edition, used as a vehicle by Tyndale for bitter attacks on Catholicism, reflects influence of Luther's NT in rejecting priest for elder, church for congregation, banned in 1546 by Henry VIII *1530 Augsburg Confession, Luther founds the Lutheran Church *1531 Huldrych Zwingli, Protestant Reformation in Switzerland, independent of Luther *1531 Our Lady of Guadalupe in Mexico *1534 Henry VIII established independent Church of England, see also English Reformation *1534 Jesuit order founded by Ignatius of Loyola, helped reconvert large areas of Poland, Hungary, and S. Germany and sent missionaries to the New World, India, and China *1535–1537 Myles Coverdale's Bible, used Tyndale's NT along with Latin and German versions, included Apocrypha at the end of the OT (like Luther's Bible of 1534) as was done in later English versions. 1537 edition received royal license, but banned in 1546 by Henry VIII. *1535 Thomas More refused to accept King Henry VIII's claim to be the supreme head of the Church in England, and was executed. *1536 Desiderius Erasmus, Dutch scholar, Greek NT used in many 16th century translations *1536 Tyndale put to death, left his OT translation in manuscript. English ecclesiastical authorities ordered his Bible burned because it was thought to be part of Lutheran reform. *1536 Institutes of the Christian Religion written by John Calvin (Calvinism) *1536 John of Leiden, fanatic Dutch Anabaptist *1536 Jacob Hutter founder of Hutterites *1536 Helvetic Confessions of the Reformed Churches of Switzerland *1536–1540 Dissolution of the Monasteries in England, Wales and Ireland *1537 Christian III of Denmark decreed Lutheranism state religion of Norway and Denmark *1537–1551 Matthew Bible, by John Rogers, based on Tyndale and Coverdale, received royal license but not authorized for use in public worship, numerous editions, 1551 edition contained offensive notes (based on Tyndale) *1536–1541 Michelangelo paints the Last Judgement *1539–1569 Great Bible, by Thomas Cromwell, first English Bible to be authorized for public use in English churches, defective in many places, based on last Tyndale's NT of 1534–1535, corrected by a Latin version of the Hebrew OT, Latin Bible of Erasmus, and Complutensian Polyglot, last edition 1569, never denounced by England *1541 John Calvin returns to Geneva to establish a theocracy *1542 Roman Inquisition established by Pope Paul III *1543 Parliament of England bans Tyndale's translation as a \"crafty, false and untrue translation\" *1545–1563 Catholic Council of Trent, counter-reformation against Protestantism, clearly defined an official theology and biblical canon *1549 original Book of Common Prayer of the Church of England by Thomas Cranmer *1551 The Stoglav Church Council (One Hundred Chapters) Moscow, Russia *1552 Francis Xavier, Jesuit missionary, \"Apostle of the Indies\" *1553 Pontifical Gregorian University founded at Vatican City *1553 Michael Servetus founder of Unitarianism, burned at the stake in Geneva under Calvin *1553–1558 Queen Mary I of England, Bloody Mary, persecuted reformers: John Rogers, Hugh Latimer, Nicholas Ridley, Thomas Cranmer; of 238 burned at the stake *1559 Military Order of the Golden Spur founded by Pope Paul IV *1560 Geneva Bible, NT a revision of Matthew's version of Tyndale with use of Theodore Beza's NT (1556), OT a thorough revision of Great Bible, appointed to be read in Scotland (but not England), at least 140 editions, first Bible with chapter and verse numbers *1560 Scots Confession, Church of Scotland, Scottish Reformation *1560–1598 French Wars of Religion *1560–1812 Goa Inquisition, persecution of Hindus and Jews in India *1561 Menno Simons founder of Mennonites *1563 Thirty-Nine Articles of Church of England, also decreed biblical canon *1563 Heidelberg Catechism of Reformed churches *1566 Roman Catechism *1569 Metropolitan Philip of Moscow strangled by Malyuta Skuratov *1571 Dutch Reformed Church *1572 John Knox, founded Scotch Presbyterian Church, due to disagreement with Lutherans over sacraments and church government *1572–1606 Bishops' Bible, a revision of the Great Bible checked against the Hebrew text, first to be published in England by episcopal authority *1579 Discovery of the holiest Russian icon, Our Lady of Kazan *1580 Book of Concord of Lutheranism *1582 St Terese of Avila *1582 Gregorian calendar adopted at different times in different regions of the world *1587 Toyotomi Hideyoshi expelled Jesuits from Kyūshū *1587? Mission Nombre de Dios in St. Augustine, Florida, considered first mission to North America *1589 Metropolitan Jove is elected the first Patriarch of Moscow *1590 Michelangelo's dome in St Peter's Basilica completed *1592 Clementine Vulgate of Pope Clement VIII, replaced Sistine Vulgate of 1590, standard Latin Catholic Bible till reforms of the Second Vatican Council *1596 Ukrainian Catholic Church forms when Ukrainian subjects of the king of Poland are reunited with Rome, largest Byzantine Catholic Church ==17th century== *1600 Giordano Bruno, Dominican priest, burned at the stake *1604 Fausto Paolo Sozzini Socinianism *1606 Carlo Maderno redesigns St Peter's Basilica into a Latin cross *1609 Baptist Church founded by John Smyth, due to objections to infant baptism and demands for church-state separation *1609–1610 Douay-Rheims Bible, first Catholic English translation. OT published in two volumes, based on an unofficial Louvain text corrected by Sistine Vulgate. NT is Rheims text of 1582. *1611–1800 King James Version (Authorised Version) is released, based primarily on Wycliffe's work and Bishop's Bible of 1572. Translators are accused of being \"damnable corrupters of God's word\". Original included Apocrypha. *1614 Fama Fraternitatis, Rosicrucian manifesto *1618–1648 Thirty Years' War *1620 Plymouth Colony founded *1621 Robert Bellarmine *1622–1642 Armand Jean du Plessis, Cardinal Richelieu *1630 City upon a Hill, sermon by John Winthrop *1636 Founding of what was later known as Harvard University as a training school for ministers – the first of thousands of institutions of Christian higher education founded in the USA *1636–1638 Cornelius Jansen, bishop of Ypres, founder of Jansenism *1637–1638 Shimabara Rebellion *1638 Anne Hutchinson banished as a heretic from Massachusetts *1641 John Cotton, advocate of theonomy, helps to establish the social constitution of the Massachusetts Bay Colony. *1643 Acta Sanctorum *1644 Long Parliament directed that only Hebrew canon be read in the Church of England (effectively removed the Apocrypha) *1646 Westminster Standards produced by the Assembly, one of the first and undoubtedly the most important and lasting religious document drafted after the reconvention of the Parliament, also decreed biblical canon *1648 George Fox founds the Quaker movement *1650 James Ussher, calculates date of creation as October 23, 4004 BC *1653–56 Raskol of the Russian Orthodox Church *1660–1685 King Charles II of England, restoration of monarchy, continuing through James II, reversed decision of Long Parliament of 1644, reinstating the Apocrypha, reversal not heeded by non-conformists *1672 Greek Orthodox Synod of Jerusalem, decreed biblical canon *1675 Philipp Jakob Spener publishes Pia Desideria, which becomes a manifesto for Pietism *1678 John Bunyan publishes Pilgrim's Progress *1682 Avvakum, leader of the Old Believers, burned at the stake in the Far North of Russia *1684 Roger Williams (theologian), advocate of separation of church and state, founder of Providence, Rhode Island *1685 Edict of Fontainebleau outlaws Protestantism in France *1685 Orthodoxy introduced to Beijing by Russian Orthodox Church *1692 Salem witch trials in Colonial America *1692–1721 Chinese Rites controversy *1693 Jacob Amman founder of Amish ==18th century== *1701 Old Catholic Church of the Netherlands splits with Roman Catholicism *1721 Peter the Great substituted Moscow Patriarchate with the Holy Synod *1728 The Vicar of Bray (song) *1730–1749 First Great Awakening in U.S. *1735 Welsh Methodist revival *1738 Methodist movement, led by John Wesley and his hymn-writing brother Charles, begins *1741 Sinners in the Hands of an Angry God, famous fire and brimstone sermon *1754 An Historical Account of Two Notable Corruptions of Scripture, by Isaac Newton, published *1767–1815 Suppression of the Jesuits *1768 New Smyrna, Florida, Greek Orthodox colony founded *1768 Reimarus dies without publishing his radical critic work distinguishing Historical Jesus versus Christ of Faith *1769 Mission San Diego de Alcala, first California mission *1772 Emanuel Swedenborg, founded Swedenborgianism *1774 Ann Lee leader of American Shakers *1774 Gotthold Ephraim Lessing starts publishing Reimarus works on historical Jesus as Anonymous Fragments, starting Liberal Theology Era (in Christology) *1776–1788 Gibbon's The History of the Decline and Fall of the Roman Empire, critical of Christianity *1776 Mission Delores, San Francisco *1779 Virginia Statute for Religious Freedom, \"Jesus never coerced anyone to follow him, and the imposition of a religion by government officials is impious\" *1780 Robert Raikes begins Sunday schools to reach poor and uneducated children in England *1784 American Methodists form Methodist Episcopal Church at so-called \"Christmas Conference\", led by bishops Thomas Coke and Francis Asbury *1789–1815 John Carroll, Roman Catholic Archdiocese of Baltimore, first Roman Catholic US bishop *1789–1801 Dechristianisation of France during the French Revolution *1791 First Amendment to the United States Constitution *1793 Herman of Alaska brings Orthodoxy to Alaska *1795 The Age of Reason written by Thomas Paine, advocated Deism *1796 Treaty with Tripoli (1796), article 11: \"the Government of the United States of America is not, in any sense, founded on the Christian religion\" ==19th century== *1800 Friedrich Schleiermacher publishes his first book, beginning Liberal Christianity movement *1811 The Campbells begin Restoration Movement *1815 Peter the Aleut, orthodox Christian, tortured and martyred in Catholic San Francisco, California *1816 Bishop Richard Allen, a former slave, founds the African Methodist Episcopal Church, the first African-American denomination *1819 Thomas Jefferson produced the Jefferson Bible *1824 English translation of Wilhelm Gesenius' ...Handwörterbuch...: Hebrew-English Lexicon, Hendrickson Publishers *1828 Plymouth Brethren founded, Dispensationalism *1830 Charles Finney's revivals lead to Second Great Awakening in America *1830, April 6 Church of Jesus Christ of Latter Day Saints (Mormonism) founded by Joseph Smith, Jr. as a result of reported visitations and commandment by God the Father, Jesus Christ, and later the Angel Moroni. Book of Mormon also published in 1830. *1832 Church of Christ (Disciples) organized, made up of Presbyterians in distress over Protestant factionalism and decline of fervor *1833 John Keble's sermon \"National Apostasy\" initiates the Oxford Movement in England *1838–1839 Saxon Lutherans objecting to the Prussian Union emigrate from Germany to the United States; settle in Perry County, Missouri. Leads to formation of the LC-MS *1843 schism within the established Church of Scotland *1844, October 22 Great Disappointment, false prediction of Second Coming of Christ by Millerites *1845 Southern Baptist Convention formed in Augusta, Georgia *1848 Epistle to the Easterns and Encyclical of the Eastern Patriarchs response *1848 Perfectionist movement in western New York state *1854 Missionary Hudson Taylor arrives in China *1854 Immaculate Conception, defined as Catholic dogma *1855 Søren Kierkegaard, founder of Christian existentialism *1863 Seventh-day Adventist Church officially formed twenty 20 years after the Great Disappointment *1865 Methodist preacher William Booth founds the Salvation Army, vowing to bring the gospel into the streets to the most desperate and needy *1869–1870 Catholic First Vatican Council, asserted doctrine of Papal Infallibility, rejected by Christian Catholic Church of Switzerland *1870 Italy declared war on the Papal States. The Italian Army enters Rome. Papal States ceased to exist. *1871–1878 German Kulturkampf against Roman Catholicism *1879 Church of Christ, Scientist founded in Boston by Mary Baker Eddy *1881–1894 Revised Version, called for by Church of England, used Greek based on Septuagint (B) and (S), Hebrew Masoretic Text used in OT, follows Greek order of words, greater accuracy than AV, includes Apocrypha, scholarship never disputed *1884 Charles Taze Russell founded Bible Student movement known today as Jehovah's Witnesses *1885 Baltimore Catechism *1886 Moody Bible Institute *1894 The Kingdom of God is Within You, by Leo Tolstoy, start of Christian anarchism *1897 Christian flag, conceived in Brooklyn, New York *1899 Gideons International founded ==20th century== *1905 French law on the separation of Church and State *1906 Albert Schweitzer publishes The Quest of the Historical Jesus (English translation 1910) *1906 Biblia Hebraica *1906–1909 Azusa Street Revival in Los Angeles, California, begins modern Pentecostal movement *1907–1912 Nicholas of Japan, Archbishop of Japanese Orthodox Church *1909 Scofield Reference Bible *1909–1911 The Rosicrucian Fellowship, an international association of Christian mystics, founded at Mount Ecclesia *1910 Edinburgh Missionary Conference launches modern missions movement and modern ecumenical movement; five-point statement of the Presbyterian General Assembly, also used by Fundamentalists *1910–1915 The Fundamentals, a 12-volume collection of essays by 64 British and American scholars and preachers, a foundation of Fundamentalism *1913 Our Lady of Fatima appears to three young people, in Portugal. They were Jacinta Marto, Tiago Veloso and Lúcia (Sister Lucia). *1913 Catholic Encyclopedia *1914 Welsh Church Act 1914 *1914 Iglesia ni Cristo incorporated in the Philippines *1915–1917 Armenian Genocide *1916 Father Divine founded International Peace Mission movement *1916 And did those feet in ancient time *1917 Restitution of the Moscow Patriarchy with Tikhon as patriarch *1917 True Jesus Church founded in Beijing *1918 Execution of Holy Martyrs of Russia, including the last tsar, Nicholas II, and his wife, Alexandra Feodorovna *1919 Karl Barth's Commentary on Romans is published, critiquing Liberal Christianity and beginning the neo- orthodox movement *1921 Oxford Group founded at Oxford *1923 Aimee Semple McPherson built Angelus Temple *1925 Scopes Trial, caused division among Fundamentalists *1925 United Church of Canada formed *1926 Father Charles Coughlin's first radio broadcast *1927 Pope Pius XI decrees Comma Johanneum open to dispute *1929 Lateran Treaty signed containing three agreements between kingdom of Italy and the papacy. *1930 Rastafari movement founded *1931 Majority of Bible Students adopt name Jehovah's Witnesses, see 1884 for more information. *1931 Christ the Redeemer (statue) in Rio de Janeiro, Brazil *1933 Catholic Worker Movement founded *1934 Herbert W. Armstrong founded Radio Church of God *1935 Dr. Frank C. Laubach, known as \"The Apostle to the Illiterates\", working in the Philippines, developed a literacy program that continues to teach millions of people to read. *1935 Rahlf's critical edition of the Koine Greek Septuagint *1935 Billy Sunday, early U.S. radio evangelist *1939 Southern and Northern US branches of the Methodist Episcopal Church, along with the Methodist Protestant Church reunite to form the Methodist Church. Slavery had divided the church in the 1800s. *1940 Monumento Nacional de Santa Cruz del Valle de los Caidos, world's largest cross, 152.4 meters high *1942 National Association of Evangelicals founded *1945 Roman Catholic sex abuse cases begin *1945 Dietrich Bonhoeffer is executed by the Nazis *1945 Ludwig Müller *1945 The Nag Hammadi library is discovered. *1946–1952 Revised Standard Version, revision of AV \"based on consonantal Hebrew text\" for OT and best available texts for NT, done in response to changes in English usage *1947 Uneasy Conscience of Modern Fundamentalism by Carl F. H. Henry, a landmark of Evangelicalism versus Fundamentalism in US *1947 Oral Roberts founded Evangelistic Association *1947 Dead Sea scrolls discovered *1948 World Council of Churches is founded *1948 Declaration of the Establishment of the State of Israel, see also Christian Zionism *1949 Evangelist Billy Graham preaches his first Los Angeles crusade *1950 New World Translation of the Christian Greek Scriptures released *1950 Assumption of Mary decreed by Pope Pius XII *1950 Missionaries of Charity founded by Mother Teresa *1951 The Last Temptation, a fictional account of the life of Jesus, written by Nikos Kazantzakis, wherein Christ's divinity is juxtaposed with his humanity, is published, and promptly banned in many countries. *1951 Campus Crusade for Christ founded at UCLA *1952 Novum Testamentum Graece, critical edition of Greek NT, basis of modern translations *1952 C. S. Lewis' Mere Christianity *1954 Unification Church founded *1954 U.S. Pledge of Allegiance modified by act of Congress from \"one nation, indivisible\" to \"one nation under God, indivisible\" *1956 In God We Trust designated U.S. national motto *1956 Anchor Bible Series *1957 United Church of Christ founded by ecumenical union of Congregationalists and Evangelical and Reformed, representing Calvinists and Lutherans *1957 English translation of Walter Bauer's Wörterbuch ...: A Greek- English Lexicon of the New Testament and Other Early Christian Literature, University of Chicago Press *1958 Sedevacantism *1961 New World Translation of the Holy Scriptures released *1962–1965 Catholic Second Vatican Council, announced by Pope John XXIII in 1959, produced 16 documents which became official Roman Catholic teaching after approval by the Pope, purpose to renew \"ourselves and the flocks committed to us\" *1963 Martin Luther King leads a civil rights march in Washington, D.C. *1963 campaign by Madalyn Murray O'Hair results in U.S. Supreme Court ruling prohibiting reading of Bible in public schools *1965 Reginald H. Fuller's The Foundations of New Testament Christology Rousas John Rushdoony founds Chalcedon Foundation *1966 Raymond E. Brown's Commentary on the Gospel of John *1968 United Methodist Church formed with union of Methodist Church and Evangelical United Brethren Church, becoming the largest Methodist/Wesleyan church in the world *1970s The Jesus movement takes hold in the U.S. One-way.org *1970 Mass of Paul VI replaces Tridentine Mass *1971 New American Standard Bible *1973 Trinity Broadcasting Network founded *1974 Jim Bakker founds PTL television ministry *1975 Bruce Metzger's Textual Commentary on the Greek New Testament *1977 Focus on the Family founded by James Dobson *1978 New International Version of the Bible is first published (revised in 1984), using a variety of Greek texts, Masoretic Hebrew texts, and current English style *1978–2005 Pope John Paul II, reaffirmed moral traditions (The Splendor of Truth) *1979 Moral Majority founded by Jerry Falwell *1979 Jesus, most watched movie of all time according to New York Times *1979–1982? New King James Version, complete revision of 1611 AV, updates archaisms while retaining style *1985 Jesus Seminar founded *1985 E. P. Sanders' Jesus and Judaism *1988 Christian Coalition *1988 The Last Temptation of Christ, directed by Martin Scorsese, is released by Universal Pictures, and promptly attacked as heretical by organized Christian and Catholic groups. *1989 New Revised Standard Version *1991 John P. Meier's series A Marginal Jew: Rethinking the Historical Jesus, v. 1 *1992 Catechism of the Catholic Church *1994 \"Evangelicals & Catholics Together\" *1994 Porvoo Communion *1994 Answers In Genesis founded by Ken Ham *1997, Mar 5–10 World Council of Churches: Towards a Common Date for Easter , see also Reform of the date of Easter *1998, April 6 PBS Frontline: From Jesus to Christ *1999 International House of Prayer in Kansas City begins non-stop 24/7 continual prayer *1999, Oct 31 signing of the Joint Declaration on the Doctrine of Justification between the Lutheran World Federation and the Catholic Church ==21st century== *2001 The Way of the Master founded *2004 Mel Gibson's film The Passion of the Christ is released *2005 Death of Pope John Paul II, election of Pope Benedict XVI *2006, July 18 World Methodist Council voted unanimously to adopt the Joint Declaration on the Doctrine of Justification *2012 Woman bishops rejected by the Church of England *2013 Pope Benedict XVI abdicates, replaced by Pope Francis. ==Sources== *World Almanac and Book of Facts *Academic American Encyclopedia *Webster's New Collegiate Dictionary *English Versions of the Bible by John Berchmans Dockery O.F.M. *David Pentrack's \"Et Cum Spiritu Tuo\" website *Catholic Encyclopedia: Biblical Chronology ==Footnotes== == Other websites == *OrthodoxWiki: Timeline of Church History (from the Orthodox POV) *St. Ignatius Church: Timeline (from the Orthodox POV) *Catholic Encyclopedia: Jerusalem (Before AD 71) Category:History of Christianity Category:Timelines",
 "title": "Timeline of Christianity"
}