{
 "id": "544792",
 "text": "EXO is a boy group of South Korea formed by S.M. Entertainment in 2011. At the beginning of 2012 it was formed completely. It was previously composed of twelve members, separated into two sub-groups, EXO-K and EXO-M. Each subgroup sings songs in either Korean or Mandarin. EXO gained popularity with the release of their first studio album, entitled XOXO (2013), which resulted in successes \"Wolf\" and \"Growl\". They were awarded a 'Disk Daesang' at 28th Golden Disk Awards and 'Album of the Year' in 15th Mnet Asian Music Awards. The album sold more than one million copies. EXO is the South Korean artist with more sales than any other within a period of twelve years. Their third mini-album called Overdose (2014), positioned at the top of the Billboard 200. EXO was later named as the most influential celebrity of Korea throughout 2014 by Forbes Korea. In 2015, their second studio album, EXODUS gave them the highest position on Billboard 200 albums lists, as well as a K-pop album with the highest sales in the first week. The first single \"Call Me Baby\" was the first song of K-pop in the Canadian Hot 100. EXODUS sold more than 1 million copies, EXO also earned the nickname of \"double million seller\". Their fourth mini-album, Sing for You (2015), earned a record in its first week selling more than 267,900 copies. EXO was said to be the celebrity most influential in 2015 by Forbes Korea. In May 2014, Kris filed a lawsuit against S.M. Entertainment to terminate his contract with the agency. Luhan did the same in November 2014. In April 2015, Tao followed the same steps as Kris and Luhan in August 2015. Following the departure of three members, EXO now has nine members. == History == === 2011: Formation === In May 2011, in a Hallyu business seminar, which was held at Stanford University, Lee Soo-man talked about strategies to \"create a new boyband where they will be divided in two subgroups and the promotion of the same song simultaneously in South Korea and China, that is, with one interpretation of the language Korean or Mandarin.\" After several changes, in December 2011 the group decided to be identified as EXO taken from Exoplanet. They are divided into two sub-groups, EXO-K ('K' of Korean) to Korea in the South and EXO-M ('M' for Mandarin) to China. Their first appearance on television was on December 29, 2011 during the SBS's Gayo Daejun. === 2012: Debut with MAMA === The single prologue of EXO-K and EXO-M, \"What Is Love\" was released on January 30, 2012 in South Korea and mainland China. The single was positioned at number 88 on the Korean Gaon Single Chart. On March 9, they released the second single entitled \"History\", which was written and produced by Thomas Troelsen and Remee. The single made number 78 in Gaon Single Chart and number 6 on China's Sina Music Chart. A concert by the group took place at the Olympic Stadium in Seoul on March 31. Approximately 3,000 fans of 8,000 were selected to attend. A second concert was held in the great Hall of Beijing University of Economics and business, April 1. Both subunits released the third single entitled \"Mama\" on April 8 followed by an EP of the same name the next day. The two subunits promoted the album separately in two countries. On April 8, one day before the release of the EP, EXO-K had their debut performance on the musical program of South Korea Inkigayo, while EXO-M made its debut in China Awards 12th Yinyue Fengyun Bang Awards the same day. The Mandarin version of \"Mama\" headlined at the number 2 in the Chinese chart Sina.com, while the Korean version was number 1 of Gaon Albums Chart and number 8 on the Billboard World Albums Chart. The Mandarin version of the music video \"Mama\" reached number 1 on the websites of Chinese transmission, while the Korean version was ranked number 7 on YouTube's Global Chart. At the end of April, EXO-M appeared as guests in the concert of Super Junior Super Show 4 in Jakarta, Indonesia. In November 2012, EXO won an award as Best New Group of Asian Artists in 2012 Mnet Asian Music Awards. EXO-K three nominations in 27th Golden Disk Awards gaining in the newcomer category. EXO-M awarded the Most Popular Group in 2013 Top Chinese Music Awards. === 2013: XOXO, commercial success and Miracles in December === The group released their first studio album entitled XOXO in June 2013 with two versions, Korean edition \"Kiss\" and the \"Hug\" mandarin. EXO-K and EXO-M did their promotions jointly; mainly in South Korea. EXO recorded the single main \"Wolf\" but the rest of the songs they recorded separately. The two versions collectively ranked number 1 in Billboard World Albums Chart a week after release. The repackage album entitled Growl, was released on August 5, 2013, with three additional new tracks. The single reissue, \"Growl\", was released on August 1, 2013. \"Growl\" achieved 10.554 points in Inkigayo. \"Growl\" headlined at number 1 in the four most important music programs in Korea, winning a total of ten trophies in three consecutive weeks. The single was number 3 in Korea K-Pop Hot 100 of Billboard and number 2 in Gaon Chart. In December 2013, two versions of XOXO, sold 1,000,000 copies, marking to EXO as the first Korean artist to sell a million copies in twelve years and broke the record for fastest selling K-pop act. XOXO was named the Album of the Year in 2013 at Mnet Asian Music Awards, making EXO as the youngest boyband in the prize.They won the 'Disk Daesang' award at several award ceremonies such as the Golden Disk Awards and Seoul Music Awards. The second EP of the band entitled Miracles in December was officially released on December 9, 2013 as a special album of winter through commercial outlets in South Korea and online music stores. Baekhyun, Chen and D.O. sing the single main of the album \"Miracles in December\", in M! Countdown, December 5. Luhan also joined the trio on stage for the promotions of the first single on other music programs. EXO ended 2013 with six albums in the Top 10 best-selling albums of Gaon, including all their releases of records, both in the Korean version in mandarin, as well as their first EP Mama. === 2014: Overdose, lawsuit of Kris and Luhan and first tour === The third EP of the group Overdose, was released on May 7, 2014. It was originally scheduled to be released on April 21, but was delayed by the wreck of the Sewol on April 16. Overdose was promoted in the same way as Mama, with EXO-K promoting EXO-M in China and South Korea. The album reached 660,000+ pre-orders before its release, so it is the most pre- ordered EP in history. The Korean edition was also positioned at number 2 in Billboard's World Albums Chart and number 129 on the Billboard 200, making the male group of Korea with the highest Billboard 200 graphics to EXO. Overdose became the best-selling album in South Korea in 2014 and the first mini-album in finishing the annual graphics and winning the Album of the Year at Mnet Asian Music Awards. At the end of the year, EXO was the top-selling K-pop artist in Japan. On May 15, 2015, S.M. Entertainment confirmed that Kris,the leader signed a lawsuit against the agency, indicating violation of human rights as the main reason. On October 10 Luhan also signed a lawsuit against S.M. Entertainment, due to health problems and being treated differently than the Korean members. S.M. Entertainment announced that the group will continue promoting with ten members. The group held their first tour EXO From. EXOPLANET #1 - THE LOST PLANET, beginning on may 24 in the Olympic Stadium of Seoul. Tickets of the concert sold out in 1.47 seconds. === 2015: EXODUS, Tao's lawsuit, Japanese debut, collaboration with Star Wars and Sing for You === The second tour of EXO was announced in January 2015, titled The EXO'luXion. Five concerts were held in Seoul in the Olympic Stadium, from March 7. One million fans had tried to buy tickets online. On February 4, 2015, S.M. Entertainment, signed a lawsuit against Kris and Luhan for illegally continuing their promotions in China. The demand was to stop their actions and the advertisement using the trademark S.M. The second album by EXO, Exodus, was released March 30 in Mandarin and Korean versions. Domestic sales for the album exceeded 500,000 within 24 hours, setting a new sales record. The main single, \"Call Me Baby\", was released on March 27 due to leaked versions of the song. The music video was released four days later, the Korean version received more than 4,000,000 views and the Mandarin version 2,000,000 views in just 24 hours. EXO starred in the mini-drama entitled EXO Next Door with Moon Ga-young actress. \"Call Me Baby\", proved to be successful winning eighteen times in musical programs of South Korea, making it the second most awarded song ever. EXODUS (Korean version) also broke records after remaining number one in Gaon Album Chart for four consecutive weeks. The album eventually came to sell more than one million copies, and is the second album of the group after XOXO to do so. EXODUS was named as 'Album of the year' in the 2015 Mnet Asian Music Awards, making this the third consecutive victory for the group from 2013. On April 22, the father of Tao issued a letter through Weibo expressing his feelings for his son to leave the group and return to China; due to the lack of support with regard to the developments of jis individual career and health problems. Tao had suffered previously several injuries, including a tendon torn in ankle, that had not properly been treated, and had to leave promotions for the second album by the group EXODUS. On April 23, S.M. Entertainment released an official statement saying that they were going to be looking for negotiation with Tao and his father.> Tao later confirmed that had left S.M. Entertainment. On June 3, the version repackage of EXODUS, entitled Love Me Right, was released. The album contains the songs original of EXODUS and four new songs, including the single main \"Love Me Right\". The Japanese official debut was planned in the Tokyo Dome during three days consecutively. On November 4, EXO released the first single in Japanese \"Love I Right ~romantic universe~\", which contains the Japanese version of their Korean single \"Love Me Right\" as well as the Japanese song \"Drop That\". On the day of its launch, EXO sold a total of 147,000 copies, reaching the top of the Oricon charts. It was announced that EXO will be collaborating with Star Wars: The Force Awakens as part of the collaboration between S.M. Entertainment and Walt Disney. On November 9, the single \"Lightsaber\" was released to promote the film before its release in Korea. On December 10, EXO released the second album special winter Sing for You along with two singles, \"Sing for You\" and \"Unfair\". === 2016: Tour in North America, EX'ACT, Kris & Luhan contract settlement, Coming Over and For Life === In February 2016, EXO led the tour EXO'luXion to North America, presenting in Dallas, Vancouver, Los Angeles, Chicago and New York. EXO was ranked as the most powerful celebrity by Forbes Korea in the year 2015. In June 2016, S.M. Entertainment announced that EXO released their third studio album, EX'ACT and two singles \"Lucky One\" and \"Monster\" at the same time. On June 3, the group released the teaser of \"Lucky One\" which in twelve hours got over a million views. The album's national pre-sales exceed 660,000 copies, making it the most pre-sold K-pop album of all time. The album later broke the record for the highest sales during the first week, breaking its previous record set by Sing for You, selling 522,372 copies in a week. The album also went on to top the list of United World Albums Chart. The second single from EX'ACT, \"Monster\", became the first EXO number one on Billboard World Digital Songs Chart songs and spent two weeks at number one. The album's first single, \"Lucky One\" debuted at number three on the Billboard World Digital Songs Chart and remained in first place for two weeks. The song was also on the top of iTunes in seven countries. In June, as part of the EX'ACT promotions, EXO and Korea's fashion magazine W Korea collaborated on EXOclusive to publish fifty- four pages, ninth edition of the cover of magazine. EXOclusive finished recording the highest number of sales as a fashion magazine in Korea after selling almost a million copies. On July 15, S.M. Entertainment and Putto Entertainment launched an official mobile game of EXO, EXORUN. On July 21, Kris and Luhan officially separated from EXO. On July 22, EXO began its third tour, EXO FROM. EXOPLANET # 3 - The EXO'rDIUM. In preparation for the tour, S.M. Entertainment announced the launch of EXO's second official lightstick. The new lightsitck features a white wand with the official EXO logo on the top that shows a multicolored changing light. After holding concerts from July 22 until July 31 with over 84,000 attendees, EXO set a record as the first artist to hold six consecutive concerts at the Olympic Gymnastics Arena. On August 18, they published the repackaged version of EX'ACT titled LOTTO. The album contains the nine songs of EX'ACT with four new songs, \"Lotto (Louder)\", \"She's Dreaming\", \"Can not Bring Me Down\" and \"Monster (LDN Noise Creeper Bass Remix)\". On September 7, EXO announced through a video that they would be releasing their second Japanese single titled \"Coming Over\" and a Japanese album containing three original Japanese songs in December. On October 7, the full song was made available in Japan through the AWA application, a popular Japanese streaming service, and was played over 100,000 times in 12 hours before the promotional event ended. On September 17, EXO released their song \"Dancing King\" with Yoo Jae-suk along with a music video for SM Station. The song was ranked number two on Gaon Digital Chart and number one on Gaon Download Chart. \"Dancing King\" also ranked number three on Billboard's World Digital Songs Chart. On December 7, EXO released their second Japanese single \"Coming Over\", it contains three original singles. On December 19, 2016, For Life was released, the group's fifth EP and third Christmas album. === 2017─present: The War, The War: The Power of Music & Universe === In April 2017, Samsung and EXO collaborated on a special project for the Samsung Galaxy S8. On May 25, during a press conference at the Olympic Stadium of Jamsil in Seoul, the group announced their comeback in summer. Baekhyun commented that the single from the new album was ready. On June 23, S.M. Entertainment announced that Lay would not participate in the comeback of the group due to his activities in China. EXO's fourth studio album, The War, was digitally released on July 18 and physically on July 19. The album contains nine songs including the lead single \"Ko Ko Bop\". On September 21, S.M. Entertainment announced that EXO would return with the reissue of The War in early September. The title of the reissue was revealed as The War: The Power of Music and was released on September 5, 2017 with twelve songs including the new single \"Power\". On October 19, they announced their fourth tour titled EXO Planet#4 - The EℓyXiOn, which would begin with three concerts in Seoul from November 24 to 26, 2017. It was announced on November 4, 2017 through the Japanese EXO website, that the group would release their first Japanese album entitled Countdown on January 24, 2018. On December 5, 2017, EXO released the short music video for Electric Kiss on YouTube, the title track for Countdown. On December 14, 2017, SM Entertainment confirmed that EXO will be releasing a winter album titled Universe on December 21, 2017. == Members == === Current members === * Xiumin (), born as Kim Min-seok () in Guri, Gyeonggi Province, South Korea on March 26, 1990. * Suho (), born as Kim Jun-myeon () in Seoul, South Korea on May 22, 1991. Is the leader of EXO. * Lay (), born as Zhang Jiashuai (traditional Chinese: 張加帥; simplified Chinese: 张加帅) in Changsha, Hunan, China at October 7, 1991. Lay changed his birth name to Zhang Yixing (traditional Chinese: 張藝興; simplified Chinese: 张艺兴) and is also known by his Korean name Jang Ye-heung (hangul: 장예흥). * Baekhyun (), born as Byun Baek-hyun () in Bucheon, Gyeonggi Province, South Korea on May 6, 1992. * Chen (), born as Kim Jong-dae in Siheung, Gyeonggi Province, South Korea on September 21, 1992. * Chanyeol (), born as Park Chan-yeol () in Seoul, South Korea on November 27, 1992. * D.O. (), born as Do Kyung-soo () in Goyang, Gyeonggi Province, South Korea on January 12, 1993. * Kai (), born as Kim Jong-in () in Suncheon, South Jeolla, South Korea on January 14, 1994. Is the face of EXO. * Sehun (), born as Oh Se-hun () in Seoul, South Korea on April 12, 1994. Is the visual of EXO. === Past members === * Luhan (), born as Lu Han (Chinese: 鹿晗) in Haidian, Pekin, China on April 20, 1990. He was the visual and face of EXO-M. * Kris (), born as Li Jiaheng (Chinese: 李嘉恒) in Guangzhou, China on November 6, 1990. He was the leader of EXO-M. Kris changed his birth name to Wu Yifan (traditional Chinese: 吳亦凡; simplified Chinese: 吴亦凡). * Tao (), born as Huang Zitao (Chinese: 黄子韬) in Qingdao, Shandong, China on May 2, 1993. === Timeline === == Discography == === Korean discography === ;Studio albums * 2013: XOXO * 2015: EXODUS * 2016: EX'ACT * 2017: The War * 2018: Don't Mess Up My Tempo * 2019: Obsession * 2023: Exist ;Repackage albums * 2013: Growl * 2015: Love Me Right * 2016: Lotto * 2017: The War: The Power of Music * 2018: Love Shot === Japanese discography === ;Studio album * 2018: COUNTDOWN == Filmography == === Television series === * 2013: EXO's Showtime * 2014: XOXO EXO * 2014: EXO 90:2014 * 2015: SurpLINEs EXO (Line TV) (Xiumin, Chanyeol, Tao, Kai and Sehun) * 2015: EXO Channel === Drama === * 2015: EXO Next Door == Awards and nominations == == References == ==Other websites== * Exo official website Category:2011 establishments in South Korea Category:K-pop music groups Category:Musical groups established in 2011 Category:South Korean boy bands Category:South Korean R&B; bands",
 "title": "Exo"
}