{
 "id": "54475",
 "text": "The word schism ('sɪzəm or ), from the Greek σχίσμα, skhísma (from σχίζω, skhízō, \"to tear, to split\"), means a division or a split, usually in an organization or a movement. A schismatic is a person who creates schism in an organization or who is a member of a splinter group. Schismatic as an adjective means belonging to a schism or schisms, or to those ideas, policies, etc. that are thought to lead towards schism. ==Use within Christianity== The words schism and schismatic have found perhaps their heaviest usage in the history of Christianity, to speak of splits within a church. Within Christianity the word schism may refer to: *The offense of creating divisions among Christians. *The event of two groups of Christians ceasing to be in full communion with each other, so that, they decide they must worship separately because of disagreements between them. *Any Christian communion or sect that has left the One Holy Catholic and Apostolic Church. Which church constitutes the One Holy Catholic and Apostolic Church has long been disputed: for instance, the Roman Catholic Church claims that title and thinks the Eastern Orthodox Communion to be in schism. The Eastern Orthodox Communion also claims that title and holds that the Catholic Communion is schismatic. The Protestant movement thinks that both are in error, so does the Restorationist movement. Though it is very important to note the difference between schism and heresy. Heresy is to reject or doubt the beliefs of the Church after having been baptised.Catechism of the Catholic Church (English translation, 2nd ed.) paragraph 2089. Schism means that the opposing parties have a disagreement within the establishment. Both groups have to accept that they are in schism. In the canon law of the Catholic Church, an act of schism, apostasy or heresy brings the penalty of excommunication.Code of Canon Law, canon 1364 ==Use within Islam== There are divisions between Sunni, Shia, and Kharijite Islam in CE 632 regarding the rightful successor to the prophet Muhammad. In 661 and 680 there were divisions regarding the rightful claimant to the Caliphate. ==Use within Buddhism== In Buddhism, the first schism was set up by Devadatta, during Buddha's life. After Buddha's passing away, the early Buddhist schools developed various schisms. In the old texts, 18 or 20 early schools are mentioned. Later, there were the Mahayana and Vajrayana movements, which can be regarded as being schismatic in origin. There are now perhaps thousands of different Buddhist sects. ==Use within Jainism== The first schism in Jainism happened around the fourth century BCE, leading to rise of two major sects, Digambara and Svetambara, which were later subdivided in further sub-sects. ==Use within Judaism== Throughout the Jewish history, Judaism survived many schisms. Today, major Jewish denominations are Orthodox Judaism and non- Orthodox: Reform, Conservative and Reconstructionist. ==Examples== *The schism of the Shia and Sunni Islam, c. 632 *Two Fourth Councils of Constantinople, one Catholic (869-870) and one Orthodox (879-880) *The Great Schism of 1054 *Three Popes at the same time: Roman Pope Gregory XII, Avignon Pope Benedict XIII, Pisan Pope John XXIII, resolved at Council of Constance, see also Western Schism, 1378-1417 *The Swiss Reformation beginning in 1516 *The Protestant Reformation beginning in 1517 *Anabaptist, c. 1525 *The English Reformation beginning in 1529 *Michael Servetus burned at the stake in 1553, considered founder of Unitarianism *The Scottish Reformation in 1560 *The Dutch Reformation in 1571 * See Old believers and Raskol for schism within the Russian Orthodox Church in 1666 *American Restorationism beginning in the 1850s *Christian Catholic Church of Switzerland rejects First Vatican Council doctrine of Papal Infallibility, see also Old Catholic Church, 1868 *The Sedevacantism schism of 1958 *The schism between the Anglican Communion and the Continuing Anglican Movement in 1977 ==Related pages== *Secession *Ecumenism ==References== == Other websites == *Encyclopedia Britannica: Schism *Catholic Encyclopedia: Schism Category:Church organization Category:Controversies",
 "title": "Schism (religion)"
}