{
 "id": "54481",
 "text": "The Twelve Apostles, (somebody sent forth/sent out) (, apostolic, Liddell & Scott, Strong's G652 were men who, according to the Synoptic Gospels and Christian tradition, were chosen from among the disciples (students) of Jesus Christ for a mission. Judaism had an office known as apostle (שליח)\". The Bauer lexicon, Walter Bauer's Greek-English Lexicon of the NT: \"... The Gospel of Mark states that Jesus Christ initially sent out these twelve in pairs,(, cf. ,) to towns in Galilee. == Twelve Apostles of Jesus == According to the list occurring in each of the Synoptic Gospels (, , ), the Twelve chosen by Jesus near the beginning of his ministry, those whom also He named Apostles, were *Simon: called Peter (Grk. petros; Aram. kēfas; Engl. stone) by Jesus of Nazareth, also known as Simon bar Jonah and Simon bar Jochanan (Aram.) and earlier (Pauline Epistles were written first) Cephas (Aram.), and Simon Peter, a fisherman from Bethsaida \"of Galilee\" (John 1:44; cf. 12:21) Simon/Peter - Andrew's brother (Matthew 10:2; Mark 3:16; Luke 6:14) *Andrew: brother of Peter, a Bethsaida fisherman and disciple of John the Baptist, and also the First-Called Apostle. (Matthew 10:2; Mark 3:18; Luke 6:14) *James - John's brother, son of Zebedee, Boanerges, son of Thunder (Matthew 10:2; Mark 3:17; Luke 6:14) *John son of Zebedee, called by Jesus Boanerges (an Aramaic name explained in Mk 3:17 as \"Sons of Thunder\") - James' brother (Matthew 10:2; Mark 3:17; Luke 6:14) ** Known as the only apostle who was not martyred, and also has his own Gospel in the New Testament. *Philip: from Bethsaida \"of Galilee\" (John 1:44, 12:21) (Matthew 10:3; Mark 3:18; Luke 6:14) *Thaddeus: \"Judas, son of James\", (Matthew 10:3, Acts 1:13, Luke 6:16, John 14:22). Lebbaeus/Judas/Juda - , Simon's brother (Matthew 10:3; 13:55; Mark 3:18; 6:3; Luke 6:16; Jude 1:1) *Bartholomew: in Aramaic \"bar-Talemai?\", \"son of Talemai\" or from Ptolemais, some identify with Nathanael. (Matthew 10:3; Mark 3:18; Luke 6:14) *Thomas: also known as Judas Tomas Didymus - Aramaic T'oma = twin, and Greek Didymous = twin (Matthew 10:3; Mark 3:18; Luke 6:15) *James: commonly identified with James the Less Catholic Encyclopedia: The Brethren of the Lord: \"His identity with James the Less (Mark 15:40) and the Apostle James, the son of Alpheus (Matthew 10:3; Mark 3:18), although contested by many Protestant critics, may also be considered as certain.\" \\- Matthew's/Levi's brother, son of Alphaeus (Matthew 10:3; 27:56; Mark 2:14; 3:16, 18; 6:3; 15:40, 47; Luke 5:27; 6:14-15; 24:18; Acts 1:13; 4:36). *Matthew: the tax collector, some identify with Levi son of Alphaeus - Levi - James' brother (James the less) (Matthew 10:3; 27:56; Mark 2:14; 3:16, 18; 6:3; 15:40, 47; Luke 5:27; 6:14-15; 24:18; Acts 1:13; 4:36) and author of the Book of Matthew * Simon the Canaanite: called in Luke and Acts \"Simon the Zealot\", some identify with Simeon of JerusalemCatholic Encyclopedia: The Brethren of the Lord: \"Some identify him [Symeon of Jerusalem] with the Apostle Simon the Cananean (Matthew 10:4; Mark 3:18) or the Zealot (Luke 6:15; Acts 1:13).\" -, Thaddeus' brother (Matthew 10:4; 13:55; Mark 3:18; 6:3; Luke 6:15) *Judas Iscariot: the name Iscariot may refer to the Judaean towns of Kerioth or to the sicarii (Jewish nationalist insurrectionists), or to the tribe of Issachar; (Matthew 10:4; Mark 3:19; Luke 6:16) ** He was replaced as an apostle in Acts by Saint Matthias It should also be noted that while the \"Twelve Apostles\" refer to the twelve who followed Jesus during his lifetime (and later Matthias in place of Judas Iscariot), Paul (formerly Saul of Tarsus) can be considered as another apostle. Notably, he begins many of his epistles with \"Paul, an apostle of Christ Jesus\", or some variant. The original twelve were apostles sent out to the Jews, whereas Paul has the unique role of being the apostle to the gentiles after Christ's resurrection and ascent. The identity of the other apostle of the twelve, traditionally called St. Jude, varies between the Synoptic Gospels and also between ancient manuscripts of each gospel: * Mark names him as Thaddaeus * Some manuscripts of Matthew also identify him as Thaddeus * Some manuscripts of Matthew name him as Lebbaeus * Some manuscripts of Matthew name him as Judas the Zealot * Luke names him as Judas, son of James or in the KJV: \"Judas the brother of James\" The Gospel of John, unlike the Synoptic Gospels, does not offer a formal list of apostles, but does refer to the Twelve in , , and . The following nine apostles are identified by name: * Peter * Andrew (identified as Peter's brother) *the sons of Zebedee (plural form implies at least two apostles) * Philip * Thomas (also called Didymus (, , )) * Judas Iscariot *Judas (not Iscariot) () The individual that the Gospel of John names as Nathanael is traditionally identified as the same person that the Synoptic Gospels call Bartholomew, and most would agree that the sons of Zebedee is likely to be a reference to James and John, while Judas (not Iscariot) probably refers to Thaddaeus, also known as St. Jude. Noticeably missing from the Gospel of John are James, son of Alphaeus, Matthew, and Simon the Canaanite/Zealot. == The Disciples of Jesus Christ == Name Details Matthew Mark Luke John Acts Jude James Simon Peter Andrew's Brother, Cephas in Latin meaning \"The Rock,\" 10:2 3:16 6:14 1:35-42 Andrew Simon Peter’s Brother, disciple of John the Baptist 10:2 3:18 1:35-42; 6:14 James John's Brother, son of Zebedee and Salome, Bornerges, Son of Thunder, nephew of Joseph and Mary, cousin of Jesus 10:2; 20:20; 27:56; 3:17; 15:40; 16:1; 6:14; 19:25; John James' Brother, son of Zebedee and Salome, Bornerges, Son of Thunder, nephew of Joseph and Mary, cousin of Jesus 10:2; 20:20; 27:56; 3:17; 15:40; 16:1; 6:14; 19:25; Philip from Bethsaida \"of Galilee\" 10:3; 3:18; 6:14; 1:44; 12:21; Bartholomew Nathaniel 10:3; 3:18; 6:14; 1:43-51; Matthew Levi Son of Alphaeus, James the Less, Jude, and Simon. 10:3; 27:56; 2:14; 3:16,18; 6:3; 15:40,47; 5:27; 6:14-15; 24:18; 1:13; 4:36; Thomas Didymus - which means \"the Twin\" 10:3; 3:18; 6:15; 20:24-29 James the Less The son of Alphaeus and Thaddaeus (not to be confused with James The Just, who only became an apostle after Jesus' resurrection) 10:3; 27:56; 2:14; 3:16,18; 6:3; 15:40,47; 5:27; 6:14-15; 24:18; 1:13; 4:36; 1:1; Thaddaeus Lebbaeus Judas Juda Jude Son of James - so probably not Jesus' Half-Brother 13:55; 3:18; 6:3; 6:16; 1:1; Simon Zelotes Simon the Zealot is not associated in the Gospels with Jesus' Half-Brother, Simon 10:4; 13:55; 3:18; 6:3; 6:15; Judas Iscariot the Traitor: Betrayed Jesus for thirty pieces of silver, later hanged himself 10:4; 3:19; 6:16; Matthias Disciple of John the Baptist, replacement for Judas Iscariot 1:35-42; 1:20-26; ==Related pages== *New Testament ==References== * Navarre RSV Holy Bible. Four Courts Press, Dublin, Ireland, 1999. * William F. Albright|Albright, W.F. and C.S. Mann. \"Matthew.\" The Anchor Bible Series. New York: Doubleday & Company, 1971. * Carson, D.A. \"The Limits of Functional Equivalence in Bible Translation - and other Limits Too.\" The Challenge of Bible Translation: Communicating God's Word to the World. edited by Glen G Scorgie, Mark L. Strauss, Steven M. Voth. * Carter, Warren. \"Matthew 4:18-22 and Matthean Discipleship: An Audience-Oriented Perspective.\" Catholic Bible Quarterly. Vol. 59. No. 1. 1997. * Clarke, Howard W. The Gospel of Matthew and its Readers: A Historical Introduction to the First Gospel. Bloomington: Indiana University Press, 2003. * \"Fisher's of Men.\" A Dictionary of Biblical Tradition in English Literature. David Lyle Jeffrey, general editor. Grand Rapids: W.B. Eerdmans, 1992. * France, R.T. The Gospel Acording to Matthew: an Introduction and Commentary. Leicester: Inter-Varsity, 1985. * Manek, Jindrich. \"Fishers of Men.\" Novum Testamentum. 1958 pg. 138 * Eduard Schweizer|Schweizer, Eduard. The Good News According to Matthew. Atlanta: John Knox Press, 1975 * Wuellner, Wilhelm H. The Meaning of \"Fishers of Men\". Westminster Press, 1967. ( :) G woz 'ere) == Other websites == *Catholic Encyclopedia: Apostles *Jewish Encyclopedia: Apostle and Apostleship *Apostles.com: Biographies of Christ's Apostles *Fishing in first century Judea *The fishing economy in Galilee *OrthodoxWiki: Apostle *Apostle in the 1911 Encyclopædia Britannica",
 "title": "Twelve Apostles"
}