{
 "id": "544801",
 "text": "\"What You Waiting For?\" is a single by American singer and songwriter Gwen Stefani. It is from her first solo studio album, Love. Angel. Music. Baby.. It was the first single from the album. It was written by Stefani and Linda Perry. ==Track listings== * European CD single # \"What You Waiting For?\" (Album Version) – 3:41 # \"What You Waiting For?\" (Jacques Lu Cont's TWD Mix) – 8:02 * European and Australian enhanced CD maxi single # \"What You Waiting For?\" (Album Version) – 3:41 # \"What You Waiting For?\" (Jacques Lu Cont's TWD Mix) – 8:02 # \"What You Waiting For?\" (Jacques Lu Cont's TWD Dub) – 8:22 # \"What You Waiting For?\" (Music Video) (Director's Cut) – 8:37 * European enhanced CD maxi single # \"What You Waiting For?\" (Album Version) – 3:41 # \"What You Waiting For?\" (Jacques Lu Cont's TWD Mix) – 8:02 # \"What You Waiting For?\" (Instrumental) – 3:41 # \"What You Waiting For?\" (Music Video) (Director's Cut) – 8:37 * US 12\" single # \"What You Waiting For?\" (Armand Van Helden Remix) – 8:39 # \"What You Waiting For?\" (The Rude Ho Mix by Felix da Housecat) – 5:07 # \"What You Waiting For?\" (Armand Van Helden Dub) – 7:55 ==Music video== The song's music video was directed by Francis Lawrence, filmed in March 2004. and produced by Caleb Dewart of DNA Inc The video deals directly with the lyrics' theme of Stefani's search for inspiration in songwriting. It opens with a lengthy non-musical section in which Stefani arrives in Los Angeles off of No Doubt's Rock Steady Tour. She receives several calls from Interscope label head Jimmy Iovine, who attempts to push her forward with her solo debut project, but she replies that she is tired and uninspired. After a failed studio attempt, Stefani sees a flyer advertising help for writer's block. Upon arrival, she is asked to fill out a suspicious questionnaire, where the camera pans to the questions which will be important. She is then told that she will be billed when she is finished. She asks for clarification only to discover that she is already back in the studio by herself. When Stefani picks up an oversized pocket watch from the piano, a rabbit knick-knack that she had previously seen jumps across the room. She throws the watch at the knick-knack, causing her to fall back on her wooden chair and find herself transported to a fantasy world based on Alice's Adventures in Wonderland and Through the Looking-Glass. ==Credits and personnel== Credits adapted from the liner notes of Love. Angel. Music. Baby. * Gwen Stefani – lead vocals, songwriting * Rusty Anderson – additional guitar * Greg Collins – recording * Brian \"Big Bass\" Gardner – mastering * Rob Haggett – second assistant engineer * Nellee Hooper – production * Sam Littlemore – programming * Kevin Mills – assistant engineering * Mimi (Audia) Parker – backing vocals * Linda Perry – guitar, guitar recording, keyboard recording, keyboards, songwriting * Ian Rossiter – recording * Mark \"Spike\" Stent – mixing * David Treahearn – assistant engineering ==Charts== ===Weekly charts=== Chart (2004–05) Peak position Australia Dance (ARIA) 1 Canada (Canadian Singles Chart) 24 Europe (European Hot 100 Singles) 6 Germany (Official German Charts) 22 Greece (IFPI Greece) 17 US Pop 100 (Billboard) 14 ===Year-end charts=== Chart (2004) Position Australia (ARIA) 26 Australia Dance (ARIA) 1 Netherlands (Dutch Top 40) 81 Sweden (Sverigetopplistan) 72 UK Singles (Official Charts Company) 66 Chart (2005) Position Australia (ARIA) 40 Australia Dance (ARIA) 4 Austria (Ö3 Austria Top 40) 74 Belgium (Ultratop 50 Flanders) 93 Belgium (Ultratop 50 Wallonia) 56 Europe (European Hot 100 Singles) 27 France (SNEP) 61 Sweden (Sverigetopplistan) 84 Switzerland (Schweizer Hitparade) 78 UK Singles (Official Charts Company) 174 US Hot Dance Club Play (Billboard) 9 US Pop 100 (Billboard) 97 ===Decade-end charts=== Chart (2000–09) Position Australia (ARIA) 75 US Hot Dance Club Play (Billboard) 8 ==References== Category:2004 songs Category:Debut singles Category:Gwen Stefani songs Category:Pop songs Category:Dance songs Category:R&B; songs",
 "title": "What You Waiting For?"
}