{
 "id": "54504",
 "text": "An Ecumenical Council (also sometimes Oecumenical Council) or general council is a meeting of the bishops of the church of the whole world who have come together to discuss matters of Church doctrine and practice. The word is from the Greek language \"\", which means \"inhabited\", and was originally an other name for the territory of the Roman Empire, because the earliest councils were all called in by Roman Emperors. In later times it was used in the sense of \"world-wide\" or \"general.\" ==List of ecumenical councils== ===The first seven Ecumenical Councils=== The period of Christianity from the First Council of Nicaea (325) to the Second Council of Nicaea (787) is called the period of the Seven Ecumenical Councils. * 1. First Council of Nicaea, (325) adopted the Nicene Creed. * 2. First Council of Constantinople, (381); changed the text of the Nicene Creed into present form. * 3. Council of Ephesus, (431); proclaimed the Virgin Mary as the Theotokos (Greek Η Θεοτόκος, \"God-bearer\" or more commonly \"Mother of God\"). * 4. Council of Chalcedon, (451); declared the doctrine of monophysitism to be wrong and adopted the Chalcedonian Creed. This and all following councils are not recognized by the Oriental Orthodox Communion. * 5. Second Council of Constantinople, (553) * 6. Third Council of Constantinople, (680–681); affirmed that Christ had both human and divine wills. ** Quinisext Council (= Fifth and Sixth) or Council in Trullo, (692); this council is accepted by the Eastern Orthodox Church as a part of the Third Council of Constantinople, but is rejected by Catholics. * 7. Second Council of Nicaea, (787); restoration of the veneration of icons and end of the first iconoclasm. It is rejected by many Protestant denominations, who instead prefer the Council of Constantinople of 754, which condemned the veneration of icons. == Further reading== * Tanner, Norman P. The Councils of the Church, . * Tanner, Norman P. Decrees of the Ecumenical Councils, . == Other websites == * The Seven Ecumenical Councils, Select Online Resources * All Catholic Church Ecumenical Councils - All the Decrees * The Eighth and Ninth Ecumenical Councils * Council in the 1911 Encyclopædia Britannica * Catholic Encyclopedia: The 21 Ecumenical Councils * Catholic Encyclopedia: General Councils * Ecumenical Councils * All Catholic Church Council Decrees including Trent and Vatican II Category:Church councils",
 "title": "Ecumenical council"
}