{
 "id": "54525",
 "text": "Love Generation () was a dramatic Japanese television series on Fuji Television. It first aired in Japan from October 13 1997 to December 22, 1997 every Monday. It had a very high rating of 30.8%. It features music by Cagnet. ==Cast== *Katagiri Teppei - Takuya Kimura *Uesugi Riko - Takako Matsu *Takagi Erika - Norika Fujiwara *Katagiri Soichiro - Masaaki Uchino *Mizuhara Sanae - Junna Risa *Yoshimoto ==Characters== *Katagiri Teppei - A talented advertisement designer and a playboy with an egocentric attitude and dislike for anything boring. He has a girlfriend named Riko, but still misses his past girlfriend Sanae at the same time *Uesugi Riko - She moves out from her family to Tokyo hoping to be more independent. She is a girl with a lot of spirit, and eventually becomes part of a love triangle. *Takagi Erika - A flight attendant and Riko's bestfriend. While she secretly likes Teppei, she frequently gives helpful advice to Riko to maintain her relationship *Katagiri Soichiro - a public prosecutor and Teppei's brother. He is very serious in his doings unlike Teppei, and thus Soichiro is his brother's role model. He was engaged to Sanae, Teppei's former girlfriend, but he meets his own past girlfriend and develops an affair with her later on in the story. *Mizuhara Sanae - translates between Mandarin and Japanese. She was Teppei's highschool sweetheart. Later, she is engaged to his brother Soichiro, but later finds herself falling in love with Teppei again *Yoshimoto - Teppei's highschool friend, who falls in love with Riko at first sight, but was rejected by her ==Summary== The show revolves around the relationship of the two leading characters, Katagiri Teppei and Uesugi Riko, who begin their relationship as squabbling colleagues before falling in love. Katagiri Teppei is a talented designer and very popular among women. Unfortunately, Teppei, who despises anything boring and repetitive, is forced to move to the sales department for his egocentric behavior. Throughout the series, he is forced to adapt to the new working environment, which includes cutting his precious locks of hair to create a neater and more professional image. As he struggles to adapt, he meets Uesugi Riko. While she does not like him at first, she eventually falls for him. However, Teppei runs into his highschool sweetheart Mizuhara Sanae, and discovers that his ex-girlfriend is now engaged to his brother Soichiro. Fortunately, Riko is there to console him, and this eventually blooms into a romance. Not long after, however, Sanae realizes she still has feelings for Teppei, and thus creates a love triangle. To make the matter even more complicated, Soichiro starts to have an affair with his past girlfriend. ==Symbols== ===Crystal apple=== Teppei's apartment has many unusual items such as Thai artifact, a 30-year-old refrigerator, and a crystal apple. The meaning behind the apple is that there is only one true love, between Adam and Eve, that is. A crystal can be broken easily, and when one would look in it, it appears upside down. The apple is seen upside down for the 10 of the 11 episodes. At the last episode, however, the apple is no longer upside down. The apple is on the album cover of the soundtrack for Love Generation. ===True love never runs smooth=== The advertising poster appears over and over again. The model is holding a crystal apple, and reads True love never runs smooth symbolizing the relationship between Riko and Teppei, which constantly faces struggles from when they meet for the very first time to the love triangle. This advertisement is visible everywhere from the park to Teppei's 30-year-old refrigerator, as \"True love never runs smooth\" is the unofficial tagline of this television series. == Other websites == *Lover Generation Central *Love Generation - The Dog Shed *SMAP Wonderland Love Generation *Plot for each episode Category:Japanese television series Category:Drama television series",
 "title": "Love Generation"
}