{
 "id": "545245",
 "text": "Ashley Michele Greene (born February 21, 1987) is an American actress and model. She is best known for playing Alice Cullen in the Twilight Saga movies. == Early life == Greene was born in Jacksonville, Florida. Her mother is Michele Greene (née Tatum), who works in insurance, and Joe Greene, a former U.S. Marine who now owns a concrete business. She grew up in Middleburg and Jacksonville. She moved to Los Angeles, California, at the age of 17 to pursue an acting career. Greene has an older brother named Joe. == Career == At first, she planned to become a model. Her manager told her that she was not tall enough to be a fashion model and that she should act in commercials instead. After taking commercial and acting classes, she realized that she liked acting more than modeling. Greene graduated from high school early and moved to L.A. to start her acting career. === Acting === Early in her career, she had guest roles on television programs, such as Punk'd and Crossing Jordan. In 2008, she had an important role in the movie Twilight, which was based on the novel of the same name by Stephenie Meyer. She played the character Alice Cullen. She was also in the sequels to Twilight: The Twilight Saga: New Moon (2009), The Twilight Saga: Eclipse (2010), The Twilight Saga: Breaking Dawn - Part 1 (2011), and The Twilight Saga: Breaking Dawn - Part 2 (2012). Greene played Michelle Burkham in the drama movie Skateland (2010). She acted in the movie A Warrior's Heart with Kellan Lutz, who was also in Twilight. Greene acted along with Miley Cyrus and Demi Moore in the drama movie LOL (2012). In 2013, Greene was in the historical film CBGB about the former Manhattan music club with the same name. === Modeling === In 2010, Greene did modeling for an advertisement by the company SoBe. In this advertisement, she wore body paint. Later the same year, Greene became the main model for the Mark brand of cosmetics. This brand is made by the company Avon. Greene received an award from the PETA foundation because of her work with Avon, which does not do animal testing. She also received \"The Style Icon Award\" from the magazine Hollywood Life at the Young Hollywood Awards. == Filmography == === Film === Year Title Role Notes 2007 King of California McDonald's Customer 2008 Otis Kim #4 2008 Twilight Alice Cullen 2009 Shrink Missy 2009 Summer's Blood Summer Matthews 2009 Alice Cullen 2010 Skateland Michelle Burkham 2010 Alice Cullen 2010 Radio Free Albemuth Rhonda 2011 Brooklyn Milligan 2011 Butter Kaitlen Pickler 2011 Alice Cullen 2012 LOL Ashley 2012 Kelly 2012 Alice Cullen 2013 CBGB Lisa Kristal 2014 Wish I Was Here Janine 2014 Kristy Violet 2014 Burying the Ex Evelyn 2015 Staten Island Summer Krystal Manicucci 2015 Shangri-La Suite Priscilla Presley Post- production 2016 Holidays 2016 Urge Theresa Post-production 2016 In Dubious Battle Danni Stevens Post-production 2016 Max & Me Rachel (voice) Post- production === Television === Year Title Role Notes 2006 Crossing Jordan Ann Rappaport \"The Elephant in the Room\" 2006 Mad TV Amber \"11.17\" 2006 Desire Renata Recurring role 2008 Shark Natalie Faber \"Partners in Crime\" 2011-2012 Pan Am Amanda Mason Recurring role 2012 Americana Alice Garano Unsold TV pilot === Video games === Year Title Role Notes 2015 Batman: Arkham Knight Barbara Gordon / Batgirl (voice) Video game 2015 Batgirl: A Matter of Family Barbara Gordon / Batgirl (voice) Video game (DLC) ===Music videos=== Year Title Artist 2005 Lyudi Invalidy/ Dangerous and Moving t.A.T.u == Awards and nominations == Year Award Category Work Result Notes 2008 Teen Choice Awards Movie Fresh Face Female Twilight 2008 Scream Awards Best Supporting Actress Twilight 2008 Scream Awards Best Ensemble Cast Twilight 2009 Teen Choice Awards Scene Stealer Female 2009 Teen Choice Awards Most Fanatic Fans Shared with cast 2010 Teen Choice Awards Scene Stealer Female 2012 Teen Choice Awards Scene Stealer Female == References == == Other websites == * * Category:1987 births Category:Living people Category:American movie actors Category:American television actors Category:Actors from Florida",
 "title": "Ashley Greene"
}