{
 "id": "54526",
 "text": "Psyche (pronounced: SY-kee) is a former mortal woman and goddess of the soul in Greek mythology. She is the wife of Eros (Cupid) and the mother of Hedone. Today, Psyche is known from a story called The Golden Ass, written by Lucius Apuleius in the 2nd century. ==Mythology== === Early life === Psyche was the youngest daughter of a Greek king and queen. She had two older sisters. She was very beautiful. Many people said she was more beautiful than Aphrodite. People started worshipping Psyche instead of Aphrodite. This made the goddess angry. As a punishment, she sent her son, Eros, to make Psyche fall in love with an ugly person. However, Eros fell in love with Psyche. He decided to save her from his mother's anger. Psyche's sisters were jealous of her beauty. They eventually married kings and left to be with their husbands. Nobody asked to marry Psyche. She was left alone. Her father decided to ask the Oracle of Delphi for help. === Marriage to Eros === Apollo, spoke to Psyche's father through the Oracle. He told her father that Psyche would marry a monster that even the gods were afraid of. Apollo said to dress Psyche in funeral clothes, take her to the tallest rock in the kingdom, and leave her there. The king sadly obeyed Apollo. Psyche waited for the monster. When it did not come, she jumped from the rock. Zephyrus, the Greek lord of west wind, held her up to save her from death. He took her to Eros's palace. When Eros returned, he talked to Psyche in the dark. He said that she must not try to see him. He said that it would ruin everything if he told her his name. The first few weeks of Psyche's life in the palace were good. But soon her sisters convinced her to see what her husband looked like. Psyche sneaked into her husband's room with an oil lamp. Psyche shone the light on her husband's face. A small drop of hot oil fell onto his shoulder. That burned him and woke him up. Eros felt betrayed by his wife's actions. He left Psyche. Psyche was very unhappy after learning what she had done. Aphrodite found her and made her do four things. *The first thing was to sort a huge pile of seeds. An ant colony helped Psyche do this. *The second thing was to gather wool from a dangerous sheep. A river god helped her by teaching her to collect pieces of wool from bushes. *The third thing was to collect water from the underworld. The eagle of Zeus collected the water for her. *The last thing was the most difficult. She had to bring back some of Persephone's beauty for Aphrodite. Persephone gave Psyche some of her beauty. When she was on her way back to Olympus, Psyche opened the box of Persephone's beauty. The only thing inside was death. Psyche died. Her husband, Eros, forgave her. He took her to Olympus. Psyche was made the goddess of the soul. Psyche and Eros had a daughter, Hedone. Their daughter was the goddess of physical joy. == Related pages == *16 Psyche ==References== Category:Greek gods and goddesses",
 "title": "Psyche (mythology)"
}