{
 "id": "545676",
 "text": "The 2012 Campeonato Brasileiro Série A (known as the Brasileirão Petrobras 2012 for sponsorship reasons) was the 56th edition of the Campeonato Brasileiro Série A, the top-level of professional football in Brazil. Corinthians come in as the defending champions having won the title in the 2011 season. On 11 November 2012, Fluminense won the title for the fourth time. == Teams == === Stadiums and locations === Team Home city Stadium Capacity Atlético Goianiense Goiânia Serra Dourada 50,049 Atlético Mineiro Belo Horizonte Independência 25,000 Bahia Salvador Pituaçu 32,179 Botafogo Rio de Janeiro Engenhão 46,931 Corinthians São Paulo Pacaembu 37,952 Coritiba Curitiba Couto Pereira 37,182 Cruzeiro Belo Horizonte Arena do Jacaré 25,000 Figueirense Florianópolis Orlando Scarpelli 19,808 Flamengo Rio de Janeiro Engenhão 46,931 Fluminense Rio de Janeiro Engenhão 46,931 Grêmio Porto Alegre Olímpico 45,000 Internacional Porto Alegre Beira-Rio 56,000 Náutico Recife Aflitos 19,800 Palmeiras São Paulo Pacaembu 37,952 Ponte Preta Campinas Moisés Lucarelli 19,722 Portuguesa São Paulo Canindé 21,004 Santos Santos Vila Belmiro 20,120 São Paulo São Paulo Morumbi 67,428 Sport Recife Ilha do Retiro 30,520 Vasco da Gama Rio de Janeiro São Januário 22,150 == Statistics == === Top goalscorers === Rank Name Nationality Club Goals 1 Fred Fluminense 20 2 Luís Fabiano São Paulo 17 3 Aloísio Figueirense 14 3 Hernán Barcos Palmeiras 14 3 Bruno Mineiro Portuguesa 14 3 Neymar Santos 14 7 Kieza Náutico 13 7 Vágner Love Flamengo 13 9 Bernard Atlético Mineiro 11 9 Elkeson Botafogo 11 Source: globoesporte.com === Hat-tricks === Player For Against Result Date Germán Herrera Botafogo São Paulo 4-2 (H) 20 May 2012 Roger Ponte Preta Coritiba 4-1 (H) 14 July 2012 Aloísio Figueirense Coritiba 3-1 (H) 26 August 2012 Bruno Mineiro Portuguesa Sport 5-1 (H) 4 October 2012 Ronaldinho Atlético Mineiro Figueirense 6-0 (H) 6 October 2012 Lucas São Paulo Sport 4-2 (A) 27 October 2012 Neymar Santos Cruzeiro 4-0 (A) 3 November 2012 Category:Campeonato Brasileiro Série A Category:2012 in association football",
 "title": "2012 Campeonato Brasileiro Série A"
}