{
 "id": "545665",
 "text": "The New England Emigrant Aid Company (est.1854), originally the Massachusetts Emigrant Aid Company, was a transportation company in Boston, Massachusetts.New England Emigrant Aid Company, no.5 Winter Street, Boston. Boston Directory. 1855 It was created to bring immigrants to the Kansas Territory. This was done to make sure Kansas would become a free state.Eli Thayer, The New England Emigrant Aid Company, and its influence, through the Kansas contest, upon national history, (Worcester, MA: F. P. Rice, 1887), p. 15 The company was created by Eli Thayer, a member of the Massachusetts House of Representatives, over a month before the Kansas-Nebraska Act was passed in 1854. This act allowed the population of Kansas Territory to choose for themselves whether or not slavery would be legal. The concept was called popular sovereignty. The company was chartered in Massachusetts and started with a capital of $5 million. Thayer's plan was to play on antislavery sentiment in the Northern United States. At the time there was a very delicate balance between slave states and free states. The Company send settlers to Kansas to buy land and build houses, shops and mills. The settlers could then sell the land at a significant profit and send the money back to Thayer and his investors. Because several investors found the idea of profiting from the antislavery cause unpleasant, the company's model was shifted to that of a benevolent society. The name was changed to the New England Emigrant Aid Company in 1855. The Company never made a profit or made a significant impact on the population of Kansas. But, it caused Border Ruffians from nearby Missouri, where slavery was legal, to move to Kansas in order to ensure its admission to the Union as a slave state. This in turn further galvanized Free- Staters and abolitionists to act. To protect the settlers they sent, the Company secretly sent armed men and Sharps rifles to Kansas. The rifles were sent in crates marked \"books\" and \"Bibles\". This played a part in what would become Bleeding Kansas. == References == Category:History of Kansas Category:Bleeding Kansas Category:1854 establishments in the United States Category:19th-century establishments in Massachusetts",
 "title": "New England Emigrant Aid Company"
}