{
 "id": "545717",
 "text": "Iron ores are rocks and minerals from which metallic iron can be got.Ramanaidou E.R. & Wells M.A. 2014. 13.13 - Sedimentary hosted iron ores. In: Holland H.D. & Turekian K.K. (eds) Treatise on Geochemistry. 2nd ed, Oxford: Elsevier, p313-355. Ores with high quantities of hematite or magnetite (more than about 60% iron) are known as \"natural ore\" or \"direct shipping ore\". They can be fed directly into iron-making blast furnaces. Iron (Fe) is one of the most abundant rock-forming elements. It makes up about 5% of the Earth's crust. It is the second most abundant and widely distributed metal (Aluminium is the most common). People have used it for more than 3,000 years. However, its use only became widespread in the 14th century, when smelting furnaces (the forerunner of blast furnaces) began to replace forges. Iron is made in the runaway fusion and explosion of type Ia supernovae. It was picked up as the Sun moved through areas where supernovae had exploded. All higher elements on Earth have this origin. Iron is abundant on the ancient continents, but not so on island chains formed by volcanoes (Japan, Hawaii). That reflects the difference between the continental crust (which has many rare and common elements), and the island chains formed by volcanism (oceanic islands). They have basalt, and very little else. Islands which were once part of a supercontinent usually carry heavy element ore. The classic example is the British Isles, which are a snapped-off part of the large ancient continent, the Old Red Sandstone Continent (Larussia). Consequently, the British Isles has a very wide range of metallic ores, whereas Hawaii and the Japanese archopelago do not. The main source of ore for the steel used in modern Japan comes from Western Australia. == Iron ores == The ores are usually rich in iron oxides and vary in colour from dark grey, bright yellow, deep purple, to rusty red. *magnetite (, 72.4% Fe) *hematite (, 69.9% Fe) *goethite (, 62.9% Fe) *limonite () *siderite (, 48.2% Fe) == References == Category:Iron compounds Category:Ores",
 "title": "Iron ore"
}