{
 "id": "54592",
 "text": "Cumming is a city in Forsyth County, in the northern part of Georgia, United States. It is the county seat of Forsyth County. The city has a population of about 7,300 people. It is part of the Atlanta metropolitan area and serves as a growing suburb to the city of Atlanta. It has a total area of 18.73 square kilometers. ==History== Cumming was founded in the early 1830s. The city was named after Colonel William Cumming, a veteran of the War of 1812. In the 19th century, it was a small farming town. Over the years, the city grew and developed, especially after Lake Lanie was built in the 1950s. Today, it has grown as a suburban part of the Atlanta area. ==Geography== Cumming is located in the northern part of Georgia, about 40 miles north of Atlanta. The city covers an area of 7.23 square miles (18.7 km²). A small portion, about 0.6% of the area, is covered by water, primarily from nearby Lake Lanier. The area around Cumming is mostly rural with forests and hills. ==Economy== Cumming’s economy is primarily driven by retail, services, and tourism. Many people who live in Cumming work in nearby cities like Atlanta. There are several shopping centers, restaurants, and businesses in the city. Tourism is also an important part of the economy, especially because of Lake Lanier and the outdoor activities were there. ==Attractions== One of the biggest attractions near Cumming is Lake Lanier, it has boating, fishing, and other water activities. The lake is a popular summer destination for visitors. it also has parks, trails, and other outdoor spaces for enjoying nature. ==Transportation== Cumming was located near several highways, people can travel to other parts of Georgia easily. Georgia State Route 400 is the main highway that connects Cumming to Atlanta. There are not many public transportation, so most people drive their own cars to get around. ==Education== There are several public schools in the city, including Cumming Elementary School, Forsyth Central High School, and others. The school district is known for its high academic standards. It is one of the largest school districts in Georgia. ==Notable people== *Geoff Duncan, businessman and politician of Lieutenant Governor of Georgia. ==References== == Other websites == * Category:Cities in Georgia (U.S. state) Category:County seats in Georgia",
 "title": "Cumming, Georgia"
}