{
 "id": "546032",
 "text": "A skirmisher is a soldier usually sent ahead of a main body of troops to harass the enemy.Byron Farwell, The Encyclopedia of Nineteenth-century Land Warfare: An Illustrated World View (New York: Norton, 2001), p. 764 Groups of skirmishers may also be placed on the flanks to prevent a surprise attack or flanking maneuver. A skirmish is a term that was first used in the 14th century.International Encyclopedia of Military History, ed. James C. Bradford (London; New York: Routledge, 2006), p. 1189 It meant a small-scale fight between two opposing forces or a preliminary battle involving troops in front of the main force. Skirmishers were those involved in the fight or battle. The word from the Old French eskirmir \"to defend\". Skirmishers were usually infantry or cavalry soldiers who formed a skirmish line ahead or next to friendly troops. == History == === Colonial America === Two conflicts that involved the American colonies and the development of skirmishers were the Seven Years' War (the French and Indian War in the American colonies) and the American Revolutionary War. The main development of skirmisher tactics came from the Native American allied primarily to the English and French. Indian warriors did not usually fight in the European style of closely-packed formations of soldiers but more often fought as individuals. They used cover, ambush and lines of fighters, which would later come to be called skirmishing. === Napoleonic Wars === The tactics of the Napoleonic Wars called for heavy cavalry to be kept in reserve.Philip Haythornthwaite, Napoleonic Light Cavalry Tactics (London: Osprey Publishing, 2013), p. 28 Light cavalry were often used as skirmishers and were usually positioned on the sides of an army and served two purposes. In \"skirmish order\", they could be placed some distance from the main force. That way, they could warn the commander if any enemy approached from that way. The other purpose was to use their quick speed to engage the enemy and to hold them until more forces arrived. By their very presence, they discouraged the enemy from mounting a flanking attack. === American Civil War === During the American Civil War, infantry manuals paid a good deal of attention to skirmishing. The tactics were based on Napoleon's heavy dependence on skirmishing during the Napoleonic Wars. Paintings and images of Civil War battles show two lines of soldiers, standing shoulder to shoulder and firing at the enemy lines at short distances. However, massed formations were not frequently used during the Civil War. Skirmishes and skirmish lines were a more common tactic. The terrain in many cases did not allow mass formations of armies but allowed skirmishers to fight in open order. The increased accuracy of rifles and rifled muskets at longer ranges made battles fought at close range unnecessary. Battles fought before at could now be fought at . Pre-war training had also changed skirmisher tactics. Instead of one company out of ten, entire regiments were now taught how to fight as skirmishers. They fought in small formations, called “comrades in battle”. That called for four men to move and fight supporting one another. The Confederate Army actually made more effective use of skirmishers. In each brigade there was an elite battalion of sharpshooters, who were used as skirmishers. === Plains Indian Wars === During the Plains Indian Wars, especially after the Civil War, the US Army used companies of skirmishers ahead of the main force.Clayton Chun, US Army in the Plains Indian Wars 1865–1891 (Oxford, UK: Osprey Publishing, 2004), p. 61 The recommended distance between them was , but most commanders simply kept skirmishers within sight of one another. The skirmishers were used mainly ahead of the main force but could be used to defend the flanks or as a rearguard. If the Indians attacked, the skirmisher company formed a defensive circle. Once the danger had passed, they returned to their original positions. Often, the entire company was not deployed as skirmishers. Some were kept in reserve to fill gaps, to get ammunition or to carry messages. == References == == Other websites == * Civil War Reenactment 2011: Skirmish Of Gamble's Hotel March 5, 1865; YouTube * Diablo 4 Man Room Clearing at Military Base Skirmish; YouTube Category:Military terminology",
 "title": "Skirmisher"
}