{
 "id": "546020",
 "text": "Lecompton (pronounced ) is a city in Douglas County, Kansas, United States. In 2020, there were 588 people there. Lecompton had a big historical role in pre- Civil War America as the territorial capital of Kansas from 1855 to 1861. This time period was known as Bleeding Kansas. == History == Lecompton was founded in 1854 on a bluff on the south side of the Kansas River. At first, the city's name was \"Bald Eagle\", but the name was changed to Lecompton in honor of Samuel Lecompte, the chief justice of the territorial supreme court. In the spring of 1855, the town became the capital of the Kansas Territory. President James Buchanan chose a governor and officials to create government offices in Lecompton. The first post office in Lecompton was created in September 1855. In the fall of 1857 a convention met in Constitution Hall. They drafted the famous Lecompton Constitution, which would have made Kansas become a slave state. The constitution was rejected after angry national debate and was one of the main ideas of the Lincoln-Douglas debates. The controversy added to the growing fight that became the civil war. The Lecompton Constitution failed, in part, because the antislavery people had control of the territorial legislature in the election of 1857. The new legislature met at Constitution Hall and quickly started to get rid of the pro-slavery laws. The free-staters shortly tried to move the territorial capital to Minneola, Franklin County, Kansas through a vote, but the resulting bill was later rejected by Kansas territorial governor James W. Denver, and was made void by Jeremiah S. Black, Attorney General of the United States. As such, Lecompton remained the de jure territorial capital. This was until Topeka became the capital when Kansas became a state on January 29, 1861. The American Civil War began on April 12, 1861. ==Geography== Lecompton is at (39.042927, -95.395039). According to the United States Census Bureau, the city has a total area of , of which, is land and is water. ===Climate=== The climate in this area is has hot, humid summers and generally mild to cool winters. According to the Köppen climate classification system, Lecompton has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Lecompton, Kansas ==Demographics== Lecompton is part of the Lawrence, Kansas Metropolitan Statistical Area. ===2020 census=== In 2020, there were 588 people, 247 households, and 166 families living in Zurich. Of the households, 74.5% owned their home and 25.5% rented their home. The median age was 40.6 years. Of the people, 86.4% were White, 2.4% were Native American, 1.2% were Black, 0.5% were Asian, 2.0% were from some other race, and 7.5% were two or more races. Hispanic or Latino of any race were 2.7% of the people. == References == Category:Cities in Douglas County, Kansas Category:1854 establishments in Kansas Territory",
 "title": "Lecompton, Kansas"
}