{
 "id": "546009",
 "text": "The Wakarusa War was a skirmish that happened in Kansas Territory. It started on November 21st, and it ended on December 8th, 1885. It was part of the Bleeding Kansas violence. It happened mostly in Lawrence and the Wakarusa River Valley. == Summary == The events that led to the Wakarusa War started on November 21, 1855. A Free-Stater named Charles Dow was shot and killed by pro- slavery settler Franklin N. Coleman.Frank Wilson Blackmar,Kansas: A Cyclopedia of State History, Volume 2 (Standard Publishing Company, 1912), p. 855 The two had been involved in a land dispute at a place called Hickory Point, south of Lawrence. Four hours after the shooting the property owner, Jacob Branson, recovered Dow’s body. Abolitionists then set fire to several pro-slavery cabins. When the (pro-slavery) Douglas County Sheriff, Samuel Jones, learned about what happened at Hickory Point, he led a posse to the area to restore order. But Jones did not arrest Coleman. Instead, he arrested the property owner (and abolitionist leader) Jacob Branson. But while taking Branson to jail, an abolitionist party stopped them and freed Branson. The Sheriff then assembled about 1,500 Missouri Border Ruffians to put down what he called an insurrection. The Missourians camped along the Wakarusa River while they made plans to invade Lawrence. == Siege == Before coming to Lawrence, the bushwhackers had broken into the United States Arsenal at Liberty, Missouri, and stolen guns, swords, a cannon and ammunition. In Lawrence, John Brown and James Lane had mustered Free-State settlers into a defending army and erected barricades. No attack on Lawrence was made. It was the first time armies from Missouri and Kansas faced each other. It was demanded free-staters obey the laws and give up their weapons. But they replied they had broken no laws and had the right to bear arms. The only fatal casualty occurring during the siege was of a Free-State man named Thomas Barber. On December 6, 1855 he was shot and killed by George W. Clark, the Indian agent, on a road four miles outside of Lawrence. == References == == Other websites == * History of the State of Kansas by William G. Cutler (1883) * 1912 article on Wakarusa War * \"Burial of Barber\" at Bartleby.com Category:Bleeding Kansas Category:1850s in Kansas Category:1855 Category:Lawrence, Kansas",
 "title": "Wakarusa War"
}