{
 "id": "546463",
 "text": "Son Heung-min (Hangul: 손흥민 [sʰon hɯŋmin]; born 8 July 1992) is a South Korean footballer who plays as a left winger. He captains both the English Premier League club Tottenham Hotspur F.C. and the South Korean national team. He has also played in the Bundesliga for Hamburger SV and Bayer Leverkusen. He is one of the top Asian goalscorers in both Premier League and UEFA Champions League history. Known for his pace, versatility, finishing, two-footedness, and ability of linking play, Son is widely regarded as one of the best players in South Korea, Asia, and Tottenham Hotspur’s history. He participated in the 2014 FIFA World Cup, and also took part in the 2018 and 2022 editions. He has also competed in all Asian Cup tournaments since 2011. In 2015, he contributed to South Korea’s second-place finish at the AFC Asian Cup, scoring a goal against Australia in the final — a match they lost in extra time to his future Spurs coach, Ange Postecoglou, then coach of Australia. Son is tied with Park Ji-sung and Ahn Jung-hwan as South Korea’s top scorer at World Cups, each with three goals. He also represented South Korea at the 2018 Asian Games, where the team won gold medals. With Tottenham, Son won the UEFA Europa League in 2025, was a runner-up in the League Cup in 2021, and reached the UEFA Champions League final in 2019. He has been a key player in the squads that qualified for the UEFA Champions League six times (2016–2019, 2022, and 2025). ==Personal life== Son was born on July 8th 1992 in Chuncheon, South Korea. He was taught by his father, who is a former football player. Son graduated Chuncheon Buan Elementary School. Then he entered Chuncheon Hupyeong Middle School, but he transferred to and graduated from Wonju Yukmingwan Middle School. He entered Dongbuk High School, but quit to join Hamburger SV. ==Club Career== ===Hamburger SV=== In 2008, Son joined the youth academy of Hamburger SV in the Bundesliga at the age of 16. He signed a professional contract before the 2010-2011 season. ===Bayer 04 Leverkusen=== In June 2013, he transferred to Bayer 04 Leverkusen. ===Tottenham Hotspur=== In August 2015, Son joined the English Premier League team Tottenham Hotspur F.C.. ==International career== Son's first international competition was the 2011 AFC Asian Cup.The Korea Herald, \"Son of SV Hamburg tapped to Asian Cup team\" ; retrieved 2016-06-29. Later, he played in the 2014 FIFA World Cup.The Telegraph, \"South Korea World Cup 2014 squad\"; retrieved 2016-06-29. ==References== Category:Living people Category:South Korean footballers Category:1992 births Category:2014 FIFA World Cup players Category:2018 FIFA World Cup players Category:2022 FIFA World Cup players Category:South Korea at the 2014 FIFA World Cup Category:South Korea at the 2018 FIFA World Cup Category:South Korea at the 2022 FIFA World Cup",
 "title": "Son Heung-min"
}