{
 "id": "546797",
 "text": "Byun Baek-hyun (Hangul: 변백현; Hanja:卞白贤; born May 6, 1992) is a South Korean singer, dancer, actor, and TV presenter. He is best known solely by his first name Baekhyun. As a member of the boy band Exo, his role is to dance and sing the most important parts of the songs. == Biography == Byun Baek-hyun was born in Bucheon, Gyeonggi Province on May 6, 1992. He has an older brother named Baek-beom. Baek-beom is seven years older than Baek-hyun. Byun began training to be a singer at age 11. He had been influenced by Rain—another K-pop idol who was most popular in the 2000s. He attended Jungwon High School in Bucheon. He was the lead singer of a band called Coma (혼수 상태) there. Coma once won at a local music festival. Kim Hyun-woo (from a rock band called DickPunks) eventually gave the young Byun piano lessons. Byun also had interests outside music. He was a martial artist as a teenager and obtained a black belt in Hapkido. Baekhyun was discovered by an agent of S.M. Entertainment when he was practicing his admission exams for the Seoul Institute of Arts. He then joined the company under the S.M. Casting System in 2011. He and his bandmates Chanyeol and Suho attended Kyung Hee Cyber University. Byun took online classes at the Culture and Arts Department of Business Administration. == Career == === 2012–2015: Debut and early career === Baekhyun was the last member to join Exo. He was the ninth member of the group to be revealed on January 30, 2012. In February 2014, Baekhyun and Suho became regular hosts for Inkigayo — a music show that airs on SBS TV. They left the program in November to focus on Exo's comeback. In July, Baekhyun ventured into musical theater. He was cast the lead role of Don Lockwood in Singin' in the Rain. The South Korean production that he was in was done by SM C&C.; In April 2015, Baekhyun released its first song solo since its debut titled \"Beautiful\" like the soundtrack of the drama EXO Next Door. The song became the first soundtrack of a web drama that was within the best positions of several musical lists. In May 2015, Baekhyun was announced that it would be the protagonist of the action film Dokgo alongside actor Yeo Jin-goo. However, the film's production was announced to be canceled in January 2016. In December 2015, Baekhyun paid a tribute to the late South Korean singer Kim Hyun-sik performing his song \"Like Rain Like Music\" on SBS Gayo Daejeon's end-of-year music program. The recording of a song performed by Baekhyun was digitally published. === 2016–present: Acting roles and Exo-CBX === In January 2016, Baekhyun and Suzy of Miss A performed a duet entitled \"Dream\". The song quickly reached the best position in the music charts after it positioned itself in the first place of Gaon Digital Chart. \"Dream\" also won five times the first place in Music Bank and Inkigayo. In April 2016, Baekhyun received a YinYueTai V-Chart award for being the Most Popular Singer in South Korea. In May 2016, Baekhyun and South Korean singer K.Will released a duet titled \"The Day\" as part of SM Station. In August 2016, Baekhyun made his acting debut on the small screen in the historical drama Moon Lovers: Scarlet Heart Ryeo, a South Korean adaptation of the Chinese novel Bu Bu Jing Xin. For his performance in the drama, received a prize like New Star in 2016 SBS Drama Awards. He also collaborated with his labelmates Chen and Xiumin on a soundtrack titled \"For You\" for the drama. In October 2016, along with Chen and Xiumin, Baekhyun became a member of the first official EXO unit, EXO-CBX. His debut was on October 31 with the release of the extended play Hey Mama!. In November 2016, Baekhyun began to participate S.M. Entertainment's League of Legends tournament \"2016 S.M. Super Celeb League\", where he and his labelmate, Heechul, played with professional players and fans from China and South Korea. In February 2017, Baekhyun and Soyou of Sistar released a duet titled \"Rain\" The song peaked at number one on several music charts and achieved an achievement known as \"all-kill\", making it the first artist of S.M. to achieve an \"all-kill\" in 2016 and 2017 with \"Dream\" and \"Rain\", respectively. In April 2017, Baekhyun released a single titled \"Take You Home\" for the second season of SM Station. The song was positioned in the twelve position of Gaon Digital Chart. == Discography == === Singles === Title Year Peak chart positions Sales (DL) Album KOR Gaon Gaon Weekly Digital Chart * * * * * * US World * * As lead artist \"My Turn to Cry\" 2014 — — * KOR: 16,969 Exology Chapter 1: The Lost Planet \"Like Rain, Like Music\" 2015 40 — * KOR: 39,638 2015 Gayo Daejun Limited Edition \"Take You Home\" 2017 12 5 * KOR: 216,651+Cumulative sales for \"Take You Home\": * Collaborations \"The Day We Met\" (as a part of I Am Korea) 2015 — — rowspan=2 \"One Dream One Korea\" (with various artists) 2015 — — \"Dream\" (with Suzy) 2016 1 3 * KOR: 1,360,267 \"The Day\" (with K.Will) 2016 8 21 * KOR: 231,025 S.M. Station Season 1 \"Rain\" (with Soyou) 2017 2 — * KOR: 581,309+Cumulative sales for \"Rain\": * * * Soundtrack appearances \"Dear My Family\" (as part of SM Town) 2012 — — I AM. OST \"Beautiful\" 2015 7 10 * KOR: 215,163Cumulative sales of \"Beautiful\": * * Exo Next Door OST \"For You\" (with Chen & Xiumin) 2016 5 9 * KOR: 625,756Cumulative sales for \"For You\": * * * * Moon Lovers: Scarlet Heart Ryeo OST \"—\" denotes releases that did not chart or were not released in that region. Notes == Filmography == === Dramas === Title Year Network Role Notes To the Beautiful You 2012 SBS Himself Cameo; episode 2 Exo Next Door 2015 Naver TV Cast Baekhyun Main role Moon Lovers: Scarlet Heart Ryeo 2016 SBS Wang Eun Supporting role === Television shows === Title Year Network Role Inkigayo 2014 KBS Co-host === Music videos === Title Year Ref. \"Dear My Family\" 2012 \"Beautiful\" 2015 \"Dream\" 2016 \"The Day\" \"Take You Home\" 2017 Guest appearances \"Twinkle\" 2012 \"Dance with D.O.C\" 2014 \"Sound of Your Heart\" 2016 == Theatre == Title Year Role Notes Singin' in the Rain 2014 Don Lockwood Main role == Awards and nominations == Year Awards Category Nominated work Result 2016 4th YinYueTai V-Chart Awards Most Popular Singer rowspan=\"2\" 1st Asia Artist Awards Popularity Award (Actor) Best Rookie Award Moon Lovers: Scarlet Heart Ryeo'' 8th Melon Music Awards Best R&B;/Soul with Suzy Song of the Year with Suzy 18th Mnet Asian Music Awards Best Collaboration with Suzy HotelsCombined – Song of the Year with Suzy SBS Drama Awards New Star Award 2017 31st Golden Disk Awards Digital Bonsang with Suzy Asian Choice Popularity Award with Suzy 6th Gaon Chart K-Pop Awards Artist of the Year (Digital) – January with Suzy 2017 53rd Baeksang Arts Awards Most Popular Actor (TV) Moon Lovers: Scarlet Heart Ryeo === Music programs === ;Music Bank Year Date Song 2016 January 15 Dream (with Suzy) January 22 ;Inkigayo Year Date Song 2016 January 17 Dream (with Suzy) January 24 January 30 == References == ==Other websites== * Instagram Category:1992 births Category:Exo members Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean singers Category:South Korean television actors",
 "title": "Byun Baek-hyun"
}