{
 "id": "546791",
 "text": "Oh Se-hun (hangul: 오세훈; hanja: 吳世勳; born April 12, 1994 in Seoul) better known by the mononym Sehun is a South Korean rapper, singer, dancer, model and actor. Since 2012, he is a member of the boy band EXO under S.M. Entertainment. == Early years == Sehun was born in Jungnang-gu, Seoul, South Korea on April 12, 1994. He was discovered by a talent agent when he was twelve years old. He joined SM Entertainment after a successful audition on Casting System in 2008. == Career == He was introduced as a Exo's member on January 10, 2012. In april. It officially debuted with the extended play, Mama. Still in April, along with Baekhyun, Chanyeol and Kai, appeared in the video of Girls' Generation-TTS's debut song. On August 17, 2012, he performed with his labelmate, BoA at Music Bank as a dancer in the song \"Only One,\" after Yunho, Eunhyuk and Taemin. In July 2013, he starred in the second episode of the sitcom Royal Villa, along with Chanyeol. In August 2014, he starred in the remake of the music video for \"Yo!\" made for EXO 90:2014. In March 2015, appeared in the music video of Donghae & Eunhyuk's song, \"Can You Feel It?\". In April of the same year, she starred alongside the other EXO members the web series EXO Next Door, also starring actress Moon Ga-young. In May of 2015, appeared in the music video of BoA's \"Who Are You?\". In March 2016, Sehun was confirmed as the male lead in the Korean-Chinese film Catman, playing Liang Qu. In July 2016, he was introduced as the male lead in the Korean-Chinese web-drama Dear Archimedes. In September 2017, he was confirmed as a cast member at the Netflix variety show, Busted!. In February of 2018, he obtained his role as protagonist of Dokgo Rewind, where he plays two twins: Kang Hyuk, a wrestler and Kang Hoo, a shy student. In June 2018, he starred in the web drama Secret Queen Makers, produced by Lotte Duty Free. On September 14, he released \"We Young\" along with Chanyeol as part of Station X 0. == Other works == In January 2016, UNICEF and Louis Vuitton have teamed up for the Make a Promise campaign, Irene Bae and Sehun as role models on the February cover of CeCi magazine. For this campaign, 40 percent of the profits of Louis Vuitton silver bracelet and necklace Sehun and Irene used in the magazine will go to UNICEF to help children in need. Sehun said: \"I want to buy treats for the children and help them not lose hope.\" Irene added: \"I want to continue to participate in campaigns like 'make a promise' to help the children.\" == Discography == Title Year Peak chart positions Sales Album KOR * KOR Kpop Hot 100 * US Billboard World Digital * As lead artist \"We Young\" 2018 72 71 3 *CHN: 241,500+We Young sales in QQ Music: * * * Other appareances \"Beat Maker\" 2014 — — — Exology Chapter 1: The Lost Planet \"—\" denotes releases that did not chart or were not released in that region. == Filmography == === Films === Year Title Role Notes 2015 SMTOWN The Stage Himself Documentary of SM Town. 2018 Catman Liang Qu Main role Dokgo Rewind Kang Hyuk / Kang Hoo === Television shows === Year Title Rol Network Notes 2013 Welcome to Royal Villa Himself JTBC Cameo appearance (Ep. 2) 2018– present Busted! Netflix Regular === Webdramas === Year Title Role Network Notes 2015 EXO Next Door Sehun Naver TV Cast Regular; Fictional character 2016 The Visible SM Himself V Live Ep. 1–4 2018 Secret Queen Makers Sehun Naver TV Cast Main (Ep. 6-7) 2019 Dear Archimedes Yan Su Main role == Awards and nominations == Year Award Category Nominated work Result 2015 5th Gaon Chart K-Pop Awards Weibo Star Award rowspan=\"5\" 2016 6th Gaon Chart K-Pop Awards Artist of Fans' Choice – Individual 2017 5th V Chart Awards Most Popular Artist Tonight Fashionista Awards Global Icon 2018 3rd Asia Artist Awards Best Actor == References == ==Other websites== *Instagram Category:1994 births Category:Actors from Seoul Category:Exo members Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean models Category:South Korean movie actors Category:South Korean singers Category:South Korean television actors t1=all",
 "title": "Oh Se-hun"
}