{
 "id": "546796",
 "text": "Park Chan-yeol (hangul: 박찬열; hanja: 朴燦烈; born November 27, 1992 in Seoul), better known by mononym Chanyeol, is a South Korean rapper, singer-songwriter, producer, actor and model. He is a member of the South Korean boy band EXO. == Early years == Chanyeol was born November 27, 1992 in Seoul, South Korea. After watching the film School of Rock in elementary school, Chanyeol became interested in music and began to play drums. During his teenage years, he studied at Hyundai Senior High School in Apgujeong-dong. He participated in the band of his school, Siren. When he was in his first year of high school, Chanyeol formed a band with his best friends, Heavy Noise, having played in it for three years. At the age of sixteen, he was accepted into a private acting university. In the same year, he reached second position Smart Model Contest and became a trainee of S.M. Entertainment. Also in 2008, he participated in the clip \"HaHaHa Song\" of his companion of company TVXQ. The following year, she appeared in the Japanese version of the video \"Genie\" of the group Girls' Generation. He went on to dream of being a singer after listening to the song \"Unconditional Kismet\" of songwriter and music producer Yoo Young-jin. == Career == === 2012─2014: Early career === On February 22, 2012, Chanyeol was officially introduced as one of the twelve members of the original formation of the South Korean-Chinese group EXO. The group debuted on April 8 of the same year with the release of extended play MAMA. In April 2012, he participated in the music video for the song \"Twinkle\", debut single from the first sub-unit of Girls 'Generation,Girls' Generation-TTS. In October 2013, Chanyeol joined the cast of SBS's Law of the Jungle reality show during filming in Micronesia. He also composed and recorded a soundtrack titled \"Last Hunter\" for the show. In 2014, Chanyeol wrote the rap of the Korean version of the \"Run\" track of EXO's extended extended play, Overdose, and participated in the debut EPs of his companions Henry and Zhou Mi. In May 2014, he became a regular cast member of the first season of the SBS's Roommate reality show. He left the program in September of the same year because of scheduling conflicts. === 2015─present: Debut as an actor and compositions === In April 2015, Chanyeol made his film debut with South Korean film Salut d'Amour alongside actress Moon Ga-young, who later co-starred with him on the EXO Next Door web drama. In June of 2015, cast-wrote the Korean version of the track \"Promise\" of the reissue of the success of sales EXODUS, titled Love Me Right, next to its companions of group Chen and Lay. He later wrote the rap for \"Lightsaber\", the EXO promotional single for Star Wars: The Force Awakening, which was later included in the band's extended play Sing for You. In April 2016, Chanyeol wrote and performed rap for the song \"Confession\" of Yesung's debut EP, Here I Am. On EXO's third studio album, EX'ACT, released in May 2016, he co-wrote the lyrics for the track \"Heaven.\" In June 2016, Chanyeol starred with actresses Yuan Shanshan and Seohyun in the South Korean-Chinese film So I Married an Anti-fan. He and Yuan Shanshan also recorded a duet titled \"I Hate You\" as the soundtrack for the film. In October 2016, Chanyeol and singer Tinashe participated in the song \"Freal Luv\" by artists Far East Movement and Marshmello. The song, which he helped write and produce, was released on October 14. In December 2016, she collaborated with singer Punch on the song \"Stay With Me,\" part of the soundtrack for the Goblin drama. In January of 2017, Chanyeol participated in the drama Missing 9. On February 22, he released a duet titled \"Let Me Love You\" with Junggigo. ==Discography== === Songs === Title Year Peak chart positions Sales (DL) Album KOR Gaon * * * * * CHN V Chart MAL * US World Billboard World Digital Song Sales: * As lead artist \"Delight\" 2014 — — — — * KOR: 12,096 Exology Chapter 1: The Lost Planet Collaborations \"If We Love Again\" 2016 38 — — — *KOR: 47,208 Two Yoo Project Sugar Man Part 32 \"Let Me Love You\" (with Junggigo) 2017 16 — — — * KOR: 101,508+Cumulative sales for \"Let Me Love You\": * * Across the Universe As featured artist \"Bad Girl\" 2014 75 — — — *KOR: 27,192 Fantastic \"Rewind\" — — — 5 Rewind \"Don't Make Money\" 2015 43 — — — *KOR: 60,192Cumulative sales for \"Don't Make Money\": * * Unpretty Rapstar 2 Semi-final Part 1 \"Confession\" 2016 133 — — — * KOR: 21,890Sales references for \"Confession\": * Here I Am \"Freal Luv\" — — — — * KOR: 22,665Cumulative sales for \"Freal Luv\": * * Identity Soundtrack appearances \"Last Hunter\" 2016 — — — — Law of the Jungle OST \"I Hate You\" — 11 — — So I Married an Anti-fan OST \"Stay With Me\" (with Punch) 3 — 12 3 * KOR: 1,379,207+Cumulative sales for \"Stay With Me\": * * * * * Guardian: The Lonely and Great God OST \"—\" denotes releases that did not chart or were not released in that region. ===Songwriting and producing credits=== Year Album Artist Song Lyrics Music Credited With Credited With 2014 EXO-K \"Run\" 2015 Chanyeol \"Last Hunter\" \"Who I Am\" \"Young Street\" Heize ft. Chanyeol \"Don't Make Money\" Exo \"Promise\" Chen & Lay \"Lightsaber\" 2016 Chanyeol \"You Are\" Yesung \"Confession\" Exo \"Heaven\" Min Yeon-jae \"Heaven\" Min Yeon-jae, Wang Jung-un Far East Movement and Marshmello ft. Chanyeol & Tinashe \"Freal Luv\" Kevin Nishimura, J. Roh, Virman Coquia, C. Comstock, Tinashe, William Phillips Kevin Nishimura, J. Roh, Virman Coquia, C. Comstock, Tinashe, William Phillips ==Filmography== ===Films=== Title Year Role Notes Salut d'Amour 2015 Min-sung Supporting role So I Married an Anti-fan 2016 Hoo Joon Lead role ===Television dramas=== Title Year Network Role Notes High Kick! 2008 KBS2 High school student Cameo; episode 71 To The Beautiful You 2012 SBS Himself Cameo; episode 2 Royal Villa 2013 jTBC Himself Cameo; episode 2 Exo Next Door 2015 Naver TV Cast Chanyeol Main role Missing 9 2017 MBC Lee Yeol Supporting role ===Television shows=== Title Year Network Role Note Law of the Jungle 2014 SBS Recurring cast Episodes 90-94 Roommate 2014 SBS Main cast Season 1 Law of the Jungle 2015 SBS Recurring cast Episodes 175-177 ===Music videos=== Title Year Ref. \"1-4-3 (I Love You)\" 2013 \"I Hate You\" 2016 \"Freal Luv\" \"Stay with Me\" Guest appearances Guest appearances Guest appearances \"HaHaHa Song\" 2008 \"Genie\" 2010 \"Twinkle\" 2012 \"You Don't Know Love\" 2013 \"Hope\" 2014 \"Can You Feel It?\" 2015 \"12:25 (Wish List)\" ==Awards and nominations== Year Award Category Nominated work Result Ref. 2015 8th Korea Drama Awards Best New Actor Exo Next Door Hallyu Star Award 2016 16th Top Chinese Music Awards Most Popular Foreign Idol 2017 5th YinYueTai VChart Awards Best Collaboration \"I Hate You\" Most Popular Artist (South Korea) == Notes == == References == ==Other websites== * Instagram Category:1992 births Category:Actors from Seoul Category:Exo members Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean models Category:South Korean movie actors Category:South Korean singer-songwriters Category:South Korean television actors",
 "title": "Park Chan-yeol"
}