{
 "id": "546794",
 "text": "Kim Jun-myeon (born May 22, 1991), better known by his stage name Suho, is a South Korean singer-songwriter and actor. He is a member of the South Korean boy band EXO. == Biography == === 1991─2011: Pre-debut === Suho was born on May 22, 1991 in Seoul, South Korea. He joined S.M. Entertainment through S.M. Casting System when he was 15 years old. He spent seven years there but was inactive for a year because he had injured his leg. He attended Seoul Performing Arts High School and Korea National University of Arts. === 2012–present: Debut with EXO === He was the ninth member to be revealed on February 14, 2012 as the leader of EXO subunit; EXO- K. He appeared in the teaser number 16 with his bandmate D.O. === 2007─present: Solo career === He began acting in 2007. He had a part in the Movie Super Junior Attack on the Pin-Up Boys as an extra. He appeared in the music video of TVXQ's \"HAHAHA Song\" in 2008. In 2013, he was in the drama Prime Minister and I as Han Tae- woong in episodes 10 and 12. In the same year, he was a voice actor in Saving Santa with Eunji of Apink, From February 2014 to December of 2013, he was the host of the musical program Inkigayo along with his bandmate Baekhyun. In January 2015, Suho played the role of Hans in the musical School Oz. It was produced by S.M. EntertainmentHis bandmate Xiumin and several S.M. artists including Key, Luna and Seulgi also performed . In April 2015, he starred in the movie Glory Days as Ji-soo and Shinwa's member Dongwan. From April 10 to May 1, 2015, Suho was on the KBS television program Fluttering India with other artists including Kyuhyun, Minho, Sungkyu and Lee Jong-hyun. In February 2016, Suho made a special appearance in the music video of Jo Kwon. It was their debut single as a solo singer, \"Crossroad\". In April of the same year, it was announced that Suho be a part of the web drama How Are You Bread. The series was broadcast in Korea and China during the middle of 2016. == Discography == === Songs === ==== As lead artist ==== Year Title Peak charts position Sales (DL) Album KOR Gaon CHN Baidu 2014 \"Beautiful\" 75 — * KOR: 18,675+ Exology Chapter 1: The Lost Planet \"—\" It indicates that the release is not positioned in the list or not released in that region. ==== Collaborations ==== Year Title Peak charts position Sales (DL) Album KOR Gaon CHN Baidu 2016 \"My Hero\" (with Leeteuk, Kassy & Cho Yeong-su) — — \"—\" It indicates that the release is not positioned in the list or not releaed in that region. ==== Sountrack appearances ==== Year Title Peak charts position Sales (DL) Album KOR Gaon CHN Baidu 2013 \"Saving Santa\" (with Eun-ji) — — Saving Santa OST 2016 \"Beautiful Accident\" (with Chen) — — Beautiful Accident OST \"—\" It indicates that the release is not positioned in the list or not released in that region. == Filmography == === Films === Year Title Role Notes 2013 Saving Santa Bernard (voice) Korean dub; lead role 2016 One Way Trip Sang-Woo Lead role === Dramas === Year Title Network Role Notes 2012 To the Beautiful You SBS Himself Cameo 2014 Prime Minister and I KBS2 Han Tae-woong Cameo; episodes 10-12 2015 Exo Next Door Naver TV Cast Suho Recurring; Fictional version of himself 2016 How Are You Bread Naver TV Cast Han Do-woo Lead role === Television shows === Year Title Network Role Notes 2013 Idol Star Athletics Championships MBC Competitor Star King SBS Guest Episode 323, 324 and 326 Hello Counselor KBS Episode 131 Immortal Songs 2 KBS Episode 114 Beatles Code 2 Mnet Idol Star Athletics Championships MBC Competitor We Got Married MBC Guest Episode 32 Show Champion MBC Music Guest host 2014 Inkigayo SBS Regular host 2015 Idol Star Athletics Championships MBC Guest Fluttering India KBS Main cast M! Countdown Mnet Guest host Problematic Men TVN Guest Episode 10 King of Mask Singer MBC Star King SBS Showbiz Korea Arirang What's The Deal, Mom? MBC Episode 2 2016 Entertainment Weekly KBS Fantastic Duo SBS Episodes 3 and 4 Duet Song Festival MBC Episode 10 Happy Together KBS with Chanyeol and Chen | |- |Hello Counselor |KBS |Episode 349 |with [Sehun] ===Music videos appearances=== Year Title Artist 2008 \"HaHaHa Song\" TVXQ 2014 \"To Mother\" '' G.O.D. \"Saving Santa\" Suho & Eunji 2015 \"12:25 (Wish List)\" f(x) 2016 \"Crosswalk\" Jo Kwon \"My Hero\" Suho, Leeteuk & Kassy \"Beautiful Accident\" Suho & Chen == Musical theatre == Year Title Role Notes 2015 School OZ Hans Main role == Awards and nominations == Year Award Category Nominated work Result 2016 52nd Baeksang Arts Awards Most Popular Actor (Film) One Way Trip == References == ==Other websites== * * Category:1991 births Category:Actors from Seoul Category:Exo members Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean movie actors Category:South Korean singer-songwriters Category:South Korean stage actors Category:South Korean television actors Category:South Korean voice actors",
 "title": "Suho"
}