{
 "id": "546756",
 "text": "The San Mateo–Hayward Bridge (commonly called the San Mateo Bridge) is a bridge crossing the U.S. state of California's San Francisco Bay. It provides a link of the San Francisco Peninsula with the East Bay. The bridge's west end is in Foster City, a suburb on the eastern edge of San Mateo. The east end of the bridge is in Hayward. It is the longest bridge in California and the 25th longest in the world. The bridge is owned by the state of California, and is maintained by Caltrans, the state highway agency. It is also managed by the Bay Area Toll Authority. The bridge is part of State Route 92, whose western end is at Half Moon Bay on the Pacific coast. It links Interstate 880 in the East Bay with U.S. Route 101 on the Peninsula. It is roughly parallel to and lies between the San Francisco–Oakland Bay Bridge and the Dumbarton Bridge. Drivers sometimes use it to avoid traffic delays on the other two bridges. ==Tolls== Drivers have to pay a toll when they drive west on the bridge (from Hayward to San Mateo). Tolls are collected at a toll plaza on the east side of the bridge. All toll is collected electronically since 2020. Drivers can use the FasTrak electronic toll collection device, pay online, or pay automatically when a machine scans their license plate. Since 2025, the toll rate for passenger cars is $8. ==References== ==Other websites== * Bay Area Toll Authority bridge facts * Bridge at the California Department of Transportation website (page describes several \"planned\" improvements which have already been implemented) * official project links at DOT website * FasTrak – San Mateo–Hayward Bridge * tolls at 511.org transportation information website * The Times of San Mateo ran a special commemorative issue on 1967-10-19 detailing the construction of the 1967 orthotropic span. * (has scans of old postcards depicting the 1929 span) * * Provides a contemporary account of original (1929) bridge construction. * Category:1929 establishments in California Category:Bridges in the San Francisco Bay Area",
 "title": "San Mateo–Hayward Bridge"
}