{
 "id": "546780",
 "text": "Kim Min-seok (born March 26, 1990) known by his artistic name Xiumin is a singer, dancer, model and actor South Korean. He is a member of the boy band EXO. == Early years == Xiumin was born in Guri, Gyeonggi, South Korea on March 26, 1990. He was a student of the Catholic Kwandong University where he attended a seminar and gave a presentation to students of applied music. Xiumin attended at the same school in where studying Dongwoo of INFINITE. Xiumin is trained in martial arts and is competent in Kendo, Wushu, Taekwondo and fencing. == Career == === EXO === In 2008, at the age of 18, he joined S.M. Entertainment after winning second place in S.M. Everysing Contest. Xiumin was the seventh member to be revealed as a member of the EXO group after making a teaser set with Kai on January 26, 2012. === Solo activities === In 2013, Xiumin appeared in the video for \"Gone\" by Lovelyz's Jin, with to the actress Kim Yoo-jung. In January 2015, the acted in the musical S.M. Entertainment School Oz acting the role of Aquila along with f(x)'s Luna, Shinee's Key, fellow Suho, TVXQ's Changmin and Red Velvet's Seulgi. In October, 2015, Xiumin was the main protagonist of the web-drama Falling for Challenge together with Kim So-eun. He released the You Are The One OST for the drama. == Discography == Year Title Peak positions KOR CHN Gaon Baidu 2015 \"You Are The One\" 62 2 2016 \"Call You Bae\" (Jimin featuring Xiumin) 5 — \"—\" indicates that the released was not positioned in the list or was not released in the region. == Filmography == === Movie === Year Title Rol Notes 2016 Kim Seon-dal Gyeon Support === Dramas === Year Title Rol Network Notes 2015 EXO Next Door Naver TV Cast Xiumin Recurrent Falling For Challenge Na Do Jun Main === Appareances in musical videos === Year Artist Title Notes 2013 JIN (Lovelyz) \"Gone\" 2014 Lim Chang Jung \"A Glass Of Soju\" EXO 90:2014 MV Remake 2015 He \"You Are The One\" Falling for Challenge OST === Musicals === Year Title Rol Notes 2015 School OZ Aquila Musical hologram by S.M. Entertainment == References == ==Other websites== * EXO in Korean * EXO in Japanese Category:1990 births Category:Exo members Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean models Category:South Korean movie actors Category:South Korean singers Category:South Korean television actors",
 "title": "Xiumin"
}