{
 "id": "546880",
 "text": "Special Order 191 was issued by Robert E. Lee in early September 1862. It was a handwritten order detailing Lee's planned troop movements during his Maryland Campaign intended to win the American Civil War. The document was recovered by Union soldiers and passed on to Major general George B. McClellan. This was a piece of intelligence few battle commanders are ever lucky enough to receive.A House Divided During the Civil War Era, eds. Rodney P Carlisle; J Geoffrey Golson (Santa Barbara, CA: ABC-CLIO, 2007), p. 60 It gave the details of how Lee had weakened his forces by splitting them up into several columns. It also laid out where each part of his army was to be at any given time. McClellan, usually very slow to act, moved his forces more quickly this time. By the night of September 14, 1862, Lee was no longer following his plan of attack.Donald R Jermann, Antietam: The Lost Order (Gretna, LA: Pelican Publishing Co., 2006), p. 173 He was now reacting to McClellan's troop movements. At this point Lee's main problem became how to keep his army from being destroyed. == Background == Following his success at the Second Battle of Bull Run (also called the Second Battle of Manassas), Lee made plans to invade the North. Lee thought that if he took the Civil War to the Union states, a major victory might convince Great Britain and France to support the South. He also thought it would make the North sue for peace. This would insure the Confederate States of America could remain an independent country. Lee led his Army of Northern Virginia into Maryland on September 4, 1862. He concentrated his army at Frederick, Maryland, about northwest of Washington, D.C. The story of the lost order 191 and the events of early September 1862 revolve around two sheets of paper. == September 7–9 == Lee's army was camped near Frederick on September 7. General J.E.B. Stuart's three cavalry brigades had been given the task of forming a screen (protective line) between the encampment and the Union Army to their east.Jeffry D. Wert, Cavalryman of the Lost Cause: A Biography of J. E. B. Stuart (New York: Simon & Schuster, 2008), p. 140 Lee met with his generals suggesting to James Longstreet that he should surround Harpers Ferry Armory and attack the large Union garrison which was threatening their supply lines to their rear. Longstreet objected saying his troops needed rest from the long march. He also pointed out it was a bad idea to split Lee's forces when they were so close to the enemy. If the Union army discovered Lee had weakened his main force, they might attack in force. Once rested, organized and fully supplied, Lee's army could do what it wanted. After the meeting, Longstreet assumed Lee had given up the risky Harpers Ferry scheme. A day or two later, Longstreet entered Lee's tent. He found Lee and General Stonewall Jackson finalizing the plan to attack Harpers Ferry. Longstreet realized the plan had gone ahead without him. Reluctantly, he went along with the plan. On September 9, Lee wrote out the details of the plan in Special Order 191. == Order 191 text == Each of Lee's commanders received a copy of the handwritten order. Hill already had been sent a copy of the order from Lee. He did not know a second copy had been sent to him from Jackson. This is the copy that was lost. == Lost order found == On September 13, while about south of Frederick, Maryland, Corporal Barton W. Mitchell of the 27th Indiana Volunteers (Union Army) found several cigars wrapped inside some paper. The paper turned out to be Special Order 191.He gave the order to his sergeant who went with Mitchell to the Regiment's colonel, SIlas Colgrove, who in turn passed it up the chain of command to General McClellan. It was in McClellan's hands the same day. Whether the Order of the 9th was intentionally dropped at Mitchell's feet by a passer-by, or lost by accident, remains a question of fact. Given the text of the lost order the ordinary reader of English would reasonably think that the enemy meant to concentrate behind the South Mountain, to attack the Union Army if it moved in the direction of Crampton's Gap to reach Harper's Ferry. In consequence it was reasonable for McClellan to direct the movement of the Union Army's main body in the direction of Boonsboro, the enemy's apparent concentration point, to meet the enemy head on. In doing this, McClellan gave the enemy time to induce the Union garrison at Harper's Ferry to surrender, thereby clearing Lee's line of retreat from Sharpsburg, the place General Lee had chosen before he left Frederick to engage the Union army in a general battle. == Notes == == References == == Other websites == * Special Orders 191, YouTube * Brooke Tyler Higgins, Three Cigars, Cedarville University Category:American Civil War Category:Maryland Campaign Category:1862 in the United States Category:September 1862 events",
 "title": "Special Order 191"
}