{
 "id": "54681",
 "text": "Prokaryotes (or Monera) are some of the simplest living things.Excluding viruses They are unicellular organisms and they include two major divisions of simple living beings: bacteria, and Archaea.The word 'prokaryote' describes a type of cell. The name comes from Greek pro- (meaning before) and karion, meaning nut or kernel. They generally do not have a cell nucleus, nuclear membrane or cell organelles, however a small number of exceptions have been found. Prokaryotes possess genetic material in the form of a single DNA loop called a Nucleoid that floats around freely inside the cell. Bacteria include the Cyanobacteria (formerly known as blue-green algae due to their photosynthetic capacity). Some form biofilms that are somewhat like multicellular organisms. Besides a nucleus, prokaryotes lack other things eukaryotes (cells with a true nucleus) have. They reproduce without fusion of gametes. They do not have membranes. This means that there are no vacuoles, Golgi apparatus, endoplasmic reticula or other organelles inside the cell. However, they do have ribosomes, though of a simpler kind than eukaryotes. Eukaryote cells include organelles which were once free-living prokaryotes. == Taxonomy == In 1977, Carl Woese proposed dividing prokaryotes into the Bacteria and Archaea (originally Eubacteria and Archaebacteria) because of the major differences in the structure and genetics between the two groups of organisms. This arrangement of Eukaryota (also called \"Eukarya\"), Bacteria, and Archaea is called the three-domain system, replacing the traditional two- empire system. The Archaea include simple organisms which were first discovered in extreme environments. Most of them can survive at very high or very low temperatures. Some of them can also survive in highly salty, acidic or alkaline water. Some have been found in geysers, black smokers or oil wells. The prokaryotes may not be a monophyletic, taxonomic group of common descent, but merely a group of similar organisms. The relationships between Archaea, Eubacteria and Eukaryota are assessed differently by different scientists. The three-domain system of Carl Woese treats them as one monophyletic group. == References == Category:Cell biology",
 "title": "Prokaryote"
}