{
 "id": "546986",
 "text": "{{Infobox settlement | official_name = Arica y Parinacota Region | native_name = Región de Arica y Parinacota | native_name_lang = es | settlement_type = Region of Chile | seat_type = Capital | seat = Arica | coordinates = | subdivision_type = Country | subdivision_name = | parts_type = Provinces | parts = Arica, Parinacota | leader_title = Intendant | leader_name = Roberto Erpel | leader_party = UDI | image_skyline = 20120623 Chile 2759 Volcano Parinacota (7704192574).jpg | image_caption = Parinacota Volcano and Chungará Lake | image_flag = Flag of Arica y Parinacota, Chile.svg | flag_size = 120px | flag_alt = Flag of Arica y Parinacota Region | image_shield = Coat of arms of Arica y Parinacota, Chile.svg | shield_size = 75px | shield_alt = Coat of Arms of Arica y Parinacota Region | image_map = Arica y Parinacota in Chile 2018.svg | mapsize = 250px | map_caption = Map of Arica y Parinacota Region | area_total_km2 = 16873.3 | area_footnotes = | area_rank = 12 | elevation_min_footnotes = | elevation_max_footnotes = |elevation_max_point= Parinacota Volcano | elevation_max_m = 6342 | elevation_min_m = 0 | population_total = 224548 | population_as_of = 2017 | population_footnotes = | population_rank = 14 | population_density_km2 = auto | blank_name_sec1 = HDI (2019) | blank_info_sec1 = 0.882 | website = | iso_code = CL-AP | footnotes = }} The XV Arica and Parinacota Region () is one of Chile's 15 first order administrative divisions. It is the country's newest region, created under Law 20.175. It became operational on 8 October 2007. ==History== Chile's former Tarapacá region was a former Peruvian province, which was occupied by Chile under the 1883 Treaty of Ancón at the close of the War of the Pacific, and then formally annexed in 1929 by the Treaty of Lima. ==Geography== The Arica and Parinacota borders Peru to the north, Bolivia to the east and Chile's Tarapacá region to the south. The region is within the Norte Grande (Far North) natural region. It combines deserts, green valleys, the steep and volcanic Andes mountains, and the Altiplano (high plain) to the east. A narrow coastal strip of low-lying land no more than wide separates the Pacific's Nazca plate from the Andes. Its Parinacota volcano is the region's highest elevation at and is on the northern border with Bolivia in Lauca National Park. The two main rivers of the region are the Lauca, which flows into the Coipasa lake in Bolivia, and the Lluta, which flows into the Pacific Ocean. Lake Chungará at above sea level ranks as one of the highest in the world ==Population== As of 2015, there were (estimated) 239,126 persons living in the region, for a population density of inhabitants/km². The largest city in the region is Arica, with 210,936 inhabitants. ==Administration== In 2007, the region was subdivided to create the Arica y Parinacota region and the present day Tarapacá Region to the south. The region is further subdivided into two provinces: Arica and Parinacota. Arica and Parinacota Region - Provinces and comunas Province Code Comuna Area (km²) Population (2002) Arica (151) 15101 Arica 4,799.4 185,268 15102 Camarones 3,927.0 1,220 Total of the Arica province Total of the Arica province Total of the Arica province 8,726.4 186,488 Parinacota (152) 15201 Putre 5,902.5 1,977 15202 General Lagos 2,244.4 1,179 Total of the Parinacota province Total of the Parinacota province Total of the Parinacota province 8,146.9 3,156 ==Related pages== *Atacama Desert *Regions of Chile ==References== ==Other websites== * Territorial division of Chile * Official website of the Local Government * Arica Region",
 "title": "Arica y Parinacota Region"
}