{
 "id": "547250",
 "text": "Betty Reid Soskin (nee Charbonnet; born September 22, 1921) is a retired African-American Park Ranger with the National Park Service. Soskin spoke clearly about how important national parks are. She said national parks are very important for telling American history. She helped to develop the Rosie the Riveter/World War II Home Front National Historical Park in Richmond, California.WWII meant opportunity for many women, oppression for others, by Caroline Zynco, San Francisco Chronicle, September 26, 2007, retrieved March 23, 2011Ranger's voice spans East Bay history, by Lee Hildebrand, San Francisco Chronicle, January 31, 2010, retrieved March 23, 2011 She works there as a ranger. Until her retirement in 2022 at aged 100, she was the oldest National Park Ranger in the United States. == Famous For == Soskin was most famous for being a guide at the Rosie the Riveter World War II National Park. She talked about how the story of World War II that we hear was mainly white and male. She also supports national parks and how they educate the public. She also talks about her and her family's experiences with racism. On March 31, 2022, Soskin retired from the National Park Service. == Early life and family == Soskin was born on September 22, 1921, in Detroit, Michigan. She was a mix of Spanish, French, and African, but identified as black. Betty married Mel Reid and they had four kids shortly after graduating high school. She experienced racism and decided to get involved in the civil rights movement. The couple started a business called Reid’s Records in 1945. They got a divorce after about 30 years of being married. Soskin then married Bill Soskin in 1976 but their marriage ended after just four years. She later worked to make less drugs and crime in Berkeley, California after that. She got a job as a businesswoman. After, she helped plan the Rosie the Riveter and World War II National Park in Richmond, California. Soskin turned 100 in September 2021.School named after National Park Ranger Betty Reid Soskin on her 100th birthday ==References== ==Other websites== * Betty Reid Soskin: Rosie the Riveter World War II American Homefront Oral History Project * Reid's Records *Official website for Soskin's memoir Category:1921 births Category:Living people Category:American centenarians Category:Businesspeople from San Francisco Category:Businesspeople from Berkeley, California Category:American civil rights activists Category:Educators from Berkeley, California Category:Educators from San Francisco",
 "title": "Betty Reid Soskin"
}