{
 "id": "547262",
 "text": "The following is a list of notable deaths in July 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==July== ===1=== *Yves Bonnefoy, 93, French poet.French poet Yves Bonnefoy dies *Robin Hardy, 86, British film director (The Wicker Man).The Wicker Man director Robin Hardy dies *Odette Krempin, 42, Congolese entrepreneur and philanthropist.Odette Maniema Krempin ist tot *Mary Mostert, 87, American author.Mary Mostert ===2=== *Caroline Aherne, 52, English comedian, actress and writer (The Royle Family, The Mrs Merton Show, The Fast Show), throat cancer.Caroline Aherne: Royle Family writer and actress dies aged 52 *Roscoe Brown, 94, American World War II veteran, member of the Tuskegee Airmen.World War II Hero Dr. Roscoe C. Brown Dies at 94 *Kyle Calloway, 29, American football player (Buffalo Bills), struck by train.Former Bills OL Calloway Dies at 29 After Being Struck by Train *Michael Cimino, 77, American screenwriter and director (The Deer Hunter, Thunderbolt and Lightfoot, Heaven's Gate).Michael Cimino, Oscar- Winning Director of 'The Deer Hunter,' Dies at 77 *Roger Dumas, 84, French comedian and actor (That Man from Rio, Le Concert, The First Day of the Rest of Your Life).The actor Roger Dumas died *Horacio Etchegoyen, 97, Argentine psychoanalyst.Dr. R. Horacio Etchegoyen 1919 – 2016 *Rudolf E. Kálmán, 86, Hungarian-born American electrical engineer (Kalman filter).Remembering Rudolf E. Kalman (1930–2016) *Clementia Killewald, 62, German Benedictine nun.Äbtissin Clementia Killewald OSB am 2. Juli heimgegangen – R.i.p. *Patrick Manning, 69, Trinidadian politician, Prime Minister (1991–1995, 2001–2010), acute myeloid leukemia.Former Trinidad prime minister Patrick Manning dies *Lalit Mohan Nath, 80, Bangladeshi nuclear physicist. *Harold \"H\" Nelson, 88, British cycling coach.Harold Nelson MBE *Robert Nye, 77, British poet.Poet and award-winning Falstaff novelist Robert Nye dies aged 77 *Michel Rocard, 85, French politician, Prime Minister (1988–1991).French ex-PM Michel Rocard dies aged 85 *Flavio Romero de Velasco, 90, Mexican lawyer and politician, Governor of Jalisco (1977–1983).Fallece ex gobernador Flavio Romero *Jack C. Taylor, 94, American billionaire businessman, founder of Enterprise Rent-A-Car.Enterprise holding founder Jack Taylor dies *Elie Wiesel, 87, Romanian-born American writer (Night), political activist and Holocaust survivor, Nobel winner(1986).Elie Wiesel, Nobel Peace Prize laureate and renowned Holocaust survivor, dies at 87 ===3=== *Michael Beaumont, 22nd Seigneur of Sark, 88, British aristocrat, Seigneur of Sark (since 1974).Seneschal of Sark sends condolences to Beaumont family on behalf of islanders *Gilbert Bulawan, 29, Filipino basketball player (Blackwater Elite), heart attack.Blackwater's Bulawan dies of heart attack *Lou Fontinato, 84, Canadian ice hockey player (New York Rangers, Montreal Canadiens).Lou Fontinato known for soft heart, cement fists *Noel Neill, 95, American actress (Superman).Noel Neill, actress who played Lois Lane, dead at 95 ===4=== *Romesh Chandra, 97, Indian activist and news editor (Communist Party of India), President of the World Peace Council (1977–1990).CPI Leader Romesh Chandra Dead *Abbas Kiarostami, 76, Iranian movie director and screenwriter (Close-Up, Taste of Cherry, Certified Copy), gastrointestinal cancer.Abbas Kiarostami, Palme d'Or-winning Iranian film-maker, dies aged 76 *Abner J. Mikva, 90, American politician and judge, member of the United States House of Representatives from Illinois's 2nd and 10th congressional districts (1969–1973, 1975–1979), U.S. Court of Appeals for the D.C. Circuit (1979–1994), complications from bladder cancer.Chicago political icon Abner Mikva dies at 90 *Rondon Pacheco, 96, Brazilian politician, Governor of Minas Gerais (1971–1975), pneumonia.Rondon Pacheco morre em Uberlândia aos 96 anos ===5=== *Sayed Hussein Anwari, 60, Afghan politician, MP (since 2005), Governor of Herat Province (2005–2009), cancer.Top Afghan Jihadi leader Syed Hussain Anwari dies from cancer in India *William L. Armstrong, 79, American politician, United States Senator (1979-1991) and member of the United States House of Representatives from Colorado's 5th congressional district (1973–1979), cancer.William Armstrong, Conservative Voice in Senate, Dies at 79 *Beatrice de Cardi, 102, British archaeologist, complications from a fall.Beatrice de Cardi, archaeologist – obituary *Zdeněk Neubauer, 74, Czech philosopher and biologist.Zemřel Havlův přítel, biolog a filozof Zdeněk Neubauer *Gladys Nordenstrom, 92, American composer.Schott/EAM, 'Gladys Nordenstrom Krenek (1924-2016)'. *Brian White, 59, British politician, MP (1997–2005), oesophageal cancer.'People's councillor' Brian White dies at the age of 59 *Victor P. Whittaker, 97, British biochemist.Whittaker *Valentino Zeichen, 78, Italian poet and author.È morto Valentino Zeichen, un poeta dandy e paradossale ===6=== *Bukky Ajayi, 82, Nigerian actress (Mother of George).Veteran actress Bukky Ajayi dies at 82 *Armando León Bejarano, 100, Mexican politician, Governor of Morelos (1976–1982).Muere Armando León Bejarano, ex gobernador de Morelos *John McMartin, 86, American actor (Sweet Charity, Kinsey, Law & Order), cancer.Broadway Actor John McMartin Dies at 86 *Turgay Şeren, 84, Turkish footballer (Galatasaray).Turkey's legendary goalkeeper Turgay Şeren dies at age 84 ===7=== *Sally Beauman, 71, British writer (Rebecca's Tale, The Landscape of Love), pneumonia.Sally Beauman, Author Whose Advance Set a Record, Dies at 71 *Anita Reeves, 68, Irish actress (Dancing at Lughnasa, Little Gem), cancer.Theatre actress Anita Reeves dies aged 67 *Wolfram Siebeck, 87, German journalist and food critic.Germany's culinary conscience, Wolfram Siebeck, dies aged 87 ===8=== *Abdul Sattar Edhi, 88, Pakistani philanthropist, social activist, ascetic and humanitarian, founder of the Edhi Foundation.Celebrated humanitarian Abdul Sattar Edhi passes away in Karachi *Turk Lown, 92, American baseball player (Chicago Cubs, Chicago White Sox, Cincinnati Reds), leukemia.Turk Lown Obituary *William Lucas, 91, British actor (The Adventures of Black Beauty).William Lucas obituary *William H. McNeill, 98, Canadian-American historian and author. *Steve Owens, 59, Canadian politician, Ontario MPP (1990–1995). *Howard Raiffa, 92, American academic.Harvard remembers Howard Raiffa *Jacques Rouffio, 87, French movie director (Sept morts sur ordonnance, Le Sucre) and screenwriter (My Brother-in-Law Killed My Sister).Décès du réalisateur Jacques Rouffio ===9=== *Johnny Barnes, 93, Bermudian entertainer.'Mr Happy' Barnes dies at 93 *Hasan Basri Durin, 81, Indonesian politician, Minister of Agrarian Affairs (1998–1999), Governor of West Sumatra (1987–1997), Mayor of Padang (1971–1983).Former W.Sumatra gov, agrarian minister Hasan Basri Durin passes away *Geneviève Castrée, 35, Canadian musician and comic book artist, pancreatic cancer.Geneviève Elverum Has Died *Bill Guilfoile, 84, American public relations executive (Baseball Hall of Fame, New York Yankees, Pittsburgh Pirates).William J. Guilfoile (1931–2016) *Gladys Hooper, 113, English supercentenarian, nation's oldest living person.UK's oldest person, Gladys Hooper, dies aged 113 *Hugo Niebeling, 85, German filmmaker (Alvorada). Hugo Niebeling Hollywood ehrt Wegbereiter des Musikvideos *Sydney Schanberg, 82, American journalist (The New York Times), winner of the Pulitzer Prize for International Reporting (1976).Sydney H. Schanberg Is Dead at 82; Former Times Correspondent Chronicled Terror of 1970s Cambodia ===10=== *Abu Omar al- Shishani, 30, Soviet-born Georgian ISIS militant, airstrike.Isis confirms death of hugely popular minister of war omar al shishani *Katharina Focke, 93, German politician, Federal Minister for Youth, Family and Health (1972–1976). *Alfred G. Knudson, 93, American geneticist.Acclaimed Fox Chase geneticist dies at 93 *Kem Ley, 45, Cambodian political analyst, shot.Prominent Cambodian political critic shot dead ===11=== *John Brademas, 89, American politician and educator, member of the U.S. House of Representatives for Indiana's 3rd district (1959–1981), President of NYU (1981–1991).John Brademas, Indiana Congressman and N.Y.U. President, Dies at 89 *Edmond L. Browning, 87, American Episcopal bishop, Presiding Bishop of the Episcopal Church (1985–1997).Death of former Episcopal Church Presiding Bishop Edmond Lee Browning *Emma Cohen, 69, Spanish actress (The Glass Ceiling, Voyage to Nowhere, The Grandfather), cancer.Actress Emma Cohen dies at 69 *Corrado Farina, 77, Italian movie director, screenwriter (Baba Yaga) and novelist.E' morto Corrado Farina, una vita per il cinema *Jim Metzen, 72, American politician, member (since 1987) and President (2003–2011) of the Minnesota Senate, and House of Representatives (1975–1987), lung cancer.Lifelong friend of hockey Jim Metzen, S. St. Paul state senator, dies *Jusztin Nándor Takács, 89, Hungarian Roman Catholic prelate, Bishop of Székesfehérvár (1991–2003).Bishop Jusztin Nándor Takács, O.C.D. † *Scott Olin Wright, 93, American judge, member of the U.S. District Court for Western Missouri (since 1979).Federal Judge Scott O. Wright Dies At 93 ===12=== *Galina Chesnokova, 82, Russian Soviet-era volleyball player (national team), European champion (1963).Ушла из жизни чемпионка Европы 1963 года Галина Чеснокова *Seamon Glass, 90, American actor (This Is Not a Test, Deliverance, Perry Mason).Seamon Glass *Goran Hadžić, 57, Serbian politician, President of Krajina (1992–1994), brain cancer. *Peter Johnson, 78, Australian rugby union player.Australia in mourning after death of former captain Johnson *Kyosen Ōhashi, 82, Japanese television host and politician, acute respiratory failure.Kyosen Ohashi, the charming TV star who led a charmed life ===13=== *Héctor Babenco, 70, Argentine-born Brazilian movie director, producer and screenwriter (Kiss of the Spider Woman, Ironweed, Carandiru), heart attack.Héctor Babenco, Director of Oscar-Winning ‘Kiss of the Spider Woman,’ Dies at 70 *Marion Campbell, 87, American football player and coach (Philadelphia Eagles, Atlanta Falcons).Former Eagles head coach Marion Campbell dies at 87 *Robert Fano, 98, Italian-born American computer scientist.Robert Fano, computing pioneer and founder of CSAIL, dies at 98 *Hollis L. Harris, 84, American airline executive, CEO of Continental Airlines (1990–1991) and Air Canada (1992–1996), President of Delta Airlines (1987–1990).Former Delta President Hollis Harris Has Died *El Lebrijano, 74, Spanish flamenco singer.El Lebrijano, Innovative Flamenco Singer, Dies at 75 *Bernardo Provenzano, 83, Italian criminal, head of the Corleonesi Mafia faction, complications from bladder cancer.Italian mafia boss, 83, dies in jail *Carolyn See, 82, American author (Golden Days), cancer.Carolyn See, award-winning Southern California writer, dies at 82 *Zygmunt Zimowski, 67, Polish Roman Catholic prelate, Bishop of Radom (2002–2009), President of the PCPCHCW (since 2009), pancreatic cancer.Polish theologian, head of Vatican office for health care ministry, dies ===14=== *Helena Benitez, 102, Filipino politician and educator, Senator (1967–1972).Helena Benitez dies at 102 *Michael J. Elliott, 65, British journalist and magazine editor (Time, Newsweek, The Economist), cancer.Former Editor of Time International Michael Elliott Dies at 65 *Péter Esterházy, 66, Hungarian author, pancreatic cancer.Péter Esterházy, Hungarian novelist – obituary *Lisa Gaye, 81, American actress, singer and dancer (Rock Around the Clock, Drums Across the River).Lisa Gaye, Actress and Dancer in 'Rock Around the Clock,' Dies at 81 *Mohamed Lahouaiej-Bouhlel, 31, Tunisian jihadist, perpetrator of 2016 Nice attack, shot.Attack on Nice: Who was Mohamed Lahouaiej-Bouhlel? *Sharon Runner, 62, American politician, member of the California State Assembly (20022008) and Senate (20112012, 20152016), complications from respiratory failure.Longtime Antelope Valley State Senator Sharon Runner Dead At 62 *Hallard White, 87, New Zealand rugby union player (Auckland, national team), Alzheimer's disease.Former All Black Hallard 'Snow' White dies ===15=== *Qandeel Baloch, 26, Pakistani model and social media celebrity, strangled.Qandeel Baloch murdered by brother in Multan: police *Frank Barnett, 82, American politician, Governor of American Samoa (1976–1977).Frank Barnett, former governor of American Samoa, dies *Janez Bernik, 82, Slovenian painter.Umrl slikar in akademik Janez Bernik *Charles Davis, 83, American jazz saxophonist.RIP Charles Davis ===16=== *Robert Burren Morgan, 90, American politician, member of the U.S. Senate for North Carolina (1975–1981), N.C. Senate (19551969) and Attorney General (19691974).Former US Senator, Lillington native Robert Morgan dies *E. C. Pielou, 92, Canadian statistical ecologist.Chris Pielou *Nate Thurmond, 74, American Hall of Fame basketball player (Golden State Warriors, Chicago Bulls, Cleveland Cavaliers), leukemia.Warriors great Nate Thurmond dead at 74 *Thurston Twigg-Smith, 94, American businessman and philanthropist.Former Honolulu Advertiser publisher Twigg-Smith dies *Kazimieras Uoka, 65, Lithuanian politician.Mirė signataras K. Uoka *Alan Vega, 78, American singer and musician (Suicide).Suicide's Alan Vega Dead at 78 ===17=== *Wendell Anderson, 83, American politician, Governor of Minnesota (1971–1976), Senator for Minnesota (1976–1978), Olympic silver medalist in ice hockey (1956), pneumonia.Wendell Anderson, former Minnesota governor, dead at 83 *Achille Casanova, 74, Swiss politician, Vice Chancellor (1981–2005).È morto Achille Casanova *Phyllis Ntantala-Jordan, 96, South African political activist and author.Phyllis Ntantala-Jordan dies at 96 *Gary S. Paxton, 77, American record producer (\"Monster Mash\") and singer- songwriter (Skip & Flip), complications from heart surgery and liver disease.Gary S. Paxton, Whose Life of Extremes Brimmed With Music, Dies at 77 ===18=== *Manuel G. Batshaw, 101, Canadian social worker, founder of Batshaw Youth and Family Centres.Manuel Batshaw, ‘architect of Montreal's Jewish community,’ dies at 101 *Uri Coronel, 69, Dutch sports director (Ajax Amsterdam).Uri Coronel (69) overleden *Bloeme Evers-Emden, 90, Dutch teacher, child psychologist and Holocaust survivor.Bloeme Evers-Emden (89) overleden *James Kriel, 74, South African air force general.Oudlugmaghoof James Kriel sterf *Jeffrey Montgomery, 63, American LGBT rights activist.Community Mourns Loss of LGBT Rights Activist Jeff Montgomery *Billy Name, 76, American photographer (Andy Warhol), heart failure.Billy Name, Who Glazed Warhol's Factory in Silver, Dies at 76 *Matilda Rapaport, 30, Swedish alpine free- skier, avalanche.Swedish extreme skier Matilda Rapaport dies filming Ubisoft game promo in Chile *Abu Wardah, 39, Indonesian militant leader (Mujahidin Indonesia Timur), shot by police.Indonesian police are confident killed the country's most wanted terrorist Santoso who pledged allegiance to Islamic State ===19=== *Betsy Bloomingdale, 93, American socialite and philanthropist, complications from heart disease.Betsy Bloomingdale, Socialite and Friend of Influencers, Dies at 93 *Chief Zee, 75, American football mascot (Washington Redskins).Washington superfan Zema ‘Chief Zee’ Williams has died *Dimitri, 80, Swiss clown.Beloved Swiss performer Clown Dimitri dies at 80 *Carlos Gorostiza, 96, Argentine playwright, theatre director and novelist. *Carmen Hernández, 85, Spanish catechist, co-founder of the Neocatechumenal Way.Neocatechumenal Way co-founder Carmen Hernandez dies at 85 *Garry Marshall, 81, American director, producer, writer, and actor (Happy Days, Pretty Woman, Murphy Brown), pneumonia.Garry Marshall, ‘Pretty Woman’ Director and Creator of ‘Happy Days,’ Dies at 81 *Anthony D. Smith, 76, British historical sociologist.Professor Anthony Smith *Tamás Somló, 68, Hungarian musician and singer (Omega, Locomotiv GT), cancer. ===20=== *Radu Beligan, 97, Romanian actor, director and essayist.Stage actor Beligan dies at 97 *James Allen Johnson, 92, American army general.JAMES A. JOHNSON Major General, US Army (Ret.) *György Kéri, 66, Hungarian biochemist, Széchenyi Prize winner (2013).Meghalt Kéri György Széchenyi-díjas biokémikus *Pavel Sheremet, 44, Belarusian journalist, car bombing.Pavel Sheremet, Journalist in Ukraine, Is Killed in Car Bombing *Mark Takai, 49, American politician, member of the U.S. House of Representatives for Hawaii's 1st district (since 2015) and the Hawaii House of Representatives (19942015), pancreatic cancer.US Rep. Mark Takai Of Hawaii Dies ===21=== *Roger Godement, 94, French mathematician.Décès de Roger Godement *Dennis Green, 67, American football coach (Minnesota Vikings, Arizona Cardinals, Northwestern Wildcats), cardiac arrest.Former NFL Coach Dennis Green Dies at Age 67 *Luc Hoffmann, 93, Swiss ornithologist. *Amnon Linn, 92, Israeli politician, member of the Knesset (19671969, 19731988).חבר הכנסת לשעבר אמנון לין מת בגיל 92 *Iwo Cyprian Pogonowski, 94, Polish writer and inventor.Zmarł Iwo Cyprian Pogonowski *Des Rea, 72, Northern Irish boxer. *Don Soderquist, 82, American executive (Walmart).Longtime Wal-Mart Executive Don Soderquist Dies at 82 *Lewie Steinberg, 82, American Hall of Fame bassist (Booker T. & the M.G.'s), cancer.R.I.P. Lewie Steinberg of Booker T & The MGs 1933–2016 ===22=== *Geraldine Branch, 107, American gynecologist. *Dave Bald Eagle, 97, American Lakota Chief and actor.American Indian Chief David Beautiful Bald Eagle Jr. dies *Joe Derrane, 86, American accordion player. *Franca Faldini, 85, Italian writer and actress (Where Is Freedom?, Poverty and Nobility, Man, Beast and Virtue).Lutto nel cinema, è morta Franca Faldini, l'ultima compagna di Totò *Ursula Franklin, 94, German-born Canadian scientist and academic (University of Toronto).Ursula Franklin, renowned Canadian scientist, dead at 94 *Viktor Kryzhanivskyi, 66, Ukrainian painter and artist.У Києві помер художник Віктор Крижанівський *Leyla Sayar, 76, Turkish actress.Leyla Sayar sessiz sedasız hayata veda etti *Norma Levy Shapiro, 87, American judge, member of the U.S. District Court for Eastern Pennsylvania (since 1978).U.S. District Senior Judge Norma Shapiro, 87 *Shawshank tree, , North American white oak featured in The Shawshank Redemption.Famous 'Shawshank' oak falls *Samane Viyaket, 89, Laotian politician and military official, President of the National Assembly (1993–2005). ===23=== *Thorbjörn Fälldin, 90, Swedish politician, Prime Minister (1976–1978, 1979–1982).Swedish ex-prime minister Thorbjorn Falldin dead at 90 *Kate Granger, 34, British physician and fundraiser, desmoplastic small-round-cell tumor.Doctor Kate Granger dies after hitting £250k cancer charity goal *Mangala Moonesinghe, 84, Sri Lankan politician and diplomat, High Commissioner to the UK (20002002) and India (19952000, 20022005).Funeral of veteran politician, diplomat, lawyer Mangala Moonesinghe today *S. H. Raza, 94, Indian artist.Renowned artist SH Raza dies in Delhi *Jean Ricardou, 84, French writer.Décès de l'écrivain Jean Ricardou, spécialiste du Nouveau Roman *Alina Surmacka Szczesniak, 91, Polish-born American food scientist.Alina Surmacka Szczesniak ===24=== *Keith Gemmell, 68, British musician (Audience, Stackridge, Pasadena Roof Orchestra), throat cancer.Farewell Keith Gemmell *Frank Hodsoll, 78, American art historian, Chair of the National Endowment for the Arts (1981–1989), cancer.Frank Hodsoll, NEA chairman who championed arts under Reagan, dies at 78 *Jan Kmenta, 88, Czech-American econometrician.Prof. Jan Kmenta Passed Away *Bohuslav Kokotek, 67, Czech Lutheran clergyman and politician.Zmarł ks. senior Kokotek *Marni Nixon, 86, American singer (The King and I, West Side Story, My Fair Lady) and actress (The Sound of Music), breast cancer.Marni Nixon, the Voice Behind the Screen, Dies at 86 *Chris Costner Sizemore, 89, American writer, subject of The Three Faces of Eve, heart attack.Chris Costner Sizemore dies; ‘The Three Faces of Eve’ inspiration was 89 ===25=== *Jerzy Bahr, 72, Polish diplomat, Ambassador to Russia (20062010) and Ukraine (19972001), Director of the National Security Bureau (2005), cancer.Jerzy Bahr, były ambasador w Rosji i były szef BBN, nie żyje *Daphne Ceeney, 82, Australian paraplegic athlete, Paralympic champion (1960, 1964).Australian Paralympic medallist across five different sports dies aged 82 *Artur Correia, 66, Portuguese footballer (Benfica, Sporting, national team), stroke. *Pierre Fauchon, 87, French politician, member of the Senate for Loir-et-Cher (19922011).Deces de l'ancien senateur Pierre Fauchon *Arundhati Ghose, 76, Indian diplomat, ambassador to the UN-Geneva, South Korea and Egypt, cancer.Arundhati Ghose, Diplomat Who Played Decisive Role In India's Nuclear Future, Passes Away *Eric Kuhne, 64, American-born British architect, heart attack.Headwaters Park architect dies *Mollie Lowery, 70, American advocate for the homeless and mentally ill, cancer.Mollie Lowery dies at 70; served as a friend of and advocate for people living on L.A.'s sidewalks *Tom Peterson, 86, American retailer and television personality, Parkinson's disease. ===26=== *Roy Adler, 85, American mathematician.Roy Lee Adler Obituary *John H. Flood, 77, American politician, member of the Massachusetts House of Representatives (19811991).Canton legislator, sheriff John Flood dies at 77 *Jeffrey Grey, 57, Australian military historian.In memoriam: Jeffrey Guy Grey 1959–2016 *Jacques Hamel, 85, French Roman Catholic priest, stabbed.Hollande: Deadly church attack in France carried out in name of ISIS *C.-H. Hermansson, 98, Swedish politician, MP (1963–1985), leader of the Left Party-Communists (1964–1975). *David A. Katz, 82, American judge, member of the US District Court for Northern Ohio (since 1994), cancer.Federal Judge David Katz dies at 82 *Forrest Mars Jr., 84, American billionaire businessman (Mars, Incorporated), heart attack.Forrest Mars Jr., Mars Inc.'s Billionaire Co-Owner, Dies at 84 ===27=== *Jack Davis, 91, American cartoonist and illustrator (Tales from the Crypt, The Vault of Horror, Georgia Bulldogs), co-founder of Mad. *Jerry Doyle, 60, American talk show host and actor (Babylon 5), founder of EpicTimes.Babylon 5 star Jerry Doyle dead at 60 *Doug Griffin, 69, American baseball player (Boston Red Sox).Former Red Sox infielder Doug Griffin dead at 69 *Piet de Jong, 101, Dutch politician and naval officer, Minister of Defence (1963–1967) and Prime Minister (1967–1971).Former PM Piet de Jong dies at age 101 *James Alan McPherson, 72, American writer (Elbow Room), awarded Pulitzer Prize (1978), pneumonia.James Alan McPherson, Pulitzer Prize-Winning Writer, Dies at 72 *Milton Murayama, 93, American Nisei novelist and playwright.Milton A. Murayama *Einojuhani Rautavaara, 87, Finnish composer, complications following hip surgery.Finnish composer Rautavaara dies at 87 ===28=== *Boualem Bessaïh, 86, Algerian politician, Minister of Foreign Affairs (1988–1989).Chancellor at presidency, Boualem Bessaih dies aged 87 *Conrad K. Cyr, 84, American federal judge, member of the U.S. Court of Appeals for the First Circuit (1989–1997) and the District Court for the District of Maine (1981–1989).Conrad Cyr, former federal judge from Maine, dies at 84 *Mahasweta Devi, 90, Indian writer (Hajar Churashir Maa), blood infection and kidney failure.Eminent writer Mahasweta Devi dies at 90 in Kolkata *Richard Grant Hiskey, 87, American chemist. *Marianne Ihlen, 81, Norwegian muse.Obituary: Marianne Ihlen, Leonard Cohen's muse *Patrick Jourdain, 73, British bridge player and journalist.Patrick Jourdain, bridge correspondent and capped player – obituary *Vladica Kovačević, 76, Serbian footballer.Preminuo Vladica Kovačević: Smrt tihog poslovođe *Émile Derlin Zinsou, 98, Beninese politician, President (1968–1969).Former President of Benin, Emile Zinsou, dead ===29=== *Ken Barrie, 83, British voice actor (Postman Pat) and singer, liver cancer.Postman Pat voice actor Ken Barrie dies *Doris Benegas, 64, Venezuelan-born Spanish Basque politician, leader of the Castilian Left, stomach cancer.Muere Doris Benegas, política, abogada y activista *Madhusudan Dhaky, 88, Indian architectural historian.Prof who immortalized temple architecture passes away *Lucille Dumont, 97, Canadian singer.Quebec chanteuse Lucille Dumont dies at 97 *Tommy George, 87, Australian Aboriginal elder.A \"Legend\", Indigenous Australian Leader, Knowledge Holder Tommy George Passes On *Vivean Gray, 92, British-born Australian actress (Neighbours, The Sullivans, Prisoner).Vivean Gray, actress who played Mrs Mangel in Neighbours – obituary *Patrick Lalor, 90, Irish hurler (Laois) and politician, TD (1961–1981), MEP (1979–1994).Former minister Patrick Lalor dies aged 90 *Burt L. Talcott, 96, American politician, member of the United States House of Representatives from California's 12th and 16th congressional districts (1963–1977). ===30=== *Gloria DeHaven, 91, American actress (Summer Stock, Mary Hartman, Mary Hartman, Out to Sea), complications from a stroke.Gloria DeHaven, Effervescent Star of MGM Musicals, Dies at 91 *Nigel Gray, 69, British record producer (Outlandos d'Amour).Doctor who recorded The Police albums at Surrey Sound Studios in Leatherhead, Nigel Gray, dies ===31=== *Chiyonofuji Mitsugu, 61, Japanese sumo wrestler, pancreatic cancer.Chiyonofuji, sumo's small great ‘Wolf,’ dies *Thomas Danson Jr., 82, American politician.Thomas Edward Danson Jr. *Bobbie Heine Miller, 106, South African-born Australian tennis player. *Fazil Iskander, 87, Soviet and Russian writer.Abkhaz writer Fazil Iskander dies, aged 87 *Penny Lang, 74, Canadian folk musician.Obituary: Penny Lang, star of Montreal's folk music scene, dies at 74 *Destin Onka Malonga, 28, Congolese football player, fall.International goalkeeper Destin Onka Malonga dies in canoeing accident *Seymour Papert, 88, South African-born American mathematician, computer scientist and educator.Professor Emeritus Seymour Papert, pioneer of constructionist learning, dies at 88 *Angelika Schrobsdorff, 88, German writer.German-Jewish writer Angelika Schrobsdorff dies at age 88 *Jean-Claude Wicky, 70, Swiss photographer.Jean-Claude Wicky n’est plus ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *07 Category:July 2016 events",
 "title": "Deaths in July 2016"
}