{
 "id": "547382",
 "text": "{{Infobox philosopher |region = Turkey |color = #B0C4DE |name = Yaşar Nuri Öztürk |image = |birth_date = |death_date = | birth_place = Bayburt, Bayburt Province, TurkeyYaşar Nuri Öztürk was born in Bayburt, but grown up in the village of Fındıcak in Sürmene , Trabzon. | death_place = Istanbul, Turkey |religion = Islam |school_tradition = Quranism |main_interests = Islamic philosophy, theology, kalam, tafsir, tasawwuf | death_cause = Stomach cancer | nationality = Turkish | spouse = | education = Islamic School of theology and Law | alma_mater = İstanbul Üniversitesi | awards = | signature = | signature_size = | signature_alt = | era = | institutions = *Professor and the Dean of the School of theology, Istanbul University, Istanbul, Turkey *Visiting Professor, Theological Seminary of Barrytown, New York *Visiting Professor, Grenoble University, Grenoble, France | influences = Mansur Al-Hallaj, Zayd ibn Ali, Abū Ḥanīfa, Socrates, Ibrahim an-Nazzam, Mu'tazilite, Qarmatians, Ismāʿīlīs, Ikhwan as-Safa', Encyclopedia of the Brethren of Purity, Sufism, Fatimid Caliphate, Abu l'Hasan al-Ashari, Nasir Khusraw, Mehmet Akif Ersoy, Mustafa Kemal, Sir Muhammad Iqbal, Elmalılı Muhammed Hamdi Yazır, Süleyman Ateş | influenced = Alevism | notable_ideas = Quranism - Active propagation of pure and root understanding of Islam through Qur'an | notable_works = *\"Kur'an'daki Islam\" (Islam in the Qur'an) *\"Kur'an Meali\" (Adoptation of Elmalılı Muhammed Hamdi Yazır's Qur'anic exegesis in 1935 into Nowadays Turkish) }} Yaşar Nuri Öztürk (February 5, 1951 - June 22, 2016) was a Turkish university professor of Islamic theology, Quranist Muslim, lawyer, columnist and a former member of Turkish parliament. Yaşar Nuri Öztürk lost his life. – Ulusal Kanal Öztürk died on June 22, 2016 at his home in Istanbul from stomach cancer, aged 65. ==References== ==Other websites== * Audio - Turkish Translation of Qu'ran- Audio files of Qu'ran as translated by Y. Nuri Öztürk Category:1951 births Category:2016 deaths Category:Deaths from stomach cancer Category:Cancer deaths in Turkey Category:Turkish politicians Category:Turkish lawyers Category:Turkish academics",
 "title": "Yaşar Nuri Öztürk"
}