{
 "id": "547524",
 "text": "Rahul Sharad Dravid is a cricket player who has stopped playing professionally because he retired of old age. He used to play cricket before and was once the captain of the national cricket team of India. He is famous, and many people think that he is one of the best cricket players ever. He scored the fourth- most runs of any player, after Sachin Tendulkar, Ricky Ponting, Jacques Kallis. He was born in January 11, 1973 in Indore, Madhya Pradesh, India. He is the only player in the World to score a century against all the cricketing ten countries who are all full International Cricket Council members. ==Performance== Rahul Dravid played his first debut match against the team from England. He played against Sri Lanka in his ODI debut match. He played only a one international T20 match, against England. Dravid played 164 Test cricket matches and 344 ODI matches. Rahul Dravid scored 13,288 runs in Tests and 10,899 runs in ODIs. He picked up 4 wickets in ODIs and 1 wicket in Tests. Rahul Dravid made 36 centuries and 63 fifties in Tests and 12 centuries and 83 fifties in ODIs. Rahul Dravid is one of the best wicket keepers of his time. His performances in wicket keeping are as follows: Catches/Stumpings in Tests: 210/0, ODIs: 196/14. His best batting score in a single inning of a Test match is 270 runs. His best batting score in a single ODI match is 153 runs. His best bowling performances are Tests - 1/18, ODIs - 2/43. ==List of cricket teams played by him== In the Indian Premier League, he played for bothRoyal Challengers Bengaluru and Rajasthan Royals. In other types of cricket, he played for Karnataka, Kent, Scotland, Marylebone Cricket Club. ==Awards== * Dravid was given the third and fourth highest civilian awards of India, the Padma Bhushan and the Padma Sri. * He was named one of the best five cricketers of the year by Wisden Cricketers' Almanack in 2000. * He was also awarded the Player of the Year and Test Player of the Year at the inaugural ICC awards ceremony in 2005. ==References== Category:Indian cricketers Category:1973 births Category:Living people Category:Marathi people",
 "title": "Rahul Dravid"
}