{
 "id": "547690",
 "text": "FreeThe20 is a campaign to call attention to women who are political prisoners around the world. The campaign names twenty women who are imprisoned unjustly. Samantha Power, the U.S. Ambassador to the United Nations, started the campaign for the twentieth anniversary of the Beijing Declaration. The reason for the campaign was to tell governments to stop putting women in prison, and to tell the women and their families that they are not alone. There were twenty names of women in twenty days, one for every year since the Beijing Declaration. In September 2015, a bipartisan \"#FreeThe20\" bill was introduced to the U.S Senate. All twenty women senators of the two political parties supported the bill. They said, ::\"As 20 women serving in the United States Senate we stand unified in calling on governments to recognize the universal human rights of women and to release women who have been imprisoned unjustly for exercising those rights.\" == Names of the women == For status of the women updated to the end of the Powers' term as Secretary of State, see #FreeThe20 Women Political Prisoners and Prisoners of Concern Campaign . *Day 20: Rasha Chorbaji, Syria *Day 19: Ta Phong Tan, Vietnam *Day 18: Women Political Prisoners, North Korea *Day 17: Nadiya Savchenko, Ukraine/Russia *Day 16: Naw Ohn Hla, Burma *Day 15: Sanaa Seif, Egypt *Day 14: Judge María Lourdes Afiuni Mora, Venezuela *Day 13: Bui Thi Minh Hang, Vietnam *Day 12: Liu Xia, China *Day 11: Phyoe Phyoe Aung, Burma *Day 10: Leyla Yunus, Azerbaijan *Day 9: Matlyuba Kamilova, Uzbekistan *Day 8: Aster Yohannes, Eritrea *Day 7: Gao Yu, China *Day 4-6: Blen Mesfin, Meron Alemayehu, and Nigist Wondifraw, Ethiopia *Day 3: Bahareh Hedayat, Iran *Day 2: Khadija Ismayilova, Azerbaijan *Day 1: Wang Yu, China == Still detained == The following women are still imprisoned (updated March 2017): * Aster Yohannes, Eritrea * Liu Xia, China, under house arrest as soon as Chinese literary critic Liu Xiaobo's Nobel Peace Prize was announced in October 2010 * María Lourdes Afiuni Mora, Venezuela * Matlyuba Kamilova, Uzbekistan == Released == The following women have been released (alphabetical): * Bahareh Hedayat, Iran, release published 09/05/16 * Blen Mesfin, Ethiopia, released December 2016 * Bui Thi Minh Hang (Vietnamese Bùi Thị Minh Hằng), Vietnam, released Feb. 11, 2017 * Gao Yu, China, released from prison in November of 2015. * Nadiya Savchenko, Ukraine/Russia, released from prison on May 25, 2016. * Naw Ohn Hla, Burma, released from prison on April 17, 2016. * Khadija Ismayilova, Azerbaijan, released from prison on May 25, 2016. * Leyla Yunus, Azerbaijan, released from prison December 9, 2015 * Meron Alemayehu, Ethiopia, released November 2015 * Nadiya Savchenko, Ukraine/Russia, released from prison on May 25, 2016. * Nigist Wondifraw, Ethiopia, released November 2015 * Phyoe Phyoe Aung, Burma, released from prison in April of 2016. * Rasha Sharbaji, Syria, released February 8, 2017 * Sanaa Seif, Egypt, released from prison on September 23, 2015 but reimprisoned May 2016. She was re-released November 16, 2016. * Ta Phong Tan, Vietnam, released from prison on September 19, 2015. * Wang Yu, China, released August (?) 2016 == Other websites == *Free the 20 Campaign on Flickr *#FreeThe20 hashtag on Twitter *Text of #FreeThe20 bill in the U.S. Senate == References == Category:Human rights",
 "title": "FreeThe20 campaign"
}