{
 "id": "54786",
 "text": "Princeton University is a private university in Princeton, New Jersey in the United States. It opened in 1746 with the name \"The College of New Jersey\". It was eventually named \"Princeton University\" in 1896. In conversation, it is simply called, \"Princeton\".http://www.princeton.edu/pr/pub/ph/05/03.htm \"Princeton's History\" — Parent's Handbook, 2005-06 Princeton is one of the 8 Ivy League colleges. It was the fourth official college in the United States.Princeton, Rutgers, and Columbia were founded within a few years of each other. Princeton was the fourth recognized \"degree granting institution\" to conduct classes. Several other colleges and universities are considered colonial-era \"schools\", but not considered Colonial Colleges, because they were not formally chartered as colleges with degree-granting powers, until after the formation of the United States of America in 1776 In 2013 Forbes put Princeton at number three in their list of \"America's Top Colleges\". Princeton works with Coursera. == Firestone Library == The Firestone Library is the main library at Princeton University. It is known for its large collection of books and manuscripts, serving as a major research resource for students and scholars. Established in 1948, it serves as the primary repository for books, manuscripts, and other scholarly materials. With over 4 million books, Firestone Library has one of the largest open-stack collections in the world, offering resources across a wide range of academic disciplines. The library's architecture, designed by architect William H. G. France, reflects the collegiate gothic style common on the Princeton campus. Firestone Library houses one of the largest open-stack collections in the world, with over 4 million volumes covering a wide range of subjects, including humanities, social sciences, natural sciences, and engineering. The library includes rare books, manuscripts, archival materials, maps, and special collections. Notable collections within Firestone Library include the Scheide Library, which features rare books and manuscripts dating back to the 15th century, and the Princeton University Archives, which document the history and development of the university. == References == Category:Association of American Universities Category:Collegiate Water Polo Association Category:ECAC Hockey Category:Ivy League Category:1746 establishments Category:1740s establishments in New Jersey",
 "title": "Princeton University"
}