{
 "id": "54794",
 "text": "Mummification is the process that creates mummies: dead bodies whose soft tissues are preserved. These soft tissues (like skin and muscle) usually decay after death. In mummies, they don't decay: they dry out. (This makes mummies look leathery.) Mummification can happen naturally or be done intentionally. Ancient Egyptians mummified many humans and animals (like cats, dogs, and birds). Natural mummification is rare, but occasionally happens in areas that are acidic, very cold and windy, or very hot and dry. Mummies of both types (including human and animal mummies) have been found on every continent. == In Ancient Egypt == === Usage === Ancient Egyptians believed that they could preserve their bodies for the afterlife through mummification. In their view, death was just a transition from one life to another, and they needed to preserve their bodies for the next life. Family members left items and gifts at the graveside so their dead loved ones could use them in their next life. There were no restrictions on who could do this. Any Egyptian was allowed to be mummified if they could afford the expensive process. Many people spent vast amounts of money to do this. Ancient Egyptians also mummified large numbers of cats, dogs, and birds. Over one million animal mummies have been found in Egypt; many were cats. === Process === It takes about 70 days to mummify a dead body intentionally. The Egyptians used a series of steps to accomplish this. First, they would push a sharp rod up the nose and into the brain. From there, they would break up the brain into tiny pieces and remove them through the nose. Next, the nose was filled with sawdust. Next, they made a hole in the body to remove all the organs except for the heart. They stored these organs in canopic jars decorated with the heads of gods on top. Next they would fill the hole in the body with linen and spices, and leave the body under salt to make it dry. After 40 days, they would wrap the body in linen bandages to protect it from rotting. Priests surrounded the body while it was being prepared and performed rituals. After the mummifying process was complete, a mask was placed over the head so the person could be known in the afterlife. === Relation to religion === Anubis was a god of mummification. He had a human body and the head of a jackal. His job was to prepare the body of the dead to be received by Osiris, the god of the dead. Osiris then let the souls forward into the underworld. == Natural mummification == Bodies can also be naturally mummified. A 2023 paper stated: > Many factors could affect the mummification process, but the most important > ones are dry air, good ventilation [air flow], solar radiation [sunlight], > and high temperature. For example, dead bodies have been naturally mummified by the very hot and dry weather in the Sahara Desert. Mummies can also form in conditions that are cold and dry. Ötzi the Iceman, a man who lived about 5,300 years ago, was \"freeze-dried by the cold air in the mountains\" and became a natural mummy. Ötzi was found in 1991 in the Schnalstal glacier, Ötzti Alps, near Hauslabjoch on the border between Austria and Italy.. Additionally, mummies can form in conditions that are acidic. Bog bodies are proof of this. == Gallery == Image:Otzi-Quinson.jpg|Mummy of Ötzi the Iceman. Image:Tollundmanden i Silkeborgmuseet.JPG|The Tollund Man in a museum in Silkeborg. His mummy was conserved in a bog. Image:Guanajuato mummy 03.jpg|Hand of a mummy in Guanajuato, in Mexico Image:Dog mummies at the Louvre museum.jpg|Intentionally mummified cats. == References == Category:Mummies",
 "title": "Mummification"
}