{
 "id": "548182",
 "text": "Pokémon Go (or Pokémon GO) is a free-to-play Android and iOS game. It was developed by Niantic. It is licensed by The Pokémon Company. It was released in July 2016 in the US, Europe, and Australia. The game lets players catch and train fictional living beings, called Pocket Monsters (in Japan) or Pokémon (everywhere else). The game makes them exist in real life by using GPS and a smartphone's camera. As players walk in the real world, their character in the game moves as well. Players can find Pokemon by using the game map to walk to places where the grass is moving. They can then throw a Pokeball at the Pokemon to see if they can catch it. Players can also walk to special places in the game called \"PokeStops\" or \"Gyms\". At PokeStops, players can find extra PokeBalls and candy to feed their Pokemon. At Gyms, players can get their pokemon to fight another pokemon to try to win that gym for their team. An earlier game by Niantic called Ingress was used to make the special places in the game. Pokemon GO got its start in an April Fool's joke by Google and The Pokemon Company in 2013, called \"Pokemon Challenge\". An item called Pokemon GO Plus is being sold to let people play the game without looking at their smartphones all the time. Pokemon GO looks like a Gameplay of Pokémon mixed with the Google Maps pin shape. Pokémon Go has a current score of 69 critic score and a user score of 5.5 on Metacritic. The game became more popular after they released the Generation 2 Pokémon, featuring more items and Pokemon. In that update, berries (a type of fruit that makes the Pokémon flee, higher chance on catching, etc.) were added, and evolution items were added in (things that are used to evolve Pokemon to become one certain), such as the Metal Coat and Kings Rock. ==Availability== Pokemon Go is available in the countries listed. Australia, New Zealand and United States are available in first release date. Pokemon regional exclusives available includes Africa, Asia, Europe, Middle East, Oceania, North America and South America Date of Launch Countries July 6, 2016 , , and July 13, 2016 July 14, 2016 July 15, 2016 , , and July 16, 2016 , , , , , , , , , , , , , , , , , , , , , , , , , and July 17, 2016 July 19, 2016 July 22, 2016 July 24, 2016 July 25, 2016 August 3, 2016 Latin America and Caribbean islands August 6, 2016 , , , , , , , , , , , , , and September 29, 2016 , , , and September 30, 2016 , , , , and October 4, 2016 , , , , , , , , , , , , , , , , , , , , , , , , , , , , , and November 17, 2016 , , , , , , and December 13, 2016 , , , , and January 24, 2017 September 11, 2018 (Shut down on March 2022) June 3, 2021 October 7, 2024 ==References== ==Notes== ==Other websites== *Official site Category:2016 video games Category:Pokémon video games Category:Android (operating system) games Category:Augmented reality Category:Free-to-play video games Category:IOS games Category:Pervasive games Category:Video games developed in the United States",
 "title": "Pokémon Go"
}