{
 "id": "548372",
 "text": "The Charente (Saintongeais: Chérente, ) is a river in southwestern France that flows through the Nouvelle-Aquitaine region. Two departments, Charente and Charente-Maritime, are named after the river. It rises in the Massif Central and flows into the Atlantic Ocean (Bay of Biscay) near Rochefort. ==Geography== The Charente river has a length of , and a drainage basin with an area of approximately . ===Course=== The Charente river starts in western Massif Central, in the commune of Chéronnac, Haute-Vienne department, at an elevation of about . It flows to the northwest for about and then flows through the north of the Charente department. The river keeps flowing to the northwest and gets into the Vienne department. After the commune of Civray, the river turns to the southwest and gets back into the Charente department. After Angoulême, the river turns west and, after Cognac, to the northwest. Finally, the river flows into the Atlantic Ocean near Rochefort. The river is navigable (it is deep, wide and slow enough for a ship to pass), mainly with recreational boats from Angoulême to its mouth. The Charente flows through 4 departments and 120 communes, all in the Nouvelle-Aquitaine region: * Haute- Vienne: three communes. * Vienne: ten communes and the cities Charroux and Civray. * Charente: 78 communes and the cities Gond-Pontouvre, Angoulême, Châteauneuf-sur-Charente, Jarnac and Cognac. * Charente-Maritime: 35 communes and the cities Saintes, Tonnay-Charente et Rochefort. ==Main tributaries == The main tributaries of the Charente river are: Left tributaries: * Moulde - 18.1 km * Argent-Or - 28.9 km * Son-Sonnette - 35.1 km * Bonnieure - 46.8 km * Touvre - 11.7 km * Charreau - 17.4 km * Boème - 23.1 km * Né - 66.1 km * Seugne - 82.4 km Right tributaries: * Transon - 22.4 km * Péruse - 23.9 km * Aume - 32.2 km * Soloire - 34.9 km * Antenne - 48.3 km * Boutonne - 98.8 km * Devise - 35.7 km ==Gallery== Cheronnac cha1.JPG|The source of the Charente in Cheronnac Angoulême L'Houmeau vu des remparts 2012.jpg|The Charent in Houmeau, down Angoulême CognacChâteau1.JPG|The Charente and the Château de Cognac Embouchure de la Charente.png|Mouth of the Charente ==Related pages== * List of rivers of France ==References== ==Other websites== * Banque Hydro - Station R5200010 - La Charente à Chaniers * Dictionnaire des canaux et rivières de France - Rivière Charente * Site web officiel du Site Natura 2000 FR5400-472 \"Moyenne vallée de la Charente, Seugne et Coran\" Category:Rivers of Nouvelle- Aquitaine",
 "title": "Charente (river)"
}