{
 "id": "548341",
 "text": "Moju Chowdhury Hat or Rahmat Khali is a town and tourism in Lakshmipur Sadar Upazila of Lakshmipur District, in south-eastern Bangladesh. It is commonly known as Moju Chowdhury Hat but it used to be called Rahmat Khali. It was renamed Moju Chowdhury in 1965. It is spelled as M.C.H. for short (). This town is 12 km² south of Lakshmipur City. It is across the Meghna River from Bhola 38 km² to the southwest. Moju Chowdhury Hat is 76 km² east of Barisal. Moju Chowdhury Hat is itself municipality and a tourist destination. It is also a ransport hub for passengers from the Bhola Barisal Division and Chittagong Division, serving about four thousand people per day. == History == Moju Chowdhury is named after a person. Moju Chowdhury came to Rahmat Khali when it was still part of the Mughal Empire. Moju Chowdhury was the second of Pana Mia Hazi's four sons. He went to Lakshmipur Government Collage, where he studied landscapes. == Geography == Moju Chowdhury Hat is located at It has 145.56 households and a total area of 56.05 km². == Gallery == image:Mch New Bridge.jpg|The New Sluice Gate and bridge image:Mch old Bridge.jpg|The bridge built in 1972–75 image:Mchbd.jpg|West Boundary image:Lillah Jame Morzid.jpg|Lillah Jame Mosque the first mosque in Moju Chowdhury Hat view from Mathir Hat Road image:সাইফিয়া দরবার শরীফ.png|Saifia Darbar Sharif the Central mosque of Moju Chowdhury Hat image:Old Sluice Gate.jpg|Old Sluice Gate and Bridge which are built in 1975 a first Bridge in Rahmat Khali areas image:Mojuchowdhuryhat coast guard.jpg|Bangladesh Coast Guard posted in Moju Chowdhury Hat 2010 image:Bd Coast Guard in Mch.jpg|Coast Guard station Bangladesh Navy forces present in Moju Chowdhury Hat with 85 Popularity and Administrations image:Bus stop in Mch.jpg|Bus Station view from Lakshmipur Bhola Barisal Highway. image:Mch Ferry Terminal.jpg|Ferry Terminal view from Old Sluice Gate ==Related pages== * List of cities and towns in Bangladesh * Divisions of Bangladesh * Districts of Bangladesh * Lakshmipur District == References == ==Other websites== * Tourist Destination *Travel guide & blogspot Category:Settlements in Bangladesh Category:Lakshmipur District",
 "title": "Moju Chowdhury Hat"
}