{
 "id": "548478",
 "text": "XOXO is the first studio album of the boy band Chinese-South Korean EXO, released on June 3, 2013 by the label S.M. Entertainment. The album is the follow-up to the EP debut of EXO, MAMA (2012). Like all the music from the group, the album was released in two versions - \"Kiss\" is the Korean edition and \"Hug\" is the Chinese edition. Two main singles were released from XOXO: \"Wolf\" and \"Growl\", with the latter being the first single from the album of the repackaged version released on August 5, 2013. Both singles went to the list in the top 10 of Gaon Singles Chart, and \"Growl\" was at number three in Billboard Korea K-Pop Hot 100. The album won \"Álbum of the Year\" in 2013 Mnet Asian Music Awards and sold about a million copies, becoming the best-selling album in Korea since 2001. == Background == The single main album \"The Wolf and the Beauty\" known in English as simply \"Wolf\", was composed by Will Simms, Nermin Harambasic by Dsign Music and composer of S.M. Entertainment Kenzie. Kenzie has of the letter for the version Korean of the song while Zhou Weijie wrote the letter for the version in Chinese mandarin, \"狼与美女\". Yoo Young-jin provides the vocals. The song dance was choreographed by Tony Testa. In various programs such as After School Club of Arirang, members explain that the dance has 3 elements: trees and forests, caves and the Wolf itself. The member Kris revealed that it took about 3 to 4 months to learn the choreography, because of their level of difficulty. A demo version of the song was leaked in February 2013, in response to producer Ryan Jhun later gave a warning to those who download illegally on May 29, 2013: \"I'm going to inform of this to the FBI and the Department of service for all those links.\" Several tracks in \"development\" were produced and recorded in 2011 before the official debut of EXO in the entertainment industry, but he never did in his first EP MAMA. Some of these tracks were included on album XOXO, including \"Black Pearl\" and \"My Lady\". In July 2013, a repackaged version of XOXO, was renowned as a 으르렁 (Growl) was developed with three tracks additional. Composed by Hyuk Shin (Joombas), DK, Jordan Kyle, John Major, and Jarah Gibson, \"Growl\" is dance-pop genre with R&B; and funk. The single was leaked prematurely online July 27, when a video of the group practiced for the Korean version of the song was uploaded to several sites == Release and promotion == On May 30, 2013, the Korean and Chinese versions of the music video of \"Wolf\" were released, EXO sings the song for the first time in M! Countdown of Mnet. Both versions of the song were released to their download on June 3, 2013 and on the same day, two physical formats of the album XOXO were also released in South Korea: \"Kiss\" Korean edition and \"Hug\" in Mandarin edition. After a performance in Inkigayo of SBS on June 3, 2013, EXO visited and thanked 2,000 fansho had been waiting in a nearby park to meet them. The premiere of the Mandarin version of the song was broadcast on a popular Chinese variety show Happy Camp in mid-June. The album reached more than 300,000 collective order and reached number one on the Billboard Albums Chart a week after the release. From December 2013, the Korean and Chinese versions of the album as well as their respective versions of repackaging, have collectively sold more than 1,070,000 copies, making it the best-selling album of the year in the industry of K-pop. With over 1 million copies sold, XOXO also the best selling album in twelve years Korea became. == Tracklist == === XOXO (original edition) === === Growl (repackaged edition) === == Charts == ;Chinese and Korean versions Chart Peak positions Peak positions Peak positions Peak positions Chart XOXO Kiss edition XOXO Hug edition Growl Kiss edition Growl Hug edition China Weekly Sino Chart 3 1 South Korea Gaon Weekly Albums Chart 1 2 1 2 Japan Oricon Weekly Albums Chart 9 18 South Korea Gaon Monthly Albums Chart 1 2 1 2 Japan Oricon Monthly Albums Chart 18 36 South Korea Gaon 2013 Yearly Albums Chart 3 6 1 7 South Korea Gaon 2014 Yearly Albums Chart 53 83 15 67 ;Combined version Chart Peak positions China Sino Chart 1 Billboard Heatseekers Albums Chart 23 Billboard World Albums Chart 1 Taiwan G-Music's Combo Album Chart 6 ==Sales and shipments== ===Album sales=== XOXO Chart Sales Japan (Oricon) 28,000+ (Hug version) 62,000+ (Kiss version) South Korea (Gaon) 224,373+ (Hug version) 308,298+ (Kiss version) Growl (Repackage) Chart Sales South Korea (Gaon) 234,764+ (Hug version) 458,306+ (Kiss version) ==Release history== Edition Date Region Format Label Catalog Original June 3, 2013 Worldwide / South Korea CD, digital download S.M. Entertainment, KT Music SMK0242 Original June 3, 2013 Worldwide / South Korea CD, digital download S.M. Entertainment, KT Music SMK0243 Original July 19, 2013 Taiwan CD, digital download Avex AVKCD80280/A Original July 19, 2013 Taiwan CD, digital download Avex AVKCD80280/B Original July 27, 2013 Philippines CD, digital download Universal Records SMK0242 Original SMK0243 CD, digital download Original June 12, 2013 Thailand CD, digital download S.M. True Original CD, digital download Repackage August 5, 2013 Worldwide / South Korea CD, digital download S.M. Entertainment, KT Music SMK0275 Repackage August 5, 2013 Worldwide / South Korea CD, digital download S.M. Entertainment, KT Music SMK0276 Repackage September 13, 2013 Taiwan CD, digital download Avex Taiwan AVKCD80280/C Repackage September 13, 2013 Taiwan CD, digital download Avex Taiwan AVKCD80280/D Repackage August 16, 2013 Thailand CD, digital download S.M. True Repackage CD, digital download == Awards and nominations == Year Award Nominated work Category Result 2013 Golden Disk Awards Growl Digital Bonsang XOXO Disk Bonsang Disk Daesang MelOn Music Awards Growl Song of the Year Music Video award XOXO Album of the Year Mnet Asian Music Awards XOXO BC - UnionPay Album of the Year\"2013 M.net Korean Music Festival Winners list\" . MAMA. Retrieved June 12, 2014. Growl BC - UnionPay Song of the Year Seoul Music Awards Record of the Year in Digital Release KBS Music Festival Song of the year World Music Awards Best World Song == References == Category:2013 albums Category:Exo albums",
 "title": "XOXO"
}