{
 "id": "548490",
 "text": "This is a list of awards and nominations received by EXO, a Chinese-South Korean boy band formed in 2011 by S.M. Entertainment. The group was divided into two subgroups, EXO-K (\"K\" Korean in English) by South Korea and EXO-M (\"M\" Mandarin) by China. EXO has received a total of 142 awards and was nominated for 216 awards. They have also won 104 awards of Korean music programs and 2 Chinese, making them the Korean artist with the highest number of victories in programs. On June 14, 2013, one year after its official debut, the band received their first number-one in the Music Bank with the single \"Wolf.\" ==Asia Artist Awards== Year Recipient Nominated work Award Result Ref. 2016 EXO EXO Asia Star Award 2016 Popularity Award (Singer) 2016 Baidu Star Award 2016 Daesang Award (Singer) 2017 Popularity Award (Singer) Fabulous Award Daesang Award (Singer) ==Golden Disc Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO-K EXO-K Newcomer Award 2013 EXO-K EXO-K Popularity Award 2013 EXO-K Mama Disk Bonsang 2014 EXO EXO Popularity Award 2014 Growl Digital Bonsang 2014 XOXO Disk Bonsang 2014 XOXO Disk Daesang 2015 Overdose Disk Bonsang 2015 Overdose Disk Daesang 2015 Overdose Digital Bonsang 2016 EXO Popularity Award Global Popularity Award EXODUS Disk Bonsang Disk Daesang Call Me Baby Digital Bonsang 2017 EXO Popularity Award 2017 EXO Golden Disc Asian Choice 2017 EXO Ceci Asia Icon Award 2017 EX'ACT Disk Bonsang 2017 EX'ACT Disk Daesang 2017 Monster Digital Bonsang ==Korean Music Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO EXO Rookie of the Year 2014 EXO EXO Group Musician of the Year by Netizen Vote 2014 EXO Growl Song of the Year 2014 EXO Growl Best Dance & Electronic Song ==Melon Music Awards== Year Recipient Nominated work Award Result Ref. 2012 EXO-K EXO Global Star Award 2013 EXO EXO Global Star Award 2013 EXO EXO Artist of the Year 2013 EXO EXO Netizen Popularity Award 2013 EXO EXO Top 10 Artists 2013 EXO XOXO Album of the Year 2013 EXO Growl Song of the Year 2013 EXO Growl Music Video Award 2014 EXO EXO Artist of the Year 2014 EXO EXO Top 10 Artists 2014 EXO Overdose Album of the Year 2015 EXO EXO Artist of the Year 2015 EXO EXO Top 10 Artists 2015 EXO EXO Netizen Popularity Award 2015 EXO EXODUS Album of the Year 2015 EXO Call Me Baby Song of the Year 2016 EXO EXO Artist of the Year 2016 EXO EXO Top 10 Artists 2016 EXO EXO Netizen Popularity Award 2016 EXO EXO Kakao Hot Star Award 2016 EXO EX'ACT Album of the Year 2016 EXO Monster Best Male Dance 2017 EXO EXO Artist of the Year 2017 EXO EXO Top 10 Artists 2017 EXO EXO Netizen Popularity Award 2017 EXO EXO Kakao Hot Star Award 2017 EXO The War Album of the Year 2017 EXO Ko Ko Bop Song of the Year 2017 EXO Ko Ko Bop Best Male Dance ===Melon Popularity Award=== Year Recipient Date 2015 \"Sing For You\" December 21 2015 \"Sing For You\" December 28 2016 \"Sing For You\" January 4 2016 \"Sing For You\" January 11 2016 \"Sing For You\" January 18 2016 \"Monster\" June 20 2016 \"Monster\" June 27 2016 \"Lotto\" August 29 2016 \"Lotto\" September 5 2016 \"Lotto\" September 12 2016 \"Dancing King\" September 26 2016 \"Dancing King\" October 3 2017 \"Ko Ko Bop\" July 31 August 7 \"Ko Ko Bop\" August 14 \"Ko Ko Bop\" August 21 \"Ko Ko Bop\" August 28 \"Ko Ko Bop\" \"Power\" September 18 ==Mnet Asian Music Awards== Year Recipient Nominated work Award Result Ref. 2012 EXO-K EXO Artist of the Year 2012 EXO-K Best New Male Artist 2012 EXO Best New Asian Artist Group 2013 Growl Best Dance Performance Male Group 2013 EXO Best Male Group 2013 BC – UnionPay Artist of the Year 2013 XOXO BC – UnionPay Album of the Year 2013 Growl BC – UnionPay Song of the Year 2014 EXO Best Asian Style Award 2014 Overdose Best Dance Performance Male Group 2014 EXO Best Male Group 2014 UnionPay Artist of the Year in Asia 2014 Overdose UnionPay Song of the Year 2014 Overdose UnionPay Album of the Year 2015 EXO Best Male Group 2015 Call Me Baby Best Dance Performance Male Group 2015 EXO Weibo – Global Fan's Choice Male Group 2015 iQiyi – Worldwide Favourite Artist 2015 Best Asian Style Award 2015 UnionPay Artist of the Year 2015 Call Me Baby UnionPay Song of the Year 2015 EXODUS UnionPay Album of the Year 2016 EXO Best Male Group 2016 Monster Best Dance Performance Male Group 2016 EXO iQiyi – Worldwide Favourite Artist 2016 Best Asian Style Award 2016 HotelsCombined – Artist of the Year 2016 EX'ACT HotelsCombined – Album of the Year 2016 Monster HotelsCombined – Song of the Year 2017 EXO Best Male Group Qoo10 – Favorite KPOP Star Qoo10 – Artist of the Year Ko Ko Bop Best Dance Performance Male Group Mwave Global Fans' Choice Qoo10 – Song of the Year Power Best Music Video ==Japan Gold Disc Award== Year Recipient Nominated work Award Result Ref. 2016 EXO EXO New Artist of the Year (Asian) Best 3 New Artists ==Gaon Chart Music Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO EXO Popularity Award XOXO Artist of the Year (Album) – 3rd Quarter Miracles in December Artist of the Year (Album) – 4th Quarter 2014 EXO Popularity Award 2014 Overdose Artist of the Year (Album) – 2nd Quarter 2015 EXO Popularity Award EXODUS Artist of the Year (Album) – 1st Quarter Love Me Right Artist of the Year (Album) – 2nd Quarter Sing For You Artist of the Year (Album) – 4th Quarter 2016 EXO Popularity Award 2016 EX'ACT (Korean Ver.) Artist of the Year (Album) – 2nd Quarter 2016 EX'ACT (Chinese Ver.) Artist of the Year (Album) – 2nd Quarter 2016 Lotto (Korean Ver.) Artist of the Year (Album) – 3rd Quarter 2016 Lotto (Chinese Ver.) Artist of the Year (Album) – 3rd Quarter 2016 For Life Artist of the Year (Album) – 4th Quarter 2016 Monster Artist of the Year (Digital) – June 2016 Dancing King with Yoo Jaesuk Artist of the Year (Digital) – September ==Seoul Music Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO-K EXO-K New Artist Award 2013 EXO-K EXO-K Mobile Popularity Award 2014 EXO EXO Bonsang Award 2014 Mobile Popularity Award EXO 2014 Daesang Award EXO 2014 Growl Record of the Year in Digital Release 2015 EXO Bonsang Award 2015 EXO Mobile Popularity Award 2015 EXO iQiyi Popularity Award 2015 EXO Daesang Award 2016 EXO Bonsang Award 2016 EXO Mobile Popularity Award 2016 EXO Hallyu Special Award 2016 EXO Daesang Award 2016 EXODUS Record of the Year in Album Release 2017 EXO Bonsang Award Mobile Popularity Award Hallyu Special Award Fandom School Award Daesang Award ==Soribada Best K-Music Awards== Year Recipient Nominated work Award Result Ref. 2017 EXO EXO New Hallyu Popularity Award Bonsang Award Daesang Award ==SBS Awards Festival== Year Recipient Nominated work Award Result Ref. 2014 EXO EXO Top 10 Artists 2014 EXO EXO Best Male Group 2014 EXO Overdose Best Album ==KBS Song Festival== Year Recipient Nominated work Award Result Ref. 2013 EXO Growl Song of the Year ==World Music Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO EXO World's Best Group 2013 EXO EXO World's Best Live Act 2013 EXO EXO World's Best Fanbase 2013 EXO EXO World's Best Selling Korean Artist 2013 EXO Growl World's Best Song ==YinYueTai V Chart Awards== Year Recipient Nominated work Award Result Ref. 2013 EXO-M EXO-M Mainland China's Most Popular Artist Mainland China's Best Rookie Group 2014 EXO XOXO Album of the Year — South Korea 2015 Overdose Album of the Year — South Korea 2016 EXODUS Album of the Year — South Korea 2017 EXO Most Influential Group in Asia ==Other awards== Year Award Category Recipient Result Ref. 2012 Korean Entertainment Art Awards Rookie Singer Award EXO-K Arirang's Simply K-Pop Awards Super Idol Rookie of the Year Tower Record (K-Pop Lovers! Awards) Best Rookie of the Year (First-Half) EXO Best Rookie of 2012 Mengniu Music Billboard Festival Best Dressed Award Most Popular Group of the Year EXO-M 2013 13th Top Chinese Music Awards Most Popular Group 6th Top Chinese Music Billboard Awards Most Popular Group of the Year Best Group Award EXO 2013 Asian Idol Awards Asian Popular Group Award 1st Hawaii International Music Awards Artist of the Year Asia Young Style Awards Most Popular Group 6th Style Icon Awards The Syndrome- Causing Rookie Idols 2013 MTV Europe Music Awards Best Korea Act Best Japan & Korea Act Worldwide Act 2013 Baidu Music Awards Most Popular Group Award 2013 SBS MTV Best of the Best Best Male Group 2014 iF Design Awards Best Packaging Design (XOXO) Best Packaging Design (Growl) 'Brand Identity' Design 2014 Myx Music Awards Favourite K-Pop Video (Wolf) Korean Entertainment Arts Awards Group Singer Award 26th Korean PD Awards Singer/Performer Award 18th Chinese Music Awards Asia's Most Influential Group Award 2014 Red Dot Design Awards Communication Design Award Package (MAMA) Communication Design Award Package (XOXO) 2014 Korean Popular Culture and Arts Awards The Ministry of Culture, Sports and Tourism Award Japan's Tower Records Chart Best-selling K-pop Album of the Year (Overdose) 8th Miguhui Awards Asia Best Popular Group Award Best Performance Award (Overdose) 2014 SBS MTV Best of the Best Best Male Group Best Male Video Artist of the Year 2014 MBC Entertainment Awards Popularity Award for Singers 2015 14th Huading Awards Best International Group Award 2014 Youku Night Asian Influential Group Award Hottest Male Group Award 42nd Korea Broadcasting Awards Singer Award 2016 iQiyi All-Star Scream Night Carnival Asia Most Popular Group Award MBC Music Show Champion Awards Best Champion Songs of 2015 (Call Me Baby) 2015 MBC Entertainment Awards Popularity Award for Singers 2016 16th Top Chinese Music Awards Most Popular Overseas Group Band of the Year 2016 Teen Choice Awards Choice International Artist 2017 CJ E&M; America Awards Best M Countdown Performance (Monster) V Live Awards Global Artist Top 10 4th EDaily Culture Awards Top Excellence Award — Concert (The EXO'rDium) 2017 Teen Choice Awards Choice International Artist 1st Elle Style Awards Super K-Pop Group Award 2017 Korean Popular Culture and Arts Awards Prime Minister Commendation == Music program awards == ===The Show=== The Show () is a South Korean music program aired by SBS MTV. EXO won twice on The Show with \"Call Me Baby\" and \"Love Me Right\". Year Date Song 2015 April 28 \"Call Me Baby\" June 16 \"Love Me Right\" ===Show Champion=== Show Champion is a South Korean music program aired by MBC Music. EXO has won 17 times (one with EXO-K) as of 2017, including three songs achieving Triple Crown awards, \"Growl\", \"Call Me Baby\" and \"Love Me Right\". Year Date Song 2013 June 19 \"Wolf\" August 21 \"Growl\" August 28 September 4 December 18 \"Miracles in December\" 2014 May 14 \"Overdose\" (EXO-K) 2015 April 8 \"Call Me Baby\" April 15 April 22 June 10 \"Love Me Right\" June 17 June 24 2016 June 22 \"Monster\" August 31 \"Louder (Lotto)\" 2017 July 26 \"Ko Ko Bop\" August 2 September 13 \"Power\" ===M! Countdown=== M! Countdown is a South Korean music program broadcast by Mnet. EXO has won 21 times (2 times with EXO-K) as of 2017, including five songs achieving Triple Crown awards; \"Growl\", \"Miracles in December\", \"Call Me Baby\", \"Monster\", and \"Ko Ko Bop\". Year Date Song 2013 August 22 \"Growl\" August 29 September 5 December 19 \"Miracles in December\" December 26 2014 January 2 May 15 \"Overdose\" (EXO-K) May 22 2015 April 9 \"Call Me Baby\" April 16 April 30 June 18 \"Love Me Right\" 2016 June 16 \"Monster\" June 23 June 30 August 25 \"Louder (Lotto)\" September 1 2017 July 27 \"Ko Ko Bop\" August 3 August 10 September 14 \"Power\" ===Music Bank=== Year Date Song 2013 June 14 \"Wolf\" August 16 \"Growl\" August 23 December 20 \"Miracles in December\" 2015 January 2 \"December, 2014 (The Winter's Tale)\" April 10 \"Call Me Baby\" April 17 April 24 May 1 June 12 \"Love Me Right\" June 19 December 18 \"Sing for You\" December 25 2016 January 1 June 17 \"Monster\" June 24 July 1 August 26 \"Louder (Lotto)\" September 2 December 30 \"For Life\" 2017 July 28 \"Ko Ko Bop\" August 4 September 15 \"Power\" September 22 ===Show! Music Core=== Year Date Song 2013 June 15 \"Wolf\" August 24 \"Growl\" August 31 September 7 December 14 \"Miracles in December\" December 21 2014 May 17 \"Overdose\" (EXO-K) May 24 2015 April 11 \"Call Me Baby\" April 18 April 25 May 2 June 13 \"Love Me Right\" June 20 June 27 2017 August 5 \"Ko Ko Bop\" August 12 ===Inkigayo=== Year Date Song 2013 June 16 \"Wolf\" August 18 \"Growl\" August 25 September 1 December 15 \"Miracles in December\" December 22 2014 May 18 \"Overdose\" (EXO-K) May 25 June 1 2015 April 5 \"Call Me Baby\" April 12 April 19 June 21 \"Love Me Right\" 2016 June 19 \"Monster\" June 26 August 28 \"Louder (Lotto)\" September 4 2017 July 30 \"Ko Ko Bop\" August 6 September 17 \"Power\" ===Global Chinese Music=== CCTV's Global Chinese Music is a Chinese music show. Year Date Song 2014 May 10 \"Overdose\" (EXO-M) May 17 ==References== ==Other websites== * Category:Exo Exo",
 "title": "List of awards and nominations received by Exo"
}