{
 "id": "548554",
 "text": "In military terminology, a demonstration is an attack or show of force on a battlefield designed to trick or mislead an enemy. Unlike a feint, a demonstration does not make contact with the enemy.U.S. Marine Corps, Marine Corps Operations (New York: Cosimo, 2007), p. 7-12 It is usually used as a supporting attack intended to deceive an enemy into thinking the demonstration is the main attack. An example of a demonstration in the American Civil War was at the Battle of Gettysburg.Harry W. Pfanz, Gettysburg–Culp's Hill and Cemetery Hill (Chapel Hill: University of North Carolina Press, 1993), pp. 235-262 On July 2, 1863, General Robert E. Lee ordered Lieutenant General Richard S. Ewell to stage a demonstration against Culp's Hill on the Union right flank. This was in support of Lieutenant General James Longstreet's main attack against the Union left flank. == Advantages == The advantages of a demonstration include: * A demonstration does not make actual contact with an enemy and the demonstrating force may be used elsewhere on the battlefield. In April 1945, the amphibious attack on Okinawa involved landing craft that made a demonstration on the southeast coast of the island. Once they had drawn Japanese troops away from the actual landing site, they returned to serve as reserves in the actual landing. * A full force is often not necessary to deceive the enemy. For example, in modern warfare, the noise of helicopters often gives away troop movements by air.Field Manual No.1-111: Aviation Brigades (Washington DC: Headquarters, Department of the Army, 1997), p. 67 However, in a demonstration, empty helicopters may land and take-off several times leading the enemy to believe there is a large scale attack coming. * Simulation devices (when available) may be used to trick enemy reconnaissance. For example, during Operation Overlord in World War II inflatable tanks, fake radio chatter and dummy paratroopers which made the sounds of rifle fire when hitting the ground. == Disadvantages == Disadvantages include: * Without enemy contact, it is harder to convince an enemy the demonstration is a real attack. At Gettysburg, Lee's orders to Ewell on July 1 had been contradictory and confusing. If practicable, Ewell was to take the heights but not to bring on a general engagement. Ewell took that to mean a demonstration. On July 2, Lee made himself clearer. Ewell was to demonstrate against the Union right side to prevent General George G. Meade from transferring troops to the left side of the line, where the main Confederate attack was planned. Ewell's orders were to attack if the opportunity presented itself by the demonstration not getting results from the Union commander. Ewell apparently decided the demonstration had not worked and attacked. * A demonstration is often discovered earlier than a feint. A feint has to appear real to the enemy so contact is often necessary to continue the deception. A feint must be of great enough strength to convince the enemy it is a real attack. The key is to show the enemy what it expects to see. A demonstration may need be to be only long enough to get the enemy to hesitate. ==References== == Other websites == * DCS: A-10C - Show of Force in Operation Bactria Demonstration",
 "title": "Demonstration (military)"
}