{
 "id": "54887",
 "text": "In the Star Wars fictional universe, battle droids are robots that are made for fighting. They are seen in the prequel trilogy of the Star Wars movies. Battle droids are used by the Confederacy of Independent Systems to fight the Galactic Republic.Clones of the Republic could easily overcome these droids.The battle droids are controlled by a central droid control ship. If the control ship is destroyed, the droids shut off. == Types of battle droids == Name(s) Appearance Function B-1 (Standard) battle droids tall, use blaster rifles, with added backpack soldiers Pilot droid, Engineer droid looks like standard battle droid, with blue shoulders and chest with no backpack flies starships and drives vehicles Security battle droid looks like standard battle droid, with maroon shoulders and chest with no backpack move in groups to remove intruders and guard prisoners Battle droid commander looks like standard battle droid, with yellow forehead and shoulders; circular symbol on chest with small backpack gets orders from controlships and leaders and commands soldiers and security battle droids Assault droid looks like standard battle droid, with Blue shoulders uses missile launchers Droid Sniper (also known as assassin droids) red shoulders uses sniper rifles B-2 Super battle droid (also known as Super Battle Droids) large chested, blue, shiny bodies advanced soldiers, built-in wrist blasters and wrist rocket launcher Geonosis battle droid same look as standard battle droid, with reddish body soldiers for desert areas; used only during Battle of Geonosis Droideka Cobra-like body on three legs with two arms; with blasters, metallic body; transforms heavyily armed soldier with two cannons and deflector shield; rolls into wheel for fast travel IG Lancer droid tall, black, pointed cylindrical head cuts through heavy armor with lances and pilots Speeder bikes (Closely resembles IG-88 from The Empire Strikes Back and Star Wars Droids: The Lost Prince) == Other websites == * Star Wars Databank |Battle droid Category:Fictional characters introduced in 1999 Category:Star Wars characters Category:Fictional robots",
 "title": "Battle droid"
}