{
 "id": "549580",
 "text": "A flintlock is a general term for firearms that use the flintlock firing mechanism. It can also refer just to the firing mechanism itself. A flintlock uses a piece of flint held in a locking jaw. When the trigger is pulled, a hammer with the flint attached falls, striking a piece of steel called a \"frizzen\". This causes a spark which causes the gunpowder in the pan (directly below the flint) to ignite. Through a small hole, this ignites the main powder charge in the breech of the gun causing it to fire the round ball, shot or bullet. The flintlock was a very popular type of musket for over 200 years. Flintlocks were available with smoothbore and later rifled gun barrels.The Encyclopedia of the Wars of the Early American Republic, 1783–1812, ed. Spencer C. Tucker (Santa Barbara, CA: ABC-CLIO, 2014), p. 220 == History == The first form of flintlock appeared in 1570 and was called a snaphaunce. About 1630, Frenchman Marin le Bourgeoys created the first \"true\" flintlock, also called the \"French lock\".Jeff Kinard, Pistols: An Illustrated History of Their Impact (Santa Barbara, CA: ABC-CLIO, 2004), p. 24 Bourgeoys was in the service of King Louis XIII of France for whom he created the flintlock mechanism. The French lock simplified the Snaphaunce design by creating a one- piece, L-shaped frizzen. This is the style seen on most flintlocks today. Like earlier designs such as the matchlock, the flintlock design was used for smoothbore long guns or muskets. But soon it was used for shotguns and pistols. Officers on sailing ships and army officers used flintlock pistols as well. == Famous flintlocks == === Long guns === * Popularly called the \"Brown Bess\", The British Land Pattern Musket - was produced between 1725 and 1838, the Land Pattern and its versions were all .75 caliber smoothbore muskets. They were the standard guns for all land forces in the British Empire. They were replaced after 1838 by smoothbore percussion cap muskets. Its effective range was about but in most battle situations the distance between forces was only about . Even at that range the gun was not particularly accurate. The British tactic was to fire in vollies followed by a bayonet attack. * Pennsylvania rifle, after the early 1880s called the \"Kentucky rifle\" - The Pennsylvania rifle developed from earlier and much heavier Jaeger rifle which were brought to the American colonies by German gunsmiths. During the American Revolutionary War companies of Pennsylvania riflemen created disruption behind the British lines.Philip S. Klein; Ari Arthur Hoogenboom, History of Pennsylvania (University Park; London: Pennsylvania State University Press, 1980), p. 102 Well out of range of the British Brown Bess muskets, militiamen and snipers with rifled Pennsylvania rifles could target individual soldiers and officers from a long distance. * Springfield Model 1795 Musket - patterned after the French Charleville musket, was the first U.S. flintlock musket to be produced at the Springfield Armory. Designed by Eli Whitney it was the first gun to use interchangeable parts. Also produced at the Harpers Ferry Armory, about 10,000 were delivered to the US Army for use in the War of 1812. * Fusil de chasse (French, meaning \"hunting gun\") - by the mid-18th century a light flintlock musket carried by an officer was called a fusil (corruption of the Italian fucile meaning flint).Don Troiani; James L. Kochan; et al., Don Troiani's Soldiers in America, 1754-1865 (Mechanicsburg, PA: Stackpole Books, 1998), p. 36 Both the French and the British had versions of the officer's fusil. From this name came the term fusilier. British officers of foot were originally armed with a spontoon, but later the pole weapon was replaced by the officer's fusil. A very similar but cheaper version was the \"fusil de traite\" (trade gun). The officer's fusil is fitted for a sling and the stock is shorter than the barrel to fit a bayonet. The officer's fusil was much better made. At 20 gauge (.62 caliber) the fusil was also considered a fowling gun (early predecessor of the shotgun). Some American officers in the Revolutionary War also carried fusils. === Pistols === File:kentucky%20pattern%20flintlock%20pistol.jpg| File:French cased duelling pistols, Nicolas Noel Boutet, single shot, flintlock, rifled, .58 caliber, blued steel, Versailles, 1794-1797 - Royal Ontario Museum - DSC09477.jpg| File:Toby version of a Queen Anne flintlock pistol.jpg| File:Pistolet période révolutionnaire Ateliers Nationaux IMG 3200.jpg| * Kentucky pistol - Introduced about the turn of the 17th century it has remained basically unchanged. It is a somewhat awkward piece to load for inexperienced users. The Kentucky had a tendency to hang fire (also called a misfire). The flint strikes the frizzen and ignites the powder in the pan but will at times burn slowly like a fuse. When this happens it is critical to keep it pointed at the target until it fires. The gun was typically .50 caliber and had an octagonal barrel. The stock was typically curly maple and usually had a wood ramrod with a brass tip. * Duelling pistols - While not a specific gun it was a type of flintlock weapon. Duelling pistols were made in matched pairs and usually were in a case. They were often an ornate and highly decorated gun intended to be used in a duel. Until the 19th century most were single-shot flintlock pistols. Like other flintlock pistols, there is a noticeable delay between pulling the trigger and the gun firing. == Notes == == References == == Other websites == * History of the Gun - Part 4: The Flintlock: YouTube * Shooting the Fusil de Chasse 62 caliber/ 20 gauge Smoothbore Musket: YouTube Category:Firearms",
 "title": "Flintlock"
}