{
 "id": "549714",
 "text": "The Brown Bess is a nickname for the British Short Land Pattern Musket. It was produced from 1725 to 1838. The Land Pattern, or more popularly known as the \"Brown Bess\", and its versions were all .75 caliber smoothbore flintlock muskets. They were the standard guns for all land forces in the British Empire. It was one of the most important military firearms ever designed. It helped win the British Empire. The Brown Bess was replaced after 1838 by smoothbore percussion cap muskets. Its effective range was about but in most battle situations the distance between forces was only about . Even at that range the gun was not particularly accurate. The British tactic was to fire in vollies followed by a bayonet attack. While the origins of the name Brown Bess are uncertain, a plausible explanation is the name was based on the German Braun buss, meaning strong gun. The gun was commissioned during the reign of King George I of Great Britain, who was from Germany. == History == One of the earliest forms of flintlock musket used by the English Army was the \"dog lock\". Very similar to the snaphaunce it was the first to introduce the half- cocked position of the hammer. This made the gun much safer to handle and load. It was in use during the English Civil War and many found their way to the British North American colonies. Another name for the dog lock was the English lock, and the gun was a Swedish styled musket. Some of these have been found at Jamestown and Yorktown, Virginia by archaeologists. Between 1710 and 1720 the first King's pattern musket called “Long Land Service” came into use. It had a barrel, iron furniture and the French lock (or \"true\" flintlock) style of flintlock. Later the metal parts (furniture) were changed to brass and the wood ramrod which broke easily was replaced by an iron ramrod. About 1722, the British Long Land Pattern musket was developed. It created a pattern for arms makers to the British Army to follow, creating a standard weapon. The Long Land Pattern musket weighed just over and was long. It had a barrel and held a long bayonet that was used as a crude gunsight. About 1756 the second version called the Short Land Pattern musket was introduced. The barrel was shortened to although the longer Long Land Pattern continued to be made until 1790. In about 1768, a new pattern Short Land Service Musket with a barrel was produced. This was the result of the 1768 Clothing Warrant that was intended to lessen the weight of uniforms and equipment carried by British soldiers. In addition to shortening the musket, to reduce its weight, soldiers could no longer carry swords (except in the Highland and Grenadier units). Uniforms were trimmed to be less bulky. This is the gun most used by British forces during the American Revolutionary War. Among the variety of weapons used by the Continental Army, versions of the Brown Bess were also used. == Musket drill == The British manual listed 11 drill maneuvers soldiers had to follow to load and fire their muskets. This was the same drill as the one in the drill manual by Friedrich Wilhelm von Steuben for the Continental Army.Bob Goshorn, 'The Revolutionary War Musket', Tredyffrin Easttown Historical Society History Quarterly, Vol. 32 No. 4 (October 1994), pp. 150–152 Unless otherwise mentioned steps are performed in one motion: # Half cock! - the hammer is pulled back to the half-cocked position. # Handle Cartridge! - bring a paper cartridge from your pouch, bite the top off the paper cartridge exposing the gunpowder and cover it with your thumb (so the powder does not spill out). # Prime! - from the paper cartridge, pour a small amount of powder into the pan. Again, cover the cartridge while placing three fingers behind the hammer. The elbow should be up. # Shut Pan! - (done in two motions), first shut the pan while bringing the elbow to the butt of the musket and while holding the cartridge in your hand. The second motion is to turn the musket to the loading position. The butt of the musket is placed on the ground, the lock is to the front and the muzzle is at chin-height; bring your right hand under the muzzle. # Charge with Cartridge - (two motions). First motion is to place the open cartridge in the muzzle shaking the remaining powder into the barrel followed by the ball and the paper. Secondly, grasp the ramrod; thumb up and elbow down. # Draw Rammer! - (two motions), with your fingers, first pull the ramrod up until it is halfway out, quickly backhanding the ramrod. The second movement is to completely remove the ramrod and turning it quickly place it into the barrel ramming end down. # Ram down Cartridge! - push the ramrod down quickly ramming the powder and bullet all the way to the breach. # Return Rammer! quickly reverse the ramrod and place it back in its holder. # Poise Firelock! - (in two motions), firstly, turn the firearm with the left hand, lock to the front. Then grasp it with the right hand just below the lock keeping the musket upright. Secondly, in a quick motion raise the musket to the height of the face. # Cock Firelock! - (in two motions), first turn the barrel and place your thumb on the cock (hammer). Secondly, bring the hammer from the half-cock position to full cock moving your fingers under the trigger guard. # Take Aim! - with the right foot, step back and at the same time drop the muzzle to the level position; bring the butt of the musket to the shoulder, placing the left hand on the stock under the barrel and the finger on the trigger. At this point, observing the troops are all ready to fire, the command is given to \"fire\". The drill is then repeated as necessary. == Notes == == References == == Other websites == * How to Load and Fire a Brown Bess Flintlock Musket; YouTube * Live Volley Fire At 100 yards (Brown Bess): YouTube Category:British Army equipment Category:Firearms",
 "title": "Brown Bess"
}