{
 "id": "54987",
 "text": "San Francisco Bay is a shallow bay in northern California, along the Pacific Ocean. It is an estuary because salt water from the ocean mixes with fresh water from rivers, especially the Sacramento and San Joaquin rivers. These rivers carry water from the Sierra Nevada mountains through the Central Valley. Water from about forty percent of California enters the bay. The Sacramento and San Joaquin rivers enter the Suisun Bay. There water flows through the Carquinez Strait to meet with the Napa River at the entrance to San Pablo Bay. This connects at its south end to the San Francisco Bay. The San Francisco Bay is connected to the Pacific by a strait called the Golden Gate. However, this entire group of interconnected bays is often called \"the San Francisco Bay\". San Francisco Bay lies in the US state of California and is surrounded by a region known as the San Francisco Bay Area, that includes the big cities of San Francisco, Oakland, and San Jose. The Bay covers somewhere between 400 and 1,600 square miles (1,040 to 4,160 square kilometres), depending on which sub-bays (such as San Pablo Bay), estuaries, wetlands, and so on are included in the measurement. == Photography == Image:berkeleyfromclaremont800x600.jpg|The city of Berkeley, the Bay and Marin County in the background as seen from the Claremont Canyon reserve Image:TamFromPinole.jpg|Mount Tamalpais view across San Pablo Bay at Point Pinole Regional Shoreline in Richmond == References == * 1999 Grolier Multimedia Encyclopedia. * 1988 Encyclopædia Britannica. == Other websites == * San Francisco Bay: Portrait of an Estuary, David Sanger and John Hart, University of California Press * Barging In - A Short History of Liveaboards on the Bay * Army Corps of Engineers Bay Model: Working scale model of the Bay * BoatingSF.com: Photos of SF Bay and its boats, plus online cruising guide * SF Estuary Institute: San Francisco Bay Historical View Maps Category:San Francisco Bay Area Category:Bodies of water of California Category:Bays of the United States Category:Alameda County, California Category:Santa Clara County, California Category:Contra Costa County, California Category:Solano County, California Category:San Mateo County, California Category:Marin County, California",
 "title": "San Francisco Bay"
}