{
 "id": "549934",
 "text": "Maryam Zakaria (Persian: مریم زکریا; born on 27 September 1985 in Tehran) Swedish-Iranian actress. She has worked in Bollywood and the South Indian Cinema. She is best known for her work in the 2012 film Agent Vinod. == Career == In Sweden, Zakaria worked as model, dance teacher, choreographer and established a Bollywood Dance School called the Indisk Dans Studio. She moved to Mumbai in 2009 and began to model in ads for Set Wet, Layz and Coke.Itsy bitsy – Balancing act . The Hindu. 11 February 2012 She performed an item number in the film Nagaram (2010), after the director saw a video of her dancing on YouTube.Sizzling item number in Nagaram. Sify.com (2010-11-17). Retrieved on 2012-03-30.Where are all the item girls? – Times Of India . Articles.timesofindia.indiatimes.com (2010-12-19). Retrieved on 2012-03-30. The film was a big breakthrough for Zakaria.The girl who follows her dreams . Postnoon. Retrieved on 2012-03-30. ==Filmography== Films Year Film Role Language Notes 2009 Paying Guests Hindi Special appearance 2010 Nagaram Tamil Special appearance 2011 100% Love Telugu Special appearance Brahmigadi Katha Telugu Special appearance Madatha Kaja Priya Telugu 2012 Sadda Adda Hindi Special appearance Agent Vinod Farah Faqesh Hindi Naa Ishtam Telugu Special appearance Dammu Telugu Special appearance Chakradhaar Hindi Special appearance Rowdy Rathore Hindi Special appearance 2013 D-Day Hindi Special appearance Bajatey Raho Hindi Special appearance Grand Masti Rose Hindi Arjuna Shruti Telugu Filming 2014 Anjaan (2014 film) Tamil Special appearance Music videos Year Title Artist Notes 2007 \"Goli\" Saeed Shayesteh 2007 \"Man Sazegaram\" Saeed Shayesteh 2007 \"Akharin Ghasam\" Saeed Shayesteh 2008 \"Ghorboni\" Saeed Shayesteh 2009 \"Jatt Di Zameen\" Preet Harpal 2009 \"Doset Daram\" Saeed Shayesteh 2009 \"Aakh Ladhde\" Jaswinder Daghima 2009 \"Mast Malanga\" Sanoj Kumar 2010 \"Khoshgeleh\" Saeed Shayesteh 2010 \"Azaaram Bedi\" Saeed Shayesteh 2011 \"Ja Ja Ve Ve\" Rishi Singh & Rajveer Dhillon == References == == Other websites == * Category:1985 births Category:Swedish actors Category:Iranian actors Category:Living people",
 "title": "Maryam Zakaria"
}