{
 "id": "55015",
 "text": "John Felix Anthony Cena Jr. (born April 23, 1977) is an American professional wrestler, actor and former rapper. He currently works for WWE and is the current Undisputed WWE Champion in his record 17th reign. Cena has won the WWE Championship/WWE World Heavyweight Championship a record 14 times, the World Heavyweight Championship three-times, the United States Championship five times and both the WWE and World Tag Team Championship twice. Also, Cena won the Royal Rumble in 2008 and 2013. As for his musical career, Cena has released an album called You Can't See Me. Cena has also been featured in the movies The Marine, 12 Rounds and Legendary. He starred as Peacemaker in the 2021 movie The Suicide Squad and his own television series for HBO Max. His most famous catchphrase is \"You Can't See Me\" which has become a very well- known meme in Western Society. == Career == === WWE (2001–present) === Cena was signed by the person in charge of Talent Relations, Jim Ross on behalf of the WWE (then known as the World Wrestling Federation WWF). According to Ross, when he returned to Connecticut after signing Cena he walked into Vince McMahon's office and told him \"I just signed your main event for WrestleMania in 5 years.\" Cena would eventually make his WrestleMania debut 3 years later at WrestleMania XX in 2004, winning the WWE United States Championship from The Big Show. At WrestleMania 21 the following year, he won the WWE Championship from John \"Bradshaw\" Layfield. At 2006's WresteMania 22 he wrestled for the first time in a WrestleMania main event, beating Triple H to keep his WWE Championship. He would go on to main event WrestleMania in 2007 vs. Shawn Michaels, in 2011 vs. The Miz, in 2012 and 2013 vs. The Rock, and in 2025 vs. Cody Rhodes. He also wrestled in many other WWE premium live events. In 2010, during a match between Wade Barrett and Randy Orton, Orton won so Cena was forced to retire. He was rehired by Wade Barrett and defeated him at TLC: Tables, Ladders and Chairs. He was drafted to SmackDown as the first pick in the 2011 WWE Draft, but before the end of the night, he was drafted back to Raw. He was defeated by The Rock at WrestleMania XXVIII. He won his second Royal Rumble in January 2013. Thus he got another match at WrestleMania 29 against The Rock for the WWE Championship. He won that match and became the WWE Champion. == Championships and accomplishments == === Professional wrestling === * The Baltimore Sun ** Best Feud of the Decade (2010) vs. Edge ** Match of the Year (2007) vs. Shawn Michaels on April 23 on Raw ** Wrestler of the Year (2007, 2010) ** Feud of the Year (2010) vs. The Nexus * Ohio Valley Wrestling ** OVW Heavyweight Championship (1 time) ** OVW Southern Tag Team Championship (1 time) – with Rico Constantino * Pro Wrestling Illustrated ** Feud of the Year (2006) vs. Edge ** Feud of the Year (2011) vs. CM Punk ** Match of the Year (2007) vs. Shawn Michaels on Raw ** Match of the Year (2011) vs. CM Punk at Money in the Bank ** Match of the Year (2013) vs. Daniel Bryan at SummerSlam ** Match of the Year (2014) vs. Bray Wyatt in a Last Man Standing match at Payback ** Match of the Year (2016) vs. AJ Styles at SummerSlam ** Most Improved Wrestler of the Year (2003) ** Most Popular Wrestler of the Decade (2000–2009) ** Most Popular Wrestler of the Year (2004, 2005, 2007, 2012) ** Wrestler of the Year (2006, 2007) ** Ranked No. 1 of the top 500 singles wrestlers in the PWI 500 in 2006, 2007 and 2013 * Rolling Stone ** Best Promos (2015) tied with Kevin Owens ** Best Storyline (2015) vs. Kevin Owens ** WWE Match of the Year (2015) vs. Kevin Owens at Money in the Bank * Sports Illustrated ** Muhammad Ali Legacy Award (2018) ** Ranked No. 4 of the top 10 wrestlers in 2017 * Ultimate Pro Wrestling ** UPW Heavyweight Championship (1 time) * World Wrestling Entertainment / WWE ** (Undisputed) WWE Championship (14 times, current) ** World Heavyweight Championship (3 times) ** WWE United States Championship (5 times) ** WWE Tag Team Championship (2 times) – with The Miz (1) and David Otunga (1) ** World Tag Team Championship (2 times) – with Batista (1) and Shawn Michaels (1) ** Money in the Bank (2012) ** Royal Rumble (2008, 2013) ** WWE Championship No. 1 Contender's Tournament (2003, 2005) ** Brisbane Cup (2009) ** Slammy Award (10 times) *** Game Changer of the Year (2011) – with The Rock *** Hero in All of Us (2015) *** Holy $#!+ Move of the Year (2010) – Sending Batista through the stage with an Attitude Adjustment *** Insult of the Year (2012) – To Dolph Ziggler and Vickie Guerrero: \"You're the exact opposite. One enjoys eating a lot of nuts and the other is still trying to find his\" *** Kiss of the Year (2012) – with AJ Lee *** Match of the Year (2013, 2014) – vs. The Rock for the WWE Championship at WrestleMania 29, Team Cena vs. Team Authority at Survivor Series *** Superstar of the Year (2009, 2010, 2012) * Wrestling Observer Newsletter ** Best Box Office Draw (2007) ** Best Gimmick (2003) ** Best on Interviews (2007) ** Feud of the Year (2011) vs. CM Punk ** Match of the Year (2011) vs. CM Punk at Money in the Bank on July 17 ** Most Charismatic (2006–2010) ** Most Charismatic of the Decade (2000–2009) ** Wrestler of the Year (2007, 2010) ** Worst Feud of the Year (2012) vs. Kane ** Worst Worked Match of the Year (2012) vs. John Laurinaitis at Over the Limit ** Worst Worked Match of the Year (2014) vs. Bray Wyatt at Extreme Rules ** Wrestling Observer Newsletter Hall of Fame (Class of 2012) === Other awards and honors === * NCAA Division III All-American * Springfield College Athletic Hall of Fame inductee (Class of 2015) * Make-A-Wish Foundation Chris Greicius Celebrity Award * Make-A-Wish Foundation Special Recognition Award (for being the first to grant 300 wishes) * 2014 Sports Social TV Entertainer of the Year * 2014 Rumble Royalty Hall of Game Award * 2014 Susan G. Komen Race for the Cure Grand Marshal * 2016 USO Legacy of Achievement Award * 2018 Sports Illustrated Muhammad Ali Legacy Award * 2024 NCAA Silver Anniversary Award 1 Cena did not accept the 2012 award, opting to award it to presenter Ric Flair instead. == Footnotes == == References == == Other websites == * * Category:1977 births Category:Living people Category:Actors from Massachusetts Category:American movie actors Category:American professional wrestlers Category:American television actors Category:American voice actors Category:American pop rappers Category:Sportspeople from Massachusetts Category:WWE wrestlers",
 "title": "John Cena"
}