{
 "id": "550113",
 "text": "Rafida Bonya Ahmed, better known as Bonya Ahmed, (Bengali: রাফিদা আহমেদ বন্যা, b. 1969),http://enblog.mukto-mona.com/author/bonya/ English is a Bangladeshi- American author, humanist activist, and blogger. On February 26, 2015, Bonya and her husband Avijit Roy were attacked by machete wielding Islamic extremists while they were visiting Dhaka, Bangladesh, on a book signing trip. They were attacked in the middle of the street at a very crowded book fair. Avijit died after he was taken to the hospital, and Bonya was seriously injured.https://www.bbc.com/news/world-asia-31656222 US-Bangladesh blogger Avijit Roy hacked to death, BBC News, 27 February 2015.Widow of blogger Avijit Roy defiant after Bangladesh attack, BBC News, 10 March 2015. ==Life and work== Bonya was born in Dhaka, Bangladesh. She completed her undergraduate degree in Computer Information Science at Minnesota State University in Mankato. Bonya met Avijit through their writing on Mukto-Mona, the first online platform for Bengali speaking freethinkers, atheists, and secular bloggers and writers founded by Avijit. This group started the first celebration of Darwin Day in Bangladesh. Mukto-Mona was internationally recognized in 2015 and received The BOBS jury award.The Bobs Best of Online Activism Award, 2015 . Bonya wrote one of the first popular science books in Bangladesh about biological evolution, named Bibortoner Path Dhore (\"Along the Evolutionary Path\", 2007). She is one of the moderators of Mukto-Mona. Bonya has a daughter, Trisha Ahmed, from her first marriage. Trisha wrote an article with her stepfather Avijit for the Free Inquiry magazine about imprisoned secularist bloggers. Ahmed has been diagnosed with thyroid cancer. Bonya decided to take a leave of absence from her job as a Senior Director at a credit bureau in the US after the attack on her and Avijit. She started working with the humanist associations in Europe and the US to raise awareness about the attacks on the secular intellectuals in Bangladesh by Islamic fundamentalists. She is currently doing research work on Islamic fundamentalism as a visiting research scholar at University of Texas, Austin. A week after her husband's death, Bonya started meeting with humanist associations in Europe, and working to get other activists out of Bangladesh, before they could be killed. In 2016, Bonya received the Freedom From Religion Foundation's \"Forward\" award.http://iheu.org/event/freedom-from-religion- foundations-39th-national-convention-in-pittsburgh/ Freedom from Religion Foundation’s 39th National Convention in Pittsburgh. She is on the jury of Deutsche Welle's The BOBS Best of Online Activism Award. ==Works and activism== * Bibortoner Path Dhore (\"Along the Evolutionary Path\"), 2007, Abosor Prakashani, Dhaka. * \"Fighting Machetes with Pens\", Voltaire Lecture 2015. * Rafida Ahmed Bonya on the UN panel \"Ending Impunity for Crimes against Journalists\". * Tom Lantos Human Rights Commission Briefing on Human Rights in Bangladesh . * Talk at Harvard Humanist Hub . * Keynote address at Reason Rally 2016 . * Talk at American Humanist Association Annual Conference 2016. * Lecture in the 4th Women in Secularism Conference 2016 . ==References== ==Other websites== * Profile on Mukto-Mona * Rafida Bonya Ahmed's blog * Rafida Bonya Ahmed on Facebook Category:Bangladeshi bloggers Category:Naturalized citizens of the United States Category:Writers from Dhaka Category:Writers from Minnesota Category:American activists",
 "title": "Rafida Bonya Ahmed"
}