{
 "id": "55024",
 "text": "Flux is a term in physics and mathematics. It is broadly defined as \"How much stuff goes through a thing\" (or into an area). The word \"flux\" is similar to \"flow\". For instance, in a butterfly net the amount of air passing through the net is the flux. == Movement of substances == In the study of transport phenomena (heat transfer, mass transfer and fluid dynamics), flux is defined as flow per unit area, where flow is the movement of some quantity per time. Flux, in this definition, is a vector. There are many fluxes used in the study of transport phenomena. Each type of flux has its own distinct unit of measurement along with distinct physical constants. Six of the most common forms of flux from the transport literature are defined as: #Momentum flux, the rate of transfer of momentum across a unit area (N·s·m−2·s−1). (Newtonian fluid, viscous flow) #Heat flux, the rate of heat flow across a unit area (J·m−2·s−1). (Fourier's Law) (This definition of heat flux fits Maxwell's original definition.) #Chemical flux, the rate of movement of molecules across a unit area (mol·m−2·s−1). (Fick's law of diffusion) #Volumetric flux, the rate of volume flow across a unit area (m3·m−2·s−1). (Darcy's law) #Mass flux, the rate of mass flow across a unit area (kg·m−2·s−1). (Either an alternate form of Fick's law that includes the molecular mass, or an alternate form of Darcy's law that includes the density). #Radiative flux, the amount of energy moving in the form of photons at a certain distance from the source per steradian per second (J·m−2·s−1). Used in astronomy to study and classify stars. Also acts as a generalization of heat flux, which is equal to the radiative flux when restricted to the infrared spectrum. #Magnetic flux, the density of a magnetic field. == Electromagnetism == In the field of electromagnetism, flux is usually the integral of a vector quantity over a finite surface. The result of this integration is a scalar quantity. The magnetic flux is the integral of the magnetic vector field over a surface, and the electric flux is defined similarly. Using this definition, the flux of the Poynting vector over a specified surface is the rate at which electromagnetic energy flows through that surface. Confusingly, the Poynting vector is sometimes called the power flux, which is an example of the first usage of flux, above. p.357 It has units of watts per square metre (W/m2). ==Related pages== * Fluid dynamics ==References== ==Further reading== * Category:Physical quantity Category:Mathematics",
 "title": "Flux"
}