{
 "id": "550298",
 "text": "The arrondissement of La Rochelle is an arrondissement of France, in the Charente-Maritime department, Nouvelle-Aquitaine region. Its capital, and the prefecture of the department, is the city of La Rochelle. ==History== When the Charente-Maritime department was created on 1790, the arrondissement of La Rochelle was part of that original department. ==Geography== The arrondissement of La Rochelle is the smallest of the arrondissements of the Charente-Maritime department but the one with more people living in it. It has an area of , and a population of 210,151 inhabitants for a density of inhabitants/km². La Rochelle is the northernmost arrondissement of the department. It is formed from the old province of Aunis, with centre in La Rochelle, its historical capital. It is bordered to the north by the Vendée department, to the east by the Deux-Sèvres department, to the south by the arrondissement of Rochefort, and the Atlantic Ocean to the west. ==Composition== ===Cantons=== After the reorganisation of the cantons in France,Décret n° 2014-269 du 27 février 2014 portant délimitation des cantons dans le département de la Charente-Maritime cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of La Rochelle, there are only two cantons where not all their \"communes\" are in the arrondissement: the Châtelaillon-Plage and La Jarrie cantons. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of La Rochelle INSEE Code Canton Arrondissements Total Jonzac Rochefort La Rochelle Saintes Saint- Jean-d'Angély 1701 Aytré 4 4 1703 Châtelaillon-Plage 3 5 8 1705 Île de Ré 10 10 1706 La Jarrie 2 12 14 1708 Lagord 6 6 1709 Marans 20 20 1714 La Rochelle-1 part of La Rochelle part of La Rochelle 1715 La Rochelle-2 part of La Rochelle part of La Rochelle 1716 La Rochelle-3 part of La Rochelle part of La Rochelle ===Communes=== The arrondissement of La Rochelle has 58 communes; they are (with their INSEE codes): # Andilly (17008) # Angliers (17009) # Angoulins (17010) # Ars-en-Ré (17019) # Aytré (17028) # Benon (17041) # Le Bois-Plage- en-Ré (17051) # Bourgneuf (17059) # Charron (17091) # Châtelaillon-Plage (17094) # Clavette (17109) # La Couarde-sur-Mer (17121) # Courçon (17127) # Cramchaban (17132) # Croix-Chapeau (17136) # Dompierre-sur-Mer (17142) # Esnandes (17153) # Ferrières (17158) # La Flotte (17161) # La Grève-sur-Mignon (17182) # Le Gué-d'Alleré (17186) # L'Houmeau (17190) # La Jarne (17193) # La Jarrie (17194) # Lagord (17200) # La Laigne (17201) # Loix (17207) # Longèves (17208) # Marans (17218) # Marsilly (17222) # Montroy (17245) # Nieul-sur-Mer (17264) # Nuaillé-d'Aunis (17267) # Périgny (17274) # Les Portes-en-Ré (17286) # Puilboreau (17291) # Rivedoux-Plage (17297) # La Rochelle (17300) # La Ronde (17303) # Saint-Christophe (17315) # Saint-Clément-des-Baleines (17318) # Saint-Cyr-du-Doret (17322) # Saint-Jean-de-Liversay (17349) # Sainte-Marie-de- Ré (17360) # Saint-Martin-de-Ré (17369) # Saint-Médard-d'Aunis (17373) # Saint-Ouen-d'Aunis (17376) # Saint-Rogatien (17391) # Saint-Sauveur-d'Aunis (17396) # Sainte-Soulle (17407) # Saint-Vivien (17413) # Saint-Xandre (17414) # Salles-sur-Mer (17420) # Taugon (17439) # Thairé (17443) # Vérines (17466) # Villedoux (17472) # Yves (17483) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 17300 La Rochelle 74,998 La Rochelle-1, La Rochelle-2, La Rochelle-3 CA de la Rochelle 17028 Aytré 8,821 Aytré CA de la Rochelle 17274 Périgny 7,866 Aytré CA de la Rochelle 17200 Lagord 7,199 Lagord CA de la Rochelle 17094 Châtelaillon-Plage 6,064 Châtelaillon-Plage CA de la Rochelle 17291 Puilboreau 5,911 Aytré CA de la Rochelle 17264 Nieul-sur-Mer 5,761 Lagord CA de la Rochelle 17142 Dompierre-sur-Mer 5,344 Aytré CA de la Rochelle 17218 Marans 4,590 Marans Aunis Atlantique 17414 Saint-Xandre 4,463 Lagord CA de la Rochelle ==Related pages== * Arrondissements of the Charente- Maritime department * List of arrondissements of France ==References== La Rochelle",
 "title": "Arrondissement of La Rochelle"
}