{
 "id": "55119",
 "text": "Abstinence is a voluntary restraint from following a desire or appetite for certain bodily activities that are widely experienced as giving pleasure. Most frequently, the term refers to abstention from sexual intercourse, alcohol or food. Abstinence can be due to personal preferences, religious practices of practical considerations. In medicine abstinence also refers to discontinuation of an addictive drug. This may lead to intense craving for the drug or withdrawal syndromes. Abstinence from smoking is also recommended for those intending to undergo surgery. Abstinence may be a temporary or short- term goal meant for short durations of time. This includes refraining from compulsive eating or from compulsive drinking. The time and the measure is voluntary and is thus meant to enhance life. This is different from psychological mechanism of repression where the abstinence is not willingly adopted. In India, Buddhists, Jains, and some Hindus abstain from eating meat on the grounds both of health and of reverence for all sentient forms of life. Total abstinence from feeding on the flesh of cows is a hallmark of Hinduism. == Abstinence In Religion == Fasting, abstinence from food or drink or both for health, ritualistic, religious, or ethical purposes. The abstention may be complete or partial, lengthy, of short duration, or intermittent. For Jewish people the principal day of fast is Yom Kippur, the Day of Atonement. Those who follows Islam the period of fasting lasts during the whole month of Ramadan. Each day of the month of Ramadan, people of the faith, fast without anything to eat or drink from dawn to dusk. Hindus fast on several festivals sometimes going without food or water and sometimes living only on fruits and dairy products. Followers of Hinduism also observe certain days when they may abstain completely from eating meat, eggs or fish. This is called vegetarianism. Some faiths like Buddhism and Jainism may advocate complete vegetarianism. Catholics and Orthodox Christians abstain from food and drink for an hour prior to taking Holy Communion, and abstain from meat on Ash Wednesday and during Lent. Mormons abstain from certain foods and drinks by combining spiritual discipline. Mormons also fast one day a month and the money saved by skipping meals is donated to the needy. Both Jews and Muslims abstain from pork in their regular diet. Hindus abstain from beef in their diet. ==Related pages== ===Types of abstinence=== * Fasting :- Fasting is voluntarily not eating food for varying lengths of time. Fasting is used as a medical therapy for many conditions. It is also a spiritual practice in many religions. * Sexual abstinence :- Sexual abstinence means not having sexual intercourse with a partner. * Fapstinence :- NoFap, aka fapstinence, refers to abstaining from masturbation to achieve improved physical and mental health. * Smoking cessation :- Smoking cessation, usually called quitting smoking or stopping smoking, is the process of discontinuing tobacco smoking. * Sobriety :- Sobriety is the state of being sober, which can mean either not intoxicated or being solemn. If he takes a drink, an alcoholic ends a stretch of sobriety. * Straight edge :- Straightedge is a lifestyle some people follow, in which they abstain from drink, drugs (including alcohol) and casual sex. It is sometimes abbreviated to sXe. * Teetotalism :- Teetotalism is the practice or promotion of complete personal abstinence from alcoholic beverages. A person who practices teetotalism is called a teetotaler or is simply said to be teetotal. * Veganism :- Veganism is currently defined as a way of living that attempts to exclude all forms of animal exploitation and cruelty, be it from food, clothing, or any other purpose. * Vegetarianism :- Vegetarianism, the theory or practice of living solely upon vegetables, fruits, grains, legumes, and nuts, with or without the addition of milk products and eggs. ===Organizations=== * Alcoholics Anonymous * GreySheeters Anonymous * Pagans In Recovery * LifeRing Secular Recovery ===Related pages=== * Asceticism * Chastity * Chastity ring == References == Category:Lifestyles",
 "title": "Abstinence"
}