{
 "id": "551114",
 "text": "Clementi MRT Station (EW23) is an above-ground Mass Rapid Transit (MRT) station in Singapore. It is part of the East West MRT Line. Part of the East West Line, Clementi MRT Station is heavily used by commuters who live in Clementi itself or further west to go to work and also, by students of the National University of Singapore, Ngee Ann Polytechnic and other schools around Clementi. Hence, the station experiences high passenger traffic throughout the day due to it serving a wide range of passengers. The tracks between this station and Jurong East is the second longest between any two stations on the East West Line, the longest being the tracks between Expo and Changi Airport MRT Stations. It takes four minutes for trains to travel between these two stations. The station is also directly linked to the Clementi Mall and Clementi Bus Interchange. Together, they form the Clementi Integrated Transport Hub (ITH). It was opened on 12 March 1988. On 5 August 1993, at around 7.53 am, two trains collided in the station. It appeared that one train had stopped at the station for longer than usual after experiencing a technical fault, and then a second westward train hit the first. It was caused by a 50 litre oil spill. 156 commuters were injured, many of whom were on their way to work. Eight were admitted to three hospitals, while the rest received outpatient treatment. In the aftermath of the accident, SMRT said that it would replace the faulty maintenance locomotives and purchase new ones. It also introduced a new policy for station managers to inspect tracks for oil or foreign objects before the start of service. ==Exits== *A and D: Commonwealth Avenue West, Clementi Avenue 3, The Clementi Mall (via Linkway Bridge), NTUC Fairprice Supermarket, Cityvibe Shopping Centre, Clementi Polyclinic, Clementi Primary School, Clementi Town Secondary School, Clementi Sports Hall, Clementi Swimming Complex, Clementi Bus Interchange, Clementi Stadium, West Coast Recreational Centre *B and C: Commonwealth Avenue West, Clementi Avenue 4, Clementi Community Centre, Clementi Police Division Headquarters, Clementi NPC, Clementi NPP, Darussalam Mosque, Pei Tong Primary School, Clementi Avenue 2 Together with Commonwealth and Queenstown stations, this station will see the construction of an additional pedestrian link bridge linking the station to two new exits, one on each side of the road. The exits will be equipped with fare gates and ticketing machines. It was completed and opened on 25 August 2015. ==Gallery== File:Clementi MRT Station Concourse.jpeg|Clementi MRT Station Concourse. File:Clementi MRT Station- NewExit (Information-Board).jpg|Information board outside paid area at new exit. File:Clementi MRT Station-NewExit (Faregates).jpg|Faregates at the new exit File:ClementiMRT.JPG|A C151 train at Platform before HHPSD was implemented. ==References== ==Other websites== * Category:Mass Rapid Transit (Singapore) stations",
 "title": "Clementi MRT station"
}