{
 "id": "551421",
 "text": "Envelopment is the military tactic of attacking the enemy's flank or rear. This is done while keeping the enemy's attention focused on his front by the use of diversionary attacks. The envelopment makes the enemy fight in a direction they are the least prepared for. The maneuver requires a flank that can be attacked. Unlike a flanking maneuver, which uses the enemy's forward movement to create an attackable flank, envelopment depends on the enemy's defensive position, any obstacles and the terrain. The envelopment has both advantages and disadvantages. Advantages include being able to capture or defeat all or part of an opposing army. It offers less risk than other offensive maneuvers. Disadvantages include the possibility of an enemy counterattack on the weakened center or on the other flank. == Types of envelopment == * Turning movement where the object is to \"turn\" the enemy from his defensive position and force them to act. * Single envelopment is an attack on one flank or the enemy rear from one direction while holding their attention to their front.Yves J. Bellanger, U. S. Army Armored Division 1943-1945 (Raleigh, NC: Lulu Publishing, 2010), p. 6 * Double envelopment, also called a Pincer movement, requires three forces. One holds the center while the other two attack the right and left flanks. Once both flanking attacks reach the rear, the enemy is encircled. * Vertical envelopment is an envelopment from the sky.Tom McGowen, Assault from the Sky: Airborne Infantry of World War II (Brookfield, CT: Twenty-First Century Books, 2002) , pp. 6–12 First thought of by Benjamin Franklin, it was not practical until the invention of the airplane. Vertical envelopment uses paratroopers or other soldiers that arrive by air on the enemy's flank or rear. == Historic examples == Famous examples of the single envelopment include Alexander the Great who used it at the Battle of Gaugamela in 331 BC.Michiko Phifer, A Handbook of Military Strategy and Tactics (New Delhi: Vij Books India Private Limited, 2012), p. 3 Robert E. Lee used the tactic at the Battle of Chancellorsville in 1863. During World War II, German General Erwin Rommel used it successfully at the Battle of Gazala, which led directly to his capture of Tobruk in 1941. Some of the famous double envelopments include Hannibal at the Battle of Cannae where he defeated the Roman army in 216 BC. In 1781 during the American Revolutionary War, American general Daniel Morgan used it successfully against British general Banastre Tarleton, causing many of the British soldiers to surrender. In the 1944 Falaise Gap during Operation Overlord, German troops were caught in a double envelopment by British and American forces. ==References== == Other websites == * Rome 2 - Advanced Tactics - Double Envelopment at Cannae; YouTube Category:Military terminology Category:Military tactics",
 "title": "Envelopment"
}