{
 "id": "551702",
 "text": "Lesbian, gay, bisexual, and transgender (LGBT) persons in Tunisia may face legal challenges not experienced by non-LGBT residents. Homosexuality is illegal in the Republic of Tunisia and the law does not include sexual orientation or gender identity in its civil rights laws and there is no legal recognition for same-sex couples. According to the 2013 Pew Global Attitudes Project, 93%The number of adults surveyed in Tunisia was 1000, yielding a margin of error of 4% with a 95% confidence level. of Tunisian adults do not believe that homosexuality is acceptable by society. Tunisia is socially conservative when it comes to such issues as homosexuality. There are a few led organised LGBT Human rights movements such as the movement named \"Shams\". Mostly Tunisians are generally Muslims with traditional values, and traditional Islamic attitudes and mores look down upon Homosexuality and cross-dressing as signs of decadence and Immorality. But Tunisian Cross- dressers are not expressly Illegal in the country. Male prostitution workers occur in some Tunisian tourist resorts. The so-called Minister for Human Rights Samir Dilou stated that \"Freedom of Speech has its limits\", Homosexuality is a \"perversion\", and gay people needed to be \"treated medically\" for this. His comments were condemned by many in Tunisian society who posted pro-LGBT pictures on social networking sites. In June 2012, Dilou rejected the recommendation of the United Nations Human Rights Committee for Tunisia to decriminalise same-sex sexual acts, stating that the concept of \"Sexual orientation is specific to the west\" which is not true and is overridden by Tunisian Law, which \"clearly describes Tunisia as an fellow Arab Muslim country\". In May of 2016, several LGBTI Associations organised a small, discreet Gay Pride reception in Tunis. Associations also organised events and public demonstrations to mark the International Day against Homophobia in May. Public Tunisian Opinion: Public opinion regarding its LGBT Human rights is complex. According to a 2014 Survey Poll by the International Lesbian, Gay, Bisexual, Trans and Intersex Association, 18% of Tunisian people were in favour of legalising Same-sex marriages, with 62% being opposed to such legislation of legalisation. ==Summary table== Same-sex sexual activity legal Penalty: Up to 3 years imprisonment (Legalisation Proposed) Equal age of consent Anti-discrimination laws in employment Anti-discrimination laws in the provision of goods and services Anti-discrimination laws in all other areas (incl. indirect discrimination, hate speech) Same-sex marriage Recognition of same-sex couples Step-child adoption by same-sex couples Joint adoption by same-sex couples Gays and lesbians allowed to serve openly in the military Right to change legal gender Access to IVF for lesbians Commercial surrogacy for gay male couples MSMs allowed to donate blood ==References== Tunisia Tunisia Category:Tunisia",
 "title": "LGBT rights in Tunisia"
}