{
 "id": "551832",
 "text": "A red herring is something that misleads or distracts from an issue.Oxford English Dictionary. red herring, n. Third edition, September 2009; online version December 2011. http://www.oed.com/view/Entry/160314; accessed 18 December 2011. An entry for this word was first included in New English Dictionary, 1904. There are two ways in which it is used. One, it may be used as logical fallacy during an argument so that someone arguing does not have to answer a difficult question. For example, if a journalist asks a politician if the politician used any taxpayer money for his or her personal use, the politician may instead talk about the importance of increasing the pay of government officials without ever answering the question. Two, it can be used as a literary device that tricks readers or audiences into thinking that something is true when it really is not. It is common in stories like detective mystery books. For example, a character may own or hold a weapon similar to the weapon used to kill a character, but then it turns out that character was not the killer. The weapon was only a red herring. It has long been thought that the phrase came from kippers (a strong-smelling smoked fish) to train dogs to follow a scent, or to distract them from the correct route when hunting. However, most researchers today believe that the term was probably invented in 1807 by English polemicist William Cobbett. He may have have been talking about a time which he had used a kipper to distract dogs from chasing a hare, and that hunters never actually used kippers to train dogs.Evans, Ivor H. (ed.) (1981) Brewer's Dictionary of Phrase and Fable (Centenary edition, revised) New York: Harper & Row. p.549. The phrase was later borrowed to give a formal name for the logical fallacy and literary device. ==Related pages== *Ad hominem *Divide and conquer *Hate speech *Identity politics *Pork barrel *Psychological warfare *Smear campaign ==References== Category:Logical fallacies",
 "title": "Red herring"
}