{
 "id": "55189",
 "text": "Dame Judith Olivia Dench (born 9 December 1934) is an English movie, stage and television actress. Judi Dench has appeared in James Bond movies since 1995 as the character M. She has also appeared in other large budget movies such as Mrs. Henderson Presents and Ladies in Lavender. ==Personal life== Dench was born in Heworth, York, England. She is the daughter of Eleanora Olave (née Jones), a native of Dublin, and Reginald Arthur Dench, a doctor. Dench attended the Mount School, a Quaker independent secondary school in York. She became a Quaker. In 1971, Dench married British actor Michael Williams. Their only child is Tara Cressida Frances Williams. She was born on 24 September 1972. She is known professionally as Finty Williams. Dench and her husband starred together several times. Michael Williams died from lung cancer in 2001, aged 65. In early 2012, Dench said she had macular degeneration. Because of this, she needed someone to read scripts to her.Judi Dench says she isn't going blind, Reuters per ABC Online, 21 February 2012 Dench's brother, Jeffery Dench, died on 27 March 2014 at the age of 85. == Filmography == Year Title Role Notes 1964 Miss Humphries 1965 Four in the Morning WifeCalled Judy by her husband in the movie, but imdb refers to the character by this name. BAFTA Award for Most Promising Newcomer to Leading Film Roles 1965 Sally 1965 He Who Rides a Tiger Joanne 1968 Titania 1973 Luther Katherine 1974 Dead Cert Laura Davidson 1978 Langrishe, Go Down Imogen Langrishe BBC television film 1979 On Giant's Shoulders Hazel Wiles Nominated – BAFTA Award for Best Actress 1985 Narrator 1985 Wetherby Marcia Pilborough Nominated – BAFTA Award for Best Actress in a Supporting Role 1985 Eleanor Lavish BAFTA Award for Best Actress in a Supporting Role 1987 84 Charing Cross Road Nora Doel Nominated – BAFTA Award for Best Actress in a Supporting Role 1988 Mrs. Beaver BAFTA Award for Best Actress in a Supporting Role 1989 Henry V Mistress Quickly 1989 Behaving Badly Bridget Mayor Channel 4 television serial Nominated – British Academy Television Award for Best Actress 1992 Indiana Jones Sarah Fullman 1993–1997 ABC For Kids Announcer 1995 Jack and Sarah Margaret 1995 GoldenEye M 1996 Hamlet Hecuba 1997 Mrs. Brown Queen Victoria BAFTA Award for Best Actress in a Leading Role BAFTA Scotland Award for Best Actress in a Film Golden Globe Award for Best Actress – Motion Picture Drama Chicago Film Critics Association Award for Best Actress London Film Critics' Circle Award for British Actress of the Year Online Film Critics Society Award for Best Actress Satellite Award for Best Actress – Motion Picture Drama Nominated – Academy Award for Best Actress Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role 1997 Tomorrow Never Dies M 1998 Shakespeare in Love Queen Elizabeth I Academy Award for Best Supporting Actress BAFTA Award for Best Actress in a Supporting Role Kansas City Film Critics Circle Award for Best Supporting Actress National Society of Film Critics Award for Best Supporting Actress Nominated – Chlotrudis Award for Best Supporting Actress Nominated – Golden Globe Award for Best Supporting Actress – Motion Picture Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role 1999 Tea with Mussolini Arabella 1999 M 2000 Into the Arms of Strangers: Stories of the Kindertransport Narrator Documentary 2000 Elizabeth British Academy Television Award for Best Actress Golden Globe Award for Best Actress – Miniseries or Television Film Nominated – Primetime Emmy Award for Outstanding Lead Actress – Miniseries or a Movie Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie 2000 Chocolat Armande Voizin Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role Nominated – Academy Award for Best Supporting Actress Nominated – BAFTA Award for Best Actress in a Supporting Role Nominated – Golden Globe Award for Best Supporting Actress – Motion Picture Nominated – Satellite Award for Best Supporting Actress – Motion Picture 2001 Iris Iris Murdoch BAFTA Award for Best Actress in a Leading Role London Film Critics' Circle Award for British Actress of the Year Nominated – Academy Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Drama Nominated – Phoenix Film Critics Society Award for Best Actress Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role Nominated – Satellite Award for Best Actress – Motion Picture Drama 2001 Agnis Hamm Nominated – BAFTA Award for Best Actress in a Supporting Role Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Supporting Role 2002 The Importance of Being Earnest Lady Bracknell 2002 Die Another Day M 2002–05 Angelina Ballerina Miss Lilly Voice role 2003 Bugs! Narrator Short subject 2004 Home on the Range Mrs. Caloway Voice role 2004 Aereon 2004 Ladies in Lavender Ursula Widdington 2005 Pride & Prejudice Lady Catherine de Bourgh 2005 Mrs Henderson Presents Laura Henderson St. Louis Gateway Film Critics Association Award for Best Actress Nominated – Academy Award for Best Actress Nominated – BAFTA Award for Best Actress in a Leading Role Nominated – British Independent Film Award for Best Actress Nominated – Broadcast Film Critics Association Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Musical or Comedy Nominated – London Film Critics' Circle Award for British Actress of the Year Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role Nominated – Satellite Award for Best Actress – Motion Picture Musical or Comedy 2006 Narrator 2006 Casino Royale M Nominated – National Film Award for Best Actress 2006 Notes on a Scandal Barbara Covett British Independent Film Award for Best Actress Evening Standard British Film Award for Best Actress Nominated – Academy Award for Best Actress Nominated – BAFTA Award for Best Actress in a Leading Role Nominated – Broadcast Film Critics Association Award for Best Actress Nominated – Chicago Film Critics Association Award for Best Actress Nominated – Golden Globe Award for Best Actress – Motion Picture Drama Nominated – London Film Critics Circle Award for Best Actress Nominated – London Film Critics' Circle for British Actress of the Year Nominated – Online Film Critics Society Award for Best Actress Nominated – Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role Nominated – Satellite Award for Best Actress – Motion Picture Drama 2007 Go Inside to Greet the Light Narrator 2007, 2009 Cranford Miss Matty Nominated – British Academy Television Award for Best Actress Nominated – Golden Globe Award for Best Actress – Miniseries or Television Film Nominated – Primetime Emmy Award for Outstanding Lead Actress – Miniseries or a Movie Satellite Award for Best Actress – Miniseries or Television Film 2008 Quantum of Solace M 2009 Rage Mona Carvell 2009 Nine Liliane La Fleur Satellite Award for Best Cast – Motion Picture Nominated – Broadcast Film Critics Association Award for Best Cast Nominated – Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Nominated – Washington D.C. Area Film Critics Association Award for Best Ensemble 2011 Jane Eyre Mrs. Fairfax 2011 Pirates of the Caribbean: On Stranger Tides Noblewoman Cameo 2011 My Week with Marilyn Dame Sybil Thorndike Nominated – BAFTA Award for Best Actress in a Supporting Role 2011 J. Edgar Anna Marie 2012 The Best Exotic Marigold Hotel Evelyn 2012 Run For Your Wife Bag Lady Cameo 2012 Skyfall M Post-production == Awards and nominations == === Movies === ;Awards *1966: BAFTA Film Award for Best Newcomer – Four in the Morning *1989: BAFTA Film Award for Best Supporting Actress – A Handful of Dust *1989: BAFTA Film Award for Best Supporting Actress – A Room with a View *1998: BAFTA Film Award for Best Actress – Mrs. Brown *1998: Golden Globe Award for Best Actress in a Drama – Mrs. Brown *1998: Satellite Award for Best Actress in a Drama – Mrs. Brown *1999: Academy Award for Best Supporting Actress – Shakespeare in Love *1999: BAFTA Film Award for Best Supporting Actress – Shakespeare in Love *1999: SAG Award for Best Cast – Shakespeare in Love *2001: BAFTA Academy Fellowship Award *2001: SAG Award for Best Supporting Actress – Chocolat *2002: BAFTA movie Award for Best Actress – Iris *2007: British Independent Film Award for Best Actress – Notes on a Scandal *2009: Satellite Award for Best Cast – Nine ;Nominations *1986: BAFTA Film Award for Best Supporting Actress – Wetherby *1988: BAFTA Film Award for Best Supporting Actress – 84 Charing Cross Road *1998: Academy Award for Best Actress – Mrs. Brown *1998: SAG Award for Best Actress – Mrs. Brown *1999: Golden Globe Award for Best Supporting Actress – Shakespeare in Love *1999: SAG Award for Best Supporting Actress – Shakespeare in Love *2001: Academy Award for Best Supporting Actress – Chocolat *2001: BAFTA Film Award for Best Supporting Actress – Chocolat *2001: Golden Globe Award for Best Supporting Actress – Chocolat *2001: Satellite Award for Best Supporting Actress in a Drama – Chocolat *2002: Academy Award for Best Actress – Iris *2002: BAFTA Film Award for Best Supporting Actress – The Shipping News *2002: Golden Globe Award for Best Actress in a Drama – Iris *2002: SAG Award for Best Actress – Iris *2002: SAG Award for Best Supporting Actress – The Shipping News *2002: Satellite Award for Best Actress in a Drama – Iris *2005: British Independent Film Award for Best Actress – Mrs Henderson Presents *2005: Satellite Award for Best Actress in a Musical or Comedy – Mrs Henderson Presents *2006: Academy Award for Best Actress – Mrs Henderson Presents *2006: BAFTA Film Award for Best Actress – Mrs Henderson Presents *2006: Golden Globe Award for Best Actress in a Musical or Comedy – Mrs Henderson Presents *2006: SAG Award for Best Actress – Mrs Henderson Presents *2006: Satellite Award for Best Actress in a Drama – Notes on a Scandal *2007: Academy Award for Best Actress – Notes on a Scandal *2007: BAFTA Film Award for Best Actress – Notes on a Scandal *2007: Golden Globe Award for Best Actress in a Drama – Notes on a Scandal *2007: SAG Award for Best Actress – Notes on a Scandal *2007: Saturn Award for Best Actress – Notes on a Scandal *2009: Saturn Award for Best Supporting Actress – Quantum of Solace *2010: SAG Award for Best Cast – Nine *2012: BAFTA Film Award for Best Supporting Actress – My Week with Marilyn === Television === ;Awards *1968: BAFTA TV Award for Best Actress – Talking to a Stranger *1982: BAFTA TV Award for Best Actress – A Fine Romance, Going Gently and The Cherry Orchard *1982: Broadcast Press Guild Award for Best Actress – A Fine Romance *1985: BAFTA TV Award for Best Light Entertainment Performance – A Fine Romance *2001: BAFTA TV Award for Best Actress – The Last of the Blonde Bombshells *2001: Golden Globe Award for Best Actress in a Miniseries or Television Film – The Last of the Blonde Bombshells *2008: Satellite Award for Best Actress in a Miniseries or Television Film – Cranford ;Nominations *1980: BAFTA TV Award for Best Actress – ITV Playhouse, Macbeth and On Giant's Shoulders *1983: BAFTA TV Award for Best Light Entertainment Performance – A Fine Romance *1984: BAFTA TV Award for Best Actress – Saigon: Year of the Cat *1984: BAFTA TV Award for Best Light Entertainment Performance – A Fine Romance *1990: BAFTA TV Award for Best Actress – Behaving Badly *1998: BAFTA TV Award for Best Comedy Performance – As Time Goes By *2001: American Comedy Award for Funniest Female Performer in a TV Special – The Last of the Blonde Bombshells *2001: Emmy Award for Best Actress in a Miniseries or Television Film – The Last of the Blonde Bombshells *2001: SAG Award for Best Actress in a Miniseries or Television Movie – The Last of the Blonde Bombshells *2008: BAFTA TV Award for Best Actress – Cranford *2008: Emmy Award for Best Actress in a Miniseries or Television Film – Cranford *2009: Golden Globe Award for Best Actress in a Miniseries or Television Film – Cranford *2010: Emmy Award for Best Actress in a Miniseries or Television Film – Return to Cranford *2010: Satellite Award for Best Actress in a Miniseries or Television movie – Return to Cranford *2011: Golden Globe Award for Best Actress in a Miniseries or Television Film – Return to Cranford === Theatre === ;Awards *1977: Olivier Award for Best Actress in a Revival of a Play – Macbeth *1980: Evening Standard Award for Best Actress – Juno and the Paycock *1980: Olivier Award for Best Actress in a Revival of a Play – Juno and the Paycock *1982: Critics' Circle Theatre Award for Best Actress – The Importance of Being Earnest and A Kind of Alaska *1982: Evening Standard Award for Best Actress – The Importance of Being Earnest and A Kind of Alaska *1983: Olivier Award for Best Actress in a New Play – Pack of Lies *1987: Critics' Circle Theatre Award for Best Actress – Antony and Cleopatra *1987: Evening Standard Award for Best Actress – Antony and Cleopatra *1987: Olivier Award for Best Actress in a Play – Antony and Cleopatra *1996: Olivier Award for Best Actress in a Musical – A Little Night Music *1996: Olivier Award for Best Actress in a Play – Absolute Hell *1997: Critics' Circle Theatre Award for Best Actress – Amy's View *1999: Tony Award for Best Actress in a Play – Amy's View *2004: Society of London Theatre Special Award ;Nominations *1982: Olivier Award for Best Actress in a New Play – Other Places *1982: Olivier Award for Best Actress in a Revival of a Play – The Importance of Being Earnest *1992: Olivier Award for Best Director of a Musical – The Boys from Syracuse *1993: Olivier Award for Best Actress in a Play – The Gift of the Gorgon *1998: Olivier Award for Best Actress in a Play – Amy's View *1999: Drama Desk Award for Best Actress in a Play – Amy's View *1999: Olivier Award for Best Actress in a Play – Filumena *2005: Olivier Award for Best Supporting Performance – All's Well That Ends Well ==References== == Other websites== * Judi Dench Biography * Category:1934 births Category:Living people Category:English Academy Award winning actors Category:Actors from Yorkshire Category:Actors who played M Category:BAFTA Award winning actors Category:Companions of Honour Category:English movie actors Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:Knights and Dames Commander of the Order of the British Empire Category:Musical theater actors Category:People from York Category:Royal Society of Arts Category:Tony Award winning actors",
 "title": "Judi Dench"
}