{
 "id": "551949",
 "text": "The arrondissement of Bellac is an arrondissement of France, in the Haute- Vienne department, Nouvelle-Aquitaine region. Its capital is the city of Bellac. ==History== When the Haute-Vienne department was created on 1800, the arrondissement of Bellac was part of that original department. ==Geography== The arrondissement of Bellac is the most northern arrondissement of the Haute- Vienne department. It is bordered to the northwest and north by the Vienne department, to the east by the Creuse department, to the south by the arrondissement of Limoges, to the southwest by the arrondissement of Rochechouart and to the west by the Charente department. The arrondissement of Bellac is the second arrondissement of the department, after the arrondissement of Limoges, in area, , and population (39,744 inhabitants). It has a population density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France,Décret n° 2014-194 du 20 février 2014 portant délimitation des cantons dans le département de la Haute- Vienne cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Bellac, the canton of Bellac and the canton of Châteauponsac have all their communes. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Bellac INSEE Code Canton Arrondissements Total Bellac Limoges Rochechouart 8702 Ambazac 5 11 16 8703 Bellac 26 26 8704 Châteauponsac 32 32 ===Communes=== The arrondissement of Bellac has 62 communes; they are (with their INSEE codes)ː # Arnac-la-Poste (87003) # Azat-le-Ris (87006) # Balledent (87007) # La Bazeuge (87008) # Bellac (87011) # Berneuil (87012) # Bessines-sur-Gartempe (87014) # Blanzac (87017) # Blond (87018) # Breuilaufa (87022) # Le Buis (87023) # Bussière-Poitevine (87028) # Chamboret (87033) # Châteauponsac (87041) # Cieux (87045) # Compreignac (87047) # La Croix-sur-Gartempe (87052) # Cromac (87053) # Darnac (87055) # Dinsac (87056) # Dompierre-les-Églises (87057) # Le Dorat (87059) # Droux (87061) # Folles (87067) # Fromental (87068) # Gajoubert (87069) # Les Grands-Chézeaux (87074) # Jouac (87080) # Lussac-les-Églises (87087) # Magnac-Laval (87089) # Mailhac-sur-Benaize (87090) # Montrol-Sénard (87100) # Mortemart (87101) # Nantiat (87103) # Nouic (87108) # Oradour-Saint- Genest (87109) # Peyrat-de-Bellac (87116) # Rancon (87121) # Razès (87122) # Roussac (87128) # Saint-Amand-Magnazeix (87133) # Saint-Barbant (87136) # Saint-Bonnet-de-Bellac (87139) # Saint-Georges-les-Landes (87145) # Saint- Hilaire-la-Treille (87149) # Saint-Junien-les-Combes (87155) # Saint-Léger- Magnazeix (87160) # Saint-Martial-sur-Isop (87163) # Saint-Martin-le-Mault (87165) # Saint-Ouen-sur-Gartempe (87172) # Saint-Pardoux (87173) # Saint- Sornin-la-Marche (87179) # Saint-Sornin-Leulac (87180) # Saint-Sulpice-les- Feuilles (87182) # Saint-Symphorien-sur-Couze (87184) # Tersannes (87195) # Thiat (87196) # Thouron (87197) # Val-d'Issoire (87097) # Vaulry (87198) # Verneuil-Moustiers (87200) # Villefavard (87206) The communes in the arrondissement with more inhabitants are: INSEE code Commune Population (2014) Canton Intercommunality 87011 Bellac 4,117 Bellac Le Haut Limousin 87014 Bessines-sur-Gartempe 2,830 Ambazac Porte d'Occitanie 87041 Châteauponsac 2,053 Châteauponsac Gartempe – Saint-Pardoux 87047 Compreignac 1,815 Bellac Porte d'Occitanie 87089 Magnac-Laval 1,770 Châteauponsac Brame Benaize 87059 Le Dorat 1,728 Châteauponsac La Basse Marche 87103 Nantiat 1,579 Bellac L'Aurence et Glane Développement ==Related pages== * Arrondissements of the Haute-Vienne department * List of arrondissements of France ==References== Bellac",
 "title": "Arrondissement of Bellac"
}