{
 "id": "552025",
 "text": "The arrondissement of Rochechouart is an arrondissement of France, in the Haute-Vienne department, Nouvelle-Aquitaine region. Its capital is the city of Rochechouart. ==History== When the arrondissements were created in 1800 in France, the arrondissement of Rochechouart was one of those in the Haute- Vienne department. ==Geography== The arrondissement of Rochechouart is the most western arrondissement of the Haute-Vienne department. It is bordered to the west and north by the Charente department, to the northeast by the arrondissement of Bellac, to the east by the arrondissement of Limoges and to the south by the Dordogne department. The arrondissement of Rochechouart is the smallest arrondissement of the department, with area of only , and it is the one with fewest people living in it with a population of 37,877 inhabitants and a population density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France,Décret n° 2014-194 du 20 février 2014 portant délimitation des cantons dans le département de la Haute-Vienne cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are only two cantons in the arrondissement of Rochechouart and both have all their comunes in the arrondissement. These cantons are: * Rochechouart, with 22 communes; and * Saint-Junien, with 8 communes. ===Communes=== The arrondissement of Rochechouart has 30 communes; they are (with their INSEE codes)ː # Chaillac-sur-Vienne (87030) # Champagnac- la-Rivière (87034) # Champsac (87036) # Chéronnac (87044) # Cognac-la-Forêt (87046) # Cussac (87054) # Dournazac (87060) # Gorre (87073) # Javerdat (87078) # La Chapelle-Montbrandeix (87037) # Les Salles-Lavauguyon (87189) # Maisonnais-sur-Tardoire (87091) # Marval (87092) # Oradour-sur-Glane (87110) # Oradour-sur-Vayres (87111) # Pensol (87115) # Rochechouart (87126) # Saillat- sur-Vienne (87131) # Saint-Auvent (87135) #Saint-Bazile (87137) # Saint-Brice- sur-Vienne (87140) # Saint-Cyr (87141) # Saint-Junien (87154) # Saint-Laurent- sur-Gorre (87158) # Saint-Martin-de-Jussac (87164) #Saint-Mathieu (87168) # Saint-Victurnien (87185) # Sainte-Marie-de-Vaux (87162) # Vayres (87199) # Videix (87204) The communes in the arrondissement with more inhabitants are: INSEE code Commune Population (2014) Canton Intercommunality 87154 Saint-Junien 11,196 Saint-Junien Porte Océane du Limousin 87126 Rochechouart 3,798 Rochechouart Porte Océane du Limousin 87110 Oradour-sur-Glane 2,464 Saint-Junien Porte Océane du Limousin 87185 Saint-Victurnien 1,724 Saint-Junien Porte Océane du Limousin 87140 Saint-Brice-sur-Vienne 1,650 Saint-Junien Porte Océane du Limousin 87111 Oradour-sur-Vayres 1,530 Rochechouart Les Feuillardiers ==Related pages== * Arrondissements of the Haute-Vienne department * List of arrondissements of France ==References== Rochechouart",
 "title": "Arrondissement of Rochechouart"
}