{
 "id": "552268",
 "text": "thumb|right|350px| A preemptive war is one in which a country takes military action against another country or group that poses a real threat of waging a war against them. The purpose is to stop the threat before the country or group has a chance to strike. This is an old philosophy of war or of preventing a war. Sun Tzu, the ancient Chinese general, military expert and philosopher, said a supreme country would break resistance in its enemies without needing to fight them, but if fighting is needed, then a country should consider attacking first if doing so would gain them an advantage (since that increases their chance of ending the conflict quickly). A declaration of war may or may not come before the preemptive first strike.Matthew J. Flynn, First Strike: Preemptive War in Modern History (London; New York: Routledge, 2008), pp. 1–2 Preemptive war is thought of as a defensive act. This is true when it is clear an enemy is threatening an attack and that attack will do great harm. Also, a country which preemptively attacks another to defend itself can claim it was a moral act and avoid the label of an aggressor. == Difference from preventive war == There is often confusion between preemptive war and a preventative war. A preemptive war is one in which striking first gives a country an advantage over an enemy whose intentions are clearly to strike and do great harm. An example is the 1967 Six-Day War. When it became clear that Egypt and Syria were about to attack, Israel attacked them first in a preemptive strike. To satisfy the justification for a first strike, certain conditions should exist including: * The enemy shows an obvious intention to do harm. * The enemy is actively acting on the intentions so as to become a clear danger. * Not striking first will greatly increase the chances of being defeated. A preventive war is one in which a country attacks another in order to prevent them from having the capability of making war. A preventive war is one based on the idea that it is possible to tell with certainty the events that will take place. Article 51 of the United Nations Charter recognizes “the inherent right of individual or collective self-defence if an armed attack occurs”. For example, under the Bush Doctrine, the United States may attack any nation or group that may attack the country in the future even if it does not currently have that capability.Charles Kegley, World Politics: Trend and Transformation (Boston, MA: Cengage Learning, ©2009), p. 449 Calling it \"preemptive\" does not change it from being preventive. There are a few cases in which a preventive war may have been justified. For example, when Adolf Hitler became Chancellor of Germany in 1933, he openly said he would rearm Germany and seize the lands necessary for German \"living space.\" Nazi Germany claimed it wanted only what was due and then it would live in peace, but many in Europe already thought that was not true. When World War II started, nearly everyone had realized that the earlier statements had not been true, but it was too late to stop Hitler except by a costly and destructive war. Later, when the Japanese Empire decided to invade British Malaya and the Dutch East Indies for resources, they also attacked Pearl Harbor so the United States could not join the resulting war. == Related pages == * Attrition warfare * Shock tactics * Rearguard * Blockade * Ambush == References == == Other websites == * Noam Chomsky - 'preemptive war'; YouTube * THE BEST DEFENSE: Preventive War:YouTube Category:Military terminology Category:Military tactics",
 "title": "Preemptive war"
}