{
 "id": "55250",
 "text": "A placebo is a treatment for a disease or condition which is deliberately ineffective. The motive usually is that if a person believes that a medicine, diet, or other treatment is good for them, then it is good for them. Sometimes sick people who receive a placebo feel like they are getting better, and sometimes their bodies actually do get better. When patients have that response, it is called the \"placebo effect\". The term placebo effect (or placebo response) was introduced in 1920. It is the response of the subject which causes the observed effect, not the substance. Placebo is also the name of a popular English alt rock band, founded in 1994 in London. == Origins == John Haygarth tested a placebo effect in the 18th century.Booth C. 2005. The rod of Aesculapios: John Haygarth (1740-1827) and Perkins' metallic tractors. Journal of Medical Biography, 13 (3): 155–161. It showed \"to a degree which has never been suspected, what powerful influence upon diseases is produced by mere imagination\".Wootton, David 2006. Bad medicine: doctors doing harm since Hippocrates. Oxford University Press. Émile Coué, a French apothecary, working between 1882 and 1910, discovered what later came to be known as the \"Placebo effect\". He reassured his clients by praising each remedy's efficiency and leaving a small positive notice with each medication. In 1901 Coué began to study under hypnosis. In 1913, Coué and his wife founded La Société Lorraine de Psychologie appliquée.The Lorraine Society of Applied Psychology His book Self-mastery through conscious autosuggestion was published in England (1920) and in the United States (1922). == Placebos and blind trial == Placebos are used as part of blind trials. Blind trials work like this: Some people are given the medicine or treatment being tested, and others are given the placebo. No one knows who gets the real treatment and who gets the placebo. They are \"blind\" to their treatment. If researchers notice that the \"treatment group\" is different from the \"placebo group\" they will know that the difference is because of the treatment. Without a \"placebo group\" then researchers cannot know if those changes would have happened anyway, no matter which medicine people had taken. == Genuine effects of placebos == Placebos can have real effects on patients: that is what \"placebo effect\" means. Since a landmark paper in 1955 the placebo effect has been recognised and accepted by some,Beecher H.K. 1955. The powerful placebo. Journal of the American Medical Association 159 (17): 1602–1606. and denied by others.Hróbjartsson A. & Gøtzsche P.C. 2001. Is the placebo powerless? An analysis of clinical trials comparing placebo with no treatment. New England Journal of Medicine 344 (21): 1594–1602. However, there is no doubt that for certain conditions, the placebo effect does exist. Examples are: *Relief of pain. Studies of acupuncture have been positive.Linde K. et al 2007. The effect of patient expectations on outcomes in four randomized controlled trials of acupuncture in patients with chronic pain. Pain, 128, 264–71. Bausell R.B. et al 2005. Is acupuncture analgesia an expectancy effect? Preliminary evidence based on participants' perceived assignments in two placebo-controlled trials. Eval Health Prof. 28 (1): 9–26. The placebo effect is mediated by \"top-down\" processes from neocortex areas that influence expectations. \"Diseases lacking major 'top-down' or cortically based regulation may be less prone to placebo- related improvement\". * Parkinson's disease: Placebo relief is associated with the release of dopamine in the brain. * Depression: Placebos reducing depression affect many of the same areas that are activated by antidepressants with the addition of the prefrontal cortex * Caffeine: Placebo-caffeinated coffee causes an increase in bilateral dopamine release in the thalamus. * Glucose: The expectation of an intravenous injection of glucose increases the release of dopamine in the basal ganglia of men (but not women). * Methylphenidate: The expectation of intravenous injection of this drug in inexperienced drug users increased the release of dopamine in the ventral cingulate gyrus and nucleus accumbens, with this effect being largest in those with no prior experience of the drug. == Related pages == * Belief * Homeopathy * Medication * Optimism * Pessimism * Pharmacology * Scientific method == References == Category:Drugs",
 "title": "Placebo"
}