{
 "id": "552691",
 "text": "The following is a list of notable deaths in August 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==August== ===1=== *Anne of Romania, 92, French-born Romanian royal, queen consort of King Michael.Queen Anne of Romania – obituary *Frank Blas, 75, Guamanian politician, Lieutenant Governor (1987–1995), cancer.Former Lt. Gov. Frank Blas dead at 75 *Dai Dower, 83, Welsh flyweight boxer.Bocsiwr o Gymru wedi marw yn 83 oed *Trayan Dyankov, 40, Bulgarian football player and manager (FC Spartak Varna).БФС се преклони пред паметта на Траян Дянков *Andre Hajdu, 84, Hungarian-born Israeli composer and educator (Tel Aviv University, Bar-Ilan University).Acclaimed Israeli composer and educator Andre Hajdu dies at age 84 *Harrie Langman, 85, Dutch politician, Minister of Economic Affairs (1971–1973).In Memoriam – Harrie Langman, founding dean RSM *Jim Northrup, 73, American Ojibwe writer, kidney cancer. *Raimundo Ongaro, 92, Argentine union leader (CGTA). *Allen K. Ono, 82, American Army lieutenant general.Army’s first 3-star Asian-American general buried at Punchbowl ===2=== *Terence Bayler, 86, New Zealand actor (Monty Python's Life of Brian, Time Bandits, Harry Potter and the Philosopher's Stone).Harry Potter and Life of Brian actor Terence Bayler dies aged 86 *Jonathan Borwein, 65, Scottish mathematician.Jonathan Borwein dies at 65 *Forbes Carlile, 95, Australian swimming coach and modern pentathlete.Father of Australian Swimming Forbes Carlile Passes Away *Gordon Danby, 86, American physicist and inventor.Gordon T. Danby, Maglev inventor, dies *David Huddleston, 85, American actor (The Big Lebowski, Blazing Saddles, Santa Claus: The Movie), heart and kidney disease.David Huddleston, who played title role in 'The Big Lebowski,' dies at 85 *Robert Mabro, 81, Egyptian economist.Robert Mabro, Oil Guru Who Brokered OPEC Peace Deal, Dies at 81 *Franciszek Macharski, 89, Polish Roman Catholic cardinal, Archbishop of Kraków (1979–2005). *Juan Carlos Mesa, 86, Argentine humorist. *Álvaro Pérez Intriago, 79, Ecuadorian politician, member of the National Congress (1984–1986, 1996–2002) and Mayor of Quito (1978–1982).Falleció el exalcalde de Quito Álvaro Pérez *Ahmed Zewail, 70, Egyptian-American scientist, Nobel Prize in Chemistry winner (1999).Nobel Prize-winning Egyptian chemist Zewail dies ===3=== *Shahram Amiri, 38, Iranian nuclear scientist, execution by hanging.Iranian nuclear scientist Shahram Amiri executed for treason *Chris Amon, 73, New Zealand motor racing driver, cancer.Motor racing legend Chris Amon dies *Mansueto Bianchi, 66, Italian Roman Catholic prelate, Bishop of Volterra (2000–2006) and Pistoia (2006–2014).Bishop Mansueto Bianchi † *Elizabeth Colson, 99, American social anthropologist. *Louis Herman, 86, American marine biologist, bile duct cancer.Louis Herman, Who Talked With Dolphins, Dies at 86 *Mel Hurtig, 84, Canadian publisher and political activist, pneumonia.Author, nationalist Mel Hurtig dies at 84 *Abdul Jeelani, 62, American basketball player (Portland Trail Blazers, Dallas Mavericks).Abdul Jeelani dies at 62 *Steve LaTourette, 62, American politician, member of the U.S. House of Representatives from Ohio's 14th congressional district (1995–2013), pancreatic cancer. *Robert Rosencrans, 89, American businessman, chairman of C-SPAN.Robert Rosencrans, C-SPAN visionary, dies at 89 *Elliot Tiber, 81, American artist and writer (Taking Woodstock: A True Story of a Riot, a Concert and a Life), stroke.Elliot Tiber dies; artist, screenplay writer, Woodstock enabler was 81 ===4=== *Jean Antone, 73, American professional wrestler (AWA, AJW, CSW).'Little Miss Dynamite' Jean Antone dies *Eugene Atkinson, 89, American politician, member of the United States House of Representatives from Pennsylvania's 25th congressional district (1979–1983).Eugene V. Atkinson, former congressman and Beaver County commissioner, dead at 89 *Patrice Munsel, 91, American coloratura soprano.Famed opera singer Patrice Munsel, who left Spokane for Met fame, dies at 91 *Albert Nicholas, 85, American businessman and philanthropist.Albert O. \"Ab\" Nicholas dies *Snaffu Rigor, 69, Filipino singer and songwriter, lung cancer.Snaffu Rigor, 69 *Gaspar Saladino, 88, American comic letterer (Superman vs. Muhammad Ali, Arkham Asylum).Gaspar Saladino, R.I.P. *Zinaida Sharko, 87, Russian stage actress.Скончалась народная артистка РСФСР Зинаида Шарко *Charles Toubé, 58, Cameroonian footballer (Tonnerre Yaoundé, national team).Cameroun - Nécrologie: L’ancien Lion indomptable Charles Toube est mort *Ducksy Walsh, 50, Irish handball player.Legendary Kilkenny handballer Walsh dies ===5=== *Hans-Jürgen Appelrath, 64, German educator (University of Oldenburg).Trauer um ehemaligen Offis-Vorstand im Nordwesten *David Attwooll, 67, British poet and publisher, Erdheim–Chester disease.Liverpool University Press chair David Attwooll dies *Shamim Ara, 78, Pakistani actress and director. *Alan Bates, 71, American physician and politician, member of the Oregon House of Representatives (2001–2005) and Senate (since 2005).Oregon senator Alan Bates dies at age 71 *Mahim Bora, 92, Indian writer, brain haemorrhage.Former Sabha president dies at 93 *Sir Robin Chichester-Clark, 88, British politician, MP for Londonderry (1955–1974).Sir Robin Chichester-Clark, MP for Londonderry – obituary *Don Donnithorne, 90, New Zealand architect.Christchurch architect Don Donnithorne dies aged 90 *Alphons Egli, 91, Swiss politician, member of the Federal Council (1983–1989).Alt Bundesrat Alphons Egli gestorben *Richard Fagan, 69, American songwriter and musician, liver cancer.Songwriter Richard Fagan Dead at 69 *Harold Hillman, 85, British scientist, heart failure. *Eleuterio Fernández Huidobro, 74, Uruguayan politician, Minister of Defence (since 2011), respiratory failure. *Vander Lee, 50, Brazilian singer-songwriter.Aos 50 anos, morre o cantor Vander Lee, em Minas Gerais *Annet Nieuwenhuyzen, 85, Dutch actress.Actress Annet Nieuwenhuyzen dies *Salvador Q. Quizon, 91, Filipino Roman Catholic prelate, Auxiliary Bishop of Lipa (1979–2002).Bishop Salvador Quizon Quizon † *John Alan Robinson, 86, British philosopher, mathematician and computer scientist.John Alan Robinson Obituary ===6=== *José Becerra, 80, Mexican bantamweight boxer, world champion (1959–1960). *Philip Bialowitz, 90, Polish Holocaust survivor and resistance fighter.Holocaust hero passes away at 90 *Helen Delich Bentley, 92, American politician, member of the U.S. House of Representatives from Maryland's 2nd district (1985–1995), brain cancer.Helen Bentley dies at 92 *Midget Farrelly, 71, Australian surfer, world champion (1965), stomach cancer.Australia's first world surfing champion, Bernard 'Midget' Farrelly, dies aged 71 *Pete Fountain, 86, American clarinetist.Pete Fountain, who kept Dixieland swinging in New Orleans, dies at 86 *Temple Painter, 83, American harpsichordist and organist. *Samuel Robin Spark, 78, Scottish artist.Obituary: Robin Spark, artist *Norman Twain, 85, American stage and movie producer (Lean on Me, Bajour, My Dog Tulip).Broadway and Film Producer Norman Twain Passes Away at 85 *Michael Walter, 57, German luger, world champion (1985).Luge family mourns former World Champion Michael Walter *Jan Wilsgaard, 86, Norwegian-born Swedish automobile designer (Volvo). *Walter C. Young, 91, American politician, member of the Florida House of Representatives (1972–1992).Walter Young ===7=== *Yuri Bregel, 90, Russian historian.Yuri Bregel *Larry Brink, 92, American football player (Los Angeles Rams).Larry Brink *Bryan Clauson, 27, American racing driver, race crash. *Jack Günthard, 96, Swiss gymnast, Olympic champion (1952).Swiss gymnastics legend Jack Günthard dies *Jack Sears, 86, British race and rally driver.First BTCC champion Jack Sears obituary: 1930-2016 *Ruby Winters, 74, American soul singer (\"Make Love to Me\", \"I Will\").Ruby Winters Jenkins ===8=== *Edward Daly, 82, Northern Irish Roman Catholic prelate, Bishop of Derry (1974–1993).Bishop Edward Daly dies aged 82 *Željko Kopanja, 61, Bosnian newspaper editor.RS publisher and journalists Zeljko Kopanja dies *Klaus Weber, 80, German biologist.Prof. Dr. Dr. h. c. Klaus Weber ===9=== *Bill Alsup, 78, American race car driver, crane accident. *Panchu Arunachalam, 76, Indian screenwriter (Kazhugu, Paayum Puli) and director (Manamagale Vaa), cardiac arrest.Veteran Tamil film producer Panchu Arunachalam passes away at 76 *Miguel José Asurmendi Aramendía, 76, Spanish Roman Catholic prelate, Bishop of Tarazona (1990–1995) and Vitoria (1995–2016).Bishop Miguel José Asurmendi Aramendía, S.D.B.(1995.09.08 – 2016.01.08) *Gerald Grosvenor, 6th Duke of Westminster, 64, British billionaire property developer.Duke of Westminster dies aged 64 *Siegbert Horn, 66, German slalom canoeist, Olympic champion (1972), cancer.Siegbert Horn *Barry Jenner, 75, American actor (Star Trek: Deep Space Nine, Dallas, Family Matters), acute myeloid leukemia. *Aftab Ghulam Nabi Kazi, 96, Pakistani politician, Governor of the State Bank of Pakistan (1978–1986).Former governor State Bank AGN Kazi passes away *Bob Kiley, 80, American public transport planner, Alzheimer's disease.Robert Kiley, a Forceful Mass Transit Chief in Boston, London and New York, Dies at 80 *W. Carter Merbreier, 90, American television personality (Captain Noah and His Magical Ark).Philadelphia TV Pioneer Captain Noah Dies at Age 90 *Ernst Neizvestny, 91, Russian-American sculptor.Russian-American sculptor Ernst Neizvestny dies in New York *Kalikho Pul, 47, Indian politician, Chief Minister of Arunachal Pradesh (2016) and MLA for Hayuliang (since 1995), suicide by hanging.Kalikho Pul, Removed As Arunachal Chief Minister Weeks Ago, Found Hanging *Philippe Roberts-Jones, 91, Belgian art historian.Mort de Philippe Roberts-Jones *Wang Tuoh, 72, Taiwanese writer and politician, MLY for Keelung (1996–2008), complications of a heart attack. ===10=== *Neill Armstrong, 90, American football player (Philadelphia Eagles) and coach (Edmonton Eskimos, Chicago Bears). *C. Welborn Daniel, 90, American politician and judge, member of the Florida House of Representatives (1957–1964) and Senate (1964–1966, 1969–1971).Judge C. Welborn Daniel *John Saunders, 61, Canadian-born American sports journalist (ESPN, The Sports Reporters) and broadcaster (ESPN on ABC).Longtime ESPN Host John Saunders Dies at 61 *Gerhard Tötschinger, 70, Austrian actor, pulmonary embolism.Gerhard Tötschinger (1946–2016) ===11=== *James B. Dunn, 89, American politician, member of the South Dakota Senate (1973–2000). *Francesco Sgalambro, 82, Italian Roman Catholic prelate, Bishop of Cefalù (2000–2009).Bishop Francesco Sgalambro † *Len Steckler, 88, American photographer, illustrator and filmmaker.Len Steckler, Director on the Kids TV Special 'Free to Be … You and Me,' Dies at 88 *Sir Ian Turbott, 94, New Zealand diplomat, Administrator of Antigua (1958–1964) and Grenada (1964-1967).Tribute to Sir Ian Turbott AO CMG CVO CStJ *Glenn Yarbrough, 86, American folk singer (\"Baby the Rain Must Fall\", \"It's Gonna Be Fine\", \"San Francisco Bay Blues\").Singer Glenn Yarbrough dead at 86 ===12=== *Paul Kraabel, 83, American politician, member of the Washington House of Representatives (19711975), fall.Paul Kraabel, 83, was a former state legislator and Seattle councilman *Alison Piepmeier, 43, American writer, brain cancer. *Ljubomir Popović, 81, Serbian painter.Renowned Serbian painter Ljuba Popovic passes away *Ruby Wilson, 68, American blues, soul and gospel singer, heart attack.Ruby Wilson, ‘Queen of Beale Street,’ dies at 68 ===13=== *Kenny Baker, 81, British actor (Star Wars, Time Bandits, Flash Gordon).Kenny Baker, actor behind R2-D2, dies *Ettore Bernabei, 95, Italian television director and producer.Addio a Ettore Bernabei, papà della Rai del boom *Connie Crothers, 75, American jazz pianist, cancer.Connie Crothers, Jazz Pianist, Composer and Instructor, Dies at 75 *Pramukh Swami Maharaj, 94, Indian religious leader. *Françoise Mallet-Joris, 86, Belgian writer.Mort de la romancière Françoise Mallet-Joris *Joyce Carol Thomas, 78, American poet, playwright, motivational speaker, and author.Prize-winning author Joyce Carol Thomas dead at 78 ===14=== *Bi Chunfang, 89, Chinese Yue opera performer.著名越剧表演艺术家毕春芳去世 享年90岁(图) *Fyvush Finkel, 93, American actor (Picket Fences, Boston Public, A Serious Man), Emmy winner (1994).Fyvush Finkel, ‘Picket Fences’ and ‘Boston Public’ Actor, Dies at 93 *Robert Goff, Baron Goff of Chieveley, 89, British judge and law lord.Lord Goff of Chieveley *Aboud Jumbe, 96, Tanzanian politician, President of Zanzibar (1972–1984). *Hermann Kant, 90, German writer.Hermann Kant ist tot *Horst Meyer, 90, Swiss physicist.Duke Flags Lowered: Physics Professor J. Horst Meyer Dies *Na.Muthukumar, 41, Indian lyricist, jaundice. *Lorenzo Piani, 60, Italian singer and songwriter.Scomparso Lorenzo Piani della SND Music *Yasumitsu Toyoda, 81, Japanese baseball player (Saitama Seibu Lions, Tokyo Yakult Swallows), pneumonia.Japanese baseball Hall of Famer Toyoda dies ===15=== *Hotaru Akane, 32, Japanese pornographic actress.元AV女優・紅音ほたるさん急死 生前最後のツイートが話題 *Dalian Atkinson, 48, English footballer (Ipswich Town, Aston Villa), tased.Ex-Aston Villa Player Dalian Atkinson Dies In Police Tasering *Mauril Bélanger, 61, Canadian politician, MP for Ottawa—Vanier (since 1995), ALS.Mauril Bélanger dies at age 61 *Choo-Choo Coleman, 78, American baseball player (New York Mets, Philadelphia Phillies), cancer.Choo Choo Coleman, member of original Mets, dies at 80 *Bobby Hutcherson, 75, American jazz musician, emphysema.Bobby Hutcherson, Jazz Legend of the Vibraphone, Dies at 75 *Bambi Sheleg, 58, Chilean-born Israeli journalist and magazine editor, cancer.Award-winning journalist, advocate for tolerance dies ===16=== *João Havelange, 100, Brazilian football executive, President of FIFA (1974–1998).Former FIFA President Joao Havelange Dies at Age 100 *John McLaughlin, 89, American political commentator and television personality (The McLaughlin Group).John McLaughlin Dies: Longtime ‘The McLaughlin Group’ Host Was 89 ===17=== *James R. Bennett, 76, American politician, Secretary of State of Alabama (1993–2003, 2013–2015), cancer.Former Alabama Secretary of State Jim Bennett dies at 76 *Katharine Blodgett Gebbie, 84, American astrophysicist.Gebbie, Physics Visionary and Mentor to Nobel Laureates, Dies at 84 *Arthur Hiller, 92, Canadian-born American movie director (Love Story, The Hospital, The In-Laws), President of AMPAS (19931997).Arthur Hiller, Director of 'Love Story,' Dies at 92 ===18=== *Machali, 20, Indian tigress.Machli, Queen of Ranthambore and perhaps the most photographed tigress on earth: An obituary *Jérôme Monod, 85, French political advisor.Jérôme Monod, le patron qui comptait pour Chirac, est mort à 85 ans *Michael Napier Brown, 79, British actor, theatre director and playwright.Michael Napier-Brown Royal Theatre dies in hospital *John William Vessey Jr., 94, American military officer, Chairman of the Joint Chiefs of Staff (1982–1985).John W. Vessey Jr., Who Was Chairman of Joint Chiefs, Dies at 94 ===19=== *Donald Henderson, 87, American physician, smallpox eradication program director, broken hip complications.D.A. Henderson, ‘disease detective’ who eradicated smallpox, dies at 87 *Lou Pearlman, 62, American record producer, music manager (Backstreet Boys, NSYNC) and convicted criminal.Lou Pearlman, Disgraced Backstreet Boys Impresario, Dies at 62 *Nina Ponomaryova, 87, Russian discus thrower, Olympic champion (1952, 1960).Athletics: First Soviet Olympic champion Ponomareva passes away *Jack Riley, 80, American actor (The Bob Newhart Show, Boogie Nights), pneumonia and infection.Jack Riley Dies: ‘Bob Newhart Show’ & Mel Brooks Movie Actor Was 80 *Horacio Salgán, 100, Argentine tango musician.Washington Post, 'Horacio Salgán, Argentine tango composer and musical pathbreaker, dies at 100', 23 August 2016 *Mohammad Ali Samatar, 81, Somali politician, Prime Minister (1987–1990). *Mira Stupica, 93, Serbian actress (Parada).Legendary Yugoslav-Era Actress Mira Stupica Dies ===20=== *Lilia Cuntapay, 81, Filipino actress (Shake, Rattle & Roll, Brokedown Palace, Six Degrees of Separation from Lilia Cuntapay).Philippines’ ‘Horror Queen’ Lilia Cuntapay dies at 81 *Daniela Dessì, 59, Italian opera singer, cancer.Italian soprano Daniela Dessi dies suddenly *Irving Fields, 101, American pianist. *Jim Gibbons, 79, American football player (Detroit Lions), double pneumonia.Ex-Lions tight end Jim Gibbons dies at 79 *Harry Gilmer, 90, American football player (Washington Redskins, Detroit Lions).Harry Gilmer was a Tide superstar *Richard P. Korf, 91, American mycologist.Renowned mycologist Richard Korf dies at 91 *Eugeniusz Geno Malkowski, 73, Polish artist.Nie żyje znakomity polski malarz Eugeniusz GENO Małkowski. Publikował m.in na wNas.pl *Ignacio Padilla, 47, Mexican writer, traffic collision.Falleció Ignacio Padilla en accidente automovilístico *Brian Rix, Baron Rix, 92, British actor (And the Same to You) and activist (Mencap).Lord Brian Rix dead: Actor and prominent disability campaigner dies aged 92 *Louis Stewart, 72, Irish jazz guitarist.Irish jazz musician Louis Stewart dies aged 72 ===21=== *Sir Antony Jay, 86, English broadcaster, director and writer (Yes Minister).Sir Antony Jay obituary *Marin Moraru, 79, Romanian actor.Obituary: Romanian Actor Marin Moraru *Benet Rossell, 78, Spanish artist.El poliédrico artista Benet Rossell fallece a los 78 años ===22=== *Jordi Carbonell, 92, Spanish politician, President of ERC (1996–2004).Anti-Franco activist Jordi Carbonell dies aged 92 *S. R. Nathan, 92, Singaporean politician, President (1999–2011), stroke.Singapore's 6th president SR Nathan dies, age 92 *Gilli Smyth, 83, English singer (Gong).Gilli Smyth 1933–2016 *Toots Thielemans, 94, Belgian jazz guitarist, whistler and harmonica player (Man Bites Harmonica!).Toots Thielemans dies at 94 ===23=== *Steven Hill, 94, American actor (Mission: Impossible, Law & Order, The Firm).Steven Hill, who played DA Schiff on Law & Order, dead at 94 *Esther Jungreis, 80, Hungarian-born American religious leader, founder of Hineni, pneumonia.Esther Jungreis, 'the Jewish Billy Graham,' Dies at 80 *Berit Mørdre, 76, Norwegian cross-country skier, Olympic champion (1968).Skidronningen og pioneren Berit Mørdre er død *Jeremiah Joseph O'Keefe, 93, American World War II pilot ace and politician, Mayor of Biloxi, Mississippi (1973–1981).Jeremiah O’Keefe, Ace in His First World War II Battle, Dies at 93 *Reinhard Selten, 85, German economist, Nobel Memorial Prize in Economic Sciences winner (1994).Reinhard Selten, Game Theorist Who Won Nobel Prize, Dies at 85 *Elsie Wayne, 84, Canadian politician, MP from Saint John (1993–2004).Elsie Wayne, former PC MP and Saint John mayor, dies ===24=== *Juan Bell, 48, Dominican baseball player (Baltimore Orioles, Philadelphia Phillies, Milwaukee Brewers), kidney disease.Fallece ex pelotero dominicano Juan Bell a los 48 años *Michel Butor, 89, French writer.French writer Michel Butor dies aged 89: family *Gilles-Gaston Granger, 96, French analytic philosopher.Morre aos 96 anos o filósofo francês Gilles-Gaston Granger *George Kaczender, 83, Hungarian-born Canadian film director (In Praise of Older Women).George Kaczender, Director of the Steamy 'In Praise of Older Women,' Dies at 83 *Shūgorō Nakazato, 96, Japanese martial artist, pneumonia.仲里周五郎さん死去 沖縄空手界をリード *Walter Scheel, 97, German politician, President of West Germany (1974–1979), Minister for Foreign Affairs (1969–1974) and Vice-Chancellor (1969–1974).Walter Scheel, Ex-President of West Germany, Is Dead at 97 *Roger Y. Tsien, 64, American biochemist, Nobel Prize in Chemistry winner (2008).Roger Tsien, Longtime UCSD Professor, Nobel Prize Winner, Dies *Henning Voscherau, 75, German politician, Mayor of Hamburg (1988–1997), brain cancer.Obituary Henning Voscherau: A strong mayor in turbulent times *Nina Yeryomina, 82, Russian basketball player, world champion (1959).«Три секунды, которые потрясли мир»: в Подмосковье скончалась спортивный комментатор Нина Ерёмина ===25=== *Dame Margaret Anstee, 90, British diplomat, Director-General of the UN Office in Vienna (1987–1992). *Robert Todd Carroll, 71, American academic, scientific skeptic and writer (The Skeptic's Dictionary), cancer.Robert Todd Carroll (1945–2016) Obituary *James Cronin, 84, American physicist, Nobel Prize in Physics winner (1980).Nobel laureate James Cronin dies at 84 *Maria Eugénia, 89, Portuguese actress.Morreu a “menina da rádio” *Justin du Fresne, 74, New Zealand radio broadcaster.Former Newstalk ZB host Justin du Fresne dies *Warren Hinckle, 77, American political journalist, pneumonia. *Rodolfo Illanes, 56, Bolivian politician, beaten.Bolivia minister killed by protesting miners *Marvin Kaplan, 89, American actor (It's a Mad, Mad, Mad, Mad World, Alice, The Great Race).Marvin Kaplan, Character Actor Known for ‘Alice’ and ‘Top Cat,’ Dies at 89 *Anna Kurska, 87, Polish politician, member of the Senate (2001–2007).Śmierć Anny Kurskiej, matki Jacka i Jarosława... Kim była? *Sonia Rykiel, 86, French fashion designer.Iconic French fashion designer Sonia Rykiel dies at 86 *Eddy Silitonga, 65, Indonesian singer.Legendary singer Eddy Silitonga passes away at 65 *G. Spencer-Brown, 93, English polymath. *Rudy Van Gelder, 91, American recording engineer.Legendary jazz recording engineer Rudy Van Gelder dies at 91 ===26=== *Peter Barry, 88, Irish politician, Minister for Foreign Affairs (1982–1987), Tánaiste (1987), TD (1969–1997).Former Tanaiste Peter Barry dies after short illness *Paul Comi, 84, American actor (Cape Fear, The Towering Inferno, Rawhide). *Hatuey de Camps, 69, Dominican politician, President of the Chamber of Deputies (1979–1982), cancer.Fallece el dirigente político, Hatuey De Camps *Joe DeMaestri, 87, American baseball player (Philadelphia/Kansas City Athletics, New York Yankees).Joseph DeMaestri Obituary *Harald Grønningen, 81, Norwegian cross country skier, Olympic champion (1968).Langrennslegenden Harald Grønningen er død *Anton Pronk, 75, Dutch footballer (Ajax, national team), amyotrophic lateral sclerosis.Voormalig Ajax-speler Ton Pronk (75) overleden *Davoud Rashidi, 83, Iranian actor, stroke.داود رشیدی درگذشت *Jiří Tichý, 82, Czech football player (CH Bratislava, Sparta Prague, national team).Zemřel vicemistr světa Jiří Tichý (†82). Dělal kapitána ve Spartě a získal s ní tituly *Erika Wallner, 70, Argentine actress (Forty Degrees in the Shade, Story of a Poor Young Man, Bridge over the Elbe), kidney failure.Tristeza total: Murió la actriz Érika Wallner ===27=== *Cookie, 83, Australian-born Major Mitchell's cockatoo, world's oldest parrot, euthanized. *Zenzo Matsuyama, 91, Japanese screenwriter (The Human Condition, Long Journey into Love) and movie director (Burari Bura-bura Monogatari).映画監督の松山善三さん死去 「名もなく貧しく美しく」 ===28=== *José Balmes, 89, Spanish-born Chilean artist, complications from pneumonia. *Binyamin Ben-Eliezer, 80, Iraqi-born Israeli politician, member of the Knesset (1984–2014) and Defense Minister (2001–2002), kidney disease.Former Israeli Defense Minister Binyamin Fuad Ben-Eliezer Dies at Age 80 *Mr. Fuji, 82, American professional wrestler and manager (WWF).Mr. Fuji, WWE Hall of Famer, Dies at 82 *Juan Gabriel, 66, Mexican singer-songwriter (\"Hasta Que Te Conocí\", \"No Tengo Dinero\", \"Abrázame Muy Fuerte\"), heart attack.Juan Gabriel, superstar Mexican singer, dies at 66 *Lennart Häggroth, 76, Swedish ice hockey player, world champion (1962) and Olympic silver medalist (1964).Lennart \"Klimpen\" Häggroth är död ===29=== *Gene Wilder, 83, American actor (The Producers, Willy Wonka & the Chocolate Factory, Young Frankenstein) and writer, complications of Alzheimer's disease.Family: Wilder passed to 'Somewhere Over the Rainbow' ===30=== *Věra Čáslavská, 74, Czech gymnast, Olympic champion (1964, 1968), pancreatic cancer.Czech Olympic champion gymnast Vera Caslavska dies aged 74 *David Lavery, 67, American academic and television historian (Buffy the Vampire Slayer).MTSU professor and 'Buffy the Vampire Slayer' expert dies *Doris McLemore, 89, American teacher, last fluent speaker of the Wichita language.Last Fluent Speaker Of Wichita Tribal Language Dies *Marc Riboud, 93, French photographer.Marc Riboud, Photojournalist Who Found Grace in the Turbulent, Dies at 93 *Joe Sutter, 95, American aeronautical engineer, chief designer of the Boeing 747.Legendary 747 designer Sutter dies age 95 ===31=== *B. Daniel Riley, 70, American politician, member of the Maryland House of Delegates (1999–2003, 2007–2011). *Myron Tribus, 94, American organizational theorist.Myron Tribus ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *08 Category:August 2016 events",
 "title": "Deaths in August 2016"
}