{
 "id": "552953",
 "text": "Frederick County is a county located in the Commonwealth of Virginia. As of the 2020 census, the population was 91,419. Its county seat is Winchester. The county was formed in 1743 by the splitting of Orange County. It is Virginia's northernmost county. Frederick County is included in the Winchester, VA-WV Metropolitan Statistical Area. == History == The area that would become Frederick County, Virginia was populated by various indigenous peoples for thousands of years before European colonization. The \"Indian Road\" refers to a historic trail made by local tribes. Frederick County was established in 1743 from parts of Orange County, Virginia. At that time, \"Old Frederick County\" encompassed all or part of four counties in present-day Virginia — Shenandoah, Clarke, Warren, and Frederick. It also included five in present-day West Virginia — Hardy, Hampshire, Berkeley, Jefferson and Morgan. The Virginia Assembly named the new county for Frederick Louis, Prince of Wales. He was the oldest son of King George II of Great Britain. === Colonial Era === As Commander-in-Chief of the new Colonial Virginia regiment in 1754, Colonel George Washington's headquarters were located in Winchester before and during the French and Indian War. He resigned from military service in 1758. He was appointed a general by the Continental Congress sixteen years later. Meanwhile, Washington represented Frederick County in his first elective office, having been elected to the House of Burgesses in 1758 and 1761. Daniel Morgan was another famous general during the American Revolutionary War, from (present day Clarke County). === War of 1812 === === American Civil War === Winchester changed hands between the Confederate and Union Armies on average once every three weeks during the war. Many battles were fought in Frederick County. Some of those battles include: *First Battle of Kernstown, March 1862 *First Battle of Winchester, May 1862 *Second Battle of Winchester, June 1863 *Second Battle of Kernstown, July 1864 *Third Battle of Winchester (Battle of Opequon), September 1864 *Battle of Cedar Creek, October 1864 The first constitution of West Virginia provided for Frederick County to be added to the new state if approved by a local election. Unlike those of neighboring Berkeley and Jefferson counties, Frederick County residents voted to remain in Virginia.Hu Maxwell; Howard Llewellyn Swisher, History of Hampshire County, West Virginia (Morgantown, WV: A.B. Boughner, printer, 1897), p. 111 ==Geography== According to the U.S. Census Bureau, the county has a total area of . Of this, is land and (0.5%) is water. This is the northernmost county in the Commonwealth of Virginia. ==Demographics== In the 2020 census, there were 91,419 people, 34,073 households, and 24,741 families living in the county. The population density was 221.3 people per square mile (85.4/km²). There were 35,827 housing units. The breakdown by race was 80.4% White, 4.1% Black, 1.8% Asian, 0.3% Native American, 0.0% Pacific Islander, 5.3% from one other race, and 8.0% from two or more races. Hispanics and Latinos made up 10.9% of the people. The median (middle) age was 40.9 years. The age breakdown was 23.0% under age 18, 59.1% from 18 to 65, and 18.0% over 65. The gender breakdown was 49.2% male and 50.8% female. Of the households, 32.6% had children under age 18, 56.7% had a married couple, 6.7% had an unmarried couple, 21.9% had a woman with no partner, 14.8% had a man with no partner, and 21.9% had one person living alone. The average household size was 2.65 people. As of 2022, the median (middle) yearly income for a household was about $92,443, and the median income for a family was about $107,040. The per capita income was about $43,375. About 4.1% of families and 6.8% of all people lived below the poverty line. This includes 9.1% of children under 18 years old and 5.3% of people over 65 years old. == References == Category:Virginia counties Category:1740s establishments in Virginia",
 "title": "Frederick County, Virginia"
}