{
 "id": "553488",
 "text": "The arrondissement of La Châtre is an arrondissement of France, in the Indre department of the Centre-Val de Loire region. Its capital is the city of La Châtre. ==History== When the Indre department was created on 1800, the arrondissement of Châteauroux was part of that original department. ==Geography== The arrondissement of La Châtre is in the southeast of the Indre department. It has an area of and a population of 32,962 inhabitants. The lowest point in the arrondissement is high, in the \"commune\" of Ceaulmont, and the highest is high, in the \"commune\" of Crevant. It is bordered to the north by the arrondissement of Châteauroux, to the northeast by the arrondissement of Issoudun, to the east by the Cher departmen, to the south by the Creuse department and to the west by the arrondissement of Le Blanc. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: INSEE code Canton Le Blanc Châteauroux La Châtre Issoudun Total 3602 Argenton-sur- Creuse 12 8 20 3608 La Châtre 26 8 34 3611 Neuvy-Saint-Sépulchre 1 24 25 ===Communes=== The arrondissement of La Châtre has 51 communes; they are (with their INSEE codes)ː # Aigurande (36001) # La Berthenoux (36017) # Briantes (36025) # La Buxerette (36028) # Buxières-d'Aillac (36030) # Champillet (36038) # Chassignolles (36043) # La Châtre (36046) # Cluis (36056) # Crevant (36060) # Crozon-sur-Vauvre (36061) # Feusines (36073) # Fougerolles (36078) # Gournay (36084) # Lacs (36091) # Lignerolles (36095) # Lourdoueix-Saint-Michel (36099) # Lourouer-Saint-Laurent (36100) # Lys-Saint-Georges (36108) # Le Magny (36109) # Maillet (36110) # Malicornay (36111) # Mers-sur-Indre (36120) # Montchevrier (36126) # Montgivray (36127) # Montipouret (36129) # Montlevicq (36130) # La Motte-Feuilly (36132) # Mouhers (36133) # Néret (36138) # Neuvy- Saint-Sépulchre (36141) # Nohant-Vic (36143) # Orsennes (36146) # Pérassay (36156) # Pouligny-Notre-Dame (36163) # Pouligny-Saint-Martin (36164) # Saint- Août (36180) # Saint-Chartier (36184) # Saint-Christophe-en-Boucherie (36186) # Saint-Denis-de-Jouhet (36189) # Saint-Plantaire (36207) # Sainte-Sévère-sur- Indre (36208) # Sarzay (36210) # Sazeray (36214) # Thevet-Saint-Julien (36221) # Tranzault (36226) # Urciers (36227) # Verneuil-sur-Igneraie (36234) # Vicq- Exemplet (36236) # Vigoulant (36238) # Vijon (36240) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 36046 La Châtre 4,278 La Châtre La Châtre et Sainte-Sévère 36141 Neuvy-Saint-Sépulchre 1,665 Neuvy-Saint-Sépulchre Le Val de Bouzanne 36127 Montgivray 1,654 Neuvy-Saint-Sépulchre La Châtre et Sainte- Sévère 36001 Aigurande 1,481 Neuvy-Saint-Sépulchre La Marche Berrichonne 36109 Le Magny 1,072 Neuvy-Saint-Sépulchre La Châtre et Sainte-Sévère 36056 Cluis 1,006 Neuvy-Saint-Sépulchre Le Val de Bouzanne 36189 Saint-Denis-de-Jouhet 957 Neuvy-Saint-Sépulchre La Marche Berrichonne 36180 Saint-Août 858 La Châtre La Châtre et Sainte-Sévère 36208 Sainte-Sévère-sur-Indre 809 La Châtre La Châtre et Sainte-Sévère == Related pages == * Arrondissements of the Indre department * List of arrondissements of France ==References== La Chatre",
 "title": "Arrondissement of La Châtre"
}