{
 "id": "553563",
 "text": "The Truyère () is a river in southwestern France. It is the main tributary of the Lot river. ==Geography== The Truyère river has a length of and a drainage basin with an area of . Its average yearly discharge (volume of water which passes through a section of the river per unit of time) is 69.5 cubic metres per second at Entraygues-sur-Truyèret. ===Course=== The Truyère starts in the Margeride mountains, south-western Massif Central, north of Mende, in the \"commune\" of La Villedieu (Lozère department), at an altitude of about . The Truyère flows to the west, in general, and passes through 2 regions, 3 departments and 44 communes: * Occitanie region ** Lozère: Le Malzieu-Ville, Chaulhac, Saint-Léger-du-Malzieu, Rimeize, Blavignac, Saint-Pierre-le-Vieux, Fontans, Saint-Gal, Serverette * Auvergne-Rhône-Alpes region ** Cantal: Saint- Martial, Chaliers, Oradour, Fridefont, Alleuze, Faverolles, Neuvéglise * Occitanie region ** Aveyron: Entraygues-sur-Truyère, Thérondels, Cantoin, Montézic, Brommat Finally, it flows, as a right tributary, into the Lot river, in Entraygues-sur-Truyèret, in the Aveyron department, at of altitude. The Garabit Viaduct is a bridge over the Truyère near Ruynes-en-Margeride that was built by Gustave Eiffel. There are several dams over the river to produce hydroelectricity. ==Main tributaries == The main tributaries of the Truyère river are: Left tributaries: * Rimeize - 37.3 km * Bès - 66.7 km * Lebot - 22.7 km * Argence Vive - 23.9 * Selves - 44.5 km Right tributaries: * Ander - 36.2 km * Brezons - 28.5 km * Bromme - 28.7 km * Goul - 52 km ==Gallery== Truyere.JPG|Truyère river from Chaliers France, Aveyron, Barrage de Sarrans.jpg|Sarrans dam Truyère Château d'Alleuze.jpg|Castle of Alleuze, Cantal Garabit.jpg|The Garabit Viaduct ==Related pages== * List of rivers of France == References == ==Other websites== * La Truyère (O7--0250) Category:Rivers of Occitanie Category:Rivers of Auvergne-Rhône-Alpes",
 "title": "Truyère"
}