{
 "id": "553566",
 "text": "Military terminology is the words and acronyms used by military organization and members of various militaries. Military terms may have the same spelling as common words but mean something very different., p. 1 Common terms may also differ between militaries of English-speaking countries. They also differ in their use of abbreviations. For example, British and American abbreviations for the same thing may be very different. Military terms can also be specific to one branch of a nation's military or to a specific war or period of time. == Doublespeak == Some terms are intentionally intended to obscure, disguise, distort, or otherwise change the meaning of words. This is called \"doublespeak\". For example, the United States reduction of troop strength in Afghanistan is called by American troops \"the retrograde.\" This is from an old military euphemism meaning to retreat (no military likes to admit it retreats). Some phrases are so strange that nobody outside the military understands them. \"15 minutes prior to 15 minutes prior\" refers to military people being told to show up 15 minutes early for everything. So when a commanding officer says there will be a meeting at \"06:00\" (6:00 a.m. on the 24-hour clock), it means to show up at 05:45. When junior officers repeat the order to the sergeant, to him it means 05:30, and so on. By the time it filters down to the lowest ranking soldier, it can mean be there by midnight. == Acronyms == To listen to military people talking, everything seems to be in acronyms. For instance, \"I was on the FOB when the IDF hit, so I radioed the TOC\" (I was on the Forward Operating Base when the Ineffective Direct Fire hit, so I radioed the Tactical Operations center). Military people seem to love using acronyms which is probably why there are so many of them. New recruits, military families and even seasoned veterans are expected to know most if not all the current acronyms. == Phonic alphabet == To say letters out loud, over the phone or when it might be unclear what letter is being pronounced a phonic alphabet is used. On ships, a navy would use flags for different letters of the alphabet. The NATO phonetic alphabet (with flags) is: A Alpha F Foxtrot K Kilo P Papa U Uniform Z Zulu B Bravo G Golf L Lima Q Quebec V Victor C Charlie H Hotel M Mike R Romeo W Whiskey D Delta I India N November S Sierra X X-ray E Echo J Juliet O Oscar T Tango Y Yankee This is used often in military acronyms. For example, Bravo Zulu means \"well done\", a compliment. It was taken from naval signal manuals meaning the same thing. However, if someone were to say \"B Z\" nobody would understand. if someone used the term Whisky Tango Foxtrot it means \"what the fuck?\" Posed as a question or used as an interjection, it is at least a little more polite than saying the words. == Terms most people get wrong == * Soldier – Does not mean marine s (called marines), navy personnel (called sailors or seamen) or air force personnel (called airmen). A soldier is a member of an army. * Commander – Is a rank of naval officer or the person in command of a military unit. However, the highest ranking officer in each branch of the military is not a commander nor is the Chairman of the Joint Chiefs of Staff. * Gun – Most soldiers and marines carry rifles and in military terminology a rifle is not a gun. A pistol is a gun and a machine gun is a gun. Confusingly, in civilian terminology a rifle is a gun. The movies and television are usually responsible for getting this wrong. An exception is the 21-gun salute. Historically, when a ship entered port it fired all its cannons (called guns in navy-speak) emptying them to show it was friendly. * Bazooka — A bazooka was a World War II shoulder-fired anti-tank rocket launcher that was used up to about the end of the Vietnam War. However, modern portable rocket launchers are not bazookas. * Hummer – A Hummer is a civilian vehicle not to be confused with the Humvee or HMMWV which stands for the High Mobility Multipurpose Wheeled Vehicle. A soldier or marine would never call a Humvee a Hummer or vice versa. ==Military symbology== Many armed forces have developed elaborate sets of symbols that act like a written language to describe units, activities, and missions. These symbols can be placed on maps to indicate locations, used in drawings to show military organization structures, or even painted on vehicles to indicate roles. Today, many nations use the military symbology standardized by NATO and evolved from the symbols used by the US Army during the Second World War. Other nations may use military symbology from the former Warsaw Pact or systems that they created themselves. == References == == Other websites == * Military Acronyms, Initialisms, and Abbreviations * War & Military Vocabulary: Understand the news; YouTube * Top 10 Military Acronyms; YouTube Category:Military terminology Category:War",
 "title": "Military terminology"
}