{
 "id": "553759",
 "text": "Sensory deprivation makes it impossible for a person to use one or more of their senses. Sensory deprivation devices can be simple, like blindfolds or hoods, which make it impossible to see. More complicated sensory deprivation devices can cut off a person's sense of smell, touch, taste, thermoception (ability to sense heat), and their sense of gravity. Sensory deprivation can be used in good or bad ways. If a person chooses to go through sensory deprivation for a short time, they may feel relaxed, and it may be easier for them to meditate. However, if a person is forced to go through sensory deprivation, or the deprivation lasts for a long time, it can cause hallucinations, very bad anxiety, strange thoughts, and depression.Stuart Grassian Psychiatric effects of solitary confinement (PDF) This article is a redacted, non-institution and non-inmate specific, version of a declaration submitted in September 1993 in Madrid v. Gomez, 889F.Supp.1146. *Grassian Psychopathological effects of solitary confinement American Journal of Psychiatry Online 1983; 140: 1450-1454 *Haney Mental Health Issues in Long- Term Solitary and \"Supermax\" Confinement, Crime Delinquency. 2003; 49: 124-156 *Daryl Matthews. Physicians' Obligation to Speak Out for Prisoners' Health, American Medical Association. *Karen Franklin Segregation Psychosis *Harold I. Schwartz, Death Row Syndrome and Demoralization: Psychiatric Means to Social Policy Ends J Am Acad Psychiatry Law 33:2:153-155 (2005) Some countries in NATO have used sensory deprivation techniques on prisoners because these techniques do not qualify as torture under international laws. ==Sensory deprivation as treatment== Restricted environmental stimulation therapy (REST) uses sensory deprivation to help a person relax and treat problems like pain. The sensory deprivation sessions are short, and the person can choose to stop the session at any time. There are two basic kinds of REST. ===Chamber REST=== In Chamber REST, a person lies on a bed in a completely dark, sound-proof room for up to 24 hours. They have food, drink, and a toilet in the room with them. They can choose to leave the room at any time. However, fewer than 10% of people who go through Chamber REST actually leave the room before 24 hours. ===Flotation REST=== Flotation REST uses a tank or pool filled with warm water and Epsom salts. The Epsom salts make the water so dense that a person floats in the tank like they do not weigh anything. People usually stay in a flotation tank (also called an isolation tank for about an hour. Less than 5% of people leave the flotation tank before the hour has passed. Researchers in the United States and Sweden have found that flotation REST decreases pain and stress. Flotation REST also makes some people feel more creative, helps them solve problems more easily, and lowers their blood pressure. ===Other uses=== Researchers have studied REST as a treatment for alcoholism, cigarette smoking, and the use of other drugs. Studies that lasted from one to five years showed that 25% of smokers who used REST were able to stop smoking. If smokers also used other ways to stop smoking along with REST (like changing their behaviors), 50% were able to stop smoking. When smokers used REST and went to weekly support groups, 80% were able to stop smoking. (To compare, only 5% of smokers who use only a nicotine patch are able to stop smoking.) Alcoholics who got two hours of REST, along with anti-alcohol educational messages, drank 56% less alcohol - less than half than they were drinking before - within two weeks. Three and six months after the first treatment, these alcoholics were still drinking 56% less alcohol than they did before REST. The University of Arizona studied the use of chamber REST to treat substance abuse. They treated one group of people with both REST and regular substance abuse treatment. 43% of these people stopped using drugs and were still drug-free after four years. They treated another group with regular substance abuse treatment, but no REST. None of these people were still drug- free after eight months. ==Sensory deprivation on prisoners== Security forces in Northern Ireland used sensory deprivation on prisoners in the early 1970s. They used \"the five techniques\" of sensory deprivation on prisoners they suspected of belonging to paramilitary organizations:Ireland v. the United Kingdom (1978), paragraph 96 * Wall-standing (forcing prisoners to stay for hours in stress positions - positions that cause pain or put stress on one part of the body, like the fingers) * Hooding (putting a dark bag over the prisoner's head so they cannot see, and leaving it there all the time, except during interrogations) * Noise (keeping prisoners in rooms where there was a constant loud hissing noise, except during interrogations) * Not letting prisoners sleep * Not giving prisoners food or drink In 1972, the United Kingdom formally stopped using these techniques to interrogate prisoners. In 1976, the Irish government sued the United Kingdom in the European Commission on Human Rights (Ireland v. United Kingdom, 1976 Y.B. Eur. Conv. on Hum. Rts. 512, 748, 788-94 (European Commission of Human Rights)). Ireland argued that the \"five techniques\" were torture. The Commission agreed, and said that if the five techniques were used together, they \"amount to torture\".Security Detainees/Enemy Combatants: U.S. Law Prohibits Torture and other Cruel, Inhuman or Degrading Treatment or Punishment Footnote 16David Weissbrodt materials on torture and other ill-treatment: 3. European Court of Human Rights (doc) html: Ireland v. United Kingdom, 1976 Y.B. European Convention on Human Rights. 512, 748, 788-94 (European Commission of Human Rights) However, this decision was reversed on appeal. In 1978, the European Court of Human Rights (ECtHR) looked at the United Nations' definition of torture. They decided that the five techniques \"did not [cause] suffering of the particular intensity and cruelty implied by the word torture\". However, they also said the five techniques were \"a practice of inhuman and degrading treatment\", which is not allowed under the European Convention on Human Rights, article 3.Ireland v. the United Kingdom (1978), paragraph 167 ==References== Category:Psychological abuse Category:Law enforcement techniques Category:Sensory system Category:Perception",
 "title": "Sensory deprivation"
}