{
 "id": "553981",
 "text": "Murray Gell-Mann (September 15, 1929 – May 24, 2019) was an American physicist who received the 1969 Nobel Prize in Physics for his work on the theory of elementary particles. He was the Robert Andrews Millikan Professor of Theoretical Physics Emeritus at the California Institute of Technology, a Distinguished Fellow and co-founder of the Santa Fe Institute, Professor in the Physics and Astronomy Department of the University of New Mexico, and the Presidential Professor of Physics and Medicine at the University of Southern California. Gell-Mann has also worked at CERN, as a John Simon Guggenheim Memorial Foundation Fellow in 1972.Scientific publications of M. Gell-Mann on INSPIRE-HEP ==Works== He was known for his study of particle physics, the smallest parts that make up the universe. These small particles behaved in ways that did not appear to follow the known laws of physics, and Gell-Mann came up with the idea of giving them a strangeness number which could allow them to be compared and put into categories. He also came up with idea that parts of an atom, the proton ad the neutron were made up of even smaller particles. He called the quarks, a nonsense work from James Joyce's book, Finnigan's Wake.Murray Gell-Mann Biography -- Academy of Achievement: Murray Gell-Mann Biography -- Academy of Achievement , accessdate: September 17, 2016 Gell-Mann then developed the idea that quarks were held together inside the nucleus by a force he called \"color\", and this force could be given a quantum number. With Richard Feynman he discovered a weak interaction between sub- atomic particles. He researched string theory which could explain what makes up the smallest particles and forces. ==Personal life== Gell-Mann was an agnostic.The International Academy of Humanism at the website of the Council for Secular Humanism. Retrieved 18 October 2007. Some of this information is also at the International Humanist and Ethical Union website Gell-Mann supported Barack Obama for the United States presidency in October 2008.Nobel Laureate Murray Gell-Mann endorses Obama, at youtube.com Retrieved 15 February 2017 Gell-Mann died on May 24, 2019 at his home in Santa Fe, New Mexico, aged 89. ==References== ==Other websites== * Gell-Mann's Home Page at SFI ** \"Beauty, truth and ... physics?\" (TED2007) ** \"The ancestor of language\" (TED2007) * Murray Gell-Mann Video Interview with the Academy of Achievement in 1990 * Murray Gell-Mann talks quarks (Video) * Membership at the Council on Foreign Relations Category:1929 births Category:2019 deaths Category:Nobel Prize in Physics winners Category:People from Manhattan Category:Scientists from New York City Category:American theoretical physicists",
 "title": "Murray Gell-Mann"
}