{
 "id": "554095",
 "text": "Ataxia is trouble with balance that is not caused by a person's muscles being weak. Instead, ataxia is caused by a neurological problem. Ataxia is not a diagnosis. It is a neurological sign. It is a sign of damage to the parts of the nervous system that control balance. There are three different types of ataxia. Each type has many possible causes. ==Types== ===Cerebellar ataxia=== Cerebellar ataxia is ataxia that is caused by a problem with a person's cerebellum. The cerebellum is the part of the brain that controls balance and coordination. It makes the body move smoothly and controls movements like walking. People with cerebellar ataxia may have trouble with actions like these: * Controlling how hard their muscles contract, how fast, and in what direction * Getting their muscles to work together (asynergy) * Walking (gait abnormality) * Moving their eyes * Swallowing (dysphagia) * Saying words (dysarthria) * Judging how far away something is (dysmetria) * Reacting quickly ===Sensory ataxia=== Sensory ataxia is caused by the loss of proprioception (knowing where parts of the body are). It is usually caused by damage to the parts of the spinal cord that carry information about proprioception to the brain. However, it can also be caused by damage to the parts of the brain that receive that information (the cerebellum, the thalamus, and the parietal lobes of the brain). A person with sensory ataxia may have these symptoms: * They may have trouble walking. They may stomp their feet and hit their heels hard against the ground while they walk * Trouble walking that gets worse when the person cannot see well ** For example, if the person stands with their feet together and their eyes closed, their balance problems will get much worse, and they may fall. Doctors call this a \"positive Romberg's test. ===Vestibular ataxia=== Vestibular ataxia is caused by problems with the vestibular system. This is the body's main sensory system that controls balance and movement. It includes the inner ear. Along with balance problems, people with vestibular ataxia may have: * Nausea and vomiting * Dizziness == Causes == There are many different causes of ataxia. The National Ataxia Foundation breaks up these causes into three categories: acquired, genetic, and idiopathic. === Acquired ataxia === A person is not born with acquired ataxia. Acquired means that something happened during the person's life to cause the ataxia. Causes of acquired ataxia can include: * Stroke, brain tumor, or multiple sclerosis ** A person can acquire (get) any of the three types of ataxia from these problems in the brain, depending on where the problem happens. For example, if a person has a brain tumor in their cerebellum, they may get cerebellar ataxia. If the tumor is in the vestibular system, the person may get vestibular ataxia. * Spinal cord injuries * Problems that damage parts of the cerebellum. These problems can include: ** Alcohol abuse, drug abuse, or use of certain medications which can cause ataxia * Hypothyroidism ** Head injury ** Viral illnesses, like viral meningitis ** Celiac disease * Mercury poisoning * Radiation poisoning * Vitamin B12 deficiency (not having enough vitamin B12 in the body) === Genetic (hereditary) ataxia === Genetic ataxia is caused by hereditary disorders that damage the cerebellum or spine. People are born with these disorders. In most cases, they get worse over time. === Idiopathic ataxia === Idiopathic means that doctors cannot find a cause for a person's ataxia. Idiopathic ataxias often cause symptoms that come and go. Many doctors and scientists think these ataxias are caused by a combination of things inside the body (like gene problems) and things outside the body (like the things happening in a person's life). However, they are still researching the causes of idiopathic ataxias. == Treatment == Ataxia can be treated. However, treatment usually does not make ataxia go away completely. Some treatments for ataxia include: A review of the management of degenerative ataxia was published in 2009. * Medications * Physical therapy * Occupational therapy * Using a cane or walker to help with balance Some people with severe ataxia may need to use wheelchairs. ==Related pages== * Balance * Proprioception * Cerebellum * Spinal cord * Vestibular system ==References== Category:Diseases and disorders of the nervous system",
 "title": "Ataxia"
}