{
 "id": "554276",
 "text": "Tinnitus is a symptom of hearing loss and other hearing problems. It is described as hearing sound in the head or ears that does not come from an outside source. Many people will hear ringing, buzzing, hissing or whistling sounds, but tinnitus can be other sounds such as roaring and humming as well. Different people will hear different sounds from tinnitus but how they hear it can also be different. Tinnitus can be loud or quiet and it can be continuous or occasional and some people will not notice their tinnitus but some people become very annoyed from it, especially when they feel tired or stressed. Tinnitus can be Unilateral (one ear). Bi-lateral or Head (Usually in the occipital region), Continuous or pulsating, as a background noise or with associated symptoms such as anxiety or depression. The trigger can be noise induced such as exposure to military sounds, or Loud speakers. Tinnitus may be combined with Vertigo, Dizziness or Unsteadiness. The medication that may cause Tinnitus in many sufferers is chronic treatment with Acetyl-salicylic Acid (Aspirin) in high dose. The treatments can be divided to two categories: Palliative and Curative. The aim of the Palliative treatments is to help the patient to cope with his medical condition. Psychological treatments such as hypnotherapy, biofeedback, CBT and other psycho therapies are used. The aim of the Curative treatments is to cure the tinnitus. Objective tests such as MRI and blood tests are used in order to find treatable causes. Many times the findings does not help to cure the patient. Trauma to the skull may cause tinnitus. Many times the Neurologist may decide to avoid surgery because it may make the tinnitus worse. There are many things that can cause people to get tinnitus. These are the main reasons: *Listening to loud noises *Extreme stress *Old age *Some diseases *Some medicines == Treatments and therapies == People of different range of age can develop tinnitus. It is not a disorder but the symptom of some underlying health condition. People with tinnitus may take part in yoga, exercise regularly, perform sound therapies or join a tinnitus community . Playing a faint background noise in the background also helps in keeping the phantom noise at bay. == References == == Other websites == * Resonate Health Find an audiologist in New Zealand. Category:Hearing problems",
 "title": "Tinnitus"
}