{
 "id": "554377",
 "text": "The arrondissement of Barcelonnette is an arrondissement of France, in the Alpes-de-Haute-Provence department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Barcelonnette. ==History== When the Alpes-de-Haute- Provence department was created on 1800, the arrondissement of Barcelonnette was part of that original department. ==Geography== The arrondissement of Barcelonnette is in the northeast of the Alpes-de-Haute-Provence department. It is bordered to the northeast by Italy, to the southeast by the Alpes- Maritimes department, to the south by the Castellane and Digne-les-Baines arrondissements and to the west and north by the Hautes-Alpes department. The arrondissement of Barcelonnette is the smallest arrondissement of the department both in area, , and population (8,004 inhabitants). ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There is only one canton in the arrondissement of Barcelonnette, with all its communes in the arrondissement: the canton of Barcelonnette (0401). ===Communes=== The arrondissement of Barcelonnette has 14 communes; they are (with their INSEE codes)ː # Barcelonnette (04019) # Ubaye-Serre-Ponçon (04033) # La Condamine-Châtelard (04062) # Enchastrayes (04073) # Faucon-de-Barcelonnette (04086) # Jausiers (04096) # Le Lauzet-Ubaye (04102) # Val-d'Oronaye (04120) # Pontis (04154) # Méolans-Revel (04161) # Saint-Paul-sur-Ubaye (04193) # Saint-Pons (04195) # Les Thuiles (04220) # Uvernet-Fours (04226) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 04019 Barcelonnette 2,698 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04096 Jausiers 1,134 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04033 Ubaye-Serre-Ponçon 708 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04195 Saint-Pons 656 Barcelonnette Vallée de l'Ubaye - Serre- Ponçon 04226 Uvernet-Fours 582 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04073 Enchastrayes 390 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04220 Les Thuiles 389 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon 04161 Méolans- Revel 336 Barcelonnette Vallée de l'Ubaye - Serre-Ponçon ==Related pages== * Arrondissements of the Alpes-de-Haute-Provence department * List of arrondissements of France ==References== Barcelonnette",
 "title": "Arrondissement of Barcelonnette"
}