{
 "id": "554398",
 "text": "The arrondissement of Digne-les-Bains is an arrondissement of France, in the Alpes-de-Haute-Provence department, Provence-Alpes-Côte d'Azur region. Its capital, and prefecture of the department, is the city of Digne-les-Bains. ==History== When the Alpes-de-Haute-Provence department was created on 1800, the arrondissement of Digne-les-Bains was part of that original department. ==Geography== The arrondissement of Digne-les-Bains is in the central part of the Alpes-de-Haute-Provence department. It is bordered to the north by the arrondissement of Barcelonnette, to the east by the arrondissement of Castellane, to the south by the Var department and to the west by the arrondissement of Forcalquier. The arrondissement of Digne-les-Bains is the largest arrondissement of the department in area, , but the second in population (55,758 inhabitants), after the arrondissement of Forcalquier. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Digne-les-Bains, there are 6 cantons and 4 of them with all their communes in the arrondissement: # Digne-les-Bains-1 (0404) # Digne-les-Bains-2 (0405) # Oraison (0410) (partly) # Riez (0412) # Seyne (0413) (partly) # Valensole (0415) ===Communes=== The arrondissement of Digne-les-Bains has 46 communes; they are (with their INSEE codes)ː # Aiglun (04001) # Archail (04009) # Auzet (04017) # Barles (04020) # Barras (04021) # Beaujeu (04024) # Beynes (04028) # Bras-d'Asse (04031) # Le Brusquet (04036) # Le Castellard-Mélan (04040) # Le Chaffaut-Saint-Jurson (04046) # Champtercier (04047) # Château-Arnoux-Saint- Auban (04049) # Châteauredon (04054) # Digne-les-Bains (04070) # Draix (04072) # Entrages (04074) # L’Escale (04079) # Estoublon (04084) # Ganagobie (04091) # La Javie (04097) # Majastres (04107) # Malijai (04108) # Mallefougasse-Augès (04109) # Mallemoisson (04110) # Marcoux (04113) # Les Mées (04116) # Mézel (04121) # Mirabeau (04122) # Montclar (04126) # Moustiers-Sainte-Marie (04135) # Peyruis (04149) # Prads-Haute-Bléone (04155) # La Robine-sur-Galabre (04167) # Sainte-Croix-du-Verdon (04176) # Hautes-Duyes (04177) # Saint-Jeannet (04181) # Saint-Julien-d'Asse (04182) # Saint-Jurs (04184) # Saint-Martin-lès- Seyne (04191) # Selonnet (04203) # Seyne (04205) # Thoard (04217) # Verdaches (04235) # Le Vernet (04237) # Volonne (04244) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 04070 Digne-les-Bains 16,304 Digne-les-Bains-1 and Digne-les-Bains-2 Provence-Alpes Agglomération 04049 Château-Arnoux-Saint- Auban 5,210 Château-Arnoux-Saint-Auban Provence-Alpes Agglomération 04116 Les Mées 3,629 Oraison Provence-Alpes Agglomération 04149 Peyruis 2,829 Château- Arnoux-Saint-Auban Provence-Alpes Agglomération 04108 Malijai 1,990 Digne-les- Bains-2 Provence-Alpes Agglomération 04205 Seyne 1,365 Seyne Provence-Alpes Agglomération 04001 Aiglun 1,356 Digne-les-Bains-2 Provence-Alpes Agglomération 04110 Mallemoisson 1,029 Digne-les-Bains-2 Provence-Alpes Agglomération 04036 Le Brusquet 965 Seyne Provence-Alpes Agglomération 04047 Champtercier 766 Digne-les-Bains-2 Provence-Alpes Agglomération ==Related pages== * Arrondissements of the Alpes-de-Haute-Provence department * List of arrondissements of France ==References== Digne-les-Bains",
 "title": "Arrondissement of Digne-les-Bains"
}