{
 "id": "554406",
 "text": "Sensorineural hearing loss is the most common and one of the main types of hearing loss. It is also known as \"nerve deafness\". Unlike the other main type of hearing loss - conductive hearing loss - sensorineural hearing loss is permanent. Not only does sensorineural hearing loss cause noise to sound quieter but also makes sound less clear. This makes listening when there is a lot of noise harder and also makes hearing other people talk harder. == Causes == There are two parts of the ear that can be damaged to cause sensorineural hearing loss, either the cochlea or the hearing nerve. They do not both have to be damaged to cause hearing loss and can be caused by a number of different things. *Age related - the cochlea and hearing nerve of older people is more likely to be damaged than younger people, causing hearing loss *Noise related - listening to loud music or being in a place with very loud noise for a long time can damage your hearing *Disease - there are a few diseases and medications that can also cause hearing loss as a side-effect == Treatment == Unlike conductive hearing loss, sensorineural hearing loss is permanent. There may be ways to cure it but these are very limited. There are however ways to treat it and make it better. Using hearing aids is the most popular way to treat this hearing loss. Hearing aids are not just able to make sound louder, which does not always help (because louder sound does not mean clearer sound) but can also reduce sounds that are not needed to hear other people talk while making speech louder. This is very helpful in making speech easier to understand. == References == == Other websites == * National Hearing Care Find an audiologist in Australia and get more information on hearing loss and treatment. * Resonate Health Find an audiologist in New Zealand. * Bay Audiology Find an audiologist in New Zealand and get more information on hearing loss and treatment. Category:Hearing problems",
 "title": "Sensorineural hearing loss"
}