{
 "id": "554684",
 "text": "A hearing test is a check for a person's sense of hearing. It is used to measure what kind of sounds they can hear and if they have any hearing loss. There are many types of hearing tests used to understand different things about a person's hearing. Hearing tests are also different for adults and children as well. It is mainly audiologists that do hearing tests and they will know what kind of hearing test a patient needs. == Types of hearing tests == Since hearing loss does not always only make sound more quiet, and may make sound less clear too, there are many different hearing tests to use to understand what kind of hearing loss a person has. *Pure Tone Audiometry - the most common type of hearing test. A patient will listen to different sounds which are called pure tones. These sounds will be in different frequencies and softest sounds that can be heard are recorded. The two types of pure tone audiometry are air and bone conduction. If the results from these tests are different, this means that there is a problem with the outer and middle ear. **Air Conduction - a type of tone test that uses earphones placed inside the ear **Bone Conduction - a type of tone test that uses a small vibrator placed behind the ear that sends sound through the skull into the inner ear *Speech Recognition Test - used to measure how much a person can understand speech which it is at a normal noise level by making them repeat words that are heard. This tests how clear sound is *Hearing In Noise Test - similar to the speech recognition test, it is done by making the patient repeat words they hear. This will happen both in a quiet space as well as a noisy space and sound will come from different directions *Tympanogram - a small instrument is placed inside the ear and air is pumped in to change the air pressure. This test will show if there is a problem with the middle ear or ear drum *Acoustic Reflex Measures - test to find where the hearing problem is. The middle ear has a muscle that moves when there is loud sound. Measuring how loud sounds are before it stops moving can give information on where the hearing problem is in the ear. *Static Acoustic Impedance - measures how much air is inside the ear canal. Can tell if ear drum has a hole in it *Auditory Brainstem Response - tests the inner ear and brain. Electrodes are used to measure brain activity when sound is present == References == Category:Hearing",
 "title": "Hearing test"
}