{
 "id": "55471",
 "text": "The Norfolk County Fair and Horse Show is an annual showcase of rides, country music, carnival food, vendors, homecrafts, arigualure, and horses that takes place in Simcoe, Ontario, Canada the week prior to Canadian Thanksgiving. The fair has been held in Norfolk County since 1840. The 2024 fair will start on Tuesday, October 8th and run until Monday, October 14th. The fair always starts the Tuesday prior to Thanksgiving and ends Thanksgiving Monday. It is run by The Norfolk County Agricultral Society who has been running the fair as of 1998. Young Canada Day Each year the schools located in Norfolk County in both the Grand Erie District School Board (GEDSB) and The Brant Haldimand Norfolk District Catholic School Board (BHNDCSB) take a P.D Day on the first day of the fair, and schools compete to win various events. This say is known as \"Young Canada Day\" or \"Fair Day\". The elementary schools in the region compete in track and field competitions. The high schools in the region, consiting of Simcoe Composite School, Holy Trinity Catholic High School, Delhi District Secondary School, Valley Heights Secondary School, Waterford District High School and prior to 2013, Port Dover Composite School compete in various events such as track and field, tug of war, homecraft events, 4H events and cheerleading. Schools are awarded points for each competition won as well as for decorating their portion of the grandstands (where the trackside events are watched by each school), and for wearing school colours. Each year a new theme is given by the Fair Board and schools must dress and decorate according to the theme and their school colours. Points can also be taken away fro student conduct. Students who are boo-ing other schools or acting in a disrepectful manner will have points taken away from their school. Students who are under the influence can also have points taken away from their school. At the end of all events an overall winner is announced. This is the biggest accomplishment each school can win in the area. It is comparable to large High School Football games in the United States. The winner of Young Canada Day in 2023 was Simcoe Composite School who broke Delhi's thirteen year streak. == References == Category:Festivals in Canada Category:Ontario Category:19th- century establishments in Canada",
 "title": "Norfolk County Fair and Horse Show"
}