{
 "id": "55506",
 "text": "Take That are an English boy band from Manchester. They formed in 1990 and between then and 1996, when they broke up, they sold 19 million records. They reformed in 2006 and went on tour, without Robbie Williams. Williams rejoined the band in 2009, doing the Progress sessions. In 2011 Williams and Take That toured Europe on their Progress Live tour to promote the album. in October of the same year Williams chose to leave the group again to focus on his solo career, however, in 2012, 2016, 2017, 2018 and 2020 Williams has performed with the group occasionally. Jason Orange left Take That in September 2014 and Take That became a 3 piece band. Take That released their seventh album called III in 2014. The band continued as a 3 piece for Wonderland in 2017 and Odyssey in 2018. == Members == Current * Gary Barlow (1990–96, 2005–) * Mark Owen (1990–96, 2005–) * Howard Donald (1990-1996, 2005-) Former * Robbie Williams (1990–95, 2009–2014) * Jason Orange (1990–96, 2005–2014) == Albums == * Take That & Party (1992) * Everything Changes (1993) * Nobody Else (1995) * Beautiful World (2006) * The Circus (2008) * Progress (2010) * III (2014) *Wonderland (2017) *Odyssey (2018) *This Life (2023) == Career == Gary Barlow, Mark Owen, Howard Donald, Jason Orange and Robbie Williams were in Take That. Williams left in 1995 after taking drugs and soon the 4 remaining members split up in 1996. Take That returned to the music business in 2005, released their come-back album called Beautiful World and then went on tour in 2006. 2010 saw the return of Williams and in 2011 Take That took a hiatus and Barlow become a judge on the British TV talent show The X Factor UK in that year. Donald then became a judge on the German version of the dancing talent show Got To Dance in 2013. Williams left the band in 2012. Barlow ended his time on The X Factor UK to focus on the group in 2013. In early 2014 it was announced that the band would release their seventh studio album in late 2014. In September 2014 it was announced that Orange had decided to leave the band. The group then became a 3-piece boy band without Orange or Williams. Their seventh studio album called III was released in 2014. Their first single of III called \"These Days\" was released in November 2014. The second single of III called \"Get Ready For It\" was released in January 2015 and was also featured in the 2015 film Kingsman: The Secret Service. The third single of III called \"Let in the Sun\" was released in March 2015. \"New Day\" == Other websites == * TakeThatTV.com Official website (Polydor) * TakeThat.com (SonyBMG) * TakeThat4ever.dk Danish fan website Category:1990 establishments in England Category:1990s British music groups Category:2000s British music groups Category:2010s British music groups Category:Brit Award winners Category:English pop music groups Category:Musical groups established in 1990 Category:English boy bands Category:Musical groups from Manchester",
 "title": "Take That"
}