{
 "id": "55576",
 "text": "The Investiture Controversy, also known as the lay investiture controversy, was the most important conflict between secular and religious powers in medieval Europe. It began as a dispute in the 11th century between the Holy Roman Emperor Henry IV and Pope Gregory VII. The question was who would control appointments of bishops (investiture). The controversy led to many years of bitterness and nearly fifty years of civil war in Germany. This war ended with the triumph of the great dukes and abbots, and the falling apart of the German empire in the end. == The dispute between Gregory VII and Henry IV == When Gregory VII, a reformist monk, was elected as pope in 1073, the controversy between emperor and pope began. Gregory had many enemies in the higher ranks of the German clergy, so Henry IV declared that Gregory was no longer pope and that the Romans should choose a new pope . When Gregory learned of this he excommunicated Henry IV, declared he was no longer emperor, and told his subjects that they no longer had to obey him as they had sworn to do. The excommunication of the king made a deep impression both in Germany and Italy. Thirty years before, his father Henry III had deposed three popes, but when Henry IV tried to copy this procedure he did not have the support of the people. The Saxons began a second rebellion, and the anti-royalist party grew in strength from month to month. === To Canossa === Henry had been excommunicated by this point, and facing widespread opposition at home with Rudolf as the figurehead of this, Henry met the Pope at a fortress in the Southern Alps. Over three days he signals his penitence in the snow, barefoot and wearing a sack cloth, leading to a reconciliation with Pope Gregory VII. === Second excommunication of Henry === The opposition of the rebellious German nobles used the excommunication of Henry to set up a rival king Rudolf of Rheinfelden (Forchheim, March 1077). At first Gregory seemed to be neutral because the two parties (emperor and rebels) were of fairly equal strength. But finally he decided for Rudolf after his victory at Flarchheim (27 January 1080) and declared the excommunication and deposition of King Henry again (7 March 1080). This was widely felt to be an injustice. When Rudolf died on 16 October of the same year, Henry, now more experienced, took up the struggle. In 1081 he opened the conflict against Gregory in Italy. Gregory had now become less powerful, and thirteen cardinals deserted him. Rome surrendered to the German king, and Guibert of Ravenna enthroned as Clement III (24 March 1084). Henry was crowned emperor by his rival, while Gregory himself had to flee from Rome in the company of his Norman \"vassal\" Robert Guiscard. == References == * Blumenthal, Uta-Renate (1988). The Investiture Controversy: Church and Monarchy from the Ninth to the Twelfth Century. University of Philadelphia Press. * Cantor, Norman F. (1993). The Civilization of the Middle Ages. HarperCollins * Cowdrey, H.E.J. (1998). Pope Gregory VII, 1073–1085. Oxford University Press. * Jolly, Karen Louise. (1997). Tradition & Diversity: Christianity in a World Context to 1500. ME Sharpe. * Tellenbach, Gerd (1993). The Western Church from the Tenth to the Early Twelfth Century. Cambridge University Press. == Other websites == * \"Investiture Constroversy\", from Encyclopedia Britannica Online. * \"Conflict of Investitures\", from the Catholic Encyclopedia. * \"Canonical Investiture\", from the Catholic Encyclopedia. * \"Investiture\" , from the Columbia Encyclopedia. * \"The Owl, The Cat, And The Investiture Controversy\" , from the Online Reference Book for Medieval Studies (ORB). * \"Empire and Papacy\" , from the Internet Medieval Sourcebook. === Sources === * Henry IV: Letter to Gregory VII, Jan 24, 1076 . * Gregory VII: First Deposition and Banning of Henry IV (Feb 22, 1076) * Gregory VII: Second Banning and Dethronement of Henry IV (March 7, 1080) * Gregory VII: Dictatus Papae 1090 * Ban on Lay Investitures, 1078 * The Concordat of Worms 1122 * The Canons of the First Lateran Council, 1123 * Avalon Project, Yale University: Documents relating to the War of the Investitures Category:Popes Category:Holy Roman Emperors Category:Christianity of the Middle Ages Category:Controversies Category:11th century in Europe",
 "title": "Investiture Controversy"
}