{
 "id": "555839",
 "text": "Cachapoal Province () is one of three provinces of the central Chilean region of Libertador General Bernardo O'Higgins (VI). Its capital is the city of Rancagua. The province is named after the Cachapoal river that flows through the province from east to west. ==Geography== The Cachapoal province has an area of , the largest province in the O'Higgins region. Cachapoal is a landlocked province (it does not border the ocean) and is bordered to the north by the Santiago Metropolitan region, to the east by Argentina, to the south by the Colchagua province and to the west by the Cardenal Caro province. Most of the province is in the valley of the Cachapoal river; it is region where grapes are grown to produce wine. ==Population== The people from the province are called Cachapoalino (women: Cachapoalina). (last national census), there were 542,901 people living in the province, giving it a population density of inhabitants/km². The largest city of the province is Rancagua, its capital, with a population, in 2002, of 206,971 inhabitants, followed by the city of Rengo (30,891 inhabitants). ==Administration== As a province, Cachapoal is a second-level administrative division, consisting of 17 communes (comunas). The city of Rancagua serves as the provincial capital. The province is administered by a governor. Cachapoal province Code Comuna Capital Area (km²) Population (2002) Density 06101 14 Rancagua Rancagua 260.3 214,344 06102 1 Codegua Codegua 286.9 10,796 06103 2 Coínco Coínco 98.2 6,385 06104 3 Coltauco Coltauco 224.7 16,228 06105 4 Doñihue Doñihue 78.2 16,916 06106 5 Graneros Graneros 112.7 25,961 06107 6 Las Cabras Las Cabras 749.2 20,242 06108 7 Machalí Machalí 2,586.0 28,628 06109 8 Malloa Malloa 112.6 12,872 06110 9 Mostazal Mostazal 523.9 21,866 06111 10 Olivar Olivar 44.6 12,335 06112 11 Peumo Peumo 153.1 13,948 06113 12 Pichidegua Pichidegua 320.0 17,756 06114 13 Quinta de Tilcoco Quinta de Tilcoco 93.2 11,380 06115 15 Rengo Rengo 591.5 50,830 06116 16 Requínoa Requínoa 673.3 22,161 06117 17 San Vicente San Vicente 475.8 40,253 Total of the Cachapoal province Total of the Cachapoal province Total of the Cachapoal province 7,384.2 542,901 ==Related pages== * Provinces of Chile ==References== ==Other websites== * Territorial division of Chile * Gobierno Regional de O'Higgins Official website * Province of Cachapoal website Category:Provinces of Chile Category:O'Higgins Region",
 "title": "Cachapoal Province"
}