{
 "id": "556169",
 "text": "A neutral country is one that chooses not to take part in a War between other countries in international relations. International law allows a country to remain neutral during a period of war between two or more states. When a country declares it is neutral, it cannot allow any part of its territory to become a base for one side. It may not construct warships, recruit soldiers or organize military expeditions on behalf of one belligerent. It is also called \"armed neutrality\" when declaring itself neutral during a war. This is not the same as \"neutralization\", or permanent neutrality. A neutral country is also different from the neutrality claimed by non-governmental organizations (NGOs) or United Nations peacekeeping groups. == Permanent neutrality == An example of permanent neutrality would be the Vatican City.Hanspeter Neuhold, 'Permanent Neutrality in Contemporary International Relations: A Comparative Perspective', Irish Studies in International Affairs, Vol. 1, No. 3 (1982), p. 13 It declared itself permanently neutral in the 1929 Lateran Treaty. Having a long history of remaining neutral, Switzerland became a favorite place for the headquarters of many organizations. The International Red Cross established itself at Geneva during the mid-19th century. Switzerland was recognized as remaining neutral in a 1920 declaration by the League of Nations, also headquartered in Geneva. When the League was disbanded after World War II it was replaced by the United Nations. While Switzerland did not join the UN, in addition to recognizing its neutrality it was also given permanent observer status. ===Neutral countries=== country neutrality period/starting year notes 1949– Is an observer in the Non-Aligned Movement. Is a member of the Group of 77. Neutral since its military was dissolved in 1949. (Spanish) Ratified by law in 2014. (Spanish) 1868– Neutral because the military was dissolved in 1868. 1989- Is member of the Non-Aligned Movement. Is a member of the Group of 77. The neutrality of the Panama Canal is enshrined by specific treaty. 1815– A OECD member since 1961. Self-imposed, permanent, and armed, designed to ensure external security. Switzerland is the oldest neutral country in the world since 1815; it has not fought a foreign war since its neutrality was established by the Treaty of Paris in 1815. Although the European powers (Austria, France, the United Kingdom, Portugal, Prussia, Russia, Spain and Sweden) agreed at the Congress of Vienna in May 1815 that Switzerland should be neutral, final ratification was delayed until after Napoleon Bonaparte was defeated so that some coalition forces could invade France via Swiss territory (see the minor campaigns of 1815 and the Act on the Neutrality of Switzerland signed on 20 November 1815 by the Great Powers). 1995– Is a member of the Non-Aligned Movement. Is a member of the Group of 77. Declared its complete neutrality and had it formally recognized by the United Nations in 1995. 1929– The Lateran Treaty signed in 1929 with Italy imposed that \"The Pope was pledged to perpetual neutrality in international relations and to abstention from mediation in a controversy unless specifically requested by all parties\" thus making Vatican City neutral since then. Note: Whether a state that is a member of the European Union may be considered neutral is a point of debate. This is discussed in the section below. ===Neutral European Union members=== country neutrality period/beginning year notes 1920–1938 (after World War I to annexation by Germany) 1955–1995 (Declaration of Neutrality to EU membership) A OECD member since 1961. Declared “perpetual neutrality” in 1955. 1939–1973 (to EU membership) A OECD member since 1961. Established a policy of neutrality during World War II, known as the Emergency in Ireland. Was granted a special acknowledgement in the Seville Declarations on the Treaty of Nice due to its views on the use of force in International Politics. Joined the UN in 1955 but maintained its status as a neutral country. 1980–2004 (to EU membership) Former member of the Non-Aligned Movement. Policy of neutrality since 1980. ===Claim to be neutral=== country claimed neutrality period/beginning year notes 2020-Now Afghanistan Issue 2012 Is a member of the African Union. Is a member of the Non-Aligned Movement. Is a member of the Group of 77. In August 2012, the Government of Ghana announced that due to the death of President John Atta Mills, the state implemented a closed-neutral policy. 1947 A OECD member since 1964. Constitutionally forbidden from participating in wars, but maintains heavily- armed self-defence forces and a military alliance 1930 A OECD member since 1994. Is an observer in the Non-Aligned Movement. Is a former member of the Group of 77. With the exception of its participation on the side of the Allies in World War II. Opened its borders in the 20th century to political refugees fleeing the military dictatorships of South America and Spain. Since 2000, Mexico ignored the neutrality policy under foreign secretaries Jorge G. Castañeda and Luis Ernesto Derbez. Whether historical neutrality is to be kept is now internally debated. The Mexican formulation of neutrality is known as Estrada doctrine. 1914–1918 2015 Is a member of the Non-Aligned Movement. Is a member of the Group of 77. In During World War I, Mongolia has been wartime neutral country, and soon became belligerent countries of World War II. In September 2015, Mongolian President Tsakhiagiin Elbegdorj in the 70th UN General Assembly speech suddenly announced that Mongolia will implement the \"policy of permanent neutrality,\" and called on the international community to be recognized by all parties and support. 1994 Article 11 of the 1994 Constitution proclaims \"permanent neutrality\". 2009 Is a member of the African Union. Is a member of the Non-Aligned Movement. Is a member of the Group of 77. After the 1994 genocide, Rwanda announced permanent neutrality in 2009 after joining the Commonwealth of Nations. 2007 Is an observer in the Non-Aligned Movement. The National Assembly of Serbia declared armed neutrality in 2007.Enclosed by NATO, Serbia ponders next move AFP, 6 April 2009 The country's neutrality may possibly change in the future if the country decides to join NATO or the CSTO, as its prime minister Aleksandar Vučić does not rule out the possibility of his country joining in the (non-near) future. == References == == Relating page == *Demilitarized zone *Peace treaty == Other websites == * Which Countries Are Neutral? Category:International politics",
 "title": "Neutrality (international relations)"
}