{
 "id": "556217",
 "text": "The arrondissement of Grasse is an arrondissement of France, in the Alpes- Maritimes department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Grasse. ==History== When the Alpes-Maritimes department was created on 1793, Grasse was part of the Var department. It became an arrondissement of the Alpes-Maritimes department in 1860. ==Geography== The arrondissement of Grasse is the most southern of the Alpes-Maritimes department. It is bordered to the north by the Alpes-de-Haute-Provence department, to the east by the Nice arrondissement, to the south by the Mediterranean Sea and to the west by the Var department. The arrondissement of Grasse is the smallest in area of the two arrondissements of the department, , but the one with a higher population (560,045 inhabitants). ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Grasse, there are only two cantons where not all their \"communes\" are in the arrondissement: Nice-3 and Vence. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: INSEE code Canton Grasse Nice Total 0601 Antibes-1 1 + part of Antibes 1 + part of Antibes 0602 Antibes-2 part of Antibes part of Antibes 0603 Antibes-3 1 + part of Antibes 1 + part of Antibes 0605 Cagnes-sur-Mer-1 part of Cagnes-sur-Mer part of Cagnes-sur-Mer 0606 Cagnes-sur-Mer-2 2 + part of Cagnes-sur-Mer 2 + part of Cagnes-sur-Mer 0607 Cannes-1 part of Cannes + part of Le Cannet part of Cannes + part of Le Cannet 0608 Cannes-2 part of Cannes part of Cannes 0609 Le Cannet 1 + part of Le Cannet 1 + part of Le Cannet 0611 Grasse-1 18 + part of Grasse 18 + part of Grasse 0612 Grasse-2 1 + part of Grasse 1 + part of Grasse 0613 Mandelieu-la-Napoule 5 5 0617 Nice-3 3 part of Nice 3 + part of Nice 0625 Valbonne 11 + part of Antibes 11 + part of Antibes 0626 Vence 10 37 47 0627 Villeneuve-Loubet 4 4 ===Communes=== The arrondissement of Grasse has 62 communes; they are (with their INSEE codes)ː # Aiglun (06001) # Amirat (06002) # Andon (06003) # Antibes (06004) # Auribeau-sur-Siagne (06007) # Biot (06018) # Bouyon (06022) # Briançonnet (06024) # Bézaudun-les-Alpes (06017) # Cabris (06026) # Cagnes-sur-Mer (06027) # Caille (06028) # Cannes (06029) # Carros (06033) # Caussols (06037) # Châteauneuf-Grasse (06038) # Cipières (06041) # Collongues (06045) # Conségudes (06047) # Courmes (06049) # Coursegoules (06050) # Escragnolles (06058) # Gars (06063) # Gattières (06064) # Gourdon (06068) # Grasse (06069) # Gréolières (06070) # La Colle-sur-Loup (06044) # La Gaude (06065) # La Roquette-sur-Siagne (06108) # Le Bar-sur-Loup (06010) # Le Broc (06025) # Le Cannet (06030) # Le Mas (06081) # Le Rouret (06112) # Le Tignet (06140) # Les Ferres (06061) # Les Mujouls (06087) # Mandelieu-la-Napoule (06079) # Mouans-Sartoux (06084) # Mougins (06085) # Opio (06089) # Peymeinade (06095) # Pégomas (06090) # Roquefort-les-Pins (06105) # Roquestéron-Grasse (06107) # Saint-Auban (06116) # Saint-Cézaire-sur-Siagne (06118) # Saint-Jeannet (06122) # Saint-Laurent-du-Var (06123) # Saint-Paul (06128) # Saint-Vallier-de-Thiey (06130) # Sallagriffon (06131) # Spéracèdes (06137) # Séranon (06134) # Théoule-sur-Mer (06138) # Tourrettes-sur-Loup (06148) # Valbonne (06152) # Valderoure (06154) # Vallauris (06155) # Vence (06157) # Villeneuve-Loubet (06161) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 06004 Antibes 75,731 Antibes-1, Antibes-2 Antibes-3 and Valbonne Communauté d'agglomération de Sophia Antipolis 06029 Cannes 73,744 Cannes-1 and Cannes-2 Communauté d'agglomération Cannes Pays de Lérins 06069 Grasse 50,409 Grasse-1 and Grasse-2 Communauté d'agglomération du Pays de Grasse 06027 Cagnes-sur-Mer 47,811 Cagnes-sur-Mer-1 and Cagnes-sur-Mer-2 Métropole Nice Côte d'Azur 06030 Le Cannet 42,454 Cannes-1 and Le Cannet Communauté d'agglomération Cannes Pays de Lérins 06123 Saint- Laurent-du-Var 29,067 Cagnes-sur-Mer-2 Métropole Nice Côte d'Azur 06155 Vallauris 26,302 Antibes-1 Communauté d'agglomération de Sophia Antipolis 06079 Mandelieu-la-Napoule 22,696 Mandelieu-la-Napoule Communauté d'agglomération Cannes Pays de Lérins 06157 Vence 18,536 Vence Métropole Nice Côte d'Azur 06085 Mougins 18,391 Le Cannet Communauté d'agglomération Cannes Pays de Lérins ==Related pages== * Arrondissements of the Alpes-Maritimes department * List of arrondissements of France ==References== Grasse",
 "title": "Arrondissement of Grasse"
}