{
 "id": "556386",
 "text": "György Sándor Ligeti (28 May 1923 – 12 June 2006) was a composer from Hungary. He was an important composer of avant-garde music. His music influenced many other composers. Some of his most famous works are an opera called Le Grand Macabre, a piece for orchestra called Atmosphères, a piece for choirs called Lux Aeterna, and a Requiem. Stanley Kubrick used parts of Atmosphères, Lux Aeterna, and the Requiem for the soundtrack of his movie 2001: A Space Odyssey. Many other movies use pieces of Ligeti's music on their soundtracks.Griffiths, Paul ((13 June 2006). \"Gyorgy Ligeti, Central-European Composer of Bleakness and Humor, Dies at 83\". The New York Times. Retrieved 7 October 2016.Russell Platt (12 August 2008). \"Clarke, Kubrick and Ligeti: A Tale\". The New Yorker. Retrieved 7 October 2016. ==Early life== Ligeti was born in Transylvania. His family were Hungarian Jews. His father and his brother died in the Holocaust. After World War II he studied music in Budapest at the Franz Liszt Academy of Music. He was a music teacher at the Franz Liszt Academy from 1950 to 1956. He also composed music at that time. Much of his music then was influenced by Hungarian folk music. He was also influenced by the music of Béla Bartók, another Hungarian composer. In 1956, the Soviet Union invaded Hungary. Ligeti decided to leave Hungary. He went to Vienna in Austria. He became a citizen of Austria but he also lived in Germany and in other countries. He composed his own music and he also taught other people how to compose music. He taught music composition in Stockholm, Sweden, at Stanford University in America, and at an important music school in Hamburg, Germany called the Hochschule für Musik und Theater. He retired from the Hamburg music school in 1989. Then he went back to live in Vienna. After 2000 his health was not good. Ligeti died in Vienna at the age of 83.BBC News (12 June 2006). \"Obituary: Gyorgy Ligeti\". Retrieved 7 October 2016. Ligeti was married two times. His first wife was Brigitte Löw. They were married in 1949. They were divorced in 1952. His second wife was Vera Spitz. He married her in 1952. She is a psychologist. Their son Lukas, born in 1965, is a composer.Plaistow, Stephen (14 June 2006). Obituary:Gyorgy Ligeti. The Guardian. Retrieved 7 October 2016.Schweitzer, Vivien (24 April 2009). \"A Son Composes His Own Path\". New York Times. Retrieved 7 October 2016. ==Music== Some of Ligeti's important pieces of music are: * Artikulation, electronic music. He composed it in 1958 * Atmosphères, music for a full orchestra. He composed it in 1961 * Aventures and Nouvelles Aventures, music for singers and a small orchestra. The music has other strange sounds. The orchestra players also smash plates, bang on furniture, and pop paper bags. He composed these pieces between 1962 and 1965.May, Thomas. Program Notes: Aventures and Nouvelles Aventures . Los Angeles Philharmonic. Retrieved 7 October 2016. * Requiem, music for solo singers (a soprano and a mezzo-soprano), two choirs of men and women, and an orchestra with many percussion instruments. He composed it in 1965.May, Thomas. Program Notes: Requiem, György Ligeti . Los Angeles Philharmonic. Retrieved 7 October 2016. * Lux Aeterna, music for a choir of 16 men and women. He composed it in 1966. * Magyar Etüdök, music for a choir of 16 men and women. The words are from Hungarian poems. He composed it in 1966. * Continuum, music for harpsichord. He composed it in 1968, * Le Grand Macabre, an opera. It was performed for the first time in Stockholm in 1978. It has been performed in many other countries. He made big changes to the opera in 1997. * Hamburg Concerto, a concerto for a solo horn and a small orchestra with four more horns. It has six parts. He composed it in 1999 ==References== Category:1923 births Category:2006 deaths Category:20th-century composers Category:21st-century composers Category:Hungarian composers",
 "title": "György Ligeti"
}