{
 "id": "556551",
 "text": "Olmec figurine is the name for figurines which were produced in Central America, from about 1000 BCE to about 500 BCE. Many come from the Olmec heartland, which is the gulf region of modern-day Mexico. Olmec figurines show the influence of the Olmec culture. In 2016, it is not known how far this influence extended. It is therefore possible that some of these figurines were produced by other people, who were influenced by the Olmec. Many of the figurines were found in household waste and in landfill used for construction. Outside the Olmec heartland they were also found in graves. Looters often took these figurines. It is impossible to tell where the looted figurines are from. Most of the figurines are made from terracotta. Since terracotta is fragile, most only survive in parts. Wooden busts have been discovered in the submerged site El Marati, but no figurines made of wood have been found. The figurines best known to the public are made of stone or minerals,such as jade, serpentine, greenstone or basalt. Figurines of stone or minerals are often carved, while those made of terracotta are simpler in design. == Motifs == The figurines found show different motifs or designs: *\"Baby face\": This is a common motf for the Olmec culture, and often occurs, at least in the early period. *\"Elongated man\": This shows a human figure in an artificial pose, with thin limbs. The head is often deformed. *\"Were-jaguar\": This is theme that can be found in all of Olmec art, there are also figurines with the motif. *Transformation figurines: They show how an animal transforms into human form, or humans with animal masks. *Small humans, in a naturalistic pose *Dwarf figurines ==Gallery== File:Olmec figurine, serpentine.jpg|An \"elongated man\" figurine, dark green serpentine. Inlays, since lost, once animated the eyes, ears, nose, and mouth.Bradley (2005) p. 25. File:Olmec Seated Were-Jaguar AMNH.jpg|A small jade were-jaguar figurine. Stand-alone were-jaguar figurines are rare - most were-jaguar figurines show a were-jaguar baby accompanied by a human adult. Height: 8.6 cm (3.4 in). File:Olmec Eagle Transformation Figure.jpg|Olmec eagle transformation figure, 10th–6th century B.C. Jade (albite), with cinnabar. Height: 4.5 in. (11.4 cm). File:Olmec Figurine.jpg|This rather unlively figurine belongs to Blomster's Group 2. File:Baby_face_at_Jade_Museum_(Museo_Nacional_del_Jade)_-_San_Jose,_C_R.jpg|A baby-face figurine from the Museo Nacional del Jade, San Jose, Costa Rica. File:Olmec Fetal Figurine AMNH.jpg|A jade fetal-style figurine from Guerrero, Mexico. Height: 3.8 in (9.5 cm). ==References== * Category:Pre-Columbian cultures",
 "title": "Olmec figurine"
}