{
 "id": "556558",
 "text": "Sigismund II Augustus (1520-1572) was a Polish king, the last member of the Jagiellon dynasty.Philip W. Barker, Religious Nationalism in Modern Europe: If God be for Us (London; New York: Routledge, 2009), p. 86 He was also the Grand Duke of Lithuania from 1548 to 1572.Henry Kamen, Who's who in Europe, 1450-1750 (London; New York: Routledge, 2000), p. 274 == Biography == Sigismund II Augustus was born in Kraków on 1 August 1520. He was the only son (he had sisters) of king Sigismund I the Old and his wife, Italian princess Bona Sforza. His great grandfather was Wladislaw II Jagiello,Władysław II Jagiełło, king of Poland, Encyclopaedia Britannica. the founder of the dynasty. Sigismund II Augustus was crowned as a child on 20 February 1530Zygmunt II August, Encyklopaedia PWN (in Polish). when his father was still alive (in Latin vivente rege).Elekcja, Encyklopedia PWN. From 1544 he ruled in Lithuania.Zygmunt II August, Encyklopedia PWN. He was married three times but remained childless.Sigismund-II-Augustus, Encyclopaedia Britannica. He died on 7 July 1572 in Knyszyn.Sigismund-II-Augustus, Encyclopaedia Britannica. He was a Roman Catholic, but was known for his tolerance for Protestants.Sigismund-II-Augustus, Nekropole. When king Sigismund II Augustus received diplomats or made important decisions, he did so in the audience hall in the royal castle. This room was also called \"Under the Heads\" for the carved heads set in the ceiling. One of these was a woman's head. The legend says whenever he would make a decision she would speak in Latin (using rhyme and alliteration): Rex Auguste, iudica iuste (\"King August, judge justly\"). He followed her advice but after that her mouth was covered with a ribbon so she would never again interfere in royal decisions. == References == == Other sources == * Stanisław Cynarski, Zygmunt August, Ossolineum, Wrocław 1988 (in Polish). == Other websites == * Sigismund II Augustus Category:1520 births Category:1572 deaths Category:Kings of Poland Category:Grand Dukes of Lithuania",
 "title": "Sigismund II Augustus"
}