{
 "id": "5566",
 "text": "Henry I (21 September 1068 — 1 December 1135), also called Henry Beauclerc (meaning good scholar), was the King of England from his older brother, William II's assassination in 1100 until his death in 1135. He was also the Duke of Normandy from 1106 where he defeated his older brother Robert Curthose until his death in 1135. He was the last English King to rule the House of Normandy because after his death and when Stephen took the throne, the House was replaced by the House of Blois, which was only the house of England during Stephen's reign because when Stephen died, Henry's grandson Henry II who succeeded Stephen, replaced the House of Blois with the House of Plantagenet, which was the longest house of England in English history. Henry was born in Selby, a country in Yorkshire. He was the third son of William I of England and Matilda of Flanders. He was the only son of the couple who was born in England. Henry was educated in English, Latin and liberal arts. His parents probably raised him to go into the Church when he was old enough. On William's death in 1087, Henry's two older brothers were each left half of their father's kingdom. Robert Curthose became Duke of Normandy. William Rufus became king of England. But Henry, still a minor, was left with no inheritance. Henry purchased the County of Cotentin in western Normandy from Robert. But Robert and William Rufus forced him out in 1091. Henry gradually rebuilt his power base in the Cotentin. He then allied himself with William against Robert. Henry was present when William II was assassinated in 1100. Since Robert was away on Crusade trying to invade Palestine, Henry, who was present when William was assassinated, rushed to England to seize the throne for himself. As King, Henry tried to make social reforms. He issued the Charter of Liberties which is considered a predecessor to Magna Carta. He put back in place some of the laws of Edward the Confessor. Henry was also the first king to speak English since his father conquered England even though it wasn't Henry's first language despite being born in England. Henry and his wife had two children, Matilda and William Adelin. William died in the White Ship sinking on November 25, 1120. Henry also fathered more illegitimate children than any other English King. Estimates by various historians place the number between 20 and 25. Henry died in 1135.Detlev Schwennicke, Europaische Stammtafeln, Neue Folge (Marburg, Germany: A. Stargardt, 1984), Band II, Tafel 81 He was visiting his daughter and grandchildren in Normandy. After his death, his daughter, Matilda and his nephew, Stephen, argued over who would become the ruler of England, and started a civil war called The Anarchy which lasted for the next 18 years. == References == == Other websites == * Children of Henry I Category:1068 births Category:1135 deaths Category:Anglo-Normans Category:House of Normandy Category:12th century in England",
 "title": "Henry I of England"
}