{
 "id": "556733",
 "text": "The Lluta is a river in the Atacama Desert. It is the most northern of the great transversal Chilean rivers that start in the Andes and flow into the Pacific Ocean. It flows through the Arica y Parinacota region. It has a broad estuary near the port city of Arica that forms a wetland, a habitat used by many water birds (birds that live on or near water). ==Geography== The Lluta river has a length of , and a drainage basin with an area of approximately . ===Course=== The Lluta river starts on the Andean mountain slopes near the border with Peru and Bolivia, at an elevation of about , in the place called Humapalca, comuna of General Lagos, Parinacota province, Arica y Parinacota. The river is formed by the confluence of two streams: * Caracarani. It starts on the eastern side of the Tacora volcano. It has a discharge of with an average discharge of . * Azufre. This river is formed by several streams that come from the southwestern side of the Tacora volcano. It is around and a discharge of about . Along its first , the river flows southeast and then slowly begins to turn towards the west. In its descent to the lower elevations of the valley, the river starts to run through a canyon formed by the same river; in some parts, the canyon could be deep. Near the village of Socoroma (in the comuna of Putre), the river turns directly west and, after getting out of the canyon, the river begins to widen. Near the village of Chironta, about from the sea, appear the first farms. Finally, the river flows in the Pacific Ocean north of the city of Arica, in the sector Chacalluta, near the airport. The Lluta river only flows through small villages except Putre, a small town with only 1,977 inhabitants (2022 census). ===Wetland of the Lluta river=== The mouth of the Lluta river in the Pacific Ocean covers more of . The resulting coastal wetland is the most important of its kind in the region with extensive vegetation and many water birds, including migratory birds. ==Main tributaries == Because the Lluta river flows throug a very arid region, the Atacama desert, there are very few permanent tributaries, and most of them join the Luta by its left side; some of them are Allane, Putre, Socoroma and Colpitas. ==Water quality== Apart from its problems of salinity and acidity, the river has very high levels of boron, arsenic, and sulfate, among other pollutants, which limit the agricultural activities that can be developed along the river. ==Gallery== File:Cuesta Ruta 11 a Putre Región de Arica.jpg|The Llauta valley from the Ruta 11 road File:Desembocadura Rio Lluta, Nidal, Arica.JPG|Mouth of the Lluta river File:Humedal rio lluta (2).JPG|Wetland of the Lluta river, Arica File:Humedal rio lluta (1).JPG|A water bird in the Lluta river wetland ==Related pages== * List of rivers of Chile ==References== ==Other websites== * Cuenca del río Lluta Category:Rivers of Chile Category:Arica y Parinacota Region",
 "title": "Lluta River"
}