{
 "id": "556989",
 "text": "Iambic pentameter is a kind of verse. It is the most common kind of verse in English literature. The two words seem difficult, because the words are Greek. Pentameter means \"consisting of five measures\" and iambic \"consisting of iambs\". The rhythm which words make in the line is measured in small groups of syllables called \"feet\". The word \"iambic\" refers to the type of foot that is used, known as the iamb. This is an unstressed syllable followed by a stressed syllable. The word \"pentameter\" indicates that a line has five of these \"feet\". In theory every line is composed of ten syllables and have five stresses. Stresses fall on the second, the fourth, the sixth, the eighth and the tenth syllable. This is marked with two signs. The sign \"x\" stands for a syllable with no stress, and the sign \"/\" stands for a syllable with stress. So a line of iambic pentameter is: : x / x / x / x / x / == Use in poetry == In real poems lines have often an extra syllable at the end and sometimes lack the first unaccented syllable. A line can be divided in five units that are called \"feet\".Definition at Dictionary.com. The unit x / is called an \"iamb\" or \"iambic foot\". Sometimes the pattern is changed. First foot can be reversed: / x x / x / x / x /. When iambic pentameter is unrhymed it is called blank verse.Blank verse at Encyclopaedia Britannica Blank verse was introduced into English poetry by Henry Howard, Earl of Surrey. Thomas Kyd used it in his The Spanish Tragedy. : When this eternal substance of my soul : Did live imprison'd in my wanton flesh, : Each in their function serving other's need, : I was a courtier in the Spanish court: : My name was Don Andrea; my descent, : Though not ignoble, yet inferior far : To gracious fortunes of my tender youth. : For there in prime and pride of all my years, : By duteous service and deserving love, : In secret I possess'd a worthy dame, : Which hight sweet Bellimperia by name.Thomas Kyd, The Spanish Tragedy at Luminarium. There are no rhymes in blank verse, but alliteration often occurs in it, for example \"prime and pride\". William Shakespeare's dramas are written chiefly in blank verse.William Shakespeare; Henry Norman Hudson, Shakespeare's Coriolanus (London: George Gill & Sons, 1886). p. 10 The first line of the famous Hamlet's monologue is an example: : To be, or not to be, that is the question: == Examples == John Milton used blank verse in Paradise Lost. Many other poets (for example Edwin Atherstone, John Fitchett, Alfred Tennyson, Robert Browning and Matthew Arnold employed it long poems. John Fitchett's King Alfred is perhaps the longest epic poem written in blank verse. It consists of more than 130 000 lines.Simon Keynes, The cult of Alfred, [in:] Anglo-Saxon England 28, Cambridge 1999, p. 330. But Alexander Pope wrote iambic pentameter with rhymes. One line rhymes with the next. It is called heroic couplet.Heroic couplet at Encyclopaedia Britannica. Dramatic monologues are usually written in blank verse. Good examples are Tennyson's St Simeon StylitesAlfred Tennyson's \"St. Simeon Stylites\" at The Victorian Web. and Ulysses or Browning's The Ring and the Book. Robert Frost wrote similar poems in the United States. Lines of iambic pentameter can be set also into stanzas. An example of a stanza is rhyme royal that consists of seven lines and rhymes ababbcc. It was used by Emma Lazarus in the poem Sympathy from the sequence Epochs. : It comes not in such wise as she had deemed, : Else might she still have clung to her despair. : More tender, grateful than she could have dreamed, : Fond hands passed pitying over brows and hair, : And gentle words borne softly through the air, : Calming her weary sense and wildered mind, : By welcome, dear communion with her kind….Full text at Bartleby.com. Iambic pentameter is used also in English sonnets.Shakespearean Sonnet Basics: Iambic Pentameter and the English Sonnet Style at Shakespeare-online.com. The rhythm of iambic pentameter is close to the rhythm of everyday English speech. Iambic pentameter is common in German literature, too.See: Heinz Juergen Schueler, The German Verse Epic in the Nineteenth and Twentieth Centuries, Martinus Nijhoff, The Hague 1967, p. 61, . This example is from The Flamingos by Rainer Maria Rilke: : In Spiegelbildern wie von Fragonard : ist doch von ihrem Weiß und ihrer Röte : nicht mehr gegeben, als dir einer böte, : wenn er von seiner Freundin sagt: sie war == Bibliography == * Joseph Berg Esenwein, Mary Eleanor Roberts, The Art of Versification, The Home Correspondence School, Springfield, 1920. == References == == Other websites == * Understanding Iambic Pentameter; YouTube * Introducing Iambic Pentameter; About.com Category:Poetry forms",
 "title": "Iambic pentameter"
}