{
 "id": "55694",
 "text": "The Nicene Creed, also called the Niceno-Constantinopolitan Creed or Icon/Symbol of the Faith, is the most widespread or ecumenical Christian statement of faith. Since its original formulation, it has been used in the Roman Catholic, Syrian Orthodox (Jacobite), Eastern Orthodox, Oriental Orthodox, Assyrian, Anglican, Lutheran, and most other Protestant Churches. == Comparison between Creed of 325 and Creed of 381 == The following table displays side by side the earlier (325) and the later (381) forms of the creed in the English translation given in Philip Schaff's Creeds of Christendom It indicates by brackets the portions of the 325 text that were omitted or moved in 381 but uses no typographical marks to indicate the phrases that were absent in the 325 text but added in 381. First Council of Nicea (325) First Council of Constantinople (381) We believe in one God, the Father Almighty, Maker of all things visible and invisible. We believe in one God, the Father Almighty, Maker of heaven and earth, and of all things visible and invisible. And in one Lord Jesus Christ, the Son of God, begotten of the Father [the only-begotten; that is, of the essence of the Father, God of God], Light of Light, very God of very God, begotten, not made, being of one substance with the Father; And in one Lord Jesus Christ, the only-begotten Son of God, begotten of the Father before all worlds (æons), Light of Light, very God of very God, begotten, not made, being of one substance with the Father; by whom all things were made [both in heaven and on earth]; by whom all things were made; who for us men, and for our salvation, came down and was incarnate and was made man; who for us men, and for our salvation, came down from heaven, and was incarnate by the Holy Ghost of the Virgin Mary, and was made man; he suffered, and the third day he rose again, ascended into heaven; he was crucified for us under Pontius Pilate, and suffered, and was buried, and the third day he rose again, according to the Scriptures, and ascended into heaven, and sitteth on the right hand of the Father; from thence he shall come to judge the quick and the dead. from thence he shall come again, with glory, to judge the quick and the dead; whose kingdom shall have no end. And in the Holy Ghost. And in the Holy Ghost, the Lord and Giver of life, who proceedeth from the Father, who with the Father and the Son together is worshiped and glorified, who spoke by the prophets. In one holy catholic and apostolic Church; we acknowledge one baptism for the remission of sins; we look for the resurrection of the dead, and the life of the world to come. Amen. [But those who say: 'There was a time when he was not;' and 'He was not before he was made;' and 'He was made out of nothing,' or 'He is of another substance' or 'essence,' or 'The Son of God is created,' or 'changeable,' or 'alterable' — they are condemned by the holy catholic and apostolic Church.] The following table presents in the same way the texts of the two Councils in the original Greek on the website Symbolum Nicaeno-Constantinopolitanum - Greek: First Council of Nicea (325) First Council of Constantinople (381) ==Problems== There were problems with the Nicene Creed. In 529, the so-called filioque clause was added to the creed. The clause is one of the main differences between the Roman Catholic Church and the Eastern Orthodox Church. The Catholic Church has the clause but not the Eastern Orthodox Church. The clause tells how the Son is connected to the Holy Spirit. The original Nicene Creed reads \"We believe in the Holy Spirit ... who proceeds from the Father\", but the Catholic version is altered to read \"We believe in the Holy Spirit ... who proceeds from the Father and the Son\". Catholics accept the change, but the Eastern Orthodox reject it. Many Eastern Catholic churches (Eastern in liturgy but in full communion with the Pope) do not use the clause in their creed. They think the doctrine that it represents is true, however, as it is a Catholic dogma. Most Protestant churches such as the Anglican Church that take a position on the matter accept the clause. After the East–West Schism of 1054, the Eastern and the Western Churches attempted to reunite at two separate medieval councils, and the clause was an issue at both. Despite Eastern concessions, neither the Second Council of Lyon (1274) nor the Council of Ferrera-Florence (1438-1535) achieved the desired union.Wetterau, Bruce. World history. New York: Henry Holt and company. 1994. The clause is most often referred to as the \"filioque clause\" or simply filioque. ==Related pages== *Apostles' Creed *Athanasian Creed *One Holy Catholic and Apostolic Church ==References== == Bibliography == * A E Burn, The Council of Nicaea (1925); * G Forell, Understanding the Nicene Creed (1965) * J.N.D. Kelly, Early Christian Creeds, (1982), == Other websites == * Extensive discussion of the texts of the First Council of Nicea * Philip Schaff, Creeds of Christendom Volume I: Nicene Creed * Athanasius, De Decretis or Defence of the Nicene Definition * Line-by-Line Roman Catholic Explanation of the Nicene Creed * Nicene Creed in languages of the world Category:Christian creeds Category:Ancient Christianity",
 "title": "Nicene Creed"
}