{
 "id": "55696",
 "text": "The Apostles' Creed (Latin: Symbolum Apostolorum), sometimes titled Symbol of the Apostles, is an early statement of Christian belief, a creed or \"symbol.\" It is commonly used by many Christian denominations, during religious ceremonies and as a summary of Christian beliefs. It is most commonly used during ceremonies at churches of Western tradition, including the Latin Rite of the Roman Catholic Church, Lutheranism, the Anglican Communion, and Western Orthodoxy. It is also used by evangelical Protestant denominations such as Presbyterians, Methodists, Congregationalists, and many Baptists. The Creed is named the Apostles' Creed because it is made of twelve articles. People believed that after Pentecost, God inspired each of Jesus' Twelve Apostles to write one article. ==Origin of the Creed== Many hypotheses exist about when and how the Apostles' Creed was created. Many suppose it comes from \"the Old Roman Symbol\" of the 1st or 2nd century, and was influenced later by the Nicene Creed (325/381).Some historians think it comes from Gaul in the 5th century. The earliest known concrete historical evidence of the creed's existence as it is currently titled (Symbolum Apostolicum) is a letter of the Council of Milan (390) to Pope Siricius (here in English): ::\"If you credit not the teachings of the priests . . . let credit at least be given to the Symbol of the Apostles which the Roman Church always preserves and maintains inviolate.\" The earliest appearance of the present Latin text was in the De singulis libris canonicis scarapsus (\"Concerning the Single Canonical Book Scarapsus\") of St. Priminius (Migne, Patrologia Latina 89, 1029 ff.), written between 710-724 (J.N.D. Kelly, Early Christian Creeds, Longmans, Green & Co, 1972, pp. 398-434). This creed seems to have been made as an argument against Gnosticism. Gnosticism was a heresy in the early days of the Church. Gnostics believed things that were very different than what the Catholic Church taught. The Apostles' Creed, and other creeds, were made to be like examples of Catholic teachings, and to defend Catholic beliefs.This can be seen in almost every phrase. For example, the creed states that Christ was born, suffered, and died on the cross. This seems to be an argument against Gnostic beliefs, which said that Christ only seemed to become a man, and that he did not truly suffer and die, but only seemed like he did. Because it was written very early in history, it does not talk about some issues that later Christian creeds, like the Nicene Creed, brought up. This makes it acceptable to many Arians and Unitarians. For more information on the origin of the Apostles' Creed, see the detailed discussion in the Catholic Encyclopedia. ==Text of the Creed == ===Latin text=== Credo in Deum Patrem omnipotentem, Creatorem caeli et terrae. Et in Iesum Christum, Filium Eius unicum, Dominum nostrum, qui conceptus est de Spiritu Sancto, natus ex Maria Virgine, passus sub Pontio Pilato, crucifixus, mortuus, et sepultus, descendit ad ínferos, tertia die resurrexit a mortuis, ascendit ad caelos, sedet ad dexteram Dei Patris omnipotentis, inde venturus est iudicare vivos et mortuos. Credo in Spiritum Sanctum, sanctam Ecclesiam catholicam, sanctorum communionem, remissionem peccatorum, carnis resurrectionem, vitam aeternam. Amen. ===Greek text=== (Triglot Concordia, St. Louis: Concordia Publishing House, 1921, p. 12) ==English translations== ===The Roman Catholic Church=== The English version in the Catechism of the Catholic Church keeps the tradition of dividing the Creed into twelve articles: :I believe in God, the Father almighty, :creator of heaven and earth. :And in Jesus Christ, his only Son, our Lord. :He was conceived by the Holy Spirit :Born of the Virgin Mary. :Suffered under Pontius Pilate, :was crucified, died, and was buried. :He descended into hell. :On the third day he rose again from the dead. :He ascended into heaven :and is seated at the right hand of the Father. :He will come again to judge the living and the dead. :I believe in the Holy Spirit, :the holy catholic Church, :the communion of saints, :the forgiveness of sins, :the resurrection of the body, :and the life everlasting. :Amen. ===The Church of England=== In the Church of England there are currently two authorized forms of the creed. One is in the Book of Common Prayer (1662). The other is in Common Worship (2000). |- Book of Common Prayer :I believe in God the Father Almighty :Maker of heaven and earth :And in Jesus Christ his only Son our Lord, :Who was conceived by the Holy Ghost, :Born of the Virgin Mary, :Suffered under Pontius Pilate, :Was crucified, dead, and buried, :He descended into hell; :The third day he rose again from the dead, :He ascended into heaven, :And sitteth on the right hand of God the Father Almighty; :From thence he shall come to judge the quick and the dead. :I believe in the Holy Ghost; :The holy Catholick Church; :The Communion of Saints; :The Forgiveness of sins; :The Resurrection of the body, :And the life everlasting. :Amen. Common Worship :I believe in God, the Father almighty, :creator of heaven and earth. :I believe in Jesus Christ, his only Son, our Lord, :who was conceived by the Holy Spirit, :born of the Virgin Mary, :suffered under Pontius Pilate, :was crucified, died, and was buried; :he descended into hell. :On the third day he rose again; :he ascended into heaven, :he is seated at the right hand of the Father, :and he will come to judge the living and the dead. :I believe in the Holy Spirit, :the holy catholic Church, :the communion of saints, :the forgiveness of sins, :the resurrection of the body, :and the life everlasting. :Amen. ===The United Methodist Church=== The United Methodists commonly include the Apostles' Creed in their worship services.The version which is most often used is located at #881 in the United Methodist Hymnal, one of their most popular hymnals and one with a heritage to John Wesley, founder of Methodism . Their version of the Creed is special because it does not have the line \"he descended into hell.\" Except for this, it is very similar to the version in the Book of Common Prayer. :I believe in God the Father Almighty, :maker of heaven and earth; :And in Jesus Christ his only Son our Lord: :who was conceived by the Holy Spirit, :born of the Virgin Mary, :suffered under Pontius Pilate, :was crucified, dead, and buried; :the third day he rose from the dead; :he ascended into heaven, :and sitteth at the right hand of God the Father Almighty; :from thence he shall come to judge the quick and the dead. :I believe in the Holy Spirit, :the holy catholic church, :the communion of saints, :the forgiveness of sins, :the resurrection of the body, :and the life everlasting. Amen. The United Methodist Hymnal also contains (at #882) what it calls the \"Ecumenical Version\" of the Creed. This version is identical to the one in the Episcopal Church's current Book of Common Prayer. This form of the Apostles' Creed is included in the Hymnal to be used during the Eucharist and baptisms. Because of this, it is getting more popular. ===Ecumenical version of the English Language Liturgical Consultation=== The English Language Liturgical Consultation (ELLC) is an international group whose goal is to provide texts that can be used and accepted by people of any Christian denomination. In 1988, it created a translation of the Apostles' Creed. One major change in this version is that it does not use the word \"his\" when talking about God. The text is as follows: :I believe in God, the Father almighty, ::creator of heaven and earth. :I believe in Jesus Christ, God's only Son, our Lord, ::who was conceived by the Holy Spirit, ::born of the Virgin Mary, ::suffered under Pontius Pilate, ::was crucified, died, and was buried; ::he descended to the dead. ::On the third day he rose again; ::he ascended into heaven, ::he is seated at the right hand of the Father, ::and he will come to judge the living and the dead. :I believe in the Holy Spirit, ::the holy catholic Church, ::the communion of saints, ::the forgiveness of sins, ::the resurrection of the body, ::and the life everlasting. Amen. ==Related pages== * Related creeds: ** Nicene Creed * Doctrines: ** Communion of Saints ** One, Holy, Catholic, and Apostolic Church ==Notes and References== * * * == Other websites == * The prayer on roman-catholic- prayers.com Category:Christian creeds Category:Ancient Christianity",
 "title": "Apostles' Creed"
}