{
 "id": "55691",
 "text": "God the Father is a title for God in the Christian religion; however, for believers of the Trinity, God the Father is only viewed as the first person of the Trinity, who along with the Son and the Holy Spirit are of the same essence, share the same qualities, and are each fully God. God is known as the Father because of his unending care for humanity, just like a father would care for his dependent children, and as our father and creator, he responds to his children so he can have a relationship with us.John W. Miller, Calling God \"Father\" (November 1999) pages x–xiiDiana L. Eck (2003) Encountering God: A Spiritual Journey from Bozeman to Banaras p. 98Karl Barth, Church Dogmatics, Vol. 2.1, Section 31: The Doctrine of God (23 September 2010) pp. 15–17 Through prayer, you can grow a relationship with Him.Floyd H. Barackman, 2002 Practical Christian Theology p. 117John W. Miller, Calling God \"Father\" (November 1999) p. 51Karl Barth, Church Dogmatics, Vol. 2.1, Section 31: The Doctrine of God (23 September 2010) pp. 73–74 Even though the term \"Father\" itself is masculine, God is understood to have the form of a spirit without any human biological gender as he is a being beyond our understanding. Catechism of the Catholic Church No. 239 specifically states that \"God is neither man nor woman: he is God\".David Bordwell, 2002, Catechism of the Catholic Church, Continuum International Publishing p. 84Catechism at the Vatican website Even though God is never directly called \"Mother\" in the Bible, in the Book of Isaiah there are many verses where God is shown to have motherly attributes, such as: , or .John W. Miller, Calling God \"Father\": Essays on the Bible, Fatherhood and Culture (November 1999) pp. 50–51 == Views == === Trinitarianism === Christians who believe in the Trinity believe that God the Father is not a separate being or god from the other members of the Trinity; instead, they are distinct persons who are of the same essence and share the same qualities; because of this, the Son and Holy Spirit are no less \"God\" than the Father.Geoffrey W. Bromiley, International Standard Bible Encyclopedia: E–J (March 1982) pp. 515–516Gilles Emery O. P. and Matthew Levering, The Oxford Handbook of the Trinity (27 October 2011) p. 263Critical Terms for Religious Studies. Chicago: The University of Chicago Press, 1998. Credo Reference. 27 July 2009 According to Eastern Orthodox theology, God the Father is the arche or principium (\"beginning\"), the \"source\" or \"origin\" of both the Son and the Holy Spirit, and is considered the eternal source of the Godhead.Alan Richardson and John Bowden, The Westminster Dictionary of Christian Theology (1 January 1983) p. 36 The Father is the one who eternally begets the Son, and the Father, through the Son, eternally breathes the Holy Spirit.Veli-Matti Kärkkäinen, The Doctrine of God: A Global Introduction 2004 pp. 70–74 === Nontrinitarianism === There are groups that do not believe in the Trinity and have different views. Followers of Mormonism believe in the Godhead, which is a divine council of three distinct beings: Elohim (the Father), Jehovah (the Son, Jesus Christ), and the Holy Spirit. Elohim and Jehovah have perfected physical bodies, while the Holy Spirit has a body of spirit.. See also: Mormons believe that instead of sharing the same essence, each person is their own being; Elohim created Jehovah and the Holy Spirit and is greater in authority and power than them, while they are united in purpose (this heresy is called Subordinationism). Mormons believe that God the Father has a spouse called the Heavenly Mother, and together they are the Heavenly Parents; that God the Father is one of the many gods out there in the universe, and there are gods greater than him; that he isn't the creator of the universe and created a few planets through Jehovah but created them with existing materials and not ex nihilo; and that he was once a human who was tested just like us, and because of his obedience to his god, he became one. == Related pages == * God * God the Son * Holy Spirit in Christianity * Jesus * Trinity * Subordinationism == References == == Other websites == * God the Father at Theopedia Category:Gods and goddesses Category:Christian theology",
 "title": "God the Father"
}