{
 "id": "557266",
 "text": "Philip Sidney (1554–1586) was an English poet, diplomat and soldier .\"Sir Philip Sidney's Biography at Poetry Foundation\"., Retrieved 15 October, 2016 == Biography == Philip Sidney was born on 30 November 1554. He was the son of Henry Sidney and his wife, Mary, née Dudley. On 17 October 1564 he was enrolled in Shrewsbury School. One of the boys that began their learning on that day was Fulke Greville, First Lord Brooke, who became Philip Sidney's friend. Much later he became his biographer, too. After he finished school, at the age of 13, Philip Sidney went to Oxford to study at Christ College. He did not however get any scholarly degree. He went to France when he witnessed the St. Bartholomew's Day massacre. He also travelled to Germany, Austria and Hungary. He was in Italy, too. He went as a messenger from Queen Elizabeth to Prague, where the emperor Maximilian II ruled. Then he went to a war in Netherlands. There he was wounded in the thigh 23 September 1586 at Zuphen. Because of that he got an infection and died at 17 October 1586 at Arnhem. He was buried on February 16, 1587 at St. Paul’s Cathedral in London. == Works == Philip Sidney is generally regarded as best English lyrical poet of the Renaissance. He was also considered a hero after his deathPhilip Sidney Bio , Retrieved 15 October, 2016 Phillip Sidney wrote both poetry and prose. He is famous for his sonnets. They were edited in the sequence named Astophil and Stella.Astrophel and Stella, Retrieved 22 January, 2007 He also wrote ArcadiaSir Philip Sidney at Encyclopaedia Britannica,, Retrieved 15 October, 2016 and The Defence of Poesy. Philip Sidney's poems were translated into many languages, among others into Czech.Philip Sidney, Astrofel a Stella, [translated by Gustav Francl and Alois Bejblík], Odeon, Praha 1987. Philip Sidney's sister was the poet and translator Mary Sidney Herbert, Countess of Pembroke (1561-1621). == References == == Other websites == * Philip Sidney, Astrophil and Stella. The text of each poem with a line by line paraphrase, and occasional explanatory notes by A. S. Kline. Category:English poets Category:British diplomats Category:1554 births Category:1586 deaths",
 "title": "Philip Sidney"
}