{
 "id": "55736",
 "text": "An acting president of the United States is someone who temporarily takes on the powers and duties of the president without officially holding the title. This can happen if the president becomes too sick to perform their job, resigns, dies, or is removed from office. It can also happen if a new president has not been chosen or is unable to take office by Inauguration Day. The United States has a plan called the presidential line of succession, which chooses who will serve as acting president in these situations. The U.S. Constitution mentions presidential succession in Article II, the Twentieth Amendment, and the Twenty-fifth Amendment. The vice president is the first in line to take over, and if they can't serve, Congress gets to choose who comes next. The current order of succession, set by the Presidential Succession Act of 1947 and last updated in 2006, is: the vice president, the speaker of the House of Representatives, the president pro tempore of the Senate, and then members of the president’s Cabinet, starting with the secretary of state. However, if someone other than the vice president takes over, they only act as president and do not officially become president. The vice president immediately becomes president if the current president dies, resigns, or is removed. If a president-elect dies or refuses to serve before Inauguration Day, the vice president-elect becomes president. A vice president can also serve as acting president if the president is temporarily unable to do their job due to illness or another reason. So far, this has happened three times, but in each case, the vice president only served as acting president for a short time without officially becoming the president. Acting President Date Start/End Times Incumbent President Cause for inability to perform duties George H.W. Bush July 13, 1985 11:28-19:22 EDT Ronald Reagan Colon cancer surgery Richard B. Cheney June 29, 2002 07:09-09:24 EDT George W. Bush Colonoscopy Richard B. Cheney July 21, 2007 07:16-09:21 EDT George W. Bush Colonoscopy Kamala D. Harris November 19, 2021 10:10-11:35 EST Joe Biden Colonoscopy Kamala Harris became the first female acting president on November 19, 2021. She is the first woman in the history of the United States to hold presidential powers. == References == == Other websites == * Presidential Line of Succession Examined , September 20, 2003 * Amendment25.com *",
 "title": "Acting President of the United States"
}