{
 "id": "55762",
 "text": "Electric power transmission is the transmitting of electricity to places where it will be used. Specifically, it is the bulk transfer of electrical power from the power plant to substations near populated areas. Electric power distribution is the delivery from the substation to the consumers. Due to the large amount of power and long distances, transmission normally takes place at high voltage (110 kV or above). Electricity is usually transmitted over long distance through overhead power transmission lines. Underground power transmission is used only in densely populated areas (such as large cities) because of the high cost of installation and maintenance and because the power losses increase dramatically compared with overhead transmission unless superconductors and cryogenic technology are used. A power transmission system is often referred to as a \"grid\"; however, for reasons of economy, the network is rarely a true grid. Redundant paths and lines are provided so that power can be routed from any power plant to any load center, through a variety of routes, based on the economics of the transmission path and the cost of power. == Further reading == * Grigsby, L. L., et al. The Electric Power Engineering Handbook. USA: CRC Press. (2001). * Westinghouse Electric Corporation, \"Electric power transmission patents; Tesla polyphase system\". (Transmission of power; polyphase system; Tesla patents) ==Related pages== * Transmission tower * Superconductor * Electric power distribution * High-voltage direct current == Other websites == * United States: Transmission Lineworker Community Website * Japan: World's First In-Grid High-Temperature Superconducting Power Cable System * A Power Grid for the Hydrogen Economy: Overview/A Continental SuperGrid * Global Energy Network Institute (GENI) - The GENI Initiative focuses on linking renewable energy resources around the world using international electricity transmission. * Union for the Co- ordination of Transmission of Electricity (UCTE), the association of transmission system operators in continental Europe, running one of the two largest power transmission systems in the world * Non-Ionizing Radiation, Part 1: Static and Extremely Low-Frequency (ELF) Electric and Magnetic Fields (2002) by the International Agency for Research on Cancer (IARC). * A summary of the IARC report by GreenFacts. Category:Electricity",
 "title": "Electric power transmission"
}