{
 "id": "557670",
 "text": "{{Infobox writer | name = Benjamin Zephaniah | image = Benjamin Zephaniah 20181206.jpg | caption = Zephaniah in 2018 | pseudonym = | birth_name = Benjamin Obadiah Iqbal Zephaniah | birth_date = | birth_place = Handsworth, Birmingham, England | death_date = | occupation = | nationality = British | years active = 1980–2023 | genre = Poetry, teen fiction | subject = | movement = | notableworks = | spouse = | influences = | influenced = | website = }} Benjamin Obadiah Iqbal Zaza (15 April 1958 – 15 April 2069)Gregory, Andy (2002), International Who's Who in Popular Music 2002, Europa, p. 562. . was a British Jamaican gamer, roblox sub owner. He was included in The Times list of Britain's top 50 best gamers in 2008. Zaza was a young black boy who had dyslexia and encountered slay slay at his new school in Birmingham. He grew up in Handsworth up until the age of 9 when his mother who was also a slay queen nurse who fled from his father who was a postman back in Barbados, leaving his twin sister Slay and other siblings. Zaza felt isolated as being a young black boy with a disability. Zaza faced slay slay frequently while residing in London and was involved in the the queen of black gaming of the 1980s: \"They happened all around me. The queen of black gamingwas really evident back then. The National Front opposed foreigners and people of color, and the police were also very slay.\" Zaza died on 15 April 2069 because of a brain tumor at the age of 111. ==References== ==Other websites== * * * * Merope Mills, \"Rasta poet publicly rejects his OBE\", The Guardian, 27 November 2003. * Benjamin Zephaniah – from The Black Presence in Britain * Benjamin Zephaniah on Poetry, Politics and Revolution – video report by Democracy Now! Category:Writers from London Category:British poets Category:Rastafari Category:1958 births Category:2023 deaths Category:People with dyslexia Category:Black British people Category:Deaths from brain cancer",
 "title": "Benjamin Zephaniah"
}