{
 "id": "55780",
 "text": "In cell biology, an organelle is a part of a cell that does a specific job. Organelles usually have a plasma membrane around them.See 'Scope of the term' below. Most of the cell's organelles are in the cytoplasm.Alberts, Bruce et al. 2003. Essential cell biology, 2nd ed. Garland Science. The name organelle comes from the idea that these Structures are to cells what an organ is to the body. There are many types of organelles in eukaryotic cells. Prokaryotes were once thought not to have organelles, but some examples have now been found. They are not organized like eukaryote organelles, and are not bounded by plasma membranes. They are called bacterial microcompartments. == Scope of the term == The term is now widely used to refer to cell structures surrounded by single or double plasma membranes.Nultsch, Allgemeine Botanik, 11 Aufl. 2001, Thieme VerlagWehner/Gehring: Zoologies. 23. Aufl. 1995, Thieme VerlagBrock, Microbiology, 2. korrigierter Nachdruck 2003. der 1. Aufl. von 2001 However, the older definition of a 'subcellular functional unit' still exists. So, the term is sometimes used for structures which are not membrane- bound.Strasburger's Lehrbuch der Botanik für Hochschulen, 35. Aufl. 2002. S. 42 The plasma membrane is a lipid bilayer with some proteins embedded in it. It keeps the ions and molecules of the organelle from merging with the surroundings. == Origin of organelles == Mitochondria and chloroplasts have double-membranes and their DNA. These are believed to come from incompletely digested or invading prokaryotes, which were adopted as a part of the invaded cell. This idea is supported in the endosymbiotic theory. == Eukaryotic organelles== === Major organelles === Major eukaryotic organelles Organelle Main function Structure Organisms Notes chloroplast (plastid) photosynthesis double-membrane compartment plants, protists has some DNA; originally obtained from endosymbiosis. endoplasmic reticulum translation and folding of new proteins (rough endoplasmic reticulum), expression of lipids (smooth endoplasmic reticulum) single-membrane compartment all eukaryotes rough endoplasmic reticulum has many ribosomes, and folds that are flat sacs; smooth endoplasmic reticulum has folds that are tubular flagellum locomotion, sensory some eukaryotes Golgi apparatus sorting and modification of proteins single- membrane compartment all eukaryotes mitochondrion energy production double- membrane compartment most eukaryotes has some DNA; originally obtained by endosymbiosis nucleus DNA maintenance, RNA transcription double-membrane compartment all eukaryotes has bulk of genome vacuole storage, homeostasis single-membrane compartment eukaryotes === Minor organelles === Minor eukaryotic organelles and cell components Organelle/Macromolecule Main function Structure Organisms acrosome helps spermatoza fuse with ovum single- membrane compartment many animals autophagosome vesicle which collects cytoplasmic material and organelles for degradation double-membrane compartment all eukaryotic cells centriole anchor for cytoskeleton microtubule protein animals cilium movement in or of external medium. microtubule protein animals, protists, few plants cnidocyst stinging coiled hollow tubule cnidarians eyespot apparatus detects light, allowing phototaxis to take place green algae and other unicellular photosynthetic organisms such as Euglena glycosome carries out glycolysis single-membrane compartment Some protozoa, such as Trypanosomes. glyoxysome conversion of fat into sugars single-membrane compartment plants hydrogenosome energy & hydrogen production double-membrane compartment a few unicellular eukaryotes lysosome breakdown of large molecules (e.g., proteins + polysaccharides) single-membrane compartment by convention, animal cells; but (wider definition) most eukaryotes melanosome pigment storage single-membrane compartment animals mitosome not known double-membrane compartment a few unicellular eukaryotes myofibril muscular contraction bundled filaments animals nucleolus ribosome production protein-DNA-RNA most eukaryotes parenthesome not known not known fungi peroxisome breakdown of metabolic hydrogen peroxide single-membrane compartment all eukaryotes proteasome degradation of unneeded or damaged proteins by proteolysis very large protein complex All eukaryotes, all archaea, some bacteria ribosome translation of RNA into proteins RNA-protein eukaryotes, prokaryotes stress granule mRNA storage membraneless (mRNP complexes) Most eukaryotes vesicle material transport single-membrane compartment all eukaryotes == Prokaryotic organelles == Prokaryotes are not so complex as eukaryotes. They were once thought to have no internal structures inside the lipid membranes. However, recent research has shown that at least some prokaryotes have microcompartments such as carboxysomes. These subcellular compartments are 100–200 nm in diameter and are enclosed by a shell of proteins. Even more striking is the description of membrane-bound magnetosomes in bacteria. as well as the nucleus-like structures of the Planctomycetes that are surrounded by lipid membranes. Prokaryotic organelles and cell components Organelle/Macromolecule Main function Structure Organisms carboxysome carbon fixation protein-shell compartment some bacteria chlorosome photosynthesis light harvesting complex green sulfur bacteria flagellum movement in external medium protein filament some prokaryotes and eukaryotes magnetosome magnetic orientation inorganic crystal, lipid membrane magnetotactic bacteria nucleoid DNA maintenance, transcription to RNA DNA-protein prokaryotes plasmid DNA exchange circular DNA mostly cyanobacteria ribosome translation of RNA into proteins RNA-protein eukaryotes, prokaryotes thylakoid photosynthesis photosystem proteins and pigments some bacteria == References ==",
 "title": "Organelle"
}