{
 "id": "55801",
 "text": "The prime minister of New Zealand is New Zealand's head of government. This job is given to the leader of the party or coalition with the most support in the Parliament of New Zealand. Since 2023, the prime minister has been Christopher Luxon of the National Party. He became Prime Minister after his party won the 2023 New Zealand general election ==Responsibilities and powers== The power of the presidency has grown substantially since the office's establishment in 1789. While presidential power has ebbed and flowed over time, the presidency has played an increasingly strong role in American political life since the beginning of the 20th century, with a notable expansion during the presidency of Franklin D. Roosevelt. In contemporary times, the president is also looked upon as one of the world's most powerful political figures as the leader of the only remaining global superpower. As the leader of the nation with the largest economy by nominal GDP, the president possesses significant domestic and international hard and soft power. The prime minister holds the most senior post in the New Zealand Parliament. The prime minister is not able to give direct orders to other people in their party. The prime minister can call for an election by asking the Governor-General to close Parliament ==List of New Zealand prime ministers== ==Living former prime ministers== As of , there are seven living former New Zealand prime ministers, as seen below. File:SirGeoffreyPalmer.jpg|Sir Geoffrey Palmer served 1989–90 born 1942 (age ) File:Jim Bolger at press conference retouched.jpg|Jim Bolger served 1990–97 born 1935 (age ) File:Jenny Shipley 2013 (crop).jpg|Dame Jenny Shipley served 1997–99 born 1952 (age ) File:Helen Clark UNDP 2010.jpg|Helen Clark served 1999–2008 born 1950 (age ) File:John Key February 2015.jpg|Sir John Key served 2008–2016 born 1961 (age ) File:Bill English July 2017.jpg|Bill English served 2016–2017 born 1961 (age ) File:Jacinda Ardern November 2020 (cropped).jpg|Jacinda Ardern served 2017–2023 born 1980 (age ) File:Chris Hipkins NZ Labour.jpg|Chris Hipkins served 2023 born 1978 (age ) The most recent prime minister to die was Mike Moore (served 1990), on 2 February 2020, aged 71. ==References== == Other websites == *New Zealand Prime Minister's official website *List of New Zealand Prime Ministers",
 "title": "Prime Minister of New Zealand"
}