{
 "id": "558273",
 "text": "New7Wonders of the World (2000–2007) was an idea to choose new Wonders of the World from a selection of 200 existing monuments. The popularity poll was led by Canadian-Swiss Bernard Weber and organized by the New7Wonders Foundation in Zürich, Switzerland. Winners were announced on 7 July 2007 in Lisbon. The foundation took only private donations and the sale of broadcast advertising. It had no public funding or taxpayers' money. After the final announcement, New7Wonders said it did not make money and barely recovered its investment. The seven wonders of the world can be seen on various Celebrity Cruises itineraries. == Official reactions == The program caused different reactions from countries and organisations. Some countries praised their finalist and tried to get more people to vote for it. Others criticized the contest or did not think it was very important.The Seven Wonders of the World, 2.0, Los Angeles Times, 2007-07-07 Retrieved 25 October 2016 === United Nations === In the beginning, UNESCO helped the New7Wonders Foundation by giving advice on nominee selection. Then they decided they could not continue to help. Saying they have to give equal status to all world heritage sites, they dropped out of the program in 2001 and again in 2007. In 2007 the Foundation became partners with the United Nations to help promote their shared goals. The UN posted on its website: But in a press release on June 20, 2007, UNESCO said again that it has no link with the \"private initiative\". ===Brazil=== In Brazil there was a campaign named Vote no Cristo (Vote for the Christ) which had the support of private companies. Among them were telecommunications workers that stopped charging voters to make telephone calls and SMS messages to vote. Also, important corporate sponsors spent millions of Brazilian reals in an effort to have the statue voted into the top seven. These included a banking company (Banco Bradesco) and a television network (Rede Globo). Newsweek magazine said the campaign was so widespread that: An article in Newsweek said that an estimated 10 million Brazilians had voted in the contest by early July. An airplane message, with a huge flying sign \"4916 VOTE FOR CHRIST\" flew in Rio de Janeiro for a month. === Egypt === Egyptians were not happy that the only surviving ancient wonder, the Great Pyramid of Giza, would have to compete with the Statue of Liberty, the Sydney Opera House, and other modern sites. \"This is probably a conspiracy against Egypt, its civilization and monuments\", a state-owned daily newspaper wrote. The Minister of Culture of Egypt, Farouq Hosny said the project was \"absurd\". Nagib Aymin, an Egyptian expert on World Heritage Sites, said that \"in addition to the commercial aspect, the vote has no scientific basis.\" After the complaints from Egypt, the Pyramids of Giza were named an honarary candidate, and removed from the voting. They were listed as one of the 21 finalistsNWOC Pyramids of Giza Retrieved 26 October 2016 and given honorary status among the winners. == Voting == The New7Wonders Foundation said that more than 100 million votes were cast through the Internet or by telephone. Voting by the Internet was limited to one vote for seven monuments per person. More voting was allowed by telephone. This led to criticism that the poll was not valid. At the time, New7Wonders Foundation had \"the largest poll on record\". ==Winners== The Great Pyramid of Giza was granted honorary status. It is the largest and oldest of the three pyramids at the Giza Necropolis in Egypt. It is also the only structure still remaining of the original Seven Wonders of the Ancient World. Wonder Location Image Date of construction Great Pyramid of Giza (honorary status) Giza Necropolis, Egypt 2560 BCE The Great Wall of China China 700 BCE Petra Jordan 312 BCE Colosseum Rome, Italy 80 CE Chichen Itza Yucatán, Mexico 600 CE Machu Picchu Cuzco Region, Peru 1450 CE Taj Mahal Agra, Uttar Pradesh, India 1643 CE Christ the Redeemer Rio de Janeiro, Brazil 1931 CE == References == == Other websites == Category:Seven Wonders of the World Category:2000 establishments Category:2007 disestablishments",
 "title": "New7Wonders of the World"
}