{
 "id": "55851",
 "text": "Jaundice (also called icterus) is when the skin and the whites of the eyes become a yellow color. People with jaundice have a problem with their liver, which stops it from removing heme properly. Heme (from hemoglobin) changes to a chemical called bilirubin after red blood cell death. Bilirubin causes the yellow coloring of the skin. Jaundice is common in newly born babies. It usually starts the second day after birth. Jaundice can also be caused by other diseases, like malaria, hepatitis, or gallstones. Jaundice is the most common of all liver problems. The yellow colour of the skin and mucous membranes happens because of an increase in the bile pigment, bilirubin, in the blood. The bile, made by the liver, is a vital digestive fluid needed for proper nutrition. It also stops decaying changes in food. If the bile is stopped from entering the intestines there is an increase in gases and other products. Normally, the production of bile and its flow is constant. ==Types of Jaundice== There are three types of jaundice: * haemolytic jaundice - caused by destruction of red blood cells. This causes increased bilirubin formation and anaemia * obstructive jaundice - caused by a blockage in the pathway where bilirubin is made in the liver cells and where bile goes into the duodenum * hepatocellular jaundice - caused by damage to liver cells. The damage could be from a viral infection or toxic drugs. Yellow discoloration of the skin and the whites of the eyes happens in all types of jaundice. ==Symptoms== The symptoms of jaundice are: * extreme weakness * headache * fever * loss of appetite * tiredness * severe constipation * nausea * yellow coloration of the eyes, tongue, skin and urine. * dull pain in the liver region. * Obstructive jaundice may also cause intense itching. ==Causes== Jaundice is a sign that the liver is not working. It may be caused by a blockage of the bile ducts which release bile salts and pigment into the intestines. The bile then gets mixed with blood and this gives a yellow colour to the skin. The blockage of the bile ducts could be caused by: * gallstones * inflammation (swelling) of the liver, called hepatitis. This is caused by a virus. The virus can spread and may lead to epidemics caused by: ** overcrowding ** dirty surroundings ** insanitary conditions ** contamination of food and water. Other causes of jaundice are pernicious anaemia and diseases affecting the liver such as typhoid, malaria, yellow fever and tuberculosis. ==References== Category:Symptoms Category:Liver disease",
 "title": "Jaundice"
}