{
 "id": "55857",
 "text": "In Hinduism the concept of God or Goddess is not like that of monotheistic religions. The Gods of most cultures in Asia are icons of excellence. They may be questioned. Each represents a strength of human character. In Hinduism there are many beliefs about different gods. In most of them a god is in charge. Supreme divine power in Hinduism is Brahma, Vishnu and Shiva. the sole ultimate truth, an entity that exists and gives life to all things. It is formless and is referred to as Vishnu or Narayana, Adi Parashakti/Shakti or Durga and Shiva or Mahadeva in different sects of Hinduism. Different forms (Avatars) of the same entity or supreme Brahman are worshipped in the traditions and sects in Hinduism. Hindus believe all it's devi-devas are different forms of that same formless Brahman. Devi-Devas in Hinduism are thought as highly advanced spiritual beings and are often represented in human form or partially human and partially animal forms. Sometimes they are also represented as non-living things and plants. The three gods who started creation: Vishnu, Brahma, and Shiva are called Bhagwans (also known as Bhagavān). Yakshas are all male gods created by the three Bhagwans. The main god in the Vaishnavite sect of Hinduism is Vishnu. Vishnu is revered as the supreme Paramatman in Vaishnava tradition. Shiva is the Supreme, in Shaivite traditions while in Shakti traditions, Adi Parashakti is supreme. Other names such as Ishvara, Bhagavan, Bhagvati, Parmeshwara and Paramatamana also means Hindu gods and all of them mainly denote Brahman. Vishnu, Shiva and Brahma are the major gods and Lakshmi, Parvati and Saraswati are the major goddesses in Hinduism.Lance Nelson (2007), An Introductory Dictionary of Theology and Religious Studies (Editors: Orlando O. Espín, James B. Nickoloff), Liturgical Press, , pages 562–563 Many Hindus believe that Brahma is the Creator, Vishnu is the preserver and Shiva or Maheshwar is destroyer. ==Supreme God == The idea of a single, widely accepted supreme God in Hinduism is not uniform and varies across different traditions. Some followers worship specific deities as the supreme being, such as Vishnu, Shakti, or Shiva, while others have a more abstract understanding of divinity. In some cases, all deities are seen as manifestations of a single ultimate reality. The cultural and linguistic diversity of India has influenced the varied interpretations of the concept of a supreme God within Hinduism. Regional and family traditions can play a large part in influencing this choice.Harman, William, \"Hindu Devotion\" 104 in Contemporary Hinduism, Robin Rinehard, ed. (2004) There are four principal Hindu denominations —Vaishnavism, Shaktism, Shaivism, and Smartism. For Vaishnavites, God Vishnu is God Of Supreme, For Shaktas, Goddess Shakti is supreme, For Shaivites, God Shiva is Supreme. For Smartas—who see all Deities as reflections of the One God—the choice of Deity is left to the devotee. Most Hindus worship some form of a personal aspect of God, although they believe in the more abstract concept of a Supreme God as well. They generally choose one concept of God, and cultivate devotion to that chosen form, while at the same time respecting the chosen ideals of other people.Louis Renou, The Nature of Hinduism 55 (New York 1962) The many different names given to the Supreme God in Hinduism encourage many paths, as opposed to conformity to just one. The unique understanding in Hinduism is that God is not far away, living in a remote heaven, but is all-pervasive and energizes the entire universe. He is also inside each soul, waiting to be discovered. Knowing the one Supreme God in this intimate and experiential way is the goal of Hindu spirituality. ==Other gods== Hindus also believe in many Gods (Devas) who perform various functions, like executives in a large corporation. These should not be confused with the Supreme God. These deities are highly advanced beings who have specific duties and powers—not unlike the heavenly spirits, overlords or archangels in other faiths. Each denomination worships the Supreme God and its own set of divine beings. Devas (also called Devatās) are an integral part of the colorful Hindu culture. These various forms of God are represented in innumerable paintings, statues, murals, and scriptural stories that can be found in temples, homes, businesses, and other places. In Hinduism the scriptures recommend that for the satisfaction of a particular material desire a person may worship a particular deity. For example, shopkeepers frequently keep a statue or picture of the devi Lakshmi in their shops. ==Bhuvaneswari== The concept of Goddess Bhuvaneswari as the supreme goddess emerged in historical religious literature as a term to define the powerful and influential nature of female deities in India. Throughout history, goddesses have been portrayed as the mother of the universe, through whose powers the universe is created and destroyed. The gradual changes in belief through time shape the concept of Bhuvaneswari and express how the different Goddesses, though very different in personality, all carry the power of the universe on their shoulders. ==References==",
 "title": "Hindu gods"
}