{
 "id": "558638",
 "text": "Seyfert galaxies are a type of galaxy. They are named after Carl Seyfert who first described them in 1943.Seyfert, Carl K. 1943. Nuclear emission in spiral nebulae. The Astrophysical Journal. 97: 28–40. These galaxies are one of the two main types of active galaxies. The other large group are quasars. Seyfert galaxies have quasar-like nuclei: they are very distant luminous sources of electromagnetic radiation. Their very high surface brightness has spectra with strong, high-ionisation emission lines.Peterson, Bradley M. 1997. An introduction to active galactic nuclei. Cambridge University Press. However, unlike quasars, their host galaxies are clearly visible.Petrov G.T. (ed) 2004. Active galaxy nuclei. Bulgarian Academy of Sciences/Institute of Astronomy . Seyfert galaxies are about 10% of all galaxies,Maiolino R. & Rieke G.H. 1995. Low-luminosity and obscured Seyfert nuclei in nearby galaxies. The Astrophysical Journal. 454: 95–105. and are some of the most intensely studied objects in astronomy. They are thought to be powered by the same phenomena as quasars, although they are closer and less luminous than quasars. These galaxies have supermassive black holes at their centers which are surrounded by accretion discs of in-falling material. The accretion discs are believed to be the source of the observed ultraviolet radiation. Ultraviolet emission lines and absorption lines are the best way to analyse the surrounding material.Davidsen, Arthur F. 1993. Far-ultraviolet astronomy on the Astro-1 space shuttle mission. Science 259 (5093): 327–334. Seen in visible light, most Seyfert galaxies look like normal spiral galaxies. However, when studied under other wavelengths, it becomes clear that the luminosity of their cores is as big as the luminosity of whole galaxies the size of the Milky Way.Soper D.E. Seyfert galaxies. University of Oregon. == Examples == Here are some notable examples of Seyfert galaxies: * Circinus galaxy has rings of gas ejected from its center * Centaurus A, apparently the brightest Seyfert galaxy as seen from Earth. It is a giant elliptical galaxy: a radio galaxy notable for its relativistic jet spanning more than a million light years in length. * Messier 51a (NGC 5194), the Whirlpool Galaxy, one of the best known galaxies in the sky. * Messier 81 (NGC 3031), a popular target for amateur astronomy and the second brightest Seyfert galaxy in the sky after Centaurus A * Messier 87 (NGC 4486), central galaxy of the Virgo Cluster and the biggest galaxy in the Local Supercluster. It is a radio galaxy notable for its 4,400 light-year long relativistic jet powered by an immense supermassive black hole with the mass of (3.5 ± 0.2)-6.3 billion solar masses * NGC 1672 has a nucleus engulfed by intense starburst regions == References == Category:Galaxies",
 "title": "Seyfert galaxy"
}