{
 "id": "558814",
 "text": "The ZhuZhus (originally titled Polly and the Zhu Zhu Pets) is a Canadian/American animated television series produced by Nelvana, and the YTV. The series aired in the United States on Disney Channel on September 12, 2016. ==Premise== The ZhuZhus is about a young girl named Frankie Pamplemousse, her mom and dad, and her four talking hamsters: Pipsqueak, Mr. Squiggles, Num Nums, and Chunk. The group of five go on adventures in their town, Anytown. ==Characters== ===Main characters=== * Frankie Pamplemousse (originally named Polly Pamplemousse; voiced by Jenna Warren) is the 8-year-old owner of the Zhu Zhu pets. * Pipsqueak (voiced by Tajja Isen) is the first Zhu Zhu pet with yellow fur, and is the unofficial leader of the Zhu Zhus. She loves adventuring. Her birthmark is a shooting star because she always fires ideas in every way. * Mr. Squiggles (voiced by Richard Binsley) is the second Zhu Zhu pet with orange fur. He is smart and loves science. His birthmark is a spiral because his mind is always spinning with new ideas. * Num Nums (voiced by Stephany Seki) is the third Zhu Zhu pet with purple fur. She thinks about things before she does them, due to being a sensitive thinker. Her birthmark is a heart because she always wears it on her sleeve. * Chunk (voiced by Robert Tinkler) is the fourth and final Zhu Zhu pet with sky blue fur. He is strong, stylish, and loves to eat food. His birthmark is a sun because when he smiles, he lights up the whole room. * Jilly and Bean are two naughty twins, the one with pink fur, and the other with blue fur. They have appeared in the series. ===Recurring=== * Ellen Pamplemousse or \"Mom\" (voiced by Stacey DePass) is Frankie's mother and a professional plumber for Pamplemousse Plumbing. She used to be part of the Power Badge Girls. * Stanley Pamplemousse or \"Dad\" (voiced by Zachary Bennett) is Frankie's father and also a professional plumber for Pamplemousse Plumbing. He loves music and was previously a Wilderness Teen Ranger. Thus, he knows a lot about nature. * Wilfred P. Kerdle or Mr. Kerdle (voiced by Patrick McKenna) is the cranky janitor of Frankie's school. He tries to stop the Zhus from coming into the school and insults them. * Cindy and Mindy Gelato (voiced by Rebecca Brenner and Samantha Weinstein) are twins and Frankie's friends. * Madge (voiced by Brianna D'Aguanno) is Frankie's neighbor and worst enemy. She always tries to beat Frankie at everything. She has blue hair and brown eyes and a cat named Princess Tickyboo. * Whendy Sails (voiced by Nicole Stamp) is a celebrity and news reporter for Channel 5. * Jessica Beeker (voiced by Addison Holley) is Frankie's favorite popstar. * Dr. Phelmholz (voiced by Ron Rubin) is an Austrian doctor from Vienna. ==Episodes== ===Series overview=== ===Season 1 (2016–17)=== ===Zhu's News (2017)=== A webseries called \"Zhu's News\" was released to YTV's YouTube channel starting July 17, 2017. Each episode stars Whendy Sails of Channel 5 recapping moments in the series. ===Season 2 (2019)=== ==International broadcasts== Country Channel Year USA Disney Channel 2016-17 USA Hasbro channel and cbs 2023-2025 Canada YTV 2016 - Brazil Discovery Kids 2017 - UK Disney XD 2017-present France M6 2017 - Japan TV Tokyo 2017 - 2019 Scandinavia Disney Junior 2018 - 2021 ==Notes== ==References== ==Other websites== * * * * on Disney Channel Category:2010s American animated television series Category:American children's television series Category:American fantasy television series Category:Canadian animated television series Category:Canadian children's television series Category:Disney Channel television series Category:English-language television programs Category:2016 American television series debuts Category:2019 American television series endings Category:2016 Canadian television series debuts Category:2017 Canadian television series endings",
 "title": "The ZhuZhus"
}