{
 "id": "558840",
 "text": "The Alto Paraná department () is a department of Paraguay. The capital is the city of Ciudad del Este. Its ISO 3166-2 code is PY-10. ==Geography== The Alto Paraná department is in the central eastern part of the country, in the east of the Oriental region. It has an area of , with a population of 785,747 for a Population density of . ===Limits=== * To the north: Canindeyú Department department * To the south: Itapúa department * To the east: Brazil and Argentina * To the west: Caaguazú and Caazapá departments ===Rivers=== The main river in the department is the Paraná river. The Acaray is an important tributary of the Paraná. ===Climate=== Ciudad del Este, the capital of the department, has a humid subtropical climate that is mild with no dry season, constantly moist (year-round rainfall). (Köppen climate classification : Cfa). The average amount of rainfall for the year in the city is . The month with the most precipitation on average is January with of rainfall, followed by October with . The month with the least rainfall on average is July with an average of and the second is August with . Ciudad del Este is in a warm region; the average temperature for the year is . The warmest month, on average, is January with an average temperature of . The coolest month on average is June, with an average temperature of . ==Districts== The department is divided in 22 districts: Districts of the Alto Paraná department No. Districts Area (km²) Population (2015) Density 1 Ciudad del Este 2 Doctor Juan León Mallorquín 3 Doctor Raúl Peña 4 Domingo Martínez de Irala 5 Hernandarias 6 Iruña 7 Itakyry 8 Juan Emilio O'Leary 9 Los Cedrales 10 Mbaracayú 11 Minga Guazú 12 Minga Porá 13 Ñacunday 14 Naranjal 15 Presidente Franco 16 San Alberto 17 San Cristóbal 18 Santa Fe del Paraná 19 Santa Rita 20 Santa Rosa del Monday 21 Tavapy 22 Yguazú ==Related pages== * Departments of Paraguay * ISO 3166-2:PY ==References== ==Other websites== * Gobernación de Alto Paraná website * Statoids - Departments of Paraguay Category:Departments of Paraguay",
 "title": "Alto Paraná Department"
}