{
 "id": "559064",
 "text": "A timeline of events leading up to the American Civil War describes the events which historians recognize as contributing to the American Civil War. Many of these events lead back to the founding of the country. The United States Constitution makes only a few mentions of slavery leaving it largely up to the individual states to govern it. As the Northern and Southern United States developed along separate lines, slavery eventually disappeared from the North. It became an institution in the South. As new parts of the country opened up to settlement the issues over slavery started a long-standing controversy between North and South. It became a burning issue and led to secession of several Southern states. This in general led to the Civil War. == Timeline == === 1600s === 1619 * Colonists in the Virginia Colony buy the contracts of 20 Africans as indentured servants. 1641 * Slavery is legalized in the Massachusetts Bay Colony. 1660 * Virginia makes slavery legal. 1663 * Maryland Colony changes the law to recognize slavery for life. Before, under English law, freedom was granted to slaves who became Christians. 1667 * Virginia changes the law to recognize slavery for life. They also revoked the English law granting freedom for slaves who convert to Christianity. 1671 * About 2,000 of the 40,000 inhabitants of colonial Virginia are imported slaves. White indentured servants working for five years before their release are three times as numerous and provide much of the hard labor.William O. Blake, History of Slavery and the Slave Trade, Ancient and Modern (1861) p. 372 1688 * In February, Quakers in Pennsylvania wrote the first protest against slavery in the colonies. Called the Germantown protests they argued slavery, as it was being practiced in America, was unchristian. * === 1700s === 1712 * A New York slave insurrection caused significant property damage and resulted in severe punishment or execution of the rebels.Ferenc M. Szasz, \"The New York Slave Revolt of 1741: A Re-Examination.\" New York History (1967): 215-230 in JSTOR 1719 * Non-slaveholding farmers in Virginia think slave labor threatens their livelihoods. They persuade the Virginia General Assembly to discuss a prohibition of slavery or a ban on importing slaves. In response, the assembly raises the tariff on slaves to five pounds, which about equals the full price of an indenture, so as not to make importation of slaves as initially attractive or preferable to a mere indenture for a term of years.Dowdey, 1969, p. 274 1739 * In South Carolina, the Stono Rebellion (or Cato's Conspiracy or Cato's Rebellion) was the largest slave uprising in the British mainland colonies, with 21 whites and 44 blacks killed.Ballard C. Campbell, ed. American Disasters: 201 Calamities That Shook the Nation (2008) pp 22-23. 1741 * New York City: another insurrection of slaves causes significant property damage; slaves are severely punished or executed.Thomas J. Davis, The New York Slave Conspiracy of 1741 as Black Protest. In Journal of Negro History Vol. 56, No. 1 (Jan., 1971), pp. 17–30 in JSTOR 1774 * Quakers, led by James Pemberton, with others including Benjamin Rush, organize the first anti- slavery society in the colonies, The Pennsylvania Society for the Abolition of Slavery, in Philadelphia.James M. McPherson, Ordeal By Fire: The Civil War and Reconstruction (1982) p. 38 gives the year as 1775. 1787 * The Constitution is drafted. Provisions include counting slaves as three-fifths of a person, ending the slave trade (1808) and returning fugitive slaves to their owners. The Northwest Ordinance is passed which included the prohibiting of slavery in the territory (Article VI). * === 1800s === 1803 * Under the provisions of the Northwest Ordinance, in March 1803 Ohio becomes the seventeenth state and is a free state. 1804 * In 1804 New Jersey passes \"An Act for the Gradual Abolition of Slavery.\" Any female slaves born after July 4, 1804, would be free upon reaching 21 years of age. Any male slaves born after that date would be free at age 25. However, slave children could be placed in private homes and the state paid $3 a month for their care. They were still treated as slaves by a few who made large amounts of money from this legal loophole. 1807 * In March Congress passes law banning importing of new slaves into the United States. The law becomes effective on January 1, 1808. 1812 * On April 30, Louisiana becomes the eighteenth state. It joins the Union as a slave state. 1816 * In December Ohio becomes the nineteenth state. It joins the Union as a free state. 1817 * Mississippi becomes the twentieth state in December. It joins the Union as a slave state. 1818 * In December Illinois becomes the twenty- first state in the Union. It joins as a free state. 1819 * Alabama becomes the twenty-second state in December. It joins the Union as a slave state. 1820 * On March 3, the Missouri Compromise is passed. It was an agreement was between the pro-slavery and anti-slavery factions in the United States Congress, involving primarily the regulation of slavery in the western territories. It admitted Missouri as a slave state to please the South and it also admitted Maine as a free state to please the North. It kept the balance of power in the United States Senate between the free states and slave states. The plan also called for slavery to be banned from the Louisiana Territory north of the parallel 36 degrees 30' north (also known as the Missouri Compromise Line), except within the boundaries of the proposed state of Missouri. 1827 * Slavery is abolished in New York. 1834 * Slavery is abolished in the British Empire. 1836 * May, the House passes the first of several gag rules that automatically keep any petitions regarding slavery from being heard. In June Arkansas becomes the twenty-fifth state. Per the Missouri Compromise it joins the Union as a as a slave state.|- 1837 * In January Michigan becomes the twenty-sixth state. It joins the Union as a free state. 1844 * The House of Representatives finally repeals the gag rules concerning slavery issues on December 3. 1845 * Frederick Douglass publishes his autobiography Narrative of the Life of Frederick Douglass about his life as a slave. In March, Florida is the twenty- seventh state of the Union and joins as a slave state. In December, Texas also joins as a slave state becoming the Texas the twenty-eighth state of the Union. 1846 * In December Iowa becomes the twenty-ninth state and joins as a free state. 1848 * Wisconsin becomes the thirtieth state in the Union as a free state. 1849 * Harriet Tubman escapes slavery in Maryland. She is credited as returning numerous times bringing out over 300 slaves. * === Key events that triggered the war === 1850 * The Compromise of 1850 held off outright hostilities between North and South but did little to fix the problems. The Fugitive Slave Act of 1850 forced non-slaveowners to participate in slavery which increased tensions over the issue. 1852 * Uncle Tom's Cabin is published by Harriet Beecher Stowe. It was the second-best-selling book of the 19th century in America. In the North it opened many eyes to the horrors of slavery. In the South it was considered to be Slander. 1854 * The Kansas- Nebraska Act is passed which repeals the Compromise of 1820. It creates the territories of Kansas and Nebraska. It also allowed the states to vote on whether slavery was legal or not. 1854-1860 * Bleeding Kansas was the immediate result of the Kansas-Nebraska act. It overturned the Missouri Compromise of 1820 in that it allowed the settlers of the new territories to decide for themselves whether slavery would be allowed or not. It caused a rush of pro-slavery and anti-slavery groups into Kansas to try to influence the voting. It turned into an ugly war between groups of people who held strong opinions both for and against slavery. 1857 * Dred Scott v. Sandford was a decision by the Supreme Court of the United States. They ruled that African Americans, whether free or slaves, were not citizens of the United States. Because they were not citizens they could not sue in a Federal court. The ruling was a major setback to the anti-slavery movement. The Republicans condemned the ruling. In effect, it allowed slavery in the northern states. 1859 * John Brown's raid on Harpers Ferry occurs on October 16. Brown was captured on October 18 by United States Marines. They were led by Colonel Robert E. Lee. 1860 * November 6 - Abraham Lincoln is elected President of the United States. November 10 - Both United States Senators from South Carolina resign from the Senate. December 20 - South Carolina declares secession from the Union. 1861 * On April 12, 1861, Confederate artillery opened fire on Fort Sumter in Charleston, South Carolina. The Union garrison, under the command of Major Robert Anderson, surrendered the fort 34 hours later. This started the American Civil War. * == References == == Other websites == * Causes of the Civil War Part 1; YouTube * Causes of the Civil War Part 2; YouTube * The Dred Scott Decision; YouTube * Lincoln vs Douglas debate; YouTube",
 "title": "Timeline of events leading to the American Civil War"
}