{
 "id": "55908",
 "text": "The Aral Sea ( (Aral tengizi), , ) was a lake in Central Asia. It is between Kazakhstan in the north and Karakalpakstan, an autonomous region of Uzbekistan, in the south. Since the 1960s, the Aral Sea shrank. 90% of the sea has gone. The rivers that fed it (the Amu Darya and the Syr Darya) were used by the Soviet Union for irrigating cotton production. What is left of the Aral Sea is heavily polluted, largely as the result of weapons testing, industrial projects, and fertilizer runoff before and after the breakup of the Soviet Union.Qobil, Rustam 2015. Waiting for the sea. BBC News There is a project to save at least the northern part of the Aral Sea. For this, a dam was built in the 1990 to stop water running off. Climate improved in the following years, and water levels rose again. However, that dam broke, and was rebuilt in 2005, with international funding. Another problem was that Rebirth Island had been used for the testing of biological weapons until 1993. It is currently contaminated with anthrax, the plague, and tularemia. Since 2001, it is no longer an island, but a part of the mainland. == Gallery == File:- 1849 - 1853 Survey of the Sea of Aral by Bytakoff.jpg|Map of the Aral Sea in 1853. File:Aral sea 1985 from STS.jpg|Satellite image of the Aral Sea taken in 1985. (south at the top) File:Aral Sea 1997 from STS cropped.jpg|Satellite image of the Aral Sea taken in 1997. (south at the top) File:Karte aralsee.jpg|2004 photo of the Aral Sea (The black lines are where it was in 1850) File:Modis aral.jpg|Rebirth island (an island in the Aral Sea) joins the mainland (2000/2001) File:AralSea ComparisonApr2005-06.jpg|North Aral Sea, comparison April 2005/2006 (showing the sea has grown) File:Aral Sea.gif|Shrinking of the Aral Sea 1960-2014 File:Aral sea.gif|Aral Sea Animation 2000-2011. File:Aralsea tmo 2014231 lrg.jpg|The East Aral Sea completely dries up in 2014 File:Aral in April 2018 (Iss055e018638 lrg).jpg|The East Aral Sea is reflooded in 2018 File:Aral Sea 2021.jpg|The East Aral Sea dries up again in 2021 File:Aral Sea.jpg|A Boat on what used to be the Aral Sea File:Historic Photos of the Aral Sea, Mo‘ynoq.jpg|A Harbor off what used to be the Aral Sea ==References== ==Other websites==",
 "title": "Aral Sea"
}