{
 "id": "55907",
 "text": "Renewable energy comes from renewable resources.Resources that for all practical purposes cannot be used up: United States Department of Energy Glossary of energy-related terms (URL accessed Dec 21, 2006) It is different from fossil fuels as it does not produce as many greenhouse gases and other pollutants as fossil fuel combustion. People have used traditional wind power, hydropower, biofuel, and solar energy for many centuries, all around the world. The mass production of electricity using renewable energy sources is now becoming more common. ==Growth of renewables== From the end of 2004, worldwide renewable energy capacity grew at rates of 10–60% annually for many technologies. For wind power and many other renewable technologies, growth sped up in 2009 relative to the previous four years. More wind power was added during 2009 than any other renewable technology. However, grid-connected PV increased the fastest of all renewables technologies, with a 60% annual average growth rate. Selected renewable energy global indicatorsREN21 (2012). Renewables Global Status Report 2012 p. 17.http://www.ren21.net/Portals/0/documents/Resources/GSR/2014/GSR2014_full%20report_low%20res.pdf 2008 2009 2010 2011 2012 2013 Investment in new renewable capacity (annual) (109 USD) 130 160 211 257 244 214 Renewables power capacity (existing) (GWe) 1,140 1,230 1,320 1,360 1,470 1,560 Hydropower capacity (existing) (GWe) 885 915 945 970 990 1,000 Wind power capacity (existing) (GWe) 121 159 198 238 283 318 Solar PV capacity (grid-connected) (GWe) 16 23 40 70 100 139 Solar hot water capacity (existing) (GWth) 130 160 185 232 255 326 Ethanol production (annual) (109 litres) 67 76 86 86 83 87 Biodiesel production (annual) (109 litres) 12 17.8 18.5 21.4 22.5 26 Countries with policy targets for renewable energy use 79 89 98 118 138 144 Projections vary, but scientists have advanced a plan to power 100% of the world's energy with wind, hydroelectric, and solar power by the year 2030. == Wind power market grows == :Main articles: Wind farm and List of large wind farms. Wind power capacity has expanded quickly to 743 GW in 2020, and wind energy production was about 5% of total worldwide electricity usage, and growing fast. Wind power is widely used in European countries, and more recently in the United States and Asia.Global wind energy markets continue to boom – 2006 another record year (PDF).Global Wind Energy Council (2009). Global Wind 2008 Report , p. 9, accessed on January 4, 2010. Wind power accounts for approximately 19% of electricity generation in Denmark, 11% in Spain and Portugal, and 9% in the Republic of Ireland.International Energy Agency (2009). IEA Wind Energy: Annual Report 2008 p. 9. These are some of the largest wind farms in the world, as of January 2010: Large onshore wind farms Wind farm Current capacity (MW) Country Notes Gansu Wind Farm 8,000 Watts, Jonathan & Huang, Cecily. Winds Of Change Blow Through China As Spending On Renewable Energy Soars, The Guardian, March 19, 2012, revised on March 20, 2012. Retrieved January 4, 2012.Xinhua: Jiuquan Wind Power Base Completes First Stage, Xinhua News Agency, November 4, 2010. Retrieved from ChinaDaily.com.cn website January 3, 2013. Alta (Oak Creek-Mojave) 1,320 Terra-Gen Press Release , 17 April 2012 Jaisalmer Wind Park 1,064 Shepherds Flat Wind Farm 845 Roscoe Wind Farm 782 Horse Hollow Wind Energy Center 736 Capricorn Ridge Wind Farm 662 Fântânele- Cogealac Wind Farm 600 Fowler Ridge Wind Farm 600 Whitelee Wind Farm 539 A wind farm is a group of wind turbines in the same location used for production of electricity. A large wind farm may consist of several hundred individual wind turbines distributed over an extended area, but the land between the turbines may be used for agricultural or other purposes. A wind farm may also be located offshore. == World's largest PV power plants == Solar photovoltaic cells convert sunlight into electricity and many solar photovoltaic power stations have been built, mainly in Europe.Denis Lenardic. Large-scale photovoltaic power plants ranking 1 - 50 PVresources.com, 2010. As of December 2010, the largest photovoltaic (PV) power plants in the world are the Sarnia Photovoltaic Power Plant (Canada, 97 MW), Montalto di Castro Photovoltaic Power Station (Italy, 84.2 MW), Finsterwalde Solar Park (Germany, 80.7 MW), Rovigo Photovoltaic Power Plant (Italy, 70 MW), Olmedilla Photovoltaic Park (Spain, 60 MW), the Strasskirchen Solar Park (Germany, 54 MW), and the Lieberose Photovoltaic Park (Germany, 53 MW). Larger power stations are under construction, some proposed will have a capacity of 150 MW or more.Mark Z. Jacobson (2009). Review of Solutions to Global Warming, Air Pollution, and Energy Security p. 4. Solar is one of the fastest-growing renewable energy sources in the world. Solar energy capacity has increased by approximately 60% since 2013, rising to 485.82GW in 2018. == The ten largest solar power plants in the world (based on installed capacity in 2020) == # Tengger Desert Solar Park, China – 1,547MW # Sweihan Photovoltaic Independent Power Project, UAE – 1,177MW # Yanchi Ningxia Solar Park, China – 1,000MW # Datong Solar Power Top Runner Base, China – 1,070MW # Kurnool Ultra Mega Solar Park, India – 1,000MW # Longyangxia Dam Solar Park, China – 850MW # Enel Villanueva PV Plant, Mexico – 828MW # Kamuthi Solar Power Station, India – 648MW # Solar Star Projects, US – 579MW # Topaz Solar Farm / Desert Sunlight Solar Farm, US – 550MW Many of these plants are integrated with agriculture and some use innovative tracking systems that follow the sun's daily path across the sky to generate more electricity than conventional fixed-mounted systems. There are no fuel costs or emissions during operation of the power stations. == New generation of solar thermal plants == Large solar thermal power stations include the 354 megawatt (MW) Solar Energy Generating Systems power installation in the USA, Solnova Solar Power Station (Spain, 150 MW), Andasol solar power station (Spain, 100 MW), Nevada Solar One (USA, 64 MW), PS20 solar power tower (Spain, 20 MW), and the PS10 solar power tower (Spain, 11 MW). The 370 MW Ivanpah Solar Power Facility, located in California's Mojave Desert, is the world’s largest solar thermal power plant project currently under construction.Todd Woody. In California’s Mojave Desert, Solar-Thermal Projects Take Off Yale Environment 360, 27 October 2010. The solar thermal power industry is growing fast with 1.2 GW under construction as of April 2009 and another 13.9 GW announced globally through 2014. Spain is the epicenter of solar thermal power development with 22 projects for 1,037 MW under construction, all of which are projected to come online by the end of 2010. In the United States, 5,600 MW of solar thermal power projects have been announced. In developing countries, three World Bank projects for integrated solar thermal/combined-cycle gas- turbine power plants in Egypt, Mexico, and Morocco have been approved.REN21 (2008). Renewables 2007 Global Status Report (PDF) p. 12. ==Variable renewable energy== Variable renewable energy is a renewable energy source that is non- dispatchable due to its fluctuating nature, like wind power and solar power, as opposed to a controllable renewable energy source such as hydroelectricity, or biomass, or a relatively constant source such as geothermal power or run- of-the-river hydroelectricity. Critics of wind and solar power warn of their variable output, but many studies have shown that the grid can cope, and it is doing so in Denmark and Spain.Amory Lovins (2011). Reinventing Fire, Chelsea Green Publishing, p. 199. The International Energy Agency says that there has been too much focus on issue of the variability. Its significance depends on a range of factors which include the market penetration of the renewables concerned, the balance of plant, and the wider connectivity of the system, as well as demand side flexibility. Variability will rarely be a barrier to increased renewable energy deployment. But at high levels of market penetration it requires careful analysis and management. == Ethanol for transportation == Brazil has one of the largest renewable energy programs in the world, involving production of ethanol fuel from sugar cane, and ethanol now provides 18 percent of the country's automotive fuel. As a result, Brazil, which years ago had to import a large share of the petroleum needed for domestic consumption, recently reached complete self-sufficiency in oil. Most cars on the road today in the U.S. can run on blends of up to 10% ethanol, and motor vehicle manufacturers already produce vehicles designed to run on much higher ethanol blends. Ford, DaimlerChrysler, and General Motors Corporation are among the automobile companies that sell \"flexible-fuel\" cars, trucks, and minivans that can use gasoline and ethanol blends ranging from pure gasoline up to 85% ethanol (E85). By mid-2006, there were approximately six million E85-compatible vehicles on U.S. roads. == Related pages == * List of large wind farms * List of Solar thermal power stations * Biodiesel * Biofuel * Biomass * Carbon neutrality * Energy conservation * Energy efficiency * Energy security * Ethanol fuel * Geothermal energy * Non-renewable resource (contrary notions) * Hydroelectricity * Hydrogen economy * Photovoltaics * Renewable energy commercialization * Renewable energy in developing countries * Solar cell * Sustainable development * Sustainable energy * Tidal energy * Wave power * Wind power *The Clean Tech Revolution == Notes == == Other websites == * The Climate Change Guide easy-to-understand information on Renewable energy * US National Renewable Energy Laboratory (NREL). * Whats Biomass Energy. * EPA uses onsite renewable technologies * New World Record achieved in solar cell technology * Energy conservation at home in Simple Wikibooks * Renewables 2011: Global Status Report Category:Environment Category:Green politics",
 "title": "Renewable energy"
}