{
 "id": "559488",
 "text": "Mitchell Lee \"Mitch\" Hedberg (February 24, 1968 – March 30, 2005) was an American stand-up comedian, actor, and comedian. He was born and raised in St. Paul, Minnesota. Hedberg's trademark was his hippie look and his relaxed unconventional comedic delivery. == Career == Hedberg began his stand-up career in Florida. He later moved to Seattle and began to tour. He soon appeared on MTV's Comikaze. This was followed by a 1996 appearance on the Late Show with David Letterman that brought him his big break. He won the 1997 grand prize at the Seattle Comedy Competition. The next year he appeared in an episode of Fox's series That '70s Show. In 1999, he completed his own independent feature movie, Los Enchiladas!. He was the star, writer, director and producer. He recorded three comedy CDs: Strategic Grill Locations, Mitch All Together, and Do You Believe in Gosh?. The last was released posthumously. He also appeared at the Montreal Just for Laughs comedy festival in 1996, and again in 1998 and 2001. At the same time as his rising fame in the entertainment industry, Hedberg appeared on Letterman nine more times. He signed a half-million dollar deal with Fox for a television sitcom. Hedberg was supposed to be the next Jerry Seinfeld. George Carlin, Dave Chappelle, Mike Birbiglia and Lewis Black were reportedly among his comedian fans. == Discography == * Strategic Grill Locations (1999) (Originally self-published, later re-released on the Comedy Central label, edited) * Mitch All Together (November 18, 2003) * Do You Believe in Gosh? (September 9, 2008) == Filmography == Year Title Role 1999 Los Enchiladas! Lee 2000 Almost Famous Eagles Road Manager 2005 Lords of Dogtown Frank Nasworthy (Urethane Wheels Guy) == TV appearances == Year Title Role/Info 1998 That '70s Show Episode 11, as Frank (Chef at the Hub) Premium Blend Episode dated May 23, 1998 as Himself Late Show with David Letterman Himself (2 episodes) 1999 Dr. Katz, Professional Therapist Episode 67 \"Past Lives\" and Episode 73 \"Garden\", both as Himself Comedy Central Presents Himself Late Show with David Letterman Himself (2 episodes) Home Movies Episodes 104 and 105 as The Pet Eulogist and Mitch, respectively 2000 Late Show with David Letterman Himself 2001 Ed Episode 110 as Dave Just for Laughs in Montreal Himself Late Friday Himself Home Movies Episodes 112 and 113 as Cop and Dr. Fizzel (Anger Management Counselor), respectively Late Show with David Letterman Himself (2 episodes) 2002 Saddle Rash Various voices Late Show with David Letterman Himself 2003 Late Show with David Letterman Himself Late Night with Conan O'Brien Himself Crank Yankers Himself 2004 Shorties Watchin' Shorties Episodes 4 and 9 as Himself Late Night with Conan O'Brien Himself ==References== ==Other websites== * Category:1968 births Category:Actors from Minnesota Category:Comedians from Minnesota Category:American stand-up comedians Category:Living people",
 "title": "Mitch Hedberg"
}