{
 "id": "559688",
 "text": "Eva Vik (born Eva Doležalová May 5, 1991) is a Czech filmmaker, film director, screenwriter, and producer, represented by Ridley Scott Creative Group worldwide. She is known for films such as Serpentine (2023), Raven (2022) and Carte Blanche (2019). She has been recognised with numerous film awards for her rapidly rising career including the Breakout Director's Award at the Hollywood Film Festival, the Audience Award and the Best Genre Award at the Mammoth Film Festival, and the Best Director at ISA. She was also awarded at Centre Pompidou for her Transformational Trilogy Sounds of Sun, Somnio, Samice in 2019. Moreover, her most recent film Serpentine(2023) has also been nominated for the X award at the Tribeca Film Festival. In 2021, Forbes magazine had also ranked Eva Vik among the 30 most influential people under 30. ==Early life and education== At the age of 10, she began to take an interest in the world of cinema and theatre by taking part in local film productions and theatre plays where she had the opportunity to have roles and a first introduction to scriptwriting. These experiences then led her, at the age of 18, to enroll at the Royal Academy of Dramatic Art in London, allowing her to subsequently land roles in productions, some of which were directed by Shane Black or Mike Figgis. She then moved to Paris. Eva Vik is a polyglot, she speaks English, French, Czech, Italian, and Polish. ==Career== In 2017, Eva Vik moved to Los Angeles to pursue a career as a screenwriter and director and made her first short film called Sound of Sun starring Sean Penn and Suki Waterhouse. Several other short films followed, including: Carte Blanche with Dylan Sprouse, Suki Waterhouse, and Jack Kilmer who won the Audience Award at the Mammoth Film Festival in 2019 and a Breakout Director Award at the Hollywood Film Festival in 2020. And Maestro, with Clara McGregor and Karel Dobrý, which awarded her the Best Director Award and the Grand Jury Prize at the Independent Shorts Awards in 2021. In 2022 and 2023, Eva Vik wrote and directed two science fiction works: Serpentine featuring Barbara Palvin, Luke Brandon Field, and Soo Joo Park, which earned her a Premiere screening at the Tribeca Festival, a nomination for the Tribeca X Award and the award for best genre short film at the Mammoth Film Festival. And Raven, released by Vogue magazine which was awarded at the HollyShorts Oscar-Qualifying Film Festival in 2022.https://www.vogue.cz/clanek/vogue-daily/filmy/tym-vogue/raven- premiera-noveho-snimku-evy-vik-exkluzivne-na-vogue-cs Eva Vik directed two projects in collaboration with Bulgari, Serpentine, a short film starring Barbara Palvin, and a Bulgari Omnia campaign starring Cailee Spaeny who was awarded the Volpi Cup at the Venice Film Festival (2023). ==Personal life== Eva Vik announced, in an interview with LA Weekly in 2023, she declared that she would henceforth carry the maiden name, Vik, honoring her maternal grandmother. She expressed her intention to move away from the patronymic tradition, choosing instead to adopt the surname of a strong, self-made woman who had profoundly influenced her life. Eva Vik is also, apart from her film activity, a philanthropist, committed to the protection of women and children who are victims of domestic violence all over the world through the White Ribbon Campaign. ==Filmography== ===As a Screenwriter=== Year Title 2016 Sound of Sun 2017 Somnio 2018 Good Looking by Suki Waterhouse 2018 Les Inconnus: Escape 2019 Butcher Boy 2019 Carte Blanche 2019 Samice 2020 Maestro 2021 Anima Us 2022 Raven 2022 Oblivion 2022 Fletcher: Better Version 2022 Broken 2023 Serpentine 2023 Bulgari Omnia ===As Producer=== Year Title 2016 Sound of Sun 2017 Somnio 2018 Good Looking by Suki Waterhouse 2018 Les Inconnus: Escape 2019 Butcher Boy 2019 Carte Blanche 2019 Samice 2020 Maestro 2021 Anima Us 2022 Raven 2022 Oblivion 2022 Fletcher: Better Version 2022 Broken 2023 Serpentine 2023 Bulgari Omnia ===As Director=== Year Title 2016 Sound of Sun 2017 Somnio 2018 Good Looking by Suki Waterhouse 2018 Les Inconnus: Escape 2019 Butcher Boy 2019 Carte Blanche 2019 Samice 2020 Maestro 2021 Anima Us 2022 Raven 2022 Oblivion 2022 Fletcher: Better Version 2022 Broken 2023 Serpentine 2023 Bulgari Omnia ==References== ==Other websites== * Category:1991 births Category:Living people Category:Czech movie directors Category:Screenwriters Category:Czech movie actors Category:Czech stage actors Category:Movie producers",
 "title": "Eva Vik"
}