{
 "id": "559745",
 "text": "The 2013 World Junior A Challenge was an international Junior \"A\" ice hockey tournament organized by Hockey Canada. It was hosted in Yarmouth, Nova Scotia, from November 4–10, 2013, at the Mariners Centre. The event included the 9th annual Canadian Junior Hockey League Prospects Game Challenge, marking the third time the two events have been paired together. ==Teams== * Canada East (8th Appearance, 3rd as Hosts) * Canada West (8th Appearance) * Russia (8th Appearance) * Switzerland (3rd Appearance) * United States (7th Appearance) * Czech Republic (3rd Appearance) ==Background== Canada East, Canada West, Russia, United States, Switzerland, and Czech Republic all return. ==Exhibition schedule== {| cellpadding=\"1\" width=\"750px\" style=\"font-size: 90%; border: 1px solid gray;\" Exhibition Results Exhibition Results Exhibition Results Exhibition Results Exhibition Results Game Away Team Score Home Team Score Notes Date – Time – Location Ex1 United States 4 Canada West 3 Final - Shots: 33-26 USA 02/11/13 - 19:00 AST - Digby, NS Ex2 Czech Republic 3 Canada East 2 Final - Shots: 40-30 CANE 02/11/13 - 19:00 AST - Barrington, NS ==2013 Tournament== ===Group A=== {| cellpadding=\"1\" width=\"400px\" style=\"font-size: 90%; border: 1px solid gray;\" Pool A Standings Pool A Standings Pool A Standings Pool A Standings Pool A Standings Rank Team W-L-OTL GF GA 1 United States 2-0-0 12 5 2 Russia 1-1-0 9 10 3 Canada East 0-2-0 4 10 ===Group B=== {| cellpadding=\"1\" width=\"400px\" style=\"font-size: 90%; border: 1px solid gray;\" Pool B Standings Pool B Standings Pool B Standings Pool B Standings Pool B Standings Rank Team W-L-OTL GF GA 1 Canada West 2-0-0 8 4 2 Switzerland 1-1-0 5 4 3 Czech Republic 0-2-0 1 6 ===Results=== {| cellpadding=\"1\" width=\"750px\" style=\"font-size: 90%; border: 1px solid gray;\" Round Robin Results Round Robin Results Round Robin Results Round Robin Results Round Robin Results Game Pool Away Team Score Home Team Score Notes Date – Time – Location 1 B Canada West 4 Switzerland 3 Final - Shots: 42-34 CANW 04/11/13 - 16:00 AST - Yarmouth, NS 2 A Canada East 2 Russia 6 Final - Shots: 40-30 RUS 04/11/13 - 20:00 AST - Yarmouth, NS 3 B Czech Republic 1 Canada West 4 Final - Shots: 33-30 CANW 05/11/13 - 16:00 AST - Yarmouth, NS 4 A Russia 3 United States 8 Final - Shots: 41-25 USA 05/11/13 - 20:00 AST - Yarmouth, NS 5 B Switzerland 2 Czech Republic 0 Final - Shots: 42-23 CZE 06/11/13 - 16:00 AST - Yarmouth, NS 6 A United States 4 Canada East 2 Final - Shots: 28-25 USA 06/11/13 - 20:00 AST - Yarmouth, NS ===Championship Round=== {| cellpadding=\"1\" width=\"750px\" style=\"font-size: 90%; border: 1px solid gray;\" Championship Results Championship Results Championship Results Championship Results Championship Results Game Away Team Score Home Team Score Notes Date – Time – Location QF1 Czech Republic 1 Russia 3 Final - Shots: 42-31 CZE 07/11/13 - 16:00 AST - Yarmouth, NS QF2 Canada East 4 Switzerland 5 OT Final - Shots: 42-29 CANE 07/11/13 - 20:00 AST - Yarmouth, NS SF1 Russia 5 Canada West 2 Final - Shots: 33-27 RUS 08/11/13 - 16:00 AST - Yarmouth, NS SF2 Switzerland 4 United States 7 Final - Shots: 37-19 USA 08/11/13 - 20:00 AST - Yarmouth, NS 5th Czech Republic 7 Canada East 5 Final - Shots: 40-32 CZE 09/11/13 - 19:00 AST - Liverpool, NS Bronze Switzerland 3 Canada West 5 Final - Shots: 38-24 CANW 09/11/13 - 20:00 AST - Yarmouth, NS Gold Russia 1 United States 4 Final - Shots: 29-17 USA 10/11/13 - 12:00 AST - Yarmouth, NS ===Final standings=== Team West 4th 5th 6th East ==Statistics== ===Scorers=== {| cellpadding=\"1\" width=\"325px\" style=\"font-size: 90%; border: 1px solid gray;\" Scoring Leaders Scoring Leaders Scoring Leaders Scoring Leaders Scoring Leaders Player Team GP G A P PIM Nick Schmaltz USA 4 4 8 12 0 Connor Hurley USA 4 3 7 10 0 Kirill Pilipenko RUS 5 4 4 8 2 Dylan Hoffman CANW 4 4 3 7 0 Vladislav Kamenev RUS 5 1 6 7 26 Marty Quince CANE 4 4 2 6 4 Adam Zboril CZE 4 2 4 6 18 Karson Kuhlman USA 4 4 1 5 0 Nicholas Jones CANW 4 3 2 5 2 Daniil Vovchenko RUS 5 3 2 5 9 ===Goaltenders=== {| cellpadding=\"1\" width=\"450px\" style=\"font-size: 90%; border: 1px solid gray;\" Goalie Leaders Goalie Leaders Goalie Leaders Goalie Leaders Goalie Leaders Player Team GP Mins GA SO GAA Sv% Record Karel Vejmelka CZE 2 120:00 4 0 2.00 0.925 0-2 Chris Birdsall USA 1 60:00 2 0 2.00 0.923 1-0 Maxim Mauerhofer SUI 3 183:54 11 1 3.59 0.909 2-1 Maxim Tretiak RUS 5 276:23 14 0 3.04 0.906 3-2 Jesse Jenks CANW 4 240:00 12 0 3.00 0.901 3-1 ==Awards== :Most Valuable Player: Nick Schmaltz All-Star Team :Forwards: Nick Schmaltz, Connor Hurley, Kirill Pilipenko :Defense: Neal Pionk, Adam Plant :Goalie: Maxim Tretiak ==CJHL Prospects Game== For the third consecutive year, the Canadian Junior Hockey League Prospects Game was a part of the WJAC festivities. Just like the previous four Prospects Games, the event was actually two \"prospect\" games with the President's Cup going to the winning goal aggregate. Prospects East won their fourth President's Cup in nine years with an 8-4 aggregate victory (4-2, 4-2) over Prospects West. ===Results=== {| cellpadding=\"1\" width=\"750px\" style=\"font-size: 90%; border: 1px solid gray;\" Exhibition Results Exhibition Results Exhibition Results Exhibition Results Exhibition Results Game Away Team Score Home Team Score Notes Date – Time – Location 1 Prospects East 4 Prospects West 2 Final - Shots: 42-20 West 08/11/13 - 19:00 AST - Digby, NS 2 Prospects East 4 Prospects West 2 Final - Shots: 38-25 West 09/11/13 - 16:00 AST - Yarmouth, NS ==Other websites== *HC's WJAC Website World Junior A Challenge",
 "title": "2013 World Junior A Challenge"
}