{
 "id": "559750",
 "text": "The 2013–14 National League A season is the seventh ice hockey season of Switzerland's top hockey league, the National League A. Overall, it is the 76th season of Swiss professional hockey. It was won by ZSC Lions after beating Kloten Flyers 4-0 in the play offs. ==Regular season== ===Teams=== After the 2012–13 season, SCL Tigers were defeated by Lausanne HC of National League B, switching places with them. The number of teams stands at 12. Team City Arena Capacity HC Ambrì-Piotta Ambrì Valascia 7,000 SC Bern Bern PostFinance-Arena 17,131 EHC Biel Biel/Bienne Eisstadion Biel 7,000 HC Davos Davos Vaillant Arena 7,280 HC Fribourg-Gottéron Fribourg BCF Arena 6,800 Genève-Servette HC Geneva Patinoire des Vernets 7,382 Kloten Flyers Kloten Kolping Arena 7,719 Lausanne HC Lausanne CIG de Malley 9,244 HC Lugano Lugano Pista La Resega 8,250 Rapperswil-Jona Lakers Rapperswil Diners Club Arena 6,200 EV Zug Zug Bossard Arena 7,015 ZSC Lions Zurich Hallenstadion 11,200 ==Regular season== Rank Team GP W L OTW OTL SOW SOL Goals Diff. Pts 1 ZSC Lions 50 32 9 1 2 0 6 167:111 56 106 2 Fribourg-Gottéron 50 25 18 2 0 2 3 151:147 4 86 3 Kloten Flyers 50 22 18 4 1 5 0 147:121 26 85 4 Genève-Servette HC 50 21 16 2 5 5 1 158:133 25 83 5 HC Lugano 50 23 18 2 3 3 1 142:114 28 83 6 HC Davos 50 22 20 1 1 5 1 151:133 18 80 7 HC Ambrì-Piotta 50 22 20 1 1 3 3 126:123 3 78 8 Lausanne HC 50 20 20 2 3 2 3 104:115 -11 74 9 SC Bern 50 19 22 3 3 1 2 126:129 -3 70 10 EV Zug 50 15 20 5 2 1 7 132:156 -24 66 11 EHC Biel 50 11 29 1 1 6 2 115:154 -39 50 12 Rapperswil-Jona Lakers 50 9 31 1 3 1 5 117:200 -83 39 ==Playoffs== ==Relegation round== Six games were played as part of the relegation round. Results from the regular season carried over. Rank Team GP W L OTW OTL SOW SOL Goals Diff. Pts 1 SC Bern 56 22 25 3 3 1 2 147:148 –1 79 2 EV Zug 56 19 22 5 2 1 7 152:175 –23 78 3 EHC Biel 56 13 33 1 1 6 2 130:168 –38 56 4 Rapperswil-Jona Lakers 56 12 34 1 3 1 5 136:223 –87 48 ===Final=== The bottom two teams played in the final. *EHC Biel - Rapperswil-Jona Lakers 2:4 (3:2 OT, 1:3, 2:3, 4:3 OT, 1:4, 4:5) ==Playouts== The bottom team from the relegation round, EHC Biel, played against HC Viège, the National League B champion, for the right to play in the 2014-15 NLA season. *EHC Biel - EHC Visp 4:1 (5:2, 2:5, 5:1, 4:1, 3:2) ==Other websites== *Official League Website *Official League Website Category:2013 in ice hockey Category:2014 in ice hockey",
 "title": "2013–14 NLA season"
}