{
 "id": "559971",
 "text": "MaX: Madrid_Linux is an operating system of the Ministry of Education and Employment of the Community of Madrid, specially adapted for using it in primary and secondary schools, due to its simplicity, robustness and included data collection software. Even the second version was based on Knoppix, a distribution based on Debian GNU/Linux. The current version of MaX (MaX 12, is based on Ubuntu 20.04.4 LTS) is specially designed for using it in the educational environment as a system for teacher or student. However, it can also be used by the users of personal computers. In addition, it comes ready to be installed and used, and is equipped with multimedia and variety of programs on three desktops: GNOME, KDE and Xfce. In any case, it can be fully used in \"live\" mode, that is to say, directly from the DVD without having it installed on the hard disk. Its explicit objectives are: *Promote the use of open technological sources in educational environment. *Provide schools, and generally members of the educational community, with software that contributes to their integration into the knowledge-based society. *Provide high-quality applications with educational interest and no additional costs for students and teachers. *Have an open source environment where training and investigation processes are used. == Installation and users == The installation disc is a DVD that can be used en vivo (live) before installing MaX on the hard disk, that is to say, from the DVD drive. Besides, even if the opposite is claimed, these programs can be installed if the computer has the access to the Internet, so that you can test the applications that do not come installed on the live system. There is yet another way to use live MaX version installed accessibility. In the guide mentioned before installation you can find a lot of useful information about the facilities. On the other hand, the installation for desktop MaX is even easier than Ubuntu, because a username is needed. All versions of MaX always have two users incorporated: student and Madrid. The first is intended, of course, for students, and has fewer privileges on the system that the user Madrid has, but this is not the root user or system administrator. In short, when entering the Madrid system,the user has to type his or her username and cmadrid (the letter ce + madrid) and password. This has always been so in MaX, but you can change passwords once inside the system, and can also create new users, for those who have to choose the privileges they have. What I have done from the beginning was to stay as the user madrid, and whenever you need to get access as an administrator, click cmadrid password, which is also the root. == The desktop == MaX desktop is highlighted with a bright blue background and a rounded image resembling the terrestrial sphere. (of course, this is MaX 3.0, not the latest version.) This is the GNOME desktop, which MaX used as principal, but you can login with the other two desktops: KDE and XFace. This requires logout (not restart) and re-enter after choosing another desk in the Session menu, which is done in seconds; but the three desks maintain the same background and the panel bar at the bottom of the screen. In addition, programs are the same in all three desks, with some changes that depend on the chosen desktop. Actually, it could be using a desk with other programs. == Programs == The programs that MaX Linux 3.0 contains are distributed as follows: PROGRAMAS (PROGRAMS) Geografía (Geography) Infantil-Primaria (Childish and Primary education) Programación (Programming) Audio (Audio) GPS (GPS) Internet (Internet) Redes (Networks) Aula virtual (Virtual classroom) Gráficos (graphics) Juegos (Games) Robótica (Robotics) Ciencias (Sciences) Herramientas de autor (Author's tools) Lengua (Language) Sistemas (Systems) Diseño y publicación web (Web design and publishing) Idiomas (Languages) Matemáticas (mathematics) Streaming (Streaming) Electrónica (Electronics) Imagen-Fotografía (Image-Photography) Música (Music) Vídeo (Video) Empresa (Company) impresión 3D (3D printing) Pizarras digitales (Digital Blackboards) Selecciones (selections) == References == *Educamadrid Homepage *MaX 3.0,el Linux de Madrid == Other websites == *Images of MaX Linux desktop Category:Operating systems Category:Community of Madrid",
 "title": "MAX Linux"
}