{
 "id": "560018",
 "text": "Gertrude Margaret Lowthian Bell CBE (14 July 1868 – 12 July 1926) was a British archaeologist, traveller, and diplomat. She explored and mapped countries in the Middle East. She influenced British imperial policy-making with her knowledge and contacts. Bell travelled mainly in Greater Syria, Mesopotamia, Asia Minor, and Arabia. == Early life == Gertrude's father was Hugh Bell (later Sir Hugh Bell, 2nd Baronet). Gertrude Bell was the oldest of her father's five children, and his only daughter. Gertrude's mother was Bell's first wife, Mary. Theirs was a rich family. Hugh Bell worked in the iron industry, and his own father had been the industrialist Sir Isaac Lowthian Bell, 1st Baronet. Gertrude Bell grew up at Red Barns, her father] house near Redcar in County Durham. Gertrude's mother, Mary Bell, died in 1871, after she gave birth to her son Maurice. Mary's death made Gertrude unhappy but also made her more independent. She had a close connection with her father. He married Gertrude's step-mother Florence Olliffe in 1876, and together they had Gertrude's three step-siblings: Hugh Lowthian; Florence Elsa; and Mary Katharine. Gertrude was very good at all kinds of things: she was good at sport, she was good at school, and she was funny and clever in conversation. Her school was Queen's College, London. In April 1886, Bell started studying at Lady Margaret Hall (a college of the University of Oxford). She studied for seven hours every day and did all kinds of sports. She was friends with Janet E. Courtney (then Janet Hogarth) and Edith Langridge. Bell graduated in 1888, with a first-class bachelor's degree in Modern History. After this she went on a tour of Europe. Bell was in Bucharest in 1888 and 1889, where she lived with Frank Lascelles: he was the brother-in- law of Bell's stepmother Florence. Lascelles was the British diplomatic representative in the Kingdom of Romania. There Bell met Valentine Chirol, the journalist for The Times in the area. Through Chirol, Bell met Charles Hardinge and started to learn about diplomacy between the Great Powers. Bell returned to Britain in 1899, after first going to Constantinople. For three years she did charity work and was part of the London \"season\" in the summers. == References == * Gertrude Bell (1919) [1907]. The desert and the sown: travels in Palestine and Syria. London: Heinemann. Category:19th-century English writers Category:20th-century English writers",
 "title": "Gertrude Bell"
}