{
 "id": "560051",
 "text": "Secession in the United States refers mainly to state secession. It applies to the outbreak of the American Civil War when on December 20, 1860, South Carolina officially declared their secession from the United States. It was followed four months later by the states of Georgia, Florida, Alabama, Mississippi, Texas and Louisiana. These initial seven seceding states formed the Confederate States of America based in Montgomery, Alabama. Then, on April 12, 1861, hostilities began at Fort Sumter in Charleston, South Carolina. After this, the states of Virginia (except the northwestern counties), Arkansas, Tennessee, and North Carolina joined the Confederacy. The capital was then moved Richmond, Virginia. The Northern and Border states remained with the Union. ==History== In 1860, secession was not a new threat. It had been discussed as early as 1776 when the Continental Congress wanted to tax all of the colonies based on a population count that included slaves. South Carolina threatened to separate themselves from the other 12 colonies over the issue. From then until the outbreak of the American Civil War, anytime a minority sectional dispute came up (often over slavery) the threat of secession would be used. It was a matter of concern when the Constitutional Convention met in 1787 in Philadelphia. Secession was closely tied to the thinking of members of the Whig party. Their thinking was that rebellion (such as in 1776) was a right of a state against any form of despotic government. When the South seceded in 1860-61, one argument was that in 1776, when the thirteen Colonies rebelled against Great Britain, it was a secession. Others argued the two situations were very different. The thirteen colonies revolted against Great Britain, they did not secede from it. What resulted was the American Revolutionary War. It can also be argued that the Southern states were revolting against the Union. Each of the colonies was regarding itself as a sovereign state and was waging a war of independence in cooperation with twelve other sovereign nations. == Reasons for secession == Following the war, scholars disagreed on what caused the Civil War. The disagreements still go on today. Many said that slavery was the main cause of the war. The Southern states wanted to continue it while the Northern states wanted to stop it. Others say slavery was not the main issue. They point to states' rights and taxation as leading causes. Each state that seceded wrote an \"Article of Secession\" formally declaring they were leaving the Union. Four states, Texas, Mississippi, Georgia and South Carolina, added a \"Declarations of Causes.\" These were written to explain the reasons for leaving in more detail. === Georgia === Georgia gave the following reasons why they were dissolving their connections to the United States. These included: * The Federal government has weakened Georgia's security, disturbed their peace and tranquility and refused to honor their Constitutional right to their property—African slaves. * The U.S. prevented Georgia from an \"equal enjoyment of the common Territories of the Republic\".\" The Missouri Compromise was overturned by the Compromise of 1850 further limiting slavery in the new territories. * The U.S. has been hostile towards the people of Georgia. Georgia has remained attached to the Union out of habit and a sense of tradition. They hoped time would change this hostility towards George held by the non-slave states, but it has not changed. * The \"party of Lincoln\" calling itself the Republican Party is corrupt and admittedly anti-slavery. === Mississippi === In their declaration of causes, Mississippi wrote that slavery was necessary for their commerce. They added, only the black man can work in our hot climate. The North gives us only two choice: either abolishing slavery and suffering complete ruin or seceding from the Union. Included in their reasons were: * The United States denies our right of property in slaves. It refuses protection of that right wherever the U.S. government has jurisdiction. * It has not enforced the Fugitive Slave Act of 1850 in free states which they agreed to do. * It wants social and political equality for the negro and promotes Slave rebellions. * Using its schools, newspapers and the pulpit, the North is completely against us. * It wants to destroy slavery without offering anything to replace it. * It has broken every contract with us and seeks to destroy our society. === South Carolina === South Carolina gave its reasons for seceding in its Declaration of Immediate Causes which was adopted on 24 December 1860. The reasons included: * The Federal government has repeatedly violated the United States Constitution by not respecting the states' rights reserved by the state of South Carolina. South Carolina has overlooked this in the past out of respect for the wishes of the other slaveholding states. But it cannot do this any longer. * The Charleston Mercury said, \"The tea has been thrown overboard, the revolution of 1860 has been initiated,” when president Lincoln was elected. * Lincoln didn’t win in many of the southern states and in some of the states he wasn’t added onto the ballot this caused an uproar in most southern states. * In 1776 the thirteen colonies declared their right to self-government. Where the interests of two people are different, each must be able to govern itself or it cannot be free. The Southern states are now in the same position as the thirteen colonies were towards Great Britain. The U.S. government has become a despotic government much the same as Great Britain had become. The people of the Southern states find it necessary to throw off that power and assume their own freedom. * The Southern states are a minority in the United States Congress and are taxed unfairly. The taxes are not designed to create revenue for the U.S. government. They are for the benefit of Northern manufacturing and mining. The majority of taxes collected in the South are spent in the North. * The foreign commerce of the United States is based on Southern agriculture. But Southern cities are not allowed to conduct foreign trade. In 1740 there were five shipyards in South Carolina to carry on trade with Europe. Now trade is conducted only from Northern ports. * The United States government has become the same kind of government with limitless powers that was overthrown in the Revolutionary war. They seek to have power over every institution in the country including slavery. * The United States Constitution was an experiment that has failed. The Southern states have followed the Constitution while the Northern states have subverted it for their own benefit. The constitutional guarantees no longer exist and the states no longer have equal rights. The federal government has become the enemy of slaveholding states and they will no longer have the power of self-rule or self-protection. * They thought they had the privilege to have their slaves. * The first act of violence between the confederate states and the union states was at Fort Sumter in South Carolina. === Texas === Texas became a state on December 29, 1845 with the assurances of becoming an equal state in the Union and was accepted with her own constitution. That constitution protected and maintained the institution known as slavery. Texas gave up a being a sovereign country to join the United States to promote the welfare, security and liberty of her people. Her declaration of causes included: * The federal government seeks to destroy slavery in both Texas and other slaveholding states. This disloyalty by the Northern states has permitted outlaws in the state of Kansas to trample on federal laws and subvert slavery. * By the use of violence and mob law the Northern states intend to trample on the rights of Southern citizens. * The federal government has failed to protect the people and property of the state of Texas by allowing Indian savages on our border. More recently, they have allowed Mexican bandits to raid into Texas. The state has had to bear the costs of protecting its citizens with no reimbursement from the federal government. * Texas is no longer as safe as it was when it was the Republic of Texas. == Related pages == *Timeline of events leading to the American Civil War *Border states (American Civil War) *51st state *League of the South *Ordinance of Secession *Second Vermont Republic *Southern nationalism *Submissionist == References == == Other websites == * Category:Origins of the American Civil War",
 "title": "Secession in the United States"
}