{
 "id": "560010",
 "text": "The Kingdom of Galicia (; ; ; ) was a political entity (a state) in southwestern Europe, in a region that today includes parts of northern Portugal and northwestern Spain. == History == Galicia was first part of the Roman province of Gallaecia and it became a kingdom under the Germanic Suebi in the 5th century, and later, from 585 to 711, it was integrated into the Kingdom of the Visigoths. In the 8th century Galicia became a part of the newly founded Christian kingdoms of the northwest of the peninsula, sometimes called Galicia or derivates,Many ancient and medieval documents consistently refer to the region as Gallaecia or its derivatives such as Gallizia, Gallitia, Galizuland, Yilliqiyya, Jalikia, etc. but translated into \"Asturias\" or \"Leon\", as explained in Kingdom of Galicia in historiography. and others Asturias and León. Sometimes it got independence under its own kings. Rulers were titled as \"Kings of Galicia\" even when they governed from cities like Oviedo or León. This has led to significant historiographical controversy.As a result, the legacy of the Kingdom of Galicia and its rulers is often contested in academic circles. Compostela became the capital of Galicia in the 11th century. The independence of Portugal (1128) made its southern boundary. The accession of the Castilian King Ferdinand III to the Leonese kingdom in 1230 brought Galicia under the control of the Crown of Castile. The kingdom of Galicia was now a political division in the larger realm, but it continued to maintain a distinct cultural identity. == Related pages == *Galicia (Spain) *Galician language *Galician-Portuguese *Kingdom of Galicia in historiography *Umayyad conquest of Hispania *Kingdom of Portugal == References == == Other websites == * Culture and Society in Medieval Galicia. A Cultural Crossroads at the Edge of Europe James D'Emilio. University of South Florida Category:Former monarchies of Europe Category:5th-century establishments in Europe Category:400s establishments Category:1230s disestablishments Category:Disestablishments in Europe Category:1150s disestablishments Category:14th-century disestablishments in Europe Category:10th-century establishments in Europe Category:Establishments in Portugal Category:1830s disestablishments Category:19th-century disestablishments in Europe Category:Disestablishments in Spain Category:910s establishments",
 "title": "Kingdom of Galicia"
}