{
 "id": "56003",
 "text": "Biological warfare (or germ warfare) is when pathogens are used as a weapon. This is called a biological weapon. Pathogens are microorganisms that can cause disease. If non-living things (like toxins) are used, this is called chemical warfare. Biological warfare has been used throughout history. The first form of biological warfare may have been when the plague hit the Mongols. During battle, they were said to have thrown plague victims' bodies at their enemies. Before the 20th century, it took some of the following forms: *Deliberate poisoning of food or water supplies with infectious materials *Use of microorganisms, living or dead animals in a weapon system. *Use of fabrics that are contaminated During the Second Sino-Japanese War, biological weapons were used by the Japanese army against China. The Japanese army usually launched contaminated fleas or food from planes. Today, pathogens for diseases like anthrax or smallpox could be used as agents for biological weapons. The production, and stockpiling of such weapons was forbidden in the Biological Weapons Convention of 1972. Validated BW threat agents include the following: Anthrax, Bioregulators, Botulinal toxins, Brucellosis, Cholera, Clostridium perfringens,Encephalomyelitis viruses, Glanders, Hemorrhagic Fever viruses, Mycotoxins, Neurotoxins, Staphylococcal Enterotoxin B (SEB), Plague, Q-fever, Ricin, Shigella, Smallpox, Tularemia, and Typhus. There are also required characteristics of biological agents. These requirements are consistently producing a given result; being manufacturable on a large scale; being stable during production, storage, and transportation; being capable of efficient dissemination; being stable after dissemination. It is desirable to be possible to use forces to protect against it yet difficult for enemies to protect against or detect. Short and consistent incubation periods are also ideal, though not necessary. category:war category:Biology",
 "title": "Biological warfare"
}