{
 "id": "56021",
 "text": "A school bus is a type of bus that takes students to their school. They may pick kids up in front of their house or at a dedicated bus stop. In many areas, passing a stopped school bus is punishable by a traffic ticket. ==Characteristics== In the United States, school buses are yellow while in other countries they may be different. The 3 lines or rub rails on the outside of a school bus in the United States have a purpose for safety in the event of an accident. The bottom line shows where the bus floor is. The middle line shows the bottom of the seat. The top line shows where the top of the seat is as well as the bottom of the window. School buses are also equipped with more than one emergency exit. These could be on the side of the bus, the top, or the back. Each of these is for if the bus rolls one of these sides during an accident. When opened they also will make a loud alarm sound. == Types == === Type A === A Type “A” school bus is a conversion or body constructed upon a van-type or cutaway front-section vehicle with a left side driver’s door, designed for carrying more than 10 persons. Sixteen designed seating capacity or less may be single rear wheeled; 17 designed seating capacity and larger shall have dual rear wheels. This definition shall include two classifications: Type A-1, with a Gross Vehicle Weight Rating (GVWR) less than 14,500 pounds; and Type A-2 with a GVWR greater than 14,500 pounds and less than 21,500 pounds. === Type B === A Type “B” school bus is constructed utilizing a body on a stripped chassis, with the entrance door behind the front wheels. This definition includes two classifications: Type B-1, with a GVWR of 10,000 pounds or less, designed for carrying more than 10 persons and Type B-2, with a GVWR greater than 10,000 pounds. The engine is beneath and/or behind the windshield and beside the driver’s seat. Both Type B-1 and Type B-2 must be equipped with dual rear tires. === Type C === A Type “C” school bus is constructed utilizing a chassis with a hood and front fender assembly. The entrance door is behind the front wheels. A “type C school bus” also includes a cutaway truck chassis or truck chassis with cab, with or without a left side door, and with a GVWR greater than 21,500 pounds. === Type D === A Type “D” or “Transit Style” school bus is a body installed upon a stripped chassis, with the engine mounted in the front or rear, and has a GVWR of more than 21,500 pounds, designed for carrying more than 10 persons. The engine may be beside the driver’s seat or it may be at the rear of the bus, behind the rear wheels. The entrance door is ahead of the front wheels. == Gallery == File:2008-07-04 NCSSM Activity Bus 1.jpg|Blue Bird Mini Bird Type B school bus File:Blue Bird TC3000.jpg|Blue Bird TC3000 school bus File:Baconton Community Charter School bus.JPG|Ford Econoline school bus File:Ford Transit 350 HD School Bus by Trans Tech 5.17.18.jpg|Ford Transit school bus File:Arlington CSD -793 (41010139375).jpg|Chevrolet Suburban acting as a school bus ==References== Category:Bus transport",
 "title": "School bus"
}