{
 "id": "560347",
 "text": "States' rights is a belief found in the United States Constitution in which some rights are reserved for state governments and may not be changed by the federal government. They are also protected by the Tenth Amendment as part of the Bill of Rights. The discussion over states' rights is the oldest constitutional debate in the United States.Sotirios A. Barber. The Fallacies of States' Rights(Cambridge, MA: Harvard University Press, 2013), p. 1 People are still debating about it. == History == thumb|left|250px| States' rights, meaning the sovereignty and independence of individual US states, was guaranteed in the Articles of Confederation, the precursor to the US Constitution. It stated that the individual states \"hereby severally enter into a firm league of friendship with each other, for their common defense, the security of their liberties, and their mutual and general welfare\". The articles created a weak central government with most of the power being kept by the individual states. Within a short time, it was realized that a stronger central government and a constitution was needed. States' rights were debated at the Constitutional Convention in Philadelphia in 1787. The question was the main point of debates between the Federalists and Anti-Federalists while the Constitution was being ratified. Fueled mainly by the issue of slavery, the question came up during the 1820s and the 1830s, when the United States was expanding westward. Southern states wanted the new territories to allow slavery. Northern states wanted the territory to be free of slavery. As the North's economy grew and the South's economy stalled, the two began moving farther apart on the issue. By the 1840s and 1850s, both had adopted extreme positions, which were based on the morality of slavery and economic self- interests. As long as both North and South had equal representation in the US Senate, neither side could dictate to the other. However, with each new state applying for statehood, the balance of power was threatened. In the 1850s, the issue of secession was raised again. The South made the argument was that when it agreed to join the United States in the late 1780s, it kept the power to cancel the agreement. South Carolina threatened to secede unless the Senate passed a constitutional amendment to give the South “the power she possessed of protecting herself before the equilibrium of the two sections was destroyed.” Several peaceful attempts were made to find a compromise. The Compromise of 1850, the Fugitive Slave Act of 1850, and the 1854 Kansas–Nebraska Act were aimed at reaching a compromises. However, only the Fugitive Slave Act clearly benefited the South. Northerners bitterly resented the law, which made citizens responsible for catching runaway slaves and returning them to their masters. == Southern states' rights == While many people believe that the Civil War was about states' rights, not slavery, the Southern states were in favor of states' rights for themselves, not for all states. They did not favor states' rights for new states joining the Union on the question of slavery. They wanted the federal government to decide that all news states would allow slavery. That can be seen in the Fugitive Slave Act of 1793, the Missouri Compromise of 1820, and the 1850 Compromise. All of them were designed to force the Northern states to accept slavery in the territories. In December 1835, Representative James Hammond of South Carolina proposed the House of Representatives force a gag rule against any member who brought up anti-slavery petitions. It was referred to a committee, which decided the gag order should go into effect for anything regarding slavery. House Speaker James Polk of Tennessee referred the issue to a special committee. The committee chairman was Henry L. Pinckney of South Carolina, who decided that any issue regarding slavery should be tabled without discussion permanently. John Quincy Adams of Massachusetts objected but was outvoted. He fought against the gag rule for the next four Congresses. Each session, he brought up the issue until December 3, 1844, when the gag rule was finally overturned. Bleeding Kansas was another case of Southerners fighting against states' rights. Most settlers came to Kansas from North. They were not interested in the conflict over slavery but wanted only to create farms and to live in peace. Kansas was on the border with Missouri, a slave state. Many Missourians were driven to believe that all settlers in Kansas were \"negro thieves\" and abolitionists. Missourians believed that they had to defend slavery, and so attacked Kansas communities across the border, and killed or drove out Kansas settlers who were against slavery. Abolitionists also came to Kansas to make sure that it would vote to become a free state. That turned Kansas into a battleground. == Northern states' rights == Many in the North were in favor of states determining their own course, but when it came to slavery, there was a considerable anti-slavery political faction at work in the North. Many in New England had grown wealthy in the slave trade before it was banned, but that part of the North had become a center for abolitionist movements. Beginning in the 1830s, Northern churches and politicians became prominent in the movement. That contributed to the resentment felt by Southerners. Abolitionists took a hard line against slavery, wanted all slaves freed and to end racial segregation immediately everywhere in the country. Other groups in the North, notably the Free Soil Party, wanted to end slavery in the new western territories, but for different reasons. They had no slaves themselves, but most were prejudiced against black people and believed the popular idea at the time that blacks were inferior. They wanted the new lands to be for whites only. Southern slaveholders saw no real difference between the two groups, and as only that both were against slavery. == American Civil War == During the American Civil War, the struggle over states' rights was between the individual Southern states and the federal government over who ultimately had the political power. Some historians argue slavery was the main cause of the war, and others say states' rights was the cause, but both issues were very closely connected. At issue was whether the federal government could regulate or even end slavery within the terrritories. There were other factors that divided the country between Southern slaveholding states and Northern industrial states. The South saw the institution of slavery as necessary to its economy and its way of life. Even Southern churches supported slavery when Northern churches saw the ownership of another person as an abomination. Those who defended Southern states' rights pointed to the Tenth Amendment: The Constitution did not address slavery. The framers of the Constitution, many of them slave owners, wanted to avoid the problem at the federal level. The only reference was to the three-fifths rule, which counted three-fifths of a state's slave population, thus giving a state extra representation, extra votes in the Electoral College, and an increase in its direct taxes. There, the text did not say \"slaves,\" but used the expression \"all other persons\" to mean the same thing. On March 4, 1861, Abraham Lincoln gave his first inaugural address as part of his being sworn in as 16th President of the United States. The speech was addressed primarily to Southern states and was intended to lay out his intended policies and desires toward the South. The preceding month (February), seven states had formed the Confederate States of America. His speech was written in a spirit of friendship toward the seceded states. He touched on several points. Lincoln promised not to interfere with slavery in the states in which it already existed. He said that there would be no federal hostility for the time being towards the states that had seceded . He said, however, that the US government would “hold, occupy, and possess” its property and that it would also collect its taxes. He closed his speech with a warning: By 1863, two years into the war, Lincoln had changed the focus of the war to slavery and issued the Emancipation Proclamation. It made freeing the slaves a goal of the Civil War. It also weakened Confederate efforts to get help from the United Kingdom and France, which had thought about officially recognizing the Confederacy. As Union troops advanced into Confederate territory, they freed thousands of slaves per day. Many of them did not wait for the troops but fled their owners to claim their freedom. Five slave states, called the border states, had remained loyal to the Union and were not at war with the federal government. Thus, Lincoln did not have authority to free slaves in those states and so the Proclamation was not applied to those states. The Proclamation also did not apply to Tennessee and to areas within Virginia and Louisiana that Union forces already controlled. The Thirteenth Amendment, passed on December 6, 1865, abolished slavery in all of the United States and gave Congress the power to enforce it. == Supreme Court cases == The following Supreme Court decisions had to do with states' rights. Some of them were later overturned. * McCulloch v. Maryland (1819) The Court decided the federal government had the power to set up a federal bank, even though the Constitution does not say so explicitly.The Oxford Guide to United States Supreme Court Decisions, ed. Kermit L. Hall (New York: Oxford University Press, 1999), pp. 182–184 Also, that a state did not have the right to tax the federal government to try to weaken the bank. * Gibbons v. Ogden (1824) The Court ruled that New York's licensing requirement for out-of-state boat operators was inconsistent with a federal law regulating coastal trade. * Dred Scott v. Sandford (1857) The court ruled African Americans, whether free or slaves, were not US citizens. That meant that they could not sue in a federal court. Also, states coud not make them citizens. Additionally, the Missouri Compromise was ruled unconstitutional. * Hammer v. Dagenhart (1918) The Court ruled on a question of a federal law banning the shipments across state lines of goods that were made in factories employing underaged children as workers. The decisioon was that Congress could not regulate the production of goods. * Wickard v. Filburn (1942) The Court ruled on an Ohio farmer, Filburn, who was growing wheat for animal feed on his own farm. The US government had established limits on wheat production to stabilize wheat prices and supplies. The ruling was in favor of the federal government, and greatly expanded the federal government's regulation powers. * Brown v. Board of Education of Topeka (1954) The Court declared state laws establishing separate public schools for black and white students to be unconstitutional and a violation of the Fourteenth Amendment. == Notes == == References == == Other websites == * Jefferson and Hamilton Debate Federal vs. States' Rights Category:Origins of the American Civil War",
 "title": "States' rights"
}