{
 "id": "560805",
 "text": "Survivor Series (2016) was a professional wrestling pay-per-view (PPV) and livestreaming show made by WWE. It took place on November 20, 2016 at the Air Canada Centre in Toronto, Ontario, Canada. It was the 30th Survivor Series event held by WWE and the first to be held in Canada since the 1997 edition, which featured the Montreal Screwjob. Eight matches were performed at the event. In the most important match, Goldberg competed in his first match in 12 years, beating Brock Lesnar in one minute and 26 seconds. In addition, there were three Survivor Series matches between the wrestlers of the Raw and SmackDown brands. == Background == At WrestleMania XX, Goldberg beat Lesnar and the next day, both men left WWE. Brock wrestled in New Japan Pro Wrestling, fought in Ultimate Fighting Championship and returned to WWE in April 2012 but Goldberg hardly wrestled again. In 2016, the covers and commercials for the WWE 2K17 video game were shown for the first time, and Goldberg was revealed as the pre-order bonus for the game. This made many people think that he would return to WWE and maybe get a rematch with Lesnar. The two started talking about the match they could have at conventions like the ones for the video game. In October 2016, Lesnar's manager Paul Heyman said Brock was challenging Goldberg because he was the one wrestler Brock could never beat. On the October 17 episode of Raw, Goldberg returned and agreed to fight Brock. To start the match, Brock pushed Goldberg into the corner and rammed him between the ropes but Goldberg pushed him back hard and Brock fell back. When Brock got up, he took a spear from Goldberg. This happened again and then Goldberg picked Brock up and performed a Jackhammer and won the match. == Matches == No. Results Stipulations Times 1 TJ Perkins, Rich Swann and Noam Dar beat Tony Nese, Drew Gulak and Ariya Daivari Six-man tag team match 11:50 2 Kane beat Luke Harper Singles match 9:10 3 Team Raw (Charlotte Flair, Bayley, Sasha Banks, Alicia Fox and Nia Jax) (with Dana Brooke) beat Team SmackDown (Natalya, Becky Lynch, Alexa Bliss, Naomi and Carmella) 5-on-5 Survivor Series elimination match 17:30 4 The Miz (c) (with Maryse) beat Sami Zayn Singles match for the WWE Intercontinental Championship. 14:05 5 Team Raw (The New Day (Big E and Kofi Kingston), Cesaro, Sheamus, Enzo Amore, Big Cass, The Shining Stars (Primo and Epico), Luke Gallows, and Karl Anderson) (with Xavier Woods) defeated Team SmackDown (Heath Slater, Rhyno, American Alpha (Jason Jordan and Chad Gable), The Usos (Jimmy and Jey Uso), The Hype Bros (Zack Ryder and Mojo Rawley), and Breezango (Tyler Breeze and Fandango)) 10-on-10 Survivor Series tag team elimination match 18:55 6 The Brian Kendrick (c) defeated Kalisto by disqualification Singles match for the WWE Cruiserweight Championship 12:25 7 Team SmackDown (AJ Styles, Dean Ambrose, Bray Wyatt, Randy Orton and Shane McMahon) (with James Ellsworth) beat Team Raw (Kevin Owens, Chris Jericho, Roman Reigns, Seth Rollins and Braun Strowman) 5-on-5 Survivor Series elimination match 52:55 8 Goldberg beat Brock Lesnar (with Paul Heyman) Singles match 1:26 Natalya replaced Nikki Bella, who was attacked backstage before the match. === Survivor Series elimination matches === Elimination Wrestler Team Eliminated by Elimination move Time 1 Carmella SmackDown Alicia Fox Scissors kick 6:23 2 Alicia Fox Raw Alexa Bliss Twisted Bliss 6:46 3 Naomi SmackDown N/A Countout 8:21 4 Sasha Banks Raw Natalya Roll-up 10:18 5 Natalya SmackDown Charlotte Flair Big boot 11:59 6 Nia Jax Raw Becky Lynch Dis-arm-her 13:33 7 Alexa Bliss SmackDown Charlotte Flair Big boot 14:06 8 Becky Lynch SmackDown Bayley Bayley-to-Belly Suplex 17:30 Survivors: Charlotte Flair and Bayley (Team Raw) Elimination Wrestlers Team Eliminated by Elimination move Time 1 Breezango SmackDown The New Day Midnight Hour 0:41 2 The New Day Raw The Usos Superkick 1:06 3 The Hype Bros SmackDown Luke Gallows and Karl Anderson Magic Killer 5:07 4 The Shining Stars Raw American Alpha Elevated diving bulldog 8:08 5 American Alpha SmackDown Luke Gallows and Karl Anderson Magic Killer 10:37 6 Luke Gallows and Karl Anderson Raw Heath Slater and Rhyno Gore 12:27 7 Heath Slater and Rhyno SmackDown Enzo Amore and Big Cass Bada Boom Shakalaka 12:45 8 Enzo Amore and Big Cass Raw The Usos Samoan Splash 13:24 9 The Usos SmackDown Cesaro and Sheamus Sharpshooter 18:55 Survivors: Cesaro and Sheamus (Team Raw) Elimination Wrestler Team Eliminated by Elimination move Time 1 Dean Ambrose SmackDown Braun Strowman Running powerslam 16:00 2 Braun Strowman Raw N/A Countout 21:30 3 Kevin Owens Raw N/A Disqualification 29:30 4 Chris Jericho Raw Randy Orton RKO 30:15 5 Shane McMahon SmackDown N/A Spear by Reigns; the referee decided that McMahon was knocked out and unable to continue 40:00 6 AJ Styles SmackDown Seth Rollins Triple powerbomb through the announce table, helped by Ambrose and Reigns 42:30 7 Seth Rollins Raw Bray Wyatt RKO from Orton 46:00 8 Roman Reigns Raw Bray Wyatt Sister Abigail 52:55 Survivors: Bray Wyatt and Randy Orton (Team SmackDown) == References == == Other websites == *Official website for the Survivor Series (2016) Category:2016 in sports Category:November 2016 events Category:Sport in Toronto Category:Survivor Series Category:2010s in Toronto Category:2016 in Canada",
 "title": "Survivor Series (2016)"
}