{
 "id": "560815",
 "text": "The World Tag Team Championship, formerly known as the WWE Tag Team Championship and the WWE Raw Tag Team Championship, is a professional wrestling tag team championship in WWE. It is wrestled for on the Raw brand. From April 5, 2009 to August 16, 2010 it was defended as one with the old World Tag Team Championship until the other title was retired. From May 20, 2022 to April 6, 2024 it was defended as one with the WWE SmackDown Tag Team Championship as the Undisputed WWE Tag Team Championship. ==History== After the Brand Extension in World Wrestling Entertainment, the WWE Undisputed Championship and WWE Women's Championship became the only titles allowed to be fought for on both the Raw and SmackDown! brands, while the remaining titles were made where they could only be fought for on their own brands. Originally a part of the SmackDown brand after the company's first brand extension in the spring of 2002, the Tag Team Championship was moved to the Raw brand that following summer. The Tag Team Championship became apart of the Raw brand only, leaving the SmackDown! brand without a tag team title. As a result, SmackDown General Manager Stephanie McMahon, introduced the new \"WWE Tag Team Championship\" and made it the tag team title for the SmackDown! brand. She stated that the first champions would be the winners of an eight-team tournament. On October 20, 2002, the team of Kurt Angle and Chris Benoit beat Rey Mysterio and Edge at No Mercy in the tournament final to become the first ever WWE Tag Team Champions. On October 17, 2007, SmackDown! and ECW announced a talent sharing agreement that made it where talent from either brand's roster can compete on both brands. As a result, the title was fought for on both brands. In late 2008 through early 2009, WWE Tag Team Champions The Colóns (Carlito and Primo) started a rivalry with the World Tag Team Champions John Morrison and The Miz, which resulted in the announcement on the March 17 edition of ECW that at WrestleMania XXV both teams would fight for their titles against each other and the winning team would hold both titles. The result was the Unified WWE Tag Team Championship, a combination of the two titles though both were kept active by themselves (and thus keeping their own title histories), they were defended as one by one tag team. The champions could appear on and defend the titles on any WWE brand. Though eventually, on August 16, 2010, the World Tag Team Championship was retired in favor of continuing the history of the WWE Tag Team Championship following the introduction of new championship belts to then-champions David Hart Smith and Tyson Kidd of The Hart Dynasty. The champions continued to compete on any brand until the end of the brand extension in August, 2011. However, WWE decided to bring back the brand split in July 2016. During the draft for this, the champions at the time, The New Day, were chosen to wrestle on Raw. This meant that SmackDown didn't have a tag team title. So, SmackDown's general manager Daniel Bryan and commissioner Shane McMahon created the SmackDown Tag Team championship. After this, the WWE Tag Team Championship was renamed the Raw Tag Team Championship. At WrestleMania 34 on April 8, 2018, the champions at the time, Cesaro and Sheamus, were going to fight Braun Strowman and a partner for him to choose. At the show, Strowman said that his partner would be a fan from the audience. Then, he went out into the crowd and picked a 10-year-old named Nicholas and they beat Cesaro and Sheamus for the titles. This made Nicholas the youngest person to ever win a championship in WWE. The two gave up the titles the next night on Raw. On the May 20, 2022, episode of SmackDown, reigning SmackDown Tag Team Champions The Usos (Jimmy and Jey Uso) defeated Raw Tag Team Champions RK-Bro (Randy Orton and Riddle) in a Winners Take All match to win both championships and become recognized as the Undisputed WWE Tag Team Champions. WWE called the match as a championship unification match; however, both titles remained independently active. The Usos defended both titles together across both brands as the Undisputed WWE Tag Team Championship, but on a couple of occasions in early 2023, they also defended the titles separately. In the main event of WrestleMania 39 Night 1, The Usos defended the Undisputed WWE Tag Team Championship against the team of Kevin Owens and Sami Zayn. This subsequently made both the Raw and SmackDown titles the first tag team championships to be defended in the main event of WWE's biggest event, WrestleMania. At the event, Owens and Zayn defeated The Usos to become champions. The titles would again be defended in the main event of a pay-per-view and livestreaming event at Night of Champions the following month on May 27 when Owens and Zayn defeated The Bloodline (Roman Reigns and Solo Sikoa). At WrestleMania XL Night 1 on April 6, 2024, the Undisputed WWE Tag Team Championship was defended in a Six-Pack Tag Team Ladder match in which both sets of titles had to be retrieved to win. The titles were split as Austin Theory and Grayson Waller retrieved the SmackDown titles while The Awesome Truth (The Miz and R-Truth) retrieved the Raw titles. Nine days later on Raw, the championship was renamed to World Tag Team Championship and was also redesigned. == Title history == == Footnotes == ==References== ==Other websites== * World Tag Team Championship official title history Category:World Wrestling Entertainment championships Category:2002 establishments",
 "title": "WWE Raw Tag Team Championship"
}