{
 "id": "560965",
 "text": "Douglas James Burgum (born August 1, 1956) is an American entrepreneur, philanthropist and politician who has been the 55th and current United States Secretary of the Interior since 2025. He was the 33rd Governor of North Dakota from 2016 to 2024. He is a member of the Republican Party. He joined Great Plains Software in 1983 and became the company’s president in 1984 until resigning in 2016 for his gubernatorial run. Burgum briefly ran for President of the United States in the 2024 election. He was seen as a possible vice presidential pick for former President Donald Trump's 2024 campaign before Ohio Senator JD Vance was selected. In November 2024, Burgum was nominated by President-elect Trump to serve as the United States Secretary of the Interior and chair of the National Energy Council. ==Early life== Burgum was born and raised in the small town of Arthur, North Dakota. He studied at North Dakota State University and Stanford University. While at Stanford, he became friends with Steve Ballmer, who would later be CEO of Microsoft. ==Business career== In 1983, Burgum invested in a small technology startup company, Great Plains Software. He became the company's president in 1984. Burgum sold the company to Microsoft for $1.1 billion in 2001. While working at Microsoft, he managed Microsoft Business Solutions. He was board chairman for Atlassian and SuccessFactors. Burgum is the founder of Kilbourne Group, a real-estate development firm. ==Governor of North Dakota== In 2016, Burgum announced his plan to run for Governor of North Dakota as a Republican. He ran against State Attorney General Wayne Stenehjem, who won the party's support at the party convention in April. However, Burgum was able to beat Stenehjem in the primary election two months later to win the nomination. Burgum would go on to win the November general election with over 75% of the vote. Burgum was sworn in as the 33rd governor of North Dakota on December 15, 2016. Burgum has set a goal for North Dakota to become carbon-neutral by 2030. In 2018, Burgum created the Vision Zero project. Since then, traffic-related deaths in North Dakota have reached record lows. Burgum announced on January 22, 2024 that he would not run for a third term. His term ended in December 2024 with U.S. Representative Kelly Armstrong replacing him. ==2024 presidential campaign== On June 7, 2023, Burgum announced his presidential candidacy for the 2024 presidential election. His announcement made him the first North Dakotan to run for president. Burgum is reported to have spent more money on advertisements than any other presidential candidate since he began his campaign. After low polling numbers and failing to qualify in the third and fourth presidential debate, Burgum suspended his campaign on December 4, 2023. Afterward, Burgum began campaigning for former President Donald Trump, who said he wanted Burgum to be an important member of his administration. In May 2024, it was reported that Burgum was on the shortlist to be Trump's running mate in the 2024 election. By July 2024, Burgum and Ohio U.S. Senator JD Vance were seen as the two frontrunners for the position. However Trump would go on to pick Vance as his running mate. ==U.S. Secretary of the Interior== On November 14, 2024, President-elect Donald Trump nominated Burgum to serve as the United States Secretary of the Interior in his second administration. Trump also named Burgum as his new \"energy czar\" and chair of the National Energy Council to handle deregulation and private investments. This role will also give Burgum a seat on the National Security Council. Burgum's nomination was supported by many Republican senators, including John Barrasso, Dan Sullivan, and Tim Sheehy. Many tribal leaders also expressed support for his nomination. However, several environmental groups did not like his nomination because of Burgum's connections to and plans for the fossil fuel industry. Burgum's confirmation hearing before the Energy and Natural Resources Committee was held on January 16, 2025. During his hearing, he supported drilling and saw making the country's energy as a huge financial gain while also calling climate change a \"global phenomenon\". Following his hearing the Senate Energy and Natural Resources committee scheduled a vote for January 23 for a full vote on the Senate floor. The committee voted 18-2 to advance Burgum to a full Senate vote. He would later be confirmed by the U.S. Senate in a 79-18 vote on January 30, 2025 and was sworn-in on February 1 by Associate Justice Sonia Sotomayor. ==Personal life== Burgum married his first wife, Karen Stoker, in 1991. They divorced in 2003.https://www.kxnet.com/news/gov-elect-burgum- announces-marriage/amp/ They had three children. In 2016, Burgum married Kathryn Helgaas. ==References== ==Other websites== *Office of the Governor official government site *Doug Burgum for Governor official campaign site * * Category:1956 births Category:Living people Category:American philanthropists Category:Governors of North Dakota Category:Businesspeople from North Dakota Category:Stanford University alumni Category:Republican Party (United States) politicians Category:2024 United States presidential candidates",
 "title": "Doug Burgum"
}