{
 "id": "560922",
 "text": "Merry Christmas with Love is Clay Aiken's first Christmas album. It was released by RCA Records on November 16, 2004. It was certified platinum and was recognized by Billboard as the Best-selling Christmas/holiday album of 2004 and the Best-selling Christian album of 2005. The album was re-released on August 18, 2009 on the Sony label. Merry Christmas with Love debuted at number four on the U.S. Billboard 200 chart with about 270,000 copies sold.Margo Whitmire, \"Eminem Thankful To Remain No. 1\", Billboard.com, November 24, 2004, retrieved November 14, 2016 This was its highest position on the chart. By the end of 2004, around 1,004,000 copies of the album had been sold. The album set a new record for fastest-selling holiday album, since SoundScan began in March 1991. It tied Céline Dion's record for the highest debut by a holiday album in the history of Billboard magazine.Rogers, Steve. Clay Aiken's \"Merry Christmas With Love\" holiday album debuts to record sales realitytvworld.com. November 29, 2004. Retrieved November 14, 2016 On January 6, 2005, Merry Christmas with Love was certified Platinum by the Recording Industry Association of America for shipments of one million copies in the U.S. Going into the 2010 Christmas season, 1,416,000 copies had been sold in the U.S. and 2 million worldwide. == Awards and nominations == Billboard Awards * 2004: Won - Best Selling Christmas Album - Merry Christmas with Love * 2005: Won - Best Selling Christian Album - Merry Christmas with Love American Christian Music Awards * 2005: Won - Outstanding Yule CD - Merry Christmas with Love == Singles == Year Single Peak chart positions Album Adult Contemporary Hot Christian Songs 2004 \"Winter Wonderland\" 13 - Merry Christmas with Love 2005 \"O Holy Night\" 37 - \"Hark the Herald Angels Sing\" / \"O Come All Ye Faithful\" 27 - \"Have Yourself a Merry Little Christmas\" 32 - \"Mary, Did You Know?\" 35 32 == References == Category:2004 albums",
 "title": "Merry Christmas with Love"
}