{
 "id": "56093",
 "text": "Roald Dahl (13 September 1916 – 23 November 1990) was a Welsh-born English novelist, poet, screenwriter, short-story writer and wartime fighter pilot. He was best known for his children's novels and his children books. ==Early life== Dahl was born on 13 September 1916 in Llandaff, Cardiff, Wales to Norwegian parents.Philip Howard, \"Roald Dahl\" (1916–1990)\", Oxford Dictionary of National Biography, Oxford University Press, 2004 He was educated in England, Llandaff Cathedral School, and then worked in Africa for the Shell Oil Company. In the Second World War, he was an RAF fighter pilot. It was after an air-crash and \"a monumental bash on the head\" that he began to write. The crash was the subject of his first published story, \"Shot Down Over Libya\". He wrote Matilda and The Twits. ==Writing== He wanted to become an adult book writer but ended up as a children's book writer. He had a tragic life since his father and oldest sister both died when he was young. Roald Dahl said that the key to his success rested in sympathising with children and realising that to children, parents and school teachers are the enemy. Dahl wrote many famous children's stories and adult horror stories. Many of his books and stories have been made into films and television shows all over the world. Among his most popular books are Charlie and the Chocolate Factory, James and the Giant Peach, Matilda, The Witches, The BFG, and Kiss Kiss. Many of his children's books have pictures drawn by Quentin Blake. ==Personal life and death== Dahl was married to Patricia Neal from 1953 until they divorced in 1983. They had four daughters (one of whom died before them) and a son. Dahl was married to Felicity Crosland from 1983 until his death. He lived in Great Missenden, Buckinghamshire. He died on 23 November 1990 in Oxford, from myelodysplastic syndrome, aged 74. Model Sophie Dahl is his granddaughter. There is a Roald Dahl Museum and Story Centre in Great Missenden. == Books == Title Year Scope Notes The Gremlins 1943 Children Sometime Never: A Fable for Supermen 1948 Adult James and the Giant Peach 1961 Children Charlie and the Chocolate Factory 1964 Children The Magic Finger 1966 Children Short book Fantastic Mr Fox 1970 Children Short book Charlie and the Great Glass Elevator 1972 Children Sequel to Charlie and the Chocolate Factory Danny, the Champion of the World 1975 Children The Enormous Crocodile 1978 Children Short book My Uncle Oswald 1979 Adult The Twits 1980 Children Short book George's Marvellous Medicine 1981 Children Short book The BFG 1982 Children The Witches 1983 Children The Giraffe and the Pelly and Me 1985 Children Short book Matilda 1988 Children Esio Trot 1990 Children Short book The Vicar of Nibbleswick 1991 Children Short book The Minpins 1991 Children Short book == Poems == * Revolting Rhymes * Dirty Beasts * Rhyme Stew == Non-fiction == * Boy: Tales of Childhood * Going Solo == References == == Other websites == * Category:1916 births Category:1990 deaths Category:British autobiographers Category:British children's writers Category:Welsh novelists Category:Writers from Cardiff",
 "title": "Roald Dahl"
}