{
 "id": "560945",
 "text": "Roque \"Rocky\" De La Fuente (born October 10, 1954) is an American businessman, political activist, and politician. He was the unsuccessful nominee of the Reform Party and that of his self-created American Delta Party for President of the United States in the 2016 election. De La Fuente was an unsuccessful candidate for the Democratic nomination in Florida's 2016 election for United States Senator and for the Democratic presidential nomination in the 2016 primaries. In May 2019, De La Fuente announced his plans to run for the presidency again, seeking the Republican nomination challenging incumbent President Donald Trump. ==Early life== De La Fuente was born to Roque Antonio De La Fuente and Bertha Guerra Izaguirre on October 10, 1954 in San Diego, California. He studied at National Autonomous University of Mexico and studied Accounting & Business Administration at Anahuac University. ==Career== Between 1976 and 1990, De La Fuente had bought automobile dealerships from Alfa Romeo, American Motor Corporation, Audi, Cadillac, Chrysler, Daihatsu, Dodge, GMC, Honda, and others. In 2004, the Federal Deposit Insurance Corporation issued an order barring De La Fuente from participating in an FDIC-insured institution. De La Fuente went to court and the case was resolved. He owns businesses and properties in the Dominican Republic, Mexico, United States, and Uruguay. ==Political Campaigns== === 2016 presidential === De La Fuente ran a presidential campaign in the 2016 election. De La Fuente sought the Democratic Party's nomination during their presidential primaries. De La Fuente's campaign came in Third behind Hillary Clinton and Bernie Sanders. De La Fuente founded the American Delta Party and ran as that party's nominee with his running mate Michael Steinberg and was nominated as the presidential candidate of the Reform Party which had ballot access in Florida, Kentucky, Louisiana, Minnesota and Mississippi. ===2016 Senate campaign=== On June 20, 2016, De La Fuente paid the $10,440 qualifying fee to run for the Democratic nomination of the 2016 Senate election in Florida to decide the Democratic nominee for the Senate seat occupied by Republican Marco Rubio. He competed with Patrick Murphy, Alan Grayson, Pam Keith, and Reginald Luster for the nomination. Murphy won the nomination; De La Fuente came in fourth-place out of five candidates, receiving 60,606 votes (5.38% of the overall vote). === 2018 Senate Campaigns === In 2018, De La Fuente, ran for US Senate in seven Republican primaries and the California and Washington open primaries to show how problematic the current election process was. He lost the primaries in Wyoming (1,280 votes, 1.1% of the vote), Hawaii (3,065 votes, 9.4% of the vote ), Minnesota (17,051 votes, 5.9% of the vote), Vermont (1,057 votes, 2.9% of the vote), Delaware (1,998 votes, 5.3% of the vote), and Rhode Island (3,722 votes, 12.3% of the vote). In Florida, he got 11.4% of the vote against Republican Gov. Rick Scott. He also filed to run for the 2018 Senate election in California under the Republican Party to unseat incumbent Dianne Feinstein, but failed in the June 5 primary. ===2020 presidential campaign=== On January 9, 2017, De La Fuente announced his plans to run for president again for the Democratic nomination in 2020. He soon filed to run for the Republican nomination. As of September 30, 2019, he had raised $6,735 from outside sources and had loaned his own campaign $10.18 million. He has qualified as a candidate in Alabama, Delaware, Vermont, Arkansas, New Hampshire, Colorado, and Texas. On July 30, De La Fuente filed a federal lawsuit against the new California law that says no one can be on a presidential primary ballot unless he or she reveals the last five years of federal income tax returns. On August 6, 2019, he filed a brief on it. ===2020 congressional=== De La Fuente ran as a Republican in the campaign for the U.S. House of Representatives seat for California's 21st district. (Unlike most other states, California has no law prohibiting simultaneously running for the presidency and for Congress.) His son Ricardo ran for the same seat as a Democrat. Neither De La Fuente lives in the district. Rocky felt that his candidacy would help his son's chances of getting the seat, which was the outcome he desired. Neither De La Fuente succeeded in this primary, coming in third (Ricardo) and fourth (Rocky) in a four-candidate jungle primary in which the top two vote-getters compete in the general election. However, on the same day, Ricardo, who had previously run for the House from California's 34th and Florida's 23rd districts, won the Democratic primary for U.S. representative for Texas's 27th district, but went on to lose the general election. ==Personal life== De La Fuente married Katayoun Yazdani. De La Fuente has five children. De La Fuente has a stated goal of creating a political dynasty. Two of his sons have also sought office. His son Ricardo \"Ricky\" De La Fuente has sought several congressional seats. He first ran as a Democrat in the 2017 California's 34th congressional district special election. He then, in 2018, unsuccessfully sought the Democratic nomination for Florida's 24th US congressional district. In 2020 he unsuccessfully ran as a Democrat in the California's 21st US congressional district (competing against his father, who ran unsuccessfully as a Republican) and successfully won the Democratic nomination for Texas's 27th US congressional district (where he hopes to become a resident). In 2020, Ricardo was also originally running for the Democratic nomination in Florida's 24th US congressional district. In 2020, his son Roque De La Fuente III entered the Democratic presidential primaries in Arizona, California, Colorado, Idaho, Missouri, New Hampshire, Texas, and Utah. ==Electoral history== ===Presidential elections=== 2016 Democratic presidential primaries 2016 Democratic presidential primaries 2016 Democratic presidential primaries Candidate Votes % Hillary Clinton 16,917,853 55.23 Bernie Sanders 13,210,550 43.13 Martin O'Malley 110,423 0.36 Rocky De La Fuente 67,468 0.22 Willie Wilson 25,796 0.08 Paul T. Farrell, Jr. 21,694 0.07 Keith Russell Judd 20,305 0.07 Michael Steinberg 20,126 0.07 Henry Hewes 11,062 0.04 John Wolfe Jr. 7,369 0.02 Star Locke 5,202 0.02 Steve Burke 4,893 0.02 Lawrence \"Larry Joe\" Cohen 2,407 0.01 Calvis L. Hawes 2,017 0.01 James Valentine 1,726 0.01 Jon Adams 486 0.00 Vermin Supreme 268 0.00 Mark Stewart 236 0.00 David John Thistle 226 0.00 Graham Schwass 143 0.00 Lloyd Thomas Kelso 46 0.00 Mark Stewart Greenstein 41 0.00 Eric Elbot 36 0.00 William D. French 29 0.00 Edward T. O'Donnell, Jr. 26 0.00 David Formhals (write-in) 25 0.00 Robert Lovitt 22 0.00 William H. McGaughey, Jr. 19 0.00 Edward Sonnino 17 0.00 Steven Roy Lipscomb 15 0.00 Sam Sloan 15 0.00 Brock C. Hutton 14 0.00 Andrew Daniel \"Andy\" Basiago (write-in) 13 0.00 Raymond Michael Moroz 8 0.00 Richard Lyons Weil 8 0.00 Ignaci칩 Le칩n Nu침ez (write-in) 6 0.00 Willie Felix Carter (write- in) 3 0.00 Brian James O'Neill, II (write-in) 2 0.00 Doug Terry (write-in) 1 0.00 Kevin Michael Moreau (write-in) 0 0.00 Uncommitted 101,481 0.33 No Preference 50,990 0.17 scattering 48,576 0.16 Uninstructed Delegation 1,488 0.00 Total 30,633,131 100.00 2016 United States presidential election 2016 United States presidential election 2016 United States presidential election 2016 United States presidential election 2016 United States presidential election 2016 United States presidential election 2016 United States presidential election Presidential candidate Party Popular vote Popular vote Electoral vote Electoral vote Vice-presidential candidate Presidential candidate Party Count Percentage Projected Actual Vice-presidential candidate Donald Trump Republican 62,984,828 45.93 306 304 Mike Pence Hillary Clinton Democratic 65,853,514 48.02 232 227 Tim Kaine Gary Johnson Libertarian 4,489,235 3.27 0 0 Bill Weld Jill Stein Green 1,457,226 1.06% 0 0 Ajamu Baraka Evan McMullin (Independent) 732,273 0.53% 0 0 Mindy Finn Darrell Castle Constitution Party 203,091 0.15%' 0 0 Scott Bradley Gloria La Riva Socialism and Liberation 74,405 0.05% 0 0 Eugene Puryear Rocky De La Fuente American Delta and Reform 33,136 0.02 0 0 Michael Steinberg Other Other 1,297,332 0.93 0 7 Other Total Total 137,125,040 100.00 538 538 Total ===U.S. Senate primaries=== 2016 Florida Democratic Senate Primary election results 2016 Florida Democratic Senate Primary election results 2016 Florida Democratic Senate Primary election results Candidate Votes % Patrick Murphy 665,985 58.9 Alan Grayson 199,929 17.7 Pam Keith 173,919 15.5 Rocky De La Fuente 60,810 5.4 Reginald Luster 29,138 2.6 Total 1,129,781 100.00 ;2018 Senate primaries State Primary type Date Votes % Winner(s) California Nonpartisan blanket June 5 135,279 2.1 Dianne Feinstein, Kevin de Le칩n Washington Nonpartisan blanket Aug 8 5,724 0.34 Maria Cantwell, Susan Hutchison Hawaii Republican Aug 11 3,075 9.4 Ron Curtis Minnesota Republican Aug 14 17,051 5.9 Jim Newberger Vermont Republican Aug 14 1,057 2.9 Brooke Paige Wyoming Republican Aug 21 1,280 1.1 John Barrasso Florida Republican Aug 28 187,209 11.4 Rick Scott Delaware Republican Sep 6 1,998 5.3 Robert Arlett Rhode Island Republican Sep 12 3,722 12.3% Robert Flanders ;2020 congressional ==References== ==Other websites== *Rocky 2016 campaign website * *Columnist Dave Barry on meeting De La Fuente * Category:1954 births Category:Living people Category:2020 United States presidential candidates Category:2016 United States presidential candidates Category:Businesspeople from California Category:Politicians from Florida Category:Politicians from San Diego Category:Democratic Party (United States) politicians",
 "title": "Rocky De La Fuente"
}