{
 "id": "56109",
 "text": "In physics, power (symbol: P) is how fast work is done. Or how quickly energy is given from one thing to another. In the SI system of measurement, power is measured in watts (symbol: W). Bright light bulbs require more power than dim light bulbs. More electricity is used every second with a bright light bulb. So it costs more to run a bright bulb for a minute than a dim light bulb. A modern LED light bulb might take 5 Watts of power. A kettle while it is boiling might take 2,000 Watts of power - or 'two Kilowatts'. (Kilo means 'a thousand of'). A car when someone is making it go faster might take 100 Kilowatts of power, but people tend to measure a car's power as Horsepower, not Kilowatts, and one Horsepower is less than a Kilowatt - about three quarters of a kilowatt. It may take a certain amount of work to make a change in the world, such as lifting a heavy weight to a higher level. It makes no difference if the weight is lifted slowly or quickly. The same amount of work will have been performed. The difference between a slow lift and a quick lift is that a quick lift requires more power. This means the work can be done in a shorter time if there is more power available. As a rate of change of work done or the energy of a subsystem, power is: :P=\\frac{E}{t} where :P is power, measured in Watts, :E is energy (or work), measured in Joules and :t is time, measured in seconds :.. Because Energy (or work) is measured in Joules, power (measured in Watts) is measured as how many Joules are used each second. Power is also equal to force times velocity (or speed). == Power in optics == In optics, or radiometry, the term power could mean one of two things. Sometimes power refers to radiant flux, which is the average rate of energy transport by electromagnetic radiation, measured in watts. Or sometimes the term \"power\" is also used to express the ability of a lens or other optical device to focus light, and this is measured in dioptres (inverse metres). Dioptre is equal to 1 divided by the focal length of the lens. Category:Physical quantity Category:Basic physics ideas",
 "title": "Power (physics)"
}