{
 "id": "561179",
 "text": "The early history of the automobile can be divided into a number of eras, based on the method of propulsion. Later periods were defined by trends in exterior styling, size, and utility preferences. The question of who invented the first automobile depends on how automobiles are defined. == Early pioneers == * In 1769 the first steam-powered automobile capable of transporting people was built by Nicolas-Joseph Cugnot.Erik Eckermann, World History of the Automobile (Warrendale, PA: Society of Automotive Engineers, 2001), p. 14 * In 1807 François Isaac de Rivaz designed the first hydrogen-powered internal combustion engine.Arvid Linde, Preston Tucker and Others: Tales of Brilliant Automotive Innovators & innovations (Dorchester, England: Veloce, 2011), p. 136 In 1813 he built a car long and weighing over . * Between 1832 and 1839, Robert Anderson built the first electric-powered carriage in Scotland. * In 1864 Siegfried Marcus built the first gasoline powered internal combustion engine. In 1870 he placed it on a pushcart making it the first four wheeled gasoline-powered vehicle.Manfred Weissenbacher, Sources of Power: How Energy Forges Human History (Santa Barbara, CA: Praeger, 2009), p. 378 He built four more combustion-engine cars over a 10-to-15-year span that influenced later cars. Marcus created the two-cycle combustion engine. The car's second version in 1880 introduced a four-cycle, gasoline-powered engine. It had an ingenious carburetor design, and magneto ignition. He created an additional two models further refining his design with steering, a clutch, and brakes. His second car is on display at the Technical Museum in Vienna. During his lifetime, he was honored as the originator of the motorcar. But his place in history was all but erased by the Nazis during World War II. Because Marcus was of Jewish descent, the Nazi propaganda office ordered his work to be destroyed, his name expunged from future textbooks, and his public memorials removed. They gave credit instead to Karl Benz. * In 1885-1886, Karl Benz developed a petrol- or gasoline-powered automobile. It was called the Benz Patent-Motorwagen. This is also considered to be the first \"production\" automobile. * In 1886, Gottlieb Daimler built the first four-wheeled, four-stroke engine called the \"Cannstatt-Daimler.\" * In 1893, Charles Duryea and his brother J. Frank Duryea built the first successful gasoline-powered car with a two-stroke engine. The two brothers set up the first American car manufacturing company. * In 1895, George Baldwin Selden received the patent for the combined internal-combustion engine with a carriage. He never produced the vehicle and only seldom collected royalties for using his patent. * In 1908, Henry Ford began producing affordable, simple and reliable cars anyone could drive. == Evolution of the automobile == === Invention era === This period starts with the car made by Karl Benz in 1885. There were earlier inventions that used mainly steam-power to move the vehicles but the Benz car was the first to use a gasoline powered internal combustion engine in what could be called an automobile. The period goes up to the start of the production of Henry Ford's Model T. === Manufacturing era === This period dates from 1908 to 1914 and the beginning of World War I. While earlier designs were more ornamental, vehicles from this period are simpler and more affordable. It is the time when hundreds of smaller automobile manufacturers were trying to compete for attention and sales. A number of improvements were developed during this time. These include the electric ignition system, four-wheel brakes and the independent suspension. Transmissions were adopted. Along with throttle controls, these allowed the vehicles to travel at a number of speeds depending on conditions. === Coachwork era === From about 1920 to 1930, car manufacturers began creating a closed body on the vehicle. This protected the driver and passengers from the weather. Vehicles began using curved glass and the new enclosed bodies gave a sense of privacy. Heaters were added for comfort. Many of the features of modern cars came from this period. These include four-wheel drive, front-wheel drive, and hybrid electric vehicles. Safety glass protected those inside the car from sharp glass in cases of an accident. By the end of the 1920s cars were becoming faster and were showing a level of style and beauty. === Classic era === The classic era began about 1930 during the Great Depression and ended just before World War II. The Great Depression was a time when many in the United States were just trying to survive. But it is also the era of some of the most significant improvements to the automobile. Cars took on a great deal of style and sophistication. They became works of art in many cases. Many new features were introduced during this era including the automatic transmission, the V-8, the V-12 and the V-16 engines. The gearshift lever moved to the steering column, hydraulic brakes were introduced for faster stopping and cars got trunks to carry luggage and cargo. The car industry changed during the 1930s. It saw the rise of the Big Three automakers. These were General Motors, Ford Motor Company and Chrysler. They were able to successfully design and sell cars during the Great Depression when fewer people could afford a new car. === Integration period === In 1949, the automobile industry finally got back on its feet after World War II. This same year General Motors, Cadillac and Oldsmobile introduced the integrated one-piece automobile body. The process joined all the different parts of the body into one body shell. Cars produced during this period concentrated on safety. Cars were big during this time. But in the late 1960s carmakers tried to market much smaller cars. The attempts by General Motors, Chrysler and Ford were all marketing failures. Instead, what sold was the performance car. Cars like the Ford Mustang and the Plymouth Barracuda were very successful. During the late 1950s, many smaller countries began producing cars. Both India and Iran were making cars from about 1959. The first Indian car design from 1950 was very similar to the Opel Kapitän. The first Iranian cars were very similar to several American cars. Both were designed in the United Kingdom. === Modern era === This period started about 1968 and continues to today. Body styles changed dramatically. The three most popular are the hatchback, the Minivan and the Sport utility vehicle (SUV). Starting in the Integration period, car manufacturers began designing cars for men while others are designed to attract women. The body shapes, colors and other cues are designed to appeal to a particular sex. Today, women tend to prefer crossovers more than men. Examples are the Kia Sportage and the Honda CR-V. Men seem to prefer powerful cars like the Chevrolet Camaro and the GMC Sierra pickup truck. In car colors, men seem to prefer brighter colors while more women seem to prefer traditional neutral colors. == Related pages == *Automotive industry *Transport *Internal combustion engine *Henry Ford == References == == Other websites == * Joseph Cugnot Steam Engine 4; YouTube * Invention of the Automobile documentary clip: YouTube Category:Automobiles Category:History of transport",
 "title": "History of the automobile"
}