{
 "id": "56114",
 "text": "Maroon 5 is an American pop rock band. It is based in Los Angeles, California. It used to be called Kara's Flowers. The band members are vocalist Adam Levine, guitarist James Valentine, bassist Mickey Madden, percussionist Matt Flynn, and keyboardists Jesse Carmichael and PJ Morton. The band has released six studio albums: Songs About Jane (2002), It Won't Be Soon Before Long (2007), Hands All Over (2010), Overexposed (2012), V (2014), and Red Pill Blues (2017). All those albums charted in the top 3 on the U.S. Billboard 200 chart. The band has sold more than 27 million albums and 109 million singles worldwide. ==History== Maroon 5 was formed at a performing arts summer camp called French Woods Festival in New York. In 1994 the band known today as Maroon 5 was a Los Angeles, California grunge band. The members were singer Adam Levine, guitarist Jesse Carmichael, drummer Ryan Dusick, and bassist Michael Madden. In 1997, the group signed with Reprise Records and released the studio album The Fourth World. In 2001, James Valentine (guitarist) joined the band. In 2006, Dusick left the band. Matt Flynn replaced him as drummer. The band's first album using the name Maroon 5 was Songs About Jane, released in 2002. On June 22, 2011, the group released the single \"Moves Like Jagger\" featuring pop singer Christina Aguilera. The release was in promotion of the NBC show The Voice. The song became #1 on the Billboard Hot 100. Levine won the first American season of The Voice in June 2011 with his partner Javier Colon. The band said that they would be working on a fourth studio album released before 2012. A song titled \"Life After you\" was expected to be recorded and released in early 2012. A song titled \"Wipe Your Eyes\" was leaked on the web January 15, 2012 and is said to have been produced by music producer J.R. Rotem. On March 26, 2012, Rolling Stone magazine announced that the group would release their fourth studio album Overexposed on June 26, 2012. The band had worked with headlining producer Max Martin, along with Benjamin Levin and lead singer of OneRepublic, Ryan Tedder. The lead single off the album, \"Payphone\", was released on April 17, 2012. In 2014, the fifth studio album V was released. On November 3, 2017, the album Red Pill Blues was released. The band announced that their seventh album, Jordi (named after Levine's friend and the band's former manager, Jordan Feldstein, brother of actor Jonah Hill), would be released on June 11, 2021. ==Discography== ===As Maroon 5=== ====Studio albums==== * Songs About Jane (2002) * It Won't Be Soon Before Long (2007) * Hands All Over (2010) * Overexposed (2012) * V (2014) * Red Pill Blues (2017) *Jordi (2021) ====Live albums==== * 1.22.03.Acoustic (2004) * Live – Friday the 13th (2005) * Live from Soho: Maroon 5 (2008) * Live from Le Cabaret (2008) * iTunes Sessions (2011) ====Extended plays==== * B-Side Collection (2007) * The Maroon 5 Hit 3 Pack (2007) * Love Songs EP (2011) ====Compilation albums==== * Call and Response: The Remix Album (2008) ====Other releases==== * It Won't Be Soon Before Long (DVD edition, 2008) * iTunes Essentials (2008) ===As Kara's Flowers=== ====Studio albums==== * The Fourth World (1997) ==References== Category:1994 establishments in California Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:American boy bands Category:American pop music groups Category:American rock bands Category:Musical groups established in 1994 Category:Musical groups from Los Angeles Category:Musical quintets Category:Pop rock bands",
 "title": "Maroon 5"
}