{
 "id": "561762",
 "text": "The arrondissement of Toulon is an arrondissement of France, in the Var department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Toulon. ==History== When the Var department was created on 1800, the arrondissement of Toulon was part of that original department. ==Geography== The arrondissement of Toulon is in the southern part of the Var department. It is bordered to the north by the Brignoles arrondissement, to the east by the Draguignan arrondissement, to the south by the Mediterranean Sea and to the west by the Bouches-du-Rhône department. The arrondissement of Toulon is the smallest arrondissement of the department in area, , but the one with more people living in it (565,669 inhabitants). ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are 14 cantons in the arrondissement of Toulon and 4 of them do not have all their communes in the arrondissement # La Crau (8302) (partly) # La Garde (8306) # Garéoult (8307) (partly) # Hyères (8308) # Le Luc (8309) (partly) # Ollioules (8310) # Saint-Cyr-sur-Mer (8312) (partly) # La Seyne-sur-Mer-1 (8316) # La Seyne-sur-Mer-2 (8317) # Solliès-Pont (8318) # Toulon-1 (8319) # Toulon-2 (8320) # Toulon-3 (8321) # Toulon-4 (8322) ===Communes=== The arrondissement of Toulon has 32 communes; they are (with their INSEE codes)ː # Bandol (83009) # Le Beausset (83016) # Belgentier (83017) # Bormes-les-Mimosas (83019) # La Cadière-d'Azur (83027) # Carqueiranne (83034) # Le Castellet (83035) # Collobrières (83043) # La Crau (83047) # Cuers (83049) # Évenos (83053) # La Farlède (83054) # La Garde (83062) # Hyères (83069) # Le Lavandou (83070) # La Londe-les-Maures (83071) # Ollioules (83090) # Pierrefeu-du-Var (83091) # Le Pradet (83098) # Le Revest- les-Eaux (83103) # Riboux (83105) # Saint-Cyr-sur-Mer (83112) # Sanary-sur-Mer (83123) # La Seyne-sur-Mer (83126) # Signes (83127) # Six-Fours-les-Plages (83129) # Solliès-Pont (83130) # Solliès-Toucas (83131) # Solliès-Ville (83132) # Toulon (83137) # La Valette-du-Var (83144) # Saint-Mandrier-sur-Mer (83153) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 83137 Toulon 165,584 Toulon-1, Toulon-2 Toulon-3, Toulon-4 Communauté d'agglomération Toulon Provence Méditerranée 83126 La Seyne-sur-Mer 64,675 La Seyne-sur-Mer-1 La Seyne-sur-Mer-2 Communauté d'agglomération Toulon Provence Méditerranée 83069 Hyères 56,502 La Crau and Hyères Communauté d'agglomération Toulon Provence Méditerranée 83129 Six-Fours-les-Plages 33,652 La Seyne-sur-Mer-2 Communauté d'agglomération Toulon Provence Méditerranée 83062 La Garde 25,145 La Garde Communauté d'agglomération Toulon Provence Méditerranée 83144 La Valette-du-Var 22,271 Toulon-3 Communauté d'agglomération Toulon Provence Méditerranée 83047 La Crau 16,749 La Crau Communauté d'agglomération Toulon Provence Méditerranée 83123 Sanary-sur-Mer 15,963 Ollioules Communauté d'agglomération Sud Sainte-Baume 83090 Ollioules 13,167 Ollioules Communauté d'agglomération Toulon Provence Méditerranée 83112 Saint-Cyr-sur-Mer 12,262 Saint-Cyr-sur-Mer Communauté d'agglomération Sud Sainte-Baume ==Related pages== * Arrondissements of the Var department * List of arrondissements of France ==References== Toulon",
 "title": "Arrondissement of Toulon"
}