{
 "id": "56178",
 "text": "A tide is the periodic rising and falling of Earth's ocean surface caused mainly by the gravitational pull of the Moon acting on the oceans. Tides cause changes in the depth of marine and estuarine (river mouth) waters. Tides also make oscillating currents known as tidal streams (~'rip tides'). This means that being able to predict the tide is important for coastal navigation. The strip of seashore that is under water at high tide and exposed at low tide, called the intertidal zone, is an important ecological product of ocean tides. The height of tides varies somewhat with the phases of the Moon. At New Moon and Full Moon, tides are higher because the Sun's tidal force adds to the Moon's. This is called \"spring tide\". At First Quarter Moon and Last (Third) Quarter Moon, tides are lower because Sun's tidal force takes away to the Moon's. This is called \"neap tide\". == Two tides a day == In most places, there are two tides a day. They each have a high point (the high tide) and a low point (the low tide). We speak of a \"flood tide\" coming in towards high tide, and an \"ebb tide\" going out towards low tide. The period of the tide is about 12 hours and 25.2 minutes, exactly half a tidal lunar day. The Moon orbits the Earth in the same direction as the Earth rotates on its axis, so it takes slightly more than a day—about 24 hours and 50 minutes—for the Moon to return to the same location in the sky. During this time, it has passed overhead once and underfoot once, so in many places the period of strongest tidal forcing is the above-mentioned, about 12 hours and 25 minutes. This is analogous to the minute hand on a watch crossing the hour hand at 12:00 and then again at about 1:05½ (not at 1:00). Because a gravitational field weakens with distance, the Moon's gravity exerts a slightly stronger pulling force on the side of the Earth facing the Moon, and a slightly weaker force on the opposite side. The Moon thus tends to \"stretch\" the Earth slightly along the line connecting the two bodies. The solid Earth deforms a bit, but ocean water, being fluid, is free to move much more in response to the tidal force, particularly horizontally. As the Earth rotates, the magnitude and direction of the tidal force at any particular point on the Earth's surface change constantly; although the ocean never reaches equilibrium—there is never time for the fluid to \"catch up\" to the state it would eventually reach if the tidal force were constant—the changing tidal force nonetheless causes rhythmic changes in sea surface height. Other things, such as atmospheric pressure and the Sun's gravity, also affect the tides, but in most places those things do much less than the Moon's gravity does. == Long-term effects == In the long term the tidal effect is considerably more than people suppose. In the four billion years the Earth has had its satellite for most of this time. The Moon moves very slightly away from Earth each year, and the Earth's rotation slows a bit. This extends the length of the days by just under two milliseconds every hundred years. Doesn't sound much, but it has lengthened the year on Earth. It is estimated that 620 million years ago (that's about the Cambrian era) the day was slightly less than 22 hours long!ScienceDailyWinter, Niels J. de; Goderis, Steven; Malderen, Stijn J. M. Van; Sinnesael, Matthias; Vansteenberge, Stef; Snoeck, Christophe; Belza, Joke; Vanhaecke, Frank; Claeys, Philippe 2020. Subdaily-Scale Chemical Variability in a Torreites Sanchezi Rudist Shell: Implications for Rudist Paleobiology and the Cretaceous Day-Night Cycle. Paleoceanography and Paleoclimatology 35 (2): e2019PA003723. doi:10.1029/2019PA003723. hdl:1854/LU-8685501. ISSN 2572-4525 == Related pages == * Aquaculture * Tidal energy == References == == Other websites == * Oceanography: tides by J. Floor Anthoni (2000). * Myths about Gravity and Tides by Mikolaj Sawicki (2005). * Tidal Misconceptions by Donald E. Simanek. * Our Restless Tides: NOAA's practical & short introduction to tides. * Tides and centrifugal force: Why the centrifugal force does not explain the tide's opposite lobe (with nice animations). === Tide predictions === * National Oceanic and Atmospheric Administration (NOAA) * Graphical Tide Calendars * WWW Tide and Current Predictor * XTide Tide Prediction Server * Earth tides calculator * Tides: Why They Happen -- Beaufort County Library * Department of Oceanography, Texas A&M; University Category:Oceanography",
 "title": "Tide"
}