{
 "id": "561749",
 "text": "The arrondissement of Draguignan is an arrondissement of France, in the Var department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Draguignan. ==History== When the Var department was created on 1800, the arrondissement of Draguignan was part of that original department. ==Geography== The arrondissement of Draguignan is the most eastern of the arrondissements of the Var department. It is bordered to the north by the Alpes-de-Haute-Provence department, to the east by the Alpes-Maritimes department, to the south by the Toulon arrondissement and to the west by the Brignoles arrondissement. The arrondissement of Draguignan is the largest arrondissement of the department in area, , but the second in population (321,569 inhabitants). ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are 9 cantons in the arrondissement of Draguignan and 3 of them do not have all their communes in the arrondissement: # La Crau (8302) (partly) # Draguignan (8303) # Flayosc (8304) (partly) # Fréjus (8305) # Le Luc (8309) (partly) # Roquebrune-sur-Argens (8311) # Sainte-Maxime (8313) # Saint-Raphaël (8315) # Vidauban (8323) ===Communes=== The arrondissement of Draguignan has 54 communes; they are (with their INSEE codes)ː # Les Adrets-de-l'Estérel (83001) # Ampus (83003) # Les ArcsLes Arcs (83004) # Bagnols-en-Forêt (83008) # Bargème (83010) # Bargemon (83011) # La Bastide (83013) # Le Bourguet (83020) # Brenon (83022) # Callas (83028) # Callian (83029) # Cavalaire-sur- Mer (83036) # Châteaudouble (83038) # Châteauvieux (83040) # Claviers (83041) # Cogolin (83042) # Comps-sur-Artuby (83044) # La Croix-Valmer (83048) # Draguignan (83050) # Fayence (83055) # Figanières (83056) # Flayosc (83058) # Fréjus (83061) # La Garde-Freinet (83063) # Gassin (83065) # Grimaud (83068) # Lorgues (83072) # La Martre (83074) # La Môle (83079) # Mons (83080) # Montauroux (83081) # Montferrat (83082) # La Motte (83085) # Le Muy (83086) # Le Plan-de-la-Tour (83094) # Puget-sur-Argens (83099) # Ramatuelle (83101) # Roquebrune-sur-Argens (83107) # La Roque-Esclapon (83109) # Sainte-Maxime (83115) # Saint-Paul-en-Forêt (83117) # Saint-Raphaël (83118) # Saint-Tropez (83119) # Salernes (83121) # Seillans (83124) # Sillans-la-Cascade (83128) # Tanneron (83133) # Taradeau (83134) # Tourrettes (83138) # Trans-en-Provence (83141) # Trigance (83142) # Vidauban (83148) # Rayol-Canadel-sur-Mer (83152) # Saint-Antonin-du-Var (83154) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 83061 Fréjus 53,511 Fréjus and Saint-Raphaël Communauté d'agglomération Var Estérel Méditerranée 83050 Draguignan 40,054 Draguignan Communauté d'agglomération Dracénoise 83118 Saint-Raphaël 34,567 Saint-Raphaël Communauté d'agglomération Var Estérel Méditerranée 83115 Sainte-Maxime 14,018 Sainte-Maxime Le Golfe de Saint-Tropez 83042 Cogolin 12,517 Sainte-Maxime Le Golfe de Saint-Tropez 83107 Roquebrune-sur-Argens 12,344 Roquebrune-sur-Argens Communauté d'agglomération Var Estérel Méditerranée 83148 Vidauban 11,152 Vidauban Communauté d'agglomération Dracénoise 83086 Le Muy 9,389 Vidauban Communauté d'agglomération Dracénoise 83072 Lorgues 9,116 Vidauban Communauté d'agglomération Dracénoise 83099 Puget-sur-Argens 7,322 Roquebrune-sur-Argens Communauté d'agglomération Var Estérel Méditerranée ==Related pages== * Arrondissements of the Var department * List of arrondissements of France ==References== Draguignan",
 "title": "Arrondissement of Draguignan"
}