{
 "id": "562388",
 "text": "The Vegas Golden Knights are a professional ice hockey team based in the Las Vegas metropolitan area and are owned by Bill Foley. The team started play in the 2017–18 NHL season as a member of the Pacific Division of the Western Conference of the National Hockey League (NHL). In their very first season, they reached the Stanley Cup Finals where they lost to the Washington Capitals in five games, and five years later, they won their first Stanley Cup over the Florida Panthers in five games. This accomplishment was predicted by owner Bill Foley before the team had even been named. == History == === Formation and First Season (2017-2018) === After a successful vote on June 22, 2016, Las Vegas was officially approved to get an expansion team. They were allowed to begin playing in the 2017-2018 season. George McPhee was announced as the first general manager of the team. On November 22, 2016, it was revealed that the team name would be the Vegas Golden Knights. After the team paid their expansion fees on March 1, 2017, the Vegas Golden Knights were officially able to start operating. Gerard Gallant was announced as the teams first Head Coach on April 13, 2017. On June 21, 2017, the Vegas Golden Knights participated in the 2017 NHL Expansion Draft at the T-Mobile Arena in Las Vegas. The Knights were able to select 1 player from each of the 30 teams in the NHL to join the Golden Knights. The Vegas Golden Knights played their first game on October 6th against the Dallas Stars. They won the game 2-1. The Golden Knights played their first home game at T-Mobile Arena on October 10, 2017 against the Arizona Coyotes. Before the game started, the team honoured the victims of the October 1 mass shooting that happened in Las Vegas just 9 days prior. The Golden Knights won the game 5-2. The Golden Knights had a very successful first season. The players on the Golden Knights played a lot better than people thought they would, so they got labelled as the \"Golden Misfits\". They won the Pacific Division with 109 points and made it to the playoffs. The Golden Knights played against the LA Kings in the first round of the 2018 Stanley Cup Playoffs. The Golden Knights won the series 4-0. Golden Knights goalkeeper, Marc-Andre Fleury, had 2 shutouts and only let in 3 goals total during the 4 games. In the second round, the Golden Knights played against the San Jose Sharks. Fleury had another 2 shutouts and the Knights won the series after 6 games. The Golden Knights then played against the Winnipeg Jets in the Western Conference Finals. After losing game 1, the Golden Knights won 4 games in a row to beat the Jets. The Golden Knights became the third team to ever make it to the Stanley Cup Finals in their first year. The only other teams to do it were the Toronto Arenas in 1918 and the St. Louis Blues in 1968. The Golden Knights ended up losing to the Washington Capitals in 5 games. === 2022-2023 Season and Stanley Cup Champions === During the off season, the Golden Knights fired head coach Pete DeBoer and hired Bruce Cassidy to take over. It was also announced that starting goaltender Robin Lehner would not be playing for the 2022-2023 season due to surgery. This led to the Golden Knights getting Adin Hill to be the backup goaltender to Logan Thompson (and eventually Laurent Brossoit). The Golden Knights had a very successful season despite injuries to Thompson, Hill, and Brossoit. Their captain, Mark Stone, also had injuries that forced him to sit out from mid January until April 18th. The Golden Knights finished the 2022-2023 season with a franchise record 111 points. They were first in the Western Conference and qualified for the Stanley Cup Playoffs for the 5th time in team history. In the first round of the Playoffs, the Golden Knights played against the Winnipeg Jets. After losing the first game in the series, the Golden Knights won 4 games in a row to win the series 4-1. With the Golden Knights moving on to the second round, they played against the Edmonton Oilers. During game 3 of the series, Brossoit – who was the Golden Knights starting goaltender at the time – got injured in the first period and Hill had to take over. Despite losing their starting goalie, the Golden Knights won the series in six games. The Western Conference Finals match up featured the Golden Knights vs. the Dallas Stars. The Golden Knights had a very strong start to the series, winning the first 3 games in a row. In the end, the Golden Knights won the series 4-2 to move on to the Stanley Cup Finals against the Florida Panthers. On June 13, 2023, after a big 9-3 victory in game 5 of the finals, the Golden Knights won their first Stanley Cup just 6 seasons after the team was created. They defeated the Florida Panthers 4 games to 1. The Golden Knights are the fastest expansion team in the NHL to win the Stanley Cup, beating the last record of 7 years set by the Philadelphia Flyers in 1974. ==References== ==Other websites== *Official Website Vegas Golden Knights",
 "title": "Vegas Golden Knights"
}