{
 "id": "562630",
 "text": "The Conquest of Malacca (Malaca conquistada) is an epic poem by Portuguese poet Francisco de Sá de Meneses. == General information == The Conquest of Malacca is an epic poem.J. G. de Casparis, 'The Conquest of Malacca. By Menses Francisco de Sa de. Translated by Knowlton Edgar C. Jr. Kuala Lumpur: University of Malaya Press, 1970. xxxiv. 234 pp. Glossaries. M $22.50', The Journal of Asian Studies, Volume 32, Issue 4 (August 1973), p. 748 It was published in 1634.Nicholas Tarling, The Cambridge History of Southeast Asia (Cambridge: Cambridge University Press, 1999), p. 199 It is one of the more noted Portuguese poem of the 17th century.Carroll Davidson Wright, The New Century Book of Facts (Springfield, MA: King-Richardson Company, 1909), p. 852 == Author == Francisco de Sá de Meneses was a poet of Baroque. He was born about 1600 and died in 1664.Francisco de Sá de Meneses. == Form == The poem is written in ottava rimaOttava rima at Encyclopaedia Britannica. (oitava-rima in Portuguese).Oitava-rima. In other words it is composed of stanzas of eight lines, rhymed abababcc. The same strophe was used earlier by Luís de Camões in The Lusiads. : Canto as armas e o grande Lusitano : Que, desde a ocidental extrema parte, : Aonde o Sol se levanta do oceano : Levou das Quinas santas o estandarte : E (castigado o pérfido tirano) : A cidade ganhou, por força e arte, : Do áureo reino, e trocou com pio exemplo : A profana mesquita em sacro templo. == Story == The poem by Francisco de Sá de Meneses tells about the batles of Malacca. The battle was fought in 1511. Portuguese forces, led by Afonso de Albuquerque, the governor of India, seized the city of Malacca. The city was a strong fortress. It controlled the strait of Malacca, which was the way to China. == Translation == The poem was translated into English by Edgar C. Knowlton, Jr. The book was published by University of Malaya Press in Kuala Lumpur in 1970.Francisco de Sa de Meneses, The Conquest of Malacca. Translated by Edgar C. Knowlton, Jr, Univeristy of Malaya Press, Kuala Lumpur 1970. == References == == Bibliography == * == Other websites == * Francisco de Sá de Meneses, Malaca conquistada at Bibliotecva Nacional de Portugal. Category:Epic poems Category:Portuguese poems Category:17th-century books Category:Malacca Category:1630s works",
 "title": "The Conquest of Malacca (epic poem)"
}