{
 "id": "562895",
 "text": "\"The Fall of Nineveh\" is a poem by English poet Edwin Atherstone (1788-1892).Edwin Atherstone at Bartleby.com. The Fall of Nineveh is a long poem. It consists of the Prelude and thirty books. It was published in parts between 1828 and 1868. It has more than six hundred pages and more than twenty thousand lines. Because of that it is one of the longest epic poems in English and European literature. Nineveh was the capital city of the Assyrian empire. It was really destroyed in 612 B.C. == Author == Edwin Atherstone was a romantic poet. He is forgotten now. He was the author of some poems, dramas and two novels, Sea kings in England and Handwriting on the Wall. == Form == The poem is written almost entirely in blank verse.Blank verse, poetic form at Encyclopaedia Britannica. This form, unrhymed iambic pentameter, is typical for long poems in English literature. It was introduced into English literature by Henry Howard, Earl of Surrey in 16th century. It was widely used in Elizabethan drama, for example by Thomas Kyd and William Shakespeare. In 17th century John Milton employed it in Paradise Lost. From that time blank verse prevails in English epic poems. From time to time the poet used alliteration:Alliteartion at Encyclopaedia Britannica. Thus in her pride of power I see her now;/Her swarming streets; her splendid festivals;/Her sprightly damsels (The Prelude). : But, to Assyria's king, no slumber came: : In storm and darkness was his spirit plunged. : Four days alone and speechless had he sat; : By his great grief, as by a heavy flood, : Borne down, and stunned. But, on that night, brief speech : With Salamenes had he held; and learned-- : Then first had learned--of that disastrous fight, : The dreadful whole. :: (Book Eighteen) == Sources == The poem is based on the strory written by Greek physician and historian Ctesias.Ctesias at Encyclopaedia Britannica. Lord Byron wrote a tragedy about Sandanapalus earlier. == Story == The poem narrates about a great war. It was a conflict between the Assyrian and the coallition of nations that had been conquered by them earlier. The Assyrian were ruled by Sardanapalus, king of Nineveh. He was a tyrant. All the nations around had to pay high taxes and send some soldiers to the king. They did not want to do it any longer. They started a war for independence. After many battles they won the whole war. They took the city of Nineveh, but it was destroyed by an earthquake. == Heroes == * Sardanapalus is the king of Nineveh. He is a strong man, but he has no character to be a leader of his nation. He wants only to drink with his women. He stays at home even when a battle lasts on the plain by the city. He is a great criminal, too. He ordered one hundred prisoners of war executed for a sacrifice to pagan gods. He was ready to offer his own daughter, too but she ran away. At last he burned his own palace and died inside, together with all his women. * ArbacesArbaces at Encyclopaedia Iranica is a Prince of Medes. He is a very strong and courageous man. He is very wise, too. * Belesis is a priest of Babylon. He believes strongly that Nineveh should be destroyed. He is a best friend of Arbaces. * Atossa is the queen of Niniveh. She is a wife of Sardanapalus and mother of Nehushta. When her husband left hist soldiers she took his armour and weapon, climbed his chariot and went to the battle. * Salamenes is the commander-in- chief of the Assyrian army. He is a brother of Atossa and brother-in-law of the king Sardanapalus. He is a good soldier and commander. After he died of wounds, there was nobody to defend the city against the Medes. == Reception == Edwin Atherstone's poems were never much appreciated by critics. Sometimes he was even called \"stupid\". == Translation == The Fall of Niniveh has not been probably translated in any language. There are only some fragments in Polish translation. == References == == Bibliography == * Edwin Atherstone, The Fall of Nineveh, Vol. 1. * Edwin Atherstone, The Fall of Nineveh, Vol. 2. == Further reading == * Herbert F. Tucker, Epic: Britain's Heroic Muse 1790-1910, Oxford University Press, Oxford 2008. == Other websites == * Edwin Atherstone's poems at PoemHunter. Category:Epic poems Category:19th-century British poems Category:1820s poems",
 "title": "The Fall of Nineveh (poem)"
}