{
 "id": "563243",
 "text": "Xeroderma pigmentosum is a rare genetic disorder. Ultraviolet (UV) light damages the DNA in skin cells. Normally the DNA damage is repaired. But if a person has a defective repair gene, the DNA is not repaired.James, William; Berger, Timothy; Elston, Dirk 2005. Andrews' Diseases of the Skin: Clinical Dermatology. 10th ed, Saunders, p574. == Consequences == This disease causes the skin to be sensitive to sunlight. A person with this disorder must always stay out of the sun, or they will get a sunburn. People with this disease are often called a \"Moon child\" because they can only go outside during the night. This disease is present in both genders and in all races, with one in 250,000 people living in the US having this disease. A Japanese person is about six times more likely to have this disease.Li, Lei 2007. Chapter 3 Nucleotide excision repair. In DNA repair, genetic instability, and cancer. World Scientific Publishing. pp. 75–76. This disorder is found in one in 250,000 people.Daya-Grosjean L. & Sarasin A. 2014. Mutat Res. 571(1-2): 43-56. People with xeroderma pigmentosum are about 1,000 times more likely to get skin cancer. There is no cure for xeroderma pigmentosum. The symptoms can be minimized if you do not go outside into sunlight. Fewer than 40% of individuals with the disease survive beyond the age of 20. Some XP victims with less severe cases do manage to live well into their 40s. People that have xeroderma pigmentosum are sensitive to UV light from the sun, and have dry, flaking skin and pigmented spots that can become skin cancer. Other symptoms include: * Sunburn when in sunlight. * Making of freckles at a young age * Skin cancer * Eyes that are sensitive to the sun and are irritated and clouded * Blistering of the skin * Limited growth of hair on the chest and legs * Dry, scaly skin The most important part of treatment is avoiding going into sunlight. You may have to wear protective clothes and wear sunscreen. == Technical note == XP can be caused by mutations in any one of eight genes. Seven of these genes help repair of ultraviolet-induced photoproducts.Stefanini M. & Kraemer KHK 2008. Xeroderma pigmentosum. In Neurocutaneous diseases. Edited by Ruggieri M, Pascual-Castroviejo I, Di Rocco C. Chapter 51: 771-792. == References == Category:Genetic disorders",
 "title": "Xeroderma pigmentosum"
}