{
 "id": "563456",
 "text": "::Puntland' is a province of Somalia Land of Punt is a name for a place found in Ancient Egyptian texts. At times it is also called Pwenet or Pwene.Ian Shaw & Paul Nicholson, The Dictionary of Ancient Egypt, British Museum Press, London. 1995, p.231. People from Ancient Egypt traded with this place from 6.000 BC. It was known for producing and selling gold, aromatic resins, blackwood, ebony, ivory, and wild animals. The region is known from ancient Egyptian texts because people went there to trade.Shaw & Nicholson, p.231. Some teachers of the bible think that it is the same as the biblical land of Put. At times Punt is called Ta netjer, the \"Land of the God\".Breasted, John Henry (1906–1907), Ancient Records of Egypt: Historical Documents from the Earliest Times to the Persian Conquest, collected, edited, and translated, with Commentary, p.433, vol.1 It is not known where exactly this place was. Most scholars today believe Punt was to the southeast of Egypt, most likely in the coastal region of what is today Somalia, Djibouti, Eritrea, northeast Ethiopia and the Red Sea coast of Sudan.Simson Najovits, Egypt, trunk of the tree, Volume 2, (Algora Publishing: 2004), p.258. However, some scholars point instead to other ancient writings which say Punt was in the Arabian Peninsula. It is also possible that the territory covered both the Horn of Africa and Southern Arabia. Puntland, the Somali administrative region at the edge of the Horn of Africa, is named in reference to the Land of Punt.Puntland profile, BBC News. https://www.bbc.com/news/world-africa-14114727 Inhabitants formed three groups which wore different clothing, and hairstyles. They held cattle and lived in stilt houses. Starting from the Nile a caravan could reach Punt in five days. ==Tomb== File:Punt2.JPG File:Punt3.JPG File:Punt4.JPG A tomb was discovered in the 19th century; however, it was neglected. In 2003, in response to concerns about its deterioration, it was cleaned by British Egyptologists and was found to contain an 22-line inscription with important historical significance.\"Elkab's hidden treasure\". Al-Ahram Weekly, 31 July-6 August 2003, Issue No. 649 The inscription was made with red paint on the doorway between the two internal chambers. It records a massive Nubian invasion, aided by peoples from the land of Punt and the Medjay, on the small and fragile 16th or 17th Dynasty city state of Thebes. Sobeknakht II claims to have strengthened El-Kab's defenses, got a fighting force, and launched a counter-attack, which was victorious due to the aid of the vulture-goddess Nekhbet A celebration is attended by an unnamed Egyptian king, and Sobeknakht endows the temple of Nekhbet with \"a new sacred barque worked in electrum.\" A vessel with Sobeknakht's name was discovered in Sudan, which seems to match the events depicted. It also hints that Sobeknakht's tomb had already been filled and finished by the time of the invasion, and that the red text was added as a late addition to reflect these new events in his life, the corridor being the only remaining space left. ==Egyptian expeditions to Punt== The earliest recorded Egyptian expedition to Punt was organized by Pharaoh Sahure of the Fifth Dynasty (25th century BC). Gold from Punt was in Egypt as early as the time of Pharaoh Khufu of the Fourth Dynasty., vol. 1. == Egyptian trade == There were more expeditions to Punt in the Sixth, Eleventh, Twelfth and Eighteenth dynasties of Egypt. In the Twelfth Dynasty, trade with Punt was celebrated in popular literature in the Tale of the Shipwrecked Sailor. In the Eighteenth Dynasty of Egypt, Hatshepsut built a Red Sea fleet to make it easier to trade between the head of the Gulf of Aqaba and south as far as Punt to bring mortuary goods to Karnak in exchange for Nubian gold. Hatshepsut personally made the most famous ancient Egyptian expedition that sailed to Punt. During the reign of Queen Hatshepsut in the 15th century BC, ships regularly crossed the Red Sea in order to get bitumen, copper, carved amulets, naptha and other goods transported overland and down the Dead Sea to Elat at the head of the gulf of Aqaba where they were joined with frankincense and myrrh coming north both by sea and overland along trade routes through the mountains running north along the east coast of the Red Sea.Dr. Muhammed Abdul Nayeem, (1990). Prehistory and Protohistory of the Arabian Peninsula. Hyderabad. ISBN. A report of that five-ship voyage can still be seen on reliefs in Hatshepsut's mortuary temple at Deir el-Bahri.Tyldesley, Hatchepsut, p.149 Throughout the temple texts, Hatshepsut \"maintains the fiction that her envoy\" Chancellor Nehsi, who is mentioned as the head of the expedition, had travelled to Punt \"in order to extract tribute from the natives\" who admit their allegiance to the Egyptian pharaoh.Tyldesley, Hatchepsut, p.147 In reality, Nehsi's expedition was a simple trading mission to a land, Punt, which was by this time a well-established trading post. Moreover, Nehsi's visit to Punt was not so brave since he was \"accompanied by at least five shiploads of [Egyptian] marines\" and greeted warmly by the chief of Punt and his immediate family. The Puntites \"traded not only in their own produce of incense, ebony and short-horned cattle, but [also] in goods from other African states including gold, ivory and animal skins.\" According to the temple reliefs, the Land of Punt was ruled at that time by King Parahu and Queen Ati., vol. 1. This well illustrated expedition of Hatshepsut occurred in Year 9 of the female pharaoh's reign with the blessing of the god Amun: The Egyptians were not good at travelling at sea. For them, the travel to Punt must have been similar to modern-day explorers travelling to the moon. But the reward of obtaining frankincense, ebony and myrrh clearly outweighed the risks.Tyldesley, Hatchepsut, p.148 Hatshepsut's 18th dynasty successors, such as Thutmose III and Amenhotep III continued the tradition of trading with Punt.Tyldesley, Hatchepsut, pp.145–146 The trade with Punt continued into the start of the 20th dynasty. Papyrus Harris I, a contemporary Egyptian document which detailed events that occurred in the reign of the early 20th dynasty king Ramesses III, includes an explicit description of an Egyptian expedition's return from Punt: After the end of the New Kingdom of Egypt period, Punt became \"an unreal and fabulous land of myths and legends.\"Tyldesley, Hatchepsut, p.146 ==Ta netjer== At times, the ancient Egyptians called Punt Ta netjer, meaning \"God's Land\"., vol. II. It was among the regions of the Sun God, that is, the regions in the direction of the sunrise, to the East of Egypt. These eastern regions' resources included products used in temples, notably incense. Older literature (and current non- mainstream literature) said that the label \"God's Land\" meant that the ancient Egyptians viewed the Land of Punt as their ancestral homeland. W. M. Flinders Petrie believed that the Dynastic Race came from or through Punt \"The Making of Egypt\" (1939) states that the Land of Punt was \"sacred to the Egyptians as the source of their race.\" and E. A. Wallis Budge said that \"Egyptian tradition of the Dynastic Period held that the aboriginal home of the Egyptians was Punt...\".Short History of the Egyptian People, by E. A. Wallis Budge. Budge stated that \"Egyptian tradition of the Dynastic Period held that the aboriginal home of the Egyptians was Punt...\" The term was not only applied to Punt, located southeast of Egypt, but also to regions of Asia east and northeast of Egypt, such as Lebanon, which was the source of wood for temples., vol. II. Queen Ati, shown in the reliefs of Hatshepsut, shows advanced Steatopygia, associated though not limited to Khoi-San people of East and South Africa. It has been suggested that this may be evidence of the survival of Khoi-San cultures since the Sangoan culture in North Eastern Africa prior to the arrival of Cushitic speaking cultures in the region.D.W. Phillipson. 2005. African archaeology, page 81 of 389 pages ==Location== The products of Punt (as they are shown in Hatshepsut's temple) are easily found in the Horn of Africa. They are less common or absent in Arabia. For this reason, most scholars think that Punt was in Northeast Africa. These products included gold and aromatic resins such as myrrh, frankincense, and ebony; the wild animals depicted in Punt included giraffes, baboons, Hippopotamus, and leopards. According to Richard Pankhurst: \"[Punt] has been identified with territory on both the Arabian and the Horn of Africa coasts. Consideration of the articles which the Egyptians obtained from Punt, notably gold and ivory, suggests, however, that these were primarily of African origin. ... This leads us to suppose that the term Punt probably applied more to African than Arabian territory.\"Hatshepsut's Temple at Deir El Bahari By Frederick Monderson Some scholars disagree with this view and point to a range of ancient inscriptions which locate Punt in Arabia. Dimitri Meeks has written that \"Texts locating Punt beyond doubt to the south are in the minority, but they are the only ones cited in the current consensus about the location of the country. Punt, we are told by the Egyptians, is – in relation to the Nile Valley – both to the north, in contact with the countries of the Near East of the Mediterranean area, and also to the east or south-east, while its furthest borders are far away to the south. Only the Arabian Peninsula satisfies all these indications.\"Dimitri Meeks – Chapter 4 – \"Locating Punt\" from the book Mysterious Lands\", by David B. O'Connor and Stephen Quirke. In 2010, a genetic study was conducted on the mummified remains of baboons that were brought back from Punt by the ancient Egyptians. Led by a research team from the Egyptian Museum and the University of California, the scientists used oxygen isotope analysis to examine hairs from two baboon mummies that had been preserved in the British Museum. One of the baboons had distorted isotopic data, so the other's oxygen isotope values were compared to those of modern-day baboon specimens. The researchers at first found that the mummies most closely matched modern specimens seen in Eritrea and Ethiopia as opposed to those in neighbouring Somalia, with the Ethiopian specimens \"basically due west from Eritrea\". The team did not have the opportunity to compare the mummies with baboons in Yemen. The scientists believed that such an analysis would yield similar results since, according to them, regional isotopic maps suggest that baboons in Yemen would closely resemble those in Somalia. Professor Dominy, one of the lead researchers, concluded from this that \"we think Punt is a sort of circumscribed region that includes eastern Ethiopia and all of Eritrea.\"Owen Jarus , In 2015, the scientists conducted a followup study to confirm their initial findings, and concluded that \"our results reveal a high likelihood match with eastern Somalia and the Eritrea-Ethiopia corridor, suggesting that this region was the source of Papio hamadryas exported to Ancient Egypt.\" Egyptian spelling \"pwenet\" it should be noted that the feminine \"t\" ending was not pronounced during the New Kingdom the last sign is the determinative for country, land Wall relief Huts as in relief ==Notes== ==References== * . * . * * Fattovich, Rodolfo. 1991. \"The Problem of Punt in the Light of the Recent Field Work in the Eastern Sudan\". In Akten des vierten internationalen Ägyptologen Kongresses, München 1985, edited by Sylvia Schoske. Vol. 4 of 4 vols. Hamburg: Helmut Buske Verlag. 257–272. * ———. 1993. \"Punt: The Archaeological Perspective\". In Sesto congresso internazionale de egittologia: Atti, edited by Gian Maria Zaccone and Tomaso Ricardi di Netro. Vol. 2 of 2 vols. Torino: Italgas. 399–405. * Herzog, Rolf. 1968. Punt. Abhandlungen des Deutsches Archäologischen Instituts Kairo, Ägyptische Reihe 6. Glückstadt: Verlag J. J. Augustin. * * . * . * . * O'Connor, David (1994), Ancient Nubia: Egypt's Rival in Africa, University of Pennsylvania Press, pp. 41–44. * Wicker, F. D. P. (July, 1998), \"The Road to Punt\", The Geographical Journal. Vol. 164, no. 2. 155-167 ==Older literature== * Johannes Dümichen: Die Flotte einer ägyptischen Königin, Leipzig, 1868. * Wilhelm Max Müller: Asien und Europa nach altägyptischen Denkmälern, Leipzig, 1893. * Adolf Erman: Life in Ancient Egypt, London, 1894. * Édouard Naville: \"Deir-el-Bahri\" in Egypt Exploration Fund, Memoirs XII, XIII, XIV, and XIX, London, 1894 et seq. * James Henry Breasted: A History of the Ancient Egyptians, New York, 1908. ==Other websites== * The Land of Puntwith quotes from Breasted (1906) and Petrie (1939) * Queen Hatasu, and Her Expedition to the Land of Punt by Amelia Ann Blanford Edwards (1891) * Deir el-Bahri: Mortuary Temple of Hatshepsut * Hall of Punt at Deir el-Bahri; and Where was Punt? discussion by Dr. Karl H. Leser * Queen of Punt syndrome ===News reports on Wadi Gawasis excavations=== * Archaeologists discover ancient ships in Egypt (Boston University Bridge, 18 March 2005). Excavations at Wadi Gawasis, possibly the ancient Egyptian port Saaw. * Remains of ancient Egyptian seafaring ships discovered (New Scientist, 23 March 2005). * Sailing to distant lands(Al Ahram, 2 June 2005). * Ancient ship remains are unearthed(Deutsche Press Agentur, 26 January 2006). * 4,000-year-old shipyard unearthed in Egypt (MSNBC, 6 March 2006). Category:Ancient Egypt",
 "title": "Land of Punt"
}