{
 "id": "563594",
 "text": "Thomas Edmunds \"Tom\" Price (born October 8, 1954) is an American physician and politician. He is the 23rd United States Secretary of Health and Human Services serving from February 10, 2017 to September 29, 2017. Price was U.S. Representative for , serving from 2005 through 2017. He is a member of the Republican Party. He formerly served as chairman of the Republican Study Committee and the Republican Policy Committee. ==Early life== Price was born in Lansing, Michigan. He was raised in Dearborn, Michigan. He studied at the University of Michigan, Ann Arbor. He moved to Atlanta, Georgia in the 1980s. ==United States representative (2005-2017)== Price served as a United States representative from 2005 through 2017. Price's district served the northern suburbs of Atlanta. Price served as chairman of the House Budget Committee. ==United States Secretary of Health and Human Services (2017)== On November 29, 2016, it was announced that Price would be nominated for Secretary of Health and Human Services by President-elect Donald Trump when he takes office. On February 1, 2017, the Senate Health, Education, Labor, and Pensions Committee approved his nomination by a vote of 11-0 with all Democrats boycotting the vote, sending the nomination to the Senate floor. On February 10, the Senate confirmed Price in an 52-47 vote. In March 2017, Price endorsed the American Health Care Act, a bill proposed by House Republicans that would repeal the individual mandate and make several other major changes to the Patient Protection and Affordable Care Act. In a series of reports in September 2017, Politico reported that since May 2017, Price had expended more than $1 million of Department funds for his own travel on private charter jets and military aircraft. Many of the flights were between cities that are easily accessible by train or car and have frequent, low-cost commercial airline service. On September 29, 2017, Price resigned, becoming the shortest tenured Secretary of Health and Human Services. ==Personal life== Price is married to Betty Price. They have one son together. Price is a Presbyterian. ==References== ==Other websites== * Congressman Tom Price official House site * * Category:1954 births Category:Living people Category:American physicians Category:People from Dearborn, Michigan Category:People from Lansing, Michigan Category:Politicians from Michigan Category:United States representatives from Georgia Category:United States Secretaries of Health and Human Services Category:Republican Party (United States) politicians",
 "title": "Tom Price"
}