{
 "id": "563596",
 "text": "James Norman Mattis (born September 8, 1950) is a retired United States Marine Corps general and was the 26th United States Secretary of Defense. On January 20, 2017, the United States Senate confirmed Mattis' nomination as Defense secretary with a 98-1 vote. He last served as the 11th Commander of United States Central Command from August 11, 2010 to March 22, 2013. On December 20, 2018, Mattis announced his plans to retire on February 28, 2019. However after reading his resignation letter criticizing Trump's treatment of American allies, Trump ordered Mattis fired on December 31, 2018. ==Early life== Mattis was born on September 8, 1950, in Pullman, Washington. He was raised in Richland, Washington. Mattis earned a BA degree in history from Central Washington University in 1971. ==Military career== Mattis is known for carrying out the COIN strategy. Before President Obama appointed him to replace General Petraeus on August 11, 2010, he commanded United States Joint Forces Command from November 9, 2007 to August 2010 and served as NATO's Supreme Allied Commander Transformation from November 9, 2007 to September 8, 2009 at the same time. Prior to that, he commanded I Marine Expeditionary Force, United States Marine Forces Central Command, and 1st Marine Division during the Iraq War. ==United States Secretary of Defense (2017-2018)== On December 1, 2016, President-elect Donald Trump announced that Mattis would be nominated to serve as United States Secretary of Defense in the coming administration. He was confirmed by the United States Senate with a 98-1 vote. On the same day, he was sworn-in by Vice President Mike Pence. On April 5, 2017, Mattis called the Khan Shaykhun chemical attack \"a heinous act\" and said it would be treated accordingly. On April 10, Mattis warned the Syrian government against using chemical weapons again. Mattis has voiced support for a Saudi Arabian–led military campaign against Yemen's Shiite rebels. He asked Trump to remove restrictions on U.S. military support for Saudi Arabia. Mattis insisted that the U.S. would remain in Syria following the defeat of ISIS to ensure they did not regroup. However, Trump announced the U.S. withdrawal from Syria on December 19. The next day, Mattis submitted his resignation after failing to persuade Trump to reconsider. In his resignation letter, Mattis criticized Trump for not respecting allied nations while criticizing China and Russia's authoritarian rule. In response to the letter, Trump ordered Mattis' firing on January 1, nearly two months earlier than Mattis planned leaving office. ==Personal life== Mattis is a lifelong bachelor who has never been married and has no children. He is nicknamed \"The Warrior Monk\" because of his bachelor life and lifelong devotion to the study of war. ==References== ==Other websites== * Official Marine Corps biography * * James Mattis Sworn in As US Secretary of Defense * Department of Defense biography * Official Marine Corps biography * * Category:1950 births Category:Living people Category:American generals Category:Independent politicians in the United States Category:Politicians from Washington (state) Category:United States Secretaries of Defense Category:Military people from Washington (state) Category:United States Marine Corps personnel",
 "title": "James Mattis"
}