{
 "id": "563593",
 "text": "Elaine Lan Chao-McConnell (; born March 26, 1953)Ancestry.com. U.S. Public Records Index, Volume 1 [database on-line]. Provo, UT: Ancestry.com Operations, Inc., 2010. Original data: Voter Registration Lists, Public Record Filings, Historical Residential Records, and Other Household Database Listings is an American politician. She was the 18th United States Secretary of Transportation from January 31, 2017 to January 11, 2021 during the Donald Trump administration. She served as the 24th United States Secretary of Labor under President George W. Bush from 2001 to 2009, and Deputy Secretary of Transportation under President George H. W. Bush. She was the first Asian- American woman and the first Taiwanese American in U.S. history to be appointed to a U.S. president's cabinet.\"Press Briefing by Administration Officials on American Competitiveness Initiative\", (February 1, 2006), retrieved February 25, 2009 ==Early life== Chao was born in Taipei, Taiwan.First Taiwan-born US Cabinet member revisits her roots on Taipei visit , Formosa Television News, 2014/11/14 Her parents were Ruth Mulan Chu Chao (1930–2007) and James S. C. Chao (born 1927). Her parents immigrated to the United States in 1961. She studied at Mount Holyoke College in Massachusetts and at Harvard University. ==United States Secretary of Labor (2001–2009)== Chao was the only cabinet member in the George W. Bush administration to serve for the entirety of his eight years. She was also the longest-serving Secretary of Labor since Frances Perkins, who served from 1933 to 1945, under President Franklin D. Roosevelt. == United States Secretary of Transport (2017–2021) == On November 29, 2016, it was announced that President-elect Donald Trump planned to nominate Chao for Secretary of Transportation when he takes office. On January 31, 2017, the United States Senate confirmed Chao's nomination with a 93-6 vote. She assumed office on the same day, with Vice President Mike Pence swearing her in. Following the 2021 United States Capitol attack, Chao announced her resignation as Secretary of Transportation on January 7, 2021. She resigned on January 11, 2021. ==Personal life== Chao is married to Senate Minority Leader Mitch McConnell of Kentucky. ==References== ==Other websites== * * Heritage Foundation profile * * Elaine Chao history at Department of Labor * Elaine Chao Video produced by Makers: Women Who Make America * msb.georgetown.edu Category:1953 births Category:Living people Category:Harvard University alumni Category:Naturalized citizens of the United States Category:Politicians from Kentucky Category:Businesspeople from Kentucky Category:Taiwanese businesspeople Category:United States Secretaries of Labor Category:United States Secretaries of Transportation Category:Republican Party (United States) politicians",
 "title": "Elaine Chao"
}