{
 "id": "56361",
 "text": "Ocean surface waves are surface waves that occur in the upper layer of the ocean. They usually result from wind. Some are made by geologic effects like earthquakes or vulcanicity and may travel thousands of miles before striking land. They range in size from small ripples to huge tsunamis. There is little actual forward motion of individual water particles in an unbroken wave, despite the large amount of energy and momentum it may carry forward. When a wave hits shallow water, it \"breaks\" because the bottom moves more slowly than the top. The vast majority of large breakers that one sees on a coastal beach result from distant winds. Three factors influence the formation of these \"wind waves\": * Wind speed * Distance of open water that the wind has blown over. * Length of time the wind has blown over a given area. All of these factors work together to determine the size and shape of ocean waves. The greater each of the variables, the larger the waves. Waves are measured by: * Height (from trough to crest) * Wavelength (from crest to crest) * Period (time interval between arrival of consecutive crests at a stationary point) Waves in a given area typically have a wide range of sizes. For weather reporting and for scientific analysis of wind wave statistics, their size over a period of time is usually expressed as \"significant wave height.\" This figure represents the average height of the highest one-third of the waves in a given time period (usually twelve hours) or in a specific storm system or event. Given the variability of wave size, the largest individual waves are likely to be twice the reported significant wave height for a particular day or storm. ==Related pages== * Tidal power * Wave power == References == * \"Anatomy of a Wave\" Holben, Jay boatsafe.com captured 5/23/06 * Carr, Michael \"Understanding Waves\" Sail Oct. 1998: 38-45. * Rousmaniere, John. The Annapolis Book of Seamanship, New York: Simon & Schuster 1989 * National Weather Service == Other websites == * Introductory oceanography chapter 10 - Ocean Waves * Understanding waves waves, storm, tsunamis, seiches, bores, deadwater, etc. (18pp) * HyperPhysics - Ocean Waves * SHOM - in French * Water Waves Wiki * Wave equation * Waverider Buoys for South East Queensland * Costalwatch.com : Australian Wave Prediction for Surfers Website Category:Oceanography",
 "title": "Ocean surface wave"
}