{
 "id": "563785",
 "text": "The Bridge is a long poem by American author Hart Crane. The work was published for the first time in 1930.Hart Crane (1899-1933) It was intended by the poet to be a modern epic poem. The poem has fifteen parts. Many of them are about New York City. The best-known part of the poem is its introductory part named To Brooklyn Bridge. The Bridge is considered to be Hart Crane's most ambitious undertaking.Harold Bloom (ed.), Hart Crane, p. 75 It is sometimes, however, called a failure, too. Hart Crane is a modern poet. But in this poem he used For National Poetry Month: Hart Crane’s “To Brooklyn Bridge” by Bryan Waterman mostly iambic pentameter. This iambic pentameter is usually unrhymed (blank verse), but sometimes rhymed. And Thee, across the harbor, silver paced As though the sun took step of thee yet left Some motion ever unspent in thy stride,— Implicitly thy freedom staying thee! Hart Crane is known for his attention to the sounds of language.Sacvan Bercovitch, Cyrus R. K. Patell, The Cambridge History of American Literature: Volume 5, Poetry and Criticism p. 290. He used alliteration, rhymes and internal assonance.Edward Brunner, Splendid Failure: Hart Crane and the Making of The Bridge, p. 91. The assonance, that is repeating of the same vowel, can be found in this strophe. The sound [i] occurs in many accented syllables in it. How many dawns, chill from his rippling rest The seagull’s wings shall dip and pivot him, Shedding white rings of tumult, building high Over the chained bay waters Liberty — Alliteration, that is repeating of the same consonant, should be noticed in the next strophe. O harp and altar, of the fury fused, (How could mere toil align thy choiring strings!) Terrific threshold of the prophet’s pledge, Prayer of pariah, and the lover’s cry, == References == == Other websites == * Percy Hutchinson, Hart Crane's Cubistic Poetry in 'The Bridge' * Pu Zhao, A Short Comment on Hart Crane’s Poem To Brooklyn Bridge Category:Epic poems Category:20th-century American poems Category:1930 works",
 "title": "The Bridge (poem)"
}