{
 "id": "563821",
 "text": "Street cricket or backyard cricket, commonly referred to as Gully (Hindi:गली, meaning Alley) Cricket, is an informal version of the game of cricket. It is played in many countries by people of all types and ages. It is played in gardens, back yards, on the street, in parks, car parks, beaches and other places. The rules get adapted to local conditions. They play with bat or bat like wood and use any kind of ball like plastic, sponge, paper and others. == Overview == Street cricket sometimes uses rules from similar games, like baseball. For example, a batter who is out of his/her ground (safe area, like a base) can be touched by an opponent holding the ball to be tagged out, or the opponent might put a foot on the wicket while holding the ball to run out a batter, which is similar to a force out. ==South American versions== ===Bete-ombro=== Bete-ombro, also known as tacobol, bets, or pau na lata, is a Brazilian form of street cricket. There are two teams of two players, one which has the bat, and the other having the ball, and there are two wickets (often bottles). There are no 4s or 6s, and only the bat can be used to avoid runouts and stumpings. A player from one team throws the ball from one wicket to the other, while a player from the other team holding a bat stands at the other wicket. The batter can hit the ball and then run between the wickets to score runs, while his partner does the same but crossing him. If the ball is thrown at a wicket before a player from the batting team gets to it, then the teams swap. ===Plaquita=== \"La plaquita\" or \"la placa\" is a similar game from the Dominican Republic. It involves two teams of two players, and two wickets (which can be license plates, known as \"placas\" in Spanish). Players from one team run between the wickets to score runs, but can't score anymore if the wicket is hit with the ball when that team's players are too far away from the wicket. === Bat-en-bal === Bat-en-bal is played in Suriname, with only one set of stumps. ==References== Category:Minor forms of cricket",
 "title": "Street cricket"
}