{
 "id": "56399",
 "text": "Desalination means any process that removes the excess salt and other minerals from water in order to obtain fresh water suitable for animal consumption or irrigation. Most desalination is by distillation. Some is by reverse osmosis or other methods. The main purpose is to make water for people to use. The salt is usually carried away as brine but in some places the solid salt is extracted. Desalination of brackish water is done in the United States in order to meet treaty obligations for river water entering Mexico. Several Middle Eastern countries have energy reserves so great that they use desalinated water for agriculture. Saudi Arabia's desalination plants account for about 24% of total world capacity. The world's largest desalination plant is the Jebel Ali Desalination Plant (Phase 2) in UAE. It uses multi-stage flash distillation, dual-purpose and it is capable of producing 300 million cubic meters of water per year. ==Methods== #Distillation ##Multi-stage flash (MSF) ##Multiple-effect (MED|ME) ##Vapor compression (VC) ##Evaporation/condensation #Membrane processes ##Electrodialysis reversal (EDR) ##Reverse osmosis (RO) ##Nanofiltration (NF) ##Forward osmosis (FO) ##Membrane distillation (MD) #Cold (freezing) #thermal #Solar humidification #Methane hydrate crystallisation #High grade water recycling The traditional process used in these operations is vacuum distillation — essentially the boiling of water at less than atmospheric pressure, and thus a much lower temperature than normal. Due to the reduced temperature, energy is saved. ==References== == Other websites == * Middle East Desalination Research Centre * Encyclopedia of Desalination and water and Water Resources * Global Water Intelligence - monthly newsletter featuring 'Desal Project Tracker' * Water Desalination Report - weekly newsletter on international desal * International Desalination Association * Desalination & Water Reuse - Official magazine of the International Desalination Association * European Desalination Society * IAEA - Nuclear Desalination * German Desalination Society - DME * Geothermal Desalination * SDSU (San Diego State University) Center for Information Technology and Infrastructure (CITI) International Consortium of Advanced Technologies and Security * \"Desalination Journal\" and Desalination Directory of the European Desalination Society *Desalination by humidification and dehumidification of air: state of the art * Zonnewater - optimized solar thermal desalination (distillation) * SOLAR TOWER Project - Clean Electricity Generation for Desalination. * Solar Desalination using the MEH-Method * Article: Water issues prompt new look at desalination * Desalination bibliography Library of Congress * Water-Technology *Water Desalination Worldewide, Market, Technologies and Companies *Cheap Drinking Water from the Ocean - Carbon nanotube-based membranes will dramatically cut the cost of desalination *BBC2 Newsnight Film: Israel build the world's largest desalination plant *Solar thermal-driven desalination plants based on membrane distillation *Encyclopedia of Water Sciences, Engineering and Technology Resources Category:Water",
 "title": "Desalination"
}