{
 "id": "564180",
 "text": "Turkish Airlines Flight 981 was a regular flight operated by Turkish Airlines, from Istanbul to London Heathrow, with a stopover in Paris. On 3 March, 1974, the McDonnell Douglas DC-10 operating the flight suffered an explosive decompression and crashed into the Ermenonville Forest, shortly after it had left Paris, killing all 346 people on board. An investigation after the crash found out that one of the cargo doors at the rear of the aircraft was not properly closed and secured. After takeoff, part of the door broke off and caused an explosion in the rear of the aircraft. The explosion also damaged cables needed to fly the aircraft. This meant that after the explosion, the aircraft was uncontrollable. == Earlier issues == A McDonnell Douglas DC-10, flying as American Airlines Flight 96, had experienced an explosive decompression in the aft cargo hold in June 1972. American Airlines Captain McCormick had managed to land the plane safely. On the ground, it was discovered the rear cargo door had opened in flight. This caused damage to the fuselage, but not the explosive damage in the case of Turkish Flight 981. The two planes were also configured differently above the baggage compartment. There were three rows of extra seats added to TC-JAV, which added a greater overall load to the floor. When the cargo door blew out, the additional seats and passengers were ejected from the plane. Both flights experienced uncontrolled explosive decompression when the cargo door latches failed. An Airworthiness Directive was immediately issued by the Federal Aviation Administration (FFA), calling for strengthening the load floor and control cables. It also required improving the electrical wiring having to do with the cargo door, so that if the cargo door was not closed properly, the light in the cockpit indicating that the door was still open would stay lit. == Crew == The pilot in command was Nejat (or Mejat) Berkoz, age 44, a former Turkish Air Force pilot. He had a total of 7,783 flight hours, and had been with Turkish Airlines for six years. He also had flown the Fokker F27 and the McDonnell Douglas DC-9. The First Officer was Oral Ulusman, age 38. He had been with Turkish Airlines for five years at the time of the accident, with a total of 5,589 flight hours. The Flight Engineer was Huseyin Ozer, age 37, he had 2,113 flight hours at the time of the accident. The cabin consisted of eight flight attendants. == Accident == TK981 was scheduled to fly from Istanbul to London Heathrow, with a stop in Paris Orly airport. The first leg from IST to ORY went smoothly, with a flying time of four hours. While the ORY-LHR leg usually did not attract many passengers, an ongoing strike by British European Airlines employees meant that the economy cabin was full, with the aircraft originally 167 passengers and 11 crew members for the first leg, 50 disembarked, and 218 more pasengers boarded. The flight departed at 12:32 PM local time. ATC cleared the aircraft to 6,000 initially, then up to FL230 within 2 minutes of leveling off. Shortly after 1140 hrs, when Turkish Airlines flight TK981 had reached 12,000 (roughly 3,700 m) feet during climb, the Air Traffic Control recorded a transmission in the Turkish language, partly covered by heavy background noise and accompanied by the pressurization warning and then the overspeed warning; and at the same time, the aircraft radar return split in two and the secondary radar label disappeared. The flight was over Coulommiers, France at the time. A rapid decompression caused the last two rows of seats to be sucked through a large hole in the plane. The loss of the rear left cargo door caused a huge pressurization difference with the cabin right above it. This section was ripped off the aircraft, along with the six passengers seated there. However, the loss of the door resulted in pilots losing access to critical parts of the plane, including the rudder, elevator, and engine two. The six passengers in the seats were killed when they fell into a turnip field in St. Pathus. The plane remained in the air another 70 seconds while the pilots tried to regain control, unsuccessfully. The aircraft's pitch angle gradually decreased to negative 20 degrees in the next 20 seconds after the explosion, resulting in the aircraft accumulating a massive amount of airspeed during its quick descent. In the final 15 seconds, the aircraft's descent rate began to decrease as the nose raised as a result of the aircraft's high speed. The pilots pushed the throttles forward to TO/GA in a last ditch effort to save the aircraft, calling out \"Speed, speed!\" The aircraft hit the tree tops at about 434 knots (500 mph; 800 km/h) at a negative 4 degree pitch angle; the wings broke up, spilling, igniting fuel and exploding, killing everyone on board. The plane almost completely disintegrated leaving only 40 bodies intact. == Investigation == The investigation sparked blame on Turkish Airlines and Douglas itself since both were at fault for different parts of the crisis. The airline had failed to station an engineer on the ground and had reportedly rushed the training process for the DC-10. However, McDonnell-Douglas knew about the flaws with the door design and an NTSB directive after a similar incident had not been implemented. TK981 went on to become the deadliest single aircraft crash for over a decade, until the crash of Japan Airlines Flight 123 in 1985, which became the single deadliest aircraft disaster, holding a death toll of 520. The aftermath saw several design changes to the DC-10 to prevent such crashes and renewed scrutiny of the design process. The accident was the result of the ejection in flight of the aft cargo door on the left-hand side: the sudden depressurization which followed led to the disruption of the floor structure, causing six passengers and parts of the aircraft to be ejected, rendering No 2 engine inoperative and impairing the flight controls (tail surfaces) so that it was impossible for the crew to regain control of the aircraft. The underlying factor in the sequence of events leading to the accident was the incorrect engagement of the door latching mechanism before take-off. The characteristics of the design of the mechanism made it possible for the vent door to be apparently closed and the cargo door apparently locked when in fact the latches were not fully closed and the lock pins were not in place. It should be noted, however, that a view port was provided so that there could be a visual check of the engagement of the lock pins. This defective closing of the door resulted from a combination of various factors: * incomplete application of Service Bulletin 52-37; * incorrect modifications and adjustments which led, in particular, to insufficient protrusion of the lock pins and to the switching off of the flight deck visual warning light before the door was locked; * the circumstances of the closure of the door during the stop at Orly, and, in particular, the absence of any visual inspection, through the view port, to verify that the lock pins were effectively engaged, although at the time of the accident inspection was rendered difficult by the inadequate diameter of the view port. Finally although there was apparent redundancy of the flight control systems, the fact that the pressure relief vents between the cargo compartment and the passenger cabin were inadequate and that all the flight control cables were routed beneath the floor placed the aircraft in grave danger in the case of any sudden depressurization causing substantial damage to that part of the structure. All these risks had already become evident, nineteen months earlier, at the time of the Windsor accident, but no efficacious corrective action had followed. ==Passengers and Crew== Nation Number United Kingdom 177 Turkey 56 Japan 48 United States 25 France 16 Brazil 5 Canada 4 Argentina 3 Australia 2 India 2 Belgium 1 Cyprus 1 Germany 1 Ireland 1 Morocco 1 New Zealand 1 Pakistan 1 Senegal 1 Spain 1 Sweden 1 Switzerland 1 Vietnam 1 Total 346 Of the 346 people on-board, 177 passengers came from the United Kingdom, 48 came from Japan, 45 passengers and 11 crew members came from Turkey, 25 came from the United States, 16 came from France, 10 were from Italy, 9 from Thailand, 7 from Austria, 6 from China, 5 from Hong Kong and Brazil, 4 from Canada, 3 from Argentina, Portugal, Taiwan, and Yugoslavia, 2 from Australia, Hungary, India, Mexico, the Philippines, South Korea, Singapore, and 1 from Belgium, Cyprus, West Germany, Greece, Iran, Israel, Ireland, Morocco, the Netherlands, New Zealand, Pakistan, Portugal, Senegal, South Africa, Spain, Sweden, Switzerland and South Vietnam. ==Notes== == References == == Other websites == * Plane Crash Turkish Airlines flight 981 Dc 10; YouTube Category:1974 in Europe Category:1970s in France Category:Aviation accidents and incidents in the 1970s Category:Aviation accidents and incidents in Europe Category:Oise",
 "title": "Turkish Airlines Flight 981"
}