{
 "id": "56416",
 "text": "A fraction is a number that shows how many equal parts there are. When we write fractions, we show one number with a line above (or a slash next to) another number. For example, \\tfrac{1}{4}, and 1/4.are different ways of writing the same fraction (in this case a quarter). The top number tells us how many parts there are, and the bottom number tells us the total number of parts. == Numerators and denominators == The top part of a fraction (example: 1/4) is a numerator. Numerators can be any real numbers. The numerator can be on the top or to the left when writing fractions. The bottom part of a fraction (example: 1/4) is called a denominator. This number cannot be zero. It is on the bottom or on the right when writing fractions. A proper fraction is a fraction with the numerator smaller than the denominator. An improper fraction is a fraction where the numerator is bigger than the denominator. For example, \\tfrac{1}{4} is a proper fraction, and \\tfrac{5}{4} is an improper fraction. ==Examples of fractions== #A room where \\tfrac{1}{4} of the people are girls, has 1 girl for every 4 people. #A cake can be thought of as being made up of 4 equal parts, where each is 1 part of 4. This can be written as \\tfrac{1}{4}, and is called a \"quarter\". Similarly, 2 parts of the cake (2 quarters) can be written \\tfrac{2}{4}, which is also equal to 1/2 (one-half). == Mathematical fractions == A fraction is a mathematical expression relating two quantities or numbers, where one divides the other. When the two quantities are whole numbers (or integers), this is called a rational number (such as the fraction \\tfrac{1}{2}). When the two quantities are polynomials, this is called a rational function. Fraction table 1/2 2/3 3/4 4/5 5/6 6/7 7/8 8/9 9/10 10/11 11/12 12/13 13/14 14/15 15/16 16/17 17/18 18/19 19/20 20/21 21/22 22/23 23/24 24/25 25/26 26/27 27/28 29/30 30/31 32/33 33/34 34/35 35/36 36/37 37/38 38/39 39/40 40/41 42/43 43/44 44/45 45/46 46/47 47/48 48/49 49/50 50/51 51/52 52/53 53/54 54/55 55/56 56/57 57/58 58/59 59/60 60/61 61/62 62/63 64/65 65/66 66/67 68/69 69/70 70/71 71/72 72/73 73/74 74/75 75/76 76/77 77/78 78/79 79/80 80/81 81/82 82/83 83/84 84/85 85/86 86/87 87/88 88/89 89/90 Mathematically, a fraction is a quotient of numbers, representing the number's value when the numerator (upper number) is divided by the denominator (lower number). Thus \\tfrac{1}{2} means one divided by two, or, in decimals, 0.5. To find \\tfrac{1}{2} of \\tfrac{1}{2}, the denominators are multiplied, and because denominator 2 multiplied by 2 equals 4, we have that \\tfrac{1}{2} x \\tfrac{1}{2} = \\tfrac{1}{4}, or 0.5 x 0.5 = 0.25. (In this case, “\\tfrac{1}{2} of” means \"multiplication\".) To find \\tfrac{1}{2} divided by \\tfrac{1}{2}, multiply \\tfrac{1}{2} by the reciprocal of \\tfrac{1}{2}, which is 2. That answer is 1. == Multiplying == To multiply two fractions, the first numerator is multiplied by the other numerator, and the first denominator is multiplied by the other denominator. For example. x = . One can simplify this by dividing both numbers by a common factor. This would be after the simplification. == Related pages == * Algebraic fraction * Egyptian fraction * Mixed number * Ratio == References == == Other websites == * Curricula for Creating Fractions * Interactive and dynamic worksheets to visualize fractions * Worksheets: Identifying Fractions * Worksheets: Improper Fractions to Mixed Numbers * Curricula for Teaching about Equivalent Fractions * Free online quizzes about Fractions * Printable fraction worksheets for elementary grades.",
 "title": "Fraction (mathematics)"
}