{
 "id": "564121",
 "text": "Raising Hope is an American sitcom. It aired from September 21, 2010, to April 4, 2014, on Fox. The show aired during prime time, a block of television viewing time in the peak evening hours. The show averaged over 6 million viewers per episode in the first season. The show was also broadcast internationally. It aired in Australia, Canada, Czech Republic, Finland, Germany,, Italy, Portugal, and the United Kingdom. It was broadcast by I.Sat in Latin America. ==Awards and nominations== Awards and nominations for Raising Hope Year Award Category Recipients Outcome 2010 Satellite Awards Best Television Series – Comedy or Musical Raising Hope Jamison Awards Favorite Avery Laugh Award 2011 Casting Society of America Outstanding Achievement in Casting – Television Pilot – Comedy Dava Waite Emmy Awards Outstanding Lead Actress in a Comedy Series Martha Plimpton Outstanding Guest Actress in a Comedy Series Cloris Leachman People's Choice Awards Favorite New TV Comedy Raising Hope Satellite Awards Best Actress in a TV series – Comedy or Musical Martha Plimpton Teen Choice Awards Choice TV – Breakout Show Raising Hope Television Critics Association Awards Outstanding Achievement in Comedy Critics' Choice Television Award Best Actress in a Comedy Series Martha Plimpton Young Artist Awards Best Performance in a TV Series – Recurring Young Actress 11–16 Kelly Heyer 2012 Motion Picture Sound Editors Best Sound Editing – Music for Short Form Television Sharyn M. Tylk and Susan Ham Young Artist Awards Best Young Actress Recurring in a Television Series Kelly Heyer Critics' Choice Television Award Best Comedy Actress Martha Plimpton Best Comedy Actor Garret Dillahunt Emmy Awards Outstanding Original Music and Lyrics Matthew Thompson ==References== ==Other websites== * Category:American sitcoms Category:2010s American television series Category:2010 American television series debuts Category:English-language television programs",
 "title": "Raising Hope"
}