{
 "id": "564204",
 "text": "Saint-Dizier is a commune of France, and a subprefecture of the Haute-Marne department in the Grand Est region. ==Geography== The city of Saint-Dizier is on the northern part of the Haute-Marne department in northeast France near the Meuse and the Marne departments. It has an area of . Its average altitude is ; at the city hall, the altitude is . Distance from Saint-Dizier to other cities Paris Strasbourg Bordeaux Toulouse Montpellier Lyon Nantes Marseille Saint-Dizier and its neighboring communes The commune of Saint-Dizier is surrounded by the communes Trois-Fontaines-l'Abbaye, Chancenay, Bettancourt- la-Ferrée, Ancerville (Meuse department), Chamouilley, Eurville-Bienville, Troisfontaines-la-Ville, Humbécourt, Laneuville-au-Pont, Moëslains, Valcourt, Hallignicourt and Villiers-en-Lieu. Two rivers flow through the city: the Ornel and the Marne. The city is at about from Lac du Der-Chantecoq, the largest man-made lake of Western Europe. ===Climate=== The Köppen climate classification type for the climate at Saint-Dizier is a \"Marine West Coast Climate\" and of the subtype \"Cfb\". The average amount of precipitation for the year is and the average temperature for the year is . ==Population== The inhabitants of Saint-Dizier are known, in French, as Bragards (women: Bragardes) or Bragars (women: Bragares). The city of Saint- Dizier has a population, in 2014, of 25,505; it is the commune of Haute-Marne with more people living in it, even more than Chaumont (22,560 inhabitants) that is the prefecture of the department. Its population density is of inhabitants/km2. Evolution of the population in Saint-Dizier Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:373 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:40000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:5000 start:0 ScaleMinor = gridcolor:lightgrey increment:2500 start:0 BackgroundColors = canvas:sfondo BarData= bar:1968 text:1968 bar:1975 text:1975 bar:1982 text:1982 bar:1990 text:1990 bar:1999 text:1999 bar:2006 text:2006 bar:2011 text:2011 bar:2014 text:2014 PlotData= color:barra width:30 align:left bar:1968 from:0 till: 36616 bar:1975 from:0 till: 37266 bar:1982 from:0 till: 35189 bar:1990 from:0 till: 33552 bar:1999 from:0 till: 30900 bar:2006 from:0 till: 26972 bar:2011 from:0 till: 24825 bar:2014 from:0 till: 25505 PlotData= bar:1968 at: 36616 fontsize:S text: 36,616 shift:(-12,5) bar:1975 at: 37266 fontsize:S text: 37,266 shift:(-15,5) bar:1982 at: 35189 fontsize:S text: 35,189 shift:(-15,5) bar:1990 at: 33552 fontsize:S text: 33,552 shift:(-15,5) bar:1999 at: 30900 fontsize:S text: 30,900 shift:(-15,5) bar:2006 at: 26972 fontsize:S text: 26,972 shift:(-15,5) bar:2011 at: 24825 fontsize:S text: 24,825 shift:(-15,5) bar:2014 at: 25505 fontsize:S text: 25,505 shift:(-15,5) Saint-Dizier forms, with other five communes, the urban area of Saint-Dizier with a population of 32,086 inhabitants (2014) and an area of . This urban area is the centre of the metropolitan area of Saint-Diziert, formed by 43 communes, with a population of 53,790 inhabitants (2014) and an area of . == Administration == Saint-Dizier is a subprefecture of the Haute-Marne department, the capital of the arrondissement of Saint-Dizier and the administrative centre () of three cantons: * Saint-Dizier-1 formed by 10 communes and part of Saint-Dizier, with 12,406 inhabitants (2014). * Saint-Dizier-2 formed by a part of Saint-Dizier, with 11,674 inhabitants (2014). * Saint-Dizier-3 formed by 2 communes and part of Saint-Dizier, with 11,798 inhabitants (2014). It is part of the intercommunality Saint-Dizier, Der et Blaise (). ==Gallery== File:Saint- Dizier Hôtel de ville 200908.jpg|Saint-Dizier town hall. File:Theatre Saint Dizier.jpg|Saint-Dizier theater. File:Saint-Dizier Sous-préfecture 200908.jpg|Saint-Dizier subprefecture. File:Remparts Saint Dizier.jpg|Saint- Dizier castle wall. File:Eglise Gigny Saint Dizier.jpg|Saint-Martin church. ==Related pages== * Arrondissement of Saint-Dizier * Communes of the Haute- Marne department ==References== ==Other websites== * Site officiel de la ville de Saint-Dizier * Office de Tourisme Saint-Dizier, Der & Blaise Category:Communes in Haute-Marne Category:Subprefectures in France",
 "title": "Saint-Dizier"
}