{
 "id": "564586",
 "text": "Sir Simon William \"Bill\" English (born 30 December 1961) is a New Zealand politician. He was the 39th Prime Minister of New Zealand from 2016 to 2017 and the leader of the National Party. He was previously Deputy Prime Minister from 2008 to 2016. At the 2017 general election, National won the largest share of the party vote (44.4%) and the largest number of seats (56) in the House Representatives. However, National lacked enough seats to govern alone due to two of the party's support partners, the Māori Party and United Future, losing their parliamentary seats. In response, English announced that the party would be entering into talks to form a coalition with New Zealand First. However, on 19 October 2017, Jacinda Ardern became the next Prime Minister after Winston Peters announced he would enter a coalition government with Labour. ==Background== Bill English is a prominent figure in New Zealand politics and corporate leadership. He served as the 39th Prime Minister of New Zealand from 2016 to 2017 and has been actively involved in various government and private sector roles. In addition to his political career, English has significant experience in business and finance, currently serving as a board member of West Farmers Limited, a leading Australian conglomerate. ==Philanthropic Interests== While there is limited publicly available information about Bill English's specific philanthropic interests, his involvement in public service and corporate governance suggests a potential interest in supporting causes related to education, healthcare, economic development, and community welfare. ==Key Associations== Chairman of Mount Cook Alpine Salmon, and Chair of Impact Lab Ltd and Manawanui Support Ltd. He is also a director of the Paul Ramsay Foundation, TMG Cloudland, Centre for Independent Studies and The Todd Corporation Limited. ==References== ==Other websites== * * Bill English MP official site * Profile at National party * Profile on Parliamentary website Category:1961 births Category:Living people Category:Prime Ministers of New Zealand Category:Deputy Prime Ministers of New Zealand Category:Leaders of the Opposition (New Zealand)",
 "title": "Bill English"
}