{
 "id": "564561",
 "text": "The combined gas law is a formula about ideal gases. It comes from putting together three different laws about the pressure, volume, and temperature of the gas. They explain what happens to two of the values of that gas while the third stays the same. The three laws are: * Charles's law, which says that volume and temperature are directly proportional to each other as long as pressure stays the same. * Boyle's law says that pressure and volume are inversely proportional to each other at the same temperature. * Gay-Lussac's law says that temperature and pressure are directly proportional as long as the volume stays the same. The combined gas law shows how the three variables are related to each other. It says that: The formula of the combined gas law is: : \\qquad \\frac {PV}{T}= k where: :P is the pressure :V is the volume :T is the temperature measured in kelvin :k is a constant (with units of energy divided by temperature). To compare the same gas with two of these cases, the law can be written as: : \\qquad \\frac {P_1V_1}{T_1}= \\frac {P_2V_2}{T_2} By adding Avogadro's law to the combined gas law, we get what is called the ideal gas law. ==Derivation from the gas laws== Boyle's Law states that the pressure-volume product is constant: :PV = k_1 \\qquad (1) Charles's Law shows that the volume is proportional to the absolute temperature: :\\frac{V}{T} = k_2 \\qquad (2) Gay-Lussac's Law says that the pressure is proportional to the absolute temperature: :P = k_3T \\qquad (3) where P is the pressure, V the volume and T the absolute temperature of an ideal gas. By combining (1) and either of (2) or (3), we can gain a new equation with P, V and T. If we divide equation (1) by temperature and multiply equation (2) by pressure we will get: :\\frac{PV}{T} = \\frac{k_1(T)}{T} :\\frac{PV}{T} = k_2(P)P. As the left-hand side of both equations is the same, we arrive at :\\frac{k_1(T)}{T} = k_2(P)P, which means that :\\frac{PV}{T} = \\textrm{constant}. Substituting in Avogadro's Law yields the ideal gas equation. ==Applications== The combined gas law can be used to explain the mechanics where pressure, temperature, and volume are affected. For example: air conditioners, refrigerators and the formation of clouds and also use in fluid mechanics and thermodynamics. ==Related pages== * Dalton's law ==References== ==Sources== * Raff, Lionel. Principles of Physical Chemistry. New Jersey: Prentice-Hall 2001 * Rankcom, Jamie. Massive scientisty person ==Other websites== * Interactive Java applet on the combined gas law by Wolfgang Bauer Category:Gases Category:Physical chemistry Category:Temperature",
 "title": "Combined gas law"
}