{
 "id": "564775",
 "text": "Fentanyl (sometimes spelled fentanil) is a synthetic opioid that is used as a painkiller. It also acts as a sedative. It has a short duration of action and works rapidly. The two most common forms are patches that are put on the skin, and an intravenous solution. Paul Janssen developed Fentanyl in 1960. It is 50-100 times more potent as morphine.https://www.jpsmjournal.com/article/S0885-3924(09)00630-7/fulltext Its strength means that much less Fentanyl is needed to get the same effect, but it also wears off faster. The effects of the intravenous solution can be seen within the first 25 to 35 seconds, the peak happening within just 5 to 7 minutes. In 3 to 7 hours, the half life of fentanyl means that concentration in the bloodstream will be half,https://www.ncbi.nlm.nih.gov/books/NBK459275/ and it will be halved again every 3-7 hours after that. The drug is excreted 75% in feces and 9% in urine The range depends on the metabolism and excretion of the users own body. Many deaths have resulted from its improper use. Fentanyl has a relatively wide therapeutic index (270) which makes it a very safe surgical anesthetic when monitored carefully. Because it is so potent, finding the right dose to use requires great care: Fentanyl comes as a highly diluted solution. There is also a powder, but its use is impractical without advanced scientific equipment: The effective dose needed and a lethal dose of fentanyl powder placed next to each other would be difficult or impossible to differentiate with the naked eye. Non-medical use of fentanyl by people without opioid tolerance can be very dangerous and has resulted in many deaths. Even people with opiate tolerance are at high risk of overdoses. Fentanyl is used as a recreational drug. This has led to thousands of overdose deaths each year from 2000 to 2015. It is now the leading cause of death for young adults in the US. It is also the main cause of death in British Columbia for people aged between 10 and 59. Most of it comes from Mexico. As it is so powerful the quantities are very small. All the fentanyl needed to supply the US for a year weighs about 5 tonnes. This makes it hard to stop. Very few people are needed to make it. Heroin is not used so much now because fentanyl is more profitable. It has not spread much outside North America. ==Related pages== *List of fentanyl analogues *Opioid epidemic in the United States ==References== Category:Analgesics Category:Organonitrogen compounds Category:Illegal drugs Category:Opioids Category:Anesthetics",
 "title": "Fentanyl"
}