{
 "id": "564981",
 "text": "John Michael \"Mick\" Mulvaney (born July 21, 1967) is an American politician. Mulvaney was the United States Special Envoy for Northern Ireland from 2020 to 2021. He was the 44th Director of the Office of Management and Budget from February 16, 2017 to March 2020. He was the U.S. Representative for from 2011 through 2017. He is a member of the Republican Party. Mulvaney served as a member of the South Carolina Senate, representing the 16th district (Lancaster and York Counties), from 2009 to 2011. He is the first Republican to represent South Carolina's 5th district since 1883. On December 16, 2016, it was reported that Presidential-Elect Donald Trump has selected Mulvaney as Director of the Office of Management and Budget.\"Trump picks US Rep. Mulvaney to head White House budget office\" , Reuters via CNBC, December 16, 2016. On February 16, 2017, the Senate confirmed him, 51-49. In November 2017, Trump controversially appointed Mulvaney as Acting Consumer Financial Protection Bureau. On December 14, 2018, Trump hired Mulvaney as White House Chief of Staff-designate in an acting capacity. In March 2020, President Trump nominated Mulvaney to be United States Special Envoy for Northern Ireland. In January 2021, Mulvaney resigned as Special Envoy for Northern Ireland following the storming of the U.S. Capitol. ==Early life== Mulvaney was born in Alexandria, Virginia. He grew up in Charlotte, North Carolina, before moving to Indian Land, South Carolina. He studied at Charlotte Catholic High School and then Georgetown University. ==U.S. House of Representatives (2011-2017)== ===Elections=== Mulvaney ran against Democratic incumbent John Spratt for . The race was highlighted by Mitt Romney's Free and Strong America PAC's \"Take Congress Back: 10 in '10\" initiative as one of the top 10 House challenger races. He defeated Spratt, who had held the seat since 1983, with 55% of the vote. Mulvaney won re-election to a second term, by defeating Democrat Joyce Knott 56%–44%. He won re-election to a third term, by defeating Democrat Tom Adams, a Fort Mill Town Council member, 59%–41%. Mulvaney was re- elected to a fourth term, winning over 59% of the vote. ===Tenure=== Mulvaney aligned himself with the Tea Party movement. On December 10, 2013, Republican Representative Paul Ryan and Democratic Senator Patty Murray announced that they had negotiated the Bipartisan Budget Act of 2013, a proposed two-year budget deal. In 2015, Mulvaney voted against a government-funding resolution, in part because it included funding for Planned Parenthood. Mulvaney opposed gun control initiatives. In September 2015, Mulvaney endorsed Kentucky Senator Rand Paul in the 2016 Republican Party presidential primaries. ==Director of the Office of Management and Budget (2017-2020)== On December 16, 2016, Mulvaney was announced to have been chosen by President-elect Donald Trump to be the Director of the Office of Management and Budget. Mulvaney's nomination as Director-designate was reviewed in hearings held by the members of the United States Senate Committee on the Budget and the United States Senate Committee on Homeland Security and Governmental Affairs then presented to the full Senate for a vote. On February 16, 2017, the Senate confirmed Mulvaney, 51-49. ==Consumer Financial Protection Bureau controversy== Trump appointed Mulvaney to serve as Acting Director of the Consumer Financial Protection Bureau. Many believe that Trump cannot appoint an Interim director. The dispute has arisen over whether Mulvaney can be so-named under the FVRA or whether a provision of the Dodd-Frank Act controls, which would make the deputy director, currently Leandra English, acting director of the CFPB instead. The Senate may also resolve the dispute by confirming a permanent replacement once nominated by the President. On November 28, 2017, a federal judge ruled in Trump's favor to allow Mulvaney to continue serving as CFPB Acting Director. ==Acting White House Chief of Staff (2019-2020)== On December 14, 2018, Donald Trump named Mulvaney as his acting White House Chief of Staff, replacing John F. Kelly. He was sworn-in on January 2, 2019. He was replaced by Mark Meadows in March 2020. ==Special Envoy to Northern Ireland (2020-2021)== After leaving his Chief of Staff post, Mulvaney was named Special Envoy for Northern Ireland, a role which had last been held by Gary Hart. His swearing-in was delayed due to the COVID-19 pandemic, which also prevented him from making a planned trip to Northern Ireland as envoy. He was sworn in via virtual FaceTime call on May 1, 2020. He resigned on January 7, 2021. ==Personal life== Mulvaney has two siblings. He married his wife Pamela West in 1998. They have triplets. He is a Roman Catholic. ==Notes== ==References== ==Other websites== * Congressman Mick Mulvaney official U.S. House site * * * |- |- |- |- |- |- |- |- Category:1967 births Category:Living people Category:American Roman Catholics Category:South Carolina Republicans Category:Politicians from Alexandria, Virginia Category:Republican Party (United States) politicians Category:Directors of the Office of Management and Budget Category:United States Special Envoy for Northern Ireland Category:United States representatives from South Carolina Category:Directors of the Consumer Financial Protection Bureau",
 "title": "Mick Mulvaney"
}