{
 "id": "565103",
 "text": "The 2015 Kyrgyzstani parliamentary election was held on 4 October 2015. == Electoral system == The 120 seats in the Supreme Council were elected by proportional representation. This means that if a party gets 20% of the vote, for example, they get 20% of the seats. A party had to receive at least 7% of the vote to get seats in the council. No party was allowed to win more than 65 seats.Electoral system IPU == Campaign == Many political parties were formed before the election; often made by wealthy Kyrgyz who want to promote their own interests.Voters celebrate Kyrgyzstan’s democratic experiment Financial Times, 4 October 2015 A lot of potential candidates were not allowed to run due to criminal convictions. One party leader, a former boxer, was banned after he beat up a rival candidate. == Result == Sources: Cводная таблица по выборам депутатов Жогорку Кенеша Кыргызской Республики. ЦИК КР.Протокол о результатах выборов депутатов Жогорку Кенеша Кыргызской Республики 4 октября 2015 года. ЦИК КР. Presidential election Presidential election Presidential election Presidential election Choice Votes % Seats Social Democratic 435,968 26.81% 38 Respublika–Ata-Zhurt 320,115 19.68% 28 Kyrgyzstan 206,094 12.67% 18 Onuguu–Progress 148,279 9.12% 13 Bir Bol 135,875 8.36% 12 Ata Meken Socialist 123,055 7.57% 11 others 212,031 13.04% 0 against all 12,428 0.76% invalid ballots 32,410 1.99% Total votes 1,626,255 100% 120 == Conduct == Even though there were some reports of voter fraud,Social Democrats Leading In Closely Watched Kyrgyz Vote Radio Free Europe Radio Liberty, 4 October 2015 the OSCE said that the elections were \"lively and competitive\" and \"unique in this region.\" The PACE said that voters had \"made their choice freely among a large number of contestants.\" The OSCE did note some problems with voter registration, and the Council of Europe had concern over the transparency of some campaigns and financing. == References == Category:2015 elections Category:Politics of Kyrgyzstan Category:2010s elections in Asia",
 "title": "2015 Kyrgyz parliamentary election"
}