{
 "id": "565379",
 "text": "East Croydon station is a railway station and tram stop on the Croydon Tramlink. It is in fare zone 5. ==Platforms== Platform 1 serves fast London- bound trains to Victoria station and platforms 2 and 3 serve fast south-bound trains to Brighton, Eastbourne and Southampton Central railway station. Platform 4 serves fast trains towards London Bridge station. Platform 6 is used for fast trains towards Oxted, Uckfield and East Grinstead and for stopping services towards Tattenham Corner and Caterham. Platform 5 is for slow services that stop in many places. ==Buses== London buses traveling routes 64, 119, 194, 197, 198, 312, 367, 410, 433, 466, 689 and X26 all serve this station. ==Departures== Train Towards Calling Points Approximate Journey Time Southern Victoria station Clapham Junction 17 minutes Southern Victoria station Selhurst, Thornton Heath, Norbury, Streatham Common, Balham, Wandsworth Common, Clapham Junction, Battersea Park 28 minutes Southern London Bridge station Norwood Junction, Anerley, Penge West, Sydenham, Forest Hill, Honor Oak Park, Brockley, New Cross Gate 31 minutes Southern London Bridge station Norwood Junction, New Cross Gate 23 minutes Southern Littlehampton Gatwick Airport, Haywards Heath, Burgess Hill, Hove, Shoreham-by-Sea, Worthing, West Worthing, Durrington-on-Sea, Goring-by-Sea, Angmering 1 hour 23 minutes Thameslink Bedford Blackfriars, City Thameslink, Farringdon, St Pancras International, West Hampstead, St Albans, Harpenden, Luton Airport, Luton, Leagrave, Harlington, Flitwick 1 hour 40 minutes Southern Uckfield Oxted, Hurst Green, Edenbridge, Hever, Cowden, Ashurst, Eridge, Crowborough, Buxted 58 minutes Southern East Grinstead Sanderstead, Riddlesdown, Upper Warlingham, Woldingham, Oxted, Hurst Green, Lingfield, Dormans 37 minutes Thameslink Three Bridges Gatwick Airport 20 minutes Southern Brighton Horley, Burgess Hill 40 minutes Thameslink Brighton Gatwick Airport, Three Bridges, Balcombe, Haywards Heath, Wivelsfield, Burgess Hill, Hassocks, Preston Park 46 minutes Southern Eastbourne Gatwick Airport, Haywards Heath, Wivelsfield, Plumpton, Lewes, Polegate, Hampden Park 1 hour 13 minutes Southern Hastings Redhill, Tonbridge, High Brooms, Tunbridge Wells, Wadhurst, Battle, St Leonards Warrior Square 1 hour 18 minutes Southern Bognor Regis Redhill, Horley, Gatwick Airport, Three Bridges, Crawley, Horsham, Christs Hospital, Billingshurst, Pulborough, Amberley, Arundel, Ford, Barnham 1 hour 28 minutes Southern Portsmouth Redhill, Horley, Gatwick Airport, Three Bridges, Crawley, Horsham, Barnham, Chichester, Southbourne, Emsworth, Havant, Fratton, Portsmouth & Southsea 1 hour 47 minutes Southern Southampton Central railway station Redhill, Horley, Gatwick Airport, Three Bridges, Crawley, Horsham, Barnham, Chichester, Southbourne, Emsworth, Havant, Cosham, Portchester, Fareham, Swanwick 2 hours 13 minutes Southern Horsham Purley, Coulsdon South, Merstham, Redhill, Earlswood, Salfords, Horley, Gatwick Airport, Three Bridges, Crawley, Ifield, Littlehaven 54 minutes Southern Caterham South Croydon, Purley Oaks, Purley, Kenley, Whyteleafe, Whyteleafe South 25 minutes Tram Towards Approximate Journey Time Croydon Tramlink Elmers End 15 minutes Croydon Tramlink Wimbledon 27 minutes Croydon Tramlink Beckhenham Junction 20 minutes Croydon Tramlink New Addington 17 minutes Croydon Tramlink West Croydon 8 minutes ==References== ==Other websites== * http://www.nationalrail.co.uk/stations_destinations/ECR.aspx Category:1841 establishments in the United Kingdom Category:1840s establishments in England Category:Buildings and structures in the London Borough of Croydon",
 "title": "East Croydon station"
}