{
 "id": "565347",
 "text": "Swissair Flight 111 was a scheduled flight from John F. Kennedy International Airport in New York City to Geneva Airport in Geneva, Switzerland. On the night of 2 September 1998, the McDonnell Douglas MD-11 flying the route had a fire in the cockpit while flying. Due to in-flight fire, the plane struggles to control and crashed into the Atlantic Ocean off the coast of Halifax, Nova Scotia, killing all 229 people on board. It is the deadliest aviation accident ever in the Halifax, Nova Scotia area. It is the deadliest accident involving the MD-11. == Accident == Swissair Flight 111 left John F. Kennedy International Airport at 20:18 EDT, and started flying to Geneva. Around 21:10, the flight crew smelled smoke and odor in the cockpit and called a flight attendant to investigate it. They thought that the odor was only in the cockpit, and not in the rest of the plane. The smoke and odor disappeared, and returned 45 seconds later. The crew thought it was from the air conditioning system. The pilots sent a distress signal (a signal that means they need help) to Moncton air traffic control. They wanted the air traffic control to let them land at Logan International Airport in Boston, Massachusetts (269 mi away). The Moncton controller then asked them if they wanted to to go to Halifax International Airport in Halifax, Nova Scotia, because it was closer (76 mi away). The pilots put on their oxygen masks. At 21:16, the plane was allowed to descend to 10000 feet of altitude. During the descent down to 10000, they were allowed to go down to 3000 feet. The plane was then told to turn so it could land on Runway 06 at Halifax. Air traffic control in Halifax told the crew they were 30 nautical miles (35 miles) away from the airport. The plane had an altitude of 21,000 feet. The crew asked for more distance, so the plane could descend safely. The crew was told to go towards St. Margaret's Bay. This was south of the plane. Air traffic control told them to do this because it gave them more distance to descend. It also let them drop extra fuel into the ocean, so the plane did not weigh as much. The plane flew south so it could drop fuel. The crew turned off the plane's power because of the smoke. This turned off the air conditioning and fans in the plane, and let the fire spread into the cockpit. The plane's autopilot (machine used to control where a plane is going) turned off. At 21:24, both members of the flight crew declared an emergency at the same time. First Officer Lowe then told Moncton Center that they were starting their dump and had to land immediately. The last radio contact with Swissair 111 was made when the crew once more declared an emergency with the words \"...and we are declaring an emergency now, Swissair one eleven\". The Cockpit Voice Recorder and Digital Flight Data Recorder stopped recording. Captain Zimmerman left his seat to fan back the flames with his clipboard, but was overwhelmed by the heat and smoke. He never returned to his seat. It is unclear if he died before or when the plane crashed. First Officer Lowe continued to fly the aircraft without radios or avionics for 2 to 3 minutes. He was easily confused and under false pretenses, shut down the number three engine on the starboard side of the aircraft, and set the throttle for the number two tail engine to idle. At 21:31, the plane crashed into the Atlantic Ocean near Peggy's Cove in Halifax, Nova Scotia at a speed of 345 miles per hour, killing everyone on board.thumb|right|250px| ==Passengers== Passenger nationalities Passenger nationalities Passenger nationalities Passenger nationalities Nationality Passengers Crew Total 1 0 1 3 0 3 and 1 0 1 1 0 1 1 0 1 41 0 41 and 1 0 1 and 2 0 2 1 0 1 and 1 0 1 1 0 1 1 0 1 1 0 1 and 1 0 1 and 1 0 1 3 0 3 1 0 1 1 0 1 1 0 1 31 13 44 and 1 0 1 and 2 0 2 and 1 0 1 1 0 1 3 0 3 and 2 0 2 110 1 111 1 0 1 Total 215 14 229 == References == == Other websites == * Swissair Flight 111 Re-creation; YouTube * Swissair Flight 111 – St. Margarets Bay, Nova Scotia; Lost at Sea Memorials Category:1998 in North America Category:Aviation accidents and incidents in the 1990s Category:Disasters in Canada",
 "title": "Swissair Flight 111"
}