{
 "id": "565389",
 "text": "The 1956 Grand Canyon was a mid-air collision that happened on Saturday, 30 June 1956 at 11:31 am Mountain Standard Time. A United Airlines plane running as United Airlines Flight 718 hit another airplane owned by Trans World Airlines (TWA), operating as Trans World Airlines Flight 2. The aircraft involved was a Douglas DC-7 and a Lockheed L-1049 Super Constellation. The crash happened over the Grand Canyon within the boundaries of Grand Canyon National Park. All 128 passengers and crew on board both flights died in the collision. The crash was the first commercial airline crash with over 100 deaths, and led to many changes in flight safety in the United States. The crash site today is considered as a National Historic Landmark. ==Aircraft== A total of two airplanes were involved in the collision. These planes were: United Airlines Flight 718 - nicknamed Mainliner Vancouver, the aircraft was a Douglas DC-7. The airplane had an aircraft registration of . The aircraft carried a total of 58 people (53 passengers and 5 crew members). The aircraft was flying under the orders of pilot Robert F. Shirley, co-pilot Robert W. Harms,and flight engineer Gerard Fiore. Trans World Airlines Flight 2 - nicknamed Star of the Seine, the aircraft was a Lockheed L-1049 Super Constellation. The aircraft had an aircraft registration of . The aircraft carried 70 people (64 passengers and 6 crew members). The aircraft was flying under the orders of pilot Jack S. Gandy, co-pilot James H. Ritner, and flight engineer Forrest D. Breyfogle. ==Accident== At about 11:31 AM MST, the track of both airplanes intersected over the canyon, and they hit each other.CAB Docket 320, File 1, Analysis, Paragraph 5, issued 1957/04/17 ==Gallery== UAL DC-7.jpg|A United Airlines DC-7, similar to the one in the accident. Severed tail of TWA Flight 2.jpg|An airplane part from TWA Flight 2 that broke off during the collision. The image was taken by park rangers. as part of the collision investigation. TWAGrandCanyonCrashMemorial2.jpg|The burial site and memorial for the civilians on board TWA Flight 2. The memorial site is located in Flagstaff, Arizona. ==References== ==other websites== A photograph of the TWA funeral by Life Magazine in 1956 Category:Aviation accidents and incidents in the United States Category:1956 in the United States Category:20th century in Arizona",
 "title": "1956 Grand Canyon mid-air collision"
}