{
 "id": "565320",
 "text": "Jair Messias Bolsonaro (born March 21, 1955) is Brazilian politician. He was the 38th President of Brazil from 2019 to 2023. He was a member of the Chamber of Deputies from 1991 until he became president in 2019. He was also a member of the Social Liberal Party (PSL) but left and joined the Liberal Party (PL) in 2021. He is known for his right-wing populist political views.Conversations/Jair Bolsonaro; A Soldier Turned Politician Wants To Give Brazil Back to Army Rule He narrowly lost re-election in the 2022 general election winning 49% of the vote. ==2018 election== Bolsonaro was the PSL's presidential candidate in the 2018 Brazilian presidential election. He came in first place in the first round of the general election on 7 October 2018, with PT candidate Fernando Haddad coming in second place. The two candidates faced again on 28 October with Bolsonaro winning the election. ==Assassination attempt== On September 6, 2018, Bolsonaro was stabbed multiple times while at a campaign rally in Juiz de Fora. Parts of Bolsonaro's liver, lung and intestine were damaged. He was hospitalized under \"extremely stable\" condition and released almost a month later on September 29. ==Controversy== Bolsonaro was a open supporter of the military regime in Brazil in 1964. During the impeachment voting session of former President Dilma Rousseff, in his speech, Bolsonaro honored Carlos Alberto Brilhante Ustra, a widely known military colonel in Brazil by have been a torturer of militants and protesters in the Brazilian military dictatorship period. In a television interview in the 1990s for the popular magazine Veja, he also made controversial declarations about the Pinochet's military dictatorship in Chile, praising the Chilean dictator and stating that \"the regime should have acted more violently to restore the country.\". Bolsonaro is also notorious for his public speeches, which are perceived as being intolerant. He already spoke against minorities in certain occasions, particularly the LGBT (gay) community. In an interview for the documentary Out There, made by British actor and comedian Stephen Fry, which deals with the rise of homophobia in the world, and aired on the BBC in 2013, the then congressman stated: \"No father is proud to have a gay son... We, Brazilians, don't like homosexuals. Not to like isn't the same as to hate.\", he added. In a comment about what he heard, Fry said: \"Bolsonaro is the typical homophobic that I found around the world, with his mantra that gays want to dominate society, recruit children or abuse them. Even in a progressive country like Brazil, its lies create hysteria among the ignorant, from where violence can arise.\" As president, Bolsonaro has downplayed the deadliness of the COVID-19 pandemic in Brazil. He said that the virus is no more deadly than the common flu. On 7 July 2020, Bolsonaro revealed that he had tested positive for COVID-19. Since 2019, Bolsonaro has faced four separate accusations for crimes against humanity. He is under investigation before the International Criminal Court in The Hague for crimes against humanity, genocide of indigenous peoples and ecocide. ==2022 election== Bolsonaro is running for re-election in the 2022 election, with his main opponent being former President Luiz Inácio Lula da Silva. Bolsonaro did not pick Hamilton Mourão as his running mate again, instead choosing General Walter Braga Netto. Throughout the election period, Bolsonaro has said that should he lose, the election would be corrupt and rigged against him. His actions have been compared to former U.S. President Donald Trump's attempts to overturn the results of the 2020 election. On 2 October 2022, Bolsonaro advanced to the run-off election on 30 October against Lula. Lula won 48.43% of the vote against Bolsonaro's 43.20%. Lula was elected in the second round on 30 October, with Bolsonaro becoming the first Brazilian president to lose re-election. ==Post-presidency== When Lula was inaugurated on 1 January 2023, Bolsonaro left for the United States in Florida, skipping the ceremony. On 8 January 2023, supporters of Bolsonaro stormed and invaded the Praça dos Três Poderes in Brasília, taking over the offices of the Supreme Federal Court, National Congress of Brazil and the Palácio do Planalto. The Superior Electoral Court blocked Bolsonaro from seeking office until 2030 for his claims of voter fraud and his role in the 2023 congressional attack.He believes that Lula da Silva committed fraud in the 2022 Brazilian Presidential Election and that's why the 8 January Riots were in Brazil. In July 2024, Brazil’s Federal Police indicted Bolsonaro for money laundering and criminal association in connection with undeclared diamonds the far-right leader received from Saudi Arabia during his time in office. In November 2024, Brazilian authorities announced that they were recommending criminal charges against Bolsonaro over his role in attempting a coup d'état to stay in power after losing the 2022 election. The announcement comes two days after four members of an elite military unit, including a former top aide to Bolsonaro, were arrested and accused of planning to assassinate Bolsonaro's successor Luiz Inácio Lula da Silva shortly before he took office in January 2023. It was also said that Bolsonaro had knowledge over these plans, especially with the plot to assassinate Lula da Silva and that this was one of the reasons over his indictment. ==Political views== An ardent anti-communist, Bolsonaro's positions are often viewed as conservative, populist, nationalist, and are commonly associated with far-right politics, he, however, denies those statements, saying he's aligned with traditional moderate right-wing ideals. He has described himself as being a pro-life, pro-gun and anti-establishment politician. Bolsonaro is a strong opponent of left-wing policies, most notably same-sex marriage, secularism, drug legalization, abortion and environmental preservation. Regarding economic matters, he has advocated for liberal and free-market policies. ==Notes== ==References== == Other websites == * Bolsonaro official web site Category:1955 births Category:Living people Category:Presidents of Brazil Category:Anti-communists Category:Brazilian Roman Catholics Category:Politicians from Rio de Janeiro (state) Category:Politicians from São Paulo (state)",
 "title": "Jair Bolsonaro"
}