{
 "id": "565336",
 "text": "100 Women is a BBC series started in 2013. It looks at the role of women in the twenty-first century. It organised events in London and Mexico. After the women are named, the BBC has three weeks of information about women. Women from all over the world make comments on Twitter about the interviews and debates. ==History== After the 2012 Delhi gang rape case, BBC Controller Liliane Landor, BBC editor Fiona Crack, and other journalists started a series about the issues and successes of women. Women told the BBC there was not enough information about issues women face. In March 2013, BBC received a \"flood of feedback from female listeners\" that asked for more information \"from and about women.\" The BBC started the series in 2013 because there were not enough women represented in the media. The BBC used a survey in 26 languages to choose women for the first program. There were programs for one month, then there was a conference on 25 October. Women from different countries talked about issues they shared. There were many subjects, like work, feminism, motherhood, and religion. The series looked at cultural and social problems women have in life. After the first program, there were many other subjects, like education, health, equal pay, genital mutilation, domestic violence, and sexual abuse. The series tries to give women a place to talk about how to make the world better and stop sexism. Women on the list are from many countries and many professions. Some of the women are famous, and some are not well known. == Names of the 100 women == === 2024 === The 2024 list was released on 3 December and included women facing conflicts and humanitarian crises. The 2024 list was subdivided into five categories, including 11 in the category Climate Pioneers. ==== Climate pioneers ==== Image Name Country Description Maheder Haileselassie Ethiopia Photographer Nejla Işık Turkey Village head and forest campaigner Adenike Titilope Oladosu Nigeria Climate justice advocate Inna Modja Mali Artist and climate advocate Enas Al-Ghoul Palestinian Territories Agricultural engineer Shilshila Acharya Nepal Sustainability entrepreneur Naomi Chanda Zambia Farmer and trainer Rosmarie Wydler-Wälti Switzerland Teacher and climate campaigner Sasha Luccioni Canada Computer scientist Rosa Vásquez Espinoza Peru Chemical biologist Brigitte Baptiste Colombia Ecologist ==== Culture and education ==== Image Name Country Description Olivia McVeigh United Kingdom Make-up artist Christina Assi Lebanon Photojournalist Dilorom Yuldosheva Uzbekistan Seamstress and businesswoman Xuân Phượng Vietnam Film director, author, gallery owner Eugenia Bonetti Italy Nun Lesley Lokko Ghana/United Kingdom Architect Su Min China Road tripper and influencer Anat Hoffman Israel Religious campaigner Hinda Abdi Mohamoud Somalia Journalist Svetlana Anokhina Russia Human rights campaigner Hamida Aman Afghanistan Media and education entrepreneur Johana Bahamón Colombia Social activist Idania del Río Cuba Fashion entrepreneur Helen Molyneux United Kingdom Co-founder, Monumental Welsh Women Shin Daewe Myanmar Filmmaker Cristina Rivera Garza Mexico/United States Writer Shahrnush Parsipur Iran/United States Writer and translator Plestia Alaqad Palestinian Territories Journalist and poet Zhanylsynzat Turganbaeva Kyrgyzstan Museum manager Sharon Kleinbaum United States Rabbi Margarita Barrientos Argentina Soup kitchen founder Yasmeen Mjalli Palestinian Territories Designer Tracey Emin United Kingdom Artist Roxy Murray United Kingdom Disability rights advocate Maheder Haileselassie Ethiopia Photographer Pooja Sharma India Performer of funerary rites Linda Dröfn Gunnarsdóttir Iceland Women's shelter manager Harbia Al Himiary Yemen Heritage conservation engineer Maria Teresa Horta Portugal Poet ==== Entertainment and sport ==== Image Name Country Description Vinesh Phogat India Wrestler Joan Chelimo Melly Kenya/Romania Long-distance runner Hend Sabry Tunisia Actress Naomi Watanabe Japan Comedian Gaby Moreno Guatemala Latin-pop musician Allyson Felix United States Track and field athlete Zakia Khudadadi Afghanistan Taekwondo Paralympian Noella Wiyaala Nwadei Ghana Afro-pop musician Tracy Otto United States Archer Hadiqa Kiani Pakistan Singer and songwriter Zhiying (Tania) Zeng Chile Table tennis player Raye United Kingdom Singer Sharon Stone United States Actress Elaha Soroor Afghanistan Singer and composer Firda Marsya Kurnia Indonesia Heavy metal musician Chloé Zhao United Kingdom Film director Rebeca Andrade Brazil Gymnast Inna Modja Mali Artist and climate advocate Madison Tevlin Canada Talk-show host and model ==== Politics and advocacy ==== Image Name Country Description Aruna Roy India Social activist Angela Rayner United Kingdom Deputy Prime Minister Feng Yuan China Women's rights advocate Haiti Immigration rights campaigner Hala Alkarib Sudan Activist against sexual violence in war Danielle Cantor Israel/Palestinian Territories Cultural activist Fawzia al-Otaibi Saudi Arabia/United Kingdom Women's rights campaigner Nejla Işık Turkey Village head and forest campaigner Katherine Martínez Venezuela Human rights lawyer Kemi Badenoch United Kingdom Leader of the Conservative party Yumi Suzuki Japan Plaintiff in forced sterilisation lawsuit Nadia Murad Iraq Nobel Peace Prize laureate Gisèle Pelicot France Rape survivor Huang Jie Taiwan Politician Annie Sinanduku Mwange DR Congo Miner Susan Collins United States Senator Kasha Jacqueline Nabagesera Uganda Diversity and inclusion campaigner Einav Zangauker Israel Hostage release campaigner Rosmarie Wydler-Wälti Switzerland Teacher and climate campaigner Mahrang Baloch Pakistan Medical doctor and political activist Latisha McCrudden Ireland Irish Traveller Movement activist Ann Chumaporn (Waaddao) Thailand LGBTQ+ rights campaigner Lilia Chanysheva Russia Political activist and ex prisoner Zhina Modares Gorji Iran Women's rights campaigner Amanda Zurawski United States Reproductive rights advocate Ruth López El Salvador Lawyer Lourdes Barreto Brazil Campaigner for sex workers’ rights Hana-Rawhiti Maipi-Clarke New Zealand Politician ==== Science, health and technology ==== Image Name Country Description Enas Al-Ghoul Palestinian Territories Agricultural engineer Kauna Malgwi Nigeria Union leader for content moderators Olga Rudnieva Ukraine Founder, Superhumans Centre Olga Olefirenko Ukraine Farmer Sasha Luccioni Canada Computer scientist Rikta Akter Banu Bangladesh Nurse and school founder Shireen Abed Palestinian Territories Paediatrician Silvana Santos Brazil Biologist Brigitte Baptiste Colombia Ecologist Sara Berkai United Kingdom/Eritrea Designer of DIY science kits Georgina Long Australia Medical oncologist Katalin Karikó Hungary Biochemist and Nobel laureate Nour Emam Egypt Fem-tech entrepreneur Adenike Titilope Oladosu Nigeria Climate justice advocate Subin Park South Korea Founder, Stair Crusher Club Gabriela Salas Cabrera Mexico Programmer and data scientist Naomi Chanda Zambia Farmer and trainer Safa Ali Sudan Obstetrician Sneha Revanur United States AI expert Samia Syria Psychology counsellor Shilshila Acharya Nepal Sustainability entrepreneur Sunita Williams United States Astronaut Rosa Vásquez Espinoza Peru Chemical biologist ===2023=== The 2023 list was released on 21 November and it included 21 women involved with climate change. The laureates included the Indian cricketer Harmanpreet Kaur, Aitana Bonmatí, Michelle Obama, Amal Clooney, Timnit Gebru, Trần Gấm and Huda Kattan. The list was subdivided into four categories: Culture & Education, Entertainment & Sport, Politics & Advocacy and Science, Health & Tech, with 28 of the laureates dubbed climate pioneers (shown as green rows below). ==== Politics & Advocacy ==== Image Name Country of birth Description Maryam Al-Khawaja (also a citizen of ) Human rights campaigner, board member of Civicus and the International Service for Human Rights Shamsa Araweelo (also a citizen of the ) Anti-FGM campaigner Yasmina Benslimane Founder of Politics4Her and gender equality campaigner Yael Braudo-Bahat Peace activist and co-director at Women Wage Peace Alicia Cahuiya Indigenous rights activist Amal Clooney (also a citizen of the ) Human rights lawyer Dehenna Davison Member of Parliament Christiana Figueres Diplomat and climate policy negotiator with the United Nations Framework Convention on Climate Change Bella Galhos Political activist and LGBTQ+ rights advocate Rina Gonoi Former military officer and anti-sexual harassment activist Sonia Guajajara State minister for native peoples and indigenous rights campaigner Renita Holmes Housing rights campaigner Nataša Kandić Lawyer and human rights activist. Founder of the Humanitarian Law Center Rukshana Kapali Housing rights campaigner and transgender human rights activist Sofia Kosachyova Firefighter Monica McWilliams Former politician and peace negotiator during the Good Friday Agreement talks. Co-founder of the Northern Ireland Women's Coalition Najla Mohamed-Lamin Women's rights and climate activist in the Saharawi refugee camps Ulanda Mtamba Campaigner against child marriage Tamar Museridze Investigative journalist Neema Namadamu Disability rights campaigner Michelle Obama Attorney, author and campaigner Sepideh Rashnu Writer and artist Bernadette Smith Advocate for families of missing indigenous women and girls. Co-founder of Drag the Red Iryna Stavchuk Climate policy adviser at the European Climate Foundation Gloria Steinem Feminist leader and co-founder of Ms. magazine Summia Tora Refugee rights campaigner Xu Zaozao Egg freezing campaigner. Advocate for single women's reproductive rights and bodily autonomy ==== Entertainment & Sport ==== Image Name Country of birth Description Aitana Bonmatí Footballer, winner of the Ballon d'Or and former UEFA player of the year Antinisca Cenci Equestrian vaulter Andreza Delgado Curator and cultural manager. Co-founder of PerifaCon Desak Made Rita Kusuma Dewi Speed climber America Ferrera Actor and Latino rights advocate Anne Grall Comedian Georgia Harrison TV personality. Anti- revenge porn campaigner Harmanpreet Kaur Cricketer Dayeon Lee Climate change campaigner for Kpop4planet Justina Miles Deaf performer Dia Mirza Actor. Goodwill Ambassador for the United Nations Environment Programme and a board member of the Sanctuary Nature Foundation Zandile Ndhlovu Freediving instructor Alice Oseman Award-winning author, illustrator and screenwriter Paramida DJ and music producer Camila Pirelli Olympic heptathlete and EcoAthlete Champion Aziza Sbaity Sprinter Khine Hnin Wai Actor and activist Bianca Williams Athlete ==== Culture & Education ==== Image Name Country of birth Description Afroze-Numa Shepherdess Hosai Ahmadzai TV presenter on Shamshad TV Esi Buobasa Fishmonger Chila Kumari Burman Artist Paulina Chiziane Writer. Winner of the Camões Prize Susanne Etti Sustainable tourism expert Licia Fertz Anti-ageism, feminism and LGBTQ+ activist Jannatul Ferdous Burns survivor, film-maker, writer and disability rights campaigner Natalia Idrisova Green energy consultant Vee Kativhu (also a citizen of the ) Content creator and YouTuber Huda Kattan Founder of Huda Beauty Sophia Kianni Student and social entrepreneur Arati Kumar-Rao Photographer Louise Mabulo Farmer and entrepreneur. Recognised by the United Nations Environment Programme as a Young Champion of the Earth Marijeta Mojašević Disability rights activist Sarah Ott School teacher and climate change ambassador with the National Center for Science Education Jetsunma Tenzin Palmo (citizen of ) Bhikṣuṇī buddhist nun Lala Pasquinelli Artist, lawyer, poet, lesbian and feminist activist Jess Pepper Founder of Climate Café and fellow of the Royal Society of Arts Matcha Phorn-in Campaigner for indigenous and LGBTQ+ rights Carolina Díaz Pimentel Journalist specialising in neurodivergence and mental health coverage Shairbu Sagynbaeva Co-founder of For Life sewing shop Daria Serenko Poet, writer and political activist. Member of Feminist Anti-War resistance Kera Sherwood-O'Regan Indigenous rights and disability advocate Sagarika Sriram Educator and climate adviser Clara Elizabeth Fragoso Ugarte Truck driver Oksana Zabuzhko Writer ==== Science, Health & Tech ==== Image Name Country of birth Description Basima Abdulrahman Green building entrepreneur Bayang Diarist and sustainability advocate Amina Al-Bish Volunteer rescue worker with the Syria Civil Defence Rumaitha Al Busaidi Scientist Sara Al- Saqqa General surgeon Susan Chomba Scientist and director at the World Resources Institute Leanne Cullen-Unsworth Marine scientist Canan Dagdeviren Scientist and inventor Izabela Dłużyk Sound recordist Marcela Fernández Expedition guide Anamaría Font Villarroel Particle physicist Trần Gấm Biogas business owner Timnit Gebru (citizen of ) AI expert Claudia Goldin Economist and recipient of Nobel Prize in Economics Anna Huttunen Carbon impact tech expert Gladys Kalema-Zikusoka Veterinarian and conservationist. Founder of Conservation Through Public Health. Recognised by the United Nations Environment Programme as a Champion of the Earth in 2021 Sonia Kastner Wildfire detection tech developer Astrid Linder Professor of traffic safety Neha Mankani Midwife Wanjira Mathai Environmental adviser. Former leader of the Green Belt Movement. Managing director for Africa & Global Partnerships at the World Resources Institute and adviser to the Clean Cooking Alliance and the European Climate Foundation Isabel Farías Meyer Journalist and early menopause campaigner Natalie Psaila Medical doctor Olena Rozvadovska Children's rights advocate Sumini Forest manager Fabiola Trejo Social psychologist Jennifer Uchendu Mental health advocate. Founder of SustyVibes Qiyun Woo Storyteller and environmentalist Elham Youssefian (citizen of ) Human rights lawyer, adviser on climate and adviser on disability to the International Disability Alliance === 2022 === The list for 2022 was released on 6 December. Women included this year were Olena Zelenska of Ukraine, Nana Darkoa Sekyiamah, the singer Billie Eilish, Priyanka Chopra Jonas, Selma Blair, Lina Abu Akleh, Alla Pugacheva, Elnaz Rekabi and Yulimar Rojas. The list was subdivided into four categories: Culture & Sport, Activism & Advocacy, Politics & Education and Health & Science. ==== Politics & Education ==== Image Name Country of birth Description Maeen Al-Obaidi Lawyer and mediator Fatima Amiri Student Nathalie Becquart (also a citizen of the ) Nun in the Congregation of Xavières and first ever female Undersecretary of the Synod of Bishops. Taisia Bekbulatova Journalist. Founder of the independent media outlet Holod Kristina Berdynskykh Journalist María Fernanda Castro Maya Disability rights advocate Chanel Contos Sexual consent activist Eva Copa Politician and mayor of El Alto of Aymara descent Joy Ezeilo Law professor and former United Nations special rapporteur on Trafficking in Persons Ibijoke Faborode Founder of ElectHER Erika Hilton Politician and campaigner for black and LGBT rights. The first black trans woman ever elected to a seat in the National Congress of Brazil Park Ji-hyun Political reformer Zahra Joya Journalist and founder of Rukhshana Media Ursula von der Leyen First ever female President of the European Commission Naomi Long (uses a passport) Politician and former Lord Mayor of Belfast Ayesha Malik First female judge on the Supreme Court of Pakistan Zara Mohammadi Kurdish language educator Mia Mottley First female Prime Minister of Barbados Sepideh Qoliyan Political campaigner and workers’ rights advocate Roza Salih (active in , ) Politician and member of activist group the Glasgow Girls Simone Tebet Member of the Brazilian Federal Senate Kisanet Tedros Educational entrepreneur and Tigrinyan digital content creator Cheng Yen Buddhist philanthropist, founder of the Tzu Chi humanitarian organisation Nazanin Zaghari-Ratcliffe (also a citizen of the ) Charity worker Olena Zelenska Incumbent First Lady, architect and screenwriter ==== Culture & Sport ==== Image Name Country of birth Description Dima Aktaa Refugee and parathlete Zar Amir Ebrahimi Actor and founder of Alambic Productions Selma Blair Actor and multiple sclerosis awareness campaigner Ona Carbonell Olympic medal winning synchronised swimmer Sarah Chan NBA scout and former professional basketball player. Advocate for education and sports Priyanka Chopra Actor and producer. UNICEF Goodwill Ambassador, campaigning for children's rights and education for girls Billie Eilish Singer and songwriter Ons Jabeur Tennis player Sneha Jawale Social worker Reema Juffali Racing driver and founder of Theeba Motorsport Kadri Keung Fashion designer Miky Lee Producer, architect of KCON music festival and vice-chair of CJ ENM Laura McAllister Professor and former footballer. LGBTQ+ sports ambassador Milli Rap artist Rita Moreno EGOT winning actor Salima Rhadia Mukansanga Football referee Alla Pugacheva Musician Elnaz Rekabi Climber, appeared at the Asian Championships without a hijab in violation of Iranian law and was arrested as her action was interpreted by the Iranian government as a silent protest against the law in the context of feminist protesters in Iran at the time Yulimar Rojas Olympic medal winning triple jumper and LGBTQ+ rights advocate Sally Scales Pitjantjatjaran artist Nana Darkoa Sekyiamah Writer and feminist activist Geetanjali Shree Author and winner of the International Booker Prize Alexandra Skochilenko Artist, imprisoned by the Russian government for protesting against the Russian invasion of Ukraine Velia Vidal Writer and El Chocó cultural and education campaigner Esraa Warda Dancer and proponent of raï, a grassroots genre historically associated with social protest ==== Activism & Advocacy ==== Image Name Country of birth Description Lina Abu Akleh Human rights advocate Velmariri Bambari Activist and women's rights campaigner Tarana Burke Activist. Started the MeToo movement. Sanjida Islam Choya Student Heidi Crowter Disability rights campaigner with an emphasis on Down syndrome Sandya Eknelygoda Human rights activist Gohar Eshghi Civil activist and Iranian Complainant Mother Ceci Flores Activist and member of the Madres Buscadoras de Sonora collective Geraldina Guerra Garcés Women's rights and anti-femicide activist Moud Goba Refugee and LGBTQ+ rights activist. Founding member of UK Black Pride Women cutting their hair Group protesting against Iranian laws against women, (especially the law mandating that women wear a hijab at all times) and against its restrictive laws and theocratic government in general Gehad Hamdy Dentist and humanitarian Judith Heumann Disability rights advocate Jebina Yasmin Islam Campaigner for women's safety Layli (pseudonym) Protester Hadizatou Mani Anti-slavery campaigner Oleksandra Matviichuk Human rights lawyer and pro-democracy activist at the Center for Civil Liberties. Helps Ukraine document proof of Russian atrocities resulting from the Russian invasion of Ukraine. Narges Mohammadi Journalist and human rights campaigner. Vice-president of the Defenders of Human Rights Center Tamana Zaryab Paryani Human rights activist Alice Pataxó Indigenous rights activist and climate campaigner Roya Piraei Kurdish rights activist Yuliia Sachuk Disability rights advocate Suvada Selimović Peace campaigner Efrat Tilma Transgender volunteer and LGBTQ+ activist Zhou Xiaoxuan Feminist activist ==== Health & Science ==== Image Name Country of birth Description Aye Nyein Thu Medical doctor Sirisha Bandla Aeronautical engineer Victoria Baptiste Nurse and vaccine educator. WHO Goodwill Ambassador for cervical cancer elimination Niloufar Bayani Ecologist and programme manager at the Persian Wildlife Heritage Foundation Sandy Cabrera Arteaga Sexual and reproductive rights advocate Samrawit Fikru Tech entrepreneur Wegahta Gebreyohannes Abera Humanitarian aid worker Dilek Gürsoy Heart surgeon Sofía Heinonen Conservationist Kimiko Hirata Climate change activist. Recipient of Goldman Environmental Prize Judy Kihumba Sign language interpreter Marie Christina Kolo Climate entrepreneur and ecofeminist Iryna Kondratova Paediatrician at the Kharkiv Regional Perinatal Centre Asonele Kotu Tech entrepreneur Erika Liriano Cocoa entrepreneur. Naja Lyberth Psychologist and trauma therapist Nigar Marf Nurse Monica Musonda Businesswoman and nutrition advocate Ifeoma Ozoma Public policy and tech specialist Yuliia Paievska Paramedic and founder of Taira's Angels Jane Rigby Astronomer and astrophysicist. Advocate for equity and inclusion in STEM Ainura Sagyn Computer engineer and ecofeminist Monica Simpson Reproductive justice activist. Executive director of SisterSong Maryna Viazovska Mathematician. Winner of the Fields Medal Yana Zinkevych Politician, front-line medical volunteer and military veteran ===2021=== The 2021 list was published on 7 December with special focus on Afghanistan. The year's keyword is reset, covering women who have contributed to \"playing their part to reinvent our society, our culture and our world\". The list was subdivided into four categories: Culture & Education, Entertainment & Sport, Politics & Activism and Science & Health, with half the total laureates being Afghan. Not everyone's real name was used for their safety; pseudonymised laureates are marked in the table below with an asterisk. ==== Culture & Education ==== Image Name Country of birth Description Lima Aafshid Poet and writer Oluyemi Adetiba-Orija Lawyer and founder of the all-women law firm Headfort Foundation Rada Akbar Artist Catherine Corless Local historian Pashtana Durrani Teacher, founder and executive director of Learn Afghanistan Saeeda Etebari Jewellery designer Sahar Fetrat Feminist activist, writer and film-maker Melinda French Gates Philanthropist and businesswoman Saghi Ghahraman Poet and co-founder the Iranian Queer Organization Angela Ghayour Teacher and founder of The Herat Online School Najlla Habibyar Entrepreneur Shamsia Hassani Street artist Mugdha Kalra Autism-rights activist and co-founder of Not That Different Freshta Karim Children's-rights activist and founder of Charmaghz mobile library Aliya Kazimy Educator Baroness Helena Kennedy QC Director, International Bar Association's Human Rights Institute Iman Le Caire Contemporary dancer, choreographer and LGBTQ+ activist. Founder, Trans Asylias Depelsha Thomas McGruder Founder of Moms of Black Boys United, COO of the Ford Foundation Fahima Mirzaie Whirling-dervish dancer Chimamanda Ngozi Adichie Writer Lynn Ngugi Journalist Rehana Popal Barrister *Rohila Schoolgirl Alba Rueda Trans activist Elif Shafak Novelist and advocate for women's and LGBTQ+ rights Anisa Shaheed Journalist Mina Smallman Priest and educator Barbara Smolińska Founder of Reborn Sugar Babies Adelaide Lala Tam Artist and food designer Vera Wang Fashion designer Malala Yousafzai Nobel Peace Prize laureate, co-founder of the Malala Fund and girls’ education activist ==== Entertainment & Sport ==== Image Name Country of birth Description Halima Aden Humanitarian and former model. UNICEF ambassador for children's rights. Leena Alam Actor and human-rights activist Sevda Altunoluk Professional goalball player and Paralympic champion Nilofar Bayat Wheelchair basketball player and advocate for women with disabilities Carolina García Director, Netflix Ghawgha Taban Musician Chloé Lopes Gomes Ballet dancer Tanya Muzinda Motocross champion *Razma Musician Roya Sadat Film-maker Shogufa Safi Orchestra conductor *Sahar Footballer Fatima Sultani Mountaineer and martial arts expert Nanfu Wang Film-maker Ming-Na Wen () Actor Rebel Wilson Actress, writer and producer ==== Politics & Activism ==== Image Name Country of birth Description Muqadasa Ahmadzai Social and political activist. Recipient of N-Peace award Abia Akram Disability rights activist Dr Alema Philosopher, campaigner and women's-rights advocate Wahida Amiri Librarian and protester Natasha Asghar Member of the Welsh Senedd Marcelina Bautista Activist and union leader Crystal Bayat Social activist and human-rights advocate Razia Barakzai Protester Najla El Mangoush Libyan Minister of Foreign Affairs Shila Ensandost Teacher and women's rights advocate Fatima Gailani Peace negotiator Momena Ibrahimi Policewoman Hoda Khamosh Period campaigner, poet and journalist Elisa Loncón Antileo President, Constitutional Convention *Maral Campaigner *Masouma Public prosecutor Fiamē Naomi Mataʻafa Prime minister of the Independent State of Samoa Salima Mazari Politician and former governor of Charkint district Amanda Nguyen Social entrepreneur, civil-rights activist and founder of Rise Basira Paigham Gender- equality and gender-minorities activist Monica Paulus Campaigner against sorcery accusation-related violence Manjula Pradeep Lawyer and human-rights activist. Executive director of the Navsarjan Trust Halima Sadaf Karimi Campaigner for women's rights, politician and former MP Soma Sara Founder of Everyone's Invited Mahbouba Seraj Women's and children's rights activist. Founder, Afghan Women's Network *Ein Soe May Pro-democracy activist Piper Stege Nelson Women's-rights activist and Public Strategies Officer at The Safe Alliance Sister Ann Rose Nu Tawng Catholic nun Emma Theofelus Politician Benafsha Yaqoobi Disabled rights advocate Zala Zazai Policewoman ==== Science & Health ==== Image Name Country of birth Description Mónica Araya Emissions- free transportation advocate Zuhal Atmar Entrepreneur and founder of Gul-e- Mursal recycling Jos Boys Architect Faiza Darkhani Environmentalist and women's rights advocate Azmina Dhrodia Safety policy lead at Bumble Jamila Gordon Chief Executive and founder of Lumachain Laila Haidari Women's rights advocate and founder of Mother Camp, drug rehabilitation centre Zarlasht Halaimzai Co-founder and chief executive of Refugee Trauma Initiative Nasrin Husseini Veterinarian Amena Karimyan Astronomer Mia Krisna Pratiwi Environmentalist and eco-activist Heidi Larson Anthropologist and Director of The Vaccine Confidence Project. Recipient of the Edinburgh Medal Sevidzem Ernestine Leikeki Climate activist *Mahera Medical doctor Mulu Mesfin Nurse Mohadese Mirzaee Pilot Tlaleng Mofokeng Universal health access advocate and United Nations special rapporteur on the right to health Natalia Pasternak Taschner Microbiologist and science writer *Ruksana Surgeon Sara Wahedi Chief executive of Ehtesab Roshanak Wardak Gynaecologist and former Member of Parliament Yuma Psychotherapist and LGBTQ+ activist ===2020=== The 2020 list was described as \"different\" before it was scheduled to be announced on 24 November 2020, but it was released the day before. One name on the list was left blank as a tribute to the countless women around the world who had made sacrifices to help others. The list was subdivided into four categories: Knowledge, Leadership, Creativity and Identity. Image Name Country of birth Description Unsung hero Worldwide Acknowledgement of the \"countless women around the world\" who \"have made a sacrifice to help others\" in this \"extraordinary year,\" including those who \"have lost their lives while making a difference.\" ==== Knowledge ==== Image Name Country of birth Description Rina Akter Bangladeshi sex worker turned humanitarian Sarah Al-Amiri Chair, UAE Space Agency Adriana Albini Pathologist and veteran fencer Nisreen Alwan Health and wellbeing of women through public health Elizabeth Anionwu Sickle cell and thalassaemia nurse specialist Diana Barran Minister for Civil Society and founder of SafeLives, a national charity dedicated to ending domestic abuse Macinley Butson Inventor Fang Fang Writer Somaya Faruqi Robotics team leader Lauren Gardner Epidemiologist Iman Ghaleb Al-Hamli Manager of a women- run microgrid Sarah Gilbert Scientist who developed one of the COVID-19 vaccines Rebeca Gyumi Lawyer and founder of girls' rights organization Msichana Initiative Jemimah Kariuki Doctor and creator of the free Wheels for Life ambulance service Safaa Kumari Plant virologist Ishtar Lakhani Feminist activist Lucy Monaghan Campaigner against sexual violence Douce Namwezi N'Ibamba DRC Social entrepreneur, journalist and activist Etheldreda Nakimuli- Mpungu Mental health programme developer Vernetta M Nay Moberly Iñupiaq environmental activist Sania Nishtar Global health leader Lorna Prendergast Dementia researcher Susana Raffalli Delivering nutrition to the malnourished Sapana Roka Magar Crematorium technician Pardis Sabeti Computational geneticist Febfi Setyawati Activist, founder of Untukteman.id Ruth Shady Archaeologist Kathy Sullivan Scientist and astronaut Rima Sultana Rimu Teacher and humanitarian activist working with Rohingya refugees Anastasia Volkova Agricultural innovator. Founder of FluroSat Siouxsie Wiles Scientist and public health communicator Yee-Sin Leo Doctor and research leader ==== Leadership ==== Image Name Country of birth Description Loza Abera Geinore Association footballer Christina Adane Campaigner against injustices of food system (free school meals) Yvonne Aki-Sawyerr Mayor of Freetown Ubah Ali Advocate against female genital mutilation Nadeen Ashraf Advocate against sexual harassment Bilkis Dadi Protest leader Evelina Cabrera Football coach and manager. Carolina Castro Advocate for gender equality Agnes Chow Pro- democracy activist Naomi Dickson Advocate for Jewish women and children suffering from domestic abuse Ilwad Elman Peace activist Jeong Eun-kyeong Korea Disease Control and Prevention Agency commissioner, led COVID-19 response Maggie Gobran Coptic nun and child welfare advocate Deta Hedman Darts champion Manasi Joshi Para-badminton champion Salsabila Khairunnisa Environmental campaigner and School Strike for Climate leader Claudia López Hernández Mayor of Bogotá Sanna Marin Prime Minister of Finland Vanessa Nakate Climate activist Nemonte Nenquimo Waorani activist Phyllis Omido Environmental activist. Winner of the Goldman Environmental Prize Ridhima Pandey Climate activist Oksana Pushkina Politician, member of the State Duma Panusaya Sithijirawattanakul Student activist Nasrin Sotoudeh Lawyer and human rights activist Sviatlana Tsikhanouskaya Exiled Belarus politician Arussi Unda Campaigner against femicide Aisha Yesufu Activist, co-convener of the Bring Back Our Girls campaign Gulnaz Zhuzbaeva Disability activist ==== Creativity ==== Image Name Country of birth Description Houda Abouz Rapper, women's rights and gender equality advocate Waad al-Kateab Activist, journalist and filmmaker Tsitsi Dangarembga Novelist and filmmaker Karen Dolva Chief executive and co-founder of No Isolation Jane Fonda Actor and social activist Kiran Gandhi Singer, musician, and gender liberation activist Miho Imada Master sake brewer Isaivani India Gaana singer and political campaigner Nadine Kaadan Children's author and illustrator Mulenga Kapwepwe Artist and co- founder of the Zambian Women's History Museum Jackie Kay Playwright, novelist and national poet of Scotland Mahira Khan Actor and activist and UNHCR Goodwill Ambassador Angélique Kidjo Musician and UNICEF ambassador Chu Kim Duc Architect and child welfare activist Zahara Singer songwriter Nandar Feminist activist Ana Tijoux Chilean hip hop protester Yulia Tsvetkova Activist, political prisoner Kotchakorn Voraakhom Landscape architect Elin Williams Disability rights activist Michelle Yeoh Actor and UN goodwill ambassador ==== Identity ==== Image Name Country of birth Description Muyesser Abdul'ehed (AKA Hendan) Uyghur writer and language activist Erica Baker Software engineer Cindy Bishop UN goodwill ambassador and model Wendy Beatriz Caishpal Jaco Advocate for the rights of disabled people Patrisse Cullors Human rights activist. Co-founder and executive director of the Black Lives Matter Global Network Foundation Shani Dhanda Disability activist Eileen Flynn Senator and social activist Alicia Garza Human rights activist. Co-creator of Black Lives Matter and the Black Lives Matter Global Network Uyaiedu Ikpe-Etim Nigeria LGBTQ film director and activist Gülsüm Kav Doctor, activist, co-founder of We Will Stop Femicide Josina Machel Human rights activist Hayat Mirshad Feminist activist, journalist, co-founder of Fe-Male collective Laleh Osmany Women's rights activist and founder of #WhereIsMyName campaign Cibele Racy Teacher, racial equality activist Lea T Transgender rights advocate and model Ayu (Opal) Tometi Human rights activist. Co-founder of Black Lives Matter Alice Wong Disability rights activist. Founder of the Disability Visibility Project ===2019=== The 2019 list was announced on 16 October 2019. The list of candidates was chosen from those nominated by the BBC's different language teams using the 2020 theme which was \"The Female Future\". The list was subdivided into six categories: Earth, Knowledge, Leadership, Creativity, Sport and Identity. ==== Earth ==== Image Name Country of birth Description Judith Bakirya Organic farmer and women's rights activist Ella Daish Environmentalist and anti-plastic campaigner Katrina Johnston-Zimmerman Urban anthropologist and co-founder of The Women Led Cities Initiative Gada Kadoda Founder of the Sudanese Knowledge Society and trainer of community engineers Jamie Margolin Climate change activist and co-founder of Zero Hour movement Francia Márquez Afro-Colombian environmentalist and leader of a 10-day, 350-mile women's march. Winner of the Goldman Environmental Prize Trang Nguyen Wildlife conservationist and founder of WildAct Autumn Peltier Clean water advocate Swietenia Puspa Lestari Founder of the Divers Clean Action Foundation and anti-straw campaigner Charlene Ren Clean water advocate, creator of MyH2O Najat Saliba Air pollution researcher and chemistry professor Vandana Shiva Environmental leader and winner of the Alternative Nobel Peace Prize Greta Thunberg Climate change activist Marilyn Waring Feminist economist and environmental activist ==== Knowledge ==== Image Name Country of birth Description MiMi Aung NASA project manager and engineer Raya Bidshahri Educator and founder of Awecademy Katie Bouman Processed first-ever image of a black hole Lisa Campo-Engelstein Bioethicist and fertility and contraceptive researcher Rana el Kaliouby Artificial emotional intelligence pioneer. Founder of Affectiva Amy Karle Bioartist and 3D-designer Fei-Fei Li Pioneer of artificial intelligence who encourages women and minorities to build AI. Julie Makani Treatment of Sickle Cell Disease Sarah Martins Da Silva Consultant gynaecologist, obstetrician and fertility researcher Susmita Mohanty Spaceship designer, entrepreneur and passionate climate action advocate Benedicte Mundele Fresh food entrepreneur and founder of Surprise Tropical Zehra Sayers Biophysicist and chair of the SESAME project. Hayfa Sdiri Entrepreneur and UN gender equality campaigner Noor Shaker Artificial intelligence innovator Bonita Sharma Founder of The Social Changemakers and Innovators Veronique Thouvenot Leader of the Zero Mothers Die initiative Paola Villarreal Computer programmer who developed Data for Justice Amy Webb Futurist ==== Leadership ==== Image Name Country of birth Description Alanoud Alsharekh Women's rights activist. Winner of National Order of Merit Tabata Amaral Politician working for education, women's rights, political innovation and sustainable futures Dhammananda Bhikkhuni First female Thai Buddhist monk (bhikkhuni) and abbess of Songdhammakalyan Monastery Mabel Bianco Feminist medical doctor and women's rights activist. President of the Foundation for Studies and Research on Women (FEIM) Maria Fernanda Espinosa Fourth female president of the UN General Assembly Sister Gerard Fernandez Roman Catholic nun and death row counsellor Zarifa Ghafari One of Afghanistan's first female mayors; clean city advocate Jalila Haider Human rights lawyer and women's rights advocate Asmaa James Journalist and women's rights activist Ahlam Khudr Human rights protest leader Aïssata Lam Microfinance expert and women's rights advocate Soo Jung Lee Forensic psychologist and advocate for anti-stalking bill Gina Martin Campaigner to make upskirting illegal in England and Wales Van Thi Nguyen Co- founder of the Will to Live Center Alexandria Ocasio-Cortez Youngest woman elected to Congress Onjali Q. Raúf Writer and founder of Making Herstory Maria Ressa Journalist and founder of Rappler, a website exposing fake news Lyubov Sobol Lawyer and anti-corruption activist Samah Subay Lawyer supporting families whose children have 'disappeared' ==== Creativity ==== Image Name Country of birth Description Precious Adams Ballet dancer Manal Al Dowayan Saudi photographer and artist Marwa Al-Sabouni Architect who runs only Arabic website for architectural news. Winner of the Prince Claus award Yalitza Aparicio Actress and human rights activist Dayna Ash Poet and cultural activist Ayah Bdeir Founder of littleBits and STEM advocate Scarlett Curtis Co-founder of The Pink Protest Luchita Hurtado Artist and environmental advocate Aranya Johar Beat poet who writes about gender equality, mental health and body positivity Erika Lust Erotic film director, screenwriter and producer Lauren Mahon Cancer survivor and podcaster Lisa Mandemaker Designer of prototype artificial womb Raja Meziane Anti-government songs about social injustice, alleged corruption and inequality Ashcharya Peiris Blind fashion designer and motivational speaker Danit Peleg Fashion designer of 3D-printed clothing Kalista Sy Screenwriter of television series Mistress of a Married Man Ida Vitale Poet, and fifth woman to win Cervantes Prize for lifetime writing achievement ==== Sport ==== Image Name Country of birth Description Jasmin Akter Rohingya refugee and cricketer Kimia Alizadeh First female Iranian Olympic medallist Dina Asher-Smith Fastest woman in British history Salwa Eid Naser 400m world champion runner Bethany Firth Paralympic champion swimmer Shelly- Ann Fraser-Pryce 100m world sprint champion Tayla Harris Australian rules footballer and boxer Huang Wensi Professional boxer Fiona Kolbinger First woman cyclist to win the Transcontinental Race Hiyori Kon Sumo wrestler Farida Osman First woman in Egypt to win a swimming medal Megan Rapinoe World Cup winner and advocate for equality in football (soccer) Jawahir Roble UK's first Muslim, black, female, hijab-wearing referee ==== Identity ==== Image Name Country of birth Description Parveena Ahanger Human rights activist Piera Aiello Anti-mafia politician Rida Al Tubuly Peace campaigner Nisha Ayub Transgender activist Sinéad Burke Disability activist Sharan Dhaliwal Writer and advocate for mental and sexual health for young South Asians, and LGBTQ rights Lucinda Evans Women's rights activist and founder of Philisa Abafazi Bethu (Heal our Women) Owl Fisher Transgender activist, journalist and writer Hollie Sex trafficking survivor Yumi Ishikawa Gender discrimination campaigner and founder of KuToo movement Subhalakshmi Nandi Gender equity researcher and campaigner Natasha Noel Body positivity influencer and Yogini Djamila Ribeiro Writer and Afro-Brazilian women's rights advocate Nanjira Sambuli World Wide Web Foundation digital equality expert Pragati Singh Doctor running Indian Aces, an online community for asexual people Bella Thorne Actress and director Purity Wako Life coach empowering women Sara Wesslin Skolt Sami journalist who lobbied for government funding for Sami language teaching Gina Zurlo Expert in religion statistics === 2018 === The 2018 list was announced in November 2018. The list included the 27th Australian Prime Minister Julia Gillard, Stacey Cunningham who runs the New York Stock Exchange and Shaparak Shajarizadeh who challenged the Iranian law that requires women to wear the Hijab. Image Name Country of birth Description Abisoye Ajayi-Akinfolarin Social impact entrepreneur Esra'a Al Shafei Bahrain Leads not-for-profit Majal.org Svetlana Alekseeva Model and burns survivor Lizt Alfonso Director and choreographer, Cuba Nimco Ali Somaliland Wrier and FGM activist Isabel Allende Author Boushra Yahya Almutawakel Artist, photographer and activist Alina Anisimova Student programmer at Kyrgyz Girls' Space School Frances Arnold Nobel Prize winning chemical engineer Uma Devi Badi Leader of the Badi movement and member of the Provincial Assembly in Nepal Judith Balcazar Fashion designer and co-founder of Giggle Knickers (underwear for women with urinary incontinence) Cindy Arlette Contreras Bautista Lawyer who works against domestic violence as the face of the NiUnaMenos (Not One [woman] Less) Leyla Belyanova Academic and ecologist, seeking to protect Uzbekistan's birdlife and mountain ecosystems Analia Bortz Doctor, rabbi and bioethicist treating women with fertility problems Fealofani Bruun Traditional Polynesian navigator and qualified yachtmaster Raneen Bukhari Curator, gallery manager, and business developer Joy Buolamwini Artificial intelligence artist and researcher Barbara Burton Founder and CEO of BehindBras, a charity that supports women prison leavers Tamara Cheremnova Author, living with cerebral palsy Chelsea Clinton Writer and organiser, Vice-chair of the Clinton Foundation Stacey Cunningham NYSE President Jenny Davidson (businesswoman) CEO of Stand Up Placer Asha de Vos Marine biologist Gabriella Di Laccio Soprano and founder of DONNE: Women in Music Xiomara Diaz Entrepreneur, restaurant owner and charity founder Noma Dumezweni Actor Chidera Eggerue \"The Slumflower\" blogger Shrouk El-Attar Electronic design engineer Nicole Evans Online retail sales facilitator and supporter of women who are experiencing Early menopause Raghda Ezzeldin Free diver Mitra Farazandeh Artist advocate for people with physical disabilities Mamitu Gashe Senior nurse aide and fistula surgeon Meena Gayen Business owner and road builder G.E.M. (Gloria Tang Tsz-kei) Singer-songwriter Fabiola Gianotti Particle physicist and director general of CERN Julia Gillard 27th Prime Minister of Australia Elena Gorolová Social worker, campaigning against forced sterilisation Randi Heesoo Griffin Olympic ice hockey player and data scientist, advocate for equal pay for women in ice hockey Janet Harbick Altruistic surrogate Jessica Hayes Theology teacher and consecrated virgin Thando Hopa Model, lawyer and diversity and inclusion advocate Hindou Oumarou Ibrahim Environmentalist and advocate for indigenous people and women Reyhan Jamalova Entrepreneur, founder and CEO of Rainenergy, company that collects energy from rainwater Jameela Jamil British actor who founded @i-weigh Liz Johnson Paralympian gold medal swimmer and entrepreneur, with a recruitment agency aiming to close the disability employment gap Lao Khang Rugby player and coach Joey Mead King Model and television presenter Krishna Kumari Women's rights campaigner elected to Pakistan Senate Marie Laguerre Civil engineer and architecture student, who has developed platform where women can share stories of street harassment Veasna Chea Leth Lawyer, first woman to study law in Cambodia Ana Graciela Sagastume López Women and Femicide Special Prosecutor Maria Corina Machado Political leader who has campaigned to safeguard democratic processes in Venezuela Nanaia Mahuta Minister of Maori development, first female parliamentarian to wear a Maori face tattoo Sakdiyah Ma'ruf Indonesia's first female Muslim stand-up comedian Nujeen Mustafa Syrian refugee, activist, and a campaigner on behalf of refugees with disabilities Lisa McGee Northern Irish playwright and the writer and creator of Derry Girls Kirsty McGurrell Charity co-ordinator of 4Louis, providing memory boxes for bereaved parents of stillborn babies Becki Meakin General manager of Shaping Our Lives, advocate for people with disabilities Ruth Medufia Female welder acting as role model for young women in the construction industry Larisa Mikhaltsova Accordion music teacher who became a model at age 63 Amina J. Mohammed Deputy secretary general, United Nations Yanar Mohammed President of the Organization of Women's Freedom in Iraq (OWFI) Joseline Esteffania Velasquez Morales Student and NGO co-ordinator, campaigning to end forced marriages Robin Morgan Author and activist, founder of The Sisterhood is Global Institute and the Women's Media Center Dima Nashawi Artist, clown and visual storyteller, who collects and reflects tales from Syria Helena Ndume Ophthalmologist who has performed sight-restoring surgeries upon 35,000 Namibians, free of charge Kelly O'Dwyer Minister for jobs and industrial relations, and minister for women in the Australian parliament Yuki Okoda Astronomer, first person to discover a new star that could shed light on the origins of the Solar System Olivette Otele Professor of History at Bath Spa University, England Claudia Sheinbaum Pardo Mayor of Mexico City and Nobel Peace Prize-winning physicist Park Soo-yeon Digital campaigner against sex crimes Ophelia Pastrana Comedian and media personality Viji Palithodi Activist who founded the Penkootam women's union in Kerala Brigitte Sossou Perenyi Documentary producer and former Trokosi Vicky Phelan Exposed the Irish Cervical Check Screening scandal Rahibai Soma Popere Farmer and founder of Seed Bank, India collecting indigenous seeds Valentina Quintero Journalist promoting tourism and the environment through television programs Sam Ross Catering assistant and advocate for people with Down syndrome Fatma Samoura Secretary General of FIFA Juliet Sargeant Garden designer Sima Sarkar Full-time mother of 18-year-old disabled child Shaparak Shajarizadeh Activist against compulsory hijab rule, now in exile Haven Shepherd Suicide bomb survivor and Paralympic hopeful Nenney Shushaidah Binti Shamsuddin Female Syariah judge Hayat Sindi Biotechnologist, Unesco Goodwill Ambassador for science and founder of the i2 Institute for imagination and ingenuity Jacqueline Straub Theologian, journalist and author seeking to become a Catholic priest Donna Strickland Professor of Physics, University of Waterloo, Canada and winner of Nobel Prize in Physics, 2018 Kanpassorn Suriyasangpetch Dentist, mental health advocate and app developer Setsuko Takamizawa Learning English to help tourists at Tokyo's 2020 Olympic Games Nargis Taraki NGO legal adviser who campaigns for female empowerment Ellen Tejle Campaigner for awareness of women's representation in film Helen Taylor Thompson AIDs Hospice founder Bola Tinubu Lawyer who established the first free children's helpline in Nigeria Errollyn Wallen Opera composer and Ivor Novello Award winner Safiya Wazir Community activist and U.S. politician Gladys West Mathematician, instrumental in developing GPS Luo Yang Art photography series on Chinese girls since 2007 Maral Yazarloo- Pattrick Fashion designer and motorcyclist Tashi Zangmo Bhutan Executive director for the Bhutan Nuns Foundation Jing Zhao Entrepreneur running online sex education network === 2017 === In 2017 the women on the list were part of a 100 Women Challenge, tackling some of the biggest problems facing women around the world. Coming together in four teams, the women shared their experiences and created innovative ways to tackle: * The glass ceiling (#Teamlead) * Female illiteracy (#Teamread) * Street harassment (#Teamgo) * Sexism in sport (#Teamplay) ==== Glass ceiling team==== Image Name Country of birth Description Agnes Atim Apea Founder and CEO of Hope Co-ops Amy Cuddy Harvard social psychologist and author Elaine Welteroth Editor-in-chief of Teen Vogue Erin Akinci Data scientist Jin Xing Dancer, television star and business owner Karlie Noon Astronomer Lea Coligado Software engineer Lori Nishiura Mackenzie Executive Director of the Clayman Institute, Stanford University Loujain Alhathloul Student Maci Peterson Co-founder and CEO, On Second Thought Mariana Feraru Cosmetician María Teresa Ruiz Astronomer Marilyn Loden Author, management consultant and diversity advocate Marina Potoker Managing director, Rockwool Russia Melisa Marquez-Rodriguez Puerto Rico Lead Android engineer for website builder, Weebly.com Michelle Mone Entrepreneur Muhabbat Sharapova Maths teacher Nana Akua Oppong Birmeh Architect Natalia Margolis Software Engineer at Huge agency Romina Bernardo (aka Chocolate Remix) Musician Roya Ramezani Design strategist Rumman Chowdhury Senior Principal at Accenture AI Sasha Perigo Student Savita Devi (Drummer) Drummer Susi Pudjiastuti Politician and entrepreneur Suzanne Doyle-Morris Author and expert on gender in the workplace ==== Women illiteracy team ==== Image Name Country of birth Description Aditi Avasthi Entrepreneur; Founder and CEO, Embibe Huỳnh Thị Xậm Librarian Indira Rana Magar Founder, Prisoner's Assistance Nepal Ira Trivedi Writer Maggie MacDonnell Teacher Marieme Jamme Founder of iamtheCODE Mehroonisa Siddiqui Homemaker Michelle Bachelet President of Chile Nitya Thummalachetty Director of Diversity, FortunaPIX Peggy Whitson Astronaut Priyanka Roy Student Sakena Yacoobi CEO of Afghan Institute for Learning and social entrepreneur with four private schools and one radio station. Tulika Kiran Teacher and social worker Urvashi Sahni Founder and CEO, Study Hall Educational Foundation Zainab Fadhal Iraq Student Vicky Colbert Sociologist of education Muzoon Almellehan Activist and UNICEF Goodwill Ambassador Lin Nien-Tzu Founder, Dharti Mata Sustainable Workshop Frances Melanie Hardinge Author Ngozi Okonjo-Iweala Economist Ahlam al-Rashid Teacher and Head of the Women Empowerment Centre, northern Syria Regina Honu Social entrepreneur Angeline Murimirwa Regional executive director, Camfed Southern & Eastern Africa Bella Devyatkina Polyglot Tran Thi Kim Thia Lottery ticket vendor and swimming coach ==== Street harassment team ==== Image Name Country of birth Description Adelle Onyango Radio presenter Anita Nderu Television presenter and radio news anchor at Capital FM Anne-Marie Imafidon CEO & 'Head Stemette' at Stemettes Chaima Lahsini Journalist Ellen Johnson Sirleaf Liberia President of Liberia Ellie Cosgrave Lecturer in Urban Innovation and Policy at UCL Laura Jordan Bambach Co-founder & Chief Creative Officer, Mr President and co-founder, SheSays Liz Kelly Professor of Sexualised Violence Maria Scorodinschi Moldova Campaigner against domestic violence Naomi Mwaura Founder, Flone Initiative and Communications Associate at ITDP Africa Resham Khan Student Rupi Kaur Author Talent Jumo Founder and Director, Katswe Sistahood Tiwa Savage Singer-songwriter Virali Modi Disability rights activist and youth ambassador Leila Smith Artist Sharon Sabita Beepath Counsellor, Stand Against Abuse advocate Amanda Nunez-Ferreira Student Somporn Khempetch Social worker and teacher Tamara De Anda Journalist Doris Muthoni Wanjira Conductor Hanne Bingle Powerlifter and retired London Underground driver Nihal Saad Zaghloul Business development officer and co- founder of Bassma Angie Ng Founder of SlutWalk Hong Kong Asena Melisa Saglam Student ====Sexism in sport team ==== Image Name Country of birth Description Adriana Behar General Manager of Sport Planning for the Brazilian Olympic Committee Ana Luiza Santos de Andrade Student Beatriz Vaz E Silva Athlete and Footballer Claudianny Drika Football coach Fernanda Nunes Olympic rower and blogger Grace Larsen Retired civil servant Luiza Travassos Student Maira Liguori Director of NGO, Think Olga MC Soffia Rapper Mithali Raj Cricketer Momina Mustehsan Musician Nadia Comaneci Olympic gymnast Nawaal Akram Model, comedian and founder of Muscular Dystrophy Qatar Nora Tausz Ronai Architect and teacher Steph Houghton Footballer Jayanthi Kuru-Utumpala Women's rights activist and mountaineer Cwengekile Nikiwe Myeni Gogo (granny) support programme manager Helena Pacheco Businesswoman and former football coach Rocky Hehakaija Director of Favela Street Foundation and coach Lina Khalifeh Martial arts expert Nguyễn Thị Tuyết Dung Footballer Derartu Tulu Long-distance runner Shantona Rani Roy Taekwondo athlete and activist Hou Yifan Chess grandmaster === 2016 === The 2016 theme was Defiance. Part of the 100 Women festival took place in Mexico City on this year. The main event took place at the Palacio de Bellas Artes, where artists like Julieta Venegas, Ángela Aguilar, Ali Gua Gua, Elis Paprika, Sofía Niño de Rivera, Ximena Sariñana, and Alexis De Anda performed live. The event also features debates with journalists Carmen Aristegui, and Denise Dresser, among others. The 2016 list was published in alphabetical order, but split by category into Creative, Defiant, Influential, Pioneering and Resilient with 20 women in each stream. ==== Creative ==== Image Name Nationality Description Babs Forman United Kingdom London based make-up artist who covers up skin problems Conchi Reyes Rios Spain Bullfighter Doaa el-Adl Egypt Cartoonist whose cat stories reflect the news Dwi Handa Indonesia Instagram fashion star Funke Bucknor-Obruthe Nigeria Planner of glitzy and celebrity weddings Gcina Mhlope South Africa Author, poet, playwright and storyteller Heloise Letissier France French singer and songwriter known by her stage name Christine and the Queens Isabella Springmuhl Tejada Guatemala Fashion designer Jeanette Winterson United Kingdom novelist Kartika Jahja Indonesia gender-equality singer Liv Little United Kingdom Editor-in-chief at gal-dem Mariana Costa Checa Peru Businesswoman, founder of Laboratoria Nadia Khiari Tunisia Creator of cartoon character 'Willis from Tunis', whose adventures reflect the news Nadiya Hussain United Kingdom Winner of reality show \"The Great British Bake Off\" – went on to television jobs Nay el-Rahi Lebanon Journalist, and co- founder of HarassTracker.org Ou Xiaobai People's Republic of China Relocation manager and co-developer iHomo app which links gay and lesbian people for marriages of convenience Paula Hawkins Zimbabwe Writer of the novel \"The Girl on the Train\" Prathiba Parmar Kenya British film maker Reham el-Hour Morocco Cartoonist who became professional after winning a UNESCO competition in 2000 Sunny Leone Canada Actress ==== Defiant ==== Image Name Nationality Description Amna Suleiman Palestine Teacher andbike protester against custom that stops women cycling in Gaza Amy Roko Saudi Arabia Comedian who became known via Instagram and Vine Cat Hulbert United States Professional gambler Corinne Maier France Writer and psychoanalyst Denise Ho Canada Hong Kong Singer and pro-democracy campaigner Ieshia Evans United States Nurse and protestor who became an icon of the Black Lives Matter movement following the publication of Taking a Stand in Baton Rouge Iskra Lawrence United Kingdom Model Jamilah Lemieux United States Cultural commentator, editor and columnist for Interactive One Janet Ní Shuilleabháin Ireland Founding member, Abortion Rights Campaign June Eric-Udorie United Kingdom Writer and blogger Lois Strong United States Former college maths professor and present day cheerleader Naema Ahmed Pakistan E-commerce start-up manager Neha Singh India Actor, writer and campaigner who encourages women to ignore harassment and reclaim the public space Renee Rabinowitz Belgium Lawyer who sued El Al when she was asked to move as the man next to her objected to sitting beside a female Seyhan Arman Turkey Transgender activist and actor Tess Asplund Sweden Care worker and anti-fascism activist caught in iconic photo resisting fascists Viktoria Modesta Latvia Bionic pop artist Winnie Harlow Canada Model Yuliya Stepanova Russia Whistle-blowing athlete Zulaikha Patel South Africa Thirteen year-old who took stand for young girls with natural hair ==== Influential ==== Image Name Nationality Description Alicia Keys United States Singer-songwriter Aline Mukovi Neema Republic of the Congo Student activist for political change Carmen Aristegui Mexico journalist Egge Kande Senegal Community leader who advises young girls about education Evelyn Miralles Venezuela NASA computer engineer Heather Rabbatts Jamaica Lawyer and businesswoman. Non-executive member of the boards of Grosvenor Estates, Royal Opera House and The FA. Chief Executive of the London Borough of Lambeth Judi Aubel United States Social entrepreneur Liliane Landor Lebanon BBC journalist Lubna Tahtamouni Jordan Biology professor and science campaigner Mallika Srinivasan India CEO of Tractors and Farm Equipment Limited Maria Zakharova Russia Foreign ministry spokeswoman Marne Levine United States Chief Operating Officer, Instagram Marta Vieira da Silva Brazil Footballer Rachida Dati France Politician Rakefet Russak-Aminoach Israel CEO, Bank Leumi Rebecca Walker United States Writer and activist Shriti Vadera Uganda Banker and economist Simone Biles United States Olympic gymnast Thuli Madonsela South Africa Advocate who combats corruption Zoleka Mandela South Africa Writer – survivor of addictions, sexual abuse and cancer. Granddaughter of Nelson Mandela. ==== Pioneering ==== Image Name Nationality Description Asel Sadyrova Kyrgyzstan Archer Chan Yuen-ting Hong Kong Football manager Chanira Bajracharya Nepal Former \"living goddess\" or Kumari Churan Zheng People's Republic of China Women's rights activist arrested for planning protest against sexual harassment on public transportation Cindy Meston Canada Professor of clinical psychology Ellinah Ntombi Wamukoya Eswatini First woman to become a bishop of the Anglican Church of Southern Africa Erin McKenney United States Science award winner Gouri Chindarkar India Computer engineering student of the \"School in the Cloud\" Jane Elliott United States Educator, author and anti-racism activist Katherine Johnson United States Space scientist who was a mathematician for NASA Lhakpa Sherpa Nepal Mountaineer who has climbed Mount Everest seven times. Lucy Finch Malawi Palliative care nurse and founder of Malawi's only hospice Mary Akrami Afghanistan Women's shelter director and founder of refuge for abused women Megan Beveridge United Kingdom Scotland First female \"lone piper\" at the Royal Edinburgh Military Tattoo Omotade Alalade Nigeria Founder of BeiBei Haven Foundation, helping those struggling with infertility Sherin Khankan Denmark Imam Shirin Gerami Iran First \"Ironwoman\" triathlete in Iran Sian Williams United Kingdom Wales Rugby player Stephanie Harvey Canada Professional e-gamer \"missharvey\" Yasmine Mustafa Kuwait Entrepreneur, CEO of ROAR for Good ==== Resilient ==== Image Name Nationality Description Ashwaq Moharram Yemen Doctor dealing with starvation in Hudaydah Becci Wain United Kingdom Healthcare assistant and former self-harmer who challenged supermarket policy Carolina de Oliveira Lebanon Syria Actor and Mental health activist Dalia Sabri Jordan Blind music teacher Erin Sweeny Australia Psychologist Karima Baloch Pakistan (Balochistan) Balochistan independence campaigner; died under suspicious circumstances in 2020 Kathy Murray United States Relationship coach and co- author of \"Surrendered Wives Empowered Women\" Khadija Ismayilova Azerbaijan Journalist Mao Kobayashi Japan Newsreader and cancer blogger Marta Sánchez Soler Mexico Sociologist, activist and President of the Mesoamerican Migrant Movement 'Mary' Kenya Survivor of al-Shabab rape Mercedes Doretti Argentina Forensic anthropologist who investigates crimes against humanity Morena Herrera El Salvador Philosopher and Abortion activist Nagira Sabashova Kyrgyzstan Wrestler Natalia Ponce de Leon Colombia Human rights activist and acid attack victim Pashtun Rahmat Afghanistan Police officer Saalumarada Thimmakka India 105-year-old environmentalist Stephanie Yim Bell United States Korean-American professional wrestler, then known as Jade Traci Houpapa New Zealand Company director Um-Yehia Syria Nurse ===2015=== The BBC News 100 Women list in 2015 was made up of many notable international names, as well as women who were unknown, but who represented issues women face. This year the list focussed on octogenarians sharing life lessons; 'good girl' film-makers discussing expectations; nursing; five high-profile women; and '30 under 30' entrepreneurs. The women of 2015, were from 51 countries and were not necessarily those who would traditionally have been seen as role models—a woman with depression, a woman who advocates for equal access to bathroom facilities, a woman who encourages other women to avoid make-up, and a reindeer nomad. ==== The 100 Women interviews (five high-profile women) ==== Image Name Country Occupation Fatou Bensouda Gambia Chief Prosecutor, International Criminal Court (ICC) Bobbi Brown United States Make-up artist and entrepreneur Sania Mirza India Tennis player Hilary Swank United States Actress Alek Wek United Kingdom South Sudan Fashion model/UN ambassador ==== 30 under 30 entrepreneurs ==== Image Name Country Occupation Antonia Albert Austria Founder, Careship Victoria Alonsoperez Uruguay Co-founder, ieeTECH Paulina Arreola Mexico CEO and co-founder, Lavadero Meryl Benitah France Founder, La Boite Qui Cartonne Leimin Duong Australia Founder, Zeven Lemon Beerworks Elissa Freiha United Arab Emirates Sudan Co-founder, WOMENA Melanie Goldsmith United Kingdom Founder, Smith and Sinclair Sara Jane Ho Hong Kong Founder, Institute Sarita Samantha John United States CTO and co-founder of Hopscotch Linda Kwamboka Kenya Co-founder, MFarm Ltd Zihan Ling People's Republic of China CEO and founder, TechBase Catherine Mahugu Kenya Founder, Soko Karabo Mathang South Africa South Africa's first female Fifa-accredited soccer agent Brit Morin United States CEO and founder, Brit + Co Smriti Nagpal India Founder, Atulyakala Pauline Ng Singapore Co-founder, Porcelain Bel Pesce Brazil Founder, FazINOVA Elsa Prieto France Spain Technical director and co- founder, Pili Pop Cristina Randall Canada Founder, Conekta Claire Reid South Africa Entrepreneur, Reel Gardening Nikita Ridgeway Australia CEO and founder, Dreamtime Ink Australia Lorrana Scarpioni Brazil Founder, Bliive Rasha Shehada Palestine Managing director, Diamond Line FZE Zuzanna Stańska Poland Entrepreneur, creator of DailyArt app Michelle Sun Hong Kong Founder, First Code Academy Julie Sygiel United States Founder, Dear Kate Kanika Tekriwal India CEO and founder, JetsetGo Lizanne Teo Singapore Co-founder, Upsurge Jana Tepe Germany CEO and founder, Tandemploy Xian Xu (entrepreneur) People's Republic of China Co-founder, Cuisines Sous Vide restaurant chain ==== 'Good girl' film-makers ==== Image Name Country Occupation Naomi Bya'Ombe Republic of the Congo Student Massiel Chávez Venezuela Student Ayesha Ishtiaq Pakistan Student Delaney Osborne United States Student Lubov Russkina Russia Reindeer nomad Nour (pseudonym) Syria Refugee ==== Vintage ladies (octogenarians) ==== Image Name Country Occupation Nawal el-Sadaawi Egypt Writer Kamini Kaushal India Bollywood actress Jenni Rhodes United Kingdom Textile designer Louise Schwartz (showgirl) Jamaica Showgirl and cabaret performer Tin Tin Yu (teacher) Myanmar Retired teacher ==== Nurses ==== Image Name Country Occupation Eveles Chimala Malawi Midwife Aissa Edon France Mali Midwife Azza Jadalla Palestine Nurse Misraa Jimaa Ethiopia Health extension worker Tina Lavender United Kingdom Midwife Marie-Ange Zimndou Koutou Central African Republic Nurse's aide in a war zone ==== Further inspiration ==== Image Name Country Occupation Nicola Adams United Kingdom Boxer Muzzon al-Mellehan Syria Activist Siba Alaradi Syria Structural engineer Sonita Alizadeh Afghanistan Rapper Niloufar Ardalan Iran Footballer Masoumeh Ataei Iran Acid attack survivor Xyza Bacani Pillippines Photographer Alimata Bara Burkino Faso Trader Sana Ben Ashour Tunisia Civil society activist Nicola Benedetti United Kingdom Musician Asha Bhosle India Singer Cecilia Bouzat Argentina Biophysicist Rivka Carmi Israel Geneticist Estela de Carlotto Argentina Human rights activist Nkosazana Dlamini-Zuma South Africa Physician and chair of the African Union Commission Isabel dos Santos Angola Investor Ernestina Edem Appiah Ghana Social entrepreneur and founder, Ghana Code Club Jana Elhassan Lebanon Novelist Paula Escobar Chile Magazine editor Monir Farmanfarmaian Iran Artist Claire Fox United Kingdom Writer and broadcaster Uta Frith Germany Psychologist Alina Gracheva Moldova Camerawoman Megan Grano United States Comedian Alice Gray United Kingdom Science blogger Michaela Hollywood United Kingdom Fundraiser for disabled people Ella Ingram (activist)Australian mental health champion among BBC's 100 inspirational woman, BeyondBlue, 27 November 2015. . Retrieved 6 December 2016 Australia Activist for mental illness anti- discrimination Somayya Jabarti Saudi Arabia Newspaper editor, Saudi Gazette Tahmina Kohistani Afghanistan Olympic sprinter Rimppi Kumari India Farmer Zimasa Mabela South Africa Naval captain Emi Mahmoud Sudan United States Poet Amara Majeed United States Hijab activist and author Nemata Majeks-Walker Sierra Leone Women's rights activist Katrine Marcal Sweden Economist, writer and journalist Muniba Mazari Pakistan Artist and anchorwoman Jessy McCabe United Kingdom Student Verashni Pillay South Africa Newspaper editor, Mail & Guardian Irina Polyakova Russia Paralympian Neyda Rojas Venezuela Nun Rabia Salihu Said Nigeria Physicist Amina Sboui Tunisia Writer and women's rights activist Patricia Scotland, Baroness Scotland of Asthal United Kingdom Trade envoy Mumtaz Shaikh India Human rights activist Nareen Shammo Iraq Political activist and journalist Rotana Tarabzouni Saudi Arabia Singer/songwriter Li Tingting People's Republic of China Human rights activist Sophie Walker United Kingdom Leader of the Women's Equality Party === 2014 === The BBC News 100 Women list in 2014 continued the efforts of the first year's initiative. Image Name Country Occupation SDr Yasmin Altwaijri Saudi Arabia Mental health and obesity scientist Conchita Wurst Austria Singer Laura Bates United Kingdom Founder, Everyday Sexism project Pinky Lilani United Kingdom Founder, Asian Women of Achievement Awards Ruby Chakravarti India Women's rights campaigner Susie Orbach United Kingdom Psychotherapist Pontso Mafethe Zimbabwe Women's programme manager, Comic Relief Kate Shand United Kingdom Managing director of Enjoy Education Shappi Khorsandi United Kingdom Comedian Shazia Saleem United Kingdom Founder ieat Foods Wai Wai Nu Myanmar Director, Women Peace Net Michaela Bergman United Kingdom Chief Counsellor for Social Issues, European Bank for Reconstruction and Development Paula Moreno Colombia Founder of peace foundation Manos Visibles Rubana Huq Bangladesh Textile manufacturer Lucy-Anne Holmes United Kingdom Founder, No More Page Three campaign Brianna Stubbs United Kingdom Rower for Great Britain and Oxford PhD Scientist Matilda Tristam United Kingdom Comics writer Nigar Nazar Pakistan Cartoonist Sharmeen Obaid Chinoy Pakistan Documentary film-maker Uldus Bakhtiozina Russia Photographer Lesley Yellowlees United Kingdom First female president, Royal Society of Chemistry Rebecca Gomperts Netherlands Founder, Women on Waves Katherine Brown United Kingdom Academic, King's College London Emily Kasyoka Kenya Boxer, Kenya Aowen Jin United Kingdom Chinese-born British artist Eliza Rebeiro United Kingdom Founder of Lives not Knives Muge Iplikci Turkey Journalist Natumanya Sarah Uganda Educator Linda Tirado United States Campaigner Alice Hagan United Kingdom Technician at healthcare company BTG May Tha Hla Myanmar Food aid social worker Rainatou Sow Guinea Founder of Make Every Woman Count Justa Canaviri Bolivia Celebrity chef, Bolivia Heather Jackson United Kingdom Women's business campaigner Ruby Wax United States Mental health campaigner and comic Umm Ahmed Iraq Sole provider for her family Xiaolu Guo People's Republic of China Novelist and film-maker Hind Hobeika Lebanon Founder of Instabeat Molly Case United Kingdom Student nurse and Women of the Future Ambassador Joyce Banda Malawi Former President of Malawi Saadia Zahidi Pakistan Managing Director at the World Economic Forum Aditi Mittal India Stand-up comedian Jess Butcher United Kingdom Co-founder of Blippar Farah Mohamed United States Founder, Girls 20 summit Katy Tuncer United Kingdom Founder, Ready Steady Mums Smruti Sriram United Kingdom Founder, Wings of Hope & Achievement Awards Darshan Karki Nepal Opinion-piece editor at Kathmandu Post daily, blogger Brooke Magnanti United States United Kingdom Forensic scientist, author, former sex worker Chipo Chung Zimbabwe People's Republic of China Actor and activist Pinar Ogunc Iraq Journalist writing about women's issues and the Kurdish political movement Sabina Kurgunayeva Azerbaijan Footballer who also runs her own bicycle rental business Kate Wilson United Kingdom Founder of independent children's book publisher, Nosy Crow Betty Lalam Uganda Director of women's community organisation, Gulu War Affected Training Centre Arabella Dorman United Kingdom War artist Andy Kawa South Africa Businesswoman and social entrepreneur Bahia Shehab Lebanon Egypt Artist, designer and art historian Divya Sharma India Science student Jocelyn Bell Burnell United Kingdom Scientist who discovered Pulsars Eleni Antoniadou Greece Co-founder Transplants Without Donors Shelina Zahra Janmohamed United Kingdom Blogger, columnist and author Salinee Tavaranan Thailand Engineer and social entrepreneur Hatoon Kadi Saudi Arabia Comedian Brie Rogers Lowery United Kingdom Director of Change.org Balvinder Saund United Kingdom Chair of Women's Sikh Alliance Cora Sherlock Ireland Pro- life campaigner and blogger Alaa Murabit Canada Libya Founder, The Voice of Libyan Women Bushra El-Turk United Kingdom Lebanon Composer for London Symphony Orchestra Kim Winser United Kingdom Founder, Winser London Arzu Geybullayeva Azerbaijan Blogger Judith Webb United Kingdom First female commander of an all-male British Army squadron Sarah Hesterman Qatar Equal rights campaigner Sana Saleem Pakistan Pakistani campaigner against Internet censorship Asma Mansour Tunisia Co-founder of Tunisian Centre for Social Entrepreneurship Diana Nammi United Kingdom Kurdish women's rights campaigner against \"honour killing\" Funmi Iyanda Nigeria Talk show host, journalist, activist Karen Masters United Kingdom Scientist at the Institute of Cosmology and Gravitation Khuloud Saba Syria Researcher and public health worker Yolanda Wang Yixuan People's Republic of China Women's rights campaigner Ayesha Mustafa United Kingdom Founder and director of FashionComPassion.co.uk Obiageli Ezekwesili Nigeria Former World Bank Vice President for Africa and Former Minister for Education Tehmina Kazi United Kingdom Director of British Muslims for Secular Democracy Sophi Tranchell United Kingdom Head of Divine Chocolate Boghuma Kabisen Titanji Cameroon Virologist and campaigner for ethical medical research Dwi Rubiyanti Kholifah Indonesia Women's movement leader Anjali Ramachandran United Kingdom Head of Innovation at PHD Yas Necati United Kingdom Campaigner for better sex education Yeonmi Park South Korea Activist raising awareness of the plight of her people in North Korea Irene Li Hong Kong Citizen journalist who took part in and documented protests Sandee Pyne Myanmar Chief executive of Community Partners International, focused on aid Temie Giwa Nigeria United States Founder of the One Percent Project, facilitating blood donation Kavita Krishnan India Secretary, All India Progressive Women's Association Sarah Khan Pakistan Filmmaker and campaigner Nicky Moffat United Kingdom Highest Ranked woman in British Armed Forces Alice Powell United Kingdom Racing driver and first female to win a Formula Renault Championship Misty Haith United Kingdom Research Engineer at Imperial College London Sally Sabry Egypt Businesswoman Kate Smurthwaite United Kingdom Comedian and activist Susana Lopez Mexico Virologist specialising in rotavirus Jaya Luintel Nepal Journalist and women's rights advocate Nicola Sturgeon Scotland United Kingdom First Minister of Scotland === 2013 === The 2013 event was a month-long BBC series that took place in October. The series examined the role of women in the 21st century and culminated in an event held at BBC Broadcasting House in London, United Kingdom on 25 October 2013 involving a hundred women from around the world, all of whom came from different walks of life. The day featured debate and discussion on radio, television and online, in which the participants were asked to give their opinions about the issues facing women. The event held on 25 October 2013 featured 100 women from all walks of life. Image Name Occupation Salwa Abu Libdeh Palestinian television journalist Madawi Al-Rasheed Saudi academic and gender expert Nadia Al-Sakkaf Editor, Yemen Times Sreymom Ang Cambodian fashion designer Anna Arrowsmith English porn film director Joyce Aoko Aruga Student teacher in Kenya Moe Thuzar Aung Myanmar state broadcast Rehana Azib London-based barrister Firuza Aliyeva Associate Director, Azerbaijan Diplomatic Academy Zainab Hawa Bangura UN special representative on sexual violence in conflict Michaela Bergman Chief Counsellor for Social Issues, European Bank for Reconstruction and Development Claire Bertschinger Anglo-Swiss nurse whose work inspired Live Aid Ingrid Betancourt French-Colombian former politician and FARC hostage Cherie Blair British barrister and philanthropist Emma Bonino Minister of Foreign Affairs, Italy Yvonne Brewster Stage director, teacher and writer Gurinder Chadha British-Asian film director Nervana Mahmoud Egyptian blogger and commentator Irina Chakraborty Russian-Finnish-Indian engineer Shadi Sadr Iranian lawyer and human rights defender Chipo Chung Chinese-Zimbabwean actor and activist Helen Clark Head of UN Development Programme, former New Zealand Prime Minister Diane Coyle Economist, writer and blogger Caroline Criado Perez British journalist and feminist campaigner Jody Day Founder of Gateway Women, a network for childless women Es Devlin British theatre designer Klára Dobrev Hungarian lawyer and economist Efua Dorkenoo Ghanaian Senior Advisor to Equality Now and campaigner against female genital mutilation Sigridur Maria Egilsdottir Iceland's champion debater Marwa El-Daly Egyptian grassroots activists, founder of the Waqfeyat Foundation Bushra El-Turk British-Lebanese composer Obiageli Ezekwesili Senior adviser, Open Society Foundations Caroline Farrow Catholic writer, blogger and pro-life activist Anne Stella Fomumbod Women's rights activist, Cameroon Teresa Forcades Radical Spanish nun Razan Ghazzawi Syrian blogger and activist Rebecca Gomperts Dutch doctor, head of Women on Waves Tanni Grey-Thompson Winner of 11 Paralympic Games gold medals Parveen Hassan Conservative women's organiser, UK Barbara Hewson Senior barrister, UK Anis Hidayah Indonesian activist working on migrant worker rights Deborah Hopkins British mother and political activist Rose Hudson- Wilkin Jamaican born British priest Bettany Hughes Historian, author, broadcaster Rubana Huq Bangladeshi textile manufacturer Leyla Hussein Co- founder, Daughters of Eve, anti-violence campaigner Heather Jackson (CEO) CEO of An Inspirational Journey and founder of The Women's Business Forum Shelina Zahra Janmohamed Blogger, columnist and author Laura Janner-Klausner Movement rabbi, specializing in Reform Judaism Aowen Jin Chinese contemporary artist Andy Kawa South African businesswoman, anti-violence campaigner Tehmina Kazi Director, British Muslims for a Secular Democracy Jude Kelly Artistic Director, Southbank Centre Fereshteh Khosroujerdy Visually impaired Iranian singer Azadeh Kian Iranian academic and gender specialist Kanya King CEO and founder, Mobo Fawzia Koofi MP and former Deputy Speaker, Afghan National Parliament Dina Korzun Russian actor and charity activist Martha Lane-Fox UK technology entrepreneur Paris Lees Transgender broadcaster Ann Leslie Journalist Sian Lindley Researcher in social technology Pontso Mafethe Programme manager, Comic Relief Brooke Magnanti Forensic scientist, author, former sex worker Mmasekgoa Masire-Mwamba Deputy Secretary General, the Commonwealth Shirley Meredeen Founding member, Growing Old Disgracefully Samar Samir Mezghanni Record-breaking young Tunisian writer Shazia Mirza British comedian Aditi Mittal Indian comedian Rosmery Mollo Indigenous Bolivian activist Orzala Ashraf Nemat Afghan scholar and civil society activist Pauline Neville-Jones Former UK Security and Counter-Terrorism Minister Susie Orbach Psychotherapist and author Mirina Paananen Islamic researcher Claudia Paz y Paz Attorney General, Guatemala Mariane Pearl French journalist, founder of Chime for Change Laura Perrins Stay-at-home mother Charlotte Raven British feminist and journalist Gail Rebuck Chief executive, Random House UK Justine Roberts Founder, Mumsnet Sarah Rogers Voice of Women community radio, Sierra Leone Fatima Said British-Egyptian pro-democracy advocate Balvinder Saund Chair of Sikh Women's Alliance Kamila Shamsie UK-based Pakistani writer Divya Sharma Indian electronics and communications engineer Bahia Shehab Lebanese- Egyptian artist, designer and art historian Joanna Shields Chair and CEO, Tech City Investment Organisation Stephanie Shirley Businesswoman and philanthropist Clare Short British politician, former International Development Secretary Jacqui Smith Former UK Home Secretary Kate Smurthwaite British stand-up comedian and activist Rainatou Sow Guinean founder, Make Every Woman Count Louise Stephenson Trainee counsellor, UK May Tha Hla Founder, Helping The Burmese Delta Natasha Walter British feminist writer and campaigner Judith Webb First female commander of all-male British Army squadron Saadia Zahidi Head of Gender Parity and Human Capital, World Economic Forum Dinara Zhorobekova Student, Kyrgyzstan Gemma Godfrey Board director, broadcaster Martina Navratilova 18-time Grand Slam singles tennis champion == Initiatives by year == * 2013: * 2014: * 2015: * 2016: ==Other participants== Name Occupation Sarah Walker Head of the English Collective of Prostitutes Cerrie Burnell Children's TV presenter Selma James Writer and activist == References == ==Other websites== * 100 Women at BBC Online Category:2013 establishments in the United Kingdom",
 "title": "100 Women (BBC)"
}