{
 "id": "565508",
 "text": "This page is a list of accidents and incidents involving commercial aircraft from 1919 to 1959. __NOTOC__ Contents Contents Contents Contents Contents Contents Contents Contents Contents Contents 1919 1922 1923 1924 1926 1927 1928 1929 1930 1931 1933 1934 1935 1936 1937 1938 1939 1940 1941 1942 1943 1944 1945 1946 1947 1948 1949 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 ==1919== * July 21 - Wingfoot Air Express crash, a Goodyear Tire and Rubber Company Type FD dirigible crashes in Chicago, Illinois after suffering an In-flight fire. Killing 13. * August 2 – A Caproni Ca.48 crashes at Verona, Italy, during a flight from Venice to Taliedo, Milan, killing all on board (14, 15, or 17 people, according to different sources). ==1922== * April 7 – In the first mid-air collision of airliners, a de Havilland DH.18A, G-EAWO, operated by Daimler Hire Ltd., collides with a Farman F.60 Goliath, F-GEAD, operated by Compagnie des Grands Express Aériens (CGEA), over the Thieulloy- St. Antoine road near Picardie, France, killing all seven people on both aircraft. ==1923== * May 14 – An Air Union Farman F.60 Goliath crashes near Monsures, Somme, France, due to the structural failure of a wing, killing all 6 on board. * August 27 – An Air Union Farman F.60 Goliath crashes near East Malling, Kent, England, due to engine failure, and confusion among the passengers, killing one of 13 on board. ==1924== * December 24 – An Imperial Airways de Havilland DH.34 crashes near Purley, Surrey, England due to unknown mechanical defect, killing all 8 on board. ==1926== * August 18 – An Air Union Blériot 155 crashes while attempting an emergency landing at College Farm, Hurst, Aldington, England, due to engine failure, killing 3 of 15 on board; the pilot initially survives, but dies a day later. * October 2 – An Air Union Blériot 155 catches fire in mid-air and crashes at Leigh, Kent, England, while the pilot attempts to make an emergency landing at Penshurst Airfield. Both members of crew and all five passengers are killed. This is the first in- flight fire occurring on an airliner. ==1927== * August 22 – A KLM Fokker F. VIII crashes near Sevenoaks, Kent, England, due to structural failure of the tailfin, killing one of 11 on board. ==1928== * July 13 – An Imperial Airways Vickers Vulcan crashes on a test flight from Croydon Airport, England, with a pilot and five passengers near Purley, Surrey, from the airport, with the loss of four passengers. As a result of the crash Imperial Airways stopped the flying of staff (so-called joy rides) on test flights. ==1929== * June 17 – An Imperial Airways Handley Page W.10 ditches in the English Channel due to engine failure, killing 7 of 13 on board. * November 6 – A Junkers G 24 crashes near Marden Park, Godstone, Surrey, England; of the 8 on board, only 1 passenger survives. ==1930== * February 10 – An Air Union Farman F.63 Goliath crashes while attempting an emergency landing at Marden Airfield, Marden, Kent, England, due to structural failure, killing 2 of 6 on board. ==1931== * March 21 – Australian National Airways Southern Cloud, an Avro 618 Ten, crashes in the Snowy Mountains while flying from Sydney to Melbourne, killing all eight on board, in Australia's first significant airline disaster; the crash site remained undiscovered for 27 years; severe weather at the time of the flight is the likely cause of the accident. * March 31 – TWA Flight 599, a Fokker F.10 Trimotor, crashes near Bazaar, Kansas, United States, killing all eight aboard, including University of Notre Dame football coach Knute Rockne. ==1933== * March 28 – The 1933 Imperial Airways Dixmude crash in Belgium of an Armstrong Whitworth Argosy II is the first suspected case of air sabotage; all 15 on board are killed. * October 10 – The United Airlines crash near Chesterton: a Boeing 247 is destroyed by a bomb over Chesterton, Indiana, United States, in the first proven case of air sabotage on a commercial aircraft; all seven on board are killed. * December 30 – In the 1933 Imperial Airways Ruysselede crash in Belgium, an Avro Ten collides with a radio mast, killing all 10 on board. ==1934== * May 9 – An Air France Wibault 282T crashes into the English Channel off Dungeness, Kent, killing all 6 on board. * July 27 – A Swissair Curtiss T-32 Condor II crashes near Tuttlingen, Germany, after a wing separated in a thunderstorm, killing all 12 passengers and crew on board. * October 2 – A Hillman's Airways de Havilland Dragon Rapide crashes into the English Channel off Folkestone, Kent, due to pilot error, killing all 7 on board. ==1935== * October 7 – United Airlines Trip 4, a Boeing 247D, crashes near Silver Crown, Wyoming, United States, due to pilot error; all 12 on board die. * December 10 – A SABENA Savoia-Marchetti S.73 crashes crashes near Tatsfield, Surrey, England, due to pilot error, killing all 11 on board. ==1936== * January 14 – American Airlines Flight 1, a Douglas DC-2, crashes into a swamp near Goodwin, Arkansas, killing all 17 passengers and crew on board; the cause is never determined. * April 7 – TWA Flight 1, a Douglas DC-2, crashes near Uniontown, Pennsylvania, United States, due to pilot error, killing 12 of the 14 passengers and crew aboard. * June 16 – In the Havørn Accident, a Norwegian Air Lines Junkers Ju 52 crashes into Lihesten mountain in Hyllestad, Norway, killing all seven on board. * August 5 – Chicago and Southern Flight 4, a Lockheed Model 10 Electra, crashes after takeoff due to pilot error, killing all eight on board. * December 9 – A KLM Douglas DC-2 crashes on takeoff from Croydon Airport, England; 15 of 17 on board die. * December 27 – United Airlines Trip 34, a Boeing 247, crashes at Rice Canyon (near Newhall, California, United States) due to pilot error, killing all 12 on board. ==1937== * January 12 – Western Air Express Flight 7, a Boeing 247, crashes into a mountain near Newhall, California, United States. Five of the 13 people aboard die, including famed adventurer, author and filmmaker, Martin Johnson. * February 19 – An Australian National Airways Stinson Model A suffers controlled flight into terrain in Queensland, killing 4 of the 7 people on board. * May 6 – The Zeppelin Hindenburg bursts into flames and crashes while attempting a landing at Naval Air Engineering Station, Lakehurst, New Jersey, United States; of the 97 people on board, 35 are killed; one person on the ground also dies. * November 16 – A Sabena Junkers Ju 52 crashes near Ostend, Belgium, killing all 11 on board, including the Grand Duke Georg Donatus and Grand Duchess Cecilie of Hesse. ==1938== * January 10 – Northwest Airlines Flight 2, a Lockheed L14H Super Electra, crashes near Bozeman, Montana, United States, killing all ten on board; the machine with which the manufacturer measured component vibration is found to be inaccurate, causing the aircraft to be more prone to flutter than thought. * January 11 – Pan American World Airways Flight 1, a Sikorsky S-42 flying boat named the Samoan Clipper, explodes over Pago Pago, American Samoa; all 7 on board die. * March 1 – The 1938 Yosemite TWA crash: A Douglas DC-2 disappears on a flight from San Francisco to Winslow, Arizona, United States; the aircraft is found three months later on a mountain in Yosemite National Park; all 9 on board died. * July 28 – Pan American World Airways Flight 229, a Martin M-130 flying boat named the Hawaii Clipper, disappears in the Pacific Ocean westbound from Guam to Manila with 6 passengers and 9 crew. * October 25 – Kyeema, an Australian National Airways Douglas DC-2 crashes in heavy fog into Mount Dandenong in Victoria, Australia, killing all 18 people on board. * November 4 – In the 1938 Jersey Airport disaster, a Jersey Airways de Havilland DH.86 crashes on takeoff from Jersey Airport due to pilot error; all 13 passengers and crew die as well as one person on the ground. ==1939== * January 13 – Northwest Airlines Flight 1, a Lockheed L14H Super Electra, crashes on descent to Miles City, Montana, United States, killing all four on board; the aircraft's cross-feed fuel valve leaked fuel into the cockpit and an intense fire broke out. * January 21 – Imperial Airways Short Empire flying boat Cavalier makes an emergency landing 285 mi southeast of New York in the North Atlantic due to loss of power and later sinks; 3 of 12 on board die. * August 13 – A Pan Am Sikorsky S-43 crashes into Guanabara Bay, Brazil, due to loss of control following engine failure, killing 12 of 14 on board. ==1940== * June 14 – In the Kaleva shootdown, an Aero Junkers Ju 52 en route from Tallinn, Estonia to Helsinki, Finland, is shot down by two Soviet bombers over the Gulf of Finland during peacetime; all nine aboard die. * August 31 – In the Lovettsville air disaster, Pennsylvania Central Airlines Trip 19, a Douglas DC-3A, crashes at Lovettsville, Virginia, United States, killing all 25 on board. * November 8 – A Deutsche Luft Hansa Junkers Ju 90 crashes near Schönteichen, Saxony, Germany, after ice formed on the tail, killing all 29 passengers and crew on board. ==1941== * February 26 – Eastern Air Lines Flight 21, a Douglas DC-3, crashes while descending to land at Atlanta, Georgia, United States, killing 8 of 16 aboard; World War I hero and Eastern Air Lines president Eddie Rickenbacker is among the survivors. ==1942== * January 16 – TWA Flight 3, a Douglas DC-3 returning to California crashes into Potosi Mountain southwest of Las Vegas, Nevada, United States; all 22 aboard die, including actress Carole Lombard and her mother. * January 30 – Qantas Short Empire G-AEUH is shot down by seven Japanese fighters and crashes from East Timor; 13 of 18 on board die. * March 3 – KNILM Douglas DC-3 PK-AFV is shot down by three Japanese fighters and crashes north of Broome, Western Australia, killing 4 of 12 on board. * October 23 – American Airlines Flight 28, a Douglas DC-3, crashes near Palm Springs, California, United States, after being struck by a U.S. Army Air Corps Lockheed B-34 bomber; all 12 aboard the airliner die, while the bomber lands safely with minor damage. ==1943== * January 21 – Pan Am Flight 1104, a Martin M-130 nicknamed the Philippine Clipper, crashes into a mountain near Boonville, California, United States, killing all 19 passengers and crew, including Rear-Admiral Robert H. English, commander of the U.S. Pacific Submarine Fleet. * June 1 – BOAC Flight 777, a Douglas DC-3, is shot down by Luftwaffe fighter aircraft over the Bay of Biscay, killing 17 passengers and crew on board. * July 28 – American Airlines Flight 63 (Flagship Ohio), a Douglas DC-3, loses control due to severe turbulence and violent downdrafts and crashes near Trammel, Kentucky, United States, killing twenty out of twenty-two people on board. * October 15 – American Airlines Flight 63 (Flagship Missouri), a DC-3, crashes near Centerville, Tennessee, United States, killing all eight passengers and three crewmembers, after ice formed on its wings and propellers. ==1944== * February 10 – American Airlines Flight 2, a Douglas DC-3, crashes into the Mississippi River between Arkansas and Tennessee, United States, for reasons unknown, killing all 24 occupants (21 passengers and 3 crew members). * June 20 – TWA Flight 277, a Douglas C-54 Skymaster, crashes into Fort Mountain, Maine, United States, in severe weather, killing all 7 passengers and crew on board. ==1945== * January 8 – The China Clipper, a Pan Am Martin M-130 flying boat operating as Flight 161, crashes in Port of Spain, Trinidad, killing all 25 on board. * January 31 – The Stinson Tokana operated by Australian National Airways crashes, killing all 10 on board. The accident was caused by a fatigue crack in a wing spar. * July 12 – Eastern Air Lines Flight 45, a Douglas DC-3A, collides with a Douglas A-26 Invader over Florence, South Carolina, United States. One of the 24 on the DC-3 and 1 of the 2 on the A-26 die. * October 5 – National Airlines Flight 16, a Lockheed L-18 Lodestar, overshoots the runway at Lakeland, Florida, United States, killing 2 of 15 on board. * November 3 – The prototype Boeing 314, named the Honolulu Clipper, makes an emergency landing in the Pacific 650 miles east of Oahu due to double engine failure; the aircraft is intentionally sunk after salvage was deemed impractical; all 26 passengers on board survive. ==1946== * January 6 – Pennsylvania Central Airlines Flight 105, a Douglas DC-3, crashes in Birmingham, Alabama, United States, killing three of the four crew members; the flight attendant and all 16 passengers survive. * March 10 – The 1946 Australian National Airways DC-3 crash near Hobart, Tasmania, kills all 25 on board. * July 11 – TWA Flight 513, a Lockheed L-049 Constellation, crashes near Reading, Pennsylvania, United States, after a fire in the baggage compartment; of the six crew on board, only one survives. * August 7 – British European Airways Flight 530, a Douglas C-47, crashes into Mistberget mountain near Eidsvoll, Norway; killing three of five crew; all 10 passengers survived. * October 3 – An American Overseas Airlines Douglas C-54 crashes into mountainous terrain after takeoff from Stephenville, Newfoundland, killing all 39 passengers and crew on board. * November 14 – In the 1946 KLM Douglas DC-3 Amsterdam accident, a Douglas DC-3 crashes while attempting to land at Amsterdam Schiphol Airport in the Netherlands; all 26 passengers and crew on board are killed. * December 28 – TWA Flight 6963, a Lockheed L-049 Constellation, crashes near Shannon Airport due to an inaccurate altimeter caused by maintenance errors, killing nine of 23 on board. ==1947== * January 11 – The 1947 BOAC Douglas C-47 crash: a BOAC Douglas C-47A crashes into Barley Hill near Stowting, Kent, United Kingdom, due to fuel starvation, killing 8 of 16 on board. * January 25 – In the 1947 Croydon Dakota accident, a Spencer Airways Douglas C-47A fails to get airborne at Croydon Airport, United Kingdom, and crashes into a parked ČSA aircraft; 12 of the 22 on board are killed. * January 26 – In the 1947 KLM Douglas DC-3 Copenhagen accident, a Douglas DC-3 crashes shortly after takeoff from Kastrup Airport in Denmark; all 22 passengers and crew on board are killed. * February 15 – An Avianca Douglas DC-4 crashes into Mount El Tabalazo due to pilot error, killing all 53 passengers and crew on board. * May 29 – United Airlines Flight 521, a Douglas DC-4, crashes on takeoff from LaGuardia Airport, New York, United States, due to pilot error; 42 of 48 on board die. * May 30 – Eastern Air Lines Flight 605, a Douglas DC-4, loses control and crashes near Bainbridge, Maryland, United States, killing all 53 passengers and crew on board in the deadliest airliner crash in United States history at the time. * June 13 – Pennsylvania Central Airlines Flight 410, a Douglas DC-4, crashes into Lookout Rock, in the West Virginia Blue Ridge Mountains of the United States en route from Pittsburgh to Washington DC; all 50 passengers and crew are killed. * June 19 - Pan Am Flight 121, a Lockheed L-049 Constellation, crashes in the Syrian desert, en route from Karachi to Istanbul, killing 14 of the 36 on board. * August 2 – In the BSAA Star Dust accident, a British South American Airways Avro Lancastrian named Star Dust disappears over the Andes after transmitting an enigmatic coded message (\"STENDEC\"); the fate of the plane remained a mystery until the crash site was in 2000; four crew and nine passengers are killed. * August 28 – In the Kvitbjørn disaster, a Norwegian Air Lines Short Sandringham flying boat struck a mountain near Lødingsfjellet, Norway, killing all 35 on board. * October 24 – United Airlines Flight 608, a Douglas DC-6, crashes near Bryce Canyon Airport, Utah, United States, when fire caused by a design flaw destroys the aircraft; all 52 on board die in the first hull loss of the DC-6. * October 26 – Pan Am Flight 923, a Douglas DC-4, struck Tamgas Mountain on Annette Island, Alaska, killing all 18 passengers and crew on board; the cause is never determined. * December 27 – In the 1947 Korangi Creek crash, an Air India Douglas DC-3 crashes shortly after takeoff, killing all 23 on board. ==1948== * January 30 – The BSAA Star Tiger disappearance: an Avro Tudor IV disappears without a trace en route from the Azores to Bermuda with 31 on board. The loss of the aircraft along with the 1949 BSAA Star Ariel disappearance remain unsolved to this day, with the resulting speculation helping to develop the Bermuda Triangle legend. * March 12 – Northwest Airlines Flight 4422, a Douglas C-54 Skymaster, crashes into Mount Sanford in the Alaska Territory, killing 30. Though the wreckage was initially found, it was inaccessible; it was later buried and not rediscovered until 1999. * April 5 – In the 1948 Gatow air disaster, a British European Airways Vickers VC.1 Viking crashes near RAF Gatow, Berlin after a collision with a Soviet Air Force Yakovlev Yak-3 fighter; all 14 people on board the Viking die, as well as the Soviet pilot. * April 15 – Pan Am Flight 1-10, a Lockheed Constellation, crashes while on approach to Shannon Airport, Ireland; of the 31 on board, only one survives. * April 21 – British European Airways Flight S200P, a Vickers VC.1 Viking, crashes into Irish Law Mountain in Scotland due to pilot error; all on board survive. * June 17 – United Airlines Flight 624, a Douglas DC-6, crashes near Mount Carmel, Pennsylvania, after errors in attempting to extinguish what was believed to have been an onboard fire; all 43 on board die. * July 4 – The Northwood mid-air collision between a Scandinavian Airlines System-operated Douglas DC-6 and an RAF Avro York kills all 39 passengers and crew on board both aircraft. * July 17 – Miss Macao, a Catalina seaplane operated by a Cathay Pacific subsidiary, over the Pearl River delta from Macau to Hong Kong, is hijacked with 23 passengers and three crew on board by a group attempting to rob the passengers; following a struggle in the cockpit, a crash kills all on board except one passenger, later identified as the lead hijacker; this is the earliest known airliner hijacking. * August 1 – In the 1948 Air France Latécoère 631 disappearance, a Latécoère 631 disappears over the Atlantic Ocean with the loss of all 52 people on board. This was the worst aviation accident in the Atlantic Ocean at the time and remains the worst ever involving the Latécoère 631. * August 29 – Northwest Airlines Flight 421, a Martin 2-0-2, crashes near Winona, Minnesota, due to structural failure of a wing, killing all 37 on board in the worst ever accident involving the Martin 2-0-2. This crash is also the first loss of a 2-0-2. * September 2 – The 1948 Lutana crash; Australian National Airways Flight 331, a Douglas DC-3, crashes into high terrain near Nundle, New South Wales, killing all 13 people on board. * October 2 – In the Bukken Bruse disaster, a Det Norske Luftfartsselskap Short Sandringham flying boat, crashes upon landing in Trondheim, Norway; 19 are killed; Bertrand Russell is among the 24 survivors. * October 20 – In the 1948 KLM Constellation air disaster, a Lockheed Constellation named Nijmegen crashes near Prestwick, Scotland, killing 40. * December 28 – In the 1948 Airborne Transport DC-3 (DST) disappearance, a Douglas DC-3 disappears without a trace off the coast of Florida with 32 on board. ==1949== * January 17 – In the BSAA Star Ariel disappearance, a British South American Airways Avro Tudor IV disappears without a trace en route from Bermuda to Jamaica with 20 on board. The loss of the aircraft, along with the 1948 BSAA Star Tiger disappearance remain unsolved to this day, with the resulting speculation helping to develop the Bermuda Triangle legend. * February 19 – A British European Airways Douglas Dakota collides with a RAF Avro Anson over Exhall, Warwickshire, killing all 14 on board both aircraft. * March 10 – A Queensland Airlines Lockheed Lodestar crashes on takeoff from Coolangatta airstrip, killing all 21 on board. * May 4 – In the Superga air disaster, an Italian Airlines Fiat G.212 CP carrying the Torino football team crashes into the Superga hills near Turin, killing all 31 on board. * June 7 – In the 1949 Strato-Freight Curtiss C-46A crash, a Curtiss Wright C-46A-50 Modified D, crashes into the Atlantic Ocean shortly after takeoff from San Juan, Puerto Rico. Of the 81 passengers and crew on board, 53 are killed. * July 2 – A MacRobertson Miller Airlines Douglas DC-3 crashes on takeoff from Perth, Western Australia, killing all 18 on board. * July 12 – Standard Air Lines Flight 897R, a Curtiss C-46, crashes at Chatsworth, California, due to pilot error, killing 35 of 48 on board. * August 19 – A British European Airways Douglas DC-3 crashes into a hillside near Oldham, United Kingdom; of the 32 on board, only 8 survive. * September 9 – Canadian Pacific Air Lines Flight 108, a Douglas DC-3, explodes over Cap Tourmente near Sault-au-Cochon, Quebec, due to a bomb planted by Albert Guay; all four crew members and 19 passengers on board are killed. * October 28 – An Air France Lockheed Constellation crashes into a mountain on São Miguel Island, Azores, Portugal, killing all 48 people on board, including boxer Marcel Cerdan and violinist Ginette Neveu. * November 1 – Eastern Air Lines Flight 537, a Douglas DC-4, on approach to Washington National Airport, suffers a mid-air collision with a Lockheed P-38; all 55 people on board the DC-4 die, including Congressman George J. Bates, New Yorker cartoonist Helen E. Hokinson, and former Congressman Michael J. Kennedy; the pilot and sole occupant of the P-38 is seriously injured. * November 20 – In the Hurum air disaster, an Aero Holland Douglas DC-3 crashes near Hurum, Norway, killing 34 of the 35 on board, including 25 children. * November 29 – American Airlines Flight 157, a Douglas DC-6, en route from New York City to Mexico City with 46 passengers and crew, veers off the runway and strikes buildings after the flight crew loses control on final approach to Dallas Love Field; 26 passengers and 2 flight attendants die. ==1950== * January 5 – In the 1950 Sverdlovsk air disaster, a Lisunov Li-2 crashes near Sverdlovsk (now Yekaterinburg), Russia, killing all 19 on board. * March 7 – Northwest Orient Airlines Flight 307, a Martin 2-0-2, crashes near Minneapolis–Saint Paul International Airport, after hitting a flagpole during approach, killing all 13 on board and two on the ground. * March 12 – The Llandow air disaster: An Airflight Avro 689 Tudor V stalls and crashes after the rear cargo hold was overloaded, resulting in a center of gravity exceeding the aft limit; 80 out of the 83 people on board die, at the time the worst air disaster in history. * 1950 Air France multiple Douglas DC-4 accidents: ** June 12 – An Air France Douglas DC-4 (F-BBDE) on a flight from Saigon to Paris crashes in the Arabian Sea while on approach to Bahrain Airport, killing 46 of 52 on board. ** June 14 – An Air France Douglas DC-4, F-BBDM, crashes in the Arabian Sea while on approach to Bahrain Airport, killing 40 of 53 on board. This aircraft was operating on the same flight route as F-BBDE. * June 24 – Northwest Orient Airlines Flight 2501, a Douglas DC-4, with 58 people on board, disappears without a trace over Lake Michigan. * June 26 – Australian National Airways Amana, a Douglas DC-4, crashes after takeoff from Perth Airport, killing all 29 people on board. * August 31 – TWA Flight 903, a Lockheed L-749A Constellation, crashes because of an engine fire, in the desert about NNW of Cairo, Egypt; all 55 on board are killed in the worst ever accident involving the Lockheed L-749. * October 31 – A British European Airways Vickers VC.1 Viking crashes on the runway at London Heathrow Airport in foggy weather; of the 30 on board, only a stewardess and a passenger survive. * November 3 – Air India Flight 245, a Lockheed L-749A Constellation, crashes into Mont Blanc in France; all 40 passengers and 8 crew are killed. Sixteen years later, Air India Flight 101 crashes in almost exactly the same spot. * November 13 – In the 1950 Tête de l'Obiou C-54 crash, a Douglas C-54 Skymaster operated by Curtiss Reid Flying Services crashes from Grenoble, France, on the Tête de l'Obiou mountain; all 52 passengers and crew die. ==1951== * April 25 – Cubana de Aviación Flight 493, a Douglas DC-4 en route from Miami to Havana, collides in mid-air with a United States Navy Beech SNB-1 Kansan off Key West; all 43 aboard both aircraft are killed. * June 22 – Pan Am Flight 151, a Lockheed L-049 Constellation en route from Accra, Ghana (then the Gold Coast Territory) to Monrovia, Liberia, crashes into a hill near Sanoye in Bong County, Liberia, 54 miles (86 km) from the airport; all 31 passengers and 6 crew members die. * June 30 – United Airlines Flight 610, a Douglas DC-6, flies into a mountain in Larimer County, Colorado, due to a navigational error; all 45 passengers and 5 crew members are killed. * July 21 – A Canadian Pacific Air Lines Douglas DC-4 disappears on a flight from Vancouver, British Columbia, Canada, to Tokyo, Japan; all 37 on board are presumed dead; the aircraft has never been found. * August 24 – United Airlines Flight 615, a Douglas DC-6B, crashes near Decoto (now Union City, California), while on final approach to Oakland, California; all 44 passengers and 6 crew members die. * November 15 – A LOT Polish Airlines Lisunov Li-2 crashes near Tuszyn shortly after takeoff due to engine failure, killing all 16 passengers and crew on board. * December 16 – A Miami Airlines Curtiss C-46 Commando crashes at Elizabeth, New Jersey, after a loss of control following an engine fire, killing all 56 passengers and crew on board. * December 22 – A Misrair SNCASE Languedoc crashes west of Tehran, killing all 20 people on board. * December 29 – Continental Charters Flight 44-2, a Curtiss-Wright C-46, crashes into a ridge near Napoli, New York, while en route to Buffalo, New York; 3 crew members and 23 passengers die. ==1952== * January 22 – American Airlines Flight 6780, a Convair CV-240, crashes on approach to Newark, New Jersey, into dwellings in Elizabeth, New Jersey, killing 30 and leading to the Doolittle Commission recommendation for laws coordinating urban zoning to keep airport approach paths clear. * February 11 – National Airlines Flight 101, a Douglas DC-6 crashed into an apartment building in Elizabeth, New Jersey two minutes after departing Newark Airport. * March 3 – An Air France SNCASE Languedoc crashes on takeoff from Nice, France, due to jammed controls. All 38 people on board are killed. * April 11 – Pan Am Flight 526A, a Douglas DC-4, suffers engine failure and is forced to ditch in the Atlantic north of San Juan, Puerto Rico; 52 of 69 on board die. * April 28 – Pan Am Flight 202, a Boeing 377 Stratocruiser, crashes after a propeller failure in a remote area of Brazil on its way from Buenos Aires, Argentina, to New York City via Rio de Janeiro; all 50 on board are killed in the worst ever accident involving the Boeing 377. * June 28 – American Airlines Flight 910, a Douglas DC-6 carrying 55 passengers and 5 crew collides with a Temco Swift private plane on final approach to Dallas Love Field, killing both occupants of the Swift; the DC-6 lands safely with no injuries to the passengers or crew. * August 12 – A Transportes Aéreos Nacional Douglas C-47A explodes in mid-air on a domestic flight in Brazil; all 24 on board die. * December 6 – A Cubana de Aviación Douglas DC-4 crashes into the Atlantic Ocean off Bermuda after failing to gain altitude after takeoff, killing 37 of 41 on board. ==1953== * January 5 – In the 1953 Nutts Corner Viking accident, a British European Airways Vickers Viking crashes on approach to Belfast-Nutts Corner Airport, killing 27 of the 31 on board. * February 2 – In the 1953 Skyways Avro York disappearance, a plane with 39 on board disappears over the North Atlantic. * July 12 – Transocean Air Lines Flight 512, a Douglas DC-6A, crashes in the Pacific Ocean while en route from Wake Island to Honolulu, Hawaii. All 58 passengers and crew are killed. * August 3 – Air France Flight 152, a Lockheed L-749A Constellation ditched into the Mediterranean Sea while en route from Rome to Beirut after break-away of an engine. Four of the 8 crew and 34 passengers drowned. * September 1 – Air France Flight 178, a Lockheed Constellation, crashes into a mountain in southern France; all 42 on board are killed. * September 16 – American Airlines Flight 723, a Convair 240, crashes while on approach to Albany Airport; all 28 passengers and crew die. * October 29 – BCPA Flight 304, a Douglas DC-6B, crashes into King's Mountain, southeast of Half Moon Bay, California, on its approach to San Francisco International Airport, killing all 11 on board. ==1954== * January 10 – BOAC Flight 781, a de Havilland Comet flying from Rome to London on the last leg of a flight from Singapore, disintegrates in mid-air, when metal fatigue from repeated pressurization cycles compromises the fuselage, killing the 29 passengers and six crew. * March 13 – A BOAC Lockheed L-749A Constellation crashes as it attempts to land at Kallang Airport, Singapore; of the 40 passengers and crew on board, 33 are killed. * April 8 – South African Airways Flight 201, a de Havilland Comet flying from Rome to Cairo bound for Johannesburg, disintegrates in mid-air, killing all 14 passengers and 7 crew; as in BOAC Flight 781, the cause is metal fatigue at stress risers at the corners of the square windows in the aluminum skin. * July 23 – The 1954 Cathay Pacific Douglas DC-4 shootdown: a Cathay Pacific Douglas DC-4 is attacked by two PLAAF La-7 fighters and crashes off Hainan Island, killing 10 of 19 on board. * September 5 – KLM Flight 633, a Lockheed L-1049 Super Constellation, ditches after takeoff from Shannon Airport in Ireland, killing 28 of 56 on board. * December 25 – In the 1954 Prestwick air disaster a British Overseas Airways Corporation Boeing 377 Stratocruiser crashes on landing at Prestwick Airport, Scotland, 28 of the 36 onboard killed. ==1955== * January 12 – TWA Flight 694, a Martin 2-0-2, collides with a privately owned Douglas DC-3 over Cincinnati, Ohio, killing all 15 on board both aircraft. * February 19 – TWA Flight 260, a Martin 4-0-4, crashes into the Sandia Mountains near Albuquerque, New Mexico, killing all 16 on board. * March 26 – Pan Am Flight 845/26, a Boeing 377, ditches into the Pacific Ocean off the Oregon coast, killing four of the 23 on board. * April 4 – A United Airlines Douglas DC-6 crashes after takeoff from Long Island MacArthur Airport, New York, killing all 3 on board. * April 11 – An Air India Lockheed L-749 Constellation named Kashmir Princess explodes under suspicious circumstances; 16 people are killed and three survive. * July 27 – El Al Flight 402, a Lockheed L-049 Constellation, inadvertently strays over Bulgarian territory on its way from Vienna to Tel Aviv, and is shot down by two Bulgarian fighter aircraft, killing all 58 on board. * October 6 – United Airlines Flight 409, a Douglas DC-4, crashes into Medicine Bow Peak near Centennial, Wyoming, killing all 66 on board. * November 1 – United Airlines Flight 629, a Douglas DC-6B, is bombed by Jack Gilbert Graham over Longmont, Colorado; all 44 on board are killed. ==1956== * February 18 – The 1956 Scottish Airlines Malta air disaster: a Scottish Airlines Avro York crashes near Żurrieq, Malta due to pilot error, killing all 50 on board. * April 1 – TWA Flight 400, a Martin 4-0-4, crashes on takeoff at Greater Pittsburgh International Airport, killing 22 of the 36 on board; 14 survive. * April 2 – Northwest Orient Airlines Flight 2, a Boeing 377 Stratocruiser, ditches into Puget Sound after takeoff from Seattle–Tacoma International Airport after the cowl flaps are incorrectly set for takeoff; four passengers and a flight attendant die. * June 20 – Linea Aeropostal Flight 253, a Lockheed L-1049 Constellation, crashes into the Atlantic Ocean off Asbury Park, New Jersey. All 74 passengers and crew on board are killed. * June 24 – In the 1956 BOAC Argonaut accident, a Canadair C-4 Argonaut, crashes shortly after taking off from Kano Airport, Nigeria, into a thunderstorm, killing 32 of the 38 passengers and 3 of the seven crew. * June 30 – The 1956 Grand Canyon mid-air collision between United Airlines Flight 718, a DC-7 and TWA Flight 2, a Lockheed Constellation, over the Grand Canyon, kills all 128 aboard both aircraft; operating under Visual Flight Rules, the planes fail to see each other and collide; the Federal Aviation Administration is created in the aftermath. * July 9 – Trans-Canada Air Lines Flight 304, a Vickers Viscount, sheds a propeller blade over Flat Rock, Michigan; the blade penetrates the passenger cabin, killing one of 35 aboard; this is the first known case of a turboprop shedding a blade in passenger service. * October 16 – Pan Am Flight 6, a Boeing 377 Stratocruiser, is forced to ditch in the Pacific Ocean between Hawai'i and San Francisco; all 31 on board are rescued by a nearby United States Coast Guard ship. * November 7 – Braathens SAFE Flight 253, a de Havilland Heron, crashes into Hummelfjell mountain near Tolga, Norway, killing two of 12 on board. * November 27 – Linea Aeropostal Flight 253, a Lockheed L-749 Constellation, crashes while on approach to Caracas International Airport, killing all 25 on board. * December 9 – Trans- Canada Air Lines Flight 810, a Canadair North Star, crashes near Hope, British Columbia, Canada, killing all 62 people on board; the wreckage is found several months later. Aboard are four members of the Canadian Football League Saskatchewan Roughriders, and former Iowa Hawkeye Outland Trophy winner Cal Jones. ==1957== * February 1 – Northeast Airlines Flight 823, a Douglas DC-6, crashes during a snowstorm shortly after takeoff from LaGuardia Airport; twenty of the 101 occupants die. * March 14 – British European Airways Flight 411, a Vickers Viscount, crashes while on approach to Manchester Airport, killing all 20 on board and 2 on the ground. * May 1 – In the 1957 Blackbushe Viking accident, an Eagle Aviation Vickers VC.1 Viking crashes after engine failure at Blackbushe Airport; of the 35 on board, only a passenger survives. * July 16 – KLM Flight 844, a Lockheed Super Constellation, crashes after takeoff from Biak-Mokmer Airport, Indonesia, killing 58 of 68 on board. * August 11 – Maritime Central Airways Flight 315, a Douglas DC-4, crashes near Issoudun, Quebec after encountering turbulence in a thunderstorm, killing all 79 passengers and crew on board. * November 8 – Pan Am Flight 7, a Boeing 377 Stratocruiser, disappears between San Francisco and Honolulu; small pieces of wreckage and human remains are found almost a week later by the United States Navy; all 44 on board are believed to have been killed; incapacitation of the crew by carbon dioxide fire extinguishing agent is a suspected cause of the crash. * November 15 – In the 1957 Aquila Airways Solent crash, a flying boat crashes near Chessell, Isle of Wight, UK, due to engine failure, killing 45 out of the 58 on board. ==1958== * February 6 – In the Munich air disaster, a British European Airways Airspeed Ambassador operating as Flight 609 crashes while attempting a take off in a snowstorm from Munich-Riem Airport, killing 23 of 44 passenger and crew members on board including eight Manchester United footballers. * February 27 – In the Winter Hill air disaster, a Silver City Airways Bristol 170 Freighter travelling from the Isle of Man to Manchester Ringway Airport crashes into Winter Hill, Lancashire, killing 35 people and injuring seven. * April 6 – Capital Airlines Flight 67, a Vickers 745D Viscount, crashes at Tri-City Airport (now MBS International Airport) near Freeland, Michigan, killing all 47 passengers and crew; an undiscovered ice buildup on the wing and windy conditions are possible causes. * April 21 – United Airlines Flight 736, a Douglas DC-7, collides near Las Vegas, Nevada, with a US Air Force F-100 Super Sabre fighter on a training mission. All 47 aboard the airliner and both F-100 crew members are killed. * May 25 – 1958 Dan-Air Avro York crash, a Avro York 685, crashes during a forced landing after an engine catches fire en route from Karachi to Delhi, killing 4 of 5 on board. * August 9 – A Central African Airways Vickers Viscount crashes near Benina International Airport due to pilot error, killing 36 of 54 on board. * August 14 – KLM Flight 607-E, a Lockheed L-1049 Super Constellation (named Hugo de Groot) en route from Amsterdam to New York, crashes into the Atlantic Ocean shortly after takeoff from Shannon Airport in Ireland, killing all 99 passengers and crew, including six members of the Egyptian fencing team. * August 15 – Northeast Airlines Flight 258, a Convair 240, crashes near Nantucket International Airport due to pilot error, killing 25 of 34 on board. * September 2 – An Independent Air Travel Vickers VC.1 Viking crashes near Southall, Middlesex, killing all 3 crew on board and another 4 people on the ground. * October 22 – British European Airways Flight 142, a Vickers Viscount, collides with an Italian Air Force North American F-86 Sabre over Italy, all 31 on board die. * December 4 – An Aviaco SNCASE Languedoc crashes in the Guadarrama Mountains, killing all 21 people on board. * December 24 – A BOAC Bristol Britannia crashes near Christchurch, Dorset, England, killing 9 of 12 on board. ==1959== * January 8 – Southeast Airlines Flight 308, a Douglas DC-3, crashes into the Holston Mountain, Tennessee, United States, on approach to the Tri-Cities Regional Airport killing all ten people on board. * January 11 – Lufthansa Flight 502, a Lockheed L-1049 Super Constellation, crashes on approach to Rio de Janeiro-Galeão International Airport, Brazil, 36 of the 39 on board are killed. * February 3 – American Airlines Flight 320, a Lockheed L-188 Super Electra, crashes into the East River, New York City, as a result of pilot error; sixty-five passengers and crew are killed. * February 17 – In the 1959 Turkish Airlines Gatwick crash, a chartered Vickers Viscount 793 carrying the Turkish prime minister and other government officials crashes in heavy fog during its final approach into London Gatwick Airport; five of the eight crew and nine of the sixteen passengers die in the accident; Prime Minister Adnan Menderes is among the ten survivors. * April 23 – In the 1959 Air Charter Turkey crash, an Avro Super Trader IV crashes on Mount Süphan, Turkey; all 12 crew on board die. * May 12 – Capital Airlines Flight 75, a Vickers Viscount 745D flying from New York City to Atlanta, breaks up in flight over Chase, Maryland, due to loss of control in severe turbulence; all 31 on board are killed. * June 26 – TWA Flight 891, a Lockheed Starliner, crashes due to a lightning strike shortly after taking off from Milan Malpensa Airport. All 68 passengers and crew on board are killed. * August 19 – A Transair Douglas Dakota crashes into a mountain in Spain, killing all 32 on board. * September 24 – TAI Flight 307, a Douglas DC-7, crashes into a pine forest on departure from Mérignac Airport, France; 54 of the 65 people on board are killed. * September 29 – Braniff Flight 542, a Lockheed L-188 Electra, breaks up in mid-air and crashes from Buffalo, Texas; all 34 on board perish. * October 30 – Piedmont Airlines Flight 349, a Douglas DC-3, crashes on Bucks Elbow Mountain near Charlottesville, Virginia, killing the crew of three and 23 of 24 passengers; the sole survivor is seriously injured; the cause is a navigational error during an Instrument Landing System approach. * November 16 – National Airlines Flight 967, a Douglas DC-7B, crashes into the Gulf of Mexico while on a flight from Tampa, Florida, to New Orleans, Louisiana, in a possible case of sabotage; all 40 on board perish. The cause was suspected to have been an attempted case of Insurance fraud; the main suspect was not charged due to a lack of evidence and died of natural causes in May 1969 * November 21 – Ariana Afghan Airlines Flight 202, a Douglas DC-4, crashes after an apparent in-flight fire, killing 24 of 27 on board. == Related pages == *List of accidents and incidents involving commercial aircraft 1960 – 1989 *List of accidents and incidents involving commercial aircraft 1990 – 2019 ==References== Category:Aviation accidents and incidents",
 "title": "List of accidents and incidents involving commercial aircraft 1919 – 1959"
}