{
 "id": "565581",
 "text": "In sailing the parts of a sail have certain terms that clearly describe them. There are two types of common mainsails. The Three Sided Mainsail and the Four sided Mainsail. Each of these Mainsail types have many different names according to exact location and relationship of supporting spars. == Parts of the three sided mainsail == * The head is the very top of the sail. * The tack (noun) is the name for the lower corner of the sail closest to the mast. Not to be confused with a tack which describes which side of a sailboat the wind is coming from while under way—port or starboard. * The foot is the bottom edge of the sail from the tack to the clew. The foot of a sail attaches to the boom.Denny Desoutter, The Adlard Coles Book of Boatwords (London : Adlard Coles Nautical, 2010), p. 187 * The luff is the forward or leading edge of a sail. * The leech is the back edge of the sail. * The clew is the bottom back corner of the sail (furthest from the mast). == Parts of the four sided mainsail == * The peak is the very top of the sail. *The throat is the top front corner of the sail. * The tack (noun) is the name for the lower corner of the sail closest to the mast. Not to be confused with a tack which describes which side of a sailboat the wind is coming from while under way—port or starboard. * The foot is the bottom edge of the sail from the tack to the clew. The foot of a sail attaches to the boom. *The head is the top edge of the sail. This is different from the three sided sail where head refers to a corner. * The luff is the forward or leading edge of a sail. * The leech is the back edge of the sail. * The clew is the bottom back corner of the sail (furthest from the mast). == Parts of a headsail == The headsail of a sailboat is any sail set forward of the mast (on a single masted boat) or foremast (the mast nearest the bow).John Keegan, The Price of Admiralty (New York: Viking press, 1989), pp. 278–279 The corresponding parts are the same relative to the front of the boat. (Note: The headsail tack is the name for the lower corner of the headsail -- the sail closest to the front of the boat.) == Associated parts == * The boom is a horizontal spar (pole) that runs along the foot of a fore-and-aft rigged sail. * The jib is the next most common sail on a sailboat. It is always forward of the mainmast. * A sheet is a rope used to control a sail. == References == Category:Sailing",
 "title": "Parts of a sail"
}