{
 "id": "565684",
 "text": "Decks are the main horizontal parts of a ship's structure. The crew stand and walk on the deck.John Rousmaniere, The Illustrated Dictionary of Boating Terms (New York: W.W. Norton, 1998), pp. 48–49 A deck is the floor of a boat or ship, but open boats only have floorboards. == Common names for decks == Below is a list of the many names given to different decks. They might be confusing. The list should be used with caution because there is no one agreed system for naming decks. * 01 level is the term used to refer to the deck above the main deck. The next higher decks are referred to as the 02 level, the 03 level, and so on. Although these are formally called decks, they are usually referred to as levels. This is because they are usually incomplete decks that do not extend all the way from the stem to the stern or across the ship. * Afterdeck: The deck closest to the stern. * Berth deck: (Naval) A deck next below the gun deck. This is where the hammocks of the crew are slung. * Boat deck: Especially on ships with sponsons, the deck area where lifeboats or the ship's gig are stored. * Boiler deck: (river steamers) The passenger deck above the vessel's boilers. * Bridge deck: (a) The deck area including the helm and navigation station, and where the Officer of the Deck/Watch will be found. It is also known as the conn (b) An athwartships structure at the forward end of the cockpit with a deck. It is often lower than the primary deck, to prevent a pooping wave from entering through the companionway. May also refer to the deck of a bridge. * Flight deck: (Naval) A deck from which aircraft take off or land. * Flush deck: Any unbroken deck that runs from stem to stern. * Forecastle deck: A partial deck above the main deck under which the sailors have their berths. It runs from the foremast to the bow. * Foredeck: In a motorboat the is the deck ahead of the cockpit. In a sailboat the foredeck is ahead of the mast. * Freeboard deck: see below. * Gun deck: (Naval) a deck below the spar deck where the ships' cannon were carried. The term originally referred to a deck aboard a ship that was primarily used for the mounting of cannon to be fired in broadsides. However, on many smaller vessels such as frigates and unrated vessels the upper deck, forecastle and quarterdeck bore all of the cannons but were not referred to as the gun deck. The completely covered level under the upper deck was, however, still called the gun deck although it had no guns at all. * Hangar deck: (Naval) A deck aboard an aircraft carrier used to store and maintain aircraft. * Half-deck: That part of the deck next below the spar deck which is between the mainmast and the cabin. * Helicopter deck (Heli or Helo deck): Usually located near the stern and always kept clear of obstacles hazardous to a helicopter landing. * Hurricane deck: (River Steamers, etc.), the upper deck, usually a light deck, erected above the frame of the hull (deriving its name from the wind that always seemed to blow on the deck).Hurricane Deck * Lido deck: Open area, typically at or near the stern of a passenger ship. It usually has the main outdoor swimming pool and sunbathing area. * Lower deck: (a) the deck immediately over the hold. Originally the term was only used on a ship with two decks.Oxford English Dictionary. \"Lower n.4\". Mar. 2009 Online edition. Retrieved 2009-04-06. (b) synonym for berth deck. (c) alternative name for a secondary gun deck * Main deck: The principal deck of a vessel; the Freeboard Deck is sometimes called Main deck. In some ships, the highest deck of the hull is called Main deck. It can also be the weather deck; in sailing warships often a deck under the upper deck. * Middle or Waist deck The upper deck amidships, the working area of the deck. * Orlop deck: In a naval vessel, the deck or part of a deck where the cables are stowed, usually below the waterline. According to .Oxford English Dictionary. \"Orlop n.\". Mar. 2009 Online edition. Retrieved 2009-04-06. it is the lowest deck in a ship, but the Orlop Deck should not be confused with the tank top of a vessel with double bottom. * Poop deck: The deck forming the roof of a poop or poop cabin, built on the upper deck and extending from the mizzenmast aft. * Promenade deck: A \"wrap-around porch\" found on passenger ships and riverboats encircling the superstructure. This can have open railings or be enclosed in glass, or a combination. Often the entire level where this is located is referred to as the promenade deck. * Quarterdeck: (a) The part of the upper deck abaft the mainmast, including the poop deck when there is one. Usually reserved for ship's officers, guests, and passengers. (b) (Naval) The area to which a gangway for officers and diplomatic guests to board the vessel leads. Also any entry point for personnel. * Side-deck: The upper deck outboard of any structures such as a coachroof or doghouse, also called a breezeway * Spar deck: (a) Same as the upper deck. (b) Sometimes a light deck fitted over the upper deck. On Great Lakes bulk freighters this is the term used for the deck over the cargo holds. * Sundeck: A deck where people relax in the sun. * Sweep deck: (Naval) The aftmost deck on a minesweeper, set close to the waterline for ease in launch and recovery of equipment. * Topgallant forecastle deck: Any raised deck occurring above the forecastle deck (see above). * Tween deck: the storage space between the hold and the main deck, often retractable. * Upper deck: The highest deck of the hull, extending from stem to stern. * Vehicle deck: (Naval) aboard amphibious assault ships the deck or decks used to carry vehicles, aboard civilian ferries and other commercial vessels a deck used for a similar purpose. * Weather deck: (a) Any deck exposed to the outside. (b) The windward side decks.Webster, Noah Ed.; Webster's Unabridged Dictionary, 1913; Project Gutenberg (eText numbers 660–670) * Well deck: (a) An exposed deck (weather deck) lower than decks fore and aft. In particular it is one enclosed by bulwarks limiting flow of water and thus drainage. == Freeboard Deck == Ships over 24m long doing international business have to respect the International Convention on Load Lines. Such vessels have a deck named the Freeboard Deck. It goes from end to end in the ship and from one side to the other. Decks below the weather deck can be the Freeboard Deck, as in most ferries. The distance from the sea surface to the Freeboard Deck is named the freeboard. All these ships have a minimum freeboard. At no time may they be so deep in the water that the freeboard is smaller than the minimum freeboard. For that reason, the Freeboard Deck is an important reference point in the ship. Some shipyards and shipping companies name the Freeboard Deck as Deck 1 or 1st Deck. The decks below are 2nd Deck or Deck 2, 3rd Deck or Deck 3 etc. The decks over the Freeboard Deck have letters. The first level over the Freeboard Deck is Deck A. Over that is Deck B, Deck C etc. This system of deck names says where the deck is in the ship. This is important because the Load Line Convention has special rules about doors, windows, hatch openings and ventilation openings on Deck A and Deck B. == References == Category:Sailing Category:Ships",
 "title": "Deck (ship)"
}