{
 "id": "565727",
 "text": "The Bosniaks (Bošnjaci/Бошњаци, feminine: Bošnjakinja/Бошњакиња) are a South Slavic ethnic group native to the Southeast European historical region of Bosnia, which is today part of Bosnia and Herzegovina, who share a common Bosnian ancestry, culture, history and language. * * * * * ==Origin== They come from old Bosnia, which is today Bosnia and Herzegovina, though many of them are from the other Balkan populations, especially Serbia, Montenegro and Croatia. They come from medieval Bosnians or Bošnjani, Slavic that lived in what was then Bosnia. Medieval Bosniaks or Bosnians, called the Dobri bošnjani, \"Good Bosnians\") practiced different religions but they all spoke the Bosnian language. ===Name=== The Oxford English Dictionary says the ethnonym Bosniak was first used in English by the British diplomat and historian Paul Rycaut in 1680. He spelled it Bosnack to sound like the post- classical Latin Bosniacus (possibly earlier than 1682), the French word Bosniaque (1695 or earlier) or the German word Bosniak (1737 or earlier). An ethnonym is a name of a group of people. The 1836 version of Penny Cyclopaedia V. 231/1 uses the modern spelling: All Slavic languages use the suffix -ak for masculine nouns. For example, people from the ethnic group in Poland can be called Polak and people from Slovakia Slovaks (Slovák). Consequently, \"Bosniak\" is logic equivalent to its non-ethnic counterpart \"Bosnian,\" which came to English from Middle French as Bosnien): a native of Bosnia. English speakers usually say Bosnian Muslim to refer to Bosniaks, but this is not completely true because not all Bosniaks are Muslim. Partly because of this, ever since the country Yugoslavia broke up, people have started to say Bosniak instead of Muslim as an official way to talk about them while avoiding confusion. They also say Bosnians, but this word can mean anyone from Bosnia or Herzegovina, not just members of the Bosniak ethnic group. ==Modern times== Today, Bosniaks are mostly Bosnian-speaking and write in the Latin script or Cyrillic script. Most modern Bosniaks are Muslim, while the remainder are either agnostics or atheists. Most Bosniaks identify themselves as Sunni Muslims. . Both within the Balkans region and throughout the world, Bosniaks are often noted for their unique culture, which has been influenced by both eastern and western civilizations and schools of thought over the course of their history. A few million Bosniaks live in the Balkans, while about one million other Bosniaks live in other parts of the world. Ethnic cleansing during WWII (1939–1945) and genocide during the Bosnian War (1993–95) killed many Bosniaks. * * * * * * * * * * * Partially because of this,Committee on Foreign Relations, US Senate, The Ethnic Cleansing of Bosnia-Hercegovina, (US Government Printing Office, 1992) there has been a Bosniak diaspora in a number of countries, including Bosnian Austrians, Germany, Bosnian Australians, Sweden, Turkey, Canada, and the United States. ==Related pages== * Bosnian genocide * Srebrenica massacre ==References== Category:Ethnic groups Category:Bosnian genocide *",
 "title": "Bosniaks"
}