{
 "id": "565716",
 "text": "Wallington railway station is a train station in the London Borough of Sutton in south London. It opened in 1847. The trains for this station are operated by Southern (train operating company). This station is in fare zone 5. ==Platforms== There are two platforms for this station. Platform 1 is for trains towards Victoria station via Crystal Palace and Norbury. Platform 2 is for trains towards Sutton (Surrey), Epsom and Epsom Downs. ==Frequency== This list shows the frequency of trains on typical off-peak hours. ===Up (northbound)=== * 6 trains to Victoria station including: * 4 trains via Norbury and 2 trains via Crystal Palace ===Down (southbound)=== * 4 trains to Sutton (Surrey) * 1 train to Epsom * 1 train to Epsom Downs ==Buses== London buses routes 127, 151, 157, 410, 455, 463, 612, 627, 633 and S4 operates at this station. ==Departures== This table shows the departures from this station with the calling points and the time that is taken to get to the end of the line. Train Towards Calling Points Approximate Journey Time Southern (train operating company) Victoria station Waddon, West Croydon, Selhurst, Thornton Heath, Norbury, Streatham Common, Balham station, Wandsworth Common, Clapham Junction railway station, Battersea Park 38 minutes Southern (train operating company) Victoria Station via Crystal Palace Waddon, West Croydon, Crystal Palace, Gipsy Hill, West Norwood, Streatham Hill, Balham station, Wandsworth Common, Clapham Junction railway station, Battersea Park 45 minutes Southern (train operating company) Epsom Downs Carshalton Beeches railway station, Sutton (Surrey), Belmont, Banstead 17 minutes Southern (train operating company) Epsom Carshalton Beeches railway station, Sutton (Surrey), Cheam, Ewell East 17 minutes Southern (train operating company) Sutton (Surrey) Carshalton Beeches railway station 7 minutes ==Other websites== * Live Departure Boards - National Rail Enquiries * Category:DfT Category C2 stations Category:London Borough of Sutton Category:Rail transport stations in London fare zone 5 Category:Railway stations served by First Capital Connect",
 "title": "Wallington railway station"
}