{
 "id": "56576",
 "text": "Anthony Carelli (born March 14, 1974) is a Canadian professional wrestler and judoka. He currently works for TNA Wrestling as an authority figure. He appears under the ring name Santino Marella. He became famous in WWE, where he was a two-time Intercontinental Champion, one-time United States Champion, and one-time Tag Team Champion with Vladimir Kozlov. He played an Italian character. Outside of wrestling, Carelli owns his own judo dojo and is the official ambassador of Judo Canada. ==Career== Carelli was signed by World Wrestling Entertainment in 2005 for Ohio Valley Wrestling, WWE's farm territory. He made his WWE debut on the April 16, 2007 edition of WWE Raw in Milan, Italy under the name of Santino Marella (as a tribute to Robert \"Gorilla Monsoon\" Marella). As an Italian fan selected by Mr. McMahon, he won the Intercontinental Championship from Umaga with the help of Bobby Lashley. With this, Marella became one of a few superstars to win a title in their first main roster match. He was also involved in a storyline where he worked as Santina Marella, Santino's twin sister, who would become \"Miss WrestleMania\" at WrestleMania XXV. On July 6, 2014, at a live event in Toronto, Ontario, Marella announced his retirement because of a third major injury to his neck. On May 6, 2016, Carelli was released from WWE because of an injury. He returned to wrestling in 2017. == Personal life == Carelli and his former wife Petrina have a daughter, Bianca Carelli, who won the Miss Teen Ontario-World pageant in 2013. Carelli married bikini fitness competitor Anna Babij, in November 2015. His daughter Bianca wrestled for the NWA and is currently signed to WWE, where she performs on the NXT brand under the ring name \"Arianna Grace\". == Championships and accomplishments == ===Judo=== *Ashai Annual Tournament (2017) - Bronze ===Professional wrestling=== * The Baltimore Sun ** Newcomer of the Year (2007) * DDT Pro-Wrestling ** Ironman Heavymetalweight Championship (1 time) * Ohio Valley Wrestling ** OVW Television Championship (2 times) * Pro Wrestling Illustrated ** PWI ranked him No. 60 of the top 500 singles wrestlers in the PWI 500 in 2012 * World Wrestling Entertainment / WWE ** WWE Intercontinental Championship (2 times) ** WWE United States Championship (1 time) ** WWE Tag Team Championship (1 time) – with Vladimir Kozlov ** Miss WrestleMania Battle Royal (2009) * Wrestling Observer Newsletter ** Best Gimmick (2007, 2008) == Filmography == Film Film Film Film Year Title Role Reference 2014 Scooby-Doo! WrestleMania Mystery Santino Marella 2014 Jingle All the Way 2 Claude 2016 Countdown Himself Television Television Television Television Year Title Role Notes 2016–present Aftermath Himself Panelist 2020–present Miss Persona Alfredo == References == ==Other websites== * Category:1974 births Category:Living people Category:Canadian judoka Category:Canadian professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling authority figures Category:Sportspeople from Mississauga Category:Total Nonstop Action Wrestling people",
 "title": "Santino Marella"
}