{
 "id": "565740",
 "text": "The arrondissement of Strasbourg is an arrondissement of France in the Bas- Rhin department in the Grand Est region. Its capital, and prefecture of the department, is the city of Strasbourg. ==History== The arrondissement of Strasbourg was created at the 2015 arrondissements reform by the merger of the former arrondissement of Strasbourg-Ville with part of the arrondissement of Strasbourg-Campagne. ==Geography== The arrondissement of Strasbourg is in the west of the Bas-Rhin department. It is bordered to the north by the Haguenau- Wissembourg arrondissement, to the south by the Sélestat-Erstein arrondissement, to the southwest by the Molsheim arrondissement and to the west by the Saverne arrondissement. Germany is to the east of the arrondissement. The arrondissement of Strasbourg is the smallest of the arrondissements of the department with an area of but is the one with more people living in it with a population of 484,157 inhabitants for a population density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are 11 cantons in the arrondissement of Strasbourg: # Brumath (6703) (partly) # Hœnheim (6706) # Illkirch-Graffenstaden (6707) # Lingolsheim (6709) # Schiltigheim (6715) # Strasbourg-1 (6717) # Strasbourg-2 (6718) # Strasbourg-3 (6719) # Strasbourg-4 (6720) # Strasbourg-5 (6721) # Strasbourg-6 (6722) ===Communes=== The arrondissement of Strasbourg has 33 communes; they are (with their INSEE codes)ː # Achenheim (67001) # Bischheim (67043) # Blaesheim (67049) # Breuschwickersheim (67065) # Eckbolsheim (67118) # Eckwersheim (67119) # Entzheim (67124) # Eschau (67131) # Fegersheim (67137) # Geispolsheim (67152) # Hangenbieten (67182) # Hœnheim (67204) # Holtzheim (67212) # Illkirch-Graffenstaden (67218) # Kolbsheim (67247) # Lampertheim (67256) # Lingolsheim (67267) # Lipsheim (67268) # Mittelhausbergen (67296) # Mundolsheim (67309) # Niederhausbergen (67326) # Oberhausbergen (67343) # Oberschaeffolsheim (67350) # Osthoffen (67363) # Ostwald (67365) # Plobsheim (67378) # Reichstett (67389) # Schiltigheim (67447) # Souffelweyersheim (67471) # Strasbourg (67482) # Vendenheim (67506) # La Wantzenau (67519) # Wolfisheim (67551) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 67482 Strasbourg 276,170 Strasbourg-1, Strasbourg-2, Strasbourg-3 Strasbourg-4, Strasbourg-5, Strasbourg-6 Eurométropole de Strasbourg 67447 Schiltigheim 31,610 Schiltigheim Eurométropole de Strasbourg 67218 Illkirch- Graffenstaden 26,949 Illkirch-Graffenstaden Eurométropole de Strasbourg 67267 Lingolsheim 17,622 Lingolsheim Eurométropole de Strasbourg 67043 Bischheim 17,229 Schiltigheim Eurométropole de Strasbourg 67365 Ostwald 11,997 Illkirch- Graffenstaden Eurométropole de Strasbourg 67204 Hœnheim 10,962 Hœnheim Eurométropole de Strasbourg 67471 Souffelweyersheim 7,731 Hœnheim Eurométropole de Strasbourg 67152 Geispolsheim 7,244 Lingolsheim Eurométropole de Strasbourg 67118 Eckbolsheim 6,694 Hœnheim Eurométropole de Strasbourg ==Related pages== * Arrondissements of the Bas-Rhin department * List of arrondissements of France ==References== Strasbourg",
 "title": "Arrondissement of Strasbourg"
}