{
 "id": "565960",
 "text": "Vrbànjci is a village in the Bosnia and Herzegovina, in the Municipality of Kotor Varoš, Republika Srpska. == Geography == Vrbanjci spread along the Vrbanja river (for which it is named), between its tributaries Jezerka, Bosanka, and Cvrcka.Vojnogeografski institut, Ed. (1955): Prnjavor (List karte 1:100.000, Izohipse na 20 m). Vojnogeografski institut, Beograd.Spahić M. et al. (2000): Bosnia and Herzegovina (1: 250 000). Publishing company \"Sejtarija\", Sarajevo.Mučibabić B., Ed. (1998): Geografski atlas Bosne i Hercegovine. Geodetski zavod BiH, Sarajevo, . == History == The history of this area commemorates the battle on The Field of Večići, on the Vrbanja river, where was the clash between the Ottomans army and repressed pro Bosnian forces, from almost the entire State of Bosnia. According to the historical context, it probably happened around 1463, when Bosnia fell under Ottoman Administration. During the last War in Bosnia (1992–1995), Serb paramilitary and police forces have committed severe crimes against the civilian Bosniaks and Croats populations in Vrbanjaca and surrounding villages, including VečićiGutman R. (1993): A witness to genocide: The 1993 Pulitzer Prize-Winning Dispatches on the \"Ethnic Cleansing\" of Bosnia. Macmillan Publishing Company, Inc., New York, .Beč J. (1997): Pucanje duše. Samizdat B92, Beograd, . Most of the refugees of the Bosniak population are back in their native lands and have restored their houses, with the assistance of the international community, but above all thanks to their own resources. Since 1995, parents of Bosniak's pupils at the local Elementary school \"Sveti Sava\" have been running a leongly court case to exercise their Constitutional right to teach in their native Bosnian language. Following a decade-long denial of the lawsuit at the Municipal Court in Kotor Varoš and the District Court in Banja Luka, the Constitutional Court of RS issued a verdict in their favor only in December 2019, obliging the defendant to reimburse all costs of the trial.M. N. (2019): Presuđeno u korist bošnjačkih učenika – bosanski jezik se mora uvesti u školu u Vrbanjcima. Klix Accessdate, December 5, 2019. ==Population== VrbanjciBook: \"Nacionalni sastav stanovništva–Rezultati za Republiku po opštinama i naseljenim mjestima 1991\", Statistički bilten br. 234, Izdanje Državnog zavoda za statistiku Republike Bosne i Hercegovine, Sarajevo.Internet–Source, \"Popis po mjesnim zajednicama\"–http://www.fzs.ba/Podaci/nacion%20po%20mjesnim.pdf Census year 1991 1981 1971 Bosniaks 1.468 (49.34%) 487 (29.89%) 514 (31.07%) Croats 799 (26.85%) 689 (42.29%) 651 (39.35%) Serbs 658 (22.11%) 373 (22.89%) 473 (28.59%) Yugoslavians 41 (1.37%) 79 (4.84%) 13 (0.78%) Others and Unknown 9 (0.30%) 1 (0.06%) 3 (0.18%) Total 2,975 1,629 1,654 == Related pages == * Vrbanja river * Kotor Varoš * Večići ==References== Category:Settlements in Bosnia and Herzegovina",
 "title": "Vrbanjci"
}