{
 "id": "56616",
 "text": "The National Gallery, London is an art gallery in London, England, which has one of the finest collections of European paintings in the world. What makes this gallery so important is that, although there are bigger galleries, The National Gallery has many paintings of very high quality and also because it has paintings by famous artists whose works are very rare. These rare paintings include works by Duccio, Masaccio, Uccello, Piero della Francesca, Leonardo, Giorgione, Michelangelo, Caravaggio, Vermeer, Chardin, Klimt, Rousseau and Redon. The National Gallery is on Trafalgar Square, which is one of the busiest tourist places in London. It is a grand building of pale grey limestone, with a central dome and a large Classical style porch (portico) like an Ancient Greek temple. To the left side, the gallery has a large new building called The Sainsbury Wing. == History == In 1823 a collector called Sir George Beaumont offered to give his famous collection of paintings to the British Government to start a public art gallery. In 1824 another famous collection of paintings was on sale. The owner, John Julius Angerstein, had died. It looked as if his paintings would be sold outside England. Then there was another offer of paintings from a third collector, The Reverend Holwell Carr. The Parliament had to make a quick decision. The Parliament voted that a national collection should be started and a gallery should be built. They gave 60,000 Pounds Sterling to buy the Angerstein paintings. They got 38 pictures and were able to display them publicly in the Angerstein House. The collection grew quickly with the Beaumont and Holwell Carr paintings, and others, being bought or given. A new gallery was needed. In 1831 the plans of the architect William Wilkins were accepted. The site which looks over Trafalgar Square was chosen, old buildings were demolished and the magnificent new gallery was opened on April 9, 1838. When the National Gallery opened, there was a strong opinion that paintings of the High Renaissance period of the late 1400s to Baroque paintings of the 1600s were the finest type of art. The word primitive was used to describe Italian paintings from the 1300s and early 1400s. Luckily, the director of the Gallery, Sir Charles Eastlake, thought it was important to collect some of these primitive paintings, as well as the more popular High Renaissance paintings. That is how the National Gallery came to own so many very rare works from the Late Middle Ages and Early Renaissance periods. In the 1870s the Gallery was lucky to get two collections of paintings by famous Dutch artists. The building had to be made larger to house them. The Gallery was also given paintings by famous British artists; soon there were so many that most of them were moved out to a new gallery called the Tate. By the 20th century, it was getting more difficult to buy very important paintings; there were other galleries in the United States and Germany who were trying to buy the same paintings. So the National Gallery began to buy works by more modern painters and soon had a collection of 19th and early 20th century paintings. This is not a large part of the National Gallery's collection, but it does show small works by many very important artists, particularly the Impressionists. == Important paintings == === Early Italian === * Duccio, Madonna and Child, c.1300, Sienna * Masaccio, Madonna and Child, c.1426, Florence * Fra Angelico, Christ in Glory, c.1435, Florence * Uccello, St George and the Dragon, c.1450, Florence :The story of this painting is Christian legend about dragon that has stolen a princess. The princess charmed the dragon and tied it with her belt, but she could not escape. The noble George came to her rescue and killed the Dragon. There are many paintings of Saint George in the National Gallery because he is the patron saint of England. Uccello has tried to show the perspective of the landscape by arranging light and dark areas on the ground. Diagonal lines are important in this picture. The line made by the dragon's wing and leg go the same direction as George's spear while the body and tail go in the opposite direction. * Piero della Francesca, The Baptism of Christ, c.1450, Umbria * Mantegna, The Agony in the Garden, 1460, Mantua * Pollaiuolo, The Martyrdom of Saint Sebastian, 1475, Florence * Sandro Botticelli, Mars and Venus, 1480s, Florence :The story of this painting comes from Roman Mythology. Mars the God of War, has been making love to Venus, the Goddess of Love. He is so tired that he does not know that little fauns are playing with his weapons. But one is about to blow a big shell loudly in his ear. The message of this painting is that Love can win over War. The design is based on a big W. which makes the painting symmetrical. Botticelli did this for the bedroom of Giuliano de'Medici, a wealthy nobleman from Florence. He painted Mars to look like Giuliano and Venus to look like his girlfriend but Giuliano did not have much time to enjoy his paintings as he was murdered only a short time later. * Perugino, Madonna and Child with the angels Michael and Raphael, 1496, Perugia * Giovanni Bellini, Portrait of Leonardo Loredano, Doge of Venice, 1501, Venice === Early Northern European painting === * Unknown painter, The Wilton Diptych, c.1395, England or France :The Wilton Diptych is one of the most precious paintings in the National Gallery, because most small art works from Middle Ages in England were destroyed. This painting shows King Richard II of England being presented to the Virgin Mary by his three patron saints. It is painted in tempera; the colours are mixed with egg. The word \"diptych\" means it is in two parts and can be closed like a book. The background is covered with thinly beaten gold leaf. The blue is made from ground-up semi-precious stone, lapis lazuli. It may have been painted as a wedding present for the King while he was in France . * Jan van Eyck, The Arnolfini Wedding, 1434, Belgium * Hans Memling, Virgin and Child with saints and donors, 1477, Bruges * Rogier van der Weyden, Pieta, c.1460, Brussels * Hieronymous Bosch, The Mocking of Christ, c.1480, Bois-le-Duc * Albrecht Durer, The Painter's Father, 1497, Nuremberg * Gerard David, Virgin and Child with saints and a donor, 1505, Bruges. :This painting is an altarpiece for a church. It shows the Virgin Mary seated like a queen on a throne with the Child Jesus. He is worshipped by three female saints and by the man who has paid the artist to do the picture for the church. He is called the \"donor\". Everything in the picture has been painted in great detail, the clothes, the tiles, the jewelry, the buildings and the flowers. Many of the things in the picture are symbols. The little dog is the symbol of faithfulness. The lilies are the symbol of the purity of the Virgin Mary. The painting does not show part of a story or a moment in time. The picture has been painted to help the viewer calm the mind for prayer. * Lucas Cranach, Cupid, stung by a bee, 1522, Weimer * Hans Holbein, The Ambassadors, 1533, born Augsburg died London. See below. * Pieter Breughel the Elder, The Adoration of the Kings, 1564, Brussels === Italy in the 1500s === * Leonardo da Vinci, The Virgin of the Rocks, c.1506, Milan. See below. * Michelangelo, The Entombment of Christ, c.1506, Rome. See below. * Raphael, The Ansidei Madonna, c.1505, * Giorgione, Adoration of the Kings, 1507, Venice * Titian, Bacchus and Ariadne, 1523, Venice :This picture comes from Greek Mythology. Princess Ariadne has been shipwrecked on Naxos, the island of Bacchus. Bacchus sees Ariadne and falls in love at first sight. Titian shows him leaping from his chariot which is pulled by cheetahs, while Ariadne turns to run away. But Ariadne has looked into Bacchus's eyes, and she has fallen in love also. In the sky is the crown of stars which Bacchus gave her at their wedding. Titian has painted a spiral movement in many of the figures. It can be seen in Ariadne's red scarf. Although this painting is about Mythology, the figures are very realistic. * Parmigiano, Madonna and Child with St John, 1527, Parma * Lorenzo Lotto, Lady as Lucretia, 1530, Venice : This portrait shows a woman in a richly coloured velvet dress, holding a drawing of Lucretia, a noble woman of Ancient Rome who committed suicide by stabbing herself after she had been raped. The painting may have been done for a family who wanted their daughter to marry well. The symbolism of the painting shows firstly that the young woman is rich and secondly, she is sexually pure. These two things were important in making a good marriage. Lotto has used contrast of colour in the orange and green dress to make a rich effect. He has also made an unusual use in the contrast of tone. Very light areas such as her face, bosom and hand control the centre of the painting. Three more very light areas are placed to the right side, the drawing, hand and note. This arrangement is asymmetrical * Bronzino, Allegory, c.1550, Florence. See below. * Tintoretto, St George and the Dragon, 1560s, Venice === Italy, France and Spain in the 1600s === * Caravaggio, The Supper at Emmaus, c.1600, Rome :This painting is based on a story from the Bible.Gospel of Luke chapter 24 Two of Jesus' followers were walking on the road to Emmaus, talking sadly about the death of Jesus. A man came and walked with them, but at first they did not know him. That night, having dinner at an inn, they suddenly knew it was Jesus who had risen from the dead and was now alive. Caravaggio has shown this moment in time as if it was a photograph. The things that make this picture seem so real are the light, the movement and the details. Caravaggio has painted the light coming from one side as if there was a large lamp. The head of the innkeeper makes a shadow behind Jesus that is like a halo. The picture has caught a single second when Jesus has raised his hand, one man starts to stand up and the other is throwing his arms out. Only the innkeeper is still. The view of Jesus' hand, the man's arms and the other man's elbow are foreshortened. The details show ordinary people with ordinary clothes that are old and torn. There is also a still life of the basket at the edge of the table. Caravaggio's lighting and realism were copied by many other painters, including Rembrandt and Velazquez. * El Greco, Christ driving the Traders from the Temple, c.1600, Toledo * Annibale Carracci, Quo vadis?, 1602, Rome * Claude Le Lorrain, Departure of the Queen of Sheba, 1648, France and Rome : This imaginary landscape is based on a story from the Bible.1 Kings chapter 10. In this scene, the Queen of Sheba is setting out on her journey from Africa to Palestine to meet King Solomon. But what the artist really wanted to show was the misty morning light of the sunrise over the sea. He has also painted three different types of buildings. To the left is an ancient ruin like the ones the artist saw in Rome. In the background is a castle and tower from the Middle Ages. To the left the Queen is coming out of a grand palace in the new style of the Renaissance. Nothing in this painting has anything to do with Africa or Palestine. It is about Rome. By showing the Queen of Sheba, Poussin is saying that the city of Rome, with all its history for 2000 years, is like the most beautiful and intelligent Queen that ever lived. This sort of painting is called an \"allegory\". * Nicholas Poussin, Bacchanale, 1603, France and Rome : This painting is a scene from Roman Mythology. The women are nymphs, the spirits of the forest. Some of the men are satyrs and have goats' horns and hoofs. They live on Naxos, the island of Bacchus, and spend a lot of time getting drunk, dancing and making love. In this wild party, even the babies are drinking wine. One nymph is about to smash a wine jug on the head of a satyr, who is trying to kiss her friend. Poussin has used big areas of bright colour. At first, the painting looks like a jumble of bodies, but everything is very carefully arranged to give a dancing effect to the whole picture. A big triangular shape contains all the figures. Outside the triangle on the right is a statue of Pan. On the left side is a beautiful landscape. * Diego Velazquez, The Rokeby Venus, 1649, Madrid. :This picture is taken from Roman Mythology. It shows Venus, Goddess of Love and Beauty, looking into a mirror held by her son Cupid. Velazquez spent most of his time painting portraits for the Royal Family of Spain and their relatives. He is one of the most famous portrait painters of all time. But this painting was probably done for himself, and when he did it, he put himself in danger of serious punishment. In Spain, although the King ruled, the Church was in control. They watched everything that everybody did, and had a very large number of people put to death. It was against the law in Spain to paint nude pictures like this one. Velazquez has been very careful to only show her back. The image of the face is not very clear. Old mirrors were not as clear as modern ones. Perhaps Velazquez wanted to disguise the face of the woman for her protection. The arrangement and colouring in this painting is very simple. The graceful lines of the body are repeated in the grey and white bed covers. The red curtain is at the same angle as her head, and is a warm colour, like her pink flesh. * Murillo, The Two Trinities, 1681, Seville === Holland and Flanders in the 1600s === * Gerrit von Honthorst, Christ before the High priest, 1617, Utrecht * Rembrandt, Belshazzar's Feast, 1630s, Leyden :Rembrandt is best known as a painter of portraits, in particular for the many self portraits that record his life from when he was a teenager to his old age. He also painted many scenes from the Bible like this one. Prince Belshazzar's father had taken the Jewish people to Babylon as slaves. Belshazzar was giving a party and he sent servants to bring the gold cups that had been stolen from the Temple in Jerusalem. Suddenly a strange hand appeared and wrote a message on the wall. No-one knew what it meant so Balshazzar asked Daniel, who was a Jewish prophet. Daniel said \"You have been weighed and measured by God. You do not meet God's rules. Your days are numbered!\" This painting shows how much the Dutch painters learnt from Caravaggio. This painting can be compared to the Supper at Emmaus. It is another scene full of drama. Rembrandt has placed two of the figures at unusual angles. Belshazzar's body is facing the viewer, but his head is screwed around to see what is happening behind him. As he leaps up from his chair, he knocks the golden cup held by one of his wives. She is also at an odd angle because the viewer lookes down on her head and shoulders. Rembrandt has made a contrast between the rich texture of his robes and his flabby face and fat belly. * Anthony van Dyck, Charles I of England on Horseback, 1631, London. See below. * Peter Paul Rubens, The Judgement of Paris, 1632, Antwerp :Rubens was such a popular painter that he became rich and famous. He painted portraits and many scenes from the Bible and Mythology. The story of this painting is from Greek and Roman Mythology. Paris was a prince who was brought up by a shepherd. He was given a golden apple and asked to judge a beauty contest between three Goddesses: Juno, the Goddess of the Family; Minerva, the Goddess of War and Venus, the Goddess of Love. Each one offered a reward: wealth, success in battle and the most beautiful woman in the world as his wife. Paris chose the last and gave the apple to Venus. This made two very powerful people angry. And, what he did not realise was that the most beautiful woman in the world, Helen of Troy, was already married. Rubens has painted a picture to decorate the wall of the home of a rich patron. The painting has lots of details that help to tell the story. These include little Cupid, a sheepdog, Juno's peacock, Minerva's scary shield and sheep grazing in the beautiful landscape. But the most important things in the painting are the three beautiful nudes. This was what made Ruben's pictures so popular. * Franz Hals, Family group, 1640s, Antwerp * Pieter der Hoogh, Courtyard in Delft, 1658, Delft. See below. * Johannes Vermeer, Young Woman at the Virginals, c.1670, Delft. See below. * Meyndert Hobbema, The Avenue, 1689, Middelharnis : Landscape painting became very popular in Holland in the 1600s. In this picture perspective is very important. In a very flat country, it can be hard to judge how far away things are. Hobbema has used this straight road with two rows of tall trees to give a feeling of how far away the town is. At first glance this painting seems quite symmetrical. But Hobbema has added lots of differences to make the painting more interesting, balancing a farmhouse on one side with a church on the other and making the two rows of trees quite different. === The 1700s === * Watteau, The Lovers, c.1720, France * Giambattista Pittoni ,The Sacrifice of Polyxena, 1740, Venice * Canaletto, The Basin of St Mark's on Ascension Day, c.1740, Venice * Chardin, The little Teacher, c.1740, Paris. See below. * William Hogarth, Marriage a la Mode ( a story in six pictures), 1743, London * George Stubbs, A Family in their Phaeton, c.1750, England : In the 1700s, landscape paintings were popular in England, but they were more than just pictures of the beautiful countryside painted as decorations for a room. Most landscape paintings were also records of a family and the land that they owned. They were a sign of the family's wealth and status. In this painting the landowners show off their private park with its variety of trees. They also show off their splendid pair of horses and their elegant carriage called a \"phaeton\". Together, this coach and horses are the 18th century equivalent of a very expensive car. Stubbs was most famous for painting horses. He was a master at composing beautiful pictures. Here, he has created a balance between the lady's large fashionable hat set against the dark tree and the black horses against the pale sky. * Tiepolo, Allegory of Love and Time, 1754, Italy * Joshua Reynolds, Sir Banastre Tarleton, 1782, London * Thomas Gainsborough, The Morning Walk, 1786, London * Goya, The Duke of Wellington, 1812, Spain and France === 1800 onwards === * Turner, The Temeraire, 1838, London :This is a sad painting. Its full name is The Fighting Temeraire tugged to her last Berth to be broken up as scrap. This is the last journey for one of the great warships that had fought for England against the French Fleet at the Battle of Trafalgar. Her tall elegant shape makes a contrast to the dirty black tugboat with smoking funnel that is towing her away. Turner, who was expert at painting the sea, the sky and the weather, has placed the moon in the sky near the sailing ship. The moon is in its last phase. On the other side of the picture, the sun rises with a red glow like fire on the water. The waning moon is the symbol of the passing of the age of great sailing ships. The blazing sun on the water is the symbol of the new age of the steam engine. * Constable, The Haywain, 1821, Suffolk * Ingres, Madame Moitessier, 1856, Paris * Courbet, Women on the Bank of the Seine, 1857, France * Henri Fantin-Latour, Apples on a Dish, 1861, France :This picture is a still life. In the Renaissance, carvings of still lifes were often part of the wooden decoration inside important rooms in a palace. In the 1600s and 1700s paintings of still lifes also became common and were most often seen in the dining room, where fruit, flowers and animals that had been killed for meat were fashionable decoration. In the 1800s many artists like Fantin-Latour painted small still lifes like this one to practice their skills at arranging a picture, at studying light and at studying texture. Many artists also painted still lifes because they were too poor to pay for an artist's model, or the weather was too bad to paint landscapes. Fantin-Latour did a large number of small pictures like this. He has arranged four apples of different colours and shapes and has made a study of how the light looks on their curved surfaces. * Manet, The Waitress, 1879, Paris * Claude Monet, The Houses of Parliament, London, French painter. See below. * Renoir, The Umbrellas, c.1880, France * Seurat, The Bathers at Asnieres, 1884, France :Seurat was a friend of the French Impressionist painters. He had a theory that all colour was made up of lots of colours which were sorted out when light passed into the eye. He experimented with colour by painting in tiny dots. His style of painting is called Pointillism. This large painting took a long time to do. Even though it is an outdoor scene with lots of figures, it is very still, as if time has stopped. When the painting is looked at closely, it can be seen that even the parts that seem white or black are made of hundreds of tiny dots of colour. * Edgar Degas, Combing Hair, c.1885, Paris * Cezanne, Mountains in Provence, 1890, Provence * Vincent van Gogh, Landscape with Cypress Pine, c.1890, France :Vincent van Gogh had a difficult and troubled life. He was born in Holland but went to paint in France. He had very few friends and had difficulty selling his paintings. Luckily he had the support of his brother Theo and a doctor for whom he painted pictures. This landscape is a good example of his style. In the painting, everything seems to have a life of its own. The clouds are like great beasts that roll across the sky, the waving grain reaches out like hands, the mountains are rumbling and the cypress pine looks quite dangerous. Vincent used each brush stroke to help create this flame-like movement. Another important thing in this painting is contrast. The colours change from warm reddish-orange to ice-blue. The big dark tree to the right is in tonal contrast with the white clouds. The vertical direction of the tree is in contrast to the horizontal direction of the landscape. In 1890, Vincent took his own life after painting hundreds of pictures in only five years. * Henri Toulouse-Lautrec, Woman in the Garden, 1891, France * Douanier Rousseau, Tiger frightened by a Storm, 1891, Paris * Gustav Klimt, Portrait of Hermine Gallia, 1904, Vienna == Gallery == Image:Duccio di Buoninsegna 068.jpg|Duccio was a Medieval painter. C.1310 Image:Piero della Francesca 041.jpg|Piero della Francesca was an Early Renaissance painter. c.1480 Image:Andrea Mantegna - Madonna in Glory with Saint John the Baptist, Saint Gregory the Great, Saint Benedict and Saint Jerome - 1497.jpg|Mantegna's Madonna and Child is a symmetrical arrangement. c.1478 Image:Robert Campin - The Virgin and Child before a Firescreen (National Gallery London).jpg|Robert Campin's Madonna and Child is asymmetrical. 1430 Image:Michelangelo Buonarroti 045.jpg|Michelangelo's way of painting figures was copied by other artists. c.1505 Image:Leonardo - St. Anne cartoon.jpg|Leonardo drew this cartoon with a wild landscape in the background. c.1500 Image:Angelo Bronzino 001.jpg|Bronzino was inspired by Michelangelo in this very strange picture. c.1550 Image:Joachim Patinir 003.jpg|Patinir painted rocky landscapes like Leonardo. c.1520 Image:Pope Julius II.jpg|Raphael's painting of Pope Julius II was copied many times. 1512 Image:Giovanni Bellini 014.jpg|Formal portrait- Giovanni Bellini painted this portrait of the Duke of Venice. 1501 Image:Titian - Portrait of a man with a quilted sleeve.jpg|Titian's portrait may have been inspired by Raphael. c.1515 Image:Hans_Holbein_the_Younger_- _The_Ambassadors_-_Google_Art_Project.jpg|Formal portrait- Holbein painted two young Ambassadors. 1533 Image:Self-portrait_at_34_by_Rembrandt.jpg|Self portrait- Rembrandt had seen portraits by Raphael and Titian. c.1640 Image:Anthonis van Dyck - Equestrian Portrait of Charles I - National Gallery, London.jpg|Court portrait- Van Dyck was ambassador to King Charles I of England. c.1635 Image:Dominique Ingres - Mme Moitessier.jpg|Important people- A lady in the Classical style by Ingres. 1856 Image:Thomas Gainsborough 015.jpg|Important people- An actress in the Romantic style by Gainsborough. c.1780? Image:Johannes Vermeer - Zittende Klavecimbelspeelster (1673-1675).jpg|Interiors- Vermeer painted scenes of Dutch homelife. c.1670 Image:Pieter de Hooch - The Courtyard of a House in Delft.jpg|Exteriors- De Hooch painted the streets and houses as well. 1658 Image:Jean-Baptiste Siméon Chardin 015.jpg|Odinary people at home- A young teacher by Chardin c.1740 Image:William Hogarth - The Shrimp Girl - WGA11467.jpg|Ordinary people in the street- Hogarth caught the happiness of this fish-seller. c.1750 Image:Constable_-_The_Cornfield.jpg|Constable painted landscapes using small studies that he did outdoors. c.1820 Image:Monet Houses of Parliament, Sunset.jpg|Monet painted outdoors to catch the changing light. c.1880? Image:Edgar Germain Hilaire Degas 047.jpg|Degas' paintings of people doing ordinary things are like snapshots. c.1880 Image:Vincent Willem van Gogh 127.jpg|Vincent van Gogh hoped his bright pictures would make people happy. 1888 ==Related pages== * Uffizi * Louvre * Hermitage == References == * Michael Wilson, The National Gallery, London, 1977, Charles Letts and Co. Category:Museums in London Category:Art museums in the United Kingdom Category:National museums",
 "title": "National Gallery, London"
}