{
 "id": "56612",
 "text": "The Madonna and Child or The Virgin and Child is often the name of a work of art which shows the Virgin Mary and the Child Jesus. The word Madonna means \"My Lady\" in Italian. Artworks of the Christ Child and his mother Mary are part of the Roman Catholic tradition in many parts of the world including Italy, Spain, Portugal, France, South America, Switzerland, and the Philippines. Paintings known as icons are also an important tradition of the Orthodox Church and often show the Mary and the Christ Child. They are found particularly in Eastern Europe, Russia, Egypt, the Middle East and India. ==Types of art work== ===Paintings=== Works of art which show the Madonna and Child can be paintings or sculptures. Some paintings are very large and show the Madonna on a throne, with saints standing around it. These paintings are altarpieces; they are designed to go above the altar in a church. In some churches, particularly in Italy and in Eastern Orthodox Churches, there are many wall paintings and mosaics of the Madonna and Child. Most Madonna and Child paintings are small. They have been painted for private owners and would usually have been kept in houses. They might be hung on the wall above a table where flowers and candles could be placed to honour the Virgin Mary. Most of the famous ones are now in art galleries. ===Sculpture=== Many Catholic churches have statues of the Virgin Mary with the Christ Child, These are sometimes life-sized and are painted, with real hair and glass eyes so that they look lifelike. Other statues of the Madonna and Child are very small. In the Middle Ages small statues were carved from ivory. These precious statues are often very beautifully and delicately made. They can often be seen in museums. In Florence in the early 1400s, an artist called Luca della Robbia began making terracotta statues and sculptured altarpieces from clay, which were fired and glazed with colours, most often blue and white, but also purple, green and yellow. This family business lasted for 120 years. Many statues of the Madonna and Child may be factory-made and sold as souvenirs. This tradition of small statues has been around for hundreds of years. Many of them were made in artist's workshops in the Early Renaissance ===Icons=== In the Orthodox Church, there is also a long tradition of painting images of the Virgin Mary with the Christ Child. These pictures, which are often quite small and are painted on wooden panels, are often very careful copies of particular famous icons. This tradition continues to the present day. ==Famous images of the Madonna and Child== File:Madonna of the Carnation Leonardo da Vinci.jpg|Madonna of the Carnation (1478) Alte Pinakothek of Munich by Leonardo da Vinci File:Pittoni_Madonna_and_Child_with_two_angels.jpg|Madonna with child and two angels National Museum of Warsaw by Giambattista Pittoni File:Raphael_Madonna_of_the_Meadow.jpg|Madonna del Prato, (1505-06) Kunsthistorisches Museum, Wien by Raphael Image:La Vierge et l'Enfant en majesté entourés de six anges - Cimabue - Musée du Louvre Peintures INV 254 ; MR 159.jpg|by Cimabue, c.1270, Florence, now in the Louvre Image:Bartolomé Esteban Perez Murillo 018.jpg|This well-loved picture by the Spanish artist Murillo is in the Pitti Palace Gallery in Florence. Image:Pietro Lorenzetti 002.jpg|This painting is called the Madonna of the Sunset because the sun shines on its gold background in the afternoon. Mary and baby Jesus are talking about St Francis of Assisi. ===Large altarpieces=== * The Trinita Madonna, by Cimabue, 1280 * The Rucellai Madonna, by Duccio, 1285 * The Maesta, the Madonna in Majesty by Duccio, c.1308. Duomo Museo, Siena, Italy. * The Ognissanti Madonna, by Giotto, 1310 These three famous paintings are all together in one room of the Uffizi Gallery in Florence. Two of these paintings are from the Middle Ages, but Giotto's painting is an Early Renaissance painting, as can be seen in the natural, solid look of the figures which seem to be three dimensional. * The Frari Madonna, by Giovanni Bellini c. 1470 in the Church of Santa Maria Gloriosa dei Frari in Venice * The Madonna of the Rocks by Leonardo da Vinci. There are two paintings. One is in the National Gallery, London, the other one is in the Louvre, Paris. * The family by Giambattista Pittoni * The Ansidei Madonna, by Raphael, National Gallery, London * The Sistine Madonna by Raphael, in the Vatican Museum Art Gallery. ===Wall paintings=== * The Madonna of the Sunset by Piero Lorenzetti 1280, Assisi ===Small paintings=== * The Wilton Diptych. This very rare painting from the Middle Ages was probably done in England and is in the National Gallery, London. * The Madonna of the Magnificat, by Botticelli, Uffizi. * The Doni Tondo, by Michelangelo, 1505, Uffizi. * Raphael did many of these small paintings. They can be seen at the National Gallery, London, the Uffizi, the Louvre and many other art galleries. ===Statues=== Many churches contain famous statues of the Madonna and Child, particularly old churches. * The Virgin of Notre Dame Cathedral, Paris. This Madonna is carved of stone. * The Moorish Madonna of Sant' Antonio's Basilica, Padua. This Madonna has dark brown eyes and olive skin. * Many carved wooden Madonnas of the Middle Ages and many terracotta Madonnas by the dell Robbia family can be seen in museums. ===Icons=== * The Virgin of Vladimir. 1131. This famous icon from Constantinople (modern Istanbul) is kept at the Tretyakov Gallery Moscow. There are many copies of it. * The Virgin of Chilandari, c.1360. Mount Athos, Greece. This painting which is very badly damaged, is famous for its beauty. ==References== * Helen Gardner, Art through the Ages, Harcourt, Brace and World Inc. * Ilan Rachum, The Renaissance, an Illustrated Encyclopedia, Octopus Books, * Rene Huyghe, ed., Larousse Encyclopedia of Byzantine and Medieval Art, Paul Hamlyn, 1968 * Fujio Matsumoto, Takeshi Kosugi, Iconographia mariana , (text in Japanese, but many plates）2008 Category:Christian art Category:Depictions of Mary, mother of Jesus",
 "title": "Madonna and Child"
}