{
 "id": "566330",
 "text": "The arrondissement of Aix-en-Provence is an arrondissement of France, in the Bouches-du-Rhône department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Aix-en-Provence. ==History== When the Bouches-du-Rhône department was created on 1800, the arrondissement of Aix-en-Provence was part of that original department. ==Geography== The arrondissement of Aix-en-Provence is in the northeast of the Bouches-du-Rhône department. It is bordered to the north by the Vaucluse department, to the east by the Var department, to the southeast by the Marseille arrondissement, to the southwest by the Istres arrondissement and to the northwest by the Arles arrondissement. The arrondissement of Aix-en-Provence is the second largest arrondissement of the department both in area, , and population (429,436 inhabitants). ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are 9 cantons in the arrondissement of Aix-en-Provence and 5 of them do not have all their communes in the arrondissement: # Aix-en-Provence-1 (1301) # Aix-en-Provence-2 (1302) # Berre-l'Étang (1306) (partly) # Gardanne (1309) # Pélissanne (1325) (partly) # Salon-de-Provence-1 (1326) (partly) # Salon-de-Provence-2 (1327) (partly) # Trets (1328) # Vitrolles (1329) (partly) ===Communes=== The arrondissement of Aix-en-Provence has 44 communes; they are (with their INSEE codes)ː # Aix-en- Provence (13001) # Aurons (13008) # Beaurecueil (13012) # Bouc-Bel-Air (13015) # Cabriès (13019) # Charleval (13024) # Châteauneuf-le-Rouge (13025) # Cornillon-Confoux (13029) # Coudoux (13118) # Fuveau (13040) # Gardanne (13041) # Grans (13044) # Jouques (13048) # La Barben (13009) # La Fare-les- Oliviers (13037) # La Roque-d'Anthéron (13084) # Lambesc (13050) # Lançon- Provence (13051) # Le Puy-Sainte-Réparade (13080) # Le Tholonet (13109) # Les Pennes-Mirabeau (13071) # Meyrargues (13059) # Meyreuil (13060) # Mimet (13062) # Peynier (13072) # Peyrolles-en-Provence (13074) # Puyloubier (13079) # Pélissanne (13069) # Rognes (13082) # Rousset (13087) # Saint-Antonin-sur- Bayon (13090) # Saint-Cannat (13091) # Saint-Estève-Janson (13093) # Saint- Marc-Jaumegarde (13095) # Saint-Paul-lès-Durance (13099) # Salon-de-Provence (13103) # Septèmes-les-Vallons (13106) # Simiane-Collongue (13107) # Trets (13110) # Vauvenargues (13111) # Velaux (13112) # Venelles (13113) # Ventabren (13114) # Éguilles (13032) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 13001 Aix-en-Provence 142,149 Aix-en-Provence-1 and Aix-en-Provence-2 Métropole d'Aix-Marseille-Provence 13103 Salon-de- Provence 44,187 Salon-de-Provence-1 and Salon-de-Provence-2 Métropole d'Aix- Marseille-Provence 13071 Les Pennes-Mirabeau 20,492 Gardanne Métropole d'Aix- Marseille-Provence 13041 Gardanne 19,910 Gardanne Métropole d'Aix-Marseille- Provence 13015 Bouc-Bel-Air 14,097 Vitrolles Métropole d'Aix-Marseille- Provence 13110 Trets 10,896 Trets Métropole d'Aix-Marseille-Provence 13106 Septèmes-les-Vallons 10,794 Gardanne Métropole d'Aix-Marseille-Provence 13069 Pélissanne 9,909 Pélissanne Métropole d'Aix-Marseille-Provence 13040 Fuveau 9,638 Trets Métropole d'Aix-Marseille-Provence 13019 Cabriès 9,492 Vitrolles Métropole d'Aix-Marseille-Provence 13050 Lambesc 9,459 Pélissanne Métropole d'Aix-Marseille-Provence ==Related pages== * Arrondissements of the Bouches- du-Rhône department * List of arrondissements of France ==References== Aix-en- Provence",
 "title": "Arrondissement of Aix-en-Provence"
}