{
 "id": "566335",
 "text": "The arrondissement of Marseille is an arrondissement of France, in the Bouches-du-Rhône department, Provence-Alpes-Côte d'Azur region. Its capital, and the prefecture of the department, is the city of Marseille. ==History== When the Bouches-du-Rhône department was created on 1800, the arrondissement of Marseille was part of that original department. ==Geography== The arrondissement of Marseille is in the southeast of the Bouches-du-Rhône department. It is bordered to the north and west by the Aix-en-Provence arrondissement, to the east by the Var department and to the south by the Mediterranean Sea. The arrondissement of Marseille is the second smallest arrondissement in area of the department but the one with more people living in it. It has an area of and a population of 1,058,615 inhabitants. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. There are 15 cantons in the arrondissement of Marseille and all of them have all their communes' in the arrondissement: # Allauch (1303) # Aubagne (1305) # La Ciotat (1308) # Marseille-1 (1312) # Marseille-2 (1313) # Marseille-3 (1314) # Marseille-4 (1315) # Marseille-5 (1316) # Marseille-6 (1317) # Marseille-7 (1318) # Marseille-8 (1319) # Marseille-9 (1320) # Marseille-10 (1321) # Marseille-11 (1322) # Marseille-12 (1323) ===Communes=== The arrondissement of Marseille has 37 communes, including 16 subdivisions (\"municipal arrondissements\") of the city of Marseille; they are (with their INSEE codes)ː # Allauch (13002) # Aubagne (13005) # Auriol (13007) # Belcodène (13013) # La Bouilladisse (13016) # Cadolive (13020) # Cassis (13022) # Ceyreste (13023) # La Ciotat (13028) # Cuges-les-Pins (13030) # La Destrousse (13031) # Gémenos (13042) # Gréasque (13046) # Marseille (13055) # La Penne-sur-Huveaune (13070) # Peypin (13073) # Plan-de-Cuques (13075) # Roquefort-la-Bédoule (13085) # Roquevaire (13086) # Saint-Savournin (13101) # Carnoux-en-Provence (13119) # Marseille 1er Arrondissement (13201) # Marseille 2e Arrondissement (13202) # Marseille 3e Arrondissement (13203) # Marseille 4e Arrondissement (13204) # Marseille 5e Arrondissement (13205) # Marseille 6e Arrondissement (13206) # Marseille 7e Arrondissement (13207) # Marseille 8e Arrondissement (13208) # Marseille 9e Arrondissement (13209) # Marseille 10e Arrondissement (13210) # Marseille 11e Arrondissement (13211) # Marseille 12e Arrondissement (13212) # Marseille 13e Arrondissement (13213) # Marseille 14e Arrondissement (13214) # Marseille 15e Arrondissement (13215) # Marseille 16e Arrondissement (13216) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 13055 and from 13201 to 13216 Marseille 858,120 (capital of 12 cantons) Métropole d'Aix- Marseille-Provence 13005 Aubagne 45,128 Aubagne Métropole d'Aix-Marseille- Provence 13028 La Ciotat 35,631 La Ciotat Métropole d'Aix-Marseille-Provence 13002 Allauch 21,481 Allauch Métropole d'Aix-Marseille-Provence 13007 Auriol 11,377 Allauch Métropole d'Aix-Marseille-Provence 13075 Plan-de-Cuques 10,518 Allauch Métropole d'Aix-Marseille-Provence 13086 Roquevaire 8,857 Aubagne Métropole d'Aix-Marseille-Provence 13022 Cassis 7,333 La Ciotat Métropole d'Aix-Marseille-Provence 13119 Carnoux-en-Provence 6,684 La Ciotat Métropole d'Aix-Marseille-Provence 13070 La Penne-sur-Huveaune 6,338 Aubagne Métropole d'Aix-Marseille-Provence ==Related pages== * Arrondissements of the Bouches- du-Rhône department * List of arrondissements of France ==References== Marseille",
 "title": "Arrondissement of Marseille"
}