{
 "id": "56638",
 "text": "Roman Abramovich (born October 24, 1966 in Saratov, Russia) is a Russian- British businessman. Roman Abramovich was born in Saratov, in the former Soviet Union (FSU) on October 24, 1966. He was orphaned at the age of three and raised by his uncle in Ukhta, in the Komi Republic in northern Russia. When he was eight, Abramovich went to live with his grandmother in Moscow. ==Wealth== He is one of the richest men in the world. As in 2019, his wealth was estimated at $12.9 billion by Forbes which made him the wealthiest person in Israel, where he resides, and the 140th wealthiest person in the world.Forbes list of the richest people ==Business== Abramovich is the owner of Millhouse, LLC, a private investment company, the owner of Evraz, a steel making and mining company, and major shareholder of Norilsk Nickel, a nickel and palladium mining and smelting company. He is also part owner or significant shareholder many international corporations, mainly in steel and mining, and private investment and was well known as owner for club Chelsea Football Club, one of the most successful and popular football teams in the United Kingdom. ==Works in Russia== In 1999, Abramovich who was then 33 years old, was elected governor of the Russian province of Chukotka, and was subsequently elected for a second term, serving until 2008. Abramovich has received the ‘Order of Honor’ by the President of Russia for his important contribution to helping himprove the economy of Chukotka. He was also given the ‘Order of Friendship’ by the President. == References == == Other websites == * Roman-Abramovich.com Category:1966 births Category:Living people Category:British businesspeople Category:Businesspeople from Moscow Category:British billionaires Category:Israeli Jews Category:Israeli billionaires Category:Israeli businesspeople Category:Jewish businesspeople Category:Jewish politicians Category:Naturalised citizens of the United Kingdom Category:Naturalized citizens of Israel Category:Portuguese businesspeople Category:Russian Jews Category:Politicians from Moscow",
 "title": "Roman Abramovich"
}