{
 "id": "566469",
 "text": "Outsourcing is a term from economics. Sometimes a company decides to change its structure, in such a way, that it no longer performs certain tasks which are not its core business. Instead, the company hires or collaborates with other companies which can then perform these functions. Any business or company can hand over a part of their process or specific services to be handled by a third party. According to The Deloitte Global Outsourcing Survey 2018,The Deloitte Global Outsourcing Survey 2018(Rep.). (n.d.). Retrieved February 5, 2019, from Deloitte Development LLC website: https://www2.deloitte.com/us/en/pages/operations/articles/global-outsourcing-survey.html among the industries that refer to outsourcing are technology and media, financial services, consumer and energy, followed by government and public services and life sciences and healthcare. Among the industries that generate the most revenue are information technology outsourcing and business processes,Outsourcing: Revenue by service type 2018 | Statistic. (n.d.). Retrieved from https://www.statista.com/statistics/189800/global-outsourcing-industry-revenue-by-service-type/ that includes financial outsourcing and consumer. Global outsourcing industry revenue from 2010 to 2018, by service type (in billion U.S. dollars) == Reasons for outsourcing== There are many reasons why a company uses outsourcing, including: * reducing the overall cost of production, development or services * reaching a wider pool of experts * accessing knowledge unavailable through other means * improving flexibility of business processes * reducing the cost of labor == Types of Outsourcing == Most of the processes in the company can be outsourced in parts or in general. However, depending on the location of the ultimate executor, level of their involvement and amount of services they render, there are following types of outsourcing: * professional outsourcing * IT outsourcing * multisourcing * manufacturer outsourcing * BPO * process-specific outsourcing * offshore outsourcing * reshoring * nearshoring === Professional Outsourcing=== If a company requires specific services and don't want or cannot afford to hire a dedicated specialist within the company, they can outsource such services. Among commonly outsourced professional services are accounting, legal services, IT, call center support, etc. This allows a company to be more flexible and manage their expenses rationally.Ellram, L. M., Tate, W. L., & Billington, C. (2007). Offshore outsourcing of professional services: A transaction cost economics perspective. Journal of Operations Management,26(2), 148-163. doi:10.1016/j.jom.2007.02.008 ==== IT Outsourcing ==== One of the most commonly outsourced professional service, information technology (IT) represents the wide range of services. Companies can outsource research and prototype development, development of software, maintenance, and support. Such contracts allow reducing the costs as contractors can be hired for the period required.DiRomauldo, A., & Gurbaxani, V. (1998). Strategic intent for IT outsourcing. Retrieved from https://cloudfront.escholarship.org/dist/prd/content/qt7kc4d3p1/qt7kc4d3p1.pdf === Multisourcing=== If a company has both internal and external experts working on the same task, such form of outsourcing will be called multisourcing.Levina, N., & Su, N. (2008). Global multisourcing strategy: The emergence of a supplier portfolio in services offshoring. Decision Sciences, 39(3), 541-570 It involves a distributed team that can be working in two or more locations all over the world. Unlike other types of outsourcing, this one is focused on the result and is often based on the ‘partners’ approach rather than ‘client/worker’ model. === Manufacturer Outsourcing=== Numerous enterprises refer to the outsourcing of their manufacturing if it allows reducing the cost and decreasing the prime cost of an item produced.Gray, J. V., Tomlin, B., & Roth, A. V. (2009). Outsourcing to a powerful contract manufacturer: The effect of learning‐by‐doing. Production and Operations Management, 18(5), 487-505 Among other reasons for manufacturer outsourcing can be a lack of expertise, time/cost efficiency and a shortage of human resources. BPO Unlike professional outsourcing when the whole exercise is transferred to a third-party, this type of outsourcing focuses on a specific process. The primary reason for business process outsourcing is a knowledge gap that is too expensive to close.Willcocks, L., Hindle, J., Feeny, D., & Lacity, M. (2004). IT and business process outsourcing: The knowledge potential. Information systems management, 21(3), 7-15 A typical example of business process outsourcing would ba machinery maintenance (typically outsourced to a company that provided it).Malik, A. (2009). Training drivers, competitive strategy and clients' needs: Case studies of three business process outsourcing organisations. Journal of European Industrial Training, 33(2), 160-177 === Process-Specific Outsourcing=== Unlike business process outsourcing, process specific knowledge focuses on outsourcing of an action that another company can do faster or cheaper, which allows business to reduces the costs or improve clients’ experience. This form would request a third party to perform actions according to the contract (for example, delivery services have estimate dates/time, conditions of the delivered goods, etc.) === Offshore Outsourcing === Globalization and expansion of international business cooperation have triggered offshore outsourcing, making companies choose the providers of services or goods from countries far from their location.Doh, J. P. (2005). Offshore outsourcing: Implications for international business and strategic management theory and practice. Journal of Management Studies, 42(3), 695-704. Not only does it help reduce the costs, but also opens the business to new markets and experts from other parts of the globe. Common offshore destinations are China and India (manufacturing), Eastern Europe (Ukraine, Romania, Poland for IT). === Reshoring === The reversed process of bringing manufacturing or development back to the country is called reshoring. Such a decision can be justified if the costs of long-distance shipment, customs, and all the subsequent expenses overweight the benefits of offshoring.Bailey, D., & De Propris, L. (2014). Manufacturing reshoring and its limits: the UK automotive case. Cambridge Journal of Regions, Economy and Society, 7(3), 379-395. === Nearshoring=== If the company can transfer part of its manufacturing or services to the country nearby (common border or close proximity) and final destination has a similar business approach and legislation, then this form of outsourcing, is called nearshoring. One of the examples of nearshoring is cooperation between Scandinavian manufacturers and Baltic countries.Slepniov, D., Brazinskas, S., & Wæhrens, B. V. (2013). Nearshoring practices. Baltic Journal of Management,8(1), 5-26. doi:10.1108/17465261311291632 ==References== Category:Economics",
 "title": "Outsourcing"
}