{
 "id": "566527",
 "text": "Iveta Mukuchyan () is an Armenian-German singer-songwriter, model and actress. She was born in Yerevan, Armenia. She moved to Hamburg, Germany in 1992. In 2009, Mukuchyan returned to Armenia. She competed in the Hay Superstar content where she finished fifth. In 2010, Mukuchyan received the \"Discovery of the Year\" award at the Armenia Awards in Moscow, Russia. In 2012, she took part in The Voice of Germany. She was also named as \"Sexiest Armenian\". In May 2016, Mukuchyan represented her country at the Eurovision Song Contest 2016. She sang the song \"LoveWave\" and finished in the top 10. In the same year, she was also in the cast of the movie Run Away Or Get Married. ==Early life== Iveta Mukuchyan was born in Yerevan, Armenia on 14 October 1986. Her family moved to Germany in 1992. She returned to Armenia in 2009 where she studied jazz-vocal at the Komitas State Conservatory of Yerevan. ==Discography== ===EPs=== List of extended plays with selected album details Title Album details IvaVerse *Released: December 25, 2016 *Label: Sister Jack Records *Format: Digital download ===\"Dashterov\" collaboration=== Source: Armenian Folk by Iveta Mukuchyan ===Singles=== ====As lead artist==== Title Year Album \"Right Way to Love\"Right Way to Love - Single by Iveta Mukuchyan 2012 rowspan=\"3\" \"I'm falling\"I am falling - Single by Iveta Mukuchyan and Serjo 2014 \"Ari Yar\" (Արի Յար)Ari Yar - Single by Iveta Mukuchyan 2015 \"Simple Like a Flower\"Simple Like a Flower - Single by Iveta Mukuchyan IvaVerse \"LoveWave\" 2016 rowspan=\"4\" \"Amena\" (Ամենա) \"Hayastan Jan\" (Հայաստան Ջան) 2017 \"Depi Nor Irakanutyun\" (Դեպի Նոր Իրականություն)Depi Nor Irakanutyun - Single by Iveta Mukuchyan ====As featured artist==== Title Year Album \"Freak\" (Lazzaro featuring Iveta Mukuchyan) 2012 rowspan=\"4\" \"Summer Rain\"Summer Rain (Remixes) (feat. Iveta Mukuchyan) by Lazzaro (Lazzaro featuring Iveta Mukuchyan) 2014 \"Dashterov\" (Դաշտերով) (Aram Mp3 featuring Iveta Mukuchyan) 2017 \"De Jpta\" (Դե Ժպտա) (Aram Mp3, Mihran Tsarukyan, Iveta Mukuchyan, Anahit Shahbazyan, Roland Gasparyan, Erik, Christine Pepelyan, Yana Hovhannisyan & Mkrtich Arzumanyan) ==Filmography== Films Year Title Role 2016 Run Away Or Get Married Satenik (Main role) ==Awards and nominations== Year Award Category City Result Ref. 2010 Armenia Music Awards Discovery of the Year Moscow 2016 Pan Armenian Entertainment Awards Armenia's Entertainment Ambassador LA 2016 Daf Bama Music Awards Best Armenian Female Act Hamburg 2017 Armenian Europe Music Awards Duet of the year (Dashterov with Aram Mp3) Paris 2017 Armenian Europe Music Awards Diva of Armenian Pop Paris 2017 Song Of The Year Awards The Song of The Year (Dashterov, with Aram Mp3) Sochi 2017 Daf Bama Music Awards BAMA's Best Performer Hamburg 2017 Daf Bama Music Awards Best Armenian Act Hamburg 2017 Daf Bama Music Awards BAMA People's Choice Award Hamburg ==References== == Other websites == *Official website * Category:1986 births Category:Living people Category:German singer-songwriters Category:German models Category:Armenian singers Category:German actors Category:Armenian actors Category:21st-century singers Category:People from Yerevan Category:Eurovision Song Contest entrants Category:21st-century Armenian people",
 "title": "Iveta Mukuchyan"
}