{
 "id": "566690",
 "text": "Urk is a municipality in the province of Flevoland, the Netherlands. It has about 20,000 people (2016), and is both a former municipality of North Holland and of Overijssel. Urk is a former island and well-known for its fishery activities. == History == Urk is first mentioned in a document from 966. In that year Holy Roman emperor Otto the Great gives the northern part of the 'territory of Urk' to a monastery in Cologne. Around that time the western and northern parts of the Netherlands are mostly covered in peat. In the middle of it you could find a lake, Flevo lake or Almere. === Middle Ages === The territory of Urk was a large island in that lake. During the Middle Ages the connection between that lake and the North Sea widened, and eventually the Zuiderzee (Southern Sea) emerged as an inland sea. The territory of Urk became small and smaller and by the end of the Middle Ages two islands emerged from the former much bigger island. These islands were Urk and Schokland. === 17th century === In the 17th century the island of Urk became very important for the city of Amsterdam. The island acted as a important point of navigation for the ships coming and going to Amsterdam. In 1660 the city bought the rights to Urk and the northern part of Schokland, on which the village of Emmeloord was located. Now that Amsterdam was in control of the island, it also had to pay for the upkeep of the island. Another consequence was that the people of Urk were now under the rule of protestants. === 18th century === At the end of the 18th century the upkeep of the island became too exensive for the city of Amsterdam. Holland had come into conflicht with the English many times over in the 18th century and these wars had been very costly for both Holland and it's most important city, Amsterdam. In 1792 Amsterdam gives the rights to rule Urk to Holland. === 19th century === In the 19th century the fishermen of Urk expanded there fleet slowly but surely. Especially in years when a lot of anchovies was caught life wasn't too bad on the island, but in other years life on the island could be quite harsh. At this time some scientists got interested in Urk as well. Theories around race at that time had people believe that on a remote island as Urk one could probaby find traces of archaic races. These theories didn't bring the people of Urk much good. They were branded as being lazy, retarted and without initative. === 20th century === When in the first half of the 20th century plans were made to connect Urk to the main land as part of a large land reclamation project called Zuiderzee Works. In 1939 Urk was connected to the mainland. In 1942 the polder behind Urk fell dry. At the start of the whole Zuiderzee project the future of Urk looked bleak. It was even considered to deport the people of Urk to places elsewhere in the Netherlands. When in 1940 World War II broke out in the Netherlands, the plans had to changed considerably. After the war the fishery fleet of Urk was modernized very fast. As a consequence the economy off Urk thrived. Not only the fishing fleet grew, supporting industries in trade, processing and logistics thrived with it. === 21st century === In recent years the fleet of Urk has seen a steep decline. Under the influence of European policies and a huge rise in fuel costs fishing has become unprofitable and unsustainable. When a new, more sustainable form of fishing, was shot down by the European Union many fishermen gave up their profession and started working other maritime industries. The economy of Urk still thrives on the fishing trade and processing of fish. Urk has turned itself into a global hub when it comes to fish and fish related industries. ==References== == Other websites == * Urk website * Category:Settlements in Flevoland Category:Municipalities of Flevoland Category:Former municipalities of North Holland Category:Former municipalities of Overijssel",
 "title": "Urk"
}