{
 "id": "566674",
 "text": "Sex Tape is a 2014 American comedy movie. ==Plot== Jay and Annie Hargrove are a married couple. After having two kids, they have sex every chance they get. When Jay struggles to have an erection, Annie suggests making a sex tape. After making it, Annie asks Jay to delete the recording. The son of Jay and Annie's friend says he will upload a copy of the sex tape to YouPorn unless they give him $25,000. They are not able to pay the money. Jay and Annie break into YouPorn's headquarters. They begin destroying the web servers. Their plan is stopped when an alarm sounds. The owner of YouPorn removes the sex tape. Jay and Annie watch the video once themselves. After this, they take the USB flash drive and later destroy it. ==Cast== * Cameron Diaz as Annie Hargrove, Jay's wife * Jason Segel as Jay Hargrove, Annie's husband * Rob Corddry as Robby * Ellie Kemper as Tess * Rob Lowe as Hank Rosenbaum * Nat Faxon as Max * Nancy Lenehan as Linda * Randall Park as Edward * Harrison Holzer as Howard * Jolene Blalock as Catalina, the wife of the owner of YouPorn * Dave \"Gruber\" Allen as Mailman * Kumail Nanjiani as Punit * Artemis Pebdani as Kia * Jack Black (uncredited) as the owner of YouPorn ==Release== Sex Tape was released on July 18, 2014. ==Box office== The movie earned a total of $38.5 million in the United States alone. Worldwide, it earned a total of $126.1 million. In the United Kingdom, it topped the box office. It earned £1.43 million. The movie opened at #1 in markets, such as Bulgaria, the Netherlands and Slovenia. The biggest market was in countries like Germany, Australia and the United Kingdom. In those countries, the movie got back $12.14 million, $6.9 million and $7.14 million, respectively. ==Reviews== Sex Tape earned mostly negative reviews from critics. On Rotten Tomatoes, the movie has an approval rating of 17%. Metacritic gives the movie a score of 36, meaning generally unfavorable reviews. ==Awards== Sex Tape won a Golden Raspberry Award for the Worst Actress. It was also nominated for Worst Screen Combo and Worst Screenplay. ==References== Category:2014 comedy movies Category:2010s sex comedy movies Category:American sex comedy movies Category:English-language movies Category:Movies about families Category:Movies about marriage Category:Movies about suburbia Category:Movies set in Los Angeles Category:Movies about pornography Category:Movies directed by Jake Kasdan",
 "title": "Sex Tape (movie)"
}