{
 "id": "56664",
 "text": "A sawmill is a place where lumber is cut into boards. ==Sawmill process== Sawmills today work like sawmills from hundreds of years ago. A log enters at one end, and pieces of wood of a specific shape and size come out of the other end. * Trees are chosen to be harvested. * The tree is chopped so that it falls over; this is known as felling. * The tree is cut at both ends so that it is exactly as long as it needs to be; this is called bucking. * Branches are cut off the trunk. This is known as limbing. * Logs are taken by logging truck, by train, or by a log drive to the sawmill. * Logs are measured by a Log scaler, either on the way to the mill or when they arrive at the mill. * Debarking removes bark from the logs. * Logs are sorted by species, size, and end use (lumber, plywood, chips). This is called decking. * A sawyer uses a head saw, head rig, or primary saw to break the log into cants (smaller logs to be worked on some more) and flitches (unfinished planks). * Depending upon the species and quality of the log, the cants will either be further broken down by a resaw or a gang edger into multiple flitches and/or boards * Edging will take the flitch and trim off all irregular edges leaving four-sided lumber. * Trimming squares the ends at typical lumber lengths. * Drying removes naturally occurring moisture from the lumber. This can be done with kilns or air-dried. * Planing smooths the surface of the lumber leaving a uniform width and thickness. * Shipping transports the finished lumber to market. ==History== Sawmills seem to have existed in the medieval period, as one was sketched by Villard de Honnecourt in c.1250.C. Singer et at., History of Technology II (Oxford 1956), 643-4. On the other hand, people think they were introduced in Madeira following its discovery in c.1420 and spread widely in Europe in the 16th century.Charles E. Peterson, 'Sawdust Trail: Annals of Sawmilling and the Lumber Trade' Bulletin of the Association for Preservation Technology Vol. 5, No. 2. (1973), pp. 84-5. The Dutchman Cornelis Corneliszoon (1550-1607) invented his type of sawmill by applying a pitman arm onto a wind mill, which converted a turning motion into an up-an-down motion. Corneliszoon patented the sawmill on December 15, 1593 and the pitman on December 6, 1597. He built the first sawmill in 1594. Before to the invention of the sawmill, boards were sawn by two men with a whipsaw, using saddleblocks to hold the log, and a pit for the pitman who worked below. Sawing was slow, and required strong and enduring men. The topsawer had to be the stronger of the two because the saw was pulled in turn by each man, and the lower had the advantage of gravity. The topsawyer also had to guide the saw so that the board was of even thickness. This was often done by following a chalk line. Early sawmills simply adapted the whipsaw to mechanical power, generally driven by a water wheel to speed up the process. The circular motion of the wheel was changed to back-and-forth motion of the saw blade by a Connecting rod known as a pitman. A pitman is similar to a crankshaft, but in reverse; a crankshaft converts back-and-forth motion to circular motion. Generally, only the saw was powered, and the logs had to be loaded and moved by hand. An early improvement was the development of a movable carriage, also water powered, to steadily move the log through the saw blade. A small mill such as this would be the center of many rural communities in wood-exporting regions such as the Baltic countries and Canada. The output of such mills would be quite low, perhaps only 500 boards per day. They would also generally only operate during the winter, the peak logging season. In the United States, the sawmill was introduced soon after the colonisation of Virginia by recruiting skilled men from Hamburg. Later the metal parts were obtained from the Netherlands,Peterson, 94-5. where the technology was far ahead of that in England, where the sawmill was largely unknown until the late 18th century. The arrival of a sawmill was an important step in the growth of a frontier community. Early mills were taken to the forest, where a temporary shelter was built, and the logs were skidded to the nearby mill by horse or ox teams, often when there was some snow to provide lubrication. As mills grew larger, they were usually established in more permanent facilities on a river, and the logs were floated down to them by log drivers. Technology has changed sawmill operations significantly in recent years, emphasizing increasing profits through waste minimization and increased energy efficiency as well as improving operator safety. == Additional images == File:Laser guided cutting of wood inside modern woodmill.jpg|Inside a modern sawmill with laser-guided technology File:Laser guided cutting of wood in woodmill.jpg|Wood traveling on sawmill machinery File:Sawdust waste from mill.jpg|Sawdust waste from the mill File:Wood from victoria mountain ash.jpg|Wood from Victorian mountain ash, Swifts Creek ==Related pages== * Saw ==References== == Other websites == * Steam powered saw mills * The basics of sawmill (German) Category:Manufacturing buildings",
 "title": "Sawmill"
}