{
 "id": "56678",
 "text": "Convenience food is a type of food. This kind of food has been made to save consumers time to prepare it. Usually such foods just need to be heated, or can just be eaten from the package. They are made for a long shelf life, so that they can stay in the store for a long time. One thing to remember is that you may have to pay for the convenience, as this food is often expensive. Many people criticise these products, because: * They are made from products that would probably not be eaten in their raw form * They are high in bad fat, sugar, and calories * They are low in nutrients and fiber, but fast to prepare. Therefore, they are also blamed for obesity * Their ingredients may come from genetically modified organisms * Preservatives are almost always used * Most of the foods end up wasted == History == Before modern times most men worked in the open, often in fields. Agriculture was, before the industrial revolution, the biggest employment for men in most countries. They usually took their midday meal with them, and ate where they worked. Many kinds of food types were invented for this purpose. The Cornish pasty from the UK is one which survives to the present day. Other kinds have vanished, and their names forgotten. The Bedfordshire clanger was a baked suet dumpling,\"...bacon clanger, a roly-poly of bacon chopped up with sage and onion, and rolled in a suet crust\" and there was also a Bedfordshire roll. This was savoury at one end and sweet at the other. It was eaten from the savoury end to the sweet end. There used to be many other varieties and version.Harman, Horace 1929. Buckinghamshire dialect. S.R. p. 143. ISBN 9780854095810Schofield, Eunice. 1971. Food and Cooking of the Working Class about 1900. Transactions of the Historic Society of Lancashire and Cheshire. Many have commented on the way convenience foods are heavy on calories. They were meant to be, for work then was usually manual labour, and men used their muscles continually as they worked. The modern sandwich is a relatively recent invention, since it dates back only to the 18th century.The Oxford English Dictionary gives its appearance as 1762. It has become a standard way of taking food to the school or workplace. == Related pages == * Junk food == References == == Other websites == * American women and the making of modern consumer culture * Convenience foods: factors affecting their use where household diets are poor * US Food facts & history Category:Foods by type",
 "title": "Convenience food"
}