{
 "id": "566940",
 "text": "Gol Transportes Aéreos Flight 1907, was a passenger flight flying from Manaus to Rio de Janeiro, Brazil. On 29 September 2006, the Boeing 737-8EH operating the flight was involved in a midair collision with an Embraer Legacy 600 while cruising over the Amazon rainforest. The Embraer landed at a military base safely with no injuries on board, and minor damage to the left wingtip and horizontal stabilizer, but the Boeing lost flight path control and was completely destroyed by aerodynamic forces, killing all 154 occupants on board. == Accident == The Embraer had a set computer-generated flight plan to Air Traffic Control for the run north to Manaus. This would take N600XL over Brasília, where airway UZ6 would lead the airplane to Manaus. The computer requested a climb to FL370. Until Brasília, that direction was slightly to the east side of magnetic north. Since the airway to Manaus required a westerly turn over Brasília, the computer proposed a descent to 36,000, since it was supposed to be at that flight level by that point. GOL Flight 1907 rapidly approached from the opposite direction, also at FL370. The Legacy struck the Boeing about 30 feet and 2 feet to the left of the fuselage. Due to the speed at which both aircraft traveled, the Legacy’s winglet acted like a knife, slicing through the Boeing’s left wing about halfway out and severing the wing’s internal spar. On the cockpit voice recorder, the collision sequence sounded like a car crash. Instantly, the 737 twisted out of control, yawing and banking violently to the left and pitching straight down into a rotating vertical dive. The autopilot automatically disconnected and the bank angle warning activated. The pilots fought to regain control, and extended the landing gear to slow the dive. 22 seconds into the plunge, the airplane’s overspeed clacker activated as the aircraft passed it's maximum rated dive speed. As the aircraft continued to spin rapidly, uncontrollably, the aircraft's load reached 4 Gs. 45 seconds into the dive, the first officer shouted in response to the aircraft breaking apart. Seven seconds later, the Boeing broke into three parts, which plummeted into the forest below. Passenger remains were found to be several inches deep in the dirt as a result of the impact forces. Pilot-in-command of the Embraer, Captain Lepore, immediately declared an emergency to ATC, and took control. The aircraft landed safely at Cachimbo Airbase following careful flight. Final tally of passenger nationalities Final tally of passenger nationalities Final tally of passenger nationalities Final tally of passenger nationalities Nationality Passengers Crew Total 10 0 10 1 0 1 6 0 6 2 0 2 5 0 5 3 0 3 1 0 1 4 0 4 1 0 1 1 0 1 4 0 4 3 0 3 3 0 3 3 0 3 3 0 3 1 0 1 2 0 2 2 0 2 2 0 2 2 0 2 1 0 1 105 6 111 Total 148 6 154 Category:Aviation accidents and incidents in the 2000s Category:2000s in Brazil Category:2006 in South America",
 "title": "Gol Transportes Aéreos Flight 1907"
}