{
 "id": "567054",
 "text": "Yücel Erten (born 19 October 1945, Muş), is Turkish actor, director, art director, writer, translator. == Biography == Born in Muş in 1945, Erten had his primary and secondary education in Antalya and Ankara. In 1969 he graduated from Ankara State Conservatory Theater Department. He started as a trainee artist at the Ankara State Theater. In 1970, he went to Federal Germany to study at state universities and completed the Reji Department of the Essen Folkwang High School. At the same time, he finished his education in Interior-Costume interior specialization at school. During his studies in Germany; Züricher Schauspielhaus in Switzerland, Staatstheater Hannover in Germany, Stædtische Bühnen Essen and Bühne as assistant director and assistant director in 1964. In 1974 Erten returned to his home country, completing the \"Folkwang Award\" by playing a performance with his diploma. From October 1992, Erten worked for 16 months in the State Teatroller as General Manager and Principal. He resigned with the General Directorate in order to implement electoral methods. == Filmography == * Yorgun Savaşçı, 1979, Halit Refiğ * Kurtuluş 1996, Ziya Öztan * Cumhuriyet, Film 1998, Ziya Öztan * Salkım Hanımın Taneleri, Film, 1999, Tomris Giritlioğlu * Sana Bayılıyorum, TV Series Show TV, 2002, Aram Gülyüz-İlyas İlbey * Körfez Ateşi, ATV, 2005, Şafak Bakkalbaşıoğlu * İlk Aşk, 2006, Nihat Durak * Yemin, Dizi Fox TV, 2007 - 08 Sadullah Celen * Garp, Film, 2008, Emre Mirza * Elveda Rumeli,, 2009, Serdar Akar * Kavşak, Film, 2010, Selim Demirdelen * Bitmeyen Şarkı, , 2010, Sadullah Celen–Yasemin Türkmenli * Tozlu Yollar, 2013, Özer Kızıltan - Kudret Sabancı * Karadayı, TV Series, 2013, Uluç Bayraktar - Cem Karcı * Burhan Bey’in Kısa Bir Hikâyesi, Film,, 2014, Selçuk Özgül * Bir Cenaze, film, 2014, Mamikoğlu * Ses Ver, film, 2015, Gülay Küçük * Deliormanlı, Film, 2015-16, Murat Şeker == References == == Other websites == * Category:1945 births Category:Living people Category:Turkish actors",
 "title": "Yücel Erten"
}