{
 "id": "567147",
 "text": "David Jonathon Shulkin (born June 22, 1959) is an American physician and politician. Shulkin was the 9th United States Secretary of Veterans Affairs from February 14, 2017 to March 28, 2018. He served as Under Secretary of Health for the U.S. Department of Veterans Affairs. He was nominated by President Barack Obama on March 18, 2015 and sworn in on July 6, 2015. On January 11, 2017, President-elect Donald Trump announced that he will nominate Shulkin to serve as United States Secretary of Veterans Affairs.Lisa Rein, David Shulkin tapped as Trump’s VA secretary washingtonpost.com January 11, 2017CAMILA DOMONOSKE, Trump Announces David Shulkin As Pick For Secretary Of Veterans Affairs NPR.org January 11, 2017Trump Names Dr. David Shulkin to Head Veterans Affairs Bloomberg News January 11, 2017 ==Early life== Shulkin was born in Highland Park, Illinois. He was raised in Bala Cynwyd, Pennsylvania. He studied at Hampshire College and at Drexel University. ==Medical career== He served as the President and Chief Executive Officer of Beth Israel Medical Center in New York City. He also served as president of Morristown Medical Center and as vice president of Atlantic Health System Accountable Care Organization. He has been Chief Medical Officer of the University of Pennsylvania Health System, the Hospital of the University of Pennsylvania, Temple University Hospital, and the Medical College of Pennsylvania Hospital. ==United States Secretary of Veterans Affairs (2017–2018)== On January 11, 2017, Shulkin was selected by President-elect Trump as Secretary of Veterans Affairs pending Senate confirmation.Domonoske, C. Trump Announces David Shulkin As Pick For Secretary Of Veterans Affairs, January 11, 2017, 11:44 AM ET Shulkin resigned from a private sector position in 2015 to work in the Department of Veterans Affairs as the undersecretary of health.Who Is David Shulkin? 4 Things To Know About Trump’s Latest Appointment CBS January 11, 2017Camila Domonoske, Trump Announces David Shulkin As Pick For Secretary Of Veterans Affairs NPR.org January 11, 2017 On February 13, 2017, the Senate unanimously confirmed Shulkin as the U.S. Secretary of Veteran's Affairs with a 100-0 vote. For President Trump's address to a Joint Session of Congress on February 28, 2017, Shulkin served as the designated survivor. In September 2017, The Washington Post revealed that Shulkin spent nearly half his time on a recent international trip to Europe, covered by taxpayers, sightseeing and shopping with his wife, Merle Bari. On March 28, 2018, President Trump fired Shulkin. ==Personal life== Shulkin is married to Merle Bari. ==References== ==Other websites== * Official website Category:1959 births Category:Living people Category:American physicians Category:United States Secretaries of Veterans Affairs Category:Independent politicians in the United States Category:Politicians from Pennsylvania Category:Politicians from Washington, D.C. Category:Politicians from Highland Park, Illinois",
 "title": "David Shulkin"
}