{
 "id": "567358",
 "text": "Central () is a department in Paraguay. The capital is the city of Areguá. Its ISO 3166-2 code is PY-11. The department has 2,297,739 inhabitants. That is more than any other department of Paraguay. The department is also the smallest of all the departments. ==History== The Central Department, known as “Comarca Asuncena”, was the most populated country region in old times. The towns of this department had different origin. Domingo Martínez de Irala started the towns of Itá, Ypané and Areguá in 1538 and 1539. Villeta was founded by the governor Juan Gregorio Bazán de Pedraza in 1714. Other towns were founded around chapels. The towns of Nueva Italia, Colonia Thompson and Villa Elisa were already established as agricultural settlements in the 19th century and the beginning of the 20th century. These were mainly settled by immigrants. ==Geography== The Central department is in the central western part of the Oriental region. It is on the southern border of the Western region. It surrounds the capital, Asunción. The department has an area of . That is of the area of Paraguay. Its estimated population in 2013 was 2,297,739. That gave a population density of inhabitants per square kilometre. The Central department is relatively flat. It has only small hills. It has several rivers, as the Paraguay river, and streams flow through it. The Ypacaraí and Ypoá lakes are on the borders of the department. ===Limits=== * To the north: Presidente Hayes and Cordillera departments. * To the east: Paraguarí department. * To the south: Ñeembucú department. * To the west: Argentina and the Distrito Capital ==Districts== The department is divided in 19 districts: Districts of the Central department No. Districts Area (km²) Population (2015) Density 1 Areguá 2 Capiatá 3 Fernando de la Mora 4 Guarambaré 5 Itá 6 Itauguá 7 Julián Augusto Saldívar 8 Lambaré 9 Limpio 10 Luque 11 Mariano Roque Alonso 12 Ñemby 13 Nueva Italia 14 San Antonio 15 San Lorenzo 16 Villa Elisa 17 Villeta 18 Ypacaraí 19 Ypané ==Economy== Industries include the processing of food, furniture, clothing, pharmaceutical production, metallurgic, plastic and ceramics. The city of Villeta has a large number of industries. Central is the second biggest economy of Paraguay. ===Tourism=== The Central Department has many attractions for tourism. Among the most famous natural resources at an international level, is the Lago Ypacaraí. This lake is a very important natural attraction and the town of Areguá. The capital of the department is located on the banks of this lake ==Related pages== * Departments of Paraguay * ISO 3166-2:PY ==References== ==Other websites== * Statoids - Departments of Paraguay Category:Departments of Paraguay",
 "title": "Central Department"
}