{
 "id": "56761",
 "text": "Typically, a green manure crop is grown for a specific period, and then plowed under and incorporated into the soil. Green manures usually perform several functions, that include soil improvement and soil protection: * Leguminous green manures such as clover contain nitrogen-fixing symbiotic bacteria in root nodules that fix atmospheric nitrogen in a form that plants can use. * Green manures increase the percentage of organic matter (biomass) in the soil, thereby improving water retention, aeration, and other soil characteristics. *The root systems of some varieties of green manure grow deep in the soil and bring up nutrient resources unavailable to shallower-rooted crops. * Common cover crop functions of weed suppression and prevention of soil erosion and compaction are often also taken into account when selecting and using green manures. *Some green manure crops, when allowed to flower, provide forage for pollinating insects. Historically, the practice of green manuring can be traced back to the fallow cycle of crop rotation, which was used to allow soils to recover. ==Green manure crops== *Winter cover crops such as oats or rye have long been used as green manures. *Mustard *Clover *Fenugreek *Lupin *Sunn hemp *Winter tares *Winter field beans *Ferns of the genus Azolla have been used as a green manure in southeast Asia. *Velvet Bean (Mucuna pruriens) Common in the southern US during the early part of the 20th century, before being replaced by soybeans. Popular today in most tropical countries, especially in Central America where it is the main green manure used in Slash/Mulch farming practices. ==Green manures in organic farming== Organic farming relies on soil health and cycling of nutrients through the soil using natural processes, such as the addition of animal manures. If animal manures are not available, in a stockless rotation, green manures perform a vital function of fertilization. ==Related pages== *Fertilizer == Other websites == *Overview of cover crops and green manures *Using green manure to grow rice Category:Fertilizers",
 "title": "Green manure"
}