{
 "id": "567680",
 "text": "The Aswan High Dam is a dam on the river Nile. It was built from 1960 to 1971, and created Lake Nasser. The dam is located in the Aswan governorate in the south of Egypt. The dam improved agricultural activity in the region, provided a lot of electrical power to the country and protected the surrounding cities and farms from dangerous floods. It also caused the moving of hundreds of thousands of nomads and inhabitants of the region because of the creation of the water reservoir. For the same reason the Abu Simbel temple complex needed to be removed along with many other temples and monuments in southern Egypt and northern Sudan. == Construction == === Aswan Low Dam === The construction of the Aswan Low Dam began in 1898 and was completed in 1902. In the years after the completion the dam had to be raised between 1907 and 1912 and once again between 1929 and 1933. Raising the Low Dam was necessary because there was a high risk of the Nile flooding. The Aswan Low Dam was not effective enough and so it brought the idea of building a new higher dam. The construction of this new higher dam started in 1960. The new dam got the name Aswan High Dam. === Before Construction (early 1950s - 1960) === In the early 1950s, the ex-President of Egypt, Gamal Abdel Nasser, planned to build a new dam. He wanted a stronger dam to stop the Nile from flooding and he wanted to increase electricity production to make Egypt more industrialized and modern. The first plans began in 1954 as the United States and the United Kingdom considered paying for the construction of the new dam. However, in 1956 they both decided not to fund the project anymore, because they found out that Egypt worked closely with the USSR and Czechoslovakia. Finally, the Soviet Union provided the money for the construction of the new Aswan High Dam. A team of Soviet and Egyptian engineers worked together to build the Aswan High Dam. === Construction (1960 - 1971) === The construction of the Aswan High Dam began with choosing the area where the manufacturing would take place. This location was favorable, because it was located next to a deep and wide valley that would provide storage for a large capacity of water. The location of the High Dam is 6.5 kilometers south of the Low Dam. First, the placement of tunnels took place. These tunnels would change the flow of the Nile River so that it would flow away from the construction site. For the creation of the dam, techniques were used for forming a rock-fill dam. This type of dam is usually made from materials including, dumped and pressed together rock, stones, mud, sand, and clay. This same combination of materials forms the center of the High Dam. The High Dam has 180 sluice gates. The sluice gates regulate the flow of water and the water level, in order to attain control over flooding. Within the sluice gates, a power system is installed which contains 12 Francis turbines. The Francis turbines are water turbines. These turbines are the most commonly used turbines nowadays. This power system provides electricity for industrial and household purposes. The total costs of constructing the High Dam reached $1bn. === Aswan High Dam Reservoir === The Aswan High Dam Reservoir, also known as Lake Nasser, is one of Egypt's most important water resource systems. This lake was formed by the construction of the High Dam. It is named after Gamal Abdel Nasser. The water in the reservoir is shared by Egypt and Sudan according to an agreement on water allocation, which is called the Nile Waters Agreement. === Egypt and Sudan Water Agreement === In 1959, Egypt and Sudan signed the Nile Waters Agreement. This is a deal to allocate the Nile's flow as it crosses the Egyptian-Sudanese border. This deal increased Sudan's share of water to 18.5 billion cubic meters from the previous 4 billion. To make the best use of the Nile and manage its flow, Sudan built a dam at Khashm el-Girba in 1963. This dam holds an extra 1.3 billion cubic meters of water. == Benefits == === Control of the Nile River === One of the more important benefits was that the nearby villages and infrastructure such as electricity cables and drinking water could be protected from floods from the Nile river. No floods also meant that crops would improve in quality since farmers around the Nile did not have to harvest them too early out of fear of losing them because of it. The dam also made it possible to control the flow of the Nile river better so that there would not be a shortage in the “fire season”. This period from February to May caused many droughts and fires on farm fields. On the other hand, in August, October and September there was too much water that caused floods and destroy everything in its path. The dam regulated this flow so that there would be enough water flowing through for the farms. This would reduce the risks of floods and droughts. === Agricultural Benefits === The building of the dam led to around 2.5 million acres (10,117 km2) of land to be transformed into farmable lands. This brought up the total to 8.6 million acres (34,803 km2) of the total country, which is around 3.4%. This increase in farmable land caused an increase in agricultural activity. The water reservoir also made it easier to farm crops that needed a lot of water. The large amount of water the lake could provide made it easier to farm crops such as: rice, sugarcane, sugar beet, cabbage. The huge water supply of the dam also made the farming 100% self-sustaining because no extra infrastructure was needed to pump more water to the crops from another source. These crops are also often found at many dinner tables of Egyptian families. The increase of the farming of these crops came with a decrease of food shortage. === Fishing Industry === Before Lake Nasser was formed, Egypt had to purchase nearly 60% of the fish consumed from other countries. Since the creation of Lake Nasser, it has been used as a place to fish and has caused a big harvest of fish. It is estimated to produce around 20,000 metric tonnes of fish per year. === Electricity === The High Aswan Dam uses 12 Francis turbines to produce electricity. This power system is installed in the sluice gates of the dam. The power system produces around 2.1 gigawatts of electricity per year. In 1970, this was enough electricity to supply half of Egypt. == Disadvantages and Controversies == === Relocation of Local Inhabitants === The creation of the dam’s water reservoir (Lake Nasser) flooded a big part of Lower Nubia in the south of Egypt. For this, between 100.000 and 120.000 Egyptian peasants (Fellahin) and Sudanese Nubian nomads had to be moved out of their homes. The Egyptian peasants were moved to the Kawm Umbuvalley which is located 48 kilometers north of the dam. There would be a planned city of New Nubia, or al-Nuba al-Jadida. Around 50.000 to 70.000 of the Sudanese nomads were moved to Wadi Halfa in Sudan while others were moved to different cities inside Sudan. === Relocation of the Abu Simbel Temple complex === The creation of Lake Nasser meant that the famous temples of Abu Simbel would be flooded. The temples were cut into 1035 small and more easily transportable pieces that each weighed between 20 and 30 tonnes. These were then carefully put together again 200 meters further and 65 meters higher. The Abu Simbel temple complex was among 22 monuments that had to be moved due to the flooding of the region. Not only the Abu Simbel temples were moved. Several other and smaller temples and monuments that were moved are: In Egypt: * The temple of Qertassi * The large temple of Kalabsha * The temple of Beit el Wali * The rock temple of Ramses at Gerf Husein * The Dakka temple * The Roman temple of Maharraqa * The temple of Ramses II * An old temple built by Thutmosis III and Amenophis II * The rock temple of Derr * The rock-cut chapel of Thutmosis III * The small rock-cut chapel of Horemheb Egypt gave 4 temples that had to be moved to countries who helped in the big operation of moving all the temples and monuments to safety. These were the following: * The temple of Taffa, was gifted to the Netherlands and is now in the \"Rijksmuseum van Oudheden\" in the city of Leiden. * The temple of Debod, was gifted to Spain and is now in \"Parque del Oeste\", near the Royal Palace in Madrid. * The temple of Dendur, was gifted to the United States and is now in the \"Metropolitan Museum of Art\" in New York City. * The temple of Ellesyia, was gifted to Italy and is now in \"Museo Egizio\" in Turin. In Sudan: * The temple of Ramses at Aksha * The fortified town of Buhen with two temples of the 18th Egyptian Dynasty * Two temples of the same period in the fortresses of Semna East and West == Related pages == *Abu Simbel temples *Aswan Low Dam *The Nile river == References == Category:Buildings and structures in Egypt Category:Dams in Africa Category:1971 establishments in Africa Category:1970s establishments in Egypt",
 "title": "Aswan High Dam"
}