{
 "id": "567742",
 "text": "The Lieutenant Governor of Iowa is a assistant governor. If the governor quits or dies, then the lieutenant governor will become governor of the state. The current Lieutenant Governor is Republican Chris Cournoyer since 2024. Before 1990, the governor and lieutenant governor were elected in separate elections; since then they have run together on the same ticket. ==List== Image Lt. Governor Took office Left office Party Governor(s) served under Oran Faville 1858 1860 Republican Ralph P. Lowe Nicholas J. Rusch 1860 1862 Republican Samuel J. Kirkwood John R. Needham 1862 1864 Republican Samuel J. Kirkwood Enoch W. Eastman 1864 1866 Republican William M. Stone Benjamin F. Gue 1866 1868 Republican William M. Stone John Scott 1868 1870 Republican Samuel Merrill Madison Miner Walden 1870 1871 Republican Samuel Merrill Henry C. Bulis 1871 1874 Republican Samuel Merrill Henry C. Bulis 1871 1874 Republican Cyrus C. Carpenter Joseph Dysart 1874 1876 Republican Cyrus C. Carpenter Joshua G. Newbold 1876 1877 Republican Samuel Kirkwood Frank T. Campbell 1878 1882 Republican John H. Gear Orlando H. Manning 1882 1886 Republican Buren R. Sherman John A. T. Hull 1886 1890 Republican William Larrabee Alfred N. Poyneer 1890 1892 Republican Horace Boies Samuel L. Bestow 1892 1894 Democratic Horace Boies Warren S. Dungan 1894 1896 Republican Frank D. Jackson Matt Parrott 1896 1898 Republican Francis M. Drake James C. Milliman 1898 1902 Republican Leslie M. Shaw John Herriott 1902 1907 Republican Albert B. Cummins Warren Garst 1907 1908 Republican Albert B. Cummins George W. Clarke 1909 1913 Republican Beryl F. Carroll William L. Harding 1913 1917 Republican George W. Clarke Ernest Robert Moore 1917 1921 Republican William L. Harding John Hammill 1921 1925 Republican N. E. Kendall Clem F. Kimball 1925 1928 Republican John Hammill Arch W. McFarlane 1928 1933 Republican John Hammill Arch W. McFarlane 1928 1933 Republican Daniel Webster Turner Nelson G. Kraschel 1933 1937 Democratic Clyde L. Herring John K. Valentine 1937 1939 Democratic Nelson G. Kraschel Bourke B. Hickenlooper 1939 1943 Republican George A. Wilson Robert D. Blue 1943 1945 Republican Bourke B. Hickenlooper Kenneth A. Evans 1945 1951 Republican Robert D. Blue Kenneth A. Evans 1945 1951 Republican William S. Beardsley William H. Nicholas 1951 1953 Republican William S. Beardsley Leo Elthon 1953 1957 Republican William S. Beardsley Leo Elthon 1953 1957 Republican Leo A. Hoegh William H. Nicholas 1957 1959 Republican Herschel C. Loveless Edward J. McManus 1959 January 12, 1961 Democratic Herschel C. Loveless W. L. Mooty January 12, 1961 January 17, 1965 Republican Norman A. Erbe W. L. Mooty January 12, 1961 January 17, 1965 Republican Harold E. Hughes Robert D. Fulton January 17, 1965 January 1, 1969 Democratic Harold E. Hughes Roger Jepsen January 16, 1969 January 1973 Republican Robert D. Ray Arthur A. Neu January 1973 January 12, 1979 Republican Robert D. Ray Terry Branstad January 12, 1979 January 14, 1983 Republican Robert D. Ray Robert T. Anderson January 14, 1983 January 1987 Democratic Terry Branstad Jo Ann Zimmerman January 1987 January 1991 Democratic Terry Branstad Joy Corning January 1991 January 15, 1999 Republican Terry Branstad Sally Pederson January 15, 1999 January 12, 2007 Democratic Tom Vilsack Patty Judge January 12, 2007 January 14, 2011 Democratic Chet Culver Kim Reynolds January 14, 2011 May 24, 2017 Republican Terry Branstad Adam Gregg January 18, 2019 September 3, 2024 Republican Kim Reynolds Amy Sinclair September 3, 2024 December 16, 2024 Republican Kim Reynolds Chris Cournoyer December 16, 2024 Incumbent Republican Kim Reynolds ==Notes== ==Other websites== *",
 "title": "Lieutenant Governor of Iowa"
}