{
 "id": "567802",
 "text": "Greg Trooper (January 13, 1956 – January 15, 2017) was an American singer-songwriter. His songs have been recorded by many artists, including Steve Earle, Billy Bragg and Vince Gill. ==Early life== Trooper was born in Neptune Township, New Jersey, and raised in nearby Little Silver. He studied at the University of Kansas. ==Career== Trooper moved to New York City for the 1980s and part of the 1990s, where he formed The Greg Trooper Band along with Larry Campbell on guitar, Greg Shirley on bass and Walter Thompson on drums. During this time he recorded his first two records: We Won't Dance and the critically acclaimed Everywhere produced by Stewart Lerman. He also met songwriter/publisher Earl Shuman, who secured Trooper's first publishing deal with CBS Songs. Trooper's records caught the attention of Steve Earle, who recorded Trooper's \"Little Sister.\" In the early 1990s, Trooper met E Street Band bassist Garry Tallent who, like Trooper, would move to Nashville. Tallent produced Trooper's 1996 album Noises in the Hallway and released it on his D'Ville Record Group label. Popular Demons followed in 1998, on Koch Records and produced by Buddy Miller. After the release of that album, Trooper signed with Nashville indie Eminent Records, which released Straight Down Rain in 2001. ==Death== Tropper died on January 15, 2017 in Nashville, Tennessee from pancreatic cancer, aged 61. ==References== ==Other websites== * * Dutch website * No Depression Issue #33, May–June 2001 | \"Greg Trooper: a New Jersey yankee in King Acuff's court\" by Jim Musser * No Depression Issue #44 March–April 2003 | Greg Trooper: Between A House And A Hard Place (McConigel's Mucky Duck) CD review by Barry Mazor * Greg Trooper interview with Melissa Block, NPR \"All Things Considered\" April 5, 2005 * USA Today April 11, 2005 CD review by Brian Mansfield Category:1956 births Category:2017 deaths Category:Deaths from pancreatic cancer Category:Cancer deaths in Tennessee Category:American singer-songwriters Category:American guitarists Category:American pianists Category:Singers from New Jersey Category:Musicians from New Jersey Category:Writers from New Jersey",
 "title": "Greg Trooper"
}