{
 "id": "567838",
 "text": "The inauguration of Donald Trump as the 45th president of the United States happened on Friday, January 20, 2017, on the West Front of the United States Capitol Building in Washington, D.C. The inauguration marked the beginning of the first four-year term of Donald Trump as president and of Mike Pence’s only term as vice president. The presidential oath of office was administered to Trump by Chief Justice John Roberts on the Lincoln Bible and the vice presidential oath of office was administered to Pence by Associate Justice Clarence Thomas. Benedictions were given by several clerics (among them a rabbi and reverend Franklin Graham, son of the retired reverend Billy Graham, who for decades gave benedictions at the inauguration of US presidents). The main theme in the inauguration speech of President Trump was his focus on the interests of the United States (\"America first!\", \"Make America Great Again\"). Spectators were far fewer than at the inaugurations of his predecessor Barack Obama, although this was contested by President Trump and his spokesman. Most voters in Washington D.C. had voted for Hillary Clinton, Trump's main opponent in the 2016 presidential election. Presidents Jimmy Carter, Bill Clinton, George W. Bush, and Barack Obama, along with their respective wives, the First Ladies (including Hillary Clinton), had all confirmed their attendance at Trump's inauguration, and were all present. George H. W. Bush, age 92, did not attend the inauguration due to health reasons. Many groups applied for demonstration permits for Donald J. Trump's inauguration, including Bikers for Trump, and the Women's March on Washington, scheduled for the day after inauguration day. Most of the demonstrators were against the new president, and a few were rioters. ==References== ==Other websites== * * Military District of Washington - 58th Presidential Inauguration * @TrumpInaugural - Official Twitter account of the 58th Presidential Inaugural Committee (PIC) Category:2017 in the United States Category:Presidency of Donald Trump Category:January 2017 events Trump, Donald Trump, Donald",
 "title": "First inauguration of Donald Trump"
}