{
 "id": "567848",
 "text": "This article contains various lists of state leaders organized by age, defined as heads of state and/or heads of government. ==Oldest serving state leaders== ===Top ten currently serving=== People currently serving as head of state and/or head of government, a party leader of a one-party state, or a representative of a head of state. Rank Name Position Assumed office Born Age 1 President of Cameroon 1982Previously served as Prime Minister of Cameroon from 1975–1982. 2 President of the Palestinian National Authority, President of the State of Palestine 2005 3 King of Saudi Arabia 2015Served concurrently as Prime Minister of Saudi Arabia from 2015–2022. 4 King of NorwayThe Kingdom of Norway includes the dependent territory of Svalbard. 1991 5 Supreme Leader of Iran 1989Previously served as President of Iran from 1981–1989. 6 Chief Adviser of Bangladesh 2024 7 Emir of Kuwait 2023 8 President of Ireland 2011 9 President of Italy 2015 10 President of Côte d'Ivoire 2010Previously served as Prime Minister of Côte d'Ivoire from 1990–1993. ===Top ten of all time=== Rank Name Position Last year in office (reason term ended) Age at end 1 Giovanni Paolo Lascaris Grand Master of the Knights Hospitaller 1657 (death) 1 Giovanni Paolo Lascaris Hospitaller Malta 1657 (death) 2 Queen of the United Kingdom and other Commonwealth realmsIn 1952, Princess Elizabeth acceded as the monarch of seven Commonwealth realms. At the time of her death, she reigned as Queen of 15 sovereign states including the United Kingdom. From 1957–1983, most of her British colonies attained independence, and some joined the other realms in different years; most states ceased to be a realm upon becoming republics. 2022 (death) 3 Regent of Thailand 2016 (tenure ended) 4 King of Tonga 1893 (death) 5 Prime Minister of Malaysia 2020 (resigned) 6 da Ponte Doge of Venice 1585 (death) 7 O le Ao o le Malo of Samoa 2007 (death) 8 President of Zimbabwe 2017 (resigned) 9 Pope of the Holy SeeThe Vatican was Roman question with the Kingdom of Italy from 1870–1929. 1903 (death) 10 President of Tunisia 2019 (death) ==Youngest serving state leaders== ===Top ten currently serving=== Rank Name Position Assumed office Born Age 1 Prime Minister of Iceland 2024 12 May 1988 2 rowspan=2 President of the Patriotic Movement for Safeguard and Restoration of Burkina Faso 2022 14 March 1988 2 Interim President of Burkina Faso 2022 14 March 1988 3 President of Ecuador 2023 30 November 1987 4 Prime Minister of Montenegro 2023 24 September 1987 5 President of Montenegro 2023 7 December 1986 6 Prime Minister of Thailand 2024 21 August 1986 7 President of Chile 2022 11 February 1986 8 Prime Minister of Saudi Arabia 2022 31 August 1985 9 President of ChadPreviously President of the Transitional Military Council of Chad from 2021–2022, and Transitional President of Chad from 2022–2024. 2024 4 April 1984 10 Supreme Leader of North KoreaThe term Supreme Leader is used as a description, for the sake of brevity, rather than being an official title of a single office. The actual offices held by Kim Jong Un are: General Secretary of the Workers' Party of Korea, Chairman of the Central Military Commission of the Workers' Party of Korea, President of the State Affairs Commission of the DPRK, Supreme Commander of the Armed Forces of the DPRK. 2011 8 January 1984Kim's year of birth has been the subject of dispute. North Korean authorities and state-run media have stated Kim's birth date is 8 January 1982, but South Korean intelligence officials believe the actual date is a year later. Until 2018, the U.S. Treasury Department had claimed that his year of birth is 1984. ===Top ten since 1800=== Rank Name Position Assumed office Age when assuming office 1 King of Spain 1886 Became a monarch at birth as his father, Alfonso XII, had died the previous year. 2 King of Swaziland 1899 3 King of Egypt 1952 4 Emperor of China 1908 5 Rajendra Bikram Shah King of Nepal 1816 6 Queen of Spain 1833 7 King of Nepal 1950Gyanendra's 1951 Nepalese revolution was in 1950; he was deposed in the 1951 Nepalese revolution. 8 Emperor of China 1875 9 King of Iraq 1939 10 Emperor of Brazil 1831 ==Oldest state leaders== The following lists show the oldest people who have served office as state leader (not limited to their age while in office). ===Top ten living=== Rank Name Position In office Born Age 1 Acting President of Ecuador 1972–1976 2 Prime Minister of Japan 1994–1996 3 Prime Minister of Malaysia 1981–2003; 2018–2020 4 Chairman of the Council of Ministers of Afghanistan 1988–1989 5 President of Senegal 2000–2012 6 President of Lithuania 1998–2003; 2004–2009 7 President of the Presidency of Yugoslavia 1988–1989 8 Chairman of the Presidium of the Supreme People's Assembly of North Korea 1998–2019 9 Governor-General of the Bahamas 2010–2014 10 Prime Minister of Hungary 1993–1994 ===Top ten since 1800=== Rank Name Position Born Died Age 1 Acting Prime Minister of Cambodia (1962) 1905 2009 103 years, 143 days 2 rowspan=2 Prime Minister of Turkey (1937–1939) 1883 1986 103 years, 98 days 2 President of Turkey (1950–1960) 1883 1986 103 years, 98 days 3 Prime Minister of France (1952–1953) 1891 1994 102 years, 348 days 4 André Prunet- Foch French Viguier in Andorra (1977–1980) 1914 2017 102 years, 211 days 5 Prime Minister of Japan (1945) 1887 1990 102 years, 48 days 6 Prime Minister of Sudan (1969) 1917 2019 101 years, 321 days 7 Prime Minister of the Netherlands (1948–1958) 1886 1988 101 years, 314 days 8 rowspan=2 Chairman of the Council of Ministers of Vietnam (1988–1991) 1917 2018 101 years, 241 days 8 General Secretary of the Communist Party of Vietnam (1991–1997) 1917 2018 101 years, 241 days 9 Premier of the Republic of China (1947–1948) 1889 1990 101 years, 219 days 10 Prime Minister of Japan (1982–1987) 1918 2019 10 Acting President of Ecuador (1972–1976) 1923 Living --> ==Notes== Category:Lists of state leaders by age",
 "title": "Lists of state leaders by age"
}