{
 "id": "568135",
 "text": "Tiffany Ariana Trump (born October 13, 1993) is the fourth child and second daughter of President Donald Trump and his his second wife Marla Maples. Born in West Palm Beach, Florida, and primarily raised by her mother in California, Trump earned degrees from the University of Pennsylvania and Georgetown University Law Center. She briefly pursued music and fashion, and later became involved in politics by supporting her father's presidential campaigns in 2016 and 2020. In addition to her appearances at political events, she gained media attention for her social media presence. == Early life and education == Tiffany Ariana Trump was born on October 13, 1993, at St. Mary's Medical Center in West Palm Beach, Florida, two months before her parents married. She is Donald Trump's only child with his second wife, actress and television personality Marla Maples. She was named after jeweler Tiffany & Co.; her father purchased the air rights above the company's Fifth Avenue flagship store in the 1980s while building Trump Tower next door. Her parents divorced in 1999 after being separated for two years. She was raised by her mother in California. Trump has three elder half-siblings, Donald Jr., Ivanka and Eric, from her father's first wife, Ivana, and a younger half-brother, Barron, from Donald's third wife, Melania. Trump attended Viewpoint School in Calabasas, California, graduating in 2012. She attended the University of Pennsylvania (her father's alma mater) and graduated in 2016 with a Bachelor of Arts degree in sociology with a concentration in law and society, and was a member of Kappa Alpha Theta sorority. She then entered Georgetown University Law Center in Washington, D.C., and was awarded a J.D. degree in May 2020. == Career == In 2011, Trump released a music single called \"Like a Bird\". She later told The Oprah Winfrey Show that she was evaluating whether to take her music career \"to the next level as a professional\". In 2015, Trump worked as an intern for Vogue magazine and, in 2016, modeled for an Andrew Warren fashion show during New York Fashion Week. == Father's presidential campaigns == Trump made numerous appearances during her father's 2016 presidential campaign. She spoke at the 2016 Republican National Convention on the second night of the convention. Trump again campaigned for her father in 2020, including speaking at the 2020 Republican National Convention. She spoke at several in-person campaign events in the weeks before the election. == Personal life == In summer 2018, while on vacation in Greece with the actress Lindsay Lohan, Trump met Michael Boulos, a Lebanese-American business executive. The pair began a relationship and were married on November 12, 2022, at Mar-a-Lago in Palm Beach, Florida. In October 2024, it was announced that they were expecting their first child together. Trump is a frequent poster on Instagram, where she had 1.6 million followers . Her Instagram posts have frequently included photographs of herself with friends or with descendants of famous parents or grandparents, such as Kyra Kennedy, Gaïa Jacquet-Matisse, Reya Benitez, Ezra J. William, and EJ Johnson. The group has been named the \"rich kids of Instagram\" by the New York Post and the \"Snap Pack\" by The New York Times and New York magazine. == References == Category:1993 births Category:Living people Category:Models from Florida Category:Businesspeople from New York City Category:Children of Presidents of the United States Category:American Internet celebrities Category:Businesspeople from Florida Category:Trump family Category:People from West Palm Beach, Florida",
 "title": "Tiffany Trump"
}