{
 "id": "5681",
 "text": "Catherine Elise Blanchett (; born 14 May 1969) is an Australian actress, producer, and theatre director. She was born in Ivanhoe, Victoria, Australia. In 1998 she won an Academy Award nomination for Best Actress for playing Elizabeth I in Elizabeth. In 2005 she won Best Supporting Actress for playing Katharine Hepburn in Martin Scorsese's The Aviator. Regarded as one of the greatest actresses of her generation, she is noted for her versatile roles in blockbusters, independent films, and in her stage work in various theatre productions. She has received numerous accolades, including two Academy Awards, three Golden Globe Awards, and three British Academy Film Awards. In 2022 she was awarded with the international Goya award in Spain for her outstanding cinematographic career. That same year, she appeared in the movie Tár, which earned her multiple nominations such as for the Golden Globe Award and the Academy Award for Best Actress. == Filmography == Year Film Role Notes and awards 1994 Police Rescue: The Movie Vivian 1996 Parklands Rosie 1997 Oscar and Lucinda Lucinda Leplastrier Nominated - Australian Film Institute award, Best Lead Actress Thank God He Met Lizzie Lizzie Australian Film Institute award, Best Supporting Actress Paradise Road Susan Macarthy 1998 Elizabeth Queen Elizabeth I Won - Golden Globe Award for Best Actress - Motion Picture Drama Won - BAFTA Award for Best Actress in a Leading Role Won - BFCA Critics' Choice Award for Best Actress Nominated - Academy Award for Best Actress Nominated - SAG award for Best Actress in a Leading Role 1999 Bangers Julie- Anne The Talented Mr. Ripley Meredith Logue Nominated - BAFTA for Best Performance by an Actress in a Supporting Role Pushing Tin Connie Falzone An Ideal Husband Lady Gertrude Chiltern 2000 The Gift Annabelle \"Annie\" Wilson The Man Who Cried Lola 2001 The Shipping News Petal Quoyle Charlotte Gray Charlotte Gray The Lord of the Rings: The Fellowship of the Ring Galadriel Nominated - SAG award for Outstanding Performance by a Cast Bandits Kate Wheeler Nominated - Golden Globe for Best Actress - Comedy or Musical Nominated - SAG award for Best Actress in a Supporting Role 2002 The Lord of the Rings: The Two Towers Galadriel Nominated - SAG award for Outstanding Performance by a Cast Heaven Philippa 2003 The Lord of the Rings: The Return of the King Galadriel Won - SAG award for Outstanding Performance by a Cast Won - BFCA award for Best Acting Ensemble The Missing Magdalena 'Maggie' Gilkeson Coffee and Cigarettes Herself & Shelly Veronica Guerin Veronica Guerin Nominated - Golden Globe for Best Actress - Drama 2004 The Life Aquatic with Steve Zissou Jane Winslett-Richardson Nominated - BFCA award for Best Acting Ensemble The Aviator Katharine Hepburn Won - Academy Award for Best Supporting Actress Won - BAFTA award for Best Performance by an Actress in a Supporting Role Won - SAG award for Best Supporting Actress Nominated - BFCA award for Best Supporting Actress Nominated - Golden Globe for Best Supporting Actress 2005 Little Fish Tracy Heart Won - Australian Film Institute award for Best Lead Actress 2006 Babel Susan Jones Won - Gotham Award for Best Ensemble Nominated - SAG award for Outstanding Performance by a Cast in a Motion Picture Nominated - BFCA award for Best Acting Ensemble The Good German Lena Brandt Notes on a Scandal Sheba Hart Nominated - BFCA for Best Supporting Actress Nominated - Golden Globe for Best Supporting Actress Nominated - SAG for Best Supporting Actress Nominated - Academy Award for Best Supporting Actress 2007 Hot Fuzz Janine Uncredited Cameo Elizabeth: The Golden Age Queen Elizabeth I Nominated - BFCA award for Best ActressInto the Wild Leads Critics Choice Nominations with Seven! . Awards Daily Oscar Watch.BFCA Nominees 2007 . Broadcast Film Critics Association. Nominated - Golden Globe for Best Actress - Drama Nominated - SAG award for Best Actress in a Leading RoleNominations Announced for the 14th Annual Screen Actors Guild Awards . SAG Awards.org. Nominated - BAFTA Award for Best Actress in a Leading RoleBAFTA Nominees . Awards Daily Oscar Watch. Nominated - Academy Award for Best Actress I'm Not There Jude Quinn (Bob Dylan) Won - Volpi Cup for Best Actress Won - Golden Globe award for Best Supporting Actress Won - Independent Spirit Award for Best Supporting Actress Nominated - BFCA award for Best Supporting Actress Nominated - SAG award for Best Supporting Actress Nominated - BAFTA Award for Best Actress in a Supporting Role Nominated - Academy Award for Best Supporting Actress 2008 Indiana Jones and the Kingdom of the Crystal Skull Agent Irina Spalko The Curious Case of Benjamin Button Daisy 2009 Fantastic Mr. Fox Mrs. Fox Voice 2013 Blue Jasmine Jeanette \"Jasmine\" Francis The Hobbit: The Desolation of Smaug Galadriel 2014 The Monuments Men Claire Simone How to Train Your Dragon 2 Valka Voice The Hobbit: The Battle of the Five Armies Galadriel 2015 Knight of Cups Nancy Cinderella Stepmother Carol Carol Aird Truth Mary Mapes Manifesto Various == References == Category:Satellite Award winners Category:1969 births Category:Living people Category:Actors from Melbourne Category:Australian movie actors Category:Australian stage actors Category:Australian television actors Category:Best Actress Academy Award winners Category:Best Supporting Actress Academy Award winners Category:BAFTA Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:Australian theatre directors",
 "title": "Cate Blanchett"
}