{
 "id": "568117",
 "text": "Harambe was a gorilla at the Cincinnati Zoo and Botanical Garden. On May 28, 2016, a three-year-old boy (\"Isaiah Dickerson\") climbed into a gorilla enclosure at the zoo and was grabbed and dragged by Harambe, a 17-year-old Western lowland gorilla. Fearing for the boy's life, a zoo worker shot and killed Harambe. It was recorded on video and was shown on news services around the world. There was a lot of argument about the decision to kill Harambe. == History == === Early life === Harambe was born at the Gladys Porter Zoo in Brownsville, Texas, on May 27, 1999. He was named by Dan Van Coppenolle, a local area counselor who won a naming contest sponsored by the zoo. He came up with the name after listening to the 1988 song \"Harambe (Working Together for Freedom)\" by Rita Marley, widow of Bob Marley. === Death === On May 28, 2016, a 3-year-old boy was visiting the Cincinnati Zoo and he fell into the moat at the zoo. The boy climbed a fence, crawled through bushes, and fell into a moat of shallow water. Zoo workers signaled for the three gorillas to go back inside, the two females went back inside. The third gorilla, a male silverback gorilla named Harambe climbed down to the moat to see the boy splashing in the water. After 10 minutes, Harambe carried the child through the water and then carried him up a ladder out of the moat onto dry land. Zoo workers then shot Harambe in the head with a rifle. Cincinnati firefighters said the boy was between Harambe's legs when Harambe was shot. Harambe was killed one day after his 17th birthday. The boy was taken to Cincinnati Children's Hospital Medical Center, his injuries weren't life-threatening. === Aftermath === A number of primatologists and conservationists said that the zoo had no other choice under the circumstances, and that they did the right thing. The boy's mother also became the target of harassment on the internet and social media. On June 6, 2016, the Ohio prosecutor said that the mother would not face any charges of wrongdoing. The zoo was being investigated by the Association of Zoos and Aquariums (AZA), which sets the standards for zoos, and the USDA. Experts Jack Hanna and Jane Goodall defended the zoo's actions in killing Harambe. ==Memes== Several internet memes were made, which said that the death of Harambe caused several major events, such as the return of the Taliban, the COVID-19 pandemic and subsequent toilet paper shortages, the January 6th US Capitol attack, the GameStop short squeeze, the Russian invasion of Ukraine, and Fortnite dancing. The director encouraged people to stop making these memes. In Australia, people joked about supporting Harambe's corpse as a write-in candidate on the ballot for the federal election. Public Policy Polling included Harambe in their polling for the U.S. presidential election. Harambe had 5% support in late July 2016 (ahead of Green Party nominee Jill Stein) and 2% in August 2016 (tied with Stein). ==References== Category:1999 births Category:2016 deaths Category:Deaths by firearm in the United States Category:Individual animals Category:2016 in the United States Category:2010s in Ohio Category:Cincinnati Category:May 2016 events",
 "title": "Killing of Harambe"
}