{
 "id": "568427",
 "text": "Kendang or Gendang is a two-headed drum. It is used by people from the Indonesian Archipelago. Kendang is one of the first instruments used in the Gamelan ensembles of Javanese, Sundanese, and Balinese, the Kendang ensemble as well as various Kulintang ensembles in Indonesia. It is made in many ways by different ethnic groups. == Accompaniments == ===Sundanese=== In Sundanese Gamelan, a minimum set consists of three drums. * (large drum) * , two (small drum). Kendang Kulanter is divided into two, namely the Katipung and the Kutiplak. Many types of Sundanese Kendang are distinguished according to their function in accompaniment : * Kendang Kiliningan * Kendang Jaipongan * Kendang Ketuk Tilu * Kendang Keurseus * Kendang Penca * Kendang Bajidor * Kendang Sisingaan and others. Each type of drums in Sundanese music has a difference in size, pattern, variety, and motif. ===Javanese=== In Gamelan Surakarta, four sizes of kendhang are used: * , (krama/ngoko, similar to ), or is the largest , which usually has the deepest tone. It is played by itself in the (lit. \"single drum\") style, which is used for the most solemn or majestic pieces or parts of pieces. It is played with the kendhang ketipung for (lit. \"double drum\") style, which is used in faster tempos and less solemn pieces. * is also medium-sized, and was traditionally used to accompany performances, although now other drums can be used as well. * or https://omeka1.grinnell.edu/MusicalInstruments/exhibits/show/ens/item/82 is a medium-sized drum, used for the most complex or lively rhythms. It is typically used for livelier sections within a piece. The word ciblon derives from a Javanese type of water-play, where people smack the water with different hand shapes to give different sounds and complex rhythms. The technique of this , which is said to imitate the water-play,Lindsay, Jennifer (1992). Javanese Gamelan, p.22. . \"The technique of is very difficult to acquire. is the Javanese name for a type of water-play, popular in villages, where a group of people, through smacking the water with different hand- shapes, produce complex sounds and rhythmic patterns. These sounds are imitated on the dance drum.\" is more difficult to learn than the other kendang styles. * is the smallest , used with the in (double drum) style. ===Balinese=== In , there are two : * , the \"female\" and lowest pitched. * , the \"male\" and highest pitched. ===Makassarese=== (Makassarese s) can be divided to three types: * is the largest drums as a result it is also called (largest drum in Makassarese language).These drums are usually used in important sacred ceremonies such as blessing for sultanate's heirlooms. * are usually smaller with diameters measuring in 30–40 cm, which are usually used for dance, which used 2-4 drums with differing beats and symbolizes the men's strength and vitality. * are usually the smallest with diameters measuring in 20–25 cm, and used as martial arts accompaniments. ===Buginese=== Among the Bugis there are two types of playing techniques based on the position of the . if the is placed on the player's lap it is called . If the players are standing with the s tied with a shoulder strap it is called , this position are usually used for sacred ceremony, or for entertainment like beating of rice mortars or . There are generally three types of beats pattern in playing: * patterns are usually the beginning as intro * are played afterwards which are usually more energetic * patterns are used afterward, as finale. == Gallery == File:SambaSunda Quintett in Cologne (0253).jpg|A member of the Sundanese Gamelan quintet Samba-Sunda, a family playing Sundanese drums (). Image:Gamelan of Bali 200507-3.jpg| of Bali, note the equal size of both sides. The drum in this picture is exceptional - usually Balinese s are conical (actually hour-glass formed on the inside). Image:COLLECTIE TROPENMUSEUM Dubbelvellige tonvormige trom onderdeel van gamelan Slendro TMnr 500-7.jpg| of Java, one side is bigger than other. == Related pages == * Dabakan * Gendang beleq * Rampak Kendang == Sources == ==Further reading== * Sumarsam. Javanese Gamelan Instruments and Vocalists. 1978-1979. == Other websites == * Kendang information, with audio * Rampak Kendang in Google. Category:Drums Category:Indonesian culture",
 "title": "Kendang"
}