{
 "id": "568409",
 "text": "Ludvík Svoboda (25 November 1895 – 20 September 1979) was a Czechoslovak legionnaire during World War I and a commander of the Czechoslovak army in Russia during World War II. He was later elected as president of Czechoslovakia from 1968 to 1975. == Early Life == Ludvík Svoboda was born in Hroznatín, Moravia, Austria-Hungary. He joined the Austro-Hungarian army in 1915 when he was 20. He was sent to the east to fight against Russia, where he was captured. Svoboda then joined the Czecholovak legion in Russia to fight against Austria-Hungary in the battles of Zborov and Bakhmach. Upon return, he was declared a hero and joined the new Czechoslovak army in 1921. == World War II == In early 1930, Svoboda taught in a military academy in Prague. After the Munich Agreement in spring 1939, he joined an underground organization called Obrana národa (Defence of the Nation). He also started to cooperate with the Soviet Union. Svoboda moved to Poland and established a Czechoslovak legion, but when the USSR invaded Poland from east, he was captured and sentenced to death. His allies in Moscow freed him, and he started to free people from the gulags in order to use them in his legion. He became a commander of the Czechoslovak army in the east in 1943 and fought in the battle of Sokolov in Ukraine. His position was leader of 1st Czechoslovak corps. He then fought in the battle of Dukla Pass. With trust from Klement Gottwald, Svoboda became a general in 1945 and was named a Hero of East front. == Presidency == After the ending of the Antonín Novotný regime, in the period known as the Prague Spring, Svoboda was elected President of Czechoslovakia on 30 March 1968, on the recommendation of Alexander Dubček. He was an acceptable candidate both for Czechs and Slovaks, and was seen as a war hero and a victim of the purges of the early 1950s. People saw him as a new light of democracy and reform. However, Svoboda was afraid of the Soviet Union, because he saw all the crimes that they had committed. Until he signed the Warsaw pact, Czechoslovakia was unable to do anything against the Russian invasion in the year 1969. He seemingly lost power in interior matters and in foreign affairs, and he couldn't trust the leadership of his political party. During his second term, Svoboda suffered from a heart attack and was forced to resign. His succesor was G.Husák. == Rest of his life == His health deteriorated and he spent the last years of his life in his house in Prague with his wife Irena. After his death in 1979, he was held a big national and military funeral. His funeral was not offiically organized, but thousands of people came to show their appreciation and respect. He was buried in Žižkov with the anthem of the 1st Czechoslovak corps, Směrem k Praze (Headed to Prague) playing. In 1995, his body was removed and send to his family crypt in Kroměříž. Category:Military personnel of World War II Category:Presidents of Czechoslovakia Category:1895 births Category:1979 deaths",
 "title": "Ludvík Svoboda"
}