{
 "id": "568456",
 "text": "Miguel José Ferrer (February 7, 1955 - January 19, 2017) was an American actor. He was mostly known for villainous roles such as Bob Morton in RoboCop. He also voiced Delgado in Beverly Hills Chihuahua 2, the villain Hun leader Shan Yu in Mulan (1998) and Big Boss in Rio 2. Ferrer's other notable roles include Dr. Garret Macy on Crossing Jordan, NCIS Assistant Director Owen Granger on NCIS: Los Angeles, Vice President Rodriguez in Iron Man 3, and FBI forensic pathologist Albert Rosenfield in Twin Peaks. ==Personal life== Ferrer was born in Santa Monica, California to Academy Award-winning actor José Ferrer and singer Rosemary Clooney. His first cousin is actor George Clooney. He never went to college because he began his Hollywood career at an early age. His career began in 1981. He was married to actress Leilani Sarelle from 1991 until they divorced in 2003. In 2005, he married Lori Weintraub. They had three children. Ferrer died on January 19, 2017 from throat cancer at his home in Los Angeles, California, aged 61. ==Filmography== ===Animated Roles=== * Adventure Time - Death, Grod * American Dad! - Agent Hopkins * Ben 10: Ultimate Alien - Alpha Squad, Magister Hulka * Hercules - Antaeus * Jackie Chan Adventures - Tarakudo the Shadowkhan King * Robot Chicken - Danny Ocean * Stretch Armstrong and the Flex Fighters - Stretch Monster (2017) * Superman: The Animated Series - Aquaman, De'Cine, Weather Wizard/Mark Mardon * The Batman - Sinestro * The Spectacular Spider-Man - Silvermane * ThunderCats - Duelist * Young Justice - Bibbo Bibbowski, Tribune, Vandal Savage (2010-2013) ===Film Roles=== * Beverly Hills Chihuahua 2 - Delgado * Beverly Hills Chihuahua 3: Viva la Fiesta! - Delgado * Justice League: The New Frontier - Martian Manhunter/J'onn J'onzz * Mulan - Shan-Yu * Rio 2 - Big Boss * Teen Titans: The Judas Contract - Deathstroke/Slade Wilson ===Video Game Roles=== * Halo 2 - Heretic Leader ==References== ==Other websites== * * Voice chasers * The A.V. Club interview Category:1955 births Category:2017 deaths Category:Deaths from throat cancer Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Santa Monica, California",
 "title": "Miguel Ferrer"
}