{
 "id": "568754",
 "text": "The arrondissement of Mauriac is an arrondissement of France. It is part of the Cantal département in the Auvergne-Rhône-Alpes region. Its capital, and subpréfecture of the department, is the city of Mauriac. ==History== When the arrondissements were created in 1800, Mauriac was one of them in the Cantal department. ==Geography== The arrondissement of Mauriac is in the northwest of the department and has an area of , the smallest and with fewest people living in it with 26,192 inhabitants and a population density of inhabitants/km². The arrondissement is bordered to the north and west by the Corrèze department (Nouvelle-Aquitaine), to the northeast by the Puy-de-Dôme department, to the east by the arrondissement of Saint-Flour and to the south by the arrondissement of Aurillac. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Mauriac, there is only two cantons where not all their \"communes\" are in the arrondissement, Naucelles and Riom- ès-Montagnes. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Mauriac INSEE Code Canton Aurillac Mauriac Saint-Flour Total 1505 Mauriac 20 20 1508 Naucelles 14 2 16 1510 Riom-ès-Montagnes 14 9 23 1515 Ydes 19 19 ===Communes=== The arrondissement of Mauriac has 55 communes; they are (with their INSEE codes): # Ally (15003) # Anglards-de-Salers (15006) # Antignac (15008) # Apchon (15009) # Arches (15010) # Auzers (15015) # Barriac-les- Bosquets (15018) # Bassignac (15019) # Beaulieu (15020) # Brageac (15024) # Chalvignac (15036) # Champagnac (15037) # Champs-sur-Tarentaine-Marchal (15038) # Chaussenac (15046) # Collandres (15052) # Drugeac (15063) # Escorailles (15064) # Fontanges (15070) # Jaleyrac (15079) # La Monselie (15128) # Lanobre (15092) # Le Falgoux (15066) # Le Fau (15067) # Le Monteil (15131) # Le Vaulmier (15249) # Le Vigean (15261) # Madic (15111) # Mauriac (15120) # Menet (15124) # Moussages (15137) # Méallet (15123) # Pleaux (15153) # Riom-ès-Montagnes (15162) # Saignes (15169) # Saint-Bonnet-de-Salers (15174) # Saint-Chamant (15176) # Saint-Hippolyte (15190) # Saint-Martin-Cantalès (15200) # Saint-Martin-Valmeroux (15202) # Saint-Paul-de-Salers (15205) # Saint-Pierre (15206) # Saint-Projet-de-Salers (15208) # Saint-Vincent-de- Salers (15218) # Saint-Étienne-de-Chomeil (15185) # Sainte-Eulalie (15186) # Salers (15219) # Salins (15220) # Sauvat (15223) # Sourniac (15230) # Trizac (15243) # Trémouille (15240) # Valette (15246) # Vebret (15250) # Veyrières (15254) # Ydes (15265) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 15120 Mauriac 3,682 Mauriac Le Pays de Mauriac 15162 Riom-ès-Montagnes 2,661 Riom-ès-Montagnes Le Pays Gentiane 15265 Ydes 1,778 Ydes Sumène - Artense 15153 Pleaux 1,531 Mauriac Le Pays de Salers 15092 Lanobre 1,441 Ydes Sumène - Artense 15037 Champagnac 1,066 Ydes Sumène - Artense 15038 Champs-sur-Tarentaine-Marchal 1,050 Ydes Sumène - Artense ==Related pages== * Arrondissements of the Cantal department * Communes of the Cantal department * List of arrondissements of France ==References== Mauriac",
 "title": "Arrondissement of Mauriac"
}