{
 "id": "56870",
 "text": "Haylie Katherine Duff (born February 19, 1985) is an American actress and singer. She is best known for her supporting role on the television series 7th Heaven. She is the sister of Hilary Duff. Duff was born in Houston, Texas. Her mother, Susan Duff, is a producer. Robert Erhard Duff, Haylie's father, lives at the family home in Houston. Haylie is two and a half years older than her sister. == Family == Hilary Duff is her younger sister. == Discography == Duff wrote or co-wrote several songs on two of her sister Hilary's albums, Metamorphosis (2003), Hilary Duff (2004) and the song, \"Gypsy Woman\", on Hilary's 4th album, Dignity. She has also done many songs for different soundtracks with her sister. === Soundtracks === * 2003 \"Girl In The Band\" — The Lizzie McGuire Movie soundtrack * 2004 \"Sweetest Pain\" — Raising Helen soundtrack * 2004 \"A Whatever Life\" — Stuck In The Suburbs soundtrack * 2004 \"One In This World\" — A Cinderella Story soundtrack * 2004 \"Our Lips Are Sealed\" (with Hilary Duff) — A Cinderella Story soundtrack * 2005 \"Babysitting Is A Bum Deal\" (duet with Stewie Griffin) — Family Guy: Live in Vegas soundtrack * 2006 \"Material Girl\" (with Hilary Duff) — Material Girls soundtrack & Girl Next CD * 2008 \"Blow My Mind\" — Drop Dead Gorgeous soundtrack & Girl Next CD === Other songs === * \"Same Old Christmas\" (with Hilary Duff) * \"The Siamese Cat Song\" (with Hilary Duff) * \"The Siamese Cat Song\" [Cat-Scratch Remix] (with Hilary Duff) === Filmography === Year Film Role Notes 1998 Addams Family Reunion Gina Adams Direct to video 2000 Dreams in the Attic Jessica 2001 The Newman Shower Wendy 2003 I Love Your Work Frat Brat Girlfriend 2004 Napoleon Dynamite Summer Wheatly 2004 In Search of Santa Lucinda Direct-to-video release 2005 Dishdogz Cassidy 2006 Material Girls Ava Marchetta 2007 Nightmare (TV) Molly Duggan Made for TV My Sexiest Year Debbie I Remember Jenni Ryan 2008 Legacy Lana Stevens 2008 Deep Cove Jenna 2009 Love Takes Wing Annie Nelson Love Comes Softly series 2009 Love Finds a Home Annie Nelson Love Comes Softly series 2009 Foodfight! Sweet Cakes Voice 2009 A Nanny's Secret Claudia 2009 Tug Jill === TV appearances === * 2005-2007: 7th Heaven as Sandy Jameson * 2002-2003: Lizzie McGuire as Amy ;Guest appearances * 1999: The Amanda Show as Jealous Girl in Crowd * 2000: Chicago Hope as Jenny * 2001: Boston Public as Sylvia (two appearances) * 2003: American Dreams as Shangri-Las (with Hilary) * 2003: Third Watch as Young Faith * 2004: That's So Raven as Katina * 2004: One on One as Mandy * 2005: Complete Savages as Jessica * 2005: Joan of Arcadia as Stevie Marx (three appearances) * 2007: My Sexiest Year as Debbie * 2008: Backwoods as Lee * 2008: Doesn't Texas Ever End as Mercedez * 2009: Slightly Single in L.A. as Jill == Other websites == *Haylie Duff cast bio on The CW * Category:1985 births Category:Living people Category:Actors from Houston Category:American movie actors Category:American pop singers Category:American television actors Category:Singers from Houston",
 "title": "Haylie Duff"
}