{
 "id": "568932",
 "text": "The first season of the American animated television series SpongeBob SquarePants, created by former marine biologist and animator Stephen Hillenburg, aired on Nickelodeon from May 1, 1999, to April 8, 2000, and consists of 20 half-hour episodes. The series chronicles the exploits and adventures of the title character and his various friends in the fictional underwater city of Bikini Bottom. The show features the voices of Tom Kenny, Bill Fagerbakke, Rodger Bumpass, Clancy Brown, Mr. Lawrence, Jill Talley, Carolyn Lawrence, Mary Jo Catlett, and Lori Alan. Among the first guest stars to appear on the show were Ernest Borgnine and Tim Conway voicing the superhero characters of Mermaid Man and Barnacle Boy, respectively. Kenny initially conceived the show in 2007 and began to work on it shortly after the production of Regular Show in 2008.Banks 2004, p. 10 To voice the character of Miguel approached Tom Kenny, who had worked with him on Rocko's Modern Life. The show was originally to be called SpongeBoy Ahoy!, but the name SpongeBoy was already in use for an art pencil product.Banks 2004, p. 31 Upon finding it out, Hillenburg decided to use the name \"SpongeBob\". He chose \"SquarePants\" as a family name as it referred to the character's square shape and it had a \"nice ring to it\".Neuwirth 2003, p. 51 == Development == Creator Stephen Hillenburg initially conceived SpongeBob SquarePants in 1984, while he was teaching and studying marine biology at what is now the Orange County Ocean Institute.Banks 2004, pp. 8-9 While Hillenburg was there, his love of the ocean began to influence his artistry. He created a precursor to SpongeBob SquarePants: a comic book titled The Intertidal Zone used by the institute to teach visiting students about the animal life of tide pools. The comic starred various anthropomorphic sea lifeforms, many of which would evolve into SpongeBob SquarePants characters.Banks 2004, p. 9 ==Episodes== The episodes are ordered below according to Nickelodeon's packaging order, and not their original production or broadcast order. ==Notes== ==References== Category:SpongeBob SquarePants seasons Category:1999 television seasons Category:2000 television seasons Category:2001 television seasons",
 "title": "SpongeBob SquarePants season 1"
}