{
 "id": "569004",
 "text": "Plomb du Cantal is a French mountain, the highest summit of Mounts of Cantal in the Massif Central, France. It is part of the Regional Natural Park of the Volcanoes of Auvergne (). It is the highest mountain of the Cantal department and the second highest in the Massif Central, after Puy de Sancy that is high. ==Geography== Plomb du Cantal is in the Mounts of Cantal, a chain of volcanic mountains in the Massif Central, in the centre of the Cantal department. It is at about to the northeast of Aurillac, the capital of the Cantal department. The summit is on the border between the communes of Saint-Jacques-des-Blats to the west and Albepierre-Bredons to the east. Many rivers start on the slopes of the mountain; they flow through three main drainage basins: * to the west, on the side of Saint-Jacques-des-Blats, is the drainage basin of the Cère river that flows to the Dordogne river; * to the south, on the side of the commune of Brezons, is the drainage basin of the Brezons river that flows to the Garonne river; and * to the northeast, on the side of Albepierre-Bredons, is the drainage basin of the Alagnon river that flows to the Loire river. The Plomb du Cantal, with other near mountains, is part of the stratovolcano of Cantal, the largest French stratovolcano and one of the most important of Europe with an area of almost . It had, 4 millions of years ago, an elevation of or higher. Because its importance for the movement of migratory birds, the Plomb du Cantal together with the Mounts of Cantal are part of a Special Protection Area since 2005: FR8310066 - Monts et Plomb du Cantal. == Ski resorts == There are two main ski stations (places where people go to practice skiing) on the slopes of Plomb du Cantal or near it: Le Lioran, also known as Super Lioran, and Prat-de-Bouc. == Climbing == To get to the summit, there are three climbing routes: # By cable car to the Lioran station followed by hiking during about 10 minutes; # Hiking to the Lioran station and then to the mountain during about 1 hour and a half; and # Hiking from the Prat-de-Bouc parking lot during about 2 hours. == Gallery == File:Le plomb du Cantal.jpg|The Plomb du Cantal. File:Prat-de-Bouc.jpg|The Col de Prat-de-Bouc and the Plomb du Cantal. File:Telepherique du plomb du cantal.jpg|Plomb du Cantal cable car in Lioran ==References== ==Other websites== * Plomb du Cantal et Puy du Rocher par le col de Prat de Bouc - Altituderando * Plomb du Cantal - peakery * Le Lioran Category:Mountains of France Category:Cantal",
 "title": "Plomb du Cantal"
}