{
 "id": "569071",
 "text": "In phonetics (the study of sounds in human speech), the place of articulation of a sound is where in the mouth the sound is made (articulated). There are at least 13 different places of articulation. They are split into four big types. ==Labial (lips)== Labial sounds are made with one or two lips. They are split into three types: ===Bilabial (two lips)=== Bilabial sounds are made with both lips. The bilabial sounds in English are [], [], and []. ===Labiodental (lip and teeth)=== Labiodental sounds are made with the lips and the teeth. Almost always the top lip and the bottom teeth are used. The labiodental sounds in English are [] and []. ===Linguolabial (lip and tongue)=== Linguolabial sounds are made by the tongue touching the top lip. There are no linguolabial sounds in English. Sometimes it is said to be part of the next group (Coronal). ==Coronal (tip of the tongue)== Coronal sounds are made with the tip of the tongue. They are split into three types: === Dental (teeth and tongue) === Dental sounds are made by the tip of the tongue touching the back of the teeth. The dental sounds in English are [] and []. === Alveolar (gum ridge and tongue) === Alveolar sounds are made by the tip of the tongue touching the ridge behind the teeth. The alveolar sounds in English are [], [], [], [], [], and []. === Retroflex (roof of the mouth and tongue) === Retroflex sounds are made by pressing the tongue flat against the front part of roof of the mouth. There are no retroflex sounds in English. === Palatal (roof of the mouth and tongue) === Palatal sounds are made by the body of the tongue and the middle part of the roof of the mouth. The only palatal sound in English is []. Some say that it is part of the next group (dorsal). == Dorsal (body of the tongue) == Dorsal sounds are made with the body of the tongue. ===Velar (soft palate and back of the tongue)=== Velar sounds are made with the back of the tongue and the soft palate. There are three velar sounds in most dialects of English: [], [], and []. ===Uvular (uvula and back of the tongue)=== Uvular sounds are made with the back of the tongue and the uvula. There are no uvular sounds in English. Category:Anatomy Category:Linguistics",
 "title": "Place of articulation"
}