{
 "id": "569082",
 "text": "Lawrence Alan \"Larry\" Kudlow (born August 20, 1947) is an American conservative commentator, economic analyst, television personality, and newspaper columnist. He was the 12th Director of the National Economic Council from April 2, 2018 to January 20, 2021. He was the host of CNBC's The Kudlow Report. As a syndicated columnist, his articles appear in numerous U.S. newspapers and web sites, including his own blog, Kudlow's Money Politic$. In March 2018, President Donald Trump appointed Kudlow to be Director of the National Economic Council, replacing Gary Cohn. ==Personal life== Kudlow was born and raised in Englewood, New Jersey. He is of Jewish descent, and converted to Roman Catholicism. On June 11, 2018, Kudlow suffered a heart attack. == Career == In 1970, while he was still a Democrat, Kudlow joined Americans for Democratic Action chair Joseph Duffey's \"New Politics\" senatorial campaign in Connecticut which also attracted an \"A-list crowd of young Democrats\", including Yale University law student Bill Clinton, John Podesta, and Michael Medved, another future conservative. Duffey was a leading anti-war politician during the Vietnam war era. Duffey's campaign manager called Kudlow a \"brilliant organizer\". In 1976, he worked on the U.S. Senate campaign of Daniel Patrick Moynihan, along with Tim Russert, against Conservative Party incumbent James L. Buckley, brother of William F. Buckley, Jr. Kudlow began his career as a staff economist at the Federal Reserve Bank of New York, taking a position \"as a junior economist in a job where a master's degree wasn't required\". He worked in the division of the Fed that handled open market operations. During the first term of the Reagan administration (1981–1985), Kudlow was associate director for economics and planning in the Office of Management and Budget (OMB), a part of the Executive Office of the President. In April 2005, New York Governor George Pataki included Kudlow in a six-member state tax commission. Kudlow's name was floated by Republicans as a potential Senate candidate in either Connecticut or New York in 2016. In October 2015, U.S. Senator Richard Blumenthal, in an email to supporters, attacked Kudlow as \"a champion of big corporations and big money\" despite Kudlow's not announcing a run. In early December 2015, Jack Fowler of National Review created a 527 organization that encouraged Kudlow to run. ==References== ==Other websites== * Kudlow's Money Politic$ blog * Kudlow & Company consulting company * Profile at CNBC.com * Column archive at Townhall.com * Column archive at National Review Online * Column archive at Creators Syndicate * * Category:1947 births Category:Living people Category:Directors of the National Economic Council Category:American columnists Category:American economists Category:American Roman Catholics Category:American television personalities Category:Jewish American entertainers Category:Jewish American writers Category:People from Englewood, New Jersey Category:Television personalities from New Jersey Category:University of Rochester alumni Category:Journalists from New Jersey Category:American bloggers",
 "title": "Lawrence Kudlow"
}