{
 "id": "569176",
 "text": "The politics of the Netherlands is that of an indirect democracy. It has a constitution and a monarchy that operates within the constitution. The democratic structure is determined by a parliament (the legislative branch) and a government (the executive branch). The government depends on the confidence of the parliament, but the two branches aren't strictly separated (the parliamentary system). The parliament is called the States General (Dutch: Staten-Generaal) and consists of two chambers: a lower house, the so- called Second Chamber (Dutch: Tweede Kamer), comparable with the House of Representatives in other countries, and a upper house, the so-called First Chamber (Dutch: Eerste Kamer), comparable with the Senate in other countries, and often called likewise. At a lower level, there are provinces, municipalities and water boards. On a higher level, the Netherlands makes part of the Benelux, Council of Europe, European Union, NATO and the United Nations. The Netherlands is officially called the Kingdom of the Netherlands. It is composed of four countries: the Netherlands itself (the European part) and three island countries in the Caribbean: Aruba, Curaçao and Saint Martin. Three other islands in the Caribbean that belong to the Netherlands have a status of special municipalities of the Netherlands, the so-called Caribbean Netherlands. == Government == Current government is the Fourth Rutte cabinet, a coalition of the People's Party for Freedom and Democracy (VVD, a conservative liberal party), Democrats 66 (D66, a social liberal party), the Christian Democratic Appeal (CDA, a Christian democratic party), and the ChristianUnion (CU, an orthodox Christian democratic party). The Fourth Rutte Cabinet was established on January 10, 2022. Prime Minister has been VVD politician Mark Rutte since 2010. == Political parties == The following 18 political parties are in parliament: * 50+ - 50PLUS (Dutch: 50PLUS), a party focused on the interests of elder people. * BBB - FarmerCitizenMovement (Dutch: BoerBurgerBeweging), a party focused on the interests of the rural environment. * CDA - Christian Democratic Appeal (Dutch: Christen-Democratisch Appèl), a Christian democratic party. Previous Prime Minister Jan Peter Balkenende is a CDA member. * CU - ChristianUnion (Dutch: ChristenUnie), an orthodox Christian democratic party. * D66 - Democrats 66 (Dutch: Democraten 66), a social liberal party, founded in 1966. * DENK - DENK (Dutch: DENK), a party aiming at non-western citizens. * FVD - Forum for Democracy (Dutch: Forum voor Democratie), a party critical about the current political situation. * GL - GreenLeft (Dutch: GroenLinks), a leftist party that pays special attention to the environment. * JA21 - JA21 (Dutch: JA21), a conservative liberal and nationalist party. * NSC - New Social Contract (Dutch: Nieuw Sociaal Contract), a centrist party focused on governmental renewal. * OPNL - Independent Politics the Netherlands (Dutch: Onafhankelijke Politiek Nederland), till 2022 Independent Senate Group (Dutch: Onafhankelijke Senaatsfractie, shortened OSF), a collection of local parties, for example the Frisian National Party (FNP) * PvdA - Labour Party (Dutch: Partij van de Arbeid), a social democratic party. * PvdD - Party for the Animals (Dutch: Partij voor de Dieren), a party for animal rights and against global warming. * PVV - Party for Freedom (Dutch: Partij voor de Vrijheid), a populist party, established by Geert Wilders. * SGP - Reformed Political Party (Dutch: Staatkundig Gereformeerde Partij), a conservative Calvinist party. * SP - Socialist Party (Dutch: Socialistische Partij), a socialist party. * Volt - Volt Netherlands (Dutch: Volt Nederland), a pan-European party. * VVD - People's Party for Freedom and Democracy (Dutch: Volkspartij voor Vrijheid en Democratie), a conservative liberal party. Current Prime Minister Mark Rutte is a VVD member. No more in parliament: * AOV - General Senior Alliance (Dutch: Algemeen Ouderen Verbond), a former party focused on the interests of elder people. * BIJ1 - BIJ1 (Dutch: BIJ1), a party focused on combatting racism and gender discrimination. * BP - Farmers' Party (Dutch: Boerenpartij), a former party focused on the interests of farmers. * CD - Centre Democrats (Dutch: Centrum Democraten), a former anti-immigration party. * DS'70 - Democratic Socialists 1970 (Dutch: Democratisch-Socialisten 1970), a former moderate social democratic party, a split from the PvdA. * LN - Livable Netherlands (Dutch: Leefbaar Nederland), a former populist party. * LPF - Pim Fortuyn List (Dutch: Lijst Pim Fortuyn), a former populist party established by the in 2002 murdered politician Pim Fortuyn. == Political leaders == Political leaders since 13 December 2023, sorted by the number of seats in the House of Representatives. Geert Wilders op Prinsjesdag 2014 (cropped).jpg|Geert Wilders - Party for Freedom (PVV) Frans Timmermans 2023.jpg|Frans Timmermans - GreenLeft (GL) - Labour Party (PvdA) Dilan Yeşilgöz-Zegerius, November 2022.jpg|Dilan Yesilgöz - People's Party for Freedom and Democracy (VVD) Pieter Omtzigt, De Balie, 2021.png|Pieter Omtzigt - New Social Contract (NSC) 220107Rob Jetten16 (cropped).jpg|Rob Jetten - Democrats 66 (D66) Caroline van der Plas.jpg|Caroline van der Plas - Farmer–Citizen Movement (BBB) Henri Bontenbal - AD 010-Verkiezingsdebat 2023 (cropped).jpg|Henri Bontenbal - Christian Democratic Appeal (CDA) Prinsjesdagprotest SP 20230917 133956 (cropped 3).jpg|Jimmy Dijk - Socialist Party (SP) Stephan van Baarle in 2021 (cropped).png|Stephan van Baarle - DENK Esther Ouwehand 2015-2.jpg|Esther Ouwehand - Party for the Animals (PvdD) Thierry Baudet 2020 (cropped).png|Thierry Baudet - Forum for Democracy (FVD) Chris Stoffer, 2023 (cropped).jpg|Chris Stoffer - Reformed Political Party (SGP) Portrait Mirjam Bikker 2023 (1) (cropped).jpg|Mirjam Bikker - ChristianUnion (CU) Laurens Dassen Volt 2019.jpg|Laurens Dassen - Volt Netherlands (Volt) Joost Eerdmans 2014.jpg|Joost Eerdmans - JA21 Parties represented only in the Senate. Martin van Rooijen met collega's.jpg|Martin van Rooijen - 50PLUS (50+) xxx.jpg|Auke van der Goot - Independent Politics the Netherlands (OPNL) == Related pages == * List of Dutch cabinets * House of Representatives (Netherlands) * Senate (Netherlands) == References == * www.parlement.com",
 "title": "Politics of the Netherlands"
}