{
 "id": "56961",
 "text": "Chinchillas are either of two species (Chinchilla chinchilla and Chinchilla lanigera) of rodents. They are most active at dawn and dusk. They are slightly larger and more active than ground squirrels, and are found in the Andes mountains in South America. They live in colonies called \"herds\" at high elevations of up to . Historically, chinchillas lived in an area that included parts of Bolivia, Peru, Argentina, and Chile, but today, colonies in the wild are known only in Chile. Along with their relatives, viscachas, they make up the family Chinchillidae. The chinchilla has the densest fur of all mammals that live on land. The chinchilla is named after the Chincha people of the Andes, who once wore its dense, velvet-like fur. By the end of the 19th century, chinchillas had become rare after being hunted for their soft fur. Most chinchillas currently used by the fur industry for clothing and other accessories are farm-raised. Domestic chinchillas come from C. lanigera are sometimes kept as pets. ==Chinchilla species== The two living species of chinchilla are Chinchilla chinchilla (formerly known as Chinchilla brevicaudata) and Chinchilla lanigera. C. chinchilla has a shorter tail, a thicker neck and shoulders, and shorter ears than C. lanigera. The C. chinchilla are currently facing extinction and the C. lanigera, though rare, can be found in the wild. Domesticated chinchillas are thought to be of the C. lanigera species. ==Habitat== Chinchillas lived in the coastal regions, hills, and mountains of Chile, Peru, Argentina and Bolivia. In 1914, there was a decrease in population where scientists believed they were close to extinction. Populations in Chile were thought extinct by 1953, but the animal was found to inhabit an area in the Antofagasta Region in the late 1900s and early 2000s. In their native habitats, chinchillas live in burrows or holes in rocks. They can jump up to . Their predators in the wild include birds of prey, skunks, felines, snakes and canines. Chinchillas have many defensive movements including spraying urine and releasing fur if bitten. In the wild, chinchillas have been observed eating plant leaves, fruits, seeds, and small insects. ===Groups=== In nature, chinchillas live in social groups that look like colonies, but are properly called herds. Herd sizes can have 14 members up to 100, this is both for social interaction as well as protection from predators. They can breed any time of the year. Their gestation period is 111 days, longer than most rodents. They can have long pregnancies, which is why chinchillas are born fully furred and with eyes open. Litters are usually small in number, usually two. ==Conservation== Both species of chinchilla are currently listed as Endangered by the IUCN Red List of Threatened Species because of large population loss roughly at a 90% global population loss over the last 15 years. The population decrease has been caused by chinchilla hunting by humans. Until 1996, they were listed as Indeterminate on the IUCN Red List. In 2006, the subspecies was listed as \"Vulnerable\" while the short- tailed subspecies was listed as \"Critically Endangered\". By 2008, both were listed as \"Critically Endangered\", and in 2016 they were reclassified as \"Endangered\" due to some recovery in some areas. ==Roles with humans== ===Fur industry=== Chinchilla fur trade on an international level goes back to the 16th century. Their fur is popular due because of its soft feel, which are mainly used in coats. A single, full-length coat made from chinchilla fur may require as many as 150 pelts, as chinchillas are relatively small.Alderton, David. Rodents of the World, 1996, page 20. Their use for fur led to the extinction of one species, and put serious pressure on the other two. Though it is illegal to hunt wild chinchillas, they are about to be extinct because of continued poaching. Domesticated chinchillas are still bred for fur.Chinchillas Endangered Species Handbook . Endangeredspecieshandbook.org. Retrieved on 2011-12-07. ===As pets=== The domestic chinchilla are related to the Chinchilla lanigera, the long-tailed Chinchilla, and the more common one in the wild after the other species, Chinchilla chinchilla, or short-tailed Chinchilla, has been hunted nearly to extinction. Domestic chinchillas have thinner bodies, longer tails and larger ears. Chinchillas are popular pets, though they need a large amount of exercise and dental care, because their teeth continually grow throughout their life span. Since they cannot sweat, they need a temperature-controlled environment as they can have heat strokes.Heat Stroke . Chin-chillas.com. Retrieved on 2011-12-07. The animals instinctively clean their fur by taking dust baths, in which they roll around in special dust made of pumice, a few times a week and they do not bathe in water. Their thick fur protects them from getting fleas, and reduces loose dander.Chinchillas: The keystone cops of rodents! . Petstation.com (1995-03-01). Retrieved on 2011-12-07. ===In scientific research=== Chinchillas have been used in research since the 1950s. Since the 1970s, the main interest in chinchillas by researchers is their auditory system. Other research fields in which chinchillas are used as an animal model include the study of Chagas disease, gastrointestinal diseases, pneumonia, and listeriosis, as well as of Yersinia and Pseudomonas infections. ==References== Category:Rodents Category:Mammals of South America",
 "title": "Chinchilla"
}