{
 "id": "5700",
 "text": "Katherine Noelle \"Katie\" Holmes (born December 18, 1978) is an American actress. She was born in Toledo, Ohio.Darren Crosdale. Dawson's Creek: The Official Companion. Kansas City, Missouri: Andrews McMeel, 1999. . 113–114. She was \"Joey\" on the WB network TV show Dawson's Creek.Ray Richmond. \"Youth ache 100 episodes: The WB's signature show, 'Dawson's Creek' brings intellect and frankness to the portrayal of young adults.\" The Hollywood Reporter. April 17, 2002. S1. Her mother's name is Katherine Ann Holmes == Early life == Holmes was born in Toledo, Ohio. She is the youngest of five children. Her mother, Kathleen, was a homemaker and philanthropist. Her father, Martin Joseph Holmes Sr., was an attorney who played basketball at Marquette University under coach Al McGuire. She has three sisters and one brother. Holmes was baptized a Catholic. She attended Christ the King Church in Toledo. ==Personal life== Katie Holmes dated her Dawson's Creek co-star Joshua Jackson early in the show's run. Katie Holmes met actor Chris Klein in 2000. Klein and Holmes were engaged in late 2003. In early 2005 she and Klein ended their relationship.\"Katie: Dating, Not Engaged.\" Toledo Blade. September 8, 2001. D3\"Katie Holmes to Wed Actor Chris Klein.\" Toledo Blade. December 31, 2003. D3 Weeks after her relationship with Chris Klein ended, Katie Holmes began dating actor Tom Cruise. She and Cruise married on November 18, 2006. On April 18, 2006 their daughter named Suri was born. In June 2012, Katie Holmes filed for divorce. This was the first divorce for Katie Holmes and the third for Cruise. ==Legal issues== In early March 2011, Katie Holmes filed a $50 million libel lawsuit against the Star. They had a cover story which made it seem that she took drugs. The suit was settled on April 27, 2011. The Star wrote a public apology in the May 6, 2011 issue. They also made a \"substantial\" donation to Katie's charity Dizzy Feet Foundation. ==Awards== In June 2011, Katie Holmes received the Women in Film Max Mara Face of the Future Award. ==Movies and television== Movie Year Title Role Notes 1997 Libbets Casey First professional role 1998 Disturbing Behavior Rachel Wagner MTV Movie Award for Best Breakthrough Performance Nominated–Saturn Award for Best Performance by a Younger Actor 1999 Go Claire Montgomery 1999 Teaching Mrs. Tingle Leigh Ann Watson First lead role Nominated - MTV Movie Award for Best Kiss Nominated - Teen Choice Award for Film - Choice Chemistry 2000 Wonder Boys Hannah Green 2000 Jessica King 2002 Abandon Katie Burke 2003 Phone Booth Pamela McFadden 2003 Nurse Mills 2003 Pieces of April April Burns Nominated - Satellite Award for Best Actress - Motion Picture 2004 First Daughter Samantha Mackenzie 2005 Batman Begins Rachel Dawes Nominated - Saturn Award for Best Supporting Actress Nominated - Golden Raspberry Award for Worst Supporting Actress 2005 Thank You for Smoking Heather Holloway 2008 Mad Money Jackie Truman 2010 Mary Powell 2010 Laura Liv Tyler was originally cast for this role. Katie Holmes, who was also the film's executive producer, replaced her. This is her first producing credit. 2011 Don't Be Afraid of the Dark Kim 2011 The Son of No One Kerry White 2011 Jack and Jill Erin Sadelstein Golden Raspberry Award for Worst Screen Couple/Ensemble Nominated - Golden Raspberry Award for Worst Supporting Actress Television Year Title Role Notes 1998 - 2003 Dawson's Creek Josephine \"Joey\" Lynn Potter Main Role; 128 episodes Nominated - Teen Choice Award for TV - Choice Actress (1999, 2000, 2001, 2002 & 2003) 2001 Saturday Night Live Host (Herself) Episode: \"Katie Holmes/Dave Matthews Band\" 2008 Eli Stone Grace Episode: \"Grace\" 2011 How I Met Your Mother Slutty Pumpkin (Naomi) Episode: \"The Slutty Pumpkin Returns\" 2011 The Kennedys Jackie Kennedy Miniseries ==References== == Other websites == * Category:1978 births Category:Living people Category:Actors from Toledo, Ohio Category:American movie actors Category:American television actors Category:Scientologists",
 "title": "Katie Holmes"
}