{
 "id": "570266",
 "text": "The Boston accent is a local accent of Eastern New England English. It is spoken specifically in the city of Boston, its suburbs, and much of eastern Massachusetts. Eastern New England English also traditionally includes New Hampshire and Maine.Bernd Kortmann; Edgar W Schneider, A Handbook of Varieties of English: A Multi-Media Reference Tool (Berlin; New York: Mouton de Gruyter, 2005), p. 270 The accent originated with the Puritans who came to the area from East Anglia in the 17th century. It was also influenced by 19th and 20th century immigrants from Ireland. This resulted in the distinct r-dropping (locally called \"wicked natural\") dialect found in modern costal Massachusetts. ==Non-rhoticity== The traditional Boston accent is non-rhotic, particularly in the early 1900s. Recent studies have shown that younger speakers tend to use more of a rhotic accent than older speakers from the Boston region. The Boston accent is pronounced with a “broad A”. The letter \"r\" is dropped only in certain words like 'car' and 'hard'. For example, a person might “pahk the cah in Hahvahd yahd.” == Lexicon == Some words used in the Boston area are: ;blinkers: turn signals on a car (also U.K., Australia and New Zealand).Boston To English Dictionary at CelebrateBoston.com The Massachusetts Department of Transportation has displayed signs reminding motorists to \"Use Yah Blinkah\", a phonetic representation of the phrase as spoken with a Boston accent. ;bubbler (or water bubbler): drinking fountain, pronounced \"bubblah\". This term is also used in Wisconsin and Australia. ;frappe: a beverage mixed with milk and ice cream, a.k.a. milkshake (in most other places), or if in Rhode Island (and especially if coffee flavored), called a \"cabinet\" ;Hoodsie: A small cup of ice cream, the kind that comes with a flat wooden spoon (from HP Hood, the dairy that sells them.) Also (very offensive slang), a teenage girl. Elsewhere occasionally known as a dixie cup. ;jimmies: Chocolate ice cream sprinkles Also common in the Philadelphia area. ;packie: liquor store (from \"package store\")Dictionary of American Regional English ;pissah: means something akin to \"great\" either realistically or sarcastically. Also spelled 'pissa'. This is from the word \"pisser\" with a Boston accent, but used as an adjective. Occasionally combined with \"wicked\" to yield \"wicked pissah\". ;rotary: traffic circle. These full-speed circular intersections are common in Greater Boston. ;wicked: Generally means \"very\" or \"super\" and is used as an adverb. \"That hockey game was wicked awesome!\" It can also be used to infer tones and moods, for example, \"Ugh, that guy is wicked slow.\" ;spa: A convenience store that has tonic on tap and (usually) sells sandwiches. ;tonic: soft drink; known elsewhere as sodaLabov et al., Atlas of North American English ;whiffle: a crew cut or male haircut done with electric clippers. == References == == Other websites == * Perfect Boston Accent; YouTube Category:American English Category:Pronunciation",
 "title": "Boston accent"
}