{
 "id": "570951",
 "text": "Guillermo Alberto Santiago Lasso Mendoza (born 16 November 1955) is an Ecuadorian businessman and politician. Lasso was the 47th President of Ecuador from 24 May 2021 until 23 November 2023. He was the presidential candidate for the 2013, 2017 and 2021 elections for the party Creating Opportunities.\"In that case the opposition should unite around a single candidate who, according to ARCOP, would be Guillermo Lasso, with 26% of voter preference in the same survey.\" Correa’s reelection is uncertain In 2013, he came in second place with 22.68% of votes. President Rafael Correa won with 57.17% of votes. In early 2017, he said that he would be running for president again. He would be against his former vice president Lenín Moreno and other candidates. In February 2017, both Lasso and Moreno made it to a run-off election on April 2, 2017. He lost the election with 49% of the vote. In 2020, Lasso announced his candidacy for the presidency again in the 2021 election. He came in second place, so he moved to the second round of the election in February 2021, against Andrés Arauz. He won the election in the April 2021 run-off. During his presidency, he helped create COVID-19 vaccination programs and economic relief forms. During his presidency there was also an increase of food and fuel prices. His economic policies caused a series of protests across the country. His administration has been criticized for the government's response to indigenous protests. Lasso's approval ratings have been very low during his presidency. ==Personal life== Lasso was born in Guayaquil, Ecuador's largest city. His parents were Enrique Lasso and Nora Mendoza. He studied Economics and graduated from the San José La Salle High School. In 1980, he married María de Lourdes Alcívar. They have five children. In August 2022, Lasso announced that he was diagnosed with melanoma near his eye and he was going to have surgery in the United States. The surgery was successful, and he returned to Quito for more treatment. ==Banking career== Lasso was the largest shareholder in Banco de Guayaquil. He was executive president for more than 20 years.Mark Weisbrot: Media can't ignore financial scandal in Ecuador's presidential election, TheHill, 24. March 2017 ==Political career== Lasso was Governor of the Guayas Province from 1998 through 1999. He was appointed by President Jamil Mahuad to be Superminister of Economy and Energy. He was in this role from August through September 1999. In 2003, President Lucio Gutiérrez hired Lasso to be an Ambassador for a few months In the 2013 presidential election, Lasso ran against then-President Rafael Correa. He lost the general election in a landslide. ===2017 presidential campaign=== In early 2017, Lasso announced his second presidential campaign to replace President Correa for Creating Opportunities in the 2017 presidential elections. His campaign's theme was to create 1 million more jobs in Ecuador.Guillermo Lasso inicia su campaña electoral visitando puerta a puerta a ciudadanos en Guayaquil , ecuadorinmediato.com, 2017-01-03 (Spanish) Lasso lost the election after winning 49% of the vote to Moreno's 51% of the vote.http://abcnews.go.com/International/wireStory/latest-ecuadoreans- choosing-president-close-race-46528194 === 2021 presidential campaign === In 2020, Lasso announced his third presidential campaign to replace his 2017 rival Lenin Moreno. He was at first seen as the front-runner but Rafael Correa-supporting candidate Andrés Arauz became his rival. In February 2021, Arauz won the majority of votes to go to the second round. Lasso came in second place beating Yaku Pérez Guartambel. Lasso then beat Arauz in the run- off in April. === Presidency === Lasso became Ecuador's 47th president on 24 May 2021. He became the country's first center-right president since Sixto Durán Ballén's presidency (1992-1996). His main focus for his first 100 days was to increase the country's vaccination rate during the COVID-19 pandemic in the country. In June 2022, a series of protests against Lasso's economic policies and raising fuel prices began, mainly led by indigenous Ecuadorians and students. In May 2023, the National Assembly officially began a second impeachment process against Lasso. On 17 May 2023, Lasso dissolved the National Assembly by forcing muerte cruzada. This is the first time an Ecuadorian president used this measure. Two days later, Lasso said he would not run for president in the 2023 election. On 15 October 2023, former National Assembly member and businessman Daniel Noboa was elected to replace Lasso. ==References== ==Other websites== *Guillermo Lasso's personal page *Biography by CIDOB (in Spanish) Category:1955 births Category:Living people Category:Businesspeople from Guayaquil Category:Presidents of Ecuador Category:Politicians from Guayaquil Category:Bankers Category:Political writers Category:Writers from Guayaquil Category:Ecuadorian activists",
 "title": "Guillermo Lasso"
}