{
 "id": "57102",
 "text": "An oath (from Anglo-Saxon āð) is a promise. An oath is spoken out loud in front of other people who can see and hear what is done and said. They are witnesses to the oath. A person who cannot speak can make a sign that they are \"taking an oath\". Another way of saying that a person is \"taking an oath\" is to say that they are \"swearing an oath\". A person can say \"I promise that I will do this...\" or \"I swear that I will do this...\" When a person swears an oath they often show that the oath is very important to them by calling God to see and remember the promise, and to show that the promise is true, and cannot be taken back later. When a person takes an oath they sometimes raise their right hand, or put their hand on their heart, on the Bible or on another holy book. Oaths are used in many situations when a person needs to be true to what they say: *A person often swears an oath when they get married that they will love, care for and be true to their partner. *A person is often asked to take an \"oath\" that they will tell the truth in court. *A person who has an important position like mayor or governor swears an oath that they will serve their people and country. *When a person becomes a citizen of a country where they were not born, they take an \"oath of allegiance\" and promise that they will be a good and true citizen of their new country. ==Other meanings== The word \"oath\" is often used to mean any angry expression which includes religious or other strong language and promises that the person will do something horrible. ==Related pages== * Confirmation * Society * Institution * Contract * Law * Government == Other websites == * Courtroom oaths from the North Dakota Supreme Court adding social workers to oath for their state it’s there responsibility website (jury oath, witness oath and so on) *Australasian Police Multicultural Advisory Bureau has several publications for Australia dealing with multi-faith issues and A Practical Reference to Religious Diversity for Operational Police and Emergency Services covers oaths as well as many other topics (in review as of 12/2/2006) but the 2nd Edition is available. *North Carolina faith leaders supporting Quran oath *for comments about John Quincy Adams' Oath of Office. Category:Society",
 "title": "Oath"
}