{
 "id": "57118",
 "text": "Miss America is an American beauty contest. It is an annual competition open to women from the United States between the ages of 18 and 28. Contestants are judged on talent and interviews in addition to their physical attractiveness. It is run by the Miss America Organization, a non-profit organization based in Linwood, New Jersey. The corporation has developed the \"Miss America Scholarship Program\", which awards educational scholarships to successful competitors. The contest began in Atlantic City, New Jersey in 1921. It was an idea of newspaper reporter, Harry Finley, to increase newspaper sales and to promote Atlantic City. The first competition had eight entrants. The entrants were selected by their local city newspapers and their prize was a holiday in Atlantic City, and to take part in the \"Intercity Beauty Contest\". This was held as part of the second annual Atlantic City Pageant. Margaret Gorman, \"Miss Washington D.C.\", a school girl from Washington D.C was selected by the Washington Herald. She won the \"Inter-City Beauty, Amateur\" and \"The Most Beautiful Bathing Girl in America\" contests. She was given the Golden Mermaid Trophy. Because these were awkward titles, in 1922 Gorman was renamed as \"Miss America\". == Winners == Year Miss America From 1921 Margaret Gorman Washington, D.C. 1922 Mary Campbell Columbus, Ohio 1923 Mary Campbell Columbus, Ohio 1924 Ruth Malcomson Philadelphia, Pennsylvania 1925 Fay Lanphier Oakland, California 1926 Norma Smallwood Tulsa, Oklahoma 1927 Lois Delander Joliet, Illinois 1932 Dorothy Hann Camden, New Jersey 1933 Marian Bergeron West Haven, Connecticut 1935 Henrietta Leaver Pittsburgh, Pennsylvania 1936 Rose Coyle Philadelphia, Pennsylvania 1937 Bette Cooper Bertrand Island, New Jersey 1938 Marilyn Meseke Marion, Ohio 1939 Patricia Donnelly Detroit, Michigan 1940 Frances Marie Burke Philadelphia, Pennsylvania 1941 Rosemary LaPlanche Los Angeles, California 1942 Jo-Carroll Dennison Tyler, Texas 1943 Jean Bartel Los Angeles, California 1944 Venus Ramey Washington, D.C. 1945 Bess Myerson New York, New York 1946 Marilyn Buferd Los Angeles, California 1947 Barbara Jo Walker Memphis, Tennessee 1948 BeBe Shopp Hopkins, Minnesota 1949 Jacque Mercer Litchfield Park, Arizona 1951 Yolande Betbeze Mobile, Alabama 1952 Colleen Kay Hutchins Salt Lake City, Utah 1953 Neva Jane Langley Macon, Georgia 1954 Evelyn Margaret Ay Ephrata, Pennsylvania 1955 Lee Meriwether San Francisco, California 1956 Sharon Ritchie Denver, Colorado 1957 Marian McKnight Manning, South Carolina 1958 Marilyn Van Derbur Denver, Colorado 1959 Mary Ann Mobley Brandon, Mississippi 1960 Lynda Lee Mead Natchez, Mississippi 1961 Nancy Fleming Montague, Michigan 1962 Maria Fletcher Asheville, North Carolina 1963 Jacquelyn Mayer Sandusky, Ohio 1964 Donna Axum El Dorado, Arkansas 1965 Vonda Kay Van Dyke Phoenix, Arizona 1966 Deborah Irene Bryant Overland Park, Kansas 1967 Jane Anne Jayroe Laverne, Oklahoma 1968 Debra Dene Barnes Moran, Kansas 1969 Judith Anne Ford Belvidere, Illinois 1970 Pamela Anne Eldred Birmingham, Michigan 1971 Phyllis Ann George Denton, Texas 1972 Laurie Lea Schaefer Columbus, Ohio 1973 Terry Anne Meeuwsen De Pere, Wisconsin 1974 Rebecca Ann King Denver, Colorado 1975 Shirley Cothran Fort Worth, Texas 1976 Tawny Elaine Godin Yonkers, New York 1977 Dorothy Kathleen Benham Edina, Minnesota 1978 Susan Perkins Columbus, Ohio 1979 Kylene Barker Galax, Virginia 1980 Cheryl Prewitt Ackerman, Mississippi 1981 Susan Powell Elk City, Oklahoma 1982 Elizabeth Ward Russellville, Arkansas 1983 Debra Maffett Anaheim, California 1984 Vanessa L. Williams Millwood, New York 1984 Suzette Charles Mays Landing, New Jersey 1985 Sharlene Wells Salt Lake City, Utah 1986 Susan Akin Meridian, Mississippi 1987 Kellye Cash Memphis, Tennessee 1988 Kaye Lani Rae Rafko Monroe, Michigan 1989 Gretchen Carlson Anoka, Minnesota 1990 Debbye Turner Mexico, Missouri 1991 Marjorie Judith Vincent Oak Park, Illinois 1992 Carolyn Suzanne Sapp Kona, Hawaii 1993 Leanza Cornett Jacksonville, Florida 1994 Kimberly Clarice Aiken Columbia, South Carolina 1995 Heather Whitestone Birmingham, Alabama 1996 Shawntel Smith Muldrow, Oklahoma 1997 Tara Dawn Holland Overland Park, Kansas 1998 Katherine Shindle Evanston, Illinois 1999 Nicole Johnson Roanoke, Virginia 2000 Heather French Augusta, Kentucky 2001 Angela Perez Baraquio Honolulu, Hawaii 2002 Katie Harman Gresham, Oregon 2003 Erika Harold Urbana, Illinois 2004 Ericka Dunlap Orlando, Florida 2005 Deidre Downs Birmingham, Alabama 2006 Jennifer Berry Tulsa, Oklahoma 2007 Lauren Nelson Lawton, Oklahoma 2008 Kirsten Haglund Farmington Hills, Michigan 2009 Katie Stam Seymour, Indiana 2010 Caressa Cameron Fredericksburg, Virginia 2011 Teresa Scanlan Gering, Nebraska 2012 Laura Kaeppeler Kenosha, Wisconsin 2013 Mallory Hagan Brooklyn, New York 2014 Nina Davuluri Fayetteville, New York 2015 Kira Kazantsev Bronx, New York 2016 Betty Cantrel Warner Robins, Georgia 2017 Savvy Shields Fayetteville, Arkansas 2018 Cara Mund Bismarck, North Dakota 2019 Nia Franklin Winston-Salem, North Carolina 2020 Camille Schrier Newtown, Pennsylvania 2021 colspan=2 2022 Emma Broyles Anchorage, Alaska ==References== == Other websites == * Official site Category:Lists of American people *",
 "title": "List of Miss America winners"
}