{
 "id": "571280",
 "text": "The arrondissement of Apt is an arrondissement of France, in the Vaucluse department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Apt. ==History== When the Vaucluse department was created on 1793, the arrondissement of Apt was part of that original department. In 1926, the subprefecture of Apt was moved to Cavaillon but returned to Apt in 1933. ==Geography== The arrondissement of Apt is in the most southern of the arrondissements of the Vaucluse department. It has the Alpes-de-Haute-Provence department to the east, the Var department to the southeast (for a very short distance), the Bouches-du-Rhône department to the south and west, the Avignon arrondissement to the northwest and the Carpentras arrondissement to the north. The arrondissement of Apt is the largest arrondissement of the department in area, , but the one with fewest people living in it (128,448 inhabitants) and a density of inhabitants/km². == Composition == === Cantons === After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Apt, only the Cheval-Blanc canton does not has all its communes in the arrondissement. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Apt INSEE Code Canton Apt Avignon Carpentras Total 8401 Apt 27 27 8407 Cavaillon 2 2 8408 Cheval-Blanc 12 2 14 8413 Pertuis 15 15 === Communes === The communes of the arrondissement of Apt are: # Ansouis (84002) # Apt (84003) # Auribeau (84006) # La Bastide-des-Jourdans (84009) # La Bastidonne (84010) # Beaumettes (84013) # Beaumont-de-Pertuis (84014) # Bonnieux (84020) # Buoux (84023) # Cabrières-d'Aigues (84024) # Cadenet (84026) # Caseneuve (84032) # Castellet (84033) # Caumont-sur-Durance (84034) # Cavaillon (84035) # Cheval-Blanc (84038) # Cucuron (84042) # Gargas (84047) # Gignac (84048) # Gordes (84050) # Goult (84051) # Grambois (84052) # Joucas (84057) # Lacoste (84058) # Lagarde-d'Apt (84060) # Lauris (84065) # Lioux (84066) # Lourmarin (84068) # Maubec (84071) # Ménerbes (84073) # Mérindol (84074) # Mirabeau (84076) # La Motte-d'Aigues (84084) # Murs (84085) # Oppède (84086) # Pertuis (84089) # Peypin-d'Aigues (84090) # Puget (84093) # Puyvert (84095) # Robion (84099) # Roussillon (84102) # Rustrel (84103) # Saignon (84105) # Saint-Martin-de- Castillon (84112) # Saint-Martin-de-la-Brasque (84113) # Saint-Pantaléon (84114) # Saint-Saturnin-lès-Apt (84118) # Sannes (84121) # Sivergues (84128) # Taillades (84131) # La Tour-d'Aigues (84133) # Vaugines (84140) # Viens (84144) # Villars (84145) # Villelaure (84147) # Vitrolles-en-Luberon (84151) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 84035 Cavaillon 26,201 Cavaillon Luberon Monts de Vaucluse 84089 Pertuis 19,523 Pertuis Métropole d'Aix-Marseille-Provence 84003 Apt 11,885 Apt Pays d'Apt-Luberon 84034 Caumont-sur-Durance 4,718 Cavaillon Grand Avignon (Coga) 84099 Robion 4,273 Cheval-Blanc Luberon Monts de Vaucluse 84133 La Tour-d'Aigues 4,190 Pertuis Territoriale Sud-Luberon 84026 Cadenet 4,136 Cheval-Blanc Les Portes du Luberon 84038 Cheval-Blanc 1,201 Cheval-Blanc Luberon Monts de Vaucluse 84065 Lauris 3,787 Cheval-Blanc Les Portes du Luberon 84147 Villelaure 3,323 Pertuis Territoriale Sud-Luberon == Related pages == * Arrondissements of the Vaucluse department * List of arrondissements of France == References == Apt",
 "title": "Arrondissement of Apt"
}