{
 "id": "571310",
 "text": "The arrondissement of Avignon is an arrondissement of France, in the Vaucluse department, Provence-Alpes-Côte d'Azur region. Its capital is the city of Avignon. ==History== When the Vaucluse department was created on 1793, the arrondissement of Avignon was part of that original department. ==Geography== The arrondissement of Avignon is in the northwest of the Vaucluse department. It includes the exclave of Valreás that is to the north of the department surrounded by the Drôme department. It has the Carpentras arrondissement to the east, the Apt arrondissement to the southeast, the Bouches-du-Rhône department to the south, the Gard department to the west, the Ardèche department to the northwest and the Drôme department to the north. The arrondissement of Avignon is the smallest arrondissement of the department in area, , but the one with more people living in it (296,303 inhabitants) and a density of inhabitants/km². == Composition == === Cantons === After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Avignon, the Cheval-Blanc, Le Pontet and Vaison-la-Romaine cantons do not have all their communes in the arrondissement. The following table shows the distribution of the \"communes\" in the cantons and arrondissements: Cantons and communes in the arrondissement of Avignon INSEE Code Canton Apt Avignon Carpentras Total 8402 Avignon-1 part of Avignon part of Avignon 8403 Avignon-2 part of Avignon part of Avignon 8404 Avignon-3 1 + part of Avignon 1 + part of Avignon 8405 Bollène 9 9 8408 Cheval-Blanc 12 2 14 8409 L'Isle-sur-la-Sorgue 5 5 8411 Orange 3 3 8414 Le Pontet 4 1 5 8415 Sorgues 5 5 8416 Vaison-la-Romaine 3 26 29 8417 Valréas 4 4 === Communes === The communes of the arrondissement of Avignon are: # Avignon (84007) # Bollène (84019) # Bédarrides (84016) # Cabrières-d'Avignon (84025) # Caderousse (84027) # Camaret-sur-Aigues (84029) # Châteauneuf-de-Gadagne (84036) # Châteauneuf-du-Pape (84037) # Courthézon (84039) # Fontaine-de-Vaucluse (84139) # Grillon (84053) # Jonquerettes (84055) # Jonquières (84056) # L'Isle-sur-la-Sorgue (84054) # Lagarde-Paréol (84061) # Lagnes (84062) # Lamotte-du-Rhône (84063) # Lapalud (84064) # Le Pontet (84092) # Le Thor (84132) # Mondragon (84078) # Morières-lès-Avignon (84081) # Mornas (84083) # Orange (84087) # Piolenc (84091) # Richerenches (84097) # Saint-Saturnin-lès- Avignon (84119) # Sainte-Cécile-les-Vignes (84106) # Saumane-de-Vaucluse (84124) # Sorgues (84129) # Sérignan-du-Comtat (84127) # Travaillan (84134) # Uchaux (84135) # Valréas (84138) # Vedène (84141) # Violès (84149) # Visan (84150) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 84007 Avignon 92,209 Avignon-1, Avignon-2 and Avignon-3 Grand Avignon (Coga) 84087 Orange 29,482 Orange Le Pays de Rhône et Ouvèze 84054 L'Isle-sur-la-Sorgue 19,240 L'Isle-sur-la-Sorgue Le Pays des Sorgues et des Monts de Vaucluse 84129 Sorgues 18,328 Sorgues Le Pays de Rhône et Ouvèze 84092 Le Pontet 17,476 Le Pontet Grand Avignon (Coga) 84019 Bollène 13,574 Bollène Rhône Lez Provence 84141 Vedène 11,045 Le Pontet Grand Avignon (Coga) 84138 Valréas 9,520 Valréas Enclave des Papes-Pays de Grignan 84132 Le Thor 8,706 L'Isle-sur-la-Sorgue Le Pays des Sorgues et des Monts de Vaucluse 84081 Morières-lès-Avignon 8,100 Avignon-3 Grand Avignon (Coga) == Related pages == *Arrondissements of the Vaucluse department *List of arrondissements of France == References == Avignon",
 "title": "Arrondissement of Avignon"
}