{
 "id": "571428",
 "text": "The Deputy Prime Minister (or DPM) is, when appointed, the second highest ranking executive officer of the government of the United Kingdom. He or she would be the deputy chief of the Cabinet. Unlike other countries, the position of Deputy Prime Minister is not always needed or appointed. The Prime Minister chooses whether or not they want to have a deputy. The position was created in 1942: Clement Attlee was the first Deputy Prime Minister. The present holder of this position is Angela Rayner since 5 July 2024. There have been times when the post has been very important. == List of deputy prime ministers == In addition to the many unofficial deputies, some people have been formally appointed deputy prime minister. Ministers are appointed by the monarch, on the advice of the prime minister. Six people can be described as definitely having been appointed deputy prime minister.Both Brazier and Norton include Clement Attlee in their lists. However, Hennessy says that Attlee's inclusion in the 1942 minute signed off by The King simply read \"Secretary of State for Dominion Affairs\" and that it was on separate paper that Winston Churchill wrote \"Deputy Prime Minister\". Bogdanor similarly asserts that the change was in form rather than fact and that Attlee was never formally appointed deputy prime minister.In his list of official deputy prime ministers, Brazier includes Geoffrey Howe. However, Norton doesn't in his. Norton explains that Buckingham Palace took issue with appointing Howe \"Deputy Prime Minister\" and proposed \"Sir Geoffrey will act as Deputy Prime Minister\". On the other hand, in a 1995 (rather than 2020) publication, Bogdanor asserts that no application to the Palace to appoint Howe deputy prime minister was made at all. Deputy prime ministers Deputy Prime Minister Deputy Prime Minister Deputy Prime Minister Term of office Term of office Party Ministry Michael Heseltine 1995 1997 * First Secretary of State Conservative Major II John Prescott 1997 2007 * Secretary of State for the Environment, Transport and the Regions * First Secretary of State Labour Blair I John Prescott 1997 2007 * Secretary of State for the Environment, Transport and the Regions * First Secretary of State Labour Blair II John Prescott 1997 2007 * Secretary of State for the Environment, Transport and the Regions * First Secretary of State Labour Blair III Vacant (2007 - 2010) Nick Clegg 2010 2015 * Lord President of the Council Liberal Democrat Cameron–Clegg Vacant (2015 - 2021) Dominic Raab 2021 2022 * Lord Chancellor * Secretary of State for Justice Conservative Johnson II Thérèse Coffey 2022 2022 * Secretary of State for Health and Social Care Truss Thérèse Coffey 2022 2022 * Secretary of State for Health and Social Care Truss Dominic Raab 2022 2023 * Lord Chancellor * Secretary of State for Justice Sunak Oliver Dowden 2023 2024 *Chancellor of the Duchy of Lancaster *Secretary of State in the Cabinet Office 120px Angela Rayner 2024 Incumbent * Secretary of State for Levelling Up, Housing and Communities * Labour Starmer ==References== Category:Lists of British politicians",
 "title": "Deputy Prime Minister of the United Kingdom"
}