{
 "id": "571656",
 "text": "El amor brujo (Translation \"Love, the Magician\") is a ballet in one act and two scenes of Manuel de Falla music. Choreography: Pastora Imperio. Libretto by Gregorio Martínez Sierra. First performance in Madrid, Spain, at the Teatro Lara April 15, 1915. It was written after the famous dancer Pastora Imperio expressed to him the desire to expand his repertoire with a new song and a dance. ==Plot== The story, told to the librettist's mother Pastora Imperio, is based on a popular legend. He stars a gypsy named Candela that has been abandoned recently by a man who believed he loved her. So she turns to a witch so that prepare a love potion to bring back her man from her; she goes to the lair of this witch, but finds it empty, so you sudden witch herself and the spell fails. The man who had betrayed her appears in the den of a sudden, he does not recognize the mistakes for the witch and he is afraid. Candela warns him that he had recently launched a curse on him that can be broken only by returning from its previous woman. The man, who has fear of the witch, promises that will do so, then recognizes Candela, but now the spell worked and he can no longer do without her now that he has in hand. ==Music== Falla, who draws profusely and with exquisite wisdom to the historical repertoire of Spanish music has given us one of his most beautiful pieces with its Amor Brujo, rich melodies and tempo changes; Although the story is very exciting and quite short, the music, the choreography and environments create a very gypsy and manage to transport the viewer completely. Many pieces of the De Falla Ballet were highly appreciated by pianists and became famous. One of them, \"The dance ritual del Fuego\" (Ritual Fire Dance), was the horse of battle of the composer. ==Discography== ===Chamber music version (1915)=== * 1991: Ginesa Ortega, Orchestra of the Teatre Lliure, Josep Pons - (Harmonia Mundi) ===Symphonic version=== * 1939: Josefina Burzio, NBC Symphony Orchestra, Arturo Toscanini - (Naxos Historical) * 1946: Carol Brice, Pittsburgh Symphony Orchestra, Fritz Reiner - (Columbia Masterworks) * 1953: Ana-Maria Iriarte, Orchestre de la Société des Concerts du Conservatoire, Ataúlfo Argenta - (EMI Classics) * 1955: Marina de Gabarain, Orchestre de la Suisse Romande, Ernest Ansermet - (Decca) * 1960: Shirley Verrett, Philadelphia Orchestra, Leopold Stokowski - (Sony Classical) * 1961 & 1964: Victoria de los Ángeles, Philharmonia Orchestra, Carlo Maria Giulini - (EMI Classics) * 1965: Grace Bumbry, Radio-Symphonie-Orchester Berlin, Lorin Maazel - (Deutsche Grammophon) * 1966: Nati Mistral, New Philharmonia Orchestra, Rafael Frühbeck de Burgos - (Decca) * 1978: Teresa Berganza, London Symphony Orchestra, Luis Antonio Garcia Navarro - (Deutsche Grammophon) * 1996: Esperanza Fernandez, Orquestra Simfònica de Barcelona, Edmon Colomer - (Valois Auvidis) Category:Classical music",
 "title": "El amor brujo"
}