{
 "id": "57183",
 "text": "Disc jockey (also called a DJ or deejay) is a person who plays recorded pop or dance music for dancers or listeners and introduces the names of the songs using a microphone. ==Types of DJs== There are several types of DJs. A radio DJ plays music files (like mp3) or recorded CDs on a radio station and announces the names of the songs. A club DJ plays music files or recorded CDs over a PA system (an amplifier and loudspeakers) at a nightclub, rave, or disco. A hip hop DJ uses turntables and vinyl records to do scratching and make music while other hip hop musicians do rapping (rhythmic type of singing). A Reggae DJ plays recordings of rhythm instruments and then rap on top of the prerecorded track with a microphone. A Electronic Dance Music DJ creates their own music and some can even remix their own songs on the fly. similar to different types of musicians in other genres like people who play baroque music Vs people who play Jazz or People who like Death Metal vs People who like Screamo, depending on the genre some DJs tend to act quite differently, for example, Dubstep DJs are more rowdy and prefer faster more zappy treble, While House producers are the opposite and prefer slower and more natural melodys and then you also have Psytrance DJs who prefer more techno driven white noise delivered in high beats per minute with whale songs and sound effects. ==History of DJing== The term \"disc jockey\" was ostensibly coined by radio gossip commentator Walter Winchell in 1935, and the phrase first appeared in print in a 1941 Variety magazine, used to describe radio personalities who introduced phonograph records on the air. Playing recorded music for dancing and parties rose with the mass marketing of home phonographs in the late 19th century. British radio disc jockey Jimmy Savile hosted his first live dance party in 1943 using a single turntable and a makeshift sound system. Four years later, Savile began using two turntables welded together to form a single DJ console. In 1947, the Whiskey A Go-Go opened in Paris as the first discotheque. In the 1960s, Rudy Bozak began making the first DJ mixers, mixing consoles specialized for DJing. In the late 1960s to early 1970s Jamaican sound system culture, producer and sound system operator (DJ), (Jamaican) King Tubby and producer Lee \"Scratch\" Perry were pioneers of the genre known as dub music. They experimented with tape-based composition; emphasized repetitive rhythmic structures (often stripped of their harmonic elements); electronically manipulated spatiality; sonically manipulated pre- recorded musical materials from mass media; and remixed music among other innovative techniques. It is widely known that the Jamaican dancehall culture has had and continues to have a significant impact on the American hip hop culture. Vintage DJ Station. A DJ mixer is placed between the two turntables. Pioneer DJ Controller DJ turntablism has origins in the invention of direct- drive turntables. Early belt-drive turntables were unsuitable for turntablism and mixing, since they had a slow start-up time, and they were prone to wear- and-tear and breakage, as the belt would break from backspinning or scratching. The first direct-drive turntable was invented by engineer at Matsushita (now Panasonic), based in Osaka, Japan. It eliminated belts, and instead employed a motor to directly drive a platter on which a vinyl record rests. In 1969, Matsushita released it as the SP-10, the first direct-drive turntable on the market, and the first in their influential Technics series of turntables. In 1972, Technics started making their SL-1200 turntable, which became the most popular turntable for DJs due to its high torque direct drive design. The SL-1200 had a rapid start and its durable direct drive enabled DJs to manipulate the platter, as with scratching techniques. Hip hop DJs began using the Technics SL-1200s as musical instruments to manipulate records with turntablism techniques such as scratching and beat juggling rather than merely mixing records. These techniques were developed in the 1970s by DJ Kool Herc, Grand Wizard Theodore, and Afrika Bambaataa, as they experimented with Technics direct-drive decks, finding that the motor would continue to spin at the correct RPM even if the DJ wiggled the record back and forth on the platter. Although Technics stopped producing the SL-1200 in 2010, they remain the most popular DJ turntable due to their high build quality and durability. In 1980, Japanese company Roland released the TR-808, an analog rhythm/drum machine, which has unique artificial sounds, such as its booming bass and sharp snare, and a metronome-like rhythm. Yellow Magic Orchestra's use of the instrument in 1980 influenced hip hop pioneer Afrika Bambaataa, after which the TR-808 would be widely adopted by hip hop DJs, with 808 sounds remaining central to hip hop music ever since. The Roland TB-303, a bass synthesizer released in 1981, had a similar impact on electronic dance music genres such as techno and house music, along with Roland's TR-808 and TR-909 drum machines. In 1982, the Compact Disc (CD) format was released, popularizing digital audio. In 1998, the first MP3 digital audio player, the Eiger Labs MPMan F10, was introduced. In January of that same year at the BeOS Developer Conference, N2IT demonstrated FinalScratch, the first digital DJ system to allow DJs control of MP3 files through special time-coded vinyl records or CDs. While it would take some time for this novel concept to catch on with the \"die-hard Vinyl DJs,\" this would become the first step in the Digital DJ revolution. Manufacturers joined with computer DJing pioneers to offer professional endorsements, the first being Professor Jam (a.k.a. William P. Rader), who went on to develop the industry's first dedicated computer DJ convention and learning program, the \"CPS (Computerized Performance System) DJ Summit\", to help spread the word about the advantages of this emerging technology. In 2001, Pioneer DJ began producing the CDJ-1000 CD player, making the use of digital music recordings with traditional DJ techniques practical for the first time. As the 2000s progressed, laptop computers became more powerful and affordable. DJ software, specialized DJ sound cards, and DJ controllers were developed for DJs to use laptops as a source of music rather than turntables or CDJs. In the 2010s, like laptops before them, tablet computers and smartphones became more powerful & affordable. DJ software was written to run on these more portable devices instead of laptops, although laptops remain the more common type of computer for DJing. ==References== ==Other websites== Category:Entertainment occupations",
 "title": "Disc jockey"
}