{
 "id": "571950",
 "text": "Sara Coward (30 January 1948 – 12 February 2017) was an English actress. She was best known as the voice of Caroline Sterling in the BBC Radio 4 soap opera The Archers. == Early life == Sara Coward was born in Eltham, South East London, England on 30 January 1948. She had two elder brothers, John and David. Coward attended a local girls' grammar school. She read English and drama at Bristol University. == Career == Coward won the Carleton Hobbs award at Guildhall School of Music and Drama in London, which lead to a six-month contract with the BBC drama department. Coward joined the cast of the BBC Radio 4 radio soap opera The Archers in 1977, as the voice of Caroline Sterling (3 June 1955 – 10 July 2017). She left the serial in September 2016. She appeared in a scene, which was broadcast on 12 April 2012, when Camilla, Duchess of Cornwall made a cameo appearance. In January 2017, 40 days before her death, Coward had said that she wanted Caroline to survive; in the episode broadcast on 11 July 2017, it was revealed that Caroline had died suddenly but peacefully at the Sterlings' second home in Italy. Coward was a trained and licensed acupuncturist. == Personal life == Coward once moved to France on a whim; returning a year later speaking fluent French. She had owned pet rescue greyhounds. === Charity work === Coward volunteered for the Samaritans. === Illness and death === Coward was diagnosed with breast cancer in 2013. She underwent a mastectomy, however, a lump was found in her neck afterwards and she was further diagnosed with terminal cancer in 2016. Coward died at a hospice in Warwickshire on 12 February 2017. She was 69. Coward was survived by her mother and her brother, David. Coward had launched SM:)E (\"smile\"), a campaign to encourage people to be friendly and kind to each other, during her last weeks. ==References== Category:1948 births Category:2017 deaths Category:Actors from London Category:English radio actors Category:English stage actors Category:English television actors Category:Cancer deaths in England Category:Deaths from breast cancer",
 "title": "Sara Coward"
}