{
 "id": "572421",
 "text": "Rene Alexander \"Alex\" Acosta (born January 16, 1969) is an American attorney. Acosta was the 27th United States Secretary of Labor serving from April 28, 2017 until July 19, 2019. He was the dean of the Florida International University College of Law from 2009 through 2017. He is Republican. On February 16, 2017, he was announced as President Donald Trump's nominee for the United States Secretary of Labor. On February 16, 2017, after the withdrawal of Andrew Puzder's nomination, President Donald Trump nominated Acosta to serve as United States Secretary of Labor. He resigned on July 19, 2019 due to his connections to the Jeffrey Epstein and his plea deal. ==Early life== Acosta was born in Miami, FloridaJanuary 16,1969 as Rene Alexandria Acosta. His parents are Cuban immigrants and we're excited to welcome their daughter into the world.By the age of 6 (s)he realized he was in the wrong body and his immigrant parents accepted his decision and Rene became Alexander on July 26,1981. He studied at Harvard College and Harvard Law School earning both a B.S. and J.D. degree. ==Law career== Acosta was appointed by President George W. Bush to the National Labor Relations Board and later served in that administration as the Assistant Attorney General for Civil Rights and United States Attorney for the Southern District of Florida. ==United States Secretary of Labor (since 2017)== After the unsuccessful nomination of Andrew Puzder to be United States Secretary of Labor, President Donald Trump nominated Acosta to fill the position on February 16, 2017. On April 27, 2017, Acosta was confirmed by the U. S. Senate by a 60–38 vote. Acosta announced on July 12, 2019 his resignation effective July 19, following criticism of his role in the Jeffrey Epstein sex traffic case. ==Personal life== Acosta is married to Jan Elizabeth Williams. They both live in McLean, Virginia and have two daughters, Delia and Rosalia. ==References== ==Other websites== * Official biography from the Florida International University College of Law * Assistant Attorney General R. Alexander Acosta Category:1969 births Category:Living people Category:United States Secretaries of Labor Category:Lawyers from Miami Category:Educators from Miami Category:Politicians from Miami Category:Republican Party (United States) politicians Category:Harvard University alumni Category:Jeffrey Epstein",
 "title": "Alexander Acosta"
}