{
 "id": "573150",
 "text": "The Lüscher color test is a psychological test invented by Dr. Max Lüscher in Basel, Switzerland. Lüscher believed that sensory perception of color is \"all shared by all\", but that color preferences are not. This difference allows subjective states to be objectively measured by using test colors.Relationship between the Luscher Color Test and the MMPI, Journal of Clinical Psychology Lüscher believed that because the color selections are guided in a specific manner, they reveal the person as they really are, not as they perceive themselves or would like to be perceived. ==How it works== Colors MeaningsHoss, Robert and Hoffman, Curtiss. Does Dream Color Reflect Emotion? A Long Term Journaling study (pdf), International ASD Psiber Dreaming Conference 2004, International Association for the Study of Dreams. Blue “Depth of Feeling” passive, concentric, tranquility, calm, tenderness Green “Elasticity of Will” passive, concentric, defensive, persistence, self-esteem/assertion, pride, control Red “Force of Will” ex-centric, active aggressive, competitive, action, desire, excitement, sexuality Yellow “Spontaneity” ex-centric, active, projective, aspiring, expectancy, exhilaration Violet “Identification” unrealistic/ wishful fulfillment, charm, enchantment Brown Bodily senses, indicates the body’s condition Black Nothingness, renunciation, surrender or relinquishment Grey Non-involvement and concealment ==More readings== *Adels G. H., Validation of the Luscher-Color-Test as a screening instrument for emotional disturbance in schoolchildren, Diss. Boston University 1978; * Braum C.M.J., Cross-cultural validity, reliability, and stimulus Personality Assessment, 1979, N.43, 5; * Holmes, C. B., Buchannan, J. A., Duncan, D. S., Reed, T. The Barnum effect in Lüscher Color Test interpretation. Journal of Clinical Psychology, 1986. 42, 133-136. * Klar H., Opium smokers and the psychological and emotional changes after smoking. Medico, Boehringer Mannheim, 1964, N. 1; *Klar H., Obesity in the Light of the Colour Test, Riv.Medico, Boehringer Mannheim, 1961, N.3; *Kopp M. S., Psychophysiological and Personality Characteristics of Juvenile Hypertensive and Duedenal Ulcer Patients, International Journal of Psychophysiology 2, 73-85,1984, Semmelweis University of Medicine POB 370 Budapest, ==References== ==Other websites== * Lüscher color test home page (multilingual including English) * ColorQuiz.com Personality Test Category:Tests",
 "title": "Lüscher color test"
}