{
 "id": "573997",
 "text": "The WWE Tag Team Championship, formerly known as the WWE SmackDown Tag Team Championship, is a professional wrestling tag team championship in WWE. It is wrestled for on the SmackDown brand since the return of the brand extension in 2016. From May 20, 2022 to April 6, 2024 it was defended as one with the WWE Raw Tag Team Championship as the Undisputed WWE Tag Team Championship. The first champions were Heath Slater and Rhyno. Right now the champions are The Street Profits (Angelo Dawkins and Montez Ford), who are in their second reign, both as a team and individually. They defeated #DIY (Johnny Gargano and Tommaso Ciampa) on the March 14, 2025, episode of SmackDown in Barcelona, Spain. == History == === Tournament to crown the first champions (2016) === With the return of the WWE Brand Extension in the middle of 2016, a draft took place in July 19. The WWE Tag Team Champions The New Day (Big E, Kofi Kingston and Xavier Woods) was drafted to Raw. As a result, SmackDown Live was left without a tag team title. On the August 23, 2016 episode of SmackDown Live, Shane McMahon introduced the SmackDown Tag Team Championship. A tournament was created for determined the first champions. The final match took place at Backlash on September 11, 2016, and Heath Slater and Rhyno beat The Usos (Jey and Jimmy Uso) to win the title. ==== Tournament bracket ==== † Chad Gable got injuryed after beating The Usos and American Alpha were removed from the final. The Usos then beat The Hype Bros at Backlash to replace American Alpha in the final. === Undisputed WWE Tag Team Championship (2022–2024) === On the May 20, 2022, episode of SmackDown, reigning SmackDown Tag Team Champions The Usos defeated Raw Tag Team Champions RK-Bro (Randy Orton and Riddle) in a Winners Take All match to win both championships and become recognized as the Undisputed WWE Tag Team Champions. WWE called the match as a championship unification match; however, both titles remained independently active. The Usos defended both titles together across both brands as the Undisputed WWE Tag Team Championship, but on a couple of occasions in early 2023, they also defended the titles separately. In the main event of WrestleMania 39 Night 1, The Usos defended the Undisputed WWE Tag Team Championship against the team of Kevin Owens and Sami Zayn. This subsequently made both the Raw and SmackDown titles the first tag team championships to be defended in the main event of WWE's biggest event, WrestleMania. At the event, Owens and Zayn defeated The Usos to become champions. The titles would again be defended in the main event of a pay-per-view and livestreaming event at Night of Champions the following month on May 27 when Owens and Zayn defeated The Bloodline (Roman Reigns and Solo Sikoa). At WrestleMania XL Night 1 on April 6, 2024, the Undisputed WWE Tag Team Championship was defended in a Six-Pack Tag Team Ladder match in which both sets of titles had to be retrieved to win. The titles were split as Austin Theory and Grayson Waller retrieved the SmackDown titles while The Awesome Truth (The Miz and R-Truth) retrieved the Raw titles. Thirteen days later on SmackDown, the championship was renamed to WWE Tag Team Championship and was also redesigned. == Reigns == == Combined reigns == As of , . === By team === † Is the current champion(s) Rank Team No. of reigns Combined days Combined days rec. by WWE 1 5 1,002 1,001 2 7 377 371 3 The Judgment Day 2 208 207 4 Kevin Owens and Sami Zayn 1 154 153 5 1 135 135 6 1 128 127 7 † 2 126 8 1 103 102 9 The Street Profits † 2 + + 10 A-Town Down Under 1 90 11 The Bloodline 1 84 1 84 83 1 14 Shinsuke Nakamura and Cesaro 1 82 15 and 1 68 16 The Mysterios 1 63 62 17 1 54 18 The Miz and John Morrison 1 50 19 The Motor City Machine Guns 1 42 20 1 23 21 1 21 20 and 1 21 21 23 and 1 9 24 1 3 2 === By wrestler === Rank Wrestler No. of reigns Combined days Combined days rec. by WWE 1 6 1,011 1,010 2 5 1,002 1,001 3 7 380 373 3 7 380 373 5 6 377 371 6 2 208 207 8 2 203 203 9 2 185 184 10 2 158 158 11 Kevin Owens 1 154 153 11 Sami Zayn 1 13 1 128 127 13 1 128 127 15 2 15 2 17 1 103 102 18 Angelo Dawkins † 2 + + 18 Montez Ford † 2 + + 20 1 90 22 1 84 1 84 83 1 1 1 27 1 82 28 2 71 29 1 68 30 1 63 1 63 62 33 1 54 35 1 50 50 36 1 42 38 1 23 40 1 21 20 1 21 20 1 21 1 44 1 9 == Notes == == References == == Other websites == * Official WWE Tag Team Title History Category:World Wrestling Entertainment championships Category:2016 establishments",
 "title": "WWE SmackDown Tag Team Championship"
}