{
 "id": "574201",
 "text": "Royal Rumble was a wrestling pay-per-view and livesteaming event made by WWE. It happened on January 29, 2017 at the Alamodome in San Antonio, Texas. It was the thirtieth Royal Rumble event, the second to take place at the Alamodome and the fourth to take place in Texas. Eight matches were performed at the event. The most important match was the Royal Rumble match. Randy Orton won it by last eliminating Roman Reigns for a world championship match at WrestleMania 33. This made Orton a two-time Royal Rumble match winner. Tye Dillinger also wrestled on WWE's main roster for the first time in the Royal Rumble match. John Cena beat WWE Champion AJ Styles in another important match that was for the title. That was the 13th time Cena won the title (which is a record) and the 16th time he won a world championship. That meant he tied Ric Flair's record as listed by WWE. ==Results== * On the pre-show, Becky Lynch, Nikki Bella and Naomi beat Alexa Bliss, Mickie James and Natalya in a six- women tag team match. * On the pre-show, Luke Gallows and Karl Anderson beat Cesaro and Sheamus (champions) in a tag team match with two referees for the WWE Raw Tag Team Championship. * On the pre-show, Nia Jax beat Sasha Banks. * Charlotte Flair (champion) beat Bayley for the WWE Raw Women's Championship. * Kevin Owens (champion) beat Roman Reigns in a No Disqualification match for the WWE Universal Championship where Chris Jericho was in a cage held above the ring. * Neville beat Rich Swann for the WWE Cruiserweight Championship. * John Cena beat AJ Styles for the WWE Championship * Randy Orton won the Royal Rumble by last eliminating Roman Reigns for a world championship match at WrestleMania 33. ===Royal Rumble match entrances and eliminations=== : – Raw : – SmackDown : – NXT : – Unassigned : – Winner Draw Entrant Brand Elimination Order Eliminated by Time Elimination(s) Raw Braun Strowman Raw Roman Reigns SmackDown Braun Strowman SmackDown Raw Mark Henry Raw Braun Strowman Raw Baron Corbin Raw The Undertaker Raw Braun Strowman NXT Braun Strowman SmackDown Braun Strowman SmackDown Brock Lesnar SmackDown The Undertaker Raw Cesaro SmackDown The Undertaker Raw Chris Jericho Raw Sheamus and Cesaro Raw Goldberg Raw Chris Jericho Raw Sheamus SmackDown Roman Reigns SmackDown Luke Harper SmackDown Winner SmackDown Brock Lesnar SmackDown Goldberg Raw Goldberg Raw Brock Lesnar Raw The Undertaker Unassigned Roman Reigns Raw Randy Orton == Footnotes == == References == == Other websites == *Official website Category:2017 in sports Category:Royal Rumble Category:Sports in San Antonio, Texas",
 "title": "Royal Rumble (2017)"
}