{
 "id": "57440",
 "text": "A figure of speech is an indirect way of communicating an idea. Many figures of speech are not meant to be understood exactly as they are said: they are not literal, factual statements. They use indirect language, and mean something different from ordinary language. Linguists call these figures of speech \"tropes\"—a play on words, using words in a way that is different from its accepted literal or normal form. DiYanni wrote: \"Rhetoricians have catalogued more than 250 different figures of speech, expressions or ways of using words in a nonliteral sense\".DiYanni, Robert Literature - reading fiction, poetry, drama and the essay. 2nd ed, McGraw-Hill, p451. Metaphors are very common examples. A common figure of speech is to say that someone \"threw down the gauntlet\". This does not mean that a person threw a protective wrist-covering down on the ground. Instead, it usually means that the person issued a public challenge to another person (or many persons). There is no one easy way to distinguish plain speech from figures of speech.Ortony, Andrew 1993. Metaphor and thought. Cambridge University Press, p204. == List of common figures of speech == * Allegory—A sustained metaphor in which a story is told to illustrate an important attribute of the subject. May be continued through whole sentences or even through a whole discourse. For example: \"The ship of state has sailed through rougher storms than the tempest of these lobbyists\". * Antithesis - Putting contrasting ideas in the same sentence with similar sentence structures * Alliteration—when a sentence or phrase has many words that start with the same sound. * Antanaclasis—Repeating a single word, but with a different meaning each time. Antanaclasis is a common type of pun, and like other kinds of pun, it is often found in slogans. * Aphorism—A tersely phrased statement of a truth or opinion, an adage * Euphemism—Substitution of a less offensive or more agreeable term for another * Hyperbole—Use of exaggerated terms for emphasis * Innuendo—Having a hidden meaning in a sentence that makes sense whether it is detected or not * Irony—Implying the opposite of the standard meaning, such as describing a bad situation as \"good times\". * Metonymy—A trope through proximity or correspondence, for example referring to actions of the U.S. president as \"actions of the White House\". * Metaphor—an explanation of an object or idea through juxtaposition of disparate things with a similar characteristic, such as describing a courageous person as having a \"heart of a lion\". * Paradox—Use of apparently contradictory ideas to point out some underlying truth * Proverb—Succinct or pithy expression of what is commonly observed and believed to be true * Pun—Play on words that will have two meanings * Rhetorical question—statement in the form of a question, asked and answered without a needed reply * Synecdoche—Related to metonymy and metaphor, creates a play on words by referring to something with a related concept. For example, referring to the whole with the name of a part, such as \"hired hands\" for workers; a part with the name of the whole, such as \"the law\" for police officers; the general with the specific, such as \"bread\" for food; the specific with the general, such as \"cat\" for a lion; or an object with the material it is made from, such as \"bricks and mortar\" for a building. * Truism—a self-evident statement == References ==",
 "title": "Figure of speech"
}