{
 "id": "574573",
 "text": "SummerSlam (2016) was a professional wrestling pay-per-view (PPV) and WWE Network livestreaming show made by WWE for the Raw and SmackDown brands. It took place on August 21, 2016 at the Barclays Center in Brooklyn, New York. It was the twenty-ninth SummerSlam event held by WWE, the second SummerSlam in a row to happen at the Barclays Center, and the first WWE PPV since the brand split started again. Twelve matches happened at the event, including three on the pre-show. In the most important match, Brock Lesnar beat Randy Orton by technical knockout while in another important match, Finn Bálor beat Seth Rollins to become the first Universal Champion. ==Background== ===Dean Ambrose vs. Dolph Ziggler=== This match was for the WWE World Championship. SmackDown wrestler and WWE World Champion Dean Ambrose put his title on the line in a Triple Threat match at Battleground on July 25 against Raw wrestlers Roman Reigns and Seth Rollins, who were Ambrose's partners in The Shield. Ambrose won the match, so SmackDown needed to find a challenger for him at SummerSlam and they had a six-pack challenge to find the challenger. The first five spots were given to John Cena, Bray Wyatt, AJ Styles, Baron Corbin and Dolph Ziggler. Apollo Crews took the sixth spot when he won a battle royal, but Ziggler won the six-pack challenge. ===Finn Bálor vs. Seth Rollins=== Because the WWE World Championship was on SmackDown, Raw had to create their own world championship. They called it the WWE Universal Championship. Raw commissioner Stephanie McMahon felt that Rollins had a chance to pin Ambrose at Battleground and bring the World Championship to Raw but Reigns was selfish and broke up the pin. Because of that, Stephanie gave Seth the first spot in the match to crown the champion. Then, Finn Bálor beat Cesaro, Kevin Owens and Rusev in a Fatal 4-way match and Reigns beat Chris Jericho, Sami Zayn and Sheamus in another Fatal 4-way. Finally, Bálor and Reigns fought in a singles match where the winner would face Rollins at SummerSlam and Bálor won this match. == Matches == == References == == Other websites == * Category:2016 in the United States Category:Professional wrestling Category:SummerSlam Category:2010s in New York (state)",
 "title": "SummerSlam (2016)"
}