{
 "id": "57473",
 "text": "William Felton Russell (February 12, 1934 - July 31, 2022) was an American basketball player who played the position center. Russell played for the Boston Celtics in the National Basketball Association (NBA) from 1956 to 1969. Russel has won 11 NBA championships during his 13 year career. He was born in Monroe, Louisiana. He was a civil rights activist. Russell was also an NBA coach. He coached the Celtics from 1966 to 1969, Seattle SuperSonics from 1973 to 1977 and the Sacramento Kings from 1987 to 1988. Russell won two NCAA titles in 1955 and 1956. He ended his college career with the University of San Francisco by winning his last 55 straight games and achieving an undefeated season in 1956. Before entering the NBA, Russell also earned an Olympic gold medal in 1956. The US team, led by Russell, was undefeated and won by an unsurpassed victory margin of 53.5 points per game Russell was named the NBA MVP five times during his career. He won 11 championships in 13 seasons as a player, the most in NBA history, including eight in a row from 1959 through 1966. During his NBA career, he made it to the championship round during 12 of his 13 seasons. President Barack Obama honored Russell with the Presidential Medal of Freedom at the White House in 2011. He was honored into the Naismith Memorial Basketball Hall of Fame twice, one in 1975 for his playing career and another in 2021 for his coaching career. Russell died on July 31, 2022 at his home in Mercer Island, Washington at the age of 88. ==References== Category:1934 births Category:2022 deaths Category:African- American basketball players Category:American basketball players Category:American civil rights activists Category:Boston Celtics players Category:Centers (basketball) Category:Naismith Memorial Basketball Hall of Fame inductees Category:National Basketball Association coaches Category:National Basketball Association players with retired numbers Category:Olympic gold medalists for the United States Category:Sportspeople from Louisiana",
 "title": "Bill Russell"
}