{
 "id": "574848",
 "text": "Anna Julia Haywood Cooper (August 10, 1858 – February 27, 1964) was an American author and educator. She was one of the most prominent African-American scholars in United States history. She was the fourth Black American woman to earn a Ph.D.\"Anna Julia Cooper | Columbia Celebrates Black History and Culture\". blackhistory.news.columbia.edu. Retrieved 2021-12-20. She was a mathematician and a Classics scholar. She fought for women's right to be educated and the strength the United States could build by educating Black women and men. == Early life == Cooper was born in 1859. She was born into slavery. Her mother was Hannah Stanley Haywood, a slave in the home of prominent landowner George Washington Haywood.Gines, Kathryn T. (2015), Zalta, Edward N. (ed.), \"Anna Julia Cooper\", The Stanford Encyclopedia of Philosophy (Summer 2015 ed.), Metaphysics Research Lab, Stanford University, retrieved 2021-12-20 She had two brothers, Rufus and Andrew.Antigone (2021-07-06). \"Antigone introduces Anna Julia Cooper, Mother of Black Classical Education\". Antigone. Retrieved 2021-12-20. Her grandfather was a carpenter that was sent to help build the capital of North Carolina. After the slaves were free Cooper’s brothers became good carpenters. Cooper was freed at the age of six. She then went to school. == Education == Cooper went to a school for Black children called St. Augustine. By the age of ten she was teaching math.\"Anna Julia Cooper | American educator and writer | Britannica\". www.britannica.com. Retrieved 2021-12-17. Cooper had to beg them to let her in the Greek class. It was only for boys. Cooper thought that it was unfair that due to her gender she was kept out of the Classical classes. Thankfully she did not give up and was able to “sit in” on the male Greek classes. Cooper felt frustrated that she had to fight to get the opportunity to study Classics. She wanted all students to be offered Greek. She kept fighting to make it equal. Eventually, the school provided Greek classes for male and female students. She stayed at St. Augustine for 14 years as a student and a teacher of Latin, Greek, and Math. In 1877 she married another teacher, George A.G. Cooper. He died two years later. After going to St. Augustine she went to the college Oberlin College in Ohio. Again, she could only take the women's courses. Classes for girls taught household skills. The classes for women did not require taking Latin, Greek or even advanced mathematics. Cooper asked to be in the men’s courses. She excelled at the full classical education at Oberlin. Cooper got her bachelors degree in Math in 1884. She earned her Master's Degree in 1887. In 1911 Cooper started working on her Ph.D. at Columbia University. Four years later her brother died. She took responsibility for raising his five grandchildren. She had to take a break from studying. In 1924 she started studying again, at the University of Paris in France. In 1925, at the age of 67, Cooper earned her Ph.D. Her doctoral thesis was: L'Attitude de la France à L'égard de l'Esclavage pendant La Révolution (Slavery and the French and Haitian Revolutionists). Her writing showed that slavery and bad treatment of Black peoples were a big part of revolutions in the France and Haiti. She was the fourth Black American woman to reach that level. ==Career== Cooper had a varied career. === Teaching === In 1887 she became part of the M Street High school faculty. She taught mathematics, science, and Latin. In 1902 she became the principal of M Street High School. When Cooper was Principle she enhanced the academic reputation, plus lots of her graduates entered Ivy leagued schools. The District of Columbia did not renew her contract. They did not think that Black students needed to be prepared to go to college. Cooper was not scared. After she continued her career by teaching in Lincoln University for four years. In 1910 Cooper was rehired by M Street High School. In 1930, Cooper retired from teaching to assume the presidency of Frelinghuysen University, a school for black adults. She served as the school’s registrar after it was reorganized into the Frelinghuysen Group of Schools for Colored People. Cooper remained in that position until the school closed in 1950. === Writing === A Voice from the South by a Black Woman of the South was Cooper's first book. She published it in 1892. She argued that women should be educated. She especially wanted Black women to be educated. Cooper's book made her a popular public speaker. She spoke to a wide variety of groups, which included the National Conference of Colored Women in 1895. She was also at the first Pan African Conference in 1900. In the 1890s Cooper was also involved in the black women's club. Middle class black women would help the less fortunate black women. At the age of 67 Cooper received her doctorate from Paris. ==Death== Cooper died at the age 105 in 1964. Anna J. Cooper was a fighter for what is right and hopefully her legacy reigns on. == References == Category:1858 births Category:1964 deaths Category:American centenarians Category:Educators from North Carolina Category:African-American writers Category:American essayists Category:American feminist writers Category:American historians Category:American scientists Category:American civil rights activists Category:Columbia University alumni Category:Educators from Washington, D.C. Category:Writers from Washington, D.C.",
 "title": "Anna J. Cooper"
}