{
 "id": "574950",
 "text": "The World Tamil Badminton Federation (WTBF) (Tamil: அகில உலக தமிழர் பூப்பந்தாட்ட பேரவை) is the international governing body of Badminton for the world Tamils. It conducts the annual international competition. The first ever tournament was held on 2013 in Switzerland. ==Tournament Winners== ===Men's Singles Open=== Year Host(s) Final venue Crowd Result Result Result Result Result First Second Third Fourth Fifth 2016 Berlin Unknown Viknesh Rajendran Score: Geoffray Devaraya Score: Piratheep Veluppillai Score: Jenath Kanagesan Score: Jenusanth Sriramanan Score: 2017 Toronto Unknown Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: ===Ladies Single Open=== Year Host(s) Final venue Crowd Result Result Result Result Result First Second Third Fourth Fifth 2016 Berlin Unknown Theepika Jeyarajah Score: Beyravi Jayalingam Score: Thiresha Jeyarajah Score: Sindu Jayalingam Score: Saranga Ampalavanesan Score: 2017 Toronto Unknown Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: ===Men's Doubles Open=== Year Host(s) Final venue Crowd Result Result Result Result Result First Second Third Fourth Fifth 2016 Berlin Unknown Geoffray Devaraya & Jenath Kanagesan Score: Gopiraj Sivasundram & Viknesh Rajendran Score: Thanjeevan Shanmugarajah & Piratheepan Uruthirasingam Score: Gajan Krishnadas & Dylan Daniel Score: Lokanathan Kunatheepan & Tharmathasan Nisanthan Score: 2017 Toronto Unknown Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: ===Ladies Double Open=== Year Host(s) Final venue Crowd Result Result Result Result Result First Second Third Fourth Fifth 2016 Berlin Unknown Beyravi Jayalingam & Sindu Jayalingam Score: Theepika Jeyarajah & Thiresha Jeyarajah Score: Saranga Ampalavanesan & Saranya Ampalavanesan Score: Amshana Satkunarajah & Kasthuri Thambiah Score: Renugadevi Anbarasan & Nilani Sivaraja Score: 2017 Toronto Unknown Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: Yet to be held Score: ==Victories by nationality (First Place, All Time)== Country Men's Open Women's Open Men's Doubles Open Women's Doubles Open Mixed Doubles Open Men's Single U12 Total 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 0 0 0 0 0 0 00 ==Related pages== * Tamil Eelam national football team ==References== ==Other websites== * Category:International sports organizations Category:Badminton Category:Tamils",
 "title": "World Tamil Badminton Federation"
}