{
 "id": "575117",
 "text": "Paco Rosendo Moncayo Galician (born 8 October 1940, in Quito) is an Ecuadorian politician and retired general who was a Metropolitan Mayor of Quito from 2000 to 2009. He was a National Deputy from 1998 to 2000 and was a member of both the National Security Council and its Consultative Assembly for Foreign Affairs. == Biography == He is the son of the lawyer/congressman Francisco Moncayo Altamirano and professor Aída Galician García, who was his wife. He was the Commander in Chief of the Army in the Alto Cenepa War between Ecuador and Perú. He is the only person in the history of Ecuador to complete 40 years of military life, 5 as a Cadet. Arriving finally of his military career afterwards of the conflict of the Cenepa and becoming one of the best soldiers of all Ecuador === Decorations === He has received decorations, national and international: * Order of Abdón Calderón of First Class (twice). * Order of Abdón Calderón of Third Class. * Condecoración Victorious of Tarqui as Commander. * Cruz of Military Honour. * Big Cross of Military Honour. * Condecoración Armed forces of Third Class. * Condecoración Armed forces of Second Class. * Condecoración Armed forces of First Class. * Cruz of Military Honour of the Republic of Brazil. * Cruz to the Military Merit Republic of Argentina. * Condecoración To the Military Merit of the Republic of Chile. * Condecoración Colonel Francisco Bolognesi of the Republic of Peru. * Order of Carabobo to the Military Merit Republic of Venezuela. * The Legion of Merit (Degree of commander) United States of America. * Big Necklace of the Armed of the Ecuador. * Cruz to the Merit of War in the degree of Big Cruz (by Ecuadorian victory in the High Cenepa). * Condecoración To the professional excellence awarded by the National Congress. * Condecoración Of the Academy of War of the Ecuador. * Big Necklace of Military Honour. == Political life == In the year 1995 he influenced the resignation of the vice-president Alberto Dahik. Similarly, he was a key element in the overthrowing of Abdalá Bucaram Ortiz in February of 1997, when he realized the danger of what was happening, he publicly declared \"...that the Armed Forces recognise like maximum authority to the only sovereign, the village of the Ecuador\". It asks that the disagreement be resolved peacefully. === Congress and City council === In 1998, he left the army and was elected National Deputy by the Democratic Left party, which was the leader of the block Socialdemócrata in the parliament. In March of 2000 the Democratic Left Party puts him as candidate for mayor of what was the “strongest Bastion of the party of the overthrown president Jamil Mahuad” (the one who before being elected president had been reelected mayor of Remove). In the elections of 21 May 2000 he confronted the successor of Mahuad, the economist Roque Seville. Moncayo confronted an antimilitarist campaign elaborated by sectors of the right and business. He attained an impressive majority in the elections defeating Seville with more than 60% of the votes. In the first four years of municipal administration, Moncayo made important works for the development of the capital, that motivated his reelection. Then Moncayo won with 57% strengthening as one of the most influential politicians of Ecuador. Paco Moncayo was Co-President of the World-wide Union of local Governments and Municipalidades (UCLG), that is an equivalent organism to the UN in which the members are not nations but cities. In the municipal government of Moncayo the city has adapted fast and satisfactorily. The coverage of basic service duplicated in five years. All the city has drinkable water and sewerage. The works in Vialidad that have made by the municipal government have improved the difficult situation of vehicular congestion. Big bridges, exchangers, steps depressed and other infrastructures have been put in operation to reduce the effects of the immoderate increase of the park railcar. Regarding urban regeneration the city is transformed. The historical centre has become a tourist destination beside works of importance to the long and width of the city like the TeleferiQo, the park Itchimbia, the museum Midalae, the Museum of the Water, the Museum of technology, the recovery and construction in process of the new international Airport of Remove and a lot of more important works have made the city an important place to visit. === Assemblyman 2009 - 2013 === The Thursday 29 January 2009, afterwards to take the decision of not running for a second reelection, renunciation to the City council and participates successfully in the elections of 26 April 2009 like candidate by the province of Pichincha to the National Assembly, representing to the Movement Municipalista that he same contrubuiría to create. Paco Moncayo considers a social democrat that believes in the universality and equity of rights. It served in the Commission of Autonomous Governments, Decentralisation, Competitions and Organisation of the Territory where jointly worked to attain that the Autonomous Governments Decentralised receive his part of the budget of the state of automatic way, just and effective. It was also a moderate figure inside the National Assembly, where worked duramente so that satisfied the Ethical Agreement- Political for the Law of Communication in December of the 2009. === Rest === In the legislative elections of Ecuador of 2013, Paco Montayo launched like candidate to asambleísta by the movement Split 25, but did not attain to achieve a curul. Afterwards of the elections ensured that it will keep on being part of Split. In December of 2013, Moncayo received direct criticisms by part of the president Rafael Correa afterwards that it showed against of the proposal of the president to reduce the size of the Armed forces of Ecuador. Correa aseveró that the same Moncayo had done him the same proposed years backwards, referring to the recent statements of the general with the terms: \"That is the human misfortune, the pequeñez of some politiquería\". Moncayo Denied the said by Correa days afterwards. === Presidential candidacy === On 24 September 2016, after a national convention of the party celebrated in the city of Remove, oficializó his candidature to the presidency of the Republic by the Democratic Left and the alliance of left centre National Agreement by the Change. The Tuesday 8 November announced in his personal account of Twitter that his candidate to the vicepresidencia would be a woman of the Coast, that was presented two days afterwards in an Assembly of the ANC, and resulted to be the guayaquileña Monserratt Bustamante, director of Institutional Planning and Development of the University Ecotec.PacoMoncayo (8 de noviembre de 2016).PacoMoncayo (10 de noviembre de 2016). In the elections of February of 2017, obtained the fourth place. == References == Category:1940 births Category:Mayors of Quito Category:Living people Category:South American military people Category:Ecuadorian economists Category:Ecuadorian academics",
 "title": "Paco Moncayo"
}