{
 "id": "57546",
 "text": "The Silk Road was a group of trade routes across Asia that connected China with the Mediterranean region. It allowed Chinese traders to exchange things with Middle Eastern and Mediterranean traders. The Silk Road was extremely important in world history. For the first time, people in different areas - and on different continents - could trade. The Silk Road was the first-ever connection between China, other parts of Asia, the Middle East, and Europe. == The silk trade == At the time, silk was only made in China, so it was extremely rare and expensive in Europe. For this reason, having silk was a sign of power, wealth, and importance for Europeans. Now, for the first time, it became much easier to get silk. The silk trade brought a lot of wealth to China - and also to cities and markets along the Silk Road (like Samarkand and Bukharal in modern-day Uzbekistan). Trade on the Silk Road also helped ancient cultures grow in China, Egypt, Mesopotamia, Persia, India, and Rome. A German geographer first called the route the Seidenstraße (\"The Silk Road\") in 1877.Waugh, Daniel 2007. Richthofen's \"Silk Roads\": toward the archaeology of a concept. The Silk Road. 5, #1. He chose this name because traders used it to bring silk from west to east. == Trade of other things == Of course, many other things were also traded, including: * Porcelain and other types of pottery * FoodsSome food, such as dates, figs and rice, can travel for long periods without being spoilt. * WineWine travelled in sealed jars. It does not go acid until air gets at it. * Spices * Paper (from China) * Metals and jewels * Slaves (most likely) * Ideas and knowledge * Silk (Fabrics) Traders also brought other things; for example, they brought chess pieces from northern India to China and Persia. Most likely, no trader traveled the entire Silk Road alone. Instead, they traded goods at every stopping point along the Road. They sometimes made deals to get past difficult places.Elisseeff, Vadime 2001. The Silk Roads: highways of culture and commerce. UNESCO Publishing / Berghahn Books. Boulnois, Luce 2005. Silk Road: monks, warriors & merchants. Hong Kong: Odyssey Books. == Path == === Land routes === Over land, the Silk Road started in northern China and traveled west. Then it split into two branches. One went north of the Tibetan Plateau, and the other trail went south of it. Then the two trails rejoined. After that, the Silk Road traveled in almost a straight line to the Mediterranean. It passed through mountain ranges in Tabriz (now in northern Iran) and the north tip of the Syrian Desert. From there, it traveled to the Levant (Syria, Israel, and Palestine). From the Levant, land routes traveled north (through the Byzantime Empire) and south (to northern Africa). === Sea routes === The Silk Road also had water routes. These were also called the \"Silk Road.\" In Asia, the over-water Silk Road connected: * South China * The Philippines * Brunei * Siam * Malacca * Ceylon * India * Pakistan * Iran In Europe and the Middle East, it connected: * Israel * Lebanon * Egypt * Greece * Balkans * Italy Past the Mediterranean Sea, the over-water routes continued to Portugal and Sweden. From there, goods were brought to places all over Europe. == Asian trades == From its beginnings (when Chinese people helped build it), the Silk Road was very important in Asia. People along the route exchanged ideas as well as goods. These included ideas about religion, science, technology, culture, and philosophy. The Buddhist religion and the Greco-Buddhist culture moved east on the Silk Road, reaching China around the second century BC. Trading also brought many arts, crafts, cultures, and foods to China. The Kushan Empire in northwest India was in the middle of the Silk Road's trade routes. This helped the Empire become more powerful and wealthier. It also helped the rise of the Mongol Empire, the largest land empire ever. The Roman Empire, which bought a lot of Chinese goods, began to fall from power in the West around the 5th century. In Central Asia, Islam expanded starting in the 7th century. Chinese growth westwards was ended at the Battle of Talas in 751 AD. Starting in the 10th century, trade also stopped from Central Asia because of the growth of the Islamic Turks. == Notes == == Other websites == * The history of the Silk Road by Oliver Wild * Introduction of the Silk Road from a Turkish tour guide * Old World Traditional Trade Routes Project * Photos of Silk Road China Sights Category:History of China Category:Trade routes Category:History of Asia Category:History of the Middle East Category:Economy of Africa",
 "title": "Silk Road"
}