{
 "id": "575449",
 "text": "Alojz Benac (Plehan, Derventa, October 20, 1914 – Sarajevo, March 6, 1992). was a Bosnia-Herzegovinian archaeologist and historian. He worked in the National Museum of Bosnia and Herzegovina from 1947 to 1967Lozny, Ludomir R (Ed.) Comparative Archaeologies: A Sociological View of the Science of the Past p.405 New York: Springer (in the role of Director from 1957 to 1967). He then left to assume a professorship in archaeology and ancient history in the Faculty of Philosophy of the University of SarajevoLozny, Ludomir R (Ed.) Comparative Archaeologies: A Sociological View of the Science of the Past p.407 New York: Springer (1968–78). He later became the founder and first Director of the Centre for Balkan Studies,Academy of Sciences and Arts of Bosnia and Herzegovina \"Centar za balkanološka ispitivanja\" (in Bosnian) within the Academy of Sciences and Arts of Bosnia and Herzegovina (ANUBiH),Lozny, Ludomir R (Ed.) Comparative Archaeologies: A Sociological View of the Science of the Past p.409 New York: Springer of which he was General Secretary from 1971 to 1977 and President from 1977 to 1981Academy of Sciences and Arts of Bosnia and Herzegovina \"Former Presidents\" Benac focused his research on prehistory within the Western Balkans,Lozny, Ludomir R (Ed.) Comparative Archaeologies: A Sociological View of the Science of the Past p.406 New York: Springer and undertook numerous systematic archaeological excavations on sites including Arnautovići (Visoko), Crvena Stijena (Montenegro), Hrustovača in Hrustovo (Sanski Most), Obre I and IIObre II – Neolitsko naselje butmirske grupe na Gornjem polju (1971) (Kakanj), Zecovi (Prijedor), Zelena PećinaCommission to Preserve National Monuments \"The archaeologial site of Zelena pećina\" , 21 November 2007 in Blagaj (Mostar) and others. ==Related pages== *List of scientists from Europe ==References== Category:1992 deaths Category:1914 births Category:Bosnia and Herzegovina writers Category:Bosnia and Herzegovina scientists",
 "title": "Alojz Benac"
}