{
 "id": "57549",
 "text": "Isis is a goddess in Egyptian mythology. She was known as the goddess of the moon. As the goddess of life and magic, Isis protected women and children, and healed the sick. Closely linked to the throne, she was one of the greatest goddesses of Ancient Egypt.Wilkinson, Richard H. 2003. The Complete Gods and Goddesses of Ancient Egypt. Thames & Hudson. ISBN 978-0-500-05120-7 Her symbols were the ankh, her wings, and her throne headdress. She was the sister and wife of Osiris. Isis and Osiris had a son named Horus. == How to say her name == The English pronunciation used, ), comes from the pronunciation of the Greek name, , which changed the Egyptian name by adding a final \"-s\" because of the grammatical requirements of Greek noun endings. The Egyptian name was recorded as or . It meant '(She of the Throne)'. However, the true Egyptian pronunciation is not known because their writing system left out vowels. Based on recent studies, the reconstructed pronunciation of her name is * (ooh- saht). Later, the name in Coptic dialects was \"Ēse\" or \"Ēsi\". To make it easier to say, Egyptologists choose to say the word as \"ee-set\". Sometimes they may also say \"ee-sa\". This is because the last \"t\" in her name was a feminine (female) suffix which is known to have been dropped in speech in the last stages of the Egyptian language Isis was perhaps the most important goddess of all Egyptian mythology. During the course of Egyptian history, Isis assumed the attributes and functions of virtually every other important goddess in the land. Her most important functions, however, were those of motherhood, marital devotion, healing the sick, and the working of magical spells and charms. She was believed to be the most powerful magician in the universe, because she had learned the Secret Name of Ra from the god himself. Isis was the sister and wife of Osiris, sister of Set, and twin sister of Nephthys. She was the mother of Horus the Child (Harpocrates), and was the protective goddess of Horus's son Amset, protector of the liver of the deceased. Isis was responsible for protecting Horus from Set during his infancy; for helping Osiris to return to life; and for assisting her husband to rule in the land of the Dead. Her cult seems to have originally centred, like her husband's, at Abydos near the Delta in the North (Lower Egypt). She was adopted into the family of Ra early in Egyptian history by the priests of Heliopolis. From the New Kingdom onwards (c. 1500 BC) her worship no longer had any particular identifiable centre, and she became more or less universally worshipped, as her husband was. == Powers == Isis had great powers such as: healing, protection, and magic. She could even cast spells on Ra. An example of her powers is when Isis brought Osiris back to life for one night. The powers were only strong enough to bring Osiris back for a single night. Isis is shown with a sun disk on her head. She also had a throne on her head to symbolize she was a queen. Sometimes Isis is called the egg of the goose because Geb is the father of Isis and goose represents him. == Worship of Isis == Many Egyptian gods and goddesses started in one place, or were the tutelary deity of one place all through their history. Many big cities and towns are known as the hometowns of their god or goddess. However, no local cities where Isis was worshipped have been found; all through her early history there are no known temples to her. Worship of Isis did not start until as late as the 30th dynasty; until that time Isis was worshipped in temples of other gods or goddesses. However, even in the 30th dynasty Isis was worshipped together with Horus and Osiris. Temples to Isis became common in the Roman times. There was a temple built to her at Philae. By this time, temples to Isis began to spread outside of Egypt. In many places her followers took over the worship to the Semitic goddess Astarte, because of the similarity of names. In the Hellenistic era, she also became the goddess who protected sailors. In all parts of the Graeco-Roman world, Isis became one of the most important figures of the \"mystery religions\", and many classical writers sometimes wrote about her temples, and followers. Temples to Isis were built in Iraq, Greece, Rome, even as far north as England where the remains of a temple were found at Hadrian's Wall. At Philae, she was worshipped until the 6th century, after the rise of Christianity. The fall of her temples is usually said to mark the end of ancient Egypt. == Priesthood == Little information on Egyptian priests of Isis has been found, but we know that there were both priests and priestesses of her followers all through her history. By the Graeco-Roman era, many of them were healers, and were said to have many other powers, including explaining dreams and the power to control the weather by braiding or combing their hair. == References == ==Other websites== * http://www.touregypt.net/godsofegypt/isis.htm * http://www.ancient-egypt.org * http://www.touregypt.net/isis.htm Category:Egyptian gods and goddesses Category:Gods and goddesses of agriculture",
 "title": "Isis"
}