{
 "id": "576113",
 "text": "The Music School Kosta Manojlovic is one of the largest schools in Serbia. It is located at 9 Nemanjina street in Zemun. Portal of music schools in Serbia , Retrieved 12 March 2017All music and ballet schools of Serbia , Retrieved 12 March 2017 Students and professors of this school have achieved outstanding successesGreat achievements of MS Manojlovic, Retrieved 12 March 2017 at many competitions in Serbia and abroad. These places the school at the very top of the music education in Serbia. == History == The school started its work on 1 September 1939, as a separate department of the Music School “Stanković” in Belgrade, in a three-room apartment in Svetosavska Street. In 1949 the school received the status of a regular six-year, gratuitous schools, and since 1954 bears the name of Kosta Manojlović.,Kosta Manojlovic (1890–1949) , Retrieved 12 March 2017 the famous Serbian composer, musicologist, founder and first rector of the Faculty of Music Faculty of Music in Belgrade , Retrieved 12 March 2017 in Belgrade. The School Day is celebrated on December 4. It is the day of birth of Kosta Manojlovic. == Education == :1. Pre-school education (which includes musical nursery, musical kindergarten and the preparatory preschool program) :2. Elementary music education (six years for the piano, the violin, the cello, the guitar, the accordion and the flute; four years for the clarinet, the oboe, the saxophone, the trumpet, the horn, the trombone and the double bass; two years for solo singing) :3. Secondary music education (two courses: vocal-instrumental and music production with sound processing) Teaching classes are organized in three separate locations – the main (parent) school, in the class for visually impaired children “Veljko Ramadanović” and elementary school “Lazar Savatić”. With around a thousand students and 145 teachers and non-teaching staff, the school is one of the largest in Serbia. Today, there are seven courses established in the school: the piano, string instruments, wind instruments, solo singing, the accordion, the guitar and a course for music production and audio recording. Around 3,000 students have completed elementary education and around 650 students secondary education so far. == Related pages == * Audio engineer ==References== == Other websites == * The official website of the Music School Kosta Manojlovic, Zemun, Retrieved 12 March 2017 * Music school Kosta Manojlovic, Zemun – School for tallented children, Retrieved 12 March 2017 * Gala Concert of Music School \"Kosta Manojlovic\", Retrieved 12 March 2017 * List of Music and Ballet Schools of Serbia , Retrieved 12 March 2017 * Music School Kosta Manojlović: Concerts played at School Day , Retrieved 12 March 2017 * Woodwind and Brass Instruments concert, Retrieved 12 March 2017 * Orchestra of the secondary Music School “Kosta Manojlovic” in Zemun (Serbia) , Retrieved 12 March 2017 Category:Music schools Category:Buildings and structures in Serbia",
 "title": "Music School Kosta Manojlović, Zemun"
}