{
 "id": "576218",
 "text": "BandNews TV is the first Brazilian 24-hour rolling news channel, owned by Grupo Bandeirantes. Its headquarters and newsroom are located in Sao Paulo. It was the second news channel launched in the Brazilian cable/satellite market. BandNews TV is popular with people who may not have time to watch, or wait for, lengthy news reports. The channel broadcasts live and updated 15-minute news wheels throughout most hours of the day. In these reports there are 12 minutes of news and 3 minutes for other news-based segments, such as sports, fashion and cinema. It also broadcasts Jornal da Band Monday-Saturday nights at 8:30, right after the original broadcast on Band. BandNews is the third most watched Brazilian news channel and it was also the first Brazilian HD news network. == Presenters == * Adriana Araújo * Andressa Guaraná * Cassius Zeilmann * Débora Alfano * Felipe Vieira * Gustavo Carvalho * Israel Goldstein * Jean Gorinchteyn * Juliana Rosa * Lenny Leone * Marco Antônio Sabino * Mônica Bergamo * Nelson Gomes * Patrícia Rocha * Paula Valdez * Pierpaolo Bottini * Regina Dourado * Sérgio Waib * Thaís Dias == Type of newscasts == Since the channel's launch, every single newscast is aired directly from the newsroom, which has a circle table for anchors to speak to the camera. == Programming == === Live news bulletins === * BandNews no Meio do Dia * Entre Nós * Expresso BandNews * Jornal BandNews: 1ª Edição * Jornal BandNews: 2ª Edição * Jornal BandNews: Edição da Noite * Jornal Gente * Manhã BandNews * Madrugada BandNews * O É da Coisa * Tarde BandNews * Fim de Semana BandNews === Magazines (can be recorded) === * Jornal da Band * Jornal da Noite * Canal Livre * Jornal Terraviva * Conexão com The New York Times * Economia Pra Você * Giro Business * Ponto a Ponto * Viver Melhor * Feiras $ Negocios * Capital Natural == News tickers == * 2011-2016: It was divided in 3 blocks: First is a small, long, oval, dark blue bar, which shows the news headlines; Second is a white bar, shows running news headlines; Third is (from left to right): Ibovespa updates, today's date, BandNews logo, the current time, Dollar updates. * 2016-?: The ticker is smaller. It has a small red box and a large blue box connecting to each other for news headlines the anchor speaks. Stick with them is a small white bar, providing short news. The time and date can now be seen at the upper left of the screen, and the logo is on upper right. Category:Television channels in South America",
 "title": "BandNews TV"
}