{
 "id": "576356",
 "text": "Jacques Bermon Webster II (born April 30, 1991), known by his professional name Travis Scott, is an American rapper, singer, songwriter, and record producer. His stage name comes from the first name of his uncle and the real first name of Kid Cudi. He started rapping in a hip hop duo called \"The Graduates\" with his friend Chris Holloway in 2008. In 2012, Scott signed his first major-label deal with Epic Records. In November of the same year, Scott signed a deal with Kanye West's GOOD Music, as part of its production wing Very GOOD Beats. In April 2013, Scott signed a record deal with T.I.'s Grand Hustle imprint. Scott's first full-length project, the mixtape Owl Pharaoh, was self-released in 2013. It was followed with a second mixtape, Days Before Rodeo, in August 2014. His first studio album, Rodeo (2015), was led by the hit single \"Antidote\". His second album, Birds in the Trap Sing McKnight (2016), became his first number one album on the Billboard 200. The following year, Scott released a collaborative album with Quavo titled Huncho Jack, Jack Huncho, under the group name Huncho Jack. In 2018, his highly anticipated Astroworld was released to widespread success by critics. It produced his first Billboard Hot 100 number one single \"Sicko Mode\". In late 2019, Scott's record label Cactus Jack Records released the compilation album JackBoys. It became the first number one album on the Billboard 200 of the 2020s. As of 2020, Scott has sold over 45 million certified records in the US alone. He has been nominated for six Grammy Awards and won a Billboard Music Award. On November 5, 2021, he was the main artist performing when the Astroworld Festival crowd crush occurred, where 8 people were killed during his performance. On July 28, 2023, his full length LP Utopia was released, mostly gathering general praise from critics and fans, as well as going double- platinum. ==Discography== ===Studio albums=== * Rodeo (2015) * Birds in the Trap Sing McKnight (2016) * Astroworld (2018) * Utopia (2023) ===Collaborative albums=== * Huncho Jack, Jack Huncho (2017) * JackBoys (2019) ===Mixtapes=== * Owl Pharaoh (2013) * Days Before Rodeo (2014) ==References== ==Other websites== * * * * Category:American pop rappers Category:1991 births Category:Living people Category:21st-century American rappers Category:21st- century American singer-songwriters Category:African-American rappers Category:Rappers from Texas Category:American hip hop singers Category:American hip hop record producers Category:Singers from Houston Category:Singer-songwriters from Texas",
 "title": "Travis Scott"
}