{
 "id": "57700",
 "text": "Neo-Nazism refers to the ideology of those who long for Nazism. Neo-Nazis tend to be antisemitic, xenophobic, homophobic and ultranationalist. Neo-Nazis like the symbols of Nazi Germany, like the swastika. Neo-Nazism has been linked to far-right political parties in England, such as the National Front and the British Nationalist Party linked to the skinhead subculture. ==Connections with other ideologies== ===Islamism=== ====1960s==== In the 1960s, Neo-Nazi groups partnered with Elijah Muhammad, then the leader of the influential American Islamist group Nation of Islam (NOI), due to their mutual support for racial separatism. * Washington Post, May 6, 1967, p. E-15, July 2, 1967, January 30, 1975, p. B7; Hakim Jamal, From the Dead Level, pp. 247–48; Louis Lomax To Kill a Black Man, pp. 108–09; Karl Evanzz, The Judas Factor, pp. 284–86, The Messenger, p. 303. * \"The Messenger Passes\", Time, March 10, 1975. * Evanzz, Karl, The Judas Factor, The Plot to Kill Malcolm X, pp. 205–206, Thunder's Mouth Press, NY, 1992; Marable, Manning, Along the Color Line , reprinted in the Columbus Free Press, January 17, 1997. * Rolinson, Mary, Grassroots Garveyism, p. 193, UNC Press Books, 2007. Elijah worked with the KKK to buy farmland in the Deep South with a view to building Black-only colonies, one of which was founded as the Temple Farms, now called the Muhammad Farms, in Terrel County, Georgia. In the following 10 years, Elijah received huge funding from White supremacist Texas oil baron H. L. Hunt, which was used by Elijah to build luxurious homes for his own family. George Lincoln Rockwell, American Nazi Party's founder, praised Elijah Muhammad as \"the Hitler of the Black man\". Prominent Black American activist Malcolm X was also an NOI member until March 8, 1964. Malcolm X had made a series of antisemitic speeches, * * * * * which promoted the The Protocols of the Elders of Zion among Ivy League-based academics and Black Americans. X accused Jews of being \"bloodsuckers [...] perfecting the modern evil of neocolonialism\". X also engaged in Holocaust denial by blaming Jews for having \"brought it upon themselves\", based on his distorted view of certain events. In 1961, X spoke at an NOI rally along with George Lincoln Rockwell, the leader of the American Nazi Party, who claimed that Black nationalism and White supremacy shared a common vision. ====1970s==== Elijah Muhammad passed away in 1975. Louis Farrakhan succeeded him as the leader of the NOI. * * * * * ====1980s==== In September 1984, former KKK member Tom Metzger donated $100 to Farrakhan's NOI after being impressed by his antisemitic rhetoric at a Los Angeles event. * * * * * The donation was followed by Metzger's gathering of 200 White supremacists to pledge support for Farrakhan's NOI. ====1990s==== In 1995, Farrakhan repeated the common Neo-Nazi Holocaust deniers' claim that the Jews caused the Holocaust themselves * * * * * * * * * * * by alleging that \"German Jews financed Hitler right here in America [...] International bankers financed Hitler and poor Jews died while big Jews were at the root of what you call the Holocaust\". In October, he mobilized 440,000 men to attend the Million Man March in Washington, D.C., the tenth-largest march in American history, when he called himself \"a prophet sent by God to show America its evil\". ====2000s==== David Duke, the former KKK leader, also has deep connections with Islamist groups, especially the Iranian regime. On December 11 – 13, 2006, Duke attended a Holocaust-denying conference in Iran upon invitation from the Iranian regime, when he repeated the common Islamist rhetoric of \"Zionists weaponizing the Holocaust to deny the rights of the Palestinians\" and engaged in Holocaust denial by claiming that \"[T]he Holocaust [...] is the pillar of Zionist imperialism, Zionist aggression, Zionist terror and Zionist murder.\" He was one of the 70 participants of the conference. ====2010s==== On September 11, 2012, Duke was interviewed by the Iranian state television Press TV, during which he alleged that \"the Jews created the 9/11 attack and Iraq War in the media, the government and international finance\". He repeated the claim in another Press TV interview in 2013, insisting that \"Jews' control of the U.S. is the world's greatest single problem\" – a claim made by Henry Ford in the 1920s and later adopted by Adolf Hitler to justify WWII and the Holocaust. * * * * * ====2020s==== In June 2024, Duke attended a pro-Palestine event along with radical traditionalist Catholics Nick Fuentes * * * * * and Jake Shields, * * * * * during which they preached to Muslim attendees about the following: * They and Muslims share the same fight against \"Jewish supremacy\" * The \"Jews plan to set up 'greater Israel' by war, revolution and subterfuge\" * The \"Jews are genociding Palestinians in Gaza just as they are genociding White people in America\" Meanwhile, Goyim Defense League (GDL), one of the most active KKK-allied American Neo-Nazi groups as of February 2025, which regularly denies the Holocaust and harasses American Jews by holding violent marches and dropping antisemitic flyers over Jewish neighborhoods, supports the Islamist groups Hamas, Houthis, Hezbollah and the Iranian regime. * * * * * The GDL celebrated the October 7 massacre in 2023 during a live episode: Then, GDL members attended pro-Palestine events to recruit new followers and adopted anti-Zionist rhetoric to expand their influence. While some critics expressed confusion over this, often due to the common perception that Neo-Nazis are anti-Muslim, it is not weird. Collaboration between Nazis and Islamists happened during the Holocaust * * * * * * * * * * and in post-war America, * * * * despite the lack of coverage in history textbooks. * * * * Just as the GDL, the Traditionalist Worker Party (TWP) – a Neo-Nazi party seeking to build a \"national socialist\" ethno-state for White people – endorsed the October 7 massacre by adopting the anti-Zionist Islamist rhetoric in their antisemitic propaganda: Meanwhile, the Neo-Nazi group National Socialist Front (NSF) Florida, also known as the Natsoc Florida, took a step further by selling T-shirts that featured Hamas paragliders and rifles alongside the slogan \"F*** Israel\" – a popular image among Islamists since October 7, 2023. ==Related pages== * Holocaust denial * Antisemitism in Europe ==Footnotes== ==References== Category:Politics Category:Nationalism Category:20th century Category:21st century Category:Antisemitism",
 "title": "Neo-Nazism"
}