{
 "id": "577161",
 "text": "Felicia Arlene O'Dell (May 7, 1957 – March 17, 2017) known popularly as Auntie Fee (pronounced as Ain't Fee), was an American YouTube personality and online cooking show star. She made videos in her kitchen, mostly with her son Tavis Hunter. She created more than 50 videos on her YouTube channel, titled 'Cooking With Auntie Fee.' Auntie Fee made appearances on Jimmy Kimmel Live!, The Steve Harvey Show and TMZ. She also had roles on the TV show Real Husbands of Hollywood and the movie Barbershop 3. O'Dell died from a heart attack in Los Angeles, California on March 17, 2017, aged 59. == Early and personal life == O'Dell was born in South Los Angeles. She had ten siblings. Her father was James O'Dell, a carpenter, plumber, and electrician. She says she learned how to cook by the age of nine, while preparing some of his favorite dishes, which included gumbo, hog's head cheese, and red beans and rice. But the relationship with her father was a difficult one. When she informed him that she was pregnant, at age 15, their relationship became worse. O'Dell attended John C. Fremont High School. She dropped out her senior year and developed a drug habit. She was then arrested for running drugs out of her home and served time in prison. One reports says she served just a \"few years\" in an Arkansas prison. Another source, quoting O'Dell herself, reports that she served 10 years of a 20-year prison sentence. She also said that she took the responsibility for a crime she didn't commit. After she was released from an Arkansas prison in 1992, O'Dell said she remained drug-free for the rest of her life. == YouTube and fame == O'Dell became an internet video viral sensation in July 2014. She showed her homemade cooking skills in a series of videos such as \"Sink Chicken\" and \"How to feed Seven people with just $3.35.\" She was known for making food and saying that it's \"for the kids.\" Her son, Tavis Hunter, helped her to shoot. He was also a sidekick. Auntie Fee had more than 330,000 followers on her Facebook page. She made promotional videos for the movies Dumb and Dumber To and Top Five. Auntie Fee took part in many interviews across television, such as appearing on Jimmy Kimmel Live!, The Steve Harvey Show and TMZ. She started a business of selling branded merchandise on her web site, such as dry seasoning, apparel, and other spices for cooking. She created more than 50 videos on her YouTube channel, titled \"Cooking With Auntie Fee\". She also had roles on the television show Real Husbands of Hollywood and the movie Barbershop 3. == Death == O'Dell fell sick with chest pains in her home on March 14, 2017, and a 911 call was made. Her son recorded her last moments on camera. While at Harbor-UCLA Medical Center, she suffered a massive heart attack and was placed on life support. Her son, Tavis Hunter, commented on her death, telling E! News in 2017: Her brother, Jude O'Dell, stated that his sister died at the hospital on March 18, 2017. She was 59 years old. Her funeral, which was live streamed on Facebook and open to the public, was held on April 1, 2017 at Paradise Baptist Church in Los Angeles. ==References== == Other websites == * YouTube channel Category:1957 births Category:2017 deaths Category:Deaths from myocardial infarction Category:American chefs Category:American YouTubers Category:Entertainers from Los Angeles",
 "title": "Auntie Fee"
}