{
 "id": "577477",
 "text": "Gas-operation is a system of operation used to provide energy to operate autoloading firearms. In gas operation, a portion of high-pressure gas from the cartridge being fired is used to power a mechanism to extract the spent case and insert a new cartridge into the chamber. Energy from the gas is harnessed through either a port in the barrel or a trap at the muzzle. This high-pressure gas impinges on a surface such as a piston head to provide motion for unlocking of the action, extraction of the spent case, ejection, cocking of the hammer or striker, chambering of a fresh cartridge, and locking of the action. == Long stroke == The AK-47 is the most-produced rifle using long stroke gas operation. == Short stroke == Used in the AR-18. == Direct impingement == Direct impingement is a form of gas operation that does away with the piston completely. The bolt is designed in such a way so that the gas acts directly upon the bolt (hence the name) to cycle the action. Used in the AR-15. == Fluted chamber direct impingement == Another form of direct impingement using a fluted chamber instead of a gas port. With this operation, the gas circumvents around the chambered cartridge through the grooves of the fluted chamber surpassing through the locking lugs to the front of the bolt carrier that operates as a gas piston unlocking the bolt to cycle the weapons operation. == Floating chamber == Early machine guns were expensive to operate. The United States Army wanted to train machine gun crews with less- expensive ammunition. To do this, they needed the .22 LR cartridge to operate firearms designed to use the .30-06 cartridge. David Marshall Williams invented a method that involved a separate floating chamber that acted as a gas piston with combustion gas impinging directly on the front of the floating chamber. The .22 caliber Colt Service Ace conversion kit for the .45 caliber M1911 pistol also used Williams' system, which allows a much heavier slide than other conversions operating on the unaugmented blowback mechanism and makes training with the converted pistol realistic. A floating chamber provides additional force to operate the heavier slide, providing a felt recoil level similar to that of a full power cartridge. == Gas delayed blowback == The bolt is not locked but is pushed rearward by the expanding propellant gases as in other blowback-based designs. However, propellant gases are vented from the barrel into a cylinder with a piston that delays the opening of the bolt. It is used by Volkssturmgewehr 1-5 rifle, the Heckler & Koch P7, Steyr GB and Walther CCP pistols. ==Other websites== *Fluted Chamber Direct Impingement Category:Firearms",
 "title": "Gas operation (firearms)"
}