{
 "id": "57782",
 "text": "This is a selected list of feature movies made by Metro-Goldwyn-Mayer. *A † signifies a PVOD realize. *A ‡ signifies a direct-to-video release or streaming release exclusively through Amazon Prime Video. *A § signifies a simultaneous release to theaters and on Amazon Prime Video. *A ‡ signifies a streaming release exclusively through MGM+. *A * signifies a streaming release through a third-party streaming service. == 1920s == * Greed (1924) (MGM's first feature-length movie) * He Who Gets Slapped (1924) (first movie featuring the MGM logo) * Ben-Hur (1925, plus remake in 1959) * The Big Parade (1925) * The Unholy Three (1925) * La bohème (1926) * Flesh and the Devil (1926) * The Scarlet Letter (1926) * Love (1927) * London After Midnight (1927) * The Wind (1928) * Our Dancing Daughters (1928, plus sequels, first movie featuring MGM's \"Jackie the Lion\") * Show People (1928) * The Crowd (1928) * The Viking (1928, first color feature with a soundtrack) * The Mysterious Island (1929) * The Broadway Melody (1929, plus several more movies in that series) * Hallelujah! (1929) * The Hollywood Revue of 1929 (1929) * Their Own Desire (1929) == 1930s == * Wizard of oz (1930) * The Divorcee (1930) * The Big House (1930) * Min and Bill (1930) * Good News (1930) * The Champ (1931, plus remake in 1979) * A Free Soul (1931) * Mata Hari (1931) * Grand Hotel (1932) * Tarzan the Ape Man (1932, plus sequels) * Freaks (1932) * Smilin' Through (1932) * Dancing Lady (1933) * Dinner at Eight (1933) * Queen Christina (1933) * The Barretts of Wimpole Street (1934, plus remake in 1956) * The Thin Man (1934, plus sequels) * The Merry Widow (1934) * Viva Villa! (1934) * The Cat and the Fiddle (1934, first movie featuring MGM's \"Tanner the Lion\") * Anna Karenina (1935) * A Night at the Opera (1935) * David Copperfield (1935) * Mutiny on the Bounty (1935, plus remake in 1962) * Naughty Marietta (1935) * Ah, Wilderness! (1935) * A Tale of Two Cities (1935) * Broadway Melody of 1936 (1935) * Romeo and Juliet (1936) * Rose-Marie (1936) * San Francisco (1936) * Camille (1936) * The Great Ziegfeld (1936) * Libeled Lady (1936) * Maytime (1937) * A Day at the Races (1937) * Broadway Melody of 1938 (1937) * Thoroughbreds Don't Cry (1937) * Captains Courageous (1937) * The Good Earth (1937) * Conquest (1937) * Rosalie (1937) * The Firefly (1937) * The Girl Of The Golden West (1938) * Test Pilot (1938) * Love Finds Andy Hardy (1938) * Everybody Sing (1938) * Listen, Darling (1938) * Sweethearts (1938) * Boys Town (1938) * Marie Antoinette (1938) * The Citadel (1938) * Babes in Arms (1939) * Gone With the Wind (1939, distribution only) (logo not shown) * The Wizard of Oz (1939) * Goodbye, Mr. Chips (1939, plus remake in 1969) * The Women (1939) * Ninotchka (1939, plus remake in 1957) * Broadway Serenade (1939) == 1940s == * The Shop Around the Corner (1940) * The Philadelphia Story (1940, plus remake in 1956) * The Mortal Storm (1940) * Boom Town (1940) * Waterloo Bridge (1940) * Pride and Prejudice (1940) * New Moon (1940) * Bitter Sweet (1940) * Andy Hardy Meets Debutante (1940) * Little Nellie Kelly (1940) * Strike Up The Band (1940) * Blossoms in the Dust (1941) * Ziegfeld Girl (1941) * Smilin' Through (1941) * Ziegfeld Girl (1941) * Life Begins For Andy Hardy (1941) * Babes on Broadway (1941) * The Mark on the Road (1942) (UK Distribution only) * Cairo (1942) * I Married An Angel (1942) * For Me and My Gal (1942) * Woman of the Year (1942) * Mrs. Miniver (1942) * Random Harvest (1942) * Madame Curie (1943) * Cabin in the Sky (1943) * A Guy Named Joe (1943) * Lassie Come Home (1943) * The Human Comedy (1943) * Gaslight (1944) * Meet Me in St. Louis (1944) * Thirty Seconds Over Tokyo (1944) * The White Cliffs of Dover (1944) * National Velvet (1944) * The Valley of Decision (1945) * Anchors Aweigh (1945) * The Harvey Girls (1946) * The Yearling (1946) * Ziegfeld Follies (1946) * Till the Clouds Roll By (1946) * The Postman Always Rings Twice (1946, plus Lorimar remake in 1981) * Lady in the Lake (1947) * The Pirate (1948) * Easter Parade (1948) * The Three Daring Daughters (1948) * The Barkleys of Broadway (1949, first movie for MGM's Silver Anniversary) * On the Town (1949) * Adam's Rib (1949) * Battleground (1949) * Little Women (1949) * The Sun Comes Up (1949, last movie for MGM's Silver Anniversary) == 1950s == * King Solomon's Mines (1950) * Annie Get Your Gun (1950) * Summer Stock (1950) * Father of the Bride (1950, plus 1951 sequel) * The Red Badge of Courage (1951) * Show Boat (1951) * An American in Paris (1951) * Angels in the Outfield (1951) * Quo Vadis (1951) * The Great Caruso (1951) * Singin' in the Rain (1952) * The Bad and the Beautiful (1952) * Ivanhoe (1952) * The Band Wagon (1953) * Kiss Me, Kate (1953) * Knights of the Round Table (1953) * Julius Caesar (1953) * Mogambo (1953) * Seven Brides for Seven Brothers (1954) * The Student Prince (1954) * Brigadoon (1954) * Rhapsody (1954) * The Last Time I Saw Paris (1954) * The Long, Long Trailer (1954, co-production with Desilu Productions) * Blackboard Jungle (1955) * Hit the Deck (1955) * I'll Cry Tomorrow (1955, last movie featuring MGM's \"Jackie the Lion\") * Interrupted Melody (1955) * The Prodigal (1955) * Love Me or Leave Me (1955) * Kismet (1955) * The Adventures of Quentin Durward (1955) * Forbidden Planet (1956, last movie featuring MGM's \"Tanner the Lion\") * Jailhouse Rock (1957, first movie featuring MGM's current lion) * Raintree County (1957) * Cat on a Hot Tin Roof (1958) * Gigi (1958) * The Brothers Karamazov (1958) * Ben-Hur (1959) * North by Northwest (1959) == 1960s == * Butterfield 8 (1960) * Where the Boys Are (1960) * Cimarron (1960) * The Last Voyage (1960) * King of Kings (1961) * How the West Was Won (1962) * Four Horsemen of the Apocalypse (1962) * The Courtship of Eddie's Father (1963) * The Haunting (1963) * Viva Las Vegas (1964) * The Americanization of Emily (1964) * The Unsinkable Molly Brown (1964) * The Cincinnati Kid (1965) * Doctor Zhivago (1965) * Blow-Up (1966) * Grand Prix (1966) * The Glass Bottom Boat (1966) * Point Blank (1967) * The Dirty Dozen (1967) * 2001: A Space Odyssey (1968) * Ice Station Zebra (1968) * Where Eagles Dare (1968) * The Green Slime (1968) == 1970s == * Ryan's Daughter (1970) * The Phantom Tollbooth (1970) * Shaft (1971) * Travels With My Aunt (1972) * Soylent Green (1973) * Westworld (1973) * That's Entertainment! (1974, plus sequels) * The Wind and the Lion (1975, with Columbia Pictures) * The Sunshine Boys (1975) * Logan's Run (1976) * That's Entertainment, Part II (1976) * Network (1976) * The Goodbye Girl (1977, with Warner Bros.) * International Velvet (1978) * Corvette Summer (1978) *Bianca Lady(1979)Banned in 1993. == 1980s == * Pennies From Heaven (1981) * Clash of the Titans (1981) * Diner (1982) * Pink Floyd The Wall (1982) * Victor/Victoria (1982) * Rocky III (1982) * Poltergeist (1982) * A Christmas Story (1983) (company known as MGM/UA Entertainment Co.) * WarGames (1983) * Octopussy (1983) * The Hunger (1983) * You Can Do It (1984) (company known as MGM/UA Entertainment Co.) * Have I Got a Story For You (1984) (company known as MGM/UA Entertainment Co.) * Kooky Classics (1984) (company known as MGM/UA Entertainment Co.) * 2010: The Year We Make Contact (1984) * Rocky IV (1985) * A View to a Kill (1985) (company known as MGM/UA Entertainment Co.) * Poltergeist II: The Other Side (1986) * Spaceballs (1987) * Hollywood Shuffle (1987) (company reverted to Metro-Goldwyn-Mayer) * Moonstruck (1987) * The Living Daylights (1987) * Overboard (1987) * A Fish Called Wanda (1988) * Poltergeist III (1988) * Rain Man (1988) * All Dogs Go to Heaven (1989) * For Queen and Country (1989) * The Mighty Quinn (1989) * Licence to Kill (1989) * A Dry White Season (1989) == 1990s == * The Russia House (1990) * Misery (1990, video distribution only) (co-production with Nelson Entertainment, Castle Rock Entertainment and Columbia Pictures) * Shattered (1991) * Thelma & Louise (1991) * The Cutting Edge (1992) * Benny & Joon (1993) * Stargate (1994) * Get Shorty (1995) * Showgirls (1995) * The Pebble and the Penguin (1995) (USA distribution only) (co-production with Don Bluth) * GoldenEye (1995) * All Dogs Go to Heaven 2 (1996) * Tomorrow Never Dies (1997) * Zeus and Roxanne (1997) (co-production with Rysher Entertainment) * Ronin (1998) * The World Is Not Enough (1999) (last MGM movie internationally distributed by United International Pictures) == 2000s == * Original Sin (2001, with Hyde Park Entertainment) (first MGM movie internationally distributed by 20th Century Fox) * Antitrust (2001, with Hyde Park Entertainment) * Hannibal (2001, with Universal Pictures) * Vampire Hunter D: Bloodlust (2001, with Urban Vision Entertainment) * Legally Blonde (2001, plus sequel in 2003) * Bandits (2001) (co-production with Hyde Park Entertainment) * Barbershop (2002) * Die Another Day (2002) * Agent Cody Banks (2003, plus sequel in 2004) * Sakura Wars: The Movie (2003, with Geneon Entertainment) * De-Lovely (2004) * Agent Cody Banks 2 (2004) * Walking Tall (2004) * Swimming Upstream (2005) * Be Cool (2005) * Beauty Shop (2005) * The Brothers Grimm (2005) (co-production with Dimension Films) * Into the Blue (2005) (co-production with Columbia Pictures) * Night Moves (2005) (co- production with Touchstone Pictures) * Yours, Mine and Ours (2005) (co- production with Paramount Pictures, Nickelodeon Movies, and Columbia Pictures) * The Amityville Horror (2005) (co-production with Dimension Films, Platinum Dunes and Radar Pictures) * My Favorite Knight (2006) * Dark Angel (2006, co- production with Dimension Films) * The Pink Panther (2006) (production only; distributed by Columbia Pictures) * Basic Instinct 2 (2006) (co-production with Intermedia Films and C2 Pictures) * Two Friends and a Bandits (2006) * Staggle 2 (2006, co-production with Miramax Films) * Lucky Number Slevin (2006, USA distribution only) (produced by The Weinstein Company) * Stormbreaker (2006, USA distribution only) (produced by The Weinstein Company and Isle of Man movie) * Casino Royale (2006) (co-production with Columbia Pictures) * Material Girls (2006) * Rocky Balboa (2006) (co-production with Columbia Pictures and Revolution Studios) * Clerks II (2006) (USA theatrical distribution only, produced by The Weinstein Company) * Flyboys (2006) * School For Scoundrels (2006, with Dimension Films) (Produced by The Weinstein Company) * Breaking and Entering (2006) (co-production with Miramax Films produced by The Weinstein Company) * Premonition (2007) (co-production with TriStar Pictures and Hyde Park Entertainment) * Principal Parkinson's Opus (2007) (produced by Hyde Park Entertainment) ==2010s== Release date Title co- production distributor Notes March 26, 2010 Hot Tub Time Machine United Artists and New Crime Productions MGM (North America) Lakeshore International (International) July 8, 2011 Zookeeper Columbia Pictures, Happy Madison Productions and Broken Road Productions Sony Pictures Releasing December 20, 2011 The Girl with the Dragon Tattoo Columbia Pictures, Scott Rudin Productions and Yellow Bird Sony Pictures Releasing April 13, 2012 The Cabin in the Woods Lionsgate and Mutant Enemy Productions Lionsgate uncredited August 8, 2012 Hope Springs Columbia Pictures, Mandate Pictures, Film 360, Escape Artists Sony Pictures Releasing distribution only November 9, 2012 Skyfall Columbia Pictures and Eon Productions MGM (digital, home entertainment and television rights) Sony Pictures Releasing (theatrical rights) December 14, 2012 The Hobbit: An Unexpected Journey New Line Cinema and WingNut Films Warner Bros. January 25, 2013 Hansel & Gretel: Witch Hunters Paramount Pictures, MTV Films, Gary Sanchez Productions and Babelsberg Studio Paramount Pictures March 28, 2013 G.I. Joe: Retaliation Paramount Pictures, Skydance Media, Hasbro Studios and Di Bonaventura Pictures Paramount Pictures October 18, 2013 Carrie Screen Gems and Misher Films Sony Pictures Releasing December 13, 2013 The Hobbit: The Desolation of Smaug New Line Cinema and WingNut Films Warner Bros. July 25, 2014 Hercules Paramount Pictures, Flynn Picture Company and Radical Studios Paramount Pictures August 22, 2014 If I Stay New Line Cinema and Di Novi Pictures Warner Bros. December 17, 2014 The Hobbit: The Battle of the Five Armies New Line Cinema and WingNut Films Warner Bros. February 20, 2015 Hot Tub Time Machine 2 Paramount Pictures and Panay Films Paramount Pictures May 8, 2015 Hot Pursuit New Line Cinema and Pacific Standard Warner Bros. May 22, 2015 Poltergeist 20th Century Fox, Ghost House Pictures, TSG Entertainment and Vertigo Entertainment 20th Century Fox June 26, 2015 Max Warner Bros. and Sunswept Entertainment Warner Bros. November 6, 2015 Spectre Columbia Pictures and Eon Productions MGM (digital, home entertainment and television rights) Sony Pictures Releasing (theatrical rights) November 25, 2015 Creed Warner Bros., New Line Cinema and Chartoff-Winkler Productions Warner Bros. February 12, 2016 How to Be Single New Line Cinema, RatPac Entertainment and Flower Films Warner Bros. April 15, 2016 Barbershop: The Next Cut New Line Cinema and Cubevision Warner Bros. June 3, 2016 Me Before You New Line Cinema and Sunswept Entertainment Warner Bros. August 19, 2016 Ben-Hur Paramount Pictures, Lightworkers Media and Sean Daniel Company Paramount Pictures September 23, 2016 The Magnificent Seven Columbia Pictures, Village Roadshow Pictures, LStar Capital, Escape Artists and Pin High Productions Sony Pictures Releasing May 19, 2017 Everything, Everything Warner Bros. and Alloy Entertainment Warner Bros. March 2, 2018 Death Wish with Scott Free Mirror as MGM March 16, 2018 Tomb Raider with Warner Bros. Pictures and GK Films Warner Bros. March 23, 2018 Sherlock Gnomes Paramount Animation and Rocket Pictures Paramount Pictures May 4, 2018 Overboard co-production with Lionsgate, Pantelion Films and 3Pas Studios Lionsgate August 29, 2018 Operation Finale with Automatik Entertainment, Mirror as MGM in North America, Netflix in international countries October 5, 2018 A Star Is Born Warner Bros., Joint Effort, Gerber Pictures, Peters Entertainment and Live Nation Entertainment Warner Bros. co-financing only November 9, 2018 The Girl in the Spider's Web co-production with Columbia Pictures, Scott Rudin Productions, Yellow Bird, The Cantillon Company, and Pascal Pictures Sony Pictures Releasing November 21, 2018 Creed II Warner Bros. and Chartoff-Winkler Productions Warner Bros. Pictures February 14, 2019 Fighting with My Family co-production with Film4, Misher Films, Seven Bucks Productions and WWE Studios Mirror as MGM (United States), Lionsgate (UK and Ireland), May 10, 2019 The Hustle Pin High Productions and Camp Sugar Productions United Artists Releasing (North America), Universal Pictures (international) May 17, 2019 The Sun is Also a Star Warner Bros. Pictures, Alloy Entertainment Warner Bros. October 11, 2019 The Addams Family Cinesite Studios, The Jackal Group, and BermanBraun United Artists Releasing ==2020s== Release date Title Co-production with Distributor Notes Gretel & Hansel Orion Pictures and Automatik United Artists Releasing Valley Girl † Orion Classics Bill & Ted Face the Music Orion Pictures, Endeavor Content and Hammerstone Studios distribution in the US, Latin America, Germany, Greece, the Middle East, France, Italy, Spain, Japan, South Korea, Scandinavia, Taiwan, Thailand, Hong Kong, Hungary, Turkey, Benelux, Bulgaria, Singapore and Romania only The Wolf of Snow Hollow Orion Classics Breaking News in Yuba County American International Pictures, AGC Studios, Fibonacci Films, Nine Stories Productions, The Black List and Wyolah Entertainment Bad Trip * Orion Pictures, Gorilla Flicks, The District and Helo Netflix Wrath of Man Miramax and Toff Guy Films United Artists Releasing US, Latin America, Scandinavia, Philippines and Hong Kong distribution only How It Ends American International Pictures and Mister Lister Films Snake Eyes Skydance Media, Entertainment One, Hasbro Studios and Di Bonaventura Pictures Paramount Pictures Co-financing Respect Bron Studios, Creative Wealth Media Finance, Glickmania and One Community United Artists Releasing International distribution by Universal Pictures Flag Day Conqueror Productions, Rocket Science, Olive Hill Media and Wonderful Films US distribution only Summer Days, Summer Nights American International Pictures and Harbor Picture Company Candyman Bron Studios, Creative Wealth Media Finance and Monkeypaw Productions Universal Pictures Co-financing The Addams Family 2 Bron Animation, Creative Wealth Media Finance, The Jackal Group, Glickmania, Whalerock Industries and Cinesite Studios United Artists Releasing International distribution by Universal Pictures No Time to Die Eon Productions International distribution by Universal Pictures House of Gucci Bron Creative and Scott Free Productions International distribution by Universal Pictures Licorice Pizza Focus Features, Bron Creative and Ghoulardi Film Company International distribution by Universal Pictures Dog Free Association and FilmNation Entertainment US distribution only February 25, 2022 Cyrano Bron Creative and Working Title Films International distribution by Universal Pictures May 13, 2022 On the Count of Three Orion Pictures, Annapurna Pictures, Werner Entertainment and Valparaiso Pictures July 29, 2022 Thirteen Lives § Imagine Entertainment, Bron Creative, Magnolia Mae Films and Storyteller Productions Amazon Studios United Artists Releasing Samaritan ‡ Balboa Productions Prime Video exclusive Three Thousand Years of Longing FilmNation Entertainment, Elevate Production Finance, Sunac Pictures and Kennedy Miller Mitchell United Artists Releasing North American distribution only About Fate American International Pictures, Aldamisa Entertainment and Contentious Media Till Orion Pictures, Eon Productions, Whoop, Inc. and Frederic Zollo Productions International distribution by Universal Pictures Bones and All Frensy Film Company, Per Capita Productions, The Apartment Pictures, Memo Films, 3 Marys Entertainment, Tenderstories, Ela Film, Immobiliare Manila, Serfis, Wise Pictures and Vision Distribution International distribution by Warner Bros. Pictures except Italy Women Talking Orion Pictures and Plan B Entertainment International distribution by Universal Pictures; final release distributed by UAR before it was shut down by Amazon Creed III Balboa Productions, Glickmania, Chartoff/Winkler Productions and Proximity Media MGM International distribution by Warner Bros. Pictures A Good Person Killer Films and Elevation Pictures US and select international distribution only On a Wing and a Prayer ‡ Lightworkers Media Amazon Studios Prime Video exclusive Guy Ritchie's The Covenant STXfilms and Toff Guy Films MGM Select international distribution by Amazon Prime Video Surrounded † 3.16 Productions, Blackhand Media Production, Bron Studios, Creative Wealth Media, and Mandalay Pictures distribution only Landscape with Invisible Hand Annapurna Pictures and Plan B Entertainment Bottoms Orion Pictures and Brownstone Productions International distribution by Warner Bros. Pictures Dark Harvest Matt Tolmach Productions Limited theatrical release through Alamo Drafthouse Cinemas before being released digitally; final film distributed solely by MGM. Saltburn MRC Film, LuckyChap Entertainment and Lie Still Amazon MGM Studios First MGM film released theatrically through Amazon MGM Studios; Select international distribution by Warner Bros. Pictures American Fiction Orion Pictures, 3 Arts Entertainment, T-Street Productions and MRC Film First Orion Pictures film released theatrically through Amazon MGM Studios The Boys in the Boat Smokehouse Pictures Tempesta Films and Anonymous Content International distribution by Warner Bros. Pictures The Beekeeper Miramax, Cedar Park Studios and Punch Palace Productions US and China distribution only The Underdoggs ‡ Death Row Pictures and Khalabo Ink Society Prime Video exclusive Road House ‡ Silver Pictures Challengers Why Are You Acting?, Frenesy Film Company and Pascal Pictures International distribution by Warner Bros. Pictures I Am: Celine Dion Sony Music Entertainment, Les Productions Feeling and Vermilion Films Limited theatrical release Blink Twice Free Association, Bruce Cohen Productions, This is Important, and Bold Choices International distribution by Warner Bros. Pictures My Old Ass Indian Paintbrush, LuckyChap Entertainment, and Scythia Films distribution only Red One Seven Bucks Productions, The Detective Agency and Chris Morgan Productions distribution only ==Upcoming films== Release date Title Co-producer(s) Distributor Notes Nickel Boys Orion Pictures, Plan B Entertainment, Louverture Films and Anonymous Content Amazon MGM Studios The Fire Inside Michael De Luca Productions and Pastel Productions Levon's Trade Black Bear Pictures, Balboa Productions, blockFilm and Cedar Park Entertainment US distribution only Mercy Atlas Entertainment Sarah's Oil Kingdom Story Company, The Wonder Project, Wyldwood Productions and Why Not You Productions Project Hail Mary Lord Miller Productions, Waypoint Entertainment, Pascal Pictures and General Admission Masters of the Universe Mattel Films and Escape Artists ===Undated films=== Release date Title Co- producer(s) Distributor Notes TBA 4 Kids Walk Into a Bank Miramax, Picturestart, Point Grey Pictures and Black Mask Studios Amazon MGM Studios North American distribution through Orion Pictures only Hedda Orion Pictures, Plan B Entertainment and Viva Maude Long Day's Journey into Night Magnolia Mae Productions, BKStudios, Brouhaha Entertainment and Fetisoff Illusion Merv Catchlight Studios, Lightworkers Media and Matt Baer Films The Wrecking Crew 6th & Idaho Productions ===In development=== Title Co-producer(s) Distributor Notes 68 MACRO Amazon MGM Studios Eleanor Oliphant Is Completely Fine Hello Sunshine Fiddler on the Roof The Dan Jinks Company, Harbor Entertainment and Old 320 Sycamore Legally Blonde 3 Marc Platt Productions and Hello Sunshine Mercy Sparx Assemble Media, The Picture Company and Devil’s Due Publishing Untitled 26th James Bond film Eon Productions International distribution by Universal Pictures Wild Symphony Weed Road Pictures Untitled The Pink Panther reboot Geoffrey Productions and Rideback Spaceballs 2 Brooksfilms == References == Category:Lists of movies * Category:American movies by studio",
 "title": "List of Metro-Goldwyn-Mayer movies"
}