{
 "id": "577969",
 "text": "Ada E. Yonath (Hebrew: עדה יונת , born June 22, 1939) is an Israeli crystallographer. She received the 2009 Nobel Prize in Chemistry together with Thomas A. Steitz and Venkatraman Ramakrishnan for studies of the structure and functions of ribosomes. ==Life== ===Early life=== She was born in the Geula quarter of Jerusalem. Her father was a rabbi. Yonath and her family moved to Tel Aviv after her father died. ===Education=== She received her bachelor's degree in chemistry in 1962. She received her master's degree in biochemistry in 1964. She got both degrees from the Hebrew University in Jerusalem. She received her Ph.D. in X-Ray Crystallography at the Weizmann Institute of Science in 1968. Yonath made the first protein crystallography lab at the Weizmann Institute. Her work showed the function of ribosomes. Yonath worked at Carnegie-Mellon University and MIT for several years. She stayed as Weizmann Institute for the rest of her career. ==Work== Ada Yonath is an Israeli chemist who made pictures of ribosomes with X-ray crystallography. Ribosomes are the part of cells in the human body that put together proteins. X-ray crystallography makes pictures of molecules by bunching them into crystals. This method is only used to make models of single atoms. Yonath used this methods to crystallize ribosomes despite them being made up of many atoms and proteins. This caused her work to become very difficult. She returned to the Weizmann Institute of Science in 1970. She started the first Protein Crystallography lab in Israel. She did research at the Max Planck Institute for Molecular Genetics in Berlin, Germany from 1979 to 1984. She began trying to make ribosomes into crystals in 1970. [1] ==Achievements== She made the first model of a large ribosome in 1980. In 2006, she won the Wolf Prize in Chemistry. ===Nobel Prize=== She won the 2009 Nobel Prize in Chemistry with Venkatraman Ramakrishnan and Thomas Steitz. This Nobel prize was for her work in making images of ribosomes. She studied molecular genetics in Berlin, Germany, before winning the Nobel prize. ==Later life== Yonath led a research team at the Max Planck Institute in Hamburg, Germany for 18 years. She also continued research at the Weizmann Institute of Science.\"Yonath, Ada E..\" World Book Advanced, World Book, 2017, www.worldbookonline.com/advanced/article?id=ar754092. Accessed 31 Mar. 2017. ==Related pages== * Max Born * Leó Szilárd * Hans Bethe * Lise Meitner * Edward Teller * Albert Einstein * John von Neumann * Robert Oppenheimer * List of Nobel Prize winners in Chemistry ==References== Category:1939 births Category:Biochemists Category:Living people Category:Israeli chemists Category:People from Jerusalem Category:Israeli Jewish scientists Category:Jewish Wolf Prize winners Category:Israeli Nobel Prize winners Category:Jewish Nobel Prize winners Category:Hebrew University of Jerusalem alumni Category:Academics of the Weizmann Institute of Science",
 "title": "Ada Yonath"
}