{
 "id": "578326",
 "text": "The armistice and preliminaries of Villafranca were signed on 11 July 1859 in Villafranca di Verona, in Veneto, by France and Austria. It put an end to the Austro-Franco-Sardinian War, which is called in Italy the Second Italian War of Independence. After the difficult Battles of Magenta (4 June) and Solferino (24 June), French Emperor Napoleon III, without consulting his Sardinian ally, Camillo Benso, Count of Cavour, proposed the armistice on 8 July and had an interview on 11 July with Austrian Emperor Franz Joseph I. Although victorious, Napoleon III was frightened by the losses (nearly 40,000 killed or wounded at Solferino) and by the idea of having to continue an autumn and winter campaign against the entrenched Austrians. Also, the government and Empress Eugénie send him alarming information about the poor state of French opinion. In particular, the Catholics, who had supported the imperial regime, now feared for the Papal States and the Pope's independence if Austria was eliminated from Italy. Finally, anti-French feeling was spreading in Prussia, which supported the Austrians. The number of Prussian deaths is nearly 400 000 soldiers near the Rhine, stripped of French troops. In , it is agreed for Austria to cede Lombardy (except Mantua and Peschiera) to France, which would restore it to the Kingdom of Sardinia. An Italian confederation under the presidency of Pope Pius IX was created, and Veneto, under Austrian sovereignty, being part of it. The Dukes of Modena, Parma, and Tuscany, who jhad been driven away by revolutions, had their thrones returned. Cavour, who had not been consulted, resigned on 10 July, and King Victor-Emmanuel II gave his agreement \"in a personal capacity\" and thus leaving the door open to any governmental nullification. The preliminaries were confirmed by the Treaty of Zurich of 11 November 1859. Category:1859 in Europe Category:19th-century treaties Category:Wars involving Europe Category:19th century in Italy Category:1850s in France Category:19th century in Austria",
 "title": "Armistice of Villafranca"
}