{
 "id": "578455",
 "text": "This is a list of Dutch cabinets after World War II. == Cabinets == Cabinet Picture Coalitian party CDA Coalitian party D66 Coalitian party PvdA Coalitian party VVD Coalitian party others Duration Prime Minister Prime Minister's party Picture Rutte IV (Fourth Rutte cabinet) CDA D66 VVD CU 2022- Mark Rutte VVD Rutte III (Third Rutte cabinet) CDA D66 VVD CU 2017-2022 Mark Rutte VVD Rutte II (Second Rutte cabinet) PvdA VVD 2012-2017 Mark Rutte VVD Rutte I (First Rutte cabinet) CDA VVD PVV The PVV was only supporting the First Rutte cabinet. 2010-2012 Mark Rutte VVD Balkenende IV (Fourth Balkenende cabinet) CDA PvdA CU 2007-2010 Jan Peter Balkenende CDA Balkenende III (Third Balkenende cabinet) CDA VVD 2006-2007 Jan Peter Balkenende CDA Balkenende II (Second Balkenende cabinet) CDA D66 VVD 2003-2006 Jan Peter Balkenende CDA Balkenende I (First Balkenende cabinet) CDA VVD LPF 2002-2003 Jan Peter Balkenende CDA Kok II (Second Kok cabinet) D66 PvdA VVD 1998-2002 Wim Kok PvdA Kok I (First Kok cabinet) D66 PvdA VVD 1994-1998 Wim Kok PvdA Lubbers III (Third Lubbers cabinet) CDA PvdA 1989-1994 Ruud Lubbers CDA Lubbers II (Second Lubbers cabinet) CDA VVD 1986-1989 Ruud Lubbers CDA Lubbers I (First Lubbers cabinet) CDA VVD 1982-1986 Ruud Lubbers CDA Van Agt III (Third Van Agt cabinet) CDA D66 1982 Dries van Agt CDA Van Agt II (Second Van Agt cabinet) CDA D66 PvdA 1981-1982 Dries van Agt CDA Van Agt I (First Van Agt cabinet) CDA VVD 1977-1981 Dries van Agt CDA Den Uyl (Den Uyl cabinet) CDA (ARP, KVP) D66 PvdA PPR 1973-1977 Joop den Uyl PvdA Biesheuvel II (Second Biesheuvel cabinet) CDA (ARP, CHU, KVP) VVD 1972-1973 Barend Biesheuvel ARP Biesheuvel I (First Biesheuvel cabinet) CDA (ARP, CHU, KVP) VVD DS'70 1971-1972 Barend Biesheuvel ARP De Jong (De Jong cabinet) CDA (ARP, CHU, KVP) VVD 1967-1971 Piet de Jong KVP Zijlstra (Zijlstra cabinet) CDA (ARP, KVP) 1966-1967 Jelle Zijlstra ARP Cals (Cals cabinet) CDA (ARP, KVP) PvdA 1965-1966 Jo Cals KVP Marijnen (Marijnen cabinet) CDA (ARP, CHU, KVP) VVD 1963-1965 Vic Marijnen KVP De Quay (De Quay cabinet) CDA (ARP, CHU, KVP) VVD 1959-1963 Jan de Quay KVP Beel II (Second Beel cabinet) CDA (ARP, CHU, KVP) 1958-1959 Louis Beel KVP Drees III (Third Drees cabinet) CDA (ARP, CHU, KVP) PvdA 1956-1958 Willem Drees PvdA Drees II (Second Drees cabinet) CDA (ARP, CHU, KVP) PvdA 1952-1956 Willem Drees PvdA Drees I (First Drees cabinet) CDA (CHU, KVP) PvdA VVD 1951-1952 Willem Drees PvdA Drees-Van Schaik (Drees-Van Schaik cabinet) CDA (CHU, KVP) PvdA VVD 1948-1951 Willem Drees PvdA Beel I (First Beel cabinet) CDA (KVP) PvdA 1946-1948 Louis Beel KVP Schermerhorn- Drees (Schermerhorn-Drees cabinet) CDA (ARP, KVP) D66 (VDB) PvdA (SDAP) 1945-1946 Wim Schermerhorn VDB == Political parties == * ARP - Anti-Revolutionary Party (Dutch: Anti-Revolutionaire Partij), a predecessor of the CDA. * CDA - Christian Democratic Appeal (Dutch: Christen-Democratisch Appèl), a Christian democratic party. * CHU - Christian Historical Union (Dutch: Christelijk- Historische Unie), a predecessor of the CDA. * CU - ChristianUnion (Dutch: ChristenUnie), an orthodox Christian democratic party. * D66 - Democrats 66 (Dutch: Democraten 66), a social liberal party, founded in 1966. * DS'70 - Democratic Socialists 1970 (Dutch: Democratisch-Socialisten 1970 ), a split from the PvdA. * KVP - Catholic People's Party (Dutch: Katholieke Volkspartij), a predecessor of the CDA. * LPF - Pim Fortuyn List (Dutch: Lijst Pim Fortuyn), a former populist party established by the in 2002 murdered politician Pim Fortuyn. * PPR - Political Party of Radicals (Dutch: Politieke Partij Radicalen), a predecessor of GreenLeft (GL). * PvdA - Labour Party (Dutch: Partij van de Arbeid), a social democratic party. * PVV - Party for Freedom (Dutch: Partij voor de Vrijheid), a populist party, established by Geert Wilders. * SDAP - Social Democratic Workers' Party (Dutch: Sociaal- Democratische Arbeiderspartij), a predecessor of the PvdA. * VDB - Free- thinking Democratic League (Dutch: Vrijzinnig-Democratische Bond), a predecessor of D66. * VVD - People's Party for Freedom and Democracy (Dutch: Volkspartij voor Vrijheid en Democratie), a conservative liberal party. == Related pages == * Politics of the Netherlands == References == * www.parlement.com cabinet",
 "title": "List of cabinets of the Netherlands"
}