{
 "id": "578438",
 "text": "Carl Celian Icahn (born February 16, 1936) is an American business magnate, investor, and philanthropist. He is described as an activist investor. This means he uses his investment to change how a company runs its business. He is the founder and majority shareholder of Icahn Enterprises, a holding company based in New York City that invests in lots of different companies and industries. Icahn is also Chairman of Federal-Mogul, an American developer of vehicle safety products. ==Early life== Icahn was born in a Jewish family www.jpost.com in New York City. He studied at Princeton University and at New York University. ==Business career== In the 1980s Icahn became known as a \"corporate raider\" after profiting from the hostile takeover and asset stripping of the American airline TWA.Grant, Elaine X. (October 2005), \"TWA – Death Of A Legend\" , St Louis Magazine Icahn has held many controlling positions in many corporations, including RJR Nabisco, TWA, Texaco, Phillips Petroleum, Western Union, Gulf & Western, Viacom, Uniroyal, Dan River, Marshall Field's, E-II (Culligan and Samsonite), American Can, USX, Marvel Comics, Revlon, Imclone, Federal-Mogul, Fairmont Hotels, Blockbuster, Kerr- McGee, Time Warner, Netflix, Motorola, and Herbalife. ==Political roles== Icahn endorsed Donald Trump for the 2016 U.S. presidential election. Trump announced in October 2015 that he would nominate Icahn for Treasury Secretary if he were to be elected. However, this position went to Steve Mnuchin instead. On December 21, 2016, it was announced that Icahn would serve as Special Advisor to the President on Regulatory Reform under President Donald Trump. Icahn stepped down from the role in August 2017.Carl Icahn Issues Statement ==Personal life== From 1979 through 1999, Icahn was married to Liba Trejbal. In 1999, he married Gail Golden. He has two children including businessman Brett Icahn. ==References== ==Other websites== * * Profile of Carl Icahn – Forbes Category:1936 births Category:Living people Category:American activists Category:American billionaires Category:American chief executives Category:American Jews Category:Philanthropists from New York (state) Category:Businesspeople from New York City Category:Jewish activists Category:Jewish billionaires Category:Jewish businesspeople Category:Jewish philanthropists Category:New York University alumni Category:Princeton University alumni Category:Real estate developers",
 "title": "Carl Icahn"
}