{
 "id": "578982",
 "text": "The following is a list of notable deaths in April 2017. For notable deaths before the current month, please see \"Previous months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==April== ===1=== *Gary Austin, 75, American theater writer and director (The Groundlings), cancer.Gary Austin, founder of The Groundlings Theatre, dies at 75 *Lonnie Brooks, 83, American blues guitarist and singer. * Gösta Ekman, 77, Swedish actor and director (Jönssonligan, Martin Beck).Gösta Ekman är död *Darcus Howe, 74, Trinidadian-born British editor (Race Today) and civil rights activist, member of the Mangrove Nine, complications from prostate cancer.Civil rights activist Darcus Howe dies aged 74 *Antonio Lamela, 90, Spanish architect (Torres de Colón, Santiago Bernabéu Stadium, Adolfo Suárez, Madrid–Barajas Airport).Muere Antonio Lamela, el arquitecto que se construyó su camino *Burton Watson, 91, American translator (From the Country of Eight Islands: An Anthology of Japanese Poetry, Selected Poems of Su Tung-p'o). * Yevgeny Yevtushenko, 84, Russian poet (Babi Yar), heart failure.Acclaimed Russian Poet Yevtushenko Dead At 84 ===2=== *Kenneth J. Donnelly, 66, American politician, member of the Massachusetts State Senate (since 2009), complications from a brain tumor.State senator dies after battling brain tumor *Leonard Litwin, 102, American real estate developer (Glenwood Management Corp.), respiratory failure.Glenwood’s Leonard Litwin dies at 102 ===3=== *Michel Arrivé, 80, French linguist and novelist.Mort de l’écrivain et linguiste Michel Arrivé *John Chrispinsson, 60, Swedish journalist (Melodifestivalen 1989), heart attack.SVT-profilen John Chrispinsson är död *Sergio González Rodríguez, 67, Mexican journalist (La Jornada), heart attack.Muere el escritor mexicano Sergio González Rodríguez, que denunció los feminicidios *Akbarzhan Jalilov, 22, Kyrgyzstani-born Russian terrorist, attacker responsible for the 2017 Saint Petersburg Metro bombing, suicide by bombing.St Petersburg metro bombing suspect 'from Kyrgyzstan' *Roy Sievers, 90, American baseball player (St. Louis Browns, Washington Senators, Chicago White Sox).Roy Sievers dies at 90; St. Louisan was AL Rookie of Year with Browns *Stella Turk, 92, British zoologist, naturalist, and conservationist.Stella Turk Obituary ===4=== *Samir Farid, 73, Egyptian movie critic and historian. *Mária Pozsonec, 77, Hungarian-born Slovenian politician, MP (1990–2008).Long-serving Hungarian minority MP dies, aged 77 *Giovanni Sartori, 92, Italian political scientist and journalist (Corriere della Sera), throat cancer.Muore il politologo Giovanni Sartori, inventò i termini Mattarellum e Porcellum ===5=== *Arthur Bisguier, 87, American chess grandmaster and writer, respiratory failure. *John Chittick, 69, American health activist, founder of TeenAIDS-PeerCorps.Local activist Chittick dies at 69 *David Gove, 38, American ice hockey player (Carolina Hurricanes) and coach (Wheeling Nailers), suspected drug overdose.Former Wheeling Nailers coach found dead in Pittsburgh *Paul O'Neill, 61, American producer, composer and songwriter (Trans-Siberian Orchestra), chronic disease.TRANS-SIBERIAN ORCHESTRA Mastermind PAUL O'NEILL Passes - \"The Entire TSO Family, Past And Present, Is Heartbroken\" *Memè Perlini, 69, Italian actor and director (A Fistful of Dynamite, The Grand Duel), suicide by jumping.Actor-director Memé Perlini dies *Atanase Sciotnic, 75, Romanian sprint canoeist, Olympic silver medalist (1972).DOLIU în SPORT. A MURIT un dublu medaliat olimpic al ROMÂNIEI *Ilkka Sinisalo, 58, Finnish ice hockey player (Philadelphia Flyers, Minnesota North Stars, Los Angeles Kings), prostate cancer.Former Flyer Ilkka Sinisalo dies at 58 ===6=== *Bob Cerv, 91, American baseball player (New York Yankees), stroke.Former Yankee Bob Cerv dies at 91 *Armand Gatti, 93, Monégasque-born French playwright, filmmaker (Enclouser, El Otro Cristóbal) and journalist.Armand Gatti, miroir éclaté des utopies *David Peel, 73, American musician (The Lower East Side Band) and political activist, complications from a heart attack.Anti-Establishment Icon David Peel Dies at 73 *Don Rickles, 90, American comedian (The Dean Martin Celebrity Roast) and actor (Toy Story, C.P.O. Sharkey, Kelly's Heroes), kidney failure.Don Rickles, Legendary Comic With a Gift for the Insult, Dies at 90 *Jerzy Vetulani, 81, Polish neuroscientist, member of the Polish Academy of Sciences (since 1991), hit by car.Zmarł profesor Jerzy Vetulani. Miał 81 lat ===7=== *Relja Bašić, 87, Croatian actor (One Song a Day Takes Mischief Away) and politician.Umro Relja Bašić, legendarni glumac preminuo u 87. godini *Arturo García Bustos, 90, Mexican painter.Murió Arturo García Bustos, alumno de Frida Kahlo *Marthe Gosteli, 99, Swiss women's rights activist (Bund Schweizerischer Frauenvereine) and archivist, complications from a fall.Doyenne of women’s rights in Switzerland dies *Peter Isaacson, 96, Australian media publisher.Tributes flow for Australian publisher Peter Isaacson *Christopher Morahan, 87, English stage and television director (The Jewel in the Crown).Actor Tim Pigott-Smith dies aged 70 *Glenn O'Brien, 70, American journalist (GQ Magazine), editor (Rolling Stone, Interview) and television presenter (TV Party), complications from pneumonia. *Tim Pigott-Smith, 70, English actor (The Jewel in the Crown, Clash of the Titans, V for Vendetta), suspected heart attack.Actor Tim Pigott-Smith dies aged 70 ===8=== *Fishman, 66, Mexican professional wrestler (UWA, AAA), heart attack.Falleció el legendario luchador Fishman *Georgy Grechko, 85, Russian cosmonaut (Soyuz 17, Soyuz 26, Soyuz T-14), Hero of the Soviet Union, heart failure.Дочь космонавта Гречко назвала причину смерти отца *Brian Matthew, 88, English television and radio presenter (Saturday Club, Thank Your Lucky Stars, Sounds of the 60s).Brian Matthew: BBC Radio 2 broadcaster dies at 88 *Donald Sarason, 84, American mathematician (Hardy space).Donald E. Sarason ===9=== *Knut Borge, 67, Norwegian journalist (Dagens Næringsliv, Verdens Gang) and television presenter (Spellemannprisen, 20 spørsmål), heart failure.NRK-Knut Borge er død *Carme Chacón, 46, Spanish politician, Minister of Housing (2007–2008) and Defence (2008–2011), heart disease.Muere la socialista Carme Chacón *John Clarke, 68, New Zealand-born Australian novelist (The Tournament), actor (Never Say Die, Death in Brunswick), screenwriter (Lonely Hearts), comedian (A Current Affair) and satirist, heart attack.John Clarke, beloved Down Under for his satire, dies at 68 *Peter Hansen, 95, American actor (When Worlds Collide, Port Charles, General Hospital).Peter Hansen Obituary *Harry Huskey, 101, American computer scientist (Standards Western Automatic Computer).Computer History Museum Home Page *Kim Young-ae, 65, South Korean actress (The Attorney), pancreatic cancer.배우 김영애, 췌장암 투병 중 별세. 향년 66세 *Dieter Kottysch, 73, German middleweight boxer, Olympic gold medalist (1972).Box-Olympiasieger Dieter Kottysch gestorben *Jean Périmony, 86, French actor (Des grives aux loups) and theatre director (Cie du Villiers).Disparition du grand professeur d'art dramatique Jean Périmony ===10=== *Bab Christensen, 89, Norwegian actress (Stevnemøte med glemte år).Skuespiller Bab Christensen er død *Sir Arnold Clark, 89, Scottish businessman (Arnold Clark Group). *Linda Hopkins, 92, American actress (Purlie, Me and Bessie) and blues and gospel singer (\"Shake a Hand\"). *Dennis F. Kinlaw, 94, American academic, President of Asbury University (1968–1981; 1986–1991).Dennis Kinlaw, twice president of Asbury University, dies at 94 *Kirill Kovaldzhi, 88, Russian author (Five Points on the Map, Liman Stories, Candle in Draft), poet (Talk with the Beloved) and critic.Поэт Кирилл Ковальджи скончался на 88 году жизни *Larry Sharpe, 66, American professional wrestler (NWA), liver disease.Larry 'Sharpe' Weil Passes Away *Banner Thomas, 63, American bass guitarist (Molly Hatchet), pneumonia.Founding Molly Hatchet Bassist Banner Thomas Dies ===11=== *Michael Ballhaus, 81, German cinematographer (Goodfellas, Air Force One, Bram Stoker's Dracula).'Goodfellas' Cinematographer Michael Ballhaus Dies at 81 *J. Geils, 71, American guitarist (The J. Geils Band).J Geils, 80s guitarist dead at 71 *Dorothy Mengering, 95, American television personality (Late Night with David Letterman, Late Show with David Letterman).Dorothy Mengering, David Letterman's Mom and 'Late Show' Personality, Dies at 95 *Margit Schumann, 64, German luger, Olympic gold medalist (1976).Olympic Champion Margit Schumann passes away ===12=== *Sheila Abdus-Salaam, 65, American judge, Associate Judge of the New York Court of Appeals (since 2013), suspected suicide by jumping.Appeals court judge Sheila Abdus-Salaam found dead on Hudson River shore *Tom Coyne, 62, American Grammy award-winning music engineer (21, 1989, 25), multiple myeloma. *Akhilesh Das, 56, Indian politician and sporting executive, member of the Rajya Sabha (19962014), mayor of Lucknow (19931995), heart attack.Congress leader Akhilesh Das Gupta passes away *Angel Espinosa, 50, Cuban boxer, World Amateur Champion (1986), suspected cardiac arrest.Muere en Miami el ex boxeador cubano y campeón mundial Ángel Espinosa Capó *Geoff Grover, 73, Australian footballer (Port Melbourne).Grover, Geoff *Wayne Hardin, 91, American football player (Pacific Tigers) and coach (Navy Midshipmen, Temple Owls), stroke. *Charlie Murphy, 57, American comedian (Chappelle's Show), actor (Paper Soldiers, Black Jesus, Meet the Blacks) and screenwriter (Norbit, The Boondocks, Vampire in Brooklyn), leukemia. *Toby Smith, 46, British keyboardist (Jamiroquai) and music producer (The Hoosiers).Toby Smith, Jamiroquai keyboardist, dies ===13=== *K. S. Chandrasekharan, 96, Indian-Swiss mathematician, pneumonia.Komaravolu Chandrasekharan *Fred Goldsmith, 84, Australian AFL footballer (South Melbourne).Vale Fred Goldsmith: Brownlow winner dies at 84 *David Mwiraria, 78, Kenyan politician, MP for North Imenti (19922007), Minister of Finance (20032006), respiratory failure and bone cancer.Former Finance minister David Mwiraria dies at Karen Hospital *Dan Rooney, 84, American football executive and diplomat, Chairman of the Pittsburgh Steelers (since 2003), Ambassador to Ireland (2009–2012), and member of the Hall of Fame (2000).Pittsburg Steelers Dan Rooney Dies ===14=== *Henry Hillman, 98, American venture capitalist and philanthropist.Pittsburgh Businessman, Philanthropist Henry L. Hillman Dies At 98 *Robert Taylor, 85, American computer scientist and internet pioneer, recipient of the National Medal of Technology and the Draper Prize, complications from Parkinson's disease.Robert Taylor, Innovator Who Shaped Modern Computing, Dies at 85 ===15=== *David Brumbaugh, 56, American politician, member of the Oklahoma House of Representatives (since 2011). *Clifton James, 96, American actor (Live and Let Die, Cool Hand Luke, Eight Men Out), complications from diabetes. *Emma Morano, 117, Italian supercentenarian, verified oldest living person and last living person born in the 19th Century, heart disease. *Sylvia Moy, 78, American songwriter (\"Uptight (Everything's Alright)\", \"I Was Made to Love Her\", \"My Cherie Amour\") and record producer (Motown Records, Stevie Wonder), complications from pneumonia.Legendary Motown Records writer, producer Sylvia Moy dies ===16=== *Gianni Boncompagni, 84, Italian television presenter (Non è la RAI), producer (Discoring) and screenwriter (Domenica in), cerebral hemorrhage.È morto Gianni Boncompagni, fece la storia del piccolo schermo *Arcan Cetin, 20, Turkish-born American terrorist, attacker responsible for 2016 Cascade Mall shooting, suicide by hanging.Prosecutor: Burlington Mall shooter killed himself in jail *Robert Godwin, 74, American foundry worker and murder victim (Shooting of Robert Godwin), shot.Cleveland: Search for suspect in Facebook homicide video widens *Allan Holdsworth, 70, British guitarist and composer (Bruford, U.K., Soft Machine), heart attack.Allan Holdsworth Dead At 70 ===17=== *Dawson Mathis, 76, American politician, member of the U.S. House of Representatives from Georgia's 2nd district (1971–1981), complications from pneumonia.Former U.S. congressman and WALB anchor passes away at 76 *John T. Noonan Jr., 90, American circuit judge, Judge of the United States Court of Appeals for the Ninth Circuit (1985–1996).9th Circuit Judge John Noonan Dies at 90 *Rosey, 47, Samoan-American professional wrestler (WWE, AJPW), congestive heart failure.Rosey passes away *Shōichi Watanabe, 86, Japanese-born English scholar and historical revisionist, heart failure. ===18=== *Augustin Bubník, 88, Czech ice hockey player (national team), coach and politician, MP (1998–2002).Zemřel legendární hokejista Augustin Bubník, \"tragický\" mistr světa z roku 1949 *Yvonne Monlaur, 77, French actress (Three Strangers in Rome, Circus of Horrors, The Brides of Dracula).In Memoriam *Jaak Panksepp, 73, Estonian-born American neuroscientist, cancer.Rat-tickling neuroscientist Jaak Panksepp dies at 73 *Steve William Stephens, 37, American killer, responsible for the murder of Robert Godwin, suicide by gunshot.Cleveland Facebook Killer: Steve Stephens Dead in Car After Pursuit by Pa. Police ===19=== *Delbert Daisey, 89, American waterfowl decoy maker and conservationist.Delbert Lee \"Cigar\" Daisey *Aaron Hernandez, 27, American football player (New England Patriots) and convicted killer (Odin Lloyd), suicide by hanging.Aaron Hernandez kills himself in prison *Lyda Ann Thomas, 80, American politician, Mayor of Galveston, Texas (2004–2010), cancer.Former Galveston Mayor Lyda Ann Thomas dies at 80 ===20=== *Jay Dickey, 77, American politician, member of the U.S. House of Representatives from Arkansas's 4th congressional district (1993–2001).Former Arkansas Congressman Passes Away At 77 *Roberto Ferreiro, 81, Argentine footballer (Independiente, River Plate, national team) and manager.Dolor en Independiente: falleció Roberto \"Pipo\" Ferreiro *Cuba Gooding, Sr., 72, American soul singer (The Main Ingredient) and actor (Gedo, Children of the Struggle, Save the Children), suspended drug overdose.Soul Singer Cuba Gooding Sr. Found Dead in His Car *Lawrence Hogan, 88, American politician, member of the U.S. House of Representatives from Maryland's 5th congressional district (1969–1975), complications from a stroke.Lawrence J. Hogan Sr., Md. Republican who called for Nixon's impeachment, dies at 88 * Germaine Mason, 34, Jamaican-born British high jumper, Olympic silver medalist (2008), motorcycle crash.Germaine Mason dead: Great Britain Olympic medalist killed in motorbike crash ===21=== * Magdalena Abakanowicz, 86, Polish sculptor. *Cecilia Alvear, 77, Ecuadorian-born American journalist (NBC News), breast cancer.Pioneering Journalist Cecilia Alvear Pushed For More Latinos in Newsrooms *Carl Christ, 93, American economist (Econometrics).In memoriam Longtime Johns Hopkins economist Carl F. Christ dies at 93 * Ugo Ehiogu, 44, English professional football player (Aston Villa, Middlesbrough, national team) and coach (Tottenham), cardiac arrest.Ugo Ehiogu, former Aston Villa and England defender and Tottenham coach, dies aged 44 ===22=== *Hubert Dreyfus, 87, American philosopher (What Computers Can't Do), prostate cancer.Hubert Dreyfus (1929-2017) *William Hjortsberg, 76, American novelist (Falling Angel) and screenwriter (Legend), pancreatic cancer. *Jess Kersey, 76, American basketball official (ABA, NBA), cancer. *Erin Moran, 56, American actress (Happy Days, Joanie Loves Chachi, Galaxy of Terror), complications from squamous cell carcinoma of the throat.Erin Moran 'Happy Days' Star Dead At 56 *Attilio Nicora, 80, Italian Roman Catholic cardinal, Bishop of Verona (1992–1997).Lutto. Morto il cardinale Attilio Nicora, pastore e insigne giurista *Witold Pyrkosz, 90, Polish actor (M jak miłość, Janosik, Alternatywy 4).Witold Pyrkosz nie żyje. Wybitny aktor miał 90 lat *Gustavo Rojo, 93, Uruguayan actor (Tarzan and the Mermaids, The Evil Forest, The Valley of Gwangi).Muere el actor Gustavo Rojo *Michele Scarponi, 37, Italian racing cyclist (Diquigiovanni–Androni, Lampre–ISD, Astana), winner of the 2011 Giro d'Italia, traffic collision.Michele Scarponi killed in training *Pere Tàpias, 70, Spanish food writer and radio presenter (Tàpies Variades), Ambassor of Xató (2005–2006), heart failure.Mor Pere Tapias als 70 anys ===23=== *Isiaka Adeleke, 62, Nigerian politician, Governor of Osun State (1992–1993), heart attack.Senator Isiaka Adeleke Is Dead *Jerry Adriani, 70, Brazilian singer (Jovem Guarda, Os Rebeldes) and actor (Excelsior to Go Go, MilleVoci), cancer.Jerry Adriano morre aos 70 anos no Rio *Chris Bearde, 80, Australian comedy writer (Laugh-In) and producer (The Sonny and Cher Comedy Hour, The Gong Show), heart attack.Chris Bearde, Writer on 'Laugh-In' and Creator of 'The Gong Show,' Dies at 80 *Leo Baxendale, 86, British comics artist (The Bash Street Kids, Minnie the Minx, Little Plum), cancer.Bash Street Kids creator Leo Baxendale dies *Kathleen Crowley, 87, American actress (Robert Montgomery Presents, Downhill Racer, Maverick). Obituary for Kathleen Crowley *Imre Földi, 78, Hungarian weightlifter, Olympic champion (1972).Meghalt Földi Imre, a Nemzet Sportolója *František Rajtoral, 31, Czech football player (Baník Ostrava, Viktoria Plzeň, national team), suicide by hanging.Gaziantepspor’s Czech striker Rajtoral commits suicide by hanging *Chriet Titulaer, 73, Dutch astronomer, television presenter (Wondere Wereld) and writer.Sterrenkundige Chriet Titulaer (73) overleden *Michael Williams, Baron Williams of Baglan, 67, British peer and diplomat.Former UN Lebanon coordinator dies at 67 ===24=== *Benjamin Barber, 77, American political theorist and author (Jihad vs. McWorld), pancreatic cancer.Dr Benjamin Barber – August 2 1939 – April 24 2017 *Agustín Edwards Eastman, 89, Chilean newspaper publisher, owner of El Mercurio, respiratory failure.Muere Agustín Edwards Eastman, empresario y propietario de El Mercurio *Agnes Giebel, 95, German soprano.Deutsche Sopranistin Agnes Giebel gestorben *Don Gordon, 90, American actor (Bullitt, Papillon, The Towering Inferno).Don Gordon, Top-Notch Character Actor and Pal of Steve McQueen, Dies at 90 *Robert M. Pirsig, 88, American writer and philosopher (Zen and the Art of Motorcycle Maintenance, Lila: An Inquiry into Morals).Robert Pirsig, author of \"Zen and the Art of Motorcycle Maintenance,\" dies at 88 *Nicholas Sand, 75, American chemist (Brotherhood of Eternal Love), suspected heart attack.Nicholas Sand has Passed Away *Ken Sears, 83, American basketball player (New York Knicks, San Francisco Warriors).Former Santa Clara, NBA forward Ken Sears dies at 83 ===25=== *Sasha Lakovic, 45, Canadian hockey player (Calgary Flames, New Jersey Devils) and actor (Miracle), brain cancer.Sasha Lakovic, \"Pit Bull\" Lakovic Dead at age 45 *Erik Martin, 81, German songwriter and editor (Muschelhaufen).Nachruf auf „mac“ Erik Martin *Philippe Mestre, 89, French media executive (Presse-Océan) and politician, member of the National Assembly (1981–1993), Minister of Veteran Affairs and War Victims (1993–1995).Vendée. Le décès de Philippe Mestre, ancien ministre *Munyua Waiyaki, 91, Kenyan politician, Minister for Foreign Affairs (1974–1979), pneumonia. ===26=== * Jonathan Demme, 73, American movie director (The Silence of the Lambs, Philadelphia, Rachel Getting Married), Oscar winner (1992), complications from esophageal cancer and heart disease.Jonathan Demme, Oscar-Winning Director of ‘Silence of the Lambs,’ Dies At 73 — Exclusive * Bill Page, 91, American jazz musician (Lawrence Welk Band) and businessman. ===27=== *Vinu Chakravarthy, 71, Indian actor (Parasangada Gendetimma, Muni, Gopurangal Saivathillai). *Peter George, 75, Canadian academic, 6th President and Vice-Chancellor of McMaster University (1995–2010), cancer. *Vinod Khanna, 70, Indian actor (Mere Apne, Amar Akbar Anthony, Suryaa: An Awakening) and politician, member of the Lok Sabha from Gurdaspur constituency (1997–2009; since 2014), bladder cancer.Actor-politician Vinod Khanna passes away at 70 *Julius Youngner, 96, American virologist.Obituary: Julius Youngner | Last surviving member of Salk vaccine team ===28=== *Vito Acconci, 77, American artist (Seedbed) and architectural designer, stroke. *Brazo de Oro, 57, Mexican professional wrestler (CMLL, UWA, NWA), heart attack.La lucha libre está de luto; falleció el Brazo de Oro *Janelle Kirtley, 73, American water skier, world champion (1961).Jane Ellen \"Janelle\" (Kirtley) Godfrey (1943 - 2017) *Maria Kide, 66, Swedish politician, injuries sustained from the 2017 Stockholm attack.MP-ledamoten blev terroristens femte offer *John Shifflett, 64, American jazz musician, pancreatic cancer.John Shifflett, popular San Jose jazz musician and teacher, dies at age 64 *Chad Young, 21, American racing cyclist (Axeon), cycling accident.American rider Chad Young, 21, dies of crash injuries ===29=== *George Genyk, 78, American football player (New York Titans, Michigan Wolverines) and coach, stomach cancer. *R. Vidyasagar Rao, 77, Indian irrigation engineer, bladder cancer. ===30=== *Belchior, 70, Brazilian singer and composer, multiple organ failure.Cantor Belchior morre aos 70 anos no Rio Grande do Sul *Mbah Gotho, 146 (claimed), Indonesian man, oldest unverified living person, heart failure. *Lorna Gray, 99, American actress (O, My Darling Clementine, Captain America, Oh! Susanna).Adrian Booth (1917 - 2017) *Archduke Joseph Árpád of Austria, 84, Hungarian royalty, Captain General of the Order of Vitéz (since 1977). *Raymond P. Kogovsek, 75, American politician, member of the Colorado Senate (1970–1978) and the U.S. House of Representatives (1979–1985). *Boris Oleynik, 81, Ukrainian poet, translator, and politician, member of the Verkhovna Rada (1992–2006), heart failure.Пішов з життя видатний український поет Борис Олійник *Ueli Steck, 40, Swiss rock climber and mountaineer.'Swiss Machine’ Ueli Steck killed in Mt Everest accident *Jean Stein, 83, American author (West of Eden, Edie: American Girl) and editor (The Paris Review), suicide by jumping.Jean Stein, Author of 'Edie' and 'West of Eden,' Dies at 83 ==Months== * January 2017 * February 2017 * March 2017 * April 2017 ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *04 Category:April 2017 events",
 "title": "Deaths in April 2017"
}