{
 "id": "5789",
 "text": "Laos, officially the Lao People's Democratic Republic (LPDR), is a country in Southeast Asia. Laos is the only landlocked country in Southeast Asia. It is bordered by Myanmar and by China to the northwest, by Vietnam to the east, by Cambodia to the south and by Thailand to the west. The Mekong river forms a part of the western boundary with Thailand. Boats from Laos cannot get to the ocean using the Mekong because of rapids and waterfalls in the south of the country. Laos is the least densely populated country in Southeast Asia, with 32 people per square kilometer. Trains to and from Thailand will start in July 2024; that line has an endpoint in Vientiane prefecture's Khamsavath railway station.https://www.bangkokpost.com/thailand/general/2822566/bangkok- vientiane-train-service-begins-july-19. Retrieved 2024-07-03 ==History== Laos became a French colony in 1893 and became part of French Indochina. In 1949 it became independent from France, as the Kingdom of Laos. The Laotian Civil War started in 1953. In 1975 Laos became a one-party state under the leadership of the communist party. On July 20, 1954 an agreement was signed - Agreement on the Cessation of Hostilities in Laos. That agreement ended France's rule of Laos.https://web.archive.org/web/20041031095421/http://lcweb2.loc.gov/cgi- bin/query/r?frd%2Fcstdy%3A%40field%28DOCID%2Bla0004%29 2 months later, the authorities of North Vietnam, established a support group for Pathet Lao, in Ban Nameo.https://web.archive.org/web/20170904014932/http://lcweb2.loc.gov/cgi- bin/query/D?cstdy%3A1%3A.%2Ftemp%2F~frd_6n5k%3A%3A From the middle of the 1960s, Laos was used by North Vietnam as a route to attack South Vietnam. U.S. forces dropped bombs on Laos, to try to stop the supplies coming thru the Ho Chi Minh trail.\"By the mid-60s, Laos had become a theater for the U.S. to cut off the Ho Chi Minh Trail, largely through bombing. They basically viewed their Laotian allies as an anvil to hammer the North Vietnamese. \" South Vietnam was taken (or fell) in April 1975. On May 14, 1975 Vang Pao escaped from Laos, thru the military base at Long Tieng.https://www.nytimes.com/2015/05/28/opinion/heirs-of-the-secret-war-in- laos.html?_r=0 ==References== Category:Least developed countries Category:1949 establishments in Asia",
 "title": "Laos"
}