{
 "id": "579005",
 "text": "Andreas Kaplan (born October 5, 1977), Professor of Marketing, is the Dean of ESCP Business School in Berlin and Paris. He is specialized in the areas of social media, viral marketing, and the digital world in general. ==Life== Kaplan was born on October 5, 1977 and grew up in Munich, Germany. His mother is Anneliese Kaplan and his father Vincenc Kaplan. Kaplan holds a Master of Public Administration from the École Nationale d'Administration, an MSc from ESCP Business School, and a BSc from the Ludwig Maximilian University of Munich. He completed his Habilitation at the Sorbonne and his Ph.D. at the University of Cologne and HEC Paris. Kaplan is an executive education advisory board member at Kozminski University. ==Research== Kaplan’s research mainly deals with analyzing and decrypting the digital sphere. With approximately 30 000 citations on Google Scholar, Professor Kaplan was counted amongst the Top 50 Business and Management authors in the world according to John Wiley & Sons. In 2020, Andreas Kaplan ranked in Stanford study of the world's top 2% of scientists. In particular his 2010 article \"Users of the world, unite! The challenges and opportunities of social media\" published in Business Horizons is widely cited and known in the field. This seminal article recurrently achieved first place in Science Direct's annual list of the 25 most downloaded publications across all 24 core subject areas covered in Science Direct and thus was downloaded more often than any other of the approximately 13.4 million papers in the collection. ==Publications== * * * Kaplan, A. and M. Haenlein (2019) Siri, Siri in my Hand, who is the Fairest in the Land? On the Interpretations, Illustrations and Implications of Artificial Intelligence, Business Horizons, 62(1). * Kaplan Andreas (2018) “A School is a Building that Has 4 Walls - with Tomorrow Inside”: Toward the Reinvention of the Business School, Business Horizons. * Kaplan Andreas M., Haenlein Michael (2016) Higher education and the digital revolution: About MOOCs, SPOCs, social media, and the Cookie Monster, Business Horizons, Volume 59. * Pucciarelli F., Kaplan Andreas M. (2016) Competition and Strategy in Higher Education: Managing Complexity and Uncertainty, Business Horizons, Volume 59(3), 311-320. * * Kaplan Andreas M. (2014) European Management and European Business Schools: Insights from the History of Business Schools, European Management Journal, 32(4), 529-534. * Kaplan Andreas M. (2012) If you love something, let it go mobile: Mobile marketing and mobile social media 4x4, Business Horizons, 55(2), 129–139 * Kaplan Andreas M., Haenlein Michael (2012) The Britney Spears universe: Social media and viral marketing at its best, Business Horizons, 55(1), 27–31 ==References== ==Other websites== * Biography – ESCP Website * French German Business Forum * Complete publication list Category:1977 births Category:Alumni of HEC Paris Category:People from Munich Category:German academics",
 "title": "Andreas Kaplan"
}