{
 "id": "579371",
 "text": "It, also known as Pennywise, and Pennywise the Dancing Clown, is the title character and main antagonist of Stephen King's 1986 horror novel It. The character is a demonic and scary supernatural entity that murders and eats the local children (and sometimes adults) of the fictional town of Derry, Maine about every twenty-seven years, using many powers that include the ability of shapeshifting and manipulation of reality. During the course of the story, It primarily appears in the form of Pennywise the Dancing Clown. \"The Losers Club\" becomes aware of Pennywise's presence after it kills Bill Denbrough's little brother, Georgie. King came up with the idea for Pennywise after asking himself what scared children \"more than anything else in the world\", which he felt was clowns. The character has been described as one of the scariest clowns in popular culture and is a global icon. == Appearances == === Literature === It is a supernatural alien creature who landed on Earth roughly in the 16th century. It eventually realized there was no natural food source there, instead of whatever it was given to eat at the other world it came from. Due to this, it began to prey on human children every 27 years, malforming itself into their worst fears as it supposedly \"salts the meat\" and makes them taste far better. Its true form is never known or seen, but it mainly takes the form of a clown named Pennywise, due to the general universal fear of clowns, and its own preference. It took said form upon seeing a performer sometime in the 1800's using the alias and costume. About 300 years after coming to Earth, it would devour Georgie Denbrough after dragging him into a flood grate. Georgie's older brother, Bill Denbrough would form his own \"gang\" named The Losers Club. This group would eventually fight Pennywise, beating it so violently and severely it retreated to go into slumber. 27 years later, It awoke to start feeding again, believing that the club would no longer try to harm it as they were not his ideal prey. The club returned however, wanting to destroy it once and for all. After being unable to stop its killing spree, the club finally fought Pennywise in his \"true form.\" This form is as similar as it can get to how it truly looks before a human goes insane from looking at it. This form, a giant female spider, killed Eddie Kaspbrak before being finally overpowered by the Losers. They broke its legs, beat in its head and \"killed\" the beast by tearing out its heart before crushing it, causing the creature's physical form to die and the deadlights to fade away. == Film and television == The character was portrayed by Tim Curry in the 1990 television adaptation of the same name; and by Bill Skarsgård in the 2017 and 2019 movie adaptation. It: Welcome to Derry, a prequel television series for the streaming service Max based on the first two movies is officially in development, with Skarsgård returning as Pennywise. The modern incarnation of Pennywise, introduced in the 2017 adaptation, appears as a background character in the family friendly live-action/animated movie Space Jam: A New Legacy, which is also distributed by Warner Bros. ==References== Category:Clowns Category:Fictional mass murderers Category:Fictional extraterrestrial characters Category:Fictional demons and devils Category:Monsters Category:Supervillains Category:Characters in written fiction Category:Horror movie characters",
 "title": "It (character)"
}