{
 "id": "57945",
 "text": "The Merovingians were a dynasty of Frankish kings who ruled in the region of ancient Gaul (more or less modern France) from the 5th to the 8th centuries, when the Carolingian dynasty took control. The Merovingians were sometimes referred to by people of the time as the \"long-haired kings\" (Latin reges criniti) since they symbolically had uncut hair (traditionally, the tribal leader of the Franks wore his hair long, and his warriors trimmed theirs short). The term is drawn directly from Germanic, akin to the dynasty's Old English name, Merewīowing. The Merovingian dynasty owes its name to the semi- legendary Merovech (or Merowig, sometimes Latinised as Meroveus or Merovius), the leader of the Salian Franks from c.447 to 457. Clovis I went on to unite most of Gaul north of the Loire under his control around 486, when he defeated Syagrius, the Roman ruler in those parts. ==Related pages== * Franks (main history of Frankish kingdoms) == References == * Beyerle, F and R. Buchner: Lex Ribuaria in MGH, Hannover 1954. * Eugen Ewig: Die Merowinger und das Frankenreich. Stuttgart: Kohlhammer, 2001. * Patrick J. Geary: Before France and Germany: The Creation and Transformation of the Merovingian World, Oxford & New York: Oxford University Press, 1998. * Kaiser, Reinhold: Das römische Erbe und das Merowingerreich, (Enzyklopädie deutscher Geschichte 26) (München, 2004) * Rouche, Michael: \"Private life conquers State and Society\" in Paul Veyne (ed.), A History of Private Life: 1. From Pagan Rome to Byzantium, Cambridge, MA: Belknap Press, 1987. * Werner, Karl Ferdinand: Die Ursprünge Frankreichs bis zum Jahr 1000, Stuttgart 1989. * Oman, Charles: The Dark Ages 476-918, London, 1914. * Wood, Ian: \"The Merovingian Kingdoms: 450-751\", New York: Longman Press, 1994. == Other websites == * The Oxford Merovingian Page . * From Merovingians to Carolingians: Dynastic Change in Frankia . * Dr Deborah Vess: Merovingian and Carolingian bibliography, sources and web links . Category:Royal dynasties Category:History of France Category:Gaul",
 "title": "Merovingian dynasty"
}