{
 "id": "57962",
 "text": "Homelessness means not having a place to stay. The word \"homelessness\" includes people who sleep on the street; people staying at warming centers or homeless shelters; and people living in places not meant for humans to live in (like abandoned buildings, vehicles, and parking garages). Homelessness occurs for many reasons. The risk is especially high when people are unable to buy or maintain housing they can afford. Homeless people live in many parts of the world, including San Francisco in California, Dublin in Ireland and Tallinn in Estonia. International human rights law includes the right to housing. ==Homeless people== === Terms === Academic articles and government reports use the phrase \"homeless people\". However, there are different words to describe homelessness. Some (like \"bum\" or \"vagrant\") are based on stereotypes. Today, some argue that the better term is \"unhoused person\". A 2023 article stated: > The public should stop using offensive labels like “bum,” “homeless guy,” > and “bag lady” to help wipe away negative associations conjured up by these > outdated terms. When we say “homeless,” many thoughts come to mind depending > on who you are and your experience... The same person is viewed differently > depending on how you describe them: “homeless” or “priced out of housing.” Some slang phrases confuse the definition of homelessness. For instance, in slang, a \"vagabond\" is someone who travels without enough money to stay in good hotels. Similarly, police reports sometimes use the word \"transient\" to describe people from out of town or who are passing through. These individuals might in fact be homeless - but they might also have homes elsewhere and are just traveling away from home. === Counts === In the United States, the United States Department of Housing and Urban Development (HUD) requires a homeless \"enumeration\" (count) every two years. They classify \"homeless\" in a careful way, and their definition has been adopted by many other agencies and church groups. In Metro Vancouver, homeless people are counted by the British Columbia (B.C.) Non-Profit Housing Society. The Society conducts the homeless count with the help of about 1,200 volunteers. ==HUD definitions== HUD spreads information about what does and does not work when providing shelter for homeless people. The information about the things that work is called \"best practices\". According to HUD's criteria, a person must lack a fixed, regular, and decent place to sleep at night. Also, they must be living in: # A supervised shelter (including welfare hotels, homeless shelters, warming centers, and transitional housing); OR # A place that provides a temporary residence for people waiting for space in a place like a hospital, jail or hospice; OR # A place that was not designed for humans to live and sleep, like a vehicle, public park or sidewalk. === \"Chronic homelessness\" === HUD defines a person as \"chronically homeless\" if: # The person is \"an unaccompanied homeless individual with a disabling condition\". # The person has been homeless for a year or more; or the person has been homeless four times in the past three years. Studies suggest that the costs of chronic homelessness are far greater than the other types of homelessness. ==Health care== Health care for the homeless is a major public health challenge. === Increased risk === Many homeless people develop serious medical conditions caused at least partially by living in unclean environments, not having places to wash up, and not having medical supplies. Living in a group setting, like a shelter, further increases the risk of infectious disease spreading because people are crowded together. Mental illness, alcohol and substance use disorder are also common problems. Homelessness raises the risk for: * Infectious diseases like Viral Hepatitis (especially Hepatitis C), Tuberculosis (TB), Human Immunodeficiency Virus (HIV), and COVID-19 * Non-infectious diseases like diabetes, heart disease, and chronic lung disease * Injuries and assaults === Skin problems === Skin disorders are also common among homeless people. According to a peer-reviewed article in JAMA Dermatology, homeless people have higher rates of many skin problems: * Skin cancer * Chronic wounds * Fungal infections * Skin problems caused by sexually transmitted infections * Ectoparasitic infections (caused by parasites that live on the skin) * Skin problems caused by injecting illegal drugs (\"shooting up\") * Skin abscesses caused by a bacterial infection from Group A streptococcus Homeless people can experience skin cancer and other conditions when exposed to extreme cold and hot sun. Additionally, it is difficult to find places to shower or wash up. This can contribute to skin conditions or wound infections. === Food scarcity === Many homeless people struggle to find good, affordable food. As a result, they tend to suffer from medical conditions. These conditions can include obesity if a person eats a lot of poor-quality food with empty calories (which is often the most inexpensive form of food available). === Dental problems === Many homeless people also have more severe dental problems than the general population does. Causes include not having access to washrooms for oral hygiene; not having oral hygiene supplies like a toothbrush; not having access to affordable dentistry; and (in some cases) eating too many sweets, which may be the only food available. ==Vulnerability Index== The vulnerability Index is a tool for finding out who among the street homeless population needs health care and housing the most.http://www.endhomelessness.org/files/2061_file_Kanis_handout_vi101.pdf The vulnerability index is the work of Dr. Jim O'Connell of Boston Healthcare for the Homeless. He was concerned about the causes of death of homeless individuals living on the street. A national drive is underway by Common Ground for HUD to do the vulnerability index at the same time as the homelessness count. The Index's supporters say that it will help to get needy individuals off the street.http://www.hud.gov/offices/cpd/homeless/programs/coc/ It has been tried out in various places outside the East Coast, including New Mexico and Santa Monica. ==Main causes== Many reports and studies have examined the main reasons for homelessness. These include: * Lack of affordable housing * Low- paying jobs (up to 40% - 60% of homeless people in the United States have jobs, but still cannot afford housing) * Addiction and lack of needed services * Mental illness and lack of needed services * Domestic violence * Unemployment or underemployment * Social exclusion * Discrimination that lowers self-esteem * Careless lifestyle * Poverty, especially destitution (having no money at all) * Prison release and re-entry into society due to a criminal record that can cause recidivism * Change and cuts in welfare * Natural disasters ===Developing and undeveloped countries=== The number of homeless people worldwide has grown steadily in the past few years. Homelessness is a severe problem in some Third World nations like Brazil, India, Nigeria, and South Africa, with millions of children living and working on the streets there. Homelessness has also become a problem in China, Thailand, Indonesia, the Philippines and Japan. ==History== === England === In the sixteenth century in England, the government tried several strategies to address homelessness. First, they tried giving housing to homeless people instead of punishing them. However, in the eighteenth century, these houses were replaced by workhouses. Soon being homeless became a crime: in 1824 the U.K. government made it illegal to beg or sleep on the street. Workhouses were later replaced by dormitory housing (\"spikes\"). By the early 1930s in England, there were 30,000 people living in these places. === The United States === In the 1980s, in the United States, Congressman Stewart B. McKinney helped to get some new laws passed about homelessness. In 1987, the McKinney-Vento Homeless Assistance Act became law. Organisations in some cities, like New York and Boston, tried to help the growing number of homeless people in a new way. As of 2024, there were 771,400 homeless people in the United States. According to a report by the California State Senate's Housing Committee, as of 2022, there were 181,399 homeless people living in California - 28% of the country's homeless population. === Other countries === Many other countries, towns, and cities have (or used to have) areas where all the poor, homeless, and disabled people live. (\"Skid Row\" in Los Angeles is one example.) In smaller towns, especially during the Great Depression, hobos camped near train tracks and hopped onto trains to get from place to place. Over time, as the number of homeless people grew, many places that had previously allowed homeless people to loiter (like churches, public libraries and public atriums) became stricter. According to the World Population Review, countries with large homeless populations include: * Pakistan: 8,000,000 homeless people (as of 2023) * Syria: 5,300,000 (as of 2023) * Bangladesh: 5,000,000 (as of 2019) * Nigeria: 4,500,000 (as of 2022) * Argentina: 3,600,000 (as of 2020) * Sudan: 3,000,000 (as of 2023) * Nepal: 2,500,000 (as of 2023) * Myanmar: 1,500,000 (as of 2023) * Somalia: 1,400,000 (as of 2023) ==Homelessness in the popular media== === Popular films === * 1966: , an influential film by Ken Loach. It brought awareness to homelessness in the UK and led indirectly to the formation of several charitable organizations and changes in legislation. * 1986. * 1991. * 1994. * 1997. * 2003. , the story of Liz Murray * 2006. , the story of Chris Gardner === Books === * 2005 Without a Net: Middle Class and Homeless (With Kids) in America by Michelle Kennedy === Documentary films === * 1985: , which follows homeless Seattle youth * 1997: , focusing on the homeless people in Montreal, Canada * 2000: , addressing homeless adults living in New York's Amtrak tunnels * 2001: , which follows the lives of homeless children in Bucharest, Romania * 2003: , which addresses homelessness in São Paulo, Brazil. Its English title is \"On the Fringes of São Paulo: Homeless\" * 2004: * 2005: , which follows homeless children in Moscow, Russia * 2005: , tracking what homeless people did if they were given $100,000 and could use it however they wanted * 2007: Easy Street , which addresses homeless people in Florida === TV documentaries === * 1988: === Visual Arts === * 2005: Photographic expose by Michel Mersereau entitled \"Between The Cracks\" ==Related pages== * Refugee * Poverty * Discrimination * Right to housing * Street children * Warming center ==References== ==Further reading== Duke, Alan, \"'Golden voice' Ted Williams departs drug rehab\", CNN, January 25, 2011 ==Other websites== * Homeless Statistics for Australia, Canada, United Kingdom and United States, all data from around the year 2001. * PBS, \"Home at Last?\", NOW series program, first aired on February 2, 2007. The topic was what will most help homeless people reenter the fabric of society. * * Homelessness, Current information on U.S. homelessness written by The Rev. Chuck Currie, former National Coalition for the Homeless board member. * Homelessness in Europe FEANTSA is the European Federation of National Organisations Working with the Homeless is an umbrella of not-for-profit organisations which participate in or contribute to the fight against homelessness in Europe. * Homelessness in Spain News, agenda, documents, multimedia and other info about the homeless people in Spain. * News Positive media coverage of homeless man, a former radio announcer, Ted Williams, who found job offers after being re-discovered while homeless in January 2011, and called \"the man with the golden voice\". * Invisible People a YouTube profile mostly consisting of interviews with homeless people.",
 "title": "Homelessness"
}