{
 "id": "579964",
 "text": "Láadan is a feminist constructed language. Its creator was Suzette Haden Elgin. She believed that Western languages were better for saying what men think than what women think. She created the language to make it easier for women to say what they think. For example, Láadan has many words and suffixes for saying how you feel about what you are saying. It also includes words for saying if you know that what you are saying is true, and if so, how. The language became part of a series of science fiction books, Native Tongue. In the book, a group of women create Láadan as a way to fight a society ruled by men. == Sounds == === Tones === Láadan is a tonal language. Some syllables are said in a higher voice or tone than others. There are two tones: * lo – /lō/ or /lò/, a short, flat, or low tone. Vowels without accent marks (a, e, i, o, u) are said in this tone. * ló – a short, high tone. Vowels with accent marks (á, é, í, ó, ú) are said in this tone. Láadan itself is a three-syllable word, LA-a-dan, where the first syllable is said in a high tone. === Vowels === Láadan has five vowels: * a – like English calm (/ɑ/). * e – like English bell (/ɛ/). * i – like English bit (/ɪ/). * o – like English home (/o/). * u – like English boon (/u/). === Consonants === Láadan does not have the consonants p, t, k, g, or s. The consonants b, d, sh, m, n, l, r, w, y, and h are the same as in English. There is also: * th – always like English think, never like then (/θ/). * zh – like English pleasure (/ʒ/). * lh – there is no English sound like this. To say it, a speaker first places their tongue on the roof of their mouth near the teeth. Then they blow air around their tongue. It sounds like a hiss (/ɬ/). == Rules == Most Láadan sentences have three short words called particles: * a word that says what type of sentence it is. These are like periods, question marks, and exclamation marks, but spoken. They are: ::Bíi: says the sentence is a statement. ::Báa: says the sentence is a question. ::Bó: says the sentence is a command. These are usually not given to anyone other than small children. ::Bóo: says the sentence is a request. These are much more common than commands. ::Bé: says the sentence is a promise. ::Bée: says the sentence is a warning. * a word that says when the sentence is happening. These are: ::ril: says the sentence is happening now (present tense). ::eril: says the sentence happened before now (past tense). ::aril: says the sentence will happen later (future tense). ::wil: says the sentence might happen or should happen (optative). * a word that says whether the speaker knows the sentence is true and why. These are: ::wa: says the speaker knows that the sentence is true because they found it out using their own senses. ::wi: says the sentence is obvious. ::we: says the sentence happened in a dream. ::wáa: says that someone who the speaker trusts told them what is in the sentence. ::waá: says that someone who the speaker does not trust told them what is in the sentence. ::wo: says that the speaker imagined it or made it up. ::wóo: says the speaker does not know whether the sentence is true at all. In Láadan, the verbs come first. Verbs are the same words as adjectives. There are no articles like an or the. The object of a verb has the suffix -(e)th. It usually comes after the subject. The prefix me- says that the subject of a verb is plural. The word ra means the same thing as English not. === Making new words === New Láadan words are made by adding prefixes and suffixes to old words. Each part of a word stays the same when it combines with other parts. Because of this, it is called an agglutinative language. The affixes (prefixes and suffixes) can be used to show feelings and attitudes. Many languages can only show these by tone of voice, body language, or roundabout speech. Affix meaning example (-)lh(-) disgust or dislike hahodimi: \"confused but glad\"; hahodimilh: \"confused and disgusted\" du- to try to bíi eril dusháad le wa: \"I tried to come\" dúu- to try and fail to bíi eril dúusháad le wa: \"I tried and failed to come\" ná- ongoing bíi eril dúunásháad le wa: \"I was trying and failing to come\" -(e)tha owner by nature lalal betha: \"her mother's milk\" -(e)tho owner by law or custom ebahid letho: \"my husband\" -(e)thi owner by chance losh nethi: \"your money (that you won by gambling)\" -(e)the owner for an unknown reason ana worulethe: \"the cats' food\" -id man (otherwise either a woman or person of any gender) thul: \"mother/parent\"; thulid: \"father\" === Pronouns === Pronouns in Láadan are made of many parts. The letter l is used for I and we. The letter n is used for you. The letter b is used for he, she, it, and they. The vowel e usually comes after these letters. a can come after them instead to show that someone is loved. If the person is hated, lhe- can be put before the word. The suffix -zh makes a pronoun plural but less than four. -n makes it plural and greater than four. So lazh means \"we, who are few and loved.\" Lheben means \"they, who are many and who I hate.\" == Other websites == * * Láadan introduction by the author * Láadan lessons * Láadan examples * Lesson One of Láadan Made Easier * Láadan Working Group * How to count in Láadan Category:Constructed languages Category:Feminism Category:Science fiction",
 "title": "Láadan"
}