{
 "id": "580033",
 "text": "\"Shape of You\" is a song by English singer-songwriter Ed Sheeran. It is the first single from his third studio album, ÷ (\"divide\"). It was released on January 6, 2017. \"Shape of You\" has reached number one on the charts of several countries, including entering at the top of the charts in the UK, US, Canada, and Australia. It became Sheeran's first number-one song in the US. Before, he reached number two on the Billboard Hot 100 in 2015 with the single \"Thinking Out Loud\". On Broadcast Music Inc. (BMI), a website that shows the royalties and songwriters/publishers of songs, Sheeran added the songwriters of TLC's \"No Scrubs\" (1999). This is because lines from both songs have a similar rhythm. The song finished as the number-one song of 2017 in the US. ==Composition== The song in in C# minor with a moderate tempo, and chord progression following C#m-F#m-A-B, with a tresillo rhythm. ==Music video== The music video for \"Shape of You\", directed by Jason Koenig, was released on 30 January 2017 and features American actress Jennie Pegouski and retired sumo wrestler Yamamotoyama Ryūta. ==Chart performance== \"Shape of You\" has reached the number one position in 38 countries. It is one of the most successful songs in world history, having charted at the number one position for 10 weeks or more on the national singles charts in 16 countries: Australia, Austria, Belgium, Canada, Denmark, France, Germany, Hungary, Ireland, the Netherlands, New Zealand, Portugal, Sweden, Switzerland, the UK and the USA. The song has charted for 15 weeks on Australia's ARIA Singles Chart, becoming the longest- running number one single on a national singles chart in Australian history - a record that it held until November 2019. In Canada, the song charted at number one for 16 weeks, becoming one of the two longest-running number one singles in Canadian history, with the other being the Black Eyed Peas' 2009 single \"I Gotta Feeling\" - a record that both songs were later equalled with by Luis Fonsi's \"Despacito\" in 2017 and surpassed by Lil Nas X's \"Old Town Road\" in 2019. ==Charts== ===Weekly charts=== Chart (2017–20) Peak position Argentina (Monitor Latino) 2 Brazil Pop Airplay (Billboard Brasil) 1 Brazil Hot Streaming (Pro-Música Brasil) 1 Bulgaria (PROPHON) 1 Chile (Monitor Latino) 4 Colombia (Monitor Latino) 8 Colombia (National-Report) 10 Croatia (HRT) 1 Ecuador (National-Report) 14 Euro Digital Songs (Billboard) 1 Global 200 (Billboard) 86 Greece Airplay (IFPI) 1 Greece Digital Songs (Billboard) 1 Guatemala (Monitor Latino) 4 Latvia (Latvijas Top 40) 1 Lebanon (Lebanese Top 20) 2 Luxembourg Digital Songs (Billboard) 1 Malaysia (RIM) 1 Mexico (Monitor Latino) 4 Mexico Airplay (Billboard) 2 Mexico Streaming (AMPROFON) 2 Netherlands (Mega Top 50) 1 Panama (Monitor Latino) 2 Paraguay (Monitor Latino) 2 Paraguay (SGP) 49 Peru (Monitor Latino) 2 Philippines (Philippine Hot 100) 1 Romania (Airplay 100) Note: User may scroll down the 'Podcasturi' menu to play or download the respective podcast. 1 Russia Airplay (Tophit) 1 Serbia (Radiomonitor) 1 Singapore (RIAS) 23 Slovenia (SloTop50) 1 South Korea International (Gaon) 1 Ukraine Airplay (Tophit) 1 Uruguay (Monitor Latino) 9 Venezuela (Record Report) 68 Venezuela (National-Report) 28 Combined chart entries for original and Zion & Lennox remix Chart (2017) Peak position Colombia (National-Report) 88 Ecuador (National-Report) 15 Venezuela (National-Report) 67 ===Year-end charts=== Chart (2017) Position Argentina (CAPIF) If necessary, click Digital Anual, then click 2017. 3 Argentina (Monitor Latino) 2 Australia (ARIA) 1 Austria (Ö3 Austria Top 40) 2 Belgium (Ultratop 50 Flanders) 1 Belgium (Ultratop 50 Wallonia) 1 Bolivia (Monitor Latino) 19 Brazil (Billboard Brasil Hot 100 Airplay) 1 Canada (Canadian Hot 100) 1 Colombia (Monitor Latino) 12 Costa Rica (Monitor Latino) 22 Denmark (Tracklisten) 1 Dominican Republic (Monitor Latino) 41 Ecuador (Monitor Latino) 16 El Salvador (Monitor Latino) 34 France (SNEP) 1 Germany (Official German Charts) 1 Guatemala (Monitor Latino) 4 Honduras (Monitor Latino) 48 Hungary (Dance Top 40) 4 Hungary (Rádiós Top 40) 1 Hungary (Single Top 40) 3 Hungary (Stream Top 40) 1 Israel (Media Forest) 1 Italy (FIMI) 2 Japan (Japan Hot 100)\"Japan Hot 100 – Year-End 2017\" . Billboard. Retrieved 5 August 2018. 2 Malaysia (RIM) 1 Mexico (AMPROFON) 4 Mexico (Monitor Latino) 4 Netherlands (Dutch Top 40) 1 Netherlands (Single Top 100) 1 Nicaragua (Monitor Latino) 60 Norway (VG Lista) 2 New Zealand (Recorded Music NZ) 1 Panama (Monitor Latino) 8 Paraguay (Monitor Latino) 2 Paraguay (SGP) 49 Peru (Monitor Latino) 5 Poland (ZPAV) 1 Portugal (AFP) 2 Romania (Airplay 100) 1 Slovenia (SloTop50) 1 South Korea (Gaon) 4 Spain (PROMUSICAE) 2 Sweden (Sverigetopplistan) 1 Switzerland (Schweizer Hitparade) 1 Uruguay (Monitor Latino) 20 UK Singles (Official Charts Company) 1 US Billboard Hot 100 1 US Adult Contemporary (Billboard) 2 US Adult Top 40 (Billboard) 1 US Dance Club Songs (Billboard) 1 US Dance/Mix Show Airplay (Billboard) 1 US Mainstream Top 40 (Billboard) 1 US Rhythmic (Billboard) 17 Chart (2018) Position Argentina (Monitor Latino) 42 Australia (ARIA) 25 Belgium (Ultratop Flanders) 41 Belgium (Ultratop Wallonia) 37 Canada (Canadian Hot 100) 39 CIS (Tophit) 29 Denmark (Tracklisten) 23 Estonia (IFPI) 50 France (SNEP) 15 Germany (Official German Charts) 34 Hungary (Dance Top 40) 12 Hungary (Rádiós Top 40) 10 Hungary (Single Top 40) 21 Ireland (IRMA) 34 Italy (FIMI) 60 Japan (Japan Hot 100)\"Japan Hot 100 – Year-End 2018\". Billboard. Retrieved 7 December 2018. 14 Netherlands (Single Top 100) 45 New Zealand (Recorded Music NZ) 20 Portugal (AFP) 24 Russia (Tophit) 91 Slovenia (SloTop50) 25 South Korea (Gaon) 29 Sweden (Sverigetopplistan) 22 Switzerland (Schweizer Hitparade) 13 UK Singles (Official Charts Company) 31 US Billboard Hot 100 71 US Adult Contemporary (Billboard) 15 Chart (2019) Position Australia (ARIA) 75 Denmark (Tracklisten) 84 France (SNEP) 66 Japan (Japan Hot 100) 27 Portugal (AFP) 100 Slovenia (SloTop50) 44 South Korea (Gaon) 94 UK Singles (Official Charts Company) 76 Chart (2020) Position France (SNEP) 150 Japan (Japan Hot 100) 64 ===Decade-end charts=== Chart (2010–19) Position Australia (ARIA) 1 Germany (Official German Charts) 1 UK Singles (Official Charts Company) 1 US Billboard Hot 100 3 US Mainstream Top 40 (Billboard) 1 ===All-time charts=== Chart Position US Billboard Hot 100 9 France (SNEP) 2 == References == Category:2017 songs Category:Pop songs Category:Ed Sheeran songs",
 "title": "Shape of You"
}