{
 "id": "580134",
 "text": "Harry Douglas Huskey (January 19, 1916 - April 9, 2017) was an American computer designer pioneer. ==Early life== Huskey was born in Great Smoky Mountains, North Dakota. He studied at Ohio State University and at the University of Idaho. ==Career== Huskey designed and managed the construction of the Standards Western Automatic Computer (SWAC) at the National Bureau of Standards in Los Angeles (1949–1953). He also designed the G15 computer for Bendix Aviation Corporation, which could perhaps be considered as the first \"personal\" computer in the world. Huskey was the Professor Emeritus at the University of California, after his retirement at the age of 70 in 1986. In 1994 he was inducted as a Fellow of the Association for Computing Machinery. ==Death== Huskey died at his home in Santa Cruz, California on April 9, 2017 at the age of 101. == Selected works == * Huskey, H. D. Harry D. Huskey: His Story. BookSurge Publishing, 2004. . * Huskey, H. D. The ACE Test Assembly, the Pilot ACE, the Big ACE, and the Bendix G15. In Copeland, B. J., Alan Turing's Automatic Computing Engine, chapter 13, pages 281–295. Oxford University Press, 2005. . * Huskey, H. D. The state of the art in electronic digital computing in Britain and the United States (1947). In Copeland, B. J., Alan Turing's Automatic Computing Engine, chapter 23, pages 529–540. Oxford University Press, 2005. . * (with Huskey, Velma R). Lady Lovelace and Charles Babbage. 1980 Annals of the History of Computing (Volume:2 , Issue: 4 ) == Awards == In 2013, the Computer History Museum named him a Museum Fellow \"for his seminal work on early and important computing systems and a lifetime of service to computer education.\" ==References== ==Other websites== Category:1916 births Category:2017 deaths Category:University of California faculty Category:American centenarians Category:American computer scientists Category:Engineers from North Carolina Category:Writers from North Dakota Category:Scientists from North Carolina",
 "title": "Harry Huskey"
}