{
 "id": "580659",
 "text": "Yair Lapid (Hebrew: יאיר לפיד, born 5 November 1963 in Tel Aviv) is an Israeli politician of Yesh Atid (\"There is a Future\"). He was the Prime Minister of Israel from July 2022 to December 2022. He has been the Leader of the Opposition since 2023, serving in this position before from 2020 to 2021. Lapid is the founder and party chair of Yesh Atid. He has been a Member of the Israeli parliament, the Knesset since 2013, and was Finance Minister in the Third Netanyahu Government from 2013 to 2014. From 17 May 2020 to 13 June 2021, he was the Leader of the Opposition. In June 2021, he became the Alternate Prime Minister of Israel and Minister of Foreign Affairs in the Bennett-Lapid Government. On 20 June 2022, then-Prime Minister Naftali Bennett announced that he would call for a vote to dissolve the Knesset and that he would step down as prime minister shortly after the vote. Bennett resigned on 30 June 2022 and Lapid became prime minister on 1 July 2022. During the 2022 Israeli legislative election on 1 November 2022, his Yesh Atid party gained 7 seats, but his coalition partners lost seats, and his government lost the majority in the Knesset. He was succeeded as Prime Minister of Israel by Benjamin Netanyahu on 29 December 2022, and became Leader of the Opposition again. Previously Lapid worked as an actor, journalist, news anchor and television presenter. He has also written several books, including novels, children's books, a thriller and an autobiography. He was also a songwriter for numerous Israeli musicians. Some of the songs he wrote became hits which reached the top of the music charts in Israel. Yair Lapid is the son of the late politician and journalist Tommy Lapid and playwright and novelist Shulamit Lapid. == Related pages == * Bennett-Lapid Government == References == == Other websites == * Bio at Knesset Website * Category:1963 births Category:Living people Category:Alternate Prime Ministers of Israel Category:Current national leaders Category:Government ministers of Israel Category:Israeli journalists Category:Israeli movie actors Category:Israeli opposition leaders Category:Israeli political leaders Category:Israeli television actors Category:Israeli television presenters Category:Jewish Israeli actors Category:Jewish Israeli writers Category:Jewish Israeli politicians Category:Members of the Knesset Category:Actors from Tel Aviv Category:Politicians from Tel Aviv Category:Writers from Tel Aviv Category:Prime ministers of Israel Category:Television news anchors Category:Yesh Atid politicians",
 "title": "Yair Lapid"
}