{
 "id": "580614",
 "text": "The Wikipedia biography controversy, also known as the Seigenthaler incident, was a set of events that began in May 2005. Anonymous Wikipedia editors posted a hoax article in Wikipedia about John Seigenthaler. The article falsely stated that Seigenthaler had been a suspect in the deaths of U.S. President John F. Kennedy and U.S. Attorney General Robert F. Kennedy. ==Hoax== The then-78-year-old Seigenthaler, who was a friend of Robert Kennedy, described the Wikipedia article about him as \"Internet character assassination\". The author of the hoax article was later identified as Brian Chase. On May 26, 2005, Chase added a new article that contained, in its entirety, the following text: > John Seigenthaler Sr. was the assistant to Attorney General Robert Kennedy > in the early 1960s. For a short time, he was thought to have been directly > involved in the Kennedy assassinations of both John, and his brother, Bobby. > Nothing was ever proven. John Seigenthaler moved to the Soviet Union in > 1972, and returned to the United States in 1984. He started one of the > country's largest public relations firms shortly thereafter. The hoax was not discovered and corrected until September 2005. Afterwards, Seigenthaler wrote about his experience in USA Today. The incident raised questions about the reliability of Wikipedia and other websites with user- generated content that lack the legal accountability of traditional newspapers and published materials.\"The State of the News Media 2006.\" The Project for Excellence in Journalism. Retrieved on September 14, 2009. ==Aftermath== In a December 13 interview, co-founder Jimmy Wales expressed his support for Wikipedia policy allowing articles to be edited by anonymous users – describing the participation of editors in China and Iran in terms of privacy issues – but announced plans to roll back their article creation privileges as part of a vandalism-control strategy: \"...we've decided that we want to slow down...so starting in January we're preventing unregistered users from creating new pages, because so often those have to be deleted...\". ==References== ==Other websites== * Is an Online Encyclopedia, Such as Wikipedia, Immune From Libel Suits? by Prof. Anita Ramasastry on Writ * John Seigenthaler, \"Wikipedia, WikiLeaks, and Wiccans\" 49-minute presentation at Vanderbilt University, October 21, 2011, C-Span Video Library * \"Snared in the Web of a Wikipedia Liar\" by Katharine Q. Seelye of The New York Times Category:2005 Category:Wikimedia Category:English Wikipedia",
 "title": "Wikipedia Seigenthaler biography incident"
}