{
 "id": "580956",
 "text": "Allan Holdsworth (6 August 1946 – 15 April 2017) was a British guitarist and composer. He was best known for his work in jazz fusion. ==Career== Holdsworth was known for his knowledge of music, through which he created works in chord progressions and solos. His unique legato soloing technique came from his desire to originally play the saxophone. He also become associated with playing an early form of guitar synthesizer called the SynthAxe, a company which he worked for in the 1980s. ==Influence== Holdsworth has been called as an influence by such renowned rock, metal and jazz guitarists as Eddie Van Halen,Obrecht, Jas (April 1980). \"Young Wizard of Power Rock\". Guitar Player. NewBay Media. Retrieved 30 March 2015. Joe Satriani,Brown, Pete (2007). \"3 Questions – Joe Satriani\". The Punch-In. TrueFire. Retrieved 30 March 2015. Shawn Lane,Hallebeek, Richard (March–April 2001). \"Shawn Lane + lesson\" . richardhallebeek.com. Retrieved 30 March 2015. and Alex Lifeson.Guitar World Staff (12 January 2012). \"Alex Lifeson and Geddy Lee of Rush Choose 22 Songs That Inspired Them Most\". Guitar Player. NewBay Media. Retrieved 2015-03-30. Frank Zappa once called him as \"one of the most interesting guys on guitar on the planet\",Goldwasser, Noë (April 1987). \"Zappa's Inferno\" . Guitar World. NewBay Media. Retrieved 30 March 2015. while Robben Ford has said: \"I think Allan Holdsworth is the John Coltrane of the guitar. I don't think anyone can do as much with the guitar as Allan Holdsworth can.\"Charupakorn, Joe (August 2009). \"Robben Ford: Soul Tones\" (PDF). Guitar Edge. Retrieved 14 July 2016. ==Death== Holdsworth died on 15 April 2017 in Vista, California of a heart attack at the age of 70. ==References== ==Other websites== *Official website Category:1946 births Category:2017 deaths Category:Deaths from myocardial infarction Category:British guitarists Category:British composers Category:British jazz musicians Category:Musicians from Bradford",
 "title": "Allan Holdsworth"
}