{
 "id": "581033",
 "text": "Ironstone china, ironstone ware or just ironstone, is a type of pottery. It is vitreous (glazed or glassy) pottery made in the United Kingdom in the early 19th century. It is not earthenware, but is similar to fine stoneware. There is no iron in ironstone. Its name is got because it is strong and durable. Ironstone was developed in the 19th century by potters in Staffordshire. It sold well as a cheaper alternative to porcelain. Ironstone in Britain's Staffordshire potteries was made by Charles James Mason after his patent of 1813. The name \"ironstone\" later became generally used. The strength of Mason's ironstone enabled the company to produce ornamental objects of large size.\"Mason ware\". Encyclopædia Britannica. Encyclopædia Britannica Online. Encyclopædia Britannica Inc., 2012. Web. 05 Nov. 2012 . Their vestibule vaseswere 1.5 metres high.Fleming, John & Hugh Honour. (1977) The Penguin Dictionary of Decorative Arts. London: Allen Lane, p. 399. Mantelpieces were made from several large sections.Such a mantelpiece may be seen at Caramoor Center for Music and the Arts, near Katonah, New York. Mason's tableware was widely used in hotels and restaurants as well as private homes. It was usual for commercial clients to have the name of their establishment transfer printed onto the stoneware. Mason's was not the only manufacturer. Another high-class pottery was Spode, who made ironstone from 1805 onwards. They had big exports to France, where ironstone was often preferred to faience pottery.Day, Lance and Ian McNeil 2003. Biographical dictionary of the history of technology. Routledge, p1145. ISBN 9780203028292 During the mid-19th century The United states was the largest export market for Staffordshire's potteries. They bought plain white stoneware in huge quantities.Orser Jr. C. 2002. Encyclopedia of historical archaeology. Psychology Press, p337. ISBN 9780415215442 Antique ironstone wares are collectable, and in particular items made by Mason's.The origin of ironstone'. Steve Birks. == References == Category:Pottery",
 "title": "Ironstone china"
}