{
 "id": "581273",
 "text": "Charles Joseph \"Charlie\" Crist Jr. (; born July 24, 1956) is an American attorney and politician. As a member of the Democratic Party, he previously served as a U.S. representative from Florida's 13th congressional district from 2017 to 2022. Crist also served as the 44th governor of Florida from 2007 to 2011. == Political career (1992—2022) == === Member of the Florida Senate (1992–1998) === In 1991, he was elected to the Florida Senate and later assumed the duties as the member of the state senate. Crist served as an member of the senate from 1992 until his term ended in 1998. === Education Commissioner of Florida (2001–2003) === In 2000, he announced his candidacy for education commissioner of the state and assumed office in January 2001. He won the general election in November 2000 and assumed the office and duties as the education commissioner. Crist served as the education commissioner of the state from 2001 until his term ended in January 2003. === Attorney General of Florida (2003–2007) === In 2001, he announced his candidacy for attorney general of the state. He won the election in November 2001, and assumed the office as the 35th attorney general of the state on January 7, 2003. Crist served as the attorney general from 2003 until his term ended in January 2007. === Governor of Florida (2007–2011) === In 2006, Crist announced his candidacy to succeed term limited governor Jeb Bush. He won the election in November 2006, and was sworn in as the 44th Governor of Florida on January 2, 2007. Crist served as the governor of Florida from 2007 until his term ended in January 2011. === United States Representative (2017–2022) === During his early political career, he was formerly a Republican, and later registered as an Independent for two years, until he registered as a member of the Democratic Party in 2012. In October 2015, he decided to run as a U.S. representative for Florida 13th congressional district. In November 2016, he won the election and later assumed the office and duties as a state representative. Crist served from 2017 until he resigned in August 2022. === Gubernatorial campaigns === In 2013, he announced his candidacy for a non- consecutive term to succeed then-governor Rick Scott. Crist chosen state congresswoman. Annette Taddeo as his running mate for lieutenant governor. In August 2014, he won the democratic primary and nomination. In November 2014, he lost the election to incumbent governor Rick Scott. In mid April 2021, Crist officially announced on a news interview, his candidacy for governor again to non-consecutive term to unseat Ron DeSantis. Crist chosen schoolteacher, Karla Hernandez-Mats as his running mate for lieutenant governor. In August 2022, he had officially won the democratic primary and nomination. On November 8. 2022, he lost the election to incumbent governor Ron DeSantis and also defeated in a landslide victory margin. ==Ambassadorship nomination== On June 7, 2023, the White House announced that President Joe Biden had nominated Crist for the position of United States Ambassador to the International Civil Aviation Organization, a United Nations agency. == Marriage and personal life == Crist was married to Amando Marrow for only a year until they divorced in 1980. He remarried Carole Rome in 2008 and was married for nine years until they divorced in 2017. While campaigning for governor in 2022, he revealed that he is engaged to a woman named Chelsea Brimes. Crist now officially has six stepchildren with his fiancee. ==References== == Official websites == * https://clerk.house.gov/members/FL13/vacancy * https://charliecrist.com/ * https://dos.myflorida.com/florida-facts/florida-history/florida- governors/charlie-crist/ * https://www.nga.org/governor/charlie-crist/ Category:1956 births Category:Living people Category:Lawyers from Pennsylvania Category:Governors of Florida Category:United States representatives from Florida Category:Democratic Party (United States) politicians Category:Republican Party (United States) politicians Category:21st-century American politicians Category:20th-century American politicians Category:Florida attorneys general Category:Florida State University alumni Category:Politicians from Altoona, Pennsylvania Category:Members of the Florida Legislature",
 "title": "Charlie Crist"
}