{
 "id": "581217",
 "text": "Saparman Sodimejo (31 December 1870 - 30 April 2017), popularly known as Mbah Gotho, was an Indonesian man who gained attention for his claim of having lived over 140 years. Although there is no conclusive evidence to verify his exact age, The Indonesian Government reportedly recognized him as one of the oldest individuals based on an issued ID card. Mbah Gotho's recollection of his birth date was uncertain, but he vividly remembered the construction of a sugar factory in 1890. In 2010, local authorities registered him as being over 140 years old, and in 2014, he was issued an ID card with a recorded birth date of 1870. It is worth noting that if Gotho’s reported age was true, he would have been the oldest person ever recorded, surpassing the final age of Jeanne Calment of France, who lived to be 122 years and 164 days old, making her the world’s oldest woman ever recorded, surpassing the final age of Jiroemon Kimura of Japan, the first recorded person and man to reach the age of 115, which would’ve been before Augusta Holtz of Germany and Christian Mortensen of Denmark both turned 115, as well as the last recorded living man born in the 19th century, following the death of Kimura, as well as being the last living person born in 1800s,following the death of Emma Morano of Italy, and one of three remaining people born during the 19th century at the time of his death, alongside Violet Brown of Jamaica and Nabi Tajima of Japan. == Claim == In May 2010, Solopos reported that the census had recorded his next birthday as his 142nd. This would have made him 19 years older than the oldest recorded person, Jeanne Calment, who was 122 years old when she died in 1997. The Liputan 6 website reported that Mbah Gotho's estimated age was 140. He could not remember his date of birth, but claimed to remember the construction of a sugar factory built in Sragen in 1890. In August 2016, after a television report on Liputan 6, numerous international media outlets reported Gotho's claim. They then showed photographs of his ID card (issued in 2014), which displays his claimed birth date. Although Indonesian officials at the local record office confirmed the birth date there is no independent proof of his claimed age. That would have been required for the claim about the age to be recognised by record authorities, such as Guinness World Records. The Indonesian government did not register births before 1900, and there have been errors in the past. The Gerontology Research Group commented that this extremely high claimed age was \"fiction\" and \"unbelievable\". The story on Liputan 6 noted other similar claims about age. That included a woman named Maemunah and known as Ambu Unah, who had been claimed to be born in 1867, in Cimanuk, Pandeglang Regency. == Death == On 28 April 2017 Mbah Gotho was admitted to RSUD Hospital for heart failure in Sragen and died two days later at 5:45 pm local time on 30 April 2017. According to the BBC, he outlived ten siblings, four wives, and all of his children. == Related pages == * Carmelo Flores Laura * Luo Meizhen == References == Category:1870 births Category:2017 deaths Category:Deaths from heart failure Category:Indonesian people Category:Supercentenarians Category:Longevity claims",
 "title": "Mbah Gotho"
}