{
 "id": "581647",
 "text": "DYSS-TV (channel 7) is a television station in Metro Cebu, Philippines, serving as the Visayas flagship of the GMA network. It is owned and operated by the network's namesake corporate parent alongside GTV outlet DYLS-TV (channel 27). Both stations share studios at the GMA Skyview Complex, Nivel Hills, Apas, Cebu City, while DYSS-TV's hybrid analog and digital transmitting facility is located atop Mt. Busay, Brgy. Bonbon. ==Timeline== *November 20, 1963 - The origin of GMA Cebu can traced back to radio station in Cebu, DYSS (1560 kHz (now 999 kHz) AM band), which began airing its radio operations on July 4, 1957, and launched its first provincial AM station in Cebu City. DYSS was then owned by GMA Network's predecessor Loreto F. de Hemedes Inc. through DZBB in Manila, later Republic Broadcasting System, Inc. of Robert \"Uncle Bob\" Stewart. Upon the launch, their old studios of radio operation in Fortunata Bldg., at the corner of Magallanes & Lapu-lapu Sts., with the location of 1-kilowatt BC Gates Transmitter is at Mambaling Seaside. After the success of its radio station, the company ventured into television and started operations as DYSS Channel 7 Cebu. With this venture, DYSS-TV Channel 7 became the third VHF television station established in Cebu City after the establishment of provincial stations of ABS Channel 3 (owned by ABS-CBN's predecessor Alto Broadcasting System) and ABC Channel 11 (owned by the Associated Broadcasting Corporation) which began its broadcasts on June 14, 1961, and September 11, 1963, respectively. The original studios and transmitters of TV operations were inaugurated since then at the 10/F Luym Bldg. (now Ludo and Luym Bldg.) along Plaridel cor. Juan Luna Sts. (now Osmeña Blvd.) and at that time, the station broadcast with a power output of 5,000 watts. *March 1, 1969 - RBS was then known as \"Greater 7 Cebu\", using the Circle 7 logo that ABC was using for all of its owned-and-operated stations at the time. The station's programming is composed of canned programs from the United States and it later produced local programs. *September 21, 1972 - Following the proclamation of Martial Law by dictator Ferdinand Marcos, DYSS-TV was forced to shut down, though it only lasted for more than 3 months. In December of that year, DYSS-TV (along with the flagship station in Manila, DZBB-TV) was given the green light by the National Media Production Center (NMPC) to return on the air, however with limited three-month permits. *1974 - RBS were sold to a triumvirate composed of Felipe Gozon, Gilberto Duavit Sr., and Menardo Jimenez. Under the new management, DYSS-TV reopened with a new identity as GMA Radio-Television Arts and introduced the Where You Belong slogan to catch the attention of local viewers. Despite its network rebranding, Republic Broadcasting System, Inc. remained as its corporate name fourteen years later. The relaunch of GMA, aside from sporting a light blue square logo with the network name in white, also had a circle 7 logo in use. In its final years, the blue circle 7 logo used was similar to those used by the ABC in some United States cities (later used the rainbow colors of red, yellow, green and blue stripes, as GMA prepares for a network reformatting). Following that year, DYSS-TV was converted into an originating station with its English local news bulletin \"GMA News Digest Cebu\", a local newscast which served as affiliate to GMA News Roundup (later GMA News Digest). *1979 - GMA News Digest Cebu was relaunched and became News at Seven Cebu, following the launch of GMA's flagship newscast News at Seven which premiered on November 1, 1976, to face the increasing competition of its English local newscast GTV-3's News Today (now Newscenter 3 Cebu in 1980 and then went defunct), which debuted in 1978. *January 20, 1980 - DYSS-TV launched its first live coverage of Sinulog Festival with its first location in Plaza Independencia, Cebu City. This was the same year that it premiered Goot da Wanderpol, the channel's first local drama production in the Cebuano language. With this premiere, the local drama series was syndicated by its sister station in Davao. *1981 - To serve local viewers further, DYSS-TV launched its first ever Cebuano language newscast, Mga Balita sa Kilum-Kilum, as well as a local business show to promote Cebuano entrepreneurs. *1990 - DYSS-TV transferred its studios and transmitter to new facilities located at GMA Skyview Complex in Nivel Hills, Apas for better broadcast equipments and an upgraded transmitter tower, with increased transmitting power output to 50 kW (259 kW ERP) to replace an old 5-kilowatt TPO located at the Luym Bldg. in Plaridel St. for 3 decades. The transmitter upgrades resulted in clearer and better signal reception in Metro Cebu, and the Central and Eastern Visayas. *1992 - DYSS-TV commenced its first relay station in Eastern Visayas via TV-10 Tacloban with a power capacity of 5,000 watts to covering Tacloban City, and was the first television station to operating as a semi-satellite of GMA Radio-Television Arts in the Leyte area/provinces, which opened in 1987. *April 30, 1992 - as part of the network's expansion of coverage which started exactly four years after with the inauguration of the network's Tower of Power in its flagship station in Manila (based in Quezon City), DYSS-TV was launched as the Rainbow Satellite network. Through its nationwide satellite broadcast, GMA's national programmings were seen across the Philippine archipelago and Southeast Asia resulting in DYSS becoming a relay (satellite-selling) station of the network's flagship station DZBB-TV Channel 7 Manila to reach Cebuano viewers around the Central Visayas region, Leyte and Samar, while retaining local programming to match up with its rivals. With the launch, GMA utilizes a new logo to correspond with the rebranding and a satellite-beaming rainbow in a multicolored striped based on the traditional scheme of red, orange, yellow, green, blue, indigo and violet, with GMA in a metallic form uses a San Serif Futura Extra Bold and analogous gloominess of Indigo as its fonts in the letters. GMA was the official broadcaster of the 1995 World Youth Day, which was the last visit of Pope John Paul II to the country. *May 16, 1996 - Republic Broadcasting System formally changed its corporate name to GMA Network Incorporated, with GMA now standing for Global Media Arts. *October 4, 1999 - Balitang Bisdak, the channel's first local newscast was launched as the first regional newscast of GMA Network in Visayas with Bobby Nalzaro as its sole anchor, two years after he was resigned with Bombo Radyo Cebu in 1997 and joined with GMA Cebu as regional news anchor and chief operations officer of DYSS Super Radyo Cebu, which covering the Metro Cebu area. This was on October 24 of the same year that it launched \"Singgit Cebu\", the channel's musical variety show and taped-as-live alternately from SM City Cebu. During that time, GMA Channel 7 Cebu produced Cebuano drama series Ang Bastonero. The series also began to simulcasting on the network's sole station in Mindanao TV-5 Davao. *2005 - \"Balitang Bisdak\" and \"Singgit Cebu\" were re-launched and were taken under the wing of GMA News & Public Affairs and GMA Entertainment TV Group respectively. In October of that year, GMA Entertainment TV Group in Cebu re-launched \"Oi!\", a local variety show which saying it was dynamic, interactive and stylish, leveling to the standards of GMA-7's now-defunct variety show SOP. *October 8, 2007 - GMA News & Public Affairs Cebu's local morning show Buena Mano Balita was launched, with Alan Domingo, Yuri Deldig, Cheryl Pelayo-Dacua, Bobby Nalzaro, Mark Anthony Bautista and Fr. Dan delos Angeles as its anchors, which patterned from its flagship morning news program Unang Hirit. Almost 5 years after it launched, Buena Mano Balita became the #1 morning entertainment and news shows, gathering a TV Rating of 12.5%, while its competitor Maayong Buntag Kapamilya of ABS-CBN Cebu, which launched earlier in 2005, only received 5.8%. *November 12, 2007 - GMA Cebu and Television And Production Exponents Inc. (TAPE) launched its first ever regional version \"Eat Na Ta!\", which was a daily game show on radio through Super Radyo DYSS 999 kHz aired during weekdays, and later evolved into a live TV program every Saturdays. It served as a pre-programming for Eat Bulaga! in Visayas until 2008. *2010s - GMA Cebu upgraded to its transmitter tower and equipment, and the opening of a 60,000 watts transmitter power output (TPO) in Mt. Busay, Brgy. Bonbon, resulting in improved signal quality throughout Central and Eastern Visayas. *November 10, 2014 - as part of their changes of graphics and theme music of the network's flagship evening newscast 24 Oras, GMA News & Public Affairs Cebu was re-launched and adopted the branding of its flagship regional newscast \"24 Oras Central Visayas\". *April 24, 2015 - Buena Mano Balita suddenly got cancelled without saying goodbyes, which had their final broadcast for more than 7 years, following the strategic streamlining of programs and manpower in its provincial stations after the broadcast, the hosts and on-air staff of BMB were retrenched by GMA Network management. *February 1, 2016 - Just after more than a year hiatus, GMA News & Public Affairs Cebu's flagship regional newscast 24 Oras Central Visayas reverted to the original title Balitang Bisdak, together with GMA Dagupan's Balitang Amianan and GMA Davao's sole flagship regional newscast 24 Oras Davao. Follow the return, DYSS became the oldest local newscast of GMA Network in the Central and Eastern Visayas since its premiere in October 1999. *November 13, 2017 - Following the newly-launched of GMA Regional TV division, Balitang Bisdak was relaunched similar to sister newscasts Balitang Amianan (which later relaunched One North Central Luzon since 2022) and newly-launched One Mindanao as part of the new development, which will be simultaneously broadcast in key cities and provinces in Central and Eastern Visayas through GMA Network's local channels, which is composed of TV-10 Tacloban, TV-11 Bohol and TV-12 Ormoc. *May 23, 2018 - GMA Cebu commenced its ISDB-T digital test broadcasts on UHF Channel 26, with an increasing power of 15,000-watt (77,700-watt ERP) covering Metro Cebu and the provinces of Cebu, Negros Oriental and Bohol, as well as several parts of Leyte and Samar. *April 20, 2020 - GMA Cebu launched its first ever morning program GMA Regional TV Live! with Nikko Sereno and Cecille Quibod-Castro as its hosts. This also marked the return of GMA Regional TV's producing morning news program five years after its predecessor Buena Mano Balita went off the air. *June 29, 2020 - GMA Cebu temporarily taken over by GMA TV-6 Iloilo with One Western Visayas airing in Cebu and the rest of Central and Eastern Visayas following GMA Regional TV's decision to suspend the station's program production due to the increasingly intense situation in Cebu City caused by the COVID-19 pandemic. The setup ended on July 10, when the program returned on July 13. *May 3, 2021 - Balitang Bisdak expands its simulcast on TV-5 Dumaguete, TV-5 Calbayog and TV-8 Borongan. *December 16, 2021 - GMA Cebu suspended its operations for the second time following the aftermath of Typhoon \"Rai\" (Odette) at the evening, which damaged electrical lines and the trees near GMA Complex and its transmitters brought about by the typhoon. A day later, it returned on-air with limited broadcast to four hours a day operations (4:00-8:00 p.m.) for emergency broadcast. *January 12, 2022 - The program resumed operations after power was restored in Brgy. Apas and thus resuming the production of GMA's local programs and religious shows; much of the program line-up are carried from its flagship station in Quezon City via satellite. Following that day, GMA Cebu reclaimed 18–19 hours of the broadcast daily, reducing primetime telecasts to the 6:30 to 11:30 p.m. block since the amid of Typhoon Rai a month ago. Few weeks later from now, the station completed the returned to its regular daily broadcasting hours that originating from GMA-7 Manila. *July 10, 2023 - GMA Cebu, together with the network's other regional stations, have switched its airing of aspect ratio format quality on the channel feed and its local programming to Anamorphic widescreen ratio format (16:9). On the same day, DYSS-TV's digital signal downgraded its power output to 10,000-watt. ==GMA Cebu local programmings== As of April 20, 2020, DYSS-TV currently produces around 9 hours and 30 minutes of local programming. However, the station does not produce nor distribute local contents to its coverage area on weekend (although the station aired local advertising), with exceptions of The Word of God Network; which airing every Sundays, and major events held in the city covered by GMA Regional TV. During Paschal Triduum of the Holy Week annually, DYSS-TV closed down its regional operations, when it report to a direct satellite station of DZBB-TV in Metro Manila broadcasting the national programming schedule. ===Current=== * Balitang Bisdak * Word of God Network * GMA Regional TV Live! * Sunday Catholic TV Mass Cebu (produced in cooperation with Daughters of St. Paul - Cebu) * Sinulog Festival (annually, every 3rd Sunday of January) ===Formerly-produced or distributed programs=== * 24 Oras Central Visayas * Ang Bastonero (1999-2000) (also aired on GMA Davao) * Araguy * Buena Mano Balita * Coffee with Us (1978–1981) * Eat Na Ta!Eat Na 'Ta, December 29, 2007 episode * GMA Musicale * GMA News Cebu * Istayl Nato *Central Visayas Isyu Karon * Ka Ina (first broadcast on Citynet 27 Manila (now GTV)) * Kape at Balita * Let's Fiesta * Mga Balita sa Kilum-Kilum (1981–1986) * News at Seven Cebu (1978–1999) * News Digest Cebu (1974–1978) * Oi! * Sabado Box Office Hits * Holy Mass * Siete Palabras @ Cebu Metropolitan Cathedral (every Good Friday) * Siete Palabras (annually, every Good Friday, produced in cooperation with Archdiocese of Cebu) * Goot da Wanderpol (also aired on SBN-GMA TV-7 Davao) (1980-1985) * Singgit Cebu (1999–2005) * The Visayan Agenda (special programming for 2010 elections) * Visita Iglesia ==Digital television== ===Digital channels=== DYSS-TV's digital signal operates on UHF channel 26 (545.143 MHz) and broadcasts on the following subchannels: Channel Video Aspect Short name Programming Note 7.01 480i 16:9 GMA GMA Cebu (Main DYSS-TV programming) Commercial broadcast (10 kW) 7.02 GTV GTV 7.03 HEART OF ASIA Heart of Asia 7.04 HALLYPOP Hallypop 7.05 I HEART MOVIES I Heart Movies 7.06 PINOY HITS Pinoy Hits 7.07 (UNNAMED) Unknown Test Broadcast 7.31 240p GMA 1SEG GMA Cebu (relay station of DZBB-TV Manila) 1seg broadcast ==Current Personalities== *Cecille Quibod-Castro, Co-Anchor of Balitang Bisdak and National Anchor of Regional TV News. *Alan Domingo, Co- Anchor and Regional Correspondent of Balitang Bisdak *Lou Anne Mae Rondina, Regional Correpsondent of Balitang Bisdak and Host of GMA Regional TV Live!. *Nikko Sereno, Host and Regional Correspondent of GMA Regional TV Live!. *Fe Marie DumabocOne Western Visayas: May 11, 2021One Western Visayas: May 12, 2021One Western Visayas: May 13, 2021One Western Visayas: May 14, 2021 ===Former personalities=== *Pablito \"Bobby\" Nalzaro† *Atty. Rose Versoza *Monching Auxtero *Ana Desamparado *Ara Labra *Jun Veliganio *Mark Anthony Bautista *Bexmae Jumao-as *Greggy Magdadaro *Ching *Lalaine G *Aynee Triumfante *Vic Serna *Ademar Ochotorena *Chona Carreon – Senior Correspondent *Lian Sinculan (now with DYRB Radyo Pilipino 540 Cebu) *Yuri Deldig a.k.a. Yuri Richards† – House Attack segment reporter *Victor Camion – Dumaguete correspondent (now with 89.5 Brigada News FM Dumaguete) *Leo Udtohan – Bohol correspondent (now with 90.3 Radyo Bandera News FM Bohol) *Ronnie Roa – Leyte correspondent ==Areas of coverage== * Cebu City * Cebu * Portion of Bohol * Portion of Negros Oriental * Portion of Leyte ==Rebroadcasters== DYSS-TV's programming is relayed to the following stations across the Central Visayas, and most of the Eastern Visayas. Station Location Channel TPO DYVB-TV Borongan 8 (VHF) 1 kW (25 kW ERP) DYAS-TV Calbayog 5 (VHF) 1 kW (15 kW ERP) D-5-YB-TV Dumaguete 5 (VHF) 1 kW D-11-YE-TV Tagbilaran 11 (VHF) 2 kW (10.39 kW ERP) DYIL-TV Ormoc 12 (VHF) 1 kW DYCL-TV Tacloban Analog: 10 (VHF) Digital: 34 (UHF) 5 kW 10 kW ==Related pages== *DZBB-TV *GMA Network *List of GMA Network stations ==References== ==Other websites== *GMANetwork.com Category:Filipino television stations Category:1963 establishments in Asia Category:1960s establishments in the Philippines",
 "title": "DYSS-TV"
}