{
 "id": "58185",
 "text": "Sean Paul Ryan Francis Henriques (born 9 January 1973) is a Jamaican deejay, singer, and rapper. Sean Paul appeared as himself in the 1998 movie Belly. In 2000 he released his first album, Stage One. In 2003 Sean Paul had his first number one single. He was featured on Beyoncé Knowles' 2003 number one single \"Baby Boy\". In 2003 he also rapped on Blue Cantrell's UK number one single \"Breathe\". In 2006 Sean Paul rapped in Rihanna's single \"Break It Off\". He rapped on Pitbull's 2011 single \"Shake Señora\" with T-Pain. Sean Paul's sixth album Full Frequency will be released on February 18, 2014. The first single off the album, \"Other Side of Love\", was released to iTunes on September 10, 2013. It reached number one in the UK R&B; Chart. Full Frequency includes songs with Nicki Minaj, 2 Chainz, Juicy J, and Iggy Azalea. Filmography == Discography == * Stage One (2000) * Dutty Rock (2002) * The Trinity (2005) * Imperial Blaze (2009) * Tomahawk Technique (2012) * Other Side of Love (2014) == Filmography == Films & TV Year Title Role Notes 1998 Belly Self Uncredited == Awards == * 2004: Grammy Award - Best Reggae Album (Dutty Rock) * 2005: Billboard Music Award - Best selling Reggae Artist of the Year * 2005: Billboard Music Award - Top Selling Reggae Album of the Year (The Trinity) * 2006: Priya Awards - Best Hardman * 2006: American Music Awards- Favorite Pop/Rock Male Artist * 2006: Billboard Music Awards - Hot 100 single of the year \"Temperature\" * 2007: Jamaican Awards - Best male reggae singer * 2012: MTV Video Music Awards Japan - Best Reggae Video * 2012: MOBO Awards - Best Reggae Act * 2013: MOBO Awards - Best reggae act ==References== == Other websites == * Official site * Category:1973 births Category:Living people Category:Atlantic Records artists Category:Grammy Award winners Category:Water polo players Category:Pop singers Category:Rappers Category:Reggae singers Category:Musicians from Kingston, Jamaica Category:Sportspeople from Kingston, Jamaica Category:21st-century musicians Category:21st-century singers",
 "title": "Sean Paul"
}