{
 "id": "581890",
 "text": "The Spokan or Spokane people are a Native American tribe. They live in the eastern part of present-day Washington state and parts of northern Idaho in the United States of America. The current Spokane Indian Reservation is in northeastern Washington, centered at Wellpinit (Sčecuwe).Spokane Tribe Language and Culture The reservation is almost entirely in Stevens County. However, it also includes two small bits of land (totaling about ) in Lincoln County. This includes part of the Spokane River. In total, the reservation is about . The city of Spokane, Washington (Sʎˈetkʷ) is named after the tribe. It grew along the Spokane River, within the historic ancestral land of the tribe, but not in the reservation. ==References== * Clark, Ella. Indian Legends of the Pacific Northwest. Berkeley: University of California Press, 1953. Print. * Fisher, Andrew H. \"Dreamer Cult.\" Encyclopedia of American Indian History. Ed. Bruce E. Johansen and Barry M. Pritzker. Vol. 2. Santa Barbara, CA: ABC- CLIO, 2008. 380-381. Gale Virtual Reference Library. Web. 23 May 2016. * Pritzker, Barry M. A Native American Encyclopedia: History, Culture, and Peoples. Oxford: Oxford University Press, 2000. . * Pritzker, Barry M. \"Spokanes.\" The Encyclopedia of North American Indian Wars, 1607-1890: A Political, Social, and Military History. Ed. Spencer C. Tucker, James Arnold, and Roberta Wiener. Vol. 2. Santa Barbara, CA: ABC-CLIO, 2011. 752-753. Gale Virtual Reference Library. Web. 23 May 2016. *Ruby, Robert H and Brown, John A. The Spokane Indians: Children of the Sun. Norman: University of Oklahoma Press, 1970. Print. *Spokane Reservation, Washington United States Census Bureau ==Other websites== *Spokane Tribe of Indians, official site *History and Culture, presented in the Website of the Wellpinit School District *Spokane Tribe of Indians Language Program * *The Spokan Indians, by John Alan Ross, published 2011, , the definitive ethnography * Spokane Salish Blog Category:Native Americans",
 "title": "Spokane Native Americans"
}