{
 "id": "581918",
 "text": "Dante Parini (Milan, 21 November 1890 – Milan, 11 April 1969) was an Italian painter and sculptor. == Biography == Parini studied at Accademia di Brera under the guidance of masters such as Enrico Butti along with Giannino Castiglioni with whom she shared ideas and projects becoming her friend.Alfonso Panzetta, Nuovo dizionario degli scultori italiani dell'Ottocento e del primo Novecento: da Antonio Canova ad Arturo Martini (Dante Parini), Volume 2, AdArte, 2003 Parini left for the front of World War II where he was decorated for heroic acts. He was a sculptor of monuments to the fallen soldiers of world wars and burial monuments, Corriere Milano: ultime notizie Milano e provincia «Monumentale, tombe saccheggiate, e ora si pensa ad una class action» Corriere della Sera following the example of his Butti master with great technical skill and personal style. It is its fountain-monument made in 1924 in Piazza Gran Paradiso in Milano in memory of the fallen of Niguarda.A. Anselmi, Milano storica: nelle sue vie, nei suoi monumenti , Hoepli (casa editrice), 1933 Amongst others are the monuments to the fallen of Tarquinia, a work inspired by profound sentiment and suffering humanity, and the monument to the soldiers fallen into Induno Olona war. Some of his works are in the Monumental Cemetery of Milan, in Sanctuary of San Felice (Parabiago), and in the cemetery of Sarzana. He made a marble bas- relief in the church of Santa Maria at the Maggiore Hospital at Ca 'Granda in Milan with a subject \"The healings of Christ\".Niguarda e l'arte, Francesco Wildt: “La Guarigione Dello Storpio” Several of his works are preserved at the Ospedale di Niguarda, known as \"the City of art\". In 1882 Dante Parini took part in the second competition for the execution of the sculptures of Vittoriano \"Altar of the Homeland\" in Rome, but his project was not chosen. Dante Parini also devoted himself to painting. During his long life he participated in several international exhibitions.Vincenzo Vicario, Gli scultori italiani dal Neoclassicismo al Liberty: L-Z (Dante Parini), Volume 2, Pomerio, 1994 In 1924 he received the Diploma of Honorary Member of the Accademia di Brera. He was the first mayor of Brusimpiano after the end of World War II. ==Related pages== * List of Italian painters == References == == More reading == * Carlo E. Accetti, Il Libro italiano: rassegna bibliografica generale, Librerie Ulpiano, 1942 * Carlo E. Accetti, Biografia Dante Parini, Tipografia sociale, Monza, 1942 * Arduino Anselmi, Milano storica: nelle sue vie, nei suoi monumenti, Hoepli (casa editrice), 1933 * Giacomo C. Bascapè, La Raccolte d'arte dell'Ospedale Maggiore di Milano dal XV al XX secolo, Silvana Editoriale, 1956 * Alfonso Panzetta, Nuovo dizionario degli scultori italiani dell'Ottocento e del primo Novecento: da Antonio Canova ad Arturo Martini (Dante Parini), Volume 2, AdArte, 2003 * Vincenzo Vicario, Gli scultori italiani dal Neoclassicismo al Liberty: L-Z (Dante Parini), Volume 2, Pomerio, 1994 == Other websites == * Schede oggetti ed opere d'arte di Parini Dante, Ministero dei Beni Culturali, Istituto Centrale per il catalogo e la documentazione * Bianca Maria Visconti di Parini Dante, Lombardia Beni Culturali * Monumento sepolcrale - Monumento Famiglia Pini-Defendini di Parini Dante, Lombardia Beni Culturali * Ritratto di Bianca Maria Visconti di Parini Dante, Lombardia Beni Culturali * Studio di ramo con foglie dal vero di Dante Parini, Società Operaia di Mutuo Soccorso di Viggiù, Lombardia Beni Culturali * Raccolta d'arte Museo del Policlinico di Milano Category:1884 births Category:1971 deaths Category:Italian architects Category:Italian sculptors Category:Painters from Milan",
 "title": "Dante Parini"
}