{
 "id": "582229",
 "text": "The Casimir effect (predicted by Hendrik Casimir in 1948) is the attraction of two metal plates in a vacuum. This effect occurs because of a side effect of the quantum uncertainty principle, where 'virtual' particles cause the plates to be slightly pushed towards each other. == Relationship to quantum uncertainty principle == The quantum uncertainty principle says that particles, fields, etc. have two values, and that the more accurately you measure one, the less accurately you can measure the other. If a space was completely empty, we would know that the field's magnitude and its rate of change would both be zero. That would violate the uncertainty principle. Therefore, there must actually be tiny fluctuations in the space even though it seems empty. These fluctuations take the form of virtual particles, which we can't detect directly. However, we can see the effects they have on real particles. Some of the particles are virtual photons, which can also be considered waves. There is a very short distance between the reflective metal plates used in the experiment, so only certain virtual photons can fit between them. If the distance divided by the wavelength equals a whole number, that virtual photon will fit. If it's not a whole number, the peaks and troughs of the waves will eventually sync up and cancel out, so that virtual photon won't fit. Since there are fewer virtual particles on the inside of the plates than the outside, there is a greater force on the outside of the plates. This causes the plates to be pushed inwards. == Negative spacetime == The energy density of the universe is zero. This is because every particle has positive energy, but it also has gravity, which balances it out with negative gravitational energy. Since there are fewer virtual particles within the plates, that means that the energy density of the spacetime between the plates must be less than the energy density of spacetime outside the plates. However, since the energy density of the spacetime outside the plates is zero, that means that the energy density of the spacetime between the plates is less than zero, or negative. Negative spacetime has odd properties, such as being saddle-shaped and allowing travel into the past. == References == Category:Quantum mechanics",
 "title": "Casimir effect"
}