{
 "id": "582488",
 "text": "The following is a list of notable deaths in May 2017. For notable deaths before the current month, please see \"Previous months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non- humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==May== ===1=== *Yisrael Friedman, 94, Israeli rabbi and educator.Rabbi Yisroel Shalom Yosef Friedman passes away (death announced on this date) *Bruce Hampton, 70, American musician (Hampton Grease Band, Col. Bruce Hampton and The Aquarium Rescue Unit) and actor (Sling Blade), heart attack.Col. Bruce Hampton Collapses Onstage Dead At 70 *Erkki Kurenniemi, 75, Finnish musician and designer.Elektronisen musiikin uranuurtaja Erkki Kurenniemi on kuollut *Mike Lowry, 78, American politician, member of the U.S. House of Representatives from Washington's 7th congressional district (1979–1989) and Governor of Washington (1993–1997), complications from a stroke.Former Washington Gov. Mike Lowry, Also a Congressman, Dies *Sam Mele, 95, American baseball player (Boston Red Sox, Washington Senators, Chicago White Sox) and manager (Minnesota Twins).Former Red Sox player, scout Sam Mele dies at 95 *Karel Schoeman, 77, South African novelist (Promised Land) and translator, suicide by starvation.South African author Karel Schoeman commits suicide, leaving note to describe motive and method *Mohamed Talbi, 95, Tunisian historian, President of the Tunisian Academy of Sciences, Letters, and Arts (2011–2012), respiratory failure.Décès du penseur Mohamed Talbi ===2=== *Harold Bedoya Pizarro, 78, Colombian military commander and politician, Commander of the National Army of Colombia (1994–1996), lymphoma.Muere excomandante de las FFMM de Colombia y dos veces candidato presidencial *Abelardo Castillo, 82, Argentine author and essayist, pneumonia.Murió el escritor Abelardo Castillo *Kevin Garcia, 41, American bassist (Grandaddy), stroke.Kevin Garica – Grandaddy bassist & co-founder dies at 41 *Roy Gater, 76, English footballer (Port Vale, Bournemouth & Boscombe Athletic, Crewe Alexandra).Club statement: Roy Gater *Heinz Kessler, 97, German politician and military officer, East German Minister of National Defence (1985–1989). *George Hugh Niederauer, 80, American Roman Catholic prelate, Bishop of Salt Lake City (1994–2005) and Archbishop of San Francisco (2006–2012), lung cancer.Former SLC Catholic Bishop Niederauer dies *Leo K. Thorsness, 85, American air force officer and Medal of Honor recipient, member of the Washington Senate (1988–1992), leukemia.Medal of Honor Recipient Leo K. Thorsness Passes Away at 85 *Moray Watson, 88, British actor (The Darling Buds of May, The Quatermass Experiment, Compact), pneumonia.Moray Watson obituary ===3=== *Mishaal bin Abdulaziz Al Saud, 90, Saudi prince and politician, Minister of Defense (1951–1953), Governor of Makkah Province (1963–1971), Chairman of the Allegiance Council (since 2007).وفاة الأمير مشعل بن عبدالعزيز رحمه الله *Lukas Ammann, 104, Swiss actor (Graf Yoster, Die Fallers – Eine Schwarzwaldfamilie, Meschugge), complications from surgery.Schauspieler Lukas Ammann Mit 104 Gestorben *Daliah Lavi, 74, Israeli actress, singer, and model (The Spy with a Cold Nose, Casino Royale, Catlow).Daliah Lavi Gans Obituary *C'el Revuelta, American bassist (Black Flag), brain cancer.Cel Revuelta, former Black Flag bassist, dies from brain cancer *Abbas Abdullahi Sheikh Siraji, 31, Somali politician, Minister of Public Works and Reconstruction (since 2017), shot. *Yumeji Tsukioka, 95, Japanese actress (The Temptress and the Monk), pneumonia.Actress Yumeji Tsukioka dies at 95 ===4=== *William Baumol, 95, American economist (Precursors in mathematical economics), Fellow of the American Academy of Arts and Sciences (since 1971).William Baumol, whose famous economic theory explains the modern world, has died *Bart Carlier, 87, Dutch footballer (AS Monaco, national team, Fortuna '54).Ex-international Bart Carlier (87) overleden *C. Jackson Grayson, 93, American businessman and writer, Chairman of the Price Commission (1971–1973).C. Jackson Grayson, Houstonian Founder, Dies At 93 *Victor Lanoux, 80, French actor (Cousin Cousine), complications from a stroke.Victor Lanoux, célèbre pour son rôle dans « Louis la brocante », est mort *Timo Mäkinen, 79, Finnish racing driver, Monte Carlo Rally (1973) and 1000 Lakes Rally (1973), myelodysplastic syndrome.Rally legend and ‘Flying Finn’ Timo Makinen dies *Edwin Sherin, 87, American-Canadian television director and producer (Law & Order) and stage director (The Great White Hope).‘Law & Order’ Director, DGA Official Ed Sherin Dies at 87 *R. Lee Wrights, 58, American politician, activist and political consultant, Vice Chair of the Libertarian National Committee (2012–2014), multiple organ failure complicated by cardiac arrest. Former LNC Vice Chair, 2012 Presidential nomination runner up Lee Wrights passes away ===5=== *Buhe, 91, Chinese politician, Chairman of Inner Mongolia (1982–1993).全国人大常委会原副委员长布赫逝世，享年91 *Benny Elon, 62, Israeli politician, Ministry of Tourism (2001–2002; 2003–2004) and member of Knesset (1999–2009), complications from throat cancer.Benyamin Elon *Corinne Erhel, 50, French politician, member of the National Assembly (since 2007), heart attack.La députée Corinne Erhel décède après un malaise *Amancio Escapa Aparicio, 79, Spanish-born Dominican Republic Roman Catholic prelate, Auxiliary Bishop of Santo Domingo (1996–2016).Bishop Amancio Escapa Aparicio *Almir Guineto, 70, Brazilian singer-songwriter and sambista, complications from chronic kidney disease and diabetes.Sambista Almir Guineto morre aos 70 anos no Rio *Adolph Kiefer, 98, American swimmer, Olympic champion (1936).Adolph Kiefer, gold medalist at 1936 Olympics, dies at 98 *Leila Seth, 86, Indian judge, Chief Justice of the Himachal Pradesh High Court (1991–1992), cardio-respiratory arrest.Leila Seth, first woman judge of Delhi High Court, dies *Ely Ould Mohamed Vall, 64, Mauritanian politician, President (2005–2007), heart attack.Mauritanie: décès de l'ancien président mauritanien Ely Ould Mohamed Vall (2005-2007) ===6=== *Steven Holcomb, 37, American bobsledder, Olympic champion (2010), suspected pulmonary edema.US Olympic champion bobsledder Holcomb dies *Val Jellay, 89, Australian actress (The Flying Doctors, Prisoner, Homicide), pneumonia.Val Jellay: The Flying Doctors actor dies of pneumonia aged 89 *Rais Khan, 77, Pakistani sitarist.Sitar maestro Ustad Raees Khan passes away in Karachi *Marshall Julum Shakya, 76, Nepalese politician, President of the Kathmandu District (since 1988), septic shock complicated by heart failure and pneumonia.Democratic fighter Marshal Julum Shakya passes away *Min Bahadur Sherchan, 85, Nepalese mountaineer, suspected heart attack.85-year-old man dies on Everest while attempting to break oldest- climber record ===7=== *Gran Apache, 58, Mexican professional wrestler (AAA), colorectal cancer.La lucha libre otra vez está de luto: ¡muere El Apache! *Yoshimitsu Banno, 86, Japanese movie director (Godzilla vs. Hedorah) and screenwriter (The Wizard of Oz, Techno Police 21C), complications from a subarachnoid hemorrhage.‘Godzilla vs. the Smog Monster' Director Yoshimitsu Banno Dies at 86 *Elon Lages Lima, 87, Brazilian mathematician.Morre no Rio o matemático Elon Lages Lima, ex-diretor do IMPA, aos 87 anos *Beppo Mauhart, 83, Austrian football executive and journalist, President of the Austrian Football Association (1984–2002), complications from a stroke.\"Beppo\" Mauhart wird 83 *Gholamreza Pahlavi, 93, Persian prince and writer (Mon père, mon frère, les Shahs d'Iran), complications from pneumonia.شاهپور غلامرضا پهلوی درگذشت *Lee Weissenborn, 88, American politician, member of the Florida House of Representatives (1963–1966) and Senate (1967–1971), complications from a stroke.He once tried to move Florida's capital. That didn't work. But he got change anyway *Wu Wenjun, 97, Chinese mathematician and academician.Obituary: Wu Wenjun ===8=== *Cécile DeWitt-Morette, 94, French mathematician and physicist.Décès de Cécile DeWitt-Morette *Stefania Jabłońska, 96, Polish cancer researcher, member of the Polish Academy of Sciences (since 1986).Zmarła prof. Stefania Jabłońska, wybitny dermatolog i stypendystka WHO *Curt Lowens, 91, German-born American actor (Werewolf in a Girls' Dormitory, The Hindenburg, Angels & Demons) and Holocaust survivor. *Allan H. Meltzer, 89, American economist, President of the Mont Pelerin Society (2012–2014).Allan Meltzer, Who Wrote History of Federal Reserve, Dies at 89 *Lou Richards, 94, Australian footballer (Collingwood), complications from dementia.Lou Richards: Collingwood legend and AFL pioneer dies aged 94 *Lawson Soulsby, Baron Soulsby of Swaffham Prior, 90, British microbiologist and life peer, member of the House of Lords (1990–2015).LORD SOULSBY OF SWAFFHAM PRIOR *Nicolas Stacey, 89, English clergyman, Director of Social Services for Kent County Council (1974–1985).The Rev Nicolas Stacey Obituary *Juan Carlos Tedesco, 73, Argentine politician, Minister of Education (2007–2009).Murió Juan Carlos Tedesco, ex ministro de Educación *Mary Tsoni, 30, Greek actress (Evil, Dogtooth, Evil: In the Times of Heroes) and singer (Mary and The Boy).‘Dogtooth’ Star Mary Tsoni Found Dead at Age 30 ===9=== *Christopher Boykin, 45, American entertainer and musician (Rob & Big), heart failure. *Zoran Madžirov, 49, Macedonian percussionist (Les Barons Karamazoff), inventor of Bottleman, heart attack.ZBOGOM ‘BOTTLEMAN’ Preminuo virtuoz koji je svojom glazbom oduševljavao Dubrovčane *Robert Miles, 47, Italian electronic dance musician and record producer (\"Children\"), pancreatic cancer.Report: Electronic music producer Robert Miles has died at the age of 47 *Arthur Moulin, 92, French politician, member of the National Assembly (1958–1973), member of the Senate (1983–1992), and Mayor of Avesnes (1971–1989).Arthur Moulin, une voix politique du sud du Département qui comptait, est décédé *Michael Parks, 77, American actor (Twin Peaks, From Dusk Till Dawn, Kill Bill).Rest in Peace: Michael Parks *Qian Qichen, 89, Chinese diplomat, Foreign Minister (1988–1998) and Vice Premier (1993–2003).国务院原副总理钱其琛去世 享年90岁 *Wilburn K. Ross, 94, American WWII veteran, Medal of Honor recipient.Medal of Honor Recipient Wilburn K. Ross Passes Away at 94 *Edward Lunn Young, 96, American politician, member of the U.S. House of Representatives from South Carolina's 6th congressional district (1973–1975). ===10=== *Silvano Basagni, 78, Italian sport shooter, Olympic bronze medalist (1972), multiple myeloma.Morto Silvano Basagni, bronzo a Monaco ’72 nel tiro a volo Leggi questo * Geoffrey Bayldon, 93, English actor (Catweazle, Worzel Gummidge, Dracula).Geoffrey Bayldon, beloved star of Catweazle, dead at 93 *Emmanuèle Bernheim, 61, French author (Sa femme) and screenwriter (Swimming Pool, 5x2), lung cancer.La romancière et scénariste Emmanuèle Bernheim est morte *Greg Forristall, 67, American politician, member of the Iowa House of Representatives (since 2007), cancer.State Rep. Greg Forristall of Macedonia dies at 67 *Ted Hibberd, 91, Canadian ice hockey player (national team), Olympic gold medalist (1948).Thomas Hibberd's Obituary *Nelson Xavier, 75, Brazilian actor (Os Fuzis, Girl from Rio, Trash) and director (A Queda), lung disease.Morre o ator Nelson Xavier aos 75 anos em Minas Gerais ===11=== *Gabriel Chiramel, 102, Indian Roman Catholic priest, educationist, zoologist and author, multiple organ failure.Fr. Gabriel Chiramel dead *Mark Colvin, 65, British-born Australian journalist and radio presenter (PM), lung cancer.Mark Colvin, veteran ABC broadcaster, dies aged 65 *Clelio Darida, 90, Italian politician, Mayor of Rome (1969–1976) and Minister of Justice (1981–1983).Roma, addio a Clelio Darida: fu ministro e sindaco dal 1969 al 1976 ===12=== *Antonio Candido, 98, Brazilian literary critic and sociologist, complications from a hiatus hernia.Crítico literário Antonio Candido morre aos 98 em São Paulo *Mauno Koivisto, 93, Finnish politician, President (1982–1994) and Prime Minister (1968–1970; 1979–1982), complications from Alzheimer's disease.Presidentti Mauno Koivisto on kuollut *Yale Lary, 86, American football player (Detroit Lions), businessman and politician, member of the Texas House of Representatives (1959–1963).Yale Lary, 1930-2017 *Henri Termeer, 71, Dutch-born American biotechnology executive (Genzyme), aneurysm.Henri Termeer, key biotech leader who built Genzyme into an industry giant, dies at 71 *Yu So-chow, 86, Chinese actress (The Flying Fox), pneumonia.1960s female martial arts star Yu So Chow dies *Amotz Zahavi, 89, Israeli evolutionary biologist.הלך לעולמו פרופ' אמוץ זהבי ממייסדי החברה להגנת הטבע ===13=== *John Cygan, 63, American actor and voice actor (The Commish, Metal Gear Solid, Toy Story 3), cancer.John Cygan, Actor on 'The Commish,' Dies at 63 *Yanko Daucik, 76, Czech footballer (Real Betis, Real Madrid, Espanyol), pulmonary embolism.Muere Yanko Daucik, exjugador del Real Madrid de los años 76 *Alain Defossé, 60, French novelist (Les fourmis d’Anvers) and translator (Crazy Cock, American Psycho, The Night Watch), lung cancer.Décès de l’écrivain et traducteur Alain Defossé *Marcel Pelletier, 86, Canadian ice hockey player (Chicago Black Hawks, New York Rangers) and scout (Boston Bruins), respiratory failure.Marcel G. Pelletier ===14=== *Dilbagh Singh Athwal, 88, Indian geneticist and agriculturist, complications from liver failure.‘’Father of wheat revolution’’, DS Athwal is no more *Tom McClung, 60, American jazz pianist and composer, lymphoma.Moulins-la-Marche. Le pianiste de jazz Tom McClung est décédé *Keith Mitchell, American drummer (Mazzy Star).Mazzy Star Drummer Keith Mitchell Is Dead *Powers Boothe, 68, American actor (Tombstone, Deadwood, Red Dawn), Emmy winner (1980), cardiopulmonary arrest complicated by pancreatic cancer.Powers Boothe, 'Agents of S.H.I.E.L.D.' and 'Sin City' Actor, Dies at 68 *Frank Brian, 94, American basketball player (Fort Wayne Pistons), complications from Alzheimer's disease.Former LSU basketball great Frank Brian dies at age 94 *Jean Fritz, 101, American children's writer and historian.Jean Fritz, Who Wrote History Books for Children, Dies at 101 *Brad Grey, 59, American producer (The Departed, Charlie and the Chocolate Factory, Real Time with Bill Maher), chairman and CEO of Paramount Pictures (since 2005), cancer.Brad Grey, Former Manager and Paramount CEO, Dies at 59 *Bruce Hill, 67, American racing driver (NASCAR), complications from esophageal cancer.Sad News - Bruce Hill ===15=== *Karl-Otto Apel, 95, German philosopher (Understanding and Explanation: A Transcendental-Pragmatic Perspective, Theory of Communicative Action), member of the European Academy of Sciences and Arts (since 1993).Karl-Otto Apel ist tot *Ian Brady, 79, English serial killer (Moors murders), complications from COPD.Moors murderer Ian Brady dies at 79 *Javier Valdez Cárdenas, 50, Mexican journalist (Ríodoce, La Jornada), shot.Asesinan a tiros en Sinaloa a Javier Valdez, el periodista que cubrió como nadie el narco mexicano *Chu Ke-liang, 70, Taiwanese actor (The New Legend of Shaolin, David Loman, The Wonderful Wedding) and comedian, liver failure complicated by colorectal cancer.Comedian Chu Ke-liang is dead at 70 *Nasser Givehchi, 85, Iranian wrestler, Olympic silver medalist (1952).Iran’s Olympic silver medal winner Givehchi dies at 85 *Thomas James Kinsman, 72, American soldier, awarded Medal of Honor.Thomas James \"Jim\" Kinsman *Bob Kuzava, 93, American baseball player (New York Yankees, Chicago White Sox, Washington Senators).Major League Baseball Players Who Died in 2017 *Neil Rolde, 85, American historian and politician, member of the Maine House of Representatives (1974–1990).Maine Historian, Author and Politician Neil Rolde Dies *Oleg Vidov, 73, Russian-American actor (Red Heat, Wild Orchid, The Immortals), complications from pancreatic cancer. ===16=== *Bernard Bosson, 69, French politician, Ministry of Foreign Affairs and International Development (1986–1988), Minister of Transport, Tourism, and Public Works (1993–1995), Mayor of Annecy (1983–2007), and member of the National Assembly (1995–2007).Bernard Bosson, ancien ministre et maire d’Annecy, est mort *Gunnar Möller, 88, German actor (Our Miss Doctor, I Often Think of Piroschka, Oktoberfest), complications from dementia.Ich denke oft an Andi *Outi Ojala, 70, Finnish politician, member of the Parliament of Finland (1991–1996; 1999–2007) and member of the European Parliament (1996–1999).Kansan Uutiset: Outi Ojala kuoli 70-vuotiaana *Doug Somers, 65, American professional wrestler (AWA). ===17=== *Roxcy Bolton, 90, American women's and civil rights activist and feminist, founder of Women in Distress, cardiac arrest.Civic activist, feminist, trailblazer Roxcy Bolton dies at 90 *Chris Cornell, 52, American musician and singer-songwriter (Audioslave, Soundgarden), suicide by hanging.Chris Cornell, Audioslave and Soundgarden singer, has died aged 52 *Viktor Gorbatko, 82, Russian cosmonaut (Soyuz 7, Soyuz 24, Soyuz 37), stomach cancer.Умер космонавт Виктор Горбатко *Rhodri Morgan, 77, Welsh politician, MP for Cardiff West (1987–2001), Leader of Welsh Labour (2000–2009) and First Minister (2000–2009), suspected heart attack.Former First Minister Rhodri Morgan dies ===18=== *Roger Ailes, 77, American television executive, Chairman and CEO of Fox News (1996–2016), subdural hematoma complicated from a fall.Roger Ailes: Fox News founder dies at 77 *Anil Madhav Dave, 60, Indian politician, MP (since 2009) and Minister of Environment, Forest and Climate Change (since 2016), cardiac arrest complicated by pneumonia.Environment minister Anil Madhav Dave passes away, PM says he was 'passionate about conservation' *Jacque Fresco, 101, American futurist (The Venus Project), complications from Parkinson's disease.An Open Letter from Roxanne Meadows *Reema Lagoo, 58, Indian actress (Hum Aapke Hain Koun..!, Maine Pyar Kiya, Kal Ho Na Ho), cardiac arrest.Actor Reema Lagoo passes away at 58 in Mumbai *Daniele Piombi, 84, Italian television (Premio Regia Televisiva) and radio presenter, complications from respiratory arrest.Daniele Piombi, morto a 84 anni il conduttore televisivo ===19=== *Rich Buckler, 68, American comic book artist (Deathlok, All-Star Squadron, Fantastic Four), cancer.Deathlok, All-Star Squadron Co-Creator And Marvel, DC Comics Artist Rich Buckler Has Passed *Huub Ernst, 100, Dutch Roman Catholic prelate, Bishop of Breda (1967–1992).In Memoriam bisschop Huub Ernst (1917-2017) *Nawshirwan Mustafa, 73, Iraqi Kurdish politician, General Coordinator of the Movement for Change (since 2009), lung cancer.میدیاى فەرمى گۆڕان ڕایگەیاند، نەوشیروان مستەفا رێکخەری گشتی بزووتنەوەی گۆڕان کۆچی دواییکرد . *Stanislav Petrov, 77, Russian Lieutenant colonel in the Soviet Air Defense Forces, prevented nuclear war between the United States and the Soviet Union, pneumonia. *Kid Vinil, 62, Brazilian musician and record producer, cardiac arrest.Morre, aos 62 anos, o cantor e produtor Kid Vinil *Wayne Walker, 80, American football player (Detroit Lions), sports broadcaster and director (KPIX, NFL on CBS), complications from Parkinson's disease.Former Detroit Lions LB/K Wayne Walker dies at 80 years old ===20=== *Albert Bouvet, 87, French cyclist, Paris–Tours winner (1956).Albert Bouvet est mort *Joy Corning, 84, American politician, Lieutenant Governor of Iowa (1991–1999), liver disease.Former Iowa lieutenant governor dies at 84 *Emile Degelin, 90, Belgian movie director (If the Wind Frightens You, Life and Death in Flanders, Palaver) and novelist, pneumonia.Le cinéaste Emile Degelin est décédé à Louvain *Victor Găureanu, 49, Romanian fencer, World Fencing Championship bronze medalist (1994, 2001), suspected cardiac arrest.A murit Dan Găureanu! *Syed Abdullah Khalid, 75, Bangladeshi sculptor and professor, recipient of the 2017 Ekushey Padak, complications from COPD.Aparajeyo Bangla sculptor Syed Abdullah Khalid passes away *Alexander Alexandrovich Volkov, 65, Russian politician, President of the Udmurt Republic (2000–2014), cancer. ===21=== *Kenny Cordray, 62, American guitarist (THE CHILDREN) and songwriter (\"Francine\"), shot. *Sir Paul Judge, 68, British businessman and political executive.Sir Paul Judge, entrepreneur and business school founder – obituary *Jimmy LaFave, 61, American folk musician and singer-songwriter (Cimarron Manifesto), tissue cancer.Austin Music Man Jimmy LaFave Dies After Cancer Battle, Label Confirms *Bill White, 77, Canadian ice hockey player (Rochester Americans, Chicago Blackhawks, Los Angeles Kings).White played tight defense on the ice, kept team loose off it ===22=== *Salman Ramadan Abedi, 22, British terrorist, attacker responsible for the 2017 Manchester Arena bombing, suicide by bombing.MANCHESTER BOMBER SALMAN ABEDI ‘WENT OFF THE RAILS’ AS A TEENAGER, SAYS RELIGIOUS LEADER *Oscar Fulloné, 78, Argentine football player (Independiente Medellín, Real Oviedo, Aston Villa) and coach (Burkina Faso national team, Raja Casablanca, Wydad Casablanca), respiratory arrest. *Nicky Hayden, 35, American professional motorcycle racer (Ducati), World Champion (2006), injuries following traffic collision.Nicky Hayden dies after bike accident *Dina Merrill, 93, American actress (Operation Petticoat, BUtterfield 8, Desk Set), philanthropist and production executive (RKO Pictures), dementia.Dina Merrill, Actress and Philanthropist, Dies at 93 *Leonhard Nagenrauft, 79, German luger, European champion (1967).Former European Champion Leonhard Nagenrauft dies *Mickey Roker, 84, American jazz drummer, lung cancer.Mickey Roker, Dynamic Hard-Bop Drummer and Philly Jazz Institution, Dies at 84 *Zbigniew Wodecki, 67, Polish singer (\"Chałupy Welcome To\", \"Lubię wracać tam, gdzie byłem\", \"Zacznij od Bacha\"), composer and television presenter (Taniec z gwiazdami), complications from a stroke and COPD. ===23=== *William Carney, 74, American politician, member of the U.S. House of Representatives from New York's 1st congressional district (1979–1987), prostate cancer. *Stefano Farina, 54, Italian football referee (UEFA Champions League, FIFA), suspected heart attack.Calcio, morto l'ex arbitro Stefano Farina: aveva 54 anni *Sir Roger Moore, 89, English actor (James Bond, The Persuaders!, The Saint), prostate-lung-liver cancer.Actor Sir Roger Moore dies aged 89 *Jerry Perenchio, 86, American businessman, CEO of Univision (1992–2007), lung cancer.Jerry Perenchio Dies: Hollywood Dealmaker & Former Univision CEO Was 86 *Kaoru Yosano, 78, Japanese politician, Chief Cabinet Secretary (2007), pneumonia.Former lawmaker and finance chief Kaoru Yosano dies at 78 ===24=== *Ezekiel Anisi, 28, Papua New Guinean politician, MP for Ambunti-Dreikikir (2012, since 2013), suspected cardiac arrest.Death of PNG's youngest-ever MP puts politicians' health in the spotlight *Tom Gilbey, 79, British fashion designer (Savile Row), cancer.Obituary: menswear designer Tom Gilbey *William Duborgh Jensen, 82, Norwegian fashion designer.Nekrolog: William Jensen *Denis Johnson, 67, American author (Angels, Jesus' Son, Tree of Smoke), liver cancer. *Noel Kinsey, 91, Welsh footballer (Birmingham City F.C.).Former Birmingham City player Noel Kinsey passes away, aged 91 (death announced on this date) *Juliana Koo, 111, Chinese-born American diplomat.112岁复旦女神严幼韵纽约去世，其朋友圈遍及中国近现代史 *Fritz Lichtenhahn, 85, Swiss actor (Alle Jahre wieder: Die Familie Semmeling, Germany Pale Mother, Schtonk).Er war Wedels „Semmeling“: Fritz Lichtenhahn ist tot *Jared Martin, 75, American actor (Dallas, War of the Worlds, The Fantastic Journey), pancreatic cancer.Jared Martin, Who Played Rodeo Cowboy Dusty Farlow on 'Dallas,' Dies at 75 *Pierre Seron, 75, Belgian comic book artist (Mélusine, Spirou, Modeste et Pompon).Les Petits Hommes perdent leur créateur *Sonny West, 78, American actor and stuntman (Stay Away, Joe, The Hellcats, Bigfoot), oropharyngeal and lung cancer.Sonny West of Elvis' Memphis Mafia dies at 79 ===25=== *Sir Alistair Horne, 91, British historian (A Savage War of Peace: Algeria 1954–1962), journalist (The Daily Telegraph) and spy.Sir Alistair Horne, historian, journalist and former spy – obituary *Eva Estrada Kalaw, 96, Filipino politician, Senator (1965–1972) and Assemblywoman from Manila (1984–1986). *Frédérick Leboyer, 98, French obstetrician and author (Birth Without Violence).Frederick Leboyer dead: Obstetrician behind 'birth without violence' dies at 98 *Saucy Sylvia, 96, Canadian-born American radio personality (The Sylvia Show) and singer (\"Sex is the thing that started it all\"), complications from pnuemonia.RIP Saucy Sylvia *Ali Tanrıyar, 103, Turkish politician, Minister of the Interior (1983–1984) and sports executive, President of Galatasaray S.K. (1986–1990).Obituary: Ali Tanrıyar ===26=== *Toni Bertorelli, 69, Italian actor (The Young Pope, Who Killed Pasolini?, The Passion of the Christ), complications from pancreatic cancer.È morto Toni Bertorelli, mafioso e cardinale delle fiction tv *Laura Biagiotti, 73, Italian fashion designer, complications from a heart attack. *Zbigniew Brzezinski, 89, Polish-American diplomat and political scientist, National Security Advisor (1977–1981), congestive heart failure.Zbigniew Brzezinski, National Security Adviser to Jimmy Carter, Dies at 89 *Jim Bunning, 85, American baseball player (Detroit Tigers, Philadelphia Phillies, Pittsburgh Pirates) and politician, member of the U.S. House of Representatives from Kentucky's 4th congressional district (1987–1999) and U.S. Senator (1999–2011), complications from a stroke.Senator Jim Bunning Dies at 85 ===27=== *Gregg Allman, 69, American Hall of Fame singer-songwriter (\"I'm No Angel\", \"Ramblin' Man\", \"Midnight Rider\") and musician (The Allman Brothers Band), complications from liver cancer.Gregg Allman, Soulful Trailblazer of Southern Rock, Dies at 69 *Don Robinson, 84, English rugby league player (Wakefield Trinity, Leeds), World Champion (1954).Obituary – Don Robinson ===28=== *Frank Deford, 78, American sportswriter (Sports Illustrated), novelist (Everybody's All-American) and radio broadcaster (Morning Edition).Frank Deford, legendary sports writer and commentator, dies at 78 *Ervin E. Dupper, 94, American politician, member of the South Dakota Senate (1965–1968).In Memory Of Ervin E. Dupper *John Noakes, 83, British television presenter (Blue Peter, Go With Noakes), complications from Alzheimer's disease.Blue Peter’s daredevil: John Noakes obituary *Graham Webb, 73, British racing cyclist, Amateur Road World Champion (1967).Obituary: Former world champion Graham Webb — 1944-2017 ===29=== *Michael A'Hearn, 76, American astronomer.Michael A'Hearn *Konstantinos Mitsotakis, 98, Greek politician, Prime Minister (1990–1993). *Manuel Noriega, 83, Panamanian politician and military official, Military Leader (1983–1989), complications from brain surgery.Manuel Noriega, Panama ex-strongman, dies at 83 *Mordechai Tzipori, 92, Israeli general and politician, Minister of Communications (1981–1984).Former Irgun member, minister and IDF general Mordechai Tzipori passes away ===30=== *Sir Gordon Brunton, 95, British businessman, Chair Executive of Thomson Corporation (1966–1984). *Molly Peters, 75, British actress (Thunderball) and model, complications from a stroke.Molly Peters dead: Sean Connery's Bond girl dies aged 75 *Dasari Narayana Rao, 75, Indian movie director (Meghasandesam) and politician.MP, veteran director Dasari Narayana Rao dies at 75 *Elena Verdugo, 92, American actress (Panama Sal, House of Frankenstein, Marcus Welby, M.D.).Elena Verdugo, Emmy-Nominated Actress on 'Marcus Welby, M.D.,' Dies at 92 ===31=== *Jiří Bělohlávek, 71, Czech conductor (Prague Symphony Orchestra, BBC Symphony Orchestra), cancer.V noci zemřel po delší těžké nemoci uznávaný český dirigent Jiří Bělohlávek *Lubomyr Husar, 84, Ukrainian Ukrainian Catholic hierarch, Major Archbishop of Kyiv-Halych (2001–2011).Помер Блаженніший Любомир Гузар *Tino Insana, 69, American (Three Amigos!, Bobby's World, Barnyard) and comedian (The Second City), complications from cancer.Tino Insana, Second City Alum, Dies at 69 *Fred Kummerow, 102, American biochemist.Fred A. Kummerow, an Early Opponent of Trans Fats, Dies at 102 *Bern Nix, 69, American jazz guitarist (Dancing in Your Head, In All Languages), suspected heart attack.Bern Nix, Guitarist Steeped in Ornette Coleman's Harmolodic Language, Dies at 69 ==Months== * January 2017 * February 2017 * March 2017 * April 2017 * May 2017 ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *05 Category:May 2017 events",
 "title": "Deaths in May 2017"
}