{
 "id": "582591",
 "text": "This list includes colour paintings of Scottish monarchs: The first paintings of Scottish monarchs start with James I. Althought b+w portraits and depictions have been painted long before James I. == James I (1406-1437) == File:King James I of Scotland.jpg|The only painting of James I. Painted in the 1500's. James I reigned from 1406-1437 as king of Scots. == James II (1437-1460) == File:James II of Scotland.jpg|A painting of James II from the 1600's. He reigned from 1437-1460. File:James II of Scotland (by von Ehingen).jpg|The portrait of James II, possibly during the early years of his reign. Most definitely during his life. File:James II Portrait.jpg|A black and white version of the painting, includes more detail and a background of a castle room. == James III (1460-1488) == File:James III, King of Scotland.png|James III, reigned from 1460-1488. Painted in the 1600's. == James IV (1488-1513) == File:James IV of Scotland.jpg|James IV, reigned 1488-1513. Painted in the 1600's. File:James IV King of Scotland.jpg|James IV with a bird. Painted in the 1400's during his reign. Possibly his coronation or ascension portrait. == James V (1513-1542) == File:James V of Scotland2.jpg|James V, unknown author and date of the painting. Before 1933. File:Portrait of James V of Scotland (1512 - 1542).jpg|Portrait of James V from 1536, 6 years before his death. File:James V of Scotland and Mary of Guise.jpg|James V depicted with his wife Mary of Guise. == Mary I (1542-1567) (paintings up to her execution) == File:Mary Queen of Scots portrait.jpg|Portrait of Mary, painted between 1560-1592. File:Mary, Queen of Scots after Nicholas Hilliard (crop).jpg|Portrait of Mary from 1578. File:Mary, Queen of Scots in Captivity.png|Mary queen of Scots in captivity, circa 1575. File:Mary, queen of Scots, in mourning.jpg|Mary painted in circa 1560, in morning for king Francis II, her husband. File:Mary Queen of Scots Blairs Museum.jpg|Portrait of Mary between 1561-1567. File:BLW Portrait of Mary Queen of Scots.jpg|Portrait of Mary I, queen of Scots from 1559, after the death or before the death of Francis II. File:Mary Queen of Scots by Nicholas Hilliard 1578.jpg|Miniature between 1578-1579. == James VI (1567-1603) (1603-1625) == File:James VI of Scotland as a Youth.jpg|Painting as a youth, 1583. File:James VI and I.jpg|Painting as king of England, circa. 1604. File:Portrait of James I of England and James VI of Scotland.jpg|James VI, aged 19. File:James VI and I (dressed in white).jpg|James VI, most likely as king of both England & Scotland. File:Portrait of King James I & VI.jpg|Portrait circa 1600s File:Portrait of King James I & VI (1618-1620).jpg|Portrait (c. 1618-1620) File:King James I of England and VI of Scotland by Arnold van Brounckhorst.jpg|James VI as a child. File:James I of England by Daniel Mytens.png|One of the last portraits of James in 1621. == Later Monarchs == Paintings of Scottish monarchs end here but for monarchs of Scotland and England see Paintings of British Monarchs. Category:History of Scotland Category:Monarchy",
 "title": "Paintings of Scottish monarchs"
}