{
 "id": "582553",
 "text": "Turan University (, Turan Ýnıversıteti; Russian: Университет Туран), is a university in Almaty, Kazakhstan. It is the country’s first private university, founded in 1992.Turan University was registered in 1992 in Almaty.The system of specialist training at the university is conducted on 3 levels of education: basic higher education (Bachelor's programme, the Master's programme and Philosophiae doctor). Turan University offers 25 undergraduate majors,15 master specialties and 5 Philosophiae doctor specialties. The most popular fields are in three departments: economic, humanitarian and legal, Academy of Cinema and Television faculty. Education at the university of Turan is held in three languages: Kazakh, Russian, English. ==Goals== The main goal of the Turan educational corporation is to create a unique environment for obtaining skills to prepare specialists. Turan University adopted a new academic policy towards innovation and entrepreneurship. ==Grants== Admission to Turan University is carried out on the basis of state educational grants. The university also gives its own grants to students who had good marks from school. ==Staff== The university employs 361 full-time teachers. This includes 55 doctors of science, professors, 215 candidates of science and associate professors, 1 philosophiae doctor. In addition to them, the educational process provides more than 49 practitioners, scientists, teachers and on the basis of staffing and hourly wage. Rector of the university of Turan is Alshanov R.A. Chairman of the university of Turan is Seidumanov S.T. == Campus == The university has its own campus with a total area of 35,000m². The main building is 7-storey tall and hosts the administration and the Economics, Humanities and Law faculties.There are 3 football pitches, 3 sports halls and a dormitory on campus. == Academics == Educational Corporation \"Turan\" is a system that provides the principle of continuity and multi-stage education, and includes: * 2 universities (Almaty and Nur-Sultan) * 3 colleges (Almaty and Nur-Sultan) * Lyceum (Almaty) * Educational and recreational complex \"Tau-Turan\" == Faculties == Bachelor’s Programs Master’s Programs Philosophiae doctor's Programs Faculty of Humanities and Law: * Law * International Law * International Relations * Region Studies * Psychology * Translation skills * Public relations * Tourism * Social-culture service * Journalism Faculty of Economics: * Marketing * Management * Hotel and hospitality management * Logistics * World economy * Economy * Accounting and audit * Finance * Information systems * State and local governing Department of Academy of film and Television: * Computing and Software * Radio engineering, electronics and telecommunications * Stage direction * Cinematography Faculty of Humanities and Law: * International Relations * Law * Psychology * Tourism Faculty of Economics: * Economy * Management * Accounting and audit * Marketing * Information systems Department of Academy of film and Television: * Computing and Software * Stage direction * Cinematography Faculty of Humanities and Law: * Law * Psychology Faculty of Economics: * Economy * Management * Finance == Partner universities == * Binary University College (Management and Entrepreneurship)https://binary.edu.my/ * London School of Business and Finance * Moscow State University * Asia Pacific University of Technology & Innovation * Graduate School of Management (GSM Barcelona) == Student life == Turan university has an active academic, scientific, sports life, where the initiators of creative ideas are the students themselves. Students who during the year showed the best results in studies and conducted active scientific work are awarded the honorary title of \"Student of the Year\". The most active students receive the nomination \"The Activist of the Year”. Students can join these organizations to improve their skills of team work: * University Students Government * Sirius Debate Club * Enactus * Sport life * “Turan’s Trumps” Dance Club == Plans == On May 3, 2017 Turan University organized a training on journalism and press freedom for students from Kyrgyzstan and Kazakhstan. The World Press Freedom Day theme will be promoted among participants and Turan University partners. Organizers will train young reporters to cover general news, finance and business, governance, corruption, elections, women and gender equality, climate change and the environment, health, sport, and the culture of peace. == Notable alumni and faculty == * Ali Altynbayev (alumnus) - Deputy Chairman of the National Security Committee of the Republic of Kazakhstan https://akipress.com/news:671997:New_Deputy_Chairman_of_National_Security_Committee_of_Kazakhstan_named/ == References == * Turan University Home Page == Other websites == # Unesco # Official homepage # Triplehelix association # University Rankings # University Directory worldwide Category:Colleges and universities in Kazakhstan Category:1992 establishments in Asia Category:1990s establishments in Kazakhstan",
 "title": "Turan University"
}