{
 "id": "582755",
 "text": "Bruce Hampton (born Gustav Valentine Berglund III; April 30, 1947 – May 1, 2017) was an American musician.Palmer, Robert. Recordings; POP ECCENTRICS REVISITED, New York Times, 21 June 1981. Retrieved on 03 March 2015. ==Career== In the late 1960s he was a founding member of Atlanta, Georgia's avant-garde Hampton Grease Band.Jarnow, Jesse. Yes- And’ing From Here to Zambiland: A Surreal Conversation with Col. Bruce Hampton (ret.), jambands.com, 20 August 2001. Retrieved on 03 March 2015. Adopting the moniker Colonel Hampton B. Coles, Retired or alternatively Col. Bruce Hampton Ret., and sometimes playing a sort of dwarf guitar called a \"chazoid\",Freeman, Scott. Col. Bruce to the Rescue , Creative Loafing, 31 January 2007. Retrieved on 03 March 2015.Paul, Alan. Col. Bruce Hampton and the ARU: An Appreciation , AlanPaul.net, 05 June 2014. Retrieved on 03 March 2015./ he later formed several other bands. Some of those band names include The Late Bronze Age, The Aquarium Rescue Unit, The Fiji Mariners, The Codetalkers, The Quark Alliance, Pharaoh Gummitt, and Madrid Express.\"Col. Bruce Hampton | Discography\", Allmusic, Retrieved on 03 March 2015.Marshall, Alli. Smart bets: Col. Bruce Hampton and The Madrid Express, Mountain Xpress, 13 January 2015. Retrieved on 03 March 2015. ==Death== On May 1, 2017, Hampton was being honored with a concert featuring his friends at the Fox Theatre in Atlanta, Georgia for his 70th birthday when he collapsed on-stage of a heart attack during an encore performance of \"Turn on Your Lovelight.\" As a result, Hampton lay slumped over an amplifier on the edge of the stage for several minutes before he was taken offstage for medical attention; because people thought he was joking. He died shortly thereafter at Emory University Hospital Midtown. ==References== ==Other websites== *Official website Category:1947 births Category:2017 deaths Category:Deaths from myocardial infarction Category:American guitarists Category:American rock musicians Category:Singers from Atlanta Category:Musicians from Atlanta",
 "title": "Bruce Hampton"
}