{
 "id": "58287",
 "text": "In Egyptian mythology, Amun was worshipped as a very powerful god, often being combined with Ra to form the god Amun-Ra. At one point in Egyptian history, he was known as, \"King of the Gods.\" Amun (also spelled Ammon) became one of the most important deities in Ancient Egypt, and in later years, combined with Horus into one god. He began as a Theban wind and fertility god, before being recognized as the supreme deity, with most of Egypt's vast wealth dedicated to his temple. Around the second millennium B.C.E., Thebes' worship of Amun grew so powerful that it threatened worship of then-primary sun god, Ra, which eventually resulted in these two deities also being recognized as one god. Amun-Ra was hailed as a national god, the creator of the universe, the pharaoh's personal protector, and the god of war. ==Origin of name== Amun's name is first recorded as Imn, meaning, \"The hidden (one).\" Vowels were not written in Egyptian hieroglyphics, but Egyptologists believe the name survives into the Coptic language as Amoun. ==Inception and historical influence== Worshippers of Amun recorded in their texts that he had created himself, then created everything else, while remaining distant from the rest of the world. Amun may potentially be one of the original creator gods in human religion. Amun was depicted in human form, seated on a throne, wearing a plain, deep circlet with two straight parallel plumes above it, which may serve as symbolism of being without a father, and were almost certainly representative of his former status as a wind god. When Amun had become more culturally significant than Menthu, the latter became known as the son of Amun. However, as Mut was infertile, it was believed that she and Amun had adopted Menthu rather than conceiving him. Ammon creator worship was introduced to Greece at an early period, probably through the medium of the Greek colony in Cyrene, which must have formed a connection with the great oracle of Ammon in the Oasis soon after its establishment. When Alexander the Great invaded Egypt in 332 B.C.E., he was pronounced the metaphorical son of Amun, thus conquering Egypt without a fight, and currency began depicting Alexander as being adorned with the horns of Ammon. This tradition continued for centuries, with Alexander being referred to in the Qur'an as, \"Dhu al-Qarnayn (The Two-Horned One),\" a reference to his depiction on Middle Eastern coins.Recent Ancient Coin Acquisitions Focus on Alexander the Great == Photos == ==References== *David Klotz, Adoration of the Ram: five hymns to Amun-Re from Hibis Temple (New Haven, 2006therwebAnint gypt: th Myth Clasical Dictionary: Category:Egyptian gods and goddesses",
 "title": "Amun"
}