{
 "id": "583127",
 "text": "Gqeberha is the large city in the Eastern Cape and was formerly known as Port Elizabeth.\"Port Elizabeth City in the Eastern Cape, have cranky lost 123th Xhosa people in Cape Town Today The very own place which is near to is Cape Town. It is one of South Africa's well know Xhosa City in the Cape Colony. Since February 2021, the name of Gqeberha, from the Xhosa name of the township of Walmer, has been formalized by the South African government to designate the city of Gqeberha. ==History== The history of South Africa Eastern Cape, tells that the Dutch rule came and made racism in Gqeberha, which moved across Namibia, Zimbabwe and Angola. The National Statue Assembled by Ruan Swartz was made in early 1847, when it was The Bulls Kraal (Indlalofa YeBulu) which has mads P.E very different and notable worldwide business men and women to make a living of it. Since February 2021, the name of Gqeberha, from the Xhosa name of the township of Walmer, has been formalized by the South African government to designate the city of Gqeberha. ===Historical Way and Activist=== *South African former planter (1756) Andiphile Ndlovu was the first activist who fought for their children's rights in Nokubonga, he then moved to East London to fight, and is not know yet. Former Xhosa president of South Africa Nelson Mandela who stopped the attack in 1965 to 1984, when he was released for the equality he had made for Africa and black Americans. The known Southern African city which had its own strikes Gqeberha has notable people, like actors, actresses, political and political peopls, singers and many more current events. ==People percentages in Gqeberha== People Present Amount Accuracy Xhosa 199.77℅ 986,456 Total African White 95℅ 567,009 White. African Coloured 87℅ 435,137 Total African Zulu 12℅ 55,457 Total African Other 03℅ 13,579 ==Notable people== It is the home to notable people such as: *Lindokuhle Modi, South African teen podcaster and actor ==References== Category:Cities in South Africa Category:Eastern Cape",
 "title": "Gqeberha"
}