{
 "id": "583109",
 "text": "Muhammad Izzul Islam bin Mazlan, better known as Izzue Islam (born 2 June 1990) is a Malaysian singer, musician and actor. He is from Kota Bharu, Kelantan. His artistic career began with acting and later singing by joining a group under the auspices of the CREW Studios the Forteen. == Career == He first became known after winning the award for \"best actor Film Festival Malaysia-25\" and \"New Hero Awards Greatest blockbuster movies are 2\". His name is increasing when given the responsibility of undertaking the lead role in the drama My Wife Actually, here it is! He has set up his household along with his Manager, Awin Nurin on 2 June 2013. The Group also performed the song ' Nowseeheart Me Please Love ' during the event. ==Filmography== Television Key Denotes films that have not yet been released ===Film=== Year Title Role Notes 2011 Khurafat: Perjanjian Syaitan Night Club Visitors Additional Actor (as Muhammad Izzul Islam) 2011 Songlap Rizal 2012 29 Februari Razak 2012 Hantu Kapcai Man Greng 2013 Hantu Tok Mudim Borhan 2013 Ular Saiful 2013 Chikaro Mukhriz 2014 Kami Histeria Pitt 2014 Mat Tudung Azhar / Azharina 2014 Ribbit Labah Labah 2015 Sunti @Facebook Asyiq Ismail 2015 Suami Aku Ustaz Johan 2015 Transformers: Age of Extinction Drift Malay dub 2016 Aliff Dalam 7 Dimensi Aliff 2019 XX Ray 3 Rayyan Post-production 2019 Bella & Jamie Reza Post- production ===Television=== Year Title Role TV channel Notes 2010 Pintu Taubat Izzul Oslam Astro Oasis 2011 Gemilang Halim TV3 13 Episode Papa Nak Kahwin — Astro Warna Cita dan Cinta Azlan TV9 Si Tudung Tweet — TV9 Telemovie Sebelum Lima Perkara Ikmal TV3 2012 Aishiteru Ammar TV9 Aku Tak Percaya Cinta Irshad TV1 Cik Paris Diva Kampung Sufian Astro Prima Telemovie Mimpi Cinderella Haikal TV3 Jangan Ambil Padang Kami Roy Astro Ria Duri Hazim Astro Prima 2013 Maskara Joe TV1 Bunga Merah Punya! Merah TV9 Sebenarnya, Saya Isteri Dia! Firash Arshad TV3 Sahabat Toi Astro Ria 2014 Aku Isterinya Mikail TV3 2015 Suami Sebelah Rumah Dr. Amar TV3 Imam Kacak Pakwe Kami — TV1 Telemovie 2016 Patahnya Sebelah Sayap Amzar TV3 15 Episode 2017 Ops Cinta Din Sardin Din Sardin TV9 2017 Peah Singa Aifan TV9 2017 Kesempatan Kedua Taufik TV3 2018 Tok Adi Haikal Astro Maya HD 10 Episode 2022 Rindu Kasih Amir TV3 15 Episode TBA Rindu Kasih 2 Category:Living people Category:Malaysian actors Category:1990 births Category:People from Kelantan",
 "title": "Izzue Islam"
}