{
 "id": "583336",
 "text": "The 2012 French presidential election was a presidential election in France that took place on 22 April 2012 and 5–6 May 2012. The incumbent president, Nicolas Sarkozy, ran for a second term. The main candidates were Nicolas Sarkozy from the Union for a Popular Movement, François Hollande from the Socialist Party, Marine Le Pen from the National Front, Jean-Luc Mélenchon from the Left Front, François Bayrou from the Democratic Movement, Eva Joly from The Greens, Nicolas Dupont-Aignan from Debout la France, Philippe Poutou from the New Anticapitalist Party, Nathalie Arthaud from Lutte Ouvrière and Jacques Cheminade from Solidarity and Progress. On 22 April 2012, François Hollande won 29% of the vote with Nicolas Sarkozy winning 27%. Both candidates advanced to the second round of the election, which Hollande later won with 52% of the vote. == Results == First round 22 April 2012 First round 22 April 2012 First round 22 April 2012 First round 22 April 2012 Second round 6 May 2012 Second round 6 May 2012 Candidate Candidate Votes % Votes % François Hollande 10,272,705 28.63% 18,000,668 51.64% Nicolas Sarkozy 9,753,629 27.18% 16,860,685 48.36% Marine Le Pen 6,421,426 17.90% Jean-Luc Mélenchon 3,984,822 11.10% François Bayrou 3,275,122 9.13% Eva Joly 828,345 2.31% Nicolas Dupont-Aignan 643,907 1.79% Philippe Poutou 411,160 1.15% Nathalie Arthaud 202,548 0.56% Jacques Cheminade 89,545 0.25% Total votes Total votes 35,883,209 100% 34,861,353 100% == References == == Other websites == * The Constitutional council's duties relating to the presidential election * Opinion poll tracker with data * NSD: European Election Database – France publishes regional level election data; allows for comparisons of election results, 1990–2012 * A clickable map showing elections results by region, department, and commune on the website of L'Humanité Category:2012 in Europe Category:2012 elections Category:2010s in France Category:Presidential elections in France Category:April 2012 events Category:May 2012 events",
 "title": "2012 French presidential election"
}