{
 "id": "583841",
 "text": "Kevin Allen Hassett (born March 20, 1962) is an American economist and politician who has been the Director of the National Economic Council since 2025. He was the Chair of the Council of Economic Advisers from September 13, 2017 to June 28, 2019. He is known for his work on tax policy and for co- authoring the book Dow 36,000 (1999). Hassett was the chair in American Politics and Culture and Director of Research for Domestic Policy at the American Enterprise Institute, a conservative think tank. Hassett was John McCain's chief economic adviser in the 2000 presidential primaries and an economic adviser to the campaigns of George W. Bush in the 2004 presidential election and McCain in the presidential election of 2008. He was among Mitt Romney's economic advisers for the 2012 presidential campaign.Who Are Obama's and Romney's Key Economic Advisers? In April 2017, President Donald Trump nominated Hassett to serve as the 29th chair of the Council of Economic Advisers. He served in the role until his resignation in 2019. In November 2024, President-elect Trump nominated Hassett to be Director of the National Economic Council. ==Early life== Hassett was born in Greenfield, Massachusetts. He received a B.A. in economics from Swarthmore College and a Ph.D. in economics from the University of Pennsylvania. ==Career== Hassett was an assistant professor of economics at Columbia Business School from 1989 to 1993 and an associate professor there from 1993 to 1994. From 1992 to 1997, Hassett was an economist in the Division of Research and Statistics at the Federal Reserve Board of Governors. He was a policy consultant to the United States Department of the Treasury during the George H. W. Bush and Bill Clinton administrations.Kevin Hassett curriculum vitae on AEI website. Hassett joined the American Enterprise Institute (AEI) as a resident scholar in 1997. He worked on tax policy, fiscal policy, energy issues, and investing in the stock market. In 2003, Hassett was named director of economic policy studies at AEI. Hassett wrote columns in newspapers like The New York Times, The Washington Post, and The Wall Street Journal. He writes a monthly column for National Review and, since 2005, a weekly column for Bloomberg. ==Council of Economic Advisers== In early 2017, Hassett was nominated by U.S. President Donald Trump to become the 29th chair of the Council of Economic Advisers. The United States Senate confirmed him with a 81-16 vote on September 12, 2017. He was sworn in on September 13, 2017. On September 13, 2018, on an official visit to Ireland, he was asked if the U.S. thought of Ireland as a tax haven to which he defended Ireland by saying that the U.S. tax law systen was \"written by someone on acid\". Hassett had called Ireland as a tax haven on several interviews. On June 2, 2019, Hassett announced his resignation. ==Senior Economic Advisor== In March 2020, it was announced that Hassett would work at the White House again for a short time to advise President Trump on economic policy during the COVID-19 pandemic. In April 2020, the Trump administration announced Hassett's appointment as a senior advisor. Hassett, who had no experience in infectious disease predictions, built a model that predicted a far lower coronavirus death rate than what actually happened. Hassett's model said that the number of deaths from the virus would drop to near zero by May 15. Hassett's model went against the opinions of public health experts. ==National Economic Council== On November 26, 2024, President- elect Trump nominated Hassett to serve as the Director of the National Economic Council under his second administration. ==References== ==Other websites== * Kevin Hassett bio at AEI * Category:1962 births Category:Living people Category:American economists Category:Businesspeople from Massachusetts Category:Politicians from Massachusetts Category:United States Council of Economic Advisers Category:Republican Party (United States) politicians Category:American columnists Category:Writers from Massachusetts Category:Academics from Massachusetts",
 "title": "Kevin Hassett"
}