{
 "id": "58381",
 "text": "This is a list of Germanic deities that are in Norse mythology. Divided between the Æsir and the Vanir, and sometimes including the jötnar (giants), the dividing line between these groups is less than clear. However, it is usually accepted that the Æsir (including Óðinn, Þór and Týr) were warrior gods, while the Vanir (mainly Njörður, Freyja and Freyr) were fertility gods. Various other groups of beings, including elves, dwarves and jötnar were probably minor gods, and might have had small cults and sacred places devoted to them. ==Gods== Name Name meaning Attested consorts and sexual partners Attested children Attestations Baldr (Old Norse), Bældæg (Old English) shining day.Simek (2007:26). Nanna Forseti Merseburg Incantation, Poetic Edda, Prose Edda, Gesta Danorum, Chronicon Lethrense, Annales Lundenses, possibly Beowulf Bragi (Old Norse) Connected with Bragr (\"poetry\")Simek (2007:43). Iðunn None attested Poetic Edda, Prose Edda, skaldic poetry Dellingr (Old Norse) Possibly \"the dayspring\"Bellows (1936:75). or \"shining one\"Orchard (1997:32). Nótt Dagr Poetic Edda, Prose Edda Forseti (Old Norse) \"Chairman\"Orchard (1997:46). None attested None attested Poetic Edda, Prose Edda Freyr (Old Norse), Frea (Old English), Yngvi (Old Norse), Ing (Old English) \"lord\"Orchard (1997:47). Freyja, Gerðr Fjölnir (Heimskringla) Gesta Hammaburgensis ecclesiae pontificum, Poetic Edda, Prose Edda, Heimskringla, Ögmundar þáttr dytts, Gesta Danorum, various others Heimdallr (Old Norse) \"World-brightener\"Orchard (1997:78). None attested None attested Prose Edda, Poetic Edda Hermóðr (Old Norse), Heremod (Old English) \"War-spirit\"Orchard (1997:83). None attested Sceaf (Old English only) Poetic Edda, Prose Edda, Beowulf, Old English royal genealogies Höðr (Old Norse) \"Warrior\"Orchard (1997:88). None attested None attested Poetic Edda, Prose Edda, Gesta Danorum, Chronicon Lethrense, Annales Lundenses, possibly Beowulf Hœnir (Old Norse) Contested None attested None attested Poetic Edda, Prose Edda, skaldic poetry Lóðurr (Old Norse) Contested None attested None attested Poetic Edda, skaldic poetry Loki (Old Norse) Contested Sigyn, Angrboda Nari/Narfi, Váli, Fenrir, Hel, Jormungandr, and Sleipnir Poetic Edda, Prose Edda, Heimskringla, Loka Táttur, Norwegian rune poem, Danish folk tales Máni (Old Norse) \"Moon\" None attested None attested Poetic Edda, Prose Edda Mímir (Old Norse) \"Rememberer\" None attested Sons, unnamed Poetic Edda, Prose Edda Meili (Old Norse) \"lovely one\"Simek (2007:210). None attested None attested Poetic Edda, Prose Edda Njörðr (Old Norse) Contested Once unnamed sister, once Skaði Freyr, Freyja Poetic Edda, Prose Edda, Heimskringla, Egils saga, Hauksbók ring oath, place names Odin: Óðinn (North Germanic), Wōden (West Germanic), *Wōdanaz (Proto-Germanic) (see List of names of Odin for more) \"Frenzy\"Orchard (1997:123). Frigg (consort), Skaði (Heimskringla only), Gunnlöð, Jörð, Rindr See Sons of Odin Most attestations of Germanic paganism Óðr (Old Norse) \"frenzied one\"Orchard (1997:121). Freyja Hnoss, Gersemi Poetic Edda, Prose Edda Saxnōt (Old Saxon), Seaxnet, Seaxnēat, Saxnat (Old English) Contested None attested None attested Old Saxon Baptismal Vow, Old English royal genealogies Thor: Þórr (North Germanic), Þunor (Old English), Thunaer (Old Saxon), Donar (Southern Germanic areas) \"Thunder\"Simek (2007:322). Sif (consort), Járnsaxa Móði and Magni, Þrúðr Most attestations of Germanic paganism.Has a hammer. Týr (Old Norse), Tīw, Tīg (both Old English), Ziu (Old High German) \"god\", derived from Proto- Germanic *TīwazSimek (2007:337). Unnamed, possibly Zisa Seaxnot Poetic Edda, Prose Edda, skaldic poetry, Hadrian's Wall altar Ullr (Old Norse) \"Glory\"Lindow (2001:301). None attested None attested Poetic Edda, Prose Edda, skaldic poetry, Gesta Danorum, Thorsberg chape, toponyms in Norway and Sweden Váli (Old Norse) \"Chosen\" None attested None attested Poetic Edda, Prose Edda, Gesta Danorum (as Bous) Viðarr (Old Norse) \"wide ruler\"Orchard (1997:174—175). None attested None attested Poetic Edda, Prose Edda Vé (Old Norse) VéOrchard (1997:173). Possibly Frigg None attested Poetic Edda, Prose Edda Vili (Old Norse) \"Will\"Simek (2007:363). Possibly Frigg None attested Poetic Edda, Prose Edda ==Goddesses== Name Name meaning Attested consorts and sexual partners Attested children Attestations Baduhenna (Latinized Germanic) Battle None attested None attested Tacitus' Annals Bil (Old Norse) Contested None attested None attested Prose Edda Beyla (Old Norse) \"cow,\" \"bean,\" or \"bee.\"Lindow (2001:78). Byggvir None attested Poetic Edda Eir (Old Norse) \"Peace, clemency\"Lindow (2001:105). or \"help, mercy\"Orchard (1997:36). None attested None attested Poetic Edda, Prose Edda Ēostre (Old English) \"East\"Barnhart (1995:229). None attested None attested De temporum ratione Freyja (Old Norse) (See List of names of Freyja for more) \"Lady\"Lindow (2001:126) Freyr, Óðr Hnoss, Gersemi Poetic Edda, Prose Edda, Heimskringla, Sörla þáttr Frigg (Old Norse) Derived from an Indo-European root meaning \"Love\"Lindow (2001:129). Odin (consort), Vili, Vé Baldr Poetic Edda, Prose Edda, Gesta Danorum, Historia Langobardorum Fulla (Old Norse) Possibly \"bountiful\"Orchard (1997:49). None attested None attested Merseburg Incantations, Prose Edda Gefjun (Old Norse) Related to \"giving\"North (1997:71). Skjöldr, unnamed jötunn Four oxen Prose Edda, Ynglinga saga, Völsa þáttr, Gersemi (Old Norse) \"Treasure, precious object\"Simek (2007:106). None attested None attested Heimskringla Gerðr (Old Norse) \"Fenced in\"Orchard (1997:54). Freyr Fjölnir (Heimskringla) Poetic Edda, Prose Edda, Heimskringla Gná (Old Norse) Possibly related to Old Norse Gnæfa, meaning \"to project\"Lindow (2001:147). None attested None attested Prose Edda Gullveig (Old Norse) Contested None attested None attested Poetic Edda Hariasa Possibly related to the valkyrie name Herja or meaning \"goddess with lots of hair\"Simek (2007:131). None attested None attested Stone from Cologne, Germany (CIL XIII 8185) Hlín (Old Norse) Possibly related to the Old Norse term hleinir, itself possibly meaning \"protects\"Lindow (2001:177). None attested None attested Poetic Edda, Prose Edda Hretha (Old English) Possibly \"the famous\" or \"the victorious\"Simek (2007:159). None attested None attested De temporum ratione Hnoss (Old Norse) \"Treasure\" None attested None attested Prose Edda Ilmr (Old Norse) Potentially related to Old Norse ilmr, a masculine noun meaning \"pleasant scent\"Grimm (1888:1374). None attested None attested Prose Edda, skaldic poetry Iðunn (Old Norse) Possibly \"ever young\"Lindow (2001:199). Bragi None attested Poetic Edda, Prose Edda Irpa (Old Norse) Possibly relating to \"dark brown\"Simek (2007:176). None attested None attested Jómsvíkinga saga, Njáls saga Lofn (Old Norse) Potentially related to \"Praise\"Lindow (2001:213). None attested None attested Prose Edda Nanna (Old Norse) Possibly \"mother\" from nanna, or potentially related to nanþ-, meaning \"the daring one\"Simek (2007:227). Baldr Forseti Poetic Edda, Prose Edda, Gesta Danorum, Chronicon Lethrense, Setre Comb Nerthus (Latinized Germanic, from Proto-Germanic *Nerthuz) Latinized form of what Old Norse Njörðr would have looked like around 1 CE.Lindow (2001:237–238) None attested None attested Germania Njörun (Old Norse) Possibly related to the Norse god Njörðr and the Roman goddess NerioFinnur Jónsson (1913:110) suggests a Njörðr connection, Magnússon (1989:671) suggests Njörðr and Nerio. None attested None attested Poetic Edda, Prose Edda, skaldic poetry Rán (Old Norse) \"Sea\" Ægir Nine daughters Poetic Edda, Prose Edda, Friðþjófs saga hins frœkna Rindr (Old Norse) Possibly related to *VrindrSimek (2007:266). Odin Váli Poetic Edda, Prose Edda, Gesta Danorum Sága (Old Norse) Possibly \"to see\"Lindow (2001:265). None attested None attested Poetic Edda, Prose Edda, skaldic poetry Sandraudiga (Latinized Germanic) \"She who dyes the sand red.\"Nordisk Familjebok (1916:665). None attested None attested North Brabant stone Sif (Old Norse) \"In-law-relationship\"Lindow (2001:266). Thor Þrúðr, Ullr Poetic Edda, Prose Edda Sigyn (Old Norse) \"Victorious girl- friend\"Orchard (1997:146). Loki Nari, Narfi and/or Váli Poetic Edda, Prose Edda Sinthgunt (Old High German) Contested None attested None attested Merseburg Incantations Sjöfn (Old Norse) \"Love\"Lindow (2001:268). None attested None attested Prose Edda Skaði (Old Norse) Possibly related to Scandia.Simek (2007:287). Ullr, Odin, once Njörðr. Sæmingr Poetic Edda, Prose Edda, Ynglinga saga Snotra (Old Norse) \"The clever one\"Simek (2007:296). None attested None attested Prose Edda Sól (Old Norse), Sunna (Old High German) \"Sun\"Orchard (1997:152). Glenr Poetic Edda, Prose Edda, Merseburg Incantations Syn (Old Norse) \"Refusal\"Orchard (1997:157). None attested None attested Prose Edda Tanfana (Latinized Germanic) Unknown None attested None attested Germania, Tamfanae sacrum inscription Þrúðr (Old Norse) \"Power\"Orchard (1997:165). None attested None attested Poetic Edda, Prose Edda, Karlevi Runestone Þorgerðr Hölgabrúðr (Old Norse) Literally \"Þorgerðr Hölgi's Bride\"Simek (2007:326–327). None attested Hölgi, possibly others Jómsvíkinga saga, Njáls saga, Skáldskaparmál, Færeyinga saga Vár (Old Norse) \"Beloved\"Simek (2007:353). None attested None attested Poetic Edda, Prose Edda Vör (Old Norse) Possibly \"the careful one\"Simek (2007:368). None attested None attested Prose Edda Zisa Possibly related to *Tiwaz None attested Possibly Tyr via linguistic connection Codex Monac, Codex Emmeran, and Suevicarum rerum scriptores |Skadi, goddess of snow, and archery ==References== Germanic",
 "title": "List of Germanic deities"
}