{
 "id": "584253",
 "text": "The Earl of Rothes was a title given to the ruler of Leslie, starting with George Leslie in 1458, given the title by James II of Scotland but has now evolved to a completely hereditary title since the local council now rules Leslie and has since around the 1950's. The title is mostfamous for being given to Norman Leslie, husband to Noel Leslie, a titanic survivor who died in 1956. Another title given to the Earl of Rothes from 1445-possibly 1773 which was Lord Leslie but even then was a hereditary title to show their success in the Leslie family and Clan Leslie/Rothes. == Original Earls of Rothes (1458-1680) == Name Became Earl Seized to be Earl Become Lord Birth Died George Leslie (I) sometime 1458 1490 (death) sometime 1445 c. 1417 1490 George Leslie (II) 25th May 1492 1509 (title retired temporaraly) before 1492 1400's 1513 William Leslie (I) 1513 (George's death) Later in 1513 (death) before 1513 1400's 1513 George Leslie (III) 1st April 1517 (probably) 24th November 1558 (death) never (probably) 1400's 1558 Andrew Leslie (I) 24th November 1558 (father's death) 1611 (death) never (probably) before 1541 1611 John Leslie (I) 1621 (recognition as heir) 23rd August 1641 (death) never (probably) 1600 1641 John Leslie (II) 23rd August 1641 (father's death) 1680 (became duke) never (probably) 1630 1681 == Duke of Rothes (1680-1681) == Name Became Duke Seized to be Duke Birth Died Depiction John Leslie, who also served as Earl of Rothes from 1641-1680 and in 1681. He died in 1681, after being earl again for a short time. 1680 1681 (abdicated and became Earl) 1630 1681 == Earl of Rothes restored (1681 -) == Name Birth Death Became Earl or Countess Seized to be Earl or Countess Marriage Margaret Leslie 1600's c. 1700 1681 (husbands death) c. 1700 (her death) John Leslie m. 1648 John Hamilton Leslie 1679 1722 1701 (legitimized as successor) 1722 Lady Jean Hay m. 29th April 1697 John Leslie 1698 10th December 1767 sometime 1722 (fathers death) 10th December 1767 (death) Hannah Howard m. 1741, d. 1763 Mary Lloyd m. 1763, he died 1767 John Leslie April 19th 1744 June 18th 1773 10th December 1767 1773 (death) Jane Maitland m. April 4, 1768 == 19th Century (modern history) == Name Birth Death Term as Earl or Countess Marriage Children Jane E. Leslie May 1750 June 2nd 1810 sometime 1773 - June 1810 George Raymond Evelyn m. 1766, William Evelyn Glanville m. 1772 6 children George W. Leslie March 1768 February 11th 1817 June 1810 - February 1817 2 wifes, one in 1789 and August 1798 6 children Henrietta A. Leslie sometime 1790 January 30th 1819 February 1817 - January 1819 George Gwyther (Leslie when Married) m. 1809 6 children George W. E. Leslie November 1809 March 10th 1841 January 1819 - March 1841 Louisa Leslie m. May 7th of 1831 2 children George W. E. Leslie II February 1835 January 2nd 1859 March 1841 - January 1859 Never married, succeeded by his older sister None Henrietta A. M. Leslie sometime 1832 sometime 1886 January 1859 - 1886 (death) George Waldergrave, m. sometime in 1861 1 child Mary E. Leslie July 1811 September 1893 1886 - September 1893 Martin Edward Haworth-Leslie m. 11th August 1835 Fourteen == 20th Century (modern history) == Name Birth Death Term as Earl or Countess Depiction Norman Evelyn Leslie Husband of titanic survivor \"Noel Leslie\" who died 1955. Earl of Rothes from 1893-1927 and last to stay in Leslie House. Went through the reign of Victoria, Edward VII and nearly to the end of George V's reign. 13th July 1877 29th March 1927 September 19th 1893 - 29th March 1927 Malcolm Leslie Son of Norman and Noel Leslie, brought up in Leslie house but moved to London during the begging of World War I. Went through the reign of George V, Edward VIII, George VI and Elizabeth II (to 1975) 8th February 1902 7th May 1975 29th March 1927 - 7th May 1975 == 21st Century (modern history) == Name Birth Death Term Depiction or Photograph Ian Lionel Malcolm Leslie 10th May 1937 15th April 2005 7th May 1975 - 15th April 2005 James Malcolm David Leslie 4th June 1958 N/A Since 15th April 2005 Yet to be photographed since the start of his term on the 15th April 2005 James Malcolm Leslie has had no children and the heir at the moment is his brother Alexander John Leslie, the master of Rothes who will take over as earl following the death or abdication of James Malcolm Leslie. Category:Scottish Earls",
 "title": "Earl of Rothes"
}