{
 "id": "584458",
 "text": "Smuglyanka (Russian: Смугля́нка, meaning \"the swarthy girl\") is a Russian song. The lyrics tell of a man who met a pretty moldovan woman gathering grapes and tries to seduce her, but finds out that she is a partisan. She then convinces him to join the partisans as well. It was written in 1940 by Yakov Shvedov (lyrics) and Anatoliy Grigoryevich Novikov (music). The song was meant to glorify female partisans in the Russian Civil War. The song is still very popular. == Lyrics == Russian Как-то летом, на рассвете, Заглянул в соседний сад. Там смуглянка-молдаванка Собирает виноград. Я бледнею, я краснею, Захотелось вдруг сказать: — Станем над рекою Зорьки летние встречать! Припев × 2: Раскудрявый клён зелёный – лист резной. Я влюблённый и смущённый пред тобой. Клён зелёный, да клён кудрявый, Да раскудрявый, резной. А смуглянка-молдаванка Отвечала парню в лад: — Партизанский, молдаванский Собираем мы отряд. Нынче рано партизаны Дом покинули родной. Ждёт тебя дорога К партизанам в лес густой. Припев × 2: Раскудрявый клён зелёный – лист резной. Здесь у клёна мы расстанемся с тобой. Клён зелёный, да клён кудрявый, Да раскудрявый, резной. И смуглянка-молдаванка По тропинке в лес ушла. В том обиду я увидел, Что с собой не позвала. О смуглянке-молдаванке Часто думал по ночам … Вдруг свою смуглянку Я в отряде повстречал. Припев × 2: Раскудрявый клён зелёный – лист резной. Здравствуй, парень, мой хороший, мой родной! Клён зелёный, да клён кудрявый, Да раскудрявый, резной. Transliteration Kak-to letom, na rassvete Zaglianul v sosedniy sad. Tam smuglianka-moldavanka Sobirayet vinograd. Ia bledneyu, Ia krasneiu, Zakhotelos vdrug skazat: Stanem nad rekoyu Zorki letniye vstrechat! Chorus × 2: Raskudriavy klion zeliony, list reznoy, Ia vliublionny i smushchenny pred toboy Klion zeliony, da klion kudriavy, Da raskudriavy, reznoy! A smuglianka-moldavanka Otvechala parnyu v lad: — Partizanski, moldavanskii Sobiraem mij otriad. Nynche rano partizany Dom pokinuli rodnoy. Zhdiot tebia doroga K partizanam v les gustoy. Chorus × 2: Raskudriavy klion zelyony, list reznoy, Zdies u kliona mij rastanemcya s toboy, Klen zelyony, da klen kudriavy, Da raskudriavy, reznoy! I smuglianka-moldavanka Po tropinke v les ushla. V tom obidu ia uvidel, Shto s soboj ne pozvala. O smuglianke-moldavanke Chasto dumal po nocham... Vdrug svoyu smuglianku Ia v otriade povstrechal. Chorus x2: Raskudriavy klion zelyony, list reznoy, Zdrastvuy, paren, moi khoroshi, moi rodnoy! Klen zelyony, da klen kudriavy, Da raskudriavy, reznoy! English Somehow in the summer, at dawn, I looked in the neighboring garden. There was a swarthy girl, a Moldavian girl gathering up grapes there. I was growing red, I was growing pale, all of a sudden, I wanted to tell her: \"Let’s meet together all the summer dawns over the river!\" Chorus × 2: The maple, all curly and green, its leaves carved! I'm standing in love and embarrassed in front of you. The green maple, and curly, and all curly and carved! But the swarthy girl, the Moldavian girl answered the lad: \"A Moldavian partisan squad is gathering. Early today the partisans left their homes. The road is awaiting you, the road to the partisans in the deep forest.\" Chorus × 2: The maple all curly and green, its leaves carved! Here, under the maple, we will part. The green maple, and curly, and all curly and carved. And the swarthy girl, the Moldavian girl went away along the footpath into the forest. And I was aggrieved, that she did not call me with. And of the swarthy girl, the Moldavian girl I have often thought at nights … Suddenly my swarthy girl I have met in the squad! Chorus × 2: The maple all curly and green, its leaves carved. Hello lad, my good, my dearest! The green maple, and curly, and all curly and carved. == References == Category:1940s songs Category:1940 works",
 "title": "Smuglyanka"
}