{
 "id": "584690",
 "text": "The Mr. Kentucky Football Award is an award given to the best high school football player in the state of Kentucky and in the Kentucky High School Athletic Association (KHSAA). The award is given out based on the recommendations of sports writers and broadcasters from all across the state. Many of the past winners have gone on to play football in college and become professional football players. == List of winners == Professional teams listed are teams known. Year Player High School College Professional team(s) 1986 Frank Jacobs Newport Central Catholic Notre Dame 1987 Kurt Barber Paducah TilghmanTilghman did not participate in the 2013 McCracken County consolidation, as it is operated by a separate school district. Southern Cal (USC) New York Jets (NFL) - 1992–95 1988 Jeff Brohm Trinity Louisville San Francisco 49ers (NFL) - 1996–97 1989 Pookie Jones Calloway County Kentucky BC Lions (CFL) - 1997-? Louisville Fire (af2) - 2003-? 1990 Damon Hood Warren Central Kentucky 1991 Scott Russell Evarts Lees-McRae Union 1992 Billy Jack Haskins Paducah Tilghman Kentucky Rhode Island 1993 Jeremy Simpson Lincoln County Cumberland (KY) 1994 Shaun Alexander Boone County Alabama Seattle Seahawks (NFL) - 2000-07 Washington Redskins (NFL) - 2008 1995 Tim Couch Leslie County Kentucky Cleveland Browns (NFL) - 1999-2003 Green Bay Packers (NFL) - 2004 BC Lions (CFL) - 2005-2006 Jacksonville Jaguars (NFL) - 2007 1996 Derek Homer Fort Knox Kentucky Baltimore Ravens (NFL) - 2001 Barcelona Dragons (NFL Europe) 2001-02 Lexington Horsemen (UIF) - 2003- 1997 Dennis Johnson Harrodsburg Kentucky Arizona Cardinals (NFL) - 2002-04 San Francisco 49ers (NFL) - 2004 Lexington Horsemen (UIF) - 2005- 1998 Jared Lorenzen Ft. Thomas Highlands Kentucky New York Giants (NFL) - 2004-07 Indianapolis Colts (NFL) - 2008 Kentucky Horsemen (af2)- 2009 Northern Kentucky River Monsters (UIFL) - 2011 Owensboro Rage (CIFL) - 2013 Northern Kentucky River Monsters (CIFL) - 2014 1999 Travis Atwell Hancock County Toledo Kentucky 2000 Montrell Jones Male Tennessee Louisville 2001 James McCoy Fort Campbell Murray State 2002 Michael Bush Male Louisville Oakland Raiders (NFL) - 2007-2012 Chicago Bears (NFL) - 2012-Current 2003 Brian Brohm Trinity Louisville Green Bay Packers (NFL) - 2008 Buffalo Bills (NFL) - 2009-2010 Las Vegas Locomotives (UFL) - 2011-2012 Hamilton Tiger-Cats (CFL) - 2013–present 2004 Curtis Pulley Hopkinsville Kentucky Florida A&M; 2005 Micah Johnson Fort Campbell Kentucky Miami Dolphins (NFL) - 2010 Calgary Stampeders (CFL) - 2013–present 2006 Douglas Beaumont Male Louisville 2007 Corey Robinson Lone OakConsolidated into McCracken County High School as Mustangs on August 9, 2013. Troy Brooklyn Bolts (FXFL) - 2014 2008 Rolandan \"Deuce\" Finch St. Xavier Boston College 2009 Antonio Andrews Fort Campbell Western Kentucky Tennessee Titans 2010 Lamar Dawson Boyle County USC 2011 Patrick Towles Highlands Kentucky 2012 James Quick Trinity Louisville 2013 Nacarius Fant Bowling Green Western Kentucky 2014 Elijah Sindelar Caldwell County Purdue 2015 Kash Daniel Paintsville Kentucky 2016 Jamale Carothers Bowling Green Navy == References == Category:Sports trophies and awards",
 "title": "Mr. Football Award (Kentucky)"
}