{
 "id": "584734",
 "text": "Bae Su-ji (hangul: 배수지; hanja: 裴秀智; born October 10, 1994 in Gwangju) better known by her stage name Suzy, is a South Korean singer, actress, model and TV presenter. She is the maknae of the South Korean girl group miss A, debuting through JYP Entertainment in 2010. Suzy is considered the most beautiful live idol of K-pop, receiving the title \"First Love of the Nation.\" == Early years == Suzy was born in Gwangju, South Korea on October 10, 1994. She attended Seoul Performing Arts High School. Before debuting, she was a model for an online mall. In 2009, Suzy auditioned for the Superstar K talent show. It was approved, but ended up being eliminated from the program. She then auditioned to join JYP Entertainment, getting Park Jin-young's attention and getting approved. A year later, at the same agency, Suzy formed a girl group, temporarily titled JYP Sisters, with Fei and Jia. The girls began their promotional activities in China as a promotional group for Samsung China and they released a song for a commercial called \"Love Again\" for the Samsung Beat Festival. The video for the song allowed auditions to insert a fourth member were opened, causing Min to enter the group, thus forming miss A. == Career == === 2010─2015: Works with miss A === In March 2010, Suzy joined members Fei and Jia to form the miss A group. The trio began their first official promotional activities in China as a group when they signed a contract with Samsung China. The group released a song used for the commercial called \"Love Again\" for the Samsung Beat Festival. The song was written by the Korean composer Super Changddai, and the music video was directed by Hong Won-ki. Later, a fourth member was added to the group, this being Min. The female quartet made its official debut in July 2010 under JYP Entertainment with the single \"Bad Girl Good Girl\". After a successful seven-week promotion period, the group had their return to the music scene in October with a new title track, \"Breathe,\" from the second single Step Up. They promoted the song for a month and had their \"farewell stage\" on November 7. The group returned in July 2011 with the release of their first studio album, A Class, and the title track \"Good Bye Baby\". After achieving great success with their album and title track, the band performed their \"farewell stage\" in early September. They then turned their focus to outdoor activities, making their Chinese debut. In February 2012, they returned with a new musical style through the extended play Touch. In the last quarter of 2012, they released the mini-album Independent Women Pt.III. The album was designed to honor the song \"Independent Women\" from Destiny's Child. On November 6, 2013, after more than a year of inactivity, Miss A made her comeback with a second studio album titled Hush. The song was composed by a famous composer duo, E-Tribe. On March 30 of the following year, the group released a new hit, titled \"Only You,\" produced by Black Eyed Pilseung, from their second mini-album, Colors. === 2010─2013: Solo activities and growing popularity === In October 2010, Suzy became host of the Show! Music Core of MBC with Minho and Onew, both from SHINee, and Jiyeon, from T-ara. Later she presented programs like Inkigayo, M! Countdown, M! Hello Japan Countdown, 21st Seoul Music Awards, 26th Golden Disk Awards with Hongki from F.T. Island and Mnet's 20's Choice Awards with Song Joong-ki, where she won an award under the category \"Hot New Star of 2011\". Since then, Suzy has continued to host many music program events for major awards ceremonies. In addition to her group activities, Suzy is also an actress. She made her debut in the high school drama Dream High, which was aired on KBS from January 3 to February 28, 2011. Suzy also released a soundtrack for the drama, titled \"Winter Child.\" The drama was a success, bringing high ratings to the range of 18 to 20 percent during its two-month broadcast. She also gained popularity in other countries and received several international awards. At the KBS Drama Awards, Suzy won the awards for Best New Actress and Best Couple, winning the latter with co-star Kim Soo-hyun. In October 2011, Suzy became a member of the KBS Invincible Youth 2 reality show. The show began filming its first episode on October 19 and aired on November 11. On November 4, 2011, it was revealed that Suzy would make a surprise appearance in the new music video of Son Ho-young, a former member of the g.o.d group, entitled \"Pretty but Hateful.\" She captivated audiences with her natural beauty and innocent charm, and also left a strong impression for being able to cry at the beginning of the music video. In 2012, Suzy showed her support for the Pink Wings campaign, organized by the Korean Citizens' Coalition for Teens, attending the special photo shoot held by Vogue Girl. On March 22, 2012, she made her film debut in the film Introduction to Architecture starring the younger version of the protagonist. Architecture 101 was one of the ten most watched films in Korea in the first quarter of 2012 and reached more than 4,1 million at the box office nine weeks after theatrical release; A new box office record for Korean melodramas. Suzy made a lasting impression with her natural acting and innocent charm; And was finally honored with the title \"First Love of the Nation\". In the same year, Suzy also starred in KBS's drama Big, written by Hong Sisters, opposite Gong Yoo and Lee Min-jung. Suzy was announced as the first Korean female celebrity to reach more than a million followers on Twitter. She is also Korea's first female celebrity to win a rookie award for singer, drama actress and film actress, having won the Best New Actress Award at the 48th Baeksang Arts Awards for her performance in Architecture 101. December 22, 2012, Suzy won the Best Newcomer Award in the Variety category at the KBS Entertainment Awards for her role in Invincible Youth 2, marking her 4th rookie award in different fields of entertainment and showing her versatility as a complete artist. In June 2013, the historic action drama Gu Family Book was broadcast, where Suzy starred with Lee Seung-gi. The drama garnered extremely high ratings, peaking at number one spot in the time span from Monday to Tuesday throughout the period of its broadcast. She received recognition for her performance in the drama at the MBC Drama Awards, winning the Top Excellence Award. She also appeared on the Healing Camp talk show, Are not You Happy, becoming the youngest guest on the show. The following year, Suzy made a cameo appearance in My Love from the Star, starring Kim Soo-hyun, her previous Dream High co-star. === 2014─present: Commercial success and Yes? No? === In 2014, Suzy was hailed \"Queen of the Commercials\" due to her numerous endorsements deals, ranging from cosmetics and clothing to basic commodities like sugar. In May, Suzy was cast for the movie The Sound of a Flower playing the character Jin Chae-sun, Korea's first female pansori singer. The film portrays the struggle of a singer who has no right to appear to the public because of her gender during the Joseon Dynasty. To prepare for the role, Suzy received Pansori training for a year. The Sound of a Flower premiered on November 25, 2015. In the same year, Suzy collaborated with Taiwanese singer-actor Show Luo on the single \"Together In Love.\" In January 2016, Suzy released a digital single titled \"Dream\" with Baekhyun, one of EXO's lead vocalists. The song quickly reached the top of the charts online in real time and debuted at the top of the Gaon weekly digital chart. \"Dream\" was a great success, receiving five awards from music programs and the Best Collaboration Award from the Mnet Asian Music Awards. She then starred in the drama melo-romance Uncontrollably Fond with actor Kim Woo-bin. The drama debuted in July 2016, and was broadcast simultaneously in 11 countries; Korea, the United States, China, Japan, Malaysia, Singapore, Taiwan, Thailand, Philippines, Vietnam and Cambodia. Suzy has released two soundtracks for the drama, \"Ring My Bell\" and \"When It's Good,\" the latter having been self-made. In September 2016, a wax sculpture of her at Madame Tussauds in Hong Kong had her exhibition. Suzy is the first Korean celebrity to receive a wax sculpture in the museum of wax figures. In November 2016, it was confirmed that Suzy will be starring alongside Lee Jong- suk in the drama While You Were Sleeping, which will premiere in 2017. This drama will mark the second collaboration between her and screenwriter Park Hye-ryun, after working together in the hit drama of 2011 Dream High. On January 23, 2017, Suzy made her debut as a solo singer through the release of the title track \"Yes No Maybe\" and the extended play Yes? No? The week before its release on January 17, Pretend was released, a pre-release single that quickly reached an all-kill on South Korean music charts. For the promotions of her EP, Suzy starred in her own reality show titled Off the Record: Suzy. On February 28, 2017, she collaborated with singer Park Won in a duet titled \"Don't Wait For Your Love\". == Discography == ; Extended play * 2017: Yes? No? == Filmography == ===Film=== Year Title Role Notes 2012 Architecture 101An Introduction to Architecture (Movie – 2012). Hancinema.net (January 16, 2012). Retrieved on 2012-01-29. Yang Seo-yeon (young) 2015 The Sound of a Flower Jin Chae-seon 2017 Real Cameo ===Television series=== Year Title Role TV Network Notes 2011 Dream High Go Hye-mi KBS2 Human Casino (Drama Special) Cameo 2012 Dream High 2 '드림하이2', 초호화 카메오 군단 예고 . Star Today. December 29, 2011. Herself Cameo I Need a FairySuzy to make a cameo appearance on KBS2 ‘I Need a Fairy’. allkpop. March 23, 2012. 수지, '선녀가 필요해' 깜짝출연...박민우와 러브라인?. Nate. April 3, 2012. Aspiring actress Cameo BigGong Yoo, Lee Min Jung, and miss A’s Suzy confirmed for drama, ‘Big’. allkpop. April 12, 2012. 수지, '빅' 출연 확정...공유 두고 이민정과 자존심 대결. Nate. April 13, 2012. Jang Ma-ri 2013 Gu Family BookLee Seung Gi and miss A’s Suzy to act together in drama ‘Guga Medical Book’?. allkpop. October 18, 2012. 이승기·수지, 내년 4월 '마의' 후속으로 안방 인사. Naver. December 13, 2012.Lee Seung Gi and Suzy’s ‘Guga Medical Book’ drama to air in April through MBC. allkpop. December 12, 2012. Dam Yeo-wool MBC 2014 My Love from the Star Go Hye-mi SBS Cameo (ep 17) 2016 Uncontrollably Fond Noh-eul KBS2 2017 While You Were Sleeping Nam Hong-ju SBS ===Show appearance=== Year Title Role Network Notes 2010 Show! Music Core Special host MBC with 2PM's Nichkhun Inkigayo SBS with Jo Kwon and CNBLUE's Jung Yong-hwa 2010–2011 Show! Music Core Main host MBC with T-ARA's Park Ji-yeon and SHINee's Choi Min-ho and Onew 2011 5th Mnet 20's Choice Awards Host Mnet with Song Joong-ki Win Win Special host KBS2 with Kim Sung-soo and Jung Jae-young Cover Dance Festival K-Pop Roadshow 40120 Judge / Narrator MBC Judges with miss A's Min and f(x)'s Victoria and Amber 2011–2012 Invincible Youth 2 Member of G8 ® G6 ® G5 KBS with Girls' Generation's Sunny and Hyoyeon, f(x)'s Amber, SISTAR's Bora, Jewelry's Yewon, Rainbow's Woori and KARA's Jiyoung with Boom, Ji Hyun-woo, Lee Su-geun, Kim Shin Young and Lee Young Ja serving as hosts. 2012 26th Golden Disk Awards Host jtbc with FTISLAND's Lee Hong-gi M! Countdown Special host Mnet with John Park M! Countdown Hello Japan Host with Lee Joon 18th Korea Musical Awards SBS with Kim Won-jun College Music Festival MBC with Lee Juck M! Countdown Special host Mnet with FTISLAND's Lee Hong-gi Show! Music Core MBC with miss A's Min and B.A.P's Daehyun Style Log: Weekly – Much Wanted Life Narrator OnStyle 11th KBS Entertainment Awards Host KBS2 with Shin Dong-yup and Lee Ji-ae SBS Gayo Daejeon SBS with IU and Jung Gyu-woon 2013 Korea Music Wave in Bangkok MBC with 2PM's Nichkhun, SHINee's Choi Min-ho, Jo Kwon and T-ARA's Park Ji-yeon 8th Seoul International Drama Awards with Lee Sung-jae Real Men Narrator Music Bank in Istanbul Host KBS with Super Junior's Kyuhyun and Highlight's Yoon Doo-joon KBS Gayo Daejun with Lee Hwi-jae and Yoon Shi-yoon 2014 Connection Narrator OnStyle, XTM with Roy Kim 2016 52nd Baeksang Arts Awards Host jTBC with Shin Dong-yup 2017 Off The Record, Suzy Herself Dingo Music YouTube, V LIVE First own solo reality show 53rd Baeksang Arts Awards Host jTBC ===Variety shows=== Year Title Role Episode Network 2011 Happy Together Guest with Dream High cast 177 SBS 2011–2014 Running Man Guest 55, 93–94, 117, 155, 172–173, 208 2012 Weekly Idol Guest with Miss A 35–36, 69–70 MBC Every 1 2013 Healing Camp, Aren't You Happy Guest 101 SBS After School Club Guest with Miss A 32 Arirang Happy Together Guest with Fei 325 KBS2 2 Days & 1 Night Guest – Morning Angel 322 KBS2 2014 I GOT7 Guest 3–4 2015 Happy Together Guest 392 KBS2 Real Miss A Host with Miss A YouTube, Naver ===Music video appearance=== Year Song title Artist Role 2011 Pretty But Hateful Son Ho-young Main Female Character == References == == Other websites == * Instagram Category:1994 births Category:JYP Entertainment artists Category:K-pop singers Category:Living people Category:South Korean models Category:South Korean movie actors Category:South Korean singers Category:South Korean television actors",
 "title": "Bae Suzy"
}