{
 "id": "584727",
 "text": "William Sebastian Cohen (born August 28, 1940) is an American politician and author from the U.S. state of Maine. He is a member of the Republican Party. Cohen was a member of the city council of Bangor, Maine from 1969 to 1972, and also was mayor of this city from 1971 to 1972. He served as both a member of the United States House of Representatives and United States Senate from Maine, and as Secretary of Defense (1997–2001) under Democratic President Bill Clinton. BBC News hired Cohen as a world affairs analyst in May 2016. Cohen appears in this capacity on BBC World News America and other broadcasts. He also serves as an Advisory Board member for the Partnership for a Secure America. Cohen is also a member of the ReFormers Caucus of Issue One. ==Personal life== William Cohen is partly of Jewish descent (his father was Jewish). On February 14, 1996, Cohen and Janet Langhart were married. Langhart is a former model, Boston television personality, and BET correspondent. Janet Langhart was known as the \"First Lady of the Pentagon\" during Cohen's tenure as Secretary. Cohen served as Best Man in then-Senate Naval Liaison John McCain's second wedding (Gary Hart was a groomsman). McCain later became his Senate colleague. ==United States Holocaust Memorial Museum shooting== On the afternoon of June 10, 2009, Cohen was present at the United States Holocaust Museum, waiting for his wife Janet Langhart, for the world premiere of her one-act play, Anne and Emmett. The play imagines a conversation between Anne Frank and Emmett Till. While Cohen waited, an elderly man with a long gun attacked the facility, fatally shooting a security guard before being wounded himself by the other guards. Cohen and his wife were not injured during the attack. ==2016 U.S. presidential election== During the 2016 U.S. presidential election, Cohen joined many Republicans in breaking with party ranks to oppose the candidacy of Republican nominee Donald Trump. He endorsed Democratic nominee former Secretary of State Hillary Clinton. ==References== ==Other websites== * Official biography via the Department of Defense * * * Thursday October 2009 Audio interview about government terrorism, individual liberty and foreign war policies. University of Illinois in-depth radio programs on Focus 580 * William Cohen to Co-Chair Genocide Prevention Task Force * Biography from the William S. Cohen Archive, University of Maine Fogler Library * Voting record maintained by the Washington Post Category:1940 births Category:Living people Category:American mayors Category:Boston University alumni Category:United States representatives from Maine Category:United States Secretaries of Defense Category:United States senators from Maine Category:Republican Party (United States) politicians Category:Politicians from Bangor, Maine Category:21st-century American politicians Category:20th- century American politicians Category:Recipients of the Order of the Rising Sun",
 "title": "William Cohen"
}