{
 "id": "585014",
 "text": "The Emoji Movie is a 2017 animated family comedy adventure movie from Sony Pictures. It is about little faces used to text with called, \"emojis.\" Emojis are part of United States pop culture. The movie is about 3 emojis going on an epic adventure in a smartphone to save them from deletion. ==Plot== Gene is a “meh” emoji in the phone of a teen named Alex. He is the son of two other “meh” emojis, Mel and Mary Meh. Gene is not like other emojis because he has more than just one emotion. Alex decides to send Gene to a girl he likes, Addie McCallister, but Gene panics. This results in Alex sending an emoji with a weird face to Addie and Gene wrecking his workplace in the phone. Gene is threatened with deletion by a powerful Emoji called Smiler but is rescued by another Emoji called Hi-5 who tells Gene that he can be fixed if they find a hacker. In the human world, Alex has started to think that his phone is broken. Back in the phone, Hi-5 and Gene visit another app and meet another emoji, a hacked called Jailbreak who wants to go to the cloud. The three emojis are chased by Smiler’s robots from app to app. During the adventure they also find out Jailbreak is actually a princess. A relationship starts to form between Gene and Jailbreak. The trio make it to the cloud where Jailbreak is about to reprogram Gene. Just then, one of Smiler’s robot sneaks into the cloud and captures Gene. Hi-5 and Jailbreak chase after them on a Twitter bird. As Smiler is about to delete Gene, Gene’s parents arrive, and Mel reveals he also has more than one emotion. Jailbreak and Hi-5 arrive and stop Smiler’s robot, which falls on top of Smiler. In the human world, Alex is preparing to do a factory reset, which will destroy the emoji world. Just before the reset, Gene has himself texted to Addie. This stops Alex from doing the reset and stops the emoji world from being destroyed. He finally speaks with Addie, who likes Gene’s face-changing powers. Gene learns to accepts himself and all the emojis throw a party except Smiler, who is sent to a club for unpopular emojis as shown in the end credits. ==Reviews== This movie received extremely bad reviews from critics. They did not like the plot of the movie, because they think the movie was lazily created and simply designed for advertising product placement of apps like Candy Crush Saga, Just Dance and Dropbox. They also stated that The Emoji Movie lacks originality and is too similar to other, better movies like Wreck-It Ralph, The Lego Movie and Inside Out. With a rating of 6% rating on Rotten Tomatoes, it is the worst reviewed animated movie of 2017. ==Music== The music for the Emoji Movie was composed by Patrick Doyle. ==References== Category:2017 comedy movies Category:2017 science fiction movies Category:American animated movies Category:American science fiction movies Category:American comedy movies Category:2017 computer- animated movies Category:Sony Pictures Animation movies",
 "title": "The Emoji Movie"
}