{
 "id": "585252",
 "text": "Yung Mung Sung () is a 2018 Tamil language action comedy movie written and directed by M. S. Arjun. Prabhu Deva was the lead role in the movie and Lakshmi Menon was selected as the lead heroine of it while Thangar Bachan and RJ Balaji play other pivotal roles. The movie began production in February 2017. It is based on the real-life story of how the first Kung Fu Robber, Bhairavan was put in jail in the 1980s. The movie was theatrically released on March 30, 2018. It received positive reviews from critics for Deva's performance. ==Cast== * Prabhu Deva as Detective Rajan Rugam, Shanmugam's youngest son. He and Latika are the next Kung Fu Masters of Tamil Nadu. * Lakshmi Menon as Reeka Rugam, Rajan's wife and his detective assistant * Thangar Bachan as Shanmugam Rugam, Latika and Rajan's Kung Fu teacher. He is also the original Kung Fu Master of Tamil Nadu. * RJ Balaji as Kalian, Bhairavan's fourth accomplice * Kaal Venkat as Akshiv in a special appearance in the first song of the movie, Yung Mung Sung Title Track * Uma Padmanabhan as Lakshmi in a special appearance in the first song of the movie, Yung Mung Sung Title Track * Prabhakar as Bhairavan Rugam, Rajan's older brother and the first Kung Fu Robber * Chithra Lakshmanan as Sambantham, Bhairavan's second accomplice * Ashwin Raja as Sung, Bhairavan's third accomplice * Swamimathan as Veeram, Bhairavan’s fourth accomplice ==Production== Prabhu Deva agreed on terms to work with newcomer Arjun for the comedy movie Yung Mung Sung in January 2017, with Vasan Visual Ventures taking the role of producers. Actors Thangar Bachan and RJ Balaji were also recruited for the movie, with the former signed to feature as the father of Deva's character. The team held talks with Catherine Tresa to play the lead actress. Her unavailability led the team to cast Lakshmi Menon in the role. Prabhu Deva was revealed to be playing a detective who becomes a Kung Fu Master in the movie. The movie began production on 9 February 2017 following a launch event held in Chennai. ==Release== Yung Mung Sung is releasing on summer 2025 ==References== Category:2018 movies Category:Tamil-language movies",
 "title": "Yung Mung Sung"
}