{
 "id": "585902",
 "text": "Leo Eric Varadkar ( ; born 18 January 1979) is an Irish politician and physician. He was the Taoiseach from 2022 to 2024, previously serving in the role from 2017 to 2020. He was the Minister for Defence from 2017 to 2020. From 2020 to 2022, he was the Tánaiste. He was the Leader of Fine Gael, elected in June 2017 to replace Enda Kenny. He has served as Minister for Social Protection since May 2016. He has been a Teachta Dála (TD) since 2007 for the Dublin West constituency. In March 2024, Varadkar announced his resignation as Taoiseach and Simon Harris was soon elected as his replacement. ==Early career== In 2004 he was co-opted onto Fingal County Council and served as deputy mayor before his election to Dáil Éireann. He was promoted to the Front Bench by Enda Kenny as Spokesperson on Enterprise, Trade and Employment, remaining in this position until a 2010 reshuffle when he became Spokesperson on Communications, Energy and Natural Resources. After the formation of the Coalition Government in March 2011, he was appointed Minister for Transport, Tourism and Sport. A cabinet reshuffle in July 2014 saw Varadkar appointed to the position of Minister for Health. During his tenure he became the first openly gay Irish government minister. Following the formation of a Fine Gael minority government in May 2016, he was appointed Minister for Social Protection. ==Taoiseach== ===2017 Fine Gael leadership election=== After the resignation of Enda Kenny as Leader of Fine Gael in May 2017, Varadkar announced his candidacy for party leader. He faced Minister for Housing Simon Coveney in the Fine Gael leadership election. He won the election on 2 June 2017. On 14 June, he was nominated as Taoiseach by Dáil Éireann and this nomination was approved by the President of Ireland. Varadkar became Ireland's first openly gay Taoiseach, as well as the youngest and the first of half- Indian descent. ===Defeat=== On 26 June 2020, it was announced that Fine Gael, Fianna Fáil and the Green Party had agreed to form a coalition government, marking the first time the two main Irish parties had formed a government together. As part of the agreement, Fianna Fáil leader Micheál Martin held the office of Taoiseach until December 2022, while Varadkar took the position of Tánaiste. The pair then swapped roles after roughly two and a half years, with Varadkar retaking the position of Taoiseach for the remainder of the coalition's term. Martin was elected Taoiseach by the Dáil on 27 June. ===Second term as Taoiseach=== On 17 December 2022, Varadkar was appointed as Taoiseach for a second time, following Micheál Martin's resignation to President Michael D. Higgins. On 13 April 2023, Varadkar met with U.S. President Joe Biden at Farmleigh House during his four-day visit to the island of Ireland. On 6 May 2023, Varadkar, along with President Michael D. Higgins, attended the Coronation of Charles III and Queen Camilla, marking the first time a serving taoiseach attended the coronation of a British monarch. On 20 March 2024, Varadkar announced his intention to step down as Taoiseach and Fine Gael leader, saying that he was no longer \"the best person for the job\". * * * He said his \"reasons for stepping down are both personal and political\". He said that his resignation as Fine Gael leader would be with immediate effect, and that he would continue in office as Taoiseach pending the election of a new party leader on 6 April. ==Personal life== Varadkar is openly gay He is first openly gay cabinet member in Ireland. His partner is Matthew Barrett. ==References== ==Other websites== * *Leo Varadkar's page on the Fine Gael website Category:1979 births Category:Living people Category:Taoisigh of Ireland Category:LGBT politicians Category:Members of Fine Gael Category:Gay men Category:LGBT rights activists Category:Politicians from Dublin",
 "title": "Leo Varadkar"
}