{
 "id": "586059",
 "text": "The Boutonne is a river of western France that flows through the Deux-Sèvres and Charente-Maritime departments, in the Nouvelle-Aquitaine region. It is a right tributary of the Charente river. ==Geography== The Boutonne has a length of , and a drainage basin with an area of approximately . Its average yearly discharge (volume of water which passes through a section of the river per unit of time) is at Saint-Séverin-sur-Boutonne in the Charente-Maritime department, at an altitude of . Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:500 height:300 PlotArea = left:50 bottom:30 top:30 right:30 DateFormat = x.y Period = from:0 till:15 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:5 start:0 ScaleMinor = gridcolor:lightgrey increment:1 start:0 BackgroundColors = canvas:sfondo BarData= bar:Jan text:Jan. bar:Feb text:Feb. bar:Mar text:Mar. bar:Apr text:Apr. bar:May text:May bar:Jun text:Jun. bar:Jul text:Jul. bar:Aug text:Aug. bar:Sep text:Sep. bar:Oct text:Oct. bar:Nov text:Nov. bar:Dec text:Dec. PlotData= color:barra width:20 align:left bar:Jan from:0 till: 11.60 bar:Feb from:0 till: 12.20 bar:Mar from:0 till: 8.860 bar:Apr from:0 till: 7.240 bar:May from:0 till: 5.180 bar:Jun from:0 till: 3.250 bar:Jul from:0 till: 1.480 bar:Aug from:0 till: 0.922 bar:Sep from:0 till: 0.976 bar:Oct from:0 till: 2.070 bar:Nov from:0 till: 4.620 bar:Dec from:0 till: 8.010 PlotData= bar:Jan at: 11.60 fontsize:S text: 11.60 shift:(-8,5) bar:Feb at: 12.20 fontsize:S text: 12.20 shift:(-12,5) bar:Mar at: 8.860 fontsize:S text: 8.860 shift:(-12,5) bar:Apr at: 7.240 fontsize:S text: 7.240 shift:(-12,5) bar:May at: 5.180 fontsize:S text: 5.180 shift:(-12,5) bar:Jun at: 3.250 fontsize:S text: 3.250 shift:(-12,5) bar:Jul at: 1.480 fontsize:S text: 1.480 shift:(-12,5) bar:Aug at: 0.922 fontsize:S text: 0.922 shift:(-12,5) bar:Sep at: 0.976 fontsize:S text: 0.976 shift:(-12,5) bar:Oct at: 2.070 fontsize:S text: 2.070 shift:(-12,5) bar:Nov at: 4.620 fontsize:S text: 4.620 shift:(-12,5) bar:Dec at: 8.010 fontsize:S text: 8.010 shift:(-12,5) Average monthly discharge (m3/s) at Saint-Séverin- sur-Boutonne (1969-2017) ===Course=== The Boutonne starts in the southeast of the Deux-Sèvres department, in the commune of Chef-Boutonne (that is, \"Head of the Boutonne\"), at an elevation of about . It flows to the west and, later, to the southwest through the Deux-Sèvres and Charente-Maritime departments before flowing, at almost right angle, into the Charente river in Cabariot at about of altitude. The Boutonne flows through 1 region (Nouvelle-Aquitaine), 2 departments and 41 communes; they are, from source to mouth: * Deux-Sèvres: Chef-Boutonne (here is the source of the river), Fontenille-Saint- Martin-d'Entraigues, Chérigné, Lusseray, Brioux-sur-Boutonne, Vernoux-sur- Boutonne, Séligné, Brieuil-sur-Chizé, Villefollet, Villiers-sur-Chizé, Chizé, Le Vert (the last commune of Deux-Sèvres in the course of the river). * Charente-Maritime: Dampierre-sur-Boutonne (the first commune where the Boutonne gets into the department), Saint-Séverin-sur-Boutonne, Coivert, Blanzay-sur-Boutonne, Saint-Georges-de-Longuepierre, Saint-Martial, Saint- Pierre-de-l'Isle, Nuaillé-sur-Boutonne, Saint-Pardoult, Les Églises-d'Argenteuil, Antezant-la-Chapelle, Vervant, Poursay-Garnaud, Courcelles, Saint-Julien-de-l'Escap, Saint-Jean-d'Angély (main city in the course of the river), Ternant, La Vergne, Voissay, Torxé, Les Nouillers, Tonnay-Boutonne, Puy-du-Lac, Archingeay, Saint-Coutant-le-Grand, Champdolent, Lussant, Cabariot (place where the river flows into the Charente river). Seven communes have the name of the river in their names: Chef-Boutonne, Saint- Séverin-sur-Boutonne, Dampierre-sur-Boutonne, Tonnay-Boutonne, Blanzay-sur- Boutonne, Nuaillé-sur-Boutonne, Vernoux-sur-Boutonne. ==Main tributaries == The main tributaries of the Boutonne river are: Left tributaries: * Nie - 26 km Right tributaries: * Béronne - 29.5 km * Belle - 25 km * Trézence - 27.7 km, the main tributary of the Boutonne ==Gallery== File:Pont Boutonne 001.jpg|Bridge over the Boutonne in Bel-Ébat. File:Tonnay-Boutonne 001.jpg|Bridge in Tonnay-Boutonne. File:Pont sur la Boutonne à Dampierre-sur- Boutonne.JPG|The Boutonne flowing through Dampierre-sur-Boutonne. ==Related pages== * List of rivers of France == References == ==Other websites== * Banque Hydro - Station R6092920 - La Boutonne à Saint-Séverin-sur-Boutonne Category:Rivers of Nouvelle-Aquitaine",
 "title": "Boutonne"
}