{
 "id": "58629",
 "text": "The Thirty Years' War was fought from 1618 to 1648. It was fought primarily in Germany, but several other countries became involved in the conflict, including France, Spain, and Sweden. In fact, almost all of the powerful countries in Europe were involved in the war, which began as a fight about religion between Protestants and Catholics. As the war continued, the Catholic Habsburg dynasty and other countries used the war to try to get more power. For example, Catholic France fought for the Protestants, which made the French-Habsburg rivalry even worse. The Thirty Years' War caused things like famine and disease in almost every country involved. The war lasted for 30 years, but the problems that had caused the war were not fixed for a long time after the war had been over. The war ended with the Treaty of Westphalia. == Causes == There were several reasons that the Thirty Years' War started. Firstly, the Peace of Augsburg (1555), which was signed quickly by Charles V, stopped the fighting between the Lutherans and the Catholics in Germany. The Peace of Augsburg stated: * The 225 German princes would choose the religion (whether they were Lutheran or Catholic) in their states (cuius regio eius religio). * Lutherans who lived in a state under the control of a bishop, called an ecclesiastical state, could stay Lutherans. * Lutherans could keep the land that they had taken from the Catholic Church after the Peace of Passau (1552). * The bishops of the Catholic Church who switched to Lutheranism had to give their lands back (reservatum ecclesiasticum). * People that lived in a state that had chosen Lutheranism or Catholicism were not allowed to change their religion. The Peace made the violence end somewhat, but it did not fix the real reason for the fighting. Both groups thought that the Peace meant different things. The Lutherans said it was only an agreement that would last for a short time. Calvinism came quickly into German as a third Christian group in Germany, but it was not part of the Peace of Augsburg. That meant that Calvinists fought both Lutherans and Catholics. Secondly, the powerful countries in Europe in the 17th century often disagreed about matters of politics or economics. Spain wanted land in some of the Holy Roman Empire states in what is now Germany because the empire owned some of the Spanish Netherlands. The Dutch fought the Spanish to get independence and got it after some wars, which ended in 1609. * France was afraid having two Habsburg states on its borders (Spain and the Holy Roman Empire). France wanted to show its power to the weak German states. * Sweden and Denmark wanted to control the German states in the north next to the Baltic Sea. Thirdly, the Holy Roman Empire was a broken group of nations inside a large empire, which had nations like the Austrian House of Habsburg, Bavaria, the Electorate of Saxony, the Margravate of Brandenburg, the Electorate of the Palatinate, Hesse, the Archbishopric of Trier and Württemberg and other small nations and towns. Only Austria was capable of operating on its own. Countries often made alliances with other places ruled by relatives. Because there were so many nations inside the empire, they often disagreed with one another, and the empire could not control the whole territory very well. That meant that the empire could not fix the problems in the whole country. Fourthly, religious groups did not agree during the second half of the 16th century. The Peace of Augsburg did not work because some bishops had not given up their bishoprics, and Catholic rulers in Spain and Eastern Europe wanted to make Catholicism strong in the region, which caused fighting between the groups. The Catholics made many Protestants leave their homelands. Some places gave Protestants permission to worship. Those disagreements caused violence. Fifthly, Holy Roman Emperor Matthias, a Catholic, died without any children to take his place in 1619. His lands were given to his cousin Ferdinand of Styria, Matthias's closest male relative, who became Ferdinand II, Holy Roman Emperor. Ferdinand had been educated by the Jesuits. A Catholic, he wanted to make Catholicism the only religion again. That made him unpopular in the German state of Bohemia since most people there were not Catholics but Hussites. The Bohemians rejected Ferdinand and launched the Thirty Years' War. The war can be divided into four major phases: the Bohemian Revolt, the Danish intervention, the Swedish intervention, and the French intervention. == Bohemian Revolt == Time: 1618–1625 Emperor Mattias, who had no children, wanted to give the throne of the Holy Roman Empire to Ferdinand II when he died. To ensure that the transition would work, he wanted to make Ferdinand the Crown Prince of Bohemia, a country that was part of the Holy Roman Empire, in the meantime. Some of the Protestant leaders of Bohemia thought that Ferdinand would take away their religious rights. They liked the Protestant Frederick V, Elector of the Palatinate better. However, some of the other Protestants supported Ferdinand. Enough people preferred Ferdinand that in 1617, he was elected to become the Crown Prince of Bohemia. Ferdinand sent two Catholic governors to Prague, the capital of Bohemia, in May 1618. Ferdinand wanted them to run the government while he was gone. Suddenly, many angry Protestants took them and threw them out of the high palace window (The Defenestration of Prague), that made the Catholics angry with the Protestants. The Protestants who had thrown the Catholics out the window created a new Protestant government in Bohemia. Many Protestants in Bohemia and the nearby countries started hating the rest of the Holy Roman Empire. The Holy Roman Empire wanted to stop them from doing so, to fight Bohemia, and borrow Spain's money. However, they thought that if that happened, Bohemia's Protestant friends might come in and start fighting them. That made them try to make an agreement with Bohemia to stop the fighting. However, when Emperor Matthias died in 1619, Bohemia decided not to make the agreement because they thought the Holy Roman government was weak now. Bohemia was so angry about the Catholics it they decided to not make Ferdinand II the king of Bohemia anymore and but made Frederick V the king instead. However, because Matthias was dead and so Ferdinand was the next person waiting to be the emperor, Ferdinand was in charge of the whole Holy Roman Empire now. Some people also thought Frederick should not be allowed to be king of Bohemia. All of that made the Holy Roman Emperor decide to fight Bohemia. A large army got money from Maximilian I was led by Count Tilly invaded Bohemia. At the Battle of White Mountain, the Holy Roman Empire beat the Bohemian rebels. Frederick ran away. and the revolt collapsed. Frederick was also in charge of a German nation called the Palatinate. Maximilian I, who was in charge of a nearby nation, Bavaria, wanted more power and decided to take over some of the Palatinate. Spain, a Catholic country,. joined the war to help Maximilian, who was disliked in the Netherlands. Other countries now became involved in this war. After some fighting, Maximilian and Spain won, and Emperor Ferdinand decided that all of the Palatinate should go to Maximilian. That made some of the other Protestant nations very scared because that meant that Protestant areas were being taken over by Catholics. ==Related pages== *Battle of White Mountain Category:17th century in Europe Category:Wars involving England Category:Wars involving France",
 "title": "Thirty Years' War"
}