{
 "id": "586361",
 "text": "Gou Bu Li Baozi is a group of restaurants in Tianjin, China, that sells steamed buns, one of the most popular foods in the area. Gou Bu Li Baozi was established in 1858. Gou Bu Li’s shop is one of the oldest and most famous shops in that city. In 1960, the Gou Bu Li baozi went out of China to foreign countries. Now there are so many shops in China. == History == Gou Bu Li Baozi was founded in the Qing Dynasty in 1858. It was started by Gao You Gui when he was young, His family named him \"young dog\". He lived in Tianjin when he was very young. He was a worker in Liu's store. It took him three years to learn how to make Baozi very pleasing and beautiful. Firstly, he started a store called \"cheap and friendly store\". Because his Baozi is very very pleasing, many people went to his store. So that he is too having much to do to talk with the persons getting goods from store. So his person getting goods from store called him dog ignored. That's why \"Gou Bu Li \"is so greatly respected and so many people called it that until now. When Yuan Shikai was teaching in the army in Tianjin, he presented Gou Bu Li baozi to Queen Dowager Cixi. She was very pleased and said, \"Gou Bu Li baozi is so delicious that it surpasses the meat of animals in the mountains or the seafood in the sea. After eating it, I feel rejuvenated like a young person.\" After this, Gou Bu Li baozi gained even greater respect. In the 1920s, with the Tianjin advertising industry moving south and encroaching on land rights, Gao Yougui didn't consider relocating his bun store and moved to Tianxiang Market in Tianjin. However, after this move, business declined significantly and was on the verge of closure for a long time. As the Republic of China began to form, many private companies transitioned from being solely private to adopting a public- private model. On March 15, 1956, the Tianjin Food Company opened a Gou Bu Li baozi store at the Park Ruizhuang location on Shandong Road in Tianjin. From then on, Chinese leaders frequented the store, elevating its importance. == Recent events == * In 1988, Gou Bu Li baozi have so many restaurants * In 1992, Gou Bu Li baozi's company was founded * During the Spring Festival in 2000, Feng Gong and Guo Donglin show comic \"old song new singing\", it is about Gou Bu Li baozi. * In 2005, Gou Bu Li was bought by Tong Ren Tang with 100 million yuan. * In February 25th, 2008. Gou Bu Li have a English name called \"go believe\" until now. A writer called Sidney Sheldon write a book called 《If Tomorrow Comes have the go believe baozi. == How to make it == Gao You Gui is a ratio of 3 to 7 fat and fresh pork and even with the right amount of water, ribs soup and belly soup, and accompanied by sesame oil, soy sauce, ginger, diced green onions made into stuffing. The steamed buns will be half of the rubbing, after the release agent, roll into a diameter of 8.5 cm and thick uniform round skin. Pack with your fingers with a pinch and twist open, so there will be 18 pleats, looking like a flower, and finally steam the buns. Do not use jam. Use mushroom and chicken or special flour to make sure the baozi is small and delicious. And so many people had learn the method of how to make baozi but his baozi never be surpassed. == Protecting the logo == In 1980, Gou Bu Li has the logo. In 1992 Gou Bu Li became the first one that have a logo. At present, the Gou Bu Li has been registered in the 11 international classification, service trademark in 1999 by the State Administration for Industry and Commerce Trademark Office identified as \"China Famous Brand\", which is the commercial value of its brand affirmed. == Branches == In the 1980s, Gou Bu Li baozi began franchise chain operations. In 1980, Beijing Hua Tian Diet Group Company introduced the Gou Bu Li to Beijing. In 2004, the Gou Bu Li open a branch in Taiwan. There are now many branches in China. == Media == TV show: Legend of Gou Bu Li baozi == References == Category:Asian restaurants Category:Chinese food",
 "title": "Gou Bu Li baozi"
}