{
 "id": "586505",
 "text": "Dub mac Maíl Choluim (Modern Gaelic: Dub mac Mhaoil Chaluim; 20 May 928 — 10 July 967) nicknamed the Vehement (Scottish Gaelic: a' Chaisteil) or the Black (Scottish Gaelic: an Dubh) was the King of Scotland from 962 to 967. He was the son of Malcolm I of Scotland and Bethoc. He succeded his first cousin twice removed Indulf, the Scottish king who succeeded his father. == Reign == On 1 July 962, King Indulf was killed at the Battle of Bauds while trying to kick off Viking invaders from Scotland. As the son and heir of Indulf's predecessor, Malcolm I, Dub ascended to the throne instead of Indulf's son and heir, Culen. When Dub first realized that he is now king, he was overjoyed as he had been waiting eight years for this. Since Indulf had many success at the Battle of Bauds, Dub's first act as king was to continue the battle. He actively fought in the battle and won against the Vikings. Next Dub wanted to expand stabilize, and make the kingdom more powerful. In 963, he built many towns for the poor people and would bring peace, stability, and prosperity to the Scottish people. All of this made him very popular and effective. Dub then planned to reform the country and improve relations with England in 967. However, Dub was assassinated by a Scottish nobleman in Forres, Moray in July of the same year. It is exactly unclear who murdered Dub and why but it was said that the person who murdered Dub was a supporter of Culen, the son of the deceased Indulf. Culen then succeded to the throne. Dub's body was not found until six days later on 10 July 967 where someone found his dead body under the bridge of Kinloss, around 4km from Forres, where Dub was killed. His body was taken on a bier to Iona where he was buried in Iona Abbey. Dub left behind one son, Cináeda, who would become the King of Scotland in 997 as Kenenth III after he killed King Constantine III, who was the son of Culen, Dub's successor. == Death == He died in 967, leaving behind 2 children. His burial place has been lost and no one knows the exact place of his burial although it was most likely in 967 just after his death and in Iona, Scotland. ==References== Category:Kings and Queens of Scotland Category:910s births Category:967 deaths Category:10th century in Scotland",
 "title": "Dub of Scotland"
}