{
 "id": "586657",
 "text": "Richard Edgar Pipes (July 11, 1923 - May 17, 2018) was a Polish-American academic. His works were about Russian history, especially relating to the Soviet Union. He held strong anti-communist points of view throughout his career. In 1976 he headed Team B, a team of analysts organized by the Central Intelligence Agency who analyzed the strategic capacities and goals of the Soviet military and political leadership. Pipes is the father of American historian and expert on American foreign policy and the Middle East, Daniel Pipes. ==Early life== Pipes was born to a Jewish family in Cieszyn, Poland, which fled the country as refugees after it was invaded by Nazi Germany. Settling in the United States in 1940, he became a naturalized citizen in 1943 while serving in the United States Army Air Corps. From 1958 to 1996, Pipes worked at Harvard University. ==Recent activities== He was a member of the advisory council of the Victims of Communism Memorial Foundation. Pipes died in Belmont, Massachusetts on May 17, 2018 at the age of 94. ==More reading== *Bogle, Lori Lyn, \"Pipes, Richard\", pp. 922–923, in The Encyclopedia of Historians and Historical Writing edited by Kelly Boyd, Vol. 2, London: Fitzroy Dearborn Publishing, 1999. online *Malia, Martin Edward, \"The Hunt for the True October\", pp. 21–28, from Commentary, Vol. 92, 1991. *Pipes, Richard, \"Vixi: The Memoirs of a Non-Belonger\", 2003. *Poe, Marshall, \"The Dissident\", Azure (Spring 2008). *Somin, Ilya, \"Riddles, Mysteries, and Enigmas: Unanswered Questions of Communism's Collapse\", pp. 84–88, from Policy Review, Vol. 70, 1994. *Stent, Angela, \"Review of U.S-Soviet Relations in the Era of Détente\", pp. 91–92, from Russian Review, Vol. 41, 1982. *Szeftel, Marc, \"Two Negative Appraisals of Russian Pre-Revolutionary Development\", pp. 74–87, from Canadian-American Slavic Studies, 1980. ==References== ==Other websites== * **Booknotes interview with Pipes on Vixi: Memoirs of a Non-Belonger, December 7, 2003. Category:1923 births Category:2018 deaths Category:Naturalized citizens of the United States Category:American historians Category:Polish writers Category:Anti-communists",
 "title": "Richard Pipes"
}