{
 "id": "586649",
 "text": "Nithya Menen (born 8 April 1988) is an Indian actress and playback singer. She mainly acts in Kannada, Malayalam, Telugu, and Tamil films. Menen is known for her strong acting skills and has won many awards. ==Early life and education== Nithya Menen was born in Bangalore, Karnataka, India. She comes from a Malayali family and finished her early education in Bangalore. She graduated with a degree in English Literature from Manipal University. ==Acting career== Nithya started her acting career as a child in a small role in an English movie called The Monkey Who Knew Too Much. Later, she acted in the Kannada film 7 O'Clock. Her major breakthrough came with the Telugu movie Ala Modalaindi in 2011, which made her very popular. She has since acted in many hit movies in various South Indian languages. Some of her popular movies are: ===Movies=== List of Nithya Menen film credits Year Title Role Language Notes 1998 Hanuman Munna English Child artist 2006 7 O' Clock Anu Kannada 2008 Aakasha Gopuram Hilda Varghese Malayalam 2009 Josh Meera Kannada Vellathooval Jiya George Malayalam Kerala Cafe Nithya Angel John Sofia 2010 Apoorvaragam Nancy Anwar Asna 2011 Ala Modalaindi Nithya Telugu Urumi Chirakkal Bala/ Daisy da Cunha Malayalam Nootrenbadhu/ 180 D. Vidya Lakshmi Tamil Bilingual film Telugu Violin Angel Malayalam Veppam Revathy Tamil Aidondla Aidu Gowri Kannada Segment: \"Payasa\" Makaramanju Model Malayalam 2012 Ishq Priya Telugu Thalsamayam Oru Penkutty Manjula Ayyapan Malayalam Karmayogi Moonumani Doctor Innocentanu Anna Special appearance Bachelor Party Neethu Ustad Hotel Shahana Poppins Ammu Anthology film 2013 Okkadine Shailaja Telugu Jabardasth Saraswati Myna Myna Kannada Gunde Jaari Gallanthayyinde Shravani / Bangaram Telugu 2014 Malini 22 Palayamkottai Malini Tamil Bangalore Days Natasha Francis Malayalam Cameo appearance 2015 Malli Malli Idi Rani Roju Nazeera Khanum Telugu JK Enum Nanbanin Vaazhkai Nithya Tamil 100 Days of Love Sheela Malayalam S/O Satyamurthy Valli Telugu Kanchana 2 Ganga Tamil O Kadhal Kanmani Tara Kalingarayar Rudhramadevi Muktamba Telugu 2016 24 Priya Sethuraman Tamil Okka Ammayi Thappa Mango / Satyabhama Telugu Kotigobba 2 / Mudinja Ivana Pudi Subhashini / Shubha Kannada Bilingual film Tamil Janatha Garage Anu Telugu Iru Mugan Ayushi Tamil 2017 Mersal Aishwarya Vetrimaaran 2018 Awe Krishnaveni Telugu Geetha Govindam Nithya Special appearance 2019 NTR: Kathanayakudu Savitri Special appearance Praana Tara Anuradha Malayalam Mission Mangal Varsha Pillai Hindi 2020 Psycho Kamala Das IPS Tamil 2021 Ninnila Ninnila Maya Telugu Gamanam Shailaputri Devi Cameo appearance Skylab Gouri Venkataraju Also producer 2022 Bheemla Nayak Suguna Nayak 19(1)(a) Unnamed Cafe Runner Malayalam Thiruchitrambalam Shobana Tamil Wonder Women Nora Joseph English 2023 Kolaambi Arundhathi Malayalam 2024 Tamil Post- production TBA Filming Filming Filming ==Awards== Nithya Menen has won several awards for her acting. These include: * Four Filmfare Awards: for Gunde Jaari Gallanthayyinde (Telugu), Malli Malli Idi Rani Roju (Telugu), Mersal (Tamil), and Thiruchitrambalam (Tamil). * Two Nandi Awards: for Ala Modalaindi and Malli Malli Idi Rani Roju. * National Film Award: for her performance in Thiruchitrambalam. == Singing career == In addition to acting, Nithya Menen is also a playback singer. She has sung songs in many of her movies, including \"Edo Anukunte\" in Ala Modalaindi and \"O Priya Priya\" in Ishq. ==Personal life== Nithya Menen is not married. She keeps her personal life private and focuses on her work in movies. == References == Category:Living people Category:1988 births Category:Indian movie actors Category:Indian singers Category:Actors from Bangalore Category:Indian child actors",
 "title": "Nithya Menen"
}