{
 "id": "586884",
 "text": "The Ñuble Province () was one of the provinces of the Chilean region of Bío Bío (VIII). The provincial capital was the city of Chillán. It was the second province in area in the Bío Bío region, after the Bío Bío province, and the second with more people living in it, after the Concepción province. The province was created in 1974, as the historical province of Ñuble was supressed by the military dictatorship of Augusto Pinochet. In 2018 the province was converted in the Ñuble Region. ==Geography== The Ñuble province is in the northern part of the Bío Bío region with an area of . The capital, Chillán, is at about from Santiago, the national capital. Ñuble is bordered to the north by the Maule region (Cauquenes and Linares provinces), to the east by Argentina, to the south by the Bío Bío province and to the west by the Concepción province and the Pacific Ocean. ==Administration== As a province, Ñuble was a second-level administrative division, consisting of 21 communes (comunas). The city of Chillán served as the provincial capital. The province was administered by a governor. Ñuble province Code Comuna Capital Area (km²) Population (2002) Density 08401 35 Chillán Chillán 511.2 161,953 08402 34 Bulnes Bulnes 425.4 20,595 08403 37 Cobquecura Cobquecura 570.3 5,687 08404 38 Coelemu Coelemu 342.3 16,082 08405 39 Coihueco Coihueco 1,776.6 23,583 08406 36 Chillán Viejo Chillán Viejo 291.8 22,084 08407 40 El Carmen El Carmen 664.3 12,845 08408 41 Ninhue Ninhue 401.2 5,738 08409 42 Ñiquén Ñiquén 493.1 11,421 08410 43 Pemuco Pemuco 562.7 8,821 08411 44 Pinto Pinto 1,164.0 9,875 08412 45 Portezuelo Portezuelo 282.3 5,470 08413 46 Quillón Quillón 423.0 15,146 08414 47 Quirihue Quirihue 589.0 11,429 08415 48 Ránquil Ránquil 248.3 5,683 08416 49 San Carlos San Carlos 874.0 50,088 08417 50 San Fabián San Fabián 1,568.3 3,646 08418 51 San Ignacio San Ignacio 363.6 16,106 08419 52 San Nicolás San Nicolás 490.5 9,741 08420 53 Treguaco Treguaco 313.1 5,296 08421 54 Yungay Yungay 823.5 16,814 Total of the Ñuble province Total of the Ñuble province Total of the Ñuble province 13,178.5 438,103 ==Related pages== * Provinces of Chile ==References== ==Other websites== * Territorial division of Chile * Gobierno Regional del Bío Bío Official website * Province of Ñuble website Category:Provinces of Chile Category:Bío Bío Region",
 "title": "Ñuble Province (1974–2018)"
}