{
 "id": "586947",
 "text": "Nnedi Okorafor (full name: Nnedimma Nkemdili Okorafor; also known as Nnedi Okorafor-Mbachu; born April 8, 1974)\"Nnedi Okorafor\", Macmillan Publishers. is a Nigerian-American writer. She writes fantasy and science fiction. == Background and personal life == Okrafor was born in the United States. Her parents are members of the Igbo group from Nigeria. She has visited Nigeria many times since she was very young. While she studied Homewood-Flossmoor High School in Flossmoor, Ill., Okorafor was a good tennis player and did very well studying science. Later, she found out she had scoliosis. This condition and surgery to fix it ended Okorafor's student athletic career. It made it difficult for her to walk. She started writing as a hobby while she recovered from surgery. Her novels and stories show both her West African life and her American life. In 2001 Okorafor graduated of the Clarion Writers Workshop in Lansing, Michigan. She earned a PhD in English from the University of Illinois, Chicago. She is an associate professor of creative writing and literature at the University at Buffalo (SUNY). She lives in both Buffalo and Olympia Fields, IllinoisAkata Witch by Nnedi Okorafor, Hardcover | Barnes & Noble® Retrieved 2017-02-19. with her family. == Writing and awards == Okorafor received a 2001 Hurston-Wright literary award for her story \"Amphibious Green.\" She then published two books for young adults, The Shadow Speaker (Hyperion/Disney Book Group) and Zahrah the Windseeker (Houghton Mifflin Harcourt). Zahrah won the Wole Soyinka Prize for Literature in Africa. The Shadow Speaker was a winner of the Carl Brandon Parallax Award, a Booksense Pick for Winter 2007/2008, a Tiptree Honor Book, Okorafor's children's book Long Juju Man was the 2007–08 winner of the Macmillan Writer's Prize for Africa. Okorafor's first novel for adults, Who Fears Death (DAW/Penguin Books), won the 2011 World Fantasy Award for Best Novel, was a 2011 Tiptree Honor Book and was nominated for the 2010 Nebula Award. Okorafor's short stories have been published in books and magazines, including Dark Matter: Reading The Bones, Strange Horizons, Moondance magazine, and Writers of the Future Volume XVIII. A collection of her stories, called Kabu Kabu, was published by Prime Books in 2013. It includes the story Kabu Kabu that she wrote with Alan Dean Foster. Whoopi Goldberg wrote the foreword to the book. ==Writing== Young Adult—writing as Nnedi Okorafor-Mbachu * Zahrah the Windseeker (2005, Houghton Mifflin Harcourt; paperback 2008, Graphia/Houghton Mifflin Harcourt) * The Shadow Speaker (2007, Hyperion/Disney) Children— writing as Nnedi Okorafor * Long Juju Man (2009, Macmillan Africa) * Iridessa and the Secret of the Never Mine (2012, Disney Books) === Young Adult === * Akata Witch (2011, Viking/Penguin) (Published as What Sunny Saw in the Flames in Nigeria and the UK by Cassava Republic Press) * Akata Warrior (2017) * Ikenga (2020) * Akata Woman (2022) ===Adult=== writing as Nnedi Okorafor * Who Fears Death (2010, DAW/Penguin) * \"Hello, Moto\" (2011, A Tor.Com Original short story) * \"Moom!\" short story in \"AfroSF: Science Fiction by African Writers\" (2012, Storytime) * Lagoon * Binti (2015, novella) * Binti: Home (2017, novella) * Binti: Night Masquerade (2018, novella) * Remote Control (2021, novella) * Noor (2021) * She Who Knows: Firespitter (2024) ==References== ==Other websites== *Nnedi Okorafor Home Page *Mikki Kendall, Profile: \"A Nigerian Sorceress Makes Her Way\", Publishers Weekly, April 12, 2010 *Donna Freitas, \"Weapons of Mass Creation\", New York Times review of The Shadow Speaker, July 13, 2008 *Nebula Awards Guest Blog: Is Africa Ready for Science Fiction by Nnedi Okorafor *Review of Zahrah the Windseeker by Gary K. Wolfe *\"Stephen King's Super-Duper Magical Negroes\" by Okorafor-Mbachu *\"From the Lost Diary of TreeFrog7\" (short story), Clarkesworld Magazine, May 2009 *Stories by Okorafor at AfricanWriter.com *\"If It Scares You, Write It: A Conversation with Nnedi Okorafor\" (interview), Clarkesworld Magazine, December 2009 * *2010 Audio Interview on the Geek's Guide to the Galaxy Podcast Category:1974 births Category:Living people Category:American science fiction writers Category:African-American writers Category:People from Olympia Fields, Illinois Category:Writers from Illinois",
 "title": "Nnedi Okorafor"
}