{
 "id": "587027",
 "text": "In English, an Auxiliary verb is a verb that changes or helps another verb. Auxiliary means \"extra\" or \"different\". Auxiliary verbs like do can be used to make a question. These verbs are usually used with other verbs. ==Basic examples== Below are some sentences that use auxiliary verbs from English, Spanish, German, and French, with the auxiliary verb in bold: ::a. Do you want tea? – do is an auxiliary verb that changes the main verb want to make a question – see do-support. ::b. He has given his all. – has is an auxiliary used to say the perfect form of give. ::c. He cogido tu lápiz. – he is an auxiliary accompanying the main verb coger, used here to make a compound verb, the perfect present of the verb coger. To learn about the Spanish auxiliary verb coger, see https://chimichurris1ba.files.wordpress.com/2013/09/manual- sintaxis-1c2ba-bachillerato.pdf. :::(I) have grabbed your pencil = 'I have taken your pencil.' ::d. Das wurde mehrmals gesagt. – wurde 'became' is an auxiliary used to make the passive voice in German.To learn about the German auxiliary verb werden, see Engel (1994:114). :::That became many times said = 'That was said many times.' ::e. Sie ist nach Hause gegangen. – ist 'is' is an auxiliary used with movement verbs to make the perfect tense in German.To learn about the German auxiliary verb sein, used to form perfect tense, see Eroms (2000:138f.) :::She is to home gone = 'She went home/She has gone home.' ::f. J'ai vu le soleil. – ai 'have' is an auxiliary verb used to make the perfect tense/aspect in French.To pick between the French auxiliary verbs avoir and être, which are used to make the perfect tense/aspect, see Rowlett (2007:40f.). :::I have seen the sun = 'I have seen the sun/I saw the sun.' ::f. Nous sommes hébergés par un ami. – sommes 'are' is an auxiliary verb used to make the passive voice in French.To learn about the French auxiliary verb être, which is used to make the passive voice in French, see Rowlett (2007:44f.). :::We are hosted by a friend. These auxiliaries help make a question, show tense, or make passive voice. Auxiliaries like these usually appear with a normal verb that carries the main meaning of that part of the sentence. ==References== Category:Grammar",
 "title": "Auxiliary verb"
}