{
 "id": "58705",
 "text": "Joseph Manchin III (/ˈmæntʃɪn/ MAN-chin; born August 24, 1947) is an American politician and businessman. He represented West Virginia in the United States Senate from 2010 to 2025. Manchin was also the governor of West Virginia from 2005 to 2010. He was a member of the Democratic Party for most of his life. In 2024, he became a independent politician. Before becoming a politician, he worked in the coal industry. He founded Enersystems, a family-owned coal company. Manchin calls himself a \"centrist, moderate, conservative Democrat\". He doesn't want American troops in Afghanistan and Syria. He has voted against his party many times. He voted to support many of Donald Trump's policies, even though Trump was a Republican. However, he has supported many Democratic policies too. He supported the Affordable Care Act, or \"Obamacare\". He also voted to convict Donald trump in his impeachment trials. He also voted for Joe Biden's Supreme Court nominee, Ketanji Brown Jackson, and the Inflation Reduction Act. After the 2020 elections, Manchin had a lot of power in Congress. Because the Senate was split almost evenly between Democrats and Republicans, every single vote mattered a lot. Without Manchin's vote, any Democratic policy became hard to pass. ==Early life and education== Joseph Manchin III was born on August 24, 1947, in Farmington, West Virginia. Farmington is a small coal mining town in northern West Virginia. He is the second of five children. His mother was Mary O. (née Gouzd), who was the daughter of immigrants from Czechoslovakia. His father, John Manchin, was the son of Italian immigrants. When Manchin was young, he worked in his family's stores. His family lived in West Virginia for generations. Manchin's father and grandfather were both mayor of Huntington. His uncle James Manchin was the Secretary of State and Treasurer of West Virginia. Manchin graduated from Farmington High School in 1965. He went to West Virginia University and played on its football team, but an injury made him stop playing. He graduated in 1970 with a degree in business. ==Early political career== In 1982, Manchin was elected to the West Virginia House of Delegates when he was 35. In 1986, he was elected to the West Virginia Senate. Both the Senate and the House of Delegates make and vote on state laws. In 1996, he tried to run for Governor of West Virginia. He lost the Democratic primary election to Charlotte Pritt. It is the only election Manchin has ever lost. Even though he was a Democrat, he supported the Republican candidate for governor. Manchin ran for Secretary of State of West Virginia in 2000 and won. He got 89% of the vote. Category:1947 births Category:Living people Category:United States senators from West Virginia Category:Governors of West Virginia Category:State legislators of the United States Category:Democratic Party (United States) politicians Category:20th-century American politicians Category:21st-century American politicians Category:Independent politicians in the United States",
 "title": "Joe Manchin"
}