{
 "id": "587127",
 "text": "Christopher Asher Wray (born December 17, 1966) is an American lawyer. He was the 8th Director of the Federal Bureau of Investigation from August 2, 2017 until January 19, 2025. From 2003 to 2005, he served as Assistant Attorney General in charge of the Criminal Division under the George W. Bush administration. He was previously a litigation partner with the law firm King & Spalding. In December 2024, Wray announced his resignation as FBI director. He left office on January 19, 2025. ==Early life== Wray was born in New York City. He was raised in Andover, Massachusetts. He studied at Yale University. ==Early career== In 2003, President George W. Bush nominated Wray as Assistant Attorney General in charge of the Criminal Division of the Justice Department. Wray was unanimously confirmed by the Senate. Wray was Assistant Attorney General from 2003 to 2005, working under Deputy Attorney General James Comey. While heading the Criminal Division, Wray oversaw prominent fraud investigations, including Enron. ==Director of the FBI (2017-2025)== On June 7, 2017, President Donald Trump announced his intention to nominate Wray to be Director of the Federal Bureau of Investigation. On July 20, 2017, the Senate Judiciary Committee voted unanimously to confirm Wray to be the next director of the FBI. Wray was officially confirmed by the Senate with bipartisan support on August 1, 2017; the vote was 92–5. He was sworn in by Attorney General Jeff Sessions in a private ceremony on August 2. In the aftermath of the Douglas High School shooting in Parkland on February 14, 2018, it was found out that the FBI ignored a tip that shooter Nikolas Cruz had a desire to \"kill people\". Florida Governor Rick Scott called for Wray to resign, with the earliest tip received by the FBI dating back to September 2017 in which a YouTube user with the same name commented, \"I'm going to be a professional school shooter.\" In December 2020, it was announced that President-elect Joe Biden would keep Wray as FBI director under his administration. In November 2024, NBC News reported that after Donald Trump was elected to another term, Wray was getting ready for the event Trump fires him. On November 30, 2024, Trump named Kash Patel as his nominee to replace Wray as FBI director. On December 11, 2024, Wray announced that he would resign as Director of the FBI in January 2025, at the end of the Biden administration. ==Personal life== Wray married Helen Garrison Howell in 1989. They have two children. He is registered as a Republican. ==References== ==Other websites== * Department of Justice biography page * Category:1966 births Category:Living people Category:Lawyers from Massachusetts Category:Directors of the Federal Bureau of Investigation Category:Politicians from New York City Category:Politicians from Georgia (U.S. state) Category:Politicians from Massachusetts Category:Republican Party (United States) politicians Category:Lawyers from Georgia (U.S. state) Category:Lawyers from New York City",
 "title": "Christopher A. Wray"
}