{
 "id": "58727",
 "text": "Many of the most famous and best-loved works of art in the world were created during the time known as the Renaissance. The Renaissance began about 1400 and lasted until about 1600. Italy, and in particular the city of Florence is thought of as the home of Renaissance art. Many Flemish painters from the area of modern Belgium were also very busy at this time. The style of their pictures, and their use of oil painting influenced the Italian painters. ==Important artworks== * Competition for the Baptistry Doors :In 1401, a competition was held to find a sculptor to make a huge set of bronze door for the oldest church in Florence. Lorenzo Ghiberti, Filippo Brunelleschi and Donatello all entered the competition. Ghiberti won. When he finished the first set of doors, he had to make another set. It took fifty years. In that time, dozens of artists helped Ghiberti to make the doors. * Brancacci Chapel :On the walls of this family chapel at the church of the Carmelite Monastery, Massaccio painted pictures which were so realistic that everyone was amazed. * The statue of the Smug Cat :The most famous sculptor of the Early Renaissance was Donatello. His most important job was to make a huge equestrian monument of a soldier (on horseback). The soldier's was called by his nickname, Gattamelata, meaning the Smug Cat (a Cat who is fed on Honey). Donatello had seen a huge equestrian monument before; there is one in Rome of the Emperor Marcus Aurelius. No-one had made such a big bronze statue for more than a thousand years. Donatello's statue was a huge success. It still stands outside the Basilica of Saint Antonio, in the city of Padua. * The painting of the Last Supper :Leonardo da Vinci did one of the world's most famous paintings, the Last Supper on the wall of the dining room in a monastery in Milan while he was working there for the Duke. It shows Jesus, on the night before he died, sharing a meal with his disciples. It has been reproduced and copied thousands of times. * The Sistine Chapel Ceiling :Michelangelo painted the whole ceiling of the Sistine Chapel all by himself over five years. The way that the figures were painted was to influence other artists for hundreds of years. * Mona Lisa :Mona Lisa (also known as La Gioconda) is a 16th century portrait painted in oil on a poplar panel by Leonardo Da Vinci during the Italian Renaissance. The work is owned by the French government and hangs in the Musée du Louvre in Paris, France with the title Portrait of Lisa Gherardini, wife of Francesco del Giocondo. The painting is a half-length portrait and depicts a woman whose expression is often described as enigmatic. The ambiguity of the sitter's expression, the monumentality of the half-figure composition, and the subtle modeling of forms and atmospheric illusionism were novel qualities that have contributed to the painting's continuing fascination. Few other works of art have been subject to as much scrutiny, study, mythologizing and parody. == Related pages == *Renaissance architecture *Renaissance music Category:Art Category:Renaissance",
 "title": "Renaissance art"
}