{
 "id": "588489",
 "text": "Zaporizhzhia ( before 1921 it was called Oleksandrivsk) is a city in southeastern Ukraine. It is the administrative center of the Zaporizhzhia Oblast. In 2024, 500,000 people lived there. It is on the Dnieper River, where the transport and communication corridors connecting the south with the capital of Ukraine, western and central regions meet. Together with the surrounding settlements it forms the Zaporizhzhia agglomeration. It is one of the largest administrative, industrial and cultural centers of southern Ukraine. It has advanced engineering, ferrous and nonferrous metallurgy, chemical and construction industries. It has a river port and an important transit railway junction. In the zone of influence of Zaporizhzhia as a regional center on the territory of 2690 thousand hectares there are 14 cities, 23 urban-type settlements and a significant number of villages. More than 2 million people live. The suburban zone covers Zaporizhzhia, Vilniansk, Orikhiv, Vasylivka and Kamyansko-Dniprovsky. They are administrative districts of Zaporizhzhia region, the total area of which is 760 thousand hectares. There are 5 cities, 6 urban-type settlements and about 300 rural settlements. The total population of the suburban area is approximately 315 thousand people. The city of Zaporizhzhia concentrates about 65% of the productive capacity of the region and 43% of the population of the region. On June 27, 2014, the decision of the Zaporizhzhia City Council adopted the final report of the working group to clarify the founding date of the city and changed the official founding date. The working group concluded that the city was founded in 952. The treatise of the Byzantine Emperor Constantine VII Porphyrogenitus \"On the management of the empire\" was the first written mention of the settlement on both banks of the Dnieper and the island of Khortytsia. == Name == Until March 15, 1921, the city was called Alexandrovsk after the Alexander Fortress, founded in 1770. On March 15, 1921, the city was renamed Zaporizhzhia - that is, \"located beyond the thresholds.\" The name reminds that before the construction of the Dnieper HPP dam in 1932 at the place where the river crosses the rocky southern edge of the Ukrainian Shield, numerous Dnieper rapids, which hinder navigation, ended. == References == Category:Cities in Zaporizhzhia Oblast",
 "title": "Zaporizhzhia"
}