{
 "id": "588615",
 "text": "Money in the Bank (2017) was a professional wrestling pay-per-view and WWE Network livestreaming show made by WWE for their SmackDown brand. It took place on June 18, 2017 at the Scottrade Center in St. Louis, Missouri. It was the eighth Money in the Bank event held by WWE and the first to feature a Money in the Bank ladder match for women. Seven matches were performed at Money in the Bank and one of them was on the pre-show. Baron Corbin won the last match which was the men's Money in the Bank ladder match. Also, Jinder Mahal beat Randy Orton to keep the WWE Championship and Carmella cheated to win the first Money in the Bank ladder match for women. The event was also interesting because it was Mike Kanellis' first appearance ever in WWE and Maria Kanellis' first appearance in WWE since 2010. == Background == === Men's Money in the Bank ladder match === Every Money in the Bank has had a Money in the Bank ladder match which has several wrestlers. The winner is the wrestler that clims a ladder and grabs the briefcase held above the ring. The winner gets a match for a world championship whenever they want for the next 12 months. Since this event only had wrestlers from SmackDown, the winner would not get a match for Raw's world championship, which at that time was the WWE Universal Championship. Instead, the winner would get a match for SmackDown's then-world championship, the WWE Championship. On the May 23 episode of SmackDown, Shane McMahon announced who he chose to be in the Money in the Bank ladder match. He chose AJ Styles, Shinsuke Nakamura, Dolph Ziggler, Sami Zayn and Baron Corbin. But Kevin Owens was upset by this because he beat Styles at Backlash. Owens said that he should be in the match, too. Shane then decided to add Kevin to the match. === Jinder Mahal vs. Randy Orton === At Backlash, Jinder Mahal beat Randy Orton with help from the Singh Brothers and won his first WWE Championship. On the next episode of SmackDown, Mahal had a celebration, but usually when a champion loses their title, they get a rematch at the following PPV/Network event. Shane McMahon came down to the ring and it turned out, Orton had asked for a rematch which Shane gave him. === Women's Money in the Bank ladder match === On the May 23 episode of SmackDown, Charlotte Flair, Natalya, Tamina and Becky Lynch, one by one, asked Shane McMahon, for a match against Naomi for her WWE SmackDown Women's Championship. Shane decided to have a fatal 5-way match between the three of them where the winner would face Naomi at Money in the Bank. But before the match, the five starting brawling. So Shane came down to the ring and said he decided to have the first ever women's Money in the Bank ladder match where the winner would get a match for the SmackDown Women's Championship whenever they want. == Matches == ==References== ==Other websites== Category:WWE Money in the Bank Category:Sports in St. Louis, Missouri Category:2017 in sports Category:2010s in St. Louis, Missouri",
 "title": "Money in the Bank (2017)"
}