{
 "id": "588698",
 "text": "Alexis Cabrera (née Kaufman, born August 9, 1991), better known by her ring name Alexa Bliss, is an American professional wrestler. She is currently signed to WWE. Cabrera signed a contract with WWE in May 2013. She trained at the WWE Performance Center. She first performed as Alexa Bliss for WWE NXT. In July 2016 Bliss was moved to WWE SmackDown where she won the SmackDown Women's Championship two times, and is the first person to win it twice. She moved to Raw in April 2017. She won the Raw Women's Championship later that month. She would go on to win it three times. Bliss was the first person to win both the SmackDown and Raw Women's championships. Cabrera said that watching Trish Stratus and Rey Mysterio got her into wrestling. She is a big fan of Disney, when she was younger her family went to Walt Disney World each year. She also supports her hometown ice hockey team the Columbus Blue Jackets. Cabrera was engaged to another wrestler Matthew Adams, who is better known by his ring name Buddy Murphy. In 2022 she married singer Ryan Cabrera. On November 27, 2023, they welcomed their daughter, Hendrix Rouge Cabrera. == Films and television == Television Television Television Television Year Title Role Notes 2015–2019 Total Divas Herself Guest (seasons 4, 6, 8, & 9) Main cast (season 7): 15 episodes 2017–2018 Walk the Prank Season 2, episodes 25–26 2018 Carpool Karaoke: The Series Season 2, episode 5 Celebrity Page Season 3, episode 147 Steve Season 1, episode 84 2020 A Little Late with Lilly Singh Season 1, episode 79 Fight Like A Girl Season 1, episode 4 2021 Punky Brewster Alexa Bliss Season 1, episode 6 2021–2022 Miz & Mrs. Herself 2 episodes 2021–2023 Entertainment Tonight 3 episodes 2023 The Masked Singer Axolotl Season 9, episode 6: \"Country Night\" Weakest Link Herself Season 3, episode 10 That's My Jam Season 2, episode 8 Jeopardy! Season 39, episode 140 Celebrity Game Face Season 4, episode 8 Celebrity Family Feud Season 10, episode 4 Music Videos Music Videos Music Videos Music Videos Year Title Artist Notes 2020 \"Alexa Bliss\" Bowling for Soup == Championships and accomplishments == * Pro Wrestling Illustrated ** Ranked No. 2 of the top 100 female wrestlers in the PWI Women's 100 in 2018 ** Ranked No. 22 of the top 50 tag teams in the PWI Tag Team 50 in 2020 * Sports Illustrated ** Ranked No. 6 in the top 10 women's wrestlers in 2018 * Wrestling Observer Newsletter ** Worst Feud of the Year (2021) ** Worst Gimmick (2021) * WWE ** WWE Raw Women's Championship (3 times) ** WWE SmackDown Women's Championship (2 times) ** WWE Women's Tag Team Championship (3 times) – with Nikki Cross (2) and Asuka (1) ** WWE 24/7 Championship (1 time) ** Women's Money in the Bank (2018) ** WWE Women's Triple Crown Champion ==References== ==Other websites== * * * Category:1991 births Category:Living people Category:American professional wrestlers Category:Female professional wrestlers Category:Professional wrestling authority figures Category:Professional wrestling managers and valets Category:Sportspeople from Columbus, Ohio Category:WWE wrestlers",
 "title": "Alexa Bliss"
}