{
 "id": "58894",
 "text": "Paracetamol (or acetaminophen) is a common drug for relieving pain. It can also be used to reduce fever, or headache, caused by a cold or a flu. ==Overview== The IUPAC name for paracetamol is acetaminophen. Both acetaminophen and paracetamol both come from the names of the chemicals used in the compound: N-acetyl-para-aminophenol and para-acetyl-amino-phenol. Sometimes, it is shortened as APAP, for N-acetyl-para-aminophenol. ==History== Harmon Northrop Morse was the first to make paracetamol, in the year 1878. Drugs made with paracetamol became common in the 1950s. Today, these drugs are some of the most used, together with those containing salicylic acid, Ibuprofen or Diclofenac. Unlike these, paracetamol has no anti-inflammatory properties. In the year 1977, paracetamol was added to the List of Essential Medicines of the WHO. ==Safety== Paracetamol is considered safe for use. The drug is easily available without a prescription. Patients sometimes take too much paracetamol, when they do not know how much should be taken. The recommended dose may not work for some people. Other times, it is because they are trying to commit suicide. Very often, a person's liver can be hurt when they take too much paracetamol. A dose of 150 milligrams (mg) for every kilogram (kg) of the person's weight (about 10 grams for most adults) will lead to permanent liver damage, and may cause the liver to fail. For people whose livers have already been damaged, such as alcoholics, and for those with a limited secretion of paracetamol, this amount can be much smaller. * * * ===United Kingdom=== In England and Wales, about 30,000 people per year go to the hospital after taking too much paracetamol (called paracetamol poisoning), with about 150 dying of the poisoning. Since a law was passed saying that paracetamol packets cannot be too large, fewer people have been committing suicide with paracetamol. In Great Britain and the United States Paracetamol is the main reason for acute liver failure. About half of the cases are because of an \"unintentional overdose\". ===Mass poisoning incident in 1982=== In 1982, there was a case of sabotage.G. Dunea: Death over the counter. In: Br Med J. 1983, 286, pp. 211–212. PMID 6401533; .K. A. Wolnik, F. L. Fricke, E. Bonnin, C. M. Gaston, R. D. Satzger: The Tylenol tampering incident – tracing the source. In: Anal. Chem. 56, 1984, pp. 466A–470A, 474A. PMID 6711821. Packets of paracetamol had been tampered with: Seven people died, because they had taken poisoned samples. As a result, the FDA made stricter regulations. Also, paracetamol-products worth 100 million US dollars were called back. ==References== Category:Analgesics Category:Organonitrogen compounds",
 "title": "Paracetamol"
}