{
 "id": "58909",
 "text": "Oxycodone is a medicine that is used to treat pain. This kind of pain medicine is called an analgesic. Oxycodone is a man-made opioid. This means that in the body, it acts like morphine, a powerful, natural painkiller. The chemical elements in oxycodone are very similar to codeine, another natural painkiller. == Forms of Oxycodone == Oxycodone is a generic drug. It has many different brand names. Some forms of oxycodone get released into the body right away. These are short-acting forms of oxycodone - they start working quickly, but do not last very long. The most common brand names for short-acting oxycodone are OxyIR and Roxicodone. Other forms of oxycodone have a special coating that makes just a little bit of the medicine get released into the body at a time. A small amount of oxycodone is released, non-stop, into the body for up to 12 hours. The goal is to have the same amount of painkiller in the body all the time. These are called long-acting, extended-release, or controlled-release forms of oxycodone. They do not start working quickly, but they last a long time. The most common brand name for controlled-release oxycodone is OxyContin. ===Mixtures of oxycodone=== Oxycodone is often mixed together with other pain medicines. For example: * Oxycodone mixed with acetaminophen is often called Percocet, Endocet, or Roxicet. * Oxycodone mixed with aspirin is called Percodan. * Oxycodone mixed with ibuprofen is called Combunox. Since 2014, a new mixture has been created. It is a mixture of oxycodone and naloxone. Its goal is to stop people from abusing long-acting oxycodone. (See the \"Addiction\" section lower on this page). People sometimes abuse long- acting oxycodone (OxyContin) by chewing, crushing, snorting, or injecting the pills. When oxycodone is mixed with naloxone, if the medicine is swallowed by mouth, like it is supposed to be, the oxycodone works like normal. But if the medicine is chewed, crushed, or dissolved, the naloxone inside is released. The naloxone keeps the oxycodone from working in the brain. This makes it impossible for the person to get the good feelings they wanted to get from abusing the oxycodone. == How can Oxycodone be Given? == Oxycodone can be given in many different ways. These are called routes of administration (which means \"ways of giving a medicine\"). Oxycodone starts working the quickest if it is given by one of these routes: * By a needle put into a vein (intravenously) * Sprayed up the nose (intranasally) * By a needle put into a special space in the spinal cord (epidural) Oxycodone starts working a little more slowly if it is given by one of these routes: * By a needle put into a muscle (intramuscularly) * By a needle put right under the skin (subcutaneously) * Into the rectum (rectally) Oxycodone starts working the slowest, but lasts the longest, if it is given: * By mouth (orally), as a pill to be swallowed * On a patch that sticks to the skin and releases small amounts of medicine at a time (transdermally) ==Addiction and Overdose== Most people who take oxycodone exactly as their doctor prescribes it do not get addicted to oxycodone. But people can get addicted to oxycodone if they misuse it - for example, by taking it without a doctor's prescription, or taking more than the doctor prescribed. Some people like the good feeling they get when they take oxycodone. They may keep taking more and more oxycodone to keep getting that good feeling. This can lead to addiction. Oxycodone abuse, addition, and overdoses have become much more common recently. == Long Term Side Effects of Oxycodone == * Chronic constipation. * Depression. * Anxiety. * Negative effects on the reproductive system for women. * Increased danger to the fetus during pregnancy. * Sleep disturbances. * Increased risk of falls and fractures, especially in women, and in older people. * Physical dependence on oxycodone. * Oxycodone addiction. * Overdose. ===Overdoses and treatment=== People can die from overdosing on oxycodone (taking too much). Too much oxycodone shuts down the part of the brain that tells us to breathe. This can cause respiratory failure - where the body is not getting enough oxygen to survive. Every part of the body needs oxygen to live, and without enough oxygen, parts of the body - like the brain - will start to die. Eventually, a person's breathing can stop. If they do not get help right away, their heart will stop and they will die. There is a medicine called naloxone (Narcan) that can reverse some oxycodone overdoses. Once it is given, the naloxone throws the oxycodone off of the spots on the brain they are attached to. Naloxone attaches there instead. This stops the effects of the oxycodone and helps the brain's breathing center start working more normally again. On November 18, 2015, the FDA approved an \"easy-to-use nasal spray\" version of naloxone. The goal was to make it easier for everyday people to use naloxone without having to have medical training. Before this, naloxone could only be given through a needle into a vein or muscle. == Oxycodone Withdrawal & Detox == Oxycodone withdrawal symptoms can include: * Sweating. * Fever. * Gooseflesh. * Excessively runny nose. * Compulsive yawning. * Sleep disturbances. * Nausea. * Diarrhoea. * Severe aches and pain, in bones and/or teeth. ==References== Category:Opioids Category:Analgesics Category:Organonitrogen compounds",
 "title": "Oxycodone"
}