{
 "id": "589249",
 "text": "\"Hino Nacional Brasileiro\" (, , \"Brazilian National Anthem\"), is the national anthem used in Brazil, composed by Francisco Manuel da Silva between 1822 and 1831. It was officially adopted as the country's national anthem in 1831. The lyrics to the anthem were written by Osório Duque-Estrada in 1909. They became official in 1922, with some changes.https://www.soportugues.com.br/secoes/curiosidades/hino.php Você entende o Hino Nacional Brasileiro?. Só Português.http://nationalanthems.me/brazil-hino-nacional-brasileiro/ Brazil – Hino Nacional Brasileiro. NationalAnthems.me. ==Lyrics== Portuguese words Portuguese pronunciation English translation 1 [oˈviɾɐ̃w dwipiˈɾɐ̃gɐz ˈmaʁʒẽj̃s ˈpɫasidɐz [ˈdʒjũ ˌpovwiˈɾɔjku ˈbɾadu ʁitũˈbɐ̃tʃi] [iw ˈsɔw dɐ libiʁˈdadʒjẽj̃ ˈʁajus ˈfuwʒidus] [bɾiˈʎo nu ˈsɛw dɐ ˈpatɾjɐ ˌnesĩsˈtɐ̃tʃi] [siw peˈɲoʁ ˈdesɐjgwawdɐdʒi] [kõsiˈgimus kõkisˈtaʁ kõ ˈbɾasu ˈfoʁtʃi] [ẽj̃ ˈtew ˈseju ǀ ˈɔ libiʁˈdadʒi] [dʒizɐˈfi.ɐw ˈnosu ˈpejtwɐ ˈpɾɔpɾjɐ ˈmoʁtʃi] [ˈɔ ˌpatɾjɐˈmadɐ] [iduɫɐˈtɾadɐ] [ˈsawvi ˈsawvi] [bɾɐˈziw ǀ ˈũ ˌsoɲwĩˈtẽsu ǀ ˈũ ˈʁaju ˈvividu] [dʒjɐˈmoʁ i dʒispiˈɾɐ̃sà ˈteʁɐ ˈdesi] [sjẽj̃ ˈtew fuʁˈmozu ˈsɛw ǀ ʁiˈzoɲuj ˈlĩpidu] [ɐjˈmaʒẽj̃ du kɾuˈzejɾu ʁispɫɐ̃ˈdesi] [ʒiˈgɐ̃tʃi ˈpeɫɐ ˈpɾɔpɾjɐ nɐtuˈɾezɐ] [ˈɛs ˈbeɫu ǀ ˈɛʃ ˈfoʁtʃi ǀ ĩˈpavidu kuˈɫosu] [iw ˈtew fuˌtuɾusˈpɐʎɐ ˈesɐ gɾɐ̃ˈdezɐ] [ˌteʁɐduˈɾadɐ] [ˌẽˈtɾjotɾɐz ˈmiw] [ˈɛs ˈtu ǀ bɾɐˈziw] [ˈɔ ˌpatɾjɐˈmadɐ] [dus ˈfiʎuz ˈdestʃi ˈsoɫu] [ˈɛz ˈmɐ̃j ʒẽˈtʃiw] [ˌpatɾjɐˈmadɐ ǀ bɾɐˈziw] 2 [dejˌtadwitʃiʁnɐˈmẽtʃjẽj̃ ˌbeʁsusˈplẽdʒidu] [ɐw sõ du ˈmaɾ jà ˈɫuz du ˈsɛw pɾuˈfũdu] [fuwˈguɾɐs ǀ ˈɔ bɾɐˈziw ǀ fɫuˈɾɐ̃w dɐˈmɛɾikɐ] [iɫumiˈnadu ˈaw ˈsɔw du ˈnovu ˈmũdu] [du kjɐ ˈteʁɐ ˈmajz gaˈʁidɐ] [ˈtewz ʁiˈzoɲus ǀ ˈlĩdus ˈkɐ̃pus ˈtẽj̃ ˈmajs ˈfɫoɾis] [ˈnosuz ˈboskis ˈtẽj̃ ˈmajz ˈvidɐ] [ˈnosɐ ˈvidɐ nu ˈtew ˈseju ˈmajz ɐˈmoɾɨs] [ˈɔ ˌpatɾjɐˈmadɐ] [iduɫɐˈtɾadɐ] [ˈsawvi ˈsawvi] [bɾɐˈziw ǀ dʒjɐˈmoɾ iˈteʁnu ˈsejʒɐ ˈsĩbuɫu] [u ˈɫabɐɾu kjosˈtẽtɐz istɾiˈɫɐdu] [i ˈdʒigɐw ˌveʁdʒiˈɫoɾu ˈdesɐ ˈfɫɐmuɫɐ] [ˈpaz nu fuˈtuɾuj ˈgɫɔɾjɐ nu pɐˈsɐdu] [mɐs si ˈeʁgiz dɐ ʒusˈtʃisɐ ˈkɫavɐ ˈfoʁtʃi] [viˈɾas ˈkjũ ˈfiʎu ˈtew ˈnɐ̃w ˈfoʒjà ˈɫutɐ] [nẽj̃ ˈtemɨ ǀ kẽj̃ tʃjɐˈdoɾɐ ǀ ɐ ˈpɾɔpɾjɐ ˈmoʁtʃi] [ˌteʁɐduˈɾadɐ] [ˌẽˈtɾjotɾɐz ˈmiw] [ˈɛs ˈtu ǀ bɾɐˈziw] [ˈɔ ˌpatɾjɐˈmadɐ] [dus ˈfiʎuz ˈdestʃi ˈsoɫu] [ˈɛz ˈmɐ̃j ʒẽˈtʃiw] [ˌpatɾjɐˈmadɐ ǀ bɾɐˈziw] I They heard from the placid shores of the Ipiranga the resounding shout of a heroic folk And the sun of Liberty in shining beams shone in the homeland's sky at that instant If the pledge of this equality we managed to conquer with strong arm In thy bosom, O Freedom, our chest defies death itself! O beloved, idolized homeland, Hail, hail! Brazil, an intense dream, a vivid ray of love and hope descends to earth If in thy beautiful, smiling and limpid sky the image of the (Southern) Cross blazes. Giant by thine own nature Thou art beautiful, strong, a fearless colossus And thy future mirrors that greatness Adored Land Amongst thousand others art thou, Brazil, O beloved homeland Of the sons of this ground Thou art kind mother Beloved homeland, Brazil II Eternally lying on splendid cradle to the sound of sea and under deep sky light Thou flashes, Brazil, crocket of America, illuminated by the sun of New World Than the more garish land, thy smiling, pretty prairies have more flowers \"Our groves have more life\" \"Our life\" in thy bosom \"more loves\" O beloved, idolized homeland, hail, hail! Brazil, of eternal love be a symbol the starred labarum which thou displayst And say the laurel-green of this pennant \"Peace in the future and glory in the past\" But if thou raises the strong mace of justice, see that a son of thine flees not from battle, nor do those who love thee fear their own death Adored Land Amongst thousand others art thou, Brazil, O beloved homeland Of the sons of this ground thou art kind mother Beloved homeland, Brazil! ==Trivia== *In sporting events, only the first stanza is played. *According to Brazilian law, non-vocal renditions should only be played once, but could be played twice; in vocal renditions, both stanzas must be sung. *The mention of the Ipiranga river is a reference to the stream in São Paulo where Emperor Dom Pedro I declared the country's independence from Portugal. ==References== Category:1820s works Category:South American anthems Category:National symbols of Brazil Category:1900s songs Category:1830s works",
 "title": "Brazilian National Anthem"
}