{
 "id": "589336",
 "text": "Philip Dunton Murphy (born August 16, 1957)Campaign email \"It's Phil Murphy's Birthday Today!\", sent August 16, 2016. is an American financier, diplomat, former Goldman Sachs executive and politician. He is a member of the Democratic Party. He is the 56th and current Governor of New Jersey upon winning the 2017 gubernatorial election and being sworn-in on January 16, 2018. Murphy was the United States Ambassador to Germany from 2009 to 2013 serving during the Barack Obama presidency. He was narrowly re-elected in 2021, beating Republican Jack Ciattarelli. He became the first Democratic governor to win re-election since Brendan Byrne in 1977. ==Early life== Murphy was born in Needham, Massachusetts. He was raised in both Needham and nearby Newton, Massachusetts.Dustin Racioppi, \"Guadagno, Murphy race rooted in the past\", Asbury Park Press, June 8, 2017, p. 9A. He studied at Harvard University and at the University of Pennsylvania. ==Ambassador to Germany (2009-2013)== Murphy served as United States Ambassador to Germany under President Barack Obama from 2009–2013. His formal nomination to the position was made by President Barack Obama on July 9, 2009. It was then confirmed by the United States Senate on August 7, 2009.http://germany.usembassy.gov/about/ambassador/ - As it was on August 21, 2009 during Murphy's time as Ambassador to Germany Murphy promoted American trade and focused on engaging Germany’s youth through town hall meetings, exchange programs, and social media communication. On May 29, 2013, it was announced that Murphy was stepping down from the ambassadorship. He formally left the position on August 26, 2013. ==Governship (since 2018)== ===2017 election=== Murphy was the Democratic nominee for Governor of New Jersey in the 2017 gubernatorial election. He faced Republican Lieutenant Governor Kim Guadagno in the general election. He won the election on November 7, 2017. ===Tenure=== In December 2019, Murphy became the chairperson of the Democratic Governors Association, a position he held for a year. ===2021 election=== On October 1, 2020, Murphy announced he would seek reelection, with Oliver as his running mate. He faced Republican Jack Ciattarelli in the general election. He was re-elected by a small margin and was declared the winner the next day. ==Personal life== Murphy moved to Middletown Township, New Jersey in 2000. He is married to Tammy Snyder and they have four children. On March 4, 2020, Murphy had surgery in New York City to remove cancerous tumors in his kidneys. He made a full recovery shortly afterward. ==References== ==Other websites== *Education Task Force website *New Jersey Benefits Task Force final report *United States Diplomatic Mission to Germany: The Ambassador *June 2013 interview in Frankfurter Rundschau (in German) * * Official campaign website * Primary Night - narrative photo essay Category:1957 births Category:Living people Category:People from Newton, Massachusetts Category:Ambassadors of the United States to Germany Category:American progressives Category:Governors of New Jersey Category:Politicians from Massachusetts Category:Democratic Party (United States) politicians",
 "title": "Phil Murphy"
}