{
 "id": "5894",
 "text": "New York University, also known as NYU, is a research university in New York City. It is the largest private university in the United States, and is highly regarded in the nation as well as around the world. ==Rankings== In 2020, it was ranked as the 11th best university in the United States by the QS World University Rankings: USA, and as the 28th best university in the world by U.S. News & World Report. In addition, NYU is highly ranked in the fields of Law, Medicine, Mathematics, Business, Psychology, Communications, Performing Arts, Film, Economics, and Philosophy. ==History== The university was founded as University of the City of New York in 1831 by a prominent group of New York City residents led by then United States Secretary of the Treasury, Albert Gallatin. The school was officially renamed New York University in 1896. 37 Nobel Prize winners have been produced by NYU, the 12th most in the United States and 19th most in the world. Three heads of state attended NYU: Ma Ying- jeou of the Republic of China, Ephraim Katzir of Israel, and Guillermo Endara of Panama. Many American politicians also attended NYU, including Bill de Blasio, Carol Bellamy, and Rudy Giuliani. Many successful actors and movie directors attended NYU, including Martin Scorcese, Angelina Jolie, Alec Baldwin, Spike Lee, Ang Lee, Mahershala Ali, Woody Allen, and Adam Sandler. Other famous alumni include the creator of the polio vaccine Jonas Salk, singer Lady Gaga, Twitter founder Jack Dorsey, author Suzanne Collins, and former special counsel Robert Mueller. NYU is one of the places where 5G was created, as well as where many of the foundations of modern electromagnetic theory were discovered. ==Campus== In addition to its main campus in New York City, NYU also has degree-granting campuses in Abu Dhabi and Shanghai. NYU Abu Dhabi has produced more Rhodes Scholars per student than any other university in the world. ==References== Category:Association of American Universities Category:New York University",
 "title": "New York University"
}