{
 "id": "58951",
 "text": "2029 (MMXXIX) will be a common year starting on Monday in the Gregorian calendar, the 2029th year of the Common Era (CE) and Anno Domini (AD) designations, . == Predicted and scheduled events == * May 16: 100th anniversary of the Academy Awards. * May 25: 50th anniversary of the Alien. * Friday, April 13 — The asteroid 99942 Apophis (previously also known by its provisional designation 2004 MN4) will pass within 30,000 km (18,600 mi) of the Earth. * Music by Buddy Holly will enter the public domain this year. * Ray Kurzweil and other futurists predict that computer intelligence will exceed biological intelligence. * The FBI will have permission to reveal the Top Secret papers on John F. Kennedy's assassination to the public. * 100th anniversary of the Carvel. == 2029 in fiction == === Computer and video games === * Deus Ex (2000): JC Denton's \"assigned birth date\" is March 17. === Manga === * Ghost in the Shell: Public Security Section 9 is established. === Movies === * The Terminator (1984): Kyle Reese and a Terminator are sent back in time to 1984. * Terminator 2: Judgment Day (1991): Two Terminators, a T-800 and a T-1000, are sent back in time to, respectively, protect and kill John Connor as a teenager. === Music === * Post-Grunge rock band Our Lady Peace's popular song \"In Repair\", among others, from their 2000 album Spiritual Machines, references the year 2029 in the opening, which states \"The year is 2029. The machines will convince us that they are conscious...\". The entire album was attributed and dedicated to futurist Ray Kurzweil. * Gothic Metal band Type O Negative speaks of the year 2029 (specifically April 13, 2029) in their song \"The Profit of Doom\", which is from the narrative of a doom prophet. The album with the song \"The Profit of Doom\", entitled Dead Again, was released on March 13, 2007. === Television === * Six Feet Under (\"Everyone's Waiting,\" 2005): Keith Charles is shot and killed by robbers seizing the contents of his armored truck. === Comics === * 10 January — Comic book character Tintin, from The Adventures of Tintin created by Herge, turns 100 years old. == Other websites ==",
 "title": "2029"
}