{
 "id": "589535",
 "text": "Super Mario Odyssey is a Nintendo Switch 3D platform video game released on October 27, 2017. It is part of the Super Mario series. It received a lot of positive ratings and is one of the highest-rated games of all time. It had sold 20 million copies as of December 31, 2020. == Story == Bowser and the Broodals, a group of rabbits, kidnap Princess Peach and Tiara, and take them to Bowser's airship. Mario comes to rescue Peach, but he fails, being launched towards the Cap Kingdom. However, his hat stayed on the ship, Bowser stepped on it, and it flew to the back of the ship and ripped. But a hat named Cappy grabs a piece, and he flies to Mario to team up with him. Cappy uses the piece to look like Mario's old cap. The two go and collect Power Moons, and in the Cascade Kingdom, they find a ship named Odyssey, making it work with Power Moons. The two climb aboard and chase Bowser, as they travel to various kingdoms. They fight bosses along the way and collect Power Moons to reach more areas. They meet up with Bowser on the Moon in a cathedral, and Mario fights with him. Mario wins, but the battlefield breaks. Mario \"captures\" Bowser using Cappy, allowing Mario to take over Bowser. Peach and Tiara jump on Bowser's shoulder and escape the cavern. Bowser goes to propose to Peach again, and so does Mario. Peach rejects them both and gets on the Odyssey with Tiara and Cappy. Mario rushes to the Odyssey in time, leaving Bowser on the Moon. == Gameplay == Super Mario Odyssey is a game where you control Mario as he travels through different worlds called \"Kingdoms\" in a hat-shaped ship named Odyssey. Mario’s goal is to rescue Princess Peach from Bowser, who wants to marry her against her will. The game has Mario exploring these Kingdoms, similar to how it was in Super Mario 64. In each Kingdom, Mario needs to find and complete tasks to get Power Moons, which power the Odyssey and unlock new Kingdoms. There are checkpoint flags scattered around that let Mario quickly travel back to them. Some levels have \"flat\" zones where the game switches to a 2D side-scrolling style, like in the original Super Mario Bros. ==Awards== List of pre-release awards and nominations Year Awards Category Result Ref. 2017 IGN's Best of E3 Best Platformer Best Nintendo Switch Game Game of Show Game Critics Awards Best Action/Adventure Game Best Console Game Best of Show Destructoids Best of E3 Best of Show == Reception == Super Mario Odyssey got great reviews and is one of the top-rated games of all time, according to Metacritic as of 2023. Andrew Webster from The Verge said the game works well on the Switch, letting players enjoy long or short play sessions. He compared collecting \"Power Moons\" to finding hidden mini-dungeons in Breath of the Wild. However, he found the motion controls frustrating and preferred regular controls. The game’s 2D Mario segments were compared to puzzles in The Legend of Zelda: A Link Between Worlds, and VentureBeat noted that the game is similar to the Sonic the Hedgehog series. ==References== Category:2017 video games Category:Mario platform games Category:3D platformers Category:Cooperative video games Category:Multiplayer and single-player video games Category:Nintendo Entertainment Planning & Development games Category:Nintendo Switch games Category:Nintendo Switch-only games Category:Open-world video games Category:Video games developed in Japan Category:Video games about dinosaurs",
 "title": "Super Mario Odyssey"
}