{
 "id": "589672",
 "text": "Peter Ludwig Berger (March 17, 1929 - June 27, 2017) was an Austrian-born American sociologist. He was known for his work in the sociology of knowledge, the sociology of religion, study of modernization, and theoretical work to sociological theory. Berger was best known for his book, co-authored with Thomas Luckmann, The Social Construction of Reality: A Treatise in the Sociology of Knowledge (New York, 1966), which is thought to be one of the most influential texts in the sociology of knowledge, and played a central role in the development of social constructionism. ==Career== In addition to this book, some of the other books that Berger has written include: Invitation to Sociology: A Humanistic Perspective (1963); A Rumor of Angels: Modern Society and the Rediscovery of the Supernatural (1969); and The Sacred Canopy: Elements of a Social Theory of Religion (1967).Aeschliman, M.D. June 2011. A Contemporary Erasmus: Peter L. Berger. Modern Age, Vol 53, pp. 5–14 http://rpholyc.holycross.edu/ebsco- w-b/ehost/detail?sid=fe313724-eb88-431c-8812-1a4ab95a1b57%40sessionmgr114&vid;=1&hid;=117&bdata;=JnNpdGU9ZWhvc3QtbGl2ZQ%3d%3d#db=aph&AN;=78384571 Berger has spent most of his career teaching at The New School for Social Research, Rutgers University, and Boston University. Before retiring, Berger had been at Boston University since 1981 and was the director of the Institute for the Study of Economic Culture.Allan, Kenneth. Contemporary Social and Sociological Theory: Visualizing Social Worlds. Sage Publications Inc, 2011, pp. 28–45 ==More reading== * Hein, David. \"Christianity and Honor.\" The Living Church, August 18, 2013, pp. 8–10. [analysis and application of Berger's \"On the Obsolescence of the Concept of Honor\" (1970)] * James D. Hunter, Stephen C. Ainley. Making Sense of Modern Times: Peter L. Berger and the Vision of Interpretive Sociology * Robert Wuthnow. Cultural Analysis: The Work of Peter L. Berger, Mary Douglas, Michel Foucault, and Jurgen Habermas ==Related pages== *List of sociologists from Europe ==References== ==Other websites== * Peter Berger's blog * Category:1929 births Category:2017 deaths Category:Deaths from heart failure Category:Naturalized citizens of the United States Category:Austrian scientists Category:American sociologists Category:American theologians Category:Austrian writers Category:Writers from Massachusetts Category:People from Brookline, Massachusetts",
 "title": "Peter L. Berger"
}