{
 "id": "589604",
 "text": "The Switch Solo (previously called Optare Solo) is a single decker bus, It has a low-floor, It has been made from 1998 to the present day by Switch Mobility. ==Optare Solo (1998–2012)== The Optare Solo is a single decker bus, it has a low-floor, It was made from 1998 to 2007 by Optare. ===Slimline=== A narrow version called the \"Slimline\" was launched in 2004 ===SE=== A short version called the \"SE\" was launched in 2006 ===EV=== An electric version called the \"EV\" was launched in 2009 === Gallery === File:MORRIS TRAVEL Carmarthen - Flickr - secret coach park.jpg|First generation Solo Original (M1020) File:Wheelers MV12 YMH.jpg|First generation Solo Slimline (M780SL) File:Dartline bus \"Mary Ethel\" (YJ58 VCK), 30 July 2012.jpg|First generation Solo SE (M780SE) File:TRENT - Flickr - secret coach park (6).jpg|First generation Solo EV (M950EV) File:Optare Solo M880 MX09AOO -4- CHESTER BS.JPG|Rear of a Townlynx Solo (M880) in Chester in April 2009 File:Arriva buses 2850 and 2840 Optare Solos YJ58 CBU and YJ08 XBW in Darlington 5 May 2009.JPG|Rear of an Arriva North East Solo (M950) in Darlington in May 2009. Note the difference in rear lights used on both buses. ==Optare/Switch Solo SR (2007–Present)== The Optare Solo SR is a single decker bus, it has a low- floor, It is made from 2007 to the present day by Optare. In 2012, it was improved, the chrome trim on the front and back bumper was removed, the optare logo on the front was removed and it had new rear lights In 2020, Optare changed its name to Switch Mobility and made electric vehicles only. In 2023, Optare Solo SR was replaced with Switch Solo SR, the bus interior and exterior stayed the same. ===Slimline=== A narrow version called the \"Slimline\" was launched. ===SE-R=== A short version called the \"SE-R\" was launched. ===Hybrid=== A diesel-electric hybrid Solo was launched. === EV === A battery electric Solo was launched in 2012. === Gallery === File:Arriva North West 711 MX12KVG (8458490079).jpg|SR (M960) (before improvements) File:Exeter Bampfylde Street - Dartline YJ10MHF.JPG|Slimline (M890SL) (before improvements) File:Exe Bridges - Stagecoach 48018 (YJ15AAF).JPG|Slimline (M925SL) (after improvements) File:Hebden Bridge (27596428551).jpg|SE-R (M720SE) (after improvements) File:A Hybrid Metroshuttle (5173181658).jpg|Hybrid (M820SR) (before improvements) File:16-11-15-Straßenszene Glasgow-RR2 7155.jpg|EV (M920EV) (before improvements) File:Arriva Kent & Sussex 1501 rear.JPG|SR (M960) rear (before improvements) File:CUMFYBUS CITYLINK OPTARE SOLOS AT THE PIER HEAD LIVERPOOL SEP 2014 (15204869806).jpg|SE-R (M720SE) rear (after improvements) ==References== ==Other websites== Category:Low-floor buses Solo Category:Minibuses Category:Midibuses Category:Battery electric buses",
 "title": "Optare Solo"
}