{
 "id": "589683",
 "text": "The subjects of the Russian Federation (Russian: субъекты Российской Федерации subekty Rossiyskoy Federatsii) are the main administrative divisions in Russia. Since 18 March 2014, Russia is made up of 85 federal subjects. They are grouped into eight federal districts. The federal subjects are divided into oblasts, republics, krais, autonomous okrugs, federal cities and an autonomous oblast. Republics are generally independent, each having its own constitution and legislature. They are meant to be home to a certain ethnic minority. The republics can also set their own official language.Article 68 of the Constitution of Russia ==Types== Each federal subject belongs to one of the following types: Legend Description The most common type of federal subject with a governor and local government. Nominally autonomous, each has its own constitution and legislature; is represented by the federal government in international affairs; is meant to be home to a specific ethnic minority. The same as an oblast, but with a different name. The name \"krai\" is old. With a substantial or predominant ethnic minority. Major cities that have their own region. The only autonomous oblast is the Jewish Autonomous Oblast. ==List== Code Name Capital/Administrative centre Flag Coat of arms Type Federal district Economic region Area (km2) Population Year established 01 Adygea, Republic of Maykop republic Southern North Caucasus 7,600 447,109 1922 02 Bashkortostan, Republic of Ufa republic Volga Ural 143,600 4,104,336 1919 03 Buryatia, Republic of Ulan-Ude republic Far Eastern East Siberian 351,300 981,238 1923 04 Altai Republic Gorno-Altaysk republic Siberian West Siberian 92,600 202,947 1922 05 Dagestan, Republic of Makhachkala republic North Caucasian North Caucasus 50,300 2,576,531 1921 06 Ingushetia, Republic of Magas (Largest city: Nazran) republic North Caucasian North Caucasus 4,000 467,294 1992 07 Kabardino-Balkar Republic Nalchik republic North Caucasian North Caucasus 12,500 901,494 1936 08 Kalmykia, Republic of Elista republic Southern Volga 76,100 292,410 1957 09 Karachay-Cherkess Republic Cherkessk republic North Caucasian North Caucasus 14,100 439,470 1957 10 Karelia, Republic of Petrozavodsk republic Northwestern Northern 172,400 716,281 1956 11 Komi Republic Syktyvkar republic Northwestern Northern 415,900 1,018,674 1921 12 Mari El Republic Yoshkar-Ola republic Volga Volga-Vyatka 23,200 727,979 1920 13 Mordovia, Republic of Saransk republic Volga Volga-Vyatka 26,200 888,766 1930 14 Sakha (Yakutia) Republic Yakutsk republic Far Eastern Far Eastern 3,103,200 949,280 1922 15 North Ossetia-Alania, Republic of Vladikavkaz republic North Caucasian North Caucasus 8,000 710,275 1924 16 Tatarstan, Republic of Kazan republic Volga Volga 68,000 3,779,265 1920 17 Tuva Republic Kyzyl republic Siberian East Siberian 170,500 305,510 1944 18 Udmurt Republic Izhevsk republic Volga Ural 42,100 1,570,316 1920 19 Khakassia, Republic of Abakan republic Siberian East Siberian 61,900 546,072 1930 20 Chechen Republic Grozny republic North Caucasian North Caucasus 15,300 1,103,686 1991 21 Chuvash Republic Cheboksary republic Volga Volga-Vyatka 18,300 1,313,754 1920 22 Altai Krai Barnaul krai Siberian West Siberian 169,100 2,607,426 1937 23 Krasnodar Krai Krasnodar krai Southern North Caucasus 76,000 5,125,221 1937 24 Krasnoyarsk Krai Krasnoyarsk krai Siberian East Siberian 2,339,700 2,966,042 1934 25 Primorsky Krai Vladivostok krai Far Eastern Far Eastern 165,900 2,071,210 1938 26 Stavropol Krai Stavropol krai North Caucasian North Caucasus 66,500 2,735,139 1934 27 Khabarovsk Krai Khabarovsk krai Far Eastern Far Eastern 788,600 1,436,570 1938 28 Amur Oblast Blagoveshchensk oblast Far Eastern Far Eastern 363,700 902,844 1932 29 Arkhangelsk Oblast Arkhangelsk oblast Northwestern Northern 587,400 1,336,539 1937 30 Astrakhan Oblast Astrakhan oblast Southern Volga 44,100 1,005,276 1943 31 Belgorod Oblast Belgorod oblast Central Central Black Earth 27,100 1,511,620 1954 32 Bryansk Oblast Bryansk oblast Central Central 34,900 1,378,941 1944 33 Vladimir Oblast Vladimir oblast Central Central 29,000 1,523,990 1944 34 Volgograd Oblast Volgograd oblast Southern Volga 113,900 2,699,223 1937 35 Vologda Oblast Vologda (Largest city: Cherepovets) oblast Northwestern Northern 145,700 1,269,568 1937 36 Voronezh Oblast Voronezh oblast Central Central Black Earth 52,400 2,378,803 1934 37 Ivanovo Oblast Ivanovo oblast Central Central 21,800 1,148,329 1936 38 Irkutsk Oblast Irkutsk oblast Siberian East Siberian 767,900 2,581,705 1937 39 Kaliningrad Oblast Kaliningrad oblast Northwestern Kaliningrad 15,100 955,281 1946 40 Kaluga Oblast Kaluga oblast Central Central 29,900 1,041,641 1944 41 Kamchatka Krai Petropavlovsk-Kamchatsky krai Far Eastern Far Eastern 472,300 358,801 2007 42 Kemerovo Oblast Kemerovo oblast Siberian West Siberian 95,500 2,899,142 1943 43 Kirov Oblast Kirov oblast Volga Volga-Vyatka 120,800 1,503,529 1934 44 Kostroma Oblast Kostroma oblast Central Central 60,100 736,641 1944 45 Kurgan Oblast Kurgan oblast Ural Ural 71,000 1,019,532 1943 46 Kursk Oblast Kursk oblast Central Central Black Earth 29,800 1,235,091 1934 47 Leningrad Oblast Largest city: Gatchina oblast Northwestern Northwestern 84,500 1,669,205 1927 48 Lipetsk Oblast Lipetsk oblast Central Central Black Earth 24,100 1,213,499 1954 49 Magadan Oblast Magadan oblast Far Eastern Far Eastern 461,400 182,726 1953 50 Moscow Oblast Largest city: Balashikha oblast Central Central 44,300 6,618,538 1929 51 Murmansk Oblast Murmansk oblast Northwestern Northern 144,900 892,534 1938 52 Nizhny Novgorod Oblast Nizhny Novgorod oblast Volga Volga-Vyatka 76,900 3,524,028 1936 53 Novgorod Oblast Veliky Novgorod oblast Northwestern Northwestern 55,300 694,355 1944 54 Novosibirsk Oblast Novosibirsk oblast Siberian West Siberian 178,200 2,692,251 1937 55 Omsk Oblast Omsk oblast Siberian West Siberian 139,700 2,079,220 1934 56 Orenburg Oblast Orenburg oblast Volga Ural 124,000 2,179,551 1934 57 Oryol Oblast Oryol oblast Central Central 24,700 860,262 1937 58 Penza Oblast Penza oblast Volga Volga 43,200 1,452,941 1939 59 Perm Krai Perm krai Volga Ural 160,600 2,819,421 2005 60 Pskov Oblast Pskov oblast Northwestern Northwestern 55,300 760,810 1944 61 Rostov Oblast Rostov-on-Don oblast Southern North Caucasus 100,800 4,404,013 1937 62 Ryazan Oblast Ryazan oblast Central Central 39,600 1,227,910 1937 63 Samara Oblast Samara oblast Volga Volga 53,600 3,239,737 1928 64 Saratov Oblast Saratov oblast Volga Volga 100,200 2,668,310 1936 65 Sakhalin Oblast Yuzhno-Sakhalinsk oblast Far Eastern Far Eastern 87,100 546,695 1947 66 Sverdlovsk Oblast Yekaterinburg oblast Ural Ural 194,800 4,486,214 1935 67 Smolensk Oblast Smolensk oblast Central Central 49,800 1,049,574 1937 68 Tambov Oblast Tambov oblast Central Central Black Earth 34,300 1,178,443 1937 69 Tver Oblast Tver oblast Central Central 84,100 1,471,459 1935 70 Tomsk Oblast Tomsk oblast Siberian West Siberian 316,900 1,046,039 1944 71 Tula Oblast Tula oblast Central Central 25,700 1,675,758 1937 72 Tyumen Oblast Tyumen oblast Ural West Siberian 143,520 3,264,841 1944 73 Ulyanovsk Oblast Ulyanovsk oblast Volga Volga 37,300 1,382,811 1943 74 Chelyabinsk Oblast Chelyabinsk oblast Ural Ural 87,900 3,603,339 1934 75 Zabaykalsky Krai Chita krai Far Eastern East Siberian 431,500 1,155,346 2008 76 Yaroslavl Oblast Yaroslavl oblast Central Central 36,400 1,367,398 1936 77 Moscow — federal city Central Central 2,511 10,382,754 78 Saint Petersburg — federal city Northwestern Northwestern 1,439 4,662,547 79 Jewish Autonomous Oblast Birobidzhan autonomous oblast Far Eastern Far Eastern 36,000 190,915 1934 80 Nenets Autonomous Okrug Naryan-Mar autonomous okrug Northwestern Northern 176,700 41,546 1929 81 Khanty–Mansi Autonomous Okrug – Yugra Khanty-Mansiysk (Largest city: Surgut) autonomous okrug Ural West Siberian 523,100 1,432,817 1930 82 Chukotka Autonomous Okrug Anadyr autonomous okrug Far Eastern Far Eastern 737,700 53,824 1930 83 Yamalo-Nenets Autonomous Okrug Salekhard (Largest city: Noyabrsk) autonomous okrug Ural West Siberian 750,300 507,006 1930 84 Republic of Crimea Simferopol republic Southern North Caucasus 26,964 1,966,801 2014 85 Sevastopol — federal city Southern North Caucasus 864 379,200 2014 a. The largest city is also listed when it is different from the capital/administrative center. b. According to Article 13 of the Charter of Leningrad Oblast, the governing bodies of the oblast are located in the city of St. Petersburg. However, St. Petersburg is not officially named to be the administrative center of the oblast. c. According to Article 24 of the Charter of Moscow Oblast, the governing bodies of the oblast are located in the city of Moscow and throughout the territory of Moscow Oblast. However, Moscow is not officially named to be the administrative center of the oblast. d. Not recognized internationally as a part of Russia. e. In February 2000, the former code of 20 for the Chechen Republic was cancelled and replaced with code 95. License plate production was suspended due to the Chechen Wars, causing numerous issues, which in turn forced the region to use a new code. == References ==",
 "title": "Federal subjects of Russia"
}