{
 "id": "589629",
 "text": "The Alexander Dennis Enviro200 is a single decker midibus. It has a low-floor. It was built from 2003 to 2018. It was built by TransBus International and then Alexander Dennis. ==First generation (2003–2007)== The first generation TransBus Enviro200 was launched in 2003. In 2004, Alexander Dennis made a hybrid model called the Enviro200H. === Gallery === File:Cobham Bus Rally 2013 - Flickr - Dave M Photography (8).jpg|First generation TransBus Enviro200 File:Alexander Dennis Enviro 200 demonstrator.JPG|First generation TransBus Enviro200 File:Enviro 200 rear.JPG|First generation TransBus Enviro200 rear ==Second generation (2006–2011)== The second generation Enviro200 (also known as the Enviro200 Dart) was launched in August 2006. It was launched as a midibus and as a chassis. The bus bodies Optare Esteem and MCV Evolution could be built on the Alexander Dennis Enviro200 chassis. In February 2007, Alexander Dennis made a Enviro200 body of a bus for the MAN 14.240 chassis. In 2008, Alexander Dennis made a hybrid-electric model called the Enviro200H. === Gallery === File:Arriva Southern Counties 4011 on Route 35, Woking Station (19200967100).jpg|Second generation Enviro200 File:Au Morandarte Flickr London Sovereign (Transdev) DE53 on Route H10, Harrow (9756136615).jpg|A second generation Enviro200 operated by Transdev London with doors in the middle File:SB09PAN-YX09FLE-4 131018 CPS (39964394313).jpg|A second generation Enviro200 rear operated by Panther Travel. File:Krapf Bus New Flyer Industries Midi (MD35) 1415 Phlash bus.jpg|A second generation New Flyer MiDi bus operated by Philly Phlash in Philadelphia == Third generation (2009–2018) == The third generation Enviro200 was launched in 2009. It was an improved model of the second generation Enviro200, It had new front lights, new front and rear bumpers, LED daytime running lights under the front lights and a new interior. In 2018, It was replaced by the Alexander Dennis Enviro200 MMC. ===North America=== In May 2012, Canadian bus maker New Flyer made a version of the third generation Enviro200 called the New Flyer MiDi for the North American market. === Gallery === File:NEWPORT TRANSPORT - Flickr - secret coach park (5).jpg|A third generation Enviro200 operated by Newport Transport showing the LED lights below the headlights. File:Arriva Midlands North 2150 MX12 JXN.jpg|A third generation Enviro200 operated by Arriva showing the blank space below the headlights. File:2012 Alexander Dennis Enviro 200 Dart.jpg|A third generation Enviro200 operated by Metroline with doors in the middle File:Z&S; Transport 172 OU12 CZV (14448776487).jpg|A third generation Enviro200 rear operated by Z&S; Transport. File:CARTA (Charleston, SC) Route 7 NFI MD30 Bay St. @ Broad St. (48111859707).jpg|A third generation New Flyer MiDi bus operated by Charleston Area Regional Transportation Authority in Charleston, South Carolina, USA == Notes == == References == == Other websites == Enviro200 Category:Midibuses",
 "title": "Alexander Dennis Enviro200"
}