{
 "id": "589994",
 "text": "Zurich is a city in Rooks County, Kansas, United States. In 2020, 89 people lived there. ==History== Zurich was created on the plains of northwest Kansas in the late 1870s. In 1880, John and Armenda Webb, who were born in Zurich, Switzerland, filed a US postal service application using the name of their birthplace, Zurich. The application was approved. Armenda Webb became the first postmaster of Zurich. She ran the post office from her home.\"Origin\", Plainville Times, 28 August 1980, p.1. Union Pacific Railroad built a railroad through western Kansas in 1888. The line was went just south of Zurich where a train depot was created. In 1918, fire destroyed most of the Zurich business district when the west side of Main Street caught fire. Three years later, fire destroyed the post office, creamery, and a store in northern Main Street.\"Big Fire at Zurich\", Plainville Times, 1 August 1918, p.1.\"Destructive Fire at Zurich\", Plainville Times, 26 May 1921, p.1.McClellan, Mrs. Lee. \"A History of Logan Township\", Plainville Times, 3 August 1961, p.3. The post office in Zurich was ended in 1996. ==Geography== Zurich is at (39.232265, -99.4347). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== In 2020, there were 89 people, 46 households, and 22 families living in Zurich. Of the households, 82.6% owned their home and 17.4% rented their home. The median age was 47.8 years. Of the people, 93.3% were White, 1.1% were Native American, 1.1% were Asian, 1.1% were Pacific Islanders, 3.4% were two or more races. Hispanic or Latino of any race were 4.5% of the people. ===2010 census=== In 2010, there were 99 people, 46 households, and 24 families living in Zurich. == Education== Zurich High School was consolidated to Palco High School in 1955. Zurich grade school closed in 1977.\"Parents Vote To Close Zurich School\", Plainville Times, 1 September 1977, p.1 The Zurich grade school mascot was the Wildcats.\"Zurich Grade News\", Plainville Times, 5 February 1970, p.11 ==References== ==Other websites== * Rooks County * Zurich City Map , KDOT Category:Cities in Kansas",
 "title": "Zurich, Kansas"
}