{
 "id": "590184",
 "text": "A cable ferry (known as chain ferry, swing ferry, floating bridge, or punt) is a ferry that is guided (and in some cases propelled) across a river by cables connected to both shores. Early cable ferries used either rope or steel chains, with the latter resulting in the name \"chain ferry\". Both of these were replaced by wire cable in the 19th century. ==List of cable ferry routes== Current cable ferry routes include: ===Albania=== *Butrint Ferry, across the Vivari Channel near Butrint:de:Vivar-Kanal ===Australia=== *Berowra Waters Ferry, at Berowra Waters in New South Wales *Blanchetown Punt *Bombah Point Ferry, at Bombah Point *Cadell Ferry, across the Murray River at Cadell, South Australia *Daintree River Ferry, across the Daintree River in Queensland *Hibbard Ferry, across the Hastings River near Port Macquarie, New South Wales *Lawrence Ferry, across the Clarence River in New South Wales *Lower Portland Ferry, across the Hawkesbury River near the village of Lower Portland, New South Wales *Lyrup Ferry, across the Murray River at Lyrup, South Australia *Mannum Ferry, across the Murray River at Mannum, South Australia (two parallel ferries) *Moggill Ferry, across the Brisbane River near Ipswich, Queensland *Morgan Ferry, across the Murray River in Morgan, South Australia *Mortlake Ferry, across the Parramatta River in Sydney, New South Wales *Narrung Ferry, across the Murray River at Narrung, South Australia *Noosa River Ferry, across the Noosa River in Queensland *Purnong Ferry, across the Murray River in Purnong, South Australia *Raymond Island Ferry, chain ferry from Paynesville to Raymond Island in Victoria *Sackville Ferry, across the Hawkesbury River near the village of Sackville, New South Wales *Settlement Point Ferry, across the Hastings River near Port Macquarie, New South Wales *Speewa Ferry, across the Murray River between New South Wales and Victoria at Speewa *Swan Reach Ferry, across the Murray River in Swan Reach, South Australia *Tailem Bend Ferry, across the Murray River in Tailem Bend, South Australia *Ulmarra Ferry, across the Clarence River in New South Wales *Waikerie Ferry, across the Murray River in Waikerie, South Australia *Walker Flat Ferry, across the Murray River in Walker Flat, South Australia *Webbs Creek Ferry, across the Hawkesbury River in the village of Wisemans Ferry, New South Wales *Wellington Ferry, across the Murray River in Wellington, South Australia *Wisemans Ferry, across the Hawkesbury River in the village of Wisemans Ferry, New South Wales *Wymah Ferry, across the Murray River between New South Wales and Victoria ===Austria=== *Rollfähre Klosterneuburg, across the Danube River at Klosterneuburg *Drahtseilbrücke Ottensheim, across the Danube River at Ottensheim ===Belgium=== *Belgium has about 20 cable ferries. 7 of them are small manual self-service ones. ===Belize=== *Xunantunich Ferry, across the Mopan River at Xunantunich ===Canada=== *Adams Lake Cable Ferry, across Adams Lake in British Columbia *Baynes Sound Connector, across Baynes Sound from Buckley Bay to Denman Island in British Columbia. The longest cable ferry in the world. *Belleisle Bay Ferry, across Belleisle Bay in New Brunswick *Big Bar Ferry, across the Fraser River at Big Bar, British Columbia *Bleriot Ferry, across the Red Deer River near Drumheller, Alberta *Clarkboro Ferry, across the South Saskatchewan River near Saskatoon, Saskatchewan *Country Harbour Ferry, across Country Harbour near Port Bickerton, Nova Scotia. *Crowfoot Ferry, across the Bow River in Alberta *Ecolos Ferry, across Ottawa River between Clarence-Rockland ON and Thurso QC *Englishtown Ferry, across the mouth of St. Anns Bay in Nova Scotia *Estuary Ferry, across the South Saskatchewan River near Estuary, Saskatchewan *Evandale Ferry, across the Saint John River in New Brunswick *Finnegan Ferry, across the Red Deer River in Alberta *Gagetown Ferry, across the Saint John River in New Brunswick *GladeFerry, across the Kootenay River in British Columbia *Gondola Point Ferry, across the Kennebecasis River in New Brunswick *Hampstead Ferry, across the Saint John River in New Brunswick *Harrop Cable Ferry, across Kootenay Lake in British Columbia *Howe Island ferries, across the Bateau Channel, St Lawrence River, Ontario *Kennebecasis Island Ferry, across the Kennebecasis River in New Brunswick *Klondyke Ferry, across the Athabasca River in Alberta *LaHave Cable Ferry, across the LaHave River in Nova Scotia *Lancer Ferry, across the South Saskatchewan River near Lancer, Saskatchewan *Laval-sur-le- Lac Île-Bizard Ferry, across the Rivière des Prairies between Montreal and Laval, Quebec *Lemsford Ferry, across the South Saskatchewan River near Lemsford, Saskatchewan *Little Fort Ferry, across the North Thompson River in British Columbia *Little Narrows Cable Ferry, across the Little Narrows of Whycocomagh Bay in Nova Scotia *Low Bar Ferry, across the Fraser River at High Bar, British Columbia *Lytton Ferry, across the Fraser River at Lytton, British Columbia *McLure Ferry, across the North Thompson River in British Columbia *Needles Cable Ferry, across Lower Arrow Lake in British Columbia *Quyon Ferry, across Ottawa River between Fitzroy Harbour ON & Quyon, QC *Riverhurst Ferry, across Lake Diefenbaker, Saskatchewan *Rosevear Ferry, across the McLeod River near Edson, Alberta *Simcoe Island Ferry, between Wolfe Island and Simcoe Island, St Lawrence River, Ontario *Usk Ferry, across the Skeena River at Usk, British Columbia *Westfield Ferry, across the Saint John River in New Brunswick ===Chile=== *Balseo de San Javier, across San Pedro River, Los Ríos Region. === Croatia === *Medsave Ferry, across the Sava River (Medsave–Zaprešić) in Zagreb County, overhead cable *Otočanka Ferry, across the Sava River (Otok Samoborski–Savski Marof) in Zagreb County, overhead cable *Oborovo, across the Sava River (Oborovo–Vrbovo Posavsko) in Zagreb County, overhead cable *Martinska ves, across the Sava River (Dubrovčak Lijevi–Dubrovčak Desni) in Sisak-Moslavina County, overhead cable *Tišina, across the Sava River (Tišina Kaptolska–Tišina Erdedska) in Sisak-Moslavina County, overhead cable *Sunjanka, across the Sava River (Graduša Posavska–Lukavec Posavski) in Sisak-Moslavina County, overhead cable *Kratečko, across the Sava River (Kratečko–Sunjsko Selište) in Sisak-Moslavina County, overhead cable *Pitomača Jelkuš Ferry, across the Drava River, in Virovitica–Podravina County *Pitomača Križnica, across the Drava River, in Virovitica–Podravina County *Osijek Zoološki vrt, across the Drava River, Osijek-Baranja County ===Czech Republic=== *Dolní Žleb Ferry, reactive ferry across the Elbe at Dolní Žleb near Děčín, lower cable *Vrané nad Vltavou – Strnady, reactive ferry across the Vltava before Prague, with overhead cable *Klecánky – Roztoky ferry over the Vltava under Prague, secured by overhead cable *Máslovice, Dol - Libčice ferry over the Vltava under Prague, secured by lower cable *Lužec nad Vltavou ferry over the Vltava, secured by overhead cable *Zlenice - Senohraby swimming pool, ferry over the Sázava river, overhead security cable installed but usually unused *Oseček ferry, Elbe river, formerly secured by overhead cable, now without it *Kazín ferry, Berounka river, 1992–2007 propelled through lower chain, since 2015 unsecured boat *Nadryby ferry, Berounka river, secured by the overhead cable *Darová ferry, Berounka river, propelled through the overhead cable ===Denmark=== *Østre Ferry, across Isefjord between Hammer Bakke and Orø. Uses cables for steering, but propellers for propulsion. *Udbyhøj Ferry, across Randers Fjord. ===Estonia=== *Kavastu Ferry, across Emajõgi in Kavastu (manual mechanism, more than century old flywheel) ===Finland=== *Ahvionsaari Ferry, from Kiviapaja to Ahvionsaari in Savonlinna *Alassalmi Ferry, across Alassalmi strait on lake Oulujärvi between Manamansalo island and mainland *Arvinsalmi Ferry, across Arvinsalmi strait between the municipalities of Rääkkylä and Liperi *Barösund Ferry, across Barösund strait between Barölandet and Orslandet islands *Bergö Ferry, in Bergö *Eskilsö Ferry *Föri in Turku *Hanhivirta Ferry, in Enonkoski *Haukkasalo Ferry *Hirvisalmi Ferry, across Hirvisalmi strait between the mainland and Paalasmaa island in Juuka *Hämmärönsalmi Ferry, across Hämmärönsalmi strait (Rimito-Hanka) in Rimito, Nådendal (part of r. road 1890) *Högsar Ferry, between Högsar and Storlandet islands in Nagu, Pargas (part of r. road 12019) *Karhun Cable Ferry, between the mainland and the island of Karhu, Ii *Keistiö Ferry, between Keistiö and Iniö islands in Iniö, Pargas *Kietävälänvirta Ferry, between Partalansaari and Viljakansaari in Puumala (part of road 15176) *Koivukanta Ferry, to Kesamonsaari in Savonlinna *Kokonsaari Ferry, from Kesamonsaari to Kokonsaari in Savanlinna *Kivimo Ferry, between Roslax on mainland Houtskär and Kivimo islands in Houtskär, Pargas *Kokkila Ferry, between Kokkila on the mainland and Angelniemi on Kimitoön (part of r. road 1835) *Kuparonvirta Ferry, between Hirvensalo and Anttola in Mikkeli (part of road 15147) *Kyläniemi Ferry, between Utula and Kyläniemi *Mossala Ferry, between Björkö and Mossala islands in Houtskär, Pargas (part of regional road 12003) *Pellinki Ferry, between the mainland and the island of Pellinki *Pettu Ferry, between Pettu and Utö islands in Finby, Salo *Pikkarala Ferry, across Oulujoki river in Pikkarala, Oulu *Potkusalmi Ferry, to Ritosaari in Savonlinna *Puutossalmi Ferry, in Kuopio *Rongonsalmi Ferry, between Viljakansaari and Lieviskä in Puumala, (part of road 15170) *Saverkeit Ferry, between mainland Houtskär and Västra Saverkeit islands in Houtskär, Pargas (part of r. road 12005) *Skagen Ferry, between Jumo and Iniö islands in Iniö, Pargas (part of r. road 12230) *Skåldö Ferry, between Degerö and Skåldö islands in Ekenäs, Raseborg *Tappuvirta Ferry, Tappuvirrantie *Tuohisaari Ferry, from Liistonsaari to Tuohisaari in Savonlinna *Vartsala Ferry, between Vartsala and Kivimaa islands in Kustavi (part of r. road 192) *Vånö Ferry, between Vånö and Attu islands in Pargas (part of r. road 12027) ====Åland==== *Björkölinjen, across Björkösund strait between the islands of Korsö (in Kumlinge municipality) and Bockholm (in Brändö m.) *Embarsundlinjen, across Embarsund strait in Föglö municipality, between the islands of Finholma and Jyddö *Töftölinjen, across Prästösund strait between the islands of Töftö (in Vårdö municipality) and Prästö (in Sund m.) *Seglingelinjen, across the strait between the islands of Seglinge and Snäckö (both in Seglinge village in Kumlinge municipality) *Simskälalinjen, across the strait between the islands of Alören and Östra Simskäla (both in Vårdö municipality) *Ängsösundlinjen, across Ängösund strait between the islands of Lumparland (in Lumparland municipality) and Ängö (in Vårdö m.) ===France=== *Bac du Sauvage Ferry, across a branch of the Rhône in the Camargue ===Gambia=== *Bansang Ferry, across the River Gambia at Bansang in the Central River Division ===Germany=== *Aken Ferry, across the Elbe at Aken in Saxony-Anhalt *Barby Ferry, across the Elbe at Barby in Saxony-Anhalt *Caputh Ferry, across the Havel at Caputh in Brandenburg *Coswig Ferry, across the Elbe at Coswig in Saxony-Anhalt *, across the Rhine from Lottstetten in Baden-Württemberg to Marthalen in Switzerland *Ferchland Grieben Ferry, across the Elbe between Ferchland and Grieben in Saxony-Anhalt *, across the Oste at Gräpel in Lower Saxony *Ketzin Cable Ferry, across the Havel at Ketzin in Brandenburg *Kiewitt Ferry, across the Havel at Potsdam in Brandenburg *Maintal–Dörnigheim Ferry, across the Main near Maintal in Hesse *Friesenheimer Insel – Sandhofen Ferry, across an old arm of the Rhine in Mannheim *Pritzerbe Ferry, across the Havel between Havelsee and Kützkow in Brandenburg *Rathen Ferry, across the Elbe at Rathen in Saxony *Räbel Ferry, across the Elbe between Räbel and Havelberg in Saxony-Anhalt *Rothenburg Ferry, across the Saale at Rothenburg in Saxony-Anhalt *Sandau Ferry, across the Elbe at Sandau in Saxony-Anhalt *Straussee Ferry, across the Straussee at Strausberg in Brandenburg *Teterower See Ferry, to an island in the Teterower See in Mecklenburg-Vorpommern *Veckerhagen Ferry, across the Weser between Veckerhagen in Hesse and Hemeln in Lower Saxony *Westerhüsen Ferry, across the Elbe at Magdeburg in Saxony-Anhalt ===Hong Kong=== *Nam Sang Wai Ferry, at Nam Sang Wai in northwestern New Territories ===Hungary=== *One cable ferry across the Danube between Csepel and Soroksár, in Budapest *A cable ferry crosses the Tisza between Tiszalök and Tiszatardos ===Ireland=== *A cable ferry serves Little Island and Waterford Castle in the River Suir ===Italy=== *Two cable ferries across the port of Cesenatico, in Romagna *One cable ferry across the port of Bellaria-Igea Marina, in Romagna *An engineless cable ferry (Traghetto di Leonardo) between Imbersago (Lecco) e Villa d'Adda (Bergamo), in Lombardia, in the Ecomuseo Adda di Leonardo da Vinci river museum *Another \"Traghetto di Leonardo\" across the Tevere river, in Lazio, in the Riserva Naturale di Nazzano natural reserve ===Mozambique=== *Ferry across Shire River, 37 km south of Malawi's southernmost border ===Netherlands=== There are about 150 cable ferries in the Netherlands,. About 111 of these are small hand-powered self-service ones and of these 24 use chains. Some examples: *Cuijk ferry, across the Meuse at Cuijk *Genemuiden ferry, across the Zwarte Water at Genemuiden *Jonen ferry, across the Walengracht at Jonen, only taking foot passengers and cyclists, winched to the other bank by an electric motor on one of the banks. *Lexkesveer, across the Nederrijn near Wageningen, first mentioned in 1426 *Oijen Ferry, across the Meuse at Oijen *Wijhe Ferry, across the IJssel at Wijhe *Wijk bij Duurstede ferry, across the Lek. This one uses a floating cable. ===New Zealand=== *Tuapeka Mouth Ferry, in Tuapeka – South Island, on the Clutha River ===Norway=== *Fjone ferry, across lake Nisser in Nissedal, Telemark – Fjone cable ferry, in Norwegian with English summary *Espevær Ferry, in Bømlo, Hordaland *Duesund–Masfjordnes, in Nordhordland *Mjånes-Hisarøy, in Gulen, Sogn og Fjordane ===Poland=== *Biechowy Ferry, across the Warta between Biechowy and Piersk *Borusowa Ferry, across the Vistula between Borusowa and Nowy Korczyn road no. 973 *Brody Ferry, across the Oder at Brody road no. 280 *Brzeg Dolny Ferry, across the Oder between Brzeg Dolny and Głoska *Ciszyca Ferry, across the Vistula between Tarnobrzeg and Ciszyca road no. 758 *Czchów Ferry, across the Dunajec between Czchów and Piaski Drużków *Czeszewo Ferry, across the Warta at Czeszewo *Dębno Ferry, across the Warta between Dębno and Orzechowo *Gniew Ferry, across the Vistula between Gniew and Janowo road no. 510 *Grzegorzowice Ferry, across the Oder between Grzerorzowice and Ciechowice road no. 421 *Janowiec Ferry, across the Vistula between Kazimierz Dolny and Janowiec *Korzeniewo Ferry, across the Vistula between Korzeniewo and Opalenie road no. 232 *Kozubów Ferry, across the Warta between Kozubów and Osina *Krzemienna Ferry, across the San between Krzemienna and Jabłonica Ruska *Milsko Ferry, across the Oder between Milsko and Przewóz road no. 282 *Nozdrzec Ferry, across the San between Nozdrzec and Dąbrówka Starzeńska *Opatowiec Ferry, across the Vistula between Opatowiec and Ujście Jezuickie *Otfinów Ferry, across the Dunajec between Otfinów and Pasieka Otfinowska *Pogorzelica Ferry, across the Warta between Pogorzelica and Nowa Wieś Podgórna *Połaniec Ferry, across the Vistula between Połaniec and Gliny Małe *Połęcko Ferry, across the Oder between Połęcko and Chlebowo road no. 138 *Pomorsko Ferry, across the Oder at Pomorsko road no. 281 *Siedliszowice Ferry, across the Dunajec between Siedliszowice and Wietrzychowice *Sławsk Ferry, across the Warta between Sławsk and Węglewskie Holendry *Świniary Ferry, across the Vistula between Baranów Sandomierski and Świniary road no. 872 *Waki Ferry, across the Warta at Waki === Slovakia === *Perec Ferry, across the Perec distributary of the river Hron, between Starý Tekov and Nový Tekov in Levice district - Foot ferry, came into use in the late 18th century and ceased operations in 2014, replaced by a bridge. ===South Africa=== *Malgas Ferry for 2-3 cars, 120 m across the Breede River at Malgas, Western Cape, powered by 2-4 men walking a rope, in operation from 1860 to 2019, when it was replaced by a diesel-powered ferry in spite of a petition with over 21000 signatures appealing to save the unique historic crossing. *Octha Ferry at Sendelingsdrift, for 2 cars, across the Garib (Orange) River to Namibia, guided by tethers on high rope, powered by two outboard motors and possibly the water current. ===South Korea=== *Abai village ferry in Sokcho ===Spain=== *Pas de barca de Flix, across the Ebro river, in Flix, Catalonia *Pas de barca de Miravet, across the Ebro river, in Miravet, Catalonia ===Sweden=== *, in Lake Mälaren from Munsö to Adelsö *, in Lake Revsund from Ammer to Stavre *, between Ängön and Fruvik on Bokenäset *, in Lake Mälaren from Oknö to Arnö *, across Lule River from Avan to Norra Sunderbyn *, across Djupträsket from Sandudden to Boheden *, from Malmön to Roparöbacken *Bojarkilen Ferry, across Bojarkilen in Strömstad *, across Lake Bolmen from Sunnaryd to Bolmsö *, across Hamburgsund from Hamburgsund to Hamburgön *Högmarsö Ferry, from Högmarsö to Svartnö *, across Byälven from Högsäter to Fryxnäs *, across Storsjön from Isön to Norderön *, across Ivö Lake between Barum and Ivö Island *, across the Nordre älv between Kornhall and Brunnstorpsnäs *Kostersundet Ferry, across Kostersundet from Nordkoster to Sydkoster *, between the islands of Lyr and Orust *, between the islands of Malö and Orust *, across the Kalix river at Rödupp *, across the Slätbaken between Slottsholmen and Norrkrog *, across the Stora Le lake *Töreboda Ferry, across the Göta Canal in Töreboda *Torpön Ferry, across Lake Sommen from Torpön to Blåvik *Vaxholmen Ferry, from the town of Vaxholm to Vaxholm Castle *Ytterö Ferry, from Ytterön to Yttre park ===Switzerland=== All reaction ferries: *, four routes across the Rhine in the city of Basel * Ferry across the Sitter at Bischofszell *, across the Aare * Ferry across the Doubs at Tariche *, across the Rhine from Marthalen to Lottstetten in Germany *, across the Limmat river at Fahr Abbey, since 1896. * across the Rhine to Germany * Ferry Reichenbach across the Aare at Zollikofen * Ferry across the Reuss at Sulz * Fähre Wolfwil–Wynau across the Aare * Ferry Zehendermätteli across the Aare near Bern *, across the Rhine to Germany ===United Kingdom=== *Butts Ferry, across the River Exe in Exeter, Devon *Cowes Floating Bridge, across the River Medina on the Isle of Wight *Dartmouth Higher Ferry, across the River Dart in Devon *Hampton Ferry, across the River Avon near Evesham in Worcestershire *Hampton Loade Ferry, across the River Severn in Shropshire (closed 2016) *King Harry Ferry, across the River Fal in Cornwall *Normanton- on-Soar Chain Ferry, across the River Soar in Nottinghamshire *Reedham Ferry, across the River Yare in Norfolk *Sandbanks Ferry, across the entrance to Poole Harbour in Dorset *Stratford-upon-Avon Ferry, across the River Avon at Stratford-upon-Avon in Warwickshire *Symonds Yat river crossings, a pair of hand powered ferries across the River Wye in Herefordshire *Torpoint Ferry, across the River Tamar between Devon and Cornwall. *Trowlock Island Ferry, a hand powered ferry to Trowlock Island in the River Thames in south-western Greater London *Windermere Ferry, across Windermere in Cumbria ===United States=== *Akers Ferry, across the Current River near Salem in Missouri *Avoca Island Ferry, across the intracoastal waterway to Avoca Island near Morgan City in Louisiana *Bemus Point-Stow Ferry, across Chautauqua Lake in New York *Buena Vista Ferry, across the Willamette River in Oregon *Canby Ferry, across the Willamette River in Oregon *Los Ebanos Ferry, across the Rio Grande between Los Ebanos, Texas and Gustavo Díaz Ordaz, Tamaulipas *Elwell Ferry, across the Cape Fear River in North Carolina *Fredericktown Ferry, closed in 2013 across the Monongahela River in southwestern Pennsylvania * Green River Ferry, across the Green River in Mammoth Cave National Park *Hatton Ferry, across the James River in Virginia *Ironton Ferry, across an arm of Lake Charlevoix in Michigan *J-Mack Ferry, across an arm of the Sacramento River in California *Merrimac Ferry, across the Wisconsin River in Wisconsin *Merry Point Ferry, across the Corrotoman River in Virginia *Parker's Ferry, across the Meherrin River in North Carolina *Princeton Ferry, across the Sacramento River in California * Reed's Ferry, across the Green River northeast of Rochester, KY * Rochester Ferry, across the Green River in Rochester, KY *Sans Souci Ferry, across the Cashie River in North Carolina *Saugatuck Chain Ferry, across the Kalamazoo River in Michigan *Sunnybank Ferry, across the Little Wicomico River in Virginia *Sycamore Island Ferry, across the Potomac River in Maryland *Fort Ticonderoga Ferry, across Lake Champlain between Ticonderoga, New York and Shoreham, Vermont *Upper Ferry, across the Wicomico River in Maryland *Valley View Ferry, across the Kentucky River in Kentucky *Wheatland Ferry, across the Willamette River in Oregon *White's Ferry, across the Potomac River in Maryland *Whitehaven Ferry, across the Wicomico River at Whitehaven, Maryland *Woodland Ferry, across the Nanticoke River in Delaware ===Zambia=== *Chambeshi Ferry, across the Chambeshi River near Mbesuma *Kabompo Ferry, across the Kabompo River 80 km south-east of Kabompo *Kafue Ferry, across the Kafue River 4.5 km west of the Zambezi ===Zimbabwe=== *Ekusileni Ferry, across the Insiza River downstream of Filabusi ==References== ==Other websites== *Twyford chain ferry on the River Trent,UK, 1899 *Cable ferries operating in New Brunswick, Canada Category:Ferries",
 "title": "Cable ferry"
}