{
 "id": "590198",
 "text": "The arrondissement of Saint-Claude is an arrondissement of France. It is part of the Jura département in the Bourgogne-Franche-Comté region. Its capital, and subprefecture of the department, is the city of Saint-Claude. ==History== When the arrondissements of Jura were created in 1800, Saint-Claude was one of them in the Jura department. ==Geography== The arrondissement of Saint-Claude is in the southwest of the Jura département; it is the smaller arrondissement with an area of . It has a population of 50,909 inhabitants, the arrondissement with fewest people living in it, and a population density of inhabitants/km². The arrondissement of Saint-Claude is bordered to the north and west by the arrondissement Lons-le-Saunier, to the east by Switzerland and to the south by the Ain département. ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Saint-Claude, there are five cantons and three of them have all their \"communes\" in the arrondissement: # Moirans- en-Montagne (3909) (partly) # Morez (3911) # Saint-Claude (3914) # Saint- Laurent-en-Grandvaux (3915) (partly) # Saint-Lupicin (3916) ===Communes=== The arrondissement of Saint-Claude has 60 communes; they are (with their INSEE codes): # Avignon-lès-Saint-Claude (39032) # Bellecombe (39046) # Bellefontaine (39047) # Bois-d'Amont (39059) # Les Bouchoux (39068) # Chancia (39102) # Charchilla (39106) # Chassal (39113) # Château-des-Prés (39115) # Châtel-de-Joux (39118) # La Chaumusse (39126) # Nanchez (39130) # La Chaux-du- Dombief (39131) # Choux (39151) # Coiserette (39157) # Coyrière (39174) # Coyron (39175) # Crenans (39179) # Les Crozets (39184) # Étival (39216) # Fort-du-Plasne (39232) # Grande-Rivière (39258) # Jeurre (39269) # Lac-des- Rouges-Truites (39271) # Lajoux (39274) # Lamoura (39275) # Larrivoire (39280) # Lavancia-Épercy (39283) # Lavans-lès-Saint-Claude (39286) # Lect (39289) # Leschères (39293) # Longchaumois (39297) # Maisod (39307) # Martigna (39318) # Meussia (39328) # Moirans-en-Montagne (39333) # Molinges (39339) # Montcusel (39351) # Morbier (39367) # Hauts de Bienne (39368) # Les Moussières (39373) # La Pesse (39413) # Les Piards (39417) # Pratz (39440) # Prémanon (39441) # Ravilloles (39453) # La Rixouse (39460) # Rogna (39463) # Les Rousses (39470) # Saint-Claude (39478) # Saint-Laurent-en-Grandvaux (39487) # Coteaux du Lizon (39491) # Saint-Pierre (39494) # Septmoncel Les Molunes (39510) # Vaux-lès- Saint-Claude (39547) # Villard-Saint-Sauveur (39560) # Villards-d'Héria (39561) # Villard-sur-Bienne (39562) # Viry (39579) # Vulvoz (39585) The communes in the arrondissement with more inhabitants are: INSEE code Commune Population (2014) Canton Intercommunality 39478 Saint-Claude 10,096 Saint-Claude Haut- Jura Saint-Claude 39368 Hauts de Bienne 5,457 Morez Haut-Jura (Arcade) 39470 Les Rousses 3,276 Morez La Station des Rousses-Haut Jura 39367 Morbier 2,302 Morez Haut-Jura (Arcade) 39333 Moirans-en-Montagne 2,158 Moirans-en-Montagne Jura Sud 39491 Coteaux du Lizon 2,074 Saint-Claude and Saint-Lupicin Haut-Jura Saint-Claude 39286 Lavans-lès-Saint-Claude 1,986 Saint-Lupicin Haut-Jura Saint-Claude 39487 Saint-Laurent-en-Grandvaux 1,845 Saint-Laurent-en-Grandvaux La Grandvallière 39059 Bois-d'Amont 1,672 Morez La Station des Rousses-Haut Jura 39297 Longchaumois 1,184 Morez Haut-Jura (Arcade) 39441 Prémanon 1,158 Morez La Station des Rousses-Haut Jura ==Related pages== * Arrondissements of the Jura department * Communes of the Jura department ==References== Saint- Claude",
 "title": "Arrondissement of Saint-Claude"
}