{
 "id": "590266",
 "text": "Darkseid (pronounced \"Darkside\") is a fictional supervillain appearing in American comic books published by DC Comics. Created by writer-artist Jack Kirby, the character made a cameo appearance in Superman's Pal Jimmy Olsen #134 (Dec. 1970) before making his full first appearance in Forever People #1 (Feb. 1971). One of the most powerful beings in the DC Universe, the character became a staple Superman villain and a major enemy of the Justice League. Darkseid was ranked number 6 on IGN's top 100 comic book villains of all time and number 23 on Wizard's 100 greatest villains of all time. == Publication history == The character was created by writer-artist Jack Kirby and made a cameo appearance in Superman's Pal Jimmy Olsen #134 (Dec. 1970) before making his full first appearance in Forever People #1 (Feb. 1971). == Fictional character biography == As the tyrannical ruler of the planet Apokolips and formerly known as Uxas, Darkseid's ultimate goal is to conquer the universe and eliminate all free will. == Powers and abilities == Darkseid is an extremely powerful being, filled with godly power. He has great physical strength, invulnerability, and Omega Beams, which are a vision power that is immensely powerful and can even do considerable damage to a Bronze Age Kryptonian. He can control the beams in midair, even after they've left his eyes. Unlike his parents, Darkseid possesses many powers and abilities. == In other media == The character has been substantially adapted to various forms of media, most notably being voiced by Frank Welker in Super Friends: The Legendary Super Powers Show and The Super Powers Team: Galactic Guardians, by Michael Ironside in the DC animated universe, and by Andre Braugher in Superman/Batman: Apocalypse. After being referenced multiple times in the DC Extended Universe, Darkseid made his live-action debut in the movie Zack Snyder's Justice League with Ray Porter playing him in 2021. ==References== Category:DC Comics aliens Category:Fictional characters introduced in the 1970s Category:Galactic emperors Category:DC Comics supervillains",
 "title": "Darkseid"
}