{
 "id": "59062",
 "text": "Continuum Exponent (a) Stimulus condition Loudness 0.67 Sound pressure of 3000 Hz tone Vibration 0.95 Amplitude of 60 Hz on finger Vibration 0.6 Amplitude of 250 Hz on finger Brightness 0.33 5° target in dark Brightness 0.5 Point source Brightness 0.5 Brief flash Brightness 1 Point source briefly flashed Lightness 1.2 Reflectance of gray papers Visual length 1 Projected line Visual area 0.7 Projected square Redness (saturation) 1.7 Red-gray mixture Taste 1.3 Sucrose Taste 1.4 Salt Taste 0.8 Saccharine Smell 0.6 Heptane Cold 1 Metal contact on arm Warmth 1.6 Metal contact on arm Warmth 1.3 Irradiation of skin, small area Warmth 0.7 Irradiation of skin, large area Discomfort, cold 1.7 Whole body irradiation Discomfort, warm 0.7 Whole body irradiation Thermal pain 1 Radiant heat on skin Tactual roughness 1.5 Rubbing emery cloths Tactual hardness 0.8 Squeezing rubber Finger span 1.3 Thickness of blocks Pressure on palm 1.1 Static force on skin Muscle force 1.7 Static contractions Heaviness 1.45 Lifted weights Viscosity 0.42 Stirring silicone fluids Electric shock 3.5 Current through fingers Vocal effort 1.1 Vocal sound pressure Angular acceleration 1.4 5 s rotation Duration 1.1 White noise stimuli Stevens' power law is a proposed relationship between the magnitude of a physical stimulus and the intensity or strength that people feel. Most people think that it describes a wider range of sensations than Weber-Fechner law. But critics argue that the validity of the law is not sure. The theory is named after psychophysicist Stanley Smith Stevens (1906–1973). Although the idea of a power law had been suggested by 19th century researchers, Stevens is credited with reviving the law and publishing a body of psychophysical data to support it in 1956. The general form of the law is :\\psi(I) = k I ^a , \\,\\\\! where I is the magnitude of the physical stimulus, \\psi is the psychophysical function capturing sensation (the subjective size of the stimulus), a is an exponent that depends on the type of stimulation and k is a proportionality constant that depends on the type of stimulation and the units used. The table to the right lists the exponents reported by Stevens. == References == * Ellermeier, W., Faulhammer, G. (2000). Empirical evaluation of axioms fundamental to Stevens's ratio-scaling approach: I. Loudness production. Perception & Psychophysics, 62, 1505–1511. * Green, D. M., & Luce, R. D. (1974). Variability of magnitude estimates: a timing theory analysis. Perception & Psychophysics, 15, 291–300. * Luce, R. D. (2002). A psychophysical theory of intensity proportions, joint presentations, and matches. Psychological Review, 109, 520–532. * Narens, L. (1996). A theory of ratio magnitude estimation. Journal of Mathematical Psychology, 40, 109–129. * Smelser, N. J., & Baltes, P. B. (2001). International encyclopedia of the social & behavioral sciences. pp. 15105–15106. Amsterdam; New York: Elsevier. . * Steingrimsson, R., & Luce, R. D. (2006). Empirical evaluation of a model of global psychophysical judgments: III. A form for the psychophysical function and intensity filtering. Journal of Mathematical Psychology, 50, 15–29. * Stevens, S. S. (1957). On the psychophysical law. Psychological Review 64(3):153–181. PMID 13441853. * Zimmer, K. (2005). Examining the validity of numerical ratios in loudness fractionation. Perception & Psychophysics, 67, 569–579. Category:Psychology",
 "title": "Stevens' power law"
}