{
 "id": "590650",
 "text": "Alternative for Germany (German: Alternative für Deutschland, shortened AfD) is a German nationalist and conservative right-wing political party. In the 2017 federal election, the party won 94 seats after receiving 12.6% of the national vote. == History == In 2012, Alexander Gauland, Bernd Lucke and Konrad Adam formed the Electoral Alternative 2013. It was critical of Germany's policy toward the eurozone crisis. Some candidates who were part of the Electoral Alternative 2013 ran for election in Lower Saxony in alliance with the Free Voters. They then decided to form a party to compete in the 2013 federal election. The group wanted to abolish the euro, so the Free Voters refused to join forces. The AfD's first supporters were economists, business leaders, journalists and former members of the Christian Democratic Union who were critical of the eurozone.Matthew Boesler, \"A small band of German professors is the hottest new threat to the future of the Euro,\" Business Insider (4 March 2013). The AfD held their first convention on 14 April 2013. Members elected Bernd Lucke, Frauke Petry and Konrad Adam as speakers. In the 2013 federal election, the party received 4.6% of the national vote with more than 2 million votes. The party did not win any seats. Before the 2014 European Parliament election, the AfD held a conference on 25 January 2014 in Bavaria. They chose the slogan, Mut zu Deutschland (\"Courage [to stand up] for Germany\"). In February 2014, some AfD officials wanted to join an alliance with the hard eurosceptic party, UKIP. However, Bernd Lucke and other officials and election candidates wanted to instead join an alliance with the British Conservative Party. In the European elections, the AfD won 7 seats in the European Parliament, and joined the European Conservatives and Reformists. On 4 July 2015, Frauke Petry was elected as the principal speaker of the party. She was a member of the national conservate faction within the party. Her election is seen as a shift of the party further to the right wing, as the party now began to focus on Islam and immigration. Lucke believed the party was turing into the \"PEGIDA party.\" He left the party a few days later, citing the rise of xenophobia within the party. On 19 July 2015, Lucke formed the Alliance for Progress and Renewal (ALFA). In February 2016, AfD announced an alliance with the Freedom Party of Austria (FPÖ).Deutsche AfD und FPÖ beschließen Zusammenarbeit (in German). Der Standard. Retrieved 19 February 2016. On 8 March 2016, the European Conservatives and Reformists decided they will begin to exclude the AfD from their groups due to their links to the far- right FPÖ. In 2016, the party won seats in the Berlin, Baden-Württemberg, Mecklenburg-Vorpommern, Rhineland-Palatinate and Saxony-Anhalt Landtags. At the AfD party conference held on 30 April to 1 May 2016, the party called for a ban on burkhas, minarets and the call to prayer, using the slogan \"Islam is not a part of Germany\". Frauke Petry decided not to run as the party's main candidate in the 2017 federal election. This was a consequence of the internal power struggle within the party. The party chose Alexander Gauland, a strong conservative and former member of the CDU, to lead the party in the elections. Alice Weidel, who is seen as being more moderate, was elected as his running mate. The party's platform was mainly to close the borders to asylum seekers, end sanctions on Russia and leave the European Union if Germany's national sovereignty isn't restored. After the election, the party received 5.8 million votes, winning 94 seats in the Bundestag. This is the first time the party has held seats in the Bundestag. A day after the successful 2017 federal election, Frauke Petry left the party. She did this as a response to extremist comments made by some members in the AfD. She would later join the Blue Party, which is another right-wing conservative party. A politician representing AfD, was elected (in 2023) as a mayor.https://www.aftenposten.no/verden/nyhetsanalyse/i/0QxrdA/tyske-velgere- stroemmer-til-ytre-hoeyre-hvorfor-gjoer-de-det. Aftenposten.no. Retrieved 2023-09-07 The Hamburg Regional Court issued a preliminary injunction against ZDF and NDR, prohibiting the claim that the Potsdam meeting involved discussions about the deportation of German citizens, ruling it an untrue factual assertion. == Beliefs == The AfD's ideology is described as right-wing populist, * * * * * * * conservative and anti-immigration. The party is against same-sex marriage and has a platform of climate change denial. The party has also aligned itself with groups that are against modern feminism.Kemper, Andraes (March 2014) \"Keimzelle der Nation? Familien- und geschlechter-politische Positionen der AfD – eine Expertise\" (Germ cell of the nation? Family and gender political positions of the AfD - an expertise) Friedrich Ebert Stiftung Forum Politik und Gesellschaft Alternative for Germany is eurosceptic and critical about the influx of foreigners in Germany. == References == == Other websites == * *Manifesto for Germany: The Political Programme for the Alternative for Germany (2017, English translation) Category:2013 establishments in Europe Category:2010s establishments in Germany Category:Alternative for Germany Category:Antifeminism Category:Conservatism Category:Conservative parties Category:Nationalism",
 "title": "Alternative for Germany"
}