{
 "id": "590714",
 "text": "Bikini Bottom is a town from SpongeBob SquarePants. == Locations == === Homes === * SpongeBob's Home - A pineapple house. In \"Truth or Square\", it is revealed that his home appeared on Squidward's garden. * Patrick's Home - A rock house. * Squidward's Home - A Moai. * Mr. Krabs' and Pearls' Home - An anchor house. * Sandy's Home - A treedome with air house. * Plankton's Home/Chum Bucket - The Chum Bucket * Various apartments in the city in bikini bottom === emergency centers === * The bikini police department * the hospital ONLY for serious medical emergencies * Weenie hut general practitioner for small injuries * the bikini bottom fire department useless until the daly Breaking of reality * the jail is self explanatory === Shopping & entertainment === * The theater * Bargain mart * Bikini reality * Adult learning center * Department of jokes and pranks * bikini bottom mall * Recreation center === Restaurants === * Krusty Krab - A restaurant with Krabby Pattys. *The Chum Bucket - A restaurant that sells Chum, is run by Plankton and his robotic wife Karen. *Fancy! - A higher end restaurant. It is a ship in a bottle. *The Salty Spitoon - A restaurant/bar for tough fish. *Weenie Hut Jr's - A restaurant with two other counterparts, Super Weenie Hut Jr's and Weenie Hut General. *Super Weenie Hut Jr's - A restaurant with two other counterparts, Weenie Hut Jr's and Weenie Hut General. *Weenie Hut General - A restaurant with two other counterparts, Weenie Hut Jr's, and Super Weenie Hut Jr's. *Goofy Goobers ice cream party boat - a restaurant/bar for kids and adult’s *The Diner - cafe/restaurant *The Wet Noodle - restaurant === Parks and HOA neighborhoods === * Goo Lagoon * Jellyfish Fields * Tentacle Acres * Glove world * bikini bottom park * the industrial park == Characters == * SpongeBob * Patrick * Squidward * Mr. Krabs * Plankton * Gary * Sandy * Pearl * Mrs.Puff * Pearl Krabs * Mermaid Man * Barnacle Boy Category:Fictional locations Category:SpongeBob SquarePants",
 "title": "Bikini Bottom"
}