{
 "id": "591039",
 "text": "Peter Härtling (13 November 1933 – 10 July 2017) was a German writer, poet, publisher and journalist. He received the Order of Merit of the Federal Republic of Germany for his major contribution to German literature. His first children's book, Und das ist die ganze Familie, was published the following year. His children's literature has often focused on social problems involving children. ==More reading== * Burckhard Dücker, Peter Härtling, München: Beck: Verlag Edition Text und Kritik, 1983, * Maciej Ganczar, Romantische Künstlerfiguren in der Prosa von Peter Härtling, Frankfurt am Main: Peter Lang, 2015, *Ludvík Václavek: Peter Härtling und Olmütz. In: Lucy Topoľská und Ludvík Václavek: Beiträge zur Deutschsprachigen Literatur in Tschechien. (= Beiträge zur mährischen deutschsprachigen Literatur. Band 3). Univerzita Palackého, Olomouc 2000, , S. 211-214. ==Radio== Härtling moderated Literatur im Kreuzverhör, a radio show on the cultural radio station of Hessischer Rundfunk. == Awards == Peter Härtling's awards include: * 1964: Deutscher Kritikerpreis for Niembsch * 1965: Lower Saxony Literature Prize for Niembsch * 1966: Ehrengabe des Kulturkreises im Bundesverband der Deutschen Industrie for Niembsch. Prix du Meilleur Livre Étranger for the French edition of Niembsch * 1971: Gerhart Hauptmann prize of the Freien Volksbühne Berlin for Gilles * 1974: Schubart-Literaturpreis * 1976: Deutscher Jugendliteraturpreis (Children's book) for Oma. * 1977: Stadtschreiber von Bergen * 1978: Wilhelmine-Lübke-Preis * 1980: Zurich children's literature prize La vache qui lit for Ben liebt Anna and Sofie macht Geschichten. * 1982: Naturschutzpreis der Kreisgruppe Groß-Gerau des Bundes für Umwelt und Naturschutz. * 1987: Hermann Sinsheimer prize and Friedrich Hölderlin prize * 1992: Lion Feuchtwanger prize. * 1994: Awarded the title of Professor by the state of Baden-Württemberg * 1995: Awarded the Großes Bundesverdienstkreuz * 1995: Mainzer Stadtschreiber * 1996: Awarded the Wilhelm Leuschner medal of Hessen * 1996: Awarded the Karl Preusker Medal by the German Literature Conference * 2000: Eichendorff Literature Prize * 2001: Deutscher Jugendliteraturpreis (Special prize) for his major contribution to children's literature * 2001: Dresdner Poetikdozentur zur Literatur Mitteleuropas (Publikation ) * 2003: Deutscher Bücherpreis for his contribution to literature * 2004: Honorary citizen of Nürtingen * 2006: Gerty Spies Literature Prize * 2006: Finalist, Hans Christian Andersen Award\"2006\". Hans Christian Andersen Awards. International Board on Books for Young People (IBBY). With contemporary material including the press release, 27 March 2006. Retrieved 22 March 2014. * 2007: Corine Literature Prize of the Bavarian Prime Minister for his contribution to literature * 2010: Jacob Grimm Prize * 2014: Hessischer Kulturpreis == Music == Wilhelm Killmayer set nine of his poems in his song cycle in 1968. ==References== ==Other websites== Category:1933 births Category:2017 deaths Category:German journalists Category:German novelists Category:German poets Category:German publishers",
 "title": "Peter Härtling"
}