{
 "id": "591296",
 "text": "Luigi Ferdinando Tagliavini (7 October 1929 – 11 July 2017), was an Italian organist, harpsichordist, musicologist and composer. He was born in Bologna. He has conducted studies in music classes organ, piano and composition with Riccardo Nielsen to Conservatory of Bologna and Paris Conservatory (in the class of Marcel Dupré). ==Career== Tagliavini made numerous recordings received several awards including the \"Prize of the Italian discography\", the \"Schallplattenpreis Phono-Akademie der Deutschen,\" the distinction \"Choc de la musique\" for the CD made with Liuwe Tamminga organs of San Petronio and dedicated to Andrea Gabrieli and Giovanni Gabrieli, the \"Premio Antonio Vivaldi\" and the \"Premio Massimo Mila\". ==Death== Tagliavini died on 11 July 2017 in Bologna of respiratory arrest at the age of 87.Bologna piange Luigi Ferdinando Tagliavini, maestro di musica e di cultura ==Discography== * 1991 – Andrea and Giovanni Gabrieli, Gli organi della Basilica di San Petronio, with Liuwe Tamminga (Tactus) * 1991 – Maestri Padani e Fiamminghi. Gli organi storici della Basilica di San Petronio in Bologna, with Liuwe Tamminga (Tactus) * 1993 – Giuseppe Gherardeschi, Messa per organo, with the Corale S. Michele Arcangelo di Corsanico (Fonè) * 1996 – Luigi Ferdinando Tagliavini and his collection of harpsichords (Ermitage) * 2004 – L'organo Gaetano Callido (La Bottega Discantica) ==More reading== *Studi sui testi della cantate sacre di J. S. Bach, Padova-Kassel 1956 *La situazione degli antichi organi in Italia: problemi di censimento e di tutela, in collaborazione con Oscar Mischiati (in \"L'organo\" 1969) *Note introduttive alla storia del temperamento in Italia (in \"L'organo\" 1980) *J.S.Bach Musik in Italien im 18. und 19. Jahrhundert (in AA.VV., Bachiana et alia musicologica: Festschrift A. Dürr, Kassel, 1983) *Luigi Ferdinando Tagliavini in \"Dizionario Enciclopedico Universale della Musica e dei Musicisti\", Torino 1988 *E. Darbellay, Luigi Ferdinando Tagliavini in \"The New Grove's Dictionary of Music and Musicians\", Londra 1980 ==References== ==Other websites== *biografia dettagliata e bibliografia di Luigi Ferdinando Tagliavini Category:1929 births Category:2017 deaths Category:Deaths from respiratory arrest Category:Disease-related deaths in Italy Category:20th-century Italian composers Category:Italian organists Category:Italian harpsichordists Category:Musicologists Category:People from Bologna Category:21st-century Italian composers",
 "title": "Luigi Ferdinando Tagliavini"
}