{
 "id": "591436",
 "text": "Thapa (; IAST:Thāpā) is a surname belonging to Chettri caste and Magar Caste of Nepal. They are indigenous people of Nepal. Thapa is one of the clans of the Rajput Caste. Thapa is higher Clan of Magar community group in Nepal. Thapa was a title given to warriors in the ancient kingdom. Thapa has done remarkably significant contribution for the unification of Nepal. Thapas has been involved in politics of Nepal for long time. Thapas were prominent military heads in various princely states in ancient Nepal. Thapas led military and civil administration in the unified Kingdom of Nepal after 1806 AD. Bhimsen Thapa of Thapa clan rose to prominence after the assassination of King Rana Bahadur Shah of Nepal by King's step-brother in 1805 AD. After the event, an investigation was run by Bharadars (Ministers) which caused massacre of 55 senior officers at Bhandarkhal garden by Thapa Kaji (ministers) group making them as most dominant faction in Nepalese politics. the After Bhimsen rose to power, member of another Thapa family, Bada (senior) Kaji Amar Singh Thapa and his family were added to make Thapa Khalak dynasty stronger. Large number of Thapa leaders took part in Anglo-Nepalese War in 1814-16 AD. The immediate family of Bhimsen and Senior Kaji Amar Singh took over all military commands in that war. Another unrelated warrior Bhakti Thapa also led the war at Deuthal aged 71 and died too. Thapas were out of power after the rise of Rana dynasty who were blood relatives of Thapas. Later Panchayat government of Nepal that began in 1961 AD saw large number of Thapas in the cabinet. ==Khas Chhetri Thapa== Khas Thapa or Chhetri/Kshatri Thapa are Khas people of Indo- Aryan group. They are categorized into Kshatriya in Hinduism. They follow Hinduism and are divided by Khas clans and Hindu Gotra system. The clan names of Khas Chhetri Thapas are: Bagale Thapa, Punwar Thapa, Godar Thapa, Lamichhane Thapa, Suyal Thapa, Kalikote Thapa, Hrikshen Thapa, Khulal Thapa, Deoja Thapa, Thakuryal Thapa, Gamle Thapa, Sonal Thapa, and many others. ===Bagale Thapa=== Bagale Thapa is the most prominent clan within Khas Thapa. They fall under Atreya Gotra in Hinduism. ===Puwar Thapa=== Puwar Thapa is also a clan within Khas Thapa. They fall under Kapil Gotra in Hinduism. ===Godar Thapa=== Godar Thapa is a clan within Chhetri Thapa Kaji of Khas origin. They claim Kashyap Gotra in the Gotra system of Hinduism. They are also the variant of Shivbanshi Godara clan from India. ==Magar Thapa== Magar Thapa or Thapa Magar are member of Magar caste which falls under Sino-Tibetan or Tibeto-Burman group. They speak Magar language and follow tradition of Magar caste. They can be found as core soldiers in Gurkha armies around the world. They also served as one of the six noble clans in the thargah of King prithvi Narayan Shah and were prominent nobles until the kot massacre. ==References== ===Books=== * * Category:Surnames",
 "title": "Thapa"
}