{
 "id": "591568",
 "text": "Lóránd Hegyi, was born on April 19, 1954 in Budapest, Hungary is an art historian, curator and writer. == Education == Lorand Hegyi studied History, Art History and Aesthetics and received his PhD from Eötvös Loránd University (ELTE) in Budapest. He worked as researcher at the Institute of Art History in the 1980s and taught at ELTE University in Budapest as well as at Karl- Franzens-Universität in Graz. He dedicated himself to curating contemporary art exhibitions in Hungary, Austria and Germany while writing art historical and theoretical texts about Modernism and Post-Modernism. == Career in the Public Institutions == 1977-1999 Researcher at the Institute of Art History of the Hungarian Academy of Sciences, Budapest 1990-2001 Director of the Ludwig Museum (Museum Moderner Kunst Stiftung Ludwig) in Vienna, Austria 2002-2006 Art Director of the PAN, (Palazzo Arte Napoli - Centre Of Contemporary Art Naples), Italy 2003-2016 Director of the Museum of Modern and Contemporary Art of Saint-Etienne (Musée d’Art Moderne et Contemporain de Saint-Etienne), France From 2017 Art Director of the Parkview Museum Beijing/Singapore, China/Singapore == Life and Work == Shortly after the fall of the Berlin Wall, he was invited to Austria, where from 1990 to 2001 he was director of the Museum of Modern Art Foundation Ludwig Vienna, where he developed one of the largest and most complex collections of Contemporary art of the countries of Eastern Europe and Central Europe, to which he dedicates two great exhibitions: Reduktivismus - Abstraktion in Polen, Tschechoslowakei, Ungarn (Vienna, 1992), Aspects, positions: Fifty years of art in Central Europe (Vienna, Barcelona, Southampton 1999). In 1995, he was art director of the Triennial of Sculpture Fellbach, Germany where he presented the show Europe – Asia, with forty artists from Asian countries. In 1999, he curated the exhibition 50 Years of Art in Central Europe 1949-1999 (Vienna, Budapest, Southampton) and the show La Casa, il Corpo, il Cuore – Construction of Identities (Vienna, Prague). In 2001, he opened the new contemporary art museum MUMOK, Vienna. 1996 Enver Hadžiomerspahić invited Lorand Hegyi to work at the project Ars Aevi , which was founded in 1992 during wartime. Through donations a great collection of contemporary art was created in Sarajevo. Lorand Hegyi organised about 200 donations from international artists for the collection, which he presented in Vienna and Sarajevo. Furthermore he curated several exhibitions in Sarajevo. From 2003 to 2016 he was director of the Museum of Modern and Contemporary Art of Saint-Etienne. He emphasized in his exhibition and acquisition program a new global regard on contemporary art which included art from Central and East Europe as well, as contemporary art from Asia. He developed the collection of the tendencies of the 70’s and 80’s both from USA and Global Europe as well, as the new tendencies in Asian contemporary art. He created the exhibition series of contemporary drawing “Cabinet de Dessin” and a series of thematic exhibitions focusing on an anthropological vision of art like “Domicile – Private/Public” and “Fragile”. Lorand Hegyi systematically presented a lot of great contemporary masters like Jannis Kounellis, Michelangelo Pistoletto, Giovanni Anselmo, Günther Uecker, Dennis Oppenheim, Richard Nonas, Joel Shapiro, Roman Opalka, Orlan, Bertrand Lavier, Gilbert & George, Anne et Patrick Poirier, Georg Baselitz, Tony Cragg, Peter Halley, Anish Kapoor, etc.. In 2016 he curated the exhibitions “Intriguing Uncertainties - Contemporary Drawing” in Saint-Etienne, the “Challenging Beauty – Italian Art after the 60s” in Beijing and the “Disturbing Narratives” in Singapore. In 2017, he was nominated to Art Director of The Parkview Museum Beijing/Singapore where he created an important collection of contemporary Italian art. In 2017, he curated the first show of the \"BRIDGING ASIA/EUROPE\" exhibition series in The Parkview Museum Bejing, which presents artists from Asia and Europe in a form of dialogue. In 2017 he curated the exhibition \"Anish Kapoor – My Red Homeland\" in Saint-Etienne and the show “The Artist’s Voice” in Singapore. == Selected Exhibitions == * Eclectic - New Tendencies in Contemporary Hungarian Art (Hungarian National Gallery, 1986) * Reductivism - Abstraction in Central Europe (Ludwig Museum, Vienna, 1992) ISBN 3900776334 / 9783900776336 * La coesistenza dell’arte - Un modello espositivo (La Biennale di Venezia, 1993) * The Austrian Vision - Three Generations of Austrian Artists (Fundacion “La Caixa”, Madrid, 1994) * Abstract / Real: Reference Malevich, Duchamp, Beuys (Ludwig Museum, Vienna, 1996) * Hermann Nitsch: Orgien-Mystherien-Theater (Palazzo dell’Esposizioni, Roma, 1996) * Sensitivities - Contemporary Art from Central Europe (European Academy for the Arts, London, 1998) * La Casa, il Corpo, il Cuore: Construction of identities (Ludwig Museum, Vienna / Narodni Galeria, Prague, 1999) ISBN 9783900776817 * Aspects / Positions: 50 Years of Art in Central Europe 1949-1999 (Ludwig Museum, Vienna / Fundacio Miro, Barcelona, 1999) ISBN 9783900776848 * L’autre moitié de l’Europe (Jeu de Paume, Paris, 2000) * CONCEPTS OF SPACE (Fundacio Miro, Barcelona, 2002) ISBN 9788493215927 / 8493215929 * Solares (or On Optimism) (Biennale of Valencia, 2003) ISBN 8448235487 ISBN 9788448235482 * Gilbert & George: Twenty London East One Pictures (Musée d’Art Moderne de Saint-Etienne / Kestnergesellschaft Hannover, 2004) ISBN 2-910055-21-3 * Passage d’Europe - Réalités, Références (Musée d’Art Moderne de Saint-Etienne, 2004) ISBN 8874391595 ISBN 978-8874391592 * Domicile - Private & Public (Musée d’Art Moderne de Saint- Etienne, 2005) ISBN 2-85056-897-X * The Giving Person (Palazzo delle Arti Napoli, 2005) ISBN 9788851003258 * Dennis Oppenheim (Fondazione Volume, Roma, 2005) ISBN 9788836620449 * Lee Ufan (Musée d’Art Moderne de Saint-Etienne, 2006) ISBN 9782916277028 * Roman Opalka: Octogon (Musée d’Art Moderne de Saint-Etienne, 2006) * Something Happened - Aspects of New Narratives (Slovenska Narodna Galeria, Bratislava, 2006) * ZERO: Avant-garde International 1950-1960 (Musée d’Art Moderne de Saint-Etienne / Kunstpalast Dusseldorf, 2006) * Zeng Fanzhi (Musée d’Art Moderne de Saint-Etienne, 2006) * Micro-Narratives (Octobersalon, Belgrade Cultural Centre, 2007) * Sean Scully: Une rétrospective (Musée d’Art Moderne de Saint-Etienne, 2007) * Voyage Sentimental (Poznan Biennale, 2008) * Antony Gormley: Between You and Me (Musée d’Art Moderne de Saint-Etienne, 2009) * Essential Experiences (Palazzo Riso, Palermo 2009) ISBN 9788837073909 * Fragile - Fields of Empathy (Musée d’Art Moderne de Saint-Etienne / Daejeon Museum of Art, 2007) * The Bearable Lightness of Being (Mostra Internazionale di Architettura, La Biennale di Venezia, 2010) * Never Found Islands (Palazzo Ducale, Genova / National Museum of Contemporary Art, Thessaloniki, 2010) * Dennis Oppenheim (Musée d’Art Moderne de Saint-Etienne, 2011) ISBN 9788836620449 * Chung Sang-Hwa: Painting Archeology (Musée d’Art Moderne de Saint-Etienne, 2011) ISBN 9788995635285 * Enrico Castellani - Günther Uecker (Ca’Pesaro, Venezia, 2012) ISBN 9788836626960 * Speaking Artists (Busan Art Museum, 2012) * Jan Fabre: Les années de l’Heure Bleue (Musée d’Art Moderne de Saint-Etienne, 2012) * Peter Halley: Since 2000 (Musée d’Art Moderne de Saint-Etienne, 2014) * Jannis Kounellis (Musée d’Art Moderne de Saint-Etienne, 2014) ISBN 9788836629466 * Jonathan Lasker (Musée d’Art Moderne de Saint-Etienne, 2015) ISBN 9782849753675 * Giovanni Anselmo (Musée d’Art Moderne de Saint-Etienne, 2015) * Intriguing Uncertainty (Musée d’Art Moderne de Saint-Etienne, 2016) * Anne et Patrick Poirier: Danger Zones (Musée d’Art Moderne de Saint-Etienne, 2016) * The Artists’s Voice (Parkview Museum, Singapore, 2017) * Anish Kapoor: My Red Homeland (Musée d’Art Moderne de Saint-Etienne, 2017) * Disturbing Narratives (Parkview Museum, Singapore, 2018) * Dentro il Disegno / Inside the Drawing (Disegno Saluzzo, La Castiglia, Saluzzo, 2019) == Member of Committees == Lóránd Hegyi has been a member of numerous important international institutional art investment and investment fund committees, including: the European Investment Bank (EIB) in Luxembourg, a member of the international acquisition committee of the bank UniCredit, the Committee of the Salzburg Foundation in Austria, the National Committee of the French Government for Art in France, and the Committee of the bank Société Générale in France. Lorand Hegyi also co-curated the Biennale de Venice in Italy 1993, Toyama Biennale in Japan 1993, Stuttgart Sculpture Triennale in Germany 1995, Biennale of Valencia in 2003, Poznan Biennale in Poland in 2008. == Selected publications / books == * New Sensibility : Change of Paradigm in Contemporary Art, Magvető Könyvkiadó, Budapest (1983) ISBN 9631400670 * Avantgarde and Trans-Avantgarde : Periods of Modern Art, Magvető Könyvkiadó, Budapest (1986) ISBN 9631408752 * Selections from the Second Wave of the Hungarian Avant-Garde 1930-1960. New York, NY: Paul Kovesdy Gallery (1988) * Alexandria - Essays on Contemporary Art, Jelenkor Kiadó / Pécs (1995) ISBN 963-676-026-8 * Experience and Fiction - Modernism, Avantgarde, Trans-Avantgarde, Jelenkor Irodalmi / Művészeti Kiadó (1991) ISBN 9637770178 * Diversities, Edizione Charta, Milano (2004) ISBN 9788881584895 * The Courage to be Alone - Re-inventing of Narratives in Contemporary Art, Edizione Charta, Milano (2004) * Fragilité de la narration, SKIRA/Flammarion Milano/Paris (2008 / 2009) ISBN 9788857203768 * Arte in Centro Europa, Silvana Editoriale, Milano (2011) ISBN 8836617158 * Contemporary Art on Show, Silvana Editoriale, Milano (2012) ISBN 8836623840 * Roman Opalka’s Essentiality, Editore Aragno, Torino (2015) * Significante Incertezza, Hapax Editore, Torino (2016) * Painters of Uncertainty - Remarks on Narrative in Contemporary Painting, Silvana Editoriale, Milano (2017) * Narratives in Contemporary Art, Silvana Editoriale, Milano (2018) ISBN 9788836642472 * Tre Maestri: Roman Opalka, Ilya Kabakov, Jannis Kounellis - Interrogazione sul tempo, Mondadori Electa, Milano (2019) ISBN 9788891827289 *Drawing in the Age of Uncertainty, Silvana Editoriale, Milano (2021) ISBN 9788836647460 == Awards == * Chevalier de la Légion d’honneur, France (2009) * Chevalier de l’ordre des Arts et des Lettres, France (1999) * Cavaliere della Repubblica Italiana per Meriti Culturali, Italy (2000) * Gran Cruz de la Orden del Merito Civil, Spain (2000) * Grosser Ehrenkreutz Der Republik Osterreich , Austria (2016) * Honorary degree honoris causa (2006) ==Other websites== https://annoeuropeo2018.beniculturali.it/wp- content/uploads/2018/09/Espressionismo-tedesco_presentazione.pdf https://admin.depo.ba/clanak/81864/evropski-kustos-i-historicar-umjetnosti- lorand-hegyi-u-art-depou https://www.centrepompidou.fr/cpv/ressource.action?param.id=FR_R-54e9dad8cd70f05219ac8e66dce3f&param.idSource;=FR_P-54e9dad8cd70f05219ac8e66dce3f http://dspace.unive.it/bitstream/handle/10579/8929/827921-1189130.pdf?sequence=2 https://www.chinadaily.com.cn/a/201804/17/WS5ad53ceca3105cdcf6518a25_1.html https://slought.org/media/files/blood_orgies.pdf https://www.artpool.hu/Al/al03/Hegyi.html http://www.arteecritica.it/onsite/roman-opalka-eng.html http://www.michellunardelli.com/search/hegyi/ == Playlist == * \"Introduction to the exhibition,\" with Lorand Hegyi (November 4, 2005) Audio, 20 minutes. download * \"Museum Politics in France and the New European Art Scene,\" with Lorand Hegyi (February 17, 2005) Audio, 84 minutes. Category:Art critics Category:Art historians Category:Living people Category:1954 births",
 "title": "Lóránd Hegyi"
}