{
 "id": "591807",
 "text": "The 2017 Indian presidential election was held in India on 17 July 2017, and counting was done on 20 July 2017, five days before the incumbent President's term expires. The incumbent is eligible for re-election, as no term limits exist in India. Initially receiving speculation for a re-election bid, Pranab Mukherjee decided not to run again in 2017 due to health concerns and problems relating to his age.Presidential Election 2017: Pranab Mukherjee retires in July, this is how India elects its presidentPresidential Election 2017: Not in race for another term, says Pranab Mukherjee Kovind secured roughly two-thirds of the votes from the electoral college of elected members of federal, state and union territory legislatures and was elected to a five-year term as President. Kovind's term of office will begin on 25 July 2017. ==Candidates== * Ram Nath Kovind, the Governor of Bihar, was announced as the Bharatiya Janata Party (BJP)-led NDA's candidate for the post of President of India by BJP president Amit Shah on 19 June 2017. Kovind is a leader and a politician from the BJP. Kovind filed his nomination for the election on 23 June 2017.Ram Nath Kovind files nomination * Meira Kumar, the former Speaker of Lok Sabha, was announced as the Indian National Congress (INC)-lead opposition's candidate for the post of President of India, after a meeting held on the 22 June 2017. File:Ram Nath Kovind official portrait.jpg| File:Meira Kumar.jpg| ==General polling== Poll source Sample size Date(s) Margin of Error Ram Nath Kovind Meira Kumar Business Insider-Ipsos 119,132 17–18 July 2017 N/A 71% 29% ==Results== The president is elected by an electoral college consisting of the elected members of both houses of parliament, the elected members of the Legislative assemblies of the 29 states and the elected members of the legislative assemblies of the Union Territories of Delhi and Puducherry. Results will be declared on 20 July 2017. According to polling after voting was closed on 17 July 2017, Ram Nath Kovind was expected to win the presidency with a voting outcome of 99%. Kovind was declared as the winner after the counting of votes held on 20 July 2017. He will be administered oath by the Chief Justice of India Jagdish Singh Khehar, as The 14th President of India on 25th July, 2017 at The Central Hall located in The Parliament House, New Delhi. Results of the 2017 Indian presidential election Candidate Individual votes Electoral College votes % Ram Nath Kovind 2,930 702,044 65.65 Meira Kumar 1,844 367,314 34.35 Total 4,774 1,069,358 100 Invalid 77 20,942 ==References== ==Other websites== * Bihar governor Ram Nath Kovind is NDA's Presidential nominee: Amit Shah Category:2017 in India Category:2017 elections in Asia Category:July 2017 events Category:Presidential elections in India",
 "title": "2017 Indian presidential election"
}