{
 "id": "592031",
 "text": "A driver less car (also called autonomous car or self-driving car or self- driving vehicle, i.e. self-operating) is a vehicle that can perform certain tasks on its own, without the help of a human driver. The car uses sensors to analyze its environment, and doesn't need a human's help for certain tasks. These tasks commonly include parking the car, driving while keeping the same lane on a highway or driving at a predefined speed. In public places, certain buses have been programmed to travel a given route. As of 2021, self-driving cars have been used in controlled environments more and more. An example of this might be buses that transfer passengers between airport terminals. == Technology == Typical technology used by a self-driving vehicle include Radar, lidar, digital cameras, machine learning, GPS and IMU. Cameras help the self- driving car detect objects to ensure safe navigation and enhance visibility to reduce accidents. Tesla, one of the self-driving cars has eight cameras around the car.Tesla. (Nov 18, 2016). Advanced Sensor Coverage. https://www.tesla.com/autopilot Three cameras provide a 120-degree field of view and are located in front behind the windshield. Two forward-looking side cameras and two rearward looking side cameras are on both sides of the car. One rear view camera at the back of the car. These cameras see changes in traffic signals, detect vehicles merging from adjacent lanes, and provide a wide range view. LiDAR uses light waves to determine the distance from the car to other objects. It measures the time it takes for light to reflect off obstacles and return to the car.Cadence System Analysis. (n.d.). The Use of RADAR Technology in Autonomous Vehicles. Cadence. Radar uses radio waves to detect the objects. Radar can measure the distance between car and objects and the speed of other moving objects.Foresight. (Oct 27, 2022) Cameras, Radar, and Lidar: Which is the Right Choice for Autonomous Vehicles?. https://www.foresightauto.com/cameras-radar-and-lidar-which-is-the-right- choice-for-autonomous-vehicles/ LiDAR and Radar allow cars to understand more accurate surroundings. Radar and LiDAR technologies offer precise positional data, while camera excels at identifying objects. Combining these technologies significantly enhances the safety of self-driving cars, reducing the risk of accidents. Machine learning technologies such as deep learning and reinforcement learning enable vehicles to recognize objects more accurately. For example, Tesla utilizes deep learning to train its vehicles in identifying various objects on the road, including pedestrians, lanes, and other vehicles.Tech&Tales.; (Aug 28. 2023). How Tesla’s Self-Driving Cars Navigate the Road with Machine Learning. Medium. https://techntales.medium.com/how- teslas-self-driving-cars-navigate-the-road-with-machine-learning-b6f67052b8ba This technology allows Tesla cars to continually improve their ability to navigate and respond to their surroundings, enhancing overall safety and performance. Reinforcement learning is utilized to help vehicles learn effective strategies for avoiding obstacles and other vehicles. Through repeated learning iterations, vehicles experience trial and error to learn how to navigate without errors.Tech&Tales.; (Aug 28. 2023). How Tesla’s Self- Driving Cars Navigate the Road with Machine Learning. Medium. https://techntales.medium.com/how-teslas-self-driving-cars-navigate-the-road- with-machine-learning-b6f67052b8ba High-definition maps can be used to accurately locate a self-driving vehicle in a place, and to give information about parts of a road not seen by the car. == Ethical issues == Even though it is technically possible to build cars that do certain things on their own, the question whether it should be done is different. Ethical questions include: * Is a machine able to judge a situation correctly? – Can it make a difference between a stroller with a child, and a stroller with a doll? * Is it acceptable to judge a situation by the expected death toll? (This has been formalized as the trolley problem.) * If it is acceptable to judge such a situation by the expected death toll, what are meaningful criteria? – should the age of those killed be taken into account? == Legal issues == Even though these vehicles can already do a lot on their own, the laws of most countries still require that a driver is present. In many cases, self-driving buses also need a special permit from the government. If a motor vehicle produces an accident, there always is the question of who is responsible, to determine what damages need to be paid. This also applies to self-driving vehicles: A self-driving vehicle is like a robot: Software is used for the driving. This software relies on a number of sensors to take decisions. Determining what went wrong in the case of an accident can be very difficult. This includes the question of who is legally responsible. == References == Category:Automobiles Category:Automotive technologies Category:Robots",
 "title": "Self-driving car"
}