{
 "id": "592299",
 "text": "Wang Fēifēi (hangul: 왕페이페이; hanja: 王 霏霏; born April 27, 1987 in Haikou) better known by her stage name Fei, is a Chinese singer, actress and TV presenter. She debuted as a member of miss A in 2010 under the company JYP Entertainment. In 2016, she made his debut as a solo artist with his CD single titled Fantasy. == Biography == Fei was born on April 27, 1987 in Haikou, Hainan, China. He currently resides in Seoul, South Korea. She currently holds a scholarship at the Seoul Art Institute, Seoul Art College, along with former Miss A member Jia.After School's Nana, Jia & Fei receive scholarships from Seoul Art College, \"Allkpop\", April 16, 2012. In China before making his debut he studied at Nana School. In China, Fei appeared on a Zhejiang television show, an audition program titled The Prettier She Is.Amateur Scared to Miss This \"Newcomer Want to Get 2010, \"AFP\", August 15, 2010. She was a member of the Chinese version of Wonder Girls, JYP Sisters directed for girls talents, nevertheless happened to be part after three years of training, to the female group of South Korea, miss A. In 2010, also was model for commercials for Samsung Anycall in China. == Career == === miss A === Fei debuted as a member and leader of miss A in July 2010. === Solo activities === Aside from her activities with the group, she has also participated in several television variety shows such as Variety Blue Chip in 2013. She gained popularity after showing off her different skills as cooking and dancing in the show. Fei made her acting debut in a short appearance on KBS's Dream High in 2011 and 2012. In 2013, she became a candidate in Dancing with the Stars 3 with her dance partner Kim Soo-ro, who won first place and consolidated her name as a great dancer in K-pop. In March 2014, Fei participated in the Chinese variety show If You Love, a dating program where she was paired with Chinese actor Sun Jian. In the same year, she made an appearance on SBS's drama Temptation as Jenny. She later sing the drama soundtrack with 2AM's Jo Kwon entitled \"One Summer Night,\" both published in Korean and English. In 2015, it was confirmed that she would participate in the drama Swan, with Nam Kyu-ri and Cho Min- sung. She was also confirmed as the protagonist of the Chinese movie Select Game. On July 21, 2016, Fei made her debut as a solo artist with her CD single titled Fantasy. == Discography == === CD single === Title Album details Peak chart positions Sales KOR Fantasy * Released: July 21, 2016 * Label: JYP Entertainment * Format: digital download - - === Singles === Title Year Peak chart positions Sales Album KOR * US World * \"Always Be Here\" 2014 — — \"Fantasy\" 2016 154 6 *KOR (DL): 12,260+ Fantasy \"—\" denotes releases that did not chart or were not released in that region. === Soundtrack appearance === Title Year Peak chart positions Album KOR \"One Summer Night\" (feat. Jo Kwon) 2014 49 Temptation OST \"—\" denotes releases that did not chart or were not released in that region. === Other charted songs === Title Year Peak chart positions Album CHN Billboard V Chart * \"One More Kiss\" 2016 11 Fantasy \"—\" denotes releases that did not chart or were not released in that region. == Filmography == ===Films=== Year Title Role Notes 2016 Select Game TBA Lead role === Drama === Year Network Title Role Notes 2011 KBS2 Dream High Flashmob dancer Cameo (Episode 16) 2012 KBS2 Dream High 2 Herself Cameo (Episode 15) 2014 SBS Temptation Jenny Cameo (Episode 1) 2017 Draemong Swan Woo Jeu Web drama; Supporting role === Variety shows === Year Network Title Notes As a Judge or MC 2013 O'live O'live Show MC HBS Amazing Dance Host As a Contestant 2013 O'live MasterChef Korea: Celebrity Contestant MBC Dancing with the Stars 3 Contestant 2014 CCTV The Great Magician Contestant ===Radio shows=== Year Network Title Role Notes 2013–2015 MBC C-Radio Idols, True Colors Host with Jia & Super Junior-M's Zhou Mi === Event hosting === Year Event Notes 2015 29th Golden Disk Awards With Kim Sung joo and Kim Jong-kook ===Music video appearances=== Year Title Artist 2009 My Color 2PM 2010 This Christmas JYP Nation 2011 I Love You Huh Gong & Hoony Hoon == Awards and nominations == Year Award Category Nominated work Result 2013 Dancing with the Stars 3 1st Place Master Chef Korea Celebrity 2nd Place 2014 Cook King Korea 2nd Place 2015 9th SBS Entertainment Awards Best Teamwork Award Fists of Shaolin Temple 2016 China Trends Health Awards Health Leading Award == References == Category:1987 births Category:Living people Category:Chinese singers",
 "title": "Fei"
}