{
 "id": "592302",
 "text": "Lotus is the seventh studio album by American singer Christina Aguilera. RCA Records released the album on November 9, 2012. It was her first album after her ending her marriage with Jordan Bratman. The album features a mix of pop, dance, and rock, with both fast songs and slower piano songs. Aguilera called it a “rebirth” about her personal life, her time on The Voice, and her divorce. She recorded most of the album at home and worked with producers like Alex da Kid, Max Martin, Lucas Secon, and Tracklacers. Lotus received mixed reviews from critics, who felt the lyrics and music were simple. It started at number seven on the US Billboard 200, selling 73,408 copies in its first week. The album performed better in countries like Canada, Russia, Switzerland, and Venezuela, where it reached the top 10. Two singles were released in North America: “Your Body,” which made the top 40 in several countries, and “Just a Fool,” a song with The Voice coach Blake Shelton, which went to number 71 on the Billboard Hot 100. In August 2013, Aguilera released “Let There Be Love” as a single, along with a music video and a letter to her fans. The song reached number one on the US Dance Club Songs chart. ==Track listing== Credits adapted from the liner notes of Lotus. ;Notes * signifies a vocal producer * signifies a co-producer ;Sampling credits * \"Red Hot Kinda Love\" contains samples from \"The Whole World Ain't Nothing But a Party\", as performed by Mark Radice and \"54-46 Was My Number\", as performed by Toots and the Maytals. * \"Make the World Move\" contains a portion of the composition \"Let's Find Out\", written by Armando Trovajoli. ==Personnel== Credits are adapted from the album's liner notes. * Christina Aguilera - vocals, backing vocals, executive producer * Candice Pillay - backing vocals * Max Martin - backing vocals, keyboards, producer * Aimée Proal - backing vocals * Shellback - backing vocals, keyboards, producer, programming, engineer * Alex da Kid - producer * Chris Braide - producer * Busbee - producer * Mike Del Rio - producer * Jayson DeZuzio - producer * Dem Jointz - producer * Jason Gilbert - producer * Jamie Hartman - producer, string arrangements * Aeon \"Step\" Manahan - producer, programming * Steve Robson - keyboards, producer, string arrangements, programming * Lucas Secon - producer * Supa Dups - producer * Tracklacers - producer * Claude Kelly - vocals producer * Candice Pillay - vocals producer * Chris Braide - - keyboards, string arrangements, programming * Steve Daly - keyboards, bass, synthesizers * Jon Keep - keyboards, synthesizers * Alisha Bauer - strings * Marisa Kuney - strings * Songa Lee - strings * Rodney Wirtz - strings * Pete Whitfield - string arrangements * Steve Daly - bass * John Garrison - bass * Lucas Secon - programming * John Hanes - engineer * Pete Hofmann - engineer * Sam Holland - engineer, vocal engineer * Josh Mosser - engineer * Sam Miller - engineer * Oscar Ramirez - engineer, vocal engineer * Lucas Secon - engineer * Justin Stanley - engineer * Scott Hendricks - vocal engineer * Graham Marsh - vocal engineer * Phil Seaford - assistant engineer * Christina Aguilera - A&R; * Keith Naftaly - A&R; * Enrique Badulescu - photography ==Charts== === Weekly charts === Chart (2012–13) Peak position Australian Albums Chart 19 Austrian Albums Chart 13 Belgian Albums Chart (Flanders) 26 Belgian Albums Chart (Wallonia) 42 Canadian Albums Chart 7 Czech Albums Chart 16 Danish Albums Chart 23 Dutch Albums Chart 12 French Albums Chart 50 German Albums Chart 13 Greek Albums Chart 14 Hungarian Albums Chart 17 Irish Albums Chart 29 Italian Albums Chart 12 Japanese Albums Chart 29 Mexican Albums Chart 19 New Zealand Albums Chart 29 Norwegian Albums Chart 25 Portuguese Albums Chart 23 Russian Albums Chart 6 Scottish Albums Chart 33 South Korean Albums Chart 20 Spanish Albums Chart 13 Swedish Albums Chart 39 Swiss Albums Chart 10 Taiwan International Albums Chart 1 Taiwan Albums Chart 14 UK Albums Chart 28 US Billboard 200 7 === Year-end charts === Chart (2013) Position US Billboard 200 117 == Certifications and sales == ==Release history== Region Date Format(s) Edition(s) Label Austria November 9, 2012 Sony Music Germany Switzerland Taiwan Deluxe United Kingdom November 12, 2012 RCA Records Brazil November 13, 2012 Sony Music United States RCA Records United Kingdom Standard Sweden November 14, 2012 Deluxe Sony Music Japan Mexico November 15, 2012 Australia November 16, 2012 New Zealand ==References== ==Other websites== * Lotus on Metacritic Category:2012 albums Category:Christina Aguilera albums Category:Electropop albums Category:Disco albums Category:R&B; albums",
 "title": "Lotus (album)"
}