{
 "id": "592422",
 "text": "Aquaman is a 2018 American superhero movie based on the DC Comics character of the same name. Distributed by Warner Bros. Pictures, it is the sixth movie in the DC Extended Universe (DCEU). The movie was directed by James Wan, from a screenplay by David Leslie Johnson-McGoldrick and Will Beall and stars Jason Momoa as Aquaman, with Amber Heard, Willem Dafoe, Patrick Wilson, Dolph Lundgren, Yahya Abdul-Mateen II, and Nicole Kidman in supporting roles. In the movie, Aquaman sets out to lead the underwater kingdom of Atlantis, replacing his half-brother, King Orm, who seeks to unite the seven underwater kingdoms against the surface world. ==Cast== * Jason Momoa as Arthur Curry / Aquaman: :The king of the undersea nation of Atlantis, with the ability to manipulate the tides of the ocean, communicate with other aquatic life, swim at supersonic speeds, and possesses superhuman strength. Otis Dhanji portrays a young Arthur Curry. * Amber Heard as Mera: :The queen of the undersea nation of Atlantis and Arthur's love interest. Mera possesses hydrokinetic and telepathic powers that allow her to control her aquatic environment and communicate with other Atlanteans. * Willem Dafoe as Nuidis Vulko: Atlantis' chief scientific advisor. * Patrick Wilson as Orm Marius / Ocean Master: :Aquaman's corrupted half-brother, who seeks to take the throne. Wilson previously had a voice cameo as the President of the United States in Batman v Superman: Dawn of Justice. * Yahya Abdul-Mateen II as David Hyde / Black Manta: A ruthless treasure hunter and mercenary, who is Aquaman's archenemy. * Temuera Morrison as Thomas Curry: Arthur Curry's father. * Dolph Lundgren as Nereus: The king of the undersea nation of Xebel. * Nicole Kidman as Atlanna: Arthur Curry's mother, and former queen of Atlantis. * Ludi Lin as Murk: The leader of the Men-of-War, the frontline army of Atlantis. * Djimon Hounsou as the Fisherman King * Michael Beach as Jesse Kane: Black Manta's father. * Randall Park as Dr. Stephen Shin: A marine biologist who was friends with Arthur's father. Graham McTavish has been cast in the movie, though his role is currently unknown. ==Background== Principal photography began in May 2017 on the Gold Coast, Australia. ==Sequel== A sequel is in development. Much of the first film's cast, including Mamoa, Heard, and Wilson, will reprise their roles. ==References== ==Other websites== * * * * Category:2018 movies Category:DC Extended Universe movies Category:Movies set underwater Category:Warner Bros. movies Category:2010s superhero movies Category:Movies set in deserts Category:Movies set in 2018 Category:American superhero movies",
 "title": "Aquaman (movie)"
}