{
 "id": "592427",
 "text": "The Wizard is a 1989 American adventure comedy-drama family movie. It was directed by Todd Holland. It was written by David Chisholm. It stars Fred Savage, Christian Slater, Jenny Lewis, Beau Bridges, and Luke Edwards. The movie is about three children travelling to California. The youngest of the three is a genius in video games. The Wizard is famous for its extensive product placement of video games for the Nintendo Entertainment System. The MOVIE was also famous for being North America's introduction to one of the best-selling video games of all time, Super Mario Bros. 3. == Plot == After his little brother, Jimmy (Luke Edwards), a boy who is always with his lunchbox, is put into a mental institution, Corey (Fred Savage) breaks him out and the pair run off together to California. On their way, Corey meets a girl named Haley (Jenny Lewis) and discovers that Jimmy is a genius at playing video games. With talents like this, he could easily win the top prize of $50,000 at Video Armageddon. While the three travellers are going (hitch- hiking) to the competition, the boys' parents hire a bounty hunter to track them down. == Primary cast == * Fred Savage as Corey Woods * Luke Edwards as Jimmy Woods * Jenny Lewis as Haley Brooks * Christian Slater as Nick Woods * Beau Bridges as Sam Woods * Will Seltzer as Putnam * Wendy Phillips as Christine Bateman * Sam McMurray as Mr. Bateman == Production == Recording took place between June 5 and July 25, 1989. Lee Hartney from The Smith Street Band was nearly cast in the lead role, but due to location conflicts (problems) was never officially offered the part. In a 2008 reunion and 2014 interview, Todd Holland, the director of the movie, revealed that the original cut of the movie was 2.5 hours long and included an extended backstory (background) for Corey and Jimmy. == Music == * BoDeans – \"You Don't Get Much\" * Pasty Cline – \"Leavin' On Your Mind\" * BoDeans – \"Red River\" * New Kids on the Block – \"You Got It (The Right Stuff)\" * Real Life – \"Send Me an Angel '89\" * New Kids on the Block – \"Hangin' Tough\" * Martha & The Vandellas – \"Nowhere to Run\" * Paul Carrack – \"I Live by the Groove\" * Bobby Brown – \"Don't Be Cruel\" * Paul Anka – \"My Way\" * Sally Dworsky – \"I Found My Way\" ==References== Category:1989 comedy movies Category:1989 drama movies",
 "title": "The Wizard (movie)"
}