{
 "id": "592702",
 "text": "John Kevin \"JK\" Delaney (born April 16, 1963) is an American politician and businessman. He was the United States Representative for Maryland's 6th congressional district from 2013 to 2019. On July 28, 2017, Delaney became the first Democrat to announce he is running for President in 2020. He ended his campaign in January 2020, days before the Iowa caucus. ==Early life== Delaney was born in Wood-Ridge, New Jersey. His parents were Elaine Rowe and Jack Delaney, an electrician. He was raised in Wood-Ridge. He studied at Columbia University and Georgetown University Law Center. ==Business career== Delaney has co-founded two companies, both of which are publicly traded on the New York Stock Exchange. He has won the Ernst & Young Entrepreneur of the Year Award in 2004. In 1993, he co-founded Health Care Financial Partners, to make loans available to smaller-sized health care service providers purportedly ignored by larger banks. In 2000, Delaney co-founded CapitalSource, a commercial lender headquartered in Chevy Chase, Maryland; the company provided capital to roughly 5,000 small and mid-size businesses before his departure. Delaney retired from his business career in 2012, to pursue a career in politics. ==United States Representative (2013-2019)== Delaney decided to run for the newly redrawn 6th District against 10-term Republican incumbent Roscoe Bartlett. The district had long been a Republican stronghold. During the primary, Delaney was endorsed by former President Bill Clinton, U.S. Congresswoman Donna Edwards, Comptroller Peter Franchot, the Washington Post, and the Gazette. On April 3, 2012, Delaney won the five-candidate Democratic primary field with 54% of the vote. The next closest opponent, State Senator Robert J. Garagiola, received 29% of the vote, 25 points behind Delaney. In the November 6, 2012 general election, Delaney defeated Bartlett by 59%-38%, a 21-point margin. Delaney introduced legislation to end partisan gerrymandering. The Open Our Democracy Act would appoint independent redistricting commissions nationwide to end partisan gerrymandering, make Election Day a federal holiday and create an open top-two primary system. ==2020 presidential campaign== Delaney announced he is running for President of the United States in the 2020 presidential election in a Washington Post op-ed on July 28, 2017. Delaney ended his campaign on January 31, 2020 after falling in poll numbers and failing to qualify for the debates. ==Personal life== Delaney married April McClain in 1989. Together they have four daughters. In 2024, McClain was elected to the U.S. House of Representatives. ==References== ==Other websites== *Congressman John Delaney official U.S. House website *Campaign website * * Category:1963 births Category:Living people Category:Businesspeople from New Jersey Category:Columbia University alumni Category:Politicians from New Jersey Category:2020 United States presidential candidates Category:United States representatives from Maryland Category:Democratic Party (United States) politicians",
 "title": "John Delaney"
}