{
 "id": "592825",
 "text": "Montreux () is a municipality in Riviera-Pays-d'Enhaut in the canton of Vaud in Switzerland.Description and characteristics of Montreux It is on Lake Geneva shoreline at the foot of the Alps and has a population, , of and nearly 90,000 in the agglomeration. The Montreux Jazz Festival, annually in July since 1967. In 1990, the Wakker Prize was awarded to Montreux. == History == The earliest settlement was a Late Bronze Age village at Baugy. Montreux lies on the northeast shore of Lake Geneva at the fork in the Roman road from Italy over the Simplon Pass, where the roads to the Roman capital of Aventicum and the road into Gaul through Besançon separated. This made it an important settlement already in Roman times. In the 12th century, viticulture was introduced to the region, and the sunny slopes of the lake from Lavaux to Montreux became an important wine-growing region. The region was subject to various princes, most notably the princes of Savoy from the south side of the lake. They unified the territory which comprises the present canton of Vaud and were generally popular sovereigns. After the Burgundian Wars in the 15th century, the Swiss in Berne occupied the region without resistance, an indication of the weakness of the princes of Savoy. The Reformation made the region around Montreux and Vevey an attractive haven for Huguenots from Italy, who brought their artisanal skills and set up workshops and businesses. In 1798, Napoleon liberated the region from the Bernese. In the 19th century, the tourist industry became a major commercial outlet, with the grand hotels of Montreux attracting the rich and cultured from Europe and America. Starting in the 19th century there were three independent municipalities that shared a central authority. This county council was made up of four deputies from Le Châtelard, two from Les Planches and one from Veytaux. The church, the market hall of La Rouvenaz, the secondary school (the building was from 1872 and 1897) and the slaughter-house (1912) were all owned by the county council. Each municipality had its own taxes and a mayor. In 1962, the municipalities of Le Châtelard and Les Planches merged, while Veytaux remained independent. == Villages == Baugy, Brent, Caux, Chailly-sur-Montreux, Chamby, Chaulin, Chêne, Chernex, Clarens, Collonge, Cornaux, Crin, Fontanivent, Glion, Jor, Le Châtelard, Les Avants, Les Planches, Mont-Fleuri, Pallens, Pertit, Planchamp, Sonzier, Tavel, Territet, Vernex, Villard-sur-Chamby and Vuarennes. == Climate == The Köppen climate classification subtype for Montreux's climate is \"Cfb\" (Marine West Coast Climate/Oceanic climate). == Notable people == *Ian Anderson (born 1947), Scottish musician, frontman of Jethro Tull *Richard Bonynge, AO, CBE (born 1930), Australian conductor and pianist *David Bowie (1947–2016), British musician *Sergei Aleksandrovich Buturlin (1872–1938), Russian ornithologist *Noël Coward (1899–1973), English playwright, composer, director, actor and singer *A. J. Cronin (1896–1981), Scottish novelist *Laurent Dufaux (born 1969), Swiss cyclist *Patrick Juvet (born 1950), Swiss singer-songwriter *Oskar Kokoschka (1886–1980), Austrian writer and painter *Zelda Fitzgerald (1900–1948), wife of American author F. Scott Fitzgerald *Carl Gustaf Emil Mannerheim (1867–1951), Finnish statesman *Freddie Mercury (1946–1991), British musician, frontman of Queen *Vladimir Nabokov (1899–1977), Russian-American novelist *Claude Nobs (1939–2013), Swiss founder of Montreux Jazz Festival *Uri Rosenthal (born 1945), Dutch politician, Minister of Foreign Affairs of the Netherlands (2010-2012) *Emil Steinberger (born 1933), Swiss comedian, writer, and actor *Igor Stravinsky (1882–1971), Russian composer *Joan Sutherland, OM, AC, DBE (1926–2010), Australian opera singer *Pyotr Ilyich Tchaikovsky (1840–1893), Russian composer *Shania Twain (born 1965), Canadian singer-songwriter *Empress Elisabeth of Austria (1837–1898), Empress of Austria and Queen of Hungary *Ardeshir Zahedi (born 1928), former Iranian foreign minister and son-in-law of Shah of Iran == Gallery == ChateuChillon.jpg|Château de Chillon near Montreux. LakeGenevaMontreux.jpg|Southwest view over the Lake Geneva from Montreux. == Twin towns == Montreux is twinned with the towns of Menton, France and Wiesbaden, Germany, and with the city of Chiba in Japan. == References == == Other websites == * Official website * * * * Official website of the Montreux Jazz Festival Category:Municipalities in Riviera-Pays-d'Enhaut Category:Cities in Switzerland",
 "title": "Montreux"
}