{
 "id": "592993",
 "text": "The 2020 presidential campaign of Donald Trump was an unsuccessful reelection campaign by then President Donald Trump, who was the president of the United States from 2017 to 2021. Trump was defeated in the election by Democratic nominee Joe Biden. His presidency ended on January 20, 2021, when Biden was sworn in as the 46th president. ==Background== Trump started spending money on the 2020 race on November 24, 2016 (only sixteen days after the end of the 2016 election). On January 10, 2017, Politico reported that Trump would be keeping his campaign offices in Trump Tower open in order to lay the groundwork for a re-election campaign. On January 18, Trump revealed in an interview with The Washington Post that he had decided on Keep America Great as his 2020 campaign slogan. Trump launched his reelection campaign significantly earlier in his presidency than his predecessors did. Barack Obama, George W. Bush, Bill Clinton, George H. W. Bush and Ronald Reagan all declared their candidacies for reelection in the third year of their presidencies. Had Trump been reelected, it would have been the first time in American history that there have been four consecutive presidents who were elected to two terms. ==Rallies== The first rally paid for by the campaign was held on February 18, 2017, in Melbourne, Florida, and was attended by an estimated 9,000 supporters. The campaign's second rally was held a month later in Nashville, Tennessee on March 15, and it was the 250th birthday of Andrew Jackson. Before the rally, Trump paid tribute to Jackson and laid a wreath at his tomb. A third rally was held by the campaign in Louisville on March 20, days after Trump fired FBI Director James Comey. Trump held his fourth campaign rally with Vice President Mike Pence on April 29 in Harrisburg, Pennsylvania on the 100th day of Trump's presidency. In June, Trump began campaigning in Iowa. Iowa is considered to be a perennial swing state. Trump held his sixth campaign rally on July 25 at the Covelli Centre in Youngstown, Ohio. Trump held his seventh campaign rally at the Big Sandy Superstore Arena in Huntington, West Virginia on August 3. Trump held his eighth campaign rally on August 22 at the Phoenix Convention Center in Phoenix, Arizona. Amidst the COVID-19 pandemic, Donald Trump held a rally in Tulsa, Oklahoma. The rally was notable for a surprisingly low turnout. However, the rally managed to reach 6.7 million views online. Fox News stated that the rally was its highest Saturday primetime viewership in the network's history ==Election Day== On November 4, Trump claimed to have won the election. However, no clear winner was determined, because final results from states such as Pennsylvania, Wisconsin, Michigan and Georgia were still unknown. Trump was leading in the vote count of those states at the time, however there were many still- uncounted votes, mainly from mail-in ballots which were not yet counted. Trump attempted to use the courts to stop the vote-counting. His campaign filed lawsuits in Pennsylvania, Georgia, and Michigan. However, these lawsuits were all rejected. On November 7, news organizations ABC News, Associated Press, CBS News, CNN, Fox News, NBC News, Reuters, and the New York Times said that Trump had lost the election to Biden. Trump refused to concede upon hearing the news. The administrator of the GSA, Emily W. Murphy, did not cooperate with president-elect Biden until November 23. Many Republicans in the Senate claimed that the election was still unsettled, and Attorney General William Barr allowed the Justice Department to investigate alleged \"massive voter fraud.\" In an interview with the Associated Press published December 1, Attorney General William Barr acknowledged: \"To date, we have not seen fraud on a scale that could have affected a different outcome in the election.\" By January, Trump had lost 60 lawsuits. On January 2, 2021, during an hour-long conference call, Trump pressured Georgia Secretary of State Brad Raffensperger to change the state's vote totals by the 11,780 votes he needed to win the state. During the call, Trump falsely suggested that Raffensperger could have committed a criminal offense. On January 11, the phone call was cited in a new article of impeachment introduced in the House of Representatives. Self- declared \"alternate electors\" voted in protest; these votes had no legal validity. Well over a hundred Republican representatives promised to contest the counting ceremony at the U.S. Capitol on January 6. Experts debated whether Trump was trying to perform a self-coup. On January 6, 2021, Trump spoke at a \"March to Save America\" rally on the Ellipse. There, he encouraged the crowd to \"fight like hell\" and said he'd be marching with them to the United States Capitol, although he did not join them. The crowd arrived at the Capitol building and broke in. At the same time, the electoral colleges votes were being counted, and those in the House and Senate had to be evacuated. Five people died from the events, while dozens more were injured, and the Federal Bureau of Investigation opened over 170 investigations into the events. ==Polling== Throughout the campaign, many polls almost always showed Democratic nominee Joe Biden ahead of Trump. Trump's campaign rejected these polls, claiming how they incorrectly predicted a Hillary Clinton victory in the 2016 presidential election. Many people had also come to distrust polls; a study from the Pew Research Center showing that even when Biden led Trump by a wide margin, many people still believed that Trump would win the election. Trump's polling worsened throughout June and July, mainly in battleground states and states that mainly vote Republican. A mid-July Washington Post/ABC News poll showed Biden's double-digit lead holding. In August, Trump's polling slightly improved. One national poll conducted then showing Biden leading by just three percent nationally. Trump also began to improve in state polls; one CNN poll at the time showed Biden up by just one percentage point in 15 battleground states. Towards the end of the month however, Biden's lead started to grow again. After the 2020 Republican National Convention, Trump's polling improved. By the end of August, Trump had a lead against Biden in key states such as Ohio where he led 50% to 45%, and was polling neck-and-neck with his opponent in other important states such as Florida. Trump's national polling numbers fell heavily again following his performance at the first presidential debate and his COVID-19 diagnosis at the end of September and beginning of October, as Biden's lead went over 10 points. A Washington Post/ABC News poll taken around this period showed Biden's lead to be 53% to 43%. Trump overestimated his polls on Election Day but lost re-election. Although polling accurately predicted the winner of 48 out of 50 states and the District of Columbia, Biden’s margin of victory in many states was much smaller than expected. ==Notes== ==References== ==Other websites== Category:2020 United States presidential campaigns presidential campaign 2020",
 "title": "Donald Trump 2020 presidential campaign"
}