{
 "id": "593566",
 "text": "The Río Negro department () is a department of Uruguay. The capital is the city of Fray Bentos. Its ISO 3166-2 code is UY-RN. == History == The Río Negro department was created on 20 March 1880. Before that time, its territory was part of the Paysandú department. ==Geography== The Río Negro department is in the western part of Uruguay, along the Uruguay river. It has an area of . The population is 54,765 inhabitants (2011 census), one of the departments with fewest inhabitants, for a population density of inhabitants/km2. There are two chains of low hills in the department. These chains of low and rounded hills are named cuchillas in the country. The two cuchillas in the department are cuchilla de Navarro to the south and forming the border with the Durazno department, and cuchilla de Haedo that goes from the northeast to the southwest. There are two protected areas in the department: National Park Esteros de Farrapos e islas del río Uruguay () and the Esteros y algarrobales del río Uruguay. ===Limits=== * To the north: Paysandú department. * To the east: Tacuarembó department. * To the southeast: Durazno department, separated by the Río Negro river. * To the south: Soriano department, separated by the Río Negro river. * To the west: Argentina, separated by the Uruguay river. ===Rivers=== The main rivers in the department are: * Uruguay, to the west and that forms the border with Argentina; and * Río Negro that flows along the southern border of the department, forming the natural border with the departments of Durazno to the southeast and Soriano to the south. ==Demographics== The inhabitants of the Río Negro department (and of the city of Paysandú) are known, in Spanish, as Rionegrenses. Evolution of the population in Río Negro Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:350 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:60000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1975 text:1975 bar:1985 text:1985 bar:1996 text:1996 bar:2004 text:2004 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1975 from:0 till: 50123 bar:1985 from:0 till: 48644 bar:1996 from:0 till: 51713 bar:2004 from:0 till: 53989 bar:2011 from:0 till: 54765 PlotData= bar:1975 at: 50123 fontsize:S text: 50,123 shift:(-12,8) bar:1985 at: 48644 fontsize:S text: 48,644 shift:(-15,5) bar:1996 at: 51713 fontsize:S text: 51,713 shift:(-15,5) bar:2004 at: 53989 fontsize:S text: 53,989 shift:(-15,8) bar:2011 at: 54765 fontsize:S text: 54,765 shift:(-15,5) :Rural population According to the 2011 census, the Río Negro department has a rural population of 5,212, that represents of the total population of the department. :Main towns City / Town Population (2011) Fray Bentos 24,406 Young 16,756 Nuevo Berlín 2,450 San Javier 1,781 == Gallery == File:Parroquia Nuestra Sra Del Pilar11.jpg|Church of Fray Bentos. File:Plaza Artigas.jpg|Artigas square, Fray Bentos. File:Nuevo Berlin 02.jpg|Memorial with stone from the Berlin Wall, Nuevo Berlín File:Agua de fuego.jpg|Esteros de Farrapos. ==Related pages== * Departments of Uruguay * ISO 3166-2:UY ==References== ==Other websites== * Intendencia de Río Negro website * Statoids - Departments of Uruguay * Enciclopedia Geográfica del Uruguay: Río Negro Rio Negro Category:1880 establishments Category:1880s establishments in South America Category:19th-century establishments in Uruguay",
 "title": "Río Negro Department"
}