{
 "id": "593505",
 "text": "This is an alpabetical list of important roads in Metro Manila, the capital region of the Philippines. It also includes roads that have parts not in the region, like neighboring provinces. Roads in Metro Manila are usually classified into highways, boulevards, avenues, and streets. ==List== Name of road Location Short description Picture 10th Avenue Caloocan 32nd Street Taguig A road serving the Bonifacio Global City district. Abad Santos Avenue Manila ADB Avenue Mandaluyong, Pasig Adriatico Street Manila Aguinaldo Highway Las Piñas (plus the province of Cavite) Alabang–Zapote Road Las Piñas, Muntinlupa Amoranto Street Quezon City Amorsolo Street Makati Andres Soriano Jr. Street Manila Andrews Avenue Parañaque, Pasay It is a road serving the Ninoy Aquino International Airport. Anonas Street Quezon City Arnaiz Avenue Makati, Pasay Aurora Boulevard Quezon City, San Juan An important west-east (and east-west) road. It starts at an intersection with Gregorio Araneta Avenue and Magsaysay Boulevard in Quezon City and ends at the intersection with Katipunan Avenue and Marcos Highway. Ayala Avenue Makati Ayala Avenue is an important avenue serving Makati, the country's financial center since the 1960s. It passes through the center of the city's financial and business district. Therefore, it has been given the nickname the Wall Street of the Philippines. Balete Drive Quezon City A road serving the residential district of New Manila in Quezon City. Banawe Avenue Quezon City Batasan Road Quezon City Batasan–San Mateo Road Quezon City (plus the town of San Mateo in Rizal) Connects Quezon City to San Mateo, a town in the neighboring province of Rizal. Bayani Road Taguig Blumentritt Road Manila Boni Avenue Mandaluyong Bonifacio Avenue Marikina A road in the city of Marikina. Not the same as Bonifacio Avenue of Manila and Quezon City. Bonifacio Avenue Manila, Quezon City Starts at a cloverleaf-shaped interchange where North Luzon Expressway (NLEX) and Epifanio de los Santos Avenue (EDSA) meet, and ends at an intersection with Blumentritt Road in Manila. Not the same as Bonifacio Avenue of Marikina. Bonifacio Drive Manila Bonny Serrano Avenue Quezon City, San Juan C5 South Link Expressway Taguig, Pasay, Parañaque, Las Piñas A toll road connecting South Luzon Expressway (SLEX) and Manila-Cavite Expressway (CAVITEX). Carlos P. Garcia Avenue Taguig Chino Roces Avenue Makati Cipriano Raymundo Avenue Pasig Commonwealth Avenue Quezon City Congressional Avenue Quezon City Daang Hari Road Las Piñas, Muntinlupa (plus the cities of Bacoor and Imus in Cavite) Daang Hari Road is a road that connects the southern part of Metro Manila to the province of Cavite. Del Monte Avenue Quezon City Del Pilar Street Manila Diego Cera Avenue Las Piñas Dimasalang Road Manila Diosdado Macapagal Boulevard Parañaque, Pasay Doctor Arcadio Santos Avenue Parañaque Domestic Road Pasay It is a road serving the Ninoy Aquino International Airport. Doña Julia Vargas Avenue Mandaluyong, Pasig Doña Soledad Avenue Parañaque East Avenue Quezon City Elliptical Road Quezon City A roundabout in Quezon City that surrounds the Quezon Memorial Circle. It is named after its elliptical shape. Epifanio de los Santos Avenue Caloocan, Quezon City, San Juan, Mandaluyong, Makati, Pasay Commonly known by its abbreviation \"EDSA\", it is an important freeway that passes through the cities of Metro Manila. Escolta Street Manila A historic east to west street in the downtown district of Binondo in Manila that contains some examples of early skyscraper design in the country. It was formerly the center of business and commerce in Metro Manila until its decline in the 1960s when the center of business slowly moved to Makati. España Boulevard Manila Estrella Street Makati Eulogio Rodriguez Jr. Avenue Pasig, Quezon City It passes through Eastwood City, an entertainment district in the southeastern part of Quezon City. It should not be confused with Eulogio Rodriguez Sr. Avenue. Eulogio Rodriguez Sr. Avenue Quezon City It passes through the northern parts of New Manila district in the southwestern part of the city. It should not be confused with Eulogio Rodriguez Jr. Avenue. Felix Avenue Pasig (plus the town of Cainta in Rizal) General Luis Street Valenzuela, Caloocan, Quezon City Gil Fernando Avenue Marikina Gil Puyat Avenue Makati, Pasay Gilmore Avenue Quezon City A road serving the residential district of New Manila in Quezon City. Governor Pascual Avenue Malabon Gregorio Araneta Avenue Quezon City Harrison Avenue Pasay Hidalgo Street Manila Jose P. Laurel Street Manila It serves the area of the home of the country's president. Jose P. Rizal Avenue Makati A road in the city of Makati. Jose P. Rizal Street Marikina A road in the city of Marikina. Jose W. Diokno Boulevard Parañaque, Pasay A road serving the Bay City district. Juan Luna Street Manila Kalaw Avenue Manila Kalayaan Avenue Makati Not the same as Kalayaan Avenue of Quezon City. Kalayaan Avenue Quezon City Not the same as Kalayaan Avenue of Makati. Kamuning Road Quezon City Katipunan Avenue Quezon City Lacson Avenue Manila Lawton Avenue Taguig Legarda Street Manila Magsaysay Boulevard Manila Makati Avenue Makati Manila–Cavite Expressway Parañaque, Las Piñas (plus Bacoor and Kawit in Cavite) It is a toll road that connects Metro Manila to the province of Cavite. Manila South Road Muntinlupa (plus the province of Laguna) Marcos Highway Quezon City, Marikina (plus the provinces of Rizal and Quezon) It connects the eastern part of Metro Manila to the provinces of Rizal and Quezon. Maria Orosa Avenue Manila Maysan Road Valenzuela McArthur Highway Caloocan, Malabon, Valenzuela (plus several cities in the provinces of Bulacan, Pampanga, Tarlac, Pangasinan, La Union, Ilocos Sur, and Ilocos Norte) It connects Metro Manila to the provinces of Central Luzon and Ilocos Region. McKinley Road Makati, Taguig Mel Lopez Boulevard Manila Meralco Avenue Pasig Metro Manila Skyway Caloocan, Quezon City, Manila, Makati, Pasay, Taguig, Parañaque, Muntinlupa An elevated (above- ground) toll road that passes through the top of the South Luzon Expressway and provides a faster way to reach the northern part and southern part of Metro Manila. Also including the provinces of Central Luzon and CALABARZON without suffering the heavy traffic congestion in the area. Mindanao Avenue Quezon City, Valenzuela Muntinlupa–Cavite Expressway Muntinlupa (plus the city of Bacoor in Cavite) A toll road that connects Muntinlupa to the city of Bacoor in Cavite. NAIA Expressway Parañaque, Pasay It is a toll road serving the Ninoy Aquino International Airport. NAIA Road Parañaque, Pasay It is a road serving the Ninoy Aquino International Airport. Nicanor Domingo Street Quezon City, San Juan Nicanor Garcia Street Makati Ninoy Aquino Avenue Parañaque, Pasay It is a road serving the Ninoy Aquino International Airport. North Avenue Quezon City North Bay Boulevard Navotas North Luzon Expressway Caloocan, Valenzuela (plus the provinces of Bulacan and Pampanga) It is a toll road that connects Metro Manila to the provinces of Central Luzon. North Luzon Expressway Harbor Link Navotas, Caloocan, Malabon, Valenzuela, Quezon City Also known as NLEX Harbor Link. A toll road connecting from Radial Road 10 in Navotas to Mindanao Avenue in Valenzuela. The future eastern end of the expressway, which is the Congressional Avenue exit, part of Circumferential Road 5 in Quezon City is not yet opened. Ocampo Street Manila, Makati Ortigas Avenue San Juan, Mandaluyong, Quezon City, Pasig (plus the neighboring towns of Cainta and Taytay, Rizal) Osmeña Highway Manila, Makati A toll-free road connecting from Quirino Avenue in Manila to Epifanio de los Santos Avenue (EDSA), near Magallanes Interchange in Makati. Padre Burgos Avenue Manila Padre Faura Street Manila Paseo de Roxas Makati Pasig Boulevard Pasig An extension of Shaw Boulevard in the city of Pasig. Paterio Aquino Avenue Malabon Pedro Gil Street Manila Pedro Tuazon Boulevard Quezon City Pioneer Street Mandaluyong, Pasig Boni Avenue from Mandaluyong continues as this street after passing through EDSA and entering Pasig. Quezon Avenue Quezon City Quezon Boulevard Manila Quintin Paredes Road Manila Quirino Avenue Manila Different from Quirino Avenue in Parañaque. Part of Circumferential Road 2. Quirino Avenue Parañaque Different from Quirino Avenue in Manila. Part of Radial Road 2. Quirino Highway Quezon City, Caloocan (plus San Jose del Monte, Bulacan) Connects northern part of Metro Manila to the southeastern part of the province of Bulacan. Recto Avenue Manila Regalado Highway Quezon City Rizal Avenue Caloocan, Manila Roosevelt Avenue Quezon City It connects Quezon Avenue to Epifanio de los Santos Avenue (EDSA). Later renamed as Fernando Poe Jr. \"FPJ\" Avenue. Roxas Boulevard Manila, Pasay, Parañaque Samson Road Caloocan San Miguel Avenue Mandaluyong, Pasig Shaw Boulevard Mandaluyong, Pasig South Avenue Makati South Luzon Expressway Makati, Pasay, Taguig, Muntinlupa (plus the province of Laguna and the city of Santo Tomas in Batangas) A toll road that connects Metro Manila to the southern part of Luzon (CALABARZON region). Toll payments for vehicles going south start after passing through an interchange with Andrews Avenue and Lawton Avenue in Pasay and Taguig. The elevated Metro Manila Skyway passes on top of it from Makati to Muntinlupa. Sumulong Highway Marikina (plus Cainta and Antipolo, Rizal) A highway that connects Marikina to the province of Rizal. Taft Avenue Manila, Pasay Tandang Sora Avenue Quezon City Tayuman Street Manila Timog Avenue Quezon City Tomas Claudio Street Manila Tomas Morato Avenue Quezon City Tramo Street Pasay United Nations Avenue Manila University Avenue Quezon City It serves the area of the University of the Philippines Diliman (UP Diliman). Victorino Mapa Street Manila West Avenue Quezon City Zabarte Road Caloocan, Quezon City Zobel Roxas Street Manila, Makati Category:Streets in Metro Manila",
 "title": "List of roads in Metro Manila"
}