{
 "id": "593541",
 "text": "The Paysandú department () is a department of Uruguay. The capital is the city of Paysandú. Its ISO 3166-2 code is UY-PA. ==Geography== The Paysandú department is in the western part of Uruguay, along the Uruguay river. It has an area of , the third largest department in the country, after the Tacuarembó and Salto departments. The population is 113,124 inhabitants (2011 census) for a population density of inhabitants/km2. There are two chains of low hills in the department. These chains of low and rounded hills are named cuchillas in the country. The two cuchillas in the department are cuchilla de Queguay to the northwest, and cuchilla de Haedo to the southeast. There is one protected area in the department: Montes del Queguay (); it is around the confluence of the Queguay Grande and Queguay Chico rivers. ===Limits=== ===Rivers=== The main rivers in the department are: * Uruguay, to the west and that forms the border with Argentina; and * Queguay Grande, a tributary of the Uruguay river that flows through the department from East to West. ===Climate=== The Köppen climate classification type for the climate in Paysandú is a \"Humid subtropical climate\" and of the subtype Cfa. The average amount of precipitation for the year in Paysandú is . The month with the most precipitation on average is March with of precipitation. The month with the least precipitation on average is May with an average of . The average temperature for the year in Paysandú is . The warmest month, on average, is January with an average temperature of . The coolest month on average is June, with an average temperature of . ==Demographics== The inhabitants of the Paysandú department (and of the city of Paysandú) are known, in Spanish, as Sanduceros. Evolution of the population in Paysandú Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:350 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:120000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1975 text:1975 bar:1985 text:1985 bar:1996 text:1996 bar:2004 text:2004 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1975 from:0 till: 98508 bar:1985 from:0 till: 103763 bar:1996 from:0 till: 111509 bar:2004 from:0 till: 113224 bar:2011 from:0 till: 113124 PlotData= bar:1975 at: 98508 fontsize:S text: 98,508 shift:(-12,8) bar:1985 at: 103763 fontsize:S text: 103,763 shift:(-15,5) bar:1996 at: 111509 fontsize:S text: 111,509 shift:(-15,5) bar:2004 at: 113224 fontsize:S text: 113,224 shift:(-15,8) bar:2011 at: 113124 fontsize:S text: 113124 shift:(-15,5) :Rural population According to the 2011 census, the Paysandú department has a rural population of 4,364. :Main towns City / Town Population (2011) Paysandú 76,412 Nuevo Paysandú 8,578 Guichón 5,039 Chacras de Paysandú 3,965 Quebracho 2,853 San Félix 1,718 Porvenir 1,159 Tambores 1,111 Piedras Coloradas 1,094 == Gallery == File:Basílica Nuestra Sra del Rosario y San Benito de Palermo.jpg|Basilica of Paysandú. File:Río Queguay 02.JPG|Queguay Grande river. File:MesetadeArtigas.jpg|Plateau of Artigas. File:Montes Del Queguay.JPG|Montes del Queguay. ==Related pages== * Departments of Uruguay * ISO 3166-2:UY ==References== ==Other websites== * Intendencia Departamental de Paysandú website * Statoids - Departments of Uruguay * Enciclopedia Geográfica del Uruguay: Paysandú Paysandu Category:19th-century establishments in Uruguay Category:1810s establishments in South America",
 "title": "Paysandú Department"
}