{
 "id": "593687",
 "text": "The USS Robalo (SS-273) was a Gato class submarine of the US Navy in World War II. The submarine went on three patrols. == First patrol == On the way from Pearl Harbor to the Fremantle submarine base, Western Australia, she had met with enemy ships. On 13 February 1944 her attack was unsuccessful and no enemy ships were damaged or sunk.The Official Chronology of the US Navy in World War II-see entry for 13 February 1944 She spent 36 of her 57-day mission submerged.Blair, pp.582 & 942. When she arrived, Admiral Christie immediately had her commanding officer replaced.Ambruster got no chance to defend himself, and was reassigned as Chief Of Staff to the base commander at Midway, Blair, p.582. The new commanding officer was a son of Admiral Husband Kimmel, who commanded the Pacific Fleet when the Japanese attacked Pearl Harbor, and nephew of Admiral Thomas C. Kinkaid.Blair, pp.626 & 948. == Second patrol == For her second patrol, Robalo went to the South China Sea, with the job of stopping Japanese oil tankers sailing from French Indochina to the fleet anchorage at Tawi Tawi.Blair, p.626. On 24 April 1944 off Indochina Official Chronology of the US Navy entry 24 April 1944 she was bombed by a Japanese antisubmarine aircraft. The Robalo had been seen by Japanese aircraft carrier Kaiyō which was escorting convoy Hi-58. In trying to escape the submarine dived quickly down to 350 feet (110 m), but the main entry hatch was not closed properly. The periscopes were damaged and flooded, her radar stopped working. A similar failure to close the main hatch had caused the submarine Squalus to sink with the loss of 26 sailors in 1939. On a \"wildly aggressive patrol\" lasting 51 days,Blair, p.948. Robalo fired 20 torpedoes in four attacks: *3 May 1944, six torpedoes against a 4000-ton freighter (no damage); *8 May 1944, four torpedoes against a 1900-ton submarine (no damage); *17 May 1944, six torpedoes against a 7500 tanker (one hit) and four torpedoes against a 1500-ton destroyer (no damage).SORG attack data USS Robalo She was credited with sinking a 7500-ton tanker but this could not be proved. When she returned to Fremantle, Captain \"Tex\" McLean (commanding Subron 16)Blair, p.610. and Admiral Christie both considered relieving Robalo'scommanding officer for his own safety. == Third patrol == Robalo departed Fremantle on 22 June 1944 on her third war patrol. She set a course for the South China Sea to conduct her patrol near the Natuna Islands. After leaving Makassar Strait and Balabac Strait (which was known to be mined),Blair, p.687. she was meant to arrive about 6 July and remain there until dark on 2 August 1944. On 2 July, a contact report stated Robalo had sighted a Fusō-class battleship, with air cover and two destroyers for escort, just east of Borneo. No other messages were ever received from the submarine and when she did not return from patrol, she was presumed lost. On 2 August, a note was dropped from the window of a cell of Puerto Princesa Prison Camp on Palawan Island in the Philippines. It was picked up by an American soldier who was on a work detail nearby. The note was in turn given to H. D. Hough, Yeoman Second Class, who was also a prisoner at the camp. On 4 August, he contacted Trinidad Mendosa, wife of guerrilla leader Dr. Mendosa had more information on the survivors. From these sources, it was concluded Robalo was sunk on 26 July 1944, off the western coast of Palawan Island. The submarine was sunk by an explosion near her after battery, probably caused by an enemy mine. Only four men swam ashore,[Ensign Samuel L. Tucker; QMC 1/Floyd G laughlin; SM3c Wallace K. Martin; Emc2 MAson C. Poston .p.100 \"United States Submarine Losses World War II\"] and made their way through the jungles northwest of the Puerto Princesa Prison Camp. They were captured by the Japanese Military Police were jailed for guerrilla activities. On 15 August, they were evacuated by a Japanese destroyer and never heard from again. Even though Admiral Christie knew better it was reported for morale reasons that all hands went down with the boat. However, other prisoners on Palawan reported that the boat's skipper Lt. Cdr. Manning Kimmel, son of Admiral Husband Kimmel, was one of the survivors. It is believed that after an air strike on Palawan the Japanese were so angry that they pushed Kimmel and other prisoners into a ditch, poured in gasoline and burned them alive.Blair, Clay Jnr, Silent Victory: The US Submarine War Against Japan (Volume 2, pp 660–662) Robalo was removed from the Naval Vessel Register on 16 September 1944. Robalo earned two battle stars for World War II service. As noted above, most sources credit Robalo with sinking a 7,500 tanker but recent research shows the \"Robalo\" with two confirmed victories in the Pacific War Three sinkings are credited to the submarine USS Lapon (SS-260), but the Lapon's own history only claims one victory on this date. ==References== Category:Submarines of the United States Navy",
 "title": "USS Robalo"
}