{
 "id": "593906",
 "text": "\"Rock Bottom\" is the 2nd part of the 17th episode of SpongeBob SquarePants. It was first broadcast on Nickelodeon on March 15, 2000. The episode is about SpongeBob getting stuck in a dark city named Rock Bottom. The episode was watched by about 2.1 million people when it was first broadcast. == Story == SpongeBob and Patrick get on a bus after going to an amusement park. They get on the wrong bus that takes them to a 90 degree cliff. The cliff takes them to a dark city named Rock Bottom where many strange animals live. Patrick gets back on the bus but forgets to bring SpongeBob with. SpongeBob is stuck in the city and tries many times to get on another bus. He goes to a bus station and has to wait in a long line. When he gets to the front, there is only one bus left. He misses that bus and will have to wait the next day for another one. He hears a raspberry sound from far away. He runs back to the cliff to get away from the sound. He learns that a nice anglerfish was making the sound to give him a balloon. The anglerfish puts air in the balloon and ties it to SpongeBob's hand. The balloon takes SpongeBob up and back to Bikini Bottom. He sees Patrick getting on another bus thinking that SpongeBob is still at Rock Bottom. == Production == \"Rock Bottom\" was written by Paul Tibbitt, Ennio Torresan, and David Fain. Tom Yasumi directed the episode's animation and Tibbitt and Torresan directed the storyboard. Merriwether Williams thought that the episode is one of the best because the story is \"so simple\". She said \"It just stayed with one idea. 'Rock Bottom' was about how he [SpongeBob] keeps missing the bus and how that makes him feel.\" She said that the story was so small that \"you could explore gags (jokes) and opportunities for gags.\" == Reception == The episode was watched by about 2.1 million people when it was first broadcast. Nancy Basile from About.com said that \"The raspberries and SpongeBob's increasing frustration make this a hilarious episode.\" She says that the episode is \"relatable\" for having \"SpongeBob running up against Murphy's law\" (which states that anything that can go wrong will go wrong). Emily Estep from WeGotThisCovered.com said that the episode is \"mostly a goofy episode\" but \"also one of the scarier episodes\". She thought that the balance of cuteness and horror makes the episode known well. The roller coaster SpongeBob SquarePants Rock Bottom Plunge was made similar to the episode. == References == == Other websites == * Category:SpongeBob SquarePants episodes Category:2000 television episodes",
 "title": "Rock Bottom (SpongeBob SquarePants)"
}