{
 "id": "594075",
 "text": "The Tacuarembó department () is a department of Uruguay. The capital is the city of Tacuarembó. Its ISO 3166-2 code is UY-TA. == Name == The department and its capital city are named after Tacuarembó river, the main tributary of the Río Negro river. == History == The first division in departments of Uruguay was in 1816. At that time, the Paysandú Department included all the territory north of the Río Negro, including the actual departments of Artigas, Rivera, Tacuarembó, Salto, Paysandú and Río Negro. On 16 June 1837 a new division of Uruguay was made and this territory was divided in three parts; one of these parts was the Tacuarembó Department that included also the actual department of Rivera, until it was split from it in 1884. ==Geography== The Tacuarembó department is in the north central part of the country. It has an area of , the largest in the country. It is has a population of 90,053 inhabitants (2011 census) for a population density of . To the west of the department there is a chains of low and rounded hills in the department, the Cuchilla de Haedo. === Limits === It borders Rivera Department to its north and northeast, the departments of Salto, Paysandú and Río Negro to its west and Durazno and Cerro Largo to the south separated by the Río Negro. ===Rivers=== The Río Negro river forms the southern border of the department but the most important river that is completely within the department is the Tacuarembó river, the main tributary of Río Negro. ===Climate=== The Köppen climate classification type for the climate at Paso de los Toros, in the southwest of the department, is a \"Humid subtropical climate\" and of the subtype Cfa. The average amount of precipitation for the year in Paso de los Toros is . The month with the most precipitation on average is January with of precipitation. The month with the least precipitation on average is December with an average of . The average temperature for the year in Paso de los Toros is . The warmest month, on average, is January with an average temperature of . The coolest month on average is July, with an average temperature of . ==Demographics== The inhabitants of the Tacuarembó department (and of the city of Rivera) are known, in Spanish, as Tacuaremboenses. Evolution of the population in Tacuarembó Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:350 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:100000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:20000 start:0 ScaleMinor = gridcolor:lightgrey increment:10000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1975 text:1975 bar:1985 text:1985 bar:1996 text:1996 bar:2004 text:2004 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1975 from:0 till: 84535 bar:1985 from:0 till: 83498 bar:1996 from:0 till: 84919 bar:2004 from:0 till: 90489 bar:2011 from:0 till: 90053 PlotData= bar:1975 at: 84535 fontsize:S text: 84,535 shift:(-12,8) bar:1985 at: 83498 fontsize:S text: 83,498 shift:(-15,5) bar:1996 at: 84919 fontsize:S text: 84,919 shift:(-15,5) bar:2004 at: 90489 fontsize:S text: 90,489 shift:(-15,8) bar:2011 at: 90053 fontsize:S text: 90,053 shift:(-15,5) :Rural population According to the 2011 census, the Tacuarembó department has a rural population of 9,660. :Main towns City / Town Population (2011) Tacuarembó 54,755 Paso de los Toros 12,985 San Gregorio de Polanco 3,415 Ansina 2,712 Las Toscas 1,142 Curtina 1,037 == Gallery == File:Lago Iporá.JPG|Iporá lake. File:Cerro Cementerio.JPG|Cerro Cementerio. File:Cerro Batoví.JPG|Cerro Batoví. File:Monumento en Plazoleta El Toro.jpg|Monument in Paso de los Toros. ==Related pages== * Departments of Uruguay * ISO 3166-2:UY ==References== ==Other websites== * Gobierno Departamental de Tacuarembó website * Statoids - Departments of Uruguay * Enciclopedia Geográfica del Uruguay: Tacuarembó Tacuarembo Category:1837 establishments Category:19th- century establishments in Uruguay Category:1830s establishments in South America",
 "title": "Tacuarembó Department"
}