{
 "id": "594052",
 "text": "The Rivera department () is a department of Uruguay. The capital is the city of Rivera. Its ISO 3166-2 code is UY-RV. == Name == The department and its capital city are named after Fructuoso Rivera (1784–1854), first president of Uruguay. ==Geography== The Rivera department is in the northern part of the country. It has an area of , the 11th largest in the country. It is the eighth department with more people living in it, with a population of 103,493 inhabitants (2011 census) for a population density of . There are three chains of low and rounded hills in the department. These chains of are known as cuchillas in the country. At the northwest end of the department is the Cuchilla de Haedo, one of the most important cuchilla of the country, coming from the south; it meets the Cuchilla Negra that comes from the north. Between these two hill ranges is the Cerro de los Peludos hill. Along the borders with Brazil, to the north, runs the Cuchilla de Santa Ana. In the middle of the department is the hill Cerro de la Cruz, while on its eastern end are the hills Cerro del Hospital and Cerro Bonito. === Limits === * To the north: Brazil * To the east: Brazil, and Cerro Largo department separated by the Río Negro river. * To the south: Tacuarembó department separated by the Río Tacuarembó river. * To the west: Tacuarembó and Salto department. ===Rivers=== Along the eastern borders of the department with Cerro Largo Department flows the Río Negro river, with its tributaries flowing through the easternmost part of the department. The western part of its southern border with the Tacuarembó Department is formed by the Tacuarembó river (a tributary of the Río Negro river, with its tributaries flowing through most of the department. ===Climate=== The Köppen climate classification type for the climate at Rivera is a \"Humid subtropical climate\" and of the subtype Cfa. The average amount of precipitation for the year in Rivera is . The month with the most precipitation on average is October with of precipitation. The month with the least precipitation on average is June with an average of . The average temperature for the year in Rivera is . The warmest month, on average, is January with an average temperature of . The coolest month on average is June, with an average temperature of . ==Demographics== The inhabitants of the Rivera department (and of the city of Rivera) are known, in Spanish, as Riverenses. Evolution of the population in Rivera Colors= id:lightgrey value:gray(0.9) id:darkgrey value:gray(0.7) id:sfondo value:rgb(1,1,1) id:barra value:rgb(0.6,0.7,0.8) ImageSize = width:400 height:350 PlotArea = left:50 bottom:50 top:30 right:30 DateFormat = x.y Period = from:0 till:110000 TimeAxis = orientation:vertical AlignBars = justify ScaleMajor = gridcolor:darkgrey increment:10000 start:0 ScaleMinor = gridcolor:lightgrey increment:5000 start:0 BackgroundColors = canvas:sfondo BarData= bar:1975 text:1975 bar:1985 text:1985 bar:1996 text:1996 bar:2004 text:2004 bar:2011 text:2011 PlotData= color:barra width:30 align:left bar:1975 from:0 till: 82043 bar:1985 from:0 till: 89475 bar:1996 from:0 till: 98472 bar:2004 from:0 till: 104921 bar:2011 from:0 till: 103493 PlotData= bar:1975 at: 82043 fontsize:S text: 82,043 shift:(-12,8) bar:1985 at: 89475 fontsize:S text: 89,475 shift:(-15,5) bar:1996 at: 98472 fontsize:S text: 98,472 shift:(-15,5) bar:2004 at: 104921 fontsize:S text: 104,921 shift:(-15,8) bar:2011 at: 103493 fontsize:S text: 103,493 shift:(-15,5) :Rural population According to the 2011 census, the Rivera department has a rural population of 7,602. :Main towns City / Town Population (2011) Rivera 64,485 Tranqueras 7,235 Mandubí 6,019 Minas de Corrales 3,788 Vichadero 3,698 La Pedrera 3,363 Santa Teresa 2,657 Lagunón 2,376 == Gallery == File:Rincon de tres cerros.jpg|Rincón de Tres Cerros. File:Valle del Lunarejo 18.JPG|Valle del Lunarejo. File:Rivera Street.JPG|Street in Rivera. File:Plaza Artigas- Rivera UY 02.JPG|Monument to Artigas, Rivera. ==Related pages== * Departments of Uruguay * ISO 3166-2:UY ==References== ==Other websites== * Intendencia Departamental de Rivera website * Statoids - Departments of Uruguay * Enciclopedia Geográfica del Uruguay: Rivera Category:1884 establishments Category:1880s establishments in South America Category:19th-century establishments in Uruguay",
 "title": "Rivera Department"
}