{
 "id": "594171",
 "text": "The 2017 Jiuzhaigou earthquake was an earthquake that happened on 8 August 2017, in Zhangzha Town, Jiuzhaigou County, Ngawa Prefecture, Sichuan Province, China. The earthquake was recorded at magnitude 7.0. It killed at least 24 people in the area. == Earthquake == The earthquake started at 21:19:46 China Standard Time (CST, UTC+8) on 8 August 2017 in Zhangzha Town in Jiuzhaigou County (). It had magnitude 7.0. Cities as far away as Lanzhou, Chengdu and Xi'an felt the earthquake. The centre of the earthquake was 39 kilometres from the county seat of Jiuzhaigou County, 66 kilometres from Songpan County, 83 kilometres from Zhouqu County, 90 kilometres from Zoigê County, 105 kilometres from Longnan City, and 285 kilometres from Chengdu City. == Setting == Northern Sichuan is in an area where there is a lot of earth movement. In this area, the Tibetan Plateau is next to the Yangtze Plate with great pressure forming faults along the edges. Jiuzhaigou County is in the Min Mountains, a range that was formed where these faults meet. The disastrous 1879 Gansu earthquake had its earthquake centre about 65 kilometres to the east of where the 2017 Jiuzhaigou earthquake happened. The places with lots of mountains to the south of Jiuzhaigou County were the earthquake centre of the 2008 Sichuan earthquake that resulted in tens of thousands of deaths. == Influence == The China Earthquake Administration said that the graph showed that the strength of earthquake could be higher than level IX, and the earthquake centre in Zhangzha County could reach level VIII. After the earthquake, all of the Jiuzhaigou County completely suffered a power failure. The people who saw the situation found that some buildings had fallen in Jiuzhaigou Valley Scenic and Historic Interest Area. The staff of the Jiuzhaigou Valley Scenic and Historic Interest Area told a reporter from Xinhua News Agency that in the fourth ditch of the Jiuzhaigou Valley Scenic and Historic Interest Area a house had fallen down and cracked, and the locals were stepping up to move people out. == Rescue == The China Earthquake Administration put up a Level I reaction. It later changed to Level II. They sent the army to the earthquake area for rescue. At 21:26 CST (UTC+8), Health and Family Planning Commission of Sichuan Province started an emergency plan. The medical rescue team was going to head to the earthquake area within one hour. The Red Cross Society of China, Sichuan Branch was on emergency standby (ready to act immediately), preparing for rescue. Early the next day, China's State Council Earthquake food-supply headquarters started national level Ⅱ earthquake emergency response. At 06:20 CST on 9 August, a Shuajingsi Town (刷经寺镇) militia vehicle had a traffic collision with a Sichuan F (Deyang) coach in Hongyuan County, Ngawa Prefecture. Three people from the coach were injured and were being medically treated. Until 9 August 2017, there were 40 people seriously injured. Seven of them were moved to other hospitals, four to West China Hospital of Sichuan University, and the rest to Jiuzhaigou County Hospital and Zhongzang Hospital. == Deaths and injuries == The Emergency Management Office of the Ngawa Prefecture, Sichuan Province said that until 13:10 CST on 9 August, the 7.0-magnitude earthquake in Zhangzha Town in Jiuzhaigou County killed 19 people and injured 247 people, including 40 people critically injured. The following day, the deaths rose to 20 with over 400 injured. Deaths and injuries mainly occurred in Zhangzha Town in Jiuzhaigou County. CST date and time Deaths Injuries Sources References Serious injuries Minor injuries Total injuries 2017-08-08 21:19:46 (main earthquake happened) China Earthquake Networks Center (中国地震台网) 2017-08-08 23:39 1 4 4 Chengdu Tourism Administration (成都市旅游局) 2017-08-08 23:58 5 63 Emergency Management Office of the Jiuzhaigou County (九寨沟县应急办) 2017-08-09 02:08 5 88 China Central Television (中国中央电视台) 2017-08-09 04:00 9 32 103 135 Information Office of Ngawa Prefecture Government (阿坝州政府新闻办) 2017-08-09 05:00 9 164 Emergency Management Office of Ngawa Prefecture Government (阿坝州人民政府应急管理办公室) 2017-08-09 08:10 12 Ngawa Weibo (阿坝微博) 2017-08-09 08:58 12 28 147 175 People's Daily (人民日报) 2017-08-09 09:30 13 175 Information Office of Sichuan Province Government (四川省政府新闻办) 2017-08-09 13:10 19 40 207 247 Emergency Management Office of Ngawa Prefecture Government (阿坝州人民政府应急管理办公室) 2017-08-10 12:00 20 18 413 431 Emergency Management Office of the Jiuzhaigou County (九寨沟县应急办) 2017-08-11 19:00 23 45 448 493 Emergency Management Office of Ngawa Prefecture Government (阿坝州人民政府应急管理办公室) *All the times are reporting times, so the reported casualties might possibly be different from the actual casualties. == Aftershocks == As of 10 August 2017 10:00 CST (UTC+8), 1741 aftershocks had occurred. That included 30 major ones. Some experts said that the aftershocks might reach a magnitude of 6 after several days. The major aftershocks reported by China Earthquake Networks Center are listed below: List of aftershocks # CST date and time Earthquake centre Depth magnitude Sources Coordinate Place Main 2017-08-08 21:19:46 Jiuzhaigou County, Ngawa Prefecture, Sichuan Province, China 20 kilometres 7.0 1 2017-08-08 21:28:55 5 kilometres 3.2 2 2017-08-08 21:41:34 9 kilometres 3.3 3 2017-08-08 23:04:56 5 kilometres 3.2 4 2017-08-08 23:49:18 9 kilometres 3.0 5 2017-08-08 23:51:12 10 kilometres 3.1 6 2017-08-09 00:35:17 20 kilometres 3.2 7 2017-08-09 03:59:09 10 kilometres 3.0 8 2017-08-09 05:16:02 10 kilometres 3.6 9 2017-08-09 05:37:14 17 kilometres 3.6 10 2017-08-09 05:41:09 10 kilometres 3.3 11 2017-08-09 06:24:49 18 kilometres 3.0 12 2017-08-09 06:49:03 18 kilometres 3.2 13 2017-08-09 06:49:31 13 kilometres 3.3 14 2017-08-09 08:10:09 23 kilometres 3.7 15 2017-08-09 08:29:04 13 kilometres 3.9 16 2017-08-09 09:22:14 19 kilometres 3.8 17 2017-08-09 09:32:47 19 kilometres 3.7 18 2017-08-09 10:17:02 26 kilometres 4.8 19 2017-08-09 14:41:00 Heishui County, Ngawa Prefecture, Sichuan Province, China 18 kilometres 2.9 20 2017-08-09 20:03:03 Jiuzhaigou County, Ngawa Prefecture, Sichuan Province, China 24 kilometres 3.1 21 2017-08-10 02:30:50 26 kilometres 3.1 22 2017-08-10 03:02:13 19 kilometres 3.7 23 2017-08-10 03:06:09 24 kilometres 3.0 24 2017-08-10 05:05:54 26 kilometres 4.3 25 2017-08-10 09:54:02 27 kilometres 3.2 26 2017-08-10 15:30:09 26 kilometres 2.8 27 2017-08-10 17:38:31 19 kilometres 3.0 28 2017-08-10 17:48:34 26 kilometres 4.1 29 2017-08-11 08:05:09 25 kilometres 3.0 30 2017-08-11 19:26:21 26 kilometres 3.4 == Notes == == References == == Other websites == * Category:2017 earthquakes Category:2017 in Asia Category:2010s earthquakes in Asia Category:2010s disasters in China Category:August 2017 events Category:Earthquakes in China Category:Gansu Category:Shaanxi Category:Sichuan",
 "title": "2017 Jiuzhaigou earthquake"
}