{
 "id": "594164",
 "text": "Gene Sharp (January 21, 1928 - January 28, 2018) was an American political scientist, writer and activist. He was the founder of the Albert Einstein Institution, a non-profit organization dedicated to the study of nonviolent action. He was a retired professor of political science at the University of Massachusetts Dartmouth. He was known for his writings on nonviolent struggle. Sharp was born in North Baltimore, Ohio. He studied at Ohio State University and at Oxford University. Unofficial sources have claimed that Sharp was nominated for the Nobel Peace Prize in 2015,. Sharp was nominated by Norwegian Green Party Member of Parliament Rasmus Hansson. and had been nominated three times, in 2009, 2012 and 2013.\"Nonviolence scholar nominated for 2013 Nobel Peace Prize \" [press release]. American Friends Service Committee. afsc.org. February 25, 2013. Retrieved 2017-04-14.Oslo Newsroom (February 27, 2012). \"Former President Bill Clinton among Nobel Prize nominees\" . Reuters. The story states: \"Kristian Berg Harpviken, director of the Peace Research Institute of Oslo and one of the individuals eligible to nominate candidates, has released a short list of those names he had submitted. It is headed by Gene Sharp, a U.S. writer and philosopher who has long advocated non-violent action for social justice\" (accessed March 5, 2012). Sharp was widely thought to be the favorite for the 2012 Nobel Peace Prize award. In 2011 he was awarded the El-Hibri Peace Education Prize. In 2012 he was a recipient of the Right Livelihood Award as well as the Distinguished Lifetime Democracy Award. The article states that Sharp will receive the award at a symposium that \"will take place on November 15 and 16 at the Alumni Center, University of Miami, Florida.\" Sharp died on January 28, 2018 at home in Boston, Massachusetts, exactly 1 week after his 90th birthday. ==References== Category:1928 births Category:2018 deaths Category:American political scientists Category:American political writers Category:American political activists Category:Educators from Ohio Category:Writers from Ohio",
 "title": "Gene Sharp"
}