{
 "id": "59427",
 "text": "In the Atlantic slave trade, Europeans trafficked African slaves in and around the Atlantic Ocean. This trade lasted from the 15th century to the 19th century. Most enslaved people were shipped from West Africa and brought over to the New World on slave ships. This journey across the Atlantic by ship was known as the Middle Passage. Slave ships had horrible conditions, and deaths were common on board. Between 1500 and 1866, around 12.5 million enslaved Africans were trafficked to the Americas. Around 1.8 million died on the Middle Passage. == Sources of slaves == Some slaves were captured in battle with other Africans; others were captured when Europeans held raids and kidnapped Africans. Some were sold into slavery by other Africans as punishment or to pay a debt to Europeans. After being captured, the enslaved people were shackled together and marched to the coast on journeys lasting weeks or months. When they arrived, they were imprisoned in forts where they were purchased by other Europeans. Most historians today think that 12 to 13 million Africans arrived in the New World.Thomas, Hugh 1997. The Slave Trade: the history of the Atlantic slave trade 1440–1870. London: Picador, 1997. The Dahomian army traded slaves for weapons to protect themselves. King Gezo of Dahomey said in the 1840s: == Slave trade == Also see: Middle Passage; Slave ship === Triangular trade === See the main article: Triangular trade Some slave ships worked a three-part economic cycle often called the triangular trade. It tied the economies of several regions and continents together. The main triangular trading countries were England, The Netherlands, France, Spain and Portugal. Other ships just worked the slave trade. Christopher Columbus first came to the Americas in 1492 while seeking the West Indies. European countries started to build colonies in the Americas. This led to an economic reason for the Atlantic slave trade. African slaves were first imported in large numbers for mining and later to grow sugarcane on plantations. Slavery is much more ancient than the transatlantic trade. Slaves were used in many ancient societies.Greene, Jacqueline. Slavery in Ancient Egypt and Mesopotamia. 2001. Historians think that about 4.9 million slaves were brought to Brazil, 1.3 million to the Spanish colonies, and 400 thousand to mainland North America. About 3.9 million were brought to other parts of the Americans, mainly the Caribbean. Records show that only about 9000 slaves were brought to Europe. == Abolition and illegal trade == In the 18th century, a small opposition developed against the Atlantic slave trade in Britain, America, and some parts of Europe.Davis, David Brion 1975. The problem of slavery in the age of revolution: 1770–1823, p. 129. In Britain and America, opposition to the trade was led by the Religious Society of Friends (Quakers) and establishment Evangelicals such as William Wilberforce. People who protested against the trade were opposed by the owners of land in the Americas.Library of Society of Friends Subject Guide: Abolition of the Slave Trade. After 1772, slaves became free upon entering the British Isles.Lovejoy, Paul E. 2000. Transformations in slavery: a history of slavery in Africa, Cambridge University Press, p. 290. Abolitionism became stronger in the 19th century. Denmark was the first European country to ban the slave trade, in 1792, which took effect in 1803. On 22 February 1807, the work of William Wilberforce was rewarded with victory. By 283 votes for to 16 against, the British House of Commons passed the Slave Trade Act to abolish the slave trade.William Wilberforce (1759–1833). The United States abolished it later that year. The Royal Navy set up a blockade of West Africa to stop the trade. Treaties with other nations allowed the blockade ships to stop their slave trade. However, the smuggling of slaves was very common. Hundreds of thousands of Black people were enslaved illegally. New York City was a center for this illegal slave trade. Judges in New York avoided punishing slave traders through the 19th century. Many slaves continued to be sent to Spanish colonies of Cuba, Puerto Rico and much of South America.Aimes, Hubert H. 1967. A history of slavery in Cuba, 1511 to 1868. New York: Octagon Books. The slave trade in Brazil was banned in 1831. However, many European Brazilians thought it was necessary for their economy, so the country failed to stop it. Hundreds of thousands more slaves were brought to Brazil in the 1830s and 1840s until the British forced Brazil to end the slave trade. ==Related pages== *Racism *Slavery *Equality *Slave ship *Imperialism *Colonialism *Human rights *Middle Passage *Arab slave trade *Scientific racism *African slave trade *Barbary slave trade == References == Category:Historic slave trade",
 "title": "Atlantic slave trade"
}