{
 "id": "59469",
 "text": "In psychology and the cognitive sciences, perception is the process of taking in, picking, organizing, and understanding sensory information.The word perception comes from the Latin perception-, percepio and means \"receiving, collecting, action of taking possession, apprehension with the mind or senses.\"—OED.com. It includes collecting data from sense organs and interpreting it in the brain. Consider this: Light enters our eyes, and the brain works on this information to build up a mental picture of what is going on \"out there\". Perception is a lot more than just \"information coming in\". It is an active process. There are many ways to study perception. There are biological or physiological approaches, psychological approaches through the philosophy of mind and experiments. There are studies by philosophers such as David Hume, John Locke, George Berkeley. == History of the study of perception == The study of perception started with the study of sight. This makes sense because humans understand the world largely by looking at it. === Ancient Greece === The first studies of perception happened in the years 460371 BC by the Greek philosopher Democritus. He believed the shapes we see were pictures which flew to our eyes, where our soul would then recognize them. The philosopher Plato (427–348 BC) later came up with a new idea, he believed the eyes worked by first making light and then scanning the world. Another Greek philosopher and student of Plato called Aristotle (384–322 BC) did not agree with these ideas. He presented a new theory : * Light can only come from bright objects, like fire and the sun. * Light is not something you can touch * Light hits objects and then bounces off the object to hit our eyes * Light moves through something that humans can't see Aristotle's ideas were then accepted for hundreds of years. === 10th & 11th Century === Ibn al-Haytham wrote the first mathematical description of the visual process === 17th Century === Kepler explained what is inside of the eye. Descartes said that the way our physical senses see the world does not affect how we think about the world. Locke and Descartes both thought humans saw color because of the senses. === 18th Century === Kant suggested that humans can't know about things which our senses don’t see. Because of this he stated that a god and a soul were not possible. === 19th Century === New techniques were created and used to study the brain and perception. Many of these studies were paired with data on human behavior. The psychologist Wundt stated that perception could not just be explained by the way the body works and that psychology was needed too. === 20th Century === Gestalt psychology was formed. The idea behind this group of thinkers was that perception is more than the sum of our senses. == Process of Perception == === Bruner's model of perception === # When we see someone we don't know, we are looking for signs which will tell us things about them. # As we pick up on some signs, we match this person to a group we have seen before. # The search for signs that tell us about who they are becomes less broad. # We now only search for signs that put this person into the group we have matched them to. === Saks and Johns model of perception === # The perceiver : This is the person doing the observing and perceiving. There are three things that can have an effect on someone's perception. These are : How much experience someone has, how motivated this person is, and how they are feeling. Also, in some situations someone can use a \"perceptual defense\", this is when they only see what they want to see. # The person who is being watched and perceived : The least the other person knows about them the more they will try to guess. # The time and place this situation is happening at : This affects the amount of attention the perceiver gives to a situation. == Types of perception == === Vision === Vision is what you see. Seeing something happens when light enters the eyes. This light is turned into an electric message which travels to the brain and gets turned into a picture. === Sound === Sound is what you hear. The ears catch movement from sound waves which move in every direction. The brain takes these in, creating what we hear. === Touch === Touch is what you feel with your skin. The skin's top layer has receptors that take information in when touched. These receptors can sense pain, how hot or cold something is and how heavy something is. Receptors then send this information to our nervous system. === Taste === Taste is the flavor of things we eat or drink. Our tongue has many little bumps which take in our food's flavor. These bumps then send a message to our brain for us to taste. === Smell === The skin inside your nose has small cells which send messages to your brain when you breathe in. Your brain then senses the smell. == Theories of Perception == Theories of perception can be sorted into two groups. The first group believes in Bottom-Up processing. This approach means that to perceive, humans only needs information from their senses. For example : light enters the eye, this light is sent to the brain and the brain turns it into something we see. The second group is Top-Down processing. In this approach, perception starts off with something general and becomes specific. What we already know or expect has a big effect here. For example : if you see half of a cat, you will have an idea of what it looks like even though half of it is hidden. This is because you have seen a cat before. Top down processing helps humans quickly make sense of their environment without having to think too much. === Bottom-up processing === ==== Gibson's Ecological Theory ==== James Gibson (1904-1979) states that perception happens because of our human instincts. This means it can't be learned. He suggests that perception is needed for humans to stay alive. Neanderthals would have needed perception to escape danger, suggesting perception is the result of evolution. Gibson's theory is known as the \"Ecological Theory\" , because he says that perception can only be explained by our environment. To Gibson, Sensation = perception. === Top-down processing === ==== Stephen E. Palmer ==== Palmer states that people have ideas about how the world looks like, and they use that knowledge to figure out what things are. He did a study in 1975 to show this. In his study, people were shown groups of 4 pictures. One picture was a location, a kitchen for example. The other three pictures were one object you would find in a kitchen (bread), and two pictures that had no ties to the kitchen (an instrument and a mailbox). This was repeated with many different places and objects. His findings showed that people found it harder to recognize the objects that had no relationship to the location. == Evolutionary psychology == This recognises how all animals have perception of some kind: because they are mobile they need senses which give them information about what is around them. Of course, primitive animals have simple sense organs, like Euglena does, whereas complex animals need much more information about their surroundings. Therefore, advanced animals do have advanced visual and other sensory systems. This relates to perception. The main function of sense organs is to guide action. Gaulin, Steven J.C. and McBurney, Donald H. 2003. Evolutionary Psychology. Prentice Hall. ISBN 978-0-13-111529-3, Chapter 4, pp. 81–101. == References and more reading == * * Flanagan J.R., Lederman S.J. 2001.Neurobiology: Feeling bumps and holes, News and Views, Nature, 412(6845):389–91. * * Gregory R.L. 1981. Mind in Science: a history of explanations of psychology and physics. London: Weidenfeld and Nicolson; USA: CUP. Paperback, Peregrine. * * Robles-De-La-Torre, G. The importance of the sense of touch in virtual and real environments . IEEE Multimedia 13(3), Special issue on Haptic User Interfaces for Multimedia Systems, pp. 24–30 (2006). ==Other websites== * Online papers on perception , by various authors, compiled by David Chalmers * Paradoxical haptic objects . An example of touch illusions of shape. See also the MIT Technology Review article: * The Cutting Edge of Haptics, by Duncan Graham-Rowe. * Theories of Perception Category:Sources of knowledge",
 "title": "Perception"
}