{
 "id": "594770",
 "text": "This is a list of paintings by Edvard Munch. Munch was a Norwegian symbolist painter and printmaker. He is best known for The Scream. This list is from Gerd Woll's catalogue raisonné from 2008. Number Image Name Year Current Location 1 Telthusbakken with Gamle Aker Church 1880 Location unknown 2 Øvre Foss 1880 Munch Museum, Oslo, Norway 3 Small Lake with Boat 1880 Munch Museum, Oslo, Norway 4 Horse and Wagon in front of Farm Buildings 1880 Location unknown 5 Autumn Work in the Field 1880 Location unknown 6 Landscape with Woman Walking by a Lake 1880 Location unknown 7 Landscape with Trees and Water 1880 Location unknown 8 Autumn in the Forest 1880 Flaten Art Museum. St. Olaf College, Northfield, Minnesota, USA. Gift from Brunhild Telie Sather 9 Horse and Cart on a Country Road 1880 Private Collection 10 Still Life with Pipe and Bibles 1880 Private Collection 11 View from Fossveien 1880-81 Lillehammer Art Museum, Norway. Oscar Johannessen's collection 12 View from Fossveien 1881 Munch Museum, Oslo, Norway 13 Winter Landscape with House and Red Sky 1881 Location unknown 14 Potted Plant on the Window-Sill 1881-82 Munch Museum, Oslo, Norway 15 Potted Plant 1881-82 Munch Museum, Oslo, Norway 16 The Living- Room of the Misses Munch in Pilestredet 61 1881 Munch Museum, Oslo, Norway 17 From Vestre Aker 1881 National Gallery, Oslo, Norway 18 Hakloa in Maridalen 1881 Location unknown 19 Maridalsveien in Nydalen 1881 Location unknown 20 Houses in Maridalen 1881 Private collection 21 From Maridalen 1881 Munch Museum, Oslo, Norway 22 Akerselva 1881 Private Collection 23 Landscape with Woman and Child 1881 Private Collection 24 Landscape with a Small House and Two People 1881 Private Collection 25 Landscape with Lake and Forest 1881 Private Collection 26 From Bunnefjorden 1881 Munch Museum, Oslo, Norway 27 From Sandvika 1881 Flaten Art Museum. St. Olaf College, Northfield, Minnesota, USA. Estate of Richard N. Telie 28 Man Rowing towards Land 1881 Private Collection 29 Bay with Boat and House 1881 Collectión Carmen Thyssen- Bornemisza en depósito en el Museuo Thyssen-Bornemisza, Madrid, Spain 30 Man and Woman in Boat 1881 Private Collection, Stockholm 31 Fisherman by the Water 1881 Location unknown 32 Christian Munch on the Couch 1881 Munch Museum, Oslo, Norway 33 Christian Munch on the Couch 1881 Location unknown 34 Study of a Landscape 1881 Location unknown 35 View of Grüner's Garden 1881 Private collection 36 Gamle Aker Church 1881-82 Private collection 37 Gamle Aker Church 1881 Munch Museum, Oslo, Norway 38 Gamle Aker Church 1881 Munch Museum, Oslo, Norway 39 Gamle Aker Church 1881 Private Collection 40 View from Fossveien 7 towards Bergfjerdingen 1881 Munch Museum, Oslo, Norway 41 People on the Road in Wet Snow 1881 Private Collection 42 Goblin with Christmas Porridge 1881 Peder Andreas Lund 43 Still Life with Jar, Apple, Walnut and Coconut 1881 Munch Museum, Oslo, Norway 44 Øvre Foss in Winter 1881-82 Location unknown 45 Boy in Snow 1881-82 The World Children's Art Museum, Okazaki, Japan 46 View of the City on a Winter's Day 1882 Location Unknown 47 Self-Portrait 1882 Munch Museum, Oslo, Norway 48 Laura Munch 1882 Munch Museum, Oslo, Norway 49 Laura Munch 1882 Munch Museum, Oslo, Norway 50 Olaf Rye's Square towards South East 1882 Location unknown 51 View across Olaf Rye's Square 1882 Private collection 52 Olaf Rye's Square towards South East 1882 Munch Museum, Oslo, Norway 53 Landscape with Waterfall and House 1882 Location unknown 54 Evening Atmosphere at Sea 1882 Munch Museum, Oslo, Norway 55 Landscape with a Small Waterfall 1882 Erik M. Vik 56 Spring Landscape 1882 Private collection 57 Stream in Spring 1882 Private collection 58 Karen Bjølstad 1882-83 Location unknown 59 Man's Head with Beard 1882-83 Munch Museum, Oslo, Norway 60 The Errand Boy 1882-84 Private collection 61 Garden with Red House 1882 Private collection 62 Garden with Red House 1882 Private collection 63 By the Garden Table 1882 Location unknown 64 Akerselva by Slåmotgangen 1882 Private collection 65 Inger by the Window 1882 Private collection 66 Akerselva by Nedre Foss 1882 Location unknown 67 Akerselva 1882 Munch Museum, Oslo, Norway 68 Birch Trees with Woman Walking 1882 Location Unknown 69 Birch Trees in the Autumn 1882 Private collection 70 From Vestre Aker 1882 Location unknown 71 Birch Trees and Man Carrying Twigs 1882 Location unknown 72 Autumn in Vestre Aker 1882 Private collection 73 Woman on a Country Lane 1882 Private collection 74 Two Boys on a Country Lane 1882 Location unknown 75 Thorvald Torgersen 1882 National Gallery, Oslo, Norway 76 Thorvald Torgersen 1882 Private collection 77 Head of a Boy 1882-83 Katharina and Nathan Bernstein, New York 78 Andreas Reading 1882-83 Location unknown 79 Andreas Reading 1882-83 Location unknown 80 Andreas Reading 1882-83 National Gallery, Oslo, Norway 81 Self-Portrait 1882-83 Oslo City Museum, Norway 82 Drive at Vaterland 1882-83 Munch Museum, Oslo, Norway 83 From Saxegårdsgate 1882? Lillehammer Art Museum, Norway. Oscar Johannessen's collection 84 Laura Munch 1883 Munch Museum, Oslo, Norway 85 Otto Linthoe 1883 Munch Museum, Oslo, Norway 86 Study of a Man's Head 1883 Private Collection 87 Study of an Old Man's Head 1883 Private collection, Switzerland 88 Head of an Old Man with Beard 1883 Private collection 89 Study of an Old Man's Head 1883 Burton Kassell 90 Afternoon at Olaf Rye's Square 1883 Moderna Museet, Stockholm 91 Street Corner on Karl Johan, Grand Café 1883 Munch Museum, Oslo, Norway 92 Christian Munch on the Couch 1883 Munch Museum, Oslo, Norway 93 Landscape from Asker 1883-84 Location unknown 94 Autumn in Asker 1883-84 Location unknown 95 Andreas by the Window 1883 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 96 Andreas Reading 1883 Private collection 97 The Dome of Trinity Church 1883-84 Private Collection 98 Study of a Head 1883 National Gallery, Oslo, Norway 99 Early in the Morning 1883 Private Collection 100 Andreas Singdahlsen 1883 Munch Museum, Oslo, Norway 101 Hjalmar Borgstrøm 1883 Private Collection 102 Portrait of a Woman 1883-84 Location unknown 103 Karen Bjølstad in the Rocking Chair 1883 Munch Museum, Oslo, Norway 104 Around the Paraffin Lamp 1883 National Gallery, Oslo, Norway 105 At the Coffee Table 1883 Munch Museum, Oslo, Norway 106 At Supper 1883-84 Munch Museum, Oslo, Norway 107 The Infirmary at Helgelandsmoen 1884 Munch Museum, Oslo, Norway 108 Fence in the Forest 1884 Location unknown 109 Two People on the Way to the Forest 1884 Private collection 110 Morning 1884 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Mayer's collection) 111 Christian Munch 1884 Private collection 112 Portrait Studies 1884? Location unknown 113 Inger Munch in Black 1884 National Gallery, Oslo, Norway 114 Street in Winter 1885 Private collection 115 Ball 1885 Private collection 116 Tête-à-tête 1885 Munch Museum, Oslo, Norway 117 Karl Johan 1885-86 Paleet, Oslo, Norway 118 Girl's Head 1885 Private collection 119 Dagny Konow 1885 Blomqvist Art Dealer, Oslo, Norway 120 Study of an Old Man's Head 1885-86 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 121 Fredrik Lidemark 1885 Private collection 122 Karl Jensen-Hjell 1885 Private collection 123 Klemens Stang 1885-86 Sørlandets Art Museum, Kristiansand, Norway 124 Christian Munch with Pipe 1885 Munch Museum, Oslo, Norway 125 Karen Bjølstad 1885-86 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 126 Jørgen Sørensen 1885 National Gallery, Oslo, Norway 127 Andreas Munch 1885 Private Collection 128 Cabaret 1885-86 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 129 The Sickroom 1885-86 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 130 The Sick Child 1885-86 National Gallery, Oslo, Norway 131 Red-Haired Girl with White Rat 1886 Kunstmuseum Basel - on permanently loan from Die Freunde der Kunstmuseums und des Museums für Gegenwartskunst Basel 132 Girl at the Piano 1886 Munch Museum, Oslo, Norway 133 Self-Portrait 1886 National Gallery, Oslo, Norway 134 Andreas Munch Studying Anatomy 1886 Munch Museum, Oslo, Norway 135 Afternoon Nap 1886 Munch Museum, Oslo, Norway 136 Boat with Three Boys 1886? Munch Museum, Oslo, Norway 137 Man on the Veranda 1886 Kreeger Museum, Washington, DC. USA 138 From Hisøya near Arendal 1886 Location unknown 139 Woman and Children in Arendal 1886 Private collection 140 Thorvald Torgersen 1886 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 141 Puberty 1886 Lost in fire 142 The Day After 1886-89 Lost in a fire in 1890 143 Seated Young Girl Approx. 1887 Private collection 144 Betzy Nilsen 1887 Stolen from the National Gallery of Norway in 1993 145 Halvard Stub Holmboe 1887 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 146 Jacob Torkildsen Approx. 1887 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 147 Forest Landscape with Small Lake 1887 Private collection 148 Veierland near Tønsberg 1887 National Gallery, Oslo, Norway 149 Two Men by the Window Approx. 1887 Private collection 150 Law 1887 Private collection 151 Kristiania Bohemians 1887-88 Lost in a fire in 1907 152 Self-Portrait 1888? Munch Museum, Oslo, Norway 153 Marius Selmer 1888 Location unknown 154 Bendix Lange 1888 Private collection 155 Beach 1888 Munch Museum, Oslo, Norway 156 The Tønsberg Fjord 1888 Private collection 157 On the Pier 1888 Location unknown 158 Man Binding Fishnet 1888 Christian Mustad, Switzerland 159 Karen Bjølstad 1888 Munch Museum, Oslo, Norway 160 Evening 1888 Private collection 161 Summer Day on the Pier 1888 Private collection 162 Laura and Inger in the Summer Sun 1888 Private collection 163 Evening 1888 Museo Thyssen-Bornemisza, Madrid, Spain 164 Inger in Sunshine 1888 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 165 At the General Store in Vrengen 1888 Lillehammer Art Museum, Norway. Oscar Johannessen's collection 166 Andreas Bjølstad 1888 Munch Museum, Oslo, Norway 167 Aasta Carlsen 1888-89 Munch Museum, Oslo, Norway 168 Man Standing in the Doorway 1889 Erik M. Vik 169 Karl Dørnberger 1889 Museum der bildenden Künste, Leipzig, Germany 170 Charlotte Dørnberger 1889 Private collection 171 Georg Stang 1889 Epstein Family Collection, Washington DC, USA 172 John Hazeland on his Deathbed 1889 Private collection 173 Spring 1889 National Gallery, Oslo, Norway 174 Hans Jæger 1889 National Gallery, Oslo, Norway 175 From Karl Johan 1889 Munch Museum, Oslo, Norway 176 Music on Karl Johan 1889 Kunsthaus Zürich, Switzerland 177 Beach Landscape from Åsgårdstrand 1889 Private collection, Bermuda 178 Beach 1889 Private collection 179 From Åsgårdstrand 1889 Location unknown 180 Beach Landscape 1889 Wallraf-Richartz Museum, Cologne, Germany. Fondation Corboud 181 Shore 1889 Private collection 182 Summer Night. Inger on the Beach 1889 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 183 Summer Evening 1889 Statens Museum for Kunst, Copenhagen, Denmark 184 Summer 1889 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 185 Summer in Åsgårdstrand 1889 Location unknown 186 Morten Damme's House near Åsgardstrand 1889 Private collection, USA 187 Standing Female Nude 1889? Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 188 A French Tavern (Two Men and a Woman) 1890 Lost in a fire in the autumn of 1890 189 The Canal near Paris (with a Small Streamboat) 1890 Lost in a fire in the autumn of 1890 190 A Woman (in Half- figure) with Landscape (Returned from Victoria terrasse) 1890? Lost in a fire in the autumn of 1890 191 A Small Beach Study 1890? Lost in a fire on the autumn of 1890 192 Night in Saint-Cloud 1890 National Gallery, Oslo, Norway 193 The Seine at Saint-Cloud 1890 Frances Lehman Loeb Art Center, Vassar College, Poughkeepsie, New York, USA 194 The Seine at Saint-Cloud 1890 Location unknown 195 The Seine at Saint-Cloud 1890 Private collection 196 The Seine at Saint-Cloud 1890 Private collection 197 The Seine at Saint-Cloud 1890 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 198 The Seine at Saint-Cloud 1890 Private collection 199 The Seine at Saint-Cloud 1890 Private collection 200 The Seine at Saint-Cloud 1890 Private collection 201 The Seine at Saint-Cloud 1890 Munch Museum, Oslo, Norway 202 At the Wine Merchant's 1890 Private collection 203 In the Bar 1890 Städtische Galerie im Städelschen Kunstinstitut, Frankfurt am Main, Germany 204 In the Café 1890 Munch Museum, Oslo, Norway 205 Norwegian Spring Landscape 1890 Location Unknown 206 Landscape 1890 Location unknown 207 The Streamboat Arrives 1890 Private collection 208 Beach 1890 Private collection 209 Spring Day on Karl Johan 1890 The Art Museums in Bergen, Norway. Bergen Art Museum (Bergen Billedgalleri) 210 Sunny Day in Åsgårdstrand 1890 Location unknown 211 Garden Path 1890 Location unknown 212 Woman in Evening Landscape 1890 Munch Museum, Oslo, Norway 213 Landscape 1890 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 214 View from Hauketo 1890 Private collection 215 View from Hauketo 1890 Location unknown 216 Landscape 1890 Munch Museum, Oslo, Norway 217 The Absinth Drinkers 1890 Private collection 218 Two Children 1890 Private collection 219 Under the Palm Trees in Nice 1891 Private collection 220 Afternoon on the Promenade des Anglais 1891 Private collection 221 Morning on the Promenade des Anglais 1891 Private collection 222 Sunny Day in Nice 1891 Private collection 223 Rooftops in Nice 1891 Location unknown 224 Night in Nice 1891 National Gallery, Oslo, Norway 225 Fisherboy from Nice 1891 Private collection 226 Fisherboy from Nice 1891-92 Location unknown 227 Fisherboy from Nice 1891 Tina and Andrew Brozman's collection 228 Boy's Head 1891 Moss Kunstforening 229 Young Woman in Blue 1891 Private collection 230 Young Woman in Blue 1891 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasums Meyer's collection) 231 Model Scratching her Arm 1891 Munch Museum, Oslo, Norway 232 Rue Lafayette 1891 National Gallery, Oslo, Norway 233 Rue de Rivoli 1891 Fogg Art Museum, Harvard Art Museums, USA. A gift from Rudolf Serkin 234 Sunday in Åsgardstrand 1891 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 235 Young Blond Girl 1891 Private collection 236 Summer Evening in Åsgardstrand 1891 Location unknown 237 In Open Air 1891 Munch Museum, Oslo, Norway 238 Summer 1891 Location unknown 239 Eroticism on a Summer Evening 1891 Munch Museum, Oslo, Norway 240 Karl Johan in the Rain 1891 Munch Museum, Oslo, Norway 241 Evening. Melancholy 1891 Munch Museum, Oslo, Norway 242 Woman in Blue against Blue Water 1891 Private collection 243 Old Fisherman 1891 Location unknown 244 Pine Forest 1891-92 Private collection 245 Summer Day in the Forest 1891 Location unknown 246 Forest Landscape 1891 Location unknown 247 From Nordstrand 1891 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 248 Landscape in Moonlight 1891 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 249 Woman by the Balustrade 1891 Horten, Norway 250 Inger in a White Blouse 1891 Munch Museum, Oslo, Norway 251 Jappe Nilssen 1891 Private collection 252 Arve Arvesen 1891 Private collection 253 Gunnar Heiberg 1891 Private collection 254 Helge Rode 1891 The Museum of National History, Fredriksborg Palace, Hillerød, Denmark 255 Olga Buhre 1891 Statens Museum for Kunst, Copenhagen, Denmark 256 Alexandra Thaulow 1891 Von der Heydt Museum, Wuppertal, Germany 257 Kiss by the Window 1891 Munch Museum, Oslo, Norway 258 The Day After 1891-92 Probably lost 259 Childhood Memory 1892 Munch Museum, Oslo, Norway 260 Childhood Memory 1892 Location unknown 261 Gamblers in Monte Carlo 1892 Munch Museum, Oslo, Norway 262 Gamblers in Monte Carlo 1892 Private collection 263 At the Roulette Table in Monte Carlo 1892 Munch Museum, Oslo, Norway 264 Sick Mood at Sunset. Despair 1892 Thielska Galleriet, Stockholm, Sweden 265 Cypress in Moonlight 1892 Private collection 266 Kiss by the Window 1892 National Gallery, Oslo, Norway 267 The Kiss 1892 Private collection 268 The Girl by the Window 1892 Probably lost 269 Woman Combing her Hair 1892 The Art Museums in Bergen, Norway. Bergen Art Museum (Rsmus Meyer's collection) 270 Woman Looking in the Mirror 1892 Private collection 271 After the Bath 1892 Erik M. Vik 272 From the Riviera 1892 Munch Museum, Oslo, Norway 273 From the Riviera 1892 Probably lost 274 Moonlight by the Mediterranean 1892 National Gallery, Oslo, Norway 275 A Pine 1892 Private collection 276 Trees by the Mediterranean 1892 Galerie výtvarného umění v Ostravě, Ostrava, Czech Republic 277 From the Riviera 1892 Private collection 278 Men Flocking round Women in Light Clothing 1892 Probably lost 279 Forest 1892 The Art Museums in Bergen. Bergen Art Museum (Stenersen's collection) 280 Moonlight on the Beach 1892 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 281 Mystery on the Shore 1892 Private collection 282 Mystery on the Shore 1892 Sammlung Würth, Künzelsau 283 Two Human Beings. The Lonely Ones 1892 Lost during an explosion on the 9th December 1901 284 Melancholy 1892 National Gallery, Oslo, Norway 285 Night in Saint-Cloud 1892 Private collection 286 Night in Saint- Cloud 1892-93 Private collection 287 Night in Saint-Cloud 1892 Private collection 288 Vision 1892 Munch Museum, Oslo, Norway 289 The Water Lilies 1892-93 Private collection 290 Evening on Karl Johan 1892 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 291 From Nordstrand 1892 Private collection 292 On the Veranda 1892 Munch Museum, Oslo, Norway 293 Inger by the Window 1892 Private collection 294 Inger in Black and Violet 1892 National Gallery, Oslo, Norway 295 Seated Young Woman 1892 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 296 Autumn Rain 1892 Private collection 297 Jakob Bratland 1892 Munch Museum, Oslo, Norway 298 Ludvig Meyer 1892 Trondheim Kunstmuseum, Norway 299 Thor Lütken 1892 Private collection 300 Ragnhild and Dagny Juel 1892-93 Location unknown 301 Portrait of August Strindberg 1892 Moderna Museet, Stockholm, Sweden 302 Night in Saint-Cloud 1893 Private collection 303 The Girl by the Window 1893 Art Institute of Chicago, Illinois, USA 304 Study of a Model 1893 Solomon R. Guggenheim Foundation, New York, USA 305 Separation 1893 Munch Museum, Oslo, Norway 306 Woman with Red Hat 1893-94 Gothenburg Museum of Art, Sweden 307 Symbolic Study 1893-94 Munch Museum, Oslo, Norway 308 Portrait of a Man 1893-94 Munch Museum, Oslo, Norway 309 Woman's head against a red Background 1893-94 Munch Museum, Oslo, Norway 310 Self-Portrait under the Mask of a Woman 1893 Munch Museum, Oslo, Norway 311 Seated Nude and Grotesque Masque 1893 Munch Museum, Oslo, Norway 312 Sunrise in the Harbour 1893-94 Munch Museum, Oslo, Norway 313 Rosa and Amelie 1893 Stenersen Museum, Oslo, Norway. Rolf E. Stenersen's gift to the city of Oslo 314 Sunrise in Åsgårdstrand 1893-94 Private collection 315 Summer Night 1893 The Art Museums in Bergen. Bergen Art Museum (Bergen Billedgalleri) 316 Melancholy 1893 Munch Museum, Oslo, Norway 317 Death at the Helm 1893 Munch Museum, Oslo, Norway 318 Summer Night. Mermaid 1893 Munch Museum, Oslo, Norway 319 Summer Night's Dream. The Voice 1893 Museum of Fine Arts, Boston, Massachusetts, USA 320 Starry Night 1893 The J. Paul Getty Museum, Los Angeles, California, USA 321 Starry Night 1893 Von der Heydt Museum, Wuppertal, Germany 322 Moonlight 1893 National Gallery, Oslo, Norway 323 House in Moonlight 1893-95 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 324 The Storm 1893 Museum of Modern Art, New York, USA 325 Death and Spring 1893 Munch Museum, Oslo, Norway 326 The Angel of Death 1893 Munch Museum, Oslo, Norway 327 By the Deathbed. Fever 1893 Munch Museum, Oslo, Norway 328 Death in the Sickroom 1893 Munch Museum, Oslo, Norway 329 Death in the Sickroom 1893 National Gallery, Oslo, Norway 330 Death in the Sickroom 1893 Munch Museum, Oslo, Norway 331 Vampire 1893 Munch Museum, Oslo, Norway 332 The Scream 1893 Munch Museum, Oslo, Norway 333 The Scream 1893 National Gallery, Oslo, Norway 334 Vampire 1893 Gothenburg Museum of Art, Sweden 335 Vampire 1893 Munch Museum, Oslo, Norway 336 The Hands 1893-94 Munch Museum, Oslo, Norway 337 Dagny Juel Przybyszewska 1893 338 Helge Bäckström 1893 Thielska Galleriet, Stockholm, Sweden 339 Minchen Torkildsen 1893 Location unknown 340 Ragnhild Bäkström 1894 National Gallery, Oslo, Norway 341 Botho Graf Schwerin 1894 Munch Museum, Oslo, Norway 342 Ebehard von Bodenhausen 1894 Location unknown 343 Julius Meier-Graefe 1894 National Gallery, Oslo, Norway 344 Separation 1894 Munch Museum, Oslo, Norway 345 Death and Life 1894 Munch Museum, Oslo, Norway 346 Puberty 1894 Munch Museum, Oslo, Norway 347 Puberty 1894-95 National Gallery, Oslo, Norway 348 The Day After 1894 National Gallery, Oslo, Norway 349 Vampire 1894 Private collection 350 Selma Fontheim 1894 Hamburger Kunsthalle, Hamburg, Germany 351 Selma Fontheim 1894 Barony Rosendal, Kvinnherad, Norway 352 Nora Mengelberg 1894 Private collection 353 Ludvig Meyer's Children 1894 Foundation Gemäldesammlung Emil Bretschger / Kunstmuseum Bern, Switzerland 354 Stanislaw Przybyszewski 1894 Munch Museum, Oslo, Norway 355 Inger in a Red Dress 1894 Harvard Art Museums: Busch-Reisinger Museum, Cambridge, Massachusetts, USA. Gift of Lynn G. Straus in memory of Philip A. StrausInger in a Red Dress 356 Bathing Women 1894 Private collection 357 Bathers 1894 Probably lost 358 Bathing Boys 1894 National Gallery, Oslo, Norway 359 Melancholy 1894 Private collection 360 Melancholy 1894-96 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 361 Woman. Sphinx 1894 Munch Museum, Oslo, Norway 362 Woman 1894 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 363 Anxiety 1894 Munch Museum, Oslo, Norway 364 Despair 1894 Munch Museum, Oslo, Norway 365 Madonna 1894 Munch Museum, Oslo, Norway 366 Madonna 1894-95 National Gallery, Oslo, Norway 367 Madonna 1895 Hamburger Kunsthalle, Hamburg, Germany. Dauerleihgabe der Stiftung zur Förderung der Hamburgischen Kunstsammlungen 368 Madonna 1895-97 Steven A. Cohen 369 Madonna 1895-97 Catherine Woodard and Nelson Blitz jr. 370 Berlin Model 1895 Harvard Art Museums: Busch-Reisinger Museum, Cambridge, Massachusetts, USA 371 Cabaret 1895 Munch Museum, Oslo, Norway 372 The Scream 1895 Leon Black 373 Vampire 1895 Location unknown 374 The Smell of Death 1895 Munch Museum, Oslo, Norway 375 The Smell of Death 1895 Munch Museum, Oslo, Norway 376 At the Deathbed 1895 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 377 Vampire 1895 Munch Museum, Oslo, Norway 378 Ashes 1895 National Gallery, Oslo, Norway 379 Jealousy 1895 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 380 Beach in Åsgårdstrand 1895 Private collection 381 Moonlight 1895 National Gallery, Oslo, Norway 382 Self-Portrait with Cigarette 1895 National Gallery, Oslo, Norway 383 Stanislaw Przybyszewski 1895 Munch Museum, Oslo, Norway 384 Oscar and Ingeborg Heiberg 1895-96 Munch Museum, Oslo, Norway 385 Half-Nude in a Black Skirt 1896 Munch Museum, Oslo, Norway 386 Study of a Nude 1896 Munch Museum, Oslo, Norway 387 Young Woman Washing herself 1896 National Gallery, Oslo, Norway 388 Seated Nude against a Red Background 1896 National Gallery, Oslo, Norway 389 Seated Nude with her Back Turned 1896 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 390 The Mermaid 1896 Philadelphia Museum of Art, Pennsylvania, USA 391 Summer Landscape 1896 Munch Museum, Oslo, Norway 392 The Sick Child 1896 Gothenburg Museum of Art, Sweden 393 Separation 1896 Munch Museum, Oslo, Norway 394 Summer Night. The Voice 1896 Munch Museum, Oslo, Norway 395 The Girl by the Window 1896-97 Private collection 396 Bathing Woman 1896-97 Munch Museum, Oslo, Norway 397 The Kiss 1896-97 Private collection 398 Women in a Swimming Pool 1896-97 Munch Museum, Oslo, Norway 399 Paul Herrmann and Paul Contard 1897 Belvedere, Vienna, Austria 400 The Kiss 1897 Munch Museum, Oslo, Norway 401 The Kiss 1897 Munch Museum, Oslo, Norway 402 Inheritance 1897-99 Munch Museum, Oslo, Norway 403 Women in Hospital 1897 Munch Museum, Oslo, Norway 404 Mother and Daughter 1897-99 Munch Museum, Oslo, Norway 405 Two Women in a Landscape 1897-99 Munch Museum, Oslo, Norway 406 Old Man with a Beard 1897-99 Munch Museum, Oslo, Norway 407 Brothel Scene 1897-99 Munch Museum, Oslo, Norway 408 Hospital Ward 1897-99 Munch Museum, Oslo, Norway 409 Bathing Boys 1897-98 Munch Museum, Oslo, Norway 410 Bathing Boys 1897-99 Private collection 411 Bathing Girls 1897-99 Munch Museum, Oslo, Norway 412 Bathing Children 1897-99 Munch Museum, Oslo, Norway 413 Bathing Boys 1897-99 Private collection 414 Autumn 1897-98 Munch Museum, Oslo, Norway 415 Marie Helene Holmboe 1898 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 416 Female Portrait 1898-99 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasums Meyer's collection) 417 Dark-Haired Man and Red-Haired Woman 1898-99 Munch Museum, Oslo, Norway 418 Holger Drachmann 1898 419 Henrik Ibsen at the 1898 Private collection 420 Study of a Model 1898 Munch Museum, Oslo, Norway 421 Half-Nude in a Blue Skirt 1898 Munch Museum, Oslo, Norway 422 Nude 1898 Location unknown 423 Nude 1898 Munch Museum, Oslo, Norway 424 Two Women. Symbolic Study 1898 Munch Museum, Oslo, Norway 425 Sitting Nude by the Beach 1898 Private collection 426 Man and Woman 1898 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasums Meyer's collection) 427 Nude in Profile towards the Right 1898 Rasmus Meyer's collections 428 Metabolism 1898-99 Munch Museum, Oslo, Norway 429 Tulla Larsen 1898-99 Munch Museum, Oslo, Norway 430 Tulla Larsen 1898-99 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 431 Father and Son 1898 Private collection 432 Seated Nude and Three Male Heads (It is disputed whether this is a real Munch painting or whether it is not. Retrieved 11 July 2014) 1898-99 Kunsthalle Bremen, Germany 433 Tragedy 1898-1900 The Minneapolis Institute of Arts, Minnesota, USA 434 Jealousy in the Bath 1898-1900 Location unknown 435 Beach 1898 Rogaland Kunstmuseum, Norway 436 The Rainbow 1898 Munch Museum, Oslo, Norway 437 Woman by the Sea in Åsgardstrand 1898 Private collection 438 House with Red Virginia Creeper 1898-99 Private collection 439 House with Red Virginia Creeper 1898-99 National Gallery, Oslo, Norway 440 Red Virginia Creeper 1898-1900 Munch Museum, Oslo, Norway 441 The Son 1904 Munch Museum, Oslo, Norway 442 The Coffin is Carried Out 1898-1900 Munch Museum, Oslo, Norway 443 Boulevard in Paris 1898-1900 Munch Museum, Oslo, Norway 444 Winter 1899-1900 Private collection 445 Winter in the Woods, Nordstrand 1899 National Gallery, Oslo, Norway 446 Death and the Child 1899 Munch Museum, Oslo, Norway 447 Death and the Child 1899 Kunsthalle Bremen, Germany 448 Landscape 1899 Munch Museum, Oslo, Norway 449 The Garden 1899 Munch Museum, Oslo, Norway 450 Munch's House and Studio in Åsgardstrand 1899 Private collection 451 Munch's House in Åsgårdstrand 1899 Munch Museum, Oslo, Norway 452 Dark Spruce Forest 1899 Munch Museum, Oslo, Norway 453 Dark Spruce Forest 1899 Munch Museum, Oslo, Norway 454 Dark Spruce Forest 1899 Munch Museum, Oslo, Norway 455 Dark Spruce Forest 1899-1902 Munch Museum, Oslo, Norway 456 Dark Spruce Forest 1899-1902 Munch Museum, Oslo, Norway 457 Aase Nørregaard 1899 National Gallery, Oslo, Norway 458 Aase and Harald Nørregaard 1899 National Gallery, Oslo, Norway 459 Summer Night in Studenterlunden 1899 JAPS Collection, Mexico 460 Dance on the Beach 1899-1900 Národni Galerie, Prague, Czech Republic 461 Eye in Eye 1899-1900 Munch Museum, Oslo, Norway 462 Fertility 1899-1900 Private collection 463 Red and White 1899-1900 Munch Museum, Oslo, Norway 464 Dance of Life 1899-1900 National Gallery, Oslo, Norway 465 Golgatha 1900 Munch Museum, Oslo, Norway 466 Under the Stars 1900-05 Munch Museum, Oslo, Norway 467 Melancholy 1900-01 Munch Museum, Oslo, Norway 468 Train Smoke 1900 Munch Museum, Oslo, Norway 469 Sunset, Nordstrand 1900 Private collection 470 View from Nordstrand 1900 Private collection 471 The Island 1900 Private collection 472 View from Nordstrand 1900-01 Kunsthalle Mannheim,Germany 473 Winter at Nordstrand 1900-01 Private collection 474 New Snow 1900-01 Munch Museum, Oslo, Norway 475 Winter Night 1900-01 Kunsthaus Zürich, Switzerland 476 Winter Night 1900-01 Munch Museum, Oslo, Norway 477 White Night 1900-01 National Gallery, Oslo, Norway 478 Starry Night 1900-01 Museum Folkwang, Essen, Germany 479 Winter Forest 1900-01 Hamburger Kunsthalle, Hamburg, Germany 480 Birch in Snow 1901 Private collection 481 Spring Landscape with Snow Plough 1901 Private collection 482 Landscape with a Road 1901 Private collection 483 The Girls on the Bridge 1901 National Gallery, Oslo, Norway 484 The Girls on the Bridge 1901 Hamburger Kunsthalle, Hamburg, Germany 485 The Book Family 1901 Thielska Galleriet, Stockholm, Sweden 486 Street in Åsgårdstrand 1901 Kunstmuseum Basel, Switzerland. A gift from Sigrid Schwarz von Spreckelsen og Katharina Schwarz 487 Street in Åsgårdstrand 1901 Private collection 488 Street in Åsgårdstrand and a Woman in Red Dress 1901-03 Neue Pinakothek, Munich, Germany 489 Midsummer Night's Eve 1901-03 Private collection 490 Street in Åsgårdstrand with Groups of Men and Women 1901-03 Probably lost after 1910 491 Children Playing in the Street in Åsgårdstrand 1901-03 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 492 Children in the Forest 1901-02 Munch Museum, Oslo, Norway 493 Forest on the Way to Borre 1901-02 Epstein Family Collection, Washington DC, USA 494 Two Children on their way to the Fairytale Forest 1901-02 Munch Museum, Oslo, Norway 495 The Fairytale Forest 1901-02 National Gallery, Oslo, Norway 496 Forest on the Way to Borre 1901-02 Private collection 497 Wilhelm Le Fèvre Grimsgaard 1901 Location unknown 498 Consul Christen Sandberg 1901 Munch Museum, Oslo, Norway 499 Albert Kollmann 1901-02 Kunsthaus Zürich, Switzerland 500 Albert Kollmann and Sten Drewsen 1901-02 Hamburger Kunsthalle, Hamburg, Germany 501 Male Portrait. Herr von R. 1902-04 Location unknown 502 Marta Sandal 1902 Location unknown 503 Nude with Long Red Hair 1902 Munch Museum, Oslo, Norway 504 Nude in Front of the Mirror 1902 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 505 Nude with Red Skirt 1902 Munch Museum, Oslo, Norway 506 Standing Nude 1902 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 507 Nude with Her Back Turned 1902 Munch Museum, Oslo, Norway 508 Morning. Nude at the Window 1902 The Saltzman Family Collection 509 Nude in Interior 1902 Location unknown 510 Nude Seated on the Bed 1902 Staatsgalerie Stuttgart, Germany 511 Two Nudes Standing by a Chest of Drawers 1902-03 Westphalian State Museum of Art and Cultural History, Münster, Germany 512 Blond and Dark-Haired Nude 1902-03 Location unknown 513 Seated Nude 1902-03 Munch Museum, Oslo, Norway 514 Two Nudes 1902-03 National Gallery, Oslo, Norway 515 Bending and upright Nude 1902-03 Munch Museum, Oslo, Norway 516 Three Nudes 1902-03 Munch Museum, Oslo, Norway 517 Seated Nude 1902 Sprengel Museum, Hanover, Germany 518 Seated Nude 1902 Private collection 519 The Hearse on Potsdamer Platz 1902 Munch Museum, Oslo, Norway 520 The Hearse on Potsdamer Platz 1902 Munch Museum, Oslo, Norway 521 Foster Mothers in Court 1902 Munch Museum, Oslo, Norway 522 Sanatorium 1902-03 Munch Museum, Oslo, Norway 523 Jonas Lie with his Family 1902 Munch Museum, Oslo, Norway 524 Fisherman on a Green Meadow 1902 Munch Museum, Oslo, Norway 525 Old Fisherman and his Daughter 1902 Städelscher Museums-Verein e.v., Frankfurt a.M. 526 Fisherman against Yellow Background 1902-03 Gothenburg Municipality, Wernerska villan 527 Man with Straw Hat 1902-03 Munch Museum, Oslo, Norway 528 Fertility 1902-03 Munch Museum, Oslo, Norway 529 Clothes on a Line in Åsgårdstrand 1902 Private collection 530 The Apple Tree 1902 Private collection 531 Landscape with Red House 1902-04 Location unknown 532 Garden 1902-03 Location unknown 533 House in the Summer Night 1902 Private collection, USA 534 Stormy Landscape 1902-03 Private collection 535 The House by the Fjord 1902-05 Private collection 536 Summer Night by the Beach 1902-03 Private collection 537 Trees and Garden Wall in Åsgårdstrand 1902-04 Musée d'Orsay, Paris, France 538 Kiøsterudgården 1902-03 Private collection 539 The Girls in the Bridge 1902 The Pushkin Museum of Fine Arts, Moscow, Russia 540 The Girls on the Bridge 1902 Private collection 541 The Women on the Bridge 1902 The Art Museums in Bergen. Bergen Art Museum (Bergen Billedgalleri) 542 Aase Nørregaard 1902 Munch Museum, Oslo, Norway 543 Four Stages of Life 1902 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 544 Four Girls in Åsgårdstrand 1902 Staatsgalerie Stuttgart, Germany 545 Girl with Red Chequered Dress and Red Hat 1902 Von der Heydt-Museum, Wuppertal, Germany 546 Chopping and Cutting Wood 1902 Location unknown 547 In the Garden 1902 Private collection 548 In the Garden 1902 Munch Museum, Oslo, Norway 549 On the Veranda 1902 National Gallery, Oslo, Norway 550 On the Operating Table 1902-03 Munch Museum, Oslo, Norway 551 Children in a Flowery Meadow 1902 Location unknown 552 Landowner in the Park 1903 Munch Museum, Oslo, Norway 553 The Swamp 1903 Munch Museum, Oslo, Norway 554 Landowner in the Park 1903-04 Munch Museum, Oslo, Norway 555 Bleeding Man and Sunflower 1903 Munch Museum, Oslo, Norway 556 Self-Portrait in Hell 1903 Munch Museum, Oslo, Norway 557 Landscape by Travemünde 1903-04 Munch Museum, Oslo, Norway 558 Spring in Dr. Linde's Garden 1903 Private collection 559 Gardener in Dr. Linde's Garden 1903 Private collection 560 Garden in Lübeck 1903 Munch Museum, Oslo, Norway 561 The Goatcart 1903 Location unknown 562 Lothar Linde in Red Jacket 1903 Museum für Kunst und Kulturgeschichte der Hansestadt Lübeck, Germany. Behnhaus 563 Dr. Linde's Sons 1903 Museum für Kunst und Kulturgeschichte der Hansestadt Lübeck, Germany. Behnhaus 564 Four Girls in Åsgårdstrand 1903 Munch Museum, Oslo, Norway 565 Four Girls in Åsgårdstrand 1903 Munch Museum, Oslo, Norway 566 The Women on the Bridge 1903 Private collection 567 The Women on the Bridge 1903 Thielska Galleriet, Stockholm, Sweden 568 Ingse Vibe 1903 Munch Museum, Oslo, Norway 569 Spruce Forest 1903 Munch Museum, Oslo, Norway 570 Church in Travemünde 1903 Private collection 571 From Travemünde 1903 Museum für Kunst und Kulturgeschichte der Hansestadt Lübeck, Germany. Behnhaus 572 Sailors in Port 1903 Munch Museum, Oslo, Norway 573 Brothel Scene 1903 Munch Museum, Oslo, Norway 574 Merry Company 1903 Munch Museum, Oslo, Norway 575 Christmas in the Brothel 1903-04 Munch Museum, Oslo, Norway 576 Harry Graf Kessler 1904 Private collection 577 Marcel Archinard 1904 Munch Museum, Oslo, Norway 578 The Frenchman. Marcel Archinard 1904 National Gallery, Oslo, Norway 579 Hermann Schlittgen 1904 Munch Museum, Oslo, Norway 580 Summer Night in Studenterlunden 1904 Munch Museum, Oslo, Norway 581 The Drowning Child 1904? Munch Museum, Oslo, Norway 582 Red Rocks by Åsgårdstrand 1904 Munch Museum, Oslo, Norway 583 Beach with Rocks 1904-05 Munch Museum, Oslo, Norway 584 Beach 1904 Munch Museum, Oslo, Norway 585 Beach 1904 Wadsworth Atheneum Museum, Hartford, Connecticut, USA. The Ella Gallup Summer and Mary Catlin Summer Collection Fund 586 Moonlight on the Beach 1904 Munch Museum, Oslo, Norway 587 Beach with two Seated Women 1904 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 588 Rowing Boat on the Sea 1904 Private collection 589 Bathing Young Men 1904 Munch Museum, Oslo, Norway 590 Bathing Young Men Approx. 1904 Munch Museum, Oslo, Norway 591 Bathing Young Men 1904? Munch Museum, Oslo, Norway 592 Bathing Boys 1904-05 Private collection 593 Bathing Boys 1904-05 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 594 Bathing Scene from Åsgårdstrand 1904/1936 Private collection 595 Venus 1904-05 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo. 596 House in Borre 1904-05 Private collection 597 Coastal Landscape 1904 Location unknown 598 Landscape 1904 Munch Museum, Oslo, Norway 599 The Garden in Åsgårdstrand 1904-05 Private collection 600 Fruit harvest 1904-05 Munch Museum, Oslo, Norway 601 The garden in Sunshine 1904 Location unknown 602 Two Girls with Blue Aprons 1904-05 Munch Museum, Oslo, Norway 603 The Funeral 1904-05 Munch Museum, Oslo, Norway 604 The Women on the Bridge 1904/1927 Munch Museum, Oslo, Norway 605 Young Woman under the Apple Tree 1904 Carnegie Museum of Art, Pittsburgh, Pennsylvania, USA. Acquired from Mrs. alan M. Scaife and family 606 Young Woman among Greenery 1904 Private collection 607 Summer in the Park (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 608 Young People on the Beach (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 609 Trees by the Beach (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 610 Kissing Couples in the Park (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 611 Girls picking Fruit (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 612 Girls watering Flowers (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 613 Embrace on the Beach (The Linde Frieze) 1904 Private collection 614 Dance on the Beach (The Linde Frieze) 1904 Munch Museum, Oslo, Norway 615 Sun Flower (The Linde Frieze) 1904 Probably lost 616 Hollyhock (The Linde Frieze) 1904 Probably lost 617 Young Girl in Blue 1904 Private collection 618 Max Linde 1904 Stiftung Moritzburg, Kunstmuseum des Landes Sachen-Anhalt, Germany 619 Max Linde in Sailing Outfit 1904 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 620 Self-Portrait against Two-Coloured Background 1904 Private collection 621 Self-Portrait with Brushes 1904 Munch Museum, Oslo, Norway 622 Ellen Warburg 1905 Kunsthaus Zürich, Switzerland 623 Spring in Åsgårdstrand 1905 Location unknown 624 Kiøsterudgården in Åsgårdstrand 1905 Private collection 625 Early Spring 1905 Private collection 626 Early Spring in Åsgårdstrand 1905 Munch Museum, Oslo, Norway 627 Spring Landscape 1905 Private collection 628 Beach Landscape 1905 Private collection 629 The Road to Borre 1905 Munch Museum, Oslo, Norway 630 Trees and Torpedo Boat 1905 Munch Museum, Oslo, Norway 631 Cherry Tree in Blossom 1905 Fram Trust, USA 632 House in Åsgprdstrand 1905 Location unknown 633 Cherry Tree in Blossom and Young Girls in the Garden 1905 Munch Museum, Oslo, Norway 634 Two Young Girls in the Garden 1905 Museum Boijmans van Beuningen, Rotterdam, Netherlands 635 Ludvig Karsten 1905 Thielska Galleriet, Stockholm, Sweden 636 Beach Landscape with Trees and Boats 1905-06 Munch Museum, Oslo, Norway 637 Beach Landscape with Trees and Boats 1905-06 Munch Museum, Oslo, Norway 638 Three Girls in Åsgårdstrand 1905 639 The Girls on the Bridge 1905 Wallraf-Richartz Museum, Cologne, Germany 640 Two Human Beings. The Lonely Ones 1905 Private collection 641 Taarbæk Harbour 1905 Munch Museum, Oslo, Norway 642 Garden in Taarbæk 1905 Eric Owen Arneberg 643 Caricature Portrait of Henrik Lund 1905 Munch Museum, Oslo, Norway 644 Original Man 1905 Munch Museum, Oslo, Norway 645 Self- Portrait against a Green Background 1905 Munch Museum, Oslo, Norway 646 Caricature Portrait of Tulla Larsen 1905 Munch Museum, Oslo, Norway 647 Head by Head 1905 Munch Museum, Oslo, Norway 648 Head by Head 1905 Munch Museum, Oslo, Norway 649 Self-Portrait with Moustache and Starched Collar 1905 National Gallery, Oslo, Norway 650 Self-Portrait in Broad Brimmed Hat 1905-06 Munch Museum, Oslo, Norway 651 Esche's Children 1905 Kunsthaus Zürich, Switzerland. Eigentum der Herbert Eugen Esche-Stiftung 652 Edmute Esche with Doll 1905 Private collection 653 Hans Herbert Esche with Nanny 1905 Location unknown 654 Edmute Esche 1905 Kunsthaus Zürich, Switzerland. Eigentum der Herbert Eugen Esche-Stiftung 655 Hanni Esche 1905 Probably lost 656 Hanni Esche 1905 Bavarian State Picture Collection, Neue Pinakothek, Munich, Germany. On loan from a private collection 657 Herbert Esche 1905 Kunsthaus Zürich, Switzerland. Eigentum der Herbert Eugen Esche-Stiftung 658 Herbert Esche 1905 Kunsthaus Zurich, Switzerland. Eigentum der Herbert Eugen Esche- Stiftung 659 View across Chemnitzal 1905 Kunsthaus Zürich, Switzerland. Eigentum der Herbert Eugen Esche-Stiftung 660 From Thüringerwald 1905 Munch Museum, Oslo, Norway 661 Elgersburg 1905 Munch Museum, Oslo, Norway 662 Road in Thüringen 1905 Munch Museum, Oslo, Norway 663 From Thüringerwald 1905 Private collection, Dallas 664 Card Players in Elgersburg 1905 Munch Museum, Oslo, Norway 665 Woman with Sick Child. Inheritance 1905-06 Munch Museum, Oslo, Norway 666 Drinkers 1906 Munch Museum, Oslo, Norway 667 Charwomen at the Mutiger Ritter Hotel in Kösen 1906 Munch Museum, Oslo, Norway 668 Charwomen on the Stairs 1906 Munch Museum, Oslo, Norway 669 Winter Landscape, Thüringen 1906 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 670 Snow Landscape, Thüringen 1906 Thielska Galleriet, Stockholm, Sweden 671 Snow Landscape, Thüringen 1906 Von der Heydt Museum, Wuppertal, Germany 672 Snow Landscape, Thüringen 1906 Private collection 673 Winter. Elgersburg 1906 Munch Museum, Oslo, Norway 674 Small Town Street in Snow 1906 Sprengel Museum, Hannover, Germany 675 Children and Ducks 1906 Munch Museum, Oslo, Norway 676 New Snow in the Avenue 1906 Munch Museum, Oslo, Norway 677 Children on the Street 1906 Munch Museum, Oslo, Norway 678 Mother with Children, Thüringen 1906 Private collection 679 Mothers with Children, Thüringen 1906 Private collection 680 The Oak 1906 Thielska Galleriet, Stockholm, Sweden 681 Chestnut Trees 1906 Munch Museum, Oslo, Norway 682 Park 1906 Munch Museum, Oslo, Norway 683 Park in Kösen 1906 Private collection 684 Park in Kösen 1906 Österreichische Galerie Belvedere, Wien, Austria 685 Park Landscape 1906 Munch Museum, Oslo, Norway 686 Felix Auerbach 1906 Location unknown 687 Self-Portrait against Red Background 1906 Munch Museum, Oslo, Norway 688 Self-Portrait With a Bottle of Wine 1906 Munch Museum, Oslo, Norway 689 Friedrich Nietzsche 1906 Munch Museum, Oslo, Norway 690 Friedrich Nietzsche 1906 Thielska Galleriet, Stockholm, Sweden 691 Friedrich Nietzsche 1906 Munch Museum, Oslo, Norway 692 Elisabeth Förster-Nietzsche 1906 Munch Museum, Oslo, Norway 693 Elisabeth Förster-Nietzsche 1906 Thielska Galleriet, Stockholm, Sweden 694 Albert Kollmann 1906 Munch Museum, Oslo, Norway 695 Harry Graf Kessler 1906 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 696 Harry Graf Kessler 1906 Neue Nationalgalerie, Berlin, Germany 697 Mrs. Schwarz 1906 The Art Museums in Bergen. Bergen Art Museum (Rasmus Meyer's collection) 698 Mrs. Schwarz 1906 National Gallery, Oslo, Norway 699 Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 700 Set Design for Henrik Ibsen's Ghosts 1906 Kunstmuseum Basel, Switzerland 701 Set Design for Henrik Ibsen's Ghosts 1906 Location unknown 702 Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 703 Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 704 Set Design for Henrik Ibsen's Ghosts 1906 Location unknown 705 Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 706 Set Design for Henrik Ibsen's Ghosts 1906 Galleri Faurschou, Copenhagen, Denmark 707 Set Design for Henrik Ibsen's Ghosts 1906 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 708 Set Design for Henrik Ibsen's Ghosts 1906 Private collection 709 Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 710 Set Design for Henrik Ibsen's Ghosts 1906 Location unknown 711 Fjord Landscape. Set Design for Henrik Ibsen's Ghosts 1906 Munch Museum, Oslo, Norway 712 Woman 1906-07 Munch Museum, Oslo, Norway 713 Woman in White Sitting on the Beach 1906-07 Munch Museum, Oslo, Norway 714 Melancholy. Weeping Woman on the Beach 1906 Munch Museum, Oslo, Norway 715 Three Seated Young Women 1906-07 Munch Museum, Oslo, Norway 716 Kiss 1906-07 Stenersen Museum. A gift from Rolf E. Stenersen to the city of Oslo 717 Separation 1906-07 Munch Museum, Oslo, Norway 718 Woman Picking Fruit 1906-07 Munch Museum, Oslo, Norway 719 Two Women on the Road 1906-09 Munch Museum, Oslo, Norway 720 Dance by the Sea 1906-07 Munch Museum, Oslo, Norway 721 Desire 1906-07 Munch Museum, Oslo, Norway 722 Moonlight on the Beach 1906-07 Munch Museum, Oslo, Norway 723 By the Sea 1906-07 Private collection 724 Groups of People on the Beach 1906 Probably lost 725 Moonlight on the Sea (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 726 Two Young Women in Red and White (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 727 Trees by the Sea (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 728 Summer Night (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 729 Desire (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 730 Dance on the Beach (The Reinhardt Frieze) 1906-07 Priavate collection 731 Kiss on the Beach (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 732 Young Women Picking Fruit (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 733 Sun Flower (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 734 Young Women on the Beach (The Reinhardt Frieze) 1906-07 Hamburger Kunsthalle, Hamburg, Germany 735 Two Human Beings. The Lonely ones (The Reinhardt Frieze) 1906-07 Museum Folkwang, Essen, Germany 736 Melancholy (The Reinhardt Frieze) 1906-07 Neue Nationalgalerie, Berlin, Germany 737 Set Design for Henrik Ibsen's \"Hedda Gabler\" 1906-07 Munch Museum, Oslo, Norway 738 Set Design for Henrik Ibsen's \"Hedda Gabler\" 1906-07 Munch Museum, Oslo, Norway 739 Set Design for Henrik Ibsen's \"Hedda Gabler\" 1906-07 Munch Museum, Oslo, Norway 740 Woman Standing in the Doorway 1906-07 Munch Museum, Oslo, Norway 741 Murder 1906 Munch Museum, Oslo, Norway 742 The Murderess 1906 Munch Museum, Oslo, Norway 743 The Death of Marat 1906-07 Munch Museum, Oslo, Norway 744 Walter Rathenau 1907 Stiftung Stadtmuseum Berlin, Germany. Acquired with support from Siemens Kunstfond 745 Walter Rathenau 1907 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 746 Ernest Thiel 1907 Thielska Galleriet, Stockholm, Sweden 747 Ernest Thiel 1907 Thielska Galleriet, Stockholm, Sweden 748 The Harbour in Lübeck 1907 Kunsthaus Zürich, Switzerland 749 The Coast near Lübeck 1907 National Gallery in Prague, Czech Republic 750 Lübeck with the Holstentor 1907 Neue Nationalgalerie, Berlin, Germany 751 Rodin's \"Le Penseur\" in Dr. Linde's Garden 1907 Musée Rodin, Paris, France 752 Self-Portrait in Profile 1907 Munch Museum, Oslo, Norway 753 Female Portrait 1907 Munch Museum, Oslo, Norway 754 Portrait of an Old Man 1907 Munch Museum, Oslo, Norway 755 Old Man in Warnemünde 1907 Munch Museum, Oslo, Norway 756 Boy from Warnemünde 1907 Private collection 757 Street in Warnemünde 1907 Munch Museum, Oslo, Norway 758 Women and Children in Warnemünde 1907 Munch Museum, Oslo, Norway 759 The Drowned Boy 1907-08 Munch Museum, Oslo, Norway 760 Worker and Child 1907 Munch Museum, Oslo, Norway 761 Mason and Mechanic 1907-08 Munch Museum, Oslo, Norway 762 Bath 1907 Private collection 763 Bathing Men 1907 Munch Museum, Oslo, Norway 764 Bathing Men 1907 Österreichische Galerie Belvedere, Wien, Austria 765 Bathing Men 1907 Munch Museum, Oslo, Norway 766 Bathing Men 1907-08 Ateneum, Helsinki, Finland 767 The Death of Marat 1907 Munch Museum, Oslo, Norway 768 The Death of Marat 1907 Munch Museum, Oslo, Norway 769 Cupid and Psyche 1907 Munch Museum, Oslo, Norway 770 Consolation 1907 Munch Museum, Oslo, Norway 771 Woman with Children 1907 Munch Museum, Oslo, Norway 772 Cupido 1907 Munch Museum, Oslo, Norway 773 Weeping Woman 1907 Munch Museum, Oslo, Norway 774 Weeping Woman 1907 Munch Museum, Oslo, Norway 775 Weeping Woman 1907-09 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 776 Weeping Woman 1907 Munch Museum, Oslo, Norway 777 Weeping Woman 1907-09 Munch Museum, Oslo, Norway 778 Rosa Meissner 1907 Hiroshima Museum of Art, Japan 779 Olga and Rosa Meissner 1907 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 780 Olga and Rosa Meissner 1907 Munch Museum, Oslo, Norway 781 Zum Süssen Mädel 1907 Munch Museum, Oslo, Norway 782 Taken by Surprise 1907 Munch Museum, Oslo, Norway 783 Jealousy 1907 Munch Museum, Oslo, Norway 784 Jealousy 1907? Munch Museum, Oslo, Norway 785 Desire 1907 Munch Museum, Oslo, Norway 786 The Murderess 1907 Munch Museum, Oslo, Norway 787 Hatred 1907 Munch Museum, Oslo, Norway 788 Jealousy 1907? Munch Museum, Oslo, Norway 789 Man and Woman on the Beach 1907 Munch Museum, Oslo, Norway 790 The Sick Child 1907 Thielska Galleriet, Stockholm, Sweden 791 The Sick Child 1907 Tate Modern, London, England 792 Kristiania Bohemians 1907? Munch Museum, Oslo, Norway 793 Canal in Warnemünde 1908 Munch Museum, Oslo, Norway 794 \"Am Strom\", Warnemünde 1908 Munch Museum, Oslo, Norway 795 Three Small Girls on the Beach 1908 Munch Museum, Oslo, Norway 796 Canal In Warnemünde 1908 Munch Museum, Oslo, Norway 797 Canal in Warnemünde 1908 Munch Museum, Oslo, Norway 798 Trees by the Canal 1908 Munch Museum, Oslo, Norway 799 Attraction in the Landscape 1908 Munch Museum, Oslo, Norway 800 Head by Head in Landscape 1908 Munch Museum, Oslo, Norway 801 Canal at Sunset 1908 Munch Museum, Oslo, Norway 802 Canal with Dark Clouds 1908 Munch Museum, Oslo, Norway 803 Self-Portrait against a Blue Sky 1908 Munch Museum, Oslo, Norway 804 Study of a Young Man's Head 1908 Munch Museum, Oslo, Norway 805 Seascape from Warnemünde 1908 Munch Museum, Oslo, Norway 806 Waves 1908 Munch Museum, Oslo, Norway 807 Waves 1908 Munch Museum, Oslo, Norway 808 Young Man on the Beach 1908 Munch Museum, Oslo, Norway 809 Young Man on the Beach 1908 Munch Museum, Oslo, Norway 810 Young Man on the Beach 1908 Munch Museum, Oslo, Norway 811 Youth 1908 Munch Museum, Oslo, Norway 812 Old Age 1908 Munch Museum, Oslo, Norway 813 Childhood 1908 Munch Museum, Oslo, Norway 814 Childhood 1908 Munch Museum, Oslo, Norway 815 Old Man 1908 Munch Museum, Oslo, Norway 816 Old Man 1908-11 Munch Museum, Oslo, Norway 817 Bathers 1908-11 Munch Museum, Oslo, Norway 818 Gustav Schiefler 1908 Private collection 819 Gustav Schiefler 1908 Ateneum, Helsinki, Finland 820 Daniel Jacobsen 1908 Statens Museum for Kunst, Copenhagen, Denmark 821 Daniel Jacobsen 1908-09 Munch Museum, Oslo, Norway 822 Daniel Jacobsen 1908-09 Munch Museum, Oslo, Norway 823 Helge Rode 1908 Munch Museum, Oslo, Norway 824 Helge Rode 1908 Moderna Museet, Stockholm, Sweden 825 Self-Portrait in the Clinic 1909 The Art Museums in Bergen, Norway. Bergen Art Museum (Rasmus Meyer's collection) 826 Nurses Holding a Sheet 1909 Location unknown 827 Pernille Kirkeby 1909 Private collection 828 Pernille Kirkeby 1909 Private collection 829 Weeping Woman 1909 Westphalian State Museum of Art and Cultural History, Münster, Germany 830 Spring in Kragerø 1909 Munch Museum, Oslo, Norway 831 Prams under High Trees 1909-10 Munch Museum, Oslo, Norway 832 Jappe Nilssen 1909 Munch Museum, Oslo, Norway 833 Jappe Nilssen 1909 Munch Museum, Oslo, Norway 834 Torvald Stang 1909 Munch Museum, Oslo, Norway 835 Ludvig Ravensberg 1909 Munch Museum, Oslo, Norway 836 Christian Gierløff 1909 Gothenburg Museum of Art, Sweden 837 Jens Thiis 1909 Munch Museum, Oslo, Norway 838 Torvald Stang and Edvard Munch 1909-11 Munch Museum, Oslo, Norway 839 Sigurd Høst 1909-11 Private collection 840 Adam and Eve 1909? Munch Museum, Oslo, Norway 841 Adam and Eve 1909 Munch Museum, Oslo, Norway 842 Garden in Kragerø 1909 Munch Museum, Oslo, Norway 843 Trees by the Sea 1909-12 Munch Museum, Oslo, Norway 844 Garden in Kragerø 1909 Private collection 845 Two Women under a Tree 1909-12 Munch Museum, Oslo, Norway 846 Sigurd Slembe 1909 Munch Museum, Oslo, Norway 847 Sitting on a Cloud () 1909 Munch Museum, Oslo, Norway 848 Village by the Sea 1909-11 Munch Museum, Oslo, Norway 849 Ship Being Scrapped 1909-11 Kunsthaus Zürich, Switzerland. A gift from Alfred Rütschi in 1929 850 Ship being Scrapped 1909-11 Munch Museum, Oslo, Norway 851 Dance 1909-11 Munch Museum, Oslo, Norway 852 People Gathering around a Man in Red 1909-11 Munch Museum, Oslo, Norway 853 Nude Figures on the Beach 1909-11 Munch Museum, Oslo, Norway 854 Woman Hurrying Downwards 1909-11 Munch Museum, Oslo, Norway 855 Henrik Ibsen at the Grand Café 1909-10 Munch Museum, Oslo, Norway 856 Jonas Lie with his Family 1909 Munch Museum, Oslo, Norway 857 Bjørnstjerne Bjørnson Speaking to the People 1909 Munch Museum, Oslo, Norway 858 Bjørnstjerne Bjørnson Speaking to the People 1909 Munch Museum, Oslo, Norway 859 Geniuses: Ibsen, Nietzsche and Socrates 1909 Munch Museum, Oslo, Norway 860 The Geniuses 1909 Munch Museum, Oslo, Norway 861 Medicine 1909 Munch Museum, Oslo, Norway 862 Old Man Sitting under a Tree 1909 Munch Museum, Oslo, Norway 863 The Human Mountain 1909 Munch Museum, Oslo, Norway 864 Astronomy, History and Geography 1909 Munch Museum, Oslo, Norway 865 Astronomy 1909 Munch Museum, Oslo, Norway 866 Astronomy 1909 Munch Museum, Oslo, Norway 867 Geography 1909 Munch Museum, Oslo, Norway 868 Death and Crystallization 1909 Munch Museum, Oslo, Norway 869 Physics 1909 Munch Museum, Oslo, Norway 870 Chemistry 1909 Munch Museum, Oslo, Norway 871 Chemistry 1909 Munch Museum, Oslo, Norway 872 The Beggar 1909-10 Munch Museum, Oslo, Norway 873 Workers in Snow 1909-10 Munch Museum, Oslo, Norway 874 Workers in Snow 1910 Private collection; on loan to The National Museum of Western Art, Tokyo, Japan 875 Galloping Horse 1910-12 Munch Museum, Oslo, Norway 876 Walking in Snow 1910-12 Munch Museum, Oslo, Norway 877 Sailors in Snow 1910-12 Munch Museum, Oslo, Norway 878 People and Timber Transport in a Kragerø Street 1910-12 Munch Museum, Oslo, Norway 879 Man with a Sledge 1910-12 Munch Museum, Oslo, Norway 880 Uphill with a Sledge 1910-12 Munch Museum, Oslo, Norway 881 Black and Yellow Man in Snow 1910-12 Munch Museum, Oslo, Norway 882 Børre by the Window 1910-11 Munch Museum, Oslo, Norway 883 Børre Eriksen 1910-11 Munch Museum, Oslo, Norway 884 Børre Eriksen 1910-11 Munch Museum, Oslo, Norway 885 Old Fisherman on Snow-covered Coast 1910-11 Munch Museum, Oslo, Norway 886 Ship's Deck in Storm 1910-12 Munch Museum, Oslo, Norway 887 Winter Landscape from Kragerø 1910 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 888 Snowstorm by the Sea 1910-12 Munch Museum, Oslo, Norway 889 Winter by the Sea 1910-13 Munch Museum, Oslo, Norway 890 Winter in Kragerø 1910-12 Munch Museum, Oslo, Norway 891 Spring Work in the Skerries 1910 Munch Museum, Oslo, Norway 892 Spring Work in the Skerries 1910-14 Munch Museum, Oslo, Norway 893 Children in the Street 1910-15 Munch Museum, Oslo, Norway 894 The House in the Skerries 1910-15 Munch Museum, Oslo, Norway 895 Train Smoke 1910 Private collection, USA 896 The Scream 1910? Munch Museum, Oslo, Norway 897 Groups of People on the Beach 1910 Munch Museum, Oslo, Norway 898 Youth 1910 Museum Folkwang, Essen, Germany 899 Fruit Trees in Blossom 1910-11 Munch Museum, Oslo, Norway 900 Trees and Buttercups 1910-11 Location unknown 901 Young Woman and Buttercups 1910 Private collection 902 Children on the Crag 1910 Munch Museum, Oslo, Norway 903 Street in Kragerø 1910 Munch Museum, Oslo, Norway 904 Street in Kragerø 1910-11 Private collection, South America 905 Rain at the Coast 1910-11 Private collection 906 The Murderer 1910 Munch Museum, Oslo, Norway 907 Road near Kragerø 1910-11 Munch Museum, Oslo, Norway 908 Nude Couple on the Beach 1910-16 Munch Museum, Oslo, Norway 909 Two Old Men 1910 Waldemarsudde, Stockholm, Sweden 910 Ida Roede 1910 Lillehammer Art Museum, Norway. Einar Lunde's collection 911 The Human Mountain 1909-10 Munch Museum, Oslo, Norway 912 The Human Mountain 1909-10 Munch Museum, Oslo, Norway 913 The Human Mountain 1909-10 Munch Museum, Oslo, Norway 914 The Human Mountain 1909-10 Munch Museum, Oslo, Norway 915 Old Men in Sun Light 1909-10 Munch Museum, Oslo, Norway 916 Naked Old Man 1909-10 Munch Museum, Oslo, Norway 917 History 1909-10 The University of Oslo 918 History 1910 Munch Museum, Oslo, Norway 919 History 1910-11 Munch Museum, Oslo, Norway 920 History 1910 Munch Museum, Oslo, Norway 921 History: Study for the Old Man 1910 Munch Museum, Oslo, Norway 922 History: Study for the Old Man 1910 Munch Museum, Oslo, Norway 923 History: Study for the Old Man and Two Boys 1910 Munch Museum, Oslo, Norway 924 The Source 1910 Munch Museum, Oslo, Norway 925 The Tree of Life 1910 Munch Museum, Oslo, Norway 926 The Sun and Awakening Nude Men 1910-11 Munch Museum, Oslo, Norway 927 The Sun 1910 Munch Museum, Oslo, Norway 928 People in Sunshine 1910 Munch Museum, Oslo, Norway 929 People in Sunshine 1910 Munch Museum, Oslo, Norway 930 Wandering towards the Light 1910 Munch Museum, Oslo, Norway 931 Seated Naked Man 1910 Munch Museum, Oslo, Norway 932 The Tree of Life 1910 Munch Museum, Oslo, Norway 933 The Tree of Life 1910 Munch Museum, Oslo, Norway 934 The Tree of Life: Left Part 1910 Munch Museum, Oslo, Norway 935 The Tree of Life: Right Part 1910 Munch Museum, Oslo, Norway 936 Life: Left Part 1910 Munch Museum, Oslo, Norway 937 Life Right Part 1910 Munch Museum, Oslo, Norway 938 Life 1910 Oslo City Hall 939 Harvesting Women 1910-14 Munch Museum, Oslo, Norway 940 Nude Woman Stretching her Arms in the Air 1910-11 Munch Museum, Oslo, Norway 941 Harvesting Women 1910-11 Munch Museum, Oslo, Norway 942 Harvesting Women 1910-11 943 Standing Naked Man. The Source 1910-11 Munch Museum, Oslo, Norway 944 The Source 1910-11 Munch Museum, Oslo, Norway 945 New Rays 1910-13 Munch Museum, Oslo, Norway 946 New Rays 1910-11 Munch Museum, Oslo, Norway 947 Chemistry 1910-11 Munch Museum, Oslo, Norway 948 Chemistry 1910-11 Munch Museum, Oslo, Norway 949 Woman with Children 1910 Munch Museum, Oslo, Norway 950 The Researchers 1910 Munch Museum, Oslo, Norway 951 The Researchers 1910 Munch Museum, Oslo, Norway 952 The Researchers: Study for a Seated Boy 1910 Munch Museum, Oslo, Norway 953 The Sun 1910 Munch Museum, Oslo, Norway 954 The Sun 1910-12 Munch Museum, Oslo, Norway 955 The Sun 1910-13 Munch Museum, Oslo, Norway 956 The Sun 1910-13 Munch Museum, Oslo, Norway 957 The Sun 1910-13 Munch Museum, Oslo, Norway 958 The Sun 1910-11 Munch Museum, Oslo, Norway 959 History 1910-11 Munch Museum, Oslo, Norway 960 The Researchers 1910-11 Munch Museum, Oslo, Norway 961 The Researchers: Left Part with Playing children 1910 Munch Museum, Oslo, Norway 962 The Researchers: Central Group with Alma Mater 1910 Munch Museum, Oslo, Norway 963 The Researchers: Right Part with Sitting Boy 1910 Munch Museum, Oslo, Norway 964 The Researchers: Group of Children Standing 1910-14 Munch Museum, Oslo, Norway 965 The Researchers: Boy Lying on his Stomach 1910-14 Munch Museum, Oslo, Norway 966 The Researchers: Group of Children Standing 1910-14 Munch Museum, Oslo, Norway 967 The Researchers: Children's Feet 1910-14 Munch Museum, Oslo, Norway 968 History 1911/1914-16 University of Oslo, The Aula 969 The Researchers 1911/1925-27? Munch Museum, Oslo, Norway 970 The Sun 1911 University of Oslo, The Aula 971 The Pathfinder 1911 Probably lost 972 The Sower 1911 Probably lost 973 Young Woman Walking towards the Sun 1911 Probably lost 974 Young Man Walking towards the Sun 1911 Probably lost 975 Men Turning towards the Sun 1911-14 Munch Museum, Oslo, Norway 976 Women Turning towards the Sun 1911-14 Munch Museum, Oslo, Norway 977 The Pathfinder 1911-12 Munch Museum, Oslo, Norway 978 Melancholy 1911 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 979 Man and Woman by the Window with Potted Plants 1911 Munch Museum, Oslo, Norway 980 Large and Small Dog 1911-12 Munch Museum, Oslo, Norway 981 Two Dogs 1911-12 Malmö Art Museum, Sweden 982 Two Boys on the Beach 1911 Private collection 983 Pine Trees by the Sea 1911-13 Munch Museum, Oslo, Norway 984 Pine Trees and Fruit Trees in Blossom 1911 Munch Museum, Oslo, Norway 985 Pine Trees and Fruit Trees in Blossom 1911 Munch Museum, Oslo, Norway 986 Pine Trees and Fruit Trees in Blossom 1911 Munch Museum, Oslo, Norway 987 Morning in the Garden 1911-12 Munch Museum, Oslo, Norway 988 Waves against the Shore 1911-12 Munch Museum, Oslo, Norway 989 Beach Study 1911-12 Munch Museum, Oslo, Norway 990 Buding Leaves 1911-15 Private collection 991 Geese in the Garden 1911 Collectión Carmen Thyssen-Bornemisza en depósito en el Museuo Thyssen-Bornemisza, Madrid, Spain 992 Self-Portrait with Hands under Cheek 1911 Munch Museum, Oslo, Norway 993 Ingeborg Kaurin 1911-12 Munch Museum, Oslo, Norway 994 Ingeborg Kaurin 1911-12 Munch Museum, Oslo, Norway 995 Summer in Kragerø 1911 Private collection 996 Horse in Landscape 1912 Private collection 997 Winter in Kragerø 1912 Munch Museum, Oslo, Norway 998 Snow Landscape from Kragerø 1912 Fram Trust, USA 999 Snow Landscape from Kragerø 1912 Private Collection 1000 Felled Trees 1912 Private collection 1001 Felling Area 1912 Private collection 1002 The Yellow Log 1912 Munch Museum, Oslo, Norway 1003 Forest in Snow 1912 Munch Museum, Oslo, Norway 1004 Forest 1912 Location unknown 1005 Houese in Kragerø 1912 Location unknown 1006 Kragerø in Spring 1912 Munch Museum, Oslo, Norway 1007 Avenue in Kragerø 1912-13 Private collection 1008 Landscape from Kragerø 1912 The Metropolitan Museum of Art, New York City, New York, USA. Bequest of Scotfield Thayer, 1982 1009 Ingeborg Kaurin 1912 Munch Museum, Oslo, Norway 1010 Ingeborg in Green 1912 Museum of Fine Arts, Boston, Massachusetts, USA. Tompkins Collection - Arthur Gordon Tompkins Fund 1011 Footbath 1912-13 Munch Museum, Oslo, Norway 1012 Footbath 1912-13 Munch Museum, Oslo, Norway 1013 Model in Green and Blue 1912-15 Munch Museum, Oslo, Norway 1014 Ingeborg with her Arms behind her Back 1912-13 Munch Museum, Oslo, Norway 1015 Two Sisters 1912-13 Munch Museum, Oslo, Norway 1016 Old Man in an Interior 1912-13 Munch Museum, Oslo, Norway 1017 Jensen with a Duck 1912 Private collection 1018 Jensen with Slaughtered Duck 1912 Munch Museum, Oslo, Norway 1019 The Sun 1912 Munch Museum, Oslo, Norway 1020 The Sun 1912-13 Munch Museum, Oslo, Norway 1021 Alma Mater 1912-13 Munch Museum, Oslo, Norway 1022 History 1912-13 Munch Museum, Oslo, Norway 1023 Women Turned towards the Sun 1912-13 Munch Museum, Oslo, Norway 1024 The Source 1912-13 Munch Museum, Oslo, Norway 1025 Men Turned towards the Sun 1912-13 Munch Museum, Oslo, Norway 1026 Harvesting Women 1912-13 Munch Museum, Oslo, Norway 1027 Chemistry 1912-13 Munch Museum, Oslo, Norway 1028 New Rays 1912-13 Munch Museum, Oslo, Norway 1029 The Sower 1912-13 Munch Museum, Oslo, Norway 1030 The Sower 1912-13 Munch Museum, Oslo, Norway 1031 The Pathfinder 1912-13 Munch Museum, Oslo, Norway 1032 The Pathfinder 1912-13 Munch Museum, Oslo, Norway 1033 Boy in Rocky Landscape 1912-15 Detroit Institute of Arts‚ Michigan, USA 1034 Alma Mater: Portrait Study 1912-14 Munch Museum, Oslo, Norway 1035 Alma Mater: Study 1912-14 Munch Museum, Oslo, Norway 1036 Alma Mater: Study 1912-14 Munch Museum, Oslo, Norway 1037 Alma Mater 1912-14 Munch Museum, Oslo, Norway 1038 Alma Mater: Study 1912-14 Munch Museum, Oslo, Norway 1039 Ducks and Turkeys in Snow 1913 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 1040 Turkeys 1913 Munch Museum, Oslo, Norway 1041 Ducks in Snow 1913 Location unknown 1042 Turkey 1913 Location unknown 1043 The Sower 1913 Private collection 1044 Standing Woman with Arms Folded 1913-15 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1045 St. Bernhard Dog in Snow 1913-15 Munch Museum, Oslo, Norway 1046 St. Bernhard Dog in Snow 1913-15 Munch Museum, Oslo, Norway 1047 In the Kennel 1913-15 Munch Museum, Oslo, Norway 1048 Snow 1913-15 Location unknown 1049 From Jeløya 1913-15 Munch Museum, Oslo, Norway 1050 From Jeløya 1913-15 Munch Museum, Oslo, Norway 1051 From Jeløya 1913-15 Location unknown 1052 Junipers by the Coast 1913-15 Munch Museum, Oslo, Norway 1053 Green Tree by the Road 1913? Munch Museum, Oslo, Norway 1054 Yellow and Grren Tree 1913-16 Munch Museum, Oslo, Norway 1055 Street in Kragerø 1913 Kunsthalle Bielefeld, Germany. On permanent loan from Staff Stiftung, Lemgo 1056 Self- Portrait with Hat 1913 Munch Museum, Oslo, Norway 1057 Christian and Hjørdis Gierløff 1913-14 Munch Museum, Oslo, Norway 1058 Christian and Hjørdis Gierløff 1913-14 Epstein Family Collection, Washington DC, USA 1059 Käte Perls 1913 Munch Museum, Oslo, Norway 1060 Käte Perls 1913 Munch Museum, Oslo, Norway 1061 Käte Perls 1913 Kunstmuseum Basel, Switzerland 1062 Käte and Hugo Perls 1913 Munch Museum, Oslo, Norway 1063 Käte and Hugo Perls 1913 :de:Kunstsammlungen Chemnitz 1064 Elsa Glaser 1913 Munch Museum, Oslo, Norway 1065 Elsa and Curt Glaser 1913 Location unknown 1066 Elsa Glaser 1913 Kunsthaus Zürich, Switzerland 1067 Irmgard Steinbart 1913 Mildred Lane Kemper Art Museum, Washington University in St. Louis, Missouri, USA. Gift of Morton J. May, 1968 1068 Irmgard Steinbart 1913 Munch Museum, Oslo, Norway 1069 The Seducer 1913 Munch Museum, Oslo, Norway 1070 The Seducer 1913 Munch Museum, Oslo, Norway 1071 Naked Man and Woman Ca. 1913-15 Munch Museum, Oslo, Norway 1072 Seated on a Suitcase 1913-15 Munch Museum, Oslo, Norway 1073 Beneath the Red Apples 1913-15 Munch Museum, Oslo, Norway 1074 Man and Woman 1913-15 Munch Museum, Oslo, Norway 1075 Man and Woman 1913-15 Munch Museum, Oslo, Norway 1076 Man and Woman 1913-15 Munch Museum, Oslo, Norway 1077 Jealousy 1913 Städel Museum, Frankfurt am Main, Germany. On loan from a private collection 1078 Jealousy 1913-15 Munch Museum, Oslo, Norway 1079 Jealousy 1913-15 Munch Museum, Oslo, Norway 1080 Old Man with Naked Woman on his Lap 1913-15 Munch Museum, Oslo, Norway 1081 The Secret 1913 Munch Museum, Oslo, Norway 1082 On the Sofa 1913 Munch Museum, Oslo, Norway 1083 Seated Nude 1913 National Gallery, Oslo, Norway 1084 Seated Nude 1913-14 Munch Museum, Oslo, Norway 1085 Morning Yawn 1913 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's collection) 1086 Boy Lying on his Stomach 1913 Munch Museum, Oslo, Norway 1087 Reclining Nude 1913-14 Kunsthalle Hamburg, Germany 1088 Weeping Nude 1913-14 Munch Museum, Oslo, Norway 1089 Youth 1913-14 Munch Museum, Oslo, Norway 1090 Bathing Men 1913-15 Munch Museum, Oslo, Norway 1091 Workers in Snow 1913-15 Munch Museum, Oslo, Norway 1092 Snow Shovellers 1913-14 Probably lost, previously National Gallery, Berlin, Germany 1093 The Logger 1913 Munch Museum, Oslo, Norway 1094 Workers on their Way Home 1913-14 Munch Museum, Oslo, Norway 1095 Workers on their Way Home 1914 Statens Museum for Kunst, Copenhagen, Denmark 1096 Kiss on the Shore by Moonlight 1914 Munch Museum, Oslo, Norway 1097 Puberty 1914-16 Munch Museum, Oslo, Norway 1098 History: Study for the Boy 1914-16 Munch Museum, Oslo, Norway 1099 History 1914 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1100 Alma Mater: Exploring Children 1914-15 Munch Museum, Oslo, Norway 1101 Alma Mater: Middle Part 1914-15 Munch Museum, Oslo, Norway 1102 Alma Mater: Seated Youth 1914-15 Munch Museum, Oslo, Norway 1103 Alma Mater: Standing Child 1914-15 Munch Museum, Oslo, Norway 1104 Alma Mater: Two Sitting Children 1914-15 Munch Museum, Oslo, Norway 1105 Alma Mater: Fragment 1914-15 Munch Museum, Oslo, Norway 1106 Alma Mater: Boy Lying Down 1914-15 Munch Museum, Oslo, Norway 1107 Alma Mater: Middle Part 1914-15 Munch Museum, Oslo, Norway 1108 Alma Mater: Two Seated Children 1914-15 Munch Museum, Oslo, Norway 1109 Alma Mater 1914-15(?) Munch Museum, Oslo, Norway 1110 Alma Mater: Portrait Study 1914-16 Munch Museum, Oslo, Norway 1111 Alma Mater: Portrait Study 1914-16 Munch Museum, Oslo, Norway 1112 Geniuses in Sun Rays 1914-16 Munch Museum, Oslo, Norway 1113 Geniuses in Sun Rays 1914-16 Munch Museum, Oslo, Norway 1114 Men Turned towards the Sun 1914-16 Munch Museum, Oslo, Norway 1115 Christen Sandberg 1914-15 Moss Klub- og Balselskab 1116 Spring by the Coast 1914 Fram Trust, USA 1117 Junipers by the Sea 1914-15 Munch Museum, Oslo, Norway 1118 Birch Trunks 1914-15 Location unknown 1119 Reclining Nude 1914-15 Munch Museum, Oslo, Norway 1120 Reclining Nude on the Rocks 1914-15 Munch Museum, Oslo, Norway 1121 Bathing Women and Children 1914-15 Munch Museum, Oslo, Norway 1122 Bathing Woman by a Red Cliff 1914-15 Munch Museum, Oslo, Norway 1123 Sunbathing 1914-15 Munch Museum, Oslo, Norway 1124 Sunbathing 1914-15 Munch Museum, Oslo, Norway 1125 Winter on the Coast 1915 Private collection 1126 Winter on the Coast 1915 National Gallery, Oslo, Norway 1127 Winter on the Coast 1915 Harvard Art Museums: Busch-Reisinger Museum, Cambridge, Massachusetts, USA. Gift of Lynn G. Straus in memory of Philip A. StrausWinter on the Coast 1128 Bay by the Fjord in Winter 1915-16 Wadsworth Atheneum, Hartford, Connecticut, USA. The Ella Gallup Summer and Mary Catlin Summer Collection Fund 1129 Coastal Landscape at Hvitsten 1915 R. & H. Batliner Art Foundation, Vaduz, Liechtenstein 1130 Death Struggle 1915 Statens Museum for Kunst, Copenhagen, Denmark 1131 Death Struggle 1915 Munch Museum, Oslo, Norway 1132 Sacrament 1915 Munch Museum, Oslo, Norway 1133 Death Chamber 1915 Munch Museum, Oslo, Norway 1134 Two Maids 1915 Munch Museum, Oslo, Norway 1135 Two Women at the Table 1915-17 Munch Museum, Oslo, Norway 1136 Blood Waterfall 1915-16 Munch Museum, Oslo, Norway 1137 Experiment in Colour 1915-16 Munch Museum, Oslo, Norway 1138 Forest Study 1915-16 Munch Museum, Oslo, Norway 1139 Spring Day on Jeløya 1915 Location unknown 1140 Spring Day on Jeløya 1915 Private collection 1141 Auction at Grimsrød 1915 Private collection 1142 Self-Portrait with Hat and Red Tie ca. 1915 Munch Museum, Oslo, Norway 1143 Self-Portrait in Hat and Coat ca. 1915 Munch Museum, Oslo, Norway 1144 Self-Portrait against Yellow Background 1915 Munch Museum, Oslo, Norway 1145 Self-Portrait with Hat and Overcoat 1915 Munch Museum, Oslo, Norway 1146 Male Nude 1915 Munch Museum, Oslo, Norway 1147 Bathing Men on Rocks 1915 Munch Museum, Oslo, Norway 1148 Bathing Men on Rocks 1915 Munch Museum, Oslo, Norway 1149 Naked Man on Rock 1915 Munch Museum, Oslo, Norway 1150 Sunbathing Women on Rocks 1915 Munch Museum, Oslo, Norway 1151 Bathing Men 1915 Munch Museum, Oslo, Norway 1152 Bathers on Rocks 1915 Munch Museum, Oslo, Norway 1153 Bathing Women on Rocks 1915 Munch Museum, Oslo, Norway 1154 Bathing Men on Rocks 1915 Munch Museum, Oslo, Norway 1155 Red Rocks 1915 Munch Museum, Oslo, Norway 1156 Red Rocks 1915 Munch Museum, Oslo, Norway 1157 Midsummer 1915 Munch Museum, Oslo, Norway 1158 Midsummer 1915 National Gallery, Oslo, Norway 1159 Coastal Landscape at Hvitsten 1915 Fram Trust, USA 1160 Sunbathing 1915 Munch Museum, Oslo, Norway 1161 Bathers on Rocks 1915 Location unknown 1162 Sunbathing 1915 Location unknown 1163 Cabbage Field 1915 Munch Museum, Oslo, Norway 1164 Workers in the Garden 1915 Munch Museum, Oslo, Norway 1165 Man Digging 1915 Munch Museum, Oslo, Norway 1166 The Death of the Bohemian 1915-17 Munch Museum, Oslo, Norway 1167 The Death of the Bohemian 1915-20 Munch Museum, Oslo, Norway 1168 The Death of the Bohemian 1915-20 Munch Museum, Oslo, Norway 1169 The Death of the Bohemian 1915-17 Munch Museum, Oslo, Norway 1170 Winter in Kragerø 1916 Munch Museum, Oslo, Norway 1171 The Woman 1916-18 Munch Museum, Oslo, Norway 1172 Vampire in the Forest 1916-18 Munch Museum, Oslo, Norway 1173 Vampire 1916-18 Munch Museum, Oslo, Norway 1174 Vampire 1916-18 Munch Museum, Oslo, Norway 1175 Vampire 1916-18 Munch Museum, Oslo, Norway 1176 Vampire 1916-18 :nl:Sammlung Würth, Künzelsau, Germany 1177 Bergen Harbour 1916 Munch Museum, Oslo, Norway 1178 Bergen Harbour 1916 Munch Museum, Oslo, Norway 1179 Bergen Harbour 1916 Epstein Family Collection, Washington DC, USA 1180 Self-Portrait in Bergen 1916 Munch Museum, Oslo, Norway 1181 Fields in March 1916 Private collection 1182 Early Spring 1916-20 Munch Museum, Oslo, Norway 1183 Spring Ploughing 1916 Fram Trust, USA 1184 Spring Ploughing 1916 Munch Museum, Oslo, Norway 1185 Ploughed Field 1916 Private collection 1186 Coastal Landscape at Hvitsten 1916-17 Private collection 1187 Coastal Landscape at Hvitsten 1916-17 Private collection 1188 Waves Breaking on the Rocks 1916-19 Munch Museum, Oslo, Norway 1189 The Fight 1916 Munch Museum, Oslo, Norway 1190 Christian Gierløff in Åsgårdstrand 1916 Private collection 1191 Kai Møller 1916-19 Felleskjøpet Østlandet, Norway 1192 Kai Møller 1916 Munch Museum, Oslo, Norway 1193 Leopold Wondt 1916 Munch Museum, Oslo, Norway 1194 Leopold Wondt 1916 Axel C. Eitzen 1195 Man in the Cabbage Field 1916 National Gallery, Oslo, Norway 1196 Young Woman in the Garden 1916 Munch Museum, Oslo, Norway 1197 Autumn Colours 1916-20 Munch Museum, Oslo, Norway 1198 Two People on a Bench 1916 Munch Museum, Oslo, Norway 1199 Greenhouse in Autumn 1916 Munch Museum, Oslo, Norway 1200 Ploughing Horses 1916-17 Munch Museum, Oslo, Norway 1201 Ploughed Field 1916-20 Munch Museum, Oslo, Norway 1202 The Sower 1916-20 Munch Museum, Oslo, Norway 1203 Seated Young Woman 1916 Munch Museum, Oslo, Norway 1204 Seated Young Woman 1916 Private collection 1205 Model with Hat and Coat 1916-17 Munch Museum, Oslo, Norway 1206 Seated Nude on the Edge of the Bed 1916 Moderna Museet, Stockholm, Sweden 1207 Seated Nude on the Edge of the Bed 1916 Private collection 1208 Standing Nude 1916 Private collection 1209 Nude Half Figure 1916-17 Location unknown 1210 Reclining Nude 1916-17 Munch Museum, Oslo, Norway 1211 At the Grand Piano 1916-17 Munch Museum, Oslo, Norway 1212 African with Green Scarf 1916 Munch Museum, Oslo, Norway 1213 African with Green Scarf 1916 Munch Museum, Oslo, Norway 1214 African in Green Coat 1916-17 Munch Museum, Oslo, Norway 1215 Seated Naked Man with Dog 1916-17 Munch Museum, Oslo, Norway 1216 Reclining Woman and Standing African 1916-17 Munch Museum, Oslo, Norway 1217 Cleopatra and the Slave 1916-21 Munch Museum, Oslo, Norway 1218 Cleopatra 1916 Munch Museum, Oslo, Norway 1219 Standing Naked African 1916 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1220 Alma Mater 1916 (1915–16) University of Oslo, The Aula 1221 Geniuses in Lightstream 1914-16 University of Oslo, The Aula 1222 Awakening Men in Lightstream 1914-16 University of Oslo, The Aula 1223 Women Turned towards the Sun 1914-16 University of Oslo, The Aula 1224 Men Turned towards the Sun 1914-16 University of Oslo, The Aula 1225 New Rays 1914-16 University of Oslo, The Aula 1226 The Source 1915-16 University of Oslo, The Aula 1227 Chemistry 1914-16 University of Oslo, The Aula 1228 Harvesting Women 1915-16 University of Oslo, The Aula 1229 Fruit trees in Blossom in the Wind 1917-19 Munch Museum, Oslo, Norway 1230 Fruit Trees in Blossom 1917-19 Munch Museum, Oslo, Norway 1231 Woman in a Green Meadow 1917 Munch Museum, Oslo, Norway 1232 In the WInd 1917 Location unknown 1233 Woman in a White Dress 1917 Munch Museum, Oslo, Norway 1234 Promenade in Spring 1917 Munch Museum, Oslo, Norway 1235 Summer Night 1917 Location unknown 1236 Two White Horses in a Green Meadow 1917-20 Munch Museum, Oslo, Norway 1237 White Horse Seen from the Rear 1917-20 Munch Museum, Oslo, Norway 1238 Horse and Man in the Field 1917-20 Munch Museum, Oslo, Norway 1239 White Horse in a Green Meadow 1917-20 Munch Museum, Oslo, Norway 1240 Behind the Plough 1917 Munch Museum, Oslo, Norway 1241 Weeding 1917-19 Moderna Museet, Stockholm, Sweden 1242 Field Work 1917 Private collection, USA 1243 Cutting the Corn 1917 Munch Museum, Oslo, Norway 1244 Corn Harvest 1917 Private collection 1245 Corn Field 1917 University of Iowa Museum of Art, Iowa City, Iowa, USA. Gift from Owen and Leone Elliott 1246 Reaping the Corn 1917-23 Fram Trust, USA 1247 The Haymaker 1917 Munch Museum, Oslo, Norway 1248 The Haymaker 1917 Munch Museum, Oslo, Norway 1249 Nude in the Forest 1917 Private collection 1250 Nude in the Forest 1917 Munch Museum, Oslo, Norway 1251 Mermaid on the Beach 1917? Munch Museum, Oslo, Norway 1252 Bathing Women 1917? Munch Museum, Oslo, Norway 1253 Seated Nude in the Woods 1917? Portland Art Museum, Oregon, USA. Purchased by the Activities Council for the Portland Art Museum. 1254 Thorvald Løchen 1917 Munch Museum, Oslo, Norway 1255 Thorvald Løchen 1917 Munch Museum, Oslo, Norway 1256 Thorvald Løchen 1917 Munch Museum, Oslo, Norway 1257 Hieronymus Heyerdahl 1917 Munch Museum, Oslo, Norway 1258 Hieronymus Heyerdahl 1917-18 Oslo City Hall, Norway 1259 Hieronymus Heyerdahl 1917 Axel C. Eitzen 1260 Dagny Konow 1917 Munch Museum, Oslo, Norway 1261 Dagny Konow 1917 Munch Museum, Oslo, Norway 1262 Female Nudes, Standing and Lying down 191 Munch Museum, Oslo, Norway 1263 Two Seated Nudes 1917 Munch Museum, Oslo, Norway 1264 Women in the Bath 1917 Munch Museum, Oslo, Norway 1265 Women in the Bath 1917 Munch Museum, Oslo, Norway 1266 Conversation 1917 Private collection 1267 Conversation 1917-18 Munch Museum, Oslo, Norway 1268 Nude in Front of the Mirror 1917-20 Munch Museum, Oslo, Norway 1269 Female Nudes, Seated and Standing 1917-18 Munch Museum, Oslo, Norway 1270 Two Reclining Nudes 1917-19 Munch Museum, Oslo, Norway 1271 Seated Female Nudes 1917 Private collection 1272 Nude Female Back 1917-19 Munch Museum, Oslo, Norway 1273 Crouching Nude 1917-19 Munch Museum, Oslo, Norway 1274 Two Models 1917 Private collection 1275 Double Portrait 1918 Fram Trust, USA 1276 Double Portrait 1918 Location unknown 1277 Double Portrait 1918 Private collection 1278 Two Reclining Women 1918-19 Private collection 1279 Two Seated Women 1918-19 Munch Museum, Oslo, Norway 1280 Seated Man (Possibly a self-portrait) 1918 Location unknown 1281 Coastal Landscape 1918 Kunstmuseum Basel, Switzerland 1282 Landscape from Hvitsten 1918-19 Munch Museum, Oslo, Norway 1283 Bathing Man 1918 Munch Museum, Oslo, Norway 1284 Bathing Man 1918 National Gallery, Oslo, Norway 1285 Bathing Men 1918 Munch Museum, Oslo, Norway 1286 Man with Horse 1918 Private collection 1287 Man with Horse 1918 Fram Trust, USA 1288 Else Mustad 1918 Munch Museum, Oslo, Norway 1289 Woman with Poppies 1918-19 Munch Museum, Oslo, Norway 1290 Fjord Landscape 1918 Private collection 1291 War 1918-19 Munch Museum, Oslo, Norway 1292 War 1918-19 Munch Museum, Oslo, Norway 1293 Peace and the Rainbow 1918-19 Munch Museum, Oslo, Norway 1294 The Rainbow 1918-19 Munch Museum, Oslo, Norway 1295 Self-Portrait with the Spanish Flu 1919 Behnhaus, Lübeck, Germany 1296 Self-Portrait with the Spanish Flu 1919 National Gallery, Oslo, Norway 1297 Self-Portrait after the Spanish Flu 1919 Munch Museum, Oslo, Norway 1298 Flowers in a Vase 1919-20 Munch Museum, Oslo, Norway 1299 Winter Night 1919 Harvard Art Museums, Busch-Reisinger Museum, Cambridge, Massachusetts, USA 1300 Thawing Snow 1919 Fram Trust, USA 1301 March 1919 Moderna Museet, Stockholm, Sweden 1302 March 1919 Munch Museum, Oslo, Norway 1303 The Magic Forest 1919 Munch Museum, Oslo, Norway 1304 17th of May in a Small, Norwegian Town 1919 Munch Museum, Oslo, Norway 1305 Waves 1919 Private collection 1306 Anton Brünings 1919 Axel C. Eitzen 1307 Anton Brünings 1919 Denofa and Lilleborg, Fredrikstad, Norway 1308 Anton Brünings 1919 Munch Museum, Oslo, Norway 1309 Anton Brünings 1919 Munch Museum, Oslo, Norway 1310 Two Teenagers 1919 Munch Museum, Oslo, Norway 1311 Female Nude in the Woods 1919 Munch Museum, Oslo, Norway 1312 Male Nude in the Woods 1919 Munch Museum, Oslo, Norway 1313 Male Nude Leaning forwards in the Woods 1919 Munch Museum, Oslo, Norway 1314 Naked Man and Woman in the Woods 1919-25 Munch Museum, Oslo, Norway 1315 Naked Men in the Woods 1919-25 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1316 Naked Men in the Woods 1919-25 Munch Museum, Oslo, Norway 1317 Naked men in the Woods 1919-25 Munch Museum, Oslo, Norway 1318 Woman Seated on a Couch 1919 Munch Museum, Oslo, Norway 1319 Woman with her Hair Hanging Loose 1919 Munch Museum, Oslo, Norway 1320 The Cat 1919 Hirshhorn Museum and Sculpture Garden, Smithsonian Institution, Washington DC, USA. Gift from the Joseph H. Hirshhorn Foundation, 1966 1321 Weeping Nude 1919 Sarah Campbell Blaffer Foundation, Houston, Texas, USA 1322 Kneeling Nude 1919-20 Sarah Campbell Blaffer Foundation, Houston, Texas, USA 1323 Model by the Wicker Chair 1919-21 Munch Museum, Oslo, Norway 1324 Model by the Wicker Chair 1919-21 Munch Museum, Oslo, Norway 1325 Standing Nude 1919-20 Munch Museum, Oslo, Norway 1326 Model by the Wicker Chair 1919-21 Munch Museum, Oslo, Norway 1327 The Artist and his Model 1919-21 Munch Museum, Oslo, Norway 1328 The Artist and his Model. Jealousy-Theme 1919-21 Munch Museum, Oslo, Norway 1329 The Artist and his Model 1919-21 Munch Museum, Oslo, Norway 1330 Model in Dressing Gown 1919-21 Munch Museum, Oslo, Norway 1331 The Artist and his Model 1919-21 Munch Museum, Oslo, Norway 1332 Cheek to Cheek 1919-20 Munch Museum, Oslo, Norway 1333 Airdale Terrier 1919-20 Munch Museum, Oslo, Norway 1334 Five Puppies on the Carpet 1919-21 Munch Museum, Oslo, Norway 1335 Two Women in White Dresses in the Garden 1919 Munch Museum, Oslo, Norway 1336 Two Women under the Tree in the Garden 1919 Munch Museum, Oslo, Norway 1337 Two Women in the Garden 1919 Munch Museum, Oslo, Norway 1338 Two Women in the Garden 1919 Munch Museum, Oslo, Norway 1339 Under the Apple Tree 1919 Munch Museum, Oslo, Norway 1340 Murder on the Road 1919 Munch Museum, Oslo, Norway 1341 Autumn Ploughing 1919 National Gallery, Oslo, Norway 1342 Man Ploughing with a White Horse 1919-20 Munch Museum, Oslo, Norway 1343 Man Ploughing with a White Horse 1919-20 Munch Museum, Oslo, Norway 1344 Horse Team Ploughing 1919-20 Munch Museum, Oslo, Norway 1345 Ploughing Horses 1919-20 Munch Museum, Oslo, Norway 1346 Man on the Harvester 1919-21 Munch Museum, Oslo, Norway 1347 Two Black Horses at the Plough 1919-21 Munch Museum, Oslo, Norway 1348 Elm Forest in Autumn 1919-20 Munch Museum, Oslo, Norway 1349 Elm Forest in Autumn 1919-20 Munch Museum, Oslo, Norway 1350 Rugged Trunks 1919-20 Munch Museum, Oslo, Norway 1351 Elm Forest in Autumn 1919-20 Munch Museum, Oslo, Norway 1352 Elm Forest in Autumn 1919-20 Munch Museum, Oslo, Norway 1353 Fire at Grønland (A borough in Oslo) 1919-20 Munch Museum, Oslo, Norway 1354 Hodman at Work on the Studio Building 1920 Munch Museum, Oslo, Norway 1355 Hodman at Work on the Studio Building 1920 Munch Museum, Oslo, Norway 1356 Bricklayers at Work on the Studio Building 1920 Munch Museum, Oslo, Norway 1357 Hodman on the Ladder 1920 Munch Museum, Oslo, Norway 1358 Building Workers in Snow 1920 Munch Museum, Oslo, Norway 1359 Building Workers in Snow 1920 Munch Museum, Oslo, Norway 1360 Street Workers in Snow 1920 Private collection 1361 Workers Returning Home 1920 National Gallery, Oslo, Norway 1362 Timbermen at Work on the Studio Building 1920 Munch Museum, Oslo, Norway 1363 Building Workers in the Studio 1920 Munch Museum, Oslo, Norway 1364 Carpenters in the Studio 1920 Munch Museum, Oslo, Norway 1365 Building Workers in the Studio 1920 Munch Museum, Oslo, Norway 1366 Workers and Horse 1920-30 Munch Museum, Oslo, Norway 1367 Runaway Horse in Street 1920-25 Munch Museum, Oslo, Norway 1368 Worker with Wheelbarrow 1920-30 Private collection 1369 Fields in Springtime 1920-24 Munch Museum, Oslo, Norway 1370 Landscape near Skøyen 1920-30 Location unknown 1371 The Tram loop at Skøyen 1920-30 Munch Museum, Oslo, Norway 1372 Digging Men with Horse and Cart 1920 Munch Museum, Oslo, Norway 1373 Digging Men with Horse and Cart 1920 Munch Museum, Oslo, Norway 1374 Elm Forest in Summer 1920-23 Munch Museum, Oslo, Norway 1375 Two Women in the Woods at Ekely 1920-23 Munch Museum, Oslo, Norway 1376 Mother and Daughter in the Garden 1920 Munch Museum, Oslo, Norway 1377 Mother and Daughter in the Garden 1920 Munch Museum, Oslo, Norway 1378 Landscape with Green Fields 1920-30 Munch Museum, Oslo, Norway 1379 Sunbathing 1920-25 Munch Museum, Oslo, Norway 1380 Washing Clothes by the Sea 1920-30 Location unknown 1381 Moonlight on the Fjord 1920 Location unknown 1382 Man with Bronchitis 1920 Munch Museum, Oslo, Norway 1383 Sleeples Night. Self- Portrait in Inner Turmoil 1920 Munch Museum, Oslo, Norway 1384 Three Women 1920-25 Munch Museum, Oslo, Norway 1385 Model with Hat, Seated on the Couch 1920 Munch Museum, Oslo, Norway 1386 Model Seated on the Couch 1920-21 Munch Museum, Oslo, Norway 1387 Apple Tree by the Sudio 1920-28 Munch Museum, Oslo, Norway 1388 Garden with Apple Trees 1920 Munch Museum, Oslo, Norway 1389 Apple Tree 1920-28 Munch Museum, Oslo, Norway 1390 Drying Hay 1920 Munch Museum, Oslo, Norway 1391 Forest with Two Figures 1920-30? Munch Museum, Oslo, Norway 1392 Tree Trunks 1920-30? Munch Museum, Oslo, Norway 1393 Tree Trunks 1920-30? Munch Museum, Oslo, Norway 1394 Alma Mater 1920-30 Munch Museum, Oslo, Norway 1395 Alma Mater 1920-30 Munch Museum, Oslo, Norway 1396 Winter Night 1921 Von der Heydt Museum, Wuppertal, Germany 1397 Horse Team in Snow 1921-22 Munch Museum, Oslo, Norway 1398 The Apple Tree 1921 Kunsthaus Zürich, Switzerland. Gift from Aldfred Rütschi 1399 Inger Barth 1921 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1400 Inger Barth 1921 Private collection 1401 Summer at Ekely 1921-30 Munch Museum, Oslo, Norway 1402 Summer at Ekely 1921-30 Munch Museum, Oslo, Norway 1403 Summer at Ekely 1921-30 Munch Museum, Oslo, Norway 1404 The Dance of Life 1921 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1405 Kiss on the Beach 1921 Sarah Campbell Blaffer Foundation, Houston, Texas, USA 1406 Meeting 1921 Private collection 1407 Meeting 1921 Munch Museum, Oslo, Norway 1408 Naked Couple on the Beach 1921-30 Munch Museum, Oslo, Norway 1409 Naked Couple under the Trees 1921-23 Munch Museum, Oslo, Norway 1410 Kiss on the Beach 1921-23 Munch Museum, Oslo, Norway 1411 Dance on the Beach 1921-23 Munch Museum, Oslo, Norway 1412 Meeting on the Beach 1921-25 Munch Museum, Oslo, Norway 1413 Meeting on the Beach 1921-25 Munch Museum, Oslo, Norway 1414 Dance on the Beach (The Freia Frieze VII) 1922 Freia Chocolate Factory, Oslo, Norway 1415 Men and Women on the Beach (The Freia Frieze II) 1922 Freia Chocolate Factory, Oslo, Norway 1416 Farewell (The Freia Frieze III) 1922 Freia Chocolate Factory, Oslo, Norway 1417 Girls Watering Flowers (The Freia Frieze IV) 1922 Freia Chocolate Factory, Oslo, Norway 1418 Harvesting the Tree (The Freia Frieze V) 1922 Freia Chocolate Factory, Oslo, Norway 1419 Girls Harvesting Fruit (The Freia Frieze VI) 1922 Freia Chocolate Factory, Oslo, Norway 1420 On the Way to the Boat (The Freia Frieze I) 1922 Freia Chocolate Factory, Oslo, Norway 1421 Fertility (The Freia Frieze VIII) 1922 Freia Chocolate Factory, Oslo, Norway 1422 Four Girls in Åsgårdstrand (The Freia Frieze IX) 1922 Freia Chocolate Factory, Oslo, Norway 1423 The Fairytale Forest (The Freia Frieze X) 1922 Freia Chocolate Factory, Oslo, Norway 1424 Out at Sea (The Freia Frieze XI) 1922 Freia Chocolate Factory, Oslo, Norway 1425 Youth on the Beach (The Freia Frieze XII) 1922 Freia Chocolate Factory, Oslo, Norway 1426 Four Girls in Åsgårdstrand 1922 Munch Museum, Oslo, Norway 1427 Promenade on Karl Johan 1922-24 Munch Museum, Oslo, Norway 1428 The Promenade 1922-24 Munch Museum, Oslo, Norway 1429 Blue Coat in Sunshine 1922 Alexander M. Vik 1430 Coastal Landscape at Hvitsten 1922 Private collection, USA 1431 Wilhelm Wartmann 1922 Munch Museum, Oslo, Norway 1432 Standing Nude 1922-23 Munch Museum, Oslo, Norway 1433 Female Portrait against Yellow Background 1922 Private collection 1434 Standing Woman 1922-23 Munch Museum, Oslo, Norway 1435 Portrait of Model 1922-23 Munch Museum, Oslo, Norway 1436 Standing Nude: Half-Figure 1922-23 Munch Museum, Oslo, Norway 1437 Standing Nude 1922-23 Munch Museum, Oslo, Norway 1438 Standing Nude 1922-23 Munch Museum, Oslo, Norway 1439 Standing Nude with Arms behind her Head 1922-25 Munch Museum, Oslo, Norway 1440 Standing Nude: Noon 1922-23 Munch Museum, Oslo, Norway 1441 Standing Nude: Noon 1922-23 Munch Museum, Oslo, Norway 1442 Standing Nude: Evening 1922-25 Munch Museum, Oslo, Norway 1443 Seated Nude: Morning 1922-23 Munch Museum, Oslo, Norway 1444 Seated Nude: Morning 1922-25 Munch Museum, Oslo, Norway 1445 Reclining Nude: Night 1922-24 Munch Museum, Oslo, Norway 1446 Reclining Nude: Night 1925 Munch Museum, Oslo, Norway 1447 Kneeling Nude 1922 Private collection 1448 Kneeling Nude 1922-26 Munch Museum, Oslo, Norway 1449 Kneeling Nude 1922-26 Munch Museum, Oslo, Norway 1450 Kneeling Nude 1922-26 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1451 Starry Night 1922-24 Munch Museum, Oslo, Norway 1452 Starry Night 1922-24 Munch Museum, Oslo, Norway 1453 Starry Night 1922-24 Munch Museum, Oslo, Norway 1454 Winter Night 1922-26 Munch Museum, Oslo, Norway 1455 Woman by the House Corner 1922-24 Munch Museum, Oslo, Norway 1456 Woman by the Veranda Stairs 1922-24 The Saltzman Family Collection 1457 On the Veranda Stairs 1922-24 Munch Museum, Oslo, Norway 1458 On the Veranda Stairs 1922-24 Munch Museum, Oslo, Norway 1459 Winter Night 1923 Private collection 1460 House Wall in Moonlight 1922-24 Munch Museum, Oslo, Norway 1461 Snow Landscape at Night 1923-26 Staatsgalerie Stuttgart, Germany 1462 The Night Wanderer (A self-portrait) 1923-24 Munch Museum, Oslo, Norway 1463 Self- Portrait in Hat and Coat 1923-24 Munch Museum, Oslo, Norway 1464 Self-Portrait with Hands in Pockets 1923-26 Munch Museum, Oslo, Norway 1465 Horse Team in Snow 1923 Munch Museum, Oslo, Norway 1466 Horse Team and a St. Bernhard in the Snow 1923 Munch Museum, Oslo, Norway 1467 Rugged Trunk in Snow 1923 Munch Museum, Oslo, Norway 1468 Rugged Trunks in Snow 1923-25 Munch Museum, Oslo, Norway 1469 Rugged Trunks in Snow 1923 Private collection 1470 Rugged Trunks in Snow 1923 Munch Museum, Oslo, Norway 1471 Rugged Trunks in Snow Ca. 1923 Munch Museum, Oslo, Norway 1472 Elm Forest in Spring 1923 Fram Trust, USA 1473 Elm Forest in Spring 1923-25 Munch Museum, Oslo, Norway 1474 Elm Forest in Spring Ca. 1923 Munch Museum, Oslo, Norway 1475 Elm Forest in Spring 1923-25 Munch Museum, Oslo, Norway 1476 Elm Forest in Spring Ca. 1923 Munch Museum, Oslo, Norway 1477 Rugged Tree Trunks in Summer 1923 Munch Museum, Oslo, Norway 1478 Rugged Tree Trunks in Summer Ca. 1923 Munch Museum, Oslo, Norway 1479 Spring Landscape 1923-24 Private collection 1480 Road with Trees 1923 Private collection 1481 Autumn by the Greenhouse 1923-25 Location unknown 1482 Wilhelm Wartmann 1923 Kunsthaus Zürich, Switzerland 1483 Wilhelm Wartmann 1923 de:Kunstmuseum St. Gallen, Switzerland. Acquired by Marie Müller-Guarneri Foundation 1484 Naked Men in Swimming Pool 1923 Munch Museum, Oslo, Norway 1485 Naked Men in the Baths 1923 Munch Museum, Oslo, Norway 1486 Naked Men in the Baths 1923 Munch Museum, Oslo, Norway 1487 Naked Man Gripping his Ankle 1923 Munch Museum, Oslo, Norway 1488 Naked Men in Landscape 1923-30 Munch Museum, Oslo, Norway 1489 Naked Men in Landscape 1923-25 Munch Museum, Oslo, Norway 1490 Naked Men in Landscape 1923-25 Munch Museum, Oslo, Norway 1491 Portrait of Female Model 1923-33 Munch Museum, Oslo, Norway 1492 Portrait of Female Model 1923-26 Munch Museum, Oslo, Norway 1493 Young Woman in a Blue Dress, Seated 1924 Munch Museum, Oslo, Norway 1494 Two Women, Seated 1924-26 Munch Museum, Oslo, Norway 1495 Model in Wicker Chair 1924-25 Private collection 1496 Model in Wicker Chair 1924-25 Munch Museum, Oslo, Norway 1497 Woman in a Blue Dress Pouring Coffee 1924-26 Munch Museum, Oslo, Norway 1498 Woman in a Blue Dress 1924-26 Munch Museum, Oslo, Norway 1499 Woman in a Blue Dress with her Arms over her Head 1924-26 Location unknown 1500 Seated Model on the Couch 1924 Munch Museum, Oslo, Norway 1501 Seated Model on the Couch 1924-26 Munch Museum, Oslo, Norway 1502 Woman in a Negligé 1924-25 Munch Museum, Oslo, Norway 1503 The Gothic Girl 1924 Private collection, Switzerland 1504 Birgit Prestøe in the Garden 1924-30 Munch Museum, Oslo, Norway 1505 Two Women on the Veranda 1924 Hirshhorn Museum and Sculpture Garden, Smithsonian Institution, Washington DC, USA. Gift from the Joseph H. Hirshhorn Foundation, 1966 1506 Young Woman on the Veranda 1924 Private collection 1507 Woman in Grey 1924-25 Munch Museum, Oslo, Norway 1508 Vampire in the Forest 1924-25 Munch Museum, Oslo, Norway 1509 Consolation in the Forest 1924-25 Munch Museum, Oslo, Norway 1510 Consolation in the Forest 1924-25 Munch Museum, Oslo, Norway 1511 After the Fall 1924-25 Munch Museum, Oslo, Norway 1512 Seated Male Nude in the Forest 1924-25 Munch Museum, Oslo, Norway 1513 At Work by the Greenhouse 1924 no:Stavanger kunstmuseum, Stavanger, Norway 1514 Woman 1924-25 Munch Museum, Oslo, Norway 1515 Naked Figures and Sun 1924-25 Munch Museum, Oslo, Norway 1516 Naked Man and Woman, Seated 1924-25 Munch Museum, Oslo, Norway 1517 Naked Man and Woman, Walking 1924-30 Munch Museum, Oslo, Norway 1518 The Rainbow 1924 Munch Museum, Oslo, Norway 1519 Birgit Prestøe, Portrait Study 1924-25 Munch Museum, Oslo, Norway 1520 Nude, Sitting on the Couch 1925-26 Munch Museum, Oslo, Norway 1521 Nude, Sitting on the Couch 1925-26 Munch Museum, Oslo, Norway 1522 Nude with Bowed Head 1925-30 Location unknown 1523 The Wedding of the Bohemian 1925 Munch Museum, Oslo, Norway 1524 The Wedding of the Bohemian 1925-30 Munch Museum, Oslo, Norway 1525 The Wedding of the Bohemian 1925-30 Munch Museum, Oslo, Norway 1526 The Wedding of the Bohemian 1925-30 Munch Museum, Oslo, Norway 1527 The Death of the Bohemian 1925-26 Munch Museum, Oslo, Norway 1528 Oslo Bohemians 1925-26 Munch Museum, Oslo, Norway 1529 Oslo Bohemians 1925-26 Munch Museum, Oslo, Norway 1530 The Wedding of the Bohemian 1925-30 Private collection 1531 Self-Portrait at the Wedding Table 1925-26 Munch Museum, Oslo, Norway 1532 Self-Portrait at the Wedding Table 1925-26 Munch Museum, Oslo, Norway 1533 Birgit Prestøe, Portrait Study 1925-26 Munch Museum, Oslo, Norway 1534 Self-Portrait with Hand in Pocket 1925-26 Munch Museum, Oslo, Norway 1535 Self-Portrait with Dogs 1925-26 Pola Museum of Art, Hakone, Japan 1536 Landscape with Red House 1925-26 Private collection, Switzerland 1537 The House is Burning! 1925-27 Munch Museum, Oslo, Norway 1538 Winter Night 1925-30 Munch Museum, Oslo, Norway 1539 Mountains 1925 Munch Museum, Oslo, Norway 1540 Mountains 1925 Munch Museum, Oslo, Norway 1541 House with Mountains in the Background 1925 Munch Museum, Oslo, Norway 1542 Naked Women by the Sea 1925-30 Munch Museum, Oslo, Norway 1543 Two Women in White on the Beach 1925-30 Munch Museum, Oslo, Norway 1544 Standing Nude against Blue Background 1925-30 Munch Museum, Oslo, Norway 1545 Meeting in Space 1925-29 Munch Museum, Oslo, Norway 1546 Draft for a Decoration 1925-29 Munch Museum, Oslo, Norway 1547 Draft for a Decoration 1925-29 Munch Museum, Oslo, Norway 1548 Draft for a Decoration 1925-29 Munch Museum, Oslo, Norway 1549 Woman with Airdale Terrier 1925 Munch Museum, Oslo, Norway 1550 Woman in a Blue Coat 1925 Munch Museum, Oslo, Norway 1551 Heinrich C. Hudtwalcker 1925 Private collection, Switzerland 1552 Heinrich C. Hudtwalcker 1925 Munch Museum, Oslo, Norway 1553 Heinrich C. Hudtwalcker 1925 Munch Museum, Oslo, Norway 1554 Lucien Dedichen and Jappe Nilssen 1925-26 Munch Museum, Oslo, Norway 1555 Lucien Dedichen and Jappe Nilssen 1925-26 Munch Museum, Oslo, Norway 1556 Lucien Dedichen 1925-26 Private collection, São Paulo 1557 Jappe Nilssen in a Wicker Chair 1925-26 Erik M. Vik 1558 Rolf Stenersen 1925-26 Munch Museum, Oslo, Norway 1559 Rolf Stenersen 1925 Location unknown 1560 Winter in Kragerø 1925-31 Kunsthaus Zürich, Switzerland 1561 The Sick Child 1925 Munch Museum, Oslo, Norway 1562 Ashes 1925 Munch Museum, Oslo, Norway 1563 The Dance of Life 1925 Munch Museum, Oslo, Norway 1564 Woman 192 Munch Museum, Oslo, Norway 1565 Summer Evening 1925-27 Munch Museum, Oslo, Norway 1566 Life 1925-30 Munch Museum, Oslo, Norway 1567 History 1926 Munch Museum, Oslo, Norway 1568 Street With Chestnut in Blossom 1925-30 Munch Museum, Oslo, Norway 1569 Street with Chestnut in Blossom 1925-30 Private collection 1570 The Red House 1926 Private collection 1571 The Red House 1926 Private collection 1572 The Red House 1926-30 Axel C. Eitzen 1573 Spring Landscape with Red House 1926 Munch Museum, Oslo, Norway 1574 Spring Landscape with Red House 1926 Munch Museum, Oslo, Norway 1575 The Red House 1926 Munch Museum, Oslo, Norway 1576 The Red House 1926-27 Location unknown 1577 Bathing Men 1926-30 Munch Museum, Oslo, Norway 1578 Bathing Men 1926-30 Munch Museum, Oslo, Norway 1579 Self-Portrait with Palette 1926 Private collection 1580 Self-Portrait in Front of the House Wall 1926 Munch Museum, Oslo, Norway 1581 Model With Hands Resting on Knees 1926-29 Munch Museum, Oslo, Norway 1582 Model with Hands Resting on Knees 1926-29 Munch Museum, Oslo, Norway 1583 Woman with Peonies 1926 Fram Trust, USA 1584 Woman with Peonies 1926 Munch Museum, Oslo, Norway 1585 Woman in the Garden 1926 Munch Museum, Oslo, Norway 1586 Three Women in the Garden 1926 Munch Museum, Oslo, Norway 1587 Four Women in the Garden 1926 Munch Museum, Oslo, Norway 1588 Two Horses in the Forest 1926 Munch Museum, Oslo, Norway 1589 Two Women in the Garden 1926 Munch Museum, Oslo, Norway 1590 Two Women in the Garden 1926 Munch Museum, Oslo, Norway 1591 The Arbour in Late Autumn 1926-30 Munch Museum, Oslo, Norway 1592 Still Life with Pumpkin and other Vegetables 1926-30 Munch Museum, Oslo, Norway 1593 Still Life with Tomatoes, Leek and Casseroles 1926-30 Munch Museum, Oslo, Norway 1594 Still Life with Tomatoes, Leek and Casseroles 1926-30 Munch Museum, Oslo, Norway 1595 Still Life with Cabbage and other Vegetables 1926-30 Munch Museum, Oslo, Norway 1596 The Storm: Left Part 1926-27 Probably lost 1597 The Storm: Left Middle Part 1926-27 Munch Museum, Oslo, Norway 1598 The Storm: Right Middle Part 1926-27 Munch Museum, Oslo, Norway 1599 The Storm: Right Part 1926-27 Munch Museum, Oslo, Norway 1600 Naked Man in Rocky Landscape 1926-27 Munch Museum, Oslo, Norway 1601 The Rainbow: Fragment 1926-27 Munch Museum, Oslo, Norway 1602 The Human Mountain: Middle Part 1926-28 Munch Museum, Oslo, Norway 1603 The Human Mountain: Left Upper Part 1926-28 Munch Museum, Oslo, Norway 1604 The Human Mountain: Left Under Part 1926-28 Munch Museum, Oslo, Norway 1605 The Human Mountain: Right Part 1926-29 Munch Museum, Oslo, Norway 1606 The Human Mountain: Utter Right Part 1926-28 Munch Museum, Oslo, Norway 1607 The Human Mountain: Sphinx 1927-28 Munch Museum, Oslo, Norway 1608 The Human Mountain: Kneeling Nude 1927-28 Munch Museum, Oslo, Norway 1609 The Human Mountain: Two Graces 1927 Munch Museum, Oslo, Norway 1610 Two Graces 1927 Munch Museum, Oslo, Norway 1611 Two Graces 1927 Munch Museum, Oslo, Norway 1612 The Human Mountain: Sunrays 1927-29 Munch Museum, Oslo, Norway 1613 The Human Mountain: Towards the Light 1927-29 Munch Museum, Oslo, Norway 1614 Two Graces 1927-29 Munch Museum, Oslo, Norway 1615 Krotkaja 1927-29 Munch Museum, Oslo, Norway 1616 Naked Figures 1927-29 Munch Museum, Oslo, Norway 1617 Kneeling Female Figure 1927-29 Munch Museum, Oslo, Norway 1618 Red House and Spruces 1927 Munch Museum, Oslo, Norway 1619 Red House and Spruces 1927 Munch Museum, Oslo, Norway 1620 Dog's Face 1927 Stenersen Museum, Oslo, Norway. A gift from Rolf E. Stenersen to the city of Oslo 1621 Three Men 1927-30 Munch Museum, Oslo, Norway 1622 Around the Drinking Table 1927-30 Munch Museum, Oslo, Norway 1623 P.A. Munch's Grave in Rome 1927 Munch Museum, Oslo, Norway 1624 P.A. Munch's Grave in Rome 1927 Munch Museum, Oslo, Norway 1625 Forest Study 1927? Munch Museum, Oslo, Norway 1626 Evening Mood Ca. 1927 Munch Museum, Oslo, Norway 1627 Frimann Koren 1927 Munch Museum, Oslo, Norway 1628 Frimann Koren 1927 Munch Museum, Oslo, Norway 1629 Maria Agatha Meier 1927 Munch Museum, Oslo, Norway 1630 Maria Agatha Meier 1927 Private collection 1631 The Sick Child 1927 Munch Museum, Oslo, Norway 1632 The Girls on the Bridge 1927 Munch Museum, Oslo, Norway 1633 Forest 1927 Neue Nationalgalerie, Berlin, Germany 1634 The Fairytale Forest 1927-29 Private collection 1635 Beneath the Red Apples 1927-30 Munch Museum, Oslo, Norway 1636 Apple Tree in the Garden at Ekely 1928-29 Private collection 1637 Fredrik Stang 1927-28 Munch Museum, Oslo, Norway 1638 Otto Blehr 1927-30 Storting, Oslo, Norway 1639 Otto Blehr 1927-30 Munch Museum, Oslo, Norway 1640 Winter Forest 1927-30 Munch Museum, Oslo, Norway 1641 Galloping White Horse 1928 Munch Museum, Oslo, Norway 1642 Large Deciduous Tree 1928-30 Munch Museum, Oslo, Norway 1643 Adam and Eve 1928 Munch Museum, Oslo, Norway 1644 Adam and Eve 1928 Munch Museum, Oslo, Norway 1645 Woman in a Red Dress 1927-30 Private collection 1646 Woman in the Garden 1928 Location unknown 1647 Horse Team on a Building Site 1928-29 Munch Museum, Oslo, Norway 1648 Winter Studio under Construction 1929 Munch Museum, Oslo, Norway 1649 Building Worker 1929 Munch Museum, Oslo, Norway 1650 The Building of the Winter Studio 1929 Munch Museum, Oslo, Norway 1651 Workers on the Building Site 1929-31 Munch Museum, Oslo, Norway 1652 Workers on the Building Site 1929-31 Munch Museum, Oslo, Norway 1653 Workers on the Building Site 1929-31 Munch Museum, Oslo, Norway 1654 Bricklayer 1929 Munch Museum, Oslo, Norway 1655 Kragerø in Spring 1929 Private collection, USA 1656 Kragerø in Spring 1929? Harvard Art Museums, Busch-Reisinger Museum, Cambridge, Massachusetts, USA 1657 Horses Ploughing 1929? Munch Museum, Oslo, Norway 1658 Bathing Men 1929 Munch Museum, Oslo, Norway 1659 People Wandering in the Garden 1929-30 Munch Museum, Oslo, Norway 1660 Alma Mater 1929 Munch Museum, Oslo, Norway 1661 Jealousy in the Garden 1929-30 Munch Museum, Oslo, Norway 1662 Jealousy in the Garden 1929-30 Munch Museum, Oslo, Norway 1663 Woman with Samoyed 1929-30 Munch Museum, Oslo, Norway 1664 Woman with Samoyed 1929-30 Munch Museum, Oslo, Norway 1665 Woman with Samoyed 1929-30 Munch Museum, Oslo, Norway 1666 Model in the Garden 1930 Munch Museum, Oslo, Norway 1667 Walking in the Garden 1930 Location unknown 1668 Charlotte Corday 1930 Munch Museum, Oslo, Norway 1669 Marat in the Bath and Charlotte Corday 1930 Munch Museum, Oslo, Norway 1670 Marat in the Bath and Charlotte Corday 1930 Munch Museum, Oslo, Norway 1671 Charlotte Corday 1930 Munch Museum, Oslo, Norway 1672 Winter Night 1930-31 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's Collection) 1673 Old Firsherman on Snow-covered Coast 1930 Private collection 1674 Self-Portrait with Wounded Eye Ca. 1930 Munch Museum, Oslo, Norway 1675 Disturbed Vision 1930 Munch Museum, Oslo, Norway 1676 Disturbed Vision 1930 Munch Museum, Oslo, Norway 1677 Self-Portrait on the Glass Veranda 1930-33 Munch Museum, Oslo, Norway 1678 Self-Portrait on the Glass Veranda 1930-33 Munch Museum, Oslo, Norway 1679 Woman with Small Boy 1930 Munch Museum, Oslo, Norway 1680 Forest with Birch Trunks 1930-35 Munch Museum, Oslo, Norway 1681 Bathing Woman and Children 1930-35 Munch Museum, Oslo, Norway 1682 Alma Mater: Figure Study 1930-40 Munch Museum, Oslo, Norway 1683 Street Workers in Snow 1931-33 Munch Museum, Oslo, Norway 1684 Snow Shovellers on the Building Site 1931-33 Munch Museum, Oslo, Norway 1685 Workers on the Building Site. Draft for a Decoration of Oslo City Hall 1931-33 Munch Museum, Oslo, Norway 1686 Workers in Snow: Five Fragments 1931-33 Munch Museum, Oslo, Norway 1687 Workers in Snow: Fragment 1931-33 Munch Museum, Oslo, Norway 1688 Street Workers in Snow: Fragment 1931-33 Munch Museum, Oslo, Norway 1689 Summer on Karl Johan 1931 The Art Museums in Bergen, Norway. Bergen Art Museum (Stenersen's Collection) 1690 The Wave 1931 Munch Museum, Oslo, Norway 1691 Fritz H. Frølich 1931 Munch Museum, Oslo, Norway 1692 Fritz H. Frølich 1931 Private collection 1693 Apple Tree in the garden 1932-42 Munch Museum, Oslo, Norway 1694 Man with Horse 1932-40 Munch Museum, Oslo, Norway 1695 Henriette Olsen 1932 Private collection 1696 Henriette Olsen 1932 Munch Museum, Oslo, Norway 1697 Henriette Olsen 1932 Private collection 1698 Maggie Torkildsen 1932 Private collection 1699 Maggie Torkildsen 1932 Munch Museum, Oslo, Norway 1700 The Girl from Nordland 1932 Munch Museum, Oslo, Norway 1701 The Girl from Nordland: Five Fragments 1932 Munch Museum, Oslo, Norway 1702 The Girl from Nordland 1932 Munch Museum, Oslo, Norway 1703 de:Eberhard Grisebach 1932 Munch Museum, Oslo, Norway 1704 de:Eberhard Grisebach 1932 Munch Museum, Oslo, Norway 1705 de:Eberhard Grisebach 1932 Munch Museum, Oslo, Norway 1706 de:Eberhard Grisebach 1932 Munch Museum, Oslo, Norway 1707 Hanna Brieschke in Åsgårdstrand 1932 Munch Museum, Oslo, Norway 1708 Hanna Brieschke in Åsgårdstrand 1932 Munch Museum, Oslo, Norway 1709 The Splitting of Faust 1932-35 Munch Museum, Oslo, Norway 1710 The Fight 1932-35 Munch Museum, Oslo, Norway 1711 The Fight 1932 Munch Museum, Oslo, Norway 1712 Uninvited Guests 1932-35 Munch Museum, Oslo, Norway 1713 Rowboats at Åsgårdstrand 1932-33 Location unknown 1714 Boys Bathing 1932-33 Location unknown 1715 The Girls on the Bridge 1933-35 Kimbell Art Museum, Fort Worth, Texas, USA 1716 Meeting on the Beach 1933-35 Munch Museum, Oslo, Norway 1717 Two Women on the Shore 1933-35 Munch Museum, Oslo, Norway 1718 Two Women on the Shore 1933-35 Munch Museum, Oslo, Norway 1719 Two human Beings. The Lonely Ones 1933-35 Munch Museum, Oslo, Norway 1720 Jealousy 1933-35 Munch Museum, Oslo, Norway 1721 The Women on the Bridge 1934-40 Munch Museum, Oslo, Norway 1722 The Red House 1934-35 Munch Museum, Oslo, Norway 1723 The Red House 1934-35 Munch Museum, Oslo, Norway 1724 Karl Wefring 1934-35 Munch Museum, Oslo, Norway 1725 Karl Wefring 1934-35 Munch Museum, Oslo, Norway 1726 Annie Stenersen 1934 Axel C. Eitzen 1727 Annie Stenersen 1934 Munch Museum, Oslo, Norway 1728 Female Head 1934? Munch Museum, Oslo, Norway 1729 Johan Martin and Sten Stenersen 1935 Location unknown 1730 Johan Martin and Sten Stenersen 1935 Munch Museum, Oslo, Norway 1731 Johan Martin and Sten Stenersen 1935 Munch Museum, Oslo, Norway 1732 Ebba Ridderstad 1935 Munch Museum, Oslo, Norway 1733 Ebba Ridderstad 1935 Munch Museum, Oslo, Norway 1734 Ebba Ridderstad 1935 Private collection 1735 Ebba Ridderstad and Marika Pauli 1935 Munch Museum, Oslo, Norway 1736 Andreas Reading 1935-36? Munch Museum, Oslo, Norway 1737 Spring at Ekely 1935-43 Munch Museum, Oslo, Norway 1738 Under the Chestnut Tree 1937 Munch Museum, Oslo, Norway 1739 Under the Chestnut Tree 1937 Munch Museum, Oslo, Norway 1740 Encounter beneath the Chestnut Tree 1937 Munch Museum, Oslo, Norway 1741 Encounter beneath the Chestnut Tree 1937 Munch Museum, Oslo, Norway 1742 Nicolai Rygg 1937-38 Private collection 1743 Nicolai Rygg 1938 Norges Bank 1744 Nicolai Rygg 1938 University of Central Oklahoma, Edmond, Oklahoma, USA 1745 Henrik Bull 1939 Private collection 1746 Henrik Bull 1939 Munch Museum, Oslo, Norway 1747 Hand Reaching out for Bottles 1938 (?) Munch Museum, Oslo, Norway 1748 Self-Portrait with Bottles 1938 (?) Munch Museum, Oslo, Norway 1749 Self-Portrait by the Window Ca. 1940 Munch Museum, Oslo, Norway 1750 Self-Portrait, with a Dod's Head on the Plate 1940-42 Munch Museum, Oslo, Norway 1751 Autumn Landscape 1940-43 Munch Museum, Oslo, Norway 1752 Self- Portrait 1940-43 Munch Museum, Oslo, Norway 1753 Anemones 19 Munch Museum, Oslo, Norway 1754 People Sunbathing in a Bay 1940-42 Munch Museum, Oslo, Norway 1755 Naked Men in Birch Forest 1940-42 Munch Museum, Oslo, Norway 1756 Beach 1940-43 Munch Museum, Oslo, Norway 1757 People Sunbathing 1940-42 Munch Museum, Oslo, Norway 1758 Beach 1940-43 Munch Museum, Oslo, Norway 1759 Beach Scene 1940-43 Munch Museum, Oslo, Norway 1760 Beach Scene 1940-43 Munch Museum, Oslo, Norway 1761 Beach Scene 1940-43 Private collection 1762 Bathers on the Beach 1940-42 Munch Museum, Oslo, Norway 1763 Alma Mater 1940 Munch Museum, Oslo, Norway 1764 Self-Portrait. Between the Clock and the Bed 1940-43 Munch Museum, Oslo, Norway 1765 Visiting at Ekely 1942 Munch Museum, Oslo, Norway 1766 Visiting at Ekely 1942 Munch Museum, Oslo, Norway 1767 Study of a Head 1942-43 Munch Museum, Oslo, Norway 1768 Young Woman 1942 Munch Museum, Oslo, Norway 1769 Female Nude 1942 Munch Museum, Oslo, Norway 1770 Woman with Pumpkin 1942 Munch Museum, Oslo, Norway 1771 Woman with Pumpkin 1942 Munch Museum, Oslo, Norway 1772 Flirting in the Park 1942 Munch Museum, Oslo, Norway 1773 Flirting in the Park 1942 Munch Museum, Oslo, Norway 1774 Midsummer Night's Eve 1942 Munch Museum, Oslo, Norway 1775 Two Women by the veranda Steps 1942 Munch Museum, Oslo, Norway 1776 Woman by the veranda Steps 1942 Munch Museum, Oslo, Norway 1777 Painter by the Wall 1942 Munch Museum, Oslo, Norway 1778 Haymaking 1942 Munch Museum, Oslo, Norway 1779 Haymaking 1942 Munch Museum, Oslo, Norway 1780 Dog's Head 1942 Munch Museum, Oslo, Norway 1781 Self-Portrait by the Arbour 1942 Munch Museum, Oslo, Norway 1782 Rolf Hansen 1943 Munch Museum, Oslo, Norway 1783 Rolf Hansen 1943 Munch Museum, Oslo, Norway 1784 Rolf Hansen 1943 Munch Museum, Oslo, Norway 1785 Rolf Hansen 1943 Munch Museum, Oslo, Norway 1786 Portrait of a Man 1943 Munch Museum, Oslo, Norway 1787 Erik Pedersen 1943 Solomon R. Guggenheim Museum, New York City, USA 1788 The Man in the Cabbage Field 1943 Munch Museum, Oslo, Norway 1789 Self-Portrait with Pastel Stick 1943 Munch Museum, Oslo, Norway ==References== * ==Notes== Category:Lists * Category:Norwegian culture",
 "title": "List of paintings by Edvard Munch"
}