{
 "id": "594843",
 "text": "The 2018 Illinois gubernatorial election took place on November 6, 2018, to elect the Governor of Illinois. The Democratic and Republican primary elections took place on March 20, 2018 and the Libertarian Party state convention was held on March 4th. Incumbent Republican Governor Bruce Rauner ran for re-election to a second term against Democrat J. B. Pritzker and Libertarian Kash Jackson. In March 2018, the primary results concluded with J. B. Pritzker winning the Democratic nomination with Rauner winning the Republican nomination. Meanwhile, Kash Jackson won the Libertarian Party nomination during a state convention in Bloomington, IL. Pritzker defeated incumbent Rauner in the general election by a landslide. ==Republican Party== ===Candidates=== ====Declared==== * Jeanne Ives, State RepresentativeHinz, Greg. \"Did Rauner just uncork a challenge from the right?\", Crain's Chicago Business, September 29, 2017. Retrieved September 29, 2017. ** Running mate: Richard Morthland, former State Representative * Bruce Rauner, incumbent Governor ** Running mate: Evelyn Sanguinetti, incumbent Lieutenant Governor File:Jeanne Ives (21787919559).jpg| File:Bruce Rauner 2016 cropped.jpg| ===Primary results=== ==Democratic Party== ===Candidates=== ====Declared==== * Daniel Biss, State Senator * Running mate: Litesa Wallace, State Representative. Wallace replaced Ramirez-Rosa on September 8, 2017. *Former running mate: Carlos Ramirez-Rosa, Chicago Alderman. Biss removed Ramirez-Rosa from the ticket on September 6, 2017. * Bob Daiber, Madison County Regional Superintendent of Schools * Running mate: Jonathan W. Todd, social worker * Tio Hardiman, former director of CeaseFire and candidate for Governor in 2014 * Running mate: Patricia Avery, President and CEO of the Champaign County chapter of the NAACP. * Chris Kennedy, former Chairman of the University of Illinois Board of Trustees and member of the Kennedy family *Running mate: Ra Joy, executive director of CHANGE Illinois, a government reform coalition.Sfondeles, Tina. \"Kennedy chooses running mate: Ra Joy, who lost son to gun violence \", Chicago Sun-Times, September 14, 2017. Retrieved September 14, 2017. * Alex Paterakis, civil engineer and business owner. * J. B. Pritzker, venture capitalist and philanthropist * Running mate: Juliana Stratton, State Representative File:Daniel Biss 2012 (cropped).jpg| File:Gray - replace this image male.svg| File:Gray - replace this image male.svg| File:Chris Kennedy Chi Hack Night 15 (cropped).png| File:Gray - replace this image male.svg| File:J. B. Pritzker.png| ====Withdrawn==== *Scott Drury, State Representative, withdrew on September 19, 2017. He is running for Illinois Attorney General. * Former running mate: Alex Hirsch, political operative *Ameya Pawar, Chicago Alderman, withdrew on October 12, 2017 * Former running mate: Tyrone Coleman, mayor of Cairo, Illinois ===Polling=== Poll source Date(s) administered Sample size Margin of error Chris Kennedy J.B. Pritzker Daniel Biss Kurt Summers Tio Hardiman Bob Daiber Others Undecided We Ask America October 17–18, 2017 1,154 ± 3% 15% 39% 6% – 1% 1% 2% 36% Garin-Hart-Yang June 26–29, 2017 602 ± 4% 44% 38% – – – – – 18% Greenberg Quinlan Rosner March 2–6, 2017 500 ± 4.4% 44% 11% – 7% – – 4% 34% ===Primary results=== ==Libertarian Party== ===Candidates=== ====Winner==== * Kash Jackson, Navy Veteran and activist ====Failed==== * Jon Stewart, retired professional wrestler, Republican candidate for the State House in 1998 and Republican candidate for IL-05 in 2009 File:Grayson \"Kash\" Jackson.jpg| File:Gray - replace this image male.svg| ==General election== === Predictions === Source Ranking As of The Cook Political Report September 14, 2018 Rothenberg Political Report September 14, 2018 Sabato's Crystal Ball September 20, 2018 Real Clear Politics September 19, 2018 Daily Kos Elections September 17, 2018 Governing September 19, 2018 Politico September 19, 2018 Fox News September 19, 2018 ===Polling=== Poll source Date(s) administered Sample size Margin of error Bruce Rauner (R) J. B. Pritzker (D) Kash Jackson (L) Sam McCann (C) Other Undecided Research America Inc. September 5–13, 2018 1,024 ± 3.1% 27% 44% 4% 6% 0% 14% Marist College August 12–16, 2018 734 ± 4.4% 30% 46% 6% 4% 2% 13% Victory Research August 12–14, 2018 1,208 ± 2.8% 30% 41% 2% 9% – 18% (C-McCann) July 25–29, 2018 800 ± 3.5% 29% 42% 6% 11% 1% 10% Illinois Public Opinion (D) July 12, 2018 423 ± 5.0% 26% 39% 1% 10% – 23% Victory Research June 26–28, 2018 1,208 ± 2.8% 30% 45% 2% 5% – 18% We Ask America June 9–11, 2018 600 ± 4.0% 27% 36% – – 26% 11% Victory Research May 22–24, 2018 1,208 ± 2.8% 32% 47% – – – – Victory Research April 18–21, 2018 1,208 ± 2.8% 31% 49% – – – 19% Ogden & Fry March 23, 2018 667 ± 3.9% 28% 46% – – – 26% Southern Illinois University February 19–25, 2018 1,001 ± 3.0% 35% 50% – – – 15% Public Policy Polling (D-Biss) February 5–6, 2018 600 ± 3.3% 35% 48% – – – 17% Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 30% 47% – – – 23% Hypothetical polling ;with Jeanne Ives and J. B. Pritzker Poll source Date(s) administered Sample size Margin of error Jeanne Ives (R) J. B. Pritzker (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 20% 40% 40% ;with Bruce Rauner and Chris Kennedy Poll source Date(s) administered Sample size Margin of error Bruce Rauner (R) Chris Kennedy (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 28% 41% 31% ;with Bruce Rauner and Daniel Biss Poll source Date(s) administered Sample size Margin of error Bruce Rauner (R) Daniel Biss (D) Undecided Paul Simon Institute February 19–25, 2018 1,001 ± 3.0% 34% 48% 18% Public Policy Polling (D-Biss) February 5–6, 2018 600 ± 3.3% 30% 47% 23% ;with Bruce Rauner and generic Democrat Poll source Date(s) administered Sample size Margin of error Bruce Rauner (R) Generic Democrat Undecided Normington Petts (D-DGA) July 18–20, 2017 600 ± 4.0% 37% 49% 14% Anzalone Lizst Grove (D) February 15–20, 2017 800 ± 3.5% 32% 47% 21% Normington Petts (D-DGA) January 3–5, 2017 600 ± 4.0% 35% 45% 20% Poll source Date(s) administered Sample size Margin of error Kyle McCarter (R) J. B. Pritzker (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 22% 42% 36% Poll source Date(s) administered Sample size Margin of error Kyle McCarter (R) Chris Kennedy (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 21% 42% 37% Poll source Date(s) administered Sample size Margin of error Dan Proft (R) J. B. Pritzker (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 25% 42% 33% Poll source Date(s) administered Sample size Margin of error Dan Proft (R) Chris Kennedy (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 23% 43% 34% Poll source Date(s) administered Sample size Margin of error Bill Brady (R) J. B. Pritzker (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 26% 42% 32% Poll source Date(s) administered Sample size Margin of error Bill Brady (R) Chris Kennedy (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 25% 42% 33% ;with Jeanne Ives and Chris Kennedy Poll source Date(s) administered Sample size Margin of error Jeanne Ives (R) Chris Kennedy (D) Undecided Ogden & Fry (R-Liberty Principles PAC) October 2, 2017 517 ± 4.4% 19% 38% 43% ;with Bruce Rauner and Dick Durbin Poll source Date(s) administered Sample size Margin of error Bruce Rauner (R) Dick Durbin (D) Undecided We Ask America July 26, 2016 824 ± 3.5% 35% 44% 22% ==References== Category:2018 elections in the United States Category:2018 in Illinois Category:Gubernatorial elections in the United States",
 "title": "2018 Illinois gubernatorial election"
}