{
 "id": "594801",
 "text": "The Sámi ethnic group in Norway, or Sámi people in Norway, are part of an ethnic group that also lives in Sweden, Finland, and Russia. In Norway, the core-area of the Sami, is in 4 municipalities in Finnmark county and 1 municipality in Troms county: Kautokeino, Karasjok, Porsanger, Tana og Nesseby and Kåfjord. The core area is inside Norway's part of Sapmi (or Lapland). (Lapland is a part of 4 countries: Norway, Sweden, Finland and Russia.) The Sami languages in Norway, are Northern Sami (en), Lule Sami language (en), and Southern Sami language (en). ==The government's definition== \"[P]eople who want to vote for\", or want to be a member of \"the Sami Parliament (en), they must register as Sami. The definitions of Sami\" that started to be used by \"Sami organizations, including the Nordic Sami Council, in the 1950s, became part of Norwegian law in 1987. A Sami is defined as a person who: 1) has Sami as his/her first language, or whose father or mother , or one of whose grandparents, has Sami as their first language, or 2) considers himself/herself a Sami and lives in entire accordance with the rules of the Sami society, and who is recognized by the representative Sami body as a Sami, or 3) has a father or mother who satisfies the above-mentioned conditions for being a Sami\". ==History== \"Archeological research indicates that a culture identified as Sami arose in the Scandinavian peninsula between 1500 and 1000 B.C.\" \"[R]ecorded reference to the Sami\", was made as early as 98 A.D. - by Tacitus .Odd Mathis Hætta. \"The Sami - Before and Now\". March 2002; number 2. The Norseman. p. 5\"... Tacitus ... in his De origine et situ Germanorum ... Hætta is assistant professor at the University College in Finnmark\" One account (or description) from 896 , was told to Alfred the Great, by Ohthere of Hålogaland (en) - a Norwegian chieftain, that had some connection to the English king's court.Odd Mathis Hætta. \"The Sami - Before and Now\". March 2002; number 2. The Norseman. p. 5-9 [Old] Norse literature, such as the Icelandic sagas tells about the Sami; \"Olav Tryggvason's Saga says \"that the king killed a big man who was \"troll-wise\" and \"there followed him a great number of Finns whenever he had need of them\". (\"Finns\" is a name that sometimes meant \"Sami people\".) Regarding getting the Sami to change their religion to Christianity: In the 18th century Thomas von Westen, a pietist, led missionary work (among the Sami), that has been called a concerted (or special) effort. \"About a century later, Niels Vibe Stockfleth worked among the Sami and translated [the Bible's] New Testament into\" [one of the Sami languages]. At Dovrefjell when Harald Hardrada was king, there was profit from the keeping of herds of reindeer, and the business was at its highest intensity. In regard to Sami (in Norway) that had reindeer herds; when these Sami moved their herds (every year), then they would interact with people who lived permanently on the coast; the interaction also included verdde: a friendship of convenience; for example, Sami needed milk and fish after having been on a plateau (or highland) for some weeks; Sami might need repair of equipment; trade was done: People from the coast traded fish for meat from reindeer.Ole Magnus Rapp (2017-07-27). \"Konfliktløsning via vennskapelig fotball. Nyttevennskap\". Klassekampen. p. 9. People living permanently on the coast in North Norway, were [largely] Sami; these Sami had permanent housing, and it became easier for these Sami to stop behaving like Sami; in some areas one was not allowed to own land, if one was Sami; some Sami changed names, to names that might sound more Norwegian (and family names such as Sæter, Strømeng, and Kalvemo became new family names). Sami language [largely] disappeared among the Coastal Sami. Sami that did reindeer farming, and Coastal Sami slowly lost the close contact [between the two groups]. ===Policies to \"Norwegianize\" the Sami=== \"There were organized attempts to eradicate [or make to disappear ] the Sami language and culture[,] as a step in assimilating the Sami into Norwegian society\".Kjetil A. Flatin. \"The view from here\". March 2002; number 2. The Norseman. p. 3 Policies to \"Norwegianize\", Samis - were in place from the late 1840s, into the 1980s. \"From the late 1840s to the 1950s, missionaries, agricultural experts and schoolteachers\" tried \"to Norwegianize the Sami\"; the \"first formal act of Parliament regarding the Norwegianization of the Sami people was made in 1848: 'The government is requested to investigate ... [find out if, and how far] there should be opportunity to bring the Norwegian Lapps, especially those living in coastal areas , instruction in the Norwegian language for the enlightenment of these people, and that the result of their findings be reported to the next Parliament'\". [Norway's] authorities [or government] made \"a language directive (or rule) in 1880, which\" was \"made more forceful in 1898. It\" said \"that 'Teachers in those districts where the Lappish ... and Finnish (kvænsk) languages are permitted for the sake of facilitating instruction in the public schools shall do their utmost to spread knowledge of the Norwegian language and seek to promote its use in the circles where they work'\". Furthermore, the \"government had a major objective for the school[s]: Not a single Sami word was to be heard on the school grounds\" [or in school buildings]. \"The authorities also\" used \"economic measures to carry out the work of Norwegianization, including the Land Act. A regulation [or part of the law] from 1902\" says that \"Sale [of land] may only be made to Norwegian citizens ... who can speak, read, and write the Norwegian language and use it on a day-to-day basis\". A report by the \"Parliamentary School Commission, appointed in 1922\" said, without being able to show [ evidence], \"that that the Sami are less educable [or able to learn] than others\"; the report also said that the Sami population is less gifted and the \"Sami culture does not lend itself to development\". From around 1850, a government policy of Fornorskning [tried to remove Sami culture].«Vakre er de ikke» [«Beautiful, they are not»] An article in Klassekampen said that the policy was very rough [to Sami persons]. Into the 1980s, the policy of Fornorskning lasted in some places. ===Creation of associations=== [Possibly the first] Sami association (in Norway) was started during the New Year's weekend in 1911: Buolbmag Same Særvve, in Polmak municipality.Hans J. Henriksen. \"Sameforeninger i første del av 1900-tallet\". (January 1976) Ottar. Volume 88. p. 14-5. Published by University of Tromsø ===Other=== In regard to the Frøyningsfjell drum, sometimes called the Folldal drum: Sami authorities went to a museum in a European country and were given the drum in 2023.https://www.sagat.no/nyheter/markerer-tromme-hjemkomst/19.41075. Sagat.no. Retrieved 2023-10-30 ==Reindeer farming == Reindeer farming, which is a type of animal husbandry, is done by Sami, between the White Sea and [towards the West and the South, across Russia's Kola peninsula, Finland, Sweden and Norway, into Norway's] county of Hedmark. Trøndelag county has reindeer herding, in 30 of 38 counties.https://www.trondelagfylke.no/vare- tjenester/naring-og-innovasjon/landbruk/reindrift/. Retrieved 2025-04-07 Some of that is in the two municipalities of the Fosen peninsula. In reindeer farming, \"the Sami travel with their flocks [of reindeer] according to an established cycle\"; the cycle makes sure \"that the\" [reindeer] can eat properly during the various [or different] seasons of the year. For example, the spring migration to summer pastures, which have a rich variety of grasses and herbs, takes place just before new calves are born in May. Summer is a time when the calves grow and the adult animals regain their strength following a long, hard winter\". Among the Sami people are nomads that do reindeer farming. They lived in their cold environment by domesticating the reindeer. The Lapps were able to get everything they needed from the deer. They ate mostly meat, milk, and cheese. Their clothing was made from reindeer skins and wool. Their tents were also made from raindeer skins. The wool clothes were beautifully decorated. The Lapps protected the herds, moving with them as they migrated from summer to winter pastures. They used reindeer to pull sleds carrying their supplies. During the winter, the herds moved south of where the trees grew. The Lapps lived nearby in homes made of logs or sod. Winter clothing was made from layers of reindeer skin. The inside layer would be worn with the fur facing in toward the person's skin. The second layer was worn with the fur facing out. Boots were also made of fur and lined with grass that had been gathered during the short summer. Every evening the grass would be taken out and dried by the fire, so it would be ready to use again the next day. This way, a Lapp could be warm and comfortable in even the coldest weather. Today only a few of the Lapp people still follow the herds. Those few use modern tools on their ancient migration. They use snowmobiles to herd the reindeer and rifles to kill the wolves that chase herds. Even helicopters and radios are used to locate and move the reindeer. Most of the Lapp people now live on small farms in one of the four nations of Lapland. They raise crops and animals, including a few reindeer, to meet their needs. The sale of reindeer meat is an important source of income for the Lapp people. The Lapps were careful not to waste anything they got from the reindeer. Milk was taken from the reindeer to drink or make cheese. Meat was taken for food. The blood was frozen and then used for soup and pancakes. Knives and belt buckles were carved from the bones and antlers. The sinews (tendons) were used as sewing thread. Cleaned-out stomachs were used to carry milk or cheese. Every part of a dead reindeer was used. == Sami crafts == Sami crafts are called duodji (en:). The men make knives, drums and 'guksi' (burl cups) from wood, bone, and antlers. The women use leather and roots to make 'gakti' (clothing). Women also use birch and spruce to weave baskets. == Sami clothing == Sami clothing is called 'gakti' and was originally made from reindeer leather, but now it is usually made from wool, cotton, or silk. Usually, there are different types of clothing for men and women. == Religion and spirituality == Sami shamanism is the main religion of the Sami people. These beliefs are connected to the land, animalism, and the supernatural. There is some practice of bear worship. Sami shamanism is a polytheistic religion. It believes there are many gods. The Sami shaman are called the 'Noadi'. There are some 'wise men' and 'wise women' who try to heal people who are sick. They use rituals and herbal medicine. Some Sami people have changed their beliefs to Christianity. They join either the Russian Orthodox Church or the Lutheran. ==In popular culture== Publications by Snorri Sturluson(1178-1241) say that a Sami woman, Snøfrid, married Harald Fairhair; furthermore, none of her children or grandchildren became kings; first when Harald Hardrada became a king, then her blood became part of the blood of the royal family.Frode Korslund. \"Stammor Snøfrid?\" [\"ancestress Snøfrid?] (2017-July-24) Klassekampen. p. 16. \"Frode Korslund, cand. philol.\" ==Related pages== * Nomads ==References== Category:Nordic people Category:Arctic Category:Lapland Category:Norway",
 "title": "Sámi people of Norway"
}