{
 "id": "59495",
 "text": "A logarithmic scale is a scale used when there is a large range of quantities. Common uses include earthquake strength, sound loudness, light intensity, spreading rates of epidemics, and pH of solutions. It is based on orders of magnitude, rather than a standard linear scale. The value of each mark on the scale is the value at the previous mark multiplied by a constant. Logarithmic scales are also used in slide rules for multiplying or dividing numbers by adding or subtracting lengths on the scales. The logarithmic scale can be helpful when the data cover a large range of values – the logarithm reduces this to a more manageable range. Some of our senses operate in a logarithmic fashion (multiplying the actual input strength adds a constant to the perceived signal strength, see: Stevens' power law). That makes logarithmic scales for these input quantities especially appropriate. In particular, our sense of hearing perceives equal multiples of frequencies as equal differences in pitch. On most logarithmic scales, small multiples (or ratios) of the underlying quantity correspond to small (possibly negative) values of the logarithmic measure. == Examples == Well-known examples of such scales are: * Richter magnitude scale and moment magnitude scale (MMS) for strength of earthquakes and movement in the earth. * bel and decibel and neper for acoustic power (loudness) and electric power; * counting f-stops for ratios of photographic exposure; * rating low probabilities by the number of 'nines' in the decimal expansion of the probability of their not happening: for example, a system which will fail with a probability of 10−5 is 99.999% reliable: \"five nines\". * Entropy in thermodynamics. * Information in information theory. * Particle size distribution curves of soil Some logarithmic scales were designed such that large values (or ratios) of the underlying quantity correspond to small values of the logarithmic measure. Examples of such scales are: * pH for acidity; * stellar magnitude scale for brightness of stars; A logarithmic scale is also a graphical scale on one or both sides of a graph where a number x is printed at a distance c·log(x) from the point marked with the number 1. A slide rule has logarithmic scales, and nomograms often employ logarithmic scales. On a logarithmic scale an equal difference in order of magnitude is represented by an equal distance. The geometric mean of two numbers is midway between the numbers. Logarithmic graph paper, before the advent of computer graphics, was a basic scientific tool. Plots on paper with one log scale can show up exponential laws, and on log-log paper power laws, as straight lines (see semilog graph, log-log graph). Category:Logarithms",
 "title": "Logarithmic scale"
}