{
 "id": "595167",
 "text": "Sør-Varanger (Northern Sami: Máttá-Várjjat, Kven: Etelä-Varenki, Finnish: Etelä-Varanki, Russian: Сёр-Вара́нгер) is a municipality in the county of Finnmark, Norway. The administrative centre of the municipality is the town of Kirkenes. Located west of the Norway–Russia border, Sør-Varanger is the only Norwegian municipality that shares a land border with Russia, with the only legal border crossing at Storskog. Geography: there are fjords in the municipality, including Langfjorden and Jarfjorden. Road infrastructure: the E6 road has a bridge across Langfjorden (Finnmark): Strømmen bridge.https://www.sagat.no/leder/haster-med-ny-strommen-bru/19.42139. Sagat.no. Retrieved 2024-01-04 Culture: The sled dog race Finnmarksløpet goes thru the county. ==History== For some time until 1826, Sør-Varanger was a district that (at the same time) belonged to Russia and Norway; there was an Eastern Sami (østsamisk) population; the population was under Russia's jurisdiction. A part of Norway, it became in 1826.Forvirring om hvem er kven [Confusion about who is part of the Kven people Norway's government had a fear that the county could be lost to Finland or Russia; Finland was under Russian domination (or rule) during 1809 - 1918. Part of the fear was that Finnish- speaking Kven people would help Finland/Russia, to take Northern areas, away from [the government of] Norway. (Cwenas is the Old English name for a group of people of Finnish heritage; this group immigrated to North Norway - from Finland and Sweden.)Reidun Mellem. \"Kvenane blir gløymde i diskusjonen om fornorskningspolitikken. Er myndigheitene framleis redde for at dei ikkje er norske nok? Sanningskommisjon, ja takk\" [ Kven people are being forgotten in the discussion regarding the policies of making that group of people, more Norwegian. Is the government still scared that they are not Norwegian enough? Truth commission, yes please]. 2017-08-21. Klassekampen. pages 22-3. During the 19th century, the area was colonized by Sámi from Norway; people from Finland; and Norwegians. The mining industry in Kirkenes, and at Bjørnevatn, was started in 1906; the majority of the county's population then, were Norwegian. The people that were Finnish, mostly [lived] at three settlements: Bugøynes in the West, Pasvik in the East, and at Neiden (between Bugøynes and Pasvik); those who spoke Finnish, were in majority (in these 3 settlements). ==Economy== Media said in 2022's second quarter that the level of employment is 2,100 full-time positions.https://www.vg.no/nyheter/innenriks/i/7dAGK8/sanksjoner-rammer- grenseby-kan-ikke-bosette-finnmark-med-kanoner. VG.no. Retrieved April 9, 2022 [Around] 600 people (in 2022's first quarter) work in industries related to ships and boats, including delivering supplies and services including repairs; Kimek is one of the largest companies in the municipality.https://www.nrk.no/tromsogfinnmark/vestlige-sanksjoner-kan- ramme-600-arbeidsplasser-i-sor-varanger-_-vedum-og-vestre-til- kirkenes-1.15877047. NRK. Retrieved March 7, 2022 Regarding the economy's benefit of trade related to Russians: media said in 2022, that around 300 jobs are directly dependent on \"the co-operation with Russia\", while 670 jobs have a \"connection\" with Russia. ==Settlements== Settlements in the municipality include the villages of Bjørnevatn, Bugøynes, Elvenes, Grense Jakobselv, Hesseng, Jakobsnes, Neiden, Sandnes and Kirkenes (a town). ==Administration== The municipal council is elected until late 2027. *8 council members are from the Conservative Party *7 from Labour party *3 from Socialist Left party *3 from Progress party *2 from Centre party *2 from Red partyhttps://www.nrk.no/valg/2023/resultat/fylke/56/5605. NRK.no. Retrieved 2023-09-26 (The 25 council members were elected during the 2023 Norwegian local elections.) ==Famous people== *Roger Meyer (c. 1932), double agentOle Magnus Rapp. \"Høy 007-faktor\". 2022-12-14 Klassekampen. P. 27 https://www.ifinnmark.no/ny-bok-om-dobbeltagenten-fra-finnmark-det-var-sanne- som-meg-russerne-hadde-bruk-for/s/5-81-1698852. iFinnmark.no. Retrieved 2022-12-14 and builder of hydropower stations, ==Gallery== Kirkenes Foussgängerzon Feb 2005.jpg|Street in the town of Kirkenes Sør-Varanger museum.jpg|Sør-Varanger museum ==Related pages== *Leirpollen (concentration camp) *List of mayors in Norway that are elected until 2027 ==References== ==Other websites== Category:History of Russia Category:Municipalities of Finnmark",
 "title": "Sør-Varanger"
}