{
 "id": "59528",
 "text": "General Susilo Bambang Yudhoyono (born 9 September 1949), is an Indonesian retired military general and politician. He was the sixth President of Indonesia from 2004 to 2014. Susilo Bambang Yudhoyono is the first president to be elected directly by voters. Susilo Bambang Yudhoyono won the presidency on 20 September 2004. He defeated President Megawati Soekarnoputri. ==Life== Susilo Bambang Yudhoyono was born on 9 September 1949, in Tremas, a village in Arjosari, Pacitan Regency, East Java, to a lower-middle-class family. His father was a Javanese man named Raden Soekotjo (1925 – 4 August 2001), whose lineage can be traced to Hamengkubuwono II, while his mother was a Javanese woman named Siti Habibah (30 June 1932 – 30 August 2019). He service in military 1973 to 2000, Yudhoyono ended his military career with the rank of lieutenant general, although he would be made honorary general in 2000. ===Political=== Yudhoyono was appointed mining and energy minister in the cabinet of President Abdurrahman Wahid in 1999. According to General Wiranto, who assisted Wahid in the formation of the Cabinet, he had recommended to the president that Yudhoyono would do better as Army chief of staff. In August 2000, after a Cabinet reshuffle, Yudhoyono became the coordinating minister for politic and security affairs. One of his tasks was to separate the army from politics. This was in line with his reformist ideas on the future of Indonesian military, and is a view he has held since his days in an army policy center. Yudhoyono's supporters saw Yudhoyono's participation in the vice-presidential election as a sign of his popularity and recognised Yudhoyono's potential as a possible leader for Indonesia. One of these supporters, Vence Rumangkang approached Yudhoyono with the idea of forming a political party to help shore up support for the 2004 presidential elections. Yudhoyono approved of the idea and after going through the basic concepts, left Rumangkang in charge of forming the Party. From 12 to 19 August 2001, Rumangkang began holding a series of meetings to discuss the formation of the party while holding consultations with Yudhoyono. Yudhoyono personally led the meetings on 19 and 20 August 2001, and the basic outline of the Democratic Party was finalised. On 9 September 2001, the formation of the party was officially declared and on 10 September it was registered at the Ministry of Justice and Human Rights. The organizers behind Democratic Party's formation went to extreme lengths to make sure that PD was Yudhoyono's personal political party. The declaration of its formation was 9 September 2001, which was Yudhoyono's birthday and to start off with, the Party had 99 members. In 2004 presidential election, with 69,266,350 popular vote he replace Megawati Sukarnoputri. He re-elected in 2009 presidential election. == References == ==Other websites== * Official website Category:1949 births Category:Living people Category:Indonesian Muslims Category:Presidents of Indonesia Category:Democratic Party (Indonesia) politicians",
 "title": "Susilo Bambang Yudhoyono"
}