{
 "id": "59530",
 "text": "The Most Noble Order of the Garter is an English order of chivalry. It was started in 1348, by King Edward III of England. The Order is the highest level of knighthood that can be given by the English monarch. It is the world's oldest national order of knighthood. Membership in the Order is limited to those people who have done many great things for the United Kingdom. The Order of the Garter is made up of a very small number of people. This group includes the Sovereign (the King or Queen of Britain) and no more than 25 full members. These members are called \"Companions\". Male companions are called \"Knight Companions\". Female members are called \"Lady Companions\". There are also a number of extra members known as \"Supernumerary\" Knights and Ladies. These members are usually members of the British royal family, and monarchs of other countries. The monarch alone can grant membership to the order. He or she is known as the Sovereign of the Garter, and the Prince of Wales is known as a Knight Companion of the Garter. Knights of the Order use the post-nominal letters (KG) and Ladies of the Order (LG). Knights Companion can use the title \"Sir\" before their first name, and their wives can use the title \"Lady\" before their surnames. Ladies Companion can use the title \"Lady\" before their first name, but their husbands cannot use any title. == Current Members == * Sovereign: Charles III * Royal Knight: The Prince of Wales KG KT GCB PC Knights and Ladies Companion: # The Duke of Abercorn KG # The Lord Butler of Brockwell KG GCB CVO PC # Sir John Major KG CH PC # The Lord Luce KG GCVO PC # Sir Thomas Dunne KG KCVO # The Lord Phillips of Worth Matravers KG PC # The Lord Stirrup KG GCB # The Baroness Manningham-Buller LG DCB # The Lord King of Lothbury KG GBE # The Lord Shuttleworth KG KCVO # Sir David Brewer KG CMG CVO # Lady Mary Fagan LG DCVO # The Viscount Brookeborough KG # Lady Mary Peters LG CH DBE # The Marquess of Salisbury KG KCVO PC # The Baroness Amos LG CH PC # Sir Tony Blair KG # The Baroness Ashton of Upholland LG GCMG PC # The Lord Patten of Barnes KG CH PC # The Lord Lloyd-Webber KG # The Lord Kakkar KG KBE PC # The Lord Peach KG GBE KCB Royal Knights and Ladies Companion: # The Duke of Kent KG GCMG GCVO # The Princess Royal KG KT GCVO QSO # The Duke of Gloucester KG GCVO # Princess Alexandra, The Honourable Lady Ogilvy KG GCVO # The Duke of York KG GCVO # The Duke of Edinburgh KG KT GCVO # The Queen LG LT GCVO GBE PC # The Duchess of Gloucester LG GCVO ==References== Category:1340s establishments in England",
 "title": "Order of the Garter"
}