{
 "id": "595466",
 "text": "Kvens (Kven language/Finnish: kveeni, Norwegian: kvener, Northern Sami: kveanat) or Kven people are a Finnic ethnic minority in Norway. ==History== In the 9th century, king Alfred-the-great was told by Ottar, that kvens were a different people [or ethnic group] than Sami people or Finns. Kvens were paying taxes in Skjervøy,Bjørn Vassnes. [the invisible minority] \"Den usynlige minoriteten\". Klassekampen. 2024-04-14. P. 18 Norway, \"five hundred years ago\".https://snl.no/kvener. SNL.no. Retrieved 2024-04-30. \"I skattemanntallene for det nordlige Norge på 1500-tallet finner vi noen personer som beskrives som «Quæn» eller «Qvæn», og slike kan også tidligere ha vært til stede i området\" The usual story [or traditional story], is that kvens are descendants from Finnish peasants and fishermen who moved from the northern parts of Finland and Sweden to Northern Norway in the 18th and 19th centuries. In 1996, the government of Norway officially said that Kvens were a minority group. In 2005, Norway officially made Kven language a minority language. As of 2024, some leaders of organisations for Kven people, have made accusations that Sami people have stole [parts of] the history of Kven people; Historians disagree with those new ideas; Norwegian authorities held back (for a while) some financing to a organisation for Kven people, because authorities did not agree with controversial ideas about history.https://www.nrk.no/sapmi/xl/kvensk- finsk-riksforbund-anklager-samene-for-a-ha-stjalet-kvenenes- historie-1.16779220. Retrieved 2024-05-08 In 2024, a report said that there were Kven people in Troms and in Finnmark in the 16th century; The report was written by Sannhets- og forsoningskommisjonen.https://www.ifinnmark.no/et- forslag-til-forsoning/o/5-81-2168887. Retrieved 2025-01-07. Quote: \"I rapporten fraSannhets- og forsoningskommisjonen slås det fast at kvenene har bodd i Troms og Finnmark i flere hundre år før de første grensene ble trukket opp mellom Norge og Sverige/Finland i 1751: «Det var kvener i…Troms…og Finnmark… på 1500-tallet» (page 144).\" ==References== Category:Norway Category:Nordic people",
 "title": "Kven people"
}