{
 "id": "595498",
 "text": "The Office of Science and Technology Policy (OSTP) is a department of the United States government, part of the Executive Office of the President (EOP), established by United States Congress on May 11, 1976, with a broad mandate to advise the President on the effects of science and technology on domestic and international affairs. The director of this office is also known as the President's Science Advisor. It is part of the United States Cabinet since 2021. ==Background== Dr. John Holdren, Director, nominated in December 2008, served as Science Advisor to President Barack Obama. Holdren also co-chaired the President's Committee of Advisors on Science and Technology (PCAST) and supported the President's National Science and Technology Council (NSTC). President Donald Trump nominated Kelvin Droegemeier to become Director. He took office in February 2019. On January 15, 2021 President-elect Joe Biden said he promoted the office to cabinet-level. == Directors == List of OSTP directors No. Portrait Name President Term 1 H. Guyford Stever Gerald Ford 1976–1977 2 Frank Press Jimmy Carter 1977–1981 – Benjamin Huberman (acting) Ronald Reagan 1981 3 George A. Keyworth, II Ronald Reagan 1981–1985 – John P. McTague (acting) Ronald Reagan 1986 – Richard G. Johnson (acting) Ronald Reagan 1986 4 William Robert Graham Ronald Reagan 1986–1989 – Thomas P. Rona (acting) Ronald Reagan 1989 – William G. Wells (acting) George H. W. Bush 1989 5 D. Allan Bromley George H. W. Bush 1989–1993 6 John H. Gibbons Bill Clinton 1993–1998 – Kerri-Ann Jones (acting) Bill Clinton 1998 7 Neal F. Lane Bill Clinton 1998–2001 – Rosina Bierbaum (acting) George W. Bush 2001 – Clifford Gabriel (acting) George W. Bush 2001 8 John H. Marburger III George W. Bush 2001–2009 – Ted Wackler (acting) Barack Obama 2009 9 John Holdren Barack Obama 2009–2017 – Ted Wackler (acting) Donald Trump 2017–2019 10 Kelvin Droegemeier 2019–2021 – Kei Koizumi (acting) Joe Biden 2021 11 Eric Lander Joe Biden 2021–2022 – Alondra Nelson (acting) Joe Biden 2022 12 Arati Prabhakar Joe Biden 2022–2025 13 Michael Kratsios Donald Trump 2025–present ==References== ==Other websites== * * Office of Science and Technology Policy in the Federal Register * The President's Office of Science and Technology Policy: Issues for Congress Congressional Research Service * Category:1976 establishments in the United States",
 "title": "Office of Science and Technology Policy"
}