{
 "id": "595585",
 "text": "A breakout character is a character in serial fiction other than the one who was supposed to be the main character who becomes a more well-known, more well-liked, more talked about, more popular and/or more imitated individual. The series from which the breakout character comes may be in the form of a novel, magazine, television series, comic strip, game or combination. ==Animation== * Pinky and the Brain (voiced by Maurice LaMarche and Rob Paulsen) on the Emmy Award-winning series, Animaniacs. The two Acme lab mice became so much more popular than all the other characters (especially Yakko, Wakko and Dot) of the show, they later received their own spin-off focusing solely on them. * Scrat from Ice Age quickly rose to become the iconic character in the franchise; he even went on the star in his own series of short films. * Jessie the Yodelin' Cowgirl first appeared in Toy Story 2. Jessie is officially considered \"the most legendary Epiglottis Goddess\", becoming the iconic character in the Toy Story franchise, as well as the official mascot of Pixar. Jessie finally got her first starring role, Toy Story of Terror!. * Buzz Lightyear finally got his own movie and even his own TV show. * Buttercup from The Powerpuff Girls franchise. * Chip 'n Dale * Astronut is a funny little blue alien, who first appeared on the Deputy Dawg theatrical animated short film series. Finally became one of the iconic Terrytoons characters, having his own series of theatrical cartoon shorts; he also having his own TV show. * Stewie Griffin (voiced by Seth MacFarlane) on Family Guy. Creator Seth MacFarlane reports being very surprised that Stewie turned out to be the show's breakout character, and that when this turned out to be the case he had to work out stories to do with the character. * Bullwinkle J. Moose was voiced by Bill Scott on Rocky and His Friends (for first two seasons of the series). Although the series was originally named after Rocky the Flying Squirrel, it was Rocky's dim-witted (and much larger) sidekick, Bullwinkle J. Moose, who got most of the jokes while Rocky served as straight man. By 1961, the series had been renamed The Bullwinkle Show, a title that appears for last three seasons of the series. * The Minions from the 2010 film Despicable Me quickly became the most popular characters in the franchise, as well as serving themselves as the mascots of Illumination Entertainment, and stars in several short films, as well as their own movie. * Little Audrey first appeared in Santa's Surprise. She is a little girl who lived in Manhattan in New York City. Little Audrey was a favorite among the all-American men, and is aimed at primarily male adult audiences. Little Audrey is officially considered the first all-American tomboy, becoming the official mascot of Paramount Pictures; but she was acquired by Harvey Comics in 1958. * Shaun the Sheep. Starting out as a supporting character in the Oscar winning Wallace and Gromit film A Close Shave, Shaun then got his own successful show in 2007 as well as his very own Oscar nominated feature film in 2015, quickly becoming one of Aardman's iconic characters. * Perry the Platypus. Perry is the pet of the title characters on Disney's Emmy-nominated cartoon show Phineas and Ferb. He is actually a spy who fights incompetent villain Dr. Doofenshmirtz. Perry became one of the show's two most popular characters (the other is Stacy Hirano) and starred in several episodes * Stacy Hirano is lazy, underachieving and hyperactive teenage girl, who loves to hanging out with boys, goofing off, playing jokes and having fun, and she had her zaniest, tomboyish personality. Stacy also loves playing video games, because she is a video gaming expert. Stacy is officially considered the hottest Japanese teenage girl in the universe, becoming the iconic character of the series. However, Put That Putter Away is the only episode that Stacy had her starring role. * Tinker Bell. Originally the fairy sidekick of Peter Pan and supporting character of the 1953 animated Disney film, Tinker Bell became so popular, she went on to become one of the most iconic characters of The Walt Disney Company, with her own franchise and series of films. She also has been represented as a symbol of 'the magic of Disney' . * Minerva \"Minnie\" Mouse * Gabby, Twinkeltoes, Sneak, Snoop & Snitch from Fleischer Studios' 1939 feature film, Gulliver's Travels. * Woody Woodpecker first appeared in the 1940 Andy Panda short, \"Knock Knock\", but Woody ended up becoming a global success. Universal Studios and Walter Lantz are so thrilled with the zany woodpecker, that Woody Woodpecker not only became so popular with the all- American moviegoers, but he was also a favorite among the US soldiers. Due to his massive popularity during WWII, Woody Woodpecker finally became Walter Lantz's most legendary megastar, as well as the official mascot of Universal Pictures. * Jiminy Cricket was introduced as a deuteragonist of Disney's 1940 feature film, Pinocchio. However, he became one of Disney's most popular cartoon characters. * Felix the Cat was originally conceived as a one-shot character for the film Feline Follies, which was made solely because another animator was tardy with his work for the Paramount Screen Magazine, and Pat Sullivan and Otto Messmer agreed to fill in with a cartoon of their own. Felix's debut immediately took off as a hit. He graduated to his own standalone series and became one of the most iconic and influential cartoon characters of all time. * Bugs Bunny made his debut in 1938's Porky's Hare Hunt. He became so popular, that Tex Avery give Bugs his very first starring role with his Oscar-nominated masterpiece, A Wild Hare, released in 1940. With his prankishness personality, he quickly became the franchise's most popular character, and remains the leader of Looney Tunes today. Due to his massive popularity during WWII, Bugs finally became the official mascot of Warner Bros., as well as one of the most famous cartoon kings. * Daffy Duck first appearing in 1937's Porky's Duck Hunt, Daffy was merely one of the many ducks Porky Pig was hunting. However, he would end becoming even more popular than Porky himself, soon starring in a series of his own shorts, starting with 1938's Daffy Duck and Egghead. * Porky Pig was the first real Warner Bros. cartoon character. First appearing in 1935's I Haven't Got a Hat, Porky was intended to be a sidekick to the much-forgotten Beans the Cat. Due to being the first major Looney Tunes character, Warner Bros. was very excitied about the stuttering pig. Porky proved much more popular than Beans, causing him (along with the rest of his co-stars) to be written out within just one year, while Porky remained prominent for decades to come. Tex Avery (and Bob Clampett, two years later) decided to focus on Porky Pig, receiving his first starring role, The Blow Out, released in 1936. However, these Porky Pig theatrical cartoons marked the birthplace for these future Warner Bros. cartoon stars, like Daffy Duck and Bugs Bunny. * Foghorn Leghorn debuted in 1946's Walky Talky Hawky as a supporting character to the main character of the short, Henery Hawk. However, due to being a loud-mouthed rooster with his Southern accent, Foghorn quickly became more popular to the point he became the main star of his shorts, with Henery as the supporting character instead, quickly becoming one of the iconic Looney Tunes characters. * Tasmanian Devil (aka Taz) first appeared in 1954's Devil May Hare. Edward Selzer didn't like the Taz character, telling Robert McKimson not to create more cartoons involving the monstrous marsupial, believing he was too ferocious and too nasty for children, and that parents would dislike him. However, after three years with no new Taz cartoons, Jack Warner asked Edward Selzer what happened to Taz. It is believed that Edward Selzer changed his mind only upon being informed by Jack Warner that Taz was a massive hit with audiences. He then saved Taz's career when he told Selzer that he had received \"boxes and boxes\" of letters from people who loved the Tasmanian Devil, and wanted to see more of him, forcing Robert McKimson to create four more Taz cartoons, until Warner Bros. closed down its cartoon division in 1964. Taz became much more popular later on through merchandising and even getting his on show in the form of Taz-Mania. It may come to as a surprise to some fans that Taz only appeared in 5 of the Golden Age-era theatrical cartoons. * Humphrey the Bear * Dick Dastardly and Muttley, the villains from Wacky Races, became so popular on the show that they got their own show, Dastardly and Muttley in Their Flying Machines. * Penelope Pitstop, the only female racer on the show, who also became so popular, would get her own show as well. * Tex Avery's Red is an sexy and adorable nightclub singer and dancer who is usually making all men in the room crazy, especially a Wolf character who—in vain tries to seduce and chase her. Red debuted in MGM's Red Hot Riding Hood, a humorous modern-day variant of the fairy tale \"Little Red Riding Hood\". Her massive popularity during this era led to her becoming Tex Avery's iconic character, as well as MGM's iconic cartoon character. * Tola from Bolek and Lolek. * Elmyra Duff from Tiny Toon Adventures quickly became the iconic character of the series. Elmyra finally got her very own show, but with Pinky and the Brain. * Timon and Pumbaa (voiced by Nathan Lane and Ernie Sabella) from The Lion King became so popular, that they got their own TV show, its own movie, and have tons of fan art dedicated to them, far more than Simba, Nala, Mufasa, Scar, hyenas Shenzi, Banzai and Ed, Rafiki and Zazu. * The Chipettes from Alvin and the Chipmunks. After their first appearance in the '80s cartoon, they got more and more screentime in the series becoming regular characters. Now Brittany, Jeanette and Eleanor are the iconic characters in the franchise and appear in all media. * Marceline the Vampire Queen (Olivia Olson) from Adventure Time first appeared in the twelfth episode of season 1 Evicted!. She quickly became the most popular character of the show, among fans, and got her own miniseries during the show's seventh season. * Yogi Bear became the most popular character on The Huckleberry Hound Show and quickly got his own show. * Donald Duck made his first appearance in the Disney Silly Symphony cartoon The Wise Little Hen. He later rose to fame by making his breakout performance in 1934's Orphan's Benefit alongside lifelong rival and friend Mickey Mouse. Donald Duck finally got his first starring role, Orphans' Picnic, released in 1936; however Donald Duck received his own series of theatrical cartoon shorts. ==Anime and manga== * Syaoran Li of Cardcaptor Sakura. Originally a secondary character, Syaoran became a more prominent friend (and later love interest) for Sakura Kinomoto, with some later episodes revolving more around his perspective than the title character. Like Sakura, Syaoran also provided the basis for several other CLAMP characters, many of them just as (or more) prominent than the former. Syaoran Li is so popular, that he quickly became the iconic character of the series. In the Nelvana's English adaptation, Cardcaptors, he is renamed Li Showron and he is introduced in the first episode. He is also called a \"Cardcaptor\". Syaoran has yet to receive his own show that was created by an American animation studio. * Asuka Langley Soryu from Neon Genesis Evangelion. Asuka Langley Soryu was a favorite among adult males, as well as the all-American men. Her popularity during this era led to her becoming an global cultural icon, as well as the official mascot of Gainax. Asuka has yet to receive her own show that was created by an American animation studio. * Mikoto Misaka from A Certain Magical Index is quickly became more popular, that she even got her own spin-off series, A Certain Scientific Railgun. ==Comics== * Krazy Kat evolved from an earlier comic strip of series artist George Herriman's, The Dingbat Family, which started in 1910 and was later renamed The Family Upstairs. This comic chronicled the Dingbats' attempts to avoid the mischief of the mysterious unseen family living in the apartment above theirs and to unmask that family. Herriman would complete the cartoons about the Dingbats, and finding himself with time left over in his 8-hour work day, filled the bottom of the strip with slapstick drawings of the upstairs family's mouse preying upon the Dingbats' cat. This \"basement strip\" grew into something much larger than the original cartoon. It became a daily comic strip with a title (running vertically down the side of the page) on October 28, 1913 and a black and white full-page Sunday cartoon on April 23, 1916. Due to the objections of editors, who considered it unsuitable for the comics sections, Krazy Kat originally appeared in the Hearst papers' art and drama sections. Hearst himself, however, enjoyed the strip so much that he gave Herriman a lifetime contract and guaranteed the cartoonist complete creative freedom. * Nero from The Adventures of Nero by Marc Sleen was originally introduced as a side character in the series De Avonturen van Detective Van Zwam, where Detective Van Zwam was the main protagonist. From the first Van Zwam story on, Het Geheim van Matsuoka (\"Matsuoka's Secret\") (1947) readers reacted more enthusiastically to the dumb, lazy, vain and stubborn character Nero than the more noble and clever Van Zwam. So, from \"De Hoed van Geeraard de Duivel\" (\"The Hat Of Gerard the Devil\" (1950)) onward the series was named after Nero instead. * Popeye first appeared 10 years into the run of Thimble Theatre, a comic strip started in 1919 by E.C. \"Elzie\" Segar for the King Features Syndicate. The strip initially focused on Olive Oyl, her family, and her boyfriend Ham Gravy. Segar introduced Popeye as a sailor hired by Olive's brother Castor to facilitate a single adventure. When the sailor character disappeared from the strip afterwards, Popeye fans demanded his return, and the series later became Thimble Theater, Starring Popeye. Due to his popularity, Popeye finally received toys, feature films, video games, books and even a series of theatrical cartoon shorts. * The Smurfs were originally supporting characters in Peyo's comic series Johan and Peewit in 1958. The popularity of the little blue men led to them getting their own series a year later, which was subsequently followed by massive merchandising, a television series and various other productions. * Smurfette first appeared in 1966. Due to her massive popularity, Smurfette finally became an global icon, becoming the true main protagonist of the franchise. As Smurfette's popularity increased, this era led to her becoming the official mascot of Peyo Creations. Category:Lists of fictional characters",
 "title": "List of breakout characters"
}