{
 "id": "595872",
 "text": "{{infobox writer | image = | imagesize = | alt = | caption = | pseudonym = | birth_name = Gloria Rewoldt | birth_date = | birth_place = Detroit, Michigan, U.S. | death_date = | death_place = | resting_place = | occupation = Writer | language = English | nationality = American | ethnicity = | citizenship = | education = B.A. 1945, M.S.W. 1948 | alma_mater = University of Michigan | period = | genre = | subject = | movement = | notableworks = | spouse = Joseph L. Whelan (1948) | partner(s) = | children = 2 | relative(s) = | influences = | influenced = | awards = | signature = | signature_alt = | website = | portaldisp = }} Gloria Whelan (born November 23, 1923) is an American poet, writer (of short stories), and novelist. She is known for children's and young adult fiction. Her book Homeless Bird won the National Book Award for Young People's Fiction in 2000. ==Early life== Whelan was born in Detroit, Michigan.\"Whelan, Gloria\" . OCLC WorldCat Identities. Retrieved 2010-04-06. She studied at the University of Michigan. In 1948, she married Joseph Whelan. ==Writings== Whelan's books include many historical fiction novels, including a trilogy set on Mackinac Island and a quartet series set in communist Russia. Whelan is also the author of short stories which have appeared in The Ontario Review, The Virginia Quarterly Review, The Gettysburg Review, and other literary quarterlies. Her collection of short stories, Playing with Shadows, was published by the Illinois Press. Her stories have appeared in several anthologies and in Prize Stories: the O. Henry Awards. Whelan is, according to Liz Rosenberg in the Chicago Tribune, \"an accomplished, graceful, and intelligent writer.\" ==Awards== Whelan won the annual National Book Award for Young People's Literature in 2000 for the novel Homeless Bird. She also won the 2013 Tuscany Prize for Catholic Fiction with her short story \"What World Is This?\" and the work became the title for the independent publisher's 2013 collection of short stories. \"Gloria Whelan Papers\". de Grummond Children's Literature Collection. The University of Southern Mississippi. No date. Retrieved 2013-06-29. A major collection of materials dated 1976 to 2002. With biographical note. == Related pages == *List of poets from North America ==References== ==Other websites== * * A.S.T.A.L.@R.I.C. author page *kidsreads.com profile, includes book information * Online NewsHour: Conversation with Gloria Whelan – November 23, 2000 Category:1923 births Category:Living people Category:American children's writers Category:American novelists Category:American poets Category:Writers from Detroit",
 "title": "Gloria Whelan"
}