{
 "id": "59584",
 "text": "Columbia University (officially Columbia University in the City of New York) is a research university in the United States. It is an Ivy League university and often considered one of the best in the world. It is the fifth oldest college in the United States. It was ranked 2nd best college in the United States by Times Higher Education in 2017. It was ranked 8th best university in the world by U.S. News & World Report. The university was founded as King's College by royal charter from King George II of Great Britain. It was the first college in New York, and the fifth college in the Thirteen Colonies. A lot of the money that paid for the school came from slavery. After the American Revolution it was renamed \"Columbia College\" in 1784 and renamed once again to \"Columbia University\" in 1896 when it moved to its current location in Morningside Heights. Ninety-Six Nobel Prize winners have been at Columbia, the second most in the United States after Harvard University. Five Founding Fathers attended Columbia: Alexander Hamilton, John Jay, Robert Livingston, Gouverneur Morris and Egbert Benson. Three U.S. Presidents have attended Columbia: Barack Obama, Franklin D. Roosevelt, and Theodore Roosevelt. Ten Supreme Court Justices have attended Columbia including the most recent Associate Justice, Neil Gorsuch, and the first Chief Justice, John Jay. Other famous alumni include: Warren Buffett, Madeline Albright, and Lou Gehrig. Columbia is home to the Pulitzer Prize for good work in journalism, literature and music. FM radio was created at Columbia. The school is where the foundation of modern genetics was discovered. Its Morningside Heights campus was the first North American site where the uranium atom was split. Columbia University College of Physicians and Surgeons and College of Dental Medicine are in Washington Heights in Northern Manhattan. == References == == Other websites == * Columbia's homepage * Columbia School of General Studies * Columbia Daily Spectator - second oldest student newspaper in the nation Category:Association of American Universities Category:Ivy League * Category:1754 establishments Category:1750s establishments in the Thirteen Colonies",
 "title": "Columbia University"
}