{
 "id": "595832",
 "text": "Dr. Erna Schneider Hoover (born June 19, 1926) is an American mathematician from Irvington, New Jersey. She is known for inventing a computerized telephone switching method which \"revolutionized modern communication\" according to several reports.This architecture used \"stored program control\" to achieve an unprecedented level of flexibility. Hoover was awarded one of the first patents issued for software. It gave priority to processes concerned with the input and output of the switch over processes that were less important such as record keeping and billing. This provided more robust service to callers during peak calling times. Some of her work was done while she was recuperating from the birth of her second daughter in the hospital and at home. Hoover received a B.A. from Wellesley College in classical and medieval philosophy and history in 1948. After graduating with honors in 1948, she was inducted into Phi Beta Kappa, an honor society of liberal arts and sciences, and was honored as a Durant Scholar. She obtained a Ph.D. from Yale University in philosophy and foundations of mathematics in 1951\\. She was a professor in Swarthmore College from 1951 to 1954. Upon marrying her husband, Hoover found it difficult to secure a tenure track position, so she joined Bell Labs. Later, she worked on the development of the Safeguard Anti- Ballistic Missile System and subsequently became the first woman to head a technical department in 1978. She spent the next decade working on software applications with a particular focus on Artificial Intelligence (AI) and IMS- IBM/Unix based system communications. In 1987, after three decades of dedication to improving telecommunications as we know it, Dr. Hoover retired. Dr. Hoover was keen on publicizing the importance of K-12 education, focusing on the lack of female representation in STEM. She created one of the first conferences for the Expanding Your Horizons program in association with the American Association of the University of Women and Girl Scouts of America. She continued with a fervent focus on education as she joined the New Jersey Board of Higher Education in 1983 and has served as a chairperson of the Trenton State College Board of Trustees since 1980. Hoover was described as an important pioneer for women in the field of computer technology. ==Related pages== * Timeline of women in mathematics in the United States ==References== Category:1926 births Category:Living people Category:American mathematicians Category:Scientists from New Jersey Category:Yale University alumni",
 "title": "Erna Schneider Hoover"
}