{
 "id": "59622",
 "text": "The original Septuagint (often referred to LXX) was a translation of the Torah, the five books of Moses from the Hebrew Bible into the Greek language. It was done between the 3rd and 1st centuries BC in Alexandria. It was the first translations of the Hebrew Bible. After 350 years, the Church translated all the books of the Old Testament, and it also has books that Catholics and Orthodox Christians call the Deuterocanon. These books are called Apocrypha by Protestants because they do not think these books are sacred. An ancient tradition says that 70 Jewish scholars were in different rooms when they translated the Torah from Hebrew into Greek, yet they all produced exactly the same text. People thought this was a miracle. The Latin language word for \"70\" is septuaginta, and the word \"Septuagint\" comes from that. Another way to write \"70\" is \"LXX\" which is why writers sometimes use that as a short name for Septuagint. The Septuagint was used as the starting point for some later translations of the Bible. == Other websites == ===General=== * The Septuagint Online - Comprehensive site with scholarly discussion and links to texts and translations * Jewish Encyclopedia: Bible Translations * Catholic Encyclopedia: Septuagint Version * Catholic Encyclopedia: Versions of the Bible * A thorough analysis of the Septuagint with resources * Comparison of names in the LXX and Hebrew Bible (PDF) * Free Online Bibliography (up to date) from BiBIL * Codex: Resources and Links Relating to the Septuagint ===Texts and translations=== *Septuagint as PDF file Lacks diacritics. *Septuagint published by the Church of Greece *Plain text of the whole LXX, including the anagignoskomena * Greek-English interlinear of OT & NT. Lacks diacritics and anagignoskomena. * Bible Resource Pages - contains Septuagint texts (with diacritics) side-by-side with English translations * Septuagint and New Testament - Greek Text of the Septuagint and NT with parsing (no diacritics). Lacks anagignoskomena. * Greek text - Complete Greek text (no diacritics, needs special font) hyperlinked to Strong's concordance. Anagignoskomena do not display. * The Septuagint in Greek as a MS Word document (Requires Vusllius Old Face . Intor and book abbreviations in Latin.) * The Book of Daniel from an Old Greek LXX (no diacritics, needs special font) * Sir Lancelot C.L. Brenton's translation * The Septuagint LXX: Greek and English partial version of Brenton's edition, wiki text and PNG images. (difficult navigation) * The New English Translation of the Septuagint (NETS), preliminary edition * Project to produce an Orthodox Study Bible (OSB) whose Old Testament is based entirely on the Septuagint. * The Holy Orthodox Bible, another English translation project of the Septuagint using Greek Orthodox texts of the Septuagint * The Septuagint LXX in English (Online text of the entire LXX English translation by Sir Lancelot Brenton) ===The LXX and the NT=== * Septuagint references in NT by John Salza * The New Testament and the Septuagint - Instances where the New Testament quotes the LXX against the Masoretic Hebrew * The New Testament and the Hebrew OT - Instances where the New Testament quote agrees with the Masoretic Hebrew meaning * A defense of the quoting of the LXX by the writers of the New Testament",
 "title": "Septuagint"
}