{
 "id": "596822",
 "text": "This is a list of scientists from Africa. ==Benin== *Léopold K. Fakambi, he was a \"Knight of the National Order of Benin\" ; agronomist, d. 2021 ==Botswana== *Linah Mohohlo, was Governor of the Bank of Botswana; economist *Thomas Tlou, was the first Motswana (Botswana citizen) to be vice-chancellor of the University of Botswana ==Burkina Faso== :Pages appear in :Category:Burkinabe scientists *Lassina Zerbo, prime minister; has a PhD in Geophysics from the Université de Paris XI *Paul Kaba Thieba, former prime minister; economist ==Cameroon== *Esther Dang, Director of the Cameroon National Investment company; presidential candidate; economist *Achille Mbembe, he is a political scientist ==Chad== *Kalzeubet Pahimi Deubet, former prime minister; economist ==Egypt== ==Ghana== *Kofi Annan, was chief of the United Nations(or UN); economist *Kwesi Amissah-Arthur, was vice-president of Ghana; economist ==Kenya== ==Libya== *Mohammed Magariaf, has been president of the General National Congress; economist ==Morocco== :Pages appear in :Category:Moroccan scientists *Mahdi Elmandjra, economist, writer, sociologist; d. 2014 *Hamza Ben Driss Ottmani, was an award-winning writer, Transportation Planning Director, Secretary General of the Ministry of Transports; engineer, economist ==Nigeria== *Adebayo Adedeji, was Federal Commissioner for Economic Development & Reconstruction; Executive Secretary of the United Nations Economic Commission for Africa; economist *Clement Isong, was governor of the Central Bank of Nigeria, governor of Cross River State; economist *Farida Kabir, Nigerian-British epidemiologist ==Rwanda== *Agnes Kalibata, former minister of agriculture and animal resources ==São Tomé and Príncipe== *Manuel Pinto da Costa, former president, economist ==Sierra Leone== *J. B. Dauda - member of parliament (in Sierra Leone); economist; he died in 2017 *Ahmad Tejan Kabbah - a former president of Sierra Leone; economist; died in 2014 ==Somalia== *Hassan Ali Khayre, economist, former prime minister ==South Africa== *Basil Yamey, was an expert in the history of accounting ==Tunisia== *Chedly Ayari, was President of the Central Bank of Tunisia; cabinet member; economist *Abbas Bahri, introduced the method of the critical points at infinity, which is a fundamental step in the calculus of variations; Mathematics, Variational analysis; died in 2016 *Mohamed Talbi - the historian died in 2017 ==Uganda== *Maria Mutagamba, was minister of tourism, wildlife and antiquities; economist *Jacob Oulanyah, was Speaker of the 11th Parliament of Uganda; economist ==Related pages== *List of women scientists from Africa *List of scientists from Asia *List of scientists from Europe *List of scientists from North America *List of scientists from Oceania *List of scientists from South America *List of female scientists from Africa *Category:LGBT_scientists ==References== Africa * scientists",
 "title": "List of scientists from Africa"
}