{
 "id": "596814",
 "text": "The Justice Party, officially the South Indian Liberal Federation, was a political party in the Madras Presidencyof British India. It was established in 1916 by T. M. Nair P. Theagarayar ,Alamelu Mangai ,Dr.C.Natesanar as a result of a series of non-Brahmins conferences and meetings in the presidency. Communal division between Brahmins and non-Brahmins began in the presidency during the late-19th and early-20th century, mainly due to caste prejudices and too much Brahminical representation in government jobs. == Elections conducted and aftermath== In 1920, it won the first direct elections in the presidency and formed the government. For the next seventeen years, it formed four out of the five ministries and was in power for thirteen years. It was the main political alternative to the nationalist Indian National Congress in Madras. After it lost to the Congress in the 1937 election, it never recovered. It came under the leadership of Periyar E. V. Ramaswamy and his Self-Respect Movement. In 1944, Periyar transformed the Justice Party into the social organisation Dravidar Kazhagam and withdrew it from electoral politics. A rebel faction that called itself the original Justice Party, contested one final election, in 1952. ==Ideology== The Justice Party was isolated in Indian politics by its many controversial activities. It opposed Brahmins in civil service and politics, and this anti-Brahmin attitude shaped many of its ideas and policies. It opposed Annie Besant and her Home rule movement, because it believed home rule would benefit the Brahmins. The party campaigned against the non-cooperation movement in the presidency. It disagreed with M. K. Gandhi, primarily due to his praise for Brahminism. Its mistrust of the Brahmin–dominated Congress led it to be hostile toward the Indian independence movement. Although it professed to represent all non-Brahmins, the Justice Party eventually lost the support of Muslims and Untouchables, who accused it of serving the interests of only a few castes like Vellalars (Mudaliars, Pillais), Balija Naidus, Beri Chettis, Kapus and Kammas. The Justice Party's power period is remembered for the introduction of caste-based reservations, and educational and religious reform. In opposition it is remembered for participating in the anti-Hindi agitations of 1937–40. The party was responsible for creating Andhra and Annamalai universities and for developing the area around present-day Theagaroya Nagar in Madras city. ==References== * * * * * * * * * Category:Madras Presidency Category:1916 establishments Category:1944 disestablishments",
 "title": "Justice Party (India)"
}