{
 "id": "596829",
 "text": "This is a list of scientists from Asia. ==Afghanistan== :Pages appear in :Category:Afghan scientists :* ==Armenia== *Boris BabaianBoris A. Babayan Intel Fellow, Software and Solutions Group. Director, ArchitectureThe Elbrus-2: a Soviet-era high performance computer – history of the Elbrus project with an 18-minute video interview from the Computer History Museum oral history collection \\- he got the awards (from the Soviet Union): the USSR State Prize for his achievements in 1974 in the field of computer-aided design, and the Lenin Prize in 1987 for the Elbrus-2 supercomputer design. Since 1984, he has been a corresponding member of the USSR Academy of Sciences (later - Russian Academy of Sciences) *Yuri Oganessian - oganesson is named after him; he is one of the discoverers of that element (Chemistry) ==Azerbaijan== *Vafa Guluzade - he was a Foreign Policy State Advisor for Azerbaijan President; the political scientist died in 2015. *Ayaz Mutallibov, he was the first president of Azerbaijan; chemist *Lotfi A. Zadeh - pioneer (or one of the earliest scientists) of fuzzy logic; computer scientist, electrical engineer, mathematician; d. in 2017 ==Bangladesh== *Shegufta Bakht Chaudhuri, was Governor of Bangladesh Bank (central bank of Bangladesh); economist *Muhammad Qudrat-i-Khuda, president of the Pakistan Academy of Sciences; chemist *Muhammed Zafar Iqbal - he has a Bangladesh National Film Awards for Best Story; he is a scholar of engineering and computer science. *Taslima Nasrin, physician, writer *A. K. M. Fazlul Haque (surgeon) ==China== ==Cyprus== *Christopher A. Pissarides, he has a Nobel Prize; economist ==Georgia== *Tamaz V. GamkrelidzeTbilisi State UniversityHome Page of Tamaz Gamkrelidze (2015-07-05 not accessible) was a member of the Parliament of Georgia; assyriologist (and therefore a linguist) *Jamshid Giunashviliფერეიიდანი, ჯემშიდ გიუნაშვილი - მეგობრობის მაცნე (in Georgian) \\- he was a linguist (Iranologist); died in 2017 ==India== ==Indonesia== *Bacharuddin Jusuf Habibie - a former president of Indonesia; aerospace engineering scientist *Hary Gunarto, computer scientist *J. B. Sumarlin, was minister of finance; economist ==Iran== ==Iraq== *Ahmed Chalabi, was Deputy prime minister; mathematician *Sinan Al Shabibi, was the governor of the Central Bank of Iraq ==Israel== :Pages appear in :Category:Israeli scientists *Yehoshua Matza; economist *Ida Nudel; economist ==Japan== ==Kazakhstan== *Serikbolsyn Abdildin, chairman of the Supreme Council of Kazakhstan; economist *Askar Dzhumadildayev \\- member of the Kazakhstan National Academy of Science. He is a former member of Supreme Council of Kazakh SSR and Republic of Kazakhstan; he is a mathematician and physicist. *Kanysh Satbayev, he was one of the founders of Soviet metallogeny; first director of Kazakhstan Academy of Sciences.Абдулин А. А. Выдающийся ученый, организатор науки, общественный деятель // Вестник РАН. 1999. № 3. С. 258—230. ==Kyrgyzstan== *Askar Akayev - he is a former president of Kyrgyzstan; he is a natural scientist *Myrzageldy Kemel, was a member of Mazhilis; economist ==Laos== *Daosavanh Sanamxay - the discoverer of the Laotian giant flying squirrel(en); biologist ==Malaysia== *Ungku Abdul Aziz, was Vice-Chancellor of the University of Malaya, General Director of the Council on Language and Literature of Malaysia; economist *Martin Khor, was executive director of the South Centre (intergovernmental organisation); economist ==Myanmar== *Hla Myint, he was a pioneer of the idea that export-orientation is one of the most useful \"engine of growth\".Kaung, Kyi May, (1995) Theories, Paradigms, or Models in Burma Studies, Asian Survey. Vol. 35, No. 11 (Nov.), pp. 1030–1041; economist *Tuang Za Khai, writer, biologist (Botany), born 1986 ==Nepal== *Kumud Dhital - he is one of the members of the team that first transplanted a heart donated after circulatory death (DCD), where the heart has stopped beating; he is a surgeon. ==North Korea== *Ri Sung-gi (He is the inventor of Vinalon, and he got the Lenin Prize) ==Philippines== ==South Korea== *Jim Yong Kim, Korean-American, former president of the World Bank; anthropologist, physician *Benjamin W. Lee, Korean-American, known for his work on renormalization of the electro-weak model and gauge theory; physicist *Yanghee Choi - he is a former minister of Ministry of Science, ICT and Future Planning; he is a computer scientist. ==Sri Lanka== *Saman Kelegama, was Executive Director of the Institute of Policy Studies (Sri Lanka); economist *Stanley Jeyaraja Tambiah, won a Balzan Prize and a Fukuoka Asian Culture Prize; social anthropologist; d. 2014 ==Thailand== *Phraya Anuman Ratchathon was the first Thai scholar to conduct a serious study of Thai folkloristics, taking notes on the nocturnal village spirits of Thai folklore;anthropologist, ethnographer, d. 1969 *Abhisit Vejjajiva, has been prime minister; economist ==Turkey== * List of Turkish scientists ==Vietnam== *Hieu Van Le, Vietnamese- born Australian, a former governor of South Australia; economist *Ngô Bảo Châu - best known for proving the fundamental lemma for automorphic forms (en). He is the first Vietnamese national to have received the Fields Medal;New Scientist Mathematics 'Nobel' rewards boundary-busting work 19 August 2010 \"Aside from Lindenstrauss, this year's winners were Ngô Bảo Châu of the University of Paris-South, France, Stanslav Smirnov of the University of Geneva, Switzerland, and Cédric Villani of the Henri Poincaré Institute, Paris, France.\"The Australian Mathematical Society Asia Pacific Mathematics Newsletter April 2011 (pdf) Interview \"Vietnamese Mathematician Ngô Bἀo Châu - From A Mathematical Olympiad Medallist to A Fields Medallist\" pp. 25–30Hạ Anh & Hương Giang, \"GS Griffiths: 'Trong giới Toán học, anh Châu vẫn là người Việt'\", Vietnamnet. Retrieved 2010-8-19. mathematician ==Related pages== *List of scientists from Africa *List of scientists from Europe *List of scientists from North America *List of scientists from Oceania *List of scientists from South America *List of women scientists from Asia ==References== *",
 "title": "List of scientists from Asia"
}