{
 "id": "597116",
 "text": "The Liri is one of the main rivers in central Italy that flows through the Abruzzo and Lazio regions. It flows into the Tyrrhenian Sea under the name Garigliano. ==Geography== The Liri river has a length of ( as Garigliano), and a drainage basin with an area of approximately . The Liri-Garigliano system has a total drainage basin of . ===Course=== The Liri river starts on the sides of the Monte Camiciola, part of the Monti Simbruini of central Apennines, at an elevation of about , in the comune of Cappadocia, L'Aquila province, Abruzzo region. It flows at first to the southeast through a long valley, parallel to the general direction of the Apennines, until it gets to the city of Sora. Before Isola del Liri \"Liri Island\"), the Liri is joined by the Fibreno river and then it divides into two branches which then rejoin, surrounding the lower part of the town. One branch makes a high waterfall. A dam is built on the river after the confluence with the Sacco river, its main tributary, at Ceprano. The last important tributary of the Liri is the Melfa, with which it joins near Aquino. The river forms the border between Lazio and Campania regions and, after Cassino, it joins the Gari river and then it is known as Garigliano. After , the river flows into the Tyrrhenian Sea. The Liri river flows through 2 regions and 2 provinces. It flows through the following comuni, among others: * Abruzzo region ** L'Aquila: Cappadocia, Castellafiume, Capistrello, Civitella Roveto, Canistro, Civita d'Antino, Morino, San Vincenzo Valle Roveto, Balsorano * Lazio region ** Frosinone: Sora, Isola del Liri, Monte San Giovanni Campano, Fontana Liri, Arce, Strangolagalli, Ceprano, San Giovanni Incarico, Aquino, Pontecorvo, San Giorgio a Liri, Sant'Apollinare ==Main tributaries == The main tributaries of the Liri river are: Left tributaries: * Fibreno - 12.8 km * Melfa - 40 km Right tributaries: * Sacco - 87 km ==Gallery== File:Sora Aout 2003 119.jpg|The Liri in Sora. File:Sora fiume liri 03.JPG|The Liri in Sora. File:Isola del Liri - Castello ducale e cascata - dicembre 2010.JPG|Waterfall in Isola del Liri. File:Isola del Liri - Cascata Grande - dic 2009.JPG|Cascata Grande in Isola del Liri. File:Liri.jpg|Bridge over the Liri. ==Related pages== * List of rivers of Italy ==References== Category:Rivers of Italy",
 "title": "Liri"
}