{
 "id": "597231",
 "text": "Jake Joseph Paul (born January 17th, 1997) is an American YouTube personality who got famous on the old video app Vine. Paul is also known for playing Dirk Mann on the Disney Channel series Bizaardvark. In 2018, Paul had a boxing match against YouTube star Deji. Paul stopped Deji in the sixth round. Many boxing experts, including Tony Bellew, Matthew Macklin, Tim Storer, Carl Froch, say he performed excellent for a novice boxer. His professional boxing record currently stands at 11-1. == Early life == Paul was born in Cleveland, and grew up in Westlake, Ohio. He is the son of Pamela Ann Stepnick (née Meredith) and realtor Gregory Allan Paul. He was raised in a Christian household that went to church often. ==Career== Paul began his career in September 2013 posting videos on Vine. Before Vine shut down, Jake Paul had 5.3 million followers and 7 million plays on the app. In 2015, it was announced that Paul would be playing Dirk in Disney Channel's new comedy series Bizaardvark. On January 5, 2017, Paul went to the White House with other social media people. For his YouTube vlog channel, he hid in a bathroom. He then snuck out of the White House at 3:30am. He was not stopped by security guards. On January 17, 2017, Paul launched Team 10 with $1 million. Team 10 would help influencers be more popular. It would also help with creativity agency around teen entertainment. People who gave Paul money include Danhua Capital, Horizons Alpha, Vayner Capital, Sound Ventures & A-Grade Investments, and Adam Zeplain. On May 30, 2017, Paul released a song and music video with Team 10. It was named \"It's Everyday Bro.\" It got over 70 million views on YouTube in its first month. It is the 16th most disliked YouTube video with 5.46 million dislikes. The song became number 94 on the Billboard Hot 100 on June 24, 2017. ==Legal issues and controversies== ===Disturbances in Beverly Grove=== On July 18, 2017, Paul's neighbors in the Beverly Grove neighborhood of Los Angeles met with city council members and police officials regarding whether to file a class-action public nuisance lawsuit against Paul. This happened after Paul made his home address public. Crowds of fans gathered outside Paul's house. Neighbors complained about the noise.Barragan, Bianca; Chandler, Jerry (July 24, 2017). \"Social media ‘star’ Jake Paul renting $17K/month McMansion and driving neighbors mad\". Curbed.Wolfe, Chris (July 17, 2017). \"In Beverly Grove, Social Media Star Jake Paul’s Antics Stir Up The Neighborhood\" . KTLA 5, Los Angeles. On April 24, 2018, Paul was sued by Cobra Acquisitions for $5 million. They owned the Team 10 house ===Separation from Disney=== On July 22, 2017, the Disney Channel was filming the second season of Bizaardvark. The Disney Channel said that Paul would be leaving the TV show. Disney said, \"We've mutually agreed that Jake Paul will leave his role on the Disney Channel series 'Bizaardvark'. On behalf of the production company, the cast and crew, we thank Jake for his good work on the TV series for the past 18 months and extend our best wishes to him.\" The announcement came after a KTLA 5 news report about public complaints from Paul's neighbors. The complaints were about the noise made by Paul's pranks and parties, fire hazards, and the large crowds of Paul's fans coming together in the neighborhood.Bradley, Laura (July 25, 2017). \"Why Disney Just Severed Ties with a Famously Obnoxious YouTuber\". Vanity Fair.Wood, Lucy (July 24, 2017). \"YouTuber Jake Paul axed by Disney after bragging about turning his neighbourhood into a 'war zone'\". Metro.Malone Kircher, Madison (July 24, 2017). \"Disney Drops YouTuber Jake Paul Amid Neighborhood-Terrorizing Drama\". Select All. Paul later confirmed the news on his Twitter page. He said he would now focus more on his personal brand, his YouTube channel, his business ventures, and more adult acting roles. Paul later showed in an interview with The Hollywood Reporter that he was actually fired from Bizaardvark by Disney. Disney wanted to make the process of removing him off the show faster because of the KTLA segment. ===Explicit YouTube video=== On January 3, 2018, Paul uploaded a video to his YouTube channel titled \"I lost my virginity.\" People didn't like it for it being sexually explicit and inappropriate for his younger, teen audience. The thumbnail showed Paul and his then girlfriend Erika Costell semi-nude on a bed. Costell was on top of Paul in a suggestive manner. The thumbnail was changed with Costell fully clothed, but laying in bed in a suggestive manner. === TMZ Video === On January 5, 2018, TMZ showed a video where Paul using the word \"nigga\" whilst rapping. In the video, Paul uses the word twice, saying \"little ass nigga\" and \"I whip it like my nigga Richie Vetter, he make the man's ass so wet it gets wetter.\" ==Personal life== Paul has English, Irish, Scottish, Welsh, Jewish and German ancestry. Paul has a net worth of about $17–30 million. In November 2016, Paul started dating YouTuber and internet personality Alissa Violet. They broke up in February 2017. In April 2018, Paul started dating model Erika Costell. They ended their relationship in November 2018. Paul began dating YouTuber and internet personality Tana Mongeau in April 2019. In June 2019, they were engaged to be married. Many people did not believe that the engagement was real. On July 28 of that year, they got married in Las Vegas. InTouch later reported that the couple had not got a marriage license before the ceremony. They said that it was not a legal marriage. Buzzfeed said that Paul and Mongeau left the ceremony separately. The ceremony, which was available on pay-per-view for $50, was recorded by MTV. Mongeau said that the ceremony was something \"fun and lighthearted that we're obviously doing for fun and for content.\" The couple broke up in January 2020. Later that month, Paul started dating Julia Rose. They said that they are dating as of February 2022. ==Filmography== Film roles Year Title Role Notes 2016 Dance Camp Lance 2016 Mono Dugan Cameo 2016 Airplane Mode Himself Television roles Year Title Role Notes 2016–2018 Bizaardvark Dirk Main role (seasons 1–2) 2016 The Monroes Conrad 2016 Walk the Prank Himself Special guest 2017 The Price Is Right Himself Special guest model ==Discography== ===Extended plays=== * Litmas (2017) ===Singles=== Title Year Peak chart positions Certifications Album US CAN \"Shakey\" (with Greg Cipes) 2015 — — rowspan=\"13\" \"It's Everyday Bro\" (featuring Team 10) 2017 91 56 * RIAA: Platinum \"Ohio Fried Chicken\" (featuring Chance Sutton and Anthony Trujillo) — — \"Jerika\" (with Erika Costell featuring Uncle Kade) 86 76 \"That Ain't on the News\" — — \"Jake Paulers\" — — \"No Competition\" (with Dynamite Dylan) — — \"Saturday Night\" (featuring Chad Tepper and Nick Crompton) — — \"It's Everyday Bro\" (Remix) (featuring Gucci Mane) — — \"Malibu\" (with Chad Tepper) 2018 — — \"My Teachers\" (featuring Sunny and AT3) — — \"Randy Savage\" (featuring Team 10 and Jitt & Quan) — — \"Cartier Vision\" (featuring AT3 and Jitt & Quan) — — \"Champion\" (featuring Jitt & Quan) — — \"—\" denotes a single that did not chart or was not released. ==Bibliography== * Paul, Jake. You Gotta Want It, , Gallery Books 2016 (memoir) ==Accolades== Year Nominated work Award Category Result Ref. 2014 JakePaul (Vine) 6th Annual Shorty Awards Vineographer Award FROM THE 6TH ANNUAL SHORTY AWARDS, JAKE PAUL. Finalist in COMEDIAN, VINEOGRAPHER. shortyawards.com. Retrieved November 7, 2017. Comedian Award 2017 Himself Radio Disney Music Awards Social Media Star Radio Disney Music Awards 2017 Winners: The Complete List. ENews. Published on April 30, 2017. Retrieved 2017-11-07. JakePaulProductions (YouTube) Teen Choice Awards Choice Music Web Star Logan And Jake Paul Took Home 2 Teen Choice Awards Apiece Last Night. www.tubefilter.com. Published on August 14, 2017. Retrieved 2017-10-19. Choice YouTuber ==References== ==Further reading== * * * ==Other websites== * * Category:1997 births Category:Living people Category:American boxers Category:Comedians from Cleveland Category:Musicians from Cleveland Category:Singers from Cleveland Category:Sportspeople from Cleveland Category:American TikTokers Category:American YouTubers",
 "title": "Jake Paul"
}