{
 "id": "59744",
 "text": "An accidental is a symbol modifying a note's pitch. There are three main types of accidentals: *Sharps () raise a note's pitch by one semitone. For example, a sharp symbol on a D note indicates that the note should be played a semitone higher. *Flats () are essentially the opposite of sharps: they lower a note's pitch by one semitone. For example, a flat symbol on an A note tells the player to play the note a semitone lower. *Naturals () cancel the effects of a sharp or flat, returning a note to its standard pitch. For example, if a G is followed by a G in the same bar, a natural is used to cancel the effects of the sharp accidental. A key signature may consist of up to 7 sharps or flats. For example, the key signature for B major has five sharps (F, C, G, D, and A). ==Accidentals in notation== In musical notation, accidentals are written to the left of the note and that accidental applies for the rest of the bar; canceling an accidental within that bar is done by writing in another accidental. Below is an example of the effects of accidentals within bars: : { \\override Score.TimeSignature #'stencil = ##f \\relative c' { \\time 3/4 c' des d c des des } } Note that the natural accidental in bar 1 is used to cancel the flat accidental of the previous D, and in bar 2 the third note is D because no accidental is being used to cancel. Notes outside of the key signature must be indicated with accidentals. For example: : { \\override Score.TimeSignature #'stencil = ##f \\relative c' { \\time 4/4 \\key g \\major fis2 f e es } } ==Double sharps and double flats== Although not commonly seen, double sharps () and double flats () exist. They modify a note's pitch by two semitones. For example, the following passage contains an F: : { \\override Score.TimeSignature #'stencil = ##f \\relative c' { \\time 3/4 \\key b \\major fis dis e fis fisis gis } } ==Related pages== *Key signature *Circle of fifths *Scale (music) Category:Musical notation",
 "title": "Accidental (music)"
}