{
 "id": "598021",
 "text": "Hurricane Maria was a hurricane of notable status that began in the Atlantic Ocean. It was part of the 2017 Atlantic hurricane season. It was the most intense tropical cyclone worldwide in 2017. Maria was the 13th named storm and 8th hurricane of the 2017 Atlantic Hurricane season. Originated from easterly waves off the west coast of Africa. Maria became a tropical storm east of the Lesser Antilles on September 16 and quickly intensified to Category 5 before making landfall in Dominica on September 18. The World Meteorological Organization retired the name Maria in April 2018, replacing it with Margot for the 2023 Atlantic hurricane season, due to the large number of deaths and destruction in Puerto Rico. == Meteorological history == On September 12, originated from a tropical wave that left the west coast of Africa. It then began to develop and become more organized moving westward. On September 16, it became a tropical depression and was 580 miles (930 km) east of Barbados. The storm quickly became more tropical. It became a tropical storm the same day in 84 째F (29 째C) waters, in favorable conditions of the 80 째F (26.5 째C) that tropical storms usually require. After becoming a tropical storm, it had an eye, a clear opening at the center of the storm. 6 hours later since becoming a tropical storm, the National Hurricane Center (NHC) named it Tropical Storm Maria. On September 17, Maria turned to move west-northwest and quickly becomes a Category 1 hurricane. In just 12 hours, it became a Category 5 hurricane with maximum winds of 160 mph (260 km/h) on September 18. On the evening of September 19, Maria landed in Dominica and other islands in the Lesser Antilles. Maria then continues to move west-northwestward and into the northeastern Caribbean Sea. Maria weakened slightly to a Category 4 hurricane due to land interaction with Dominica, but soon re-strengthened to a Category 5 hurricane, reaching peak intensity with winds of 175 mph (280 km/h). Maria made landfall in Puerto Rico on September 20, and the eye of the storm increased significantly before making landfall on the island, resulting in a slightly weakened Category 4 hurricane with maximum winds of 155 mph (250 km/h) On September 22, Hurricane Maria began to weaken because wind shear began to erode it. Maria then continues to move north-northwest and the northeast of the Turks and Caicos Islands with maximum winds of 126 mph (203 km/h). On September 25, Maria continues to weaken as it moves along the southeast coast of the United States. On September 27, Maria weakened to Category 1 with maximum winds of 75 mph (120 km/h), its center moved onto the coast of North Carolina, a few miles southeast of Cape Hatteras, then weakened to a tropical storm the following day. Finally, Maria moved rapidly east- northwestward as an extratropical cyclone on September 30, then dissipated in the North Atlantic Ocean 3 days later. == Preparations and impact == On the morning of September 16, the National Hurricane Center issued its first warning that the system would become Tropical Storm Maria. Following the warnings, the government of France, Saint Lucia, and Barbados prepared for the storm. == References == Category:2017 Atlantic hurricane season Category:September 2017 events Category:October 2017 events Category:2017 in North America Category:Hurricanes in North Carolina Category:Category 5 Atlantic hurricanes Category:Deadly storms Category:Retired tropical cyclone names",
 "title": "Hurricane Maria"
}