{
 "id": "598479",
 "text": "Irreligious theism is the belief that there is a higher being, but doesn't follow organized religion, this belief can be often confused for deism, however irreligious theists often believe that god can still interfere in the world, also irreligious theists believe in supernatural events like miracles, while deists don't believe in that. The thing that is common to irreligious theism and deism is belief in the God who created the world. Irreligious theists can pray without necessarily going through a classic group place of worship (mosques, synagogues, churches) and without physical intermediary, only by thought,or in a chosen, isolated personal place. One can believe in a personal God without believing in or subscribing to the doctrines of an organized religion. They don't need religion to help to distinguish good from evil, humans being have consciousness.They can live without depending on religious descriptions telling them how to behave and even sometimes hurt them in their feelings or desires for the cause described in religious books (ex: when all religions practically reject LGBT+ people, which can push them to harm themselves or even push parents to send their children to religious conversion therapies to make them \"change\" because the religious books have decreed by their writings that this was not \"correct\") and because of the religious writings it prevents people who think that they are not compatible, from linked belief in god and personal convictions feel obliged to belong to a religious group and do not think that irreligious theism can exist, and that there are no constraints or restrictions on believing in god without going through a religion. You're also irreligious theist if you do believe in god but don't belong to a religious group or attend religious services. The ir- prefix not, means without is attached to religious for not believing in a religion. A very similar, but not necessarily identical and the same view is philosophical theism, which recognizes the existence of God on the basis ofrepresents belief in God entirely without doctrine, except for that which can be discerned by reason and the contemplation of natural laws. Philosophical theism conceives of nature as the result of purposive activity and so as an intelligible system open to human understanding, although possibly never completely understandable. It implies the belief that nature is ordered according to some sort of consistent plan and manifests a single purpose or intention, however incomprehensible or inexplicable. However, philosophical theists do not endorse or adhere to the theology or doctrines of any organized religion or church. They may accept arguments or observations about the existence of a god advanced by theologians working in some religious tradition, but reject the tradition itself. (For example, a philosophical theist might believe certain Christian arguments about God while nevertheless rejecting Christianity). Philosophical theism is very similar to deism and is based on the same assumptions. The only difference is that in philosophical theism the higher being (God) is not only the creator of the world, but also something more, beyond this, in addition to this. Philosophical theism does not exclude the possibility that this higher being may sometimes somehow interfere in the world he created. What may or may not distinguish philosophical theism from very similiar irreligious theism is that in philosophical theism the belief in God is based on reason, while in irreligious theism this is not necessarily the case, in irreligious theism it can also be one's own individual faith close to religious without a rational approach and irrational. Famous irreligious theists from history include Austrian-American mathematician, logician, and philosopher Kurt Gödel, American rapper Tupac Shakur and American author Martin Gardner. Category:Theology",
 "title": "Irreligious theism"
}