{
 "id": "598513",
 "text": "Fatehpur Sikri (Hindi: फतेहपुर सीकरी) the city of victory is a town in the Agra District of Uttar Pradesh, India. The city was founded in 1569 by the Mughal Emperor Akbar, and served as the capital of the Mughal Empire from 1571 to 1585.Akbar founded FATEHPUR SIKRI to commemorate his victory over Mewar After his military victories over Chittor and Ranthambore, Akbar decided to shift his capital from Agra to a new location 23 miles (37 km) west south- west, to honour the Sufi saint Salim Chishti. Here, he commenced the construction of a planned walled city, which took the next fifteen years in planning and construction, with a series of royal palaces, harem, courts, a mosque, private quarters and other utility buildings. He named the city Fatehabad, with Fateh, a word of Arabic origin in Persian, meaning \"victorious.\" It was later called Fatehpur Sikri. It is at Fatehpur Sikri that the legends of Akbar and his famed courtiers, the nine jewels or Navaratnas, were born. Fatehpur Sikri is one of the best preserved examples of Mughal architecture in India. == Architecture == * Buland Darwaza * Jama Masjid * Tomb of Salim Chishti * Diwan-i-Aam * Diwan-i-Khas * Ibadat Khana * Mariam-uz- Zamani's Palace * Anup Talao * Naubat Khana * Hiran Minar * Birbal's House * Panch Mahal == Demographics == Fatehpur Sikri has a population of 28,757. Males constitute 53% of the population and females 47%. Fatehpur Sikri has an average literacy rate of 46%, lower than the national average of 74%; male literacy is 57%, and female literacy is 34%. In Fatehpur Sikri, 59% of the population is under 6 years of age. Fatehpur Sikri-78-2018-gje.jpg|Diwan-i-Khas Fatehpur Sikri-76-Anup Talao-2018-gje.jpg|Panch Mahal Fatehpur Sikri-36-Dekor-2018-gje.jpg| Fatehpur Sikri-40-Birbal Bhavan-2018-gje.jpg|Birbal Bhavan Fatehpur Sikri-16-Astrologensitz-2018-gje.jpg|Astrologer's seat Fatehpur Sikri-74-Anup Talao-2018-gje.jpg|Anup Talao ==References== * * * *Fatehpur Sikri, Detailed study Arch Net Digital Library ==Other websites== * Fatehpur Sikri at Archaeological Survey of India * An interactive map of Fatehpur Sikri * Fatehpur Sikri History * 360 degree walkthrough of Fatehpur Sikri * Fatehpur Sikri Visit the city of Taj Mahal Experience its glory Category:Agra district",
 "title": "Fatehpur Sikri"
}