{
 "id": "598516",
 "text": "Murmansk Oblast (Russian: Му́рманская о́бласть, Murmanskaya oblast' ) is a federal subject in northwestern Russia. The administrative centre is Murmansk, where most of the population lives. The oblast has a population of 741,511. == History == Records show people first began to populate the area sometime between 8000 BC and 7000 BC.В. Я. Шумкин. Этапы освоения Северо-Запада Европейской Арктики, 2015http://kae.rekvizit.ru/olen/olintr.htm Кольская археологическая экспедиция The first permanent towns began to appear in the 15th century. These towns were mainly on the Tersky Coast. In the late 15th century, the area became part of the Grand Duchy of Moscow. At the time, most of the economy was based on fishing. == Oblast divisions == The oblast is divided into six districts, six closed cities and six cities and towns under the oblast's control. === Districts === The six districts are: Kandalakshsky District, Kolsky District, Kovdorsky District, Lovozersky District, Pechengsky District, Tersky District. === Closed cities === The six closed cities are: Gadzhiyevo, Ostrovnoy, Polyarny, Severomorsk, Snezhnogorsk and Zaozyorsk. These cities are controlled by the federal government. A \"closed city\" is a term for a city where residents need special permission to live there. === Cities and towns under the oblast's control === The six cities and towns under the oblast's control are: Murmansk, Apatity, Kirovsk, Monchegorsk, Olenegorsk and Polyarnye Zori. These cities have their own oblast territory. == Climate == Most of the oblast is in the arctic circle, meaning in summer the sun is in the sky all day, while at night the sun never rises. The entire oblast also has a subarctic climate, with very cold winters, and short, warm summers. The area isn't as cold as other locations of the same longitude because of the effects of the North Atlantic Current. The current's influence also means that the northern coast is generally \"warmer\" than the southern central region. == Demographics == The native people of the area are the Sámi, but they only make up 0.2% of the population today. Below is a list of the largest cities in the oblast: Rank City Population (2019) Coordinates 1 Murmansk 292,465 2 Apatity 55,201 3 Severomorsk 52,597 4 Monchegorsk 41,482 5 Kandalaksha 30,575 6 Kirovsk 26,206 7 Olenegorsk 20,697 8 Polyarny 17,605 9 Kovdor 16,435 10 Zapolyarny 14,902 Approximately 42% of the population adhere to the Russian Orthodox Church. Another 4.5% follow another form of Christianity. 1% of the population is Muslim, 12% are atheists and 28% are \"spiritual but not religious.\"Arena - Atlas of Religions and Nationalities in Russia. Sreda.org2012 Survey Maps . \"Ogonek\", № 34 (5243), 27/08/2012. Retrieved 24-09-2012. == References == == Other websites == *Official website of Murmansk Oblast *Murmansk Oblast news",
 "title": "Murmansk Oblast"
}