{
 "id": "598659",
 "text": "Jharkhand, a state of India, has twenty-four administrative districts. ==Administration== A district of an Indian state is an administrative geographical unit, headed by a district magistrate or a deputy commissioner, an officer belonging to the Indian Administrative Service. The district magistrate or the deputy commissioner is assisted by a number of officials belonging to different wings of the administrative services of the state. A superintendent of Police, an officer belonging to Indian Police Service is entrusted with the responsibility of maintaining law and order and related issues. ==History== At the time of formation, Jharkhand state had 18 districts. Later, six more districts were carved out by reorganizing these districts. The 23rd and 24th districts, Khunti and Ramgarh came into existence on September 12, 2007. ==Administrative Divisions and District== === Districts as per Divisions=== Presently, 24 districts of Jharkhand are grouped in to 5 divisions. These divisions are: # Palamu division - 3 Districts: Palamu, Garhwa, Latehar - Headquarters: Medininagar # North Chotanagpur division - 7 Districts: Chatra, Hazaribagh, Koderma, Giridih, Ramgarh, Bokaro, Dhanbad - Headquarters: Hazaribagh # South Chotanagpur division - 5 Districts: Lohardaga, Gumla, Simdega, Ranchi, Khunti - Headquarters: Ranchi # Kolhan division - 3 Districts: West Singhbhum, Saraikela Kharsawan, East Singhbhum - Headquarters: Chaibasa # Santhal Pargana division - 6 Districts: Jamtara, Deoghar, Dumka, Pakur, Godda, Sahebganj - Headquarters: Dumka === Total Districts=== Below is the list of districts. #Garhwa #Palamu #Latehar. #Chatra #Hazaribagh #Koderma #Giridih #Ramgarh #Bokaro #Dhanbad district #Lohardaga #Gumla #Simdega #Ranchi #Khunti #West Singhbhum #Saraikela Kharsawan #East Singhbhum #Jamtara #Deoghar #Dumka #Pakur #Godda #Sahebganj == Notes and references == ==Other websites== * *Travel guide to Jharkhand's districts *Jharkhand State Government Official website Category:Jharkhand",
 "title": "List of districts of Jharkhand"
}