{
 "id": "598682",
 "text": "The Indian state of Tripura borders with Bangladesh and the Indian states of Assam & Mizoram. The third smallest state in IndiaTripura the 3rd smallest state in India and also a princely state till 1949, It covers an area of 10,491 km2 (4,051 sq mi).The area of modern Tripura was ruled for several centuries by the Tripuri dynasty. It was a princely state during British rule, and joined the newly independent India.Ethnic strife between the indigenous people and Bengali population led to tension and scattered violence since its integration into the country, but the establishment of an autonomous tribal administrative agency and other strategies have led to peace. Tripura was divided into 4 districts but with effect from 21 January 2012 four more new districts was divided making a total of 8 districts in the state.new districts of tipura ==Former administrative structure== Code District Headquarters Population (2011) Area (km²) Density (/km²) Official website DH Dhalai Ambassa 377,988 2,523 157 http://dhalai.gov.in/ NT North Tripura Kailasahar 693,281 2,821 341 http://northtripura.nic.in/ ST South Tripura Udaipur 875,144 2,152 286 http://southtripura.nic.in/ WT West Tripura Agartala 1,724,619 2,997 576 http://westtripura.nic.in/ ==New list of Districts after the reorganization== For administrative purposes, the state has been divided into 8 districts, 23 subdivisions and 58 development blocks - with effect from 21 January 2012, after a Government of Tripura Decision, out of which the newly created districts are 4, subdivisions 6, development blocks 5. The four new Districts are Khowai Unakoti, Sipahijala and Gomati; the six new sub-divisions are Jirania, Mohanpur, Kumarghat, Panisagar, Jampuijala and Karbook; the five new development blocks are Yuvarajnagar, Durga Chawmuhani, Jolaibari, Silachari and Lefunga. The information here are latest updated as of 25.05.2015 District Headquarters District Magistrat Police Super Subdivisions Development Blocks Municipals Population [tentative, as per Census 2011(P), as released by the Govt of Tripura] Area (in km2) Dhalai Ambassa Dr. Sandeep R. Rathod, IAS Lal Minga Darlong 1. Kamalpur 2\\. Ambassa 3\\. Longtarai Valley 4\\. Gandachera 1. a) Salema 1\\. b) Durga Chawmuhani 2\\. a) Ambassa 3\\. a) Manu 3\\. b) Chawmanu 4\\. a) Dumburnagar 4\\. b) Raishyabari 1. a) Kamalpur Nagar Panchayet 2\\. a) Ambassa Municipal Council 377,988 NA Sipahijala Bishramganj Sri. Pradeep Kr. Chakravarty, IAS Smiti Ranjan Das 1. Bishalgarh 2\\. Jampuijala 3\\. Sonamura 1. a) Bishalgarh 2\\. a) Jampuijala 3\\. a) Melaghar 3\\. b) Kathalia 3\\. c) Boxanagar 1. a) Bishalgarh Municipal Council 3\\. a) Sonamura Nagar Panchayet 3\\. b) Melaghar Municipal Council 484,233 NA Khowai Khowai Ngurchawikunga Darlong, IAS Pradip Paul 1. Khowai 2\\. Teliamura 1. a) Khowai 1\\. b) Tulashikhar 1\\. c) Padmabil 2\\. a) Teliamura 2\\. b) Kalyanpur 2\\. c) Mungiakami 1. a) Khowai Municipal Council 2\\. a) Teliamura Municipal Council 327,391 NA Gomati Udaipur Smt. Sonal Goel, IAS Thirughana Sambardhan S 1. Udaipur 2\\. Amarpur 3\\. Karbook 1. a) Matabari 1\\. b) Kakraban 1\\. c) Killa 2\\. a) Amarpur 2\\. b) Ompi 3\\. a) Karbook 3\\. b) Silachari 1. a) Udaipur Municipal Council 2\\. a) Amarpur Nagar Panchayet 436,868 NA Unakoti Kailashahar Sri Pramatha Ranjan Bhattacharjee, I.A.S. Princi Rani 1. Kumarghat 2\\. Kailashahar 1. a) Kumarghat 1\\. b) Pecharthal 2\\. a) Gournagar 1. a) Kumarghat Municipal Council 2\\. a) Kailashahar Municipal Council 277,335 NA North Tripura Dharmanagar Santirai Riyan Bijoy Kumar Nag 1. Dharmanagar 2\\. Kanchanpur 3\\. Panisagar 1. a) Kadamtala 1\\. b) Yuvarajnagar 2\\. a) Dasda 2\\. b) Jampuihill 2\\. c) Laljuri 3\\. a) Panisagar 3\\. b) Damchara 1. a) Dharmanagar Municipal Council 415,946 NA South Tripura Belonia Dr. Debasish Basu, I.A.S. Sankar Debnath 1. Santirbazar 2\\. Belonia 3\\. Sabroom 1. a) Bakafa 1\\. b) Jolaibari 2\\. a) Hrishyamukh 2\\. b) Rajnagar 2\\. c) Bharat Chandra Nagar 3\\. a) Satchand 3\\. b) Rupaichari 3\\. c) Poangbari 1. a) Santirbazar Municipal Council 2\\. a) Belonia Municipal Council 3\\. a) Sabroom Nagar Panchayet 433,737 NA West Tripura Agartala Dr. Milind Ramteke, IAS R G K Rao 1. Sadar 2\\. Mohanpur 3\\. Jirania 1. a) Dukli 2\\. a) Mohanpur 2\\. b) Hezamara 2\\. c) Lefunga 3\\. a) Jirania 3\\. b) Mandai 1. a) Agartala Municipal Corporation b) Mohanpur Municipal Council 3\\. a) Ranirbazar Municipal Council 917,534 NA ==Demographics== The following is a list of the basic demographic data for the districts of Tripura based on the size of the district's area, arranged in descending order (The data input here is taken from 2011 Census, however the new four districts were formed in 2012 so information on those are of 2012) District Area in km2. Population Growth Rate Sex Ratio Literacy Density/KM Dhalai 2,400 377,988 12.57 945 86.82 157 South Tripura 1,534.2 433,737 14.15 956 85.09 283 Gomati 1,522.8 436,868 14.15 959 86.19 287 North Tripura 1,444.5 415,946 17.44 968 88.77 288 Sipahijala 1,044.78 484,233 14.15 952 84.14 463 Khowai 1,005.67 327,391 14.15 961 88.37 326 West Tripura 942.55 917,534 12.57 972 91.69 973 Unakoti 591.93 277,335 10.85 966 87.58 469 ==References== Category:Tripura",
 "title": "List of districts of Tripura"
}