{
 "id": "598674",
 "text": "Delhi is divided into eleven revenue districts. Each district is headed by a District Magistrate and has three subdivisions. A Subdivision Magistrate heads each subdivision. The initial nine districts came into existence from January 1997. Prior to that, there used to be only one district for whole of Delhi with district headquarters at Tis-Hazari. In September 2012, two new districts, viz. South East and Shahdara were added to the city's map,Two new districts added to Delhi in 2012 taking the total count to 11. The District Administration of Delhi is the enforcement department for all kinds of Government of Delhi and Central Government policies and exercises supervisory over numerous other functionaries of the Government. Below is the list of the districts and subdivisions of Delhi: == New List of Districts in National Capital Territory of Delhi == Sl.No. District Headquarter Sub divisions (Tehsils) 1 New Delhi Connaught Place Chanakyapuri Delhi Cantonment Vasant Vihar 2 North West Delhi Kanjhawala Rohini Kanjhawala Saraswati Vihar 3 North Delhi Narela Model Town Narela Alipur 4 West Delhi Rajouri Garden Patel Nagar Punjabi Bagh Rajouri Garden 5 South West Delhi Dwarka Dwarka Najafgarh Kapashera 6 South Delhi Saket Saket Hauz Khas Mehrauli 7 South East Delhi Defence Colony Defence Colony Kalkaji Sarita Vihar 8 Central Delhi Daryaganj Kotwali Civil Lines Karol Bagh 9 North East Delhi Seelampur Seelampur Yamuna Vihar Karawal Nagar 10 Shahdara Shahdara Shahdara Seemapuri Vivek Vihar 11 East Delhi Preet Vihar Gandhi Nagar Preet Vihar Mayur Vihar == Old List of Districts in National Capital Territory of Delhi== Sl.No. District Headquarters Area (km2) Population Census 2011 Population Census 2001 Population Census 1991 Sub divisions 1 Central Delhi Daryaganj 23.36 578,671 646,385 656,533 Daryaganj Paharganj Karol Bagh 2 North Delhi Sadar Bazaar 58.92 883,418 781,525 686,654 Sadar Bazaar Kotwali Civil Lines 3 South Delhi Saket 249.44 2,733,752 2,267,023 1,501,881 Kalkaji Defence Colony Hauz Khas 4 East Delhi Preet Vihar 48.90 1,707,725 1,463,583 1,023,078 Gandhi Nagar Preet Vihar Vivek Vihar 5 North East Delhi Shahdara 56.32 2,240,749 1,768,061 1,085,250 Shahdara Naveen Shahdara Rohtash Nagar 6 South West Delhi Palam, Nangal Raya, Delhi 420.80 2,292,363 1,755,041 1,087,573 Vasant Vihar Najafgarh Delhi Cantonment 7 New Delhi Connaught Place 34.95 133,713 179,112 168,669 Connaught Place Parliament Street Chanakyapuri 8 North West Delhi Kanjhawala 442.84 3,651,261 2,860,869 1,777,968 Saraswati Vihar Narela Model Town 9 West Delhi Rajouri Garden 130.56 2,531,583 2,128,908 1,433,038 Patel Nagar Punjabi Bagh Rajouri Garden Total 1483.0 16,753,235 13,850,507 9,420,644 ==References== *",
 "title": "List of districts of Delhi"
}