{
 "id": "598676",
 "text": "Manipur, a state of India, has sixteen administrative districts. ==Administration== A district of an Indian state is an administrative geographical unit, headed by a district magistrate or a deputy commissioner, an officer belonging to the Indian Administrative Service. The district magistrate or the deputy commissioner is assisted by a number of officials belonging to different wings of the administrative services of the state. A superintendent of Police, an officer belonging to Indian Police Service is entrusted with the responsibility of maintaining law and order and related issues. On 9 December 2016, the government created 7 new districts, bringing the total number of districts to 16. ==Divisions and Districts== * Inner Manipur Division: (Imphal) - Districts of Bishnupur, Imphal West, Imphal East, Thoubal, and Kakching * North Manipur Division: (Ukhrul) - Districts of Tamenglong, Kangpokpi, Senapati, Ukhrul, and Kamjong * South Manipur Division: (Churachandpur) - Districts of Jiribam, Noney, Pherzawl, Churachandpur, Chandel, and Tengnoupal ==Districts== The sixteen districts of Manipur state are: Code District Headquarters Population (2011) Area (km²) Density (/km²) Official website BI Bishnupur Bishnupur 240,363 496 415 http://bishnupur.nic.in/ TH Thoubal Thoubal 420,517 324 713 http://thoubal.nic.in/ EI Imphal East Porompat 452,661 497 555 http://imphaleast.nic.in/ WI Imphal West Lamphelpat 514,683 519 847 http://imphalwest.nic.in/ SE Senapati Senapati 354,772 1,573 116 http://Senapati.nic.in/ UK Ukhrul Ukhrul 183,115 2,206 31 http://ukhrul.nic.in/ CD Chandel Chandel 144,028 2,100 37 http://chandel.nic.in/ CC Churachandpur Churachandpur 271.274 2,392 50 http://churachandpur.nic.in/ TA Tamenglong Tamenglong 140,143 3,315 25 http://tamenglong.nic.in/ Not yet assigned Jiribam Jiribam Survey pending 182 Pending Yet to be created. Bifurcated from Imphal East KPI Kangpokpi (Sadar Hills) Kangpokpi Survey pending 1,698 Pending Yet to be created. Bifurcated from Senapati KAK Kakching Kakching Survey pending 190 Pending http://www.kakching.nic.in/ Not yet assigned Tengnoupal Tengnoupal Survey pending 1,142 Pending Yet to be created. Bifurcated from Chandel Not yet assigned Kamjong Kamjong Survey pending 2,338 Pending Yet to be created. Bifurcated from Ukhrul Not yet assigned Noney Noney(Longmai) Survey pending 1,076 Pending Yet to be created. Bifurcated from Tamenglong PZ Pherzawl Pherzawl Survey pending 2,128 Pending Yet to be created. Bifurcated from Churachandpur == References == Category:Manipur",
 "title": "List of districts of Manipur"
}