{
 "id": "598809",
 "text": "Roy Stewart Moore (born February 11, 1947) is an American lawyer, politician and former judge. Moore has earned significant national attention and controversy over his strongly anti-homosexual, anti-Muslim, and right-wing views, his belief that Christianity should order public policy, as well as his past ties to neo-Confederates and white nationalist groups. ==Early life== Moore was born in Gadsden, Alabama. He studied at the United States Military Academy and at the University of Alabama. He married Kayla Kisor. They have four children. Many women called him a hebephile and ephebophile after he courted them while they were young teens.Reeves, Andrée E. \"Alabama's Senate runoff election mirrors the national struggle for the heart and soul of the Republican Party.\" USApp-American Politics and Policy Blog (2017) ==Supreme Court of Alabama== Moore was elected to the position of Chief Justice of the Alabama Supreme Court in 2001, but removed from his position in November 2003 by the Alabama Court of the Judiciary for refusing to remove a monument of the Ten Commandments commissioned by him from the Alabama Judicial Building, despite orders to do so by a federal court. Moore was again elected Chief Justice in 2013, but was suspended in May 2016, for encouraging judges to continue to enforce the state's ban on same-sex marriage despite the fact that it had been deemed unconstitutional. Following an unsuccessful appeal, Moore resigned in April 2017. ==Failed governor campaigns== Moore sought the Republican nomination for the governorship of Alabama in 2006, but lost to incumbent Bob Riley in the June primary by a nearly 2-to-1 margin. He sought the Republican nomination for the office again in 2010, but placed fourth in the Republican primary. ==United States special senate race, 2017== Moore defeated incumbent Luther Strange in the Republican primary to fill the United States Senate seat vacated by Jeff Sessions upon Sessions's confirmation as Attorney General of the United States. He faced Democratic nominee Doug Jones in the special election on December 12, 2017.David Weigel, Who is Doug Jones, and can he defeat Roy Moore in conservative Alabama?, The Washington Post (September 27, 2017). According to Vox, if Moore is elected, he is likely to be the most far-right Senator, \"far afield from even the most conservative Republican currently in the Senate.\" Moore lost the election to Jones with his 48.8% to Jones's 49.6%. ===Sexual harassment allegations=== In November 2017, he was accused of sexual abuse of underage girls in the past. Republicans such as John McCain and Mitt Romney called for Moore to drop out of the race after the allegations were reported. Other senators withdrew their endorsements of Moore's Senate candidacy. Days later, Senate Majority Leader Mitch McConnell announced that he believes the women who made the accusations and that Moore should \"step aside\". Speaker of the House Paul Ryan also called for Moore to abandon his campaign. President Donald Trump, however, expressed support for Moore. ==2020 Senate race== Moore announced on June 20, 2019 that he would challenge for Doug Jones once again for his Senate seat in the 2020 election. He did not however win the republican primary election, losing to Jeff Sessions and senator-elect Tommy Tuberville. ==References== ==Other websites== * Judge Roy Moore for Senate , Campaign website. * Foundation For Moral Law, legal organization chaired by Moore. * at WorldNetDaily * * – archive of Montgomery Advertiser stories related to Roy Moore. * Category:1947 births Category:Living people Category:Lawyers from Alabama Category:American judges Category:Politicians from Alabama Category:Republican Party (United States) politicians Category:People from Gadsden, Alabama Category:Democrats (United States)",
 "title": "Roy Moore"
}