{
 "id": "599253",
 "text": "The following is a list of notable deaths in October 2017. For notable deaths before the current month, please see \"Previous months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non- humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==October== ===1=== *Hansje Bunschoten, 59, Dutch Olympic swimmer (1972) and television presenter, complications from breast cancer.Topzwemster Hansje Bunschoten (59) overleden *Edward B. Giller, 99, American Air Force general, Director of the Air Force Nuclear Weapons Center (1950–1960), pneumonia complicated by Alzheimer's disease. *Robert D. Hales, 85, American religious leader, member of the Quorum of the Twelve Apostles (since 1994). *Andy Hopkins, 67, American football player (Houston Oilers, Hamilton Tiger-Cats, Montreal Alouettes). *Arthur Janov, 93, American psychologist (The Primal Scream), creator of primal therapy, respiratory arrest complicated by a stroke.Primalterapins uppfinnare Arthur Janov död *Edmond Maire, 86, French labor union leader and activist, Secretary General of CFDT (1971–1988).Mort d’Edmond Maire, ancien secrétaire général de la CFDT *Stephen Paddock, 64, American accountant, perpetrator responsible for the 2017 Las Vegas Strip shooting, suicide by gunshot. *Philippe Rahmy, 52, Swiss poet and writer, Swiss Literature Awards laureate (2017), complications from osteogenesis imperfecta.Philippe Rahmy, une plume envolée au ciel *Larissa Volpert, 91, Russian-Estonian philologist and chess Woman Grandmaster, Soviet women's chess champion (1954, 1958, and 1959) and Woman International Master (1954).Умерла Лариса Ильинична Вольперт ===2=== *Evangelina Elizondo, 88, Mexican actress (Frontera Norte, El Castillo de los Monstrous, A Walk in the Clouds), singer (\"La sensacional Evangelina\") and writer (Pensamiento abierto).Muere la actriz Evangelina Elizondo a los 88 años *Robert Elsie, 67, Canadian-born German linguist and writer (Albanian Literature : A Short History, The Highland Lute: The Albanian National Epic), complications from ALS.Robert Elsie, one of the greatest Albanologists, passes away at 67 *Solly Hemus, 94, American baseball player (St. Louis Cardinals, Philadelphia Phillies) and manager. *Klaus Huber, 92, Swiss composer and academic.Fallece El Compositor Suizo Klaus Huber *Kim Un-yong, 86, South Korean sports administrator, vice-president of the International Olympic Committee (1983–2005). *Paul Otellini, 67, American businessman, CEO of Intel (2005–2013). *Tom Petty, 66, American Hall of Fame musician (Tom Petty and the Heartbreakers, Traveling Wilburys, Mudcrutch) and actor (King of the Hill), cardiac arrest complicated from accidental pain killer and fentanyl overdose. *Robert Yates, 74, American racing team owner (Yates Racing), NASCAR Winston Cup champion (1999), liver cancer. ===3=== *Rodney Bickerstaffe, 72, British trade unionist, General Secretary of NUPE (1982–1993) and UNISON (1996–2001). *Ming Chang, 85, Chinese-born American naval officer, United States Navy Inspector General (1987–1992), complications from Parkinson's disease. *Chittani Ramachandra Hegde, 84, Indian artist and dancer (Yakshagana), recipient of the Padma Shri (2012), stroke complicated by pneumonia. *John Herrnstein, 79, American baseball player (Philadelphia Phillies, Chicago Cubs, Atlanta Braves) and football player (Michigan Wolverines), complications from leukemia. *Michel Jouvet, 91, French oneirologist and neurobiologist, developer of Modafinil, discoverer of REM sleep and member of the French Academy of Sciences (since 1977).Mort de Michel Jouvet, scientifique du rêve *Isabella Karle, 95, American scientist (Manhattan Project), Fellow of the American Academy of Arts and Sciences (since 1993), brain cancer.Isabella L. Karle, chemist who helped reveal structure of molecules, dies at 95 *Victorino Martín, 88, Spanish Fighting Bull cattlerancher, stroke.Muere el ganadero Victorino Martín *Lance Russell, 91, American professional wrestling announcer and commentator (CWA, USWA, WCW), complications from a broken hip. *Jalal Talabani, 83, Iraqi-Kurdish politician, Prime Minister (2003) and President (2005–2014), cerebral hemorrhage complicated by a stroke. ===4=== *Davoud Ahmadinejad, 67, Iranian politician, Chief of Staff of the Presidential House (2005–2008), heart attack.داود احمدی‌‌نژاد درگذشت *Bronisław Chromy, 92, Polish sculptor (Wawel Dragon).Nie żyje prof. Bronisław Chromy. Twórca Smoka Wawelskiego miał 92 lata *Liam Cosgrave, 97, Irish politician, Taoiseach (1973–1977), Leader of the Opposition (1965–1973) and Leader of Fine Gael (1965–1977). *John R. Miller, 79, American human rights activist and politician, Ambassador-at-Large to Monitor and Combat Trafficking in Persons (2002–2006) and member of the U.S. House of Representatives from Washington's 1st congressional district (1985–1993), cancer. *Jesús Mosterín, 76, Spanish anthropologist and philosopher, lung cancer.Muere Jesús Mosterín, el filósofo de espíritu científico. ===5=== *Eberhard van der Laan, 62, Dutch politician and lawyer, Minister for Housing, Communities and Integration (2008–2010), Mayor of Amsterdam (2010–2017), lung cancer.Amsterdamse burgemeester Eberhard van der Laan (62) overleden *Giorgio Pressburger, 80, Hungarian-born Italian novelist (The Law of White Spaces, Teeth and Spies, Snow and Guilt), recipient of the Viareggio Prize (1998).Elhunyt Giorgio Pressburger magyar származású olasz író *Sylke Tempel, 54, German journalist (Internationale Politik, Der Tagesspiegel, Profil) and novelist (Epithelial Abnormalities of the Cervix Uteri), complications from injuries sustained by a falling tree.Berliner Politik-Expertin in Heiligensee von Baum erschlagen *Anne Wiazemsky, 70, French actress (Au Hasard Balthazar, Teorema, La Chinoise) and novelist (Canines, Une Poignée de Gens, Hymnes à l’Amour), cancer. ===6=== *Roberto Anzolin, 79, Italian footballer (Palermo, Juventus, national team).Morto Anzolin, portiere della Juve per 9 anni *Terry Downes, 81, British boxer, world champion (1961–1962) and actor (The Fearless Vampire Killers, Five Ashore in Singapore, Caravaggio). *Darsi Ferrer Ramírez, 47, Cuban journalist, doctor and Castro dissident, prisoner of conscience (2009–2010).Encuentran muerto a opositor cubano en West Palm Beach *Marek Gołąb, 77, Polish weightlifter, Olympic bronze medalist (1968).Polskie ciężary w żałobie, nie żyje Marek Gołąb *Connie Hawkins, 75, American Hall of Fame basketball player (Harlem Globetrotters, Pittsburgh Pipers, Phoenix Suns). *Toon Geurts, 85, Dutch sprint canoer, Olympic silver medalist (1964).Olympische medaillewinnaar Antoon Geurts uit Veldhoven overleden *Ralphie May, 45, American comedian (Last Comic Standing) and actor (The Wayne Brady Show), heart attack complicated by pneumonia. ===7=== *Kazys Almenas, 82, Lithuanian physicist, engineer and publisher.Atsisveikinimas su profesoriumi Kaziu Almenu vyks antradienį *Vyacheslav Vsevolodovich Ivanov, 88, Russian philologist and semiotician, member of the Russian Academy of Sciences (since 2000).Ушел из жизни выдающийся ученый Вячеслав Иванов *Ole Krarup, 82, Danish politician, MEP (1994–2007), complications from pneumonia.Ole Krarup er død *Jim Landis, 83, American baseball player (Chicago White Sox). *Konstantin Sarsania, 49, Russian football player (Dynamo Moscow, Spartak Vladikavkaz, Asmaral Moscow) and manager (Zenit Saint Petersburg, Fakel Voronezh, Atlantas).Скончался спортивный директор «Зенита» Константин Сарсания *Washington SyCip, 96, Filipino-American World War II veteran and accountant, founder of the Asian Institute of Management and SGV & Company, heart attack. ===8=== *László Aradszky, 82, Hungarian pop singer (Táncdalfesztivál).Meghalt Aradszky László *Gianni Bonagura, 91, Italian actor (Against the Law, Sherlock Holmes, Segni particolari: bellissimo). *Slim Chaker, 56, Tunisian politician, Minister of Youth and Sports (2011), Minister of Finance (2015–2016) and Minister of Public Health (since 2017), heart attack.Le ministre tunisien de la santé, Slim Chaker, meurt après avoir participé à un marathon *Jerry Kleczka, 73, American politician, member of the U.S. House of Representatives from Wisconsin's 4th congressional district (1984–2005), complications from Parkinson's disease. *Beverly Reid O'Connell, 52, American judge, Judge of the United States District Court for the Central District of California (since 2013), complications from a brain aneurysm. *Grady Tate, 85, American soul-jazz drummer and singer (Schoolhouse Rock!). *Y. A. Tittle, 90, American Hall of Fame football quarterback (Baltimore Colts, San Francisco 49ers, New York Giants), complications from dementia. *Birgitta Ulfsson, 89, Finnish-Swedish actress (Picassos äventyr, Söndagsbarn, Rederiet) and theatre director.Birgitta Ulfsson har avlidit ===9=== *Manuel Busto, 85, French Tour de France racing cyclist.Manuel Busto, figure du cyclisme millavois, est décédé *Armando Calderón Sol, 69, Salvadorian politician, President (1994–1999), lung cancer.Fallece el expresidente Armando Calderón Sol *Allan Chumak, 82, Russian faith healer.Умер целитель Аллан Чумак *Michel Diefenbacher, 70, French politician, member of the National Assembly from Lot-et-Garonne (2004–2008).Le président du Conseil général, Michel Diefenbacher, s'est éteint *Hessie, 81, Cuban-born French-Montenegrin textile artist.Disparition de l'artiste Hessie *Rafe Mair, 85, Canadian politician, member of the Legislative Assembly of British Columbia (1975–1983), radio personality (The Standard) and journalist (The Common Sense Canadian), plaintiff of Rafe Mair v. Kari Simpson. *Jean Rochefort, 87, French actor (Lost in La Mancha, The Phantom of Liberty, Mr. Bean's Holiday). *Fernando de Szyszlo, 92, Peruvian painter, sculptor and printmaker, recipient of the Order of the Sun (2011), complications from a fall.Fernando de Szyszlo: falleció el destacado artista plástico a los 92 años ===10=== *Cho Jin-ho, 44, South Korean football player (national team, Pohang Steelers, Seongnam) and manager (Daejeon Citizen, Sangju Sangmu, Busan IPark), heart attack. *Don Pedro Colley, 79, American actor (The Dukes of Hazzard, THX 1138, Beneath the Planet of the Apes), pancreatic cancer. *Pentti Holappa, 90, Finnish poet (Long Words: Poems 1950–1994), writer (Ystävän muotokuva: Portrait of a Friend) and politician, Minister of Culture and Education (1972), respiratory failure.Finlandia-palkittu kirjailija Pentti Holappa on kuollut *Bob Schiller, 98, American television writer (I Love Lucy, All in the Family, The Carol Burnett Show), Emmy Award winner (1971, 1978), congestive heart failure. ===11=== *James R. Ford, 91, American politician, Mayor of Tallahassee, Florida (1972–1986), complications from Alzheimer's disease. *Sir Clifford Husbands, 91, Barbadian politician and judge, Governor-General of Barbados (1996–2011), heart attack. ===12=== *Muntaka Connmassie, 71, Nigerian jurist, Justice of the Supreme Court (2008–2016). ===13=== *Satish Chandra, 94, Indian historian (medieval India). *Pierre Hanon, 80, Belgian footballer (national team, R.S.C. Anderlecht).Décès à 80 ans de l'ancien international anderlechtois Pierre Hanon *Bo Holmström, 78, Swedish journalist (SVT, TV4), complications from gangrene.SVT-legendaren Bo Holmström är död *William Lombardy, 79, American chess grandmaster, heart attack. *Albert Zafy, 90, Malagasy politician, President (1993–1996), stroke.Décès à La Réunion de l'ancien Président de Madagascar Albert Zafy ===14=== *Wolfgang Bötsch, 79, German politician, Minister of Post and Telecommunications (1993–1997) and member of the Bundestag (1976–2005).Letzter Postminister Wolfgang Bötsch ist tot *Richard Wilbur, 96, American poet (Things of This World, New and Collected Poems, Responses: Prose Pieces) and literary translator, Pulitzer Prize winner (1957, 1989). ===15=== *Lekh Tandon, 88, Indian movie director (Ek Baar Kaho, Professor, Agar Tum Na Hote) and actor (Paheli, Swades, Halla Bol). ===16=== *Daphne Caruana Galizia, 53, Maltese blogger and journalist (Panama Papers), car bomb.Jiskansa b’10 piedi l-isplużjoni meta kien għaddej bil-karozza mill-Bidnija *Roy Dotrice, 94, British actor (Amadeus, A Moon for the Misbegotten, Game of Thrones), Tony Award winner (2000). *John Dunsworth, 71, Canadian actor (Trailer Park Boys, Haven, The Shipping News). *Isnilon Hapilon, 51, Filipino Islamist militant (MNLF, Al-Qaeda, Daesh), shot. *Sean Hughes, 51, Irish comedian (Never Mind the Buzzcocks, Sean's Show) and actor (The Last Detective, Round Ireland with a Fridge, They Do It with Mirrors), cardiac arrest complicated by cirrhosis. ===17=== *Danielle Darrieux, 100, French actress (The Young Girls of Rochefort, The Earrings of Madame de…, Persepolis) and singer, complications from a fall. *Gord Downie, 53, Canadian singer-songwriter (Coke Machine Glow, The Grand Bounce, Secret Path), guitarist (The Tragically Hip), actor (Men with Brooms, Trailer Park Boys: The Movie, One Week) and activist (Lake Ontario Waterkeeper), glioblastoma.Gord Downie dies at 53 *Mychael Knight, 39, American fashion designer (Project Runway), complications from intestinal infection. *Ryszard Kowalczyk, 80, Polish scientist and Soviet dissident.Ryszard Kowalczyk nie żyje. W 1971 roku z bratem wysadzili aulę Wyższej Szkoły Pedagogicznej *Ingvar Lidholm, 96, Swedish composer, recipient of the Rolf Schock Prize (1993).Tonsättaren Ingvar Lidholm död *Julian May, 86, American science fiction writer (Saga of Pliocene Exile, Galactic Milieu Series, Trillium series). ===18=== *Brent Briscoe, 56, American actor (Twin Peaks, A Simple Plan, Sling Blade) and screenwriter (Waking Up in Reno), complications from a fall. *Eamonn Campbell, 70, Irish guitarist (The Dubliners) and record producer, heart failure. *Helen DeVos, 90, American philanthropist (Helen DeVos Children's Hospital) and political donor, complications from a stroke and acute myeloid leukemia. *Marino Perani, 77, Italian football player (Atalanta, Bologna, national team) and manager (Parma), complications from a stroke. *Ricardo Vidal, 86, Filipino cardinal, Archdiocese of Lipa (1973–1981) and Cebu (1982–2011) and Cardinal- Priest of Santi Pietro e Paolo a Via Ostiense (since 1982), sepsis. *Yeoh Tiong Lay, 88, Malaysian businessman (YTL). *Issam Zahreddine, 56, Syrian Republican Guard major general (Siege of Deir ez-Zor), landmine explosion. ===19=== *Umberto Lenzi, 86, Italian movie director (Cannibal Ferox, Nightmare City, Ghosthouse) and screenwriter (Slave Girls of Sheba, Orgasmo, From Corleone to Brooklyn).Morre Umberto Lenzi, ícone do cinema policialesco italiano *Miguel Ángel Loayza, 77, Peruvian football player (Barcelona, Boca Juniors, Deportivo Cali).Fútbol peruano de luto: falleció histórico jugador Miguel Loayza ===20=== *Jeanne Brousse, 96, French resistance member (Righteous Among The Nations).La résistante Jeanne Brousse est décédée *Stan Kowalski, 91, American professional wrestler (AWA, NWA Tri-State, Stampede Wrestling), complications from Alzheimer's disease. *Federico Luppi, 81, Argentine-Spanish actor (Nobody Will Speak of Us When We're Dead, Pan's Labyrinth, Men with Guns), complications from a cerebral hemorrhage.Murió el actor Federico Luppi a los 81 años ===21=== *Martin Eric Ain, 50, American- born Swiss bass guitarist (Hellhammer, Celtic Frost) and songwriter (\"A Dying God Coming into Human Flesh\"), heart attack. *Denise P. Barlow, 67, British geneticist (IGF2R), member of the European Molecular Biology Organization (since 1982) and Austrian Academy of Sciences (since 2003), pancreatic cancer. *Emilio D'Amore, 101, Italian politician, member of the Chamber of Deputies (1948–1958, 1963–1968), congestive heart failure.Morto a 102 anni Emilio D'Amore, volto storico della destra irpina *Rosemary Leach, 81, English actress (A Room with a View, The Roads to Freedom, The Plague Dogs). *Judith McGrath, 70, Australian actress (All Saints, Prisoner, A Country Practice), aortic aneurysm. *Lech Ordon, 88, Polish actor (Letters to Santa, Der Schimmelreiter, Mister Blot's Academy), pneumonia complicated from a stroke.Zmarł aktor Lech Ordon *Gilbert Stork, 95, American organic chemist (Stork enamine alkylation), member of the National Academy of Sciences (since 1962) and French Academy of Sciences (since 1989). ===22=== *Atle Hammer, 85, Norwegian jazz trumpeter (Atle Hammer Sextett).Trompeteren Atle Hammer er død *Al Hurricane, 81, American singer-songwriter (\"Sentimiento\", \"La Prision de Santa Fe\", \"¡Que Viva El Godfather!\") and musician (Mi Saxophone), complications from prostate cancer. *Scott Putesky, 49, American guitarist (Marilyn Manson), colorectal cancer. *George Young, 70, Scottish-born Australian musician (The Easybeats), songwriter (\"Friday On My Mind\", \"Love Is in the Air\", \"Waiting for a Train\"), and producer (AC/DC).George Young, Legendary Australian Songwriter, Musician and Producer, Dies at 70 ===23=== *Walter Lassally, 90, German-born British-Greek cinematographer (Zorba the Greek, Oedipus the King, Tom Jones), Oscar winner (1965), complications from surgery.Συλλυπητήρια Βάμβουκα για την απώλεια κινηματογραφιστή Walter Lassaly *Paul J. Weitz, 85, American astronaut (Skylab 2, STS-6), myelodysplastic syndrome. ===24=== *Ebrahim Ashtiani, 75, Iranian footballer (Shahin, Persepolis, national team), heart disease. *Glenn Barr, 75, Northern Irish activist and politician, member of UDA (1971–1975), member of Northern Ireland Assembly of 1973 and Constitutional Convention of 1975. *Inga Borg, 92, Swedish writer (Plupp).\"Plupps\" skapare Inga Borg är död *Girija Devi, 88, Indian thumri singer, recipient of the Padma Vibhushan (2016), cardiac arrest. *Fats Domino, 89, American Hall of Fame pianist and singer-songwriter (\"Blueberry Hill\", \"Ain't That a Shame\", \"I'm Walkin'\"), complications from diabetes. *Robert Guillaume, 89, American actor (Benson, The Lion King, Sports Night) and singer (\"There Is Love\", \"Midnight Blue\"), Emmy winner (1979, 1985), prostate cancer. *I. V. Sasi, 69, Indian movie director (Eeta, Devasuram, Aaroodam), heart attack. ===25=== *Mohamed Abshir Muse, 91, Somali military officer, Commander of Somali Police Force (1960–1969) and Leader of SSDF (1991–1998). *Jack Bannon, 77, American actor (Lou Grant, Petticoat Junction, Little Big Man). *Vilnis Edvīns Bresis, 79, Latvian politician, Chairman of the Council of Ministers of the Latvian SSR (1988–1990), pulmonary edema.Скончался бывший депутат Сейма Вилнис Эдвин Бресис *Ronald Breslow, 86, American chemist, recipient of the National Medal of Science (1991), pancreatic cancer. *Ian Cathie, 85, Australian politician, Victorian MLA (1976–1988). *Lu Guanqiu, 72, Chinese entrepreneur and billionaire, chairman and co-founder of Wanxiang.第一代浙商风云人物鲁冠球逝世，享年72岁 *Pinito del Oro, 86, Spanish trapeze artist (Ringling Bros. and Barnum & Bailey Circus) and novelist (Nacida para el circo, La víspera, El italiano), complications from a stroke.Muere la trapecista Pinito del Oro a los 86 años ===26=== *Ali Ashraf Darvishian, 76, Iranian writer (Abshooran, Salhay-e-Abri, Farhang-e- Afsanehay-e Irani) and democracy activist (Iranian Centre for Democracy), respiratory failure.علی اشرف درویشیان درگذشت *Arnett E. Girardeau, 88, American politician, member of the Florida House of Representatives (1976–1982) and Senate (1983–1992), heart attack. *Shea Norman, 45, American gospel singer-songwriter (\"My Heart Depends on You\", \"Tis So Sweet\"), complications from diabetes. *Nelly Olin, 76, French politician, Mayor of Garges-lès-Gonesse (1995–2004), member of the Senator (1995–2004) and Minister of Environment (2005–2007), complications from breast cancer.Val-d'Oise : l'ancienne maire et ministre Nelly Olin est décédée *Stephen Toulouse, 45, American policy specialist and public relations manager (Microsoft, Xbox Live). ===27=== *Hans Kraay Sr., 81, Dutch football player (DOS, national team, Feyenoord) and manager (Elinkwijk, Akax, Alkmaar).Oud-voetbaltrainer Hans Kraay sr. (81) overleden *Punathil Kunjabdulla, 75, Indian writer (Smarakasilakal, Malamukalile Abdulla, Marunnu) and physician, bladder cancer. *Katalin Szőke, 82, Hungarian Hall of Fame swimmer, Olympic gold medalist (1952).Gyász: elhunyt Szőke Kató, Helsinki kétszeres olimpiai bajnoka ===28=== *Josaphat-Robert Large, 74, Haitian-American poet, novelist (Les terres entourées de larmes) and art critic, recipient of the Prix littéraire des Caraïbes (2003), cancer.Josaphat Robert Large « Bobisson» nous a quittés *Manuel Sanchís Martínez, 79, Spanish footballer (national team, Real Valladolid, Real Madrid) and manage (Tenerife, Equatorial Guinea national team, Alzira), pulmonary embolism.Muere Sanchís padre *Gert Timmerman, 82, Dutch singer (\"Nimm deine weiße Gitarre\", \"Grijze haren\", \"De schommelstoel\") and musician (Gert and Hermien), pancreatic cancer.Zanger Gert Timmerman overleden ===29=== *Dennis Banks, 80, American indigenous leader, activist (American Indian Movement) and actor (War Party, The Last of the Mohicans, Older than America), 2016 Peace and Freedom Party vice presidential candidate, complications from pneumonia. *Richard E. Cavazos, 88, American army general, Commanding General of FORSCOM (1982–1984), complications from Alzheimer's disease. *Frank Holder, 92, Guyanese jazz singer (The Dankworth Seven) and percussionist, congestive heart failure. *Władysław Kowalski, 81, Polish actor (Samson, Escape from the 'Liberty' Cinema, Body), heart attack.Nie żyje aktor filmowy i teatralny Władysław Kowalski *Tony Madigan, 87, Australian Hall of Fame boxer and rugby union player, Olympic bronze medalist (1960), complications from pneumonia. *Manfredi Nicoletti, 87, Italian architect (Catania–Fontanarossa Airport, Courthouse of Arezzo, Millennium Tower).Rieti, è morto l'architetto e saggista Manfredi Nicoletti *Linda Nochlin, 86, American feminist art historian and essayist (\"Why Have There Been No Great Women Artists?\"). *Peter Schutz, 87, German-born American businessman (Porsche), Alzheimer's disease. *Sir Ninian Stephen, 94, Australian politician and judge, Governor-General (1982–1989) and Justice of the High Court (1972–1982). *Keith Wilder, 65, American funk-disco singer (Heatwave). ===30=== *Fred Beckey, 94, American rock climber, mountaineer and author (Cascade Alpine Guide), subject of Dirtbag: The Legend of Fred Beckey. *Frank Doran, 68, British politician, MP for Aberdeen South (1987–1992) and Aberdeen North (1997–2015). *Kim Joo-hyuk, 45, South Korean actor (My Wife Got Married, The Servant, Confidential Assignment), car crash. *James D. Martin, 99, American businessman and politician, member of the U.S. House of Representatives from Alabama's 7th congressional district (1965–1967), congestive heart failure. *Judy Martz, 74, American politician, Governor of Montana (2001–2005) and Lieutenant Governor of Montana (1997–2001), Olympic speed skater (1964), pancreatic cancer. *Salvador Minuchin, 96, Argentine- American psychotherapist, heart disease.Salvador Minuchin, psychiatrist who revolutionized family therapy, dies at 96 *Eugène Parlier, 88, Swiss footballer (national team, Servette, FC Biel-Bienne).Eugène Parlier est décédé *Melanmai Ponnusamy, 66, Indian writer (Semmalar) and journalist (Ananda Vikatan, Kalki), recipient of the Sahitya Akademi Award (2008), heart attack. *Daniel Te'o-Nesheim, 30, American football player (Washington Huskies, Philadelphia Eagles, Tampa Bay Buccaneers). *Daniel Viglietti, 78, Uruguayan folk singer (\"Trópicos\"), guitarist, and political activist.Muere el músico uruguayo Daniel Viglietti *Abbas Zandi, 87, Iranian Olympic freestyle wrestler (1948, 1952, 1956) and World champion (1954). ===31=== *Norman Hardie, 92, New Zealand mountaineer. *Mario das Neves, 66, Argentine politician, Governor of Chubut (2003–2011, since 2015), cardiopulmonary arrest.Murió Mario Das Neves, el gobernador de Chubut *Papi Oviedo, 79, Cuban tresero (\"Chanchullo\"), lung cancer.Falleció Gilberto Oviedo (Papi) afamado tresero cubano ==Months== * January 2017 * February 2017 * March 2017 * April 2017 * May 2017 * June 2017 * July 2017 * August 2017 * September 2017 ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *10 Category:October 2017 events",
 "title": "Deaths in October 2017"
}