{
 "id": "599454",
 "text": "On the night of October 1, 2017, Stephen Paddock fired hundreds of bullets from his hotel room on the 32nd floor of the Mandalay Bay Hotel on the Las Vegas Strip in Paradise, Nevada, United States at a group of concert-goers across the road at the Route 91 Harvest music festival with and AR-15. From his 32nd floor balcony, Paddock fired over 1000 bullets into the festival. He killed 60 people and wounded 411 before committing suicide. The panic meant that the total injured increased to 867. It is the deadliest mass shooting in the history of the United States. ==Background== Paddock also thought about attacking other events before Las Vegas. He had researched events in Boston since at least May 2017, and had reserved a room near the August 2017 Lollapalooza festival in Chicago, but did not use it. ==Attack== After Paddock used a hammer to break two of the windows in both of his suites at the Mandalay Bay, he began shooting through them at 10:05p.m. He ultimately fired over 1,000 rifle rounds approximately into the festival audience. He started out with a few single gunshots before firing in bursts that usually ranged from 80 rounds to 100 rounds. Many people in the crowd thought the gunfire was fireworks. During the shooting, a security fence stopped people from escaping the 15-acre concrete lot. The gunfire continued, with some short pauses, over the span of ten minutes and ended by 10:15p.m. During these pauses (during reload and while the assailant was confronting Campos), most people at the concert were able to escape the venue. In addition to shooting at the concertgoers, Paddock fired eight bullets at a large jet fuel tank at Harry Reid International Airport away. At 10:12p.m., two officers on the 31st floor reported the sounds of gunfire on the floor above them. Between 10:26 p.m. and 10:30p.m., eight additional officers arrived at the 32nd floor. At 10:55p.m., the officers finished evacuating guests. At 11:20p.m., police breached Room 32–135 with explosives. Paddock was found dead on the floor from a self- inflicted gunshot wound to the head. At 11:27p.m., officers announced over the police radio that a suspect was down. == Perpetrator == The shooter was identified as 64-year-old Stephen Craig Paddock, who lived in Mesquite, Nevada. Police, relatives and neighbors described him as a gambler. When police arrived at his hotel room, Paddock was found dead there; he had killed himself with a self-inflicted gunshot wound. His motive for the shooting is unknown and has not been discovered by investigators. == Reactions == President Donald Trump posted on Twitter of his \"warmest condolences and sympathies to the victims and families of the terrible Las Vegas shooting\". In a public meeting with the press the next morning, he said the shooting was an \"act of pure evil\", a \"senseless murder\" and a \"terrible, terrible attack\". He praised the \"miraculous\" quick action of first responders. Later, he met with the victims on October 4, along with their relatives and police. ==Notes== ==References== Category:2017 mass shootings in the United States Category:2017 murders in the United States Category:21st century in Nevada 2017 shooting Category:Mass murder in 2017 Category:Massacres in the United States Category:Murder-suicides in the United States Category:October 2017 events",
 "title": "2017 Las Vegas shooting"
}