{
 "id": "599523",
 "text": "The Reich President (German: Reichspräsident) was the president (head of state) of the German Reich during the Weimar Republic (1919-1933) and Nazi Germany (1933-1945). The Reich President was the successor of the German emperor. He had more power than the current Federal President (Bundespräsident). The Reich President was elected for a seven-year term by the German people, and could be re-elected. He was the head of the army, appointed and relieved the Reich Chancellor (Reichskanzler), and could also send away the Reichstag. The Reich President was supposed to exercise the legislative power with the Reichstag but due to the instable situation of the Weimar Republic, he was often bypassing the Reichstag by using special legislation. This was the case during the early years of the Reich Presidency and especially in the early 1930s. During the Hitler period the Reichstag was just show. ==Presidents== Weimar Republic: * Friedrich Ebert (1919-1925, SPD, died in office) * Hans Luther (1925, no political party, acting) * Walter Simons (1925, no political party, acting) * Paul von Hindenburg (1925-1933, no political party, re-elected in 1932) Nazi Germany: * Paul von Hindenburg (1933-1934, no political party, died in office) * Adolf Hitler (1934-1945, NSDAP, killed himself) Hitler hardly used the title of Reich President. During his dictatorship the office of Reich President and of Reich Chancellor had been united. He preferred to call himself Führer and Reichskanzler (\"leader and Reich Chancellor\"). * Karl Dönitz (1945, NSDAP, imprisoned) == Presidential Standards == File:Flag of the President of Germany (1919–1921).svg|1919–1921 File:Standard of the President of Germany.svg|1921–1926 File:Flag of the President of Germany (1926–1933).svg|1926–1933 File:Standarte Reichspräsident 1933-1935.svg|1933–1934 File:Standarte Adolf Hitlers.svg|1934–1945 File:Kriegsmarine OF10-Grossadmiral 1945.svg|1945 == References == *Presidents and Assemblies, Chapter 4. Matthew Soberg Shugart, John M. Carey. Cambridge University Press. 1992.",
 "title": "Reich President"
}