{
 "id": "599725",
 "text": "The arrondissement of Saint-Jean-de-Maurienne is an arrondissement of France. It is part of the Savoie département, Auvergne-Rhône-Alpes region. Its capital, and a subprefecture of the department, is the city of Saint-Jean-de- Maurienne. ==History== When the Savoie department was created in 1860, the arrondissement of Saint-Jean-de-Maurienne was part of that original department. ==Geography== The arrondissement of Saint-Jean-de-Maurienne is bordered to the north by the arrondissement of Albertville, to the east by Italy, to the south by the Hautes-Alpes department, to the west by the Isère department and to the northwest by the arrondissement of Chambéry. It is the most southern of the arrondissements of the department and is the second largest arrondissement with an area of , but the one with fewest people living in it with 43,438 inhabitants and a density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Saint-Jean-de-Maurienne, there are only 3 cantons: # Modane (7310) # Saint- Jean-de-Maurienne (7317) # Saint-Pierre-d'Albigny (7318) (partly) ===Communes=== The arrondissement of Saint-Jean-de-Maurienne has 56 communes; they are (with their INSEE codes): # Aiguebelle (73002) # Aiton (73007) # Albiez-Montrond (73013) # Albiez-le-Jeune (73012) # Argentine (73019) # Aussois (73023) # Avrieux (73026) # Bessans (73040) # Bonneval-sur-Arc (73047) # Bonvillaret (73049) # La Chambre (73067) # La Chapelle (73074) # Épierre (73109) # Fontcouverte-la-Toussuire (73116) # Fourneaux (73117) # Freney (73119) # Hermillon (73135) # Jarrier (73138) # Le Châtel (73080) # Les Chavannes-en-Maurienne (73083) # Modane (73157) # Montgilbert (73168) # Montricher-Albanne (73173) # Montsapey (73175) # Montvernier (73177) # Notre- Dame-du-Cruet (73189) # Orelle (73194) # Pontamafrey-Montpascal (73203) # Randens (73212) # Saint-Alban-d'Hurtières (73220) # Saint-Alban-des-Villards (73221) # Saint-André (73223) # Saint-Avre (73224) # Saint-Colomban-des- Villards (73230) # Saint-Etienne-de-Cuines (73231) # Saint-François-Longchamp (73235) # Saint-Georges-d'Hurtières (73237) # Saint-Jean-d'Arves (73242) # Saint-Jean-de-Maurienne (73248) # Saint-Julien-Mont-Denis (73250) # Saint- Léger (73252) # Saint-Martin-d'Arc (73256) # Saint-Martin-de-la-Porte (73258) # Saint-Martin-sur-la-Chambre (73259) # Saint-Michel-de-Maurienne (73261) # Saint-Pancrace (73267) # Saint-Pierre-de-Belleville (73272) # Saint-Rémy-de- Maurienne (73278) # Saint-Sorlin-d'Arves (73280) # Sainte-Marie-de-Cuines (73255) # Val-Cenis (73290) # Valloire (73306) # Valmeinier (73307) # Villarembert (73318) # Villargondran (73320) # Villarodin-Bourget (73322) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 73248 Saint-Jean-de-Maurienne 7,889 Saint-Jean- de-Maurienne Cœur de Maurienne Arvan 73157 Modane 3,239 Modane Haute-Maurienne Vanoise 73261 Saint-Michel-de-Maurienne 2,465 Modane Maurienne Galibier 73007 Aiton 1,727 Saint-Pierre-d'Albigny Porte de Maurienne 73250 Saint-Julien-Mont- Denis 1,632 Saint-Jean-de-Maurienne Cœur de Maurienne Arvan 73278 Saint-Rémy- de-Maurienne 1,261 Saint-Jean-de-Maurienne Le Canton de la Chambre 73231 Saint-Étienne-de-Cuines 1,189 Saint-Jean-de-Maurienne Le Canton de la Chambre 73002 Aiguebelle 1,158 Saint-Pierre-d'Albigny Porte de Maurienne 73067 La Chambre 1,141 Saint-Jean-de-Maurienne Le Canton de la Chambre 73306 Valloire 1,132 Modane Maurienne Galibier ==Related pages== * Arrondissements of the Savoie department * List of arrondissements of France ==References== Saint- Jean-de-Maurienne",
 "title": "Arrondissement of Saint-Jean-de-Maurienne"
}