{
 "id": "599863",
 "text": "Alternate ending is a term used (usually in movies) to describe the ending of a story that was planned or debated but ultimately unused in favor of the actual ending. Generally, alternative endings are considered to have no bearing on the canonical narrative. On the internet, amateurs may make their own alternative endings. ==Examples in film== Alternative endings are often filmed before being scrapped, and may be subsequently included as a special feature in the film's DVD release. These alternative endings are a special type of deleted scene. In other cases, ideas that were presented but discarded early on are alluded to by the production team in commentary or interviews. Some films also present the alternative ending on International releases as well as their international Home media release, with its original region release only showing the alternative ending on certain TV channels. The following are examples of known alternative endings to movies: *Project A-ko 4: FINAL: In the original ending, A-ko and B-ko are finally became best friends forever. After A-ko wearing her sailor-suited battle uniform, B-ko carries A-ko using her flying battlesuit, blasts off and flies up into the night sky. Two of them flies up into the earth's upper atmosphere, higher, and higher, and into the outer space. Now, A-ko and B-ko are eventually stay in space as two of them became the intergalactic defenders of the galaxy. *First Blood: In an alternative ending, Rambo doesn't want to be arrested so when he is speaking with Col. Samuel Trautman, he asks him to shoot him. The Colonel does so and leaves. *3 Ninjas: The American cut originally showed that the boys had won the basketball challenge and effortlessly won Emily's bike back. In an extended international version of this movie, they lose the basketball challenge along with their own bikes, so a scene ends the international version of the film in which they fight the bullies to get them back, as an alternative ending. In the United States, this alternative ending can only be seen on certain television channels such as Starz, Showtime and Showtime MAX; international DVDs have this version, as well. *Blade: Trinity: The original ending is far more ambiguous with Dracula and Blade's fates not as determined. The ending only appears in the unrated DVD and was intended by the director David S. Goyer. Another alternate ending was seen showing Hannibal King and Abigail Whistler confront a werewolf. *The Bourne Identity: An alternative ending on the DVD has Bourne collapsing during the search for Marie, waking up with Abbot standing over him, and getting an offer to return to the CIA. *The Butterfly Effect: Evan watches a home video of his mother pregnant with him and returns to the memory of himself as a fetus. Convinced that his very existence has ruined the lives of those around him, he strangles himself with his umbilical cord and dies, stillborn. This \"Director's Cut\" ending is much darker than the theatrical ending, where he simply stops himself from becoming friends with Kayleigh. *Child's Play 2: An extended ending reveals that a chunk of Chucky's skin after his head exploded got mixed in with the Good Guy doll making plaster. A machine is then seen making a new Good Guy Doll head, which then forms a sinister smile. *Clash of the Titans: After defeating the Kraken and Hades, Andromeda falls into the sea and Perseus dives in to save her. When he reaches her, he embraces her with a passionate kiss, indicating that he fell in love with her, and she with him. After reaching the shore and regaining consciousness, Andromeda asks Perseus if he will stay and he says there is someone he needs to talk to, before kissing her again, indicating that he will come back. Getting on Pegasus, he flies to Mt. Olympus (although the special effects are incomplete) where he confronts Zeus, stating that he does not wish to be one of them and that any conflict between them has just started. After slamming his sword into the gods' map and shattering the models of every living person, he leaves and is seen flying on Pegasus over the sea, presumably back to Argos (although the special effects are incomplete). * Whisper: In the alternative ending, the kidnapper Max has chased the demon boy David through the forest David makes him believe the wolves around him are the people who died when they turn into wolves they attack Max but instead of throwing the axe and hitting David Max holds on to the axe as he falls and the wolves maul him to death. Afterwards the cops show up and wrap David up in a blanket and take him to safety. as the police van leaves you can see David smiling. *Smokin' Aces: Rather than pulling the life support cords of Israel and Sparazza as he does in the used ending, he instead draws his weapon and empties his pistol into them. *Super Troopers: Another ending was filmed that starts the same way as the real ending; by the police station being closed down. This time, the former officers are now working in a meat packing plant. They talk to their boss saying that bad meat should not be sent out for people to buy, and the boss says to do it any way. At this point the officers take off their jacket to reveal that they are now local police officers and chase him throughout the meat packing plant. *Swordfish: The DVD version contains an alternative ending wherein Ginger is told in the bank that the account is already empty, alluding to the possibility that Stanley has played one final trick on them and taken the money himself. In a companion scene to the alternative ending, Stanley is shown on a trip with his daughter in a brand new RV. While eating at a diner, Stanley is shown transferring many billion dollars to various charities before continuing his trip. *The Terminator: The alternative ending, included in some DVD releases, shows the cleanup and police response at the factory shortly after the final battle between Kyle and the terminator. A group of company representatives find the terminator wreckage and decide to hide it from police and have it analyzed. The film then ends by the screen panning out to show that the factory was owned by Cyberdyne Systems. The sequel is based on this alternative ending. *Terminator 2: Judgment Day: The alternative ending shows Sarah Connor alive and well on August 29, 2029. She is by then a grandmother (and John Connor is a Senator) in a world where Skynet was never able to start its war on humanity. *Titanic: Old Rose is seen by her granddaughter dropping the diamond into the ocean. *X-Men: The Last Stand: Not only different endings were intended to use in this film, but nearly a whole different plot. Significantly the role of Jean Grey, being more aggressive and disobeying direct orders of Magneto in several times. The alternative endings are: the re-opening of the Xavier Institute in which Beast is now a professor; Logan coming back to Alberta, Canada, specifically the very same tavern seen in the first X-Men; and Rogue keeping her powers. ==Examples in television== In TV shows, producers may want to keep the ending of an episode a secret, even if it means keeping it from the stars themselves. In such a case, they will usually film more than one ending and not tell the cast which one will be used. *The Simpsons: In the two part episode \"Who Shot Mr. Burns?\" there was an alternative ending where it was revealed that the shooter of Mr. Burns was Waylon Smithers rather than Maggie Simpson. Shots of other characters shooting Mr. Burns were also fully animated, though no other complete ending scenes were produced. (These alternative shootings were intended to be intentionally 'leaked' as an elaborate practical joke on the media, but the producers could find no journalists who would take the bait.) *Total Drama: For every season of this animated \"reality show\", 2 endings were filmed in which both finalists would win the competition. Every country Total Drama aired in got to decide which ending to air. *King of the Hill: Some episodes have alternative endings (including the episode \"The Company Man\"), which can be found on the DVD Special Features. Category:Movie terminology",
 "title": "Alternate ending"
}