{
 "id": "599932",
 "text": "Dwarkanath Sanzgiri (15 November 1950 – 6 February 2025) was an Indian columnist, writer, television presenter, and music show host. In a career spanning close to 50 years, he has written columns for numerous magazines and newspapers primarily in Marathi, but also in some other regional languages as well as English. ==Early life== Dwarkanath Sanzgiri was born in Mumbai in the Hindu Colony, Dadar (East). He attended the King George School (now known as Raja Shivaji Vidyalaya) and Ramnarain Ruia College. He went on to pursue B. E. in Civil Engineering from VJTI (Victoria Jubilee Technical Institute, now known as Veermata Jijabai Technological Institute) Matunga. ==Career== Dwarkanath Sanzgiri has pursued two careers simultaneously, one as an Engineer with the Municipal Corporation of Greater Mumbai, from where he retired in 2008 as the Chief Engineer, Water Supply Projects. Simultanously, he established himself as a Columnist, Writer and Presenter. Starting his writing career in the late 1970s, in his formative years he contributed regularly to magazines like ‘Dinank’ and ‘Shree’. After India won the 1983 World Cup in England, he along with some other friends started the fortnightly sports magazine 'Ekach Shatkar' for which Sanzgiri worked as its Executive Editor. From the late 1980s onwards, Sanzgiri began writing columns for many other publications like 'Loksatta', ‘Aaj Dinank’, ‘Sanj Lokasatta’, ‘Mid-Day’, ‘Tarun Bharat’, ‘Pudhari’ and others. His sports articles and travelogue columns in ‘Loksatta’ were very well received. He has also been covering Cricket tournaments for the newspaper ‘Saamna’ for over 25 years. Dwarkanath Sanzgiri has also covered all One-Day International Cricket World Cups from 1983 onwards, till date. Apart from columns, he has written 40 books on various topics like travel, social issues, sports and films. From the late 90s Sanzgiri has been doing one-man standup talk shows and has done over 1000 shows till date. He has also conceptualized and excuted several big events like felicitation of Sunil Gavaskar and Gundappa Vishwanath on their 60th Birthdays, felicitation of Sachin Tendulkar’s record breaking 35th test hundred, felicitation of the 1971 English series winning Indian team and the most recent felicitation of Sachin Tendulkar on completing 50 years. He was a presenter for a sports television show ‘Bolandaji’, and was the scriptwriter for another television program, ‘Madhu Ithe Ani Chandra Tithe’. He is also seen regularly on various TV channels as a cricket analyst and expert. From 2004, Sanzgiri has been a host and compere for musical shows presented under ‘Ti Ra Ki ta Dha’ and ‘Swara Arts’. The musical shows include a musical tribute to stalwarts from the Hindi Film and music industry. ==Books written== === On Sports === * शतकात एकच - सचिन * चिरंजीव सचिन * दिलखुलास बातचीत क्रिकेटपटूंशी * खेलंदाजी * बोलंदाजी * चॅम्पियन्स * चित्तवेधक विश्वचषक २००३ * क्रिकेट कॉकटेल * क्रिकेट वर्ल्ड कप हायलाईट्स * कथा विश्वचषकाच्या * लंडन ऑलिम्पिक * पॉवर प्ले * स्टंप व्हिजन * संवाद लिजंड्सशी * स्टंप व्हिजन/क्रिकेट गाथा * थर्ड अंपायर * इंग्लिश ब्रेकफास्ट * क्रिकेटर्स मनातले ==== Travelogues ==== * फिश अँड चिप्स * मुलूखगिरी * फिरता – फिरता * पूर्व अपूर्व * फाळणीच्या देशात * भटकेगिरी * ब्लू लगून * माझी बाहेरख्याली * जीन अँड टॉनिक ==== Films & Artists ==== * फिल्मगिरी * तिरकटधा * ब्लॅक अँड व्हाईट * वो भुली दास्तान * आम्हांला वगळा * देव आनंद * लतादीदी * प्यार का राग सुनो * आशा भोसले, एक सुरेल झंझावात * फिल्मी कट्टा ==== Personalities ==== * अफलातून अवलिये / दशावतार * वल्ली आणि वल्ली ==== Humour ==== * खुल्लमखिल्ली * स. न. वि. वि. /खुला खलिता ==== Social Topics ==== * तानापिहिनिपाजा * दादर - एक पिनाकोलाडा * रिव्हर्स स्वीप * वेदनेचे गाणे ==Awards== * Maharashtra State Award for Literature * Sahitya Sangh Outstanding Writer Award * Vidyadhar Gokhale Award * Late Vishwanath Vable Award for Sports Writing * Vruthepatra Lekhan Sangha Award Category:1950 births Category:Indian writers Category:2025 deaths",
 "title": "Dwarkanath Sanzgiri"
}