{
 "id": "600203",
 "text": "Charles \"Teenie\" Harris (July 2, 1908-June 12, 1998) was an American photographer. The main things that he took pictures of were people in the city of Pittsburgh, Pennsylvania, US. == Biography == Harris was born in 1908 in Pittsburgh, Pennsylvania, USA. His father and mother had a hotel in the part of the city called the Hill District. Early in the 1930s, he bought his first camera. After that he opened a photography studio. He took pictures for the magazine Flash! From the 1936 to 1975 Harris took photos of those living in the black neighborhoods of the city. Another publication called the Pittsburgh Courier published his photographs. People called him \"One Shot\" because he did not make people sit for a long time when he took their photos. He took more than 80,000 pictures in his life. He was not like other well-known photographers. Other photographers either took portraits or photographs of other places. Harris was unusual because taking photographs was part of his regular job in one city. His photos were not often seen in other places until after his death in 1998. He took photos of famous people that visited Pittsburgh like: Louis Armstrong, Duke Ellington, Billy Eckstine, Lena Horne, Sarah Vaughan, Sam Cooke, Cab Calloway, Ray Charles, Charlie Parker, Muhammad Ali, Joe Louis, Eleanor Roosevelt, John F. Kennedy, Martin Luther King, Dwight Eisenhower, Richard Nixon, and Dizzy Gillespie. Harris also photographed famous Negro League baseball players of the Homestead Grays and Pittsburgh Crawfords. Harris himself played baseball for the Crawfords when they were known as the Crawford Colored Giants. He let another businessman, Dennis Morgan sell his photographs in 1986. Harris filed a lawsuit in 1998 for unpaid royalties and the return of his collection. He won the case after he died. The Carnegie Museum of Art purchased the collection from the Harris estate in 2001. Since 2003, the museum has scanned and cataloged nearly 60,000 images. Many of these are available online. Many people help to identify the people in his photographs. Harris is buried in Pittsburgh's Homewood Cemetery. == References == * ==Other websites== * \"One Shot: the Life and Work of Teenie Harris\" * Teenie Harris Archive at the Carnegie Museum of Art * of mid-century America: How the other half lived Apr 30th 2012 The Economist Category:1908 births Category:1998 deaths Category:American photographers",
 "title": "Charles Harris (photographer)"
}