{
 "id": "600466",
 "text": "Yamato kotoba (kanji: 大和言葉, hiragana: やまとことば) are words that are native to the Japanese language. The word itself is also a native Japanese word, interestingly enough. Yamato kotoba can also be called by its Chinese based name, wago (kanji: 和語, hiragana: わご). It is one of the three main sources of Japanese words, along with kango (kanji: 漢語, hiragana: かんご), or Chinese loanwords, and gairaigo (kanji: 外来語, hiragana: がいらいご), or loanwords borrowed from languages other than Chinese (especially English since the post-WWII era). Yamato kotoba in Japanese has much in common with native English words in that most of the everyday vocabulary comes from yamato kotoba, while Chinese loanwords words (much like Latin and French loanwords in English) are used for more formal situations (usually writing) and for specialized terms. == How to write yamato kotoba == Usually, words with only one kanji are yamato kotoba, such as katana (kanji: 刀, hiragana: かたな, meaning: sword), sakana (kanji: 魚, hiragana: さかな, meaning: fish), kami (kanji: 紙, hiragana: かみ, meaning: paper), yama (kanji: 山, hiragana: やま, meaning: mountain) te (kanji: 手, hiragana: て, meaning: hand), and oyogu (kanji and hiragana: 泳ぐ, hiragana only: およぐ, meaning: to swim). Most kanji (the Japanese version of Chinese characters) have two different kinds of pronunciation, on'yomi (the pronunciation of the kanji borrowed from Chinese) and kun'yomi (the native pronunciation of Japanese words that use the kanji). Yamato kotoba words use the kanji's kun'yomi. Since on'yomi came from Chinese monosyllables (words with only one syllable), they themselves are also only one syllable, and like Chinese, they can have a CV or CVC structure. For example, the on'yomi for the following kanji 刀, 魚, 紙, 山, 手, and 泳 are tō, shi, san, shu, and ei. However, kun'yomi can have one or multiple syllables, and those syllables are usually a CV structure, like the examples given above. Since Japanese uses three different writing systems interchangeably, even yamato kotoba can be written in several different ways. For example, the word sushi can be written entirely in hiragana as すし, entirely in katakana as スシ, in kanji as 鮨 or 鮓, or in ateji (kanji used only to show a word's pronunciation and not its meaning) as 寿司 or 壽司. Kanji usually show the root meaning of the word. While nouns are usually written only with kanji, they can also be written in kana if they are very common words, like sushi, or if their kanji is not well known, not part of the jōyō kanji (a standard list of 1,945 kanji all Japanese adults are expected to know) or too difficult to remember how to write, like bara, whose kanji is 薔薇, but is usually only written as ばら in hiragana or as バラ in katakana. Japanese also invented many of its own kanji to name things that could be found in Japan, but not China (usually plants and animals). These are called kokuji (kanji: 国字, hiragana: こくじ) meaning \"national characters\", or wasei-kanji (kanji: 和製漢字, hiragana: わせいかんじ) meaning \"Japanese-made Chinese characters\". Kokuji include the names of fish like iwashi (kanji: 鰯, hiragana: いわし, meaning: sardine), tara (kanji: 鱈, hiragana: たら, meaning: codfish), and kisu (kanji: 鱚, hiragana: きす, meaning: sillago), and trees like kashi (kanji: 樫, hiragana: かし, meaning: evergreen oak), sugi (kanji: 椙, hiragana: すぎ, meaning: Japanese cedar), and kaba or momiji (kanji: 椛, hiragana: かば/もみじ, meaning: birch/maple). Most kokuji only have kun'yomi because they are yamato kotoba, but some kanji also have on'yomi, like 働 (on'yomi: dō どう, kun'yomi: hatara(ku) はたら(く), meaning: work), and some have only on'yomi, like 腺 (on'yomi: sen せん, meaning: gland). == Yamato kotoba parts of speech == Other content words like verbs, adjectives, and adverbs are usually written in a combination of kanji and hiragana, where the root of the word is written in kanji and the inflectional morphemes (the parts of the word that don't change the central meaning of the word's root) are written in hiragana. For example, the native Japanes verb meaning \"to swim\" is oyogu in its plain form, where it is written as 泳ぐ in kanji and hiragana. The kanji 泳 shows the verb's meaning, while ぐ (gu) as in oyo-gu shows that the word is in its plain form. The polite form of \"to swim\" is oyogimasu, which is written as 泳ぎます in kanji and hiragana. Once again, it has the same kanji, but it ends with different syllables ぎます (gi-ma- su) as in oyo-gimasu to show that the word is in the polite form. Native Japanese adjectives usually end in with the syllable い (-i), like the word hayai (kanji and hiragana: 速い, hiragana only: はやい, meaning: fast), takai (kanji and hiragana: 高い, hiragana only: たかい, meaning: tall, high), and ookii (kanji and hiragana: 大きい, hiragana only: おおきい, meaning: big or large), while native Japanese adverbs are simply adjectives that end in く (-ku) rather than い, like hayaku (kanji and hiragana: 速く, hiragana only: はやく, meaning: quickly). Nouns based on adjectives end with the syllable さ (-sa), as in hayasa (kanji and hiragana: 速さ, hiragana only: はやさ, meaning: speed), takasa (kanji and hiragana: 高さ, hiragana only: たかさ, meaning: height), and ookisa (kanji and hiragana: 大きさ, hiragana only: おおきさ, meaning: size/largeness). Sometimes, native Japanese nouns can be written with multiple kanji. These are usually proper nouns like family names or place names. Japanese family names are usually yamato kotoba, like Tanaka (kanji: 田中, hiragana: たなか), Yamamoto (kanji: 山本, hiragana: やまもと), and Kobayashi (kanji: 小林, hiragana: こばやし). Most Japanese place names are also yamoto kotoba, like Ōsaka (kanji: 大阪, hiragana: おおさか), Ehime (kanji: 愛媛, hiragana: えひめ), and Hiroshima (kanji: 広島, hiragana: ひろしま), although there are also plenty of Japanese places with Chinese-based names, like Tōkyō (kanji: 東京, hiragana: とうきょう), Mt. Fuji or Fuji-san (kanji: 富士山, hiragana:ふじさん), and Honshū (kanji: 本州, hiragana: ほんしゅう). While usually cardinal numbers (numbers for measuring things) in Japanese are based off of Chinese words, most ordinal numbers (numbers for ordering things) and even certain measure words use native Japanese words. The following table has Sino- Japanese numerals (Japanese numbers based on Chinese) on the left and native Japanese numerals on the right. Number in Hindu-Arabic numerals Number in kanji Sino-Japanese numeral Native Japanese numeral 1 一 ichi hitotsu 2 二 ni futatsu 3 三 san mittsu 4 四 shi yottsu 5 五 go itsutsu 6 六 roku mutsu 7 七 shichi nanatsu 8 八 hachi yatsu 9 九 kyū kokonotsu 10 十 jū too 20 二十 ni-jū hatachi Category:Japanese language",
 "title": "Yamato kotoba"
}