{
 "id": "600717",
 "text": "Liberland, also called the Free Republic of Liberland, is a micronation on an unclaimed piece of land on the western part of the Danube River between Croatia and Serbia. Liberland was founded on 13 April 2015 by Czech libertarian activist Vít Jedlička. The Liberland website says the nation was created on no-man's land (terra nullius) that emerged because Croatia and Serbia have not agreed on common borders for over 25 years. This border dispute includes some areas to the east of the Danube which are claimed by both Serbia and Croatia. Croatia considers some areas on the west side of the river, including Liberland, to be part of Serbia, although Serbia no longer claims that land. The land has been patrolled by Croatia since the Croatian War of Independence but Croatia has blocked people from coming to Liberland since shortly after its founding, including Croatian citizens and other EU citizens. Before that, just about anyone could visit the area. Licensed hunters, fishermen and employees of Hrvatske šume d.o.o. (Croatian Forests Ltd., a state-owned timber company) visit. Since August 2023, Liberlanders have been present in the territory, although Croatian border police check passports of everyone entering and leaving. Croatian border police impose Croatian laws against open fires and closed tents. No country that is a member of the United Nations has given diplomatic recognition to Liberland, although Liberland has opened official relations with Somaliland and Haiti as well as other partially recognized and unrecognized states and micronations. In November 2021, El Salvador received a diplomatic delegation from Liberland. In December 2023, Liberland sent a delegation to Argentina to attend the inauguration of President Javier Milei who has expressed support for Liberland. == Place == The border disagreement along the Danube River valley started in 1947 but was left unresolved during the existence of the Socialist Federal Republic of Yugoslavia. After Yugoslavia broke apart, the disagreement became more prominent. Serbia claims the center line of the river is the international border between the two countries. The Croatian government disagrees and claims that the international border lies along the old lines of the cadastral municipalities along the river — as the Danube was in the 19th century before meandering and hydraulic engineering works changed its course. As a result, Croatia claims a large part of the area controlled by Serbia, while Serbia does not claim the smaller parts on the other side. President Jedlička says that the land claimed for Liberland, known as Gornja Siga (meaning upper tufa), remains unclaimed by Croatia or Serbia. The area is about , and most of it is covered with forests. A journalist from the Czech newspaper Parlamentní listy who visited the area in April 2015 found a house that had been abandoned for about thirty years, according to people living nearby. The access road was reported to be in a bad condition. The Danube River, an international waterway with free access to the Black Sea for several landlocked nations, runs along the self-proclaimed territory. Liberland visitors and citizens visit the coast by boat from Apatin, Serbia and other ports and docks along the Danube River. Liberland keeps its ships the Bitcoin Freedom and the SS Liberty at the local marina, has bought land and buildings in the Apatin Free Trade Zone and recently opened \"Ark EcoVillage\" on a piece of land formerly known as Zelena Glava (\"Golden Head\"). == History == === Announcement of the new country === The flag ceremony in Gornja Siga was performed by Vít Jedlička and others on the day the statehood of Liberland was proclaimed. The flag is a yellow background (symbolizing libertarianism) with a black horizontal stripe through the centre (symbolizing anarchy or rebellion) and the coat of arms in the centre. Jedlička is a member of the Czech Party of Free Citizens, which bases its values on the classical liberal ideology. Jedlička stated that neither Serbia, Croatia nor any other nation claims the land (no-man's land or terra nullius). The border, he argued, was defined according to both Croatian and Serbian border claims and did not interfere with any other state's sovereignty. Jedlička said in April 2015 that an official diplomatic note would be sent to both Croatia and Serbia, and later to all other states, with a formal request for international recognition. On 18 December 2015, President Jedlička presented the first provisional government of Liberland and its Ministers of Finance, Foreign Affairs, Interior and Justice as well as two vice presidents. === Entering Liberland === Croatian authorities have generally blocked entry to Liberland since early May 2015, with limited exceptions for licensed hunters and fishers. Since August 2023, Croatian border police have allowed small groups of Liberlanders to cross over into Liberland from Croatia during daylight hours, subject to passport control upon entry and exit. In May 2015, Vít Jedlička and his translator Sven Sambunjak were detained by Croatian police after making an attempt to cross the border. Jedlička spent one night in jail and then was convicted and ordered to pay a penalty for illegal crossing of the Croatian border. He appealed the verdict. He claimed that there were at least three Liberland citizens inside the area, who came from Switzerland. Later that month, Vít Jedlička was detained again. Initially, reporters were able to enter the area with Jedlička but later they were also denied entry, including journalists from the Serbian public broadcast service Radio Television of Vojvodina, and from the Bosnian newspaper Dnevni Avaz. The people arrested were from many countries, including Ireland, Germany, Denmark, and the U.S. Croatian police continued to arrest people, including those who entered the area by boat via the international waterway. One of them, a Danish activist Ulrik Grøssel Haagensen, was placed in house arrest for 5 days before being sentenced to 15 days of prison, triggering some protests in Denmark. In May 2016, several appeals court decisions from Croatia were published. The court upheld the rulings that crossing into Liberland from Croatia is illegal, but found the convictions for entering Liberland from Serbia were not correct. A retrial was ordered in 6 of the 7 appeals. The lower court was therefore required to determine the location of the border and the border crossing, but has not done this yet. Since that time, visitors have come the area in boats and conflicts with Croatian police have been avoided. Croatia joined the Schengen Area on January 1, 2023; while Liberland lies outside the Schengen Zone and outside of the jurisdiction of the Croatian police, they claim to administer the area and check the documents of persons crossing over into the territory. Youtube host Niko Omilana along with his cameraman George Wise visited Liberland successfully in April 2023, releasing a video of his visit in July 2023 that received over 5 million views in four days. Since August 6, 2023 there has been a continuous presence of settlers and visitors, despite ongoing difficulties with the Croatian police and the state forestry company, which uses part of the area as a source of timber. Various events have been held in Liberland since the settlement began, including a wedding on the beach and an MMA match. == Legality == Croatia and Serbia dismissed Jedlička's claims as not important, although the two countries reacted in different ways. On 24 April 2015, the Serbian Ministry of Foreign Affairs stated that while they consider the affair a trivial matter, the \"new state\" does not infringe upon the Serbian border, which they say is the Danube River. Croatia, which until August 2023 blocked visitors from accessing Liberland, has stated that after international arbitration, it should be awarded to Croatia or Serbia, not to a third party. An article in the Chicago Journal of International Law, the law review of the University of Chicago Law School, examined Liberland's claim to statehood in light of the criteria laid out by the Montevideo Convention. According to the author, \"Croatia’s insistence that Liberland is part of Serbia could constitute a renunciation of Croatia’s legal rights to Liberland. Conversely, if the territory that Liberland claims as its own is Serbian, the Serbian government’s renunciation of its title to that land could also be a quitclaim that would transform the legal status of the land to terra nullius. In both instances, the territory would belong to the first entity —in this case Liberland— to claim it.” Legal experts in Serbia and Croatia have asked if, under international law, Jedlička has the right to claim the area, which is currently the subject of a dispute between the two nations but claimed by neither one. Journalists have been uncertain as to how serious Jedlička is about his claims, with some calling it a publicity stunt. On 20 May 2015 Petr Mach, the leader of the Party of Free Citizens, expressed support for the creation of a state based on ideas of freedom, adding that the Party of Free Citizens wants the Czech Republic to become a similarly free country. Goran Vojković, professor of law and columnist from the Croatian news portal Index.hr, described Liberland as a \"circus which threatens Croatian territory\", and argued that there was a risk that Croatia's claim to control land on the other side of the Danube may be weakened by the attention that the Liberland project has drawn to the border dispute. In 2016, an article in Stratfor summarized the initiative as follows: \"Liberland is a curious case because, in principle, none of the actors that could claim control over it seems interested in doing so. But this will probably remain a curiosity with negligible consequences at the international level. For the rest of the world's disputed territories, violence and diplomacy will remain the main tools to claim ownership. == Citizenship == According to its web page, Liberland is currently looking for those who have respect for other people and respect the opinions of others, regardless of their race, ethnicity, orientation, or religion, have respect for private ownership, and have not been punished for serious criminal offences. Liberland received 200,000 applications in a week. In the beginning of May 2015, Liberland accepted around thirty citizens. An event was supposed to take place in the claimed territory, but Croatian border police stopped the group from entering it from the Croatian side. On February 16, 2018, former Congressman Ron Paul was presented with a Liberland passport and citizenship certificate by Jedlička and his cabinet. As of April 2024, Liberland has awarded citizenship to roughly 800 people, to persons who have \"helped move the country forward\" or earned at least 5000 Merits. Liberland also presents an Order of Merit award called the \"First Class Order of Merit\" to persons who have contributed to the development of Liberland or to the ideas of freedom. Recipients have included publisher Steve Forbes, economist Mark Skousen, a Croatian Member of Parliament, and others. The Liberland constitution has been drafted and revised several times. The draft consists of four chapters. It includes a Bill of Rights and regulates the public administration, the political institutions, the legislative power, and the judicial power. == Recognition == There has been no formal diplomatic recognition of Liberland by any member of the United Nations. Liberland has established relations with Somaliland, a self-declared state that proclaimed its independence from Somalia in 1991. Liberland and Somaliland signed a Memorandum of Understanding in September 2017 promising to establish closer relations and cooperate in the areas of technology, energy and banking. Liberland President Jedlička and members of Liberland's provisional government make regular goodwill visits around the world to make the case for Liberland and to promote diplomatic and commercial ties to the project. In 2017, Jedlička met with U.S. Senators Ted Cruz, Rand Paul, Ben Sasse and the Democratic Shadow Senator from Washington, D.C. Paul Strauss as well as several other elected representatives in the United States. In February 2018, Jedlička and his U.S. team went to Washington, D.C. to meet with Senator Bob Corker, the chairman of the Senate Foreign Relations Committee as well as Senator Lamar Alexander. Liberland has also established relations with the region of Savoie (Savoy), an independent and self-governed territory from the 11th century until 1860, when it was annexed to France. Today, Savosian people are a minority in their own territory and their claims are not taken into account by the government of France. Liberland has also begun dialogue with the region of Brittany (Bretagne), among others. On 5th December 2018, UK Libertarian MEP Bill Etheridge and Paul Brothwood hosted an event for Liberland in the European Parliament to discuss its future. Liberland also signed a Memorandum of Understanding with the government of Haiti on the 5th of March 2020. The agreement was signed by Joseph Jouthe, the Prime Minister of the Republic of Haiti at that time. In 2021, Liberland sent a delegation to El Salvador during Bitcoin Week and met with several government officials. The Liberland Aid Foundation gave a more than 1 Bitcoin donation (over $60,000 US at the time) to the Hospital de Niños Benjamin Bloom in San Salvador. In July 2023, Liberland sent a delegation to Zagreb, Croatia and met with current President Zoran Milanović, former President Kolinda Grabar-Kitarović and others. === Official statements from other countries === * : Liberland has been mentioned by the Croatian Ministry of Foreign and European Affairs but publicly rejected as a joke. On 29 June 2015, the Croatian Ministry of Foreign affairs said that Gornja Siga's status is undetermined, but it is not terra nullius, and after international arbitration, it will be awarded to Croatia or Serbia, not to a third party. However, in a May 2016 letter to Interior Minister Vlaho Orepić, Croatian Minister of Foreign and European Affairs Miro Kovač referred to Liberland as \"a provocative idea which has reached serious proportions\" and that it \"represents a risk to the Republic of Croatia.\" On 17 January 2017, Liberland was discussed and debated in the Croatian Parliament (Sabor) by Ivan Pernar of the Zivi Zid party. * : The Serbian Ministry of Foreign Affairs has stated that Liberland does not infringe upon the border of Serbia, but the project is seen as a \"non-important matter.\" In the meantime, Liberland has made good relations with local and regional Serbian officials, including the city of Apatin and the government of the Autonomous Province of Vojvodina. * : The Egyptian Ministry of Foreign Affairs has warned people of the possibility of scams about Liberland directed at people looking for jobs abroad. \"Egyptians should seek information from the Foreign Ministry rather than social media before travelling for work.\" * : The Czech Ministry of Foreign Affairs said the activities of Mr. Jedlička were nothing to do with them. The ministry added that \"Mr. Jedlička, as well as other Czech citizens staying in the territory of Croatia or Serbia, is obliged to abide by the local legal code. The Czech Republic considers the activities of Mr. Jedlička inappropriate and potentially harmful.\" Through the Embassy of the Czech Republic in Zagreb, it warned that the \"efforts to create some new 'state' have no basis in international law,\" and that \"in the territory of Croatia, citizens of the Czech Republic as well as other foreigners are obliged to adhere to the Croatian legal code, including the current regime on the Croatian-Serbian border. Crossing the Croatian border (i.e., the external border of the European Union) outside specified border crossings, as it is done by travelers to the so-called Liberland, is in clear violation of the code.\" * : On 24 July 2016, 7 members of Polish Parliament (Sejm) from Kukiz'15 in cooperation with local Liberland activists asked Minister of Foreign Affairs Witold Waszczykowski when Poland would recognize the Free Republic of Liberland as an independent state., with a follow-up in August. The reply was that Liberland doesn't meet the criteria for statehood. * : On 20 November 2023, President Vit Jedlicka sent congratulations to Javier Milei after he won the third round of the Argentine presidential election. “The pendulum of liberty is swinging, so I want to send big congratulations to the Argentinian people. They took a great step in choosing Javier Milei,” said Liberland President Vit Jedlicka. “And congratulations to Javier Milei. I’m looking for long-lasting and great relations between our two countries.” Recently, the Liberland delegation met in Buenos Aires with Milei’s political party, the Partido Libertario. They affirmed their shared commitment to the principles of liberty and to cooperate in several areas, including international relations. === Support from political parties === Since 2015, several minor freedom parties have expressed support for the creation of Liberland. They are the Capitalist Party in Norway, the Libertarian Party (Spain), The Swiss Independence Party up! (Unabhängigkeitspartei), the Liberal Democratic Party (Turkey) (LDP) the Libertarian Party of Canada, the Libertarian Party (United States) and the UK Libertarian Party. === Statements from other micronation projects === A few micronations have expressed support for Liberland. * The Kingdom of North Sudan, which claims the Bir Tawil area on the border between Egypt and Sudan, has recognized Liberland. * The Kingdom of Enclava, which claims part of the disputed pocket north of Liberland, has recognized Liberland. * The Principality of Sealand has indicated their support for Liberland. === Statements from organizations === * On 16 April 2017 Bitnation has announced a partnership with Liberland. * On 20 April 2017 Liberland applied for admission to the UNPO. The application was officially presented and defended a month later in Brussels, Belgium. In June 2017, a delegation from Liberland was invited to observe the proceedings of the 13th General Assembly during which the President and members of the presidency were elected. * On 25 April 2018, Liberland signed a bilateral recognition agreement with IIMSAM, an Intergovernmental Observer to the United Nations Economic and Social Council. ==Related pages== * Liberalism * Libertarianism * Anarcho-capitalism == References == ==Other websites== * Official website, in English and Czech * Interview with founder Vít Jedlička * InSerbia article * Welcome to Liberland, the World’s Newest Country (Maybe) * Documentary film about Liberland – \"This No Man’s Land Of Mine\" * Sovereign state Category:Libertarianism Category:Territorial disputes Category:2015 establishments in Europe Category:City-states Category:Geography of Croatia Category:Geography of Serbia Category:Micronations",
 "title": "Liberland"
}