{
 "id": "600912",
 "text": "Sino-Japanese vocabulary, Chinese-based Japanese words, or kango (kanji: 漢語, hiragana: かんご), are Chinese loanwords in the Japanese language. The two languages are unrelated to each other, since Chinese is a Sino-Tibetan language while Japanese is a language isolate (meaning that no known languages are related to it). However, Chinese has had a major influence on Japanese and has affected many parts of it, including its phonology (how it organizes sounds) and its vocabulary. Including Chinese words into Japanese lead to allowing words to have closed syllables (syllables ending in a consonant), like the words san (kanji: 三, hiragana: さん, meaning: three) and udon (kanji:饂飩, hiragana: うどん) and for words to have long vowels and long consonants, like nō (kanji:能, hiragana: のう) and gakkō (kanji: 学校, hiragana: がっこう). Before Chinese words came into the Japanese language syllables in Japanese words only had open syllables (words that end in a vowel) like katana (kanji:刀, hiragana: かたな) and shinobi (kanji and hiragana: 忍び, hiragana only: しのび). It is one of the three main sources of Japanese words, along with yamato kotoba (kanji: 大和言葉, hiragana: やまとことば), also known as wago (kanji: 和語, hiragana: わご), or native Japanese words, and gairaigo (kanji: 外来語, hiragana: がいらいご), or loanwords borrowed from languages other than Chinese (especially English since the post-WWII era). == Chinese loanwords in Japanese vs. French and Latin loanwords in English == It is said that about 60-70% of Japanese words come from Chinese. Like how French and Latin are to English, Chinese loanwords are used to create formal vocabulary and technical terms in Japanese. For example, while the native English words are \"moon\" and \"horse\", the Latin terms \"luna\" and \"equus\" is used to create technical terms like \"lunar calendar\", a calendar that is based on the moon, and \"equine science\", the study of horses. Likewise, the native Japanese word for horse is uma (kanji: 馬, hiragana: うま) while the Chinese term is ba (kanji:馬, hiragana: ば), which is used in terms like basha (kanji:馬車, hiragana: ばしゃ, meaning: horse carriage), jōba (kanji:乗馬, hiragana: じょうば, meaning: horse riding), and gunba (kanji:軍馬, hiragana: ぐんば, meaning: warhorse). Most Chinese loanwords are nouns, and they are often made up of more than one kanji (Chinese characters used in Japanese). Most kanji have two different kinds of pronunciation, on'yomi (the pronunciation of the kanji borrowed from Chinese) and kun'yomi (the native pronunciation of Japanese words that use the kanji). Yamato kotoba words use the kanji's kun'yomi. While Japanese usually use the kun'yomi for words of just one kanji, like 火 (on'yomi: ka, meaning: fire) which is pronounced hi, and 山 (on'yomi: san, -zan, meaning: mountain) which is pronounced yama, when you put together the two kanji, 火山, the word will not be pronounced by their kun'yomi as hiyama, but rather they will be pronounced by their on'yomi as kazan, which the compound word fire+mountain means \"volcano\". == Sino-Japanese parts of speech == While most Chinese loanwords in Japanese are nouns, they can also be used to make verbs, adjectives, and adverbs as well. While most Japanese verbs are native Japanese words, Chinese loanwords can be made into verbs using the -suru form. For example, the Chinese loanword kinshi (kanji: 禁止, hiragana:きんし) is a noun that means \"prohibition\" or \"ban\", but if you add -suru afterwards, as in kinshi-suru (kanji and hiragana: 禁止する, hiragana only: きんしする), it becomes a verb that means \"to prohibit\" or \"to ban\". Also, adjectives can be formed from nouns by adding the suffix -teki (的) to it. For example, while the word shikaku (kanji: 視覚, hiragana: しかく) is a noun that means \"vision\" or \"sense of sight\", adding -teki afterwards makes it into the word shikaku-teki (kanji:視覚的, hiragana: しかくてき) which is an adjective that means \"visual\". == Sino-Japanese vocabulary invented in Japan == Even though kanji a Chinese invention, Japanese has also created many Chinese-based words itself that were adopted into Chinese. These words are called wasei-kango (kanji:和製漢語, hiragana: わせいかんご) which means \"Japanese-made Chinese words\". Many of these words describe things that are uniquely Japanese, such as Shintō (kanji:神道, hiragana: しんとう), dōjō (kanji:道場, hiragana:どうじょう), Bushidō (kanji:武士道, hiragana:ぶしどう), matcha (kanji:抹茶, hiragana:まっちゃ), and seppuku (kanji:切腹, hiragana:せっぷく). Since Japan was the first East Asian country to modernize, the Japanese were the first people in East Asia to be exposed to new technologies and fields of study, and therefore the first to develop Chinese-based names for such things, such as telephone (denwa, kanji:電話, hiragana: でんわ), science (kagaku, kanji:科学, hiragana:かがく), and philosophy (tetsugaku, kanji:哲学, hiragana: てつがく), and each of these terms have been adopted into Chinese as diànhuà, kēxué, and zhéxué in the same order. This phenomenon is called reborrowing. Category:Chinese language Category:Japanese language",
 "title": "Sino-Japanese vocabulary"
}