{
 "id": "601368",
 "text": "In 1917, games started to be played in the National Hockey League. In the first two seasons, there were only three teams, but now, there are thirty-one. Over the time that it has been around the NHL has added and lost teams many times. This is the complete history of organizational changes in the NHL. ==Early Years== The first four NHL teams were the Montreal Canadiens, Montreal Wanderers, the original Ottawa Senators and the Toronto Arenas, but after only playing four games, the Wanderers arena was burned down. This made them leave the league. In the 1919-20 NHL season, the NHL added its first new team - the Quebec Bulldogs. Also, the Toronto Arenas changed their name to the St. Patricks. In the 1920-21 NHL season, the Quebec Bulldogs moved to Hamilton and became the Tigers. Two new teams joined the league in the 1924-25 NHL season - the Boston Bruins and the Montreal Maroons. The next season, the NHL added another new team - the Pittsburgh Pirates. Also, the Hamilton Tigers moved to New York City and became the New York Americans. The NHL continued to add teams the next season, adding the Chicago Black Hawks, the Detroit Cougars and the New York Rangers. This means the league finished its first season with three teams in 1917, but ended up with more than three times more by the end of their first decade. Also, during this season, the Toronto St. Patricks changed their name to the Maple Leafs. In the 1930-31 NHL season, the Pirates moved to Philadelphia and became the Quakers, while the Detroit Cougars changed their name to the Falcons. The NHL finally lost a team four the first time in fourteen seasons. The Philadelphia Quakers and Ottawa Senators did not play in the 1931-32 NHL season. In the 1932-33 NHL season, the Ottawa Senators rejoined the league and the Detroit Falcons were renamed the Red Wings. In the 1934-35 NHL season, the Ottawa Senators moved to St. Louis and became the Eagles. The NHL lost the Eagles after playing just one season in St. Louis and the league was again an eight-team league for three seasons. The league lost the Montreal Maroons in the 1938-39 NHL season, bringing the number of teams to seven, the same number of teams there were 12 years before. There were seven teams for four seasons. The last season there was this many teams was 1941-42. That year, the New York Americans moved to Brooklyn and left the league the next season. ==Original Six== When the league lost the Brooklyn Americans in 1943, a new era began called the Original Six era. For the next 25 years, there were no organization changes. ==Expansion Years== The 1966-67 NHL season was the last year of the Original Six era because in the 1967-68 NHL season, there were 12 teams, or twice as many as there were the year before. The new six teams were the California Seals, the Los Angeles Kings, the Minnesota North Stars, the Philadelphia Flyers, the Pittsburgh Penguins and the St. Louis Blues. During this season, California was renamed the Oakland Seals. The Oakland Seals were then renamed the California Golden Seals for the 1970-71 NHL season. The same year, the league added two new teams - the Buffalo Sabres and the Vancouver Canucks. Two more teams joined the NHL two years later - the New York Islanders and the Atlanta Flames. Again, after two years, two more teams joined the NHL - the Washington Capitals and the Kansas City Scouts. Two years later, the California Golden Seals moved to Cleveland and became the Barons. The Kansas City Scouts moved also to Denver and became the Colorado Rockies. In the 1978-79 NHL season, the members of the Cleveland Barons franchise became part of the Minnesota North Stars. This was the forced time since 1942 that the league lost a team. In 1979, the World Hockey Association (WHA) ended and four teams from the league joined the NHL. They were the Edmonton Oilers, the New England Whalers (who became the Hartford Whalers after joining the league), the Quebec Nordiques and the Winnipeg Jets. At this point, the NHL had three Canadian teams, but with three of the teams coming from the WHA being Canadian, there were then twice as many Canadian teams as before. ==Twenty-one teams== In the 1980-81 NHL season, the Atlanta Flames moved to Calgary Flames. Then, in the 1982-83 NHL season, the Colorado Rockies moved to Newark and became the New Jersey Devils. In the 1986-87 NHL season, the Chicago Black Hawks changed the spelling of their name to Black Hawks. ==Further Expansion== In 1991, lots of teams were beginning to be added to the NHL. That year, it started with the San Jose Sharks. Two new teams joined the league the next season - the Ottawa Senators and the Tampa Bay Lightning. The next season, another two teams joined the league - the Florida Panthers and the Mighty Ducks of Anaheim. Also, the Minnesota North Stars moved to Dallas Stars and dropped the word \"north\" from their name. In the 1995-96 NHL season, the Quebec Nordiques moved to Denver and became the Colorado Avalanche. The next season, the Winnipeg Jets moved also to Phoenix and became the Coyotes. The season after that, the Hartford Whalers moved to Raleigh and became the Carolina Hurricanes. The Nashville Predators joined the league for the 1998-99 NHL season. For next season, another team joined the league - the Atlanta Thrashers. ==Thirty Teams== The NHL added the Columbus Blue Jackets and the Minnesota Wild for the 2000-01 NHL season, bringing the number of teams to thirty. This was the number of teams there were for 17 seasons. The Mighty Ducks of Anaheim changed their name to the Anaheim Ducks in the 2006-07 NHL season. Then, the Atlanta Thrashers moved to Winnipeg to become the Jets in the 2011-12 NHL season. Finally, the Phoenix Coyotes changed their name to the Arizona Coyotes in the 2014-15 NHL season. ==Modern Expansion== In the 2017-18 NHL season, the Vegas Golden Knights joined the league. The Seattle Kraken will join the league in the 2021–22 season. Category:National Hockey League",
 "title": "History of organizational changes in the NHL"
}