{
 "id": "601374",
 "text": "The Kingdom of France (; ; ) is the name given to various political entities of France in the Middle Ages and modern times. According to historians, three major events started the Kingdom of France: the advent of Clovis I in 481, the Treaty of Verdun and the election of Hugues Capet in 987. The kingdom lasted until 1792 and was briefly restored in 1814 to 1815 and then from 1815 to 1848. The King of the Franks, Clovis I, sealed the alliance of Frankish Kingdoms with the Catholic Church at his baptism. That alliance was perpetuated in the Kingdom of France by the crowning of kings at Reims, which made them monarchs by divine right. The first Capetians were anxious to crown their eldest son in their lifetime because their authority was limited in reality to the Ile de France. It was not until Philippe Auguste that their official acts called it the Kingdom of France and that they are able to make a real act of authority throughout the kingdom. Their territory was the feudal fiefs of which king of Western France had been the suzerain since the 843 division of the Carolingian Empire. The gradual integration of the feudal fiefs into the royal domain required the establishment of a royal administration. Louis IX attached the main importance to its role as justiciary. The parlement, the high court of justice, was put in place. The Hundred Years' War allowed Charles VII to establish an army and permanent taxes. Richelieu and Louis XIV strengthened the royal authority in the provinces by bringing the local governors of the nobility under their stewardship and by delegating to them stewards appointed by the king. The tendency of royalty to exercise more and more absolute power could be challenged in times of turmoil, civil wars and the reigns of minor kings. The dispute took a more pronounced character on the occasion of the diffusion of the philosophy of enlightenment and of the values that it carried: government of reason, separation of powers, individual liberties. The French Revolution led to the establishment of a French constitutional monarchy. However, the different formulas experienced failure in 1792, 1830 and 1848, which ended the French monarchy. ==References== * Category:Kingdom of France",
 "title": "Kingdom of France"
}