{
 "id": "601477",
 "text": "Maria Constanze Cäcilia Josepha Johanna Aloysia Mozart (née Weber, 5 January 1762 – 6 March 1842) was a German singer and businesswoman. She was the wife of Wolfgang Amadeus Mozart and the cousin of Carl Maria von Weber. After her husband's death, she married again to Georg Nikolaus von Nissen and wrote a biography about Wolfgang. == Early life == Constanze Weber was born in Zell im Wiesental. She was the fourth child of Fridolin Weber and Marie Cecilia Stamm. Her father was a music copyist and a bass player. She and her sisters were trained to be opera singers. == Marriage with Mozart == Constanze's family first met Mozart in Mannheim. Mozart made friends with the Webers. He fell in love with Constanze's sister, Aloysia. Mozart suggested to his father Leopold to send Aloysia to Italy. His father did not agree to this idea. After from his trip to Paris, Mozart went to Mannheim. He hoped to meet Aloysia and the Webers again. However, they had moved to Munich. Mozart arrived at Munich on Christmas Dy 1778. Aloysia rejected Mozart when he met her. The Webers moved to Vienna in 1779. Later, in 1781, Mozart moved to Vienna. He lived with the Webers. He started going out with Constanze. There were rumours that they were lovers. So, Mozart moved out of the Webers' house. He married Constanze on August 4, 1782. His father did not approve of his and Constanze's marriage at first. His agreement arrived in a letter a day after the wedding. Mozart and Constanze had six children together. Only two lived until adulthood; Karl Thomas Mozart and Franz Xaver Wolfgang Mozart. Their marriage was happy. Mozart loved Constanze, and Constanze loved Mozart. His letters to Constanze showed that he loved his wife. When Mozart died in 1792, he left a lot of debt. Mozart did not get a pension from his job as a composer. Five days after Mozart died, Constanze asked Emperor Leopold for a pension. She told the emperor that she needed 3,000 gulden to pay her husband's debts. However, she only needed 1,000 gulden to pay off all of her debts. The emperor gave her enough many to pay off her debts. She was also given 266 guilders and 40 kreuzer every year as pension. She sold copies of her husband's music in order to make a living. She went on a tour with her children and Aloysia to perform Mozart's works. == Marriage with Nissen == In 1797, Constanze met Georg Nikolaus von Nissen, a Danish diplomat working in Vienna. Constanze moved to live together with Nissen in 1798. Nissen worked with Constanze to preserve Mozart's music. Nissen helped negotiate with the music publishers. He also became a father figure to Constanze's two sons. In 1809, Constanze and Nissen were married in Pressburg. The couple moved to Copenhagen in 1810. They moved back to Salzburg in 1821. Nissen started collecting Mozart's letters around this time. However, he died in 1826 before he could finish his work. == Later life and death == After Nissen's death, Constanze published Nissen's biography of Mozart in 1828. She died on March 6, 1842. She was buried with her father- in-law Leopold and her second husband. == References == Category:1762 births Category:1842 deaths Category:Sopranos Category:Mozart family Category:Austrian singers Category:People from Baden-Württemberg Category:European opera singers Category:18th-century people Category:19th- century people",
 "title": "Constanze Mozart"
}