{
 "id": "60160",
 "text": "\"Ishy Bilady\" (, ; \"Long Live My Country\") is the national anthem (a song that represents the country) of the seven United Arab Emirates. The tune was written in the year 1971 without words to sing. Then, in the year 1986 Arif Al Sheikh Abdullah Al Hassan Sahab came up with words for the song. The song is dedicated to the UAE. In the song, the people praise their country by stating that \"the unity of the Emirates has lived\" and \"the United Arab Emirates has lived to be the nation, whose religion is Islam and whose guide is the Quran\" the people also vow to forever work hard and sincerely for the country. The people also state that they \"supply their country with their body, blood and souls.\" The song is a representation of love and submission of the Emirati people to country. It music was composed by Mohammed Abdul Wahab. == Lyrics == === Arabic original === Arabic Transliteration IPA transcription ʿĪšī bilādī ʿāš ittiḥādu ʾimārātinā ʿIšti li-šaʿbin dīnuhu l-ʾislāmu haddyuhu l-qurʾānu Ḥaṣṣantuka bismillah yā waṭan Bilādī bilādī bilādī bilādī Ḥamāki-lʾilāhu šurūra z-zamān ʾAqsamnā ʾan nabniya naʿmal Naʿmal nuxliṣ naʿmal nuxliṣ Mahmā ʿišnā nuxliṣ nuxliṣ Dām al-ʾamānu wa ʿāš al-ʿalam yā ʾimārātinā Ramz al- ʿurūbati kullunā nafdīki bid-dimāʾ narwīki Nafdīka bil-ʾarwāḥ yā waṭan. [ʕɪː.ʃiː bi.læː.diː ʕɑːʃ æt.tɪ.ħæː.du ʔi.mɑː.rɑː.ti.næː] [ʕɪʃ.ti li.ʃɑʕ.bɪn diː.nu.hʊ‿l.ʔɪs.læː.mu hædː.ju.hʊ‿l.qʊr.ʔɑː.nu] [ħɑsˁ.sˁɑn.tu.kæ bɪs.mɪl.læh jæː wɑ.tˁɑn] [bi.læː.diː bi.læː.diː bi.læː.diː bi.læː.diː] [ħɑ.mæː.kɪ‿l.ʔi.læː.hu ʃʊ.ruː.rɑ‿z.zæ.mæːn] [ʔɑq.sæm.næː ʔæn næb.ni.jæ nɑʕ.mæl] [nɑʕ.mæl nʊx.lɪsˁ nɑʕ.mæl nʊx.lɪsˁ] [mæh.mæː ʕɪʃ.næː nʊx.lɪsˁ nʊx.lɪsˁ] [dæːm æl.ʔæ.mæː.nu wɑ ʕɑːʃ æl.ʕɑ.læm jæː ʔi.mɑː.rɑː.ti.næː] [rɑmz æl.ʕʊ.ruː.bæ.ti kʊl.lu.næː næf.diː.ki bɪd.di.mæːʔ nɑr.wiː.ki] [næf.diː.kæ bɪl.ʔɑr.wɑːħ jæː wɑ.tˁɑn] === English translation === Long live my country, the unity of our Emirates lives. You've lived for the nation's faith of Islam and guide of the Quran. I've made you stronger in God's name, o homeland. My country, my country, my country, my country. God protected you from the evils of time. We have sworn to build and work – work earnestly, work earnestly. we will be sincere. The safety has lasted, the flag has lived, o our Emirates! The symbol of Arabism: we all sacrifice for you and give you our blood; For you we sacrifice with our souls, o homeland! == References == Category:1971 works Category:Asian anthems Category:National symbols of the United Arab Emirates",
 "title": "Ishy Bilady"
}