{
 "id": "601755",
 "text": "Trevor Noah (born 20 February 1984) is a Swiss-South African comedian and television and radio host. He has been the host of The Daily Show on the American network Comedy Central since September 2015. He is known for his realistic comedy touch relating to life itself, and his life in South Africa and the world. He hosted major events like the Grammys. Noah worked as an actor, presenter, and comedian in South Africa. He appeared in television roles on the South African Broadcasting Corporation and was the runner-up in the fourth season of Strictly Come Dancing in 2008. From 2010 to 2011, he hosted the late-night show Tonight with Trevor Noah. During this time his stand-up comedy became famous in South Africa and got him invited to American and British television shows. In December 2014, Noah appeared as a contributor on the American satirical news show The Daily Show. He took over from Jon Stewart as host of The Daily Show on 28 September, 2015. His hosting style has more pop culture references and comic impersonations than Stewart’s. As a foreign observer, he comments humorously on American politics and race relations. == Early life == Trevor Noah was born in Johannesburg. His mother, Patricia Nombuyiselo Noah, is a South African Xhosa woman. His father, Robert, is white and Swiss German. Noah’s parents’ interracial relationship was illegal under apartheid at the time of his birth. As a boy, Noah attended Maryvale College, a private Catholic school. He was raised by his mother and maternal grandmother, Nomalizo Frances Noah, in the township of Soweto. His memoir, Born a Crime: Stories from a South African Childhood (2016), is about his youth as a mixed-race child and is dedicated to his mother. == Career == At 18 (2002), Noah had a starring role in the South African soap opera Isidingo. He hosted his own radio show, Noah’s Ark, before becoming a comedy club regular. He has performed with South African as well as international comedians, including opening for Russell Peters’ South African tour. From 2004-2006, he hosted the educational program, Run the Adventure. In 2007, he hosted the gossip show The Real Goboza, and the sports show Siyadlala. In 2008, he co-hosted the dating game-show The Amazing Date and was a contestant on Strictly Come Dancing. In 2009, he hosted the 3rd Annual South Africa Film and Television Awards and co-hosted The Axe Sweet Life, a reality competition series. In 2010, Noah hosted the 16th annual South African Music Awards and Tonight with Trevor Noah. His stand-up comedy acts in South Africa include The Daywalker (2009), Crazy Normal (2011), That’s Racist (2012), and It’s My Culture (2013). Noah moved to the United States in 2011. He was the first South African comedian to appear on The Tonight Show (6 January 2012) and on Late Show with David Letterman (17 May 2013). In 2012, he was the subject of the documentary You Laugh But It’s True and had a one-man comedy show called Trevor Noah: The Racist. In 2013 he performed the comedy show Trevor Noah: African American. In late 2013, he was a guest on BBC Two’s comedy show QI and on Channel 4’s game show 8 Out of 10 Cats. From December 2014, Noah began appearing as a contributor on The Daily Show and became host on 28 September, 2015. Three new members also joined the Daily Show news team: Roy Wood Jr., Desi Lydic, and Ronny Chieng. During each 30-minute episode, Noah has a comic monologue on current news, holds scripted mock discussions with show contributors, and interviews invited guests. On September 14, 2017, Comedy Central announced that Noah’s contract will last five years longer, till 2022. ==Filmography== *Morning, Mandela (2017) *The Daily Show (2015-present) *Isidingo (2003) *Black Panther, Released 2018 ==References== Category:Comedy Central personalities",
 "title": "Trevor Noah"
}