{
 "id": "601937",
 "text": "The People's Party (also known as the Populist Party) was a left-wing political party in the United States. The party wanted direct election of senators, government ownership of the railroads, telegraph and telephone systems, price support for farmers, a graduated income tax, unilimited silver coinage, an 8-hour work day and more propositions and referendums. The party was formed in 1891 after a series of conferences involving the leaders of a few agrarian organizations.Hild, Matthew (2007). Greenbackers, Knights of Labor, and Populists, Farmer-Labor Insurgency in the Late-Nineteenth-Century South.The University of Georgia Press, Athens & London, p. 123. The Populists were very popular among farmers in the southwest and Great Plains. The party nominated James B. Weaver as their presidential candidate for the 1892 election, and he would later receive 8.5% of the popular vote and win 5 states. In the 1896 presidential election, the party nominated Democratic nominee William Jennings Bryan, who supported many of the Populist ideas. To separate themselves from the Democrats, they nominated Thomas E. Watson as their vice-presidential candidate, instead of Democrat pick Arthur Sewall. During this election, the populist party slowly began to merge into the Democratic party. Bryan would later lose the presidency to Republican William McKinley. Although the Populist party nominated candidates in the next three presidential elections, their support heavily dropped as many began to support the Democrats or Republicans, or follow Eugene V. Debs to his new Socialist Party. The party also had success in the House of Representatives elections. In 1890 they won 8 seats, in 1892 they won 11 seats, in 1894 they won 9 seats, in 1896 they won 22 seats, in 1898 they won 6 seats and finally, in 1900 they won 5 seats. The party disbanded in 1908. The last known activity of the official Populist party was in 1913.Walter Lippmann, A Preface to Politics, New York and London: Mitchell Kennerley, 1913, p. 275. == References == == Other websites == * People's Party Hand-Book of Facts. Campaign of 1898 96 p., official party pamphlet for North Carolina election of 1898 * Populist Party timeline and texts; edited by Professor Edwards, secondary and primary sources Category:Political parties in the United States Category:1891 establishments in the United States Category:1900s disestablishments Category:1900s disestablishments in the United States",
 "title": "People's Party (United States)"
}