{
 "id": "602034",
 "text": "The arrondissement of Thiers is an arrondissement of France. It is part of the Puy-de-Dôme département, Auvergne-Rhône-Alpes region. Its capital, and a subprefecture of the department, is the city of Thiers. ==History== When the Puy-de-Dôme department was created in 1790, the arrondissement of Thiers was part of that original department. ==Geography== The arrondissement of Thiers is in the northeast of the department and borders to the north with the Allier department, to the east with the Loire department, to the south with the arrondissement of Ambert, to the southwest with the arrondissement of Clermont-Ferrand, and to the west and northwest with the arrondissement of Riom. The arrondissement of Thiers is the smallest arrondissement of the department, with an area of . It has a population of 57,956 inhabitants and a density of inhabitants/km². ==Composition== ===Cantons=== After the reorganisation of the cantons in France, cantons are not subdivisions of the arrondissements so they could have communes that belong to different arrondissements. In the arrondissement of Thiers there are 4 cantons: # Lezoux (6319) # Maringues (6320) (partly) # Les Monts du Livradois (6322) (partly) # Thiers (6330) ===Communes=== The arrondissement of Thiers has 44 communes; they are (with their INSEE codes): # Arconsat (63008) # Aubusson-d'Auvergne (63015) # Augerolles (63016) # Bort-l'Étang (63045) # Bulhon (63058) # Celles- sur-Durolle (63066) # Chabreloche (63072) # Charnat (63095) # Châteldon (63102) # Courpière (63125) # Crevant-Laveine (63128) # Culhat (63131) # Dorat (63138) # Escoutoux (63151) # Joze (63180) # Lachaux (63184) # Lempty (63194) # Lezoux (63195) # Moissat (63229) # La Monnerie-le-Montel (63231) # Noalhat (63253) # Néronde-sur-Dore (63249) # Olmet (63260) # Orléat (63265) # Palladuc (63267) # Paslières (63271) # Peschadoires (63276) # Puy-Guillaume (63291) # Ravel (63296) # La Renaudie (63298) # Ris (63301) # Sainte-Agathe (63310) # Saint-Flour (63343) # Saint-Jean-d'Heurs (63364) # Saint-Rémy-sur-Durolle (63393) # Saint-Victor-Montvianeix (63402) # Sauviat (63414) # Sermentizon (63418) # Seychalles (63420) # Thiers (63430) # Vinzelles (63461) # Viscomtat (63463) # Vollore-Montagne (63468) # Vollore-Ville (63469) The communes with more inhabitants in the arrondissement are: INSEE code Commune Population (2014) Canton Intercommunality 63430 Thiers 11,588 Thiers Thiers Dore et Montagne 63195 Lezoux 5,864 Lezoux Entre Dore et Allier 63125 Courpière 4,338 Les Monts du Livradois Thiers Dore et Montagne 63291 Puy-Guillaume 2,665 Maringues Thiers Dore et Montagne 63276 Peschadoires 2,110 Lezoux Entre Dore et Allier 63265 Orléat 2,100 Lezoux Entre Dore et Allier 63231 La Monnerie-le- Montel 1,786 Thiers Thiers Dore et Montagne 63393 Saint-Rémy-sur-Durolle 1,766 Thiers Thiers Dore et Montagne 63066 Celles-sur-Durolle 1,755 Thiers Thiers Dore et Montagne 63271 Paslières 1,556 Maringues Thiers Dore et Montagne ==Related pages== * Arrondissements of the Puy-de-Dôme department * List of arrondissements of France ==References== Category:Arrondissements of Puy-de- Dôme",
 "title": "Arrondissement of Thiers"
}