{
 "id": "602240",
 "text": "Anya-Josephine Marie Taylor-Joy (born April 16, 1996) is an actress. She starred as Casey Cooke in the 2017 movie Split, and in the movie's 2019 sequel, Glass. In 2020, she starred in the movie The New Mutants. She has also appeared in Last Night in Soho (2021), The Northman (2022), The Menu (2022), and The Super Mario Bros. Movie (2023). ==Filmography== ===Film=== Key Denotes films that have not yet been released Year Title Role Notes 2014 Vampire Academy Feeder Girl (Uncredited) 2015 The Witch Thomasin 2016 Morgan Morgan Barry Charlotte Baughman Split Casey Cooke 2017 Marrowbone Allie Thoroughbreds Lily Reynolds 2018 Crossmaglen Ana Short film 2019 Glass Casey Cooke Love, Antosha Herself Documentary Playmobil: The Movie Marla Brenner Radioactive Irene Curie 2020 Emma Emma Woodhouse Here Are the Young Men Jen The New Mutants Illyana Rasputin / Magik 2021 Last Night in Soho Sandie 2022 The Northman Olga The Menu Margot / Erin Amsterdam Libby Voze 2023 The Super Mario Bros. Movie Princess Peach (voice) 2024 Dune: Part Two Alia Atreides Uncredited cameo Furiosa: A Mad Max Saga Imperator Furiosa 2025 The Gorge Drasa Joan Filming; also executive producerHollywood Stars Flock to Greece for New Netflix Movie ‘Sacrifice’ ===Television=== Year Title Role Notes 2014 Endeavour Philippa Collins-Davidson 1 episode 2015 Viking Quest Mani Television film Atlantis Cassandra Recurring role, 6 episodes 2017 The Miniaturist Petronella \"Nella\" Brandt Miniseries, 3 episodes 2019–2022 Peaky Blinders Gina Gray 11 episodes 2019 The Dark Crystal: Age of Resistance Brea (voice) Main role, 10 episodes 2020 The Queen's Gambit Beth Harmon Miniseries, 7 episodes 2021 Saturday Night Live Herself (host) Episode: \"Anya Taylor-Joy/Lil Nas X\" TBA Lucky Lucky Upcoming miniseries, also executive producer ===Music videos=== Year Title Artist Role 2015 \"Red Lips (Skrillex remix)\" GTA (featuring Sam Bruno) Girl 2019 \"Dinner & Diatribes\" Hozier Wife ==Awards and nominations== ==Notes== == References == ==Other websites== * Anya Taylor-Joy at the Internet Movie Database * Anya Taylor-Joy on Twitter Category:1996 births Category:Living people Category:American movie actors Category:American television actors Category:Actors from Florida",
 "title": "Anya Taylor-Joy"
}