{
 "id": "60240",
 "text": "The term Christian (United Baptist Christianity) is used for a large group of Christian people across the world who use the same name, the same sort of organization and have the same (or very similar) beliefs. Christianity is divided into six main groups. These groups all branched out at different dates from the early Christianity founded by the followers of Jesus. The splits generally happened because they could not agree on certain beliefs or practices. The groups then divided into smaller groups. Each group that has its own separate name is a \"denomination\". The word \"denomination\" means \"Being given a name”. ==Denominations== Worldwide Christianity is divided into 6 major groups, each with important subdivisions: * Catholic * Protestant, including ** Anglican **Lutheran **Reformed **Anabaptist **Evangelical * Eastern Orthodox * Oriental Orthodox (Miaphysite) *Church of the East (Nestorian) *Nontrinitarian There are also other (smaller) groups that are not mentioned here.Many Christian denomination see themselves as part of the worldwide Church which includes other denominations as well. Some denominations, such as the Roman Catholic and Orthodox Churches and some Protestant Churches, believe that they are the only true Christian church. Some denominations have a middle view that, while they are the most correct Christian church, other churches are less correct but still part of the worldwide church. * When denominations have disagreements about differences in traditions and practices, but not about theology; the denominations are said to be \"in schism\". * When denominations have (usually very strong) disagreements about differences in theology; they would say that the other denomination's beliefs are a \"heresy\". * When a denomination has differences in theology so significant that that other denominations see them as too different to be called a Christian denomination, this is called \"apostasy\". There were some movements considered heresies by the early church which do not exist today and are not generally referred to as denominations. Examples include the Gnostics (who had believed in an esoteric dualism), the Ebionites (who venerated Christ's blood relatives), and the Arians. The greatest divisions in Christianity today, however, are between Eastern Orthodoxy, Roman Catholicism, and various denominations formed during and after the Protestant Reformation. There also exists in Protestantism and Orthodoxy various degrees of unity and division. The Evangelical and Nontrinitarian branches of Christianity are much more divided up than the others. Each separate Evangelical church is often called a \"denomination\". While the Roman Catholic Church looks to a single earthly leader, the Pope, and has similar beliefs right across the world, the several Protestant denominations do not look to a single leader and sometimes have beliefs that are very different from each other. Many Christian denominations see rejection of the Trinity as an apostasy, and so see Nontrinitarian denominations as non-Christian. Comparisons between denominations must be approached with caution. For example, some churches are part of a larger church organization or diocese while, in other groups, each congregation is an independent organization. This issue is further complicated by the existence of groups of congregations with a common heritage that are officially nondenominational and have no centralized authority or records, but which are identified as denominations by non-adherents. Study of such churches in denominational terms is therefore a more complex proposition. Numerical comparisons are also problematic. Some groups count membership based on adult believers and baptized children of believers, while others only count adult baptized believers. Others may count membership based on those adult believers who have formally affiliated themselves with the congregation. In addition, there may be political motives of advocates or opponents of a particular group to inflate or deflate membership numbers through propaganda or outright deception. ==Related pages== * Ecumenism * Religious denomination * List of Christian denominations by number of members ==References== == Other websites == * Christian Denominations History, profiles and comparison charts of major Christian denominations. * Denominational links from the Ecumenism in Canada site * The Christian Post * Canadian Church Headquarters * The Eastern Christian Churches – A Brief Survey * Denominations at WikiChristian * Map Gallery of Religion in the United States",
 "title": "Christian denomination"
}