{
 "id": "60257",
 "text": "In biology, races are distinct populations within the same species with relatively small morphological and genetic differences.Abercrombie M. and others 1990. The Penguin dictionary of biology. London: Penguin Books, entry Infraspecific variation. ISBN 0-14-051177-6 The populations are ecological races if they arise from adaptation to different local habitats or geographic races when they are geographically isolated. If sufficiently different, two or more races may be described as subspecies, which is an official biological taxonomy unit below 'species'. If not, they are called races, which means that a formal rank should not be given to the group, or taxonomists are unsure whether or not a formal rank should be given. According to Ernst Mayr, \"a subspecies is a geographic race that is sufficiently different taxonomically to be worthy of a separate name\" Mayr, Ernst 2002. The biology of race and the concept of equality. Daedalus, Winter 2002, 89-94. ==Example== The key lime is a shrub that grows to a size of about 5 metres in height. It has many thorns. It produces a fruit that is yellow when it is ripe. This fruit is preferred by bartenders to mix cocktails. They prefer this lime, rather than the Persian lime. The lime plant originally came from southeast Asia, where it is native. It was taken to the Middle East, and Crusaders took it to Europe and North Africa. Spanish explorers took it to the West Indies and the Florida Keys. In 1926, a hurricane destroyed most of the commercially-grown limes in the region. The Persian lime was reintroduced then. Some of the original shrubs grew wild in the Florida Keys. It became clear that the originally introduced shrubs (now known as Mexican limes) had modified their fruits. These were darker green than the original Persian limes, they also had a thicker skin.Morton J. 1987. Mexican lime, p.168–172. In: Fruits of warm climates. Julia F. Morton, Miami, FL. Citrus aurantiifolia Swingle == More detail == In biological taxonomy, race is an informal rank below the level of subspecies. It may be used as a higher rank than \"strain\". There are various definitions. Races may be genetically distinct populations in the same species, or they may be defined in other ways, e.g. geographically, or physiologically. Genetic isolation between races is not complete (some interbreeding takes place between the groups). However, the genetic differences are not (yet) enough to put the groups into separate species. The term race is recognized by some, but is not governed by any of the formal codes of biological classification. == Human beings == In former times, scientists often divided human beings into races. For example, they called people with a dark skin \"Negroid\" or \"black race\". But, human gene sequences are very similar compared to many other animals. This is one reason why modern biology says that there is only one human race.Templeton, A. (2016). EVOLUTION AND NOTIONS OF HUMAN RACE. In Losos J. & Lenski R. (Eds.), How Evolution Shapes Our Lives: Essays on Biology and Society (pp. 346-361). Princeton; Oxford: Princeton University Press. . That this view reflects the consenus among American anthropologists is stated in: == References == Category:Taxonomy",
 "title": "Race (biology)"
}