{
 "id": "602662",
 "text": "Roy Allen Williams (born August 1, 1950) is an American college basketball coach for the North Carolina Tar Heels. He started his college coaching career at North Carolina as an assistant coach for Dean Smith in 1978. In 1988, Williams became the head coach of the men's basketball team at Kansas, taking them to fourteen consecutive NCAA tournaments, collecting a .805 win percentage and winning nine conference titles over his fifteen-year span. In 2003, Williams left Kansas to return to his alma mater North Carolina, replacing Matt Doherty as head coach of the Tar Heels. Since returning to North Carolina, Williams has won three national championships, eight Atlantic Coast Conference conference titles, one AP National Coach of the Year award, and two ACC Coach of the Year awards. ==Early years== Williams was born in Marion, North Carolina, and spent his early years in the small western North Carolina towns of Marion and Spruce Pine. As a child his family relocated to nearby Asheville, where he grew up. In basketball, playing for Coach Buddy Baldwin, he was named all-county and all-conference for two years (1967 and 1968), all-western North Carolina in 1968 and served as captain in the North Carolina Blue-White All-Star Game. Williams has stated that Coach Baldwin was one of the biggest influences in his life. Williams went on to play on the freshman team at the University of North Carolina at Chapel Hill and study the game under coach Dean Smith. ==Early coaching years== Williams' first coaching job was in 1973 as a high school basketball and golf coach at Charles D. Owen High School[8] in Black Mountain, North Carolina. He coached basketball and boys' golf for five years and ninth-grade football for four years, and served as athletic director for two years. In 1978, Williams came back to the University of North Carolina and served as an assistant to Coach Dean Smith from 1978 to 1988. During his tenure as assistant coach, North Carolina went 275–61 and won the NCAA national championship in 1982, the first for Smith and the second for North Carolina. One of Williams' more notable events came as assistant coach when he became instrumental in recruiting Michael Jordan. ==Professional players coached== ===Kansas=== * Nick Collison * Drew Gooden * Darrin Hancock * Kirk Hinrich * Raef LaFrentz * Greg Ostertag * Paul Pierce * Scot Pollard * Mark Randall * Ryan Robertson * Wayne Simien * Billy Thomas * Jacque Vaughn * Rex Walters ===North Carolina=== * Harrison Barnes * Reggie Bullock * Ed Davis * Wayne Ellington * Raymond Felton * Danny Green * P.J. Hairston * Tyler Hansbrough * John Henson * Brice Johnson * Ty Lawson * Kendall Marshall * Sean May * James Michael McAdoo * Rashad McCants * David Noel * Marcus Paige * J. P. Tokoto * Jawad Williams * Marvin Williams * Brandan Wright * Tyler Zeller * Coby White * Cameron Johnson * Nasir Little * Justin Jackson * Cole Anthony * Theo Pinson * Luke Maye ==Head coaching record== Category:1950 births Category:American sportspeople Category:Living people Category:Medalists at the 2004 Summer Olympics Category:Naismith Memorial Basketball Hall of Fame inductees Category:People from North Carolina",
 "title": "Roy Williams (coach)"
}