{
 "id": "60270",
 "text": "The Kaffir lime (Citrus hystrix DC., Rutaceae), also known as kieffer lime, makrut or magrood, is a citrus fruit native to Indonesia. It is widely grown worldwide as a garden shrub. It is usually grown for its fruit, the lime. The leaves are used for cooking. Vegetable oil obtained from the leaves is used to make perfumes. ==The plant== The plant is a very thorny bush with aromatic leaves. The oil obtained from the rind of the fruit can be used as an insecticide. The plant is well suited to being grown in a container. The green fruits are different from other limes because of their bumpy and rough exterior. They are also quite small, about 4 centimetres across. The leaves are shaped like an hourglass. The leaves and the leaf-shaped stem are widely used in the cuisine of Cambodia, Thailand and Laos. Citrus x hystrix leaves are also popular in Cambodia but less so in Vietnam. Malay, Burmese and Indonesian (especially Balinese and Javanese; see also Indonesian bay leaf) cuisines use them sporadically with chicken and fish. The leaves can be used fresh or dried and can be stored frozen. Although the most common product of the Citrus x hystrix tree is its leaves (which give a sharp Lime/neroli flavour to Cambodian base paste known as Krueng, Thai dishes such as tom yum and Indonesian food such as sayur assam - literally sour vegetables), the juice and rind of the small, dark-green gnarled fruit (known as jeruk obat - literally medicine citrus) are used in traditional Indonesian medicine. The zest is widely used in Creole cuisine and to impart flavour to \"arranged\" rums on Réunion and Madagascar. ==Other names== Other names for Citrus x hystrix: * Burma: shauk-nu, shauk-waing * Cambodia: krauch soeuch * China: fatt-fung-kam * Malaysia: limau purut * Indonesia: jeruk purut, jeruk sambal * Philippines: swangi * Sri Lanka: kahpiri dehi, odu dehi, kudala-dehi * Thailand: makrut, som makrut ==Terminology== The Oxford Companion to Food () recommends that the name kaffir lime should be avoided in favour of makrut lime because Kaffir is an offensive term in certain cultures and also has no clear reason for being attached to this plant. However kaffir lime appears to be much more common. ==Image Gallery== Image:Thai-keffir-galangal.jpg|Citrus hystrix fruit (left), used in Southeast Asian cooking, with galangal root. Image:Citrus_hystrix_dsc07772.jpg|Kaffir limes (as they are sold on Reunion Island) Image:Citrus hystrix Blanco2.408.jpg|Plate from a book on the Flora of the Philippines Image:Combava Rind Madagascar.jpg|Combava rinds ==Other websites== Category:Citrus Category:Herbs Category:Spices Category:Thai food Category:Plants of Asia",
 "title": "Kaffir lime"
}