{
 "id": "602810",
 "text": "S.S. Manivannan (31 July 1954 – 15 June 2013), popularly known mononymously as Manivannan, was an Indian film actor and director. In a career spanning three decades, Manivannan went from being a story and dialogue writer for veteran director Bharathiraja from 1980–82 to a successful director who thrived in experimenting with different genres, before becoming an actor. With over 400 films to his name, Manivannan was one of the most experienced actors in the field and has directed exact 50 films. Manivannan was mainly a supporting actor in films and often played the comedian or the villain's role. The following is Manivannan's filmography. He has worked as a director, script and dialogue writer and as an actor. Manivannan has acted in over 400 films and directed 50 films throughout his career. ==As director and writer== Year # Film Credited as Language Notes Director Writer 1980 1 Nizhalgal Tamil 1981 2 Alaigal Oivathillai Tamil 1981 3 Seethakoka Chilaka Telugu 1982 4 Aagaya Gangai Tamil 1982 5 Kaadhal Oviyam Tamil 1982 6 Gopurangal Saivathillai Tamil 1983 7 Jothi Tamil 1983 8 Veetula Raman Veliyila Krishnan Tamil 1983 9 Ilamai Kaalangal Tamil 1984 10 Kuva Kuva Vaathugal Tamil 1984 11 January 1 Tamil 1984 12 Ingeyum Oru Gangai Tamil 1984 13 Ambigai Neril Vanthaal Tamil 1984 14 24 Mani Neram Tamil 1984 15 Nooravathu Naal Tamil 1985 16 Anbin Mugavari Tamil 1985 17 Khooni Telugu 1985 18 Darja Donga Telugu Dubbed in Tamil as Marma Manithan 1986 19 Vidinja Kalyanam Tamil 1986 20 Palaivana Rojakkal Tamil 1986 21 Muthal Vasantham Tamil 1987 22 Ini Oru Sudhanthiram Tamil 1987 23 Theertha Karaiyinile Tamil 1987 24 Puyal Padum Pattu Tamil 1987 25 Kalyana Kacheri Tamil 1987 26 Jallikattu Tamil 1987 27 Chinna Thambi Periya Thambi Tamil 1988 28 Ganam Kortaar Avargale Tamil 1988 29 Ullathil Nalla Ullam Tamil 1989 30 Manidhan Marivittan Tamil 1989 31 Gopala Rao Gari Abbayi Telugu Dubbed in Tamil as Kadhal Oivathillai 1989 32 Hum Bhi Insaan Hain Hindi 1990 33 Vazhkai Chakkaram Tamil 1990 34 Sandhana Kaatru Tamil 1991 35 Pudhu Manithan Tamil 1992 36 Therku Theru Machan Tamil 1992 37 Government Mappillai Tamil 1992 38 Agreement Telugu 1993 39 Moondravadhu Kann Tamil 1993 40 Alimayya Kannada 1994 41 Amaidhi Padai Tamil 1994 42 Veera Padhakkam Tamil 1994 43 Rasa Magan Tamil 1994 44 Thozhar Pandian Tamil 1995 45 Gangai Karai Paattu Tamil 1997 46 Nesam Tamil dialogues only 2001 47 Aandan Adimai Tamil 2013 48 Nagaraja Cholan MA, MLA Tamil ==As actor== ===1970s-80s=== Year Title Role Notes 1979 Kallukkul Eeram Assistant director 1980 Nizhalgal Also writer 1982 Ragabanthangal 1984 Nooravathu Naal Also director 1988 Kodi Parakuthu G.D. 1989 Manidhan Marivittan ===1990s=== Year Title Role Notes 1990 Vazhkkaichakkaram Also director 1991 Chirai Kadhavukal 1991 Pudhu Manithan Also director 1992 Government Mappillai Also director 1992 Agreement Also director - Telugu film 1994 Amaidhi Padai Manimaran Also director 1994 Veera Padhakkam Also director 1994 Rasa Magan 1994 Thozhar Pandian 1994 Thai Maaman Paramasivan 1995 Aanazhagan 1995 Gangai Karai Paattu Also director 1995 Villadhi Villain MLA Kuppusamy 1995 Thondan Minister 1995 Deva Tamil Nadu State Film Award for Best Comedian 1995 Rani Maharani 1995 Murai Mappillai Kai Ezhuthu Gounder 1995 Maaman Magal 1996 Nethaji 1996 Subash 1996 Gopala Gopala 1996 Gokulathil Seethai 1996 Kadhal Kottai Kaliyaperumal 1996 Kalloori Vaasal 1996 Aavathum Pennale Azhivathum Pennale Sivalingam 1996 Amman Kovil Vaasalile 1996 Parivattam 1996 Thirumbi Paar Chokku 1996 Tata Birla Ramanathan 1996 Senathipathi Nagappan 1996 Selva 1996 Viswanath 1996 Mettukudi 1996 Maanbumigu Maanavan 1996 Poomani 1996 Purushan Pondatti Velmurugan 1996 Manikkam 1996 Ullathai Allitha Vishwanathan Kasinathan 1996 Avvai Shanmughi Mudaliar 1997 Dharma Chakkaram 1997 Porkaalam 1997 Kadavul God 1997 Kadhalukku Mariyadhai 1997 Vallal Virumaandi 1997 Vidukathai Tamil Nadu State Film Award for Best Comedian 1997 Nesam 1997 Pudhayal 1997 Pistha 1997 Kaalamellam Kaathiruppen a broker 1997 Nerukku Ner 1997 Kaalamellam Kadhal Vaazhga 1997 Periya Manushan Johnson 1997 Periya Idathu Mappillai Manian Gounder 1997 Sishya 1997 Janakiraman 1997 V.I.P 1997 Once More Vijay's maternal uncle 1998 Kaadhale Nimmadhi Velayudham 1998 Sandhippoma 1998 Kadhal Kavithai Vishwa's father 1998 Gurupaarvai 1997 Color Kanavugal 1998 Unnudan 1998 Poonthottam 1998 Veeram Vilanja Mannu 1998 Ninaithen Vandhai Gokulan's uncle 1998 Naam Iruvar Namakku Iruvar Mani 1998 Priyamudan 1998 Kalyana Galatta 1998 Nilaave Vaa Dubai 1998 Aasai Thambi 1998 Desiya Geetham 1998 En Aasai Rasave 1998 Veera Thalattu 1998 Kannathal Mohana Sundaram 1999 Thodarum 1999 Thulladha Manamum Thullum Mani 1999 Annan Rasappan 1999 Sangamam Aavudapillai 1999 Padayappa 1999 Rajasthan 1999 Mugam Muthannan 1999 Mudhalvan Mayakrishnan 1999 Simmaraasi 1999 Nenjinile Mani 1999 Nilave Mugam Kaattu 1999 Chinna Raja Mani 1999 Oruvan 1999 Poomagal Oorvalam 1999 Periyanna 1999 Anantha Poongatre 1999 Hello 1999 Minsara Kanna Mani 1999 Pattali 1999 Kannodu Kanbathellam 1999 Kadhalar Dhinam Manivannan 1999 Chinna Durai ===2000s=== Year Title Role Notes 2000 Unnai Kodu Ennai Tharuven 2000 Pottu Amman 2000 Maayi 2000 Vaanavil Ramasamy 2000 Budget Padmanabhan 2000 Simmasanam 2000 Rhythm 2000 Sandhitha Velai 2000 Mugavaree CD Shop Owner 2000 Kandukondain Kandukondain Sivagnanam 2000 Penngal Sodalai 2001 Mitta Miraasu 2001 Sonnal Thaan Kaadhala Roja's father 2001 Asathal 2001 Dumm Dumm Dumm Sivaji 2001 Engalukkum Kaalam Varum Mannangatti 2001 Paarthale Paravasam Nellai Amaran 2001 Ennavale Subramani 2001 Lovely Mahadevan 2001 Kasi 2001 Piriyadha Varam Vendum Dhaadi 2001 Kabadi Kabadi 2002 Red Narayanan 2002 Pammal K. Sambandam 2002 Raajjiyam 2002 Panchathanthiram 2002 Youth Sandhya's father 2002 Kubusam Telugu film 2002 En Mana Vaanil 2003 Priyamana Thozhi 2003 Vaseegara Mani 2003 Anbe Anbe 2003 Parthiban Kanavu Sathya's father 2003 Alaudin 2003 Enakku 20 Unakku 18 2004 Relax Rekha's father 2004 Arasatchi 2004 Engal Anna 2004 Sullan Mani 2004 Vishwa Thulasi 2004 Kodambakkam 2005 Rendu 2005 Anjaneya 2005 Ji Kaasi 2005 Majaa Govindan 2006 Aadhi Mani 2006 Thambi 2006 Something Something... Unakkum Enakkum JP 2006 Sivappathigaram Sathyamoorthy's father 2007 Mudhal Kanave 2007 Sivaji Arumugam 2007 Cheena Thaana 001 2007 Rameswaram 2007 Puli Varudhu 2008 Thodakkam 2008 Sadhu Miranda 2008 Nenjathai Killadhe 2008 Kuruvi Singamuthu 2008 Aayutham Seivom VBR 2008 Raman Thediya Seethai Manikkavel 2008 Ellam Avan Seyal Veeramani 2008 Bommalattam 2009 Mayandi Kudumbathar Mayandi 2009 Naalai Namadhe ===2010s=== Year Title Role Notes 2010 Pollachi Mappillai 2010 Thillalangadi 2011 Ilaignan 2011 Puli Vesham 2011 Kalavadiya Pozhudugal 2011 Vengayam 2011 Sadhurangam 2011 Velayudham Rathnavelu 2013 Naan Rajavaga Pogiren Kamaraj 2013 Nagaraja Cholan MA, MLA Manimaran 2014 Ninaithathu Yaaro Guest appearance 2014 Sooran 2017 Madha Gaja Raja Delayed ==Television== * Ganga Yamuna Saraswati * Thirumagal * Namma Kudumpam ==References== ==Other websites== * * Manivannan filmography at Cinesouth.com Category:Indian filmographies",
 "title": "Manivannan filmography"
}