{
 "id": "602805",
 "text": "Vivek (born 19 November 1961) is an Indian film actor and comedian. He has won three Filmfare Best Comedian Awards for his performances in Run, Saamy and Perazhagan. In April 2009, Vivek received the Padma Shri award by the Government of India for his contribution to the arts. He was introduced to filmdom by renowned director K. Balachander. This is a complete list of films acted by comedian Vivek. His debut as a hero, Solli Adippen, however, remains unreleased. ==Films== Year Film Role Notes Ref(s) 1985 Kalivaalam 1987 Manathil Uruthi Vendum 1989 Pudhu Pudhu Arthangal Vittal 1990 Oru Veedu Iru Vasal 1990 Pudhu Mappillai 1990 Keladi Kanmani 1991 Nanbargal Gopi 1991 Sendhoora Devi Gopal 1991 Idhaya Vaasal 1991 Anbu Sangili Ku. Rangu 1991 Idhaya Oonjal 1991 Jenma Natchathiram 1991 MGR Nagaril 1991 Putham Pudhu Payanam Vivek 1992 Thambi Pondatti Mani 1992 Innisai Mazhai Michael 1992 Tamil Ponnu 1992 Pudhusa Padikkiren 1992 Kalikaalam 1992 Urimai Oonjaladugirathu 1992 Kizhakku Veedhi 1993 Uzhaippali 1993 Naan Pesa Ninaipathellam Govind 1993 Pass Mark 1993 Rajadhi Raja Raja Kulothunga Raja Marthanda Raja Gambeera Kathavaraya Krishna Kamarajan Vivek 1993 Enga Muthalali Pandurangan ('Bambaram' Pandu) 1994 Vaanga Partner Vaanga Koteeswaran 1994 Veera 1994 Pudhiya Mannargal Aaraaichi 1994 Vaa Magale Vaa 1994 Namma Annachi Nallathambi 1994 Watchman Vadivelu 1994 Pattukottai Periyappa 1994 Vanaja Girija 1995 Thottil Kuzhandhai 1995 Muthukulikka Vaariyala 1995 Nandhavana Theru Beedi 1995 Gandhi Pirantha Mann 1995 Mayabazar 1995 Ilaya Raagam Saamy 1996 Thayagam 1996 Avathara Purushan 1996 Minor Mappillai Kicha 1996 Vetri Mugam 1996 Enakkoru Magan Pirappan Raja 1996 Subash 1997 Kaalamellam Kadhal Vaazhga 1997 Dhinamum Ennai Gavani Inspector Balram 1997 Sishya 1997 Pongalo Pongal Pazhanisamy 1997 Periya Idathu Mappillai 1997 Pagaivan 1997 Nerrukku Ner 50th film 1998 Kaadhale Nimmadhi Panchu 1998 Maru Malarchi Nagarajan 1998 Naam Iruvar Namakku Iruvar Parthasarathy 1998 Kaadhal Mannan Oiyaa 1998 Harichandra Gopal 1998 Sollamale 1998 Kannedhirey Thondrinal 1998 Unnudan 1999 Ninaivirukkum Varai Vinod 1999 Unnaithedi Vivek 1999 Poomagal Oorvalam Sakthi 1999 Vaali Vicky 1999 Oruvan 1999 Viralukketha Veekkam Ramanathan 1999 Unakkaga Ellam Unakkaga Mathi 1999 Mugam 1999 Athanda Ithanda Punyakodi 1999 Thirupathi Ezhumalai Venkatesa Vivek 1999 Unnaruge Naan Irundhal Winner - Tamil Nadu State Film Award for Best Comedian 1999 Aasaiyil Oru Kaditham Ramalingam 2000 Thirunelveli 2000 Eazhaiyin Sirippil Arasu 2000 Good Luck 2000 Sudhandhiram Surfraj 2000 Thai Poranthachu Kutti 2000 Mugavaree Ramesh 2000 Alaipayuthey Sethu 2000 Sandhitha Velai 2000 Kandha Kadamba Kathir Vela Kathirvelan 2000 Kushi Vicky 2000 Karisakattu Poove 2000 Pennin Manathai Thottu Kandasamy 2000 Koodi Vazhnthal Kodi Nanmai Dhandapani 2000 Doubles 2000 Unnai Kann Theduthey 2000 Budget Padmanabhan Krishnan 2000 Palayathu Amman Kalyanaraman 2000 Priyamanavale Chandru 2000 Seenu 2001 Looty Thiruttu VCD Thyagarajan 2001 Nageshwari 2001 Engalukkum Kaalam Varum Santhosh 2001 Ullam Kollai Poguthae 2001 Minnale Chokkalingam 2001 Badri Azhagu 2001 Dumm Dumm Dumm Jim 2001 Middle Class Madhavan Manimaaran 2001 Kanden Seethaiyai Indrajith 2001 Dhill Megaserial Mahadevan 2001 Super Kudumbam Hari 100th film 2001 Kanna Unnai Thedukiren 2001 Kutty Provision shop owner 2001 Viswanathan Ramamoorthy Ramamoorthy 2001 Poovellam Un Vasam Varathan 2001 Alli Thanda Vaanam Tamilkirukkan/Tamilkirukkan's Father 2001 12B Madhan 2001 Manadhai Thirudivittai Valayapathi 2001 Parthale Paravasam Bootham 2001 Shahjahan Bhoopathi 2001 Kottai Mariamman 2001 Majunu Mano 2001 Vadagupatti Maapillai Rowther 2002 Azhagi Desigan 2002 Vivaramana Aalu \"Suitcase\" Subbu 2002 Roja Kootam Aarumugam 2002 Thamizhan Nandakumar 2002 Thenkasi Pattanam Maanikkam Pillai alias Maappillai 2002 Hey! Nee Romba Azhaga Irukke Subbu 2002 Youth Karuthu Kanthaswamy 2002 Run Mohan Winner - Filmfare Best Comedian Award Winner - Tamil Nadu State Film Award for Best Comedian Winner - ITFA Best Comedian Award 2002 Namma Veetu Kalyanam 2002 University 'Allthotta' Bhoopathi 2002 Kadhal Virus Puthir 2003 Dhool Narayana Swamy (Naren) Nominated - Vijay Award for Best Comedian 2003 Pop Carn 2003 Kadhal Sadugudu 'Super' Subbu 2003 Anbe Anbe 2003 Saamy Venkatraman Winner - Filmfare Best Comedian Award Winner - ITFA Best Comedian Award 2003 Lesa Lesa Chandru 2003 Parthiban Kanavu Mano Winner - Tamil Nadu State Film Award for Best Comedian 2003 Ice Pulikesi 2003 Whistle Sahadevan 2003 Kadhal Kisu Kisu Tamilselvan 2003 Thithikudhe 'Punch' Bala 2003 Thennavan Dada Mani 2003 Boys Mangalam 2003 Alai Madhan 2003 Three Roses CID Shankar/Director Bala Mani Bharathi 2003 Thirumalai Pazhani 2003 Ennaku 20 Unnaku 18 Kapil 2003 Joot Siva 2004 Udhaya Basheer 2004 Aethiree Sampath 2004 Perazhagan \"Marriage Assembler\" Kuzhandaisaamy Winner - Filmfare Best Comedian Award 2004 Chellamae Harichandra 2004 Arasatchi 2004 M. Kumaran son of Mahalakshmi Ganesh 2005 Thaka Thimi Tha Vivek 2005 Kana Kandaen Sivaramakrishnan 2005 Anniyan Chaari Winner - Tamil Nadu State Film Award for Best Comedian 2005 Anbe Vaa Nandha 150th film 2005 Vanakkam Thalaiva Erichaamy 2006 Paramasivan Agniputran 2006 Saravana V. C. Damodaran 2006 Aadhi Bullet Winner - Vijay Award for Best Comedian 2006 Kalvanin Kadhali Babloo 2006 Madrasi Paandi 2006 Thiruttu Payale Ceylon Yogaraasa 2006 Madhu Madhan 2006 Nee Venunda Chellam Renigunta Reddy (Royapettah Ramu) 2006 Jambhavan Subhash 2007 Aalwar Pons 2007 Agaram 2007 Sivaji Arivu Winner - Tamil Nadu State Film Award for Best Comedian 2007 Thullal Muthu 2007 Kireedam Shaktivel's brother-in-law 2007 Veerappu Ratthan 2007 Urchagam Ayyanaarkudi Raja 2007 Pasupathi c/o Rasakkapalayam Daas 2008 Thoondil Mac 2008 Singakutty Balu 2008 Sandai Mani/Naattamai 2008 Kuruvi Ops Winner - ITFA Best Comedian Award Nominated - Vijay Award for Best Comedian 2008 Aayudham Seivom Traffic Kanthasaamy 2008 Jayamkondaan Gopal 2008 Durai 'Arusuvai' Ambi 2008 Bommalattam Madurai 2009 Padikathavan 'Assault' Arumugam Nominated - Filmfare Award for Best Supporting Actor - Tamil 2009 Perumal Idithangi/Indrasena Reddy Double Role 2009 1977 Paraman 2009 Guru En Aalu Azhagappan Winner - Edison Award for Best Comedian 2009 Indira Vizha 'Oppila' Mani 2009 Aiyantham Padai Thaanthoni 2009 Anthony Yaar? Kingfisher 2010 Thambikku Indha Ooru 'Cola' Kumar 2010 Sivappu Mazhai 2010 Magane En Marumagane 'Singapetti' Singaram 2010 Singam Erimalai Nominated - Vijay Award for Best Comedian 2010 Pen Singam Thirupathi 2010 Bale Pandiya London 2010 Vaadaa Annamalai (Imitates Suruli Rajan) 2010 Uthama Puthiran Emotional Ekambaram 2011 Seedan Gumbidiswamy 2011 Bhavani IPS Girivalam 2011 Mappillai Child Chinna (JP) Nominated - Vijay Award for Best Comedian 2011 Oru Nunakkatha Singam Malayalam film 2011 Vedi Varun Sandesh Winner - ITFA Best Comedian Award 2012 Murattu Kaalai Saroja 2013 Chandra Yuvaraj Sukumar Kannada film 2013 Kantha Thangamagan 2013 Singam II Erimalai 200th film Nominated - Vijay Award for Best Comedian 2013 Pathayeram Kodi Shankar Lal 2014 Ninaithathu Yaaro Himself Guest appearance 2014 Chandra Yuvaraj Sukumar 2014 Naan Than Bala Bala 2014 Velaiyilla Pattathari Azhagusundaram Winner - SIIMA Award for Best Comedian Nominated - Vijay Award for Best Comedian 2014 Vingyani 2015 Killadi Arnold 2015 Yennai Arindhaal 'Revolver' Richard 2015 Vai Raja Vai Pandian 2015 Buddhanin Sirippu 2015 Palakkattu Madhavan Palakattu Madhavan 2015 Sakalakala Vallavan Vettaiyan/Pasupathy 2016 Thozha Lawyer Lingam 2016 Manithan Surya 2016 Kaashmora Kaashmora's father 2017 Rum Raj 2017 Muthuramalingam Rajasekar Kaalakeyan 2017 Mupparimanam Himself Guest appearance 2017 Brindavanam Vivek 2017 Meesaya Murukku Ramachandran 2017 Velaiilla Pattadhari 2 Azhagusundaram TBA Sakka Podu Podu Raja Filming TBA Thiruttu Payale 2 Filming ==References== Category:Indian filmographies",
 "title": "Vivek filmography"
}