{
 "id": "603069",
 "text": "Stranger Things is an American science fiction television series created, written, directed and co-executive produced by the Duffer Brothers, as well as co-executive produced by Shawn Levy and Dan Cohen. The first season, released in July 2016, stars Winona Ryder, David Harbour, Finn Wolfhard, Millie Bobby Brown, Gaten Matarazzo, Caleb McLaughlin, Natalia Dyer, Charlie Heaton, Cara Buono and Matthew Modine, with Noah Schnapp and Joe Keery in recurring roles. For the second season, Schnapp and Keery were made series regulars, with actors Sadie Sink, Dacre Montgomery, Sean Astin and Paul Reiser also appearing. The series is allegedly based on a 1992 book The Montauk Project: Experiments in Time which tells stories about the Montauk Project, an alleged series of secret U.S. government projects in Long Island. .Season 5 is set to be released in 2025 Set in the fictional town of Hawkins, Indiana in the 1980s, the first season focuses on the investigation into the disappearance of a young boy amid supernatural events occurring around the town including the appearance of a psychokinetic girl who helps the missing boy's friends in their own search. The second season is set a year after the first, and deals with attempts of the characters to return to normal and consequences from that season. The third season is set in the summer of 1985. ==Reception== Stranger Things was met with a very positive response by fans and critics. Viewer numbers for the series quickly climbed to around 14.7 million within the first 35 days after release. Popular review site Rotten Tomatoes gave the first season an approval rating of 96% based on 68 reviews, and a weighted average rating of 8.04/10. ==References== Category:2010s American drama television series Category:2010s mystery television series Category:2010s science fiction television series Category:American horror television series Category:American mystery television series Category:American science fiction television series Category:Indiana in fiction Category:Period television series Category:Works set in the 1980s Category:2016 American television series debuts Category:Netflix original series Category:English-language television programs",
 "title": "Stranger Things"
}