{
 "id": "603094",
 "text": "Michael Lamar White II (born June 18, 1999), known by his professional name Trippie Redd, is an American rapper and singer-songwriter. Following his high school graduation, Trippie Redd moved to Atlanta, where he met rapper Lil Wop. He was eventually offered a record deal with a professional recording studio. Trippie Redd is best known for his songs \"Love Scars\", \"Poles1469\" (featuring 6ix9ine) and \"Dark Knight Dummo\" (featuring Travis Scott). The first two songs were both certified gold by the RIAA, and the latter went to number 72 on the Billboard Hot 100 as well as receiving platinum certification by the RIAA. In July 2018, Trippie Redd announced his first album would be called Life's a Trip. The album was released on August 10, 2018. It entered at number four on the Billboard 200 chart, selling 72,000 album-equivalent units. Trippie Redd earned his highest project on the Billboard 200 chart in November 2018 with the mixtape A Love Letter to You 3 which entered at number three. ==Career== Rapper Lil Wop helped White get started with a professional recording studio. They began working with Kodie Shane. They recorded three projects, Awakening My Inner Beast, Beast Mode and Rock the World Trippie. White eventually signed to the label Strainge Entertainment (now known as Elliot Grainge Entertainment) and relocated to Los Angeles. In May 2017, White released his first mixtape, A Love Letter to You. The lead single \"Love Scars\" received more than 8 million views on YouTube within several months. It also received more than 13 million on SoundCloud. White was included on XXXTentacion's album 17 on the song \"Fuck Love\". went to number 28 on the Billboard Hot 100. In October 2017, White released his second mixtape, A Love Letter to You 2. The album entered at number 34 on the Billboard 200. Later that month, White released a collaboration EP with Lil Wop, titled Angels & Demons. On December 5, 2017, White released the song \"Dark Knight Dummo\" featuring Travis Scott. The song went to number 72 on the Billboard Hot 100, making it White's first entry on the chart as a lead artist. On December 25, 2017, White released the song \"TR666\" on his SoundCloud account, featuring Swae Lee. The song was produced by Scott Storch. The song was previewed on November 30. In January 2018, White released \"18\" with Baauer, Kris Wu, Joji and Rich Brian. In July 2018, White announced his first album would be titled Life's a Trip with 26 songs. He later trimmed it to 16. White released the singles \"Me Likey\" and \"How You Feel\" on June 22, 2018 and \"Taking a Walk\" on August 7, 2018. Life's a Trip was released August 10, 2018. It entered at number four on the Billboard 200, with its single \"Taking a Walk\" entering at number 49 on the Billboard Hot 100. == Personal life == White was briefly in a relationship with rapper Coi Leray. White bought a house worth $300,000 for his mother out of his net worth. Worth around $7 million in March 2017. == Legal issues == White was arrested in May 2018 as a result of a physical attack on rapper FDM Grady in Atlanta. == Discography == * Awakening My InnerBeast (2016) * Beast Mode ++++ (with Pi'erre Bourne) (2016) * Rock the World, Trippie (2016) * White Room Project (2017) * A Love Letter To You (2017) * A Love Letter To You'll Never Get (2017) * A Love Letter To You 2 (2017) * Angels & Demons (featuring Lil Wop) (2017) * TR666+!$ 1400/800 (2018) * LIFE'S A TRIP (2018) * A Love Letter To You 3 (2018) * Old Self (2019) * Trap Symphony (2019) * ! (2019) * A Love Letter To You 4 (2019) * Spooky Sounds (2020) * Pegasus (2020) * NEON SHARK vs. Pegasus (Deluxe: Presented by Travis Barker) (with Travis Barker) (2021) * Trip At Knight (2021) * Hate Is Dead (2021) * First Draft (2022) * Mansion Muzik (2023) * A Love Letter To You 5 (2023) ==References== Category:1999 births Category:Living people Category:21st-century American rappers Category:21st-century American singer-songwriters Category:American hip hop singers Category:American rock singers Category:American singer- songwriters Category:Musicians from Canton, Ohio Category:American pop rappers Category:Rappers from Ohio Category:Singers from Ohio",
 "title": "Trippie Redd"
}