{
 "id": "603111",
 "text": "Symere Bysil Woods (born July 31, 1995), known professionally as Lil Uzi Vert, is an American rapper, singer, and songwriter. They are characterized by their facial tattoos, facial piercings, eccentric hairstyles and androgynous fashion, imagery built on a melodic emo approach to trap. ==Career== Woods first received attention after releasing the single, Money Longer. It peaked at number 92 on Billboard Hot 100. Since then, they have continued to release projects such as Luv Is Rage, Lil Uzi Vert vs. the World, The Perfect Luv Tape, and Luv Is Rage 2. Four of their songs from these projects have reached the Billboard Hot 100. Their album Luv is Rage 2 debuted at number one on the Billboard 200. They were featured on the number one charting single Bad and Boujee by rap trio Migos. ==Personal life== Woods was in a relationship with fashion designer Brittany Byrd from 2014 to 2017. Byrd moved from California to attend the Parsons School of Design, where she was studying when she met Woods. On June 26, 2017, Woods and Byrd broke up. Woods introduced it with a song titled \"Stole Your Luv\". Woods has been in a relationship with JT of the hip hop duo City Girls since 2019. In July 2022, Woods changed their pronouns from \"he/him\" to \"they/them\" on Instagram. It was later confirmed by their spokesperson in a statement to Pitchfork. == Discography == * Purple Thoughtz EP, Part 1 (2014) * The Real Uzi (2014) * Luv Is Rage (2015) * Lil Uzi Vert vs. the World (2016) * The Perfect Luv Tape (2016) * 1017 vs the World (with Gucci Mane) (2016) * Luv Is Rage 1.5 (2017) * Luv Is Rage 2 (2017) * Eternal Atake (2020) * Eternal Atake (Deluxe) (2020) * Pluto x Baby Pluto (featuring Future) (2020) * Red & White (2022) * Pink Tape (2023) * Eternal atake 2 (2024) ==Awards and nominations== ===Grammy Awards=== Year Award Nominated work Category Result 2018 Grammy Awards Themself Best New Artist \"Bad and Boujee\" Best Rap Performance == References == Category:1995 births Category:Living people Category:21st-century American rappers Category:21st- century American singer-songwriters Category:African-American rappers Category:African-American singers Category:American dance musicians Category:American hip hop singers Category:Atlantic Records artists Category:American pop rappers Category:Rappers from Pennsylvania Category:Singers from Philadelphia Category:American trap musicians",
 "title": "Lil Uzi Vert"
}