{
 "id": "603138",
 "text": "Seismic waves are vibrating movement of the ground. Seismic waves can be caused by underground explosions, volcanic eruptions and man-made explosions that can vibrate the ground. Seismic waves go through the Earth’s layers. The speed of seismic waves depends on the type of materials they meet. When they meet different kind of material, they bounce or go in different directions. Seismic waves can be detected by seismographs. == Causes == Seismic waves are caused by earthquakes, underground explosions, volcanic eruptions and man-made explosions that can vibrate the ground. When earthquakes occur, they release energy in a form of seismic waves. Seismic waves make the ground vibrating to all directions from the starting point of the earthquake.David G. Smith ed., The Cambridge Encyclopedia of Earth Sciences (New York, NY: Cambridge University Press, 1982), 36-39Steven I. Dutch, James S. Monroe and Joseph M. Moran, Earth Science (Belmont, CA: Wadsworth Publishing Company, 1998), 167-168Frederick K. Lutgens and Edward J. Tarbuck, Essentials of Geology (Upper Saddle River, NJ: Prentice Hall, 2000), 295-298 == Types == Seismic waves are divided into two main types of waves, body waves and surface waves. Body waves go through the Earth, and surface waves go along the Earth’s surface.Brian J. Knapp, Visual Science Encyclopedia; Earthquakes and Volcanoes (Denbury, CT: Grolier Educational, 2002):40 === Body Waves === Body waves travel through the Earth’s interior. Body waves are divided into two types, primary waves and secondary waves.:7 ==== Primary Waves (P-waves) ==== Primary waves travel faster than any other waves, so when earthquakes occur primary waves arrive first at the surface. That’s why we call them ‘primary’.:13 Primary waves can go through solids, liquids and gases.:36 Primary waves go 7~8 kilometers per second in solids, but primary waves have different speeds in liquids and gases. The ground moves back and forth in the same direction as the primary waves move. Primary waves repeat squeezing and stretching the ground when they move.:13Margaret Carruthers The Young Oxford Library of Science Volume 3; Land, Sea and Air (New York, NY: Oxford University Press, 2002), 19 ==== Secondary Waves (S-waves) ==== Secondary waves arrive after primary waves. That’s why we call them ‘secondary’. Secondary waves can go 3~4 kilometers per second. Secondary waves can’t go through air and liquids. They can only go through solids.:43 The ground moves up and down in the right angle to the direction of the secondary waves. Secondary waves temporary change the shape of materials. === Surface Waves === Surface waves travel along the Earth’s surface. They come after the body waves.:43 Surface waves are caused by primary waves and secondary waves when they arrive at the surface.:43 There are two types of surface waves.:43 ==== Rayleigh Waves ==== Rayleigh waves were named after John William Strutt Rayleigh. When Raleigh waves travel, the particles move in an oval shape, similar to water waves. The speed of Rayleigh waves depends on the types of solids. Information about Rayleigh waves give us the reason why the ground vibrates. Rayleigh waves are slower than Love waves.:37 ==== Love Waves ==== Love waves were named after A.E.H. Love.:28 Particles move back and forth at a 90 degree angle to the wave direction.:37 The speed of Love waves depends on the types of solids. We can know the thickness of the Earth’s crust with Love waves. Love waves usually travel faster than the Rayleigh waves.:28 == Detection == Seismic waves can be detected and recorded by seismographs.:40-41 Primary waves are recorded faster than secondary waves.:40-41 The period between the arrival time of primary waves and secondary waves is used to find the starting point of the wave.:40-41Jan Anderson, et al, The Grolier Encyclopedia of Science and Technology (Denbury, CT: Grolier educational, 1993) We can know about the Earth’s layer through seismic waves. == References == Category:Mechanics",
 "title": "Seismic wave"
}