{
 "id": "604519",
 "text": "The following is a list of notable deaths in November 2017. For notable deaths before the current month, please see \"Previous months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non- humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==November== ===1=== *Brad Bufanda, 34, American actor (Veronica Mars, A Cinderella Story, Co-Ed Confidential), suicide by jumping. *Vladimir Makanin, 80, Russian writer (The Portrait and Around, Ancestor, The Underground, or a Hero of Our Time).Умер писатель Владимир Маканин ===2=== *Orval H. Hansen, 91, American politician, member of the U.S. House of Representatives from Idaho's 2nd congressional district (1969–1975), complications from skin cancer. *Yisrael Rosen, 76, Israeli Orthodox rabbi, founder of the Zomet Institute, pancreatic cancer. *María Martha Serra Lima, 72, Argentine ballad and bolero singer.Murió la cantante María Martha Serra Lima *Aboubacar Somparé, 73, Guinean politician, Interim President (2008) and President of the National Assembly (2002–2008).Urgent/ Aboubacar Somparé, l’ex-président de l’Assemblée Nationale est mort *Dina Wadia, 98, Indian political figure, pneumonia. ===3=== *Jiří Kormaník, 82, Czechoslovakian wrestler, Olympic silver medalist (1964).Navždy odešel stříbrný zápasník z Tokia Jiří Kormaník *Abdur Rahman Biswas, 91, Bangladeshi politician, President (1991–1996), respiratory failure. *Václav Riedlbauch, 70, Czech composer, educator (Academy of Performing Arts in Prague) and politician, Director of the Czech Philharmonic (since 2001) and Minister of Culture (2009–2010), complications from COPD. ===4=== *Michael Augustine, 84, Indian Roman Catholic prelate, Bishop of Vellore (1981–1992) and Archdiocese of Pondicherry and Cuddalore (1992–2004), heart attack. *Tamara Natalie Madden, 42, Jamaican-born American artist, ovarian cancer. *Anna Diggs Taylor, 84, American judge, Judge of the United States District Court for the Eastern District of Michigan (1979–1998), complications from Parkinson's disease. *Dudley Simpson, 95, Australian composer (Doctor Who, Blake's 7, Moonstrike) and conductor (Royal Opera House). ===5=== *Renzo Calegari, 84, Italian cartoonist (Storia del West), complications from a stroke.Morto Renzo Calegari, disegnatore di \"Storia del West\" *Nancy Friday, 84, American feminist author (My Secret Garden, Forbidden Flowers, Women on Top), complications from Alzheimer’s disease. *Robert Knight, 72, American R&B; singer (\"Everlasting Love\", \"Love on a Mountain Top\"). *Mansour bin Muqrin, 43-44, Saudi businessman and politician, Advisor to the Custodian of the Two Holy Mosques (since 2015) and Vice Governor of 'Asir (until 2017), helicopter crash. *Devin Patrick Kelley, 26, American Air Force pilot and Christian teacher aid, perpetrator responsible for the Sutherland Springs church shooting, shot. *Dionatan Teixeira, 25, Brazilian footballer (Košice, Stoke City, Slovakia U21), heart attack. *Lothar Thoms, 61, German track cyclist, Olympic champion (1980).Lothar Thoms stirbt mit 61 Jahren ===6=== *Abdul Aziz bin Fahd, 44, Saudi prince, Minister of State without Portfolio (1998) and Head of the Council of Ministers (2000–2005), shot. *Karin Dor, 79, German actress (You Only Live Twice, Topaz, Women in Hospital). *Marek Frąckowiak, 67, Polish actor (Niespotykanie spokojny człowiek, Ekipa, Ballada o Januszku), spinal cancer.Nie żyje Marek Frąckowiak. Miał 67 lat *Richard F. Gordon, Jr., 88, American astronaut (Gemini 11, Apollo 12). *Feliciano Rivilla, 81, Spanish footballer (national team, Atlético Madrid, Rayo).Muere Feliciano Rivilla ===7=== *Wendell Eugene, 94, American jazz trombonist, pneumonia. *Roy Halladay, 40, American baseball player (Toronto Blue Jays, Philadelphia Phillies), plane crash. *Brad Harris, 84, American actor (Kommissar X, Goliath Against the Giants, The Pirates of the Mississippi) and stuntman. *Hans-Michael Rehberg, 79, German actor (Supermarket, Schindler's List, The Assault of the Present on the Rest of Time).Hans-Michael Rehberg ist tot *Carl Sargeant, 49, Welsh politician, AM (since 2003) and Cabinet Secretary for Communities and Children (2016–2017), suicide by hanging. *Hans Schäfer, 90, German footballer (1. FC Köln, national team), FIFA World Cup winner (1954).Trauer um Weltmeister FC-Legende Hans Schäfer ===8=== *Antonio Carluccio, 80, Italian chef, restaurateur and reality television actor (Two Greedy Italians), complications from a fall. *Roger Grenier, 98, French writer (The Difficulty of Being a Dog) and journalist (Combat, France Soir), complications from pneumonia.L'écrivain Roger Grenier est décédé à 98 ans *Wood Moy, 99, Chinese-born American actor (Chan Is Missing, Howard the Duck, Final Analysis), pneumonia. ===9=== *Grete Berget, 63, Norwegian politician, Minister of Children and Family Affairs (1991–1996), cancer.Grete Berget er død *Fred Cole, 69, American singer-songwriter (\"You Must Be a Witch\") and guitarist (The Lollipop Shoppe, Dead Moon), liver disease. *John Hillerman, 84, American actor (Magnum, P.I., Chinatown, Blazing Saddles), Emmy winner (1987), heart disease. *Gene Kotlarek, 77, American ski jumper. *Chuck Mosley, 57, American singer-songwriter (\"We Care a Lot\") and guitarist (Faith No More, Bad Brains), complications from alcoholism. *Chuck Nergard, 88, American politician, member of the Florida House of Representatives (1967–1976, 1978–1990). *Priyan, 53, Indian cinematographer, heart attack. *Shyla Stylez, 35, Canadian pornographic actress (Pirates II: Stagnetti's Revenge), suspected suicide. ===10=== *Bernhard Eckstein, 82, German racing cyclist, world champion (1960).Trauer um Bernhard Eckstein *Ray Lovelock, 67, Italian actor (Fiddler on the Roof, Let Sleeping Corpses Lie, Violent Rome) and rock musician, bone cancer.È morto Ray Lovelock, dai polizieschi anni Settanta alle serie tv *Erika Remberg, 85, Austrian actress (Circus of Horrors, Saturday Night Out, The Lickerish Quartet).Schauspielerin Erika Remberg gestorben *Mikhail Nikolayevich Zadornov, 69, Latvian-born Russian comedian and writer, brain cancer.Умер Михаил Задорнов ===11=== *Kirti Nidhi Bista, 90, Nepali politician, Prime Minister (1969–1970, 1971–1973, 1977–1979), prostate cancer. *Carlos Dívar, 75, Spanish government administrator, President of Audiencia Nacional (2001–2008), General Council of the Judiciary and Supreme Court (2008–2012), pulmonary edema.Muere Carlos Dívar, expresidente del Tribunal Supremo *Henry Emeleus, 87, British geologist, recipient of the Prestwich Medal (2016), heart attack. *Valery Rozov, 52, Russian BASE jumper, accidental BASE jump crash. *Ian Wachtmeister, 84, Swedish business executive (Oxelösunds Järnverks, Gränges Aluminium AB) and politician, MP (1991–1994), founder of New Democracy, lymphoma.Ian Wachtmeister är död – blev 84 år ===12=== *Bernard Panafieu, 86, French Roman Catholic Cardinal, Archbishop of Aix (1978–1994) and Marseille (1995–2006), complications from Parkinson's disease.Le cardinal Bernard Panafieu est décédé *Jack Ralite, 89, French politician, MP (1973–1981), Minister of Health (1981–1983), Mayor of Aubervilliers (1984–2003) and Senator (1995–2011), respiratory failure.L'ancien ministre communiste Jack Ralite est mort *Edith Savage- Jennings, 93, American civil rights activist. *Liz Smith, 94, American gossip columnist (New York Daily News, The Washington Post, Cosmopolitan).https://www.washingtonpost.com/local/obituaries/liz-smith- syndicated-gossip-columnist-dies- at-94/2017/11/12/8123d6c0-c7fe-11e7-b506-8a10ed11ecf5_story.html *Santiago Vernazza, 89, Argentine football player (River Plate, AC Milan, national team).Santiago Vernazza: el adiós a una gloria de River y de Platense ===13=== *Bobby Doerr, 99, American Hall of Fame baseball player (Boston Red Sox). *Thomas J. Hudner, Jr., 93, American naval aviator, Medal of Honor recipient (1950). *Alina Janowska, 94, Polish actress (Samson, Femina, Niezawodny system), Alzheimer's disease.Alina Janowska nie żyje. Legenda polskiego kina i teatru miała 94 lata *David Poisson, 35, French alpine skier, training accident.Le skieur français David Poisson est mort *Jim Rivera, 96, American baseball player (St. Louis Browns, Chicago White Sox, Kansas City Athletics).‘Jungle Jim’ Rivera, member of 1959 ‘Go-Go’ White Sox, dies at 96 *Eric Salzman, 84, American composer (Center for Contemporary Opera), heart attack. ===14=== *Jack Blessing, 66, American actor (Moonlighting, The Naked Truth, George Lopez), pancreatic cancer. *Hou Zongbin, 88, Chinese politician, Governor of Shaanxi (1990–1992), heart attack.中纪委原副书记侯宗宾逝世，曾任陕西省长、河南省委书记 *Shyama, 82, Indian actress (Aar Paar, Barsaat Ki Raat, Tarana), complications from a lung infection. *Jean-Pierre Schmitz, 85, Luxembourgian road bicycle racer (1956 Tour de France), multiple myeloma.Jempy Schmitz ist verstorben *Wolfgang Schreyer, 89, German writer (Großgarage Südwest, Die Piratenchronik, Unabwendbar), member of PEN International (since 1974). *Gunnar Uldall, 76, German politician, Senator of Economic Affairs and Employment (2001–2008) and member of the Hamburg Parliament (1962–1983).Ehemaliger Hamburger Wirtschaftssenator Uldall gestorben ===15=== *Luis Bacalov, 84, Argentine-born Italian movie composer (Django, The Grand Duel, Il Postino: The Postman), Oscar winner (1995), leukemia. *Keith Barron, 83, English actor (Duty Free, Upstairs, Downstairs, Coronation Street). *Françoise Héritier, 84, French anthropologist and feminist.Françoise Héritier, anthropologue et grande figure du féminisme, est morte *Frans Krajcberg, 96, Polish-born Brazilian painter, complications from pneumonia. *Lil Peep, 21, American singer (\"White Wine\", \"Benz Truck\", \"The Way I See Things\") and rapper (Come Over When You're Sober, Pt. 1), Xanax overdose. ===16=== *Tobias Enverga, 61, Filipino-born Canadian politician, Senator from Ontario (since 2012). *Adalberto Giazotto, 77, Italian physicist (Virgo interferometer), recipient of the Matteucci Medal (2016), heart attack.Addio allo scienziato genovese Adalberto Giazotto *Robert Hirsch, 92, French comedian and actor (Hiver 54, l'abbé Pierre, Le Misanthrope, The Caretaker), César Award winner (1990).Décès du comédien Robert Hirsch, figure du théâtre français, à l'âge de 92 ans *Franciszek Kornicki, 100, Polish fighter pilot, commander of the No. 308 and the No. 317 Fighter Squadrons, heart attack.Zmarł Franciszek Kornicki, weteran walk powietrznych w Wielkiej Brytanii *Erik Meijs, 26, Dutch badminton player, road accident.Bonner Badminton-Profi Erik Meijs (26) stirbt bei Crash *Dik Mik, 72–73, English keyboard player (Hawkwind). (death announced on this date) *Ann Wedgeworth, 83, American actress (Three's Company, Evening Shade, Steel Magnolias), Tony winner (1978). ===17=== *Earle Hyman, 91, American actor (The Cosby Show, The Lady from Dubuque, ThunderCats), stomach cancer. *Salvatore Riina, 87, Italian mobster, capo of the Sicilian Mafia, sepsis complicated by surgery.Toto Riina, l'ancien chef suprême de la Mafia, est mort *Aleksandr Salnikov, 68, Soviet- Ukrainian basketball player, Olympic bronze medalist (1976, 1980).Украинский спорт понес невосполнимую потерю: скончался чемпион-рекордсмен, легенда баскетбола Александр Сальников *Rikard Wolff, 59, Swedish actor (House of Angels, The Lion King, Waiting for Gadot) and singer (\"Pojken på månen\"), emphysema.Rikard Wolff är död ===18=== *Azzedine Alaïa, 77, Tunisian-French fashion designer. *Giorgio Antonucci, 84, Italian physician.Morto Giorgio Antonucci, medico, psicoanalista, scrittore e poeta italiano *Commins Menapi, 40, Solomon Islands footballer (Sydney United, Waitakere, national team), heart attack. *Youssouf Ouédraogo, 64, Burkinabe politician, Prime Minister (1992–1994).Décès de l'ex-Premier ministre Youssouf Ouédraogo du Burkina *Friedel Rausch, 77, German football manager (Luzern) and player (Meidericher, Schalke), skin cancer.Meister-Trainer Friedel Rausch ist tot! *Ben Riley, 84, American jazz drummer (Thelonious Monk, Kenny Barron, Sphere). *Gillian Rolton, 61, Australian equestrian, Olympic champion (1992, 1996), endometrial cancer. *Pancho Segura, 96, Ecuadorian-American Hall of Fame tennis player and coach (Jimmy Connors), complications from Parkinson's disease.Muere Pancho Segura Cano, leyenda del tenis ecuatoriano *Naim Süleymanoğlu, 50, Turkish weightlifter, Olympic champion (1988, 1992, 1996), cerebral edema complicated by liver failure. *Hiromi Tsuru, 57, Japanese voice actress (Dragon Ball, Metal Gear Solid, Ghost Sweeper Mikami), aortic dissection. *Malcolm Young, 64, Scottish-born Australian Hall of Fame musician and songwriter (AC/DC), dementia. ===19=== *Claudio Báez, 69, Mexican actor (Mujer, Casos de la Vida Real, El Privilegio de Amar, Mundo de fieras).Muere Claudio Báez a los 69 años: uno de los grandes villanos de las telenovelas *Andrea Cordero Lanza di Montezemolo, 92, Italian Roman Catholic cardinal and diplomat, Archpriest of Basilica of San Paolo fuori le Mura (2005–2009).Morto il cardinale Andrea Cordero Lanza di Montezemolo *Alex Ifeanyichukwu Ekwueme, 85, Nigerian politician, Vice President (1979–1983), complications from a fall. *Charles Manson, 83, American criminal (Tate murders), songwriter (Lie: The Love and Terror Cult) and cult leader (Manson Family), cardiopulmonary arrest complicated by colorectal cancer. *Fernando Matthei, 92, Chilean Air Force general (Government Junta of Chile) and politician, Minister of Health (1976–1978) and Commander-in-Chief (1978–1991), cardiopulmonary arrest.A los 92 años falleció ex comandante en jefe de la Fuerza Aérea, Fernando Matthei *Milan Moguš, 90, Croatian linguist and academician, Chairman of the Croatian Academy of Sciences and Arts (2004–2010), coronary artery disease.Umro Milan Moguš, jedan od autora hrvatskog pravopisa *Warren \"Pete\" Moore, 78, American Hall of Fame singer-songwriter (\"The Tracks of My Tears\", \"Ain't That Peculiar\", \"Love Machine\") and musician (The Miracles).Warren 'Pete' Moore, Founding Miracles Singer and Motown Legend, Dies at 78 *Jana Novotná, 49, Czech tennis player, Wimbledon winner (1998) and Olympic silver (1988, 1996) and bronze (1996) medalist, cancer. *Della Reese, 86, American actress (Touched by an Angel, Chico and the Man, Harlem Nights) and singer (\"Don't You Know?\"), complications from diabetes. *Tai Chen-yao, 69, Taiwanese politician, member of the Legislative Yuan (1990–2002), pancreatic cancer.戴振耀辭世 遺憾台灣未獨立建國 *Mel Tillis, 85, American Hall of Fame country music singer-songwriter (\"I Ain't Never\", \"Good Woman Blues\", \"Coca-Cola Cowboy\") and actor (The Cannonball Run), respiratory failure complicated by sepsis. ===20=== *Peter Berling, 83, German actor and writer (Aguirre, the Wrath of God, The Name of the Rose, Cobra Verde).Peter Berling ist tot *Terry Glenn, 43, American football player (New England Patriots, Green Bay Packers, Dallas Cowboys), car crash. *John Gordon, 92, English author (The Giant Under The Snow), Alzheimer’s disease. *István Konkoly, 87, Hungarian Roman Catholic prelate, Bishop of Szombathely (1987–2006).Meghalt Konkoly István volt szombathelyi megyéspüspök *Víctor Hipólito Martínez, 92, Argentine lawyer and politician, Vice President (1983–1989), complications from pneumonia.Murió Víctor Martínez, el ex vicepresidente de Raúl Alfonsín *Janusz Wójcik, 64, Polish football player (Gwardia Warszawa, Hutnik Warszawa, Toronto Falcons), coach (national team, Widzew Łódź, Al-Nahda Club) and politician, member of Sejm (2005–2007).Janusz Wójcik nie żyje *Izabella Zielińska, 106, Polish pianist and educator. ===21=== *Derek Barber, Baron Barber of Tewkesbury, 99, British life peer, member of the House of Lords (1992–2016). *Rodney Bewes, 79, British actor (The Likely Lads, Whatever Happened to the Likely Lads?, Spring and Port Wine) and television writer (Dear Mother...Love Albert), vascular dementia. *David Cassidy, 67, American singer-songwriter (\"Cherish\", \"Daydreamer\", \"I Think I Love You\") and actor (The Partridge Family, Ruby & The Rockits, Popstar), multiple organ failure. *Wayne Cochran, 78, American soul singer-songwriter (\"Goin' Back To Miami\", \"Last Kiss\", \"Love Strikes Again\"). *Luis Garisto, 71, Uruguayan footballer (national team, Cobreloa) and coach (Peñarol, Atlas, Deportivo Toluca), respiratory failure.Fallece Luis Garisto, extécnico de Toluca y Atlas *Valentin Huot, 88, French racing cyclist, French National Road Race winner (1957, 1958), bronchopneumonia.Valentin Huot est mort ===22=== *George Avakian, 98, American record producer (Columbia Records, Warner Bros. Records, Decca Records) and executive. *Andrzej Wincenty Górski, 97, Polish chemist and academic, complications from a stroke. *Jon Hendricks, 96, American jazz singer (Lambert, Hendricks & Ross) and songwriter (\"A Good Git-Together\", \"Love in Peace\", \"Jumpin' at the Woodside\"). *Maurice Hinchey, 79, American politician, member of the U.S. House of Representatives from New York's 26th (1993–2003) and 22nd congressional district (2003–2013), frontotemporal dementia. *Imre Hollai, 92, Hungarian diplomat, President of the United Nations General Assembly (1982–1983). *Dmitri Hvorostovsky, 55, Russian opera singer (The Queen of Spades), brain cancer. *Juan Luis Maurás, 95, Chilean politician, President of the Senate (1966) and the Chamber of Deputies (1958).Desde político a empresario: fallece antiguo miembro del Partido Radical, Juan Luis Maurás *Charles C. McDonald, 84, American general, Commander of Air Materiel Command (1989–2012), complications from ALS. *Stefan Radt, 90, German-born Dutch historian and author (Tragicorum Graecorum Fragmenta, Strabons Geographika, The Importance Of The Context). ===23=== *Miguel Alfredo González, 31, Cuban baseball player (national team, Philadelphia Phillies), car crash. *Stela Popescu, 81, Romanian actress (Uncle Marin, the Billionaire) and humanitarian, stroke. ===24=== *Ángel Berni, 86, Paraguayan footballer (national team, San Lorenzo, Real Betis).Otra estrella va al cielo: fallece a los 86 años Ángel Berni *Milein Cosman, 96, German- born British artist. (death announced on this date) *Wesley L. Fox, 86, American colonel, Medal of Honor recipient. *Neil Gillman, 84, Canadian-born American rabbi (Rabbinical Assembly) and philosopher, thrombosis. *Stephen Knapp, 70, American artist, complications from acute myeloid leukemia. *Jaime Ortí, 70, Spanish football businessman (Valencia) and sports commentator (Channel Nou), lung cancer.Muere Jaime Ortí, el presidente más exitoso de la historia del Valencia *Hermann Schwörer, 95, German businessman and politician, MEP (1970–1979).CDU-Politiker Hermann Schwörer ist tot *John Thierry, 46, American football player (Chicago Bears, Cleveland Browns, Green Bay Packers), heart attack. ===25=== *Bertha Calloway, 92, American civil rights activist and historian (Great Plains Black History Museum), pneumonia. *Sotir Ferrara, 79, Italian-Albanian Greek Catholic Church hierarch, Bishop of Piana degli Albanesi (1988–2013).Morto Sotir Ferrara, eparca di Piana degli Albanesi *Rosario Green, 76, Mexican economist and politician, Minister for Foreign Affairs (1998–2000) and Senator (2006–2012).Muere ex canciller Rosario Green; Peña lamenta fallecimiento *Rance Howard, 89, American actor (Apollo 13, Ed Wood, Nebraska), heart failure complicated by the West Nile virus. *Anna Kuzmina, 84, Russian actress (Umnullubat sulustar, Motuo, Yalylyylar), recipient of the People's Artist of the Republic of Sakha (2003).Ушла из жизни народная артистка РС (Я) Анна Кузьмина *Bogdan Maglich, 89, Yugoslav-born American nuclear physicist (Migma). *Julio Oscar Mechoso, 62, American actor (Planet Terror, Jurassic Park III, Bad Boys), heart attack. *Harry Pregerson, 94, American federal judge, Judge of the United States District Court for the Central District of California (1967–1979) and Judge of the United States Court of Appeals for the Ninth Circuit (1979–2015), respiratory failure. ===26=== *Armando Hart, 87, Cuban revolutionary leader (26th of July Movement) and politician, Minister of Education (1959–1976) and Minister of Culture (1976–1997), respiratory failure. *Hou Bo, 93, Chinese photographer (Mao Zedong).摄影家侯波逝世 曾是开国大典唯一登城楼女摄影师师 *W. Marvin Watson, 93, American presidential advisor, White House Appointments Secretary (1963–1968) and Postmaster General (1968–1969).W. Marvin Watson Jr., a top White House aide to Lyndon B. Johnson, dies at 93 ===27=== *Loïc Bouvard, 88, French politician, MP (1988–2012).Nécrologie. Loïc Bouvard s’était battu pour la liberté *Bill Harris, 83, American politician, member (2000–2010) and President of the Ohio Senate (2005–2010). *James Kisicki, 79, American actor (The Shawshank Redemption, Diabolique, Wonder Boys). *Bud Moore, 92, American Hall of Fame racing driver (NASCAR), team owner (Bud Moore Engineering) and World War II military personnel (Normandy landings), Purple Heart recipient. *Cristina Stamate, 71, Romanian actress (Grabeste-te încet, The Secret of Bacchus, O seara la Revista), complications from a stroke.A murit actrița Cristina Stamate ===28=== *Patrícia Gabancho, 65, Argentine-born Spanish writer (A la intempèrie, La batalla de l'Estatut, La postguerra cultural a Barcelona) and journalist, lung cancer.Muere la periodista y escritora Patricia Gabancho *Shadia, 86, Egyptian actress (el-Aql Fi Agaza, Ayam Shababy, La Tas'alni Man Ana) and singer, respiratory failure complicated by a stroke. ===29=== *Belmiro de Azevedo, 79, Portuguese lumber manufacturing executive, founder of Sonae. *Jerry Fodor, 82, American philosopher and cognitive scientist, complications from Parkinson's disease. *Aminul Islam, 82, Bangladeshi academic, member of the Bangladesh Academy of Sciences (since 1978), recipient of the Independence Day Award (1990). *Charles E. Merrill Jr., 97, Polish-born American educator, author and philanthropist. *Heather North, 71, American actress (Days of Our Lives, Scooby-Doo, Captain Caveman and the Teen Angels), cardiopulmonary arrest complicated by bronchitis. *Slobodan Praljak, 72, Croatian politician and military officer, suicide by poison. *Mary Lee Woods, 93, British mathematician and computer programmer.Obituary Mary Lee Berners- Lee ===30=== *Alfie Curtis, 87, British actor (Star Wars Episode IV: A New Hope, The Elephant Man, Take It or Leave It). *Dick Gernert, 89, American baseball player (Boston Red Sox). *Colin Groves, 75, British-born Australian biologist and professor (Australian National University). *Jim Nabors, 87, American actor (Gomer Pyle, U.S.M.C., The Andy Griffith Show, The Best Little Whorehouse in Texas) and singer (\"Back Home Again in Indiana\"). *Surin Pitsuwan, 68, Thai diplomat and politician, Minister of Foreign Affairs (1997–2001) and Secretary General of ASEAN (2008–2012), heart failure. *Marina Popovich, 86, Soviet test pilot and engineer.Умерла знаменитая летчица Марина Попович *Vincent Scully, 97, American architecture historian, Parkinson's disease.Vincent Scully, Yale scholar who explored architecture’s humanizing force, dies at 97 ==Months== * January 2017 * February 2017 * March 2017 * April 2017 * May 2017 * June 2017 * July 2017 * August 2017 * September 2017 * October 2017 ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *11 Category:November 2017 events",
 "title": "Deaths in November 2017"
}