{
 "id": "604614",
 "text": "K. Raghava Lawrence is an Indian choreographer, an actor, director, composer and playback singer. He made his debut as a choreographer in 1993. He began his career as an actor in 1998, in a Telugu film. Most of his Telugu films were dubbed by artists. He became famous in Telugu cinema through the film Style. In Tamil, he became famous through the Muni film series. Lawrence is also known for his complicated hip-hop and westernised dance moves. He has won four Filmfare Awards and three Nandi Awards for best choreography. He is also known for his social services and the temple he built for his living mother Kanmani. He was born In Andhra Pradeah. ==Social Services== * In 2015, after the death of former Indian president A. P. J. Abdul Kalam, Lawrence set up a charity trust in his name and donated Rs.1 crore to it. * He helped for curing heart problems for children. * Raghava gave his personal fund of 1 crores to provide food for the protestants of the Jallikattu Protests. * He also helped people during the Cyclone Vardah in Chennai. ==Temple for Mother== As having so much care and affection towards mother, Raghava built a deity statue for his mother. His mother's name is Kanmani who is still alive. ==Filmography== ===Director=== {| class=\"wikitable\" |- style=\"background:#ccc; text-align:center;\" ! Film !! Year!! Language !! Notes |- | Mass || 2004 || Telugu || |- | Style || 2006 ||Telugu || |- | Muni || 2007 || Tamil || |- | Don || 2007 || Telugu || Also music compose |- |Muni 2: Kanchana || 2011 || Tamil || |- | Rebel || 2012 || Telugu || Also music composer |- |Kanchana 2 || 2015 || Tamil || |- |Muni 4: Kanchana 3 || 2018 || Tamil || |- |Muni 5: Kanchana 4 || 2025 || Tamil || ===Actor=== Film Year Language Role Unnai Kodu Ennai Tharuven 2000 Tamil Ganapathi Parthen Rasithen 2000 Tamil Doss Parthale Paravasam 2001 Tamil Azhagu Arpudham 2002 Tamil Ashok Kumar Style 2002 Telugu Rishaanth Thendral 2004 Tamil Kumar Style 2006 Telugu Raghava Muni 2007 Tamil Ganesh Don 2007 Telugu Raghava Pandi 2008 Tamil Pandi Rajadhi Raja 2009 Tamil Raja Irumbukkottai Murattu Singam 2010 Tamil Singam, Singaram Muni 2: Kanchana 2011 Tamil Raghava Muni 3: Kanchana 2 2015 Tamil Raghava, Shiva Motta Siva Ketta Siva 2017 Tamil Shivakumar IPS (Shivaraj Pandi) \"Shiva\" Also playback singer for song \"Motta Paiyan\" Shivalinga 2017 Tamil Shivalingeswaran ===Dancer=== Film Song Year Language Notes Gentleman \"Chikku Bukku Rayile\" 1993 Tamil Uzhaippali \"Uzhaippali Illatha\" 1993 Tamil Mutha Mestri \"Ee Pettakku\" 1993 Telugu Chinna Madam 1994 Tamil Thai Thangai Paasam \"Roopu Tera Masthana\" 1995 Tamil Amarkalam \"Maha Ganapathi\" 1999 Tamil Unnai Kodu Ennai Tharuven \"Sollu Thalaiva\" 2000 Tamil Kshemamga Velli Labhamga Randi \"Lovvuki Age\" 2000 Telugu Chala Bagundi \"Yentabagundi Basu\" 2000 Telugu Thirunelveli \"Yele Azhagamma\" 2000 Tamil Asura \"Maha Ganapathi\" 2001 Kannada Varushamellam Vasantham \"Naan Ready Neenga Readya\" 2002 Tamil Roja Kootam \"Subbamma\" 2002 Tamil Baba \"Maya Maya\" 2002 Tamil Ninne Istapaddanu \"Krishna Zilla\" 2003 Telugu Satyam \"Kuch Kuch\" 2003 Telugu Naaga \"Nayudori pilla..!\" 2003 Telugu Andhrawala \"Naire Naire\" 2003 Telugu Pudhiya Geethai \"Annamalai\" 2003 Tamil Thirumalai \"Thaamthakka Dheemthakka\" 2003 Tamil Mass \"Mass\" 2004 Telugu Pen Singam \"Adi Aadi Asaiyum Edupu\" 2010 Tamil Kathai Thiraikathai Vasanam Iyakkam \"Live The Moment\" 2015 Tamil Khaidi No. 150 \"Ratthaalu\" 2017 Telugu ==Reference== Category:Tamil actors Category:Tamil singers Category:Tamil directors Category:1976 births Category:Choreographers",
 "title": "Raghava Lawrence"
}