{
 "id": "604824",
 "text": "The Third Rutte cabinet, also called Rutte III cabinet or Rutte III, which governed the Netherlands from October 26, 2017 until January 10, 2022. It was named after Prime Minister Mark Rutte (VVD). It had been outgoing since January 15, 2021, due to problems caused by the childcare benefits scandal.Dutch Cabinet collapses over childcare allowance scandal, NL Times, January 15, 2021 It was a coalition of the People's Party for Freedom and Democracy (VVD), the Christian Democratic Appeal (CDA), Democrats 66 (D66), and the ChristianUnion (CU). VVD is a conservative liberal and D66 a social liberal party. CDA is a Christian democratic and CU an orthodox Christian democratic party. The Third Rutte cabinet had 77 (originally 78) seats in the present House of Representatives (they had 75 (originally 76) seats in the previous Second Chamber) and 32 seats in the Senate (they had 38 seats in the previous First Chamber). It was preceded by the Second Rutte cabinet and succeeded by the Fourth Rutte cabinet. == Composition == The Third Rutte cabinet counted 23 members, of which 7 were women (30%): It consisted of 15 ministers and 8 deputy ministers: * VVD had 5 ministers and 3 deputy ministers (of which 3 were women), together 8. * CDA had 4 ministers and 1 deputy minister (of which 0 was women), together 5. * D66 had 4 ministers and 3 deputy ministers (of which 3 were women), together 7. * CU had 2 ministers and 1 deputy minister (of which 1 was a woman), together 3. Prime Minister: * Mark Rutte (VVD) Deputy Prime Ministers: # Hugo de Jonge (CDA) # Kajsa Ollongren (D66) # Carola Schouten (CU) Ministers with portfolio: * Agriculture and Nature: Carola Schouten (CU) * Defense: Henk Kamp (VVD) (formerly Ank Bijleveld) * Economic Affairs and Climate: Stef Blok (VVD) (formerly Eric Wiebes and Bas van 't Wout) * Education and Culture: Ingrid van Engelshoven (D66) * Finance: Wopke Hoekstra (CDA) * Foreign Affairs: Ben Knapen (CDA) (formerly Halbe Zijlstra, Stef Blok, and Sigrid Kaag) * General Affairs: Mark Rutte (VVD) * Health and Sports: Hugo de Jonge (CDA) * Infrastructure: Barbara Visser (VVD) (formerly Cora van Nieuwenhuizen) * Internal Affairs: Kajsa Ollongren (D66) * Justice and Security: Ferdinand Grapperhaus (CDA) * Social Affairs and Employment: Wouter Koolmees (D66) Ministers without portfolio: * Defunct - health care (formerly Menno Bruins, Martin van Rijn, and Tamara van Ark) * Tom de Bruijn (D66) - trade and development with other countries (formerly Sigrid Kaag) * Sander Dekker (VVD) - justice protection * Arie Slob (CU) - lower education and media Former Ministers: * Tamara van Ark (VVD) - health care * Ank Bijleveld (CDA) - defense * Menno Bruins (VVD) - health care * Cora van Nieuwenhuizen (VVD) - infrastructure * Martin van Rijn (PvdA) (temporarily) - health care * Sigrid Kaag (D66) - foreign affairs * Eric Wiebes (VVD) - economic affairs and climate * Bas van 't Wout (VVD) - economic affairs and climate * Halbe Zijlstra (VVD) - foreign affairs Deputy Ministers: * Paul Blokhuis (CU) - social care * Ankie Broekers-Knol (VVD) - immigration * Alexandra van Huffelen (D66) - allowances and customs * Raymond Knops (CDA) - kingdom relations and information * Hans Vijlbrief (D66) - taxes * Steven van Weyenberg (D66) - infrastructure and water management * Dennis Wiersma (VVD) - social affairs and employment * Dilan Yeşilgöz-Zegerius (VVD) - climate and energy Former Deputy Ministers: * Tamara van Ark (VVD) - social security (became a minister) * Mark Harbers (VVD) - immigration * Mona Keijzer (CDA) - small and medium businesses * Menno Snel (D66) - taxes and customs * Stientje van Veldhoven (D66) - environment and public transport * Barbara Visser (VVD) - personnel policies and equipment (became a minister) * Bas van 't Wout (VVD) - social security (became a minister) == Related pages == * List of Dutch cabinets * 2017 Dutch general election * 2021 Dutch general election == References == == Other websites == * Third Rutte cabinet, Parlement.com Category:21st-century disestablishments in the Netherlands Category:2017 establishments in the Netherlands Category:2022 disestablishments in Europe Rutte 3",
 "title": "Third Rutte cabinet"
}