{
 "id": "604856",
 "text": "Jerome Hayden Powell (born February 4, 1953) is an American lawyer. He is the 16th and current Chair of the Federal Reserve since February 2018 and a member of the Federal Reserve Board of Governors and has served since 2012 upon being nominated by President Barack Obama. On November 2, 2017, President Donald Trump nominated Powell to serve as the next Chair of the Federal Reserve. His nomination was confirmed by the United States Senate on January 31, 2018 and took office on February 5, 2018. ==Early life== Powell was born in Washington, D.C.. He studied at Princeton University and at Georgetown University. In 1975-1976, he spent a year as a legislative assistant to Senator Richard Schweiker of Pennsylvania. ==Early career== From 1984 to 1990, Powell worked at Dillon, Read & Co.. Between 1990 and 1993, Powell worked in the United States Department of the Treasury, at which time Nicholas F. Brady, the former chairman of Dillon, Read & Co., was the United States Secretary of the Treasury. In 1992, Powell became the Under Secretary of the Treasury for Domestic Finance after being nominated by George H. W. Bush. In 1993, Powell began working as a managing director for Bankers Trust, but he quit in 1995. Powell founded Severn Capital Partners, a private investment firm focused on specialty finance and opportunistic investments in the industrial sector. ==Federal Reserve Board of Governors== In December 2011, Powell was nominated to the Federal Reserve Board of Governors by President Barack Obama. He took office on May 25, 2012. In January 2014, he was nominated for another term, and, in June 2014, he was confirmed by the United States Senate in a 67-24 vote for a 14-year term ending January 31, 2028. His nomination was confirmed by the Senate on January 23, 2018 by a 85-12 vote. ==Chair of the Federal Reserve== On November 2, 2017, President Donald Trump nominated Powell to serve as the Chair of the Federal Reserve. On January 31, 2018, Powell was confirmed by the United States Senate. With his term as chair expiring in February 2022, many Democrats began wanting President Joe Biden to pick a replacement. Powell was renominated for a second term by President Joe Biden on November 22, 2021. His nomination for another term as chair was confirmed by the full U.S. Senate on May 12, 2022 in an 80-19 vote.https://twitter.com/SenateCloakroom/status/1524819854578024448?cxt=HHwWgICwqYbln6kqAAAA ==Personal life== In 1985, Powell married Ellissa Leonard. They have three children. Powell's net worth is estimated to be in a range between $4.7 million and $55 million.Public Financial Disclosure Report (OGE Form 2783) Executive Branch Personnel, U.S. Office of Government Ethics. Annual Report 2017: Powell, Jerome. https://extapps2.oge.gov/201/Presiden.nsf/PAS+Index/E54DC5C9281668888525815A006BF4E1/%24FILE/Jerome- H-Powell-2017-278.pdf Accessed April 24, 2020. ==References== ==Other websites== * Statements and Speeches of Jerome H. Powell * Category:1953 births Category:Living people Category:Lawyers from Washington, D.C. Category:Chairs of the Federal Reserve Category:Politicians from Washington, D.C. Category:Businesspeople from Washington, D.C. Category:Republican Party (United States) politicians",
 "title": "Jerome Powell"
}