{
 "id": "60568",
 "text": "Erich Maria Remarque (22 June 1898 – 25 September 1970) was the pseudonym of Erich Paul Remark, a German author. == Life == Erich Paul Remark was born in Osnabrück, a city in Lower Saxony, Germany. His parents were of the working- class. The family was Roman Catholic. When he was eighteen, he had to go to war. The Army sent him the front lines of World War I. He was wounded there, by stray shell fragments. After the war, he changed his last name to Remarque. This had been the family-name until his grandfather's time. He worked at a number of different jobs. He also took the jobs of librarian, businessman, teacher, journalist and editor, at some time. In 1929, Remarque published his most famous work, All Quiet on the Western Front (Im Westen nichts Neues) under the name Erich Maria Remarque. He Changed his middle name to honour his mother. The novel described the utter cruelty of the war from the perspective of a twenty-year-old soldier. A number of similar works followed; in simple, emotive language they realistically described wartime and the postwar years. An opposite view is found in Storm of Steel (In Stahlgewittern) by Ernst Jünger. In 1933, the Nazis banned and burned Remarque's works. They made propaganda materials. In the materials, they said that he was a descendant of French Jews and that his real last name was Kramer, his original name spelled backwards. This is still listed in some biographies despite the complete lack of proof. He had been living in Switzerland since 1931, and in 1939 he emigrated to the United States of America with his first wife, Ilsa Jeanne Zamboui, whom he married and divorced twice, and they became naturalized citizens of the United States in 1947. In 1948 he went to Switzerland, where he spent the rest of his life. He married the Hollywood actress Paulette Goddard in 1958. He was married to her until his death in 1970, at age 72. He is buried in the Ronco cemetery in Ronco, Ticino, Switzerland. Goddard is also buried there. Goddard left $20m to New York University to fund an institute for European study which is named after Remarque. == Awards == * In 1967, he was awarded the Great Cross of Merit (which is a class of the Bundesverdienstkreuz. The Bundesverdienstkreuz is the only Order of Merit that Germany currently awards.) * In 1991, the city of Osnabrück, where he was born, instituted the Erich-Maria-Remarque-Friedenspreis (Peace Prize named after Erich Maria Remarque); It is awarded in the week of his birthday, in the city hall. * Tony Judt, a historian, founded the Erich-Maria-Remarque institute at the University of New York, in 1995. == Work == * Die Traumbude (1920) Debut novel * Im Westen nichts Neues (1929), (All Quiet on the Western Front), its film adaptation * Der Weg zurück (1931), (The Road Back) * Drei Kameraden (1937), (Three Comrades), its film adaptation * Liebe deinen Nächsten (1941), (Flotsam) * Arc de Triomphe (1946), (Arch of Triumph), its film adaptations Arch of Triumph (1948 film) and Arch of Triumph (1985 film) * Der Funke Leben (1952), (The Spark of Life) * Zeit zu leben und Zeit zu sterben (1954), (A Time to Love and a Time to Die ) * Der schwarze Obelisk (1956), (The Black Obelisk) * Die letzte Station (1956, play), (Full Circle) * Der Himmel kennt keine Günstlinge (1961), (Heaven Has No Favorites), its film adaptation Bobby Deerfield * Die Nacht von Lissabon (1963), (The Night in Lisbon) * Schatten im Paradies (published posthumously, 1971), (Shadows in Paradise) His books have been translated into at least 58 languages. == References == * Mariana Parvanova, \"... das Symbol der Ewigkeit ist der Kreis.\" Eine Untersuchung der Motive in den Romanen von Erich Maria Remarque. Tenea, Berlin, (in German) == Other websites == * Slovak website about Erich Maria Remarque * picture tomb at Ronco Category:1898 births Category:1970 deaths Category:German Roman Catholics Category:Writers from Lower Saxony Category:Naturalized citizens of the United States Category:Order of Merit of the Federal Republic of Germany Category:Pen names Category:People from Osnabrück",
 "title": "Erich Maria Remarque"
}