{
 "id": "606353",
 "text": "AF Waltrip also known as AF Course-Waltrip is a former professional sportscar team. The company is as a 50–50 partnership between Michael Waltrip Racing NASCAR co-owners Michael Waltrip and Rob Kauffman. In 2011 Michael Waltrip Racing entered into a technical alliance with AF Corse to provide them sportscars to race in the FIA World Endurance Championship and Tudor United SportsCar Championship (formerly Rolex Sports Car Series). AF Course-Waltrip shut down their sportscar team in 2013 to concentrate on NASCAR. ==Racing Results== ===Complete FIA World Endurance Championship results=== Year Class Car Engine Driver 1 2 3 4 5 6 7 8 Rank Points 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 61 SEB SPA LMS SIL SÃO BHR FUJ SHA 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Rui Águas 61 4 DNS 4 2 4 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Rob Kauffman 61 4 DNS 4 2 4 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Michael Waltrip 61 4 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Brian Vickers 61 DNS 4 2 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Marco Cioci 61 1 4 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Piergiuseppe Perazzini 61 1 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Matt Griffin 61 1 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Enrique Bernoldi 61 3 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Xandy Negrão 61 3 4th 108 2012 LMGTE Am Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Francisco Longo 61 3 4th 108 There was no drivers championship that year, the result indicates team rank in the LMGTE Am Trophy. ===Rolex Sports Car Series Points=== Year Class Car Engine Driver 1 2 3 4 5 6 7 8 9 10 11 12 13 Rank Points 2012 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 56 DAY BIR HOM NJ BEL LEX ELK WAT IMS WAT MON LGA LIM 2012 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Rui Águas 56 35 11 14 15 2012 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Robert Kauffman 56 35 11 14 15 2012 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Travis Pastrana 56 35 2012 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Michael Waltrip 56 35 2013 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 56 DAY TXS BIR ATL BEL LEX WAT IMS ELK KAN LGA LIM 2013 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Rui Águas 56 17 14 14 2013 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Robert Kauffman 56 17 14 14 2013 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Clint Bowyer 56 17 2013 GT Ferrari 458 Italia GT2 Ferrari 4.5 L V8 Michael Waltrip 56 17 Category:Auto racing Category:Sports clubs Category:2013 disestablishments Category:2011 establishments Category:Organizations based in Italy",
 "title": "AF Waltrip"
}