{
 "id": "607051",
 "text": "Kaziranga National Park is a national park in India. The park is home to two- thirds of the world's great one-horned rhinoceroses. It is a World Heritage Site. It was named a Tiger Reserve by the government of India and an Important Bird Area by BirdLife International. Kaziranga is home to large breeding populations of tigers, elephants, wild water buffalo, and swamp deer. One type of swamp deer now only exists in the park. ==History== The Kaziranga Proposed Reserve Forest was created in 1905. Mary Curzon, the wife of the Viceroy of India, wanted the area protected mostly to save the rhinoceros. In 1908, Kaziranga was designated a \"Reserve Forest\". In 1916 it was renamed \"Kaziranga Game Sanctuary\" then changed to “Wild Life Sanctuary” in 1950. ==Geography== The park is located in both the Nagaon district and Golaghat district, in the state of Assam in India. It is about 40 kilometres (25 mi) long and 13 kilometres (8 mi) wide. The park is crossed by four main rivers — Brahmaputra, Diphlu, Mora Diphlu and Mora Dhansiri. There are also many small water bodies. The park is within the Brahmaputra floodplain. This means when the water in the river rises, the park is partially covered in water. Flooding happens every year which results in over half the park being underwater. In 2017, 85% of the park was underwater. At least 107 animals died because of the flooding in 2017. There are elevated areas of the park which provide retreats and shelter for animals during floods. These are called chapories. Many artificial chapories have been built with the help of the Indian Army to ensure the safety of the animals. ==Climate== The park has three seasons: winter, summer, and monsoon. The winter season is between November and February. It is mild and dry. The small water bodies dry up and short grass covers the bed. The summer season between March and May is hot. The animals can be found near water during these months. The rainy monsoon season lasts from June to September. ==Fauna== Kaziranga National Park is home to 35 major mammals. This includes 15 mammals under the highest protection in India. The One-Horned rhinoceros, Royal Bengal Tiger, Asian elephant, wild water buffalo and swamp deer are collectively known as the 'Big Five' of Kaziranga. In addition there are gaur, sloth bears, clouded leopards, wild boar, and several deer species. Small mammals include the rare hispid hare, mongoose, civet, pangolin, and badgers. The park also is home to several primates. These include macaques, lutungs, the Bengal slow loris, and the only ape in India - the hoolock gibbon. Kaziranga's rivers are home to the endangered Ganges dolphin. More than 490 bird species live in Kaziranga which includes 24 globally threatened species. The park is known for its nesting colonies of Spot-billed Pelicans and Adjutants. Waterfowl which breed in or pass through Kaziranga include several rare species of geese (lesser white-fronted goose), and ducks (ferruginous pochard, Baer's pochard). Other rare riverine birds include kingfishers, herons, shanks, and terns. Raptors include the rare eastern imperial eagle, other eagles, and the lesser kestrel. Two of the largest snakes in the world, the reticulated python and the rock python, are common inside the park. It is also home to the king cobra, Indian cobra, Russell's viper, and common krait. Fifteen species of turtle live in Kaziranga. 42 species of fishes are found in the Kaziranga area, including the unusual ocellated pufferfish. ==Flora== There are four main types of plant life in Kaziranga National Park.Talukdar, B. (1995). Status of Swamp Deer in Kaziranga National Park. Department of Zoology, Guwahati University, Assam. These are alluvial inundated grasslands, alluvial savanna woodlands, tropical moist mixed deciduous forests, and tropical semi-evergreen forests. Percent coverage by vegetation is: tall grasses 41%, short grasses 11%, open jungle 29%, swamps 4%, rivers and water bodies 8%, and sand 6%.Kushwaha, S.& Unni, M. (1986). Applications of remote sensing techniques in forest-cover-monitoring and habitat evaluation—a case study at Kaziranga National Park, Assam, in, Kamat, D.& Panwar, H.(eds), Wildlife Habitat Evaluation Using Remote Sensing Techniques. Indian Institute of Remote Sensing / Wildlife Institute of India, Dehra Dun. pp. 238–247 ==References== == Other websites == * Official website of Kaziranga Category:National parks in India Category:World Heritage Sites in India Category:1974 establishments in Asia Category:1970s establishments in India",
 "title": "Kaziranga National Park"
}