{
 "id": "607382",
 "text": "Harry Potter and the Deathly Hallows – Part 1 is a 2010 British-American fantasy movie. It is based on the book by J. K. Rowling. The movie was directed by David Yates and distributed by Warner Bros. Pictures. It stars Daniel Radcliffe as Harry Potter, with Rupert Grint and Emma Watson. == Plot == Harry Potter, Ron Weasley and Hermione Granger do not return to Hogwarts because they are now on a mission to find and destroy all of Lord Voldemort's horcruxes (objects that Voldemort has put his soul inside so that he can live forever). After a while of searching, the trio soon find out that one of the horcruxes, a locket, is in the possession of Dolores Umbridge, a Ministry of Magic official. The trio infiltrate the Ministry and find out Voldemort's followers have full control over it now. They steal the locket from Umbridge and escape. Ron decides to leave the quest but later returns and helps Harry find the Sword of Gryffindor, which destroys the locket. The three travel to Xenophilius Lovegood's house (he is the father of their friend, Luna). Luna has been kidnapped by the Death Eaters. Xenophilius tells them about the Deathly Hallows, three objects created by Death. They are the Elder Wand (most powerful wand ever), the Resurrection Stone and the Cloak of Invisibility. Xenophilius summons the Death Eaters, hoping to trade Harry for Luna but the trio escape. Harry, Ron and Hermione arrive in a forest but are soon captured by Snatchers and brought to the home of the Malfoy family. Death Eater Bellatrix Lestrange asks Draco Malfoy if he recognises Harry. Draco lies and says he does not. Bellatrix sees the Sword of Gryffindor, which she thought was in her bank vault. In the dungeon, Harry and Ron meet Luna, Mr Ollivander and a bank goblin named Griphook. A house elf named Dobby arrives to rescue them. As they apparate away, Bellatrix throws a knife, killing Dobby. Meanwhile, Voldemort breaks into Albus Dumbledore's grave and takes the Elder Wand. == Cast == * Daniel Radcliffe as Harry Potter * Rupert Grint as Ron Weasley, one of Harry's best friends. * Emma Watson as Hermione Granger, one of Harry's best friends. * Helena Bonham Carter as Bellatrix Lestrange, a Death Eater and Sirius Black's cousin and murderer. * Robbie Coltrane as Rubeus Hagrid, Harry's half-giant friend, and gamekeeper at Hogwarts. * Warwick Davis as Griphook, a goblin and former employee at Gringotts Bank. Davis replaced Verne Troyer, who portrayed the character physically in the first film, though Davis had dubbed Griphook's lines. * Tom Felton as Draco Malfoy, a Death Eater and son of Lucius and Narcissa Malfoy. * Ralph Fiennes as Lord Voldemort, an evil, power-hungry wizard, and the leader of the Death Eaters. * Michael Gambon as Albus Dumbledore, former headmaster of Hogwarts killed by Severus Snape in the previous film. * Brendan Gleeson as Alastor 'Mad-Eye' Moody, a member of the Order of the Phoenix. * Richard Griffiths as Vernon Dursley, Harry's Muggle uncle. * John Hurt as Garrick Ollivander, a wandmaker * Rhys Ifans as Xenophilius Lovegood, the eccentric father of the Harry's friend Luna. * Jason Isaacs as Lucius Malfoy, Draco Malfoy's father and a disgraced Death Eater. * Bill Nighy as Rufus Scrimgeour, the new Minister of Magic. * Alan Rickman as Severus Snape, a spy to the Death Eaters and the new headmaster of Hogwarts. * Fiona Shaw as Petunia Dursley, Harry's Muggle aunt. * Timothy Spall as Peter Pettigrew, the Death Eater who betrayed Harry's parents to Voldemort. * Imelda Staunton as Dolores Umbridge, Senior Undersecretary to the Minister and Head of the Muggle-born Registration Commission. * David Thewlis as Remus Lupin, a member of the Order of the Phoenix and a former teacher at Hogwarts. * Julie Walters as Molly Weasley, the head of the Weasley family and a mother figure to Harry. * Bonnie Wright as Ginny Weasley, Ron's sister and Harry's love interest == References == Category:2010 fantasy movies Category:2010s English-language movies Category:2010s sequel movies Harry Potter 7 Category:British fantasy movies Category:2010s American fantasy movies Category:American sequel movies Category:Warner Bros. movies Category:Movies based on books Harry Potter 7",
 "title": "Harry Potter and the Deathly Hallows – Part 1"
}