{
 "id": "607515",
 "text": "This is a complete list of English-translated volumes of the French book collection . In United Kingdom, the collection was published by Thames & Hudson under the title “New Horizons”, which contains 107 volumes. In United States, Harry N. Abrams produced 111 volumes in the collection “Abrams Discoveries”. == List == English title (UK) English title (US) French title Author Translator Publication date (UK) Publication date (US) The Search for Ancient Egypt The Search for Ancient Egypt Ruth Sharman 18 May 1992 30 March 1992 Writing: The Story of Alphabets and Scripts Writing: The Story of Alphabets and Scripts Jenny Oates 18 May 1992 30 March 1992 Pompeii: The Day a City Died Pompeii: The Day a City Died Caroline Palmer 18 May 1992 30 March 1992 The Vikings: Lords of the Seas The Vikings: Lords of the Seas Yves Cohat Ruth Daniel 18 May 1992 30 March 1992 Lost Cities of the Maya Lost Cities of the Maya Sydney Picasso, Caroline Palmer 18 May 1992 30 March 1992 The Amazon: Past, Present and Future The Amazon: Past, Present, and Future I. Mark Paris 18 May 1992 30 March 1992 Beethoven: The Composer as Hero Beethoven: The Composer as Hero Carey Lovelace 18 May 1992 30 March 1992 Van Gogh: The Passionate Eye Van Gogh: The Passionate Eye Anthony Zielonka 18 May 1992 30 March 1992 Gauguin: The Quest for Paradise Gauguin: The Quest for Paradise I. Mark Paris 18 May 1992 30 March 1992 The Reign of the Dinosaurs The Reign of the Dinosaurs Jean-Guy Michard I. Mark Paris 18 May 1992 30 March 1992 North Pole, South Pole: Journeys to the Ends of the Earth North Pole, South Pole: Journeys to the Ends of the Earth Bertrand Imbert Alexandra Campbell 18 May 1992 30 March 1992 The Life and Lore of the Elephant The Life and Lore of the Elephant I. Mark Paris 18 May 1992 1 April 1992 The Search for Ancient Greece The Search for Ancient Greece , Françoise Étienne Anthony Zielonka 1 September 1992 30 October 1992 Newton: Understanding the Cosmos Newton : The Father of Modern Astronomy Jean-Pierre Maury I. Mark Paris 1 September 1992 30 October 1992 The Sky: Order and Chaos The Sky: Mystery, Magic, and Myth Anthony Zielonka 21 September 1992 30 October 1992 The Aztecs: Rise and Fall of an Empire The Aztecs: Rise and Fall of an Empire 21 September 1992 30 October 1992 Rembrandt: Substance and Shadow Rembrandt: Master of the Portrait Alexandra Campbell 21 September 1992 30 October 1992 Rodin: The Hands of Genius Rodin: The Hands of Genius Hélène Pinet Caroline Palmer 21 September 1992 30 October 1992 The Story of Jazz: Bop and Beyond The Story of Jazz: Bop and Beyond Franck Bergerot, Marjolijn de Jager 1 March 1993 15 March 1993 The Search for Ancient Rome The Search for Ancient Rome Claude Moatti Anthony Zielonka 29 March 1993 15 March 1993 Degas: Passion and Intellect Degas: The Man and His Art I. Mark Paris 29 March 1993 15 March 1993 Volcanoes: Fire from the Earth Volcanoes: Fire from the Earth Paul Bahn 1 June 1993 15 March 1993 Monet: The Ultimate Impressionist Monet: The Ultimate Impressionist Anthony Roberts 21 June 1993 15 March 1993 The Exploration of Africa: From Cairo to the Cape The Exploration of Africa: From Cairo to the Cape Alexandra Campbell 21 June 1993 15 March 1993 Mozart: The Real Amadeus Mozart: From Child Prodigy to Tragic Hero Michel Parouty Celia Skrine 1 September 1993 1 October 1993 Picasso: Master of the New Picasso: Master of the New Idea Marie-Laure Bernadac, 27 September 1993 1 October 1993 The Changing Universe: Big Bang and After The Birth of the Universe: The Big Bang and After I. Mark Paris 27 September 1993 1993 Shakespeare: Court, Crowd and Playhouse The Age of Shakespeare Alexandra Campbell 1 October 1993 1 October 1993 The Celts: First Masters of Europe (cy) The Celts: Conquerors of Ancient Europe Daphne Briggs 25 October 1993 1 October 1993 The Story of Rock: Smash Hits and Superstars The Story of Rock: Smash Hits and Superstars Toula Ballas 25 October 1993 1 October 1993 Gaumont: A Century of French Cinema François Garçon Bruce Alderman, Jonathan Dickinson 1 January 1994 The Story of Fossils: In Search of Vanished Worlds Fossils: Evidence of Vanished Worlds Yvette Gayrard-Valy I. Mark Paris 1 March 1994 1 February 1994 Ancient Greece: Utopia and Reality The Birth of Greece Anthony Zielonka 1 March 1994 1 April 1994 Goya: Painter of Terror and Splendour Goya: Painter of Terrible Splendor Jeannine Baticle Alexandra Campbell 14 March 1994 23 March 1994 Vampires: The World of the Undead Vampires: Restless Creatures of the Night Lory Frankel 1 April 1994 1 March 1994 Cézanne: The First Modern Painter Cézanne: Father of 20th-Century Art Michel Hoog Rosemary Stonehewer 18 April 1994 1 February 1994 The Incas: Empire of Blood and Gold The Incas: People of the Sun Paul Bahn 18 April 1994 1 March 1994 D-Day: The Normandy Landings and the Liberation of Europe D-Day and the Invasion of Normandy 16 May 1994 1 April 1994 Mummies: A Journey Through Eternity Mummies: A Voyage Through Eternity , Roger Lichtenberg Ruth Sharman 1 October 1994 5 October 1994 Toulouse-Lautrec: Painter of the Night Toulouse-Lautrec: Scenes of the Night Claire Frèches, Alexandra Campbell 3 October 1994 5 October 1994 Matisse: The Sensuality of Colour Matisse: The Wonder of Color Xavier Girard I. Mark Paris 3 October 1994 5 October 1994 The Wisdom of the Buddha The Wisdom of the Buddha Carey Lovelace 3 October 1994 5 October 1994 Angkor: Heart of an Asian Empire Angkor: Heart of an Asian Empire Bruno Dagens Ruth Sharman 27 February 1995 1 February 1995 The Silent Gods: Mysteries of Easter Island Easter Island: Mystery of the Stone Giants Catherine Orliac, Michel Orliac Paul Bahn 1995 1 February 1995 Cinema is 100 Years Old Birth of the Motion Picture Emmanuelle Toulet Susan Emanuel 27 February 1995 1 February 1995 The Cathedral Builders of the Middle Ages Cathedrals and Castles: Building in the Middle Ages Rosemary Stonehewer 27 March 1995 1 February 1995 Manet: Painter of Modern Life Manet: The Influence of the Modern Rachel Kaplan 27 March 1995 1 February 1995 Voodoo: Truth and Fantasy Voodoo: Search for the Spirit Lory Frankel 24 April 1995 1 February 1995 Renoir: A Sensuous Vision Renoir: A Sensuous Vision Lory Frankel 1 August 1995 1 October 1995 The First Humans: The Search for Our Origins Human Origins: The Search for Our Beginnings Herbert Thomas Paul G. Bahn 23 October 1995 15 October 1995 The Irish Famine The Irish Famine Originally published in English 30 October 1995 15 October 1995 The Garden: Visions of Paradise Paradise on Earth: The Gardens of Western Europe I. Mark Paris 30 October 1995 15 October 1995 Architecture of the Renaissance: From Brunelleschi to Palladio Architecture of the Renaissance: From Brunelleschi to Palladio Caroline Beamish 22 April 1996 30 March 1996 Charlie Chaplin: The Art of Comedy Charlie Chaplin: Comic Genius Originally published in English 22 April 1996 30 March 1996 How Weather Works: Understanding the Elements Weather: Drama of the Heavens René Chaboud I. Mark Paris 22 April 1996 30 March 1996 The Golden Treasures of Troy: The Dream of Heinrich Schliemann Golden Treasures of Troy: The Dream of Heinrich Schliemann Hervé Duchêne Jeremy Leggatt 7 May 1996 30 March 1996 The Crusades and the Holy Land The Crusaders: Warriors of God Lory Frankel 7 May 1996 30 March 1996 Corot: The Poetry of Landscape Corot: Extraordinary Landscapes , Lisa Davidson 10 June 1996 September 1996 Alexander the Great: The Heroic Ideal Alexander the Great: Man of Action, Man of Spirit Jeremy Leggatt 23 September 1996 1 September 1996 Gandhi: Father of a Nation Gandhi: The Power of Pacifism Ruth Sharman 23 September 1996 1 September 1996 Underwater Archaeology: Exploring the World Beneath the Sea Underwater Archaeology: Exploring the World Beneath the Sea Alexandra Campbell 23 September 1996 1 September 1996 Knossos: Unearthing a Legend Knossos: Searching for the Legendary Palace of King Minos David J. Baker 7 October 1996 1 September 1996 Le Corbusier: Architect of a New Age Le Corbusier: Architect, Painter, Poet Jean Jenger Caroline Beamish 7 October 1996 1 September 1996 Cleopatra: From History to Legend Cleopatra: The Life and Death of a Pharaoh Edith Flamarion Alexandra Bonfante-Warren 1 March 1997 1 February 1997 Francis Bacon: ‘Taking Reality by Surprise’ Francis Bacon: Painter of a Dark Vision Ruth Sharman 24 March 1997 1 February 1997 Heraldry: Its Origins and Meaning Heraldry: An Introduction to a Noble Tradition Francisca Garvie 14 April 1997 1 February 1997 Lewis Carroll and Alice Lewis Carroll in Wonderland: The Life and Times of Alice and Her Creator Stephanie Lovett Stoffel Originally published in English 2 June 1997 1 February 1997 King Arthur: Chivalry and Legend King Arthur and the Knights of the Round Table Ruth Sharman 1 September 1997 1 September 1997 The Forbidden City: Heart of Imperial China The Forbidden City: Center of Imperial China Gilles Béguin, Dominique Morel Ruth Taylor 27 October 1997 1997 Leonardo da Vinci: Renaissance Man Leonardo da Vinci: The Mind of the Renaissance Alexandra Bonfante-Warren 10 November 1997 1 September 1997 Numbers: The Universal Language Numbers: The Universal Language Lory Frankel 16 February 1998 1 September 1997 Khmer: Lost Empire of Cambodia Khmer: The Lost Empire of Cambodia Thierry Zéphir Francisca Garvie 16 March 1998 1 March 1998 Mughal India: Splendours of the Peacock Throne India and the Mughal Dynasty Valérie Berinstain Paul Bahn 14 April 1998 1 March 1998 Chagall: The Art of Dreams Chagall: The Art of Dreams Ruth Taylor 30 June 1998 1 October 1998 Diamonds and Precious Stones Diamonds and Precious Stones Patrick Voillot Jack Hawkes 12 October 1998 1 October 1998 Our Prehistoric Past: Art and Civilization Prehistoric Art and Civilization Denis Vialou 12 October 1998 1 October 1998 Ramesses the Great: Warrior and Builder Ramesses II: Greatest of the Pharaohs Laurel Hirsch 1 January 1999 1 January 1999 Signs, Symbols and Ciphers: Decoding the Message Signs, Symbols and Ciphers Sophie Hawkes 18 January 1999 1 October 1998 Gustave Moreau: Magic and Symbols Geneviève Lacambre Benjamin Lifson 1 March 1999 Standing Stones: Stonehenge, Carnac and the World of Megaliths Megaliths: Stones of Memory Jean-Pierre Mohen Dorie B. and David J. Baker 1 March 1999 1 June 1999 The Human Body: Image and Emotion Images of the Body Dorie B. Baker, David J. Baker 18 October 1999 1 September 1999 The Search for Ancient China The Search for Ancient China Corinne Debaine-Francfort Paul Bahn 18 October 1999 1 September 1999 Japan: The Fleeting Spirit The Art and Culture of Japan Nelly Delay Lorna Dale 18 October 1999 1 September 1999 Chardin: An Intimate Art Chardin: An Intimate Art Hélène Prigent, Pierre Rosenberg Jane Brenton 21 February 2000 1 May 2000 The Pre-Raphaelites: Romance and Realism The Pre-Raphaelites: Romance and Realism Francisca Garvie 17 April 2000 1 May 2000 Alchemy: The Great Secret Jack Hawkes 1 May 2000 The Bronze Age in Europe: Gods, Heros and Treasures The Bronze Age in Europe Jean-Pierre Mohen, David and Dorie Baker 3 May 2000 1 November 2000 Petra: The Rose-Red City Petra: Lost City of the Ancient World Christian Augé, Jean-Marie Dentzer Laurel Hirsch; some documents translated by David Baker 8 May 2000 1 May 2000 Colour: Making and Using Dyes and Pigments Colors: The Story of Dyes and Pigments François Delamare, Bernard Guineau Sophie Hawkes 27 November 2000 1 November 2000 Bonnard: The Colour of Daily Life Bonnard: Shimmering Color Laurel Hirsch 12 February 2001 1 November 2000 Coptic Egypt: The Christians of the Nile Coptic Egypt: The Christians of the Nile Sophie Hawkes 1 June 2001 1 May 2001 Whales: Giants of the Seas and Oceans Whales: Giants of the Seas and Oceans Yves Cohat, Anne Collet Ruth Sharman 28 August 2001 1 November 2001 Charles Darwin: The Scholar Who Changed Human History Darwin and the Science of Evolution Paul G. Bahn 28 August 2001 1 November 2001 The Calendar: Measuring Time The Calendar: History, Lore, and Legend Jacqueline de Bourgoing David J. Baker, Dorie B. Baker 1 October 2001 1 November 2001 Vuillard: Master of the Intimate Interior Vuillard: Post- Impressionist Master 10 June 2002 11 June 2002 Gaudí: Builder of Visions Gaudí: Visionary Architect Philippe Thiébaut 15 July 2002 1 April 2002 Alexandria: Past, Present and Future Alexandria: Jewel of Egypt Jane Brenton 5 August 2002 1 November 2002 The Invention of Photography: The First Fifty Years The Invention of Photography Ruth Taylor 7 October 2002 1 November 2002 Genghis Khan and the Mongol Empire Genghis Khan and the Mongol Empire Toula Ballas 1 May 2003 1 July 2003 Tibet: Turning the Wheel of Life Tibet: An Enduring Civilization Barbara Mellor, David H. Wilson 6 May 2003 1 July 2003 Dalí: The Impresario of Surrealism Dalí: Master of Fantasies Jean-Louis Gaillemin 1 April 2004 1 July 2004 Graphics: A Century of Poster and Advertising Design Graphic Design: A History Barbara Mellor 19 April 2004 1 July 2004 Aboriginal Australians: First Nations of an Ancient Continent , Adam Shoemaker Originally published in English 27 September 2004 J. M. W. Turner: The Man Who Set Painting on Fire Turner: Life and Landscape Ruth Sharman 23 May 2005 22 November 2005 Einstein: Decoding the Universe Einstein: Decoding the Universe David J. Baker, Dorie B. Baker 23 May 2005 1 May 2001 Napoléon: “My Ambition Was Great” Laurel Hirsch 22 November 2005 Dada: The Revolt of Art Dada: The Revolt of Art Liz Nash 10 April 2006 1 April 2006 Egon Schiele: The Egoist Egon Schiele: The Egoist Jean-Louis Gaillemin Liz Nash 5 March 2007 1 December 2006 The Pyramids of Giza: Facts, Legends and Mysteries The Great Pyramids 3 September 2007 1 November 2007 Frida Kahlo: ‘I Paint my Reality’ Frida Kahlo: Painting Her Own Reality Christina Burrus 7 April 2008 1 April 2008 Henri Cartier-Bresson Henri Cartier-Bresson David H. Wilson 24 November 2008 1 November 2008 Marilyn: The Last Goddess 1 November 2008 == Other websites == * List of Abrams Discoveries series at Goodreads * List of New Horizons series at Publishing History Category:Lists of books Category:Encyclopedias Category:Series of books Category:Non-fiction books Category:English-language picture books",
 "title": "List of English-translated volumes of Découvertes Gallimard"
}