{
 "id": "607540",
 "text": "Real or perceived threat in the environment, produces stress response in animals, which disrupts the internal constant environment of the animal.Lovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 3-7. doi:10.1002/9780470979600.index There are different kinds of stressors that animals can be exposed to. Animals display different kinds of stress responses as a result.Lovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success. 59-74 doi:10.1002/9780470979600.index Physiological changes that happen because of stress cause behavioural responses in animals.Lovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 59-74. doi:10.1002/9780470979600.index There are different types of behavioural responses: impairment of response inhibition and lack of motivation,Mika, A., Mazur, G. J., Hoffman, A. N., Talboom, J. S., Bimonte-Nelson, H. A., Sanabria, F., & Conrad, C. D. (2012). Chronic stress impairs prefrontal cortex-dependent response inhibition and spatial working memory. Behavioral Neuroscience, 126(5), 605-619. doi:10.1037/a0029642Kleen, J. K., Sitomer, M. T., Killeen, P. R., & Conrad, C. D. (2006). Chronic stress impairs spatial memory and motivation for reward with- out disrupting motor ability and motivation to explore. Behavioral Neuroscience, 120, 842–851. doi:10.1037/0735-7044.120.4.842 changes in social,Beery, A. K., & Kaufer, D. (2015). Stress, social behavior, and resilience: Insights from rodents. Neurobiology of Stress, 1, 116-127. doi:10.1016/j.ynstr.2014.10.004 sexual,1\\. Woodgate, J. L., Bennett, A. D., Leitner, S., Catchpole, C. K., & Buchanan, K. L. (2010). Developmental stress and female mate choice behaviour in the zebra finch. Animal Behaviour, 79(6), 1381-1390. doi:10.1016/j.anbehav.2010.03.018Farrell, T.M., Neuert, M. A., Cui, A., & Macdougall-Shackleton, S. A. (2015). Developmental stress impairs a female songbirds behavioural and neural response to a sexualy selected signal. Animal Behaviour, 102, 157-167. Doi: 10.1016/j.anbehav.2015.01.018 aggressionLovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 64-65. doi:10.1002/9780470979600.index and nurtureLovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 68-69. doi:10.1002/9780470979600.indexTilgar, V., Moks, K., & Saag, P. (2011). Predator-induced stress changes parental feeding behaviour in pied flycatchers. Behavioural Ecology, 22(1), 23-28. doiL10.1093/beheco/arq164 behaviour in animals. The impact is dependent upon the type, and duration of the stress, as well as the past experiences of the animal. Behavioural responses to prolonged stress can also be transferred across generations.Debiec, J., Sullivan, R. M., & Regina, M. (2014). Intergenerational transmission of emotional trauma through amygdala-dependent mother-to-infant transfer of specific fear. Proceedings of the National Academy of Sciences, 11 (33), 12222-12227. doi: 10.1037/pnas.1316740111 == Overview == Stress responses are any responses that an organism makes or goes through, in response to a stressor. A stress in accordance to Walter Cannon (1871-1945), is any disturbance that imbalances the internal environment of an organism also known as homeostasis. There are two major types of stressors that cause stress to animals: abiotic stressors and biotic stressors.Romero, L. M., & Wingfield, J. C. (2016). Tempests, poxes, predators, and people: stress in wild animals and how they cope. Oxford: Oxford University Press. Abiotic stressors are any ecological, geological, or climatological changes, that causes stress to the animal such as increased temperatures, and natural disasters. Biotic stressors are living things-related complications that causes stress; these include dominance, pollution, infection social pressures and competition.Lovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 75-95. doi:10.1002/9780470979600.index There are different types of stress responses in an animal in response to stressors: physiological responses, behavioural responses, psychological responses, and/or physical responses. The response depends on the choice the animal makes when it is faced with danger that causes distress. Walter Canon argues that there are two possible choices that an organism may choose when stress is encountered: fight or flight responses. == Behavioural responses == There are many different types of behavioural responses to stress: * Impairment of response inhibition and lack of motivation Prolonged stress in rats causes response inhibition. Stressed rats had inhibited premature responses (decreased timing of intervals to food), along with decreased intrinsic motivation to initiate a response. The decreased motivation is linked to the stress-associated reduction in incentive motivation. Decreased motivation was also seen in a study conducted by Beery and Kaufer, where they explained that stressed rodents are less likely to be motivated to interact with one another. *Change in social behaviours Social behaviours in rodents change in response to stress. Social withdrawal and general reduction in social interaction after an exposure to a stressor are evident in rodents. This is due to the underlying physiological changes that the rodent goes through. The changes that occur to the hypothalamic-pituitary-adrenal (HPA) hormonal axis are directly related to the changes in social behaviour. Social avoidance is another consequence of stress that can be seen in rodents. Rodents are more likely to avoid dominant rats and avoid social interactions after the exposure to a stressor. * Sexual Behaviours Sexual interests change in many species when exposed to stressors. Stressed male and female rats express inhibited mating behaviour which is evident through the clear increase in the inhibitory hormone RF-amide. Masculine sexual behaviour in male rats is subject to changes in accordance to the type of stressors that the rats were subjected to. Female Zebra Finches mating choice is determined by the stressors that they are exposed to early in life, which remains consistent throughout adulthood. A study about stress effects on female songbird’s response to sexual signal for mating, indicated that the response to this specific signal can be impaired if the female is exposed to developmental stress. Behavioural changes as a result from developmental stress impairs neural responses to sexual signal, which reduces mating: *Aggressive behaviours and Anti-predator responses Stressed animals would choose to avoid a novel situation rather than confront it. Aggressive behaviour is associated with sex hormones, such as testosterone, and specific brain regions and systems such as the medial preoptic nucleus, prefrontal cortex-dependent response inhibition, and anterior hypothalamus. Stress negatively impacts sex hormones, which results in an imbalance and reduction in aggression related hormones and function. Chronic stress results in prefrontal cortex-dependent response inhibition. This results in reduction in aggression, thus promoting anti-predator responses.Lovejoy, D. A., & Barsyte, D. (2011). Index. Sex, Stress and Reproductive Success, 173-188. doi:10.1002/9780470979600.index * Prolonged stress reduces parental behaviour toward offspring Prolonged stress alters parental behaviour toward offspring and promotes parental neglect. Predation stress alters parents’ behaviours such as the reduction in provisioning rates, which negatively impacts the offspring’s performance. Oxytocin and vasopressin hormones are generally responsible for affiliative and pair-bonding behaviours in many species. Stress alters the level of both hormones resulting in abnormal behaviour from parents towards offspring. Levels of oxytocin decrease as a result of prolonged stress, which has been shown to reduce pair bonding behaviour and increase withdrawal behaviour. Prolactin is another important hormone that is associated with nurture by parents to offspring, and levels of this hormone can be altered as a result of stress. Reduced levels of prolactin as a result of stress decreases behaviours such as suckling, licking, and brooding. === Transgenerational behavioural response to stress=== Behavioural response to stress can go from parents to offspring. When an offspring observes the expression of behaviour such as fear in response to a stress stimulus, the same response would be elicited in the offspring when the stimulus is presented. Fear is transferred from mother to infant in response to a certain odour stimulus. Neural activity, such as the basal amygdala activity of the offspring’s brain, illustrated fear response. Parents’ behavioural response to stress can be transgenerational and can be proven via neural activity. == References == Category:Ethology",
 "title": "Behavioural responses to stress in animals"
}