{
 "id": "607740",
 "text": "Muhammad Mansuruddin (31 January 1904 – 19 September 1987) was a Bengali writer, literary critic, lexicographer. He is noted for his folklore collection titled \"Haramoni\". In 1987, he received doctor of literature degree from Rabindra Bharati University for his lifelong contribution to folklore collection and research. He also received second highest civilian honor Ekushey Padak and highest civilian honor Independence Day Award given by Government of Bangladesh in 1983 and 1984 respectively. ==Early life== Mansuruddin was born on 31 January 1904 in Muraripur village under Sujanagar Upazila of Pabna district of East Bengal of the British India, now in Bangladesh. His father Muhammad Jaider Ali and mother Jiarun Nisa was respected in the village. He was educated in Madhabchandra Nandi Pathshala in his village. He passed matriculation from Khalipur High School in 1921 with first division, ISc from Pabna Edward College in 1923 and IA from Rajshahi College in 1924. He graduated from Rajshahi College in 1926. Then he went to Calcutta University for post-graduation and received Master of Arts in Bangla with first class in 1928. In 1925, when he was studying at Rajshahi College, he married Sharifun Nisa. They had six sons and six daughters. ==Literary career== Mansuruddin started writing from his early age. He was inspired by his teacher Surendranath Sen. His first poem was 'Beduin Musalman'. It was published in the Edward College magazine. Samyabadi and Prachi journals published his later poems. He had interest of folklore and when he was in Rajshahi College, the Principal of the college, Kumudinikanta Banerjee, encouraged him to work on folklore. He started collecting the folklore and folk songs from 1930 and compiled those under the name of Haramoni (Lost gems). Haramoni was published in regular section of monthly literary magazine Probashi. The full book consists of 13 parts. In 1948, he published collection of songs of Lalon under the name of Lalon Fakir-er Gaan (Songs of Lalan Fakir). After that, his Lalan Geetika was published. English translation of these books were published in 1974. He wrote several biography books. Those are Iraner Kobi (Poet of Iran) (1968), biography of prophet Muhammad titled Hazrat Muhammader Jiboni O Sadhona (Life and Spirituality of Muhammad), and Hazrat Shah Waliullah and Harun Rashid. His books for children are Bokami (Foolishness) (1952), Thokami (Deception) (1958) and Mushkil Ahsan (Problem Solving) (1958). In 1957, he compiled a dictionary, Hashir Ovidhan, which includes Bengali idioms. ==Death== Mansuruddin died on 19 September 1987 in Dhaka. ==Works== * Haramoni (Lost gems) (13 parts, 1930-1989) * Shirni (1931) * Dhaner Manjari (Sheaves of Paddy) (1933) * Agarbati (Incense) (1938) * Bangla Sahitye Muslim Sadhana (Muslim Spirituality in Bengali Literature) (3parts, 1960-1966) * Iraner Kobi (Poet of Iran) (1968) ==Awards and honors== * Sir Ashutosh Mukherjee Award, Calcutta University, (1926) * Bangla Academy Award (1965) * Sher-e-Bangla National Award and Gold Medal (1980) * Muktadhara Sahitya Award (1982) * Ekushey Padak (1983) * Nasiruddin Gold Medal (1983) * Alokto Sahitya Puroshker (1983) * Independence Day Award (1984) * Kalu Shah Puroshker (1986) * Honorary D. Lit degree from Rabindra Bharati University in 1987 ==Bibliography== * Ahmed, Tofael (1983). Bangladesher Atmaar Sondhaney Sahitya Acharjya (In Search of the Soul of Bangladesh). Dhaka. * Chowdhury, Momin (1988). Muhammad Mansururddin. Dhaka. * Helal, Nasir (1999). Lekhak Ovidhan (Writers' Dictionary). Dhaka: Bangla Academy. ==References== Category:1904 births Category:1987 deaths Category:Bangla Academy Literary Award winners Category:Recipients of the Ekushey Padak Category:People from Rajshahi Division Category:Recipients of the Independence Day Award Category:Bangladeshi writers",
 "title": "Muhammad Mansuruddin"
}