{
 "id": "607967",
 "text": "Robert Bruce Clotworthy (born October 24, 1955) is an American actor. He is best known as the narrator for the History Channel series Ancient Aliens and his role as the voice of Jim Raynor in the StarCraft video game series. ==Filmography== ===Films=== Year Title Role Notes 1984 Nausicaä of the Valley of the Wind Voice, English Version 1985 Doin' Time Attorney 1986 The Check is in the Mail... Moonie 1987 Who's That Girl Lawyer 1987 He's My Girl Jeffrey 1988 My Neighbor Totoro Voice, 2005 English version 1988 Brothers in Arms 2nd Hunter 1991 Switch Bailiff 1991 V.I. Warshawski Philip Pugh 1991 Going Under Submarine Voice 1991 And You Thought Your Parents Were Weird Mike Abbott 1991 For the Boys Navy Commander, Japan 1992 Angel of Fury Currently Unknown Voice 1992 Love Field Announcer Voice 1993 Patlabor 2: The Movie Yukihito Tsuge English Version Voice 1993 Hold Please Richard Grail Short 1995 Phoenix Man #1 1996 Vampirella Professor Steinman 1998 Mulan Tai Zhencha (Long Haired Hun) Voice 1999 The Deep End of the Ocean Reporter 1999 The Iron Giant Joe the Soldier Voice 2000 The Emperor's New Groove Guards Credited as Rob Clotworthy Voice 2001 The Accidental Spy Currently Unknown Voice 2001 Ablaze Dispatcher Harris 2001 Shrek Lord Farquaad's Guards Voice 2002 One Hour Photo Eye Surgeon 2002 Gale Force Bill Cassidy 2002 The Cat Returns English version, Voice 2003 Spirit: Stallion of the Cimarron Colonel's Soldiers 2004 Shark Tale Currently Unknown Voice 2005 Racing Stripes Horse 2 Voice 2005 Tugger: The Jeep 4x4 Who Wanted to Fly Fatty / USAF Pilot Voice 2005 Crash Landing Jimmy Watkins 2006 Inside Dr. Nance 2006 Pulse Calvin 2007 Rendition Reception Guest 2008 Kung Fu Panda Kung Fu Panda Anvil Of Heaven 1 2009 Monsters vs Aliens Monsters vs Aliens Soldiers 2010 Buried CRT Spokesman Voice 2010 My Soul to Take News Anchor Voice 2011 The Green Hornet Politician 2011 From Up on Poppy Hill Umi's father Voice, English Version 2012 Chronicle Newscaster 2012 Paranormal Activity 4 Currently Unknown Voice 2014 Captain America: The Winter Soldier Fury Car Voice 2014 Paradise Man Short, Voice 2014 American Sniper VA Doctor 2016 Captain America: Civil War Newscaster Voice, Uncredited 2016 X-Men: Apocalypse Newscaster Voice, Uncredited 2017 The New Adventures of Max Higgabottom Voice 2018 The Incredibles 2 Tommy Voice 2019 Charlie's Angels Charlie Townsend Voice 2021 Red Notice Opening Narrator Voice ===Television=== Year Title Role Notes 1973 Emergency! Hamburger-Eating Teen Episode: \"Inheritance Tax\" Uncredited 1974 The Waltons Tyler Crofut Credited as Rob Clotworhy Episode: \"The Graduation\" 1974 Columbo Boodle Boy / Jonathan B. Miller Episode: \"By Dawn's Early Light\" 1974 Police Woman The Gas Jockey Credited as Rob Clotworthy Episode: \"Shoefly\" 1975 ABC Afterschool Special Clete Episode: \"The Skating Rink\" 1976 The Cheerleaders BJ's Boyfriend Television Film 1976 Black Sheep Squadron Lt. Wyatt Credited as Rob Clotworthy Episode: \"Prisoners of War\" 1977 Police Story Corvette Driver Credited as Rob Clotworthy Episode: \"Stigma\" 1978 The Rockford Files Tommy Episode: \"South by Southeast\" 1978 M*A*S*H Private Welch Episode: \"Dear Comrade\" 1979 Billy Gary Episode: \"Fathers and Sons\" 1980 Stone The Runner Episode: \"Death Run\" 1981 Death of a Centerfold: The Dorothy Stratten Story Floyd Television Film 1981 Dynasty Ty Meredith Episode: \"The Verdict\" 1982 Star of the Family Bigelow Episode: \"Pilot\" 1983 The Kid with the 200 I.Q. Currently Unknown Television Film 1983 Ghost Dancing Water Deliveryman Television Film 1983 Whiz Kids Arbus Episode: \"Candidate for Murder\" 1984 Three's Company Tony Williams / Tony 02 Episodes 1984 Shattered Vows Mark Television Film 1984 Sweet Revenge Cashier Television Film Uncredited 1984 Fatal Vision MP Sergeant 02 Episodes Television Miniseries 1985 Remington Steele Paul Stuban Episode: \"Illustrated Steele\" 1985 George Burns Comedy Week Actor Episode: \"The Dynamite Girl\" 1985 The New Leave It to Beaver Mr. Newhouse Episode: \"Wow\" 1986 The Colbys Attorney Episode: \"The Trial\" Uncredited 1986 Outlaws Mr. Harrison Episode: \"Outlaws\" 1986–1987 Falcon Crest Mark 02 Episodes 1987 Dennis the Menace Tom Television Film 1988 1st & Ten Marshall Episode: \"The Inmates Buy the Asylum\" 1989 Hunter Kevin 04 Episodes 1989 Mancuso, F.B.I. Currently Unknown Episode: \"Classified\" 1990 Matlock Prosecutor in Los Angeles Episode: \"Nowhere to Turn\" 1990 Father Dowling Mysteries Olsen Episode: \"The Showgirl Mystery\" 1990 Who's the Boss? Greg Episode: \"Parental Guidance Suggested\" 1991 True Colors Danforth 02 Episodes 1991 Murphy Brown Allen Episode: \"Hoarse Play\" 1992 Tequila and Bonetti Lloyd Episode: \"A Perfect Match\" 1992 Herman's Head Frank Episode: \"Stop Me Before I Help Again\" 1993 Doogie Howser, M.D. Dr. Bob Whitman Episode: \"The Adventures of Sherlock Holmes\" 1993 Batman: The Animated Series Billy Credited as Rob Clotworthy Episode: \"Mudslide\" 1994 Boy Meets World TV Voice Episode: \"The B-Team of Life\" 1994 Attack of the 5 Ft. 2 In. Women Voice Television Film 1995–2006 The Young and the Restless Judge Russell Jennings / Greg Hillman 43 Episodes 1996 Murphy Brown Dole Operative Episode: \"The Bus Stops Here\" 1996 Crime of the Century Reporter Television Film 1996 Melrose Place Auctioneer Episode: \"Crazy Love\" 1997 Get to the Heart: The Barbara Mandrell Story Dr. Newton Louvern Television Film 1998 The New Batman Adventures Pilot (voice) Episode: \"The Ultimate Thrill\" 1999 The Practice Medical Expert Episode: \"Oz\" 1999 The Hand Behind the Mouse: The Ub Iwerks Story Ub Iwerks Documentary Voice 2000 JAG Jim Wythrip Episode: \"The Witches of Gulfport\" 2000 The Drew Carey Show INS Inspector Episode: \"Drew and the Trail Scouts\" 2001 The West Wing Tom Episode: \"The Drop In\" 2001 Mahô shôjo neko Taruto Rakugan English Version Voice 2001 Raptor Doctor Television Film 2003 Boston Public Radio Host Episode: \"Chapter Fifty-Nine\" 2003 Miracles Steve Jones Episode: \"Hand of God\" 2003 The Practice Judge Tyler Flynn Episode: \"Cause of Action\" 2004 Phil of the Future Dr. Gennaro Episode: \"Daddy Dearest\" 2004 NYPD Blue Roger Episode: \"Bale Out\" 2004 Empire of Dreams: The Story of the Star Wars Trilogy Narrator Video Documentary 2005 Hercules Narrator 02 Episodes 2005–2010 Medium News Reporter / Ripley's Believe It or Not Announcer / Bradley Campaign Ad Announcer 03 Episodes Uncredited 2006 That '70s Show Customer Episode: \"My Fairy King\" 2006 Criminal Minds Don Norvell Episode: \"Aftermath\" 2006 The Water is Wide Narrator Television Film 2006–2012 Two and a Half Men Gangster #1 / Pilot / TV Commercial Announcer / TV Commercial Narrator / TV Announcer 11 Episodes 2007 The Riches Clay Wilkes Episode: \"Believe the Lie\" 2007 Boston Legal Zachary West Episode: \"Beauty and the Beast\" 2007 Bone Eater Jimmy Winger Television Film 2007 Judy's Got a Gun Roger Yeager Television Film 2007 Real Premonitions Narrator Television Documentary 2007 Star Wars: The Legacy Revealed Narrator Television Documentary 2007–2008 Days of Our Lives Dean Randall Lochlan 03 Episodes 2008 The Batman Arkham Asylum Warden (voice) Credited as Rob Clotworthy Episode: \"What Goes Up...\" 2008 Indiana Jones and the Ultimate Quest Narrator Television Documentary 2008 Batman Unmasked Narrator Television Documentary 2008 Valkyrie: The Plot to Kill Hitler Narrator Television Documentary 2008–2015 The Big Bang Theory Astronaut, Announcer, Dave Roeger, Headmaster Edwards, Train Conductor Recurring role 2009–2020 Ancient Aliens Narrator 190 Episodes 2010 Sonny with a Chance Dr. Spector Episode: \"Walk a Mile in My Pants\" 2010 Batman: Under the Red Hood Leo / Thug Television Film 2010 All My Children Minister Episode: \"#1.10431\" 2011 Big Love Elder Mccrackle Episode: \"The Special Relationship\" 2011 The Defenders Bennett Perkins Episode: \"Nevada v. Hunter\" 2011 Eagleheart Stan Episode: \"Chris, Susie, Brett and Malice\" 2011 The Mentalist Pulaski Episode: \"Blood for Blood\" 2012 The Mentalist Rudolph Pulaski Episode: \"At First Blush\" 2012 Diagnosis: Dead or Alive Kurt Episode: \"Jamie & David\" 2013 Broken Quest Adventure Master Episode: \"The Adventure Master\" 2013 China, IL Carabas, Kevin Costner (voices) 02 Episodes 2014 Falling Skies The Monk 03 Episodes 2014 Sinkholes: Swallowed Alive Narrator Television Documentary 2014 Cesar Millan: Love My Pit Bull Narrator Television Documentary 2014 We the Economy: 20 Short Films You Can't Afford to Miss Narrator Television Documentary 2014–present The Curse of Oak Island Narrator 111 Episodes 2015 Beautiful & Twisted Senior Bank Manager Television Film 2015 Switched at Birth Professor Epstein Episode: \"The Player's Choice\" 2015 Blood and Glory: The Civil War in Color Narrator Television Miniseries Documentary 2016 Better Call Saul Spokesperson - Davis & Main TV Commercial 02 Episodes 2016 Ultimate Spider-Man Captain George Stacy (voice) Episode: \"Return to the Spider-Verse: Part 4\" 2017 We Bare Bears Warren (voice) Episode: \"Neighbors\" 2017 Groomzilla Ed Rydell Television Film 2018–2019 The Curse of Civil War Gold Narrator 16 Episodes 2019 Vanished Narrator Television Film 2019 Young Sheldon Mayor Harrison Episode: \"A Political Campaign and a Candy Land Cheater\" 2020 Homeland Judge Episode: \"The English Teacher\" 2020–present The Secret of Skinwalker Ranch Narrator 44 Episodes 2023 Pluto Johannsen (English version, voice) 2 Episodes ===Video games=== Year Title Role Notes 1998 StarCraft Jim Raynor Voice 1998 StarCraft: Brood War Jim Raynor Voice 2004 EverQuest II Generic Male Erudite Merchant, Generic Male Dark Elf Merchant, Generic Male High Elf Merchant, Generic Male Half Elf Merchant Voice 2005 Advent Rising Currently Unknown Voice 2005 Need for Speed: Most Wanted Primary Officer #1 Voice 2005 Kingdom Hearts II Currently Unknown English Version Voice 2006 The Da Vinci Code Dr. Robert Langdon Voice 2006 Need for Speed: Carbon Primary Officer Voice 2007 Kingdom Hearts II Final Mix+ Currently Unknown English Version Voice 2007 Lair Loden Voice 2007 The Darkness Frances Fox, Leslie Hound, Daniel Fears Voice 2009 Red Faction: Guerrilla Currently Unknown Voice Uncredited 2009 Marvel: Ultimate Alliance 2 Mister Fantastic Voice 2010 Dead to Rights: Retribution Inness, Brawlers Voice 2010 Alpha Protocol Albatross Voice 2010 Crackdown 2 Currently Unknown Voice 2010 StarCraft II: Wings of Liberty Jim Raynor Voice 2011 TERA: The Exiled Realm of Arborea Castanic, Human, Elf Voice 2011 Star Wars: The Old Republic Supreme Chancellor Janarus, Senator Evran, Master Rajivari, Blaesus, Colonel Deulo, Colonel Finley, Gizmel, Major Jazen, Master Rubatin, Officer Silas, Sor-Nak, Taxi Droid Voice 2012 Hitman: Absolution Currently Unknown Voice 2013 StarCraft II: Heart of the Swarm Jim Raynor Voice 2013 Star Wars: The Old Republic: Rise of the Hutt Cartel The Shroud Voice 2013 Marvel Heroes Vulture Voice Uncredited 2013 The Bureau: XCOM Declassified Voice 2013 Grand Theft Auto V The Local Population Voice 2014 The Lego Movie Videogame Voice 2014 Star Wars: The Old Republic: Shadow of Revan The Shroud Voice 2015 Xenoblade Chronicles X Additional voices Voice, English Version 2015 Star Wars: The Old Republic: Knights of the Fallen Empire The Shroud / Mandalorian Warrior Voice 2015 Heroes of the Storm Jim Raynor Voice 2015 StarCraft II: Legacy of the Void Jim Raynor Voice 2016 Batman: The Telltale Series Jack Ryder, Commissioner Grogan, Enforcer 4 Voice 2016 Mafia III Voice 2016 Final Fantasy XV Voice, English Version Uncredited 2016 Star Wars: The Old Republic: Knights of the Eternal Throne Captain Frem, GenoHaradan Leader, Zakuulan Socialite Voice 2017 Fire Emblem Heroes The Black Knight, Finn English Version 2017 Final Fantasy XV: Episode Gladiolus Additional Voices English Version 2017 Batman: The Enemy Within Jack Ryder, Agent Mario Hernandez, Mourner, Newscaster 1 Voice 2018 Lego The Incredibles Currently Unknown Voice 2018 Super Smash Bros. Ultimate Black Knight English Version 2019 Star Wars: The Old Republic: Onslaught Voice 2020 The Last of Us Part II Seth 2022 Fire Emblem Warriors: Three Hopes Count Hevring English Version ==References== ==Other websites== * *Clotworthy's official website *Twitter *Clotworthy's Facebook Category:Living people Category:1955 births Category:American movie actors Category:American television actors Category:American television presenters Category:American voice actors Category:American video game actors Category:Actors from Los Angeles",
 "title": "Robert Clotworthy"
}