{
 "id": "608188",
 "text": "Zahir Raihan (; 19 August 1935 – 30 January 1972) was a Bangladeshi writer and movie director. His first novel was Shesh Bikeler Meye, published in 1960. His other notable novels are Hajar Bachhar Dhore, and Arek Phalgun. He is best known for his documentary Stop Genocide, made during the Bangladesh Liberation War. His popular movies are was Behula, Sangam, and Jibon Theke Nea. For his contribution in Bengali literature, he was awarded Bangla Academy Literary Award in 1972 and posthumously received highest civilian honour given by Government of Bangladesh, Independence Day Award, in 1999. He received Nigar Award for directing Kancher Deyal in 1964 and posthumously National Film Awards for his overall contribution in Bangladeshi movie in 1975 and for best story and dialogue in 2005. He also awarded second highest civilian honour given by Government of Bangladesh, Ekushey Padak in 1977 for his contribution in movie. ==Life and works== ===Early life=== Zahir Raihan was born on 19 August 1935 in the village Majupur, Feni District, Bengal Presidency, British India (present-day Bangladesh). His birth name was Mohammad Zahirullah. He studied in Mitra Institute, Kolkata and in Alia Madrasha there. After the Partition of Bengal in 1947, he, along with his parents, came back to his village from Calcutta. In 1950, Raihan passed his matriculation from Amirabad High School, Feni. Then he passed ISC from Jagannath College, Dhaka in 1953. He received Bachelor of Arts in 1956 and Master of Arts in 1958 in Bengali literature from University of Dhaka. ===Early career=== Raihan started his career as journalist in 1950. He joined the newspaper \"Juger Alo\". Then he worked for the newspapers, such as, Khapchhara, Jantrik and Cinema. He was editor of Probaho in 1956. In 1955, his first short stories collection, Suryagrahan was published. He worked as an assistant of director A J Kardar in the movie Jago Hua Sabera in 1957. He then worked as an assistant of Salahuddin in the movie Je Nodi Morupothey and Ehtesham in the movie Ae Desh Tomar Amar. He also wrote songs for Ae Desh Tomar Amar. ===Directorial debut and Marriage=== Raihan had his directorial debut in the movie Kokhono Asheni. This movie was made in 1960 and released in 1961. He married his first wife Sumita Devi that year. Sumita and he had two son, Bipul Raihan and Anol Raihan. In 1962, Raihan, along with Kalim Sharafi, directed the movie Sonar Kajol. He wrote, produced and directed musical drama movie Kancher Deyal in 1963 and received Nigar Award for best direction for this movie. His most acclaimed novel Hajar Bachhar Dhore was published in 1964, for which he received Adamjee Literature Award. He made Pakistan's first colour movie, Sangam that year, both written and produced by him. He made his first CinemaScope movie, Bahana, in 1965. ===Commercial success and Second Marriage=== His first commercially successful movie was Behula (1966). This movie was made based on a popular folktale, starring Suchonda and Abdur Razzak. After the success of the movie, he made Anwara (1967) with this pair, based on a novel of Mohammad Nazibur Rahman. This was also commercially hit. In 1968, he married his lead actress Suchonda. Together they had one son Topu Raihan. In 1968, he wrote and produced Dui Bhai, and produced Shuorani Duorani, Shesh Porjonto and Moner Moto Bou. ===Critical acclaim=== In 1970, Raihan wrote, produced and directed political satire drama movie Jibon Theke Neya. This movie centers around a family where most of the family members are oppressed by woman controlling the family, which is the metaphor of tyranny of mass uprising in 1969 in then East Pakistan. During the Liberation war of Bangladesh in 1971, Raihan went to Calcutta and showed his movie Jibon Theke Neya in Calcutta. Renowned movie directors of Kolkata Satyajit Ray, Mrinal Sen, Tapan Sinha and Ritwik Ghatak praised him for this movie. He was general secretary of Bangladesh Liberation Council of Intelligentsia during liberation war and was making Let There Be Ligth. He left the project and made Stop Genocide, a documentary on the oppression of Pakistani army over Bengali people. This documentary was supported by Indian friends of Bangladesh. Acting Prime Minister of exiled government Tajuddin Ahmed found the importance of the documentary. Indian Prime Minister Indira Gandhi was touched seeing this and ordered movie division of India to buy and circulate it internationally. That year, he also produced and directed A State Is Born and produced Liberation Fighters, directed by Alamgir Kabir, and Innocent Millions, directed by Babul Choudhury. His final movie was in Urdu language Jalte Suraj Ke Niche (1971). ===Disappearance=== Raihan was not found from 30 January 1972. He went out from his house to find his brother Shahidullah Kaiser, whom Pakistan army along with local collaborators captured and killed during last days the liberation war of Bangladesh. His family believed that armed Bihari collaborators and soldiers of Pakistan army who were hiding in Mirpur fired on the people who went there to find their men. ==Books== ===Novels=== * Sesh Bikeler Meye (A Girl in the Late-Afternoon, 1960) * Trishna (Thirst, 1962) * Hajar Bochhor Dhore (For Thousand Years, 1964) * Arek Falgun (Different Spring, 1969) * Borof Gola Nodi (River of Melted Ice, 1970) * Ar Koto Din (How Many More Days, 1970) * Ekushey February (21 February, 1970) * Koekti Mrittu (A Few Deaths) ===Short stories=== * Sonar horin (The golden deer) * Somoyer proyojone (For the need of time) * Ekti jiggasa (One question) * Harano boloy (The lost ring) * Badh (The protest) * Surjagrohon (The Solar Eclipse) * Noya potton (The new foundation) * Mohamrittu (The great death) * Vangachora (The broken) * Oporadh (The crime) * Shikriti (The congratulations) * Oti porichito (Very familiar) * Ichha onichha (Wish or no wish) * Jonmantor * Poster * Ichhar agune jolchhi (Burnt in the fire of wish) * Kotogulo kukurer artonad (Bark of some dogs) * Koekti songlap (Some dialogues) * Demag (Pride) * Massacre * Ekusher golpo (Story of 21 February) ==Filmography== ===Movies and Documentaries Directed=== * Kokhono Asheni, 1961 (his first film as director) * Sonar Kajol, 1962 (jointly directed with Kolim Sharafi) * Kancher Deyal, 1963 * Sangam, 1964 (the first colour film made in Pakistan) * Bahana, 1965 * Behula, 1966 * Anowara, 1966 * Jibon Theke Neya, 1970 * Let There Be Light * Jalte Suraj Ke Niche 1971 ===Documentaries=== * Stop Genocide, Documentary on the genocide by Pakistani Army in the Bangladesh Liberation War, 1971 * A State is Born * Liberation Fighters (Production) * Innocent Millions (Production) ===Movies Produced=== Followings movies were produced by Raihan and directed by his assistants * Dui Bhai, 1968 * Shuorani Duorani, 1968 * Bairagi, 1967 ==Awards and honours== * 1964: Adamjee Literature Award for Hajar Bachhar Dhore (novel) * 1964: Nigar Award for Kancher Deyal * 1972: Bangla Academy Literary Award in novels. * 1977: Ekushey Padak in arts (movie) * 1992: Independence Day Award in literature * National Film Awards ** 1975: Special awards (posthumous) ** 2005: Best story and dialogue for Hajar Bachhar Dhore (movie) (posthumous) ==Related pages== *List of people who disappeared mysteriously: 1910–1990 ==References== ==Other websites== * * Zahir Raihan at the Banglapedia Category:1935 births Category:1972 deaths Category:2020 deaths Category:Bangladeshi movie directors Category:Asian novelists Category:Missing people Category:Writers from Dhaka Category:Bangla Academy Literary Award winners Category:Recipients of the Ekushey Padak Category:Bangladeshi Muslims Category:Recipients of the Independence Day Award Category:Recipients of Bangladesh National Film Awards Category:People from Chittagong Division",
 "title": "Zahir Raihan"
}