{
 "id": "60829",
 "text": "Joseph Priestley (13 March 1733 – 8 February 1804) was an English chemist, philosopher, clergyman, and teacher. He is known as the discoverer of oxygen. Antoine Lavoisier and Carl Wilhelm Scheele Carl Wilhelm Scheele also have a claim to the discovery of oxygen. See Kuhn, Thomas. (1996). The Structure of Scientific Revolutions, pp. 53–60. He was a Unitarian. On 1 August 1774, Priestly identified oxygen in his laboratory at Bowood House in Wiltshire, England.American Chemical Society (ACS), \"Joseph Priestley: Discoverer of Oxygen\"; retrieved 2012-5-23. == The Priestley Riots == The Priestley Riots (or the Birmingham Riots of 1791) took place from 14 July to 17 July 1791 in Birmingham, England. The rioters' main targets were religious dissenters, led by Priestley. Both local and national issues stirred the rioters. But at the heart was the Dissenters' attempts to gain full civil rights, and their support of the French Revolution (though not its methods). The riots started with an attack on the Royal Hotel, Birmingham. There a banquet was organised in sympathy with the French Revolution. Then, beginning with Priestley's church and home, the rioters attacked or burned four Dissenting chapels, twenty-seven houses, and several businesses. Many of them were drunk. They had found liquor while looting, or with which they were bribed. A small core could not be bribed, however, and stayed sober. The rioters burned not only the homes and chapels of the Dissenters, but also the homes of people they associated with Dissenters, such as members of the scientific Lunar Society.Rose R.B. 1960. The Priestley Riots of 1791. Past and Present 18 1960: 68–88.Schofield, Robert E. 2004. The Enlightened Joseph Priestley: a study of his life and work from 1773 to 1804. University Park: Pennsylvania State University Press. ISBN 0-271-02459-3 ==References== == Other websites == * The Priestley Society *A short biography at the Woodrow Wilson National Fellowship Foundation *Memorial essay (1874) on Priestley Category:1733 births Category:1804 deaths Category:Unitarians Category:English chemists Category:English philosophers Category:Members of the Lunar Society",
 "title": "Joseph Priestley"
}