{
 "id": "608333",
 "text": "Robert Alan Durst (April 12, 1943 - January 10, 2022) was an American real estate businessman, convicted murderer and possible serial killer. He was the son of New York City mogul Seymour Durst, and the elder brother of Douglas Durst, head of the Durst Organization. His crime allegations and trial were covered in the HBO miniseries The Jinx. ==Criminal charges== Durst was suspected of foul play against three individuals in different states: Kathleen McCormack Durst, his first wife, who disappeared in New York in 1982; Susan Berman, his longtime friend, who was murdered in California in 2000; and his neighbor, Morris Black, who was killed in Texas in 2001. Durst was the subject of a multi-state manhunt and was convicted of dismembering Black, but acquitted of his murder. On March 14, 2015, Durst was arrested in New Orleans, Louisiana, on a first-degree murder warrant signed by a Los Angeles judge in relation to the Berman killing. On November 4, 2016, Durst was transferred to California and soon after was arraigned in Los Angeles on first-degree murder charges. On September 17, 2021, the jury convicted Durst of first degree murder in the death of Susan Berman. ==Death== On October 16, 2021, Durst tested positive for COVID-19 and was placed on a ventilator. He died on January 10, 2022 from cardiac arrest at a medical center in French Camp, California at the age of 78.Robert Durst dies in custody His health got worse after getting COVID in October and he also had bladder cancer.Robert Durst, NY real estate heir and convicted killer, dead at 78 ==Related pages== *List of people who disappeared mysteriously: 1910–1990 ==References== ==Other websites== * * Mugshots: Robert Durst at Snagfilms Category:1943 births Category:2022 deaths Category:Real estate developers Category:People acquitted of murder Category:Businesspeople from New York City Category:Criminals from New York City Category:American people convicted of murder Category:American serial killers Category:Deaths from the COVID-19 pandemic in California Category:Deaths from cardiac arrest Category:People who died in prison custody in the United States",
 "title": "Robert Durst"
}