{
 "id": "60835",
 "text": "Vincent Kennedy McMahon, better known as Vince McMahon or Mr. McMahon (born August 24, 1945) is an American businessman, wrestling promoter, professional wrestler, and movie producer. He is the co-founder of modern WWE. McMahon had been a one-time ECW World Champion, one-time WWE Champion, and was the winner of the Royal Rumble in 1999. Forbes estimates his net worth to be around $2.5 billion. ==Career== McMahon started his wrestling career in 1971 as an announcer. He worked for the \"World Wide Wrestling Federation\" (WWWF) which later changed its name to \"World Wrestling Federation\" (WWF). The name was changed again to World Wrestling Entertainment (WWE). The company was originally owned by his father, Vincent J. McMahon. McMahon bought the company from his father in 1984. McMahon took the business from a local promotion in the north eastern part of the United States and made it a global company. McMahon played the role of an evil boss for many years. In June 2022, McMahon stepped down as the chairman and CEO of WWE. This came after multiple reports of McMahon paying alleged hush-money agreements for many alleged affairs. He would return to the company as executive chairman in January 2023. On January 26, 2024, McMahon would again step down from WWE and TKO after reports from the The Wall Street Journal about a lawsuit. It would allege that McMahon participated in sex trafficking and commited sexual assaults on a former employee. == Personal life == McMahon married his wife, Linda McMahon, on August 26, 1966 in New Bern, North Carolina. They separated sometime before 2022 but have not gotten divorced. They have two children: Shane and Stephanie. In 2016, President-elect of the United States Donald Trump nominated McMahon's wife Linda as Administrator of the Small Business Administration. === Federal sexual assault and trafficking investigation === On February 2, 2024, The Wall Street Journal reported that federal authorities in New York had launched an investigation into sexual assault and sex trafficking allegations made against McMahon. Federal agents had previously executed a search warrant for McMahon's phone and delivered a subpoena to him for documents related to any allegation of \"rape, sex trafficking, sexual assault, commercial sex transaction, harassment or discrimination\" against current or former WWE employees. ==References== == Other websites == * WWE Corporate Bio Category:1945 births Category:Living people Category:American professional wrestlers Category:Businesspeople from North Carolina Category:Professional wrestling announcers Category:Professional wrestling authority figures Category:Sportspeople from North Carolina Category:WWE executives Category:WWE people",
 "title": "Vince McMahon"
}