{
 "id": "608581",
 "text": "Walid Mostafa (Walid Hassan Mostafa) is one of the Egyptian Businessmen in the field of media, One of his contribution on media field is NRJ EGYPT radio broadcast. The international NRJ in Egypt(One of the first French broadcasts broadcasting in Arabic). Walid Mostafa has also contributed to the publishing of Youm7 Newspaper in 2007, and then Al-Nahar television channel in 2011, He works in the field of visual, audible, and readable media, marketing and advertising. Walid Mostafa is a member of the Egyptian Junior Business Association EJB and the International Advertising Association IAA. He is also a member of the Egyptian Public Relation Association EPRA and the Journalist Association as well as being a member of the Syndicate of Pharmacists. ==Early life== Walid Mostafa was born on January 15, 1972 in Giza, Egypt. He started schooling in Dar-Altefl Dar-Altarbya Primary and preparatory school until he was in first year in high school when he was chosen to study abroad along with other 20 students in a student exchange program between Egypt and the United States of America. He moved in the last two years of high school to Benjamin High School – Florida – the U.S. Walid Mostafa graduated from the faculty of pharmacy – Cairo University and then was accredited a DPS - Diploma in Professional Studies from the American University in Cairo AUC. ==Personal life== Walid Hassan Mostafa is the only son of Mr. Hassan Mostafa who was a general manager of the Presidency of the Republic National Councils. Walid Mostafa is a father of two daughters, Amina from his first wife, and TalaWelcome to the world our precious Angel Carole Samaha on Twitter from his current wife, the Lebanese singer Carole Samaha whom he married in Cyprus in 2013 ==Career== *He is the Chairman of Sky Media Production NRJ which is considered a new form of radio broadcasting in Egypt that Interested in youth,it's plan and target that made it have young men and women on sight as its one and only target, searching for what they care about and what occupies them, and work on it. Not only through its program but also through its due care that such content gets to the youth through the youth,NRJ Egypt is the Arabic copy of NRJ International radio station. it was launched officially in Egypt, and it is one of the editions a radio network with the same name in Europe and twenty other countries around the world. It is originated from the French radio station, it's careful to present Arabic, English, and French programs for its audience and most important news and trends as well. *In 2011, he established Trenta Media Production , owner of Al-Nahar television channels. He established the managing headquarters and the studios of Al-Nahar television network and he formed the board of directors and contributors.He was responsible for discussing the television show's plan proposed by the board of directors, as well as having a media teamwork with absolute accuracy so as to pertain most adequate shows, as well as organizing the network media plan in coordination with the company media agent. then Al-Nahar general channel was awarded second place in Ramadan 2011 according to the results of TNS and ninth place according to IPSOS –YouTube Channel. Al-Nahar drama channel as well, according to the results of IPSOS, had very developed position regarding viewing rates. Al-Nahar channel had exclusively covered many political, sports, and arts events .He also put a strategy and vision for the company expansion and now it has five channels and rated third according to the latest study of IPSOS in January 2014. *He was the Chairman, managing director, and shareholder partner of the Egyptian Company for Journalism, Publishing, and Advertising Al-Youm El-Sabea Youm7 Editor-in-Chief khaled salah newspaper from 2007 to 2013,Al-Youm El-Sabea became a media foundation including the website, the printed edition, and all other editions and media forms. Al-Youm El-Sabea became a foundation establishment with assets in other media forms concerning the mass media production companies and television. It became a foundation construct that guarantees the effectiveness of the management, the spread, distribution, and marketing of both the newspaper and the website. Al-Youm El-Sabea was awarded the Forbes award for two consecutive years as most important Arab website.He also contributed in expanding computerized specialized sub-editions of Al-Youm El-Sabea, as well as expanding the internet services in general to more than just newsletter, expanding newsletter services from Youm7 on smartphones (Vodafone – Orange (former Mobinil) – Etisalat Misr. As well as opening mutual collaboration between the Arab and international telecom companies through its computerized services in countries like Saudi Arabia, United Arab Emirates, and others, which made a leap in Youm7, which came among the top three in independent printed journalism market. then the newspaper won the Forbes Middle East award for two consecutive years 2010 and 2011 as one of the best and most important Arabic website in the Arab ==another position== * Managing director and contributing partner in Nile PR Company from 2000 to 2011 when He worked in production management and a partner in producing many television shows and drama series such as the T.V series Adam in 2007 with tamer hosny. *Managing director and contributing partner in High Class Media and Elite magazine from 2000 to 2011 * Director of Sales and Marketing in Promoters Company For Publicity and Advertising from 1998 to 2000 * Marketing manager in the Arab Egyptian Studios Company Platouh from 1996 to 1998. * marketing manager assistant in the Grand Pyramids Hotel (Meridiana Pyramids now). first he as a receptionist and then he worked in marketing management as a marketing manager assistant until the end of his hotel career in 1994 as a front-office manager assistant. He contributed to establishing the marketing and advertising plan of the hotel with the international management of the hotel and helped applying it in Egypt, with the direct contact with customers as one of his hotel assignments in order to solve any problems that face them, in addition to dealing with travel agencies and tour operators. * Strategist researcher that is responsible for gathering information to insure that a communication program delivers a convincing message to the targeted audience through effective media in order to accomplish targets. ==Related pages== * youm7 * Carole Samaha ==References== Category:Living people Category:Arab people Category:Egyptian businesspeople Category:1972 births Category:People from Cairo Category:Pharmacists",
 "title": "Walid Mostafa"
}