{
 "id": "609099",
 "text": "Meghan, Duchess of Sussex (; born Rachel Meghan Markle; August 4, 1981), sometimes called Meghan Sussex, is an American member of the British Royal Family (through her marriage to Prince Harry) and former actress, model and humanitarian. ==Early life== Meghan was born at West Park Hospital in Canoga Park, Los Angeles, California. She grew up in the View Park-Windsor Hills and Hollywood neighborhoods of Los Angeles County. Her father is of a Dutch and Irish background and her mother is African American. She was married to producer Trevor Engelson from 2011 to 2013. == Film career == Starting her acting career in 2011, she played Rachel Zane in the legal drama series Suits. She had the role of Amy Jessup in the Fox science fiction-drama Fringe. ==Marriage to Prince Harry== Meghan began dating Prince Harry of Wales in June 2016. They became engaged in November 2017. In preparation for the wedding, the Archbishop of Canterbury, Justin Welby, baptised Markle and confirmed her into the Church of England on March 6, 2018. The couple married at St George's Chapel, Windsor Castle on May 19, 2018. After their wedding, they became the Duke and Duchess of Sussex. In October 2018, it was announced that the Duchess was pregnant with the couple's first child. The baby, Archie Harrison Mountbatten-Windsor, was born on May 6, 2019. === Leaving the royal family === In January 2020, Meghan and Harry announced that they would no longer take on royal duties and were stepping down from their roles. In November 2020, the Duchess revealed in an opinion piece for The New York Times that she suffered a miscarriage in July of that year. In March 2021, Meghan and Harry were interviewed by Oprah Winfrey about their struggles of being in the royal family. This interview was controversial because the couple spoke about their mistreatment by certain members of the family (who were not named) and by people working for the monarchy. On 4 June 2021, the couple's daughter Lilibet Diana Mountbatten-Windsor was born in Santa Barbara, California. Harry and Meghan have also made a television series named Harry & Meghan which documented their time in the royal family. == Titles and Honor == * 19 May 2018 Her Royal Highness The Duchess of Sussex * In Scotland: Her Royal Highness The Countess of Dumbarton * In Northern Ireland: Baroness of Kilkeel * Recipient of the Queen Elizabeth II Platinum Jubilee Medal (6 February 2022) ==References== ==Other websites== * Category:1981 births Category:Living people Category:Actors from Los Angeles Category:American movie actors Category:American television actors Category:Humanitarians Category:Models from Los Angeles",
 "title": "Meghan, Duchess of Sussex"
}