{
 "id": "609012",
 "text": "Brandon Sanderson (born December 19, 1975) is an American fantasy and science fiction writer. He is best known for the Cosmere universe, where most of his fantasy books are set; and for finishing Robert Jordan's fantasy series The Wheel of Time. Sanderson was raised in Lincoln, Nebraska. He studied at Brigham Young University, where he received degrees in English literature and creative writing. In 2008, Sanderson started a podcast with author Dan Wells and cartoonist Howard Tayler called Writing Excuses with topics about creating and producing genre writing and webcomics. In 2016, the American media company DMG Entertainment bought the movie rights to Sanderson's entire Cosmere universe. ==Life and career== Brandon Sanderson was born on December 19, 1975, in Lincoln, Nebraska. As a teenager, he loved reading high fantasy novels and tried writing his own stories. After graduating from high school in 1994, he enrolled at Brigham Young University (BYU) as a biochemistry major. He took a two-year leave of absence from 1995 to 1997 to work as a missionary for the Church of Jesus Christ of Latter-day Saints, and was assigned to serve in South Korea. After completing his missionary work, Sanderson returned to BYU and changed his major to English literature. While an undergraduate, Sanderson took a job as a night desk clerk at a local hotel in Provo, Utah, because it allowed him to write while working. After earning a B.A. in English, Sanderson entered BYU's creative writing graduate program and received an M.F.A. degree in 2005. During his graduate work at BYU, Sanderson was on the staff of Leading Edge, a semi-professional speculative fiction magazine published by the university. Sanderson wrote regularly throughout his undergraduate and graduate studies, and by 2003 he had written twelve novels, all unpublished. While in the middle of a graduate program at BYU, Tor Books editor Moshe Feder contacted him to say that he wanted to get one of his books. Sanderson had sent the manuscript of his sixth novel, Elantris, a year and a half earlier. Elantris was published by Tor Books on April 21, 2005, to generally positive reviews. This was followed in 2006 by Mistborn: The Final Empire, the first book in his Mistborn fantasy trilogy. In 2006, Sanderson married Emily Bushman. She was also an English major and teacher. She became his business manager. They have three children and live in American Fork, Utah. == References == Category:Writers from Nebraska Category:1975 births Category:Living people Category:People from Lincoln, Nebraska Category:American science fiction writers",
 "title": "Brandon Sanderson"
}