{
 "id": "609198",
 "text": "A unit load device, or ULD, (ULD) is a pallet or a container. It is used to load luggage, freight, and mail on wide-body aircraft and specific narrow-body aircraft. It allows a large quantity of cargo to be bundled into a single unit. As with other cargo transport, this leads to fewer units to load, it saves ground crews time and effort and helps prevent delayed flights. Each ULD has its own packing list (or manifest) so that its contents can be tracked. ==Types== There are two kinds of unit load devices: pallets and boxes. The boxes are similar to shipping containers: they are mostly made with metal (usually aluminum) and have standard attachment points that let them be moved easily. The pallets are usually metal with sides that attach to a cargo net. Below is a table of sizes of ULDs. The volume listed is the internal volume, the size of the inside of the container. Volume indicated is internal volume. Container type Volume Dimensions (base width / overall width × depth × height) Remarks LD1\"747-400/-400ER, Airplane Characteristics for Airport Planning\", Section 2, Boeing, May 2011. 156 / 234 × 153 × 163 cm (61.5 / 92 × 60.4 × 64 in) contoured, half width LD2\"767-200/200ER/300/300ER/300 Freighter/400ER, Airplane Characteristics for Airport Planning\", Section 2, Boeing, May 2011. 119 / 156 × 153 × 163 cm (47 / 61.5 × 60.4 × 64 in) contoured, half width LD3 156 / 201 × 153 × 163 cm (61.5 / 79 × 60.4 × 64 in) contoured, half width, dimension according to IATA LD3-45 156 / 244 × 153 × 114.3 cm (61.5 / 96 × 60.4 × 45 in) double contoured, full width, dimension according to IATA; for loading on Airbus A320 family LD6 318 / 407 × 153 × 163 cm (125 / 160 × 60.4 × 64 in) contoured, full width, equivalent to 2 LD3s LD8 244 / 318 × 153 × 163 cm (96 / 125 × 60.4 × 64 in) contoured, full width, equivalent to 2 LD2s; DQF- prefix LD11 318 × 153 × 163 cm (125 × 60.4 × 64 in) same as LD-6 but without contours; rectangular Pallet type Volume Linear dimensions Remarks LD8 153 × 244 cm (60 × 96 in) same floor dimensions as container variant; FQA-prefix LD11 153 × 318 cm (60.4 × 125 in) same floor dimensions as container variant; FLA- and PLA- prefixes LD7 (2 pallet variants) 224 × 318 cm (88 × 125 in) 244 × 318 cm (96 × 125 in) PAG- and P1P-prefixes PMC- and P6P-prefixes ==References== ==Other websites== Category:Aviation infrastructure Category:Containers",
 "title": "Unit load device"
}