{
 "id": "609338",
 "text": "Ranbir Raj Kapoor (14 December 1924 – 2 June 1988) was an Indian movie actor, producer and director. Kapoor is thought of as one of the greatest and most influential actors and moviemakers in the history of Indian cinema. Kapoor won many awards. These include 3 National Film Awards and 11 Filmfare Awards in India. He was nominated twice for the Palme d'Or grand prize at the Cannes Film Festival. His performance in Awaara was named one of the top ten greatest performances of all time by Time magazine. His movies were popular worldwide, particularly in Asia and Europe. He was called \"the Clark Gable of the Indian film industry\". The Government of India honoured him with the Padma Bhushan in 1971. ==Early life== Kapoor was born in 1924 to Prithviraj Kapoor and Ramsarni Devi Kapoor. The Kapoor family is well known for their acting and directing in India. Kapoor's father, brothers, children and grandchildren have had success as actors or producers. Kapoor acted in his first movie when he was only 10 years old. ==Career== Kapoor was the lead actor for the first time in Neel Kamal (1947). His co-star was Madhubala. In 1947, he started his own movie company, R. K. Films. At 24 years old, he directed his first movie Aag. His co-star was Nargis. He and Nargis worked together in 16 movies, 6 of these were produced by Kapoor. His first major success as an actor was in the movie Andaz directed by Mehboob Khan. Andaz was the second-highest earning movie in 1949. The highest earning movie that year was Barsaat, also starring Kapoor. He went on to produce and star in several hit movies made by his company including Awaara (1951), Shree 420 (1955), and Jagte Raho (1956). His movie Jis Desh Men Ganga Behti Hai, directed by Radhu Karmakar, won Filmfare Award for Best Film. Kapoor also won the Filmfare Award for Best Actor for the movie. The romantic musical movie Sangam was his first movie in colour. In 1970, he produced, directed and starred in his movie Mera Naam Joker. The movie took more than six years to complete but it did not earn very much money. Later in 1973, his movie Bobby became the highest earning movie of the year and the second highest earning movie of the 1970s at the Indian box office. The movie was the first lead role for Kapoor's son, Rishi Kapoor. Later movies produced and directed by Kapoor focused on the female lead character. The movie Prem Rog (1982) with Padmini Kolhapure won the Filmfare Award for Best Director. == Filmography == ==References== ==Other websites== * Category:1924 births Category:1988 deaths Category:Indian movie actors Category:Indian movie directors Category:Indian movie producers Category:Actors from Mumbai",
 "title": "Raj Kapoor"
}