{
 "id": "609619",
 "text": "Ethereum is a system on the Internet where people can make deals. Ether is type of money which uses the Ethereum system to make sure that every person gets the right amount in every deal.Ethereum: market capitalization, volume. CNBC International Ethereum was proposed in late 2013 by Vitalik Buterin, a cryptocurrency researcher and programmer. Many people donated money to support the development of the system in what was one of the first initial coin offerings. The system came online on 30 July 2015, with 72 million coins. In 2016, Ethereum split into two separate versions: Ethereum and Ethereum Classic. Ethereum has started implementing a series of upgrades called Ethereum 2.0, which includes a transition to proof of stake and aims to increase transaction throughput using sharding. == Overview == Ether is a type of money that is decentralized, which means that there's no company, bank or government that oversees it. Instead, it uses the Ethereum network of computers spread around the world, which keep track of every payment of ether. As in other cryptocurrencies, Ethereum keeps track of payments by using a blockchain, which is a growing registry of every payment. This blockchain is open for everyone to read, and it is spread across the network so that everyone can check what payments have been made. This also protects against hacking or theft of money from the system, because if the blockchain was to be altered in some computers then it would be noticed that it is not identical with the others. Ether is a form of cryptocurrency, which means that it is decentralized, and also means that people can use it for payments without revealing who they are. Instead, people can use the Ethereum system by addresses (also called keys) which they can keep secret from others. The Ether coin can be transferred between accounts and used as a payment mechanism. The Ether coin is mined and used as compensation to miners for verifying transactions. After bitcoin, digital currency ether is the second most widespread cryptocurrency. However, Ethereum – the blockchain platform that supports ether transactions – has a few technological advantages over the market leader. Whereas practically the only use for bitcoin is in monetary transactions, Ethereum offers the additional option of linking the transactions to contractual conditions in what are known as smart contracts. These are small computer programs that are executed when the relevant monetary transaction has been concluded or, conversely, that trigger a monetary transaction or data delivery once they have been executed.Security flaws uncovered in blockchain platform | ETH ZurichVerification of Ethereum Smart Contracts – Programming Methodology Group | ETH Zurich == History == Ethereum was initially described in a white paper by Vitalik Buterin, a programmer and co-founder of Bitcoin Magazine in late 2013. Ethereum was announced at the North American Bitcoin Conference in Miami, in January 2014. During the conference, Gavin Wood, Charles Hoskinson, and Anthony Di Iorio (who financed the project) rented a house in Miami with Buterin to develop a fuller sense of what Ethereum might become. In January 2018, Ethereum was the second largest cryptocurrency in terms of market capitalization, behind only Bitcoin. As of 2021, it maintained that relative position. In 2019, Ethereum Foundation employee Virgil Griffith was arrested by the US government for presenting at a blockchain conference in North Korea. On 27 August 2021, the blockchain experienced a brief fork that was the result of clients running different incompatible software versions. Ethereum's founding story and team are featured in the 2021 book The Cryptopians: Idealism, Greed, Lies, and the Making of the First Big Cryptocurrency Craze. The Cryptopians focuses on the infamous 2016 DAO hack on Ethereum. During this hack, over 3.6 million ether–about 15% of all ether in the world at the time–was stolen. Author Laura Shin writes about exciting and sometimes bad situations with the project's founding and the huge cryptocurrency rise of 2017. == References == Category:Cryptocurrency Category:Software",
 "title": "Ethereum"
}