{
 "id": "609825",
 "text": "The 2017-18 Premier League is the 26th Premier League as Chelsea are the defending Champions. The season started on 11 August 2017 and finished on 13 May 2018. Newcastle United F.C. Brighton and Hove Albion and Huddersfield Town got promoted to the Premier League from the English Football League. Brighton are playing in the Premier League for the first time in their history. ==League table== ==Results== ==Season record== ===Scoring=== ====Top scorers==== Rank Player Club Goals 1 Mohamed Salah Liverpool 32 2 Harry Kane Tottenham Hotspur 30 3 Sergio Agüero Manchester City 21 4 Jamie Vardy Leicester City 20 5 Raheem Sterling Manchester City 18 6 Romelu Lukaku Manchester United 16 7 Roberto Firmino Liverpool 15 8 Alexandre Lacazette Arsenal 14 9 Gabriel Jesus Manchester City 13 10 Eden Hazard Chelsea 12 Riyad Mahrez Leicester City Glenn Murray Brighton & Hove Albion Son Heung-min Tottenham Hotspur ====Hat-tricks==== Player For Against Result Date Ref Manchester City Watford 6–0 (A) Chelsea Stoke City 4–0 (A) Bournemouth Huddersfield Town 4–0 (H) 18 November 2017 Everton West Ham United 4–0 (H) 29 November 2017 Tottenham Hotspur Burnley 3–0 (A) 23 December 2017 Southampton 5–2 (H) 26 December 2017 Manchester City Newcastle United 3–1 (H) Arsenal Everton 5–1 (H) 4 Manchester City Leicester City 5–1 (H) 4 Liverpool Watford 5–0 (H) ;Note 4 Player scored 4 goals; (H) – Home ; (A) – Away ====Top assists==== Rank Player Club Assists 1 Kevin De Bruyne Manchester City 16 2 Leroy Sané Manchester City 15 3 David Silva Manchester City 11 Raheem Sterling Manchester City 5 Dele Alli Tottenham Hotspur 10 Christian Eriksen Tottenham Hotspur Mohamed Salah Liverpool Paul Pogba Manchester United Riyad Mahrez Leicester City 10 Henrikh Mkhitaryan Manchester United/Arsenal 9 ===Clean sheets=== Rank Player Club Clean sheets 1 David de Gea Manchester United 18 2 Ederson Manchester City 16 3 Thibaut Courtois Chelsea 15 Hugo Lloris Tottenham Hotspur 5 Petr Čech Arsenal 11 Nick Pope Burnley 7 Ben Foster West Bromwich Albion 10 Loris Karius Liverpool Jonas Lössl Huddersfield Town Jordan Pickford Everton Mathew Ryan Brighton & Hove Albion ===Discipline=== ====Player==== *Most yellow cards: 11 ** Oriol Romeu (Southampton) *Most red cards: 2 ** Wilfred Ndidi (Leicester City) ** Jonjo Shelvey (Newcastle United) ====Club==== *Most yellow cards: 73 **West Bromwich Albion **West Ham United *Most red cards: 5 **Leicester City ==Awards== ===Monthly awards=== Month Manager of the Month Player of the Month Goal of the Month References Manager Club Player Club Player Club August David Wagner Huddersfield Town Sadio Mané Liverpool Charlie Daniels Bournemouth September Pep Guardiola Manchester City Harry Kane Tottenham Hotspur Antonio Valencia Manchester United October Pep Guardiola Manchester City Leroy Sané Manchester City Sofiane Boufal Southampton November Pep Guardiola Manchester City Mohamed Salah Liverpool Wayne Rooney Everton December Pep Guardiola Manchester City Harry Kane Tottenham Hotspur Jermain Defoe Bournemouth January Eddie Howe Bournemouth Sergio Agüero Manchester City Willian Chelsea February Chris Hughton Brighton & Hove Albion Mohamed Salah Liverpool Victor Wanyama Tottenham Hotspur March Sean Dyche Burnley Jamie Vardy Leicester City April Darren Moore West Bromwich Albion Wilfried Zaha Crystal Palace Christian Eriksen Tottenham Hotspur ===PFA Team of the Year=== The PFA Team of the Year was: *Goalkeeper: David de Gea (Manchester United) *Defence: Kyle Walker (Manchester City), Nicolas Otamendi (Manchester City), Jan Vertonghen (Tottenham Hotspur), Marcos Alonso (Chelsea) *Midfield: David Silva (Manchester City), Christian Eriksen (Tottenham Hotspur), Kevin De Bruyne (Manchester City) *Attack: Mohamed Salah (Liverpool), Harry Kane (Tottenham Hotspur), Sergio Agüero (Manchester City) ====PFA Player of the Year==== The PFA Players' Player of the Year was awarded to Mohamed Salah. ====PFA Young Player of the Year==== The PFA Young Player of the Year was awarded to Leroy Sané. ====FWA Footballer of the Year==== The FWA Footballer of the Year was awarded to Mohamed Salah.ref>ref> ==Other websites== *Official website == References == England Category:2018 in association football Category:Premier League seasons",
 "title": "2017–18 Premier League"
}