{
 "id": "610116",
 "text": "Sir James Marriott (29 October 1730 – 21 March 1803) was a famous British judge, politician and scholar. He is famous for being in the highest court in Britain. He judged a lot of legal trials involving boats and the British Navy, he most helped lawyers by writing a book about American law. == Life == James Marriott was born on 29 October 1730. In June 1746 he was sent to Trinity Hall, Cambridge, and graduated in 1751. Although he had wanted a job in the church, he decided to switch to law in 1755, maybe because his stepfather, a very good lawyer, told him to. He spent three years as librarian to the Duke of Newcastle. He joined the College of Advocates and began his legal job in which he wrote two books on law. While he served the Duke of Newcastle, he began to flatter others with nice words, which gave him the job of Receiver of Land Tax for Suffolk, but did not do much else until King George III was made king in 1760, when he left Newcastle for the new king. In 1767 he was made king's advocate, mostly because there was no one else to do it. In 1767 he served as Vice-Chancellor of the University of Cambridge for a year and in 1768. For the next ten years he kept trying to get a better job, making Lord Grafton very angry in the process.In 1778 he was knighted and made the Judge of the High Court of Admiralty, responsible for cases involving boats and the Navy. His work as king's advocate was not impressive, because of his lack of good choice-making and bad courtroom behaviors, as well as his aggressive speeches against his own co-workers. In 1781 he was elected to Parliament for Sudbury. Marriott worked for Lord Shelburne, who strongly opposed war. The French Revolutionary Wars in 1793 caused the Navy to be used more and more, which made Marriott judge on more cases than he normally would, even though he was able to make some important decisions. He was also re-elected for his Parliament job in 1796. he had supported someone else, but then changed his mind and ran for election himself. Marriott remained in Parliament until 1802, shortly before he died. Marriott quit his job in 1798. He returned to Twinstead Hall and stayed there until he died on 21 March 1803, having rebuilt the local church. The year before he died he wrote his most important book, Formulare instrumentarum, a book about his job with Naval law that caused Naval law in the United States to change. He also made a lot of poems and legal books that were not important. He never married, his one try in 1760 causing both the girl and her father to say \"no.\" Instead he took care of his mother until her death. == Notes == == References == * == Other websites == * James Marriott at the Eighteenth-Century Poetry Archive (ECPA) Category:1730 births Category:1803 deaths Category:Knights Bachelor Category:Members of the British House of Commons for English constituencies",
 "title": "James Marriott"
}