{
 "id": "610945",
 "text": "George Frederick Addison (1889-1954) was an Australian architect, who designed many heritage listed buildings in Brisbane, Queensland. This is a reference George Frederick Addison was born October 10, 1889 in Brisbane, Queensland to architect George Henry Male Addison and his wife, Emily Maude. He studied at the Brisbane Central Technical College. == War Service == Addison enlisted in the Australian Infantry Force in 1914, serving at Gallipoli during the First World War where he was wounded. He also served in Egypt and France. == Career == Addison entered into practice with his father in 1919, as G H M Addison and Son. It is probable he completed the drawings begun by his father for the Bulimba and Hawthorn ferry terminals. He entered a partnership with H.S. MacDonald from 1928-1946. Their combined works included- * Marist Brothers Monastery and School, Rosalie (1929) * Bulk Store, and offices of Castlemaine Perkins, 418 Adelaide Street and at Castlemaine Brewery, Milton(1928-1929) * the English Scottish & Australian Bank Building * Queensland National Bank Building at 39 Melbourne Street, South Brisbane (1929) * a number of buildings at Brisbane’s Doomben racecourse, including the totaliser (1932) * the Mt Thompson Crematorium (based on the original plans of the Heath firm of Melbourne) (1934) * renovations to Hotel Orient and other Castlemaine Perkins hotels including Belfast Hotel in Queen Street, Brisbane, Hotel Cecil in Southport, Caledonian Hotel in Ipswich, Leichhardt Hotel in Spring Hill, National Hotel in Warwick, Governor Blackall Hotel in Toowoomba, Newtown Hotel in Toowoomba (1937 onwards) * Goondiwindi Civic Centre (1937) * Addison and M.L. Conrad designed the grandstand at Eagle Farm racecourse. == Memberships == President of the Johnsonian Club 1938-1939 Director, Castlemaine Perkins == Personal life == Addison married Miriam Urquhart in 1921. Addison died on December 10, 1954 and was survived by his wife, and son Peter George Addison. == References == Category:Pages created with the Article Wizard from 2017 Category:1889 births Category:1954 deaths Category:Australian architects",
 "title": "George Frederick Addison"
}