{
 "id": "610941",
 "text": "The Facts of Life is an American comedy-drama television series. The series ran from August 24, 1979 until May 7, 1988. It was one of the longest-running television sitcoms of the 1980s. It is set in a private boarding school in upstate New York. Molly Ringwald played Molly Parker. Mindy Cohn played Natalie Green. Cloris Leachman played Beverly Ann Stickle. Kim Fields played Tootie. Charlotte Rae played Edna. The show dealt with topics and subjects including cerebral palsy, eating disorders, college and loss of virginity. The Facts of Life was released on DVD in the 2000s and 2010s. The show was low rated at first. But in later seasons, starting from 1980, The Facts of Life had higher ratings between then and 1988. ==International airings== * In Latin America, Brazil and Mexico, Warner Channel begins to airing from 1995 until 2000. Then on Nick at Nite airing from 2006 until 2007, the show may taken off. TBS began airing the reruns from 2011 until 2016. * In Mexico, MeTV starts airing from 1995 until 2003, then again return from 2008 to currently airing. * In Germany, the show reruns on Nickelodeon from 1995 until 1998, then Disney Channel began to reruns the series from 1999 until 2005. * In Australia, ABC Television began airing in early Christmas in 1980 until the show may taken off the air in 1993. Nickelodeon began airing the reruns from 1997 until 2004. Then it came return the show on Disney Channel airing from 1996 until 2000. * In Italy, La 5 starts airing for five seasons from 1983 to 1986. Then the show returns on Nickelodeon from 2004 to 2007. * In Canada, the show reruns on YTV from 1996 until 2000. ==Other websites== * ==References== Category:1979 American television series debuts Category:1988 disestablishments in the United States Category:1988 television series endings Category:1970s American sitcoms Category:1980s American sitcoms Category:American television spin-offs Category:American teen comedy television series Category:High school television series Category:Television series set in New York (state) Category:English-language television programs",
 "title": "The Facts of Life"
}