{
 "id": "611058",
 "text": "Ian Erix, is an American pop singer, songwriter, TV presenter, and social media personality. In 2013, he was signed to Ultra Music and Sony Entertainment. ==Career== Erix was raised on Long Island, New York. He began performing professionally as a DJ/Emcee at age nine and signed his first management and recording contract as a pop singer at the age of 14 with Louis J. Pearlman, the boyband mogul behind Orlando based Transcontinental Records. Pearlman was later arrested for embezzling 300 million dollars in one of the largest ponzi schemes in US history and also stood accused of molesting several members of the famous groups he managed. After Pearlman's downfall, Erix signed a record deal with I.D Music in Denmark and Warner/Chappell Music Scandinavia. His early musical efforts with that label found popularity on MySpace which led to an online TV series with the social network called Journey Of A Rock Star. Songs from his album \"For Conformity\" amassed millions of online streams and received airplay on international media networks such as MTV Japan and MNET South Africa before landing Ian's single, \"Confessions Of A Killer\" in the top 10 in Asia. In 2010, Erix entered into a deal with Universal Music Group in Germany but his album release was held up for years when the record company began restructuring and his former A&R; and manager, Nik Hafemann, left the label to become a judge on a German reality TV series. During this time, Erix continued to cultivate his presence online and released demo versions of new songs he had been working on such as \"Squeaky Clean\", a pop-punk satire of Disney Channel stars, as well as \"So Scene, So See Through (A Song For Mutts)\" which ultimately inspired the name of Erix's fandom and social justice movement, the \"Mutt Army\". Amidst its online popularity, Ian was invited to perform the song on MTV UK in a special live session that was recorded for the network in their London studio. Another single from that period, \"The Human Race\" was featured in Season 3 Episode 19 of the popular TV show 90210 on The CW network in the USA and worldwide on Netflix. In 2012, Erix begain to appear as a performer and television presenter in numerous countries around the globe at festivals such as Tomorrowland in Belgium and Ultra Music Festival Europe. He began experimenting with more electronic, dance, and pop sounds and had a major breakthrough in 2012 when he played his single, \"Sex, Dance and Rock & Roll (Lose It)\" onstage at Réveillon, a live New Year's Eve concert in Brazil with David Guetta that had an in-person audience of 2+ million people. Ian was later signed to Ultra Music and since that time he has continued to tour extensively, visiting over 60 countries worldwide. In 2014, Ian recorded \"Shangri-la\" (also known as \"Rannalle\"), a song he wrote with Finnish boy band TCT and producer Erik Nyholm. The Scandinavian version of the song was nominated for the biggest hit of summer 2014 by radio station The Voice. The song was originally ranked second but it eventually won the vote to be named \"Best Song of the Summer\". The track climbed to the top of the single charts for several consecutive weeks reaching number 3 on national radio charts. Overall, the song was the fourth most played radio song in Finland in 2014 and on 24 July 2014, it was announced to have sold enough copies to be awarded gold record status. In 2015, Erix released the English language version of \"Shangri-La\". Ian's video premiered on Vevo in Spring 2015 and features Erix in the hedonistic European party resort of Sunny Beach, Bulgaria. On July 10, 2015, in response to Ian's video, The Guardian, one of the UK's largest newspapers, reported that \"music is over because Ian Erix has spoiled it for everyone.\" In 2016, Erix released an EP called \"Graffiti On My Heart\" along with a 4 part music video film linking together his singles \"Horse Of A Different Color, \"Time Machine\", \"Out From Under\" and \"Tomahawk\". Each song tells a different story, ranging from pain and loss and a fractured spirit to rebellion, anti-conformity and overcoming adversity. The video series was based on Ian's personal life experiences as a survivor of childhood abuse and the aftermath of the tragic 2013 deaths of both his dad and grandfather, which have been alleged as homicides. In 2017, Ian linked up with British boyband Union J to play 17 dates across the UK throughout the month of February He previewed new material from his forthcoming album on that tour and announced his new LP would likely be called \"Renegade\". After his final date in the UK, Erix embarked on another promo tour that took him to South East Asia, Australia, New Zealand and Europe. In the Philippines he appeared on MTV Asia with fellow pop artist Austin Mahone. He presented and performed at the red carpet pre-show at Justin Bieber's \"Purpose Tour\" in Mumbai, India on May 10th, 2017. On his 2017 tour stops, Erix began promoting his latest single, \"Footprints In The Sand\", an EDM based pop track with lyrics about living life to the fullest which he wrote during a song writing session in Finland. The song began to grow in popularity in several countries throughout the summer months. It broke into the Top 100 on national Japanese pop radio in July 2017 and remained in top 20 on dance radio in Japan throughout the summer, peaking at #5 during the week of August 25th. A David Guetta mashup version of the song was released in Europe and Asia in August. Ian's original version of \"Footprints In The Sand\" went on to land at #37 on iTunes sales charts in Scandinavia and later claimed #1 chart positions on Spotify in Czech Republic and Latvia. The song cracked the Top 40 national sales and radio charts in Bulgaria peaking at #29. While Ian was on tour in Europe, the song impacted the streaming charts on Spotify in Greece, Cyprus, Iceland, Latvia, Poland, Lithuania and Portugal peaking at # 5 in Cyprus In the United States, the song received airplay on several Top 40 Mediabase, iHeart Radio and Sirius XM Satellite Radio stations. It was voted top new song for 4 weeks in a row on Kiss FM in Memphis landing Ian a permanent spot in the Hall Of Fame as a favorite \"newbie\" artist for that iHeart radio station. On the last week of 2017, Erix appeared in the United Arab Emirates as a celebrity ambassador at several events with pop stars such as Katy Perry, Akon and Hardwell to present the Red Diamond Award to the city of Dubai for the World's Greatest New Year's Eve Celebration. Erix's song, \"Footprints In The Sand\", was named the official theme for New Year's 2018 in that region. ==References== ==Other websites== * Official Website * Category:American pop musicians Category:Singers from New York City Category:Living people Category:Year of birth missing",
 "title": "Ian Erix"
}