{
 "id": "611379",
 "text": "Roberto Firmino Barbosa de Oliveira (born 2 October 1991) is a Brazilian professional footballer who plays as a forward or attacking midfielder for Saudi Pro League club Al-Ahli, which he captains, and the Brazil national team. Firmino started his career in Brazil, first playing for CRB and later Figueirense. In 2011, he joined the Bundesliga side 1899 Hoffenheim, where he spent four-and-a-half seasons. He signed for Premier League side Liverpool in June 2015. Firmino has played for Brazil since 2014. He played for them during the 2015 Copa América and 2018 FIFA World Cup. ==Hoffenheim== Firmino joined Hoffenheim in December 2010, including a contract running until June 2015. He flew to Hoffenheim on January 1, 2011. Ernst Tanner, which is the manager of Hoffenheim said “they were pleased to have a talented Brazilian soccer player on there team”. He made his debut after a month in a Bundesliga defeat against a team called Mainz ,when he got substituted with Sebastian Rudy at the 75th minute. Firmino made his first professional goal with Hoffenheim on April 16 the only goal of a league victory against Eintracht Frankfurt. In July 2013, A russian club named Lokomotiv Moscow which made a €12 million bid for firmino Hoffenheim captain Andreas Beck halied Firmino's development as \"outstanding\" in August 2013. He completed his 2013–14 Bundesliga season with a he was the fourth highest score with 16 goals. ==Liverpool== On June 23, 2015, while he was competing for Brazil at the Copa América, Hoffenheim and Firmino both agreed the terms for him to transfer him to the Premier League club called Liverpool for about £29 million on conclusion of the tournament, Liverpool confirmed the signing the next day The deal was finalised on 4 July. On 23 August, Firmino scored his first goal of the 2016–17 season,and scoring 5-0 goals and a win over Burton Albion. He was took Jordan Ibe for the final 12 minutes in a game against 1-0 Stoke City. In January 2016, the Irish Examiner said Firmino was steadily On December 21, 2019, he scored the goal in the FIFA Club World Cup Final, giving the title to Liverpool. ==Al-Ahli== Firmino joined Al-Ahli on July 4 2023, signing a contract until 2026. He scored a hat- trick in his first game for the team on August 11. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup League cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Figueirense 2009 Série B 2 0 0 0 — — 2 0 2010 Série B 36 8 0 0 — — 36 8 Total 38 8 0 0 — — 38 8 TSG Hoffenheim 2010–11 Bundesliga 11 3 — — — — 11 3 2011–12 Bundesliga 30 9 3 0 — — — 33 7 2012–13 Bundesliga 33 5 1 0 — — 2 2 36 7 2013–14 Bundesliga 33 16 4 6 — — — 37 22 2014–15 Bundesliga 33 7 3 3 — — — 36 10 Total 140 38 11 9 — — 2 2 153 49 Liverpool 2015–16 Premier League 31 10 0 0 5 0 13 1 — 49 11 2016–17 Premier League 35 11 2 0 4 1 — — 41 12 2017–18 Premier League 37 15 2 1 0 0 15 11 — 54 27 2018–19 Premier League 34 12 1 0 1 0 12 4 — 48 16 2019–20 Premier League 38 9 2 0 0 0 8 1 4 2 52 12 2020–21 Premier League 36 9 2 0 0 0 9 0 1 0 48 9 2021–22 Premier League 20 5 5 1 3 0 7 5 — 35 11 2022–23 Premier League 25 11 0 0 1 0 8 2 1 0 35 13 Total 256 82 14 2 14 1 72 24 6 2 362 111 Al-Ahli 2023–24 Saudi Pro League 12 3 2 0 — — — 14 3 Career total 446 131 27 11 14 1 72 24 8 4 567 171 ===International=== Appearances and goals by national team and year National team Year Apps Goals Brazil 2014 2 1 2015 9 3 2016 2 1 2017 5 0 2018 11 3 2019 15 5 2020 4 3 2021 7 1 Total 55 17 :Scores and results list Brazil's goal tally first, score column indicates score after each Firmino goal List of international goals scored by Roberto Firmino No. Date Venue Cap Opponent Score Result Competition 1 18 November 2014 Ernst-Happel-Stadion, Vienna, Austria 2 2–1 2–1 Friendly 2 29 March 2015 Emirates Stadium, London, England 4 1–0 1–0 Friendly 3 10 June 2015 Estádio Beira-Rio, Porto Alegre, Brazil 6 1–0 1–0 Friendly 4 21 June 2015 Estadio Monumental David Arellano, Santiago, Chile 9 2–0 2–1 2015 Copa América 5 6 October 2016 Arena das Dunas, Natal, Brazil 12 5–0 5–0 2018 FIFA World Cup qualification 6 3 June 2018 Anfield, Liverpool, England 20 2–0 2–0 Friendly 7 2 July 2018 Cosmos Arena, Samara, Russia 24 2–0 2–0 2018 FIFA World Cup 8 7 September 2018 MetLife Stadium, East Rutherford, United States 26 1–0 2–0 Friendly 9 26 March 2019 Sinobo Stadium, Prague, Czech Republic 31 1–1 3–1 Friendly 10 9 June 2019 Estádio Beira-Rio, Porto Alegre, Brazil 32 6–0 7–0 Friendly 11 22 June 2019 Arena Corinthians, São Paulo, Brazil 35 2–0 5–0 2019 Copa América 12 2 July 2019 Mineirão, Belo Horizonte, Brazil 37 2–0 2–0 2019 Copa América 13 10 October 2019 National Stadium, Kallang, Singapore 41 1–0 1–1 Friendly 14 9 October 2020 Arena Corinthians, São Paulo, Brazil 45 rowspan=\"2\" 15 3–0 16 13 November 2020 Estádio do Morumbi, São Paulo, Brazil 47 1–0 1–0 2022 FIFA World Cup qualification 17 23 June 2021 Estádio Olímpico Nilton Santos, Rio de Janeiro, Brazil 52 1–1 2–1 2021 Copa América ==Honours== Liverpool *Premier League: 2019–20 *FA Cup: 2021–22 *EFL Cup: 2021–22; runner-up: 2015–16 *FA Community Shield: 2022 *UEFA Champions League: 2018–19; runner-up: 2017–18, 2021–22 *UEFA Europa League runner-up: 2015–16 *UEFA Super Cup: 2019 *FIFA Club World Cup: 2019 Brazil *Copa América: 2019; runner-up: 2021 Individual *Bundesliga Breakthrough of the Season: 2013–14 *PFA Player of the Month: January 2016 *PFA Fans' Player of the Month: January 2016 *UEFA Champions League Squad of the Season: 2017–18 *Samba Gold: 2018 * Highest-scoring Brazilian player in Premier League history: 82 goals ==References== ==Other websites== *Roberto Firmino profile at the Liverpool F.C. website *Roberto Firmino career stats at Soccerbase Category:1991 births Category:Living people Category:2018 FIFA World Cup players Category:Footballers from Maceió Category:Liverpool F.C. players",
 "title": "Roberto Firmino"
}