{
 "id": "611325",
 "text": "Uriel (, , , meaning “God is my light” or “fire of God”) is an archangel in Jewish and Christian traditions. The Eastern Orthodox, Oriental Orthodox and Anglicans call him “Saint Uriel the Archangel” or simply “Saint Uriel”. == In Judaism and Christianity == The Roman Catholic Church only recognizes three archangels which are mentioned in the Bible: Michael, Gabriel and Raphael. But according to the certain rabbinic and Christian traditions, there are four or even seven archangels, Uriel is generally the fourth. In the Deuterocanonical book 2 Esdras, Uriel is sent by God to answer the questions which are asked by Ezra. The role of Uriel in Christian apocryphal traditions is different from answering Ezra's questions. He is said to have rescued John the Baptist from the Massacre of the Innocents(the murder of all boys under the age of two in the area of Bethlehem) as a child and reunited him and his mother Saint Elizabeth with John's cousin, Jesus. This is shown in Leonardo da Vinci's painting Virgin of the Rocks. Uriel is often described as a cherub and the angel of repentance and is the angel at the Gate of Eden. In The Apocalypse of Peter, Uriel is shown to be as cruel as any demon when enforcing repentance. He is also supposed to be one of the angels that buried Adam and Abel in Eden. == Gallery == File:Archangel Uriel, St James' Church, Grimsby.jpg|Stained glass, depicted with fire as the attribute, Church of St James, Grimsby File:St Uriel, St James' Church, Ewhurst Green.jpg|Stained glass, with flaming sword as the attribute, St James' Church, Ewhurst Green File:Saint Uriel - stained glass window in the cloisters of Chester Cathedral.jpg|Stained glass of archangel Uriel as regent of the sun, Chester Cathedral File:Image of Uriel the Archangel, Cairo.jpg|Fresco of archangel Uriel at the Hanging Church in Cairo, 13th century File:Sant’Uriele Arcangelo (Pala d’oro).jpg|Enamel plaque of Saint Uriel the Archangel, part of the Pala d'Oro at St Mark's Basilica, Venice File:LOC Painting 07.jpg|Painting of archangel Uriel by Henry Oliver Walker at the Library of Congress File:Vitral de la Catedral de Puebla.JPG|Stained glass of St Uriel at Puebla Cathedral, Puebla, Mexico File:Monumento a la familia Stirling - Argois.JPG|Statue of archangel Uriel wearing an Eye of Providence headgear at the Old Cemetery of Paysandú ==Related pages== * St. Uriel's Episcopal Church ==References== Category:Angels Category:Christian saints",
 "title": "Uriel"
}