{
 "id": "611676",
 "text": "Abu Nayeem Mohammad Munier Choudhury (27 November 1925 - 14 December 1971) was a Bangladeshi playwright, literary critic and political activist. His notable dramas are Kabar (The Grave), Roktakto Prantor (Bloody Field), Chithi (Letter). He was awarded Bangla Academy Literary Award for his contribution in dramas in 1962. He was killed as an intellectual during the mass killing of Bengali intellectuals in 1971. He was awarded the highest civilian award given by the Government of Bangladesh, Independence Day Award, in 1980 posthumously. ==Literary works== When Choudhury was in prison during 1952-54, he wrote his symbolic drama, Kabar (The Grave). This was a translation of Irwin Shaw's drama Bury the Dead. After release from prison, he continued to write Roktakto Prantor (1959; a play about the Third Battle of Panipat), Chithi (1966) and Polashi Barrack O Onyanno (1969). In 1965, Choudhury redesigned the keyboard of the Bangla typewriter. This typewriter was named after him as Munier Optima Keyboard. It was designed in collaboration with Remington typewriters of the then East Germany. * Mir-Manas, 1965 – literary critique of Mir Mosharraf Hossain's literature * Ektala-Dotala (first ever Bengali drama broadcast on television), 1965 * Dandakaranya, 1966 * Tulanamulak Samalochana (Comparative critique), 1969 * Bangla Gadyariti (Bengali prose style), 1970 ==Death== In 1971, when Pakistani army attacked in the University of Dhaka area, Choudhury escaped from there and moved to his parents' house, near Hatirpool. On 14 December 1971, he, along with a large number of Bengali intellectuals, educators, doctors and engineers, were kidnapped from their houses and later tortured and killed by the Pakistan Army and its Bengali collaborators Al-Badr and Al-Shams. According to a witness, Choudhury was last seen in Government Physical Education College, Dhaka in Mohammadpur Thana, Dhaka where his fingers were mutilated. His dead body was not found. ==Awards== * 1962: Bangla Academy Literary Award for contribution in drama * 1965: Daud Prize for Mir- Manas\" * 1966: Sitara-i-Imtiaz (denounced in 1971) * 1980: Independence Day Award (posthumously) ==References== Category:1925 births Category:1971 deaths Category:Bangladeshi playwrights Category:Harvard University alumni Category:Recipients of the Independence Day Award Category:Bangla Academy Literary Award winners",
 "title": "Munier Choudhury"
}