{
 "id": "61160",
 "text": "The Saffir–Simpson Hurricane Wind Scale is a scale that is used to sort tropical cyclones in the Western Hemisphere. It is only used for storms that are stronger than \"tropical storms\", and become actual hurricanes. The categories into which the scale separates hurricanes are noted by the strength of their maximum sustained wind speeds. The classifications are used mainly to predict the possible wind damage a hurricane will create when it makes landfall. It does not measure rainfall or storm surge or how wide the storm is. The scale is also used to classify subtropical cyclones after a change in the rules made by the National Hurricane Center in 2002. The Saffir-Simpson Hurricane Scale is used only to describe hurricanes that form in the Atlantic Ocean and northern Pacific Ocean, to the east of the International Date Line. Other areas call their tropical storms by other names, and use their own classification scales. ==Examples== ===Category 1=== Category 1 Sustained winds Most recent landfall 33–42 m/s 64–82 kn 119–153 km/h 74–95 mph Debby at its 2024 landfall in florida Dangerous winds will produce some damage Category 1 storms may damage roofs, shingles, vinyl sidings, and gutters to well- constructed frame homes. Large branches of trees will snap and shallowly rooted trees may be toppled. Extensive damage to power lines and poles likely will result in power outages that could last a few to several days. Hurricanes that peaked at Category 1 intensity and made landfall at that intensity include: Agnes (1972), Juan (1985), Ismael (1995), Gaston (2004), Stan (2005), Humberto (2007), Isaac (2012), Manuel (2013), Earl (2016), Hermine (2016), Nate (2017), Barry (2019), Hanna (2020), Isaias (2020), Nana (2020), Julia (2022), Lisa (2022), and Nicole (2022), and Debby (2024) ===Category 2=== Category 2 Sustained winds Most recent landfall 43–49 m/s 83–95 kn 154–177 km/h 96–110 mph Francine in 2024 at landfall in Lousiana Extremely dangerous winds will cause extensive damage Category 2 storms may produce extremely dangerous winds that will cause extensive damage: Well-constructed frame homes could sustain major roof and siding damage. Many shallowly rooted trees will be snapped or uprooted and block numerous roads. Near-total power loss is expected with outages that could last from several days to weeks. Hurricanes that peaked at Category 2 intensity and made landfall at that intensity include: Able (1952), Alice (1954), Ella (1958), Fifi (1974), Diana (1990), Gert (1993), Rosa (1994), Erin (1995), Alma (1996), Juan (2003), Alex (2010), Richard (2010), Tomas (2010), Carlotta (2012), Ernesto (2012), Arthur (2014), Sally (2020),Olaf (2021), Rick (2021), Agatha (2022), and Francine (2024). ===Category 3=== Category 3 Sustained winds Most recent landfall 50–58 m/s 96–112 kn 178–208 km/h 111–129 mph Radar loop of Milton at landfall in Siesta Key, Florida Devastating damage will occur Tropical cyclones of Category 3 and higher are major hurricanes, and devastating damage will occur: Well-built framed homes may incur major damage or removal of roof decking and gable ends. Many trees will be snapped or uprooted, blocking numerous roads. Electricity and water will be unavailable for several days to weeks after the storm passes. Hurricanes that peaked at Category 3 intensity and made landfall at that intensity include: Easy (1950), Carol (1954), Hilda (1955), Audrey (1957), Celia (1970), Ella (1970), Caroline (1975), Eloise (1975), Olivia (1975), Alicia (1983), Elena (1985), Roxanne (1995), Fran (1996), Isidore (2002), Jeanne (2004), Lane (2006), Karl (2010), Otto (2016), Zeta (2020), and Grace (2021), John (2024) and Milton (2024) ===Category 4=== Category 4 Sustained winds Most recent landfall 58–70 m/s 113–136 kn 209–251 km/h 130–156 mph Helene at its landfall in the Big bend region, Florida Catastrophic damage will occur Category 4 storms may cause catastrophic damage. Well-built framed homes can sustain severe damage with loss of most of the roof structure and/or some exterior walls. Most trees will be snapped or uprooted and power poles downed. Fallen trees and power poles will isolate residential areas. Power outages will last weeks to possibly months. Most of the area will be uninhabitable for weeks or months. The 1900 Galveston hurricane, the deadliest natural disaster (at the time) to hit the United States, peaked at an intensity that corresponds to a modern-day Category 4 storm. Other examples of storms that peaked at Category 4 intensity and made landfall at that intensity include: Donna (1960), Flora (1963), Cleo (1964), Betsy (1965), Carmen (1974), Frederic (1979), Iniki (1992), Iris (2001), Charley (2004), Dennis (2005),Ike (2008), Joaquin (2015), Harvey (2017), Laura (2020), Eta (2020), Iota 2020), and Ida (2021), Lidia (2023), and Helene(2024) ===Category 5=== Category 5 Sustained winds Most recent landfall ≥ 70 m/s ≥ 137 kn ≥ 252 km/h ≥ 157 mph Hurricane Otis nearing its landfall in October 2023 in Guerrero Near-total damage will occur Category 5 is the highest category of the Saffir–Simpson scale. These storms cause roofs to break apart on many buildings, and some building may break apart, with small utility buildings blown over or away. Collapse of many roofs and walls, especially those with no inside supports, is common. Very heavy and unfixable damage to many wooden buildings and total destruction to mobile/manufactured homes is common. Only a few types of buildings can survive, and only if located at least inland. They include office, condominium and apartment buildings and hotels that are of concrete or steel frame construction, multi-story concrete parking garages, and residences that are made of either lots of brick or concrete/cement block and have roofs with slopes of no less than 35 degrees from a horizontal angle and no overhangs of any kind, and if the windows are either made of hurricane- resistant safety glass or covered with shutters. Unless most of these requirements are met, the catastrophic destruction of a structure may occur. The storm's flooding causes major damage to the lower floors of all structures near the shoreline, and many coastal structures can be completely flattened or washed away by the storm surge. Virtually all trees are uprooted or snapped and some may be debarked, isolating most affected communities. Massive evacuation of residential areas may be required if the hurricane threatens populated areas. Total and extremely long-lived power outages and water losses are to be expected, possibly for up to several months. Historical examples of storms that made landfall at Category 5 status include: \"Cuba\" (1924), \"Okeechobee\" (1928), \"Bahamas\" (1932), \"Cuba–Brownsville\" (1933), \"Labor Day\" (1935), Janet (1955), Camille (1969), Edith (1971), Anita (1977), David (1979), Gilbert (1988), Andrew (1992), Dean (2007), Felix (2007), Irma (2017), Maria (2017), Michael (2018), Dorian (2019), Ian (2022) and in the eastern pacific basin, Otis (2023). ==References== Category:Tropical cyclones Category:Winds",
 "title": "Saffir–Simpson scale"
}