{
 "id": "611776",
 "text": "Colombia has 32 departments (Spanish: departamentos, sing. departamento) and 1 Capital District (Distrito Capital). Each department has a Governor (gobernador) and a Department Assembly (Asamblea Departamental), elected by popular vote for a four-year period. The governor cannot be re-elected in consecutive periods. Departments are country subdivisions and are granted a certain degree of autonomy. ID Department Governor Party Capital Area (km²) Population Established 00 Capital District Enrique Peñalosa CR Bogotá 1538 01 Amazonas Manuel Antonio Carebilla Cuéllar CR Leticia 1991 02 Antioquia Luis Pérez Liberal Medellín 1826 03 Arauca Ricardo Alvarado Bestene La U Arauca 1991 04 Atlántico Eduardo I. Verano de la Rosa Liberal Barranquilla 1910 05 Bolívar Dumek José Turbay Paz Liberal Cartagena 1857 06 Boyacá Carlos Andrés Amaya Rodríguez Green Tunja 1539 07 Caldas Guido Echeverri Piedrahíta La U Manizales 1905 08 Caquetá Álvaro Pacheco Álvarez Liberal Florencia 1982 09 Casanare Josue Alirio Barrera Rodríguez CD Yopal 1991 10 Cauca Óscar Rodrigo Campo Hurtado Liberal Popayán 1857 11 Cesar Francisco Fernando Ovalle Angarita La U Valledupar 1967 12 Chocó Jhoany Carlos Alberto Palacios Mosquera Liberal Quibdó 1947 13 Córdoba Edwin José Besaile Fayad La U Montería 1952 14 Cundinamarca Jorge Emilio Rey Ángel CR Bogotá 1857 15 Guainía Javier Eliecer Zapata Parrado Liberal Inirida 1963 16 Guaviare Nebio De Jesús Echeverry Cadavid AICO San José del Guaviare 1991 17 Huila Carlos Julio González Villa CR Neiva 1905 18 La Guajira Oneida Rayeth Pinto Pérez CR Riohacha 1965 19 Magdalena Rosa Cotes De Zuñiga CR Santa Marta 1824 20 Meta Marcela Amaya Liberal Villavicencio 1960 21 Nariño Camilo Romero Green Pasto 1904 22 Norte de Santander William Villamizar Laguado La U Cúcuta 1910 23 Putumayo Sorrel Parisa Aroca Rodríguez Green Mocoa 1991 24 Quindío Carlos Eduardo Osorio Buritica N/A Armenia 1966 25 Risaralda Sigifredo Salazar Osorio Conservative Pereira 1966 26 San Andrés y Providencia Ronald Housni Jaller Liberal San Andrés 1991 27 Santander Didier Alberto Tavera Amado Liberal Bucaramanga 1857 28 Sucre Edgar Enrique Martínez Romero CR Sincelejo 1966 29 Tolima Óscar Barreto Quiroga Conservative Ibagué 1886 30 Valle del Cauca Dilian Francisca Toro Torres La U Cali 1910 31 Vaupés Jesús María Vásquez Caicedo CR Mitú 1991 32 Vichada Luis Carlos Álvarez Morales La U Puerto Carreño 1991 == Related pages == * ISO 3166-2:CO ==References== == Other websites == * Statoids - Departments of Colombia",
 "title": "Departments of Colombia"
}