{
 "id": "61234",
 "text": "Pangolins (or scaly anteaters) are mammals which live in Africa and Asia. They have scales on their skin. They are the only mammals which have this adaptation. There are three genera of pangolin, all of which eat ants and termites. They catch their food using their tongues, and they do not eat anything else. These scaled mammals are one of the most threatened groups of mammals. Unfortunately we know very little of their distribution in West African countries. Evidence of the white bellied pangolin (Phataginus tricuspis) has been found. No evidence of the giant pangolin (Smutsia gigantic) was found. Perhaps the giant pangolin no longer appears in West Africa. Pangolins have features of armadillos (long, ant eating tongue and broad tail) and sloths (claws), but the pangolin is in a completely different order. The pangolin belongs to the order Pholidota. Pangolins have large, hardened, overlapping plate-like scales. The pangolin scales are made of keratin. and are attached to muscles under the skin. and can be moved to point towards predators. Hair grows between the scales and near the rear of the animal. The pangolin's scaled body is a bit like a pine cone or globe artichoke. It can curl up into a ball when threatened, with its overlapping scales acting like armour while it tucks its face under its tail. The scales are sharp, providing extra defence from predators.Yu, Jingyu et al 2015. The first birth and survival of cub in captivity of critically endangered Malayan pangolin (Mariis javanica). Agricultural Science & Technology. 16 (10) – via EBSCO. A pangolin's main predators are wild cats, hyenas and humans. A mother pangolin's gestation period is between 120 and 180 days. Young pangolin are born with scales, and they harden by the second day the pangopup is out of the womb. When walking on a level surface the pangolin is bipedal. It walks on the back legs. Its body is held horizontal, and is balanced by its heavy tail at the back.IUCN. (2023). Pangolin conservation. International Union for Conservation of Nature.BBC Natural World 5. Pangolins Sometimes pangolins are smuggled into China on the black market.* Their scales are used as an ingredient in traditional Chinese medicine. Pangolins are a critically endangered species and have been hunted and trafficked all across Asia and Africa. They are usually sought for their scales, meat and medical properties. This creature is a host for SARS-CoV-2 and similar viruses. The effects of glacial climate changes and recent anthropogenic activities driven by illegal trade are inferred to have caused its population decline with the genomic signatures showing low genetic diversity, a high level of inbreeding, and high genetic load. as a result conservation efforts are crucial to protect pangolins and their environments, and raising awareness about their plight is essential for fostering support and change. Organizations and governments are working on strategies to combat illegal trade and promote sustainable practices that benefit both pangolins and local communities. == References == == Other websites == * Pangolin: Wildlife summary from the African Wildlife Foundation * A photograph of a pangolin * Paul Kuniholm Pangolin Mural Category:Mammals",
 "title": "Pangolin"
}