{
 "id": "61244",
 "text": "Franklin Roberto \"Bobby\" Lashley (born July 16, 1976) is an American professional wrestler and mixed martial artist. He is currently signed to All Elite Wrestling (AEW), where he is the co-leader of the stable The Hurt Syndicate and one-half of the AEW World Tag Team Champions along with Shelton Benjamin. He is best known for his time in WWE, where he performed from 2005–2008 and from 2018–2024, and for his time in Total Nonstop Action Wrestling (TNA), where he competed under the ring name Lashley. He is an eight-time world champion, having been a two-time WWE Champion, two-time ECW World Champion, and four-time TNA World Heavyweight Champion. He also won the WWE United States Championship three times and the WWE Intercontinental Championship twice. He is also an MMA fighter, where he was considered a top draw for Bellator. He has not fought professionally since 2016. == Career == Lashley went to Missouri Valley College. While he was there, he won three national amateur wrestling championships between 1996 and 1998. During 1997 and 1998 he was the NAIA National Wrestling Champion. He wrestled at the weight of 177 pounds (80 kilograms). Lashley later joined the United States Army, where he continued to wrestle. === World Wrestling Entertainment (2005–2008) === In January 2005, Lashley started professional wrestling. He began working for World Wrestling Entertainment (WWE). WWE sent him to Ohio Valley Wrestling (OVW), where he started his training under Lance Storm. During 2005, Lashley appeared at four live events for both the RAW and SmackDown! brands. On September 23, 2005, Lashley made his televised WWE debut on SmackDown!, defeating Simon Dean. On May 26, 2006, he defeated JBL to win his first title, the United States Championship. He lost it to Finlay on July 14. On November 14, 2006, Lashley moved to the ECW brand. Lashley signed a contract for the final spot in a six-man Elimination Chamber match for the ECW World Championship at December to Dismember. Lashley won the match and became the new ECW World Champion. This made Lashley the first African American to hold the ECW title. Lashley lost the title to Mr. McMahon in May of 2007. On June 3, 2007, he defeated McMahon to get the title back. On the June 11 episode of Raw, Lashley was drafted to the Raw brand as part of the 2007 WWE draft. As a result of the move, Lashley was stripped of the ECW World Championship by McMahon. Lashley was released from WWE on February 4, 2008. === Total Nonstop Action Wrestling (2009–2018) === ==== First run (2009–2010) ==== Lashley made his Total Nonstop Action Wrestling debut at Lockdown on April 19, 2009. On July 23, Kurt Angle introduced Lashley as the newest member of the Main Event Mafia, but Lashley turned on Angle and the Mafia. On the July 30 edition of Impact!, Lashley made his in-ring debut for TNA in a tag team match. He and Mick Foley wrestled against World Heavyweight Champion Kurt Angle and Legends Champion Kevin Nash, where Lashley helped Mick Foley pin Nash to win the match for his team and become the Legends Champion per the stipulation. On November 26, Lashley defeated Abyss, Desmond Wolfe, and Robert Roode to win the TNA Championship Series tournament and earned himself a future World Heavyweight Title shot. At Final Resolution on December 20, Lashley avenged his prior loss and defeated Steiner in a Last Man Standing match with a pipeshot. On February 10, 2010, Lashley's profile was removed from the official TNA website. ==== Second run (2014–2018) ==== On March 9, 2014, Lashley returned to TNA at Lockdown, answering Ethan Carter III's open challenge. On the June 19, 2014 episode on Impact Wrestling, Lashley defeated Eric Young to become the first African American TNA World Heavyweight Champion. On September 18, (aired October 28), he lost the title to Bobby Roode in a match with Kurt Angle as the special guest referee. He won it back from Roode on January 7, 2015, but lost it to Kurt Angle on January 31 (aired March 20). In 2016, he became a triple champion in TNA, winning his third World Heavyweight Championship from Drew Galloway on June 12 at Slammiversary, the X Division Championship from Eddie Edwards in a Winner Takes All Six Sides of Steel on July 13 (aired August 12), and the TNA King of the Mountain Championship from James Storm on August 11. The next day he unified the King of the Mountain title with his world title and vacated the next day X Division Championship. On the October 3 episode of Impact Wrestling (aired October 6), he lost the Impact world title to Eddie Edwards. He won it back in a 30-minute Iron Man match at Genesis on January 8, 2017, eventually losing it to Alberto El Patrón at Slammiversary XV on July 2. Lashley left Impact Wrestling in 2018. === Return to WWE (2018–2024) === Lashley returned to WWE on the April 8, 2018 episode of Raw, the night after WrestleMania 34. On the September 17 episode of Raw, he introduced his new manager, Lio Rush. On January 14, 2019, episode of Raw, Lashley won his first Intercontinental Championship in a triple threat match also involving Seth Rollins and previous champion Dean Ambrose. At Elimination Chamber on February 17, he lost the title to Finn Bálor in a handicap match also involving Lio Rush, who was the one pinned. Lashley won it back on March 11, eventually losing it to Bálor again at WrestleMania 35 on April 7. After the event, his partnership with Rush ended. After feuds with Braun Strowman and Rusev, Lashley started teaming with MVP in May 2020. They were later joined by Shelton Benjamin and Cedric Alexander and created a stable known as The Hurt Business. At Payback on August 30, he defeated Apollo Crews to win his second United States Championship. At Elimination Chamber on February 21, he lost the title to Riddle in a triple threat match also involving John Morrison. On the March 1 episode of Raw, Lashley defeated The Miz in a lumberjack match to win his first WWE Championship. He went on to keep his title against Drew McIntyre, Braun Strowman, Kofi Kingston, and Goldberg. On September 13, after successfully defending it against Randy Orton, he lost it to Big E, who cashed in his Money in the Bank briefcase. In a match against Brock Lesnar at the Royal Rumble on January 29, 2022, Lashley won his second WWE Championship after Roman Reigns interfered. He lost it to Lesnar at Elimination Chamber on February 19 after suffering a (kayfabe) concussion in the Elimination Chamber match. At Money in the Bank on July 2, he defeated Theory to win his third United States Championship. On October 10, he lost it to Seth \"Freakin\" Rollins after being attacked by a returning Brock Lesnar before the match. On the WrestleMania edition of SmackDown on March 31, 2023. he won the André the Giant Memorial Battle Royal. In the 2023 WWE Draft, he was drafted to SmackDown. There he went on to create the stable The Pride with The Street Profits (Angelo Dawkins and Montez Ford). On August 16, 2024, his contract with WWE ended. === All Elite Wrestling (2024–present) === Lashley made his AEW debut at Fright Night Dynamite on October 30, where he attacked Swerve Strickland and reunited with MVP and Shelton Benjamin. They reformed The Hurt Business, now known as \"The Hurt Syndicate\". On the January 22, 2025 episode of Dynamite, Lashley and Benjamin defeated Private Party (Isiah Kassidy and Marq Quen) to win the AEW World Tag Team Championship, the first title in AEW for both men. ==Acting== Film Year Title Role Notes 2009 The Way of War Tattooed Hispanic Man 2010 Beatdown Lucius 2011 Blood Out Hector 2011 Walk-ins Welcome Felix 2022 Green Ghost and the Masters of the Stone Television Year Title Role Notes 2007 Deal or No Deal Himself 2016 Rush Hour Bar Thug 2024 Celebrity Family Feud Himself Part of Team Men of WWE with The Street Profits (Montez Ford and Angelo Dawkins), Austin Theory and LA Knight. Music videos Year Song Artist Role 2012 Nightmare Kasland Asylum Orderly ==Mixed martial arts record== |- |Win |align=center|15–2 |Josh Appelt |Submission (rear-naked choke) |Bellator 162 | |align=center|2 |align=center|1:43 |Memphis, Tennessee, United States | |- |Win |align=center|14–2 |James Thompson |TKO (punches) |Bellator 145 | |align=center|1 |align=center|0:54 |St. Louis, Missouri, United States | |- |Win |align=center|13–2 |Dan Charles |TKO (punches) |Bellator 138 | |align=center|2 |align=center|4:14 |St. Louis, Missouri, United States | |- |Win |align=center|12–2 |Karl Etherington |TKO (submission to punches) |Bellator 130 | |align=center|1 |align=center|1:31 |Mulvane, Kansas, United States | |- |Win |align=center|11–2 |Josh Burns |Submission (rear-naked choke) |Bellator 123 | |align=center|2 |align=center|3:54 |Uncasville, Connecticut, United States | |- |Win |align=center|10–2 |Tony Melton |Decision (unanimous) |Xtreme Fight Night 15 | |align=center|5 |align=center|5:00 |Catoosa, Oklahoma, United States | |- |Win |align=center|9–2 |Matthew Larson |Submission (rear-naked choke) |GWC: The British Invasion: U.S. vs. U.K. | |align=center|1 |align=center|1:38 |Kansas City, Missouri, United States | |- |Win |align=center|8–2 |Kevin Asplund |Submission (americana) |Titan FC 25 | |align=center|2 |align=center|1:23 |Fort Riley, Kansas, United States | |- | Loss |align=center|7–2 |James Thompson |Decision (unanimous) |Super Fight League 3: Lashley vs. Thompson | |align=center|3 |align=center|5:00 |New Delhi, India | |- |Win |align=center|7–1 |Karl Knothe |Submission (americana) |Shark Fights 21: Knothe vs. Lashley | |align=center|1 |align=center|3:44 |Lubbock, Texas, United States | |- |Win |align=center|6–1 |John Ott |Decision (unanimous) |Titan FC 17 | |align=center|3 |align=center|5:00 |Kansas City, Kansas, United States | |- |Loss |align=center|5–1 |Chad Griggs |TKO (doctor stoppage) |Strikeforce: Houston | |align=center|2 |align=center|5:00 |Houston, Texas, United States | |- |Win |align=center|5–0 |Wes Sims |TKO (punches) |Strikeforce: Miami | |align=center|1 |align=center|2:06 |Sunrise, Florida, United States | |- |Win |align=center|4–0 |Bob Sapp |TKO (submission to punches) |FFI: Ultimate Chaos | |align=center|1 |align=center|3:17 |Biloxi, Mississippi, United States | |- |Win |align=center|3–0 |Mike Cook |Technical Submission (guillotine choke) |MFC 21 | |align=center|1 |align=center|0:24 |Enoch, Alberta, Canada | |- |Win |align=center|2–0 |Jason Guida |Decision (unanimous) |SRP: March Badness | |align=center|3 |align=center|5:00 |Pensacola, Florida, United States | |- |Win |align=center|1–0 |Joshua Franklin |TKO (doctor stoppage) |MFA: There Will Be Blood | |align=center|1 |align=center|0:41 |Miami, Florida, United States | ==Championships and accomplishments== ===Amateur wrestling=== * International Federation of Associated Wrestling Styles ** NYAC Christmas Tournament Senior Freestyle Silver Medalist (2001) * International Military Sports Council ** CISM Armed Forces Championships Senior Freestyle Gold Medalist (2003) ** CISM Armed Forces Championships Senior Freestyle Silver Medalist (2002) ** CISM Military World Championships Senior Freestyle Silver Medalist (2002) * USA Wrestling ** Third in the USA World Team Trials Senior Freestyle (2003) * National Association of Intercollegiate Athletics ** NAIA All-American (1995, 1996, 1997, 1998) ** NAIA Collegiate National Championship (1996, 1997, 1998) * Kansas Wrestling Coaches Association ** KWCA Collegiate Wrestler of the Year (1998) * National High School Coaches Association ** NHSCA Senior All-American (1994) * Kansas State High School Activities Association ** KSHSAA 6A All-State (1993, 1994) ** KSHSAA 6A High School State Championship (1994) ** KSHSAA 6A High School State Championship Runner-up (1993) ===Mixed martial arts=== * Shark Fights ** Shark Fights Heavyweight Championship (1 time) * Xtreme Fight Night ** XFN Heavyweight Championship (1 time) ===Professional wrestling=== * All Elite Wrestling ** AEW World Tag Team Championship (1 time, current) – with Shelton Benjamin * Alabama Wrestling Federation ** AWF Tag Team Championship (1 time) – with The BoogeymanAWF Results from 3/14/2015. alabamawrestlingmag.com (March 18, 2015)AWF News! – Alabama Wrestling Mag. Facebook. Retrieved on October 24, 2015. * Italian Wrestling Superstar ** IWS Heavyweight Championship (1 time) * Pro Wrestling Illustrated ** Most Improved Wrestler of the Year (2006) ** Rookie of the Year (2005) ** Ranked No. 3 of the top 500 singles wrestlers in the PWI 500 in 2021 * Total Nonstop Action Wrestling/Impact Wrestling ** TNA/Impact World Heavyweight Championship (4 times) ** TNA King of the Mountain Championship (1 time, last) ** TNA X Division Championship (1 time) ** TNA Championship Series (2009) ** TNA Joker's Wild (2015) * World Wrestling Entertainment/ WWE **WWE Championship (2 times) **ECW Championship (2 times) ** WWE Intercontinental Championship (2 times) ** WWE United States Championship (3 times) ** André the Giant Memorial Battle Royal (2023) **Slammy Award (1 time) *** Trash Talker of the Year (2020) from The Hurt Business ==References== == Other websites == * *Lashley Nutrition - official website *TNA profile * Category:1976 births Category:Living people Category:African-American movie actors Category:African-American wrestlers Category:All Elite Wrestling people Category:American mixed martial artists Category:American professional wrestlers Category:Former WWE wrestlers Category:Military people from Kansas Category:Sportspeople from Kansas Category:Total Nonstop Action Wrestling alumni",
 "title": "Bobby Lashley"
}