{
 "id": "612910",
 "text": "is a Japanese anime drama movie. It was released in 2016. The director of the movie was Makoto Shinkai and it was produced by Noritaka Kawaguchi and Genki Kawamura. The music for the movie was written by Radwimps. The movie is about two high school students that can switch bodies. One lives in rural Japan and one lives in Tokyo. The movie stars Ryunosuke Kamiki, Mone Kamishiraishi, Masami Nagasawa and Etsuko Ichihara. Shinkai wrote a book that was based on the movie. The book was released one month before the movie was released. Your Name was shown at Anime Expo 2016 in Los Angeles. It was played in Japan on 26 August 2016. The movie made a lot of money. It became the fourth-highest- earning movie in Japan, the seventh-highest-earning animated movie, the highest-earning anime movie, and the fifth-highest earning movie in the world that was not in English. Movie critics liked the movie, saying that the animation and emotion were very well done. The movie won the \"Best Animated Feature Film\" prize. It won at the 49th Sitges Film Festival, the 2016 Los Angeles Film Critics Association Awards and the 71st Mainichi Film Awards. The movie was also nominated for the 40th Japan Academy Prize. ==Plot== Mitsuha is a high school girl living in the town of Itomori located in Hida region. She works as a maiden at the family temple. She begins having dreams, where she is a boy living in Tokyo. She learns that she wrote \"Who are you?\" on a notebook. Taki is a high school boy living in Tokyo. He is also having dreams where he is Mitsuha. He learns that they can switch bodies when they wake up. They begin communicating with each other. Taki leaves notes in Mitsuha's notebook and Mitsuha leaves memos in Taki's phone. They change each other's lives during this time. When Taki is being Mitsuha, he goes with Mitsuha's grandmother and sister to a shrine far away from town. They leave kuchikamizake there as an offering to the village god. Mitsuha's note on Taki's phone tells Taki that a comet will pass Japan in the sky. Taki wakes up in his body. He tries to call Mitsuha on his cell phone but it could not reach, before the body switching ends. Taki, and his friends, Miki and Tsukasa, arrive in the region, where they learn that the town was destroyed by a comet and all memos of Mitsuha were erased from Taki's phone. They also learn that five hundred people were listed who used to live there. To reconnect his mind with Mitsuha's, Taki goes to the shrine, drinks her sake bottle and ends up remembering her past. Taki wakes up in Mitsuha's body and learns that their dreams will fade away. Mitsuha and her friends plan to help everyone evacuate the town, by hijacking the broadcast station. Taki notices that he is in Mitsuha's body and Mitsuha in Taki's body. They unite at the shrine, but they are at three years apart. When twilight (kataware-doki) occurs, they see each other. They try to write each other's name on their hands, but Mitsuha disappears and twilight ends. Taki no longer remembers Mitsuha, after getting his body back. Before returning to her family, Mitsuha realizes that her memories of Taki faded away, and finds a writing that he wrote \"I love you\" instead of his name. Despite the successful evacuation, the comet falls through Japan and destroys the town, while Taki wakes up in the present day. Five years later, Taki has been graduated from university. He researches about the history of the town, and learns that everyone survived after the evacuation, under orders from the mayor and Mitsuha's father. Taki and Mitsuha leave the train station and arrive at the staircase. They see each other and recognize themselves they met before and ask for their names. ==Production== Shinkai began writing the script for the movie in 2014. He said that he used one of his other movies, Cross Road to create the story. The story was inspired by many things. It was inspired by Shūzō Oshimi's Inside Mari, Ranma ½, a novel from the Heian period called Torikaebaya Monogatari, and a short-story by Greg Egan called The Safe-Deposit Box. Shinkai also said that after the sinking of MV Sewol in 2014, he wanted to make a story about a disaster. Itomori is a fictional town, located near Lake Suwa in Nagano. The village shrine area was based on Aogashima Island. Many other places in the movie are real, including Hida City Library. The production of the movie took two years. The story and characters were created from May to September 2014. Shinkai did this with Genki Kawamura. When Makoto Shinkai told the people working at Toho about the movie on 14 September 2014, the movie was called . After, the movie was also called and , then it became Kimi no Na wa. Yume to Shiriseba came from a waka (Japanese poem) that was written by Ono no Komachi. The animation for the movie began in February 2015 and ended twelve months later. It was released in July 2016. ==Music== The producers of the movie asked Radwimps to make the music for the movie. The music was finished in March 2015. Yojiro Noda (the lead singer) created the music for Your Name. Shinkai asked Noda to create the music so that it will go along with the speech of the characters. The movie features the songs below that were performed by Radwimps: * * * * ==Release== The movie was first shown at Anime Expo on 3 July 2016 in Los Angeles, California. Later, the movie came out in theatres in Japan on 26 August 2016. The movie was going to be released in 92 countries. The movie came out in China on 2 December 2016. It was released by Huaxia Film Distribution and Access Bright. The movie came out in Los Angeles for one week, from 2 December to 8 December 2016. This was so that it could qualify for an Academy Award. The movie came out in Australia on 24 November 2016 and it came out in New Zealand on 1 December 2016. They were both released by Madman Entertainment. In the United Kingdom, the movie came out on 18 November 2016. It was released by Anime Limited. On 17 January 2017, Funimation said that the movie was going to be released in North America on 7 April 2017. ===Home media=== The movie came out in 4KHD, Blu-ray and DVD. It came out on these on 26 July 2017 in Japan and was released by Toho Pictures. It came out in Regular, Special, and Collector's versions. On 1 July 2017, Funimation said at Anime Expo that the movie would be released on Blu-ray and DVD before the end of 2017. They did not say when it would be released though. They released it on 7 November 2017. ==Media== The movie was made into a book and a manga series. It was written by Shinkai. The book has the same story as the movie. It came out one month before the movie came out. The movie will also be made into a live-action movie. On 27 September 2017, J.J. Abrams and Eric Heisserer said that they were working on a remake of Your Name. They also said that Paramount Pictures and Bad Robot Productions would release the movie. Toho will release the movie in Japan. Some people were worried that the live-action movie would be like the Ghost in the Shell live-action movie. They were worried that there would be whitewashing in the movie. Eric Heisserer said that the Japanese movie makers wanted Your Name to have a Western viewpoint. ==Reactions== Your Name made a lot of money, especially in Japan. In Japan, the movie made ¥23 billion, or around US$192 million. The movie made the second-most money in Japan for a Japanese-made movie. The movie in first was Spirited Away. It also made the fourth-most money ever in Japan. Your Name was the first anime movie that was not directed by Hayao Miyazaki to make more than $100 million (around ￥10 billion) in Japan. It was near the top of the box office in Japan for twelve weekends. This broke a lot of records. It was at the number one spot for nine weekends. In the last weekend of October, it went back to the top for three more weeks. The movie also made a lot of money in other countries. Your Name earned the most money for a Japanese movie in China. It also made the most money for a 2D animated movie in China. ==References== ==Other websites== * Official website * Official website * * * * Category:2016 drama movies Category:2010s anime Category:Japanese fantasy movies Category:Japanese drama movies Category:Japanese-language movies Category:2016 fantasy movies Category:Time travel movies Category:2016 animated movies Category:Movies about dreams",
 "title": "Your Name"
}