{
 "id": "612990",
 "text": "Cybercrime is crime that uses a computer and computer network. There are many types of cybercrimes. These include doxxing, hacking, copyright issues, cyberterrorism and fraud.Anderson, Ross, et al. \"Measuring the cost of cybercrime.\" The economics of information security and privacy. Springer Berlin Heidelberg, 2013. 265-300. Many countries have laws against many types of online pornography.Urbas, Gregor. \"Protecting children from online predators: The use of covert investigation techniques by law enforcement.\" Journal of Contemporary Criminal Justice 26.4 (2010): 410-425 Some other actions can also be illegal such as cyberbullying, spying, child grooming or hebephilic behavior.Edwards, Susan SM. \"Cyber-Grooming Young Women for Terrorist Activity: Dominant and Subjugated Explanatory Narratives.\" Cybercrime, Organized Crime, and Societal Responses. Springer International Publishing, 2017. 23-46. Some governments have agencies that deal with computer crimes.Levi, Michael, and Matthew Leighton Williams. \"Multi-agency partnerships in cybercrime reduction: Mapping the UK information assurance network cooperation space.\" Information Management & Computer Security 21.5 (2013): 420-443 Cybercrime can include many different types of profit-driven criminal activity, including ransomware attacks, email and internet fraud, and identity fraud, as well as attempts to steal financial accounts, credit card or other payment card information. Cybercriminals may also target an individual's private information, as well as corporate data for theft and resale. Cybercrime attacks can begin wherever there is digital data, opportunity and motive. Cybercriminals include everyone from the lone user engaged in cyberbullying to state-sponsored actors, like China's intelligence services. Cybercrimes generally do not occur in a vacuum; they are, in many ways, distributed in nature. That is, cybercriminals typically rely on other actors to complete the crime. This is whether it's the creator of malware using the dark web to sell code, the distributor of illegal pharmaceuticals, using cryptocurrency brokers to hold virtual money in escrow or state threat actors relying on technology subcontractors to steal intellectual property (IP). == Cyber crimes can generally be divided into two categories: == Crimes that target networks or devices Crimes using devices to participate in criminal activities Viruses Phishing Emails Malware Cyberstalking DoS Attacks Identity theft == References == == Other page == *Computer security Category:Computing Category:Security Category:Types of crime",
 "title": "Cybercrime"
}