{
 "id": "613051",
 "text": "Piyaa Albela () is an Indian soap opera. It is made by Rajshri Productions. It is broadcast on Zee TV every Mon-Fri at 08:30 pm IST. The show is a love story, a modern telling of the love between Menaka and Vishwamitra. The main actors, Akshay Mhatre and Sheen Das, started their careers in Indian television with this show. Producer Sooraj Barjatya worked for about eight years on Piyaa Albela. The show began on March 6, 2017, replacing a popular Zee TV show, \"Jamai Raja\". == Summary == Piyaa Albela is a modern-day telling of the classic love story of Menaka and Vishwamitra. The story is about Naren and Pooja, who are very different from each other. * Naren is on the path of spirituality and meditation. He studies psychology, more in the classroom of his mind and soul than in real-life college. He barely keeps up with current events on the news. He neglects his appearance and his behavior is strange, so others look upon him as anti-social, keeping to himself. As a \"poor little rich boy\" he has rebelled against his parents, who do not understand him. * Pooja is the opposite of Naren. She is warm, confident, and a \"people\" person. Her talents include being a karate champion who can straighten out wayward boys who try to get fresh with her, and dancing at the cultural nights of her university. * Naren's parents do not understand their son. They think Pooja is the answer to Naren's problems. ==Plot== The show revolves around Naren Vyas (Akshay Mhatre) and Pooja Goel (Sheen Dass). Naren is on the path of spirituality, living as a recluse and cut off from worldly activities. Lost in his own world of meditation, he is a concern for his mother Supriya Vyas and father Harish Vyas, who belong to the affluent Vyas family. Pooja, on the other hand, is warm, confident and a complete people's person who can take care of herself and is deeply rooted in family values. Naren's parents want Pooja to be Naren's caretaker. They ask Pooja to bring Naren back to the mortal, selfish world. Initially thinking Naren to be another rich boy, Pooja finally starts appreciating his genuine selfless nature. Naren and Pooja become best friends, and Pooja falls in love with him after he saves her from being raped by his cousin Rahul. Naren's wedding is fixed with Surbhi Singhania, the daughter of Harish's friend Yash Singhania, while Pooja has agreed to marry Dr. Anand. Naren's cousin Mayank falls in love with Pooja. His love for Pooja turns into an obsession, and he kills Anand on Pooja's wedding day. To save Pooja from humiliation, Naren steps in and marries her, while Surbhi ends up marrying Rahul. Soon, Naren realizes that he also loves Pooja. Pooja finds out that her horoscope has some problems and feigns insulting Naren and his family so they can separate. Supriya meets with an accident trying to stop Pooja and becomes mentally unstable. ===One year later=== Pooja returns to Naren's life as Mrs. Kapoor. Naren, who was a simple and sober man, has become a ruthless womanizer. Pooja's friend, Mr Kapoor, tries to solve Pooja and Naren's misunderstanding but Rahul misleads Ashish into believing that Pooja has fallen in love with him. Ashish joins hands with Rahul and Surbhi. Naren falls in their trap and proposes marriage to Surbhi. Pooja records Ashish's confession and stops Surbhi and Naren's wedding. A guilt- stricken Naren apologises to Pooja but Ashish comes between and tries to kill Naren. Pooja shoots Ashish and Naren takes the blame. However, Kapoor reaches the court on time and saves Pooja. Pooja and Naren's wedding preparations begin but Pooja meets with an accident while praying for Supriya's recovery. Supriya recovers and is able to stop Mayank's father Rakesh from attacking Pooja. After her accident, Pooja starts behaving like a child. Her uncle, Satish Gupta takes Pooja with him to their hometown Dehradun. To stop her from being sent to a mental asylum, Naren marries her and starts taking care of her. It is revealed that Pooja has been feigning her illness to save Naren's grandfather from Kapoor who has been threatening to expose that Naren is not the biological son of Supriya and Harish. Kapoor kidnaps Pooja who finally kills him to protect Kashinath. Planning on ending her act, Pooja's half sister Naina Goel reveals Pooja's secret to Naren instead causing him to become furious with Pooja. Naina sets her eyes on Naren wanting to take revenge on Pooja who she thinks was always preferred by their father. Naren's health deteriorates as a result of his excessive drinking. Pooja finds out Naren's real mother, Chandrika who is a prostitute. To hide this truth from the Vyas family, Satish and Pooja lie that Pooja is Chandrika's illegitimate daughter while Naina is Satish's legitimate niece. The Vyas family, except for Kashinath, start hating Pooja. Chandrika is allowed to stay with the family in the Vyas Mansion but is blamed for an attack on Supriya. The misunderstanding leads to Pooja and Chandrika leaving the house. ===Six months later=== Mayank is dead. Pooja lives in Krishnapuri, a red-light area with Chandrika. Naren is standing for elections and visits Pooja everyday at Krishnapuri. Everyone thinks that Naren does this because he loves Pooja but only Chandrika, the Vyas family and Naren's assistant Danish know that Naren in fact hates Pooja. Pooja continues to fulfil her duty of a wife. Naren hires a shooter to kill Pooja. On a trip to Dehradun, Naren realises Pooja's trust in him and calls the sharpshooter to call off the attack. Naren and Pooja consummate their marriage. At Naren's election rally, Pooja is shot at and Naren discovers that a woman called the sharpshooter to carry put the attack. He realises Pooja was aware of his initial plan and apologises but Pooja loses all trust in him. However, they team up to expose Naina as the culprit behind causing Supriya's attack and resulting paralysis, framing Chandrika for the attack, killing Mayank, abducting a heavily pregnant Surbhi and planning to kill Rahul and marry Naren. Kashinath reveals that Naren is Chandrika's son. A heart-broken Naren leaves the Vyas Mansion. At an ashram, Naren and Pooja renew their marital vows. They meet Bela and Praveen, another newly-wed couple. Bela is an introvert while Praveen is an extrovert who often acts silly. Instigated by Rahul, Harish decides to kill Naren but Harsha, Naren's aunt, warns Pooja and Naren. Naren and Praveen meet with an accident and Praveen dies while Naren, needing a heart-transplant, receives Praveen's heart. A strange change appears in Naren's behaviour as he starts behaving like Praveen. It is revealed that Bela is planning to take revenge from Praveen's parents as they insulted her parents for drowny results in Bela's mother's death and her father's blindness. Under Bela's spell, Naren abducts Praveen's parents and Bela kills them but spares Naren for saving her father. Bela, then, surrenders to the police. Naren's adoptive sister Meghna (Sangeita Chauhan) is blind and is about to marry Kunal Goenka, the man she loves. On their wedding day, Meghna is raped and suspicion falls on Naren as he was absent from the venue. Pooja saves Naren from the accusations. The next suspicion falls on Pooja's cousin Anuj Gupta, Danish, Rahul and Kunal. The real culprit tries to kill Surbhi and Pooja as they discover his real identity. Surbhi loses her child. It is revealed that Rahul's father, Hardik Vyas is the real culprit. Hardik is arrested and Meghna and Kunal are married. Angraj (Sahil Uppal), Harish and Supriya's biological son, enters the Vyas Mansion. Angraj sets his eyes on Pooja, who he used to eve-tease and harass before her marriage, and starts plotting to kill Naren. On the day of Pooja's birthday, Anuj shoots Angraj trying to save Pooja but Naren shoots Anuj to defend his half brother resulting in both Angraj and Anuj dying causing tension between Naren and Pooja's families. Angraj is revealed to be alive and gets plastic surgery, and returns with Naren's face and kidnaps the real Naren. Angraj (as Naren) takes Naren's place at home. After an interesting twist in the plot, Supriya herself kills Angraj. The story ends with Supriya managing Angraj's foundation, Rahul and Surbhi having a baby boy, Anuj's wife Rachel (Sandhya Mehta) marries Rahul's half brother Arjun Vyas (Khushwant Walia), and Pooja gets pregnant with Naren's child. ==Cast== ===Main cast=== *Akshay Mhatre as Naren Harish Vyas (Main Male lead) *Sheen Das as Pooja Naren Vyas (Main Female lead) ===Other regular actors=== *Ankitt Vyas as Rahul Vyas,, Naren's cousin *Ritu Chauhan as Surbhi Rahul Vyas, Naren's ex-fiancée, Rahul's wife and Yash's daughter *Avinash Wadhawan as Harish Vyas, Naren's father *Jyoti Gauba as Supriya Harish Vyas, Naren's mother *Tusshaar Khanna as Mayank Kaushal, Naren's cousin *Khalid Siddiqui as Ashish Kapoor *Saptrishi Ghosh as Yash Singhania/Bhola Babu, Harish's friend *Mamta Verma as Shilpa Singhania, Surbhi's mother *Vijay Kalvani as Hardik Vyas, Naren's paternal uncle *Parul Chaudhary as Neelima Vyas, Naren's paternal aunt *Kuldeep Mallik as Satish Gupta, Pooja's maternal uncle *Chitrapama Banerjee as Kusum Satish Gupta, Pooja's maternal aunt *Rohan Rai as Anuj Satish Gupta, Pooja's cousin *Farukh Saeed as Rakesh Kaushal, Mayank's dad/Bandhu *Chaitrali Gupte as Harsha Kaushal, Naren's paternal aunt and Mayank's mother *Sandhya Mehta as Rachel/Ritu *Rishabh Shukla as Babaji/Guruji (Dead) *Suhani Dhanki as Chandani, a harlot *Kanwarjit Paintal as Kashinath Vyas, Naren's grandfather *Suraj Kakkar as Dr. Anand, (Dead) Pooja's ex-fiancé ==Soundtracks== ==References== ==Other websites== * * Category:Hindi-language television series Category:Soap operas Category:2017 Indian television series debuts",
 "title": "Piyaa Albela"
}