{
 "id": "613480",
 "text": "The Type 56 is a Chinese assault rifle which is a copy of the Soviet AK-47 assault rifle. The Type 56 was first used by the North Vietnamese Army and Viet Cong during the Vietnam War along with the Soviet AK-47 and AKM assault rifles. The Type 56 is used by many armies and battlefields in Africa, Western Asia and Asia. == Variants == * Type 56: Copy of the AK-47. * Type 56-1: Copy of the AKS-47. * Type 56-2: Same as the Type 56-1 but with a side folding stock instead of a under folding stock. == Users == The Type 56 assault rifle is used in many countries. These include: ==Users== * * Jones, Richard D. Jane's Infantry Weapons 2009/2010. Jane's Information Group; 35 edition (January 27, 2009). . Locally produced under small modification of the Albanian Army needs. Main armament of the army until recently when it's being replaced with ARX-160, and M4A1. * * * :File:3rd Company, Beninese Army sergeant demonstrates AK-47 disassembly at Bembèrèkè 2009-06-12.JPG * Boko Haram : Type 56 and Type 56-1 * :File:Infantería de marina boliviana encima de lanchas inflables.jpg * * : Burundian rebels. * Working Papers . Small Arms Survey (2011-12-01). Retrieved on 2012-05-20. * * * :File:Congolese Light Infantry Battalion training at Camp Base, Kisangani 2010-05-05 2.JPG * * * : Used by Croatia in its war of independence. * :File:2013 09 10 Belet Weyne Snapshots 3 E.jpg (9720302735).jpg * * * * : Purchased in the 1990's and used by Finnish Army rerserve personnel. Now in long-term storage. * :File:A Gambian soldier fires a hammered pair, or two shots in rapid succession, during combat marksmanship training July 15, 2012, in Thies, Senegal, as part of exercise Western Accord 2012 120715-M-XI134-1812.jpg *:File:Iranian soldier at Iraq-Iran border, Wasit Province 2008-09-11.JPG * ** :File:Ezidi Peshmerga soldiers at their base in the Sinjar Mountains, under the command of Qasim Shesho 16.jpg * * * * * * * * : Used by the Nepalese Army and formerly by the People's Liberation Army rebels * : Contras. * :File:Nigerien soldier Komadogou 2016.jpg * * * Rwanda . * * * :File:2014 02 21 SNA PASSOUT PARADE 08 (12694506064).jpg * : South Sudan Liberation Movement, South Sudan Democratic Movement, Sudan People's Liberation Army and Lou Nuer militias. * During the war that ended on 19th May 2009 between the Sri Lankan government armed forces and the LTTE terrorist group. * * * ** Lord Resistance Army * * : Captured from Viet Cong and North Vietnamese Army during the Vietnam War. * :File:Yemeni soldiers from the 1st Armoured Division.JPG * == References == Category:Assault rifles",
 "title": "Type 56 assault rifle"
}