{
 "id": "613555",
 "text": "George Theophilus Walker (June 27, 1922 – August 23, 2018) was an African- American composer, educator and autobiographer. He was the first to win the Pulitzer Prize for Music. He received the Pulitzer for his work Lilacs in 1996.De Lerma, Dominique-Rene. \"African Heritage Symphonic Series\". Liner note essay. Cedille Records CDR061.Walker, George (2009) Reminiscences of an American Composer and Pianist, Scarecrow Press, p. 153 == Early life == Walker was born in Washington, D.C.. He studied at Oberlin College. == Career == Walker taught music at Columbia University, Wayne State University, Wellesley College, Temple University, Washington University in St. Louis, Williams College and Montclair State University. In 1946, Walker composed his String Quartet no. 1. A string orchestra arrangement of the second movement of that work received its world premiere in a radio broadcast that was conducted by pianist Seymour Lipkin. Walker was elected to the American Academy of Arts and Letters in 1999. The following year, Walker was inducted into the American Classical Music Hall of Fame. Washington, D.C. Mayor Marion Barry proclaimed June 17, 1997 as “George Walker Day”. in the nation's capitol. His autobiography, \"Reminiscences of an American Composer and Pianist\", was released in 2009 by Scarecrow Press. == Personal life == Walker was the father of two sons, violinist and composer Gregory T.S. Walker,Walker, George (2009) Reminiscences of an American Composer and Pianist, Scarecrow Press, p. 156 and playwright Ian Walker. Walker died on August 23, 2018 from a fall at a hospital in Montclair, New Jersey at the age of 96.George Walker, Trailblazing American Composer, Dies At 96 == References == == Other websites == * George Walker official website * A 2017 Conversation with George Walker (includes video excerpts) *George Walker interview by Bruce Duffie *2012 George Walker interview by Ethan Iverson *George Theophilus Walker, African American Composer & Pianist at AfriClassical.com *George Walker, Composer Documentary produced by NJTV Category:Pulitzer Prize winners Category:1922 births Category:2018 deaths Category:Columbia University faculty Category:American autobiographers Category:American composers Category:Academics from Washington, D.C.",
 "title": "George Walker (composer)"
}