{
 "id": "613866",
 "text": "The Luo (also called Joluo or Jonagi/Onagi, singular Jaluo, Jaonagi or Joramogi/Nyikwaramogi, meaning Ramogi's heirs) are an ethnic group in western Kenya, northern Uganda, and in Mara Region in northern Tanzania. They are part of a larger group of the linguistic Luo peoples who inhabit an area ranging from South Sudan, South-Western Ethiopia, Northern and Eastern Uganda, South- Western Kenya and North-Eastern Tanzania. The Luo are the fourth largest ethnic group (15%) in Kenya, after the Kikuyu (22%), the Kalenjin (18%) and the Luhya (16%). The Luo and the Kikuyu inherited the most of political power in the first years following Kenya's independence in 1963. The Luo population in Kenya was estimated to be 2,185,000 in 1994 and 3.4 million in 2010 according to Govt census. They are mostly fishermen and a number are farmers but in the colonial era, they had a mixed economy where livestock and farm products were both used for economic and divine activities. They migrated from Bahr-El-Ghazal a sub-tributary of R.Nile and first settled at Pukungu Pakwach in Uganda and later dispersed to Kisumu in Kenya and Tanzania near Lake Victoria. Their 'state' leaders who lead groups of related clans are called Ruoth meaning chief and their national leaders today are Jodongo - Luo Council of Elders who are led by a Ker meaning king. There religion these days are Christianity, African Traditional Religion and some are Muslim. Their god was called Nyasaye whom used to stay at Ramogi Hills. Their initiation used to be done on teen boys who used to get their 6 lower teeth removed,therefore they used to be regarded as men. These days they have stopped the practice and have copied the Kikuyu and circumsise the foreskin. == Notable People == # Jaramogi Oginga Odinga one of Kenya's founding fathers # Barrack Obama former President of The U.S # Lupita Nyong'o Award winning actor in the Oscars # Raila Odinga former Prime Minister of Kenya # Raymond Omollo Permanent Secretary (PS) Interior #Tito Okello former Uganda President #Elijah Omolo Agar one of Kenya's founding fathers == References == Category:Ethnic groups in Uganda Category:Ethnic groups in Kenya",
 "title": "Luo people"
}