{
 "id": "61401",
 "text": "Frosted Flakes (North American countries) or Frosties (UK, Commonwealth of Nations and EU countries) is a cereal like Corn Flakes from Kellogg's, but coated with frosted sugar. Frosted Flakes are also available with apple pieces, banana pieces or coated in chocolate. In 2004, Kellogg's introduced a 1/3 Less Sugar recipe. Tony the Tiger has been the mascot in Frosted Flakes since it was first introduced in 1952 as Sugar Frosted Flakes (the word \"sugar\" was dropped in the mid-1970s), and he is known for saying the cereal's slogan: \"They're grrreat!\". Tony the Tiger was originally voiced by Thurl Ravenscroft, who continued providing his voice until his death in 2005. The character is currently voiced by former professional wrestling play-by-play announcer Lee Marshall, starting in January 2006. == Taglines == This cereal has had many taglines, but the classic, \"They're grrreat!\" has always been used along with the others. * They're more than good, they're grrreat! * They're gonna taste great! * Bring out the tiger in you! (1980's) * The taste adults have grown to love. (1980's - 1990's) * Earn your stripes! * Put a tiger on your team! * Show the world...you've got game. * Show your stripes! * They're grrreat! == Trivia == * Kellogg's was a major sponsor of Adventures of Superman throughout most of the 1950s. Many of the Frosted Flakes commercials featuring the show's star George Reeves are considered classics and are available on the DVD release of the series' first season. * Frosted Flakes has been the primary sponsor of the NASCAR Nextel Cup #5 Hendrick Motorsports Chevrolet since 2000. * The term \"Frosted Flakes\" can be used by any company making a similar product. However, the term \"Frosties\" is a registered trademark and so cannot be used by others. * This product is called \"Zucaritas\" in Mexico and other Spanish-speaking countries. * In Brazil, Frosties is called \"Sucrilhos\". * Because of the not so specific slogan, it has been parodied many times, such as in Family Guy == Other websites == * Official website of Frosted Flakes * Official website of Frosties * Advert on The Link Portal * Nutrition facts for Frosted Flakes * Frosted Flakes Cereal Science Report Category:Breakfast cereals",
 "title": "Frosted Flakes"
}