{
 "id": "61421",
 "text": "Brigham Young University (BYU) is an American university. It is named after the second Latter-day Saints prophet, Brigham Young. The school is in Provo, Utah. Their team colors are royal blue and white. Their mascot is the cougar. Their rivals are University of Utah. Brigham Young University (BYU) is often called “The Y” and is a private research university. The Church of Jesus Christ of Latter-day Saints (LDS Church) owns and runs the school. It is the biggest church school and third biggest private university in the United States with 33,511 students. About 99 percent of the students are part of the LDS Church, and 32% of them are from Utah. BYU students have to live an honor code, a set of rules on behavior. They must be honest in their work, follow dress rules, have no sex outside of marriage, and not take illegal drugs or drink alcohol. 66% of students (88 percent of men, 39 percent of women) start school late or take a break from school to be Mormon missionaries. It is cheaper to study at BYU than at other private universities because most of the cost of attending BYU is paid for by the LDS church. BYU has many topics to study. This includes liberal arts, engineering, agriculture, management, physical science and mathematical sciences, nursing, and law. The university is grouped into 11 smaller parts that create their own rules on how to be allowed to study a topic. The university also has two satellite campuses(a small part of the campus that is far away from the rest of the campus), one in Jerusalem and one in Salt Lake City. The main university is run by the Church Educational System (CES), and also runs two other schools in Hawaii and Idaho. The main focus of the school is on undergraduate education, with 187 undergraduate majors and 110 undergraduate minors, but it also has 88 masters and 32 doctoral degree programs. BYU’s sports teams compete in Division I of the NCAA and are known as the BYU Cougars. BYU joined the Big 12 Conference in July 2023 after 12 years as a member of the West Coast Conference (WCC). During the university's time in the WCC, which does not run a football league, the Cougars played in the top level of college football, Division I FBS, as an independent (not in a conference). The only BYU sport not sponsored by the Big 12 is men's volleyball; that team plays in the Mountain Pacific Sports Federation. BYU’s sports teams have won 14 national championships. ==References== Category:Colleges and universities in Utah Category:Mormonism Category:Big 12 Conference Category:Provo, Utah Category:1875 establishments in the United States Category:19th-century establishments in Utah",
 "title": "Brigham Young University"
}