{
 "id": "614540",
 "text": "Stewiacke is a town located in southern Colchester County, Nova Scotia, Canada. The town was incorporated on August 30, 1906. ==History== Stewiacke was named in the language of the local Mi'kmaq First Nations and is a word meaning \"flowing out in small streams\" and \"winding river\" or \"whimpering or whining as it goes\". During the French and Indian War, the British built Fort Ellis in the area to protect New England Planters from Mi'kmaq raids. In the late 1990s, a tourism attraction named Mastodon Ridge opened near the town's highway exit, based on a local discovery of a mastodon skeleton. The Mastodon Ridge Complex features a craft store, toy store, a mini golf and interpretive centre which displays several of the mastodon's bones. Stewiacke is home to two bars, a pharmacy, a grocery store, a pizza store, numerous fast food restaurants, two gas stations, a hardware store, an audio-visual production company, an 18-hole golf course and a newly built elementary school that replaced two former local schools. Stewiacke is also home to a volunteer fire department that was the first department in North America to use specialized foam as a fire suppression agent. Alongside other achievements involving the use of certain fire apparatus. The town is noted as being located halfway between the North Pole and the Equator (Actually in Alton, Nova Scotia). Controversy in the past over this claim stems from the fact that the Earth is not a perfect sphere, and therefore the halfway mark lies approximately 16 km North of the 45th parallel. The town's most notorious event occurred on Friday April 12, 2001, when a local teenager, at home on a school in-service day, tampered with a railway switch on the CN Rail Halifax-Montreal mainline, causing Via Rail Canada's Ocean to derail several minutes later when it passed through the centre of the community. Several buildings and rail cars were destroyed and many people were injured, including some severely, although no fatalities resulted. The town is located in the Stewiacke Valley at the confluence of the Stewiacke and Shubenacadie River and is a service and support centre for local agricultural communities as well as a service exit on Highway 102. == Demographics == In the 2021 Census of Population conducted by Statistics Canada, Stewiacke had a population of living in of its total private dwellings, a change of from its 2016 population of . With a land area of , it had a population density of in 2021. == Parks == *Caddell Rapids Lookoff Provincial Park *Dennis Park ==References== ==Other websites== * Town of Stewiacke * Central Nova Tourist Association - official website Category:Towns in Nova Scotia Category:1906 establishments in North America Category:1900s establishments in Canada",
 "title": "Stewiacke"
}