{
 "id": "614517",
 "text": "Ludmya \"Mia\" Love (née Bourdeau; December 6, 1975 – March 23, 2025) was an American politician and commentator. She was a member of the U.S. House of Representatives for Utah's 4th congressional district from 2015 to 2019. She was a member of the Republican Party. She was the first Haitian American elected to Congress, the first Black American elected to Congress from Utah, and the first Republican black woman elected to Congress. Born to Haitian parents in the New York City borough of Brooklyn, Love was raised in Connecticut and graduated from the University of Hartford. Having moved to Utah in 1998, she was elected mayor of Saratoga Springs, Utah, in 2010. She was on its City Council before being elected mayor. She spoke at the 2012 Republican National Convention which made her well known across the country and Republican Party. That year, she ran for the U.S. House of Representatives in Utah's 4th congressional district, but lost to Democratic Party U.S. Representative Jim Matheson. She ran for the U.S. House again and was elected in 2014. During her time in congress, Love was known for supporting immigration reform and spoke out against President Donald Trump's political ideas. She also created laws that made it illegal for congress members to settle sexual harassment claims with taxpayer money and raised limits on how large community banks can grow. She was re-elected in 2016, but lost her re- election in 2018 to Democrat Salt Lake County Mayor Ben McAdams by 694 votes. After her political career, Love was hired by CNN as a political commentator in 2019. She also became a fellow at the University of Sydney and at Georgetown University. Love died from glioblastoma, a rare type of brain cancer, in March 2025. ==Early life== Love was born Ludmya Bourdeau on December 6, 1975, in Brooklyn, New York City. She was the daughter of Mary and Jean Maxime Bourdeau. Her parents emigrated together from Haiti in 1973. Her father had been threatened by corrupt police in Haiti, and her parents traveled to the United States on a tourist visa. Her father became a paint company manager, and her mother worked as a nurse.John Fund, \"Daughter of Haitian Immigrants Is GOP Congressional Nominee in Utah\", The Corner, National Review, April 22, 2012 Love's parents were able to get U.S. residency permits since Love was born in the United States. They later became U.S. citizens. When Love was five, her family moved from Brooklyn to Norwalk, Connecticut. Love went to Norwalk High School. She was raised as a Catholic. Love studied at the University of Hartford Hartt School on a scholarship. She graduated with a degree in musical theatre. == Early career == After college, Love worked at Sento Corporation and the Echopass Corporation. She was also a flight attendant with Continental Airlines. Love moved to Utah in 1998. Love became active in politics when she became the community spokesperson in Saratoga Springs, Utah to stop real estate developers of her neighborhood to spray against flies. In 2003, Love won a seat on the aratoga Springs City Council. She was the first female Haitian American elected official in Utah County. She took office in January 2004. She worked with other city council members to cut costs and helped lower the city's debt from $3.5 million to $779,000. After six years on the council, Love was elected mayor of Saratoga Springs. She was mayor from January 2010 to January 2014. During her term, Love led the city in dealing with natural disasters, including a wildfire and a mudslide. ==2012 U.S. House campaign== In 2012, Love ran for the United States House of Representatives in Utah's 4th congressional district. The district was created after the 2010 Census. She ran for the Republican nomination against lawyer Jay Cobb and state representatives Stephen Sandstrom and Carl Wimmer. She won the nomination on April 21, 2012, with over 70 percent of the vote. On December 15, 2011, six-term Democratic incumbent U.S. Represenative Jim Matheson of the state's 2nd congressional district had announced that he would run for the 4th congressional district seat as well. Love became well known on the national level during her campaign and had the support of 2012 Republican presidential nominee Mitt Romney and his wife Ann Romney, House Majority Leader Eric Cantor, U.S. Representative and 2012 Republican vice presidential nominee Paul Ryan, and Speaker of the House John Boehner. In 2012, the National Journal named Love one of ten Republicans to follow on Twitter. Love spoke at the 2012 Republican National Convention where she talked about the lessons she learned from her immigrant parents. She spoke out against then-President Barack Obama and said \"Mr. President, I am here to tell you we are not buying what you are selling in 2012\". CNN called Love as a \"rising star\". In November 2012, Love lost the general election to Jim Matheson by 768 votes out of 245,277 votes cast, a difference of 0.31%. Commentators thought Love ran a weak campaign because she switched campaign managers three times, was not focused on local issues, missed interviews and had some problems with her staff. ==2014 U.S. House campaign== In May 2013, Love announced she would run for the U.S. House again in 2014. Love had raised over $475,000 for her campaign. In November 2013, Love spoke about the Tea Party movement and spoke out against shutting down the federal government because of the budget. In December 2013, U.S. Representative Jim Matheson announced that he would not run for re-election. After Matheson's retirement announcement, Love was quickly seen as the front-runner of the election with many seeing the 4th congressional district likely switching from a Democratic district to a Republican one. In early 2014, Love was made a member of the Republican National Committee's National Advisory Council on African-American outreach. In April 2014, Love won the Republican nomination for the 4th congressional district at the Utah Republican Convention, winning 78% of the vote. The Democratic Party nominee was Doug Owens, son of former Democratic U.S. Representative Wayne Owens. In November 2014, Love would beat Owens by more than 7,000 votes. After winning the election, Love told her supporters that many people in Utah thought they \"would never elect a Black, Republican, (Latter-day Saint) woman to Congress\", but was proud to be \"the first to do it\". ==U.S. House of Representatives (2015–2019)== Love was sworn-in on January 3, 2015 as a member of the U.S. House of Representatives and as the first black female Republican member of the U.S. Congress. After being sworn- in, Love was made a member of the House Financial Services Committee. Love also joined the Congressional Black Caucus. While campaigning in 2012, Love had said that if elected, she would \"join the Congressional Black Caucus and try to take that thing apart from the inside out\". She believed that the caucus was a way for Democrats to make racism worse and creating blame on congress. However, Love later became friends with some of the caucus members and changed her feelings about the Congressional Black Caucus. In May 2015, Love was a lead sponsor with Duncan D. Hunter of HR 2518, the Student Right to Know Before You Go Act, which was meant to grow the amount of information universities and colleges must give to students who were applying. In October 2015, Love was asked to be part of a congressional investigation into Planned Parenthood. Two times in 2015, Love repaid the federal government for her travel costs. In April 2016, Love got her first bill through the U.S. House. Bill HR3791, which was approved in a 247–171 vote. It raised limits on how large community banks can grow. Love ran for re-election in 2016 against Democrat Doug Owens once again in the general election. She beat Owens with 54% of the vote, over 12 points ahead of Owens. During the Trump presidency, Love was known for being vocally against him. On October 8, 2016, following the release of a video that showed then-presidential nominee Donald Trump having a lewd conversation about women, Love said that she would not vote for Trump in the presidential election. Love supported the idea of Trump leaving the race for the good of the Republican Party and the country. However, she voted with Trump around 96% of the time during the 115th Congress. In early 2018, Love joined other Utah political leaders in not supporting President Trump's proposed tariffs on steel and aluminum. Even though she spoke out against him during his first term, Love supported former President Trump's 2024 campaign in the 2024 presidential election. During the 2016 election, Love was given about $63,000 in donations from gun lobbyists and was supported by the National Rifle Association. After the Stoneman Douglas High School shooting, Love said she would support raising the minimum age to buy a semiautomatic rifles to age 21. She also said that she was in favor of banning bump stocks and increasing background checks to buy guns. In December 2017, Love proposed the Stop Taxpayers Obligations to Perpetrators of Sexual Harassment Act. It was passed by the U.S. House in February 2018. The bill would stop members of Congress from settling sexual harassment claims with taxpayer money. In March 2018, Love became a supporter of creating federal laws against pyramid schemes. She also supported adding multivitamins to the list of items that could be bought through food stamps. That same year, Love asked the U.S. Department of Education to allow state regulation of student loan providers. In May 2018, Love helped write a defense bill that asked the military to look at how they handled sexual assault accusations. Love also focused on immigration during her time as U.S. Representative. One of the four bills would have stopped the deportation of illegal immigrants who were brought to the United States as children. She worked with Washington U.S. Representative Pramila Jayapal to keep rules that gave spouses of specific visa holders the legal right to work in the United States. That same month, Love's Small Bank Holding Company Relief Act became law. Love was a member of the Congressional Western Caucus and the Climate Solutions Caucus. During Love's 2018 re-election campaign, Democratic Salt Lake County Mayor Ben McAdams ran against her. The election was seen as hard for Love to win as she spoke out against President Donald Trump's immigration plans. The election was seen as a toss-up and competitive. Two polls from October 2018 showed McAdams and Love tied. On Election Day, no one knew who would win because the results were very close. Two weeks later, on November 20, 2018, McAdams officially beat Love by 694 votes. After she lost, President Trump made fun of Love, saying, \"Mia Love gave me no love, and she lost.\" In her speech after losing the election, Love spoke out against Trump by saying that he and others in the Republican Party had not done enough for minority voters. During her time in the 115th Congress, Love missed 71 out of 85 votes on a single weekend. She said she was absent many times because she was caring for a sick child. It was more than any other member of Congress who lost re-election and more than any of the three other members of Utah's congressional delegation. ==After congress== After leaving Congress, Love became a commentator for CNN. She also was a senior fellow to The United States Studies Centre at the University of Sydney. In fall 2020, Love was made a fellow of the Institute of Politics and Public Service at Georgetown University. In the 2020 presidential election, Love voted as an elector. In June 2021, Love joined the Center for Growth and Opportunity at Utah State University as the national outreach director. In August 2021, Love joined a group of conservative guest hosts on the ABC daytime talk show The View for its 25th season, replacing Meghan McCain. In January 2023, Love published a memoir titled Qualified: Finding Your Voice, Leading with Character, and Empowering Others. ==Personal life== Although Love was raised as a Catholic, she joined the Church of Jesus Christ of Latter-day Saints after graduating from college in 1998. Another reason why Love moved to Utah was so that she could be closer to an LDS temple. While in Utah, Love dated Jason Love, whom she met when he was an missionary for the LDS Church in Connecticut. Jason and Mia Love were married in December 1998, four months after their first date. At first, they lived in American Fork, Utah, but later moved to Saratoga Springs. They had three children together: Alessa, Abigale and Peyton. After Love was elected to Congress, she mainly lived and worked in Washington, D.C. while her family continued to work, study and live in Utah. Love used video calling and returned many times to Utah to stay close with her family. ==Illness and death== In February 2022, Love was diagnosed with glioblastoma, a form of brain cancer. Doctors said that she had ten to fifteen months to live. She had surgery, which removed 95% of the tumor. By August 2023, she began an immunotherapy treatment and the tumor began to shrink. On March 1, 2025, Love's daughter announced on social media that the cancer treatments were no longer working, and that she was moved to palliative care. Love died at her home in Saratoga Springs on March 23, 2025 from the cancer at the age of 49. Her casket lied in state at the Utah State Capitol Rotunda on April 6, 2025. Her funeral was held the next day in Salt Lake City. Utah Lieutenant Governor Deidre Henderson gave a eulogy at the funeral. ==Written works== * ==References== ==Other websites== * * * Mia Love Haitian Embassy, Pearls of Excellence Exhibit Category:1975 births Category:2025 deaths Category:United States representatives from Utah Category:American political activists Category:American mayors Category:Politicians from Brooklyn Category:Republican Party (United States) politicians Category:African- American politicians Category:Deaths from glioblastoma Category:American political commentators Category:CNN people Category:People from Norwalk, Connecticut Category:Politicians from Connecticut Category:Cancer deaths in Utah Category:Writers from Connecticut Category:Writers from Utah Category:American academics Category:American autobiographers Category:American Roman Catholics Category:American Latter Day Saints Category:Writers from Brooklyn",
 "title": "Mia Love"
}