{
 "id": "61480",
 "text": "The Monaco Grand Prix (Grand Prix de Monaco) is a Formula One race held each year on the Circuit de Monaco. Run since 1929, it is widely considered to be one of the most important and prestigious automobile races in the world alongside the Indianapolis 500 and the 24 Hours of Le Mans. ==Winners== ===Repeat winners (drivers)=== Drivers in bold are competing in the Formula One championship in the current season. Wins Driver Years won 6 Ayrton Senna 1987, 1989, 1990, 1991, 1992, 1993 5 Graham Hill 1963, 1964, 1965, 1968, 1969 5 Michael Schumacher 1994, 1995, 1997, 1999, 2001 4 Alain Prost 1984, 1985, 1986, 1988 3 Stirling Moss 1956, 1960, 1961 3 Jackie Stewart 1966, 1971, 1973 3 Nico Rosberg 2013, 2014, 2015 3 Lewis Hamilton 2008, 2016, 2019 2 Juan Manuel Fangio 1950, 1957 Maurice Trintignant 1955, 1958 Niki Lauda 1975, 1976 Jody Scheckter 1977, 1979 David Coulthard 2000, 2002 Fernando Alonso 2006, 2007 Mark Webber 2010, 2012 Sebastian Vettel 2011, 2017 Max Verstappen 2021, 2023 ===Repeat winners (constructors)=== Teams in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Wins Constructor Years won Years won 16 McLaren 1984, 1985, 1986, 1988, 1989, 1990, 1991, 1992, 1993, 1998, 2000, 2002, 2005, 2007, 2008, 2025 10 Ferrari 1952, 1955, 1975, 1976, 1979, 1981, 1997, 1999, 2001, 2017 8 Mercedes 1935, 1936, 1937, 2013, 2014, 2015, 2016, 2019 7 Red Bull 2010, 2011, 2012, 2018, 2021, 2022, 2023 Lotus 1960, 1961, 1968, 1969, 1970, 1974, 1987 5 BRM 1963, 1964, 1965, 1966, 1972 4 Bugatti 1929, 1930, 1931, 1933 3 Alfa Romeo 1932, 1934, 1950 Maserati 1948, 1956, 1957 Cooper 1958, 1959, 1962 Tyrrell 1971, 1973, 1978 Williams 1980, 1983, 2003 2 Brabham 1967, 1982 2 Benetton 1994, 1995 2 Renault 2004, 2006 ===Repeat winners (engine manufacturers)=== Manufacturers in bold are competing in the Formula One championship in the current season. A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Wins Manufacturer Years won Years won 15 Mercedes * 1935, 1936, 1937, 1998, 2000, 2002, 2005, 2007, 2008, 2009, 2013, 2014, 2015, 2016, 2019 14 Ford ** 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1977, 1978, 1980, 1982, 1983, 1993, 1994 10 Ferrari 1952, 1955, 1975, 1976, 1979, 1981, 1997, 1999, 2001, 2017 6 Honda 1987, 1988, 1989, 1990, 1991, 1992 Renault 1995, 2004, 2006, 2010, 2011, 2012 5 Climax 1958, 1959, 1960, 1961, 1962 BRM 1963, 1964, 1965, 1966, 1972 4 Bugatti 1929, 1930, 1931, 1933 3 Alfa Romeo 1932, 1934, 1950 Maserati 1948, 1956, 1957 TAG *** 1984, 1985, 1986 * Between 1998 and 2005 built by Ilmor, funded by Mercedes ** Built by Cosworth, funded by Ford *** Built by Porsche ===By year=== A pink background indicates an event which was not part of the Formula One World Championship. A yellow background indicates an event which was part of the pre-war European Championship. Year Driver Constructor Report 1929 William Grover-Williams Bugatti Report 1930 René Dreyfus Bugatti Report 1931 Louis Chiron Bugatti Report 1932 Tazio Nuvolari Alfa Romeo Report 1933 Achille Varzi Bugatti Report 1934 Guy Moll Alfa Romeo Report 1935 Luigi Fagioli Mercedes Report 1936 Rudolf Caracciola Mercedes Report 1937 Manfred von Brauchitsch Mercedes Report 1938 – 1947 Not held 1948 Giuseppe Farina Maserati Report 1949 Not held Juan Manuel Fangio Alfa Romeo Report 1951 Not held 1952 Vittorio Marzotto Ferrari Report 1953 – 1954 Not held Maurice Trintignant Ferrari Report Stirling Moss Maserati Report Juan Manuel Fangio Maserati Report Maurice Trintignant Cooper-Climax Report Jack Brabham Cooper-Climax Report Stirling Moss Lotus-Climax Report Stirling Moss Lotus-Climax Report Bruce McLaren Cooper-Climax Report Graham Hill BRM Report Graham Hill BRM Report Graham Hill BRM Report Jackie Stewart BRM Report Denny Hulme Brabham-Repco Report Graham Hill Lotus-Ford Report Graham Hill Lotus-Ford Report Jochen Rindt Lotus-Ford Report Jackie Stewart Tyrrell-Ford Report Jean-Pierre Beltoise BRM Report Jackie Stewart Tyrrell-Ford Report Ronnie Peterson Lotus-Ford Report Niki Lauda Ferrari Report Niki Lauda Ferrari Report Jody Scheckter Wolf-Ford Report Patrick Depailler Tyrrell-Ford Report Jody Scheckter Ferrari Report Carlos Reutemann Williams-Ford Report Gilles Villeneuve Ferrari Report Riccardo Patrese Brabham-Ford Report Keke Rosberg Williams-Ford Report Alain Prost McLaren-TAG Report Alain Prost McLaren-TAG Report Alain Prost McLaren-TAG Report Ayrton Senna Lotus-Honda Report Alain Prost McLaren-Honda Report Ayrton Senna McLaren-Honda Report Ayrton Senna McLaren-Honda Report Ayrton Senna McLaren-Honda Report Ayrton Senna McLaren- Honda Report Ayrton Senna McLaren-Ford Report Michael Schumacher Benetton-Ford Report Michael Schumacher Benetton-Renault Report Olivier Panis Ligier-Mugen- Honda Report Michael Schumacher Ferrari Report Mika Häkkinen McLaren-Mercedes Report Michael Schumacher Ferrari Report David Coulthard McLaren-Mercedes Report Michael Schumacher Ferrari Report David Coulthard McLaren-Mercedes Report Juan Pablo Montoya Williams-BMW Report Jarno Trulli Renault Report Kimi Räikkönen McLaren-Mercedes Report Fernando Alonso Renault Report Fernando Alonso McLaren-Mercedes Report Lewis Hamilton McLaren-Mercedes Report Jenson Button Brawn-Mercedes Report Mark Webber Red Bull-Renault Report Sebastian Vettel Red Bull-Renault Report Mark Webber Red Bull-Renault Report Nico Rosberg Mercedes Report Nico Rosberg Mercedes Report Nico Rosberg Mercedes Report Lewis Hamilton Mercedes Report Sebastian Vettel Ferrari Report Daniel Ricciardo Red Bull Racing-TAG Heuer Report Lewis Hamilton Mercedes Report 2020 -- Cancelled (COVID-19 pandemic) -- 2021 Max Verstappen Red Bull-Honda 2022 Sergio Perez Red Bull-RBPT 2023 Max Verstappen Red Bull-Honda RBPT 2024 Charles Leclerc Scuderia Ferrari 2025 Lando Norris McLaren-Mercedes == References == Category:Formula One Grands Prix",
 "title": "Monaco Grand Prix"
}