{
 "id": "615280",
 "text": "\"Havana\" is a song by Cuban American singer Camila Cabello, taken from her first solo album, Camila. It is her best-charting lead single since leaving the music group Fifth Harmony. In the song, Cabello sings of her love for the city of Havana, Cuba, and her Cuban heritage. There is a rap by American rapper Young Thug in the song. The official remix features verses from Puerto Rican singer Daddy Yankee. The song has been a success worldwide, reaching the top two in Switzerland, Germany, Austria, France, Belgium, Denmark, and New Zealand, and number one in the United States, Australia, Canada, Spain, and the UK. After spending seven weeks at number two on the US Billboard Hot 100, it was announced that the song reached the top for the week ending January 27, 2018. She became only the third artist in Billboard history to have both their first number-one song and album in the same week, after Beyoncé (2003) and Britney Spears (1999). The song was certified sextuple platinum by the Recording Industry Association of America for sales and streams of six million copies in the United States. ==Charts== ===Weekly charts=== Chart (2017–19) Peak position Argentina (Monitor Latino) 1 Bolivia (Monitor Latino) 5 Brazil Airplay (Billboard Brasil) 1 Bulgaria (PROPHON) 1 Chile (Monitor Latino) 11 Colombia (Monitor Latino) 9 Colombia (National-Report) 8 Costa Rica (Monitor Latino) 3 Croatia (HRT) 2 Dominican Republic (Monitor Latino) 19 Dominican Republic (SODINPRO) 43 Ecuador (National-Report) 7 El Salvador (Monitor Latino) 2 Euro Digital Songs (Billboard) 1 France (SNEP) 1 Greece Digital Songs (Billboard) 1 Guatemala (Monitor Latino) 5 Honduras (Monitor Latino) 5 Iceland (Tonlist) 2 Israel (Media Forest) 1 Japan (Japan Hot 100) 10 Latvia (Latvijas Top 40) 1 Lebanon (Lebanese Top 20) 4 Luxembourg Digital Songs (Billboard) 2 Malaysia (RIM) 2 Mexico (Monitor Latino) 1 Mexico Airplay (Billboard) 1 Nicaragua (Monitor Latino) 9 Panama (Monitor Latino) 3 Paraguay (Monitor Latino) 1 Peru (Monitor Latino) 10 Romania (Airplay 100) Note: User may scroll down the 'Podcasturi' menu to play or download the respective podcast. 1 Serbia (Radiomonitor) 1 Singapore (RIAS) 2 Slovenia (SloTop50) 1 South Korea (Gaon) 6 Uruguay (Monitor Latino) 1 Venezuela (National-Report) 6 Venezuela (Record Report) 54 === Remix single === Daddy Yankee remix Chart (2017) Peak position ===Monthly charts=== Chart (2017) Peak position Brazil Streaming (Pro-Música) 2 ===Year-end charts=== Chart (2017) Position Australia (ARIA) 19 Austria (Ö3 Austria Top 40) 23 Belgium (Ultratop Flanders) 69 Belgium (Ultratop Wallonia) 82 Canada (Canadian Hot 100) 56 Denmark (Tracklisten) 44 France (SNEP) 42 Germany (Official German Charts) 18 Hungary (Dance Top 40) 63 Hungary (Single Top 40) 10 Hungary (Stream Top 40) 16 Israel (Media Forest) 25 Italy (FIMI) 60 Portugal (AFP) 18 South Korea International (Gaon) 36 Netherlands (Dutch Top 40) 34 Netherlands (Single Top 100) 48 New Zealand (Recorded Music NZ) 24 Poland (ZPAV) 58 Spain (PROMUSICAE) 65 Sweden (Sverigetopplistan) 67 Switzerland (Schweizer Hitparade) 44 UK Singles (Official Charts Company) 18 US Billboard Hot 100 96 Chart (2018) Position Argentina (Monitor Latino) 1 Australia (ARIA) 23 Austria (Ö3 Austria Top 40) 38 Belgium (Ultratop Flanders) 11 Belgium (Ultratop Wallonia) 6 Brazil (Crowley Broadcast Analysis) 60 Bulgaria (PROPHON) 3 Canada (Canadian Hot 100) 1 CIS (Tophit) 28 Denmark (Tracklisten) 28 El Salvador (Monitor Latino) 19 Estonia (IFPI) 28 France (SNEP) 9 Germany (Official German Charts) 14 Hungary (Dance Top 40) 1 Hungary (Rádiós Top 40) 1 Hungary (Single Top 40) 4 Ireland (IRMA) 26 Italy (FIMI) 43 Japan (Japan Hot 100) 66 Netherlands (Dutch Top 40) 37 Netherlands (Single Top 100) 25 New Zealand (Recorded Music NZ) 18 Portugal (AFP) 11 Romania (Airplay 100) 13 Russia (Tophit) 68 Slovenia (SloTop50) 4 South Korea (Gaon) 11 South Korea International (Gaon) 1 Spain (PROMUSICAE) 43 Sweden (Sverigetopplistan) 36 Switzerland (Schweizer Hitparade) 6 UK Singles (Official Charts Company) 17 US Billboard Hot 100 4 US Adult Contemporary (Billboard) 8 US Adult Pop Songs (Billboard) 13 US Dance/Mix Show Airplay (Billboard) 9 US Latin Pop Songs (Billboard) 19 US Mainstream Top 40 (Billboard) 9 US Rhythmic (Billboard) 23 Worldwide 1 Chart (2019) Position CIS (Tophit) 185 Hungary (Dance Top 40) 16 Hungary (Rádiós Top 40) 70 Portugal (AFP) 195 Slovenia (SloTop50) 42 South Korea (Gaon) 117 Ukraine Airplay (Tophit) 80 US Adult Contemporary (Billboard) 41 Chart (2020) Position Hungary (Dance Top 40) 76 ===Decade-end charts=== Chart (2010–2019) Position Germany (Official German Charts) 32 UK Singles (Official Charts Company) 37 US Billboard Hot 100 59 ===All-time charts=== Chart (1958–2018) Position US Billboard Hot 100 334 == References == Category:2017 songs Category:Latin pop songs Category:Cuban music Category:Camila Cabello songs",
 "title": "Havana (song)"
}