{
 "id": "615378",
 "text": "Wagyu beef is the beef that comes from the Japanese Wagyu cattle. It is very expensive and regarded as one of the best slices of beef. There is a lot of marbling in the meat, which means that there are streaks of fat within the red meat which makes the meat tenderer and moister, while adding flavor. Sometimes the Wagyu beef is called different things based on where it is from. Some examples include Kobe beef, Matsusaka beef, or Omi beef. There are 9 prefectures that raise Wagyu cattle, Miyazaki Prefecture, Hokkaido, Kagoshima Prefecture, Shiga Prefecture, Miyagi Prefecture, Gifu Prefecture, Kumamoto Prefecture, Hyogo Prefecture, and Kagawa Prefecture. == History == Cattle were brought to Japan from China at the same time as the cultivation of rice, in about the second century AD, in the Yayoi period. Until about the time of the Meiji Restoration in 1868, they were used only as draught animals, in agriculture, forestry, mining and for transport, and as a source of fertilizer. Milk consumption was unknown, and – for cultural and religious reasons – meat was not eaten. Cattle were highly prized and valuable, too expensive for a poor farmer to buy. Japan was effectively isolated from the rest of the world from 1635 until 1854; there was no possibility of the intromission of foreign genes to the cattle population during this time. Between 1868, the year of the Meiji Restoration, and 1887, some foreign cattle were imported. At first, there was little interest in cross-breeding these with the native stock, but from about 1900, it became widespread. It was ceased abruptly in 1910 when it was realized that, while the cross-breeds might be larger and have better dairy qualities, their working capacity and meat quality was lower. From 1919, the various heterogeneous regional populations that resulted from this brief period of cross-breeding were registered and selected as \"Improved Japanese Cattle\". Four separate strains were characterised, based mainly on which type of foreign cattle had most influenced the hybrids, and were recognised as individual breeds in 1944. They are collectively known as wagyū, and are: * The Japanese Black (, kuroge washu), which constitutes over 90% of beef cattle in Japan; regional strains within the breed include the Tottori, Tajima, Shimane and Okayama. * The Japanese Brown or Japanese Red (, akage washu or akaushi), the other main breed, representing about 5% of all beef cattle; reared in southern Japan, in Kōchi Prefecture on Shikoku island, and in Kumamoto Prefecture on Kyushu island. * The Japanese Polled (, mukaku washu), found principally in Yamaguchi Prefecture * The Japanese Shorthorn (, nihon tankaku washu), reared in northern Japan, mainly in Iwate Prefecture; it constitutes less than one percent of all wagyu cattle. In 1997, though, Japan declared the Wagyu breed a living national treasure and placed a ban on exports. ==References== Category:Beef",
 "title": "Wagyu beef"
}