{
 "id": "61541",
 "text": "Sir Robert William \"Bobby\" Robson (18 February 1933 – 31 July 2009) was an English association footballer and football team manager. As a player, he played almost 600 games and scored over 100 goals. He also played for the England national team. He scored four goals in 20 games for them. Robson managed Fulham F.C. and Ipswich Town F.C.. (F.C. means football club). He then managed the England national football team for eight years, from 1982 to 1990. He led England to the semi-finals of the World Cup in 1990. He left England to manage other football teams in Europe. These included clubs from The Netherlands, Portugal and Spain. Robson came back to England to manage Newcastle United F.C. in 1999. Robson was diagnosed with lung cancer in 2007. It was described as terminal. With no hope of recovery, two years later, he died in the year 2009. == Early life == Robson was born on 18 February 1933 in Sacriston, County Durham. He was the fourth of five brothers. As a young child he often went to St James' Park with his father to watch Newcastle United F.C. When he was only 15, Robson played football in a local team of boys aged 18. He became an apprentice electrician while still playing football. In 1950, the Fulham F.C. manager, Bill Dodgin, Sr., visited Robson's home. He offered Robson a contract to play professional football. Robson signed the contract and moved to London. == Playing career == === Club football === Robson played in his first professional football game for Fulham F.C. in 1950. He spent six years at the club before moving to West Bromwich Albion for £25,000. He played for Albion for six years. During that time, he played in nearly 250 games, scoring over 50 goals. Albion said no when Robson asked for a bigger salary, and he moved back to Fulham. Fulham sold some important players after Robson came back to the team. This led Robson to think he would not win any trophies. He left Fulham in 1967 and joined the Vancouver Royals in Canada as both a player and a manager. However, he had to share the management role with someone else. Robson did not like this and moved back to England in 1968. He started to manage Fulham. === International football === Robson was selected for England while at West Bromwich Albion. He played for England in the 1958 FIFA World Cup. He was selected for the 1962 FIFA World Cup. Due to injury in a friendly against Chile, Robson was forced to leave the squad. In total, he played 20 times for his country. == Managerial career == === Early club management === Robson started his career as a manager at Fulham F.C. The team were relegated in his first season there. Robson was sacked the following season. In 1969 he became manager of Ipswich Town F.C. However he won no major competitions or trophies during his first four years in charge. In 1973 Ipswich won the Texaco Cup. Over the next nine seasons in the First Division, only once did Ipswich finish lower than the sixth place. This was the 1977–78 season however the club then went on to win the FA Cup, beating Arsenal F.C. 1–0 at Wembley. Three years later, Robson led Ipswich to victory in the UEFA Cup. The club beat Dutch team AZ Alkmaar 5–4 over two games. Robson moved on to manage the England national football team in 1982. === England national team === Robson managed the England team 95 times, with 47 victories. In the 1986 FIFA World Cup in Mexico, he led the team to the quarter-finals where they lost to Argentina 2–1. Both Argentina goals were scored by Diego Maradona, including the famous \"Hand of God\" goal. Four years later, in the 1990 FIFA World Cup, Robson led England into the semi-finals. This time they lost to West Germany in a penalty shoot-out. After this World Cup, Robson's contract was not extended by the Football Association. === European club management === Robson joined Dutch club P.S.V. Eindhoven in 1990. They won the league in his first two seasons. However, they did not win any European competitions, and in 1992, Robson lost his job. Robson joined Portuguese club Sporting Clube de Portugal in July 1992. He led them to third place in the league in his first season. Defeat in Europe meant Robson lost his job again, in December 1994. He was quickly offered the manager's job by F.C. Porto. He led the team to victory in the Portuguese Cup and they won the league for two seasons in a row. In the summer of 1996, Robson became manager at FC Barcelona. In his short time at the club, he signed Ronaldo and led the club to win the Spanish Cup, Spanish Super Cup and European Cup Winners' Cup. The next season Robson took a more administrative position before going back to the Netherlands to manage P.S.V. Eindhoven for one season. The next year, Robson went back to England to work for the Football Association. Soon after his return, Newcastle United F.C. manager Ruud Gullit left, and Robson took the manager's job at St James' Park. He managed the club until 2004 without winning any major trophies or competitions. === International consultant === On 13 January 2006, Steve Staunton was selected as manager of the Republic of Ireland national team. Robson was named in a support role as \"International Football Consultant\". Because of health problems, Robson left this position on 17 November 2007. == Life outside football == Robson was married to his wife Elsie from 1955 until his death. They had three sons: Andrew, Paul and Mark. === Health === In 1991, Robson was diagnosed with colorectal cancer, from which he recovered the following year. His ill health affected his work. While at Porto, for example, Robson suffered from malignant melanoma. This meant he missed the first months of the 1995–96 season. He had many operations, including one in 2006 for a brain tumour. On 17 October 2006, Robson was given the all-clear. He was set to complete his contract as consultant to the Irish team. In May 2007, he was diagnosed with lung cancer. He died of lung cancer on 31 July 2009 at his Durham home. === Other activities === Robson was in some advertisements, including Carlsberg's \"Best Pub Side\" television advertisement. He also worked on ITV during the 2002 World Cup and the 2004 European Championship. He also wrote a weekly column for The Mail on Sunday. == Honours == Bobby Robson was given several honors for his work in football. In 1990, after his eight years as England manager, he was awarded a CBE. In 2002, he was knighted. Both awards were for services to football. That year he was awarded the freedom of Newcastle upon Tyne. He also received the UEFA President's Award for 'services to football'. He was inducted into the English Football Hall of Fame in 2003. In 2005, Robson was made an Honorary Freeman of Newcastle. Robson said, in his autobiography, it was \"the proudest moment of my life\". Robson also won the 1992 Football Writers' Association Tribute Award for an \"outstanding contribution to the national game\". In 2001 he was awarded the British Sports Writers' Association Pat Besford Trophy for Outstanding Achievement. In 2005, he received a lifetime achievement award from the Sports Coach UK Awards. He also received the Eircom International Personality of the Year in 2006. On 9 December 2007, Robson received the BBC Sports Personality of the Year Lifetime Achievement Award. In May 2008 was the 30th anniversary celebrations of Ipswich Town's 1978 FA Cup win. During this, Robson was granted the Freedom of Ipswich by the Lady Mayor. On 8 December 2008, he was given the Freedom of the City of Durham. == Career statistics == === Club === Appearances and goals by club, season and competition Club Season League National Cup League Cup Total Division Apps Goals Apps Goals Apps Goals Apps Goals Fulham 1950–51 First Division 1 0 — — 1 0 1951–52 First Division 16 3 — — 16 3 1952–53 Second Division 35 19 1 0 — 36 19 1953–54 Second Division 33 13 1 1 — 34 14 1954–55 Second Division 42 23 1 0 — 43 23 1955–56 Second Division 25 10 2 0 — 27 10 Total 152 68 5 1 0 0 157 69 West Bromwich Albion 1955–56 First Division 10 1 — — 10 1 1956–57 First Division 39 12 2 1 — 41 13 1957–58 First Division 41 24 7 3 — 48 27 1958–59 First Division 29 4 1 1 — 30 5 1959–60 First Division 41 6 3 0 — 44 6 1960–61 First Division 40 5 1 0 — 41 5 1961–62 First Division 39 4 4 0 — 43 4 Total 239 56 18 5 — 257 61 Fulham 1962–63 First Division 34 1 2 1 2 0 38 2 1963–64 First Division 39 1 2 0 1 0 42 1 1964–65 First Division 42 1 2 0 3 1 47 2 1965–66 First Division 36 6 — 3 0 39 6 1966–67 First Division 41 0 3 0 3 0 47 0 Total 192 9 9 1 12 1 213 11 Vancouver Royals 1967 North American Soccer League — — — — 1968 North American Soccer League — — — — Career total 583 133 32 7 12 1 627 141 === International === Appearances and goals by national team and year National team Year Apps Goals England 1957 1 2 1958 4 0 1960 6 0 1961 8 2 1962 1 0 Total 20 4 :Scores and results list England's goal tally first, score column indicates score after each Robson goal. List of international goals scored by Bobby Robson No. Date Venue Opponent Score Result Competition 1 27 November 1957 Wembley Stadium, London, England 2–0 4–0 Friendly 2 4–0 3 15 April 1961 Wembley Stadium, London, England 1–0 9–3 1961 British Home Championship 4 10 May 1961 Wembley Stadium, London, England 3–0 8–0 Friendly == Managerial statistics == Managerial record by team and tenure Team Nat From To Record Record Record Record Record Team Nat From To G W D L Win % January 1968 November 1968 Ipswich Town 13 January 1969 18 August 1982 England July 1982 July 1990 PSV Eindhoven July 1990 June 1992 Sporting CP 1 July 1992 7 December 1993 Porto 30 January 1994 13 July 1996 Barcelona May 1996 June 1997 PSV Eindhoven July 1998 June 1999 Newcastle United 2 September 1999 30 August 2004 Total ==Honours== === Player === England * British Home Championship: 1960–61 === Manager === Ipswich Town * UEFA Cup: 1980–81 * FA Cup: 1977–78 * National Fives Tournament: 1977 * Texaco Cup: 1972–73 PSV Eindhoven * Eredivisie: 1990–91, 1991–92 * Johan Cruyff Shield: 1998 Porto * Primeira Divisão: 1994–95, 1995–96 * Taça de Portugal: 1993–94 * Supertaça Cândido de Oliveira: 1994 Barcelona * Copa del Rey: 1996–97 * Supercopa de España: 1996 * European Cup Winners' Cup: 1996–97 Newcastle United * UEFA Intertoto Cup runners-up: 2001 England * British Home Championship: 1982–83 * Rous Cup: 1986, 1988, 1988 Individual * FWA Tribute Award: 1992 * European Manager of the Year: 1996–97 * Premier League Manager of the Month: February 2000, August 2000, December 2001, February 2002, January 2003, October 2003 * BSWA Pat Besford Trophy: 2001 * UEFA President's Award: 2002 * LMA Special Merit Award: 2002 * English Football Hall of Fame Inductee: 2003 * PFA Merit Award: 2003 * FAI International Football Awards – International Personality: 2006 * BBC Sports Personality of the Year Lifetime Achievement Award: 2007 * FIFA Fair Play Award: 2009 * FIFA Order of Merit: 2009 * UEFA Order of Merit: 2009 * Ipswich Town Hall of Fame: Inductee 2009Hall of Fame inductees TWTD == Further reading == * Time On The Grass, Bobby Robson, (Arthur Barker 1982), . * Bobby Robson: An Autobiography, Bobby Robson, (Hutchinson 1990), . * Football Against the Enemy, (Chapter 11), Simon Kuper, (Orion Publishing Group 1996), . * High Noon: A Year at Barcelona, Steve Dickson, (Virgin Books 1997), . * Bobby Robson: An Englishman Abroad, Bobby Robson with Bob Harris, (Macmillan Publishers 1998), . * Sir Bobby Robson: Living the Game, Bob Harris, (Weidenfeld & Nicolson 2004), . == References == Category:1933 births Category:2009 deaths Category:British autobiographers Category:Cancer deaths in England Category:Commanders of the Order of the British Empire Category:Deaths from lung cancer Category:England national football team managers Category:English football managers Category:English footballers Category:Knights Bachelor Category:Sportspeople from County Durham Category:Eredivisie managers Category:FC Barcelona managers Category:Fulham F.C. players Category:England at the 1958 FIFA World Cup Category:England at the 1962 FIFA World Cup Category:England at the 1986 FIFA World Cup Category:England at UEFA Euro 1988 Category:England at the 1990 FIFA World Cup Category:West Bromwich Albion F.C. players Category:1958 FIFA World Cup players Category:1962 FIFA World Cup players",
 "title": "Bobby Robson"
}