{
 "id": "615691",
 "text": "Bokul Kotha () is an Popular Indian Bengali television soap opera that Premiered on 4th December 2017 and airs on Zee Bangla and Telecast Monday To Saturday at 9:00 P.M. The Show Stars Ushashi Roy and Honey Bafna in Lead roles. The Show telecast Monday to Saturday at 9:00 P.M. Bokul Kotha took the timeslot of Bikele Bhorer Phool.It is one of the Most Popular Serial Running in this period. In June 2018 it had a TRP of 11.2.The Show is one of the Bengali highest ranking serial in trp ratings. ==Plot== Bokul Kotha is the story of Bokul, who has been raised as a son. She grows up to be a tomboy, well versed in handling roles that are reserved for the boys. Bokul has short hair and feels comfortable wearing pants and shirts, unlike girls her age who obsess with their beauty. Bokul doesn't want to waste her time on make –up and clothes. She is more interested to become her father’s support system. But a cruel twist in the tale comes in when her father passes away after which she is forced to take the reign of the family in her hands. Though Bokul is not interested in marriage, her mother and grandmother are always worried about what would happen in future when she would be married off. On the other hand, is Rishi, whose family does everything only after consulting the family guru, an astrologer. Rishi was to be married only if his natal chart matched the girl’s. Being a choosy person, Rishi has already rejected 40 women. As luck would have it, finally his natal charts match with Bokul’s charts. After much drama and confusion, the mismatched couple is married off. But Bokul is neither cut out as an ideal housewife nor is keen to learn the ways of the world as a married woman should. ==Cast== * Ushashi Roy as Bokul /Main Female Lead * Sohini Sanyal / Sanjukta Roy Chowdhary / Sohini Sanyal as Bokul's Mother:Lajbonti * Honey Bafna as Rishi/Main Male lead * Sumanta Mukherjee as Shekhar * Saswati Guhathakurata as Anjali * Anuradha Roy as Bokul's Grandmother (Gayatri) * Mallika Majumdar as Rishi's Aunt * Arindam Banerjee as Samar (Rishi's Uncle) * Amrita Debnath as Esha * Uponita Banerjee as Barsha * Subhrajit Dutta as Rohan (Rishi's Brother) * Arpita Mukherjee as Aditi (Rishi’s sister-in-law) * Suvajit Kar as Kunal * Saurav Chatterjee as Saurav (Rishi's Brother-in law) * Pritha Chatterjee as Pritha * Shreyasee Samanta as Roshni (Antagonist) * Arnab Chowdhury as Deep (Rishi's friend) ==References== * http://www.newstechcafe.com/2017/12/bokul-kotha-on-zee-bangla-tv- plot.html#axzz52SrbmNOy ==Other websites== * Official Site Category:2017 Indian television series debuts",
 "title": "Bokul Kotha"
}