{
 "id": "615937",
 "text": "Ei Chheleta Bhelbheleta (); was a popular Bengali television Soap Opera that premiered on March 28, 2016 and aired on Zee Bangla. Produced by Magic Moments Motion Pictures, it started Prapti Chatterjee and Somraj Maity in lead roles, Nabanita Malakar in a negative role and Sabitri Chatterjee, Anusuya Majumdar, Shankar Chakraborty and Bharat Kaul in supporting roles. The show Got replaced by a Mythology show Karunamoyee Rani Rashmoni. == Plot summary == The show's unique name has been taken from common Bengali childhood rhyme. It truly captures the free-spirited love and chemistry between the protagonists - Abir and Shaluk. Life takes a turn when introvert city-bred boy 'Abir' meets the vivacious village girl 'Shaluk'. Their unusual friendship clicks in an instant and soon a sweet innocent chemistry develops between the two. Soon they realize their feelings towards each other. Thus, starts the story of their 'first love'. 'Eii Chhele Ta Bhelbhele Ta' is a tale of love, which follows the protagonists through myriad of situations and sees them unite against all odds. The story showcases a pure love story between two teenagers and how their love matures over time and rises above the different obstacles of life. The show however has a lot of exist undertones too. The lead female character Shaluk is characterized as an all virtuous young lady without any faults .The writers and producers of the show, portray female lead characters idealistically instead of celebrating their faults as part of normal human nature. The supporting characters on the other hand are extremely blatant and malleable. They never show any strong or original viewpoints, as if the only reason for their casting is to complete a joint Bengali family. The male lead Abir is a polygamist and also narcissistic. He is a postgraduate student in Physics(it remains to be seen how that is possible because he is really stupid); without any source of income while staying in his parents house and without even trying is able to seduce two women to marry him. This is either because the women married him for the family heirloom or testimony to the dystopian mindset of the writers. == Cast == * Prapti Chatterjee as Shaluk {Main Female Lead} * Somraj Maity as Abir {Main Male Lead} * Nabanita Malakar as Aishwarya / Mimi {Main Antagonist} (Jailed) * Sabitri Chatterjee as Shaluk's Grandmother {Parallel Female Lead} * Anusuya Majumdar as Jaan {Parallel Female Lead} * Rita Dutta Chakraborty as Shaluk's Aunt * Shankar Chakraborty as Abir's Father * Bharat Kaul as Abinash Sen * Ritoja Majumder as Sonali {Antagonist} * Rajasree Bhowmik as Kamalini * Sujata Dawn / Suchismita Chowdhury as Nilanjana {Antagonist} * Surajit Banerjee as Pupe's Father * Diganta Bagchi as Choton * Samata Das as Choton's wife * Ayesha Bhattacharya as Pupe {Antagonist} * Debjani Chakraborty as Nodi/Ranga Dii * Debolina Mukherjee as Dighi/Ful Dii Category:2016 Indian television series debuts Category:2017 Indian television series endings",
 "title": "Ei Chheleta Bhelbheleta"
}