{
 "id": "616298",
 "text": "Óscar Alberto Pérez (7 April 1981 – 15 January 2018) was a Venezuelan political activist and CICPC investigator, Venezuela's investigative agency. He was a harsh critic of president Maduro's rule in Venezuela politics. He started to be a rebel (as he was defined by the NYTimes) against Maduro since the mid 2010. ==Data== He was born in Caracas in 1981 and since young he was an activist in the Venezuela politics. He did not like the \"Chavism\" since the early 2010s, when president Chavez started to show full alliance with Castro's Cuba. Óscar Pérez was better known for being responsible for the 2017 Caracas helicopter attack during the 2017 Venezuelan protests and the 2017 Venezuelan constitutional crisis. On 15 January 2018, the Venezuelan army and the Venezuelan National Guard launched an operation to capture Óscar Pérez, who was held up in the western Caracas neighborhood of El Junquito. Pérez resisted the attack. After three hours of shooting, Pérez wanted to surrender but he was shot dead along with his men. His death was confirmed by the Venezuelan police one day later. ==Worldwide reactions to his death== The international media and some politicians & citizens all over the world defined what has happened in El Junquito as a «massacre»» and did harsh critics to Maduro & his government. Some of the countries were: Bolivia, Brasil,Partido Novo - ed. Partido NovoEduardo Bolsonaro fala sobre a morte de Óscar Pérez pela Ditadura da Venezuela, by Bolsonaro, EduardoDelegado Francischini, Fernando Colombia, with critics from ex-president Andrés Pastrana,[url=http://sumarium.com/grupo- de-masones-de-ecuador-repudia-asesinato-de-su-hermano-oscar-perez/ Grupo de Masones de Ecuador repudia asesinato de su “hermano” Óscar Pérez]Acorralado y herido, piloto Óscar Perez denuncia en vivo que régimen de Maduro lo quiere matar USA, with senator Marco Rubio angry comments, Guatemala,Álvares, Gloria Paraguay, Uruguay, SpainEl Pais: La Masacre de El JunquitoLisbeth Ramírez murió junto a su novio Jairo Lugo durante el operativo policial contra Óscar Perez and France. Additionally, the main media in Italy (Corriere della Sera, La Stampa, Repubblica, Il Giornale, etc..) for a full week showed in first page the El Junquito massacre news. ==Related pages== * Nicolás Maduro * Venezuela ==References== Category:1981 births Category:2018 deaths Category:Assassinated people Category:Deaths by firearm Category:Political activists Category:Terrorists Category:People from Caracas Category:Venezuelan activists",
 "title": "Óscar Pérez"
}