{
 "id": "617192",
 "text": "{{Infobox writer | name = David Henry Halford Coventry | birth_date = | birth_place = Wellington, New Zealand | nationality = New Zealand | genre = Literary Fiction | awards = Hubert Church Award for Fiction | years_active = 2010 - | website = }} David Henry Halford Coventry (born 2 October 1969) was born in Wellington, New Zealand and is an author and musician. His first novel, The Invisible Mile (2015), was the winner of the 2016 Hubert Church Award for Fiction, and finalist for both the Ockham New Zealand Book Award and the Sports Book Awards in the United Kingdom. His work has been compared to Don DeLillo, Toni Morrisson, Thomas Mann. == Education == Coventry went to the Hutt Valley High School from 1983 to 1986. He then studied at the Victoria University of Wellington, for a degree in English Literature and Religious Studies, and a Honours Degree in English Literature (2001) and a Masters in Creative Writing from the International Institute of Modern Letters (2010). He lives in Wellington, New Zealand. ==The Invisible Mile== His novel, The Invisible Mile, is set during the 1928 Tour de France. It was described in the Sydney Morning Herald as its pick of the week: \"David Coventry's poetic odyssey relates ... with symbolic force and poetic finesse.\" The New York Times included it in its book of the week section. David Coventry is among the best New Zealand authors. In an interview Coventry said: \"The book is not trying to be a metaphor for the war, but for remembering the war.\" The novel creates its own legends around the riders and pays homage to ancestral competitors. == Awards and appearances == Coventry was the 2015 winner of the Todd New Writer's Bursary. He was a guest at the 2016 Edinburgh International Book Festival, the International Festival of Authors in Toronto (2017), the New Zealand Festival's Writer's Week (2016), the Auckland Writers Festival (2016), and the Nelson Arts Festival (2016). == Music == As a sound engineer he has produced works for the experimental groups Thela, La Gloria and Empirical He also played in the groups La Gloria and Empirical. == References == == Other websites == * * Category:1969 births Category:New Zealand writers Category:Living people",
 "title": "David Coventry"
}