{
 "id": "617220",
 "text": "Ohanna Shivanand (born Shilpa Anand, 10 December 1982) is an Indian model, television and movie actress, who has appeared in Tamil,Telugu,Kannada and Hindi movies and worked in many commercials as a model. She is best known for her roles as Dr. Riddhima Gupta in the serial Dill Mill Gayye opposite Karan Singh Grover She also played the role of Dr. Shilpa Malhotra in Dill Mill Gayye on fans demand. she was born on 10 December 1982 in South Africa and did her schooling there. Her parents were from India, and Later she moved there with her family. In 2015 she changed her name to Ohanna Shivanand. She is the younger sister of Sakshi Shivanand, who is an actress from South India. She studied at Punjab University, obtaining a master's degree in Computer Applications (MCA), from 2000 to 2003. She worked as a software developer for five years, with Java J2EE application development and E-Learning. ==Filmography== Key Denotes movies that have not yet been released Year Movie Role Language Source 1995 Vishnu (1995 movie) Herself (Special Appearance) Tamil 2002 Bezawada Police Station Shilpa (Main Lead) Telugu 2003 Vishnu The He Man Vaishnavi/Vedika (Main Lead) Telugu 2004 Sarvabhouma Anju (Main Lead) Kannada 2006 Iqraar by Chance Rashmi Mehra (Main Lead) Hindi 2010 Deewane Ho Gaye Ruchi (Main Lead) Hindi 2011 Alert 24x7 Journalist (Second Lead) Hindi 2013 Bloody Isshq Radhika (Main Lead) Hindi 2016 Ye Hai Lollipop Namita (Main Lead) Hindi ==TV Shows== Year Show Role Channel Co-stars Source 2007–2008 Dill Mill Gayye Dr. Riddhima Gupta Star One Karan Singh Grover 2010 Dill Mill Gayye Dr. Shilpa Malhotra Star One Karan Singh Grover 2012 Teri Meri Love Stories Meera Star Plus Viraf Patel ==Guest appearance== Year Show Role Channel Co-stars Source 2015 Mahisagar Herself (cameo) BIG Magic Dharti Bhatt, Anuj Thakur, Vandana Pathak ==Advertisements== Source * Coca-Cola with Aamir Khan * Sunsilk * Mrs Marino (hair softner) * Bajaj Bramhi Amla Hair Oil * Nerolac Paints with Amitabh Bachchan * Dabur Pudin Hara with Amitabh Bachchan * New York Life Insurance * Pizza Hut * Nirma * Fair Look * Gold Bindya * Chick Talc * Moov * Lux with Aishwarya Rai Bachchan * Vasmol Kesh Kala * Kisna Diamond Jewellery ==Music videos== Year Song Language Singer Co-Starring Source 2002 Gol Gol Akh Panjabi Hans Raj Hans Ashish Chaudhary 2007 Kuch der tak Hindi Hariharan Ayaz Khan 2014 Kachichiyan Panjabi Savvy Sandhu Paras Arora, Zuber Kamaal Khan 2014 Khwaishein Hindi Shael Oswal Shael Oswal 2016 Over Under Panjabi Tarsem Jassar Tarsem Jassar ==Awards and nominations== Anand was nominated at several Awards ceremonies in 'Best Actress' category for her role Dr. Riddhima Gupta in the show Dill Mill Gayye such as New Talent Awards in 2008. She won the award alongside Karan Singh Grover for the best on-screen couple in August 2008. == References == ==Other websites== * * Shilpa Anand at Bollywood Hungama Category:Living people Category:1982 births Category:Indian actors",
 "title": "Shilpa Anand"
}