{
 "id": "61731",
 "text": "The Holy See (Latin: Sancta Sedes, \"holy seat\") is the the governing body of the Roman Catholic Church and Vatican City State, with the Pope as its head. It consists of the Pope and the Roman Curia. It is metonymically called as \"the Vatican\". Every episcopal see is seen as holy and the Eastern Orthodox Church calls all of its sees \"holy\" or \"sacred\" (). \"The Holy See\" (definite singular) usually refers to the see of Rome, which is also called \"the Apostolic See\". While \"Apostolic See\" can refer to any see founded by any of the Apostles, the term is in this case refers to the see of the bishop seen as successor of Saint Peter, one of the Apostles. Aside from Rome, the archiepiscopal See of Mainz, which was also of electoral and primatial rank, is the only other Western see that bears the title of \"Holy See\", although this usage is less common. == Organization of the Holy See == The Pope governs the Church and Vatican City Statethrough the Roman Curia. The Roman Curia consists of the Secretariat of State, nine Congregations, three Tribunals, eleven Pontifical Councils, and an assortment of religious and government offices that conduct church and country affairs at the highest level. The Secretariat of State, under the Cardinal Secretary of State, leads and supervises the Curia. The current Secretariat of State, Tarcisio Cardinal Bertone, acts as the Holy See's prime minister. Archbishop Dominique Mamberti, Secretary of the Section for Relations With States of the Secretariat of State acts as the Holy See's foreign minister. Bertone and Mamberti were chosen to hold these positions by Pope Benedict XVI in September 2006. Among the most active of the major Curial institutions are the Congregation for the Doctrine of the Faith, which oversees church doctrine; the Congregation for Bishops, which coordinates the appointment of bishops or archbishops worldwide; the Congregation for the Evangelization of Peoples, which oversees all missionary activities; and the Pontifical Council for Justice and Peace, manages international peace and social issues. === International organizations === The Holy See is active in international organizations and is a member of the following groups: *International Grains Council (IGC) *International Committee for Military Medicine (ICMM) *International Atomic Energy Agency (IAEA) *International Telecommunication Union (ITU) *International Telecommunications Satellite Organization (ITSO) *Organization for the Prohibition of Chemical Weapons (OPCW) *Organization for Security and Cooperation in Europe (OSCE) *Preparatory Commission for the Comprehensive Test Ban Treaty Organization (CTBTO)* *Universal Postal Union (UPU), International Institute for the Unification of Private Law (UNIDROIT) *United Nations High Commissioner for Refugees (UNHCR) *United Nations Conference on Trade and Development (UNCTAD) *World Intellectual Property Organization (WIPO) *Note: In 1971, the Holy See announced the decision to adhere to the nuclear Non-Proliferation Treaty in order to \"give its moral support to the principles that form the base of the treaty itself.\" The Holy See is also a permanent observer of the following groups: *International Organization for Migration (IOM) *International Labour Organization (ILO) *International Fund for Agricultural Development (IFAD) *Latin Union (LU) *Organization of American States (OAS) in Washington *Organization of African Unity (OAU) *United Nations* *United Nations Educational, Scientific and Cultural Organization (UNESCO) *United Nations Environment Programme (UNEP) *United Nations Drug Control Programme (UNDCP) *United Nations Centre for Human Settlements (UNCHS) *United Nations Food and Agriculture Organization (FAO) *World Tourism Organization (WToO) *World Trade Organization (WTO) *World Health Organization (WHO) *World Food Programme (WFP) *Note: the Holy See is a permanent observer in the United Nations and, in July 2004, gained all the rights of full membership except voting. According to Archbishop Celestino Migliore, Holy See Permanent Observer, \"We have no vote because this is our choice.\" He added that the Holy See considers that its current status \"is a fundamental step that does not close any path for the future. The Holy See has the requirements defined by the UN statute to be a member state and, if in the future it wished to be so, this resolution would not impede it from requesting it.\" The Holy See is an observer on an informal basis of the following groups: *Asian-African Legal Consultative Committee (AALCC) *International Strategy for Disaster Reduction (ISDR) *International Maritime Organization (IMO) *International Civil Aviation Organization (ICAO) *United Nations Committee of Peaceful Use of Outer Space (UNCOPUOS) *World Meteorological Organization in Geneva (WMO) The Holy See has a delegation to the Arab League in Cairo. It is also a guest of honor to the Parliamentary Assembly of the Organization for Security and Cooperation in Europe. The Holy See, not the Vatican City, maintains diplomatic relations with states (such as with the United Kingdom), and participates in international organizations.Bilateral and Multilateral Relations of the Holy See Foreign embassies are accredited to the Holy See, not to the Vatican City, and it is the Holy See that governs Vatican City and establishes treaties and concordats with other sovereign entities. When necessary, the Holy See will enter a treaty on behalf of the Vatican City. Under the Lateran Treaty, the Holy See has extraterritorial authority over 23 sites in Rome and five Italian sites outside of Rome, including the Pontifical Palace at Castel Gandolfo. The same authority is granted by international law to the Apostolic Nunciature of the Holy See in a foreign country. ==Related pages== * Ustaše * Fascism * Inquisition * Fascist Italy * Anglicanism * Antisemitism * Dreyfus Affair * Protestantism ** Five solas *** Sola fide *** Sola gratia *** Sola scriptura *** Solus Christus *** Soli Deo Gloria * Supersessionism * East-West Schism * Eastern Christianity * Protestant Reformation * European wars of religion * Independent State of Croatia * Provisional Irish Republican Army * The Protocols of the Elders of Zion * Native Americans in the United States ==Notes== == References == == Other websites == === Holy See === * The Holy See Website * Primacy of the Apostolic See * CIA World Factbook on Holy See * Vatican City * The Holy See in the course of time, from an Orthodox perspective === Foreign diplomatic missions === * British Embassy to the Holy See * Canadian Embassy to the Holy See * Australian Embassy in The Holy See * United States Embassy to the Holy See * The Embassy of the Czech Republic at the Holy See in Vatican * Permanent Observer Mission of the Holy See to the United Nations === Further reading === * The Catholic Church * The Secret of the Inquisition * 12 Anti-Semitic Radical Traditionalist Catholic Groups * Antisemitism in History: From the Early Church to 1400 * Our Lady reconsidered: John Knox and the Virgin Mary * Foundations of Holocaust: From Inquisition to “Purity of Blood” * Does the Vatican Have the Ancient Jerusalem Temple Menorah? * Is there new evidence of Jewish Temple treasures in the Vatican? * The Ustaše and the Roman Catholic Church in the Independent State of Croatia * The Roman Catholic Church, the Holocaust, and the demonization of the Jews – Response to “Benjamin and us: Christanity, its Jews, and history” by Jeanne Favret-Saada * Between Venus and Mars, the Church of Rome Chooses Both - The Holy See’s geopolitics analyzed in the light of the dominant doctrines Category:Popes Category:Vatican City Category:Government by country",
 "title": "Holy See"
}