{
 "id": "617341",
 "text": "Ferdinand de Saussure (26 November 1857 – 22 February 1913) is considered a founding father of modern day linguistics and semiotics. Semiotics is the study of how we attach meaning to the world around us and how we communicate that meaning to others. ==Relevant Historical Events== 1857- Saussure was born in Geneva, Switzerland. 1870s- Saussure studied Sanskrit, Latin and Ancient Greek at the University of Geneva. 1876-1880- Saussure studies historical linguistics in the German cities of Leipzig and Berlin. 1880- Saussure received his doctorate in Leipzig. He moved to Paris to become a professor in historical linguistics. 1891- Saussure accepted the title of “Chevalier of the Legion of Honor” after teaching for 11 years in Paris, at the École Pratique des Hautes Études. He returned to Geneva, accepting a job as a professor. 1907-1911- For three years in a row, Saussure holds a lecture series about general linguistics. 1913- Saussure dies. 1916- Saussure’s students put together notes from the lectures and publish them in a book called Cours de linguistique générale or Course on General Linguistics Saussure was a professor in historical linguistics, which is concerned with how languages relate to each other and how they change over time. This interest in how language changes over time can be called diachrony. Saussure was more interested in synchrony, which doesn’t change over time. This means he looked at the parts of a language, as if they didn’t change. Saussure studied the structure of language without comparing it to other languages and without focusing on change. Saussure distinguished two different parts of language, langue and parole. Langue is the system of the language or the theory of the language. When we learn a language in school we are learning the “langue” of the language: vocabulary words, grammatical structures, the order of words, etc. Parole is how the language is actually spoken. Often times, people speak in a way that is different from how language is taught in schools. We make mistakes, use slang words, and use figurative language. This is all part of parole. Saussure was more interested in studying the langue of a language. Parole was harder to study because the language people speak changes often. Studying the langue allowed Saussure to understand the basic structure of language. Saussure wanted to know how people communicate language with each other. In his “Course in General Linguistics”, Saussure first defines language and how it is involved in speech. ==Defining Language== Many different factors work together to create language. # The first relationship is between the sounds we make and the way we make these sounds. The sounds of letters and combinations of letters are called acoustical impressions. The way we use our vocal cords, the muscles in our mouth, and our tongue to produce these sounds is called oral articulation. Therefore, the first relationship that contributes to language is between acoustical impressions and oral articulation. Together these make up the “signifier”, or the specific words and pronunciations we use. # The second relationship is between the signifier and the meaning that we attach to it. This meaning is called the “signified”. A signifier and the signified combine to make a linguistic sign, which Saussure also calls a “complex physiological-psychological unit”. # The third relationship is when an individual starts using linguistic signs with other individuals. This discourse is speech and previously mentioned as “parole” # The fourth relationship looks at the evolution of language and is the concern of historical linguistics. To summarize, Saussure describes language as our ability to represent meaning by using signs (the words themselves and the way they sound when spoken). In the process of communicating with another individual, language can be found in the process of taking meaning from the words that we hear (which make up an “auditory image”). This process is psychological, while producing signs is the physiological process of speech. To study language, we focus on the psychological process. Language is studied apart from speech. It does not exist among one person but among the community of people that use it. Each member of the community shares a knowledge of the language but cannot change the system of the language individually. Language as a stable system can be studied scientifically, which is the goal of linguistics. Saussure also focuses on the arbitrary nature of signs.This means that a word and the sounds that make up a word don’t tell us anything about word means. For example, the word “dog” doesn’t tell us about what a dog is. The letters and sounds chosen are not special. Most words are chosen in this way. A small amount of words are not. For example in the word “slap”, the letters sound like the noise you hear when you slap something. The arbitrary nature of sounds allows us to make many words. If every letter had a single meaning, then we could only create a small number of words with that letter. ==References== Category:Linguists Category:1857 births Category:1913 deaths Category:People from Geneva Category:Swiss academics",
 "title": "Ferdinand de Saussure"
}