{
 "id": "617355",
 "text": "Spinosauridae (meaning 'spined lizards') is a family of carnivorous theropod dinosaurs from the Jurassic and Cretaceous periods. They are unique among other meat-eating dinosaurs from their more water-based lifestyle, which involved a diet of mostly fish. Spinosaurid fossils have been found all over the world, including Asia, South America, Europe and Africa == Description == Spinosaurids had longer arms than most theropods, the claw on the first finger was usually the largest. They evolved jaws like those of crocodiles, and their teeth were long and cone-shaped, made to trap prey in their mouths instead of tearing them apart. Because of this, their teeth usually did not have the strong knife-like edges (called serrations) of a lot of other meat-eating dinosaurs.Sereno, Paul C., Allison L. Beck, Didier B. Dutheil, Boubacar Gado, Hans C. E. Larsson, Gabrielle H. Lyon, Jonathan D. Marcot, et al. 1998. “A Long-Snouted Predatory Dinosaur from Africa and the Evolution of Spinosaurids.” Science 282 (5392): 1298–1302. doi:10.1126/science.282.5392.1298.Rayfield, Emily J. 2011. “Structural Performance of Tetanuran Theropod Skulls, with Emphasis on the Megalosauridae, Spinosauridae and Carcharodontosauridae.” Special Papers in Palaeontology 86 (November). https://www.researchgate.net/publication/250916680_Structural_performance_of_tetanuran_theropod_skulls_with_emphasis_on_the_Megalosauridae_Spinosauridae_and_Carcharodontosauridae. The family contains Spinosaurus, the first spinosaurid discovered, and the largest carnivorous dinosaur we know of. Paleontologists suggest it might have reached up to 15 meters (49 ft.) in length. Supplementary Information == Paleobiology == A study made in 2010 by Roman Amiot and his colleagues found that spinosaurids had very semiaquatic (living partly in water, and partly on land) lifestyles, this means they lived in habitats like those of hippopotamuses, crocodiles, and turtles, making them very unusual compared to other theropods. It also means they could exist at the same time and place as other large predators without competing for food. For example; Carcharodontosaurus, which lived at the same time as Sigilmassasaurus and Spinosaurus, did not need to fight with either of those animals for prey; those spinosaurids ate fish, while Carcharodontosaurus was on land most of the time, hunting smaller dinosaurs. == Classification == The family \"Spinosauridae\" was named by the German paleontologist Ernst Stromer in 1915, he was the one that discovered the first genus in the group, Spinosaurus. And as scientists discovered more fossils of its close relatives, the family was eventually split into two subfamilies: Baryonychinae, and Spinosaurinae. This was done because of differences in the anatomy of their skulls and teeth. This is a cladogram made in 2017 showing the relationships between different spinosaurids inside of megalosauroidea. == References == == Other websites == * Spinosauridae * Spinosauridae on the Theropod Database Category:Spinosauridae",
 "title": "Spinosauridae"
}